Repository: yeager/python-docs-sv
Catalog: faq/design.po
Languages: sv

source: Python lambda expressions cannot contain statements because Python's syntactic framework can't handle statements nested inside expressions. However, in Python, this is not a serious problem. Unlike lambda forms in other languages, where they add functionality, Python lambdas are only a shorthand notation if you're too lazy to define a function.
sv: Lambdauttryck i Python kan inte innehålla satser eftersom Pythons syntaktiska ramverk inte kan hantera satser som är kapslade i uttryck. I Python är detta dock inte ett allvarligt problem. Till skillnad från lambda-former i andra språk, där de lägger till funktionalitet, är Python-lambdas bara en kortfattad notation om du är för lat för att definiera en funktion.

source: Functions are already first class objects in Python, and can be declared in a local scope. Therefore the only advantage of using a lambda instead of a locally defined function is that you don't need to invent a name for the function -- but that's just a local variable to which the function object (which is exactly the same type of object that a lambda expression yields) is assigned!
sv: Funktioner är redan förstaklassobjekt i Python och kan deklareras i ett lokalt scope. Därför är den enda fördelen med att använda en lambda istället för en lokalt definierad funktion att du inte behöver hitta på ett namn för funktionen - men det är bara en lokal variabel som funktionsobjektet (som är exakt samma typ av objekt som ett lambdauttryck ger) tilldelas!

source: Can Python be compiled to machine code, C or some other language?
sv: Kan Python kompileras till maskinkod, C eller något annat språk?

source: `Cython <https://cython.org/>`_ compiles a modified version of Python with optional annotations into C extensions. `Nuitka <https://nuitka.net/>`_ is an up-and-coming compiler of Python into C++ code, aiming to support the full Python language.
sv: `Cython <https://cython.org/>`_ kompilerar en modifierad version av Python med valfria anteckningar till C-tillägg. `Nuitka <https://nuitka.net/>`_ är en kommande kompilator av Python till C++-kod, med målet att stödja hela Python-språket.

source: How does Python manage memory?
sv: Hur hanterar Python minne?

source: The details of Python memory management depend on the implementation. The standard implementation of Python, :term:`CPython`, uses reference counting to detect inaccessible objects, and another mechanism to collect reference cycles, periodically executing a cycle detection algorithm which looks for inaccessible cycles and deletes the objects involved. The :mod:`gc` module provides functions to perform a garbage collection, obtain debugging statistics, and tune the collector's parameters.
sv: Detaljerna i Pythons minneshantering beror på implementeringen. Standardimplementationen av Python, :term:`CPython`, använder referensräkning för att upptäcka otillgängliga objekt och en annan mekanism för att samla in referenscykler genom att periodiskt köra en algoritm för cykeldetektering som letar efter otillgängliga cykler och raderar de inblandade objekten. Modulen :mod:`gc` innehåller funktioner för att utföra en skräpinsamling, få felsökningsstatistik och ställa in insamlarens parametrar.

source: Other implementations (such as `Jython <https://www.jython.org>`_ or `PyPy <https://pypy.org>`_), however, can rely on a different mechanism such as a full-blown garbage collector. This difference can cause some subtle porting problems if your Python code depends on the behavior of the reference counting implementation.
sv: Andra implementationer (t.ex. `Jython <https://www.jython.org>`_ eller `PyPy <https://pypy.org>`_) kan dock förlita sig på en annan mekanism, t.ex. en fullfjädrad skräpsamlare. Denna skillnad kan orsaka vissa subtila portningsproblem om din Python-kod är beroende av beteendet hos referensräkningsimplementeringen.

source: In some Python implementations, the following code (which is fine in CPython) will probably run out of file descriptors::
sv: I vissa Python-implementationer kommer följande kod (som fungerar bra i CPython) förmodligen att få slut på filbeskrivare::

source: for file in very_long_list_of_files: f = open(file) c = f.read(1)
sv: för file i very_long_list_of_files: f = öppna(fil) c = f.read(1)

source: Indeed, using CPython's reference counting and destructor scheme, each new assignment to ``f`` closes the previous file. With a traditional GC, however, those file objects will only get collected (and closed) at varying and possibly long intervals.
sv: Genom att använda CPythons referensräkning och destruktorschema stänger varje ny tilldelning till ``f`` den föregående filen. Med en traditionell GC kommer dock dessa filobjekt endast att samlas in (och stängas) med varierande och eventuellt långa intervall.

source: If you want to write code that will work with any Python implementation, you should explicitly close the file or use the :keyword:`with` statement; this will work regardless of memory management scheme::
sv: Om du vill skriva kod som fungerar med alla Python-implementationer bör du uttryckligen stänga filen eller använda :keyword:`with`-satsen; detta fungerar oavsett minneshanteringsschema::

source: for file in very_long_list_of_files: with open(file) as f: c = f.read(1)
sv: för fil i very_long_list_of_files: med open(file) som f: c = f.read(1)

source: Why doesn't CPython use a more traditional garbage collection scheme?
sv: Varför använder inte CPython ett mer traditionellt skräpuppsamlingsschema?

source: For one thing, this is not a C standard feature and hence it's not portable. (Yes, we know about the Boehm GC library. It has bits of assembler code for *most* common platforms, not for all of them, and although it is mostly transparent, it isn't completely transparent; patches are required to get Python to work with it.)
sv: För en sak är detta inte en C-standardfunktion och därför är den inte bärbar. (Ja, vi känner till Boehm GC-biblioteket. Det har bitar av assemblerkod för * de flesta * vanliga plattformar, inte för dem alla, och även om det mestadels är transparent är det inte helt transparent; patchar krävs för att få Python att fungera med det)

source: Traditional GC also becomes a problem when Python is embedded into other applications. While in a standalone Python it's fine to replace the standard ``malloc()`` and ``free()`` with versions provided by the GC library, an application embedding Python may want to have its *own* substitute for ``malloc()`` and ``free()``, and may not want Python's. Right now, CPython works with anything that implements ``malloc()`` and ``free()`` properly.
sv: Traditionell GC blir också ett problem när Python är inbäddat i andra applikationer. Medan det i ett fristående Python går bra att ersätta standard ``malloc()`` och ``free()`` med versioner som tillhandahålls av GC-biblioteket, kanske en applikation som bäddar in Python vill ha sitt *egna* substitut för ``malloc()`` och ``free()``, och kanske inte vill ha Pythons. Just nu fungerar CPython med allt som implementerar ``malloc()`` och ``free()`` på rätt sätt.

source: Why isn't all memory freed when CPython exits?
sv: Varför frigörs inte allt minne när CPython avslutas?

source: Objects referenced from the global namespaces of Python modules are not always deallocated when Python exits. This may happen if there are circular references. There are also certain bits of memory that are allocated by the C library that are impossible to free (e.g. a tool like Purify will complain about these). Python is, however, aggressive about cleaning up memory on exit and does try to destroy every single object.
sv: Objekt som refereras från Python-modulernas globala namnrymder avallokeras inte alltid när Python avslutas. Detta kan hända om det finns cirkulära referenser. Det finns också vissa minnesbitar som allokeras av C-biblioteket som är omöjliga att frigöra (t.ex. kommer ett verktyg som Purify att klaga på dessa). Python är dock aggressiv när det gäller att städa upp minnet vid avslut och försöker förstöra varje enskilt objekt.

source: If you want to force Python to delete certain things on deallocation use the :mod:`atexit` module to run a function that will force those deletions.
sv: Om du vill tvinga Python att ta bort vissa saker vid deallokering, använd modulen :mod:`atexit` för att köra en funktion som tvingar fram dessa borttagningar.

source: Why are there separate tuple and list data types?
sv: Varför finns det separata datatyper för tuplar och listor?

source: Lists and tuples, while similar in many respects, are generally used in fundamentally different ways. Tuples can be thought of as being similar to Pascal ``records`` or C ``structs``; they're small collections of related data which may be of different types which are operated on as a group. For example, a Cartesian coordinate is appropriately represented as a tuple of two or three numbers.
sv: Listor och tuplar är visserligen lika i många avseenden, men används i allmänhet på fundamentalt olika sätt. Tuples kan liknas vid Pascals "records" eller C:s "structures"; de är små samlingar av relaterade data som kan vara av olika typer och som hanteras som en grupp. Till exempel kan en kartesisk koordinat representeras som en tupel av två eller tre tal.

source: Lists, on the other hand, are more like arrays in other languages. They tend to hold a varying number of objects all of which have the same type and which are operated on one-by-one. For example, :func:`os.listdir('.') <os.listdir>` returns a list of strings representing the files in the current directory. Functions which operate on this output would generally not break if you added another file or two to the directory.
sv: Listor, å andra sidan, är mer som matriser i andra språk. De tenderar att innehålla ett varierande antal objekt som alla har samma typ och som bearbetas ett och ett. Exempelvis returnerar :func:`os.listdir('.') <os.listdir>` en lista med strängar som representerar filerna i den aktuella katalogen. Funktioner som arbetar med denna utdata skulle i allmänhet inte brytas om du lägger till ytterligare en fil eller två i katalogen.

source: Tuples are immutable, meaning that once a tuple has been created, you can't replace any of its elements with a new value. Lists are mutable, meaning that you can always change a list's elements. Only immutable elements can be used as dictionary keys, and hence only tuples and not lists can be used as keys.
sv: Tuplar är oföränderliga, vilket innebär att när en tupel har skapats kan du inte ersätta något av dess element med ett nytt värde. Listor är mutabla, vilket innebär att du alltid kan ändra en listas element. Endast oföränderliga element kan användas som nycklar i en ordbok, och därför kan endast tuplar och inte listor användas som nycklar.

source: How are lists implemented in CPython?
sv: Hur implementeras listor i CPython?

source: CPython's lists are really variable-length arrays, not Lisp-style linked lists. The implementation uses a contiguous array of references to other objects, and keeps a pointer to this array and the array's length in a list head structure.
sv: CPythons listor är egentligen arrayer med variabel längd, inte länkade listor i Lisp-stil. Implementeringen använder en sammanhängande matris med referenser till andra objekt och håller en pekare till denna matris och matrisens längd i en listhuvudstruktur.

source: This makes indexing a list ``a[i]`` an operation whose cost is independent of the size of the list or the value of the index.
sv: Detta gör indexeringen av en lista ``a[i]`` till en operation vars kostnad är oberoende av listans storlek eller indexets värde.

source: When items are appended or inserted, the array of references is resized. Some cleverness is applied to improve the performance of appending items repeatedly; when the array must be grown, some extra space is allocated so the next few times don't require an actual resize.
sv: När objekt läggs till eller infogas ändras storleken på referensmatrisen. En del smarthet används för att förbättra prestandan för att lägga till objekt upprepade gånger; när matrisen måste växa tilldelas lite extra utrymme så att de närmaste gångerna inte kräver en faktisk storleksändring.

source: How are dictionaries implemented in CPython?
sv: Hur implementeras ordböcker i CPython?

source: CPython's dictionaries are implemented as resizable hash tables. Compared to B-trees, this gives better performance for lookup (the most common operation by far) under most circumstances, and the implementation is simpler.
sv: CPythons ordböcker är implementerade som hashtabeller som kan ändras i storlek. Jämfört med B-träd ger detta bättre prestanda för uppslagning (den överlägset vanligaste operationen) under de flesta omständigheter, och implementeringen är enklare.

source: Dictionaries work by computing a hash code for each key stored in the dictionary using the :func:`hash` built-in function. The hash code varies widely depending on the key and a per-process seed; for example, ``'Python'`` could hash to ``-539294296`` while ``'python'``, a string that differs by a single bit, could hash to ``1142331976``. The hash code is then used to calculate a location in an internal array where the value will be stored. Assuming that you're storing keys that all have different hash values, this means that dictionaries take constant time -- *O*\ (1), in Big-O notation -- to retrieve a key.
sv: Dictionaries fungerar genom att beräkna en hashkod för varje nyckel som lagras i dictionariet med hjälp av den inbyggda funktionen :func:`hash`. Hashkoden varierar mycket beroende på nyckeln och ett processspecifikt frö; till exempel kan ``'Python'`` hasha till ``-539294296`` medan ``'python'``, en sträng som skiljer sig åt med en enda bit, kan hasha till ``1142331976``. Hashkoden används sedan för att beräkna en plats i en intern array där värdet kommer att lagras. Om vi antar att du lagrar nycklar som alla har olika hashvärden innebär det att det tar konstant tid - *O*\(1), i Big-O-notation - att hämta en nyckel.

source: Why must dictionary keys be immutable?
sv: Varför måste nycklar i ordböcker vara oföränderliga?

source: The hash table implementation of dictionaries uses a hash value calculated from the key value to find the key. If the key were a mutable object, its value could change, and thus its hash could also change. But since whoever changes the key object can't tell that it was being used as a dictionary key, it can't move the entry around in the dictionary. Then, when you try to look up the same object in the dictionary it won't be found because its hash value is different. If you tried to look up the old value it wouldn't be found either, because the value of the object found in that hash bin would be different.
sv: Implementeringen av hashtabeller för ordböcker använder ett hashvärde som beräknas utifrån nyckelvärdet för att hitta nyckeln. Om nyckeln var ett föränderligt objekt skulle dess värde kunna ändras, och därmed skulle dess hashvärde också kunna ändras. Men eftersom den som ändrar nyckelobjektet inte kan se att det användes som en ordboksnyckel, kan den inte flytta runt posten i ordboken. När du sedan försöker slå upp samma objekt i ordboken kommer det inte att hittas eftersom dess hashvärde är annorlunda. Om du försöker slå upp det gamla värdet kommer det inte heller att hittas, eftersom värdet på det objekt som finns i den hashbins skulle vara annorlunda.

source: If you want a dictionary indexed with a list, simply convert the list to a tuple first; the function ``tuple(L)`` creates a tuple with the same entries as the list ``L``. Tuples are immutable and can therefore be used as dictionary keys.
sv: Om du vill ha en ordbok indexerad med en lista konverterar du helt enkelt listan till en tupel först; funktionen ``tuple(L)`` skapar en tupel med samma poster som listan ``L``. Tuples är oföränderliga och kan därför användas som nycklar i en ordbok.

source: Some unacceptable solutions that have been proposed:
sv: Några oacceptabla lösningar som har föreslagits:

source: Hash lists by their address (object ID). This doesn't work because if you construct a new list with the same value it won't be found; e.g.::
sv: Hashar listor efter deras adress (objekt-ID). Detta fungerar inte eftersom om du konstruerar en ny lista med samma värde kommer den inte att hittas; t.ex.::

source: would raise a :exc:`KeyError` exception because the id of the ``[1, 2]`` used in the second line differs from that in the first line. In other words, dictionary keys should be compared using ``==``, not using :keyword:`is`.
sv: skulle ge upphov till ett :exc:`KeyError`-undantag eftersom id:t för ``[1, 2]`` som används i den andra raden skiljer sig från det i den första raden. Med andra ord bör nycklar i ordböcker jämföras med hjälp av ``==``, inte med hjälp av :keyword:`is`.

source: Make a copy when using a list as a key. This doesn't work because the list, being a mutable object, could contain a reference to itself, and then the copying code would run into an infinite loop.
sv: Gör en kopia när du använder en lista som nyckel. Det här fungerar inte eftersom listan, som är ett föränderligt objekt, kan innehålla en referens till sig själv, och då skulle kopieringskoden hamna i en oändlig loop.

source: Allow lists as keys but tell the user not to modify them. This would allow a class of hard-to-track bugs in programs when you forgot or modified a list by accident. It also invalidates an important invariant of dictionaries: every value in ``d.keys()`` is usable as a key of the dictionary.
sv: Tillåt listor som nycklar men säg till användaren att inte ändra dem. Detta skulle möjliggöra en klass av svårspårade buggar i program när du glömmer eller modifierar en lista av misstag. Det ogiltigförklarar också en viktig invariant för ordböcker: varje värde i ``d.keys()`` kan användas som en nyckel i ordboken.

source: Mark lists as read-only once they are used as a dictionary key. The problem is that it's not just the top-level object that could change its value; you could use a tuple containing a list as a key. Entering anything as a key into a dictionary would require marking all objects reachable from there as read-only -- and again, self-referential objects could cause an infinite loop.
sv: Markera listor som skrivskyddade när de används som en nyckel i en ordbok. Problemet är att det inte bara är objektet på den översta nivån som kan ändra sitt värde; du kan använda en tupel som innehåller en lista som nyckel. Om du anger något som nyckel i en ordbok måste du markera alla objekt som kan nås därifrån som skrivskyddade - och återigen kan självrefererande objekt orsaka en oändlig slinga.

source: There is a trick to get around this if you need to, but use it at your own risk: You can wrap a mutable structure inside a class instance which has both a :meth:`~object.__eq__` and a :meth:`~object.__hash__` method. You must then make sure that the hash value for all such wrapper objects that reside in a dictionary (or other hash based structure), remain fixed while the object is in the dictionary (or other structure). ::
sv: Det finns ett trick för att komma runt detta om du behöver, men använd det på egen risk: Du kan linda in en föränderlig struktur i en klassinstans som har både en :meth:`~object.__eq__`- och en :meth:`~object.__hash__`-metod. Du måste då se till att hashvärdet för alla sådana omslutningsobjekt som finns i en ordbok (eller annan hashbaserad struktur) förblir fixerat medan objektet finns i ordboken (eller annan struktur):

source: class ListWrapper: def __init__(self, the_list): self.the_list = the_list def __eq__(self, other): return self.the_list == other.the_list def __hash__(self): l = self.the_list result = 98767 - len(l)*555 for i, el in enumerate(l): try: result = result + (hash(el) % 9999999) * 1001 + i except Exception: result = (result % 7777777) + i * 333 return result
sv: klass ListWrapper: def __init__(self, the_list): self.the_list = the_list def __eq__(self, other): return self.the_list == other.the_list def __hash__(self): l = self.the_list resultat = 98767 - len(l)*555 för i, el i enumerate(l): försök: resultat = resultat + (hash(el) % 9999999) * 1001 + i utom Undantag: resultat = (resultat % 7777777) + i * 333 returnera resultat

source: Note that the hash computation is complicated by the possibility that some members of the list may be unhashable and also by the possibility of arithmetic overflow.
sv: Observera att hashberäkningen kompliceras av möjligheten att vissa medlemmar i listan inte kan hashas och även av möjligheten till aritmetiskt överflöd.

source: Furthermore it must always be the case that if ``o1 == o2`` (ie ``o1.__eq__(o2) is True``) then ``hash(o1) == hash(o2)`` (ie, ``o1.__hash__() == o2.__hash__()``), regardless of whether the object is in a dictionary or not. If you fail to meet these restrictions dictionaries and other hash based structures will misbehave.
sv: Dessutom måste det alltid vara så att om ``o1 == o2`` (dvs. ``o1.__eq__(o2) is True``) så är ``hash(o1) == hash(o2)`` (dvs. ``o1.__hash__() == o2.__hash__()``), oavsett om objektet finns i en ordbok eller inte. Om du inte uppfyller dessa restriktioner kommer ordböcker och andra hashbaserade strukturer att bete sig illa.

source: In the case of :class:`!ListWrapper`, whenever the wrapper object is in a dictionary the wrapped list must not change to avoid anomalies. Don't do this unless you are prepared to think hard about the requirements and the consequences of not meeting them correctly. Consider yourself warned.
sv: När det gäller :class:`!ListWrapper` får den omslutna listan inte ändras när omslutningsobjektet finns i en ordbok för att undvika anomalier. Gör inte detta om du inte är beredd att fundera ordentligt över kraven och konsekvenserna av att inte uppfylla dem på rätt sätt. Betrakta dig själv som varnad.

source: Why doesn't list.sort() return the sorted list?
sv: Varför returnerar inte list.sort() den sorterade listan?

source: In situations where performance matters, making a copy of the list just to sort it would be wasteful. Therefore, :meth:`list.sort` sorts the list in place. In order to remind you of that fact, it does not return the sorted list. This way, you won't be fooled into accidentally overwriting a list when you need a sorted copy but also need to keep the unsorted version around.
sv: I situationer där prestanda är viktigt skulle det vara slöseri att göra en kopia av listan bara för att sortera den. Därför sorterar :meth:`list.sort` listan på plats. För att påminna dig om det faktumet returnerar den inte den sorterade listan. På så sätt blir du inte lurad att av misstag skriva över en lista när du behöver en sorterad kopia men också behöver behålla den osorterade versionen.

source: If you want to return a new list, use the built-in :func:`sorted` function instead. This function creates a new list from a provided iterable, sorts it and returns it. For example, here's how to iterate over the keys of a dictionary in sorted order::
sv: Om du vill returnera en ny lista använder du istället den inbyggda funktionen :func:`sorted`. Denna funktion skapar en ny lista från en tillhandahållen iterabel, sorterar den och returnerar den. Så här gör du till exempel för att iterera över nycklarna i en ordbok i sorterad ordning::

source: for key in sorted(mydict): ... # do whatever with mydict[key]...
sv: för nyckel i sorterad(mydict): ... # gör vad som helst med mydict[key] ...

source: How do you specify and enforce an interface spec in Python?
sv: Hur specificerar och verkställer du en gränssnittsspecifikation i Python?
