Repository: yeager/python-docs-sv
Catalog: faq/design.po
Languages: sv

source: An interface specification for a module as provided by languages such as C++ and Java describes the prototypes for the methods and functions of the module. Many feel that compile-time enforcement of interface specifications helps in the construction of large programs.
sv: En gränssnittsspecifikation för en modul, som tillhandahålls av språk som C++ och Java, beskriver prototyperna för modulens metoder och funktioner. Många anser att tillämpning av gränssnittsspecifikationer under kompileringstiden underlättar konstruktionen av stora program.

source: Python 2.6 adds an :mod:`abc` module that lets you define Abstract Base Classes (ABCs). You can then use :func:`isinstance` and :func:`issubclass` to check whether an instance or a class implements a particular ABC. The :mod:`collections.abc` module defines a set of useful ABCs such as :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container`, and :class:`~collections.abc.MutableMapping`.
sv: Python 2.6 lägger till en :mod:`abc`-modul som låter dig definiera abstrakta basklasser (ABC). Du kan sedan använda :func:`isinstance` och :func:`issubclass` för att kontrollera om en instans eller en klass implementerar en viss ABC. Modulen :mod:`collections.abc` definierar en uppsättning användbara ABC:er som :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container` och :class:`~collections.abc.MutableMapping`.

source: For Python, many of the advantages of interface specifications can be obtained by an appropriate test discipline for components.
sv: För Python kan många av fördelarna med gränssnittsspecifikationer uppnås genom en lämplig testdisciplin för komponenter.

source: A good test suite for a module can both provide a regression test and serve as a module interface specification and a set of examples. Many Python modules can be run as a script to provide a simple "self test." Even modules which use complex external interfaces can often be tested in isolation using trivial "stub" emulations of the external interface. The :mod:`doctest` and :mod:`unittest` modules or third-party test frameworks can be used to construct exhaustive test suites that exercise every line of code in a module.
sv: En bra testsvit för en modul kan både tillhandahålla ett regressionstest och fungera som en specifikation för modulgränssnittet och en uppsättning exempel. Många Python-moduler kan köras som ett skript för att ge ett enkelt "självtest" Även moduler som använder komplexa externa gränssnitt kan ofta testas isolerat med hjälp av triviala "stub"-emuleringar av det externa gränssnittet. Modulerna :mod:`doctest` och :mod:`unittest` eller testramverk från tredje part kan användas för att konstruera uttömmande testsviter som testar varje kodrad i en modul.

source: An appropriate testing discipline can help build large complex applications in Python as well as having interface specifications would. In fact, it can be better because an interface specification cannot test certain properties of a program. For example, the :meth:`!list.append` method is expected to add new elements to the end of some internal list; an interface specification cannot test that your :meth:`!list.append` implementation will actually do this correctly, but it's trivial to check this property in a test suite.
sv: En lämplig testdisciplin kan hjälpa till att bygga stora komplexa applikationer i Python lika bra som att ha gränssnittsspecifikationer. Faktum är att det kan vara bättre eftersom en gränssnittsspecifikation inte kan testa vissa egenskaper hos ett program. Till exempel förväntas :meth:`!list.append`-metoden lägga till nya element i slutet av en intern lista; en gränssnittsspecifikation kan inte testa att din :meth:`!list.append`-implementering faktiskt gör detta korrekt, men det är trivialt att kontrollera den här egenskapen i en testsvit.

source: Writing test suites is very helpful, and you might want to design your code to make it easily tested. One increasingly popular technique, test-driven development, calls for writing parts of the test suite first, before you write any of the actual code. Of course Python allows you to be sloppy and not write test cases at all.
sv: Att skriva testsviter är till stor hjälp, och du kanske vill utforma din kod så att den blir lätt att testa. En alltmer populär teknik, testdriven utveckling, innebär att man skriver delar av testsviten först, innan man skriver någon av den faktiska koden. Med Python kan du naturligtvis vara slarvig och inte skriva testfall alls.

source: Why is there no goto?
sv: Varför finns det ingen goto?

source: In the 1970s people realized that unrestricted goto could lead to messy "spaghetti" code that was hard to understand and revise. In a high-level language, it is also unneeded as long as there are ways to branch (in Python, with :keyword:`if` statements and :keyword:`or`, :keyword:`and`, and :keyword:`if`/:keyword:`else` expressions) and loop (with :keyword:`while` and :keyword:`for` statements, possibly containing :keyword:`continue` and :keyword:`break`).
sv: På 1970-talet insåg man att obegränsad goto kunde leda till rörig "spaghetti"-kod som var svår att förstå och revidera. I ett högnivåspråk är det också onödigt så länge det finns sätt att förgrena (i Python, med :keyword:`if`-satser och :keyword:`or`, :keyword:`and` och :keyword:`if`/:keyword:`else`-uttryck) och loopa (med :keyword:`while` och :keyword:`for`-satser, som eventuellt innehåller :keyword:`continue` och :keyword:`break`).

source: One can also use exceptions to provide a "structured goto" that works even across function calls. Many feel that exceptions can conveniently emulate all reasonable uses of the ``go`` or ``goto`` constructs of C, Fortran, and other languages. For example::
sv: Man kan också använda undantag för att tillhandahålla ett "strukturerat goto" som fungerar även över funktionsanrop. Många anser att undantag på ett bekvämt sätt kan emulera alla rimliga användningar av ``go``- eller ``goto``-konstruktionerna i C, Fortran och andra språk. Till exempel::

source: class label(Exception): pass # declare a label try: ... if condition: raise label() # goto label ... except label: # where to goto pass ...
sv: class label(Exception): pass # deklarera en etikett try: ... if villkor: raise label() # goto label ... except label: # vart ska man gå passera ...

source: This doesn't allow you to jump into the middle of a loop, but that's usually considered an abuse of ``goto`` anyway. Use sparingly.
sv: Detta gör att du inte kan hoppa in i mitten av en slinga, men det brukar ändå betraktas som ett missbruk av ``goto``. Använd sparsamt.

source: Why can't raw strings (r-strings) end with a backslash?
sv: Varför kan inte råsträngar (r-strängar) sluta med ett backslash?

source: More precisely, they can't end with an odd number of backslashes: the unpaired backslash at the end escapes the closing quote character, leaving an unterminated string.
sv: Mer exakt kan de inte sluta med ett udda antal backslash: den oparade backslashen i slutet undgår det avslutande citattecknet och lämnar en oavslutad sträng.

source: Raw strings were designed to ease creating input for processors (chiefly regular expression engines) that want to do their own backslash escape processing. Such processors consider an unmatched trailing backslash to be an error anyway, so raw strings disallow that. In return, they allow you to pass on the string quote character by escaping it with a backslash. These rules work well when r-strings are used for their intended purpose.
sv: Råa strängar utformades för att underlätta skapandet av indata för processorer (främst motorer för reguljära uttryck) som vill göra sin egen backslash escape-bearbetning. Sådana processorer anser att en omatchad efterföljande backslash ändå är ett fel, så råa strängar tillåter inte det. I gengäld tillåter de att du skickar vidare strängens citattecken genom att escapa det med en backslash. Dessa regler fungerar bra när r-strängar används för sitt avsedda ändamål.

source: If you're trying to build Windows pathnames, note that all Windows system calls accept forward slashes too::
sv: Om du försöker skapa Windows-sökvägar bör du notera att alla Windows-anrop också accepterar snedstreck::

source: f = open("/mydir/file.txt") # works fine!
sv: f = open("/mydir/file.txt") # fungerar bra!

source: If you're trying to build a pathname for a DOS command, try e.g. one of ::
sv: Om du försöker skapa ett sökvägsnamn för ett DOS-kommando, prova t.ex. en av ::

source: Why doesn't Python have a "with" statement for attribute assignments?
sv: Varför har Python inte ett "with"-uttalande för attributtilldelningar?

source: Python has a :keyword:`with` statement that wraps the execution of a block, calling code on the entrance and exit from the block. Some languages have a construct that looks like this::
sv: Python har en :keyword:`with`-sats som omsluter exekveringen av ett block och anropar kod vid ingången till och utgången från blocket. Vissa språk har en konstruktion som ser ut så här::

source: with obj: a = 1 # equivalent to obj.a = 1 total = total + 1 # obj.total = obj.total + 1
sv: med obj: a = 1 # likvärdig med obj.a = 1 total = total + 1 # obj.total = obj.total + 1

source: In Python, such a construct would be ambiguous.
sv: I Python skulle en sådan konstruktion vara tvetydig.

source: Other languages, such as Object Pascal, Delphi, and C++, use static types, so it's possible to know, in an unambiguous way, what member is being assigned to. This is the main point of static typing -- the compiler *always* knows the scope of every variable at compile time.
sv: Andra språk, som Object Pascal, Delphi och C++, använder statiska typer, så det är möjligt att på ett otvetydigt sätt veta vilken medlem som tilldelas. Detta är huvudpoängen med statisk typning - kompilatorn vet *alltid* omfattningen av varje variabel vid kompileringstillfället.

source: Python uses dynamic types. It is impossible to know in advance which attribute will be referenced at runtime. Member attributes may be added or removed from objects on the fly. This makes it impossible to know, from a simple reading, what attribute is being referenced: a local one, a global one, or a member attribute?
sv: Python använder dynamiska typer. Det är omöjligt att i förväg veta vilket attribut som kommer att refereras till vid körning. Medlemsattribut kan läggas till eller tas bort från objekt i farten. Detta gör det omöjligt att, genom en enkel läsning, veta vilket attribut som refereras: ett lokalt, ett globalt eller ett medlemsattribut?

source: For instance, take the following incomplete snippet::
sv: Ta till exempel följande ofullständiga utdrag::

source: def foo(a): with a: print(x)
sv: def foo(a): med a: print(x)

source: The snippet assumes that ``a`` must have a member attribute called ``x``. However, there is nothing in Python that tells the interpreter this. What should happen if ``a`` is, let us say, an integer? If there is a global variable named ``x``, will it be used inside the :keyword:`with` block? As you see, the dynamic nature of Python makes such choices much harder.
sv: I utdraget antas att ``a`` måste ha ett medlemsattribut som heter ``x``. Det finns dock inget i Python som säger detta till tolken. Vad skulle hända om ``a`` är, låt oss säga, ett heltal? Om det finns en global variabel som heter ``x``, kommer den att användas inuti :keyword:`with`-blocket? Som du ser gör Pythons dynamiska natur sådana val mycket svårare.

source: The primary benefit of :keyword:`with` and similar language features (reduction of code volume) can, however, easily be achieved in Python by assignment. Instead of::
sv: Den primära fördelen med :keyword:`with` och liknande språkfunktioner (minskning av kodvolymen) kan dock lätt uppnås i Python genom tilldelning. Istället för::

source: function(args).mydict[index][index].a = 21 function(args).mydict[index][index].b = 42 function(args).mydict[index][index].c = 63
sv: funktion(args).mydict[index][index].a = 21 funktion(args).mydict[index][index].b = 42 funktion(args).mydict[index][index].c = 63

source: write this::
sv: skriv detta::

source: ref = function(args).mydict[index][index] ref.a = 21 ref.b = 42 ref.c = 63
sv: ref = funktion(args).mydict[index][index] ref.a = 21 ref.b = 42 ref.c = 63

source: This also has the side-effect of increasing execution speed because name bindings are resolved at run-time in Python, and the second version only needs to perform the resolution once.
sv: Detta har också den bieffekten att körhastigheten ökar eftersom namnbindningar löses vid körning i Python, och den andra versionen behöver bara utföra upplösningen en gång.

source: Similar proposals that would introduce syntax to further reduce code volume, such as using a 'leading dot', have been rejected in favour of explicitness (see https://mail.python.org/pipermail/python-ideas/2016-May/040070.html).
sv: Liknande förslag om att införa syntax för att ytterligare minska kodvolymen, t.ex. genom att använda en "ledande punkt", har avvisats till förmån för explicitet (se https://mail.python.org/pipermail/python-ideas/2016-May/040070.html).

source: Why don't generators support the with statement?
sv: Varför stöder inte generatorer uttalandet med?

source: For technical reasons, a generator used directly as a context manager would not work correctly. When, as is most common, a generator is used as an iterator run to completion, no closing is needed. When it is, wrap it as :func:`contextlib.closing(generator) <contextlib.closing>` in the :keyword:`with` statement.
sv: Av tekniska skäl skulle en generator som används direkt som en kontexthanterare inte fungera korrekt. När, vilket är vanligast, en generator används som en iterator som körs till slut, behövs ingen stängning. När så är fallet, skriv in det som :func:`contextlib.closing(generator) <contextlib.closing>` i :keyword:`with`-satsen.

source: Why are colons required for the if/while/def/class statements?
sv: Varför krävs kolon för if/while/def/class-satserna?

source: The colon is required primarily to enhance readability (one of the results of the experimental ABC language). Consider this::
sv: Kolonet är nödvändigt främst för att öka läsbarheten (ett av resultaten av det experimentella ABC-språket). Tänk på detta::

source: if a == b print(a)
sv: om a == b skriv ut(a)

source: versus ::
sv: mot ::

source: if a == b: print(a)
sv: om a == b: print(a)

source: Notice how the second one is slightly easier to read. Notice further how a colon sets off the example in this FAQ answer; it's a standard usage in English.
sv: Lägg märke till att den andra är något lättare att läsa. Lägg också märke till att exemplet i det här FAQ-svaret avslutas med ett kolon; det är ett vanligt sätt att använda ord på engelska.

source: Another minor reason is that the colon makes it easier for editors with syntax highlighting; they can look for colons to decide when indentation needs to be increased instead of having to do a more elaborate parsing of the program text.
sv: Ett annat mindre skäl är att kolon gör det lättare för redaktörer med syntaxmarkering; de kan leta efter kolon för att avgöra när indragningen behöver ökas istället för att behöva göra en mer omfattande analys av programtexten.

source: Why does Python allow commas at the end of lists and tuples?
sv: Varför tillåter Python kommatecken i slutet av listor och tupler?

source: Python lets you add a trailing comma at the end of lists, tuples, and dictionaries::
sv: I Python kan du lägga till ett efterföljande kommatecken i slutet av listor, tupler och ordböcker::

source: [1, 2, 3,] ('a', 'b', 'c',) d = { "A": [1, 5], "B": [6, 7], # last trailing comma is optional but good style }
sv: [1, 2, 3,] ('a', 'b', 'c',) d = { "A": [1, 5], "B": [6, 7], # sista efterföljande kommatecknet är valfritt men bra stil }

source: There are several reasons to allow this.
sv: Det finns flera skäl att tillåta detta.

source: When you have a literal value for a list, tuple, or dictionary spread across multiple lines, it's easier to add more elements because you don't have to remember to add a comma to the previous line. The lines can also be reordered without creating a syntax error.
sv: När du har ett bokstavligt värde för en lista, tupel eller ordbok utspritt på flera rader är det lättare att lägga till fler element eftersom du inte behöver komma ihåg att lägga till ett kommatecken på föregående rad. Raderna kan också ordnas om utan att det uppstår ett syntaxfel.

source: Accidentally omitting the comma can lead to errors that are hard to diagnose. For example::
sv: Om du råkar utelämna kommatecknet kan det leda till fel som är svåra att diagnostisera. Till exempel::

source: x = [ "fee", "fie" "foo", "fum" ]
sv: x = [ "avgift", "fie" "foo", "fum" ]

source: This list looks like it has four elements, but it actually contains three: "fee", "fiefoo" and "fum". Always adding the comma avoids this source of error.
sv: Den här listan ser ut att ha fyra element, men den innehåller i själva verket tre: "fee", "fiefoo" och "fum". Genom att alltid lägga till ett kommatecken undviker man denna felkälla.

source: Allowing the trailing comma may also make programmatic code generation easier.
sv: Att tillåta efterföljande kommatecken kan också göra det lättare att generera programmatisk kod.
