Repository: yeager/python-docs-sv
Catalog: faq/design.po
Languages: sv

source: Design and History FAQ
sv: Frågor och svar om design och historia

source: Contents
sv: Innehåll

source: Why does Python use indentation for grouping of statements?
sv: Varför använder Python indragning för gruppering av uttalanden?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
sv: Guido van Rossum anser att det är extremt elegant att använda indragning för gruppering och att det bidrar mycket till tydligheten i det genomsnittliga Python-programmet. De flesta lär sig att älska den här funktionen efter ett tag.

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
sv: Eftersom det inte finns några start-/slutparenteser kan det inte finnas någon oenighet mellan den gruppering som uppfattas av parsern och den mänskliga läsaren. Ibland kommer C-programmerare att stöta på ett fragment av kod som detta::

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads many to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering as to why ``y`` is being decremented even for ``x > y``.
sv: Endast ``x++``-satsen exekveras om villkoret är sant, men indragningen får många att tro något annat. Även erfarna C-programmerare kommer ibland att stirra på det länge och undra varför ``y`` minskas även för ``x > y``.

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. After becoming used to reading and writing code using a particular style, it is normal to feel somewhat uneasy when reading (or being required to write) in a different one.
sv: Eftersom det inte finns några början/slut-parenteser är Python mycket mindre benäget för konflikter i kodningsstilen. I C finns det många olika sätt att placera parenteserna. När man har vant sig vid att läsa och skriva kod i en viss stil är det normalt att känna sig lite illa till mods när man läser (eller måste skriva) i en annan stil.

source: Many coding styles place begin/end brackets on a line by themselves. This makes programs considerably longer and wastes valuable screen space, making it harder to get a good overview of a program. Ideally, a function should fit on one screen (say, 20--30 lines). 20 lines of Python can do a lot more work than 20 lines of C. This is not solely due to the lack of begin/end brackets -- the lack of declarations and the high-level data types are also responsible -- but the indentation-based syntax certainly helps.
sv: Många kodningsstilar placerar start- och slutparenteser på en rad för sig själva. Detta gör programmen betydligt längre och slösar bort värdefullt skärmutrymme, vilket gör det svårare att få en bra överblick över ett program. Helst bör en funktion rymmas på en skärm (säg 20--30 rader). 20 rader Python kan göra mycket mer arbete än 20 rader C. Detta beror inte enbart på avsaknaden av begin/end-parenteser - avsaknaden av deklarationer och datatyperna på hög nivå är också ansvariga - men den indragningsbaserade syntaxen hjälper verkligen till.

source: Why am I getting strange results with simple arithmetic operations?
sv: Varför får jag konstiga resultat med enkla aritmetiska operationer?

source: See the next question.
sv: Se nästa fråga.

source: Why are floating-point calculations so inaccurate?
sv: Varför är flyttalsberäkningar så felaktiga?

source: Users are often surprised by results like this::
sv: Användarna blir ofta överraskade av resultat som detta::

source: and think it is a bug in Python. It's not. This has little to do with Python, and much more to do with how the underlying platform handles floating-point numbers.
sv: och tror att det är en bugg i Python. Men det är det inte. Det har lite att göra med Python och mycket mer att göra med hur den underliggande plattformen hanterar flyttal.

source: The :class:`float` type in CPython uses a C ``double`` for storage. A :class:`float` object's value is stored in binary floating-point with a fixed precision (typically 53 bits) and Python uses C operations, which in turn rely on the hardware implementation in the processor, to perform floating-point operations. This means that as far as floating-point operations are concerned, Python behaves like many popular languages including C and Java.
sv: Typen :class:`float` i CPython använder en C ``double`` för lagring. Ett :class:`float`-objekts värde lagras i binär flyttalsräkning med en fast precision (vanligtvis 53 bitar) och Python använder C-operationer, som i sin tur förlitar sig på maskinvaruimplementeringen i processorn, för att utföra flyttalsoperationer. Detta innebär att när det gäller flyttalsoperationer beter sig Python som många populära språk, inklusive C och Java.

source: Many numbers that can be written easily in decimal notation cannot be expressed exactly in binary floating point. For example, after::
sv: Många tal som enkelt kan skrivas i decimalnotation kan inte uttryckas exakt i binär flyttal. Till exempel efter::

source: the value stored for ``x`` is a (very good) approximation to the decimal value ``1.2``, but is not exactly equal to it. On a typical machine, the actual stored value is::
sv: det lagrade värdet för ``x`` är en (mycket god) approximation av decimalvärdet ``1,2``, men är inte exakt lika med det. På en typisk maskin är det faktiska lagrade värdet::

source: which is exactly::
sv: vilket är exakt::

source: The typical precision of 53 bits provides Python floats with 15--16 decimal digits of accuracy.
sv: Den typiska precisionen på 53 bitar ger Python floats med 15-16 decimalers noggrannhet.

source: For a fuller explanation, please see the :ref:`floating-point arithmetic <tut-fp-issues>` chapter in the Python tutorial.
sv: För en fullständigare förklaring, se :ref:``floating-point arithmetic <tut-fp-issues>` kapitlet i Python-handledningen.

source: Why are Python strings immutable?
sv: Varför är Python-strängar oföränderliga?

source: There are several advantages.
sv: Det finns flera fördelar.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
sv: Det ena är prestanda: att veta att en sträng är oföränderlig innebär att vi kan allokera utrymme för den vid skapandet och att lagringskraven är fasta och oföränderliga. Detta är också en av anledningarna till skillnaden mellan tupler och listor.

source: Another advantage is that strings in Python are considered as "elemental" as numbers. No amount of activity will change the value 8 to anything else, and in Python, no amount of activity will change the string "eight" to anything else.
sv: En annan fördel är att strängar i Python betraktas som lika "elementära" som siffror. Ingen aktivitet kan ändra värdet 8 till något annat, och i Python kan ingen aktivitet ändra strängen "åtta" till något annat.

source: Why must 'self' be used explicitly in method definitions and calls?
sv: Varför måste "self" användas explicit i metoddefinitioner och anrop?

source: The idea was borrowed from Modula-3. It turns out to be very useful, for a variety of reasons.
sv: Idén har lånats från Modula-3. Den visar sig vara mycket användbar av flera olika skäl.

source: First, it's more obvious that you are using a method or instance attribute instead of a local variable. Reading ``self.x`` or ``self.meth()`` makes it absolutely clear that an instance variable or method is used even if you don't know the class definition by heart. In C++, you can sort of tell by the lack of a local variable declaration (assuming globals are rare or easily recognizable) -- but in Python, there are no local variable declarations, so you'd have to look up the class definition to be sure. Some C++ and Java coding standards call for instance attributes to have an ``m_`` prefix, so this explicitness is still useful in those languages, too.
sv: För det första är det mer uppenbart att du använder en metod eller ett instansattribut istället för en lokal variabel. Att läsa ``self.x`` eller ``self.meth()`` gör det helt klart att en instansvariabel eller metod används även om du inte kan klassdefinitionen utantill. I C++ kan du på sätt och vis se det genom att det inte finns någon lokal variabeldeklaration (förutsatt att globaler är sällsynta eller lätt igenkännliga) - men i Python finns det inga lokala variabeldeklarationer, så du måste slå upp klassdefinitionen för att vara säker. Vissa C++- och Java-kodningsstandarder kräver att instansattribut har ett ``m_``-prefix, så detta uttryck är fortfarande användbart i dessa språk också.

source: Second, it means that no special syntax is necessary if you want to explicitly reference or call the method from a particular class. In C++, if you want to use a method from a base class which is overridden in a derived class, you have to use the ``::`` operator -- in Python you can write ``baseclass.methodname(self, <argument list>)``. This is particularly useful for :meth:`~object.__init__` methods, and in general in cases where a derived class method wants to extend the base class method of the same name and thus has to call the base class method somehow.
sv: För det andra innebär det att ingen speciell syntax är nödvändig om du uttryckligen vill referera till eller anropa metoden från en viss klass. I C++ måste man använda operatorn ``::`` om man vill använda en metod från en basklass som åsidosätts i en härledd klass - i Python kan man skriva ``baseclass.methodname(self, <argument list>)``. Detta är särskilt användbart för :meth:`~object.__init__`-metoder, och i allmänhet i fall där en härledd klassmetod vill utöka basklassmetoden med samma namn och därmed måste anropa basklassmetoden på något sätt.

source: Finally, for instance variables it solves a syntactic problem with assignment: since local variables in Python are (by definition!) those variables to which a value is assigned in a function body (and that aren't explicitly declared global), there has to be some way to tell the interpreter that an assignment was meant to assign to an instance variable instead of to a local variable, and it should preferably be syntactic (for efficiency reasons). C++ does this through declarations, but Python doesn't have declarations and it would be a pity having to introduce them just for this purpose. Using the explicit ``self.var`` solves this nicely. Similarly, for using instance variables, having to write ``self.var`` means that references to unqualified names inside a method don't have to search the instance's directories. To put it another way, local variables and instance variables live in two different namespaces, and you need to tell Python which namespace to use.
sv: Slutligen, för instansvariabler löser det ett syntaktiskt problem med tilldelning: eftersom lokala variabler i Python är (per definition!) de variabler till vilka ett värde tilldelas i en funktionskropp (och som inte uttryckligen förklaras globala), måste det finnas något sätt att berätta för tolken att en tilldelning var avsedd att tilldela en instansvariabel istället för en lokal variabel, och det bör helst vara syntaktiskt (av effektivitetsskäl). C++ gör detta genom deklarationer, men Python har inte deklarationer och det skulle vara synd att behöva införa dem bara för detta ändamål. Att använda den explicita ``self.var`` löser detta snyggt. På samma sätt, för användning av instansvariabler, innebär att behöva skriva ``self.var`` att referenser till okvalificerade namn i en metod inte behöver söka i instansens kataloger. För att uttrycka det på ett annat sätt lever lokala variabler och instansvariabler i två olika namnrymder, och du måste berätta för Python vilket namnrymd som ska användas.

source: Why can't I use an assignment in an expression?
sv: Varför kan jag inte använda en tilldelning i ett uttryck?

source: Starting in Python 3.8, you can!
sv: Från och med Python 3.8 kan du göra det!

source: Assignment expressions using the walrus operator ``:=`` assign a variable in an expression::
sv: Tilldelningsuttryck med hjälp av valrossoperatorn ``:=`` tilldela en variabel i ett uttryck::

source: See :pep:`572` for more information.
sv: Se :pep:`572` för mer information.

source: Why does Python use methods for some functionality (e.g. list.index()) but functions for other (e.g. len(list))?
sv: Varför använder Python metoder för vissa funktioner (t.ex. list.index()) men funktioner för andra (t.ex. len(list))?

source: As Guido said:
sv: Som Guido sa:

source: (a) For some operations, prefix notation just reads better than postfix -- prefix (and infix!) operations have a long tradition in mathematics which likes notations where the visuals help the mathematician thinking about a problem. Compare the easy with which we rewrite a formula like x*(a+b) into x*a + x*b to the clumsiness of doing the same thing using a raw OO notation.
sv: (a) För vissa operationer är prefixnotation helt enkelt bättre än postfix -- prefix (och infix!) operationer har en lång tradition inom matematiken som gillar notationer där det visuella hjälper matematikern att tänka på ett problem. Jämför hur lätt det är att skriva om en formel som x*(a+b) till x*a + x*b med hur klumpigt det är att göra samma sak med en rå OO-notation.

source: (b) When I read code that says len(x) I *know* that it is asking for the length of something. This tells me two things: the result is an integer, and the argument is some kind of container. To the contrary, when I read x.len(), I have to already know that x is some kind of container implementing an interface or inheriting from a class that has a standard len(). Witness the confusion we occasionally have when a class that is not implementing a mapping has a get() or keys() method, or something that isn't a file has a write() method.
sv: (b) När jag läser kod som säger len(x) *vet* jag att den frågar efter längden på något. Detta säger mig två saker: resultatet är ett heltal, och argumentet är någon form av behållare. Tvärtom, när jag läser x.len() måste jag redan veta att x är någon form av container som implementerar ett gränssnitt eller ärver från en klass som har en standard len(). Tänk på den förvirring som ibland uppstår när en klass som inte implementerar en mappning har en get()- eller keys()-metod, eller när något som inte är en fil har en write()-metod.

source: Why is join() a string method instead of a list or tuple method?
sv: Varför är join() en strängmetod istället för en list- eller tupelmetod?

source: Strings became much more like other standard types starting in Python 1.6, when methods were added which give the same functionality that has always been available using the functions of the string module. Most of these new methods have been widely accepted, but the one which appears to make some programmers feel uncomfortable is::
sv: Strängar blev mycket mer lika andra standardtyper från och med Python 1.6, när metoder lades till som ger samma funktionalitet som alltid har varit tillgänglig med hjälp av funktionerna i strängmodulen. De flesta av dessa nya metoder har blivit allmänt accepterade, men den som verkar få en del programmerare att känna sig obekväma är::

source: which gives the result::
sv: vilket ger resultatet::

source: There are two common arguments against this usage.
sv: Det finns två vanliga argument mot denna användning.

source: The first runs along the lines of: "It looks really ugly using a method of a string literal (string constant)", to which the answer is that it might, but a string literal is just a fixed value. If the methods are to be allowed on names bound to strings there is no logical reason to make them unavailable on literals.
sv: Den första går i linje med: "Det ser riktigt fult ut att använda en metod för en stränglitteral (strängkonstant)", varpå svaret är att det kan det göra, men en stränglitteral är bara ett fast värde. Om metoderna ska vara tillåtna för namn som är bundna till strängar finns det ingen logisk anledning att göra dem otillgängliga för bokstavliga värden.

source: The second objection is typically cast as: "I am really telling a sequence to join its members together with a string constant". Sadly, you aren't. For some reason there seems to be much less difficulty with having :meth:`~str.split` as a string method, since in that case it is easy to see that ::
sv: Den andra invändningen brukar formuleras som: "Jag säger verkligen till en sekvens att sammanfoga sina medlemmar med en strängkonstant". Tyvärr gör du inte det. Av någon anledning verkar det vara mycket mindre svårt att ha :meth:`~str.split` som en strängmetod, eftersom det i så fall är lätt att se att ::

source: is an instruction to a string literal to return the substrings delimited by the given separator (or, by default, arbitrary runs of white space).
sv: är en instruktion till en stränglitual att returnera delsträngarna som avgränsas av den angivna separatorn (eller, som standard, godtyckliga sträckor med vitt utrymme).

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
sv: :meth:`~str.join` är en strängmetod eftersom du genom att använda den säger till separatorsträngen att iterera över en sekvens av strängar och infoga sig själv mellan intilliggande element. Den här metoden kan användas med alla argument som följer reglerna för sekvensobjekt, inklusive alla nya klasser som du själv kan definiera. Liknande metoder finns för bytes och bytearray-objekt.

source: How fast are exceptions?
sv: Hur snabba är undantagen?

source: A :keyword:`try`/:keyword:`except` block is extremely efficient if no exceptions are raised. Actually catching an exception is expensive. In versions of Python prior to 2.0 it was common to use this idiom::
sv: Ett :keyword:`try`/:keyword:`except`-block är extremt effektivt om inga undantag uppstår. Att faktiskt fånga ett undantag är dyrt. I versioner av Python före 2.0 var det vanligt att använda detta idiom::

source: try: value = mydict[key] except KeyError: mydict[key] = getvalue(key) value = mydict[key]
sv: försök: värde = mydict[nyckel] except KeyError: mydict[nyckel] = getvalue(nyckel) värde = mydict[nyckel]

source: This only made sense when you expected the dict to have the key almost all the time. If that wasn't the case, you coded it like this::
sv: Detta var bara meningsfullt när du förväntade dig att dict skulle ha nyckeln nästan hela tiden. Om så inte var fallet kodade du det så här::

source: if key in mydict: value = mydict[key] else: value = mydict[key] = getvalue(key)
sv: om nyckel i mydict: värde = mydict[nyckel] annat: värde = mydict[nyckel] = getvalue(nyckel)

source: For this specific case, you could also use ``value = dict.setdefault(key, getvalue(key))``, but only if the ``getvalue()`` call is cheap enough because it is evaluated in all cases.
sv: För detta specifika fall kan du också använda ``value = dict.setdefault(key, getvalue(key))``, men bara om ``getvalue()``-anropet är tillräckligt billigt eftersom det utvärderas i alla fall.

source: Why isn't there a switch or case statement in Python?
sv: Varför finns det inte en switch- eller case-sats i Python?

source: In general, structured switch statements execute one block of code when an expression has a particular value or set of values. Since Python 3.10 one can easily match literal values, or constants within a namespace, with a ``match ... case`` statement. An older alternative is a sequence of ``if... elif... elif... else``.
sv: I allmänhet exekverar strukturerade switch-satser ett kodblock när ett uttryck har ett visst värde eller en viss uppsättning värden. Sedan Python 3.10 kan man enkelt matcha bokstavliga värden, eller konstanter inom ett namnområde, med en ``match ... case``-sats. Ett äldre alternativ är en sekvens av ``if... elif... elif... else``.

source: For cases where you need to choose from a very large number of possibilities, you can create a dictionary mapping case values to functions to call. For example::
sv: I fall där du måste välja bland ett mycket stort antal möjligheter kan du skapa en ordbok som mappar fallvärden till funktioner som ska anropas. Till exempel::

source: functions = {'a': function_1, 'b': function_2, 'c': self.method_1} func = functions[value] func()
sv: functions = {'a': funktion_1, 'b': funktion_2, 'c': self.method_1} func = funktioner[värde] func()

source: For calling methods on objects, you can simplify yet further by using the :func:`getattr` built-in to retrieve methods with a particular name::
sv: För att anropa metoder på objekt kan du förenkla ytterligare genom att använda den inbyggda :func:`getattr` för att hämta metoder med ett visst namn::

source: class MyVisitor: def visit_a(self): ... def dispatch(self, value): method_name = 'visit_' + str(value) method = getattr(self, method_name) method()
sv: klass MyVisitor: def visit_a(self): ... def dispatch(self, värde): method_name = 'visit_' + str(värde) method = getattr(self, method_name) metod()

source: It's suggested that you use a prefix for the method names, such as ``visit_`` in this example. Without such a prefix, if values are coming from an untrusted source, an attacker would be able to call any method on your object.
sv: Vi föreslår att du använder ett prefix för metodnamnen, t.ex. ``visit_`` i det här exemplet. Utan ett sådant prefix skulle en angripare kunna anropa vilken metod som helst på ditt objekt om värdena kommer från en icke betrodd källa.

source: Imitating switch with fallthrough, as with C's switch-case-default, is possible, much harder, and less needed.
sv: Att imitera switch med fallthrough, som med C:s switch-case-default, är möjligt, men mycket svårare och mindre nödvändigt.

source: Can't you emulate threads in the interpreter instead of relying on an OS-specific thread implementation?
sv: Kan du inte emulera trådar i tolken istället för att förlita dig på en OS-specifik trådimplementering?

source: Answer 1: Unfortunately, the interpreter pushes at least one C stack frame for each Python stack frame. Also, extensions can call back into Python at almost random moments. Therefore, a complete threads implementation requires thread support for C.
sv: Svar 1: Tyvärr skjuter tolken minst en C-stackram för varje Python-stackram. Dessutom kan tillägg anropa tillbaka till Python vid nästan slumpmässiga tillfällen. Därför kräver en fullständig implementering av trådar trådstöd för C.

source: Answer 2: Fortunately, there is `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, which has a completely redesigned interpreter loop that avoids the C stack.
sv: Svar 2: Lyckligtvis finns det `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, som har en helt omdesignad tolkslinga som undviker C-stacken.

source: Why can't lambda expressions contain statements?
sv: Varför kan inte lambda-uttryck innehålla uttalanden?
