Repository: yeager/python-docs-sv
Catalog: faq/general.po
Languages: sv

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
sv: När han började implementera Python läste Guido van Rossum också de publicerade manusen från "Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, en BBC-komediserie från 1970-talet. Van Rossum tyckte att han behövde ett namn som var kort, unikt och lite mystiskt, så han bestämde sig för att kalla språket Python.

source: Do I have to like "Monty Python's Flying Circus"?
sv: Måste jag gilla "Monty Python's Flying Circus"?

source: No, but it helps. :)
sv: Nej, men det hjälper. :)

source: Python in the real world
sv: Python i den verkliga världen

source: How stable is Python?
sv: Hur stabilt är Python?

source: Very stable. New, stable releases have been coming out roughly every 6 to 18 months since 1991, and this seems likely to continue. As of version 3.9, Python will have a new feature release every 12 months (:pep:`602`).
sv: Mycket stabil. Nya, stabila utgåvor har kommit ut ungefär var 6:e till 18:e månad sedan 1991, och det verkar troligt att detta kommer att fortsätta. Från och med version 3.9 kommer Python att ha en ny funktionsutgåva var 12: e månad (:pep:`602`).

source: The developers issue bugfix releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
sv: Utvecklarna ger ut buggfixversioner av äldre versioner, så att stabiliteten i befintliga versioner gradvis förbättras. Buggfixversioner, som anges med en tredje komponent i versionsnumret (t.ex. 3.5.3, 3.6.2), hanteras för stabilitet; endast korrigeringar av kända problem ingår i en buggfixversion och det är garanterat att gränssnitten förblir desamma under en serie buggfixversioner.

source: The latest stable releases can always be found on the `Python download page <https://www.python.org/downloads/>`_. Python 3.x is the recommended version and supported by most widely used libraries. Python 2.x :pep:`is not maintained anymore <373>`.
sv: De senaste stabila versionerna finns alltid på nedladdningssidan för Python &lt;https://www.python.org/downloads/&gt;`_. Python 3.x är den rekommenderade versionen och stöds av de flesta allmänt använda biblioteken. Python 2.x :pep:`underhålls inte längre <373>`.

source: How many people are using Python?
sv: Hur många människor använder Python?

source: There are probably millions of users, though it's difficult to obtain an exact count.
sv: Det finns förmodligen miljontals användare, även om det är svårt att få en exakt siffra.

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
sv: Python finns tillgängligt för gratis nedladdning, så det finns inga försäljningssiffror, och det finns tillgängligt från många olika webbplatser och paketerat med många Linux-distributioner, så nedladdningsstatistik berättar inte heller hela historien.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
sv: Nyhetsgruppen comp.lang.python är mycket aktiv, men det är inte alla Python-användare som skickar inlägg till gruppen eller ens läser den.

source: Have any significant projects been done in Python?
sv: Har några betydande projekt genomförts i Python?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
sv: Se https://www.python.org/about/success för en lista över projekt som använder Python. Om du läser proceedings för tidigare Python-konferenser <https://www.python.org/community/workshops/>`_ hittar du bidrag från många olika företag och organisationer.

source: High-profile Python projects include `the Mailman mailing list manager <https://www.list.org>`_ and `the Zope application server <https://www.zope.dev>`_. Several Linux distributions, most notably `Red Hat <https://www.redhat.com>`_, have written part or all of their installer and system administration software in Python. Companies that use Python internally include Google, Yahoo, and Lucasfilm Ltd.
sv: Högprofilerade Python-projekt inkluderar "Mailman mailing list manager <https://www.list.org>`_ och "Zope application server <https://www.zope.dev>`_. Flera Linux-distributioner, särskilt `Red Hat <https://www.redhat.com>`_, har skrivit delar av eller hela sin installations- och systemadministrationsprogramvara i Python. Företag som använder Python internt är bland annat Google, Yahoo och Lucasfilm Ltd.

source: What new developments are expected for Python in the future?
sv: Vilka nya utvecklingar förväntas för Python i framtiden?

source: See https://peps.python.org/ for the Python Enhancement Proposals (PEPs). PEPs are design documents describing a suggested new feature for Python, providing a concise technical specification and a rationale. Look for a PEP titled "Python X.Y Release Schedule", where X.Y is a version that hasn't been publicly released yet.
sv: Se https://peps.python.org/ för Python Enhancement Proposals (PEPs). PEPs är designdokument som beskriver en föreslagen ny funktion för Python, med en kortfattad teknisk specifikation och en motivering. Leta efter en PEP med titeln "Python X.Y Release Schedule", där X.Y är en version som inte har släppts offentligt ännu.

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman3/lists/python-dev.python.org/>`_.
sv: Ny utveckling diskuteras på `postlistan python-dev <https://mail.python.org/mailman3/lists/python-dev.python.org/>`_.

source: Is it reasonable to propose incompatible changes to Python?
sv: Är det rimligt att föreslå inkompatibla ändringar av Python?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
sv: I allmänhet, nej. Det finns redan miljontals rader Python-kod runt om i världen, så alla förändringar i språket som ogiltigförklarar mer än en mycket liten del av befintliga program måste ogillas. Även om du kan tillhandahålla ett konverteringsprogram finns det fortfarande problemet med att uppdatera all dokumentation; många böcker har skrivits om Python, och vi vill inte ogiltigförklara dem alla i ett enda slag.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
sv: Det är nödvändigt att tillhandahålla en gradvis uppgraderingsväg om en funktion måste ändras. :pep:`5` beskriver den procedur som följs för att införa bakåtkompatibla ändringar samtidigt som störningarna för användarna minimeras.

source: Is Python a good language for beginning programmers?
sv: Är Python ett bra språk för nybörjarprogrammerare?

source: Yes.
sv: Ja.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
sv: Det är fortfarande vanligt att studenter börjar med ett procedurspråk och statiskt typat språk som Pascal, C eller en delmängd av C++ eller Java. Studenter kan vara bättre betjänta av att lära sig Python som sitt första språk. Python har en mycket enkel och konsekvent syntax och ett stort standardbibliotek och, viktigast av allt, genom att använda Python i en nybörjarkurs i programmering kan eleverna koncentrera sig på viktiga programmeringsfärdigheter som problemnedbrytning och datatypdesign. Med Python kan studenterna snabbt introduceras till grundläggande begrepp som loopar och procedurer. De kan förmodligen till och med arbeta med användardefinierade objekt redan i sin första kurs.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
sv: För en student som aldrig har programmerat tidigare verkar det onaturligt att använda ett statiskt typat språk. Det innebär ytterligare komplexitet som studenten måste bemästra och saktar ner tempot i kursen. Studenterna försöker lära sig att tänka som en dator, dela upp problem, utforma konsekventa gränssnitt och kapsla in data. Även om det är viktigt att lära sig använda ett statiskt typat språk på lång sikt är det inte nödvändigtvis det bästa ämnet att ta upp i studenternas första programmeringskurs.

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
sv: Många andra aspekter av Python gör det till ett bra första språk. Precis som Java har Python ett stort standardbibliotek så att studenterna mycket tidigt i kursen kan tilldelas programmeringsprojekt som *gör* något. Uppgifterna är inte begränsade till standardprogrammen för fyrfunktionsräknare och checkbalansering. Genom att använda standardbiblioteket kan studenterna få tillfredsställelsen av att arbeta med realistiska applikationer samtidigt som de lär sig grunderna i programmering. Genom att använda standardbiblioteket lär sig eleverna också om återanvändning av kod. Tredjepartsmoduler som PyGame är också till hjälp för att utöka elevernas räckvidd.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
sv: Pythons interaktiva tolk gör det möjligt för studenter att testa språkfunktioner medan de programmerar. De kan hålla ett fönster med tolken igång medan de skriver in källan till sitt program i ett annat fönster. Om de inte kan komma ihåg metoderna för en lista kan de göra något liknande::

source: >>> L = [] >>> dir(L) ['__add__', '__class__', '__contains__', '__delattr__', '__delitem__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__iadd__', '__imul__', '__init__', '__iter__', '__le__', '__len__', '__lt__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__reversed__', '__rmul__', '__setattr__', '__setitem__', '__sizeof__', '__str__', '__subclasshook__', 'append', 'clear', 'copy', 'count', 'extend', 'index', 'insert', 'pop', 'remove', 'reverse', 'sort'] >>> [d for d in dir(L) if '__' not in d] ['append', 'clear', 'copy', 'count', 'extend', 'index', 'insert', 'pop', 'remove', 'reverse', 'sort'] >>> help(L.append) Help on built-in function append: append(...) L.append(object) -> None -- append object to end >>> L.append(1) >>> L [1]
sv: >>> L = [] >>> dir(L) ['__add__', '__class__', '__contains__', '__delattr__', '__delitem__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__iadd__', '__imul__', '__init__', '__iter__', '__le__', '__len__', '__lt__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__reversed__', '__rmul__', '__setattr__', '__setitem__', '__sizeof__', '__str__', '__subclasshook__', 'append', 'clear', 'copy', 'count', 'extend', 'index', 'insert', 'pop', 'remove', 'reverse', 'sort'] >>> [d för d i dir(L) om '__' inte finns i d] ['append', 'clear', 'copy', 'count', 'extend', 'index', 'insert', 'pop', 'remove', 'reverse', 'sort'] >>> help(L.append) Hjälp om den inbyggda funktionen append: append(...) L.append(objekt) -> None -- lägg till objekt i slutet >>> L.append(1) >>> L [1]

source: With the interpreter, documentation is never far from the student as they are programming.
sv: Med tolken är dokumentationen aldrig långt borta från studenten när de programmerar.

source: There are also good IDEs for Python. IDLE is a cross-platform IDE for Python that is written in Python using Tkinter. Emacs users will be happy to know that there is a very good Python mode for Emacs. All of these programming environments provide syntax highlighting, auto-indenting, and access to the interactive interpreter while coding. Consult `the Python wiki <https://wiki.python.org/moin/PythonEditors>`_ for a full list of Python editing environments.
sv: Det finns också bra IDE:er för Python. IDLE är en plattformsoberoende IDE för Python som är skriven i Python med hjälp av Tkinter. Emacs-användare kommer att bli glada över att veta att det finns ett mycket bra Python-läge för Emacs. Alla dessa programmeringsmiljöer erbjuder syntaxmarkering, automatisk indentering och tillgång till den interaktiva tolken när du kodar. Se `Python-wikin <https://wiki.python.org/moin/PythonEditors>`_ för en fullständig lista över Python-redigeringsmiljöer.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
sv: Om du vill diskutera Pythons användning inom utbildning kan du vara intresserad av att gå med i e-postlistan edu-sig <https://www.python.org/community/sigs/current/edu-sig>`_.
