Repository: yeager/python-docs-sv
Catalog: faq/general.po
Languages: sv

source: General Python FAQ
sv: Allmänna frågor och svar om Python

source: Contents
sv: Innehåll

source: General Information
sv: Allmän information

source: What is Python?
sv: Vad är Python?

source: Python is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. It supports multiple programming paradigms beyond object-oriented programming, such as procedural and functional programming. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants including Linux and macOS, and on Windows.
sv: Python är ett tolkat, interaktivt, objektorienterat programmeringsspråk. Det innehåller moduler, undantag, dynamisk typning, dynamiska datatyper på mycket hög nivå och klasser. Det stöder flera programmeringsparadigm utöver objektorienterad programmering, t.ex. procedurell och funktionell programmering. Python kombinerar enastående kraft med en mycket tydlig syntax. Det har gränssnitt mot många systemanrop och bibliotek, liksom mot olika fönstersystem, och är utbyggbart i C eller C++. Det är också användbart som ett tilläggsspråk för applikationer som behöver ett programmerbart gränssnitt. Slutligen är Python portabelt: det kan köras på många Unix-varianter, inklusive Linux och macOS, och på Windows.

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
sv: Om du vill veta mer kan du börja med :ref:`tutorial-index`. `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ länkar till andra inledande handledningar och resurser för att lära sig Python.

source: What is the Python Software Foundation?
sv: Vad är Python Software Foundation?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
sv: Python Software Foundation är en oberoende icke-vinstdrivande organisation som innehar upphovsrätten till Python version 2.1 och senare. PSF:s uppdrag är att främja teknik med öppen källkod som är relaterad till programmeringsspråket Python och att sprida användningen av Python. PSF:s hemsida finns på https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
sv: Donationer till PSF är skattebefriade i USA. Om du använder Python och tycker att det är till hjälp, vänligen bidra via ` PSF:s donationssida <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
sv: Finns det upphovsrättsliga begränsningar för användningen av Python?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
sv: Du kan göra vad du vill med källan, så länge du lämnar kvar upphovsrätten och visar den i all dokumentation om Python som du producerar. Om du respekterar upphovsrättsreglerna är det OK att använda Python för kommersiellt bruk, att sälja kopior av Python i källkod eller binär form (modifierad eller omodifierad) eller att sälja produkter som innehåller Python i någon form. Vi skulle naturligtvis fortfarande vilja veta om all kommersiell användning av Python.

source: See `the license page <https://docs.python.org/3/license.html>`_ to find further explanations and the full text of the PSF License.
sv: Se `licenssidan <https://docs.python.org/3/license.html>`_ för att hitta ytterligare förklaringar och den fullständiga texten till PSF-licensen.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
sv: Python-logotypen är varumärkesskyddad och i vissa fall krävs tillstånd för att använda den. Se "Policy för användning av varumärken" <https://www.python.org/psf/trademarks/>`__ för mer information.

source: Why was Python created in the first place?
sv: Varför skapades Python överhuvudtaget?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
sv: Här är en *mycket* kort sammanfattning av vad som startade det hela, skriven av Guido van Rossum:

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
sv: Jag hade lång erfarenhet av att implementera ett tolkat språk i ABC-gruppen på CWI, och genom att arbeta med denna grupp hade jag lärt mig mycket om språkdesign. Detta är ursprunget till många Python-egenskaper, inklusive användningen av indrag för gruppering av satser och införandet av datatyper på mycket hög nivå (även om detaljerna är helt annorlunda i Python).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
sv: Jag hade ett antal invändningar mot ABC-språket, men gillade också många av dess funktioner. Det var omöjligt att utöka ABC-språket (eller dess implementering) för att avhjälpa mina klagomål - i själva verket var dess brist på utbyggbarhet ett av dess största problem. Jag hade viss erfarenhet av att använda Modula-2+ och talade med konstruktörerna av Modula-3 och läste Modula-3-rapporten. Modula-3 är ursprunget till syntaxen och semantiken som används för undantag och några andra Python-funktioner.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
sv: Jag arbetade i Amoebas grupp för distribuerade operativsystem på CWI. Vi behövde ett bättre sätt att sköta systemadministrationen än genom att skriva C-program eller Bourne Shell-skript, eftersom Amoeba hade ett eget gränssnitt för systemanrop som inte var lätt att komma åt från Bourne Shell. Min erfarenhet av felhantering i Amoeba gjorde mig mycket medveten om vikten av undantag som en funktion i programmeringsspråket.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
sv: Det slog mig att ett skriptspråk med en syntax som ABC men med tillgång till Amoebas systemanrop skulle fylla behovet. Jag insåg att det skulle vara dumt att skriva ett Amoeba-specifikt språk, så jag bestämde mig för att jag behövde ett språk som var allmänt utbyggbart.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
sv: Under julhelgen 1989 hade jag mycket tid över, så jag bestämde mig för att ge det ett försök. Under det följande året, då jag fortfarande mest arbetade med det på min fritid, användes Python i Amoeba-projektet med ökande framgång, och feedback från kollegor fick mig att lägga till många tidiga förbättringar.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
sv: I februari 1991, efter drygt ett års utveckling, bestämde jag mig för att skicka ett inlägg till USENET. Resten finns i filen ``Misc/HISTORY``.

source: What is Python good for?
sv: Vad är Python bra för?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
sv: Python är ett allmänt programmeringsspråk på hög nivå som kan användas för att lösa många olika typer av problem.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
sv: Språket levereras med ett stort standardbibliotek som täcker områden som strängbehandling (reguljära uttryck, Unicode, beräkning av skillnader mellan filer), internetprotokoll (HTTP, FTP, SMTP, XML-RPC, POP, IMAP), programvaruteknik (enhetstestning, loggning, profilering, parsning av Python-kod) och operativsystemgränssnitt (systemanrop, filsystem, TCP/IP-sockets). Titta på innehållsförteckningen för :ref:`library-index` för att få en uppfattning om vad som finns tillgängligt. En mängd olika tillägg från tredje part finns också tillgängliga. Konsultera `the Python Package Index <https://pypi.org>`_ för att hitta paket av intresse för dig.

source: How does the Python version numbering scheme work?
sv: Hur fungerar Pythons versionsnumreringssystem?

source: Python versions are numbered "A.B.C" or "A.B":
sv: Python-versionerna är numrerade "A.B.C" eller "A.B":

source: *A* is the major version number -- it is only incremented for really major changes in the language.
sv: *A* är det viktigaste versionsnumret - det höjs bara vid riktigt stora förändringar i språket.

source: *B* is the minor version number -- it is incremented for less earth-shattering changes.
sv: *B* är det mindre versionsnumret - det ökas för mindre omvälvande förändringar.

source: *C* is the micro version number -- it is incremented for each bugfix release.
sv: *C* är mikroversionsnumret - det ökas för varje bugfixversion.

source: Not all releases are bugfix releases. In the run-up to a new feature release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
sv: Alla releaser är inte bugfixreleaser. Inför lanseringen av en ny funktion görs en serie utvecklingsreleaser som benämns alfa, beta eller releasekandidat. Alphas är tidiga releaser där gränssnitten ännu inte är färdigställda; det är inte oväntat att se en gränssnittsändring mellan två alpha-releaser. Betaversioner är mer stabila och bevarar befintliga gränssnitt men lägger eventuellt till nya moduler, medan releasekandidater är frysta och inte gör några ändringar förutom de som behövs för att åtgärda kritiska buggar.

source: Alpha, beta and release candidate versions have an additional suffix:
sv: Alfa-, beta- och releasekandidatversioner har ett ytterligare suffix:

source: The suffix for an alpha version is "aN" for some small number *N*.
sv: Suffixet för en alpha-version är "aN" för ett litet antal *N*.

source: The suffix for a beta version is "bN" for some small number *N*.
sv: Suffixet för en betaversion är "bN" för ett litet antal *N*.

source: The suffix for a release candidate version is "rcN" for some small number *N*.
sv: Suffixet för en release candidate-version är "rcN" för ett litet antal *N*.

source: In other words, all versions labeled *2.0aN* precede the versions labeled *2.0bN*, which precede versions labeled *2.0rcN*, and *those* precede 2.0.
sv: Med andra ord, alla versioner märkta *2.0aN* föregår versionerna märkta *2.0bN*, som föregår versionerna märkta *2.0rcN*, och *de* föregår 2.0.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
sv: Du kan också hitta versionsnummer med ett "+" suffix, t.ex. "2.2+". Dessa är outgivna versioner, byggda direkt från CPython-utvecklingsförvaret. I praktiken, efter att en slutlig mindre version har gjorts, ökas versionen till nästa mindre version, som blir "a0"-versionen, t.ex. "2.4a0".

source: See the `Developer's Guide <https://devguide.python.org/developer-workflow/development-cycle/>`__ for more information about the development cycle, and :pep:`387` to learn more about Python's backward compatibility policy. See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
sv: Se `Developer's Guide <https://devguide.python.org/developer-workflow/development-cycle/>`__ för mer information om utvecklingscykeln, och :pep:`387` för att lära dig mer om Pythons policy för bakåtkompatibilitet. Se även dokumentationen för :data:`sys.version`, :data:`sys.hexversion` och :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
sv: Hur får jag tag på en kopia av Python-källan?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
sv: Den senaste källdistributionen för Python finns alltid tillgänglig från python.org, https://www.python.org/downloads/. De senaste utvecklingskällorna kan erhållas på https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
sv: Källdistributionen är en gzippad tar-fil som innehåller den fullständiga C-källan, dokumentation i Sphinx-format, Python-biblioteksmoduler, exempelprogram och flera användbara delar av fritt distribuerbar programvara. Källan kompileras och körs direkt på de flesta UNIX-plattformar.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
sv: Läs avsnittet `Getting Started i Python Developer's Guide <https://devguide.python.org/setup/>`__ för mer information om hur du hämtar källkoden och kompilerar den.

source: How do I get documentation on Python?
sv: Hur får jag tag på dokumentation om Python?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
sv: Standarddokumentationen för den aktuella stabila versionen av Python finns på https://docs.python.org/3/. PDF-, klartext- och nedladdningsbara HTML-versioner finns också på https://docs.python.org/3/download.html.

source: The documentation is written in reStructuredText and processed by `the Sphinx documentation tool <https://www.sphinx-doc.org/>`__. The reStructuredText source for the documentation is part of the Python source distribution.
sv: Dokumentationen är skriven i reStructuredText och bearbetad av "dokumentationsverktyget Sphinx" <https://www.sphinx-doc.org/>`__. Källan reStructuredText för dokumentationen är en del av Python-källdistributionen.

source: I've never programmed before. Is there a Python tutorial?
sv: Jag har aldrig programmerat förut. Finns det en Python-handledning?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
sv: Det finns många handledningar och böcker tillgängliga. I standarddokumentationen ingår :ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
sv: I Nybörjarguiden <https://wiki.python.org/moin/BeginnersGuide>`_ finns information för nybörjare som programmerar Python, inklusive listor över självstudier.

source: Is there a newsgroup or mailing list devoted to Python?
sv: Finns det en nyhetsgrupp eller e-postlista som ägnas åt Python?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
sv: Det finns en nyhetsgrupp, :newsgroup:`comp.lang.python`, och en e-postlista, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. Nyhetsgruppen och e-postlistan är gatewayade till varandra -- om du kan läsa nyheter är det onödigt att prenumerera på e-postlistan. :newsgroup:`comp.lang.python` är högtrafikerad och får hundratals inlägg varje dag, och Usenet-läsare är ofta bättre på att hantera denna volym.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman3/lists/python-announce-list.python.org/>`_.
sv: Tillkännagivanden om nya programversioner och evenemang finns i comp.lang.python.announce, en modererad lista med låg trafik som får cirka fem inlägg per dag. Den finns tillgänglig som `the python-announce mailing list <https://mail.python.org/mailman3/lists/python-announce-list.python.org/>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
sv: Mer information om andra e-postlistor och nyhetsgrupper finns på https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
sv: Hur får jag en beta-testversion av Python?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
sv: Alpha- och betaversioner finns tillgängliga från https://www.python.org/downloads/. Alla utgåvor meddelas i nyhetsgrupperna comp.lang.python och comp.lang.python.announce och på Pythons hemsida https://www.python.org/; ett RSS-flöde med nyheter finns tillgängligt.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
sv: Du kan också få tillgång till utvecklingsversionen av Python via Git. Se `The Python Developer's Guide <https://devguide.python.org/>`_ för mer information.

source: How do I submit bug reports and patches for Python?
sv: Hur skickar jag in felrapporter och korrigeringar för Python?

source: To report a bug or submit a patch, use the issue tracker at https://github.com/python/cpython/issues.
sv: För att rapportera en bugg eller skicka in en patch, använd problemspåraren på https://github.com/python/cpython/issues.

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
sv: Mer information om hur Python utvecklas finns i `Python Developer's Guide <https://devguide.python.org/>`_.

source: Are there any published articles about Python that I can reference?
sv: Finns det några publicerade artiklar om Python som jag kan hänvisa till?

source: It's probably best to cite your favorite book about Python.
sv: Det är nog bäst att citera din favoritbok om Python.

source: The `very first article <https://ir.cwi.nl/pub/18204>`_ about Python was written in 1991 and is now quite outdated.
sv: Den "allra första artikeln <https://ir.cwi.nl/pub/18204>`_ om Python skrevs 1991 och är nu ganska föråldrad.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
sv: Guido van Rossum och Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, volym 4, nummer 4 (december 1991), Amsterdam, s. 283--303.

source: Are there any books on Python?
sv: Finns det några böcker om Python?

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
sv: Ja, det finns många, och fler publiceras. Se python.org wiki på https://wiki.python.org/moin/PythonBooks för en lista.

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
sv: Du kan också söka efter "Python" i nätbokhandlar och filtrera bort Monty Python-referenserna, eller kanske söka efter "Python" och "språk".

source: Where in the world is www.python.org located?
sv: Var i världen finns www.python.org?

source: The Python project's infrastructure is located all over the world and is managed by the Python Infrastructure Team. Details `here <https://infra.psf.io>`__.
sv: Python-projektets infrastruktur finns över hela världen och hanteras av Python Infrastructure Team. Mer information finns här <https://infra.psf.io>`__.

source: Why is it called Python?
sv: Varför kallas det Python?
