Repository: yeager/python-docs-sv
Catalog: faq/installed.po
Languages: sv

source: "Why is Python Installed on my Computer?" FAQ
sv: "Varför är Python installerat på min dator?" Frågor och svar

source: What is Python?
sv: Vad är Python?

source: Python is a programming language. It's used for many different applications. It's used in some high schools and colleges as an introductory programming language because Python is easy to learn, but it's also used by professional software developers at places such as Google, NASA, and Lucasfilm Ltd.
sv: Python är ett programmeringsspråk. Det används för många olika tillämpningar. Det används i vissa gymnasieskolor och högskolor som ett inledande programmeringsspråk eftersom Python är lätt att lära sig, men det används också av professionella programutvecklare på platser som Google, NASA och Lucasfilm Ltd.

source: If you wish to learn more about Python, start with the `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.
sv: Om du vill lära dig mer om Python kan du börja med `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.

source: Why is Python installed on my machine?
sv: Varför är Python installerat på min maskin?

source: If you find Python installed on your system but don't remember installing it, there are several possible ways it could have gotten there.
sv: Om du hittar Python installerat på ditt system men inte kommer ihåg att du installerade det, finns det flera möjliga sätt det kan ha hamnat där.

source: Perhaps another user on the computer wanted to learn programming and installed it; you'll have to figure out who's been using the machine and might have installed it.
sv: Kanske en annan användare på datorn ville lära sig programmering och installerade den; du måste ta reda på vem som har använt maskinen och kan ha installerat den.

source: A third-party application installed on the machine might have been written in Python and included a Python installation. There are many such applications, from GUI programs to network servers and administrative scripts.
sv: En tredjepartsapplikation som installerats på maskinen kan ha skrivits i Python och inkluderat en Python-installation. Det finns många sådana program, från GUI-program till nätverksservrar och administrativa skript.

source: Some Windows machines also have Python installed. At this writing we're aware of computers from Hewlett-Packard and Compaq that include Python. Apparently some of HP/Compaq's administrative tools are written in Python.
sv: Vissa Windows-maskiner har också Python installerat. I skrivande stund känner vi till datorer från Hewlett-Packard och Compaq som innehåller Python. Tydligen är några av HP/Compaqs administrativa verktyg skrivna i Python.

source: Many Unix-compatible operating systems, such as macOS and some Linux distributions, have Python installed by default; it's included in the base installation.
sv: Många Unix-kompatibla operativsystem, t.ex. macOS och vissa Linux-distributioner, har Python installerat som standard; det ingår i grundinstallationen.

source: Can I delete Python?
sv: Kan jag ta bort Python?

source: That depends on where Python came from.
sv: Det beror på var Python kommer ifrån.

source: If someone installed it deliberately, you can remove it without hurting anything. On Windows, use the Add/Remove Programs icon in the Control Panel.
sv: Om någon har installerat det avsiktligt kan du ta bort det utan att skada något. I Windows använder du ikonen Lägg till/ta bort program i Kontrollpanelen.

source: If Python was installed by a third-party application, you can also remove it, but that application will no longer work. You should use that application's uninstaller rather than removing Python directly.
sv: Om Python installerades av en tredjepartsapplikation kan du också ta bort den, men den applikationen kommer inte längre att fungera. Du bör använda programmets avinstallerare i stället för att ta bort Python direkt.

source: If Python came with your operating system, removing it is not recommended. If you remove it, whatever tools were written in Python will no longer run, and some of them might be important to you. Reinstalling the whole system would then be required to fix things again.
sv: Om Python följde med operativsystemet är det inte rekommenderat att ta bort det. Om du tar bort det kommer de verktyg som är skrivna i Python inte längre att köras, och vissa av dem kan vara viktiga för dig. Då måste man installera om hela systemet för att fixa saker och ting igen.
