Repository: yeager/python-docs-sv
Catalog: whatsnew/2.0.po
Languages: sv

source: The answer is that Python 2.0's :mod:`xml` package isn't compatible with PyXML, but can be made compatible by installing a recent version PyXML. Many applications can get by with the XML support that is included with Python 2.0, but more complicated applications will require that the full PyXML package will be installed. When installed, PyXML versions 0.6.0 or greater will replace the :mod:`xml` package shipped with Python, and will be a strict superset of the standard package, adding a bunch of additional features. Some of the additional features in PyXML include:
sv: Svaret är att Python 2.0:s :mod:`xml`-paket inte är kompatibelt med PyXML, men kan göras kompatibelt genom att installera en ny version av PyXML. Många applikationer kan klara sig med XML-stödet som ingår i Python 2.0, men mer komplicerade applikationer kräver att hela PyXML-paketet installeras. När PyXML version 0.6.0 eller senare installeras kommer den att ersätta :mod:`xml`-paketet som levereras med Python, och kommer att vara en strikt överuppsättning av standardpaketet och lägga till en massa ytterligare funktioner. Några av de ytterligare funktionerna i PyXML inkluderar:

source: 4DOM, a full DOM implementation from FourThought, Inc.
sv: 4DOM, en fullständig DOM-implementering från FourThought, Inc.

source: The xmlproc validating parser, written by Lars Marius Garshol.
sv: Den validerande parsern xmlproc, skriven av Lars Marius Garshol.

source: The :mod:`!sgmlop` parser accelerator module, written by Fredrik Lundh.
sv: Parseracceleratormodulen :mod:`!sgmlop`, skriven av Fredrik Lundh.

source: Module changes
sv: Moduländringar

source: Lots of improvements and bugfixes were made to Python's extensive standard library; some of the affected modules include :mod:`readline`, :mod:`ConfigParser <configparser>`, :mod:`!cgi`, :mod:`calendar`, :mod:`posix`, :mod:`readline`, :mod:`!xmllib`, :mod:`!aifc`, :mod:`!chunk`, :mod:`wave`, :mod:`random`, :mod:`shelve`, and :mod:`!nntplib`. Consult the CVS logs for the exact patch-by-patch details.
sv: Massor av förbättringar och buggfixar har gjorts i Pythons omfattande standardbibliotek; några av de berörda modulerna inkluderar :mod:`readline`, :mod:`ConfigParser <configparser>`, :mod:`!cgi`, :mod:`calendar`, :mod:`posix`, :mod:`readline`, :mod:`!xmllib`, :mod:`!aifc`, :mod:`!chunk`, :mod:`wave`, :mod:`random`, :mod:`shelve`, och :mod:`!nntplib`. Se CVS-loggarna för exakta detaljer för varje patch.

source: Brian Gallew contributed OpenSSL support for the :mod:`socket` module. OpenSSL is an implementation of the Secure Socket Layer, which encrypts the data being sent over a socket. When compiling Python, you can edit :file:`Modules/Setup` to include SSL support, which adds an additional function to the :mod:`socket` module: ``socket.ssl(socket, keyfile, certfile)``, which takes a socket object and returns an SSL socket. The :mod:`httplib <http>` and :mod:`urllib` modules were also changed to support ``https://`` URLs, though no one has implemented FTP or SMTP over SSL.
sv: Brian Gallew har bidragit med OpenSSL-stöd för modulen :mod:`socket`. OpenSSL är en implementering av Secure Socket Layer, som krypterar data som skickas över ett uttag. När du kompilerar Python kan du redigera :file:`Modules/Setup` för att inkludera SSL-stöd, vilket lägger till en ytterligare funktion till :mod:`socket`-modulen: ``socket.ssl(socket, keyfile, certfile)``, som tar ett socket-objekt och returnerar ett SSL-socket. Modulerna :mod:`httplib <http>` och :mod:`urllib` ändrades också för att stödja ``https://`` URL:er, även om ingen har implementerat FTP eller SMTP över SSL.

source: The :mod:`httplib <http>` module has been rewritten by Greg Stein to support HTTP/1.1.
sv: Modulen :mod:`httplib <http>` har skrivits om av Greg Stein för att stödja HTTP/1.1.

source: Backward compatibility with the 1.5 version of :mod:`!httplib` is provided, though using HTTP/1.1 features such as pipelining will require rewriting code to use a different set of interfaces.
sv: Bakåtkompatibilitet med 1.5-versionen av :mod:`!httplib` tillhandahålls, men för att använda HTTP/1.1-funktioner som pipelining måste koden skrivas om för att använda en annan uppsättning gränssnitt.

source: The :mod:`!Tkinter` module now supports Tcl/Tk version 8.1, 8.2, or 8.3, and support for the older 7.x versions has been dropped. The Tkinter module now supports displaying Unicode strings in Tk widgets. Also, Fredrik Lundh contributed an optimization which makes operations like ``create_line`` and ``create_polygon`` much faster, especially when using lots of coordinates.
sv: Modulen :mod:`!Tkinter` stöder nu Tcl/Tk version 8.1, 8.2 eller 8.3, och stödet för de äldre 7.x-versionerna har tagits bort. Tkinter-modulen stöder nu visning av Unicode-strängar i Tk-widgetar. Fredrik Lundh har också bidragit med en optimering som gör operationer som ``create_line`` och ``create_polygon`` mycket snabbare, särskilt när många koordinater används.

source: The :mod:`curses` module has been greatly extended, starting from Oliver Andrich's enhanced version, to provide many additional functions from ncurses and SYSV curses, such as colour, alternative character set support, pads, and mouse support. This means the module is no longer compatible with operating systems that only have BSD curses, but there don't seem to be any currently maintained OSes that fall into this category.
sv: Modulen :mod:`curses` har utökats kraftigt, med utgångspunkt från Oliver Andrichs förbättrade version, för att tillhandahålla många ytterligare funktioner från ncurses och SYSV curses, t.ex. färg, stöd för alternativa teckenuppsättningar, paddar och musstöd. Detta innebär att modulen inte längre är kompatibel med operativsystem som endast har BSD-curses, men det verkar inte finnas några operativsystem som för närvarande underhålls som faller inom denna kategori.

source: As mentioned in the earlier discussion of 2.0's Unicode support, the underlying implementation of the regular expressions provided by the :mod:`re` module has been changed. SRE, a new regular expression engine written by Fredrik Lundh and partially funded by Hewlett Packard, supports matching against both 8-bit strings and Unicode strings.
sv: Som nämndes i den tidigare diskussionen om 2.0:s Unicode-stöd har den underliggande implementeringen av de reguljära uttryck som tillhandahålls av modulen :mod:`re` ändrats. SRE, en ny motor för reguljära uttryck skriven av Fredrik Lundh och delvis finansierad av Hewlett Packard, stöder matchning mot både 8-bitarssträngar och Unicode-strängar.

source: New modules
sv: Nya moduler

source: A number of new modules were added. We'll simply list them with brief descriptions; consult the 2.0 documentation for the details of a particular module.
sv: Ett antal nya moduler har tillkommit. Vi listar dem helt enkelt med korta beskrivningar; se 2.0-dokumentationen för detaljerna i en viss modul.

source: :mod:`atexit`: For registering functions to be called before the Python interpreter exits. Code that currently sets ``sys.exitfunc`` directly should be changed to use the :mod:`atexit` module instead, importing :mod:`atexit` and calling :func:`atexit.register` with the function to be called on exit. (Contributed by Skip Montanaro.)
sv: :mod:`atexit`: För registrering av funktioner som ska anropas innan Python-tolken avslutas. Kod som för närvarande anger ``sys.exitfunc`` direkt bör ändras så att den istället använder modulen :mod:`atexit`, importerar :mod:`atexit` och anropar :func:`atexit.register` med den funktion som ska anropas vid avslut. (Bidrag från Skip Montanaro.)

source: :mod:`codecs`, :mod:`!encodings`, :mod:`unicodedata`: Added as part of the new Unicode support.
sv: :mod:`codecs`, :mod:`!encodings`, :mod:`unicodedata`: Tillagd som en del av det nya Unicode-stödet.

source: :mod:`filecmp`: Supersedes the old :mod:`!cmp`, :mod:`!cmpcache` and :mod:`!dircmp` modules, which have now become deprecated. (Contributed by Gordon MacMillan and Moshe Zadka.)
sv: :mod:`filecmp`: Ersätter de gamla modulerna :mod:`!cmp`, :mod:`!cmpcache` och :mod:`!dircmp`, som nu har blivit föråldrade. (Bidrag från Gordon MacMillan och Moshe Zadka.)

source: :mod:`gettext`: This module provides internationalization (I18N) and localization (L10N) support for Python programs by providing an interface to the GNU gettext message catalog library. (Integrated by Barry Warsaw, from separate contributions by Martin von Löwis, Peter Funk, and James Henstridge.)
sv: :mod:`gettext`: Denna modul ger stöd för internationalisering (I18N) och lokalisering (L10N) för Python-program genom att tillhandahålla ett gränssnitt till meddelandekatalogbiblioteket GNU gettext. (Integrerad av Barry Warsaw, från separata bidrag av Martin von Löwis, Peter Funk och James Henstridge)

source: :mod:`!linuxaudiodev`: Support for the :file:`/dev/audio` device on Linux, a twin to the existing :mod:`!sunaudiodev` module. (Contributed by Peter Bosch, with fixes by Jeremy Hylton.)
sv: :mod:`!linuxaudiodev`: Stöd för enheten :file:`/dev/audio` på Linux, en tvilling till den befintliga modulen :mod:`!sunaudiodev`. (Bidrag från Peter Bosch, med korrigeringar av Jeremy Hylton.)

source: :mod:`mmap`: An interface to memory-mapped files on both Windows and Unix. A file's contents can be mapped directly into memory, at which point it behaves like a mutable string, so its contents can be read and modified. They can even be passed to functions that expect ordinary strings, such as the :mod:`re` module. (Contributed by Sam Rushing, with some extensions by A.M. Kuchling.)
sv: :mod:`mmap`: Ett gränssnitt för minnesmappade filer på både Windows och Unix. En fils innehåll kan mappas direkt till minnet, varvid den beter sig som en föränderlig sträng, så att dess innehåll kan läsas och ändras. De kan även skickas till funktioner som förväntar sig vanliga strängar, t.ex. modulen :mod:`re`. (Bidrag från Sam Rushing, med vissa tillägg av A.M. Kuchling.)

source: :mod:`!pyexpat`: An interface to the Expat XML parser. (Contributed by Paul Prescod.)
sv: :mod:`!pyexpat`: Ett gränssnitt till XML-parsern Expat. (Bidrag från Paul Prescod.)

source: :mod:`robotparser <urllib.robotparser>`: Parse a :file:`robots.txt` file, which is used for writing web spiders that politely avoid certain areas of a web site. The parser accepts the contents of a :file:`robots.txt` file, builds a set of rules from it, and can then answer questions about the fetchability of a given URL. (Contributed by Skip Montanaro.)
sv: :mod:`robotparser <urllib.robotparser>`: Parsa en :file:`robots.txt`-fil, som används för att skriva webbspindlar som artigt undviker vissa områden på en webbplats. Parsern accepterar innehållet i en :file:`robots.txt`-fil, bygger en uppsättning regler från den och kan sedan svara på frågor om hämtbarheten för en given URL. (Bidrag från Skip Montanaro.)

source: :mod:`tabnanny`: A module/script to check Python source code for ambiguous indentation. (Contributed by Tim Peters.)
sv: :mod:`tabnanny`: En modul/ett skript för att kontrollera Python-källkod för tvetydig indragning. (Bidrag från Tim Peters.)

source: :mod:`!UserString`: A base class useful for deriving objects that behave like strings.
sv: :mod:`!UserString`: En basklass som är användbar för att härleda objekt som beter sig som strängar.

source: :mod:`webbrowser`: A module that provides a platform independent way to launch a web browser on a specific URL. For each platform, various browsers are tried in a specific order. The user can alter which browser is launched by setting the *BROWSER* environment variable. (Originally inspired by Eric S. Raymond's patch to :mod:`urllib` which added similar functionality, but the final module comes from code originally implemented by Fred Drake as :file:`Tools/idle/BrowserControl.py`, and adapted for the standard library by Fred.)
sv: :mod:`webbrowser`: En modul som tillhandahåller ett plattformsoberoende sätt att starta en webbläsare på en specifik URL. För varje plattform testas olika webbläsare i en specifik ordning. Användaren kan ändra vilken webbläsare som startas genom att ställa in miljövariabeln *BROWSER*. (Ursprungligen inspirerad av Eric S. Raymonds patch till :mod:`urllib` som lade till liknande funktionalitet, men den slutliga modulen kommer från kod som ursprungligen implementerades av Fred Drake som :file:`Tools/idle/BrowserControl.py`, och anpassades för standardbiblioteket av Fred)

source: :mod:`_winreg <winreg>`: An interface to the Windows registry. :mod:`!_winreg` is an adaptation of functions that have been part of PythonWin since 1995, but has now been added to the core distribution, and enhanced to support Unicode. :mod:`!_winreg` was written by Bill Tutt and Mark Hammond.
sv: :mod:`_winreg <winreg>`: Ett gränssnitt till Windows-registret. :mod:`!_winreg` är en anpassning av funktioner som har ingått i PythonWin sedan 1995, men som nu har lagts till i kärndistributionen och förbättrats för att stödja Unicode. :mod:`!_winreg` skrevs av Bill Tutt och Mark Hammond.

source: :mod:`zipfile`: A module for reading and writing ZIP-format archives. These are archives produced by :program:`PKZIP` on DOS/Windows or :program:`zip` on Unix, not to be confused with :program:`gzip`\ -format files (which are supported by the :mod:`gzip` module) (Contributed by James C. Ahlstrom.)
sv: :mod:`zipfile`: En modul för att läsa och skriva ZIP-formatarkiv. Det här är arkiv som produceras av :program:`PKZIP` på DOS/Windows eller :program:`zip` på Unix, inte att förväxla med :program:`gzip` -formatfiler (som stöds av modulen :mod:`gzip`) (Bidrag från James C. Ahlstrom.)

source: :mod:`!imputil`: A module that provides a simpler way for writing customized import hooks, in comparison to the existing :mod:`!ihooks` module. (Implemented by Greg Stein, with much discussion on python-dev along the way.)
sv: :mod:`!imputil`: En modul som ger ett enklare sätt att skriva anpassade importkrokar, jämfört med den befintliga modulen :mod:`!ihooks`. (Implementerad av Greg Stein, med mycket diskussion på python-dev under resans gång)

source: IDLE Improvements
sv: IDLE Förbättringar

source: IDLE is the official Python cross-platform IDE, written using Tkinter. Python 2.0 includes IDLE 0.6, which adds a number of new features and improvements. A partial list:
sv: IDLE är Pythons officiella plattformsoberoende IDE, skriven med hjälp av Tkinter. Python 2.0 inkluderar IDLE 0.6, som lägger till ett antal nya funktioner och förbättringar. En partiell lista:

source: UI improvements and optimizations, especially in the area of syntax highlighting and auto-indentation.
sv: Förbättringar och optimeringar av användargränssnittet, särskilt när det gäller syntaxmarkering och automatisk indentation.

source: The class browser now shows more information, such as the top level functions in a module.
sv: Klassbläddraren visar nu mer information, t.ex. funktionerna på högsta nivån i en modul.

source: Tab width is now a user settable option. When opening an existing Python file, IDLE automatically detects the indentation conventions, and adapts.
sv: Tabbredd är nu ett alternativ som kan ställas in av användaren. När du öppnar en befintlig Python-fil upptäcker IDLE automatiskt indragningskonventionerna och anpassar sig.

source: There is now support for calling browsers on various platforms, used to open the Python documentation in a browser.
sv: Det finns nu stöd för att anropa webbläsare på olika plattformar, som används för att öppna Python-dokumentationen i en webbläsare.

source: IDLE now has a command line, which is largely similar to the vanilla Python interpreter.
sv: IDLE har nu en kommandorad som i stort sett liknar Pythons vaniljtolk.

source: Call tips were added in many places.
sv: Samtalstips har lagts till på många ställen.

source: IDLE can now be installed as a package.
sv: IDLE kan nu installeras som ett paket.

source: In the editor window, there is now a line/column bar at the bottom.
sv: I redigeringsfönstret finns det nu en rad-/kolumnrad längst ned.

source: Three new keystroke commands: Check module (:kbd:`Alt-F5`), Import module (:kbd:`F5`) and Run script (:kbd:`Ctrl-F5`).
sv: Tre nya tangenttryckningskommandon: Kontrollera modul (:kbd:`Alt-F5`), Importera modul (:kbd:`F5`) och Kör skript (:kbd:`Ctrl-F5`).

source: Deleted and Deprecated Modules
sv: Borttagna och föråldrade moduler

source: A few modules have been dropped because they're obsolete, or because there are now better ways to do the same thing. The :mod:`!stdwin` module is gone; it was for a platform-independent windowing toolkit that's no longer developed.
sv: Några moduler har tagits bort eftersom de är föråldrade eller för att det nu finns bättre sätt att göra samma sak. Modulen :mod:`!stdwin` är borta; den var för en plattformsoberoende verktygslåda för fönster som inte längre utvecklas.

source: A number of modules have been moved to the :file:`lib-old` subdirectory: :mod:`!cmp`, :mod:`!cmpcache`, :mod:`!dircmp`, :mod:`!dump`, :mod:`!find`, :mod:`!grep`, :mod:`!packmail`, :mod:`!poly`, :mod:`!util`, :mod:`!whatsound`, :mod:`!zmod`. If you have code which relies on a module that's been moved to :file:`lib-old`, you can simply add that directory to ``sys.path`` to get them back, but you're encouraged to update any code that uses these modules.
sv: Ett antal moduler har flyttats till underkatalogen :file:`lib-old`: :mod:`!cmp`, :mod:`!cmpcache`, :mod:`!dircmp`, :mod:`!dump`, :mod:`!find`, :mod:`!grep`, :mod:`!packmail`, :mod:`!poly`, :mod:`!util`, :mod:`!whatsound`, :mod:`!zmod`. Om du har kod som förlitar sig på en modul som har flyttats till :file:`lib-old`, kan du helt enkelt lägga till den katalogen i ``sys.path`` för att få tillbaka dem, men du uppmanas att uppdatera all kod som använder dessa moduler.

source: Acknowledgements
sv: Tack till

source: The authors would like to thank the following people for offering suggestions on various drafts of this article: David Bolen, Mark Hammond, Gregg Hauser, Jeremy Hylton, Fredrik Lundh, Detlef Lannert, Aahz Maruch, Skip Montanaro, Vladimir Marangozov, Tobias Polzin, Guido van Rossum, Neil Schemenauer, and Russ Schmidt.
sv: Författarna vill tacka följande personer för förslag på olika utkast till denna artikel: David Bolen, Mark Hammond, Gregg Hauser, Jeremy Hylton, Fredrik Lundh, Detlef Lannert, Aahz Maruch, Skip Montanaro, Vladimir Marangozov, Tobias Polzin, Guido van Rossum, Neil Schemenauer och Russ Schmidt.
