Repository: yeager/python-docs-sv
Catalog: whatsnew/2.0.po
Languages: sv

source: The version number of the Python C API was incremented, so C extensions compiled for 1.5.2 must be recompiled in order to work with 2.0. On Windows, it's not possible for Python 2.0 to import a third party extension built for Python 1.5.x due to how Windows DLLs work, so Python will raise an exception and the import will fail.
sv: Versionsnumret för Python C API ökades, så C-tillägg som kompilerats för 1.5.2 måste kompileras om för att fungera med 2.0. På Windows är det inte möjligt för Python 2.0 att importera ett tredjepartstillägg som är byggt för Python 1.5.x på grund av hur Windows DLL:er fungerar, så Python kommer att ge upphov till ett undantag och importen misslyckas.

source: Users of Jim Fulton's ExtensionClass module will be pleased to find out that hooks have been added so that ExtensionClasses are now supported by :func:`isinstance` and :func:`issubclass`. This means you no longer have to remember to write code such as ``if type(obj) == myExtensionClass``, but can use the more natural ``if isinstance(obj, myExtensionClass)``.
sv: Användare av Jim Fultons ExtensionClass-modul kommer att bli glada över att få reda på att krokar har lagts till så att ExtensionClasses nu stöds av :func:`isinstance` och :func:`issubclass`. Detta innebär att du inte längre behöver komma ihåg att skriva kod som ``if type(obj) == myExtensionClass``, utan kan använda den mer naturliga ``if isinstance(obj, myExtensionClass)``.

source: The :file:`Python/importdl.c` file, which was a mass of #ifdefs to support dynamic loading on many different platforms, was cleaned up and reorganised by Greg Stein. :file:`importdl.c` is now quite small, and platform-specific code has been moved into a bunch of :file:`Python/dynload_\*.c` files. Another cleanup: there were also a number of :file:`my\*.h` files in the Include/ directory that held various portability hacks; they've been merged into a single file, :file:`Include/pyport.h`.
sv: Filen :file:`Python/importdl.c`, som var en massa #ifdefs för att stödja dynamisk laddning på många olika plattformar, rensades upp och omorganiserades av Greg Stein. :file:`importdl.c` är nu ganska liten, och plattformsspecifik kod har flyttats till ett gäng :file:`Python/dynload_\*.c`-filer. En annan uppstädning: det fanns också ett antal :file:`my\*.h`-filer i Include/-katalogen som innehöll olika portabilitetshacks; de har slagits samman till en enda fil, :file:`Include/pyport.h`.

source: Vladimir Marangozov's long-awaited malloc restructuring was completed, to make it easy to have the Python interpreter use a custom allocator instead of C's standard :c:func:`malloc`. For documentation, read the comments in :file:`Include/pymem.h` and :file:`Include/objimpl.h`. For the lengthy discussions during which the interface was hammered out, see the web archives of the 'patches' and 'python-dev' lists at python.org.
sv: Vladimir Marangozovs efterlängtade malloc-omstrukturering slutfördes, för att göra det enkelt att få Python-tolken att använda en anpassad allokering istället för C:s standard :c:func:`malloc`. För dokumentation, läs kommentarerna i :file:`Include/pymem.h` och :file:`Include/objimpl.h`. För de långa diskussioner under vilka gränssnittet hamrades fram, se webbarkiven för listorna 'patches' och 'python-dev' på python.org.

source: Recent versions of the GUSI development environment for MacOS support POSIX threads. Therefore, Python's POSIX threading support now works on the Macintosh. Threading support using the user-space GNU ``pth`` library was also contributed.
sv: Nya versioner av utvecklingsmiljön GUSI för MacOS har stöd för POSIX-trådar. Därför fungerar nu Pythons stöd för POSIX-trådar på Macintosh. Stöd för trådar som använder GNU ``pth``-biblioteket i användarutrymmet har också bidragit.

source: Threading support on Windows was enhanced, too. Windows supports thread locks that use kernel objects only in case of contention; in the common case when there's no contention, they use simpler functions which are an order of magnitude faster. A threaded version of Python 1.5.2 on NT is twice as slow as an unthreaded version; with the 2.0 changes, the difference is only 10%. These improvements were contributed by Yakov Markovitch.
sv: Stödet för trådar i Windows har också förbättrats. Windows stöder trådlås som använder kärnobjekt endast i händelse av konkurrens; i det vanliga fallet när det inte finns någon konkurrens använder de enklare funktioner som är en storleksordning snabbare. En trådad version av Python 1.5.2 på NT är dubbelt så långsam som en otrådad version; med ändringarna i 2.0 är skillnaden bara 10%. Yakov Markovitch har bidragit med dessa förbättringar.

source: Python 2.0's source now uses only ANSI C prototypes, so compiling Python now requires an ANSI C compiler, and can no longer be done using a compiler that only supports K&R C.
sv: Python 2.0:s källkod använder nu bara ANSI C-prototyper, så för att kompilera Python krävs nu en ANSI C-kompilator och det går inte längre att använda en kompilator som bara stöder K&R C.

source: Previously the Python virtual machine used 16-bit numbers in its bytecode, limiting the size of source files. In particular, this affected the maximum size of literal lists and dictionaries in Python source; occasionally people who are generating Python code would run into this limit. A patch by Charles G. Waldman raises the limit from ``2**16`` to ``2**32``.
sv: Tidigare använde den virtuella Python-maskinen 16-bitars tal i sin bytekod, vilket begränsade storleken på källfiler. I synnerhet påverkade detta den maximala storleken på bokstavslistor och lexikon i Python-källkod; ibland kunde personer som genererade Python-kod stöta på denna gräns. En patch av Charles G. Waldman höjer gränsen från ``2**16`` till ``2**32``.

source: Three new convenience functions intended for adding constants to a module's dictionary at module initialization time were added: :c:func:`PyModule_AddObject`, :c:func:`PyModule_AddIntConstant`, and :c:func:`PyModule_AddStringConstant`. Each of these functions takes a module object, a null-terminated C string containing the name to be added, and a third argument for the value to be assigned to the name. This third argument is, respectively, a Python object, a C long, or a C string.
sv: Tre nya bekvämlighetsfunktioner avsedda för att lägga till konstanter till en moduls ordbok vid modulens initialiseringstid har lagts till: :c:func:`PyModule_AddObject`, :c:func:`PyModule_AddIntConstant` och :c:func:`PyModule_AddStringConstant`. Var och en av dessa funktioner tar ett modulobjekt, en nollavslutad C-sträng som innehåller det namn som ska läggas till och ett tredje argument för det värde som ska tilldelas namnet. Det tredje argumentet är ett Python-objekt, en C-long eller en C-sträng.

source: A wrapper API was added for Unix-style signal handlers. :c:func:`PyOS_getsig` gets a signal handler and :c:func:`PyOS_setsig` will set a new handler.
sv: Ett omslags-API har lagts till för signalhanterare i Unix-stil. :c:func:`PyOS_getsig` hämtar en signalhanterare och :c:func:`PyOS_setsig` ställer in en ny hanterare.

source: Distutils: Making Modules Easy to Install
sv: Distutils: Gör det enkelt att installera moduler

source: Before Python 2.0, installing modules was a tedious affair -- there was no way to figure out automatically where Python is installed, or what compiler options to use for extension modules. Software authors had to go through an arduous ritual of editing Makefiles and configuration files, which only really work on Unix and leave Windows and MacOS unsupported. Python users faced wildly differing installation instructions which varied between different extension packages, which made administering a Python installation something of a chore.
sv: Före Python 2.0 var det en tråkig historia att installera moduler - det fanns inget sätt att automatiskt ta reda på var Python var installerat eller vilka kompilatoralternativ som skulle användas för tilläggsmoduler. Programvaruförfattare var tvungna att gå igenom en mödosam ritual med att redigera Makefiles och konfigurationsfiler, som egentligen bara fungerar på Unix och inte stöder Windows och MacOS. Python-användare möttes av vitt skilda installationsinstruktioner som varierade mellan olika tilläggspaket, vilket gjorde det till något av en utmaning att administrera en Python-installation.

source: The SIG for distribution utilities, shepherded by Greg Ward, has created the Distutils, a system to make package installation much easier. They form the ``distutils`` package, a new part of Python's standard library. In the best case, installing a Python module from source will require the same steps: first you simply mean unpack the tarball or zip archive, and the run "``python setup.py install``". The platform will be automatically detected, the compiler will be recognized, C extension modules will be compiled, and the distribution installed into the proper directory. Optional command-line arguments provide more control over the installation process, the distutils package offers many places to override defaults -- separating the build from the install, building or installing in non-default directories, and more.
sv: SIG för distributionsverktyg, under ledning av Greg Ward, har skapat Distutils, ett system för att göra paketinstallationen mycket enklare. De bildar paketet ``distutils``, en ny del av Pythons standardbibliotek. I bästa fall kräver installation av en Python-modul från källan samma steg: först betyder du helt enkelt packa upp tarball- eller zip-arkivet och kör "``python setup.py install``". Plattformen kommer automatiskt att upptäckas, kompilatorn kommer att kännas igen, C-tilläggsmoduler kommer att kompileras och distributionen installeras i rätt katalog. Valfria kommandoradsargument ger mer kontroll över installationsprocessen, distutils-paketet erbjuder många ställen att åsidosätta standardinställningar - separera byggandet från installationen, bygga eller installera i icke-standardkataloger, med mera.

source: In order to use the Distutils, you need to write a :file:`setup.py` script. For the simple case, when the software contains only .py files, a minimal :file:`setup.py` can be just a few lines long::
sv: För att kunna använda Distutils måste du skriva ett :file:`setup.py`-skript. I det enkla fallet, när programvaran bara innehåller .py-filer, kan en minimal :file:`setup.py` vara bara några rader lång::

source: from distutils.core import setup setup (name = "foo", version = "1.0", py_modules = ["module1", "module2"])
sv: från distutils.core import setup setup (namn = "foo", version = "1.0", py_modules = ["modul1", "modul2"])

source: The :file:`setup.py` file isn't much more complicated if the software consists of a few packages::
sv: Filen :file:`setup.py` är inte mycket mer komplicerad om programvaran består av ett fåtal paket::

source: from distutils.core import setup setup (name = "foo", version = "1.0", packages = ["package", "package.subpackage"])
sv: från distutils.core import setup setup (namn = "foo", version = "1.0", paket = ["paket", "paket.underpaket"])

source: A C extension can be the most complicated case; here's an example taken from the PyXML package::
sv: Ett C-tillägg kan vara det mest komplicerade fallet; här är ett exempel hämtat från PyXML-paketet::

source: The Distutils can also take care of creating source and binary distributions. The "sdist" command, run by "``python setup.py sdist``', builds a source distribution such as :file:`foo-1.0.tar.gz`. Adding new commands isn't difficult, "bdist_rpm" and "bdist_wininst" commands have already been contributed to create an RPM distribution and a Windows installer for the software, respectively. Commands to create other distribution formats such as Debian packages and Solaris :file:`.pkg` files are in various stages of development.
sv: Distutils kan också ta hand om att skapa källkods- och binärdistributioner. Kommandot "sdist", som körs av "``python setup.py sdist``", bygger en källkodsdistribution som :file:`foo-1.0.tar.gz`. Det är inte svårt att lägga till nya kommandon, kommandona "bdist_rpm" och "bdist_wininst" har redan bidragit för att skapa en RPM-distribution respektive en Windows-installation för programvaran. Kommandon för att skapa andra distributionsformat, t.ex. Debian-paket och Solaris :file:`.pkg`-filer, är i olika utvecklingsstadier.

source: All this is documented in a new manual, *Distributing Python Modules*, that joins the basic set of Python documentation.
sv: Allt detta finns dokumenterat i en ny manual, *Distributing Python Modules*, som ansluter sig till den grundläggande Python-dokumentationen.

source: XML Modules
sv: XML-moduler

source: Python 1.5.2 included a simple XML parser in the form of the :mod:`!xmllib` module, contributed by Sjoerd Mullender. Since 1.5.2's release, two different interfaces for processing XML have become common: SAX2 (version 2 of the Simple API for XML) provides an event-driven interface with some similarities to :mod:`!xmllib`, and the DOM (Document Object Model) provides a tree-based interface, transforming an XML document into a tree of nodes that can be traversed and modified. Python 2.0 includes a SAX2 interface and a stripped-down DOM interface as part of the :mod:`xml` package. Here we will give a brief overview of these new interfaces; consult the Python documentation or the source code for complete details. The Python XML SIG is also working on improved documentation.
sv: Python 1.5.2 innehöll en enkel XML-parser i form av modulen :mod:`!xmllib`, som Sjoerd Mullender bidrog med. Sedan 1.5.2 släpptes har två olika gränssnitt för bearbetning av XML blivit vanliga: SAX2 (version 2 av Simple API for XML) tillhandahåller ett händelsedrivet gränssnitt med vissa likheter med :mod:`!xmllib`, och DOM (Document Object Model) tillhandahåller ett trädbaserat gränssnitt som omvandlar ett XML-dokument till ett träd med noder som kan korsas och modifieras. Python 2.0 innehåller ett SAX2-gränssnitt och ett nedbantat DOM-gränssnitt som en del av paketet :mod:`xml`. Här kommer vi att ge en kort översikt över dessa nya gränssnitt; se Python-dokumentationen eller källkoden för fullständiga detaljer. Python XML SIG arbetar också med att förbättra dokumentationen.

source: SAX2 Support
sv: SAX2-stöd

source: SAX defines an event-driven interface for parsing XML. To use SAX, you must write a SAX handler class. Handler classes inherit from various classes provided by SAX, and override various methods that will then be called by the XML parser. For example, the :meth:`~xml.sax.handler.ContentHandler.startElement` and :meth:`~xml.sax.handler.ContentHandler.endElement` methods are called for every starting and end tag encountered by the parser, the :meth:`~xml.sax.handler.ContentHandler.characters` method is called for every chunk of character data, and so forth.
sv: SAX definierar ett händelsestyrt gränssnitt för parsning av XML. För att använda SAX måste du skriva en SAX-hanterarklass. Hanteringsklasser ärver från olika klasser som tillhandahålls av SAX och åsidosätter olika metoder som sedan anropas av XML-parsern. Till exempel anropas metoderna :meth:`~xml.sax.handler.ContentHandler.startElement` och :meth:`~xml.sax.handler.ContentHandler.endElement` för varje start- och sluttagg som parsaren stöter på, metoden :meth:`~xml.sax.handler.ContentHandler.characters` anropas för varje bit teckeninformation, och så vidare.

source: The advantage of the event-driven approach is that the whole document doesn't have to be resident in memory at any one time, which matters if you are processing really huge documents. However, writing the SAX handler class can get very complicated if you're trying to modify the document structure in some elaborate way.
sv: Fördelen med det händelsestyrda tillvägagångssättet är att hela dokumentet inte behöver finnas i minnet vid varje tillfälle, vilket är viktigt om du bearbetar riktigt stora dokument. Att skriva SAX-hanterarklassen kan dock bli mycket komplicerat om du försöker ändra dokumentstrukturen på något detaljerat sätt.

source: For example, this little example program defines a handler that prints a message for every starting and ending tag, and then parses the file :file:`hamlet.xml` using it::
sv: Det här lilla exempelprogrammet definierar till exempel en hanterare som skriver ut ett meddelande för varje start- och sluttagg och sedan analyserar filen :file:`hamlet.xml` med hjälp av den::

source: from xml import sax class SimpleHandler(sax.ContentHandler): def startElement(self, name, attrs): print 'Start of element:', name, attrs.keys() def endElement(self, name): print 'End of element:', name # Create a parser object parser = sax.make_parser() # Tell it what handler to use handler = SimpleHandler() parser.setContentHandler( handler ) # Parse a file! parser.parse( 'hamlet.xml' )
sv: från xml import sax klass SimpleHandler(sax.ContentHandler): def startElement(self, name, attrs): print 'Början på element:', name, attrs.keys() def endElement(self, namn): print "Slut på elementet:", name # Skapa ett parser-objekt parser = sax.make_parser() # Berätta vilken hanterare som ska användas handler = SimpleHandler() parser.setContentHandler( handler ) # Parsa en fil! parser.parse( 'hamlet.xml' )

source: For more information, consult the Python documentation, or the XML HOWTO at https://pyxml.sourceforge.net/topics/howto/xml-howto.html.
sv: Mer information finns i Python-dokumentationen eller i XML HOWTO på https://pyxml.sourceforge.net/topics/howto/xml-howto.html.

source: DOM Support
sv: DOM-stöd

source: The Document Object Model is a tree-based representation for an XML document. A top-level :class:`!Document` instance is the root of the tree, and has a single child which is the top-level :class:`!Element` instance. This :class:`!Element` has children nodes representing character data and any sub-elements, which may have further children of their own, and so forth. Using the DOM you can traverse the resulting tree any way you like, access element and attribute values, insert and delete nodes, and convert the tree back into XML.
sv: Document Object Model är en trädbaserad representation för ett XML-dokument. En toppnivå :class:`!Document`-instans är roten i trädet och har ett enda barn som är toppnivå :class:`!Element`-instansen. Detta :class:`!Element` har barnnoder som representerar teckeninformation och eventuella underelement, som kan ha ytterligare egna barn, och så vidare. Med hjälp av DOM kan du korsa det resulterande trädet hur du vill, komma åt element- och attributvärden, infoga och ta bort noder och konvertera trädet tillbaka till XML.

source: The DOM is useful for modifying XML documents, because you can create a DOM tree, modify it by adding new nodes or rearranging subtrees, and then produce a new XML document as output. You can also construct a DOM tree manually and convert it to XML, which can be a more flexible way of producing XML output than simply writing ``<tag1>``...\ ``</tag1>`` to a file.
sv: DOM är användbart för att modifiera XML-dokument, eftersom du kan skapa ett DOM-träd, modifiera det genom att lägga till nya noder eller omorganisera underträd och sedan producera ett nytt XML-dokument som utdata. Du kan också konstruera ett DOM-träd manuellt och konvertera det till XML, vilket kan vara ett mer flexibelt sätt att producera XML-utdata än att bara skriva<tag1>````...\ ````</tag1> till en fil.

source: The DOM implementation included with Python lives in the :mod:`xml.dom.minidom` module. It's a lightweight implementation of the Level 1 DOM with support for XML namespaces. The :func:`!parse` and :func:`!parseString` convenience functions are provided for generating a DOM tree::
sv: Den DOM-implementering som ingår i Python finns i modulen :mod:`xml.dom.minidom`. Det är en lättviktsimplementering av DOM på nivå 1 med stöd för XML-namnrymder. Bekvämlighetsfunktionerna :func:`!parse` och :func:`!parseString` tillhandahålls för att generera ett DOM-träd::

source: from xml.dom import minidom doc = minidom.parse('hamlet.xml')
sv: från xml.dom import minidom doc = minidom.parse('hamlet.xml')

source: ``doc`` is a :class:`!Document` instance. :class:`!Document`, like all the other DOM classes such as :class:`!Element` and :class:`Text`, is a subclass of the :class:`!Node` base class. All the nodes in a DOM tree therefore support certain common methods, such as :meth:`!toxml` which returns a string containing the XML representation of the node and its children. Each class also has special methods of its own; for example, :class:`!Element` and :class:`!Document` instances have a method to find all child elements with a given tag name. Continuing from the previous 2-line example::
sv: ``doc`` är en :class:`!Document`-instans. :class:`!Document`, liksom alla andra DOM-klasser som :class:`!Element` och :class:`Text`, är en underklass av basklassen :class:`!Node`. Alla noder i ett DOM-träd stöder därför vissa gemensamma metoder, t.ex. :meth:`!toxml` som returnerar en sträng som innehåller XML-representationen av noden och dess barn. Varje klass har också sina egna specialmetoder; till exempel har :class:`!Element` och :class:`!Document` en metod för att hitta alla underordnade element med ett givet taggnamn. Fortsättning från det tidigare 2-radiga exemplet::

source: For the *Hamlet* XML file, the above few lines output::
sv: För XML-filen *Hamlet* ger ovanstående rader följande resultat::

source: <PERSONA>CLAUDIUS, king of Denmark. </PERSONA> <PERSONA>HAMLET, son to the late, and nephew to the present king.</PERSONA>
sv: <PERSONA>CLAUDIUS, kung av Danmark. </PERSONA> <PERSONA>HAMLET, son till den avlidne och brorson till den nuvarande kungen.</PERSONA>

source: The root element of the document is available as ``doc.documentElement``, and its children can be easily modified by deleting, adding, or removing nodes::
sv: Dokumentets rotelement finns tillgängligt som ``doc.documentElement``, och dess barn kan enkelt ändras genom att ta bort, lägga till eller ta bort noder::

source: root = doc.documentElement # Remove the first child root.removeChild( root.childNodes[0] ) # Move the new first child to the end root.appendChild( root.childNodes[0] ) # Insert the new first child (originally, # the third child) before the 20th child. root.insertBefore( root.childNodes[0], root.childNodes[20] )
sv: root = doc.documentElement # Ta bort det första barnet root.removeChild( root.childNodes[0] ) # Flytta det nya första barnet till slutet root.appendChild( root.childNodes[0] ) # Infoga det nya första barnet (ursprungligen, # det tredje barnet) före det 20:e barnet. root.insertBefore( root.childNodes[0], root.childNodes[20] )

source: Again, I will refer you to the Python documentation for a complete listing of the different :class:`!Node` classes and their various methods.
sv: Återigen hänvisar jag till Python-dokumentationen för en fullständig lista över de olika :class:`!Node`-klasserna och deras olika metoder.

source: Relationship to PyXML
sv: Förhållande till PyXML

source: The XML Special Interest Group has been working on XML-related Python code for a while. Its code distribution, called PyXML, is available from the SIG's web pages at https://www.python.org/community/sigs/current/xml-sig. The PyXML distribution also used the package name ``xml``. If you've written programs that used PyXML, you're probably wondering about its compatibility with the 2.0 :mod:`xml` package.
sv: XML Special Interest Group har arbetat med XML-relaterad Python-kod under en tid. Dess koddistribution, kallad PyXML, finns tillgänglig från SIG:s webbsidor på https://www.python.org/community/sigs/current/xml-sig. PyXML-distributionen använde också paketnamnet ``xml``. Om du har skrivit program som använder PyXML undrar du säkert om det är kompatibelt med paketet 2.0 :mod:`xml`.
