Repository: yeager/python-docs-sv
Catalog: whatsnew/2.0.po
Languages: sv

source: What's New in Python 2.0
sv: Vad är nytt i Python 2.0

source: Author
sv: Författare

source: A.M. Kuchling and Moshe Zadka
sv: A.M. Kuchling och Moshe Zadka

source: Introduction
sv: Introduktion

source: A new release of Python, version 2.0, was released on October 16, 2000. This article covers the exciting new features in 2.0, highlights some other useful changes, and points out a few incompatible changes that may require rewriting code.
sv: En ny version av Python, version 2.0, släpptes den 16 oktober 2000. Den här artikeln beskriver de spännande nyheterna i 2.0, lyfter fram några andra användbara ändringar och pekar på några inkompatibla ändringar som kan kräva att koden skrivs om.

source: Python's development never completely stops between releases, and a steady flow of bug fixes and improvements are always being submitted. A host of minor fixes, a few optimizations, additional docstrings, and better error messages went into 2.0; to list them all would be impossible, but they're certainly significant. Consult the publicly available CVS logs if you want to see the full list. This progress is due to the five developers working for PythonLabs are now getting paid to spend their days fixing bugs, and also due to the improved communication resulting from moving to SourceForge.
sv: Pythons utveckling stannar aldrig helt upp mellan utgåvorna, och ett stadigt flöde av buggfixar och förbättringar skickas alltid in. En mängd mindre korrigeringar, några optimeringar, ytterligare dokumentationer och bättre felmeddelanden gick in i 2.0; att lista dem alla skulle vara omöjligt, men de är verkligen betydelsefulla. Konsultera de offentligt tillgängliga CVS-loggarna om du vill se hela listan. Dessa framsteg beror på att de fem utvecklare som arbetar för PythonLabs nu får betalt för att spendera sina dagar med att fixa buggar, och även på grund av den förbättrade kommunikationen som följer av att flytta till SourceForge.

source: What About Python 1.6?
sv: Vad sägs om Python 1.6?

source: Python 1.6 can be thought of as the Contractual Obligations Python release. After the core development team left CNRI in May 2000, CNRI requested that a 1.6 release be created, containing all the work on Python that had been performed at CNRI. Python 1.6 therefore represents the state of the CVS tree as of May 2000, with the most significant new feature being Unicode support. Development continued after May, of course, so the 1.6 tree received a few fixes to ensure that it's forward-compatible with Python 2.0. 1.6 is therefore part of Python's evolution, and not a side branch.
sv: Python 1.6 kan ses som Python-versionen för kontraktsförpliktelser. Efter att kärnutvecklingsgruppen lämnade CNRI i maj 2000 begärde CNRI att en 1.6-version skulle skapas, som skulle innehålla allt arbete med Python som hade utförts på CNRI. Python 1.6 representerar därför tillståndet i CVS-trädet i maj 2000, med den mest betydande nya funktionen Unicode-stöd. Utvecklingen fortsatte naturligtvis efter maj, så 1.6-trädet fick några korrigeringar för att säkerställa att det är framåtkompatibelt med Python 2.0. 1.6 är därför en del av Pythons utveckling, och inte en sidogren.

source: So, should you take much interest in Python 1.6? Probably not. The 1.6final and 2.0beta1 releases were made on the same day (September 5, 2000), the plan being to finalize Python 2.0 within a month or so. If you have applications to maintain, there seems little point in breaking things by moving to 1.6, fixing them, and then having another round of breakage within a month by moving to 2.0; you're better off just going straight to 2.0. Most of the really interesting features described in this document are only in 2.0, because a lot of work was done between May and September.
sv: Så, borde du intressera dig för Python 1.6? Förmodligen inte. Versionerna 1.6final och 2.0beta1 släpptes samma dag (5 september 2000) och planen är att Python 2.0 ska vara färdig inom en månad eller så. Om du har applikationer att underhålla verkar det inte finnas någon mening med att bryta saker genom att flytta till 1.6, fixa dem och sedan ha en ny omgång av brott inom en månad genom att flytta till 2.0; det är bättre att bara gå direkt till 2.0. De flesta av de riktigt intressanta funktionerna som beskrivs i det här dokumentet finns bara i 2.0, eftersom mycket arbete gjordes mellan maj och september.

source: New Development Process
sv: Ny utvecklingsprocess

source: The most important change in Python 2.0 may not be to the code at all, but to how Python is developed: in May 2000 the Python developers began using the tools made available by SourceForge for storing source code, tracking bug reports, and managing the queue of patch submissions. To report bugs or submit patches for Python 2.0, use the bug tracking and patch manager tools available from Python's project page, located at https://sourceforge.net/projects/python/.
sv: Den viktigaste förändringen i Python 2.0 är kanske inte alls i koden, utan i hur Python utvecklas: i maj 2000 började Python-utvecklarna använda de verktyg som SourceForge tillhandahåller för att lagra källkod, spåra felrapporter och hantera kön av patchar som skickas in. För att rapportera buggar eller skicka in patchar för Python 2.0, använd verktygen för buggspårning och patchhantering som finns tillgängliga på Pythons projektsida, som finns på https://sourceforge.net/projects/python/.

source: The most important of the services now hosted at SourceForge is the Python CVS tree, the version-controlled repository containing the source code for Python. Previously, there were roughly 7 or so people who had write access to the CVS tree, and all patches had to be inspected and checked in by one of the people on this short list. Obviously, this wasn't very scalable. By moving the CVS tree to SourceForge, it became possible to grant write access to more people; as of September 2000 there were 27 people able to check in changes, a fourfold increase. This makes possible large-scale changes that wouldn't be attempted if they'd have to be filtered through the small group of core developers. For example, one day Peter Schneider-Kamp took it into his head to drop K&R C compatibility and convert the C source for Python to ANSI C. After getting approval on the python-dev mailing list, he launched into a flurry of checkins that lasted about a week, other developers joined in to help, and the job was done. If there were only 5 people with write access, probably that task would have been viewed as "nice, but not worth the time and effort needed" and it would never have gotten done.
sv: Den viktigaste av de tjänster som nu finns hos SourceForge är Pythons CVS-träd, det versionsstyrda arkiv som innehåller källkoden för Python. Tidigare fanns det ungefär 7 personer som hade skrivrättigheter till CVS-trädet, och alla patchar måste inspekteras och checkas in av någon av personerna på denna korta lista. Det här var naturligtvis inte särskilt skalbart. Genom att flytta CVS-trädet till SourceForge blev det möjligt att ge fler personer skrivbehörighet; i september 2000 kunde 27 personer checka in ändringar, vilket är en fyrfaldig ökning. Detta möjliggör storskaliga förändringar som inte skulle ha genomförts om de hade behövt filtreras genom den lilla gruppen av kärnutvecklare. En dag fick till exempel Peter Schneider-Kamp för sig att släppa K&R C-kompatibiliteten och konvertera C-källan för Python till ANSI C. Efter att ha fått godkännande på e-postlistan python-dev satte han igång med en mängd incheckningar som varade i ungefär en vecka, andra utvecklare anslöt sig för att hjälpa till och jobbet var gjort. Om det bara hade funnits fem personer med skrivbehörighet hade den uppgiften förmodligen betraktats som "trevlig, men inte värd den tid och ansträngning som krävs" och den hade aldrig blivit utförd.

source: The shift to using SourceForge's services has resulted in a remarkable increase in the speed of development. Patches now get submitted, commented on, revised by people other than the original submitter, and bounced back and forth between people until the patch is deemed worth checking in. Bugs are tracked in one central location and can be assigned to a specific person for fixing, and we can count the number of open bugs to measure progress. This didn't come without a cost: developers now have more e-mail to deal with, more mailing lists to follow, and special tools had to be written for the new environment. For example, SourceForge sends default patch and bug notification e-mail messages that are completely unhelpful, so Ka-Ping Yee wrote an HTML screen-scraper that sends more useful messages.
sv: Övergången till att använda SourceForges tjänster har resulterat i en anmärkningsvärd ökning av utvecklingshastigheten. Patchar skickas nu in, kommenteras, revideras av andra personer än den som ursprungligen skickade in dem och skickas fram och tillbaka mellan olika personer tills patchen anses vara värd att checka in. Buggar spåras på en central plats och kan tilldelas en specifik person för åtgärdande, och vi kan räkna antalet öppna buggar för att mäta framstegen. Detta har inte skett utan kostnad: utvecklarna har nu mer e-post att hantera, fler e-postlistor att följa och särskilda verktyg måste skrivas för den nya miljön. SourceForge skickar till exempel standardmeddelanden om patch- och buggaviseringar som är helt oanvändbara, så Ka-Ping Yee skrev en HTML-skärmskrapa som skickar mer användbara meddelanden.

source: The ease of adding code caused a few initial growing pains, such as code was checked in before it was ready or without getting clear agreement from the developer group. The approval process that has emerged is somewhat similar to that used by the Apache group. Developers can vote +1, +0, -0, or -1 on a patch; +1 and -1 denote acceptance or rejection, while +0 and -0 mean the developer is mostly indifferent to the change, though with a slight positive or negative slant. The most significant change from the Apache model is that the voting is essentially advisory, letting Guido van Rossum, who has Benevolent Dictator For Life status, know what the general opinion is. He can still ignore the result of a vote, and approve or reject a change even if the community disagrees with him.
sv: Det enkla sättet att lägga till kod orsakade en del initiala växtvärk, till exempel att kod checkades in innan den var klar eller utan att få ett tydligt godkännande från utvecklargruppen. Den godkännandeprocess som har utvecklats liknar till viss del den som används av Apache-gruppen. Utvecklare kan rösta +1, +0, -0 eller -1 på en patch. +1 och -1 innebär att man godkänner eller förkastar en patch, medan +0 och -0 innebär att utvecklaren i stort sett är likgiltig inför förändringen, men med en liten positiv eller negativ lutning. Den viktigaste förändringen jämfört med Apache-modellen är att omröstningen i huvudsak är rådgivande, vilket gör att Guido van Rossum, som har status som Benevolent Dictator For Life, vet vad den allmänna uppfattningen är. Han kan fortfarande ignorera resultatet av en omröstning och godkänna eller förkasta en ändring även om communityn inte håller med honom.

source: Producing an actual patch is the last step in adding a new feature, and is usually easy compared to the earlier task of coming up with a good design. Discussions of new features can often explode into lengthy mailing list threads, making the discussion hard to follow, and no one can read every posting to python-dev. Therefore, a relatively formal process has been set up to write Python Enhancement Proposals (PEPs), modelled on the internet RFC process. PEPs are draft documents that describe a proposed new feature, and are continually revised until the community reaches a consensus, either accepting or rejecting the proposal. Quoting from the introduction to :pep:`1`, "PEP Purpose and Guidelines":
sv: Att producera en faktisk patch är det sista steget i att lägga till en ny funktion, och är vanligtvis lätt jämfört med den tidigare uppgiften att komma på en bra design. Diskussioner om nya funktioner kan ofta explodera i långa trådar på e-postlistor, vilket gör diskussionen svår att följa, och ingen kan läsa alla inlägg till python-dev. Därför har en relativt formell process inrättats för att skriva Python Enhancement Proposals (PEPs), med RFC-processen på internet som förebild. PEPs är utkast till dokument som beskriver en föreslagen ny funktion, och revideras kontinuerligt tills communityn når ett samförstånd, antingen accepterar eller förkastar förslaget. Citat från introduktionen till :pep:`1`, "PEP Purpose and Guidelines":

source: PEP stands for Python Enhancement Proposal. A PEP is a design document providing information to the Python community, or describing a new feature for Python. The PEP should provide a concise technical specification of the feature and a rationale for the feature.
sv: PEP står för Python Enhancement Proposal (förslag till förbättring av Python). Ett PEP är ett designdokument som ger information till Python-gemenskapen eller beskriver en ny funktion för Python. PEP ska innehålla en kortfattad teknisk specifikation av funktionen och en motivering för funktionen.

source: We intend PEPs to be the primary mechanisms for proposing new features, for collecting community input on an issue, and for documenting the design decisions that have gone into Python. The PEP author is responsible for building consensus within the community and documenting dissenting opinions.
sv: Vi avser att PEP:er ska vara de primära mekanismerna för att föreslå nya funktioner, för att samla in synpunkter på en fråga och för att dokumentera de designbeslut som har tagits i Python. PEP-författaren är ansvarig för att bygga konsensus inom gemenskapen och dokumentera avvikande åsikter.

source: Read the rest of :pep:`1` for the details of the PEP editorial process, style, and format. PEPs are kept in the Python CVS tree on SourceForge, though they're not part of the Python 2.0 distribution, and are also available in HTML form from https://peps.python.org/. As of September 2000, there are 25 PEPs, ranging from :pep:`201`, "Lockstep Iteration", to PEP 225, "Elementwise/Objectwise Operators".
sv: Läs resten av :pep:`1` för detaljer om PEP:s redaktionella process, stil och format. PEPs finns i Python CVS-trädet på SourceForge, även om de inte är en del av Python 2.0-distributionen, och finns också tillgängliga i HTML-format från https://peps.python.org/. I september 2000 fanns det 25 PEP:er, från :pep:`201`, "Lockstep Iteration", till PEP 225, "Elementwise/Objectwise Operators".

source: The largest new feature in Python 2.0 is a new fundamental data type: Unicode strings. Unicode uses 16-bit numbers to represent characters instead of the 8-bit number used by ASCII, meaning that 65,536 distinct characters can be supported.
sv: Den största nyheten i Python 2.0 är en ny grundläggande datatyp: Unicode-strängar. Unicode använder 16-bitarsnummer för att representera tecken i stället för 8-bitarsnummer som används av ASCII, vilket innebär att 65 536 olika tecken kan stödjas.

source: The final interface for Unicode support was arrived at through countless often-stormy discussions on the python-dev mailing list, and mostly implemented by Marc-André Lemburg, based on a Unicode string type implementation by Fredrik Lundh. A detailed explanation of the interface was written up as :pep:`100`, "Python Unicode Integration". This article will simply cover the most significant points about the Unicode interfaces.
sv: Det slutliga gränssnittet för Unicode-stöd togs fram genom otaliga, ofta stormiga diskussioner på e-postlistan python-dev, och implementerades till största delen av Marc-André Lemburg, baserat på en Unicode-strängtypsimplementering av Fredrik Lundh. En detaljerad förklaring av gränssnittet skrevs upp som :pep:`100`, "Python Unicode Integration". Den här artikeln kommer helt enkelt att täcka de viktigaste punkterna om Unicode-gränssnitten.

source: In Python source code, Unicode strings are written as ``u"string"``. Arbitrary Unicode characters can be written using a new escape sequence, :samp:`\\u{HHHH}`, where *HHHH* is a 4-digit hexadecimal number from 0000 to FFFF. The existing :samp:`\\x{HH}` escape sequence can also be used, and octal escapes can be used for characters up to U+01FF, which is represented by ``\777``.
sv: I Pythons källkod skrivs Unicode-strängar som ``u"string"``. Godtyckliga Unicode-tecken kan skrivas med hjälp av en ny escape-sekvens, :samp:`\\u{HHHH}`, där *HHHH* är ett fyrsiffrigt hexadecimalt tal från 0000 till FFFF. Den befintliga escape-sekvensen :samp:`\x{HH}` kan också användas, och oktala escapes kan användas för tecken upp till U+01FF, som representeras av ``\777``.

source: Unicode strings, just like regular strings, are an immutable sequence type. They can be indexed and sliced, but not modified in place. Unicode strings have an ``encode( [encoding] )`` method that returns an 8-bit string in the desired encoding. Encodings are named by strings, such as ``'ascii'``, ``'utf-8'``, ``'iso-8859-1'``, or whatever. A codec API is defined for implementing and registering new encodings that are then available throughout a Python program. If an encoding isn't specified, the default encoding is usually 7-bit ASCII, though it can be changed for your Python installation by calling the ``sys.setdefaultencoding(encoding)`` function in a customized version of :file:`site.py`.
sv: Unicode-strängar är, precis som vanliga strängar, en oföränderlig sekvenstyp. De kan indexeras och skivas, men inte modifieras på plats. Unicode-strängar har en ``encode( [encoding] )``-metod som returnerar en 8-bitars sträng i önskad kodning. Kodningar namnges av strängar, till exempel ``'ascii'``, ``'utf-8'``, ``'iso-8859-1'``, eller vad som helst. Ett codec-API är definierat för att implementera och registrera nya kodningar som sedan är tillgängliga i ett Python-program. Om en kodning inte specificeras är standardkodningen vanligtvis 7-bitars ASCII, men den kan ändras för din Python-installation genom att anropa funktionen ``sys.setdefaultencoding(encoding)`` i en anpassad version av :file:`site.py`.

source: Combining 8-bit and Unicode strings always coerces to Unicode, using the default ASCII encoding; the result of ``'a' + u'bc'`` is ``u'abc'``.
sv: Kombination av 8-bitars och Unicode-strängar tvingar alltid till Unicode, med hjälp av standard ASCII-kodning; resultatet av ``'a' + u'bc'`` är ``u'abc'``.

source: New built-in functions have been added, and existing built-ins modified to support Unicode:
sv: Nya inbyggda funktioner har lagts till och befintliga inbyggda funktioner har modifierats för att stödja Unicode:

source: ``unichr(ch)`` returns a Unicode string 1 character long, containing the character *ch*.
sv: ``unichr(ch)`` returnerar en Unicode-sträng som är 1 tecken lång och innehåller tecknet *ch*.

source: ``ord(u)``, where *u* is a 1-character regular or Unicode string, returns the number of the character as an integer.
sv: ``ord(u)``, där *u* är en reguljär sträng eller Unicode-sträng med 1 tecken, returnerar numret på tecknet som ett heltal.

source: ``unicode(string [, encoding] [, errors] )`` creates a Unicode string from an 8-bit string. ``encoding`` is a string naming the encoding to use. The ``errors`` parameter specifies the treatment of characters that are invalid for the current encoding; passing ``'strict'`` as the value causes an exception to be raised on any encoding error, while ``'ignore'`` causes errors to be silently ignored and ``'replace'`` uses U+FFFD, the official replacement character, in case of any problems.
sv: ``unicode(string [, encoding] [, errors] )`` skapar en Unicode-sträng från en 8-bitarssträng. ``encoding`` är en sträng som anger vilken kodning som skall användas. Parametern ``errors`` anger hur tecken som är ogiltiga för den aktuella kodningen ska behandlas; om värdet ``'strict'`` anges kommer ett undantag att uppstå vid alla kodningsfel, medan ``'ignore'`` gör att felen ignoreras i tysthet och ``'replace'`` använder U+FFFD, det officiella ersättningstecknet, vid eventuella problem.

source: The ``exec`` statement, and various built-ins such as ``eval()``, ``getattr()``, and ``setattr()`` will also accept Unicode strings as well as regular strings. (It's possible that the process of fixing this missed some built-ins; if you find a built-in function that accepts strings but doesn't accept Unicode strings at all, please report it as a bug.)
sv: Satsen ``exec`` och olika inbyggda funktioner som ``eval()``, ``getattr()`` och ``setattr()`` kommer också att acceptera Unicode-strängar såväl som vanliga strängar. (Det är möjligt att processen med att fixa detta missade några inbyggda funktioner; om du hittar en inbyggd funktion som accepterar strängar men inte accepterar Unicode-strängar alls, vänligen rapportera det som en bugg)

source: A new module, :mod:`unicodedata`, provides an interface to Unicode character properties. For example, ``unicodedata.category(u'A')`` returns the 2-character string 'Lu', the 'L' denoting it's a letter, and 'u' meaning that it's uppercase. ``unicodedata.bidirectional(u'\u0660')`` returns 'AN', meaning that U+0660 is an Arabic number.
sv: En ny modul, :mod:`unicodedata`, ger ett gränssnitt till Unicodes teckenegenskaper. Till exempel returnerar ``unicodedata.category(u'A')`` den 2-teckens strängen 'Lu', där 'L' anger att det är en bokstav och 'u' betyder att det är versaler. ``unicodedata.bidirectional(u'\u0660')`` returnerar 'AN', vilket betyder att U+0660 är ett arabiskt tal.

source: The :mod:`codecs` module contains functions to look up existing encodings and register new ones. Unless you want to implement a new encoding, you'll most often use the ``codecs.lookup(encoding)`` function, which returns a 4-element tuple: ``(encode_func, decode_func, stream_reader, stream_writer)``.
sv: Modulen :mod:`codecs` innehåller funktioner för att slå upp befintliga kodningar och registrera nya. Om du inte vill implementera en ny kodning kommer du oftast att använda funktionen ``codecs.lookup(encoding)``, som returnerar en tupel med 4 element: ``(encode_func, decode_func, stream_reader, stream_writer)``.

source: *encode_func* is a function that takes a Unicode string, and returns a 2-tuple ``(string, length)``. *string* is an 8-bit string containing a portion (perhaps all) of the Unicode string converted into the given encoding, and *length* tells you how much of the Unicode string was converted.
sv: *encode_func* är en funktion som tar en Unicode-sträng och returnerar en 2-tupel ``(sträng, längd)``. *string* är en 8-bitars sträng som innehåller en del (kanske hela) av Unicode-strängen som konverterats till den givna kodningen, och *length* berättar hur stor del av Unicode-strängen som konverterades.

source: *decode_func* is the opposite of *encode_func*, taking an 8-bit string and returning a 2-tuple ``(ustring, length)``, consisting of the resulting Unicode string *ustring* and the integer *length* telling how much of the 8-bit string was consumed.
sv: *decode_func* är motsatsen till *encode_func*, tar en 8-bitarssträng och returnerar en 2-tupel ``(ustring, length)``, bestående av den resulterande Unicode-strängen *ustring* och heltalet *length* som anger hur mycket av 8-bitarssträngen som förbrukades.
