Repository: yeager/python-docs-sv
Catalog: whatsnew/2.0.po
Languages: sv

source: The ``print`` statement can now have its output directed to a file-like object by following the ``print`` with ``>> file``, similar to the redirection operator in Unix shells. Previously you'd either have to use the :meth:`!write` method of the file-like object, which lacks the convenience and simplicity of ``print``, or you could assign a new value to ``sys.stdout`` and then restore the old value. For sending output to standard error, it's much easier to write this::
sv: ``print``-satsen kan nu få sin utdata riktad till ett filliknande objekt genom att följa ``print`` med ``>> file``, liknande omdirigeringsoperatorn i Unix-skal. Tidigare var man tvungen att antingen använda :meth:`!write`-metoden för det filliknande objektet, vilket inte är lika bekvämt och enkelt som ``print``, eller så kunde man tilldela ett nytt värde till ``sys.stdout`` och sedan återställa det gamla värdet. För att skicka utdata till standardfel är det mycket enklare att skriva detta::

source: Modules can now be renamed on importing them, using the syntax ``import module as name`` or ``from module import name as othername``. The patch was submitted by Thomas Wouters.
sv: Moduler kan nu döpas om när de importeras, med syntaxen ``import module as name`` eller ``from module import name as othername``. Korrigeringen skickades in av Thomas Wouters.

source: A new format style is available when using the ``%`` operator; '%r' will insert the :func:`repr` of its argument. This was also added from symmetry considerations, this time for symmetry with the existing '%s' format style, which inserts the :func:`str` of its argument. For example, ``'%r %s' % ('abc', 'abc')`` returns a string containing ``'abc' abc``.
sv: En ny formateringsstil är tillgänglig när operatorn ``%`` används; '%r' infogar argumentets :func:`repr`. Detta lades också till av symmetriskäl, den här gången för symmetri med den befintliga formatstilen '%s', som infogar :func:`str` för sitt argument. Till exempel returnerar ``'%r %s' % ('abc', 'abc')`` en sträng som innehåller ``'abc' abc``.

source: Previously there was no way to implement a class that overrode Python's built-in :keyword:`in` operator and implemented a custom version. ``obj in seq`` returns true if *obj* is present in the sequence *seq*; Python computes this by simply trying every index of the sequence until either *obj* is found or an :exc:`IndexError` is encountered. Moshe Zadka contributed a patch which adds a :meth:`!__contains__` magic method for providing a custom implementation for :keyword:`!in`. Additionally, new built-in objects written in C can define what :keyword:`!in` means for them via a new slot in the sequence protocol.
sv: Tidigare fanns det inget sätt att implementera en klass som åsidosatte Pythons inbyggda :keyword:`in`-operator och implementerade en anpassad version. ``obj in seq`` returnerar sant om *obj* finns i sekvensen *seq*; Python beräknar detta genom att helt enkelt prova varje index i sekvensen tills antingen *obj* hittas eller ett :exc:`IndexError` påträffas. Moshe Zadka bidrog med en patch som lägger till en :meth:`!__contains__` magisk metod för att tillhandahålla en anpassad implementation för :keyword:`!in`. Dessutom kan nya inbyggda objekt skrivna i C definiera vad :keyword:`!in` betyder för dem via en ny slot i sekvensprotokollet.

source: Earlier versions of Python used a recursive algorithm for deleting objects. Deeply nested data structures could cause the interpreter to fill up the C stack and crash; Christian Tismer rewrote the deletion logic to fix this problem. On a related note, comparing recursive objects recursed infinitely and crashed; Jeremy Hylton rewrote the code to no longer crash, producing a useful result instead. For example, after this code::
sv: I tidigare versioner av Python användes en rekursiv algoritm för att radera objekt. Djupt nästlade datastrukturer kunde leda till att tolken fyllde upp C-stacken och kraschade; Christian Tismer skrev om raderingslogiken för att åtgärda detta problem. Jeremy Hylton skrev om koden så att den inte längre kraschade, utan istället gav ett användbart resultat. Till exempel efter den här koden::

source: The comparison ``a==b`` returns true, because the two recursive data structures are isomorphic. See the thread "trashcan and PR#7" in the April 2000 archives of the python-dev mailing list for the discussion leading up to this implementation, and some useful relevant links. Note that comparisons can now also raise exceptions. In earlier versions of Python, a comparison operation such as ``cmp(a,b)`` would always produce an answer, even if a user-defined :meth:`!__cmp__` method encountered an error, since the resulting exception would simply be silently swallowed.
sv: Jämförelsen ``a==b`` returnerar sant, eftersom de två rekursiva datastrukturerna är isomorfa. Se tråden "trashcan and PR#7" i april 2000-arkiven på e-postlistan python-dev för diskussionen som ledde fram till den här implementationen och några användbara relevanta länkar. Observera att jämförelser nu också kan ge upphov till undantag. I tidigare versioner av Python skulle en jämförelseoperation som ``cmp(a,b)`` alltid ge ett svar, även om en användardefinierad :meth:`!__cmp__`-metod stötte på ett fel, eftersom det resulterande undantaget helt enkelt skulle sväljas i tysthet.

source: Work has been done on porting Python to 64-bit Windows on the Itanium processor, mostly by Trent Mick of ActiveState. (Confusingly, ``sys.platform`` is still ``'win32'`` on Win64 because it seems that for ease of porting, MS Visual C++ treats code as 32 bit on Itanium.) PythonWin also supports Windows CE; see the Python CE page at https://pythonce.sourceforge.net/ for more information.
sv: Arbete har gjorts för att portera Python till 64-bitars Windows på Itanium-processorn, mestadels av Trent Mick från ActiveState. (Förvirrande nog är ``sys.platform`` fortfarande ``'win32`` på Win64 eftersom det verkar som om MS Visual C++ för att underlätta portning behandlar kod som 32-bitars på Itanium) PythonWin stöder också Windows CE; se Python CE-sidan på https://pythonce.sourceforge.net/ för mer information.

source: Another new platform is Darwin/MacOS X; initial support for it is in Python 2.0. Dynamic loading works, if you specify "configure --with-dyld --with-suffix=.x". Consult the README in the Python source distribution for more instructions.
sv: En annan ny plattform är Darwin/MacOS X; initialt stöd för den finns i Python 2.0. Dynamisk laddning fungerar om du anger "configure --with-dyld --with-suffix=.x". Mer information finns i README i Pythons källdistribution.

source: An attempt has been made to alleviate one of Python's warts, the often-confusing :exc:`NameError` exception when code refers to a local variable before the variable has been assigned a value. For example, the following code raises an exception on the ``print`` statement in both 1.5.2 and 2.0; in 1.5.2 a :exc:`NameError` exception is raised, while 2.0 raises a new :exc:`UnboundLocalError` exception. :exc:`UnboundLocalError` is a subclass of :exc:`NameError`, so any existing code that expects :exc:`NameError` to be raised should still work. ::
sv: Ett försök har gjorts för att lindra ett av Pythons problem, det ofta förvirrande :exc:`NameError`-undantaget när kod refererar till en lokal variabel innan variabeln har tilldelats ett värde. Följande kod ger till exempel upphov till ett undantag vid ``print``-satsen i både 1.5.2 och 2.0; i 1.5.2 ges ett :exc:`NameError`-undantag, medan 2.0 ger upphov till ett nytt :exc:`UnboundLocalError`-undantag. :exc:`UnboundLocalError` är en underklass till :exc:`NameError`, så all befintlig kod som förväntar sig att :exc:`NameError` ska ges upphov till bör fortfarande fungera:

source: Two new exceptions, :exc:`TabError` and :exc:`IndentationError`, have been introduced. They're both subclasses of :exc:`SyntaxError`, and are raised when Python code is found to be improperly indented.
sv: Två nya undantag, :exc:`TabError` och :exc:`IndentationError`, har introducerats. De är båda underklasser till :exc:`SyntaxError` och uppstår när Python-kod är felaktigt indragen.

source: Changes to Built-in Functions
sv: Ändringar av inbyggda funktioner

source: A new built-in, ``zip(seq1, seq2, ...)``, has been added. :func:`zip` returns a list of tuples where each tuple contains the i-th element from each of the argument sequences. The difference between :func:`zip` and ``map(None, seq1, seq2)`` is that :func:`map` pads the sequences with ``None`` if the sequences aren't all of the same length, while :func:`zip` truncates the returned list to the length of the shortest argument sequence.
sv: En ny inbyggd funktion, ``zip(seq1, seq2, ...)``, har lagts till. :func:`zip` returnerar en lista med tupler där varje tupel innehåller det i:te elementet från var och en av argumentsekvenserna. Skillnaden mellan :func:`zip` och ``map(None, seq1, seq2)`` är att :func:`map` fyller sekvenserna med ``None`` om sekvenserna inte alla är lika långa, medan :func:`zip` trunkerar den returnerade listan till längden på den kortaste argumentsekvensen.

source: The :func:`int` and :func:`!long` functions now accept an optional "base" parameter when the first argument is a string. ``int('123', 10)`` returns 123, while ``int('123', 16)`` returns 291. ``int(123, 16)`` raises a :exc:`TypeError` exception with the message "can't convert non-string with explicit base".
sv: Funktionerna :func:`int` och :func:`!long` accepterar nu en valfri "base"-parameter när det första argumentet är en sträng. ``int('123', 10)`` returnerar 123, medan ``int('123', 16)`` returnerar 291. ``int(123, 16)`` ger upphov till ett :exc:`TypeError`-undantag med meddelandet "can't convert non-string with explicit base".

source: A new variable holding more detailed version information has been added to the :mod:`sys` module. ``sys.version_info`` is a tuple ``(major, minor, micro, level, serial)`` For example, in a hypothetical 2.0.1beta1, ``sys.version_info`` would be ``(2, 0, 1, 'beta', 1)``. *level* is a string such as ``"alpha"``, ``"beta"``, or ``"final"`` for a final release.
sv: En ny variabel som innehåller mer detaljerad versionsinformation har lagts till i modulen :mod:`sys`. ```sys.version_info`` är en tupel ``(major, minor, micro, level, serial)`` Till exempel, i en hypotetisk 2.0.1beta1, skulle ``sys.version_info`` vara ``(2, 0, 1, 'beta', 1)``. *level* är en sträng som ``"alpha"``, ``"beta"`` eller ``"final"`` för en slutlig version.

source: Dictionaries have an odd new method, ``setdefault(key, default)``, which behaves similarly to the existing :meth:`!get` method. However, if the key is missing, :meth:`!setdefault` both returns the value of *default* as :meth:`!get` would do, and also inserts it into the dictionary as the value for *key*. Thus, the following lines of code::
sv: Dictionaries har en udda ny metod, ``setdefault(key, default)``, som beter sig på samma sätt som den befintliga metoden :meth:`!get`. Men om nyckeln saknas, returnerar :meth:`!setdefault` både värdet på *default* som :meth:`!get` skulle göra, och infogar det också i ordboken som värdet för *key*. Således följande rader med kod::

source: if dict.has_key( key ): return dict[key] else: dict[key] = [] return dict[key]
sv: if dict.has_key( nyckel ): return dict[nyckel] annat: dict[key] = [] returnera dict[nyckel]

source: can be reduced to a single ``return dict.setdefault(key, [])`` statement.
sv: kan reduceras till en enda ``return dict.setdefault(key, [])``-sats.

source: The interpreter sets a maximum recursion depth in order to catch runaway recursion before filling the C stack and causing a core dump or GPF.. Previously this limit was fixed when you compiled Python, but in 2.0 the maximum recursion depth can be read and modified using :func:`sys.getrecursionlimit` and :func:`sys.setrecursionlimit`. The default value is 1000, and a rough maximum value for a given platform can be found by running a new script, :file:`Misc/find_recursionlimit.py`.
sv: Tolken ställer in ett maximalt rekursionsdjup för att fånga upp okontrollerad rekursion innan C-stacken fylls och orsakar en kärndump eller GPF. Tidigare fastställdes denna gräns när du kompilerade Python, men i 2.0 kan det maximala rekursionsdjupet läsas och ändras med hjälp av :func:`sys.getrecursionlimit` och :func:`sys.setrecursionlimit`. Standardvärdet är 1000, och ett ungefärligt maximalt värde för en viss plattform kan hittas genom att köra ett nytt skript, :file:`Misc/find_recursionlimit.py`.

source: Porting to 2.0
sv: Portning till 2.0

source: New Python releases try hard to be compatible with previous releases, and the record has been pretty good. However, some changes are considered useful enough, usually because they fix initial design decisions that turned out to be actively mistaken, that breaking backward compatibility can't always be avoided. This section lists the changes in Python 2.0 that may cause old Python code to break.
sv: Nya Python-utgåvor försöker hårt att vara kompatibla med tidigare utgåvor, och resultatet har varit ganska bra. Vissa ändringar anses dock vara tillräckligt användbara, vanligtvis för att de åtgärdar ursprungliga designbeslut som visade sig vara aktivt felaktiga, för att bryta bakåtkompatibilitet inte alltid kan undvikas. I detta avsnitt listas de ändringar i Python 2.0 som kan orsaka att gammal Python-kod bryts.

source: The change which will probably break the most code is tightening up the arguments accepted by some methods. Some methods would take multiple arguments and treat them as a tuple, particularly various list methods such as :meth:`!append` and :meth:`!insert`. In earlier versions of Python, if ``L`` is a list, ``L.append( 1,2 )`` appends the tuple ``(1,2)`` to the list. In Python 2.0 this causes a :exc:`TypeError` exception to be raised, with the message: 'append requires exactly 1 argument; 2 given'. The fix is to simply add an extra set of parentheses to pass both values as a tuple: ``L.append( (1,2) )``.
sv: Den förändring som förmodligen kommer att bryta mest kod är att strama upp de argument som accepteras av vissa metoder. Vissa metoder skulle ta flera argument och behandla dem som en tupel, särskilt olika listmetoder som :meth:`!append` och :meth:`!insert`. I tidigare versioner av Python, om ``L`` är en lista, lägger ``L.append( 1,2 )`` till tupeln ``(1,2)`` till listan. I Python 2.0 orsakar detta ett :exc:`TypeError`-undantag, med meddelandet: "append kräver exakt 1 argument; 2 ges". Lösningen är att helt enkelt lägga till en extra uppsättning parenteser för att skicka båda värdena som en tupel: ``L.append( (1,2) )``.

source: The earlier versions of these methods were more forgiving because they used an old function in Python's C interface to parse their arguments; 2.0 modernizes them to use :c:func:`PyArg_ParseTuple`, the current argument parsing function, which provides more helpful error messages and treats multi-argument calls as errors. If you absolutely must use 2.0 but can't fix your code, you can edit :file:`Objects/listobject.c` and define the preprocessor symbol ``NO_STRICT_LIST_APPEND`` to preserve the old behaviour; this isn't recommended.
sv: De tidigare versionerna av dessa metoder var mer förlåtande eftersom de använde en gammal funktion i Pythons C-gränssnitt för att analysera sina argument; 2.0 moderniserar dem till att använda :c:func:`PyArg_ParseTuple`, den aktuella argumentanalysfunktionen, som ger mer användbara felmeddelanden och behandlar anrop med flera argument som fel. Om du absolut måste använda 2.0 men inte kan fixa din kod kan du redigera :file:`Objects/listobject.c` och definiera preprocessorsymbolen ``NO_STRICT_LIST_APPEND`` för att bevara det gamla beteendet; detta rekommenderas dock inte.

source: Some of the functions in the :mod:`socket` module are still forgiving in this way. For example, ``socket.connect( ('hostname', 25) )`` is the correct form, passing a tuple representing an IP address, but ``socket.connect('hostname', 25)`` also works. :meth:`socket.connect_ex <socket.socket.connect_ex>` and :meth:`socket.bind <socket.socket.bind>` are similarly easy-going. 2.0alpha1 tightened these functions up, but because the documentation actually used the erroneous multiple argument form, many people wrote code which would break with the stricter checking. GvR backed out the changes in the face of public reaction, so for the :mod:`socket` module, the documentation was fixed and the multiple argument form is simply marked as deprecated; it *will* be tightened up again in a future Python version.
sv: Vissa av funktionerna i modulen :mod:`socket` är fortfarande förlåtande på det här sättet. Till exempel är ``socket.connect( ('hostname', 25) )`` den korrekta formen, som skickar en tupel som representerar en IP-adress, men ``socket.connect('hostname', 25)`` fungerar också. :meth:`socket.connect_ex <socket.socket.connect_ex>` och :meth:`socket.bind <socket.socket.bind>` är på samma sätt lättsamma. 2.0alpha1 skärpte dessa funktioner, men eftersom dokumentationen faktiskt använde den felaktiga formen med flera argument skrev många människor kod som skulle brytas med den strängare kontrollen. GvR backade ur förändringarna inför allmänhetens reaktion, så för :mod:`socket`-modulen fixades dokumentationen och formen med flera argument är helt enkelt markerad som föråldrad; den *kommer* att skärpas igen i en framtida Python-version.

source: The ``\x`` escape in string literals now takes exactly 2 hex digits. Previously it would consume all the hex digits following the 'x' and take the lowest 8 bits of the result, so ``\x123456`` was equivalent to ``\x56``.
sv: Escapen ``x`` i stränglitteraler tar nu exakt 2 hexsiffror. Tidigare användes alla hexadecimaler efter "x" och de lägsta 8 bitarna av resultatet, så att "x123456" motsvarade "x56".

source: The :exc:`AttributeError` and :exc:`NameError` exceptions have a more friendly error message, whose text will be something like ``'Spam' instance has no attribute 'eggs'`` or ``name 'eggs' is not defined``. Previously the error message was just the missing attribute name ``eggs``, and code written to take advantage of this fact will break in 2.0.
sv: Undantagen :exc:`AttributeError` och :exc:`NameError` har fått ett mer vänligt felmeddelande, vars text kommer att vara något i stil med ``'Spam'-instansen har inget attribut 'ägg'`` eller ``namnet 'ägg' är inte definierat``. Tidigare var felmeddelandet bara det saknade attributnamnet ``ägg``, och kod skriven för att dra nytta av detta faktum kommer att brytas i 2.0.

source: Some work has been done to make integers and long integers a bit more interchangeable. In 1.5.2, large-file support was added for Solaris, to allow reading files larger than 2 GiB; this made the :meth:`!tell` method of file objects return a long integer instead of a regular integer. Some code would subtract two file offsets and attempt to use the result to multiply a sequence or slice a string, but this raised a :exc:`TypeError`. In 2.0, long integers can be used to multiply or slice a sequence, and it'll behave as you'd intuitively expect it to; ``3L * 'abc'`` produces 'abcabcabc', and ``(0,1,2,3)[2L:4L]`` produces (2,3). Long integers can also be used in various contexts where previously only integers were accepted, such as in the :meth:`!seek` method of file objects, and in the formats supported by the ``%`` operator (``%d``, ``%i``, ``%x``, etc.). For example, ``"%d" % 2L**64`` will produce the string ``18446744073709551616``.
sv: En del arbete har gjorts för att göra heltal och långa heltal lite mer utbytbara. I 1.5.2 lades stöd för stora filer till för Solaris, för att göra det möjligt att läsa filer större än 2 GiB; detta gjorde att :meth:`!tell`-metoden för filobjekt returnerade ett långt heltal istället för ett vanligt heltal. Viss kod subtraherade två filoffset och försökte använda resultatet för att multiplicera en sekvens eller skära en sträng, men detta gav upphov till ett :exc:`TypeError`. I 2.0 kan långa heltal användas för att multiplicera eller skära en sekvens, och det kommer att bete sig som du intuitivt förväntar dig; ``3L * 'abc'`` ger 'abcabcabc', och ``(0,1,2,3)[2L:4L]`` ger (2,3). Långa heltal kan också användas i olika sammanhang där tidigare endast heltal accepterades, t.ex. i metoden :meth:`!seek` för filobjekt och i de format som stöds av operatorn ``%`` (``%d``, ``%i``, ``%x`` etc.). Till exempel kommer ``"%d" % 2L**64`` att ge strängen ``18446744073709551616``.

source: The subtlest long integer change of all is that the :func:`str` of a long integer no longer has a trailing 'L' character, though :func:`repr` still includes it. The 'L' annoyed many people who wanted to print long integers that looked just like regular integers, since they had to go out of their way to chop off the character. This is no longer a problem in 2.0, but code which does ``str(longval)[:-1]`` and assumes the 'L' is there, will now lose the final digit.
sv: Den mest subtila förändringen för långa heltal är att :func:`str` av ett långt heltal inte längre har ett efterföljande "L"-tecken, även om :func:`repr` fortfarande innehåller det. 'L' irriterade många som ville skriva ut långa heltal som såg ut precis som vanliga heltal, eftersom de var tvungna att anstränga sig för att klippa bort tecknet. Detta är inte längre ett problem i 2.0, men kod som gör ``str(longval)[:-1]`` och antar att 'L' finns där, kommer nu att förlora den sista siffran.

source: Taking the :func:`repr` of a float now uses a different formatting precision than :func:`str`. :func:`repr` uses ``%.17g`` format string for C's :func:`!sprintf`, while :func:`str` uses ``%.12g`` as before. The effect is that :func:`repr` may occasionally show more decimal places than :func:`str`, for certain numbers. For example, the number 8.1 can't be represented exactly in binary, so ``repr(8.1)`` is ``'8.0999999999999996'``, while str(8.1) is ``'8.1'``.
sv: Att ta :func:`repr` av en float använder nu en annan formateringsprecision än :func:`str`. :func:`repr` använder ``%.17g`` formatsträng för C:s :func:`!sprintf`, medan :func:`str` använder ``%.12g`` som tidigare. Effekten är att :func:`repr` ibland kan visa fler decimaler än :func:`str`, för vissa tal. Till exempel kan talet 8,1 inte representeras exakt binärt, så ``repr(8,1)`` är ``'8,0999999999999996'``, medan str(8,1) är ``'8,1'``.

source: The ``-X`` command-line option, which turned all standard exceptions into strings instead of classes, has been removed; the standard exceptions will now always be classes. The :mod:`!exceptions` module containing the standard exceptions was translated from Python to a built-in C module, written by Barry Warsaw and Fredrik Lundh.
sv: Kommandoradsalternativet ``-X``, som förvandlade alla standardundantag till strängar istället för klasser, har tagits bort; standardundantagen kommer nu alltid att vara klasser. Modulen :mod:`!exceptions` som innehåller standardundantagen har översatts från Python till en inbyggd C-modul, skriven av Barry Warsaw och Fredrik Lundh.

source: Extending/Embedding Changes
sv: Förändringar av utbyggnad och inbäddning

source: Some of the changes are under the covers, and will only be apparent to people writing C extension modules or embedding a Python interpreter in a larger application. If you aren't dealing with Python's C API, you can safely skip this section.
sv: Vissa av ändringarna är dolda och kommer bara att vara uppenbara för personer som skriver C-tilläggsmoduler eller bäddar in en Python-tolk i en större applikation. Om du inte har att göra med Pythons C API kan du hoppa över det här avsnittet.
