Repository: yeager/python-docs-sv
Catalog: whatsnew/2.0.po
Languages: sv

source: *stream_reader* is a class that supports decoding input from a stream. *stream_reader(file_obj)* returns an object that supports the :meth:`!read`, :meth:`!readline`, and :meth:`!readlines` methods. These methods will all translate from the given encoding and return Unicode strings.
sv: *stream_reader* är en klass som stöder avkodning av indata från en ström. *stream_reader(file_obj)* returnerar ett objekt som stöder metoderna :meth:`!read`, :meth:`!readline` och :meth:`!readlines`. Dessa metoder kommer alla att översätta från den givna kodningen och returnera Unicode-strängar.

source: *stream_writer*, similarly, is a class that supports encoding output to a stream. *stream_writer(file_obj)* returns an object that supports the :meth:`!write` and :meth:`!writelines` methods. These methods expect Unicode strings, translating them to the given encoding on output.
sv: *stream_writer* är på samma sätt en klass som stöder kodning av utdata till en ström. *stream_writer(file_obj)* returnerar ett objekt som stöder metoderna :meth:`!write` och :meth:`!writelines`. Dessa metoder förväntar sig Unicode-strängar och översätter dem till den angivna kodningen vid utmatning.

source: For example, the following code writes a Unicode string into a file, encoding it as UTF-8::
sv: Följande kod skriver till exempel en Unicode-sträng till en fil och kodar den som UTF-8::

source: The following code would then read UTF-8 input from the file::
sv: Följande kod skulle då läsa UTF-8-data från filen::

source: Unicode-aware regular expressions are available through the :mod:`re` module, which has a new underlying implementation called SRE written by Fredrik Lundh of Secret Labs AB.
sv: Unicode-medvetna reguljära uttryck är tillgängliga via modulen :mod:`re`, som har en ny underliggande implementation kallad SRE skriven av Fredrik Lundh på Secret Labs AB.

source: A ``-U`` command line option was added which causes the Python compiler to interpret all string literals as Unicode string literals. This is intended to be used in testing and future-proofing your Python code, since some future version of Python may drop support for 8-bit strings and provide only Unicode strings.
sv: Ett kommandoradsalternativ ``-U`` har lagts till som gör att Python-kompilatorn tolkar alla stränglitteraler som Unicode-stränglitteraler. Detta är avsett att användas för att testa och framtidssäkra din Python-kod, eftersom någon framtida version av Python kan släppa stödet för 8-bitars strängar och endast tillhandahålla Unicode-strängar.

source: List Comprehensions
sv: Listförståelse

source: Lists are a workhorse data type in Python, and many programs manipulate a list at some point. Two common operations on lists are to loop over them, and either pick out the elements that meet a certain criterion, or apply some function to each element. For example, given a list of strings, you might want to pull out all the strings containing a given substring, or strip off trailing whitespace from each line.
sv: Listor är en viktig datatyp i Python och många program manipulerar en lista vid något tillfälle. Två vanliga operationer på listor är att loopa över dem och antingen välja ut de element som uppfyller ett visst kriterium eller tillämpa någon funktion på varje element. Om du till exempel har en lista med strängar kanske du vill plocka ut alla strängar som innehåller en viss delsträng, eller ta bort efterföljande blanksteg från varje rad.

source: The existing :func:`map` and :func:`filter` functions can be used for this purpose, but they require a function as one of their arguments. This is fine if there's an existing built-in function that can be passed directly, but if there isn't, you have to create a little function to do the required work, and Python's scoping rules make the result ugly if the little function needs additional information. Take the first example in the previous paragraph, finding all the strings in the list containing a given substring. You could write the following to do it::
sv: De befintliga funktionerna :func:`map` och :func:`filter` kan användas för detta ändamål, men de kräver en funktion som ett av sina argument. Detta är bra om det finns en befintlig inbyggd funktion som kan skickas direkt, men om det inte finns det måste du skapa en liten funktion för att göra det arbete som krävs, och Pythons scoping-regler gör resultatet fult om den lilla funktionen behöver ytterligare information. Ta det första exemplet i föregående stycke, att hitta alla strängar i listan som innehåller en given delsträng. Du skulle kunna skriva följande för att göra det::

source: # Given the list L, make a list of all strings # containing the substring S. sublist = filter( lambda s, substring=S: string.find(s, substring) != -1, L)
sv: # Givet listan L, gör en lista över alla strängar # som innehåller delsträngen S. sublist = filter( lambda s, substring=S: string.find(s, substring) != -1, L)

source: Because of Python's scoping rules, a default argument is used so that the anonymous function created by the :keyword:`lambda` expression knows what substring is being searched for. List comprehensions make this cleaner::
sv: På grund av Pythons scoping-regler används ett standardargument så att den anonyma funktion som skapas av :keyword:`lambda'-uttrycket vet vilken delsträng som söks. Listförståelse gör detta renare::

source: List comprehensions have the form::
sv: Listkomprehensioner har formen::

source: [ expression for expr in sequence1 for expr2 in sequence2 ... for exprN in sequenceN if condition ]
sv: [ uttryck för expr i sekvens1 för expr2 i sekvens2 ... för exprN i sekvensN om villkor ]

source: The :keyword:`!for`...\ :keyword:`!in` clauses contain the sequences to be iterated over. The sequences do not have to be the same length, because they are *not* iterated over in parallel, but from left to right; this is explained more clearly in the following paragraphs. The elements of the generated list will be the successive values of *expression*. The final :keyword:`!if` clause is optional; if present, *expression* is only evaluated and added to the result if *condition* is true.
sv: Klausulerna :keyword:`!for`...\ :keyword:`!in` innehåller de sekvenser som skall itereras över. Sekvenserna behöver inte vara lika långa, eftersom de *inte* itereras parallellt, utan från vänster till höger; detta förklaras tydligare i följande stycken. Elementen i den genererade listan kommer att vara de successiva värdena av *uttryck*. Den avslutande :keyword:`!if`-satsen är valfri; om den finns med utvärderas *uttryck* och läggs till i resultatet endast om *villkor* är sant.

source: To make the semantics very clear, a list comprehension is equivalent to the following Python code::
sv: För att göra semantiken mycket tydlig är en listförståelse likvärdig med följande Python-kod::

source: for expr1 in sequence1: for expr2 in sequence2: ... for exprN in sequenceN: if (condition): # Append the value of # the expression to the # resulting list.
sv: för expr1 i sekvens1: för expr2 i sekvens2: ... för exprN i sekvensN: if (villkor): # Lägg till värdet av # uttrycket till den # resulterande listan.

source: This means that when there are multiple :keyword:`!for`...\ :keyword:`!in` clauses, the resulting list will be equal to the product of the lengths of all the sequences. If you have two lists of length 3, the output list is 9 elements long::
sv: Detta innebär att när det finns flera :keyword:`!for`...\ :keyword:`!in`-klausuler, kommer den resulterande listan att vara lika med produkten av längden på alla sekvenser. Om du har två listor med längden 3, är utdatalistan 9 element lång::

source: To avoid introducing an ambiguity into Python's grammar, if *expression* is creating a tuple, it must be surrounded with parentheses. The first list comprehension below is a syntax error, while the second one is correct::
sv: För att undvika att införa en tvetydighet i Pythons grammatik, om *uttryck* skapar en tupel, måste den omges av parenteser. Den första listförståelsen nedan är ett syntaxfel, medan den andra är korrekt::

source: # Syntax error [ x,y for x in seq1 for y in seq2] # Correct [ (x,y) for x in seq1 for y in seq2]
sv: # Syntaxfel [ x,y för x i seq1 för y i seq2] # Korrekt [ (x,y) för x i seq1 för y i seq2]

source: The idea of list comprehensions originally comes from the functional programming language Haskell (https://www.haskell.org). Greg Ewing argued most effectively for adding them to Python and wrote the initial list comprehension patch, which was then discussed for a seemingly endless time on the python-dev mailing list and kept up-to-date by Skip Montanaro.
sv: Idén med listcomprehensions kommer ursprungligen från det funktionella programmeringsspråket Haskell (https://www.haskell.org). Greg Ewing argumenterade mycket effektivt för att lägga till dem i Python och skrev den första patchen för listförståelse, som sedan diskuterades under en till synes oändlig tid på e-postlistan python-dev och hölls uppdaterad av Skip Montanaro.

source: Augmented Assignment
sv: Förstärkt uppdrag

source: Augmented assignment operators, another long-requested feature, have been added to Python 2.0. Augmented assignment operators include ``+=``, ``-=``, ``*=``, and so forth. For example, the statement ``a += 2`` increments the value of the variable ``a`` by 2, equivalent to the slightly lengthier ``a = a + 2``.
sv: Augmented assignment operators, en annan länge efterfrågad funktion, har lagts till i Python 2.0. Förstärkta tilldelningsoperatorer inkluderar ``+=``, ``-=``, ``*=``, och så vidare. Till exempel, uttalandet ``a += 2`` ökar värdet på variabeln ``a`` med 2, vilket motsvarar den något längre ``a = a + 2``.

source: The full list of supported assignment operators is ``+=``, ``-=``, ``*=``, ``/=``, ``%=``, ``**=``, ``&=``, ``|=``, ``^=``, ``>>=``, and ``<<=``. Python classes can override the augmented assignment operators by defining methods named :meth:`!__iadd__`, :meth:`!__isub__`, etc. For example, the following :class:`!Number` class stores a number and supports using += to create a new instance with an incremented value.
sv: Den fullständiga listan över tilldelningsoperatorer som stöds är ``+=``, ``-=``, ``*=``, ``/=``, ``%=``, ``**=``, ``&=``, ``|=``, ``^=``, ``>>=`` och ``<<=``. Python-klasser kan åsidosätta de utökade tilldelningsoperatorerna genom att definiera metoder med namnet :meth:`!__iadd__`, :meth:`!__isub__`, etc. Till exempel lagrar följande :class:`!Number`-klass ett tal och stöder användning av += för att skapa en ny instans med ett ökat värde.

source: class Number: def __init__(self, value): self.value = value def __iadd__(self, increment): return Number( self.value + increment) n = Number(5) n += 3 print n.value
sv: klass Nummer: def __init__(self, värde): self.value = värde def __iadd__(self, inkrement): return Number( self.value + ökning) n = Antal(5) n += 3 print n.värde

source: The :meth:`!__iadd__` special method is called with the value of the increment, and should return a new instance with an appropriately modified value; this return value is bound as the new value of the variable on the left-hand side.
sv: Specialmetoden :meth:`!__iadd__` anropas med värdet av inkrementet och ska returnera en ny instans med ett lämpligt modifierat värde; detta returvärde binds som det nya värdet av variabeln på vänster sida.

source: Augmented assignment operators were first introduced in the C programming language, and most C-derived languages, such as :program:`awk`, C++, Java, Perl, and PHP also support them. The augmented assignment patch was implemented by Thomas Wouters.
sv: Augmented assignment-operatorer introducerades först i programmeringsspråket C, och de flesta C-avledda språk, till exempel :program:`awk`, C++, Java, Perl och PHP stöder dem också. Augmented assignment-patchen implementerades av Thomas Wouters.

source: String Methods
sv: Strängmetoder

source: Until now string-manipulation functionality was in the :mod:`string` module, which was usually a front-end for the :mod:`!strop` module written in C. The addition of Unicode posed a difficulty for the :mod:`!strop` module, because the functions would all need to be rewritten in order to accept either 8-bit or Unicode strings. For functions such as :func:`!string.replace`, which takes 3 string arguments, that means eight possible permutations, and correspondingly complicated code.
sv: Hittills har strängmanipuleringsfunktionaliteten legat i modulen :mod:`string`, som vanligtvis var en frontend för modulen :mod:`!strop` skriven i C. Tillägget av Unicode innebar en svårighet för modulen :mod:`!strop`, eftersom alla funktioner måste skrivas om för att acceptera antingen 8-bitars eller Unicode-strängar. För funktioner som :func:`!string.replace`, som tar 3 strängargument, innebär det åtta möjliga permutationer och därmed komplicerad kod.

source: Instead, Python 2.0 pushes the problem onto the string type, making string manipulation functionality available through methods on both 8-bit strings and Unicode strings. ::
sv: Istället flyttar Python 2.0 problemet till strängtypen, vilket gör strängmanipuleringsfunktionalitet tillgänglig via metoder på både 8-bitars strängar och Unicode-strängar:

source: One thing that hasn't changed, a noteworthy April Fools' joke notwithstanding, is that Python strings are immutable. Thus, the string methods return new strings, and do not modify the string on which they operate.
sv: En sak som inte har förändrats, trots ett anmärkningsvärt aprilskämt, är att Python-strängar är oföränderliga. Strängmetoderna returnerar alltså nya strängar och ändrar inte den sträng som de arbetar med.

source: The old :mod:`string` module is still around for backwards compatibility, but it mostly acts as a front-end to the new string methods.
sv: Den gamla :mod:`string`-modulen finns fortfarande kvar för bakåtkompatibilitet, men den fungerar mest som en frontend till de nya string-metoderna.

source: Two methods which have no parallel in pre-2.0 versions, although they did exist in JPython for quite some time, are :meth:`!startswith` and :meth:`!endswith`. ``s.startswith(t)`` is equivalent to ``s[:len(t)] == t``, while ``s.endswith(t)`` is equivalent to ``s[-len(t):] == t``.
sv: Två metoder som inte har någon parallell i pre-2.0-versioner, även om de fanns i JPython under ganska lång tid, är :meth:`!startswith` och :meth:`!endswith`. ``s.startswith(t)`` är likvärdigt med ``s[:len(t)] == t``, medan ``s.endswith(t)`` är likvärdigt med ``s[-len(t):] == t``.

source: One other method which deserves special mention is :meth:`!join`. The :meth:`!join` method of a string receives one parameter, a sequence of strings, and is equivalent to the :func:`!string.join` function from the old :mod:`string` module, with the arguments reversed. In other words, ``s.join(seq)`` is equivalent to the old ``string.join(seq, s)``.
sv: En annan metod som förtjänar ett särskilt omnämnande är :meth:`!join`. Metoden :meth:`!join` för en sträng tar emot en parameter, en sekvens av strängar, och är likvärdig med funktionen :func:`!string.join` från den gamla modulen :mod:`string`, med omvända argument. Med andra ord, ``s.join(seq)`` är likvärdig med den gamla ``string.join(seq, s)``.

source: Garbage Collection of Cycles
sv: Sophämtning av cykler

source: The C implementation of Python uses reference counting to implement garbage collection. Every Python object maintains a count of the number of references pointing to itself, and adjusts the count as references are created or destroyed. Once the reference count reaches zero, the object is no longer accessible, since you need to have a reference to an object to access it, and if the count is zero, no references exist any longer.
sv: C-implementeringen av Python använder referensräkning för att implementera skräpinsamling. Varje Python-objekt håller reda på antalet referenser som pekar på det självt och justerar antalet när referenser skapas eller förstörs. När referensantalet når noll är objektet inte längre tillgängligt, eftersom du måste ha en referens till ett objekt för att komma åt det, och om antalet är noll finns det inte längre några referenser.

source: Reference counting has some pleasant properties: it's easy to understand and implement, and the resulting implementation is portable, fairly fast, and reacts well with other libraries that implement their own memory handling schemes. The major problem with reference counting is that it sometimes doesn't realise that objects are no longer accessible, resulting in a memory leak. This happens when there are cycles of references.
sv: Referensräkning har några trevliga egenskaper: det är lätt att förstå och implementera, och den resulterande implementationen är portabel, ganska snabb och reagerar bra med andra bibliotek som implementerar sina egna minneshanteringsscheman. Det stora problemet med referensräkning är att det ibland inte inser att objekt inte längre är tillgängliga, vilket resulterar i en minnesläcka. Detta händer när det finns cykler av referenser.

source: Consider the simplest possible cycle, a class instance which has a reference to itself::
sv: Tänk på den enklaste möjliga cykeln, en klassinstans som har en referens till sig själv::

source: instance = SomeClass() instance.myself = instance
sv: instance = NågonKlass() instance.myself = instans

source: After the above two lines of code have been executed, the reference count of ``instance`` is 2; one reference is from the variable named ``'instance'``, and the other is from the ``myself`` attribute of the instance.
sv: Efter att ovanstående två rader kod har exekverats är referensantalet för ``instance`` 2; en referens är från variabeln med namnet ``'instance`` och den andra är från ``myself``-attributet för instansen.

source: If the next line of code is ``del instance``, what happens? The reference count of ``instance`` is decreased by 1, so it has a reference count of 1; the reference in the ``myself`` attribute still exists. Yet the instance is no longer accessible through Python code, and it could be deleted. Several objects can participate in a cycle if they have references to each other, causing all of the objects to be leaked.
sv: Om nästa kodrad är ``del instance``, vad händer då? Referensantalet för ``instance`` minskas med 1, så att det har ett referensantal på 1; referensen i attributet ``myself`` existerar fortfarande. Instansen är dock inte längre tillgänglig via Python-kod och kan raderas. Flera objekt kan delta i en cykel om de har referenser till varandra, vilket leder till att alla objekt läcker.

source: Python 2.0 fixes this problem by periodically executing a cycle detection algorithm which looks for inaccessible cycles and deletes the objects involved. A new :mod:`gc` module provides functions to perform a garbage collection, obtain debugging statistics, and tuning the collector's parameters.
sv: Python 2.0 löser detta problem genom att periodiskt köra en algoritm för cykeldetektering som letar efter otillgängliga cykler och raderar de inblandade objekten. En ny :mod:`gc`-modul innehåller funktioner för att utföra en skräpsamling, få felsökningsstatistik och ställa in samlarens parametrar.

source: Running the cycle detection algorithm takes some time, and therefore will result in some additional overhead. It is hoped that after we've gotten experience with the cycle collection from using 2.0, Python 2.1 will be able to minimize the overhead with careful tuning. It's not yet obvious how much performance is lost, because benchmarking this is tricky and depends crucially on how often the program creates and destroys objects. The detection of cycles can be disabled when Python is compiled, if you can't afford even a tiny speed penalty or suspect that the cycle collection is buggy, by specifying the :option:`!--without-cycle-gc` switch when running the :program:`configure` script.
sv: Att köra cykeldetekteringsalgoritmen tar lite tid och kommer därför att resultera i lite extra overhead. Förhoppningen är att Python 2.1, efter att vi har fått erfarenhet av cykelinsamlingen från att använda 2.0, ska kunna minimera overhead med noggrann inställning. Det är ännu inte uppenbart hur mycket prestanda som går förlorad, eftersom benchmarking av detta är knepigt och beror avgörande på hur ofta programmet skapar och förstör objekt. Detekteringen av cykler kan inaktiveras när Python kompileras, om du inte har råd med ens en liten hastighetsnedsättning eller misstänker att cykelinsamlingen är buggig, genom att ange :option:`!--without-cycle-gc` switch när du kör :program:`configure` scriptet.

source: Several people tackled this problem and contributed to a solution. An early implementation of the cycle detection approach was written by Toby Kelsey. The current algorithm was suggested by Eric Tiedemann during a visit to CNRI, and Guido van Rossum and Neil Schemenauer wrote two different implementations, which were later integrated by Neil. Lots of other people offered suggestions along the way; the March 2000 archives of the python-dev mailing list contain most of the relevant discussion, especially in the threads titled "Reference cycle collection for Python" and "Finalization again".
sv: Flera personer tog sig an detta problem och bidrog till en lösning. En tidig implementering av metoden för cykeldetektering skrevs av Toby Kelsey. Den nuvarande algoritmen föreslogs av Eric Tiedemann under ett besök på CNRI, och Guido van Rossum och Neil Schemenauer skrev två olika implementeringar, som senare integrerades av Neil. Många andra personer kom med förslag under resans gång; arkiven från mars 2000 på e-postlistan python-dev innehåller de flesta relevanta diskussionerna, särskilt i trådarna med titlarna "Reference cycle collection for Python" och "Finalization again".

source: Other Core Changes
sv: Övriga förändringar i kärnverksamheten

source: Various minor changes have been made to Python's syntax and built-in functions. None of the changes are very far-reaching, but they're handy conveniences.
sv: Olika mindre ändringar har gjorts i Pythons syntax och inbyggda funktioner. Ingen av ändringarna är särskilt långtgående, men de är praktiska bekvämligheter.

source: Minor Language Changes
sv: Mindre språkliga ändringar

source: A new syntax makes it more convenient to call a given function with a tuple of arguments and/or a dictionary of keyword arguments. In Python 1.5 and earlier, you'd use the :func:`!apply` built-in function: ``apply(f, args, kw)`` calls the function :func:`!f` with the argument tuple *args* and the keyword arguments in the dictionary *kw*. :func:`!apply` is the same in 2.0, but thanks to a patch from Greg Ewing, ``f(*args, **kw)`` is a shorter and clearer way to achieve the same effect. This syntax is symmetrical with the syntax for defining functions::
sv: En ny syntax gör det mer praktiskt att anropa en given funktion med en tupel av argument och/eller en ordbok med nyckelordsargument. I Python 1.5 och tidigare skulle du använda den inbyggda funktionen :func:`!apply`: ``apply(f, args, kw)`` anropar funktionen :func:`!f` med argumenttupeln *args* och nyckelordsargumenten i ordlistan *kw*. :func:`!apply` är densamma i 2.0, men tack vare en patch från Greg Ewing är ``f(*args, **kw)`` ett kortare och tydligare sätt att uppnå samma effekt. Denna syntax är symmetrisk med syntaxen för att definiera funktioner::

source: def f(*args, **kw): # args is a tuple of positional args, # kw is a dictionary of keyword args ...
sv: def f(*args, **kw): # args är en tupel av positionella args, # kw är en ordbok med nyckelordsargument ...
