Repository: yeager/python-docs-sv
Catalog: whatsnew/2.2.po
Languages: sv

source: What's New in Python 2.2
sv: Vad är nytt i Python 2.2

source: Author
sv: Författare

source: Introduction
sv: Introduktion

source: This article explains the new features in Python 2.2.2, released on October 14, 2002. Python 2.2.2 is a bugfix release of Python 2.2, originally released on December 21, 2001.
sv: Den här artikeln förklarar de nya funktionerna i Python 2.2.2, som släpptes den 14 oktober 2002. Python 2.2.2 är en buggfixversion av Python 2.2, som ursprungligen släpptes den 21 december 2001.

source: Python 2.2 can be thought of as the "cleanup release". There are some features such as generators and iterators that are completely new, but most of the changes, significant and far-reaching though they may be, are aimed at cleaning up irregularities and dark corners of the language design.
sv: Python 2.2 kan betraktas som en "uppstädningsversion". Det finns några funktioner som generatorer och iteratorer som är helt nya, men de flesta av ändringarna, även om de är betydande och långtgående, syftar till att rensa upp oegentligheter och mörka hörn i språkdesignen.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.2, such as the `Python Library Reference <https://docs.python.org/2.2/lib/lib.html>`_ and the `Python Reference Manual <https://docs.python.org/2.2/ref/ref.html>`_. If you want to understand the complete implementation and design rationale for a change, refer to the PEP for a particular new feature.
sv: Den här artikeln är inte ett försök att ge en fullständig specifikation av de nya funktionerna, utan ger istället en praktisk översikt. För fullständiga detaljer bör du läsa dokumentationen för Python 2.2, till exempel `Python Library Reference <https://docs.python.org/2.2/lib/lib.html>`_ och `Python Reference Manual <https://docs.python.org/2.2/ref/ref.html>`_. Om du vill förstå den fullständiga implementeringen och designrationalen för en ändring, se PEP för en viss ny funktion.

source: PEPs 252 and 253: Type and Class Changes
sv: PEP 252 och 253: Ändringar av typ och klass

source: The largest and most far-reaching changes in Python 2.2 are to Python's model of objects and classes. The changes should be backward compatible, so it's likely that your code will continue to run unchanged, but the changes provide some amazing new capabilities. Before beginning this, the longest and most complicated section of this article, I'll provide an overview of the changes and offer some comments.
sv: De största och mest långtgående förändringarna i Python 2.2 gäller Pythons modell för objekt och klasser. Ändringarna bör vara bakåtkompatibla, så det är troligt att din kod kommer att fortsätta att köras oförändrad, men ändringarna ger några fantastiska nya funktioner. Innan jag börjar med detta, det längsta och mest komplicerade avsnittet i den här artikeln, ska jag ge en översikt över ändringarna och ge några kommentarer.

source: A long time ago I wrote a web page listing flaws in Python's design. One of the most significant flaws was that it's impossible to subclass Python types implemented in C. In particular, it's not possible to subclass built-in types, so you can't just subclass, say, lists in order to add a single useful method to them. The :mod:`!UserList` module provides a class that supports all of the methods of lists and that can be subclassed further, but there's lots of C code that expects a regular Python list and won't accept a :class:`~collections.UserList` instance.
sv: För länge sedan skrev jag en webbsida som listade brister i Pythons design. En av de mest betydande bristerna var att det är omöjligt att subklassa Python-typer som implementerats i C. I synnerhet är det inte möjligt att subklassa inbyggda typer, så du kan inte bara subklassa, säg, listor för att lägga till en enda användbar metod till dem. Modulen :mod:`!UserList` tillhandahåller en klass som stöder alla metoder för listor och som kan subklassas ytterligare, men det finns massor av C-kod som förväntar sig en vanlig Python-lista och inte accepterar en :class:`~collections.UserList`-instans.

source: Python 2.2 fixes this, and in the process adds some exciting new capabilities. A brief summary:
sv: Python 2.2 åtgärdar detta och lägger samtidigt till några spännande nya funktioner. En kort sammanfattning:

source: You can subclass built-in types such as lists and even integers, and your subclasses should work in every place that requires the original type.
sv: Du kan subklassa inbyggda typer som listor och till och med heltal, och dina subklasser ska fungera på alla ställen som kräver den ursprungliga typen.

source: It's now possible to define static and class methods, in addition to the instance methods available in previous versions of Python.
sv: Det är nu möjligt att definiera statiska metoder och klassmetoder, utöver de instansmetoder som fanns i tidigare versioner av Python.

source: It's also possible to automatically call methods on accessing or setting an instance attribute by using a new mechanism called :dfn:`properties`. Many uses of :meth:`~object.__getattr__` can be rewritten to use properties instead, making the resulting code simpler and faster. As a small side benefit, attributes can now have docstrings, too.
sv: Det är också möjligt att automatiskt anropa metoder för att komma åt eller ställa in ett instansattribut genom att använda en ny mekanism som kallas :dfn:`properties`. Många användningar av :meth:`~object.__getattr__` kan skrivas om för att använda egenskaper istället, vilket gör den resulterande koden enklare och snabbare. Som en liten sidofördel kan attribut nu också ha docstrings.

source: The list of legal attributes for an instance can be limited to a particular set using :dfn:`slots`, making it possible to safeguard against typos and perhaps make more optimizations possible in future versions of Python.
sv: Listan över lagliga attribut för en instans kan begränsas till en viss uppsättning med hjälp av :dfn:`slots`, vilket gör det möjligt att skydda sig mot typfel och kanske göra fler optimeringar möjliga i framtida versioner av Python.

source: Some users have voiced concern about all these changes. Sure, they say, the new features are neat and lend themselves to all sorts of tricks that weren't possible in previous versions of Python, but they also make the language more complicated. Some people have said that they've always recommended Python for its simplicity, and feel that its simplicity is being lost.
sv: Vissa användare har uttryckt oro över alla dessa förändringar. Visst, säger de, de nya funktionerna är snygga och lämpar sig för alla möjliga knep som inte var möjliga i tidigare versioner av Python, men de gör också språket mer komplicerat. Vissa människor har sagt att de alltid har rekommenderat Python för dess enkelhet och känner att dess enkelhet går förlorad.

source: Personally, I think there's no need to worry. Many of the new features are quite esoteric, and you can write a lot of Python code without ever needed to be aware of them. Writing a simple class is no more difficult than it ever was, so you don't need to bother learning or teaching them unless they're actually needed. Some very complicated tasks that were previously only possible from C will now be possible in pure Python, and to my mind that's all for the better.
sv: Personligen tycker jag inte att det finns någon anledning att oroa sig. Många av de nya funktionerna är ganska esoteriska, och du kan skriva mycket Python-kod utan att någonsin behöva vara medveten om dem. Att skriva en enkel klass är inte svårare än det någonsin varit, så du behöver inte bry dig om att lära dig eller lära ut dem om de inte faktiskt behövs. Vissa mycket komplicerade uppgifter som tidigare bara var möjliga från C kommer nu att vara möjliga i ren Python, och enligt min mening är det allt till det bättre.

source: I'm not going to attempt to cover every single corner case and small change that were required to make the new features work. Instead this section will paint only the broad strokes. See section :ref:`sect-rellinks`, "Related Links", for further sources of information about Python 2.2's new object model.
sv: Jag tänker inte försöka gå igenom varje enskilt hörnfall och liten förändring som krävdes för att få de nya funktionerna att fungera. Istället kommer det här avsnittet bara att måla de breda penseldragen. Se avsnitt :ref:`sect-rellinks`, "Relaterade länkar", för ytterligare informationskällor om Python 2.2:s nya objektmodell.

source: Old and New Classes
sv: Gamla och nya klasser

source: First, you should know that Python 2.2 really has two kinds of classes: classic or old-style classes, and new-style classes. The old-style class model is exactly the same as the class model in earlier versions of Python. All the new features described in this section apply only to new-style classes. This divergence isn't intended to last forever; eventually old-style classes will be dropped, possibly in Python 3.0.
sv: Först bör du veta att Python 2.2 verkligen har två typer av klasser: klassiska eller gamla klasser och nya klasser. Klassmodellen i den gamla stilen är exakt densamma som klassmodellen i tidigare versioner av Python. Alla nya funktioner som beskrivs i det här avsnittet gäller bara för klasser av ny typ. Denna skillnad är inte avsedd att vara för evigt; så småningom kommer klasser i gammal stil att tas bort, möjligen i Python 3.0.

source: So how do you define a new-style class? You do it by subclassing an existing new-style class. Most of Python's built-in types, such as integers, lists, dictionaries, and even files, are new-style classes now. A new-style class named :class:`object`, the base class for all built-in types, has also been added so if no built-in type is suitable, you can just subclass :class:`object`::
sv: Så hur definierar man en new-style class? Det gör man genom att subklassa en befintlig new-style class. De flesta av Pythons inbyggda typer, som heltal, listor, ordböcker och till och med filer, är nu new-style-klasser. En ny stilklass med namnet :class:`object`, basklassen för alla inbyggda typer, har också lagts till så om ingen inbyggd typ är lämplig kan du bara subklassa :class:`object`::

source: class C(object): def __init__ (self): ... ...
sv: klass C(objekt): def __init__ (self): ... ...

source: This means that :keyword:`class` statements that don't have any base classes are always classic classes in Python 2.2. (Actually you can also change this by setting a module-level variable named :attr:`!__metaclass__` --- see :pep:`253` for the details --- but it's easier to just subclass :class:`object`.)
sv: Detta innebär att :keyword:`class`-satser som inte har några basklasser alltid är klassiska klasser i Python 2.2. (Egentligen kan du också ändra detta genom att ställa in en variabel på modulnivå som heter :attr:`!__metaclass__` --- se :pep:`253` för detaljerna --- men det är lättare att bara subklassa :class:`object`.)

source: The type objects for the built-in types are available as built-ins, named using a clever trick. Python has always had built-in functions named :func:`int`, :func:`float`, and :func:`str`. In 2.2, they aren't functions any more, but type objects that behave as factories when called. ::
sv: Typobjekten för de inbyggda typerna finns tillgängliga som inbyggda funktioner, namngivna med hjälp av ett smart trick. Python har alltid haft inbyggda funktioner med namnen :func:`int`, :func:`float` och :func:`str`. I 2.2 är de inte längre funktioner, utan typobjekt som beter sig som fabriker när de anropas. ::

source: >>> int <type 'int'> >>> int('123') 123
sv: >>> int <typ 'int'> >>> int('123') >>> int('123') 123

source: To make the set of types complete, new type objects such as :func:`dict` and :func:`!file` have been added. Here's a more interesting example, adding a :meth:`!lock` method to file objects::
sv: För att göra uppsättningen av typer komplett har nya typobjekt som :func:`dict` och :func:`!file` lagts till. Här är ett mer intressant exempel, där vi lägger till en :meth:`!lock`-metod till filobjekt::

source: class LockableFile(file): def lock (self, operation, length=0, start=0, whence=0): import fcntl return fcntl.lockf(self.fileno(), operation, length, start, whence)
sv: klass LockableFile(fil): def lock (self, operation, length=0, start=0, whence=0): import fcntl return fcntl.lockf(self.fileno(), operation, längd, start, whence)

source: The now-obsolete :mod:`!posixfile` module contained a class that emulated all of a file object's methods and also added a :meth:`!lock` method, but this class couldn't be passed to internal functions that expected a built-in file, something which is possible with our new :class:`!LockableFile`.
sv: Den numera obsoleta modulen :mod:`!posixfile` innehöll en klass som emulerade alla ett filobjekts metoder och lade även till en :meth:`!lock`-metod, men den här klassen kunde inte skickas till interna funktioner som förväntade sig en inbyggd fil, något som är möjligt med vår nya :class:`!LockableFile`.

source: Descriptors
sv: Deskriptorer

source: In previous versions of Python, there was no consistent way to discover what attributes and methods were supported by an object. There were some informal conventions, such as defining :attr:`!__members__` and :attr:`!__methods__` attributes that were lists of names, but often the author of an extension type or a class wouldn't bother to define them. You could fall back on inspecting the :attr:`~object.__dict__` of an object, but when class inheritance or an arbitrary :meth:`!__getattr__` hook were in use this could still be inaccurate.
sv: I tidigare versioner av Python fanns det inget konsekvent sätt att upptäcka vilka attribut och metoder som stöddes av ett objekt. Det fanns några informella konventioner, som att definiera attributen :attr:`!__members__` och :attr:`!__methods__` som var namnlistor, men ofta brydde sig inte författaren till en extensionstyp eller en klass om att definiera dem. Man kunde falla tillbaka på att inspektera :attr:`~object.__dict__` för ett objekt, men när klassarv eller en godtycklig :meth:`!__getattr__`-krok användes kunde detta fortfarande vara felaktigt.

source: The one big idea underlying the new class model is that an API for describing the attributes of an object using :dfn:`descriptors` has been formalized. Descriptors specify the value of an attribute, stating whether it's a method or a field. With the descriptor API, static methods and class methods become possible, as well as more exotic constructs.
sv: Den stora idén bakom den nya klassmodellen är att ett API för att beskriva attributen hos ett objekt med hjälp av :dfn:`descriptors` har formaliserats. Descriptors specificerar värdet på ett attribut och anger om det är en metod eller ett fält. Med API:et för deskriptorer blir statiska metoder och klassmetoder möjliga, liksom mer exotiska konstruktioner.

source: Attribute descriptors are objects that live inside class objects, and have a few attributes of their own:
sv: Attributbeskrivare är objekt som finns inuti klassobjekt och som har några egna attribut:

source: :attr:`~definition.__name__` is the attribute's name.
sv: :attr:`~definition.__name__` är attributets namn.

source: :attr:`~definition.__doc__` is the attribute's docstring.
sv: :attr:`~definition.__doc__` är attributets docstring.

source: ``__get__(object)`` is a method that retrieves the attribute value from *object*.
sv: ``__get__(object)`` är en metod som hämtar attributvärdet från *object*.

source: ``__set__(object, value)`` sets the attribute on *object* to *value*.
sv: ``__set__(objekt, värde)``` sätter attributet på *objekt* till *värde*.

source: ``__delete__(object, value)`` deletes the *value* attribute of *object*.
sv: ``__delete__(object, value)`` raderar attributet *value* i *object*.

source: For example, when you write ``obj.x``, the steps that Python actually performs are::
sv: När du till exempel skriver ``obj.x`` är de steg som Python faktiskt utför följande::

source: For methods, :meth:`descriptor.__get__ <object.__get__>` returns a temporary object that's callable, and wraps up the instance and the method to be called on it. This is also why static methods and class methods are now possible; they have descriptors that wrap up just the method, or the method and the class. As a brief explanation of these new kinds of methods, static methods aren't passed the instance, and therefore resemble regular functions. Class methods are passed the class of the object, but not the object itself. Static and class methods are defined like this::
sv: För metoder returnerar :meth:`descriptor.__get__ <object.__get__>` ett temporärt objekt som kan anropas och som innehåller instansen och den metod som ska anropas på den. Det är också därför som statiska metoder och klassmetoder nu är möjliga; de har deskriptorer som omsluter bara metoden, eller metoden och klassen. En kort förklaring av dessa nya typer av metoder är att statiska metoder inte får instansen och därför liknar vanliga funktioner. Klassmetoder får objektets klass, men inte själva objektet. Statiska metoder och klassmetoder definieras så här::

source: class C(object): def f(arg1, arg2): ... f = staticmethod(f) def g(cls, arg1, arg2): ... g = classmethod(g)
sv: klass C(objekt): def f(arg1, arg2): ... f = staticmethod(f) def g(cls, arg1, arg2): ... g = klassmetod(g)

source: The :func:`staticmethod` function takes the function :func:`!f`, and returns it wrapped up in a descriptor so it can be stored in the class object. You might expect there to be special syntax for creating such methods (``def static f``, ``defstatic f()``, or something like that) but no such syntax has been defined yet; that's been left for future versions of Python.
sv: Funktionen :func:`staticmethod` tar funktionen :func:`!f` och returnerar den inslagen i en deskriptor så att den kan lagras i klassobjektet. Du kanske förväntar dig att det ska finnas en speciell syntax för att skapa sådana metoder (``def static f``, ``defstatic f()``, eller något liknande) men ingen sådan syntax har definierats ännu; det har lämnats till framtida versioner av Python.

source: More new features, such as slots and properties, are also implemented as new kinds of descriptors, and it's not difficult to write a descriptor class that does something novel. For example, it would be possible to write a descriptor class that made it possible to write Eiffel-style preconditions and postconditions for a method. A class that used this feature might be defined like this::
sv: Fler nya funktioner, som slots och properties, implementeras också som nya typer av descriptors, och det är inte svårt att skriva en descriptor-klass som gör något nytt. Det skulle till exempel vara möjligt att skriva en deskriptorklass som gör det möjligt att skriva för- och eftervillkor i Eiffelstil för en metod. En klass som använder denna funktion skulle kunna definieras så här::

source: from eiffel import eiffelmethod class C(object): def f(self, arg1, arg2): # The actual function ... def pre_f(self): # Check preconditions ... def post_f(self): # Check postconditions ... f = eiffelmethod(f, pre_f, post_f)
sv: från eiffel import eiffelmethod klass C(objekt): def f(self, arg1, arg2): # Den faktiska funktionen ... def pre_f(self): # Kontrollera förhandsvillkor ... def post_f(self): # Kontrollera eftervillkor ... f = eiffelmethod(f, pre_f, post_f)

source: Note that a person using the new :func:`!eiffelmethod` doesn't have to understand anything about descriptors. This is why I think the new features don't increase the basic complexity of the language. There will be a few wizards who need to know about it in order to write :func:`!eiffelmethod` or the ZODB or whatever, but most users will just write code on top of the resulting libraries and ignore the implementation details.
sv: Observera att en person som använder den nya :func:`!eiffelmethod` inte behöver förstå någonting om deskriptorer. Det är därför jag tror att de nya funktionerna inte ökar språkets grundläggande komplexitet. Det kommer att finnas några trollkarlar som behöver känna till det för att kunna skriva :func:`!eiffelmethod` eller ZODB eller vad som helst, men de flesta användare kommer bara att skriva kod ovanpå de resulterande biblioteken och ignorera implementationsdetaljerna.

source: Multiple Inheritance: The Diamond Rule
sv: Multipel arvbarhet: Diamantregeln

source: Multiple inheritance has also been made more useful through changing the rules under which names are resolved. Consider this set of classes (diagram taken from :pep:`253` by Guido van Rossum)::
sv: Multipel nedärvning har också gjorts mer användbar genom att ändra reglerna för hur namn löses. Tänk på denna uppsättning klasser (diagrammet är hämtat från :pep:`253` av Guido van Rossum)::

source: class A: ^ ^ def save(self): ... / \ / \ / \ / \ class B class C: ^ ^ def save(self): ... \ / \ / \ / \ / class D
sv: klass A: ^ ^ def save(self): ... / \ / \ / \ / \ klass B klass C: ^ ^ def save(self): ... \ / klass D

source: The lookup rule for classic classes is simple but not very smart; the base classes are searched depth-first, going from left to right. A reference to :meth:`!D.save` will search the classes :class:`!D`, :class:`!B`, and then :class:`!A`, where :meth:`!save` would be found and returned. :meth:`!C.save` would never be found at all. This is bad, because if :class:`!C`'s :meth:`!save` method is saving some internal state specific to :class:`!C`, not calling it will result in that state never getting saved.
sv: Uppslagsregeln för klassiska klasser är enkel men inte särskilt smart; basklasserna söks djupt först, från vänster till höger. En referens till :meth:`!D.save` kommer att söka i klasserna :class:`!D`, :class:`!B`, och sedan :class:`!A`, där :meth:`!save` skulle hittas och returneras. :meth:`!C.save` skulle aldrig hittas alls. Det här är dåligt, för om :class:`!C`:s :meth:`!save`-metod sparar något internt tillstånd som är specifikt för :class:`!C`, kommer det att resultera i att tillståndet aldrig sparas om den inte anropas.

source: New-style classes follow a different algorithm that's a bit more complicated to explain, but does the right thing in this situation. (Note that Python 2.3 changes this algorithm to one that produces the same results in most cases, but produces more useful results for really complicated inheritance graphs.)
sv: New-style klasser följer en annan algoritm som är lite mer komplicerad att förklara, men som gör rätt sak i den här situationen. (Observera att Python 2.3 ändrar denna algoritm till en som ger samma resultat i de flesta fall, men som ger mer användbara resultat för riktigt komplicerade arvsgrafer)

source: List all the base classes, following the classic lookup rule and include a class multiple times if it's visited repeatedly. In the above example, the list of visited classes is [:class:`!D`, :class:`!B`, :class:`!A`, :class:`!C`, :class:`!A`].
sv: Lista alla basklasser, enligt den klassiska lookup-regeln och inkludera en klass flera gånger om den besöks upprepade gånger. I exemplet ovan är listan över besökta klasser [:class:`!D`, :class:`!B`, :class:`!A`, :class:`!C`, :class:`!A`].

source: Scan the list for duplicated classes. If any are found, remove all but one occurrence, leaving the *last* one in the list. In the above example, the list becomes [:class:`!D`, :class:`!B`, :class:`!C`, :class:`!A`] after dropping duplicates.
sv: Sök igenom listan efter dubblerade klasser. Om några hittas, ta bort alla utom en förekomst och lämna den *sista* i listan. I exemplet ovan blir listan [:class:`!D`, :class:`!B`, :class:`!C`, :class:`!A`] efter att dubbletter har tagits bort.
