Repository: yeager/python-docs-sv
Catalog: whatsnew/2.2.po
Languages: sv

source: Following this rule, referring to :meth:`!D.save` will return :meth:`!C.save`, which is the behaviour we're after. This lookup rule is the same as the one followed by Common Lisp. A new built-in function, :func:`super`, provides a way to get at a class's superclasses without having to reimplement Python's algorithm. The most commonly used form will be ``super(class, obj)``, which returns a bound superclass object (not the actual class object). This form will be used in methods to call a method in the superclass; for example, :class:`!D`'s :meth:`!save` method would look like this::
sv: Enligt denna regel kommer en hänvisning till :meth:`!D.save` att returnera :meth:`!C.save`, vilket är det beteende vi är ute efter. Denna uppslagsregel är densamma som den som Common Lisp följer. En ny inbyggd funktion, :func:`super`, ger ett sätt att komma åt en klass superklasser utan att behöva omimplementera Pythons algoritm. Den vanligaste formen kommer att vara ``super(class, obj)``, som returnerar ett bundet superklassobjekt (inte det faktiska klassobjektet). Denna form kommer att användas i metoder för att anropa en metod i superklassen; till exempel skulle :class:`!D`:s :meth:`!save`-metod se ut så här::

source: class D (B,C): def save (self): # Call superclass .save() super(D, self).save() # Save D's private information here ...
sv: klass D (B,C): def save (self): # Anropa superklassen .save() super(D, self).save() # Spara D:s privata information här ...

source: :func:`super` can also return unbound superclass objects when called as ``super(class)`` or ``super(class1, class2)``, but this probably won't often be useful.
sv: :func:`super` kan också returnera obundna superklassobjekt när den anropas som ``super(class)`` eller ``super(class1, class2)``, men detta kommer förmodligen inte ofta att vara användbart.

source: Attribute Access
sv: Attributåtkomst

source: A fair number of sophisticated Python classes define hooks for attribute access using :meth:`~object.__getattr__`; most commonly this is done for convenience, to make code more readable by automatically mapping an attribute access such as ``obj.parent`` into a method call such as ``obj.get_parent``. Python 2.2 adds some new ways of controlling attribute access.
sv: Ett stort antal sofistikerade Python-klasser definierar krokar för attributåtkomst med :meth:`~object.__getattr__`; oftast görs detta för enkelhetens skull, för att göra koden mer läsbar genom att automatiskt mappa en attributåtkomst som ``obj.parent`` till ett metodanrop som ``obj.get_parent``. Python 2.2 lägger till några nya sätt att kontrollera attributåtkomst.

source: First, ``__getattr__(attr_name)`` is still supported by new-style classes, and nothing about it has changed. As before, it will be called when an attempt is made to access ``obj.foo`` and no attribute named ``foo`` is found in the instance's dictionary.
sv: För det första stöds ``__getattr__(attr_name)`` fortfarande av new-style klasser, och ingenting har ändrats. Precis som tidigare kommer den att anropas när ett försök görs att komma åt ``obj.foo`` och inget attribut med namnet ``foo`` hittas i instansens dictionary.

source: New-style classes also support a new method, ``__getattribute__(attr_name)``. The difference between the two methods is that :meth:`~object.__getattribute__` is *always* called whenever any attribute is accessed, while the old :meth:`~object.__getattr__` is only called if ``foo`` isn't found in the instance's dictionary.
sv: New-style klasser har också stöd för en ny metod, ``__getattribute__(attr_name)``. Skillnaden mellan de två metoderna är att :meth:`~object.__getattribute__` *alltid* anropas när något attribut används, medan den gamla :meth:`~object.__getattr__` bara anropas om ``foo`` inte finns i instansens dictionary.

source: However, Python 2.2's support for :dfn:`properties` will often be a simpler way to trap attribute references. Writing a :meth:`!__getattr__` method is complicated because to avoid recursion you can't use regular attribute accesses inside them, and instead have to mess around with the contents of :attr:`~object.__dict__`. :meth:`~object.__getattr__` methods also end up being called by Python when it checks for other methods such as :meth:`~object.__repr__` or :meth:`!__coerce__`, and so have to be written with this in mind. Finally, calling a function on every attribute access results in a sizable performance loss.
sv: Python 2.2:s stöd för :dfn:`properties` kommer dock ofta att vara ett enklare sätt att fånga attributreferenser. Att skriva en :meth:`!__getattr__`-metod är komplicerat eftersom man för att undvika rekursion inte kan använda vanliga attributåtkomster inuti dem, utan istället måste röra runt med innehållet i :attr:`~object.__dict__`. metoderna :meth:`~object.__getattr__` anropas också av Python när den söker efter andra metoder som :meth:`~object.__repr__` eller :meth:`!__coerce__`, och måste därför skrivas med detta i åtanke. Slutligen leder anrop av en funktion vid varje attributåtkomst till en avsevärd prestandaförlust.

source: :class:`property` is a new built-in type that packages up three functions that get, set, or delete an attribute, and a docstring. For example, if you want to define a :attr:`!size` attribute that's computed, but also settable, you could write::
sv: :class:`property` är en ny inbyggd typ som innehåller tre funktioner som hämtar, ställer in eller tar bort ett attribut samt en dokumentsträng. Om du till exempel vill definiera ett :attr:`!size`-attribut som är beräknat, men också inställbart, kan du skriva::

source: class C(object): def get_size (self): result = ... computation ... return result def set_size (self, size): ... compute something based on the size and set internal state appropriately ... # Define a property. The 'delete this attribute' # method is defined as None, so the attribute # can't be deleted. size = property(get_size, set_size, None, "Storage size of this instance")
sv: klass C(objekt): def get_size (self): result = ... beräkning ... returnerar resultat def set_size (self, storlek): ... beräkna något baserat på storleken och ställa in internt tillstånd på lämpligt sätt ... # Definiera en egenskap. Metoden "ta bort detta attribut # metoden är definierad som None, så attributet # kan inte tas bort. size = egenskap(get_size, set_size, None, "Lagringsstorlek för denna instans")

source: That is certainly clearer and easier to write than a pair of :meth:`!__getattr__`/:meth:`!__setattr__` methods that check for the :attr:`!size` attribute and handle it specially while retrieving all other attributes from the instance's :attr:`~object.__dict__`. Accesses to :attr:`!size` are also the only ones which have to perform the work of calling a function, so references to other attributes run at their usual speed.
sv: Det är i alla fall tydligare och enklare att skriva än ett par :meth:`!__getattr__`/:meth:`!__setattr__`-metoder som söker efter attributet :attr:`!size` och hanterar det speciellt medan de hämtar alla andra attribut från instansens :attr:`~object.__dict__`. Åtkomster till :attr:`!size` är också de enda som måste utföra arbetet med att anropa en funktion, så referenser till andra attribut körs med sin vanliga hastighet.

source: Finally, it's possible to constrain the list of attributes that can be referenced on an object using the new :attr:`~object.__slots__` class attribute. Python objects are usually very dynamic; at any time it's possible to define a new attribute on an instance by just doing ``obj.new_attr=1``. A new-style class can define a class attribute named :attr:`~object.__slots__` to limit the legal attributes to a particular set of names. An example will make this clear::
sv: Slutligen är det möjligt att begränsa listan över attribut som kan refereras till på ett objekt med hjälp av det nya klassattributet :attr:`~object.__slots__`. Python-objekt är vanligtvis mycket dynamiska; när som helst är det möjligt att definiera ett nytt attribut på en instans genom att bara göra ``obj.new_attr=1``. En klass med ny stil kan definiera ett klassattribut med namnet :attr:`~object.__slots__` för att begränsa de lagliga attributen till en viss uppsättning namn. Ett exempel kommer att göra detta tydligt::

source: >>> class C(object): ... __slots__ = ('template', 'name') ... >>> obj = C() >>> print obj.template None >>> obj.template = 'Test' >>> print obj.template Test >>> obj.newattr = None Traceback (most recent call last): File "<stdin>", line 1, in ? AttributeError: 'C' object has no attribute 'newattr'
sv: &gt;&gt;&gt; klass C(objekt): ... __slots__ = ('mall', 'namn') ... &gt;&gt;&gt; obj = C() &gt;&gt;&gt; print obj.template Ingen &gt;&gt;&gt; obj.template = 'Test' &gt;&gt;&gt; Skriv ut obj.mall Test &gt;&gt;&gt; obj.newattr = Ingen Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i ? AttributeError: 'C'-objektet har inget attribut 'newattr'

source: Note how you get an :exc:`AttributeError` on the attempt to assign to an attribute not listed in :attr:`~object.__slots__`.
sv: Observera att du får ett :exc:`AttributeError` när du försöker tilldela ett attribut som inte finns med i :attr:`~object.__slots__`.

source: Related Links
sv: Relaterade länkar

source: This section has just been a quick overview of the new features, giving enough of an explanation to start you programming, but many details have been simplified or ignored. Where should you go to get a more complete picture?
sv: Det här avsnittet har bara varit en snabb översikt över de nya funktionerna och ger en tillräcklig förklaring för att du ska kunna börja programmera, men många detaljer har förenklats eller ignorerats. Vart ska man gå för att få en mer fullständig bild?

source: The :ref:`descriptorhowto` is a lengthy tutorial introduction to the descriptor features, written by Guido van Rossum. If my description has whetted your appetite, go read this tutorial next, because it goes into much more detail about the new features while still remaining quite easy to read.
sv: :ref:`descriptorhowto` är en lång introduktion till descriptor-funktionerna, skriven av Guido van Rossum. Om min beskrivning har väckt din aptit, läs den här handledningen härnäst, eftersom den går in mycket mer i detalj om de nya funktionerna samtidigt som den fortfarande är ganska lättläst.

source: Next, there are two relevant PEPs, :pep:`252` and :pep:`253`. :pep:`252` is titled "Making Types Look More Like Classes", and covers the descriptor API. :pep:`253` is titled "Subtyping Built-in Types", and describes the changes to type objects that make it possible to subtype built-in objects. :pep:`253` is the more complicated PEP of the two, and at a few points the necessary explanations of types and meta-types may cause your head to explode. Both PEPs were written and implemented by Guido van Rossum, with substantial assistance from the rest of the Zope Corp. team.
sv: Därefter finns det två relevanta PEP:er, :pep:`252` och :pep:`253`. :pep:`252` har titeln "Making Types Look More Like Classes" och behandlar descriptor API. :pep:`253` har titeln "Subtyping Built-in Types" och beskriver de ändringar av typobjekt som gör det möjligt att subtypa inbyggda objekt. :pep:`253` är den mest komplicerade PEP:en av de två, och på några ställen kan de nödvändiga förklaringarna av typer och metatyper få ditt huvud att explodera. Båda PEP:erna skrevs och implementerades av Guido van Rossum, med betydande hjälp från resten av Zope Corp.-teamet.

source: Finally, there's the ultimate authority: the source code. Most of the machinery for the type handling is in :file:`Objects/typeobject.c`, but you should only resort to it after all other avenues have been exhausted, including posting a question to python-list or python-dev.
sv: Slutligen har vi den ultimata auktoriteten: källkoden. Det mesta av maskineriet för typhanteringen finns i :file:`Objects/typeobject.c`, men du bör bara använda det efter att alla andra vägar har uttömts, inklusive att skicka en fråga till python-list eller python-dev.

source: PEP 234: Iterators
sv: PEP 234: Iteratorer

source: Another significant addition to 2.2 is an iteration interface at both the C and Python levels. Objects can define how they can be looped over by callers.
sv: Ett annat viktigt tillägg till 2.2 är ett iterationsgränssnitt på både C- och Python-nivå. Objekt kan definiera hur de kan loopas över av anropare.

source: In Python versions up to 2.1, the usual way to make ``for item in obj`` work is to define a :meth:`~object.__getitem__` method that looks something like this::
sv: I Python-versioner upp till 2.1 är det vanliga sättet att få ``for item in obj`` att fungera att definiera en :meth:`~object.__getitem__`-metod som ser ut ungefär så här::

source: :meth:`~object.__getitem__` is more properly used to define an indexing operation on an object so that you can write ``obj[5]`` to retrieve the sixth element. It's a bit misleading when you're using this only to support :keyword:`for` loops. Consider some file-like object that wants to be looped over; the *index* parameter is essentially meaningless, as the class probably assumes that a series of :meth:`~object.__getitem__` calls will be made with *index* incrementing by one each time. In other words, the presence of the :meth:`~object.__getitem__` method doesn't mean that using ``file[5]`` to randomly access the sixth element will work, though it really should.
sv: :meth:`~object.__getitem__` används mer korrekt för att definiera en indexeringsoperation på ett objekt så att du kan skriva ``obj[5]`` för att hämta det sjätte elementet. Det är lite missvisande när du bara använder detta för att stödja :keyword:`for`-loopar. Tänk på något filliknande objekt som vill loopas över; parametern *index* är i princip meningslös, eftersom klassen förmodligen antar att en serie :meth:`~object.__getitem__`-anrop kommer att göras med *index* som ökar med ett varje gång. Med andra ord betyder inte förekomsten av metoden :meth:`~object.__getitem__` att det fungerar att använda ``file[5]`` för att slumpmässigt komma åt det sjätte elementet, även om det verkligen borde göra det.

source: In Python 2.2, iteration can be implemented separately, and :meth:`~object.__getitem__` methods can be limited to classes that really do support random access. The basic idea of iterators is simple. A new built-in function, ``iter(obj)`` or ``iter(C, sentinel)``, is used to get an iterator. ``iter(obj)`` returns an iterator for the object *obj*, while ``iter(C, sentinel)`` returns an iterator that will invoke the callable object *C* until it returns *sentinel* to signal that the iterator is done.
sv: I Python 2.2 kan iteration implementeras separat och :meth:`~object.__getitem__`-metoder kan begränsas till klasser som verkligen stöder slumpmässig åtkomst. Grundidén med iteratorer är enkel. En ny inbyggd funktion, ``iter(obj)`` eller ``iter(C, sentinel)``, används för att hämta en iterator. ``iter(obj)`` returnerar en iterator för objektet *obj*, medan ``iter(C, sentinel)`` returnerar en iterator som kommer att anropa det anropbara objektet *C* tills det returnerar *sentinel* för att signalera att iteratorn är klar.

source: Python classes can define an :meth:`!__iter__` method, which should create and return a new iterator for the object; if the object is its own iterator, this method can just return ``self``. In particular, iterators will usually be their own iterators. Extension types implemented in C can implement a :c:member:`~PyTypeObject.tp_iter` function in order to return an iterator, and extension types that want to behave as iterators can define a :c:member:`~PyTypeObject.tp_iternext` function.
sv: Python-klasser kan definiera en :meth:`!__iter__`-metod, som ska skapa och returnera en ny iterator för objektet; om objektet är sin egen iterator kan denna metod bara returnera ``self``. I synnerhet iteratorer kommer vanligtvis att vara sina egna iteratorer. Tilläggstyper implementerade i C kan implementera en :c:member:`~PyTypeObject.tp_iter`-funktion för att returnera en iterator, och tilläggstyper som vill bete sig som iteratorer kan definiera en :c:member:`~PyTypeObject.tp_iternext`-funktion.

source: So, after all this, what do iterators actually do? They have one required method, :meth:`next`, which takes no arguments and returns the next value. When there are no more values to be returned, calling :meth:`next` should raise the :exc:`StopIteration` exception. ::
sv: Så, efter allt detta, vad gör iteratorer egentligen? De har en obligatorisk metod, :meth:`next`, som inte tar några argument och returnerar nästa värde. När det inte finns fler värden att returnera bör anrop av :meth:`next` ge upphov till undantaget :exc:`StopIteration`. ::

source: >>> L = [1,2,3] >>> i = iter(L) >>> print i <iterator object at 0x8116870> >>> i.next() 1 >>> i.next() 2 >>> i.next() 3 >>> i.next() Traceback (most recent call last): File "<stdin>", line 1, in ? StopIteration >>>
sv: &gt;&gt;&gt; L = [1,2,3] &gt;&gt;&gt; i = iter(L) &gt;&gt;&gt; skriv ut i <iterator object at 0x8116870> &gt;&gt;&gt; i.nästa() 1 &gt;&gt;&gt; i.nästa() 2 &gt;&gt;&gt; i.nästa() 3 &gt;&gt;&gt; i.nästa() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i ? Stoppa iteration &gt;&gt;&gt

source: In 2.2, Python's :keyword:`for` statement no longer expects a sequence; it expects something for which :func:`iter` will return an iterator. For backward compatibility and convenience, an iterator is automatically constructed for sequences that don't implement :meth:`!__iter__` or a :c:member:`~PyTypeObject.tp_iter` slot, so ``for i in [1,2,3]`` will still work. Wherever the Python interpreter loops over a sequence, it's been changed to use the iterator protocol. This means you can do things like this::
sv: I 2.2 förväntar sig Pythons :keyword:`for`-sats inte längre en sekvens; den förväntar sig något som :func:`iter` returnerar en iterator för. För bakåtkompatibilitet och bekvämlighet konstrueras en iterator automatiskt för sekvenser som inte implementerar :meth:`!__iter__` eller en :c:member:`~PyTypeObject.tp_iter` slot, så ``for i in [1,2,3]`` kommer fortfarande att fungera. Varhelst Python-tolken loopar över en sekvens har den ändrats för att använda iteratorprotokollet. Detta innebär att du kan göra saker som detta::

source: Iterator support has been added to some of Python's basic types. Calling :func:`iter` on a dictionary will return an iterator which loops over its keys::
sv: Iteratorstöd har lagts till i några av Pythons grundläggande typer. Om man anropar :func:`iter` på en ordbok returneras en iterator som loopar över dess nycklar::

source: >>> m = {'Jan': 1, 'Feb': 2, 'Mar': 3, 'Apr': 4, 'May': 5, 'Jun': 6, ... 'Jul': 7, 'Aug': 8, 'Sep': 9, 'Oct': 10, 'Nov': 11, 'Dec': 12} >>> for key in m: print key, m[key] ... Mar 3 Feb 2 Aug 8 Sep 9 May 5 Jun 6 Jul 7 Jan 1 Apr 4 Nov 11 Dec 12 Oct 10
sv: >>> m = {'Jan': 1, 'Feb': 2, 'Mar': 3, 'Apr': 4, 'May': 5, 'Jun': 6, ... "Jul": 7, "Aug": 8, "Sep": 9, 'okt': 10, 'nov': 11, 'Dec': 12} >>> for key in m: print key, m[key] ... 3 mars 2 februari 8 augusti 9 september 5 maj 6 juni 7 juli 1 jan 4 april 11 november 12 dec 10 oktober

source: That's just the default behaviour. If you want to iterate over keys, values, or key/value pairs, you can explicitly call the :meth:`!iterkeys`, :meth:`!itervalues`, or :meth:`!iteritems` methods to get an appropriate iterator. In a minor related change, the :keyword:`in` operator now works on dictionaries, so ``key in dict`` is now equivalent to ``dict.has_key(key)``.
sv: Det är bara standardbeteendet. Om du vill iterera över nycklar, värden eller nyckel/värde-par kan du uttryckligen anropa metoderna :meth:`!iterkeys`, :meth:`!itervalues` eller :meth:`!iteritems` för att få en lämplig iterator. I en mindre relaterad ändring fungerar operatorn :keyword:`in` nu på lexikon, så ``key in dict`` är nu ekvivalent med ``dict.has_key(key)``.

source: Files also provide an iterator, which calls the :meth:`readline` method until there are no more lines in the file. This means you can now read each line of a file using code like this::
sv: Filer innehåller också en iterator som anropar metoden :meth:`readline` tills det inte finns några fler rader i filen. Detta innebär att du nu kan läsa varje rad i en fil med kod som denna::

source: for line in file: # do something for each line ...
sv: för rad i filen: # gör något för varje rad ...

source: Note that you can only go forward in an iterator; there's no way to get the previous element, reset the iterator, or make a copy of it. An iterator object could provide such additional capabilities, but the iterator protocol only requires a :meth:`next` method.
sv: Observera att du bara kan gå framåt i en iterator; det finns inget sätt att hämta föregående element, återställa iteratorn eller göra en kopia av den. Ett iteratorobjekt kan ge sådana ytterligare möjligheter, men iteratorprotokollet kräver bara en :meth:`next`-metod.

source: :pep:`234` - Iterators
sv: :pep:`234` - Iteratorer

source: Written by Ka-Ping Yee and GvR; implemented by the Python Labs crew, mostly by GvR and Tim Peters.
sv: Skriven av Ka-Ping Yee och GvR; implementerad av Python Labs, främst av GvR och Tim Peters.

source: PEP 255: Simple Generators
sv: PEP 255: Enkla generatorer

source: Generators are another new feature, one that interacts with the introduction of iterators.
sv: Generatorer är en annan ny funktion, som samverkar med införandet av iteratorer.

source: You're doubtless familiar with how function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a :keyword:`return` statement, the local variables are destroyed and the resulting value is returned to the caller. A later call to the same function will get a fresh new set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
sv: Du är säkert bekant med hur funktionsanrop fungerar i Python eller C. När du anropar en funktion får den ett privat namnområde där dess lokala variabler skapas. När funktionen når en :keyword:`return`-sats förstörs de lokala variablerna och det resulterande värdet returneras till anroparen. Ett senare anrop till samma funktion kommer att få en ny uppsättning lokala variabler. Men tänk om de lokala variablerna inte kastades bort när en funktion avslutades? Tänk om du senare kunde återuppta funktionen där den slutade? Detta är vad generatorer tillhandahåller; de kan betraktas som återupptagbara funktioner.

source: Here's the simplest example of a generator function::
sv: Här är det enklaste exemplet på en generatorfunktion::

source: def generate_ints(N): for i in range(N): yield i
sv: def generera_ints(N): för i i intervall(N): avkastning i
