Repository: yeager/python-docs-sv
Catalog: whatsnew/2.2.po
Languages: sv

source: A new keyword, :keyword:`yield`, was introduced for generators. Any function containing a :keyword:`!yield` statement is a generator function; this is detected by Python's bytecode compiler which compiles the function specially as a result. Because a new keyword was introduced, generators must be explicitly enabled in a module by including a ``from __future__ import generators`` statement near the top of the module's source code. In Python 2.3 this statement will become unnecessary.
sv: Ett nytt nyckelord, :keyword:`yield`, introducerades för generatorer. Varje funktion som innehåller en :keyword:`!yield`-sats är en generatorfunktion; detta upptäcks av Pythons bytekodskompilator som kompilerar funktionen speciellt som ett resultat. Eftersom ett nytt nyckelord introducerades måste generatorer uttryckligen aktiveras i en modul genom att inkludera ett ``from __future__ import generators``-sats nära toppen av modulens källkod. I Python 2.3 kommer detta uttalande att bli onödigt.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the :keyword:`yield` statement, the generator outputs the value of ``i``, similar to a :keyword:`return` statement. The big difference between :keyword:`!yield` and a :keyword:`!return` statement is that on reaching a :keyword:`!yield` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's ``next()`` method, the function will resume executing immediately after the :keyword:`!yield` statement. (For complicated reasons, the :keyword:`!yield` statement isn't allowed inside the :keyword:`!try` block of a :keyword:`try`...\ :keyword:`finally` statement; read :pep:`255` for a full explanation of the interaction between :keyword:`!yield` and exceptions.)
sv: När du anropar en generatorfunktion returnerar den inte ett enda värde, utan istället ett generatorobjekt som stöder iteratorprotokollet. Vid exekvering av :keyword:`yield`-satsen matar generatorn ut värdet på ``i``, på samma sätt som en :keyword:`return`-sats. Den stora skillnaden mellan :keyword:`!yield` och en :keyword:`!return`-sats är att när man når en :keyword:`!yield` avbryts generatorns exekveringstillstånd och lokala variabler bevaras. Vid nästa anrop till generatorns ``next()``-metod kommer funktionen att återuppta exekveringen omedelbart efter :keyword:`!yield`-satsen. (Av komplicerade skäl är :keyword:`!yield`-satsen inte tillåten inuti :keyword:`!try`-blocket i en :keyword:`try`...\ :keyword:`finally`-sats; läs :pep:`255` för en fullständig förklaring av interaktionen mellan :keyword:`!yield` och undantag)

source: Here's a sample usage of the :func:`!generate_ints` generator::
sv: Här är ett exempel på användning av generatorn :func:`!generate_ints`::

source: >>> gen = generate_ints(3) >>> gen <generator object at 0x8117f90> >>> gen.next() 0 >>> gen.next() 1 >>> gen.next() 2 >>> gen.next() Traceback (most recent call last): File "<stdin>", line 1, in ? File "<stdin>", line 2, in generate_ints StopIteration
sv: &gt;&gt;&gt; gen = generera_ints(3) &gt;&gt;&gt; gen <generator object at 0x8117f90> &gt;&gt;&gt; gen.nästa() 0 &gt;&gt;&gt; gen.nästa() 1 &gt;&gt;&gt; gen.nästa() 2 &gt;&gt;&gt; gen.nästa() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i ? Fil "<stdin>", rad 2, i generate_ints Stoppa iteration

source: You could equally write ``for i in generate_ints(5)``, or ``a,b,c = generate_ints(3)``.
sv: Du kan lika gärna skriva ``for i in generate_ints(5)``, eller ``a,b,c = generate_ints(3)``.

source: Inside a generator function, the :keyword:`return` statement can only be used without a value, and signals the end of the procession of values; afterwards the generator cannot return any further values. :keyword:`!return` with a value, such as ``return 5``, is a syntax error inside a generator function. The end of the generator's results can also be indicated by raising :exc:`StopIteration` manually, or by just letting the flow of execution fall off the bottom of the function.
sv: I en generatorfunktion kan :keyword:`return` bara användas utan ett värde och signalerar slutet på värdeförloppet; därefter kan generatorn inte returnera några ytterligare värden. :keyword:`!return` med ett värde, t.ex. ``return 5``, är ett syntaxfel i en generatorfunktion. Slutet på generatorns resultat kan också indikeras genom att höja :exc:`StopIteration` manuellt, eller genom att bara låta flödet av exekveringen falla från botten av funktionen.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`next` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class would be much messier. :file:`Lib/test/test_generators.py` contains a number of more interesting examples. The simplest one implements an in-order traversal of a tree using generators recursively. ::
sv: Du kan uppnå effekten av generatorer manuellt genom att skriva din egen klass och lagra alla lokala variabler i generatorn som instansvariabler. Att returnera en lista med heltal kan till exempel göras genom att sätta ``self.count`` till 0 och låta :meth:`next`-metoden öka ``self.count`` och returnera den. Men för en måttligt komplicerad generator skulle det vara mycket krångligare att skriva en motsvarande klass. :file:`Lib/test/test_generators.py` innehåller ett antal mer intressanta exempel. Det enklaste implementerar en genomgång av ett träd i ordningsföljd med hjälp av generatorer rekursivt. ::

source: # A recursive generator that generates Tree leaves in in-order. def inorder(t): if t: for x in inorder(t.left): yield x yield t.label for x in inorder(t.right): yield x
sv: # En rekursiv generator som genererar trädblad i ordning. def inorder(t): if t: för x i inorder(t.left): avkastning x yield t.etikett för x i inorder(t.right): ge x

source: Two other examples in :file:`Lib/test/test_generators.py` produce solutions for the N-Queens problem (placing $N$ queens on an $NxN$ chess board so that no queen threatens another) and the Knight's Tour (a route that takes a knight to every square of an $NxN$ chessboard without visiting any square twice).
sv: Två andra exempel i :file:`Lib/test/test_generators.py` producerar lösningar för N-Queens-problemet (placera $N$ drottningar på ett $NxN$ schackbräde så att ingen drottning hotar en annan) och Knight's Tour (en rutt som tar en springare till varje ruta på ett $NxN$ schackbräde utan att besöka någon ruta två gånger).

source: The idea of generators comes from other programming languages, especially Icon (https://www2.cs.arizona.edu/icon/), where the idea of generators is central. In Icon, every expression and function call behaves like a generator. One example from "An Overview of the Icon Programming Language" at https://www2.cs.arizona.edu/icon/docs/ipd266.htm gives an idea of what this looks like::
sv: Idén med generatorer kommer från andra programmeringsspråk, särskilt Icon (https://www2.cs.arizona.edu/icon/), där idén med generatorer är central. I Icon beter sig varje uttryck och funktionsanrop som en generator. Ett exempel från "An Overview of the Icon Programming Language" på https://www2.cs.arizona.edu/icon/docs/ipd266.htm ger en uppfattning om hur detta ser ut::

source: sentence := "Store it in the neighboring harbor" if (i := find("or", sentence)) > 5 then write(i)
sv: mening := "Förvara den i den närliggande hamnen" if (i := find("eller", mening)) > 5 då skriv(i)

source: In Icon the :func:`!find` function returns the indexes at which the substring "or" is found: 3, 23, 33. In the :keyword:`if` statement, ``i`` is first assigned a value of 3, but 3 is less than 5, so the comparison fails, and Icon retries it with the second value of 23. 23 is greater than 5, so the comparison now succeeds, and the code prints the value 23 to the screen.
sv: I Icon returnerar funktionen :func:`!find` de index där delsträngen "or" hittas: 3, 23, 33. I :keyword:`if`-satsen tilldelas ``i`` först värdet 3, men 3 är mindre än 5, så jämförelsen misslyckas, och Icon gör ett nytt försök med det andra värdet 23. 23 är större än 5, så jämförelsen lyckas nu, och koden skriver ut värdet 23 på skärmen.

source: Python doesn't go nearly as far as Icon in adopting generators as a central concept. Generators are considered a new part of the core Python language, but learning or using them isn't compulsory; if they don't solve any problems that you have, feel free to ignore them. One novel feature of Python's interface as compared to Icon's is that a generator's state is represented as a concrete object (the iterator) that can be passed around to other functions or stored in a data structure.
sv: Python går inte alls lika långt som Icon när det gäller att anta generatorer som ett centralt koncept. Generatorer betraktas som en ny del av Pythons kärnspråk, men det är inte obligatoriskt att lära sig eller använda dem; om de inte löser några problem som du har, kan du gärna ignorera dem. En nyhet i Pythons gränssnitt jämfört med Icons är att en generators tillstånd representeras som ett konkret objekt (iteratorn) som kan skickas runt till andra funktioner eller lagras i en datastruktur.

source: :pep:`255` - Simple Generators
sv: :pep:`255` - Enkla generatorer

source: Written by Neil Schemenauer, Tim Peters, Magnus Lie Hetland. Implemented mostly by Neil Schemenauer and Tim Peters, with other fixes from the Python Labs crew.
sv: Skriven av Neil Schemenauer, Tim Peters, Magnus Lie Hetland. Implementerad mestadels av Neil Schemenauer och Tim Peters, med andra korrigeringar från Python Labs-gänget.

source: PEP 237: Unifying Long Integers and Integers
sv: PEP 237: Förenande av långa heltal och heltal

source: In recent versions, the distinction between regular integers, which are 32-bit values on most machines, and long integers, which can be of arbitrary size, was becoming an annoyance. For example, on platforms that support files larger than ``2**32`` bytes, the :meth:`!tell` method of file objects has to return a long integer. However, there were various bits of Python that expected plain integers and would raise an error if a long integer was provided instead. For example, in Python 1.5, only regular integers could be used as a slice index, and ``'abc'[1L:]`` would raise a :exc:`TypeError` exception with the message 'slice index must be int'.
sv: I de senaste versionerna har skillnaden mellan vanliga heltal, som är 32-bitarsvärden på de flesta maskiner, och långa heltal, som kan vara av godtycklig storlek, blivit ett irritationsmoment. På plattformar som stöder filer som är större än ``2**32`` bytes måste till exempel :meth:`!tell`-metoden för filobjekt returnera ett långt heltal. Det fanns dock olika delar av Python som förväntade sig vanliga heltal och skulle ge upphov till ett fel om ett långt heltal tillhandahölls istället. Till exempel i Python 1.5 kunde endast vanliga heltal användas som ett skivindex, och ``'abc'[1L:]`` skulle ge upphov till ett :exc:`TypeError`-undantag med meddelandet "skivindex måste vara int".

source: Python 2.2 will shift values from short to long integers as required. The 'L' suffix is no longer needed to indicate a long integer literal, as now the compiler will choose the appropriate type. (Using the 'L' suffix will be discouraged in future 2.x versions of Python, triggering a warning in Python 2.4, and probably dropped in Python 3.0.) Many operations that used to raise an :exc:`OverflowError` will now return a long integer as their result. For example::
sv: Python 2.2 kommer att skifta värden från korta till långa heltal vid behov. Suffixet "L" behövs inte längre för att ange en lång heltalslitteral, eftersom kompilatorn nu väljer lämplig typ. (Att använda suffixet 'L' kommer att avrådas i framtida 2.x versioner av Python, utlösa en varning i Python 2.4 och troligen tas bort i Python 3.0.) Många operationer som tidigare gav upphov till ett :exc:`OverflowError` kommer nu att returnera ett långt heltal som resultat. Till exempel::

source: In most cases, integers and long integers will now be treated identically. You can still distinguish them with the :func:`type` built-in function, but that's rarely needed.
sv: I de flesta fall kommer heltal och långa heltal nu att behandlas identiskt. Du kan fortfarande skilja dem åt med den inbyggda funktionen :func:`type`, men det behövs sällan.

source: :pep:`237` - Unifying Long Integers and Integers
sv: :pep:`237` - Unifiera långa heltal och heltal

source: Written by Moshe Zadka and Guido van Rossum. Implemented mostly by Guido van Rossum.
sv: Skriven av Moshe Zadka och Guido van Rossum. Implementerad mestadels av Guido van Rossum.

source: PEP 238: Changing the Division Operator
sv: PEP 238: Byte av divisionsoperator

source: The most controversial change in Python 2.2 heralds the start of an effort to fix an old design flaw that's been in Python from the beginning. Currently Python's division operator, ``/``, behaves like C's division operator when presented with two integer arguments: it returns an integer result that's truncated down when there would be a fractional part. For example, ``3/2`` is 1, not 1.5, and ``(-1)/2`` is -1, not -0.5. This means that the results of division can vary unexpectedly depending on the type of the two operands and because Python is dynamically typed, it can be difficult to determine the possible types of the operands.
sv: Den mest kontroversiella förändringen i Python 2.2 är början på ett försök att åtgärda ett gammalt designfel som har funnits i Python från början. För närvarande beter sig Pythons divisionsoperator, ``/``, som C: s divisionsoperator när den presenteras med två heltalsargument: den returnerar ett heltalsresultat som trunkeras ner när det skulle finnas en bråkdel. Till exempel är ``3/2`` 1, inte 1,5, och ``(-1)/2`` är -1, inte -0,5. Detta innebär att resultatet av division kan variera oväntat beroende på typen av de två operanderna och eftersom Python är dynamiskt typat kan det vara svårt att avgöra de möjliga typerna av operanderna.

source: (The controversy is over whether this is *really* a design flaw, and whether it's worth breaking existing code to fix this. It's caused endless discussions on python-dev, and in July 2001 erupted into a storm of acidly sarcastic postings on :newsgroup:`comp.lang.python`. I won't argue for either side here and will stick to describing what's implemented in 2.2. Read :pep:`238` for a summary of arguments and counter-arguments.)
sv: (Kontroversen handlar om huruvida detta *verkligen* är ett designfel och om det är värt att bryta befintlig kod för att åtgärda det. Det har orsakat oändliga diskussioner på python-dev, och i juli 2001 utbröt en storm av syrligt sarkastiska inlägg på :newsgroup:`comp.lang.python`. Jag kommer inte att argumentera för någon av sidorna här utan hålla mig till att beskriva vad som implementerats i 2.2. Läs :pep:`238` för en sammanfattning av argument och motargument)

source: Because this change might break code, it's being introduced very gradually. Python 2.2 begins the transition, but the switch won't be complete until Python 3.0.
sv: Eftersom den här förändringen kan bryta kod införs den mycket gradvis. Python 2.2 påbörjar övergången, men bytet kommer inte att vara fullständigt förrän Python 3.0.

source: First, I'll borrow some terminology from :pep:`238`. "True division" is the division that most non-programmers are familiar with: 3/2 is 1.5, 1/4 is 0.25, and so forth. "Floor division" is what Python's ``/`` operator currently does when given integer operands; the result is the floor of the value returned by true division. "Classic division" is the current mixed behaviour of ``/``; it returns the result of floor division when the operands are integers, and returns the result of true division when one of the operands is a floating-point number.
sv: Först ska jag låna lite terminologi från :pep:`238`. "Sann division" är den division som de flesta icke-programmerare är bekanta med: 3/2 är 1,5, 1/4 är 0,25, och så vidare. "Golvdivision" är vad Pythons ``/``-operator för närvarande gör när den ges heltalsoperander; resultatet är golvet i det värde som returneras av sann division. "Klassisk division" är det nuvarande blandade beteendet hos ``/``; den returnerar resultatet av golvdivision när operanderna är heltal, och returnerar resultatet av sann division när en av operanderna är ett flyttal.

source: Here are the changes 2.2 introduces:
sv: Här är de förändringar som 2.2 introducerar:

source: A new operator, ``//``, is the floor division operator. (Yes, we know it looks like C++'s comment symbol.) ``//`` *always* performs floor division no matter what the types of its operands are, so ``1 // 2`` is 0 and ``1.0 // 2.0`` is also 0.0.
sv: En ny operator, ``//``, är operatorn för våningsdivision. (Ja, vi vet att den ser ut som C++:s kommentarssymbol.) ``//`` utför *alltid* golvdivision oavsett vilken typ operanden har, så ``1 // 2`` är 0 och ``1.0 // 2.0`` är också 0.0.

source: ``//`` is always available in Python 2.2; you don't need to enable it using a ``__future__`` statement.
sv: ``//`` är alltid tillgängligt i Python 2.2; du behöver inte aktivera det med hjälp av ett ``__future__``-sats.

source: By including a ``from __future__ import division`` in a module, the ``/`` operator will be changed to return the result of true division, so ``1/2`` is 0.5. Without the ``__future__`` statement, ``/`` still means classic division. The default meaning of ``/`` will not change until Python 3.0.
sv: Genom att inkludera en ``from __future__ import division`` i en modul kommer operatorn ``/`` att ändras så att den returnerar resultatet av sann division, så ``1/2`` är 0,5. Utan ``__future__``-satsen betyder ``/`` fortfarande klassisk division. Standardbetydelsen av ``/`` kommer inte att ändras förrän i Python 3.0.

source: Classes can define methods called :meth:`~object.__truediv__` and :meth:`~object.__floordiv__` to overload the two division operators. At the C level, there are also slots in the :c:type:`PyNumberMethods` structure so extension types can define the two operators.
sv: Klasser kan definiera metoder som kallas :meth:`~object.__truediv__` och :meth:`~object.__floordiv__` för att överbelasta de två divisionsoperatorerna. På C-nivå finns det också platser i strukturen :c:type:`PyNumberMethods` så att tilläggstyper kan definiera de två operatorerna.

source: Python 2.2 supports some command-line arguments for testing whether code will work with the changed division semantics. Running python with :option:`!-Q warn` will cause a warning to be issued whenever division is applied to two integers. You can use this to find code that's affected by the change and fix it. By default, Python 2.2 will simply perform classic division without a warning; the warning will be turned on by default in Python 2.3.
sv: Python 2.2 stöder några kommandoradsargument för att testa om koden kommer att fungera med den ändrade divisionssemantiken. Om du kör python med :option:`!-Q warn` kommer en varning att utfärdas när division tillämpas på två heltal. Du kan använda detta för att hitta kod som påverkas av ändringen och fixa den. Som standard kommer Python 2.2 helt enkelt att utföra klassisk division utan varning; varningen kommer att aktiveras som standard i Python 2.3.

source: :pep:`238` - Changing the Division Operator
sv: :pep:`238` - Byte av divisionsoperator

source: Written by Moshe Zadka and Guido van Rossum. Implemented by Guido van Rossum..
sv: Skriven av Moshe Zadka och Guido van Rossum. Implementerad av Guido van Rossum...

source: Unicode Changes
sv: Unicode-ändringar

source: Python's Unicode support has been enhanced a bit in 2.2. Unicode strings are usually stored as UCS-2, as 16-bit unsigned integers. Python 2.2 can also be compiled to use UCS-4, 32-bit unsigned integers, as its internal encoding by supplying :option:`!--enable-unicode=ucs4` to the configure script. (It's also possible to specify :option:`!--disable-unicode` to completely disable Unicode support.)
sv: Pythons Unicode-stöd har förbättrats en del i 2.2. Unicode-strängar lagras vanligtvis som UCS-2, som 16-bitars osignerade heltal. Python 2.2 kan också kompileras för att använda UCS-4, 32-bitars osignerade heltal, som sin interna kodning genom att ange :option:`!--enable-unicode=ucs4` till configure-skriptet. (Det är också möjligt att ange :option:`!--disable-unicode` för att helt inaktivera Unicode-stöd)

source: When built to use UCS-4 (a "wide Python"), the interpreter can natively handle Unicode characters from U+000000 to U+110000, so the range of legal values for the :func:`!unichr` function is expanded accordingly. Using an interpreter compiled to use UCS-2 (a "narrow Python"), values greater than 65535 will still cause :func:`!unichr` to raise a :exc:`ValueError` exception. This is all described in :pep:`261`, "Support for 'wide' Unicode characters"; consult it for further details.
sv: När tolken är byggd för att använda UCS-4 (ett "brett Python") kan den naturligt hantera Unicode-tecken från U+000000 till U+110000, så intervallet av lagliga värden för funktionen :func:`!unichr` utökas i enlighet med detta. Om du använder en tolk som är kompilerad för att använda UCS-2 (ett "smalt Python"), kommer värden större än 65535 fortfarande att orsaka att :func:`!unichr` ger upphov till ett :exc:`ValueError` undantag. Allt detta beskrivs i :pep:`261`, "Support for 'wide' Unicode characters"; se den för ytterligare detaljer.

source: Another change is simpler to explain. Since their introduction, Unicode strings have supported an :meth:`!encode` method to convert the string to a selected encoding such as UTF-8 or Latin-1. A symmetric ``decode([*encoding*])`` method has been added to 8-bit strings (though not to Unicode strings) in 2.2. :meth:`!decode` assumes that the string is in the specified encoding and decodes it, returning whatever is returned by the codec.
sv: En annan förändring är enklare att förklara. Unicode-strängar har sedan de introducerades haft stöd för en :meth:`!encode`-metod för att konvertera strängen till en vald kodning som UTF-8 eller Latin-1. En symmetrisk metod ``decode([*encoding*])`` har lagts till för 8-bitars strängar (dock inte för Unicode-strängar) i 2.2. :meth:`!decode` antar att strängen är i den angivna kodningen och avkodar den och returnerar vad som returneras av codec.

source: Using this new feature, codecs have been added for tasks not directly related to Unicode. For example, codecs have been added for uu-encoding, MIME's base64 encoding, and compression with the :mod:`zlib` module::
sv: Med hjälp av denna nya funktion har codecs lagts till för uppgifter som inte är direkt relaterade till Unicode. Exempelvis har codecs lagts till för uu-kodning, MIME:s base64-kodning och komprimering med modulen :mod:`zlib`::
