Repository: yeager/python-docs-sv
Catalog: whatsnew/2.2.po
Languages: sv

source: Profiling and tracing functions can now be implemented in C, which can operate at much higher speeds than Python-based functions and should reduce the overhead of profiling and tracing. This will be of interest to authors of development environments for Python. Two new C functions were added to Python's API, :c:func:`PyEval_SetProfile` and :c:func:`PyEval_SetTrace`. The existing :func:`sys.setprofile` and :func:`sys.settrace` functions still exist, and have simply been changed to use the new C-level interface. (Contributed by Fred L. Drake, Jr.)
sv: Profilerings- och spårningsfunktioner kan nu implementeras i C, som kan arbeta i mycket högre hastigheter än Python-baserade funktioner och bör minska omkostnaderna för profilering och spårning. Detta kommer att vara av intresse för författare av utvecklingsmiljöer för Python. Två nya C-funktioner har lagts till i Pythons API, :c:func:`PyEval_SetProfile` och :c:func:`PyEval_SetTrace`. De befintliga funktionerna :func:`sys.setprofile` och :func:`sys.settrace` finns fortfarande kvar och har helt enkelt ändrats för att använda det nya gränssnittet på C-nivå. (Bidrag från Fred L. Drake, Jr.)

source: Another low-level API, primarily of interest to implementers of Python debuggers and development tools, was added. :c:func:`PyInterpreterState_Head` and :c:func:`PyInterpreterState_Next` let a caller walk through all the existing interpreter objects; :c:func:`PyInterpreterState_ThreadHead` and :c:func:`PyThreadState_Next` allow looping over all the thread states for a given interpreter. (Contributed by David Beazley.)
sv: Ytterligare ett API på låg nivå, främst av intresse för implementatörer av Python-debuggar och utvecklingsverktyg, har lagts till. :c:func:`PyInterpreterState_Head` och :c:func:`PyInterpreterState_Next` låter en anropare gå igenom alla befintliga tolkobjekt; :c:func:`PyInterpreterState_ThreadHead` och :c:func:`PyThreadState_Next` tillåter loopning över alla trådstatusar för en given tolk. (Bidrag från David Beazley.)

source: The C-level interface to the garbage collector has been changed to make it easier to write extension types that support garbage collection and to debug misuses of the functions. Various functions have slightly different semantics, so a bunch of functions had to be renamed. Extensions that use the old API will still compile but will *not* participate in garbage collection, so updating them for 2.2 should be considered fairly high priority.
sv: Gränssnittet på C-nivå till skräpsamlaren har ändrats för att göra det lättare att skriva tilläggstyper som stöder skräpsamling och för att felsöka felaktig användning av funktionerna. Olika funktioner har lite olika semantik, så ett antal funktioner måste döpas om. Tillägg som använder det gamla API:et kommer fortfarande att kompileras men kommer *inte* att delta i garbage collection, så att uppdatera dem för 2.2 bör anses ha ganska hög prioritet.

source: To upgrade an extension module to the new API, perform the following steps:
sv: Utför följande steg för att uppgradera en tilläggsmodul till det nya API:et:

source: Rename :c:macro:`!Py_TPFLAGS_GC` to :c:macro:`Py_TPFLAGS_HAVE_GC`.
sv: Byt namn på :c:macro:`!Py_TPFLAGS_GC` till :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Use :c:func:`PyObject_GC_New` or :c:func:`PyObject_GC_NewVar` to allocate
sv: Använd :c:func:`PyObject_GC_New` eller :c:func:`PyObject_GC_NewVar` för att allokera

source: objects, and :c:func:`PyObject_GC_Del` to deallocate them.
sv: objekt och :c:func:`PyObject_GC_Del` för att avallokera dem.

source: Rename :c:func:`!PyObject_GC_Init` to :c:func:`PyObject_GC_Track` and :c:func:`!PyObject_GC_Fini` to :c:func:`PyObject_GC_UnTrack`.
sv: Byt namn på :c:func:`!PyObject_GC_Init` till :c:func:`PyObject_GC_Track` och :c:func:`!PyObject_GC_Fini` till :c:func:`PyObject_GC_UnTrack`.

source: Remove :c:macro:`!PyGC_HEAD_SIZE` from object size calculations.
sv: Ta bort :c:macro:`!PyGC_HEAD_SIZE` från beräkningar av objektstorlek.

source: Remove calls to :c:func:`!PyObject_AS_GC` and :c:func:`!PyObject_FROM_GC`.
sv: Ta bort anrop till :c:func:`!PyObject_AS_GC` och :c:func:`!PyObject_FROM_GC`.

source: A new ``et`` format sequence was added to :c:func:`PyArg_ParseTuple`; ``et`` takes both a parameter and an encoding name, and converts the parameter to the given encoding if the parameter turns out to be a Unicode string, or leaves it alone if it's an 8-bit string, assuming it to already be in the desired encoding. This differs from the ``es`` format character, which assumes that 8-bit strings are in Python's default ASCII encoding and converts them to the specified new encoding. (Contributed by M.-A. Lemburg, and used for the MBCS support on Windows described in the following section.)
sv: En ny ``et`` formatsekvens lades till i :c:func:`PyArg_ParseTuple`; ``et`` tar både en parameter och ett kodningsnamn, och konverterar parametern till den givna kodningen om parametern visar sig vara en Unicode-sträng, eller lämnar den ifred om det är en 8-bitars sträng, och antar att den redan är i önskad kodning. Detta skiljer sig från formattecknet ``es``, som antar att 8-bitars strängar är i Pythons standard ASCII-kodning och konverterar dem till den angivna nya kodningen. (Bidrag från M.-A. Lemburg, och används för MBCS-stödet på Windows som beskrivs i följande avsnitt.)

source: A different argument parsing function, :c:func:`PyArg_UnpackTuple`, has been added that's simpler and presumably faster. Instead of specifying a format string, the caller simply gives the minimum and maximum number of arguments expected, and a set of pointers to :c:expr:`PyObject*` variables that will be filled in with argument values.
sv: En annan argumentparsingfunktion, :c:func:`PyArg_UnpackTuple`, har lagts till som är enklare och förmodligen snabbare. Istället för att ange en formatsträng anger anroparen helt enkelt det minsta och största antalet argument som förväntas, och en uppsättning pekare till :c:expr:`PyObject*`-variabler som ska fyllas i med argumentvärden.

source: Two new flags :c:macro:`METH_NOARGS` and :c:macro:`METH_O` are available in method definition tables to simplify implementation of methods with no arguments or a single untyped argument. Calling such methods is more efficient than calling a corresponding method that uses :c:macro:`METH_VARARGS`. Also, the old :c:macro:`!METH_OLDARGS` style of writing C methods is now officially deprecated.
sv: Två nya flaggor :c:macro:`METH_NOARGS` och :c:macro:`METH_O` finns tillgängliga i metoddefinitionstabeller för att förenkla implementeringen av metoder utan argument eller med ett enda otypat argument. Anrop av sådana metoder är effektivare än anrop av en motsvarande metod som använder :c:macro:`METH_VARARGS`. Dessutom är den gamla :c:macro:`!METH_OLDARGS`-stilen att skriva C-metoder nu officiellt föråldrad.

source: Two new wrapper functions, :c:func:`PyOS_snprintf` and :c:func:`PyOS_vsnprintf` were added to provide cross-platform implementations for the relatively new :c:func:`snprintf` and :c:func:`vsnprintf` C lib APIs. In contrast to the standard :c:func:`sprintf` and :c:func:`!vsprintf` functions, the Python versions check the bounds of the buffer used to protect against buffer overruns. (Contributed by M.-A. Lemburg.)
sv: Två nya omslagsfunktioner, :c:func:`PyOS_snprintf` och :c:func:`PyOS_vsnprintf` lades till för att tillhandahålla plattformsoberoende implementationer för de relativt nya C lib API:erna :c:func:`snprintf` och :c:func:`vsnprintf`. Till skillnad från standardfunktionerna :c:func:`sprintf` och :c:func:`!vsprintf` kontrollerar Python-versionerna gränserna för den buffert som används för att skydda mot buffertöverskridanden. (Bidrag från M.-A. Lemburg.)

source: The :c:func:`_PyTuple_Resize` function has lost an unused parameter, so now it takes 2 parameters instead of 3. The third argument was never used, and can simply be discarded when porting code from earlier versions to Python 2.2.
sv: Funktionen :c:func:`_PyTuple_Resize` har förlorat en oanvänd parameter, så nu tar den 2 parametrar istället för 3. Det tredje argumentet användes aldrig, och kan helt enkelt kasseras när kod från tidigare versioner portas till Python 2.2.

source: Other Changes and Fixes
sv: Övriga ändringar och korrigeringar

source: As usual there were a bunch of other improvements and bugfixes scattered throughout the source tree. A search through the CVS change logs finds there were 527 patches applied and 683 bugs fixed between Python 2.1 and 2.2; 2.2.1 applied 139 patches and fixed 143 bugs; 2.2.2 applied 106 patches and fixed 82 bugs. These figures are likely to be underestimates.
sv: Som vanligt fanns det en massa andra förbättringar och buggfixar utspridda i hela källträdet. En sökning genom CVS-ändringsloggarna visar att det fanns 527 korrigeringar och 683 buggfixar mellan Python 2.1 och 2.2; 2.2.1 tillämpade 139 korrigeringar och fixade 143 buggar; 2.2.2 tillämpade 106 korrigeringar och fixade 82 buggar. Dessa siffror är sannolikt underskattningar.

source: Some of the more notable changes are:
sv: Några av de mer anmärkningsvärda förändringarna är:

source: The code for the MacOS port for Python, maintained by Jack Jansen, is now kept in the main Python CVS tree, and many changes have been made to support MacOS X.
sv: Koden för MacOS-porten för Python, som underhålls av Jack Jansen, finns nu i Pythons CVS-huvudträd och många ändringar har gjorts för att stödja MacOS X.

source: The most significant change is the ability to build Python as a framework, enabled by supplying the :option:`!--enable-framework` option to the configure script when compiling Python. According to Jack Jansen, "This installs a self-contained Python installation plus the OS X framework "glue" into :file:`/Library/Frameworks/Python.framework` (or another location of choice). For now there is little immediate added benefit to this (actually, there is the disadvantage that you have to change your PATH to be able to find Python), but it is the basis for creating a full-blown Python application, porting the MacPython IDE, possibly using Python as a standard OSA scripting language and much more."
sv: Den mest betydande förändringen är möjligheten att bygga Python som ett ramverk, vilket aktiveras genom att ange alternativet :option:`!--enable-framework` till configure-skriptet när Python kompileras. Enligt Jack Jansen, "Detta installerar en fristående Python-installation plus OS X-ramverket "glue" i :file:`/Library/Frameworks/Python.framework` (eller annan valfri plats). För närvarande finns det inte mycket omedelbar nytta med detta (det finns faktiskt en nackdel i att du måste ändra din PATH för att kunna hitta Python), men det är grunden för att skapa en fullfjädrad Python-applikation, porta MacPython IDE, eventuellt använda Python som ett standard OSA-skriptspråk och mycket mer."

source: Most of the MacPython toolbox modules, which interface to MacOS APIs such as windowing, QuickTime, scripting, etc. have been ported to OS X, but they've been left commented out in :file:`setup.py`. People who want to experiment with these modules can uncomment them manually.
sv: De flesta av MacPythons verktygslådemoduler, som har gränssnitt mot MacOS API:er som windowing, QuickTime, scripting, etc. har portats till OS X, men de har lämnats okommenterade i :file:`setup.py`. Personer som vill experimentera med dessa moduler kan kommentera bort dem manuellt.

source: Keyword arguments passed to built-in functions that don't take them now cause a :exc:`TypeError` exception to be raised, with the message "*function* takes no keyword arguments".
sv: Nyckelordsargument som skickas till inbyggda funktioner som inte tar emot dem orsakar nu ett :exc:`TypeError`-undantag med meddelandet "*funktion* tar inga nyckelordsargument".

source: Weak references, added in Python 2.1 as an extension module, are now part of the core because they're used in the implementation of new-style classes. The :exc:`ReferenceError` exception has therefore moved from the :mod:`weakref` module to become a built-in exception.
sv: Svaga referenser, som lades till i Python 2.1 som en tilläggsmodul, är nu en del av kärnan eftersom de används i implementeringen av klasser av ny typ. Undantaget :exc:`ReferenceError` har därför flyttats från modulen :mod:`weakref` till att bli ett inbyggt undantag.

source: A new script, :file:`Tools/scripts/cleanfuture.py` by Tim Peters, automatically removes obsolete ``__future__`` statements from Python source code.
sv: Ett nytt skript, :file:`Tools/scripts/cleanfuture.py` av Tim Peters, tar automatiskt bort föråldrade ``__future__``-satser från Pythons källkod.

source: An additional *flags* argument has been added to the built-in function :func:`compile`, so the behaviour of ``__future__`` statements can now be correctly observed in simulated shells, such as those presented by IDLE and other development environments. This is described in :pep:`264`. (Contributed by Michael Hudson.)
sv: Ett ytterligare *flags*-argument har lagts till i den inbyggda funktionen :func:`compile`, så att beteendet hos ``__future__``-satser nu kan observeras korrekt i simulerade skal, som de som presenteras av IDLE och andra utvecklingsmiljöer. Detta beskrivs i :pep:`264`. (Bidrag från Michael Hudson.)

source: The new license introduced with Python 1.6 wasn't GPL-compatible. This is fixed by some minor textual changes to the 2.2 license, so it's now legal to embed Python inside a GPLed program again. Note that Python itself is not GPLed, but instead is under a license that's essentially equivalent to the BSD license, same as it always was. The license changes were also applied to the Python 2.0.1 and 2.1.1 releases.
sv: Den nya licensen som introducerades med Python 1.6 var inte GPL-kompatibel. Detta är åtgärdat genom några mindre textändringar i 2.2-licensen, så det är nu lagligt att bädda in Python i ett GPL-program igen. Observera att Python i sig inte är GPL, utan istället är under en licens som i huvudsak är likvärdig med BSD-licensen, precis som den alltid har varit. Licensändringarna tillämpades också på Python 2.0.1 och 2.1.1 utgåvorna.

source: When presented with a Unicode filename on Windows, Python will now convert it to an MBCS encoded string, as used by the Microsoft file APIs. As MBCS is explicitly used by the file APIs, Python's choice of ASCII as the default encoding turns out to be an annoyance. On Unix, the locale's character set is used if ``locale.nl_langinfo(CODESET)`` is available. (Windows support was contributed by Mark Hammond with assistance from Marc-André Lemburg. Unix support was added by Martin von Löwis.)
sv: När Python får ett Unicode-filnamn i Windows konverterar Python det nu till en MBCS-kodad sträng, som används av Microsofts fil-API:er. Eftersom MBCS uttryckligen används av fil-API:erna, visar sig Pythons val av ASCII som standardkodning vara ett irritationsmoment. På Unix används lokalens teckenuppsättning om ``locale.nl_langinfo(CODESET)`` är tillgänglig. (Windows-stöd har tillhandahållits av Mark Hammond med hjälp av Marc-André Lemburg. Unix-stöd har lagts till av Martin von Löwis)

source: Large file support is now enabled on Windows. (Contributed by Tim Peters.)
sv: Stöd för stora filer är nu aktiverat i Windows. (Bidrag från Tim Peters.)

source: The :file:`Tools/scripts/ftpmirror.py` script now parses a :file:`.netrc` file, if you have one. (Contributed by Mike Romberg.)
sv: Skriptet :file:`Tools/scripts/ftpmirror.py` analyserar nu en :file:`.netrc`-fil, om du har en sådan. (Bidrag från Mike Romberg.)

source: Some features of the object returned by the :func:`!xrange` function are now deprecated, and trigger warnings when they're accessed; they'll disappear in Python 2.3. :class:`!xrange` objects tried to pretend they were full sequence types by supporting slicing, sequence multiplication, and the :keyword:`in` operator, but these features were rarely used and therefore buggy. The :meth:`!tolist` method and the :attr:`!start`, :attr:`!stop`, and :attr:`!step` attributes are also being deprecated. At the C level, the fourth argument to the :c:func:`!PyRange_New` function, ``repeat``, has also been deprecated.
sv: Vissa egenskaper hos objektet som returneras av funktionen :func:`!xrange` är nu föråldrade och utlöser varningar när de används; de kommer att försvinna i Python 2.3. :class:`!xrange`-objekt försökte låtsas att de var fullständiga sekvenstyper genom att stödja skivning, sekvensmultiplikation och operatorn :keyword:`in`, men dessa egenskaper användes sällan och var därför buggiga. Metoden :meth:`!tolist` och attributen :attr:`!start`, :attr:`!stop` och :attr:`!step` är också föråldrade. På C-nivå har det fjärde argumentet till funktionen :c:func:`!PyRange_New`, ``repeat``, också utgått.

source: There were a bunch of patches to the dictionary implementation, mostly to fix potential core dumps if a dictionary contains objects that sneakily changed their hash value, or mutated the dictionary they were contained in. For a while python-dev fell into a gentle rhythm of Michael Hudson finding a case that dumped core, Tim Peters fixing the bug, Michael finding another case, and round and round it went.
sv: Det fanns ett antal korrigeringar till implementationen av ordböcker, mestadels för att åtgärda potentiella dumpningar av kärnan om en ordbok innehåller objekt som i smyg ändrade sitt hashvärde eller muterade den ordbok de ingick i. Under en tid föll python-dev in i en lugn rytm där Michael Hudson hittade ett fall som dumpade kärnan, Tim Peters fixade buggen, Michael hittade ett annat fall och så gick det runt och runt.

source: On Windows, Python can now be compiled with Borland C thanks to a number of patches contributed by Stephen Hansen, though the result isn't fully functional yet. (But this *is* progress...)
sv: På Windows kan Python nu kompileras med Borland C tack vare ett antal patchar som Stephen Hansen har bidragit med, även om resultatet inte är fullt funktionellt ännu. (Men det här *är* ett framsteg...)

source: Another Windows enhancement: Wise Solutions generously offered PythonLabs use of their InstallerMaster 8.1 system. Earlier PythonLabs Windows installers used Wise 5.0a, which was beginning to show its age. (Packaged up by Tim Peters.)
sv: Ännu en Windows-förbättring: Wise Solutions erbjöd generöst PythonLabs att använda deras InstallerMaster 8.1-system. Tidigare PythonLabs Windows-installatörer använde Wise 5.0a, som började visa sin ålder. (Paketerat av Tim Peters.)

source: Files ending in ``.pyw`` can now be imported on Windows. ``.pyw`` is a Windows-only thing, used to indicate that a script needs to be run using PYTHONW.EXE instead of PYTHON.EXE in order to prevent a DOS console from popping up to display the output. This patch makes it possible to import such scripts, in case they're also usable as modules. (Implemented by David Bolen.)
sv: Filer som slutar på ``.pyw`` kan nu importeras i Windows. ``.pyw`` är något som bara finns i Windows och används för att indikera att ett skript måste köras med PYTHONW.EXE istället för PYTHON.EXE för att förhindra att en DOS-konsol dyker upp för att visa utdata. Denna patch gör det möjligt att importera sådana skript, ifall de också kan användas som moduler. (Implementerad av David Bolen.)

source: On platforms where Python uses the C :c:func:`dlopen` function to load extension modules, it's now possible to set the flags used by :c:func:`dlopen` using the :func:`sys.getdlopenflags` and :func:`sys.setdlopenflags` functions. (Contributed by Bram Stolk.)
sv: På plattformar där Python använder C-funktionen :c:func:`dlopen` för att ladda tilläggsmoduler är det nu möjligt att ställa in flaggorna som används av :c:func:`dlopen` med hjälp av funktionerna :func:`sys.getdlopenflags` och :func:`sys.setdlopenflags`. (Bidrag från Bram Stolk.)

source: The :func:`pow` built-in function no longer supports 3 arguments when floating-point numbers are supplied. ``pow(x, y, z)`` returns ``(x**y) % z``, but this is never useful for floating-point numbers, and the final result varies unpredictably depending on the platform. A call such as ``pow(2.0, 8.0, 7.0)`` will now raise a :exc:`TypeError` exception.
sv: Den inbyggda funktionen :func:`pow` har inte längre stöd för 3 argument när flyttal anges. ``pow(x, y, z)`` returnerar ``(x**y) % z``, men detta är aldrig användbart för flyttal och slutresultatet varierar oförutsägbart beroende på plattform. Ett anrop som ``pow(2.0, 8.0, 7.0)`` kommer nu att ge upphov till ett :exc:`TypeError` undantag.

source: Acknowledgements
sv: Tack till

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Fred Bremmer, Keith Briggs, Andrew Dalke, Fred L. Drake, Jr., Carel Fellinger, David Goodger, Mark Hammond, Stephen Hansen, Michael Hudson, Jack Jansen, Marc-André Lemburg, Martin von Löwis, Fredrik Lundh, Michael McLay, Nick Mathewson, Paul Moore, Gustavo Niemeyer, Don O'Donnell, Joonas Paalasma, Tim Peters, Jens Quade, Tom Reinhardt, Neil Schemenauer, Guido van Rossum, Greg Ward, Edward Welbourne.
sv: Författaren vill tacka följande personer för förslag, korrigeringar och hjälp med olika utkast till denna artikel: Fred Bremmer, Keith Briggs, Andrew Dalke, Fred L. Drake, Jr, Carel Fellinger, David Goodger, Mark Hammond, Stephen Hansen, Michael Hudson, Jack Jansen, Marc-André Lemburg, Martin von Löwis, Fredrik Lundh, Michael McLay, Nick Mathewson, Paul Moore, Gustavo Niemeyer, Don O'Donnell, Joonas Paalasma, Tim Peters, Jens Quade, Tom Reinhardt, Neil Schemenauer, Guido van Rossum, Greg Ward, Edward Welbourne.
