Repository: yeager/python-docs-sv
Catalog: whatsnew/2.2.po
Languages: sv

source: >>> s = """Here is a lengthy piece of redundant, overly verbose, ... and repetitive text. ... """ >>> data = s.encode('zlib') >>> data 'x\x9c\r\xc9\xc1\r\x80 \x10\x04\xc0?Ul...' >>> data.decode('zlib') 'Here is a lengthy piece of redundant, overly verbose,\nand repetitive text.\n' >>> print s.encode('uu') begin 666 <data> M2&5R92!I<R!A(&QE;F=T:'D@<&EE8V4@;V8@<F5D=6YD86YT+"!O=F5R;'D@ >=F5R8F]S92P*86YD(')E<&5T:71I=F4@=&5X="X* end >>> "sheesh".encode('rot-13') 'furrfu'
sv: &gt;&gt;&gt; s = """Här är en lång bit av överflödig, alltför mångordig, ... och repetitiv text. ... """ &gt;&gt;&gt; data = s.encode('zlib') &gt;&gt;&gt; data 'x\x9c\r\xc9\xc1\r\x80 \x10\x04\xc0?Ul...' &gt;&gt;&gt; data.decode('zlib') "Här är en lång bit överflödig, alltför mångordig och repetitiv text &gt;&gt;&gt; print s.encode('uu') börja 666 <data> M2&amp;5R92!I<R!A(&QE;F=T:'D@<&EE8V4@;V8@<F5D=6YD86YT+"!O=F5R;'D@ >=F5R8F]S92P*86YD(')E&lt;&amp;5T:71I=F4@=&amp;5X="X* slut &gt;&gt;&gt; "sheesh".encode('rot-13') 'furrfu'

source: To convert a class instance to Unicode, a :meth:`!__unicode__` method can be defined by a class, analogous to :meth:`!__str__`.
sv: För att konvertera en klassinstans till Unicode kan en :meth:`!__unicode__`-metod definieras av en klass, analogt med :meth:`!__str__`.

source: :meth:`!encode`, :meth:`!decode`, and :meth:`!__unicode__` were implemented by Marc-André Lemburg. The changes to support using UCS-4 internally were implemented by Fredrik Lundh and Martin von Löwis.
sv: :meth:`!encode`, :meth:`!decode`, och :meth:`!__unicode__` implementerades av Marc-André Lemburg. Ändringarna för att stödja intern användning av UCS-4 implementerades av Fredrik Lundh och Martin von Löwis.

source: :pep:`261` - Support for 'wide' Unicode characters
sv: :pep:`261` - Stöd för "breda" Unicode-tecken

source: Written by Paul Prescod.
sv: Skriven av Paul Prescod.

source: PEP 227: Nested Scopes
sv: PEP 227: Nästlade scopes

source: In Python 2.1, statically nested scopes were added as an optional feature, to be enabled by a ``from __future__ import nested_scopes`` directive. In 2.2 nested scopes no longer need to be specially enabled, and are now always present. The rest of this section is a copy of the description of nested scopes from my "What's New in Python 2.1" document; if you read it when 2.1 came out, you can skip the rest of this section.
sv: I Python 2.1 lades statiskt nästlade scopes till som en valfri funktion, som kunde aktiveras med ett ``from __future__ import nested_scopes``-direktiv. I 2.2 behöver nästlade scopes inte längre aktiveras särskilt, utan finns nu alltid. Resten av det här avsnittet är en kopia av beskrivningen av nested scopes från mitt dokument "What's New in Python 2.1"; om du läste det när 2.1 kom ut kan du hoppa över resten av det här avsnittet.

source: The largest change introduced in Python 2.1, and made complete in 2.2, is to Python's scoping rules. In Python 2.0, at any given time there are at most three namespaces used to look up variable names: local, module-level, and the built-in namespace. This often surprised people because it didn't match their intuitive expectations. For example, a nested recursive function definition doesn't work::
sv: Den största förändringen som introducerades i Python 2.1, och som slutfördes i 2.2, är Pythons scoping-regler. I Python 2.0 finns det vid varje given tidpunkt högst tre namnrymder som används för att leta upp variabelnamn: lokalt, modulnivå och det inbyggda namnrymden. Detta förvånade ofta människor eftersom det inte stämde överens med deras intuitiva förväntningar. Till exempel fungerar inte en nästlad rekursiv funktionsdefinition::

source: The function :func:`!g` will always raise a :exc:`NameError` exception, because the binding of the name ``g`` isn't in either its local namespace or in the module-level namespace. This isn't much of a problem in practice (how often do you recursively define interior functions like this?), but this also made using the :keyword:`lambda` expression clumsier, and this was a problem in practice. In code which uses :keyword:`!lambda` you can often find local variables being copied by passing them as the default values of arguments. ::
sv: Funktionen :func:`!g` kommer alltid att ge upphov till ett :exc:`NameError`-undantag, eftersom bindningen av namnet ``g`` inte finns i vare sig dess lokala namnrymd eller i namnrymden på modulnivå. Detta är inte mycket av ett problem i praktiken (hur ofta definierar man rekursivt inre funktioner på det här sättet?), men det gjorde det också klumpigare att använda :keyword:`lambda`-uttrycket, och det var ett problem i praktiken. I kod som använder :keyword:`!lambda` kan man ofta hitta lokala variabler som kopieras genom att de skickas som standardvärden för argument. ::

source: def find(self, name): "Return list of any entries equal to 'name'" L = filter(lambda x, name=name: x == name, self.list_attribute) return L
sv: def hitta(själv, namn): "Returnera listan med alla poster som är lika med 'namn'" L = filter(lambda x, namn=namn: x == namn, self.list_attribut) returnera L

source: The readability of Python code written in a strongly functional style suffers greatly as a result.
sv: Läsbarheten hos Python-kod skriven i en starkt funktionell stil blir därför mycket lidande.

source: The most significant change to Python 2.2 is that static scoping has been added to the language to fix this problem. As a first effect, the ``name=name`` default argument is now unnecessary in the above example. Put simply, when a given variable name is not assigned a value within a function (by an assignment, or the :keyword:`def`, :keyword:`class`, or :keyword:`import` statements), references to the variable will be looked up in the local namespace of the enclosing scope. A more detailed explanation of the rules, and a dissection of the implementation, can be found in the PEP.
sv: Den mest betydande förändringen i Python 2.2 är att statisk scoping har lagts till i språket för att lösa detta problem. Som en första effekt är standardargumentet ``namn=namn`` nu onödigt i exemplet ovan. Enkelt uttryckt, när ett givet variabelnamn inte tilldelas ett värde inom en funktion (genom en tilldelning, eller genom :keyword:`def`, :keyword:`class`, eller :keyword:`import`), kommer referenser till variabeln att sökas i det lokala namnområdet i det omslutande scopet. En mer detaljerad förklaring av reglerna, och en dissektion av implementationen, finns i PEP.

source: This change may cause some compatibility problems for code where the same variable name is used both at the module level and as a local variable within a function that contains further function definitions. This seems rather unlikely though, since such code would have been pretty confusing to read in the first place.
sv: Denna ändring kan orsaka vissa kompatibilitetsproblem för kod där samma variabelnamn används både på modulnivå och som en lokal variabel inom en funktion som innehåller ytterligare funktionsdefinitioner. Detta verkar dock ganska osannolikt, eftersom sådan kod skulle ha varit ganska förvirrande att läsa från början.

source: One side effect of the change is that the ``from module import *`` and ``exec`` statements have been made illegal inside a function scope under certain conditions. The Python reference manual has said all along that ``from module import *`` is only legal at the top level of a module, but the CPython interpreter has never enforced this before. As part of the implementation of nested scopes, the compiler which turns Python source into bytecodes has to generate different code to access variables in a containing scope. ``from module import *`` and ``exec`` make it impossible for the compiler to figure this out, because they add names to the local namespace that are unknowable at compile time. Therefore, if a function contains function definitions or :keyword:`lambda` expressions with free variables, the compiler will flag this by raising a :exc:`SyntaxError` exception.
sv: En sidoeffekt av förändringen är att ``from module import *`` och ``exec``-satserna har gjorts olagliga inom ett funktionsomfång under vissa förhållanden. Pythons referensmanual har hela tiden sagt att ``from module import *`` bara är lagligt på den översta nivån i en modul, men CPython-tolken har aldrig verkställt detta tidigare. Som en del av implementeringen av nästlade scope måste kompilatorn som förvandlar Python-källkod till bytecodes generera annan kod för att komma åt variabler i ett innehållande scope. ``from module import *`` och ``exec`` gör det omöjligt för kompilatorn att räkna ut detta, eftersom de lägger till namn i det lokala namnområdet som är okända vid kompileringstillfället. Därför, om en funktion innehåller funktionsdefinitioner eller :keyword:`lambda` uttryck med fria variabler, kommer kompilatorn att flagga detta genom att skapa ett :exc:`SyntaxError` undantag.

source: To make the preceding explanation a bit clearer, here's an example::
sv: För att göra den föregående förklaringen lite tydligare, här är ett exempel::

source: x = 1 def f(): # The next line is a syntax error exec 'x=2' def g(): return x
sv: x = 1 def f(): # Nästa rad är ett syntaxfel exec 'x=2' def g(): return x

source: Line 4 containing the ``exec`` statement is a syntax error, since ``exec`` would define a new local variable named ``x`` whose value should be accessed by :func:`!g`.
sv: Rad 4 som innehåller ``exec``-satsen är ett syntaxfel, eftersom ``exec`` skulle definiera en ny lokal variabel med namnet ``x`` vars värde ska nås av :func:`!g`.

source: This shouldn't be much of a limitation, since ``exec`` is rarely used in most Python code (and when it is used, it's often a sign of a poor design anyway).
sv: Detta borde inte vara någon större begränsning, eftersom ``exec`` sällan används i den mesta Python-koden (och när det används är det ofta ett tecken på dålig design).

source: :pep:`227` - Statically Nested Scopes
sv: :pep:`227` - Statiskt nästlade scopes

source: Written and implemented by Jeremy Hylton.
sv: Skriven och implementerad av Jeremy Hylton.

source: New and Improved Modules
sv: Nya och förbättrade moduler

source: The :mod:`xmlrpclib <xmlrpc.client>` module was contributed to the standard library by Fredrik Lundh, providing support for writing XML-RPC clients. XML-RPC is a simple remote procedure call protocol built on top of HTTP and XML. For example, the following snippet retrieves a list of RSS channels from the O'Reilly Network, and then lists the recent headlines for one channel::
sv: Modulen :mod:`xmlrpclib <xmlrpc.client>` är ett bidrag till standardbiblioteket från Fredrik Lundh och ger stöd för att skriva XML-RPC-klienter. XML-RPC är ett enkelt protokoll för fjärrproceduranrop som bygger på HTTP och XML. Följande utdrag hämtar till exempel en lista med RSS-kanaler från O'Reilly Network och listar sedan de senaste rubrikerna för en kanal::

source: import xmlrpclib s = xmlrpclib.Server( 'http://www.oreillynet.com/meerkat/xml-rpc/server.php') channels = s.meerkat.getChannels() # channels is a list of dictionaries, like this: # [{'id': 4, 'title': 'Freshmeat Daily News'} # {'id': 190, 'title': '32Bits Online'}, # {'id': 4549, 'title': '3DGamers'}, ... ] # Get the items for one channel items = s.meerkat.getItems( {'channel': 4} ) # 'items' is another list of dictionaries, like this: # [{'link': 'http://freshmeat.net/releases/52719/', # 'description': 'A utility which converts HTML to XSL FO.', # 'title': 'html2fo 0.3 (Default)'}, ... ]
sv: import xmlrpclib s = xmlrpclib.server( 'http://www.oreillynet.com/meerkat/xml-rpc/server.php') kanaler = s.meerkat.getChannels() # kanaler är en lista med ordböcker, så här: # [{'id': 4, 'title': 'Freshmeat Daily News'} # {'id': 190, 'title': '32Bits Online'}, # {'id': 4549, 'title': '3DGamers'}, ... ] # Hämta objekten för en kanal objekt = s.meerkat.getItems( {'kanal': 4} ) # "items" är en annan lista med ordböcker, så här: # [{'link': 'http://freshmeat.net/releases/52719/', # 'description': 'Ett verktyg som konverterar HTML till XSL FO.', # 'title': 'html2fo 0.3 (Standard)'}, ... ]

source: The :mod:`SimpleXMLRPCServer <xmlrpc.server>` module makes it easy to create straightforward XML-RPC servers. See http://xmlrpc.scripting.com/ for more information about XML-RPC.
sv: Modulen :mod:`SimpleXMLRPCServer <xmlrpc.server>` gör det enkelt att skapa enkla XML-RPC-servrar. Se http://xmlrpc.scripting.com/ för mer information om XML-RPC.

source: The new :mod:`hmac` module implements the HMAC algorithm described by :rfc:`2104`. (Contributed by Gerhard Häring.)
sv: Den nya modulen :mod:`hmac` implementerar HMAC-algoritmen som beskrivs av :rfc:`2104`. (Bidrag från Gerhard Häring.)

source: Several functions that originally returned lengthy tuples now return pseudo-sequences that still behave like tuples but also have mnemonic attributes such as :attr:`!memberst_mtime` or :attr:`~time.struct_time.tm_year`. The enhanced functions include :func:`~os.stat`, :func:`~os.fstat`, :func:`~os.statvfs`, and :func:`~os.fstatvfs` in the :mod:`os` module, and :func:`~time.localtime`, :func:`~time.gmtime`, and :func:`~time.strptime` in the :mod:`time` module.
sv: Flera funktioner som ursprungligen returnerade långa tuplar returnerar nu pseudosekvenser som fortfarande beter sig som tuplar men som också har minnesvärda attribut som :attr:`!memberst_mtime` eller :attr:`~time.struct_time.tm_year`. De förbättrade funktionerna inkluderar :func:`~os.stat`, :func:`~os.fstat`, :func:`~os.statvfs` och :func:`~os.fstatvfs` i modulen :mod:`os`, och :func:`~time.localtime`, :func:`~time.gmtime` och :func:`~time.strptime` i modulen :mod:`time`.

source: For example, to obtain a file's size using the old tuples, you'd end up writing something like ``file_size = os.stat(filename)[stat.ST_SIZE]``, but now this can be written more clearly as ``file_size = os.stat(filename).st_size``.
sv: Om du till exempel vill veta storleken på en fil med hjälp av de gamla tuplarna skulle du skriva något i stil med ``file_size = os.stat(filnamn)[stat.ST_SIZE]``, men nu kan det skrivas tydligare som ``file_size = os.stat(filnamn).st_size``.

source: The original patch for this feature was contributed by Nick Mathewson.
sv: Den ursprungliga korrigeringen för denna funktion gjordes av Nick Mathewson.

source: The Python profiler has been extensively reworked and various errors in its output have been corrected. (Contributed by Fred L. Drake, Jr. and Tim Peters.)
sv: Python-profileraren har genomgått en omfattande omarbetning och olika fel i dess utdata har korrigerats. (Bidrag från Fred L. Drake, Jr. och Tim Peters.)

source: The :mod:`socket` module can be compiled to support IPv6; specify the :option:`!--enable-ipv6` option to Python's configure script. (Contributed by Jun-ichiro "itojun" Hagino.)
sv: Modulen :mod:`socket` kan kompileras för att stödja IPv6; ange alternativet :option:`!--enable-ipv6` i Pythons configure-skript. (Bidrag från Jun-ichiro "itojun" Hagino.)

source: Two new format characters were added to the :mod:`struct` module for 64-bit integers on platforms that support the C :c:expr:`long long` type. ``q`` is for a signed 64-bit integer, and ``Q`` is for an unsigned one. The value is returned in Python's long integer type. (Contributed by Tim Peters.)
sv: Två nya formattecken har lagts till i modulen :mod:`struct` för 64-bitars heltal på plattformar som stöder C :c:expr:`long long`-typen. ``q`` är för ett signerat 64-bitars heltal, och ``Q`` är för ett osignerat. Värdet returneras i Pythons long integer-typ. (Bidrag från Tim Peters.)

source: In the interpreter's interactive mode, there's a new built-in function :func:`help` that uses the :mod:`pydoc` module introduced in Python 2.1 to provide interactive help. ``help(object)`` displays any available help text about *object*. :func:`help` with no argument puts you in an online help utility, where you can enter the names of functions, classes, or modules to read their help text. (Contributed by Guido van Rossum, using Ka-Ping Yee's :mod:`pydoc` module.)
sv: I tolkens interaktiva läge finns en ny inbyggd funktion :func:`help` som använder modulen :mod:`pydoc` som introducerades i Python 2.1 för att ge interaktiv hjälp. ``help(object)`` visar all tillgänglig hjälptext om *object*. :func:`help` utan argument placerar dig i ett online-hjälpverktyg, där du kan ange namnen på funktioner, klasser eller moduler för att läsa deras hjälptext. (Bidrag från Guido van Rossum, som använder Ka-Ping Yee:s modul :mod:`pydoc`)

source: Various bugfixes and performance improvements have been made to the SRE engine underlying the :mod:`re` module. For example, the :func:`re.sub` and :func:`re.split` functions have been rewritten in C. Another contributed patch speeds up certain Unicode character ranges by a factor of two, and a new :meth:`~re.finditer` method that returns an iterator over all the non-overlapping matches in a given string. (SRE is maintained by Fredrik Lundh. The BIGCHARSET patch was contributed by Martin von Löwis.)
sv: Olika buggfixar och prestandaförbättringar har gjorts i SRE-motorn som ligger till grund för modulen :mod:`re`. Till exempel har funktionerna :func:`re.sub` och :func:`re.split` skrivits om i C. En annan patch som har bidragit snabbar upp vissa Unicode-teckenintervall med en faktor två, och en ny :meth:`~re.finditer`-metod som returnerar en iterator över alla icke-överlappande matchningar i en given sträng. (SRE underhålls av Fredrik Lundh. BIGCHARSET-patchen är ett bidrag från Martin von Löwis)

source: The :mod:`smtplib` module now supports :rfc:`2487`, "Secure SMTP over TLS", so it's now possible to encrypt the SMTP traffic between a Python program and the mail transport agent being handed a message. :mod:`smtplib` also supports SMTP authentication. (Contributed by Gerhard Häring.)
sv: Modulen :mod:`smtplib` stöder nu :rfc:`2487`, "Secure SMTP over TLS", så det är nu möjligt att kryptera SMTP-trafiken mellan ett Python-program och den e-posttransportagent som får ett meddelande. :mod:`smtplib` stöder också SMTP-autentisering. (Bidrag från Gerhard Häring.)

source: The :mod:`imaplib` module, maintained by Piers Lauder, has support for several new extensions: the NAMESPACE extension defined in :rfc:`2342`, SORT, GETACL and SETACL. (Contributed by Anthony Baxter and Michel Pelletier.)
sv: Modulen :mod:`imaplib`, som underhålls av Piers Lauder, har stöd för flera nya tillägg: NAMESPACE-tillägget som definieras i :rfc:`2342`, SORT, GETACL och SETACL. (Bidrag från Anthony Baxter och Michel Pelletier.)

source: The :mod:`!rfc822` module's parsing of email addresses is now compliant with :rfc:`2822`, an update to :rfc:`822`. (The module's name is *not* going to be changed to ``rfc2822``.) A new package, :mod:`email`, has also been added for parsing and generating e-mail messages. (Contributed by Barry Warsaw, and arising out of his work on Mailman.)
sv: Modulen :mod:`!rfc822`:s parsning av e-postadresser är nu kompatibel med :rfc:`2822`, en uppdatering av :rfc:`822`. (Modulens namn kommer *inte* att ändras till ``rfc2822``.) Ett nytt paket, :mod:`email`, har också lagts till för parsning och generering av e-postmeddelanden. (Bidraget kommer från Barry Warsaw och är ett resultat av hans arbete med Mailman)

source: The :mod:`difflib` module now contains a new :class:`!Differ` class for producing human-readable lists of changes (a "delta") between two sequences of lines of text. There are also two generator functions, :func:`!ndiff` and :func:`!restore`, which respectively return a delta from two sequences, or one of the original sequences from a delta. (Grunt work contributed by David Goodger, from ndiff.py code by Tim Peters who then did the generatorization.)
sv: Modulen :mod:`difflib` innehåller nu en ny klass :class:`!Differ` för att producera mänskligt läsbara listor över förändringar (ett "delta") mellan två sekvenser av textrader. Det finns också två generatorfunktioner, :func:`!ndiff` och :func:`!restore`, som returnerar ett delta från två sekvenser respektive en av originalsekvenserna från ett delta. (Grunt-arbete utfört av David Goodger, från ndiff.py-kod av Tim Peters som sedan gjorde generatoriseringen)

source: New constants :const:`!ascii_letters`, :const:`!ascii_lowercase`, and :const:`!ascii_uppercase` were added to the :mod:`string` module. There were several modules in the standard library that used :const:`!string.letters` to mean the ranges A-Za-z, but that assumption is incorrect when locales are in use, because :const:`!string.letters` varies depending on the set of legal characters defined by the current locale. The buggy modules have all been fixed to use :const:`!ascii_letters` instead. (Reported by an unknown person; fixed by Fred L. Drake, Jr.)
sv: Nya konstanter :const:`!ascii_letters`, :const:`!ascii_lowercase` och :const:`!ascii_uppercase` har lagts till i modulen :mod:`string`. Det fanns flera moduler i standardbiblioteket som använde :const:`!string.letters` för att betyda intervallen A-Za-z, men det antagandet är felaktigt när lokalspråk används, eftersom :const:`!string.letters` varierar beroende på uppsättningen av lagliga tecken som definieras av det aktuella lokalspråket. De buggiga modulerna har alla åtgärdats så att de använder :const:`!ascii_letters` istället. (Rapporterad av en okänd person; åtgärdad av Fred L. Drake, Jr.)

source: The :mod:`mimetypes` module now makes it easier to use alternative MIME-type databases by the addition of a :class:`~mimetypes.MimeTypes` class, which takes a list of filenames to be parsed. (Contributed by Fred L. Drake, Jr.)
sv: Modulen :mod:`mimetypes` gör det nu enklare att använda alternativa MIME-typdatabaser genom tillägget av en klass :class:`~mimetypes.MimeTypes`, som tar emot en lista med filnamn som skall analyseras. (Bidrag från Fred L. Drake, Jr.)

source: A :class:`~threading.Timer` class was added to the :mod:`threading` module that allows scheduling an activity to happen at some future time. (Contributed by Itamar Shtull-Trauring.)
sv: En :class:`~threading.Timer`-klass lades till i :mod:`threading`-modulen som gör det möjligt att schemalägga en aktivitet till en viss tidpunkt i framtiden. (Bidrag från Itamar Shtull-Trauring.)

source: Interpreter Changes and Fixes
sv: Ändringar och korrigeringar i tolkprogrammet

source: Some of the changes only affect people who deal with the Python interpreter at the C level because they're writing Python extension modules, embedding the interpreter, or just hacking on the interpreter itself. If you only write Python code, none of the changes described here will affect you very much.
sv: En del av ändringarna påverkar bara personer som arbetar med Python-tolken på C-nivå, eftersom de skriver Python-tilläggsmoduler, bäddar in tolken eller bara hackar på själva tolken. Om du bara skriver Python-kod kommer ingen av de förändringar som beskrivs här att påverka dig särskilt mycket.
