Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: Other minor changes to Distutils: it now checks for the :envvar:`CC`, :envvar:`CFLAGS`, :envvar:`!CPP`, :envvar:`LDFLAGS`, and :envvar:`CPPFLAGS` environment variables, using them to override the settings in Python's configuration (contributed by Robert Weber).
sv: Andra mindre ändringar i Distutils: det kontrollerar nu för miljövariablerna :envvar:`CC`, :envvar:`CFLAGS`, :envvar:`!CPP`, :envvar:`LDFLAGS` och :envvar:`CPPFLAGS`, och använder dem för att åsidosätta inställningarna i Pythons konfiguration (bidrag från Robert Weber).

source: Previously the :mod:`doctest` module would only search the docstrings of public methods and functions for test cases, but it now also examines private ones as well. The :func:`~doctest.DocTestSuite` function creates a :class:`unittest.TestSuite` object from a set of :mod:`doctest` tests.
sv: Tidigare sökte modulen :mod:`doctest` bara efter testfall i dokumentsträngarna för offentliga metoder och funktioner, men nu undersöker den även privata metoder och funktioner. Funktionen :func:`~doctest.DocTestSuite` skapar ett :class:`unittest.TestSuite`-objekt från en uppsättning :mod:`doctest`-tester.

source: The new ``gc.get_referents(object)`` function returns a list of all the objects referenced by *object*.
sv: Den nya funktionen ``gc.get_referents(object)`` returnerar en lista över alla objekt som refereras till av *object*.

source: The :mod:`getopt` module gained a new function, :func:`~getopt.gnu_getopt`, that supports the same arguments as the existing :func:`~getopt.getopt` function but uses GNU-style scanning mode. The existing :func:`~getopt.getopt` stops processing options as soon as a non-option argument is encountered, but in GNU-style mode processing continues, meaning that options and arguments can be mixed. For example::
sv: Modulen :mod:`getopt` har fått en ny funktion, :func:`~getopt.gnu_getopt`, som stöder samma argument som den befintliga funktionen :func:`~getopt.getopt` men som använder GNU-stils skanningsläge. Den befintliga :func:`~getopt.getopt` slutar bearbeta alternativ så snart ett argument som inte är ett alternativ påträffas, men i GNU-stil fortsätter bearbetningen, vilket innebär att alternativ och argument kan blandas. Till exempel::

source: >>> getopt.getopt(['-f', 'filename', 'output', '-v'], 'f:v') ([('-f', 'filename')], ['output', '-v']) >>> getopt.gnu_getopt(['-f', 'filename', 'output', '-v'], 'f:v') ([('-f', 'filename'), ('-v', '')], ['output'])
sv: >>> getopt.getopt(['-f', 'filnamn', 'output', '-v'], 'f:v') ([('-f', 'filnamn')], ['output', '-v']) >>> getopt.gnu_getopt(['-f', 'filnamn', 'utdata', '-v'], 'f:v') ([('-f', 'filnamn'), ('-v', '')], ['utdata'])

source: (Contributed by Peter Åstrand.)
sv: (Bidrag från Peter Åstrand.)

source: The :mod:`grp`, :mod:`pwd`, and :mod:`resource` modules now return enhanced tuples::
sv: Modulerna :mod:`grp`, :mod:`pwd` och :mod:`resource` returnerar nu förbättrade tuples::

source: >>> import grp >>> g = grp.getgrnam('amk') >>> g.gr_name, g.gr_gid ('amk', 500)
sv: >>> import grp >>> g = grp.getgrnam('amk') >>> g.gr_namn, g.gr_gid ('amk', 500)

source: The :mod:`gzip` module can now handle files exceeding 2 GiB.
sv: Modulen :mod:`gzip` kan nu hantera filer som överstiger 2 GiB.

source: The new :mod:`heapq` module contains an implementation of a heap queue algorithm. A heap is an array-like data structure that keeps items in a partially sorted order such that, for every index *k*, ``heap[k] <= heap[2*k+1]`` and ``heap[k] <= heap[2*k+2]``. This makes it quick to remove the smallest item, and inserting a new item while maintaining the heap property is *O*\ (log *n*). (See https://xlinux.nist.gov/dads//HTML/priorityque.html for more information about the priority queue data structure.)
sv: Den nya modulen :mod:`heapq` innehåller en implementation av en heap-köalgoritm. En heap är en array-liknande datastruktur som håller objekt i en delvis sorterad ordning så att, för varje index *k*, ``heap[k] <= heap[2*k+1]`` och ``heap[k] <= heap[2*k+2]``. Detta gör att det går snabbt att ta bort det minsta objektet, och att infoga ett nytt objekt samtidigt som heap-egenskapen bibehålls är *O*\ (log *n*). (Se https://xlinux.nist.gov/dads//HTML/priorityque.html för mer information om datastrukturen för prioritetsköer)

source: The :mod:`heapq` module provides :func:`~heapq.heappush` and :func:`~heapq.heappop` functions for adding and removing items while maintaining the heap property on top of some other mutable Python sequence type. Here's an example that uses a Python list::
sv: Modulen :mod:`heapq` tillhandahåller funktionerna :func:`~heapq.heappush` och :func:`~heapq.heappop` för att lägga till och ta bort objekt samtidigt som heap-egenskapen bibehålls ovanpå någon annan föränderlig Python-sekvenstyp. Här är ett exempel som använder en Python-lista::

source: >>> import heapq >>> heap = [] >>> for item in [3, 7, 5, 11, 1]: ... heapq.heappush(heap, item) ... >>> heap [1, 3, 5, 11, 7] >>> heapq.heappop(heap) 1 >>> heapq.heappop(heap) 3 >>> heap [5, 7, 11]
sv: >>> import heapq >>> heap = [] >>> för objekt i [3, 7, 5, 11, 1]: ... heapq.heappush(heap, objekt) ... >>> heap [1, 3, 5, 11, 7] >>> heapq.heappop(heap) 1 >>> heapq.heappop(heap) 3 >>> heap [5, 7, 11]

source: (Contributed by Kevin O'Connor.)
sv: (Bidrag från Kevin O'Connor.)

source: The IDLE integrated development environment has been updated using the code from the IDLEfork project (https://idlefork.sourceforge.net). The most notable feature is that the code being developed is now executed in a subprocess, meaning that there's no longer any need for manual ``reload()`` operations. IDLE's core code has been incorporated into the standard library as the :mod:`idlelib` package.
sv: Den integrerade utvecklingsmiljön IDLE har uppdaterats med hjälp av koden från IDLEfork-projektet (https://idlefork.sourceforge.net). Den mest anmärkningsvärda funktionen är att koden som utvecklas nu körs i en underprocess, vilket innebär att det inte längre finns något behov av manuella ``reload()``-operationer. IDLE:s kärnkod har införlivats i standardbiblioteket som paketet :mod:`idlelib`.

source: The :mod:`imaplib` module now supports IMAP over SSL. (Contributed by Piers Lauder and Tino Lange.)
sv: Modulen :mod:`imaplib` har nu stöd för IMAP över SSL. (Bidrag från Piers Lauder och Tino Lange.)

source: The :mod:`itertools` contains a number of useful functions for use with iterators, inspired by various functions provided by the ML and Haskell languages. For example, ``itertools.ifilter(predicate, iterator)`` returns all elements in the iterator for which the function :func:`!predicate` returns :const:`True`, and ``itertools.repeat(obj, N)`` returns ``obj`` *N* times. There are a number of other functions in the module; see the package's reference documentation for details. (Contributed by Raymond Hettinger.)
sv: :mod:`itertools` innehåller ett antal användbara funktioner för användning med iteratorer, inspirerade av olika funktioner som tillhandahålls av språken ML och Haskell. Till exempel returnerar ``itertools.ifilter(predicate, iterator)`` alla element i iteratorn för vilka funktionen :func:`!predicate` returnerar :const:`True`, och ``itertools.repeat(obj, N)`` returnerar ``obj`` *N* gånger. Det finns ett antal andra funktioner i modulen; se paketets referensdokumentation för detaljer. (Bidrag från Raymond Hettinger.)

source: Two new functions in the :mod:`math` module, ``degrees(rads)`` and ``radians(degs)``, convert between radians and degrees. Other functions in the :mod:`math` module such as :func:`math.sin` and :func:`math.cos` have always required input values measured in radians. Also, an optional *base* argument was added to :func:`math.log` to make it easier to compute logarithms for bases other than ``e`` and ``10``. (Contributed by Raymond Hettinger.)
sv: Två nya funktioner i modulen :mod:`math`, ``degrees(rads)`` och ``radians(degs)``, konverterar mellan radianer och grader. Andra funktioner i modulen :mod:`math`, t.ex. :func:`math.sin` och :func:`math.cos`, har alltid krävt ingångsvärden som mätts i radianer. Dessutom lades ett valfritt *base*-argument till i :func:`math.log` för att göra det enklare att beräkna logaritmer för andra baser än ``e`` och ``10``. (Bidrag från Raymond Hettinger.)

source: Several new POSIX functions (:func:`!getpgid`, :func:`!killpg`, :func:`!lchown`, :func:`!loadavg`, :func:`!major`, :func:`!makedev`, :func:`!minor`, and :func:`!mknod`) were added to the :mod:`posix` module that underlies the :mod:`os` module. (Contributed by Gustavo Niemeyer, Geert Jansen, and Denis S. Otkidach.)
sv: Flera nya POSIX-funktioner (:func:`!getpgid`, :func:`!killpg`, :func:`!lchown`, :func:`!loadavg`, :func:`!major`, :func:`!makedev`, :func:`!minor` och :func:`!mknod`) har lagts till i modulen :mod:`posix` som ligger till grund för modulen :mod:`os`. (Bidrag från Gustavo Niemeyer, Geert Jansen och Denis S. Otkidach)

source: In the :mod:`os` module, the :func:`!\*stat` family of functions can now report fractions of a second in a timestamp. Such time stamps are represented as floats, similar to the value returned by :func:`time.time`.
sv: I modulen :mod:`os` kan funktionerna i :func:`!\*stat`-familjen nu rapportera bråkdelar av en sekund i en tidsstämpel. Sådana tidsstämplar representeras som flyttal, liknande det värde som returneras av :func:`time.time`.

source: During testing, it was found that some applications will break if time stamps are floats. For compatibility, when using the tuple interface of the :class:`~os.stat_result` time stamps will be represented as integers. When using named fields (a feature first introduced in Python 2.2), time stamps are still represented as integers, unless :func:`!os.stat_float_times` is invoked to enable float return values::
sv: Under testningen upptäcktes att vissa program inte fungerar om tidsstämplarna är flyttal. För kompatibilitet, när du använder tuple-gränssnittet i :class:`~os.stat_result` kommer tidsstämplar att representeras som heltal. Vid användning av namngivna fält (en funktion som först introducerades i Python 2.2) representeras tidsstämplar fortfarande som heltal, såvida inte :func:`!os.stat_float_times` anropas för att aktivera returvärden med flyttal::

source: In Python 2.4, the default will change to always returning floats.
sv: I Python 2.4 kommer standardinställningen att ändras till att alltid returnera floats.

source: Application developers should enable this feature only if all their libraries work properly when confronted with floating-point time stamps, or if they use the tuple API. If used, the feature should be activated on an application level instead of trying to enable it on a per-use basis.
sv: Programutvecklare bör endast aktivera den här funktionen om alla deras bibliotek fungerar korrekt när de konfronteras med tidsstämplar med flyttal eller om de använder tuple-API:et. Om funktionen används bör den aktiveras på applikationsnivå istället för att försöka aktivera den för varje enskild användning.

source: The :mod:`optparse` module contains a new parser for command-line arguments that can convert option values to a particular Python type and will automatically generate a usage message. See the following section for more details.
sv: Modulen :mod:`optparse` innehåller en ny analysator för kommandoradsargument som kan konvertera alternativvärden till en viss Python-typ och automatiskt generera ett användningsmeddelande. Se följande avsnitt för mer information.

source: The old and never-documented :mod:`!linuxaudiodev` module has been deprecated, and a new version named :mod:`!ossaudiodev` has been added. The module was renamed because the OSS sound drivers can be used on platforms other than Linux, and the interface has also been tidied and brought up to date in various ways. (Contributed by Greg Ward and Nicholas FitzRoy-Dale.)
sv: Den gamla och aldrig dokumenterade modulen :mod:`!linuxaudiodev` har utgått och en ny version med namnet :mod:`!ossaudiodev` har lagts till. Modulen döptes om eftersom OSS-ljuddrivrutinerna kan användas på andra plattformar än Linux, och gränssnittet har också snyggats till och uppdaterats på olika sätt. (Bidrag från Greg Ward och Nicholas FitzRoy-Dale.)

source: The new :mod:`platform` module contains a number of functions that try to determine various properties of the platform you're running on. There are functions for getting the architecture, CPU type, the Windows OS version, and even the Linux distribution version. (Contributed by Marc-André Lemburg.)
sv: Den nya modulen :mod:`platform` innehåller ett antal funktioner som försöker fastställa olika egenskaper hos den plattform du kör på. Det finns funktioner för att få fram arkitektur, CPU-typ, Windows OS-version och till och med Linux-distributionsversion. (Bidrag från Marc-André Lemburg.)

source: The parser objects provided by the :mod:`pyexpat <xml.parsers.expat>` module can now optionally buffer character data, resulting in fewer calls to your character data handler and therefore faster performance. Setting the parser object's :attr:`~xml.parsers.expat.xmlparser.buffer_text` attribute to :const:`True` will enable buffering.
sv: De parserobjekt som tillhandahålls av modulen :mod:`pyexpat <xml.parsers.expat>` kan nu buffra teckendata, vilket resulterar i färre anrop till din teckendatahanterare och därmed snabbare prestanda. Om parserobjektets attribut :attr:`~xml.parsers.expat.xmlparser.buffer_text` sätts till :const:`True` aktiveras buffring.

source: The ``sample(population, k)`` function was added to the :mod:`random` module. *population* is a sequence or :class:`!xrange` object containing the elements of a population, and :func:`~random.sample` chooses *k* elements from the population without replacing chosen elements. *k* can be any value up to ``len(population)``. For example::
sv: Funktionen ``sample(population, k)`` har lagts till i modulen :mod:`random`. *population* är en sekvens eller ett :class:`!xrange`-objekt som innehåller elementen i en population, och :func:`~random.sample` väljer *k* element från populationen utan att ersätta valda element. *k* kan vara vilket värde som helst upp till ``len(population)``. Till exempel::

source: >>> days = ['Mo', 'Tu', 'We', 'Th', 'Fr', 'St', 'Sn'] >>> random.sample(days, 3) # Choose 3 elements ['St', 'Sn', 'Th'] >>> random.sample(days, 7) # Choose 7 elements ['Tu', 'Th', 'Mo', 'We', 'St', 'Fr', 'Sn'] >>> random.sample(days, 7) # Choose 7 again ['We', 'Mo', 'Sn', 'Fr', 'Tu', 'St', 'Th'] >>> random.sample(days, 8) # Can't choose eight Traceback (most recent call last): File "<stdin>", line 1, in ? File "random.py", line 414, in sample raise ValueError, "sample larger than population" ValueError: sample larger than population >>> random.sample(xrange(1,10000,2), 10) # Choose ten odd nos. under 10000 [3407, 3805, 1505, 7023, 2401, 2267, 9733, 3151, 8083, 9195]
sv: &gt;&gt;&gt; days = ['Mo', 'Tu', 'We', 'Th', 'Fr', 'St', 'Sn'] &gt;&gt;&gt; random sample(3) &gt;&gt;&gt; random.sample(dagar, 3) # Välj 3 element ['St', 'Sn', 'Th'] &gt;&gt;&gt; slumpmässigt.urval(dagar, 7) # Välj 7 element ['Tu', 'Th', 'Mo', 'We', 'St', 'Fr', 'Sn'] &gt;&gt;&gt; random.sample(dagar, 7) # Välj 7 igen ['We', 'Mo', 'Sn', 'Fr', 'Tu', 'St', 'Th'] &gt;&gt;&gt; random.sample(dagar, 8) # Kan inte välja åtta Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i ? Fil "random.py", rad 414, i prov raise ValueError, "urvalet större än populationen" ValueError: urvalet större än populationen &gt;&gt;&gt; slumpmässigt.urval(xintervall(1,10000,2), 10) # Välj tio udda nummer under 10000 [3407, 3805, 1505, 7023, 2401, 2267, 9733, 3151, 8083, 9195]

source: The :mod:`random` module now uses a new algorithm, the Mersenne Twister, implemented in C. It's faster and more extensively studied than the previous algorithm.
sv: Modulen :mod:`random` använder nu en ny algoritm, Mersenne Twister, som är implementerad i C. Den är snabbare och mer välstuderad än den tidigare algoritmen.

source: (All changes contributed by Raymond Hettinger.)
sv: (Alla ändringar har gjorts av Raymond Hettinger.)

source: The :mod:`readline` module also gained a number of new functions: :func:`~readline.get_history_item`, :func:`~readline.get_current_history_length`, and :func:`~readline.redisplay`.
sv: Modulen :mod:`readline` har också fått ett antal nya funktioner: :func:`~readline.get_history_item`, :func:`~readline.get_current_history_length` och :func:`~readline.redisplay`.

source: The :mod:`!rexec` and :mod:`!Bastion` modules have been declared dead, and attempts to import them will fail with a :exc:`RuntimeError`. New-style classes provide new ways to break out of the restricted execution environment provided by :mod:`!rexec`, and no one has interest in fixing them or time to do so. If you have applications using :mod:`!rexec`, rewrite them to use something else.
sv: Modulerna :mod:`!rexec` och :mod:`!Bastion` har dödförklarats och försök att importera dem kommer att misslyckas med ett :exc:`RuntimeError`. Klasser i ny stil ger nya sätt att bryta sig ur den begränsade exekveringsmiljön som :mod:`!rexec` ger, och ingen har intresse av att fixa dem eller tid att göra det. Om du har program som använder :mod:`!rexec`, skriv om dem så att de använder något annat.

source: (Sticking with Python 2.2 or 2.1 will not make your applications any safer because there are known bugs in the :mod:`!rexec` module in those versions. To repeat: if you're using :mod:`!rexec`, stop using it immediately.)
sv: (Att hålla sig till Python 2.2 eller 2.1 kommer inte att göra dina applikationer säkrare eftersom det finns kända buggar i modulen :mod:`!rexec` i dessa versioner. För att upprepa: om du använder :mod:`!rexec`, sluta använda den omedelbart)

source: The :mod:`!rotor` module has been deprecated because the algorithm it uses for encryption is not believed to be secure. If you need encryption, use one of the several AES Python modules that are available separately.
sv: Modulen :mod:`!rotor` har utgått eftersom den algoritm som används för kryptering inte anses vara säker. Om du behöver kryptering, använd en av de många AES Python-moduler som finns tillgängliga separat.

source: The :mod:`shutil` module gained a ``move(src, dest)`` function that recursively moves a file or directory to a new location.
sv: Modulen :mod:`shutil` har utökats med funktionen ``move(src, dest)`` som rekursivt flyttar en fil eller katalog till en ny plats.

source: Support for more advanced POSIX signal handling was added to the :mod:`signal` but then removed again as it proved impossible to make it work reliably across platforms.
sv: Stöd för mer avancerad POSIX-signalhantering lades till i :mod:`signal` men togs sedan bort igen eftersom det visade sig omöjligt att få det att fungera tillförlitligt på olika plattformar.

source: The :mod:`socket` module now supports timeouts. You can call the ``settimeout(t)`` method on a socket object to set a timeout of *t* seconds. Subsequent socket operations that take longer than *t* seconds to complete will abort and raise a :exc:`socket.timeout` exception.
sv: Modulen :mod:`socket` har nu stöd för timeouts. Du kan anropa metoden ``settimeout(t)`` på ett socket-objekt för att ställa in en timeout på *t* sekunder. Efterföljande socket-operationer som tar längre tid än *t* sekunder att slutföra kommer att avbrytas och ge upphov till ett :exc:`socket.timeout`-undantag.

source: The original timeout implementation was by Tim O'Malley. Michael Gilfix integrated it into the Python :mod:`socket` module and shepherded it through a lengthy review. After the code was checked in, Guido van Rossum rewrote parts of it. (This is a good example of a collaborative development process in action.)
sv: Den ursprungliga implementeringen av timeout gjordes av Tim O'Malley. Michael Gilfix integrerade den i Python :mod:`socket`-modulen och ledde den genom en lång granskning. Efter att koden hade checkats in skrev Guido van Rossum om delar av den. (Detta är ett bra exempel på en utvecklingsprocess som bygger på samarbete)

source: On Windows, the :mod:`socket` module now ships with Secure Sockets Layer (SSL) support.
sv: På Windows levereras nu modulen :mod:`socket` med stöd för SSL (Secure Sockets Layer).

source: The value of the C :c:macro:`!PYTHON_API_VERSION` macro is now exposed at the Python level as ``sys.api_version``. The current exception can be cleared by calling the new :func:`!sys.exc_clear` function.
sv: Värdet på C :c:macro:`!PYTHON_API_VERSION`-makrot är nu exponerat på Python-nivå som ``sys.api_version``. Det aktuella undantaget kan rensas genom att anropa den nya :func:`!sys.exc_clear`-funktionen.

source: The new :mod:`tarfile` module allows reading from and writing to :program:`tar`\ -format archive files. (Contributed by Lars Gustäbel.)
sv: Den nya modulen :mod:`tarfile` gör det möjligt att läsa från och skriva till arkivfiler i formatet :program:`tar`. (Bidrag från Lars Gustäbel.)

source: The new :mod:`textwrap` module contains functions for wrapping strings containing paragraphs of text. The ``wrap(text, width)`` function takes a string and returns a list containing the text split into lines of no more than the chosen width. The ``fill(text, width)`` function returns a single string, reformatted to fit into lines no longer than the chosen width. (As you can guess, :func:`~textwrap.fill` is built on top of :func:`~textwrap.wrap`. For example::
sv: Den nya modulen :mod:`textwrap` innehåller funktioner för ombrytning av strängar som innehåller textstycken. Funktionen ``wrap(text, width)`` tar en sträng och returnerar en lista som innehåller texten uppdelad i rader med högst den valda bredden. Funktionen ``fill(text, width)`` returnerar en enda sträng, omformaterad för att passa in i rader som inte är längre än den valda bredden. (Som du kan gissa bygger :func:`~textwrap.fill` på :func:`~textwrap.wrap`. Till exempel::

source: >>> import textwrap >>> paragraph = "Not a whit, we defy augury: ... more text ..." >>> textwrap.wrap(paragraph, 60) ["Not a whit, we defy augury: there's a special providence in", "the fall of a sparrow. If it be now, 'tis not to come; if it", ...] >>> print textwrap.fill(paragraph, 35) Not a whit, we defy augury: there's a special providence in the fall of a sparrow. If it be now, 'tis not to come; if it be not to come, it will be now; if it be not now, yet it will come: the readiness is all. >>>
sv: >>> import textwrap >>> stycke = "Inte ett dugg, vi trotsar spådomen: ... mer text ..." >>> textwrap.wrap(stycke, 60) ["Inte ett dugg, vi trotsar augurun: det finns en speciell försyn i", "en sparvs fall. Om det är nu, är det inte att komma; om det", ...] >>> print textwrap.fill(stycke, 35) Inte en whit, vi trotsar augury: det finns en speciell försyn i fallet av en sparv. Om det är nu, är det inte att komma; om det inte är att komma, det kommer det att vara nu; om det inte är nu, ändå kommer det att komma: beredskapen är allt. >>>

source: The module also contains a :class:`~textwrap.TextWrapper` class that actually implements the text wrapping strategy. Both the :class:`~textwrap.TextWrapper` class and the :func:`~textwrap.wrap` and :func:`~textwrap.fill` functions support a number of additional keyword arguments for fine-tuning the formatting; consult the module's documentation for details. (Contributed by Greg Ward.)
sv: Modulen innehåller också en :class:`~textwrap.TextWrapper`-klass som faktiskt implementerar textombrytningsstrategin. Både klassen :class:`~textwrap.TextWrapper` och funktionerna :func:`~textwrap.wrap` och :func:`~textwrap.fill` stöder ett antal ytterligare nyckelordsargument för att finjustera formateringen; se modulens dokumentation för mer information. (Bidrag från Greg Ward.)
