Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: The :mod:`!thread` and :mod:`threading` modules now have companion modules, :mod:`!dummy_thread` and :mod:`!dummy_threading`, that provide a do-nothing implementation of the :mod:`!thread` module's interface for platforms where threads are not supported. The intention is to simplify thread-aware modules (ones that *don't* rely on threads to run) by putting the following code at the top::
sv: Modulerna :mod:`!thread` och :mod:`threading` har nu följeslagarmoduler, :mod:`!dummy_thread` och :mod:`!dummy_threading`, som ger en "do-nothing"-implementering av :mod:`!thread"-modulens gränssnitt för plattformar där trådar inte stöds. Avsikten är att förenkla trådmedvetna moduler (sådana som *inte* förlitar sig på trådar för att köras) genom att lägga följande kod högst upp::

source: In this example, :mod:`!_threading` is used as the module name to make it clear that the module being used is not necessarily the actual :mod:`threading` module. Code can call functions and use classes in :mod:`!_threading` whether or not threads are supported, avoiding an :keyword:`if` statement and making the code slightly clearer. This module will not magically make multithreaded code run without threads; code that waits for another thread to return or to do something will simply hang forever.
sv: I det här exemplet används :mod:`!_threading` som modulnamn för att klargöra att den modul som används inte nödvändigtvis är den faktiska modulen :mod:`threading`. Kod kan anropa funktioner och använda klasser i :mod:`!_threading` oavsett om trådar stöds eller inte, vilket undviker ett :keyword:`if`-slutsats och gör koden något tydligare. Den här modulen kommer inte på något magiskt sätt att få flertrådad kod att köras utan trådar; kod som väntar på att en annan tråd ska återvända eller göra något kommer helt enkelt att hänga sig för evigt.

source: The :mod:`time` module's :func:`~time.strptime` function has long been an annoyance because it uses the platform C library's :func:`~time.strptime` implementation, and different platforms sometimes have odd bugs. Brett Cannon contributed a portable implementation that's written in pure Python and should behave identically on all platforms.
sv: Modulen :mod:`time`:s funktion :func:`~time.strptime` har länge varit ett irritationsmoment eftersom den använder plattform C-bibliotekets implementation :func:`~time.strptime`, och olika plattformar har ibland udda buggar. Brett Cannon bidrog med en portabel implementation som är skriven i ren Python och som bör bete sig identiskt på alla plattformar.

source: The new :mod:`timeit` module helps measure how long snippets of Python code take to execute. The :file:`timeit.py` file can be run directly from the command line, or the module's :class:`~timeit.Timer` class can be imported and used directly. Here's a short example that figures out whether it's faster to convert an 8-bit string to Unicode by appending an empty Unicode string to it or by using the :func:`!unicode` function::
sv: Den nya modulen :mod:`timeit` hjälper till att mäta hur lång tid det tar att exekvera bitar av Python-kod. Filen :file:`timeit.py` kan köras direkt från kommandoraden, eller så kan modulens klass :class:`~timeit.Timer` importeras och användas direkt. Här är ett kort exempel som räknar ut om det är snabbare att konvertera en 8-bitars sträng till Unicode genom att lägga till en tom Unicode-sträng till den eller genom att använda funktionen :func:`!unicode`::

source: The :mod:`!Tix` module has received various bug fixes and updates for the current version of the Tix package.
sv: Modulen :mod:`!Tix` har fått olika buggfixar och uppdateringar för den aktuella versionen av Tix-paketet.

source: The :mod:`!Tkinter` module now works with a thread-enabled version of Tcl. Tcl's threading model requires that widgets only be accessed from the thread in which they're created; accesses from another thread can cause Tcl to panic. For certain Tcl interfaces, :mod:`!Tkinter` will now automatically avoid this when a widget is accessed from a different thread by marshalling a command, passing it to the correct thread, and waiting for the results. Other interfaces can't be handled automatically but :mod:`!Tkinter` will now raise an exception on such an access so that you can at least find out about the problem. See https://mail.python.org/pipermail/python-dev/2002-December/031107.html for a more detailed explanation of this change. (Implemented by Martin von Löwis.)
sv: Modulen :mod:`!Tkinter` fungerar nu med en trådaktiverad version av Tcl. Tcl:s trådmodell kräver att widgetar endast kan nås från den tråd i vilken de skapades; åtkomst från en annan tråd kan orsaka panik i Tcl. För vissa Tcl-gränssnitt kommer :mod:`!Tkinter` nu automatiskt att undvika detta när en widget nås från en annan tråd genom att marshalla ett kommando, skicka det till rätt tråd och vänta på resultatet. Andra gränssnitt kan inte hanteras automatiskt men :mod:`!Tkinter` kommer nu att ge upphov till ett undantag vid sådan åtkomst så att du åtminstone kan ta reda på problemet. Se https://mail.python.org/pipermail/python-dev/2002-December/031107.html för en mer detaljerad förklaring av denna förändring. (Implementerad av Martin von Löwis.)

source: Calling Tcl methods through :mod:`!_tkinter` no longer returns only strings. Instead, if Tcl returns other objects those objects are converted to their Python equivalent, if one exists, or wrapped with a :class:`!_tkinter.Tcl_Obj` object if no Python equivalent exists. This behavior can be controlled through the :meth:`!wantobjects` method of :class:`!tkapp` objects.
sv: Anrop av Tcl-metoder via :mod:`!_tkinter` returnerar inte längre bara strängar. Istället, om Tcl returnerar andra objekt konverteras dessa objekt till sin Python-ekvivalent, om en sådan finns, eller omsluts med ett :class:`!_tkinter.Tcl_Obj`-objekt om ingen Python-ekvivalent finns. Detta beteende kan kontrolleras genom metoden :meth:`!wantobjects` för :class:`!tkapp`-objekt.

source: When using :mod:`!_tkinter` through the :mod:`!Tkinter` module (as most Tkinter applications will), this feature is always activated. It should not cause compatibility problems, since Tkinter would always convert string results to Python types where possible.
sv: När :mod:`!_tkinter` används genom modulen :mod:`!Tkinter` (vilket de flesta Tkinter-applikationer gör), är den här funktionen alltid aktiverad. Det bör inte orsaka kompatibilitetsproblem, eftersom Tkinter alltid konverterar strängresultat till Python-typer där det är möjligt.

source: If any incompatibilities are found, the old behavior can be restored by setting the :attr:`!wantobjects` variable in the :mod:`!Tkinter` module to false before creating the first :class:`!tkapp` object. ::
sv: Om några inkompatibiliteter upptäcks kan det gamla beteendet återställas genom att variabeln :attr:`!wantobjects` i modulen :mod:`!Tkinter` sätts till false innan det första objektet :class:`!tkapp` skapas. ::

source: Any breakage caused by this change should be reported as a bug.
sv: Eventuella avbrott som orsakas av denna ändring ska rapporteras som en bugg.

source: The :mod:`!UserDict` module has a new :class:`!DictMixin` class which defines all dictionary methods for classes that already have a minimum mapping interface. This greatly simplifies writing classes that need to be substitutable for dictionaries, such as the classes in the :mod:`shelve` module.
sv: Modulen :mod:`!UserDict` har en ny klass :class:`!DictMixin` som definierar alla ordboksmetoder för klasser som redan har ett minimalt mappningsgränssnitt. Detta förenklar avsevärt skrivandet av klasser som behöver vara utbytbara mot ordböcker, såsom klasserna i modulen :mod:`shelve`.

source: Adding the mix-in as a superclass provides the full dictionary interface whenever the class defines :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__`, and :meth:`!keys`. For example::
sv: Om du lägger till mix-in som en superklass får du det fullständiga ordboksgränssnittet när klassen definierar :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` och :meth:`!keys`. Till exempel::

source: >>> import UserDict >>> class SeqDict(UserDict.DictMixin): ... """Dictionary lookalike implemented with lists.""" ... def __init__(self): ... self.keylist = [] ... self.valuelist = [] ... def __getitem__(self, key): ... try: ... i = self.keylist.index(key) ... except ValueError: ... raise KeyError ... return self.valuelist[i] ... def __setitem__(self, key, value): ... try: ... i = self.keylist.index(key) ... self.valuelist[i] = value ... except ValueError: ... self.keylist.append(key) ... self.valuelist.append(value) ... def __delitem__(self, key): ... try: ... i = self.keylist.index(key) ... except ValueError: ... raise KeyError ... self.keylist.pop(i) ... self.valuelist.pop(i) ... def keys(self): ... return list(self.keylist) ... >>> s = SeqDict() >>> dir(s) # See that other dictionary methods are implemented ['__cmp__', '__contains__', '__delitem__', '__doc__', '__getitem__', '__init__', '__iter__', '__len__', '__module__', '__repr__', '__setitem__', 'clear', 'get', 'has_key', 'items', 'iteritems', 'iterkeys', 'itervalues', 'keylist', 'keys', 'pop', 'popitem', 'setdefault', 'update', 'valuelist', 'values']
sv: >>> import UserDict >>> klass SeqDict(UserDict.DictMixin): ... """Dictionary lookalike implementerad med listor.""" ... def __init__(self): ... self.keylist = [] ... self.valuelist = [] ... def __getitem__(self, key): ... försök: ... i = self.keylist.index(nyckel) ... except ValueError: ... raise KeyError ... return self.valuelist[i] ... def __setitem__(self, nyckel, värde): ... try: ... i = self.keylist.index(nyckel) ... self.valuelist[i] = värde ... utom ValueError: ... self.keylist.append(nyckel) ... self.valuelist.append(värde) ... def __delitem__(self, key): ... försök: ... i = self.keylist.index(nyckel) ... except ValueError: ... raise KeyError ... self.keylist.pop(i) ... self.valuelist.pop(i) ... def keys(self): ... return list(self.keylist) ... >>> s = SeqDict() >>> dir(s) # Se till att andra ordboksmetoder är implementerade ['__cmp__', '__contains__', '__delitem__', '__doc__', '__getitem__', "__init__", "__iter__", "__len__", "__module__", "__repr__", '__setitem__', 'clear', 'get', 'has_key', 'items', 'iteritems', 'iterkeys', 'iterkeys 'iterkeys', 'itervalues', 'keylist', 'keys', 'pop', 'popitem', 'setdefault', 'update', 'valuelist', 'värden']

source: (Contributed by Raymond Hettinger.)
sv: (Bidrag från Raymond Hettinger.)

source: The DOM implementation in :mod:`xml.dom.minidom` can now generate XML output in a particular encoding by providing an optional encoding argument to the :meth:`~xml.dom.minidom.Node.toxml` and :meth:`~xml.dom.minidom.Node.toprettyxml` methods of DOM nodes.
sv: DOM-implementationen i :mod:`xml.dom.minidom` kan nu generera XML-utdata i en viss kodning genom att tillhandahålla ett valfritt kodningsargument till metoderna :meth:`~xml.dom.minidom.Node.toxml` och :meth:`~xml.dom.minidom.Node.toprettyxml` för DOM-noder.

source: The :mod:`!xmlrpclib` module now supports an XML-RPC extension for handling nil data values such as Python's ``None``. Nil values are always supported on unmarshalling an XML-RPC response. To generate requests containing ``None``, you must supply a true value for the *allow_none* parameter when creating a :class:`!Marshaller` instance.
sv: Modulen :mod:`!xmlrpclib` har nu stöd för ett XML-RPC-tillägg för hantering av nil-datavärden, t.ex. Pythons ``None``. Nil-värden stöds alltid vid unmarshalling av ett XML-RPC-svar. För att generera begäranden som innehåller ``None`` måste du ange ett true-värde för parametern *allow_none* när du skapar en :class:`!Marshaller`-instans.

source: The new :mod:`!DocXMLRPCServer` module allows writing self-documenting XML-RPC servers. Run it in demo mode (as a program) to see it in action. Pointing the web browser to the RPC server produces pydoc-style documentation; pointing xmlrpclib to the server allows invoking the actual methods. (Contributed by Brian Quinlan.)
sv: Den nya :mod:`!DocXMLRPCServer`-modulen gör det möjligt att skriva självdokumenterande XML-RPC-servrar. Kör den i demoläge (som ett program) för att se hur den fungerar. Genom att peka webbläsaren mot RPC-servern produceras dokumentation i pydoc-stil; genom att peka xmlrpclib mot servern kan man anropa de faktiska metoderna. (Bidrag från Brian Quinlan.)

source: Support for internationalized domain names (RFCs 3454, 3490, 3491, and 3492) has been added. The "idna" encoding can be used to convert between a Unicode domain name and the ASCII-compatible encoding (ACE) of that name. ::
sv: Stöd för internationaliserade domännamn (RFC 3454, 3490, 3491 och 3492) har lagts till. Kodningen "idna" kan användas för att konvertera mellan ett Unicode-domännamn och den ASCII-kompatibla kodningen (ACE) av det namnet. ::

source: The :mod:`socket` module has also been extended to transparently convert Unicode hostnames to the ACE version before passing them to the C library. Modules that deal with hostnames such as :mod:`!httplib` and :mod:`ftplib`) also support Unicode host names; :mod:`!httplib` also sends HTTP ``Host`` headers using the ACE version of the domain name. :mod:`urllib` supports Unicode URLs with non-ASCII host names as long as the ``path`` part of the URL is ASCII only.
sv: Modulen :mod:`socket` har också utökats för att på ett transparent sätt konvertera Unicode-värdnamn till ACE-versionen innan de skickas till C-biblioteket. Moduler som hanterar värdnamn såsom :mod:`!httplib` och :mod:`ftplib`) stöder också Unicode-värdnamn; :mod:`!httplib` skickar också HTTP ``Host``-rubriker med ACE-versionen av domännamnet. :mod:`urllib` stöder Unicode-URL:er med icke-ASCII-värdnamn så länge som ``path``-delen av URL:en endast är ASCII.

source: To implement this change, the :mod:`stringprep` module, the ``mkstringprep`` tool and the ``punycode`` encoding have been added.
sv: För att implementera denna ändring har modulen :mod:`stringprep`, verktyget ``mkstringprep`` och kodningen ``punycode`` lagts till.

source: Date/Time Type
sv: Datum/Tid Typ

source: Date and time types suitable for expressing timestamps were added as the :mod:`datetime` module. The types don't support different calendars or many fancy features, and just stick to the basics of representing time.
sv: Datum- och tidstyper som lämpar sig för att uttrycka tidsstämplar har lagts till i modulen :mod:`datetime`. Typerna stöder inte olika kalendrar eller många andra avancerade funktioner, utan håller sig bara till grunderna för att representera tid.

source: The three primary types are: :class:`~datetime.date`, representing a day, month, and year; :class:`~datetime.time`, consisting of hour, minute, and second; and :class:`~datetime.datetime`, which contains all the attributes of both :class:`~datetime.date` and :class:`~datetime.time`. There's also a :class:`~datetime.timedelta` class representing differences between two points in time, and time zone logic is implemented by classes inheriting from the abstract :class:`~datetime.tzinfo` class.
sv: De tre primära typerna är: :class:`~datetime.date`, som representerar en dag, månad och år; :class:`~datetime.time`, som består av timme, minut och sekund; och :class:`~datetime.datetime`, som innehåller alla attribut från både :class:`~datetime.date` och :class:`~datetime.time`. Det finns också en klass :class:`~datetime.timedelta` som representerar skillnader mellan två tidpunkter, och tidszonlogik implementeras av klasser som ärver från den abstrakta klassen :class:`~datetime.tzinfo`.

source: You can create instances of :class:`~datetime.date` and :class:`~datetime.time` by either supplying keyword arguments to the appropriate constructor, e.g. ``datetime.date(year=1972, month=10, day=15)``, or by using one of a number of class methods. For example, the :meth:`~datetime.date.today` class method returns the current local date.
sv: Du kan skapa instanser av :class:`~datetime.date` och :class:`~datetime.time` antingen genom att ange nyckelordsargument till lämplig konstruktör, t.ex. ``datetime.date(year=1972, month=10, day=15)``, eller genom att använda en av ett antal klassmetoder. Exempelvis ger klassmetoden :meth:`~datetime.date.today` det aktuella lokala datumet.

source: Once created, instances of the date/time classes are all immutable. There are a number of methods for producing formatted strings from objects::
sv: När de väl har skapats är alla instanser av date/time-klasserna oföränderliga. Det finns ett antal metoder för att producera formaterade strängar från objekt::

source: >>> import datetime >>> now = datetime.datetime.now() >>> now.isoformat() '2002-12-30T21:27:03.994956' >>> now.ctime() # Only available on date, datetime 'Mon Dec 30 21:27:03 2002' >>> now.strftime('%Y %d %b') '2002 30 Dec'
sv: >>> import datetime >>> nu = datetime.datetime.nu() >>> now.isoformat() '2002-12-30T21:27:03.994956' >>> now.ctime() # Endast tillgänglig på datum, datetime 'Mån 30 dec 21:27:03 2002' >>> now.strftime('%Y %d %b') '2002 30 dec'

source: The :meth:`~datetime.datetime.replace` method allows modifying one or more fields of a :class:`~datetime.date` or :class:`~datetime.datetime` instance, returning a new instance::
sv: Med metoden :meth:`~datetime.datetime.replace` kan du ändra ett eller flera fält i en instans av :class:`~datetime.date` eller :class:`~datetime.datetime` och returnera en ny instans::

source: >>> d = datetime.datetime.now() >>> d datetime.datetime(2002, 12, 30, 22, 15, 38, 827738) >>> d.replace(year=2001, hour = 12) datetime.datetime(2001, 12, 30, 12, 15, 38, 827738) >>>
sv: >>> d = datetime.datetime.now() >>> d datetime.datetime(2002, 12, 30, 22, 15, 38, 827738) >>> d.replace(år=2001, timme = 12) datetime.datetime(2001, 12, 30, 12, 15, 38, 827738) >>>

source: Instances can be compared, hashed, and converted to strings (the result is the same as that of :meth:`~datetime.datetime.isoformat`). :class:`~datetime.date` and :class:`~datetime.datetime` instances can be subtracted from each other, and added to :class:`~datetime.timedelta` instances. The largest missing feature is that there's no standard library support for parsing strings and getting back a :class:`~datetime.date` or :class:`~datetime.datetime`.
sv: Instanser kan jämföras, hashas och konverteras till strängar (resultatet är detsamma som för :meth:`~datetime.datetime.isoformat`). instanser av :class:`~datetime.date` och :class:`~datetime.datetime` kan subtraheras från varandra och adderas till instanser av :class:`~datetime.timedelta`. Den största saknade funktionen är att det inte finns något standardbiblioteksstöd för att analysera strängar och få tillbaka en :class:`~datetime.date` eller :class:`~datetime.datetime`.

source: For more information, refer to the module's reference documentation. (Contributed by Tim Peters.)
sv: För mer information, se modulens referensdokumentation. (Bidrag från Tim Peters.)

source: The optparse Module
sv: Optparse-modulen

source: The :mod:`getopt` module provides simple parsing of command-line arguments. The new :mod:`optparse` module (originally named Optik) provides more elaborate command-line parsing that follows the Unix conventions, automatically creates the output for :option:`!--help`, and can perform different actions for different options.
sv: Modulen :mod:`getopt` ger en enkel analys av kommandoradsargument. Den nya modulen :mod:`optparse` (som ursprungligen hette Optik) ger en mer detaljerad tolkning av kommandoraden som följer Unix-konventionerna, skapar automatiskt utdata för :option:`!--help` och kan utföra olika åtgärder för olika alternativ.

source: You start by creating an instance of :class:`~optparse.OptionParser` and telling it what your program's options are. ::
sv: Du börjar med att skapa en instans av :class:`~optparse.OptionParser` och tala om för den vilka alternativ ditt program har. ::

source: Parsing a command line is then done by calling the :meth:`~optparse.OptionParser.parse_args` method. ::
sv: Parsning av en kommandorad görs sedan genom att anropa metoden :meth:`~optparse.OptionParser.parse_args`. ::

source: options, args = op.parse_args(sys.argv[1:]) print options print args
sv: options, args = op.parse_args(sys.argv[1:]) skriv ut alternativ skriv ut args

source: This returns an object containing all of the option values, and a list of strings containing the remaining arguments.
sv: Detta returnerar ett objekt som innehåller alla alternativvärden och en lista med strängar som innehåller de återstående argumenten.

source: Invoking the script with the various arguments now works as you'd expect it to. Note that the length argument is automatically converted to an integer.
sv: Att anropa skriptet med de olika argumenten fungerar nu som du förväntar dig att det ska göra. Observera att argumentet length automatiskt konverteras till ett heltal.

source: $ ./python opt.py -i data arg1 <Values at 0x400cad4c: {'input': 'data', 'length': None}> ['arg1'] $ ./python opt.py --input=data --length=4 <Values at 0x400cad2c: {'input': 'data', 'length': 4}> [] $
sv: $ ./python opt.py -i data arg1 <Värden vid 0x400cad4c: {'input': 'data', 'length': None}> ['arg1'] $ ./python opt.py --input=data --length=4 <Värden på 0x400cad2c: {'input': 'data', 'length': 4}> [] $

source: The help message is automatically generated for you:
sv: Hjälpmeddelandet genereras automatiskt åt dig:

source: $ ./python opt.py --help usage: opt.py [options] options: -h, --help show this help message and exit -iINPUT, --input=INPUT set input filename -lLENGTH, --length=LENGTH set maximum length of output $
sv: $ ./python opt.py --hjälp användning: opt.py [alternativ] alternativ: -h, --help visa detta hjälpmeddelande och avsluta -iINPUT, --input=INPUT ange filnamn för inmatning -lLENGTH, --längd=LÄNGD anger maximal längd på utdata $

source: See the module's documentation for more details.
sv: Se modulens dokumentation för mer information.

source: Optik was written by Greg Ward, with suggestions from the readers of the Getopt SIG.
sv: Optik har skrivits av Greg Ward, med förslag från läsarna av Getopt SIG.

source: Pymalloc: A Specialized Object Allocator
sv: Pymalloc: En specialiserad objektallokering

source: Pymalloc, a specialized object allocator written by Vladimir Marangozov, was a feature added to Python 2.1. Pymalloc is intended to be faster than the system :c:func:`malloc` and to have less memory overhead for allocation patterns typical of Python programs. The allocator uses C's :c:func:`malloc` function to get large pools of memory and then fulfills smaller memory requests from these pools.
sv: Pymalloc, en specialiserad objektallokator skriven av Vladimir Marangozov, var en funktion som lades till i Python 2.1. Pymalloc är tänkt att vara snabbare än systemets :c:func:`malloc` och att ha mindre minnesoverhead för allokeringsmönster som är typiska för Python-program. Allokatorn använder C:s :c:func:`malloc`-funktion för att få stora minnespooler och uppfyller sedan mindre minnesförfrågningar från dessa pooler.
