Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: Python now has a flexible framework to add different processing strategies. New error handlers can be added with :func:`codecs.register_error`, and codecs then can access the error handler with :func:`codecs.lookup_error`. An equivalent C API has been added for codecs written in C. The error handler gets the necessary state information such as the string being converted, the position in the string where the error was detected, and the target encoding. The handler can then either raise an exception or return a replacement string.
sv: Python har nu ett flexibelt ramverk för att lägga till olika bearbetningsstrategier. Nya felhanterare kan läggas till med :func:`codecs.register_error`, och codecs kan sedan komma åt felhanteraren med :func:`codecs.lookup_error`. Ett motsvarande C-API har lagts till för codecs som är skrivna i C. Felhanteraren får nödvändig statusinformation, t.ex. strängen som konverteras, positionen i strängen där felet upptäcktes och målkodningen. Hanteraren kan sedan antingen skapa ett undantag eller returnera en ersättningssträng.

source: Two additional error handlers have been implemented using this framework: "backslashreplace" uses Python backslash quoting to represent unencodable characters and "xmlcharrefreplace" emits XML character references.
sv: Två ytterligare felhanterare har implementerats med hjälp av detta ramverk: "backslashreplace" använder Pythons backslash-citering för att representera okodbara tecken och "xmlcharrefreplace" skickar ut XML-teckenreferenser.

source: :pep:`293` - Codec Error Handling Callbacks
sv: :pep:`293` - Återkallelser för felhantering av codec

source: Written and implemented by Walter Dörwald.
sv: Skrivet och implementerat av Walter Dörwald.

source: PEP 301: Package Index and Metadata for Distutils
sv: PEP 301: Paketindex och metadata för Distutils

source: Support for the long-requested Python catalog makes its first appearance in 2.3.
sv: Stöd för den sedan länge efterfrågade Python-katalogen finns för första gången i 2.3.

source: The heart of the catalog is the new Distutils :command:`register` command. Running ``python setup.py register`` will collect the metadata describing a package, such as its name, version, maintainer, description, &c., and send it to a central catalog server. The resulting catalog is available from https://pypi.org.
sv: Hjärtat i katalogen är det nya Distutils :command:`register`-kommandot. Genom att köra ``python setup.py register`` samlas de metadata som beskriver ett paket in, t.ex. namn, version, underhållare, beskrivning etc., och skickas till en central katalogserver. Den resulterande katalogen finns tillgänglig från https://pypi.org.

source: To make the catalog a bit more useful, a new optional *classifiers* keyword argument has been added to the Distutils :func:`!setup` function. A list of `Trove <http://catb.org/~esr/trove/>`_-style strings can be supplied to help classify the software.
sv: För att göra katalogen lite mer användbar har ett nytt valfritt *classifiers*-nyckelordsargument lagts till i Distutils :func:`!setup`-funktion. En lista med strängar i stil med `Trove <http://catb.org/~esr/trove/>`_ kan anges för att hjälpa till att klassificera programvaran.

source: Here's an example :file:`setup.py` with classifiers, written to be compatible with older versions of the Distutils::
sv: Här är ett exempel :file:`setup.py` med klassificerare, skriven för att vara kompatibel med äldre versioner av Distutils::

source: from distutils import core kw = {'name': "Quixote", 'version': "0.5.1", 'description': "A highly Pythonic Web application framework", # ... } if (hasattr(core, 'setup_keywords') and 'classifiers' in core.setup_keywords): kw['classifiers'] = \ ['Topic :: Internet :: WWW/HTTP :: Dynamic Content', 'Environment :: No Input/Output (Daemon)', 'Intended Audience :: Developers'], core.setup(**kw)
sv: från distutils import core kw = {'namn': "Quixote", 'version': "0.5.1", 'description': "Ett mycket pythoniskt ramverk för webbapplikationer", # ... } if (hasattr(core, 'setup_keywords') och "classifiers" i core.setup_keywords): kw['classifiers'] = \ ['Ämne :: Internet :: WWW/HTTP :: Dynamic Content', "Miljö :: Ingen inmatning/utmatning (Daemon)", 'Avsedd målgrupp :: Utvecklare'], core.setup(**kw)

source: The full list of classifiers can be obtained by running ``python setup.py register --list-classifiers``.
sv: Den fullständiga listan över klassificerare kan erhållas genom att köra ``python setup.py register --list-classifiers``.

source: :pep:`301` - Package Index and Metadata for Distutils
sv: :pep:`301` - Paketindex och metadata för Distutils

source: Written and implemented by Richard Jones.
sv: Skrivet och implementerat av Richard Jones.

source: PEP 302: New Import Hooks
sv: PEP 302: Nya importkrokar

source: While it's been possible to write custom import hooks ever since the :mod:`!ihooks` module was introduced in Python 1.3, no one has ever been really happy with it because writing new import hooks is difficult and messy. There have been various proposed alternatives such as the :mod:`!imputil` and :mod:`!iu` modules, but none of them has ever gained much acceptance, and none of them were easily usable from C code.
sv: Även om det har varit möjligt att skriva egna importkrokar ända sedan modulen :mod:`!ihooks` introducerades i Python 1.3, har ingen någonsin varit riktigt nöjd med det eftersom det är svårt och rörigt att skriva nya importkrokar. Det har funnits olika föreslagna alternativ som modulerna :mod:`!imputil` och :mod:`!iu`, men ingen av dem har någonsin fått någon större acceptans, och ingen av dem var lätt att använda från C-kod.

source: :pep:`302` borrows ideas from its predecessors, especially from Gordon McMillan's :mod:`!iu` module. Three new items are added to the :mod:`sys` module:
sv: :pep:`302` lånar idéer från sina föregångare, särskilt från Gordon McMillans modul :mod:`!iu`. Tre nya objekt har lagts till i modulen :mod:`sys`:

source: ``sys.path_hooks`` is a list of callable objects; most often they'll be classes. Each callable takes a string containing a path and either returns an importer object that will handle imports from this path or raises an :exc:`ImportError` exception if it can't handle this path.
sv: ```sys.path_hooks`` är en lista över anropsbara objekt; oftast är de klasser. Varje anropbart objekt tar en sträng som innehåller en sökväg och returnerar antingen ett importobjekt som hanterar import från denna sökväg eller ger upphov till ett :exc:`ImportError`-undantag om det inte kan hantera denna sökväg.

source: ``sys.path_importer_cache`` caches importer objects for each path, so ``sys.path_hooks`` will only need to be traversed once for each path.
sv: ``sys.path_importer_cache`` cachelagrar importobjekt för varje sökväg, så ``sys.path_hooks`` behöver bara passeras en gång för varje sökväg.

source: ``sys.meta_path`` is a list of importer objects that will be traversed before ``sys.path`` is checked. This list is initially empty, but user code can add objects to it. Additional built-in and frozen modules can be imported by an object added to this list.
sv: ```sys.meta_path`` är en lista över importerarobjekt som kommer att genomkorsas innan ``sys.path`` kontrolleras. Den här listan är från början tom, men användarkod kan lägga till objekt i den. Ytterligare inbyggda och frysta moduler kan importeras av ett objekt som läggs till i den här listan.

source: Importer objects must have a single method, ``find_module(fullname, path=None)``. *fullname* will be a module or package name, e.g. ``string`` or ``distutils.core``. :meth:`!find_module` must return a loader object that has a single method, ``load_module(fullname)``, that creates and returns the corresponding module object.
sv: Importörobjekt måste ha en enda metod, ``find_module(fullname, path=None)``. *fullname* kommer att vara ett modul- eller paketnamn, t.ex. ``string`` eller ``distutils.core``. :meth:`!find_module` måste returnera ett laddningsobjekt som har en enda metod, ``load_module(fullname)``, som skapar och returnerar motsvarande modulobjekt.

source: Pseudo-code for Python's new import logic, therefore, looks something like this (simplified a bit; see :pep:`302` for the full details)::
sv: Pseudokoden för Pythons nya importlogik ser därför ut ungefär så här (lite förenklat; se :pep:`302` för fullständiga detaljer)::

source: for mp in sys.meta_path: loader = mp(fullname) if loader is not None: <module> = loader.load_module(fullname) for path in sys.path: for hook in sys.path_hooks: try: importer = hook(path) except ImportError: # ImportError, so try the other path hooks pass else: loader = importer.find_module(fullname) <module> = loader.load_module(fullname) # Not found! raise ImportError
sv: för mp i sys.meta_path: loader = mp(fullständigt namn) om loader inte är None: <module> = loader.load_module(fullname) for path in sys.path: för hook i sys.path_hooks: försök: importer = krok(sökväg) except ImportError: # ImportError, så prova de andra sökvägskrokarna passera else: loader = importer.find_module(fullname) <module> = loader.load_module(fullständigt namn) # Hittades inte! höja ImportError

source: :pep:`302` - New Import Hooks
sv: :pep:`302` - Nya importkrokar

source: Written by Just van Rossum and Paul Moore. Implemented by Just van Rossum.
sv: Skrivet av Just van Rossum och Paul Moore. Implementerad av Just van Rossum.

source: PEP 305: Comma-separated Files
sv: PEP 305: Kommaseparerade filer

source: Comma-separated files are a format frequently used for exporting data from databases and spreadsheets. Python 2.3 adds a parser for comma-separated files.
sv: Kommaseparerade filer är ett format som ofta används för att exportera data från databaser och kalkylblad. Python 2.3 lägger till en parser för kommaseparerade filer.

source: Comma-separated format is deceptively simple at first glance::
sv: Kommaseparerat format är bedrägligt enkelt vid första anblicken::

source: Costs,150,200,3.95
sv: Kostnader,150,200,3,95

source: Read a line and call ``line.split(',')``: what could be simpler? But toss in string data that can contain commas, and things get more complicated::
sv: Läs en rad och anropa ``line.split(',')``: vad kan vara enklare? Men släng in strängdata som kan innehålla kommatecken, och saker och ting blir mer komplicerade::

source: "Costs",150,200,3.95,"Includes taxes, shipping, and sundry items"
sv: "Kostnader",150,200,3,95,"Inkluderar skatter, frakt och diverse"

source: A big ugly regular expression can parse this, but using the new :mod:`csv` package is much simpler::
sv: Ett stort fult reguljärt uttryck kan analysera detta, men det är mycket enklare att använda det nya :mod:`csv`-paketet::

source: The :func:`~csv.reader` function takes a number of different options. The field separator isn't limited to the comma and can be changed to any character, and so can the quoting and line-ending characters.
sv: Funktionen :func:`~csv.reader` tar emot ett antal olika alternativ. Fältavgränsaren är inte begränsad till kommatecken utan kan ändras till vilket tecken som helst, och det kan även citattecken och radavslutningstecken.

source: Different dialects of comma-separated files can be defined and registered; currently there are two dialects, both used by Microsoft Excel. A separate :class:`csv.writer` class will generate comma-separated files from a succession of tuples or lists, quoting strings that contain the delimiter.
sv: Olika dialekter av kommaseparerade filer kan definieras och registreras; för närvarande finns det två dialekter, som båda används av Microsoft Excel. En separat :class:`csv.writer`-klass genererar kommaseparerade filer från en följd av tupler eller listor, och citerar strängar som innehåller avgränsaren.

source: :pep:`305` - CSV File API
sv: :pep:`305` - API för CSV-filer

source: Written and implemented by Kevin Altis, Dave Cole, Andrew McNamara, Skip Montanaro, Cliff Wells.
sv: Skriven och implementerad av Kevin Altis, Dave Cole, Andrew McNamara, Skip Montanaro, Cliff Wells.

source: PEP 307: Pickle Enhancements
sv: PEP 307: Pickle-förbättringar

source: The :mod:`pickle` and :mod:`!cPickle` modules received some attention during the 2.3 development cycle. In 2.2, new-style classes could be pickled without difficulty, but they weren't pickled very compactly; :pep:`307` quotes a trivial example where a new-style class results in a pickled string three times longer than that for a classic class.
sv: Modulerna :mod:`pickle` och :mod:`!cPickle` fick en del uppmärksamhet under utvecklingscykeln för 2.3. I 2.2 kunde klasser av ny typ picklas utan problem, men de picklades inte särskilt kompakt; :pep:`307` citerar ett trivialt exempel där en klass av ny typ resulterar i en picklad sträng som är tre gånger längre än för en klassisk klass.

source: The solution was to invent a new pickle protocol. The :func:`pickle.dumps` function has supported a text-or-binary flag for a long time. In 2.3, this flag is redefined from a Boolean to an integer: 0 is the old text-mode pickle format, 1 is the old binary format, and now 2 is a new 2.3-specific format. A new constant, :const:`pickle.HIGHEST_PROTOCOL`, can be used to select the fanciest protocol available.
sv: Lösningen var att uppfinna ett nytt pickle-protokoll. Funktionen :func:`pickle.dumps` har länge haft stöd för en text-eller-binärflagga. I 2.3 omdefinieras denna flagga från en boolesk till ett heltal: 0 är det gamla pickle-formatet i textläge, 1 är det gamla binära formatet och nu är 2 ett nytt 2.3-specifikt format. En ny konstant, :const:`pickle.HIGHEST_PROTOCOL`, kan användas för att välja det snyggaste tillgängliga protokollet.

source: Unpickling is no longer considered a safe operation. 2.2's :mod:`pickle` provided hooks for trying to prevent unsafe classes from being unpickled (specifically, a :attr:`!__safe_for_unpickling__` attribute), but none of this code was ever audited and therefore it's all been ripped out in 2.3. You should not unpickle untrusted data in any version of Python.
sv: Unpickling anses inte längre vara en säker operation. 2.2:s :mod:`pickle` tillhandahöll krokar för att försöka förhindra osäkra klasser från att avplockas (specifikt ett :attr:`!__safe_for_unpickling__`-attribut), men ingen av denna kod granskades någonsin och därför har allt tagits bort i 2.3. Du bör inte unpickle otillförlitlig data i någon version av Python.

source: To reduce the pickling overhead for new-style classes, a new interface for customizing pickling was added using three special methods: :meth:`~object.__getstate__`, :meth:`~object.__setstate__`, and :meth:`~object.__getnewargs__`. Consult :pep:`307` for the full semantics of these methods.
sv: För att minska kostnaderna för pickling för klasser av ny typ lades ett nytt gränssnitt till för att anpassa pickling med hjälp av tre specialmetoder: :meth:`~object.__getstate__`, :meth:`~object.__setstate__` och :meth:`~object.__getnewargs__`. Se :pep:`307` för den fullständiga semantiken för dessa metoder.

source: As a way to compress pickles yet further, it's now possible to use integer codes instead of long strings to identify pickled classes. The Python Software Foundation will maintain a list of standardized codes; there's also a range of codes for private use. Currently no codes have been specified.
sv: Som ett sätt att komprimera pickles ytterligare är det nu möjligt att använda heltalskoder istället för långa strängar för att identifiera picklade klasser. Python Software Foundation kommer att upprätthålla en lista med standardiserade koder; det finns också en rad koder för privat bruk. För närvarande har inga koder specificerats.

source: :pep:`307` - Extensions to the pickle protocol
sv: :pep:`307` - Tillägg till pickle-protokollet

source: Written and implemented by Guido van Rossum and Tim Peters.
sv: Skriven och implementerad av Guido van Rossum och Tim Peters.

source: Extended Slices
sv: Förlängda skivor

source: Ever since Python 1.4, the slicing syntax has supported an optional third "step" or "stride" argument. For example, these are all legal Python syntax: ``L[1:10:2]``, ``L[:-1:1]``, ``L[::-1]``. This was added to Python at the request of the developers of Numerical Python, which uses the third argument extensively. However, Python's built-in list, tuple, and string sequence types have never supported this feature, raising a :exc:`TypeError` if you tried it. Michael Hudson contributed a patch to fix this shortcoming.
sv: Ända sedan Python 1.4 har slicing-syntaxen haft stöd för ett valfritt tredje "step"- eller "stride"-argument. Till exempel är dessa alla lagliga Python-syntaxer: ``L[1:10:2]``, ``L[:-1:1]``, ``L[::-1]``. Detta lades till i Python på begäran av utvecklarna av Numerical Python, som använder det tredje argumentet i stor utsträckning. Pythons inbyggda list-, tuple- och strängsequenstyper har dock aldrig haft stöd för den här funktionen, och gav upphov till ett :exc:`TypeError` om man försökte. Michael Hudson bidrog med en patch för att åtgärda denna brist.

source: For example, you can now easily extract the elements of a list that have even indexes::
sv: Till exempel kan du nu enkelt extrahera de element i en lista som har jämna index::

source: >>> L = range(10) >>> L[::2] [0, 2, 4, 6, 8]
sv: >>> L = intervall(10) >>> L[::2] [0, 2, 4, 6, 8]

source: Negative values also work to make a copy of the same list in reverse order::
sv: Negativa värden fungerar också för att göra en kopia av samma lista i omvänd ordning::

source: This also works for tuples, arrays, and strings::
sv: Detta fungerar även för tupler, arrayer och strängar::

source: If you have a mutable sequence such as a list or an array you can assign to or delete an extended slice, but there are some differences between assignment to extended and regular slices. Assignment to a regular slice can be used to change the length of the sequence::
sv: Om du har en föränderlig sekvens, t.ex. en lista eller en array, kan du tilldela eller ta bort en extended slice, men det finns vissa skillnader mellan tilldelning till extended och regular slices. Tilldelning till en vanlig skiva kan användas för att ändra längden på sekvensen::

source: >>> a = range(3) >>> a [0, 1, 2] >>> a[1:3] = [4, 5, 6] >>> a [0, 4, 5, 6]
sv: >>> a = intervall(3) >>> a [0, 1, 2] >>> a[1:3] = [4, 5, 6] >>> a [0, 4, 5, 6]

source: Extended slices aren't this flexible. When assigning to an extended slice, the list on the right hand side of the statement must contain the same number of items as the slice it is replacing::
sv: Extended slices är inte lika flexibla. Vid tilldelning till en utökad slice måste listan på höger sida av uttalandet innehålla samma antal poster som den slice den ersätter::

source: >>> a = range(4) >>> a [0, 1, 2, 3] >>> a[::2] [0, 2] >>> a[::2] = [0, -1] >>> a [0, 1, -1, 3] >>> a[::2] = [0,1,2] Traceback (most recent call last): File "<stdin>", line 1, in ? ValueError: attempt to assign sequence of size 3 to extended slice of size 2
sv: &gt;&gt;&gt; a = intervall(4) &gt;&gt;&gt; a [0, 1, 2, 3] &gt;&gt;&gt; a[::2] [0, 2] &gt;&gt;&gt; a[::2] = [0, -1] &gt;&gt;&gt; a [0, 1, -1, 3] &gt;&gt;&gt; a[::2] = [0,1,2] Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i ? ValueError: försök att tilldela sekvens av storlek 3 till utökad skiva av storlek 2

source: Deletion is more straightforward::
sv: Radering är mer okomplicerat::

source: >>> a = range(4) >>> a [0, 1, 2, 3] >>> a[::2] [0, 2] >>> del a[::2] >>> a [1, 3]
sv: >>> a = intervall(4) >>> a [0, 1, 2, 3] >>> a[::2] [0, 2] >>> del a[::2] >>> a [1, 3]

source: One can also now pass slice objects to the :meth:`~object.__getitem__` methods of the built-in sequences::
sv: Man kan nu också skicka slice-objekt till :meth:`~object.__getitem__`-metoderna i de inbyggda sekvenserna::

source: Or use slice objects directly in subscripts::
sv: Eller använd slice-objekt direkt i subscripts::

source: >>> range(10)[slice(0, 5, 2)] [0, 2, 4]
sv: >>> intervall(10)[slice(0, 5, 2)] [0, 2, 4]

source: To simplify implementing sequences that support extended slicing, slice objects now have a method ``indices(length)`` which, given the length of a sequence, returns a ``(start, stop, step)`` tuple that can be passed directly to :func:`range`. :meth:`!indices` handles omitted and out-of-bounds indices in a manner consistent with regular slices (and this innocuous phrase hides a welter of confusing details!). The method is intended to be used like this::
sv: För att förenkla implementeringen av sekvenser som stöder utökad skivning har slice-objekt nu en metod ``indices(length)`` som, givet längden på en sekvens, returnerar en ``(start, stop, step)``-tupel som kan skickas direkt till :func:`range`. :meth:`!indices` hanterar utelämnade och obegränsade index på ett sätt som överensstämmer med vanliga slices (och denna oskyldiga fras döljer en mängd förvirrande detaljer!) Metoden är avsedd att användas så här::

source: class FakeSeq: ... def calc_item(self, i): ... def __getitem__(self, item): if isinstance(item, slice): indices = item.indices(len(self)) return FakeSeq([self.calc_item(i) for i in range(*indices)]) else: return self.calc_item(i)
sv: klass FakeSeq: ... def calc_item(self, i): ... def __getitem__(self, item): if isinstance(item, slice): index = objekt.index(len(self)) return FakeSeq([self.calc_item(i) for i in range(*indices)]) annat: return self.calc_item(i)

source: From this example you can also see that the built-in :class:`slice` object is now the type object for the slice type, and is no longer a function. This is consistent with Python 2.2, where :class:`int`, :class:`str`, etc., underwent the same change.
sv: Från detta exempel kan du också se att det inbyggda :class:`slice`-objektet nu är typobjektet för slice-typen och inte längre är en funktion. Detta stämmer överens med Python 2.2, där :class:`int`, :class:`str`, etc. genomgick samma förändring.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Here are all of the changes that Python 2.3 makes to the core Python language.
sv: Här är alla ändringar som Python 2.3 gör i kärnan i Python-språket.

source: The :keyword:`yield` statement is now always a keyword, as described in section :ref:`section-generators` of this document.
sv: Satsen :keyword:`yield` är nu alltid ett nyckelord, enligt beskrivningen i avsnitt :ref:`section-generators` i detta dokument.

source: A new built-in function :func:`enumerate` was added, as described in section :ref:`section-enumerate` of this document.
sv: En ny inbyggd funktion :func:`enumerate` lades till, som beskrivs i avsnitt :ref:`section-enumerate` i detta dokument.

source: Two new constants, :const:`True` and :const:`False` were added along with the built-in :class:`bool` type, as described in section :ref:`section-bool` of this document.
sv: Två nya konstanter, :const:`True` och :const:`False` lades till tillsammans med den inbyggda typen :class:`bool`, enligt beskrivningen i avsnitt :ref:`section-bool` i detta dokument.

source: The :func:`int` type constructor will now return a long integer instead of raising an :exc:`OverflowError` when a string or floating-point number is too large to fit into an integer. This can lead to the paradoxical result that ``isinstance(int(expression), int)`` is false, but that seems unlikely to cause problems in practice.
sv: Typkonstruktören :func:`int` returnerar nu ett långt heltal istället för att ge upphov till ett :exc:`OverflowError` när en sträng eller ett flyttal är för stort för att rymmas i ett heltal. Detta kan leda till det paradoxala resultatet att ``isinstance(int(expression), int)`` är falskt, men det verkar osannolikt att det kommer att orsaka problem i praktiken.
