Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: An entry in ``sys.path`` can now be the filename of a ZIP archive. The ZIP archive can contain any kind of files, but only files named :file:`\*.py`, :file:`\*.pyc`, or :file:`\*.pyo` can be imported. If an archive only contains :file:`\*.py` files, Python will not attempt to modify the archive by adding the corresponding :file:`\*.pyc` file, meaning that if a ZIP archive doesn't contain :file:`\*.pyc` files, importing may be rather slow.
sv: En post i ``sys.path`` kan nu vara filnamnet på ett ZIP-arkiv. ZIP-arkivet kan innehålla alla typer av filer, men endast filer med namnet :file:`\*.py`, :file:`\*.pyc` eller :file:`\*.pyo` kan importeras. Om ett arkiv endast innehåller :file:`\*.py`-filer kommer Python inte att försöka modifiera arkivet genom att lägga till motsvarande :file:`\*.pyc`-fil, vilket innebär att om ett ZIP-arkiv inte innehåller :file:`\*.pyc`-filer kan importen gå ganska långsamt.

source: A path within the archive can also be specified to only import from a subdirectory; for example, the path :file:`/tmp/example.zip/lib/` would only import from the :file:`lib/` subdirectory within the archive.
sv: En sökväg inom arkivet kan också anges för att endast importera från en underkatalog; till exempel skulle sökvägen :file:`/tmp/example.zip/lib/` endast importera från underkatalogen :file:`lib/` inom arkivet.

source: :pep:`273` - Import Modules from Zip Archives
sv: :pep:`273` - Importera moduler från zip-arkiv

source: Written by James C. Ahlstrom, who also provided an implementation. Python 2.3 follows the specification in :pep:`273`, but uses an implementation written by Just van Rossum that uses the import hooks described in :pep:`302`. See section :ref:`section-pep302` for a description of the new import hooks.
sv: Skriven av James C. Ahlstrom, som också tillhandahöll en implementation. Python 2.3 följer specifikationen i :pep:`273`, men använder en implementation skriven av Just van Rossum som använder de importkrokar som beskrivs i :pep:`302`. Se avsnitt :ref:`section-pep302` för en beskrivning av de nya importkrokarna.

source: PEP 277: Unicode file name support for Windows NT
sv: PEP 277: Stöd för Unicode-filnamn i Windows NT

source: On Windows NT, 2000, and XP, the system stores file names as Unicode strings. Traditionally, Python has represented file names as byte strings, which is inadequate because it renders some file names inaccessible.
sv: I Windows NT, 2000 och XP lagrar systemet filnamn som Unicode-strängar. Traditionellt har Python representerat filnamn som bytesträngar, vilket är otillräckligt eftersom det gör vissa filnamn otillgängliga.

source: Python now allows using arbitrary Unicode strings (within the limitations of the file system) for all functions that expect file names, most notably the :func:`open` built-in function. If a Unicode string is passed to :func:`os.listdir`, Python now returns a list of Unicode strings. A new function, :func:`!os.getcwdu`, returns the current directory as a Unicode string.
sv: Python tillåter nu användning av godtyckliga Unicode-strängar (inom filsystemets begränsningar) för alla funktioner som förväntar sig filnamn, framför allt den inbyggda funktionen :func:`open`. Om en Unicode-sträng skickas till :func:`os.listdir` returnerar Python nu en lista med Unicode-strängar. En ny funktion, :func:`!os.getcwdu`, returnerar den aktuella katalogen som en Unicode-sträng.

source: Byte strings still work as file names, and on Windows Python will transparently convert them to Unicode using the ``mbcs`` encoding.
sv: Byte-strängar fungerar fortfarande som filnamn, och på Windows konverterar Python dem transparent till Unicode med hjälp av kodningen ``mbcs``.

source: Other systems also allow Unicode strings as file names but convert them to byte strings before passing them to the system, which can cause a :exc:`UnicodeError` to be raised. Applications can test whether arbitrary Unicode strings are supported as file names by checking :const:`os.path.supports_unicode_filenames`, a Boolean value.
sv: Andra system tillåter också Unicode-strängar som filnamn men konverterar dem till byte-strängar innan de skickas till systemet, vilket kan leda till att ett :exc:`UnicodeError` uppstår. Program kan testa om godtyckliga Unicode-strängar stöds som filnamn genom att kontrollera :const:`os.path.supports_unicode_filenames`, ett booleskt värde.

source: Under MacOS, :func:`os.listdir` may now return Unicode filenames.
sv: Under MacOS kan :func:`os.listdir` nu returnera Unicode-filnamn.

source: :pep:`277` - Unicode file name support for Windows NT
sv: :pep:`277` - Stöd för Unicode-filnamn i Windows NT

source: Written by Neil Hodgson; implemented by Neil Hodgson, Martin von Löwis, and Mark Hammond.
sv: Skriven av Neil Hodgson; implementerad av Neil Hodgson, Martin von Löwis och Mark Hammond.

source: PEP 278: Universal Newline Support
sv: PEP 278: Universellt stöd för nya linjer

source: The three major operating systems used today are Microsoft Windows, Apple's Macintosh OS, and the various Unix derivatives. A minor irritation of cross-platform work is that these three platforms all use different characters to mark the ends of lines in text files. Unix uses the linefeed (ASCII character 10), MacOS uses the carriage return (ASCII character 13), and Windows uses a two-character sequence of a carriage return plus a newline.
sv: De tre största operativsystemen som används idag är Microsoft Windows, Apples Macintosh OS och de olika Unix-derivaten. Ett litet irritationsmoment när man arbetar plattformsoberoende är att de tre plattformarna använder olika tecken för att markera slutet på rader i textfiler. Unix använder linefeed (ASCII-tecken 10), MacOS använder carriage return (ASCII-tecken 13) och Windows använder en sekvens med två tecken, carriage return och en ny rad.

source: Python's file objects can now support end of line conventions other than the one followed by the platform on which Python is running. Opening a file with the mode ``'U'`` or ``'rU'`` will open a file for reading in :term:`universal newlines` mode. All three line ending conventions will be translated to a ``'\n'`` in the strings returned by the various file methods such as :meth:`!read` and :meth:`!readline`.
sv: Pythons filobjekt kan nu stödja andra konventioner för radavslut än den som följs av den plattform som Python körs på. Att öppna en fil med läget ``'U'`` eller ``'rU'`` kommer att öppna en fil för läsning i :term:`universal newlines`-läget. Alla tre radslutskonventionerna kommer att översättas till ``'\n'`` i strängarna som returneras av de olika filmetoderna som :meth:`!read` och :meth:`!readline`.

source: Universal newline support is also used when importing modules and when executing a file with the :func:`!execfile` function. This means that Python modules can be shared between all three operating systems without needing to convert the line-endings.
sv: Universellt stöd för nya rader används också vid import av moduler och när en fil exekveras med funktionen :func:`!execfile`. Detta innebär att Python-moduler kan delas mellan alla tre operativsystemen utan att radavslutningarna behöver konverteras.

source: This feature can be disabled when compiling Python by specifying the :option:`!--without-universal-newlines` switch when running Python's :program:`configure` script.
sv: Denna funktion kan avaktiveras vid kompilering av Python genom att ange :option:`!--without-universal-newlines` när Pythons :program:`configure`-skript körs.

source: :pep:`278` - Universal Newline Support
sv: :pep:`278` - Universellt stöd för nya linjer

source: Written and implemented by Jack Jansen.
sv: Skriven och implementerad av Jack Jansen.

source: A new built-in function, :func:`enumerate`, will make certain loops a bit clearer. ``enumerate(thing)``, where *thing* is either an iterator or a sequence, returns an iterator that will return ``(0, thing[0])``, ``(1, thing[1])``, ``(2, thing[2])``, and so forth.
sv: En ny inbyggd funktion, :func:`enumerate`, kommer att göra vissa loopar lite tydligare. ``enumerate(thing)``, där *thing* är antingen en iterator eller en sekvens, returnerar en iterator som returnerar ``(0, thing[0])``, ``(1, thing[1])``, ``(2, thing[2])``, och så vidare.

source: A common idiom to change every element of a list looks like this::
sv: Ett vanligt idiom för att ändra varje element i en lista ser ut så här::

source: for i in range(len(L)): item = L[i] # ... compute some result based on item ... L[i] = result
sv: for i in range(len(L)): objekt = L[i] # ... beräkna något resultat baserat på item ... L[i] = resultat

source: This can be rewritten using :func:`enumerate` as::
sv: Detta kan skrivas om med hjälp av :func:`enumerate` som::

source: for i, item in enumerate(L): # ... compute some result based on item ... L[i] = result
sv: för i, objekt i enumerate(L): # ... beräkna ett resultat baserat på objektet ... L[i] = resultat

source: :pep:`279` - The enumerate() built-in function
sv: :pep:`279` - Den inbyggda funktionen enumerate()

source: Written and implemented by Raymond D. Hettinger.
sv: Skriven och implementerad av Raymond D. Hettinger.

source: PEP 282: The logging Package
sv: PEP 282: Loggningspaketet

source: A standard package for writing logs, :mod:`logging`, has been added to Python 2.3. It provides a powerful and flexible mechanism for generating logging output which can then be filtered and processed in various ways. A configuration file written in a standard format can be used to control the logging behavior of a program. Python includes handlers that will write log records to standard error or to a file or socket, send them to the system log, or even e-mail them to a particular address; of course, it's also possible to write your own handler classes.
sv: Ett standardpaket för att skriva loggar, :mod:`logging`, har lagts till i Python 2.3. Det ger en kraftfull och flexibel mekanism för att generera loggningsutdata som sedan kan filtreras och bearbetas på olika sätt. En konfigurationsfil skriven i ett standardformat kan användas för att styra loggningsbeteendet i ett program. Python innehåller hanterare som skriver loggposter till standardfel eller till en fil eller socket, skickar dem till systemloggen eller till och med e-postar dem till en viss adress; naturligtvis är det också möjligt att skriva egna hanterarklasser.

source: The :class:`~logging.Logger` class is the primary class. Most application code will deal with one or more :class:`~logging.Logger` objects, each one used by a particular subsystem of the application. Each :class:`~logging.Logger` is identified by a name, and names are organized into a hierarchy using ``.`` as the component separator. For example, you might have :class:`~logging.Logger` instances named ``server``, ``server.auth`` and ``server.network``. The latter two instances are below ``server`` in the hierarchy. This means that if you turn up the verbosity for ``server`` or direct ``server`` messages to a different handler, the changes will also apply to records logged to ``server.auth`` and ``server.network``. There's also a root :class:`~logging.Logger` that's the parent of all other loggers.
sv: Klassen :class:`~logging.Logger` är den primära klassen. Den mesta programkoden kommer att hantera ett eller flera :class:`~logging.Logger`-objekt, som vart och ett används av ett visst delsystem i programmet. Varje :class:`~logging.Logger` identifieras med ett namn, och namnen organiseras i en hierarki med ``.`` som komponentavgränsare. Du kan t.ex. ha :class:`~logging.Logger`-instanser med namnen ``server``, ``server.auth`` och ``server.network``. De två sistnämnda instanserna ligger under ``server`` i hierarkin. Detta innebär att om du ökar ordrikedomen för ``server`` eller riktar ``server``-meddelanden till en annan hanterare, kommer ändringarna också att gälla för poster som loggas till ``server.auth`` och ``server.network``. Det finns också en rot :class:`~logging.Logger` som är överordnad alla andra loggrar.

source: For simple uses, the :mod:`logging` package contains some convenience functions that always use the root log::
sv: För enkla användningsområden innehåller paketet :mod:`logging` några bekvämlighetsfunktioner som alltid använder roten log::

source: This produces the following output::
sv: Detta ger följande utdata::

source: WARNING:root:Warning:config file server.conf not found ERROR:root:Error occurred CRITICAL:root:Critical error -- shutting down
sv: WARNING:root:Warning:config-filen server.conf hittades inte ERROR:root:Fel inträffade CRITICAL:root:Kritiskt fel -- stänger ner

source: In the default configuration, informational and debugging messages are suppressed and the output is sent to standard error. You can enable the display of informational and debugging messages by calling the :meth:`~logging.Logger.setLevel` method on the root logger.
sv: I standardkonfigurationen undertrycks informations- och felsökningsmeddelanden och utdata skickas till standardfel. Du kan aktivera visning av informations- och felsökningsmeddelanden genom att anropa metoden :meth:`~logging.Logger.setLevel` på rotloggaren.

source: Notice the :func:`~logging.warning` call's use of string formatting operators; all of the functions for logging messages take the arguments ``(msg, arg1, arg2, ...)`` and log the string resulting from ``msg % (arg1, arg2, ...)``.
sv: Lägg märke till :func:`~logging.warning`-anropets användning av strängformateringsoperatorer; alla funktioner för loggning av meddelanden tar argumenten ``(msg, arg1, arg2, ...)`` och loggar strängen som blir resultatet av ``msg % (arg1, arg2, ...)``.

source: There's also an :func:`~logging.exception` function that records the most recent traceback. Any of the other functions will also record the traceback if you specify a true value for the keyword argument *exc_info*. ::
sv: Det finns också en :func:`~logging.exception`-funktion som registrerar det senaste bakslaget. Någon av de andra funktionerna kommer också att spela in spårningen om du anger ett sant värde för nyckelordsargumentet *exc_info*. ::

source: def f(): try: 1/0 except: logging.exception('Problem recorded') f()
sv: def f(): försök: 1/0 except: logging.exception('Problem registrerat') f()

source: ERROR:root:Problem recorded Traceback (most recent call last): File "t.py", line 6, in f 1/0 ZeroDivisionError: integer division or modulo by zero
sv: ERROR:root:Problem registrerat Återkoppling (senaste anropet sist): Fil "t.py", rad 6, i f 1/0 ZeroDivisionError: division av heltal eller modulo med noll

source: Slightly more advanced programs will use a logger other than the root logger. The ``getLogger(name)`` function is used to get a particular log, creating it if it doesn't exist yet. ``getLogger(None)`` returns the root logger. ::
sv: Lite mer avancerade program kommer att använda en annan logger än rotloggern. Funktionen ``getLogger(name)`` används för att hämta en viss logger, och skapar den om den inte finns ännu. ``getLogger(None)`` returnerar rotloggaren. ::

source: log = logging.getLogger('server') ... log.info('Listening on port %i', port) ... log.critical('Disk full') ...
sv: log = loggning.getLogger('server') ... log.info('Lyssnar på port %i', port) ... log.critical('Disk full') ...

source: Log records are usually propagated up the hierarchy, so a message logged to ``server.auth`` is also seen by ``server`` and ``root``, but a :class:`~logging.Logger` can prevent this by setting its :attr:`~logging.Logger.propagate` attribute to :const:`False`.
sv: Loggposter sprids vanligtvis uppåt i hierarkin, så ett meddelande som loggas till ``server.auth`` ses också av ``server`` och ``root``, men en :class:`~logging.Logger` kan förhindra detta genom att ställa in dess :attr:`~logging.Logger.propagate`-attribut till :const:`False`.

source: There are more classes provided by the :mod:`logging` package that can be customized. When a :class:`~logging.Logger` instance is told to log a message, it creates a :class:`~logging.LogRecord` instance that is sent to any number of different :class:`~logging.Handler` instances. Loggers and handlers can also have an attached list of filters, and each filter can cause the :class:`~logging.LogRecord` to be ignored or can modify the record before passing it along. When they're finally output, :class:`~logging.LogRecord` instances are converted to text by a :class:`~logging.Formatter` class. All of these classes can be replaced by your own specially written classes.
sv: Det finns fler klasser som tillhandahålls av paketet :mod:`logging` och som kan anpassas. När en instans av :class:`~logging.Logger` får i uppdrag att logga ett meddelande skapas en instans av :class:`~logging.LogRecord` som skickas till ett valfritt antal olika instanser av :class:`~logging.Handler`. Loggare och hanterare kan också ha en bifogad lista med filter, och varje filter kan orsaka att :class:`~logging.LogRecord` ignoreras eller kan modifiera posten innan den skickas vidare. När de slutligen skrivs ut konverteras :class:`~logging.LogRecord`-instanser till text av en :class:`~logging.Formatter`-klass. Alla dessa klasser kan ersättas av dina egna specialskrivna klasser.

source: With all of these features the :mod:`logging` package should provide enough flexibility for even the most complicated applications. This is only an incomplete overview of its features, so please see the package's reference documentation for all of the details. Reading :pep:`282` will also be helpful.
sv: Med alla dessa funktioner bör paketet :mod:`logging` ge tillräcklig flexibilitet för även de mest komplicerade tillämpningarna. Det här är bara en ofullständig översikt över dess funktioner, så se paketets referensdokumentation för alla detaljer. Att läsa :pep:`282` kommer också att vara till hjälp.

source: :pep:`282` - A Logging System
sv: :pep:`282` - Ett loggningssystem

source: Written by Vinay Sajip and Trent Mick; implemented by Vinay Sajip.
sv: Skriven av Vinay Sajip och Trent Mick; implementerad av Vinay Sajip.

source: PEP 285: A Boolean Type
sv: PEP 285: En boolesk typ

source: A Boolean type was added to Python 2.3. Two new constants were added to the :mod:`!__builtin__` module, :const:`True` and :const:`False`. (:const:`True` and :const:`False` constants were added to the built-ins in Python 2.2.1, but the 2.2.1 versions are simply set to integer values of 1 and 0 and aren't a different type.)
sv: En boolesk typ lades till i Python 2.3. Två nya konstanter lades till i modulen :mod:`!__builtin__`, :const:`True` och :const:`False`. (:const:`True` och :const:`False` lades till i Python 2.2.1, men 2.2.1-versionerna är helt enkelt inställda på heltalsvärdena 1 och 0 och är inte en annan typ)

source: The type object for this new type is named :class:`bool`; the constructor for it takes any Python value and converts it to :const:`True` or :const:`False`. ::
sv: Typobjektet för den här nya typen heter :class:`bool`; konstruktören för den tar ett valfritt Python-värde och konverterar det till :const:`True` eller :const:`False`. ::

source: >>> bool(1) True >>> bool(0) False >>> bool([]) False >>> bool( (1,) ) True
sv: >>> bool(1) Sann >>> bool(0) Falsk >>> bool([]) Falsk >>> bool( (1,) ) Sann

source: Most of the standard library modules and built-in functions have been changed to return Booleans. ::
sv: De flesta av standardbibliotekets moduler och inbyggda funktioner har ändrats så att de returnerar booleaner:

source: >>> obj = [] >>> hasattr(obj, 'append') True >>> isinstance(obj, list) True >>> isinstance(obj, tuple) False
sv: >>> obj = [] >>> hasattr(obj, 'append') Sant >>> isinstance(obj, lista) True >>> isinstance(obj, tuple) >>> isinstance(obj, tuple) False

source: Python's Booleans were added with the primary goal of making code clearer. For example, if you're reading a function and encounter the statement ``return 1``, you might wonder whether the ``1`` represents a Boolean truth value, an index, or a coefficient that multiplies some other quantity. If the statement is ``return True``, however, the meaning of the return value is quite clear.
sv: Pythons booleaner lades till med det primära målet att göra koden tydligare. Om du till exempel läser en funktion och stöter på uttalandet ``return 1``, kanske du undrar om ``1`` representerar ett booleskt sanningsvärde, ett index eller en koefficient som multiplicerar någon annan kvantitet. Om uttalandet är ``return True`` är dock betydelsen av returvärdet ganska tydlig.

source: Python's Booleans were *not* added for the sake of strict type-checking. A very strict language such as Pascal would also prevent you performing arithmetic with Booleans, and would require that the expression in an :keyword:`if` statement always evaluate to a Boolean result. Python is not this strict and never will be, as :pep:`285` explicitly says. This means you can still use any expression in an :keyword:`!if` statement, even ones that evaluate to a list or tuple or some random object. The Boolean type is a subclass of the :class:`int` class so that arithmetic using a Boolean still works. ::
sv: Pythons booleaner lades *inte* till för att göra en strikt typkontroll. Ett mycket strikt språk som Pascal skulle också hindra dig från att utföra aritmetik med booleaner och skulle kräva att uttrycket i en :keyword:`if`-sats alltid utvärderas till ett booleanskt resultat. Python är inte så strikt och kommer aldrig att bli det, vilket :pep:`285` uttryckligen säger. Detta innebär att du fortfarande kan använda vilket uttryck som helst i en :keyword:`!if`-sats, även sådana som utvärderas till en lista eller tupel eller något slumpmässigt objekt. Den booleska typen är en underklass till :class:`int`-klassen så att aritmetik med en booleansk typ fortfarande fungerar. ::

source: >>> True + 1 2 >>> False + 1 1 >>> False * 75 0 >>> True * 75 75
sv: >>> Sant + 1 2 >>> Falsk + 1 1 >>> Falskt * 75 0 >>> Sant * 75 75

source: To sum up :const:`True` and :const:`False` in a sentence: they're alternative ways to spell the integer values 1 and 0, with the single difference that :func:`str` and :func:`repr` return the strings ``'True'`` and ``'False'`` instead of ``'1'`` and ``'0'``.
sv: För att sammanfatta :const:`True` och :const:`False` i en mening: de är alternativa sätt att stava till heltalsvärdena 1 och 0, med den enda skillnaden att :func:`str` och :func:`repr` returnerar strängarna ``'True'`` och ``'False'`` istället för ``'1'`` och ``'0'``.

source: :pep:`285` - Adding a bool type
sv: :pep:`285` - Lägga till en bool-typ

source: Written and implemented by GvR.
sv: Skrivet och implementerat av GvR.

source: PEP 293: Codec Error Handling Callbacks
sv: PEP 293: Callbacks för felhantering av codec

source: When encoding a Unicode string into a byte string, unencodable characters may be encountered. So far, Python has allowed specifying the error processing as either "strict" (raising :exc:`UnicodeError`), "ignore" (skipping the character), or "replace" (using a question mark in the output string), with "strict" being the default behavior. It may be desirable to specify alternative processing of such errors, such as inserting an XML character reference or HTML entity reference into the converted string.
sv: När man kodar en Unicode-sträng till en byte-sträng kan man stöta på tecken som inte kan kodas. Hittills har Python tillåtit att felhanteringen specificeras som antingen "strict" (väcker :exc:`UnicodeError`), "ignore" (hoppar över tecknet) eller "replace" (använder ett frågetecken i utdatasträngen), där "strict" är standardbeteendet. Det kan vara önskvärt att ange alternativ behandling av sådana fel, t.ex. att infoga en XML-teckenreferens eller HTML-entitetsreferens i den konverterade strängen.
