Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: What's New in Python 2.3
sv: Vad är nytt i Python 2.3

source: Author
sv: Författare

source: This article explains the new features in Python 2.3. Python 2.3 was released on July 29, 2003.
sv: I den här artikeln förklaras de nya funktionerna i Python 2.3. Python 2.3 släpptes den 29 juli 2003.

source: The main themes for Python 2.3 are polishing some of the features added in 2.2, adding various small but useful enhancements to the core language, and expanding the standard library. The new object model introduced in the previous version has benefited from 18 months of bugfixes and from optimization efforts that have improved the performance of new-style classes. A few new built-in functions have been added such as :func:`sum` and :func:`enumerate`. The :keyword:`in` operator can now be used for substring searches (e.g. ``"ab" in "abc"`` returns :const:`True`).
sv: Huvudtemana för Python 2.3 är att polera några av de funktioner som lades till i 2.2, lägga till olika små men användbara förbättringar av kärnspråket och utöka standardbiblioteket. Den nya objektmodellen som introducerades i den tidigare versionen har dragit nytta av 18 månaders buggfixar och av optimeringsinsatser som har förbättrat prestandan för klasser i ny stil. Några nya inbyggda funktioner har lagts till, t.ex. :func:`sum` och :func:`enumerate`. Operatorn :keyword:`in` kan nu användas för delsträngssökningar (t.ex. ``"ab" i "abc"`` returnerar :const:`True`).

source: Some of the many new library features include Boolean, set, heap, and date/time data types, the ability to import modules from ZIP-format archives, metadata support for the long-awaited Python catalog, an updated version of IDLE, and modules for logging messages, wrapping text, parsing CSV files, processing command-line options, using BerkeleyDB databases... the list of new and enhanced modules is lengthy.
sv: Några av de många nya biblioteksfunktionerna är datatyperna Boolean, set, heap och date/time, möjligheten att importera moduler från ZIP-formatarkiv, metadatastöd för den efterlängtade Python-katalogen, en uppdaterad version av IDLE och moduler för loggning av meddelanden, textbrytning, parsning av CSV-filer, bearbetning av kommandoradsalternativ, användning av BerkeleyDB-databaser... listan över nya och förbättrade moduler är lång.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.3, such as the Python Library Reference and the Python Reference Manual. If you want to understand the complete implementation and design rationale, refer to the PEP for a particular new feature.
sv: Den här artikeln försöker inte ge en fullständig specifikation av de nya funktionerna, utan ger istället en praktisk översikt. För fullständiga detaljer bör du läsa dokumentationen för Python 2.3, till exempel Python Library Reference och Python Reference Manual. Om du vill förstå den fullständiga implementeringen och designrationaliteten, hänvisas till PEP för en viss ny funktion.

source: PEP 218: A Standard Set Datatype
sv: PEP 218: En datatyp för standarduppsättningar

source: The new :mod:`!sets` module contains an implementation of a set datatype. The :class:`Set` class is for mutable sets, sets that can have members added and removed. The :class:`!ImmutableSet` class is for sets that can't be modified, and instances of :class:`!ImmutableSet` can therefore be used as dictionary keys. Sets are built on top of dictionaries, so the elements within a set must be hashable.
sv: Den nya modulen :mod:`!sets` innehåller en implementation av datatypen set. Klassen :class:`Set` är för föränderliga uppsättningar, uppsättningar som kan få medlemmar tillagda och borttagna. Klassen :class:`!ImmutableSet` är för uppsättningar som inte kan ändras, och instanser av :class:`!ImmutableSet` kan därför användas som nycklar i ordböcker. Uppsättningar byggs ovanpå ordböcker, så elementen i en uppsättning måste vara hashbara.

source: Here's a simple example::
sv: Här är ett enkelt exempel::

source: The union and intersection of sets can be computed with the :meth:`~frozenset.union` and :meth:`~frozenset.intersection` methods; an alternative notation uses the bitwise operators ``&`` and ``|``. Mutable sets also have in-place versions of these methods, :meth:`!union_update` and :meth:`~frozenset.intersection_update`. ::
sv: Union och intersektion av mängder kan beräknas med metoderna :meth:`~frozenset.union` och :meth:`~frozenset.intersection`; en alternativ notation använder de bitvisa operatorerna ``&`` och ``|``. Mutabla mängder har också in-place-versioner av dessa metoder, :meth:`!union_update` och :meth:`~frozenset.intersection_update`. ::

source: >>> S1 = sets.Set([1,2,3]) >>> S2 = sets.Set([4,5,6]) >>> S1.union(S2) Set([1, 2, 3, 4, 5, 6]) >>> S1 | S2 # Alternative notation Set([1, 2, 3, 4, 5, 6]) >>> S1.intersection(S2) Set([]) >>> S1 & S2 # Alternative notation Set([]) >>> S1.union_update(S2) >>> S1 Set([1, 2, 3, 4, 5, 6]) >>>
sv: >>> S1 = uppsättningar.uppsättning([1,2,3]) >>> S2 = uppsättningar.uppsättning([4,5,6]) >>> S1.union(S2) Set([1, 2, 3, 4, 5, 6]) >>> S1 | S2 # Alternativ notation Uppsättning([1, 2, 3, 4, 5, 6]) >>> S1.intersektion(S2) Set([]) >>> S1 & S2 # Alternativ notation Set([]) >>> S1.union_uppdatering(S2) >>> S1 Set([1, 2, 3, 4, 5, 6]) >>>

source: It's also possible to take the symmetric difference of two sets. This is the set of all elements in the union that aren't in the intersection. Another way of putting it is that the symmetric difference contains all elements that are in exactly one set. Again, there's an alternative notation (``^``), and an in-place version with the ungainly name :meth:`~frozenset.symmetric_difference_update`. ::
sv: Det är också möjligt att ta den symmetriska skillnaden mellan två uppsättningar. Detta är uppsättningen av alla element i unionen som inte finns i intersektionen. Ett annat sätt att uttrycka det är att den symmetriska skillnaden innehåller alla element som finns i exakt en uppsättning. Återigen, det finns en alternativ notation (``^``), och en in-place version med det otympliga namnet :meth:`~frozenset.symmetric_difference_update`. ::

source: >>> S1 = sets.Set([1,2,3,4]) >>> S2 = sets.Set([3,4,5,6]) >>> S1.symmetric_difference(S2) Set([1, 2, 5, 6]) >>> S1 ^ S2 Set([1, 2, 5, 6]) >>>
sv: >>> S1 = sets.set([1,2,3,4]) >>> S2 = uppsättningar.uppsättning([3,4,5,6]) >>> S1.symmetrisk_skillnad(S2) Set([1, 2, 5, 6]) >>> S1 ^ S2 Set([1, 2, 5, 6]) >>>

source: There are also :meth:`!issubset` and :meth:`!issuperset` methods for checking whether one set is a subset or superset of another::
sv: Det finns också metoderna :meth:`!issubset` och :meth:`!issuperset` för att kontrollera om en uppsättning är en delmängd eller övermängd av en annan:

source: >>> S1 = sets.Set([1,2,3]) >>> S2 = sets.Set([2,3]) >>> S2.issubset(S1) True >>> S1.issubset(S2) False >>> S1.issuperset(S2) True >>>
sv: >>> S1 = set.set([1,2,3]) >>> S2 = uppsättningar.uppsättning([2,3]) >>> S2.issubset(S1) Sant >>> S1.issubset(S2) Falsk >>> S1.issuperset(S2) Sant >>>

source: :pep:`218` - Adding a Built-In Set Object Type
sv: :pep:`218` - Lägga till en inbyggd objekttyp för set

source: PEP written by Greg V. Wilson. Implemented by Greg V. Wilson, Alex Martelli, and GvR.
sv: PEP skriven av Greg V. Wilson. Implementerad av Greg V. Wilson, Alex Martelli och GvR.

source: PEP 255: Simple Generators
sv: PEP 255: Enkla generatorer

source: In Python 2.2, generators were added as an optional feature, to be enabled by a ``from __future__ import generators`` directive. In 2.3 generators no longer need to be specially enabled, and are now always present; this means that :keyword:`yield` is now always a keyword. The rest of this section is a copy of the description of generators from the "What's New in Python 2.2" document; if you read it back when Python 2.2 came out, you can skip the rest of this section.
sv: I Python 2.2 lades generatorer till som en valfri funktion som kunde aktiveras med ett ``from __future__ import generators``-direktiv. I 2.3 behöver generatorer inte längre aktiveras speciellt, utan är nu alltid närvarande; detta innebär att :keyword:`yield` nu alltid är ett nyckelord. Resten av det här avsnittet är en kopia av beskrivningen av generatorer från dokumentet "What's New in Python 2.2"; om du läste det när Python 2.2 kom ut kan du hoppa över resten av det här avsnittet.

source: You're doubtless familiar with how function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a :keyword:`return` statement, the local variables are destroyed and the resulting value is returned to the caller. A later call to the same function will get a fresh new set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
sv: Du är säkert bekant med hur funktionsanrop fungerar i Python eller C. När du anropar en funktion får den ett privat namnområde där dess lokala variabler skapas. När funktionen når en :keyword:`return`-sats förstörs de lokala variablerna och det resulterande värdet returneras till anroparen. Ett senare anrop till samma funktion kommer att få en ny uppsättning lokala variabler. Men tänk om de lokala variablerna inte kastades bort när en funktion avslutades? Tänk om du senare kunde återuppta funktionen där den slutade? Detta är vad generatorer tillhandahåller; de kan betraktas som återupptagbara funktioner.

source: Here's the simplest example of a generator function::
sv: Här är det enklaste exemplet på en generatorfunktion::

source: def generate_ints(N): for i in range(N): yield i
sv: def generera_ints(N): för i i intervall(N): avkastning i

source: A new keyword, :keyword:`yield`, was introduced for generators. Any function containing a :keyword:`!yield` statement is a generator function; this is detected by Python's bytecode compiler which compiles the function specially as a result.
sv: Ett nytt nyckelord, :keyword:`yield`, introducerades för generatorer. Alla funktioner som innehåller en :keyword:`!yield`-sats är en generatorfunktion; detta upptäcks av Pythons bytecode-kompilator som kompilerar funktionen speciellt som ett resultat.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the :keyword:`yield` statement, the generator outputs the value of ``i``, similar to a :keyword:`return` statement. The big difference between :keyword:`!yield` and a :keyword:`!return` statement is that on reaching a :keyword:`!yield` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's ``.next()`` method, the function will resume executing immediately after the :keyword:`!yield` statement. (For complicated reasons, the :keyword:`!yield` statement isn't allowed inside the :keyword:`try` block of a :keyword:`!try`...\ :keyword:`!finally` statement; read :pep:`255` for a full explanation of the interaction between :keyword:`!yield` and exceptions.)
sv: När du anropar en generatorfunktion returnerar den inte ett enda värde, utan istället ett generatorobjekt som stöder iteratorprotokollet. Vid exekvering av :keyword:`yield`-satsen matar generatorn ut värdet på ``i``, på samma sätt som en :keyword:`return`-sats. Den stora skillnaden mellan :keyword:`!yield` och en :keyword:`!return`-sats är att när man når en :keyword:`!yield` avbryts generatorns exekveringstillstånd och lokala variabler bevaras. Vid nästa anrop till generatorns metod ``.next()`` kommer funktionen att återuppta exekveringen omedelbart efter :keyword:`!yield`-satsen. (Av komplicerade skäl är :keyword:`!yield`-satsen inte tillåten inuti :keyword:`try`-blocket i en :keyword:`!try`...\ :keyword:`!finally`-sats; läs :pep:`255` för en fullständig förklaring av interaktionen mellan :keyword:`!yield` och undantag)

source: Here's a sample usage of the :func:`!generate_ints` generator::
sv: Här är ett exempel på användning av generatorn :func:`!generate_ints`::

source: >>> gen = generate_ints(3) >>> gen <generator object at 0x8117f90> >>> gen.next() 0 >>> gen.next() 1 >>> gen.next() 2 >>> gen.next() Traceback (most recent call last): File "stdin", line 1, in ? File "stdin", line 2, in generate_ints StopIteration
sv: &gt;&gt;&gt; gen = generera_ints(3) &gt;&gt;&gt; gen <generator object at 0x8117f90> &gt;&gt;&gt; gen.nästa() 0 &gt;&gt;&gt; gen.nästa() 1 &gt;&gt;&gt; gen.nästa() 2 &gt;&gt;&gt; gen.nästa() Traceback (senaste anropet senast): Fil "stdin", rad 1, i ? Fil "stdin", rad 2, i generate_ints Stoppa iteration

source: You could equally write ``for i in generate_ints(5)``, or ``a,b,c = generate_ints(3)``.
sv: Du kan lika gärna skriva ``for i in generate_ints(5)``, eller ``a,b,c = generate_ints(3)``.

source: Inside a generator function, the :keyword:`return` statement can only be used without a value, and signals the end of the procession of values; afterwards the generator cannot return any further values. :keyword:`!return` with a value, such as ``return 5``, is a syntax error inside a generator function. The end of the generator's results can also be indicated by raising :exc:`StopIteration` manually, or by just letting the flow of execution fall off the bottom of the function.
sv: I en generatorfunktion kan :keyword:`return` bara användas utan ett värde och signalerar slutet på värdeförloppet; därefter kan generatorn inte returnera några ytterligare värden. :keyword:`!return` med ett värde, t.ex. ``return 5``, är ett syntaxfel i en generatorfunktion. Slutet på generatorns resultat kan också indikeras genom att höja :exc:`StopIteration` manuellt, eller genom att bara låta flödet av exekveringen falla från botten av funktionen.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`next` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class would be much messier. :file:`Lib/test/test_generators.py` contains a number of more interesting examples. The simplest one implements an in-order traversal of a tree using generators recursively. ::
sv: Du kan uppnå effekten av generatorer manuellt genom att skriva din egen klass och lagra alla lokala variabler i generatorn som instansvariabler. Att returnera en lista med heltal kan till exempel göras genom att sätta ``self.count`` till 0 och låta :meth:`next`-metoden öka ``self.count`` och returnera den. Men för en måttligt komplicerad generator skulle det vara mycket krångligare att skriva en motsvarande klass. :file:`Lib/test/test_generators.py` innehåller ett antal mer intressanta exempel. Det enklaste implementerar en genomgång av ett träd i ordningsföljd med hjälp av generatorer rekursivt. ::

source: # A recursive generator that generates Tree leaves in in-order. def inorder(t): if t: for x in inorder(t.left): yield x yield t.label for x in inorder(t.right): yield x
sv: # En rekursiv generator som genererar trädblad i ordning. def inorder(t): if t: för x i inorder(t.left): avkastning x yield t.etikett för x i inorder(t.right): ge x

source: Two other examples in :file:`Lib/test/test_generators.py` produce solutions for the N-Queens problem (placing $N$ queens on an $NxN$ chess board so that no queen threatens another) and the Knight's Tour (a route that takes a knight to every square of an $NxN$ chessboard without visiting any square twice).
sv: Två andra exempel i :file:`Lib/test/test_generators.py` producerar lösningar för N-Queens-problemet (placera $N$ drottningar på ett $NxN$ schackbräde så att ingen drottning hotar en annan) och Knight's Tour (en rutt som tar en springare till varje ruta på ett $NxN$ schackbräde utan att besöka någon ruta två gånger).

source: The idea of generators comes from other programming languages, especially Icon (https://www2.cs.arizona.edu/icon/), where the idea of generators is central. In Icon, every expression and function call behaves like a generator. One example from "An Overview of the Icon Programming Language" at https://www2.cs.arizona.edu/icon/docs/ipd266.htm gives an idea of what this looks like::
sv: Idén med generatorer kommer från andra programmeringsspråk, särskilt Icon (https://www2.cs.arizona.edu/icon/), där idén med generatorer är central. I Icon beter sig varje uttryck och funktionsanrop som en generator. Ett exempel från "An Overview of the Icon Programming Language" på https://www2.cs.arizona.edu/icon/docs/ipd266.htm ger en uppfattning om hur detta ser ut::

source: sentence := "Store it in the neighboring harbor" if (i := find("or", sentence)) > 5 then write(i)
sv: mening := "Förvara den i den närliggande hamnen" if (i := find("eller", mening)) > 5 då skriv(i)

source: In Icon the :func:`!find` function returns the indexes at which the substring "or" is found: 3, 23, 33. In the :keyword:`if` statement, ``i`` is first assigned a value of 3, but 3 is less than 5, so the comparison fails, and Icon retries it with the second value of 23. 23 is greater than 5, so the comparison now succeeds, and the code prints the value 23 to the screen.
sv: I Icon returnerar funktionen :func:`!find` de index där delsträngen "or" hittas: 3, 23, 33. I :keyword:`if`-satsen tilldelas ``i`` först värdet 3, men 3 är mindre än 5, så jämförelsen misslyckas, och Icon gör ett nytt försök med det andra värdet 23. 23 är större än 5, så jämförelsen lyckas nu, och koden skriver ut värdet 23 på skärmen.

source: Python doesn't go nearly as far as Icon in adopting generators as a central concept. Generators are considered part of the core Python language, but learning or using them isn't compulsory; if they don't solve any problems that you have, feel free to ignore them. One novel feature of Python's interface as compared to Icon's is that a generator's state is represented as a concrete object (the iterator) that can be passed around to other functions or stored in a data structure.
sv: Python går inte alls lika långt som Icon när det gäller att anta generatorer som ett centralt koncept. Generatorer anses vara en del av Pythons kärnspråk, men det är inte obligatoriskt att lära sig eller använda dem; om de inte löser några problem som du har, känn dig fri att ignorera dem. En nyhet i Pythons gränssnitt jämfört med Icons är att en generators tillstånd representeras som ett konkret objekt (iteratorn) som kan skickas runt till andra funktioner eller lagras i en datastruktur.

source: :pep:`255` - Simple Generators
sv: :pep:`255` - Enkla generatorer

source: Written by Neil Schemenauer, Tim Peters, Magnus Lie Hetland. Implemented mostly by Neil Schemenauer and Tim Peters, with other fixes from the Python Labs crew.
sv: Skriven av Neil Schemenauer, Tim Peters, Magnus Lie Hetland. Implementerad mestadels av Neil Schemenauer och Tim Peters, med andra korrigeringar från Python Labs-gänget.

source: PEP 263: Source Code Encodings
sv: PEP 263: Kodning av källkod

source: Python source files can now be declared as being in different character set encodings. Encodings are declared by including a specially formatted comment in the first or second line of the source file. For example, a UTF-8 file can be declared with::
sv: Python-källfiler kan nu deklareras med olika teckenuppsättningskodningar. Kodningar deklareras genom att inkludera en speciellt formaterad kommentar på den första eller andra raden i källfilen. Till exempel kan en UTF-8-fil deklareras med::

source: #!/usr/bin/env python # -*- coding: UTF-8 -*-
sv: #!/usr/bin/env python # -*- kodning: UTF-8 -*-

source: Without such an encoding declaration, the default encoding used is 7-bit ASCII. Executing or importing modules that contain string literals with 8-bit characters and have no encoding declaration will result in a :exc:`DeprecationWarning` being signalled by Python 2.3; in 2.4 this will be a syntax error.
sv: Utan en sådan kodningsdeklaration används 7-bitars ASCII som standardkodning. Att exekvera eller importera moduler som innehåller stränglitteraler med 8-bitars tecken och som inte har någon kodningsdeklaration kommer att resultera i en :exc:`DeprecationWarning` som signaleras av Python 2.3; i 2.4 kommer detta att vara ett syntaxfel.

source: The encoding declaration only affects Unicode string literals, which will be converted to Unicode using the specified encoding. Note that Python identifiers are still restricted to ASCII characters, so you can't have variable names that use characters outside of the usual alphanumerics.
sv: Kodningsdeklarationen påverkar endast Unicode-stränglitteraler, som kommer att konverteras till Unicode med hjälp av den angivna kodningen. Observera att Python-identifierare fortfarande är begränsade till ASCII-tecken, så du kan inte ha variabelnamn som använder tecken utanför de vanliga alfanumeriska tecknen.

source: :pep:`263` - Defining Python Source Code Encodings
sv: :pep:`263` - Definiera Python-kodning av källkod

source: Written by Marc-André Lemburg and Martin von Löwis; implemented by Suzuki Hisao and Martin von Löwis.
sv: Skriven av Marc-André Lemburg och Martin von Löwis; implementerad av Suzuki Hisao och Martin von Löwis.

source: PEP 273: Importing Modules from ZIP Archives
sv: PEP 273: Importera moduler från ZIP-arkiv

source: The new :mod:`zipimport` module adds support for importing modules from a ZIP-format archive. You don't need to import the module explicitly; it will be automatically imported if a ZIP archive's filename is added to ``sys.path``. For example:
sv: Den nya modulen :mod:`zipimport` ger stöd för att importera moduler från ett ZIP-arkiv. Du behöver inte importera modulen explicit; den importeras automatiskt om ZIP-arkivets filnamn läggs till i ``sys.path``. Ett exempel:

source: amk@nyman:~/src/python$ unzip -l /tmp/example.zip Archive: /tmp/example.zip Length Date Time Name -------- ---- ---- ---- 8467 11-26-02 22:30 jwzthreading.py -------- ------- 8467 1 file amk@nyman:~/src/python$ ./python Python 2.3 (#1, Aug 1 2003, 19:54:32) >>> import sys >>> sys.path.insert(0, '/tmp/example.zip') # Add .zip file to front of path >>> import jwzthreading >>> jwzthreading.__file__ '/tmp/example.zip/jwzthreading.py' >>>
sv: amk@nyman:~/src/python$ unzip -l /tmp/example.zip Arkiv: /tmp/exempel.zip Längd Datum Tid Namn -------- ---- ---- ---- 8467 11-26-02 22:30 jwzthreading.py -------- ------- 8467 1 fil amk@nyman:~/src/python$ ./python Python 2.3 (#1, 1 aug 2003, 19:54:32) >>> import sys >>> sys.path.insert(0, '/tmp/example.zip') # Lägg till .zip-filen i början av sökvägen >>> import jwzthreading >>> jwzthreading.__file__ '/tmp/exempel.zip/jwzthreading.py' >>>
