Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: Built-in types now support the extended slicing syntax, as described in section :ref:`section-slices` of this document.
sv: Inbyggda typer stöder nu den utökade slicing-syntaxen, som beskrivs i avsnitt :ref:`section-slices` i detta dokument.

source: A new built-in function, ``sum(iterable, start=0)``, adds up the numeric items in the iterable object and returns their sum. :func:`sum` only accepts numbers, meaning that you can't use it to concatenate a bunch of strings. (Contributed by Alex Martelli.)
sv: En ny inbyggd funktion, ``sum(iterable, start=0)``, adderar de numeriska objekten i iterable-objektet och returnerar summan av dem. :func:`sum` accepterar bara siffror, vilket innebär att du inte kan använda den för att sammanfoga en massa strängar. (Bidrag från Alex Martelli.)

source: ``list.insert(pos, value)`` used to insert *value* at the front of the list when *pos* was negative. The behaviour has now been changed to be consistent with slice indexing, so when *pos* is -1 the value will be inserted before the last element, and so forth.
sv: ``list.insert(pos, value)`` brukade infoga *värde* längst fram i listan när *pos* var negativ. Beteendet har nu ändrats så att det stämmer överens med slice-indexering, så när *pos* är -1 kommer värdet att infogas före det sista elementet, och så vidare.

source: ``list.index(value)``, which searches for *value* within the list and returns its index, now takes optional *start* and *stop* arguments to limit the search to only part of the list.
sv: ``list.index(value)``, som söker efter *värde* i listan och returnerar dess index, tar nu valfria *start* och *stop* argument för att begränsa sökningen till endast en del av listan.

source: Dictionaries have a new method, ``pop(key[, *default*])``, that returns the value corresponding to *key* and removes that key/value pair from the dictionary. If the requested key isn't present in the dictionary, *default* is returned if it's specified and :exc:`KeyError` raised if it isn't. ::
sv: Dictionaries har en ny metod, ``pop(key[, *default*])``, som returnerar det värde som motsvarar *key* och tar bort det nyckel/värde-paret från dictionaryn. Om den begärda nyckeln inte finns i ordboken returneras *default* om den är specificerad och :exc:`KeyError` om den inte är det. ::

source: >>> d = {1:2} >>> d {1: 2} >>> d.pop(4) Traceback (most recent call last): File "stdin", line 1, in ? KeyError: 4 >>> d.pop(1) 2 >>> d.pop(1) Traceback (most recent call last): File "stdin", line 1, in ? KeyError: 'pop(): dictionary is empty' >>> d {} >>>
sv: >>> d = {1:2} >>> d {1: 2} >>> d.pop(4) Traceback (senaste anropet senast): Fil "stdin", rad 1, i ? NyckelFel: 4 >>> d.pop(1) 2 >>> d.pop(1) Traceback (senaste anropet senast): Fil "stdin", rad 1, i ? KeyError: 'pop(): ordlistan är tom' >>> d {} >>>

source: There's also a new class method, ``dict.fromkeys(iterable, value)``, that creates a dictionary with keys taken from the supplied iterator *iterable* and all values set to *value*, defaulting to ``None``.
sv: Det finns också en ny klassmetod, ``dict.fromkeys(iterable, value)``, som skapar en ordbok med nycklar som hämtas från den medföljande iteratorn *iterable* och alla värden sätts till *value*, med standardvärdet ``None``.

source: (Patches contributed by Raymond Hettinger.)
sv: (Lapparna har tillhandahållits av Raymond Hettinger.)

source: Also, the :func:`dict` constructor now accepts keyword arguments to simplify creating small dictionaries::
sv: Dessutom accepterar :func:`dict`-konstruktören nu nyckelordsargument för att förenkla skapandet av små ordböcker::

source: >>> dict(red=1, blue=2, green=3, black=4) {'blue': 2, 'black': 4, 'green': 3, 'red': 1}
sv: >>> dict(röd=1, blå=2, grön=3, svart=4) {"blå": 2, "svart": 4, 'grön': 3, 'röd': 1}

source: (Contributed by Just van Rossum.)
sv: (Bidrag från Just van Rossum.)

source: The :keyword:`assert` statement no longer checks the ``__debug__`` flag, so you can no longer disable assertions by assigning to ``__debug__``. Running Python with the :option:`-O` switch will still generate code that doesn't execute any assertions.
sv: Satsen :keyword:`assert` kontrollerar inte längre flaggan ``__debug__``, så du kan inte längre inaktivera påståenden genom att tilldela till ``__debug__``. Att köra Python med :option:`-O` kommer fortfarande att generera kod som inte utför några assertions.

source: Most type objects are now callable, so you can use them to create new objects such as functions, classes, and modules. (This means that the :mod:`!new` module can be deprecated in a future Python version, because you can now use the type objects available in the :mod:`types` module.) For example, you can create a new module object with the following code:
sv: De flesta typobjekt är nu anropsbara, så att du kan använda dem för att skapa nya objekt som funktioner, klasser och moduler. (Detta innebär att modulen :mod:`!new` kan tas bort i en framtida Python-version, eftersom du nu kan använda de typobjekt som finns i modulen :mod:`types`) Du kan till exempel skapa ett nytt modulobjekt med följande kod:

source: >>> import types >>> m = types.ModuleType('abc','docstring') >>> m <module 'abc' (built-in)> >>> m.__doc__ 'docstring'
sv: >>> import typer >>> m = types.ModuleType('abc','docstring') >>> m <modul 'abc' (inbyggd)> >>> m.__doc__ 'docstring'

source: A new warning, :exc:`PendingDeprecationWarning` was added to indicate features which are in the process of being deprecated. The warning will *not* be printed by default. To check for use of features that will be deprecated in the future, supply :option:`-Walways::PendingDeprecationWarning:: <-W>` on the command line or use :func:`warnings.filterwarnings`.
sv: En ny varning, :exc:`PendingDeprecationWarning`, har lagts till för att indikera funktioner som håller på att bli föråldrade. Varningen kommer *inte* att skrivas ut som standard. För att kontrollera om funktioner som kommer att föråldras används i framtiden, ange :option:`-Walways::PendingDeprecationWarning:: <-W>` på kommandoraden eller använd :func:`warnings.filterwarnings`.

source: The process of deprecating string-based exceptions, as in ``raise "Error occurred"``, has begun. Raising a string will now trigger :exc:`PendingDeprecationWarning`.
sv: Processen med att avskriva strängbaserade undantag, som i ``raise "Error occurred"``, har börjat. Om en sträng anges kommer den nu att utlösa :exc:`PendingDeprecationWarning`.

source: Using ``None`` as a variable name will now result in a :exc:`SyntaxWarning` warning. In a future version of Python, ``None`` may finally become a keyword.
sv: Att använda ``None`` som variabelnamn kommer nu att resultera i en :exc:`SyntaxWarning`-varning. I en framtida version av Python kan ``None`` äntligen bli ett nyckelord.

source: The :meth:`!xreadlines` method of file objects, introduced in Python 2.1, is no longer necessary because files now behave as their own iterator. :meth:`!xreadlines` was originally introduced as a faster way to loop over all the lines in a file, but now you can simply write ``for line in file_obj``. File objects also have a new read-only :attr:`!encoding` attribute that gives the encoding used by the file; Unicode strings written to the file will be automatically converted to bytes using the given encoding.
sv: Metoden :meth:`!xreadlines` för filobjekt, som introducerades i Python 2.1, är inte längre nödvändig eftersom filer nu beter sig som sin egen iterator. :meth:`!xreadlines` introducerades ursprungligen som ett snabbare sätt att loopa över alla rader i en fil, men nu kan du helt enkelt skriva ``for line in file_obj``. Filobjekt har också ett nytt skrivskyddat attribut :attr:`!encoding` som anger den kodning som används av filen; Unicode-strängar som skrivs till filen konverteras automatiskt till bytes med den angivna kodningen.

source: The method resolution order used by new-style classes has changed, though you'll only notice the difference if you have a really complicated inheritance hierarchy. Classic classes are unaffected by this change. Python 2.2 originally used a topological sort of a class's ancestors, but 2.3 now uses the C3 algorithm as described in the paper `"A Monotonic Superclass Linearization for Dylan" <https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.3910>`_. To understand the motivation for this change, read Michele Simionato's article :ref:`python_2.3_mro`, or read the thread on python-dev starting with the message at https://mail.python.org/pipermail/python-dev/2002-October/029035.html. Samuele Pedroni first pointed out the problem and also implemented the fix by coding the C3 algorithm.
sv: Den metodupplösningsordning som används av new-style klasser har ändrats, men du kommer bara att märka skillnaden om du har en riktigt komplicerad arvshierarki. Klassiska klasser påverkas inte av denna förändring. Python 2.2 använde ursprungligen en topologisk sortering av en klass förfäder, men 2.3 använder nu C3-algoritmen som beskrivs i dokumentet `"A Monotonic Superclass Linearization for Dylan" <https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.3910>`_. För att förstå motivationen för denna förändring, läs Michele Simionatos artikel :ref:`python_2.3_mro`, eller läs tråden på python-dev som börjar med meddelandet på https://mail.python.org/pipermail/python-dev/2002-October/029035.html. Samuele Pedroni påpekade först problemet och implementerade också lösningen genom att koda C3-algoritmen.

source: Python runs multithreaded programs by switching between threads after executing N bytecodes. The default value for N has been increased from 10 to 100 bytecodes, speeding up single-threaded applications by reducing the switching overhead. Some multithreaded applications may suffer slower response time, but that's easily fixed by setting the limit back to a lower number using ``sys.setcheckinterval(N)``. The limit can be retrieved with the new :func:`!sys.getcheckinterval` function.
sv: Python kör flertrådade program genom att växla mellan trådar efter att N bytekoder har exekverats. Standardvärdet för N har ökats från 10 till 100 bytekoder, vilket snabbar upp enkeltrådade applikationer genom att minska växlingsomkostnaderna. Vissa flertrådade program kan få långsammare svarstid, men det är lätt att åtgärda genom att sätta tillbaka gränsen till ett lägre värde med hjälp av ``sys.setcheckinterval(N)``. Gränsen kan hämtas med den nya funktionen :func:`!sys.getcheckinterval`.

source: One minor but far-reaching change is that the names of extension types defined by the modules included with Python now contain the module and a ``'.'`` in front of the type name. For example, in Python 2.2, if you created a socket and printed its :attr:`!__class__`, you'd get this output::
sv: En mindre men långtgående förändring är att namnen på tilläggstyper som definieras av de moduler som ingår i Python nu innehåller modulen och en ``'.'`` framför typnamnet. Om du till exempel i Python 2.2 skapade en socket och skrev ut dess :attr:`!__class__`, skulle du få följande resultat::

source: >>> s = socket.socket() >>> s.__class__ <type 'socket'>
sv: >>> s = socket.socket() >>> s.__class__ <typ 'socket'>

source: In 2.3, you get this::
sv: I 2.3 får du detta::

source: >>> s.__class__ <type '_socket.socket'>
sv: >>> s.__class__ <typ '_socket.socket'>

source: One of the noted incompatibilities between old- and new-style classes has been removed: you can now assign to the :attr:`~type.__name__` and :attr:`~type.__bases__` attributes of new-style classes. There are some restrictions on what can be assigned to :attr:`!__bases__` along the lines of those relating to assigning to an instance's :attr:`~object.__class__` attribute.
sv: En av de noterade inkompatibiliteterna mellan gamla och nya klasser har tagits bort: du kan nu tilldela attributen :attr:`~type.__name__` och :attr:`~type.__bases__` till nya klasser. Det finns vissa restriktioner för vad som kan tilldelas :attr:`!__bases__` i linje med de som gäller för att tilldela en instans attribut :attr:`~object.__class__`.

source: String Changes
sv: Strängförändringar

source: The :keyword:`in` operator now works differently for strings. Previously, when evaluating ``X in Y`` where *X* and *Y* are strings, *X* could only be a single character. That's now changed; *X* can be a string of any length, and ``X in Y`` will return :const:`True` if *X* is a substring of *Y*. If *X* is the empty string, the result is always :const:`True`. ::
sv: Operatorn :keyword:`in` fungerar nu annorlunda för strängar. Tidigare kunde *X* bara vara ett enda tecken vid utvärdering av ``X in Y`` där *X* och *Y* är strängar. Det har nu ändrats; *X* kan vara en sträng av valfri längd, och ``X in Y`` returnerar :const:`True` om *X* är en delsträng av *Y*. Om *X* är den tomma strängen är resultatet alltid :const:`True`. ::

source: >>> 'ab' in 'abcd' True >>> 'ad' in 'abcd' False >>> '' in 'abcd' True
sv: >>> 'ab' i 'abcd' Sant >>> 'ad' i 'abcd' Falsk >>> '' i 'abcd' Sant

source: Note that this doesn't tell you where the substring starts; if you need that information, use the :meth:`~str.find` string method.
sv: Observera att detta inte berättar var delsträngen börjar; om du behöver den informationen använder du strängmetoden :meth:`~str.find`.

source: The :meth:`~str.strip`, :meth:`~str.lstrip`, and :meth:`~str.rstrip` string methods now have an optional argument for specifying the characters to strip. The default is still to remove all whitespace characters::
sv: Strängmetoderna :meth:`~str.strip`, :meth:`~str.lstrip` och :meth:`~str.rstrip` har nu ett valfritt argument för att ange vilka tecken som ska tas bort. Standardinställningen är fortfarande att ta bort alla blankstegstecken::

source: (Suggested by Simon Brunning and implemented by Walter Dörwald.)
sv: (Föreslagen av Simon Brunning och implementerad av Walter Dörwald.)

source: The :meth:`~str.startswith` and :meth:`~str.endswith` string methods now accept negative numbers for the *start* and *end* parameters.
sv: Strängmetoderna :meth:`~str.startswith` och :meth:`~str.endswith` accepterar nu negativa tal för parametrarna *start* och *end*.

source: Another new string method is :meth:`~str.zfill`, originally a function in the :mod:`string` module. :meth:`~str.zfill` pads a numeric string with zeros on the left until it's the specified width. Note that the ``%`` operator is still more flexible and powerful than :meth:`~str.zfill`. ::
sv: En annan ny strängmetod är :meth:`~str.zfill`, som ursprungligen var en funktion i modulen :mod:`string`. :meth:`~str.zfill` fyller en numerisk sträng med nollor till vänster tills den har den angivna bredden. Observera att operatorn ``%`` fortfarande är mer flexibel och kraftfull än :meth:`~str.zfill`. ::

source: (Contributed by Walter Dörwald.)
sv: (Bidrag från Walter Dörwald.)

source: A new type object, :class:`!basestring`, has been added. Both 8-bit strings and Unicode strings inherit from this type, so ``isinstance(obj, basestring)`` will return :const:`True` for either kind of string. It's a completely abstract type, so you can't create :class:`!basestring` instances.
sv: En ny typ av objekt, :class:`!basestring`, har lagts till. Både 8-bitars strängar och Unicode-strängar ärver från den här typen, så ``isinstance(obj, basestring)`` kommer att returnera :const:`True` för båda typerna av strängar. Det är en helt abstrakt typ, så du kan inte skapa :class:`!basestring`-instanser.

source: Interned strings are no longer immortal and will now be garbage-collected in the usual way when the only reference to them is from the internal dictionary of interned strings. (Implemented by Oren Tirosh.)
sv: Internerade strängar är inte längre odödliga och kommer nu att samlas in på vanligt sätt när den enda referensen till dem är från den interna ordlistan över internerade strängar. (Implementerad av Oren Tirosh.)

source: Optimizations
sv: Optimeringar

source: The creation of new-style class instances has been made much faster; they're now faster than classic classes!
sv: Skapandet av nya klassinstanser har gjorts mycket snabbare; de är nu snabbare än klassiska klasser!

source: The :meth:`~list.sort` method of list objects has been extensively rewritten by Tim Peters, and the implementation is significantly faster.
sv: Metoden :meth:`~list.sort` för listobjekt har skrivits om i stor utsträckning av Tim Peters, och implementeringen är betydligt snabbare.

source: Multiplication of large long integers is now much faster thanks to an implementation of Karatsuba multiplication, an algorithm that scales better than the *O*\ (*n*\ :sup:`2`) required for the grade-school multiplication algorithm. (Original patch by Christopher A. Craig, and significantly reworked by Tim Peters.)
sv: Multiplikation av stora långa heltal är nu mycket snabbare tack vare en implementering av Karatsuba-multiplikation, en algoritm som skalar bättre än *O*\ (*n*\ :sup:`2`) som krävs för grundskolans multiplikationsalgoritm. (Ursprunglig patch av Christopher A. Craig, och väsentligt omarbetad av Tim Peters)

source: The ``SET_LINENO`` opcode is now gone. This may provide a small speed increase, depending on your compiler's idiosyncrasies. See section :ref:`23section-other` for a longer explanation. (Removed by Michael Hudson.)
sv: Opkoden ``SET_LINENO`` är nu borta. Detta kan ge en liten hastighetsökning, beroende på din kompilators idiosynkrasier. Se avsnitt :ref:`23section-other` för en längre förklaring. (Borttagen av Michael Hudson.)

source: :func:`!xrange` objects now have their own iterator, making ``for i in xrange(n)`` slightly faster than ``for i in range(n)``. (Patch by Raymond Hettinger.)
sv: :func:`!xrange`-objekt har nu sin egen iterator, vilket gör ``for i in xrange(n)`` något snabbare än ``for i in range(n)``. (Patch av Raymond Hettinger.)

source: A number of small rearrangements have been made in various hotspots to improve performance, such as inlining a function or removing some code. (Implemented mostly by GvR, but lots of people have contributed single changes.)
sv: Ett antal små omarrangemang har gjorts i olika hotspots för att förbättra prestandan, t.ex. inlining av en funktion eller borttagning av viss kod. (Implementerat mestadels av GvR, men många människor har bidragit med enskilda ändringar)

source: The net result of the 2.3 optimizations is that Python 2.3 runs the pystone benchmark around 25% faster than Python 2.2.
sv: Nettoresultatet av 2.3-optimeringarna är att Python 2.3 kör pystone-riktmärket cirka 25% fsnabbare än Python 2.2.

source: New, Improved, and Deprecated Modules
sv: Nya, förbättrade och utfasade moduler

source: As usual, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the CVS logs for all the details.
sv: Som vanligt fick Pythons standardbibliotek ett antal förbättringar och buggfixar. Här är en partiell lista över de mest anmärkningsvärda ändringarna, sorterade alfabetiskt efter modulnamn. Se filen :file:`Misc/NEWS` i källträdet för en mer komplett lista över ändringar, eller titta igenom CVS-loggarna för alla detaljer.

source: The :mod:`array` module now supports arrays of Unicode characters using the ``'u'`` format character. Arrays also now support using the ``+=`` assignment operator to add another array's contents, and the ``*=`` assignment operator to repeat an array. (Contributed by Jason Orendorff.)
sv: Modulen :mod:`array` har nu stöd för matriser med Unicode-tecken som använder formattecknet ``'u'``. Arrayer stöder nu också användning av tilldelningsoperatorn ``+=`` för att lägga till innehållet i en annan array och tilldelningsoperatorn ``*=`` för att upprepa en array. (Bidrag från Jason Orendorff.)

source: The :mod:`!bsddb` module has been replaced by version 4.1.6 of the `PyBSDDB <https://pybsddb.sourceforge.net>`_ package, providing a more complete interface to the transactional features of the BerkeleyDB library.
sv: Modulen :mod:`!bsddb` har ersatts av version 4.1.6 av paketet `PyBSDDB <https://pybsddb.sourceforge.net>`_, vilket ger ett mer komplett gränssnitt till transaktionsfunktionerna i BerkeleyDB-biblioteket.

source: The old version of the module has been renamed to :mod:`!bsddb185` and is no longer built automatically; you'll have to edit :file:`Modules/Setup` to enable it. Note that the new :mod:`!bsddb` package is intended to be compatible with the old module, so be sure to file bugs if you discover any incompatibilities. When upgrading to Python 2.3, if the new interpreter is compiled with a new version of the underlying BerkeleyDB library, you will almost certainly have to convert your database files to the new version. You can do this fairly easily with the new scripts :file:`db2pickle.py` and :file:`pickle2db.py` which you will find in the distribution's :file:`Tools/scripts` directory. If you've already been using the PyBSDDB package and importing it as :mod:`!bsddb3`, you will have to change your ``import`` statements to import it as :mod:`!bsddb`.
sv: Den gamla versionen av modulen har bytt namn till :mod:`!bsddb185` och byggs inte längre automatiskt; du måste redigera :file:`Modules/Setup` för att aktivera den. Observera att det nya :mod:`!bsddb`-paketet är avsett att vara kompatibelt med den gamla modulen, så var noga med att rapportera buggar om du upptäcker några inkompatibiliteter. När du uppgraderar till Python 2.3, om den nya tolken är kompilerad med en ny version av det underliggande BerkeleyDB-biblioteket, kommer du nästan säkert att behöva konvertera dina databasfiler till den nya versionen. Du kan göra detta ganska enkelt med de nya skripten :file:`db2pickle.py` och :file:`pickle2db.py` som du hittar i distributionens katalog :file:`Tools/scripts`. Om du redan har använt PyBSDDB-paketet och importerat det som :mod:`!bsddb3`, måste du ändra dina ``import``-satser så att du importerar det som :mod:`!bsddb`.

source: The new :mod:`bz2` module is an interface to the bz2 data compression library. bz2-compressed data is usually smaller than corresponding :mod:`zlib`\ -compressed data. (Contributed by Gustavo Niemeyer.)
sv: Den nya modulen :mod:`bz2` är ett gränssnitt till datakomprimeringsbiblioteket bz2. bz2-komprimerad data är vanligtvis mindre än motsvarande :mod:`zlib`-komprimerad data. (Bidrag från Gustavo Niemeyer.)

source: A set of standard date/time types has been added in the new :mod:`datetime` module. See the following section for more details.
sv: En uppsättning standardtyper för datum/tid har lagts till i den nya modulen :mod:`datetime`. Se följande avsnitt för mer information.

source: The Distutils :class:`!Extension` class now supports an extra constructor argument named *depends* for listing additional source files that an extension depends on. This lets Distutils recompile the module if any of the dependency files are modified. For example, if :file:`sampmodule.c` includes the header file :file:`sample.h`, you would create the :class:`!Extension` object like this::
sv: Klassen Distutils :class:`!Extension` stöder nu ett extra konstruktörsargument med namnet *depends* för att lista ytterligare källfiler som ett tillägg är beroende av. Detta låter Distutils kompilera om modulen om någon av de beroende filerna ändras. Om till exempel :file:`sampmodule.c` innehåller header-filen :file:`sample.h`, skulle du skapa :class:`!Extension`-objektet så här::

source: Modifying :file:`sample.h` would then cause the module to be recompiled. (Contributed by Jeremy Hylton.)
sv: Modifiering av :file:`sample.h` skulle då leda till att modulen kompileras om. (Bidrag från Jeremy Hylton.)
