Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: The Distutils :func:`!setup` function has gained various new keyword arguments such as *depends*. Old versions of the Distutils will abort if passed unknown keywords. A solution is to check for the presence of the new :func:`!get_distutil_options` function in your :file:`setup.py` and only uses the new keywords with a version of the Distutils that supports them::
sv: Distutils :func:`!setup`-funktion har fått flera nya nyckelordsargument som *depends*. Gamla versioner av Distutils kommer att avbrytas om okända nyckelord skickas. En lösning är att kontrollera om den nya funktionen :func:`!get_distutil_options` finns i din :file:`setup.py` och endast använda de nya nyckelorden med en version av Distutils som stöder dem::

source: Using ``None`` as a variable name will now result in a :exc:`SyntaxWarning` warning.
sv: Att använda ``None`` som variabelnamn kommer nu att resultera i en :exc:`SyntaxWarning`-varning.

source: Names of extension types defined by the modules included with Python now contain the module and a ``'.'`` in front of the type name.
sv: Namn på tilläggstyper som definieras av de moduler som ingår i Python innehåller nu modulen och en ``'.'`` framför typnamnet.

source: Acknowledgements
sv: Tack till

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Jeff Bauer, Simon Brunning, Brett Cannon, Michael Chermside, Andrew Dalke, Scott David Daniels, Fred L. Drake, Jr., David Fraser, Kelly Gerber, Raymond Hettinger, Michael Hudson, Chris Lambert, Detlef Lannert, Martin von Löwis, Andrew MacIntyre, Lalo Martins, Chad Netzer, Gustavo Niemeyer, Neal Norwitz, Hans Nowak, Chris Reedy, Francesco Ricciardi, Vinay Sajip, Neil Schemenauer, Roman Suzi, Jason Tishler, Just van Rossum.
sv: Författaren vill tacka följande personer för förslag, korrigeringar och hjälp med olika utkast till denna artikel: Jeff Bauer, Simon Brunning, Brett Cannon, Michael Chermside, Andrew Dalke, Scott David Daniels, Fred L. Drake, Jr, David Fraser, Kelly Gerber, Raymond Hettinger, Michael Hudson, Chris Lambert, Detlef Lannert, Martin von Löwis, Andrew MacIntyre, Lalo Martins, Chad Netzer, Gustavo Niemeyer, Neal Norwitz, Hans Nowak, Chris Reedy, Francesco Ricciardi, Vinay Sajip, Neil Schemenauer, Roman Suzi, Jason Tishler, Just van Rossum.

source: universal newlines
sv: universella nya rader

source: What's new
sv: Vad är nytt
