Repository: yeager/python-docs-sv
Catalog: whatsnew/2.3.po
Languages: sv

source: In 2.1 and 2.2, pymalloc was an experimental feature and wasn't enabled by default; you had to explicitly enable it when compiling Python by providing the :option:`!--with-pymalloc` option to the :program:`configure` script. In 2.3, pymalloc has had further enhancements and is now enabled by default; you'll have to supply :option:`!--without-pymalloc` to disable it.
sv: I 2.1 och 2.2 var pymalloc en experimentell funktion och var inte aktiverad som standard; du var tvungen att uttryckligen aktivera den när du kompilerade Python genom att ange :option:`!--with-pymalloc`-alternativet till :program:`configure`-skriptet. I 2.3 har pymalloc förbättrats ytterligare och är nu aktiverat som standard; du måste ange :option:`!--without-pymalloc` för att inaktivera det.

source: This change is transparent to code written in Python; however, pymalloc may expose bugs in C extensions. Authors of C extension modules should test their code with pymalloc enabled, because some incorrect code may cause core dumps at runtime.
sv: Denna ändring är transparent för kod skriven i Python, men pymalloc kan avslöja buggar i C-tillägg. Författare till C-tilläggsmoduler bör testa sin kod med pymalloc aktiverat, eftersom viss felaktig kod kan orsaka kärndumpar vid körning.

source: There's one particularly common error that causes problems. There are a number of memory allocation functions in Python's C API that have previously just been aliases for the C library's :c:func:`malloc` and :c:func:`free`, meaning that if you accidentally called mismatched functions the error wouldn't be noticeable. When the object allocator is enabled, these functions aren't aliases of :c:func:`malloc` and :c:func:`free` any more, and calling the wrong function to free memory may get you a core dump. For example, if memory was allocated using :c:func:`PyObject_Malloc`, it has to be freed using :c:func:`PyObject_Free`, not :c:func:`free`. A few modules included with Python fell afoul of this and had to be fixed; doubtless there are more third-party modules that will have the same problem.
sv: Det finns ett särskilt vanligt fel som orsakar problem. Det finns ett antal minnesallokeringsfunktioner i Pythons C API som tidigare bara har varit alias för C-bibliotekets :c:func:`malloc` och :c:func:`free`, vilket innebär att om du av misstag anropade felaktiga funktioner skulle felet inte märkas. När objektallokeraren är aktiverad är dessa funktioner inte längre alias för :c:func:`malloc` och :c:func:`free`, och om du anropar fel funktion för att frigöra minne kan du få en kärndump. Till exempel, om minne allokerades med :c:func:`PyObject_Malloc`, måste det frigöras med :c:func:`PyObject_Free`, inte :c:func:`free`. Några moduler som ingår i Python drabbades av detta och måste åtgärdas; utan tvekan finns det fler tredjepartsmoduler som kommer att ha samma problem.

source: As part of this change, the confusing multiple interfaces for allocating memory have been consolidated down into two API families. Memory allocated with one family must not be manipulated with functions from the other family. There is one family for allocating chunks of memory and another family of functions specifically for allocating Python objects.
sv: Som en del av denna förändring har de förvirrande många gränssnitten för allokering av minne konsoliderats till två API-familjer. Minne som allokerats med den ena familjen får inte manipuleras med funktioner från den andra familjen. Det finns en familj för allokering av minnesbitar och en annan familj med funktioner som är särskilt avsedda för allokering av Python-objekt.

source: To allocate and free an undistinguished chunk of memory use the "raw memory" family: :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc`, and :c:func:`PyMem_Free`.
sv: För att allokera och frigöra en oansenlig bit minne använder du "raw memory"-familjen: :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` och :c:func:`PyMem_Free`.

source: The "object memory" family is the interface to the pymalloc facility described above and is biased towards a large number of "small" allocations: :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc`, and :c:func:`PyObject_Free`.
sv: Familjen "object memory" är gränssnittet till pymalloc-funktionen som beskrivs ovan och är inriktad på ett stort antal "små" allokeringar: :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` och :c:func:`PyObject_Free`.

source: To allocate and free Python objects, use the "object" family :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar`, and :c:func:`PyObject_Del`.
sv: För att allokera och frigöra Python-objekt använder du "object"-familjen :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar` och :c:func:`PyObject_Del`.

source: Thanks to lots of work by Tim Peters, pymalloc in 2.3 also provides debugging features to catch memory overwrites and doubled frees in both extension modules and in the interpreter itself. To enable this support, compile a debugging version of the Python interpreter by running :program:`configure` with :option:`!--with-pydebug`.
sv: Tack vare mycket arbete av Tim Peters har pymalloc i 2.3 också felsökningsfunktioner för att fånga upp minnesöverskrivningar och dubbla frees i både tilläggsmoduler och i själva tolken. För att aktivera detta stöd, kompilera en felsökningsversion av Python-tolken genom att köra :program:`configure` med :option:`!--with-pydebug`.

source: To aid extension writers, a header file :file:`Misc/pymemcompat.h` is distributed with the source to Python 2.3 that allows Python extensions to use the 2.3 interfaces to memory allocation while compiling against any version of Python since 1.5.2. You would copy the file from Python's source distribution and bundle it with the source of your extension.
sv: För att hjälpa författare av tillägg distribueras en header-fil :file:`Misc/pymemcompat.h` med källan till Python 2.3 som gör det möjligt för Python-tillägg att använda 2.3-gränssnitten för minnesallokering när de kompilerar mot alla versioner av Python sedan 1.5.2. Du kopierar filen från Pythons källdistribution och buntar den med källan till ditt tillägg.

source: For the full details of the pymalloc implementation, see the comments at the top of the file :file:`Objects/obmalloc.c` in the Python source code. The above link points to the file within the python.org SVN browser.
sv: För fullständiga detaljer om pymalloc-implementeringen, se kommentarerna högst upp i filen :file:`Objects/obmalloc.c` i Pythons källkod. Ovanstående länk pekar på filen i python.org SVN-webbläsaren.

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Changes to Python's build process and to the C API include:
sv: Ändringar i Pythons byggprocess och i C API inkluderar:

source: The cycle detection implementation used by the garbage collection has proven to be stable, so it's now been made mandatory. You can no longer compile Python without it, and the :option:`!--with-cycle-gc` switch to :program:`configure` has been removed.
sv: Implementationen av cykeldetektering som används av skräpinsamlingen har visat sig vara stabil, så den har nu gjorts obligatorisk. Du kan inte längre kompilera Python utan det, och :option:`!--with-cycle-gc` till :program:`configure` har tagits bort.

source: Python can now optionally be built as a shared library (:file:`libpython2.3.so`) by supplying :option:`!--enable-shared` when running Python's :program:`configure` script. (Contributed by Ondrej Palkovsky.)
sv: Python kan nu eventuellt byggas som ett delat bibliotek (:file:`libpython2.3.so`) genom att ange :option:`!--enable-shared` när Pythons :program:`configure`-skript körs. (Bidrag från Ondrej Palkovsky.)

source: The :c:macro:`!DL_EXPORT` and :c:macro:`!DL_IMPORT` macros are now deprecated. Initialization functions for Python extension modules should now be declared using the new macro :c:macro:`PyMODINIT_FUNC`, while the Python core will generally use the :c:macro:`!PyAPI_FUNC` and :c:macro:`!PyAPI_DATA` macros.
sv: Makrot :c:macro:`!DL_EXPORT` och :c:macro:`!DL_IMPORT` är nu föråldrade. Initialiseringsfunktioner för Python-tilläggsmoduler bör nu deklareras med det nya makrot :c:macro:`PyMODINIT_FUNC`, medan Python-kärnan i allmänhet kommer att använda makrot :c:macro:`!PyAPI_FUNC` och :c:macro:`!PyAPI_DATA`.

source: The interpreter can be compiled without any docstrings for the built-in functions and modules by supplying :option:`!--without-doc-strings` to the :program:`configure` script. This makes the Python executable about 10% smaller, but will also mean that you can't get help for Python's built-ins. (Contributed by Gustavo Niemeyer.)
sv: Tolken kan kompileras utan några dokumentsträngar för de inbyggda funktionerna och modulerna genom att ange :option:`!--without-doc-strings` till :program:`configure`-skriptet. Detta gör Pythons körbara program ca 10% smaller, men innebär också att du inte kan få hjälp med Pythons inbyggda funktioner. (Bidrag från Gustavo Niemeyer.)

source: The :c:func:`!PyArg_NoArgs` macro is now deprecated, and code that uses it should be changed. For Python 2.2 and later, the method definition table can specify the :c:macro:`METH_NOARGS` flag, signalling that there are no arguments, and the argument checking can then be removed. If compatibility with pre-2.2 versions of Python is important, the code could use ``PyArg_ParseTuple(args, "")`` instead, but this will be slower than using :c:macro:`METH_NOARGS`.
sv: Makrot :c:func:`!PyArg_NoArgs` är nu föråldrat, och kod som använder det bör ändras. För Python 2.2 och senare kan metoddefinitionstabellen ange :c:macro:`METH_NOARGS`-flaggan, vilket signalerar att det inte finns några argument, och argumentkontrollen kan då tas bort. Om kompatibilitet med Python-versioner före 2.2 är viktig, kan koden använda ``PyArg_ParseTuple(args, "")`` istället, men detta kommer att vara långsammare än att använda :c:macro:`METH_NOARGS`.

source: :c:func:`PyArg_ParseTuple` accepts new format characters for various sizes of unsigned integers: ``B`` for :c:expr:`unsigned char`, ``H`` for :c:expr:`unsigned short int`, ``I`` for :c:expr:`unsigned int`, and ``K`` for :c:expr:`unsigned long long`.
sv: :c:func:`PyArg_ParseTuple` accepterar nya formattecken för olika storlekar av osignerade heltal: ``B`` för :c:expr:`unsigned char`, ``H`` för :c:expr:`unsigned short int`, ``I`` för :c:expr:`unsigned int`, och ``K`` för :c:expr:`unsigned long long`.

source: A new function, ``PyObject_DelItemString(mapping, char *key)`` was added as shorthand for ``PyObject_DelItem(mapping, PyString_New(key))``.
sv: En ny funktion, ``PyObject_DelItemString(mappning, char *nyckel)`` lades till som kortform för ``PyObject_DelItem(mappning, PyString_New(nyckel))``.

source: File objects now manage their internal string buffer differently, increasing it exponentially when needed. This results in the benchmark tests in :file:`Lib/test/test_bufio.py` speeding up considerably (from 57 seconds to 1.7 seconds, according to one measurement).
sv: File-objekt hanterar nu sin interna strängbuffert annorlunda och ökar den exponentiellt när det behövs. Detta resulterar i att benchmarktesterna i :file:`Lib/test/test_bufio.py` går betydligt snabbare (från 57 sekunder till 1,7 sekunder, enligt en mätning).

source: It's now possible to define class and static methods for a C extension type by setting either the :c:macro:`METH_CLASS` or :c:macro:`METH_STATIC` flags in a method's :c:type:`PyMethodDef` structure.
sv: Det är nu möjligt att definiera klass- och statiska metoder för en C-tilläggstyp genom att ange antingen :c:macro:`METH_CLASS`- eller :c:macro:`METH_STATIC`-flaggorna i en metods :c:type:`PyMethodDef`-struktur.

source: Python now includes a copy of the Expat XML parser's source code, removing any dependence on a system version or local installation of Expat.
sv: Python innehåller nu en kopia av Expat XML-parserns källkod, vilket gör att man inte längre är beroende av en systemversion eller lokal installation av Expat.

source: If you dynamically allocate type objects in your extension, you should be aware of a change in the rules relating to the :attr:`~type.__module__` and :attr:`~type.__name__` attributes. In summary, you will want to ensure the type's dictionary contains a ``'__module__'`` key; making the module name the part of the type name leading up to the final period will no longer have the desired effect. For more detail, read the API reference documentation or the source.
sv: Om du dynamiskt allokerar typobjekt i ditt tillägg bör du vara medveten om en ändring i reglerna för attributen :attr:`~type.__module__` och :attr:`~type.__name__`. Sammanfattningsvis bör du se till att typens dictionary innehåller nyckeln ``'__module__``; att göra modulnamnet till den del av typnamnet som leder fram till den sista perioden kommer inte längre att ha önskad effekt. För mer detaljer, läs API-referensdokumentationen eller källan.

source: Port-Specific Changes
sv: Hamnspecifika ändringar

source: Support for a port to IBM's OS/2 using the EMX runtime environment was merged into the main Python source tree. EMX is a POSIX emulation layer over the OS/2 system APIs. The Python port for EMX tries to support all the POSIX-like capability exposed by the EMX runtime, and mostly succeeds; :func:`!fork` and :func:`fcntl` are restricted by the limitations of the underlying emulation layer. The standard OS/2 port, which uses IBM's Visual Age compiler, also gained support for case-sensitive import semantics as part of the integration of the EMX port into CVS. (Contributed by Andrew MacIntyre.)
sv: Stöd för en portning till IBM:s OS/2 med hjälp av EMX runtime-miljön slogs samman med Pythons huvudkällträd. EMX är ett POSIX-emuleringslager över OS/2-systemets API:er. Python-portningen för EMX försöker stödja alla POSIX-liknande funktioner som EMX runtime erbjuder och lyckas för det mesta; :func:`!fork` och :func:`fcntl` begränsas av det underliggande emuleringslagrets begränsningar. Standardporten för OS/2, som använder IBM:s Visual Age-kompilator, fick också stöd för skiftlägeskänslig importsemantik som en del av integrationen av EMX-porten i CVS. (Bidrag från Andrew MacIntyre.)

source: On MacOS, most toolbox modules have been weaklinked to improve backward compatibility. This means that modules will no longer fail to load if a single routine is missing on the current OS version. Instead calling the missing routine will raise an exception. (Contributed by Jack Jansen.)
sv: På MacOS har de flesta verktygslådemoduler försetts med svaga länkar för att förbättra bakåtkompatibiliteten. Detta innebär att moduler inte längre misslyckas med att laddas om en enda rutin saknas i den aktuella OS-versionen. Istället kommer anrop av den saknade rutinen att ge upphov till ett undantag. (Bidrag från Jack Jansen.)

source: The RPM spec files, found in the :file:`Misc/RPM/` directory in the Python source distribution, were updated for 2.3. (Contributed by Sean Reifschneider.)
sv: RPM-specifikationsfilerna, som finns i katalogen :file:`Misc/RPM/` i Python-källdistributionen, uppdaterades för 2.3. (Bidrag från Sean Reifschneider.)

source: Other new platforms now supported by Python include AtheOS (http://www.atheos.cx/), GNU/Hurd, and OpenVMS.
sv: Andra nya plattformar som nu stöds av Python är AtheOS (http://www.atheos.cx/), GNU/Hurd och OpenVMS.

source: Other Changes and Fixes
sv: Övriga ändringar och korrigeringar

source: As usual, there were a bunch of other improvements and bugfixes scattered throughout the source tree. A search through the CVS change logs finds there were 523 patches applied and 514 bugs fixed between Python 2.2 and 2.3. Both figures are likely to be underestimates.
sv: Som vanligt fanns det en massa andra förbättringar och buggfixar utspridda i hela källträdet. En sökning genom CVS-ändringsloggarna visar att det fanns 523 patchar tillämpade och 514 buggar fixade mellan Python 2.2 och 2.3. Båda siffrorna är sannolikt underskattningar.

source: Some of the more notable changes are:
sv: Några av de mer anmärkningsvärda förändringarna är:

source: If the :envvar:`PYTHONINSPECT` environment variable is set, the Python interpreter will enter the interactive prompt after running a Python program, as if Python had been invoked with the :option:`-i` option. The environment variable can be set before running the Python interpreter, or it can be set by the Python program as part of its execution.
sv: Om miljövariabeln :envvar:`PYTHONINSPECT` är inställd kommer Python-tolken att gå till den interaktiva prompten efter att ha kört ett Python-program, som om Python hade anropats med alternativet :option:`-i`. Miljövariabeln kan sättas innan Python-tolken körs, eller så kan den sättas av Python-programmet som en del av dess exekvering.

source: The :file:`regrtest.py` script now provides a way to allow "all resources except *foo*." A resource name passed to the :option:`!-u` option can now be prefixed with a hyphen (``'-'``) to mean "remove this resource." For example, the option '``-uall,-bsddb``' could be used to enable the use of all resources except ``bsddb``.
sv: Skriptet :file:`regrtest.py` erbjuder nu ett sätt att tillåta "alla resurser utom *foo*" Ett resursnamn som skickas till alternativet :option:`!-u` kan nu förses med ett bindestreck (``'-'``) för att betyda "ta bort den här resursen" Till exempel kan alternativet "``-uall,-bsddb``" användas för att aktivera användningen av alla resurser utom ``bsddb``.

source: The tools used to build the documentation now work under Cygwin as well as Unix.
sv: De verktyg som används för att bygga dokumentationen fungerar nu under Cygwin såväl som Unix.

source: The ``SET_LINENO`` opcode has been removed. Back in the mists of time, this opcode was needed to produce line numbers in tracebacks and support trace functions (for, e.g., :mod:`pdb`). Since Python 1.5, the line numbers in tracebacks have been computed using a different mechanism that works with "python -O". For Python 2.3 Michael Hudson implemented a similar scheme to determine when to call the trace function, removing the need for ``SET_LINENO`` entirely.
sv: Operativkoden ``SET_LINENO`` har tagits bort. Förr i tiden behövdes denna opcode för att producera radnummer i spårningar och stödja spårningsfunktioner (för t.ex. :mod:`pdb`). Sedan Python 1.5 har radnumren i tracebacks beräknats med hjälp av en annan mekanism som fungerar med "python -O". För Python 2.3 har Michael Hudson implementerat ett liknande system för att avgöra när trace-funktionen ska anropas, vilket helt tar bort behovet av ``SET_LINENO``.

source: It would be difficult to detect any resulting difference from Python code, apart from a slight speed up when Python is run without :option:`-O`.
sv: Det skulle vara svårt att upptäcka någon skillnad i Python-kod, bortsett från en liten hastighetsökning när Python körs utan :option:`-O`.

source: C extensions that access the :attr:`~frame.f_lineno` field of frame objects should instead call ``PyCode_Addr2Line(f->f_code, f->f_lasti)``. This will have the added effect of making the code work as desired under "python -O" in earlier versions of Python.
sv: C-tillägg som använder fältet :attr:`~frame.f_lineno` i frame-objekt bör istället anropa ``PyCode_Addr2Line(f->f_code, f->f_lasti)``. Detta kommer att ha den extra effekten att koden fungerar som önskat under "python -O" i tidigare versioner av Python.

source: A nifty new feature is that trace functions can now assign to the :attr:`~frame.f_lineno` attribute of frame objects, changing the line that will be executed next. A ``jump`` command has been added to the :mod:`pdb` debugger taking advantage of this new feature. (Implemented by Richie Hindle.)
sv: En fiffig ny funktion är att spårningsfunktioner nu kan tilldelas attributet :attr:`~frame.f_lineno` för frame-objekt, vilket ändrar vilken rad som kommer att exekveras härnäst. Ett ``jump``-kommando har lagts till i :mod:`pdb`-felsökaren för att dra nytta av denna nya funktion. (Implementerat av Richie Hindle.)

source: Porting to Python 2.3
sv: Portning till Python 2.3

source: This section lists previously described changes that may require changes to your code:
sv: I detta avsnitt listas tidigare beskrivna ändringar som kan kräva ändringar i din kod:

source: :keyword:`yield` is now always a keyword; if it's used as a variable name in your code, a different name must be chosen.
sv: :keyword:`yield` är nu alltid ett nyckelord; om det används som variabelnamn i din kod måste du välja ett annat namn.

source: For strings *X* and *Y*, ``X in Y`` now works if *X* is more than one character long.
sv: För strängar *X* och *Y* fungerar nu ``X i Y`` om *X* är mer än ett tecken lång.

source: The :func:`int` type constructor will now return a long integer instead of raising an :exc:`OverflowError` when a string or floating-point number is too large to fit into an integer.
sv: Typkonstruktören :func:`int` returnerar nu ett långt heltal istället för att ge upphov till ett :exc:`OverflowError` när en sträng eller ett flyttal är för stort för att rymmas i ett heltal.

source: If you have Unicode strings that contain 8-bit characters, you must declare the file's encoding (UTF-8, Latin-1, or whatever) by adding a comment to the top of the file. See section :ref:`section-encodings` for more information.
sv: Om du har Unicode-strängar som innehåller 8-bitars tecken måste du ange filens kodning (UTF-8, Latin-1 eller något annat) genom att lägga till en kommentar längst upp i filen. Se avsnitt :ref:`section-encodings` för mer information.

source: Calling Tcl methods through :mod:`!_tkinter` no longer returns only strings. Instead, if Tcl returns other objects those objects are converted to their Python equivalent, if one exists, or wrapped with a :class:`!_tkinter.Tcl_Obj` object if no Python equivalent exists.
sv: Anrop av Tcl-metoder via :mod:`!_tkinter` returnerar inte längre bara strängar. Istället, om Tcl returnerar andra objekt konverteras dessa objekt till sin Python-ekvivalent, om en sådan finns, eller omsluts med ett :class:`!_tkinter.Tcl_Obj`-objekt om ingen Python-ekvivalent finns.

source: Large octal and hex literals such as ``0xffffffff`` now trigger a :exc:`FutureWarning`. Currently they're stored as 32-bit numbers and result in a negative value, but in Python 2.4 they'll become positive long integers.
sv: Stora oktal- och hex-literaler som ``0xffffffff`` utlöser nu en :exc:`FutureWarning`. För närvarande lagras de som 32-bitars tal och resulterar i ett negativt värde, men i Python 2.4 kommer de att bli positiva långa heltal.

source: There are a few ways to fix this warning. If you really need a positive number, just add an ``L`` to the end of the literal. If you're trying to get a 32-bit integer with low bits set and have previously used an expression such as ``~(1 << 31)``, it's probably clearest to start with all bits set and clear the desired upper bits. For example, to clear just the top bit (bit 31), you could write ``0xffffffffL &~(1L<<31)``.
sv: Det finns några sätt att åtgärda denna varning. Om du verkligen behöver ett positivt tal, lägg bara till ett ``L`` i slutet av det bokstavliga talet. Om du försöker få ett 32-bitars heltal med låga bitar inställda och tidigare har använt ett uttryck som ``~(1 << 31)``, är det förmodligen tydligast att börja med alla bitar inställda och rensa de önskade övre bitarna. Om du till exempel bara vill rensa den översta biten (bit 31) kan du skriva ``0xffffffffffL &~(1L<<31)``.

source: You can no longer disable assertions by assigning to ``__debug__``.
sv: Du kan inte längre inaktivera påståenden genom att tilldela till ``__debug__``.
