Repository: yeager/python-docs-sv
Catalog: whatsnew/2.4.po
Languages: sv

source: >>> input = open('/etc/passwd', 'r') >>> for line in reversed(list(input)): ... print line ... root:*:0:0:System Administrator:/var/root:/bin/tcsh ...
sv: >>> input = open('/etc/passwd', 'r') >>> for line in reversed(list(input)): ... skriv ut rad ... root:*:0:0:Systemadministratör:/var/root:/bin/tcsh ...

source: :pep:`322` - Reverse Iteration
sv: :pep:`322` - Omvänd iteration

source: Written and implemented by Raymond Hettinger.
sv: Skriven och implementerad av Raymond Hettinger.

source: PEP 324: New subprocess Module
sv: PEP 324: Ny delprocess Modul

source: The standard library provides a number of ways to execute a subprocess, offering different features and different levels of complexity. ``os.system(command)`` is easy to use, but slow (it runs a shell process which executes the command) and dangerous (you have to be careful about escaping the shell's metacharacters). The :mod:`!popen2` module offers classes that can capture standard output and standard error from the subprocess, but the naming is confusing. The :mod:`subprocess` module cleans this up, providing a unified interface that offers all the features you might need.
sv: Standardbiblioteket tillhandahåller ett antal sätt att exekvera en subprocess, med olika funktioner och olika komplexitetsnivåer. ``os.system(command)`` är lätt att använda, men långsam (den kör en skalprocess som exekverar kommandot) och farlig (du måste vara försiktig med att escapa skalets metatecken). Modulen :mod:`!popen2` erbjuder klasser som kan fånga standardutdata och standardfel från subprocessen, men namngivningen är förvirrande. Modulen :mod:`subprocess` rensar upp detta och ger ett enhetligt gränssnitt som erbjuder alla funktioner du kan behöva.

source: Instead of :mod:`!popen2`'s collection of classes, :mod:`subprocess` contains a single class called :class:`subprocess.Popen` whose constructor supports a number of different keyword arguments. ::
sv: Istället för :mod:`!popen2`:s samling av klasser innehåller :mod:`subprocess` en enda klass som heter :class:`subprocess.Popen` vars konstruktor stöder ett antal olika nyckelordsargument. ::

source: class Popen(args, bufsize=0, executable=None, stdin=None, stdout=None, stderr=None, preexec_fn=None, close_fds=False, shell=False, cwd=None, env=None, universal_newlines=False, startupinfo=None, creationflags=0):
sv: class Popen(args, bufsize=0, körbar=None, stdin=None, stdout=None, stderr=None, preexec_fn=None, close_fds=False, shell=False, cwd=Ingen, env=Ingen, universal_newlines=False, startupinfo=None, creationflags=0):

source: *args* is commonly a sequence of strings that will be the arguments to the program executed as the subprocess. (If the *shell* argument is true, *args* can be a string which will then be passed on to the shell for interpretation, just as :func:`os.system` does.)
sv: *args* är vanligen en sekvens av strängar som kommer att vara argumenten till det program som körs som subprocess. (Om argumentet *shell* är sant kan *args* vara en sträng som sedan skickas vidare till skalet för tolkning, precis som :func:`os.system` gör)

source: *stdin*, *stdout*, and *stderr* specify what the subprocess's input, output, and error streams will be. You can provide a file object or a file descriptor, or you can use the constant ``subprocess.PIPE`` to create a pipe between the subprocess and the parent.
sv: *stdin*, *stdout* och *stderr* anger vad subprocessens in-, ut- och felströmmar ska vara. Du kan ange ett filobjekt eller en filbeskrivare, eller så kan du använda konstanten ``subprocess.PIPE`` för att skapa en pipe mellan subprocessen och den överordnade processen.

source: The constructor has a number of handy options:
sv: Konstruktören har ett antal praktiska alternativ:

source: *close_fds* requests that all file descriptors be closed before running the subprocess.
sv: *close_fds* begär att alla filbeskrivare stängs innan subprocessen körs.

source: *cwd* specifies the working directory in which the subprocess will be executed (defaulting to whatever the parent's working directory is).
sv: *cwd* anger den arbetskatalog i vilken subprocessen ska köras (standard är den överordnade processens arbetskatalog).

source: *env* is a dictionary specifying environment variables.
sv: *env* är en ordbok som anger miljövariabler.

source: *preexec_fn* is a function that gets called before the child is started.
sv: *preexec_fn* är en funktion som anropas innan barnet startas.

source: *universal_newlines* opens the child's input and output using Python's :term:`universal newlines` feature.
sv: *universal_newlines* öppnar barnets in- och utdata med hjälp av Pythons :term:`universal newlines`-funktion.

source: Once you've created the :class:`Popen` instance, you can call its :meth:`wait` method to pause until the subprocess has exited, :meth:`poll` to check if it's exited without pausing, or ``communicate(data)`` to send the string *data* to the subprocess's standard input. ``communicate(data)`` then reads any data that the subprocess has sent to its standard output or standard error, returning a tuple ``(stdout_data, stderr_data)``.
sv: När du har skapat instansen :class:`Popen` kan du anropa dess metod :meth:`wait` för att pausa tills subprocessen har avslutats, :meth:`poll` för att kontrollera om den har avslutats utan paus, eller ``communicate(data)`` för att skicka strängen *data* till subprocessens standardinmatning. ``communicate(data)`` läser sedan alla data som underprocessen har skickat till sin standardutgång eller standardfel, och returnerar en tupel ``(stdout_data, stderr_data)``.

source: :func:`call` is a shortcut that passes its arguments along to the :class:`Popen` constructor, waits for the command to complete, and returns the status code of the subprocess. It can serve as a safer analog to :func:`os.system`::
sv: :func:`call` är en genväg som skickar sina argument till :class:`Popen`-konstruktören, väntar på att kommandot ska slutföras och returnerar statuskoden för underprocessen. Den kan fungera som en säkrare motsvarighet till :func:`os.system`::

source: sts = subprocess.call(['dpkg', '-i', '/tmp/new-package.deb']) if sts == 0: # Success ... else: # dpkg returned an error ...
sv: sts = subprocess.call(['dpkg', '-i', '/tmp/new-package.deb']) if sts == 0: # Framgång ... else: # dpkg returnerade ett fel ...

source: The command is invoked without use of the shell. If you really do want to use the shell, you can add ``shell=True`` as a keyword argument and provide a string instead of a sequence::
sv: Kommandot anropas utan användning av skalet. Om du verkligen vill använda skalet kan du lägga till ``shell=True`` som ett nyckelordsargument och ange en sträng i stället för en sekvens::

source: sts = subprocess.call('dpkg -i /tmp/new-package.deb', shell=True)
sv: sts = subprocess.call('dpkg -i /tmp/nytt-paket.deb', shell=True)

source: The PEP takes various examples of shell and Python code and shows how they'd be translated into Python code that uses :mod:`subprocess`. Reading this section of the PEP is highly recommended.
sv: PEP:en tar olika exempel på shell- och Python-kod och visar hur de skulle kunna översättas till Python-kod som använder :mod:`subprocess`. Att läsa detta avsnitt av PEP rekommenderas starkt.

source: :pep:`324` - subprocess - New process module
sv: :pep:`324` - subprocess - Ny processmodul

source: Written and implemented by Peter Åstrand, with assistance from Fredrik Lundh and others.
sv: Skriven och implementerad av Peter Åstrand, med hjälp av bland andra Fredrik Lundh.

source: PEP 327: Decimal Data Type
sv: PEP 327: Decimal datatyp

source: Python has always supported floating-point (FP) numbers, based on the underlying C :c:expr:`double` type, as a data type. However, while most programming languages provide a floating-point type, many people (even programmers) are unaware that floating-point numbers don't represent certain decimal fractions accurately. The new :class:`Decimal` type can represent these fractions accurately, up to a user-specified precision limit.
sv: Python har alltid haft stöd för flyttal (FP), baserat på den underliggande C :c:expr:`double`-typen, som datatyp. Men även om de flesta programmeringsspråk tillhandahåller en flyttalstyp, är många människor (även programmerare) omedvetna om att flyttal inte representerar vissa decimalfraktioner korrekt. Den nya typen :class:`Decimal` kan representera dessa fraktioner korrekt, upp till en användarspecificerad precisionsgräns.

source: Why is Decimal needed?
sv: Varför behövs Decimal?

source: The limitations arise from the representation used for floating-point numbers. FP numbers are made up of three components:
sv: Begränsningarna härrör från den representation som används för flyttal. FP-tal består av tre komponenter:

source: The sign, which is positive or negative.
sv: Tecknet, som är positivt eller negativt.

source: The mantissa, which is a single-digit binary number followed by a fractional part. For example, ``1.01`` in base-2 notation is ``1 + 0/2 + 1/4``, or 1.25 in decimal notation.
sv: Mantissan, som är ett ensiffrigt binärt tal följt av en bråkdel. Till exempel är ``1,01`` i bas-2-notation ``1 + 0/2 + 1/4``, eller 1,25 i decimalnotation.

source: The exponent, which tells where the decimal point is located in the number represented.
sv: Exponenten, som anger var decimaltecknet är placerat i det representerade talet.

source: For example, the number 1.25 has positive sign, a mantissa value of 1.01 (in binary), and an exponent of 0 (the decimal point doesn't need to be shifted). The number 5 has the same sign and mantissa, but the exponent is 2 because the mantissa is multiplied by 4 (2 to the power of the exponent 2); 1.25 \* 4 equals 5.
sv: Till exempel har talet 1,25 positivt tecken, ett mantissavärde på 1,01 (i binär) och en exponent på 0 (decimaltecknet behöver inte flyttas). Talet 5 har samma tecken och mantissa, men exponenten är 2 eftersom mantissan multipliceras med 4 (2 i potens med exponenten 2); 1,25 \* 4 är lika med 5.

source: Modern systems usually provide floating-point support that conforms to a standard called IEEE 754. C's :c:expr:`double` type is usually implemented as a 64-bit IEEE 754 number, which uses 52 bits of space for the mantissa. This means that numbers can only be specified to 52 bits of precision. If you're trying to represent numbers whose expansion repeats endlessly, the expansion is cut off after 52 bits. Unfortunately, most software needs to produce output in base 10, and common fractions in base 10 are often repeating decimals in binary. For example, 1.1 decimal is binary ``1.0001100110011 ...``; .1 = 1/16 + 1/32 + 1/256 plus an infinite number of additional terms. IEEE 754 has to chop off that infinitely repeated decimal after 52 digits, so the representation is slightly inaccurate.
sv: Moderna system har vanligtvis stöd för flyttal som följer en standard som kallas IEEE 754. C:s typ :c:expr:`double` implementeras vanligtvis som ett 64-bitars IEEE 754-tal, som använder 52 bitars utrymme för mantissan. Detta innebär att tal endast kan specificeras med 52 bitars precision. Om du försöker representera tal vars expansion upprepas i det oändliga, avbryts expansionen efter 52 bitar. Tyvärr måste de flesta programvaror producera utdata i bas 10, och vanliga bråk i bas 10 är ofta upprepade decimaler i binär. Till exempel är 1,1 decimal binär ``1,0001100110011 ...``; .1 = 1/16 + 1/32 + 1/256 plus ett oändligt antal ytterligare termer. IEEE 754 måste hugga bort den oändligt upprepade decimalen efter 52 siffror, så representationen är något felaktig.

source: Sometimes you can see this inaccuracy when the number is printed::
sv: Ibland kan du se denna felaktighet när numret skrivs ut::

source: The inaccuracy isn't always visible when you print the number because the FP-to-decimal-string conversion is provided by the C library, and most C libraries try to produce sensible output. Even if it's not displayed, however, the inaccuracy is still there and subsequent operations can magnify the error.
sv: Felaktigheten syns inte alltid när du skriver ut talet eftersom konverteringen av FP till decimalsträng tillhandahålls av C-biblioteket, och de flesta C-bibliotek försöker producera förnuftig utdata. Även om det inte visas, finns felaktigheten fortfarande kvar och efterföljande operationer kan förstora felet.

source: For many applications this doesn't matter. If I'm plotting points and displaying them on my monitor, the difference between 1.1 and 1.1000000000000001 is too small to be visible. Reports often limit output to a certain number of decimal places, and if you round the number to two or three or even eight decimal places, the error is never apparent. However, for applications where it does matter, it's a lot of work to implement your own custom arithmetic routines.
sv: För många tillämpningar spelar detta ingen roll. Om jag plottar punkter och visar dem på min bildskärm är skillnaden mellan 1,1 och 1,1000000000000001 för liten för att synas. Rapporter begränsar ofta utdata till ett visst antal decimaler och om man avrundar till två, tre eller till och med åtta decimaler syns aldrig felet. För applikationer där det spelar roll är det dock mycket arbete att implementera egna aritmetiska rutiner.

source: Hence, the :class:`Decimal` type was created.
sv: Därför skapades typen :class:`Decimal`.

source: The :class:`Decimal` type
sv: Typen :class:`Decimal

source: A new module, :mod:`decimal`, was added to Python's standard library. It contains two classes, :class:`Decimal` and :class:`Context`. :class:`Decimal` instances represent numbers, and :class:`Context` instances are used to wrap up various settings such as the precision and default rounding mode.
sv: En ny modul, :mod:`decimal`, har lagts till i Pythons standardbibliotek. Den innehåller två klasser, :class:`Decimal` och :class:`Context`. :class:`Decimal`-instanser representerar tal, och :class:`Context`-instanser används för att sammanfatta olika inställningar som precision och standardavrundningsläge.

source: :class:`Decimal` instances are immutable, like regular Python integers and FP numbers; once it's been created, you can't change the value an instance represents. :class:`Decimal` instances can be created from integers or strings::
sv: :class:`Decimal`-instanser är oföränderliga, precis som vanliga heltal och FP-tal i Python; när de väl har skapats kan du inte ändra det värde som en instans representerar. :class:`Decimal`-instanser kan skapas från heltal eller strängar::

source: You can also provide tuples containing the sign, the mantissa represented as a tuple of decimal digits, and the exponent::
sv: Du kan också ange tuples som innehåller tecknet, mantissan representerad som en tuple av decimalsiffror och exponenten::

source: Cautionary note: the sign bit is a Boolean value, so 0 is positive and 1 is negative.
sv: Försiktighetsåtgärd: teckenbiten är ett booleskt värde, så 0 är positivt och 1 är negativt.

source: Converting from floating-point numbers poses a bit of a problem: should the FP number representing 1.1 turn into the decimal number for exactly 1.1, or for 1.1 plus whatever inaccuracies are introduced? The decision was to dodge the issue and leave such a conversion out of the API. Instead, you should convert the floating-point number into a string using the desired precision and pass the string to the :class:`Decimal` constructor::
sv: Konvertering från flyttal innebär lite av ett problem: ska FP-talet som representerar 1,1 bli decimaltalet för exakt 1,1, eller för 1,1 plus eventuella felaktigheter som införs? Beslutet blev att undvika problemet och lämna en sådan konvertering utanför API:et. Istället bör du konvertera flyttalstalet till en sträng med önskad precision och skicka strängen till :class:`Decimal`-konstruktören::

source: Once you have :class:`Decimal` instances, you can perform the usual mathematical operations on them. One limitation: exponentiation requires an integer exponent::
sv: När du har :class:`Decimal`-instanser kan du utföra de vanliga matematiska operationerna på dem. En begränsning: exponentiering kräver en heltalsexponent::

source: >>> a = decimal.Decimal('35.72') >>> b = decimal.Decimal('1.73') >>> a+b Decimal("37.45") >>> a-b Decimal("33.99") >>> a*b Decimal("61.7956") >>> a/b Decimal("20.64739884393063583815028902") >>> a ** 2 Decimal("1275.9184") >>> a**b Traceback (most recent call last): ... decimal.InvalidOperation: x ** (non-integer)
sv: >>> a = decimal.Decimal('35.72') >>> b = decimal.decimal('1,73') >>> a+b Decimal("37,45") >>> a-b Decimal("33,99") >>> a*b Decimal("61,7956") >>> a/b Decimal("20.64739884393063583815028902") >>> a ** 2 Decimal("1275,9184") >>> a**b Traceback (senaste anropet senast): ... decimal.InvalidOperation: x ** (icke-integer)

source: You can combine :class:`Decimal` instances with integers, but not with floating-point numbers::
sv: Du kan kombinera :class:`Decimal`-instanser med heltal, men inte med flyttal::

source: >>> a + 4 Decimal("39.72") >>> a + 4.5 Traceback (most recent call last): ... TypeError: You can interact Decimal only with int, long or Decimal data types. >>>
sv: >>> a + 4 Decimal("39,72") >>> a + 4.5 Traceback (senaste anropet senast): ... TypeError (Typfel): Du kan bara interagera Decimal med datatyperna int, long eller Decimal. >>>

source: :class:`Decimal` numbers can be used with the :mod:`math` and :mod:`cmath` modules, but note that they'll be immediately converted to floating-point numbers before the operation is performed, resulting in a possible loss of precision and accuracy. You'll also get back a regular floating-point number and not a :class:`Decimal`. ::
sv: :class:`Decimal`-tal kan användas med modulerna :mod:`math` och :mod:`cmath`, men observera att de omedelbart konverteras till flyttal innan operationen utförs, vilket kan resultera i en möjlig förlust av precision och noggrannhet. Du kommer också att få tillbaka ett vanligt flyttal och inte ett :class:`Decimal`. ::

source: >>> import math, cmath >>> d = decimal.Decimal('123456789012.345') >>> math.sqrt(d) 351364.18288201344 >>> cmath.sqrt(-d) 351364.18288201344j
sv: >>> import matematik, cmath >>> d = decimal.Decimal('123456789012.345') >>> math.sqrt(d) 351364.18288201344 >>> cmath.sqrt(-d) 351364.18288201344j

source: :class:`Decimal` instances have a :meth:`sqrt` method that returns a :class:`Decimal`, but if you need other things such as trigonometric functions you'll have to implement them. ::
sv: :class:`Decimal`-instanser har en :meth:`sqrt`-metod som returnerar en :class:`Decimal`, men om du behöver andra saker, t.ex. trigonometriska funktioner, måste du implementera dem:

source: The :class:`Context` type
sv: Typen :class:`Context

source: Instances of the :class:`Context` class encapsulate several settings for decimal operations:
sv: Instanser av klassen :class:`Context` kapslar in flera inställningar för decimaloperationer:

source: :attr:`prec` is the precision, the number of decimal places.
sv: :attr:`prec` är precisionen, antalet decimaler.

source: :attr:`rounding` specifies the rounding mode. The :mod:`decimal` module has constants for the various possibilities: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN`, and various others.
sv: :attr:`rounding` anger avrundningssättet. Modulen :mod:`decimal` har konstanter för de olika möjligheterna: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN` och flera andra.

source: :attr:`traps` is a dictionary specifying what happens on encountering certain error conditions: either an exception is raised or a value is returned. Some examples of error conditions are division by zero, loss of precision, and overflow.
sv: :attr:`traps` är en ordbok som anger vad som händer när vissa feltillstånd inträffar: antingen uppstår ett undantag eller så returneras ett värde. Några exempel på feltillstånd är division med noll, precisionsförlust och överflöd.

source: There's a thread-local default context available by calling :func:`getcontext`; you can change the properties of this context to alter the default precision, rounding, or trap handling. The following example shows the effect of changing the precision of the default context::
sv: Det finns en trådlokal standardkontext tillgänglig genom att anropa :func:`getcontext`; du kan ändra egenskaperna för denna kontext för att ändra standardprecision, avrundning eller trap-hantering. Följande exempel visar effekten av att ändra precisionen för standardkontexten::

source: The default action for error conditions is selectable; the module can either return a special value such as infinity or not-a-number, or exceptions can be raised::
sv: Standardåtgärden för feltillstånd är valbar; modulen kan antingen returnera ett specialvärde som oändlighet eller inte ett tal, eller så kan undantag skapas::

source: >>> decimal.Decimal(1) / decimal.Decimal(0) Traceback (most recent call last): ... decimal.DivisionByZero: x / 0 >>> decimal.getcontext().traps[decimal.DivisionByZero] = False >>> decimal.Decimal(1) / decimal.Decimal(0) Decimal("Infinity") >>>
sv: >>> decimal.Decimal(1) / decimal.Decimal(0) Traceback (senaste anropet senast): ... decimal.DivisionByZero: x / 0 >>> decimal.getcontext().traps[decimal.DivisionByZero] = False >>> decimal.Decimal(1) / decimal.Decimal(0) Decimal("Oändlighet") >>>

source: The :class:`Context` instance also has various methods for formatting numbers such as :meth:`to_eng_string` and :meth:`to_sci_string`.
sv: Instansen :class:`Context` har också olika metoder för att formatera tal, t.ex. :meth:`to_eng_string` och :meth:`to_sci_string`.

source: For more information, see the documentation for the :mod:`decimal` module, which includes a quick-start tutorial and a reference.
sv: Mer information finns i dokumentationen för modulen :mod:`decimal`, som innehåller en snabbstartshandledning och en referens.

source: :pep:`327` - Decimal Data Type
sv: :pep:`327` - Decimal datatyp

source: Written by Facundo Batista and implemented by Facundo Batista, Eric Price, Raymond Hettinger, Aahz, and Tim Peters.
sv: Skriven av Facundo Batista och implementerad av Facundo Batista, Eric Price, Raymond Hettinger, Aahz och Tim Peters.

source: The article uses Fortran code to illustrate many of the problems that floating-point inaccuracy can cause.
sv: I artikeln används Fortran-kod för att illustrera många av de problem som felaktigheter i flyttal kan orsaka.

source: A description of a decimal-based representation. This representation is being proposed as a standard, and underlies the new Python decimal type. Much of this material was written by Mike Cowlishaw, designer of the Rexx language.
sv: En beskrivning av en decimalbaserad representation. Denna representation föreslås som en standard och ligger till grund för Pythons nya decimaltyp. Mycket av detta material har skrivits av Mike Cowlishaw, designer av Rexx-språket.

source: PEP 328: Multi-line Imports
sv: PEP 328: Import av flera linjer

source: One language change is a small syntactic tweak aimed at making it easier to import many names from a module. In a ``from module import names`` statement, *names* is a sequence of names separated by commas. If the sequence is very long, you can either write multiple imports from the same module, or you can use backslashes to escape the line endings like this::
sv: En språkändring är en liten syntaktisk justering som syftar till att göra det enklare att importera många namn från en modul. I en ``from module import names``-sats är *names* en sekvens av namn åtskilda med kommatecken. Om sekvensen är mycket lång kan du antingen skriva flera importer från samma modul, eller så kan du använda backslashes för att undkomma radavslutningarna så här::
