Repository: yeager/python-docs-sv
Catalog: whatsnew/2.4.po
Languages: sv

source: The :mod:`signal` module now performs tighter error-checking on the parameters to the :func:`signal.signal` function. For example, you can't set a handler on the :const:`SIGKILL` signal; previous versions of Python would quietly accept this, but 2.4 will raise a :exc:`RuntimeError` exception.
sv: Modulen :mod:`signal` utför nu en striktare felkontroll på parametrarna till funktionen :func:`signal.signal`. Till exempel kan du inte ställa in en hanterare på :const:`SIGKILL`-signalen; tidigare versioner av Python skulle tyst acceptera detta, men 2.4 kommer att ge upphov till ett :exc:`RuntimeError`-undantag.

source: Two new functions were added to the :mod:`socket` module. :func:`socketpair` returns a pair of connected sockets and ``getservbyport(port)`` looks up the service name for a given port number. (Contributed by Dave Cole and Barry Warsaw.)
sv: Två nya funktioner har lagts till i modulen :mod:`socket`. :func:`socketpair` returnerar ett par anslutna socklar och ``getservbyport(port)`` söker upp servicenamnet för ett givet portnummer. (Bidrag från Dave Cole och Barry Warsaw.)

source: The :func:`sys.exitfunc` function has been deprecated. Code should be using the existing :mod:`atexit` module, which correctly handles calling multiple exit functions. Eventually :func:`sys.exitfunc` will become a purely internal interface, accessed only by :mod:`atexit`.
sv: Funktionen :func:`sys.exitfunc` har utgått. Kod bör använda den befintliga modulen :mod:`atexit`, som korrekt hanterar anrop av flera exit-funktioner. Så småningom kommer :func:`sys.exitfunc` att bli ett rent internt gränssnitt, som endast nås av :mod:`atexit`.

source: The :mod:`tarfile` module now generates GNU-format tar files by default. (Contributed by Lars Gustäbel.)
sv: Modulen :mod:`tarfile` genererar nu tar-filer i GNU-format som standard. (Bidrag från Lars Gustäbel.)

source: The :mod:`threading` module now has an elegantly simple way to support thread-local data. The module contains a :class:`local` class whose attribute values are local to different threads. ::
sv: Modulen :mod:`threading` har nu ett elegant och enkelt sätt att stödja trådlokala data. Modulen innehåller en :class:`local`-klass vars attributvärden är lokala för olika trådar. ::

source: Other threads can assign and retrieve their own values for the :attr:`number` and :attr:`url` attributes. You can subclass :class:`local` to initialize attributes or to add methods. (Contributed by Jim Fulton.)
sv: Andra trådar kan tilldela och hämta sina egna värden för attributen :attr:`number` och :attr:`url`. Du kan underklassa :class:`local` för att initiera attribut eller lägga till metoder. (Bidrag från Jim Fulton.)

source: The :mod:`timeit` module now automatically disables periodic garbage collection during the timing loop. This change makes consecutive timings more comparable. (Contributed by Raymond Hettinger.)
sv: Modulen :mod:`timeit` inaktiverar nu automatiskt periodisk skräpinsamling under tidtagningsslingan. Denna förändring gör på varandra följande tidtagningar mer jämförbara. (Bidrag från Raymond Hettinger.)

source: The :mod:`weakref` module now supports a wider variety of objects including Python functions, class instances, sets, frozensets, deques, arrays, files, sockets, and regular expression pattern objects. (Contributed by Raymond Hettinger.)
sv: Modulen :mod:`weakref` stöder nu ett större antal objekt, inklusive Python-funktioner, klassinstanser, set, frozensets, deques, arrays, filer, sockets och objekt med mönster för reguljära uttryck. (Bidrag från Raymond Hettinger.)

source: The :mod:`xmlrpclib <xmlrpc.client>` module now supports a multi-call extension for transmitting multiple XML-RPC calls in a single HTTP operation. (Contributed by Brian Quinlan.)
sv: Modulen :mod:`xmlrpclib <xmlrpc.client>` stöder nu ett tillägg för flera anrop för att överföra flera XML-RPC-anrop i en enda HTTP-operation. (Bidrag från Brian Quinlan.)

source: The :mod:`mpz`, :mod:`rotor`, and :mod:`xreadlines` modules have been removed.
sv: Modulerna :mod:`mpz`, :mod:`rotor` och :mod:`xreadlines` har tagits bort.

source: The :mod:`cookielib <http.cookiejar>` library supports client-side handling for HTTP cookies, mirroring the :mod:`Cookie <http.cookies>` module's server-side cookie support. Cookies are stored in cookie jars; the library transparently stores cookies offered by the web server in the cookie jar, and fetches the cookie from the jar when connecting to the server. As in web browsers, policy objects control whether cookies are accepted or not.
sv: Biblioteket :mod:`cookielib <http.cookiejar>` har stöd för hantering av HTTP-cookies på klientsidan och speglar modulen :mod:`Cookie <http.cookies>`:s stöd för cookies på serversidan. Cookies lagras i cookie-burkar; biblioteket lagrar på ett transparent sätt cookies som erbjuds av webbservern i cookie-burken och hämtar cookien från burken när du ansluter till servern. Precis som i webbläsare styr policyobjekt om cookies ska accepteras eller inte.

source: In order to store cookies across sessions, two implementations of cookie jars are provided: one that stores cookies in the Netscape format so applications can use the Mozilla or Lynx cookie files, and one that stores cookies in the same format as the Perl libwww library.
sv: För att kunna lagra cookies över sessioner finns det två implementeringar av cookie jars: en som lagrar cookies i Netscape-format så att program kan använda Mozilla- eller Lynx-cookiefiler, och en som lagrar cookies i samma format som Perl-biblioteket libwww.

source: :mod:`urllib2 <urllib.request>` has been changed to interact with :mod:`cookielib <http.cookiejar>`: :class:`HTTPCookieProcessor` manages a cookie jar that is used when accessing URLs.
sv: :mod:`urllib2 <urllib.request>` har ändrats för att interagera med :mod:`cookielib <http.cookiejar>`: :class:`HTTPCookieProcessor` hanterar en cookiejar som används vid åtkomst till URL:er.

source: This module was contributed by John J. Lee.
sv: Denna modul har tillhandahållits av John J. Lee.

source: doctest
sv: doktest

source: The :mod:`doctest` module underwent considerable refactoring thanks to Edward Loper and Tim Peters. Testing can still be as simple as running :func:`doctest.testmod`, but the refactorings allow customizing the module's operation in various ways
sv: Modulen :mod:`doctest` har genomgått en betydande omarbetning tack vare Edward Loper och Tim Peters. Testning kan fortfarande vara lika enkelt som att köra :func:`doctest.testmod`, men omarbetningarna gör det möjligt att anpassa modulens funktion på olika sätt

source: The new :class:`DocTestFinder` class extracts the tests from a given object's docstrings::
sv: Den nya :class:`DocTestFinder`-klassen extraherar testerna från ett visst objekts docstrings::

source: def f (x, y): """>>> f(2,2) 4 >>> f(3,2) 6 """ return x*y finder = doctest.DocTestFinder() # Get list of DocTest instances tests = finder.find(f)
sv: def f (x, y): """>>> f(2,2) 4 >>> f(3,2) 6 """ returnera x*y finder = doctest.DocTestFinder() # Hämta lista över DocTest-instanser tester = finder.find(f)

source: The new :class:`DocTestRunner` class then runs individual tests and can produce a summary of the results::
sv: Den nya :class:`DocTestRunner`-klassen kör sedan enskilda tester och kan producera en sammanfattning av resultaten::

source: runner = doctest.DocTestRunner() for t in tests: tried, failed = runner.run(t) runner.summarize(verbose=1)
sv: runner = doctest.DocTestRunner() för t i tester: tried, failed = runner.run(t) runner.summarize(verbose=1)

source: The above example produces the following output::
sv: Exemplet ovan ger följande resultat::

source: 1 items passed all tests: 2 tests in f 2 tests in 1 items. 2 passed and 0 failed. Test passed.
sv: 1 objekt klarade alla tester: 2 tester i f 2 tester i 1 objekt. 2 godkända och 0 underkända. Testet godkändes.

source: :class:`DocTestRunner` uses an instance of the :class:`OutputChecker` class to compare the expected output with the actual output. This class takes a number of different flags that customize its behaviour; ambitious users can also write a completely new subclass of :class:`OutputChecker`.
sv: :class:`DocTestRunner` använder en instans av klassen :class:`OutputChecker` för att jämföra den förväntade utdata med den faktiska utdata. Denna klass tar ett antal olika flaggor som anpassar dess beteende; ambitiösa användare kan också skriva en helt ny underklass av :class:`OutputChecker`.

source: The default output checker provides a number of handy features. For example, with the :const:`doctest.ELLIPSIS` option flag, an ellipsis (``...``) in the expected output matches any substring, making it easier to accommodate outputs that vary in minor ways::
sv: Standardutdatakontrollen har ett antal praktiska funktioner. Till exempel, med :const:`doctest.ELLIPSIS` option flagga, en ellips (``...``) i den förväntade utdata matchar alla delsträngar, vilket gör det lättare att tillgodose utdata som varierar på mindre sätt::

source: def o (n): """>>> o(1) <__main__.C instance at 0x...> >>> """
sv: def o (n): """>>> o(1) <__main__.C-instans på 0x...> >>> """

source: Another special string, ``<BLANKLINE>``, matches a blank line::
sv: En annan speciell sträng, ``<BLANKLINE>``, matchar en tom rad::

source: def p (n): """>>> p(1) <BLANKLINE> >>> """
sv: def p (n): """&gt;&gt;&gt; p(1) <BLANKLINE> &gt;&gt;&gt """

source: Another new capability is producing a diff-style display of the output by specifying the :const:`doctest.REPORT_UDIFF` (unified diffs), :const:`doctest.REPORT_CDIFF` (context diffs), or :const:`doctest.REPORT_NDIFF` (delta-style) option flags. For example::
sv: En annan ny funktion är att producera en diff-stilsvisning av utdata genom att ange alternativflaggorna :const:`doctest.REPORT_UDIFF` (unified diffs), :const:`doctest.REPORT_CDIFF` (context diffs) eller :const:`doctest.REPORT_NDIFF` (delta-style). Till exempel::

source: def g (n): """>>> g(4) here is a lengthy >>>""" L = 'here is a rather lengthy list of words'.split() for word in L[:n]: print word
sv: def g (n): """>>> g(4) här är a lång >>>""" L = 'här är en ganska lång lista med ord'.split() för ord i L[:n]: skriv ut ord

source: Running the above function's tests with :const:`doctest.REPORT_UDIFF` specified, you get the following output:
sv: Om du kör testerna för ovanstående funktion med :const:`doctest.REPORT_UDIFF` specificerad får du följande resultat:

source: ********************************************************************** File "t.py", line 15, in g Failed example: g(4) Differences (unified diff with -expected +actual): @@ -2,3 +2,3 @@ is a -lengthy +rather **********************************************************************
sv: ********************************************************************** Fil "t.py", rad 15, i g Misslyckat exempel: g(4) Skillnader (enhetlig diff med -förväntat +verkligt): @@ -2,3 +2,3 @@ är a -lång +mer **********************************************************************

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Some of the changes to Python's build process and to the C API are:
sv: Några av ändringarna i Pythons byggprocess och i C API:et är följande:

source: Three new convenience macros were added for common return values from extension functions: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE`, and :c:macro:`Py_RETURN_FALSE`. (Contributed by Brett Cannon.)
sv: Tre nya bekvämlighetsmakron har lagts till för vanliga returvärden från tilläggsfunktioner: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE` och :c:macro:`Py_RETURN_FALSE`. (Bidrag från Brett Cannon.)

source: Another new macro, :c:macro:`Py_CLEAR`, decreases the reference count of *obj* and sets *obj* to the null pointer. (Contributed by Jim Fulton.)
sv: Ett annat nytt makro, :c:macro:`Py_CLEAR`, minskar referensantalet för *obj* och sätter *obj* till nollpekaren. (Bidrag från Jim Fulton.)

source: A new function, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, constructs tuples from a variable length argument list of Python objects. (Contributed by Raymond Hettinger.)
sv: En ny funktion, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, konstruerar tuplar från en argumentlista med variabel längd av Python-objekt. (Bidrag från Raymond Hettinger.)

source: A new function, ``PyDict_Contains(d, k)``, implements fast dictionary lookups without masking exceptions raised during the look-up process. (Contributed by Raymond Hettinger.)
sv: En ny funktion, ``PyDict_Contains(d, k)``, implementerar snabba ordboksuppslagningar utan att maskera undantag som uppstår under uppslagningsprocessen. (Bidrag från Raymond Hettinger.)

source: The :c:expr:`Py_IS_NAN(X)` macro returns 1 if its float or double argument *X* is a NaN. (Contributed by Tim Peters.)
sv: Makrot :c:expr:`Py_IS_NAN(X)` returnerar 1 om dess float- eller double-argument *X* är ett NaN. (Bidrag från Tim Peters.)

source: C code can avoid unnecessary locking by using the new :c:func:`!PyEval_ThreadsInitialized` function to tell if any thread operations have been performed. If this function returns false, no lock operations are needed. (Contributed by Nick Coghlan.)
sv: C-kod kan undvika onödig låsning genom att använda den nya :c:func:`!PyEval_ThreadsInitialized`-funktionen för att avgöra om några trådoperationer har utförts. Om denna funktion returnerar false behövs inga låsoperationer. (Bidrag från Nick Coghlan.)

source: A new function, :c:func:`PyArg_VaParseTupleAndKeywords`, is the same as :c:func:`PyArg_ParseTupleAndKeywords` but takes a :c:type:`va_list` instead of a number of arguments. (Contributed by Greg Chapman.)
sv: En ny funktion, :c:func:`PyArg_VaParseTupleAndKeywords`, är samma sak som :c:func:`PyArg_ParseTupleAndKeywords` men tar en :c:type:`va_list` istället för ett antal argument. (Bidrag från Greg Chapman.)

source: A new method flag, :c:macro:`METH_COEXIST`, allows a function defined in slots to co-exist with a :c:type:`PyCFunction` having the same name. This can halve the access time for a method such as :meth:`set.__contains__`. (Contributed by Raymond Hettinger.)
sv: En ny metodflagga, :c:macro:`METH_COEXIST`, gör att en funktion som definieras i slots kan samexistera med en :c:type:`PyCFunction` med samma namn. Detta kan halvera åtkomsttiden för en metod som :meth:`set.__contains__`. (Bidrag från Raymond Hettinger.)

source: Python can now be built with additional profiling for the interpreter itself, intended as an aid to people developing the Python core. Providing :option:`!--enable-profiling` to the :program:`configure` script will let you profile the interpreter with :program:`gprof`, and providing the :option:`!--with-tsc` switch enables profiling using the Pentium's Time-Stamp-Counter register. Note that the :option:`!--with-tsc` switch is slightly misnamed, because the profiling feature also works on the PowerPC platform, though that processor architecture doesn't call that register "the TSC register". (Contributed by Jeremy Hylton.)
sv: Python kan nu byggas med ytterligare profilering för själva tolken, avsedd som ett hjälpmedel för personer som utvecklar Python-kärnan. Om du lägger till :option:`!--enable-profiling` i skriptet :program:`configure` kan du profilera tolken med :program:`gprof`, och om du lägger till :option:`!--with-tsc` kan du profilera med hjälp av Pentiums Time-Stamp-Counter-register. Observera att bytet :option:`!--with-tsc` är något felaktigt namngivet, eftersom profileringsfunktionen även fungerar på PowerPC-plattformen, även om den processorarkitekturen inte kallar registret för "TSC-registret". (Bidrag från Jeremy Hylton.)

source: The :c:type:`!tracebackobject` type has been renamed to :c:type:`PyTracebackObject`.
sv: Typen :c:type:`!tracebackobject` har bytt namn till :c:type:`PyTracebackObject`.

source: Port-Specific Changes
sv: Hamnspecifika ändringar

source: The Windows port now builds under MSVC++ 7.1 as well as version 6. (Contributed by Martin von Löwis.)
sv: Windows-porten bygger nu under MSVC++ 7.1 såväl som version 6. (Bidrag från Martin von Löwis.)

source: Porting to Python 2.4
sv: Portning till Python 2.4

source: This section lists previously described changes that may require changes to your code:
sv: I detta avsnitt listas tidigare beskrivna ändringar som kan kräva ändringar i din kod:

source: Left shifts and hexadecimal/octal constants that are too large no longer trigger a :exc:`FutureWarning` and return a value limited to 32 or 64 bits; instead they return a long integer.
sv: Vänsterförskjutningar och hexadecimala/oktala konstanter som är för stora utlöser inte längre en :exc:`FutureWarning` och returnerar ett värde begränsat till 32 eller 64 bitar; istället returnerar de ett långt heltal.

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list instead of raising a :exc:`TypeError` exception if called with no arguments.
sv: De inbyggda funktionerna :func:`zip` och :func:`itertools.izip` returnerar nu en tom lista istället för att ge upphov till ett :exc:`TypeError`-undantag om de anropas utan argument.

source: You can no longer compare the :class:`date` and :class:`~datetime.datetime` instances provided by the :mod:`datetime` module. Two instances of different classes will now always be unequal, and relative comparisons (``<``, ``>``) will raise a :exc:`TypeError`.
sv: Du kan inte längre jämföra instanserna :class:`date` och :class:`~datetime.datetime` som tillhandahålls av modulen :mod:`datetime`. Två instanser av olika klasser kommer nu alltid att vara ojämlika och relativa jämförelser (``<``, ``>``) kommer att ge upphov till ett :exc:`TypeError`.

source: :func:`!dircache.listdir` now passes exceptions to the caller instead of returning empty lists.
sv: :func:`!dircache.listdir` skickar nu undantag till anroparen istället för att returnera tomma listor.

source: :func:`LexicalHandler.startDTD` used to receive the public and system IDs in the wrong order. This has been corrected; applications relying on the wrong order need to be fixed.
sv: :func:`LexicalHandler.startDTD` brukade ta emot offentliga ID:n och system-ID:n i fel ordning. Detta har korrigerats; applikationer som förlitar sig på den felaktiga ordningen måste åtgärdas.

source: :func:`fcntl.ioctl` now warns if the *mutate* argument is omitted and relevant.
sv: :func:`fcntl.ioctl` varnar nu om argumentet *mutate* utelämnas och är relevant.

source: The :mod:`tarfile` module now generates GNU-format tar files by default.
sv: Modulen :mod:`tarfile` genererar nu tar-filer i GNU-format som standard.

source: Encountering a failure while importing a module no longer leaves a partially initialized module object in ``sys.modules``.
sv: Om ett fel inträffar vid import av en modul lämnas inte längre ett delvis initialiserat modulobjekt kvar i ``sys.modules``.

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error.
sv: :const:`None` är nu en konstant; kod som binder ett nytt värde till namnet ``None`` är nu ett syntaxfel.

source: The :func:`signals.signal` function now raises a :exc:`RuntimeError` exception for certain illegal values; previously these errors would pass silently. For example, you can no longer set a handler on the :const:`SIGKILL` signal.
sv: Funktionen :func:`signals.signal` ger nu upphov till ett :exc:`RuntimeError`-undantag för vissa olagliga värden; tidigare passerade dessa fel tyst. Du kan t.ex. inte längre ställa in en hanterare för signalen :const:`SIGKILL`.

source: Acknowledgements
sv: Tack till

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Koray Can, Hye-Shik Chang, Michael Dyck, Raymond Hettinger, Brian Hurt, Hamish Lawson, Fredrik Lundh, Sean Reifschneider, Sadruddin Rejeb.
sv: Författaren vill tacka följande personer för förslag, korrigeringar och hjälp med olika utkast av denna artikel: Koray Can, Hye-Shik Chang, Michael Dyck, Raymond Hettinger, Brian Hurt, Hamish Lawson, Fredrik Lundh, Sean Reifschneider, Sadruddin Rejeb.

source: universal newlines
sv: universella nya rader

source: What's new
sv: Vad är nytt
