Repository: yeager/python-docs-sv
Catalog: whatsnew/2.4.po
Languages: sv

source: Chinese (ROC): big5, cp950
sv: Kinesiska (ROC): big5, cp950

source: Japanese: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,
sv: Japanska: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,

source: Korean: cp949, euc-kr, johab, iso-2022-kr
sv: Koreanska: cp949, euc-kr, johab, iso-2022-kr

source: Some other new encodings were added: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154, and TIS-620.
sv: Några andra nya kodningar har lagts till: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154 och TIS-620.

source: The UTF-8 and UTF-16 codecs now cope better with receiving partial input. Previously the :class:`StreamReader` class would try to read more data, making it impossible to resume decoding from the stream. The :meth:`read` method will now return as much data as it can and future calls will resume decoding where previous ones left off. (Implemented by Walter Dörwald.)
sv: UTF-8- och UTF-16-codecs klarar nu bättre av att ta emot partiell indata. Tidigare försökte klassen :class:`StreamReader` att läsa mer data, vilket gjorde det omöjligt att återuppta avkodningen från strömmen. Metoden :meth:`read` kommer nu att returnera så mycket data som möjligt och framtida anrop kommer att återuppta avkodningen där tidigare anrop slutade. (Implementerad av Walter Dörwald.)

source: There is a new :mod:`collections` module for various specialized collection datatypes. Currently it contains just one type, :class:`deque`, a double-ended queue that supports efficiently adding and removing elements from either end::
sv: Det finns en ny :mod:`collections`-modul för olika specialiserade datatyper för samlingar. För närvarande innehåller den bara en typ, :class:`deque`, en kö med dubbla ändar som stöder effektivt tillägg och borttagning av element från båda ändarna:

source: >>> from collections import deque >>> d = deque('ghi') # make a new deque with three items >>> d.append('j') # add a new entry to the right side >>> d.appendleft('f') # add a new entry to the left side >>> d # show the representation of the deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # return and remove the rightmost item 'j' >>> d.popleft() # return and remove the leftmost item 'f' >>> list(d) # list the contents of the deque ['g', 'h', 'i'] >>> 'h' in d # search the deque True
sv: >>> from collections import deque >>> d = deque('ghi') # gör en ny deque med tre objekt >>> d.append('j') # lägg till en ny post på höger sida >>> d.appendleft('f') # lägg till en ny post på vänster sida >>> d # visa representationen av deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # returnera och ta bort objektet längst till höger 'j' >>> d.popleft() # returnera och ta bort objektet längst till vänster 'f' >>> list(d) # lista innehållet i deque ['g', 'h', 'i'] >>> 'h' i d # sök i deque Sant

source: Several modules, such as the :mod:`Queue` and :mod:`threading` modules, now take advantage of :class:`collections.deque` for improved performance. (Contributed by Raymond Hettinger.)
sv: Flera moduler, t.ex. modulerna :mod:`Queue` och :mod:`threading`, utnyttjar nu :class:`collections.deque` för förbättrad prestanda. (Bidrag från Raymond Hettinger.)

source: The :mod:`ConfigParser <configparser>` classes have been enhanced slightly. The :meth:`~configparser.ConfigParser.read` method now returns a list of the files that were successfully parsed, and the :meth:`~configparser.ConfigParser.set` method raises :exc:`TypeError` if passed a *value* argument that isn't a string. (Contributed by John Belmonte and David Goodger.)
sv: Klasserna :mod:`ConfigParser <configparser>` har förbättrats något. Metoden :meth:`~configparser.ConfigParser.read` returnerar nu en lista över de filer som har analyserats framgångsrikt, och metoden :meth:`~configparser.ConfigParser.set` ger upphov till :exc:`TypeError` om ett *value*-argument som inte är en sträng skickas. (Bidrag från John Belmonte och David Goodger.)

source: The :mod:`curses` module now supports the ncurses extension :func:`use_default_colors`. On platforms where the terminal supports transparency, this makes it possible to use a transparent background. (Contributed by Jörg Lehmann.)
sv: Modulen :mod:`curses` har nu stöd för ncurses-tillägget :func:`use_default_colors`. På plattformar där terminalen stöder transparens gör detta det möjligt att använda en transparent bakgrund. (Bidrag från Jörg Lehmann.)

source: The :mod:`difflib` module now includes an :class:`HtmlDiff` class that creates an HTML table showing a side by side comparison of two versions of a text. (Contributed by Dan Gass.)
sv: Modulen :mod:`difflib` innehåller nu en klass :class:`HtmlDiff` som skapar en HTML-tabell som visar en jämförelse sida vid sida mellan två versioner av en text. (Bidrag från Dan Gass.)

source: The :mod:`email` package was updated to version 3.0, which dropped various deprecated APIs and removes support for Python versions earlier than 2.3. The 3.0 version of the package uses a new incremental parser for MIME messages, available in the :mod:`email.FeedParser` module. The new parser doesn't require reading the entire message into memory, and doesn't raise exceptions if a message is malformed; instead it records any problems in the :attr:`defect` attribute of the message. (Developed by Anthony Baxter, Barry Warsaw, Thomas Wouters, and others.)
sv: Paketet :mod:`email` har uppdaterats till version 3.0, som innehåller flera föråldrade API:er och tar bort stöd för Python-versioner tidigare än 2.3. I version 3.0 av paketet används en ny inkrementell parser för MIME-meddelanden, som finns i modulen :mod:`email.FeedParser`. Den nya parsern kräver inte att hela meddelandet läses in i minnet och ger inte upphov till undantag om ett meddelande är felaktigt utformat; i stället registreras eventuella problem i meddelandets attribut :attr:`defect`. (Utvecklad av Anthony Baxter, Barry Warsaw, Thomas Wouters och andra)

source: The :mod:`heapq` module has been converted to C. The resulting tenfold improvement in speed makes the module suitable for handling high volumes of data. In addition, the module has two new functions :func:`nlargest` and :func:`nsmallest` that use heaps to find the N largest or smallest values in a dataset without the expense of a full sort. (Contributed by Raymond Hettinger.)
sv: Modulen :mod:`heapq` har konverterats till C. Den tiofaldigt förbättrade hastigheten gör att modulen lämpar sig för hantering av stora datamängder. Dessutom har modulen två nya funktioner :func:`nlargest` och :func:`nsmallest` som använder heaps för att hitta de N största eller minsta värdena i en datauppsättning utan att behöva göra en fullständig sortering. (Bidrag från Raymond Hettinger.)

source: The :mod:`httplib <http>` module now contains constants for HTTP status codes defined in various HTTP-related RFC documents. Constants have names such as :const:`OK`, :const:`CREATED`, :const:`CONTINUE`, and :const:`MOVED_PERMANENTLY`; use pydoc to get a full list. (Contributed by Andrew Eland.)
sv: Modulen :mod:`httplib <http>` innehåller nu konstanter för HTTP-statuskoder som definieras i olika HTTP-relaterade RFC-dokument. Konstanterna har namn som :const:`OK`, :const:`CREATED`, :const:`CONTINUE` och :const:`MOVED_PERMANENTLY`; använd pydoc för att få en fullständig lista. (Bidrag från Andrew Eland.)

source: The :mod:`imaplib` module now supports IMAP's THREAD command (contributed by Yves Dionne) and new :meth:`deleteacl` and :meth:`myrights` methods (contributed by Arnaud Mazin).
sv: Modulen :mod:`imaplib` har nu stöd för IMAP:s THREAD-kommando (bidrag från Yves Dionne) och de nya metoderna :meth:`deleteacl` och :meth:`myrights` (bidrag från Arnaud Mazin).

source: The :mod:`itertools` module gained a ``groupby(iterable[, *func*])`` function. *iterable* is something that can be iterated over to return a stream of elements, and the optional *func* parameter is a function that takes an element and returns a key value; if omitted, the key is simply the element itself. :func:`groupby` then groups the elements into subsequences which have matching values of the key, and returns a series of 2-tuples containing the key value and an iterator over the subsequence.
sv: Modulen :mod:`itertools` har utökats med funktionen ``groupby(iterable[, *func*])``. *iterable* är något som kan itereras över för att returnera en ström av element, och den valfria parametern *func* är en funktion som tar ett element och returnerar ett nyckelvärde; om den utelämnas är nyckeln helt enkelt själva elementet. :func:`groupby` grupperar sedan elementen i undersekvenser som har matchande värden på nyckeln, och returnerar en serie av 2-tupler som innehåller nyckelvärdet och en iterator över undersekvensen.

source: Here's an example to make this clearer. The *key* function simply returns whether a number is even or odd, so the result of :func:`groupby` is to return consecutive runs of odd or even numbers. ::
sv: Här är ett exempel för att göra det tydligare. Funktionen *key* returnerar helt enkelt om ett tal är jämnt eller udda, så resultatet av :func:`groupby` är att returnera på varandra följande serier av udda eller jämna tal. ::

source: :func:`groupby` is typically used with sorted input. The logic for :func:`groupby` is similar to the Unix ``uniq`` filter which makes it handy for eliminating, counting, or identifying duplicate elements::
sv: :func:`groupby` används vanligen med sorterad indata. Logiken för :func:`groupby` liknar Unix ``uniq``-filter, vilket gör det praktiskt för att eliminera, räkna eller identifiera duplicerade element::

source: >>> word = 'abracadabra' >>> letters = sorted(word) # Turn string into a sorted list of letters >>> letters ['a', 'a', 'a', 'a', 'a', 'b', 'b', 'c', 'd', 'r', 'r'] >>> for k, g in itertools.groupby(letters): ... print k, list(g) ... a ['a', 'a', 'a', 'a', 'a'] b ['b', 'b'] c ['c'] d ['d'] r ['r', 'r'] >>> # List unique letters >>> [k for k, g in groupby(letters)] ['a', 'b', 'c', 'd', 'r'] >>> # Count letter occurrences >>> [(k, len(list(g))) for k, g in groupby(letters)] [('a', 5), ('b', 2), ('c', 1), ('d', 1), ('r', 2)]
sv: >>> ord = 'abracadabra' >>> letters = sorted(word) # Gör om strängen till en sorterad lista med bokstäver >>> bokstäver ['a', 'a', 'a', 'a', 'a', 'b', 'b', 'c', 'd', 'r', 'r'] >>> för k, g i itertools.groupby(bokstäver): ... print k, list(g) ... a ['a', 'a', 'a', 'a', 'a'] b ['b', 'b'] c ['c'] d ['d'] r ['r', 'r'] >>> # Lista unika bokstäver >>> [k för k, g i groupby(bokstäver)] ['a', 'b', 'c', 'd', 'r'] >>> # Räkna förekomster av bokstäver >>> [(k, len(list(g))) för k, g i groupby(bokstäver)] [('a', 5), ('b', 2), ('c', 1), ('d', 1), ('r', 2)]

source: (Contributed by Hye-Shik Chang.)
sv: (Bidrag från Hye-Shik Chang.)

source: :mod:`itertools` also gained a function named ``tee(iterator, N)`` that returns *N* independent iterators that replicate *iterator*. If *N* is omitted, the default is 2. ::
sv: :mod:`itertools` har också fått en funktion som heter ``tee(iterator, N)`` som returnerar *N* oberoende iteratorer som replikerar *iterator*. Om *N* utelämnas är standardvärdet 2. ::

source: >>> L = [1,2,3] >>> i1, i2 = itertools.tee(L) >>> i1,i2 (<itertools.tee object at 0x402c2080>, <itertools.tee object at 0x402c2090>) >>> list(i1) # Run the first iterator to exhaustion [1, 2, 3] >>> list(i2) # Run the second iterator to exhaustion [1, 2, 3]
sv: >>> L = [1,2,3] >>> i1, i2 = itertools.tee(L) >>> i1,i2 (<itertools.tee-objekt på 0x402c2080>, <itertools.tee-objekt på 0x402c2090>) >>> list(i1) # Kör den första iteratorn till utmattning [1, 2, 3] >>> list(i2) # Kör den andra iteratorn till utmattning [1, 2, 3]

source: Note that :func:`tee` has to keep copies of the values returned by the iterator; in the worst case, it may need to keep all of them. This should therefore be used carefully if the leading iterator can run far ahead of the trailing iterator in a long stream of inputs. If the separation is large, then you might as well use :func:`list` instead. When the iterators track closely with one another, :func:`tee` is ideal. Possible applications include bookmarking, windowing, or lookahead iterators. (Contributed by Raymond Hettinger.)
sv: Observera att :func:`tee` måste behålla kopior av de värden som iteratorn returnerar; i värsta fall kan den behöva behålla dem alla. Detta bör därför användas försiktigt om den ledande iteratorn kan springa långt före den efterföljande iteratorn i en lång ström av inmatningar. Om separationen är stor kan du lika gärna använda :func:`list` istället. När iteratorerna ligger nära varandra är :func:`tee` perfekt. Möjliga tillämpningar inkluderar bokmärken, fönster eller lookahead-iteratorer. (Bidrag från Raymond Hettinger.)

source: A number of functions were added to the :mod:`locale` module, such as :func:`bind_textdomain_codeset` to specify a particular encoding and a family of :func:`!l\*gettext` functions that return messages in the chosen encoding. (Contributed by Gustavo Niemeyer.)
sv: Ett antal funktioner har lagts till i modulen :mod:`locale`, t.ex. :func:`bind_textdomain_codeset` för att ange en viss kodning och en familj av :func:`!l\*gettext`-funktioner som returnerar meddelanden i den valda kodningen. (Bidrag från Gustavo Niemeyer.)

source: Some keyword arguments were added to the :mod:`logging` package's :func:`basicConfig` function to simplify log configuration. The default behavior is to log messages to standard error, but various keyword arguments can be specified to log to a particular file, change the logging format, or set the logging level. For example::
sv: Några nyckelordsargument har lagts till i :mod:`logging`-paketets :func:`basicConfig`-funktion för att förenkla loggkonfigurationen. Standardbeteendet är att logga meddelanden till standardfel, men olika nyckelordsargument kan anges för att logga till en viss fil, ändra loggningsformatet eller ställa in loggningsnivån. Till exempel::

source: Other additions to the :mod:`logging` package include a ``log(level, msg)`` convenience method, as well as a :class:`TimedRotatingFileHandler` class that rotates its log files at a timed interval. The module already had :class:`RotatingFileHandler`, which rotated logs once the file exceeded a certain size. Both classes derive from a new :class:`BaseRotatingHandler` class that can be used to implement other rotating handlers.
sv: Andra tillägg till :mod:`logging`-paketet inkluderar en ``log(level, msg)`` bekvämlighetsmetod, samt en :class:`TimedRotatingFileHandler`-klass som roterar sina loggfiler med ett tidsbestämt intervall. Modulen hade redan :class:`RotatingFileHandler`, som roterade loggarna när filen översteg en viss storlek. Båda klasserna härstammar från en ny klass :class:`BaseRotatingHandler` som kan användas för att implementera andra rotationshanterare.

source: (Changes implemented by Vinay Sajip.)
sv: (Ändringar implementerade av Vinay Sajip.)

source: The :mod:`marshal` module now shares interned strings on unpacking a data structure. This may shrink the size of certain pickle strings, but the primary effect is to make :file:`.pyc` files significantly smaller. (Contributed by Martin von Löwis.)
sv: Modulen :mod:`marshal` delar nu internerade strängar vid uppackning av en datastruktur. Detta kan krympa storleken på vissa pickle-strängar, men den primära effekten är att göra :file:`.pyc`-filer betydligt mindre. (Bidrag från Martin von Löwis.)

source: The :mod:`!nntplib` module's :class:`NNTP` class gained :meth:`description` and :meth:`descriptions` methods to retrieve newsgroup descriptions for a single group or for a range of groups. (Contributed by Jürgen A. Erhard.)
sv: :mod:`!nntplib`-modulens :class:`NNTP`-klass fick metoderna :meth:`description` och :meth:`descriptions` för att hämta beskrivningar av nyhetsgrupper för en enda grupp eller för ett antal grupper. (Bidrag från Jürgen A. Erhard.)

source: Two new functions were added to the :mod:`operator` module, ``attrgetter(attr)`` and ``itemgetter(index)``. Both functions return callables that take a single argument and return the corresponding attribute or item; these callables make excellent data extractors when used with :func:`map` or :func:`sorted`. For example::
sv: Två nya funktioner har lagts till i modulen :mod:`operator`, ``attrgetter(attr)`` och ``itemgetter(index)``. Båda funktionerna returnerar anropbara filer som tar ett enda argument och returnerar motsvarande attribut eller objekt; dessa anropbara filer är utmärkta datautdragare när de används med :func:`map` eller :func:`sorted`. Till exempel::

source: >>> L = [('c', 2), ('d', 1), ('a', 4), ('b', 3)] >>> map(operator.itemgetter(0), L) ['c', 'd', 'a', 'b'] >>> map(operator.itemgetter(1), L) [2, 1, 4, 3] >>> sorted(L, key=operator.itemgetter(1)) # Sort list by second tuple item [('d', 1), ('c', 2), ('b', 3), ('a', 4)]
sv: >>> L = [('c', 2), ('d', 1), ('a', 4), ('b', 3)] >>> map(operator.itemgetter(0), L) ['c', 'd', 'a', 'b'] >>> karta(operator.itemgetter(1), L) [2, 1, 4, 3] >>> sorted(L, key=operator.itemgetter(1)) # Sortera listan efter andra tupelobjektet [('d', 1), ('c', 2), ('b', 3), ('a', 4)]

source: The :mod:`optparse` module was updated in various ways. The module now passes its messages through :func:`gettext.gettext`, making it possible to internationalize Optik's help and error messages. Help messages for options can now include the string ``'%default'``, which will be replaced by the option's default value. (Contributed by Greg Ward.)
sv: Modulen :mod:`optparse` har uppdaterats på olika sätt. Modulen skickar nu sina meddelanden genom :func:`gettext.gettext`, vilket gör det möjligt att internationalisera Optiks hjälp- och felmeddelanden. Hjälpmeddelanden för alternativ kan nu inkludera strängen ``'%default'``, som kommer att ersättas av alternativets standardvärde. (Bidrag från Greg Ward.)

source: The long-term plan is to deprecate the :mod:`!rfc822` module in some future Python release in favor of the :mod:`email` package. To this end, the :func:`email.Utils.formatdate <email.utils.formatdate>` function has been changed to make it usable as a replacement for :func:`!rfc822.formatdate`. You may want to write new e-mail processing code with this in mind. (Change implemented by Anthony Baxter.)
sv: Den långsiktiga planen är att avskaffa :mod:`!rfc822`-modulen i någon framtida Python-utgåva till förmån för :mod:`email`-paketet. För detta ändamål har funktionen :func:`email.Utils.formatdate <email.utils.formatdate>` ändrats för att göra den användbar som en ersättning för :func:`!rfc822.formatdate`. Du kanske vill skriva ny kod för e-postbehandling med detta i åtanke. (Ändringen implementerades av Anthony Baxter.)

source: A new ``urandom(n)`` function was added to the :mod:`os` module, returning a string containing *n* bytes of random data. This function provides access to platform-specific sources of randomness such as :file:`/dev/urandom` on Linux or the Windows CryptoAPI. (Contributed by Trevor Perrin.)
sv: En ny funktion ``urandom(n)`` har lagts till i modulen :mod:`os`, som returnerar en sträng innehållande *n* bytes slumpmässiga data. Denna funktion ger tillgång till plattformsspecifika källor till slumpmässiga data såsom :file:`/dev/urandom` på Linux eller Windows CryptoAPI. (Bidrag från Trevor Perrin.)

source: Another new function: ``os.path.lexists(path)`` returns true if the file specified by *path* exists, whether or not it's a symbolic link. This differs from the existing ``os.path.exists(path)`` function, which returns false if *path* is a symlink that points to a destination that doesn't exist. (Contributed by Beni Cherniavsky.)
sv: Ytterligare en ny funktion: ```os.path.lexists(path)`` returnerar sant om filen som anges av *path* existerar, oavsett om det är en symbolisk länk eller inte. Detta skiljer sig från den befintliga funktionen ``os.path.exists(path)``, som returnerar false om *path* är en symbolisk länk som pekar på en destination som inte existerar. (Bidrag från Beni Cherniavsky.)

source: A new :func:`getsid` function was added to the :mod:`posix` module that underlies the :mod:`os` module. (Contributed by J. Raynor.)
sv: En ny funktion :func:`getsid` lades till i modulen :mod:`posix` som ligger till grund för modulen :mod:`os`. (Bidrag från J. Raynor.)

source: The :mod:`poplib` module now supports POP over SSL. (Contributed by Hector Urtubia.)
sv: Modulen :mod:`poplib` har nu stöd för POP över SSL. (Bidrag från Hector Urtubia.)

source: The :mod:`profile` module can now profile C extension functions. (Contributed by Nick Bastin.)
sv: Modulen :mod:`profile` kan nu profilera C-tilläggsfunktioner. (Bidrag från Nick Bastin.)

source: The :mod:`random` module has a new method called ``getrandbits(N)`` that returns a long integer *N* bits in length. The existing :meth:`randrange` method now uses :meth:`getrandbits` where appropriate, making generation of arbitrarily large random numbers more efficient. (Contributed by Raymond Hettinger.)
sv: Modulen :mod:`random` har en ny metod som heter ``getrandbits(N)`` som returnerar ett långt heltal *N* bitar långt. Den befintliga metoden :meth:`randrange` använder nu :meth:`getrandbits` där det är lämpligt, vilket gör generering av godtyckligt stora slumptal mer effektiv. (Bidrag från Raymond Hettinger.)

source: The regular expression language accepted by the :mod:`re` module was extended with simple conditional expressions, written as ``(?(group)A|B)``. *group* is either a numeric group ID or a group name defined with ``(?P<group>...)`` earlier in the expression. If the specified group matched, the regular expression pattern *A* will be tested against the string; if the group didn't match, the pattern *B* will be used instead. (Contributed by Gustavo Niemeyer.)
sv: Det språk för reguljära uttryck som accepteras av modulen :mod:`re` har utökats med enkla villkorliga uttryck, skrivna som ``(?(group)A|B)``. *group* är antingen ett numeriskt grupp-ID eller ett gruppnamn definierat med ``(?P<group>...)`` tidigare i uttrycket. Om den angivna gruppen matchade, kommer det reguljära uttrycksmönstret *A* att testas mot strängen; om gruppen inte matchade, kommer mönstret *B* att användas istället. (Bidrag från Gustavo Niemeyer.)

source: The :mod:`re` module is also no longer recursive, thanks to a massive amount of work by Gustavo Niemeyer. In a recursive regular expression engine, certain patterns result in a large amount of C stack space being consumed, and it was possible to overflow the stack. For example, if you matched a 30000-byte string of ``a`` characters against the expression ``(a|b)+``, one stack frame was consumed per character. Python 2.3 tried to check for stack overflow and raise a :exc:`RuntimeError` exception, but certain patterns could sidestep the checking and if you were unlucky Python could segfault. Python 2.4's regular expression engine can match this pattern without problems.
sv: Modulen :mod:`re` är inte heller längre rekursiv, tack vare ett enormt arbete av Gustavo Niemeyer. I en rekursiv reguljär uttrycksmotor resulterar vissa mönster i att en stor mängd C-stackutrymme förbrukas, och det var möjligt att överfylla stacken. Om du till exempel matchade en 30000-byte-sträng med ``a``-tecken mot uttrycket ``(a|b)+``, förbrukades en stackram per tecken. Python 2.3 försökte kontrollera för stacköverflöd och skapa ett :exc:`RuntimeError`-undantag, men vissa mönster kunde kringgå kontrollen och om du hade otur kunde Python få segfault. Python 2.4:s motor för reguljära uttryck kan matcha det här mönstret utan problem.
