Repository: yeager/python-docs-sv
Catalog: whatsnew/2.4.po
Languages: sv

source: from SimpleXMLRPCServer import SimpleXMLRPCServer,\ SimpleXMLRPCRequestHandler,\ CGIXMLRPCRequestHandler,\ resolve_dotted_attribute
sv: from SimpleXMLRPCServer import SimpleXMLRPCServer,\ SimpleXMLRPCRequestHandler,\ CGIXMLRPCRequestHandler,\ resolve_prickad_attribut

source: The syntactic change in Python 2.4 simply allows putting the names within parentheses. Python ignores newlines within a parenthesized expression, so the backslashes are no longer needed::
sv: Den syntaktiska förändringen i Python 2.4 gör det helt enkelt möjligt att sätta namnen inom parentes. Python ignorerar nya rader inom ett uttryck med parenteser, så de bakre bindestrecken behövs inte längre::

source: The PEP also proposes that all :keyword:`import` statements be absolute imports, with a leading ``.`` character to indicate a relative import. This part of the PEP was not implemented for Python 2.4, but was completed for Python 2.5.
sv: PEP föreslår också att alla :keyword:`import`-satser ska vara absoluta importer, med ett inledande ``.``-tecken för att indikera en relativ import. Denna del av PEP implementerades inte för Python 2.4, men slutfördes för Python 2.5.

source: :pep:`328` - Imports: Multi-Line and Absolute/Relative
sv: :pep:`328` - Import: Flera rader och absolut/relativ

source: Written by Aahz. Multi-line imports were implemented by Dima Dorfman.
sv: Skrivet av Aahz. Import av flera rader genomfördes av Dima Dorfman.

source: PEP 331: Locale-Independent Float/String Conversions
sv: PEP 331: Lokaloberoende omvandling av flyttal/sträng

source: The :mod:`locale` modules lets Python software select various conversions and display conventions that are localized to a particular country or language. However, the module was careful to not change the numeric locale because various functions in Python's implementation required that the numeric locale remain set to the ``'C'`` locale. Often this was because the code was using the C library's :c:func:`atof` function.
sv: Modulen :mod:`locale` låter Python-program välja olika konverteringar och visningskonventioner som är anpassade till ett visst land eller språk. Modulen var dock noga med att inte ändra den numeriska locale eftersom olika funktioner i Pythons implementation krävde att den numeriska locale skulle förbli inställd på ``'C'`` locale. Ofta berodde detta på att koden använde C-bibliotekets funktion :c:func:`atof`.

source: Not setting the numeric locale caused trouble for extensions that used third-party C libraries, however, because they wouldn't have the correct locale set. The motivating example was GTK+, whose user interface widgets weren't displaying numbers in the current locale.
sv: Att inte ställa in den numeriska språkdräkten orsakade dock problem för tillägg som använde C-bibliotek från tredje part, eftersom de inte skulle ha rätt språkdräkt inställd. Det motiverande exemplet var GTK+, vars widgetar i användargränssnittet inte visade siffror i den aktuella språkdräkten.

source: The solution described in the PEP is to add three new functions to the Python API that perform ASCII-only conversions, ignoring the locale setting:
sv: Lösningen som beskrivs i PEP är att lägga till tre nya funktioner i Python API som endast utför ASCII-konverteringar och ignorerar locale-inställningen:

source: ``PyOS_ascii_strtod(str, ptr)`` and ``PyOS_ascii_atof(str, ptr)`` both convert a string to a C :c:expr:`double`.
sv: ``PyOS_ascii_strtod(str, ptr)`` och ``PyOS_ascii_atof(str, ptr)`` konverterar båda en sträng till en C :c:expr:`double`.

source: ``PyOS_ascii_formatd(buffer, buf_len, format, d)`` converts a :c:expr:`double` to an ASCII string.
sv: ``PyOS_ascii_formatd(buffer, buf_len, format, d)`` konverterar ett :c:expr:`double` till en ASCII-sträng.

source: The code for these functions came from the GLib library (`https://developer-old.gnome.org/glib/2.26/ <http://web.archive.org/web/20210306104320/https://developer.gnome.org/glib/2.26/>`__), whose developers kindly relicensed the relevant functions and donated them to the Python Software Foundation. The :mod:`locale` module can now change the numeric locale, letting extensions such as GTK+ produce the correct results.
sv: Koden för dessa funktioner kom från GLib-biblioteket (`https://developer-old.gnome.org/glib/2.26/ <http://web.archive.org/web/20210306104320/https://developer.gnome.org/glib/2.26/>`__), vars utvecklare vänligen licensierade de relevanta funktionerna och donerade dem till Python Software Foundation. Modulen :mod:`locale` kan nu ändra den numeriska språkdräkten, så att tillägg som GTK+ ger rätt resultat.

source: :pep:`331` - Locale-Independent Float/String Conversions
sv: :pep:`331` - Lokaloberoende omvandling av float/sträng

source: Written by Christian R. Reis, and implemented by Gustavo Carneiro.
sv: Skriven av Christian R. Reis och implementerad av Gustavo Carneiro.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Here are all of the changes that Python 2.4 makes to the core Python language.
sv: Här är alla ändringar som Python 2.4 gör i kärnan i Python-språket.

source: Decorators for functions and methods were added (:pep:`318`).
sv: Dekoratorer för funktioner och metoder har lagts till (:pep:`318`).

source: Built-in :func:`set` and :func:`frozenset` types were added (:pep:`218`). Other new built-ins include the ``reversed(seq)`` function (:pep:`322`).
sv: Inbyggda :func:`set` och :func:`frozenset` typer har lagts till (:pep:`218`). Andra nya inbyggda funktioner inkluderar funktionen ``reversed(seq)`` (:pep:`322`).

source: Generator expressions were added (:pep:`289`).
sv: Generatoruttryck har lagts till (:pep:`289`).

source: Certain numeric expressions no longer return values restricted to 32 or 64 bits (:pep:`237`).
sv: Vissa numeriska uttryck returnerar inte längre värden som är begränsade till 32 eller 64 bitar (:pep:`237`).

source: You can now put parentheses around the list of names in a ``from module import names`` statement (:pep:`328`).
sv: Du kan nu sätta parenteser runt listan med namn i en ``from module import names``-sats (:pep:`328`).

source: The :meth:`dict.update` method now accepts the same argument forms as the :class:`dict` constructor. This includes any mapping, any iterable of key/value pairs, and keyword arguments. (Contributed by Raymond Hettinger.)
sv: Metoden :meth:`dict.update` accepterar nu samma argumentformer som konstruktören :class:`dict`. Detta inkluderar alla mappningar, alla iterationer av nyckel/värde-par och nyckelordsargument. (Bidrag från Raymond Hettinger.)

source: The string methods :meth:`ljust`, :meth:`rjust`, and :meth:`center` now take an optional argument for specifying a fill character other than a space. (Contributed by Raymond Hettinger.)
sv: Strängmetoderna :meth:`ljust`, :meth:`rjust` och :meth:`center` tar nu ett valfritt argument för att ange ett annat fyllnadstecken än ett mellanslag. (Bidrag från Raymond Hettinger.)

source: Strings also gained an :meth:`rsplit` method that works like the :meth:`split` method but splits from the end of the string. (Contributed by Sean Reifschneider.) ::
sv: Strängar har också fått en :meth:`rsplit`-metod som fungerar som :meth:`split`-metoden men delar från slutet av strängen. (Bidrag från Sean Reifschneider.) ::

source: Three keyword parameters, *cmp*, *key*, and *reverse*, were added to the :meth:`sort` method of lists. These parameters make some common usages of :meth:`sort` simpler. All of these parameters are optional.
sv: Tre nyckelordsparametrar, *cmp*, *key* och *reverse*, lades till i metoden :meth:`sort` för listor. Dessa parametrar gör vissa vanliga användningar av :meth:`sort` enklare. Alla dessa parametrar är valfria.

source: For the *cmp* parameter, the value should be a comparison function that takes two parameters and returns -1, 0, or +1 depending on how the parameters compare. This function will then be used to sort the list. Previously this was the only parameter that could be provided to :meth:`sort`.
sv: För parametern *cmp* ska värdet vara en jämförelsefunktion som tar två parametrar och returnerar -1, 0 eller +1 beroende på hur parametrarna jämförs. Denna funktion kommer sedan att användas för att sortera listan. Tidigare var detta den enda parametern som kunde anges till :meth:`sort`.

source: *key* should be a single-parameter function that takes a list element and returns a comparison key for the element. The list is then sorted using the comparison keys. The following example sorts a list case-insensitively::
sv: *key* bör vara en funktion med en parameter som tar ett element i en lista och returnerar en jämförelsenyckel för elementet. Listan sorteras sedan med hjälp av jämförelsenycklarna. I följande exempel sorteras en lista utan hänsyn till fall::

source: >>> L = ['A', 'b', 'c', 'D'] >>> L.sort() # Case-sensitive sort >>> L ['A', 'D', 'b', 'c'] >>> # Using 'key' parameter to sort list >>> L.sort(key=lambda x: x.lower()) >>> L ['A', 'b', 'c', 'D'] >>> # Old-fashioned way >>> L.sort(cmp=lambda x,y: cmp(x.lower(), y.lower())) >>> L ['A', 'b', 'c', 'D']
sv: >>> L = ['A', 'b', 'c', 'D'] >>> L.sort() # Skiftlägeskänslig sortering >>> L ['A', 'D', 'b', 'c'] >>> # Använda parametern 'nyckel' för att sortera listan >>> L.sort(nyckel=lambda x: x.lower()) >>> L ['A', 'b', 'c', 'D'] >>> # Gammalmodigt sätt >>> L.sort(cmp=lambda x,y: cmp(x.lower(), y.lower()))) >>> L ['A', 'b', 'c', 'D']

source: The last example, which uses the *cmp* parameter, is the old way to perform a case-insensitive sort. It works but is slower than using a *key* parameter. Using *key* calls :meth:`lower` method once for each element in the list while using *cmp* will call it twice for each comparison, so using *key* saves on invocations of the :meth:`lower` method.
sv: Det sista exemplet, där parametern *cmp* används, är det gamla sättet att utföra en sortering utan skiftlägeskänslighet. Det fungerar men är långsammare än att använda en *key*-parameter. Med *key* anropas :meth:`lower`-metoden en gång för varje element i listan, medan den med *cmp* anropas två gånger för varje jämförelse, så med *key* sparas anrop av :meth:`lower`-metoden.

source: For simple key functions and comparison functions, it is often possible to avoid a :keyword:`lambda` expression by using an unbound method instead. For example, the above case-insensitive sort is best written as::
sv: För enkla nyckelfunktioner och jämförelsefunktioner är det ofta möjligt att undvika ett :keyword:`lambda`-uttryck genom att använda en obunden metod i stället. Till exempel skrivs ovanstående sortering utan skiftlägeskänslighet bäst som::

source: >>> L.sort(key=str.lower) >>> L ['A', 'b', 'c', 'D']
sv: >>> L.sortera(nyckel=str.lägre) >>> L ['A', 'b', 'c', 'D']

source: Finally, the *reverse* parameter takes a Boolean value. If the value is true, the list will be sorted into reverse order. Instead of ``L.sort(); L.reverse()``, you can now write ``L.sort(reverse=True)``.
sv: Slutligen tar parametern *reverse* ett booleskt värde. Om värdet är sant kommer listan att sorteras i omvänd ordning. Istället för ``L.sort(); L.reverse()`` kan du nu skriva ``L.sort(reverse=True)``.

source: The results of sorting are now guaranteed to be stable. This means that two entries with equal keys will be returned in the same order as they were input. For example, you can sort a list of people by name, and then sort the list by age, resulting in a list sorted by age where people with the same age are in name-sorted order.
sv: Resultatet av sorteringen är nu garanterat stabilt. Det innebär att två poster med lika nycklar returneras i samma ordning som de matades in. Du kan t.ex. sortera en lista med personer efter namn och sedan sortera listan efter ålder, vilket resulterar i en lista som är sorterad efter ålder där personer med samma ålder är i namnsorterad ordning.

source: (All changes to :meth:`sort` contributed by Raymond Hettinger.)
sv: (Alla ändringar i :meth:`sort` har gjorts av Raymond Hettinger.)

source: There is a new built-in function ``sorted(iterable)`` that works like the in-place :meth:`list.sort` method but can be used in expressions. The differences are:
sv: Det finns en ny inbyggd funktion ``sorted(iterable)`` som fungerar som in-place :meth:`list.sort`-metoden men som kan användas i uttryck. Skillnaderna är:

source: the input may be any iterable;
sv: indata kan vara vilken iterabel som helst;

source: a newly formed copy is sorted, leaving the original intact; and
sv: en nybildad kopia sorteras, varvid originalet lämnas intakt; och

source: the expression returns the new sorted copy
sv: uttrycket returnerar den nya sorterade kopian

source: >>> L = [9,7,8,3,2,4,1,6,5] >>> [10+i for i in sorted(L)] # usable in a list comprehension [11, 12, 13, 14, 15, 16, 17, 18, 19] >>> L # original is left unchanged [9,7,8,3,2,4,1,6,5] >>> sorted('Monty Python') # any iterable may be an input [' ', 'M', 'P', 'h', 'n', 'n', 'o', 'o', 't', 't', 'y', 'y'] >>> # List the contents of a dict sorted by key values >>> colormap = dict(red=1, blue=2, green=3, black=4, yellow=5) >>> for k, v in sorted(colormap.iteritems()): ... print k, v ... black 4 blue 2 green 3 red 1 yellow 5
sv: >>> L = [9,7,8,3,2,4,1,6,5] >>> [10+i for i in sorted(L)] # användbar i en listförståelse [11, 12, 13, 14, 15, 16, 17, 18, 19] >>> L # originalet lämnas oförändrat [9,7,8,3,2,4,1,6,5] >>> sorted('Monty Python') # vilken iterabel som helst kan vara en inmatning [' ', 'M', 'P', 'h', 'n', 'n', 'o', 'o', 't', 't', 'y', 'y'] >>> # Lista innehållet i en dict sorterat efter nyckelvärden >>> kolormap = dict(röd=1, blå=2, grön=3, svart=4, gul=5) >>> for k, v in sorted(colormap.iteritems()): ... print k, v ... svart 4 blå 2 grön 3 röd 1 gul 5

source: (Contributed by Raymond Hettinger.)
sv: (Bidrag från Raymond Hettinger.)

source: Integer operations will no longer trigger an :exc:`OverflowWarning`. The :exc:`OverflowWarning` warning will disappear in Python 2.5.
sv: Integer-operationer kommer inte längre att utlösa en :exc:`OverflowWarning`. Varningen :exc:`OverflowWarning` kommer att försvinna i Python 2.5.

source: The interpreter gained a new switch, :option:`-m`, that takes a name, searches for the corresponding module on ``sys.path``, and runs the module as a script. For example, you can now run the Python profiler with ``python -m profile``. (Contributed by Nick Coghlan.)
sv: Tolken har fått en ny switch, :option:`-m`, som tar ett namn, söker efter motsvarande modul på ``sys.path`` och kör modulen som ett skript. Till exempel kan du nu köra Python-profileraren med ``python -m profile``. (Bidrag från Nick Coghlan.)

source: The ``eval(expr, globals, locals)`` and ``execfile(filename, globals, locals)`` functions and the ``exec`` statement now accept any mapping type for the *locals* parameter. Previously this had to be a regular Python dictionary. (Contributed by Raymond Hettinger.)
sv: Funktionerna ``eval(expr, globals, locals)`` och ``execfile(filnamn, globals, locals)`` samt ``exec``-satsen accepterar nu valfri mappningstyp för parametern *locals*. Tidigare var detta tvunget att vara en vanlig Python-ordbok. (Bidrag från Raymond Hettinger.)

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list if called with no arguments. Previously they raised a :exc:`TypeError` exception. This makes them more suitable for use with variable length argument lists::
sv: Den inbyggda funktionen :func:`zip` och :func:`itertools.izip` returnerar nu en tom lista om de anropas utan argument. Tidigare gav de upphov till ett :exc:`TypeError`-undantag. Detta gör dem mer lämpade för användning med argumentlistor av varierande längd::

source: Encountering a failure while importing a module no longer leaves a partially initialized module object in ``sys.modules``. The incomplete module object left behind would fool further imports of the same module into succeeding, leading to confusing errors. (Fixed by Tim Peters.)
sv: Om ett fel uppstår vid import av en modul lämnas inte längre ett delvis initialiserat modulobjekt kvar i ``sys.modules``. Det ofullständiga modulobjektet som lämnades kvar kunde hindra ytterligare import av samma modul från att lyckas, vilket ledde till förvirrande fel. (Åtgärdat av Tim Peters.)

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error. (Contributed by Raymond Hettinger.)
sv: :const:`None` är nu en konstant; kod som binder ett nytt värde till namnet ``None`` är nu ett syntaxfel. (Bidrag från Raymond Hettinger.)

source: Optimizations
sv: Optimeringar

source: The inner loops for list and tuple slicing were optimized and now run about one-third faster. The inner loops for dictionaries were also optimized, resulting in performance boosts for :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues`, and :meth:`iteritems`. (Contributed by Raymond Hettinger.)
sv: De inre looparna för list- och tuple-slicing har optimerats och körs nu ungefär en tredjedel snabbare. De inre looparna för ordböcker optimerades också, vilket resulterade i prestandaökningar för :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues` och :meth:`iteritems`. (Bidrag från Raymond Hettinger.)

source: The machinery for growing and shrinking lists was optimized for speed and for space efficiency. Appending and popping from lists now runs faster due to more efficient code paths and less frequent use of the underlying system :c:func:`realloc`. List comprehensions also benefit. :meth:`list.extend` was also optimized and no longer converts its argument into a temporary list before extending the base list. (Contributed by Raymond Hettinger.)
sv: Maskineriet för att växa och krympa listor har optimerats för hastighet och utrymmeseffektivitet. Att lägga till och plocka från listor går nu snabbare tack vare effektivare kodvägar och mindre frekvent användning av det underliggande systemet :c:func:`realloc`. Listförståelse gynnas också. :meth:`list.extend` har också optimerats och konverterar inte längre sitt argument till en tillfällig lista innan baslistan utökas. (Bidrag från Raymond Hettinger.)

source: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter`, and :func:`zip` now run several times faster with non-sequence arguments that supply a :meth:`__len__` method. (Contributed by Raymond Hettinger.)
sv: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter` och :func:`zip` körs nu flera gånger snabbare med argument som inte är sekvenser och som innehåller metoden :meth:`__len__`. (Bidrag från Raymond Hettinger.)

source: The methods :meth:`list.__getitem__`, :meth:`dict.__getitem__`, and :meth:`dict.__contains__` are now implemented as :class:`method_descriptor` objects rather than :class:`wrapper_descriptor` objects. This form of access doubles their performance and makes them more suitable for use as arguments to functionals: ``map(mydict.__getitem__, keylist)``. (Contributed by Raymond Hettinger.)
sv: Metoderna :meth:`list.__getitem__`, :meth:`dict.__getitem__` och :meth:`dict.__contains__` är nu implementerade som :class:`method_descriptor`-objekt i stället för :class:`wrapper_descriptor`-objekt. Denna form av åtkomst fördubblar deras prestanda och gör dem mer lämpliga att använda som argument till funktionaler: ``map(mydict.__getitem__, keylist)``. (Bidrag från Raymond Hettinger.)

source: Added a new opcode, ``LIST_APPEND``, that simplifies the generated bytecode for list comprehensions and speeds them up by about a third. (Contributed by Raymond Hettinger.)
sv: Lade till en ny opcode, ``LIST_APPEND``, som förenklar den genererade bytekoden för listförståelser och snabbar upp dem med ungefär en tredjedel. (Bidrag från Raymond Hettinger.)

source: The peephole bytecode optimizer has been improved to produce shorter, faster bytecode; remarkably, the resulting bytecode is more readable. (Enhanced by Raymond Hettinger.)
sv: Bytekodsoptimeraren Peephole har förbättrats för att producera kortare och snabbare bytekod; anmärkningsvärt nog är den resulterande bytekoden mer läsbar. (Förbättrad av Raymond Hettinger.)

source: String concatenations in statements of the form ``s = s + "abc"`` and ``s += "abc"`` are now performed more efficiently in certain circumstances. This optimization won't be present in other Python implementations such as Jython, so you shouldn't rely on it; using the :meth:`join` method of strings is still recommended when you want to efficiently glue a large number of strings together. (Contributed by Armin Rigo.)
sv: Strängkonkateneringar i satser av formen ``s = s + "abc"`` och ``s += "abc"`` utförs nu mer effektivt under vissa omständigheter. Denna optimering kommer inte att finnas i andra Python-implementationer som Jython, så du bör inte förlita dig på den; att använda :meth:`join`-metoden för strängar rekommenderas fortfarande när du effektivt vill limma ihop ett stort antal strängar. (Bidrag från Armin Rigo.)

source: The net result of the 2.4 optimizations is that Python 2.4 runs the pystone benchmark around 5% faster than Python 2.3 and 35% faster than Python 2.2. (pystone is not a particularly good benchmark, but it's the most commonly used measurement of Python's performance. Your own applications may show greater or smaller benefits from Python 2.4.)
sv: Nettoresultatet av 2.4-optimeringarna är att Python 2.4 kör pystone-riktmärket cirka 5% faster än Python 2.3 och 35% faster än Python 2.2. (pystone är inte ett särskilt bra riktmärke, men det är den mest använda mätningen av Pythons prestanda. Dina egna applikationer kan visa större eller mindre fördelar med Python 2.4.)

source: New, Improved, and Deprecated Modules
sv: Nya, förbättrade och utfasade moduler

source: As usual, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the CVS logs for all the details.
sv: Som vanligt fick Pythons standardbibliotek ett antal förbättringar och buggfixar. Här är en partiell lista över de mest anmärkningsvärda ändringarna, sorterade alfabetiskt efter modulnamn. Se filen :file:`Misc/NEWS` i källträdet för en mer komplett lista över ändringar, eller titta igenom CVS-loggarna för alla detaljer.

source: The :mod:`!asyncore` module's :func:`!loop` function now has a *count* parameter that lets you perform a limited number of passes through the polling loop. The default is still to loop forever.
sv: Modulen :mod:`!asyncore`:s funktion :func:`!loop` har nu en parameter *count* som låter dig utföra ett begränsat antal genomgångar av pollingloopen. Standardinställningen är fortfarande att loopa för evigt.

source: The :mod:`base64` module now has more complete :rfc:`3548` support for Base64, Base32, and Base16 encoding and decoding, including optional case folding and optional alternative alphabets. (Contributed by Barry Warsaw.)
sv: Modulen :mod:`base64` har nu mer komplett :rfc:`3548`-stöd för Base64-, Base32- och Base16-kodning och -avkodning, inklusive valfri skiftlägesändring och valfria alternativa alfabet. (Bidrag från Barry Warsaw.)

source: The :mod:`bisect` module now has an underlying C implementation for improved performance. (Contributed by Dmitry Vasiliev.)
sv: Modulen :mod:`bisect` har nu en underliggande C-implementering för förbättrad prestanda. (Bidrag från Dmitry Vasiliev.)

source: The CJKCodecs collections of East Asian codecs, maintained by Hye-Shik Chang, was integrated into 2.4. The new encodings are:
sv: CJKCodecs samlingar av östasiatiska codecs, som underhålls av Hye-Shik Chang, integrerades i 2.4. De nya kodningarna är:

source: Chinese (PRC): gb2312, gbk, gb18030, big5hkscs, hz
sv: Kinesiska (PRC): gb2312, gbk, gb18030, big5hkscs, hz
