Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: What's New in Python 2.6
sv: Vad är nytt i Python 2.6

source: Author
sv: Författare

source: This article explains the new features in Python 2.6, released on October 1, 2008. The release schedule is described in :pep:`361`.
sv: Den här artikeln förklarar de nya funktionerna i Python 2.6, som släpptes den 1 oktober 2008. Utgivningsschemat beskrivs i :pep:`361`.

source: The major theme of Python 2.6 is preparing the migration path to Python 3.0, a major redesign of the language. Whenever possible, Python 2.6 incorporates new features and syntax from 3.0 while remaining compatible with existing code by not removing older features or syntax. When it's not possible to do that, Python 2.6 tries to do what it can, adding compatibility functions in a :mod:`future_builtins` module and a :option:`!-3` switch to warn about usages that will become unsupported in 3.0.
sv: Huvudtemat i Python 2.6 är att förbereda migreringsvägen till Python 3.0, en stor omdesign av språket. När det är möjligt införlivar Python 2.6 nya funktioner och syntax från 3.0 samtidigt som den förblir kompatibel med befintlig kod genom att inte ta bort äldre funktioner eller syntax. När det inte är möjligt att göra det försöker Python 2.6 göra vad det kan, genom att lägga till kompatibilitetsfunktioner i en :mod:`future_builtins`-modul och en :option:`!-3`-switch för att varna för användningar som inte längre stöds i 3.0.

source: Some significant new packages have been added to the standard library, such as the :mod:`multiprocessing` and :mod:`json` modules, but there aren't many new features that aren't related to Python 3.0 in some way.
sv: Några viktiga nya paket har lagts till i standardbiblioteket, till exempel modulerna :mod:`multiprocessing` och :mod:`json`, men det finns inte många nya funktioner som inte är relaterade till Python 3.0 på något sätt.

source: Python 2.6 also sees a number of improvements and bugfixes throughout the source. A search through the change logs finds there were 259 patches applied and 612 bugs fixed between Python 2.5 and 2.6. Both figures are likely to be underestimates.
sv: Python 2.6 innehåller också ett antal förbättringar och buggfixar i hela källan. En sökning genom ändringsloggarna visar att det fanns 259 korrigeringar som tillämpades och 612 buggar fixade mellan Python 2.5 och 2.6. Båda siffrorna är sannolikt underskattningar.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.6. If you want to understand the rationale for the design and implementation, refer to the PEP for a particular new feature. Whenever possible, "What's New in Python" links to the bug/patch item for each change.
sv: Den här artikeln försöker inte ge en fullständig specifikation av de nya funktionerna, utan ger istället en praktisk översikt. För fullständiga detaljer bör du hänvisa till dokumentationen för Python 2.6. Om du vill förstå bakgrunden till utformningen och implementeringen bör du läsa PEP:n för en viss ny funktion. När det är möjligt länkar "What's New in Python" till buggen/patch-objektet för varje ändring.

source: The development cycle for Python versions 2.6 and 3.0 was synchronized, with the alpha and beta releases for both versions being made on the same days. The development of 3.0 has influenced many features in 2.6.
sv: Utvecklingscykeln för Python-versionerna 2.6 och 3.0 var synkroniserad, och alfa- och beta-versionerna för båda versionerna släpptes samma dagar. Utvecklingen av 3.0 har påverkat många funktioner i 2.6.

source: Python 3.0 is a far-ranging redesign of Python that breaks compatibility with the 2.x series. This means that existing Python code will need some conversion in order to run on Python 3.0. However, not all the changes in 3.0 necessarily break compatibility. In cases where new features won't cause existing code to break, they've been backported to 2.6 and are described in this document in the appropriate place. Some of the 3.0-derived features are:
sv: Python 3.0 är en omfattande omarbetning av Python som bryter kompatibiliteten med 2.x-serien. Detta innebär att befintlig Python-kod kommer att behöva en viss konvertering för att kunna köras på Python 3.0. Men inte alla förändringar i 3.0 bryter nödvändigtvis kompatibiliteten. I de fall där nya funktioner inte kommer att orsaka att befintlig kod bryts, har de backporterats till 2.6 och beskrivs i detta dokument på lämplig plats. Några av de 3.0-härledda funktionerna är:

source: A :meth:`__complex__` method for converting objects to a complex number.
sv: En :meth:`__complex__`-metod för att konvertera objekt till ett komplext tal.

source: Alternate syntax for catching exceptions: ``except TypeError as exc``.
sv: Alternativ syntax för att fånga upp undantag: ``except TypeError as exc``.

source: The addition of :func:`functools.reduce` as a synonym for the built-in :func:`reduce` function.
sv: Tillägget av :func:`functools.reduce` som en synonym till den inbyggda funktionen :func:`reduce`.

source: Python 3.0 adds several new built-in functions and changes the semantics of some existing builtins. Functions that are new in 3.0 such as :func:`bin` have simply been added to Python 2.6, but existing builtins haven't been changed; instead, the :mod:`future_builtins` module has versions with the new 3.0 semantics. Code written to be compatible with 3.0 can do ``from future_builtins import hex, map`` as necessary.
sv: Python 3.0 lägger till flera nya inbyggda funktioner och ändrar semantiken för vissa befintliga builtins. Funktioner som är nya i 3.0 som :func:`bin` har helt enkelt lagts till i Python 2.6, men befintliga inbyggda funktioner har inte ändrats; istället har modulen :mod:`future_builtins` versioner med den nya 3.0-semantiken. Kod skriven för att vara kompatibel med 3.0 kan göra ``from future_builtins import hex, map`` vid behov.

source: A new command-line switch, :option:`!-3`, enables warnings about features that will be removed in Python 3.0. You can run code with this switch to see how much work will be necessary to port code to 3.0. The value of this switch is available to Python code as the boolean variable :data:`sys.py3kwarning`, and to C extension code as :c:data:`!Py_Py3kWarningFlag`.
sv: En ny kommandoradsväxel, :option:`!-3`, aktiverar varningar om funktioner som kommer att tas bort i Python 3.0. Du kan köra kod med denna switch för att se hur mycket arbete som kommer att krävas för att porta kod till 3.0. Värdet på denna switch är tillgänglig för Python-kod som den booleska variabeln :data:`sys.py3kwarning`, och för C-tilläggskod som :c:data:`!Py_Py3kWarningFlag`.

source: The 3\ *xxx* series of PEPs, which contains proposals for Python 3.0. :pep:`3000` describes the development process for Python 3.0. Start with :pep:`3100` that describes the general goals for Python 3.0, and then explore the higher-numbered PEPs that propose specific features.
sv: 3\ *xxx*-serien av PEPs, som innehåller förslag för Python 3.0. :pep:`3000` beskriver utvecklingsprocessen för Python 3.0. Börja med :pep:`3100` som beskriver de allmänna målen för Python 3.0, och utforska sedan de högre numrerade PEP:erna som föreslår specifika funktioner.

source: Changes to the Development Process
sv: Förändringar i utvecklingsprocessen

source: While 2.6 was being developed, the Python development process underwent two significant changes: we switched from SourceForge's issue tracker to a customized Roundup installation, and the documentation was converted from LaTeX to reStructuredText.
sv: Medan 2.6 utvecklades genomgick Pythons utvecklingsprocess två betydande förändringar: vi bytte från SourceForges issue tracker till en anpassad Roundup-installation och dokumentationen konverterades från LaTeX till reStructuredText.

source: New Issue Tracker: Roundup
sv: Spårare av nya nummer: Sammanställning

source: For a long time, the Python developers had been growing increasingly annoyed by SourceForge's bug tracker. SourceForge's hosted solution doesn't permit much customization; for example, it wasn't possible to customize the life cycle of issues.
sv: Python-utvecklarna hade under en längre tid blivit alltmer irriterade på SourceForges buggtracker. SourceForges värdbaserade lösning tillåter inte mycket anpassning; till exempel var det inte möjligt att anpassa livscykeln för frågor.

source: The infrastructure committee of the Python Software Foundation therefore posted a call for issue trackers, asking volunteers to set up different products and import some of the bugs and patches from SourceForge. Four different trackers were examined: `Jira <https://www.atlassian.com/software/jira/>`__, `Launchpad <https://launchpad.net/>`__, `Roundup <https://roundup.sourceforge.io/>`__, and `Trac <https://trac.edgewall.org/>`__. The committee eventually settled on Jira and Roundup as the two candidates. Jira is a commercial product that offers no-cost hosted instances to free-software projects; Roundup is an open-source project that requires volunteers to administer it and a server to host it.
sv: Infrastrukturkommittén i Python Software Foundation publicerade därför en efterlysning av problemspårare och bad frivilliga att sätta upp olika produkter och importera några av buggarna och korrigeringarna från SourceForge. Fyra olika trackers undersöktes: `Jira <https://www.atlassian.com/software/jira/>`__, `Launchpad <https://launchpad.net/>`__, `Roundup <https://roundup.sourceforge.io/>`__ och `Trac <https://trac.edgewall.org/>`__. Kommittén enades till slut om Jira och Roundup som de två kandidaterna. Jira är en kommersiell produkt som erbjuder kostnadsfria hostade instanser till projekt med fri programvara; Roundup är ett projekt med öppen källkod som kräver frivilliga för att administrera det och en server för att hosta det.

source: After posting a call for volunteers, a new Roundup installation was set up at https://bugs.python.org. One installation of Roundup can host multiple trackers, and this server now also hosts issue trackers for Jython and for the Python web site. It will surely find other uses in the future. Where possible, this edition of "What's New in Python" links to the bug/patch item for each change.
sv: Efter att ha publicerat ett upprop för frivilliga, sattes en ny Roundup-installation upp på https://bugs.python.org. En installation av Roundup kan vara värd för flera spårare, och denna server är nu också värd för problemspårare för Jython och för Python-webbplatsen. Den kommer säkert att hitta andra användningsområden i framtiden. Där det är möjligt länkar denna utgåva av "What's New in Python" till buggen/patchen för varje ändring.

source: Hosting of the Python bug tracker is kindly provided by `Upfront Systems <https://upfrontsoftware.co.za>`__ of Stellenbosch, South Africa. Martin von Löwis put a lot of effort into importing existing bugs and patches from SourceForge; his scripts for this import operation are at ``https://svn.python.org/view/tracker/importer/`` and may be useful to other projects wishing to move from SourceForge to Roundup.
sv: Värd för Python-buggspåraren är vänligen tillhandahållen av `Upfront Systems <https://upfrontsoftware.co.za>`__ i Stellenbosch, Sydafrika. Martin von Löwis har lagt ner mycket arbete på att importera befintliga buggar och korrigeringar från SourceForge; hans skript för denna import finns på ``https://svn.python.org/view/tracker/importer/`` och kan vara användbara för andra projekt som vill flytta från SourceForge till Roundup.

source: The Python bug tracker.
sv: Pythons buggspårare.

source: The Jython bug tracker.
sv: Buggspåraren för Jython.

source: Roundup downloads and documentation.
sv: Nedladdningar och dokumentation av Roundup.

source: Martin von Löwis's conversion scripts.
sv: Martin von Löwis konverteringsskript.

source: New Documentation Format: reStructuredText Using Sphinx
sv: Nytt dokumentationsformat: reStructuredText med hjälp av Sphinx

source: The Python documentation was written using LaTeX since the project started around 1989. In the 1980s and early 1990s, most documentation was printed out for later study, not viewed online. LaTeX was widely used because it provided attractive printed output while remaining straightforward to write once the basic rules of the markup were learned.
sv: Python-dokumentationen skrevs med hjälp av LaTeX sedan projektet startade omkring 1989. Under 1980-talet och början av 1990-talet skrevs den mesta dokumentationen ut för senare studier och visades inte online. LaTeX användes i stor utsträckning eftersom det gav attraktiva utskrifter samtidigt som det var enkelt att skriva när man väl lärt sig de grundläggande reglerna för markeringen.

source: Today LaTeX is still used for writing publications destined for printing, but the landscape for programming tools has shifted. We no longer print out reams of documentation; instead, we browse through it online and HTML has become the most important format to support. Unfortunately, converting LaTeX to HTML is fairly complicated and Fred L. Drake Jr., the long-time Python documentation editor, spent a lot of time maintaining the conversion process. Occasionally people would suggest converting the documentation into SGML and later XML, but performing a good conversion is a major task and no one ever committed the time required to finish the job.
sv: Idag används LaTeX fortfarande för att skriva publikationer som ska tryckas, men landskapet för programmeringsverktyg har förändrats. Vi skriver inte längre ut mängder av dokumentation, utan bläddrar igenom den online och HTML har blivit det viktigaste formatet att stödja. Tyvärr är det ganska komplicerat att konvertera LaTeX till HTML och Fred L. Drake Jr, Pythons mångårige dokumentationsredaktör, ägnade mycket tid åt att underhålla konverteringsprocessen. Ibland föreslog folk att dokumentationen skulle konverteras till SGML och senare XML, men att göra en bra konvertering är en stor uppgift och ingen avsatte någonsin den tid som krävdes för att slutföra jobbet.

source: During the 2.6 development cycle, Georg Brandl put a lot of effort into building a new toolchain for processing the documentation. The resulting package is called Sphinx, and is available from https://www.sphinx-doc.org/.
sv: Under utvecklingscykeln för 2.6 lade Georg Brandl ner mycket arbete på att bygga en ny verktygskedja för bearbetning av dokumentationen. Det resulterande paketet kallas Sphinx och finns tillgängligt från https://www.sphinx-doc.org/.

source: Sphinx concentrates on HTML output, producing attractively styled and modern HTML; printed output is still supported through conversion to LaTeX. The input format is reStructuredText, a markup syntax supporting custom extensions and directives that is commonly used in the Python community.
sv: Sphinx koncentrerar sig på HTML-utdata och producerar attraktivt utformad och modern HTML; tryckt utdata stöds fortfarande genom konvertering till LaTeX. Inmatningsformatet är reStructuredText, en markeringssyntax som stöder anpassade tillägg och direktiv och som ofta används i Python-samhället.

source: Sphinx is a standalone package that can be used for writing, and almost two dozen other projects (`listed on the Sphinx web site <https://www.sphinx-doc.org/en/master/examples.html>`__) have adopted Sphinx as their documentation tool.
sv: Sphinx är ett fristående paket som kan användas för att skriva, och nästan två dussin andra projekt (`listade på Sphinx webbplats <https://www.sphinx-doc.org/en/master/examples.html>`__) har antagit Sphinx som sitt dokumentationsverktyg.

source: `Documenting Python <https://devguide.python.org/documenting/>`__
sv: `Dokumentation av Python <https://devguide.python.org/documenting/>`__

source: Describes how to write for Python's documentation.
sv: Beskriver hur man skriver för Pythons dokumentation.

source: Documentation and code for the Sphinx toolchain.
sv: Dokumentation och kod för verktygskedjan Sphinx.

source: The underlying reStructuredText parser and toolset.
sv: Den underliggande reStructuredText-parsern och verktygssatsen.

source: PEP 343: The 'with' statement
sv: PEP 343: Uttalandet "med

source: The previous version, Python 2.5, added the ':keyword:`with`' statement as an optional feature, to be enabled by a ``from __future__ import with_statement`` directive. In 2.6 the statement no longer needs to be specially enabled; this means that :keyword:`!with` is now always a keyword. The rest of this section is a copy of the corresponding section from the "What's New in Python 2.5" document; if you're familiar with the ':keyword:`!with`' statement from Python 2.5, you can skip this section.
sv: Den tidigare versionen, Python 2.5, lade till ':keyword:`with`'-uttalandet som en valfri funktion, som skulle aktiveras med ett ``from __future__ import with_statement``-direktiv. I 2.6 behöver uttalandet inte längre aktiveras särskilt; detta innebär att :keyword:`!with` nu alltid är ett nyckelord. Resten av detta avsnitt är en kopia av motsvarande avsnitt från dokumentet "What's New in Python 2.5"; om du är bekant med ':keyword:`!with`'-uttalandet från Python 2.5 kan du hoppa över detta avsnitt.

source: The ':keyword:`with`' statement clarifies code that previously would use ``try...finally`` blocks to ensure that clean-up code is executed. In this section, I'll discuss the statement as it will commonly be used. In the next section, I'll examine the implementation details and show how to write objects for use with this statement.
sv: Satsen ':keyword:`with`' förtydligar kod som tidigare skulle använda ``try...finally``-block för att säkerställa att uppstädningskoden körs. I det här avsnittet diskuterar jag uttalandet som det vanligtvis kommer att användas. I nästa avsnitt undersöker jag implementeringsdetaljerna och visar hur man skriver objekt som kan användas med den här satsen.

source: The ':keyword:`with`' statement is a control-flow structure whose basic structure is::
sv: Satsen ':nyckelord:`med`' är en kontrollflödesstruktur vars grundstruktur är::

source: with expression [as variable]: with-block
sv: med uttryck [som variabel]: med-blockera

source: The expression is evaluated, and it should result in an object that supports the context management protocol (that is, has :meth:`~object.__enter__` and :meth:`~object.__exit__` methods).
sv: Uttrycket utvärderas och bör resultera i ett objekt som stöder protokollet för kontexthantering (dvs. har metoderna :meth:`~object.__enter__` och :meth:`~object.__exit__`).

source: The object's :meth:`~object.__enter__` is called before *with-block* is executed and therefore can run set-up code. It also may return a value that is bound to the name *variable*, if given. (Note carefully that *variable* is *not* assigned the result of *expression*.)
sv: Objektets :meth:`~object.__enter__` anropas innan *with-block* exekveras och kan därför köra installationskod. Den kan också returnera ett värde som är bundet till namnet *variable*, om det anges. (Observera noga att *variable* *inte* tilldelas resultatet av *expression*)

source: After execution of the *with-block* is finished, the object's :meth:`~object.__exit__` method is called, even if the block raised an exception, and can therefore run clean-up code.
sv: Efter att *with-blocket* har exekverats anropas objektets metod :meth:`~object.__exit__`, även om blocket gav upphov till ett undantag, och kan därför köra uppstädningskod.

source: Some standard Python objects now support the context management protocol and can be used with the ':keyword:`with`' statement. File objects are one example::
sv: Vissa standard Python-objekt har nu stöd för kontexthanteringsprotokollet och kan användas med ':keyword:`with`'. Filobjekt är ett exempel::

source: with open('/etc/passwd', 'r') as f: for line in f: print line ... more processing code ...
sv: med open('/etc/passwd', 'r') som f: för rad i f: skriv ut rad ... mer bearbetningskod ...

source: After this statement has executed, the file object in *f* will have been automatically closed, even if the :keyword:`for` loop raised an exception part-way through the block.
sv: Efter att denna sats har exekverats kommer filobjektet i *f* att ha stängts automatiskt, även om :keyword:`for` -loopen gjorde ett undantag halvvägs genom blocket.

source: In this case, *f* is the same object created by :func:`open`, because :meth:`~object.__enter__` returns *self*.
sv: I det här fallet är *f* samma objekt som skapades av :func:`open`, eftersom :meth:`~object.__enter__` returnerar *self*.

source: The :mod:`threading` module's locks and condition variables also support the ':keyword:`with`' statement::
sv: Modulen :mod:`threading`:s lås och villkorvariabler stöder också ':keyword:`with`'-satsen::

source: lock = threading.Lock() with lock: # Critical section of code ...
sv: lock = threading.Lock() med lock: # Kritisk del av koden ...

source: The lock is acquired before the block is executed and always released once the block is complete.
sv: Låset förvärvas innan blocket exekveras och släpps alltid när blocket är klart.

source: The :func:`localcontext` function in the :mod:`decimal` module makes it easy to save and restore the current decimal context, which encapsulates the desired precision and rounding characteristics for computations::
sv: Funktionen :func:`localcontext` i modulen :mod:`decimal` gör det enkelt att spara och återställa den aktuella decimalkontexten, som innehåller önskad precision och avrundningsegenskaper för beräkningar::

source: from decimal import Decimal, Context, localcontext # Displays with default precision of 28 digits v = Decimal('578') print v.sqrt() with localcontext(Context(prec=16)): # All code in this block uses a precision of 16 digits. # The original context is restored on exiting the block. print v.sqrt()
sv: från decimal importera Decimal, Context, localcontext # Visar med standardprecision på 28 siffror v = Decimal('578') print v.sqrt() med localcontext(Context(prec=16)): # All kod i detta block använder en precision på 16 siffror. # Den ursprungliga kontexten återställs när blocket avslutas. skriv ut v.sqrt()

source: Writing Context Managers
sv: Skriva för kontextansvariga

source: Under the hood, the ':keyword:`with`' statement is fairly complicated. Most people will only use ':keyword:`!with`' in company with existing objects and don't need to know these details, so you can skip the rest of this section if you like. Authors of new objects will need to understand the details of the underlying implementation and should keep reading.
sv: Under huven är ':keyword:`with`'-satsen ganska komplicerad. De flesta människor kommer bara att använda ':keyword:`!with`' i samband med befintliga objekt och behöver inte känna till dessa detaljer, så du kan hoppa över resten av det här avsnittet om du vill. Författare till nya objekt kommer att behöva förstå detaljerna i den underliggande implementationen och bör fortsätta läsa.

source: A high-level explanation of the context management protocol is:
sv: En förklaring på hög nivå av protokollet för kontexthantering är:

source: The expression is evaluated and should result in an object called a "context manager". The context manager must have :meth:`~object.__enter__` and :meth:`~object.__exit__` methods.
sv: Uttrycket utvärderas och bör resultera i ett objekt som kallas "context manager". Kontexthanteraren måste ha metoderna :meth:`~object.__enter__` och :meth:`~object.__exit__`.
