Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: This function was added to close a security hole for applications that embed Python. The old function, :c:func:`!PySys_SetArgv`, would always update ``sys.path``, and sometimes it would add the current directory. This meant that, if you ran an application embedding Python in a directory controlled by someone else, attackers could put a Trojan-horse module in the directory (say, a file named :file:`os.py`) that your application would then import and run.
sv: Denna funktion lades till för att täppa till ett säkerhetshål för program som bäddar in Python. Den gamla funktionen, :c:func:`!PySys_SetArgv`, uppdaterade alltid ``sys.path``, och ibland lade den till den aktuella katalogen. Detta innebar att om du körde ett program som bäddade in Python i en katalog som kontrollerades av någon annan, kunde angripare lägga in en trojansk modul i katalogen (till exempel en fil med namnet :file:`os.py`) som ditt program sedan importerade och körde.

source: If you maintain a C/C++ application that embeds Python, check whether you're calling :c:func:`!PySys_SetArgv` and carefully consider whether the application should be using :c:func:`!PySys_SetArgvEx` with *updatepath* set to false. Note that using this function will break compatibility with Python versions 2.6.5 and earlier; if you have to continue working with earlier versions, you can leave the call to :c:func:`!PySys_SetArgv` alone and call ``PyRun_SimpleString("sys.path.pop(0)\n")`` afterwards to discard the first ``sys.path`` component.
sv: Om du underhåller ett C/C++-program som bäddar in Python, kontrollera om du anropar :c:func:`!PySys_SetArgv` och överväg noga om programmet bör använda :c:func:`!PySys_SetArgvEx` med *updatepath* satt till false. Observera att användningen av denna funktion kommer att bryta kompatibiliteten med Python-versioner 2.6.5 och tidigare; om du måste fortsätta att arbeta med tidigare versioner kan du låta bli att anropa :c:func:`!PySys_SetArgv` och anropa ``PyRun_SimpleString("sys.path.pop(0)\n")`` efteråt för att kassera den första ``sys.path``-komponenten.

source: Security issue reported as :cve:`2008-5983`; discussed in :gh:`50003`, and fixed by Antoine Pitrou.
sv: Säkerhetsproblem rapporterat som :cve:`2008-5983`; diskuterat i :gh:`50003`, och åtgärdat av Antoine Pitrou.

source: The BerkeleyDB module now has a C API object, available as ``bsddb.db.api``. This object can be used by other C extensions that wish to use the :mod:`bsddb` module for their own purposes. (Contributed by Duncan Grisby.)
sv: BerkeleyDB-modulen har nu ett C API-objekt, tillgängligt som ``bsddb.db.api``. Detta objekt kan användas av andra C-tillägg som vill använda :mod:`bsddb`-modulen för sina egna syften. (Bidrag från Duncan Grisby.)

source: The new buffer interface, previously described in `the PEP 3118 section <#pep-3118-revised-buffer-protocol>`__, adds :c:func:`PyObject_GetBuffer` and :c:func:`PyBuffer_Release`, as well as a few other functions.
sv: Det nya buffertgränssnittet, som tidigare beskrevs i avsnittet <#pep-3118-revised-buffer-protocol>`__ i PEP 3118, lägger till :c:func:`PyObject_GetBuffer` och :c:func:`PyBuffer_Release`, samt några andra funktioner.

source: Python's use of the C stdio library is now thread-safe, or at least as thread-safe as the underlying library is. A long-standing potential bug occurred if one thread closed a file object while another thread was reading from or writing to the object. In 2.6 file objects have a reference count, manipulated by the :c:func:`!PyFile_IncUseCount` and :c:func:`!PyFile_DecUseCount` functions. File objects can't be closed unless the reference count is zero. :c:func:`!PyFile_IncUseCount` should be called while the GIL is still held, before carrying out an I/O operation using the ``FILE *`` pointer, and :c:func:`!PyFile_DecUseCount` should be called immediately after the GIL is re-acquired. (Contributed by Antoine Pitrou and Gregory P. Smith.)
sv: Pythons användning av C stdio-biblioteket är nu trådsäkert, eller åtminstone lika trådsäkert som det underliggande biblioteket är. En potentiell bugg som funnits länge uppstod om en tråd stängde ett filobjekt medan en annan tråd läste från eller skrev till objektet. I 2.6 har filobjekt ett referensantal som manipuleras av funktionerna :c:func:`!PyFile_IncUseCount` och :c:func:`!PyFile_DecUseCount`. Filobjekt kan inte stängas om inte referensantalet är noll. :c:func:`!PyFile_IncUseCount` bör anropas medan GIL fortfarande hålls, innan en I/O-operation utförs med hjälp av pekaren ``FILE *``, och :c:func:`!PyFile_DecUseCount` bör anropas omedelbart efter att GIL återfåtts. (Bidrag från Antoine Pitrou och Gregory P. Smith.)

source: Importing modules simultaneously in two different threads no longer deadlocks; it will now raise an :exc:`ImportError`. A new API function, :c:func:`PyImport_ImportModuleNoBlock`, will look for a module in ``sys.modules`` first, then try to import it after acquiring an import lock. If the import lock is held by another thread, an :exc:`ImportError` is raised. (Contributed by Christian Heimes.)
sv: Att importera moduler samtidigt i två olika trådar leder inte längre till dödlägen; det kommer nu att ge upphov till ett :exc:`ImportError`. En ny API-funktion, :c:func:`PyImport_ImportModuleNoBlock`, letar först efter en modul i ``sys.modules`` och försöker sedan importera den efter att ha fått ett importlås. Om importlåset hålls av en annan tråd, kommer ett :exc:`ImportError` att uppstå. (Bidrag från Christian Heimes.)

source: Several functions return information about the platform's floating-point support. :c:func:`PyFloat_GetMax` returns the maximum representable floating-point value, and :c:func:`PyFloat_GetMin` returns the minimum positive value. :c:func:`PyFloat_GetInfo` returns an object containing more information from the :file:`float.h` file, such as ``"mant_dig"`` (number of digits in the mantissa), ``"epsilon"`` (smallest difference between 1.0 and the next largest value representable), and several others. (Contributed by Christian Heimes; :issue:`1534`.)
sv: Flera funktioner returnerar information om plattformens stöd för flyttal. :c:func:`PyFloat_GetMax` returnerar det högsta representerbara flyttalsvärdet och :c:func:`PyFloat_GetMin` returnerar det lägsta positiva värdet. :c:func:`PyFloat_GetInfo` returnerar ett objekt som innehåller mer information från filen :file:`float.h`, till exempel ``"mant_dig"`` (antal siffror i mantissan), ``"epsilon"`` (minsta skillnaden mellan 1,0 och det näst största representerbara värdet) och flera andra. (Bidrag från Christian Heimes; :issue:`1534`.)

source: C functions and methods that use :c:func:`PyComplex_AsCComplex` will now accept arguments that have a :meth:`__complex__` method. In particular, the functions in the :mod:`cmath` module will now accept objects with this method. This is a backport of a Python 3.0 change. (Contributed by Mark Dickinson; :issue:`1675423`.)
sv: C-funktioner och metoder som använder :c:func:`PyComplex_AsCComplex` kommer nu att acceptera argument som har en :meth:`__complex__`-metod. I synnerhet kommer funktionerna i modulen :mod:`cmath` nu att acceptera objekt med den här metoden. Detta är en backport av en ändring i Python 3.0. (Bidrag från Mark Dickinson; :issue:`1675423`.)

source: Python's C API now includes two functions for case-insensitive string comparisons, ``PyOS_stricmp(char*, char*)`` and ``PyOS_strnicmp(char*, char*, Py_ssize_t)``. (Contributed by Christian Heimes; :issue:`1635`.)
sv: Pythons C API innehåller nu två funktioner för skiftlägesokänsliga strängjämförelser, ``PyOS_stricmp(char*, char*)`` och ``PyOS_strnicmp(char*, char*, Py_ssize_t)``. (Bidrag från Christian Heimes; :issue:`1635`.)

source: Many C extensions define their own little macro for adding integers and strings to the module's dictionary in the ``init*`` function. Python 2.6 finally defines standard macros for adding values to a module, :c:macro:`PyModule_AddStringMacro` and :c:macro:`PyModule_AddIntMacro()`. (Contributed by Christian Heimes.)
sv: Många C-tillägg definierar sina egna små makron för att lägga till heltal och strängar till modulens ordbok i funktionen ``init*``. Python 2.6 definierar äntligen standardmakron för att lägga till värden i en modul, :c:macro:`PyModule_AddStringMacro` och :c:macro:`PyModule_AddIntMacro()`. (Bidrag från Christian Heimes.)

source: Some macros were renamed in both 3.0 and 2.6 to make it clearer that they are macros, not functions. :c:macro:`!Py_Size()` became :c:macro:`Py_SIZE()`, :c:macro:`!Py_Type()` became :c:macro:`Py_TYPE()`, and :c:macro:`!Py_Refcnt()` became :c:macro:`Py_REFCNT()`. The mixed-case macros are still available in Python 2.6 for backward compatibility. (:issue:`1629`)
sv: Vissa makron döptes om i både 3.0 och 2.6 för att göra det tydligare att de är makron, inte funktioner. :c:macro:`!Py_Size()` blev :c:macro:`Py_SIZE()`, :c:macro:`!Py_Type()` blev :c:macro:`Py_TYPE()`, och :c:macro:`!Py_Refcnt()` blev :c:macro:`Py_REFCNT()`. Makron med blandade versaler är fortfarande tillgängliga i Python 2.6 för bakåtkompatibilitet. (:issue:`1629`)

source: Distutils now places C extensions it builds in a different directory when running on a debug version of Python. (Contributed by Collin Winter; :issue:`1530959`.)
sv: Distutils placerar nu C-tillägg som den bygger i en annan katalog när den körs på en debug-version av Python. (Bidrag från Collin Winter; :issue:`1530959`.)

source: Several basic data types, such as integers and strings, maintain internal free lists of objects that can be re-used. The data structures for these free lists now follow a naming convention: the variable is always named ``free_list``, the counter is always named ``numfree``, and a macro ``Py<typename>_MAXFREELIST`` is always defined.
sv: Flera grundläggande datatyper, t.ex. heltal och strängar, har interna fria listor med objekt som kan återanvändas. Datastrukturerna för dessa fria listor följer nu en namngivningskonvention: variabeln heter alltid ``free_list``, räknaren heter alltid ``numfree`` och ett makro ``Py<typename>_MAXFREELIST`` definieras alltid.

source: A new Makefile target, "make patchcheck", prepares the Python source tree for making a patch: it fixes trailing whitespace in all modified ``.py`` files, checks whether the documentation has been changed, and reports whether the :file:`Misc/ACKS` and :file:`Misc/NEWS` files have been updated. (Contributed by Brett Cannon.)
sv: Ett nytt Makefile-mål, "make patchcheck", förbereder Python-källträdet för att göra en patch: det fixar efterföljande blanksteg i alla modifierade ``.py`'-filer, kontrollerar om dokumentationen har ändrats och rapporterar om filerna :file:`Misc/ACKS` och :file:`Misc/NEWS` har uppdaterats. (Bidrag från Brett Cannon.)

source: Another new target, "make profile-opt", compiles a Python binary using GCC's profile-guided optimization. It compiles Python with profiling enabled, runs the test suite to obtain a set of profiling results, and then compiles using these results for optimization. (Contributed by Gregory P. Smith.)
sv: Ett annat nytt mål, "make profile-opt", kompilerar en Python-binärfil med hjälp av GCC:s profilstyrda optimering. Det kompilerar Python med profilering aktiverad, kör testsviten för att få en uppsättning profileringsresultat och kompilerar sedan med hjälp av dessa resultat för optimering. (Bidrag från Gregory P. Smith.)

source: Port-Specific Changes: Windows
sv: Portspecifika ändringar: Fönster

source: The support for Windows 95, 98, ME and NT4 has been dropped. Python 2.6 requires at least Windows 2000 SP4.
sv: Stödet för Windows 95, 98, ME och NT4 har tagits bort. Python 2.6 kräver minst Windows 2000 SP4.

source: The new default compiler on Windows is Visual Studio 2008 (version 9.0). The build directories for Visual Studio 2003 (version 7.1) and 2005 (version 8.0) were moved into the PC/ directory. The new :file:`PCbuild` directory supports cross compilation for X64, debug builds and Profile Guided Optimization (PGO). PGO builds are roughly 10% faster than normal builds. (Contributed by Christian Heimes with help from Amaury Forgeot d'Arc and Martin von Löwis.)
sv: Den nya standardkompilatorn i Windows är Visual Studio 2008 (version 9.0). Byggkatalogerna för Visual Studio 2003 (version 7.1) och 2005 (version 8.0) har flyttats till katalogen PC/. Den nya :file:`PCbuild`-katalogen stöder korskompilering för X64, debug-byggnader och Profile Guided Optimization (PGO). PGO-byggnationer är ungefär 10% faster än normala byggnationer. (Bidrag från Christian Heimes med hjälp av Amaury Forgeot d'Arc och Martin von Löwis)

source: The :mod:`msvcrt` module now supports both the normal and wide char variants of the console I/O API. The :func:`~msvcrt.getwch` function reads a keypress and returns a Unicode value, as does the :func:`~msvcrt.getwche` function. The :func:`~msvcrt.putwch` function takes a Unicode character and writes it to the console. (Contributed by Christian Heimes.)
sv: Modulen :mod:`msvcrt` har nu stöd för både normal- och wide char-varianterna av konsolens I/O API. Funktionen :func:`~msvcrt.getwch` läser en tangenttryckning och returnerar ett Unicode-värde, vilket även gäller för funktionen :func:`~msvcrt.getwche`. Funktionen :func:`~msvcrt.putwch` tar ett Unicode-tecken och skriver det till konsolen. (Bidrag från Christian Heimes.)

source: :func:`os.path.expandvars` will now expand environment variables in the form "%var%", and "~user" will be expanded into the user's home directory path. (Contributed by Josiah Carlson; :issue:`957650`.)
sv: :func:`os.path.expandvars` kommer nu att expandera miljövariabler i formen "%var%", och "~user" kommer att expanderas till användarens sökväg till hemkatalogen. (Bidrag från Josiah Carlson; :issue:`957650`.)

source: The :mod:`socket` module's socket objects now have an :meth:`~socket.socket.ioctl` method that provides a limited interface to the :c:func:`WSAIoctl` system interface.
sv: Socketobjekten i modulen :mod:`socket` har nu en metod :meth:`~socket.socket.ioctl` som ger ett begränsat gränssnitt till systemgränssnittet :c:func:`WSAIoctl`.

source: The :mod:`_winreg <winreg>` module now has a function, :func:`~winreg.ExpandEnvironmentStrings`, that expands environment variable references such as ``%NAME%`` in an input string. The handle objects provided by this module now support the context protocol, so they can be used in :keyword:`with` statements. (Contributed by Christian Heimes.)
sv: Modulen :mod:`_winreg <winreg>` har nu en funktion, :func:`~winreg.ExpandEnvironmentStrings`, som expanderar referenser till miljövariabler som ``%NAME%`` i en indatasträng. Handle-objekten som tillhandahålls av denna modul stöder nu kontextprotokollet, så att de kan användas i :keyword:`with`-satser. (Bidrag från Christian Heimes.)

source: :mod:`_winreg <winreg>` also has better support for x64 systems, exposing the :func:`~winreg.DisableReflectionKey`, :func:`~winreg.EnableReflectionKey`, and :func:`~winreg.QueryReflectionKey` functions, which enable and disable registry reflection for 32-bit processes running on 64-bit systems. (:issue:`1753245`)
sv: :mod:`_winreg <winreg>` har också bättre stöd för x64-system, med funktionerna :func:`~winreg.DisableReflectionKey`, :func:`~winreg.EnableReflectionKey` och :func:`~winreg.QueryReflectionKey`, som aktiverar och inaktiverar registerreflektion för 32-bitars processer som körs på 64-bitars system. (:issue:`1753245`)

source: The :mod:`!msilib` module's :class:`!Record` object gained :meth:`!GetInteger` and :meth:`!GetString` methods that return field values as an integer or a string. (Contributed by Floris Bruynooghe; :issue:`2125`.)
sv: Modulen :mod:`!msilib`:s :class:`!Record`-objekt har fått metoderna :meth:`!GetInteger` och :meth:`!GetString` som returnerar fältvärden som ett heltal eller en sträng. (Bidrag från Floris Bruynooghe; :issue:`2125`.)

source: Port-Specific Changes: Mac OS X
sv: Hamnspecifika ändringar: Mac OS X

source: When compiling a framework build of Python, you can now specify the framework name to be used by providing the :option:`!--with-framework-name=` option to the :program:`configure` script.
sv: När du kompilerar en ramverksversion av Python kan du nu ange vilket ramverksnamn som ska användas genom att ange alternativet :option:`!--with-framework-name=` till skriptet :program:`configure`.

source: The :mod:`!macfs` module has been removed. This in turn required the :func:`!macostools.touched` function to be removed because it depended on the :mod:`!macfs` module. (:issue:`1490190`)
sv: Modulen :mod:`!macfs` har tagits bort. Detta krävde i sin tur att funktionen :func:`!macostools.touched` togs bort eftersom den var beroende av modulen :mod:`!macfs`. (:issue:`1490190`)

source: Many other Mac OS modules have been deprecated and will be removed in Python 3.0: :mod:`!_builtinSuites`, :mod:`!aepack`, :mod:`!aetools`, :mod:`!aetypes`, :mod:`!applesingle`, :mod:`!appletrawmain`, :mod:`!appletrunner`, :mod:`!argvemulator`, :mod:`!Audio_mac`, :mod:`!autoGIL`, :mod:`!Carbon`, :mod:`!cfmfile`, :mod:`!CodeWarrior`, :mod:`!ColorPicker`, :mod:`!EasyDialogs`, :mod:`!Explorer`, :mod:`!Finder`, :mod:`!FrameWork`, :mod:`!findertools`, :mod:`!ic`, :mod:`!icglue`, :mod:`!icopen`, :mod:`!macerrors`, :mod:`!MacOS`, :mod:`!macfs`, :mod:`!macostools`, :mod:`!macresource`, :mod:`!MiniAEFrame`, :mod:`!Nav`, :mod:`!Netscape`, :mod:`!OSATerminology`, :mod:`!pimp`, :mod:`!PixMapWrapper`, :mod:`!StdSuites`, :mod:`!SystemEvents`, :mod:`!Terminal`, and :mod:`!terminalcommand`.
sv: Många andra Mac OS-moduler har blivit föråldrade och kommer att tas bort i Python 3.0: :mod:`!_builtinSuites`, :mod:`!aepack`, :mod:`!aetools`, :mod:`!aetypes`, :mod:`!applesingle`, :mod:`!appletrawmain`, :mod:`!appletrunner`, :mod:`!argvemulator`, :mod:`!Audio_mac`, :mod:`!autoGIL`, :mod:`!Carbon`, :mod:`!cfmfile`, :mod:`!CodeWarrior`, :mod:`!ColorPicker`, :mod:`!EasyDialogs`, :mod:`!Explorer`, :mod:`!Finder`, :mod:`!FrameWork`, :mod:`!findertools`, :mod:`!ic`, :mod:`!icglue`, :mod:`!icopen`, :mod:`!macerrors`, :mod:`!MacOS`, :mod:`!macfs`, :mod:`!macostools`, :mod:`!macresource`, :mod:`!MiniAEFrame`, :mod:`!Nav`, :mod:`!Netscape`, :mod:`!OSATerminology`, :mod:`!pimp`, :mod:`!PixMapWrapper`, :mod:`!StdSuites`, :mod:`!SystemEvents`, :mod:`!Terminal`, och :mod:`!terminalcommand`.

source: Port-Specific Changes: IRIX
sv: Portspecifika ändringar: IRIX

source: A number of old IRIX-specific modules were deprecated and will be removed in Python 3.0: :mod:`!al` and :mod:`!AL`, :mod:`!cd`, :mod:`!cddb`, :mod:`!cdplayer`, :mod:`!CL` and :mod:`!cl`, :mod:`!DEVICE`, :mod:`!ERRNO`, :mod:`!FILE`, :mod:`!FL` and :mod:`!fl`, :mod:`!flp`, :mod:`!fm`, :mod:`!GET`, :mod:`!GLWS`, :mod:`!GL` and :mod:`!gl`, :mod:`!IN`, :mod:`!IOCTL`, :mod:`!jpeg`, :mod:`!panelparser`, :mod:`!readcd`, :mod:`!SV` and :mod:`!sv`, :mod:`!torgb`, :mod:`!videoreader`, and :mod:`!WAIT`.
sv: Ett antal gamla IRIX-specifika moduler har föråldrats och kommer att tas bort i Python 3.0: :mod:`!al` och :mod:`!AL`, :mod:`!cd`, :mod:`!cddb`, :mod:`!cdplayer`, :mod:`!CL` och :mod:`!cl`, :mod:`!DEVICE`, :mod:`!ERRNO`, :mod:`!FILE`, :mod:`!FL` och :mod:`!fl`, :mod:`!flp`, :mod:`!fm`, :mod:`!GET`, :mod:`!GLWS`, :mod:`!GL` och :mod:`!gl`, :mod:`!IN`, :mod:`!IOCTL`, :mod:`!jpeg`, :mod:`!panelparser`, :mod:`!readcd`, :mod:`!SV` och :mod:`!sv`, :mod:`!torgb`, :mod:`!videoreader`, och :mod:`!WAIT`.

source: Porting to Python 2.6
sv: Portning till Python 2.6

source: This section lists previously described changes and other bugfixes that may require changes to your code:
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod:

source: Classes that aren't supposed to be hashable should set ``__hash__ = None`` in their definitions to indicate the fact.
sv: Klasser som inte är avsedda att vara hashbara bör ange ``__hash__ = None`` i sina definitioner för att ange detta.

source: The :meth:`__init__` method of :class:`collections.deque` now clears any existing contents of the deque before adding elements from the iterable. This change makes the behavior match ``list.__init__()``.
sv: Metoden :meth:`__init__` i :class:`collections.deque` rensar nu allt befintligt innehåll i deque innan element läggs till från iterabeln. Denna ändring gör att beteendet matchar ``list.__init__()``.

source: :meth:`object.__init__` previously accepted arbitrary arguments and keyword arguments, ignoring them. In Python 2.6, this is no longer allowed and will result in a :exc:`TypeError`. This will affect :meth:`__init__` methods that end up calling the corresponding method on :class:`object` (perhaps through using :func:`super`). See :issue:`1683368` for discussion.
sv: :meth:`object.__init__` accepterade tidigare godtyckliga argument och nyckelordsargument och ignorerade dem. I Python 2.6 är detta inte längre tillåtet och kommer att resultera i ett :exc:`TypeError`. Detta kommer att påverka :meth:`__init__`-metoder som i slutändan anropar motsvarande metod på :class:`object` (kanske genom att använda :func:`super`). Se :issue:`1683368` för diskussion.

source: The :class:`Decimal` constructor now accepts leading and trailing whitespace when passed a string. Previously it would raise an :exc:`InvalidOperation` exception. On the other hand, the :meth:`create_decimal` method of :class:`Context` objects now explicitly disallows extra whitespace, raising a :exc:`ConversionSyntax` exception.
sv: Konstruktorn :class:`Decimal` accepterar nu inledande och avslutande blanksteg när den får en sträng. Tidigare skulle den ge upphov till ett :exc:`InvalidOperation` undantag. Å andra sidan, metoden :meth:`create_decimal` för :class:`Context`-objekt tillåter nu uttryckligen inte extra blanksteg, vilket ger upphov till ett :exc:`ConversionSyntax`-undantag.

source: Due to an implementation accident, if you passed a file path to the built-in :func:`__import__` function, it would actually import the specified file. This was never intended to work, however, and the implementation now explicitly checks for this case and raises an :exc:`ImportError`.
sv: På grund av en implementeringsolycka, om du skickade en filsökväg till den inbyggda :func:`__import__`-funktionen, skulle den faktiskt importera den angivna filen. Detta var dock aldrig tänkt att fungera, och implementationen kontrollerar nu uttryckligen för detta fall och ger upphov till ett :exc:`ImportError`.

source: C API: the :c:func:`PyImport_Import` and :c:func:`PyImport_ImportModule` functions now default to absolute imports, not relative imports. This will affect C extensions that import other modules.
sv: C API: funktionerna :c:func:`PyImport_Import` och :c:func:`PyImport_ImportModule` använder nu som standard absolut import, inte relativ import. Detta kommer att påverka C-tillägg som importerar andra moduler.

source: C API: extension data types that shouldn't be hashable should define their ``tp_hash`` slot to :c:func:`PyObject_HashNotImplemented`.
sv: C API: Tilläggsdatatyper som inte bör vara hashbara bör definiera sin ``tp_hash``-plats till :c:func:`PyObject_HashNotImplemented`.

source: The :mod:`socket` module exception :exc:`socket.error` now inherits from :exc:`IOError`. Previously it wasn't a subclass of :exc:`StandardError` but now it is, through :exc:`IOError`. (Implemented by Gregory P. Smith; :issue:`1706815`.)
sv: Modulundantaget :mod:`socket` :exc:`socket.error` ärver nu från :exc:`IOError`. Tidigare var det inte en underklass till :exc:`StandardError` men nu är det det, genom :exc:`IOError`. (Implementerat av Gregory P. Smith; :issue:`1706815`.)
