Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: Directories and zip archives containing a :file:`__main__.py` file can now be executed directly by passing their name to the interpreter. The directory or zip archive is automatically inserted as the first entry in sys.path. (Suggestion and initial patch by Andy Chu, subsequently revised by Phillip J. Eby and Nick Coghlan; :issue:`1739468`.)
sv: Kataloger och zip-arkiv som innehåller en :file:`__main__.py`-fil kan nu exekveras direkt genom att deras namn anges till tolken. Katalogen eller zip-arkivet infogas automatiskt som den första posten i sys.path. (Förslag och inledande patch av Andy Chu, därefter reviderad av Phillip J. Eby och Nick Coghlan; :issue:`1739468`.)

source: The :func:`hasattr` function was catching and ignoring all errors, under the assumption that they meant a :meth:`__getattr__` method was failing somehow and the return value of :func:`hasattr` would therefore be ``False``. This logic shouldn't be applied to :exc:`KeyboardInterrupt` and :exc:`SystemExit`, however; Python 2.6 will no longer discard such exceptions when :func:`hasattr` encounters them. (Fixed by Benjamin Peterson; :issue:`2196`.)
sv: Funktionen :func:`hasattr` fångade upp och ignorerade alla fel, under antagandet att de betydde att en :meth:`__getattr__`-metod misslyckades på något sätt och att returvärdet för :func:`hasattr` därför skulle vara ``False``. Denna logik bör dock inte tillämpas på :exc:`KeyboardInterrupt` och :exc:`SystemExit`; Python 2.6 kommer inte längre att kassera sådana undantag när :func:`hasattr` stöter på dem. (Rättad av Benjamin Peterson; :issue:`2196`.)

source: When calling a function using the ``**`` syntax to provide keyword arguments, you are no longer required to use a Python dictionary; any mapping will now work::
sv: När du anropar en funktion som använder ``**``-syntaxen för att ange nyckelordsargument behöver du inte längre använda en Python-ordbok; vilken mappning som helst fungerar nu::

source: >>> def f(**kw): ... print sorted(kw) ... >>> ud=UserDict.UserDict() >>> ud['a'] = 1 >>> ud['b'] = 'string' >>> f(**ud) ['a', 'b']
sv: >>> def f(**kw): ... print sorterad(kw) ... >>> ud=UserDict.UserDict() >>> ud['a'] = 1 >>> ud['b'] = 'sträng' >>> f(**ud) ['a', 'b']

source: (Contributed by Alexander Belopolsky; :issue:`1686487`.)
sv: (Bidrag från Alexander Belopolsky; :issue:`1686487`.)

source: It's also become legal to provide keyword arguments after a ``*args`` argument to a function call. ::
sv: Det har också blivit lagligt att ange nyckelordsargument efter ett ``*args``-argument i ett funktionsanrop:

source: >>> def f(*args, **kw): ... print args, kw ... >>> f(1,2,3, *(4,5,6), keyword=13) (1, 2, 3, 4, 5, 6) {'keyword': 13}
sv: >>> def f(*args, **kw): ... print args, kw ... >>> f(1,2,3, *(4,5,6), nyckelord=13) (1, 2, 3, 4, 5, 6) {'nyckelord': 13}

source: Previously this would have been a syntax error. (Contributed by Amaury Forgeot d'Arc; :issue:`3473`.)
sv: Tidigare skulle detta ha varit ett syntaxfel. (Bidrag från Amaury Forgeot d'Arc; :issue:`3473`.)

source: A new builtin, ``next(iterator, [default])`` returns the next item from the specified iterator. If the *default* argument is supplied, it will be returned if *iterator* has been exhausted; otherwise, the :exc:`StopIteration` exception will be raised. (Backported in :issue:`2719`.)
sv: En ny inbyggd funktion, ``next(iterator, [default])`` returnerar nästa objekt från den angivna iteratorn. Om argumentet *default* anges, kommer det att returneras om *iterator* har uttömts; annars kommer :exc:`StopIteration` undantaget att uppstå. (Återinförd i :issue:`2719`.)

source: Tuples now have :meth:`index` and :meth:`count` methods matching the list type's :meth:`index` and :meth:`count` methods::
sv: Tuples har nu metoderna :meth:`index` och :meth:`count` som matchar listtypens metoder :meth:`index` och :meth:`count`::

source: (Contributed by Raymond Hettinger)
sv: (Bidrag från Raymond Hettinger)

source: The built-in types now have improved support for extended slicing syntax, accepting various combinations of ``(start, stop, step)``. Previously, the support was partial and certain corner cases wouldn't work. (Implemented by Thomas Wouters.)
sv: De inbyggda typerna har nu förbättrat stöd för utökad slicing-syntax och accepterar olika kombinationer av ``(start, stop, step)``. Tidigare var stödet partiellt och vissa hörnfall fungerade inte. (Implementerat av Thomas Wouters.)

source: Properties now have three attributes, :attr:`getter`, :attr:`setter` and :attr:`deleter`, that are decorators providing useful shortcuts for adding a getter, setter or deleter function to an existing property. You would use them like this::
sv: Egenskaper har nu tre attribut, :attr:`getter`, :attr:`setter` och :attr:`deleter`, som är dekoratorer som ger användbara genvägar för att lägga till en getter-, setter- eller deleter-funktion till en befintlig egenskap. Du kan använda dem så här::

source: class C(object): @property def x(self): return self._x @x.setter def x(self, value): self._x = value @x.deleter def x(self): del self._x class D(C): @C.x.getter def x(self): return self._x * 2 @x.setter def x(self, value): self._x = value / 2
sv: klass C(objekt): @egenskap def x(self): return self._x @x.inställare def x(self, värde): self._x = värde @x.borttagare def x(self): del self._x klass D(C): @C.x.getter def x(self): returnerar self._x * 2 @x.inställare def x(self, värde): self._x = värde / 2

source: Several methods of the built-in set types now accept multiple iterables: :meth:`intersection`, :meth:`intersection_update`, :meth:`union`, :meth:`update`, :meth:`difference` and :meth:`difference_update`.
sv: Flera metoder för de inbyggda set-typerna accepterar nu flera iterabler: :meth:`intersection`, :meth:`intersection_update`, :meth:`union`, :meth:`update`, :meth:`difference` och :meth:`difference_update`.

source: >>> s=set('1234567890') >>> s.intersection('abc123', 'cdf246') # Intersection between all inputs set(['2']) >>> s.difference('246', '789') set(['1', '0', '3', '5'])
sv: >>> s=set('1234567890') >>> s.intersection('abc123', 'cdf246') # Intersektion mellan alla ingångar set(['2']) >>> s.skillnad('246', '789') set(['1', '0', '3', '5'])

source: (Contributed by Raymond Hettinger.)
sv: (Bidrag från Raymond Hettinger.)

source: Many floating-point features were added. The :func:`float` function will now turn the string ``nan`` into an IEEE 754 Not A Number value, and ``+inf`` and ``-inf`` into positive or negative infinity. This works on any platform with IEEE 754 semantics. (Contributed by Christian Heimes; :issue:`1635`.)
sv: Många funktioner för flyttal har lagts till. Funktionen :func:`float` förvandlar nu strängen ``nan`` till ett IEEE 754 Not A Number-värde, och ``+inf`` och ``-inf`` till positiv eller negativ oändlighet. Detta fungerar på alla plattformar med IEEE 754-semantik. (Bidrag från Christian Heimes; :issue:`1635`.)

source: Other functions in the :mod:`math` module, :func:`isinf` and :func:`isnan`, return true if their floating-point argument is infinite or Not A Number. (:issue:`1640`)
sv: Andra funktioner i modulen :mod:`math`, :func:`isinf` och :func:`isnan`, returnerar true om deras flyttalsargument är oändligt eller Not A Number. (:issue:`1640`)

source: Conversion functions were added to convert floating-point numbers into hexadecimal strings (:issue:`3008`). These functions convert floats to and from a string representation without introducing rounding errors from the conversion between decimal and binary. Floats have a :meth:`hex` method that returns a string representation, and the ``float.fromhex()`` method converts a string back into a number::
sv: Konverteringsfunktioner har lagts till för att konvertera flyttal till hexadecimala strängar (:issue:`3008`). Dessa funktioner konverterar flyttal till och från en strängrepresentation utan att införa avrundningsfel från konverteringen mellan decimal och binär. Floats har en :meth:`hex`-metod som returnerar en strängrepresentation, och metoden ``float.fromhex()`` konverterar en sträng tillbaka till ett tal::

source: A numerical nicety: when creating a complex number from two floats on systems that support signed zeros (-0 and +0), the :func:`complex` constructor will now preserve the sign of the zero. (Fixed by Mark T. Dickinson; :issue:`1507`.)
sv: En numerisk finess: när man skapar ett komplext tal från två flyttal på system som stöder signerade nollor (-0 och +0), kommer :func:`complex`-konstruktören nu att bevara tecknet på nollan. (Rättad av Mark T. Dickinson; :issue:`1507`.)

source: Classes that inherit a :meth:`__hash__` method from a parent class can set ``__hash__ = None`` to indicate that the class isn't hashable. This will make ``hash(obj)`` raise a :exc:`TypeError` and the class will not be indicated as implementing the :class:`Hashable` ABC.
sv: Klasser som ärver en :meth:`__hash__`-metod från en överordnad klass kan sätta ``__hash__ = None`` för att ange att klassen inte är hashbar. Detta kommer att göra att ``hash(obj)`` ger upphov till ett :exc:`TypeError` och klassen kommer inte att anges som implementerande av :class:`Hashable` ABC.

source: You should do this when you've defined a :meth:`__cmp__` or :meth:`__eq__` method that compares objects by their value rather than by identity. All objects have a default hash method that uses ``id(obj)`` as the hash value. There's no tidy way to remove the :meth:`__hash__` method inherited from a parent class, so assigning ``None`` was implemented as an override. At the C level, extensions can set ``tp_hash`` to :c:func:`PyObject_HashNotImplemented`. (Fixed by Nick Coghlan and Amaury Forgeot d'Arc; :issue:`2235`.)
sv: Du bör göra detta när du har definierat en :meth:`__cmp__`- eller :meth:`__eq__`-metod som jämför objekt med deras värde snarare än med identitet. Alla objekt har en standardhashmetod som använder ``id(obj)`` som hashvärde. Det finns inget snyggt sätt att ta bort :meth:`__hash__`-metoden som ärvts från en överordnad klass, så att tilldela ``None`` implementerades som en åsidosättning. På C-nivå kan tillägg ställa in ``tp_hash`` till :c:func:`PyObject_HashNotImplemented`. (Rättad av Nick Coghlan och Amaury Forgeot d'Arc; :issue:`2235`.)

source: The :exc:`GeneratorExit` exception now subclasses :exc:`BaseException` instead of :exc:`Exception`. This means that an exception handler that does ``except Exception:`` will not inadvertently catch :exc:`GeneratorExit`. (Contributed by Chad Austin; :issue:`1537`.)
sv: Undantaget :exc:`GeneratorExit` subklassar nu :exc:`BaseException` istället för :exc:`Exception`. Detta innebär att en undantagshanterare som gör ``except Exception:`` inte oavsiktligt kommer att fånga :exc:`GeneratorExit`. (Bidrag från Chad Austin; :issue:`1537`.)

source: Generator objects now have a :attr:`gi_code` attribute that refers to the original code object backing the generator. (Contributed by Collin Winter; :issue:`1473257`.)
sv: Generatorobjekt har nu ett :attr:`gi_code`-attribut som hänvisar till det ursprungliga kodobjektet som backar upp generatorn. (Bidrag från Collin Winter; :issue:`1473257`.)

source: The :func:`compile` built-in function now accepts keyword arguments as well as positional parameters. (Contributed by Thomas Wouters; :issue:`1444529`.)
sv: Den inbyggda funktionen :func:`compile` accepterar nu nyckelordsargument såväl som positionella parametrar. (Bidrag från Thomas Wouters; :issue:`1444529`.)

source: The :func:`complex` constructor now accepts strings containing parenthesized complex numbers, meaning that ``complex(repr(cplx))`` will now round-trip values. For example, ``complex('(3+4j)')`` now returns the value (3+4j). (:issue:`1491866`)
sv: Konstruktorn :func:`complex` accepterar nu strängar som innehåller komplexa tal inom parentes, vilket innebär att ``complex(repr(cplx))`` nu avrundar värden. Till exempel, ``complex('(3+4j)')`` returnerar nu värdet (3+4j). (:issue:`1491866`)

source: The string :meth:`translate` method now accepts ``None`` as the translation table parameter, which is treated as the identity transformation. This makes it easier to carry out operations that only delete characters. (Contributed by Bengt Richter and implemented by Raymond Hettinger; :issue:`1193128`.)
sv: Metoden string :meth:`translate` accepterar nu ``None`` som parameter för översättningstabellen, som behandlas som en identitetstransformation. Detta gör det enklare att utföra operationer som bara tar bort tecken. (Bidrag från Bengt Richter och implementerat av Raymond Hettinger; :issue:`1193128`.)

source: The built-in :func:`dir` function now checks for a :meth:`__dir__` method on the objects it receives. This method must return a list of strings containing the names of valid attributes for the object, and lets the object control the value that :func:`dir` produces. Objects that have :meth:`__getattr__` or :meth:`__getattribute__` methods can use this to advertise pseudo-attributes they will honor. (:issue:`1591665`)
sv: Den inbyggda funktionen :func:`dir` kontrollerar nu om det finns en metod :meth:`__dir__` i de objekt som den tar emot. Denna metod måste returnera en lista med strängar som innehåller namnen på giltiga attribut för objektet, och låter objektet styra det värde som :func:`dir` producerar. Objekt som har :meth:`__getattr__` eller :meth:`__getattribute__` metoder kan använda detta för att annonsera pseudoattribut som de kommer att respektera. (:issue:`1591665`)

source: Instance method objects have new attributes for the object and function comprising the method; the new synonym for :attr:`!im_self` is :attr:`~method.__self__`, and :attr:`!im_func` is also available as :attr:`~method.__func__`. The old names are still supported in Python 2.6, but are gone in 3.0.
sv: Instansmetodobjekt har nya attribut för det objekt och den funktion som utgör metoden; den nya synonymen för :attr:`!im_self` är :attr:`~method.__self__`, och :attr:`!im_func` finns också som :attr:`~method.__func__`. De gamla namnen stöds fortfarande i Python 2.6, men är borta i 3.0.

source: An obscure change: when you use the :func:`locals` function inside a :keyword:`class` statement, the resulting dictionary no longer returns free variables. (Free variables, in this case, are variables referenced in the :keyword:`!class` statement that aren't attributes of the class.)
sv: En obskyr förändring: när du använder funktionen :func:`locals` i en :keyword:`class`-sats returnerar den resulterande ordlistan inte längre fria variabler. (Fria variabler är i det här fallet variabler som refereras till i :keyword:`!class`-satsen och som inte är attribut till klassen)

source: Optimizations
sv: Optimeringar

source: The :mod:`warnings` module has been rewritten in C. This makes it possible to invoke warnings from the parser, and may also make the interpreter's startup faster. (Contributed by Neal Norwitz and Brett Cannon; :issue:`1631171`.)
sv: Modulen :mod:`warnings` har skrivits om till C. Detta gör det möjligt att anropa varningar från parsern, och kan också göra tolkens uppstart snabbare. (Bidrag från Neal Norwitz och Brett Cannon; :issue:`1631171`.)

source: Type objects now have a cache of methods that can reduce the work required to find the correct method implementation for a particular class; once cached, the interpreter doesn't need to traverse base classes to figure out the right method to call. The cache is cleared if a base class or the class itself is modified, so the cache should remain correct even in the face of Python's dynamic nature. (Original optimization implemented by Armin Rigo, updated for Python 2.6 by Kevin Jacobs; :issue:`1700288`.)
sv: Typobjekt har nu en cache av metoder som kan minska det arbete som krävs för att hitta rätt metodimplementering för en viss klass; när den väl är cachad behöver tolken inte korsa basklasser för att ta reda på rätt metod att anropa. Cachen rensas om en basklass eller klassen i sig ändras, så cachen bör förbli korrekt även med tanke på Pythons dynamiska natur. (Originaloptimering implementerad av Armin Rigo, uppdaterad för Python 2.6 av Kevin Jacobs; :issue:`1700288`.)

source: By default, this change is only applied to types that are included with the Python core. Extension modules may not necessarily be compatible with this cache, so they must explicitly add :c:macro:`Py_TPFLAGS_HAVE_VERSION_TAG` to the module's ``tp_flags`` field to enable the method cache. (To be compatible with the method cache, the extension module's code must not directly access and modify the ``tp_dict`` member of any of the types it implements. Most modules don't do this, but it's impossible for the Python interpreter to determine that. See :issue:`1878` for some discussion.)
sv: Som standard tillämpas denna ändring endast på typer som ingår i Python-kärnan. Tilläggsmoduler är inte nödvändigtvis kompatibla med denna cache, så de måste uttryckligen lägga till :c:macro:`Py_TPFLAGS_HAVE_VERSION_TAG` i modulens ``tp_flags``-fält för att aktivera metodcachen. (För att vara kompatibel med metodcachen får tilläggsmodulens kod inte direkt komma åt och modifiera ``tp_dict``-medlemmen i någon av de typer som den implementerar. De flesta moduler gör inte detta, men det är omöjligt för Python-tolken att avgöra det. Se :issue:`1878` för en diskussion)

source: Function calls that use keyword arguments are significantly faster by doing a quick pointer comparison, usually saving the time of a full string comparison. (Contributed by Raymond Hettinger, after an initial implementation by Antoine Pitrou; :issue:`1819`.)
sv: Funktionsanrop som använder nyckelordsargument är betydligt snabbare genom att göra en snabb pekarjämförelse, vilket vanligtvis sparar tid jämfört med en fullständig strängjämförelse. (Bidrag från Raymond Hettinger, efter en första implementering av Antoine Pitrou; :issue:`1819`.)

source: All of the functions in the :mod:`struct` module have been rewritten in C, thanks to work at the Need For Speed sprint. (Contributed by Raymond Hettinger.)
sv: Alla funktioner i modulen :mod:`struct` har skrivits om till C, tack vare arbetet med Need For Speed-sprinten. (Bidrag från Raymond Hettinger.)

source: Some of the standard built-in types now set a bit in their type objects. This speeds up checking whether an object is a subclass of one of these types. (Contributed by Neal Norwitz.)
sv: Vissa av de inbyggda standardtyperna anger nu en bit i sina typobjekt. Detta påskyndar kontrollen av om ett objekt är en underklass av en av dessa typer. (Bidrag från Neal Norwitz.)

source: Unicode strings now use faster code for detecting whitespace and line breaks; this speeds up the :meth:`split` method by about 25% and :meth:`splitlines` by 35%. (Contributed by Antoine Pitrou.) Memory usage is reduced by using pymalloc for the Unicode string's data.
sv: Unicode-strängar använder nu snabbare kod för att upptäcka blanksteg och radbrytningar; detta snabbar upp :meth:`split`-metoden med cirka 25% aoch :meth:`splitlines` med 35%. (Bidrag från Antoine Pitrou.) Minnesanvändningen minskas genom att pymalloc används för Unicode-strängens data.

source: The ``with`` statement now stores the :meth:`~object.__exit__` method on the stack, producing a small speedup. (Implemented by Jeffrey Yasskin.)
sv: ``with``-satsen lagrar nu :meth:`~object.__exit__`-metoden på stacken, vilket ger en liten hastighetsökning. (Implementerat av Jeffrey Yasskin.)

source: To reduce memory usage, the garbage collector will now clear internal free lists when garbage-collecting the highest generation of objects. This may return memory to the operating system sooner.
sv: För att minska minnesanvändningen rensar skräpsamlaren nu interna lediga listor när den högsta generationen av objekt samlas in. Detta kan göra att minnet återlämnas till operativsystemet tidigare.

source: Interpreter Changes
sv: Förändringar av tolk

source: Two command-line options have been reserved for use by other Python implementations. The :option:`!-J` switch has been reserved for use by Jython for Jython-specific options, such as switches that are passed to the underlying JVM. :option:`-X` has been reserved for options specific to a particular implementation of Python such as CPython, Jython, or IronPython. If either option is used with Python 2.6, the interpreter will report that the option isn't currently used.
sv: Två kommandoradsalternativ har reserverats för användning av andra Python-implementationer. Växeln :option:`!-J` har reserverats för användning av Jython för Jython-specifika alternativ, till exempel växlar som skickas till den underliggande JVM:n. :option:`-X` har reserverats för alternativ som är specifika för en viss implementering av Python, till exempel CPython, Jython eller IronPython. Om något av alternativen används med Python 2.6 kommer tolken att rapportera att alternativet inte används för närvarande.

source: Python can now be prevented from writing :file:`.pyc` or :file:`.pyo` files by supplying the :option:`-B` switch to the Python interpreter, or by setting the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable before running the interpreter. This setting is available to Python programs as the ``sys.dont_write_bytecode`` variable, and Python code can change the value to modify the interpreter's behaviour. (Contributed by Neal Norwitz and Georg Brandl.)
sv: Python kan nu förhindras från att skriva :file:`.pyc` eller :file:`.pyo`-filer genom att ange :option:`-B` till Python-tolken, eller genom att ställa in miljövariabeln :envvar:`PYTHONDONTONTWRITEBYTECODE` innan tolken körs. Denna inställning är tillgänglig för Python-program som variabeln ``sys.dont_write_bytecode``, och Python-kod kan ändra värdet för att modifiera tolkens beteende. (Bidrag från Neal Norwitz och Georg Brandl.)

source: The encoding used for standard input, output, and standard error can be specified by setting the :envvar:`PYTHONIOENCODING` environment variable before running the interpreter. The value should be a string in the form ``<encoding>`` or ``<encoding>:<errorhandler>``. The *encoding* part specifies the encoding's name, e.g. ``utf-8`` or ``latin-1``; the optional *errorhandler* part specifies what to do with characters that can't be handled by the encoding, and should be one of "error", "ignore", or "replace". (Contributed by Martin von Löwis.)
sv: Kodningen som används för standardinmatning, -utmatning och standardfel kan specificeras genom att ställa in miljövariabeln :envvar:`PYTHONIOENCODING` innan tolken körs. Värdet bör vara en sträng i formen ``<encoding>`` eller ``<encoding>:<errorhandler>``. Delen *encoding* anger kodningens namn, t.ex. ``utf-8`` eller ``latin-1``; den valfria delen *errorhandler* anger vad som ska göras med tecken som inte kan hanteras av kodningen, och bör vara en av "error", "ignore" eller "replace". (Bidrag från Martin von Löwis.)

source: New and Improved Modules
sv: Nya och förbättrade moduler

source: As in every release, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the Subversion logs for all the details.
sv: Som i varje release fick Pythons standardbibliotek ett antal förbättringar och buggfixar. Här är en partiell lista över de mest anmärkningsvärda ändringarna, sorterade alfabetiskt efter modulnamn. Se filen :file:`Misc/NEWS` i källträdet för en mer komplett lista över ändringar, eller titta igenom Subversion-loggarna för alla detaljer.
