Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: :func:`~math.log1p` returns the natural logarithm of *1+x* (base *e*).
sv: :func:`~math.log1p` returnerar den naturliga logaritmen av *1+x* (bas *e*).

source: :func:`trunc` rounds a number toward zero, returning the closest :class:`Integral` that's between the function's argument and zero. Added as part of the backport of `PEP 3141's type hierarchy for numbers <#pep-3141>`__.
sv: :func:`trunc` avrundar ett tal mot noll och returnerar den närmaste :class:`Integral` som ligger mellan funktionens argument och noll. Tillagd som en del av bakporten av `PEP 3141:s typhierarki för tal <#pep-3141>`__.

source: The :mod:`math` module has been improved to give more consistent behaviour across platforms, especially with respect to handling of floating-point exceptions and IEEE 754 special values.
sv: Modulen :mod:`math` har förbättrats för att ge ett mer konsekvent beteende på olika plattformar, särskilt när det gäller hantering av undantag för flyttal och specialvärden enligt IEEE 754.

source: Whenever possible, the module follows the recommendations of the C99 standard about 754's special values. For example, ``sqrt(-1.)`` should now give a :exc:`ValueError` across almost all platforms, while ``sqrt(float('NaN'))`` should return a NaN on all IEEE 754 platforms. Where Annex 'F' of the C99 standard recommends signaling 'divide-by-zero' or 'invalid', Python will raise :exc:`ValueError`. Where Annex 'F' of the C99 standard recommends signaling 'overflow', Python will raise :exc:`OverflowError`. (See :issue:`711019` and :issue:`1640`.)
sv: När så är möjligt följer modulen rekommendationerna i C99-standarden om 754:s specialvärden. Till exempel bör ``sqrt(-1.)`` nu ge ett :exc:`ValueError` på nästan alla plattformar, medan ``sqrt(float('NaN'))`` bör returnera ett NaN på alla IEEE 754-plattformar. Där bilaga 'F' i C99-standarden rekommenderar att signalera 'divide-by-zero' eller 'invalid', kommer Python att ge :exc:`ValueError`. Där bilaga 'F' i C99-standarden rekommenderar att signalera 'overflow', kommer Python att ge :exc:`OverflowError`. (Se :issue:`711019` och :issue:`1640`.)

source: (Contributed by Christian Heimes and Mark Dickinson.)
sv: (Bidrag från Christian Heimes och Mark Dickinson.)

source: :class:`~mmap.mmap` objects now have a :meth:`rfind` method that searches for a substring beginning at the end of the string and searching backwards. The :meth:`find` method also gained an *end* parameter giving an index at which to stop searching. (Contributed by John Lenton.)
sv: :class:`~mmap.mmap`-objekt har nu en :meth:`rfind`-metod som söker efter en delsträng med början i slutet av strängen och bakåt. Metoden :meth:`find` har också fått en *end*-parameter som anger ett index vid vilket sökningen ska avslutas. (Bidrag från John Lenton.)

source: The :mod:`operator` module gained a :func:`methodcaller` function that takes a name and an optional set of arguments, returning a callable that will call the named function on any arguments passed to it. For example::
sv: Modulen :mod:`operator` fick en :func:`methodcaller`-funktion som tar ett namn och en valfri uppsättning argument och returnerar en anropbar funktion som anropar den namngivna funktionen med alla argument som skickas till den. Till exempel::

source: >>> # Equivalent to lambda s: s.replace('old', 'new') >>> replacer = operator.methodcaller('replace', 'old', 'new') >>> replacer('old wine in old bottles') 'new wine in new bottles'
sv: >>> # Motsvarar lambda s: s.replace('old', 'new') >>> replacer = operator.methodcaller('replace', 'old', 'new') >>> replacer('gammalt vin i gamla flaskor') 'nytt vin i nya flaskor'

source: (Contributed by Georg Brandl, after a suggestion by Gregory Petrosyan.)
sv: (Bidrag från Georg Brandl, efter ett förslag från Gregory Petrosyan.)

source: The :func:`attrgetter` function now accepts dotted names and performs the corresponding attribute lookups::
sv: Funktionen :func:`attrgetter` accepterar nu prickade namn och utför motsvarande attributuppslagningar::

source: >>> inst_name = operator.attrgetter( ... '__class__.__name__') >>> inst_name('') 'str' >>> inst_name(help) '_Helper'
sv: >>> inst_name = operator.attrgetter( ... '__class__.__name__') >>> inst_name('') 'str' >>> inst_name(hjälp) '_Hjälpare'

source: (Contributed by Georg Brandl, after a suggestion by Barry Warsaw.)
sv: (Bidrag från Georg Brandl, efter ett förslag från Barry Warsaw.)

source: The :mod:`os` module now wraps several new system calls. ``fchmod(fd, mode)`` and ``fchown(fd, uid, gid)`` change the mode and ownership of an opened file, and ``lchmod(path, mode)`` changes the mode of a symlink. (Contributed by Georg Brandl and Christian Heimes.)
sv: Modulen :mod:`os` omsluter nu flera nya systemanrop. ``fchmod(fd, mode)`` och ``fchown(fd, uid, gid)`` ändrar läge och ägandeskap för en öppnad fil, och ``lchmod(path, mode)`` ändrar läget för en symlänk. (Bidrag från Georg Brandl och Christian Heimes.)

source: :func:`chflags` and :func:`lchflags` are wrappers for the corresponding system calls (where they're available), changing the flags set on a file. Constants for the flag values are defined in the :mod:`stat` module; some possible values include :const:`UF_IMMUTABLE` to signal the file may not be changed and :const:`UF_APPEND` to indicate that data can only be appended to the file. (Contributed by M. Levinson.)
sv: :func:`chflags` och :func:`lchflags` är omslag för motsvarande systemanrop (där de är tillgängliga), som ändrar flaggvärdena för en fil. Konstanter för flaggvärdena definieras i modulen :mod:`stat`; några möjliga värden inkluderar :const:`UF_IMMUTABLE` för att signalera att filen inte får ändras och :const:`UF_APPEND` för att indikera att data endast kan läggas till i filen. (Bidrag från M. Levinson.)

source: ``os.closerange(low, high)`` efficiently closes all file descriptors from *low* to *high*, ignoring any errors and not including *high* itself. This function is now used by the :mod:`subprocess` module to make starting processes faster. (Contributed by Georg Brandl; :issue:`1663329`.)
sv: ``os.closerange(low, high)``` stänger effektivt alla filbeskrivare från *low* till *high*, ignorerar eventuella fel och inkluderar inte *high* själv. Den här funktionen används nu av modulen :mod:`subprocess` för att göra det snabbare att starta processer. (Bidrag från Georg Brandl; :issue:`1663329`.)

source: The ``os.environ`` object's :meth:`clear` method will now unset the environment variables using :func:`os.unsetenv` in addition to clearing the object's keys. (Contributed by Martin Horcicka; :issue:`1181`.)
sv: Objektet ``os.environ``:s :meth:`clear`-metod kommer nu att återställa miljövariablerna med :func:`os.unsetenv` förutom att rensa objektets nycklar. (Bidrag från Martin Horcicka; :issue:`1181`.)

source: The :func:`os.walk` function now has a ``followlinks`` parameter. If set to True, it will follow symlinks pointing to directories and visit the directory's contents. For backward compatibility, the parameter's default value is false. Note that the function can fall into an infinite recursion if there's a symlink that points to a parent directory. (:issue:`1273829`)
sv: Funktionen :func:`os.walk` har nu en parameter för ``followlinks``. Om den är satt till True kommer den att följa symlinks som pekar på kataloger och besöka katalogens innehåll. För bakåtkompatibilitet är parameterns standardvärde false. Observera att funktionen kan hamna i en oändlig rekursion om det finns en symbollänk som pekar på en överordnad katalog. (:issue:`1273829`)

source: In the :mod:`os.path` module, the :func:`splitext` function has been changed to not split on leading period characters. This produces better results when operating on Unix's dot-files. For example, ``os.path.splitext('.ipython')`` now returns ``('.ipython', '')`` instead of ``('', '.ipython')``. (:issue:`1115886`)
sv: I modulen :mod:`os.path` har funktionen :func:`splitext` ändrats så att den inte delar upp inledande punkttecken. Detta ger bättre resultat vid användning av Unix punktfiler. Till exempel returnerar ```os.path.splitext('.ipython')`` nu ``('.ipython', '')`` istället för ``('', '.ipython')``. (:issue:`1115886`)

source: A new function, ``os.path.relpath(path, start='.')``, returns a relative path from the ``start`` path, if it's supplied, or from the current working directory to the destination ``path``. (Contributed by Richard Barran; :issue:`1339796`.)
sv: En ny funktion, ``os.path.relpath(path, start='.')``, returnerar en relativ sökväg från ``start``-sökvägen, om den anges, eller från den aktuella arbetskatalogen till målet ``path``. (Bidrag från Richard Barran; :issue:`1339796`.)

source: On Windows, :func:`os.path.expandvars` will now expand environment variables given in the form "%var%", and "~user" will be expanded into the user's home directory path. (Contributed by Josiah Carlson; :issue:`957650`.)
sv: I Windows kommer :func:`os.path.expandvars` nu att expandera miljövariabler som anges i formen "%var%", och "~user" kommer att expanderas till användarens sökväg till hemkatalogen. (Bidrag från Josiah Carlson; :issue:`957650`.)

source: The Python debugger provided by the :mod:`pdb` module gained a new command: "run" restarts the Python program being debugged and can optionally take new command-line arguments for the program. (Contributed by Rocky Bernstein; :issue:`1393667`.)
sv: Python-felsökaren som tillhandahålls av modulen :mod:`pdb` har fått ett nytt kommando: "run" startar om Python-programmet som felsöks och kan eventuellt ta emot nya kommandoradsargument för programmet. (Bidrag från Rocky Bernstein; :issue:`1393667`.)

source: The :func:`pdb.post_mortem` function, used to begin debugging a traceback, will now use the traceback returned by :func:`sys.exc_info` if no traceback is supplied. (Contributed by Facundo Batista; :issue:`1106316`.)
sv: Funktionen :func:`pdb.post_mortem`, som används för att påbörja felsökning av en spårning, kommer nu att använda den spårning som returneras av :func:`sys.exc_info` om ingen spårning anges. (Bidrag från Facundo Batista; :issue:`1106316`.)

source: The :mod:`pickletools` module now has an :func:`optimize` function that takes a string containing a pickle and removes some unused opcodes, returning a shorter pickle that contains the same data structure. (Contributed by Raymond Hettinger.)
sv: Modulen :mod:`pickletools` har nu en :func:`optimize`-funktion som tar en sträng som innehåller en pickle och tar bort några oanvända opkoder, vilket returnerar en kortare pickle som innehåller samma datastruktur. (Bidrag från Raymond Hettinger.)

source: A :func:`get_data` function was added to the :mod:`pkgutil` module that returns the contents of resource files included with an installed Python package. For example::
sv: En :func:`get_data`-funktion har lagts till i :mod:`pkgutil`-modulen som returnerar innehållet i resursfiler som ingår i ett installerat Python-paket. Till exempel::

source: >>> import pkgutil >>> print pkgutil.get_data('test', 'exception_hierarchy.txt') BaseException +-- SystemExit +-- KeyboardInterrupt +-- GeneratorExit +-- Exception +-- StopIteration +-- StandardError ...
sv: >>> import pkgutil >>> print pkgutil.get_data('test', 'exception_hierarchy.txt') BaseException +-- Systemavslut +-- KeyboardInterrupt +-- GeneratorExit +-- Undantag +-- StoppIteration +-- Standardfel ...

source: (Contributed by Paul Moore; :issue:`2439`.)
sv: (Bidrag från Paul Moore; :issue:`2439`.)

source: The :mod:`pyexpat` module's :class:`Parser` objects now allow setting their :attr:`buffer_size` attribute to change the size of the buffer used to hold character data. (Contributed by Achim Gaedke; :issue:`1137`.)
sv: :mod:`pyexpat`-modulens :class:`Parser`-objekt tillåter nu att man ställer in deras :attr:`buffer_size`-attribut för att ändra storleken på den buffert som används för att hålla teckendata. (Bidrag från Achim Gaedke; :issue:`1137`.)

source: The :mod:`Queue` module now provides queue variants that retrieve entries in different orders. The :class:`PriorityQueue` class stores queued items in a heap and retrieves them in priority order, and :class:`LifoQueue` retrieves the most recently added entries first, meaning that it behaves like a stack. (Contributed by Raymond Hettinger.)
sv: Modulen :mod:`Queue` tillhandahåller nu kövarianter som hämtar poster i olika ordning. Klassen :class:`PriorityQueue` lagrar köade objekt i en hög och hämtar dem i prioritetsordning, och :class:`LifoQueue` hämtar de senast tillagda objekten först, vilket innebär att den beter sig som en stack. (Bidrag från Raymond Hettinger.)

source: The :mod:`random` module's :class:`Random` objects can now be pickled on a 32-bit system and unpickled on a 64-bit system, and vice versa. Unfortunately, this change also means that Python 2.6's :class:`Random` objects can't be unpickled correctly on earlier versions of Python. (Contributed by Shawn Ligocki; :issue:`1727780`.)
sv: Modulen :mod:`random`:s :class:`Random`-objekt kan nu picklas på ett 32-bitars system och unpicklas på ett 64-bitars system, och vice versa. Tyvärr innebär denna förändring också att Python 2.6:s :class:`Random`-objekt inte kan avpicklas korrekt på tidigare versioner av Python. (Bidrag från Shawn Ligocki; :issue:`1727780`.)

source: The new ``triangular(low, high, mode)`` function returns random numbers following a triangular distribution. The returned values are between *low* and *high*, not including *high* itself, and with *mode* as the most frequently occurring value in the distribution. (Contributed by Wladmir van der Laan and Raymond Hettinger; :issue:`1681432`.)
sv: Den nya funktionen ``triangular(low, high, mode)`` returnerar slumpmässiga tal som följer en triangulär fördelning. De returnerade värdena ligger mellan *låg* och *hög*, exklusive *hög* själv, och med *mode* som det mest frekvent förekommande värdet i fördelningen. (Bidrag från Wladmir van der Laan och Raymond Hettinger; :issue:`1681432`.)

source: Long regular expression searches carried out by the :mod:`re` module will check for signals being delivered, so time-consuming searches can now be interrupted. (Contributed by Josh Hoyt and Ralf Schmitt; :issue:`846388`.)
sv: Långa sökningar med reguljära uttryck som utförs av modulen :mod:`re` kommer att kontrollera om signaler levereras, så tidskrävande sökningar kan nu avbrytas. (Bidrag från Josh Hoyt och Ralf Schmitt; :issue:`846388`.)

source: The regular expression module is implemented by compiling bytecodes for a tiny regex-specific virtual machine. Untrusted code could create malicious strings of bytecode directly and cause crashes, so Python 2.6 includes a verifier for the regex bytecode. (Contributed by Guido van Rossum from work for Google App Engine; :issue:`3487`.)
sv: Modulen för reguljära uttryck implementeras genom att kompilera bytekoder för en liten regex-specifik virtuell maskin. Otillförlitlig kod kan skapa skadliga strängar av bytecode direkt och orsaka kraschar, så Python 2.6 innehåller en verifierare för regex-bytecode. (Bidrag från Guido van Rossum från arbetet för Google App Engine; :issue:`3487`.)

source: The :mod:`rlcompleter` module's :meth:`Completer.complete` method will now ignore exceptions triggered while evaluating a name. (Fixed by Lorenz Quack; :issue:`2250`.)
sv: Modulen :mod:`rlcompleter`:s metod :meth:`Completer.complete` ignorerar nu undantag som utlöses när ett namn utvärderas. (Rättad av Lorenz Quack; :issue:`2250`.)

source: The :mod:`sched` module's :class:`scheduler` instances now have a read-only :attr:`queue` attribute that returns the contents of the scheduler's queue, represented as a list of named tuples with the fields ``(time, priority, action, argument)``. (Contributed by Raymond Hettinger; :issue:`1861`.)
sv: :mod:`sched`-modulens :class:`scheduler`-instanser har nu ett skrivskyddat :attr:`queue`-attribut som returnerar innehållet i schemaläggarens kö, representerad som en lista av namngivna tuples med fälten ``(tid, prioritet, åtgärd, argument)``. (Bidrag från Raymond Hettinger; :issue:`1861`.)

source: The :mod:`select` module now has wrapper functions for the Linux :c:func:`!epoll` and BSD :c:func:`!kqueue` system calls. :meth:`modify` method was added to the existing :class:`poll` objects; ``pollobj.modify(fd, eventmask)`` takes a file descriptor or file object and an event mask, modifying the recorded event mask for that file. (Contributed by Christian Heimes; :issue:`1657`.)
sv: Modulen :mod:`select` har nu omslagsfunktioner för systemanropen Linux :c:func:`!epoll` och BSD :c:func:`!kqueue`. Metoden :meth:`modify` lades till i de befintliga objekten :class:`poll`; ``pollobj.modify(fd, eventmask)`` tar en filbeskrivning eller ett filobjekt och en händelsemask och ändrar den inspelade händelsemasken för filen. (Bidrag från Christian Heimes; :issue:`1657`.)

source: The :func:`shutil.copytree` function now has an optional *ignore* argument that takes a callable object. This callable will receive each directory path and a list of the directory's contents, and returns a list of names that will be ignored, not copied.
sv: Funktionen :func:`shutil.copytree` har nu ett valfritt *ignore*-argument som tar ett anropbart objekt. Detta anropsbara objekt tar emot varje katalogsökväg och en lista över katalogens innehåll och returnerar en lista med namn som ignoreras och inte kopieras.

source: The :mod:`shutil` module also provides an :func:`ignore_patterns` function for use with this new parameter. :func:`ignore_patterns` takes an arbitrary number of glob-style patterns and returns a callable that will ignore any files and directories that match any of these patterns. The following example copies a directory tree, but skips both :file:`.svn` directories and Emacs backup files, which have names ending with '~'::
sv: Modulen :mod:`shutil` innehåller också en funktion :func:`ignore_patterns` som kan användas med den här nya parametern. :func:`ignore_patterns` tar ett godtyckligt antal glob-mönster och returnerar en anropbar funktion som ignorerar alla filer och kataloger som matchar något av dessa mönster. Följande exempel kopierar ett katalogträd, men hoppar över både :file:`.svn`-kataloger och Emacs backup-filer, som har namn som slutar med '~'::

source: (Contributed by Tarek Ziadé; :issue:`2663`.)
sv: (Bidrag från Tarek Ziadé; :issue:`2663`.)

source: Integrating signal handling with GUI handling event loops like those used by Tkinter or GTk+ has long been a problem; most software ends up polling, waking up every fraction of a second to check if any GUI events have occurred. The :mod:`signal` module can now make this more efficient. Calling ``signal.set_wakeup_fd(fd)`` sets a file descriptor to be used; when a signal is received, a byte is written to that file descriptor. There's also a C-level function, :c:func:`PySignal_SetWakeupFd`, for setting the descriptor.
sv: Att integrera signalhantering med händelseslingor för GUI-hantering som de som används av Tkinter eller GTk+ har länge varit ett problem; de flesta programvaror slutar med polling, att vakna upp varje bråkdel av en sekund för att kontrollera om några GUI-händelser har inträffat. Modulen :mod:`signal` kan nu göra detta mer effektivt. Genom att anropa ``signal.set_wakeup_fd(fd)`` anges en filbeskrivare som ska användas; när en signal tas emot skrivs en byte till den filbeskrivaren. Det finns också en funktion på C-nivå, :c:func:`PySignal_SetWakeupFd`, för att ställa in descriptorn.

source: Event loops will use this by opening a pipe to create two descriptors, one for reading and one for writing. The writable descriptor will be passed to :func:`set_wakeup_fd`, and the readable descriptor will be added to the list of descriptors monitored by the event loop via :c:func:`!select` or :c:func:`!poll`. On receiving a signal, a byte will be written and the main event loop will be woken up, avoiding the need to poll.
sv: Händelseslingor använder detta genom att öppna en pipe för att skapa två deskriptorer, en för läsning och en för skrivning. Den skrivbara deskriptorn skickas till :func:`set_wakeup_fd`, och den läsbara deskriptorn läggs till i listan över deskriptorer som övervakas av händelseslingan via :c:func:`!select` eller :c:func:`!poll`. När en signal tas emot skrivs en byte och huvudhändelseslingan väcks, vilket gör att pollning inte behövs.

source: (Contributed by Adam Olsen; :issue:`1583`.)
sv: (Bidrag från Adam Olsen; :issue:`1583`.)

source: The :func:`siginterrupt` function is now available from Python code, and allows changing whether signals can interrupt system calls or not. (Contributed by Ralf Schmitt.)
sv: Funktionen :func:`siginterrupt` är nu tillgänglig från Python-kod och gör det möjligt att ändra om signaler kan avbryta systemanrop eller inte. (Bidrag från Ralf Schmitt.)

source: The :func:`setitimer` and :func:`getitimer` functions have also been added (where they're available). :func:`setitimer` allows setting interval timers that will cause a signal to be delivered to the process after a specified time, measured in wall-clock time, consumed process time, or combined process+system time. (Contributed by Guilherme Polo; :issue:`2240`.)
sv: Funktionerna :func:`setitimer` och :func:`getitimer` har också lagts till (där de är tillgängliga). :func:`setitimer` gör det möjligt att ställa in intervalltidtagare som gör att en signal levereras till processen efter en angiven tid, mätt i väggklocktid, förbrukad processtid eller kombinerad process+systemtid. (Bidrag från Guilherme Polo; :issue:`2240`.)

source: The :mod:`smtplib` module now supports SMTP over SSL thanks to the addition of the :class:`SMTP_SSL` class. This class supports an interface identical to the existing :class:`SMTP` class. (Contributed by Monty Taylor.) Both class constructors also have an optional ``timeout`` parameter that specifies a timeout for the initial connection attempt, measured in seconds. (Contributed by Facundo Batista.)
sv: Modulen :mod:`smtplib` har nu stöd för SMTP över SSL tack vare tillägget av klassen :class:`SMTP_SSL`. Denna klass stöder ett gränssnitt som är identiskt med den befintliga :class:`SMTP`-klassen. (Bidrag från Monty Taylor.) Båda klasskonstruktörerna har också en valfri ``timeout``-parameter som anger en timeout för det första anslutningsförsöket, mätt i sekunder. (Bidrag från Facundo Batista.)

source: An implementation of the LMTP protocol (:rfc:`2033`) was also added to the module. LMTP is used in place of SMTP when transferring e-mail between agents that don't manage a mail queue. (LMTP implemented by Leif Hedstrom; :issue:`957003`.)
sv: En implementering av LMTP-protokollet (:rfc:`2033`) har också lagts till i modulen. LMTP används i stället för SMTP vid överföring av e-post mellan agenter som inte hanterar en e-postkö. (LMTP implementerat av Leif Hedström; :issue:`957003`.)

source: :meth:`SMTP.starttls` now complies with :rfc:`3207` and forgets any knowledge obtained from the server not obtained from the TLS negotiation itself. (Patch contributed by Bill Fenner; :issue:`829951`.)
sv: :meth:`SMTP.starttls` följer nu :rfc:`3207` och glömmer all kunskap som erhålls från servern som inte erhålls från själva TLS-förhandlingen. (Patch bidragit av Bill Fenner; :issue:`829951`.)

source: The :mod:`socket` module now supports TIPC (https://tipc.sourceforge.net/), a high-performance non-IP-based protocol designed for use in clustered environments. TIPC addresses are 4- or 5-tuples. (Contributed by Alberto Bertogli; :issue:`1646`.)
sv: Modulen :mod:`socket` har nu stöd för TIPC (https://tipc.sourceforge.net/), ett högpresterande icke-IP-baserat protokoll som är utformat för användning i klustermiljöer. TIPC-adresser är 4- eller 5-tupler. (Bidrag från Alberto Bertogli; :issue:`1646`.)
