Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: The :mod:`xmlrpclib <xmlrpc.client>` module no longer automatically converts :class:`datetime.date` and :class:`datetime.time` to the :class:`xmlrpclib.DateTime <xmlrpc.client.DateTime>` type; the conversion semantics were not necessarily correct for all applications. Code using :mod:`!xmlrpclib` should convert :class:`date` and :class:`~datetime.time` instances. (:issue:`1330538`) The code can also handle dates before 1900 (contributed by Ralf Schmitt; :issue:`2014`) and 64-bit integers represented by using ``<i8>`` in XML-RPC responses (contributed by Riku Lindblad; :issue:`2985`).
sv: Modulen :mod:`xmlrpclib <xmlrpc.client>` konverterar inte längre automatiskt :class:`datetime.date` och :class:`datetime.time` till typen :class:`xmlrpclib.DateTime <xmlrpc.client.DateTime>`; konverteringssemantiken var inte nödvändigtvis korrekt för alla applikationer. Kod som använder :mod:`!xmlrpclib` bör konvertera :class:`date` och :class:`~datetime.time` instanser. (:issue:`1330538`) Koden kan även hantera datum före 1900 (bidrag från Ralf Schmitt; :issue:`2014`) och 64-bitars heltal som representeras genom att använda ``<i8>`` i XML-RPC-svar (bidrag från Riku Lindblad; :issue:`2985`).

source: The :mod:`zipfile` module's :class:`ZipFile` class now has :meth:`extract` and :meth:`extractall` methods that will unpack a single file or all the files in the archive to the current directory, or to a specified directory::
sv: Modulen :mod:`zipfile`'s klass :class:`ZipFile` har nu metoderna :meth:`extract` och :meth:`extractall` som packar upp en enskild fil eller alla filer i arkivet till den aktuella katalogen eller till en angiven katalog::

source: z = zipfile.ZipFile('python-251.zip') # Unpack a single file, writing it relative # to the /tmp directory. z.extract('Python/sysmodule.c', '/tmp') # Unpack all the files in the archive. z.extractall()
sv: z = zipfile.ZipFile('python-251.zip') # Packa upp en enda fil och skriv den relativt # till katalogen /tmp. z.extract('Python/sysmodule.c', '/tmp') # Packa upp alla filer i arkivet. z.extraheraall()

source: (Contributed by Alan McIntyre; :issue:`467924`.)
sv: (Bidrag från Alan McIntyre; :issue:`467924`.)

source: The :meth:`open`, :meth:`read` and :meth:`extract` methods can now take either a filename or a :class:`ZipInfo` object. This is useful when an archive accidentally contains a duplicated filename. (Contributed by Graham Horler; :issue:`1775025`.)
sv: Metoderna :meth:`open`, :meth:`read` och :meth:`extract` kan nu ta emot antingen ett filnamn eller ett :class:`ZipInfo`-objekt. Detta är användbart när ett arkiv av misstag innehåller ett duplicerat filnamn. (Bidrag från Graham Horler; :issue:`1775025`.)

source: Finally, :mod:`zipfile` now supports using Unicode filenames for archived files. (Contributed by Alexey Borzenkov; :issue:`1734346`.)
sv: Slutligen stöder :mod:`zipfile` nu användning av Unicode-filnamn för arkiverade filer. (Bidrag från Alexey Borzenkov; :issue:`1734346`.)

source: The :mod:`ast` module
sv: Modulen :mod:`ast

source: The :mod:`ast` module provides an Abstract Syntax Tree representation of Python code, and Armin Ronacher contributed a set of helper functions that perform a variety of common tasks. These will be useful for HTML templating packages, code analyzers, and similar tools that process Python code.
sv: Modulen :mod:`ast` ger en representation av Python-kod i form av ett abstrakt syntaxträd, och Armin Ronacher har bidragit med en uppsättning hjälpfunktioner som utför en mängd vanliga uppgifter. Dessa kommer att vara användbara för HTML-templating-paket, kodanalysatorer och liknande verktyg som bearbetar Python-kod.

source: The :func:`parse` function takes an expression and returns an AST. The :func:`dump` function outputs a representation of a tree, suitable for debugging::
sv: Funktionen :func:`parse` tar ett uttryck och returnerar en AST. Funktionen :func:`dump` ger en representation av ett träd, lämplig för felsökning::

source: This outputs a deeply nested tree::
sv: Detta ger ett djupt nästlat träd::

source: Module(body=[ Assign(targets=[ Name(id='d', ctx=Store()) ], value=Dict(keys=[], values=[])) For(target=Name(id='i', ctx=Store()), iter=Str(s='abcdefghijklm'), body=[ Assign(targets=[ Subscript(value= Name(id='d', ctx=Load()), slice= Index(value= BinOp(left=Name(id='i', ctx=Load()), op=Add(), right=Name(id='i', ctx=Load()))), ctx=Store()) ], value= BinOp(left= BinOp(left= Call(func= Name(id='ord', ctx=Load()), args=[ Name(id='i', ctx=Load()) ], keywords=[], starargs=None, kwargs=None), op=Sub(), right=Call(func= Name(id='ord', ctx=Load()), args=[ Str(s='a') ], keywords=[], starargs=None, kwargs=None)), op=Add(), right=Num(n=1))) ], orelse=[]) Print(dest=None, values=[ Name(id='d', ctx=Load()) ], nl=True) ])
sv: Modul(kropp=[ Tilldela(mål=[ Namn(id='d', ctx=Store()) ], value=Dict(keys=[], values=[])) For(target=Name(id='i', ctx=Store()), iter=Str(s='abcdefghijklm'), body=[ Tilldela(mål=[ Subscript(värde= Name(id='d', ctx=Load()), slice= Index(värde= BinOp(left=Namn(id='i', ctx=Load()), op=Add(), right=Name(id='i', ctx=Load()))), ctx=Store()) ], värde= BinOp(vänster= BinOp(vänster= Anrop(func= Name(id='ord', ctx=Load()), args=[ Namn(id='i', ctx=Load()) ], nyckelord=[], starargs=None, kwargs=None), op=Sub(), right=Anrop(func= Name(id='ord', ctx=Load()), args=[ Str(s='a') ], nyckelord=[], starargs=None, kwargs=None)), op=Add(), right=Num(n=1))) ], orelse=[]) Print(dest=One, värden=[ Namn(id='d', ctx=Load()) ], nl=True) ])

source: The :func:`literal_eval` method takes a string or an AST representing a literal expression, parses and evaluates it, and returns the resulting value. A literal expression is a Python expression containing only strings, numbers, dictionaries, etc. but no statements or function calls. If you need to evaluate an expression but cannot accept the security risk of using an :func:`eval` call, :func:`literal_eval` will handle it safely::
sv: Metoden :func:`literal_eval` tar en sträng eller en AST som representerar ett bokstavligt uttryck, analyserar och utvärderar det och returnerar det resulterande värdet. Ett bokstavligt uttryck är ett Python-uttryck som bara innehåller strängar, tal, lexikon etc. men inga satser eller funktionsanrop. Om du behöver utvärdera ett uttryck men inte kan acceptera säkerhetsrisken med att använda ett :func:`eval`-anrop, kommer :func:`literal_eval` att hantera det på ett säkert sätt::

source: >>> literal = '("a", "b", {2:4, 3:8, 1:2})' >>> print ast.literal_eval(literal) ('a', 'b', {1: 2, 2: 4, 3: 8}) >>> print ast.literal_eval('"a" + "b"') Traceback (most recent call last): ... ValueError: malformed string
sv: >>> literal = '("a", "b", {2:4, 3:8, 1:2})' >>> print ast.literal_eval(literal) ('a', 'b', {1: 2, 2: 4, 3: 8}) >>> print ast.literal_eval('"a" + "b"') Traceback (senaste anropet senast): ... ValueError: missbildad sträng

source: The module also includes :class:`NodeVisitor` and :class:`NodeTransformer` classes for traversing and modifying an AST, and functions for common transformations such as changing line numbers.
sv: Modulen innehåller också klasserna :class:`NodeVisitor` och :class:`NodeTransformer` för genomgång och modifiering av en AST, samt funktioner för vanliga transformationer, t.ex. ändring av radnummer.

source: The :mod:`future_builtins` module
sv: Modulen :mod:`future_builtins

source: Python 3.0 makes many changes to the repertoire of built-in functions, and most of the changes can't be introduced in the Python 2.x series because they would break compatibility. The :mod:`future_builtins` module provides versions of these built-in functions that can be imported when writing 3.0-compatible code.
sv: Python 3.0 gör många ändringar i repertoaren av inbyggda funktioner, och de flesta av ändringarna kan inte införas i Python 2.x-serien eftersom de skulle bryta kompatibiliteten. Modulen :mod:`future_builtins` tillhandahåller versioner av dessa inbyggda funktioner som kan importeras när du skriver 3.0-kompatibel kod.

source: The functions in this module currently include:
sv: Funktionerna i denna modul omfattar för närvarande:

source: ``ascii(obj)``: equivalent to :func:`repr`. In Python 3.0, :func:`repr` will return a Unicode string, while :func:`ascii` will return a pure ASCII bytestring.
sv: ``ascii(obj)``: likvärdig med :func:`repr`. I Python 3.0 kommer :func:`repr` att returnera en Unicode-sträng, medan :func:`ascii` kommer att returnera en ren ASCII-bytestring.

source: ``filter(predicate, iterable)``, ``map(func, iterable1, ...)``: the 3.0 versions return iterators, unlike the 2.x builtins which return lists.
sv: ``filter(predikat, iterabel)``, ``map(func, iterabel1, ...)``: 3.0-versionerna returnerar iteratorer, till skillnad från 2.x-inbyggnaderna som returnerar listor.

source: ``hex(value)``, ``oct(value)``: instead of calling the :meth:`__hex__` or :meth:`__oct__` methods, these versions will call the :meth:`__index__` method and convert the result to hexadecimal or octal. :func:`oct` will use the new ``0o`` notation for its result.
sv: ``hex(värde)``, ``oct(värde)``: istället för att anropa metoderna :meth:`__hex__` eller :meth:`__oct__` anropar dessa versioner metoden :meth:`__index__` och konverterar resultatet till hexadecimal eller oktal. :func:`oct` använder den nya notationen ``0o`` för sitt resultat.

source: The :mod:`json` module: JavaScript Object Notation
sv: Modulen :mod:`json`: JavaScript-objektnotation

source: The new :mod:`json` module supports the encoding and decoding of Python types in JSON (Javascript Object Notation). JSON is a lightweight interchange format often used in web applications. For more information about JSON, see http://www.json.org.
sv: Den nya modulen :mod:`json` stöder kodning och avkodning av Python-typer i JSON (Javascript Object Notation). JSON är ett lättviktigt utbytesformat som ofta används i webbapplikationer. För mer information om JSON, se http://www.json.org.

source: :mod:`json` comes with support for decoding and encoding most built-in Python types. The following example encodes and decodes a dictionary::
sv: :mod:`json` har stöd för avkodning och kodning av de flesta inbyggda Python-typer. Följande exempel kodar och avkodar en ordbok::

source: >>> import json >>> data = {"spam": "foo", "parrot": 42} >>> in_json = json.dumps(data) # Encode the data >>> in_json '{"parrot": 42, "spam": "foo"}' >>> json.loads(in_json) # Decode into a Python object {"spam": "foo", "parrot": 42}
sv: >>> import json >>> data = {"spam": "foo", "papegoja": 42} >>> in_json = json.dumps(data) # Koda data >>> in_json '{"papegoja": 42, "spam": "foo"}' >>> json.loads(in_json) # Avkoda till ett Python-objekt {"spam": "foo", "papegoja": 42}

source: It's also possible to write your own decoders and encoders to support more types. Pretty-printing of the JSON strings is also supported.
sv: Det är också möjligt att skriva egna avkodare och kodare för att stödja fler typer. Pretty-printing av JSON-strängarna stöds också.

source: :mod:`json` (originally called simplejson) was written by Bob Ippolito.
sv: :mod:`json` (ursprungligen kallad simplejson) skrevs av Bob Ippolito.

source: The :mod:`plistlib` module: A Property-List Parser
sv: Modulen :mod:`plistlib`: En parser för egenskapslistor

source: The ``.plist`` format is commonly used on Mac OS X to store basic data types (numbers, strings, lists, and dictionaries) by serializing them into an XML-based format. It resembles the XML-RPC serialization of data types.
sv: Formatet ``.plist`` används ofta på Mac OS X för att lagra grundläggande datatyper (siffror, strängar, listor och ordböcker) genom att serialisera dem till ett XML-baserat format. Det liknar XML-RPC-serialisering av datatyper.

source: Despite being primarily used on Mac OS X, the format has nothing Mac-specific about it and the Python implementation works on any platform that Python supports, so the :mod:`plistlib` module has been promoted to the standard library.
sv: Trots att formatet främst används på Mac OS X är det inte Mac-specifikt och Python-implementationen fungerar på alla plattformar som Python stöder, så modulen :mod:`plistlib` har flyttats till standardbiblioteket.

source: Using the module is simple::
sv: Det är enkelt att använda modulen::

source: ctypes Enhancements
sv: förbättringar av ctypes

source: Thomas Heller continued to maintain and enhance the :mod:`ctypes` module.
sv: Thomas Heller fortsatte att underhålla och förbättra modulen :mod:`ctypes`.

source: :mod:`ctypes` now supports a :class:`c_bool` datatype that represents the C99 ``bool`` type. (Contributed by David Remahl; :issue:`1649190`.)
sv: :mod:`ctypes` stöder nu en :class:`c_bool`-datatyp som representerar C99-typen ``bool``. (Bidrag från David Remahl; :issue:`1649190`.)

source: The :mod:`ctypes` string, buffer and array types have improved support for extended slicing syntax, where various combinations of ``(start, stop, step)`` are supplied. (Implemented by Thomas Wouters.)
sv: Typerna :mod:`ctypes` string, buffer och array har förbättrat stöd för utökad slicing-syntax, där olika kombinationer av ``(start, stop, step)`` anges. (Implementerat av Thomas Wouters.)

source: All :mod:`ctypes` data types now support :meth:`from_buffer` and :meth:`from_buffer_copy` methods that create a ctypes instance based on a provided buffer object. :meth:`from_buffer_copy` copies the contents of the object, while :meth:`from_buffer` will share the same memory area.
sv: Alla :mod:`ctypes` datatyper stöder nu :meth:`from_buffer` och :meth:`from_buffer_copy` metoder som skapar en ctypes-instans baserat på ett tillhandahållet buffertobjekt. :meth:`from_buffer_copy` kopierar innehållet i objektet, medan :meth:`from_buffer` delar samma minnesområde.

source: A new calling convention tells :mod:`ctypes` to clear the ``errno`` or Win32 LastError variables at the outset of each wrapped call. (Implemented by Thomas Heller; :issue:`1798`.)
sv: En ny anropskonvention säger till :mod:`ctypes` att rensa variablerna ``errno`` eller Win32 LastError i början av varje inkapslat anrop. (Implementerat av Thomas Heller; :issue:`1798`.)

source: You can now retrieve the Unix ``errno`` variable after a function call. When creating a wrapped function, you can supply ``use_errno=True`` as a keyword parameter to the :func:`DLL` function and then call the module-level methods :meth:`set_errno` and :meth:`get_errno` to set and retrieve the error value.
sv: Du kan nu hämta Unix-variabeln ``errno`` efter ett funktionsanrop. När du skapar en omsluten funktion kan du ange ``use_errno=True`` som en nyckelordsparameter till :func:`DLL`-funktionen och sedan anropa modulnivåmetoderna :meth:`set_errno` och :meth:`get_errno` för att ställa in och hämta felvärdet.

source: The Win32 LastError variable is similarly supported by the :func:`DLL`, :func:`OleDLL`, and :func:`WinDLL` functions. You supply ``use_last_error=True`` as a keyword parameter and then call the module-level methods :meth:`set_last_error` and :meth:`get_last_error`.
sv: Win32-variabeln LastError stöds på liknande sätt av funktionerna :func:`DLL`, :func:`OleDLL` och :func:`WinDLL`. Du anger ``use_last_error=True`` som en nyckelordsparameter och anropar sedan modulnivåmetoderna :meth:`set_last_error` och :meth:`get_last_error`.

source: The :func:`byref` function, used to retrieve a pointer to a ctypes instance, now has an optional *offset* parameter that is a byte count that will be added to the returned pointer.
sv: Funktionen :func:`byref`, som används för att hämta en pekare till en ctypes-instans, har nu en valfri parameter *offset* som är ett byteantal som läggs till den returnerade pekaren.

source: Improved SSL Support
sv: Förbättrat SSL-stöd

source: Bill Janssen made extensive improvements to Python 2.6's support for the Secure Sockets Layer by adding a new module, :mod:`ssl`, that's built atop the `OpenSSL <https://www.openssl.org/>`__ library. This new module provides more control over the protocol negotiated, the X.509 certificates used, and has better support for writing SSL servers (as opposed to clients) in Python. The existing SSL support in the :mod:`socket` module hasn't been removed and continues to work, though it will be removed in Python 3.0.
sv: Bill Janssen har gjort omfattande förbättringar av Python 2.6:s stöd för Secure Sockets Layer genom att lägga till en ny modul, :mod:`ssl`, som är byggd ovanpå biblioteket `OpenSSL <https://www.openssl.org/>`__. Denna nya modul ger mer kontroll över det protokoll som förhandlas, de X.509-certifikat som används och har bättre stöd för att skriva SSL-servrar (i motsats till klienter) i Python. Det befintliga SSL-stödet i modulen :mod:`socket` har inte tagits bort och fortsätter att fungera, även om det kommer att tas bort i Python 3.0.

source: To use the new module, you must first create a TCP connection in the usual way and then pass it to the :func:`ssl.wrap_socket` function. It's possible to specify whether a certificate is required, and to obtain certificate info by calling the :meth:`getpeercert` method.
sv: För att använda den nya modulen måste du först skapa en TCP-anslutning på vanligt sätt och sedan skicka den till funktionen :func:`ssl.wrap_socket`. Det är möjligt att ange om ett certifikat krävs och att få certifikatinformation genom att anropa metoden :meth:`getpeercert`.

source: The documentation for the :mod:`ssl` module.
sv: Dokumentationen för modulen :mod:`ssl`.

source: Deprecations and Removals
sv: Avskrivningar och borttagningar

source: String exceptions have been removed. Attempting to use them raises a :exc:`TypeError`.
sv: Strängundantag har tagits bort. Försök att använda dem ger upphov till ett :exc:`TypeError`.

source: Changes to the :class:`Exception` interface as dictated by :pep:`352` continue to be made. For 2.6, the :attr:`!message` attribute is being deprecated in favor of the :attr:`~BaseException.args` attribute.
sv: Ändringar i :class:`Exception`-gränssnittet enligt :pep:`352` fortsätter att göras. För 2.6 kommer attributet :attr:`!message` att tas bort till förmån för attributet :attr:`~BaseException.args`.

source: (3.0-warning mode) Python 3.0 will feature a reorganized standard library that will drop many outdated modules and rename others. Python 2.6 running in 3.0-warning mode will warn about these modules when they are imported.
sv: (3.0-varningsläge) Python 3.0 kommer att innehålla ett omorganiserat standardbibliotek som kommer att ta bort många föråldrade moduler och byta namn på andra. Python 2.6 som körs i 3.0-varningsläge kommer att varna för dessa moduler när de importeras.

source: The list of deprecated modules is: :mod:`!audiodev`, :mod:`!bgenlocations`, :mod:`!buildtools`, :mod:`!bundlebuilder`, :mod:`!Canvas`, :mod:`!compiler`, :mod:`!dircache`, :mod:`!dl`, :mod:`!fpformat`, :mod:`!gensuitemodule`, :mod:`!ihooks`, :mod:`!imageop`, :mod:`!imgfile`, :mod:`!linuxaudiodev`, :mod:`!mhlib`, :mod:`!mimetools`, :mod:`!multifile`, :mod:`!new`, :mod:`!pure`, :mod:`!statvfs`, :mod:`!sunaudiodev`, :mod:`!test.testall`, and :mod:`!toaiff`.
sv: Listan över utfasade moduler är: :mod:`!audiodev`, :mod:`!bgenlocations`, :mod:`!buildtools`, :mod:`!bundlebuilder`, :mod:`!Canvas`, :mod:`!compiler`, :mod:`!dircache`, :mod:`!dl`, :mod:`!fpformat`, :mod:`!gensuitemodule`, :mod:`!ihooks`, :mod:`!imageop`, :mod:`!imgfile`, :mod:`!linuxaudiodev`, :mod:`!mhlib`, :mod:`!mimetools`, :mod:`!multifile`, :mod:`!new`, :mod:`!pure`, :mod:`!statvfs`, :mod:`!sunaudiodev`, :mod:`!test.testall`, och :mod:`!toaiff`.

source: The :mod:`!gopherlib` module has been removed.
sv: Modulen :mod:`!gopherlib` har tagits bort.

source: The :mod:`!MimeWriter` module and :mod:`!mimify` module have been deprecated; use the :mod:`email` package instead.
sv: Modulerna :mod:`!MimeWriter` och :mod:`!mimify` har utgått; använd paketet :mod:`email` istället.

source: The :mod:`!md5` module has been deprecated; use the :mod:`hashlib` module instead.
sv: Modulen :mod:`!md5` har utgått; använd istället modulen :mod:`hashlib`.

source: The :mod:`!posixfile` module has been deprecated; :func:`fcntl.lockf` provides better locking.
sv: Modulen :mod:`!posixfile` har utgått; :func:`fcntl.lockf` ger bättre låsning.

source: The :mod:`!popen2` module has been deprecated; use the :mod:`subprocess` module.
sv: Modulen :mod:`!popen2` har utgått; använd modulen :mod:`subprocess`.

source: The :mod:`!rgbimg` module has been removed.
sv: Modulen :mod:`!rgbimg` har tagits bort.

source: The :mod:`!sets` module has been deprecated; it's better to use the built-in :class:`set` and :class:`frozenset` types.
sv: Modulen :mod:`!sets` har utgått; det är bättre att använda de inbyggda typerna :class:`set` och :class:`frozenset`.

source: The :mod:`!sha` module has been deprecated; use the :mod:`hashlib` module instead.
sv: Modulen :mod:`!sha` har utgått; använd istället modulen :mod:`hashlib`.

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Changes to Python's build process and to the C API include:
sv: Ändringar i Pythons byggprocess och i C API inkluderar:

source: Python now must be compiled with C89 compilers (after 19 years!). This means that the Python source tree has dropped its own implementations of :c:func:`!memmove` and :c:func:`!strerror`, which are in the C89 standard library.
sv: Python måste nu kompileras med C89-kompilatorer (efter 19 år!). Detta innebär att Pythons källträd har släppt sina egna implementationer av :c:func:`!memmove` och :c:func:`!strerror`, som finns i C89:s standardbibliotek.

source: Python 2.6 can be built with Microsoft Visual Studio 2008 (version 9.0), and this is the new default compiler. See the :file:`PCbuild` directory for the build files. (Implemented by Christian Heimes.)
sv: Python 2.6 kan byggas med Microsoft Visual Studio 2008 (version 9.0), och detta är den nya standardkompilatorn. Se katalogen :file:`PCbuild` för byggfilerna. (Implementerat av Christian Heimes.)

source: On Mac OS X, Python 2.6 can be compiled as a 4-way universal build. The :program:`configure` script can take a :option:`!--with-universal-archs=[32-bit|64-bit|all]` switch, controlling whether the binaries are built for 32-bit architectures (x86, PowerPC), 64-bit (x86-64 and PPC-64), or both. (Contributed by Ronald Oussoren.)
sv: På Mac OS X kan Python 2.6 kompileras som en 4-vägs universalbyggnad. Skriptet :program:`configure` kan innehålla ett :option:`!--with-universal-archs=[32-bit|64-bit|all]` som styr om binärerna ska byggas för 32-bitarsarkitekturer (x86, PowerPC), 64-bitarsarkitekturer (x86-64 och PPC-64) eller båda. (Bidrag från Ronald Oussoren.)

source: A new function added in Python 2.6.6, :c:func:`!PySys_SetArgvEx`, sets the value of ``sys.argv`` and can optionally update ``sys.path`` to include the directory containing the script named by ``sys.argv[0]`` depending on the value of an *updatepath* parameter.
sv: En ny funktion tillagd i Python 2.6.6, :c:func:`!PySys_SetArgvEx`, anger värdet på ``sys.argv`` och kan eventuellt uppdatera ``sys.path`` till att inkludera katalogen som innehåller skriptet som heter ``sys.argv[0]`` beroende på värdet på en *updatepath*-parameter.
