Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: The :mod:`xmlrpclib <xmlrpc.client>` module no longer automatically converts :class:`datetime.date` and :class:`datetime.time` to the :class:`xmlrpclib.DateTime <xmlrpc.client.DateTime>` type; the conversion semantics were not necessarily correct for all applications. Code using :mod:`!xmlrpclib` should convert :class:`date` and :class:`~datetime.time` instances. (:issue:`1330538`)
sv: Modulen :mod:`xmlrpclib <xmlrpc.client>` konverterar inte längre automatiskt :class:`datetime.date` och :class:`datetime.time` till typen :class:`xmlrpclib.DateTime <xmlrpc.client.DateTime>`; konverteringssemantiken var inte nödvändigtvis korrekt för alla applikationer. Kod som använder :mod:`!xmlrpclib` bör konvertera :class:`date` och :class:`~datetime.time` instanser. (:issue:`1330538`)

source: (3.0-warning mode) The :class:`Exception` class now warns when accessed using slicing or index access; having :class:`Exception` behave like a tuple is being phased out.
sv: (3.0-warning mode) Klassen :class:`Exception` varnar nu vid åtkomst med slicing eller indexåtkomst; att :class:`Exception` beter sig som en tuple håller på att fasas ut.

source: (3.0-warning mode) inequality comparisons between two dictionaries or two objects that don't implement comparison methods are reported as warnings. ``dict1 == dict2`` still works, but ``dict1 < dict2`` is being phased out.
sv: (3.0-varningsläge) ojämlikhetsjämförelser mellan två ordböcker eller två objekt som inte implementerar jämförelsemetoder rapporteras som varningar. ``dict1 == dict2`` fungerar fortfarande, men ``dict1 < dict2`` håller på att fasas ut.

source: Comparisons between cells, which are an implementation detail of Python's scoping rules, also cause warnings because such comparisons are forbidden entirely in 3.0.
sv: Jämförelser mellan celler, som är en implementeringsdetalj av Pythons scoping-regler, orsakar också varningar eftersom sådana jämförelser är helt förbjudna i 3.0.

source: For applications that embed Python:
sv: För applikationer som bygger in Python:

source: The :c:func:`!PySys_SetArgvEx` function was added in Python 2.6.6, letting applications close a security hole when the existing :c:func:`!PySys_SetArgv` function was used. Check whether you're calling :c:func:`!PySys_SetArgv` and carefully consider whether the application should be using :c:func:`!PySys_SetArgvEx` with *updatepath* set to false.
sv: Funktionen :c:func:`!PySys_SetArgvEx` lades till i Python 2.6.6, vilket gör det möjligt för applikationer att täppa till ett säkerhetshål när den befintliga funktionen :c:func:`!PySys_SetArgv` användes. Kontrollera om du anropar :c:func:`!PySys_SetArgv` och överväg noga om programmet bör använda :c:func:`!PySys_SetArgvEx` med *updatepath* satt till false.

source: Acknowledgements
sv: Tack till

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Georg Brandl, Steve Brown, Nick Coghlan, Ralph Corderoy, Jim Jewett, Kent Johnson, Chris Lambacher, Martin Michlmayr, Antoine Pitrou, Brian Warner.
sv: Författaren vill tacka följande personer för förslag, korrigeringar och hjälp med olika utkast av denna artikel: Georg Brandl, Steve Brown, Nick Coghlan, Ralph Corderoy, Jim Jewett, Kent Johnson, Chris Lambacher, Martin Michlmayr, Antoine Pitrou, Brian Warner.

source: universal newlines
sv: universella nya rader

source: What's new
sv: Vad är nytt
