Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: A new function, :func:`create_connection`, takes an address and connects to it using an optional timeout value, returning the connected socket object. This function also looks up the address's type and connects to it using IPv4 or IPv6 as appropriate. Changing your code to use :func:`create_connection` instead of ``socket(socket.AF_INET, ...)`` may be all that's required to make your code work with IPv6.
sv: En ny funktion, :func:`create_connection`, tar en adress och ansluter till den med hjälp av ett valfritt timeoutvärde och returnerar det anslutna socketobjektet. Den här funktionen söker också upp adressens typ och ansluter till den med IPv4 eller IPv6 beroende på vad som är lämpligt. Att ändra din kod så att den använder :func:`create_connection` istället för ``socket(socket.AF_INET, ...)`` kan vara allt som krävs för att få din kod att fungera med IPv6.

source: The base classes in the :mod:`SocketServer <socketserver>` module now support calling a :meth:`~socketserver.BaseServer.handle_timeout` method after a span of inactivity specified by the server's :attr:`~socketserver.BaseServer.timeout` attribute. (Contributed by Michael Pomraning.) The :meth:`~socketserver.BaseServer.serve_forever` method now takes an optional poll interval measured in seconds, controlling how often the server will check for a shutdown request. (Contributed by Pedro Werneck and Jeffrey Yasskin; :issue:`742598`, :issue:`1193577`.)
sv: Basklasserna i modulen :mod:`SocketServer <socketserver>` stöder nu anrop av metoden :meth:`~socketserver.BaseServer.handle_timeout` efter en tid av inaktivitet som anges av serverns attribut :attr:`~socketserver.BaseServer.timeout`. (Bidrag från Michael Pomraning.) Metoden :meth:`~socketserver.BaseServer.serve_forever` tar nu ett valfritt pollintervall mätt i sekunder, vilket styr hur ofta servern ska kontrollera om det finns en begäran om avstängning. (Bidrag från Pedro Werneck och Jeffrey Yasskin; :issue:`742598`, :issue:`1193577`.)

source: The :mod:`sqlite3` module, maintained by Gerhard Häring, has been updated from version 2.3.2 in Python 2.5 to version 2.4.1.
sv: Modulen :mod:`sqlite3`, som underhålls av Gerhard Häring, har uppdaterats från version 2.3.2 i Python 2.5 till version 2.4.1.

source: The :mod:`struct` module now supports the C99 :c:expr:`_Bool` type, using the format character ``'?'``. (Contributed by David Remahl.)
sv: Modulen :mod:`struct` har nu stöd för C99-typen :c:expr:`_Bool`, som använder formattecknet ``'?'``. (Bidrag från David Remahl.)

source: The :class:`~subprocess.Popen` objects provided by the :mod:`subprocess` module now have :meth:`~subprocess.Popen.terminate`, :meth:`~subprocess.Popen.kill`, and :meth:`~subprocess.Popen.send_signal` methods. On Windows, :meth:`!send_signal` only supports the :py:const:`~signal.SIGTERM` signal, and all these methods are aliases for the Win32 API function :c:func:`!TerminateProcess`. (Contributed by Christian Heimes.)
sv: Objekten :class:`~subprocess.Popen` som tillhandahålls av modulen :mod:`subprocess` har nu metoderna :meth:`~subprocess.Popen.terminate`, :meth:`~subprocess.Popen.kill` och :meth:`~subprocess.Popen.send_signal`. På Windows stöder :meth:`!send_signal` endast signalen :py:const:`~signal.SIGTERM`, och alla dessa metoder är alias för Win32 API-funktionen :c:func:`!TerminateProcess`. (Bidrag från Christian Heimes.)

source: A new variable in the :mod:`sys` module, :attr:`float_info`, is an object containing information derived from the :file:`float.h` file about the platform's floating-point support. Attributes of this object include :attr:`mant_dig` (number of digits in the mantissa), :attr:`epsilon` (smallest difference between 1.0 and the next largest value representable), and several others. (Contributed by Christian Heimes; :issue:`1534`.)
sv: En ny variabel i modulen :mod:`sys`, :attr:`float_info`, är ett objekt som innehåller information från filen :file:`float.h` om plattformens stöd för flyttal. Attribut för detta objekt inkluderar :attr:`mant_dig` (antal siffror i mantissan), :attr:`epsilon` (minsta skillnaden mellan 1,0 och nästa största representerbara värde), och flera andra. (Bidrag från Christian Heimes; :issue:`1534`.)

source: Another new variable, :attr:`dont_write_bytecode`, controls whether Python writes any :file:`.pyc` or :file:`.pyo` files on importing a module. If this variable is true, the compiled files are not written. The variable is initially set on start-up by supplying the :option:`-B` switch to the Python interpreter, or by setting the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable before running the interpreter. Python code can subsequently change the value of this variable to control whether bytecode files are written or not. (Contributed by Neal Norwitz and Georg Brandl.)
sv: En annan ny variabel, :attr:`dont_write_bytecode`, styr om Python skriver några :file:`.pyc`- eller :file:`.pyo`-filer vid import av en modul. Om variabeln är true skrivs inte de kompilerade filerna. Variabeln ställs in initialt vid start genom att ange :option:`-B` till Python-tolken, eller genom att ställa in miljövariabeln :envvar:`PYTHONDONTWRITEBYTECODE` innan tolken körs. Python-kod kan därefter ändra värdet på denna variabel för att kontrollera om bytecode-filer skrivs eller inte. (Bidrag från Neal Norwitz och Georg Brandl.)

source: Information about the command-line arguments supplied to the Python interpreter is available by reading attributes of a named tuple available as ``sys.flags``. For example, the :attr:`verbose` attribute is true if Python was executed in verbose mode, :attr:`debug` is true in debugging mode, etc. These attributes are all read-only. (Contributed by Christian Heimes.)
sv: Information om kommandoradsargumenten som levereras till Python-tolken är tillgänglig genom att läsa attribut för en namngiven tupel som finns tillgänglig som ``sys.flags``. Exempelvis är attributet :attr:`verbose` sant om Python kördes i verbose-läge, :attr:`debug` är sant i debugging-läge, etc. Alla dessa attribut är skrivskyddade. (Bidrag från Christian Heimes.)

source: A new function, :func:`getsizeof`, takes a Python object and returns the amount of memory used by the object, measured in bytes. Built-in objects return correct results; third-party extensions may not, but can define a :meth:`__sizeof__` method to return the object's size. (Contributed by Robert Schuppenies; :issue:`2898`.)
sv: En ny funktion, :func:`getsizeof`, tar ett Python-objekt och returnerar den mängd minne som används av objektet, mätt i byte. Inbyggda objekt returnerar korrekta resultat; tredjepartstillägg kanske inte gör det, men kan definiera en :meth:`__sizeof__`-metod för att returnera objektets storlek. (Bidrag från Robert Schuppenies; :issue:`2898`.)

source: It's now possible to determine the current profiler and tracer functions by calling :func:`sys.getprofile` and :func:`sys.gettrace`. (Contributed by Georg Brandl; :issue:`1648`.)
sv: Det är nu möjligt att bestämma de aktuella profilerings- och spårningsfunktionerna genom att anropa :func:`sys.getprofile` och :func:`sys.gettrace`. (Bidrag från Georg Brandl; :issue:`1648`.)

source: The :mod:`tarfile` module now supports POSIX.1-2001 (pax) tarfiles in addition to the POSIX.1-1988 (ustar) and GNU tar formats that were already supported. The default format is GNU tar; specify the ``format`` parameter to open a file using a different format::
sv: Modulen :mod:`tarfile` stöder nu POSIX.1-2001 (pax)-tarfiler utöver POSIX.1-1988 (ustar)- och GNU tar-formaten som redan tidigare stöddes. Standardformatet är GNU tar; ange parametern ``format`` för att öppna en fil med ett annat format::

source: The new ``encoding`` and ``errors`` parameters specify an encoding and an error handling scheme for character conversions. ``'strict'``, ``'ignore'``, and ``'replace'`` are the three standard ways Python can handle errors,; ``'utf-8'`` is a special value that replaces bad characters with their UTF-8 representation. (Character conversions occur because the PAX format supports Unicode filenames, defaulting to UTF-8 encoding.)
sv: De nya parametrarna ``encoding`` och ``errors`` anger en kodning och ett felhanteringsschema för teckenkonverteringar. ``'strict'``, ``'ignore'`` och ``'replace'`` är de tre standardsätten som Python kan hantera fel på; ``'utf-8'`` är ett specialvärde som ersätter dåliga tecken med deras UTF-8-representation. (Teckenkonvertering sker eftersom PAX-formatet stöder Unicode-filnamn och som standard använder UTF-8-kodning)

source: The :meth:`TarFile.add` method now accepts an ``exclude`` argument that's a function that can be used to exclude certain filenames from an archive. The function must take a filename and return true if the file should be excluded or false if it should be archived. The function is applied to both the name initially passed to :meth:`add` and to the names of files in recursively added directories.
sv: Metoden :meth:`TarFile.add` accepterar nu ett ``exclude``-argument som är en funktion som kan användas för att utesluta vissa filnamn från ett arkiv. Funktionen måste ta ett filnamn och returnera true om filen ska uteslutas eller false om den ska arkiveras. Funktionen tillämpas både på det namn som ursprungligen skickades till :meth:`add` och på namnen på filer i rekursivt tillagda kataloger.

source: (All changes contributed by Lars Gustäbel).
sv: (Alla ändringar har gjorts av Lars Gustäbel).

source: An optional ``timeout`` parameter was added to the :class:`!telnetlib.Telnet` class constructor, specifying a timeout measured in seconds. (Added by Facundo Batista.)
sv: En valfri ``timeout``-parameter lades till i :class:`!telnetlib.Telnet`-klassens konstruktör, som anger en timeout mätt i sekunder. (Tillagd av Facundo Batista.)

source: The :class:`tempfile.NamedTemporaryFile` class usually deletes the temporary file it created when the file is closed. This behaviour can now be changed by passing ``delete=False`` to the constructor. (Contributed by Damien Miller; :issue:`1537850`.)
sv: Klassen :class:`tempfile.NamedTemporaryFile` raderar vanligtvis den temporära fil som den skapade när filen stängs. Detta beteende kan nu ändras genom att skicka ``delete=False`` till konstruktören. (Bidrag från Damien Miller; :issue:`1537850`.)

source: A new class, :class:`SpooledTemporaryFile`, behaves like a temporary file but stores its data in memory until a maximum size is exceeded. On reaching that limit, the contents will be written to an on-disk temporary file. (Contributed by Dustin J. Mitchell.)
sv: En ny klass, :class:`SpooledTemporaryFile`, beter sig som en temporär fil men lagrar sina data i minnet tills en maximal storlek överskrids. När denna gräns nås skrivs innehållet till en temporär fil på disken. (Bidrag från Dustin J. Mitchell.)

source: The :class:`NamedTemporaryFile` and :class:`SpooledTemporaryFile` classes both work as context managers, so you can write ``with tempfile.NamedTemporaryFile() as tmp: ...``. (Contributed by Alexander Belopolsky; :issue:`2021`.)
sv: Klasserna :class:`NamedTemporaryFile` och :class:`SpooledTemporaryFile` fungerar båda som kontexthanterare, så att du kan skriva ``with tempfile.NamedTemporaryFile() as tmp: ...``. (Bidrag från Alexander Belopolsky; :issue:`2021`.)

source: The :mod:`test.test_support <test.support>` module gained a number of context managers useful for writing tests. :func:`~test.support.os_helper.EnvironmentVarGuard` is a context manager that temporarily changes environment variables and automatically restores them to their old values.
sv: Modulen :mod:`test.test_support <test.support>` innehåller ett antal kontexthanterare som är användbara för att skriva tester. :func:`~test.support.os_helper.EnvironmentVarGuard` är en kontexthanterare som tillfälligt ändrar miljövariabler och automatiskt återställer dem till deras gamla värden.

source: Another context manager, :class:`TransientResource`, can surround calls to resources that may or may not be available; it will catch and ignore a specified list of exceptions. For example, a network test may ignore certain failures when connecting to an external web site::
sv: En annan kontexthanterare, :class:`TransientResource`, kan omge anrop till resurser som kan vara tillgängliga eller inte; den fångar upp och ignorerar en specificerad lista med undantag. Ett nätverkstest kan t.ex. ignorera vissa fel vid anslutning till en extern webbplats::

source: with test_support.TransientResource(IOError, errno=errno.ETIMEDOUT): f = urllib.urlopen('https://sf.net') ...
sv: med test_support.TransientResource(IOError, errno=errno.ETIMEDOUT): f = urllib.urlopen('https://sf.net') ...

source: Finally, :func:`check_warnings` resets the :mod:`warning` module's warning filters and returns an object that will record all warning messages triggered (:issue:`3781`)::
sv: Slutligen återställer :func:`check_warnings` :mod:`warning`-modulens varningsfilter och returnerar ett objekt som registrerar alla varningsmeddelanden som utlösts (:issue:`3781`)::

source: with test_support.check_warnings() as wrec: warnings.simplefilter("always") # ... code that triggers a warning ... assert str(wrec.message) == "function is outdated" assert len(wrec.warnings) == 1, "Multiple warnings raised"
sv: med test_support.check_warnings() som wrec: warnings.simplefilter("alltid") # ... kod som utlöser en varning ... assert str(wrec.message) == "funktionen är föråldrad" assert len(wrec.warnings) == 1, "Flera varningar utlöses"

source: (Contributed by Brett Cannon.)
sv: (Bidrag från Brett Cannon.)

source: The :mod:`textwrap` module can now preserve existing whitespace at the beginnings and ends of the newly created lines by specifying ``drop_whitespace=False`` as an argument::
sv: Modulen :mod:`textwrap` kan nu bevara befintliga blanksteg i början och slutet av de nyskapade raderna genom att ange ``drop_whitespace=False`` som argument::

source: >>> S = """This sentence has a bunch of ... extra whitespace.""" >>> print textwrap.fill(S, width=15) This sentence has a bunch of extra whitespace. >>> print textwrap.fill(S, drop_whitespace=False, width=15) This sentence has a bunch of extra whitespace. >>>
sv: >>> S = """Den här meningen har en massa ... extra blanksteg.""" >>> print textwrap.fill(S, width=15) Den här meningen har en massa extra blanksteg. >>> Skriv ut textwrap.fill(S, drop_whitespace=False, width=15) Den här meningen har en massa av extra blanksteg. >>>

source: (Contributed by Dwayne Bailey; :issue:`1581073`.)
sv: (Bidrag från Dwayne Bailey; :issue:`1581073`.)

source: The :mod:`threading` module API is being changed to use properties such as :attr:`daemon` instead of :meth:`setDaemon` and :meth:`isDaemon` methods, and some methods have been renamed to use underscores instead of camel-case; for example, the :meth:`activeCount` method is renamed to :meth:`active_count`. Both the 2.6 and 3.0 versions of the module support the same properties and renamed methods, but don't remove the old methods. No date has been set for the deprecation of the old APIs in Python 3.x; the old APIs won't be removed in any 2.x version. (Carried out by several people, most notably Benjamin Peterson.)
sv: API:et för modulen :mod:`threading` har ändrats så att egenskaper som :attr:`daemon` används i stället för metoderna :meth:`setDaemon` och :meth:`isDaemon`, och vissa metoder har bytt namn så att de använder understreck i stället för versaler, t.ex. har metoden :meth:`activeCount` bytt namn till :meth:`active_count`. Både 2.6- och 3.0-versionerna av modulen stöder samma egenskaper och omdöpta metoder, men tar inte bort de gamla metoderna. Inget datum har fastställts för utfasningen av de gamla API: erna i Python 3.x; de gamla API: erna kommer inte att tas bort i någon 2.x-version. (Genomfört av flera personer, särskilt Benjamin Peterson.)

source: The :mod:`threading` module's :class:`Thread` objects gained an :attr:`ident` property that returns the thread's identifier, a nonzero integer. (Contributed by Gregory P. Smith; :issue:`2871`.)
sv: :mod:`threading`-modulens :class:`Thread`-objekt fick en :attr:`ident`-egenskap som returnerar trådens identifierare, ett heltal som inte är noll. (Bidrag från Gregory P. Smith; :issue:`2871`.)

source: The :mod:`timeit` module now accepts callables as well as strings for the statement being timed and for the setup code. Two convenience functions were added for creating :class:`Timer` instances: ``repeat(stmt, setup, time, repeat, number)`` and ``timeit(stmt, setup, time, number)`` create an instance and call the corresponding method. (Contributed by Erik Demaine; :issue:`1533909`.)
sv: Modulen :mod:`timeit` accepterar nu anropsbara objekt samt strängar för det uttalande som tidsbestäms och för inställningskoden. Två bekvämlighetsfunktioner har lagts till för att skapa :class:`Timer`-instanser: ``repeat(stmt, setup, time, repeat, number)`` och ``timeit(stmt, setup, time, number)`` skapar en instans och anropar motsvarande metod. (Bidrag från Erik Demaine; :issue:`1533909`.)

source: The :mod:`Tkinter` module now accepts lists and tuples for options, separating the elements by spaces before passing the resulting value to Tcl/Tk. (Contributed by Guilherme Polo; :issue:`2906`.)
sv: Modulen :mod:`Tkinter` accepterar nu listor och tupler som alternativ och separerar elementen med mellanslag innan det resulterande värdet skickas till Tcl/Tk. (Bidrag från Guilherme Polo; :issue:`2906`.)

source: The :mod:`turtle` module for turtle graphics was greatly enhanced by Gregor Lingl. New features in the module include:
sv: Modulen :mod:`turtle` för sköldpaddsgrafik har förbättrats avsevärt av Gregor Lingl. Nya funktioner i modulen inkluderar:

source: Better animation of turtle movement and rotation.
sv: Bättre animering av sköldpaddans rörelse och rotation.

source: Control over turtle movement using the new :meth:`delay`, :meth:`tracer`, and :meth:`speed` methods.
sv: Kontroll över sköldpaddans rörelser med hjälp av de nya metoderna :meth:`delay`, :meth:`tracer` och :meth:`speed`.

source: The ability to set new shapes for the turtle, and to define a new coordinate system.
sv: Möjligheten att ställa in nya former för sköldpaddan och att definiera ett nytt koordinatsystem.

source: Turtles now have an :meth:`undo` method that can roll back actions.
sv: Sköldpaddor har nu en :meth:`undo`-metod som kan rulla tillbaka åtgärder.

source: Simple support for reacting to input events such as mouse and keyboard activity, making it possible to write simple games.
sv: Enkelt stöd för att reagera på indatahändelser som mus- och tangentbordsaktivitet, vilket gör det möjligt att skriva enkla spel.

source: A :file:`turtle.cfg` file can be used to customize the starting appearance of the turtle's screen.
sv: En :file:`turtle.cfg`-fil kan användas för att anpassa startutseendet på sköldpaddans skärm.

source: The module's docstrings can be replaced by new docstrings that have been translated into another language.
sv: Modulens dokumentationssträngar kan ersättas av nya dokumentationssträngar som har översatts till ett annat språk.

source: (:issue:`1513695`)
sv: (:utgåva:`1513695`)

source: An optional ``timeout`` parameter was added to the :func:`urllib.urlopen <urllib.request.urlopen>` function and the :class:`urllib.ftpwrapper` class constructor, as well as the :func:`urllib2.urlopen <urllib.request.urlopen>` function. The parameter specifies a timeout measured in seconds. For example::
sv: En valfri parameter ``timeout`` har lagts till i funktionen :func:`urllib.urlopen <urllib.request.urlopen>` och klasskonstruktören :class:`urllib.ftpwrapper`, samt i funktionen :func:`urllib2.urlopen <urllib.request.urlopen>`. Parametern anger en timeout som mäts i sekunder. Till exempel::

source: >>> u = urllib2.urlopen("http://slow.example.com", timeout=3) Traceback (most recent call last): ... urllib2.URLError: <urlopen error timed out> >>>
sv: &gt;&gt;&gt; u = urllib2.urlopen("http://slow.example.com", timeout=3) Traceback (senaste anropet senast): ... urllib2.URLError: <urlopen error timed out> &gt;&gt;&gt

source: (Added by Facundo Batista.)
sv: (Tillagd av Facundo Batista.)

source: The Unicode database provided by the :mod:`unicodedata` module has been updated to version 5.1.0. (Updated by Martin von Löwis; :issue:`3811`.)
sv: Unicode-databasen som tillhandahålls av modulen :mod:`unicodedata` har uppdaterats till version 5.1.0. (Uppdaterad av Martin von Löwis; :issue:`3811`.)

source: The :mod:`warnings` module's :func:`formatwarning` and :func:`showwarning` gained an optional *line* argument that can be used to supply the line of source code. (Added as part of :issue:`1631171`, which re-implemented part of the :mod:`warnings` module in C code.)
sv: Modulerna :mod:`warnings` :func:`formatwarning` och :func:`showwarning` har fått ett valfritt *line*-argument som kan användas för att ange en rad i källkoden. (Tillagd som en del av :issue:`1631171`, som återimplementerade en del av modulen :mod:`warnings` i C-kod)

source: A new function, :func:`catch_warnings`, is a context manager intended for testing purposes that lets you temporarily modify the warning filters and then restore their original values (:issue:`3781`).
sv: En ny funktion, :func:`catch_warnings`, är en kontexthanterare avsedd för teständamål som gör att du tillfälligt kan ändra varningsfiltren och sedan återställa deras ursprungliga värden (:issue:`3781`).

source: The XML-RPC :class:`SimpleXMLRPCServer <xmlrpc.server>` and :class:`DocXMLRPCServer <xmlrpc.server>` classes can now be prevented from immediately opening and binding to their socket by passing ``False`` as the *bind_and_activate* constructor parameter. This can be used to modify the instance's :attr:`allow_reuse_address` attribute before calling the :meth:`server_bind` and :meth:`server_activate` methods to open the socket and begin listening for connections. (Contributed by Peter Parente; :issue:`1599845`.)
sv: XML-RPC-klasserna :class:`SimpleXMLRPCServer <xmlrpc.server>` och :class:`DocXMLRPCServer <xmlrpc.server>` kan nu förhindras från att omedelbart öppna och binda till sin socket genom att ange ``False`` som *bind_and_activate*-konstruktörsparameter. Detta kan användas för att modifiera instansens attribut :attr:`allow_reuse_address` innan metoderna :meth:`server_bind` och :meth:`server_activate` anropas för att öppna sockeln och börja lyssna på anslutningar. (Bidrag från Peter Parente; :issue:`1599845`.)

source: :class:`SimpleXMLRPCServer` also has a :attr:`_send_traceback_header` attribute; if true, the exception and formatted traceback are returned as HTTP headers "X-Exception" and "X-Traceback". This feature is for debugging purposes only and should not be used on production servers because the tracebacks might reveal passwords or other sensitive information. (Contributed by Alan McIntyre as part of his project for Google's Summer of Code 2007.)
sv: :class:`SimpleXMLRPCServer` har också ett :attr:`_send_traceback_header`-attribut; om true returneras undantaget och den formaterade tracebacken som HTTP-rubriker "X-Exception" och "X-Traceback". Denna funktion är endast avsedd för felsökning och bör inte användas på produktionsservrar eftersom spårningarna kan avslöja lösenord eller annan känslig information. (Bidrag från Alan McIntyre som en del av hans projekt för Googles Summer of Code 2007)
