Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: The context manager's :meth:`~object.__enter__` method is called. The value returned is assigned to *VAR*. If no ``as VAR`` clause is present, the value is simply discarded.
sv: Kontexthanterarens metod :meth:`~object.__enter__` anropas. Det värde som returneras tilldelas *VAR*. Om ingen ``as VAR``-klausul finns, kasseras värdet helt enkelt.

source: The code in *BLOCK* is executed.
sv: Koden i *BLOCK* utförs.

source: If *BLOCK* raises an exception, the context manager's :meth:`~object.__exit__` method is called with three arguments, the exception details (``type, value, traceback``, the same values returned by :func:`sys.exc_info`, which can also be ``None`` if no exception occurred). The method's return value controls whether an exception is re-raised: any false value re-raises the exception, and ``True`` will result in suppressing it. You'll only rarely want to suppress the exception, because if you do the author of the code containing the ':keyword:`with`' statement will never realize anything went wrong.
sv: Om *BLOCK* ger upphov till ett undantag anropas kontexthanterarens metod :meth:`~object.__exit__` med tre argument, undantagsdetaljerna (``typ, värde, traceback``, samma värden som returneras av :func:`sys.exc_info`, som också kan vara ``None`` om inget undantag inträffade). Metodens returvärde kontrollerar om ett undantag ska tas upp igen: alla falska värden tar upp undantaget igen, och ``True`` resulterar i att det undertrycks. Du kommer bara sällan att vilja undertrycka undantaget, för om du gör det kommer författaren till koden som innehåller ':keyword:`with`'-uttalandet aldrig att inse att något gick fel.

source: If *BLOCK* didn't raise an exception, the :meth:`~object.__exit__` method is still called, but *type*, *value*, and *traceback* are all ``None``.
sv: Om *BLOCK* inte gav upphov till ett undantag anropas fortfarande metoden :meth:`~object.__exit__`, men *type*, *value* och *traceback* är alla ``None``.

source: Let's think through an example. I won't present detailed code but will only sketch the methods necessary for a database that supports transactions.
sv: Låt oss tänka igenom ett exempel. Jag kommer inte att presentera detaljerad kod utan bara skissa på de metoder som krävs för en databas som stöder transaktioner.

source: (For people unfamiliar with database terminology: a set of changes to the database are grouped into a transaction. Transactions can be either committed, meaning that all the changes are written into the database, or rolled back, meaning that the changes are all discarded and the database is unchanged. See any database textbook for more information.)
sv: (För den som inte är bekant med databasterminologi: en uppsättning ändringar i databasen grupperas i en transaktion. Transaktioner kan antingen bekräftas, vilket innebär att alla ändringar skrivs in i databasen, eller rullas tillbaka, vilket innebär att alla ändringar tas bort och att databasen är oförändrad. Se en databasbok för mer information)

source: Let's assume there's an object representing a database connection. Our goal will be to let the user write code like this::
sv: Låt oss anta att det finns ett objekt som representerar en databasanslutning. Vårt mål kommer att vara att låta användaren skriva kod som denna::

source: db_connection = DatabaseConnection() with db_connection as cursor: cursor.execute('insert into ...') cursor.execute('delete from ...') # ... more operations ...
sv: db_connection = Databasanslutning() med db_connection som cursor: cursor.execute('insert into ...') cursor.execute('ta bort från ...') # ... fler operationer ...

source: The transaction should be committed if the code in the block runs flawlessly or rolled back if there's an exception. Here's the basic interface for :class:`DatabaseConnection` that I'll assume::
sv: Transaktionen bör genomföras om koden i blocket körs felfritt eller rullas tillbaka om det finns ett undantag. Här är det grundläggande gränssnittet för :class:`DatabaseConnection` som jag kommer att anta::

source: class DatabaseConnection: # Database interface def cursor(self): "Returns a cursor object and starts a new transaction" def commit(self): "Commits current transaction" def rollback(self): "Rolls back current transaction"
sv: klass DatabaseConnection: # Databasgränssnitt def cursor(self): "Returnerar ett cursor-objekt och startar en ny transaktion" def commit(self): "Commitar aktuell transaktion" def rollback(self): "Rullar tillbaka aktuell transaktion"

source: The :meth:`~object.__enter__` method is pretty easy, having only to start a new transaction. For this application the resulting cursor object would be a useful result, so the method will return it. The user can then add ``as cursor`` to their ':keyword:`with`' statement to bind the cursor to a variable name. ::
sv: Metoden :meth:`~object.__enter__` är ganska enkel, det räcker med att starta en ny transaktion. För den här applikationen skulle det resulterande markörobjektet vara ett användbart resultat, så metoden returnerar det. Användaren kan sedan lägga till ``as cursor`` i sin ':keyword:`with`'-sats för att binda markören till ett variabelnamn. ::

source: class DatabaseConnection: ... def __enter__(self): # Code to start a new transaction cursor = self.cursor() return cursor
sv: klass DatabaseConnection: ... def __enter__(self): # Kod för att starta en ny transaktion cursor = self.cursor() returnera cursor

source: The :meth:`~object.__exit__` method is the most complicated because it's where most of the work has to be done. The method has to check if an exception occurred. If there was no exception, the transaction is committed. The transaction is rolled back if there was an exception.
sv: Metoden :meth:`~object.__exit__` är den mest komplicerade eftersom det är där det mesta av arbetet måste göras. Metoden måste kontrollera om ett undantag inträffade. Om det inte inträffade något undantag genomförs transaktionen. Transaktionen rullas tillbaka om det inträffade ett undantag.

source: In the code below, execution will just fall off the end of the function, returning the default value of ``None``. ``None`` is false, so the exception will be re-raised automatically. If you wished, you could be more explicit and add a :keyword:`return` statement at the marked location. ::
sv: I koden nedan kommer exekveringen bara att falla av i slutet av funktionen och returnera standardvärdet ``None``. ``None`` är falskt, så undantaget kommer att återkallas automatiskt. Om du vill kan du vara mer explicit och lägga till en :keyword:`return`-sats på den markerade platsen. ::

source: class DatabaseConnection: ... def __exit__(self, type, value, tb): if tb is None: # No exception, so commit self.commit() else: # Exception occurred, so rollback. self.rollback() # return False
sv: klass DatabaseConnection: ... def __exit__(self, type, value, tb): om tb är None: # Inget undantag, så commit self.commit() else: # Undantag inträffade, så rollback. self.rollback() # return False

source: The contextlib module
sv: Modulen contextlib

source: The :mod:`contextlib` module provides some functions and a decorator that are useful when writing objects for use with the ':keyword:`with`' statement.
sv: Modulen :mod:`contextlib` innehåller några funktioner och en dekorator som är användbara när du skriver objekt som ska användas med ':keyword:`with`'.

source: The decorator is called :func:`contextmanager`, and lets you write a single generator function instead of defining a new class. The generator should yield exactly one value. The code up to the :keyword:`yield` will be executed as the :meth:`~object.__enter__` method, and the value yielded will be the method's return value that will get bound to the variable in the ':keyword:`with`' statement's :keyword:`!as` clause, if any. The code after the :keyword:`!yield` will be executed in the :meth:`~object.__exit__` method. Any exception raised in the block will be raised by the :keyword:`!yield` statement.
sv: Dekoratorn heter :func:`contextmanager` och gör att du kan skriva en enda generatorfunktion istället för att definiera en ny klass. Generatorn ska ge exakt ett värde. Koden fram till :keyword:`yield` kommer att exekveras som :meth:`~object.__enter__`-metoden, och det värde som genereras kommer att vara metodens returvärde som kommer att bindas till variabeln i ':keyword:`with`'-satsens :keyword:`!as`-klausul, om någon. Koden efter :keyword:`!yield` kommer att exekveras i metoden :meth:`~object.__exit__`. Alla undantag som uppstår i blocket kommer att uppstå i :keyword:`!yield`-satsen.

source: Using this decorator, our database example from the previous section could be written as::
sv: Med hjälp av denna dekorator kan vårt databasexempel från föregående avsnitt skrivas som::

source: from contextlib import contextmanager @contextmanager def db_transaction(connection): cursor = connection.cursor() try: yield cursor except: connection.rollback() raise else: connection.commit() db = DatabaseConnection() with db_transaction(db) as cursor: ...
sv: från contextlib import contextmanager @kontexthanterare def db_transaction(anslutning): cursor = anslutning.cursor() försök: avkastning cursor except: connection.rollback() höja else: anslutning.commit() db = Databasanslutning() med db_transaction(db) som cursor: ...

source: The :mod:`contextlib` module also has a ``nested(mgr1, mgr2, ...)`` function that combines a number of context managers so you don't need to write nested ':keyword:`with`' statements. In this example, the single ':keyword:`!with`' statement both starts a database transaction and acquires a thread lock::
sv: Modulen :mod:`contextlib` har också en funktion ``nested(mgr1, mgr2, ...)`` som kombinerar ett antal kontexthanterare så att du inte behöver skriva nästlade ':keyword:`with`'-satser. I det här exemplet startar en enda ':keyword:`!with`'-sats både en databastransaktion och förvärvar ett trådlås:

source: lock = threading.Lock() with nested (db_transaction(db), lock) as (cursor, locked): ...
sv: lock = threading.Lock() med nested (db_transaction(db), lock) som (cursor, locked): ...

source: Finally, the :func:`closing` function returns its argument so that it can be bound to a variable, and calls the argument's ``.close()`` method at the end of the block. ::
sv: Slutligen returnerar funktionen :func:`closing` sitt argument så att det kan bindas till en variabel, och anropar argumentets metod ``.close()`` i slutet av blocket. ::

source: :pep:`343` - The "with" statement
sv: :pep:`343` - Uttalandet "med"

source: PEP written by Guido van Rossum and Nick Coghlan; implemented by Mike Bland, Guido van Rossum, and Neal Norwitz. The PEP shows the code generated for a ':keyword:`with`' statement, which can be helpful in learning how the statement works.
sv: PEP skriven av Guido van Rossum och Nick Coghlan; implementerad av Mike Bland, Guido van Rossum och Neal Norwitz. PEP:n visar koden som genereras för en ':keyword:`with`'-sats, vilket kan vara till hjälp för att lära sig hur satsen fungerar.

source: The documentation for the :mod:`contextlib` module.
sv: Dokumentationen för modulen :mod:`contextlib`.

source: PEP 366: Explicit Relative Imports From a Main Module
sv: PEP 366: Explicit relativistisk import från en huvudmodul

source: Python's :option:`-m` switch allows running a module as a script. When you ran a module that was located inside a package, relative imports didn't work correctly.
sv: Pythons :option:`-m` gör det möjligt att köra en modul som ett skript. När du körde en modul som låg i ett paket fungerade inte relativ import korrekt.

source: The fix for Python 2.6 adds a :attr:`module.__package__` attribute. When this attribute is present, relative imports will be relative to the value of this attribute instead of the :attr:`~module.__name__` attribute.
sv: Fixen för Python 2.6 lägger till ett :attr:`module.__package__`-attribut. När detta attribut är närvarande kommer relativ import att vara relativ till värdet på detta attribut istället för attributet :attr:`~module.__name__`.

source: PEP 302-style importers can then set :attr:`~module.__package__` as necessary. The :mod:`runpy` module that implements the :option:`-m` switch now does this, so relative imports will now work correctly in scripts running from inside a package.
sv: PEP 302-stil importörer kan sedan ställa in :attr:`~module.__package__` vid behov. Modulen :mod:`runpy` som implementerar bytet :option:`-m` gör nu detta, så relativ import kommer nu att fungera korrekt i skript som körs inifrån ett paket.

source: PEP 370: Per-user ``site-packages`` Directory
sv: PEP 370: ``site-packages``-katalog per användare

source: When you run Python, the module search path ``sys.path`` usually includes a directory whose path ends in ``"site-packages"``. This directory is intended to hold locally installed packages available to all users using a machine or a particular site installation.
sv: När du kör Python innehåller sökvägen för modulen ``sys.path`` vanligtvis en katalog vars sökväg slutar på ``"site-packages"``. Den här katalogen är avsedd att innehålla lokalt installerade paket som är tillgängliga för alla användare som använder en maskin eller en viss webbplatsinstallation.

source: Python 2.6 introduces a convention for user-specific site directories. The directory varies depending on the platform:
sv: Python 2.6 introducerar en konvention för användarspecifika webbplatskataloger. Katalogen varierar beroende på plattform:

source: Unix and Mac OS X: :file:`~/.local/`
sv: Unix och Mac OS X: :file:`~/.local/`

source: Within this directory, there will be version-specific subdirectories, such as :file:`lib/python2.6/site-packages` on Unix/Mac OS and :file:`Python26/site-packages` on Windows.
sv: I den här katalogen finns det versionsspecifika underkataloger, t.ex. :file:`lib/python2.6/site-packages` på Unix/Mac OS och :file:`Python26/site-packages` på Windows.

source: If you don't like the default directory, it can be overridden by an environment variable. :envvar:`PYTHONUSERBASE` sets the root directory used for all Python versions supporting this feature. On Windows, the directory for application-specific data can be changed by setting the :envvar:`APPDATA` environment variable. You can also modify the :file:`site.py` file for your Python installation.
sv: Om du inte gillar standardkatalogen kan den åsidosättas med en miljövariabel. :envvar:`PYTHONUSERBASE` anger den rotkatalog som används för alla Python-versioner som stöder denna funktion. I Windows kan katalogen för applikationsspecifika data ändras genom att ställa in miljövariabeln :envvar:`APPDATA`. Du kan också ändra filen :file:`site.py` för din Python-installation.

source: The feature can be disabled entirely by running Python with the :option:`-s` option or setting the :envvar:`PYTHONNOUSERSITE` environment variable.
sv: Funktionen kan avaktiveras helt genom att köra Python med alternativet :option:`-s` eller genom att ställa in miljövariabeln :envvar:`PYTHONNOUSERSITE`.

source: :pep:`370` - Per-user ``site-packages`` Directory
sv: :pep:`370` - Katalog för ``site-paket`` per användare

source: PEP written and implemented by Christian Heimes.
sv: PEP skrivet och implementerat av Christian Heimes.

source: PEP 371: The ``multiprocessing`` Package
sv: PEP 371: Paketet "Multiprocessing

source: The new :mod:`multiprocessing` package lets Python programs create new processes that will perform a computation and return a result to the parent. The parent and child processes can communicate using queues and pipes, synchronize their operations using locks and semaphores, and can share simple arrays of data.
sv: Det nya :mod:`multiprocessing`-paketet låter Python-program skapa nya processer som utför en beräkning och returnerar ett resultat till föräldern. Föräldra- och barnprocesserna kan kommunicera med hjälp av köer och pipes, synkronisera sina operationer med hjälp av lås och semaforer och kan dela enkla matriser med data.

source: The :mod:`multiprocessing` module started out as an exact emulation of the :mod:`threading` module using processes instead of threads. That goal was discarded along the path to Python 2.6, but the general approach of the module is still similar. The fundamental class is the :class:`Process`, which is passed a callable object and a collection of arguments. The :meth:`start` method sets the callable running in a subprocess, after which you can call the :meth:`is_alive` method to check whether the subprocess is still running and the :meth:`join` method to wait for the process to exit.
sv: Modulen :mod:`multiprocessing` började som en exakt emulering av modulen :mod:`threading` som använder processer istället för trådar. Det målet förkastades på vägen till Python 2.6, men det allmänna tillvägagångssättet för modulen är fortfarande liknande. Den grundläggande klassen är :class:`Process`, som får ett anropsbart objekt och en samling argument. Metoden :meth:`start` sätter igång det anropbara objektet i en subprocess, varefter du kan anropa metoden :meth:`is_alive` för att kontrollera om subprocessen fortfarande körs och metoden :meth:`join` för att vänta på att processen ska avslutas.

source: Here's a simple example where the subprocess will calculate a factorial. The function doing the calculation is written strangely so that it takes significantly longer when the input argument is a multiple of 4.
sv: Här är ett enkelt exempel där subprocessen ska beräkna en faktoriell. Funktionen som gör beräkningen är konstigt skriven så att den tar betydligt längre tid när indata är en multipel av 4.

source: A :class:`~queue.Queue` is used to communicate the result of the factorial. The :class:`~queue.Queue` object is stored in a global variable. The child process will use the value of the variable when the child was created; because it's a :class:`~queue.Queue`, parent and child can use the object to communicate. (If the parent were to change the value of the global variable, the child's value would be unaffected, and vice versa.)
sv: En :class:`~queue.Queue` används för att kommunicera resultatet av faktorialtalet. Objektet :class:`~queue.Queue` lagras i en global variabel. Barnprocessen kommer att använda variabelns värde när barnet skapades; eftersom det är en :class:`~queue.Queue` kan förälder och barn använda objektet för att kommunicera. (Om föräldern skulle ändra värdet på den globala variabeln skulle barnets värde inte påverkas, och vice versa)

source: Two other classes, :class:`Pool` and :class:`Manager`, provide higher-level interfaces. :class:`Pool` will create a fixed number of worker processes, and requests can then be distributed to the workers by calling :meth:`apply` or :meth:`apply_async` to add a single request, and :meth:`map` or :meth:`map_async` to add a number of requests. The following code uses a :class:`Pool` to spread requests across 5 worker processes and retrieve a list of results::
sv: Två andra klasser, :class:`Pool` och :class:`Manager`, tillhandahåller gränssnitt på högre nivå. :class:`Pool` skapar ett fast antal arbetsprocesser, och förfrågningar kan sedan distribueras till arbetsprocesserna genom att anropa :meth:`apply` eller :meth:`apply_async` för att lägga till en enda förfrågan, och :meth:`map` eller :meth:`map_async` för att lägga till ett antal förfrågningar. Följande kod använder en :class:`Pool` för att sprida ut förfrågningar över 5 arbetsprocesser och hämta en lista med resultat::

source: from multiprocessing import Pool def factorial(N, dictionary): "Compute a factorial." ... p = Pool(5) result = p.map(factorial, range(1, 1000, 10)) for v in result: print v
sv: från multiprocessing import Pool def faktoriell(N, ordbok): "Beräkna en faktoriell." ... p = Pool(5) resultat = p.map(faktoriell, intervall(1, 1000, 10)) för v i resultat: print v

source: This produces the following output::
sv: Detta ger följande utdata::

source: The other high-level interface, the :class:`Manager` class, creates a separate server process that can hold master copies of Python data structures. Other processes can then access and modify these data structures using proxy objects. The following example creates a shared dictionary by calling the :meth:`dict` method; the worker processes then insert values into the dictionary. (Locking is not done for you automatically, which doesn't matter in this example. :class:`Manager`'s methods also include :meth:`Lock`, :meth:`RLock`, and :meth:`Semaphore` to create shared locks.)
sv: Det andra högnivågränssnittet, klassen :class:`Manager`, skapar en separat serverprocess som kan hålla masterkopior av Python-datastrukturer. Andra processer kan sedan komma åt och modifiera dessa datastrukturer med hjälp av proxyobjekt. Följande exempel skapar en delad ordbok genom att anropa metoden :meth:`dict`; arbetsprocesserna infogar sedan värden i ordboken. (Låsning görs inte automatiskt, vilket inte spelar någon roll i det här exemplet. :class:`Manager`:s metoder inkluderar även :meth:`Lock`, :meth:`RLock` och :meth:`Semaphore` för att skapa delade lås)

source: This will produce the output::
sv: Detta kommer att ge utdata::

source: The documentation for the :mod:`multiprocessing` module.
sv: Dokumentationen för modulen :mod:`multiprocessing`.

source: :pep:`371` - Addition of the multiprocessing package
sv: :pep:`371` - Tillägg av multiprocessing-paketet

source: PEP written by Jesse Noller and Richard Oudkerk; implemented by Richard Oudkerk and Jesse Noller.
sv: PEP skriven av Jesse Noller och Richard Oudkerk; implementerad av Richard Oudkerk och Jesse Noller.

source: PEP 3101: Advanced String Formatting
sv: PEP 3101: Avancerad strängformatering

source: In Python 3.0, the ``%`` operator is supplemented by a more powerful string formatting method, :meth:`format`. Support for the :meth:`str.format` method has been backported to Python 2.6.
sv: I Python 3.0 kompletteras operatorn ``%`` med en mer kraftfull strängformateringsmetod, :meth:`format`. Stöd för metoden :meth:`str.format` har backporterats till Python 2.6.

source: In 2.6, both 8-bit and Unicode strings have a ``.format()`` method that treats the string as a template and takes the arguments to be formatted. The formatting template uses curly brackets (``{``, ``}``) as special characters::
sv: I 2.6 har både 8-bitars och Unicode-strängar en ``.format()``-metod som behandlar strängen som en mall och tar argumenten som ska formateras. Formateringsmallen använder hakparenteser (``{``, ``}``) som specialtecken::

source: >>> # Substitute positional argument 0 into the string. >>> "User ID: {0}".format("root") 'User ID: root' >>> # Use the named keyword arguments >>> "User ID: {uid} Last seen: {last_login}".format( ... uid="root", ... last_login = "5 Mar 2008 07:20") 'User ID: root Last seen: 5 Mar 2008 07:20'
sv: >>> # Ersätt det positionella argumentet 0 i strängen. >>> "Användar-ID: {0}".format("root") "Användar-ID: root >>> # Använd de namngivna nyckelordsargumenten >>> "Användar-ID: {uid} Senast sett: {last_login}".format( ... uid="root", ... last_login = "5 mars 2008 07:20") "Användar-ID: root Senast sedd: 5 mars 2008 07:20

source: Curly brackets can be escaped by doubling them::
sv: Lockiga parenteser kan undkommas genom att dubblera dem::

source: >>> "Empty dict: {{}}".format() "Empty dict: {}"
sv: >>> "Tomt diktat: {{}}".format() "Tomt diktat: {}"

source: Field names can be integers indicating positional arguments, such as ``{0}``, ``{1}``, etc. or names of keyword arguments. You can also supply compound field names that read attributes or access dictionary keys::
sv: Fältnamn kan vara heltal som anger positionella argument, t.ex. ``{0}``, ``{1}`` etc. eller namn på nyckelordsargument. Du kan också ange sammansatta fältnamn som läser attribut eller ger tillgång till nycklar i en ordbok::
