Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: >>> import sys >>> print 'Platform: {0.platform}\nPython version: {0.version}'.format(sys) Platform: darwin Python version: 2.6a1+ (trunk:61261M, Mar 5 2008, 20:29:41) [GCC 4.0.1 (Apple Computer, Inc. build 5367)]' >>> import mimetypes >>> 'Content-type: {0[.mp4]}'.format(mimetypes.types_map) 'Content-type: video/mp4'
sv: >>> import sys >>> print 'Plattform: {0.platform}\nPython version: {0.version}'.format(sys) Plattform: darwin Python-version: 2.6a1+ (trunk:61261M, 5 mars 2008, 20:29:41) [GCC 4.0.1 (Apple Computer, Inc. build 5367)]' >>> import mimetypes >>> 'Innehållstyp: {0[.mp4]}'.format(mimetypes.types_map) "Innehållstyp: video/mp4

source: Note that when using dictionary-style notation such as ``[.mp4]``, you don't need to put any quotation marks around the string; it will look up the value using ``.mp4`` as the key. Strings beginning with a number will be converted to an integer. You can't write more complicated expressions inside a format string.
sv: Observera att när du använder ordboksliknande notation som ``[.mp4]`` behöver du inte sätta några citattecken runt strängen; den kommer att leta upp värdet med ``.mp4`` som nyckel. Strängar som börjar med ett tal konverteras till ett heltal. Du kan inte skriva mer komplicerade uttryck inuti en formatsträng.

source: So far we've shown how to specify which field to substitute into the resulting string. The precise formatting used is also controllable by adding a colon followed by a format specifier. For example::
sv: Hittills har vi visat hur man anger vilket fält som ska ersättas i den resulterande strängen. Den exakta formatering som används kan också kontrolleras genom att lägga till ett kolon följt av en formatspecifikator. Till exempel::

source: >>> # Field 0: left justify, pad to 15 characters >>> # Field 1: right justify, pad to 6 characters >>> fmt = '{0:15} ${1:>6}' >>> fmt.format('Registration', 35) 'Registration $ 35' >>> fmt.format('Tutorial', 50) 'Tutorial $ 50' >>> fmt.format('Banquet', 125) 'Banquet $ 125'
sv: >>> # Fält 0: vänsterjustera, fyll i till 15 tecken >>> # Fält 1: högerjustera, fyll i till 6 tecken >>> fmt = '{0:15} ${1:>6}' >>> fmt.format('Registrering', 35) 'Registrering $ 35' >>> fmt.format('Självstudier', 50) "Handledning $ 50 >>> fmt.format('Bankett', 125) "Bankett $ 125

source: Format specifiers can reference other fields through nesting::
sv: Formatangivelser kan referera till andra fält genom nesting::

source: >>> fmt = '{0:{1}}' >>> width = 15 >>> fmt.format('Invoice #1234', width) 'Invoice #1234 ' >>> width = 35 >>> fmt.format('Invoice #1234', width) 'Invoice #1234 '
sv: >>> fmt = '{0:{1}}' >>> bredd = 15 >>> fmt.format('Faktura #1234', bredd) 'Faktura #1234 ' >>> bredd = 35 >>> fmt.format('Faktura #1234', bredd) "Faktura #1234

source: The alignment of a field within the desired width can be specified:
sv: Inriktningen av ett fält inom den önskade bredden kan specificeras:

source: Character
sv: Tecken

source: Effect
sv: Effekt

source: < (default)
sv: < (standard)

source: Left-align
sv: Vänsterjusterad

source: Right-align
sv: Högerjusterad

source: Center
sv: Centrera

source: (For numeric types only) Pad after the sign.
sv: (Endast för numeriska typer) Fyll i efter tecknet.

source: Format specifiers can also include a presentation type, which controls how the value is formatted. For example, floating-point numbers can be formatted as a general number or in exponential notation::
sv: Formatspecifikationer kan också innehålla en presentationstyp, som styr hur värdet formateras. Flyttal kan t.ex. formateras som ett allmänt tal eller i exponentiell notation::

source: A variety of presentation types are available. Consult the 2.6 documentation for a :ref:`complete list <formatstrings>`; here's a sample:
sv: En mängd olika presentationstyper finns tillgängliga. Se dokumentationen för 2.6 för en :ref:`fullständig lista <formatstrings>`; här är ett exempel:

source: Binary. Outputs the number in base 2.
sv: Binär. Utmatning av talet i bas 2.

source: Character. Converts the integer to the corresponding Unicode character before printing.
sv: Tecken. Konverterar heltalet till motsvarande Unicode-tecken före utskrift.

source: Decimal Integer. Outputs the number in base 10.
sv: Decimalt heltal. Utmatning av talet i bas 10.

source: Octal format. Outputs the number in base 8.
sv: Oktalformat. Utmatning av talet i bas 8.

source: Hex format. Outputs the number in base 16, using lower-case letters for the digits above 9.
sv: Hex-format. Utmatar talet i bas 16, med små bokstäver för siffrorna över 9.

source: Exponent notation. Prints the number in scientific notation using the letter 'e' to indicate the exponent.
sv: Exponentnotation. Skriver ut talet i vetenskaplig notation med bokstaven "e" för att ange exponenten.

source: General format. This prints the number as a fixed-point number, unless the number is too large, in which case it switches to 'e' exponent notation.
sv: Allmänt format. Detta skriver ut talet som ett fastpunktstal, såvida inte talet är för stort, i vilket fall det växlar till "e"-exponentnotation.

source: Number. This is the same as 'g' (for floats) or 'd' (for integers), except that it uses the current locale setting to insert the appropriate number separator characters.
sv: Siffra. Detta är samma sak som 'g' (för flyttal) eller 'd' (för heltal), förutom att den använder den aktuella lokalinställningen för att infoga lämpligt antal separatortecken.

source: Percentage. Multiplies the number by 100 and displays in fixed ('f') format, followed by a percent sign.
sv: Procent. Multiplicerar talet med 100 och visas i fast ('f') format, följt av ett procenttecken.

source: Classes and types can define a :meth:`__format__` method to control how they're formatted. It receives a single argument, the format specifier::
sv: Klasser och typer kan definiera en :meth:`__format__`-metod för att styra hur de formateras. Den tar emot ett enda argument, formatspecificeraren::

source: def __format__(self, format_spec): if isinstance(format_spec, unicode): return unicode(str(self)) else: return str(self)
sv: def __format__(self, format_spec): if isinstance(format_spec, unicode): return unicode(str(self)) annat: returnera str(self)

source: There's also a :func:`format` builtin that will format a single value. It calls the type's :meth:`__format__` method with the provided specifier::
sv: Det finns också en inbyggd :func:`format` som formaterar ett enskilt värde. Den anropar typens :meth:`__format__`-metod med den angivna specifikatorn::

source: :ref:`formatstrings`
sv: :ref:`formatsträngar`

source: The reference documentation for format fields.
sv: Referensdokumentation för formatfält.

source: :pep:`3101` - Advanced String Formatting
sv: :pep:`3101` - Avancerad strängformatering

source: PEP written by Talin. Implemented by Eric Smith.
sv: PEP skriven av Talin. Implementerad av Eric Smith.

source: PEP 3105: ``print`` As a Function
sv: PEP 3105: ``print`` som funktion

source: The ``print`` statement becomes the :func:`print` function in Python 3.0. Making :func:`print` a function makes it possible to replace the function by doing ``def print(...)`` or importing a new function from somewhere else.
sv: Satsen ``print`` blir funktionen :func:`print` i Python 3.0. Att göra :func:`print` till en funktion gör det möjligt att ersätta funktionen genom att göra ``def print(...)`` eller importera en ny funktion från någon annanstans.

source: Python 2.6 has a ``__future__`` import that removes ``print`` as language syntax, letting you use the functional form instead. For example::
sv: Python 2.6 har en ``__future__`` import som tar bort ``print`` som språksyntax, så att du kan använda den funktionella formen istället. Till exempel::

source: >>> from __future__ import print_function >>> print('# of entries', len(dictionary), file=sys.stderr)
sv: >>> från __future__ import print_function >>> print('# of entries', len(dictionary), file=sys.stderr)

source: The signature of the new function is::
sv: Signaturen för den nya funktionen är::

source: The parameters are:
sv: Parametrarna är:

source: *args*: positional arguments whose values will be printed out.
sv: *args*: positionella argument vars värden kommer att skrivas ut.

source: *sep*: the separator, which will be printed between arguments.
sv: *sep*: separatorn, som skrivs ut mellan argumenten.

source: *end*: the ending text, which will be printed after all of the arguments have been output.
sv: *end*: sluttexten, som skrivs ut efter att alla argument har matats ut.

source: *file*: the file object to which the output will be sent.
sv: *file*: det filobjekt som utdata ska skickas till.

source: :pep:`3105` - Make print a function
sv: :pep:`3105` - Gör print till en funktion

source: PEP written by Georg Brandl.
sv: PEP skriven av Georg Brandl.

source: PEP 3110: Exception-Handling Changes
sv: PEP 3110: Ändringar i undantagshantering

source: One error that Python programmers occasionally make is writing the following code::
sv: Ett fel som Python-programmerare ibland gör är att skriva följande kod::

source: try: ... except TypeError, ValueError: # Wrong! ...
sv: försök: ... except TypeError, ValueError: # Fel! ...

source: The author is probably trying to catch both :exc:`TypeError` and :exc:`ValueError` exceptions, but this code actually does something different: it will catch :exc:`TypeError` and bind the resulting exception object to the local name ``"ValueError"``. The :exc:`ValueError` exception will not be caught at all. The correct code specifies a tuple of exceptions::
sv: Författaren försöker förmodligen fånga både :exc:`TypeError`- och :exc:`ValueError`-undantagen, men den här koden gör faktiskt något annat: den fångar :exc:`TypeError` och binder det resulterande undantagsobjektet till det lokala namnet ``"ValueError"``. Undantaget :exc:`ValueError` kommer inte att fångas alls. Den korrekta koden specificerar en tupel av undantag::

source: try: ... except (TypeError, ValueError): ...
sv: försök: ... except (TypFel, VärdeFel): ...

source: This error happens because the use of the comma here is ambiguous: does it indicate two different nodes in the parse tree, or a single node that's a tuple?
sv: Det här felet uppstår eftersom användningen av kommatecken här är tvetydig: anger det två olika noder i parseträdet eller en enda nod som är en tupel?

source: Python 3.0 makes this unambiguous by replacing the comma with the word "as". To catch an exception and store the exception object in the variable ``exc``, you must write::
sv: Python 3.0 gör detta otvetydigt genom att ersätta kommatecknet med ordet "som". För att fånga ett undantag och lagra undantagsobjektet i variabeln ``exc`` måste du skriva::

source: try: ... except TypeError as exc: ...
sv: försök: ... except TypeError as exc: ...

source: Python 3.0 will only support the use of "as", and therefore interprets the first example as catching two different exceptions. Python 2.6 supports both the comma and "as", so existing code will continue to work. We therefore suggest using "as" when writing new Python code that will only be executed with 2.6.
sv: Python 3.0 stöder endast användningen av "as", och tolkar därför det första exemplet som att två olika undantag fångas upp. Python 2.6 stöder både kommatecken och "as", så befintlig kod kommer att fortsätta att fungera. Vi föreslår därför att du använder "as" när du skriver ny Python-kod som bara kommer att köras med 2.6.

source: :pep:`3110` - Catching Exceptions in Python 3000
sv: :pep:`3110` - Att fånga upp undantag i Python 3000

source: PEP written and implemented by Collin Winter.
sv: PEP skrivet och genomfört av Collin Winter.

source: PEP 3112: Byte Literals
sv: PEP 3112: Bytebokstäver

source: Python 3.0 adopts Unicode as the language's fundamental string type and denotes 8-bit literals differently, either as ``b'string'`` or using a :class:`bytes` constructor. For future compatibility, Python 2.6 adds :class:`bytes` as a synonym for the :class:`str` type, and it also supports the ``b''`` notation.
sv: Python 3.0 antar Unicode som språkets grundläggande strängtyp och betecknar 8-bitars literaler på olika sätt, antingen som ``b'string'`` eller med hjälp av en :class:`bytes`-konstruktor. För framtida kompatibilitet lägger Python 2.6 till :class:`bytes` som en synonym för typen :class:`str` och stöder även notationen ``b''``.

source: The 2.6 :class:`str` differs from 3.0's :class:`bytes` type in various ways; most notably, the constructor is completely different. In 3.0, ``bytes([65, 66, 67])`` is 3 elements long, containing the bytes representing ``ABC``; in 2.6, ``bytes([65, 66, 67])`` returns the 12-byte string representing the :func:`str` of the list.
sv: Typen 2.6 :class:`str` skiljer sig från 3.0:s :class:`bytes` på flera sätt; framför allt är konstruktören helt annorlunda. I 3.0 är ``bytes([65, 66, 67])`` 3 element lång och innehåller de byte som representerar ``ABC``; i 2.6 returnerar ``bytes([65, 66, 67])`` den 12-byte långa sträng som representerar listans :func:`str`.

source: The primary use of :class:`bytes` in 2.6 will be to write tests of object type such as ``isinstance(x, bytes)``. This will help the 2to3 converter, which can't tell whether 2.x code intends strings to contain either characters or 8-bit bytes; you can now use either :class:`bytes` or :class:`str` to represent your intention exactly, and the resulting code will also be correct in Python 3.0.
sv: Den primära användningen av :class:`bytes` i 2.6 kommer att vara att skriva tester av objekttyp som ``isinstance(x, bytes)``. Detta kommer att hjälpa 2to3-omvandlaren, som inte kan avgöra om 2.x-koden avser att strängar ska innehålla antingen tecken eller 8-bitars bytes; du kan nu använda antingen :class:`bytes` eller :class:`str` för att representera din avsikt exakt, och den resulterande koden kommer också att vara korrekt i Python 3.0.

source: There's also a ``__future__`` import that causes all string literals to become Unicode strings. This means that ``\u`` escape sequences can be used to include Unicode characters::
sv: Det finns också en ``__future__``-import som gör att alla stränglitteraler blir Unicode-strängar. Detta innebär att ```u`` escape-sekvenser kan användas för att inkludera Unicode-tecken::

source: At the C level, Python 3.0 will rename the existing 8-bit string type, called :c:type:`!PyStringObject` in Python 2.x, to :c:type:`PyBytesObject`. Python 2.6 uses ``#define`` to support using the names :c:func:`PyBytesObject`, :c:func:`PyBytes_Check`, :c:func:`PyBytes_FromStringAndSize`, and all the other functions and macros used with strings.
sv: På C-nivå kommer Python 3.0 att byta namn på den befintliga 8-bitars strängtypen, kallad :c:type:`!PyStringObject` i Python 2.x, till :c:type:`PyBytesObject`. Python 2.6 använder ``#define`` för att stödja användning av namnen :c:func:`PyBytesObject`, :c:func:`PyBytes_Check`, :c:func:`PyBytes_FromStringAndSize`, och alla andra funktioner och makron som används med strängar.

source: Instances of the :class:`bytes` type are immutable just as strings are. A new :class:`bytearray` type stores a mutable sequence of bytes::
sv: Instanser av typen :class:`bytes` är oföränderliga precis som strängar är. En ny typ av :class:`bytearray` lagrar en föränderlig sekvens av bytes::

source: Byte arrays support most of the methods of string types, such as :meth:`startswith`/:meth:`endswith`, :meth:`find`/:meth:`rfind`, and some of the methods of lists, such as :meth:`append`, :meth:`pop`, and :meth:`reverse`.
sv: Bytearrayer stöder de flesta av metoderna för strängtyper, t.ex. :meth:`startswith`/:meth:`endswith`, :meth:`find`/:meth:`rfind`, och några av metoderna för listor, t.ex. :meth:`append`, :meth:`pop` och :meth:`reverse`.

source: There's also a corresponding C API, with :c:func:`PyByteArray_FromObject`, :c:func:`PyByteArray_FromStringAndSize`, and various other functions.
sv: Det finns också ett motsvarande C API, med :c:func:`PyByteArray_FromObject`, :c:func:`PyByteArray_FromStringAndSize`, och diverse andra funktioner.

source: :pep:`3112` - Bytes literals in Python 3000
sv: :pep:`3112` - Byteslitteraler i Python 3000

source: PEP written by Jason Orendorff; backported to 2.6 by Christian Heimes.
sv: PEP skriven av Jason Orendorff; bakåtporterad till 2.6 av Christian Heimes.

source: PEP 3116: New I/O Library
sv: PEP 3116: Nytt I/O-bibliotek

source: Python's built-in file objects support a number of methods, but file-like objects don't necessarily support all of them. Objects that imitate files usually support :meth:`read` and :meth:`write`, but they may not support :meth:`readline`, for example. Python 3.0 introduces a layered I/O library in the :mod:`io` module that separates buffering and text-handling features from the fundamental read and write operations.
sv: Pythons inbyggda filobjekt har stöd för ett antal metoder, men filliknande objekt har inte nödvändigtvis stöd för alla. Objekt som imiterar filer stöder vanligtvis :meth:`read` och :meth:`write`, men de kanske inte stöder :meth:`readline`, till exempel. Python 3.0 introducerar ett skiktat I/O-bibliotek i modulen :mod:`io` som separerar buffrings- och texthanteringsfunktioner från de grundläggande läs- och skrivoperationerna.

source: There are three levels of abstract base classes provided by the :mod:`io` module:
sv: Det finns tre nivåer av abstrakta basklasser som tillhandahålls av modulen :mod:`io`:

source: :class:`RawIOBase` defines raw I/O operations: :meth:`read`, :meth:`readinto`, :meth:`write`, :meth:`seek`, :meth:`tell`, :meth:`truncate`, and :meth:`close`. Most of the methods of this class will often map to a single system call. There are also :meth:`readable`, :meth:`writable`, and :meth:`seekable` methods for determining what operations a given object will allow.
sv: :class:`RawIOBase` definierar råa I/O-operationer: :meth:`read`, :meth:`readinto`, :meth:`write`, :meth:`seek`, :meth:`tell`, :meth:`truncate` och :meth:`close`. De flesta metoderna i denna klass kommer ofta att motsvara ett enda systemanrop. Det finns också metoderna :meth:`readable`, :meth:`writable` och :meth:`seekable` för att avgöra vilka operationer ett visst objekt tillåter.

source: Python 3.0 has concrete implementations of this class for files and sockets, but Python 2.6 hasn't restructured its file and socket objects in this way.
sv: Python 3.0 har konkreta implementeringar av den här klassen för filer och sockets, men Python 2.6 har inte omstrukturerat sina fil- och socketobjekt på det här sättet.

source: :class:`BufferedIOBase` is an abstract base class that buffers data in memory to reduce the number of system calls used, making I/O processing more efficient. It supports all of the methods of :class:`RawIOBase`, and adds a :attr:`raw` attribute holding the underlying raw object.
sv: :class:`BufferedIOBase` är en abstrakt basklass som buffrar data i minnet för att minska antalet systemanrop som används, vilket gör I/O-bearbetning mer effektiv. Den stöder alla metoder i :class:`RawIOBase` och lägger till ett :attr:`raw`-attribut som innehåller det underliggande råobjektet.

source: There are five concrete classes implementing this ABC. :class:`BufferedWriter` and :class:`BufferedReader` are for objects that support write-only or read-only usage that have a :meth:`seek` method for random access. :class:`BufferedRandom` objects support read and write access upon the same underlying stream, and :class:`BufferedRWPair` is for objects such as TTYs that have both read and write operations acting upon unconnected streams of data. The :class:`BytesIO` class supports reading, writing, and seeking over an in-memory buffer.
sv: Det finns fem konkreta klasser som implementerar denna ABC. :class:`BufferedWriter` och :class:`BufferedReader` är för objekt som stöder skrivskyddad eller skrivskyddad användning som har en :meth:`seek`-metod för slumpmässig åtkomst. :class:`BufferedRandom`-objekt stöder läs- och skrivåtkomst på samma underliggande ström, och :class:`BufferedRWPair` är för objekt som TTYs som har både läs- och skrivoperationer som verkar på oanslutna dataströmmar. Klassen :class:`BytesIO` stöder läsning, skrivning och sökning över en buffert i minnet.

source: :class:`TextIOBase`: Provides functions for reading and writing strings (remember, strings will be Unicode in Python 3.0), and supporting :term:`universal newlines`. :class:`TextIOBase` defines the :meth:`readline` method and supports iteration upon objects.
sv: :class:`TextIOBase`: Innehåller funktioner för att läsa och skriva strängar (kom ihåg att strängar kommer att vara Unicode i Python 3.0), och stödjer :term:`universal newlines`. :class:`TextIOBase` definierar metoden :meth:`readline` och stödjer iteration på objekt.

source: There are two concrete implementations. :class:`TextIOWrapper` wraps a buffered I/O object, supporting all of the methods for text I/O and adding a :attr:`buffer` attribute for access to the underlying object. :class:`StringIO` simply buffers everything in memory without ever writing anything to disk.
sv: Det finns två konkreta implementeringar. :class:`TextIOWrapper` omsluter ett buffrat I/O-objekt, stöder alla metoder för text-I/O och lägger till ett :attr:`buffer`-attribut för åtkomst till det underliggande objektet. :class:`StringIO` buffrar helt enkelt allt i minnet utan att någonsin skriva något till disk.

source: (In Python 2.6, :class:`io.StringIO` is implemented in pure Python, so it's pretty slow. You should therefore stick with the existing :mod:`!StringIO` module or :mod:`!cStringIO` for now. At some point Python 3.0's :mod:`io` module will be rewritten into C for speed, and perhaps the C implementation will be backported to the 2.x releases.)
sv: (I Python 2.6 är :class:`io.StringIO` implementerad i ren Python, så den är ganska långsam. Du bör därför hålla dig till den befintliga :mod:`!StringIO`-modulen eller :mod:`!cStringIO` för tillfället. Vid någon tidpunkt kommer Python 3.0:s :mod:`io`-modul att skrivas om till C för att bli snabbare, och kanske kommer C-implementeringen att backporteras till 2.x-utgåvorna)

source: In Python 2.6, the underlying implementations haven't been restructured to build on top of the :mod:`io` module's classes. The module is being provided to make it easier to write code that's forward-compatible with 3.0, and to save developers the effort of writing their own implementations of buffering and text I/O.
sv: I Python 2.6 har de underliggande implementationerna inte omstrukturerats för att bygga vidare på :mod:`io`-modulens klasser. Modulen tillhandahålls för att göra det enklare att skriva kod som är framåtkompatibel med 3.0 och för att bespara utvecklare ansträngningen att skriva sina egna implementationer av buffring och text-I/O.

source: :pep:`3116` - New I/O
sv: :pep:`3116` - Ny I/O

source: PEP written by Daniel Stutzbach, Mike Verdone, and Guido van Rossum. Code by Guido van Rossum, Georg Brandl, Walter Doerwald, Jeremy Hylton, Martin von Löwis, Tony Lownds, and others.
sv: PEP skrivet av Daniel Stutzbach, Mike Verdone och Guido van Rossum. Kod av Guido van Rossum, Georg Brandl, Walter Doerwald, Jeremy Hylton, Martin von Löwis, Tony Lownds och andra.

source: PEP 3118: Revised Buffer Protocol
sv: PEP 3118: Reviderat buffertprotokoll
