Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: The :mod:`!asyncore` and :mod:`!asynchat` modules are being actively maintained again, and a number of patches and bugfixes were applied. (Maintained by Josiah Carlson; see :issue:`1736190` for one patch.)
sv: Modulerna :mod:`!asyncore` och :mod:`!asynchat` underhålls aktivt igen, och ett antal korrigeringar och buggfixar har införts. (Underhålls av Josiah Carlson; se :issue:`1736190` för en patch)

source: The :mod:`bsddb` module also has a new maintainer, Jesús Cea Avión, and the package is now available as a standalone package. The web page for the package is `www.jcea.es/programacion/pybsddb.htm <https://www.jcea.es/programacion/pybsddb.htm>`__. The plan is to remove the package from the standard library in Python 3.0, because its pace of releases is much more frequent than Python's.
sv: Modulen :mod:`bsddb` har också fått en ny underhållare, Jesús Cea Avión, och paketet finns nu tillgängligt som ett fristående paket. Webbsidan för paketet är `www.jcea.es/programacion/pybsddb.htm <https://www.jcea.es/programacion/pybsddb.htm>`__. Planen är att ta bort paketet från standardbiblioteket i Python 3.0, eftersom Python 3.0 har en mycket tätare utgivningstakt än Python.

source: The :mod:`bsddb.dbshelve` module now uses the highest pickling protocol available, instead of restricting itself to protocol 1. (Contributed by W. Barnes.)
sv: Modulen :mod:`bsddb.dbshelve` använder nu det högsta tillgängliga betningsprotokollet, istället för att begränsa sig till protokoll 1. (Bidrag från W. Barnes.)

source: The :mod:`!cgi` module will now read variables from the query string of an HTTP POST request. This makes it possible to use form actions with URLs that include query strings such as "/cgi-bin/add.py?category=1". (Contributed by Alexandre Fiori and Nubis; :issue:`1817`.)
sv: Modulen :mod:`!cgi` kan nu läsa variabler från frågesträngen i en HTTP POST-begäran. Detta gör det möjligt att använda formuläråtgärder med webbadresser som innehåller frågesträngar som "/cgi-bin/add.py?category=1". (Bidrag från Alexandre Fiori och Nubis; :issue:`1817`.)

source: The :func:`parse_qs` and :func:`parse_qsl` functions have been relocated from the :mod:`!cgi` module to the :mod:`urlparse <urllib.parse>` module. The versions still available in the :mod:`!cgi` module will trigger :exc:`PendingDeprecationWarning` messages in 2.6 (:issue:`600362`).
sv: Funktionerna :func:`parse_qs` och :func:`parse_qsl` har flyttats från modulen :mod:`!cgi` till modulen :mod:`urlparse <urllib.parse>`. De versioner som fortfarande finns tillgängliga i :mod:`!cgi`-modulen kommer att utlösa :exc:`PendingDeprecationWarning`-meddelanden i 2.6 (:issue:`600362`).

source: The :mod:`cmath` module underwent extensive revision, contributed by Mark Dickinson and Christian Heimes. Five new functions were added:
sv: Modulen :mod:`cmath` har genomgått en omfattande revidering, med bidrag från Mark Dickinson och Christian Heimes. Fem nya funktioner har lagts till:

source: :func:`polar` converts a complex number to polar form, returning the modulus and argument of the complex number.
sv: :func:`polar` konverterar ett komplext tal till polarform och returnerar modulus och argument för det komplexa talet.

source: :func:`rect` does the opposite, turning a modulus, argument pair back into the corresponding complex number.
sv: :func:`rect` gör tvärtom och förvandlar ett modulus-argumentpar tillbaka till motsvarande komplexa tal.

source: :func:`phase` returns the argument (also called the angle) of a complex number.
sv: :func:`phase` returnerar argumentet (även kallat vinkeln) för ett komplext tal.

source: :func:`isnan` returns True if either the real or imaginary part of its argument is a NaN.
sv: :func:`isnan` returnerar True om antingen den verkliga eller den imaginära delen av argumentet är ett NaN.

source: :func:`isinf` returns True if either the real or imaginary part of its argument is infinite.
sv: :func:`isinf` returnerar True om antingen den reella eller imaginära delen av dess argument är oändlig.

source: The revisions also improved the numerical soundness of the :mod:`cmath` module. For all functions, the real and imaginary parts of the results are accurate to within a few units of least precision (ulps) whenever possible. See :issue:`1381` for the details. The branch cuts for :func:`asinh`, :func:`atanh`: and :func:`atan` have also been corrected.
sv: Revideringarna har också förbättrat den numeriska tillförlitligheten hos modulen :mod:`cmath`. För alla funktioner är de reella och imaginära delarna av resultaten korrekta inom några få enheter av minsta precision (ulps) när så är möjligt. Se :issue:`1381` för detaljer. Grenavsnitten för :func:`asinh`, :func:`atanh`: och :func:`atan` har också korrigerats.

source: The tests for the module have been greatly expanded; nearly 2000 new test cases exercise the algebraic functions.
sv: Testerna för modulen har utökats kraftigt; nästan 2000 nya testfall tränar de algebraiska funktionerna.

source: On IEEE 754 platforms, the :mod:`cmath` module now handles IEEE 754 special values and floating-point exceptions in a manner consistent with Annex 'G' of the C99 standard.
sv: På IEEE 754-plattformar hanterar modulen :mod:`cmath` nu IEEE 754-specialvärden och undantag för flyttal på ett sätt som överensstämmer med Annex 'G' i C99-standarden.

source: A new data type in the :mod:`collections` module: ``namedtuple(typename, fieldnames)`` is a factory function that creates subclasses of the standard tuple whose fields are accessible by name as well as index. For example::
sv: En ny datatyp i modulen :mod:`collections`: ``namedtuple(typename, fieldnames)`` är en fabriksfunktion som skapar underklasser av standardtupeln vars fält är tillgängliga via namn såväl som index. Till exempel::

source: >>> var_type = collections.namedtuple('variable', ... 'id name type size') >>> # Names are separated by spaces or commas. >>> # 'id, name, type, size' would also work. >>> var_type._fields ('id', 'name', 'type', 'size') >>> var = var_type(1, 'frequency', 'int', 4) >>> print var[0], var.id # Equivalent 1 1 >>> print var[2], var.type # Equivalent int int >>> var._asdict() {'size': 4, 'type': 'int', 'id': 1, 'name': 'frequency'} >>> v2 = var._replace(name='amplitude') >>> v2 variable(id=1, name='amplitude', type='int', size=4)
sv: >>> var_type = collections.namedtuple('variabel', ... 'id namn typ storlek') >>> # Namnen separeras med mellanslag eller kommatecken. >>> # 'id, name, type, size' skulle också fungera. >>> var_typ._fält ('id', 'namn', 'typ', 'storlek') >>> var = var_type(1, 'frequency', 'int', 4) >>> print var[0], var.id # Likvärdig 1 1 >>> print var[2], var.type # Ekvivalent int int >>> var._asdict() {'size': 4, 'type': 'int', 'id': 1, 'name': 'frekvens'} >>> v2 = var._replace(name='amplitud') >>> v2 variabel(id=1, name='amplitud', type='int', size=4)

source: Several places in the standard library that returned tuples have been modified to return :func:`namedtuple` instances. For example, the :meth:`Decimal.as_tuple` method now returns a named tuple with :attr:`sign`, :attr:`digits`, and :attr:`exponent` fields.
sv: Flera ställen i standardbiblioteket som returnerade tuplar har ändrats till att returnera :func:`namedtuple`-instanser. Till exempel returnerar metoden :meth:`Decimal.as_tuple` nu en namngiven tupel med fälten :attr:`sign`, :attr:`digits` och :attr:`exponent`.

source: Another change to the :mod:`collections` module is that the :class:`deque` type now supports an optional *maxlen* parameter; if supplied, the deque's size will be restricted to no more than *maxlen* items. Adding more items to a full deque causes old items to be discarded.
sv: En annan förändring i modulen :mod:`collections` är att typen :class:`deque` nu har stöd för en valfri parameter *maxlen*; om den anges kommer deques storlek att begränsas till högst *maxlen* objekt. Om du lägger till fler objekt i en full deque kommer gamla objekt att kasseras.

source: The :mod:`Cookie <http.cookies>` module's :class:`~http.cookies.Morsel` objects now support an :attr:`~http.cookies.Morsel.httponly` attribute. In some browsers. cookies with this attribute set cannot be accessed or manipulated by JavaScript code. (Contributed by Arvin Schnell; :issue:`1638033`.)
sv: Modulen :mod:`Cookie <http.cookies>` :class:`~http.cookies.Morsel`-objekt har nu stöd för attributet :attr:`~http.cookies.Morsel.httponly`. I vissa webbläsare kan cookies med detta attribut inte nås eller manipuleras av JavaScript-kod. (Bidrag från Arvin Schnell; :issue:`1638033`.)

source: A new window method in the :mod:`curses` module, :meth:`chgat`, changes the display attributes for a certain number of characters on a single line. (Contributed by Fabian Kreutz.)
sv: En ny fönstermetod i modulen :mod:`curses`, :meth:`chgat`, ändrar visningsattributen för ett visst antal tecken på en rad. (Bidrag från Fabian Kreutz.)

source: # Boldface text starting at y=0,x=21 # and affecting the rest of the line. stdscr.chgat(0, 21, curses.A_BOLD)
sv: # Text i fetstil som börjar vid y=0,x=21 # och påverkar resten av raden. stdscr.chgat(0, 21, curses.A_BOLD)

source: The :class:`Textbox` class in the :mod:`curses.textpad` module now supports editing in insert mode as well as overwrite mode. Insert mode is enabled by supplying a true value for the *insert_mode* parameter when creating the :class:`Textbox` instance.
sv: Klassen :class:`Textbox` i modulen :mod:`curses.textpad` stöder nu redigering i både infogningsläge och överskrivningsläge. Insert-läget aktiveras genom att ange ett true-värde för parametern *insert_mode* när :class:`Textbox`-instansen skapas.

source: The :mod:`datetime` module's :meth:`strftime` methods now support a ``%f`` format code that expands to the number of microseconds in the object, zero-padded on the left to six places. (Contributed by Skip Montanaro; :issue:`1158`.)
sv: :mod:`datetime`-modulens :meth:`strftime`-metoder stöder nu en ``%f``-formatkod som expanderar till antalet mikrosekunder i objektet, nolladderad till vänster till sex platser. (Bidrag från Skip Montanaro; :issue:`1158`.)

source: The :mod:`decimal` module was updated to version 1.66 of `the General Decimal Specification <https://speleotrove.com/decimal/decarith.html>`__. New features include some methods for some basic mathematical functions such as :meth:`exp` and :meth:`log10`::
sv: Modulen :mod:`decimal` uppdaterades till version 1.66 av `the General Decimal Specification <https://speleotrove.com/decimal/decarith.html>`__. Nya funktioner inkluderar några metoder för några grundläggande matematiska funktioner som :meth:`exp` och :meth:`log10`::

source: The :meth:`as_tuple` method of :class:`Decimal` objects now returns a named tuple with :attr:`sign`, :attr:`digits`, and :attr:`exponent` fields.
sv: Metoden :meth:`as_tuple` för :class:`Decimal`-objekt returnerar nu en namngiven tuple med fälten :attr:`sign`, :attr:`digits` och :attr:`exponent`.

source: (Implemented by Facundo Batista and Mark Dickinson. Named tuple support added by Raymond Hettinger.)
sv: (Implementerad av Facundo Batista och Mark Dickinson. Stöd för namngivna tuplar tillagt av Raymond Hettinger.)

source: The :mod:`difflib` module's :class:`SequenceMatcher` class now returns named tuples representing matches, with :attr:`a`, :attr:`b`, and :attr:`size` attributes. (Contributed by Raymond Hettinger.)
sv: Klassen :class:`SequenceMatcher` i modulen :mod:`difflib` returnerar nu namngivna tuples som representerar matchningar, med attributen :attr:`a`, :attr:`b` och :attr:`size`. (Bidrag från Raymond Hettinger.)

source: An optional ``timeout`` parameter, specifying a timeout measured in seconds, was added to the :class:`ftplib.FTP` class constructor as well as the :meth:`connect` method. (Added by Facundo Batista.) Also, the :class:`FTP` class's :meth:`storbinary` and :meth:`storlines` now take an optional *callback* parameter that will be called with each block of data after the data has been sent. (Contributed by Phil Schwartz; :issue:`1221598`.)
sv: En valfri parameter ``timeout``, som anger en timeout mätt i sekunder, har lagts till i :class:`ftplib.FTP`-klassens konstruktor samt i metoden :meth:`connect`. (Tillagt av Facundo Batista.) Dessutom tar :class:`FTP`-klassens :meth:`storbinary` och :meth:`storlines` nu en valfri *callback*-parameter som kommer att anropas med varje datablock efter att data har skickats. (Bidrag från Phil Schwartz; :issue:`1221598`.)

source: The :func:`reduce` built-in function is also available in the :mod:`functools` module. In Python 3.0, the builtin has been dropped and :func:`reduce` is only available from :mod:`functools`; currently there are no plans to drop the builtin in the 2.x series. (Patched by Christian Heimes; :issue:`1739906`.)
sv: Den inbyggda funktionen :func:`reduce` finns också i modulen :mod:`functools`. I Python 3.0 har den inbyggda funktionen tagits bort och :func:`reduce` är endast tillgänglig från :mod:`functools`; för närvarande finns det inga planer på att ta bort den inbyggda funktionen i 2.x-serien. (Patchad av Christian Heimes; :issue:`1739906`.)

source: When possible, the :mod:`getpass` module will now use :file:`/dev/tty` to print a prompt message and read the password, falling back to standard error and standard input. If the password may be echoed to the terminal, a warning is printed before the prompt is displayed. (Contributed by Gregory P. Smith.)
sv: När det är möjligt kommer modulen :mod:`getpass` nu att använda :file:`/dev/tty` för att skriva ut ett promptmeddelande och läsa lösenordet, med återkoppling till standardfel och standardinmatning. Om lösenordet kan ekas till terminalen skrivs en varning ut innan prompten visas. (Bidrag från Gregory P. Smith.)

source: The :func:`glob.glob` function can now return Unicode filenames if a Unicode path was used and Unicode filenames are matched within the directory. (:issue:`1001604`)
sv: Funktionen :func:`glob.glob` kan nu returnera Unicode-filnamn om en Unicode-sökväg användes och Unicode-filnamn matchas inom katalogen. (:issue:`1001604`)

source: A new function in the :mod:`heapq` module, ``merge(iter1, iter2, ...)``, takes any number of iterables returning data in sorted order, and returns a new generator that returns the contents of all the iterators, also in sorted order. For example::
sv: En ny funktion i modulen :mod:`heapq`, ``merge(iter1, iter2, ...)``, tar ett valfritt antal iteratorer som returnerar data i sorterad ordning och returnerar en ny generator som returnerar innehållet i alla iteratorer, också i sorterad ordning. Till exempel::

source: Another new function, ``heappushpop(heap, item)``, pushes *item* onto *heap*, then pops off and returns the smallest item. This is more efficient than making a call to :func:`heappush` and then :func:`heappop`.
sv: En annan ny funktion, ``heappushpop(heap, item)``, skjuter *item* till *heap*, sedan popar den upp och returnerar det minsta objektet. Detta är mer effektivt än att göra ett anrop till :func:`heappush` och sedan :func:`heappop`.

source: :mod:`heapq` is now implemented to only use less-than comparison, instead of the less-than-or-equal comparison it previously used. This makes :mod:`heapq`'s usage of a type match the :meth:`list.sort` method. (Contributed by Raymond Hettinger.)
sv: :mod:`heapq` är nu implementerad för att endast använda mindre-än jämförelse, istället för mindre-än-eller-lika jämförelse som den tidigare använde. Detta gör att :mod:`heapq` användning av en typ matchar metoden :meth:`list.sort`. (Bidrag från Raymond Hettinger.)

source: An optional ``timeout`` parameter, specifying a timeout measured in seconds, was added to the :class:`httplib.HTTPConnection <http.client.HTTPConnection>` and :class:`HTTPSConnection <http.client.HTTPSConnection>` class constructors. (Added by Facundo Batista.)
sv: En valfri parameter ``timeout``, som anger en timeout mätt i sekunder, lades till i klasskonstruktörerna :class:`httplib.HTTPConnection <http.client.HTTPConnection>` och :class:`HTTPSConnection <http.client.HTTPSConnection>`. (Tillagd av Facundo Batista.)

source: Most of the :mod:`inspect` module's functions, such as :func:`getmoduleinfo` and :func:`getargs`, now return named tuples. In addition to behaving like tuples, the elements of the return value can also be accessed as attributes. (Contributed by Raymond Hettinger.)
sv: De flesta av :mod:`inspect`-modulens funktioner, till exempel :func:`getmoduleinfo` och :func:`getargs`, returnerar nu namngivna tupler. Förutom att de beter sig som tupler kan elementen i returvärdet också nås som attribut. (Bidrag från Raymond Hettinger.)

source: Some new functions in the module include :func:`isgenerator`, :func:`isgeneratorfunction`, and :func:`isabstract`.
sv: Några nya funktioner i modulen är :func:`isgenerator`, :func:`isgeneratorfunction` och :func:`isabstract`.

source: The :mod:`itertools` module gained several new functions.
sv: Modulen :mod:`itertools` har fått flera nya funktioner.

source: ``izip_longest(iter1, iter2, ...[, fillvalue])`` makes tuples from each of the elements; if some of the iterables are shorter than others, the missing values are set to *fillvalue*. For example::
sv: ``izip_longest(iter1, iter2, ...[, fillvalue])`` skapar tupler av varje element; om några av iterablerna är kortare än andra sätts de saknade värdena till *fillvalue*. Till exempel::

source: >>> tuple(itertools.izip_longest([1,2,3], [1,2,3,4,5])) ((1, 1), (2, 2), (3, 3), (None, 4), (None, 5))
sv: >>> tuple(itertools.izip_longest([1,2,3], [1,2,3,4,5])) ((1, 1), (2, 2), (3, 3), (Ingen, 4), (Ingen, 5))

source: ``product(iter1, iter2, ..., [repeat=N])`` returns the Cartesian product of the supplied iterables, a set of tuples containing every possible combination of the elements returned from each iterable. ::
sv: ``product(iter1, iter2, ..., [repeat=N])`` returnerar den kartesiska produkten av de angivna iterablerna, en uppsättning tuples som innehåller alla möjliga kombinationer av de element som returneras från varje iterabel. ::

source: The optional *repeat* keyword argument is used for taking the product of an iterable or a set of iterables with themselves, repeated *N* times. With a single iterable argument, *N*-tuples are returned::
sv: Det valfria nyckelordsargumentet *repeat* används för att ta produkten av en iterabel eller en uppsättning iterabler med sig själva, upprepade *N* gånger. Med ett enda iterabelargument returneras *N*-tuples::

source: With two iterables, *2N*-tuples are returned. ::
sv: Med två iterabler returneras *2N*-tuples. ::

source: ``combinations(iterable, r)`` returns sub-sequences of length *r* from the elements of *iterable*. ::
sv: ``combinations(iterable, r)`` returnerar undersekvenser med längden *r* från elementen i *iterable*. ::

source: >>> list(itertools.combinations('123', 2)) [('1', '2'), ('1', '3'), ('2', '3')] >>> list(itertools.combinations('123', 3)) [('1', '2', '3')] >>> list(itertools.combinations('1234', 3)) [('1', '2', '3'), ('1', '2', '4'), ('1', '3', '4'), ('2', '3', '4')]
sv: >>> list(itertools.kombinationer('123', 2)) [('1', '2'), ('1', '3'), ('2', '3')] >>> list(itertools.kombinationer('123', 3)) [('1', '2', '3')] >>> lista(itertools.kombinationer('1234', 3)) [('1', '2', '3'), ('1', '2', '4'), ('1', '3', '4'), ('2', '3', '4')]

source: ``permutations(iter[, r])`` returns all the permutations of length *r* of the iterable's elements. If *r* is not specified, it will default to the number of elements produced by the iterable. ::
sv: ``permutations(iter[, r])`` returnerar alla permutationer av längden *r* av iterabelns element. Om *r* inte anges, kommer det att vara standardvärdet för antalet element som produceras av iterabeln. ::

source: >>> list(itertools.permutations([1,2,3,4], 2)) [(1, 2), (1, 3), (1, 4), (2, 1), (2, 3), (2, 4), (3, 1), (3, 2), (3, 4), (4, 1), (4, 2), (4, 3)]
sv: >>> list(itertools.permutationer([1,2,3,4], 2)) [(1, 2), (1, 3), (1, 4), (2, 1), (2, 3), (2, 4), (3, 1), (3, 2), (3, 4), (4, 1), (4, 2), (4, 3)]

source: ``itertools.chain(*iterables)`` is an existing function in :mod:`itertools` that gained a new constructor in Python 2.6. ``itertools.chain.from_iterable(iterable)`` takes a single iterable that should return other iterables. :func:`chain` will then return all the elements of the first iterable, then all the elements of the second, and so on. ::
sv: ``itertools.chain(*iterables)`` är en befintlig funktion i :mod:`itertools` som fick en ny konstruktör i Python 2.6. ``itertools.chain.from_iterable(iterable)`` tar en enda iterable som ska returnera andra iterables. :func:`chain` kommer då att returnera alla element i den första iterable, sedan alla element i den andra, och så vidare:

source: (All contributed by Raymond Hettinger.)
sv: (Alla bidrag från Raymond Hettinger.)

source: The :mod:`logging` module's :class:`FileHandler` class and its subclasses :class:`WatchedFileHandler`, :class:`RotatingFileHandler`, and :class:`TimedRotatingFileHandler` now have an optional *delay* parameter to their constructors. If *delay* is true, opening of the log file is deferred until the first :meth:`emit` call is made. (Contributed by Vinay Sajip.)
sv: Modulen :mod:`logging`:s klass :class:`FileHandler` och dess underklasser :class:`WatchedFileHandler`, :class:`RotatingFileHandler` och :class:`TimedRotatingFileHandler` har nu en valfri *delay*-parameter i sina konstruktörer. Om *delay* är true, skjuts öppningen av loggfilen upp tills det första :meth:`emit`-anropet görs. (Bidrag från Vinay Sajip.)

source: :class:`TimedRotatingFileHandler` also has a *utc* constructor parameter. If the argument is true, UTC time will be used in determining when midnight occurs and in generating filenames; otherwise local time will be used.
sv: :class:`TimedRotatingFileHandler` har också en *utc*-konstruktorparameter. Om argumentet är sant kommer UTC-tid att användas för att bestämma när midnatt inträffar och för att generera filnamn; annars kommer lokal tid att användas.

source: Several new functions were added to the :mod:`math` module:
sv: Flera nya funktioner har lagts till i modulen :mod:`math`:

source: :func:`~math.isinf` and :func:`~math.isnan` determine whether a given float is a (positive or negative) infinity or a NaN (Not a Number), respectively.
sv: :func:`~math.isinf` och :func:`~math.isnan` avgör om ett givet flyttal är en (positiv eller negativ) oändlighet respektive ett NaN (Not a Number).

source: :func:`~math.copysign` copies the sign bit of an IEEE 754 number, returning the absolute value of *x* combined with the sign bit of *y*. For example, ``math.copysign(1, -0.0)`` returns -1.0. (Contributed by Christian Heimes.)
sv: :func:`~math.copysign` kopierar teckenbiten i ett IEEE 754-tal och returnerar det absoluta värdet av *x* kombinerat med teckenbiten i *y*. Till exempel, ``math.copysign(1, -0.0)`` returnerar -1.0. (Bidrag från Christian Heimes.)

source: :func:`~math.factorial` computes the factorial of a number. (Contributed by Raymond Hettinger; :issue:`2138`.)
sv: :func:`~math.factorial` beräknar faktorn av ett tal. (Bidrag från Raymond Hettinger; :issue:`2138`.)

source: :func:`~math.fsum` adds up the stream of numbers from an iterable, and is careful to avoid loss of precision through using partial sums. (Contributed by Jean Brouwers, Raymond Hettinger, and Mark Dickinson; :issue:`2819`.)
sv: :func:`~math.fsum` adderar talflödet från en iterabel och är noga med att undvika precisionsförlust genom att använda partiella summor. (Bidrag från Jean Brouwers, Raymond Hettinger och Mark Dickinson; :issue:`2819`.)

source: :func:`~math.acosh`, :func:`~math.asinh` and :func:`~math.atanh` compute the inverse hyperbolic functions.
sv: :func:`~math.acosh`, :func:`~math.asinh` och :func:`~math.atanh` beräknar de inversa hyperboliska funktionerna.
