Repository: yeager/python-docs-sv
Catalog: whatsnew/2.6.po
Languages: sv

source: The buffer protocol is a C-level API that lets Python types exchange pointers into their internal representations. A memory-mapped file can be viewed as a buffer of characters, for example, and this lets another module such as :mod:`re` treat memory-mapped files as a string of characters to be searched.
sv: Buffertprotokollet är ett API på C-nivå som låter Python-typer utbyta pekare till sina interna representationer. En minnesmappad fil kan till exempel ses som en buffert med tecken, och detta gör att en annan modul som :mod:`re` kan behandla minnesmappade filer som en sträng med tecken som ska sökas.

source: The primary users of the buffer protocol are numeric-processing packages such as NumPy, which expose the internal representation of arrays so that callers can write data directly into an array instead of going through a slower API. This PEP updates the buffer protocol in light of experience from NumPy development, adding a number of new features such as indicating the shape of an array or locking a memory region.
sv: De primära användarna av buffertprotokollet är numeriska bearbetningspaket som NumPy, som exponerar den interna representationen av matriser så att anropare kan skriva data direkt till en matris istället för att gå igenom ett långsammare API. Denna PEP uppdaterar buffertprotokollet mot bakgrund av erfarenheterna från NumPy-utvecklingen och lägger till ett antal nya funktioner som att ange formen på en array eller låsa en minnesregion.

source: The most important new C API function is ``PyObject_GetBuffer(PyObject *obj, Py_buffer *view, int flags)``, which takes an object and a set of flags, and fills in the ``Py_buffer`` structure with information about the object's memory representation. Objects can use this operation to lock memory in place while an external caller could be modifying the contents, so there's a corresponding ``PyBuffer_Release(Py_buffer *view)`` to indicate that the external caller is done.
sv: Den viktigaste nya C API-funktionen är ``PyObject_GetBuffer(PyObject *obj, Py_buffer *view, int flags)``, som tar ett objekt och en uppsättning flaggor och fyller i ``Py_buffer``-strukturen med information om objektets minnesrepresentation. Objekt kan använda denna operation för att låsa minnet på plats medan en extern anropare kan ändra innehållet, så det finns en motsvarande ``PyBuffer_Release(Py_buffer *view)`` för att indikera att den externa anroparen är klar.

source: The *flags* argument to :c:func:`PyObject_GetBuffer` specifies constraints upon the memory returned. Some examples are:
sv: Argumentet *flags* till :c:func:`PyObject_GetBuffer` anger begränsningar för det minne som returneras. Några exempel är:

source: :c:macro:`PyBUF_WRITABLE` indicates that the memory must be writable.
sv: :c:macro:`PyBUF_WRITABLE` anger att minnet måste vara skrivbart.

source: :c:macro:`PyBUF_LOCK` requests a read-only or exclusive lock on the memory.
sv: :c:macro:`PyBUF_LOCK` begär ett skrivskyddat eller exklusivt lås på minnet.

source: :c:macro:`PyBUF_C_CONTIGUOUS` and :c:macro:`PyBUF_F_CONTIGUOUS` requests a C-contiguous (last dimension varies the fastest) or Fortran-contiguous (first dimension varies the fastest) array layout.
sv: :c:macro:`PyBUF_C_CONTIGUOUS` och :c:macro:`PyBUF_F_CONTIGUOUS` begär en C-sluten (sista dimensionen varierar snabbast) eller Fortran-sluten (första dimensionen varierar snabbast) array-layout.

source: Two new argument codes for :c:func:`PyArg_ParseTuple`, ``s*`` and ``z*``, return locked buffer objects for a parameter.
sv: Två nya argumentkoder för :c:func:`PyArg_ParseTuple`, ``s*`` och ``z*``, returnerar låsta buffertobjekt för en parameter.

source: :pep:`3118` - Revising the buffer protocol
sv: :pep:`3118` - Revidering av buffertprotokollet

source: PEP written by Travis Oliphant and Carl Banks; implemented by Travis Oliphant.
sv: PEP skriven av Travis Oliphant och Carl Banks; implementerad av Travis Oliphant.

source: PEP 3119: Abstract Base Classes
sv: PEP 3119: Abstrakta basklasser

source: Some object-oriented languages such as Java support interfaces, declaring that a class has a given set of methods or supports a given access protocol. Abstract Base Classes (or ABCs) are an equivalent feature for Python. The ABC support consists of an :mod:`abc` module containing a metaclass called :class:`ABCMeta`, special handling of this metaclass by the :func:`isinstance` and :func:`issubclass` builtins, and a collection of basic ABCs that the Python developers think will be widely useful. Future versions of Python will probably add more ABCs.
sv: Vissa objektorienterade språk som Java stöder gränssnitt, som deklarerar att en klass har en viss uppsättning metoder eller stöder ett visst åtkomstprotokoll. Abstract Base Classes (eller ABC) är en motsvarande funktion för Python. ABC-stödet består av en :mod:`abc`-modul som innehåller en metaklass som heter :class:`ABCMeta`, specialhantering av denna metaklass av :func:`isinstance` och :func:`issubclass` builtins, och en samling grundläggande ABC som Python-utvecklarna tror kommer att vara allmänt användbara. Framtida versioner av Python kommer förmodligen att lägga till fler ABC.

source: Let's say you have a particular class and wish to know whether it supports dictionary-style access. The phrase "dictionary-style" is vague, however. It probably means that accessing items with ``obj[1]`` works. Does it imply that setting items with ``obj[2] = value`` works? Or that the object will have :meth:`keys`, :meth:`values`, and :meth:`items` methods? What about the iterative variants such as :meth:`iterkeys`? :meth:`copy` and :meth:`update`? Iterating over the object with :func:`iter`?
sv: Låt oss säga att du har en viss klass och vill veta om den stöder åtkomst i ordboksstil. Uttrycket "dictionary-style" är dock vagt. Det betyder förmodligen att åtkomst till objekt med ``obj[1]`` fungerar. Innebär det att det fungerar att ställa in objekt med ``obj[2] = value``? Eller att objektet kommer att ha metoderna :meth:`keys`, :meth:`values` och :meth:`items`? Hur är det med de iterativa varianterna som :meth:`iterkeys`? :meth:`copy` och :meth:`update`? Iteration över objektet med :func:`iter`?

source: The Python 2.6 :mod:`collections` module includes a number of different ABCs that represent these distinctions. :class:`Iterable` indicates that a class defines :meth:`__iter__`, and :class:`Container` means the class defines a :meth:`__contains__` method and therefore supports ``x in y`` expressions. The basic dictionary interface of getting items, setting items, and :meth:`keys`, :meth:`values`, and :meth:`items`, is defined by the :class:`MutableMapping` ABC.
sv: Python 2.6 :mod:`collections`-modulen innehåller ett antal olika ABC som representerar dessa distinktioner. :class:`Iterable` indikerar att en klass definierar :meth:`__iter__`, och :class:`Container` betyder att klassen definierar en :meth:`__contains__`-metod och därför stöder ``x i y``-uttryck. Det grundläggande ordboksgränssnittet för att hämta objekt, ställa in objekt och :meth:`keys`, :meth:`values` och :meth:`items` definieras av :class:`MutableMapping` ABC.

source: You can derive your own classes from a particular ABC to indicate they support that ABC's interface::
sv: Du kan härleda dina egna klasser från en viss ABC för att ange att de stöder den ABC:s gränssnitt::

source: Alternatively, you could write the class without deriving from the desired ABC and instead register the class by calling the ABC's :meth:`register` method::
sv: Alternativt kan man skriva klassen utan att härleda från önskad ABC och istället registrera klassen genom att anropa ABC:s :meth:`register`-metod::

source: For classes that you write, deriving from the ABC is probably clearer. The :meth:`register` method is useful when you've written a new ABC that can describe an existing type or class, or if you want to declare that some third-party class implements an ABC. For example, if you defined a :class:`PrintableType` ABC, it's legal to do::
sv: För klasser som du skriver är det förmodligen tydligare att härleda från ABC. Metoden :meth:`register` är användbar när du har skrivit en ny ABC som kan beskriva en befintlig typ eller klass, eller om du vill deklarera att en klass från tredje part implementerar en ABC. Om du till exempel har definierat en :class:`PrintableType` ABC, är det lagligt att göra::

source: # Register Python's types PrintableType.register(int) PrintableType.register(float) PrintableType.register(str)
sv: # Registrera Pythons typer PrintableType.register(int) PrintableType.register(float) PrintableType.register(str)

source: Classes should obey the semantics specified by an ABC, but Python can't check this; it's up to the class author to understand the ABC's requirements and to implement the code accordingly.
sv: Klasser bör följa den semantik som anges av en ABC, men Python kan inte kontrollera detta; det är upp till klassens författare att förstå ABC:s krav och att implementera koden i enlighet därmed.

source: To check whether an object supports a particular interface, you can now write::
sv: För att kontrollera om ett objekt stöder ett visst gränssnitt kan du nu skriva::

source: def func(d): if not isinstance(d, collections.MutableMapping): raise ValueError("Mapping object expected, not %r" % d)
sv: def func(d): if not isinstance(d, collections.MutableMapping): raise ValueError("Mapping-objekt förväntat, inte %r" % d)

source: Don't feel that you must now begin writing lots of checks as in the above example. Python has a strong tradition of duck-typing, where explicit type-checking is never done and code simply calls methods on an object, trusting that those methods will be there and raising an exception if they aren't. Be judicious in checking for ABCs and only do it where it's absolutely necessary.
sv: Känn inte att du nu måste börja skriva massor av kontroller som i exemplet ovan. Python har en stark tradition av duck-typing, där explicit typkontroll aldrig görs och koden helt enkelt anropar metoder på ett objekt, litar på att dessa metoder kommer att finnas där och gör ett undantag om de inte gör det. Var försiktig med att kontrollera ABC och gör det bara där det är absolut nödvändigt.

source: You can write your own ABCs by using ``abc.ABCMeta`` as the metaclass in a class definition::
sv: Du kan skriva din egen ABC genom att använda ``abc.ABCMeta`` som metaklass i en klassdefinition::

source: In the :class:`Drawable` ABC above, the :meth:`draw_doubled` method renders the object at twice its size and can be implemented in terms of other methods described in :class:`Drawable`. Classes implementing this ABC therefore don't need to provide their own implementation of :meth:`draw_doubled`, though they can do so. An implementation of :meth:`draw` is necessary, though; the ABC can't provide a useful generic implementation.
sv: I :class:`Drawable` ABC ovan renderar :meth:`draw_doubled` metoden objektet i dubbel storlek och kan implementeras i termer av andra metoder som beskrivs i :class:`Drawable`. Klasser som implementerar denna ABC behöver därför inte tillhandahålla sin egen implementation av :meth:`draw_doubled`, även om de kan göra det. En implementation av :meth:`draw` är dock nödvändig; ABC kan inte tillhandahålla en användbar generisk implementation.

source: You can apply the ``@abstractmethod`` decorator to methods such as :meth:`draw` that must be implemented; Python will then raise an exception for classes that don't define the method. Note that the exception is only raised when you actually try to create an instance of a subclass lacking the method::
sv: Du kan använda dekoratorn ``@abstractmethod`` på metoder som :meth:`draw` som måste implementeras; Python kommer då att göra ett undantag för klasser som inte definierar metoden. Observera att undantaget bara uppstår när du faktiskt försöker skapa en instans av en underklass som saknar metoden::

source: >>> class Circle(Drawable): ... pass ... >>> c = Circle() Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: Can't instantiate abstract class Circle with abstract methods draw >>>
sv: &gt;&gt;&gt; klass Cirkel(Ritbar): ... pass ... &gt;&gt;&gt; c = Cirkel() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError (Typfel): Kan inte instansiera den abstrakta klassen Circle med abstrakta metoder draw &gt;&gt;&gt

source: Abstract data attributes can be declared using the ``@abstractproperty`` decorator::
sv: Abstrakta dataattribut kan deklareras med hjälp av dekoratorn ``@abstractproperty``::

source: from abc import abstractproperty ... @abstractproperty def readonly(self): return self._x
sv: från abc import abstractproperty ... @abstraktegenskap def readonly(self): returnera self._x

source: Subclasses must then define a :meth:`readonly` property.
sv: Subklasser måste sedan definiera en :meth:`readonly`-egenskap.

source: :pep:`3119` - Introducing Abstract Base Classes
sv: :pep:`3119` - Introduktion av abstrakta basklasser

source: PEP written by Guido van Rossum and Talin. Implemented by Guido van Rossum. Backported to 2.6 by Benjamin Aranguren, with Alex Martelli.
sv: PEP skriven av Guido van Rossum och Talin. Implementerad av Guido van Rossum. Backporterad till 2.6 av Benjamin Aranguren, med Alex Martelli.

source: PEP 3127: Integer Literal Support and Syntax
sv: PEP 3127: Stöd för heltalsbokstäver och syntax

source: Python 3.0 changes the syntax for octal (base-8) integer literals, prefixing them with "0o" or "0O" instead of a leading zero, and adds support for binary (base-2) integer literals, signalled by a "0b" or "0B" prefix.
sv: Python 3.0 ändrar syntaxen för oktala (bas-8) heltalslitteraler, som prefixas med "0o" eller "0O" istället för en ledande nolla, och lägger till stöd för binära (bas-2) heltalslitteraler, som signaleras med prefixet "0b" eller "0B".

source: Python 2.6 doesn't drop support for a leading 0 signalling an octal number, but it does add support for "0o" and "0b"::
sv: Python 2.6 släpper inte stödet för ett ledande 0 som signalerar ett oktalt tal, men det lägger till stöd för "0o" och "0b"::

source: The :func:`oct` builtin still returns numbers prefixed with a leading zero, and a new :func:`bin` builtin returns the binary representation for a number::
sv: Inbyggnadsrutinen :func:`oct` returnerar fortfarande tal med en inledande nolla och den nya inbyggnadsrutinen :func:`bin` returnerar den binära representationen för ett tal::

source: >>> oct(42) '052' >>> future_builtins.oct(42) '0o52' >>> bin(173) '0b10101101'
sv: >>> okt(42) '052' >>> future_builtins.oct(42) '0o52' >>> bin(173) '0b10101101'

source: The :func:`int` and :func:`long` builtins will now accept the "0o" and "0b" prefixes when base-8 or base-2 are requested, or when the *base* argument is zero (signalling that the base used should be determined from the string)::
sv: Inbyggnaderna :func:`int` och :func:`long` accepterar nu prefixen "0o" och "0b" när bas-8 eller bas-2 begärs, eller när argumentet *base* är noll (vilket signalerar att den bas som används ska bestämmas från strängen)::

source: :pep:`3127` - Integer Literal Support and Syntax
sv: :pep:`3127` - Stöd för heltalsbokstäver och syntax

source: PEP written by Patrick Maupin; backported to 2.6 by Eric Smith.
sv: PEP skriven av Patrick Maupin; bakåtporterad till 2.6 av Eric Smith.

source: PEP 3129: Class Decorators
sv: PEP 3129: Klassdekoratörer

source: Decorators have been extended from functions to classes. It's now legal to write::
sv: Decorators har utökats från funktioner till klasser. Det är nu lagligt att skriva::

source: @foo @bar class A: pass
sv: @foo @bar klass A: pass

source: This is equivalent to::
sv: Detta är likvärdigt med::

source: class A: pass A = foo(bar(A))
sv: klass A: pass A = foo(bar(A))

source: :pep:`3129` - Class Decorators
sv: :pep:`3129` - Klassdekoratorer

source: PEP written by Collin Winter.
sv: PEP skriven av Collin Winter.

source: PEP 3141: A Type Hierarchy for Numbers
sv: PEP 3141: En typhierarki för siffror

source: Python 3.0 adds several abstract base classes for numeric types inspired by Scheme's numeric tower. These classes were backported to 2.6 as the :mod:`numbers` module.
sv: Python 3.0 lägger till flera abstrakta basklasser för numeriska typer inspirerade av Scheme's numeriska torn. Dessa klasser bakåtporterades till 2.6 som modulen :mod:`numbers`.

source: The most general ABC is :class:`Number`. It defines no operations at all, and only exists to allow checking if an object is a number by doing ``isinstance(obj, Number)``.
sv: Den mest generella ABC:en är :class:`Number`. Den definierar inga operationer alls och existerar bara för att man ska kunna kontrollera om ett objekt är ett tal genom att göra ``isinstance(obj, Number)``.

source: :class:`Complex` is a subclass of :class:`Number`. Complex numbers can undergo the basic operations of addition, subtraction, multiplication, division, and exponentiation, and you can retrieve the real and imaginary parts and obtain a number's conjugate. Python's built-in complex type is an implementation of :class:`Complex`.
sv: :class:`Complex` är en underklass till :class:`Number`. Komplexa tal kan genomgå de grundläggande operationerna addition, subtraktion, multiplikation, division och exponentiering, och du kan hämta de reella och imaginära delarna och få ett tals konjugat. Pythons inbyggda komplexa typ är en implementation av :class:`Complex`.

source: :class:`Real` further derives from :class:`Complex`, and adds operations that only work on real numbers: :func:`floor`, :func:`trunc`, rounding, taking the remainder mod N, floor division, and comparisons.
sv: :class:`Real` härstammar vidare från :class:`Complex` och lägger till operationer som bara fungerar på reella tal: :func:`floor`, :func:`trunc`, avrundning, ta resten mod N, division med golv och jämförelser.

source: :class:`Rational` numbers derive from :class:`Real`, have :attr:`numerator` and :attr:`denominator` properties, and can be converted to floats. Python 2.6 adds a simple rational-number class, :class:`Fraction`, in the :mod:`fractions` module. (It's called :class:`Fraction` instead of :class:`Rational` to avoid a name clash with :class:`numbers.Rational`.)
sv: :class:`Rational` numbers härstammar från :class:`Real`, har egenskaperna :attr:`numerator` och :attr:`denominator` och kan konverteras till floats. Python 2.6 lägger till en enkel klass för rationella tal, :class:`Fraction`, i modulen :mod:`fractions`. (Den kallas :class:`Fraction` istället för :class:`Rational` för att undvika en namnkrock med :class:`numbers.Rational`)

source: :class:`Integral` numbers derive from :class:`Rational`, and can be shifted left and right with ``<<`` and ``>>``, combined using bitwise operations such as ``&`` and ``|``, and can be used as array indexes and slice boundaries.
sv: :class:`Integral` numbers härstammar från :class:`Rational`, och kan flyttas åt vänster och höger med ``<<`` och ``>>``, kombineras med bitvisa operationer som ``&`` och ``|``, och kan användas som array-index och slice-gränser.

source: In Python 3.0, the PEP slightly redefines the existing builtins :func:`round`, :func:`math.floor`, :func:`math.ceil`, and adds a new one, :func:`math.trunc`, that's been backported to Python 2.6. :func:`math.trunc` rounds toward zero, returning the closest :class:`Integral` that's between the function's argument and zero.
sv: I Python 3.0 omdefinierar PEP något de befintliga builtins :func:`round`, :func:`math.floor`, :func:`math.ceil`, och lägger till en ny, :func:`math.trunc`, som har backporterats till Python 2.6. :func:`math.trunc` rundar mot noll och returnerar den närmaste :class:`Integral` som ligger mellan funktionens argument och noll.

source: :pep:`3141` - A Type Hierarchy for Numbers
sv: :pep:`3141` - En typhierarki för siffror

source: PEP written by Jeffrey Yasskin.
sv: PEP skriven av Jeffrey Yasskin.

source: `Scheme's numerical tower <https://www.gnu.org/software/guile/manual/html_node/Numerical-Tower.html#Numerical-Tower>`__, from the Guile manual.
sv: `Schemets numeriska torn <https://www.gnu.org/software/guile/manual/html_node/Numerical-Tower.html#Numerical-Tower>`__, från Guile-manualen.

source: `Scheme's number datatypes <https://conservatory.scheme.org/schemers/Documents/Standards/R5RS/HTML/r5rs-Z-H-9.html#%_sec_6.2>`__ from the R5RS Scheme specification.
sv: `Schemes datatyper för tal <https://conservatory.scheme.org/schemers/Documents/Standards/R5RS/HTML/r5rs-Z-H-9.html#%_sec_6.2>`__ från R5RS Scheme-specifikationen.

source: The :mod:`fractions` Module
sv: Modulen :mod:`fraktioner

source: To fill out the hierarchy of numeric types, the :mod:`fractions` module provides a rational-number class. Rational numbers store their values as a numerator and denominator forming a fraction, and can exactly represent numbers such as ``2/3`` that floating-point numbers can only approximate.
sv: För att fylla ut hierarkin av numeriska typer tillhandahåller modulen :mod:`fractions` en klass för rationella tal. Rationella tal lagrar sina värden som en täljare och nämnare som bildar ett bråk, och kan exakt representera tal som ``2/3`` som flyttal bara kan approximera.

source: The :class:`Fraction` constructor takes two :class:`Integral` values that will be the numerator and denominator of the resulting fraction. ::
sv: Konstruktören :class:`Fraction` tar två :class:`Integral`-värden som blir täljare och nämnare i den resulterande fraktionen. ::

source: >>> from fractions import Fraction >>> a = Fraction(2, 3) >>> b = Fraction(2, 5) >>> float(a), float(b) (0.66666666666666663, 0.40000000000000002) >>> a+b Fraction(16, 15) >>> a/b Fraction(5, 3)
sv: >>> from fractions import Fraktion >>> a = Fraktion(2, 3) >>> b = Fraktion(2, 5) >>> float(a), float(b) (0.66666666666666663, 0.40000000000000002) >>> a+b Fraktion(16, 15) >>> a/b Fraktion(5, 3)

source: For converting floating-point numbers to rationals, the float type now has an :meth:`as_integer_ratio` method that returns the numerator and denominator for a fraction that evaluates to the same floating-point value::
sv: För konvertering av flyttal till rationella tal har float-typen nu en metod :meth:`as_integer_ratio` som returnerar täljaren och nämnaren för ett bråk som utvärderas till samma flyttalsvärde::

source: Note that values that can only be approximated by floating-point numbers, such as 1./3, are not simplified to the number being approximated; the fraction attempts to match the floating-point value **exactly**.
sv: Observera att värden som bara kan approximeras med flyttal, t.ex. 1./3, inte förenklas till det tal som approximeras; bråket försöker matcha flyttalsvärdet **exakt**.

source: The :mod:`fractions` module is based upon an implementation by Sjoerd Mullender that was in Python's :file:`Demo/classes/` directory for a long time. This implementation was significantly updated by Jeffrey Yasskin.
sv: Modulen :mod:`fractions` är baserad på en implementation av Sjoerd Mullender som länge fanns i Pythons :file:`Demo/classes/`-katalog. Denna implementation har uppdaterats avsevärt av Jeffrey Yasskin.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:
