Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: The rounding library responsible for this improvement works on Windows and on Unix platforms using the gcc, icc, or suncc compilers. There may be a small number of platforms where correct operation of this code cannot be guaranteed, so the code is not used on such systems. You can find out which code is being used by checking :data:`sys.float_repr_style`, which will be ``short`` if the new code is in use and ``legacy`` if it isn't.
sv: Avrundningsbiblioteket som är ansvarigt för denna förbättring fungerar på Windows- och Unix-plattformar som använder kompilatorerna gcc, icc eller suncc. Det kan finnas ett litet antal plattformar där korrekt funktion av denna kod inte kan garanteras, så koden används inte på sådana system. Du kan ta reda på vilken kod som används genom att kontrollera :data:`sys.float_repr_style`, som kommer att vara ``short`` om den nya koden används och ``legacy`` om den inte gör det.

source: Implemented by Eric Smith and Mark Dickinson, using David Gay's :file:`dtoa.c` library; :issue:`7117`.
sv: Implementerad av Eric Smith och Mark Dickinson, med hjälp av David Gays :file:`dtoa.c`-bibliotek; :issue:`7117`.

source: Conversions from long integers and regular integers to floating point now round differently, returning the floating-point number closest to the number. This doesn't matter for small integers that can be converted exactly, but for large numbers that will unavoidably lose precision, Python 2.7 now approximates more closely. For example, Python 2.6 computed the following::
sv: Konverteringar från långa heltal och vanliga heltal till flyttal avrundas nu annorlunda och returnerar det flyttalstal som ligger närmast talet. Detta spelar ingen roll för små heltal som kan konverteras exakt, men för stora tal som oundvikligen kommer att förlora precision, approximerar Python 2.7 nu närmare. Till exempel beräknade Python 2.6 följande::

source: Python 2.7's floating-point result is larger, but much closer to the true value::
sv: Python 2.7:s flyttalsresultat är större, men mycket närmare det sanna värdet::

source: (Implemented by Mark Dickinson; :issue:`3166`.)
sv: (Implementerad av Mark Dickinson; :issue:`3166`.)

source: Integer division is also more accurate in its rounding behaviours. (Also implemented by Mark Dickinson; :issue:`1811`.)
sv: Integer division är också mer exakt i sina avrundningsbeteenden. (Även implementerat av Mark Dickinson; :issue:`1811`.)

source: Implicit coercion for complex numbers has been removed; the interpreter will no longer ever attempt to call a :meth:`!__coerce__` method on complex objects. (Removed by Meador Inge and Mark Dickinson; :issue:`5211`.)
sv: Implicit coercion för komplexa tal har tagits bort; tolken kommer inte längre att försöka anropa en :meth:`!__coerce__`-metod på komplexa objekt. (Borttagen av Meador Inge och Mark Dickinson; :issue:`5211`.)

source: The :meth:`str.format` method now supports automatic numbering of the replacement fields. This makes using :meth:`str.format` more closely resemble using ``%s`` formatting::
sv: Metoden :meth:`str.format` har nu stöd för automatisk numrering av ersättningsfälten. Detta gör att användning av :meth:`str.format` mer liknar användning av ``%s`` formatering::

source: >>> '{}:{}:{}'.format(2009, 04, 'Sunday') '2009:4:Sunday' >>> '{}:{}:{day}'.format(2009, 4, day='Sunday') '2009:4:Sunday'
sv: >>> '{}:{}:{}'.format(2009, 04, 'Söndag') '2009:4:Söndag' >>> '{}:{}:{day}'.format(2009, 4, day='Sunday') '2009:4:Söndag'

source: The auto-numbering takes the fields from left to right, so the first ``{...}`` specifier will use the first argument to :meth:`str.format`, the next specifier will use the next argument, and so on. You can't mix auto-numbering and explicit numbering -- either number all of your specifier fields or none of them -- but you can mix auto-numbering and named fields, as in the second example above. (Contributed by Eric Smith; :issue:`5237`.)
sv: Den automatiska numreringen tar fälten från vänster till höger, så den första ``{...}``-angivaren kommer att använda det första argumentet till :meth:`str.format`, nästa angivare kommer att använda nästa argument, och så vidare. Du kan inte blanda automatisk numrering och explicit numrering -- antingen numrerar du alla dina specificeringsfält eller inga alls -- men du kan blanda automatisk numrering och namngivna fält, som i det andra exemplet ovan. (Bidrag från Eric Smith; :issue:`5237`.)

source: Complex numbers now correctly support usage with :func:`format`, and default to being right-aligned. Specifying a precision or comma-separation applies to both the real and imaginary parts of the number, but a specified field width and alignment is applied to the whole of the resulting ``1.5+3j`` output. (Contributed by Eric Smith; :issue:`1588` and :issue:`7988`.)
sv: Komplexa tal stöder nu korrekt användning med :func:`format` och är som standard högerjusterade. Att ange en precision eller kommaseparering gäller både den reella och imaginära delen av talet, men en angiven fältbredd och justering tillämpas på hela den resulterande ``1,5+3j``-utmatningen. (Bidrag från Eric Smith; :issue:`1588` och :issue:`7988`.)

source: The 'F' format code now always formats its output using uppercase characters, so it will now produce 'INF' and 'NAN'. (Contributed by Eric Smith; :issue:`3382`.)
sv: Formatkoden 'F' formaterar nu alltid sin utdata med versaler, så den kommer nu att producera 'INF' och 'NAN'. (Bidrag från Eric Smith; :issue:`3382`.)

source: A low-level change: the :meth:`object.__format__` method now triggers a :exc:`PendingDeprecationWarning` if it's passed a format string, because the :meth:`!__format__` method for :class:`object` converts the object to a string representation and formats that. Previously the method silently applied the format string to the string representation, but that could hide mistakes in Python code. If you're supplying formatting information such as an alignment or precision, presumably you're expecting the formatting to be applied in some object-specific way. (Fixed by Eric Smith; :issue:`7994`.)
sv: En förändring på låg nivå: metoden :meth:`object.__format__` utlöser nu en :exc:`PendingDeprecationWarning` om den får en formatsträng, eftersom metoden :meth:`!__format__` för :class:`object` konverterar objektet till en strängrepresentation och formaterar den. Tidigare tillämpade metoden formatsträngen tyst på strängrepresentationen, men det kunde dölja misstag i Python-koden. Om du tillhandahåller formateringsinformation som en inriktning eller precision, förväntar du dig förmodligen att formateringen ska tillämpas på något objektspecifikt sätt. (Rättad av Eric Smith; :issue:`7994`.)

source: The :func:`int` and :func:`!long` types gained a ``bit_length`` method that returns the number of bits necessary to represent its argument in binary::
sv: Typerna :func:`int` och :func:`!long` har fått en metod ``bit_length`` som returnerar det antal bitar som krävs för att representera argumentet i binärformat:

source: >>> n = 37 >>> bin(n) '0b100101' >>> n.bit_length() 6 >>> n = 2**123-1 >>> n.bit_length() 123 >>> (n+1).bit_length() 124
sv: >>> n = 37 >>> bin(n) '0b100101' >>> n.bit_längd() 6 >>> n = 2**123-1 >>> n.bit_längd() 123 >>> (n+1).bit_längd() 124

source: (Contributed by Fredrik Johansson and Victor Stinner; :issue:`3439`.)
sv: (Bidrag från Fredrik Johansson och Victor Stinner; :issue:`3439`.)

source: The :keyword:`import` statement will no longer try an absolute import if a relative import (e.g. ``from .os import sep``) fails. This fixes a bug, but could possibly break certain :keyword:`!import` statements that were only working by accident. (Fixed by Meador Inge; :issue:`7902`.)
sv: Satsen :keyword:`import` kommer inte längre att försöka med en absolut import om en relativ import (t.ex. ``from .os import sep``) misslyckas. Detta åtgärdar en bugg, men kan eventuellt bryta vissa :keyword:`!import`-satser som bara fungerade av misstag. (Åtgärdat av Meador Inge; :issue:`7902`.)

source: It's now possible for a subclass of the built-in :class:`!unicode` type to override the :meth:`!__unicode__` method. (Implemented by Victor Stinner; :issue:`1583863`.)
sv: Det är nu möjligt för en underklass av den inbyggda typen :class:`!unicode` att åsidosätta metoden :meth:`!__unicode__`. (Implementerat av Victor Stinner; :issue:`1583863`.)

source: The :class:`bytearray` type's :meth:`~bytearray.translate` method now accepts ``None`` as its first argument. (Fixed by Georg Brandl; :issue:`4759`.)
sv: Metoden :meth:`~bytearray.translate` av typen :class:`bytearray` accepterar nu ``None`` som sitt första argument. (Rättad av Georg Brandl; :issue:`4759`.)

source: When using :class:`@classmethod <classmethod>` and :class:`@staticmethod <staticmethod>` to wrap methods as class or static methods, the wrapper object now exposes the wrapped function as their :attr:`~method.__func__` attribute. (Contributed by Amaury Forgeot d'Arc, after a suggestion by George Sakkis; :issue:`5982`.)
sv: När man använder :class:`@classmethod <classmethod>` och :class:`@staticmethod <staticmethod>` för att omsluta metoder som klass- eller statiska metoder, visar omslutningsobjektet nu den omslutna funktionen som sitt :attr:`~method.__func__`-attribut. (Bidrag från Amaury Forgeot d'Arc, efter ett förslag från George Sakkis; :issue:`5982`.)

source: When a restricted set of attributes were set using ``__slots__``, deleting an unset attribute would not raise :exc:`AttributeError` as you would expect. Fixed by Benjamin Peterson; :issue:`7604`.)
sv: När en begränsad uppsättning attribut ställdes in med hjälp av ``__slots__``, skulle borttagning av ett icke-inställt attribut inte ge upphov till :exc:`AttributeError` som förväntat. Fixad av Benjamin Peterson; :issue:`7604`.)

source: Two new encodings are now supported: "cp720", used primarily for Arabic text; and "cp858", a variant of CP 850 that adds the euro symbol. (CP720 contributed by Alexander Belchenko and Amaury Forgeot d'Arc in :issue:`1616979`; CP858 contributed by Tim Hatch in :issue:`8016`.)
sv: Två nya kodningar stöds nu: "cp720", som främst används för arabisk text; och "cp858", en variant av CP 850 som lägger till eurosymbolen. (CP720 med bidrag från Alexander Belchenko och Amaury Forgeot d'Arc i :issue:`1616979`; CP858 med bidrag från Tim Hatch i :issue:`8016`.)

source: The :class:`!file` object will now set the :attr:`!filename` attribute on the :exc:`IOError` exception when trying to open a directory on POSIX platforms (noted by Jan Kaliszewski; :issue:`4764`), and now explicitly checks for and forbids writing to read-only file objects instead of trusting the C library to catch and report the error (fixed by Stefan Krah; :issue:`5677`).
sv: Objektet :class:`!file` kommer nu att sätta attributet :attr:`!filename` på undantaget :exc:`IOError` när man försöker öppna en katalog på POSIX-plattformar (noterat av Jan Kaliszewski; :issue:`4764`), och kontrollerar nu explicit för och förbjuder skrivning till skrivskyddade filobjekt istället för att lita på att C-biblioteket fångar upp och rapporterar felet (åtgärdat av Stefan Krah; :issue:`5677`).

source: The Python tokenizer now translates line endings itself, so the :func:`compile` built-in function now accepts code using any line-ending convention. Additionally, it no longer requires that the code end in a newline.
sv: Pythons tokenizer översätter nu radavslut själv, så den inbyggda funktionen :func:`compile` accepterar nu kod som använder vilken radavslutskonvention som helst. Dessutom kräver den inte längre att koden slutar med en ny rad.

source: Extra parentheses in function definitions are illegal in Python 3.x, meaning that you get a syntax error from ``def f((x)): pass``. In Python3-warning mode, Python 2.7 will now warn about this odd usage. (Noted by James Lingard; :issue:`7362`.)
sv: Extra parenteser i funktionsdefinitioner är olagliga i Python 3.x, vilket innebär att du får ett syntaxfel från ``def f((x)): pass``. I Python3-varningsläge kommer Python 2.7 nu att varna för denna udda användning. (Noterat av James Lingard; :issue:`7362`.)

source: It's now possible to create weak references to old-style class objects. New-style classes were always weak-referenceable. (Fixed by Antoine Pitrou; :issue:`8268`.)
sv: Det är nu möjligt att skapa svaga referenser till gamla klassobjekt. Klasser i ny stil var alltid svaga referenser. (Rättad av Antoine Pitrou; :issue:`8268`.)

source: When a module object is garbage-collected, the module's dictionary is now only cleared if no one else is holding a reference to the dictionary (:issue:`7140`).
sv: När ett modulobjekt samlas in i skräp rensas modulens ordbok nu bara om ingen annan har en referens till ordboken (:issue:`7140`).

source: Interpreter Changes
sv: Förändringar av tolk

source: A new environment variable, :envvar:`PYTHONWARNINGS`, allows controlling warnings. It should be set to a string containing warning settings, equivalent to those used with the :option:`-W` switch, separated by commas. (Contributed by Brian Curtin; :issue:`7301`.)
sv: En ny miljövariabel, :envvar:`PYTHONWARNINGS`, gör det möjligt att kontrollera varningar. Den bör sättas till en sträng som innehåller varningsinställningar, motsvarande de som används med :option:`-W`, åtskilda med kommatecken. (Bidrag från Brian Curtin; :issue:`7301`.)

source: For example, the following setting will print warnings every time they occur, but turn warnings from the :mod:`Cookie <http.cookies>` module into an error. (The exact syntax for setting an environment variable varies across operating systems and shells.)
sv: Exempelvis kommer följande inställning att skriva ut varningar varje gång de inträffar, men omvandla varningar från modulen :mod:`Cookie <http.cookies>` till ett fel. (Den exakta syntaxen för att ställa in en miljövariabel varierar mellan olika operativsystem och skal)

source: Optimizations
sv: Optimeringar

source: Several performance enhancements have been added:
sv: Flera prestandaförbättringar har lagts till:

source: A new opcode was added to perform the initial setup for :keyword:`with` statements, looking up the :meth:`~object.__enter__` and :meth:`~object.__exit__` methods. (Contributed by Benjamin Peterson.)
sv: En ny opcode lades till för att utföra den inledande konfigurationen för :keyword:`with`-satser, genom att leta upp metoderna :meth:`~object.__enter__` och :meth:`~object.__exit__`. (Bidrag från Benjamin Peterson.)

source: The garbage collector now performs better for one common usage pattern: when many objects are being allocated without deallocating any of them. This would previously take quadratic time for garbage collection, but now the number of full garbage collections is reduced as the number of objects on the heap grows. The new logic only performs a full garbage collection pass when the middle generation has been collected 10 times and when the number of survivor objects from the middle generation exceeds 10% of the number of objects in the oldest generation. (Suggested by Martin von Löwis and implemented by Antoine Pitrou; :issue:`4074`.)
sv: Skräpinsamlaren fungerar nu bättre för ett vanligt användningsmönster: när många objekt allokeras utan att något av dem avallokeras. Detta skulle tidigare ta kvadratisk tid för skräpinsamlingen, men nu minskar antalet fullständiga skräpinsamlingar i takt med att antalet objekt på heapen växer. Den nya logiken utför endast en fullständig skräpinsamling när den mellersta generationen har samlats in 10 gånger och när antalet överlevande objekt från den mellersta generationen överstiger 10% of antalet objekt i den äldsta generationen. (Föreslagen av Martin von Löwis och implementerad av Antoine Pitrou; :issue:`4074`.)

source: The garbage collector tries to avoid tracking simple containers which can't be part of a cycle. In Python 2.7, this is now true for tuples and dicts containing atomic types (such as ints, strings, etc.). Transitively, a dict containing tuples of atomic types won't be tracked either. This helps reduce the cost of each garbage collection by decreasing the number of objects to be considered and traversed by the collector. (Contributed by Antoine Pitrou; :issue:`4688`.)
sv: Garbage collector försöker undvika att spåra enkla behållare som inte kan vara en del av en cykel. I Python 2.7 är detta nu sant för tuples och dicts som innehåller atomära typer (som ints, strängar etc.). Övergångsvis kommer en dikt som innehåller tupler av atomära typer inte heller att spåras. Detta bidrar till att minska kostnaden för varje skräpplockning genom att minska antalet objekt som ska beaktas och genomkorsas av skräpplockaren. (Bidrag från Antoine Pitrou; :issue:`4688`.)

source: Long integers are now stored internally either in base ``2**15`` or in base ``2**30``, the base being determined at build time. Previously, they were always stored in base ``2**15``. Using base ``2**30`` gives significant performance improvements on 64-bit machines, but benchmark results on 32-bit machines have been mixed. Therefore, the default is to use base ``2**30`` on 64-bit machines and base ``2**15`` on 32-bit machines; on Unix, there's a new configure option :option:`!--enable-big-digits` that can be used to override this default.
sv: Långa heltal lagras nu internt antingen i basen ``2**15`` eller i basen ``2**30``, basen bestäms vid byggtiden. Tidigare lagrades de alltid i bas ``2**15``. Att använda bas ``2**30`` ger betydande prestandaförbättringar på 64-bitars maskiner, men benchmarkresultaten på 32-bitars maskiner har varit blandade. Därför är standardinställningen att använda bas ``2**30`` på 64-bitars maskiner och bas ``2**15`` på 32-bitars maskiner; på Unix finns det ett nytt konfigurationsalternativ :option:`!--enable-big-digits` som kan användas för att åsidosätta denna standardinställning.

source: Apart from the performance improvements this change should be invisible to end users, with one exception: for testing and debugging purposes there's a new structseq :data:`!sys.long_info` that provides information about the internal format, giving the number of bits per digit and the size in bytes of the C type used to store each digit::
sv: Bortsett från prestandaförbättringarna bör denna förändring vara osynlig för slutanvändarna, med ett undantag: för test- och felsökningsändamål finns det en ny structseq :data:`!sys.long_info` som ger information om det interna formatet, med antalet bitar per siffra och storleken i byte på den C-typ som används för att lagra varje siffra::

source: (Contributed by Mark Dickinson; :issue:`4258`.)
sv: (Bidrag från Mark Dickinson; :issue:`4258`.)

source: Another set of changes made long objects a few bytes smaller: 2 bytes smaller on 32-bit systems and 6 bytes on 64-bit. (Contributed by Mark Dickinson; :issue:`5260`.)
sv: En annan uppsättning ändringar gjorde långa objekt några byte mindre: 2 byte mindre på 32-bitars system och 6 byte på 64-bitars. (Bidrag från Mark Dickinson; :issue:`5260`.)

source: The division algorithm for long integers has been made faster by tightening the inner loop, doing shifts instead of multiplications, and fixing an unnecessary extra iteration. Various benchmarks show speedups of between 50% and 150% for long integer divisions and modulo operations. (Contributed by Mark Dickinson; :issue:`5512`.) Bitwise operations are also significantly faster (initial patch by Gregory Smith; :issue:`1087418`).
sv: Divisionsalgoritmen för långa heltal har gjorts snabbare genom att strama åt den inre slingan, göra skiftningar istället för multiplikationer och fixa en onödig extra iteration. Olika riktmärken visar hastighetsökningar på mellan 50% a och 150% f eller divisioner av långa heltal och modulooperationer. (Bidrag från Mark Dickinson; :issue:`5512`.) Bitvisa operationer är också betydligt snabbare (initial patch av Gregory Smith; :issue:`1087418`).

source: The implementation of ``%`` checks for the left-side operand being a Python string and special-cases it; this results in a 1--3% performance increase for applications that frequently use ``%`` with strings, such as templating libraries. (Implemented by Collin Winter; :issue:`5176`.)
sv: Implementationen av ``%`` kontrollerar att vänsteroperanden är en Python-sträng och specialanpassar den; detta resulterar i en 1--3% perprestandaökning för program som ofta använder ``%`` med strängar, till exempel mallbibliotek. (Implementerat av Collin Winter; :issue:`5176`.)

source: List comprehensions with an ``if`` condition are compiled into faster bytecode. (Patch by Antoine Pitrou, back-ported to 2.7 by Jeffrey Yasskin; :issue:`4715`.)
sv: Listförståelser med ett ``if`` villkor kompileras till snabbare bytekod. (Patch av Antoine Pitrou, back-porterad till 2.7 av Jeffrey Yasskin; :issue:`4715`.)

source: Converting an integer or long integer to a decimal string was made faster by special-casing base 10 instead of using a generalized conversion function that supports arbitrary bases. (Patch by Gawain Bolton; :issue:`6713`.)
sv: Konvertering av ett heltal eller långt heltal till en decimalsträng gjordes snabbare genom att specialisera bas 10 istället för att använda en generaliserad konverteringsfunktion som stöder godtyckliga baser. (Patch av Gawain Bolton; :issue:`6713`.)

source: The :meth:`!split`, :meth:`!replace`, :meth:`!rindex`, :meth:`!rpartition`, and :meth:`!rsplit` methods of string-like types (strings, Unicode strings, and :class:`bytearray` objects) now use a fast reverse-search algorithm instead of a character-by-character scan. This is sometimes faster by a factor of 10. (Added by Florent Xicluna; :issue:`7462` and :issue:`7622`.)
sv: Metoderna :meth:`!split`, :meth:`!replace`, :meth:`!rindex`, :meth:`!rpartition` och :meth:`!rsplit` för strängliknande typer (strängar, Unicode-strängar och :class:`bytearray`-objekt) använder nu en snabb omvänd sökalgoritm istället för en tecken-för-tecken-sökning. Detta är ibland snabbare med en faktor 10. (Tillagd av Florent Xicluna; :issue:`7462` och :issue:`7622`.)

source: The :mod:`pickle` and :mod:`!cPickle` modules now automatically intern the strings used for attribute names, reducing memory usage of the objects resulting from unpickling. (Contributed by Jake McGuire; :issue:`5084`.)
sv: Modulerna :mod:`pickle` och :mod:`!cPickle` internaliserar nu automatiskt strängarna som används för attributnamn, vilket minskar minnesanvändningen för objekten till följd av unpickling. (Bidrag från Jake McGuire; :issue:`5084`.)

source: The :mod:`!cPickle` module now special-cases dictionaries, nearly halving the time required to pickle them. (Contributed by Collin Winter; :issue:`5670`.)
sv: Modulen :mod:`!cPickle` har nu specialfall för ordböcker, vilket nästan halverar tiden som krävs för att plocka dem. (Bidrag från Collin Winter; :issue:`5670`.)

source: New and Improved Modules
sv: Nya och förbättrade moduler

source: As in every release, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the Subversion logs for all the details.
sv: Som i varje release fick Pythons standardbibliotek ett antal förbättringar och buggfixar. Här är en partiell lista över de mest anmärkningsvärda ändringarna, sorterade alfabetiskt efter modulnamn. Se filen :file:`Misc/NEWS` i källträdet för en mer komplett lista över ändringar, eller titta igenom Subversion-loggarna för alla detaljer.
