Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: The :mod:`tkinter.ttk` module was written by Guilherme Polo and added in :issue:`2983`. An alternate version called ``Tile.py``, written by Martin Franklin and maintained by Kevin Walzer, was proposed for inclusion in :issue:`2618`, but the authors argued that Guilherme Polo's work was more comprehensive.
sv: Modulen :mod:`tkinter.ttk` skrevs av Guilherme Polo och lades till i :issue:`2983`. En alternativ version kallad ``Tile.py``, skriven av Martin Franklin och underhållen av Kevin Walzer, föreslogs för inkludering i :issue:`2618`, men författarna hävdade att Guilherme Polos arbete var mer omfattande.

source: Updated module: unittest
sv: Uppdaterad modul: unittest

source: The :mod:`unittest` module was greatly enhanced; many new features were added. Most of these features were implemented by Michael Foord, unless otherwise noted. The enhanced version of the module is downloadable separately for use with Python versions 2.4 to 2.6, packaged as the :mod:`!unittest2` package, from :pypi:`unittest2`.
sv: Modulen :mod:`unittest` har förbättrats avsevärt och många nya funktioner har lagts till. De flesta av dessa funktioner har implementerats av Michael Foord, om inte annat anges. Den förbättrade versionen av modulen kan laddas ner separat för användning med Python-versionerna 2.4 till 2.6, paketerad som paketet :mod:`!unittest2`, från :pypi:`unittest2`.

source: When used from the command line, the module can automatically discover tests. It's not as fancy as `py.test <https://pytest.org>`__ or `nose <https://nose.readthedocs.io/>`__, but provides a simple way to run tests kept within a set of package directories. For example, the following command will search the :file:`test/` subdirectory for any importable test files named ``test*.py``::
sv: När modulen används från kommandoraden kan den automatiskt upptäcka tester. Det är inte lika snyggt som `py.test <https://pytest.org>`__ eller `nose <https://nose.readthedocs.io/>`__, men ger ett enkelt sätt att köra tester som finns i en uppsättning paketkataloger. Till exempel kommer följande kommando att söka i underkatalogen :file:`test/` efter alla importerbara testfiler med namnet ``test*.py``::

source: Consult the :mod:`unittest` module documentation for more details. (Developed in :issue:`6001`.)
sv: Se dokumentationen för modulen :mod:`unittest` för mer information. (Utvecklad i :issue:`6001`.)

source: The :func:`~unittest.main` function supports some other new options:
sv: Funktionen :func:`~unittest.main` har stöd för några andra nya alternativ:

source: :option:`-b <unittest -b>` or :option:`!--buffer` will buffer the standard output and standard error streams during each test. If the test passes, any resulting output will be discarded; on failure, the buffered output will be displayed.
sv: :option:`-b <unittest -b>` eller :option:`!--buffer` buffrar standardutdata- och standardfelströmmarna under varje test. Om testet godkänns kommer all resulterande utdata att kasseras; om testet misslyckas kommer den buffrade utdata att visas.

source: :option:`-c <unittest -c>` or :option:`!--catch` will cause the control-C interrupt to be handled more gracefully. Instead of interrupting the test process immediately, the currently running test will be completed and then the partial results up to the interruption will be reported. If you're impatient, a second press of control-C will cause an immediate interruption.
sv: :option:`-c <unittest -c>` eller :option:`!--catch` gör att avbrottet i kontroll-C hanteras på ett mer elegant sätt. Istället för att avbryta testprocessen omedelbart, kommer det pågående testet att slutföras och sedan kommer delresultaten fram till avbrottet att rapporteras. Om du är otålig kan du trycka på control-C en gång till för att orsaka ett omedelbart avbrott.

source: This control-C handler tries to avoid causing problems when the code being tested or the tests being run have defined a signal handler of their own, by noticing that a signal handler was already set and calling it. If this doesn't work for you, there's a :func:`~unittest.removeHandler` decorator that can be used to mark tests that should have the control-C handling disabled.
sv: Denna kontroll-C-hanterare försöker undvika att orsaka problem när koden som testas eller testerna som körs har definierat en egen signalhanterare, genom att märka att en signalhanterare redan var inställd och anropa den. Om det här inte fungerar för dig finns det en :func:`~unittest.removeHandler`-dekorator som kan användas för att markera tester som bör ha kontroll-C-hanteringen inaktiverad.

source: :option:`-f <unittest -f>` or :option:`!--failfast` makes test execution stop immediately when a test fails instead of continuing to execute further tests. (Suggested by Cliff Dyer and implemented by Michael Foord; :issue:`8074`.)
sv: :option:`-f <unittest -f>` eller :option:`!--failfast` gör att testkörningen stoppas omedelbart när ett test misslyckas istället för att fortsätta att köra ytterligare tester. (Föreslaget av Cliff Dyer och implementerat av Michael Foord; :issue:`8074`.)

source: The progress messages now show 'x' for expected failures and 'u' for unexpected successes when run in verbose mode. (Contributed by Benjamin Peterson.)
sv: Förloppsmeddelandena visar nu "x" för förväntade misslyckanden och "u" för oväntade framgångar när de körs i verbose-läge. (Bidrag från Benjamin Peterson.)

source: Test cases can raise the :exc:`~unittest.SkipTest` exception to skip a test (:issue:`1034053`).
sv: Testfall kan ge upphov till :exc:`~unittest.SkipTest`-undantaget för att hoppa över ett test (:issue:`1034053`).

source: The error messages for :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue`, and :meth:`~unittest.TestCase.assertFalse` failures now provide more information. If you set the :attr:`~unittest.TestCase.longMessage` attribute of your :class:`~unittest.TestCase` classes to true, both the standard error message and any additional message you provide will be printed for failures. (Added by Michael Foord; :issue:`5663`.)
sv: Felmeddelandena för :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue` och :meth:`~unittest.TestCase.assertFalse` ger nu mer information. Om du sätter attributet :attr:`~unittest.TestCase.longMessage` i dina :class:`~unittest.TestCase`-klasser till true, kommer både standardfelmeddelandet och eventuella ytterligare meddelanden som du anger att skrivas ut för misslyckanden. (Tillagd av Michael Foord; :issue:`5663`.)

source: The :meth:`~unittest.TestCase.assertRaises` method now returns a context handler when called without providing a callable object to run. For example, you can write this::
sv: Metoden :meth:`~unittest.TestCase.assertRaises` returnerar nu en kontexthanterare när den anropas utan att tillhandahålla ett anropbart objekt att köra. Du kan till exempel skriva så här::

source: with self.assertRaises(KeyError): {}['foo']
sv: med self.assertRaises(KeyError): {}['foo']

source: (Implemented by Antoine Pitrou; :issue:`4444`.)
sv: (Implementerad av Antoine Pitrou; :issue:`4444`.)

source: Module- and class-level setup and teardown fixtures are now supported. Modules can contain :func:`~unittest.setUpModule` and :func:`~unittest.tearDownModule` functions. Classes can have :meth:`~unittest.TestCase.setUpClass` and :meth:`~unittest.TestCase.tearDownClass` methods that must be defined as class methods (using ``@classmethod`` or equivalent). These functions and methods are invoked when the test runner switches to a test case in a different module or class.
sv: Fixturer för uppsättning och nedtagning på modul- och klassnivå stöds nu. Moduler kan innehålla funktionerna :func:`~unittest.setUpModule` och :func:`~unittest.tearDownModule`. Klasser kan ha metoderna :meth:`~unittest.TestCase.setUpClass` och :meth:`~unittest.TestCase.tearDownClass` som måste definieras som klassmetoder (med ``@classmethod`` eller motsvarande). Dessa funktioner och metoder anropas när testlöparen växlar till ett testfall i en annan modul eller klass.

source: The methods :meth:`~unittest.TestCase.addCleanup` and :meth:`~unittest.TestCase.doCleanups` were added. :meth:`~unittest.TestCase.addCleanup` lets you add cleanup functions that will be called unconditionally (after :meth:`~unittest.TestCase.setUp` if :meth:`~unittest.TestCase.setUp` fails, otherwise after :meth:`~unittest.TestCase.tearDown`). This allows for much simpler resource allocation and deallocation during tests (:issue:`5679`).
sv: Metoderna :meth:`~unittest.TestCase.addCleanup` och :meth:`~unittest.TestCase.doCleanups` har lagts till. med :meth:`~unittest.TestCase.addCleanup` kan du lägga till rensningsfunktioner som anropas villkorslöst (efter :meth:`~unittest.TestCase.setUp` om :meth:`~unittest.TestCase.setUp` misslyckas, annars efter :meth:`~unittest.TestCase.tearDown`). Detta möjliggör mycket enklare resursallokering och -deallokering under tester (:issue:`5679`).

source: A number of new methods were added that provide more specialized tests. Many of these methods were written by Google engineers for use in their test suites; Gregory P. Smith, Michael Foord, and GvR worked on merging them into Python's version of :mod:`unittest`.
sv: Ett antal nya metoder har lagts till som ger mer specialiserade tester. Många av dessa metoder skrevs av Google-ingenjörer för användning i deras testsviter; Gregory P. Smith, Michael Foord och GvR arbetade med att slå samman dem i Pythons version av :mod:`unittest`.

source: :meth:`~unittest.TestCase.assertIsNone` and :meth:`~unittest.TestCase.assertIsNotNone` take one expression and verify that the result is or is not ``None``.
sv: :meth:`~unittest.TestCase.assertIsNone` och :meth:`~unittest.TestCase.assertIsNotNone` tar ett uttryck och verifierar att resultatet är eller inte är ``None``.

source: :meth:`~unittest.TestCase.assertIs` and :meth:`~unittest.TestCase.assertIsNot` take two values and check whether the two values evaluate to the same object or not. (Added by Michael Foord; :issue:`2578`.)
sv: :meth:`~unittest.TestCase.assertIs` och :meth:`~unittest.TestCase.assertIsNot` tar två värden och kontrollerar om de två värdena utvärderas till samma objekt eller inte. (Tillagd av Michael Foord; :issue:`2578`.)

source: :meth:`~unittest.TestCase.assertIsInstance` and :meth:`~unittest.TestCase.assertNotIsInstance` check whether the resulting object is an instance of a particular class, or of one of a tuple of classes. (Added by Georg Brandl; :issue:`7031`.)
sv: :meth:`~unittest.TestCase.assertIsInstance` och :meth:`~unittest.TestCase.assertNotIsInstance` kontrollerar om det resulterande objektet är en instans av en viss klass, eller av en av flera klasser. (Tillagd av Georg Brandl; :issue:`7031`.)

source: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess`, and :meth:`~unittest.TestCase.assertLessEqual` compare two quantities.
sv: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess` och :meth:`~unittest.TestCase.assertLessEqual` jämför två storheter.

source: :meth:`~unittest.TestCase.assertMultiLineEqual` compares two strings, and if they're not equal, displays a helpful comparison that highlights the differences in the two strings. This comparison is now used by default when Unicode strings are compared with :meth:`~unittest.TestCase.assertEqual`.
sv: :meth:`~unittest.TestCase.assertMultiLineEqual` jämför två strängar och om de inte är lika visas en användbar jämförelse som belyser skillnaderna mellan de två strängarna. Denna jämförelse används nu som standard när Unicode-strängar jämförs med :meth:`~unittest.TestCase.assertEqual`.

source: :meth:`assertRegexpMatches() <unittest.TestCase.assertRegex>` and :meth:`assertNotRegexpMatches() <unittest.TestCase.assertNotRegex>` checks whether the first argument is a string matching or not matching the regular expression provided as the second argument (:issue:`8038`).
sv: :meth:`assertRegexpMatches() <unittest.TestCase.assertRegex>` och :meth:`assertNotRegexpMatches() <unittest.TestCase.assertNotRegex>` kontrollerar om det första argumentet är en sträng som matchar eller inte matchar det reguljära uttryck som anges som det andra argumentet (:issue:`8038`).

source: :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>` checks whether a particular exception is raised, and then also checks that the string representation of the exception matches the provided regular expression.
sv: :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>` kontrollerar om ett visst undantag har uppstått, och kontrollerar sedan också att strängrepresentationen av undantaget matchar det angivna reguljära uttrycket.

source: :meth:`~unittest.TestCase.assertIn` and :meth:`~unittest.TestCase.assertNotIn` tests whether *first* is or is not in *second*.
sv: :meth:`~unittest.TestCase.assertIn` och :meth:`~unittest.TestCase.assertNotIn` testar om *first* är eller inte är i *second*.

source: :meth:`assertItemsEqual() <unittest.TestCase.assertCountEqual>` tests whether two provided sequences contain the same elements.
sv: :meth:`assertItemsEqual() <unittest.TestCase.assertCountEqual>` testar om två angivna sekvenser innehåller samma element.

source: :meth:`~unittest.TestCase.assertSetEqual` compares whether two sets are equal, and only reports the differences between the sets in case of error.
sv: :meth:`~unittest.TestCase.assertSetEqual` jämför om två uppsättningar är lika, och rapporterar endast skillnaderna mellan uppsättningarna i händelse av fel.

source: Similarly, :meth:`~unittest.TestCase.assertListEqual` and :meth:`~unittest.TestCase.assertTupleEqual` compare the specified types and explain any differences without necessarily printing their full values; these methods are now used by default when comparing lists and tuples using :meth:`~unittest.TestCase.assertEqual`. More generally, :meth:`~unittest.TestCase.assertSequenceEqual` compares two sequences and can optionally check whether both sequences are of a particular type.
sv: På samma sätt jämför :meth:`~unittest.TestCase.assertListEqual` och :meth:`~unittest.TestCase.assertTupleEqual` de angivna typerna och förklarar eventuella skillnader utan att nödvändigtvis skriva ut deras fullständiga värden; dessa metoder används nu som standard när listor och tuplar jämförs med :meth:`~unittest.TestCase.assertEqual`. Mer allmänt jämför :meth:`~unittest.TestCase.assertSequenceEqual` två sekvenser och kan eventuellt kontrollera om båda sekvenserna är av en viss typ.

source: :meth:`~unittest.TestCase.assertDictEqual` compares two dictionaries and reports the differences; it's now used by default when you compare two dictionaries using :meth:`~unittest.TestCase.assertEqual`. :meth:`!assertDictContainsSubset` checks whether all of the key/value pairs in *first* are found in *second*.
sv: :meth:`~unittest.TestCase.assertDictEqual` jämför två ordböcker och rapporterar skillnaderna; den används nu som standard när du jämför två ordböcker med :meth:`~unittest.TestCase.assertEqual`. :meth:`!assertDictContainsSubset` kontrollerar om alla nyckel/värde-par i *första* finns i *andra*.

source: :meth:`~unittest.TestCase.assertAlmostEqual` and :meth:`~unittest.TestCase.assertNotAlmostEqual` test whether *first* and *second* are approximately equal. This method can either round their difference to an optionally specified number of *places* (the default is 7) and compare it to zero, or require the difference to be smaller than a supplied *delta* value.
sv: :meth:`~unittest.TestCase.assertAlmostEqual` och :meth:`~unittest.TestCase.assertNotAlmostEqual` testar om *first* och *second* är ungefär lika stora. Denna metod kan antingen avrunda skillnaden till ett valfritt angivet antal *platser* (standard är 7) och jämföra den med noll, eller kräva att skillnaden är mindre än ett angivet *delta*-värde.

source: :meth:`~unittest.TestLoader.loadTestsFromName` properly honors the :attr:`~unittest.TestLoader.suiteClass` attribute of the :class:`~unittest.TestLoader`. (Fixed by Mark Roddy; :issue:`6866`.)
sv: :meth:`~unittest.TestLoader.loadTestsFromName` tar korrekt hänsyn till attributet :attr:`~unittest.TestLoader.suiteClass` i :class:`~unittest.TestLoader`. (Åtgärdat av Mark Roddy; :issue:`6866`.)

source: A new hook lets you extend the :meth:`~unittest.TestCase.assertEqual` method to handle new data types. The :meth:`~unittest.TestCase.addTypeEqualityFunc` method takes a type object and a function. The function will be used when both of the objects being compared are of the specified type. This function should compare the two objects and raise an exception if they don't match; it's a good idea for the function to provide additional information about why the two objects aren't matching, much as the new sequence comparison methods do.
sv: En ny krok låter dig utöka metoden :meth:`~unittest.TestCase.assertEqual` för att hantera nya datatyper. Metoden :meth:`~unittest.TestCase.addTypeEqualityFunc` tar ett typobjekt och en funktion. Funktionen kommer att användas när båda objekten som jämförs är av den angivna typen. Denna funktion bör jämföra de två objekten och ge upphov till ett undantag om de inte matchar varandra; det är en bra idé att funktionen ger ytterligare information om varför de två objekten inte matchar varandra, ungefär som de nya metoderna för sekvensjämförelse gör.

source: :func:`unittest.main` now takes an optional ``exit`` argument. If false, :func:`~unittest.main` doesn't call :func:`sys.exit`, allowing :func:`~unittest.main` to be used from the interactive interpreter. (Contributed by J. Pablo Fernández; :issue:`3379`.)
sv: :func:`unittest.main` tar nu ett valfritt ``exit`` argument. Om false, anropar :func:`~unittest.main` inte :func:`sys.exit`, vilket gör att :func:`~unittest.main` kan användas från den interaktiva tolken. (Bidrag från J. Pablo Fernández; :issue:`3379`.)

source: :class:`~unittest.TestResult` has new :meth:`~unittest.TestResult.startTestRun` and :meth:`~unittest.TestResult.stopTestRun` methods that are called immediately before and after a test run. (Contributed by Robert Collins; :issue:`5728`.)
sv: :class:`~unittest.TestResult` har nya :meth:`~unittest.TestResult.startTestRun` och :meth:`~unittest.TestResult.stopTestRun` metoder som anropas omedelbart före och efter en testkörning. (Bidrag från Robert Collins; :issue:`5728`.)

source: With all these changes, the :file:`unittest.py` was becoming awkwardly large, so the module was turned into a package and the code split into several files (by Benjamin Peterson). This doesn't affect how the module is imported or used.
sv: Med alla dessa ändringar började :filen:`unittest.py` bli besvärande stor, så modulen gjordes om till ett paket och koden delades upp i flera filer (av Benjamin Peterson). Detta påverkar inte hur modulen importeras eller används.

source: Describes the new features, how to use them, and the rationale for various design decisions. (By Michael Foord.)
sv: Beskriver de nya funktionerna, hur man använder dem och motiven för olika designbeslut. (Av Michael Foord.)

source: Updated module: ElementTree 1.3
sv: Uppdaterad modul: ElementTree 1.3

source: The version of the ElementTree library included with Python was updated to version 1.3. Some of the new features are:
sv: Den version av ElementTree-biblioteket som ingår i Python har uppdaterats till version 1.3. Några av de nya funktionerna är:

source: The various parsing functions now take a *parser* keyword argument giving an :class:`~xml.etree.ElementTree.XMLParser` instance that will be used. This makes it possible to override the file's internal encoding::
sv: De olika parsingfunktionerna tar nu ett *parser* nyckelordsargument som ger en :class:`~xml.etree.ElementTree.XMLParser`-instans som ska användas. Detta gör det möjligt att åsidosätta filens interna kodning::

source: p = ET.XMLParser(encoding='utf-8') t = ET.XML("""<root/>""", parser=p)
sv: p = ET.XMLParser(kodning='utf-8') t = ET.XML("""<root/>""", parser=p)

source: Errors in parsing XML now raise a :exc:`~xml.etree.ElementTree.ParseError` exception, whose instances have a :attr:`!position` attribute containing a (*line*, *column*) tuple giving the location of the problem.
sv: Fel vid XML-parsning ger nu upphov till ett :exc:`~xml.etree.ElementTree.ParseError`-undantag, vars instanser har ett :attr:`!position`-attribut som innehåller en (*rad*, *kolumn*)-tupel som anger var problemet finns.

source: ElementTree's code for converting trees to a string has been significantly reworked, making it roughly twice as fast in many cases. The :meth:`ElementTree.write() <xml.etree.ElementTree.ElementTree.write>` and :meth:`Element.write` methods now have a *method* parameter that can be "xml" (the default), "html", or "text". HTML mode will output empty elements as ``<empty></empty>`` instead of ``<empty/>``, and text mode will skip over elements and only output the text chunks. If you set the :attr:`~xml.etree.ElementTree.Element.tag` attribute of an element to ``None`` but leave its children in place, the element will be omitted when the tree is written out, so you don't need to do more extensive rearrangement to remove a single element.
sv: ElementTrees kod för att konvertera träd till en sträng har omarbetats avsevärt, vilket gör den ungefär dubbelt så snabb i många fall. Metoderna :meth:`ElementTree.write() <xml.etree.ElementTree.ElementTree.write>` och :meth:`Element.write` har nu en *method*-parameter som kan vara "xml" (standard), "html" eller "text". HTML-läget skriver ut tomma element som ``<empty></empty>`` istället för ``<empty/>``, och textläget hoppar över element och skriver bara ut textstyckena. Om du sätter attributet :attr:`~xml.etree.ElementTree.Element.tag` för ett element till ``None`` men låter dess barn vara kvar, kommer elementet att utelämnas när trädet skrivs ut, så att du inte behöver göra mer omfattande omarrangemang för att ta bort ett enda element.

source: Namespace handling has also been improved. All ``xmlns:<whatever>`` declarations are now output on the root element, not scattered throughout the resulting XML. You can set the default namespace for a tree by setting the :attr:`default_namespace` attribute and can register new prefixes with :meth:`~xml.etree.ElementTree.register_namespace`. In XML mode, you can use the true/false *xml_declaration* parameter to suppress the XML declaration.
sv: Hanteringen av namnrymder har också förbättrats. Alla ``xmlns:<whatever>``-deklarationer visas nu i rotelementet och inte utspridda i den resulterande XML-filen. Du kan ange standardnamnrymden för ett träd genom att ange attributet :attr:`default_namespace` och du kan registrera nya prefix med :meth:`~xml.etree.ElementTree.register_namespace`. I XML-läge kan du använda true/false-parametern *xml_declaration* för att undertrycka XML-deklarationen.

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.extend` appends the items from a sequence to the element's children. Elements themselves behave like sequences, so it's easy to move children from one element to another::
sv: Ny :class:`~xml.etree.ElementTree.Element` metod: :meth:`~xml.etree.ElementTree.Element.extend` lägger till objekten från en sekvens till elementets barn. Elementen själva beter sig som sekvenser, så det är lätt att flytta barn från ett element till ett annat::
