Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: What's New in Python 2.7
sv: Vad är nytt i Python 2.7

source: Author
sv: Författare

source: This article explains the new features in Python 2.7. Python 2.7 was released on July 3, 2010.
sv: I den här artikeln förklaras de nya funktionerna i Python 2.7. Python 2.7 släpptes den 3 juli 2010.

source: Numeric handling has been improved in many ways, for both floating-point numbers and for the :class:`~decimal.Decimal` class. There are some useful additions to the standard library, such as a greatly enhanced :mod:`unittest` module, the :mod:`argparse` module for parsing command-line options, convenient :class:`~collections.OrderedDict` and :class:`~collections.Counter` classes in the :mod:`collections` module, and many other improvements.
sv: Hanteringen av numeriska tal har förbättrats på många sätt, både för flyttal och för klassen :class:`~decimal.Decimal`. Det finns en del användbara tillägg till standardbiblioteket, t.ex. en kraftigt förbättrad modul :mod:`unittest`, modulen :mod:`argparse` för tolkning av kommandoradsalternativ, praktiska klasserna :class:`~collections.OrderedDict` och :class:`~collections.Counter` i modulen :mod:`collections` och många andra förbättringar.

source: Python 2.7 is planned to be the last of the 2.x releases, so we worked on making it a good release for the long term. To help with porting to Python 3, several new features from the Python 3.x series have been included in 2.7.
sv: Python 2.7 är planerad att vara den sista av 2.x-utgåvorna, så vi har arbetat för att göra det till en bra utgåva på lång sikt. För att hjälpa till med porteringen till Python 3 har flera nya funktioner från Python 3.x-serien inkluderats i 2.7.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.7 at https://docs.python.org. If you want to understand the rationale for the design and implementation, refer to the PEP for a particular new feature or the issue on https://bugs.python.org in which a change was discussed. Whenever possible, "What's New in Python" links to the bug/patch item for each change.
sv: Den här artikeln försöker inte ge en fullständig specifikation av de nya funktionerna, utan ger istället en praktisk översikt. För fullständiga detaljer hänvisas till dokumentationen för Python 2.7 på https://docs.python.org. Om du vill förstå bakgrunden till utformningen och implementeringen, se PEP för en viss ny funktion eller frågan på https://bugs.python.org där en ändring diskuterades. När det är möjligt länkar "What's New in Python" till buggen/patch-objektet för varje ändring.

source: The Future for Python 2.x
sv: Framtiden för Python 2.x

source: Python 2.7 is the last major release in the 2.x series, as the Python maintainers have shifted the focus of their new feature development efforts to the Python 3.x series. This means that while Python 2 continues to receive bug fixes, and to be updated to build correctly on new hardware and versions of supported operated systems, there will be no new full feature releases for the language or standard library.
sv: Python 2.7 är den sista större utgåvan i 2.x-serien, eftersom Python-underhållarna har flyttat fokus för sina ansträngningar att utveckla nya funktioner till Python 3.x-serien. Detta innebär att medan Python 2 fortsätter att få buggfixar och uppdateras för att bygga korrekt på ny hårdvara och versioner av operativsystem som stöds, kommer det inte att finnas några nya fullständiga funktionsversioner för språket eller standardbiblioteket.

source: However, while there is a large common subset between Python 2.7 and Python 3, and many of the changes involved in migrating to that common subset, or directly to Python 3, can be safely automated, some other changes (notably those associated with Unicode handling) may require careful consideration, and preferably robust automated regression test suites, to migrate effectively.
sv: Men även om det finns en stor gemensam delmängd mellan Python 2.7 och Python 3, och många av de ändringar som är involverade i migreringen till den gemensamma delmängden, eller direkt till Python 3, kan automatiseras på ett säkert sätt, kan vissa andra ändringar (särskilt de som är förknippade med Unicode-hantering) kräva noggrant övervägande, och helst robusta automatiserade regressionstestsviter, för att migrera effektivt.

source: This means that Python 2.7 will remain in place for a long time, providing a stable and supported base platform for production systems that have not yet been ported to Python 3. The full expected lifecycle of the Python 2.7 series is detailed in :pep:`373`.
sv: Detta innebär att Python 2.7 kommer att finnas kvar under lång tid och utgöra en stabil basplattform med stöd för produktionssystem som ännu inte har portats till Python 3. Den fullständiga förväntade livscykeln för Python 2.7-serien beskrivs i :pep:`373`.

source: Some key consequences of the long-term significance of 2.7 are:
sv: Några viktiga konsekvenser av den långsiktiga betydelsen av 2,7 är:

source: As noted above, the 2.7 release has a much longer period of maintenance when compared to earlier 2.x versions. Python 2.7 is currently expected to remain supported by the core development team (receiving security updates and other bug fixes) until at least 2020 (10 years after its initial release, compared to the more typical support period of 18--24 months).
sv: Som nämnts ovan har 2.7-utgåvan en mycket längre period av underhåll jämfört med tidigare 2.x-versioner. Python 2.7 förväntas för närvarande fortsätta att stödjas av kärnutvecklingsteamet (få säkerhetsuppdateringar och andra buggfixar) fram till åtminstone 2020 (10 år efter den första utgåvan, jämfört med den mer typiska supportperioden på 18-24 månader).

source: As the Python 2.7 standard library ages, making effective use of the Python Package Index (either directly or via a redistributor) becomes more important for Python 2 users. In addition to a wide variety of third party packages for various tasks, the available packages include backports of new modules and features from the Python 3 standard library that are compatible with Python 2, as well as various tools and libraries that can make it easier to migrate to Python 3. The `Python Packaging User Guide <https://packaging.python.org>`__ provides guidance on downloading and installing software from the Python Package Index.
sv: I takt med att standardbiblioteket Python 2.7 åldras blir det allt viktigare för Python 2-användare att effektivt använda Python Package Index (antingen direkt eller via en redistributör). Förutom ett brett utbud av tredjepartspaket för olika uppgifter innehåller de tillgängliga paketen backports av nya moduler och funktioner från Python 3 standardbibliotek som är kompatibla med Python 2, samt olika verktyg och bibliotek som kan göra det lättare att migrera till Python 3. I "Python Packaging User Guide <https://packaging.python.org>`__" finns vägledning om hur du hämtar och installerar programvara från Python Package Index.

source: While the preferred approach to enhancing Python 2 is now the publication of new packages on the Python Package Index, this approach doesn't necessarily work in all cases, especially those related to network security. In exceptional cases that cannot be handled adequately by publishing new or updated packages on PyPI, the Python Enhancement Proposal process may be used to make the case for adding new features directly to the Python 2 standard library. Any such additions, and the maintenance releases where they were added, will be noted in the :ref:`py27-maintenance-enhancements` section below.
sv: Även om det föredragna tillvägagångssättet för att förbättra Python 2 nu är publicering av nya paket på Python Package Index, fungerar detta tillvägagångssätt inte nödvändigtvis i alla fall, särskilt de som är relaterade till nätverkssäkerhet. I undantagsfall som inte kan hanteras på lämpligt sätt genom att publicera nya eller uppdaterade paket på PyPI, kan Python Enhancement Proposal-processen användas för att argumentera för att lägga till nya funktioner direkt till Python 2 standardbibliotek. Alla sådana tillägg, och de underhållsutgåvor där de lades till, kommer att noteras i :ref:`py27-maintenance-enhancements` avsnittet nedan.

source: For projects wishing to migrate from Python 2 to Python 3, or for library and framework developers wishing to support users on both Python 2 and Python 3, there are a variety of tools and guides available to help decide on a suitable approach and manage some of the technical details involved. The recommended starting point is the :ref:`pyporting-howto` HOWTO guide.
sv: För projekt som vill migrera från Python 2 till Python 3, eller för biblioteks- och ramverksutvecklare som vill stödja användare av både Python 2 och Python 3, finns det en mängd olika verktyg och guider tillgängliga för att hjälpa till att bestämma ett lämpligt tillvägagångssätt och hantera några av de tekniska detaljer som är inblandade. Den rekommenderade startpunkten är :ref:`pyporting-howto` HOWTO-guiden.

source: Changes to the Handling of Deprecation Warnings
sv: Ändringar i hanteringen av deprecation-varningar

source: For Python 2.7, a policy decision was made to silence warnings only of interest to developers by default. :exc:`DeprecationWarning` and its descendants are now ignored unless otherwise requested, preventing users from seeing warnings triggered by an application. This change was also made in the branch that became Python 3.2. (Discussed on stdlib-sig and carried out in :issue:`7319`.)
sv: För Python 2.7 togs ett policybeslut att tysta varningar som bara är av intresse för utvecklare som standard. :exc:`DeprecationWarning` och dess ättlingar ignoreras nu om inte annat begärs, vilket förhindrar användare från att se varningar som utlöses av en applikation. Den här ändringen gjordes också i den gren som blev Python 3.2. (Diskuterades på stdlib-sig och genomfördes i :issue:`7319`.)

source: In previous releases, :exc:`DeprecationWarning` messages were enabled by default, providing Python developers with a clear indication of where their code may break in a future major version of Python.
sv: I tidigare utgåvor var :exc:`DeprecationWarning`-meddelanden aktiverade som standard, vilket gav Python-utvecklare en tydlig indikation på var deras kod kan brytas i en framtida större version av Python.

source: However, there are increasingly many users of Python-based applications who are not directly involved in the development of those applications. :exc:`DeprecationWarning` messages are irrelevant to such users, making them worry about an application that's actually working correctly and burdening application developers with responding to these concerns.
sv: Det finns dock allt fler användare av Python-baserade applikationer som inte är direkt involverade i utvecklingen av dessa applikationer. :exc:`DeprecationWarning`-meddelanden är irrelevanta för sådana användare, vilket gör att de oroar sig för en applikation som faktiskt fungerar korrekt och belastar applikationsutvecklare med att svara på dessa problem.

source: You can re-enable display of :exc:`DeprecationWarning` messages by running Python with the :option:`-Wdefault <-W>` (short form: :option:`-Wd <-W>`) switch, or by setting the :envvar:`PYTHONWARNINGS` environment variable to ``"default"`` (or ``"d"``) before running Python. Python code can also re-enable them by calling ``warnings.simplefilter('default')``.
sv: Du kan återaktivera visning av :exc:`DeprecationWarning`-meddelanden genom att köra Python med :option:`-Wdefault <-W>` (kortform: :option:`-Wd <-W>`), eller genom att ställa in miljövariabeln :envvar:`PYTHONWARNINGS` till ``"default"`` (eller ``"d"``) innan du kör Python. Python-kod kan också återaktivera dem genom att anropa ``warnings.simplefilter('default')``.

source: The ``unittest`` module also automatically reenables deprecation warnings when running tests.
sv: Modulen ``unittest`` återaktiverar också automatiskt deprecationsvarningar när tester körs.

source: Python 3.1 Features
sv: Python 3.1 Funktioner

source: Much as Python 2.6 incorporated features from Python 3.0, version 2.7 incorporates some of the new features in Python 3.1. The 2.x series continues to provide tools for migrating to the 3.x series.
sv: Precis som Python 2.6 innehöll funktioner från Python 3.0, innehåller version 2.7 några av de nya funktionerna i Python 3.1. 2.x-serien fortsätter att tillhandahålla verktyg för migrering till 3.x-serien.

source: A partial list of 3.1 features that were backported to 2.7:
sv: En partiell lista över funktioner i 3.1 som backporterades till 2.7:

source: The syntax for set literals (``{1,2,3}`` is a mutable set).
sv: Syntaxen för mängdlitteraler (``{1,2,3}`` är en föränderlig mängd).

source: Dictionary and set comprehensions (``{i: i*2 for i in range(3)}``).
sv: Dictionary och set comprehensions (``{i: i*2 for i in range(3)}``).

source: Multiple context managers in a single :keyword:`with` statement.
sv: Flera kontexthanterare i en enda :keyword:`with`-sats.

source: A new version of the :mod:`io` library, rewritten in C for performance.
sv: En ny version av biblioteket :mod:`io`, omskriven i C för bättre prestanda.

source: The ordered-dictionary type described in :ref:`pep-0372`.
sv: Typen ordered-dictionary som beskrivs i :ref:`pep-0372`.

source: The new ``","`` format specifier described in :ref:`pep-0378`.
sv: Den nya formatangivaren ``","`` som beskrivs i :ref:`pep-0378`.

source: The :class:`memoryview` object.
sv: Objektet :class:`memoryview`.

source: A small subset of the :mod:`importlib` module, `described below <#importlib-section>`__.
sv: En liten delmängd av modulen :mod:`importlib`, `beskrivs nedan <#importlib-sektionen>`__.

source: The :func:`repr` of a float ``x`` is shorter in many cases: it's now based on the shortest decimal string that's guaranteed to round back to ``x``. As in previous versions of Python, it's guaranteed that ``float(repr(x))`` recovers ``x``.
sv: :func:`repr` av en float ``x`` är kortare i många fall: den är nu baserad på den kortaste decimalsträngen som garanterat avrundar tillbaka till ``x``. Precis som i tidigare versioner av Python är det garanterat att ``float(repr(x))`` återställer ``x``.

source: Float-to-string and string-to-float conversions are correctly rounded. The :func:`round` function is also now correctly rounded.
sv: Konverteringar av float-till-sträng och sträng-till-float avrundas korrekt. Funktionen :func:`round` är nu också korrekt avrundad.

source: The :c:type:`PyCapsule` type, used to provide a C API for extension modules.
sv: Typen :c:type:`PyCapsule`, används för att tillhandahålla ett C API för tilläggsmoduler.

source: The :c:func:`PyLong_AsLongAndOverflow` C API function.
sv: C API-funktionen :c:func:`PyLong_AsLongAndOverflow`.

source: Other new Python3-mode warnings include:
sv: Andra nya varningar i Python3-läge inkluderar:

source: :func:`!operator.isCallable` and :func:`!operator.sequenceIncludes`, which are not supported in 3.x, now trigger warnings.
sv: :func:`!operator.isCallable` och :func:`!operator.sequenceIncludes`, som inte stöds i 3.x, utlöser nu varningar.

source: The :option:`!-3` switch now automatically enables the :option:`!-Qwarn` switch that causes warnings about using classic division with integers and long integers.
sv: Omkopplaren :option:`!-3` aktiverar nu automatiskt omkopplaren :option:`!-Qwarn` som varnar för att använda klassisk division med heltal och långa heltal.

source: PEP 372: Adding an Ordered Dictionary to collections
sv: PEP 372: Lägga till en ordnad ordbok i samlingar

source: Regular Python dictionaries iterate over key/value pairs in arbitrary order. Over the years, a number of authors have written alternative implementations that remember the order that the keys were originally inserted. Based on the experiences from those implementations, 2.7 introduces a new :class:`~collections.OrderedDict` class in the :mod:`collections` module.
sv: Vanliga Python-ordböcker itererar över nyckel/värde-par i godtycklig ordning. Under årens lopp har ett antal författare skrivit alternativa implementationer som kommer ihåg den ordning som nycklarna ursprungligen infogades. Baserat på erfarenheterna från dessa implementationer introducerar 2.7 en ny :class:`~collections.OrderedDict`-klass i :mod:`collections`-modulen.

source: The :class:`~collections.OrderedDict` API provides the same interface as regular dictionaries but iterates over keys and values in a guaranteed order depending on when a key was first inserted::
sv: API:et :class:`~collections.OrderedDict` har samma gränssnitt som vanliga ordböcker men itererar över nycklar och värden i en garanterad ordning beroende på när en nyckel först infogades::

source: >>> from collections import OrderedDict >>> d = OrderedDict([('first', 1), ... ('second', 2), ... ('third', 3)]) >>> d.items() [('first', 1), ('second', 2), ('third', 3)]
sv: >>> from collections import OrderedDict >>> d = OrderedDict([('first', 1), ... ('andra', 2), ... ('third', 3)]) >>> d.items() [('första', 1), ('andra', 2), ('tredje', 3)]

source: If a new entry overwrites an existing entry, the original insertion position is left unchanged::
sv: Om en ny post skriver över en befintlig post, lämnas den ursprungliga inmatningspositionen oförändrad::

source: >>> d['second'] = 4 >>> d.items() [('first', 1), ('second', 4), ('third', 3)]
sv: >>> d['andra'] = 4 >>> d.objekt() [('första', 1), ('andra', 4), ('tredje', 3)]

source: Deleting an entry and reinserting it will move it to the end::
sv: Om du tar bort en post och lägger in den igen flyttas den till slutet::

source: >>> del d['second'] >>> d['second'] = 5 >>> d.items() [('first', 1), ('third', 3), ('second', 5)]
sv: >>> del d['andra'] >>> d['andra'] = 5 >>> d.objekt() [('första', 1), ('tredje', 3), ('andra', 5)]

source: The :meth:`~collections.OrderedDict.popitem` method has an optional *last* argument that defaults to ``True``. If *last* is true, the most recently added key is returned and removed; if it's false, the oldest key is selected::
sv: Metoden :meth:`~collections.OrderedDict.popitem` har ett valfritt *last*-argument som har ``True`` som standard. Om *last* är true returneras och tas bort den senast tillagda nyckeln; om det är false väljs den äldsta nyckeln::

source: >>> od = OrderedDict([(x,0) for x in range(20)]) >>> od.popitem() (19, 0) >>> od.popitem() (18, 0) >>> od.popitem(last=False) (0, 0) >>> od.popitem(last=False) (1, 0)
sv: >>> od = OrderedDict([(x,0) for x in range(20)]) >>> od.popitem() (19, 0) >>> od.popitem() (18, 0) >>> od.popitem(sista=False) (0, 0) >>> od.popitem(sista=False) (1, 0)

source: Comparing two ordered dictionaries checks both the keys and values, and requires that the insertion order was the same::
sv: Jämförelse av två ordnade ordböcker kontrollerar både nycklar och värden och kräver att inmatningsordningen var densamma::

source: >>> od1 = OrderedDict([('first', 1), ... ('second', 2), ... ('third', 3)]) >>> od2 = OrderedDict([('third', 3), ... ('first', 1), ... ('second', 2)]) >>> od1 == od2 False >>> # Move 'third' key to the end >>> del od2['third']; od2['third'] = 3 >>> od1 == od2 True
sv: >>> od1 = OrderedDict([('first', 1), ... ('andra', 2), ... ('tredje', 3)]) >>> od2 = OrderedDict([('third', 3), ... ('första', 1), ... ('andra', 2)]) >>> od1 == od2 Falsk >>> # Flytta nyckeln 'tredje' till slutet >>> del od2['third']; od2['third'] = 3 >>> od1 == od2 Sant

source: Comparing an :class:`~collections.OrderedDict` with a regular dictionary ignores the insertion order and just compares the keys and values.
sv: Jämförelse av en :class:`~collections.OrderedDict` med en vanlig ordbok ignorerar insättningsordningen och jämför bara nycklarna och värdena.

source: How does the :class:`~collections.OrderedDict` work? It maintains a doubly linked list of keys, appending new keys to the list as they're inserted. A secondary dictionary maps keys to their corresponding list node, so deletion doesn't have to traverse the entire linked list and therefore remains *O*\ (1).
sv: Hur fungerar :class:`~collections.OrderedDict`? Den upprätthåller en dubbelt länkad lista med nycklar och lägger till nya nycklar i listan när de infogas. En sekundär ordbok mappar nycklar till deras motsvarande listnod, så radering behöver inte gå igenom hela den länkade listan och förblir därför *O*\ (1).

source: The standard library now supports use of ordered dictionaries in several modules.
sv: Standardbiblioteket stöder nu användning av ordnade lexikon i flera moduler.

source: The :mod:`ConfigParser <configparser>` module uses them by default, meaning that configuration files can now be read, modified, and then written back in their original order.
sv: Modulen :mod:`ConfigParser <configparser>` använder dem som standard, vilket innebär att konfigurationsfiler nu kan läsas, ändras och sedan skrivas tillbaka i sin ursprungliga ordning.

source: The :meth:`~collections.somenamedtuple._asdict` method for :func:`collections.namedtuple` now returns an ordered dictionary with the values appearing in the same order as the underlying tuple indices.
sv: Metoden :meth:`~collections.somenamedtuple._asdict` för :func:`collections.namedtuple` returnerar nu en ordnad ordbok där värdena visas i samma ordning som de underliggande tuple-indexen.

source: The :mod:`json` module's :class:`~json.JSONDecoder` class constructor was extended with an *object_pairs_hook* parameter to allow :class:`OrderedDict` instances to be built by the decoder. Support was also added for third-party tools like `PyYAML <https://pyyaml.org/>`_.
sv: :mod:`json`-modulens :class:`~json.JSONDecoder`-klassens konstruktor utökades med en *object_pairs_hook*-parameter för att tillåta att :class:`OrderedDict`-instanser byggs av avkodaren. Stöd har även lagts till för tredjepartsverktyg som `PyYAML <https://pyyaml.org/>`_.

source: :pep:`372` - Adding an ordered dictionary to collections
sv: :pep:`372` - Lägga till en ordnad ordbok i samlingar

source: PEP written by Armin Ronacher and Raymond Hettinger; implemented by Raymond Hettinger.
sv: PEP skriven av Armin Ronacher och Raymond Hettinger; implementerad av Raymond Hettinger.

source: PEP 378: Format Specifier for Thousands Separator
sv: PEP 378: Formatspecifikator för tusentalsavgränsare

source: To make program output more readable, it can be useful to add separators to large numbers, rendering them as 18,446,744,073,709,551,616 instead of 18446744073709551616.
sv: För att göra programutmatningen mer läsbar kan det vara bra att lägga till separatorer till stora tal, vilket gör att de visas som 18,446,744,073,709,551,616 istället för 18446744073709551616.

source: The fully general solution for doing this is the :mod:`locale` module, which can use different separators ("," in North America, "." in Europe) and different grouping sizes, but :mod:`locale` is complicated to use and unsuitable for multi-threaded applications where different threads are producing output for different locales.
sv: Den helt generella lösningen för att göra detta är modulen :mod:`locale`, som kan använda olika separatorer ("," i Nordamerika, "." i Europa) och olika gruppstorlekar, men :mod:`locale` är komplicerad att använda och olämplig för flertrådade program där olika trådar producerar utdata för olika lokaler.
