Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: The :mod:`ssl` module's :class:`~ssl.SSLSocket` objects now support the buffer API, which fixed a test suite failure (fix by Antoine Pitrou; :issue:`7133`) and automatically set OpenSSL's :c:macro:`!SSL_MODE_AUTO_RETRY`, which will prevent an error code being returned from :meth:`recv` operations that trigger an SSL renegotiation (fix by Antoine Pitrou; :issue:`8222`).
sv: :mod:`ssl`-modulens :class:`~ssl.SSLSocket`-objekt stöder nu buffer-API:t, vilket åtgärdade ett fel i en testsvit (fixad av Antoine Pitrou; :issue:`7133`) och automatiskt ställer in OpenSSL:s :c:macro:`!SSL_MODE_AUTO_RETRY`, vilket förhindrar att en felkod returneras från :meth:`recv`-operationer som utlöser en SSL-omförhandling (fixad av Antoine Pitrou; :issue:`8222`).

source: The :func:`~ssl.SSLContext.wrap_socket` constructor function now takes a *ciphers* argument that's a string listing the encryption algorithms to be allowed; the format of the string is described `in the OpenSSL documentation <https://docs.openssl.org/1.0.2/man1/ciphers/>`__. (Added by Antoine Pitrou; :issue:`8322`.)
sv: Konstruktorfunktionen :func:`~ssl.SSLContext.wrap_socket` tar nu ett *ciphers*-argument som är en sträng som listar de krypteringsalgoritmer som ska tillåtas; strängens format beskrivs `i OpenSSL-dokumentationen <https://docs.openssl.org/1.0.2/man1/ciphers/>`__. (Tillagd av Antoine Pitrou; :issue:`8322`.)

source: Another change makes the extension load all of OpenSSL's ciphers and digest algorithms so that they're all available. Some SSL certificates couldn't be verified, reporting an "unknown algorithm" error. (Reported by Beda Kosata, and fixed by Antoine Pitrou; :issue:`8484`.)
sv: En annan ändring gör att tillägget laddar alla OpenSSL:s chiffer och digest-algoritmer så att de alla är tillgängliga. Vissa SSL-certifikat kunde inte verifieras och rapporterade ett "okänd algoritm"-fel. (Rapporterat av Beda Kosata, och åtgärdat av Antoine Pitrou; :issue:`8484`.)

source: The version of OpenSSL being used is now available as the module attributes :const:`ssl.OPENSSL_VERSION` (a string), :const:`ssl.OPENSSL_VERSION_INFO` (a 5-tuple), and :const:`ssl.OPENSSL_VERSION_NUMBER` (an integer). (Added by Antoine Pitrou; :issue:`8321`.)
sv: Den version av OpenSSL som används är nu tillgänglig som modulattributen :const:`ssl.OPENSSL_VERSION` (en sträng), :const:`ssl.OPENSSL_VERSION_INFO` (en 5-tupel) och :const:`ssl.OPENSSL_VERSION_NUMBER` (ett heltal). (Tillagd av Antoine Pitrou; :issue:`8321`.)

source: The :mod:`struct` module will no longer silently ignore overflow errors when a value is too large for a particular integer format code (one of ``bBhHiIlLqQ``); it now always raises a :exc:`struct.error` exception. (Changed by Mark Dickinson; :issue:`1523`.) The :func:`~struct.pack` function will also attempt to use :meth:`~object.__index__` to convert and pack non-integers before trying the :meth:`~object.__int__` method or reporting an error. (Changed by Mark Dickinson; :issue:`8300`.)
sv: Modulen :mod:`struct` ignorerar inte längre överfyllnadsfel när ett värde är för stort för en viss heltalsformatkod (en av ``bBhHiIlLqQ``); den ger nu alltid upphov till ett :exc:`struct.error`-undantag. (Ändrad av Mark Dickinson; :issue:`1523`.) Funktionen :func:`~struct.pack` kommer också att försöka använda :meth:`~object.__index__` för att konvertera och packa icke-integraler innan den försöker med metoden :meth:`~object.__int__` eller rapporterar ett fel. (Ändrad av Mark Dickinson; :issue:`8300`.)

source: New function: the :mod:`subprocess` module's :func:`~subprocess.check_output` runs a command with a specified set of arguments and returns the command's output as a string when the command runs without error, or raises a :exc:`~subprocess.CalledProcessError` exception otherwise.
sv: Ny funktion: :mod:`subprocess`-modulens :func:`~subprocess.check_output` kör ett kommando med en angiven uppsättning argument och returnerar kommandots utdata som en sträng när kommandot körs utan fel, eller ger upphov till ett :exc:`~subprocess.CalledProcessError`-undantag i annat fall.

source: >>> subprocess.check_output(['df', '-h', '.']) 'Filesystem Size Used Avail Capacity Mounted on\n /dev/disk0s2 52G 49G 3.0G 94% /\n' >>> subprocess.check_output(['df', '-h', '/bogus']) ... subprocess.CalledProcessError: Command '['df', '-h', '/bogus']' returned non-zero exit status 1
sv: >>> subprocess.check_output(['df', '-h', '.']) 'Filsystem Storlek Använd Avail Kapacitet Monterad på\n /dev/disk0s2 52G 49G 3.0G 94% /\n' >>> subprocess.check_output(['df', '-h', '/bogus']) ... subprocess.CalledProcessError: Kommandot '['df', '-h', '/bogus']' returnerade utgångsstatus 1 som inte var noll

source: (Contributed by Gregory P. Smith.)
sv: (Bidrag från Gregory P. Smith.)

source: The :mod:`subprocess` module will now retry its internal system calls on receiving an :const:`~errno.EINTR` signal. (Reported by several people; final patch by Gregory P. Smith in :issue:`1068268`.)
sv: Modulen :mod:`subprocess` kommer nu att försöka igen med sina interna systemanrop när den får en :const:`~errno.EINTR`-signal. (Rapporterades av flera personer; slutlig patch av Gregory P. Smith i :issue:`1068268`.)

source: New function: :func:`~symtable.Symbol.is_declared_global` in the :mod:`symtable` module returns true for variables that are explicitly declared to be global, false for ones that are implicitly global. (Contributed by Jeremy Hylton.)
sv: Ny funktion: :func:`~symtable.Symbol.is_declared_global` i modulen :mod:`symtable` returnerar true för variabler som uttryckligen deklarerats vara globala, false för sådana som är implicit globala. (Bidrag från Jeremy Hylton.)

source: The :mod:`syslog` module will now use the value of ``sys.argv[0]`` as the identifier instead of the previous default value of ``'python'``. (Changed by Sean Reifschneider; :issue:`8451`.)
sv: Modulen :mod:`syslog` kommer nu att använda värdet av ``sys.argv[0]`` som identifierare istället för det tidigare standardvärdet ``'python'``. (Ändrad av Sean Reifschneider; :issue:`8451`.)

source: The :data:`sys.version_info` value is now a named tuple, with attributes named :attr:`!major`, :attr:`!minor`, :attr:`!micro`, :attr:`!releaselevel`, and :attr:`!serial`. (Contributed by Ross Light; :issue:`4285`.)
sv: Värdet :data:`sys.version_info` är nu en namngiven tupel, med attributen :attr:`!major`, :attr:`!minor`, :attr:`!micro`, :attr:`!releaselevel` och :attr:`!serial`. (Bidrag från Ross Light; :issue:`4285`.)

source: :func:`sys.getwindowsversion` also returns a named tuple, with attributes named :attr:`!major`, :attr:`!minor`, :attr:`!build`, :attr:`!platform`, :attr:`!service_pack`, :attr:`!service_pack_major`, :attr:`!service_pack_minor`, :attr:`!suite_mask`, and :attr:`!product_type`. (Contributed by Brian Curtin; :issue:`7766`.)
sv: :func:`sys.getwindowsversion` returnerar också en namngiven tupel, med attributen :attr:`!major`, :attr:`!minor`, :attr:`!build`, :attr:`!platform`, :attr:`!service_pack`, :attr:`!service_pack_major`, :attr:`!service_pack_minor`, :attr:`!suite_mask` och :attr:`!product_type`. (Bidrag från Brian Curtin; :issue:`7766`.)

source: The :mod:`tarfile` module's default error handling has changed, to no longer suppress fatal errors. The default error level was previously 0, which meant that errors would only result in a message being written to the debug log, but because the debug log is not activated by default, these errors go unnoticed. The default error level is now 1, which raises an exception if there's an error. (Changed by Lars Gustäbel; :issue:`7357`.)
sv: Standardfelhanteringen i modulen :mod:`tarfile` har ändrats så att fatala fel inte längre undertrycks. Den förinställda felnivån var tidigare 0, vilket innebar att fel bara resulterade i att ett meddelande skrevs till debugloggen, men eftersom debugloggen inte är aktiverad som standard går dessa fel obemärkta förbi. Standardnivån för fel är nu 1, vilket innebär att ett undantag uppstår om ett fel inträffar. (Ändrad av Lars Gustäbel; :issue:`7357`.)

source: :mod:`tarfile` now supports filtering the :class:`~tarfile.TarInfo` objects being added to a tar file. When you call :meth:`~tarfile.TarFile.add`, you may supply an optional *filter* argument that's a callable. The *filter* callable will be passed the :class:`~tarfile.TarInfo` for every file being added, and can modify and return it. If the callable returns ``None``, the file will be excluded from the resulting archive. This is more powerful than the existing *exclude* argument, which has therefore been deprecated. (Added by Lars Gustäbel; :issue:`6856`.) The :class:`~tarfile.TarFile` class also now supports the context management protocol. (Added by Lars Gustäbel; :issue:`7232`.)
sv: :mod:`tarfile` stöder nu filtrering av :class:`~tarfile.TarInfo`-objekt som läggs till i en tar-fil. När du anropar :meth:`~tarfile.TarFile.add` kan du ange ett valfritt *filter*-argument som är en anropsbarhet. Anropsbarheten *filter* kommer att få :class:`~tarfile.TarInfo` för varje fil som läggs till, och kan modifiera och returnera den. Om den anropsbara filen returnerar ``None`` kommer filen att uteslutas från det resulterande arkivet. Detta är mer kraftfullt än det befintliga *exclude*-argumentet, som därför har utgått. (Tillagd av Lars Gustäbel; :issue:`6856`.) Klassen :class:`~tarfile.TarFile` har nu också stöd för kontexthanteringsprotokollet. (Tillagd av Lars Gustäbel; :issue:`7232`.)

source: The :meth:`~threading.Event.wait` method of the :class:`threading.Event` class now returns the internal flag on exit. This means the method will usually return true because :meth:`~threading.Event.wait` is supposed to block until the internal flag becomes true. The return value will only be false if a timeout was provided and the operation timed out. (Contributed by Tim Lesher; :issue:`1674032`.)
sv: Metoden :meth:`~threading.Event.wait` i klassen :class:`threading.Event` returnerar nu den interna flaggan vid avslut. Detta innebär att metoden vanligtvis returnerar true eftersom :meth:`~threading.Event.wait` är tänkt att blockera tills den interna flaggan blir true. Returvärdet kommer bara att vara falskt om en timeout angavs och operationen timade ut. (Bidrag från Tim Lesher; :issue:`1674032`.)

source: The Unicode database provided by the :mod:`unicodedata` module is now used internally to determine which characters are numeric, whitespace, or represent line breaks. The database also includes information from the :file:`Unihan.txt` data file (patch by Anders Chrigström and Amaury Forgeot d'Arc; :issue:`1571184`) and has been updated to version 5.2.0 (updated by Florent Xicluna; :issue:`8024`).
sv: Unicode-databasen som tillhandahålls av modulen :mod:`unicodedata` används nu internt för att avgöra vilka tecken som är numeriska, blanksteg eller representerar radbrytningar. Databasen innehåller även information från datafilen :file:`Unihan.txt` (patch av Anders Chrigström och Amaury Forgeot d'Arc; :issue:`1571184`) och har uppdaterats till version 5.2.0 (uppdaterad av Florent Xicluna; :issue:`8024`).

source: The :mod:`urlparse <urllib.parse>` module's :func:`~urllib.parse.urlsplit` now handles unknown URL schemes in a fashion compliant with :rfc:`3986`: if the URL is of the form ``"<something>://..."``, the text before the ``://`` is treated as the scheme, even if it's a made-up scheme that the module doesn't know about. This change may break code that worked around the old behaviour. For example, Python 2.6.4 or 2.5 will return the following:
sv: :mod:`urlparse <urllib.parse>`-modulens :func:`~urllib.parse.urlsplit` hanterar nu okända URL-scheman på ett sätt som överensstämmer med :rfc:`3986`: om URL:en är av formen ``"<something>://..."``, behandlas texten före ``://`` som schemat, även om det är ett påhittat schema som modulen inte känner till. Denna förändring kan bryta kod som fungerade runt det gamla beteendet. Till exempel kommer Python 2.6.4 eller 2.5 att returnera följande:

source: Python 2.7 (and Python 2.6.5) will return:
sv: Python 2.7 (och Python 2.6.5) kommer att returnera:

source: (Python 2.7 actually produces slightly different output, since it returns a named tuple instead of a standard tuple.)
sv: (Python 2.7 ger faktiskt något annorlunda resultat, eftersom den returnerar en namngiven tupel i stället för en standardtupel)

source: The :mod:`urlparse <urllib.parse>` module also supports IPv6 literal addresses as defined by :rfc:`2732` (contributed by Senthil Kumaran; :issue:`2987`).
sv: Modulen :mod:`urlparse <urllib.parse>` har även stöd för IPv6-litterära adresser enligt definitionen i :rfc:`2732` (bidrag från Senthil Kumaran; :issue:`2987`).

source: New class: the :class:`~weakref.WeakSet` class in the :mod:`weakref` module is a set that only holds weak references to its elements; elements will be removed once there are no references pointing to them. (Originally implemented in Python 3.x by Raymond Hettinger, and backported to 2.7 by Michael Foord.)
sv: Ny klass: Klassen :class:`~weakref.WeakSet` i modulen :mod:`weakref` är en uppsättning som endast innehåller svaga referenser till dess element; elementen kommer att tas bort när det inte finns några referenser som pekar på dem. (Ursprungligen implementerad i Python 3.x av Raymond Hettinger, och backporterad till 2.7 av Michael Foord.)

source: The :mod:`xml.etree.ElementTree` library, no longer escapes ampersands and angle brackets when outputting an XML processing instruction (which looks like ``<?xml-stylesheet href="#style1"?>``) or comment (which looks like ``<!-- comment -->``). (Patch by Neil Muller; :issue:`2746`.)
sv: Biblioteket :mod:`xml.etree.ElementTree` escapar inte längre ampersand och vinkelparenteser vid utmatning av en XML-bearbetningsinstruktion (som ser ut som ``<?xml-stylesheet href="#style1"?>``) eller kommentar (som ser ut som ``<!-- comment -->``). (Patch av Neil Muller; :issue:`2746`.)

source: The XML-RPC client and server, provided by the :mod:`xmlrpclib <xmlrpc.client>` and :mod:`SimpleXMLRPCServer <xmlrpc.server>` modules, have improved performance by supporting HTTP/1.1 keep-alive and by optionally using gzip encoding to compress the XML being exchanged. The gzip compression is controlled by the :attr:`!encode_threshold` attribute of :class:`~xmlrpc.server.SimpleXMLRPCRequestHandler`, which contains a size in bytes; responses larger than this will be compressed. (Contributed by Kristján Valur Jónsson; :issue:`6267`.)
sv: XML-RPC-klienten och -servern, som tillhandahålls av modulerna :mod:`xmlrpclib <xmlrpc.client>` och :mod:`SimpleXMLRPCServer <xmlrpc.server>`, har förbättrad prestanda genom att stödja HTTP/1.1 keep-alive och genom att valfritt använda gzip-kodning för att komprimera XML som utväxlas. Gzip-komprimeringen styrs av attributet :attr:`!encode_threshold` i :class:`~xmlrpc.server.SimpleXMLRPCRequestHandler`, som innehåller en storlek i byte; svar som är större än detta kommer att komprimeras. (Bidrag från Kristján Valur Jónsson; :issue:`6267`.)

source: The :mod:`zipfile` module's :class:`~zipfile.ZipFile` now supports the context management protocol, so you can write ``with zipfile.ZipFile(...) as f:``. (Contributed by Brian Curtin; :issue:`5511`.)
sv: Modulen :mod:`zipfile` :class:`~zipfile.ZipFile` har nu stöd för kontexthanteringsprotokollet, så att du kan skriva ``med zipfile.ZipFile(...) som f:``. (Bidrag från Brian Curtin; :issue:`5511`.)

source: :mod:`zipfile` now also supports archiving empty directories and extracts them correctly. (Fixed by Kuba Wieczorek; :issue:`4710`.) Reading files out of an archive is faster, and interleaving :meth:`read() <io.BufferedIOBase.read>` and :meth:`readline() <io.IOBase.readline>` now works correctly. (Contributed by Nir Aides; :issue:`7610`.)
sv: :mod:`zipfile` stöder nu även arkivering av tomma kataloger och extraherar dem korrekt. (Åtgärdat av Kuba Wieczorek; :issue:`4710`.) Det går snabbare att läsa filer ur ett arkiv, och sammankopplingen av :meth:`read() <io.BufferedIOBase.read>` och :meth:`readline() <io.IOBase.readline>` fungerar nu korrekt. (Bidrag från Nir Aides; :issue:`7610`.)

source: The :func:`~zipfile.is_zipfile` function now accepts a file object, in addition to the path names accepted in earlier versions. (Contributed by Gabriel Genellina; :issue:`4756`.)
sv: Funktionen :func:`~zipfile.is_zipfile` accepterar nu ett filobjekt, utöver de sökvägsnamn som accepterades i tidigare versioner. (Bidrag från Gabriel Genellina; :issue:`4756`.)

source: The :meth:`~zipfile.ZipFile.writestr` method now has an optional *compress_type* parameter that lets you override the default compression method specified in the :class:`~zipfile.ZipFile` constructor. (Contributed by Ronald Oussoren; :issue:`6003`.)
sv: Metoden :meth:`~zipfile.ZipFile.writestr` har nu en valfri parameter *compress_type* som låter dig åsidosätta den standardkomprimeringsmetod som anges i konstruktören :class:`~zipfile.ZipFile`. (Bidrag från Ronald Oussoren; :issue:`6003`.)

source: New module: importlib
sv: Ny modul: importlib

source: Python 3.1 includes the :mod:`importlib` package, a re-implementation of the logic underlying Python's :keyword:`import` statement. :mod:`importlib` is useful for implementers of Python interpreters and to users who wish to write new importers that can participate in the import process. Python 2.7 doesn't contain the complete :mod:`importlib` package, but instead has a tiny subset that contains a single function, :func:`~importlib.import_module`.
sv: Python 3.1 innehåller paketet :mod:`importlib`, en omimplementering av den logik som ligger bakom Pythons :keyword:`import`. :mod:`importlib` är användbart för implementatörer av Python-tolkar och för användare som vill skriva nya importörer som kan delta i importprocessen. Python 2.7 innehåller inte hela :mod:`importlib`-paketet, utan istället en liten delmängd som innehåller en enda funktion, :func:`~importlib.import_module`.

source: ``import_module(name, package=None)`` imports a module. *name* is a string containing the module or package's name. It's possible to do relative imports by providing a string that begins with a ``.`` character, such as ``..utils.errors``. For relative imports, the *package* argument must be provided and is the name of the package that will be used as the anchor for the relative import. :func:`~importlib.import_module` both inserts the imported module into ``sys.modules`` and returns the module object.
sv: ``import_module(name, package=None)`` importerar en modul. *name* är en sträng som innehåller modulens eller paketets namn. Det är möjligt att göra relativ import genom att ange en sträng som börjar med tecknet ``.``, t.ex. ``..utils.errors``. För relativ import måste argumentet *package* anges och är namnet på det paket som kommer att användas som ankare för den relativa importen. :func:`~importlib.import_module` både infogar den importerade modulen i ``sys.modules`` och returnerar modulobjektet.

source: Here are some examples::
sv: Här är några exempel::

source: >>> from importlib import import_module >>> anydbm = import_module('anydbm') # Standard absolute import >>> anydbm <module 'anydbm' from '/p/python/Lib/anydbm.py'> >>> # Relative import >>> file_util = import_module('..file_util', 'distutils.command') >>> file_util <module 'distutils.file_util' from '/python/Lib/distutils/file_util.pyc'>
sv: >>> från importlib import import_modul >>> anydbm = import_module('anydbm') # Standard absolut import >>> anydbm <Modul 'anydbm' från '/p/python/Lib/anydbm.py'> >>> # Relativ import >>> # Relativ import >>> file_util = import_module('..file_util', 'distutils.command') >>> file_util <modul 'distutils.file_util' från '/python/Lib/distutils/file_util.pyc'>

source: :mod:`importlib` was implemented by Brett Cannon and introduced in Python 3.1.
sv: :mod:`importlib` implementerades av Brett Cannon och infördes i Python 3.1.

source: New module: sysconfig
sv: Ny modul: sysconfig

source: The :mod:`sysconfig` module has been pulled out of the Distutils package, becoming a new top-level module in its own right. :mod:`sysconfig` provides functions for getting information about Python's build process: compiler switches, installation paths, the platform name, and whether Python is running from its source directory.
sv: Modulen :mod:`sysconfig` har dragits ut ur Distutils-paketet och blivit en ny toppnivåmodul i sin egen rätt. :mod:`sysconfig` innehåller funktioner för att få information om Pythons byggprocess: kompilatorbyten, installationssökvägar, plattformsnamn och om Python körs från källkatalogen.

source: Some of the functions in the module are:
sv: Några av funktionerna i modulen är:

source: :func:`~sysconfig.get_config_var` returns variables from Python's Makefile and the :file:`pyconfig.h` file.
sv: :func:`~sysconfig.get_config_var` returnerar variabler från Pythons Makefile och filen :file:`pyconfig.h`.

source: :func:`~sysconfig.get_config_vars` returns a dictionary containing all of the configuration variables.
sv: :func:`~sysconfig.get_config_vars` returnerar en ordbok som innehåller alla konfigurationsvariabler.

source: :func:`~sysconfig.get_path` returns the configured path for a particular type of module: the standard library, site-specific modules, platform-specific modules, etc.
sv: :func:`~sysconfig.get_path` returnerar den konfigurerade sökvägen för en viss typ av modul: standardbiblioteket, platsspecifika moduler, plattformsspecifika moduler etc.

source: :func:`~sysconfig.is_python_build` returns true if you're running a binary from a Python source tree, and false otherwise.
sv: :func:`~sysconfig.is_python_build` returnerar true om du kör en binärfil från ett Python-källträd, och false annars.

source: Consult the :mod:`sysconfig` documentation for more details and for a complete list of functions.
sv: Mer information och en fullständig lista över funktioner finns i :mod:`sysconfig`-dokumentationen.

source: The Distutils package and :mod:`sysconfig` are now maintained by Tarek Ziadé, who has also started a Distutils2 package (source repository at https://hg.python.org/distutils2/) for developing a next-generation version of Distutils.
sv: Distutils-paketet och :mod:`sysconfig` underhålls nu av Tarek Ziadé, som också har startat ett Distutils2-paket (källförvar på https://hg.python.org/distutils2/) för att utveckla en nästa generations version av Distutils.

source: ttk: Themed Widgets for Tk
sv: ttk: Tematiserade widgets för Tk

source: Tcl/Tk 8.5 includes a set of themed widgets that re-implement basic Tk widgets but have a more customizable appearance and can therefore more closely resemble the native platform's widgets. This widget set was originally called Tile, but was renamed to Ttk (for "themed Tk") on being added to Tcl/Tck release 8.5.
sv: Tcl/Tk 8.5 innehåller en uppsättning tematiska widgetar som återimplementerar grundläggande Tk-widgetar men har ett mer anpassningsbart utseende och därför kan likna den inbyggda plattformens widgetar mer. Denna widgetuppsättning kallades ursprungligen Tile, men döptes om till Ttk (för "themed Tk") när den lades till i Tcl/Tck version 8.5.

source: To learn more, read the :mod:`~tkinter.ttk` module documentation. You may also wish to read the Tcl/Tk manual page describing the Ttk theme engine, available at https://www.tcl.tk/man/tcl8.5/TkCmd/ttk_intro.html. Some screenshots of the Python/Ttk code in use are at https://code.google.com/archive/p/python-ttk/wikis/Screenshots.wiki.
sv: Om du vill veta mer kan du läsa dokumentationen för modulen :mod:`~tkinter.ttk`. Du kanske också vill läsa Tcl/Tk-manualsidan som beskriver Ttk-temamotorn, som finns på https://www.tcl.tk/man/tcl8.5/TkCmd/ttk_intro.html. Några skärmdumpar av Python/Ttk-koden som används finns på https://code.google.com/archive/p/python-ttk/wikis/Screenshots.wiki.
