Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: from xml.etree import ElementTree as ET t = ET.XML("""<list> <item>1</item> <item>2</item> <item>3</item> </list>""") new = ET.XML('<root/>') new.extend(t) # Outputs <root><item>1</item>...</root> print ET.tostring(new)
sv: from xml.etree import ElementTree as ET t = ET.XML("""<list> <item>1</item> <item>2</item> <item>3</item> </list>""") new = ET.XML('<root/>') new.extend(t) # Utmatning <root><item>1.</item>..</root> print ET.tostring(ny)

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.iter` yields the children of the element as a generator. It's also possible to write ``for child in elem:`` to loop over an element's children. The existing method :meth:`!getiterator` is now deprecated, as is :meth:`!getchildren` which constructs and returns a list of children.
sv: Ny :class:`~xml.etree.ElementTree.Element`-metod: :meth:`~xml.etree.ElementTree.Element.iter` ger elementets barn som en generator. Det är också möjligt att skriva ``for child in elem:`` för att loopa över ett elements barn. Den befintliga metoden :meth:`!getiterator` är nu avförd, liksom :meth:`!getchildren` som konstruerar och returnerar en lista med barn.

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.itertext` yields all chunks of text that are descendants of the element. For example::
sv: Ny :class:`~xml.etree.ElementTree.Element` metod: :meth:`~xml.etree.ElementTree.Element.itertext` ger alla textstycken som är ättlingar till elementet. Till exempel::

source: t = ET.XML("""<list> <item>1</item> <item>2</item> <item>3</item> </list>""") # Outputs ['\n ', '1', ' ', '2', ' ', '3', '\n'] print list(t.itertext())
sv: t = ET.XML(""")<list> <item>1</item> <item>2</item> <item>3</item> </list>""") # Utgångar ['\n ', '1', ' ', '2', ' ', '3', '\n'] print list(t.itertext())

source: Deprecated: using an element as a Boolean (i.e., ``if elem:``) would return true if the element had any children, or false if there were no children. This behaviour is confusing -- ``None`` is false, but so is a childless element? -- so it will now trigger a :exc:`FutureWarning`. In your code, you should be explicit: write ``len(elem) != 0`` if you're interested in the number of children, or ``elem is not None``.
sv: Föråldrad: Om ett element användes som en booleansk formel (t.ex. ``if elem:``) skulle resultatet bli sant om elementet hade några barn, eller falskt om det inte hade några barn. Detta beteende är förvirrande -- ``None`` är falskt, men det är ett barnlöst element också? -- så det kommer nu att utlösa en :exc:`FutureWarning`. I din kod bör du vara explicit: skriv ``len(elem) != 0`` om du är intresserad av antalet barn, eller ``elem är inte None``.

source: Fredrik Lundh develops ElementTree and produced the 1.3 version; you can read his article describing 1.3 at https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Florent Xicluna updated the version included with Python, after discussions on python-dev and in :issue:`6472`.)
sv: Fredrik Lundh utvecklar ElementTree och har tagit fram version 1.3; du kan läsa hans artikel som beskriver 1.3 på https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Florent Xicluna uppdaterade den version som ingår i Python, efter diskussioner på python-dev och i :issue:`6472`)

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Changes to Python's build process and to the C API include:
sv: Ändringar i Pythons byggprocess och i C API inkluderar:

source: The latest release of the GNU Debugger, GDB 7, can be `scripted using Python <https://web.archive.org/web/20110715084810/http://sourceware.org/gdb/current/onlinedocs/gdb/Python.html>`__. When you begin debugging an executable program P, GDB will look for a file named ``P-gdb.py`` and automatically read it. Dave Malcolm contributed a :file:`python-gdb.py` that adds a number of commands useful when debugging Python itself. For example, ``py-up`` and ``py-down`` go up or down one Python stack frame, which usually corresponds to several C stack frames. ``py-print`` prints the value of a Python variable, and ``py-bt`` prints the Python stack trace. (Added as a result of :issue:`8032`.)
sv: Den senaste versionen av GNU Debugger, GDB 7, kan skrivas med hjälp av Python <https://web.archive.org/web/20110715084810/http://sourceware.org/gdb/current/onlinedocs/gdb/Python.html>`__. När du börjar felsöka ett körbart program P kommer GDB att leta efter en fil med namnet ``P-gdb.py`` och automatiskt läsa den. Dave Malcolm bidrog med en :fil:`python-gdb.py` som lägger till ett antal kommandon som är användbara vid debuggning av Python självt. Till exempel går ``py-up`` och ``py-down`` upp eller ner en Python-stackram, vilket vanligtvis motsvarar flera C-stackramar. ``py-print`` skriver ut värdet på en Python-variabel och ``py-bt`` skriver ut Pythons stackspårning. (Tillagd som ett resultat av :issue:`8032`.)

source: If you use the :file:`.gdbinit` file provided with Python, the "pyo" macro in the 2.7 version now works correctly when the thread being debugged doesn't hold the GIL; the macro now acquires it before printing. (Contributed by Victor Stinner; :issue:`3632`.)
sv: Om du använder filen :file:`.gdbinit` som medföljer Python, fungerar nu makrot "pyo" i 2.7-versionen korrekt när tråden som felsöks inte har GIL; makrot hämtar nu GIL innan det skrivs ut. (Bidrag från Victor Stinner; :issue:`3632`.)

source: :c:func:`Py_AddPendingCall` is now thread-safe, letting any worker thread submit notifications to the main Python thread. This is particularly useful for asynchronous IO operations. (Contributed by Kristján Valur Jónsson; :issue:`4293`.)
sv: :c:func:`Py_AddPendingCall` är nu trådsäker, vilket gör att alla arbetstrådar kan skicka meddelanden till Pythons huvudtråd. Detta är särskilt användbart för asynkrona IO-operationer. (Bidrag från Kristján Valur Jónsson; :issue:`4293`.)

source: New function: :c:func:`PyCode_NewEmpty` creates an empty code object; only the filename, function name, and first line number are required. This is useful for extension modules that are attempting to construct a more useful traceback stack. Previously such extensions needed to call :c:func:`!PyCode_New`, which had many more arguments. (Added by Jeffrey Yasskin.)
sv: Ny funktion: :c:func:`PyCode_NewEmpty` skapar ett tomt kodobjekt; endast filnamnet, funktionsnamnet och första radnumret krävs. Detta är användbart för tilläggsmoduler som försöker konstruera en mer användbar traceback-stack. Tidigare behövde sådana tillägg anropa :c:func:`!PyCode_New`, som hade många fler argument. (Tillagd av Jeffrey Yasskin.)

source: New function: :c:func:`PyErr_NewExceptionWithDoc` creates a new exception class, just as the existing :c:func:`PyErr_NewException` does, but takes an extra ``char *`` argument containing the docstring for the new exception class. (Added by 'lekma' on the Python bug tracker; :issue:`7033`.)
sv: Ny funktion: :c:func:`PyErr_NewExceptionWithDoc` skapar en ny undantagsklass, precis som den befintliga :c:func:`PyErr_NewException` gör, men tar ett extra ``char *`` argument som innehåller dokumentsträngen för den nya undantagsklassen. (Tillagd av 'lekma' på Pythons buggtracker; :issue:`7033`.)

source: New function: :c:func:`PyFrame_GetLineNumber` takes a frame object and returns the line number that the frame is currently executing. Previously code would need to get the index of the bytecode instruction currently executing, and then look up the line number corresponding to that address. (Added by Jeffrey Yasskin.)
sv: Ny funktion: :c:func:`PyFrame_GetLineNumber` tar ett ramobjekt och returnerar det radnummer som ramen för närvarande exekverar. Tidigare skulle koden behöva hämta indexet för den bytecode-instruktion som för närvarande körs och sedan leta upp radnumret som motsvarar den adressen. (Tillagd av Jeffrey Yasskin.)

source: New functions: :c:func:`PyLong_AsLongAndOverflow` and :c:func:`PyLong_AsLongLongAndOverflow` approximates a Python long integer as a C :c:expr:`long` or :c:expr:`long long`. If the number is too large to fit into the output type, an *overflow* flag is set and returned to the caller. (Contributed by Case Van Horsen; :issue:`7528` and :issue:`7767`.)
sv: Nya funktioner: :c:func:`PyLong_AsLongAndOverflow` och :c:func:`PyLong_AsLongLongAndOverflow` approximerar ett Python long integer som ett C :c:expr:`long` eller :c:expr:`long long`. Om talet är för stort för att passa in i utdatatypen sätts en *overflow*-flagga och returneras till den som anropar. (Bidrag från Case Van Horsen; :issue:`7528` och :issue:`7767`.)

source: New function: stemming from the rewrite of string-to-float conversion, a new :c:func:`PyOS_string_to_double` function was added. The old :c:func:`!PyOS_ascii_strtod` and :c:func:`!PyOS_ascii_atof` functions are now deprecated.
sv: Ny funktion: På grund av omskrivningen av sträng-till-float-konvertering har en ny :c:func:`PyOS_string_to_double`-funktion lagts till. De gamla funktionerna :c:func:`!PyOS_ascii_strtod` och :c:func:`!PyOS_ascii_atof` är nu föråldrade.

source: New function: :c:func:`!PySys_SetArgvEx` sets the value of ``sys.argv`` and can optionally update ``sys.path`` to include the directory containing the script named by ``sys.argv[0]`` depending on the value of an *updatepath* parameter.
sv: Ny funktion: :c:func:`!PySys_SetArgvEx` sätter värdet på ``sys.argv`` och kan eventuellt uppdatera ``sys.path`` till att inkludera katalogen som innehåller skriptet som heter ``sys.argv[0]`` beroende på värdet av en *updatepath*-parameter.

source: This function was added to close a security hole for applications that embed Python. The old function, :c:func:`!PySys_SetArgv`, would always update ``sys.path``, and sometimes it would add the current directory. This meant that, if you ran an application embedding Python in a directory controlled by someone else, attackers could put a Trojan-horse module in the directory (say, a file named :file:`os.py`) that your application would then import and run.
sv: Denna funktion lades till för att täppa till ett säkerhetshål för program som bäddar in Python. Den gamla funktionen, :c:func:`!PySys_SetArgv`, uppdaterade alltid ``sys.path``, och ibland lade den till den aktuella katalogen. Detta innebar att om du körde ett program som bäddade in Python i en katalog som kontrollerades av någon annan, kunde angripare lägga in en trojansk modul i katalogen (till exempel en fil med namnet :file:`os.py`) som ditt program sedan importerade och körde.

source: If you maintain a C/C++ application that embeds Python, check whether you're calling :c:func:`!PySys_SetArgv` and carefully consider whether the application should be using :c:func:`!PySys_SetArgvEx` with *updatepath* set to false.
sv: Om du underhåller ett C/C++-program som innehåller Python, kontrollera om du anropar :c:func:`!PySys_SetArgv` och överväg noga om programmet ska använda :c:func:`!PySys_SetArgvEx` med *updatepath* satt till false.

source: Security issue reported as :cve:`2008-5983`; discussed in :issue:`5753`, and fixed by Antoine Pitrou.
sv: Säkerhetsproblem rapporterat som :cve:`2008-5983`; diskuterat i :issue:`5753`, och åtgärdat av Antoine Pitrou.

source: New macros: the Python header files now define the following macros: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, :c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER`, and :c:macro:`Py_TOUPPER`. All of these functions are analogous to the C standard macros for classifying characters, but ignore the current locale setting, because in several places Python needs to analyze characters in a locale-independent way. (Added by Eric Smith; :issue:`5793`.)
sv: Nya makron: Pythons rubrikfiler definierar nu följande makron: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, :c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER`, och :c:macro:`Py_TOUPPER`. Alla dessa funktioner är analoga med C-standardmakron för att klassificera tecken, men ignorerar den aktuella locale-inställningen, eftersom Python på flera ställen behöver analysera tecken på ett locale-oberoende sätt. (Tillagd av Eric Smith; :issue:`5793`.)

source: Removed function: :c:func:`!PyEval_CallObject` is now only available as a macro. A function version was being kept around to preserve ABI linking compatibility, but that was in 1997; it can certainly be deleted by now. (Removed by Antoine Pitrou; :issue:`8276`.)
sv: Borttagen funktion: :c:func:`!PyEval_CallObject` är nu endast tillgänglig som makro. En funktionsversion behölls för att bevara ABI-länkkompatibilitet, men det var 1997; den kan säkert ha tagits bort nu. (Borttagen av Antoine Pitrou; :issue:`8276`.)

source: New format codes: the :c:func:`!PyString_FromFormat`, :c:func:`!PyString_FromFormatV`, and :c:func:`PyErr_Format` functions now accept ``%lld`` and ``%llu`` format codes for displaying C's :c:expr:`long long` types. (Contributed by Mark Dickinson; :issue:`7228`.)
sv: Nya formatkoder: Funktionerna :c:func:`!PyString_FromFormat`, :c:func:`!PyString_FromFormatV` och :c:func:`PyErr_Format` accepterar nu formatkoderna ``%lld`` och ``%llu`` för visning av C:s typer :c:expr:`long long`. (Bidrag från Mark Dickinson; :issue:`7228`.)

source: The complicated interaction between threads and process forking has been changed. Previously, the child process created by :func:`os.fork` might fail because the child is created with only a single thread running, the thread performing the :func:`os.fork`. If other threads were holding a lock, such as Python's import lock, when the fork was performed, the lock would still be marked as "held" in the new process. But in the child process nothing would ever release the lock, since the other threads weren't replicated, and the child process would no longer be able to perform imports.
sv: Den komplicerade interaktionen mellan trådar och processforking har ändrats. Tidigare kunde barnprocessen som skapades av :func:`os.fork` misslyckas eftersom barnet skapades med bara en enda tråd igång, den tråd som utförde :func:`os.fork`. Om andra trådar höll ett lås, till exempel Pythons importlås, när förgreningen utfördes, skulle låset fortfarande markeras som "hållet" i den nya processen. Men i barnprocessen skulle ingenting någonsin släppa låset, eftersom de andra trådarna inte replikerades, och barnprocessen skulle inte längre kunna utföra import.

source: Python 2.7 acquires the import lock before performing an :func:`os.fork`, and will also clean up any locks created using the :mod:`threading` module. C extension modules that have internal locks, or that call :c:func:`fork()` themselves, will not benefit from this clean-up.
sv: Python 2.7 förvärvar importlåset innan en :func:`os.fork` utförs, och kommer också att rensa upp alla lås som skapats med :mod:`threading`-modulen. C-tilläggsmoduler som har interna lås, eller som själva anropar :c:func:`fork()`, kommer inte att dra nytta av denna rensning.

source: (Fixed by Thomas Wouters; :issue:`1590864`.)
sv: (Åtgärdat av Thomas Wouters; :issue:`1590864`.)

source: The :c:func:`Py_Finalize` function now calls the internal :func:`!threading._shutdown` function; this prevents some exceptions from being raised when an interpreter shuts down. (Patch by Adam Olsen; :issue:`1722344`.)
sv: Funktionen :c:func:`Py_Finalize` anropar nu den interna funktionen :func:`!threading._shutdown`; detta förhindrar att vissa undantag uppstår när en tolk stängs ner. (Patch av Adam Olsen; :issue:`1722344`.)

source: When using the :c:type:`PyMemberDef` structure to define attributes of a type, Python will no longer let you try to delete or set a :c:macro:`T_STRING_INPLACE` attribute.
sv: När du använder :c:type:`PyMemberDef`-strukturen för att definiera attribut för en typ, kommer Python inte längre att låta dig försöka ta bort eller ställa in ett :c:macro:`T_STRING_INPLACE`-attribut.

source: Global symbols defined by the :mod:`ctypes` module are now prefixed with ``Py``, or with ``_ctypes``. (Implemented by Thomas Heller; :issue:`3102`.)
sv: Globala symboler som definieras av modulen :mod:`ctypes` prefixeras nu med ``Py``, eller med ``_ctypes``. (Implementerat av Thomas Heller; :issue:`3102`.)

source: New configure option: the :option:`!--with-system-expat` switch allows building the :mod:`pyexpat <xml.parsers.expat>` module to use the system Expat library. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`7609`.)
sv: Nytt konfigureringsalternativ: Med :option:`!--with-system-expat` kan modulen :mod:`pyexpat <xml.parsers.expat>` byggas så att den använder systembiblioteket Expat. (Bidrag från Arfrever Frehtes Taifersar Arahesis; :issue:`7609`.)

source: New configure option: the :option:`!--with-valgrind` option will now disable the pymalloc allocator, which is difficult for the Valgrind memory-error detector to analyze correctly. Valgrind will therefore be better at detecting memory leaks and overruns. (Contributed by James Henstridge; :issue:`2422`.)
sv: Nytt konfigureringsalternativ: alternativet :option:`!--with-valgrind` inaktiverar nu allokeringsverktyget pymalloc, som är svårt för Valgrinds minnesfelsdetektor att analysera korrekt. Valgrind kommer därför att bli bättre på att upptäcka minnesläckor och överskridanden. (Bidrag från James Henstridge; :issue:`2422`.)

source: New configure option: you can now supply an empty string to :option:`!--with-dbmliborder=` in order to disable all of the various DBM modules. (Added by Arfrever Frehtes Taifersar Arahesis; :issue:`6491`.)
sv: Nytt konfigureringsalternativ: Du kan nu ange en tom sträng till :option:`!--with-dbmliborder=` för att inaktivera alla olika DBM-moduler. (Tillagd av Arfrever Frehtes Taifersar Arahesis; :issue:`6491`.)

source: The :program:`configure` script now checks for floating-point rounding bugs on certain 32-bit Intel chips and defines a :c:macro:`X87_DOUBLE_ROUNDING` preprocessor definition. No code currently uses this definition, but it's available if anyone wishes to use it. (Added by Mark Dickinson; :issue:`2937`.)
sv: Skriptet :program:`configure` kontrollerar nu för avrundningsbuggar för flyttal på vissa 32-bitars Intel-chip och definierar en :c:macro:`X87_DOUBLE_ROUNDING` preprocessordefinition. Ingen kod använder för närvarande denna definition, men den är tillgänglig om någon vill använda den. (Tillagd av Mark Dickinson; :issue:`2937`.)

source: :program:`configure` also now sets a :envvar:`LDCXXSHARED` Makefile variable for supporting C++ linking. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`1222585`.)
sv: :program:`configure` ställer nu också in en :envvar:`LDCXXSHARED` Makefile-variabel för att stödja C++-länkning. (Bidrag från Arfrever Frehtes Taifersar Arahesis; :issue:`1222585`.)

source: The build process now creates the necessary files for pkg-config support. (Contributed by Clinton Roy; :issue:`3585`.)
sv: Byggprocessen skapar nu de nödvändiga filerna för stöd för pkg-config. (Bidrag från Clinton Roy; :issue:`3585`.)

source: The build process now supports Subversion 1.7. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`6094`.)
sv: Byggprocessen stöder nu Subversion 1.7. (Bidrag från Arfrever Frehtes Taifersar Arahesis; :issue:`6094`.)

source: Capsules
sv: Kapslar

source: Python 3.1 adds a new C datatype, :c:type:`PyCapsule`, for providing a C API to an extension module. A capsule is essentially the holder of a C ``void *`` pointer, and is made available as a module attribute; for example, the :mod:`socket` module's API is exposed as ``socket.CAPI``, and :mod:`unicodedata` exposes ``ucnhash_CAPI``. Other extensions can import the module, access its dictionary to get the capsule object, and then get the ``void *`` pointer, which will usually point to an array of pointers to the module's various API functions.
sv: Python 3.1 lägger till en ny C-datatyp, :c:type:`PyCapsule`, för att tillhandahålla ett C API till en tilläggsmodul. En kapsel är i huvudsak innehavaren av en C ``void *`` pekare, och görs tillgänglig som ett modulattribut; till exempel exponeras :mod:`socket`-modulens API som ``socket.CAPI``, och :mod:`unicodedata` exponerar ``ucnhash_CAPI``. Andra tillägg kan importera modulen, få tillgång till dess ordbok för att hämta kapselobjektet och sedan hämta pekaren ``void *``, som vanligtvis pekar på en array av pekare till modulens olika API-funktioner.

source: There is an existing data type already used for this, :c:type:`!PyCObject`, but it doesn't provide type safety. Evil code written in pure Python could cause a segmentation fault by taking a :c:type:`!PyCObject` from module A and somehow substituting it for the :c:type:`!PyCObject` in module B. Capsules know their own name, and getting the pointer requires providing the name:
sv: Det finns en befintlig datatyp som redan används för detta, :c:type:`!PyCObject`, men den ger ingen typsäkerhet. Ond kod skriven i ren Python skulle kunna orsaka ett segmenteringsfel genom att ta en :c:type:`!PyCObject` från modul A och på något sätt ersätta den med :c:type:`!PyCObject` i modul B. Kapslar känner till sitt eget namn, och för att få pekaren krävs att namnet anges:

source: void *vtable; if (!PyCapsule_IsValid(capsule, "mymodule.CAPI") { PyErr_SetString(PyExc_ValueError, "argument type invalid"); return NULL; } vtable = PyCapsule_GetPointer(capsule, "mymodule.CAPI");
sv: void *vtable; if (!PyCapsule_IsValid(capsule, "mymodule.CAPI") { PyErr_SetString(PyExc_ValueError, "argumenttyp ogiltig"); returnera NULL; } vtable = PyCapsule_GetPointer(capsule, "mymodule.CAPI");

source: You are assured that ``vtable`` points to whatever you're expecting. If a different capsule was passed in, :c:func:`PyCapsule_IsValid` would detect the mismatched name and return false. Refer to :ref:`using-capsules` for more information on using these objects.
sv: Du kan vara säker på att ``vtable`` pekar på det du förväntar dig. Om en annan kapsel skickades in, skulle :c:func:`PyCapsule_IsValid` upptäcka det felaktiga namnet och returnera false. Se :ref:`using-capsules` för mer information om hur du använder dessa objekt.

source: Python 2.7 now uses capsules internally to provide various extension-module APIs, but the :c:func:`!PyCObject_AsVoidPtr` was modified to handle capsules, preserving compile-time compatibility with the :c:type:`!PyCObject` interface. Use of :c:func:`!PyCObject_AsVoidPtr` will signal a :exc:`PendingDeprecationWarning`, which is silent by default.
sv: Python 2.7 använder nu kapslar internt för att tillhandahålla olika API:er för tilläggsmoduler, men :c:func:`!PyCObject_AsVoidPtr` modifierades för att hantera kapslar, vilket bevarar kompileringstidskompatibilitet med :c:type:`!PyCObject`-gränssnittet. Användning av :c:func:`!PyCObject_AsVoidPtr` kommer att signalera en :exc:`PendingDeprecationWarning`, som är tyst som standard.

source: Implemented in Python 3.1 and backported to 2.7 by Larry Hastings; discussed in :issue:`5630`.
sv: Implementerad i Python 3.1 och bakåtporterad till 2.7 av Larry Hastings; diskuterad i :issue:`5630`.

source: Port-Specific Changes: Windows
sv: Portspecifika ändringar: Fönster

source: The :mod:`msvcrt` module now contains some constants from the :file:`crtassem.h` header file: :data:`~msvcrt.CRT_ASSEMBLY_VERSION`, :data:`~msvcrt.VC_ASSEMBLY_PUBLICKEYTOKEN`, and :data:`~msvcrt.LIBRARIES_ASSEMBLY_NAME_PREFIX`. (Contributed by David Cournapeau; :issue:`4365`.)
sv: Modulen :mod:`msvcrt` innehåller nu några konstanter från huvudfilen :file:`crtassem.h`: :data:`~msvcrt.CRT_ASSEMBLY_VERSION`, :data:`~msvcrt.VC_ASSEMBLY_PUBLICKEYTOKEN`, och :data:`~msvcrt.LIBRARIES_ASSEMBLY_NAME_PREFIX`. (Bidrag från David Cournapeau; :issue:`4365`.)
