Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: Therefore, a simple comma-grouping mechanism has been added to the mini-language used by the :meth:`str.format` method. When formatting a floating-point number, simply include a comma between the width and the precision::
sv: Därför har en enkel kommagrupperingsmekanism lagts till i det minispråk som används av metoden :meth:`str.format`. När du formaterar ett flyttal kan du helt enkelt sätta ett kommatecken mellan bredden och precisionen::

source: When formatting an integer, include the comma after the width:
sv: När du formaterar ett heltal ska du inkludera kommatecknet efter bredden:

source: This mechanism is not adaptable at all; commas are always used as the separator and the grouping is always into three-digit groups. The comma-formatting mechanism isn't as general as the :mod:`locale` module, but it's easier to use.
sv: Denna mekanism är inte anpassningsbar alls; kommatecken används alltid som avgränsare och grupperingen sker alltid i tresiffriga grupper. Komma-formateringsmekanismen är inte lika generell som :mod:`locale`-modulen, men den är enklare att använda.

source: :pep:`378` - Format Specifier for Thousands Separator
sv: :pep:`378` - Formatspecifikator för tusentalsavgränsare

source: PEP written by Raymond Hettinger; implemented by Eric Smith.
sv: PEP skriven av Raymond Hettinger; implementerad av Eric Smith.

source: PEP 389: The argparse Module for Parsing Command Lines
sv: PEP 389: Modulen argparse för parsning av kommandorader

source: The :mod:`argparse` module for parsing command-line arguments was added as a more powerful replacement for the :mod:`optparse` module.
sv: Modulen :mod:`argparse` för parsning av kommandoradsargument har lagts till som en kraftfullare ersättning för modulen :mod:`optparse`.

source: This means Python now supports three different modules for parsing command-line arguments: :mod:`getopt`, :mod:`optparse`, and :mod:`argparse`. The :mod:`getopt` module closely resembles the C library's :c:func:`!getopt` function, so it remains useful if you're writing a Python prototype that will eventually be rewritten in C. :mod:`optparse` becomes redundant, but there are no plans to remove it because there are many scripts still using it, and there's no automated way to update these scripts. (Making the :mod:`argparse` API consistent with :mod:`optparse`'s interface was discussed but rejected as too messy and difficult.)
sv: Detta innebär att Python nu stöder tre olika moduler för parsning av kommandoradsargument: :mod:`getopt`, :mod:`optparse` och :mod:`argparse`. Modulen :mod:`getopt` liknar C-bibliotekets funktion :c:func:`!getopt`, så den är fortfarande användbar om du skriver en Python-prototyp som så småningom kommer att skrivas om i C. :mod:`optparse` blir överflödig, men det finns inga planer på att ta bort den eftersom det finns många skript som fortfarande använder den, och det finns inget automatiserat sätt att uppdatera dessa skript. (Att göra :mod:`argparse` API konsekvent med :mod:`optparse`s gränssnitt diskuterades men förkastades som alltför rörigt och svårt)

source: In short, if you're writing a new script and don't need to worry about compatibility with earlier versions of Python, use :mod:`argparse` instead of :mod:`optparse`.
sv: Kort sagt, om du skriver ett nytt skript och inte behöver oroa dig för kompatibilitet med tidigare versioner av Python, använd :mod:`argparse` istället för :mod:`optparse`.

source: Here's an example::
sv: Här är ett exempel::

source: Unless you override it, :option:`!-h` and :option:`!--help` switches are automatically added, and produce neatly formatted output::
sv: Om du inte åsidosätter det, läggs :option:`!-h` och :option:`!--help` automatiskt till och ger snyggt formaterad utdata::

source: -> ./python.exe argparse-example.py --help usage: argparse-example.py [-h] [-v] [-o FILE] [-C NUM] [inputs [inputs ...]] Command-line example. positional arguments: inputs input filenames (default is stdin) optional arguments: -h, --help show this help message and exit -v produce verbose output -o FILE direct output to FILE instead of stdout -C NUM display NUM lines of added context
sv: -> ./python.exe argparse-example.py --help användning: argparse-example.py [-h] [-v] [-o FILE] [-C NUM] [inputs [inputs ...]] Exempel på kommandorad. positionella argument: inputs inmatningsfilnamn (standard är stdin) valfria argument: -h, --help visa detta hjälpmeddelande och avsluta -v producerar verbal utdata -o FILE direkt utmatning till FILE istället för stdout -C NUM visa NUM rader med extra kontext

source: As with :mod:`optparse`, the command-line switches and arguments are returned as an object with attributes named by the *dest* parameters::
sv: Precis som med :mod:`optparse` returneras kommandoradsväxlarna och argumenten som ett objekt med attribut som namnges av *dest*-parametrarna::

source: -> ./python.exe argparse-example.py -v {'output': None, 'is_verbose': True, 'context': 0, 'inputs': []} -> ./python.exe argparse-example.py -v -o /tmp/output -C 4 file1 file2 {'output': '/tmp/output', 'is_verbose': True, 'context': 4, 'inputs': ['file1', 'file2']}
sv: -> ./python.exe argparse-exempel.py -v {"utdata": Ingen, 'is_verbose': True, 'context': 0, 'inputs': []} -> ./python.exe argparse-example.py -v -o /tmp/output -C 4 fil1 fil2 {'output': '/tmp/output', 'is_verbose': True, 'context': 4, 'inputs': ['file1', 'file2']}

source: :mod:`argparse` has much fancier validation than :mod:`optparse`; you can specify an exact number of arguments as an integer, 0 or more arguments by passing ``'*'``, 1 or more by passing ``'+'``, or an optional argument with ``'?'``. A top-level parser can contain sub-parsers to define subcommands that have different sets of switches, as in ``svn commit``, ``svn checkout``, etc. You can specify an argument's type as :class:`~argparse.FileType`, which will automatically open files for you and understands that ``'-'`` means standard input or output.
sv: :mod:`argparse` har mycket finare validering än :mod:`optparse`; du kan ange ett exakt antal argument som ett heltal, 0 eller fler argument genom att skicka ``'*'``, 1 eller fler genom att skicka ``'+'``, eller ett valfritt argument med ``'?'``. En parser på högsta nivån kan innehålla underparsers för att definiera underkommandon som har olika uppsättningar av switchar, som i ```svn commit``, ``vn checkout``, etc. Du kan ange ett arguments typ som :class:`~argparse.FileType`, vilket automatiskt öppnar filer åt dig och förstår att ``'-'`` betyder standardinmatning eller -utmatning.

source: :mod:`argparse` documentation
sv: :mod:`argparse` dokumentation

source: The documentation page of the argparse module.
sv: Dokumentationssidan för modulen argparse.

source: :ref:`upgrading-optparse-code`
sv: :ref:`uppgradering-optparse-kod`

source: Part of the Python documentation, describing how to convert code that uses :mod:`optparse`.
sv: En del av Python-dokumentationen som beskriver hur man konverterar kod som använder :mod:`optparse`.

source: :pep:`389` - argparse - New Command Line Parsing Module
sv: :pep:`389` - argparse - Ny modul för parsning av kommandorader

source: PEP written and implemented by Steven Bethard.
sv: PEP skrivet och implementerat av Steven Bethard.

source: PEP 391: Dictionary-Based Configuration For Logging
sv: PEP 391: Ordboksbaserad konfiguration för loggning

source: The :mod:`logging` module is very flexible; applications can define a tree of logging subsystems, and each logger in this tree can filter out certain messages, format them differently, and direct messages to a varying number of handlers.
sv: Modulen :mod:`logging` är mycket flexibel; program kan definiera ett träd av loggningssubsystem, och varje logger i detta träd kan filtrera bort vissa meddelanden, formatera dem på olika sätt och skicka meddelanden till ett varierande antal hanterare.

source: All this flexibility can require a lot of configuration. You can write Python statements to create objects and set their properties, but a complex set-up requires verbose but boring code. :mod:`logging` also supports a :func:`~logging.config.fileConfig` function that parses a file, but the file format doesn't support configuring filters, and it's messier to generate programmatically.
sv: All denna flexibilitet kan kräva en hel del konfiguration. Du kan skriva Python-satser för att skapa objekt och ställa in deras egenskaper, men en komplex konfiguration kräver utförlig men tråkig kod. :mod:`logging` stöder också en :func:`~logging.config.fileConfig`-funktion som analyserar en fil, men filformatet stöder inte konfiguration av filter och det är rörigare att generera programmatiskt.

source: Python 2.7 adds a :func:`~logging.config.dictConfig` function that uses a dictionary to configure logging. There are many ways to produce a dictionary from different sources: construct one with code; parse a file containing JSON; or use a YAML parsing library if one is installed. For more information see :ref:`logging-config-api`.
sv: Python 2.7 lägger till en :func:`~logging.config.dictConfig`-funktion som använder en ordbok för att konfigurera loggning. Det finns många sätt att producera en ordbok från olika källor: konstruera en med kod; parsa en fil som innehåller JSON; eller använd ett YAML-parsingbibliotek om ett sådant är installerat. För mer information se :ref:`logging-config-api`.

source: The following example configures two loggers, the root logger and a logger named "network". Messages sent to the root logger will be sent to the system log using the syslog protocol, and messages to the "network" logger will be written to a :file:`network.log` file that will be rotated once the log reaches 1MB.
sv: I följande exempel konfigureras två loggar, rotloggaren och en logger med namnet "network". Meddelanden som skickas till rotloggaren skickas till systemloggen med syslog-protokollet, och meddelanden till "network"-loggaren skrivs till en :file:`network.log`-fil som roteras när loggen når 1 MB.

source: Three smaller enhancements to the :mod:`logging` module, all implemented by Vinay Sajip, are:
sv: Tre mindre förbättringar av modulen :mod:`logging`, alla implementerade av Vinay Sajip, är:

source: The :class:`~logging.handlers.SysLogHandler` class now supports syslogging over TCP. The constructor has a *socktype* parameter giving the type of socket to use, either :const:`socket.SOCK_DGRAM` for UDP or :const:`socket.SOCK_STREAM` for TCP. The default protocol remains UDP.
sv: Klassen :class:`~logging.handlers.SysLogHandler` har nu stöd för syslogging över TCP. Konstruktorn har en *socktype* parameter som anger vilken typ av socket som ska användas, antingen :const:`socket.SOCK_DGRAM` för UDP eller :const:`socket.SOCK_STREAM` för TCP. Standardprotokollet är fortfarande UDP.

source: :class:`~logging.Logger` instances gained a :meth:`~logging.Logger.getChild` method that retrieves a descendant logger using a relative path. For example, once you retrieve a logger by doing ``log = getLogger('app')``, calling ``log.getChild('network.listen')`` is equivalent to ``getLogger('app.network.listen')``.
sv: :class:`~logging.Logger`-instanser har fått en :meth:`~logging.Logger.getChild`-metod som hämtar en nedåtgående logger med hjälp av en relativ sökväg. När du till exempel hämtar en logger genom att göra ``log = getLogger('app')``, är anropet av ``log.getChild('network.listen')`` likvärdigt med ``getLogger('app.network.listen')``.

source: The :class:`~logging.LoggerAdapter` class gained an :meth:`~logging.Logger.isEnabledFor` method that takes a *level* and returns whether the underlying logger would process a message of that level of importance.
sv: Klassen :class:`~logging.LoggerAdapter` har fått en :meth:`~logging.Logger.isEnabledFor`-metod som tar en *nivå* och returnerar om den underliggande loggern skulle behandla ett meddelande med denna nivå av betydelse.

source: :pep:`391` - Dictionary-Based Configuration For Logging
sv: :pep:`391` - Ordboksbaserad konfiguration för loggning

source: PEP written and implemented by Vinay Sajip.
sv: PEP skrivet och implementerat av Vinay Sajip.

source: PEP 3106: Dictionary Views
sv: PEP 3106: Vyer i ordboken

source: The dictionary methods :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` are different in Python 3.x. They return an object called a :dfn:`view` instead of a fully materialized list.
sv: Dictionary-metoderna :meth:`~dict.keys`, :meth:`~dict.values` och :meth:`~dict.items` är annorlunda i Python 3.x. De returnerar ett objekt som kallas :dfn:`view` istället för en helt materialiserad lista.

source: It's not possible to change the return values of :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` in Python 2.7 because too much code would break. Instead the 3.x versions were added under the new names :meth:`!viewkeys`, :meth:`!viewvalues`, and :meth:`!viewitems`.
sv: Det är inte möjligt att ändra returvärdena för :meth:`~dict.keys`, :meth:`~dict.values` och :meth:`~dict.items` i Python 2.7 eftersom för mycket kod skulle brytas. Istället lades 3.x versionerna till under de nya namnen :meth:`!viewkeys`, :meth:`!viewvalues`, och :meth:`!viewitems`.

source: >>> d = dict((i*10, chr(65+i)) for i in range(26)) >>> d {0: 'A', 130: 'N', 10: 'B', 140: 'O', 20: ..., 250: 'Z'} >>> d.viewkeys() dict_keys([0, 130, 10, 140, 20, 150, 30, ..., 250])
sv: >>> d = dict((i*10, chr(65+i)) för i i intervall(26)) >>> d {0: 'A', 130: 'N', 10: 'B', 140: 'O', 20: ..., 250: 'Z'} >>> d.viewkeys() dict_keys([0, 130, 10, 140, 20, 150, 30, ..., 250])

source: Views can be iterated over, but the key and item views also behave like sets. The ``&`` operator performs intersection, and ``|`` performs a union::
sv: Vyer kan itereras över, men nyckel- och objektvyerna fungerar också som uppsättningar. Operatorn ``&`` utför intersektion och ``|`` utför en union::

source: >>> d1 = dict((i*10, chr(65+i)) for i in range(26)) >>> d2 = dict((i**.5, i) for i in range(1000)) >>> d1.viewkeys() & d2.viewkeys() set([0.0, 10.0, 20.0, 30.0]) >>> d1.viewkeys() | range(0, 30) set([0, 1, 130, 3, 4, 5, 6, ..., 120, 250])
sv: >>> d1 = dict((i*10, chr(65+i)) för i i intervallet(26)) >>> d2 = dict((i**.5, i) for i in range(1000)) >>> d1.viewkeys() & d2.viewkeys() set([0,0, 10,0, 20,0, 30,0]) >>> d1.viewkeys() | intervall(0, 30) set([0, 1, 130, 3, 4, 5, 6, ..., 120, 250])

source: The view keeps track of the dictionary and its contents change as the dictionary is modified::
sv: Vyn håller reda på ordlistan och dess innehåll ändras när ordlistan ändras::

source: However, note that you can't add or remove keys while you're iterating over the view::
sv: Observera dock att du inte kan lägga till eller ta bort nycklar medan du itererar över view::

source: >>> for k in vk: ... d[k*2] = k ... Traceback (most recent call last): File "<stdin>", line 1, in <module> RuntimeError: dictionary changed size during iteration
sv: &gt;&gt;&gt; för k i vk: ... d[k*2] = k ... Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> RuntimeError: Ordboken ändrade storlek under iterationen

source: You can use the view methods in Python 2.x code, and the 2to3 converter will change them to the standard :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` methods.
sv: Du kan använda view-metoderna i Python 2.x-kod, och 2to3-omvandlaren ändrar dem till standardmetoderna :meth:`~dict.keys`, :meth:`~dict.values` och :meth:`~dict.items`.

source: :pep:`3106` - Revamping dict.keys(), .values() and .items()
sv: :pep:`3106` - Omarbetning av dict.keys(), .values() och .items()

source: PEP written by Guido van Rossum. Backported to 2.7 by Alexandre Vassalotti; :issue:`1967`.
sv: PEP skriven av Guido van Rossum. Baktransporterad till 2.7 av Alexandre Vassalotti; :issue:`1967`.

source: PEP 3137: The memoryview Object
sv: PEP 3137: Objektet minnesvy

source: The :class:`memoryview` object provides a view of another object's memory content that matches the :class:`bytes` type's interface.
sv: Objektet :class:`memoryview` ger en vy över ett annat objekts minnesinnehåll som matchar gränssnittet för typen :class:`bytes`.

source: >>> import string >>> m = memoryview(string.letters) >>> m <memory at 0x37f850> >>> len(m) # Returns length of underlying object 52 >>> m[0], m[25], m[26] # Indexing returns one byte ('a', 'z', 'A') >>> m2 = m[0:26] # Slicing returns another memoryview >>> m2 <memory at 0x37f080>
sv: &gt;&gt;&gt; import sträng &gt;&gt;&gt; m = minnesvy(sträng.bokstäver) &gt;&gt;&gt; m <memory at 0x37f850> &gt;&gt;&gt; len(m) # Returnerar längden på underliggande objekt 52 &gt;&gt;&gt; m[0], m[25], m[26] # Indexering returnerar en byte ('a', 'z', 'A') &gt;&gt;&gt; m2 = m[0:26] # Slicing returnerar en annan minnesvy &gt;&gt;&gt; m2 <memory at 0x37f080>

source: The content of the view can be converted to a string of bytes or a list of integers:
sv: Innehållet i vyn kan konverteras till en sträng av bytes eller en lista av heltal:

source: :class:`memoryview` objects allow modifying the underlying object if it's a mutable object.
sv: :class:`memoryview`-objekt tillåter modifiering av det underliggande objektet om det är ett föränderligt objekt.

source: >>> m2[0] = 75 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: cannot modify read-only memory >>> b = bytearray(string.letters) # Creating a mutable object >>> b bytearray(b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ') >>> mb = memoryview(b) >>> mb[0] = '*' # Assign to view, changing the bytearray. >>> b[0:5] # The bytearray has been changed. bytearray(b'*bcde') >>>
sv: &gt;&gt;&gt; m2[0] = 75 Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: kan inte modifiera skrivskyddat minne &gt;&gt;&gt; b = bytearray(sträng.bokstäver) # Skapa ett muterbart objekt &gt;&gt;&gt; b bytearray(b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ') &gt;&gt;&gt; mb = minnesvy(b) &gt;&gt;&gt; mb[0] = '*' # Tilldela till vy, ändra bytearray. &gt;&gt;&gt; b[0:5] # Bytearrayen har ändrats. bytearray(b'*bcde') &gt;&gt;&gt

source: :pep:`3137` - Immutable Bytes and Mutable Buffer
sv: :pep:`3137` - Oföränderliga byte och föränderlig buffert

source: PEP written by Guido van Rossum. Implemented by Travis Oliphant, Antoine Pitrou and others. Backported to 2.7 by Antoine Pitrou; :issue:`2396`.
sv: PEP skriven av Guido van Rossum. Implementerad av Travis Oliphant, Antoine Pitrou och andra. Backporterad till 2.7 av Antoine Pitrou; :issue:`2396`.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:

source: The syntax for set literals has been backported from Python 3.x. Curly brackets are used to surround the contents of the resulting mutable set; set literals are distinguished from dictionaries by not containing colons and values. ``{}`` continues to represent an empty dictionary; use ``set()`` for an empty set.
sv: Syntaxen för set-litteraler har backporterats från Python 3.x. Curly brackets används för att omge innehållet i den resulterande mutabla uppsättningen; set-litteraler skiljer sig från ordböcker genom att inte innehålla kolon och värden. ``{}`` fortsätter att representera en tom ordbok; använd ``set()`` för en tom uppsättning.

source: >>> {1, 2, 3, 4, 5} set([1, 2, 3, 4, 5]) >>> set() # empty set set([]) >>> {} # empty dict {}
sv: >>> {1, 2, 3, 4, 5} set([1, 2, 3, 4, 5]) >>> set() # tom uppsättning set([]) >>> {} # tom dikt {}

source: Backported by Alexandre Vassalotti; :issue:`2335`.
sv: Återinförd av Alexandre Vassalotti; :issue:`2335`.

source: Dictionary and set comprehensions are another feature backported from 3.x, generalizing list/generator comprehensions to use the literal syntax for sets and dictionaries.
sv: Dictionary and set comprehensions är en annan funktion som är bakåtporterad från 3.x och generaliserar list/generator comprehensions till att använda den bokstavliga syntaxen för sets och dictionaries.

source: >>> {x: x*x for x in range(6)} {0: 0, 1: 1, 2: 4, 3: 9, 4: 16, 5: 25} >>> {('a'*x) for x in range(6)} set(['', 'a', 'aa', 'aaa', 'aaaa', 'aaaaa'])
sv: >>> {x: x*x för x i intervall(6)} {0: 0, 1: 1, 2: 4, 3: 9, 4: 16, 5: 25} >>> {('a'*x) för x i intervall(6)} set(['', 'a', 'aa', 'aaa', 'aaaa', 'aaaaa'])

source: Backported by Alexandre Vassalotti; :issue:`2333`.
sv: Återinförd av Alexandre Vassalotti; :issue:`2333`.

source: The :keyword:`with` statement can now use multiple context managers in one statement. Context managers are processed from left to right and each one is treated as beginning a new :keyword:`!with` statement. This means that::
sv: Satsen :keyword:`with` kan nu använda flera kontexthanterare i en och samma sats. Kontexthanterare bearbetas från vänster till höger och var och en behandlas som början på en ny :keyword:`!with`-sats. Detta innebär att::

source: with A() as a, B() as b: ... suite of statements ...
sv: med A() som a, B() som b: ... svit av uttalanden ...

source: is equivalent to::
sv: är likvärdig med::

source: with A() as a: with B() as b: ... suite of statements ...
sv: med A() som a: med B() som b: ... svit av uttalanden ...

source: The :func:`!contextlib.nested` function provides a very similar function, so it's no longer necessary and has been deprecated.
sv: Funktionen :func:`!contextlib.nested` ger en mycket liknande funktion, så den är inte längre nödvändig och har utgått.

source: (Proposed in https://codereview.appspot.com/53094; implemented by Georg Brandl.)
sv: (Föreslaget i https://codereview.appspot.com/53094; implementerat av Georg Brandl.)

source: Conversions between floating-point numbers and strings are now correctly rounded on most platforms. These conversions occur in many different places: :func:`str` on floats and complex numbers; the :class:`float` and :class:`complex` constructors; numeric formatting; serializing and deserializing floats and complex numbers using the :mod:`marshal`, :mod:`pickle` and :mod:`json` modules; parsing of float and imaginary literals in Python code; and :class:`~decimal.Decimal`-to-float conversion.
sv: Konverteringar mellan flyttal och strängar avrundas nu korrekt på de flesta plattformar. Dessa konverteringar sker på många olika ställen: :func:`str` på flyttal och komplexa tal; konstruktörerna :class:`float` och :class:`complex`; numerisk formatering; serialisering och deserialisering av flyttal och komplexa tal med hjälp av modulerna :mod:`marshal`, :mod:`pickle` och :mod:`json`; parsning av flyttals- och imaginärlitteraler i Python-kod; och :class:`~decimal.Decimal`-till-float-konvertering.

source: Related to this, the :func:`repr` of a floating-point number *x* now returns a result based on the shortest decimal string that's guaranteed to round back to *x* under correct rounding (with round-half-to-even rounding mode). Previously it gave a string based on rounding x to 17 decimal digits.
sv: Relaterat till detta returnerar :func:`repr` av ett flyttal *x* nu ett resultat baserat på den kortaste decimalsträngen som garanterat avrundas tillbaka till *x* med korrekt avrundning (med avrundningsläge halv till jämn). Tidigare gav den en sträng baserad på avrundning av x till 17 decimaler.
