Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: The :mod:`_winreg <winreg>` module for accessing the registry now implements the :func:`~winreg.CreateKeyEx` and :func:`~winreg.DeleteKeyEx` functions, extended versions of previously supported functions that take several extra arguments. The :func:`~winreg.DisableReflectionKey`, :func:`~winreg.EnableReflectionKey`, and :func:`~winreg.QueryReflectionKey` were also tested and documented. (Implemented by Brian Curtin: :issue:`7347`.)
sv: Modulen :mod:`_winreg <winreg>` för åtkomst till registret implementerar nu funktionerna :func:`~winreg.CreateKeyEx` och :func:`~winreg.DeleteKeyEx`, utökade versioner av tidigare stödda funktioner som tar flera extra argument. Funktionerna :func:`~winreg.DisableReflectionKey`, :func:`~winreg.EnableReflectionKey` och :func:`~winreg.QueryReflectionKey` har också testats och dokumenterats. (Implementerat av Brian Curtin: :issue:`7347`.)

source: The new :c:func:`!_beginthreadex` API is used to start threads, and the native thread-local storage functions are now used. (Contributed by Kristján Valur Jónsson; :issue:`3582`.)
sv: Det nya API:et :c:func:`!_beginthreadex` används för att starta trådar, och de inbyggda trådlokala lagringsfunktionerna används nu. (Bidrag från Kristján Valur Jónsson; :issue:`3582`.)

source: The :func:`os.kill` function now works on Windows. The signal value can be the constants :const:`~signal.CTRL_C_EVENT`, :const:`~signal.CTRL_BREAK_EVENT`, or any integer. The first two constants will send :kbd:`Control-C` and :kbd:`Control-Break` keystroke events to subprocesses; any other value will use the :c:func:`!TerminateProcess` API. (Contributed by Miki Tebeka; :issue:`1220212`.)
sv: Funktionen :func:`os.kill` fungerar nu i Windows. Signalvärdet kan vara konstanterna :const:`~signal.CTRL_C_EVENT`, :const:`~signal.CTRL_BREAK_EVENT` eller ett heltal. De två första konstanterna kommer att skicka :kbd:`Control-C` och :kbd:`Control-Break` tangenttryckningshändelser till underprocesser; alla andra värden kommer att använda :c:func:`!TerminateProcess` API. (Bidrag från Miki Tebeka; :issue:`1220212`.)

source: The :func:`os.listdir` function now correctly fails for an empty path. (Fixed by Hirokazu Yamamoto; :issue:`5913`.)
sv: Funktionen :func:`os.listdir` misslyckas nu korrekt för en tom sökväg. (Åtgärdat av Hirokazu Yamamoto; :issue:`5913`.)

source: The :mod:`mimetypes` module will now read the MIME database from the Windows registry when initializing. (Patch by Gabriel Genellina; :issue:`4969`.)
sv: Modulen :mod:`mimetypes` kommer nu att läsa MIME-databasen från Windows-registret när den initieras (Patch by Gabriel Genellina; :issue:`4969`.)

source: Port-Specific Changes: Mac OS X
sv: Hamnspecifika ändringar: Mac OS X

source: The path ``/Library/Python/2.7/site-packages`` is now appended to ``sys.path``, in order to share added packages between the system installation and a user-installed copy of the same version. (Changed by Ronald Oussoren; :issue:`4865`.)
sv: Sökvägen ``/Library/Python/2.7/site-packages`` är nu tillagd till ``sys.path``, för att dela med sig av tillagda paket mellan systeminstallationen och en användarinstallerad kopia av samma version. (Ändrad av Ronald Oussoren; :issue:`4865`.)

source: As of 2.7.13, this change was removed. ``/Library/Python/2.7/site-packages``, the site-packages directory used by the Apple-supplied system Python 2.7 is no longer appended to ``sys.path`` for user-installed Pythons such as from the python.org installers. As of macOS 10.12, Apple changed how the system site-packages directory is configured, which could cause installation of pip components, like setuptools, to fail. Packages installed for the system Python will no longer be shared with user-installed Pythons. (:issue:`28440`)
sv: Från och med 2.7.13 har denna ändring tagits bort. ``/Library/Python/2.7/site-packages``, site-packages-katalogen som används av det Apple-levererade systemet Python 2.7 läggs inte längre till ``sys.path`` för användarinstallerade Pythons, till exempel från python.org-installatörerna. Från och med macOS 10.12 ändrade Apple hur systemkatalogen site-packages konfigureras, vilket kan leda till att installationen av pip-komponenter, som setuptools, misslyckas. Paket som installeras för systemets Python kommer inte längre att delas med Pythons som installerats av användare. (:issue:`28440`)

source: Port-Specific Changes: FreeBSD
sv: Portspecifika ändringar: FreeBSD

source: FreeBSD 7.1's :const:`!SO_SETFIB` constant, used with the :func:`~socket.socket` methods :func:`~socket.socket.getsockopt`/:func:`~socket.socket.setsockopt` to select an alternate routing table, is now available in the :mod:`socket` module. (Added by Kyle VanderBeek; :issue:`8235`.)
sv: FreeBSD 7.1:s :const:`!SO_SETFIB`-konstant, som används med :func:`~socket.socket`-metoderna :func:`~socket.socket.getsockopt`/:func:`~socket.socket.setsockopt` för att välja en alternativ routningstabell, är nu tillgänglig i modulen :mod:`socket`. (Tillagd av Kyle VanderBeek; :issue:`8235`.)

source: Other Changes and Fixes
sv: Övriga ändringar och korrigeringar

source: Two benchmark scripts, :file:`iobench` and :file:`ccbench`, were added to the :file:`Tools` directory. :file:`iobench` measures the speed of the built-in file I/O objects returned by :func:`open` while performing various operations, and :file:`ccbench` is a concurrency benchmark that tries to measure computing throughput, thread switching latency, and IO processing bandwidth when performing several tasks using a varying number of threads.
sv: Två benchmark-skript, :file:`iobench` och :file:`ccbench`, har lagts till i katalogen :file:`Tools`. :file:`iobench` mäter hastigheten på de inbyggda fil-I/O-objekt som returneras av :func:`open` när olika operationer utförs, och :file:`ccbench` är ett concurrency-benchmark som försöker mäta beräkningsgenomströmning, latens för trådbyte och bandbredd för IO-bearbetning när flera uppgifter utförs med ett varierande antal trådar.

source: The :file:`Tools/i18n/msgfmt.py` script now understands plural forms in :file:`.po` files. (Fixed by Martin von Löwis; :issue:`5464`.)
sv: Skriptet :file:`Tools/i18n/msgfmt.py` förstår nu pluralformer i :file:`.po`-filer. (Åtgärdat av Martin von Löwis; :issue:`5464`.)

source: When importing a module from a :file:`.pyc` or :file:`.pyo` file with an existing :file:`.py` counterpart, the :attr:`~codeobject.co_filename` attributes of the resulting code objects are overwritten when the original filename is obsolete. This can happen if the file has been renamed, moved, or is accessed through different paths. (Patch by Ziga Seilnacht and Jean-Paul Calderone; :issue:`1180193`.)
sv: Vid import av en modul från en :file:`.pyc`- eller :file:`.pyo`-fil med en befintlig :file:`.py`-motsvarighet skrivs attributen :attr:`~codeobject.co_filename` för de resulterande kodobjekten över när det ursprungliga filnamnet är föråldrat. Detta kan hända om filen har bytt namn, flyttats eller nås via olika sökvägar. (Patch av Ziga Seilnacht och Jean-Paul Calderone; :issue:`1180193`.)

source: The :file:`regrtest.py` script now takes a :option:`!--randseed=` switch that takes an integer that will be used as the random seed for the :option:`!-r` option that executes tests in random order. The :option:`!-r` option also reports the seed that was used (Added by Collin Winter.)
sv: Skriptet :file:`regrtest.py` tar nu emot :option:`!--randseed=` som tar emot ett heltal som kommer att användas som slumpmässigt frö för :option:`!-r` som exekverar tester i slumpmässig ordning. Alternativet :option:`!-r` rapporterar också det frö som användes (Tillagd av Collin Winter.)

source: Another :file:`regrtest.py` switch is :option:`!-j`, which takes an integer specifying how many tests run in parallel. This allows reducing the total runtime on multi-core machines. This option is compatible with several other options, including the :option:`!-R` switch which is known to produce long runtimes. (Added by Antoine Pitrou, :issue:`6152`.) This can also be used with a new :option:`!-F` switch that runs selected tests in a loop until they fail. (Added by Antoine Pitrou; :issue:`7312`.)
sv: En annan switch i :file:`regrtest.py` är :option:`!-j`, som tar ett heltal som anger hur många tester som körs parallellt. Detta gör det möjligt att minska den totala körtiden på flerkärniga maskiner. Detta alternativ är kompatibelt med flera andra alternativ, inklusive :option:`!-R` som är känt för att ge långa körtider. (Tillagd av Antoine Pitrou, :issue:`6152`.) Detta kan också användas med en ny :option:`!-F` switch som kör utvalda tester i en loop tills de misslyckas. (Tillagd av Antoine Pitrou; :issue:`7312`.)

source: When executed as a script, the :file:`py_compile.py` module now accepts ``'-'`` as an argument, which will read standard input for the list of filenames to be compiled. (Contributed by Piotr Ożarowski; :issue:`8233`.)
sv: När modulen :file:`py_compile.py` körs som ett skript accepterar den nu ``'-'`` som ett argument, vilket läser standardinmatningen för listan med filnamn som ska kompileras. (Bidrag från Piotr Ożarowski; :issue:`8233`.)

source: Porting to Python 2.7
sv: Portning till Python 2.7

source: This section lists previously described changes and other bugfixes that may require changes to your code:
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod:

source: The :func:`range` function processes its arguments more consistently; it will now call :meth:`~object.__int__` on non-float, non-integer arguments that are supplied to it. (Fixed by Alexander Belopolsky; :issue:`1533`.)
sv: Funktionen :func:`range` behandlar sina argument på ett mer konsekvent sätt; den kommer nu att anropa :meth:`~object.__int__` för argument som inte är float eller heltal. (Rättad av Alexander Belopolsky; :issue:`1533`.)

source: The string :meth:`format` method changed the default precision used for floating-point and complex numbers from 6 decimal places to 12, which matches the precision used by :func:`str`. (Changed by Eric Smith; :issue:`5920`.)
sv: Metoden string :meth:`format` ändrade standardprecisionen för flyttal och komplexa tal från 6 decimaler till 12, vilket matchar precisionen som används av :func:`str`. (Ändrad av Eric Smith; :issue:`5920`.)

source: Because of an optimization for the :keyword:`with` statement, the special methods :meth:`~object.__enter__` and :meth:`~object.__exit__` must belong to the object's type, and cannot be directly attached to the object's instance. This affects new-style classes (derived from :class:`object`) and C extension types. (:issue:`6101`.)
sv: På grund av en optimering för :keyword:`with`-satsen måste specialmetoderna :meth:`~object.__enter__` och :meth:`~object.__exit__` tillhöra objektets typ och kan inte kopplas direkt till objektets instans. Detta påverkar klasser i ny stil (härledda från :class:`object`) och C-tilläggstyper. (:issue:`6101`.)

source: Due to a bug in Python 2.6, the *exc_value* parameter to :meth:`~object.__exit__` methods was often the string representation of the exception, not an instance. This was fixed in 2.7, so *exc_value* will be an instance as expected. (Fixed by Florent Xicluna; :issue:`7853`.)
sv: På grund av en bugg i Python 2.6 var parametern *exc_value* till :meth:`~object.__exit__`-metoder ofta strängrepresentationen av undantaget, inte en instans. Detta åtgärdades i 2.7, så *exc_value* kommer att vara en instans som förväntat. (Åtgärdat av Florent Xicluna; :issue:`7853`.)

source: In the standard library:
sv: I standardbiblioteket:

source: Operations with :class:`~datetime.datetime` instances that resulted in a year falling outside the supported range didn't always raise :exc:`OverflowError`. Such errors are now checked more carefully and will now raise the exception. (Reported by Mark Leander, patch by Anand B. Pillai and Alexander Belopolsky; :issue:`7150`.)
sv: Operationer med :class:`~datetime.datetime`-instanser som resulterade i ett år som föll utanför det stödda intervallet gav inte alltid upphov till :exc:`OverflowError`. Sådana fel kontrolleras nu mer noggrant och kommer nu att ge upphov till undantaget. (Rapporterat av Mark Leander, patchad av Anand B. Pillai och Alexander Belopolsky; :issue:`7150`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which might change the output of your programs. (Changed by Mark Dickinson; :issue:`6857`.)
sv: När man använder :class:`~decimal.Decimal`-instanser med en strängs :meth:`format`-metod var standardjusteringen tidigare vänsterjustering. Detta har ändrats till högerjustering, vilket kan förändra utdata från dina program. (Ändrat av Mark Dickinson; :issue:`6857`.)

source: The :mod:`xml.etree.ElementTree` library no longer escapes ampersands and angle brackets when outputting an XML processing instruction (which looks like ``<?xml-stylesheet href="#style1"?>``) or comment (which looks like ``<!-- comment -->``). (Patch by Neil Muller; :issue:`2746`.)
sv: Biblioteket :mod:`xml.etree.ElementTree` escapar inte längre ampersand och vinkelparenteser vid utmatning av en XML-bearbetningsinstruktion (som ser ut som ``<?xml-stylesheet href="#style1"?>``) eller kommentar (som ser ut som ``<!-- comment -->``). (Patch av Neil Muller; :issue:`2746`.)

source: The :meth:`!readline` method of :class:`~io.StringIO` objects now does nothing when a negative length is requested, as other file-like objects do. (:issue:`7348`).
sv: Metoden :meth:`!readline` för :class:`~io.StringIO`-objekt gör nu ingenting när en negativ längd begärs, som andra filliknande objekt gör. (:issue:`7348`).

source: For C extensions:
sv: För C-tillägg:

source: C extensions that use integer format codes with the ``PyArg_Parse*`` family of functions will now raise a :exc:`TypeError` exception instead of triggering a :exc:`DeprecationWarning` (:issue:`5080`).
sv: C-tillägg som använder heltalsformatkoder med ``PyArg_Parse*``-familjen av funktioner kommer nu att ge upphov till ett :exc:`TypeError`-undantag istället för att utlösa en :exc:`DeprecationWarning` (:issue:`5080`).

source: Use the new :c:func:`PyOS_string_to_double` function instead of the old :c:func:`!PyOS_ascii_strtod` and :c:func:`!PyOS_ascii_atof` functions, which are now deprecated.
sv: Använd den nya funktionen :c:func:`PyOS_string_to_double` istället för de gamla funktionerna :c:func:`!PyOS_ascii_strtod` och :c:func:`!PyOS_ascii_atof`, som nu är föråldrade.

source: For applications that embed Python:
sv: För applikationer som bygger in Python:

source: The :c:func:`!PySys_SetArgvEx` function was added, letting applications close a security hole when the existing :c:func:`!PySys_SetArgv` function was used. Check whether you're calling :c:func:`!PySys_SetArgv` and carefully consider whether the application should be using :c:func:`!PySys_SetArgvEx` with *updatepath* set to false.
sv: Funktionen :c:func:`!PySys_SetArgvEx` har lagts till, så att program kan täppa till ett säkerhetshål när den befintliga funktionen :c:func:`!PySys_SetArgv` används. Kontrollera om du anropar :c:func:`!PySys_SetArgv` och överväg noga om programmet bör använda :c:func:`!PySys_SetArgvEx` med *updatepath* satt till false.

source: New Features Added to Python 2.7 Maintenance Releases
sv: Nya funktioner i underhållsversionerna av Python 2.7

source: New features may be added to Python 2.7 maintenance releases when the situation genuinely calls for it. Any such additions must go through the Python Enhancement Proposal process, and make a compelling case for why they can't be adequately addressed by either adding the new feature solely to Python 3, or else by publishing it on the Python Package Index.
sv: Nya funktioner kan läggas till i Python 2.7 underhållsversioner när situationen verkligen kräver det. Alla sådana tillägg måste gå igenom Python Enhancement Proposal-processen och göra ett övertygande fall för varför de inte kan hanteras på ett adekvat sätt genom att antingen lägga till den nya funktionen enbart till Python 3, eller annars genom att publicera den på Python Package Index.

source: In addition to the specific proposals listed below, there is a general exemption allowing new ``-3`` warnings to be added in any Python 2.7 maintenance release.
sv: Utöver de specifika förslag som listas nedan finns det ett generellt undantag som tillåter att nya ``-3``-varningar läggs till i alla underhållsversioner av Python 2.7.

source: Two new environment variables for debug mode
sv: Två nya miljövariabler för felsökningsläget

source: In debug mode, the ``[xxx refs]`` statistic is not written by default, the :envvar:`!PYTHONSHOWREFCOUNT` environment variable now must also be set. (Contributed by Victor Stinner; :issue:`31733`.)
sv: I felsökningsläge skrivs inte ``[xxx refs]``-statistiken som standard, miljövariabeln :envvar:`!PYTHONSHOWREFCOUNT` måste nu också anges. (Bidrag från Victor Stinner; :issue:`31733`.)

source: When Python is compiled with ``COUNT_ALLOC`` defined, allocation counts are no longer dumped by default anymore: the :envvar:`!PYTHONSHOWALLOCCOUNT` environment variable must now also be set. Moreover, allocation counts are now dumped into stderr, rather than stdout. (Contributed by Victor Stinner; :issue:`31692`.)
sv: När Python kompileras med ``COUNT_ALLOC`` definierat, dumpas inte längre allokeringsräkningar som standard: miljövariabeln :envvar:`!PYTHONSHOWALLOCCOUNT` måste nu också ställas in. Dessutom dumpas allokeringsräkningar nu i stderr, snarare än i stdout. (Bidrag från Victor Stinner; :issue:`31692`.)

source: PEP 434: IDLE Enhancement Exception for All Branches
sv: PEP 434: Undantag för IDLE Enhancement för alla filialer

source: :pep:`434` describes a general exemption for changes made to the IDLE development environment shipped along with Python. This exemption makes it possible for the IDLE developers to provide a more consistent user experience across all supported versions of Python 2 and 3.
sv: :pep:`434` beskriver ett generellt undantag för ändringar som görs i utvecklingsmiljön IDLE som levereras tillsammans med Python. Detta undantag gör det möjligt för IDLE-utvecklarna att tillhandahålla en mer konsekvent användarupplevelse i alla versioner av Python 2 och 3 som stöds.

source: For details of any IDLE changes, refer to the NEWS file for the specific release.
sv: För detaljer om eventuella IDLE-ändringar, se NEWS-filen för den specifika utgåvan.

source: PEP 466: Network Security Enhancements for Python 2.7
sv: PEP 466: Förbättringar av nätverkssäkerhet för Python 2.7

source: :pep:`466` describes a number of network security enhancement proposals that have been approved for inclusion in Python 2.7 maintenance releases, with the first of those changes appearing in the Python 2.7.7 release.
sv: :pep:`466` beskriver ett antal förslag till förbättringar av nätverkssäkerheten som har godkänts för att ingå i Python 2.7 underhållsversioner, med den första av dessa ändringar som visas i Python 2.7.7 release.

source: :pep:`466` related features added in Python 2.7.7:
sv: :pep:`466` relaterade funktioner tillagda i Python 2.7.7:

source: :func:`hmac.compare_digest` was backported from Python 3 to make a timing attack resistant comparison operation available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21306`.)
sv: :func:`hmac.compare_digest` backporterades från Python 3 för att göra en jämförelseoperation som är resistent mot tidsattacker tillgänglig för Python 2-applikationer. (Bidrag från Alex Gaynor; :issue:`21306`.)

source: OpenSSL 1.0.1g was upgraded in the official Windows installers published on python.org. (Contributed by Zachary Ware; :issue:`21462`.)
sv: OpenSSL 1.0.1g uppgraderades i de officiella Windows-installationsprogrammen som publicerades på python.org. (Bidrag från Zachary Ware; :issue:`21462`.)

source: :pep:`466` related features added in Python 2.7.8:
sv: :pep:`466` relaterade funktioner tillagda i Python 2.7.8:

source: :func:`hashlib.pbkdf2_hmac` was backported from Python 3 to make a hashing algorithm suitable for secure password storage broadly available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21304`.)
sv: :func:`hashlib.pbkdf2_hmac` backporterades från Python 3 för att göra en hash-algoritm lämplig för säker lösenordslagring allmänt tillgänglig för Python 2-applikationer. (Bidrag från Alex Gaynor; :issue:`21304`.)

source: OpenSSL 1.0.1h was upgraded for the official Windows installers published on python.org. (Contributed by Zachary Ware in :issue:`21671` for :cve:`2014-0224`.)
sv: OpenSSL 1.0.1h uppgraderades för de officiella Windows-installatörerna som publicerades på python.org. (Bidrag från Zachary Ware i :issue:`21671` för :cve:`2014-0224`.)

source: :pep:`466` related features added in Python 2.7.9:
sv: :pep:`466` relaterade funktioner tillagda i Python 2.7.9:

source: Most of Python 3.4's :mod:`ssl` module was backported. This means :mod:`ssl` now supports Server Name Indication, TLS1.x settings, access to the platform certificate store, the :class:`~ssl.SSLContext` class, and other features. (Contributed by Alex Gaynor and David Reid; :issue:`21308`.)
sv: Det mesta av Python 3.4:s :mod:`ssl`-modul har bakåtporterats. Detta innebär att :mod:`ssl` nu stöder Server Name Indication, TLS1.x-inställningar, åtkomst till plattformens certifikatarkiv, klassen :class:`~ssl.SSLContext` och andra funktioner. (Bidrag från Alex Gaynor och David Reid; :issue:`21308`.)

source: Refer to the "Version added: 2.7.9" notes in the module documentation for specific details.
sv: Se anteckningarna "Version added: 2.7.9" i modulens dokumentation för mer information.

source: :func:`os.urandom` was changed to cache a file descriptor to ``/dev/urandom`` instead of reopening ``/dev/urandom`` on every call. (Contributed by Alex Gaynor; :issue:`21305`.)
sv: :func:`os.urandom` ändrades till att cacha en filbeskrivare till ``/dev/urandom`` istället för att öppna ``/dev/urandom`` igen vid varje anrop. (Bidrag från Alex Gaynor; :issue:`21305`.)

source: :data:`hashlib.algorithms_guaranteed` and :data:`hashlib.algorithms_available` were backported from Python 3 to make it easier for Python 2 applications to select the strongest available hash algorithm. (Contributed by Alex Gaynor in :issue:`21307`)
sv: :data:`hashlib.algorithms_guaranteed` och :data:`hashlib.algorithms_available` backporterades från Python 3 för att göra det enklare för Python 2-applikationer att välja den starkaste tillgängliga hashalgoritmen. (Bidrag från Alex Gaynor i :issue:`21307`)

source: PEP 477: Backport ensurepip (PEP 453) to Python 2.7
sv: PEP 477: Backportera ensurepip (PEP 453) till Python 2.7

source: :pep:`477` approves the inclusion of the :pep:`453` ensurepip module and the improved documentation that was enabled by it in the Python 2.7 maintenance releases, appearing first in the Python 2.7.9 release.
sv: :pep:`477` godkänner införandet av modulen :pep:`453` ensurepip och den förbättrade dokumentationen som möjliggjordes av den i underhållsversionerna av Python 2.7, som först visas i Python 2.7.9.

source: Bootstrapping pip By Default
sv: Bootstrapping pip som standard
