Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: The :mod:`bdb` module's base debugging class :class:`~bdb.Bdb` gained a feature for skipping modules. The constructor now takes an iterable containing glob-style patterns such as ``django.*``; the debugger will not step into stack frames from a module that matches one of these patterns. (Contributed by Maru Newby after a suggestion by Senthil Kumaran; :issue:`5142`.)
sv: Modulen :mod:`bdb` basklass för felsökning :class:`~bdb.Bdb` har fått en funktion för att hoppa över moduler. Konstruktören tar nu en iterabel som innehåller glob-stil mönster som ``django.*``; felsökaren kommer inte att gå in i stack frames från en modul som matchar ett av dessa mönster. (Bidrag från Maru Newby efter ett förslag från Senthil Kumaran; :issue:`5142`.)

source: The :mod:`binascii` module now supports the buffer API, so it can be used with :class:`memoryview` instances and other similar buffer objects. (Backported from 3.x by Florent Xicluna; :issue:`7703`.)
sv: Modulen :mod:`binascii` har nu stöd för buffert-API:t, så den kan användas med :class:`memoryview`-instanser och andra liknande buffertobjekt. (Baktransporterad från 3.x av Florent Xicluna; :issue:`7703`.)

source: Updated module: the :mod:`!bsddb` module has been updated from 4.7.2devel9 to version 4.8.4 of `the pybsddb package <https://www.jcea.es/programacion/pybsddb.htm>`__. The new version features better Python 3.x compatibility, various bug fixes, and adds several new BerkeleyDB flags and methods. (Updated by Jesús Cea Avión; :issue:`8156`. The pybsddb changelog can be read at https://hg.jcea.es/pybsddb/file/tip/ChangeLog.)
sv: Uppdaterad modul: Modulen :mod:`!bsddb` har uppdaterats från 4.7.2devel9 till version 4.8.4 av `the pybsddb package <https://www.jcea.es/programacion/pybsddb.htm>`__. Den nya versionen har bättre Python 3.x-kompatibilitet, olika buggfixar och lägger till flera nya BerkeleyDB-flaggor och -metoder. (Uppdaterad av Jesús Cea Avión; :issue:`8156`. Ändringsloggen för pybsddb kan läsas på https://hg.jcea.es/pybsddb/file/tip/ChangeLog.)

source: The :mod:`bz2` module's :class:`~bz2.BZ2File` now supports the context management protocol, so you can write ``with bz2.BZ2File(...) as f:``. (Contributed by Hagen Fürstenau; :issue:`3860`.)
sv: Modulen :mod:`bz2`:s :class:`~bz2.BZ2File` stöder nu kontexthanteringsprotokollet, så att du kan skriva ``med bz2.BZ2File(...) som f:``. (Bidrag från Hagen Fürstenau; :issue:`3860`.)

source: New class: the :class:`~collections.Counter` class in the :mod:`collections` module is useful for tallying data. :class:`~collections.Counter` instances behave mostly like dictionaries but return zero for missing keys instead of raising a :exc:`KeyError`:
sv: Ny klass: Klassen :class:`~collections.Counter` i modulen :mod:`collections` är användbar för att räkna data. Instanser av :class:`~collections.Counter` beter sig mestadels som ordböcker men returnerar noll om nycklar saknas istället för att ge upphov till :exc:`KeyError`:

source: >>> from collections import Counter >>> c = Counter() >>> for letter in 'here is a sample of english text': ... c[letter] += 1 ... >>> c Counter({' ': 6, 'e': 5, 's': 3, 'a': 2, 'i': 2, 'h': 2, 'l': 2, 't': 2, 'g': 1, 'f': 1, 'm': 1, 'o': 1, 'n': 1, 'p': 1, 'r': 1, 'x': 1}) >>> c['e'] 5 >>> c['z'] 0
sv: >>> from collections import Räknare >>> c = Räknare() >>> for letter in 'här är ett exempel på engelsk text': ... c[bokstav] += 1 ... >>> c Counter({' ': 6, 'e': 5, 's': 3, 'a': 2, 'i': 2, 'h': 2, 'l': 2, 't': 2, 'g': 1, 'f': 1, "m": 1, "o": 1, "n": 1, 'p': 1, 'r': 1, 'x': 1}) >>> c['e'] 5 >>> c['z'] 0

source: There are three additional :class:`~collections.Counter` methods. :meth:`~collections.Counter.most_common` returns the N most common elements and their counts. :meth:`~collections.Counter.elements` returns an iterator over the contained elements, repeating each element as many times as its count. :meth:`~collections.Counter.subtract` takes an iterable and subtracts one for each element instead of adding; if the argument is a dictionary or another :class:`Counter`, the counts are subtracted. ::
sv: Det finns ytterligare tre :class:`~collections.Counter`-metoder. :meth:`~collections.Counter.most_common` returnerar de N vanligaste elementen och deras antal. :meth:`~collections.Counter.elements` returnerar en iterator över de ingående elementen och upprepar varje element lika många gånger som dess antal. :meth:`~collections.Counter.subtract` tar en iterabel och subtraherar ett för varje element istället för att addera; om argumentet är en ordbok eller en annan :class:`Counter` subtraheras antalet. ::

source: >>> c.most_common(5) [(' ', 6), ('e', 5), ('s', 3), ('a', 2), ('i', 2)] >>> c.elements() -> 'a', 'a', ' ', ' ', ' ', ' ', ' ', ' ', 'e', 'e', 'e', 'e', 'e', 'g', 'f', 'i', 'i', 'h', 'h', 'm', 'l', 'l', 'o', 'n', 'p', 's', 's', 's', 'r', 't', 't', 'x' >>> c['e'] 5 >>> c.subtract('very heavy on the letter e') >>> c['e'] # Count is now lower -1
sv: >>> c.mest_vanliga(5) [(' ', 6), ('e', 5), ('s', 3), ('a', 2), ('i', 2)] >>> c.element() -> 'a', 'a', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'e', 'e', 'e', 'e', 'e', 'g', 'f', 'i', 'i', "h", "h", "m", "l", "l", "o", "n", "p", "s", 's', 's', 'r', 't', 't', 'x' >>> c['e'] 5 >>> c.subtract('mycket tung på bokstaven e') >>> c['e'] # Antalet är nu lägre -1

source: Contributed by Raymond Hettinger; :issue:`1696199`.
sv: Bidrag från Raymond Hettinger; :issue:`1696199`.

source: New class: :class:`~collections.OrderedDict` is described in the earlier section :ref:`pep-0372`.
sv: Ny klass: :class:`~collections.OrderedDict` beskrivs i det tidigare avsnittet :ref:`pep-0372`.

source: New method: The :class:`~collections.deque` data type now has a :meth:`~collections.deque.count` method that returns the number of contained elements equal to the supplied argument *x*, and a :meth:`~collections.deque.reverse` method that reverses the elements of the deque in-place. :class:`~collections.deque` also exposes its maximum length as the read-only :attr:`~collections.deque.maxlen` attribute. (Both features added by Raymond Hettinger.)
sv: Ny metod: Datatypen :class:`~collections.deque` har nu en :meth:`~collections.deque.count`-metod som returnerar antalet ingående element som är lika med det medföljande argumentet *x*, och en :meth:`~collections.deque.reverse`-metod som reverserar elementen i deque på plats. :class:`~collections.deque` exponerar också sin maximala längd som det skrivskyddade attributet :attr:`~collections.deque.maxlen`. (Båda funktionerna har lagts till av Raymond Hettinger.)

source: The :class:`~collections.namedtuple` class now has an optional *rename* parameter. If *rename* is true, field names that are invalid because they've been repeated or aren't legal Python identifiers will be renamed to legal names that are derived from the field's position within the list of fields:
sv: Klassen :class:`~collections.namedtuple` har nu en valfri parameter *rename*. Om *rename* är true kommer fältnamn som är ogiltiga eftersom de har upprepats eller inte är lagliga Python-identifierare att bytas ut mot lagliga namn som härleds från fältets position i listan över fält:

source: (Added by Raymond Hettinger; :issue:`1818`.)
sv: (Tillagd av Raymond Hettinger; :issue:`1818`.)

source: Finally, the :class:`~collections.abc.Mapping` abstract base class now returns :data:`NotImplemented` if a mapping is compared to another type that isn't a :class:`Mapping`. (Fixed by Daniel Stutzbach; :issue:`8729`.)
sv: Slutligen returnerar den abstrakta basklassen :class:`~collections.abc.Mapping` nu :data:`NotImplemented` om en mappning jämförs med en annan typ som inte är en :class:`Mapping`. (Rättad av Daniel Stutzbach; :issue:`8729`.)

source: Constructors for the parsing classes in the :mod:`ConfigParser <configparser>` module now take an *allow_no_value* parameter, defaulting to false; if true, options without values will be allowed. For example::
sv: Konstruktörer för parsing-klasserna i modulen :mod:`ConfigParser <configparser>` tar nu en *allow_no_value*-parameter, med false som standard; om true tillåts alternativ utan värden. Till exempel::

source: >>> import ConfigParser, StringIO >>> sample_config = """ ... [mysqld] ... user = mysql ... pid-file = /var/run/mysqld/mysqld.pid ... skip-bdb ... """ >>> config = ConfigParser.RawConfigParser(allow_no_value=True) >>> config.readfp(StringIO.StringIO(sample_config)) >>> config.get('mysqld', 'user') 'mysql' >>> print config.get('mysqld', 'skip-bdb') None >>> print config.get('mysqld', 'unknown') Traceback (most recent call last): ... NoOptionError: No option 'unknown' in section: 'mysqld'
sv: >>> import ConfigParser, StringIO >>> exempel_konfig = """ ... [mysqld] ... användare = mysql ... pid-fil = /var/run/mysqld/mysqld.pid ... skip-bdb ... """ >>> config = ConfigParser.RawConfigParser(allow_no_value=True) >>> config.readfp(StringIO.StringIO(sample_config)) >>> config.get('mysqld', 'user') 'mysql' >>> print config.get('mysqld', 'skip-bdb') Ingen >>> print config.get('mysqld', 'unknown') Traceback (senaste anropet senast): ... NoOptionError: Inget alternativ 'unknown' i avsnitt: 'mysqld'

source: (Contributed by Mats Kindahl; :issue:`7005`.)
sv: (Bidrag från Mats Kindahl; :issue:`7005`.)

source: Deprecated function: :func:`!contextlib.nested`, which allows handling more than one context manager with a single :keyword:`with` statement, has been deprecated, because the :keyword:`!with` statement now supports multiple context managers.
sv: Föråldrad funktion: :func:`!contextlib.nested`, som gör det möjligt att hantera mer än en kontexthanterare med ett enda :keyword:`with`-svar, har utgått eftersom :keyword:`!with`-svaret nu stöder flera kontexthanterare.

source: The :mod:`cookielib <http.cookiejar>` module now ignores cookies that have an invalid version field, one that doesn't contain an integer value. (Fixed by John J. Lee; :issue:`3924`.)
sv: Modulen :mod:`cookielib <http.cookiejar>` ignorerar nu cookies som har ett ogiltigt versionsfält, ett som inte innehåller ett heltalsvärde. (Åtgärdat av John J. Lee; :issue:`3924`.)

source: The :mod:`copy` module's :func:`~copy.deepcopy` function will now correctly copy bound instance methods. (Implemented by Robert Collins; :issue:`1515`.)
sv: Modulen :mod:`copy`:s :func:`~copy.deepcopy`-funktion kopierar nu bundna instansmetoder korrekt. (Implementerat av Robert Collins; :issue:`1515`.)

source: The :mod:`ctypes` module now always converts ``None`` to a C ``NULL`` pointer for arguments declared as pointers. (Changed by Thomas Heller; :issue:`4606`.) The underlying `libffi library <https://sourceware.org/libffi/>`__ has been updated to version 3.0.9, containing various fixes for different platforms. (Updated by Matthias Klose; :issue:`8142`.)
sv: Modulen :mod:`ctypes` konverterar nu alltid ``None`` till en C ``NULL``-pekare för argument som deklarerats som pekare. (Ändrad av Thomas Heller; :issue:`4606`.) Det underliggande `libffi-biblioteket <https://sourceware.org/libffi/>`__ har uppdaterats till version 3.0.9, som innehåller diverse korrigeringar för olika plattformar. (Uppdaterad av Matthias Klose; :issue:`8142`.)

source: New method: the :mod:`datetime` module's :class:`~datetime.timedelta` class gained a :meth:`~datetime.timedelta.total_seconds` method that returns the number of seconds in the duration. (Contributed by Brian Quinlan; :issue:`5788`.)
sv: Ny metod: :mod:`datetime`-modulens :class:`~datetime.timedelta`-klass har fått en :meth:`~datetime.timedelta.total_seconds`-metod som returnerar antalet sekunder i varaktigheten. (Bidrag från Brian Quinlan; :issue:`5788`.)

source: New method: the :class:`~decimal.Decimal` class gained a :meth:`~decimal.Decimal.from_float` class method that performs an exact conversion of a floating-point number to a :class:`!Decimal`. This exact conversion strives for the closest decimal approximation to the floating-point representation's value; the resulting decimal value will therefore still include the inaccuracy, if any. For example, ``Decimal.from_float(0.1)`` returns ``Decimal('0.1000000000000000055511151231257827021181583404541015625')``. (Implemented by Raymond Hettinger; :issue:`4796`.)
sv: Ny metod: Klassen :class:`~decimal.Decimal` har fått en klassmetod :meth:`~decimal.Decimal.from_float` som utför en exakt konvertering av ett flyttal till en :class:`!Decimal`. Denna exakta konvertering strävar efter den närmaste decimala approximationen av värdet i flyttalsrepresentationen; det resulterande decimalvärdet kommer därför fortfarande att inkludera felaktigheten, om någon. For example, ``Decimal.from_float(0.1)`` returns ``Decimal('0.1000000000000000055511151231257827021181583404541015625')``. (Implementerad av Raymond Hettinger; :issue:`4796`.)

source: Comparing instances of :class:`~decimal.Decimal` with floating-point numbers now produces sensible results based on the numeric values of the operands. Previously such comparisons would fall back to Python's default rules for comparing objects, which produced arbitrary results based on their type. Note that you still cannot combine :class:`!Decimal` and floating point in other operations such as addition, since you should be explicitly choosing how to convert between float and :class:`!Decimal`. (Fixed by Mark Dickinson; :issue:`2531`.)
sv: Jämförelse av instanser av :class:`~decimal.Decimal` med flyttal ger nu förnuftiga resultat baserat på operandernas numeriska värden. Tidigare skulle sådana jämförelser falla tillbaka på Pythons standardregler för att jämföra objekt, vilket gav godtyckliga resultat baserat på deras typ. Observera att du fortfarande inte kan kombinera :class:`!Decimal` och flyttal i andra operationer som t.ex. addition, eftersom du uttryckligen bör välja hur du konverterar mellan flyttal och :class:`!Decimal`. (Rättad av Mark Dickinson; :issue:`2531`.)

source: The constructor for :class:`~decimal.Decimal` now accepts floating-point numbers (added by Raymond Hettinger; :issue:`8257`) and non-European Unicode characters such as Arabic-Indic digits (contributed by Mark Dickinson; :issue:`6595`).
sv: Konstruktören för :class:`~decimal.Decimal` accepterar nu flyttal (tillagt av Raymond Hettinger; :issue:`8257`) och icke-europeiska Unicode-tecken som arabiska och indiska siffror (bidrag från Mark Dickinson; :issue:`6595`).

source: Most of the methods of the :class:`~decimal.Context` class now accept integers as well as :class:`~decimal.Decimal` instances; the only exceptions are the :meth:`~decimal.Context.canonical` and :meth:`~decimal.Context.is_canonical` methods. (Patch by Juan José Conti; :issue:`7633`.)
sv: De flesta av metoderna i klassen :class:`~decimal.Context` accepterar nu heltal såväl som :class:`~decimal.Decimal` instanser; de enda undantagen är metoderna :meth:`~decimal.Context.canonical` och :meth:`~decimal.Context.is_canonical`. (Patch av Juan José Conti; :issue:`7633`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`~str.format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which is more sensible for numeric types. (Changed by Mark Dickinson; :issue:`6857`.)
sv: När man använder :class:`~decimal.Decimal`-instanser med en strängs :meth:`~str.format`-metod var standardjusteringen tidigare vänsterjustering. Detta har ändrats till högerjustering, vilket är mer förnuftigt för numeriska typer. (Ändrad av Mark Dickinson; :issue:`6857`.)

source: Comparisons involving a signaling NaN value (or ``sNAN``) now signal :const:`~decimal.InvalidOperation` instead of silently returning a true or false value depending on the comparison operator. Quiet NaN values (or ``NaN``) are now hashable. (Fixed by Mark Dickinson; :issue:`7279`.)
sv: Jämförelser som involverar ett signalerande NaN-värde (eller ``NAN``) signalerar nu :const:`~decimal.InvalidOperation` istället för att i tysthet returnera ett sant eller falskt värde beroende på jämförelseoperatorn. Tysta NaN-värden (eller ``NaN``) är nu hashbara. (Rättad av Mark Dickinson; :issue:`7279`.)

source: The :mod:`difflib` module now produces output that is more compatible with modern :command:`diff`/:command:`patch` tools through one small change, using a tab character instead of spaces as a separator in the header giving the filename. (Fixed by Anatoly Techtonik; :issue:`7585`.)
sv: Modulen :mod:`difflib` producerar nu utdata som är mer kompatibla med moderna :command:`diff`/:command:`patch`-verktyg genom en liten ändring, nämligen att använda ett tabbtecken istället för mellanslag som separator i rubriken som anger filnamnet. (Fixad av Anatoly Techtonik; :issue:`7585`.)

source: The Distutils ``sdist`` command now always regenerates the :file:`MANIFEST` file, since even if the :file:`MANIFEST.in` or :file:`setup.py` files haven't been modified, the user might have created some new files that should be included. (Fixed by Tarek Ziadé; :issue:`8688`.)
sv: Distutils ``sdist``-kommando regenererar nu alltid filen :file:`MANIFEST`, eftersom även om filerna :file:`MANIFEST.in` eller :file:`setup.py` inte har ändrats, kan användaren ha skapat några nya filer som bör inkluderas. (Rättad av Tarek Ziadé; :issue:`8688`.)

source: The :mod:`doctest` module's :const:`~doctest.IGNORE_EXCEPTION_DETAIL` flag will now ignore the name of the module containing the exception being tested. (Patch by Lennart Regebro; :issue:`7490`.)
sv: :mod:`doctest`-modulens :const:`~doctest.IGNORE_EXCEPTION_DETAIL`-flagga ignorerar nu namnet på den modul som innehåller det undantag som testas. (Patch av Lennart Regebro; :issue:`7490`.)

source: The :mod:`email` module's :class:`~email.message.Message` class will now accept a Unicode-valued payload, automatically converting the payload to the encoding specified by :attr:`!output_charset`. (Added by R. David Murray; :issue:`1368247`.)
sv: Modulen :mod:`email`:s klass :class:`~email.message.Message` accepterar nu en Unicode-värderad nyttolast och konverterar automatiskt nyttolasten till den kodning som anges av :attr:`!output_charset`. (Tillagd av R. David Murray; :issue:`1368247`.)

source: The :class:`~fractions.Fraction` class now accepts a single float or :class:`~decimal.Decimal` instance, or two rational numbers, as arguments to its constructor. (Implemented by Mark Dickinson; rationals added in :issue:`5812`, and float/decimal in :issue:`8294`.)
sv: Klassen :class:`~fractions.Fraction` accepterar nu en enda float- eller :class:`~decimal.Decimal`-instans, eller två rationella tal, som argument till sin konstruktor. (Implementerad av Mark Dickinson; rationella tal tillkom i :issue:`5812`, och float/decimal i :issue:`8294`.)

source: Ordering comparisons (``<``, ``<=``, ``>``, ``>=``) between fractions and complex numbers now raise a :exc:`TypeError`. This fixes an oversight, making the :class:`~fractions.Fraction` match the other numeric types.
sv: Jämförelser av ordningsföljd (``<``, ``<=``, ``>``, ``>=``) mellan bråk och komplexa tal ger nu upphov till ett :exc:`TypeError`. Detta åtgärdar ett förbiseende, vilket gör att :class:`~fractions.Fraction` matchar de andra numeriska typerna.

source: New class: :class:`~ftplib.FTP_TLS` in the :mod:`ftplib` module provides secure FTP connections using TLS encapsulation of authentication as well as subsequent control and data transfers. (Contributed by Giampaolo Rodola; :issue:`2054`.)
sv: Ny klass: :class:`~ftplib.FTP_TLS` i modulen :mod:`ftplib` ger säkra FTP-anslutningar med TLS-inkapsling av autentisering samt efterföljande kontroll- och dataöverföringar. (Bidrag från Giampaolo Rodola; :issue:`2054`.)

source: The :meth:`~ftplib.FTP.storbinary` method for binary uploads can now restart uploads thanks to an added *rest* parameter (patch by Pablo Mouzo; :issue:`6845`.)
sv: Metoden :meth:`~ftplib.FTP.storbinary` för binära uppladdningar kan nu starta om uppladdningar tack vare en tillagd *rest*-parameter (patch av Pablo Mouzo; :issue:`6845`.)

source: New class decorator: :func:`~functools.total_ordering` in the :mod:`functools` module takes a class that defines an :meth:`~object.__eq__` method and one of :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, or :meth:`~object.__ge__`, and generates the missing comparison methods. Since the :meth:`!__cmp__` method is being deprecated in Python 3.x, this decorator makes it easier to define ordered classes. (Added by Raymond Hettinger; :issue:`5479`.)
sv: Ny klassdekorator: :func:`~functools.total_ordering` i modulen :mod:`functools` tar en klass som definierar en :meth:`~object.__eq__`-metod och en av :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__` eller :meth:`~object.__ge__` och genererar de jämförelsemetoder som saknas. Eftersom metoden :meth:`!__cmp__` försvinner i Python 3.x gör den här dekoratorn det enklare att definiera ordnade klasser. (Tillagd av Raymond Hettinger; :issue:`5479`.)

source: New function: :func:`~functools.cmp_to_key` will take an old-style comparison function that expects two arguments and return a new callable that can be used as the *key* parameter to functions such as :func:`sorted`, :func:`min` and :func:`max`, etc. The primary intended use is to help with making code compatible with Python 3.x. (Added by Raymond Hettinger.)
sv: Ny funktion: :func:`~functools.cmp_to_key` tar en gammaldags jämförelsefunktion som förväntar sig två argument och returnerar en ny anropbar funktion som kan användas som *key*-parameter till funktioner som :func:`sorted`, :func:`min` och :func:`max`, etc. Den primära avsedda användningen är att hjälpa till med att göra kod kompatibel med Python 3.x. (Tillagd av Raymond Hettinger.)

source: New function: the :mod:`gc` module's :func:`~gc.is_tracked` returns true if a given instance is tracked by the garbage collector, false otherwise. (Contributed by Antoine Pitrou; :issue:`4688`.)
sv: Ny funktion: :mod:`gc`-modulens :func:`~gc.is_tracked` returnerar true om en given instans spåras av skräpsamlaren, false annars. (Bidrag från Antoine Pitrou; :issue:`4688`.)

source: The :mod:`gzip` module's :class:`~gzip.GzipFile` now supports the context management protocol, so you can write ``with gzip.GzipFile(...) as f:`` (contributed by Hagen Fürstenau; :issue:`3860`), and it now implements the :class:`io.BufferedIOBase` ABC, so you can wrap it with :class:`io.BufferedReader` for faster processing (contributed by Nir Aides; :issue:`7471`). It's also now possible to override the modification time recorded in a gzipped file by providing an optional timestamp to the constructor. (Contributed by Jacques Frechet; :issue:`4272`.)
sv: Modulen :mod:`gzip` :class:`~gzip.GzipFile` har nu stöd för kontexthanteringsprotokollet, så att du kan skriva ``with gzip.GzipFile(...) as f:`` (bidrag från Hagen Fürstenau; :issue:`3860`), och den implementerar nu :class:`io.BufferedIOBase` ABC, så att du kan linda in den med :class:`io.BufferedReader` för snabbare bearbetning (bidrag från Nir Aides; :issue:`7471`). Det är nu också möjligt att åsidosätta den modifieringstid som registreras i en gzippad fil genom att tillhandahålla en valfri tidsstämpel till konstruktören. (Bidrag från Jacques Frechet; :issue:`4272`.)

source: Files in gzip format can be padded with trailing zero bytes; the :mod:`gzip` module will now consume these trailing bytes. (Fixed by Tadek Pietraszek and Brian Curtin; :issue:`2846`.)
sv: Filer i gzip-format kan fyllas på med nollbyte i slutet; modulen :mod:`gzip` kommer nu att använda dessa nollbyte i slutet. (Rättad av Tadek Pietraszek och Brian Curtin; :issue:`2846`.)
