Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: New attribute: the :mod:`hashlib` module now has an :attr:`!algorithms` attribute containing a tuple naming the supported algorithms. In Python 2.7, ``hashlib.algorithms`` contains ``('md5', 'sha1', 'sha224', 'sha256', 'sha384', 'sha512')``. (Contributed by Carl Chenet; :issue:`7418`.)
sv: Nytt attribut: Modulen :mod:`hashlib` har nu ett attribut :attr:`!algorithms` som innehåller en tupel som namnger de algoritmer som stöds. I Python 2.7 innehåller ``hashlib.algorithms`` ``('md5', 'sha1', 'sha224', 'sha256', 'sha384', 'sha512')``. (Bidrag från Carl Chenet; :issue:`7418`.)

source: The default :class:`~http.client.HTTPResponse` class used by the :mod:`httplib <http>` module now supports buffering, resulting in much faster reading of HTTP responses. (Contributed by Kristján Valur Jónsson; :issue:`4879`.)
sv: Standardklassen :class:`~http.client.HTTPResponse` som används av modulen :mod:`httplib <http>` har nu stöd för buffring, vilket resulterar i mycket snabbare läsning av HTTP-svar. (Bidrag från Kristján Valur Jónsson; :issue:`4879`.)

source: The :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` classes now support a *source_address* parameter, a ``(host, port)`` 2-tuple giving the source address that will be used for the connection. (Contributed by Eldon Ziegler; :issue:`3972`.)
sv: Klasserna :class:`~http.client.HTTPConnection` och :class:`~http.client.HTTPSConnection` har nu stöd för en *source_address*-parameter, en ``(host, port)`` 2-tupel som anger den källadress som ska användas för anslutningen. (Bidrag från Eldon Ziegler; :issue:`3972`.)

source: The :mod:`!ihooks` module now supports relative imports. Note that :mod:`!ihooks` is an older module for customizing imports, superseded by the :mod:`!imputil` module added in Python 2.0. (Relative import support added by Neil Schemenauer.)
sv: Modulen :mod:`!ihooks` stöder nu relativ import. Observera att :mod:`!ihooks` är en äldre modul för att anpassa import, ersatt av modulen :mod:`!imputil` som tillkom i Python 2.0. (Stöd för relativ import tillagt av Neil Schemenauer.)

source: The :mod:`imaplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1655`.)
sv: Modulen :mod:`imaplib` har nu stöd för IPv6-adresser. (Bidrag från Derek Morr; :issue:`1655`.)

source: New function: the :mod:`inspect` module's :func:`~inspect.getcallargs` takes a callable and its positional and keyword arguments, and figures out which of the callable's parameters will receive each argument, returning a dictionary mapping argument names to their values. For example::
sv: Ny funktion: :mod:`inspect`-modulens :func:`~inspect.getcallargs` tar en anropbar parameter och dess positions- och nyckelordsargument och räknar ut vilken av den anropbara parametern som ska ta emot varje argument, och returnerar en ordbok som mappar argumentnamn till deras värden. Till exempel::

source: >>> from inspect import getcallargs >>> def f(a, b=1, *pos, **named): ... pass ... >>> getcallargs(f, 1, 2, 3) {'a': 1, 'b': 2, 'pos': (3,), 'named': {}} >>> getcallargs(f, a=2, x=4) {'a': 2, 'b': 1, 'pos': (), 'named': {'x': 4}} >>> getcallargs(f) Traceback (most recent call last): ... TypeError: f() takes at least 1 argument (0 given)
sv: >>> från inspect import getcallargs >>> def f(a, b=1, *pos, **named): ... pass ... >>> getcallargs(f, 1, 2, 3) {'a': 1, 'b': 2, 'pos': (3,), 'named': {}} >>> getcallargs(f, a=2, x=4) {'a': 2, 'b': 1, 'pos': (), 'named': {'x': 4}} >>> getcallargs(f) Traceback (senaste anropet senast): ... TypeError: f() tar minst 1 argument (0 givna)

source: Contributed by George Sakkis; :issue:`3135`.
sv: Bidrag från George Sakkis; :issue:`3135`.

source: Updated module: The :mod:`io` library has been upgraded to the version shipped with Python 3.1. For 3.1, the I/O library was entirely rewritten in C and is 2 to 20 times faster depending on the task being performed. The original Python version was renamed to the :mod:`!_pyio` module.
sv: Uppdaterad modul: Biblioteket :mod:`io` har uppgraderats till den version som levereras med Python 3.1. För 3.1 skrevs I/O-biblioteket om helt i C och är 2 till 20 gånger snabbare beroende på vilken uppgift som utförs. Den ursprungliga Python-versionen döptes om till modulen :mod:`!_pyio`.

source: One minor resulting change: the :class:`io.TextIOBase` class now has an :attr:`~io.TextIOBase.errors` attribute giving the error setting used for encoding and decoding errors (one of ``'strict'``, ``'replace'``, ``'ignore'``).
sv: En mindre förändring: klassen :class:`io.TextIOBase` har nu ett attribut :attr:`~io.TextIOBase.errors` som anger den felinställning som används för kodnings- och avkodningsfel (en av ``'strict'``, ``'replace'``, ``'ignore'``).

source: The :class:`io.FileIO` class now raises an :exc:`OSError` when passed an invalid file descriptor. (Implemented by Benjamin Peterson; :issue:`4991`.) The :meth:`~io.IOBase.truncate` method now preserves the file position; previously it would change the file position to the end of the new file. (Fixed by Pascal Chambon; :issue:`6939`.)
sv: Klassen :class:`io.FileIO` ger nu upphov till ett :exc:`OSError` när en ogiltig filbeskrivare skickas. (Implementerat av Benjamin Peterson; :issue:`4991`.) Metoden :meth:`~io.IOBase.truncate` bevarar nu filpositionen; tidigare ändrade den filpositionen till slutet av den nya filen. (Åtgärdat av Pascal Chambon; :issue:`6939`.)

source: New function: ``itertools.compress(data, selectors)`` takes two iterators. Elements of *data* are returned if the corresponding value in *selectors* is true::
sv: Ny funktion: ``itertools.compress(data, selectors)`` tar två iteratorer. Element i *data* returneras om motsvarande värde i *selectors* är true::

source: New function: ``itertools.combinations_with_replacement(iter, r)`` returns all the possible *r*-length combinations of elements from the iterable *iter*. Unlike :func:`~itertools.combinations`, individual elements can be repeated in the generated combinations::
sv: Ny funktion: ``itertools.combinations_with_replacement(iter, r)`` returnerar alla möjliga *r*-längdkombinationer av element från iterabeln *iter*. Till skillnad från :func:`~itertools.combinations` kan enskilda element upprepas i de genererade kombinationerna::

source: itertools.combinations_with_replacement('abc', 2) => ('a', 'a'), ('a', 'b'), ('a', 'c'), ('b', 'b'), ('b', 'c'), ('c', 'c')
sv: itertools.kombinationer_med_ersättning('abc', 2) => ('a', 'a'), ('a', 'b'), ('a', 'c'), ('b', 'b'), ('b', 'c'), ('c', 'c')

source: Note that elements are treated as unique depending on their position in the input, not their actual values.
sv: Observera att element behandlas som unika beroende på deras position i inmatningen, inte deras faktiska värden.

source: The :func:`itertools.count` function now has a *step* argument that allows incrementing by values other than 1. :func:`~itertools.count` also now allows keyword arguments, and using non-integer values such as floats or :class:`~decimal.Decimal` instances. (Implemented by Raymond Hettinger; :issue:`5032`.)
sv: Funktionen :func:`itertools.count` har nu ett *step*-argument som tillåter inkrementering med andra värden än 1. :func:`~itertools.count` tillåter nu också nyckelordsargument och användning av värden som inte är heltal, t.ex. flyttal eller :class:`~decimal.Decimal`-instanser. (Implementerat av Raymond Hettinger; :issue:`5032`.)

source: :func:`itertools.combinations` and :func:`itertools.product` previously raised :exc:`ValueError` for values of *r* larger than the input iterable. This was deemed a specification error, so they now return an empty iterator. (Fixed by Raymond Hettinger; :issue:`4816`.)
sv: :func:`itertools.combinations` och :func:`itertools.product` gav tidigare upphov till :exc:`ValueError` för värden på *r* som var större än den ingående iterabeln. Detta ansågs vara ett specifikationsfel, så de returnerar nu en tom iterator. (Åtgärdat av Raymond Hettinger; :issue:`4816`.)

source: Updated module: The :mod:`json` module was upgraded to version 2.0.9 of the simplejson package, which includes a C extension that makes encoding and decoding faster. (Contributed by Bob Ippolito; :issue:`4136`.)
sv: Uppdaterad modul: Modulen :mod:`json` uppgraderades till version 2.0.9 av paketet simplejson, som innehåller ett C-tillägg som gör kodning och avkodning snabbare. (Bidrag från Bob Ippolito; :issue:`4136`.)

source: To support the new :class:`collections.OrderedDict` type, :func:`json.load` now has an optional *object_pairs_hook* parameter that will be called with any object literal that decodes to a list of pairs. (Contributed by Raymond Hettinger; :issue:`5381`.)
sv: För att stödja den nya :class:`collections.OrderedDict`-typen har :func:`json.load` nu en valfri *object_pairs_hook*-parameter som kommer att anropas med alla objektlitteraler som avkodas till en lista med par. (Bidrag från Raymond Hettinger; :issue:`5381`.)

source: The :mod:`mailbox` module's :class:`~mailbox.Maildir` class now records the timestamp on the directories it reads, and only re-reads them if the modification time has subsequently changed. This improves performance by avoiding unneeded directory scans. (Fixed by A.M. Kuchling and Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)
sv: Klassen :class:`~mailbox.Maildir` i modulen :mod:`mailbox` registrerar nu tidsstämpeln för de kataloger som läses och läser bara om dem igen om modifieringstiden har ändrats i efterhand. Detta förbättrar prestandan genom att onödiga kataloggenomsökningar undviks. (Rättad av A.M. Kuchling och Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)

source: New functions: the :mod:`math` module gained :func:`~math.erf` and :func:`~math.erfc` for the error function and the complementary error function, :func:`~math.expm1` which computes ``e**x - 1`` with more precision than using :func:`~math.exp` and subtracting 1, :func:`~math.gamma` for the Gamma function, and :func:`~math.lgamma` for the natural log of the Gamma function. (Contributed by Mark Dickinson and nirinA raseliarison; :issue:`3366`.)
sv: Nya funktioner: Modulen :mod:`math` har fått :func:`~math.erf` och :func:`~math.erfc` för felfunktionen och den komplementära felfunktionen, :func:`~math.expm1` som beräknar ``e**x - 1`` med mer precision än att använda :func:`~math.exp` och subtrahera 1, :func:`~math.gamma` för Gamma-funktionen och :func:`~math.lgamma` för den naturliga logaritmen av Gamma-funktionen. (Bidrag från Mark Dickinson och nirinA raseliarison; :issue:`3366`.)

source: The :mod:`multiprocessing` module's :class:`!Manager*` classes can now be passed a callable that will be called whenever a subprocess is started, along with a set of arguments that will be passed to the callable. (Contributed by lekma; :issue:`5585`.)
sv: :mod:`multiprocessing`-modulens :class:`!Manager*`-klasser kan nu skickas till en anropbar som anropas när en underprocess startas, tillsammans med en uppsättning argument som skickas till den anropbara. (Bidrag från lekma; :issue:`5585`.)

source: The :class:`~multiprocessing.pool.Pool` class, which controls a pool of worker processes, now has an optional *maxtasksperchild* parameter. Worker processes will perform the specified number of tasks and then exit, causing the :class:`!Pool` to start a new worker. This is useful if tasks may leak memory or other resources, or if some tasks will cause the worker to become very large. (Contributed by Charles Cazabon; :issue:`6963`.)
sv: Klassen :class:`~multiprocessing.pool.Pool`, som styr en pool av arbetsprocesser, har nu en valfri parameter *maxtasksperchild*. Arbetsprocesserna kommer att utföra det angivna antalet uppgifter och sedan avsluta, vilket gör att :class:`!Pool` startar en ny arbetsprocess. Detta är användbart om uppgifter kan läcka minne eller andra resurser, eller om vissa uppgifter gör att arbetsprocessen blir mycket stor. (Bidrag från Charles Cazabon; :issue:`6963`.)

source: The :mod:`!nntplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1664`.)
sv: Modulen :mod:`!nntplib` har nu stöd för IPv6-adresser. (Bidrag från Derek Morr; :issue:`1664`.)

source: New functions: the :mod:`os` module wraps the following POSIX system calls: :func:`~os.getresgid` and :func:`~os.getresuid`, which return the real, effective, and saved GIDs and UIDs; :func:`~os.setresgid` and :func:`~os.setresuid`, which set real, effective, and saved GIDs and UIDs to new values; :func:`~os.initgroups`, which initialize the group access list for the current process. (GID/UID functions contributed by Travis H.; :issue:`6508`. Support for initgroups added by Jean-Paul Calderone; :issue:`7333`.)
sv: Nya funktioner: Modulen :mod:`os` omsluter följande POSIX-anrop: :func:`~os.getresgid` och :func:`~os.getresuid`, som returnerar verkliga, effektiva och sparade GID och UID; :func:`~os.setresgid` och :func:`~os.setresuid`, som sätter verkliga, effektiva och sparade GID och UID till nya värden; :func:`~os.initgroups`, som initierar gruppåtkomstlistan för den aktuella processen. (GID/UID-funktioner bidragit med av Travis H.; :issue:`6508`. Stöd för initgroups tillagt av Jean-Paul Calderone; :issue:`7333`.)

source: The :func:`os.fork` function now re-initializes the import lock in the child process; this fixes problems on Solaris when :func:`~os.fork` is called from a thread. (Fixed by Zsolt Cserna; :issue:`7242`.)
sv: Funktionen :func:`os.fork` återinitierar nu importlåset i barnprocessen; detta åtgärdar problem på Solaris när :func:`~os.fork` anropas från en tråd. (Åtgärdat av Zsolt Cserna; :issue:`7242`.)

source: In the :mod:`os.path` module, the :func:`~os.path.normpath` and :func:`~os.path.abspath` functions now preserve Unicode; if their input path is a Unicode string, the return value is also a Unicode string. (:meth:`~os.path.normpath` fixed by Matt Giuca in :issue:`5827`; :meth:`~os.path.abspath` fixed by Ezio Melotti in :issue:`3426`.)
sv: I modulen :mod:`os.path` bevarar nu funktionerna :func:`~os.path.normpath` och :func:`~os.path.abspath` Unicode; om deras indatasökväg är en Unicode-sträng är returvärdet också en Unicode-sträng. (:meth:`~os.path.normpath` åtgärdad av Matt Giuca i :issue:`5827`; :meth:`~os.path.abspath` åtgärdad av Ezio Melotti i :issue:`3426`.)

source: The :mod:`pydoc` module now has help for the various symbols that Python uses. You can now do ``help('<<')`` or ``help('@')``, for example. (Contributed by David Laban; :issue:`4739`.)
sv: Modulen :mod:`pydoc` har nu hjälp för de olika symbolerna som Python använder. Du kan nu göra ``help('<<')`` eller ``help('@')``, till exempel. (Bidrag från David Laban; :issue:`4739`.)

source: The :mod:`re` module's :func:`~re.split`, :func:`~re.sub`, and :func:`~re.subn` now accept an optional *flags* argument, for consistency with the other functions in the module. (Added by Gregory P. Smith.)
sv: :mod:`re`-modulens :func:`~re.split`, :func:`~re.sub` och :func:`~re.subn` accepterar nu ett valfritt *flags*-argument, för konsekvens med de andra funktionerna i modulen. (Tillagd av Gregory P. Smith.)

source: New function: :func:`~runpy.run_path` in the :mod:`runpy` module will execute the code at a provided *path* argument. *path* can be the path of a Python source file (:file:`example.py`), a compiled bytecode file (:file:`example.pyc`), a directory (:file:`./package/`), or a zip archive (:file:`example.zip`). If a directory or zip path is provided, it will be added to the front of ``sys.path`` and the module :mod:`__main__` will be imported. It's expected that the directory or zip contains a :file:`__main__.py`; if it doesn't, some other :file:`__main__.py` might be imported from a location later in ``sys.path``. This makes more of the machinery of :mod:`runpy` available to scripts that want to mimic the way Python's command line processes an explicit path name. (Added by Nick Coghlan; :issue:`6816`.)
sv: Ny funktion: :func:`~runpy.run_path` i modulen :mod:`runpy` kommer att exekvera koden på ett angivet *path*-argument. *path* kan vara sökvägen till en Python-källfil (:file:`example.py`), en kompilerad bytecode-fil (:file:`example.pyc`), en katalog (:file:`./package/`) eller ett zip-arkiv (:file:`example.zip`). Om en katalog eller zip-sökväg anges kommer den att läggas till i början av ``sys.path`` och modulen :mod:`__main__`` kommer att importeras. Det förväntas att katalogen eller zip-filen innehåller en :file:`__main__.py`; om den inte gör det kan någon annan :file:`__main__.py` importeras från en plats längre fram i ``sys.path``. Detta gör mer av maskineriet i :mod:`runpy` tillgängligt för skript som vill efterlikna hur Pythons kommandorad behandlar ett explicit sökvägsnamn. (Tillagd av Nick Coghlan; :issue:`6816`.)

source: New function: in the :mod:`shutil` module, :func:`~shutil.make_archive` takes a filename, archive type (zip or tar-format), and a directory path, and creates an archive containing the directory's contents. (Added by Tarek Ziadé.)
sv: Ny funktion: I modulen :mod:`shutil` tar :func:`~shutil.make_archive` ett filnamn, en arkivtyp (zip- eller tar-format) och en sökväg till en katalog och skapar ett arkiv med katalogens innehåll. (Tillagd av Tarek Ziadé.)

source: :mod:`shutil`'s :func:`~shutil.copyfile` and :func:`~shutil.copytree` functions now raise a :exc:`~shutil.SpecialFileError` exception when asked to copy a named pipe. Previously the code would treat named pipes like a regular file by opening them for reading, and this would block indefinitely. (Fixed by Antoine Pitrou; :issue:`3002`.)
sv: :mod:`shutil`:s funktioner :func:`~shutil.copyfile` och :func:`~shutil.copytree` ger nu upphov till ett :exc:`~shutil.SpecialFileError`-undantag när de ombeds kopiera en namngiven pipe. Tidigare skulle koden behandla namngivna pipes som en vanlig fil genom att öppna dem för läsning, och detta skulle blockera i all oändlighet. (Åtgärdat av Antoine Pitrou; :issue:`3002`.)

source: The :mod:`signal` module no longer re-installs the signal handler unless this is truly necessary, which fixes a bug that could make it impossible to catch the EINTR signal robustly. (Fixed by Charles-Francois Natali; :issue:`8354`.)
sv: Modulen :mod:`signal` installerar inte längre om signalhanteraren om det inte verkligen är nödvändigt, vilket åtgärdar en bugg som kunde göra det omöjligt att fånga EINTR-signalen på ett robust sätt. (Rättad av Charles-Francois Natali; :issue:`8354`.)

source: New functions: in the :mod:`site` module, three new functions return various site- and user-specific paths. :func:`~site.getsitepackages` returns a list containing all global site-packages directories, :func:`~site.getusersitepackages` returns the path of the user's site-packages directory, and :func:`~site.getuserbase` returns the value of the :data:`~site.USER_BASE` environment variable, giving the path to a directory that can be used to store data. (Contributed by Tarek Ziadé; :issue:`6693`.)
sv: Nya funktioner: I :mod:`site`-modulen returnerar tre nya funktioner olika plats- och användarspecifika sökvägar. :func:`~site.getsitepackages` returnerar en lista med alla globala plats-paketkataloger, :func:`~site.getusersitepackages` returnerar sökvägen till användarens katalog med webbplats-paket och :func:`~site.getuserbase` returnerar värdet på miljövariabeln :data:`~site.USER_BASE`, vilket ger sökvägen till en katalog som kan användas för att lagra data. (Bidrag från Tarek Ziadé; :issue:`6693`.)

source: The :mod:`site` module now reports exceptions occurring when the :mod:`sitecustomize` module is imported, and will no longer catch and swallow the :exc:`KeyboardInterrupt` exception. (Fixed by Victor Stinner; :issue:`3137`.)
sv: Modulen :mod:`site` rapporterar nu undantag som inträffar när modulen :mod:`sitecustomize` importeras, och kommer inte längre att fånga och svälja undantaget :exc:`KeyboardInterrupt`. (Åtgärdat av Victor Stinner; :issue:`3137`.)

source: The :func:`~socket.create_connection` function gained a *source_address* parameter, a ``(host, port)`` 2-tuple giving the source address that will be used for the connection. (Contributed by Eldon Ziegler; :issue:`3972`.)
sv: Funktionen :func:`~socket.create_connection` fick en *source_address* parameter, en ``(host, port)`` 2-tupel som ger källadressen som kommer att användas för anslutningen. (Bidrag från Eldon Ziegler; :issue:`3972`.)

source: The :meth:`~socket.socket.recv_into` and :meth:`~socket.socket.recvfrom_into` methods will now write into objects that support the buffer API, most usefully the :class:`bytearray` and :class:`memoryview` objects. (Implemented by Antoine Pitrou; :issue:`8104`.)
sv: Metoderna :meth:`~socket.socket.recv_into` och :meth:`~socket.socket.recvfrom_into` kommer nu att skriva till objekt som stöder buffert-API:t, mest användbart är objekten :class:`bytearray` och :class:`memoryview`. (Implementerat av Antoine Pitrou; :issue:`8104`.)

source: The :mod:`SocketServer <socketserver>` module's :class:`~socketserver.TCPServer` class now supports socket timeouts and disabling the Nagle algorithm. The :attr:`!disable_nagle_algorithm` class attribute defaults to ``False``; if overridden to be true, new request connections will have the TCP_NODELAY option set to prevent buffering many small sends into a single TCP packet. The :attr:`~socketserver.BaseServer.timeout` class attribute can hold a timeout in seconds that will be applied to the request socket; if no request is received within that time, :meth:`~socketserver.BaseServer.handle_timeout` will be called and :meth:`~socketserver.BaseServer.handle_request` will return. (Contributed by Kristján Valur Jónsson; :issue:`6192` and :issue:`6267`.)
sv: Klassen :class:`~socketserver.TCPServer` i modulen :mod:`SocketServer <socketserver>` har nu stöd för timeouts för socket och inaktivering av Nagle-algoritmen. Klassattributet :attr:`!disable_nagle_algorithm` är som standard ``False``; om det åsidosätts till true kommer nya request-anslutningar att ha TCP_NODELAY-alternativet inställt för att förhindra buffring av många små sändningar i ett enda TCP-paket. Klassattributet :attr:`~socketserver.BaseServer.timeout` kan innehålla en timeout i sekunder som kommer att tillämpas på request socket; om ingen request tas emot inom den tiden kommer :meth:`~socketserver.BaseServer.handle_timeout` att anropas och :meth:`~socketserver.BaseServer.handle_request` kommer att returneras. (Bidrag från Kristján Valur Jónsson; :issue:`6192` och :issue:`6267`.)

source: Updated module: the :mod:`sqlite3` module has been updated to version 2.6.0 of the `pysqlite package <https://github.com/ghaering/pysqlite>`__. Version 2.6.0 includes a number of bugfixes, and adds the ability to load SQLite extensions from shared libraries. Call the ``enable_load_extension(True)`` method to enable extensions, and then call :meth:`~sqlite3.Connection.load_extension` to load a particular shared library. (Updated by Gerhard Häring.)
sv: Uppdaterad modul: Modulen :mod:`sqlite3` har uppdaterats till version 2.6.0 av `pysqlite-paketet <https://github.com/ghaering/pysqlite>`__. Version 2.6.0 innehåller ett antal buggfixar och ger möjlighet att ladda SQLite-tillägg från delade bibliotek. Anropa metoden ``enable_load_extension(True)`` för att aktivera tillägg, och anropa sedan :meth:`~sqlite3.Connection.load_extension` för att ladda ett visst delat bibliotek. (Uppdaterad av Gerhard Häring.)
