Repository: yeager/python-docs-sv
Catalog: whatsnew/2.7.po
Languages: sv

source: The new :mod:`ensurepip` module (defined in :pep:`453`) provides a standard cross-platform mechanism to bootstrap the pip installer into Python installations. The version of ``pip`` included with Python 2.7.9 is ``pip`` 1.5.6, and future 2.7.x maintenance releases will update the bundled version to the latest version of ``pip`` that is available at the time of creating the release candidate.
sv: Den nya modulen :mod:`ensurepip` (definierad i :pep:`453`) tillhandahåller en plattformsoberoende standardmekanism för att starta upp pip-installationsprogrammet i Python-installationer. Den version av ``pip`` som ingår i Python 2.7.9 är ``pip`` 1.5.6, och framtida underhållsutgåvor av 2.7.x kommer att uppdatera den medföljande versionen till den senaste versionen av ``pip`` som är tillgänglig vid tidpunkten för skapandet av utgivningskandidaten.

source: By default, the commands ``pip``, ``pipX`` and ``pipX.Y`` will be installed on all platforms (where X.Y stands for the version of the Python installation), along with the ``pip`` Python package and its dependencies.
sv: Som standard kommer kommandona ``pip``, ``pipX`` och ``pipX.Y`` att installeras på alla plattformar (där X.Y står för versionen av Python-installationen), tillsammans med Python-paketet ``pip`` och dess beroenden.

source: For CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, the ``make install`` and ``make altinstall`` commands do not bootstrap ``pip`` by default. This behaviour can be controlled through configure options, and overridden through Makefile options.
sv: För CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, bootstrappar inte kommandona ``make install`` och ``make altinstall`` ``pip`` som standard. Detta beteende kan kontrolleras genom configure-alternativ och åsidosättas genom Makefile-alternativ.

source: On Windows and Mac OS X, the CPython installers now default to installing ``pip`` along with CPython itself (users may opt out of installing it during the installation process). Window users will need to opt in to the automatic ``PATH`` modifications to have ``pip`` available from the command line by default, otherwise it can still be accessed through the Python launcher for Windows as ``py -m pip``.
sv: På Windows och Mac OS X installerar CPython-installatörerna nu som standard ``pip`` tillsammans med CPython själv (användare kan välja bort att installera det under installationsprocessen). Windows-användare måste välja de automatiska ``PATH``-ändringarna för att ``pip`` ska vara tillgängligt från kommandoraden som standard, annars kan det fortfarande nås via Python-startprogrammet för Windows som ``py -m pip``.

source: As :pep:`discussed in the PEP <0477#disabling-ensurepip-by-downstream-distributors>`, platform packagers may choose not to install these commands by default, as long as, when invoked, they provide clear and simple directions on how to install them on that platform (usually using the system package manager).
sv: Som :pep:`diskuteras i PEP <0477#disabling-ensurepip-by-downstream-distributors>`, kan plattformspaketörer välja att inte installera dessa kommandon som standard, så länge som de, när de anropas, ger tydliga och enkla anvisningar om hur de installeras på den plattformen (vanligtvis med hjälp av systempakethanteraren).

source: Documentation Changes
sv: Förändringar i dokumentation

source: As part of this change, the :ref:`installing-index` and :ref:`distributing-index` sections of the documentation have been completely redesigned as short getting started and FAQ documents. Most packaging documentation has now been moved out to the Python Packaging Authority maintained `Python Packaging User Guide <https://packaging.python.org>`__ and the documentation of the individual projects.
sv: Som en del av denna förändring har avsnitten :ref:`installing-index` och :ref:`distributing-index` i dokumentationen helt omarbetats till korta dokument om att komma igång och vanliga frågor. Den mesta förpackningsdokumentationen har nu flyttats ut till Python Packaging Authoritys underhållna `Python Packaging User Guide <https://packaging.python.org>`__ och dokumentationen för de enskilda projekten.

source: However, as this migration is currently still incomplete, the legacy versions of those guides remaining available as :ref:`install-index` and :ref:`setuptools-index`.
sv: Men eftersom den här migreringen för närvarande fortfarande är ofullständig, finns de äldre versionerna av dessa guider fortfarande tillgängliga som :ref:`install-index` och :ref:`setuptools-index`.

source: :pep:`453` -- Explicit bootstrapping of pip in Python installations
sv: :pep:`453` -- Explicit bootstrapping av pip i Python-installationer

source: PEP written by Donald Stufft and Nick Coghlan, implemented by Donald Stufft, Nick Coghlan, Martin von Löwis and Ned Deily.
sv: PEP skriven av Donald Stufft och Nick Coghlan, implementerad av Donald Stufft, Nick Coghlan, Martin von Löwis och Ned Deily.

source: PEP 476: Enabling certificate verification by default for stdlib http clients
sv: PEP 476: Aktivera certifikatverifiering som standard för stdlib http-klienter

source: :pep:`476` updated :mod:`httplib <http>` and modules which use it, such as :mod:`urllib2 <urllib.request>` and :mod:`xmlrpclib <xmlrpc.client>`, to now verify that the server presents a certificate which is signed by a Certificate Authority in the platform trust store and whose hostname matches the hostname being requested by default, significantly improving security for many applications. This change was made in the Python 2.7.9 release.
sv: :pep:`476` uppdaterade :mod:`httplib <http>` och moduler som använder det, såsom :mod:`urllib2 <urllib.request>` och :mod:`xmlrpclib <xmlrpc.client>`, för att nu verifiera att servern presenterar ett certifikat som är signerat av en certifikatutfärdare i plattformens trust store och vars värdnamn matchar värdnamnet som begärs som standard, vilket avsevärt förbättrar säkerheten för många applikationer. Den här ändringen gjordes i Python 2.7.9.

source: For applications which require the old previous behavior, they can pass an alternate context::
sv: För applikationer som kräver det gamla tidigare beteendet kan de skicka en alternativ context::

source: PEP 493: HTTPS verification migration tools for Python 2.7
sv: PEP 493: Verktyg för migrering av HTTPS-verifiering för Python 2.7

source: :pep:`493` provides additional migration tools to support a more incremental infrastructure upgrade process for environments containing applications and services relying on the historically permissive processing of server certificates when establishing client HTTPS connections. These additions were made in the Python 2.7.12 release.
sv: :pep:`493` tillhandahåller ytterligare migreringsverktyg för att stödja en mer stegvis uppgradering av infrastrukturen för miljöer som innehåller applikationer och tjänster som förlitar sig på den historiskt tillåtande behandlingen av servercertifikat vid upprättandet av HTTPS-anslutningar för klienter. Dessa tillägg gjordes i Python 2.7.12-versionen.

source: These tools are intended for use in cases where affected applications and services can't be modified to explicitly pass a more permissive SSL context when establishing the connection.
sv: Dessa verktyg är avsedda att användas i fall där berörda applikationer och tjänster inte kan modifieras för att uttryckligen skicka en mer tillåtande SSL-kontext när anslutningen upprättas.

source: For applications and services which can't be modified at all, the new ``PYTHONHTTPSVERIFY`` environment variable may be set to ``0`` to revert an entire Python process back to the default permissive behaviour of Python 2.7.8 and earlier.
sv: För applikationer och tjänster som inte kan ändras alls kan den nya miljövariabeln ``PYTHONHTTPSVERIFY`` sättas till ``0`` för att återställa en hel Python-process tillbaka till det tillåtna standardbeteendet i Python 2.7.8 och tidigare.

source: For cases where the connection establishment code can't be modified, but the overall application can be, the new :func:`!ssl._https_verify_certificates` function can be used to adjust the default behaviour at runtime.
sv: I de fall där koden för att upprätta anslutningen inte kan ändras, men den övergripande applikationen kan ändras, kan den nya funktionen :func:`!ssl._https_verify_certificates` användas för att justera standardbeteendet under körning.

source: New ``make regen-all`` build target
sv: Nytt byggmål för ``make regen-all``

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
sv: För att förenkla korskompilering och säkerställa att CPython kan kompileras på ett tillförlitligt sätt utan att det krävs att en befintlig version av Python redan finns tillgänglig, försöker det autotools-baserade byggsystemet inte längre att implicit kompilera om genererade filer baserat på filändringstider.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
sv: Istället har ett nytt ``make regen-all``-kommando lagts till för att tvinga fram regenerering av dessa filer när så önskas (t.ex. efter att en första version av Python redan har byggts baserat på de förgenererade versionerna).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
sv: Mer selektiva regenereringsmål definieras också - se :source:`Makefile.pre.in` för detaljer.

source: (Contributed by Victor Stinner in :issue:`23404`.)
sv: (Bidrag från Victor Stinner i :issue:`23404`.)

source: Removal of ``make touch`` build target
sv: Borttagning av byggmålet ``make touch``

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
sv: Byggmålet ``make touch`` som tidigare användes för att begära implicit regenerering av genererade filer genom att uppdatera deras modifieringstider har tagits bort.

source: It has been replaced by the new ``make regen-all`` target.
sv: Det har ersatts av det nya målet ``make regen-all``.

source: Acknowledgements
sv: Tack till

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Nick Coghlan, Philip Jenvey, Ryan Lovett, R. David Murray, Hugh Secker-Walker.
sv: Författaren vill tacka följande personer för förslag, korrigeringar och hjälp med olika utkast till denna artikel: Nick Coghlan, Philip Jenvey, Ryan Lovett, R. David Murray, Hugh Secker-Walker.
