Repository: yeager/python-docs-sv
Catalog: whatsnew/3.1.po
Languages: sv

source: (Suggested by Antoine Pitrou and Jesse Noller. Implemented by Jack Diederich; :issue:`5228`.)
sv: (Föreslagen av Antoine Pitrou och Jesse Noller. Implementerad av Jack Diederich; :issue:`5228`.)

source: Add :mod:`pydoc` help topics for symbols so that ``help('@')`` works as expected in the interactive environment.
sv: Lägg till :mod:`pydoc`-hjälpämnen för symboler så att ``help('@')`` fungerar som förväntat i den interaktiva miljön.

source: (Contributed by David Laban; :issue:`4739`.)
sv: (Bidrag från David Laban; :issue:`4739`.)

source: The :mod:`unittest` module now supports skipping individual tests or classes of tests. And it supports marking a test as an expected failure, a test that is known to be broken, but shouldn't be counted as a failure on a TestResult::
sv: Modulen :mod:`unittest` har nu stöd för att hoppa över enskilda tester eller klasser av tester. Den stöder även att markera ett test som ett förväntat misslyckande, ett test som man vet är trasigt, men som inte bör räknas som ett misslyckande i ett TestResult::

source: class TestGizmo(unittest.TestCase): @unittest.skipUnless(sys.platform.startswith("win"), "requires Windows") def test_gizmo_on_windows(self): ... @unittest.expectedFailure def test_gimzo_without_required_library(self): ...
sv: klass TestGizmo(unittest.TestCase): @unittest.skipUnless(sys.platform.startswith("win")), "kräver Windows") def test_gizmo_on_windows(self): ... @unittest.expectedFailure def test_gimzo_without_required_library(self): ...

source: Also, tests for exceptions have been builtout to work with context managers using the :keyword:`with` statement::
sv: Dessutom har tester för undantag byggts ut för att fungera med kontexthanterare som använder :keyword:`with` statement::

source: def test_division_by_zero(self): with self.assertRaises(ZeroDivisionError): x / 0
sv: def test_division_by_zero(self): med self.assertRaises(ZeroDivisionError): x / 0

source: In addition, several new assertion methods were added including :meth:`~unittest.TestCase.assertSetEqual`, :meth:`~unittest.TestCase.assertDictEqual`, :meth:`!assertDictContainsSubset`, :meth:`~unittest.TestCase.assertListEqual`, :meth:`~unittest.TestCase.assertTupleEqual`, :meth:`~unittest.TestCase.assertSequenceEqual`, :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>`, :meth:`~unittest.TestCase.assertIsNone`, and :meth:`~unittest.TestCase.assertIsNotNone`.
sv: Dessutom har flera nya assertionmetoder lagts till, inklusive :meth:`~unittest.TestCase.assertSetEqual`, :meth:`~unittest.TestCase.assertDictEqual`, :meth:`!assertDictContainsSubset`, :meth:`~unittest.TestCase.assertListEqual`, :meth:`~unittest.TestCase.assertTupleEqual`, :meth:`~unittest.TestCase.assertSequenceEqual`, :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>`, :meth:`~unittest.TestCase.assertIsNone`, och :meth:`~unittest.TestCase.assertIsNotNone`.

source: (Contributed by Benjamin Peterson and Antoine Pitrou.)
sv: (Bidrag från Benjamin Peterson och Antoine Pitrou.)

source: The :mod:`io` module has three new constants for the :meth:`~io.IOBase.seek` method: :data:`~os.SEEK_SET`, :data:`~os.SEEK_CUR`, and :data:`~os.SEEK_END`.
sv: Modulen :mod:`io` har tre nya konstanter för metoden :meth:`~io.IOBase.seek`: :data:`~os.SEEK_SET`, :data:`~os.SEEK_CUR` och :data:`~os.SEEK_END`.

source: The :data:`sys.version_info` tuple is now a named tuple::
sv: Tupeln :data:`sys.version_info` är nu en namngiven tupel::

source: (Contributed by Ross Light; :issue:`4285`.)
sv: (Bidrag från Ross Light; :issue:`4285`.)

source: The :mod:`!nntplib` and :mod:`imaplib` modules now support IPv6.
sv: Modulerna :mod:`!nntplib` och :mod:`imaplib` har nu stöd för IPv6.

source: (Contributed by Derek Morr; :issue:`1655` and :issue:`1664`.)
sv: (Bidrag från Derek Morr; :issue:`1655` och :issue:`1664`.)

source: The :mod:`pickle` module has been adapted for better interoperability with Python 2.x when used with protocol 2 or lower. The reorganization of the standard library changed the formal reference for many objects. For example, ``__builtin__.set`` in Python 2 is called ``builtins.set`` in Python 3. This change confounded efforts to share data between different versions of Python. But now when protocol 2 or lower is selected, the pickler will automatically use the old Python 2 names for both loading and dumping. This remapping is turned-on by default but can be disabled with the *fix_imports* option::
sv: Modulen :mod:`pickle` har anpassats för bättre interoperabilitet med Python 2.x när den används med protokoll 2 eller lägre. Omorganiseringen av standardbiblioteket ändrade den formella referensen för många objekt. Till exempel kallas ``__builtin__.set`` i Python 2 för ``builtins.set`` i Python 3. Denna förändring förvirrade ansträngningarna att dela data mellan olika versioner av Python. Men nu när protokoll 2 eller lägre väljs, kommer picklern automatiskt att använda de gamla Python 2-namnen för både laddning och dumpning. Denna remappning är aktiverad som standard men kan avaktiveras med alternativet *fix_imports*::

source: >>> s = {1, 2, 3} >>> pickle.dumps(s, protocol=0) b'c__builtin__\nset\np0\n((lp1\nL1L\naL2L\naL3L\natp2\nRp3\n.' >>> pickle.dumps(s, protocol=0, fix_imports=False) b'cbuiltins\nset\np0\n((lp1\nL1L\naL2L\naL3L\natp2\nRp3\n.'
sv: >>> s = {1, 2, 3} >>> pickle.dumps(s, protokoll=0) b'c__builtin__\nset\np0\n((lp1\nL1L\naL2L\naL3L\natp2\nRp3\n.' >>> pickle.dumps(s, protokoll=0, fix_imports=False) b'cbuiltins\nset\np0\n((lp1\nL1L\naL2L\naL3L\natp2\nRp3\n.'

source: An unfortunate but unavoidable side-effect of this change is that protocol 2 pickles produced by Python 3.1 won't be readable with Python 3.0. The latest pickle protocol, protocol 3, should be used when migrating data between Python 3.x implementations, as it doesn't attempt to remain compatible with Python 2.x.
sv: En olycklig men oundviklig bieffekt av denna förändring är att protokoll 2-pickles som produceras av Python 3.1 inte kommer att kunna läsas med Python 3.0. Det senaste pickle-protokollet, protokoll 3, bör användas vid migrering av data mellan Python 3.x-implementeringar, eftersom det inte försöker förbli kompatibelt med Python 2.x.

source: (Contributed by Alexandre Vassalotti and Antoine Pitrou, :issue:`6137`.)
sv: (Bidrag från Alexandre Vassalotti och Antoine Pitrou, :issue:`6137`.)

source: A new module, :mod:`importlib` was added. It provides a complete, portable, pure Python reference implementation of the :keyword:`import` statement and its counterpart, the :func:`__import__` function. It represents a substantial step forward in documenting and defining the actions that take place during imports.
sv: En ny modul, :mod:`importlib` har lagts till. Den ger en komplett, portabel, ren Python-referensimplementation av :keyword:`import`-satsen och dess motsvarighet, funktionen :func:`__import__`. Den utgör ett stort steg framåt när det gäller att dokumentera och definiera de åtgärder som vidtas under import.

source: (Contributed by Brett Cannon.)
sv: (Bidrag från Brett Cannon.)

source: Optimizations
sv: Optimeringar

source: Major performance enhancements have been added:
sv: Stora prestandaförbättringar har lagts till:

source: The new I/O library (as defined in :pep:`3116`) was mostly written in Python and quickly proved to be a problematic bottleneck in Python 3.0. In Python 3.1, the I/O library has been entirely rewritten in C and is 2 to 20 times faster depending on the task at hand. The pure Python version is still available for experimentation purposes through the ``_pyio`` module.
sv: Det nya I/O-biblioteket (enligt definitionen i :pep:`3116`) var till största delen skrivet i Python och visade sig snabbt vara en problematisk flaskhals i Python 3.0. I Python 3.1 har I/O-biblioteket skrivits om helt och hållet i C och är 2 till 20 gånger snabbare beroende på vilken uppgift som ska utföras. Den rena Python-versionen är fortfarande tillgänglig för experimentändamål genom modulen ``_pyio``.

source: (Contributed by Amaury Forgeot d'Arc and Antoine Pitrou.)
sv: (Bidrag från Amaury Forgeot d'Arc och Antoine Pitrou.)

source: Added a heuristic so that tuples and dicts containing only untrackable objects are not tracked by the garbage collector. This can reduce the size of collections and therefore the garbage collection overhead on long-running programs, depending on their particular use of datatypes.
sv: Lagt till en heuristik som gör att tuples och dicts som bara innehåller objekt som inte kan spåras inte spåras av skräpsamlaren. Detta kan minska storleken på samlingarna och därmed sopinsamlingens overhead i långkörande program, beroende på hur datatyperna används.

source: (Contributed by Antoine Pitrou, :issue:`4688`.)
sv: (Bidrag från Antoine Pitrou, :issue:`4688`.)

source: Enabling a configure option named ``--with-computed-gotos`` on compilers that support it (notably: gcc, SunPro, icc), the bytecode evaluation loop is compiled with a new dispatch mechanism which gives speedups of up to 20%, depending on the system, the compiler, and the benchmark.
sv: Genom att aktivera ett konfigurationsalternativ med namnet ``--with-computed-gotos`` på kompilatorer som stöder det (särskilt: gcc, SunPro, icc), kompileras bytecode-utvärderingsslingan med en ny dispatchmekanism som ger hastigheter på upp till 20%, beroende på system, kompilator och benchmark.

source: (Contributed by Antoine Pitrou along with a number of other participants, :issue:`4753`).
sv: (Bidrag från Antoine Pitrou tillsammans med ett antal andra deltagare, :issue:`4753`).

source: The decoding of UTF-8, UTF-16 and LATIN-1 is now two to four times faster.
sv: Avkodningen av UTF-8, UTF-16 och LATIN-1 är nu två till fyra gånger snabbare.

source: (Contributed by Antoine Pitrou and Amaury Forgeot d'Arc, :issue:`4868`.)
sv: (Bidrag från Antoine Pitrou och Amaury Forgeot d'Arc, :issue:`4868`.)

source: The :mod:`json` module now has a C extension to substantially improve its performance. In addition, the API was modified so that json works only with :class:`str`, not with :class:`bytes`. That change makes the module closely match the `JSON specification <https://json.org/>`_ which is defined in terms of Unicode.
sv: Modulen :mod:`json` har nu ett C-tillägg som avsevärt förbättrar dess prestanda. Dessutom har API:et modifierats så att json endast fungerar med :class:`str`, inte med :class:`bytes`. Denna förändring gör att modulen nära matchar `JSON-specifikationen <https://json.org/>`_ som definieras i termer av Unicode.

source: (Contributed by Bob Ippolito and converted to Py3.1 by Antoine Pitrou and Benjamin Peterson; :issue:`4136`.)
sv: (Bidrag från Bob Ippolito och konverterad till Py3.1 av Antoine Pitrou och Benjamin Peterson; :issue:`4136`.)

source: Unpickling now interns the attribute names of pickled objects. This saves memory and allows pickles to be smaller.
sv: Unpickling internerar nu attributnamnen för picklade objekt. Detta sparar minne och gör att pickles kan vara mindre.

source: (Contributed by Jake McGuire and Antoine Pitrou; :issue:`5084`.)
sv: (Bidrag från Jake McGuire och Antoine Pitrou; :issue:`5084`.)

source: IDLE's format menu now provides an option to strip trailing whitespace from a source file.
sv: IDLE:s formatmeny innehåller nu ett alternativ för att ta bort efterföljande blanksteg från en källfil.

source: (Contributed by Roger D. Serwy; :issue:`5150`.)
sv: (Bidrag från Roger D. Serwy; :issue:`5150`.)

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Changes to Python's build process and to the C API include:
sv: Ändringar i Pythons byggprocess och i C API inkluderar:

source: Integers are now stored internally either in base ``2**15`` or in base ``2**30``, the base being determined at build time. Previously, they were always stored in base ``2**15``. Using base ``2**30`` gives significant performance improvements on 64-bit machines, but benchmark results on 32-bit machines have been mixed. Therefore, the default is to use base ``2**30`` on 64-bit machines and base ``2**15`` on 32-bit machines; on Unix, there's a new configure option ``--enable-big-digits`` that can be used to override this default.
sv: Heltal lagras nu internt antingen i basen ``2**15`` eller i basen ``2**30``, basen bestäms vid byggtiden. Tidigare lagrades de alltid i bas ``2**15``. Att använda bas ``2**30`` ger betydande prestandaförbättringar på 64-bitars maskiner, men benchmarkresultaten på 32-bitars maskiner har varit blandade. Därför är standardinställningen att använda bas ``2**30`` på 64-bitars maskiner och bas ``2**15`` på 32-bitars maskiner; på Unix finns det ett nytt configure-alternativ ``--enable-big-digits`` som kan användas för att åsidosätta denna standardinställning.

source: Apart from the performance improvements this change should be invisible to end users, with one exception: for testing and debugging purposes there's a new :data:`sys.int_info` that provides information about the internal format, giving the number of bits per digit and the size in bytes of the C type used to store each digit::
sv: Bortsett från prestandaförbättringarna bör denna ändring vara osynlig för slutanvändarna, med ett undantag: för test- och felsökningsändamål finns det en ny :data:`sys.int_info` som ger information om det interna formatet, med antalet bitar per siffra och storleken i byte på den C-typ som används för att lagra varje siffra::

source: (Contributed by Mark Dickinson; :issue:`4258`.)
sv: (Bidrag från Mark Dickinson; :issue:`4258`.)

source: The :c:func:`PyLong_AsUnsignedLongLong()` function now handles a negative *pylong* by raising :exc:`OverflowError` instead of :exc:`TypeError`.
sv: Funktionen :c:func:`PyLong_AsUnsignedLongLong()` hanterar nu en negativ *pylong* genom att ge :exc:`OverflowError` istället för :exc:`TypeError`.

source: (Contributed by Mark Dickinson and Lisandro Dalcrin; :issue:`5175`.)
sv: (Bidrag från Mark Dickinson och Lisandro Dalcrin; :issue:`5175`.)

source: Deprecated :c:func:`!PyNumber_Int`. Use :c:func:`PyNumber_Long` instead.
sv: Föråldrad :c:func:`!PyNumber_Int`. Använd :c:func:`PyNumber_Long` istället.

source: (Contributed by Mark Dickinson; :issue:`4910`.)
sv: (Bidrag från Mark Dickinson; :issue:`4910`.)

source: Added a new :c:func:`PyOS_string_to_double` function to replace the deprecated functions :c:func:`!PyOS_ascii_strtod` and :c:func:`!PyOS_ascii_atof`.
sv: Lagt till en ny :c:func:`PyOS_string_to_double`-funktion för att ersätta de föråldrade funktionerna :c:func:`!PyOS_ascii_strtod` och :c:func:`!PyOS_ascii_atof`.

source: (Contributed by Mark Dickinson; :issue:`5914`.)
sv: (Bidrag från Mark Dickinson; :issue:`5914`.)

source: Added :c:type:`PyCapsule` as a replacement for the :c:type:`!PyCObject` API. The principal difference is that the new type has a well defined interface for passing typing safety information and a less complicated signature for calling a destructor. The old type had a problematic API and is now deprecated.
sv: Lagt till :c:type:`PyCapsule` som en ersättning för :c:type:`!PyCObject` API. Den huvudsakliga skillnaden är att den nya typen har ett väldefinierat gränssnitt för att skicka information om typningssäkerhet och en mindre komplicerad signatur för att anropa en destruktor. Den gamla typen hade ett problematiskt API och är nu föråldrad.

source: (Contributed by Larry Hastings; :issue:`5630`.)
sv: (Bidrag från Larry Hastings; :issue:`5630`.)

source: Porting to Python 3.1
sv: Portning till Python 3.1

source: This section lists previously described changes and other bugfixes that may require changes to your code:
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod:

source: The new floating-point string representations can break existing doctests. For example::
sv: De nya representationerna av strängar med flyttal kan bryta befintliga doctests. Till exempel::

source: def e(): '''Compute the base of natural logarithms. >>> e() 2.7182818284590451 ''' return sum(1/math.factorial(x) for x in reversed(range(30))) doctest.testmod() ********************************************************************** Failed example: e() Expected: 2.7182818284590451 Got: 2.718281828459045 **********************************************************************
sv: def e(): '''Beräkna basen för naturliga logaritmer. >>> e() 2.7182818284590451 ''' return sum(1/math.factorial(x) for x in reversed(range(30)))) doctest.testmod() ********************************************************************** Misslyckat exempel: e() Förväntad: 2.7182818284590451 Fick: 2.718281828459045 **********************************************************************

source: The automatic name remapping in the pickle module for protocol 2 or lower can make Python 3.1 pickles unreadable in Python 3.0. One solution is to use protocol 3. Another solution is to set the *fix_imports* option to ``False``. See the discussion above for more details.
sv: Den automatiska namnomvandlingen i pickle-modulen för protokoll 2 eller lägre kan göra Python 3.1-pickles oläsliga i Python 3.0. En lösning är att använda protokoll 3. En annan lösning är att sätta alternativet *fix_imports* till ``False``. Se diskussionen ovan för mer information.
