Repository: yeager/python-docs-sv
Catalog: whatsnew/3.1.po
Languages: sv

source: What's New In Python 3.1
sv: Vad är nytt i Python 3.1

source: Author
sv: Författare

source: This article explains the new features in Python 3.1, compared to 3.0. Python 3.1 was released on June 27, 2009.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.1 jämfört med 3.0. Python 3.1 släpptes den 27 juni 2009.

source: PEP 372: Ordered Dictionaries
sv: PEP 372: Ordnade ordböcker

source: Regular Python dictionaries iterate over key/value pairs in arbitrary order. Over the years, a number of authors have written alternative implementations that remember the order that the keys were originally inserted. Based on the experiences from those implementations, a new :class:`collections.OrderedDict` class has been introduced.
sv: Vanliga Python-ordböcker itererar över nyckel/värde-par i godtycklig ordning. Under årens lopp har ett antal författare skrivit alternativa implementationer som kommer ihåg den ordning som nycklarna ursprungligen infogades. Baserat på erfarenheterna från dessa implementationer har en ny :class:`collections.OrderedDict`-klass introducerats.

source: The OrderedDict API is substantially the same as regular dictionaries but will iterate over keys and values in a guaranteed order depending on when a key was first inserted. If a new entry overwrites an existing entry, the original insertion position is left unchanged. Deleting an entry and reinserting it will move it to the end.
sv: OrderedDict API är i stort sett detsamma som vanliga ordböcker men kommer att iterera över nycklar och värden i en garanterad ordning beroende på när en nyckel först infogades. Om en ny post skriver över en befintlig post lämnas den ursprungliga inmatningspositionen oförändrad. Om du tar bort en post och lägger in den igen flyttas den till slutet.

source: The standard library now supports use of ordered dictionaries in several modules. The :mod:`configparser` module uses them by default. This lets configuration files be read, modified, and then written back in their original order. The *_asdict()* method for :func:`collections.namedtuple` now returns an ordered dictionary with the values appearing in the same order as the underlying tuple indices. The :mod:`json` module is being built-out with an *object_pairs_hook* to allow OrderedDicts to be built by the decoder. Support was also added for third-party tools like `PyYAML <https://pyyaml.org/>`_.
sv: Standardbiblioteket stöder nu användning av ordnade lexikon i flera moduler. Modulen :mod:`configparser` använder dem som standard. Detta gör att konfigurationsfiler kan läsas, ändras och sedan skrivas tillbaka i sin ursprungliga ordning. Metoden *_asdict()* för :func:`collections.namedtuple` returnerar nu en ordnad ordbok där värdena visas i samma ordning som de underliggande tuple-indexen. Modulen :mod:`json` håller på att byggas ut med en *object_pairs_hook* för att OrderedDicts ska kunna byggas av avkodaren. Stöd har även lagts till för tredjepartsverktyg som `PyYAML <https://pyyaml.org/>`_.

source: :pep:`372` - Ordered Dictionaries
sv: :pep:`372` - Ordnade ordböcker

source: PEP written by Armin Ronacher and Raymond Hettinger. Implementation written by Raymond Hettinger.
sv: PEP skriven av Armin Ronacher och Raymond Hettinger. Implementation skriven av Raymond Hettinger.

source: Since an ordered dictionary remembers its insertion order, it can be used in conjunction with sorting to make a sorted dictionary::
sv: Eftersom en ordnad ordbok kommer ihåg sin inmatningsordning kan den användas tillsammans med sortering för att skapa en sorterad ordbok::

source: >>> # regular unsorted dictionary >>> d = {'banana': 3, 'apple':4, 'pear': 1, 'orange': 2} >>> # dictionary sorted by key >>> OrderedDict(sorted(d.items(), key=lambda t: t[0])) OrderedDict([('apple', 4), ('banana', 3), ('orange', 2), ('pear', 1)]) >>> # dictionary sorted by value >>> OrderedDict(sorted(d.items(), key=lambda t: t[1])) OrderedDict([('pear', 1), ('orange', 2), ('banana', 3), ('apple', 4)]) >>> # dictionary sorted by length of the key string >>> OrderedDict(sorted(d.items(), key=lambda t: len(t[0]))) OrderedDict([('pear', 1), ('apple', 4), ('orange', 2), ('banana', 3)])
sv: >>> # vanlig osorterad ordbok >>> d = {'banan': 3, 'äpple':4, 'päron': 1, 'apelsin': 2} >>> # ordbok sorterad efter nyckel >>> OrderedDict(sorted(d.items(), key=lambda t: t[0])) OrderedDict([('apple', 4), ('banana', 3), ('orange', 2), ('pear', 1)]) >>> # ordbok sorterad efter värde >>> OrderedDict(sorted(d.items(), key=lambda t: t[1])) OrderedDict([('päron', 1), ('apelsin', 2), ('banan', 3), ('äpple', 4)]) >>> # ordbok sorterad efter nyckelsträngens längd >>> OrderedDict(sorted(d.items(), key=lambda t: len(t[0]))) OrderedDict([('päron', 1), ('äpple', 4), ('apelsin', 2), ('banan', 3)])

source: The new sorted dictionaries maintain their sort order when entries are deleted. But when new keys are added, the keys are appended to the end and the sort is not maintained.
sv: De nya sorterade lexikonen behåller sin sorteringsordning när poster raderas. Men när nya nycklar läggs till, läggs nycklarna till i slutet och sorteringen bibehålls inte.

source: PEP 378: Format Specifier for Thousands Separator
sv: PEP 378: Formatspecifikator för tusentalsavgränsare

source: The built-in :func:`format` function and the :meth:`str.format` method use a mini-language that now includes a simple, non-locale aware way to format a number with a thousands separator. That provides a way to humanize a program's output, improving its professional appearance and readability::
sv: Den inbyggda funktionen :func:`format` och metoden :meth:`str.format` använder ett minispråk som nu innehåller ett enkelt, icke-lokalanpassat sätt att formatera ett tal med en tusentalsavgränsare. Det ger ett sätt att humanisera ett programs utdata, förbättra dess professionella utseende och läsbarhet::

source: The supported types are :class:`int`, :class:`float`, :class:`complex` and :class:`decimal.Decimal`.
sv: De typer som stöds är :class:`int`, :class:`float`, :class:`complex` och :class:`decimal.decimal`.

source: Discussions are underway about how to specify alternative separators like dots, spaces, apostrophes, or underscores. Locale-aware applications should use the existing *n* format specifier which already has some support for thousands separators.
sv: Diskussioner pågår om hur man ska ange alternativa avgränsare som punkter, mellanslag, apostrofer eller understrykningstecken. Lokalt anpassade program bör använda den befintliga formatspecificeraren *n* som redan har visst stöd för tusentals separatorer.

source: :pep:`378` - Format Specifier for Thousands Separator
sv: :pep:`378` - Formatspecifikator för tusentalsavgränsare

source: PEP written by Raymond Hettinger and implemented by Eric Smith and Mark Dickinson.
sv: PEP skriven av Raymond Hettinger och implementerad av Eric Smith och Mark Dickinson.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:

source: Directories and zip archives containing a :file:`__main__.py` file can now be executed directly by passing their name to the interpreter. The directory/zipfile is automatically inserted as the first entry in sys.path. (Suggestion and initial patch by Andy Chu; revised patch by Phillip J. Eby and Nick Coghlan; :issue:`1739468`.)
sv: Kataloger och zip-arkiv som innehåller en :file:`__main__.py`-fil kan nu exekveras direkt genom att namnet anges till tolken. Katalogen/zipfilen infogas automatiskt som den första posten i sys.path. (Förslag och ursprunglig patch av Andy Chu; reviderad patch av Phillip J. Eby och Nick Coghlan; :issue:`1739468`.)

source: The :func:`int` type gained a ``bit_length`` method that returns the number of bits necessary to represent its argument in binary::
sv: Typen :func:`int` har en metod ``bit_length`` som returnerar det antal bitar som krävs för att representera argumentet i binärformat:

source: >>> n = 37 >>> bin(37) '0b100101' >>> n.bit_length() 6 >>> n = 2**123-1 >>> n.bit_length() 123 >>> (n+1).bit_length() 124
sv: >>> n = 37 >>> bin(37) '0b100101' >>> n.bit_längd() 6 >>> n = 2**123-1 >>> n.bit_längd() 123 >>> (n+1).bit_längd() 124

source: (Contributed by Fredrik Johansson, Victor Stinner, Raymond Hettinger, and Mark Dickinson; :issue:`3439`.)
sv: (Bidrag från Fredrik Johansson, Victor Stinner, Raymond Hettinger och Mark Dickinson; :issue:`3439`.)

source: The fields in :func:`format` strings can now be automatically numbered::
sv: Fälten i :func:`format`-strängar kan nu numreras automatiskt::

source: >>> 'Sir {} of {}'.format('Gallahad', 'Camelot') 'Sir Gallahad of Camelot'
sv: >>> 'Sir {} av {}'.format('Gallahad', 'Camelot') "Sir Gallahad av Camelot

source: Formerly, the string would have required numbered fields such as: ``'Sir {0} of {1}'``.
sv: Tidigare skulle strängen ha krävt numrerade fält som t.ex: ``'Sir {0} av {1}'``.

source: (Contributed by Eric Smith; :issue:`5237`.)
sv: (Bidrag från Eric Smith; :issue:`5237`.)

source: The :func:`!string.maketrans` function is deprecated and is replaced by new static methods, :meth:`bytes.maketrans` and :meth:`bytearray.maketrans`. This change solves the confusion around which types were supported by the :mod:`string` module. Now, :class:`str`, :class:`bytes`, and :class:`bytearray` each have their own **maketrans** and **translate** methods with intermediate translation tables of the appropriate type.
sv: Funktionen :func:`!string.maketrans` är utdaterad och ersätts av nya statiska metoder, :meth:`bytes.maketrans` och :meth:`bytearray.maketrans`. Den här ändringen löser förvirringen kring vilka typer som stöds av modulen :mod:`string`. Nu har :class:`str`, :class:`bytes` och :class:`bytearray` var och en sina egna **maketrans**- och **translate**-metoder med mellanliggande översättningstabeller av lämplig typ.

source: (Contributed by Georg Brandl; :issue:`5675`.)
sv: (Bidrag från Georg Brandl; :issue:`5675`.)

source: The syntax of the :keyword:`with` statement now allows multiple context managers in a single statement::
sv: Syntaxen för :keyword:`with`-satsen tillåter nu flera kontexthanterare i en enda sats::

source: >>> with open('mylog.txt') as infile, open('a.out', 'w') as outfile: ... for line in infile: ... if '<critical>' in line: ... outfile.write(line)
sv: &gt;&gt;&gt; med open('mylog.txt') som infile, open('a.out', 'w') som outfile: ... för rad i infile: ... if '<critical>' i rad: ... outfile.write(rad)

source: With the new syntax, the :func:`!contextlib.nested` function is no longer needed and is now deprecated.
sv: Med den nya syntaxen behövs inte längre funktionen :func:`!contextlib.nested` och den är nu föråldrad.

source: (Contributed by Georg Brandl and Mattias Brändström; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)
sv: (Bidrag från Georg Brandl och Mattias Brändström; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)

source: ``round(x, n)`` now returns an integer if *x* is an integer. Previously it returned a float::
sv: ``round(x, n)`` returnerar nu ett heltal om *x* är ett heltal. Tidigare returnerade den en float::

source: >>> round(1123, -2) 1100
sv: >>> runda(1123, -2) 1100

source: (Contributed by Mark Dickinson; :issue:`4707`.)
sv: (Bidrag från Mark Dickinson; :issue:`4707`.)

source: Python now uses David Gay's algorithm for finding the shortest floating-point representation that doesn't change its value. This should help mitigate some of the confusion surrounding binary floating-point numbers.
sv: Python använder nu David Gays algoritm för att hitta den kortaste representationen av flyttal som inte ändrar sitt värde. Detta bör bidra till att mildra en del av förvirringen kring binära flyttal.

source: The significance is easily seen with a number like ``1.1`` which does not have an exact equivalent in binary floating point. Since there is no exact equivalent, an expression like ``float('1.1')`` evaluates to the nearest representable value which is ``0x1.199999999999ap+0`` in hex or ``1.100000000000000088817841970012523233890533447265625`` in decimal. That nearest value was and still is used in subsequent floating-point calculations.
sv: Betydelsen är lätt att se med ett tal som ``1,1`` som inte har någon exakt motsvarighet i binär flyttal. Eftersom det inte finns någon exakt motsvarighet utvärderas ett uttryck som ``float('1.1')`` till det närmaste representerbara värdet, vilket är ``0x1.199999999999ap+0`` i hex eller ``1.100000000000000088817841970012523233890533447265625`` i decimal. Det närmaste värdet användes och används fortfarande i efterföljande beräkningar med flyttal.

source: What is new is how the number gets displayed. Formerly, Python used a simple approach. The value of ``repr(1.1)`` was computed as ``format(1.1, '.17g')`` which evaluated to ``'1.1000000000000001'``. The advantage of using 17 digits was that it relied on IEEE-754 guarantees to assure that ``eval(repr(1.1))`` would round-trip exactly to its original value. The disadvantage is that many people found the output to be confusing (mistaking intrinsic limitations of binary floating-point representation as being a problem with Python itself).
sv: Det som är nytt är hur numret visas. Tidigare använde Python ett enkelt tillvägagångssätt. Värdet av ``repr(1.1)`` beräknades som ``format(1.1, '.17g')`` vilket utvärderades till ``'1.1000000000000001'``. Fördelen med att använda 17 siffror var att den förlitade sig på IEEE-754-garantier för att säkerställa att ``eval(repr(1.1))`` skulle avrundas exakt till sitt ursprungliga värde. Nackdelen är att många tyckte att resultatet var förvirrande (och misstog de inneboende begränsningarna i binär representation av flyttal som ett problem med Python självt).

source: The new algorithm for ``repr(1.1)`` is smarter and returns ``'1.1'``. Effectively, it searches all equivalent string representations (ones that get stored with the same underlying float value) and returns the shortest representation.
sv: Den nya algoritmen för ``repr(1.1)`` är smartare och returnerar ``'1.1'``. I själva verket söker den efter alla likvärdiga strängrepresentationer (de som lagras med samma underliggande flottörvärde) och returnerar den kortaste representationen.

source: The new algorithm tends to emit cleaner representations when possible, but it does not change the underlying values. So, it is still the case that ``1.1 + 2.2 != 3.3`` even though the representations may suggest otherwise.
sv: Den nya algoritmen tenderar att ge renare representationer när det är möjligt, men den ändrar inte de underliggande värdena. Så det är fortfarande så att ``1,1 + 2,2 != 3,3`` även om representationerna kan antyda något annat.

source: The new algorithm depends on certain features in the underlying floating-point implementation. If the required features are not found, the old algorithm will continue to be used. Also, the text pickle protocols assure cross-platform portability by using the old algorithm.
sv: Den nya algoritmen är beroende av vissa funktioner i den underliggande implementeringen av flyttal. Om de nödvändiga funktionerna inte finns kommer den gamla algoritmen att fortsätta att användas. Dessutom säkerställer text pickle-protokollen portabilitet mellan plattformar genom att använda den gamla algoritmen.

source: (Contributed by Eric Smith and Mark Dickinson; :issue:`1580`)
sv: (Bidrag från Eric Smith och Mark Dickinson; :issue:`1580`)

source: New, Improved, and Deprecated Modules
sv: Nya, förbättrade och utfasade moduler

source: Added a :class:`collections.Counter` class to support convenient counting of unique items in a sequence or iterable::
sv: Lagt till en :class:`collections.Counter`-klass för att stödja bekväm räkning av unika objekt i en sekvens eller iterabel::

source: >>> Counter(['red', 'blue', 'red', 'green', 'blue', 'blue']) Counter({'blue': 3, 'red': 2, 'green': 1})
sv: >>> Counter(['röd', 'blå', 'röd', 'grön', 'blå', 'blå']) Räknare({'blå': 3, 'röd': 2, 'grön': 1})

source: (Contributed by Raymond Hettinger; :issue:`1696199`.)
sv: (Bidrag från Raymond Hettinger; :issue:`1696199`.)

source: Added a new module, :mod:`tkinter.ttk` for access to the Tk themed widget set. The basic idea of ttk is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
sv: Lagt till en ny modul, :mod:`tkinter.ttk` för åtkomst till Tk:s tematiska widgetuppsättning. Grundtanken med ttk är att i möjligaste mån separera koden som implementerar en widgets beteende från koden som implementerar dess utseende.

source: (Contributed by Guilherme Polo; :issue:`2983`.)
sv: (Bidrag från Guilherme Polo; :issue:`2983`.)

source: The :class:`gzip.GzipFile` and :class:`bz2.BZ2File` classes now support the context management protocol::
sv: Klasserna :class:`gzip.GzipFile` och :class:`bz2.BZ2File` har nu stöd för kontexthanteringsprotokollet::

source: >>> # Automatically close file after writing >>> with gzip.GzipFile(filename, "wb") as f: ... f.write(b"xxx")
sv: >>> # Stäng filen automatiskt efter skrivning >>> med gzip.GzipFile(filnamn, "wb") som f: ... f.write(b"xxx")

source: (Contributed by Antoine Pitrou.)
sv: (Bidrag från Antoine Pitrou.)

source: The :mod:`decimal` module now supports methods for creating a decimal object from a binary :class:`float`. The conversion is exact but can sometimes be surprising::
sv: Modulen :mod:`decimal` stöder nu metoder för att skapa ett decimalobjekt från ett binärt :class:`float`. Konverteringen är exakt men kan ibland vara överraskande::

source: The long decimal result shows the actual binary fraction being stored for *1.1*. The fraction has many digits because *1.1* cannot be exactly represented in binary.
sv: Det långa decimalresultatet visar det faktiska binära bråket som lagras för *1,1*. Bråket har många siffror eftersom *1,1* inte kan representeras exakt i binär form.

source: (Contributed by Raymond Hettinger and Mark Dickinson.)
sv: (Bidrag från Raymond Hettinger och Mark Dickinson.)

source: The :mod:`itertools` module grew two new functions. The :func:`itertools.combinations_with_replacement` function is one of four for generating combinatorics including permutations and Cartesian products. The :func:`itertools.compress` function mimics its namesake from APL. Also, the existing :func:`itertools.count` function now has an optional *step* argument and can accept any type of counting sequence including :class:`fractions.Fraction` and :class:`decimal.Decimal`::
sv: Modulen :mod:`itertools` har utökats med två nya funktioner. Funktionen :func:`itertools.combinations_with_replacement` är en av fyra funktioner för att generera kombinatorik, inklusive permutationer och kartesiska produkter. Funktionen :func:`itertools.compress` efterliknar sin namne från APL. Dessutom har den befintliga funktionen :func:`itertools.count` nu ett valfritt *step*-argument och kan acceptera alla typer av räknesekvenser, inklusive :class:`fractions.Fraction` och :class:`decimal.Decimal`:

source: >>> [p+q for p,q in combinations_with_replacement('LOVE', 2)] ['LL', 'LO', 'LV', 'LE', 'OO', 'OV', 'OE', 'VV', 'VE', 'EE'] >>> list(compress(data=range(10), selectors=[0,0,1,1,0,1,0,1,0,0])) [2, 3, 5, 7] >>> c = count(start=Fraction(1,2), step=Fraction(1,6)) >>> [next(c), next(c), next(c), next(c)] [Fraction(1, 2), Fraction(2, 3), Fraction(5, 6), Fraction(1, 1)]
sv: >>> [p+q for p,q in combinations_with_replacement('LOVE', 2)] ['LL', 'LO', 'LV', 'LE', 'OO', 'OV', 'OE', 'VV', 'VE', 'EE'] >>> list(compress(data=intervall(10), väljare=[0,0,1,1,0,1,0,0,1,0,0])) [2, 3, 5, 7] >>> c = count(start=Fraktion(1,2), steg=Fraktion(1,6)) >>> [nästa(c), nästa(c), nästa(c), nästa(c)] [Fraktion(1, 2), Fraktion(2, 3), Fraktion(5, 6), Fraktion(1, 1)]

source: (Contributed by Raymond Hettinger.)
sv: (Bidrag från Raymond Hettinger.)

source: :func:`collections.namedtuple` now supports a keyword argument *rename* which lets invalid fieldnames be automatically converted to positional names in the form _0, _1, etc. This is useful when the field names are being created by an external source such as a CSV header, SQL field list, or user input::
sv: :func:`collections.namedtuple` har nu stöd för ett nyckelordsargument *rename* som gör att ogiltiga fältnamn automatiskt kan konverteras till positionsnamn i formen _0, _1, etc. Detta är användbart när fältnamnen skapas av en extern källa, t.ex. ett CSV-huvud, en SQL-fältlista eller användarinmatning:

source: >>> query = input() SELECT region, dept, count(*) FROM main GROUPBY region, dept >>> cursor.execute(query) >>> query_fields = [desc[0] for desc in cursor.description] >>> UserQuery = namedtuple('UserQuery', query_fields, rename=True) >>> pprint.pprint([UserQuery(*row) for row in cursor]) [UserQuery(region='South', dept='Shipping', _2=185), UserQuery(region='North', dept='Accounting', _2=37), UserQuery(region='West', dept='Sales', _2=419)]
sv: >>> query = input() SELECT region, dept, count(*) FROM main GROUPBY region, dept >>> cursor.execute(fråga) >>> query_fields = [desc[0] för desc i cursor.description] >>> UserQuery = namedtuple('UserQuery', query_fields, rename=True) >>> pprint.pprint([UserQuery(*row) for row in cursor]) [UserQuery(region='South', dept='Shipping', _2=185), UserQuery(region='North', dept='Accounting', _2=37), UserQuery(region='West', avdelning='Försäljning', _2=419)]

source: (Contributed by Raymond Hettinger; :issue:`1818`.)
sv: (Bidrag från Raymond Hettinger; :issue:`1818`.)

source: The :func:`re.sub`, :func:`re.subn` and :func:`re.split` functions now accept a flags parameter.
sv: Funktionerna :func:`re.sub`, :func:`re.subn` och :func:`re.split` accepterar nu en flags parameter.

source: (Contributed by Gregory Smith.)
sv: (Bidrag från Gregory Smith.)

source: The :mod:`logging` module now implements a simple :class:`logging.NullHandler` class for applications that are not using logging but are calling library code that does. Setting-up a null handler will suppress spurious warnings such as "No handlers could be found for logger foo"::
sv: Modulen :mod:`logging` implementerar nu en enkel klass :class:`logging.NullHandler` för applikationer som inte använder loggning men som anropar bibliotekskod som gör det. Genom att konfigurera en null-hanterare kan man undvika onödiga varningar som "Inga hanterare kunde hittas för logger foo"::

source: >>> h = logging.NullHandler() >>> logging.getLogger("foo").addHandler(h)
sv: >>> h = loggning.NullHandler() >>> logging.getLogger("foo").addHandler(h)

source: (Contributed by Vinay Sajip; :issue:`4384`).
sv: (Bidrag från Vinay Sajip; :issue:`4384`).

source: The :mod:`runpy` module which supports the ``-m`` command line switch now supports the execution of packages by looking for and executing a ``__main__`` submodule when a package name is supplied.
sv: Modulen :mod:`runpy`, som stöder kommandoradsväxeln ``-m``, stöder nu exekvering av paket genom att leta efter och exekvera en ``__main__``-undermodul när ett paketnamn anges.

source: (Contributed by Andi Vajda; :issue:`4195`.)
sv: (Bidrag från Andi Vajda; :issue:`4195`.)

source: The :mod:`pdb` module can now access and display source code loaded via :mod:`zipimport` (or any other conformant :pep:`302` loader).
sv: Modulen :mod:`pdb` kan nu komma åt och visa källkod som laddats via :mod:`zipimport` (eller någon annan kompatibel :pep:`302`-laddare).

source: (Contributed by Alexander Belopolsky; :issue:`4201`.)
sv: (Bidrag från Alexander Belopolsky; :issue:`4201`.)

source: :class:`functools.partial` objects can now be pickled.
sv: :class:`functools.partial`-objekt kan nu picklas.
