Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: (Contributed by Yurii Karabas in :issue:`42345`.)
sv: (Bidrag från Yurii Karabas i :issue:`42345`.)

source: Add new function :func:`typing.is_typeddict` to introspect if an annotation is a :class:`typing.TypedDict`. (Contributed by Patrick Reader in :issue:`41792`.)
sv: Lägg till ny funktion :func:`typing.is_typeddict` för att introspektera om en annotering är en :class:`typing.TypedDict`. (Bidrag från Patrick Reader i :issue:`41792`.)

source: Subclasses of ``typing.Protocol`` which only have data variables declared will now raise a ``TypeError`` when checked with ``isinstance`` unless they are decorated with :func:`~typing.runtime_checkable`. Previously, these checks passed silently. Users should decorate their subclasses with the :func:`!runtime_checkable` decorator if they want runtime protocols. (Contributed by Yurii Karabas in :issue:`38908`.)
sv: Subklasser av ``typing.Protocol`` som endast har datavariabler deklarerade kommer nu att ge upphov till ett ``TypeError`` när de kontrolleras med ``isinstance`` om de inte är dekorerade med :func:`~typing.runtime_checkable`. Tidigare passerade dessa kontroller tyst. Användare bör dekorera sina subklasser med :func:`!runtime_checkable` dekoratorn om de vill ha runtime protokoll. (Bidrag från Yurii Karabas i :issue:`38908`.)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules have been deprecated since Python 3.8 and will be removed in a future version of Python. Anything belonging to those submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`.)
sv: Import från submodulerna ``typing.io`` och ``typing.re`` kommer nu att ge :exc:`DeprecationWarning`. Dessa undermoduler har varit föråldrade sedan Python 3.8 och kommer att tas bort i en framtida version av Python. Allt som hör till dessa undermoduler bör importeras direkt från :mod:`typing` istället. (Bidrag från Sebastian Rittau i :issue:`38291`.)

source: Add new method :meth:`~unittest.TestCase.assertNoLogs` to complement the existing :meth:`~unittest.TestCase.assertLogs`. (Contributed by Kit Yan Choi in :issue:`39385`.)
sv: Lägg till en ny metod :meth:`~unittest.TestCase.assertNoLogs` som komplement till den befintliga :meth:`~unittest.TestCase.assertLogs`. (Bidrag från Kit Yan Choi i :issue:`39385`.)

source: Python versions earlier than Python 3.10 allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
sv: Python-versioner tidigare än Python 3.10 tillät användning av både ``;`` och ``&`` som separatorer för frågeparametrar i :func:`urllib.parse.parse_qs` och :func:`urllib.parse.parse_qsl`. På grund av säkerhetsproblem och för att överensstämma med nyare W3C-rekommendationer har detta ändrats så att endast en enda separatornyckel tillåts, med ``&`` som standard. Denna ändring påverkar även :func:`!cgi.parse` och :func:`!cgi.parse_multipart` eftersom de använder de berörda funktionerna internt. För mer information, vänligen se deras respektive dokumentation. (Bidrag från Adam Goldschmidt, Senthil Kumaran och Ken Jin i :issue:`42967`.)

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
sv: Förekomsten av newline- eller tabb-tecken i delar av en URL möjliggör vissa former av attacker. I enlighet med WHATWG-specifikationen som uppdaterar :rfc:`3986`, tas ASCII newline ``n``, ``\r`` och tabb ``t``-tecken bort från URL:en av parsern i :mod:`urllib.parse` för att förhindra sådana attacker. De borttagna tecknen styrs av en ny variabel på modulnivå, ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Se :gh:`88048`)

source: Add a :class:`~xml.sax.handler.LexicalHandler` class to the :mod:`xml.sax.handler` module. (Contributed by Jonathan Gossage and Zackery Spytz in :issue:`35018`.)
sv: Lägg till en :class:`~xml.sax.handler.LexicalHandler`-klass till :mod:`xml.sax.handler`-modulen. (Bidrag från Jonathan Gossage och Zackery Spytz i :issue:`35018`.)

source: Add methods related to :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module`, and :meth:`zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`42131`.)
sv: Lägg till metoder relaterade till :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module` och :meth:`zipimport.zipimporter.exec_module`. (Bidrag från Brett Cannon i :issue:`42131`.)

source: Add :meth:`~zipimport.zipimporter.invalidate_caches` method. (Contributed by Desmond Cheong in :issue:`14678`.)
sv: Lägg till metoden :meth:`~zipimport.zipimporter.invalidate_caches`. (Bidrag från Desmond Cheong i :issue:`14678`.)

source: Optimizations
sv: Optimeringar

source: Constructors :func:`str`, :func:`bytes` and :func:`bytearray` are now faster (around 30--40% for small objects). (Contributed by Serhiy Storchaka in :issue:`41334`.)
sv: Konstruktörerna :func:`str`, :func:`bytes` och :func:`bytearray` är nu snabbare (runt 30--40% feller små objekt). (Bidrag från Serhiy Storchaka i :issue:`41334`.)

source: The :mod:`runpy` module now imports fewer modules. The ``python3 -m module-name`` command startup time is 1.4x faster in average. On Linux, ``python3 -I -m module-name`` imports 69 modules on Python 3.9, whereas it only imports 51 modules (-18) on Python 3.10. (Contributed by Victor Stinner in :issue:`41006` and :issue:`41718`.)
sv: Modulen :mod:`runpy` importerar nu färre moduler. Starttiden för kommandot ``python3 -m modul-namn`` är i genomsnitt 1,4x snabbare. På Linux importerar ``python3 -I -m module-name`` 69 moduler i Python 3.9, medan det bara importerar 51 moduler (-18) i Python 3.10. (Bidrag från Victor Stinner i :issue:`41006` och :issue:`41718`.)

source: The ``LOAD_ATTR`` instruction now uses new "per opcode cache" mechanism. It is about 36% faster now for regular attributes and 44% faster for slots. (Contributed by Pablo Galindo and Yury Selivanov in :issue:`42093` and Guido van Rossum in :issue:`42927`, based on ideas implemented originally in PyPy and MicroPython.)
sv: Instruktionen ``LOAD_ATTR`` använder nu den nya "per opcode cache"-mekanismen. Det är ungefär 36% faster nu för vanliga attribut och 44% faster för slots. (Bidrag från Pablo Galindo och Yury Selivanov i :issue:`42093` och Guido van Rossum i :issue:`42927`, baserat på idéer som ursprungligen implementerades i PyPy och MicroPython)

source: When building Python with :option:`--enable-optimizations` now ``-fno-semantic-interposition`` is added to both the compile and link line. This speeds builds of the Python interpreter created with :option:`--enable-shared` with ``gcc`` by up to 30%. See `this article <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/>`_ for more details. (Contributed by Victor Stinner and Pablo Galindo in :issue:`38980`.)
sv: När Python byggs med :option:`--enable-optimizations` läggs nu ``-fno-semantic-interposition`` till på både kompilerings- och länkningsraden. Detta påskyndar byggandet av Python-tolken som skapats med :option:`--enable-shared` med ``gcc`` med upp till 30%. Se `den här artikeln <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/>`_ för mer information. (Bidrag från Victor Stinner och Pablo Galindo i :issue:`38980`.)

source: Use a new output buffer management code for :mod:`bz2` / :mod:`lzma` / :mod:`zlib` modules, and add ``.readall()`` function to ``_compression.DecompressReader`` class. bz2 decompression is now 1.09x ~ 1.17x faster, lzma decompression 1.20x ~ 1.32x faster, ``GzipFile.read(-1)`` 1.11x ~ 1.18x faster. (Contributed by Ma Lin, reviewed by Gregory P. Smith, in :issue:`41486`)
sv: Använd en ny kod för hantering av utdatabufferten för modulerna :mod:`bz2` / :mod:`lzma` / :mod:`zlib` och lägg till funktionen ``.readall()`` i klassen ``_compression.DecompressReader``. bz2-dekomprimering är nu 1,09x ~ 1,17x snabbare, lzma-dekomprimering 1,20x ~ 1,32x snabbare, ``GzipFile.read(-1)`` 1,11x ~ 1,18x snabbare. (Bidrag från Ma Lin, granskad av Gregory P. Smith, i :issue:`41486`)

source: When using stringized annotations, annotations dicts for functions are no longer created when the function is created. Instead, they are stored as a tuple of strings, and the function object lazily converts this into the annotations dict on demand. This optimization cuts the CPU time needed to define an annotated function by half. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`.)
sv: Vid användning av strängformade annoteringar skapas inte längre annotationsdict för funktioner när funktionen skapas. Istället lagras de som en tupel av strängar, och funktionsobjektet konverterar detta till annotationsdikten på begäran. Denna optimering halverar den CPU-tid som krävs för att definiera en annoterad funktion. (Bidrag från Yurii Karabas och Inada Naoki i :issue:`42202`.)

source: Substring search functions such as ``str1 in str2`` and ``str2.find(str1)`` now sometimes use Crochemore & Perrin's "Two-Way" string searching algorithm to avoid quadratic behavior on long strings. (Contributed by Dennis Sweeney in :issue:`41972`)
sv: Sökfunktioner för delsträngar som ``str1 i str2`` och ``str2.find(str1)`` använder nu ibland Crochemore & Perrins "Two-Way" strängsökningsalgoritm för att undvika kvadratiskt beteende på långa strängar. (Bidrag från Dennis Sweeney i :issue:`41972`)

source: Add micro-optimizations to ``_PyType_Lookup()`` to improve type attribute cache lookup performance in the common case of cache hits. This makes the interpreter 1.04 times faster on average. (Contributed by Dino Viehland in :issue:`43452`.)
sv: Lägg till mikrooptimeringar till ``_PyType_Lookup()`` för att förbättra prestanda för typattributcacheuppslagning i det vanliga fallet med cacheträffar. Detta gör tolken 1,04 gånger snabbare i genomsnitt. (Bidrag från Dino Viehland i :issue:`43452`.)

source: The following built-in functions now support the faster :pep:`590` vectorcall calling convention: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` and :func:`float`. (Contributed by Donghee Na and Jeroen Demeyer in :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` and :issue:`41870`.)
sv: Följande inbyggda funktioner stöder nu den snabbare :pep:`590` vectorcall-anropskonventionen: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` och :func:`float`. (Bidrag från Donghee Na och Jeroen Demeyer i :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` och :issue:`41870`.)

source: :class:`~bz2.BZ2File` performance is improved by removing internal ``RLock``. This makes :class:`!BZ2File` thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been. (Contributed by Inada Naoki in :issue:`43785`.)
sv: :class:`~bz2.BZ2File` prestanda förbättras genom att ta bort interna ``RLock``. Detta gör :class:`!BZ2File` trådosäker mot flera samtidiga läsare eller skrivare, precis som dess motsvarande klasser i :mod:`gzip` och :mod:`lzma` alltid har varit. (Bidrag från Inada Naoki i :issue:`43785`.)

source: Deprecated
sv: Föråldrat

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). Starting in this release, a deprecation warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In future releases it will be changed to syntax warning, and finally to syntax error. (Contributed by Serhiy Storchaka in :issue:`43833`.)
sv: För närvarande accepterar Python numeriska literaler omedelbart följt av nyckelord, till exempel ``0in x``, ``1or x``, ``0if 1else 2``. Det tillåter förvirrande och tvetydiga uttryck som ``[0x1for x in y]`` (som kan tolkas som ``[0x1 for x in y]`` eller ``[0x1f or x in y]``). Från och med den här utgåvan kommer en deprecation-varning att utfärdas om den numeriska litteralen omedelbart följs av ett av nyckelorden :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` och :keyword:`or`. I framtida versioner kommer det att ändras till syntaxvarning och slutligen till syntaxfel. (Bidrag från Serhiy Storchaka i :issue:`43833`.)

source: Starting in this release, there will be a concerted effort to begin cleaning up old import semantics that were kept for Python 2.7 compatibility. Specifically, :meth:`!find_loader`/:meth:`!find_module` (superseded by :meth:`~importlib.abc.MetaPathFinder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (superseded by :meth:`~importlib.abc.Loader.exec_module`), :meth:`!module_repr` (which the import system takes care of for you), the ``__package__`` attribute (superseded by ``__spec__.parent``), the ``__loader__`` attribute (superseded by ``__spec__.loader``), and the ``__cached__`` attribute (superseded by ``__spec__.cached``) will slowly be removed (as well as other classes and methods in :mod:`importlib`). :exc:`ImportWarning` and/or :exc:`DeprecationWarning` will be raised as appropriate to help identify code which needs updating during this transition.
sv: Från och med den här utgåvan kommer det att finnas en samlad ansträngning för att börja städa upp gammal importsemantik som behölls för Python 2.7-kompatibilitet. I synnerhet :meth:`!find_loader`/:meth:`!find_module` (ersatt av :meth:`~importlib.abc.MetaPathFinder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (ersatt av :meth:`~importlib.abc.Loader.exec_module`), :meth:`!module_repr` (som importsystemet tar hand om åt dig), attributet ``__package__`` (ersatt av ``__spec__.parent``), attributet ``__loader__`` (ersatt av ``__spec__.loader``) och attributet ``__cached__`` (ersatt av ``__spec__.cached``) kommer långsamt att tas bort (liksom andra klasser och metoder i :mod:`importlib`). :exc:`ImportWarning` och/eller :exc:`DeprecationWarning` kommer att visas på lämpligt sätt för att hjälpa till att identifiera kod som behöver uppdateras under denna övergång.

source: The entire ``distutils`` namespace is deprecated, to be removed in Python 3.12. Refer to the :ref:`module changes <distutils-deprecated>` section for more information.
sv: Hela namnrymden ``distutils`` är föråldrad och kommer att tas bort i Python 3.12. Se avsnittet :ref:``Moduländringar <distutils-deprecated>` för mer information.

source: Non-integer arguments to :func:`random.randrange` are deprecated. The :exc:`ValueError` is deprecated in favor of a :exc:`TypeError`. (Contributed by Serhiy Storchaka and Raymond Hettinger in :issue:`37319`.)
sv: Argument som inte är heltal till :func:`random.randrange` är föråldrade. :exc:`ValueError` är avfört till förmån för :exc:`TypeError`. (Bidrag från Serhiy Storchaka och Raymond Hettinger i :issue:`37319`.)

source: The various ``load_module()`` methods of :mod:`importlib` have been documented as deprecated since Python 3.6, but will now also trigger a :exc:`DeprecationWarning`. Use :meth:`~importlib.abc.Loader.exec_module` instead. (Contributed by Brett Cannon in :issue:`26131`.)
sv: De olika ``load_module()``-metoderna i :mod:`importlib` har dokumenterats som föråldrade sedan Python 3.6, men kommer nu också att utlösa en :exc:`DeprecationWarning`. Använd :meth:`~importlib.abc.Loader.exec_module` istället. (Bidrag från Brett Cannon i :issue:`26131`.)

source: :meth:`!zimport.zipimporter.load_module` has been deprecated in preference for :meth:`~zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`26131`.)
sv: :meth:`!zimport.zipimporter.load_module` har utgått till förmån för :meth:`~zipimport.zipimporter.exec_module`. (Bidrag från Brett Cannon i :issue:`26131`.)

source: The use of :meth:`~importlib.abc.Loader.load_module` by the import system now triggers an :exc:`ImportWarning` as :meth:`~importlib.abc.Loader.exec_module` is preferred. (Contributed by Brett Cannon in :issue:`26131`.)
sv: Importsystemets användning av :meth:`~importlib.abc.Loader.load_module` utlöser nu en :exc:`ImportWarning` eftersom :meth:`~importlib.abc.Loader.exec_module` är att föredra. (Bidrag från Brett Cannon i :issue:`26131`.)

source: The use of :meth:`!importlib.abc.MetaPathFinder.find_module` and :meth:`!importlib.abc.PathEntryFinder.find_module` by the import system now trigger an :exc:`ImportWarning` as :meth:`importlib.abc.MetaPathFinder.find_spec` and :meth:`importlib.abc.PathEntryFinder.find_spec` are preferred, respectively. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`42134`.)
sv: Importsystemets användning av :meth:`!importlib.abc.MetaPathFinder.find_module` och :meth:`!importlib.abc.PathEntryFinder.find_module` utlöser nu en :exc:`ImportWarning` eftersom :meth:`importlib.abc.MetaPathFinder.find_spec` respektive :meth:`importlib.abc.PathEntryFinder.find_spec` föredras. Du kan använda :func:`importlib.util.spec_from_loader` för att hjälpa till med portningen. (Bidrag från Brett Cannon i :issue:`42134`.)

source: The use of :meth:`!importlib.abc.PathEntryFinder.find_loader` by the import system now triggers an :exc:`ImportWarning` as :meth:`importlib.abc.PathEntryFinder.find_spec` is preferred. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`43672`.)
sv: Importsystemets användning av :meth:`!importlib.abc.PathEntryFinder.find_loader` utlöser nu en :exc:`ImportWarning` eftersom :meth:`importlib.abc.PathEntryFinder.find_spec` är att föredra. Du kan använda :func:`importlib.util.spec_from_loader` för att hjälpa till med porteringen. (Bidrag från Brett Cannon i :issue:`43672`.)

source: The various implementations of :meth:`!importlib.abc.MetaPathFinder.find_module` ( :meth:`!importlib.machinery.BuiltinImporter.find_module`, :meth:`!importlib.machinery.FrozenImporter.find_module`, :meth:`!importlib.machinery.WindowsRegistryFinder.find_module`, :meth:`!importlib.machinery.PathFinder.find_module`, :meth:`!importlib.abc.MetaPathFinder.find_module` ), :meth:`!importlib.abc.PathEntryFinder.find_module` ( :meth:`!importlib.machinery.FileFinder.find_module` ), and :meth:`!importlib.abc.PathEntryFinder.find_loader` ( :meth:`!importlib.machinery.FileFinder.find_loader` ) now raise :exc:`DeprecationWarning` and are slated for removal in Python 3.12 (previously they were documented as deprecated in Python 3.4). (Contributed by Brett Cannon in :issue:`42135`.)
sv: De olika implementationerna av :meth:`!importlib.abc.MetaPathFinder.find_module` ( :meth:`!importlib.machinery.BuiltinImporter.find_module`, :meth:`!importlib.machinery.FrozenImporter.find_module`, :meth:`!importlib.machinery.WindowsRegistryFinder.find_module`.FrozenImporter.find_module`, :meth:`!importlib.machinery.WindowsRegistryFinder.find_module`, :meth:`!importlib.machinery.PathFinder.find_module`, :meth:`!importlib.abc.MetaPathFinder.find_module` ), :meth:`!importlib.abc.PathEntryFinder.find_module` ( :meth:`!importlib.machinery.FileFinder.find_module` ), och :meth:`!importlib.abc.PathEntryFinder.find_loader` ( :meth:`!importlib.machinery.FileFinder.find_loader` ) ger nu upphov till :exc:`DeprecationWarning` och kommer att tas bort i Python 3.12 (tidigare dokumenterades de som föråldrade i Python 3.4). (Bidrag från Brett Cannon i :issue:`42135`.)

source: :class:`!importlib.abc.Finder` is deprecated (including its sole method, :meth:`!find_module`). Both :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder` no longer inherit from the class. Users should inherit from one of these two classes as appropriate instead. (Contributed by Brett Cannon in :issue:`42135`.)
sv: :class:`!importlib.abc.Finder` är utfasad (inklusive dess enda metod, :meth:`!find_module`). Både :class:`importlib.abc.MetaPathFinder` och :class:`importlib.abc.PathEntryFinder` ärver inte längre från klassen. Användare bör i stället ärva från en av dessa två klasser på lämpligt sätt. (Bidrag från Brett Cannon i :issue:`42135`.)

source: The deprecations of :mod:`!imp`, :func:`!importlib.find_loader`, :func:`!importlib.util.set_package_wrapper`, :func:`!importlib.util.set_loader_wrapper`, :func:`!importlib.util.module_for_loader`, :class:`!pkgutil.ImpImporter`, and :class:`!pkgutil.ImpLoader` have all been updated to list Python 3.12 as the slated version of removal (they began raising :exc:`DeprecationWarning` in previous versions of Python). (Contributed by Brett Cannon in :issue:`43720`.)
sv: Avvecklingen av :mod:`!imp`, :func:`!importlib.find_loader`, :func:`!importlib.util.set_package_wrapper`, :func:`!importlib.util.set_loader_wrapper`, :func:`!importlib.util.module_for_loader`, :class:`!pkgutil.ImpImporter`, och :class:`!pkgutil.ImpLoader` har alla uppdaterats för att lista Python 3.12 som den planerade versionen av borttagning (de började höja :exc:`DeprecationWarning` i tidigare versioner av Python). (Bidrag från Brett Cannon i :issue:`43720`.)

source: The import system now uses the ``__spec__`` attribute on modules before falling back on :meth:`!module_repr` for a module's ``__repr__()`` method. Removal of the use of ``module_repr()`` is scheduled for Python 3.12. (Contributed by Brett Cannon in :issue:`42137`.)
sv: Importsystemet använder nu attributet ``__spec__`` på moduler innan det faller tillbaka på :meth:`!module_repr` för en moduls ``__repr__()``-metod. Borttagandet av användningen av ``module_repr()`` är planerat till Python 3.12. (Bidrag från Brett Cannon i :issue:`42137`.)

source: :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.machinery.FrozenLoader.module_repr`, and :meth:`!importlib.machinery.BuiltinLoader.module_repr` are deprecated and slated for removal in Python 3.12. (Contributed by Brett Cannon in :issue:`42136`.)
sv: :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.machinery.FrozenLoader.module_repr`, and :meth:`!importlib.machinery.BuiltinLoader.module_repr` are deprecated and slated for removal in Python 3.12. (Bidrag från Brett Cannon i :issue:`42136`.)

source: ``sqlite3.OptimizedUnicode`` has been undocumented and obsolete since Python 3.3, when it was made an alias to :class:`str`. It is now deprecated, scheduled for removal in Python 3.12. (Contributed by Erlend E. Aasland in :issue:`42264`.)
sv: ``sqlite3.OptimizedUnicode`` har varit odokumenterad och föråldrad sedan Python 3.3, då den gjordes till ett alias till :class:`str`. Det är nu föråldrat och planeras att tas bort i Python 3.12. (Bidrag från Erlend E. Aasland i :issue:`42264`.)
