Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
sv: Omorganisera dialogrutan för inställningar. Dela upp fliken Allmänt i flikarna Windows och Shell/Ed. Flytta hjälpkällor, som utökar Hjälp-menyn, till fliken Tillägg. Gör plats för nya alternativ och förkorta dialogrutan. Det senare gör att dialogrutan passar bättre på små skärmar. (Bidrag från Terry Jan Reedy i :issue:`40468`.) Flytta inställningen för indragningsutrymme från fliken Font till den nya fliken Windows. (Bidrag från Mark Roseman och Terry Jan Reedy i :issue:`33962`.)

source: The changes above were backported to a 3.9 maintenance release.
sv: Ändringarna ovan har bakåtportionerats till en underhållsversion av 3.9.

source: Add a Shell sidebar. Move the primary prompt ('>>>') to the sidebar. Add secondary prompts ('...') to the sidebar. Left click and optional drag selects one or more lines of text, as with the editor line number sidebar. Right click after selecting text lines displays a context menu with 'copy with prompts'. This zips together prompts from the sidebar with lines from the selected text. This option also appears on the context menu for the text. (Contributed by Tal Einat in :issue:`37903`.)
sv: Lägg till ett Shell-sidofält. Flytta den primära prompten ('>>>') till sidofältet. Lägg till sekundära uppmaningar ('...') i sidofältet. Vänsterklick och valfri dragning markerar en eller flera textrader, precis som i sidofältet för radnummer i editorn. Om du högerklickar efter att ha valt textrader visas en snabbmeny med "Kopiera med prompter". Då sammanfogas anvisningarna från sidofältet med raderna i den markerade texten. Det här alternativet visas också på snabbmenyn för texten. (Bidrag från Tal Einat i :issue:`37903`.)

source: Use spaces instead of tabs to indent interactive code. This makes interactive code entries 'look right'. Making this feasible was a major motivation for adding the shell sidebar. (Contributed by Terry Jan Reedy in :issue:`37892`.)
sv: Använd mellanslag i stället för tabbar för att dra in interaktiv kod. Detta gör att interaktiva kodposter "ser rätt ut". Att göra detta genomförbart var en viktig motivation för att lägga till sidofältet för skal. (Bidrag från Terry Jan Reedy i :issue:`37892`.)

source: Highlight the new :ref:`soft keywords <soft-keywords>` :keyword:`match`, :keyword:`case <match>`, and :keyword:`_ <wildcard-patterns>` in pattern-matching statements. However, this highlighting is not perfect and will be incorrect in some rare cases, including some ``_``-s in ``case`` patterns. (Contributed by Tal Einat in :issue:`44010`.)
sv: Markera de nya :ref:`mjuka nyckelorden <soft-keywords>` :keyword:`match`, :keyword:`case <match>` och :keyword:`_ <wildcard-patterns>` i mönstermatchningssatser. Denna markering är dock inte perfekt och kommer att vara felaktig i vissa sällsynta fall, inklusive vissa ``_``-s i ``case``-mönster. (Bidrag från Tal Einat i :issue:`44010`.)

source: New in 3.10 maintenance releases.
sv: Nytt i underhållsversioner av 3.10.

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
sv: Tillämpa syntaxmarkering på ``.pyi``-filer. (Bidrag från Alex Waygood och Terry Jan Reedy i :issue:`45447`.)

source: Include prompts when saving Shell with inputs and outputs. (Contributed by Terry Jan Reedy in :gh:`95191`.)
sv: Inkludera uppmaningar när du sparar Shell med in- och utgångar. (Bidrag från Terry Jan Reedy i :gh:`95191`.)

source: Feature parity with ``importlib_metadata`` 4.6 (`history <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).
sv: Funktionsparitet med ``importlib_metadata`` 4.6 (`historik <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).

source: :ref:`importlib.metadata entry points <entry-points>` now provide a nicer experience for selecting entry points by group and name through a new :ref:`importlib.metadata.EntryPoints <entry-points>` class. See the Compatibility Note in the docs for more info on the deprecation and usage.
sv: :ref:`importlib.metadata entry points <entry-points>` ger nu en trevligare upplevelse för att välja entry points efter grupp och namn genom en ny :ref:`importlib.metadata.EntryPoints <entry-points>`-klass. Se Compatibility Note i dokumentationen för mer information om borttagandet och användningen.

source: Added :ref:`importlib.metadata.packages_distributions() <package-distributions>` for resolving top-level Python modules and packages to their :ref:`importlib.metadata.Distribution <distributions>`.
sv: Lagt till :ref:`importlib.metadata.packages_distributions() <package-distributions>` för att lösa Python-moduler och -paket på toppnivå till deras :ref:`importlib.metadata.Distribution <distributions>`.

source: inspect
sv: inspektera

source: Add :func:`inspect.get_annotations`, which safely computes the annotations defined on an object. It works around the quirks of accessing the annotations on various types of objects, and makes very few assumptions about the object it examines. :func:`inspect.get_annotations` can also correctly un-stringize stringized annotations. :func:`inspect.get_annotations` is now considered best practice for accessing the annotations dict defined on any Python object; for more information on best practices for working with annotations, please see :ref:`annotations-howto`. Relatedly, :func:`inspect.signature`, :func:`inspect.Signature.from_callable`, and :func:`!inspect.Signature.from_function` now call :func:`inspect.get_annotations` to retrieve annotations. This means :func:`inspect.signature` and :func:`inspect.Signature.from_callable` can also now un-stringize stringized annotations. (Contributed by Larry Hastings in :issue:`43817`.)
sv: Lägg till :func:`inspect.get_annotations`, som på ett säkert sätt beräknar de annoteringar som definierats för ett objekt. Den arbetar runt egenheterna med att komma åt annoteringarna på olika typer av objekt, och gör mycket få antaganden om objektet den undersöker. :func:`inspect.get_annotations` kan också korrekt avstränga strängade annoteringar. :func:`inspect.get_annotations` anses nu vara bästa praxis för att komma åt annoteringsdikten som definieras på alla Python-objekt; för mer information om bästa praxis för att arbeta med annoteringar, se :ref:`annotations-howto`. Relaterat, :func:`inspect.signature`, :func:`inspect.Signature.from_callable`, och :func:`!inspect.Signature.from_function` anropar nu :func:`inspect.get_annotations` för att hämta annoteringar. Detta innebär att :func:`inspect.signature` och :func:`inspect.Signature.from_callable` nu även kan avstränga strängade annoteringar. (Bidrag från Larry Hastings i :issue:`43817`.)

source: Add :func:`itertools.pairwise`. (Contributed by Raymond Hettinger in :issue:`38200`.)
sv: Lägg till :func:`itertools.pairwise`. (Bidrag från Raymond Hettinger i :issue:`38200`.)

source: Add :func:`os.cpu_count` support for VxWorks RTOS. (Contributed by Peixing Xin in :issue:`41440`.)
sv: Lägg till :func:`os.cpu_count` stöd för VxWorks RTOS. (Bidrag från Peixing Xin i :issue:`41440`.)

source: Add a new function :func:`os.eventfd` and related helpers to wrap the ``eventfd2`` syscall on Linux. (Contributed by Christian Heimes in :issue:`41001`.)
sv: Lägg till en ny funktion :func:`os.eventfd` och relaterade hjälpfunktioner för att paketera syscallen ``eventfd2`` på Linux. (Bidrag från Christian Heimes i :issue:`41001`.)

source: Add :func:`os.splice` that allows to move data between two file descriptors without copying between kernel address space and user address space, where one of the file descriptors must refer to a pipe. (Contributed by Pablo Galindo in :issue:`41625`.)
sv: Lägg till :func:`os.splice` som gör det möjligt att flytta data mellan två filbeskrivare utan att kopiera mellan kärnans adressrymd och användarens adressrymd, där en av filbeskrivarna måste referera till en pipe. (Bidrag från Pablo Galindo i :issue:`41625`.)

source: Add :const:`~os.O_EVTONLY`, :const:`~os.O_FSYNC`, :const:`~os.O_SYMLINK` and :const:`~os.O_NOFOLLOW_ANY` for macOS. (Contributed by Donghee Na in :issue:`43106`.)
sv: Lägg till :const:`~os.O_EVTONLY`, :const:`~os.O_FSYNC`, :const:`~os.O_SYMLINK` och :const:`~os.O_NOFOLLOW_ANY` för macOS. (Bidrag från Donghee Na i :issue:`43106`.)

source: os.path
sv: os.sökväg

source: :func:`os.path.realpath` now accepts a *strict* keyword-only argument. When set to ``True``, :exc:`OSError` is raised if a path doesn't exist or a symlink loop is encountered. (Contributed by Barney Gale in :issue:`43757`.)
sv: :func:`os.path.realpath` accepterar nu ett *strikt* argument som endast innehåller nyckelord. När den är inställd på ``True``, :exc:`OSError`` tas upp om en sökväg inte existerar eller om en symlänk-loop påträffas. (Bidrag från Barney Gale i :issue:`43757`.)

source: pathlib
sv: sökväg

source: Add slice support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Joshua Cannon in :issue:`35498`.)
sv: Lägg till stöd för slice i :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Bidrag från Joshua Cannon i :issue:`35498`.)

source: Add negative indexing support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Yaroslav Pankovych in :issue:`21041`.)
sv: Lägg till stöd för negativ indexering till :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Bidrag från Yaroslav Pankovych i :issue:`21041`.)

source: Add :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>` method that supersedes :meth:`!link_to`. The new method has the same argument order as :meth:`~pathlib.Path.symlink_to`. (Contributed by Barney Gale in :issue:`39950`.)
sv: Lägg till :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>` metod som ersätter :meth:`!link_to`. Den nya metoden har samma argumentordning som :meth:`~pathlib.Path.symlink_to`. (Bidrag från Barney Gale i :issue:`39950`.)

source: :meth:`pathlib.Path.stat` and :meth:`~pathlib.Path.chmod` now accept a *follow_symlinks* keyword-only argument for consistency with corresponding functions in the :mod:`os` module. (Contributed by Barney Gale in :issue:`39906`.)
sv: :meth:`pathlib.Path.stat` och :meth:`~pathlib.Path.chmod` accepterar nu ett *follow_symlinks* nyckelordsargument för överensstämmelse med motsvarande funktioner i modulen :mod:`os`. (Bidrag från Barney Gale i :issue:`39906`.)

source: platform
sv: plattform

source: Add :func:`platform.freedesktop_os_release` to retrieve operation system identification from `freedesktop.org os-release <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ standard file. (Contributed by Christian Heimes in :issue:`28468`.)
sv: Lägg till :func:`platform.freedesktop_os_release` för att hämta identifiering av operativsystem från standardfilen `freedesktop.org os-release <https://www.freedesktop.org/software/systemd/man/os-release.html>`_. (Bidrag från Christian Heimes i :issue:`28468`.)

source: pprint
sv: tryck

source: :func:`pprint.pprint` now accepts a new ``underscore_numbers`` keyword argument. (Contributed by sblondon in :issue:`42914`.)
sv: :func:`pprint.pprint` accepterar nu ett nytt ``underscore_numbers`` nyckelordsargument. (Bidrag från sblondon i :issue:`42914`.)

source: :mod:`pprint` can now pretty-print :class:`dataclasses.dataclass` instances. (Contributed by Lewis Gaul in :issue:`43080`.)
sv: :mod:`pprint` kan nu pretty-printa :class:`dataclasses.dataclass`-instanser. (Bidrag från Lewis Gaul i :issue:`43080`.)

source: py_compile
sv: py_kompilera

source: Add ``--quiet`` option to command-line interface of :mod:`py_compile`. (Contributed by Gregory Schevchenko in :issue:`38731`.)
sv: Lägg till alternativet ``--quiet`` i kommandoradsgränssnittet för :mod:`py_compile`. (Bidrag från Gregory Schevchenko i :issue:`38731`.)

source: Add an ``end_lineno`` attribute to the ``Function`` and ``Class`` objects in the tree returned by :func:`pyclbr.readmodule` and :func:`pyclbr.readmodule_ex`. It matches the existing (start) ``lineno``. (Contributed by Aviral Srivastava in :issue:`38307`.)
sv: Lägg till ett ``end_lineno`` attribut till ``Function`` och ``Class`` objekten i trädet som returneras av :func:`pyclbr.readmodule` och :func:`pyclbr.readmodule_ex`. Den matchar den befintliga (start) ``lineno``. (Bidrag från Aviral Srivastava i :issue:`38307`.)

source: shelve
sv: hylla

source: The :mod:`shelve` module now uses :const:`pickle.DEFAULT_PROTOCOL` by default instead of :mod:`pickle` protocol ``3`` when creating shelves. (Contributed by Zackery Spytz in :issue:`34204`.)
sv: Modulen :mod:`shelve` använder nu :const:`pickle.DEFAULT_PROTOCOL` som standard istället för :mod:`pickle` protocol ``3`` när hyllor skapas. (Bidrag från Zackery Spytz i :issue:`34204`.)

source: statistics
sv: statistik

source: Add :func:`~statistics.covariance`, Pearson's :func:`~statistics.correlation`, and simple :func:`~statistics.linear_regression` functions. (Contributed by Tymoteusz Wołodźko in :issue:`38490`.)
sv: Lägg till :func:`~statistics.covariance`, Pearsons :func:`~statistics.correlation` och enkla :func:`~statistics.linear_regression` funktioner. (Bidrag från Tymoteusz Wołodźko i :issue:`38490`.)

source: site
sv: plats

source: socket
sv: kortplats

source: The exception :exc:`socket.timeout` is now an alias of :exc:`TimeoutError`. (Contributed by Christian Heimes in :issue:`42413`.)
sv: Undantaget :exc:`socket.timeout` är nu ett alias för :exc:`TimeoutError`. (Bidrag från Christian Heimes i :issue:`42413`.)

source: Add option to create MPTCP sockets with ``IPPROTO_MPTCP`` (Contributed by Rui Cunha in :issue:`43571`.)
sv: Lägg till alternativ för att skapa MPTCP-sockets med ``IPPROTO_MPTCP`` (Bidrag från Rui Cunha i :issue:`43571`.)

source: Add ``IP_RECVTOS`` option to receive the type of service (ToS) or DSCP/ECN fields (Contributed by Georg Sauthoff in :issue:`44077`.)
sv: Lägg till alternativet ``IP_RECVTOS`` för att ta emot fälten Type of Service (ToS) eller DSCP/ECN (Bidrag från Georg Sauthoff i :issue:`44077`.)

source: The ssl module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
sv: Modulen ssl kräver OpenSSL 1.1.1 eller nyare. (Bidrag från Christian Heimes i :pep:`644` och :issue:`43669`.)

source: The ssl module has preliminary support for OpenSSL 3.0.0 and new option :const:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Contributed by Christian Heimes in :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue:`43789`, and :issue:`43811`.)
sv: Modulen ssl har preliminärt stöd för OpenSSL 3.0.0 och det nya alternativet :const:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Bidrag från Christian Heimes i :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue:`43789` och :issue:`43811`.)

source: Deprecated function and use of deprecated constants now result in a :exc:`DeprecationWarning`. :attr:`ssl.SSLContext.options` has :data:`~ssl.OP_NO_SSLv2` and :data:`~ssl.OP_NO_SSLv3` set by default and therefore cannot warn about setting the flag again. The :ref:`deprecation section <whatsnew310-deprecated>` has a list of deprecated features. (Contributed by Christian Heimes in :issue:`43880`.)
sv: Föråldrad funktion och användning av föråldrade konstanter resulterar nu i en :exc:`DeprecationWarning`. :attr:`ssl.SSLContext.options` har :data:`~ssl.OP_NO_SSLv2` och :data:`~ssl.OP_NO_SSLv3` inställda som standard och kan därför inte varna för att ställa in flaggan igen. I :ref:``deprecation section <whatsnew310-deprecated>` finns en lista över föråldrade funktioner. (Bidrag från Christian Heimes i :issue:`43880`.)

source: The ssl module now has more secure default settings. Ciphers without forward secrecy or SHA-1 MAC are disabled by default. Security level 2 prohibits weak RSA, DH, and ECC keys with less than 112 bits of security. :class:`~ssl.SSLContext` defaults to minimum protocol version TLS 1.2. Settings are based on Hynek Schlawack's research. (Contributed by Christian Heimes in :issue:`43998`.)
sv: Ssl-modulen har nu säkrare standardinställningar. Ciphers utan forward secrecy eller SHA-1 MAC är inaktiverade som standard. Säkerhetsnivå 2 förbjuder svaga RSA-, DH- och ECC-nycklar med mindre än 112 bitars säkerhet. :class:`~ssl.SSLContext` har som standard den lägsta protokollversionen TLS 1.2. Inställningarna är baserade på Hynek Schlawacks forskning. (Bidrag från Christian Heimes i :issue:`43998`.)

source: The deprecated protocols SSL 3.0, TLS 1.0, and TLS 1.1 are no longer officially supported. Python does not block them actively. However OpenSSL build options, distro configurations, vendor patches, and cipher suites may prevent a successful handshake.
sv: De föråldrade protokollen SSL 3.0, TLS 1.0 och TLS 1.1 stöds inte längre officiellt. Python blockerar dem inte aktivt. Men OpenSSL-byggalternativ, distrokonfigurationer, leverantörspatchar och chiffersviter kan förhindra en framgångsrik handskakning.

source: Add a *timeout* parameter to the :func:`ssl.get_server_certificate` function. (Contributed by Zackery Spytz in :issue:`31870`.)
sv: Lägg till en *timeout*-parameter till funktionen :func:`ssl.get_server_certificate`. (Bidrag från Zackery Spytz i :issue:`31870`.)

source: The ssl module uses heap-types and multi-phase initialization. (Contributed by Christian Heimes in :issue:`42333`.)
sv: Modulen ssl använder heap-types och initialisering i flera faser. (Bidrag från Christian Heimes i :issue:`42333`.)

source: A new verify flag :const:`~ssl.VERIFY_X509_PARTIAL_CHAIN` has been added. (Contributed by l0x in :issue:`40849`.)
sv: En ny verifieringsflagga :const:`~ssl.VERIFY_X509_PARTIAL_CHAIN` har lagts till. (Bidrag från l0x i :issue:`40849`.)

source: Add audit events for :func:`~sqlite3.connect/handle`, :meth:`~sqlite3.Connection.enable_load_extension`, and :meth:`~sqlite3.Connection.load_extension`. (Contributed by Erlend E. Aasland in :issue:`43762`.)
sv: Lägg till granskningshändelser för :func:`~sqlite3.connect/handle`, :meth:`~sqlite3.Connection.enable_load_extension`, och :meth:`~sqlite3.Connection.load_extension`. (Bidrag från Erlend E. Aasland i :issue:`43762`.)

source: sys
sv: system

source: Add :data:`sys.orig_argv` attribute: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
sv: Lägg till :data:`sys.orig_argv`-attribut: listan över de ursprungliga kommandoradsargumenten som skickas till Python-körprogrammet. (Bidrag från Victor Stinner i :issue:`23427`.)

source: Add :data:`sys.stdlib_module_names`, containing the list of the standard library module names. (Contributed by Victor Stinner in :issue:`42955`.)
sv: Lägg till :data:`sys.stdlib_module_names`, som innehåller en lista över standardbibliotekets modulnamn. (Bidrag från Victor Stinner i :issue:`42955`.)

source: _thread
sv: _tråd

source: :func:`_thread.interrupt_main` now takes an optional signal number to simulate (the default is still :const:`signal.SIGINT`). (Contributed by Antoine Pitrou in :issue:`43356`.)
sv: :func:`_thread.interrupt_main` tar nu ett valfritt signalnummer att simulera (standard är fortfarande :const:`signal.SIGINT`). (Bidrag från Antoine Pitrou i :issue:`43356`.)

source: threading
sv: gängning

source: Add :func:`threading.gettrace` and :func:`threading.getprofile` to retrieve the functions set by :func:`threading.settrace` and :func:`threading.setprofile` respectively. (Contributed by Mario Corchero in :issue:`42251`.)
sv: Lägg till :func:`threading.gettrace` och :func:`threading.getprofile` för att hämta de funktioner som ställts in av :func:`threading.settrace` respektive :func:`threading.setprofile`. (Bidrag från Mario Corchero i :issue:`42251`.)

source: Add :data:`threading.__excepthook__` to allow retrieving the original value of :func:`threading.excepthook` in case it is set to a broken or a different value. (Contributed by Mario Corchero in :issue:`42308`.)
sv: Lägg till :data:`threading.__excepthook__` för att tillåta hämtning av originalvärdet för :func:`threading.excepthook` om det är inställt på ett trasigt eller ett annat värde. (Bidrag från Mario Corchero i :issue:`42308`.)

source: traceback
sv: spårning

source: The :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions can now take an exception object as a positional-only argument. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
sv: Funktionerna :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only` och :func:`~traceback.print_exception` kan nu ta ett undantagsobjekt som ett endast positionellt argument. (Bidrag från Zackery Spytz och Matthias Bussonnier i :issue:`26389`.)

source: types
sv: typer

source: Reintroduce the :data:`types.EllipsisType`, :data:`types.NoneType` and :data:`types.NotImplementedType` classes, providing a new set of types readily interpretable by type checkers. (Contributed by Bas van Beek in :issue:`41810`.)
sv: Återinför klasserna :data:`types.EllipsisType`, :data:`types.NoneType` och :data:`types.NotImplementedType`, vilket ger en ny uppsättning typer som lätt kan tolkas av typkontrollanter. (Bidrag från Bas van Beek i :issue:`41810`.)

source: typing
sv: maskinskrivning

source: For major changes, see :ref:`new-feat-related-type-hints`.
sv: För större ändringar, se :ref:`nya-feat-relaterade-typ-tips`.

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
sv: Beteendet för :class:`typing.Literal` ändrades för att överensstämma med :pep:`586` och för att matcha beteendet hos statiska typkontrollanter som anges i PEP.

source: ``Literal`` now de-duplicates parameters.
sv: ``Literal`` avduplicerar nu parametrar.

source: Equality comparisons between ``Literal`` objects are now order independent.
sv: Jämlikhetsjämförelser mellan ``Literal``-objekt är nu orderoberoende.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
sv: jämförelser av ``Literal`` respekterar nu typer. Till exempel, ``Literal[0] == Literal[False]`` utvärderades tidigare till ``True``. Nu är det ``False``. För att stödja denna förändring stöder den internt använda typcachen nu differentierande typer.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with unhashable parameters will not throw an error::
sv: ``Literal`` objekt kommer nu att ge upphov till ett :exc:`TypeError` undantag under jämlikhetsjämförelser om någon av deras parametrar inte är :term:`hashable`. Notera att deklaration av ``Literal`` med parametrar som inte kan hashas inte kommer att ge upphov till ett fel::

source: >>> from typing import Literal >>> Literal[{0}] >>> Literal[{0}] == Literal[{False}] Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: unhashable type: 'set'
sv: &gt;&gt;&gt; från typing import Literal &gt;&gt;&gt; Literal[{0}] &gt;&gt;&gt; Litteral[{0}] == Litteral[{False}] Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: ohashbar typ: 'set'
