Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: What's New In Python 3.10
sv: Vad är nytt i Python 3.10

source: Editor
sv: Redigerare

source: This article explains the new features in Python 3.10, compared to 3.9. Python 3.10 was released on October 4, 2021. For full details, see the :ref:`changelog <changelog>`.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.10 jämfört med 3.9. Python 3.10 släpptes den 4 oktober 2021. För fullständig information, se :ref:`changelog <changelog>`.

source: Summary -- Release highlights
sv: Sammanfattning -- Release highlights

source: New syntax features:
sv: Nya syntaxfunktioner:

source: :pep:`634`, Structural Pattern Matching: Specification
sv: :pep:`634`, Matchning av strukturella mönster: Specifikation

source: :pep:`635`, Structural Pattern Matching: Motivation and Rationale
sv: :pep:`635`, Matchning av strukturella mönster: Motivation och motivering

source: :pep:`636`, Structural Pattern Matching: Tutorial
sv: :pep:`636`, Matchning av strukturella mönster: handledning

source: :issue:`12782`, Parenthesized context managers are now officially allowed.
sv: :issue:`12782`, Kontexthanterare med parentes är nu officiellt tillåtna.

source: New features in the standard library:
sv: Nya funktioner i standardbiblioteket:

source: :pep:`618`, Add Optional Length-Checking To zip.
sv: :pep:`618`, Lägg till valfri längdkontroll till zip.

source: Interpreter improvements:
sv: Förbättringar av tolkar:

source: :pep:`626`, Precise line numbers for debugging and other tools.
sv: :pep:`626`, Exakta radnummer för felsökning och andra verktyg.

source: New typing features:
sv: Nya funktioner för skrivning:

source: :pep:`604`, Allow writing union types as X | Y
sv: :pep:`604`, Tillåt att skriva unionstyper som X | Y

source: :pep:`612`, Parameter Specification Variables
sv: :pep:`612`, Parameter Specifikation Variabler

source: :pep:`613`, Explicit Type Aliases
sv: :pep:`613`, Explicita typ-alias

source: :pep:`647`, User-Defined Type Guards
sv: :pep:`647`, Användardefinierade typskydd

source: Important deprecations, removals or restrictions:
sv: Viktiga avskrivningar, borttagningar eller begränsningar:

source: :pep:`644`, Require OpenSSL 1.1.1 or newer
sv: :pep:`644`, Kräver OpenSSL 1.1.1 eller nyare

source: :pep:`632`, Deprecate distutils module.
sv: :pep:`632`, Utgå ur distutils modul.

source: :pep:`623`, Deprecate and prepare for the removal of the wstr member in PyUnicodeObject.
sv: :pep:`623`, Avveckla och förbered för borttagandet av wstr-medlemmen i PyUnicodeObject.

source: :pep:`624`, Remove Py_UNICODE encoder APIs
sv: :pep:`624`, Ta bort API:er för Py_UNICODE-kodare

source: :pep:`597`, Add optional EncodingWarning
sv: :pep:`597`, Lägg till valfri EncodingWarning

source: New Features
sv: Nya funktioner

source: Parenthesized context managers
sv: Förvaltare av kontext inom parentes

source: Using enclosing parentheses for continuation across multiple lines in context managers is now supported. This allows formatting a long collection of context managers in multiple lines in a similar way as it was previously possible with import statements. For instance, all these examples are now valid:
sv: Nu finns det stöd för att använda omslutande parenteser för fortsättning över flera rader i kontexthanterare. Detta gör det möjligt att formatera en lång samling kontexthanterare på flera rader på ett liknande sätt som det tidigare var möjligt med import-satser. Till exempel är alla dessa exempel nu giltiga:

source: with (CtxManager() as example): ... with ( CtxManager1(), CtxManager2() ): ... with (CtxManager1() as example, CtxManager2()): ... with (CtxManager1(), CtxManager2() as example): ... with ( CtxManager1() as example1, CtxManager2() as example2 ): ...
sv: med (CtxManager() som exempel): ... med ( CtxManager1(), CtxManager2() ): ... med (CtxManager1() som exempel, CtxManager2()): ... med (CtxManager1(), CtxManager2() som exempel): ... med ( CtxManager1() som exempel1, CtxManager2() som exempel2 ): ...

source: it is also possible to use a trailing comma at the end of the enclosed group:
sv: det är också möjligt att använda ett efterföljande kommatecken i slutet av den bifogade gruppen:

source: with ( CtxManager1() as example1, CtxManager2() as example2, CtxManager3() as example3, ): ...
sv: med ( CtxManager1() som exempel1, CtxManager2() som exempel2, CtxManager3() som exempel3, ): ...

source: This new syntax uses the non LL(1) capacities of the new parser. Check :pep:`617` for more details.
sv: Denna nya syntax använder den nya parserns kapacitet som inte är LL(1). Se :pep:`617` för mer information.

source: (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`12782` and :issue:`40334`.)
sv: (Bidrag från Guido van Rossum, Pablo Galindo och Lysandros Nikolaou i :issue:`12782` och :issue:`40334`.)

source: Better error messages
sv: Bättre felmeddelanden

source: SyntaxErrors
sv: Syntaxfel

source: When parsing code that contains unclosed parentheses or brackets the interpreter now includes the location of the unclosed bracket of parentheses instead of displaying *SyntaxError: unexpected EOF while parsing* or pointing to some incorrect location. For instance, consider the following code (notice the unclosed '{'):
sv: Vid parsning av kod som innehåller oavslutade parenteser eller hakparenteser inkluderar tolken nu platsen för den oavslutade parentesen eller hakparentesen istället för att visa *SyntaxError: unexpected EOF while parsing* eller peka på någon felaktig plats. Tänk till exempel på följande kod (lägg märke till det oavslutade '{'):

source: expected = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, 38: 4, 39: 4, 45: 5, 46: 5, 47: 5, 48: 5, 49: 5, 54: 6, some_other_code = foo()
sv: expected = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, 38: 4, 39: 4, 45: 5, 46: 5, 47: 5, 48: 5, 49: 5, 54: 6, någon_annan_kod = foo()

source: Previous versions of the interpreter reported confusing places as the location of the syntax error:
sv: Tidigare versioner av tolken rapporterade förvirrande platser som platsen för syntaxfelet:

source: File "example.py", line 3 some_other_code = foo() ^ SyntaxError: invalid syntax
sv: Fil "example.py", rad 3 någon_annan_kod = foo() ^ SyntaxError: ogiltig syntax

source: but in Python 3.10 a more informative error is emitted:
sv: men i Python 3.10 avges ett mer informativt fel:

source: File "example.py", line 1 expected = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, ^ SyntaxError: '{' was never closed
sv: Fil "exempel.py", rad 1 expected = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, ^ SyntaxError: '{' stängdes aldrig

source: In a similar way, errors involving unclosed string literals (single and triple quoted) now point to the start of the string instead of reporting EOF/EOL.
sv: På liknande sätt pekar fel som involverar oavslutade stränglitteraler (enkel- och trippelciterade) nu på början av strängen istället för att rapportera EOF/EOL.

source: These improvements are inspired by previous work in the PyPy interpreter.
sv: Dessa förbättringar är inspirerade av tidigare arbete med PyPy-tolken.

source: (Contributed by Pablo Galindo in :issue:`42864` and Batuhan Taskaya in :issue:`40176`.)
sv: (Bidrag från Pablo Galindo i :issue:`42864` och Batuhan Taskaya i :issue:`40176`.)

source: :exc:`SyntaxError` exceptions raised by the interpreter will now highlight the full error range of the expression that constitutes the syntax error itself, instead of just where the problem is detected. In this way, instead of displaying (before Python 3.10):
sv: :exc:`SyntaxError` undantag som tolken gör kommer nu att markera hela felområdet för det uttryck som utgör själva syntaxfelet, istället för bara där problemet upptäcks. På detta sätt, istället för att visa (före Python 3.10):

source: >>> foo(x, z for z in range(10), t, w) File "<stdin>", line 1 foo(x, z for z in range(10), t, w) ^ SyntaxError: Generator expression must be parenthesized
sv: &gt;&gt;&gt; foo(x, z för z i intervall(10), t, w) Fil "<stdin>", rad 1 foo(x, z för z i intervall(10), t, w) ^ Syntaxfel: Generatoruttrycket måste vara inom parentes

source: now Python 3.10 will display the exception as:
sv: nu kommer Python 3.10 att visa undantaget som:

source: >>> foo(x, z for z in range(10), t, w) File "<stdin>", line 1 foo(x, z for z in range(10), t, w) ^^^^^^^^^^^^^^^^^^^^ SyntaxError: Generator expression must be parenthesized
sv: &gt;&gt;&gt; foo(x, z för z i intervall(10), t, w) Fil "<stdin>", rad 1 foo(x, z för z inom intervall(10), t, w) ^^^^^^^^^^^^^^^^^^^^ Syntaxfel: Generatoruttryck måste vara inom parentes

source: This improvement was contributed by Pablo Galindo in :issue:`43914`.
sv: Denna förbättring har gjorts av Pablo Galindo i :issue:`43914`.

source: A considerable amount of new specialized messages for :exc:`SyntaxError` exceptions have been incorporated. Some of the most notable ones are as follows:
sv: En avsevärd mängd nya specialmeddelanden för :exc:`SyntaxError`-undantag har införts. Några av de mest anmärkningsvärda är följande:

source: Missing ``:`` before blocks:
sv: Saknar ``:`` före block:

source: >>> if rocket.position > event_horizon File "<stdin>", line 1 if rocket.position > event_horizon ^ SyntaxError: expected ':'
sv: &gt;&gt;&gt; if rocket.position &gt; event_horizon Fil "<stdin>", rad 1 om raket.position &gt; händelsehorisont ^ SyntaxError: förväntat ':'

source: (Contributed by Pablo Galindo in :issue:`42997`.)
sv: (Bidrag från Pablo Galindo i :issue:`42997`.)

source: Unparenthesised tuples in comprehensions targets:
sv: Oparenthesiserade tupler i förståelsemål:

source: >>> {x,y for x,y in zip('abcd', '1234')} File "<stdin>", line 1 {x,y for x,y in zip('abcd', '1234')} ^ SyntaxError: did you forget parentheses around the comprehension target?
sv: &gt;&gt;&gt; {x,y för x,y i zip('abcd', '1234')} Fil "<stdin>", rad 1 {x,y för x,y i zip('abcd', '1234')} ^ SyntaxError: glömde du parentesen runt förståelsemålet?

source: (Contributed by Pablo Galindo in :issue:`43017`.)
sv: (Bidrag från Pablo Galindo i :issue:`43017`.)

source: Missing commas in collection literals and between expressions:
sv: Kommatecken saknas i samlingslitteraler och mellan uttryck:

source: >>> items = { ... x: 1, ... y: 2 ... z: 3, File "<stdin>", line 3 y: 2 ^ SyntaxError: invalid syntax. Perhaps you forgot a comma?
sv: &gt;&gt;&gt; objekt = { ... x: 1, ... y: 2 ... z: 3, Fil "<stdin>", rad 3 y: 2 ^ SyntaxError: ogiltig syntax. Du kanske glömde ett kommatecken?

source: (Contributed by Pablo Galindo in :issue:`43822`.)
sv: (Bidrag från Pablo Galindo i :issue:`43822`.)

source: Multiple Exception types without parentheses:
sv: Flera undantagstyper utan parenteser:

source: >>> try: ... build_dyson_sphere() ... except NotEnoughScienceError, NotEnoughResourcesError: File "<stdin>", line 3 except NotEnoughScienceError, NotEnoughResourcesError: ^ SyntaxError: multiple exception types must be parenthesized
sv: &gt;&gt;&gt; försök: ... build_dyson_sphere() ... förutom NotEnoughScienceError, NotEnoughResourcesError: Fil "<stdin>", rad 3 except NotEnoughScienceError, NotEnoughResourcesError: ^ SyntaxError: flera undantagstyper måste vara inom parentes

source: (Contributed by Pablo Galindo in :issue:`43149`.)
sv: (Bidrag från Pablo Galindo i :issue:`43149`.)

source: Missing ``:`` and values in dictionary literals:
sv: Saknar ``:`` och värden i ordboksliteraler:

source: >>> values = { ... x: 1, ... y: 2, ... z: ... } File "<stdin>", line 4 z: ^ SyntaxError: expression expected after dictionary key and ':' >>> values = {x:1, y:2, z w:3} File "<stdin>", line 1 values = {x:1, y:2, z w:3} ^ SyntaxError: ':' expected after dictionary key
sv: &gt;&gt;&gt; värden = { ... x: 1, ... y: 2, ... z: ... } Fil "<stdin>", rad 4 z: ^ SyntaxError: uttryck förväntat efter ordboksnyckel och ':' &gt;&gt;&gt; värden = {x:1, y:2, z w:3} Fil "<stdin>", rad 1 värden = {x:1, y:2, z w:3} ^&gt; värden = {x:1, y:2, z w:3} ^ SyntaxError: ':' väntas efter nyckel i ordlistan

source: (Contributed by Pablo Galindo in :issue:`43823`.)
sv: (Bidrag från Pablo Galindo i :issue:`43823`.)

source: ``try`` blocks without ``except`` or ``finally`` blocks:
sv: ``try``-block utan ``except`` eller ``finally``-block:

source: >>> try: ... x = 2 ... something = 3 File "<stdin>", line 3 something = 3 ^^^^^^^^^ SyntaxError: expected 'except' or 'finally' block
sv: &gt;&gt;&gt; försök: ... x = 2 ... något = 3 Fil "<stdin>", rad 3 något = 3 ^^^^^^^^^ SyntaxError: förväntat 'except' eller 'finally' block

source: (Contributed by Pablo Galindo in :issue:`44305`.)
sv: (Bidrag från Pablo Galindo i :issue:`44305`.)

source: Usage of ``=`` instead of ``==`` in comparisons:
sv: Användning av ``=`` istället för ``==`` i jämförelser:

source: >>> if rocket.position = event_horizon: File "<stdin>", line 1 if rocket.position = event_horizon: ^ SyntaxError: cannot assign to attribute here. Maybe you meant '==' instead of '='?
sv: &gt;&gt;&gt; if rocket.position = event_horizon: Fil "<stdin>", rad 1 if rocket.position = event_horizon: ^ SyntaxError: kan inte tilldela till attribut här. Du kanske menade '==' istället för '='?

source: (Contributed by Pablo Galindo in :issue:`43797`.)
sv: (Bidrag från Pablo Galindo i :issue:`43797`.)

source: Usage of ``*`` in f-strings:
sv: Användning av ``*`` i f-strängar:

source: >>> f"Black holes {*all_black_holes} and revelations" File "<stdin>", line 1 (*all_black_holes) ^ SyntaxError: f-string: cannot use starred expression here
sv: &gt;&gt;&gt; f"Svarta hål {*all_black_holes} och avslöjanden" Fil "<stdin>", rad 1 (*alla_svarta_hål) ^ SyntaxError: f-string: kan inte använda ett stjärnmärkt uttryck här

source: (Contributed by Pablo Galindo in :issue:`41064`.)
sv: (Bidrag från Pablo Galindo i :issue:`41064`.)

source: IndentationErrors
sv: Indragningsfel

source: Many :exc:`IndentationError` exceptions now have more context regarding what kind of block was expecting an indentation, including the location of the statement:
sv: Många :exc:`IndentationError`-undantag har nu mer kontext när det gäller vilken typ av block som förväntade sig en indragning, inklusive platsen för uttalandet:

source: >>> def foo(): ... if lel: ... x = 2 File "<stdin>", line 3 x = 2 ^ IndentationError: expected an indented block after 'if' statement in line 2
sv: &gt;&gt;&gt; def foo(): ... om lel: ... x = 2 Fil "<stdin>", rad 3 x = 2 ^ IndentationError: förväntat indraget block efter "if"-satsen på rad 2

source: AttributeErrors
sv: AttributFel

source: When printing :exc:`AttributeError`, :c:func:`!PyErr_Display` will offer suggestions of similar attribute names in the object that the exception was raised from:
sv: Vid utskrift av :exc:`AttributeError` kommer :c:func:`!PyErr_Display` att ge förslag på liknande attributnamn i det objekt som undantaget uppstod från:

source: >>> collections.namedtoplo Traceback (most recent call last): File "<stdin>", line 1, in <module> AttributeError: module 'collections' has no attribute 'namedtoplo'. Did you mean: namedtuple?
sv: &gt;&gt;&gt; samlingar.namedtoplo Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> AttributeError: modulen 'collections' har inget attribut 'namedtoplo'. Menade du: namedtuple?

source: (Contributed by Pablo Galindo in :issue:`38530`.)
sv: (Bidrag från Pablo Galindo i :issue:`38530`.)

source: Notice this won't work if :c:func:`!PyErr_Display` is not called to display the error which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
sv: Observera att detta inte kommer att fungera om :c:func:`!PyErr_Display` inte anropas för att visa felet, vilket kan hända om någon annan anpassad felvisningsfunktion används. Detta är ett vanligt scenario i vissa REPLs som IPython.

source: NameErrors
sv: NamnFel

source: When printing :exc:`NameError` raised by the interpreter, :c:func:`!PyErr_Display` will offer suggestions of similar variable names in the function that the exception was raised from:
sv: Vid utskrift av :exc:`NameError` som uppstått i tolken kommer :c:func:`!PyErr_Display` att ge förslag på liknande variabelnamn i den funktion som undantaget uppstått i:

source: >>> schwarzschild_black_hole = None >>> schwarschild_black_hole Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'schwarschild_black_hole' is not defined. Did you mean: schwarzschild_black_hole?
sv: &gt;&gt;&gt; schwarzschild_black_hole = Ingen &gt;&gt;&gt; schwarschild_svart_hål Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> NameError: namnet 'schwarschild_black_hole' är inte definierat. Menade du: schwarzschild_black_hole?

source: Notice this won't work if :c:func:`!PyErr_Display` is not called to display the error, which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
sv: Observera att detta inte kommer att fungera om :c:func:`!PyErr_Display` inte anropas för att visa felet, vilket kan hända om någon annan anpassad felvisningsfunktion används. Detta är ett vanligt scenario i vissa REPLs som IPython.

source: PEP 626: Precise line numbers for debugging and other tools
sv: PEP 626: Exakta radnummer för felsökning och andra verktyg

source: PEP 626 brings more precise and reliable line numbers for debugging, profiling and coverage tools. Tracing events, with the correct line number, are generated for all lines of code executed and only for lines of code that are executed.
sv: PEP 626 ger mer exakta och tillförlitliga radnummer för verktyg för felsökning, profilering och täckning. Spårningshändelser med korrekt radnummer genereras för alla rader med kod som exekveras och endast för rader med kod som exekveras.

source: The :attr:`~frame.f_lineno` attribute of frame objects will always contain the expected line number.
sv: Attributet :attr:`~frame.f_lineno` för frame-objekt kommer alltid att innehålla det förväntade radnumret.

source: The :attr:`~codeobject.co_lnotab` attribute of :ref:`code objects <code-objects>` is deprecated and will be removed in 3.12. Code that needs to convert from offset to line number should use the new :meth:`~codeobject.co_lines` method instead.
sv: Attributet :attr:`~codeobject.co_lnotab` i :ref:``code objects <code-objects>` är föråldrat och kommer att tas bort i 3.12. Kod som behöver konvertera från offset till radnummer bör använda den nya metoden :meth:`~codeobject.co_lines` istället.

source: PEP 634: Structural Pattern Matching
sv: PEP 634: Matchning av strukturella mönster

source: Structural pattern matching has been added in the form of a *match statement* and *case statements* of patterns with associated actions. Patterns consist of sequences, mappings, primitive data types as well as class instances. Pattern matching enables programs to extract information from complex data types, branch on the structure of data, and apply specific actions based on different forms of data.
sv: Strukturell mönstermatchning har lagts till i form av en *match statement* och *case statements* av mönster med tillhörande åtgärder. Mönster består av sekvenser, mappningar, primitiva datatyper samt klassinstanser. Mönstermatchning gör det möjligt för program att extrahera information från komplexa datatyper, förgrena sig till datastrukturen och tillämpa specifika åtgärder baserat på olika former av data.

source: Syntax and operations
sv: Syntax och operationer

source: The generic syntax of pattern matching is::
sv: Den generiska syntaxen för mönstermatchning är::

source: match subject: case <pattern_1>: <action_1> case <pattern_2>: <action_2> case <pattern_3>: <action_3> case _: <action_wildcard>
sv: matcha ämne: fall <mönster_1>: <åtgärd_1> fall <mönster_2>: <åtgärd_2> fall <mönster_3>: <handling_3> fall _: <handling_viltkort>

source: A match statement takes an expression and compares its value to successive patterns given as one or more case blocks. Specifically, pattern matching operates by:
sv: En match-sats tar ett uttryck och jämför dess värde med på varandra följande mönster som anges i ett eller flera case-block. Specifikt fungerar mönstermatchning genom att:

source: using data with type and shape (the ``subject``)
sv: använda data med typ och form (``ämnet``)

source: evaluating the ``subject`` in the ``match`` statement
sv: utvärdering av ``ämnet`` i ``match``-satsen

source: comparing the subject with each pattern in a ``case`` statement from top to bottom until a match is confirmed.
sv: jämför objektet med varje mönster i en "fall"-förklaring uppifrån och ner tills en matchning bekräftas.

source: executing the action associated with the pattern of the confirmed match
sv: utföra den åtgärd som är associerad med mönstret för den bekräftade matchningen

source: If an exact match is not confirmed, the last case, a wildcard ``_``, if provided, will be used as the matching case. If an exact match is not confirmed and a wildcard case does not exist, the entire match block is a no-op.
sv: Om en exakt matchning inte bekräftas kommer det sista fallet, ett jokertecken ``_``, om det anges, att användas som matchningsfall. Om en exakt matchning inte bekräftas och ett jokerteckenfall inte finns, är hela matchningsblocket en no-op.

source: Declarative approach
sv: Deklarativ metod

source: Readers may be aware of pattern matching through the simple example of matching a subject (data object) to a literal (pattern) with the switch statement found in C, Java or JavaScript (and many other languages). Often the switch statement is used for comparison of an object/expression with case statements containing literals.
sv: Läsarna kanske känner till mönstermatchning genom det enkla exemplet att matcha ett subjekt (dataobjekt) mot en bokstav (mönster) med switch-satsen som finns i C, Java eller JavaScript (och många andra språk). Ofta används switch-satsen för att jämföra ett objekt/uttryck med case-satser som innehåller literaler.

source: More powerful examples of pattern matching can be found in languages such as Scala and Elixir. With structural pattern matching, the approach is "declarative" and explicitly states the conditions (the patterns) for data to match.
sv: Mer kraftfulla exempel på mönstermatchning finns i språk som Scala och Elixir. Med strukturell mönstermatchning är tillvägagångssättet "deklarativt" och anger uttryckligen villkoren (mönstren) för att data ska matcha.

source: While an "imperative" series of instructions using nested "if" statements could be used to accomplish something similar to structural pattern matching, it is less clear than the "declarative" approach. Instead the "declarative" approach states the conditions to meet for a match and is more readable through its explicit patterns. While structural pattern matching can be used in its simplest form comparing a variable to a literal in a case statement, its true value for Python lies in its handling of the subject's type and shape.
sv: Även om en "imperativ" serie instruktioner med nästlade "if"-satser kan användas för att åstadkomma något som liknar strukturell mönstermatchning, är den mindre tydlig än den "deklarativa" metoden. Istället anger den "deklarativa" metoden de villkor som ska uppfyllas för en matchning och är mer läsbar genom sina explicita mönster. Strukturell mönstermatchning kan användas i sin enklaste form för att jämföra en variabel med en bokstav i en case-sats, men dess verkliga värde för Python ligger i hanteringen av ämnets typ och form.

source: Simple pattern: match to a literal
sv: Enkelt mönster: matcha till en bokstav
