Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: (Contributed by Victor Stinner in :issue:`42856`.)
sv: (Bidrag från Victor Stinner i :issue:`42856`.)

source: Add a new :option:`configure --without-static-libpython option <--without-static-libpython>` to not build the ``libpythonMAJOR.MINOR.a`` static library and not install the ``python.o`` object file.
sv: Lägg till ett nytt :option:`configure --without-static-libpython option <--without-static-libpython>` för att inte bygga det statiska biblioteket ``libpythonMAJOR.MINOR.a`` och inte installera objektfilen ``python.o``.

source: (Contributed by Victor Stinner in :issue:`43103`.)
sv: (Bidrag från Victor Stinner i :issue:`43103`.)

source: The ``configure`` script now uses the ``pkg-config`` utility, if available, to detect the location of Tcl/Tk headers and libraries. As before, those locations can be explicitly specified with the ``--with-tcltk-includes`` and ``--with-tcltk-libs`` configuration options. (Contributed by Manolis Stamatogiannakis in :issue:`42603`.)
sv: Skriptet ``configure`` använder nu verktyget ``pkg-config``, om det finns tillgängligt, för att upptäcka platsen för Tcl/Tk-huvuden och -bibliotek. Som tidigare kan dessa platser uttryckligen anges med konfigurationsalternativen ``--with-tcltk-includes`` och ``--with-tcltk-libs``. (Bidrag från Manolis Stamatogiannakis i :issue:`42603`.)

source: Add :option:`--with-openssl-rpath` option to ``configure`` script. The option simplifies building Python with a custom OpenSSL installation, e.g. ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Contributed by Christian Heimes in :issue:`43466`.)
sv: Lägg till :option:`--with-openssl-rpath`-alternativet till ``configure``-skriptet. Alternativet förenklar byggandet av Python med en anpassad OpenSSL-installation, t.ex. ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Bidrag från Christian Heimes i :issue:`43466`.)

source: C API Changes
sv: Ändringar i C API

source: PEP 652: Maintaining the Stable ABI
sv: PEP 652: Upprätthålla en stabil ABI

source: The Stable ABI (Application Binary Interface) for extension modules or embedding Python is now explicitly defined. :ref:`stable` describes C API and ABI stability guarantees along with best practices for using the Stable ABI.
sv: Det stabila ABI:t (Application Binary Interface) för tilläggsmoduler eller inbäddning av Python är nu uttryckligen definierat. :ref:`stable` beskriver stabilitetsgarantier för C API och ABI samt bästa praxis för användning av det stabila ABI:t.

source: (Contributed by Petr Viktorin in :pep:`652` and :issue:`43795`.)
sv: (Bidrag från Petr Viktorin i :pep:`652` och :issue:`43795`.)

source: The result of :c:func:`PyNumber_Index` now always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``. (Contributed by Serhiy Storchaka in :issue:`40792`.)
sv: Resultatet av :c:func:`PyNumber_Index` har nu alltid exakt typ :class:`int`. Tidigare kunde resultatet ha varit en instans av en underklass av ``int``. (Bidrag från Serhiy Storchaka i :issue:`40792`.)

source: Add a new :c:member:`~PyConfig.orig_argv` member to the :c:type:`PyConfig` structure: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
sv: Lägg till en ny :c:member:`~PyConfig.orig_argv`-medlem i :c:type:`PyConfig`-strukturen: listan över de ursprungliga kommandoradsargumenten som skickas till Python-körprogrammet. (Bidrag från Victor Stinner i :issue:`23427`.)

source: The :c:func:`PyDateTime_DATE_GET_TZINFO` and :c:func:`PyDateTime_TIME_GET_TZINFO` macros have been added for accessing the ``tzinfo`` attributes of :class:`datetime.datetime` and :class:`datetime.time` objects. (Contributed by Zackery Spytz in :issue:`30155`.)
sv: Makrot :c:func:`PyDateTime_DATE_GET_TZINFO` och :c:func:`PyDateTime_TIME_GET_TZINFO` har lagts till för åtkomst till attributen ``tzinfo`` för objekten :class:`datetime.datetime` och :class:`datetime.time`. (Bidrag från Zackery Spytz i :issue:`30155`.)

source: Add a :c:func:`PyCodec_Unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
sv: Lägg till en :c:func:`PyCodec_Unregister`-funktion för att avregistrera en codec-sökfunktion. (Bidrag från Hai Shi i :issue:`41842`.)

source: The :c:func:`PyIter_Send` function was added to allow sending value into iterator without raising ``StopIteration`` exception. (Contributed by Vladimir Matveev in :issue:`41756`.)
sv: Funktionen :c:func:`PyIter_Send` lades till för att göra det möjligt att skicka värde till iteratorn utan att utlösa ``StopIteration`` undantag. (Bidrag från Vladimir Matveev i :issue:`41756`.)

source: Add :c:func:`PyUnicode_AsUTF8AndSize` to the limited C API. (Contributed by Alex Gaynor in :issue:`41784`.)
sv: Lägg till :c:func:`PyUnicode_AsUTF8AndSize` till det begränsade C API:et. (Bidrag från Alex Gaynor i :issue:`41784`.)

source: Add :c:func:`PyModule_AddObjectRef` function: similar to :c:func:`PyModule_AddObject` but don't steal a reference to the value on success. (Contributed by Victor Stinner in :issue:`1635741`.)
sv: Lägg till :c:func:`PyModule_AddObjectRef` funktion: liknande :c:func:`PyModule_AddObject` men stjäl inte en referens till värdet vid framgång. (Bidrag från Victor Stinner i :issue:`1635741`.)

source: Add :c:func:`Py_NewRef` and :c:func:`Py_XNewRef` functions to increment the reference count of an object and return the object. (Contributed by Victor Stinner in :issue:`42262`.)
sv: Lägg till funktionerna :c:func:`Py_NewRef` och :c:func:`Py_XNewRef` för att öka referensantalet för ett objekt och returnera objektet. (Bidrag från Victor Stinner i :issue:`42262`.)

source: The :c:func:`PyType_FromSpecWithBases` and :c:func:`PyType_FromModuleAndSpec` functions now accept a single class as the *bases* argument. (Contributed by Serhiy Storchaka in :issue:`42423`.)
sv: Funktionerna :c:func:`PyType_FromSpecWithBases` och :c:func:`PyType_FromModuleAndSpec` accepterar nu en enda klass som argument *bases*. (Bidrag från Serhiy Storchaka i :issue:`42423`.)

source: The :c:func:`PyType_FromModuleAndSpec` function now accepts NULL ``tp_doc`` slot. (Contributed by Hai Shi in :issue:`41832`.)
sv: Funktionen :c:func:`PyType_FromModuleAndSpec` accepterar nu NULL ``tp_doc`` slot. (Bidrag från Hai Shi i :issue:`41832`.)

source: The :c:func:`PyType_GetSlot` function can accept :ref:`static types <static-types>`. (Contributed by Hai Shi and Petr Viktorin in :issue:`41073`.)
sv: Funktionen :c:func:`PyType_GetSlot` kan acceptera :ref:`statiska typer <static-types>`. (Bidrag från Hai Shi och Petr Viktorin i :issue:`41073`.)

source: Add a new :c:func:`PySet_CheckExact` function to the C-API to check if an object is an instance of :class:`set` but not an instance of a subtype. (Contributed by Pablo Galindo in :issue:`43277`.)
sv: Lägg till en ny :c:func:`PySet_CheckExact`-funktion i C-API för att kontrollera om ett objekt är en instans av :class:`set` men inte en instans av en subtyp. (Bidrag från Pablo Galindo i :issue:`43277`.)

source: Add :c:func:`PyErr_SetInterruptEx` which allows passing a signal number to simulate. (Contributed by Antoine Pitrou in :issue:`43356`.)
sv: Lägg till :c:func:`PyErr_SetInterruptEx` som gör det möjligt att skicka ett signalnummer att simulera. (Bidrag från Antoine Pitrou i :issue:`43356`.)

source: The limited C API is now supported if :ref:`Python is built in debug mode <debug-build>` (if the ``Py_DEBUG`` macro is defined). In the limited C API, the :c:func:`Py_INCREF` and :c:func:`Py_DECREF` functions are now implemented as opaque function calls, rather than accessing directly the :c:member:`PyObject.ob_refcnt` member, if Python is built in debug mode and the ``Py_LIMITED_API`` macro targets Python 3.10 or newer. It became possible to support the limited C API in debug mode because the :c:type:`PyObject` structure is the same in release and debug mode since Python 3.8 (see :issue:`36465`).
sv: Det begränsade C API:et stöds nu om :ref:`Python är byggt i felsökningsläge <debug-build>` (om makrot ``Py_DEBUG`` är definierat). I det begränsade C API:et implementeras nu funktionerna :c:func:`Py_INCREF` och :c:func:`Py_DECREF` som opaka funktionsanrop, istället för att direkt komma åt medlemmen :c:member:`PyObject.ob_refcnt`, om Python är byggt i felsökningsläge och makrot ``Py_LIMITED_API`` riktar sig mot Python 3.10 eller senare. Det blev möjligt att stödja det begränsade C API:et i felsökningsläge eftersom :c:type:`PyObject`-strukturen är densamma i release- och felsökningsläge sedan Python 3.8 (se :issue:`36465`).

source: The limited C API is still not supported in the :option:`--with-trace-refs` special build (``Py_TRACE_REFS`` macro). (Contributed by Victor Stinner in :issue:`43688`.)
sv: Det begränsade C-API:et stöds fortfarande inte i specialbygget :option:`--with-trace-refs` (makrot ``Py_TRACE_REFS``). (Bidrag från Victor Stinner i :issue:`43688`.)

source: Add the :c:func:`Py_Is(x, y) <Py_Is>` function to test if the *x* object is the *y* object, the same as ``x is y`` in Python. Add also the :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse` functions to test if an object is, respectively, the ``None`` singleton, the ``True`` singleton or the ``False`` singleton. (Contributed by Victor Stinner in :issue:`43753`.)
sv: Lägg till funktionen :c:func:`Py_Is(x, y) <Py_Is>` för att testa om objektet *x* är objektet *y*, samma sak som ``x är y`` i Python. Lägg också till funktionerna :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse` för att testa om ett objekt är ``None`` singleton, ``True`` singleton eller ``False`` singleton. (Bidrag från Victor Stinner i :issue:`43753`.)

source: Add new functions to control the garbage collector from C code: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. These functions allow to activate, deactivate and query the state of the garbage collector from C code without having to import the :mod:`gc` module.
sv: Lägg till nya funktioner för att styra garbage collector från C-kod: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. Dessa funktioner gör det möjligt att aktivera, avaktivera och fråga om skräpsamlarens tillstånd från C-kod utan att behöva importera modulen :mod:`gc`.

source: Add a new :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` type flag to disallow creating type instances. (Contributed by Victor Stinner in :issue:`43916`.)
sv: Lägg till en ny :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` typflagga för att inte tillåta skapande av typinstanser. (Bidrag från Victor Stinner i :issue:`43916`.)

source: Add a new :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` type flag for creating immutable type objects: type attributes cannot be set nor deleted. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
sv: Lägg till en ny :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` typflagga för att skapa oföränderliga typobjekt: typattribut kan inte ställas in eller tas bort. (Bidrag från Victor Stinner och Erlend E. Aasland i :issue:`43908`.)

source: The ``PY_SSIZE_T_CLEAN`` macro must now be defined to use :c:func:`PyArg_ParseTuple` and :c:func:`Py_BuildValue` formats which use ``#``: ``es#``, ``et#``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` and ``Z#``. See :ref:`arg-parsing` and :pep:`353`. (Contributed by Victor Stinner in :issue:`40943`.)
sv: Makrot ``PY_SSIZE_T_CLEAN`` måste nu definieras för att använda formaten :c:func:`PyArg_ParseTuple` och :c:func:`Py_BuildValue` som använder ``#``: ``es#``, ``et#``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` och ``Z#``. Se :ref:`arg-parsing` och :pep:`353`. (Bidrag från Victor Stinner i :issue:`40943`.)

source: Since :c:func:`Py_REFCNT()` is changed to the inline static function, ``Py_REFCNT(obj) = new_refcnt`` must be replaced with ``Py_SET_REFCNT(obj, new_refcnt)``: see :c:func:`Py_SET_REFCNT()` (available since Python 3.9). For backward compatibility, this macro can be used::
sv: Eftersom :c:func:`Py_REFCNT()` ändras till en inline statisk funktion, måste ``Py_REFCNT(obj) = new_refcnt`` ersättas med ``Py_SET_REFCNT(obj, new_refcnt)``: se :c:func:`Py_SET_REFCNT()` (tillgänglig sedan Python 3.9). För bakåtkompatibilitet kan detta makro användas::

source: (Contributed by Victor Stinner in :issue:`39573`.)
sv: (Bidrag från Victor Stinner i :issue:`39573`.)

source: Calling :c:func:`PyDict_GetItem` without :term:`GIL` held had been allowed for historical reason. It is no longer allowed. (Contributed by Victor Stinner in :issue:`40839`.)
sv: Att anropa :c:func:`PyDict_GetItem` utan :term:`GIL` hade varit tillåtet av historiska skäl. Det är inte längre tillåtet. (Bidrag från Victor Stinner i :issue:`40839`.)

source: ``PyUnicode_FromUnicode(NULL, size)`` and ``PyUnicode_FromStringAndSize(NULL, size)`` raise ``DeprecationWarning`` now. Use :c:func:`PyUnicode_New` to allocate Unicode object without initial data. (Contributed by Inada Naoki in :issue:`36346`.)
sv: ``PyUnicode_FromUnicode(NULL, size)`` och ``PyUnicode_FromStringAndSize(NULL, size)`` ger upphov till ``DeprecationWarning`` nu. Använd :c:func:`PyUnicode_New` för att allokera Unicode-objekt utan initiala data. (Bidrag från Inada Naoki i :issue:`36346`.)

source: The private ``_PyUnicode_Name_CAPI`` structure of the PyCapsule API ``unicodedata.ucnhash_CAPI`` has been moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
sv: Den privata ``_PyUnicode_Name_CAPI``-strukturen i PyCapsule API ``unicodedata.ucnhash_CAPI`` har flyttats till det interna C API. (Bidrag från Victor Stinner i :issue:`42157`.)

source: :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` and :c:func:`Py_GetProgramName` functions now return ``NULL`` if called before :c:func:`Py_Initialize` (before Python is initialized). Use the new :ref:`init-config` API to get the :ref:`init-path-config`. (Contributed by Victor Stinner in :issue:`42260`.)
sv: :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` och :c:func:`Py_GetProgramName` returnerar nu ``NULL`` om de anropas före :c:func:`Py_Initialize` (innan Python har initialiserats). Använd det nya API:et :ref:`init-config` för att hämta :ref:`init-path-config`. (Bidrag från Victor Stinner i :issue:`42260`.)

source: :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` and :c:func:`PyCell_SET` macros can no longer be used as l-value or r-value. For example, ``x = PyList_SET_ITEM(a, b, c)`` and ``PyList_SET_ITEM(a, b, c) = x`` now fail with a compiler error. It prevents bugs like ``if (PyList_SET_ITEM (a, b, c) < 0) ...`` test. (Contributed by Zackery Spytz and Victor Stinner in :issue:`30459`.)
sv: makron :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` och :c:func:`PyCell_SET` kan inte längre användas som l-värde eller r-värde. Till exempel, ``x = PyList_SET_ITEM(a, b, c)`` och ``PyList_SET_ITEM(a, b, c) = x`` misslyckas nu med ett kompilatorfel. Det förhindrar buggar som ``if (PyList_SET_ITEM (a, b, c) < 0) ...`` test. (Bidrag från Zackery Spytz och Victor Stinner i :issue:`30459`.)

source: The non-limited API files ``odictobject.h``, ``parser_interface.h``, ``picklebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug.h``, ``pyfpe.h``, and ``pytime.h`` have been moved to the ``Include/cpython`` directory. These files must not be included directly, as they are already included in ``Python.h``; see :ref:`api-includes`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Nicholas Sim in :issue:`35134`.)
sv: De icke-begränsade API-filerna ``odictobject.h``, ``parser_interface.h``, ``picklebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug.h``, ``pyfpe.h`` och ``pytime.h`` har flyttats till katalogen ``Include/cpython``. Dessa filer får inte inkluderas direkt, eftersom de redan är inkluderade i ``Python.h``; se :ref:`api-includes``. Om de har inkluderats direkt, överväg att inkludera ``Python.h`` istället. (Bidrag från Nicholas Sim i :issue:`35134`.)

source: Use the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` type flag to create immutable type objects. Do not rely on :c:macro:`Py_TPFLAGS_HEAPTYPE` to decide if a type object is mutable or not; check if :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` is set instead. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
sv: Använd typflaggan :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` för att skapa oföränderliga typobjekt. Lita inte på :c:macro:`Py_TPFLAGS_HEAPTYPE` för att avgöra om ett typobjekt är föränderligt eller inte; kontrollera om :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` är satt istället. (Bidrag från Victor Stinner och Erlend E. Aasland i :issue:`43908`.)

source: The undocumented function ``Py_FrozenMain`` has been removed from the limited API. The function is mainly useful for custom builds of Python. (Contributed by Petr Viktorin in :issue:`26241`.)
sv: Den odokumenterade funktionen ``Py_FrozenMain`` har tagits bort från det begränsade API:et. Funktionen är främst användbar för specialbyggda Python. (Bidrag från Petr Viktorin i :issue:`26241`.)

source: The ``PyUnicode_InternImmortal()`` function is now deprecated and will be removed in Python 3.12: use :c:func:`PyUnicode_InternInPlace` instead. (Contributed by Victor Stinner in :issue:`41692`.)
sv: Funktionen ``PyUnicode_InternImmortal()`` är nu föråldrad och kommer att tas bort i Python 3.12: använd :c:func:`PyUnicode_InternInPlace` istället. (Bidrag från Victor Stinner i :issue:`41692`.)

source: Removed ``Py_UNICODE_str*`` functions manipulating ``Py_UNICODE*`` strings. (Contributed by Inada Naoki in :issue:`41123`.)
sv: Tog bort ``Py_UNICODE_str*`` funktioner som manipulerar ``Py_UNICODE*`` strängar. (Bidrag från Inada Naoki i :issue:`41123`.)

source: ``Py_UNICODE_strlen``: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
sv: ``Py_UNICODE_strlen``: använd :c:func:`PyUnicode_GetLength` eller :c:macro:`PyUnicode_GET_LENGTH`

source: ``Py_UNICODE_strcat``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
sv: ``Py_UNICODE_strcat``: använd :c:func:`PyUnicode_CopyCharacters` eller :c:func:`PyUnicode_FromFormat`

source: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
sv: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: använd :c:func:`PyUnicode_CopyCharacters` eller :c:func:`PyUnicode_Substring`

source: ``Py_UNICODE_strcmp``: use :c:func:`PyUnicode_Compare`
sv: ``Py_UNICODE_strcmp``: använd :c:func:`PyUnicode_Compare`

source: ``Py_UNICODE_strncmp``: use :c:func:`PyUnicode_Tailmatch`
sv: ``Py_UNICODE_strncmp``: Använd :c:func:`PyUnicode_Tailmatch``

source: Removed ``PyUnicode_GetMax()``. Please migrate to new (:pep:`393`) APIs. (Contributed by Inada Naoki in :issue:`41103`.)
sv: Tog bort ``PyUnicode_GetMax()``. Vänligen migrera till nya (:pep:`393`) API:er. (Bidrag från Inada Naoki i :issue:`41103`.)

source: Removed ``PyLong_FromUnicode()``. Please migrate to :c:func:`PyLong_FromUnicodeObject`. (Contributed by Inada Naoki in :issue:`41103`.)
sv: Tog bort ``PyLong_FromUnicode()``. Vänligen migrera till :c:func:`PyLong_FromUnicodeObject`. (Bidrag från Inada Naoki i :issue:`41103`.)

source: Removed ``PyUnicode_AsUnicodeCopy()``. Please use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString` (Contributed by Inada Naoki in :issue:`41103`.)
sv: Tog bort ``PyUnicode_AsUnicodeCopy()``. Använd :c:func:`PyUnicode_AsUCS4Copy` eller :c:func:`PyUnicode_AsWideCharString` (Bidrag från Inada Naoki i :issue:`41103`.)

source: Removed ``_Py_CheckRecursionLimit`` variable: it has been replaced by ``ceval.recursion_limit`` of the :c:type:`PyInterpreterState` structure. (Contributed by Victor Stinner in :issue:`41834`.)
sv: Tog bort variabeln ``_Py_CheckRecursionLimit``: den har ersatts av ``ceval.recursion_limit`` i :c:type:`PyInterpreterState`-strukturen. (Bidrag från Victor Stinner i :issue:`41834`.)

source: Removed undocumented macros ``Py_ALLOW_RECURSION`` and ``Py_END_ALLOW_RECURSION`` and the ``recursion_critical`` field of the :c:type:`PyInterpreterState` structure. (Contributed by Serhiy Storchaka in :issue:`41936`.)
sv: Tog bort odokumenterade makron ``Py_ALLOW_RECURSION`` och ``Py_END_ALLOW_RECURSION`` samt fältet ``recursion_critical`` i :c:type:`PyInterpreterState`-strukturen. (Bidrag från Serhiy Storchaka i :issue:`41936`.)

source: Removed the undocumented ``PyOS_InitInterrupts()`` function. Initializing Python already implicitly installs signal handlers: see :c:member:`PyConfig.install_signal_handlers`. (Contributed by Victor Stinner in :issue:`41713`.)
sv: Tog bort den odokumenterade funktionen ``PyOS_InitInterrupts()``. Initialisering av Python installerar redan implicit signalhanterare: se :c:member:`PyConfig.install_signal_handlers`. (Bidrag från Victor Stinner i :issue:`41713`.)

source: Remove the ``PyAST_Validate()`` function. It is no longer possible to build a AST object (``mod_ty`` type) with the public C API. The function was already excluded from the limited C API (:pep:`384`). (Contributed by Victor Stinner in :issue:`43244`.)
sv: Ta bort funktionen ``PyAST_Validate()``. Det är inte längre möjligt att bygga ett AST-objekt (typ ``mod_ty``) med det publika C API:et. Funktionen var redan utesluten från det begränsade C API:et (:pep:`384`). (Bidrag från Victor Stinner i :issue:`43244`.)

source: Remove the ``symtable.h`` header file and the undocumented functions:
sv: Ta bort huvudfilen ``symtable.h`` och de odokumenterade funktionerna:

source: The ``Py_SymtableString()`` function was part the stable ABI by mistake but it could not be used, because the ``symtable.h`` header file was excluded from the limited C API.
sv: Funktionen ``Py_SymtableString()`` ingick av misstag i det stabila ABI:t men kunde inte användas eftersom huvudfilen ``symtable.h`` inte ingick i det begränsade C API:t.

source: Use Python :mod:`symtable` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
sv: Använd Python :mod:`symtable`-modulen istället. (Bidrag från Victor Stinner i :issue:`43244`.)

source: Remove :c:func:`PyOS_ReadlineFunctionPointer` from the limited C API headers and from ``python3.dll``, the library that provides the stable ABI on Windows. Since the function takes a ``FILE*`` argument, its ABI stability cannot be guaranteed. (Contributed by Petr Viktorin in :issue:`43868`.)
sv: Ta bort :c:func:`PyOS_ReadlineFunctionPointer` från de begränsade C API-rubrikerna och från ``python3.dll``, biblioteket som tillhandahåller det stabila ABI:t på Windows. Eftersom funktionen tar ett ``FILE*``-argument kan dess ABI-stabilitet inte garanteras. (Bidrag från Petr Viktorin i :issue:`43868`.)

source: Remove ``ast.h``, ``asdl.h``, and ``Python-ast.h`` header files. These functions were undocumented and excluded from the limited C API. Most names defined by these header files were not prefixed by ``Py`` and so could create names conflicts. For example, ``Python-ast.h`` defined a ``Yield`` macro which was conflict with the ``Yield`` name used by the Windows ``<winbase.h>`` header. Use the Python :mod:`ast` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
sv: Ta bort huvudfilerna ``ast.h``, ``asdl.h`` och ``Python-ast.h``. Dessa funktioner var odokumenterade och exkluderade från det begränsade C API:et. De flesta namn som definierades av dessa header-filer hade inte ``Py`` som prefix och kunde därför skapa namnkonflikter. Till exempel definierade ``Python-ast.h`` ett ``Yield``-makro som var i konflikt med ``Yield``-namnet som används av Windows ``<winbase.h>``-headern. Använd Python :mod:`ast`-modulen istället. (Bidrag från Victor Stinner i :issue:`43244`.)
