Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: Builtin and extension functions that take integer arguments no longer accept :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). (Contributed by Serhiy Storchaka in :issue:`37999`.)
sv: Inbyggda funktioner och tilläggsfunktioner som tar heltalsargument accepterar inte längre :class:`~decimal.Decimal`` s, :class:`~fractions.Fraction`` s och andra objekt som kan konverteras till heltal endast med förlust (t.ex. som har metoden :meth:`~object.__int__` men inte har metoden :meth:`~object.__index__`). (Bidrag från Serhiy Storchaka i :issue:`37999`.)

source: If :func:`object.__ipow__` returns :data:`NotImplemented`, the operator will correctly fall back to :func:`object.__pow__` and :func:`object.__rpow__` as expected. (Contributed by Alex Shkop in :issue:`38302`.)
sv: Om :func:`object.__ipow__` returnerar :data:`NotImplemented`, kommer operatoren att falla tillbaka till :func:`object.__pow__` och :func:`object.__rpow__` som förväntat. (Bidrag från Alex Shkop i :issue:`38302`.)

source: Assignment expressions can now be used unparenthesized within set literals and set comprehensions, as well as in sequence indexes (but not slices).
sv: Tilldelningsuttryck kan nu användas utan parentes inom set-literaler och set-komprehensioner, samt i sekvensindex (men inte i slices).

source: Functions have a new ``__builtins__`` attribute which is used to look for builtin symbols when a function is executed, instead of looking into ``__globals__['__builtins__']``. The attribute is initialized from ``__globals__["__builtins__"]`` if it exists, else from the current builtins. (Contributed by Mark Shannon in :issue:`42990`.)
sv: Funktioner har ett nytt attribut ``__builtins__`` som används för att leta efter inbyggda symboler när en funktion exekveras, istället för att leta i ``__globals__['__builtins__']``. Attributet initialiseras från ``__globals__["__builtins__"]`` om det finns, annars från de aktuella builtins. (Bidrag från Mark Shannon i :issue:`42990`.)

source: Two new builtin functions -- :func:`aiter` and :func:`anext` have been added to provide asynchronous counterparts to :func:`iter` and :func:`next`, respectively. (Contributed by Joshua Bronson, Daniel Pope, and Justin Wang in :issue:`31861`.)
sv: Två nya inbyggda funktioner -- :func:`aiter` och :func:`anext` har lagts till för att tillhandahålla asynkrona motsvarigheter till :func:`iter` respektive :func:`next`. (Bidrag från Joshua Bronson, Daniel Pope och Justin Wang i :issue:`31861`.)

source: Static methods (:func:`@staticmethod <staticmethod>`) and class methods (:func:`@classmethod <classmethod>`) now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__``, ``__annotations__``) and have a new ``__wrapped__`` attribute. Moreover, static methods are now callable as regular functions. (Contributed by Victor Stinner in :issue:`43682`.)
sv: Statiska metoder (:func:`@staticmethod <staticmethod>`) och klassmetoder (:func:`@classmethod <classmethod>`) ärver nu metodattributen (``__module__``, ``__name__``, ``__qualname__``, ``__doc__``, ``__annotations__``) och har ett nytt attribut ``__wrapped__``. Dessutom är statiska metoder nu anropsbara som vanliga funktioner. (Bidrag från Victor Stinner i :issue:`43682`.)

source: Annotations for complex targets (everything beside ``simple name`` targets defined by :pep:`526`) no longer cause any runtime effects with ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42737`.)
sv: Anteckningar för komplexa mål (allt förutom mål med ``enkla namn`` definierade av :pep:`526``) orsakar inte längre några körtidseffekter med ``from __future__ import annotations``. (Bidrag från Batuhan Taskaya i :issue:`42737`.)

source: Class and module objects now lazy-create empty annotations dicts on demand. The annotations dicts are stored in the object’s ``__dict__`` for backwards compatibility. This improves the best practices for working with ``__annotations__``; for more information, please see :ref:`annotations-howto`. (Contributed by Larry Hastings in :issue:`43901`.)
sv: Klass- och modulobjekt skapar nu tomma annotationsdikter på begäran. Dikterna med anteckningar lagras i objektets ``__dict__`` för bakåtkompatibilitet. Detta förbättrar de bästa metoderna för att arbeta med ``__annotations__``; för mer information, se :ref:`annotations-howto`. (Bidrag från Larry Hastings i :issue:`43901`.)

source: Annotations consist of ``yield``, ``yield from``, ``await`` or named expressions are now forbidden under ``from __future__ import annotations`` due to their side effects. (Contributed by Batuhan Taskaya in :issue:`42725`.)
sv: Annoteringar som består av ``yield``, ``yield from``, ``await`` eller namngivna uttryck är nu förbjudna under ``from __future__ import annotations`` på grund av deras bieffekter. (Bidrag från Batuhan Taskaya i :issue:`42725`.)

source: Usage of unbound variables, ``super()`` and other expressions that might alter the processing of symbol table as annotations are now rendered effectless under ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42725`.)
sv: Användning av obundna variabler, ``super()`` och andra uttryck som kan ändra behandlingen av symboltabellen som annoteringar görs nu verkningslösa under ``from __future__ import annotations``. (Bidrag från Batuhan Taskaya i :issue:`42725`.)

source: Hashes of NaN values of both :class:`float` type and :class:`decimal.Decimal` type now depend on object identity. Formerly, they always hashed to ``0`` even though NaN values are not equal to one another. This caused potentially quadratic runtime behavior due to excessive hash collisions when creating dictionaries and sets containing multiple NaNs. (Contributed by Raymond Hettinger in :issue:`43475`.)
sv: Hashar av NaN-värden av både typen :class:`float` och typen :class:`decimal.Decimal` beror nu på objektets identitet. Tidigare hashades de alltid till ``0`` trots att NaN-värden inte är lika med varandra. Detta orsakade potentiellt kvadratiskt körtidsbeteende på grund av överdrivna hashkollisioner när man skapade ordböcker och uppsättningar som innehöll flera NaN-värden. (Bidrag från Raymond Hettinger i :issue:`43475`.)

source: A :exc:`SyntaxError` (instead of a :exc:`NameError`) will be raised when deleting the :const:`__debug__` constant. (Contributed by Donghee Na in :issue:`45000`.)
sv: Ett :exc:`SyntaxError` (istället för ett :exc:`NameError`) kommer att visas när konstanten :const:`__debug__` tas bort. (Bidrag från Donghee Na i :issue:`45000`.)

source: :exc:`SyntaxError` exceptions now have ``end_lineno`` and ``end_offset`` attributes. They will be ``None`` if not determined. (Contributed by Pablo Galindo in :issue:`43914`.)
sv: :exc:`SyntaxError`-undantag har nu attributen ``end_lineno`` och ``end_offset``. De kommer att vara ``None`` om de inte bestäms. (Bidrag från Pablo Galindo i :issue:`43914`.)

source: New Modules
sv: Nya moduler

source: None.
sv: Ingen.

source: Improved Modules
sv: Förbättrade moduler

source: Add missing :meth:`~asyncio.events.AbstractEventLoop.connect_accepted_socket` method. (Contributed by Alex Grönholm in :issue:`41332`.)
sv: Lägg till saknad :meth:`~asyncio.events.AbstractEventLoop.connect_accepted_socket` metod. (Bidrag från Alex Grönholm i :issue:`41332`.)

source: Misleading phrase "optional arguments" was replaced with "options" in argparse help. Some tests might require adaptation if they rely on exact output match. (Contributed by Raymond Hettinger in :issue:`9694`.)
sv: Missvisande fras "valfria argument" ersattes med "alternativ" i argparse-hjälpen. Vissa tester kan kräva anpassning om de förlitar sig på exakt matchning av utdata. (Bidrag från Raymond Hettinger i :issue:`9694`.)

source: The :meth:`~array.array.index` method of :class:`array.array` now has optional *start* and *stop* parameters. (Contributed by Anders Lorentsen and Zackery Spytz in :issue:`31956`.)
sv: Metoden :meth:`~array.array.index` i :class:`array.array` har nu valfria parametrar *start* och *stop*. (Bidrag från Anders Lorentsen och Zackery Spytz i :issue:`31956`.)

source: These modules have been marked as deprecated in their module documentation since Python 3.6. An import-time :class:`DeprecationWarning` has now been added to all three of these modules.
sv: Dessa moduler har markerats som föråldrade i sin moduldokumentation sedan Python 3.6. En import-tid :class:`DeprecationWarning` har nu lagts till för alla dessa tre moduler.

source: base64
sv: bas64

source: Add :func:`base64.b32hexencode` and :func:`base64.b32hexdecode` to support the Base32 Encoding with Extended Hex Alphabet.
sv: Lägg till :func:`base64.b32hexencode` och :func:`base64.b32hexdecode` för att stödja Base32-kodning med utökat Hex-alfabet.

source: Add :meth:`~bdb.Breakpoint.clearBreakpoints` to reset all set breakpoints. (Contributed by Irit Katriel in :issue:`24160`.)
sv: Lägg till :meth:`~bdb.Breakpoint.clearBreakpoints` för att återställa alla inställda brytpunkter. (Bidrag från Irit Katriel i :issue:`24160`.)

source: bisect
sv: halvera

source: Added the possibility of providing a *key* function to the APIs in the :mod:`bisect` module. (Contributed by Raymond Hettinger in :issue:`4356`.)
sv: Lagt till möjligheten att tillhandahålla en *nyckel*-funktion till API:erna i modulen :mod:`bisect`. (Bidrag från Raymond Hettinger i :issue:`4356`.)

source: Add a :func:`codecs.unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
sv: Lägg till en :func:`codecs.unregister`-funktion för att avregistrera en codec-sökfunktion. (Bidrag från Hai Shi i :issue:`41842`.)

source: collections.abc
sv: samlingar.abc

source: The ``__args__`` of the :ref:`parameterized generic <types-genericalias>` for :class:`collections.abc.Callable` are now consistent with :data:`typing.Callable`. :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Note that a :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
sv: ``__args__`` av :ref:`parameterized generic <types-genericalias>`` för :class:`collections.abc.Callable`` är nu konsekvent med :data:`typing.Callable`. :class:`collections.abc.Callable` generic plattar nu ut typ parametrar, liknande vad :data:`typing.Callable` för närvarande gör. Detta innebär att ``collections.abc.Callable[[int, str], str]`` kommer att ha ``__args__`` av ``(int, str, str)``; tidigare var detta ``([int, str], str)``. För att möjliggöra denna ändring kan :class:`types.GenericAlias` nu underklassas, och en underklass kommer att returneras vid subskription av typen :class:`collections.abc.Callable`. Observera att ett :exc:`TypeError` kan uppstå för ogiltiga former av parametrisering av :class:`collections.abc.Callable` som kan ha passerat tyst i Python 3.9. (Bidrag från Ken Jin i :issue:`42195`.)

source: Add a :func:`contextlib.aclosing` context manager to safely close async generators and objects representing asynchronously released resources. (Contributed by Joongi Kim and John Belmonte in :issue:`41229`.)
sv: Lägg till en :func:`contextlib.aclosing` kontexthanterare för att säkert stänga asynkrona generatorer och objekt som representerar asynkront frigjorda resurser. (Bidrag från Joongi Kim och John Belmonte i :issue:`41229`.)

source: Add asynchronous context manager support to :func:`contextlib.nullcontext`. (Contributed by Tom Gringauz in :issue:`41543`.)
sv: Lägg till stöd för asynkron kontexthanterare till :func:`contextlib.nullcontext`. (Bidrag från Tom Gringauz i :issue:`41543`.)

source: Add :class:`~contextlib.AsyncContextDecorator`, for supporting usage of async context managers as decorators.
sv: Lägg till :class:`~contextlib.AsyncContextDecorator`, för att stödja användning av asynkrona kontexthanterare som dekoratorer.

source: curses
sv: förbannelser

source: The extended color functions added in ncurses 6.1 will be used transparently by :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair`, and :func:`curses.pair_content`. A new function, :func:`curses.has_extended_color_support`, indicates whether extended color support is provided by the underlying ncurses library. (Contributed by Jeffrey Kintscher and Hans Petter Jansson in :issue:`36982`.)
sv: De utökade färgfunktionerna som lades till i ncurses 6.1 kommer att användas transparent av :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair` och :func:`curses.pair_content`. En ny funktion, :func:`curses.has_extended_color_support`, anger om utökat färgstöd tillhandahålls av det underliggande ncurses-biblioteket. (Bidrag från Jeffrey Kintscher och Hans Petter Jansson i :issue:`36982`.)

source: The ``BUTTON5_*`` constants are now exposed in the :mod:`curses` module if they are provided by the underlying curses library. (Contributed by Zackery Spytz in :issue:`39273`.)
sv: Konstanterna ``BUTTON5_*`` exponeras nu i modulen :mod:`curses` om de tillhandahålls av det underliggande curses-biblioteket. (Bidrag från Zackery Spytz i :issue:`39273`.)

source: dataclasses
sv: dataklasser

source: Added ``slots`` parameter in :func:`dataclasses.dataclass` decorator. (Contributed by Yurii Karabas in :issue:`42269`)
sv: Lagt till parametern ``slots`` i :func:`dataclasses.dataclass`-dekoratorn. (Bidrag från Yurii Karabas i :issue:`42269`)

source: Keyword-only fields
sv: Fält med endast sökord

source: dataclasses now supports fields that are keyword-only in the generated __init__ method. There are a number of ways of specifying keyword-only fields.
sv: dataclasses stöder nu fält som är nyckelordsbundna i den genererade __init__-metoden. Det finns ett antal olika sätt att ange fält som endast innehåller nyckelord.

source: You can say that every field is keyword-only:
sv: Du kan säga att varje fält är nyckelordsbaserat:

source: from dataclasses import dataclass @dataclass(kw_only=True) class Birthday: name: str birthday: datetime.date
sv: from dataclasses import dataclass @dataklass(kw_only=True) klass Födelsedag: name: str födelsedag: datetime.date

source: Both ``name`` and ``birthday`` are keyword-only parameters to the generated __init__ method.
sv: Både ``name`` och ``birthday`` är keyword-only-parametrar till den genererade __init__-metoden.

source: You can specify keyword-only on a per-field basis:
sv: Du kan ange endast nyckelord för varje fält:

source: from dataclasses import dataclass, field @dataclass class Birthday: name: str birthday: datetime.date = field(kw_only=True)
sv: from dataclasses import dataclass, fält @dataklass klass Födelsedag: name: str birthday: datetime.date = field(kw_only=True)

source: Here only ``birthday`` is keyword-only. If you set ``kw_only`` on individual fields, be aware that there are rules about re-ordering fields due to keyword-only fields needing to follow non-keyword-only fields. See the full dataclasses documentation for details.
sv: Här är det bara ``födelsedag`` som är nyckelordsbundet. Om du anger ``kw_only`` för enskilda fält bör du vara medveten om att det finns regler för omordning av fält på grund av att fält med enbart nyckelord måste följa fält utan nyckelord. Se den fullständiga dokumentationen för dataclasses för mer information.

source: You can also specify that all fields following a KW_ONLY marker are keyword-only. This will probably be the most common usage:
sv: Du kan också ange att alla fält som följer en KW_ONLY-markör endast innehåller nyckelord. Detta är förmodligen den vanligaste användningen:

source: from dataclasses import dataclass, KW_ONLY @dataclass class Point: x: float y: float _: KW_ONLY z: float = 0.0 t: float = 0.0
sv: from dataclasses import dataclass, KW_ONLY @dataklass klass Punkt: x: float y: float _: KW_ONLY z: float = 0,0 t: float = 0.0

source: Here, ``z`` and ``t`` are keyword-only parameters, while ``x`` and ``y`` are not. (Contributed by Eric V. Smith in :issue:`43532`.)
sv: Här är ``z`` och ``t`` parametrar som endast innehåller nyckelord, medan ``x`` och ``y`` inte är det. (Bidrag från Eric V. Smith i :issue:`43532`.)

source: The entire ``distutils`` package is deprecated, to be removed in Python 3.12. Its functionality for specifying package builds has already been completely replaced by third-party packages ``setuptools`` and ``packaging``, and most other commonly used APIs are available elsewhere in the standard library (such as :mod:`platform`, :mod:`shutil`, :mod:`subprocess` or :mod:`sysconfig`). There are no plans to migrate any other functionality from ``distutils``, and applications that are using other functions should plan to make private copies of the code. Refer to :pep:`632` for discussion.
sv: Hela paketet ``distutils`` är föråldrat och kommer att tas bort i Python 3.12. Dess funktionalitet för att specificera paketbyggnader har redan helt ersatts av tredjepartspaketen ``setuptools`` och ``packaging``, och de flesta andra vanligt förekommande API:er finns tillgängliga på andra ställen i standardbiblioteket (t.ex. :mod:`platform`, :mod:`shutil`, :mod:`subprocess` eller :mod:`sysconfig`). Det finns inga planer på att migrera någon annan funktionalitet från ``distutils``, och program som använder andra funktioner bör planera för att göra privata kopior av koden. Se :pep:`632` för diskussion.

source: The ``bdist_wininst`` command deprecated in Python 3.8 has been removed. The ``bdist_wheel`` command is now recommended to distribute binary packages on Windows. (Contributed by Victor Stinner in :issue:`42802`.)
sv: Kommandot ``bdist_wininst`` som är föråldrat i Python 3.8 har tagits bort. Kommandot ``bdist_wheel`` rekommenderas nu för att distribuera binära paket på Windows. (Bidrag från Victor Stinner i :issue:`42802`.)

source: doctest
sv: doktest

source: When a module does not define ``__loader__``, fall back to ``__spec__.loader``. (Contributed by Brett Cannon in :issue:`42133`.)
sv: När en modul inte definierar ``__loader__``, fall tillbaka till ``__spec__.loader``. (Bidrag från Brett Cannon i :issue:`42133`.)

source: encodings
sv: kodningar

source: :func:`encodings.normalize_encoding` now ignores non-ASCII characters. (Contributed by Hai Shi in :issue:`39337`.)
sv: :func:`encodings.normalize_encoding` ignorerar nu icke-ASCII-tecken. (Bidrag från Hai Shi i :issue:`39337`.)

source: :class:`~enum.Enum` :func:`~object.__repr__` now returns ``enum_name.member_name`` and :func:`~object.__str__` now returns ``member_name``. Stdlib enums available as module constants have a :func:`repr` of ``module_name.member_name``. (Contributed by Ethan Furman in :issue:`40066`.)
sv: :class:`~enum.Enum` :func:`~object.__repr__` returnerar nu ``enum_name.member_name`` och :func:`~object.__str__` returnerar nu ``member_name``. Stdlib-enumer som är tillgängliga som modulkonstanter har en :func:`repr` på ``module_name.member_name``. (Bidrag från Ethan Furman i :issue:`40066`.)

source: Add :class:`enum.StrEnum` for enums where all members are strings. (Contributed by Ethan Furman in :issue:`41816`.)
sv: Lägg till :class:`enum.StrEnum` för enumer där alla medlemmar är strängar. (Bidrag från Ethan Furman i :issue:`41816`.)

source: fileinput
sv: filinmatning

source: Add *encoding* and *errors* parameters in :func:`fileinput.input` and :class:`fileinput.FileInput`. (Contributed by Inada Naoki in :issue:`43712`.)
sv: Lägg till parametrarna *encoding* och *errors* i :func:`fileinput.input` och :class:`fileinput.FileInput`. (Bidrag från Inada Naoki i :issue:`43712`.)

source: :func:`fileinput.hook_compressed` now returns :class:`~io.TextIOWrapper` object when *mode* is "r" and file is compressed, like uncompressed files. (Contributed by Inada Naoki in :issue:`5758`.)
sv: :func:`fileinput.hook_compressed` returnerar nu :class:`~io.TextIOWrapper`-objekt när *mode* är "r" och filen är komprimerad, precis som okomprimerade filer. (Bidrag från Inada Naoki i :issue:`5758`.)

source: faulthandler
sv: felhanterare

source: The :mod:`faulthandler` module now detects if a fatal error occurs during a garbage collector collection. (Contributed by Victor Stinner in :issue:`44466`.)
sv: Modulen :mod:`faulthandler` upptäcker nu om ett allvarligt fel inträffar under en garbage collector-insamling. (Bidrag från Victor Stinner i :issue:`44466`.)

source: Add audit hooks for :func:`gc.get_objects`, :func:`gc.get_referrers` and :func:`gc.get_referents`. (Contributed by Pablo Galindo in :issue:`43439`.)
sv: Lägg till revisionskrokar för :func:`gc.get_objects`, :func:`gc.get_referrers` och :func:`gc.get_referents`. (Bidrag från Pablo Galindo i :issue:`43439`.)

source: glob
sv: klot

source: Add the *root_dir* and *dir_fd* parameters in :func:`~glob.glob` and :func:`~glob.iglob` which allow to specify the root directory for searching. (Contributed by Serhiy Storchaka in :issue:`38144`.)
sv: Lägg till parametrarna *root_dir* och *dir_fd* i :func:`~glob.glob` och :func:`~glob.iglob` som gör det möjligt att ange rotkatalogen för sökning. (Bidrag från Serhiy Storchaka i :issue:`38144`.)

source: The hashlib module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
sv: Modulen hashlib kräver OpenSSL 1.1.1 eller nyare. (Bidrag från Christian Heimes i :pep:`644` och :issue:`43669`.)

source: The hashlib module has preliminary support for OpenSSL 3.0.0. (Contributed by Christian Heimes in :issue:`38820` and other issues.)
sv: Modulen hashlib har preliminärt stöd för OpenSSL 3.0.0. (Bidrag från Christian Heimes i :issue:`38820` och andra frågor)

source: The pure-Python fallback of :func:`~hashlib.pbkdf2_hmac` is deprecated. In the future PBKDF2-HMAC will only be available when Python has been built with OpenSSL support. (Contributed by Christian Heimes in :issue:`43880`.)
sv: Den rena Python-fallbacken :func:`~hashlib.pbkdf2_hmac` är föråldrad. I framtiden kommer PBKDF2-HMAC endast att vara tillgängligt när Python har byggts med OpenSSL-stöd. (Bidrag från Christian Heimes i :issue:`43880`.)

source: The hmac module now uses OpenSSL's HMAC implementation internally. (Contributed by Christian Heimes in :issue:`40645`.)
sv: Modulen hmac använder nu OpenSSL:s HMAC-implementering internt. (Bidrag från Christian Heimes i :issue:`40645`.)

source: IDLE and idlelib
sv: IDLE och idlelib

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
sv: Få IDLE att anropa :func:`sys.excepthook` (när den startas utan '-n'). Användarkrokar ignorerades tidigare. (Bidrag från Ken Hilton i :issue:`43008`.)
