Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: Let's look at this example as pattern matching in its simplest form: a value, the subject, being matched to several literals, the patterns. In the example below, ``status`` is the subject of the match statement. The patterns are each of the case statements, where literals represent request status codes. The associated action to the case is executed after a match::
sv: Låt oss se på det här exemplet som mönstermatchning i sin enklaste form: ett värde, ämnet, matchas mot flera litterala värden, mönstren. I exemplet nedan är ``status`` subjektet i matchningssatsen. Mönstren är var och en av fallbeskrivningarna, där bokstäverna representerar statuskoder för begäran. Den åtgärd som är kopplad till fallet utförs efter en matchning::

source: def http_error(status): match status: case 400: return "Bad request" case 404: return "Not found" case 418: return "I'm a teapot" case _: return "Something's wrong with the internet"
sv: def http_error(status): matcha status: fall 400: returnera "Dålig förfrågan" fall 404: returnera "Hittades inte" fall 418: returnera "Jag är en tekanna" fall _: returnerar "Något är fel med internet"

source: If the above function is passed a ``status`` of 418, "I'm a teapot" is returned. If the above function is passed a ``status`` of 500, the case statement with ``_`` will match as a wildcard, and "Something's wrong with the internet" is returned. Note the last block: the variable name, ``_``, acts as a *wildcard* and insures the subject will always match. The use of ``_`` is optional.
sv: Om ovanstående funktion får en ``status`` på 418 returneras "I'm a teapot". Om ovanstående funktion får en ``status`` på 500, kommer case-satsen med ``_`` att matchas som ett jokertecken och "Något är fel med internet" returneras. Observera det sista blocket: variabelnamnet ``_`` fungerar som ett *jokertecken* och säkerställer att ämnet alltid kommer att matcha. Användningen av ``_`` är valfri.

source: You can combine several literals in a single pattern using ``|`` ("or")::
sv: Du kan kombinera flera literaler i ett enda mönster med hjälp av ``|`` ("eller")::

source: case 401 | 403 | 404: return "Not allowed"
sv: fall 401 | 403 | 404: return "Inte tillåtet"

source: Behavior without the wildcard
sv: Beteende utan jokertecken

source: If we modify the above example by removing the last case block, the example becomes::
sv: Om vi ändrar ovanstående exempel genom att ta bort det sista fallblocket blir exemplet::

source: def http_error(status): match status: case 400: return "Bad request" case 404: return "Not found" case 418: return "I'm a teapot"
sv: def http_error(status): matcha status: fall 400: returnera "Dålig förfrågan" fall 404: returnera "Hittades inte" fall 418: returnera "Jag är en tekanna"

source: Without the use of ``_`` in a case statement, a match may not exist. If no match exists, the behavior is a no-op. For example, if ``status`` of 500 is passed, a no-op occurs.
sv: Utan användning av ``_`` i en case-sats kan det hända att det inte finns någon matchning. Om det inte finns någon matchning är beteendet en no-op. Om t.ex. ``status`` 500 skickas, inträffar en no-op.

source: Patterns with a literal and variable
sv: Mönster med bokstav och variabel

source: Patterns can look like unpacking assignments, and a pattern may be used to bind variables. In this example, a data point can be unpacked to its x-coordinate and y-coordinate::
sv: Mönster kan se ut som uppackningsuppdrag, och ett mönster kan användas för att binda variabler. I det här exemplet kan en datapunkt packas upp till dess x-koordinat och y-koordinat::

source: # point is an (x, y) tuple match point: case (0, 0): print("Origin") case (0, y): print(f"Y={y}") case (x, 0): print(f"X={x}") case (x, y): print(f"X={x}, Y={y}") case _: raise ValueError("Not a point")
sv: # punkten är en (x, y) tupel matcha punkten: fall (0, 0): print("Ursprung") fall (0, y): print(f"Y={y}") fall (x, 0): print(f"X={x}") fall (x, y): print(f"X={x}, Y={y}") fall _: raise ValueError("Inte en punkt")

source: The first pattern has two literals, ``(0, 0)``, and may be thought of as an extension of the literal pattern shown above. The next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
sv: Det första mönstret har två literaler, ``(0, 0)``, och kan ses som en utvidgning av det literala mönstret som visas ovan. De två följande mönstren kombinerar en bokstav och en variabel, och variabeln *binder* ett värde från subjektet (``point``). Det fjärde mönstret fångar upp två värden, vilket gör att det konceptuellt liknar uppackningsuppgiften ``(x, y) = point``.

source: Patterns and classes
sv: Mönster och klasser

source: If you are using classes to structure your data, you can use as a pattern the class name followed by an argument list resembling a constructor. This pattern has the ability to capture instance attributes into variables::
sv: Om du använder klasser för att strukturera dina data kan du som mönster använda klassnamnet följt av en argumentlista som liknar en konstruktor. Det här mönstret har möjlighet att fånga upp instansattribut i variabler::

source: class Point: def __init__(self, x, y): self.x = x self.y = y def location(point): match point: case Point(x=0, y=0): print("Origin is the point's location.") case Point(x=0, y=y): print(f"Y={y} and the point is on the y-axis.") case Point(x=x, y=0): print(f"X={x} and the point is on the x-axis.") case Point(): print("The point is located somewhere else on the plane.") case _: print("Not a point")
sv: klass Punkt: def __init__(self, x, y): self.x = x self.y = y def location(punkt): matcha punkt: fall Punkt(x=0, y=0): print("Ursprung är punktens position.") fall Punkt(x=0, y=y): print(f"Y={y} och punkten ligger på y-axeln.") fall Punkt(x=x, y=0): print(f"X={x} och punkten ligger på x-axeln.") fall Punkt(): print("Punkten är placerad någon annanstans på planet.") fall _: print("Inte en punkt")

source: Patterns with positional parameters
sv: Mönster med positionella parametrar

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
sv: Du kan använda positionella parametrar med vissa inbyggda klasser som ger en ordning för sina attribut (t.ex. dataklasser). Du kan också definiera en specifik position för attribut i mönster genom att ställa in specialattributet ``__match_args__`` i dina klasser. Om det är inställt på ("x", "y") är följande mönster alla likvärdiga (och alla binder attributet ``y`` till variabeln ``var``)::

source: Point(1, var) Point(1, y=var) Point(x=1, y=var) Point(y=var, x=1)
sv: Punkt(1, var) Punkt(1, y=var) Punkt(x=1, y=var) Punkt(y=var, x=1)

source: Nested patterns
sv: Nästlade mönster

source: Patterns can be arbitrarily nested. For example, if our data is a short list of points, it could be matched like this::
sv: Mönster kan vara godtyckligt nästlade. Om våra data till exempel är en kort lista med punkter, kan de matchas så här::

source: match points: case []: print("No points in the list.") case [Point(0, 0)]: print("The origin is the only point in the list.") case [Point(x, y)]: print(f"A single point {x}, {y} is in the list.") case [Point(0, y1), Point(0, y2)]: print(f"Two points on the Y axis at {y1}, {y2} are in the list.") case _: print("Something else is found in the list.")
sv: matchningspunkter: fall []: print("Inga punkter i listan.") fall [Punkt(0, 0)]: print("Ursprunget är den enda punkten i listan.") fall [Punkt(x, y)]: print(f"En enda punkt {x}, {y} finns i listan.") fall [Punkt(0, y1), Punkt(0, y2)]: print(f"Två punkter på Y-axeln vid {y1}, {y2} finns i listan.") fall _: print("Något annat finns i listan.")

source: Complex patterns and the wildcard
sv: Komplexa mönster och jokertecken

source: To this point, the examples have used ``_`` alone in the last case statement. A wildcard can be used in more complex patterns, such as ``('error', code, _)``. For example::
sv: Hittills har exemplen använt ``_`` enbart i den sista fallbeskrivningen. Ett jokertecken kan användas i mer komplexa mönster, till exempel ``('error', code, _)``. Till exempel::

source: match test_variable: case ('warning', code, 40): print("A warning has been received.") case ('error', code, _): print(f"An error {code} occurred.")
sv: matcha test_variabel: fall ("varning", kod, 40): print("En varning har mottagits.") fall ("error", kod, _): print(f"Ett fel {code} inträffade.")

source: In the above case, ``test_variable`` will match for ('error', code, 100) and ('error', code, 800).
sv: I ovanstående fall kommer ``test_variable`` att matcha för ('error', kod, 100) och ('error', kod, 800).

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
sv: Vi kan lägga till en "om"-klausul i ett mönster, en s.k. "guard". Om guarden är falsk går ``match`` vidare till att prova nästa fallblock. Observera att värdeinfångning sker innan guarden utvärderas::

source: match point: case Point(x, y) if x == y: print(f"The point is located on the diagonal Y=X at {x}.") case Point(x, y): print(f"Point is not on the diagonal.")
sv: matcha punkt: case Point(x, y) if x == y: print(f"Punkten ligger på diagonalen Y=X vid {x}.") fall Punkt(x, y): print(f"Punkten ligger inte på diagonalen.")

source: Other Key Features
sv: Andra viktiga funktioner

source: Several other key features:
sv: Flera andra viktiga funktioner:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. Technically, the subject must be a sequence. Therefore, an important exception is that patterns don't match iterators. Also, to prevent a common mistake, sequence patterns don't match strings.
sv: Precis som uppackningsuppdrag har tuple- och listmönster exakt samma betydelse och matchar faktiskt godtyckliga sekvenser. Tekniskt sett måste ämnet vara en sekvens. Därför är ett viktigt undantag att mönster inte matchar iteratorer. För att förhindra ett vanligt misstag matchar inte heller sekvensmönster strängar.

source: Sequence patterns support wildcards: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to wildcards in unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
sv: Sekvensmönster har stöd för jokertecken: ``[x, y, *rest]`` och ``(x, y, *rest)`` fungerar på samma sätt som jokertecken i uppackningsuppdrag. Namnet efter ``*`` kan också vara ``_``, så ``(x, y, *_)`` matchar en sekvens med minst två objekt utan att binda de återstående objekten.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dict. Unlike sequence patterns, extra keys are ignored. A wildcard ``**rest`` is also supported. (But ``**_`` would be redundant, so is not allowed.)
sv: Mappningsmönster: ``{"bandwidth": b, "latency": l}`` fångar värdena ``"bandwidth"`` och ``"latency"`` från en dict. Till skillnad från sekvensmönster ignoreras extra nycklar. Ett jokertecken ``**rest`` stöds också. (Men ``**_`` skulle vara överflödigt och är därför inte tillåtet)

source: Subpatterns may be captured using the ``as`` keyword::
sv: Undermönster kan fångas upp med hjälp av nyckelordet ``as``::

source: case (Point(x1, y1), Point(x2, y2) as p2): ...
sv: case (Punkt(x1, y1), Punkt(x2, y2) som p2): ...

source: This binds x1, y1, x2, y2 like you would expect without the ``as`` clause, and p2 to the entire second item of the subject.
sv: Detta binder x1, y1, x2, y2 som du skulle förvänta dig utan klausulen ``som``, och p2 till hela den andra posten i ämnet.

source: Most literals are compared by equality. However, the singletons ``True``, ``False`` and ``None`` are compared by identity.
sv: De flesta literaler jämförs med likhet. Singletonerna ``True``, ``False`` och ``None`` jämförs dock med identitet.

source: Named constants may be used in patterns. These named constants must be dotted names to prevent the constant from being interpreted as a capture variable::
sv: Namngivna konstanter kan användas i mönster. Dessa namngivna konstanter måste vara punkterade namn för att förhindra att konstanten tolkas som en fångstvariabel::

source: from enum import Enum class Color(Enum): RED = 0 GREEN = 1 BLUE = 2 color = Color.GREEN match color: case Color.RED: print("I see red!") case Color.GREEN: print("Grass is green") case Color.BLUE: print("I'm feeling the blues :(")
sv: from enum import Enum klass Färg(Enum): RED = 0 GRÖN = 1 BLÅ = 2 färg = Färg.GRÖN matcha färg: fall Färg.RÖD: print("Jag ser rött!") fall Färg.GRÖN: print("Gräs är grönt") fall Färg.BLÅ: print("Jag känner mig bluesig :(")

source: For the full specification see :pep:`634`. Motivation and rationale are in :pep:`635`, and a longer tutorial is in :pep:`636`.
sv: För fullständig specifikation se :pep:`634`. Motivering och skäl finns i :pep:`635`, och en längre handledning finns i :pep:`636`.

source: Optional ``EncodingWarning`` and ``encoding="locale"`` option
sv: Valfritt alternativ för ``EncodingWarning`` och ``encoding="locale"``

source: The default encoding of :class:`~io.TextIOWrapper` and :func:`open` is platform and locale dependent. Since UTF-8 is used on most Unix platforms, omitting ``encoding`` option when opening UTF-8 files (e.g. JSON, YAML, TOML, Markdown) is a very common bug. For example::
sv: Standardkodningen för :class:`~io.TextIOWrapper` och :func:`open` är plattforms- och lokalberoende. Eftersom UTF-8 används på de flesta Unix-plattformar är det ett mycket vanligt fel att utelämna alternativet ``encoding`` när UTF-8-filer öppnas (t.ex. JSON, YAML, TOML, Markdown). Till exempel::

source: # BUG: "rb" mode or encoding="utf-8" should be used. with open("data.json") as f: data = json.load(f)
sv: # BUG: "rb"-läge eller encoding="utf-8" ska användas. med open("data.json") som f: data = json.load(f)

source: To find this type of bug, an optional ``EncodingWarning`` is added. It is emitted when :data:`sys.flags.warn_default_encoding <sys.flags>` is true and locale-specific default encoding is used.
sv: För att hitta den här typen av fel läggs en valfri ``EncodingWarning`` till. Den skickas ut när :data:`sys.flags.warn_default_encoding <sys.flags>` är true och en lokalspecifik standardkodning används.

source: ``-X warn_default_encoding`` option and :envvar:`PYTHONWARNDEFAULTENCODING` are added to enable the warning.
sv: alternativet ``-X warn_default_encoding`` och :envvar:`PYTHONWARNDEFAULTENCODING` läggs till för att aktivera varningen.

source: See :ref:`io-text-encoding` for more information.
sv: Se :ref:`io-text-encoding` för mer information.

source: New Features Related to Type Hints
sv: Nya funktioner relaterade till typtips

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
sv: Detta avsnitt behandlar större ändringar som påverkar :pep:`484` typtips och modulen :mod:`typing`.

source: PEP 604: New Type Union Operator
sv: PEP 604: Ny typ av union-operator

source: A new type union operator was introduced which enables the syntax ``X | Y``. This provides a cleaner way of expressing 'either type X or type Y' instead of using :class:`typing.Union`, especially in type hints.
sv: En ny typunionoperator introducerades som möjliggör syntaxen ``X | Y``. Detta ger ett renare sätt att uttrycka "antingen typ X eller typ Y" istället för att använda :class:`typing.Union`, särskilt i typtips.

source: In previous versions of Python, to apply a type hint for functions accepting arguments of multiple types, :class:`typing.Union` was used::
sv: I tidigare versioner av Python användes :class:`typing.Union` för att tillämpa en typhint för funktioner som accepterar argument av flera typer:

source: def square(number: Union[int, float]) -> Union[int, float]: return number ** 2
sv: def square(number: Union[int, float]) -> Union[int, float]: returnerar tal ** 2

source: Type hints can now be written in a more succinct manner::
sv: Typtips kan nu skrivas på ett mer kortfattat sätt::

source: def square(number: int | float) -> int | float: return number ** 2
sv: def square(number: int | float) -> int | float: returnerar nummer ** 2

source: This new syntax is also accepted as the second argument to :func:`isinstance` and :func:`issubclass`::
sv: Denna nya syntax accepteras också som det andra argumentet till :func:`isinstance` och :func:`issubclass`::

source: >>> isinstance(1, int | str) True
sv: >>> isinstance(1, int | str) Sant

source: See :ref:`types-union` and :pep:`604` for more details.
sv: Se :ref:`types-union` och :pep:`604` för mer information.

source: (Contributed by Maggie Moss and Philippe Prados in :issue:`41428`, with additions by Yurii Karabas and Serhiy Storchaka in :issue:`44490`.)
sv: (Bidrag från Maggie Moss och Philippe Prados i :issue:`41428`, med tillägg från Yurii Karabas och Serhiy Storchaka i :issue:`44490`.)

source: PEP 612: Parameter Specification Variables
sv: PEP 612: Variabler för parameterspecifikation

source: Two new options to improve the information provided to static type checkers for :pep:`484`\ 's ``Callable`` have been added to the :mod:`typing` module.
sv: Två nya alternativ för att förbättra informationen som tillhandahålls till statiska typkontrollanter för :pep:`484`'s ``Callable`` har lagts till i modulen :mod:`typing`.

source: The first is the parameter specification variable. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. Examples of usage can be found in :class:`typing.ParamSpec`. Previously, there was no easy way to type annotate dependency of parameter types in such a precise manner.
sv: Den första är variabeln för parameterspecifikation. De används för att vidarebefordra parametertyperna för en anropsbar till en annan anropsbar -- ett mönster som är vanligt förekommande i högre ordningens funktioner och dekoratorer. Exempel på användning finns i :class:`typing.ParamSpec`. Tidigare fanns det inget enkelt sätt att typannotera beroendet av parametertyper på ett så exakt sätt.

source: The second option is the new ``Concatenate`` operator. It's used in conjunction with parameter specification variables to type annotate a higher order callable which adds or removes parameters of another callable. Examples of usage can be found in :class:`typing.Concatenate`.
sv: Det andra alternativet är den nya operatorn ``Concatenate``. Den används tillsammans med parameterspecifikationsvariabler för att typannotera en högre ordningens anropsbarhet som lägger till eller tar bort parametrar från en annan anropsbarhet. Exempel på användning finns i :class:`typing.Concatenate`.

source: See :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs`, and :pep:`612` for more details.
sv: Se :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs` och :pep:`612` för mer information.

source: (Contributed by Ken Jin in :issue:`41559`, with minor enhancements by Jelle Zijlstra in :issue:`43783`. PEP written by Mark Mendoza.)
sv: (Bidrag från Ken Jin i :issue:`41559`, med mindre förbättringar av Jelle Zijlstra i :issue:`43783`. PEP skriven av Mark Mendoza.)

source: PEP 613: TypeAlias
sv: PEP 613: TypAlias

source: :pep:`484` introduced the concept of type aliases, only requiring them to be top-level unannotated assignments. This simplicity sometimes made it difficult for type checkers to distinguish between type aliases and ordinary assignments, especially when forward references or invalid types were involved. Compare::
sv: :pep:`484` introducerade konceptet med typalias, men krävde bara att de skulle vara oannoterade tilldelningar på högsta nivån. Denna enkelhet gjorde det ibland svårt för typkontrollanter att skilja mellan typaliaser och vanliga tilldelningar, särskilt när framåtriktade referenser eller ogiltiga typer var inblandade. Jämför::

source: StrCache = 'Cache[str]' # a type alias LOG_PREFIX = 'LOG[DEBUG]' # a module constant
sv: StrCache = 'Cache[str]' # ett typalias LOG_PREFIX = 'LOG[DEBUG]' # en modulkonstant

source: Now the :mod:`typing` module has a special value :data:`~typing.TypeAlias` which lets you declare type aliases more explicitly::
sv: Nu har modulen :mod:`typing` ett speciellt värde :data:`~typing.TypeAlias` som gör att du kan deklarera typaliaser mer explicit::

source: StrCache: TypeAlias = 'Cache[str]' # a type alias LOG_PREFIX = 'LOG[DEBUG]' # a module constant
sv: StrCache: TypeAlias = 'Cache[str]' # ett alias för en typ LOG_PREFIX = 'LOG[DEBUG]' # en modulkonstant

source: See :pep:`613` for more details.
sv: Se :pep:`613` för mer information.

source: (Contributed by Mikhail Golubev in :issue:`41923`.)
sv: (Bidrag från Mikhail Golubev i :issue:`41923`.)

source: PEP 647: User-Defined Type Guards
sv: PEP 647: Användardefinierade typskydd

source: :data:`~typing.TypeGuard` has been added to the :mod:`typing` module to annotate type guard functions and improve information provided to static type checkers during type narrowing. For more information, please see :data:`~typing.TypeGuard`\ 's documentation, and :pep:`647`.
sv: :data:`~typing.TypeGuard` har lagts till i modulen :mod:`typing` för att kommentera typskyddsfunktioner och förbättra informationen till statiska typkontroller under typbegränsning. Mer information finns i dokumentationen för :data:`~typing.TypeGuard` och i :pep:`647`.

source: (Contributed by Ken Jin and Guido van Rossum in :issue:`43766`. PEP written by Eric Traut.)
sv: (Bidrag från Ken Jin och Guido van Rossum i :issue:`43766`. PEP skriven av Eric Traut.)

source: Other Language Changes
sv: Andra språkliga förändringar

source: The :class:`int` type has a new method :meth:`int.bit_count`, returning the number of ones in the binary expansion of a given integer, also known as the population count. (Contributed by Niklas Fiekas in :issue:`29882`.)
sv: Typen :class:`int` har fått en ny metod :meth:`int.bit_count`, som returnerar antalet ettor i den binära expansionen av ett givet heltal, även känt som populationsantalet. (Bidrag från Niklas Fiekas i :issue:`29882`.)

source: The views returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` now all have a ``mapping`` attribute that gives a :class:`types.MappingProxyType` object wrapping the original dictionary. (Contributed by Dennis Sweeney in :issue:`40890`.)
sv: De vyer som returneras av :meth:`dict.keys`, :meth:`dict.values` och :meth:`dict.items` har nu alla ett ``mapping``-attribut som ger ett :class:`types.MappingProxyType``-objekt som omsluter den ursprungliga ordlistan. (Bidrag från Dennis Sweeney i :issue:`40890`.)

source: :pep:`618`: The :func:`zip` function now has an optional ``strict`` flag, used to require that all the iterables have an equal length.
sv: :pep:`618`: Funktionen :func:`zip` har nu en valfri flagga ``strict``, som används för att kräva att alla iterabler har samma längd.
