Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: Remove the compiler and parser functions using ``struct _mod`` type, because the public AST C API was removed:
sv: Ta bort kompilator- och parserfunktionerna som använder typen ``struct _mod``, eftersom det offentliga AST C API:et togs bort:

source: These functions were undocumented and excluded from the limited C API. (Contributed by Victor Stinner in :issue:`43244`.)
sv: Dessa funktioner var odokumenterade och exkluderade från det begränsade C API:et. (Bidrag från Victor Stinner i :issue:`43244`.)

source: Remove the ``pyarena.h`` header file with functions:
sv: Ta bort huvudfilen ``pyarena.h`` med funktioner:

source: These functions were undocumented, excluded from the limited C API, and were only used internally by the compiler. (Contributed by Victor Stinner in :issue:`43244`.)
sv: Dessa funktioner var odokumenterade, exkluderade från det begränsade C API:et och användes endast internt av kompilatorn. (Bidrag från Victor Stinner i :issue:`43244`.)

source: The ``PyThreadState.use_tracing`` member has been removed to optimize Python. (Contributed by Mark Shannon in :issue:`43760`.)
sv: Medlemmen ``PyThreadState.use_tracing`` har tagits bort för att optimera Python. (Bidrag från Mark Shannon i :issue:`43760`.)

source: Notable security feature in 3.10.7
sv: Anmärkningsvärd säkerhetsfunktion i 3.10.7

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
sv: Konvertering mellan :class:`int` och :class:`str` i andra baser än 2 (binär), 4, 8 (oktal), 16 (hexadecimal) eller 32 såsom bas 10 (decimal) ger nu upphov till ett :exc:`ValueError` om antalet siffror i strängform är över en gräns för att undvika potentiella överbelastningsattacker på grund av den algoritmiska komplexiteten. Detta är en begränsning av :cve:`2020-10735`. Den här gränsen kan konfigureras eller inaktiveras med hjälp av en miljövariabel, kommandoradsflagga eller :mod:`sys` API:er. Se dokumentationen :ref:`Längdsbegränsning för konvertering av heltalssträngar <int_max_str_digits>`. Standardgränsen är 4300 siffror i strängform.

source: Notable security feature in 3.10.8
sv: Anmärkningsvärd säkerhetsfunktion i 3.10.8

source: The deprecated :mod:`!mailcap` module now refuses to inject unsafe text (filenames, MIME types, parameters) into shell commands. Instead of using such text, it will warn and act as if a match was not found (or for test commands, as if the test failed). (Contributed by Petr Viktorin in :gh:`98966`.)
sv: Den föråldrade modulen :mod:`!mailcap` vägrar nu att injicera osäker text (filnamn, MIME-typer, parametrar) i skalkommandon. Istället för att använda sådan text kommer den att varna och agera som om en matchning inte hittades (eller för testkommandon, som om testet misslyckades). (Bidrag från Petr Viktorin i :gh:`98966`.)

source: Notable changes in 3.10.12
sv: Noterbara ändringar i 3.10.12

source: tarfile
sv: tarfil

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
sv: Extraktionsmetoderna i :mod:`tarfile` och :func:`shutil.unpack_archive` har ett nytt *filter*-argument som gör det möjligt att begränsa tarfunktioner som kan vara överraskande eller farliga, t.ex. att skapa filer utanför destinationskatalogen. Se :ref:`tarfile-extraction-filter` för detaljer. I Python 3.12 kommer användning utan *filter*-argumentet att visa en :exc:`DeprecationWarning`. I Python 3.14 kommer standardinställningen att ändras till ``'data'``. (Bidrag från Petr Viktorin i :pep:`706`.)
