Repository: yeager/python-docs-sv
Catalog: whatsnew/3.10.po
Languages: sv

source: The undocumented built-in function ``sqlite3.enable_shared_cache`` is now deprecated, scheduled for removal in Python 3.12. Its use is strongly discouraged by the SQLite3 documentation. See `the SQLite3 docs <https://sqlite.org/c3ref/enable_shared_cache.html>`_ for more details. If a shared cache must be used, open the database in URI mode using the ``cache=shared`` query parameter. (Contributed by Erlend E. Aasland in :issue:`24464`.)
sv: Den odokumenterade inbyggda funktionen ``sqlite3.enable_shared_cache`` är nu föråldrad och planeras att tas bort i Python 3.12. Dess användning avråds starkt av SQLite3-dokumentationen. Se ` SQLite3-dokumentationen <https://sqlite.org/c3ref/enable_shared_cache.html>`_ för mer information. Om en delad cache måste användas, öppna databasen i URI-läge med hjälp av frågeparametern ``cache=shared``. (Bidrag från Erlend E. Aasland i :issue:`24464`.)

source: The following ``threading`` methods are now deprecated:
sv: Följande ``threading``-metoder är nu föråldrade:

source: (Contributed by Jelle Zijlstra in :gh:`87889`.)
sv: (Bidrag från Jelle Zijlstra i :gh:`87889`.)

source: :meth:`!pathlib.Path.link_to` is deprecated and slated for removal in Python 3.12. Use :meth:`pathlib.Path.hardlink_to` instead. (Contributed by Barney Gale in :issue:`39950`.)
sv: :meth:`!pathlib.Path.link_to` är föråldrad och kommer att tas bort i Python 3.12. Använd :meth:`pathlib.Path.hardlink_to` istället. (Bidrag från Barney Gale i :issue:`39950`.)

source: ``cgi.log()`` is deprecated and slated for removal in Python 3.12. (Contributed by Inada Naoki in :issue:`41139`.)
sv: ``cgi.log()`` är föråldrad och ska tas bort i Python 3.12. (Bidrag från Inada Naoki i :issue:`41139`.)

source: The following :mod:`ssl` features have been deprecated since Python 3.6, Python 3.7, or OpenSSL 1.1.0 and will be removed in 3.11:
sv: Följande :mod:`ssl`-funktioner har blivit föråldrade sedan Python 3.6, Python 3.7 eller OpenSSL 1.1.0 och kommer att tas bort i 3.11:

source: :data:`!OP_NO_SSLv2`, :data:`!OP_NO_SSLv3`, :data:`!OP_NO_TLSv1`, :data:`!OP_NO_TLSv1_1`, :data:`!OP_NO_TLSv1_2`, and :data:`!OP_NO_TLSv1_3` are replaced by :attr:`~ssl.SSLContext.minimum_version` and :attr:`~ssl.SSLContext.maximum_version`.
sv: :data:`!OP_NO_SSLv2`, :data:`!OP_NO_SSLv3`, :data:`!OP_NO_TLSv1`, :data:`!OP_NO_TLSv1_1`, :data:`!OP_NO_TLSv1_2` och :data:`!OP_NO_TLSv1_3` ersätts av :attr:`~ssl.SSLContext.minimum_version` och :attr:`~ssl.SSLContext.maximum_version`.

source: :data:`!PROTOCOL_SSLv2`, :data:`!PROTOCOL_SSLv3`, :data:`!PROTOCOL_SSLv23`, :data:`!PROTOCOL_TLSv1`, :data:`!PROTOCOL_TLSv1_1`, :data:`!PROTOCOL_TLSv1_2`, and :const:`!PROTOCOL_TLS` are deprecated in favor of :const:`~ssl.PROTOCOL_TLS_CLIENT` and :const:`~ssl.PROTOCOL_TLS_SERVER`
sv: :data:`!PROTOCOL_SSLv2`, :data:`!PROTOCOL_SSLv3`, :data:`!PROTOCOL_SSLv23`, :data:`!PROTOCOL_TLSv1`, :data:`!PROTOCOL_TLSv1_1`, :data:`!PROTOCOL_TLSv1_2`, och :const:`!PROTOCOL_TLS` är föråldrade till förmån för :const:`~ssl.PROTOCOL_TLS_CLIENT` och :const:`~ssl.PROTOCOL_TLS_SERVER`

source: :func:`!wrap_socket` is replaced by :meth:`ssl.SSLContext.wrap_socket`
sv: :func:`!wrap_socket` ersätts av :meth:`ssl.SSLContext.wrap_socket`

source: NPN features like :meth:`ssl.SSLSocket.selected_npn_protocol` and :meth:`ssl.SSLContext.set_npn_protocols` are replaced by ALPN.
sv: NPN-funktioner som :meth:`ssl.SSLSocket.selected_npn_protocol` och :meth:`ssl.SSLContext.set_npn_protocols` ersätts av ALPN.

source: The threading debug (:envvar:`!PYTHONTHREADDEBUG` environment variable) is deprecated in Python 3.10 and will be removed in Python 3.12. This feature requires a :ref:`debug build of Python <debug-build>`. (Contributed by Victor Stinner in :issue:`44584`.)
sv: Threading debug (:envvar:`!PYTHONTHREADDEBUG` miljövariabel) är föråldrad i Python 3.10 och kommer att tas bort i Python 3.12. Denna funktion kräver :ref:`debug build av Python <debug-build>`. (Bidrag från Victor Stinner i :issue:`44584`.)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules will be removed in a future version of Python. Anything belonging to these submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`.)
sv: Import från undermodulerna ``typing.io`` och ``typing.re`` kommer nu att ge upphov till :exc:`DeprecationWarning`. Dessa submoduler kommer att tas bort i en framtida version av Python. Allt som hör till dessa undermoduler bör importeras direkt från :mod:`typing` istället. (Bidrag från Sebastian Rittau i :issue:`38291`.)

source: Removed
sv: Borttagen

source: Removed special methods ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` and ``__rdivmod__`` of the :class:`complex` class. They always raised a :exc:`TypeError`. (Contributed by Serhiy Storchaka in :issue:`41974`.)
sv: Tog bort specialmetoderna ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` och ``__rdivmod__`` i klassen :class:`complex`. De gav alltid upphov till ett :exc:`TypeError`. (Bidrag från Serhiy Storchaka i :issue:`41974`.)

source: The ``ParserBase.error()`` method from the private and undocumented ``_markupbase`` module has been removed. :class:`html.parser.HTMLParser` is the only subclass of ``ParserBase`` and its ``error()`` implementation was already removed in Python 3.5. (Contributed by Berker Peksag in :issue:`31844`.)
sv: Metoden ``ParserBase.error()`` från den privata och odokumenterade modulen ``_markupbase`` har tagits bort. :class:`html.parser.HTMLParser` är den enda underklassen till ``ParserBase`` och dess ``error()`` implementation togs bort redan i Python 3.5. (Bidrag från Berker Peksag i :issue:`31844`.)

source: Removed the ``unicodedata.ucnhash_CAPI`` attribute which was an internal PyCapsule object. The related private ``_PyUnicode_Name_CAPI`` structure was moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
sv: Tog bort attributet ``unicodedata.ucnhash_CAPI`` som var ett internt PyCapsule-objekt. Den relaterade privata ``_PyUnicode_Name_CAPI`` strukturen flyttades till det interna C API. (Bidrag från Victor Stinner i :issue:`42157`.)

source: Removed the ``parser`` module, which was deprecated in 3.9 due to the switch to the new PEG parser, as well as all the C source and header files that were only being used by the old parser, including ``node.h``, ``parser.h``, ``graminit.h`` and ``grammar.h``.
sv: Tog bort modulen ``parser``, som blev föråldrad i 3.9 på grund av bytet till den nya PEG-parsern, samt alla C-käll- och headerfiler som bara användes av den gamla parsern, inklusive ``node.h``, ``parser.h``, ``graminit.h`` och ``grammar.h``.

source: Removed the Public C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags`` and ``PyNode_Compile`` that were deprecated in 3.9 due to the switch to the new PEG parser.
sv: Tog bort de offentliga C API-funktionerna ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags`` och ``PyNode_Compile`` som var föråldrade i 3.9 på grund av bytet till den nya PEG-parsern.

source: Removed the ``formatter`` module, which was deprecated in Python 3.4. It is somewhat obsolete, little used, and not tested. It was originally scheduled to be removed in Python 3.6, but such removals were delayed until after Python 2.7 EOL. Existing users should copy whatever classes they use into their code. (Contributed by Donghee Na and Terry J. Reedy in :issue:`42299`.)
sv: Tog bort modulen ``formatter``, som blev föråldrad i Python 3.4. Den är något föråldrad, används lite och är inte testad. Den var ursprungligen planerad att tas bort i Python 3.6, men sådana borttagningar försenades till efter Python 2.7 EOL. Befintliga användare bör kopiera de klasser de använder till sin kod. (Bidrag från Donghee Na och Terry J. Reedy i :issue:`42299`.)

source: Removed the :c:func:`!PyModule_GetWarningsModule` function that was useless now due to the :mod:`!_warnings` module was converted to a builtin module in 2.6. (Contributed by Hai Shi in :issue:`42599`.)
sv: Tog bort :c:func:`!PyModule_GetWarningsModule`-funktionen som var värdelös nu på grund av att :mod:`!_warnings`-modulen konverterades till en inbyggd modul i 2.6. (Bidrag från Hai Shi i :issue:`42599`.)

source: Remove deprecated aliases to :ref:`collections-abstract-base-classes` from the :mod:`collections` module. (Contributed by Victor Stinner in :issue:`37324`.)
sv: Ta bort föråldrade alias till :ref:`collections-abstract-base-classes` från modulen :mod:`collections`. (Bidrag från Victor Stinner i :issue:`37324`.)

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8. The motivation behind this change is multifold:
sv: Parametern ``loop`` har tagits bort från de flesta av :mod:`asyncios :doc:`högnivå-API <../library/asyncio-api-index>` efter att ha utgått i Python 3.8. Motivationen bakom denna förändring är mångfaldig:

source: This simplifies the high-level API.
sv: Detta förenklar API:et på hög nivå.

source: The functions in the high-level API have been implicitly getting the current thread's running event loop since Python 3.7. There isn't a need to pass the event loop to the API in most normal use cases.
sv: Funktionerna i API:et på hög nivå har implicit hämtat den aktuella trådens löpande händelseslinga sedan Python 3.7. Det finns inget behov av att skicka händelseslingan till API i de flesta normala användningsfall.

source: Event loop passing is error-prone especially when dealing with loops running in different threads.
sv: Event loop passing är felbenäget, särskilt när det handlar om loopar som körs i olika trådar.

source: Note that the low-level API will still accept ``loop``. See :ref:`changes-python-api` for examples of how to replace existing code.
sv: Observera att API:et på låg nivå fortfarande accepterar ``loop``. Se :ref:`changes-python-api` för exempel på hur man ersätter befintlig kod.

source: (Contributed by Yurii Karabas, Andrew Svetlov, Yury Selivanov and Kyle Stanley in :issue:`42392`.)
sv: (Bidrag från Yurii Karabas, Andrew Svetlov, Yury Selivanov och Kyle Stanley i :issue:`42392`.)

source: Porting to Python 3.10
sv: Portning till Python 3.10

source: This section lists previously described changes and other bugfixes that may require changes to your code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Changes in the Python syntax
sv: Ändringar i Python-syntaxen

source: Deprecation warning is now emitted when compiling previously valid syntax if the numeric literal is immediately followed by a keyword (like in ``0in x``). In future releases it will be changed to syntax warning, and finally to a syntax error. To get rid of the warning and make the code compatible with future releases just add a space between the numeric literal and the following keyword. (Contributed by Serhiy Storchaka in :issue:`43833`.)
sv: Deprecation-varning avges nu vid kompilering av tidigare giltig syntax om den numeriska litteralen omedelbart följs av ett nyckelord (som i ``0in x``). I framtida versioner kommer den att ändras till en syntaxvarning och slutligen till ett syntaxfel. För att bli av med varningen och göra koden kompatibel med framtida versioner lägger du bara till ett mellanslag mellan den numeriska litteralen och följande nyckelord. (Bidrag från Serhiy Storchaka i :issue:`43833`.)

source: Changes in the Python API
sv: Ändringar i Python API

source: The *etype* parameters of the :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions in the :mod:`traceback` module have been renamed to *exc*. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
sv: Parametrarna *etype* i funktionerna :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only` och :func:`~traceback.print_exception` i modulen :mod:`traceback` har bytt namn till *exc*. (Bidrag från Zackery Spytz och Matthias Bussonnier i :issue:`26389`.)

source: :mod:`atexit`: At Python exit, if a callback registered with :func:`atexit.register` fails, its exception is now logged. Previously, only some exceptions were logged, and the last exception was always silently ignored. (Contributed by Victor Stinner in :issue:`42639`.)
sv: :mod:`atexit`: Vid Python-exit, om en callback registrerad med :func:`atexit.register` misslyckas, loggas nu dess undantag. Tidigare loggades bara vissa undantag, och det sista undantaget ignorerades alltid tyst. (Bidrag från Victor Stinner i :issue:`42639`.)

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. Furthermore, :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
sv: :class:`collections.abc.Callable` generic plattar nu till typ-parametrar, liknande vad :data:`typing.Callable` gör för närvarande. Detta innebär att ``collections.abc.Callable[[int, str], str]`` kommer att ha ``__args__`` av ``(int, str, str)``; tidigare var detta ``([int, str], str)``. Kod som kommer åt argumenten via :func:`typing.get_args` eller ``__args__`` måste ta hänsyn till denna ändring. Dessutom kan :exc:`TypeError` uppstå för ogiltiga former av parametrisering av :class:`collections.abc.Callable` som kan ha passerat tyst i Python 3.9. (Bidrag från Ken Jin i :issue:`42195`.)

source: :meth:`socket.htons` and :meth:`socket.ntohs` now raise :exc:`OverflowError` instead of :exc:`DeprecationWarning` if the given parameter will not fit in a 16-bit unsigned integer. (Contributed by Erlend E. Aasland in :issue:`42393`.)
sv: :meth:`socket.htons` och :meth:`socket.ntohs` ger nu :exc:`OverflowError` istället för :exc:`DeprecationWarning` om den givna parametern inte ryms i ett 16-bitars osignerat heltal. (Bidrag från Erlend E. Aasland i :issue:`42393`.)

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8.
sv: Parametern ``loop`` har tagits bort från de flesta av :mod:`asyncio`'s :doc:`high-level API <../library/asyncio-api-index>` efter att ha utgått i Python 3.8.

source: A coroutine that currently looks like this::
sv: En coroutine som för närvarande ser ut så här::

source: Should be replaced with this::
sv: Bör ersättas med detta::

source: If ``foo()`` was specifically designed *not* to run in the current thread's running event loop (e.g. running in another thread's event loop), consider using :func:`asyncio.run_coroutine_threadsafe` instead.
sv: Om ``foo()`` specifikt utformats för att *inte* köras i den aktuella trådens pågående händelseslinga (t.ex. körs i en annan tråds händelseslinga), överväg att använda :func:`asyncio.run_coroutine_threadsafe` istället.

source: The :data:`types.FunctionType` constructor now inherits the current builtins if the *globals* dictionary has no ``"__builtins__"`` key, rather than using ``{"None": None}`` as builtins: same behavior as :func:`eval` and :func:`exec` functions. Defining a function with ``def function(...): ...`` in Python is not affected, globals cannot be overridden with this syntax: it also inherits the current builtins. (Contributed by Victor Stinner in :issue:`42990`.)
sv: Konstruktorn :data:`types.FunctionType` ärver nu de aktuella inbyggda funktionerna om *globals*-ordlistan inte har någon ``"__builtins__"``-nyckel, istället för att använda ``{"None": None}`` som inbyggda funktioner: samma beteende som funktionerna :func:`eval` och :func:`exec`. Definiera en funktion med ``def function(...): ...`` i Python påverkas inte, globaler kan inte åsidosättas med denna syntax: den ärver också de aktuella inbyggda funktionerna. (Bidrag från Victor Stinner i :issue:`42990`.)

source: Changes in the C API
sv: Förändringar i C API

source: The C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags``, ``PyNode_Compile`` and the type used by these functions, ``struct _node``, were removed due to the switch to the new PEG parser.
sv: C API-funktionerna ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags``, ``PyNode_Compile`` och den typ som används av dessa funktioner, ``struct _node``, togs bort på grund av bytet till den nya PEG-parsern.

source: Source should be now be compiled directly to a code object using, for example, :c:func:`Py_CompileString`. The resulting code object can then be evaluated using, for example, :c:func:`PyEval_EvalCode`.
sv: Källan bör nu kompileras direkt till ett kodobjekt med hjälp av t.ex. :c:func:`Py_CompileString`. Det resulterande kodobjektet kan sedan utvärderas med hjälp av till exempel :c:func:`PyEval_EvalCode`.

source: Specifically:
sv: Specifikt:

source: A call to ``PyParser_SimpleParseStringFlags`` followed by ``PyNode_Compile`` can be replaced by calling :c:func:`Py_CompileString`.
sv: Ett anrop till ``PyParser_SimpleParseStringFlags`` följt av ``PyNode_Compile`` kan ersättas med ett anrop till :c:func:`Py_CompileString`.

source: There is no direct replacement for ``PyParser_SimpleParseFileFlags``. To compile code from a ``FILE *`` argument, you will need to read the file in C and pass the resulting buffer to :c:func:`Py_CompileString`.
sv: Det finns ingen direkt ersättning för ``PyParser_SimpleParseFileFlags``. För att kompilera kod från ett ``FILE *``-argument måste du läsa filen i C och skicka den resulterande bufferten till :c:func:`Py_CompileString`.

source: To compile a file given a ``char *`` filename, explicitly open the file, read it and compile the result. One way to do this is using the :py:mod:`io` module with :c:func:`PyImport_ImportModule`, :c:func:`PyObject_CallMethod`, :c:func:`PyBytes_AsString` and :c:func:`Py_CompileString`, as sketched below. (Declarations and error handling are omitted.) ::
sv: För att kompilera en fil som ges ett ``char *`` filnamn, öppna filen explicit, läs den och kompilera resultatet. Ett sätt att göra detta är att använda modulen :py:mod:`io` med :c:func:`PyImport_ImportModule`, :c:func:`PyObject_CallMethod`, :c:func:`PyBytes_AsString` och :c:func:`Py_CompileString`, enligt skissen nedan. (Deklarationer och felhantering är utelämnade.) ::

source: io_module = Import_ImportModule("io"); fileobject = PyObject_CallMethod(io_module, "open", "ss", filename, "rb"); source_bytes_object = PyObject_CallMethod(fileobject, "read", ""); result = PyObject_CallMethod(fileobject, "close", ""); source_buf = PyBytes_AsString(source_bytes_object); code = Py_CompileString(source_buf, filename, Py_file_input);
sv: io_module = Import_ImportModule("io"); fileobject = PyObject_CallMethod(io_module, "open", "ss", filnamn, "rb"); source_bytes_object = PyObject_CallMethod(fileobject, "read", ""); result = PyObject_CallMethod(fileobject, "close", ""); source_buf = PyBytes_AsString(source_bytes_object); kod = Py_CompileString(source_buf, filnamn, Py_file_input);

source: For ``FrameObject`` objects, the :attr:`~frame.f_lasti` member now represents a wordcode offset instead of a simple offset into the bytecode string. This means that this number needs to be multiplied by 2 to be used with APIs that expect a byte offset instead (like :c:func:`PyCode_Addr2Line` for example). Notice as well that the :attr:`!f_lasti` member of ``FrameObject`` objects is not considered stable: please use :c:func:`PyFrame_GetLineNumber` instead.
sv: För ``FrameObject``-objekt representerar medlemmen :attr:`~frame.f_lasti`` nu en ordkod-offset istället för en enkel offset i bytecode-strängen. Detta innebär att detta tal måste multipliceras med 2 för att kunna användas med API:er som förväntar sig en byte-offset istället (som till exempel :c:func:`PyCode_Addr2Line`). Observera också att :attr:`!f_lasti`-medlemmen i ``FrameObject``-objekt inte anses vara stabil: använd :c:func:`PyFrame_GetLineNumber` istället.

source: CPython bytecode changes
sv: CPython bytecode-ändringar

source: The ``MAKE_FUNCTION`` instruction now accepts either a dict or a tuple of strings as the function's annotations. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`.)
sv: Instruktionen ``MAKE_FUNCTION`` accepterar nu antingen en dict eller en tupel av strängar som funktionens annoteringar. (Bidrag från Yurii Karabas och Inada Naoki i :issue:`42202`.)

source: Build Changes
sv: Förändringar i byggning

source: :pep:`644`: Python now requires OpenSSL 1.1.1 or newer. OpenSSL 1.0.2 is no longer supported. (Contributed by Christian Heimes in :issue:`43669`.)
sv: :pep:`644`: Python kräver nu OpenSSL 1.1.1 eller nyare. OpenSSL 1.0.2 stöds inte längre. (Bidrag från Christian Heimes i :issue:`43669`.)

source: The C99 functions :c:func:`snprintf` and :c:func:`vsnprintf` are now required to build Python. (Contributed by Victor Stinner in :issue:`36020`.)
sv: C99-funktionerna :c:func:`snprintf` och :c:func:`vsnprintf` krävs nu för att bygga Python. (Bidrag från Victor Stinner i :issue:`36020`.)

source: :mod:`sqlite3` requires SQLite 3.7.15 or higher. (Contributed by Sergey Fedoseev and Erlend E. Aasland in :issue:`40744` and :issue:`40810`.)
sv: :mod:`sqlite3` kräver SQLite 3.7.15 eller senare. (Bidrag från Sergey Fedoseev och Erlend E. Aasland i :issue:`40744` och :issue:`40810`.)

source: The :mod:`atexit` module must now always be built as a built-in module. (Contributed by Victor Stinner in :issue:`42639`.)
sv: Modulen :mod:`atexit` måste nu alltid byggas som en inbyggd modul. (Bidrag från Victor Stinner i :issue:`42639`.)

source: Add :option:`--disable-test-modules` option to the ``configure`` script: don't build nor install test modules. (Contributed by Xavier de Gaye, Thomas Petazzoni and Peixing Xin in :issue:`27640`.)
sv: Lägg till :option:`--disable-test-modules` option till ``configure``-skriptet: bygg eller installera inte testmoduler. (Bidrag från Xavier de Gaye, Thomas Petazzoni och Peixing Xin i :issue:`27640`.)

source: Add :option:`--with-wheel-pkg-dir=PATH option <--with-wheel-pkg-dir>` to the ``./configure`` script. If specified, the :mod:`ensurepip` module looks for ``setuptools`` and ``pip`` wheel packages in this directory: if both are present, these wheel packages are used instead of ensurepip bundled wheel packages.
sv: Lägg till :option:`--with-wheel-pkg-dir=PATH option <--with-wheel-pkg-dir>` till skriptet ``./configure``. Om det anges kommer modulen :mod:`ensurepip` att leta efter hjulpaketen ``setuptools`` och ``pip`` i den här katalogen: om båda finns där kommer dessa hjulpaket att användas istället för de hjulpaket som ingår i ensurepip.

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the ``ensurepip._bundled`` package.
sv: Vissa Linux-distributioners paketeringspolicyer rekommenderar att man inte buntar beroenden. Till exempel installerar Fedora wheel-paket i katalogen ``/usr/share/python-wheels/`` och installerar inte paketet ``ensurepip._bundled``.
