Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: :c:func:`!PyUnicode_AsEncodedObject`: Use :c:func:`PyCodec_Encode` instead.
sv: :c:func:`!PyUnicode_AsEncodedObject`: Använd :c:func:`PyCodec_Encode` istället.

source: :c:func:`!PyUnicode_AsEncodedUnicode`: Use :c:func:`PyCodec_Encode` instead; Note that some codecs (for example, "base64") may return a type other than :class:`bytes`, such as :class:`str`.
sv: :c:func:`!PyUnicode_AsEncodedUnicode`: Använd :c:func:`PyCodec_Encode` istället; Observera att vissa codecs (t.ex. "base64") kan returnera en annan typ än :class:`bytes`, t.ex. :class:`str`.

source: Python initialization functions, deprecated in Python 3.13:
sv: Python-initialiseringsfunktioner, föråldrade i Python 3.13:

source: :c:func:`Py_GetPath`: Use :c:func:`PyConfig_Get("module_search_paths") <PyConfig_Get>` (:data:`sys.path`) instead.
sv: :c:func:`Py_GetPath`: Använd :c:func:`PyConfig_Get("module_search_paths") <PyConfig_Get>` (:data:`sys.path`) istället.

source: :c:func:`Py_GetPrefix`: Use :c:func:`PyConfig_Get("base_prefix") <PyConfig_Get>` (:data:`sys.base_prefix`) instead. Use :c:func:`PyConfig_Get("prefix") <PyConfig_Get>` (:data:`sys.prefix`) if :ref:`virtual environments <venv-def>` need to be handled.
sv: :c:func:`Py_GetPrefix`: Använd :c:func:`PyConfig_Get("base_prefix") <PyConfig_Get>` (:data:`sys.base_prefix`) istället. Använd :c:func:`PyConfig_Get("prefix") <PyConfig_Get>` (:data:`sys.prefix`) om :ref:`virtuella miljöer <venv-def>` behöver hanteras.

source: :c:func:`Py_GetExecPrefix`: Use :c:func:`PyConfig_Get("base_exec_prefix") <PyConfig_Get>` (:data:`sys.base_exec_prefix`) instead. Use :c:func:`PyConfig_Get("exec_prefix") <PyConfig_Get>` (:data:`sys.exec_prefix`) if :ref:`virtual environments <venv-def>` need to be handled.
sv: :c:func:`Py_GetExecPrefix`: Använd :c:func:`PyConfig_Get("base_exec_prefix") <PyConfig_Get>` (:data:`sys.base_exec_prefix`) istället. Använd :c:func:`PyConfig_Get("exec_prefix") <PyConfig_Get>` (:data:`sys.exec_prefix`) om :ref:`virtuella miljöer <venv-def>` behöver hanteras.

source: :c:func:`Py_GetProgramFullPath`: Use :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`) instead.
sv: :c:func:`Py_GetProgramFullPath`: Använd :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`) istället.

source: :c:func:`Py_GetProgramName`: Use :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`) instead.
sv: :c:func:`Py_GetProgramName`: Använd :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`) istället.

source: :c:func:`Py_GetPythonHome`: Use :c:func:`PyConfig_Get("home") <PyConfig_Get>` or the :envvar:`PYTHONHOME` environment variable instead.
sv: :c:func:`Py_GetPythonHome`: Använd :c:func:`PyConfig_Get("home") <PyConfig_Get>` eller miljövariabeln :envvar:`PYTHONHOME` istället.

source: The `pythoncapi-compat project <https://github.com/python/pythoncapi-compat/>`__ can be used to get :c:func:`PyConfig_Get` on Python 3.13 and older.
sv: Projektet `pythoncapi-compat <https://github.com/python/pythoncapi-compat/>`__ kan användas för att få :c:func:`PyConfig_Get` på Python 3.13 och äldre.

source: Functions to configure Python's initialization, deprecated in Python 3.11:
sv: Funktioner för att konfigurera Pythons initialisering, föråldrad i Python 3.11:

source: :c:func:`!PySys_SetArgvEx()`: Set :c:member:`PyConfig.argv` instead.
sv: :c:func:`!PySys_SetArgvEx()`: Ställ in :c:member:`PyConfig.argv` istället.

source: :c:func:`!PySys_SetArgv()`: Set :c:member:`PyConfig.argv` instead.
sv: :c:func:`!PySys_SetArgv()`: Ställ in :c:member:`PyConfig.argv` istället.

source: :c:func:`!Py_SetProgramName()`: Set :c:member:`PyConfig.program_name` instead.
sv: :c:func:`!Py_SetProgramName()`: Ställ in :c:member:`PyConfig.program_name` istället.

source: :c:func:`!Py_SetPythonHome()`: Set :c:member:`PyConfig.home` instead.
sv: :c:func:`!Py_SetPythonHome()`: Ställ in :c:member:`PyConfig.home` istället.

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead.
sv: API:t :c:func:`Py_InitializeFromConfig` bör användas med :c:type:`PyConfig` istället.

source: Global configuration variables:
sv: Variabler för global konfiguration:

source: :c:var:`Py_DebugFlag`: Use :c:member:`PyConfig.parser_debug` or :c:func:`PyConfig_Get("parser_debug") <PyConfig_Get>` instead.
sv: :c:var:`Py_DebugFlag`: Använd :c:member:`PyConfig.parser_debug` eller :c:func:`PyConfig_Get("parser_debug") <PyConfig_Get>` istället.

source: :c:var:`Py_VerboseFlag`: Use :c:member:`PyConfig.verbose` or :c:func:`PyConfig_Get("verbose") <PyConfig_Get>` instead.
sv: :c:var:`Py_VerboseFlag`: Använd :c:member:`PyConfig.verbose` eller :c:func:`PyConfig_Get("verbose") <PyConfig_Get>` istället.

source: :c:var:`Py_QuietFlag`: Use :c:member:`PyConfig.quiet` or :c:func:`PyConfig_Get("quiet") <PyConfig_Get>` instead.
sv: :c:var:`Py_QuietFlag`: Använd :c:member:`PyConfig.quiet` eller :c:func:`PyConfig_Get("quiet") <PyConfig_Get>` istället.

source: :c:var:`Py_InteractiveFlag`: Use :c:member:`PyConfig.interactive` or :c:func:`PyConfig_Get("interactive") <PyConfig_Get>` instead.
sv: :c:var:`Py_InteractiveFlag`: Använd :c:member:`PyConfig.interactive` eller :c:func:`PyConfig_Get("interactive") <PyConfig_Get>` istället.

source: :c:var:`Py_InspectFlag`: Use :c:member:`PyConfig.inspect` or :c:func:`PyConfig_Get("inspect") <PyConfig_Get>` instead.
sv: :c:var:`Py_InspectFlag`: Använd :c:member:`PyConfig.inspect` eller :c:func:`PyConfig_Get("inspect") <PyConfig_Get>` istället.

source: :c:var:`Py_OptimizeFlag`: Use :c:member:`PyConfig.optimization_level` or :c:func:`PyConfig_Get("optimization_level") <PyConfig_Get>` instead.
sv: :c:var:`Py_OptimizeFlag`: Använd :c:member:`PyConfig.optimization_level` eller :c:func:`PyConfig_Get("optimization_level") <PyConfig_Get>` istället.

source: :c:var:`Py_NoSiteFlag`: Use :c:member:`PyConfig.site_import` or :c:func:`PyConfig_Get("site_import") <PyConfig_Get>` instead.
sv: :c:var:`Py_NoSiteFlag`: Använd :c:member:`PyConfig.site_import` eller :c:func:`PyConfig_Get("site_import") <PyConfig_Get>` istället.

source: :c:var:`Py_BytesWarningFlag`: Use :c:member:`PyConfig.bytes_warning` or :c:func:`PyConfig_Get("bytes_warning") <PyConfig_Get>` instead.
sv: :c:var:`Py_BytesWarningFlag`: Använd :c:member:`PyConfig.bytes_warning` eller :c:func:`PyConfig_Get("bytes_warning") <PyConfig_Get>` istället.

source: :c:var:`Py_FrozenFlag`: Use :c:member:`PyConfig.pathconfig_warnings` or :c:func:`PyConfig_Get("pathconfig_warnings") <PyConfig_Get>` instead.
sv: :c:var:`Py_FrozenFlag`: Använd :c:member:`PyConfig.pathconfig_warnings` eller :c:func:`PyConfig_Get("pathconfig_warnings") <PyConfig_Get>` istället.

source: :c:var:`Py_IgnoreEnvironmentFlag`: Use :c:member:`PyConfig.use_environment` or :c:func:`PyConfig_Get("use_environment") <PyConfig_Get>` instead.
sv: :c:var:`Py_IgnoreEnvironmentFlag`: Använd :c:member:`PyConfig.use_environment` eller :c:func:`PyConfig_Get("use_environment") <PyConfig_Get>` istället.

source: :c:var:`Py_DontWriteBytecodeFlag`: Use :c:member:`PyConfig.write_bytecode` or :c:func:`PyConfig_Get("write_bytecode") <PyConfig_Get>` instead.
sv: :c:var:`Py_DontWriteBytecodeFlag`: Använd :c:member:`PyConfig.write_bytecode` eller :c:func:`PyConfig_Get("write_bytecode") <PyConfig_Get>` istället.

source: :c:var:`Py_NoUserSiteDirectory`: Use :c:member:`PyConfig.user_site_directory` or :c:func:`PyConfig_Get("user_site_directory") <PyConfig_Get>` instead.
sv: :c:var:`Py_NoUserSiteDirectory`: Använd :c:member:`PyConfig.user_site_directory` eller :c:func:`PyConfig_Get("user_site_directory") <PyConfig_Get>` istället.

source: :c:var:`Py_UnbufferedStdioFlag`: Use :c:member:`PyConfig.buffered_stdio` or :c:func:`PyConfig_Get("buffered_stdio") <PyConfig_Get>` instead.
sv: :c:var:`Py_UnbufferedStdioFlag`: Använd :c:member:`PyConfig.buffered_stdio` eller :c:func:`PyConfig_Get("buffered_stdio") <PyConfig_Get>` istället.

source: :c:var:`Py_HashRandomizationFlag`: Use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed` or :c:func:`PyConfig_Get("hash_seed") <PyConfig_Get>` instead.
sv: :c:var:`Py_HashRandomizationFlag`: Använd :c:member:`PyConfig.use_hash_seed` och :c:member:`PyConfig.hash_seed` eller :c:func:`PyConfig_Get("hash_seed") <PyConfig_Get>` istället.

source: :c:var:`Py_IsolatedFlag`: Use :c:member:`PyConfig.isolated` or :c:func:`PyConfig_Get("isolated") <PyConfig_Get>` instead.
sv: :c:var:`Py_IsolatedFlag`: Använd :c:member:`PyConfig.isolated` eller :c:func:`PyConfig_Get("isolated") <PyConfig_Get>` istället.

source: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Use :c:member:`PyPreConfig.legacy_windows_fs_encoding` or :c:func:`PyConfig_Get("legacy_windows_fs_encoding") <PyConfig_Get>` instead.
sv: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Använd :c:member:`PyPreConfig.legacy_windows_fs_encoding` eller :c:func:`PyConfig_Get("legacy_windows_fs_encoding") <PyConfig_Get>` istället.

source: :c:var:`Py_LegacyWindowsStdioFlag`: Use :c:member:`PyConfig.legacy_windows_stdio` or :c:func:`PyConfig_Get("legacy_windows_stdio") <PyConfig_Get>` instead.
sv: :c:var:`Py_LegacyWindowsStdioFlag`: Använd :c:member:`PyConfig.legacy_windows_stdio` eller :c:func:`PyConfig_Get("legacy_windows_stdio") <PyConfig_Get>` istället.

source: :c:var:`!Py_FileSystemDefaultEncoding`, :c:var:`!Py_HasFileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` or :c:func:`PyConfig_Get("filesystem_encoding") <PyConfig_Get>` instead.
sv: :c:var:`!Py_FileSystemDefaultEncoding`, :c:var:`!Py_HasFileSystemDefaultEncoding`: Använd :c:member:`PyConfig.filesystem_encoding` eller :c:func:`PyConfig_Get("filesystem_encoding") <PyConfig_Get>` istället.

source: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Use :c:member:`PyConfig.filesystem_errors` or :c:func:`PyConfig_Get("filesystem_errors") <PyConfig_Get>` instead.
sv: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Använd :c:member:`PyConfig.filesystem_errors` eller :c:func:`PyConfig_Get("filesystem_errors") <PyConfig_Get>` istället.

source: :c:var:`!Py_UTF8Mode`: Use :c:member:`PyPreConfig.utf8_mode` or :c:func:`PyConfig_Get("utf8_mode") <PyConfig_Get>` instead. (see :c:func:`Py_PreInitialize`)
sv: :c:var:`!Py_UTF8Mode`: Använd :c:member:`PyPreConfig.utf8_mode` eller :c:func:`PyConfig_Get("utf8_mode") <PyConfig_Get>` istället. (se :c:func:`Py_PreInitialize`)

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` to set these options. Or :c:func:`PyConfig_Get` can be used to get these options at runtime.
sv: API:et :c:func:`Py_InitializeFromConfig` bör användas med :c:type:`PyConfig` för att ställa in dessa alternativ. Eller så kan :c:func:`PyConfig_Get` användas för att hämta dessa alternativ vid körning.

source: The bundled copy of ``libmpdec``.
sv: Den medföljande kopian av ``libmpdec``.

source: Pending removal in Python 3.18
sv: Väntar på borttagning i Python 3.18

source: Deprecated private functions (:gh:`128863`):
sv: Föråldrade privata funktioner (:gh:`128863`):

source: :c:func:`!_PyBytes_Join`: use :c:func:`PyBytes_Join`.
sv: :c:func:`!_PyBytes_Join`: använd :c:func:`PyBytes_Join`.

source: :c:func:`!_PyDict_GetItemStringWithError`: use :c:func:`PyDict_GetItemStringRef`.
sv: :c:func:`!_PyDict_GetItemStringWithError`: använd :c:func:`PyDict_GetItemStringRef`.

source: :c:func:`!_PyLong_Sign()`: use :c:func:`PyLong_GetSign`.
sv: :c:func:`!_PyLong_Sign()`: använd :c:func:`PyLong_GetSign`.

source: :c:func:`!_PyLong_FromDigits` and :c:func:`!_PyLong_New`: use :c:func:`PyLongWriter_Create`.
sv: :c:func:`!_PyLong_FromDigits` och :c:func:`!_PyLong_New`: använd :c:func:`PyLongWriter_Create`.

source: :c:func:`!_PyThreadState_UncheckedGet`: use :c:func:`PyThreadState_GetUnchecked`.
sv: :c:func:`!_PyThreadState_UncheckedGet`: använd :c:func:`PyThreadState_GetUnchecked`.

source: :c:func:`!_PyUnicode_AsString`: use :c:func:`PyUnicode_AsUTF8`.
sv: :c:func:`!_PyUnicode_AsString`: använd :c:func:`PyUnicode_AsUTF8`.

source: :c:func:`!_PyUnicodeWriter_Init`: replace ``_PyUnicodeWriter_Init(&writer)`` with :c:func:`writer = PyUnicodeWriter_Create(0) <PyUnicodeWriter_Create>`.
sv: :c:func:`!_PyUnicodeWriter_Init`: ersätt ``_PyUnicodeWriter_Init(&writer)`` med :c:func:`writer = PyUnicodeWriter_Create(0) <PyUnicodeWriter_Create>`.

source: :c:func:`!_PyUnicodeWriter_Finish`: replace ``_PyUnicodeWriter_Finish(&writer)`` with :c:func:`PyUnicodeWriter_Finish(writer) <PyUnicodeWriter_Finish>`.
sv: :c:func:`!_PyUnicodeWriter_Finish`: ersätt ``_PyUnicodeWriter_Finish(&writer)`` med :c:func:`PyUnicodeWriter_Finish(writer) <PyUnicodeWriter_Finish>`.

source: :c:func:`!_PyUnicodeWriter_Dealloc`: replace ``_PyUnicodeWriter_Dealloc(&writer)`` with :c:func:`PyUnicodeWriter_Discard(writer) <PyUnicodeWriter_Discard>`.
sv: :c:func:`!_PyUnicodeWriter_Dealloc`: ersätt ``_PyUnicodeWriter_Dealloc(&writer)`` med :c:func:`PyUnicodeWriter_Discard(writer) <PyUnicodeWriter_Discard>`.

source: :c:func:`!_PyUnicodeWriter_WriteChar`: replace ``_PyUnicodeWriter_WriteChar(&writer, ch)`` with :c:func:`PyUnicodeWriter_WriteChar(writer, ch) <PyUnicodeWriter_WriteChar>`.
sv: :c:func:`!_PyUnicodeWriter_WriteChar`: ersätt ``_PyUnicodeWriter_WriteChar(&writer, ch)`` med :c:func:`PyUnicodeWriter_WriteChar(writer, ch) <PyUnicodeWriter_WriteChar>`.

source: :c:func:`!_PyUnicodeWriter_WriteStr`: replace ``_PyUnicodeWriter_WriteStr(&writer, str)`` with :c:func:`PyUnicodeWriter_WriteStr(writer, str) <PyUnicodeWriter_WriteStr>`.
sv: :c:func:`!_PyUnicodeWriter_WriteStr`: ersätt ``_PyUnicodeWriter_WriteStr(&writer, str)`` med :c:func:`PyUnicodeWriter_WriteStr(writer, str) <PyUnicodeWriter_WriteStr>`.

source: :c:func:`!_PyUnicodeWriter_WriteSubstring`: replace ``_PyUnicodeWriter_WriteSubstring(&writer, str, start, end)`` with :c:func:`PyUnicodeWriter_WriteSubstring(writer, str, start, end) <PyUnicodeWriter_WriteSubstring>`.
sv: :c:func:`!_PyUnicodeWriter_WriteSubstring`: ersätt ``_PyUnicodeWriter_WriteSubstring(&writer, str, start, end)`` med :c:func:`PyUnicodeWriter_WriteSubstring(writer, str, start, end) <PyUnicodeWriter_WriteSubstring>`.

source: :c:func:`!_PyUnicodeWriter_WriteASCIIString`: replace ``_PyUnicodeWriter_WriteASCIIString(&writer, str)`` with :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.
sv: :c:func:`!_PyUnicodeWriter_WriteASCIIString`: ersätt ``_PyUnicodeWriter_WriteASCIIString(&writer, str)`` med :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.

source: :c:func:`!_PyUnicodeWriter_WriteLatin1String`: replace ``_PyUnicodeWriter_WriteLatin1String(&writer, str)`` with :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.
sv: :c:func:`!_PyUnicodeWriter_WriteLatin1String`: ersätt ``_PyUnicodeWriter_WriteLatin1String(&writer, str)`` med :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.

source: :c:func:`!_PyUnicodeWriter_Prepare`: (no replacement).
sv: :c:func:`!_PyUnicodeWriter_Prepare`: (ingen ersättning).

source: :c:func:`!_PyUnicodeWriter_PrepareKind`: (no replacement).
sv: :c:func:`!_PyUnicodeWriter_PrepareKind`: (ingen ersättning).

source: :c:func:`!_Py_HashPointer`: use :c:func:`Py_HashPointer`.
sv: :c:func:`!_Py_HashPointer`: använd :c:func:`Py_HashPointer`.

source: :c:func:`!_Py_fopen_obj`: use :c:func:`Py_fopen`.
sv: :c:func:`!_Py_fopen_obj`: använd :c:func:`Py_fopen`.

source: The `pythoncapi-compat project <https://github.com/python/pythoncapi-compat/>`__ can be used to get these new public functions on Python 3.13 and older.
sv: Projektet `pythoncapi-compat <https://github.com/python/pythoncapi-compat/>`__ kan användas för att få dessa nya offentliga funktioner på Python 3.13 och äldre.

source: The following APIs are deprecated and will be removed, although there is currently no date scheduled for their removal.
sv: Följande API:er är föråldrade och kommer att tas bort, även om det för närvarande inte finns något datum för när de ska tas bort.

source: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: Unneeded since Python 3.8.
sv: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: Behövs inte sedan Python 3.8.

source: :c:func:`PyErr_Fetch`: Use :c:func:`PyErr_GetRaisedException` instead.
sv: :c:func:`PyErr_Fetch`: Använd :c:func:`PyErr_GetRaisedException` istället.

source: :c:func:`PyErr_NormalizeException`: Use :c:func:`PyErr_GetRaisedException` instead.
sv: :c:func:`PyErr_NormalizeException`: Använd :c:func:`PyErr_GetRaisedException` istället.

source: :c:func:`PyErr_Restore`: Use :c:func:`PyErr_SetRaisedException` instead.
sv: :c:func:`PyErr_Restore`: Använd :c:func:`PyErr_SetRaisedException` istället.

source: :c:func:`PyModule_GetFilename`: Use :c:func:`PyModule_GetFilenameObject` instead.
sv: :c:func:`PyModule_GetFilename`: Använd :c:func:`PyModule_GetFilenameObject` istället.

source: :c:func:`PyOS_AfterFork`: Use :c:func:`PyOS_AfterFork_Child` instead.
sv: :c:func:`PyOS_AfterFork`: Använd :c:func:`PyOS_AfterFork_Child` istället.

source: :c:func:`PySlice_GetIndicesEx`: Use :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` instead.
sv: :c:func:`PySlice_GetIndicesEx`: Använd :c:func:`PySlice_Unpack` och :c:func:`PySlice_AdjustIndices` istället.

source: :c:func:`PyUnicode_READY`: Unneeded since Python 3.12
sv: :c:func:`PyUnicode_READY`: Behövs inte sedan Python 3.12

source: :c:func:`!PyErr_Display`: Use :c:func:`PyErr_DisplayException` instead.
sv: :c:func:`!PyErr_Display`: Använd :c:func:`PyErr_DisplayException` istället.

source: :c:func:`!_PyErr_ChainExceptions`: Use :c:func:`!_PyErr_ChainExceptions1` instead.
sv: :c:func:`!_PyErr_ChainExceptions`: Använd :c:func:`!_PyErr_ChainExceptions1` istället.

source: :c:member:`!PyBytesObject.ob_shash` member: call :c:func:`PyObject_Hash` instead.
sv: :c:member:`!PyBytesObject.ob_shash` member: anropa :c:func:`PyObject_Hash` istället.

source: Thread Local Storage (TLS) API:
sv: API för lokal lagring av trådar (TLS):

source: :c:func:`PyThread_create_key`: Use :c:func:`PyThread_tss_alloc` instead.
sv: :c:func:`PyThread_create_key`: Använd :c:func:`PyThread_tss_alloc` istället.

source: :c:func:`PyThread_delete_key`: Use :c:func:`PyThread_tss_free` instead.
sv: :c:func:`PyThread_delete_key`: Använd :c:func:`PyThread_tss_free` istället.

source: :c:func:`PyThread_set_key_value`: Use :c:func:`PyThread_tss_set` instead.
sv: :c:func:`PyThread_set_key_value`: Använd :c:func:`PyThread_tss_set` istället.

source: :c:func:`PyThread_get_key_value`: Use :c:func:`PyThread_tss_get` instead.
sv: :c:func:`PyThread_get_key_value`: Använd :c:func:`PyThread_tss_get` istället.

source: :c:func:`PyThread_delete_key_value`: Use :c:func:`PyThread_tss_delete` instead.
sv: :c:func:`PyThread_delete_key_value`: Använd :c:func:`PyThread_tss_delete` istället.

source: :c:func:`PyThread_ReInitTLS`: Unneeded since Python 3.7.
sv: :c:func:`PyThread_ReInitTLS`: Behövs inte sedan Python 3.7.

source: Build Changes
sv: Förändringar i byggning

source: ``arm64-apple-ios`` and ``arm64-apple-ios-simulator`` are both now :pep:`11` tier 3 platforms. (:ref:`PEP 730 <whatsnew313-platform-support>` written and implementation contributed by Russell Keith-Magee in :gh:`114099`.)
sv: ``arm64-apple-ios`` och ``arm64-apple-ios-simulator`` är nu båda :pep:`11` tier 3 plattformar. (:ref:`PEP 730 <whatsnew313-platform-support>` skriven och implementerad av Russell Keith-Magee i :gh:`114099`.)

source: ``aarch64-linux-android`` and ``x86_64-linux-android`` are both now :pep:`11` tier 3 platforms. (:ref:`PEP 738 <whatsnew313-platform-support>` written and implementation contributed by Malcolm Smith in :gh:`116622`.)
sv: ``aarch64-linux-android`` och ``x86_64-linux-android`` är nu båda :pep:`11` tier 3 plattformar. (:ref:``PEP 738 <whatsnew313-platform-support>`` skriven och implementationen bidragit av Malcolm Smith i :gh:`116622`.)

source: ``wasm32-wasi`` is now a :pep:`11` tier 2 platform. (Contributed by Brett Cannon in :gh:`115192`.)
sv: ``wasm32-wasi`` är nu en :pep:`11` tier 2 plattform. (Bidrag från Brett Cannon i :gh:`115192`.)

source: ``wasm32-emscripten`` is no longer a :pep:`11` supported platform. (Contributed by Brett Cannon in :gh:`115192`.)
sv: ``wasm32-emscripten`` är inte längre en plattform som stöds av :pep:`11`. (Bidrag från Brett Cannon i :gh:`115192`.)

source: Building CPython now requires a compiler with support for the C11 atomic library, GCC built-in atomic functions, or MSVC interlocked intrinsics.
sv: För att bygga CPython krävs nu en kompilator med stöd för C11 Atomic Library, GCC:s inbyggda atomfunktioner eller MSVC:s interlocked intrinsics.

source: Autoconf 2.71 and aclocal 1.16.5 are now required to regenerate the :file:`configure` script. (Contributed by Christian Heimes in :gh:`89886` and by Victor Stinner in :gh:`112090`.)
sv: Autoconf 2.71 och aclocal 1.16.5 krävs nu för att regenerera :file:`configure`-skriptet. (Bidrag från Christian Heimes i :gh:`89886` och av Victor Stinner i :gh:`112090`.)

source: SQLite 3.15.2 or newer is required to build the :mod:`sqlite3` extension module. (Contributed by Erlend Aasland in :gh:`105875`.)
sv: SQLite 3.15.2 eller nyare krävs för att bygga tilläggsmodulen :mod:`sqlite3`. (Bidrag från Erlend Aasland i :gh:`105875`.)

source: CPython now bundles the `mimalloc library`_ by default. It is licensed under the MIT license; see :ref:`mimalloc license <mimalloc-license>`. The bundled mimalloc has custom changes, see :gh:`113141` for details. (Contributed by Dino Viehland in :gh:`109914`.)
sv: CPython innehåller nu `mimalloc-biblioteket`_ som standard. Det är licensierat under MIT-licensen; se :ref:`mimalloc license <mimalloc-license>`. Den medföljande mimalloc har anpassade ändringar, se :gh:`113141` för detaljer. (Bidrag från Dino Viehland i :gh:`109914`.)

source: The :file:`configure` option :option:`--with-system-libmpdec` now defaults to ``yes``. The bundled copy of ``libmpdec`` will be removed in Python 3.16.
sv: Alternativet :file:`configure` :option:`--with-system-libmpdec` har nu ``yes`` som standard. Den medföljande kopian av ``libmpdec`` kommer att tas bort i Python 3.16.

source: Python built with :file:`configure` :option:`--with-trace-refs` (tracing references) is now ABI compatible with the Python release build and :ref:`debug build <debug-build>`. (Contributed by Victor Stinner in :gh:`108634`.)
sv: Python byggt med :file:`configure` :option:`--with-trace-refs` (spårningsreferenser) är nu ABI-kompatibelt med Python release build och :ref:`debug build <debug-build>`. (Bidrag från Victor Stinner i :gh:`108634`.)

source: On POSIX systems, the pkg-config (``.pc``) filenames now include the ABI flags. For example, the free-threaded build generates ``python-3.13t.pc`` and the debug build generates ``python-3.13d.pc``.
sv: På POSIX-system innehåller filnamnen för pkg-config (``.pc``) nu ABI-flaggorna. Till exempel genererar free-threaded build ``python-3.13t.pc`` och debug build genererar ``python-3.13d.pc``.

source: The ``errno``, ``fcntl``, ``grp``, ``md5``, ``pwd``, ``resource``, ``termios``, ``winsound``, ``_ctypes_test``, ``_multiprocessing.posixshmem``, ``_scproxy``, ``_stat``, ``_statistics``, ``_testconsole``, ``_testimportmultiple`` and ``_uuid`` C extensions are now built with the :ref:`limited C API <limited-c-api>`. (Contributed by Victor Stinner in :gh:`85283`.)
sv: Funktionerna ``errno``, ``fcntl``, ``grp``, ``md5``, ``pwd``, ``resource``, ``termios``, ``winsound``, ``_ctypes_test``, ``multiprocessing.posixshmem``, ``_scproxy``, ``_stat``, ``_statistics``, ``_testconsole``, ``_testimportmultiple`` och ``_uuid`` C-tillägg är nu byggda med :ref:``limited C API <limited-c-api>`. (Bidrag från Victor Stinner i :gh:`85283`.)

source: Porting to Python 3.13
sv: Portning till Python 3.13
