Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: Remove the :func:`!locale.resetlocale` function, deprecated in Python 3.11. Use ``locale.setlocale(locale.LC_ALL, "")`` instead. (Contributed by Victor Stinner in :gh:`104783`.)
sv: Ta bort :func:`!locale.resetlocale`-funktionen, föråldrad i Python 3.11. Använd ``locale.setlocale(locale.LC_ALL, "")`` istället. (Bidrag från Victor Stinner i :gh:`104783`.)

source: opcode
sv: opkod

source: Move :attr:`!opcode.ENABLE_SPECIALIZATION` to :attr:`!_opcode.ENABLE_SPECIALIZATION`. This field was added in 3.12, it was never documented, and is not intended for external use. (Contributed by Irit Katriel in :gh:`105481`.)
sv: Flytta :attr:`!opcode.ENABLE_SPECIALIZATION` till :attr:`!_opcode.ENABLE_SPECIALIZATION`. Detta fält lades till i 3.12, det dokumenterades aldrig och är inte avsett för extern användning. (Bidrag från Irit Katriel i :gh:`105481`.)

source: Remove :func:`!opcode.is_pseudo`, :attr:`!opcode.MIN_PSEUDO_OPCODE`, and :attr:`!opcode.MAX_PSEUDO_OPCODE`, which were added in Python 3.12, but were neither documented nor exposed through :mod:`dis`, and were not intended to be used externally. (Contributed by Irit Katriel in :gh:`105481`.)
sv: Ta bort :func:`!opcode.is_pseudo`, :attr:`!opcode.MIN_PSEUDO_OPCODE`, och :attr:`!opcode.MAX_PSEUDO_OPCODE`, som lades till i Python 3.12, men varken dokumenterades eller exponerades genom :mod:`dis`, och var inte avsedda att användas externt. (Bidrag från Irit Katriel i :gh:`105481`.)

source: This module is no longer considered :term:`soft deprecated`. While :mod:`argparse` remains preferred for new projects that aren't using a third party command line argument processing library, there are aspects of the way ``argparse`` works that mean the lower level ``optparse`` module may provide a better foundation for *writing* argument processing libraries, and for implementing command line applications which adhere more strictly than ``argparse`` does to various Unix command line processing conventions that originate in the behaviour of the C :c:func:`!getopt` function . (Contributed by Alyssa Coghlan and Serhiy Storchaka in :gh:`126180`.)
sv: Denna modul anses inte längre vara :term:`soft deprecated`. Medan :mod:`argparse` fortfarande är att föredra för nya projekt som inte använder ett tredjeparts kommandoradsargumentbehandlingsbibliotek, finns det aspekter av hur ``argparse`` fungerar som innebär att den lägre modulen ``optparse`` kan ge en bättre grund för att *skriva* argumentbehandlingsbibliotek och för att implementera kommandoradsapplikationer som mer strikt än ``argparse`` följer olika Unix kommandoradsbehandlingskonventioner som har sitt ursprung i beteendet hos C :c:func:`!getopt`-funktionen . (Bidrag från Alyssa Coghlan och Serhiy Storchaka i :gh:`126180`.)

source: Remove the ability to use :class:`~pathlib.Path` objects as context managers. This functionality was deprecated and has had no effect since Python 3.9. (Contributed by Barney Gale in :gh:`83863`.)
sv: Ta bort möjligheten att använda :class:`~pathlib.Path`-objekt som kontexthanterare. Denna funktionalitet var föråldrad och har inte haft någon effekt sedan Python 3.9. (Bidrag från Barney Gale i :gh:`83863`.)

source: Remove the undocumented, deprecated, and broken :func:`!re.template` function and :attr:`!re.TEMPLATE` / :attr:`!re.T` flag. (Contributed by Serhiy Storchaka and Nikita Sobolev in :gh:`105687`.)
sv: Ta bort den odokumenterade, föråldrade och trasiga funktionen :func:`!re.template` och flaggan :attr:`!re.TEMPLATE` / :attr:`!re.T`. (Bidrag från Serhiy Storchaka och Nikita Sobolev i :gh:`105687`.)

source: Remove the :mod:`!tkinter.tix` module, deprecated in Python 3.6. The third-party Tix library which the module wrapped is unmaintained. (Contributed by Zachary Ware in :gh:`75552`.)
sv: Ta bort :mod:`!tkinter.tix`-modulen, föråldrad i Python 3.6. Tix-biblioteket från tredje part som modulen omslöt underhålls inte längre. (Bidrag från Zachary Ware i :gh:`75552`.)

source: turtle
sv: sköldpadda

source: Remove the :meth:`!RawTurtle.settiltangle` method, deprecated in the documentation since Python 3.1 and at runtime since Python 3.11. (Contributed by Hugo van Kemenade in :gh:`104876`.)
sv: Ta bort metoden :meth:`!RawTurtle.settiltangle`, som är föråldrad i dokumentationen sedan Python 3.1 och i körtid sedan Python 3.11. (Bidrag från Hugo van Kemenade i :gh:`104876`.)

source: Remove the :mod:`!typing.io` and :mod:`!typing.re` namespaces, deprecated since Python 3.8. The items in those namespaces can be imported directly from the :mod:`typing` module. (Contributed by Sebastian Rittau in :gh:`92871`.)
sv: Ta bort namnrymderna :mod:`!typing.io` och :mod:`!typing.re`, föråldrade sedan Python 3.8. Objekten i dessa namnrymder kan importeras direkt från modulen :mod:`typing`. (Bidrag från Sebastian Rittau i :gh:`92871`.)

source: Remove the keyword-argument method of creating :class:`~typing.TypedDict` types, deprecated in Python 3.11. (Contributed by Tomas Roun in :gh:`104786`.)
sv: Ta bort nyckelordsargumentmetoden för att skapa :class:`~typing.TypedDict`-typer, föråldrad i Python 3.11. (Bidrag från Tomas Roun i :gh:`104786`.)

source: Remove the following :mod:`unittest` functions, deprecated in Python 3.11:
sv: Ta bort följande :mod:`unittest`-funktioner, föråldrade i Python 3.11:

source: Use :class:`~unittest.TestLoader` methods instead:
sv: Använd istället :class:`~unittest.TestLoader`-metoder:

source: (Contributed by Hugo van Kemenade in :gh:`104835`.)
sv: (Bidrag från Hugo van Kemenade i :gh:`104835`.)

source: Remove the untested and undocumented :meth:`!TestProgram.usageExit` method, deprecated in Python 3.11. (Contributed by Hugo van Kemenade in :gh:`104992`.)
sv: Ta bort den otestade och odokumenterade :meth:`!TestProgram.usageExit`-metoden, föråldrad i Python 3.11. (Bidrag från Hugo van Kemenade i :gh:`104992`.)

source: Remove the *cafile*, *capath*, and *cadefault* parameters of the :func:`urllib.request.urlopen` function, deprecated in Python 3.6. Use the *context* parameter instead with an :class:`~ssl.SSLContext` instance. The :meth:`ssl.SSLContext.load_cert_chain` function can be used to load specific certificates, or let :func:`ssl.create_default_context` select the operating system's trusted certificate authority (CA) certificates. (Contributed by Victor Stinner in :gh:`105382`.)
sv: Ta bort parametrarna *cafile*, *capath* och *cadefault* i funktionen :func:`urllib.request.urlopen`, föråldrad i Python 3.6. Använd istället parametern *context* med en instans av :class:`~ssl.SSLContext`. Funktionen :meth:`ssl.SSLContext.load_cert_chain` kan användas för att ladda specifika certifikat eller låta :func:`ssl.create_default_context` välja operativsystemets betrodda certifikat från certifikatutfärdaren (CA). (Bidrag från Victor Stinner i :gh:`105382`.)

source: webbrowser
sv: webbläsare

source: Remove the untested and undocumented :class:`!MacOSX` class, deprecated in Python 3.11. Use the :class:`!MacOSXOSAScript` class (introduced in Python 3.2) instead. (Contributed by Hugo van Kemenade in :gh:`104804`.)
sv: Ta bort den otestade och odokumenterade :class:`!MacOSX`-klassen, utfasad i Python 3.11. Använd :class:`!MacOSXOSAScript`-klassen (introducerad i Python 3.2) istället. (Bidrag från Hugo van Kemenade i :gh:`104804`.)

source: Remove the deprecated :attr:`!MacOSXOSAScript._name` attribute. Use the :attr:`MacOSXOSAScript.name <webbrowser.controller.name>` attribute instead. (Contributed by Nikita Sobolev in :gh:`105546`.)
sv: Ta bort det föråldrade attributet :attr:`!MacOSXOSAScript._name`. Använd istället attributet :attr:`MacOSXOSAScript.name <webbrowser.controller.name>`. (Bidrag från Nikita Sobolev i :gh:`105546`.)

source: New Deprecations
sv: Nya avskrivningar

source: :ref:`User-defined functions <user-defined-funcs>`:
sv: :ref:`Användardefinierade funktioner <user-defined-funcs>`:

source: Deprecate assignment to a function's :attr:`~function.__code__` attribute, where the new code object's type does not match the function's type. The different types are: plain function, generator, async generator, and coroutine. (Contributed by Irit Katriel in :gh:`81137`.)
sv: Avskaffa tilldelning till en funktions :attr:`~function.__code__`-attribut, där det nya kodobjektets typ inte överensstämmer med funktionens typ. De olika typerna är: vanlig funktion, generator, async-generator och coroutine. (Bidrag från Irit Katriel i :gh:`81137`.)

source: Deprecate the ``'u'`` format code (:c:type:`wchar_t`) at runtime. This format code has been deprecated in documentation since Python 3.3, and will be removed in Python 3.16. Use the ``'w'`` format code (:c:type:`Py_UCS4`) for Unicode characters instead. (Contributed by Hugo van Kemenade in :gh:`80480`.)
sv: Avskaffa formatkoden ``'u'`` (:c:type:`wchar_t`) vid körning. Denna formatkod har varit föråldrad i dokumentation sedan Python 3.3 och kommer att tas bort i Python 3.16. Använd formatkoden ``'w'`` (:c:type:`Py_UCS4`) för Unicode-tecken istället. (Bidrag från Hugo van Kemenade i :gh:`80480`.)

source: Deprecate the undocumented :func:`!SetPointerType` function, to be removed in Python 3.15. (Contributed by Victor Stinner in :gh:`105733`.)
sv: Avveckla den odokumenterade funktionen :func:`!SetPointerType`, som kommer att tas bort i Python 3.15. (Bidrag från Victor Stinner i :gh:`105733`.)

source: :term:`Soft-deprecate <soft deprecated>` the :func:`~ctypes.ARRAY` function in favour of ``type * length`` multiplication. (Contributed by Victor Stinner in :gh:`105733`.)
sv: :term:`Soft-deprecate <soft deprecated>` funktionen :func:`~ctypes.ARRAY` till förmån för multiplikation av ``typ * längd``. (Bidrag från Victor Stinner i :gh:`105733`.)

source: Deprecate the non-standard and undocumented :class:`~decimal.Decimal` format specifier ``'N'``, which is only supported in the :mod:`!decimal` module's C implementation. (Contributed by Serhiy Storchaka in :gh:`89902`.)
sv: Avskaffa den icke-standardiserade och odokumenterade :class:`~decimal.Decimal`-formatspecificeraren ``'N'``, som endast stöds i :mod:`!decimal`-modulens C-implementering. (Bidrag från Serhiy Storchaka i :gh:`89902`.)

source: Deprecate the :attr:`!HAVE_ARGUMENT` separator. Check membership in :data:`~dis.hasarg` instead. (Contributed by Irit Katriel in :gh:`109319`.)
sv: Avveckla :attr:`!HAVE_ARGUMENT`-avgränsaren. Kontrollera medlemskap i :data:`~dis.hasarg` istället. (Bidrag från Irit Katriel i :gh:`109319`.)

source: Deprecate non-integer numbers as arguments to functions and methods that consider plural forms in the :mod:`!gettext` module, even if no translation was found. (Contributed by Serhiy Storchaka in :gh:`88434`.)
sv: Ta bort icke-integrala tal som argument till funktioner och metoder som beaktar pluralformer i modulen :mod:`!gettext`, även om ingen översättning hittades. (Bidrag från Serhiy Storchaka i :gh:`88434`.)

source: Deprecate the undocumented :func:`!glob0` and :func:`!glob1` functions. Use :func:`~glob.glob` and pass a :term:`path-like object` specifying the root directory to the *root_dir* parameter instead. (Contributed by Barney Gale in :gh:`117337`.)
sv: Utgå från de odokumenterade funktionerna :func:`!glob0` och :func:`!glob1`. Använd :func:`~glob.glob` och skicka ett :term:`path-liknande objekt` som anger rotkatalogen till parametern *root_dir* istället. (Bidrag från Barney Gale i :gh:`117337`.)

source: Deprecate :class:`~http.server.CGIHTTPRequestHandler`, to be removed in Python 3.15. Process-based CGI HTTP servers have been out of favor for a very long time. This code was outdated, unmaintained, and rarely used. It has a high potential for both security and functionality bugs. (Contributed by Gregory P. Smith in :gh:`109096`.)
sv: Avveckla :class:`~http.server.CGIHTTPRequestHandler`, tas bort i Python 3.15. Processbaserade CGI HTTP-servrar har varit i onåd under en mycket lång tid. Denna kod var föråldrad, ounderhållen och användes sällan. Den har en hög potential för både säkerhets- och funktionsbuggar. (Bidrag från Gregory P. Smith i :gh:`109096`.)

source: Deprecate the :option:`!--cgi` flag to the :program:`python -m http.server` command-line interface, to be removed in Python 3.15. (Contributed by Gregory P. Smith in :gh:`109096`.)
sv: Avveckla :option:`!--cgi`-flaggan till :program:`python -m http.server`-kommandoradsgränssnittet, som kommer att tas bort i Python 3.15. (Bidrag från Gregory P. Smith i :gh:`109096`.)

source: :term:`Soft-deprecate <soft deprecated>` file path arguments to :func:`~mimetypes.guess_type`, use :func:`~mimetypes.guess_file_type` instead. (Contributed by Serhiy Storchaka in :gh:`66543`.)
sv: :term:`Soft-deprecate <soft deprecated>` filvägsargument till :func:`~mimetypes.guess_type`, använd :func:`~mimetypes.guess_file_type` istället. (Bidrag från Serhiy Storchaka i :gh:`66543`.)

source: Deprecate passing the optional *maxsplit*, *count*, or *flags* arguments as positional arguments to the module-level :func:`~re.split`, :func:`~re.sub`, and :func:`~re.subn` functions. These parameters will become :ref:`keyword-only <keyword-only_parameter>` in a future version of Python. (Contributed by Serhiy Storchaka in :gh:`56166`.)
sv: Avstå från att skicka de valfria argumenten *maxsplit*, *count* eller *flags* som positionella argument till modulnivåfunktionerna :func:`~re.split`, :func:`~re.sub` och :func:`~re.subn`. Dessa parametrar kommer att bli :ref:`keyword-only <keyword-only_parameter>` i en framtida version av Python. (Bidrag från Serhiy Storchaka i :gh:`56166`.)

source: Deprecate :meth:`.PurePath.is_reserved`, to be removed in Python 3.15. Use :func:`os.path.isreserved` to detect reserved paths on Windows. (Contributed by Barney Gale in :gh:`88569`.)
sv: Avveckla :meth:`.PurePath.is_reserved`, kommer att tas bort i Python 3.15. Använd :func:`os.path.isreserved` för att upptäcka reserverade sökvägar på Windows. (Bidrag från Barney Gale i :gh:`88569`.)

source: :mod:`platform`:
sv: :mod:`plattform`:

source: Deprecate :func:`~platform.java_ver`, to be removed in Python 3.15. This function is only useful for Jython support, has a confusing API, and is largely untested. (Contributed by Nikita Sobolev in :gh:`116349`.)
sv: Utgå :func:`~platform.java_ver`, kommer att tas bort i Python 3.15. Denna funktion är endast användbar för Jython-stöd, har ett förvirrande API och är i stort sett otestad. (Bidrag från Nikita Sobolev i :gh:`116349`.)

source: Deprecate the undocumented :func:`!ispackage` function. (Contributed by Zackery Spytz in :gh:`64020`.)
sv: Avveckla den odokumenterade funktionen :func:`!ispackage`. (Bidrag från Zackery Spytz i :gh:`64020`.)

source: Deprecate passing more than one positional argument to the :func:`~sqlite3.connect` function and the :class:`~sqlite3.Connection` constructor. The remaining parameters will become keyword-only in Python 3.15. (Contributed by Erlend E. Aasland in :gh:`107948`.)
sv: Avskaffa att skicka mer än ett positionellt argument till funktionen :func:`~sqlite3.connect` och konstruktören :class:`~sqlite3.Connection`. De återstående parametrarna kommer att bli nyckelordsbundna i Python 3.15. (Bidrag från Erlend E. Aasland i :gh:`107948`.)

source: Deprecate passing name, number of arguments, and the callable as keyword arguments for :meth:`.Connection.create_function` and :meth:`.Connection.create_aggregate` These parameters will become positional-only in Python 3.15. (Contributed by Erlend E. Aasland in :gh:`108278`.)
sv: Utgå från att skicka namn, antal argument och anropbar som nyckelordsargument för :meth:`.Connection.create_function` och :meth:`.Connection.create_aggregate` Dessa parametrar kommer att bli enbart positionella i Python 3.15. (Bidrag från Erlend E. Aasland i :gh:`108278`.)

source: Deprecate passing the callback callable by keyword for the :meth:`~sqlite3.Connection.set_authorizer`, :meth:`~sqlite3.Connection.set_progress_handler`, and :meth:`~sqlite3.Connection.set_trace_callback` :class:`~sqlite3.Connection` methods. The callback callables will become positional-only in Python 3.15. (Contributed by Erlend E. Aasland in :gh:`108278`.)
sv: Avskaffa att skicka callback callable med nyckelord för metoderna :meth:`~sqlite3.Connection.set_authorizer`, :meth:`~sqlite3.Connection.set_progress_handler` och :meth:`~sqlite3.Connection.set_trace_callback` :class:`~sqlite3.Connection`. Callback callables kommer att bli positional-only i Python 3.15. (Bidrag från Erlend E. Aasland i :gh:`108278`.)

source: Deprecate the :func:`~sys._enablelegacywindowsfsencoding` function, to be removed in Python 3.16. Use the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable instead. (Contributed by Inada Naoki in :gh:`73427`.)
sv: Utgå från funktionen :func:`~sys._enablelegacywindowsfsencoding`, som kommer att tas bort i Python 3.16. Använd miljövariabeln :envvar:`PYTHONLEGACYWINDOWSFSENCODING` istället. (Bidrag från Inada Naoki i :gh:`73427`.)

source: Deprecate the undocumented and unused :attr:`!TarFile.tarfile` attribute, to be removed in Python 3.16. (Contributed in :gh:`115256`.)
sv: Avveckla det odokumenterade och oanvända attributet :attr:`!TarFile.tarfile`, som ska tas bort i Python 3.16. (Bidrag från :gh:`115256`.)

source: Deprecate the :attr:`.TracebackException.exc_type` attribute. Use :attr:`.TracebackException.exc_type_str` instead. (Contributed by Irit Katriel in :gh:`112332`.)
sv: Utgå från attributet :attr:`.TracebackException.exc_type`. Använd :attr:`.TracebackException.exc_type_str` istället. (Bidrag från Irit Katriel i :gh:`112332`.)

source: :mod:`typing`:
sv: :mod:`typning`:

source: Deprecate the undocumented keyword argument syntax for creating :class:`~typing.NamedTuple` classes (e.g. ``Point = NamedTuple("Point", x=int, y=int)``), to be removed in Python 3.15. Use the class-based syntax or the functional syntax instead. (Contributed by Alex Waygood in :gh:`105566`.)
sv: Avveckla den odokumenterade syntaxen för nyckelordsargument för att skapa :class:`~typing.NamedTuple`-klasser (t.ex. ``Point = NamedTuple("Point", x=int, y=int)``), kommer att tas bort i Python 3.15. Använd den klassbaserade syntaxen eller den funktionella syntaxen istället. (Bidrag från Alex Waygood i :gh:`105566`.)

source: Deprecate omitting the *fields* parameter when creating a :class:`~typing.NamedTuple` or :class:`typing.TypedDict` class, and deprecate passing ``None`` to the *fields* parameter of both types. Python 3.15 will require a valid sequence for the *fields* parameter. To create a NamedTuple class with zero fields, use ``class NT(NamedTuple): pass`` or ``NT = NamedTuple("NT", ())``. To create a TypedDict class with zero fields, use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})``. (Contributed by Alex Waygood in :gh:`105566` and :gh:`105570`.)
sv: Avstå från att utelämna *fields*-parametern när du skapar en :class:`~typing.NamedTuple`- eller :class:`typing.TypedDict`-klass, och avstå från att skicka ``None`` till *fields*-parametern för båda typerna. Python 3.15 kommer att kräva en giltig sekvens för parametern *fields*. För att skapa en NamedTuple-klass med noll fält, använd ``class NT(NamedTuple): pass`` eller ``NT = NamedTuple("NT", ())``. För att skapa en TypedDict-klass med noll fält, använd ``class TD(TypedDict): pass`` eller ``TD = TypedDict("TD", {})``. (Bidrag från Alex Waygood i :gh:`105566` och :gh:`105570`.)

source: Deprecate the :func:`typing.no_type_check_decorator` decorator function, to be removed in Python 3.15. After eight years in the :mod:`typing` module, it has yet to be supported by any major type checker. (Contributed by Alex Waygood in :gh:`106309`.)
sv: Avveckla dekoratorfunktionen :func:`typing.no_type_check_decorator`, som kommer att tas bort i Python 3.15. Efter åtta år i modulen :mod:`typing` har den ännu inte fått stöd av någon större typkontroll. (Bidrag från Alex Waygood i :gh:`106309`.)

source: Deprecate :data:`typing.AnyStr`. In Python 3.16, it will be removed from ``typing.__all__``, and a :exc:`DeprecationWarning` will be emitted at runtime when it is imported or accessed. It will be removed entirely in Python 3.18. Use the new :ref:`type parameter syntax <type-params>` instead. (Contributed by Michael The in :gh:`107116`.)
sv: Avveckla :data:`typing.AnyStr`. I Python 3.16 kommer den att tas bort från ``typing.__all__``, och en :exc:`DeprecationWarning` kommer att skickas ut vid körning när den importeras eller används. Den kommer att tas bort helt i Python 3.18. Använd den nya :ref:`typ-parametersyntaxen <type-params>` istället. (Bidrag från Michael The i :gh:`107116`.)

source: :mod:`wave`:
sv: :mod:`våg`:

source: Deprecate the :meth:`~wave.Wave_read.getmark`, :meth:`!setmark`, and :meth:`~wave.Wave_read.getmarkers` methods of the :class:`~wave.Wave_read` and :class:`~wave.Wave_write` classes, to be removed in Python 3.15. (Contributed by Victor Stinner in :gh:`105096`.)
sv: Avveckla metoderna :meth:`~wave.Wave_read.getmark`, :meth:`!setmark`, och :meth:`~wave.Wave_read.getmarkers` i klasserna :class:`~wave.Wave_read` och :class:`~wave.Wave_write`, tas bort i Python 3.15. (Bidrag från Victor Stinner i :gh:`105096`.)

source: Pending removal in Python 3.14
sv: Väntar på borttagning i Python 3.14

source: :mod:`argparse`: The *type*, *choices*, and *metavar* parameters of :class:`!argparse.BooleanOptionalAction` are deprecated and will be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`92248`.)
sv: :mod:`argparse`: Parametrarna *type*, *choices* och *metavar* i :class:`!argparse.BooleanOptionalAction` är föråldrade och kommer att tas bort i 3.14. (Bidrag från Nikita Sobolev i :gh:`92248`.)

source: :mod:`ast`: The following features have been deprecated in documentation since Python 3.8, now cause a :exc:`DeprecationWarning` to be emitted at runtime when they are accessed or used, and will be removed in Python 3.14:
sv: :mod:`ast`: Följande funktioner har varit föråldrade i dokumentationen sedan Python 3.8, orsakar nu en :exc:`DeprecationWarning` vid körning när de nås eller används, och kommer att tas bort i Python 3.14:

source: :class:`!ast.NameConstant`
sv: :class:`!ast.NamnKonstant`

source: Use :class:`ast.Constant` instead. (Contributed by Serhiy Storchaka in :gh:`90953`.)
sv: Använd :class:`ast.Constant` istället. (Bidrag från Serhiy Storchaka i :gh:`90953`.)

source: The child watcher classes :class:`!asyncio.MultiLoopChildWatcher`, :class:`!asyncio.FastChildWatcher`, :class:`!asyncio.AbstractChildWatcher` and :class:`!asyncio.SafeChildWatcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
sv: Barnvaktklasserna :class:`!asyncio.MultiLoopChildWatcher`, :class:`!asyncio.FastChildWatcher`, :class:`!asyncio.AbstractChildWatcher` och :class:`!asyncio.SafeChildWatcher` är föråldrade och kommer att tas bort i Python 3.14. (Bidrag från Kumar Aditya i :gh:`94597`.)

source: :func:`!asyncio.set_child_watcher`, :func:`!asyncio.get_child_watcher`, :meth:`!asyncio.AbstractEventLoopPolicy.set_child_watcher` and :meth:`!asyncio.AbstractEventLoopPolicy.get_child_watcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
sv: :func:`!asyncio.set_child_watcher`, :func:`!asyncio.get_child_watcher`, :meth:`!asyncio.AbstractEventLoopPolicy.set_child_watcher` och :meth:`!asyncio.AbstractEventLoopPolicy.get_child_watcher` är föråldrade och kommer att tas bort i Python 3.14. (Bidrag från Kumar Aditya i :gh:`94597`.)
