Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: The :mod:`tkinter` widget method :meth:`!wm_attributes` now accepts the attribute name without the minus prefix to get window attributes, for example ``w.wm_attributes('alpha')`` and allows specifying attributes and values to set as keyword arguments, for example ``w.wm_attributes(alpha=0.5)``. (Contributed by Serhiy Storchaka in :gh:`43457`.)
sv: Widgetmetoden :mod:`tkinter` :meth:`!wm_attributes` accepterar nu attributnamnet utan minusprefixet för att få fönsterattribut, till exempel ``w.wm_attributes('alpha')`` och tillåter att attribut och värden anges som nyckelordsargument, till exempel ``w.wm_attributes(alpha=0.5)``. (Bidrag från Serhiy Storchaka i :gh:`43457`.)

source: :meth:`!wm_attributes` can now return attributes as a :class:`dict`, by using the new optional keyword-only parameter *return_python_dict*. (Contributed by Serhiy Storchaka in :gh:`43457`.)
sv: :meth:`!wm_attributes` kan nu returnera attribut som en :class:`dict`, genom att använda den nya valfria parametern *return_python_dict*, som endast innehåller nyckelord. (Bidrag från Serhiy Storchaka i :gh:`43457`.)

source: :meth:`!Text.count` can now return a simple :class:`int` when the new optional keyword-only parameter *return_ints* is used. Otherwise, the single count is returned as a 1-tuple or ``None``. (Contributed by Serhiy Storchaka in :gh:`97928`.)
sv: :meth:`!Text.count` kan nu returnera en enkel :class:`int` när den nya valfria parametern *return_ints* används. Annars returneras den enskilda räkningen som en 1-tupel eller ``None``. (Bidrag från Serhiy Storchaka i :gh:`97928`.)

source: Support the "vsapi" element type in the :meth:`~tkinter.ttk.Style.element_create` method of :class:`tkinter.ttk.Style`. (Contributed by Serhiy Storchaka in :gh:`68166`.)
sv: Stöd för elementtypen "vsapi" i metoden :meth:`~tkinter.ttk.Style.element_create` i :class:`tkinter.ttk.Style`. (Bidrag från Serhiy Storchaka i :gh:`68166`.)

source: Add the :meth:`!after_info` method for Tkinter widgets. (Contributed by Cheryl Sabella in :gh:`77020`.)
sv: Lägg till :meth:`!after_info`-metoden för Tkinter-widgetar. (Bidrag från Cheryl Sabella i :gh:`77020`.)

source: Add a new :meth:`!copy_replace` method to :class:`!PhotoImage` to copy a region from one image to another, possibly with pixel zooming, subsampling, or both. (Contributed by Serhiy Storchaka in :gh:`118225`.)
sv: Lägg till en ny :meth:`!copy_replace`-metod till :class:`!PhotoImage` för att kopiera en region från en bild till en annan, eventuellt med pixelzoomning, subsampling eller båda. (Bidrag från Serhiy Storchaka i :gh:`118225`.)

source: Add *from_coords* parameter to the :class:`!PhotoImage` methods :meth:`!copy`, :meth:`!zoom` and :meth:`!subsample`. Add *zoom* and *subsample* parameters to the :class:`!PhotoImage` method :meth:`!copy`. (Contributed by Serhiy Storchaka in :gh:`118225`.)
sv: Lägg till parametern *from_coords* i :class:`!PhotoImage`-metoderna :meth:`!copy`, :meth:`!zoom` och :meth:`!subsample`. Lägg till parametrarna *zoom* och *subsample* i :class:`!PhotoImage`-metoden :meth:`!copy`. (Bidrag från Serhiy Storchaka i :gh:`118225`.)

source: Add the :class:`!PhotoImage` methods :meth:`!read` to read an image from a file and :meth:`!data` to get the image data. Add *background* and *grayscale* parameters to the :meth:`!write` method. (Contributed by Serhiy Storchaka in :gh:`118271`.)
sv: Lägg till :class:`!PhotoImage`-metoderna :meth:`!read` för att läsa en bild från en fil och :meth:`!data` för att hämta bilddata. Lägg till parametrarna *background* och *grayscale* i metoden :meth:`!write`. (Bidrag från Serhiy Storchaka i :gh:`118271`.)

source: traceback
sv: spårning

source: Add the :attr:`~traceback.TracebackException.exc_type_str` attribute to :class:`~traceback.TracebackException`, which holds a string display of the *exc_type*. Deprecate the :attr:`~traceback.TracebackException.exc_type` attribute, which holds the type object itself. Add parameter *save_exc_type* (default ``True``) to indicate whether ``exc_type`` should be saved. (Contributed by Irit Katriel in :gh:`112332`.)
sv: Lägg till attributet :attr:`~traceback.TracebackException.exc_type_str` till :class:`~traceback.TracebackException`, som innehåller en strängvisning av *exc_type*. Utgå från attributet :attr:`~traceback.TracebackException.exc_type`, som innehåller själva typobjektet. Lägg till parametern *save_exc_type* (standard ``True``) för att ange om ``exc_type`` ska sparas. (Bidrag från Irit Katriel i :gh:`112332`.)

source: Add a new *show_group* keyword-only parameter to :meth:`.TracebackException.format_exception_only` to (recursively) format the nested exceptions of a :exc:`BaseExceptionGroup` instance. (Contributed by Irit Katriel in :gh:`105292`.)
sv: Lägg till en ny *show_group* parameter med nyckelord endast till :meth:`.TracebackException.format_exception_only` för att (rekursivt) formatera de nästlade undantagen i en :exc:`BaseExceptionGroup`-instans. (Bidrag från Irit Katriel i :gh:`105292`.)

source: types
sv: typer

source: :class:`~types.SimpleNamespace` can now take a single positional argument to initialise the namespace's arguments. This argument must either be a mapping or an iterable of key-value pairs. (Contributed by Serhiy Storchaka in :gh:`108191`.)
sv: :class:`~types.SimpleNamespace` kan nu ta ett enda positionellt argument för att initiera namnrymdens argument. Detta argument måste antingen vara en mappning eller en iterabel av nyckel-värde-par. (Bidrag från Serhiy Storchaka i :gh:`108191`.)

source: typing
sv: maskinskrivning

source: :pep:`705`: Add :data:`~typing.ReadOnly`, a special typing construct to mark a :class:`~typing.TypedDict` item as read-only for type checkers.
sv: :pep:`705`: Lägg till :data:`~typing.ReadOnly`, en speciell typningskonstruktion för att markera ett :class:`~typing.TypedDict`-objekt som skrivskyddat för typkontrollanter.

source: :pep:`742`: Add :data:`~typing.TypeIs`, a typing construct that can be used to instruct a type checker how to narrow a type.
sv: :pep:`742`: Lägg till :data:`~typing.TypeIs`, en typkonstruktion som kan användas för att instruera en typkontrollant hur en typ ska begränsas.

source: Add :data:`~typing.NoDefault`, a sentinel object used to represent the defaults of some parameters in the :mod:`typing` module. (Contributed by Jelle Zijlstra in :gh:`116126`.)
sv: Lägg till :data:`~typing.NoDefault`, ett sentinel-objekt som används för att representera standardvärdena för vissa parametrar i modulen :mod:`typing`. (Bidrag från Jelle Zijlstra i :gh:`116126`.)

source: Add :func:`~typing.get_protocol_members` to return the set of members defining a :class:`typing.Protocol`. (Contributed by Jelle Zijlstra in :gh:`104873`.)
sv: Lägg till :func:`~typing.get_protocol_members` för att returnera uppsättningen medlemmar som definierar en :class:`typing.Protocol`. (Bidrag från Jelle Zijlstra i :gh:`104873`.)

source: Add :func:`~typing.is_protocol` to check whether a class is a :class:`~typing.Protocol`. (Contributed by Jelle Zijlstra in :gh:`104873`.)
sv: Lägg till :func:`~typing.is_protocol` för att kontrollera om en klass är en :class:`~typing.Protocol`. (Bidrag från Jelle Zijlstra i :gh:`104873`.)

source: :data:`~typing.ClassVar` can now be nested in :data:`~typing.Final`, and vice versa. (Contributed by Mehdi Drissi in :gh:`89547`.)
sv: :data:`~typing.ClassVar` kan nu nestas i :data:`~typing.Final`, och vice versa. (Bidrag från Mehdi Drissi i :gh:`89547`.)

source: Update the Unicode database to `version 15.1.0`__. (Contributed by James Gerity in :gh:`109559`.)
sv: Uppdatera Unicode-databasen till `version 15.1.0`__. (Bidrag från James Gerity i :gh:`109559`.)

source: venv
sv: ven

source: Add support for creating source control management (SCM) ignore files in a virtual environment's directory. By default, Git is supported. This is implemented as opt-in via the API, which can be extended to support other SCMs (:class:`~venv.EnvBuilder` and :func:`~venv.create`), and opt-out via the CLI, using :option:`!--without-scm-ignore-files`. (Contributed by Brett Cannon in :gh:`108125`.)
sv: Lägg till stöd för att skapa ignoreringsfiler för SCM (Source Control Management) i en virtuell miljös katalog. Som standard stöds Git. Detta implementeras som opt-in via API:et, som kan utökas för att stödja andra SCM:er (:class:`~venv.EnvBuilder` och :func:`~venv.create`), och opt-out via CLI, med :option:`!--without-scm-ignore-files`. (Bidrag från Brett Cannon i :gh:`108125`.)

source: warnings
sv: varningar

source: :pep:`702`: The new :func:`warnings.deprecated` decorator provides a way to communicate deprecations to a :term:`static type checker` and to warn on usage of deprecated classes and functions. A :exc:`DeprecationWarning` may also be emitted when a decorated function or class is used at runtime. (Contributed by Jelle Zijlstra in :gh:`104003`.)
sv: :pep:`702`: Den nya :func:`warnings.deprecated` dekoratorn ger ett sätt att kommunicera deprecations till en :term:`statisk typkontroll` och att varna för användning av deprecated klasser och funktioner. En :exc:`DeprecationWarning` kan också sändas ut när en dekorerad funktion eller klass används vid körning. (Bidrag från Jelle Zijlstra i :gh:`104003`.)

source: Allow controlling Expat >=2.6.0 reparse deferral (:cve:`2023-52425`) by adding five new methods:
sv: Tillåt kontroll av Expat >=2.6.0 reparse deferral (:cve:`2023-52425`) genom att lägga till fem nya metoder:

source: (Contributed by Sebastian Pipping in :gh:`115623`.)
sv: (Bidrag från Sebastian Pipping i :gh:`115623`.)

source: Add the :meth:`!close` method for the iterator returned by :func:`~xml.etree.ElementTree.iterparse` for explicit cleanup. (Contributed by Serhiy Storchaka in :gh:`69893`.)
sv: Lägg till metoden :meth:`!close` för iteratorn som returneras av :func:`~xml.etree.ElementTree.iterparse` för explicit rensning. (Bidrag från Serhiy Storchaka i :gh:`69893`.)

source: Add support for ZIP64_ format files. Everybody loves huge data, right? (Contributed by Tim Hatch in :gh:`94146`.)
sv: Lägg till stöd för filer i ZIP64_-format. Alla älskar stora datamängder, eller hur? (Bidrag från Tim Hatch i :gh:`94146`.)

source: Optimizations
sv: Optimeringar

source: Several standard library modules have had their import times significantly improved. For example, the import time of the :mod:`typing` module has been reduced by around a third by removing dependencies on :mod:`re` and :mod:`contextlib`. Other modules to enjoy import-time speedups include :mod:`email.utils`, :mod:`enum`, :mod:`functools`, :mod:`importlib.metadata`, and :mod:`threading`. (Contributed by Alex Waygood, Shantanu Jain, Adam Turner, Daniel Hollas, and others in :gh:`109653`.)
sv: Flera standardbiblioteksmoduler har fått sina importtider avsevärt förbättrade. Till exempel har importtiden för modulen :mod:`typing` minskats med ungefär en tredjedel genom att ta bort beroenden av :mod:`re` och :mod:`contextlib`. Andra moduler som har fått snabbare importtid är :mod:`email.utils`, :mod:`enum`, :mod:`functools`, :mod:`importlib.metadata` och :mod:`threading`. (Bidrag från Alex Waygood, Shantanu Jain, Adam Turner, Daniel Hollas, och andra i :gh:`109653`.)

source: :func:`textwrap.indent` is now around 30% faster than before for large input. (Contributed by Inada Naoki in :gh:`107369`.)
sv: :func:`textwrap.indent` är nu cirka 30% faster än tidigare för stora inmatningar. (Bidrag från Inada Naoki i :gh:`107369`.)

source: The :mod:`subprocess` module now uses the :func:`~os.posix_spawn` function in more situations, including when *close_fds* is ``True`` (the default) on many modern platforms. This should provide a notable performance increase when launching processes on FreeBSD and Solaris. See the :ref:`subprocess <whatsnew313-subprocess>` section above for details. (Contributed by Jakub Kulik in :gh:`113117`.)
sv: Modulen :mod:`subprocess` använder nu funktionen :func:`~os.posix_spawn` i fler situationer, inklusive när *close_fds* är ``True`` (standard) på många moderna plattformar. Detta bör ge en märkbar prestandaökning när processer startas på FreeBSD och Solaris. Se avsnittet :ref:`subprocess <whatsnew313-subprocess>` ovan för detaljer. (Bidrag från Jakub Kulik i :gh:`113117`.)

source: Removed Modules And APIs
sv: Borttagna moduler och API:er

source: PEP 594: Remove "dead batteries" from the standard library
sv: PEP 594: Ta bort "döda batterier" från standardbiblioteket

source: :pep:`594` proposed removing 19 modules from the standard library, colloquially referred to as 'dead batteries' due to their historic, obsolete, or insecure status. All of the following modules were deprecated in Python 3.11, and are now removed:
sv: :pep:`594` föreslog att 19 moduler skulle tas bort från standardbiblioteket, i dagligt tal kallade "döda batterier" på grund av deras historiska, föråldrade eller osäkra status. Alla följande moduler var föråldrade i Python 3.11 och tas nu bort:

source: :pypi:`standard-aifc`: Use the redistribution of ``aifc`` library from PyPI.
sv: :pypi:`standard-aifc`: Använd omfördelningen av biblioteket ``aifc`` från PyPI.

source: :pypi:`audioop-lts`: Use ``audioop-lts`` library from PyPI.
sv: :pypi:`audioop-lts`: Använd biblioteket ``audioop-lts`` från PyPI.

source: :pypi:`standard-chunk`: Use the redistribution of ``chunk`` library from PyPI.
sv: :pypi:`standard-chunk`: Använd omfördelningen av biblioteket ``chunk`` från PyPI.

source: :mod:`!cgi` and :mod:`!cgitb`
sv: :mod:`!cgi` och :mod:`!cgitb`

source: :class:`!cgi.FieldStorage` can typically be replaced with :func:`urllib.parse.parse_qsl` for ``GET`` and ``HEAD`` requests, and the :mod:`email.message` module or the :pypi:`multipart` library for ``POST`` and ``PUT`` requests.
sv: :class:`!cgi.FieldStorage` kan vanligtvis ersättas med :func:`urllib.parse.parse_qsl` för ``GET`` och ``HEAD`` förfrågningar, och :mod:`email.message`-modulen eller :pypi:`multipart`-biblioteket för ``POST`` och ``PUT`` förfrågningar.

source: :func:`!cgi.parse` can be replaced by calling :func:`urllib.parse.parse_qs` directly on the desired query string, unless the input is ``multipart/form-data``, which should be replaced as described below for :func:`!cgi.parse_multipart`.
sv: :func:`!cgi.parse` kan ersättas genom att anropa :func:`urllib.parse.parse_qs` direkt på den önskade frågesträngen, såvida inte indata är ``multipart/form-data``, som bör ersättas enligt beskrivningen nedan för :func:`!cgi.parse_multipart`.

source: :func:`!cgi.parse_header` can be replaced with the functionality in the :mod:`email` package, which implements the same MIME RFCs. For example, with :class:`email.message.EmailMessage`:
sv: :func:`!cgi.parse_header` kan ersättas med funktionaliteten i paketet :mod:`email`, som implementerar samma MIME RFC:er. Till exempel med :class:`email.message.EmailMessage`:

source: :func:`!cgi.parse_multipart` can be replaced with the functionality in the :mod:`email` package, which implements the same MIME RFCs, or with the :pypi:`multipart` library. For example, the :class:`email.message.EmailMessage` and :class:`email.message.Message` classes.
sv: :func:`!cgi.parse_multipart` kan ersättas med funktionaliteten i paketet :mod:`email`, som implementerar samma MIME RFC:er, eller med biblioteket :pypi:`multipart`. Till exempel klasserna :class:`email.message.EmailMessage` och :class:`email.message.Message`.

source: :pypi:`standard-cgi`: and :pypi:`standard-cgitb`: Use the redistribution of ``cgi`` and ``cgitb`` library from PyPI.
sv: :pypi:`standard-cgi`: och :pypi:`standard-cgitb`: Använd omfördelningen av biblioteken ``cgi`` och ``cgitb`` från PyPI.

source: :mod:`!crypt` and the private :mod:`!_crypt` extension. The :mod:`hashlib` module may be an appropriate replacement when simply hashing a value is required. Otherwise, various third-party libraries on PyPI are available:
sv: :mod:`!crypt` och det privata tillägget :mod:`!_crypt`. Modulen :mod:`hashlib` kan vara en lämplig ersättning när det bara krävs hashning av ett värde. Annars finns olika tredjepartsbibliotek på PyPI tillgängliga:

source: :pypi:`bcrypt`: Modern password hashing for your software and your servers.
sv: :pypi:`bcrypt`: Modern lösenordshashing för din programvara och dina servrar.

source: :pypi:`passlib`: Comprehensive password hashing framework supporting over 30 schemes.
sv: :pypi:`passlib`: Omfattande ramverk för hashing av lösenord med stöd för över 30 system.

source: :pypi:`argon2-cffi`: The secure Argon2 password hashing algorithm.
sv: :pypi:`argon2-cffi`: Den säkra lösenordshashingalgoritmen Argon2.

source: :pypi:`legacycrypt`: :mod:`ctypes` wrapper to the POSIX crypt library call and associated functionality.
sv: :pypi:`legacycrypt`: :mod:`ctypes` omslag till POSIX crypt-biblioteksanropet och tillhörande funktionalitet.

source: :pypi:`crypt_r`: Fork of the :mod:`!crypt` module, wrapper to the :manpage:`crypt_r(3)` library call and associated functionality.
sv: :pypi:`crypt_r`: Förgrening av modulen :mod:`!crypt`, omslag till biblioteksanropet :manpage:`crypt_r(3)` och tillhörande funktionalitet.

source: :pypi:`standard-crypt` and :pypi:`deprecated-crypt-alternative`: Use the redistribution of ``crypt`` and reimplementation of ``_crypt`` libraries from PyPI.
sv: :pypi:`standard-crypt` och :pypi:`deprecated-crypt-alternative`: Använd omfördelningen av ``crypt`` och återimplementeringen av ``_crypt``-biblioteken från PyPI.

source: :mod:`!imghdr`: The :pypi:`filetype`, :pypi:`puremagic`, or :pypi:`python-magic` libraries should be used as replacements. For example, the :func:`!puremagic.what` function can be used to replace the :func:`!imghdr.what` function for all file formats that were supported by :mod:`!imghdr`.
sv: :mod:`!imghdr`: Biblioteken :pypi:`filetype`, :pypi:`puremagic` eller :pypi:`python-magic` bör användas som ersättare. Till exempel kan funktionen :func:`!puremagic.what` användas för att ersätta funktionen :func:`!imghdr.what` för alla filformat som stöddes av :mod:`!imghdr`.

source: :pypi:`standard-imghdr`: Use the redistribution of ``imghdr`` library from PyPI.
sv: :pypi:`standard-imghdr`: Använd omfördelningen av biblioteket ``imghdr`` från PyPI.

source: :mod:`!mailcap`: Use the :mod:`mimetypes` module instead.
sv: :mod:`!mailcap`: Använd modulen :mod:`mimetypes` istället.

source: :pypi:`standard-mailcap`: Use the redistribution of ``mailcap`` library from PyPI.
sv: :pypi:`standard-mailcap`: Använd omfördelningen av ``mailcap``-biblioteket från PyPI.

source: :mod:`!nntplib`: Use the :pypi:`pynntp` library from PyPI instead.
sv: :mod:`!nntplib`: Använd istället biblioteket :pypi:`pynntp` från PyPI.

source: :pypi:`standard-nntplib`: Use the redistribution of ``nntplib`` library from PyPI.
sv: :pypi:`standard-nntplib`: Använd omfördelningen av biblioteket ``nntplib`` från PyPI.

source: :mod:`!ossaudiodev`: For audio playback, use the :pypi:`pygame` library from PyPI instead.
sv: :mod:`!ossaudiodev`: För uppspelning av ljud, använd istället biblioteket :pypi:`pygame` från PyPI.

source: :mod:`!pipes`: Use the :mod:`subprocess` module instead. Use :func:`shlex.quote` to replace the undocumented ``pipes.quote`` function.
sv: :mod:`!pipes`: Använd modulen :mod:`subprocess` istället. Använd :func:`shlex.quote` för att ersätta den odokumenterade funktionen ``pipes.quote``.

source: :pypi:`standard-pipes`: Use the redistribution of ``pipes`` library from PyPI.
sv: :pypi:`standard-pipes`: Använd omfördelningen av biblioteket ``pipes`` från PyPI.

source: :mod:`!sndhdr`: The :pypi:`filetype`, :pypi:`puremagic`, or :pypi:`python-magic` libraries should be used as replacements.
sv: :mod:`!sndhdr`: Biblioteken :pypi:`filetype`, :pypi:`puremagic` eller :pypi:`python-magic` bör användas som ersättare.

source: :pypi:`standard-sndhdr`: Use the redistribution of ``sndhdr`` library from PyPI.
sv: :pypi:`standard-sndhdr`: Använd omfördelningen av biblioteket ``sndhdr`` från PyPI.

source: :mod:`!spwd`: Use the :pypi:`python-pam` library from PyPI instead.
sv: :mod:`!spwd`: Använd biblioteket :pypi:`python-pam` från PyPI istället.

source: :pypi:`standard-sunau`: Use the redistribution of ``sunau`` library from PyPI.
sv: :pypi:`standard-sunau`: Använd omfördelningen av biblioteket ``sunau`` från PyPI.

source: :mod:`!telnetlib`, Use the :pypi:`telnetlib3` or :pypi:`Exscript` libraries from PyPI instead.
sv: :mod:`!telnetlib`, Använd istället biblioteken :pypi:`telnetlib3` eller :pypi:`Exscript` från PyPI.

source: :pypi:`standard-telnetlib`: Use the redistribution of ``telnetlib`` library from PyPI.
sv: :pypi:`standard-telnetlib`: Använd omfördelningen av biblioteket ``telnetlib`` från PyPI.

source: :mod:`!uu`: Use the :mod:`base64` module instead, as a modern alternative.
sv: :mod:`!uu`: Använd modulen :mod:`base64` istället, som ett modernt alternativ.

source: :pypi:`standard-uu`: Use the redistribution of ``uu`` library from PyPI.
sv: :pypi:`standard-uu`: Använd omfördelningen av biblioteket ``uu`` från PyPI.

source: :pypi:`standard-xdrlib`: Use the redistribution of ``xdrlib`` library from PyPI.
sv: :pypi:`standard-xdrlib`: Använd omfördelningen av biblioteket ``xdrlib`` från PyPI.

source: (Contributed by Victor Stinner and Zachary Ware in :gh:`104773` and :gh:`104780`.)
sv: (Bidrag från Victor Stinner och Zachary Ware i :gh:`104773` och :gh:`104780`.)

source: Remove the :program:`2to3` program and the :mod:`!lib2to3` module, previously deprecated in Python 3.11. (Contributed by Victor Stinner in :gh:`104780`.)
sv: Ta bort programmet :program:`2to3` och modulen :mod:`!lib2to3`, som tidigare var föråldrade i Python 3.11. (Bidrag från Victor Stinner i :gh:`104780`.)

source: builtins
sv: inbyggda

source: Remove support for chained :class:`classmethod` descriptors (introduced in :gh:`63272`). These can no longer be used to wrap other descriptors, such as :class:`property`. The core design of this feature was flawed and led to several problems. To "pass-through" a :class:`classmethod`, consider using the :attr:`!__wrapped__` attribute that was added in Python 3.10. (Contributed by Raymond Hettinger in :gh:`89519`.)
sv: Ta bort stöd för kedjade :class:`classmethod`-beskrivare (introducerat i :gh:`63272`). Dessa kan inte längre användas för att omsluta andra deskriptorer, t.ex. :class:`property`. Grunddesignen för denna funktion var bristfällig och ledde till flera problem. För att "pass-through" en :class:`classmethod`, överväg att använda attributet :attr:`!__wrapped__` som lades till i Python 3.10. (Bidrag från Raymond Hettinger i :gh:`89519`.)

source: Raise a :exc:`RuntimeError` when calling :meth:`frame.clear` on a suspended frame (as has always been the case for an executing frame). (Contributed by Irit Katriel in :gh:`79932`.)
sv: Utlöser ett :exc:`RuntimeError` när man anropar :meth:`frame.clear` på en avbruten ram (vilket alltid har varit fallet för en exekverande ram). (Bidrag från Irit Katriel i :gh:`79932`.)

source: Remove the undocumented :class:`!LegacyInterpolation` class, deprecated in the docstring since Python 3.2, and at runtime since Python 3.11. (Contributed by Hugo van Kemenade in :gh:`104886`.)
sv: Ta bort den odokumenterade :class:`!LegacyInterpolation`-klassen, som är föråldrad i dokumentsträngen sedan Python 3.2 och vid körning sedan Python 3.11. (Bidrag från Hugo van Kemenade i :gh:`104886`.)

source: Remove deprecated subscript (:meth:`~object.__getitem__`) access for :ref:`EntryPoint <entry-points>` objects. (Contributed by Jason R. Coombs in :gh:`113175`.)
sv: Ta bort föråldrad subscript (:meth:`~object.__getitem__`) åtkomst för :ref:`EntryPoint <entry-points>` objekt. (Bidrag från Jason R. Coombs i :gh:`113175`.)

source: locale
sv: lokal
