Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: Add the *deprecated* parameter to the :meth:`~argparse.ArgumentParser.add_argument` and :meth:`!add_parser` methods, to enable deprecating command-line options, positional arguments, and subcommands. (Contributed by Serhiy Storchaka in :gh:`83648`.)
sv: Lägg till parametern *deprecated* i metoderna :meth:`~argparse.ArgumentParser.add_argument` och :meth:`!add_parser` för att aktivera föråldrade kommandoradsalternativ, positionella argument och underkommandon. (Bidrag från Serhiy Storchaka i :gh:`83648`.)

source: Add the ``'w'`` type code (``Py_UCS4``) for Unicode characters. It should be used instead of the deprecated ``'u'`` type code. (Contributed by Inada Naoki in :gh:`80480`.)
sv: Lägg till typkoden ``'w'`` (``Py_UCS4``) för Unicode-tecken. Den bör användas istället för den föråldrade typkoden ``'u``. (Bidrag från Inada Naoki i :gh:`80480`.)

source: Register :class:`array.array` as a :class:`~collections.abc.MutableSequence` by implementing the :meth:`~array.array.clear` method. (Contributed by Mike Zimin in :gh:`114894`.)
sv: Registrera :class:`array.array` som en :class:`~collections.abc.MutableSequence` genom att implementera metoden :meth:`~array.array.clear`. (Bidrag från Mike Zimin i :gh:`114894`.)

source: The constructors of node types in the :mod:`ast` module are now stricter in the arguments they accept, with more intuitive behavior when arguments are omitted.
sv: Konstruktörerna för nodtyper i modulen :mod:`ast` är nu striktare när det gäller vilka argument de accepterar, med ett mer intuitivt beteende när argument utelämnas.

source: If an optional field on an AST node is not included as an argument when constructing an instance, the field will now be set to ``None``. Similarly, if a list field is omitted, that field will now be set to an empty list, and if an :class:`!expr_context` field is omitted, it defaults to :class:`Load() <ast.Load>`. (Previously, in all cases, the attribute would be missing on the newly constructed AST node instance.)
sv: Om ett valfritt fält på en AST-nod inte inkluderas som ett argument när en instans konstrueras, kommer fältet nu att sättas till ``None``. På samma sätt, om ett listfält utelämnas, kommer det fältet nu att sättas till en tom lista, och om ett :class:`!expr_context`-fält utelämnas, kommer det som standard att sättas till :class:`Load() <ast.Load>`. (Tidigare saknades attributet i samtliga fall på den nykonstruerade AST-nodinstansen)

source: In all other cases, where a required argument is omitted, the node constructor will emit a :exc:`DeprecationWarning`. This will raise an exception in Python 3.15. Similarly, passing a keyword argument to the constructor that does not map to a field on the AST node is now deprecated, and will raise an exception in Python 3.15.
sv: I alla andra fall, där ett obligatoriskt argument utelämnas, kommer nodkonstruktören att avge en :exc:`DeprecationWarning`. Detta kommer att ge upphov till ett undantag i Python 3.15. På samma sätt är det nu föråldrat att skicka ett nyckelordsargument till konstruktören som inte mappar till ett fält på AST-noden och det kommer att leda till ett undantag i Python 3.15.

source: These changes do not apply to user-defined subclasses of :class:`ast.AST` unless the class opts in to the new behavior by defining the :attr:`.AST._field_types` mapping.
sv: Dessa ändringar gäller inte för användardefinierade underklasser till :class:`ast.AST` om inte klassen väljer att använda det nya beteendet genom att definiera :attr:`.AST._field_types`-mappningen.

source: (Contributed by Jelle Zijlstra in :gh:`105858`, :gh:`117486`, and :gh:`118851`.)
sv: (Bidrag från Jelle Zijlstra i :gh:`105858`, :gh:`117486`, och :gh:`118851`.)

source: :func:`ast.parse` now accepts an optional argument *optimize* which is passed on to :func:`compile`. This makes it possible to obtain an optimized AST. (Contributed by Irit Katriel in :gh:`108113`.)
sv: :func:`ast.parse` accepterar nu ett valfritt argument *optimize* som skickas vidare till :func:`compile`. Detta gör det möjligt att erhålla en optimerad AST. (Bidrag från Irit Katriel i :gh:`108113`.)

source: :func:`asyncio.as_completed` now returns an object that is both an :term:`asynchronous iterator` and a plain :term:`iterator` of :term:`awaitables <awaitable>`. The awaitables yielded by asynchronous iteration include original task or future objects that were passed in, making it easier to associate results with the tasks being completed. (Contributed by Justin Arthur in :gh:`77714`.)
sv: :func:`asyncio.as_completed` returnerar nu ett objekt som är både en :term:`asynkron iterator` och en vanlig :term:`iterator` av :term:`awaitables <awaitable>`. De awaitables som returneras av asynkron iteration inkluderar ursprungliga uppgifts- eller framtidsobjekt som skickades in, vilket gör det enklare att associera resultat med de uppgifter som slutförs. (Bidrag från Justin Arthur i :gh:`77714`.)

source: :meth:`asyncio.loop.create_unix_server` will now automatically remove the Unix socket when the server is closed. (Contributed by Pierre Ossman in :gh:`111246`.)
sv: :meth:`asyncio.loop.create_unix_server` kommer nu automatiskt att ta bort Unix-sockeln när servern stängs. (Bidrag från Pierre Ossman i :gh:`111246`.)

source: :meth:`.DatagramTransport.sendto` will now send zero-length datagrams if called with an empty bytes object. The transport flow control also now accounts for the datagram header when calculating the buffer size. (Contributed by Jamie Phan in :gh:`115199`.)
sv: :meth:`.DatagramTransport.sendto` kommer nu att skicka datagram med noll längd om det anropas med ett tomt bytes-objekt. Transportflödeskontrollen tar nu också hänsyn till datagramhuvudet när buffertstorleken beräknas. (Bidrag från Jamie Phan i :gh:`115199`.)

source: Add :meth:`Queue.shutdown <asyncio.Queue.shutdown>` and :exc:`~asyncio.QueueShutDown` to manage queue termination. (Contributed by Laurie Opperman and Yves Duprat in :gh:`104228`.)
sv: Lägg till :meth:`Queue.shutdown <asyncio.Queue.shutdown>` och :exc:`~asyncio.QueueShutDown` för att hantera köavslut. (Bidrag från Laurie Opperman och Yves Duprat i :gh:`104228`.)

source: Add the :meth:`.Server.close_clients` and :meth:`.Server.abort_clients` methods, which more forcefully close an asyncio server. (Contributed by Pierre Ossman in :gh:`113538`.)
sv: Lägg till metoderna :meth:`.Server.close_clients` och :meth:`.Server.abort_clients`, som mer kraftfullt stänger en asyncio-server. (Bidrag från Pierre Ossman i :gh:`113538`.)

source: Accept a tuple of separators in :meth:`.StreamReader.readuntil`, stopping when any one of them is encountered. (Contributed by Bruce Merry in :gh:`81322`.)
sv: Accepterar en tupel av separatorer i :meth:`.StreamReader.readuntil`, och stoppar när någon av dem påträffas. (Bidrag från Bruce Merry i :gh:`81322`.)

source: Improve the behavior of :class:`~asyncio.TaskGroup` when an external cancellation collides with an internal cancellation. For example, when two task groups are nested and both experience an exception in a child task simultaneously, it was possible that the outer task group would hang, because its internal cancellation was swallowed by the inner task group.
sv: Förbättra beteendet hos :class:`~asyncio.TaskGroup` när en extern annullering kolliderar med en intern annullering. Till exempel, när två uppgiftsgrupper är nästlade och båda upplever ett undantag i en underordnad uppgift samtidigt, var det möjligt att den yttre uppgiftsgruppen skulle hänga sig, eftersom dess interna annullering svaldes av den inre uppgiftsgruppen.

source: In the case where a task group is cancelled externally and also must raise an :exc:`ExceptionGroup`, it will now call the parent task's :meth:`~asyncio.Task.cancel` method. This ensures that a :exc:`~asyncio.CancelledError` will be raised at the next :keyword:`await`, so the cancellation is not lost.
sv: I det fall en uppgiftsgrupp avbryts externt och även måste skapa en :exc:`ExceptionGroup`, kommer den nu att anropa den överordnade uppgiftens :meth:`~asyncio.Task.cancel`-metod. Detta säkerställer att ett :exc:`~asyncio.CancelledError` kommer att uppstå vid nästa :keyword:`await`, så att annulleringen inte går förlorad.

source: An added benefit of these changes is that task groups now preserve the cancellation count (:meth:`~asyncio.Task.cancelling`).
sv: En extra fördel med dessa ändringar är att uppgiftsgrupper nu bevarar antalet avbokningar (:meth:`~asyncio.Task.cancelling`).

source: In order to handle some corner cases, :meth:`~asyncio.Task.uncancel` may now reset the undocumented ``_must_cancel`` flag when the cancellation count reaches zero.
sv: För att hantera vissa hörnfall kan :meth:`~asyncio.Task.uncancel` nu återställa den odokumenterade flaggan ``_must_cancel`` när antalet avbokningar når noll.

source: (Inspired by an issue reported by Arthur Tacca in :gh:`116720`.)
sv: (Inspirerad av ett problem som rapporterades av Arthur Tacca i :gh:`116720`.)

source: When :meth:`.TaskGroup.create_task` is called on an inactive :class:`~asyncio.TaskGroup`, the given coroutine will be closed (which prevents a :exc:`RuntimeWarning` about the given coroutine being never awaited). (Contributed by Arthur Tacca and Jason Zhang in :gh:`115957`.)
sv: När :meth:`.TaskGroup.create_task` anropas på en inaktiv :class:`~asyncio.TaskGroup`, kommer den givna coroutinen att stängas (vilket förhindrar en :exc:`RuntimeWarning` om att den givna coroutinen aldrig väntas). (Bidrag från Arthur Tacca och Jason Zhang i :gh:`115957`.)

source: The function and methods named ``create_task`` have received a new ``**kwargs`` argument that is passed through to the task constructor. This change was accidentally added in 3.13.3, and broke the API contract for custom task factories. Several third-party task factories implemented workarounds for this. In 3.13.4 and later releases the old factory contract is honored once again (until 3.14). To keep the workarounds working, the extra ``**kwargs`` argument still allows passing additional keyword arguments to :class:`~asyncio.Task` and to custom task factories.
sv: Funktionen och metoderna med namnet ``create_task`` har fått ett nytt ``**kwargs``-argument som skickas till uppgiftskonstruktören. Den här ändringen lades till av misstag i 3.13.3 och bröt API-kontraktet för anpassade uppgiftsfabriker. Flera uppgiftsfabriker från tredje part implementerade lösningar för detta. I 3.13.4 och senare utgåvor respekteras det gamla fabriksavtalet igen (fram till 3.14). För att hålla lösningarna fungerande tillåter det extra ``**kwargs``-argumentet fortfarande att man skickar ytterligare nyckelordsargument till :class:`~asyncio.Task` och till anpassade uppgiftsfabriker.

source: This affects the following function and methods: :meth:`asyncio.create_task`, :meth:`asyncio.loop.create_task`, :meth:`asyncio.TaskGroup.create_task`. (Contributed by Thomas Grainger in :gh:`128307`.)
sv: Detta påverkar följande funktioner och metoder: :meth:`asyncio.create_task`, :meth:`asyncio.loop.create_task`, :meth:`asyncio.TaskGroup.create_task`. (Bidrag från Thomas Grainger i :gh:`128307`.)

source: base64
sv: bas64

source: Add :func:`~base64.z85encode` and :func:`~base64.z85decode` functions for encoding :class:`bytes` as `Z85 data`_ and decoding Z85-encoded data to :class:`!bytes`. (Contributed by Matan Perelman in :gh:`75299`.)
sv: Lägg till funktionerna :func:`~base64.z85encode` och :func:`~base64.z85decode` för kodning av :class:`bytes` som `Z85 data`_ och avkodning av Z85-kodade data till :class:`!bytes`. (Bidrag från Matan Perelman i :gh:`75299`.)

source: compileall
sv: kompilera alla

source: The default number of worker threads and processes is now selected using :func:`os.process_cpu_count` instead of :func:`os.cpu_count`. (Contributed by Victor Stinner in :gh:`109649`.)
sv: Standardantalet arbetstrådar och processer väljs nu med hjälp av :func:`os.process_cpu_count` istället för :func:`os.cpu_count`. (Bidrag från Victor Stinner i :gh:`109649`.)

source: configparser
sv: konfigurationsanalysator

source: :class:`~configparser.ConfigParser` now has support for unnamed sections, which allows for top-level key-value pairs. This can be enabled with the new *allow_unnamed_section* parameter. (Contributed by Pedro Sousa Lacerda in :gh:`66449`.)
sv: :class:`~configparser.ConfigParser` har nu stöd för icke namngivna sektioner, vilket möjliggör nyckel-värdepar på toppnivå. Detta kan aktiveras med den nya parametern *allow_unnamed_section*. (Bidrag från Pedro Sousa Lacerda i :gh:`66449`.)

source: copy
sv: kopiera

source: The new :func:`~copy.replace` function and the :meth:`replace protocol <object.__replace__>` make creating modified copies of objects much simpler. This is especially useful when working with immutable objects. The following types support the :func:`~copy.replace` function and implement the replace protocol:
sv: Den nya funktionen :func:`~copy.replace` och :meth:`replace protocol <object.__replace__>` gör det mycket enklare att skapa modifierade kopior av objekt. Detta är särskilt användbart när man arbetar med oföränderliga objekt. Följande typer stöder funktionen :func:`~copy.replace` och implementerar replace-protokollet:

source: :func:`collections.namedtuple`
sv: :func:`kollektioner.namntuple`

source: :class:`dataclasses.dataclass`
sv: :class:`dataklasser.dataklass`

source: :ref:`code objects <code-objects>`
sv: :ref:`kodobjekt <code-objects>`

source: Any user-defined class can also support :func:`copy.replace` by defining the :meth:`~object.__replace__` method. (Contributed by Serhiy Storchaka in :gh:`108751`.)
sv: Alla användardefinierade klasser kan också stödja :func:`copy.replace` genom att definiera metoden :meth:`~object.__replace__`. (Bidrag från Serhiy Storchaka i :gh:`108751`.)

source: ctypes
sv: ctyper

source: As a consequence of necessary internal refactoring, initialization of internal metaclasses now happens in ``__init__`` rather than in ``__new__``. This affects projects that subclass these internal metaclasses to provide custom initialization. Generally:
sv: Som en följd av en nödvändig intern refaktorisering sker initialiseringen av interna metaklasser nu i ``__init__`` i stället för i ``__new__``. Detta påverkar projekt som underklassar dessa interna metaklasser för att tillhandahålla anpassad initialisering. I allmänhet:

source: Custom logic that was done in ``__new__`` after calling ``super().__new__`` should be moved to ``__init__``.
sv: Anpassad logik som gjordes i ``__new__`` efter anrop av ``super().__new__`` bör flyttas till ``__init__``.

source: To create a class, call the metaclass, not only the metaclass's ``__new__`` method.
sv: För att skapa en klass anropar du metaklassen, inte bara metaklassens metod ``__new__``.

source: See :gh:`124520` for discussion and links to changes in some affected projects.
sv: Se :gh:`124520` för diskussion och länkar till ändringar i vissa berörda projekt.

source: :class:`ctypes.Structure` objects have a new :attr:`~ctypes.Structure._align_` attribute which allows the alignment of the structure being packed to/from memory to be specified explicitly. (Contributed by Matt Sanderson in :gh:`112433`)
sv: :class:`ctypes.Structure`-objekt har ett nytt :attr:`~ctypes.Structure._align_`-attribut som gör det möjligt att explicit ange inriktningen för den struktur som packas till/från minnet. (Bidrag från Matt Sanderson i :gh:`112433`)

source: Add :mod:`dbm.sqlite3`, a new module which implements an SQLite backend, and make it the default :mod:`!dbm` backend. (Contributed by Raymond Hettinger and Erlend E. Aasland in :gh:`100414`.)
sv: Lägg till :mod:`dbm.sqlite3`, en ny modul som implementerar en SQLite-backend, och gör den till standard :mod:`!dbm`-backend. (Bidrag från Raymond Hettinger och Erlend E. Aasland i :gh:`100414`.)

source: Allow removing all items from the database through the new :meth:`.gdbm.clear` and :meth:`.ndbm.clear` methods. (Contributed by Donghee Na in :gh:`107122`.)
sv: Gör det möjligt att ta bort alla objekt från databasen genom de nya metoderna :meth:`.gdbm.clear` och :meth:`.ndbm.clear`. (Bidrag från Donghee Na i :gh:`107122`.)

source: Change the output of :mod:`dis` module functions to show logical labels for jump targets and exception handlers, rather than offsets. The offsets can be added with the new :option:`-O <dis --show-offsets>` command-line option or the *show_offsets* argument. (Contributed by Irit Katriel in :gh:`112137`.)
sv: Ändra utdata för modulfunktionerna :mod:`dis` så att logiska etiketter för hoppmål och undantagshanterare visas i stället för offsets. Offseten kan läggas till med det nya kommandoradsalternativet :option:`-O <dis --show-offsets>` eller argumentet *show_offsets*. (Bidrag från Irit Katriel i :gh:`112137`.)

source: :meth:`~dis.get_instructions` no longer represents cache entries as separate instructions. Instead, it returns them as part of the :class:`~dis.Instruction`, in the new *cache_info* field. The *show_caches* argument to :meth:`~dis.get_instructions` is deprecated and no longer has any effect. (Contributed by Irit Katriel in :gh:`112962`.)
sv: :meth:`~dis.get_instructions` representerar inte längre cacheposter som separata instruktioner. Istället returneras de som en del av :class:`~dis.Instruction`, i det nya fältet *cache_info*. Argumentet *show_caches* till :meth:`~dis.get_instructions` är föråldrat och har inte längre någon effekt. (Bidrag från Irit Katriel i :gh:`112962`.)

source: doctest
sv: doktest

source: :mod:`doctest` output is now colored by default. This can be controlled via the new :envvar:`PYTHON_COLORS` environment variable as well as the canonical |NO_COLOR|_ and |FORCE_COLOR|_ environment variables. See also :ref:`using-on-controlling-color`. (Contributed by Hugo van Kemenade in :gh:`117225`.)
sv: :mod:`doctest`-utdata är nu färgade som standard. Detta kan kontrolleras via den nya miljövariabeln :envvar:`PYTHON_COLORS` samt de kanoniska miljövariablerna |NO_COLOR|_ och |FORCE_COLOR|_. Se även :ref:`using-on-controlling-color`. (Bidrag från Hugo van Kemenade i :gh:`117225`.)

source: The :meth:`.DocTestRunner.run` method now counts the number of skipped tests. Add the :attr:`.DocTestRunner.skips` and :attr:`.TestResults.skipped` attributes. (Contributed by Victor Stinner in :gh:`108794`.)
sv: Metoden :meth:`.DocTestRunner.run` räknar nu antalet överhoppade tester. Lägg till attributen :attr:`.DocTestRunner.skips` och :attr:`.TestResults.skipped`. (Bidrag från Victor Stinner i :gh:`108794`.)

source: email
sv: e-post

source: Headers with embedded newlines are now quoted on output. The :mod:`~email.generator` will now refuse to serialize (write) headers that are improperly folded or delimited, such that they would be parsed as multiple headers or joined with adjacent data. If you need to turn this safety feature off, set :attr:`~email.policy.Policy.verify_generated_headers`. (Contributed by Bas Bloemsaat and Petr Viktorin in :gh:`121650`.)
sv: Rubriker med inbäddade nya linjer citeras nu vid utmatning. :mod:`~email.generator` vägrar nu att serialisera (skriva) rubriker som är felaktigt vikta eller avgränsade, så att de skulle tolkas som flera rubriker eller sammanfogas med angränsande data. Om du behöver stänga av den här säkerhetsfunktionen, ange :attr:`~email.policy.Policy.verify_generated_headers`. (Bidrag från Bas Bloemsaat och Petr Viktorin i :gh:`121650`.)

source: :func:`~email.utils.getaddresses` and :func:`~email.utils.parseaddr` now return ``('', '')`` pairs in more situations where invalid email addresses are encountered instead of potentially inaccurate values. The two functions have a new optional *strict* parameter (default ``True``). To get the old behavior (accepting malformed input), use ``strict=False``. ``getattr(email.utils, 'supports_strict_parsing', False)`` can be used to check if the *strict* parameter is available. (Contributed by Thomas Dwyer and Victor Stinner for :gh:`102988` to improve the :cve:`2023-27043` fix.)
sv: :func:`~email.utils.getaddresses` och :func:`~email.utils.parseaddr` returnerar nu ``('', ''')`` par i fler situationer där ogiltiga e-postadresser påträffas istället för potentiellt felaktiga värden. De två funktionerna har en ny valfri *strict*-parameter (standard ``True``). För att få det gamla beteendet (acceptera felaktig inmatning), använd ``strict=False``. ``getattr(email.utils, 'supports_strict_parsing', False)`` kan användas för att kontrollera om parametern *strict* är tillgänglig. (Bidrag från Thomas Dwyer och Victor Stinner för :gh:`102988` för att förbättra :cve:`2023-27043`-fixen)

source: :class:`~enum.EnumDict` has been made public to better support subclassing :class:`~enum.EnumType`.
sv: :class:`~enum.EnumDict` har gjorts publik för att bättre stödja subklassning av :class:`~enum.EnumType`.

source: fractions
sv: fraktioner

source: :class:`~fractions.Fraction` objects now support the standard :ref:`format specification mini-language <formatspec>` rules for fill, alignment, sign handling, minimum width, and grouping. (Contributed by Mark Dickinson in :gh:`111320`.)
sv: :class:`~fractions.Fraction`-objekt stöder nu standard :ref:``format specification mini-language <formatspec>`-reglerna för fyllning, justering, teckenhantering, minsta bredd och gruppering. (Bidrag från Mark Dickinson i :gh:`111320`.)

source: glob
sv: klot

source: Add :func:`~glob.translate`, a function to convert a path specification with shell-style wildcards to a regular expression. (Contributed by Barney Gale in :gh:`72904`.)
sv: Lägg till :func:`~glob.translate`, en funktion för att konvertera en sökvägsspecifikation med jokertecken i shell-stil till ett reguljärt uttryck. (Bidrag från Barney Gale i :gh:`72904`.)

source: The following functions in :mod:`importlib.resources` now allow accessing a directory (or tree) of resources, using multiple positional arguments (the *encoding* and *errors* arguments in the text-reading functions are now keyword-only):
sv: Följande funktioner i :mod:`importlib.resources` tillåter nu åtkomst till en katalog (eller ett träd) med resurser, med hjälp av flera positionella argument (argumenten *encoding* och *errors* i textläsningsfunktionerna är nu endast nyckelord):

source: These functions are no longer deprecated and are not scheduled for removal. (Contributed by Petr Viktorin in :gh:`116608`.)
sv: Dessa funktioner är inte längre föråldrade och är inte planerade att tas bort. (Bidrag från Petr Viktorin i :gh:`116608`.)

source: :func:`~importlib.resources.contents` remains deprecated in favor of the fully-featured :class:`~importlib.resources.abc.Traversable` API. However, there is now no plan to remove it. (Contributed by Petr Viktorin in :gh:`116608`.)
sv: :func:`~importlib.resources.contents` är fortfarande föråldrad till förmån för det fullt utrustade :class:`~importlib.resources.abc.Traversable` API:et. Det finns dock nu ingen plan på att ta bort det. (Bidrag från Petr Viktorin i :gh:`116608`.)

source: The :class:`~io.IOBase` finalizer now logs any errors raised by the :meth:`~io.IOBase.close` method with :data:`sys.unraisablehook`. Previously, errors were ignored silently by default, and only logged in :ref:`Python Development Mode <devmode>` or when using a :ref:`Python debug build <debug-build>`. (Contributed by Victor Stinner in :gh:`62948`.)
sv: Finalizern :class:`~io.IOBase` loggar nu alla fel som uppstår i metoden :meth:`~io.IOBase.close` med :data:`sys.unraisablehook`. Tidigare ignorerades fel tyst som standard, och loggades endast i :ref:`Python Development Mode <devmode>` eller när man använde en :ref:`Python debug build <debug-build>`. (Bidrag från Victor Stinner i :gh:`62948`.)

source: ipaddress
sv: ipadress
