Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: Add fixed variants of functions which silently ignore errors:
sv: Lägg till fasta varianter av funktioner som tyst ignorerar fel:

source: :c:func:`PyObject_HasAttrWithError` replaces :c:func:`PyObject_HasAttr`.
sv: :c:func:`PyObject_HasAttrWithError` ersätter :c:func:`PyObject_HasAttr`.

source: :c:func:`PyObject_HasAttrStringWithError` replaces :c:func:`PyObject_HasAttrString`.
sv: :c:func:`PyObject_HasAttrStringWithError` ersätter :c:func:`PyObject_HasAttrString`.

source: :c:func:`PyMapping_HasKeyWithError` replaces :c:func:`PyMapping_HasKey`.
sv: :c:func:`PyMapping_HasKeyWithError` ersätter :c:func:`PyMapping_HasKey`.

source: :c:func:`PyMapping_HasKeyStringWithError` replaces :c:func:`PyMapping_HasKeyString`.
sv: :c:func:`PyMapping_HasKeyStringWithError` ersätter :c:func:`PyMapping_HasKeyString`.

source: The new functions return ``-1`` for errors and the standard ``1`` for true and ``0`` for false.
sv: De nya funktionerna returnerar ``-1`` för fel och standard ``1`` för sant och ``0`` för falskt.

source: (Contributed by Serhiy Storchaka in :gh:`108511`.)
sv: (Bidrag från Serhiy Storchaka i :gh:`108511`.)

source: Changed C APIs
sv: Ändrade C API:er

source: The *keywords* parameter of :c:func:`PyArg_ParseTupleAndKeywords` and :c:func:`PyArg_VaParseTupleAndKeywords` now has type :c:expr:`char * const *` in C and :c:expr:`const char * const *` in C++, instead of :c:expr:`char **`. In C++, this makes these functions compatible with arguments of type :c:expr:`const char * const *`, :c:expr:`const char **`, or :c:expr:`char * const *` without an explicit type cast. In C, the functions only support arguments of type :c:expr:`char * const *`. This can be overridden with the :c:macro:`PY_CXX_CONST` macro. (Contributed by Serhiy Storchaka in :gh:`65210`.)
sv: Parametern *keywords* i :c:func:`PyArg_ParseTupleAndKeywords` och :c:func:`PyArg_VaParseTupleAndKeywords` har nu typen :c:expr:`char * const *` i C och :c:expr:`const char * const *` i C++, istället för :c:expr:`char **`. I C++ gör detta dessa funktioner kompatibla med argument av typen :c:expr:`const char * const *`, :c:expr:`const char **` eller :c:expr:`char * const *` utan en explicit typcast. I C stöder funktionerna endast argument av typen :c:expr:`char * const *`. Detta kan åsidosättas med makrot :c:macro:`PY_CXX_CONST`. (Bidrag från Serhiy Storchaka i :gh:`65210`.)

source: :c:func:`PyArg_ParseTupleAndKeywords` now supports non-ASCII keyword parameter names. (Contributed by Serhiy Storchaka in :gh:`110815`.)
sv: :c:func:`PyArg_ParseTupleAndKeywords` stöder nu parameternamn för nyckelord som inte är ASCII. (Bidrag från Serhiy Storchaka i :gh:`110815`.)

source: The :c:func:`!PyCode_GetFirstFree` function is now unstable API and is now named :c:func:`PyUnstable_Code_GetFirstFree`. (Contributed by Bogdan Romanyuk in :gh:`115781`.)
sv: Funktionen :c:func:`!PyCode_GetFirstFree` är nu ett instabilt API och heter nu :c:func:`PyUnstable_Code_GetFirstFree`. (Bidrag från Bogdan Romanyuk i :gh:`115781`.)

source: The :c:func:`PyDict_GetItem`, :c:func:`PyDict_GetItemString`, :c:func:`PyMapping_HasKey`, :c:func:`PyMapping_HasKeyString`, :c:func:`PyObject_HasAttr`, :c:func:`PyObject_HasAttrString`, and :c:func:`PySys_GetObject` functions, each of which clears all errors which occurred when calling them now reports these errors using :func:`sys.unraisablehook`. You may replace them with other functions as recommended in the documentation. (Contributed by Serhiy Storchaka in :gh:`106672`.)
sv: Funktionerna :c:func:`PyDict_GetItem`, :c:func:`PyDict_GetItemString`, :c:func:`PyMapping_HasKey`, :c:func:`PyMapping_HasKeyString`, :c:func:`PyObject_HasAttr`, :c:func:`PyObject_HasAttrString`, och :c:func:`PySys_GetObject` funktioner, som var och en rensar alla fel som uppstod när de anropades, rapporterar nu dessa fel med :func:`sys.unraisablehook`. Du kan ersätta dem med andra funktioner enligt rekommendationerna i dokumentationen. (Bidrag från Serhiy Storchaka i :gh:`106672`.)

source: Add support for the ``%T``, ``%#T``, ``%N`` and ``%#N`` formats to :c:func:`PyUnicode_FromFormat`:
sv: Lägg till stöd för formaten ``%T``, ``%#T``, ``%N`` och ``%#N`` till :c:func:`PyUnicode_FromFormat`:

source: ``%T``: Get the fully qualified name of an object type
sv: ``%T``: Hämta det fullständigt kvalificerade namnet på en objekttyp

source: ``%#T``: As above, but use a colon as the separator
sv: ``%#T``: Som ovan, men använd ett kolon som avgränsare

source: ``%N``: Get the fully qualified name of a type
sv: ``%N``: Hämta det fullständigt kvalificerade namnet på en typ

source: ``%#N``: As above, but use a colon as the separator
sv: ``%#N``: Som ovan, men använd ett kolon som separator

source: See :pep:`737` for more information. (Contributed by Victor Stinner in :gh:`111696`.)
sv: Se :pep:`737` för mer information. (Bidrag från Victor Stinner i :gh:`111696`.)

source: You no longer have to define the ``PY_SSIZE_T_CLEAN`` macro before including :file:`Python.h` when using ``#`` formats in :ref:`format codes <arg-parsing-string-and-buffers>`. APIs accepting the format codes always use ``Py_ssize_t`` for ``#`` formats. (Contributed by Inada Naoki in :gh:`104922`.)
sv: Du behöver inte längre definiera makrot ``PY_SSIZE_T_CLEAN`` innan du inkluderar :file:`Python.h`` när du använder ``#`` format i :ref:`formatkoder <arg-parsing-string-and-buffers>``. API:er som accepterar formatkoderna använder alltid ``Py_ssize_t`` för ``#``-format. (Bidrag från Inada Naoki i :gh:`104922`.)

source: If Python is built in :ref:`debug mode <debug-build>` or :option:`with assertions <--with-assertions>`, :c:func:`PyTuple_SET_ITEM` and :c:func:`PyList_SET_ITEM` now check the index argument with an assertion. (Contributed by Victor Stinner in :gh:`106168`.)
sv: Om Python är byggt i :ref:`debugläge <debug-build>` eller :option:`med assertions <--with-assertions>`, kontrollerar nu :c:func:`PyTuple_SET_ITEM` och :c:func:`PyList_SET_ITEM` index-argumentet med en assertion. (Bidrag från Victor Stinner i :gh:`106168`.)

source: Limited C API Changes
sv: Ändringar i API för begränsad C

source: The following functions are now included in the Limited C API:
sv: Följande funktioner ingår nu i det begränsade C API:et:

source: (Contributed by Victor Stinner in :gh:`85283`, :gh:`85283`, and :gh:`116936`.)
sv: (Bidrag från Victor Stinner i :gh:`85283`, :gh:`85283`, och :gh:`116936`.)

source: Python built with :option:`--with-trace-refs` (tracing references) now supports the :ref:`Limited API <limited-c-api>`. (Contributed by Victor Stinner in :gh:`108634`.)
sv: Python byggt med :option:`--with-trace-refs` (spårning av referenser) stöder nu :ref:`Limited API <limited-c-api>`. (Bidrag från Victor Stinner i :gh:`108634`.)

source: Removed C APIs
sv: Borttagna C API:er

source: Remove several functions, macros, variables, etc with names prefixed by ``_Py`` or ``_PY`` (which are considered private). If your project is affected by one of these removals and you believe that the removed API should remain available, please :ref:`open a new issue <using-the-tracker>` to request a public C API and add ``cc: @vstinner`` to the issue to notify Victor Stinner. (Contributed by Victor Stinner in :gh:`106320`.)
sv: Ta bort flera funktioner, makron, variabler, etc med namn som inleds med ``_Py`` eller ``_PY`` (som anses vara privata). Om ditt projekt påverkas av en av dessa borttagningar och du anser att det borttagna API:et bör förbli tillgängligt, vänligen :ref:``öppna en ny fråga <using-the-tracker>` för att begära ett offentligt C API och lägg till ``cc: @vstinner`` till frågan för att meddela Victor Stinner. (Bidrag från Victor Stinner i :gh:`106320`.)

source: Remove old buffer protocols deprecated in Python 3.0. Use :ref:`bufferobjects` instead.
sv: Ta bort gamla buffertprotokoll som är föråldrade i Python 3.0. Använd :ref:`bufferobjects` istället.

source: :c:func:`!PyObject_CheckReadBuffer`: Use :c:func:`PyObject_CheckBuffer` to test whether the object supports the buffer protocol. Note that :c:func:`PyObject_CheckBuffer` doesn't guarantee that :c:func:`PyObject_GetBuffer` will succeed. To test if the object is actually readable, see the next example of :c:func:`PyObject_GetBuffer`.
sv: :c:func:`!PyObject_CheckReadBuffer`: Använd :c:func:`PyObject_CheckBuffer` för att testa om objektet stöder buffertprotokollet. Observera att :c:func:`PyObject_CheckBuffer` inte garanterar att :c:func:`PyObject_GetBuffer` kommer att lyckas. För att testa om objektet faktiskt är läsbart, se nästa exempel på :c:func:`PyObject_GetBuffer`.

source: :c:func:`!PyObject_AsCharBuffer`, :c:func:`!PyObject_AsReadBuffer`: Use :c:func:`PyObject_GetBuffer` and :c:func:`PyBuffer_Release` instead:
sv: :c:func:`!PyObject_AsCharBuffer`, :c:func:`!PyObject_AsReadBuffer`: Använd :c:func:`PyObject_GetBuffer` och :c:func:`PyBuffer_Release` istället:

source: Py_buffer view; if (PyObject_GetBuffer(obj, &view, PyBUF_SIMPLE) < 0) { return NULL; } // Use `view.buf` and `view.len` to read from the buffer. // You may need to cast buf as `(const char*)view.buf`. PyBuffer_Release(&view);
sv: Py_buffer vy; if (PyObject_GetBuffer(obj, &view, PyBUF_SIMPLE) < 0) { returnera NULL; } // Använd `view.buf` och `view.len` för att läsa från bufferten. // Du kan behöva casta buf som `(const char*)view.buf`. PyBuffer_Release(&view);

source: :c:func:`!PyObject_AsWriteBuffer`: Use :c:func:`PyObject_GetBuffer` and :c:func:`PyBuffer_Release` instead:
sv: :c:func:`!PyObject_AsWriteBuffer`: Använd :c:func:`PyObject_GetBuffer` och :c:func:`PyBuffer_Release` istället:

source: Py_buffer view; if (PyObject_GetBuffer(obj, &view, PyBUF_WRITABLE) < 0) { return NULL; } // Use `view.buf` and `view.len` to write to the buffer. PyBuffer_Release(&view);
sv: Py_buffer vy; if (PyObject_GetBuffer(obj, &view, PyBUF_WRITABLE) < 0) { returnera NULL; } // Använd `view.buf` och `view.len` för att skriva till bufferten. PyBuffer_Release(&view);

source: (Contributed by Inada Naoki in :gh:`85275`.)
sv: (Bidrag från Inada Naoki i :gh:`85275`.)

source: Remove various functions deprecated in Python 3.9:
sv: Ta bort olika funktioner som är föråldrade i Python 3.9:

source: :c:func:`!PyEval_CallObject`, :c:func:`!PyEval_CallObjectWithKeywords`: Use :c:func:`PyObject_CallNoArgs` or :c:func:`PyObject_Call` instead.
sv: :c:func:`!PyEval_CallObject`, :c:func:`!PyEval_CallObjectWithKeywords`: Använd :c:func:`PyObject_CallNoArgs` eller :c:func:`PyObject_Call` istället.

source: In :c:func:`PyObject_Call`, positional arguments must be a :class:`tuple` and must not be ``NULL``, and keyword arguments must be a :class:`dict` or ``NULL``, whereas the removed functions checked argument types and accepted ``NULL`` positional and keyword arguments. To replace ``PyEval_CallObjectWithKeywords(func, NULL, kwargs)`` with :c:func:`PyObject_Call`, pass an empty tuple as positional arguments using :c:func:`PyTuple_New(0) <PyTuple_New>`.
sv: I :c:func:`PyObject_Call` måste positionella argument vara en :class:`tuple` och får inte vara ``NULL``, och nyckelordsargument måste vara en :class:`dict` eller ``NULL``, medan de borttagna funktionerna kontrollerade argumenttyper och accepterade ``NULL`` positionella och nyckelordsargument. För att ersätta ``PyEval_CallObjectWithKeywords(func, NULL, kwargs)`` med :c:func:`PyObject_Call`, skicka en tom tupel som positionella argument med :c:func:`PyTuple_New(0) <PyTuple_New>`.

source: :c:func:`!PyEval_CallFunction`: Use :c:func:`PyObject_CallFunction` instead.
sv: :c:func:`!PyEval_CallFunction`: Använd :c:func:`PyObject_CallFunction` istället.

source: :c:func:`!PyEval_CallMethod`: Use :c:func:`PyObject_CallMethod` instead.
sv: :c:func:`!PyEval_CallMethod`: Använd :c:func:`PyObject_CallMethod` istället.

source: :c:func:`!PyCFunction_Call`: Use :c:func:`PyObject_Call` instead.
sv: :c:func:`!PyCFunction_Call`: Använd :c:func:`PyObject_Call` istället.

source: (Contributed by Victor Stinner in :gh:`105107`.)
sv: (Bidrag från Victor Stinner i :gh:`105107`.)

source: Remove the following old functions to configure the Python initialization, deprecated in Python 3.11:
sv: Ta bort följande gamla funktioner för att konfigurera Python-initialiseringen, föråldrade i Python 3.11:

source: :c:func:`!PySys_AddWarnOptionUnicode`: Use :c:member:`PyConfig.warnoptions` instead.
sv: :c:func:`!PySys_AddWarnOptionUnicode`: Använd :c:member:`PyConfig.warnoptions` istället.

source: :c:func:`!PySys_AddWarnOption`: Use :c:member:`PyConfig.warnoptions` instead.
sv: :c:func:`!PySys_AddWarnOption`: Använd :c:member:`PyConfig.warnoptions` istället.

source: :c:func:`!PySys_AddXOption`: Use :c:member:`PyConfig.xoptions` instead.
sv: :c:func:`!PySys_AddXOption`: Använd :c:member:`PyConfig.xoptions` istället.

source: :c:func:`!PySys_HasWarnOptions`: Use :c:member:`PyConfig.xoptions` instead.
sv: :c:func:`!PySys_HasWarnOptions`: Använd :c:member:`PyConfig.xoptions` istället.

source: :c:func:`!PySys_SetPath`: Set :c:member:`PyConfig.module_search_paths` instead.
sv: :c:func:`!PySys_SetPath`: Ställ in :c:member:`PyConfig.module_search_paths` istället.

source: :c:func:`!Py_SetPath`: Set :c:member:`PyConfig.module_search_paths` instead.
sv: :c:func:`!Py_SetPath`: Ställ in :c:member:`PyConfig.module_search_paths` istället.

source: :c:func:`!Py_SetStandardStreamEncoding`: Set :c:member:`PyConfig.stdio_encoding` instead, and set also maybe :c:member:`PyConfig.legacy_windows_stdio` (on Windows).
sv: :c:func:`!Py_SetStandardStreamEncoding`: Ställ in :c:member:`PyConfig.stdio_encoding` istället, och ställ kanske också in :c:member:`PyConfig.legacy_windows_stdio` (på Windows).

source: :c:func:`!_Py_SetProgramFullPath`: Set :c:member:`PyConfig.executable` instead.
sv: :c:func:`!_Py_SetProgramFullPath`: Ställ in :c:member:`PyConfig.executable` istället.

source: Use the new :c:type:`PyConfig` API of the :ref:`Python Initialization Configuration <init-config>` instead (:pep:`587`), added to Python 3.8. (Contributed by Victor Stinner in :gh:`105145`.)
sv: Använd istället det nya :c:type:`PyConfig` API:et i :ref:`Python Initialization Configuration <init-config>` (:pep:`587`), som tillkommit i Python 3.8. (Bidrag från Victor Stinner i :gh:`105145`.)

source: Remove :c:func:`!PyEval_AcquireLock` and :c:func:`!PyEval_ReleaseLock` functions, deprecated in Python 3.2. They didn't update the current thread state. They can be replaced with:
sv: Ta bort funktionerna :c:func:`!PyEval_AcquireLock` och :c:func:`!PyEval_ReleaseLock`, föråldrade i Python 3.2. De uppdaterade inte det aktuella trådtillståndet. De kan ersättas med:

source: :c:func:`PyEval_SaveThread` and :c:func:`PyEval_RestoreThread`;
sv: :c:func:`PyEval_SaveThread` och :c:func:`PyEval_RestoreThread`;

source: low-level :c:func:`PyEval_AcquireThread` and :c:func:`PyEval_RestoreThread`;
sv: lågnivå :c:func:`PyEval_AcquireThread` och :c:func:`PyEval_RestoreThread`;

source: or :c:func:`PyGILState_Ensure` and :c:func:`PyGILState_Release`.
sv: eller :c:func:`PyGILState_Ensure` och :c:func:`PyGILState_Release`.

source: (Contributed by Victor Stinner in :gh:`105182`.)
sv: (Bidrag från Victor Stinner i :gh:`105182`.)

source: Remove the :c:func:`!PyEval_ThreadsInitialized` function, deprecated in Python 3.9. Since Python 3.7, :c:func:`!Py_Initialize` always creates the GIL: calling :c:func:`!PyEval_InitThreads` does nothing and :c:func:`!PyEval_ThreadsInitialized` always returns non-zero. (Contributed by Victor Stinner in :gh:`105182`.)
sv: Ta bort funktionen :c:func:`!PyEval_ThreadsInitialized`, föråldrad i Python 3.9. Sedan Python 3.7 skapar :c:func:`!Py_Initialize` alltid GIL: att anropa :c:func:`!PyEval_InitThreads` gör ingenting och :c:func:`!PyEval_ThreadsInitialized` returnerar alltid icke-noll. (Bidrag från Victor Stinner i :gh:`105182`.)

source: Remove the :c:func:`!_PyInterpreterState_Get` alias to :c:func:`PyInterpreterState_Get()` which was kept for backward compatibility with Python 3.8. The `pythoncapi-compat project`_ can be used to get :c:func:`PyInterpreterState_Get()` on Python 3.8 and older. (Contributed by Victor Stinner in :gh:`106320`.)
sv: Ta bort :c:func:`!_PyInterpreterState_Get`-aliaset till :c:func:`PyInterpreterState_Get()` som behölls för bakåtkompatibilitet med Python 3.8. Projektet `pythoncapi-compat`_ kan användas för att få :c:func:`PyInterpreterState_Get()` på Python 3.8 och äldre. (Bidrag från Victor Stinner i :gh:`106320`.)

source: Remove the private :c:func:`!_PyObject_FastCall` function: use :c:func:`!PyObject_Vectorcall` which is available since Python 3.8 (:pep:`590`). (Contributed by Victor Stinner in :gh:`106023`.)
sv: Ta bort den privata funktionen :c:func:`!_PyObject_FastCall`: använd :c:func:`!PyObject_Vectorcall` som är tillgänglig sedan Python 3.8 (:pep:`590`). (Bidrag från Victor Stinner i :gh:`106023`.)

source: Remove the ``cpython/pytime.h`` header file, which only contained private functions. (Contributed by Victor Stinner in :gh:`106316`.)
sv: Ta bort huvudfilen ``cpython/pytime.h``, som endast innehöll privata funktioner. (Bidrag från Victor Stinner i :gh:`106316`.)

source: Remove the undocumented ``PY_TIMEOUT_MAX`` constant from the limited C API. (Contributed by Victor Stinner in :gh:`110014`.)
sv: Ta bort den odokumenterade konstanten ``PY_TIMEOUT_MAX`` från det begränsade C API:et. (Bidrag från Victor Stinner i :gh:`110014`.)

source: Remove the old trashcan macros ``Py_TRASHCAN_SAFE_BEGIN`` and ``Py_TRASHCAN_SAFE_END``. Replace both with the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``. (Contributed by Irit Katriel in :gh:`105111`.)
sv: Ta bort de gamla papperskorgsmakrot ``Py_TRASHCAN_SAFE_BEGIN`` och ``Py_TRASHCAN_SAFE_END``. Ersätt båda med de nya makrona ``Py_TRASHCAN_BEGIN`` och ``Py_TRASHCAN_END``. (Bidrag från Irit Katriel i :gh:`105111`.)

source: Deprecated C APIs
sv: Föråldrade C API:er

source: Deprecate old Python initialization functions:
sv: Avveckla gamla Python-initialiseringsfunktioner:

source: :c:func:`PySys_ResetWarnOptions`: Clear :data:`sys.warnoptions` and :data:`!warnings.filters` instead.
sv: :c:func:`PySys_ResetWarnOptions`: Rensa :data:`sys.warnoptions` och :data:`!warnings.filters` istället.

source: :c:func:`Py_GetExecPrefix`: Get :data:`sys.exec_prefix` instead.
sv: :c:func:`Py_GetExecPrefix`: Hämta :data:`sys.exec_prefix` istället.

source: :c:func:`Py_GetPath`: Get :data:`sys.path` instead.
sv: :c:func:`Py_GetPath`: Hämta :data:`sys.path` istället.

source: :c:func:`Py_GetPrefix`: Get :data:`sys.prefix` instead.
sv: :c:func:`Py_GetPrefix`: Hämta :data:`sys.prefix` istället.

source: :c:func:`Py_GetProgramFullPath`: Get :data:`sys.executable` instead.
sv: :c:func:`Py_GetProgramFullPath`: Hämta :data:`sys.executable` istället.

source: :c:func:`Py_GetProgramName`: Get :data:`sys.executable` instead.
sv: :c:func:`Py_GetProgramName`: Hämta :data:`sys.executable` istället.

source: :c:func:`Py_GetPythonHome`: Get :c:member:`PyConfig.home` or the :envvar:`PYTHONHOME` environment variable instead.
sv: :c:func:`Py_GetPythonHome`: Hämta :c:member:`PyConfig.home` eller miljövariabeln :envvar:`PYTHONHOME` istället.

source: (Contributed by Victor Stinner in :gh:`105145`.)
sv: (Bidrag från Victor Stinner i :gh:`105145`.)

source: :term:`Soft deprecate <soft deprecated>` the :c:func:`PyEval_GetBuiltins`, :c:func:`PyEval_GetGlobals`, and :c:func:`PyEval_GetLocals` functions, which return a :term:`borrowed reference`. (Soft deprecated as part of :pep:`667`.)
sv: :term:`Soft deprecate <soft deprecated>` funktionerna :c:func:`PyEval_GetBuiltins`, :c:func:`PyEval_GetGlobals`, och :c:func:`PyEval_GetLocals`, som returnerar en :term:`lånad referens`. (Mjukt föråldrad som en del av :pep:`667`.)

source: Deprecate the :c:func:`PyImport_ImportModuleNoBlock` function, which is just an alias to :c:func:`PyImport_ImportModule` since Python 3.3. (Contributed by Victor Stinner in :gh:`105396`.)
sv: Avveckla funktionen :c:func:`PyImport_ImportModuleNoBlock`, som bara är ett alias till :c:func:`PyImport_ImportModule` sedan Python 3.3. (Bidrag från Victor Stinner i :gh:`105396`.)

source: :term:`Soft deprecate <soft deprecated>` the :c:func:`PyModule_AddObject` function. It should be replaced with :c:func:`PyModule_Add` or :c:func:`PyModule_AddObjectRef`. (Contributed by Serhiy Storchaka in :gh:`86493`.)
sv: :term:`Soft deprecate <soft deprecated>` funktionen :c:func:`PyModule_AddObject`. Den bör ersättas med :c:func:`PyModule_Add` eller :c:func:`PyModule_AddObjectRef`. (Bidrag från Serhiy Storchaka i :gh:`86493`.)

source: Deprecate the old ``Py_UNICODE`` and ``PY_UNICODE_TYPE`` types and the :c:macro:`!Py_UNICODE_WIDE` define. Use the :c:type:`wchar_t` type directly instead. Since Python 3.3, ``Py_UNICODE`` and ``PY_UNICODE_TYPE`` are just aliases to :c:type:`!wchar_t`. (Contributed by Victor Stinner in :gh:`105156`.)
sv: Utgå från de gamla typerna ``Py_UNICODE`` och ``PY_UNICODE_TYPE`` och :c:macro:`!Py_UNICODE_WIDE`-definitionen. Använd typen :c:type:`wchar_t` direkt istället. Sedan Python 3.3 är ``Py_UNICODE`` och ``PY_UNICODE_TYPE`` bara alias till :c:type:`!wchar_t`. (Bidrag från Victor Stinner i :gh:`105156`.)

source: Deprecate the :c:func:`PyWeakref_GetObject` and :c:func:`PyWeakref_GET_OBJECT` functions, which return a :term:`borrowed reference`. Replace them with the new :c:func:`PyWeakref_GetRef` function, which returns a :term:`strong reference`. The `pythoncapi-compat project`_ can be used to get :c:func:`PyWeakref_GetRef` on Python 3.12 and older. (Contributed by Victor Stinner in :gh:`105927`.)
sv: Avveckla funktionerna :c:func:`PyWeakref_GetObject` och :c:func:`PyWeakref_GET_OBJECT`, som returnerar en :term:`lånad referens`. Ersätt dem med den nya funktionen :c:func:`PyWeakref_GetRef`, som returnerar en :term:`strong reference`. Projektet `pythoncapi-compat`_ kan användas för att få :c:func:`PyWeakref_GetRef` på Python 3.12 och äldre. (Bidrag från Victor Stinner i :gh:`105927`.)

source: The ``ma_version_tag`` field in :c:type:`PyDictObject` for extension modules (:pep:`699`; :gh:`101193`).
sv: Fältet ``ma_version_tag`` i :c:type:`PyDictObject` för tilläggsmoduler (:pep:`699`; :gh:`101193``).

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases (:gh:`95388`).
sv: Skapar :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` med mutabla baser (:gh:`95388`).

source: The :c:func:`PyImport_ImportModuleNoBlock`: Use :c:func:`PyImport_ImportModule` instead.
sv: :c:func:`PyImport_ImportModuleNoBlock`: Använd :c:func:`PyImport_ImportModule` istället.

source: :c:func:`PyWeakref_GetObject` and :c:func:`PyWeakref_GET_OBJECT`: Use :c:func:`PyWeakref_GetRef` instead. The `pythoncapi-compat project <https://github.com/python/pythoncapi-compat/>`__ can be used to get :c:func:`PyWeakref_GetRef` on Python 3.12 and older.
sv: :c:func:`PyWeakref_GetObject` och :c:func:`PyWeakref_GET_OBJECT`: Använd :c:func:`PyWeakref_GetRef` istället. Projektet `pythoncapi-compat <https://github.com/python/pythoncapi-compat/>`__ kan användas för att hämta :c:func:`PyWeakref_GetRef` på Python 3.12 och äldre.

source: :c:type:`Py_UNICODE` type and the :c:macro:`!Py_UNICODE_WIDE` macro: Use :c:type:`wchar_t` instead.
sv: :c:type:`Py_UNICODE` typ och :c:macro:`!Py_UNICODE_WIDE` makro: Använd :c:type:`wchar_t` istället.

source: :c:func:`!PyUnicode_AsDecodedObject`: Use :c:func:`PyCodec_Decode` instead.
sv: :c:func:`!PyUnicode_AsDecodedObject`: Använd :c:func:`PyCodec_Decode` istället.

source: :c:func:`!PyUnicode_AsDecodedUnicode`: Use :c:func:`PyCodec_Decode` instead; Note that some codecs (for example, "base64") may return a type other than :class:`str`, such as :class:`bytes`.
sv: :c:func:`!PyUnicode_AsDecodedUnicode`: Använd :c:func:`PyCodec_Decode` istället; Observera att vissa codecs (t.ex. "base64") kan returnera en annan typ än :class:`str`, t.ex. :class:`bytes`.
