Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: C-API extension modules need to be built specifically for the free-threaded build. Extensions that support running with the :term:`GIL` disabled should use the :c:data:`Py_mod_gil` slot. Extensions using single-phase init should use :c:func:`PyUnstable_Module_SetGIL` to indicate whether they support running with the GIL disabled. Importing C extensions that don't use these mechanisms will cause the GIL to be enabled, unless the GIL was explicitly disabled with the :envvar:`PYTHON_GIL` environment variable or the :option:`-X gil=0` option. pip 24.1 or newer is required to install packages with C extensions in the free-threaded build.
sv: C-API-tilläggsmoduler måste byggas specifikt för den fritt trådade versionen. Tillägg som stöder körning med :term:`GIL` inaktiverad bör använda :c:data:`Py_mod_gil` slot. Tillägg som använder enfasig init bör använda :c:func:`PyUnstable_Module_SetGIL` för att ange om de stöder körning med GIL inaktiverad. Import av C-tillägg som inte använder dessa mekanismer kommer att leda till att GIL aktiveras, såvida inte GIL uttryckligen inaktiverats med miljövariabeln :envvar:`PYTHON_GIL` eller alternativet :option:`-X gil=0`. pip 24.1 eller nyare krävs för att installera paket med C-tillägg i den frittrådade byggnaden.

source: This work was made possible thanks to many individuals and organizations, including the large community of contributors to Python and third-party projects to test and enable free-threading support. Notable contributors include: Sam Gross, Ken Jin, Donghee Na, Itamar Oren, Matt Page, Brett Simmers, Dino Viehland, Carl Meyer, Nathan Goldbaum, Ralf Gommers, Lysandros Nikolaou, and many others. Many of these contributors are employed by Meta, which has provided significant engineering resources to support this project.
sv: Detta arbete har möjliggjorts tack vare många individer och organisationer, inklusive den stora gruppen av bidragsgivare till Python och tredjepartsprojekt för att testa och möjliggöra stöd för free-threading. Anmärkningsvärda bidragsgivare inkluderar: Sam Gross, Ken Jin, Donghee Na, Itamar Oren, Matt Page, Brett Simmers, Dino Viehland, Carl Meyer, Nathan Goldbaum, Ralf Gommers, Lysandros Nikolaou och många andra. Många av dessa bidragsgivare är anställda av Meta, som har tillhandahållit betydande tekniska resurser för att stödja detta projekt.

source: :pep:`703` "Making the Global Interpreter Lock Optional in CPython" contains rationale and information surrounding this work.
sv: :pep:`703` "Making the Global Interpreter Lock Optional in CPython" innehåller motivering och information om detta arbete.

source: `Porting Extension Modules to Support Free-Threading <https://py-free-threading.github.io/porting/>`_: A community-maintained porting guide for extension authors.
sv: "Portning av tilläggsmoduler för att stödja fri trådning <https://py-free-threading.github.io/porting/>`_: En community-underhållen portningsguide för tilläggsförfattare.

source: An experimental just-in-time (JIT) compiler
sv: En experimentell JIT-kompilator (just-in-time)

source: When CPython is configured and built using the :option:`!--enable-experimental-jit` option, a just-in-time (JIT) compiler is added which may speed up some Python programs. On Windows, use ``PCbuild/build.bat --experimental-jit`` to enable the JIT or ``--experimental-jit-interpreter`` to enable the Tier 2 interpreter. Build requirements and further supporting information `are contained at`__ :file:`Tools/jit/README.md`.
sv: När CPython konfigureras och byggs med alternativet :option:`!--enable-experimental-jit` läggs en JIT-kompilator (just-in-time) till, vilket kan snabba upp vissa Python-program. I Windows använder du ``PCbuild/build.bat --experimental-jit`` för att aktivera JIT eller ``--experimental-jit-interpreter`` för att aktivera Tier 2-tolken. Byggkrav och ytterligare stödjande information finns i :file:`Tools/jit/README.md`.

source: The :option:`!--enable-experimental-jit` option takes these (optional) values, defaulting to ``yes`` if :option:`!--enable-experimental-jit` is present without the optional value.
sv: Alternativet :option:`!--enable-experimental-jit` tar dessa (valfria) värden, med standardvärdet ``yes`` om :option:`!--enable-experimental-jit` finns utan det valfria värdet.

source: ``no``: Disable the entire Tier 2 and JIT pipeline.
sv: ``no``: Inaktivera hela Tier 2- och JIT-pipelinen.

source: ``yes``: Enable the JIT. To disable the JIT at runtime, pass the environment variable ``PYTHON_JIT=0``.
sv: ``ja``: Aktivera JIT. För att inaktivera JIT vid körning, skicka miljövariabeln ``PYTHON_JIT=0``.

source: ``yes-off``: Build the JIT but disable it by default. To enable the JIT at runtime, pass the environment variable ``PYTHON_JIT=1``.
sv: ``yes-off``: Bygg JIT men inaktivera den som standard. För att aktivera JIT vid körning, skicka miljövariabeln ``PYTHON_JIT=1``.

source: ``interpreter``: Enable the Tier 2 interpreter but disable the JIT. The interpreter can be disabled by running with ``PYTHON_JIT=0``.
sv: ``tolk``: Aktiverar Tier 2-tolken men inaktiverar JIT. Tolken kan avaktiveras genom att köra med ``PYTHON_JIT=0``.

source: The internal architecture is roughly as follows:
sv: Den interna arkitekturen är ungefär som följer:

source: We start with specialized *Tier 1 bytecode*. See :ref:`What's new in 3.11 <whatsnew311-pep659>` for details.
sv: Vi börjar med specialiserad *Tier 1 bytecode*. Se :ref:`Vad är nytt i 3.11 <whatsnew311-pep659>` för detaljer.

source: When the Tier 1 bytecode gets hot enough, it gets translated to a new purely internal intermediate representation (IR), called the *Tier 2 IR*, and sometimes referred to as micro-ops ("uops").
sv: När bytekoden på Tier 1 blir tillräckligt varm översätts den till en ny rent intern intermediär representation (IR), kallad *Tier 2 IR*, och ibland kallad mikro-ops ("uops").

source: The Tier 2 IR uses the same stack-based virtual machine as Tier 1, but the instruction format is better suited to translation to machine code.
sv: Tier 2 IR använder samma stackbaserade virtuella maskin som Tier 1, men instruktionsformatet är bättre lämpat för översättning till maskinkod.

source: We have several optimization passes for Tier 2 IR, which are applied before it is interpreted or translated to machine code.
sv: Vi har flera optimeringspass för Tier 2 IR, som tillämpas innan den tolkas eller översätts till maskinkod.

source: There is a Tier 2 interpreter, but it is mostly intended for debugging the earlier stages of the optimization pipeline. The Tier 2 interpreter can be enabled by configuring Python with ``--enable-experimental-jit=interpreter``.
sv: Det finns en Tier 2-tolk, men den är främst avsedd för felsökning av de tidigare stegen i optimeringspipelinen. Tier 2-tolken kan aktiveras genom att konfigurera Python med ``--enable-experimental-jit=interpreter``.

source: When the JIT is enabled, the optimized Tier 2 IR is translated to machine code, which is then executed.
sv: När JIT är aktiverat översätts den optimerade Tier 2 IR till maskinkod, som sedan exekveras.

source: The machine code translation process uses a technique called *copy-and-patch*. It has no runtime dependencies, but there is a new build-time dependency on LLVM.
sv: Översättningsprocessen för maskinkod använder en teknik som kallas *copy-and-patch*. Den har inga runtime-beroenden, men det finns ett nytt build-time-beroende av LLVM.

source: (JIT by Brandt Bucher, inspired by a paper by Haoran Xu and Fredrik Kjolstad. Tier 2 IR by Mark Shannon and Guido van Rossum. Tier 2 optimizer by Ken Jin.)
sv: (JIT av Brandt Bucher, inspirerad av en artikel av Haoran Xu och Fredrik Kjolstad. Tier 2 IR av Mark Shannon och Guido van Rossum. Tier 2-optimerare av Ken Jin)

source: Defined mutation semantics for :py:func:`locals`
sv: Definierad mutationssemantik för :py:func:`locals`

source: Historically, the expected result of mutating the return value of :func:`locals` has been left to individual Python implementations to define. Starting from Python 3.13, :pep:`667` standardises the historical behavior of CPython for most code execution scopes, but changes :term:`optimized scopes <optimized scope>` (functions, generators, coroutines, comprehensions, and generator expressions) to explicitly return independent snapshots of the currently assigned local variables, including locally referenced nonlocal variables captured in closures.
sv: Historiskt sett har det förväntade resultatet av att mutera returvärdet för :func:`locals` lämnats till enskilda Python-implementationer att definiera. Från och med Python 3.13 standardiserar :pep:`667` det historiska beteendet hos CPython för de flesta kodkörningsområden, men ändrar :term:`optimized scopes <optimized scope>` (funktioner, generatorer, coroutines, comprehensions och generatoruttryck) för att uttryckligen returnera oberoende ögonblicksbilder av de för närvarande tilldelade lokala variablerna, inklusive lokalt refererade icke-lokala variabler som fångas i closures.

source: This change to the semantics of :func:`locals` in optimized scopes also affects the default behavior of code execution functions that implicitly target :func:`!locals` if no explicit namespace is provided (such as :func:`exec` and :func:`eval`). In previous versions, whether or not changes could be accessed by calling :func:`!locals` after calling the code execution function was implementation-dependent. In CPython specifically, such code would typically appear to work as desired, but could sometimes fail in optimized scopes based on other code (including debuggers and code execution tracing tools) potentially resetting the shared snapshot in that scope. Now, the code will always run against an independent snapshot of the local variables in optimized scopes, and hence the changes will never be visible in subsequent calls to :func:`!locals`. To access the changes made in these cases, an explicit namespace reference must now be passed to the relevant function. Alternatively, it may make sense to update affected code to use a higher level code execution API that returns the resulting code execution namespace (e.g. :func:`runpy.run_path` when executing Python files from disk).
sv: Denna ändring av semantiken för :func:`locals` i optimerade scopes påverkar även standardbeteendet för kodexekveringsfunktioner som implicit riktar sig till :func:`!locals` om inget explicit namnområde anges (t.ex. :func:`exec` och :func:`eval`). I tidigare versioner var det implementationsberoende om ändringar kunde nås genom att anropa :func:`!locals` efter anrop av kodkörningsfunktionen eller inte. I CPython specifikt skulle sådan kod vanligtvis verka fungera som önskat, men kunde ibland misslyckas i optimerade scope baserat på annan kod (inklusive debuggar och verktyg för spårning av kodexekvering) som potentiellt återställde den delade ögonblicksbilden i det scope. Nu kommer koden alltid att köras mot en oberoende ögonblicksbild av de lokala variablerna i optimerade scopes, och därför kommer ändringarna aldrig att vara synliga i efterföljande anrop till :func:`!locals`. För att komma åt de ändringar som gjorts i dessa fall måste en explicit namnrymdsreferens nu skickas till den relevanta funktionen. Alternativt kan det vara klokt att uppdatera berörd kod så att den använder ett API för kodkörning på högre nivå som returnerar det resulterande namnområdet för kodkörning (t.ex. :func:`runpy.run_path` när Python-filer körs från disk).

source: To ensure debuggers and similar tools can reliably update local variables in scopes affected by this change, :attr:`FrameType.f_locals <frame.f_locals>` now returns a write-through proxy to the frame's local and locally referenced nonlocal variables in these scopes, rather than returning an inconsistently updated shared ``dict`` instance with undefined runtime semantics.
sv: För att säkerställa att debuggar och liknande verktyg på ett tillförlitligt sätt kan uppdatera lokala variabler i scopes som påverkas av denna ändring, returnerar :attr:`FrameType.f_locals <frame.f_locals>` nu en write-through proxy till ramens lokala och lokalt refererade icke-lokala variabler i dessa scopes, i stället för att returnera en inkonsekvent uppdaterad delad ``dict``-instans med odefinierad körtidssemantik.

source: See :pep:`667` for more details, including related C API changes and deprecations. Porting notes are also provided below for the affected :ref:`Python APIs <pep667-porting-notes-py>` and :ref:`C APIs <pep667-porting-notes-c>`.
sv: Se :pep:`667` för mer information, inklusive relaterade C API-ändringar och deprecations. Portningsnoteringar finns också nedan för de berörda :ref:`Python APIs <pep667-porting-notes-py>` och :ref:`C APIs <pep667-porting-notes-c>`.

source: (PEP and implementation contributed by Mark Shannon and Tian Gao in :gh:`74929`. Documentation updates provided by Guido van Rossum and Alyssa Coghlan.)
sv: (PEP och implementering bidragit av Mark Shannon och Tian Gao i :gh:`74929`. Uppdateringar av dokumentation har tillhandahållits av Guido van Rossum och Alyssa Coghlan)

source: Support for mobile platforms
sv: Stöd för mobila plattformar

source: :pep:`730`: iOS is now a :pep:`11` supported platform, with the ``arm64-apple-ios`` and ``arm64-apple-ios-simulator`` targets at tier 3 (iPhone and iPad devices released after 2013 and the Xcode iOS simulator running on Apple silicon hardware, respectively). ``x86_64-apple-ios-simulator`` (the Xcode iOS simulator running on older ``x86_64`` hardware) is not a tier 3 supported platform, but will have best-effort support. (PEP written and implementation contributed by Russell Keith-Magee in :gh:`114099`.)
sv: :pep:`730`: iOS är nu en plattform som stöds av :pep:`11`, med målen ``arm64-apple-ios`` och ``arm64-apple-ios-simulator`` på nivå 3 (iPhone- och iPad-enheter som släpptes efter 2013 respektive Xcode iOS-simulatorn som körs på Apple-kiselhårdvara). ``x86_64-apple-ios-simulator`` (Xcode iOS-simulatorn som körs på äldre ``x86_64``-hårdvara) är inte en plattform som stöds på nivå 3, men kommer att ha bästa möjliga stöd. (PEP skriven och implementering bidragit av Russell Keith-Magee i :gh:`114099`.)

source: :pep:`738`: Android is now a :pep:`11` supported platform, with the ``aarch64-linux-android`` and ``x86_64-linux-android`` targets at tier 3. The 32-bit targets ``arm-linux-androideabi`` and ``i686-linux-android`` are not tier 3 supported platforms, but will have best-effort support. (PEP written and implementation contributed by Malcolm Smith in :gh:`116622`.)
sv: :pep:`738`: Android är nu en plattform som stöds av :pep:`11`, med målen ``aarch64-linux-android`` och ``x86_64-linux-android`` på nivå 3. 32-bitars målen ``arm-linux-androideabi`` och ``i686-linux-android`` är inte plattformar som stöds på nivå 3, men kommer att ha stöd efter bästa förmåga. (PEP skriven och implementeringen bidragit av Malcolm Smith i :gh:`116622`.)

source: Other Language Changes
sv: Andra språkliga förändringar

source: The compiler now strips common leading whitespace from every line in a docstring. This reduces the size of the :term:`bytecode cache <bytecode>` (such as ``.pyc`` files), with reductions in file size of around 5%, for example in :mod:`!sqlalchemy.orm.session` from SQLAlchemy 2.0. This change affects tools that use docstrings, such as :mod:`doctest`.
sv: Kompilatorn tar nu bort vanliga ledande blanksteg från varje rad i en dokumentsträng. Detta minskar storleken på :term:`bytecode cache <bytecode>` (såsom ``.pyc``-filer), med minskningar i filstorlek på cirka 5%, till exempel i :mod:`!sqlalchemy.orm.session` från SQLAlchemy 2.0. Denna ändring påverkar verktyg som använder dokumentsträngar, t.ex. :mod:`doctest`.

source: >>> def spam(): ... """ ... This is a docstring with ... leading whitespace. ... ... It even has multiple paragraphs! ... """ ... >>> spam.__doc__ '\nThis is a docstring with\n leading whitespace.\n\nIt even has multiple paragraphs!\n'
sv: >>> def spam(): ... """ ... Detta är en dokumentsträng med ... inledande blanksteg. ... ... Den har till och med flera stycken! ... """ ... >>> spam.__doc__ '\nDetta är en dokumentsträng med\n ledande blanksteg.\n\nDet har till och med flera stycken!\n'

source: (Contributed by Inada Naoki in :gh:`81283`.)
sv: (Bidrag från Inada Naoki i :gh:`81283`.)

source: :ref:`Annotation scopes <annotation-scopes>` within class scopes can now contain lambdas and comprehensions. Comprehensions that are located within class scopes are not inlined into their parent scope.
sv: :ref:`Annotation scopes <annotation-scopes>` inom class scopes kan nu innehålla lambdas och förståelser. Förståelser som ligger inom klass-scopes inlinas inte i sitt föräldra-scope.

source: class C[T]: type Alias = lambda: T
sv: klass C[T]: typ Alias = lambda: T

source: (Contributed by Jelle Zijlstra in :gh:`109118` and :gh:`118160`.)
sv: (Bidrag från Jelle Zijlstra i :gh:`109118` och :gh:`118160`.)

source: :ref:`Future statements <future>` are no longer triggered by relative imports of the :mod:`__future__` module, meaning that statements of the form ``from .__future__ import ...`` are now simply standard relative imports, with no special features activated. (Contributed by Jeremiah Gabriel Pascual in :gh:`118216`.)
sv: :ref:``Future statements <future>`` utlöses inte längre av relativ import av modulen :mod:`__future__`, vilket innebär att statements av formen ``from .__future__ import ...`` nu helt enkelt är standard relativ import, utan att några speciella funktioner aktiveras. (Bidrag från Jeremiah Gabriel Pascual i :gh:`118216`.)

source: :keyword:`global` declarations are now permitted in :keyword:`except` blocks when that global is used in the :keyword:`else` block. Previously this raised an erroneous :exc:`SyntaxError`. (Contributed by Irit Katriel in :gh:`111123`.)
sv: :keyword:`global`-deklarationer är nu tillåtna i :keyword:`except`-block när den globala används i :keyword:`else`-blocket. Tidigare gav detta upphov till ett felaktigt :exc:`SyntaxError`. (Bidrag från Irit Katriel i :gh:`111123`.)

source: Add :envvar:`PYTHON_FROZEN_MODULES`, a new environment variable that determines whether frozen modules are ignored by the import machinery, equivalent to the :option:`-X frozen_modules <-X>` command-line option. (Contributed by Yilei Yang in :gh:`111374`.)
sv: Lägg till :envvar:`PYTHON_FROZEN_MODULES`, en ny miljövariabel som avgör om frysta moduler ignoreras av importmaskineriet, motsvarande :option:`-X frozen_modules <-X>` kommandoradsalternativet. (Bidrag från Yilei Yang i :gh:`111374`.)

source: Add :ref:`support for the perf profiler <perf_profiling>` working without `frame pointers <https://en.wikipedia.org/wiki/Call_stack>`_ through the new environment variable :envvar:`PYTHON_PERF_JIT_SUPPORT` and command-line option :option:`-X perf_jit <-X>`. (Contributed by Pablo Galindo in :gh:`118518`.)
sv: Lägg till :ref:`stöd för perf-profileraren <perf_profiling>` som arbetar utan `rampekare &lt;https://en.wikipedia.org/wiki/Call_stack&gt;`_ genom den nya miljövariabeln :envvar:`PYTHON_PERF_JIT_SUPPORT` och kommandoradsalternativet :option:`-X perf_jit <-X>`. (Bidrag från Pablo Galindo i :gh:`118518`.)

source: The location of a :file:`.python_history` file can be changed via the new :envvar:`PYTHON_HISTORY` environment variable. (Contributed by Levi Sabah, Zackery Spytz and Hugo van Kemenade in :gh:`73965`.)
sv: Platsen för en :file:`.python_history`-fil kan ändras via den nya :envvar:`PYTHON_HISTORY`-miljövariabeln. (Bidrag från Levi Sabah, Zackery Spytz och Hugo van Kemenade i :gh:`73965`.)

source: Classes have a new :attr:`~type.__static_attributes__` attribute. This is populated by the compiler with a tuple of the class's attribute names which are assigned through ``self.<name>`` from any function in its body. (Contributed by Irit Katriel in :gh:`115775`.)
sv: Klasser har ett nytt attribut :attr:`~type.__static_attributes__`. Detta fylls i av kompilatorn med en tupel av klassens attributnamn som tilldelas genom ``self.<name>`` från vilken funktion som helst i dess kropp. (Bidrag från Irit Katriel i :gh:`115775`.)

source: The compiler now creates a :attr:`!__firstlineno__` attribute on classes with the line number of the first line of the class definition. (Contributed by Serhiy Storchaka in :gh:`118465`.)
sv: Kompilatorn skapar nu ett :attr:`!__firstlineno__`-attribut på klasser med radnumret för den första raden i klassdefinitionen. (Bidrag från Serhiy Storchaka i :gh:`118465`.)

source: The :func:`exec` and :func:`eval` builtins now accept the *globals* and *locals* arguments as keywords. (Contributed by Raphael Gaschignard in :gh:`105879`)
sv: Inbyggnaderna :func:`exec` och :func:`eval` accepterar nu argumenten *globals* och *locals* som nyckelord. (Bidrag från Raphael Gaschignard i :gh:`105879`)

source: The :func:`compile` builtin now accepts a new flag, ``ast.PyCF_OPTIMIZED_AST``, which is similar to ``ast.PyCF_ONLY_AST`` except that the returned AST is optimized according to the value of the *optimize* argument. (Contributed by Irit Katriel in :gh:`108113`).
sv: Inbyggda :func:`compile` accepterar nu en ny flagga, ``ast.PyCF_OPTIMIZED_AST``, som liknar ``ast.PyCF_ONLY_AST`` förutom att den returnerade AST:en optimeras enligt värdet på argumentet *optimize*. (Bidrag från Irit Katriel i :gh:`108113`).

source: Add a :attr:`~property.__name__` attribute on :class:`property` objects. (Contributed by Eugene Toder in :gh:`101860`.)
sv: Lägg till ett :attr:`~property.__name__`-attribut på :class:`property`-objekt. (Bidrag från Eugene Toder i :gh:`101860`.)

source: Add :exc:`PythonFinalizationError`, a new exception derived from :exc:`RuntimeError` and used to signal when operations are blocked during :term:`finalization <interpreter shutdown>`. The following callables now raise :exc:`!PythonFinalizationError`, instead of :exc:`RuntimeError`:
sv: Lägg till :exc:`PythonFinalizationError`, ett nytt undantag härlett från :exc:`RuntimeError` och som används för att signalera när operationer blockeras under :term:`finalization <interpreter shutdown>`. Följande anropsbara filer ger nu :exc:`!PythonFinalizationError`, istället för :exc:`RuntimeError`:

source: :func:`_thread.start_new_thread`
sv: :func:`_tråd.start_ny_tråd`

source: :func:`os.fork`
sv: :func:`os.gaffel`

source: (Contributed by Victor Stinner in :gh:`114570`.)
sv: (Bidrag från Victor Stinner i :gh:`114570`.)

source: Allow the *count* argument of :meth:`str.replace` to be a keyword. (Contributed by Hugo van Kemenade in :gh:`106487`.)
sv: Tillåt argumentet *count* i :meth:`str.replace` att vara ett nyckelord. (Bidrag från Hugo van Kemenade i :gh:`106487`.)

source: Many functions now emit a warning if a boolean value is passed as a file descriptor argument. This can help catch some errors earlier. (Contributed by Serhiy Storchaka in :gh:`82626`.)
sv: Många funktioner avger nu en varning om ett booleskt värde skickas som ett filbeskrivningsargument. Detta kan hjälpa till att fånga upp vissa fel tidigare. (Bidrag från Serhiy Storchaka i :gh:`82626`.)

source: Added :attr:`!name` and :attr:`!mode` attributes for compressed and archived file-like objects in the :mod:`bz2`, :mod:`lzma`, :mod:`tarfile`, and :mod:`zipfile` modules. (Contributed by Serhiy Storchaka in :gh:`115961`.)
sv: Lade till attributen :attr:`!name` och :attr:`!mode` för komprimerade och arkiverade filliknande objekt i modulerna :mod:`bz2`, :mod:`lzma`, :mod:`tarfile` och :mod:`zipfile`. (Bidrag från Serhiy Storchaka i :gh:`115961`.)

source: New Modules
sv: Nya moduler

source: :mod:`dbm.sqlite3`: An SQLite backend for :mod:`dbm`. (Contributed by Raymond Hettinger and Erlend E. Aasland in :gh:`100414`.)
sv: :mod:`dbm.sqlite3`: En SQLite-backend för :mod:`dbm`. (Bidrag från Raymond Hettinger och Erlend E. Aasland i :gh:`100414`.)

source: Improved Modules
sv: Förbättrade moduler
