Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: The :meth:`~asyncio.get_event_loop` method of the default event loop policy now emits a :exc:`DeprecationWarning` if there is no current event loop set and it decides to create one. (Contributed by Serhiy Storchaka and Guido van Rossum in :gh:`100160`.)
sv: Metoden :meth:`~asyncio.get_event_loop` för standardpolicyn för händelseslingor avger nu en :exc:`DeprecationWarning` om det inte finns någon aktuell händelseslinga och den bestämmer sig för att skapa en. (Bidrag från Serhiy Storchaka och Guido van Rossum i :gh:`100160`.)

source: :mod:`collections.abc`: Deprecated :class:`!collections.abc.ByteString`. Prefer :class:`!Sequence` or :class:`~collections.abc.Buffer`. For use in typing, prefer a union, like ``bytes | bytearray``, or :class:`collections.abc.Buffer`. (Contributed by Shantanu Jain in :gh:`91896`.)
sv: :mod:`collections.abc`: Föråldrad :class:`!collections.abc.ByteString`. Föredra :class:`!Sequence` eller :class:`~collections.abc.Buffer`. För användning vid typning, föredra en union, som ``bytes | bytearray``, eller :class:`collections.abc.Buffer`. (Bidrag från Shantanu Jain i :gh:`91896`.)

source: :mod:`email`: Deprecated the *isdst* parameter in :func:`email.utils.localtime`. (Contributed by Alan Williams in :gh:`72346`.)
sv: :mod:`email`: Föråldrad *isdst* parameter i :func:`email.utils.localtime`. (Bidrag från Alan Williams i :gh:`72346`.)

source: :mod:`importlib.abc` deprecated classes:
sv: :mod:`importlib.abc` föråldrade klasser:

source: Use :mod:`importlib.resources.abc` classes instead:
sv: Använd :mod:`importlib.resources.abc`-klasser istället:

source: (Contributed by Jason R. Coombs and Hugo van Kemenade in :gh:`93963`.)
sv: (Bidrag från Jason R. Coombs och Hugo van Kemenade i :gh:`93963`.)

source: :mod:`itertools` had undocumented, inefficient, historically buggy, and inconsistent support for copy, deepcopy, and pickle operations. This will be removed in 3.14 for a significant reduction in code volume and maintenance burden. (Contributed by Raymond Hettinger in :gh:`101588`.)
sv: :mod:`itertools` hade odokumenterat, ineffektivt, historiskt buggigt och inkonsekvent stöd för copy-, deepcopy- och pickle-operationer. Detta kommer att tas bort i 3.14 för en betydande minskning av kodvolymen och underhållsbördan. (Bidrag från Raymond Hettinger i :gh:`101588`.)

source: :mod:`multiprocessing`: The default start method will change to a safer one on Linux, BSDs, and other non-macOS POSIX platforms where ``'fork'`` is currently the default (:gh:`84559`). Adding a runtime warning about this was deemed too disruptive as the majority of code is not expected to care. Use the :func:`~multiprocessing.get_context` or :func:`~multiprocessing.set_start_method` APIs to explicitly specify when your code *requires* ``'fork'``. See :ref:`multiprocessing-start-methods`.
sv: :mod:`multiprocessing`: Standardstartmetoden kommer att ändras till en säkrare metod på Linux, BSD och andra POSIX-plattformar som inte är MacOS där ``'fork'`` för närvarande är standard (:gh:`84559`). Att lägga till en körtidsvarning om detta ansågs vara alltför störande eftersom majoriteten av koden inte förväntas bry sig. Använd API:erna :func:`~multiprocessing.get_context` eller :func:`~multiprocessing.set_start_method` för att uttryckligen ange när din kod *kräver* ``'fork'``. Se :ref:`multiprocessing-start-methods`.

source: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` and :meth:`~pathlib.PurePath.relative_to`: passing additional arguments is deprecated.
sv: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` och :meth:`~pathlib.PurePath.relative_to`: att skicka ytterligare argument är föråldrat.

source: :mod:`pkgutil`: :func:`!pkgutil.find_loader` and :func:`!pkgutil.get_loader` now raise :exc:`DeprecationWarning`; use :func:`importlib.util.find_spec` instead. (Contributed by Nikita Sobolev in :gh:`97850`.)
sv: :mod:`pkgutil`: :func:`!pkgutil.find_loader` och :func:`!pkgutil.get_loader` ger nu upphov till :exc:`DeprecationWarning`; använd :func:`importlib.util.find_spec` istället. (Bidrag från Nikita Sobolev i :gh:`97850`.)

source: ``master_open()``: use :func:`pty.openpty`.
sv: ``master_open()``: använd :func:`pty.openpty`.

source: ``slave_open()``: use :func:`pty.openpty`.
sv: ```slave_open()``: använd :func:`pty.openpty`.

source: :data:`!version` and :data:`!version_info`.
sv: :data:`!version` och :data:`!version_info`.

source: :meth:`~sqlite3.Cursor.execute` and :meth:`~sqlite3.Cursor.executemany` if :ref:`named placeholders <sqlite3-placeholders>` are used and *parameters* is a sequence instead of a :class:`dict`.
sv: :meth:`~sqlite3.Cursor.execute` och :meth:`~sqlite3.Cursor.executemany` om :ref:``named placeholders <sqlite3-placeholders>`` används och *parameters* är en sekvens istället för en :class:`dict`.

source: :mod:`typing`: :class:`!typing.ByteString`, deprecated since Python 3.9, now causes a :exc:`DeprecationWarning` to be emitted when it is used.
sv: :mod:`typing`: :class:`!typing.ByteString`, föråldrad sedan Python 3.9, orsakar nu att en :exc:`DeprecationWarning` sänds ut när den används.

source: :mod:`urllib`: :class:`!urllib.parse.Quoter` is deprecated: it was not intended to be a public API. (Contributed by Gregory P. Smith in :gh:`88168`.)
sv: :mod:`urllib`: :class:`!urllib.parse.Quoter` is deprecated: det var inte avsett att vara ett offentligt API. (Bidrag från Gregory P. Smith i :gh:`88168`.)

source: Pending removal in Python 3.15
sv: Väntar på borttagning i Python 3.15

source: The import system:
sv: Importsystemet:

source: Setting :attr:`~module.__cached__` on a module while failing to set :attr:`__spec__.cached <importlib.machinery.ModuleSpec.cached>` is deprecated. In Python 3.15, :attr:`!__cached__` will cease to be set or take into consideration by the import system or standard library. (:gh:`97879`)
sv: Att ställa in :attr:`~module.__cached__` på en modul samtidigt som man misslyckas med att ställa in :attr:`__spec__.cached <importlib.machinery.ModuleSpec.cached>` är föråldrat. I Python 3.15 kommer :attr:`!__cached__` inte längre att anges eller tas i beaktande av importsystemet eller standardbiblioteket. (:gh:`97879`)

source: Setting :attr:`~module.__package__` on a module while failing to set :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>` is deprecated. In Python 3.15, :attr:`!__package__` will cease to be set or take into consideration by the import system or standard library. (:gh:`97879`)
sv: Att ställa in :attr:`~module.__package__` på en modul utan att ställa in :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>` är föråldrat. I Python 3.15 kommer :attr:`!__package__` inte längre att anges eller tas i beaktande av importsystemet eller standardbiblioteket. (:gh:`97879`)

source: The undocumented :func:`!ctypes.SetPointerType` function has been deprecated since Python 3.13.
sv: Den odokumenterade :func:`!ctypes.SetPointerType`-funktionen är föråldrad sedan Python 3.13.

source: The obsolete and rarely used :class:`~http.server.CGIHTTPRequestHandler` has been deprecated since Python 3.13. No direct replacement exists. *Anything* is better than CGI to interface a web server with a request handler.
sv: Den föråldrade och sällan använda :class:`~http.server.CGIHTTPRequestHandler` har utgått sedan Python 3.13. Ingen direkt ersättare finns. *Anything* är bättre än CGI för att koppla en webbserver till en request-hanterare.

source: The :option:`!--cgi` flag to the :program:`python -m http.server` command-line interface has been deprecated since Python 3.13.
sv: Flaggan :option:`!--cgi` till kommandoradsgränssnittet :program:`python -m http.server` har utgått sedan Python 3.13.

source: ``load_module()`` method: use ``exec_module()`` instead.
sv: ``load_module()`` metod: använd ``exec_module()`` istället.

source: The :func:`~locale.getdefaultlocale` function has been deprecated since Python 3.11. Its removal was originally planned for Python 3.13 (:gh:`90817`), but has been postponed to Python 3.15. Use :func:`~locale.getlocale`, :func:`~locale.setlocale`, and :func:`~locale.getencoding` instead. (Contributed by Hugo van Kemenade in :gh:`111187`.)
sv: Funktionen :func:`~locale.getdefaultlocale` har varit föråldrad sedan Python 3.11. Dess borttagning var ursprungligen planerad till Python 3.13 (:gh:`90817`), men har skjutits upp till Python 3.15. Använd :func:`~locale.getlocale`, :func:`~locale.setlocale`, och :func:`~locale.getencoding` istället. (Bidrag från Hugo van Kemenade i :gh:`111187`.)

source: :meth:`.PurePath.is_reserved` has been deprecated since Python 3.13. Use :func:`os.path.isreserved` to detect reserved paths on Windows.
sv: :meth:`.PurePath.is_reserved` har utgått sedan Python 3.13. Använd :func:`os.path.isreserved` för att upptäcka reserverade sökvägar i Windows.

source: :func:`~platform.java_ver` has been deprecated since Python 3.13. This function is only useful for Jython support, has a confusing API, and is largely untested.
sv: :func:`~platform.java_ver` har utgått sedan Python 3.13. Denna funktion är endast användbar för Jython-stöd, har ett förvirrande API och är i stort sett otestad.

source: The *check_home* argument of :func:`sysconfig.is_python_build` has been deprecated since Python 3.12.
sv: Argumentet *check_home* i :func:`sysconfig.is_python_build` har utgått sedan Python 3.12.

source: :func:`~threading.RLock` will take no arguments in Python 3.15. Passing any arguments has been deprecated since Python 3.14, as the Python version does not permit any arguments, but the C version allows any number of positional or keyword arguments, ignoring every argument.
sv: :func:`~threading.RLock` kommer inte att ta några argument i Python 3.15. Att skicka några argument har varit föråldrat sedan Python 3.14, eftersom Python-versionen inte tillåter några argument, men C-versionen tillåter valfritt antal positionella eller nyckelordsargument och ignorerar varje argument.

source: :class:`types.CodeType`: Accessing :attr:`~codeobject.co_lnotab` was deprecated in :pep:`626` since 3.10 and was planned to be removed in 3.12, but it only got a proper :exc:`DeprecationWarning` in 3.12. May be removed in 3.15. (Contributed by Nikita Sobolev in :gh:`101866`.)
sv: :class:`types.CodeType`: Accessing :attr:`~codeobject.co_lnotab` was deprecated in :pep:`626` since 3.10 and was planned to be removed in 3.12, but it only got a proper :exc:`DeprecationWarning` in 3.12. Kan komma att tas bort i 3.15. (Bidrag från Nikita Sobolev i :gh:`101866`.)

source: The undocumented keyword argument syntax for creating :class:`~typing.NamedTuple` classes (for example, ``Point = NamedTuple("Point", x=int, y=int)``) has been deprecated since Python 3.13. Use the class-based syntax or the functional syntax instead.
sv: Den odokumenterade syntaxen för nyckelordsargument för att skapa :class:`~typing.NamedTuple`-klasser (till exempel ``Point = NamedTuple("Point", x=int, y=int)``) har utgått sedan Python 3.13. Använd den klassbaserade syntaxen eller den funktionella syntaxen istället.

source: When using the functional syntax of :class:`~typing.TypedDict`\s, failing to pass a value to the *fields* parameter (``TD = TypedDict("TD")``) or passing ``None`` (``TD = TypedDict("TD", None)``) has been deprecated since Python 3.13. Use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})`` to create a TypedDict with zero field.
sv: När man använder den funktionella syntaxen för :class:`~typing.TypedDict`\s, att inte skicka ett värde till parametern *fields* (``TD = TypedDict("TD")``) eller att skicka ``None`` (``TD = TypedDict("TD", None)``) har varit föråldrat sedan Python 3.13. Använd ``class TD(TypedDict): pass`` eller ``TD = TypedDict("TD", {})`` för att skapa en TypedDict med noll fält.

source: The :func:`typing.no_type_check_decorator` decorator function has been deprecated since Python 3.13. After eight years in the :mod:`typing` module, it has yet to be supported by any major type checker.
sv: Dekoratorfunktionen :func:`typing.no_type_check_decorator` har varit föråldrad sedan Python 3.13. Efter åtta år i modulen :mod:`typing` har den ännu inte fått stöd av någon större typkontroll.

source: The :meth:`~wave.Wave_read.getmark`, :meth:`!setmark`, and :meth:`~wave.Wave_read.getmarkers` methods of the :class:`~wave.Wave_read` and :class:`~wave.Wave_write` classes have been deprecated since Python 3.13.
sv: Metoderna :meth:`~wave.Wave_read.getmark`, :meth:`!setmark` och :meth:`~wave.Wave_read.getmarkers` i klasserna :class:`~wave.Wave_read` och :class:`~wave.Wave_write` har utgått sedan Python 3.13.

source: :meth:`~zipimport.zipimporter.load_module` has been deprecated since Python 3.10. Use :meth:`~zipimport.zipimporter.exec_module` instead. (Contributed by Jiahao Li in :gh:`125746`.)
sv: :meth:`~zipimport.zipimporter.load_module` är föråldrad sedan Python 3.10. Använd :meth:`~zipimport.zipimporter.exec_module` istället. (Bidrag från Jiahao Li i :gh:`125746`.)

source: Pending removal in Python 3.16
sv: Väntar på borttagning i Python 3.16

source: Setting :attr:`~module.__loader__` on a module while failing to set :attr:`__spec__.loader <importlib.machinery.ModuleSpec.loader>` is deprecated. In Python 3.16, :attr:`!__loader__` will cease to be set or taken into consideration by the import system or the standard library.
sv: Att ställa in :attr:`~module.__loader__` på en modul medan man misslyckas med att ställa in :attr:`__spec__.loader <importlib.machinery.ModuleSpec.loader>` är föråldrat. I Python 3.16 kommer :attr:`!__loader__` inte längre att anges eller tas i beaktande av importsystemet eller standardbiblioteket.

source: The ``'u'`` format code (:c:type:`wchar_t`) has been deprecated in documentation since Python 3.3 and at runtime since Python 3.13. Use the ``'w'`` format code (:c:type:`Py_UCS4`) for Unicode characters instead.
sv: Formatkoden ``'u'`` (:c:type:`wchar_t`) har utgått i dokumentation sedan Python 3.3 och vid körning sedan Python 3.13. Använd istället formatkoden ``'w'`` (:c:type:`Py_UCS4`) för Unicode-tecken.

source: :func:`!asyncio.iscoroutinefunction` is deprecated and will be removed in Python 3.16; use :func:`inspect.iscoroutinefunction` instead. (Contributed by Jiahao Li and Kumar Aditya in :gh:`122875`.)
sv: :func:`!asyncio.iscoroutinefunction` är föråldrad och kommer att tas bort i Python 3.16; använd :func:`inspect.iscoroutinefunction` istället. (Bidrag från Jiahao Li och Kumar Aditya i :gh:`122875`.)

source: :mod:`asyncio` policy system is deprecated and will be removed in Python 3.16. In particular, the following classes and functions are deprecated:
sv: :mod:`asyncio`-policysystemet är föråldrat och kommer att tas bort i Python 3.16. I synnerhet är följande klasser och funktioner föråldrade:

source: Users should use :func:`asyncio.run` or :class:`asyncio.Runner` with *loop_factory* to use the desired event loop implementation.
sv: Användare bör använda :func:`asyncio.run` eller :class:`asyncio.Runner` med *loop_factory* för att använda önskad implementering av händelseslingan.

source: For example, to use :class:`asyncio.SelectorEventLoop` on Windows::
sv: Till exempel, för att använda :class:`asyncio.SelectorEventLoop` på Windows::

source: (Contributed by Kumar Aditya in :gh:`127949`.)
sv: (Bidrag från Kumar Aditya i :gh:`127949`.)

source: Bitwise inversion on boolean types, ``~True`` or ``~False`` has been deprecated since Python 3.12, as it produces surprising and unintuitive results (``-2`` and ``-1``). Use ``not x`` instead for the logical negation of a Boolean. In the rare case that you need the bitwise inversion of the underlying integer, convert to ``int`` explicitly (``~int(x)``).
sv: Bitvis invertering på booleska typer, ``~True`` eller ``~False`` har varit föråldrad sedan Python 3.12, eftersom det ger överraskande och ointuitiva resultat (``-2`` och ``-1``). Använd ``not x`` istället för den logiska negationen av en booleansk formel. I det sällsynta fallet att du behöver den bitvisa inverteringen av det underliggande heltalet, konvertera till ``int`` explicit (``~int(x)``).

source: Calling the Python implementation of :func:`functools.reduce` with *function* or *sequence* as keyword arguments has been deprecated since Python 3.14.
sv: Att anropa Python-implementationen av :func:`functools.reduce` med *funktion* eller *sekvens* som nyckelordsargument är inte längre aktuellt sedan Python 3.14.

source: Support for custom logging handlers with the *strm* argument is deprecated and scheduled for removal in Python 3.16. Define handlers with the *stream* argument instead. (Contributed by Mariusz Felisiak in :gh:`115032`.)
sv: Stöd för anpassade logghanterare med *strm*-argumentet är föråldrat och planeras att tas bort i Python 3.16. Definiera hanterare med *stream*-argumentet istället. (Bidrag från Mariusz Felisiak i :gh:`115032`.)

source: Valid extensions start with a '.' or are empty for :meth:`mimetypes.MimeTypes.add_type`. Undotted extensions are deprecated and will raise a :exc:`ValueError` in Python 3.16. (Contributed by Hugo van Kemenade in :gh:`75223`.)
sv: Giltiga tillägg börjar med en '.' eller är tomma för :meth:`mimetypes.MimeTypes.add_type`. Okommenterade tillägg är föråldrade och kommer att ge upphov till ett :exc:`ValueError` i Python 3.16. (Bidrag från Hugo van Kemenade i :gh:`75223`.)

source: The :class:`!ExecError` exception has been deprecated since Python 3.14. It has not been used by any function in :mod:`!shutil` since Python 3.4, and is now an alias of :exc:`RuntimeError`.
sv: Undantaget :class:`!ExecError` har varit föråldrat sedan Python 3.14. Det har inte använts av någon funktion i :mod:`!shutil` sedan Python 3.4, och är nu ett alias för :exc:`RuntimeError`.

source: The :meth:`Class.get_methods <symtable.Class.get_methods>` method has been deprecated since Python 3.14.
sv: Metoden :meth:`Class.get_methods <symtable.Class.get_methods>` har utgått sedan Python 3.14.

source: The :func:`~sys._enablelegacywindowsfsencoding` function has been deprecated since Python 3.13. Use the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable instead.
sv: Funktionen :func:`~sys._enablelegacywindowsfsencoding` är föråldrad sedan Python 3.13. Använd miljövariabeln :envvar:`PYTHONLEGACYWINDOWSFSENCODING` istället.

source: The :func:`!sysconfig.expand_makefile_vars` function has been deprecated since Python 3.14. Use the ``vars`` argument of :func:`sysconfig.get_paths` instead.
sv: Funktionen :func:`!sysconfig.expand_makefile_vars` är föråldrad sedan Python 3.14. Använd ``vars``-argumentet i :func:`sysconfig.get_paths` istället.

source: The undocumented and unused :attr:`!TarFile.tarfile` attribute has been deprecated since Python 3.13.
sv: Det odokumenterade och oanvända attributet :attr:`!TarFile.tarfile` är föråldrat sedan Python 3.13.

source: Pending removal in Python 3.17
sv: Väntar på borttagning i Python 3.17

source: Before Python 3.14, old-style unions were implemented using the private class ``typing._UnionGenericAlias``. This class is no longer needed for the implementation, but it has been retained for backward compatibility, with removal scheduled for Python 3.17. Users should use documented introspection helpers like :func:`typing.get_origin` and :func:`typing.get_args` instead of relying on private implementation details.
sv: Före Python 3.14 implementerades gamla tiders unioner med hjälp av den privata klassen ``typing._UnionGenericAlias``. Denna klass behövs inte längre för implementationen, men den har behållits för bakåtkompatibilitet, med borttagning planerad till Python 3.17. Användare bör använda dokumenterade introspektionshjälpmedel som :func:`typing.get_origin` och :func:`typing.get_args` istället för att förlita sig på privata implementationsdetaljer.

source: Pending removal in future versions
sv: Avser att tas bort i framtida versioner

source: The following APIs will be removed in the future, although there is currently no date scheduled for their removal.
sv: Följande API:er kommer att tas bort i framtiden, även om det för närvarande inte finns något datum för när de ska tas bort.

source: Nesting argument groups and nesting mutually exclusive groups are deprecated.
sv: Nesting av argumentgrupper och nesting av ömsesidigt uteslutande grupper är avförda.

source: Passing the undocumented keyword argument *prefix_chars* to :meth:`~argparse.ArgumentParser.add_argument_group` is now deprecated.
sv: Att skicka det odokumenterade nyckelordsargumentet *prefix_chars* till :meth:`~argparse.ArgumentParser.add_argument_group` är nu föråldrat.

source: The :class:`argparse.FileType` type converter is deprecated.
sv: Typomvandlaren :class:`argparse.FileType` är föråldrad.

source: Generators: ``throw(type, exc, tb)`` and ``athrow(type, exc, tb)`` signature is deprecated: use ``throw(exc)`` and ``athrow(exc)`` instead, the single argument signature.
sv: Generatorer: ``throw(type, exc, tb)`` och ``athrow(type, exc, tb)`` signaturen är förbrukad: använd ``throw(exc)`` och ``athrow(exc)`` istället, signaturen med ett enda argument.

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). A syntax warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In a future release it will be changed to a syntax error. (:gh:`87999`)
sv: För närvarande accepterar Python numeriska literaler omedelbart följt av nyckelord, till exempel ``0in x``, ``1or x``, ``0if 1else 2``. Det tillåter förvirrande och tvetydiga uttryck som ``[0x1for x in y]`` (som kan tolkas som ``[0x1 for x in y]`` eller ``[0x1f or x in y]``). En syntaxvarning visas om den numeriska litteralen omedelbart följs av något av nyckelorden :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` och :keyword:`or`. I en framtida version kommer det att ändras till ett syntaxfel. (:gh:`87999`)

source: Support for ``__index__()`` and ``__int__()`` method returning non-int type: these methods will be required to return an instance of a strict subclass of :class:`int`.
sv: Stöd för metoderna ``__index__()`` och ``__int__()`` som returnerar icke-int-typer: dessa metoder kommer att behöva returnera en instans av en strikt underklass av :class:`int`.

source: Support for ``__float__()`` method returning a strict subclass of :class:`float`: these methods will be required to return an instance of :class:`float`.
sv: Stöd för metoden ``__float__()`` som returnerar en strikt underklass av :class:`float`: dessa metoder måste returnera en instans av :class:`float`.

source: Support for ``__complex__()`` method returning a strict subclass of :class:`complex`: these methods will be required to return an instance of :class:`complex`.
sv: Stöd för metoden ``__complex__()`` som returnerar en strikt underklass av :class:`complex`: dessa metoder måste returnera en instans av :class:`complex`.

source: Delegation of ``int()`` to ``__trunc__()`` method.
sv: Delegering av ``int()`` till metoden ``__trunc__()``.

source: Passing a complex number as the *real* or *imag* argument in the :func:`complex` constructor is now deprecated; it should only be passed as a single positional argument. (Contributed by Serhiy Storchaka in :gh:`109218`.)
sv: Att skicka ett komplext tal som *real* eller *imag* argument i :func:`complex`-konstruktorn är nu föråldrat; det bör endast skickas som ett enda positionellt argument. (Bidrag från Serhiy Storchaka i :gh:`109218`.)
