Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: This section lists previously described changes and other bugfixes that may require changes to your code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Changes in the Python API
sv: Ändringar i Python API

source: :ref:`PEP 667 <whatsnew313-locals-semantics>` introduces several changes to the semantics of :func:`locals` and :attr:`f_locals <frame.f_locals>`:
sv: :ref:`PEP 667 <whatsnew313-locals-semantics>` inför flera ändringar i semantiken för :func:`locals` och :attr:`f_locals <frame.f_locals>`:

source: Calling :func:`locals` in an :term:`optimized scope` now produces an independent snapshot on each call, and hence no longer implicitly updates previously returned references. Obtaining the legacy CPython behavior now requires explicit calls to update the initially returned dictionary with the results of subsequent calls to :func:`!locals`. Code execution functions that implicitly target :func:`!locals` (such as ``exec`` and ``eval``) must be passed an explicit namespace to access their results in an optimized scope. (Changed as part of :pep:`667`.)
sv: Anrop av :func:`locals` i en :term:`optimized scope` producerar nu en oberoende ögonblicksbild vid varje anrop och uppdaterar därför inte längre implicit tidigare returnerade referenser. För att få det gamla CPython-beteendet krävs nu uttryckliga anrop för att uppdatera den ursprungligen returnerade ordlistan med resultaten av efterföljande anrop till :func:`!locals`. Funktioner för exekvering av kod som implicit riktar sig till :func:`!locals` (t.ex. ``exec`` och ``eval``) måste ges en explicit namnrymd för att komma åt deras resultat i ett optimerat scope. (Ändrad som en del av :pep:`667`.)

source: Calling :func:`locals` from a comprehension at module or class scope (including via ``exec`` or ``eval``) once more behaves as if the comprehension were running as an independent nested function (i.e. the local variables from the containing scope are not included). In Python 3.12, this had changed to include the local variables from the containing scope when implementing :pep:`709`. (Changed as part of :pep:`667`.)
sv: Anrop av :func:`locals` från en förståelse i modul- eller klasscope (inklusive via ``exec`` eller ``eval``) beter sig återigen som om förståelsen kördes som en oberoende nästlad funktion (dvs. de lokala variablerna från det innehållande scopet inkluderas inte). I Python 3.12 hade detta ändrats till att inkludera de lokala variablerna från det innehållande omfånget vid implementering av :pep:`709`. (Ändrat som en del av :pep:`667`.)

source: Accessing :attr:`FrameType.f_locals <frame.f_locals>` in an :term:`optimized scope` now returns a write-through proxy rather than a snapshot that gets updated at ill-specified times. If a snapshot is desired, it must be created explicitly with ``dict`` or the proxy's ``.copy()`` method. (Changed as part of :pep:`667`.)
sv: Åtkomst till :attr:`FrameType.f_locals <frame.f_locals>` i en :term:`optimized scope` returnerar nu en skrivbar proxy snarare än en ögonblicksbild som uppdateras vid ospecificerade tidpunkter. Om en ögonblicksbild önskas måste den skapas explicit med ``dict`` eller proxyns metod ``.copy()``. (Ändrad som en del av :pep:`667`.)

source: :class:`functools.partial` now emits a :exc:`FutureWarning` when used as a method. The behavior will change in future Python versions. Wrap it in :func:`staticmethod` if you want to preserve the old behavior. (Contributed by Serhiy Storchaka in :gh:`121027`.)
sv: :class:`functools.partial` avger nu en :exc:`FutureWarning` när den används som en metod. Beteendet kommer att ändras i framtida Python-versioner. Packa in den i :func:`staticmethod` om du vill bevara det gamla beteendet. (Bidrag från Serhiy Storchaka i :gh:`121027`.)

source: An :exc:`OSError` is now raised by :func:`getpass.getuser` for any failure to retrieve a username, instead of :exc:`ImportError` on non-Unix platforms or :exc:`KeyError` on Unix platforms where the password database is empty.
sv: Nu genereras ett :exc:`OSError` av :func:`getpass.getuser` om det inte går att hämta ett användarnamn, istället för :exc:`ImportError` på plattformar som inte är Unix eller :exc:`KeyError` på Unix-plattformar där lösenordsdatabasen är tom.

source: The value of the :attr:`!mode` attribute of :class:`gzip.GzipFile` is now a string (``'rb'`` or ``'wb'``) instead of an integer (``1`` or ``2``). The value of the :attr:`!mode` attribute of the readable file-like object returned by :meth:`zipfile.ZipFile.open` is now ``'rb'`` instead of ``'r'``. (Contributed by Serhiy Storchaka in :gh:`115961`.)
sv: Värdet på attributet :attr:`!mode` i :class:`gzip.GzipFile` är nu en sträng (``'rb'`` eller ``'wb'``) i stället för ett heltal (``1`` eller ``2``). Värdet på attributet :attr:`!mode` i det läsbara filliknande objektet som returneras av :meth:`zipfile.ZipFile.open` är nu ``'rb'`` istället för ``'r'``. (Bidrag från Serhiy Storchaka i :gh:`115961`.)

source: :class:`mailbox.Maildir` now ignores files with a leading dot (``.``). (Contributed by Zackery Spytz in :gh:`65559`.)
sv: :class:`mailbox.Maildir` ignorerar nu filer med en inledande punkt (``.``). (Bidrag från Zackery Spytz i :gh:`65559`.)

source: :meth:`pathlib.Path.glob` and :meth:`~pathlib.Path.rglob` now return both files and directories if a pattern that ends with "``**``" is given, rather than directories only. Add a trailing slash to keep the previous behavior and only match directories.
sv: :meth:`pathlib.Path.glob` och :meth:`~pathlib.Path.rglob` returnerar nu både filer och kataloger om ett mönster som slutar med "``**``" anges, i stället för bara kataloger. Lägg till ett efterföljande snedstreck för att behålla det tidigare beteendet och bara matcha kataloger.

source: The :mod:`threading` module now expects the :mod:`!_thread` module to have an :func:`!_is_main_interpreter` function. This function takes no arguments and returns ``True`` if the current interpreter is the main interpreter.
sv: Modulen :mod:`threading` förväntar sig nu att modulen :mod:`!_thread` har en funktion :func:`!_is_main_interpreter`. Denna funktion tar inga argument och returnerar ``True`` om den aktuella tolken är huvudtolken.

source: Any library or application that provides a custom :mod:`!_thread` module must provide :func:`!_is_main_interpreter`, just like the module's other "private" attributes. (:gh:`112826`.)
sv: Alla bibliotek eller program som tillhandahåller en anpassad :mod:`!_thread`-modul måste tillhandahålla :func:`!_is_main_interpreter`, precis som modulens andra "privata" attribut. (:gh:`112826`.)

source: Changes in the C API
sv: Förändringar i C API

source: ``Python.h`` no longer includes the ``<ieeefp.h>`` standard header. It was included for the :c:func:`!finite` function which is now provided by the ``<math.h>`` header. It should now be included explicitly if needed. Remove also the ``HAVE_IEEEFP_H`` macro. (Contributed by Victor Stinner in :gh:`108765`.)
sv: ``Python.h`` innehåller inte längre standardhuvudet ``<ieeefp.h>``. Den inkluderades för :c:func:`!finite`-funktionen som nu tillhandahålls av ``<math.h>``-headern. Den bör nu inkluderas explicit om det behövs. Ta även bort makrot ``HAVE_IEEEFP_H``. (Bidrag från Victor Stinner i :gh:`108765`.)

source: ``Python.h`` no longer includes these standard header files: ``<time.h>``, ``<sys/select.h>`` and ``<sys/time.h>``. If needed, they should now be included explicitly. For example, ``<time.h>`` provides the :c:func:`!clock` and :c:func:`!gmtime` functions, ``<sys/select.h>`` provides the :c:func:`!select` function, and ``<sys/time.h>`` provides the :c:func:`!futimes`, :c:func:`!gettimeofday` and :c:func:`!setitimer` functions. (Contributed by Victor Stinner in :gh:`108765`.)
sv: ``Python.h`` innehåller inte längre dessa standardhuvudfiler: ``<time.h>``, ``<sys/select.h>`` och ``<sys/time.h>``. Om det behövs ska de nu inkluderas explicit. Till exempel innehåller ``<time.h>`` funktionerna :c:func:`!clock` och :c:func:`!gmtime`, ``<sys/select.h>`` innehåller funktionen :c:func:`!select` och ``<sys/time.h>`` innehåller funktionerna :c:func:`!futimes`, :c:func:`!gettimeofday` och :c:func:`!setitimer`. (Bidrag från Victor Stinner i :gh:`108765`.)

source: On Windows, ``Python.h`` no longer includes the ``<stddef.h>`` standard header file. If needed, it should now be included explicitly. For example, it provides :c:func:`!offsetof` function, and ``size_t`` and ``ptrdiff_t`` types. Including ``<stddef.h>`` explicitly was already needed by all other platforms, the ``HAVE_STDDEF_H`` macro is only defined on Windows. (Contributed by Victor Stinner in :gh:`108765`.)
sv: På Windows inkluderar inte längre ``Python.h`` standardhuvudfilen ``<stddef.h>``. Om det behövs bör den nu inkluderas explicit. Den tillhandahåller till exempel :c:func:`!offsetof`-funktionen och typerna ``size_t`` och ``ptrdiff_t``. Att inkludera ``<stddef.h>`` explicit behövdes redan av alla andra plattformar, makrot ``HAVE_STDDEF_H`` är endast definierat på Windows. (Bidrag från Victor Stinner i :gh:`108765`.)

source: If the :c:macro:`Py_LIMITED_API` macro is defined, :c:macro:`!Py_BUILD_CORE`, :c:macro:`!Py_BUILD_CORE_BUILTIN` and :c:macro:`!Py_BUILD_CORE_MODULE` macros are now undefined by ``<Python.h>``. (Contributed by Victor Stinner in :gh:`85283`.)
sv: Om makrot :c:macro:`Py_LIMITED_API` är definierat, är makrot :c:macro:`!Py_BUILD_CORE`, :c:macro:`!Py_BUILD_CORE_BUILTIN` och :c:macro:`!Py_BUILD_CORE_MODULE` nu odefinierade av ``<Python.h>``. (Bidrag från Victor Stinner i :gh:`85283`.)

source: The old trashcan macros ``Py_TRASHCAN_SAFE_BEGIN`` and ``Py_TRASHCAN_SAFE_END`` were removed. They should be replaced by the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``.
sv: De gamla papperskorgsmakrot ``Py_TRASHCAN_SAFE_BEGIN`` och ``Py_TRASHCAN_SAFE_END`` har tagits bort. De bör ersättas av de nya makrona ``Py_TRASHCAN_BEGIN`` och ``Py_TRASHCAN_END``.

source: A ``tp_dealloc`` function that has the old macros, such as::
sv: En ``tp_dealloc``-funktion som har de gamla makron, som t.ex:

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }
sv: statiskt void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }

source: should migrate to the new macros as follows::
sv: bör övergå till de nya makron enligt följande::

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, mytype_dealloc) ... Py_TRASHCAN_END }
sv: statiskt void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, mytype_dealloc) ... Py_TRASHCAN_END }

source: Note that ``Py_TRASHCAN_BEGIN`` has a second argument which should be the deallocation function it is in. The new macros were added in Python 3.8 and the old macros were deprecated in Python 3.11. (Contributed by Irit Katriel in :gh:`105111`.)
sv: Observera att ``Py_TRASHCAN_BEGIN`` har ett andra argument som bör vara den deallokeringsfunktion den befinner sig i. De nya makrona lades till i Python 3.8 och de gamla makrona togs bort i Python 3.11. (Bidrag från Irit Katriel i :gh:`105111`.)

source: :ref:`PEP 667 <whatsnew313-locals-semantics>` introduces several changes to frame-related functions:
sv: :ref:`PEP 667 <whatsnew313-locals-semantics>` introducerar flera ändringar av ramrelaterade funktioner:

source: The effects of mutating the dictionary returned from :c:func:`PyEval_GetLocals` in an :term:`optimized scope` have changed. New dict entries added this way will now *only* be visible to subsequent :c:func:`PyEval_GetLocals` calls in that frame, as :c:func:`PyFrame_GetLocals`, :func:`locals`, and :attr:`FrameType.f_locals <frame.f_locals>` no longer access the same underlying cached dictionary. Changes made to entries for actual variable names and names added via the write-through proxy interfaces will be overwritten on subsequent calls to :c:func:`PyEval_GetLocals` in that frame. The recommended code update depends on how the function was being used, so refer to the deprecation notice on the function for details.
sv: Effekterna av att mutera den ordbok som returneras från :c:func:`PyEval_GetLocals` i en :term:`optimized scope` har ändrats. Nya dict-poster som läggs till på detta sätt kommer nu *bara* att vara synliga för efterföljande :c:func:`PyEval_GetLocals`-anrop i den ramen, eftersom :c:func:`PyFrame_GetLocals`, :func:`locals` och :attr:`FrameType.f_locals <frame.f_locals>` inte längre har tillgång till samma underliggande cachade dictionary. Ändringar som görs i poster för faktiska variabelnamn och namn som läggs till via write-through proxy-gränssnitt kommer att skrivas över vid efterföljande anrop till :c:func:`PyEval_GetLocals` i den ramen. Den rekommenderade koduppdateringen beror på hur funktionen användes, så se funktionens meddelande om utfasning för mer information.

source: Calling :c:func:`PyFrame_GetLocals` in an :term:`optimized scope` now returns a write-through proxy rather than a snapshot that gets updated at ill-specified times. If a snapshot is desired, it must be created explicitly (e.g. with :c:func:`PyDict_Copy`), or by calling the new :c:func:`PyEval_GetFrameLocals` API.
sv: Anrop av :c:func:`PyFrame_GetLocals` i en :term:`optimized scope` returnerar nu en skrivbar proxy snarare än en ögonblicksbild som uppdateras vid ospecificerade tidpunkter. Om en ögonblicksbild önskas måste den skapas explicit (t.ex. med :c:func:`PyDict_Copy`), eller genom att anropa det nya :c:func:`PyEval_GetFrameLocals` API:et.

source: :c:func:`!PyFrame_FastToLocals` and :c:func:`!PyFrame_FastToLocalsWithError` no longer have any effect. Calling these functions has been redundant since Python 3.11, when :c:func:`PyFrame_GetLocals` was first introduced.
sv: :c:func:`!PyFrame_FastToLocals` och :c:func:`!PyFrame_FastToLocalsWithError` har inte längre någon effekt. Anrop av dessa funktioner har varit överflödiga sedan Python 3.11, då :c:func:`PyFrame_GetLocals` först introducerades.

source: :c:func:`!PyFrame_LocalsToFast` no longer has any effect. Calling this function is redundant now that :c:func:`PyFrame_GetLocals` returns a write-through proxy for :term:`optimized scopes <optimized scope>`.
sv: :c:func:`!PyFrame_LocalsToFast` har inte längre någon effekt. Anrop av denna funktion är överflödig nu när :c:func:`PyFrame_GetLocals` returnerar en skrivbar proxy för :term:`optimized scopes <optimized scope>`.

source: Python 3.13 removed many private functions. Some of them can be replaced using these alternatives:
sv: Python 3.13 tog bort många privata funktioner. Några av dem kan ersättas med dessa alternativ:

source: ``_PyDict_Pop()``: :c:func:`PyDict_Pop` or :c:func:`PyDict_PopString`;
sv: ``_PyDict_Pop()``: :c:func:`PyDict_Pop` eller :c:func:`PyDict_PopString`;

source: ``_PyEval_SetTrace()``: :c:func:`PyEval_SetTrace` or :c:func:`PyEval_SetTraceAllThreads`;
sv: ``_PyEval_SetTrace()``: :c:func:`PyEval_SetTrace` eller :c:func:`PyEval_SetTraceAllThreads`;

source: ``_PyTime_GetMonotonicClock()``: :c:func:`PyTime_Monotonic` or :c:func:`PyTime_MonotonicRaw`;
sv: ``_PyTime_GetMonotonicClock()``: :c:func:`PyTime_Monotonic` eller :c:func:`PyTime_MonotonicRaw`;

source: ``_PyTime_GetPerfCounter()``: :c:func:`PyTime_PerfCounter` or :c:func:`PyTime_PerfCounterRaw`;
sv: ``_PyTime_GetPerfCounter()``: :c:func:`PyTime_PerfCounter` eller :c:func:`PyTime_PerfCounterRaw`;

source: ``_PyTime_GetSystemClock()``: :c:func:`PyTime_Time` or :c:func:`PyTime_TimeRaw`;
sv: ``_PyTime_GetSystemClock()``: :c:func:`PyTime_Time` eller :c:func:`PyTime_TimeRaw`;

source: The `pythoncapi-compat project`_ can be used to get most of these new functions on Python 3.12 and older.
sv: Projektet `pythoncapi-compat`_ kan användas för att få de flesta av dessa nya funktioner på Python 3.12 och äldre.

source: Regression Test Changes
sv: Ändringar i regressionstest

source: Python built with :file:`configure` :option:`--with-pydebug` now supports a :option:`-X presite=package.module <-X>` command-line option. If used, it specifies a module that should be imported early in the lifecycle of the interpreter, before ``site.py`` is executed. (Contributed by Łukasz Langa in :gh:`110769`.)
sv: Python byggd med :file:`configure` :option:`--with-pydebug` stöder nu kommandoradsoptionen :option:`-X presite=package.module <-X>`. Om det används specificerar det en modul som ska importeras tidigt i tolkens livscykel, innan ``site.py`` exekveras. (Bidrag från Łukasz Langa i :gh:`110769`.)
