Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: Add the :attr:`.IPv4Address.ipv6_mapped` property, which returns the IPv4-mapped IPv6 address. (Contributed by Charles Machalow in :gh:`109466`.)
sv: Lägg till egenskapen :attr:`.IPv4Address.ipv6_mapped`, som returnerar den IPv4-mappade IPv6-adressen. (Bidrag från Charles Machalow i :gh:`109466`.)

source: Fix ``is_global`` and ``is_private`` behavior in :class:`~ipaddress.IPv4Address`, :class:`~ipaddress.IPv6Address`, :class:`~ipaddress.IPv4Network`, and :class:`~ipaddress.IPv6Network`. (Contributed by Jakub Stasiak in :gh:`113171`.)
sv: Åtgärdat ``is_global`` och ``is_private`` beteende i :class:`~ipaddress.IPv4Address`, :class:`~ipaddress.IPv6Address`, :class:`~ipaddress.IPv4Network`, och :class:`~ipaddress.IPv6Network`. (Bidrag från Jakub Stasiak i :gh:`113171`.)

source: :func:`~itertools.batched` has a new *strict* parameter, which raises a :exc:`ValueError` if the final batch is shorter than the specified batch size. (Contributed by Raymond Hettinger in :gh:`113202`.)
sv: :func:`~itertools.batched` har en ny *strict* parameter, som ger upphov till ett :exc:`ValueError` om den slutliga batchen är kortare än den angivna batchstorleken. (Bidrag från Raymond Hettinger i :gh:`113202`.)

source: marshal
sv: sheriff

source: Add the *allow_code* parameter in module functions. Passing ``allow_code=False`` prevents serialization and de-serialization of code objects which are incompatible between Python versions. (Contributed by Serhiy Storchaka in :gh:`113626`.)
sv: Lägg till parametern *allow_code* i modulfunktioner. Genom att ange ``allow_code=False`` förhindras serialisering och de-serialisering av kodobjekt som är inkompatibla mellan Python-versioner. (Bidrag från Serhiy Storchaka i :gh:`113626`.)

source: math
sv: matematik

source: The new function :func:`~math.fma` performs fused multiply-add operations. This computes ``x * y + z`` with only a single round, and so avoids any intermediate loss of precision. It wraps the ``fma()`` function provided by C99, and follows the specification of the IEEE 754 "fusedMultiplyAdd" operation for special cases. (Contributed by Mark Dickinson and Victor Stinner in :gh:`73468`.)
sv: Den nya funktionen :func:`~math.fma` utför sammanslagna multiplicerings- och additionsoperationer. Detta beräknar ``x * y + z`` med endast en enda omgång, och undviker sålunda någon mellanliggande förlust av precision. Den omsluter funktionen ``fma()`` som tillhandahålls av C99 och följer specifikationen för IEEE 754 "fusedMultiplyAdd"-operationen för specialfall. (Bidrag från Mark Dickinson och Victor Stinner i :gh:`73468`.)

source: mimetypes
sv: mimetyper

source: Add the :func:`~mimetypes.guess_file_type` function to guess a MIME type from a filesystem path. Using paths with :func:`~mimetypes.guess_type` is now :term:`soft deprecated`. (Contributed by Serhiy Storchaka in :gh:`66543`.)
sv: Lägg till funktionen :func:`~mimetypes.guess_file_type` för att gissa en MIME-typ från en filsystemssökväg. Att använda sökvägar med :func:`~mimetypes.guess_type` är nu :term:`soft deprecated`. (Bidrag från Serhiy Storchaka i :gh:`66543`.)

source: :class:`~mmap.mmap` is now protected from crashing on Windows when the mapped memory is inaccessible due to file system errors or access violations. (Contributed by Jannis Weigend in :gh:`118209`.)
sv: :class:`~mmap.mmap` är nu skyddad från att krascha i Windows när det mappade minnet är otillgängligt på grund av filsystemfel eller accessöverträdelser. (Bidrag från Jannis Weigend i :gh:`118209`.)

source: :class:`~mmap.mmap` has a new :meth:`~mmap.mmap.seekable` method that can be used when a seekable file-like object is required. The :meth:`~mmap.mmap.seek` method now returns the new absolute position. (Contributed by Donghee Na and Sylvie Liberman in :gh:`111835`.)
sv: :class:`~mmap.mmap` har en ny :meth:`~mmap.mmap.seekable`-metod som kan användas när ett sökbart filliknande objekt krävs. Metoden :meth:`~mmap.mmap.seek` returnerar nu den nya absoluta positionen. (Bidrag från Donghee Na och Sylvie Liberman i :gh:`111835`.)

source: The new UNIX-only *trackfd* parameter for :class:`~mmap.mmap` controls file descriptor duplication; if false, the file descriptor specified by *fileno* will not be duplicated. (Contributed by Zackery Spytz and Petr Viktorin in :gh:`78502`.)
sv: Den nya UNIX-parametern *trackfd* för :class:`~mmap.mmap` kontrollerar duplicering av filbeskrivare; om den är falsk kommer filbeskrivaren som anges av *fileno* inte att dupliceras. (Bidrag från Zackery Spytz och Petr Viktorin i :gh:`78502`.)

source: Add :func:`~os.process_cpu_count` function to get the number of logical CPU cores usable by the calling thread of the current process. (Contributed by Victor Stinner in :gh:`109649`.)
sv: Lägg till funktionen :func:`~os.process_cpu_count` för att få fram antalet logiska processorkärnor som kan användas av den anropande tråden i den aktuella processen. (Bidrag från Victor Stinner i :gh:`109649`.)

source: :func:`~os.cpu_count` and :func:`~os.process_cpu_count` can be overridden through the new environment variable :envvar:`PYTHON_CPU_COUNT` or the new command-line option :option:`-X cpu_count <-X>`. This option is useful for users who need to limit CPU resources of a container system without having to modify application code or the container itself. (Contributed by Donghee Na in :gh:`109595`.)
sv: :func:`~os.cpu_count` och :func:`~os.process_cpu_count` kan åsidosättas med den nya miljövariabeln :envvar:`PYTHON_CPU_COUNT` eller det nya kommandoradsalternativet :option:`-X cpu_count <-X>`. Detta alternativ är användbart för användare som behöver begränsa CPU-resurserna i ett containersystem utan att behöva modifiera programkoden eller själva containern. (Bidrag från Donghee Na i :gh:`109595`.)

source: Add a :ref:`low level interface <os-timerfd>` to Linux's :manpage:`timer file descriptors <timerfd_create(2)>` via :func:`~os.timerfd_create`, :func:`~os.timerfd_settime`, :func:`~os.timerfd_settime_ns`, :func:`~os.timerfd_gettime`, :func:`~os.timerfd_gettime_ns`, :const:`~os.TFD_NONBLOCK`, :const:`~os.TFD_CLOEXEC`, :const:`~os.TFD_TIMER_ABSTIME`, and :const:`~os.TFD_TIMER_CANCEL_ON_SET` (Contributed by Masaru Tsuchiyama in :gh:`108277`.)
sv: Lägg till ett :ref:`lågnivågränssnitt <os-timerfd>` till Linux :manpage:`timer file descriptors <timerfd_create(2)>` via :func:`~os.timerfd_create`, :func:`~os.timerfd_settime`, :func:`~os.timerfd_settime_ns`, :func:`~os.timerfd_gettime`, :func:`~os.timerfd_gettime_ns`, :const:`~os.TFD_NONBLOCK`, :const:`~os.TFD_CLOEXEC`, :const:`~os.TFD_TIMER_ABSTIME`, och :const:`~os.TFD_TIMER_CANCEL_ON_SET` (Bidrag från Masaru Tsuchiyama i :gh:`108277`.)

source: :func:`~os.lchmod` and the *follow_symlinks* argument of :func:`~os.chmod` are both now available on Windows. Note that the default value of *follow_symlinks* in :func:`!lchmod` is ``False`` on Windows. (Contributed by Serhiy Storchaka in :gh:`59616`.)
sv: :func:`~os.lchmod` och argumentet *follow_symlinks* i :func:`~os.chmod` är nu båda tillgängliga i Windows. Observera att standardvärdet för *follow_symlinks* i :func:`!lchmod` är ``False`` i Windows. (Bidrag från Serhiy Storchaka i :gh:`59616`.)

source: :func:`~os.fchmod` and support for file descriptors in :func:`~os.chmod` are both now available on Windows. (Contributed by Serhiy Storchaka in :gh:`113191`.)
sv: :func:`~os.fchmod` och stöd för filbeskrivare i :func:`~os.chmod` är nu båda tillgängliga i Windows. (Bidrag från Serhiy Storchaka i :gh:`113191`.)

source: On Windows, :func:`~os.mkdir` and :func:`~os.makedirs` now support passing a *mode* value of ``0o700`` to apply access control to the new directory. This implicitly affects :func:`tempfile.mkdtemp` and is a mitigation for :cve:`2024-4030`. Other values for *mode* continue to be ignored. (Contributed by Steve Dower in :gh:`118486`.)
sv: I Windows har :func:`~os.mkdir` och :func:`~os.makedirs` nu stöd för att skicka ett *mode*-värde på ``0o700`` för att tillämpa åtkomstkontroll på den nya katalogen. Detta påverkar implicit :func:`tempfile.mkdtemp` och är en begränsning av :cve:`2024-4030`. Andra värden för *mode* fortsätter att ignoreras. (Bidrag från Steve Dower i :gh:`118486`.)

source: :func:`~os.posix_spawn` now accepts ``None`` for the *env* argument, which makes the newly spawned process use the current process environment. (Contributed by Jakub Kulik in :gh:`113119`.)
sv: :func:`~os.posix_spawn` accepterar nu ``None`` för argumentet *env*, vilket gör att den nyligen skapade processen använder den aktuella processmiljön. (Bidrag från Jakub Kulik i :gh:`113119`.)

source: :func:`~os.posix_spawn` can now use the :const:`~os.POSIX_SPAWN_CLOSEFROM` attribute in the *file_actions* parameter on platforms that support :c:func:`!posix_spawn_file_actions_addclosefrom_np`. (Contributed by Jakub Kulik in :gh:`113117`.)
sv: :func:`~os.posix_spawn` kan nu använda attributet :const:`~os.POSIX_SPAWN_CLOSEFROM` i parametern *file_actions* på plattformar som stöder :c:func:`!posix_spawn_file_actions_addclosefrom_np`. (Bidrag från Jakub Kulik i :gh:`113117`.)

source: os.path
sv: os.sökväg

source: Add :func:`~os.path.isreserved` to check if a path is reserved on the current system. This function is only available on Windows. (Contributed by Barney Gale in :gh:`88569`.)
sv: Lägg till :func:`~os.path.isreserved` för att kontrollera om en sökväg är reserverad i det aktuella systemet. Denna funktion är endast tillgänglig på Windows. (Bidrag från Barney Gale i :gh:`88569`.)

source: On Windows, :func:`~os.path.isabs` no longer considers paths starting with exactly one slash (``\`` or ``/``) to be absolute. (Contributed by Barney Gale and Jon Foster in :gh:`44626`.)
sv: I Windows anser :func:`~os.path.isabs` inte längre att sökvägar som börjar med exakt ett snedstreck (```` eller ``/``) är absoluta. (Bidrag från Barney Gale och Jon Foster i :gh:`44626`.)

source: :func:`~os.path.realpath` now resolves MS-DOS style file names even if the file is not accessible. (Contributed by Moonsik Park in :gh:`82367`.)
sv: :func:`~os.path.realpath` löser nu filnamn i MS-DOS-stil även om filen inte är tillgänglig. (Bidrag från Moonsik Park i :gh:`82367`.)

source: pathlib
sv: sökväg

source: Add :exc:`~pathlib.UnsupportedOperation`, which is raised instead of :exc:`NotImplementedError` when a path operation isn't supported. (Contributed by Barney Gale in :gh:`89812`.)
sv: Lägg till :exc:`~pathlib.UnsupportedOperation`, som visas i stället för :exc:`NotImplementedError` när en sökvägsoperation inte stöds. (Bidrag från Barney Gale i :gh:`89812`.)

source: Add a new constructor for creating :class:`~pathlib.Path` objects from 'file' URIs (``file:///``), :meth:`.Path.from_uri`. (Contributed by Barney Gale in :gh:`107465`.)
sv: Lägg till en ny konstruktör för att skapa :class:`~pathlib.Path`-objekt från 'fil'-URI:er (``file:///``), :meth:`.Path.from_uri`. (Bidrag från Barney Gale i :gh:`107465`.)

source: Add :meth:`.PurePath.full_match` for matching paths with shell-style wildcards, including the recursive wildcard "``**``". (Contributed by Barney Gale in :gh:`73435`.)
sv: Lägg till :meth:`.PurePath.full_match` för matchning av sökvägar med jokertecken i shell-stil, inklusive det rekursiva jokertecknet "``**``". (Bidrag från Barney Gale i :gh:`73435`.)

source: Add the :attr:`.PurePath.parser` class attribute to store the implementation of :mod:`os.path` used for low-level path parsing and joining. This will be either :mod:`!posixpath` or :mod:`!ntpath`.
sv: Lägg till klassattributet :attr:`.PurePath.parser` för att lagra implementeringen av :mod:`os.path` som används för lågnivåanalys och sammanfogning av sökvägar. Detta kommer att vara antingen :mod:`!posixpath` eller :mod:`!ntpath`.

source: Add *recurse_symlinks* keyword-only argument to :meth:`.Path.glob` and :meth:`~pathlib.Path.rglob`. (Contributed by Barney Gale in :gh:`77609`.)
sv: Lägg till *recurse_symlinks* endast nyckelordsargument till :meth:`.Path.glob` och :meth:`~pathlib.Path.rglob`. (Bidrag från Barney Gale i :gh:`77609`.)

source: :meth:`.Path.glob` and :meth:`~pathlib.Path.rglob` now return files and directories when given a pattern that ends with "``**``". Previously, only directories were returned. (Contributed by Barney Gale in :gh:`70303`.)
sv: :meth:`.Path.glob` och :meth:`~pathlib.Path.rglob` returnerar nu filer och kataloger när de får ett mönster som slutar med "``**``". Tidigare returnerades endast kataloger. (Bidrag från Barney Gale i :gh:`70303`.)

source: Add the *follow_symlinks* keyword-only argument to :meth:`Path.is_file <pathlib.Path.is_file>`, :meth:`Path.is_dir <pathlib.Path.is_dir>`, :meth:`.Path.owner`, and :meth:`.Path.group`. (Contributed by Barney Gale in :gh:`105793` and Kamil Turek in :gh:`107962`.)
sv: Lägg till argumentet *follow_symlinks* med endast nyckelord till :meth:`Path.is_file <pathlib.Path.is_file>`, :meth:`Path.is_dir <pathlib.Path.is_dir>`, :meth:`.Path.owner` och :meth:`.Path.group`. (Bidrag från Barney Gale i :gh:`105793` och Kamil Turek i :gh:`107962`.)

source: :func:`breakpoint` and :func:`~pdb.set_trace` now enter the debugger immediately rather than on the next line of code to be executed. This change prevents the debugger from breaking outside of the context when :func:`!breakpoint` is positioned at the end of the context. (Contributed by Tian Gao in :gh:`118579`.)
sv: :func:`breakpoint` och :func:`~pdb.set_trace` går nu in i felsökaren omedelbart i stället för på nästa kodrad som ska exekveras. Denna ändring förhindrar att felsökaren bryts utanför kontexten när :func:`!breakpoint` är placerad i slutet av kontexten. (Bidrag från Tian Gao i :gh:`118579`.)

source: ``sys.path[0]`` is no longer replaced by the directory of the script being debugged when :attr:`sys.flags.safe_path` is set. (Contributed by Tian Gao and Christian Walther in :gh:`111762`.)
sv: ``sys.path[0]`` ersätts inte längre av katalogen för det skript som felsöks när :attr:`sys.flags.safe_path` är inställd. (Bidrag från Tian Gao och Christian Walther i :gh:`111762`.)

source: :mod:`zipapp` is now supported as a debugging target. (Contributed by Tian Gao in :gh:`118501`.)
sv: :mod:`zipapp` stöds nu som ett felsökningsmål. (Bidrag från Tian Gao i :gh:`118501`.)

source: Add ability to move between chained exceptions during post-mortem debugging in :func:`~pdb.pm` using the new :pdbcmd:`exceptions [exc_number] <exceptions>` command for Pdb. (Contributed by Matthias Bussonnier in :gh:`106676`.)
sv: Lägg till möjligheten att flytta mellan kedjade undantag under post-mortem-felsökning i :func:`~pdb.pm` med det nya kommandot :pdbcmd:`exceptions [exc_number] <exceptions>` för Pdb. (Bidrag från Matthias Bussonnier i :gh:`106676`.)

source: Expressions and statements whose prefix is a pdb command are now correctly identified and executed. (Contributed by Tian Gao in :gh:`108464`.)
sv: Uttryck och satser vars prefix är ett pdb-kommando identifieras och exekveras nu korrekt. (Bidrag från Tian Gao i :gh:`108464`.)

source: queue
sv: kö

source: Add :meth:`Queue.shutdown <queue.Queue.shutdown>` and :exc:`~queue.ShutDown` to manage queue termination. (Contributed by Laurie Opperman and Yves Duprat in :gh:`104750`.)
sv: Lägg till :meth:`Queue.shutdown <queue.Queue.shutdown>` och :exc:`~queue.ShutDown` för att hantera köavslut. (Bidrag från Laurie Opperman och Yves Duprat i :gh:`104750`.)

source: random
sv: slumpvis

source: Add a :ref:`command-line interface <random-cli>`. (Contributed by Hugo van Kemenade in :gh:`118131`.)
sv: Lägg till ett :ref:`kommandoradsgränssnitt <random-cli>`. (Bidrag från Hugo van Kemenade i :gh:`118131`.)

source: Rename :exc:`!re.error` to :exc:`~re.PatternError` for improved clarity. :exc:`!re.error` is kept for backward compatibility.
sv: Byt namn på :exc:`!re.error` till :exc:`~re.PatternError` för ökad tydlighet. :exc:`!re.error` behålls för bakåtkompatibilitet.

source: Support the *dir_fd* and *follow_symlinks* keyword arguments in :func:`~shutil.chown`. (Contributed by Berker Peksag and Tahia K in :gh:`62308`)
sv: Stöd för nyckelordsargumenten *dir_fd* och *follow_symlinks* i :func:`~shutil.chown`. (Bidrag från Berker Peksag och Tahia K i :gh:`62308`)

source: site
sv: plats

source: :file:`.pth` files are now decoded using UTF-8 first, and then with the :term:`locale encoding` if UTF-8 decoding fails. (Contributed by Inada Naoki in :gh:`117802`.)
sv: :file:`.pth`-filer avkodas nu först med UTF-8, och sedan med :term:`locale encoding` om UTF-8-avkodningen misslyckas. (Bidrag från Inada Naoki i :gh:`117802`.)

source: A :exc:`ResourceWarning` is now emitted if a :class:`~sqlite3.Connection` object is not :meth:`closed <sqlite3.Connection.close>` explicitly. (Contributed by Erlend E. Aasland in :gh:`105539`.)
sv: En :exc:`ResourceWarning` skickas nu ut om ett :class:`~sqlite3.Connection`-objekt inte :meth:`closed <sqlite3.Connection.close>` explicit. (Bidrag från Erlend E. Aasland i :gh:`105539`.)

source: Add the *filter* keyword-only parameter to :meth:`.Connection.iterdump` for filtering database objects to dump. (Contributed by Mariusz Felisiak in :gh:`91602`.)
sv: Lägg till parametern *filter* med endast nyckelord till :meth:`.Connection.iterdump` för filtrering av databasobjekt som ska dumpas. (Bidrag från Mariusz Felisiak i :gh:`91602`.)

source: The :func:`~ssl.create_default_context` API now includes :data:`~ssl.VERIFY_X509_PARTIAL_CHAIN` and :data:`~ssl.VERIFY_X509_STRICT` in its default flags.
sv: API:et :func:`~ssl.create_default_context` inkluderar nu :data:`~ssl.VERIFY_X509_PARTIAL_CHAIN` och :data:`~ssl.VERIFY_X509_STRICT` i sina standardflaggor.

source: :data:`~ssl.VERIFY_X509_STRICT` may reject pre-:rfc:`5280` or malformed certificates that the underlying OpenSSL implementation might otherwise accept. Whilst disabling this is not recommended, you can do so using:
sv: :data:`~ssl.VERIFY_X509_STRICT` kan avvisa pre-:rfc:`5280` eller missbildade certifikat som den underliggande OpenSSL-implementationen annars skulle kunna acceptera. Det är inte rekommenderat att inaktivera detta, men du kan göra det genom att använda:

source: (Contributed by William Woodruff in :gh:`112389`.)
sv: (Bidrag från William Woodruff i :gh:`112389`.)

source: statistics
sv: statistik

source: Add :func:`~statistics.kde` for kernel density estimation. This makes it possible to estimate a continuous probability density function from a fixed number of discrete samples. (Contributed by Raymond Hettinger in :gh:`115863`.)
sv: Lägg till :func:`~statistics.kde` för skattning av kärntäthet. Detta gör det möjligt att skatta en kontinuerlig sannolikhetstäthetsfunktion från ett fast antal diskreta prover. (Bidrag från Raymond Hettinger i :gh:`115863`.)

source: Add :func:`~statistics.kde_random` for sampling from an estimated probability density function created by :func:`~statistics.kde`. (Contributed by Raymond Hettinger in :gh:`115863`.)
sv: Lägg till :func:`~statistics.kde_random` för provtagning från en uppskattad sannolikhetstäthetsfunktion skapad av :func:`~statistics.kde`. (Bidrag från Raymond Hettinger i :gh:`115863`.)

source: subprocess
sv: delprocess

source: The :mod:`subprocess` module now uses the :func:`~os.posix_spawn` function in more situations.
sv: Modulen :mod:`subprocess` använder nu funktionen :func:`~os.posix_spawn` i fler situationer.

source: Notably, when *close_fds* is ``True`` (the default), :func:`~os.posix_spawn` will be used when the C library provides :c:func:`!posix_spawn_file_actions_addclosefrom_np`, which includes recent versions of Linux, FreeBSD, and Solaris. On Linux, this should perform similarly to the existing Linux :c:func:`!vfork` based code.
sv: När *close_fds* är ``True`` (standard) kommer :func:`~os.posix_spawn` att användas när C-biblioteket tillhandahåller :c:func:`!posix_spawn_file_actions_addclosefrom_np`, vilket inkluderar de senaste versionerna av Linux, FreeBSD och Solaris. På Linux bör detta fungera på liknande sätt som den befintliga Linux :c:func:`!vfork`-baserade koden.

source: A private control knob :attr:`!subprocess._USE_POSIX_SPAWN` can be set to ``False`` if you need to force :mod:`subprocess` to never use :func:`~os.posix_spawn`. Please report your reason and platform details in the :ref:`issue tracker <using-the-tracker>` if you set this so that we can improve our API selection logic for everyone. (Contributed by Jakub Kulik in :gh:`113117`.)
sv: En privat kontrollknapp :attr:`!subprocess._USE_POSIX_SPAWN` kan sättas till ``False`` om du behöver tvinga :mod:`subprocess` att aldrig använda :func:`~os.posix_spawn`. Vänligen rapportera din anledning och plattformsdetaljer i :ref:``issue tracker <using-the-tracker>`` om du ställer in detta så att vi kan förbättra vår API-valslogik för alla. (Bidrag från Jakub Kulik i :gh:`113117`.)

source: sys
sv: system

source: Add the :func:`~sys._is_interned` function to test if a string was interned. This function is not guaranteed to exist in all implementations of Python. (Contributed by Serhiy Storchaka in :gh:`78573`.)
sv: Lägg till funktionen :func:`~sys._is_interned` för att testa om en sträng har internerats. Det är inte säkert att den här funktionen finns i alla implementationer av Python. (Bidrag från Serhiy Storchaka i :gh:`78573`.)

source: tempfile
sv: tempfil

source: On Windows, the default mode ``0o700`` used by :func:`tempfile.mkdtemp` now limits access to the new directory due to changes to :func:`os.mkdir`. This is a mitigation for :cve:`2024-4030`. (Contributed by Steve Dower in :gh:`118486`.)
sv: I Windows begränsar standardläget ``0o700`` som används av :func:`tempfile.mkdtemp` nu åtkomsten till den nya katalogen på grund av ändringar i :func:`os.mkdir`. Detta är en begränsning av :cve:`2024-4030`. (Bidrag från Steve Dower i :gh:`118486`.)

source: time
sv: tid

source: On Windows, :func:`~time.monotonic` now uses the ``QueryPerformanceCounter()`` clock for a resolution of 1 microsecond, instead of the ``GetTickCount64()`` clock which has a resolution of 15.6 milliseconds. (Contributed by Victor Stinner in :gh:`88494`.)
sv: I Windows använder :func:`~time.monotonic` nu klockan ``QueryPerformanceCounter()`` med en upplösning på 1 mikrosekund, istället för klockan ``GetTickCount64()`` som har en upplösning på 15,6 millisekunder. (Bidrag från Victor Stinner i :gh:`88494`.)

source: On Windows, :func:`~time.time` now uses the ``GetSystemTimePreciseAsFileTime()`` clock for a resolution of 1 microsecond, instead of the ``GetSystemTimeAsFileTime()`` clock which has a resolution of 15.6 milliseconds. (Contributed by Victor Stinner in :gh:`63207`.)
sv: I Windows använder :func:`~time.time` nu klockan ``GetSystemTimePreciseAsFileTime()`` med en upplösning på 1 mikrosekund, istället för klockan ``GetSystemTimeAsFileTime()`` som har en upplösning på 15,6 millisekunder. (Bidrag från Victor Stinner i :gh:`63207`.)

source: Add :mod:`tkinter` widget methods: :meth:`!tk_busy_hold`, :meth:`!tk_busy_configure`, :meth:`!tk_busy_cget`, :meth:`!tk_busy_forget`, :meth:`!tk_busy_current`, and :meth:`!tk_busy_status`. (Contributed by Miguel, klappnase and Serhiy Storchaka in :gh:`72684`.)
sv: Lägg till :mod:`tkinter` widgetmetoder: :meth:`!tk_busy_hold`, :meth:`!tk_busy_configure`, :meth:`!tk_busy_cget`, :meth:`!tk_busy_forget`, :meth:`!tk_busy_current`, och :meth:`!tk_busy_status`. (Bidrag från Miguel, klappnase och Serhiy Storchaka i :gh:`72684`.)
