Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: What's New In Python 3.13
sv: Vad är nytt i Python 3.13

source: Editors
sv: Redigerare

source: Adam Turner and Thomas Wouters
sv: Adam Turner och Thomas Wouters

source: This article explains the new features in Python 3.13, compared to 3.12. Python 3.13 was released on October 7, 2024. For full details, see the :ref:`changelog <changelog>`.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.13 jämfört med 3.12. Python 3.13 släpptes den 7 oktober 2024. För fullständig information, se :ref:`changelog <changelog>`.

source: :pep:`719` -- Python 3.13 Release Schedule
sv: :pep:`719` -- Python 3.13 Utgivningsschema

source: Summary -- Release Highlights
sv: Sammanfattning -- Release Highlights

source: Python 3.13 is the latest stable release of the Python programming language, with a mix of changes to the language, the implementation and the standard library. The biggest changes include a new `interactive interpreter <whatsnew313-better-interactive-interpreter_>`_, experimental support for running in a `free-threaded mode <whatsnew313-free-threaded-cpython_>`_ (:pep:`703`), and a `Just-In-Time compiler <whatsnew313-jit-compiler_>`_ (:pep:`744`).
sv: Python 3.13 är den senaste stabila versionen av programmeringsspråket Python, med en blandning av ändringar i språket, implementeringen och standardbiblioteket. De största förändringarna inkluderar en ny interaktiv tolk <whatsnew313-better-interactive-interpreter_>`_, experimentellt stöd för att köra i ett "free-threaded mode" <whatsnew313-free-threaded-cpython_>`_ (:pep:`703``) och en "Just-In-Time-compiler" <whatsnew313-jit-compiler_>`_ (:pep:`744``).

source: Error messages continue to improve, with tracebacks now highlighted in color by default. The :func:`locals` builtin now has :ref:`defined semantics <whatsnew313-locals-semantics>` for changing the returned mapping, and type parameters now support default values.
sv: Felmeddelanden fortsätter att förbättras, med spårningar nu markerade i färg som standard. Inbyggda :func:`locals` har nu :ref:`defined semantics <whatsnew313-locals-semantics>` för att ändra den returnerade mappningen, och typ-parametrar stöder nu standardvärden.

source: The library changes contain removal of deprecated APIs and modules, as well as the usual improvements in user-friendliness and correctness. Several legacy standard library modules have now `been removed <whatsnew313-pep594_>`_ following their deprecation in Python 3.11 (:pep:`594`).
sv: Biblioteksändringarna innehåller borttagning av föråldrade API:er och moduler, samt de vanliga förbättringarna i användarvänlighet och korrekthet. Flera äldre standardbiblioteksmoduler har nu "tagits bort <whatsnew313-pep594_>`_ efter att de tagits bort i Python 3.11 (:pep:`594`).

source: This article doesn't attempt to provide a complete specification of all new features, but instead gives a convenient overview. For full details refer to the documentation, such as the :ref:`Library Reference <library-index>` and :ref:`Language Reference <reference-index>`. To understand the complete implementation and design rationale for a change, refer to the PEP for a particular new feature; but note that PEPs usually are not kept up-to-date once a feature has been fully implemented. See `Porting to Python 3.13`_ for guidance on upgrading from earlier versions of Python.
sv: Den här artikeln försöker inte ge en fullständig specifikation av alla nya funktioner, utan ger istället en praktisk översikt. För fullständig information hänvisas till dokumentationen, t.ex. :ref:`Library Reference <library-index>` och :ref:`Language Reference <reference-index>`. För att förstå den fullständiga implementeringen och designrationalen för en förändring, se PEP för en viss ny funktion; men notera att PEP vanligtvis inte hålls uppdaterade när en funktion har implementerats fullt ut. Se `Porting to Python 3.13`_ för vägledning om uppgradering från tidigare versioner av Python.

source: Interpreter improvements:
sv: Förbättringar av tolkar:

source: A greatly improved :ref:`interactive interpreter <whatsnew313-better-interactive-interpreter>` and :ref:`improved error messages <whatsnew313-improved-error-messages>`.
sv: En kraftigt förbättrad :ref:`interaktiv tolk <whatsnew313-better-interactive-interpreter>` och :ref:`förbättrade felmeddelanden <whatsnew313-improved-error-messages>`.

source: :pep:`667`: The :func:`locals` builtin now has :ref:`defined semantics <whatsnew313-locals-semantics>` when mutating the returned mapping. Python debuggers and similar tools may now more reliably update local variables in optimized scopes even during concurrent code execution.
sv: :pep:`667`: Inbyggda :func:`locals` har nu :ref:`definierad semantik <whatsnew313-locals-semantics>` vid mutation av den returnerade mappningen. Python-debuggar och liknande verktyg kan nu på ett mer tillförlitligt sätt uppdatera lokala variabler i optimerade scopes även under samtidig kodkörning.

source: :pep:`703`: CPython 3.13 has experimental support for running with the :term:`global interpreter lock` disabled. See :ref:`Free-threaded CPython <whatsnew313-free-threaded-cpython>` for more details.
sv: :pep:`703`: CPython 3.13 har experimentellt stöd för att köra med :term:`global interpreter lock` inaktiverat. Se :ref:``Fri-trådad CPython <whatsnew313-free-threaded-cpython>`` för mer information.

source: :pep:`744`: A basic :ref:`JIT compiler <whatsnew313-jit-compiler>` was added. It is currently disabled by default (though we may turn it on later). Performance improvements are modest -- we expect to improve this over the next few releases.
sv: :pep:`744`: En grundläggande :ref:`JIT-kompilator <whatsnew313-jit-compiler>` har lagts till. Den är för närvarande inaktiverad som standard (men vi kan komma att aktivera den senare). Prestandaförbättringarna är blygsamma -- vi förväntar oss att förbättra detta under de kommande utgåvorna.

source: Color support in the new :ref:`interactive interpreter <whatsnew313-better-interactive-interpreter>`, as well as in :ref:`tracebacks <whatsnew313-improved-error-messages>` and :ref:`doctest <whatsnew313-doctest>` output. This can be disabled through the :envvar:`PYTHON_COLORS` and |NO_COLOR|_ environment variables.
sv: Färgstöd i den nya :ref:`interaktiva tolken <whatsnew313-better-interactive-interpreter>`, samt i :ref:`tracebacks <whatsnew313-improved-error-messages>` och :ref:`doctest <whatsnew313-doctest>` utdata. Detta kan inaktiveras genom miljövariablerna :envvar:`PYTHON_COLORS` och |NO_COLOR|_.

source: Python data model improvements:
sv: Förbättringar av Python-datamodellen:

source: :attr:`~type.__static_attributes__` stores the names of attributes accessed through ``self.X`` in any function in a class body.
sv: :attr:`~type.__static_attributes__` lagrar namnen på attribut som nås via ``self.X`` i valfri funktion i en klass kropp.

source: :attr:`~type.__firstlineno__` records the first line number of a class definition.
sv: :attr:`~type.__firstlineno__` registrerar det första radnumret i en klassdefinition.

source: Significant improvements in the standard library:
sv: Betydande förbättringar i standardbiblioteket:

source: Add a new :exc:`PythonFinalizationError` exception, raised when an operation is blocked during :term:`finalization <interpreter shutdown>`.
sv: Lägg till ett nytt :exc:`PythonFinalizationError`-undantag, som uppstår när en operation blockeras under :term:`finalization <interpreter shutdown>`.

source: The :mod:`argparse` module now supports deprecating command-line options, positional arguments, and subcommands.
sv: Modulen :mod:`argparse` stöder nu föråldrade kommandoradsalternativ, positionella argument och underkommandon.

source: The new functions :func:`base64.z85encode` and :func:`base64.z85decode` support encoding and decoding `Z85 data`_.
sv: De nya funktionerna :func:`base64.z85encode` och :func:`base64.z85decode` stöder kodning och avkodning av `Z85-data`_.

source: The :mod:`copy` module now has a :func:`copy.replace` function, with support for many builtin types and any class defining the :func:`~object.__replace__` method.
sv: Modulen :mod:`copy` har nu en funktion :func:`copy.replace`, med stöd för många inbyggda typer och alla klasser som definierar metoden :func:`~object.__replace__`.

source: The new :mod:`dbm.sqlite3` module is now the default :mod:`dbm` backend.
sv: Den nya :mod:`dbm.sqlite3`-modulen är nu standard :mod:`dbm`-backend.

source: The :mod:`os` module has a :ref:`suite of new functions <os-timerfd>` for working with Linux's timer notification file descriptors.
sv: Modulen :mod:`os` har en :ref:`svit av nya funktioner <os-timerfd>` för att arbeta med Linux timer notification file descriptors.

source: The :mod:`random` module now has a :ref:`command-line interface <random-cli>`.
sv: Modulen :mod:`random` har nu ett :ref:`kommandoradsgränssnitt <random-cli>`.

source: Security improvements:
sv: Förbättringar av säkerheten:

source: :func:`ssl.create_default_context` sets :data:`ssl.VERIFY_X509_PARTIAL_CHAIN` and :data:`ssl.VERIFY_X509_STRICT` as default flags.
sv: :func:`ssl.create_default_context` anger :data:`ssl.VERIFY_X509_PARTIAL_CHAIN` och :data:`ssl.VERIFY_X509_STRICT` som standardflaggor.

source: C API improvements:
sv: Förbättringar av C API:

source: The :c:data:`Py_mod_gil` slot is now used to indicate that an extension module supports running with the :term:`GIL` disabled.
sv: Platsen :c:data:`Py_mod_gil` används nu för att indikera att en tilläggsmodul stöder körning med :term:`GIL` inaktiverad.

source: The :doc:`PyTime C API </c-api/time>` has been added, providing access to system clocks.
sv: :doc:`PyTime C API </c-api/time>` har lagts till och ger tillgång till systemklockor.

source: :c:type:`PyMutex` is a new lightweight mutex that occupies a single byte.
sv: :c:type:`PyMutex` är en ny lättviktig mutex som upptar en enda byte.

source: There is a new :ref:`suite of functions <c-api-monitoring>` for generating :pep:`669` monitoring events in the C API.
sv: Det finns en ny :ref:`svit av funktioner <c-api-monitoring>` för att generera :pep:`669` övervakningshändelser i C API.

source: New typing features:
sv: Nya funktioner för skrivning:

source: :pep:`696`: Type parameters (:data:`typing.TypeVar`, :data:`typing.ParamSpec`, and :data:`typing.TypeVarTuple`) now support defaults.
sv: :pep:`696`: Typparametrar (:data:`typing.TypeVar`, :data:`typing.ParamSpec`, och :data:`typing.TypeVarTuple`) stöder nu standardvärden.

source: :pep:`702`: The new :func:`warnings.deprecated` decorator adds support for marking deprecations in the type system and at runtime.
sv: :pep:`702`: Den nya :func:`warnings.deprecated`-dekoratorn lägger till stöd för att markera deprecations i typsystemet och vid körning.

source: :pep:`705`: :data:`typing.ReadOnly` can be used to mark an item of a :class:`typing.TypedDict` as read-only for type checkers.
sv: :pep:`705`: :data:`typing.ReadOnly` kan användas för att markera ett objekt i en :class:`typing.TypedDict` som skrivskyddat för typkontrollanter.

source: :pep:`742`: :data:`typing.TypeIs` provides more intuitive type narrowing behavior, as an alternative to :data:`typing.TypeGuard`.
sv: :pep:`742`: :data:`typing.TypeIs` ger ett mer intuitivt beteende för typbegränsning, som ett alternativ till :data:`typing.TypeGuard`.

source: Platform support:
sv: Stöd för plattform:

source: :pep:`730`: Apple's iOS is now an :ref:`officially supported platform <whatsnew313-platform-support>`, at :pep:`tier 3 <11#tier-3>`.
sv: :pep:`730`: Apples iOS är nu en :ref:`officiellt stödd plattform <whatsnew313-platform-support>`, på :pep:`nivå 3 <11#tier-3>`.

source: :pep:`738`: Android is now an :ref:`officially supported platform <whatsnew313-platform-support>`, at :pep:`tier 3 <11#tier-3>`.
sv: :pep:`738`: Android är nu en :ref:`officiellt stödd plattform <whatsnew313-platform-support>`, på :pep:`nivå 3 <11#tier-3>`.

source: ``wasm32-wasi`` is now supported as a :pep:`tier 2 <11#tier-2>` platform.
sv: ``wasm32-wasi`` stöds nu som en :pep:`tier 2 <11#tier-2>`-plattform.

source: ``wasm32-emscripten`` is no longer an officially supported platform.
sv: ``wasm32-emscripten`` är inte längre en officiellt stödd plattform.

source: Important removals:
sv: Viktiga flyttningar:

source: :ref:`PEP 594 <whatsnew313-pep594>`: The remaining 19 "dead batteries" (legacy stdlib modules) have been removed from the standard library: :mod:`!aifc`, :mod:`!audioop`, :mod:`!cgi`, :mod:`!cgitb`, :mod:`!chunk`, :mod:`!crypt`, :mod:`!imghdr`, :mod:`!mailcap`, :mod:`!msilib`, :mod:`!nis`, :mod:`!nntplib`, :mod:`!ossaudiodev`, :mod:`!pipes`, :mod:`!sndhdr`, :mod:`!spwd`, :mod:`!sunau`, :mod:`!telnetlib`, :mod:`!uu` and :mod:`!xdrlib`.
sv: :ref:`PEP 594 <whatsnew313-pep594>`: De återstående 19 "döda batterierna" (legacy stdlib modules) har tagits bort från standardbiblioteket: :mod:`!aifc`, :mod:`!audioop`, :mod:`!cgi`, :mod:`!cgitb`, :mod:`!chunk`, :mod:`!crypt`, :mod:`!imghdr`, :mod:`!mailcap`, :mod:`!msilib`, :mod:`!nis`, :mod:`!nntplib`, :mod:`!ossaudiodev`, :mod:`!pipes`, :mod:`!sndhdr`, :mod:`!spwd`, :mod:`!sunau`, :mod:`!telnetlib`, :mod:`!uu` och :mod:`!xdrlib`.

source: Remove the :program:`2to3` tool and :mod:`!lib2to3` module (deprecated in Python 3.11).
sv: Ta bort verktyget :program:`2to3` och modulen :mod:`!lib2to3` (föråldrad i Python 3.11).

source: Remove the :mod:`!tkinter.tix` module (deprecated in Python 3.6).
sv: Ta bort modulen :mod:`!tkinter.tix` (föråldrad i Python 3.6).

source: Remove the :func:`!locale.resetlocale` function.
sv: Ta bort funktionen :func:`!locale.resetlocale`.

source: Remove the :mod:`!typing.io` and :mod:`!typing.re` namespaces.
sv: Ta bort namnområdena :mod:`!typing.io` och :mod:`!typing.re`.

source: Remove chained :class:`classmethod` descriptors.
sv: Ta bort kedjade :class:`classmethod`-beskrivningar.

source: Release schedule changes:
sv: Ändringar i lanseringsschemat:

source: :pep:`602` ("Annual Release Cycle for Python") has been updated to extend the full support ('bugfix') period for new releases to two years. This updated policy means that:
sv: :pep:`602` ("Årlig utgivningscykel för Python") har uppdaterats för att förlänga perioden för fullt stöd ("bugfix") för nya utgåvor till två år. Denna uppdaterade policy innebär att:

source: Python 3.9--3.12 have one and a half years of full support, followed by three and a half years of security fixes.
sv: Python 3.9--3.12 har ett och ett halvt års full support, följt av tre och ett halvt år med säkerhetsfixar.

source: Python 3.13 and later have two years of full support, followed by three years of security fixes.
sv: Python 3.13 och senare har två års full support, följt av tre års säkerhetsfixar.

source: New Features
sv: Nya funktioner

source: A better interactive interpreter
sv: En bättre interaktiv tolk

source: Python now uses a new :term:`interactive` shell by default, based on code from the `PyPy project`_. When the user starts the :term:`REPL` from an interactive terminal, the following new features are now supported:
sv: Python använder nu ett nytt :term:`interaktivt` skal som standard, baserat på kod från `PyPy-projektet`_. När användaren startar :term:`REPL` från en interaktiv terminal stöds nu följande nya funktioner:

source: Multiline editing with history preservation.
sv: Flerlinjig redigering med historiskt bevarande.

source: Direct support for REPL-specific commands like :kbd:`help`, :kbd:`exit`, and :kbd:`quit`, without the need to call them as functions.
sv: Direkt stöd för REPL-specifika kommandon som :kbd:`help`, :kbd:`exit` och :kbd:`quit`, utan att behöva anropa dem som funktioner.

source: Prompts and tracebacks with :ref:`color enabled by default <using-on-controlling-color>`.
sv: Prompts och tracebacks med :ref:`färg aktiverad som standard <using-on-controlling-color>`.

source: Interactive help browsing using :kbd:`F1` with a separate command history.
sv: Interaktiv hjälpsökning med :kbd:`F1` med en separat kommandohistorik.

source: History browsing using :kbd:`F2` that skips output as well as the :term:`>>>` and :term:`...` prompts.
sv: Historikbläddring med :kbd:`F2` som hoppar över utdata samt uppmaningarna :term:`>>>` och :term:`...`.

source: "Paste mode" with :kbd:`F3` that makes pasting larger blocks of code easier (press :kbd:`F3` again to return to the regular prompt).
sv: "Paste mode" med :kbd:`F3` som gör det enklare att klistra in större kodblock (tryck på :kbd:`F3` igen för att återgå till den vanliga prompten).

source: To disable the new interactive shell, set the :envvar:`PYTHON_BASIC_REPL` environment variable. For more on interactive mode, see :ref:`tut-interac`.
sv: Om du vill inaktivera det nya interaktiva skalet ställer du in miljövariabeln :envvar:`PYTHON_BASIC_REPL`. För mer information om interaktivt läge, se :ref:`tut-interac`.

source: (Contributed by Pablo Galindo Salgado, Łukasz Langa, and Lysandros Nikolaou in :gh:`111201` based on code from the PyPy project. Windows support contributed by Dino Viehland and Anthony Shaw.)
sv: (Bidrag från Pablo Galindo Salgado, Łukasz Langa och Lysandros Nikolaou i :gh:`111201` baserat på kod från PyPy-projektet. Windows-stöd har tillhandahållits av Dino Viehland och Anthony Shaw)

source: Improved error messages
sv: Förbättrade felmeddelanden

source: The interpreter now uses color by default when displaying tracebacks in the terminal. This feature :ref:`can be controlled <using-on-controlling-color>` via the new :envvar:`PYTHON_COLORS` environment variable as well as the canonical |NO_COLOR|_ and |FORCE_COLOR|_ environment variables. (Contributed by Pablo Galindo Salgado in :gh:`112730`.)
sv: Tolken använder nu färg som standard när den visar spårningar i terminalen. Denna funktion :ref:`kan kontrolleras <using-on-controlling-color>` via den nya miljövariabeln :envvar:`PYTHON_COLORS` samt de kanoniska miljövariablerna |NO_COLOR|_ och |FORCE_COLOR|_. (Bidrag från Pablo Galindo Salgado i :gh:`112730`.)

source: A common mistake is to write a script with the same name as a standard library module. When this results in errors, we now display a more helpful error message:
sv: Ett vanligt misstag är att skriva ett skript med samma namn som en modul i standardbiblioteket. När detta leder till fel visar vi nu ett mer användbart felmeddelande:

source: Similarly, if a script has the same name as a third-party module that it attempts to import and this results in errors, we also display a more helpful error message:
sv: På samma sätt visar vi ett mer användbart felmeddelande om ett skript har samma namn som en tredjepartsmodul som det försöker importera och detta leder till fel:

source: (Contributed by Shantanu Jain in :gh:`95754`.)
sv: (Bidrag från Shantanu Jain i :gh:`95754`.)

source: The error message now tries to suggest the correct keyword argument when an incorrect keyword argument is passed to a function.
sv: Felmeddelandet försöker nu föreslå det korrekta nyckelordsargumentet när ett felaktigt nyckelordsargument skickas till en funktion.

source: >>> "Better error messages!".split(max_split=1) Traceback (most recent call last): File "<python-input-0>", line 1, in <module> "Better error messages!".split(max_split=1) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~^^^^^^^^^^^^^ TypeError: split() got an unexpected keyword argument 'max_split'. Did you mean 'maxsplit'?
sv: &gt;&gt;&gt; "Bättre felmeddelanden!".split(max_split=1) Traceback (senaste anropet senast): Fil "<python-input-0>", rad 1, i <module> "Bättre felmeddelanden!".split(max_split=1) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~^^^^^^^^^^^^^ TypeError: split() fick ett oväntat nyckelordsargument 'max_split'. Menade du "maxsplit"?

source: (Contributed by Pablo Galindo Salgado and Shantanu Jain in :gh:`107944`.)
sv: (Bidrag från Pablo Galindo Salgado och Shantanu Jain i :gh:`107944`.)

source: Free-threaded CPython
sv: Fri trådad CPython

source: CPython now has experimental support for running in a free-threaded mode, with the :term:`global interpreter lock` (GIL) disabled. This is an experimental feature and therefore is not enabled by default. The free-threaded mode requires a different executable, usually called ``python3.13t`` or ``python3.13t.exe``. Pre-built binaries marked as *free-threaded* can be installed as part of the official :ref:`Windows <install-freethreaded-windows>` and :ref:`macOS <install-freethreaded-macos>` installers, or CPython can be built from source with the :option:`--disable-gil` option.
sv: CPython har nu experimentellt stöd för att köras i ett fritt trådat läge, med :term:`global interpreter lock` (GIL) inaktiverat. Detta är en experimentell funktion och är därför inte aktiverad som standard. Det fritt trådade läget kräver en annan körbar fil, som vanligtvis kallas ``python3.13t`` eller ``python3.13t.exe``. Förbyggda binärfiler markerade som *free-threaded* kan installeras som en del av de officiella :ref:``Windows <install-freethreaded-windows>`` och :ref:``macOS <install-freethreaded-macos>`` installationsprogrammen, eller så kan CPython byggas från källan med :option:`--disable-gil` alternativet.

source: Free-threaded execution allows for full utilization of the available processing power by running threads in parallel on available CPU cores. While not all software will benefit from this automatically, programs designed with threading in mind will run faster on multi-core hardware. **The free-threaded mode is experimental** and work is ongoing to improve it: expect some bugs and a substantial single-threaded performance hit. Free-threaded builds of CPython support optionally running with the GIL enabled at runtime using the environment variable :envvar:`PYTHON_GIL` or the command-line option :option:`-X gil=1`.
sv: Fri trådning gör det möjligt att utnyttja den tillgängliga processorkraften fullt ut genom att köra trådar parallellt på tillgängliga CPU-kärnor. Även om inte all programvara kan dra nytta av detta automatiskt, kommer program som utformats med trådning i åtanke att köras snabbare på flerkärnig maskinvara. **Det fritt trådade läget är experimentellt** och arbete pågår för att förbättra det: förvänta dig vissa buggar och en betydande prestandaförlust för enstaka trådar. Fri-trådade versioner av CPython stöder valfri körning med GIL aktiverad vid körning med hjälp av miljövariabeln :envvar:`PYTHON_GIL` eller kommandoradsalternativet :option:`-X gil=1`.

source: To check if the current interpreter supports free-threading, :option:`python -VV <-V>` and :data:`sys.version` contain "experimental free-threading build". The new :func:`!sys._is_gil_enabled` function can be used to check whether the GIL is actually disabled in the running process.
sv: För att kontrollera om den aktuella tolken stöder free-threading, innehåller :option:`python -VV <-V>` och :data:`sys.version` "experimental free-threading build". Den nya funktionen :func:`!sys._is_gil_enabled` kan användas för att kontrollera om GIL faktiskt är inaktiverad i den process som körs.
