Repository: yeager/python-docs-sv
Catalog: whatsnew/3.13.po
Languages: sv

source: :mod:`calendar`: ``calendar.January`` and ``calendar.February`` constants are deprecated and replaced by :data:`calendar.JANUARY` and :data:`calendar.FEBRUARY`. (Contributed by Prince Roshan in :gh:`103636`.)
sv: :mod:`calendar`: Konstanterna ``calendar.January`` och ``calendar.February`` är föråldrade och ersätts av :data:`calendar.JANUARY` och :data:`calendar.FEBRUARY`. (Bidrag från Prince Roshan i :gh:`103636`.)

source: :mod:`codecs`: use :func:`open` instead of :func:`codecs.open`. (:gh:`133038`)
sv: :mod:`codecs`: använd :func:`open` istället för :func:`codecs.open`. (:gh:`133038`)

source: :attr:`codeobject.co_lnotab`: use the :meth:`codeobject.co_lines` method instead.
sv: :attr:`codeobject.co_lnotab`: använd istället metoden :meth:`codeobject.co_lines`.

source: :mod:`datetime`:
sv: :mod:`datumtid`:

source: :meth:`~datetime.datetime.utcnow`: use ``datetime.datetime.now(tz=datetime.UTC)``.
sv: :meth:`~datetime.datetime.utcnow`: använd ``datetime.datetime.now(tz=datetime.UTC)``.

source: :meth:`~datetime.datetime.utcfromtimestamp`: use ``datetime.datetime.fromtimestamp(timestamp, tz=datetime.UTC)``.
sv: :meth:`~datetime.datetime.utcfromtimestamp`: använd ``datetime.datetime.fromtimestamp(timestamp, tz=datetime.UTC)``.

source: :mod:`gettext`: Plural value must be an integer.
sv: :mod:`gettext`: Pluralvärdet måste vara ett heltal.

source: :func:`~importlib.util.cache_from_source` *debug_override* parameter is deprecated: use the *optimization* parameter instead.
sv: :func:`~importlib.util.cache_from_source` Parametern *debug_override* är föråldrad: använd parametern *optimization* istället.

source: ``EntryPoints`` tuple interface.
sv: ``EntryPoints`` tuple-gränssnitt.

source: Implicit ``None`` on return values.
sv: Implicit ``None`` på returvärden.

source: :mod:`logging`: the ``warn()`` method has been deprecated since Python 3.3, use :meth:`~logging.warning` instead.
sv: :mod:`logging`: metoden ``warn()`` har utgått sedan Python 3.3, använd :meth:`~logging.warning` istället.

source: :mod:`mailbox`: Use of StringIO input and text mode is deprecated, use BytesIO and binary mode instead.
sv: :mod:`mailbox`: Användning av StringIO-ingång och textläge är föråldrad, använd BytesIO och binärt läge istället.

source: :mod:`os`: Calling :func:`os.register_at_fork` in multi-threaded process.
sv: :mod:`os`: Anropar :func:`os.register_at_fork` i flertrådad process.

source: :class:`!pydoc.ErrorDuringImport`: A tuple value for *exc_info* parameter is deprecated, use an exception instance.
sv: :class:`!pydoc.ErrorDuringImport`: Ett tupelvärde för parametern *exc_info* är föråldrat, använd en undantagsinstans.

source: :mod:`re`: More strict rules are now applied for numerical group references and group names in regular expressions. Only sequence of ASCII digits is now accepted as a numerical reference. The group name in bytes patterns and replacement strings can now only contain ASCII letters and digits and underscore. (Contributed by Serhiy Storchaka in :gh:`91760`.)
sv: :mod:`re`: Strängare regler tillämpas nu för numeriska gruppreferenser och gruppnamn i reguljära uttryck. Endast sekvenser av ASCII-siffror accepteras nu som numeriska referenser. Gruppnamnet i bytesmönster och ersättningssträngar kan nu endast innehålla ASCII-bokstäver och siffror samt understreck. (Bidrag från Serhiy Storchaka i :gh:`91760`.)

source: :mod:`!sre_compile`, :mod:`!sre_constants` and :mod:`!sre_parse` modules.
sv: modulerna :mod:`!sre_compile`, :mod:`!sre_constants` och :mod:`!sre_parse`.

source: :mod:`shutil`: :func:`~shutil.rmtree`'s *onerror* parameter is deprecated in Python 3.12; use the *onexc* parameter instead.
sv: :mod:`shutil`: :func:`~shutil.rmtree`:s parameter *onerror* är föråldrad i Python 3.12; använd istället parametern *onexc*.

source: :mod:`ssl` options and protocols:
sv: :mod:`ssl` alternativ och protokoll:

source: :class:`ssl.SSLContext` without protocol argument is deprecated.
sv: :class:`ssl.SSLContext` utan protokollargument är föråldrad.

source: ``ssl.OP_NO_SSL*`` options
sv: ``ssl.OP_NO_SSL*`` alternativ

source: ``ssl.OP_NO_TLS*`` options
sv: ``ssl.OP_NO_TLS*`` alternativ

source: :mod:`threading` methods:
sv: :mod:`threading` metoder:

source: :meth:`!threading.Event.isSet`: use :meth:`~threading.Event.is_set`.
sv: :meth:`!threading.Event.isSet`: använd :meth:`~threading.Event.is_set`.

source: :meth:`!threading.Thread.isDaemon`, :meth:`threading.Thread.setDaemon`: use :attr:`threading.Thread.daemon` attribute.
sv: :meth:`!threading.Thread.isDaemon`, :meth:`threading.Thread.setDaemon`: använd attributet :attr:`threading.Thread.daemon`.

source: :meth:`!threading.Thread.getName`, :meth:`threading.Thread.setName`: use :attr:`threading.Thread.name` attribute.
sv: :meth:`!threading.Thread.getName`, :meth:`threading.Thread.setName`: använd attributet :attr:`threading.Thread.name`.

source: The internal class ``typing._UnionGenericAlias`` is no longer used to implement :class:`typing.Union`. To preserve compatibility with users using this private class, a compatibility shim will be provided until at least Python 3.17. (Contributed by Jelle Zijlstra in :gh:`105499`.)
sv: Den interna klassen ``typing._UnionGenericAlias`` används inte längre för att implementera :class:`typing.Union`. För att bevara kompatibiliteten med användare som använder denna privata klass, kommer en kompatibilitets-shim att tillhandahållas åtminstone fram till Python 3.17. (Bidrag från Jelle Zijlstra i :gh:`105499`.)

source: :class:`unittest.IsolatedAsyncioTestCase`: it is deprecated to return a value that is not ``None`` from a test case.
sv: :class:`unittest.IsolatedAsyncioTestCase`: det är förkastligt att returnera ett värde som inte är ``None`` från ett testfall.

source: :mod:`urllib.parse` deprecated functions: :func:`~urllib.parse.urlparse` instead
sv: :mod:`urllib.parse` föråldrade funktioner: :func:`~urllib.parse.urlparse` istället

source: ``splitvalue()``
sv: ``splitvärde()``

source: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` should not do partial writes.
sv: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` bör inte göra partiella skrivningar.

source: :mod:`xml.etree.ElementTree`: Testing the truth value of an :class:`~xml.etree.ElementTree.Element` is deprecated. In a future release it will always return ``True``. Prefer explicit ``len(elem)`` or ``elem is not None`` tests instead.
sv: :mod:`xml.etree.ElementTree`: Att testa sanningsvärdet för en :class:`~xml.etree.ElementTree.Element` är föråldrat. I en framtida version kommer det alltid att returnera ``True``. Föredra istället explicita ``len(elem)`` eller ``elem is not None`` tester.

source: :func:`sys._clear_type_cache` is deprecated: use :func:`sys._clear_internal_caches` instead.
sv: :func:`sys._clear_type_cache` är föråldrad: använd :func:`sys._clear_internal_caches` istället.

source: CPython Bytecode Changes
sv: CPython Bytecode-ändringar

source: The oparg of :opcode:`YIELD_VALUE` is now ``1`` if the yield is part of a yield-from or await, and ``0`` otherwise. The oparg of :opcode:`RESUME` was changed to add a bit indicating if the except-depth is 1, which is needed to optimize closing of generators. (Contributed by Irit Katriel in :gh:`111354`.)
sv: Oparg för :opcode:`YIELD_VALUE` är nu ``1`` om yield är en del av en yield-from eller await, och ``0`` annars. Oparg för :opcode:`RESUME` ändrades för att lägga till en bit som anger om except-depth är 1, vilket behövs för att optimera stängning av generatorer. (Bidrag från Irit Katriel i :gh:`111354`.)

source: C API Changes
sv: Ändringar i C API

source: Add the :ref:`PyMonitoring C API <c-api-monitoring>` for generating :pep:`669` monitoring events:
sv: Lägg till :ref:`PyMonitoring C API <c-api-monitoring>` för att generera :pep:`669` övervakningshändelser:

source: (Contributed by Irit Katriel in :gh:`111997`).
sv: (Bidrag från Irit Katriel i :gh:`111997`).

source: Add :c:type:`PyMutex`, a lightweight mutex that occupies a single byte, and the new :c:func:`PyMutex_Lock` and :c:func:`PyMutex_Unlock` functions. :c:func:`!PyMutex_Lock` will release the :term:`GIL` (if currently held) if the operation needs to block. (Contributed by Sam Gross in :gh:`108724`.)
sv: Lägg till :c:type:`PyMutex`, en lättviktig mutex som tar upp en enda byte, och de nya funktionerna :c:func:`PyMutex_Lock` och :c:func:`PyMutex_Unlock`. :c:func:`!PyMutex_Lock` kommer att släppa :term:`GIL` (om den för närvarande hålls) om operationen behöver blockeras. (Bidrag från Sam Gross i :gh:`108724`.)

source: Add the :ref:`PyTime C API <c-api-time>` to provide access to system clocks:
sv: Lägg till :ref:`PyTime C API <c-api-time>` för att ge åtkomst till systemklockor:

source: :c:var:`PyTime_MIN` and :c:var:`PyTime_MAX`.
sv: :c:var:`PyTime_MIN` och :c:var:`PyTime_MAX`.

source: (Contributed by Victor Stinner and Petr Viktorin in :gh:`110850`.)
sv: (Bidrag från Victor Stinner och Petr Viktorin i :gh:`110850`.)

source: Add the :c:func:`PyDict_ContainsString` function with the same behavior as :c:func:`PyDict_Contains`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`. (Contributed by Victor Stinner in :gh:`108314`.)
sv: Lägg till funktionen :c:func:`PyDict_ContainsString` med samma beteende som :c:func:`PyDict_Contains`, men *key* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, snarare än ett :c:expr:`PyObject*`. (Bidrag från Victor Stinner i :gh:`108314`.)

source: Add the :c:func:`PyDict_GetItemRef` and :c:func:`PyDict_GetItemStringRef` functions, which behave similarly to :c:func:`PyDict_GetItemWithError`, but return a :term:`strong reference` instead of a :term:`borrowed reference`. Moreover, these functions return ``-1`` on error, removing the need to check :c:func:`!PyErr_Occurred`. (Contributed by Victor Stinner in :gh:`106004`.)
sv: Lägg till funktionerna :c:func:`PyDict_GetItemRef` och :c:func:`PyDict_GetItemStringRef`, som beter sig på liknande sätt som :c:func:`PyDict_GetItemWithError`, men returnerar en :term:`strong reference` istället för en :term:`borrowed reference`. Dessutom returnerar dessa funktioner ``-1`` vid fel, vilket tar bort behovet av att kontrollera :c:func:`!PyErr_Occurred`. (Bidrag från Victor Stinner i :gh:`106004`.)

source: Add the :c:func:`PyDict_SetDefaultRef` function, which behaves similarly to :c:func:`PyDict_SetDefault`, but returns a :term:`strong reference` instead of a :term:`borrowed reference`. This function returns ``-1`` on error, ``0`` on insertion, and ``1`` if the key was already present in the dictionary. (Contributed by Sam Gross in :gh:`112066`.)
sv: Lägg till funktionen :c:func:`PyDict_SetDefaultRef`, som beter sig på samma sätt som :c:func:`PyDict_SetDefault`, men returnerar en :term:`strong reference` istället för en :term:`borrowed reference`. Denna funktion returnerar ``-1`` vid fel, ``0`` vid infogning och ``1`` om nyckeln redan fanns i ordlistan. (Bidrag från Sam Gross i :gh:`112066`.)

source: Add the :c:func:`PyDict_Pop` and :c:func:`PyDict_PopString` functions to remove a key from a dictionary and optionally return the removed value. This is similar to :meth:`dict.pop`, though there is no default value, and :exc:`KeyError` is not raised for missing keys. (Contributed by Stefan Behnel and Victor Stinner in :gh:`111262`.)
sv: Lägg till funktionerna :c:func:`PyDict_Pop` och :c:func:`PyDict_PopString` för att ta bort en nyckel från en ordbok och eventuellt returnera det borttagna värdet. Detta liknar :meth:`dict.pop`, även om det inte finns något standardvärde och :exc:`KeyError` inte tas upp för saknade nycklar. (Bidrag från Stefan Behnel och Victor Stinner i :gh:`111262`.)

source: Add the :c:func:`PyMapping_GetOptionalItem` and :c:func:`PyMapping_GetOptionalItemString` functions as alternatives to :c:func:`PyObject_GetItem` and :c:func:`PyMapping_GetItemString` respectively. The new functions do not raise :exc:`KeyError` if the requested key is missing from the mapping. These variants are more convenient and faster if a missing key should not be treated as a failure. (Contributed by Serhiy Storchaka in :gh:`106307`.)
sv: Lägg till funktionerna :c:func:`PyMapping_GetOptionalItem` och :c:func:`PyMapping_GetOptionalItemString` som alternativ till :c:func:`PyObject_GetItem` respektive :c:func:`PyMapping_GetItemString`. De nya funktionerna ger inte upphov till :exc:`KeyError` om den begärda nyckeln saknas i mappningen. Dessa varianter är mer praktiska och snabbare om en saknad nyckel inte ska behandlas som ett fel. (Bidrag från Serhiy Storchaka i :gh:`106307`.)

source: Add the :c:func:`PyObject_GetOptionalAttr` and :c:func:`PyObject_GetOptionalAttrString` functions as alternatives to :c:func:`PyObject_GetAttr` and :c:func:`PyObject_GetAttrString` respectively. The new functions do not raise :exc:`AttributeError` if the requested attribute is not found on the object. These variants are more convenient and faster if the missing attribute should not be treated as a failure. (Contributed by Serhiy Storchaka in :gh:`106521`.)
sv: Lägg till funktionerna :c:func:`PyObject_GetOptionalAttr` och :c:func:`PyObject_GetOptionalAttrString` som alternativ till :c:func:`PyObject_GetAttr` respektive :c:func:`PyObject_GetAttrString`. De nya funktionerna ger inte upphov till :exc:`AttributeError` om det begärda attributet inte finns på objektet. Dessa varianter är mer praktiska och snabbare om det saknade attributet inte ska behandlas som ett fel. (Bidrag från Serhiy Storchaka i :gh:`106521`.)

source: Add the :c:func:`PyErr_FormatUnraisable` function as an extension to :c:func:`PyErr_WriteUnraisable` that allows customizing the warning message. (Contributed by Serhiy Storchaka in :gh:`108082`.)
sv: Lägg till funktionen :c:func:`PyErr_FormatUnraisable` som ett tillägg till :c:func:`PyErr_WriteUnraisable` som gör det möjligt att anpassa varningsmeddelandet. (Bidrag från Serhiy Storchaka i :gh:`108082`.)

source: Add new functions that return a :term:`strong reference` instead of a :term:`borrowed reference` for frame locals, globals, and builtins, as part of :ref:`PEP 667 <whatsnew313-locals-semantics>`:
sv: Lägg till nya funktioner som returnerar en :term:`strong reference` istället för en :term:`borrowed reference` för frame locals, globals och builtins, som en del av :ref:`PEP 667 <whatsnew313-locals-semantics>`:

source: :c:func:`PyEval_GetFrameBuiltins` replaces :c:func:`PyEval_GetBuiltins`
sv: :c:func:`PyEval_GetFrameBuiltins` ersätter :c:func:`PyEval_GetBuiltins`

source: :c:func:`PyEval_GetFrameGlobals` replaces :c:func:`PyEval_GetGlobals`
sv: :c:func:`PyEval_GetFrameGlobals` ersätter :c:func:`PyEval_GetGlobals`

source: :c:func:`PyEval_GetFrameLocals` replaces :c:func:`PyEval_GetLocals`
sv: :c:func:`PyEval_GetFrameLocals` ersätter :c:func:`PyEval_GetLocals`

source: (Contributed by Mark Shannon and Tian Gao in :gh:`74929`.)
sv: (Bidrag från Mark Shannon och Tian Gao i :gh:`74929`.)

source: Add the :c:func:`Py_GetConstant` and :c:func:`Py_GetConstantBorrowed` functions to get :term:`strong <strong reference>` or :term:`borrowed <borrowed reference>` references to constants. For example, ``Py_GetConstant(Py_CONSTANT_ZERO)`` returns a strong reference to the constant zero. (Contributed by Victor Stinner in :gh:`115754`.)
sv: Lägg till funktionerna :c:func:`Py_GetConstant` och :c:func:`Py_GetConstantBorrowed` för att få :term:`strong <strong reference>` eller :term:`borrowed <borrowed reference>` referenser till konstanter. Till exempel, ``Py_GetConstant(Py_CONSTANT_ZERO)`` returnerar en stark referens till konstanten noll. (Bidrag från Victor Stinner i :gh:`115754`.)

source: Add the :c:func:`PyImport_AddModuleRef` function as a replacement for :c:func:`PyImport_AddModule` that returns a :term:`strong reference` instead of a :term:`borrowed reference`. (Contributed by Victor Stinner in :gh:`105922`.)
sv: Lägg till funktionen :c:func:`PyImport_AddModuleRef` som ersättning för :c:func:`PyImport_AddModule` som returnerar en :term:`strong reference` istället för en :term:`borrowed reference`. (Bidrag från Victor Stinner i :gh:`105922`.)

source: Add the :c:func:`Py_IsFinalizing` function to check whether the main Python interpreter is :term:`shutting down <interpreter shutdown>`. (Contributed by Victor Stinner in :gh:`108014`.)
sv: Lägg till funktionen :c:func:`Py_IsFinalizing` för att kontrollera om huvudtolken för Python :term:`stänger ner <interpreter shutdown>`. (Bidrag från Victor Stinner i :gh:`108014`.)

source: Add the :c:func:`PyList_GetItemRef` function as a replacement for :c:func:`PyList_GetItem` that returns a :term:`strong reference` instead of a :term:`borrowed reference`. (Contributed by Sam Gross in :gh:`114329`.)
sv: Lägg till funktionen :c:func:`PyList_GetItemRef` som ersättning för :c:func:`PyList_GetItem` som returnerar en :term:`strong reference` istället för en :term:`borrowed reference`. (Bidrag från Sam Gross i :gh:`114329`.)

source: Add the :c:func:`PyList_Extend` and :c:func:`PyList_Clear` functions, mirroring the Python :meth:`!list.extend` and :meth:`!list.clear` methods. (Contributed by Victor Stinner in :gh:`111138`.)
sv: Lägg till funktionerna :c:func:`PyList_Extend` och :c:func:`PyList_Clear`, som speglar Pythons metoder :meth:`!list.extend` och :meth:`!list.clear`. (Bidrag från Victor Stinner i :gh:`111138`.)

source: Add the :c:func:`PyLong_AsInt` function. It behaves similarly to :c:func:`PyLong_AsLong`, but stores the result in a C :c:expr:`int` instead of a C :c:expr:`long`. (Contributed by Victor Stinner in :gh:`108014`.)
sv: Lägg till funktionen :c:func:`PyLong_AsInt`. Den beter sig på liknande sätt som :c:func:`PyLong_AsLong`, men lagrar resultatet i en C :c:expr:`int` istället för en C :c:expr:`long`. (Bidrag från Victor Stinner i :gh:`108014`.)

source: Add the :c:func:`PyLong_AsNativeBytes`, :c:func:`PyLong_FromNativeBytes`, and :c:func:`PyLong_FromUnsignedNativeBytes` functions to simplify converting between native integer types and Python :class:`int` objects. (Contributed by Steve Dower in :gh:`111140`.)
sv: Lägg till funktionerna :c:func:`PyLong_AsNativeBytes`, :c:func:`PyLong_FromNativeBytes` och :c:func:`PyLong_FromUnsignedNativeBytes` för att förenkla konvertering mellan inbyggda heltalstyper och Python :class:`int`-objekt. (Bidrag från Steve Dower i :gh:`111140`.)

source: Add :c:func:`PyModule_Add` function, which is similar to :c:func:`PyModule_AddObjectRef` and :c:func:`PyModule_AddObject`, but always steals a reference to the value. (Contributed by Serhiy Storchaka in :gh:`86493`.)
sv: Lägg till funktionen :c:func:`PyModule_Add`, som liknar :c:func:`PyModule_AddObjectRef` och :c:func:`PyModule_AddObject`, men som alltid stjäl en referens till värdet. (Bidrag från Serhiy Storchaka i :gh:`86493`.)

source: Add the :c:func:`PyObject_GenericHash` function that implements the default hashing function of a Python object. (Contributed by Serhiy Storchaka in :gh:`113024`.)
sv: Lägg till funktionen :c:func:`PyObject_GenericHash` som implementerar standardhashfunktionen för ett Python-objekt. (Bidrag från Serhiy Storchaka i :gh:`113024`.)

source: Add the :c:func:`Py_HashPointer` function to hash a raw pointer. (Contributed by Victor Stinner in :gh:`111545`.)
sv: Lägg till funktionen :c:func:`Py_HashPointer` för att hasha en rå pekare. (Bidrag från Victor Stinner i :gh:`111545`.)

source: Add the :c:func:`PyObject_VisitManagedDict` and :c:func:`PyObject_ClearManagedDict` functions. which must be called by the traverse and clear functions of a type using the :c:macro:`Py_TPFLAGS_MANAGED_DICT` flag. The `pythoncapi-compat project`_ can be used to use these functions with Python 3.11 and 3.12. (Contributed by Victor Stinner in :gh:`107073`.)
sv: Lägg till funktionerna :c:func:`PyObject_VisitManagedDict` och :c:func:`PyObject_ClearManagedDict`. som måste anropas av funktionerna traverse och clear för en typ som använder flaggan :c:macro:`Py_TPFLAGS_MANAGED_DICT`. Projektet `pythoncapi-compat`_ kan användas för att använda dessa funktioner med Python 3.11 och 3.12. (Bidrag från Victor Stinner i :gh:`107073`.)

source: Add the :c:func:`PyRefTracer_SetTracer` and :c:func:`PyRefTracer_GetTracer` functions, which enable tracking object creation and destruction in the same way that the :mod:`tracemalloc` module does. (Contributed by Pablo Galindo in :gh:`93502`.)
sv: Lägg till funktionerna :c:func:`PyRefTracer_SetTracer` och :c:func:`PyRefTracer_GetTracer`, som gör det möjligt att spåra skapande och förstörelse av objekt på samma sätt som modulen :mod:`tracemalloc` gör. (Bidrag från Pablo Galindo i :gh:`93502`.)

source: Add the :c:func:`PySys_AuditTuple` function as an alternative to :c:func:`PySys_Audit` that takes event arguments as a Python :class:`tuple` object. (Contributed by Victor Stinner in :gh:`85283`.)
sv: Lägg till funktionen :c:func:`PySys_AuditTuple` som ett alternativ till :c:func:`PySys_Audit` som tar händelseargument som ett Python :class:`tuple`-objekt. (Bidrag från Victor Stinner i :gh:`85283`.)

source: Add the :c:func:`PyThreadState_GetUnchecked()` function as an alternative to :c:func:`PyThreadState_Get()` that doesn't kill the process with a fatal error if it is ``NULL``. The caller is responsible for checking if the result is ``NULL``. (Contributed by Victor Stinner in :gh:`108867`.)
sv: Lägg till funktionen :c:func:`PyThreadState_GetUnchecked()` som ett alternativ till :c:func:`PyThreadState_Get()` som inte dödar processen med ett fatalt fel om den är ``NULL``. Den som anropar är ansvarig för att kontrollera om resultatet är ``NULL``. (Bidrag från Victor Stinner i :gh:`108867`.)

source: Add the :c:func:`PyType_GetFullyQualifiedName` function to get the type's fully qualified name. The module name is prepended if :attr:`type.__module__` is a string and is not equal to either ``'builtins'`` or ``'__main__'``. (Contributed by Victor Stinner in :gh:`111696`.)
sv: Lägg till funktionen :c:func:`PyType_GetFullyQualifiedName` för att hämta typens fullständigt kvalificerade namn. Modulnamnet läggs till om :attr:`type.__module__` är en sträng och inte är lika med antingen ``'builtins'`` eller ``'__main__'``. (Bidrag från Victor Stinner i :gh:`111696`.)

source: Add the :c:func:`PyType_GetModuleName` function to get the type's module name. This is equivalent to getting the :attr:`type.__module__` attribute. (Contributed by Eric Snow and Victor Stinner in :gh:`111696`.)
sv: Lägg till funktionen :c:func:`PyType_GetModuleName` för att hämta typens modulnamn. Detta motsvarar att hämta attributet :attr:`type.__module__`. (Bidrag från Eric Snow och Victor Stinner i :gh:`111696`.)

source: Add the :c:func:`PyUnicode_EqualToUTF8AndSize` and :c:func:`PyUnicode_EqualToUTF8` functions to compare a Unicode object with a :c:expr:`const char*` UTF-8 encoded string and ``1`` if they are equal or ``0`` otherwise. These functions do not raise exceptions. (Contributed by Serhiy Storchaka in :gh:`110289`.)
sv: Lägg till funktionerna :c:func:`PyUnicode_EqualToUTF8AndSize` och :c:func:`PyUnicode_EqualToUTF8` för att jämföra ett Unicode-objekt med en :c:expr:`const char*` UTF-8-kodad sträng och ``1`` om de är lika eller ``0`` annars. Dessa funktioner ger inte upphov till undantag. (Bidrag från Serhiy Storchaka i :gh:`110289`.)

source: Add the :c:func:`PyWeakref_GetRef` function as an alternative to :c:func:`PyWeakref_GetObject` that returns a :term:`strong reference` or ``NULL`` if the referent is no longer live. (Contributed by Victor Stinner in :gh:`105927`.)
sv: Lägg till funktionen :c:func:`PyWeakref_GetRef` som ett alternativ till :c:func:`PyWeakref_GetObject` som returnerar en :term:`strong reference` eller ``NULL`` om referenten inte längre är live. (Bidrag från Victor Stinner i :gh:`105927`.)
