Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: The unmaintained :file:`Demo` directory has been removed. Some demos were integrated into the documentation, some were moved to the :file:`Tools/demo` directory, and others were removed altogether.
sv: Den ounderhållna :file:`Demo`-katalogen har tagits bort. Vissa demos integrerades i dokumentationen, andra flyttades till katalogen :file:`Tools/demo` och andra togs bort helt och hållet.

source: (Contributed by Georg Brandl in :issue:`7962`.)
sv: (Bidrag från Georg Brandl i :issue:`7962`.)

source: The format menu now has an option to clean source files by stripping trailing whitespace.
sv: Formatmenyn har nu ett alternativ för att rensa källfiler genom att ta bort efterföljande blanksteg.

source: (Contributed by Raymond Hettinger; :issue:`5150`.)
sv: (Bidrag från Raymond Hettinger; :issue:`5150`.)

source: IDLE on Mac OS X now works with both Carbon AquaTk and Cocoa AquaTk.
sv: IDLE på Mac OS X fungerar nu med både Carbon AquaTk och Cocoa AquaTk.

source: (Contributed by Kevin Walzer, Ned Deily, and Ronald Oussoren; :issue:`6075`.)
sv: (Bidrag från Kevin Walzer, Ned Deily och Ronald Oussoren; :issue:`6075`.)

source: Code Repository
sv: Kodförvar

source: In addition to the existing Subversion code repository at https://svn.python.org there is now a `Mercurial <https://www.mercurial-scm.org/>`_ repository at https://hg.python.org/\ .
sv: Förutom det befintliga Subversion-kodarkivet på https://svn.python.org finns det nu ett `Mercurial <https://www.mercurial-scm.org/>`_-arkiv på https://hg.python.org/\ .

source: After the 3.2 release, there are plans to switch to Mercurial as the primary repository. This distributed version control system should make it easier for members of the community to create and share external changesets. See :pep:`385` for details.
sv: Efter lanseringen av 3.2 finns det planer på att byta till Mercurial som primärt arkiv. Detta distribuerade versionskontrollsystem bör göra det enklare för medlemmar i communityn att skapa och dela externa ändringsuppsättningar. Se :pep:`385` för mer information.

source: To learn to use the new version control system, see the `Quick Start <https://www.mercurial-scm.org/wiki/QuickStart>`_ or the `Guide to Mercurial Workflows <https://www.mercurial-scm.org/guide>`_.
sv: Om du vill lära dig att använda det nya versionshanteringssystemet kan du läsa "Snabb start" <https://www.mercurial-scm.org/wiki/QuickStart>`_ eller "Guide till Mercurial-arbetsflöden" <https://www.mercurial-scm.org/guide>`_.

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Changes to Python's build process and to the C API include:
sv: Ändringar i Pythons byggprocess och i C API inkluderar:

source: The *idle*, *pydoc* and *2to3* scripts are now installed with a version-specific suffix on ``make altinstall`` (:issue:`10679`).
sv: Skripten *idle*, *pydoc* och *2to3* installeras nu med ett versionsspecifikt suffix på ``make altinstall`` (:issue:`10679``).

source: The C functions that access the Unicode Database now accept and return characters from the full Unicode range, even on narrow unicode builds (Py_UNICODE_TOLOWER, Py_UNICODE_ISDECIMAL, and others). A visible difference in Python is that :func:`unicodedata.numeric` now returns the correct value for large code points, and :func:`repr` may consider more characters as printable.
sv: C-funktionerna som använder Unicode-databasen accepterar och returnerar nu tecken från hela Unicode-intervallet, även på smala Unicode-byggnader (Py_UNICODE_TOLOWER, Py_UNICODE_ISDECIMAL och andra). En synlig skillnad i Python är att :func:`unicodedata.numeric` nu returnerar rätt värde för stora kodpunkter, och :func:`repr` kan betrakta fler tecken som skrivbara.

source: (Reported by Bupjoe Lee and fixed by Amaury Forgeot D'Arc; :issue:`5127`.)
sv: (Rapporterades av Bupjoe Lee och åtgärdades av Amaury Forgeot D'Arc; :issue:`5127`.)

source: Computed gotos are now enabled by default on supported compilers (which are detected by the configure script). They can still be disabled selectively by specifying ``--without-computed-gotos``.
sv: Beräknade gotos är nu aktiverade som standard på kompilatorer som stöds (vilket upptäcks av configure-skriptet). De kan fortfarande inaktiveras selektivt genom att ange ``--without-computed-gotos``.

source: (Contributed by Antoine Pitrou; :issue:`9203`.)
sv: (Bidrag från Antoine Pitrou; :issue:`9203`.)

source: The option ``--with-wctype-functions`` was removed. The built-in unicode database is now used for all functions.
sv: Alternativet ``--with-wctype-functions`` togs bort. Den inbyggda unicode-databasen används nu för alla funktioner.

source: (Contributed by Amaury Forgeot D'Arc; :issue:`9210`.)
sv: (Bidrag från Amaury Forgeot D'Arc; :issue:`9210`.)

source: Hash values are now values of a new type, :c:type:`Py_hash_t`, which is defined to be the same size as a pointer. Previously they were of type long, which on some 64-bit operating systems is still only 32 bits long. As a result of this fix, :class:`set` and :class:`dict` can now hold more than ``2**32`` entries on builds with 64-bit pointers (previously, they could grow to that size but their performance degraded catastrophically).
sv: Hash-värden är nu värden av en ny typ, :c:type:`Py_hash_t`, som är definierad att vara lika stor som en pekare. Tidigare var de av typen long, som på vissa 64-bitars operativsystem fortfarande bara är 32 bitar långa. Som ett resultat av den här korrigeringen kan :class:`set` och :class:`dict` nu innehålla mer än ``2**32`` poster på byggen med 64-bitars pekare (tidigare kunde de växa till den storleken men deras prestanda försämrades katastrofalt).

source: (Suggested by Raymond Hettinger and implemented by Benjamin Peterson; :issue:`9778`.)
sv: (Föreslagen av Raymond Hettinger och implementerad av Benjamin Peterson; :issue:`9778`.)

source: A new macro :c:macro:`!Py_VA_COPY` copies the state of the variable argument list. It is equivalent to C99 *va_copy* but available on all Python platforms (:issue:`2443`).
sv: Ett nytt makro :c:macro:`!Py_VA_COPY` kopierar tillståndet för variabelns argumentlista. Det motsvarar C99 *va_copy* men är tillgängligt på alla Python-plattformar (:issue:`2443`).

source: A new C API function :c:func:`!PySys_SetArgvEx` allows an embedded interpreter to set :data:`sys.argv` without also modifying :data:`sys.path` (:issue:`5753`).
sv: En ny C API-funktion :c:func:`!PySys_SetArgvEx` tillåter en inbäddad tolk att ställa in :data:`sys.argv` utan att också ändra :data:`sys.path` (:issue:`5753`).

source: :c:func:`!PyEval_CallObject` is now only available in macro form. The function declaration, which was kept for backwards compatibility reasons, is now removed -- the macro was introduced in 1997 (:issue:`8276`).
sv: :c:func:`!PyEval_CallObject` är nu endast tillgänglig i makroform. Funktionsdeklarationen, som behölls av bakåtkompatibilitetsskäl, är nu borttagen -- makrot introducerades 1997 (:issue:`8276`).

source: There is a new function :c:func:`PyLong_AsLongLongAndOverflow` which is analogous to :c:func:`PyLong_AsLongAndOverflow`. They both serve to convert Python :class:`int` into a native fixed-width type while providing detection of cases where the conversion won't fit (:issue:`7767`).
sv: Det finns en ny funktion :c:func:`PyLong_AsLongLongAndOverflow` som är analog med :c:func:`PyLong_AsLongAndOverflow`. De tjänar båda till att konvertera Python :class:`int` till en inbyggd typ med fast bredd samtidigt som de ger möjlighet att upptäcka fall där konverteringen inte passar (:issue:`7767`).

source: The :c:func:`PyUnicode_CompareWithASCIIString` function now returns *not equal* if the Python string is *NUL* terminated.
sv: Funktionen :c:func:`PyUnicode_CompareWithASCIIString` returnerar nu *not equal* om Python-strängen är *NUL*-terminerad.

source: There is a new function :c:func:`PyErr_NewExceptionWithDoc` that is like :c:func:`PyErr_NewException` but allows a docstring to be specified. This lets C exceptions have the same self-documenting capabilities as their pure Python counterparts (:issue:`7033`).
sv: Det finns en ny funktion :c:func:`PyErr_NewExceptionWithDoc` som är som :c:func:`PyErr_NewException` men tillåter att en docstring anges. Detta gör att C-undantag har samma självdokumenterande funktioner som deras rena Python-motsvarigheter (:issue:`7033`).

source: When compiled with the ``--with-valgrind`` option, the pymalloc allocator will be automatically disabled when running under Valgrind. This gives improved memory leak detection when running under Valgrind, while taking advantage of pymalloc at other times (:issue:`2422`).
sv: Vid kompilering med alternativet ``--with-valgrind`` kommer allokeringsverktyget pymalloc automatiskt att inaktiveras vid körning under Valgrind. Detta ger förbättrad detektering av minnesläckor när man kör under Valgrind, samtidigt som man kan dra nytta av pymalloc vid andra tillfällen (:issue:`2422`).

source: Removed the ``O?`` format from the *PyArg_Parse* functions. The format is no longer used and it had never been documented (:issue:`8837`).
sv: Tog bort ``O?``-formatet från *PyArg_Parse*-funktionerna. Formatet används inte längre och det har aldrig dokumenterats (:issue:`8837`).

source: There were a number of other small changes to the C-API. See the `Misc/NEWS <https://github.com/python/cpython/blob/v3.2.6/Misc/NEWS>`__ file for a complete list.
sv: Det gjordes ett antal andra små ändringar i C-API. Se filen `Misc/NEWS <https://github.com/python/cpython/blob/v3.2.6/Misc/NEWS>`__ för en fullständig lista.

source: Also, there were a number of updates to the Mac OS X build, see `Mac/BuildScript/README.txt <https://github.com/python/cpython/blob/v3.2.6/Mac/BuildScript/README.txt>`_ for details. For users running a 32/64-bit build, there is a known problem with the default Tcl/Tk on Mac OS X 10.6. Accordingly, we recommend installing an updated alternative such as `ActiveState Tcl/Tk 8.5.9 <https://web.archive.org/web/20101208191259/https://www.activestate.com/activetcl/downloads>`_\. See https://www.python.org/download/mac/tcltk/ for additional details.
sv: Det har också gjorts ett antal uppdateringar av Mac OS X-versionen, se `Mac/BuildScript/README.txt <https://github.com/python/cpython/blob/v3.2.6/Mac/BuildScript/README.txt>`_ för detaljer. För användare som kör en 32/64-bitars version finns det ett känt problem med standard Tcl/Tk på Mac OS X 10.6. Följaktligen rekommenderar vi att du installerar ett uppdaterat alternativ som `ActiveState Tcl/Tk 8.5.9 <https://web.archive.org/web/20101208191259/https://www.activestate.com/activetcl/downloads>`_\. Se https://www.python.org/download/mac/tcltk/ för ytterligare information.

source: Porting to Python 3.2
sv: Portning till Python 3.2

source: This section lists previously described changes and other bugfixes that may require changes to your code:
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod:

source: The :mod:`configparser` module has a number of clean-ups. The major change is to replace the old :class:`!ConfigParser` class with long-standing preferred alternative :class:`!SafeConfigParser`. In addition there are a number of smaller incompatibilities:
sv: Modulen :mod:`configparser` har ett antal upprensningar. Den största förändringen är att ersätta den gamla :class:`!ConfigParser`-klassen med det sedan länge föredragna alternativet :class:`!SafeConfigParser`. Dessutom finns det ett antal mindre inkompatibiliteter:

source: The interpolation syntax is now validated on :meth:`~configparser.ConfigParser.get` and :meth:`~configparser.ConfigParser.set` operations. In the default interpolation scheme, only two tokens with percent signs are valid: ``%(name)s`` and ``%%``, the latter being an escaped percent sign.
sv: Syntaxen för interpolering valideras nu för operationerna :meth:`~configparser.ConfigParser.get` och :meth:`~configparser.ConfigParser.set`. I standardinterpolationsschemat är endast två tokens med procenttecken giltiga: ``%(name)s`` och ``%%``, där det senare är ett undangömt procenttecken.

source: The :meth:`~configparser.ConfigParser.set` and :meth:`~configparser.ConfigParser.add_section` methods now verify that values are actual strings. Formerly, unsupported types could be introduced unintentionally.
sv: Metoderna :meth:`~configparser.ConfigParser.set` och :meth:`~configparser.ConfigParser.add_section` kontrollerar nu att värdena är faktiska strängar. Tidigare kunde typer som inte stöddes införas oavsiktligt.

source: Duplicate sections or options from a single source now raise either :exc:`~configparser.DuplicateSectionError` or :exc:`~configparser.DuplicateOptionError`. Formerly, duplicates would silently overwrite a previous entry.
sv: Duplicerade avsnitt eller alternativ från en enda källa ger nu upphov till antingen :exc:`~configparser.DuplicateSectionError` eller :exc:`~configparser.DuplicateOptionError`. Tidigare skulle dubbletter tyst skriva över en tidigare post.

source: Inline comments are now disabled by default so now the **;** character can be safely used in values.
sv: Inline-kommentarer är nu inaktiverade som standard, så nu kan tecknet **;** användas på ett säkert sätt i värden.

source: Comments now can be indented. Consequently, for **;** or **#** to appear at the start of a line in multiline values, it has to be interpolated. This keeps comment prefix characters in values from being mistaken as comments.
sv: Kommentarer kan nu vara indragna. För att **;** eller **#** ska visas i början av en rad i värden med flera rader måste de därför interpoleras. Detta förhindrar att prefixtecken för kommentarer i värden misstas för kommentarer.

source: ``""`` is now a valid value and is no longer automatically converted to an empty string. For empty strings, use ``"option ="`` in a line.
sv: ``""`` är nu ett giltigt värde och konverteras inte längre automatiskt till en tom sträng. För tomma strängar, använd ``"option ="`` i en rad.

source: The :mod:`!nntplib` module was reworked extensively, meaning that its APIs are often incompatible with the 3.1 APIs.
sv: Modulen :mod:`!nntplib` har genomgått en omfattande omarbetning, vilket innebär att dess API:er ofta är inkompatibla med 3.1 API:erna.

source: :class:`bytearray` objects can no longer be used as filenames; instead, they should be converted to :class:`bytes`.
sv: :class:`bytearray`-objekt kan inte längre användas som filnamn; istället bör de konverteras till :class:`bytes`.

source: The :meth:`!array.tostring` and :meth:`!array.fromstring` have been renamed to :meth:`array.tobytes() <array.array.tobytes>` and :meth:`array.frombytes() <array.array.frombytes>` for clarity. The old names have been deprecated. (See :issue:`8990`.)
sv: :meth:`!array.tostring` och :meth:`!array.fromstring` har bytt namn till :meth:`array.tobytes() <array.array.tobytes>` och :meth:`array.frombytes() <array.array.frombytes>` för tydlighetens skull. De gamla namnen har utgått. (Se :issue:`8990`.)

source: ``PyArg_Parse*()`` functions:
sv: ``PyArg_Parse*()`` funktioner:

source: "t#" format has been removed: use "s#" or "s*" instead
sv: formatet "t#" har tagits bort: använd "s#" eller "s*" istället

source: "w" and "w#" formats has been removed: use "w*" instead
sv: formaten "w" och "w#" har tagits bort: använd "w*" istället

source: The :c:type:`!PyCObject` type, deprecated in 3.1, has been removed. To wrap opaque C pointers in Python objects, the :c:type:`PyCapsule` API should be used instead; the new type has a well-defined interface for passing typing safety information and a less complicated signature for calling a destructor.
sv: Typen :c:type:`!PyCObject`, som var föråldrad i 3.1, har tagits bort. För att paketera opaka C-pekare i Python-objekt bör :c:type:`PyCapsule` API användas istället; den nya typen har ett väldefinierat gränssnitt för att skicka information om typningssäkerhet och en mindre komplicerad signatur för att anropa en destruktor.

source: The :func:`!sys.setfilesystemencoding` function was removed because it had a flawed design.
sv: Funktionen :func:`!sys.setfilesystemencoding` togs bort eftersom den hade en felaktig design.

source: The :func:`random.seed` function and method now salt string seeds with an sha512 hash function. To access the previous version of *seed* in order to reproduce Python 3.1 sequences, set the *version* argument to *1*, ``random.seed(s, version=1)``.
sv: Funktionen och metoden :func:`random.seed` saltar nu strängfrön med en sha512-hashfunktion. För att komma åt den tidigare versionen av *seed* för att reproducera Python 3.1-sekvenser, sätt *version*-argumentet till *1*, ``random.seed(s, version=1)``.

source: The previously deprecated :func:`!string.maketrans` function has been removed in favor of the static methods :meth:`bytes.maketrans` and :meth:`bytearray.maketrans`. This change solves the confusion around which types were supported by the :mod:`string` module. Now, :class:`str`, :class:`bytes`, and :class:`bytearray` each have their own **maketrans** and **translate** methods with intermediate translation tables of the appropriate type.
sv: Den tidigare föråldrade funktionen :func:`!string.maketrans` har tagits bort till förmån för de statiska metoderna :meth:`bytes.maketrans` och :meth:`bytearray.maketrans`. Denna ändring löser förvirringen kring vilka typer som stöds av modulen :mod:`string`. Nu har :class:`str`, :class:`bytes` och :class:`bytearray` var och en sina egna **maketrans**- och **translate**-metoder med mellanliggande översättningstabeller av lämplig typ.

source: (Contributed by Georg Brandl; :issue:`5675`.)
sv: (Bidrag från Georg Brandl; :issue:`5675`.)

source: The previously deprecated :func:`!contextlib.nested` function has been removed in favor of a plain :keyword:`with` statement which can accept multiple context managers. The latter technique is faster (because it is built-in), and it does a better job finalizing multiple context managers when one of them raises an exception::
sv: Den tidigare föråldrade :func:`!contextlib.nested`-funktionen har tagits bort till förmån för en vanlig :keyword:`with`-sats som kan acceptera flera kontexthanterare. Den senare tekniken är snabbare (eftersom den är inbyggd), och den gör ett bättre jobb med att avsluta flera kontexthanterare när en av dem ger upphov till ett undantag::

source: with open('mylog.txt') as infile, open('a.out', 'w') as outfile: for line in infile: if '<critical>' in line: outfile.write(line)
sv: med open('mylog.txt') som infile, open('a.out', 'w') som outfile: för rad i infile: if '<critical>' i rad: outfile.write(rad)

source: (Contributed by Georg Brandl and Mattias Brändström; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)
sv: (Bidrag från Georg Brandl och Mattias Brändström; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)

source: :func:`struct.pack` now only allows bytes for the ``s`` string pack code. Formerly, it would accept text arguments and implicitly encode them to bytes using UTF-8. This was problematic because it made assumptions about the correct encoding and because a variable-length encoding can fail when writing to fixed length segment of a structure.
sv: :func:`struct.pack` tillåter nu endast byte för ``s`` strängpaketkoden. Tidigare accepterade den textargument och kodade dem implicit till byte med UTF-8. Detta var problematiskt eftersom det gjorde antaganden om den korrekta kodningen och eftersom en kodning med variabel längd kan misslyckas när man skriver till ett segment med fast längd i en struktur.

source: Code such as ``struct.pack('<6sHHBBB', 'GIF87a', x, y)`` should be rewritten with to use bytes instead of text, ``struct.pack('<6sHHBBB', b'GIF87a', x, y)``.
sv: Kod som ``struct.pack('<6sHHBBB', 'GIF87a', x, y)`` bör skrivas om för att använda bytes istället för text, ``struct.pack('<6sHHBBB', b'GIF87a', x, y)``.

source: (Discovered by David Beazley and fixed by Victor Stinner; :issue:`10783`.)
sv: (Upptäckt av David Beazley och åtgärdad av Victor Stinner; :issue:`10783`.)

source: The :class:`xml.etree.ElementTree` class now raises an :exc:`xml.etree.ElementTree.ParseError` when a parse fails. Previously it raised an :exc:`xml.parsers.expat.ExpatError`.
sv: Klassen :class:`xml.etree.ElementTree` ger nu upphov till ett :exc:`xml.etree.ElementTree.ParseError` när en parsning misslyckas. Tidigare gav den upphov till ett :exc:`xml.parsers.expat.ExpatError`.

source: The new, longer :func:`str` value on floats may break doctests which rely on the old output format.
sv: Det nya, längre :func:`str`-värdet på floats kan bryta doctests som förlitar sig på det gamla utdataformatet.

source: In :class:`subprocess.Popen`, the default value for *close_fds* is now ``True`` under Unix; under Windows, it is ``True`` if the three standard streams are set to ``None``, ``False`` otherwise. Previously, *close_fds* was always ``False`` by default, which produced difficult to solve bugs or race conditions when open file descriptors would leak into the child process.
sv: I :class:`subprocess.Popen` är standardvärdet för *close_fds* nu ``True`` under Unix; under Windows är det ``True`` om de tre standardströmmarna är inställda på ``None``, annars ``False``. Tidigare var *close_fds* alltid ``False`` som standard, vilket gjorde det svårt att lösa buggar eller tävlingsförhållanden när öppna filbeskrivare skulle läcka in i barnprocessen.

source: Support for legacy HTTP 0.9 has been removed from :mod:`urllib.request` and :mod:`http.client`. Such support is still present on the server side (in :mod:`http.server`).
sv: Stöd för äldre HTTP 0.9 har tagits bort från :mod:`urllib.request` och :mod:`http.client`. Sådant stöd finns fortfarande på serversidan (i :mod:`http.server`).

source: (Contributed by Antoine Pitrou, :issue:`10711`.)
sv: (Bidrag från Antoine Pitrou, :issue:`10711`.)

source: SSL sockets in timeout mode now raise :exc:`socket.timeout` when a timeout occurs, rather than a generic :exc:`~ssl.SSLError`.
sv: SSL-uttag i timeout-läge ger nu upphov till :exc:`socket.timeout` när en timeout inträffar, i stället för ett generiskt :exc:`~ssl.SSLError`.

source: (Contributed by Antoine Pitrou, :issue:`10272`.)
sv: (Bidrag från Antoine Pitrou, :issue:`10272`.)

source: The misleading functions :c:func:`!PyEval_AcquireLock` and :c:func:`!PyEval_ReleaseLock` have been officially deprecated. The thread-state aware APIs (such as :c:func:`PyEval_SaveThread` and :c:func:`PyEval_RestoreThread`) should be used instead.
sv: De vilseledande funktionerna :c:func:`!PyEval_AcquireLock` och :c:func:`!PyEval_ReleaseLock` har officiellt utgått. De trådstatusmedvetna API:erna (t.ex. :c:func:`PyEval_SaveThread` och :c:func:`PyEval_RestoreThread`) bör användas istället.

source: Due to security risks, :func:`!asyncore.handle_accept` has been deprecated, and a new function, :func:`!asyncore.handle_accepted`, was added to replace it.
sv: På grund av säkerhetsrisker har :func:`!asyncore.handle_accept` utgått och en ny funktion, :func:`!asyncore.handle_accepted`, har lagts till för att ersätta den.

source: (Contributed by Giampaolo Rodola in :issue:`6706`.)
sv: (Bidrag från Giampaolo Rodola i :issue:`6706`.)

source: Due to the new :term:`GIL` implementation, :c:func:`!PyEval_InitThreads` cannot be called before :c:func:`Py_Initialize` anymore.
sv: På grund av den nya :term:`GIL`-implementationen kan :c:func:`!PyEval_InitThreads` inte längre anropas före :c:func:`Py_Initialize`.
