Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: The :mod:`unittest` module has two new methods, :meth:`~unittest.TestCase.assertWarns` and :meth:`~unittest.TestCase.assertWarnsRegex` to verify that a given warning type is triggered by the code under test::
sv: Modulen :mod:`unittest` har två nya metoder, :meth:`~unittest.TestCase.assertWarns` och :meth:`~unittest.TestCase.assertWarnsRegex` för att verifiera att en viss typ av varning utlöses av den kod som testas::

source: with self.assertWarns(DeprecationWarning): legacy_function('XYZ')
sv: med self.assertWarns(DeprecationWarning): legacy_function('XYZ')

source: (Contributed by Antoine Pitrou, :issue:`9754`.)
sv: (Bidrag från Antoine Pitrou, :issue:`9754`.)

source: Another new method, :meth:`~unittest.TestCase.assertCountEqual` is used to compare two iterables to determine if their element counts are equal (whether the same elements are present with the same number of occurrences regardless of order)::
sv: En annan ny metod, :meth:`~unittest.TestCase.assertCountEqual` används för att jämföra två iterabler för att avgöra om deras elementantal är lika (om samma element finns med samma antal förekomster oavsett ordning)::

source: def test_anagram(self): self.assertCountEqual('algorithm', 'logarithm')
sv: def test_anagram(self): self.assertCountEqual('algoritm', 'logaritm')

source: A principal feature of the unittest module is an effort to produce meaningful diagnostics when a test fails. When possible, the failure is recorded along with a diff of the output. This is especially helpful for analyzing log files of failed test runs. However, since diffs can sometime be voluminous, there is a new :attr:`~unittest.TestCase.maxDiff` attribute that sets maximum length of diffs displayed.
sv: En av de viktigaste funktionerna i modulen unittest är att skapa meningsfull diagnostik när ett test misslyckas. När det är möjligt registreras misslyckandet tillsammans med en diff av utdata. Detta är särskilt användbart vid analys av loggfiler för misslyckade testkörningar. Men eftersom diffar ibland kan vara omfattande finns det ett nytt attribut :attr:`~unittest.TestCase.maxDiff` som anger maximal längd på de diffar som visas.

source: In addition, the method names in the module have undergone a number of clean-ups.
sv: Dessutom har metodnamnen i modulen genomgått ett antal upprensningar.

source: For example, :meth:`~unittest.TestCase.assertRegex` is the new name for :meth:`!assertRegexpMatches` which was misnamed because the test uses :func:`re.search`, not :func:`re.match`. Other methods using regular expressions are now named using short form "Regex" in preference to "Regexp" -- this matches the names used in other unittest implementations, matches Python's old name for the :mod:`re` module, and it has unambiguous camel-casing.
sv: Till exempel är :meth:`~unittest.TestCase.assertRegex` det nya namnet för :meth:`!assertRegexpMatches` som var felaktigt namngivet eftersom testet använder :func:`re.search`, inte :func:`re.match`. Andra metoder som använder reguljära uttryck namnges nu med kortformen "Regex" istället för "Regexp" -- detta matchar namnen som används i andra unittest-implementationer, matchar Pythons gamla namn för :mod:`re`-modulen och har entydig camel-casing.

source: (Contributed by Raymond Hettinger and implemented by Ezio Melotti.)
sv: (Bidrag från Raymond Hettinger och implementerat av Ezio Melotti.)

source: To improve consistency, some long-standing method aliases are being deprecated in favor of the preferred names:
sv: För att förbättra konsekvensen kommer vissa gamla metodalias att tas bort till förmån för de föredragna namnen:

source: Old Name
sv: Gammalt namn

source: Preferred Name
sv: Önskat namn

source: Likewise, the ``TestCase.fail*`` methods deprecated in Python 3.1 are expected to be removed in Python 3.3.
sv: På samma sätt förväntas metoderna ``TestCase.fail*`` som är föråldrade i Python 3.1 att tas bort i Python 3.3.

source: (Contributed by Ezio Melotti; :issue:`9424`.)
sv: (Bidrag från Ezio Melotti; :issue:`9424`.)

source: The :meth:`!assertDictContainsSubset` method was deprecated because it was misimplemented with the arguments in the wrong order. This created hard-to-debug optical illusions where tests like ``TestCase().assertDictContainsSubset({'a':1, 'b':2}, {'a':1})`` would fail.
sv: Metoden :meth:`!assertDictContainsSubset` utrangerades eftersom den var felimplementerad med argumenten i fel ordning. Detta skapade svårdebuggerade optiska illusioner där tester som ``TestCase().assertDictContainsSubset({'a':1, 'b':2}, {'a':1})`` skulle misslyckas.

source: random
sv: slumpvis

source: The integer methods in the :mod:`random` module now do a better job of producing uniform distributions. Previously, they computed selections with ``int(n*random())`` which had a slight bias whenever *n* was not a power of two. Now, multiple selections are made from a range up to the next power of two and a selection is kept only when it falls within the range ``0 <= x < n``. The functions and methods affected are :func:`~random.randrange`, :func:`~random.randint`, :func:`~random.choice`, :func:`~random.shuffle` and :func:`~random.sample`.
sv: Heltalsmetoderna i modulen :mod:`random` gör nu ett bättre jobb med att producera enhetliga fördelningar. Tidigare beräknade de urval med ``int(n*random())`` som hade en liten bias när *n* inte var en tvåpotens. Nu görs flera val från ett intervall upp till nästa tvåpotens och ett val behålls endast när det faller inom intervallet ``0 <= x < n``. De funktioner och metoder som påverkas är :func:`~random.randrange`, :func:`~random.randint`, :func:`~random.choice`, :func:`~random.shuffle` och :func:`~random.sample`.

source: (Contributed by Raymond Hettinger; :issue:`9025`.)
sv: (Bidrag från Raymond Hettinger; :issue:`9025`.)

source: :class:`~poplib.POP3_SSL` class now accepts a *context* parameter, which is a :class:`ssl.SSLContext` object allowing bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure.
sv: klassen :class:`~poplib.POP3_SSL` accepterar nu en *context*-parameter, som är ett :class:`ssl.SSLContext`-objekt som gör det möjligt att samla SSL-konfigurationsalternativ, certifikat och privata nycklar i en enda (potentiellt långlivad) struktur.

source: (Contributed by Giampaolo Rodolà; :issue:`8807`.)
sv: (Bidrag från Giampaolo Rodolà; :issue:`8807`.)

source: asyncore
sv: asynkron

source: :class:`!asyncore.dispatcher` now provides a :meth:`!handle_accepted` method returning a ``(sock, addr)`` pair which is called when a connection has actually been established with a new remote endpoint. This is supposed to be used as a replacement for old :meth:`!handle_accept` and avoids the user to call :meth:`!accept` directly.
sv: :class:`!asyncore.dispatcher` tillhandahåller nu en :meth:`!handle_accepted`-metod som returnerar ett ``(sock, addr)``-par som anropas när en anslutning faktiskt har upprättats med en ny fjärrslutpunkt. Detta är tänkt att användas som en ersättning för gamla :meth:`!handle_accept` och undviker att användaren anropar :meth:`!accept` direkt.

source: (Contributed by Giampaolo Rodolà; :issue:`6706`.)
sv: (Bidrag från Giampaolo Rodolà; :issue:`6706`.)

source: tempfile
sv: tempfil

source: The :mod:`tempfile` module has a new context manager, :class:`~tempfile.TemporaryDirectory` which provides easy deterministic cleanup of temporary directories::
sv: Modulen :mod:`tempfile` har en ny kontexthanterare, :class:`~tempfile.TemporaryDirectory` som ger enkel deterministisk rensning av temporära kataloger::

source: with tempfile.TemporaryDirectory() as tmpdirname: print('created temporary dir:', tmpdirname)
sv: with tempfile.TemporaryDirectory() as tmpdirname: print('skapade temporär dir:', tmpdirname)

source: (Contributed by Neil Schemenauer and Nick Coghlan; :issue:`5178`.)
sv: (Bidrag från Neil Schemenauer och Nick Coghlan; :issue:`5178`.)

source: inspect
sv: inspektera

source: The :mod:`inspect` module has a new function :func:`~inspect.getgeneratorstate` to easily identify the current state of a generator-iterator::
sv: Modulen :mod:`inspect` har fått en ny funktion :func:`~inspect.getgeneratorstate` för att enkelt identifiera det aktuella tillståndet för en generator-iterator::

source: >>> from inspect import getgeneratorstate >>> def gen(): ... yield 'demo' ... >>> g = gen() >>> getgeneratorstate(g) 'GEN_CREATED' >>> next(g) 'demo' >>> getgeneratorstate(g) 'GEN_SUSPENDED' >>> next(g, None) >>> getgeneratorstate(g) 'GEN_CLOSED'
sv: >>> från inspect import getgeneratorstate >>> def gen(): ... yield 'demo' ... >>> g = gen() >>> getgeneratorstate(g) 'GEN_CREATED' >>> nästa(g) 'demo' >>> getgeneratorstate(g) 'GEN_SUSPENDED' >>> nästa(g, Ingen) >>> getgeneratorstate(g) 'GEN_CLOSED'

source: (Contributed by Rodolpho Eckhardt and Nick Coghlan, :issue:`10220`.)
sv: (Bidrag från Rodolpho Eckhardt och Nick Coghlan, :issue:`10220`.)

source: To support lookups without the possibility of activating a dynamic attribute, the :mod:`inspect` module has a new function, :func:`~inspect.getattr_static`. Unlike :func:`hasattr`, this is a true read-only search, guaranteed not to change state while it is searching::
sv: För att stödja uppslagningar utan möjlighet att aktivera ett dynamiskt attribut har modulen :mod:`inspect` en ny funktion, :func:`~inspect.getattr_static`. Till skillnad från :func:`hasattr` är detta en äkta skrivskyddad sökning, som garanterat inte ändrar tillstånd under sökningen::

source: >>> class A: ... @property ... def f(self): ... print('Running') ... return 10 ... >>> a = A() >>> getattr(a, 'f') Running 10 >>> inspect.getattr_static(a, 'f') <property object at 0x1022bd788>
sv: &gt;&gt;&gt; klass A: ... @egenskap ... def f(self): ... print('Kör') ... return 10 ... &gt;&gt;&gt; a = A() &gt;&gt;&gt; getattr(a, 'f') Löpning 10 &gt;&gt;&gt; inspect.getattr_static(a, 'f') <property object at 0x1022bd788>

source: The :mod:`pydoc` module now provides a much-improved web server interface, as well as a new command-line option ``-b`` to automatically open a browser window to display that server:
sv: Modulen :mod:`pydoc` tillhandahåller nu ett mycket förbättrat webbservergränssnitt samt ett nytt kommandoradsalternativ ``-b`` för att automatiskt öppna ett webbläsarfönster för att visa den servern:

source: (Contributed by Ron Adam; :issue:`2001`.)
sv: (Bidrag från Ron Adam; :issue:`2001`.)

source: The :mod:`dis` module gained two new functions for inspecting code, :func:`~dis.code_info` and :func:`~dis.show_code`. Both provide detailed code object information for the supplied function, method, source code string or code object. The former returns a string and the latter prints it::
sv: Modulen :mod:`dis` har fått två nya funktioner för att inspektera kod, :func:`~dis.code_info` och :func:`~dis.show_code`. Båda ger detaljerad information om kodobjekt för den angivna funktionen, metoden, källkodsträngen eller kodobjektet. Den förstnämnda returnerar en sträng och den sistnämnda skriver ut den::

source: >>> import dis, random >>> dis.show_code(random.choice) Name: choice Filename: /Library/Frameworks/Python.framework/Versions/3.2/lib/python3.2/random.py Argument count: 2 Kw-only arguments: 0 Number of locals: 3 Stack size: 11 Flags: OPTIMIZED, NEWLOCALS, NOFREE Constants: 0: 'Choose a random element from a non-empty sequence.' 1: 'Cannot choose from an empty sequence' Names: 0: _randbelow 1: len 2: ValueError 3: IndexError Variable names: 0: self 1: seq 2: i
sv: >>> import dis, slumpmässig >>> dis.show_code(slumpmässigt.val) Namn: val Filnamn: /Library/Frameworks/Python.framework/Versions/3.2/lib/python3.2/random.py Antal argument: 2 Enda argument: 0 Antal lokalinställningar: 3 Stapelstorlek: 11 Flaggor: OPTIMERAD, NYA LOKALA, NOFREE Konstanter: 0: "Välj ett slumpmässigt element från en icke-tom sekvens 1: 'Kan inte välja från en tom sekvens' Namn: _randbelow 0: _randbelow 1: len 2: VärdeFel 3: Indexfel Namn på variabler: 0: själv 1: seq 2: i

source: In addition, the :func:`~dis.dis` function now accepts string arguments so that the common idiom ``dis(compile(s, '', 'eval'))`` can be shortened to ``dis(s)``::
sv: Dessutom accepterar funktionen :func:`~dis.dis` nu strängargument så att det vanliga idiomet ``dis(compile(s, '', 'eval'))`` kan förkortas till ``dis(s)``::

source: >>> dis('3*x+1 if x%2==1 else x//2') 1 0 LOAD_NAME 0 (x) 3 LOAD_CONST 0 (2) 6 BINARY_MODULO 7 LOAD_CONST 1 (1) 10 COMPARE_OP 2 (==) 13 POP_JUMP_IF_FALSE 28 16 LOAD_CONST 2 (3) 19 LOAD_NAME 0 (x) 22 BINARY_MULTIPLY 23 LOAD_CONST 1 (1) 26 BINARY_ADD 27 RETURN_VALUE >> 28 LOAD_NAME 0 (x) 31 LOAD_CONST 0 (2) 34 BINARY_FLOOR_DIVIDE 35 RETURN_VALUE
sv: >>> dis('3*x+1 if x%2==1 else x//2') 1 0 LOAD_NAME 0 (x) 3 LOAD_CONST 0 (2) 6 BINÄR_MODULO 7 LOAD_CONST 1 (1) 10 COMPARE_OP 2 (==) 13 POP_JUMP_IF_FALSE 28 16 LOAD_CONST 2 (3) 19 LOAD_NAME 0 (x) 22 BINÄR_MULTIPLICERA 23 LOAD_CONST 1 (1) 26 BINÄR_ADD 27 RETUR_VÄRDE >> 28 LADDA_NAMN 0 (x) 31 LOAD_CONST 0 (2) 34 BINÄR_GOLV_DELA 35 RETUR_VÄRDE

source: Taken together, these improvements make it easier to explore how CPython is implemented and to see for yourself what the language syntax does under-the-hood.
sv: Sammantaget gör dessa förbättringar det lättare att utforska hur CPython implementeras och att själv se vad språksyntaxen gör under huven.

source: (Contributed by Nick Coghlan in :issue:`9147`.)
sv: (Bidrag från Nick Coghlan i :issue:`9147`.)

source: All database modules now support the :meth:`!get` and :meth:`!setdefault` methods.
sv: Alla databasmoduler stöder nu metoderna :meth:`!get` och :meth:`!setdefault`.

source: (Suggested by Ray Allen in :issue:`9523`.)
sv: (Föreslagen av Ray Allen i :issue:`9523`.)

source: ctypes
sv: ctyper

source: A new type, :class:`ctypes.c_ssize_t` represents the C :c:type:`ssize_t` datatype.
sv: En ny typ, :class:`ctypes.c_ssize_t` representerar datatypen C :c:type:`ssize_t`.

source: site
sv: plats

source: The :mod:`site` module has three new functions useful for reporting on the details of a given Python installation.
sv: Modulen :mod:`site` har tre nya funktioner som är användbara för att rapportera om detaljerna i en viss Python-installation.

source: :func:`~site.getsitepackages` lists all global site-packages directories.
sv: :func:`~site.getsitepackages` listar alla globala kataloger för platspaket.

source: :func:`~site.getuserbase` reports on the user's base directory where data can be stored.
sv: :func:`~site.getuserbase` rapporterar om användarens baskatalog där data kan lagras.

source: :func:`~site.getusersitepackages` reveals the user-specific site-packages directory path.
sv: :func:`~site.getusersitepackages` avslöjar den användarspecifika katalogvägen för webbplatsens paket.

source: Conveniently, some of site's functionality is accessible directly from the command-line:
sv: En del av webbplatsens funktioner kan enkelt nås direkt från kommandoraden:

source: $ python -m site --user-base /Users/raymondhettinger/.local $ python -m site --user-site /Users/raymondhettinger/.local/lib/python3.2/site-packages
sv: $ python -m webbplats --användarbas /Användare/raymondhettinger/.local $ python -m webbplats --användarwebbplats /Users/raymondhettinger/.local/lib/python3.2/site-paket

source: (Contributed by Tarek Ziadé in :issue:`6693`.)
sv: (Bidrag från Tarek Ziadé i :issue:`6693`.)

source: The new :mod:`sysconfig` module makes it straightforward to discover installation paths and configuration variables that vary across platforms and installations.
sv: Den nya modulen :mod:`sysconfig` gör det enkelt att hitta installationssökvägar och konfigurationsvariabler som varierar mellan olika plattformar och installationer.

source: The module offers access simple access functions for platform and version information:
sv: Modulen ger tillgång till enkla åtkomstfunktioner för plattforms- och versionsinformation:

source: :func:`~sysconfig.get_platform` returning values like *linux-i586* or *macosx-10.6-ppc*.
sv: :func:`~sysconfig.get_platform` returnerar värden som *linux-i586* eller *macosx-10.6-ppc*.

source: :func:`~sysconfig.get_python_version` returns a Python version string such as "3.2".
sv: :func:`~sysconfig.get_python_version` returnerar en Python-versionsträng, t.ex. "3.2".

source: It also provides access to the paths and variables corresponding to one of seven named schemes used by ``distutils``. Those include *posix_prefix*, *posix_home*, *posix_user*, *nt*, *nt_user*, *os2*, *os2_home*:
sv: Den ger också tillgång till sökvägar och variabler som motsvarar ett av sju namngivna system som används av ``distutils``. Dessa inkluderar *posix_prefix*, *posix_home*, *posix_user*, *nt*, *nt_user*, *os2*, *os2_home*:

source: :func:`~sysconfig.get_paths` makes a dictionary containing installation paths for the current installation scheme.
sv: :func:`~sysconfig.get_paths` skapar en ordbok som innehåller installationssökvägar för det aktuella installationsschemat.

source: :func:`~sysconfig.get_config_vars` returns a dictionary of platform specific variables.
sv: :func:`~sysconfig.get_config_vars` returnerar en ordbok med plattformsspecifika variabler.

source: There is also a convenient command-line interface:
sv: Det finns också ett bekvämt kommandoradsgränssnitt:

source: C:\Python32>python -m sysconfig Platform: "win32" Python version: "3.2" Current installation scheme: "nt" Paths: data = "C:\Python32" include = "C:\Python32\Include" platinclude = "C:\Python32\Include" platlib = "C:\Python32\Lib\site-packages" platstdlib = "C:\Python32\Lib" purelib = "C:\Python32\Lib\site-packages" scripts = "C:\Python32\Scripts" stdlib = "C:\Python32\Lib" Variables: BINDIR = "C:\Python32" BINLIBDEST = "C:\Python32\Lib" EXE = ".exe" INCLUDEPY = "C:\Python32\Include" LIBDEST = "C:\Python32\Lib" SO = ".pyd" VERSION = "32" abiflags = "" base = "C:\Python32" exec_prefix = "C:\Python32" platbase = "C:\Python32" prefix = "C:\Python32" projectbase = "C:\Python32" py_version = "3.2" py_version_nodot = "32" py_version_short = "3.2" srcdir = "C:\Python32" userbase = "C:\Documents and Settings\Raymond\Application Data\Python"
sv: C:\Python32>python -m sysconfig Plattform: "win32" Python version: "3.2" Nuvarande installationsschema: "nt" Sökvägar: data = "C:\Python32" include = "C:\Python32\Include" platinclude = "C:\Python32\Include" platlib = "C:\Python32\Lib\site-packages" platstdlib = "C:\Python32\Lib" purelib = "C:\Python32\Lib\site-packages" scripts = "C:\Python32\Scripts" stdlib = "C:\Python32\Lib" Variabler: BINDIR = "C:\Python32" BINLIBDEST = "C:\Python32\Lib" EXE = ".exe" INCLUDEPY = "C:\Python32\Include" LIBDEST = "C:\Python32\Lib" SO = ".pyd" VERSION = "32" abiflags = "" bas = "C:\Python32" exec_prefix = "C:\Python32" platbase = "C:\Python32" prefix = "C:\Python32" projektbas = "C:\Python32" py_version = "3.2" py_version_nodot = "32" py_version_short = "3.2" srcdir = "C:\Python32" userbase = "C:\Dokument och inställningar\Raymond\Applikationsdata\Python"

source: (Moved out of Distutils by Tarek Ziadé.)
sv: (Flyttad från Distutils av Tarek Ziadé.)

source: The :mod:`pdb` debugger module gained a number of usability improvements:
sv: Felsökningsmodulen :mod:`pdb` har fått ett antal förbättringar av användbarheten:

source: :file:`pdb.py` now has a ``-c`` option that executes commands as given in a :file:`.pdbrc` script file.
sv: :file:`pdb.py` har nu ett ``-c`` alternativ som exekverar kommandon som ges i en :file:`.pdbrc` scriptfil.

source: A :file:`.pdbrc` script file can contain ``continue`` and ``next`` commands that continue debugging.
sv: En skriptfil av typen :file:`.pdbrc` kan innehålla kommandona ``continue`` och ``next`` som fortsätter felsökningen.

source: The :class:`~pdb.Pdb` class constructor now accepts a *nosigint* argument.
sv: Klasskonstruktören :class:`~pdb.Pdb` accepterar nu ett *nosigint*-argument.

source: New commands: ``l(list)``, ``ll(long list)`` and ``source`` for listing source code.
sv: Nya kommandon: ``l(list)``, ``ll(long list)`` och ``source`` för listning av källkod.

source: New commands: ``display`` and ``undisplay`` for showing or hiding the value of an expression if it has changed.
sv: Nya kommandon: ``display`` och ``undisplay`` för att visa eller dölja värdet på ett uttryck om det har ändrats.

source: New command: ``interact`` for starting an interactive interpreter containing the global and local names found in the current scope.
sv: Nytt kommando: ``interact`` för att starta en interaktiv tolk som innehåller de globala och lokala namn som finns i det aktuella omfånget.

source: Breakpoints can be cleared by breakpoint number.
sv: Brytpunkter kan rensas med hjälp av brytpunktsnummer.

source: (Contributed by Georg Brandl, Antonio Cuni and Ilya Sandler.)
sv: (Bidrag från Georg Brandl, Antonio Cuni och Ilya Sandler.)

source: configparser
sv: konfigurationsanalysator

source: The :mod:`configparser` module was modified to improve usability and predictability of the default parser and its supported INI syntax. The old :class:`!ConfigParser` class was removed in favor of :class:`!SafeConfigParser` which has in turn been renamed to :class:`~configparser.ConfigParser`. Support for inline comments is now turned off by default and section or option duplicates are not allowed in a single configuration source.
sv: Modulen :mod:`configparser` har modifierats för att förbättra användbarheten och förutsägbarheten för standardparsern och dess stödda INI-syntax. Den gamla klassen :class:`!ConfigParser` togs bort till förmån för :class:`!SafeConfigParser` som i sin tur har bytt namn till :class:`~configparser.ConfigParser`. Stöd för inline-kommentarer är nu avstängt som standard och dubbletter av avsnitt eller alternativ tillåts inte i en enda konfigurationskälla.

source: Config parsers gained a new API based on the mapping protocol::
sv: Config-parsers fick ett nytt API baserat på mappningsprotokollet::

source: >>> parser = ConfigParser() >>> parser.read_string(""" ... [DEFAULT] ... location = upper left ... visible = yes ... editable = no ... color = blue ... ... [main] ... title = Main Menu ... color = green ... ... [options] ... title = Options ... """) >>> parser['main']['color'] 'green' >>> parser['main']['editable'] 'no' >>> section = parser['options'] >>> section['title'] 'Options' >>> section['title'] = 'Options (editable: %(editable)s)' >>> section['title'] 'Options (editable: no)'
sv: >>> parser = ConfigParser() >>> parser.read_string(""" ... [DEFAULT] ... plats = övre vänster ... synlig = ja ... redigerbar = nej ... färg = blå ... ... [huvud] ... titel = Huvudmeny ... färg = grön ... ... [alternativ] ... titel = Alternativ ... """) >>> parser['main']['color'] 'grön' >>> parser['main']['editable'] 'no' >>> sektion = parser['alternativ'] >>> avsnitt['titel'] 'Alternativ' >>> section['title'] = 'Alternativ (redigerbara: %(editable)s)' >>> section['title'] "Alternativ (redigerbara: nej)

source: The new API is implemented on top of the classical API, so custom parser subclasses should be able to use it without modifications.
sv: Det nya API:et implementeras ovanpå det klassiska API:et, så anpassade parserunderklasser bör kunna använda det utan ändringar.

source: The INI file structure accepted by config parsers can now be customized. Users can specify alternative option/value delimiters and comment prefixes, change the name of the *DEFAULT* section or switch the interpolation syntax.
sv: INI-filstrukturen som accepteras av konfigurationsanalysatorer kan nu anpassas. Användare kan ange alternativa avgränsare för alternativ/värden och kommentarsprefix, ändra namnet på avsnittet *DEFAULT* eller byta syntax för interpolering.
