Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: The :func:`~math.expm1` function computes ``e**x-1`` for small values of *x* without incurring the loss of precision that usually accompanies the subtraction of nearly equal quantities:
sv: Funktionen :func:`~math.expm1` beräknar ``e**x-1`` för små värden på *x* utan den precisionsförlust som vanligtvis följer med subtraktion av nästan lika stora mängder:

source: The :func:`~math.erf` function computes a probability integral or `Gaussian error function <https://en.wikipedia.org/wiki/Error_function>`_. The complementary error function, :func:`~math.erfc`, is ``1 - erf(x)``:
sv: Funktionen :func:`~math.erf` beräknar en sannolikhetsintegral eller `Gaussisk felfunktion <https://en.wikipedia.org/wiki/Error_function>`_. Den komplementära felfunktionen, :func:`~math.erfc`, är ``1 - erf(x)``:

source: >>> from math import erf, erfc, sqrt >>> erf(1.0/sqrt(2.0)) # portion of normal distribution within 1 standard deviation 0.682689492137086 >>> erfc(1.0/sqrt(2.0)) # portion of normal distribution outside 1 standard deviation 0.31731050786291404 >>> erf(1.0/sqrt(2.0)) + erfc(1.0/sqrt(2.0)) 1.0
sv: >>> from math import erf, erfc, sqrt >>> erf(1,0/sqrt(2,0)) # del av normalfördelning inom 1 standardavvikelse 0.682689492137086 >>> erfc(1,0/sqrt(2,0)) # del av normalfördelningen utanför 1 standardavvikelse 0.31731050786291404 >>> erf(1,0/sqrt(2,0)) + erfc(1,0/sqrt(2,0)) 1.0

source: The :func:`~math.gamma` function is a continuous extension of the factorial function. See https://en.wikipedia.org/wiki/Gamma_function for details. Because the function is related to factorials, it grows large even for small values of *x*, so there is also a :func:`~math.lgamma` function for computing the natural logarithm of the gamma function:
sv: Funktionen :func:`~math.gamma` är en kontinuerlig utvidgning av faktorialfunktionen. Se https://en.wikipedia.org/wiki/Gamma_function för detaljer. Eftersom funktionen är relaterad till faktorialtal blir den stor även för små värden på *x*, så det finns också en :func:`~math.lgamma`-funktion för att beräkna den naturliga logaritmen av gammafunktionen:

source: (Contributed by Mark Dickinson.)
sv: (Bidrag från Mark Dickinson.)

source: The :mod:`abc` module now supports :func:`~abc.abstractclassmethod` and :func:`~abc.abstractstaticmethod`.
sv: Modulen :mod:`abc` har nu stöd för :func:`~abc.abstractclassmethod` och :func:`~abc.abstractstaticmethod`.

source: These tools make it possible to define an :term:`abstract base class` that requires a particular :func:`classmethod` or :func:`staticmethod` to be implemented::
sv: Dessa verktyg gör det möjligt att definiera en :term:`abstrakt basklass` som kräver att en viss :func:`klassmetod` eller :func:`statiskmetod` implementeras::

source: class Temperature(metaclass=abc.ABCMeta): @abc.abstractclassmethod def from_fahrenheit(cls, t): ... @abc.abstractclassmethod def from_celsius(cls, t): ...
sv: klass Temperatur(metaklass=abc.ABCMeta): @abc.abstractclassmethod def from_fahrenheit(cls, t): ... @abc.abstractclassmethod def from_celsius(cls, t): ...

source: (Patch submitted by Daniel Urban; :issue:`5867`.)
sv: (Patch inlämnad av Daniel Urban; :issue:`5867`.)

source: The :class:`io.BytesIO` has a new method, :meth:`~io.BytesIO.getbuffer`, which provides functionality similar to :func:`memoryview`. It creates an editable view of the data without making a copy. The buffer's random access and support for slice notation are well-suited to in-place editing::
sv: Klassen :class:`io.BytesIO` har en ny metod, :meth:`~io.BytesIO.getbuffer`, som ger funktionalitet som liknar :func:`memoryview`. Den skapar en redigerbar vy av data utan att göra en kopia. Buffertens slumpmässiga åtkomst och stöd för slice-notation är väl lämpade för redigering på plats::

source: >>> REC_LEN, LOC_START, LOC_LEN = 34, 7, 11 >>> def change_location(buffer, record_number, location): ... start = record_number * REC_LEN + LOC_START ... buffer[start: start+LOC_LEN] = location >>> import io >>> byte_stream = io.BytesIO( ... b'G3805 storeroom Main chassis ' ... b'X7899 shipping Reserve cog ' ... b'L6988 receiving Primary sprocket' ... ) >>> buffer = byte_stream.getbuffer() >>> change_location(buffer, 1, b'warehouse ') >>> change_location(buffer, 0, b'showroom ') >>> print(byte_stream.getvalue()) b'G3805 showroom Main chassis ' b'X7899 warehouse Reserve cog ' b'L6988 receiving Primary sprocket'
sv: >>> REC_LEN, LOC_START, LOC_LEN = 34, 7, 11 >>> def change_location(buffert, record_number, plats): ... start = record_number * REC_LEN + LOC_START ... buffert[start: start+LOC_LEN] = plats >>> import io >>> byte_stream = io.BytesIO( ... b'G3805 förråd Huvudchassi ' ... b'X7899 frakt Reservkugghjul ' ... b'L6988 mottagning Primärt kedjehjul' ... ) >>> buffert = byte_stream.getbuffer() >>> change_location(buffert, 1, b'lager ') >>> change_location(buffert, 0, b'showroom ') >>> print(byte_stream.getvalue()) b'G3805 utställningslokal Huvudchassi ' b'X7899 lager Reservkugghjul ' b'L6988 mottagning Primärt kedjehjul'

source: (Contributed by Antoine Pitrou in :issue:`5506`.)
sv: (Bidrag från Antoine Pitrou i :issue:`5506`.)

source: When writing a :meth:`~object.__repr__` method for a custom container, it is easy to forget to handle the case where a member refers back to the container itself. Python's builtin objects such as :class:`list` and :class:`set` handle self-reference by displaying "..." in the recursive part of the representation string.
sv: När man skriver en :meth:`~object.__repr__`-metod för en egen container är det lätt att glömma bort att hantera fallet där en medlem refererar tillbaka till containern själv. Pythons inbyggda objekt som :class:`list` och :class:`set` hanterar självreferenser genom att visa "..." i den rekursiva delen av representationssträngen.

source: To help write such :meth:`~object.__repr__` methods, the :mod:`reprlib` module has a new decorator, :func:`~reprlib.recursive_repr`, for detecting recursive calls to :meth:`!__repr__` and substituting a placeholder string instead::
sv: För att hjälpa till att skriva sådana :meth:`~object.__repr__`-metoder har modulen :mod:`reprlib` en ny dekorator, :func:`~reprlib.recursive_repr`, för att upptäcka rekursiva anrop till :meth:`!__repr__` och ersätta dem med en platshållarsträng::

source: >>> class MyList(list): ... @recursive_repr() ... def __repr__(self): ... return '<' + '|'.join(map(repr, self)) + '>' ... >>> m = MyList('abc') >>> m.append(m) >>> m.append('x') >>> print(m) <'a'|'b'|'c'|...|'x'>
sv: >>> klass MyList(lista): ... @rekursiv_repr() ... def __repr__(self): ... return '<' + '|'.join(map(repr, self)) + '>' ... >>> m = MyList('abc') >>> m.append(m) >>> m.append('x') >>> print(m) <'a'|'b'|'c'|...|'x'>

source: (Contributed by Raymond Hettinger in :issue:`9826` and :issue:`9840`.)
sv: (Bidrag från Raymond Hettinger i :issue:`9826` och :issue:`9840`.)

source: logging
sv: loggning

source: In addition to dictionary-based configuration described above, the :mod:`logging` package has many other improvements.
sv: Förutom den ordboksbaserade konfigurationen som beskrivs ovan innehåller paketet :mod:`logging` många andra förbättringar.

source: The logging documentation has been augmented by a :ref:`basic tutorial <logging-basic-tutorial>`\, an :ref:`advanced tutorial <logging-advanced-tutorial>`\, and a :ref:`cookbook <logging-cookbook>` of logging recipes. These documents are the fastest way to learn about logging.
sv: Loggningsdokumentationen har utökats med en :ref:`grundläggande handledning <logging-basic-tutorial>`\, en :ref:`avancerad handledning <logging-advanced-tutorial>`\, och en :ref:`kokbok <logging-cookbook>` med loggningsrecept. Dessa dokument är det snabbaste sättet att lära sig mer om loggning.

source: The :func:`logging.basicConfig` set-up function gained a *style* argument to support three different types of string formatting. It defaults to "%" for traditional %-formatting, can be set to "{" for the new :meth:`str.format` style, or can be set to "$" for the shell-style formatting provided by :class:`string.Template`. The following three configurations are equivalent::
sv: Uppsättningsfunktionen :func:`logging.basicConfig` har fått ett *style*-argument för att stödja tre olika typer av strängformatering. Det är som standard "%" för traditionell %-f-formatering, kan sättas till "{" för den nya :meth:`str.format`-stilen, eller kan sättas till "$" för den shell-stilformatering som tillhandahålls av :class:`string.Template`. Följande tre konfigurationer är likvärdiga::

source: If no configuration is set-up before a logging event occurs, there is now a default configuration using a :class:`~logging.StreamHandler` directed to :data:`sys.stderr` for events of ``WARNING`` level or higher. Formerly, an event occurring before a configuration was set-up would either raise an exception or silently drop the event depending on the value of :data:`logging.raiseExceptions`. The new default handler is stored in :data:`logging.lastResort`.
sv: Om ingen konfiguration görs innan en loggningshändelse inträffar finns det nu en standardkonfiguration som använder en :class:`~logging.StreamHandler` riktad till :data:`sys.stderr` för händelser på ``WARNING``-nivå eller högre. Tidigare skulle en händelse som inträffade innan en konfiguration konfigurerades antingen ge upphov till ett undantag eller tyst släppa händelsen beroende på värdet för :data:`logging.raiseExceptions`. Den nya standardhanteraren lagras i :data:`logging.lastResort`.

source: The use of filters has been simplified. Instead of creating a :class:`~logging.Filter` object, the predicate can be any Python callable that returns ``True`` or ``False``.
sv: Användningen av filter har förenklats. Istället för att skapa ett :class:`~logging.Filter`-objekt kan predikatet vara vilken Python-kallbar som helst som returnerar ``True`` eller ``False``.

source: There were a number of other improvements that add flexibility and simplify configuration. See the module documentation for a full listing of changes in Python 3.2.
sv: Det finns ett antal andra förbättringar som ger ökad flexibilitet och förenklar konfigurationen. Se moduldokumentationen för en fullständig lista över ändringar i Python 3.2.

source: The :mod:`csv` module now supports a new dialect, :class:`~csv.unix_dialect`, which applies quoting for all fields and a traditional Unix style with ``'\n'`` as the line terminator. The registered dialect name is ``unix``.
sv: Modulen :mod:`csv` stöder nu en ny dialekt, :class:`~csv.unix_dialect`, som använder citattecken för alla fält och en traditionell Unix-stil med ``'\n'`` som radavslutare. Det registrerade dialektnamnet är ``unix``.

source: The :class:`csv.DictWriter` has a new method, :meth:`~csv.DictWriter.writeheader` for writing-out an initial row to document the field names::
sv: Klassen :class:`csv.DictWriter` har en ny metod, :meth:`~csv.DictWriter.writeheader` för att skriva ut en första rad för att dokumentera fältnamnen::

source: >>> import csv, sys >>> w = csv.DictWriter(sys.stdout, ['name', 'dept'], dialect='unix') >>> w.writeheader() "name","dept" >>> w.writerows([ ... {'name': 'tom', 'dept': 'accounting'}, ... {'name': 'susan', 'dept': 'Salesl'}]) "tom","accounting" "susan","sales"
sv: >>> import csv, sys >>> w = csv.DictWriter(sys.stdout, ['name', 'dept'], dialect='unix') >>> w.writeheader() "namn","dept" >>> w.writerows([ ... {'name': 'tom', 'dept': 'accounting'}, ... {'name': 'susan', 'dept': 'Salesl'}]) "tom","redovisning" "susan","försäljning"

source: (New dialect suggested by Jay Talbot in :issue:`5975`, and the new method suggested by Ed Abraham in :issue:`1537721`.)
sv: (Ny dialekt föreslagen av Jay Talbot i :issue:`5975`, och den nya metoden föreslagen av Ed Abraham i :issue:`1537721`.)

source: There is a new and slightly mind-blowing tool :class:`~contextlib.ContextDecorator` that is helpful for creating a :term:`context manager` that does double duty as a function decorator.
sv: Det finns ett nytt och lite häpnadsväckande verktyg :class:`~contextlib.ContextDecorator` som är till hjälp för att skapa en :term:`context manager` som gör dubbel tjänst som en funktionsdekorator.

source: As a convenience, this new functionality is used by :func:`~contextlib.contextmanager` so that no extra effort is needed to support both roles.
sv: Som en bekvämlighet används denna nya funktionalitet av :func:`~contextlib.contextmanager` så att ingen extra ansträngning behövs för att stödja båda rollerna.

source: The basic idea is that both context managers and function decorators can be used for pre-action and post-action wrappers. Context managers wrap a group of statements using a :keyword:`with` statement, and function decorators wrap a group of statements enclosed in a function. So, occasionally there is a need to write a pre-action or post-action wrapper that can be used in either role.
sv: Den grundläggande idén är att både kontexthanterare och funktionsdekoratorer kan användas för pre-action och post-action wrappers. Kontexthanterare omsluter en grupp satser med hjälp av ett :keyword:`with`-sats och funktionsdekoratorer omsluter en grupp satser som är inneslutna i en funktion. Ibland finns det alltså ett behov av att skriva en pre-action eller post-action wrapper som kan användas i båda rollerna.

source: For example, it is sometimes useful to wrap functions or groups of statements with a logger that can track the time of entry and time of exit. Rather than writing both a function decorator and a context manager for the task, the :func:`~contextlib.contextmanager` provides both capabilities in a single definition::
sv: Till exempel är det ibland användbart att paketera funktioner eller grupper av satser med en logger som kan spåra tidpunkten för inmatning och tidpunkten för avslutning. I stället för att skriva både en funktionsdekorator och en kontexthanterare för uppgiften, ger :func:`~contextlib.contextmanager` båda möjligheterna i en enda definition::

source: Formerly, this would have only been usable as a context manager::
sv: Tidigare skulle detta bara ha kunnat användas som en kontexthanterare::

source: with track_entry_and_exit('widget loader'): print('Some time consuming activity goes here') load_widget()
sv: med track_entry_and_exit('widget loader'): print('En tidskrävande aktivitet sker här') ladda_widget()

source: Now, it can be used as a decorator as well::
sv: Nu kan den även användas som inredningsdetalj::

source: @track_entry_and_exit('widget loader') def activity(): print('Some time consuming activity goes here') load_widget()
sv: @track_entry_and_exit('widgetladdare') def aktivitet(): print('Någon tidskrävande aktivitet sker här') ladda_widget()

source: Trying to fulfill two roles at once places some limitations on the technique. Context managers normally have the flexibility to return an argument usable by a :keyword:`with` statement, but there is no parallel for function decorators.
sv: Att försöka uppfylla två roller samtidigt innebär vissa begränsningar för tekniken. Kontexthanterare har normalt flexibiliteten att returnera ett argument som kan användas av en :keyword:`with`-sats, men det finns ingen parallell för funktionsdekoratorer.

source: In the above example, there is not a clean way for the *track_entry_and_exit* context manager to return a logging instance for use in the body of enclosed statements.
sv: I exemplet ovan finns det inte något rent sätt för kontexthanteraren *track_entry_and_exit* att returnera en loggningsinstans för användning i brödtexten i slutna satser.

source: (Contributed by Michael Foord in :issue:`9110`.)
sv: (Bidrag från Michael Foord i :issue:`9110`.)

source: decimal and fractions
sv: decimaltal och bråk

source: Mark Dickinson crafted an elegant and efficient scheme for assuring that different numeric datatypes will have the same hash value whenever their actual values are equal (:issue:`8188`)::
sv: Mark Dickinson skapade ett elegant och effektivt system för att säkerställa att olika numeriska datatyper har samma hashvärde när deras faktiska värden är lika (:issue:`8188`)::

source: assert hash(Fraction(3, 2)) == hash(1.5) == \ hash(Decimal("1.5")) == hash(complex(1.5, 0))
sv: assert hash(Fraktion(3, 2)) == hash(1,5) == \ hash(Decimal("1,5")) == hash(komplex(1,5, 0))

source: Some of the hashing details are exposed through a new attribute, :data:`sys.hash_info`, which describes the bit width of the hash value, the prime modulus, the hash values for *infinity* and *nan*, and the multiplier used for the imaginary part of a number:
sv: En del av hashdetaljerna visas genom ett nytt attribut, :data:`sys.hash_info`, som beskriver hashvärdets bitbredd, primtalsmodulen, hashvärdena för *infinity* och *nan* samt den multiplikator som används för imaginärdelen av ett tal:

source: An early decision to limit the interoperability of various numeric types has been relaxed. It is still unsupported (and ill-advised) to have implicit mixing in arithmetic expressions such as ``Decimal('1.1') + float('1.1')`` because the latter loses information in the process of constructing the binary float. However, since existing floating-point value can be converted losslessly to either a decimal or rational representation, it makes sense to add them to the constructor and to support mixed-type comparisons.
sv: Ett tidigt beslut om att begränsa interoperabiliteten för olika numeriska typer har lättats upp. Det är fortfarande inte tillåtet (och inte heller lämpligt) att ha implicit mixning i aritmetiska uttryck som ``Decimal('1.1') + float('1.1')`` eftersom det senare förlorar information i processen att konstruera den binära floaten. Men eftersom befintliga flyttalsvärden kan konverteras förlustfritt till antingen en decimal eller rationell representation, är det vettigt att lägga till dem i konstruktorn och stödja jämförelser av blandad typ.

source: The :class:`decimal.Decimal` constructor now accepts :class:`float` objects directly so there in no longer a need to use the :meth:`~decimal.Decimal.from_float` method (:issue:`8257`).
sv: Konstruktorn :class:`decimal.Decimal` accepterar nu :class:`float`-objekt direkt så det finns inte längre något behov av att använda metoden :meth:`~decimal.Decimal.from_float` (:issue:`8257`).

source: Mixed type comparisons are now fully supported so that :class:`~decimal.Decimal` objects can be directly compared with :class:`float` and :class:`fractions.Fraction` (:issue:`2531` and :issue:`8188`).
sv: Jämförelser av blandade typer stöds nu fullt ut så att :class:`~decimal.Decimal`-objekt kan jämföras direkt med :class:`float` och :class:`fractions.Fraction` (:issue:`2531` och :issue:`8188`).

source: Similar changes were made to :class:`fractions.Fraction` so that the :meth:`~fractions.Fraction.from_float` and :meth:`~fractions.Fraction.from_decimal` methods are no longer needed (:issue:`8294`):
sv: Liknande ändringar har gjorts i :class:`fractions.Fraction` så att metoderna :meth:`~fractions.Fraction.from_float` och :meth:`~fractions.Fraction.from_decimal` inte längre behövs (:issue:`8294`):

source: Another useful change for the :mod:`decimal` module is that the :attr:`Context.clamp <decimal.Context.clamp>` attribute is now public. This is useful in creating contexts that correspond to the decimal interchange formats specified in IEEE 754 (see :issue:`8540`).
sv: En annan användbar förändring för modulen :mod:`decimal` är att attributet :attr:`Context.clamp <decimal.Context.clamp>` nu är offentligt. Detta är användbart för att skapa kontexter som motsvarar de decimala utbytesformat som anges i IEEE 754 (se :issue:`8540`).

source: (Contributed by Mark Dickinson and Raymond Hettinger.)
sv: (Bidrag från Mark Dickinson och Raymond Hettinger.)

source: The :class:`ftplib.FTP` class now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the FTP connection when done::
sv: Klassen :class:`ftplib.FTP` har nu stöd för kontexthanteringsprotokollet för att ovillkorligen konsumera :exc:`socket.error`-undantag och stänga FTP-anslutningen när den är klar:

source: Other file-like objects such as :class:`mmap.mmap` and :func:`fileinput.input` also grew auto-closing context managers::
sv: Andra filliknande objekt som :class:`mmap.mmap` och :func:`fileinput.input` har också automatiskt stängande kontexthanterare::

source: with fileinput.input(files=('log1.txt', 'log2.txt')) as f: for line in f: process(line)
sv: med fileinput.input(files=('log1.txt', 'log2.txt')) som f: för rad i f: process(rad)

source: (Contributed by Tarek Ziadé and Giampaolo Rodolà in :issue:`4972`, and by Georg Brandl in :issue:`8046` and :issue:`1286`.)
sv: (Bidrag från Tarek Ziadé och Giampaolo Rodolà i :issue:`4972`, och från Georg Brandl i :issue:`8046` och :issue:`1286`.)

source: The :class:`~ftplib.FTP_TLS` class now accepts a *context* parameter, which is a :class:`ssl.SSLContext` object allowing bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure.
sv: Klassen :class:`~ftplib.FTP_TLS` accepterar nu en *context*-parameter, som är ett :class:`ssl.SSLContext`-objekt som gör det möjligt att samla SSL-konfigurationsalternativ, certifikat och privata nycklar i en enda (potentiellt långlivad) struktur.

source: (Contributed by Giampaolo Rodolà; :issue:`8806`.)
sv: (Bidrag från Giampaolo Rodolà; :issue:`8806`.)

source: The :func:`os.popen` and :func:`subprocess.Popen` functions now support :keyword:`with` statements for auto-closing of the file descriptors.
sv: Funktionerna :func:`os.popen` och :func:`subprocess.Popen` stöder nu :keyword:`with`-satser för automatisk stängning av filbeskrivare.

source: (Contributed by Antoine Pitrou and Brian Curtin in :issue:`7461` and :issue:`10554`.)
sv: (Bidrag från Antoine Pitrou och Brian Curtin i :issue:`7461` och :issue:`10554`.)

source: select
sv: välj

source: The :mod:`select` module now exposes a new, constant attribute, :const:`~select.PIPE_BUF`, which gives the minimum number of bytes which are guaranteed not to block when :func:`select.select` says a pipe is ready for writing.
sv: Modulen :mod:`select` har nu ett nytt, konstant attribut, :const:`~select.PIPE_BUF`, som anger det minsta antal byte som garanterat inte blockeras när :func:`select.select` säger att en pipa är klar för skrivning.

source: (Available on Unix systems. Patch by Sébastien Sablé in :issue:`9862`)
sv: (Tillgänglig på Unix-system. Patch av Sébastien Sablé i :issue:`9862`)

source: gzip and zipfile
sv: gzip och zipfil

source: :class:`gzip.GzipFile` now implements the :class:`io.BufferedIOBase` :term:`abstract base class` (except for ``truncate()``). It also has a :meth:`~gzip.GzipFile.peek` method and supports unseekable as well as zero-padded file objects.
sv: :class:`gzip.GzipFile` implementerar nu :class:`io.BufferedIOBase` :term:`abstrakt basklass` (förutom ``truncate()``)). Den har också en :meth:`~gzip.GzipFile.peek`-metod och stödjer filobjekt som inte kan tittas på och som är nollfyllda.

source: The :mod:`gzip` module also gains the :func:`~gzip.compress` and :func:`~gzip.decompress` functions for easier in-memory compression and decompression. Keep in mind that text needs to be encoded as :class:`bytes` before compressing and decompressing:
sv: Modulen :mod:`gzip` har även fått funktionerna :func:`~gzip.compress` och :func:`~gzip.decompress` för enklare komprimering och dekomprimering i minnet. Tänk på att text måste kodas som :class:`bytes` innan komprimering och dekomprimering:

source: (Contributed by Anand B. Pillai in :issue:`3488`; and by Antoine Pitrou, Nir Aides and Brian Curtin in :issue:`9962`, :issue:`1675951`, :issue:`7471` and :issue:`2846`.)
sv: (Bidrag från Anand B. Pillai i :issue:`3488`; och av Antoine Pitrou, Nir Aides och Brian Curtin i :issue:`9962`, :issue:`1675951`, :issue:`7471` och :issue:`2846`.)
