Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: Headers with unencoded non-ASCII bytes are deemed to be :rfc:`2047`\ -encoded using the *unknown-8bit* character set.
sv: Rubriker med okodade icke-ASCII-byte anses vara :rfc:`2047`\ -kodade med teckenuppsättningen *unknown-8bit*.

source: A new class :class:`~email.generator.BytesGenerator` produces bytes as output, preserving any unchanged non-ASCII data that was present in the input used to build the model, including message bodies with a :mailheader:`Content-Transfer-Encoding` of *8bit*.
sv: En ny klass :class:`~email.generator.BytesGenerator` producerar bytes som utdata och bevarar alla oförändrade icke-ASCII-data som fanns i indata som användes för att bygga modellen, inklusive meddelandetexter med en :mailheader:`Content-Transfer-Encoding` på *8bit*.

source: The :mod:`smtplib` :class:`~smtplib.SMTP` class now accepts a byte string for the *msg* argument to the :meth:`~smtplib.SMTP.sendmail` method, and a new method, :meth:`~smtplib.SMTP.send_message` accepts a :class:`~email.message.Message` object and can optionally obtain the *from_addr* and *to_addrs* addresses directly from the object.
sv: Klassen :mod:`smtplib` :class:`~smtplib.SMTP` accepterar nu en byte-sträng för *msg*-argumentet till metoden :meth:`~smtplib.SMTP.sendmail`, och en ny metod, :meth:`~smtplib.SMTP.send_message` accepterar ett :class:`~email.message.Message`-objekt och kan eventuellt hämta adresserna *from_addr* och *to_addrs* direkt från objektet.

source: (Proposed and implemented by R. David Murray, :issue:`4661` and :issue:`10321`.)
sv: (Föreslagen och implementerad av R. David Murray, :issue:`4661` och :issue:`10321`.)

source: elementtree
sv: elementträd

source: The :mod:`xml.etree.ElementTree` package and its :mod:`!xml.etree.cElementTree` counterpart have been updated to version 1.3.
sv: Paketet :mod:`xml.etree.ElementTree` och dess motsvarighet :mod:`!xml.etree.cElementTree` har uppdaterats till version 1.3.

source: Several new and useful functions and methods have been added:
sv: Flera nya och användbara funktioner och metoder har lagts till:

source: :func:`xml.etree.ElementTree.fromstringlist` which builds an XML document from a sequence of fragments
sv: :func:`xml.etree.ElementTree.fromstringlist` som bygger ett XML-dokument från en sekvens av fragment

source: :func:`xml.etree.ElementTree.register_namespace` for registering a global namespace prefix
sv: :func:`xml.etree.ElementTree.register_namespace` för registrering av ett globalt namnrymdsprefix

source: :func:`xml.etree.ElementTree.tostringlist` for string representation including all sublists
sv: :func:`xml.etree.ElementTree.tostringlist` för strängrepresentation inklusive alla underlistor

source: :meth:`xml.etree.ElementTree.Element.extend` for appending a sequence of zero or more elements
sv: :meth:`xml.etree.ElementTree.Element.extend` för att lägga till en sekvens med noll eller fler element

source: :meth:`xml.etree.ElementTree.Element.iterfind` searches an element and subelements
sv: :meth:`xml.etree.ElementTree.Element.iterfind` söker efter ett element och underelement

source: :meth:`xml.etree.ElementTree.Element.itertext` creates a text iterator over an element and its subelements
sv: :meth:`xml.etree.ElementTree.Element.itertext` skapar en textiterator över ett element och dess underelement

source: :meth:`xml.etree.ElementTree.TreeBuilder.end` closes the current element
sv: :meth:`xml.etree.ElementTree.TreeBuilder.end` stänger det aktuella elementet

source: :meth:`xml.etree.ElementTree.TreeBuilder.doctype` handles a doctype declaration
sv: :meth:`xml.etree.ElementTree.TreeBuilder.doctype` hanterar en doctype-deklaration

source: Two methods have been deprecated:
sv: Två metoder har utgått:

source: :meth:`!xml.etree.ElementTree.getchildren` use ``list(elem)`` instead.
sv: :meth:`!xml.etree.ElementTree.getchildren` använd ``list(elem)`` istället.

source: :meth:`!xml.etree.ElementTree.getiterator` use ``Element.iter`` instead.
sv: :meth:`!xml.etree.ElementTree.getiterator` använd ``Element.iter`` istället.

source: For details of the update, see `Introducing ElementTree <https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm>`_ on Fredrik Lundh's website.
sv: För mer information om uppdateringen, se `Introducing ElementTree <https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm>`_ på Fredrik Lundhs webbplats.

source: (Contributed by Florent Xicluna and Fredrik Lundh, :issue:`6472`.)
sv: (Bidrag från Florent Xicluna och Fredrik Lundh, :issue:`6472`.)

source: The :mod:`functools` module includes a new decorator for caching function calls. :func:`functools.lru_cache` can save repeated queries to an external resource whenever the results are expected to be the same.
sv: Modulen :mod:`functools` innehåller en ny dekorator för cachelagring av funktionsanrop. :func:`functools.lru_cache` kan spara upprepade frågor till en extern resurs när resultaten förväntas bli desamma.

source: For example, adding a caching decorator to a database query function can save database accesses for popular searches:
sv: Om du till exempel lägger till en cachningsdekorator i en databasfrågefunktion kan du spara databasåtkomst för populära sökningar:

source: To help with choosing an effective cache size, the wrapped function is instrumented for tracking cache statistics:
sv: För att hjälpa till att välja en effektiv cachestorlek är wrapped-funktionen instrumenterad för att spåra cachestatistik:

source: If the phonelist table gets updated, the outdated contents of the cache can be cleared with:
sv: Om telefonlistans tabell uppdateras kan det föråldrade innehållet i cacheminnet rensas med:

source: (Contributed by Raymond Hettinger and incorporating design ideas from Jim Baker, Miki Tebeka, and Nick Coghlan; see `recipe 498245 <https://code.activestate.com/recipes/498245-lru-and-lfu-cache-decorators/>`_\, `recipe 577479 <https://code.activestate.com/recipes/577479-simple-caching-decorator/>`_\, :issue:`10586`, and :issue:`10593`.)
sv: (Bidraget kommer från Raymond Hettinger och innehåller designidéer från Jim Baker, Miki Tebeka och Nick Coghlan; se `recipe 498245 <https://code.activestate.com/recipes/498245-lru-and-lfu-cache-decorators/>`_\, `recipe 577479 <https://code.activestate.com/recipes/577479-simple-caching-decorator/>`_\, :issue:`10586`, och :issue:`10593`)

source: The :func:`functools.wraps` decorator now adds a :attr:`__wrapped__` attribute pointing to the original callable function. This allows wrapped functions to be introspected. It also copies :attr:`~function.__annotations__` if defined. And now it also gracefully skips over missing attributes such as :attr:`~function.__doc__` which might not be defined for the wrapped callable.
sv: Dekoratorn :func:`functools.wraps` lägger nu till ett attribut :attr:`__wrapped__` som pekar på den ursprungliga anropsbara funktionen. Detta gör att inkapslade funktioner kan introspekteras. Den kopierar också :attr:`~function.__annotations__` om den är definierad. Och nu hoppar den också elegant över saknade attribut som :attr:`~function.__doc__` som kanske inte är definierade för den inkapslade anropbara funktionen.

source: In the above example, the cache can be removed by recovering the original function:
sv: I exemplet ovan kan cacheminnet tas bort genom att återställa den ursprungliga funktionen:

source: (By Nick Coghlan and Terrence Cole; :issue:`9567`, :issue:`3445`, and :issue:`8814`.)
sv: (Av Nick Coghlan och Terrence Cole; :issue:`9567`, :issue:`3445`, och :issue:`8814`.)

source: To help write classes with rich comparison methods, a new decorator :func:`functools.total_ordering` will use existing equality and inequality methods to fill in the remaining methods.
sv: För att hjälpa till att skriva klasser med rika jämförelsemetoder kommer en ny dekorator :func:`functools.total_ordering` att använda befintliga metoder för likhet och olikhet för att fylla i de återstående metoderna.

source: For example, supplying *__eq__* and *__lt__* will enable :func:`~functools.total_ordering` to fill-in *__le__*, *__gt__* and *__ge__*::
sv: Om du till exempel anger *__eq__* och *__lt__* kommer :func:`~functools.total_ordering` att fylla i *__le__*, *__gt__* och *__ge__*::

source: @total_ordering class Student: def __eq__(self, other): return ((self.lastname.lower(), self.firstname.lower()) == (other.lastname.lower(), other.firstname.lower())) def __lt__(self, other): return ((self.lastname.lower(), self.firstname.lower()) < (other.lastname.lower(), other.firstname.lower()))
sv: @total_beställning klass Student: def __eq__(self, other): return ((self.efternamn.lower(), self.förnamn.lower()) == (other.efternamn.lower(), other.förnamn.lower())) def __lt__(self, annan): return ((self.efternamn.lower(), self.förnamn.lower()) < (andra.efternamn.lägre(), andra.förnamn.lägre()))

source: With the *total_ordering* decorator, the remaining comparison methods are filled in automatically.
sv: Med dekoratorn *total_ordering* fylls de återstående jämförelsemetoderna i automatiskt.

source: (Contributed by Raymond Hettinger.)
sv: (Bidrag från Raymond Hettinger.)

source: To aid in porting programs from Python 2, the :func:`functools.cmp_to_key` function converts an old-style comparison function to modern :term:`key function`:
sv: För att underlätta portning av program från Python 2 konverterar funktionen :func:`functools.cmp_to_key` en gammaldags jämförelsefunktion till modern :term:`key function`:

source: For sorting examples and a brief sorting tutorial, see the `Sorting HowTo <https://wiki.python.org/moin/HowTo/Sorting/>`_ tutorial.
sv: Exempel på sortering och en kortfattad sorteringshandledning finns i handledningen `Sorting HowTo <https://wiki.python.org/moin/HowTo/Sorting/>`_.

source: The :mod:`itertools` module has a new :func:`~itertools.accumulate` function modeled on APL's *scan* operator and Numpy's *accumulate* function:
sv: Modulen :mod:`itertools` har en ny funktion :func:`~itertools.accumulate` som bygger på APL:s operator *scan* och Numpys funktion *accumulate*:

source: For an example using :func:`~itertools.accumulate`, see the :ref:`examples for the random module <random-examples>`.
sv: Ett exempel på användning av :func:`~itertools.accumulate` finns i :ref:`exempel för slumpmodulen <random-examples>`.

source: (Contributed by Raymond Hettinger and incorporating design suggestions from Mark Dickinson.)
sv: (Bidrag från Raymond Hettinger och med designförslag från Mark Dickinson.)

source: collections
sv: samlingar

source: The :class:`collections.Counter` class now has two forms of in-place subtraction, the existing *-=* operator for `saturating subtraction <https://en.wikipedia.org/wiki/Saturation_arithmetic>`_ and the new :meth:`~collections.Counter.subtract` method for regular subtraction. The former is suitable for `multisets <https://en.wikipedia.org/wiki/Multiset>`_ which only have positive counts, and the latter is more suitable for use cases that allow negative counts:
sv: Klassen :class:`collections.Counter` har nu två former av subtraktion på plats, den befintliga operatorn *-=* för `mättande subtraktion <https://en.wikipedia.org/wiki/Saturation_arithmetic>`_ och den nya metoden :meth:`~collections.Counter.subtract` för vanlig subtraktion. Den förra är lämplig för `multisets <https://en.wikipedia.org/wiki/Multiset>`_ som bara har positiva räkningar, och den senare är mer lämplig för användningsfall som tillåter negativa räkningar:

source: The :class:`collections.OrderedDict` class has a new method :meth:`~collections.OrderedDict.move_to_end` which takes an existing key and moves it to either the first or last position in the ordered sequence.
sv: Klassen :class:`collections.OrderedDict` har en ny metod :meth:`~collections.OrderedDict.move_to_end` som tar en befintlig nyckel och flyttar den till antingen den första eller sista positionen i den ordnade sekvensen.

source: The default is to move an item to the last position. This is equivalent of renewing an entry with ``od[k] = od.pop(k)``.
sv: Standardinställningen är att flytta ett objekt till den sista positionen. Detta motsvarar att förnya en post med ``od[k] = od.pop(k)``.

source: A fast move-to-end operation is useful for resequencing entries. For example, an ordered dictionary can be used to track order of access by aging entries from the oldest to the most recently accessed.
sv: En snabb "move-to-end"-operation är användbar för att sekvensera poster. En ordnad ordbok kan t.ex. användas för att spåra åtkomstordning genom att åldra poster från den äldsta till den senast åtkomna.

source: The :class:`collections.deque` class grew two new methods :meth:`~collections.deque.count` and :meth:`~collections.deque.reverse` that make them more substitutable for :class:`list` objects:
sv: Klassen :class:`collections.deque` har fått två nya metoder :meth:`~collections.deque.count` och :meth:`~collections.deque.reverse` som gör dem mer utbytbara mot :class:`list`-objekt:

source: threading
sv: gängning

source: The :mod:`threading` module has a new :class:`~threading.Barrier` synchronization class for making multiple threads wait until all of them have reached a common barrier point. Barriers are useful for making sure that a task with multiple preconditions does not run until all of the predecessor tasks are complete.
sv: Modulen :mod:`threading` har en ny :class:`~threading.Barrier` synkroniseringsklass för att få flera trådar att vänta tills alla har nått en gemensam barriärpunkt. Barriärer är användbara för att se till att en uppgift med flera förhandsvillkor inte körs förrän alla föregångaruppgifter är klara.

source: Barriers can work with an arbitrary number of threads. This is a generalization of a `Rendezvous <https://en.wikipedia.org/wiki/Synchronous_rendezvous>`_ which is defined for only two threads.
sv: Barriärer kan fungera med ett godtyckligt antal trådar. Detta är en generalisering av en `Rendezvous <https://en.wikipedia.org/wiki/Synchronous_rendezvous>`_ som är definierad för endast två trådar.

source: Implemented as a two-phase cyclic barrier, :class:`~threading.Barrier` objects are suitable for use in loops. The separate *filling* and *draining* phases assure that all threads get released (drained) before any one of them can loop back and re-enter the barrier. The barrier fully resets after each cycle.
sv: Implementerad som en tvåfasig cyklisk barriär är :class:`~threading.Barrier`-objekt lämpliga för användning i loopar. De separata faserna *fyllning* och *dränering* säkerställer att alla trådar släpps (dräneras) innan någon av dem kan loopa tillbaka och återinträda i barriären. Barriären återställs helt efter varje cykel.

source: Example of using barriers::
sv: Exempel på användning av barriärer::

source: from threading import Barrier, Thread def get_votes(site): ballots = conduct_election(site) all_polls_closed.wait() # do not count until all polls are closed totals = summarize(ballots) publish(site, totals) all_polls_closed = Barrier(len(sites)) for site in sites: Thread(target=get_votes, args=(site,)).start()
sv: från trådning import Barriär, Tråd def hämta_röster(webbplats): valsedlar = conduct_election(webbplats) all_polls_closed.wait() # räkna inte förrän alla vallokaler är stängda totals = sammanfatta(valsedlar) publicera(webbplats, totalsummor) all_polls_closed = Barriär(len(webbplatser)) för webbplats i webbplatser: Thread(target=get_votes, args=(site,)).start()

source: In this example, the barrier enforces a rule that votes cannot be counted at any polling site until all polls are closed. Notice how a solution with a barrier is similar to one with :meth:`threading.Thread.join`, but the threads stay alive and continue to do work (summarizing ballots) after the barrier point is crossed.
sv: I det här exemplet upprätthåller barriären en regel om att rösterna inte får räknas på någon vallokal förrän alla vallokaler har stängts. Lägg märke till hur en lösning med en barriär liknar en lösning med :meth:`threading.Thread.join`, men trådarna hålls vid liv och fortsätter att utföra arbete (sammanställning av röster) efter att barriärpunkten har passerats.

source: If any of the predecessor tasks can hang or be delayed, a barrier can be created with an optional *timeout* parameter. Then if the timeout period elapses before all the predecessor tasks reach the barrier point, all waiting threads are released and a :exc:`~threading.BrokenBarrierError` exception is raised::
sv: Om någon av de föregående uppgifterna kan hänga sig eller försenas kan en barriär skapas med en valfri *timeout*-parameter. Om timeout-perioden sedan löper ut innan alla föregångaruppgifter når barriärpunkten, släpps alla väntande trådar och ett :exc:`~threading.BrokenBarrierError`-undantag tas upp::

source: def get_votes(site): ballots = conduct_election(site) try: all_polls_closed.wait(timeout=midnight - time.now()) except BrokenBarrierError: lockbox = seal_ballots(ballots) queue.put(lockbox) else: totals = summarize(ballots) publish(site, totals)
sv: def get_votes(webbplats): röstsedlar = conduct_election(webbplats) försök: all_polls_closed.wait(timeout=midnatt - time.now()) except BrokenBarrierError: lockbox = försegla_röstsedlar(röstsedlar) queue.put(låda) else: totals = sammanfatta(valsedlar) publicera(webbplats, totalsumma)

source: In this example, the barrier enforces a more robust rule. If some election sites do not finish before midnight, the barrier times-out and the ballots are sealed and deposited in a queue for later handling.
sv: I det här exemplet tillämpar barriären en mer robust regel. Om vissa vallokaler inte hinner bli klara före midnatt tar barriären timeout och valsedlarna förseglas och läggs i en kö för senare hantering.

source: See `Barrier Synchronization Patterns <https://osl.cs.illinois.edu/media/papers/karmani-2009-barrier_synchronization_pattern.pdf>`_ for more examples of how barriers can be used in parallel computing. Also, there is a simple but thorough explanation of barriers in `The Little Book of Semaphores <https://greenteapress.com/semaphores/LittleBookOfSemaphores.pdf>`_, *section 3.6*.
sv: Se `Barrier Synchronization Patterns <https://osl.cs.illinois.edu/media/papers/karmani-2009-barrier_synchronization_pattern.pdf>`_ för fler exempel på hur barriärer kan användas i parallella beräkningar. Det finns också en enkel men grundlig förklaring av barriärer i `The Little Book of Semaphores <https://greenteapress.com/semaphores/LittleBookOfSemaphores.pdf>`_, *avsnitt 3.6*.

source: (Contributed by Kristján Valur Jónsson with an API review by Jeffrey Yasskin in :issue:`8777`.)
sv: (Bidrag från Kristján Valur Jónsson med en API-granskning av Jeffrey Yasskin i :issue:`8777`.)

source: datetime and time
sv: datetime och tid

source: The :mod:`datetime` module has a new type :class:`~datetime.timezone` that implements the :class:`~datetime.tzinfo` interface by returning a fixed UTC offset and timezone name. This makes it easier to create timezone-aware datetime objects::
sv: Modulen :mod:`datetime` har en ny typ :class:`~datetime.timezone` som implementerar gränssnittet :class:`~datetime.tzinfo` genom att returnera en fast UTC-offset och ett tidszonnamn. Detta gör det enklare att skapa tidszonsmedvetna datetime-objekt::

source: Also, :class:`~datetime.timedelta` objects can now be multiplied by :class:`float` and divided by :class:`float` and :class:`int` objects. And :class:`~datetime.timedelta` objects can now divide one another.
sv: Dessutom kan :class:`~datetime.timedelta`-objekt nu multipliceras med :class:`float` och divideras med :class:`float` och :class:`int`-objekt. Och :class:`~datetime.timedelta`-objekt kan nu divideras med varandra.

source: The :meth:`datetime.date.strftime` method is no longer restricted to years after 1900. The new supported year range is from 1000 to 9999 inclusive.
sv: Metoden :meth:`datetime.date.strftime` är inte längre begränsad till år efter 1900. Det nya årtalsintervallet som stöds är från 1000 till och med 9999.

source: Whenever a two-digit year is used in a time tuple, the interpretation has been governed by :data:`!time.accept2dyear`. The default is ``True`` which means that for a two-digit year, the century is guessed according to the POSIX rules governing the ``%y`` strptime format.
sv: När ett tvåsiffrigt årtal används i en tidstupel, har tolkningen styrts av :data:`!time.accept2dyear`. Standardvärdet är ``True`` vilket innebär att för ett tvåsiffrigt årtal gissas århundradet enligt POSIX-reglerna som styr strptime-formatet ``%y``.

source: Starting with Py3.2, use of the century guessing heuristic will emit a :exc:`DeprecationWarning`. Instead, it is recommended that :data:`!time.accept2dyear` be set to ``False`` so that large date ranges can be used without guesswork::
sv: Från och med Py3.2 kommer användning av heuristiken för gissning av århundraden att ge upphov till en :exc:`DeprecationWarning`. Istället rekommenderas det att :data:`!time.accept2dyear` sätts till ``False`` så att stora datumintervall kan användas utan gissningar::

source: >>> import time, warnings >>> warnings.resetwarnings() # remove the default warning filters >>> time.accept2dyear = True # guess whether 11 means 11 or 2011 >>> time.asctime((11, 1, 1, 12, 34, 56, 4, 1, 0)) Warning (from warnings module): ... DeprecationWarning: Century info guessed for a 2-digit year. 'Fri Jan 1 12:34:56 2011' >>> time.accept2dyear = False # use the full range of allowable dates >>> time.asctime((11, 1, 1, 12, 34, 56, 4, 1, 0)) 'Fri Jan 1 12:34:56 11'
sv: >>> import tid, varningar >>> warnings.resetwarnings() # ta bort standardvarningsfiltren >>> time.accept2dyear = True # gissa om 11 betyder 11 eller 2011 >>> time.asctime((11, 1, 1, 12, 34, 56, 4, 1, 0)) Varning (från modulen warnings): ... DeprecationWarning: Century info gissad för ett 2-siffrigt år. 'Fri Jan 1 12:34:56 2011' >>> time.accept2dyear = False # använd hela intervallet av tillåtna datum >>> time.asctime((11, 1, 1, 12, 34, 56, 4, 1, 0)) 'Fri Jan 1 12:34:56 11'

source: Several functions now have significantly expanded date ranges. When :data:`!time.accept2dyear` is false, the :func:`time.asctime` function will accept any year that fits in a C int, while the :func:`time.mktime` and :func:`time.strftime` functions will accept the full range supported by the corresponding operating system functions.
sv: Flera funktioner har nu betydligt utökade datumintervall. När :data:`!time.accept2dyear` är false kommer funktionen :func:`time.asctime` att acceptera alla årtal som ryms i ett C int, medan funktionerna :func:`time.mktime` och :func:`time.strftime` kommer att acceptera hela det intervall som stöds av motsvarande operativsystemfunktioner.

source: (Contributed by Alexander Belopolsky and Victor Stinner in :issue:`1289118`, :issue:`5094`, :issue:`6641`, :issue:`2706`, :issue:`1777412`, :issue:`8013`, and :issue:`10827`.)
sv: (Bidrag från Alexander Belopolsky och Victor Stinner i :issue:`1289118`, :issue:`5094`, :issue:`6641`, :issue:`2706`, :issue:`1777412`, :issue:`8013` och :issue:`10827`.)

source: math
sv: matematik

source: The :mod:`math` module has been updated with six new functions inspired by the C99 standard.
sv: Modulen :mod:`math` har uppdaterats med sex nya funktioner som inspirerats av C99-standarden.

source: The :func:`~math.isfinite` function provides a reliable and fast way to detect special values. It returns ``True`` for regular numbers and ``False`` for *Nan* or *Infinity*:
sv: Funktionen :func:`~math.isfinite` är ett pålitligt och snabbt sätt att upptäcka speciella värden. Den returnerar ``True`` för vanliga tal och ``False`` för *Nan* eller *Infinity*:
