Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: This informational PEP clarifies how bytes/text issues are to be handled by the WSGI protocol. The challenge is that string handling in Python 3 is most conveniently handled with the :class:`str` type even though the HTTP protocol is itself bytes oriented.
sv: Denna informativa PEP klargör hur bytes/text-frågor ska hanteras av WSGI-protokollet. Utmaningen är att stränghantering i Python 3 hanteras mest bekvämt med typen :class:`str` även om HTTP-protokollet i sig är bytesorienterat.

source: The PEP differentiates so-called *native strings* that are used for request/response headers and metadata versus *byte strings* which are used for the bodies of requests and responses.
sv: PEP:n skiljer mellan så kallade *native strings* som används för rubriker och metadata för begäran/svar och *byte strings* som används för huvuddelen av begäran och svar.

source: The *native strings* are always of type :class:`str` but are restricted to code points between *U+0000* through *U+00FF* which are translatable to bytes using *Latin-1* encoding. These strings are used for the keys and values in the environment dictionary and for response headers and statuses in the :func:`!start_response` function. They must follow :rfc:`2616` with respect to encoding. That is, they must either be *ISO-8859-1* characters or use :rfc:`2047` MIME encoding.
sv: De *inbyggda strängarna* är alltid av typen :class:`str` men begränsas till kodpunkter mellan *U+0000* och *U+00FF* som kan översättas till byte med hjälp av *Latin-1*-kodning. Dessa strängar används för nycklar och värden i miljöordlistan och för svarsrubriker och status i funktionen :func:`!start_response`. De måste följa :rfc:`2616` med avseende på kodning. Det vill säga, de måste antingen vara *ISO-8859-1*-tecken eller använda :rfc:`2047` MIME-kodning.

source: For developers porting WSGI applications from Python 2, here are the salient points:
sv: För utvecklare som portar WSGI-applikationer från Python 2, här är de viktigaste punkterna:

source: If the app already used strings for headers in Python 2, no change is needed.
sv: Om appen redan använde strängar för rubriker i Python 2 behövs ingen ändring.

source: If instead, the app encoded output headers or decoded input headers, then the headers will need to be re-encoded to Latin-1. For example, an output header encoded in utf-8 was using ``h.encode('utf-8')`` now needs to convert from bytes to native strings using ``h.encode('utf-8').decode('latin-1')``.
sv: Om appen i stället kodade utdatahuvuden eller avkodade inmatningshuvuden måste huvudena kodas om till Latin-1. Till exempel måste en utdatahuvud som kodats i utf-8 med hjälp av ``h.encode('utf-8')`` nu konverteras från bytes till inbyggda strängar med ``h.encode('utf-8').decode('latin-1')``.

source: Values yielded by an application or sent using the :meth:`!write` method must be byte strings. The :func:`!start_response` function and environ must use native strings. The two cannot be mixed.
sv: Värden som ges ut av en applikation eller skickas med metoden :meth:`!write` måste vara byte-strängar. Funktionen :func:`!start_response` och environ måste använda inbyggda strängar. De två kan inte blandas.

source: For server implementers writing CGI-to-WSGI pathways or other CGI-style protocols, the users must to be able access the environment using native strings even though the underlying platform may have a different convention. To bridge this gap, the :mod:`wsgiref` module has a new function, :func:`wsgiref.handlers.read_environ` for transcoding CGI variables from :data:`os.environ` into native strings and returning a new dictionary.
sv: För serverimplementerare som skriver CGI-till-WSGI-vägar eller andra CGI-liknande protokoll måste användarna kunna komma åt miljön med hjälp av inbyggda strängar även om den underliggande plattformen kan ha en annan konvention. För att överbrygga detta gap har modulen :mod:`wsgiref` en ny funktion, :func:`wsgiref.handlers.read_environ` för omkodning av CGI-variabler från :data:`os.environ` till inbyggda strängar och returnering av en ny ordbok.

source: :pep:`3333` - Python Web Server Gateway Interface v1.0.1
sv: :pep:`3333` - Python Web Server Gateway-gränssnitt v1.0.1

source: PEP written by Phillip Eby.
sv: PEP skriven av Phillip Eby.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:

source: String formatting for :func:`format` and :meth:`str.format` gained new capabilities for the format character **#**. Previously, for integers in binary, octal, or hexadecimal, it caused the output to be prefixed with '0b', '0o', or '0x' respectively. Now it can also handle floats, complex, and Decimal, causing the output to always have a decimal point even when no digits follow it.
sv: Strängformatering för :func:`format` och :meth:`str.format` har fått nya möjligheter för formattecknet **#**. Tidigare, för heltal i binär, oktal eller hexadecimal, orsakade det att utdata prefixades med '0b', '0o' eller '0x' respektive. Nu kan den även hantera flyttal, komplex och decimal, vilket gör att utdata alltid har en decimalpunkt även om inga siffror följer efter den.

source: (Suggested by Mark Dickinson and implemented by Eric Smith in :issue:`7094`.)
sv: (Föreslagen av Mark Dickinson och implementerad av Eric Smith i :issue:`7094`.)

source: There is also a new :meth:`str.format_map` method that extends the capabilities of the existing :meth:`str.format` method by accepting arbitrary :term:`mapping` objects. This new method makes it possible to use string formatting with any of Python's many dictionary-like objects such as :class:`~collections.defaultdict`, :class:`~shelve.Shelf`, :class:`~configparser.ConfigParser`, or :mod:`dbm`. It is also useful with custom :class:`dict` subclasses that normalize keys before look-up or that supply a :meth:`__missing__` method for unknown keys::
sv: Det finns också en ny metod :meth:`str.format_map` som utökar möjligheterna med den befintliga metoden :meth:`str.format` genom att acceptera godtyckliga :term:`mapping`-objekt. Den här nya metoden gör det möjligt att använda strängformatering med något av Pythons många ordboksliknande objekt som :class:`~collections.defaultdict`, :class:`~shelve.Shelf`, :class:`~configparser.ConfigParser` eller :mod:`dbm`. Det är också användbart med anpassade :class:`dict`-underklasser som normaliserar nycklar före uppslagning eller som tillhandahåller en :meth:`__missing__`-metod för okända nycklar::

source: >>> import shelve >>> d = shelve.open('tmp.shl') >>> 'The {project_name} status is {status} as of {date}'.format_map(d) 'The testing project status is green as of February 15, 2011' >>> class LowerCasedDict(dict): ... def __getitem__(self, key): ... return dict.__getitem__(self, key.lower()) ... >>> lcd = LowerCasedDict(part='widgets', quantity=10) >>> 'There are {QUANTITY} {Part} in stock'.format_map(lcd) 'There are 10 widgets in stock' >>> class PlaceholderDict(dict): ... def __missing__(self, key): ... return '<{}>'.format(key) ... >>> 'Hello {name}, welcome to {location}'.format_map(PlaceholderDict()) 'Hello <name>, welcome to <location>'
sv: &gt;&gt;&gt; import shelve &gt;&gt;&gt; d = shelve.open('tmp.shl') &gt;&gt;&gt; 'Status för {project_name} är {status} från och med {date}'.format_map(d) "Testprojektets status är grön från och med den 15 februari 2011 &gt;&gt;&gt; klass LowerCasedDict(dict): ... def __getitem__(self, key): ... return dict.__getitem__(self, key.lower()) ... &gt;&gt;&gt; lcd = LowerCasedDict(part='widgets', quantity=10) &gt;&gt;&gt; 'Det finns {QUANTITY} {Part} i lager'.format_map(lcd) 'Det finns 10 widgets i lager' &gt;&gt;&gt; klass PlaceholderDict(dict): ... def __missing__(self, key): ... return '&lt;{}&gt;'.format(nyckel) ... &gt;&gt;&gt; 'Hej {name}, välkommen till {location}'.format_map(PlatshållareDict()) 'Hej <name>, välkommen till <location>'

source: (Suggested by Raymond Hettinger and implemented by Eric Smith in :issue:`6081`.)
sv: (Föreslagen av Raymond Hettinger och implementerad av Eric Smith i :issue:`6081`.)

source: The interpreter can now be started with a quiet option, ``-q``, to prevent the copyright and version information from being displayed in the interactive mode. The option can be introspected using the :data:`sys.flags` attribute:
sv: Tolken kan nu startas med ett tyst alternativ, ``-q``, som förhindrar att information om copyright och version visas i det interaktiva läget. Alternativet kan introspekteras med hjälp av attributet :data:`sys.flags`:

source: (Contributed by Marcin Wojdyr in :issue:`1772833`).
sv: (Bidrag från Marcin Wojdyr i :issue:`1772833`).

source: The :func:`hasattr` function works by calling :func:`getattr` and detecting whether an exception is raised. This technique allows it to detect methods created dynamically by :meth:`~object.__getattr__` or :meth:`~object.__getattribute__` which would otherwise be absent from the class dictionary. Formerly, *hasattr* would catch any exception, possibly masking genuine errors. Now, *hasattr* has been tightened to only catch :exc:`AttributeError` and let other exceptions pass through::
sv: Funktionen :func:`hasattr` fungerar genom att anropa :func:`getattr` och upptäcka om ett undantag uppstår. Denna teknik gör det möjligt att upptäcka metoder som skapas dynamiskt av :meth:`~object.__getattr__` eller :meth:`~object.__getattribute__` som annars inte skulle finnas med i klassordlistan. Tidigare skulle *hasattr* fånga upp alla undantag och eventuellt maskera verkliga fel. Nu har *hasattr* stramats upp så att den bara fångar :exc:`AttributeError` och låter andra undantag passera igenom::

source: >>> class A: ... @property ... def f(self): ... return 1 // 0 ... >>> a = A() >>> hasattr(a, 'f') Traceback (most recent call last): ... ZeroDivisionError: integer division or modulo by zero
sv: >>> klass A: ... @egenskap ... def f(self): ... return 1 // 0 ... >>> a = A() >>> hasattr(a, 'f') Traceback (senaste anropet sist): ... ZeroDivisionError: heltalsdivision eller modulo med noll

source: (Discovered by Yury Selivanov and fixed by Benjamin Peterson; :issue:`9666`.)
sv: (Upptäckt av Yury Selivanov och åtgärdad av Benjamin Peterson; :issue:`9666`.)

source: The :func:`str` of a float or complex number is now the same as its :func:`repr`. Previously, the :func:`str` form was shorter but that just caused confusion and is no longer needed now that the shortest possible :func:`repr` is displayed by default:
sv: :func:`str` för ett flytande eller komplext tal är nu samma som dess :func:`repr`. Tidigare var :func:`str` kortare men det skapade bara förvirring och behövs inte längre nu när den kortaste möjliga :func:`repr` visas som standard:

source: (Proposed and implemented by Mark Dickinson; :issue:`9337`.)
sv: (Föreslagen och implementerad av Mark Dickinson; :issue:`9337`.)

source: :class:`memoryview` objects now have a :meth:`~memoryview.release` method and they also now support the context management protocol. This allows timely release of any resources that were acquired when requesting a buffer from the original object.
sv: :class:`memoryview`-objekt har nu en :meth:`~memoryview.release`-metod och de stöder nu också protokollet för kontexthantering. Detta gör det möjligt att i rätt tid frigöra alla resurser som förvärvades när en buffert begärdes från det ursprungliga objektet.

source: (Added by Antoine Pitrou; :issue:`9757`.)
sv: (Tillagd av Antoine Pitrou; :issue:`9757`.)

source: Previously it was illegal to delete a name from the local namespace if it occurs as a free variable in a nested block::
sv: Tidigare var det olagligt att ta bort ett namn från den lokala namnrymden om det förekom som en fri variabel i ett nästlat block::

source: def outer(x): def inner(): return x inner() del x
sv: def outer(x): def inner(): returnera x inner() del x

source: This is now allowed. Remember that the target of an :keyword:`except` clause is cleared, so this code which used to work with Python 2.6, raised a :exc:`SyntaxError` with Python 3.1 and now works again::
sv: Detta är nu tillåtet. Kom ihåg att målet för en :keyword:`except`-sats rensas, så den här koden som brukade fungera med Python 2.6, gav upphov till ett :exc:`SyntaxError` med Python 3.1 och fungerar nu igen::

source: def f(): def print_error(): print(e) try: something except Exception as e: print_error() # implicit "del e" here
sv: def f(): def print_error(): print(e) försök: något except Exception as e: print_error() # implicit "del e" här

source: (See :issue:`4617`.)
sv: (Se :issue:`4617`.)

source: :ref:`Struct sequence types <struct-sequence-objects>` are now subclasses of tuple. This means that C structures like those returned by :func:`os.stat`, :func:`time.gmtime`, and :data:`sys.version_info` now work like a :term:`named tuple` and now work with functions and methods that expect a tuple as an argument. This is a big step forward in making the C structures as flexible as their pure Python counterparts:
sv: :ref:`Struct sequence types <struct-sequence-objects>` är nu underklasser till tuple. Detta innebär att C-strukturer som de som returneras av :func:`os.stat`, :func:`time.gmtime` och :data:`sys.version_info` nu fungerar som en :term:`named tuple` och nu fungerar med funktioner och metoder som förväntar sig en tuple som argument. Detta är ett stort steg framåt när det gäller att göra C-strukturerna lika flexibla som deras rena Python-motsvarigheter:

source: (Suggested by Arfrever Frehtes Taifersar Arahesis and implemented by Benjamin Peterson in :issue:`8413`.)
sv: (Föreslagen av Arfrever Frehtes Taifersar Arahesis och implementerad av Benjamin Peterson i :issue:`8413`.)

source: Warnings are now easier to control using the :envvar:`PYTHONWARNINGS` environment variable as an alternative to using ``-W`` at the command line:
sv: Det är nu lättare att kontrollera varningar med hjälp av miljövariabeln :envvar:`PYTHONWARNINGS` som ett alternativ till att använda ``-W`` på kommandoraden:

source: (Suggested by Barry Warsaw and implemented by Philip Jenvey in :issue:`7301`.)
sv: (Föreslagen av Barry Warsaw och implementerad av Philip Jenvey i :issue:`7301`.)

source: A new warning category, :exc:`ResourceWarning`, has been added. It is emitted when potential issues with resource consumption or cleanup are detected. It is silenced by default in normal release builds but can be enabled through the means provided by the :mod:`warnings` module, or on the command line.
sv: En ny varningskategori, :exc:`ResourceWarning`, har lagts till. Den utfärdas när potentiella problem med resursförbrukning eller -rensning upptäcks. Den är avstängd som standard i normala versionsbyggen, men kan aktiveras med hjälp av modulen :mod:`warnings` eller på kommandoraden.

source: A :exc:`ResourceWarning` is issued at interpreter shutdown if the :data:`gc.garbage` list isn't empty, and if :const:`gc.DEBUG_UNCOLLECTABLE` is set, all uncollectable objects are printed. This is meant to make the programmer aware that their code contains object finalization issues.
sv: En :exc:`ResourceWarning` utfärdas när tolken stängs av om listan :data:`gc.garbage` inte är tom, och om :const:`gc.DEBUG_UNCOLLECTABLE` är inställd skrivs alla objekt som inte kan samlas in ut. Detta är tänkt att göra programmeraren medveten om att deras kod innehåller problem med att avsluta objekt.

source: A :exc:`ResourceWarning` is also issued when a :term:`file object` is destroyed without having been explicitly closed. While the deallocator for such object ensures it closes the underlying operating system resource (usually, a file descriptor), the delay in deallocating the object could produce various issues, especially under Windows. Here is an example of enabling the warning from the command line:
sv: En :exc:`ResourceWarning` utfärdas också när ett :term:`filobjekt` förstörs utan att uttryckligen ha stängts. Även om deallokeringen för ett sådant objekt säkerställer att den underliggande operativsystemresursen (vanligtvis en filbeskrivare) stängs, kan fördröjningen i deallokeringen av objektet ge upphov till olika problem, särskilt under Windows. Här är ett exempel på hur du aktiverar varningen från kommandoraden:

source: $ python -q -Wdefault >>> f = open("foo", "wb") >>> del f __main__:1: ResourceWarning: unclosed file <_io.BufferedWriter name='foo'>
sv: $ python -q -Wdefault >>> f = öppen("foo", "wb") >>> del f __main__:1: ResourceWarning: ej stängd fil <_io.BufferedWriter name='foo'>

source: (Added by Antoine Pitrou and Georg Brandl in :issue:`10093` and :issue:`477863`.)
sv: (Tillagd av Antoine Pitrou och Georg Brandl i :issue:`10093` och :issue:`477863`.)

source: :class:`range` objects now support *index* and *count* methods. This is part of an effort to make more objects fully implement the :class:`collections.Sequence <collections.abc.Sequence>` :term:`abstract base class`. As a result, the language will have a more uniform API. In addition, :class:`range` objects now support slicing and negative indices, even with values larger than :data:`sys.maxsize`. This makes *range* more interoperable with lists::
sv: :class:`range`-objekt har nu stöd för metoderna *index* och *count*. Detta är en del av ett försök att få fler objekt att fullt ut implementera :class:`collections.Sequence <collections.abc.Sequence>` :term:`abstrakt basklass`. Som ett resultat kommer språket att ha ett mer enhetligt API. Dessutom stöder :class:`range`-objekt nu skivning och negativa index, även med värden som är större än :data:`sys.maxsize`. Detta gör *range* mer kompatibelt med listor::

source: >>> range(0, 100, 2).count(10) 1 >>> range(0, 100, 2).index(10) 5 >>> range(0, 100, 2)[5] 10 >>> range(0, 100, 2)[0:5] range(0, 10, 2)
sv: >>> intervall(0, 100, 2).räkna(10) 1 >>> intervall(0, 100, 2).index(10) 5 >>> intervall(0, 100, 2)[5] 10 >>> intervall(0, 100, 2)[0:5] intervall(0, 10, 2)

source: (Contributed by Daniel Stutzbach in :issue:`9213`, by Alexander Belopolsky in :issue:`2690`, and by Nick Coghlan in :issue:`10889`.)
sv: (Bidrag från Daniel Stutzbach i :issue:`9213`, av Alexander Belopolsky i :issue:`2690`, och av Nick Coghlan i :issue:`10889`.)

source: The :func:`callable` builtin function from Py2.x was resurrected. It provides a concise, readable alternative to using an :term:`abstract base class` in an expression like ``isinstance(x, collections.Callable)``:
sv: Den inbyggda funktionen :func:`callable` från Py2.x har återuppstått. Den ger ett kortfattat och läsbart alternativ till att använda en :term:`abstrakt basklass` i ett uttryck som ``isinstance(x, collections.Callable)``:

source: (See :issue:`10518`.)
sv: (Se :issue:`10518`.)

source: Python's import mechanism can now load modules installed in directories with non-ASCII characters in the path name. This solved an aggravating problem with home directories for users with non-ASCII characters in their usernames.
sv: Pythons importmekanism kan nu läsa in moduler som är installerade i kataloger med icke-ASCII-tecken i sökvägsnamnet. Detta löste ett irriterande problem med hemkataloger för användare med icke-ASCII-tecken i sina användarnamn.

source: (Required extensive work by Victor Stinner in :issue:`9425`.)
sv: (Krävde omfattande arbete av Victor Stinner i :issue:`9425`.)

source: New, Improved, and Deprecated Modules
sv: Nya, förbättrade och utfasade moduler

source: Python's standard library has undergone significant maintenance efforts and quality improvements.
sv: Pythons standardbibliotek har genomgått betydande underhållsinsatser och kvalitetsförbättringar.

source: The biggest news for Python 3.2 is that the :mod:`email` package, :mod:`mailbox` module, and :mod:`!nntplib` modules now work correctly with the bytes/text model in Python 3. For the first time, there is correct handling of messages with mixed encodings.
sv: Den största nyheten för Python 3.2 är att :mod:`email`-paketet, :mod:`mailbox`-modulen och :mod:`!nntplib`-modulerna nu fungerar korrekt med bytes/text-modellen i Python 3. För första gången finns det korrekt hantering av meddelanden med blandade kodningar.

source: Throughout the standard library, there has been more careful attention to encodings and text versus bytes issues. In particular, interactions with the operating system are now better able to exchange non-ASCII data using the Windows MBCS encoding, locale-aware encodings, or UTF-8.
sv: I hela standardbiblioteket har frågor om kodning och text kontra bytes uppmärksammats mer noggrant. I synnerhet kan interaktioner med operativsystemet nu bättre utbyta icke-ASCII-data med hjälp av Windows MBCS-kodning, lokalmedvetna kodningar eller UTF-8.

source: Another significant win is the addition of substantially better support for *SSL* connections and security certificates.
sv: En annan viktig nyhet är att stödet för *SSL*-anslutningar och säkerhetscertifikat har förbättrats avsevärt.

source: In addition, more classes now implement a :term:`context manager` to support convenient and reliable resource clean-up using a :keyword:`with` statement.
sv: Dessutom implementerar nu fler klasser en :term:`context manager` för att stödja bekväm och tillförlitlig resursrensning med hjälp av en :keyword:`with`-sats.

source: email
sv: e-post

source: The usability of the :mod:`email` package in Python 3 has been mostly fixed by the extensive efforts of R. David Murray. The problem was that emails are typically read and stored in the form of :class:`bytes` rather than :class:`str` text, and they may contain multiple encodings within a single email. So, the email package had to be extended to parse and generate email messages in bytes format.
sv: Användbarheten av :mod:`email`-paketet i Python 3 har till stor del åtgärdats genom R. David Murrays omfattande arbete. Problemet var att e-postmeddelanden vanligtvis läses och lagras i form av :class:`bytes` snarare än :class:`str` text, och de kan innehålla flera kodningar inom ett enda e-postmeddelande. Så e-postpaketet måste utökas för att analysera och generera e-postmeddelanden i bytesformat.

source: New functions :func:`~email.message_from_bytes` and :func:`~email.message_from_binary_file`, and new classes :class:`~email.parser.BytesFeedParser` and :class:`~email.parser.BytesParser` allow binary message data to be parsed into model objects.
sv: Med de nya funktionerna :func:`~email.message_from_bytes` och :func:`~email.message_from_binary_file` samt de nya klasserna :class:`~email.parser.BytesFeedParser` och :class:`~email.parser.BytesParser` kan binära meddelandedata analyseras till modellobjekt.

source: Given bytes input to the model, :meth:`~email.message.Message.get_payload` will by default decode a message body that has a :mailheader:`Content-Transfer-Encoding` of *8bit* using the charset specified in the MIME headers and return the resulting string.
sv: Med bytes som indata till modellen kommer :meth:`~email.message.Message.get_payload` som standard att avkoda en meddelandekropp som har en :mailheader:`Content-Transfer-Encoding` på *8bit* med hjälp av den teckenuppsättning som anges i MIME-rubrikerna och returnera den resulterande strängen.

source: Given bytes input to the model, :class:`~email.generator.Generator` will convert message bodies that have a :mailheader:`Content-Transfer-Encoding` of *8bit* to instead have a *7bit* :mailheader:`Content-Transfer-Encoding`.
sv: Givet bytes som indata till modellen kommer :class:`~email.generator.Generator` att konvertera meddelandekroppar som har en :mailheader:`Content-Transfer-Encoding` på *8bit* till att istället ha en *7bit* :mailheader:`Content-Transfer-Encoding`.
