Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: Also, the :class:`zipfile.ZipExtFile <zipfile.ZipFile.open>` class was reworked internally to represent files stored inside an archive. The new implementation is significantly faster and can be wrapped in an :class:`io.BufferedReader` object for more speedups. It also solves an issue where interleaved calls to *read* and *readline* gave the wrong results.
sv: Klassen :class:`zipfile.ZipExtFile <zipfile.ZipFile.open>` har också omarbetats internt för att representera filer som lagras i ett arkiv. Den nya implementeringen är betydligt snabbare och kan förpackas i ett :class:`io.BufferedReader`-objekt för att öka hastigheten ytterligare. Den löser också ett problem där sammanflätade anrop till *read* och *readline* gav fel resultat.

source: (Patch submitted by Nir Aides in :issue:`7610`.)
sv: (Patch inlämnad av Nir Aides i :issue:`7610`.)

source: tarfile
sv: tarfil

source: The :class:`~tarfile.TarFile` class can now be used as a context manager. In addition, its :meth:`~tarfile.TarFile.add` method has a new option, *filter*, that controls which files are added to the archive and allows the file metadata to be edited.
sv: Klassen :class:`~tarfile.TarFile` kan nu användas som en kontexthanterare. Dessutom har dess metod :meth:`~tarfile.TarFile.add` ett nytt alternativ, *filter*, som styr vilka filer som läggs till i arkivet och gör det möjligt att redigera filens metadata.

source: The new *filter* option replaces the older, less flexible *exclude* parameter which is now deprecated. If specified, the optional *filter* parameter needs to be a :term:`keyword argument`. The user-supplied filter function accepts a :class:`~tarfile.TarInfo` object and returns an updated :class:`~tarfile.TarInfo` object, or if it wants the file to be excluded, the function can return ``None``::
sv: Det nya alternativet *filter* ersätter den äldre, mindre flexibla parametern *exclude* som nu är föråldrad. Om den anges måste den valfria *filter*-parametern vara en :term:`nyckelordsargument`. Den användartillhandahållna filterfunktionen accepterar ett :class:`~tarfile.TarInfo`-objekt och returnerar ett uppdaterat :class:`~tarfile.TarInfo`-objekt, eller om den vill att filen ska uteslutas kan funktionen returnera ``None``::

source: >>> import tarfile, glob >>> def myfilter(tarinfo): ... if tarinfo.isfile(): # only save real files ... tarinfo.uname = 'monty' # redact the user name ... return tarinfo >>> with tarfile.open(name='myarchive.tar.gz', mode='w:gz') as tf: ... for filename in glob.glob('*.txt'): ... tf.add(filename, filter=myfilter) ... tf.list() -rw-r--r-- monty/501 902 2011-01-26 17:59:11 annotations.txt -rw-r--r-- monty/501 123 2011-01-26 17:59:11 general_questions.txt -rw-r--r-- monty/501 3514 2011-01-26 17:59:11 prion.txt -rw-r--r-- monty/501 124 2011-01-26 17:59:11 py_todo.txt -rw-r--r-- monty/501 1399 2011-01-26 17:59:11 semaphore_notes.txt
sv: >>> import tarfile, glob >>> def myfilter(tarinfo): ... if tarinfo.isfile(): # spara bara riktiga filer ... tarinfo.uname = 'monty' # redigera användarnamnet ... returnera tarinfo >>> med tarfile.open(name='myarchive.tar.gz', mode='w:gz') som tf: ... för filnamn i glob.glob('*.txt'): ... tf.add(filnamn, filter=mittfilter) ... tf.list() -rw-r--r-- monty/501 902 2011-01-26 17:59:11 annotations.txt -rw-r--r-- monty/501 123 2011-01-26 17:59:11 allmänna_frågor.txt -rw-r--r-- monty/501 3514 2011-01-26 17:59:11 prion.txt -rw-r--r-- monty/501 124 2011-01-26 17:59:11 py_todo.txt -rw-r--r-- monty/501 1399 2011-01-26 17:59:11 semaphore_notes.txt

source: (Proposed by Tarek Ziadé and implemented by Lars Gustäbel in :issue:`6856`.)
sv: (Föreslagen av Tarek Ziadé och implementerad av Lars Gustäbel i :issue:`6856`.)

source: The :mod:`hashlib` module has two new constant attributes listing the hashing algorithms guaranteed to be present in all implementations and those available on the current implementation::
sv: Modulen :mod:`hashlib` har två nya konstanta attribut som listar de hashingalgoritmer som garanterat finns i alla implementationer och de som är tillgängliga i den aktuella implementationen::

source: (Suggested by Carl Chenet in :issue:`7418`.)
sv: (Föreslagen av Carl Chenet i :issue:`7418`.)

source: The :mod:`ast` module has a wonderful a general-purpose tool for safely evaluating expression strings using the Python literal syntax. The :func:`ast.literal_eval` function serves as a secure alternative to the builtin :func:`eval` function which is easily abused. Python 3.2 adds :class:`bytes` and :class:`set` literals to the list of supported types: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, and ``None``.
sv: Modulen :mod:`ast` har ett underbart allmänt verktyg för säker utvärdering av uttryckssträngar med Pythons litterala syntax. Funktionen :func:`ast.literal_eval` fungerar som ett säkert alternativ till den inbyggda funktionen :func:`eval` som lätt kan missbrukas. Python 3.2 lägger till :class:`bytes` och :class:`set` literaler till listan över typer som stöds: strängar, bytes, tal, tupler, listor, dicts, set, booleaner och ``None``.

source: (Implemented by Benjamin Peterson and Georg Brandl.)
sv: (Implementerat av Benjamin Peterson och Georg Brandl.)

source: Different operating systems use various encodings for filenames and environment variables. The :mod:`os` module provides two new functions, :func:`~os.fsencode` and :func:`~os.fsdecode`, for encoding and decoding filenames:
sv: Olika operativsystem använder olika kodningar för filnamn och miljövariabler. Modulen :mod:`os` tillhandahåller två nya funktioner, :func:`~os.fsencode` och :func:`~os.fsdecode`, för kodning och avkodning av filnamn:

source: Some operating systems allow direct access to encoded bytes in the environment. If so, the :const:`os.supports_bytes_environ` constant will be true.
sv: Vissa operativsystem tillåter direkt åtkomst till kodade bytes i miljön. Om så är fallet kommer konstanten :const:`os.supports_bytes_environ` att vara true.

source: For direct access to encoded environment variables (if available), use the new :func:`os.getenvb` function or use :data:`os.environb` which is a bytes version of :data:`os.environ`.
sv: För direktåtkomst till kodade miljövariabler (om sådana finns), använd den nya funktionen :func:`os.getenvb` eller använd :data:`os.environb` som är en bytesversion av :data:`os.environ`.

source: (Contributed by Victor Stinner.)
sv: (Bidrag från Victor Stinner.)

source: The :func:`shutil.copytree` function has two new options:
sv: Funktionen :func:`shutil.copytree` har fått två nya alternativ:

source: *ignore_dangling_symlinks*: when ``symlinks=False`` so that the function copies a file pointed to by a symlink, not the symlink itself. This option will silence the error raised if the file doesn't exist.
sv: *ignore_dangling_symlinks*: när ``symlinks=False`` så att funktionen kopierar en fil som en symlänk pekar på, inte själva symlänken. Detta alternativ kommer att tysta felet som uppstår om filen inte existerar.

source: *copy_function*: is a callable that will be used to copy files. :func:`shutil.copy2` is used by default.
sv: *copy_function*: är en anropbar funktion som kommer att användas för att kopiera filer. :func:`shutil.copy2` används som standard.

source: (Contributed by Tarek Ziadé.)
sv: (Bidrag från Tarek Ziadé.)

source: In addition, the :mod:`shutil` module now supports :ref:`archiving operations <archiving-operations>` for zipfiles, uncompressed tarfiles, gzipped tarfiles, and bzipped tarfiles. And there are functions for registering additional archiving file formats (such as xz compressed tarfiles or custom formats).
sv: Dessutom har modulen :mod:`shutil` nu stöd för :ref:`archiving operations <archiving-operations>` för zipfiler, okomprimerade tarfiler, gzippade tarfiler och bzippade tarfiler. Det finns även funktioner för att registrera ytterligare filformat för arkivering (t.ex. xz-komprimerade tarfiler eller anpassade format).

source: The principal functions are :func:`~shutil.make_archive` and :func:`~shutil.unpack_archive`. By default, both operate on the current directory (which can be set by :func:`os.chdir`) and on any sub-directories. The archive filename needs to be specified with a full pathname. The archiving step is non-destructive (the original files are left unchanged).
sv: De viktigaste funktionerna är :func:`~shutil.make_archive` och :func:`~shutil.unpack_archive`. Som standard arbetar båda i den aktuella katalogen (som kan ställas in med :func:`os.chdir`) och i alla underkataloger. Arkivets filnamn måste specificeras med ett fullständigt sökvägsnamn. Arkiveringssteget är icke-destruktivt (originalfilerna lämnas oförändrade).

source: >>> import shutil, pprint >>> os.chdir('mydata') # change to the source directory >>> f = shutil.make_archive('/var/backup/mydata', ... 'zip') # archive the current directory >>> f # show the name of archive '/var/backup/mydata.zip' >>> os.chdir('tmp') # change to an unpacking >>> shutil.unpack_archive('/var/backup/mydata.zip') # recover the data >>> pprint.pprint(shutil.get_archive_formats()) # display known formats [('bztar', "bzip2'ed tar-file"), ('gztar', "gzip'ed tar-file"), ('tar', 'uncompressed tar file'), ('zip', 'ZIP file')] >>> shutil.register_archive_format( # register a new archive format ... name='xz', ... function=xz.compress, # callable archiving function ... extra_args=[('level', 8)], # arguments to the function ... description='xz compression' ... )
sv: >>> import shutil, pprint >>> os.chdir('mydata') # byt till källkatalogen >>> f = shutil.make_archive('/var/backup/mydata', ... 'zip') # arkivera den aktuella katalogen >>> f # visa namnet på arkivet '/var/backup/mydata.zip' >>> os.chdir('tmp') # byt till en uppackning >>> shutil.unpack_archive('/var/backup/mydata.zip') # återställ data >>> pprint.pprint(shutil.get_archive_formats()) # visa kända format [('bztar', "bzip2'ed tar-fil"), ('gztar', "gzip'ed tar-fil"), ('tar', 'okomprimerad tar-fil'), ('zip', 'ZIP-fil')] >>> shutil.register_archive_format( # registrera ett nytt arkivformat ... namn='xz', ... function=xz.compress, # anropsbar arkiveringsfunktion ... extra_args=[('level', 8)], # argument till funktionen ... description='xz-komprimering' ... )

source: The :mod:`sqlite3` module was updated to pysqlite version 2.6.0. It has two new capabilities.
sv: Modulen :mod:`sqlite3` har uppdaterats till pysqlite version 2.6.0. Den har två nya funktioner.

source: The :attr:`!sqlite3.Connection.in_transit` attribute is true if there is an active transaction for uncommitted changes.
sv: Attributet :attr:`!sqlite3.Connection.in_transit` är sant om det finns en aktiv transaktion för ändringar som inte har bekräftats.

source: The :meth:`sqlite3.Connection.enable_load_extension` and :meth:`sqlite3.Connection.load_extension` methods allows you to load SQLite extensions from ".so" files. One well-known extension is the fulltext-search extension distributed with SQLite.
sv: Med metoderna :meth:`sqlite3.Connection.enable_load_extension` och :meth:`sqlite3.Connection.load_extension` kan du ladda SQLite-tillägg från ".so"-filer. Ett välkänt tillägg är fulltextsökningstillägget som distribueras med SQLite.

source: (Contributed by R. David Murray and Shashwat Anand; :issue:`8845`.)
sv: (Bidrag från R. David Murray och Shashwat Anand; :issue:`8845`.)

source: A new :mod:`html` module was introduced with only a single function, :func:`~html.escape`, which is used for escaping reserved characters from HTML markup:
sv: En ny :mod:`html`-modul introducerades med endast en enda funktion, :func:`~html.escape`, som används för att undkomma reserverade tecken från HTML-markup:

source: socket
sv: kortplats

source: The :mod:`socket` module has two new improvements.
sv: Modulen :mod:`socket` har fått två nya förbättringar.

source: Socket objects now have a :meth:`~socket.socket.detach` method which puts the socket into closed state without actually closing the underlying file descriptor. The latter can then be reused for other purposes. (Added by Antoine Pitrou; :issue:`8524`.)
sv: Socket-objekt har nu en :meth:`~socket.socket.detach`-metod som sätter sockeln i stängt tillstånd utan att faktiskt stänga den underliggande filbeskrivaren. Den senare kan sedan återanvändas för andra ändamål. (Tillagd av Antoine Pitrou; :issue:`8524`.)

source: :func:`socket.create_connection` now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the socket when done. (Contributed by Giampaolo Rodolà; :issue:`9794`.)
sv: :func:`socket.create_connection` stöder nu kontexthanteringsprotokollet för att ovillkorligen konsumera :exc:`socket.error` undantag och för att stänga uttaget när det är klart. (Bidrag från Giampaolo Rodolà; :issue:`9794`.)

source: The :mod:`ssl` module added a number of features to satisfy common requirements for secure (encrypted, authenticated) internet connections:
sv: Modulen :mod:`ssl` lade till ett antal funktioner för att uppfylla vanliga krav på säkra (krypterade, autentiserade) Internetanslutningar:

source: A new class, :class:`~ssl.SSLContext`, serves as a container for persistent SSL data, such as protocol settings, certificates, private keys, and various other options. It includes a :meth:`~ssl.SSLContext.wrap_socket` for creating an SSL socket from an SSL context.
sv: En ny klass, :class:`~ssl.SSLContext`, fungerar som en behållare för beständig SSL-data, t.ex. protokollinställningar, certifikat, privata nycklar och olika andra alternativ. Den innehåller en :meth:`~ssl.SSLContext.wrap_socket` för att skapa ett SSL-uttag från en SSL-kontext.

source: A new function, :func:`!ssl.match_hostname`, supports server identity verification for higher-level protocols by implementing the rules of HTTPS (from :rfc:`2818`) which are also suitable for other protocols.
sv: En ny funktion, :func:`!ssl.match_hostname`, stöder verifiering av serveridentitet för protokoll på högre nivå genom att implementera reglerna för HTTPS (från :rfc:`2818`) som också är lämpliga för andra protokoll.

source: The :func:`ssl.wrap_socket() <ssl.SSLContext.wrap_socket>` constructor function now takes a *ciphers* argument. The *ciphers* string lists the allowed encryption algorithms using the format described in the `OpenSSL documentation <https://docs.openssl.org/1.0.2/man1/ciphers/#cipher-list-format>`__.
sv: Konstruktorfunktionen :func:`ssl.wrap_socket() <ssl.SSLContext.wrap_socket>` tar nu ett *ciphers*-argument. Strängen *ciphers* listar de tillåtna krypteringsalgoritmerna i det format som beskrivs i `OpenSSL-dokumentationen <https://docs.openssl.org/1.0.2/man1/ciphers/#cipher-list-format>`__.

source: When linked against recent versions of OpenSSL, the :mod:`ssl` module now supports the Server Name Indication extension to the TLS protocol, allowing multiple "virtual hosts" using different certificates on a single IP port. This extension is only supported in client mode, and is activated by passing the *server_hostname* argument to :meth:`ssl.SSLContext.wrap_socket`.
sv: När modulen :mod:`ssl` länkas mot de senaste versionerna av OpenSSL stöder den nu tillägget Server Name Indication till TLS-protokollet, vilket möjliggör flera "virtuella värdar" som använder olika certifikat på en enda IP-port. Detta tillägg stöds endast i klientläge och aktiveras genom att skicka argumentet *server_hostname* till :meth:`ssl.SSLContext.wrap_socket`.

source: Various options have been added to the :mod:`ssl` module, such as :data:`~ssl.OP_NO_SSLv2` which disables the insecure and obsolete SSLv2 protocol.
sv: Olika alternativ har lagts till i modulen :mod:`ssl`, t.ex. :data:`~ssl.OP_NO_SSLv2` som inaktiverar det osäkra och föråldrade SSLv2-protokollet.

source: The extension now loads all the OpenSSL ciphers and digest algorithms. If some SSL certificates cannot be verified, they are reported as an "unknown algorithm" error.
sv: Tillägget laddar nu alla OpenSSL-chiffer och digest-algoritmer. Om vissa SSL-certifikat inte kan verifieras rapporteras de som ett "okänd algoritm"-fel.

source: The version of OpenSSL being used is now accessible using the module attributes :const:`ssl.OPENSSL_VERSION` (a string), :const:`ssl.OPENSSL_VERSION_INFO` (a 5-tuple), and :const:`ssl.OPENSSL_VERSION_NUMBER` (an integer).
sv: Den version av OpenSSL som används är nu tillgänglig med hjälp av modulattributen :const:`ssl.OPENSSL_VERSION` (en sträng), :const:`ssl.OPENSSL_VERSION_INFO` (en 5-tupel) och :const:`ssl.OPENSSL_VERSION_NUMBER` (ett heltal).

source: (Contributed by Antoine Pitrou in :issue:`8850`, :issue:`1589`, :issue:`8322`, :issue:`5639`, :issue:`4870`, :issue:`8484`, and :issue:`8321`.)
sv: (Bidrag från Antoine Pitrou i :issue:`8850`, :issue:`1589`, :issue:`8322`, :issue:`5639`, :issue:`4870`, :issue:`8484` och :issue:`8321`.)

source: The :mod:`!nntplib` module has a revamped implementation with better bytes and text semantics as well as more practical APIs. These improvements break compatibility with the nntplib version in Python 3.1, which was partly dysfunctional in itself.
sv: Modulen :mod:`!nntplib` har en omarbetad implementation med bättre bytes- och textsemantik samt mer praktiska API:er. Dessa förbättringar bryter kompatibiliteten med nntplib-versionen i Python 3.1, som i sig själv var delvis dysfunktionell.

source: Support for secure connections through both implicit (using :class:`!nntplib.NNTP_SSL`) and explicit (using :meth:`!nntplib.NNTP.starttls`) TLS has also been added.
sv: Stöd för säkra anslutningar genom både implicit (med :class:`!nntplib.NNTP_SSL`) och explicit (med :meth:`!nntplib.NNTP.starttls`) TLS har också lagts till.

source: (Contributed by Antoine Pitrou in :issue:`9360` and Andrew Vant in :issue:`1926`.)
sv: (Bidrag från Antoine Pitrou i :issue:`9360` och Andrew Vant i :issue:`1926`.)

source: certificates
sv: certifikat

source: :class:`http.client.HTTPSConnection`, :class:`urllib.request.HTTPSHandler` and :func:`urllib.request.urlopen` now take optional arguments to allow for server certificate checking against a set of Certificate Authorities, as recommended in public uses of HTTPS.
sv: :class:`http.client.HTTPSConnection`, :class:`urllib.request.HTTPSHandler` och :func:`urllib.request.urlopen` tar nu valfria argument för att möjliggöra kontroll av servercertifikat mot en uppsättning certifikatutfärdare, vilket rekommenderas i offentliga användningar av HTTPS.

source: (Added by Antoine Pitrou, :issue:`9003`.)
sv: (Tillagd av Antoine Pitrou, :issue:`9003`.)

source: Support for explicit TLS on standard IMAP4 connections has been added through the new :mod:`imaplib.IMAP4.starttls` method.
sv: Stöd för explicit TLS på standard IMAP4-anslutningar har lagts till genom den nya metoden :mod:`imaplib.IMAP4.starttls`.

source: (Contributed by Lorenzo M. Catucci and Antoine Pitrou, :issue:`4471`.)
sv: (Bidrag från Lorenzo M. Catucci och Antoine Pitrou, :issue:`4471`.)

source: http.client
sv: http.klient

source: There were a number of small API improvements in the :mod:`http.client` module. The old-style HTTP 0.9 simple responses are no longer supported and the *strict* parameter is deprecated in all classes.
sv: Det har gjorts ett antal små API-förbättringar i modulen :mod:`http.client`. De gamla enkla HTTP 0.9-svaren stöds inte längre och parametern *strict* är avskriven i alla klasser.

source: The :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` classes now have a *source_address* parameter for a (host, port) tuple indicating where the HTTP connection is made from.
sv: Klasserna :class:`~http.client.HTTPConnection` och :class:`~http.client.HTTPSConnection` har nu en *source_address*-parameter för en (host, port)-tupel som anger varifrån HTTP-anslutningen görs.

source: Support for certificate checking and HTTPS virtual hosts were added to :class:`~http.client.HTTPSConnection`.
sv: Stöd för certifikatkontroll och virtuella HTTPS-värdar har lagts till i :class:`~http.client.HTTPSConnection`.

source: The :meth:`~http.client.HTTPConnection.request` method on connection objects allowed an optional *body* argument so that a :term:`file object` could be used to supply the content of the request. Conveniently, the *body* argument now also accepts an :term:`iterable` object so long as it includes an explicit ``Content-Length`` header. This extended interface is much more flexible than before.
sv: Metoden :meth:`~http.client.HTTPConnection.request` på anslutningsobjekt tillät ett valfritt *body*-argument så att ett :term:`file-objekt` kunde användas för att tillhandahålla innehållet i begäran. Lämpligt nog accepterar *body*-argumentet nu också ett :term:`iterable`-objekt så länge det innehåller en explicit ``Content-Length``-rubrik. Detta utökade gränssnitt är mycket mer flexibelt än tidigare.

source: To establish an HTTPS connection through a proxy server, there is a new :meth:`~http.client.HTTPConnection.set_tunnel` method that sets the host and port for HTTP Connect tunneling.
sv: För att upprätta en HTTPS-anslutning via en proxyserver finns det en ny metod :meth:`~http.client.HTTPConnection.set_tunnel` som anger värd och port för HTTP Connect-tunnel.

source: To match the behavior of :mod:`http.server`, the HTTP client library now also encodes headers with ISO-8859-1 (Latin-1) encoding. It was already doing that for incoming headers, so now the behavior is consistent for both incoming and outgoing traffic. (See work by Armin Ronacher in :issue:`10980`.)
sv: För att matcha beteendet hos :mod:`http.server` kodar HTTP-klientbiblioteket nu även headers med ISO-8859-1 (Latin-1)-kodning. Det gjorde det redan för inkommande rubriker, så nu är beteendet konsekvent för både inkommande och utgående trafik. (Se arbete av Armin Ronacher i :issue:`10980`.)

source: The unittest module has a number of improvements supporting test discovery for packages, easier experimentation at the interactive prompt, new testcase methods, improved diagnostic messages for test failures, and better method names.
sv: Modulen unittest har ett antal förbättringar som stöder testupptäckt för paket, enklare experimentering vid den interaktiva prompten, nya testfallsmetoder, förbättrade diagnosmeddelanden för testfel och bättre metodnamn.

source: The command-line call ``python -m unittest`` can now accept file paths instead of module names for running specific tests (:issue:`10620`). The new test discovery can find tests within packages, locating any test importable from the top-level directory. The top-level directory can be specified with the ``-t`` option, a pattern for matching files with ``-p``, and a directory to start discovery with ``-s``:
sv: Kommandoradsanropet ``python -m unittest`` kan nu acceptera filvägar istället för modulnamn för att köra specifika tester (:issue:`10620`). Den nya testupptäckten kan hitta tester inom paket och lokalisera alla tester som kan importeras från toppnivåkatalogen. Toppnivåkatalogen kan anges med alternativet ``-t``, ett mönster för att matcha filer med ``-p`` och en katalog för att starta upptäckten med ``-s``:

source: $ python -m unittest discover -s my_proj_dir -p _test.py
sv: $ python -m unittest discover -s min_proj_dir -p _test.py

source: (Contributed by Michael Foord.)
sv: (Bidrag från Michael Foord.)

source: Experimentation at the interactive prompt is now easier because the :class:`unittest.TestCase` class can now be instantiated without arguments:
sv: Det är nu enklare att experimentera i den interaktiva prompten eftersom klassen :class:`unittest.TestCase` nu kan instansieras utan argument:
