Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: There is support for pluggable interpolation including an additional interpolation handler :class:`~configparser.ExtendedInterpolation`::
sv: Det finns stöd för pluggbar interpolering inklusive en extra interpolationshanterare :class:`~configparser.ExtendedInterpolation`::

source: >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> parser.read_dict({'buildout': {'directory': '/home/ambv/zope9'}, ... 'custom': {'prefix': '/usr/local'}}) >>> parser.read_string(""" ... [buildout] ... parts = ... zope9 ... instance ... find-links = ... ${buildout:directory}/downloads/dist ... ... [zope9] ... recipe = plone.recipe.zope9install ... location = /opt/zope ... ... [instance] ... recipe = plone.recipe.zope9instance ... zope9-location = ${zope9:location} ... zope-conf = ${custom:prefix}/etc/zope.conf ... """) >>> parser['buildout']['find-links'] '\n/home/ambv/zope9/downloads/dist' >>> parser['instance']['zope-conf'] '/usr/local/etc/zope.conf' >>> instance = parser['instance'] >>> instance['zope-conf'] '/usr/local/etc/zope.conf' >>> instance['zope9-location'] '/opt/zope'
sv: >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> parser.read_dict({'buildout': {'directory': '/home/ambv/zope9'}, ... 'custom': {"prefix": "/usr/local"}}) >>> parser.read_string(""" ... [buildout] ... delar = ... zope9 ... instans ... hitta länkar = ... ${buildout:directory}/nedladdningar/dist ... ... [zope9] ... recept = plone.recipe.zope9install ... plats = /opt/zope ... ... [instance] ... recept = plone.recipe.zope9instance ... zope9-placering = ${zope9:location} ... zope-conf = ${custom:prefix}/etc/zope.conf ... """) >>> parser['buildout']['find-links'] '\n/home/ambv/zope9/downloads/dist' >>> parser['instance']['zope-conf'] '/usr/local/etc/zope.conf' >>> instans = parser['instans'] >>> instans['zope-conf'] '/usr/local/etc/zope.conf' >>> instans['zope9-placering'] '/opt/zope'

source: A number of smaller features were also introduced, like support for specifying encoding in read operations, specifying fallback values for get-functions, or reading directly from dictionaries and strings.
sv: Ett antal mindre funktioner introducerades också, som stöd för att ange kodning i läsoperationer, ange reservvärden för get-funktioner eller läsa direkt från ordböcker och strängar.

source: (All changes contributed by Łukasz Langa.)
sv: (Alla ändringar har gjorts av Łukasz Langa.)

source: A number of usability improvements were made for the :mod:`urllib.parse` module.
sv: Ett antal förbättringar av användbarheten har gjorts för modulen :mod:`urllib.parse`.

source: The :func:`~urllib.parse.urlparse` function now supports `IPv6 <https://en.wikipedia.org/wiki/IPv6>`_ addresses as described in :rfc:`2732`:
sv: Funktionen :func:`~urllib.parse.urlparse` stöder nu `IPv6 <https://en.wikipedia.org/wiki/IPv6>`_-adresser enligt beskrivningen i :rfc:`2732`:

source: The :func:`~urllib.parse.urldefrag` function now returns a :term:`named tuple`::
sv: Funktionen :func:`~urllib.parse.urldefrag` returnerar nu en :term:`named tuple`::

source: And, the :func:`~urllib.parse.urlencode` function is now much more flexible, accepting either a string or bytes type for the *query* argument. If it is a string, then the *safe*, *encoding*, and *error* parameters are sent to :func:`~urllib.parse.quote_plus` for encoding::
sv: Och funktionen :func:`~urllib.parse.urlencode` är nu mycket mer flexibel och accepterar antingen en sträng eller en bytes-typ för argumentet *query*. Om det är en sträng skickas parametrarna *safe*, *encoding* och *error* till :func:`~urllib.parse.quote_plus` för kodning:

source: As detailed in :ref:`parsing-ascii-encoded-bytes`, all the :mod:`urllib.parse` functions now accept ASCII-encoded byte strings as input, so long as they are not mixed with regular strings. If ASCII-encoded byte strings are given as parameters, the return types will also be an ASCII-encoded byte strings:
sv: Som beskrivs i :ref:`parsing-ascii-encoded-bytes`, accepterar nu alla :mod:`urllib.parse`-funktioner ASCII-kodade bytesträngar som indata, så länge de inte blandas med vanliga strängar. Om ASCII-kodade bytesträngar anges som parametrar kommer även returtyperna att vara ASCII-kodade bytesträngar:

source: (Work by Nick Coghlan, Dan Mahn, and Senthil Kumaran in :issue:`2987`, :issue:`5468`, and :issue:`9873`.)
sv: (Arbete av Nick Coghlan, Dan Mahn, och Senthil Kumaran i :issue:`2987`, :issue:`5468`, och :issue:`9873`)

source: mailbox
sv: brevlåda

source: Thanks to a concerted effort by R. David Murray, the :mod:`mailbox` module has been fixed for Python 3.2. The challenge was that mailbox had been originally designed with a text interface, but email messages are best represented with :class:`bytes` because various parts of a message may have different encodings.
sv: Tack vare en samlad insats av R. David Murray har modulen :mod:`mailbox` åtgärdats för Python 3.2. Utmaningen var att mailbox ursprungligen hade utformats med ett textgränssnitt, men e-postmeddelanden representeras bäst med :class:`bytes` eftersom olika delar av ett meddelande kan ha olika kodningar.

source: The solution harnessed the :mod:`email` package's binary support for parsing arbitrary email messages. In addition, the solution required a number of API changes.
sv: Lösningen utnyttjade :mod:`email`-paketets binära stöd för att tolka godtyckliga e-postmeddelanden. Dessutom krävde lösningen ett antal API-ändringar.

source: As expected, the :meth:`~mailbox.Mailbox.add` method for :class:`mailbox.Mailbox` objects now accepts binary input.
sv: Som väntat accepterar nu metoden :meth:`~mailbox.Mailbox.add` för :class:`mailbox.Mailbox`-objekt binär indata.

source: :class:`~io.StringIO` and text file input are deprecated. Also, string input will fail early if non-ASCII characters are used. Previously it would fail when the email was processed in a later step.
sv: :class:`~io.StringIO` och inmatning av textfiler är föråldrade. Dessutom kommer stränginmatning att misslyckas tidigt om icke-ASCII-tecken används. Tidigare misslyckades det när e-postmeddelandet bearbetades i ett senare steg.

source: There is also support for binary output. The :meth:`~mailbox.Mailbox.get_file` method now returns a file in the binary mode (where it used to incorrectly set the file to text-mode). There is also a new :meth:`~mailbox.Mailbox.get_bytes` method that returns a :class:`bytes` representation of a message corresponding to a given *key*.
sv: Det finns också stöd för binär utdata. Metoden :meth:`~mailbox.Mailbox.get_file` returnerar nu en fil i binärt läge (där den tidigare felaktigt satte filen i textläge). Det finns också en ny metod :meth:`~mailbox.Mailbox.get_bytes` som returnerar en :class:`bytes`-representation av ett meddelande som motsvarar en given *key*.

source: It is still possible to get non-binary output using the old API's :meth:`~mailbox.Mailbox.get_string` method, but that approach is not very useful. Instead, it is best to extract messages from a :class:`~mailbox.Message` object or to load them from binary input.
sv: Det är fortfarande möjligt att få icke-binär utdata med hjälp av det gamla API:ets :meth:`~mailbox.Mailbox.get_string`-metod, men det tillvägagångssättet är inte särskilt användbart. Istället är det bäst att extrahera meddelanden från ett :class:`~mailbox.Message`-objekt eller att ladda dem från binär indata.

source: (Contributed by R. David Murray, with efforts from Steffen Daode Nurpmeso and an initial patch by Victor Stinner in :issue:`9124`.)
sv: (Bidrag från R. David Murray, med insatser från Steffen Daode Nurpmeso och en första patch av Victor Stinner i :issue:`9124`.)

source: turtledemo
sv: sköldpaddsemo

source: The demonstration code for the :mod:`turtle` module was moved from the *Demo* directory to main library. It includes over a dozen sample scripts with lively displays. Being on :data:`sys.path`, it can now be run directly from the command-line:
sv: Demonstrationskoden för modulen :mod:`turtle` har flyttats från katalogen *Demo* till huvudbiblioteket. Den innehåller över ett dussin exempelskript med livliga skärmar. Eftersom den finns på :data:`sys.path` kan den nu köras direkt från kommandoraden:

source: (Moved from the Demo directory by Alexander Belopolsky in :issue:`10199`.)
sv: (Flyttad från Demo-katalogen av Alexander Belopolsky i :issue:`10199`.)

source: The mechanism for serializing execution of concurrently running Python threads (generally known as the :term:`GIL` or Global Interpreter Lock) has been rewritten. Among the objectives were more predictable switching intervals and reduced overhead due to lock contention and the number of ensuing system calls. The notion of a "check interval" to allow thread switches has been abandoned and replaced by an absolute duration expressed in seconds. This parameter is tunable through :func:`sys.setswitchinterval`. It currently defaults to 5 milliseconds.
sv: Mekanismen för serialisering av exekvering av Python-trådar som körs samtidigt (allmänt känd som :term:`GIL` eller Global Interpreter Lock) har skrivits om. Bland målen fanns mer förutsägbara växlingsintervall och minskad overhead på grund av låskonflikter och antalet efterföljande systemanrop. Begreppet "kontrollintervall" för att tillåta trådbyten har övergivits och ersatts av en absolut varaktighet uttryckt i sekunder. Denna parameter kan ställas in genom :func:`sys.setswitchinterval`. Standardvärdet är för närvarande 5 millisekunder.

source: Additional details about the implementation can be read from a `python-dev mailing-list message <https://mail.python.org/pipermail/python-dev/2009-October/093321.html>`_ (however, "priority requests" as exposed in this message have not been kept for inclusion).
sv: Ytterligare detaljer om implementeringen kan läsas i ett meddelande från `python-dev mailing-list <https://mail.python.org/pipermail/python-dev/2009-October/093321.html>`_ (dock har "priority requests" som anges i detta meddelande inte tagits med för inkludering).

source: (Contributed by Antoine Pitrou.)
sv: (Bidrag från Antoine Pitrou.)

source: Regular and recursive locks now accept an optional *timeout* argument to their :meth:`~threading.Lock.acquire` method. (Contributed by Antoine Pitrou; :issue:`7316`.)
sv: Vanliga och rekursiva lås accepterar nu ett valfritt *timeout*-argument till sin :meth:`~threading.Lock.acquire`-metod. (Bidrag från Antoine Pitrou; :issue:`7316`.)

source: Similarly, :meth:`threading.Semaphore.acquire` also gained a *timeout* argument. (Contributed by Torsten Landschoff; :issue:`850728`.)
sv: På samma sätt har :meth:`threading.Semaphore.acquire` också fått ett *timeout*-argument. (Bidrag från Torsten Landschoff; :issue:`850728`.)

source: Regular and recursive lock acquisitions can now be interrupted by signals on platforms using Pthreads. This means that Python programs that deadlock while acquiring locks can be successfully killed by repeatedly sending SIGINT to the process (by pressing :kbd:`Ctrl+C` in most shells). (Contributed by Reid Kleckner; :issue:`8844`.)
sv: Vanliga och rekursiva låsförvärv kan nu avbrytas av signaler på plattformar som använder Pthreads. Detta innebär att Python-program som låser sig medan de förvärvar lås kan dödas genom att upprepade gånger skicka SIGINT till processen (genom att trycka på :kbd:`Ctrl+C` i de flesta skal). (Bidrag från Reid Kleckner; :issue:`8844`.)

source: Optimizations
sv: Optimeringar

source: A number of small performance enhancements have been added:
sv: Ett antal små prestandaförbättringar har lagts till:

source: Python's peephole optimizer now recognizes patterns such ``x in {1, 2, 3}`` as being a test for membership in a set of constants. The optimizer recasts the :class:`set` as a :class:`frozenset` and stores the pre-built constant.
sv: Pythons peephole-optimerare känner nu igen mönster som ``x i {1, 2, 3}`` som ett test för medlemskap i en uppsättning konstanter. Optimeraren omformar :class:`set` till :class:`frozenset` och lagrar den förbyggda konstanten.

source: Now that the speed penalty is gone, it is practical to start writing membership tests using set-notation. This style is both semantically clear and operationally fast::
sv: Nu när hastighetsstraffet är borta är det praktiskt att börja skriva medlemskapstest med set-notation. Denna stil är både semantiskt tydlig och operationellt snabb::

source: extension = name.rpartition('.')[2] if extension in {'xml', 'html', 'xhtml', 'css'}: handle(name)
sv: extension = namn.rpartition('.')[2] if extension in {'xml', 'html', 'xhtml', 'css'}: handle(namn)

source: (Patch and additional tests contributed by Dave Malcolm; :issue:`6690`).
sv: (Patch och ytterligare tester bidragna av Dave Malcolm; :issue:`6690`).

source: Serializing and unserializing data using the :mod:`pickle` module is now several times faster.
sv: Serialisering och unsialisering av data med modulen :mod:`pickle` är nu flera gånger snabbare.

source: (Contributed by Alexandre Vassalotti, Antoine Pitrou and the Unladen Swallow team in :issue:`9410` and :issue:`3873`.)
sv: (Bidrag från Alexandre Vassalotti, Antoine Pitrou och Unladen Swallow-teamet i :issue:`9410` och :issue:`3873`.)

source: The `Timsort algorithm <https://en.wikipedia.org/wiki/Timsort>`_ used in :meth:`list.sort` and :func:`sorted` now runs faster and uses less memory when called with a :term:`key function`. Previously, every element of a list was wrapped with a temporary object that remembered the key value associated with each element. Now, two arrays of keys and values are sorted in parallel. This saves the memory consumed by the sort wrappers, and it saves time lost to delegating comparisons.
sv: Timsort-algoritmen <https://en.wikipedia.org/wiki/Timsort>`_ som används i :meth:`list.sort` och :func:`sorted` körs nu snabbare och använder mindre minne när den anropas med en :term:`key function`. Tidigare omslöts varje element i en lista med ett temporärt objekt som kom ihåg nyckelvärdet som associerades med varje element. Nu sorteras två arrayer med nycklar och värden parallellt. Detta sparar det minne som används av sorteringsomslagen och sparar tid som går förlorad på att delegera jämförelser.

source: (Patch by Daniel Stutzbach in :issue:`9915`.)
sv: (Patch av Daniel Stutzbach i :issue:`9915`.)

source: JSON decoding performance is improved and memory consumption is reduced whenever the same string is repeated for multiple keys. Also, JSON encoding now uses the C speedups when the ``sort_keys`` argument is true.
sv: JSON-avkodningens prestanda har förbättrats och minnesförbrukningen har minskat när samma sträng upprepas för flera nycklar. Dessutom använder JSON-kodningen nu C-hastighetsökningarna när argumentet ``sort_keys`` är sant.

source: (Contributed by Antoine Pitrou in :issue:`7451` and by Raymond Hettinger and Antoine Pitrou in :issue:`10314`.)
sv: (Bidrag från Antoine Pitrou i :issue:`7451` och från Raymond Hettinger och Antoine Pitrou i :issue:`10314`.)

source: Recursive locks (created with the :func:`threading.RLock` API) now benefit from a C implementation which makes them as fast as regular locks, and between 10x and 15x faster than their previous pure Python implementation.
sv: Rekursiva lås (skapade med API:et :func:`threading.RLock`) har nu en C-implementering som gör dem lika snabba som vanliga lås och mellan 10 och 15 gånger snabbare än den tidigare rena Python-implementeringen.

source: (Contributed by Antoine Pitrou; :issue:`3001`.)
sv: (Bidrag från Antoine Pitrou; :issue:`3001`.)

source: The fast-search algorithm in stringlib is now used by the :meth:`~str.split`, :meth:`~str.rsplit`, :meth:`~str.splitlines` and :meth:`~str.replace` methods on :class:`bytes`, :class:`bytearray` and :class:`str` objects. Likewise, the algorithm is also used by :meth:`~str.rfind`, :meth:`~str.rindex`, :meth:`~str.rsplit` and :meth:`~str.rpartition`.
sv: Fast-search-algoritmen i stringlib används nu av metoderna :meth:`~str.split`, :meth:`~str.rsplit`, :meth:`~str.splitlines` och :meth:`~str.replace` för objekten :class:`bytes`, :class:`bytearray` och :class:`str`. På samma sätt används algoritmen också av :meth:`~str.rfind`, :meth:`~str.rindex`, :meth:`~str.rsplit` och :meth:`~str.rpartition`.

source: (Patch by Florent Xicluna in :issue:`7622` and :issue:`7462`.)
sv: (Patch av Florent Xicluna i :issue:`7622` och :issue:`7462`.)

source: Integer to string conversions now work two "digits" at a time, reducing the number of division and modulo operations.
sv: Konvertering av heltal till strängar fungerar nu med två "siffror" i taget, vilket minskar antalet divisions- och moduloperationer.

source: (:issue:`6713` by Gawain Bolton, Mark Dickinson, and Victor Stinner.)
sv: (:issue:`6713` av Gawain Bolton, Mark Dickinson och Victor Stinner.)

source: There were several other minor optimizations. Set differencing now runs faster when one operand is much larger than the other (patch by Andress Bennetts in :issue:`8685`). The :meth:`!array.repeat` method has a faster implementation (:issue:`1569291` by Alexander Belopolsky). The :class:`~http.server.BaseHTTPRequestHandler` has more efficient buffering (:issue:`3709` by Andrew Schaaf). The :func:`operator.attrgetter` function has been sped-up (:issue:`10160` by Christos Georgiou). And :class:`~configparser.ConfigParser` loads multi-line arguments a bit faster (:issue:`7113` by Łukasz Langa).
sv: Det fanns flera andra mindre optimeringar. Set differencing går nu snabbare när den ena operanden är mycket större än den andra (patch av Andress Bennetts i :issue:`8685`). Metoden :meth:`!array.repeat` har en snabbare implementation (:issue:`1569291` by Alexander Belopolsky). Klassen :class:`~http.server.BaseHTTPRequestHandler` har effektivare buffring (:issue:`3709` by Andrew Schaaf). Funktionen :func:`operator.attrgetter` har blivit snabbare (:issue:`10160` by Christos Georgiou). Och :class:`~configparser.ConfigParser` läser in argument på flera rader lite snabbare (:issue:`7113` by Łukasz Langa).

source: Python has been updated to `Unicode 6.0.0 <https://unicode.org/versions/Unicode6.0.0/>`_. The update to the standard adds over 2,000 new characters including `emoji <https://en.wikipedia.org/wiki/Emoji>`_ symbols which are important for mobile phones.
sv: Python har uppdaterats till `Unicode 6.0.0 <https://unicode.org/versions/Unicode6.0.0/>`_. Uppdateringen av standarden lägger till över 2.000 nya tecken inklusive `emoji <https://en.wikipedia.org/wiki/Emoji>`_-symboler som är viktiga för mobiltelefoner.

source: In addition, the updated standard has altered the character properties for two Kannada characters (U+0CF1, U+0CF2) and one New Tai Lue numeric character (U+19DA), making the former eligible for use in identifiers while disqualifying the latter. For more information, see `Unicode Character Database Changes <https://www.unicode.org/versions/Unicode6.0.0/#Database_Changes>`_.
sv: Dessutom har den uppdaterade standarden ändrat teckenegenskaperna för två Kannada-tecken (U+0CF1, U+0CF2) och ett numeriskt New Tai Lue-tecken (U+19DA), vilket gör de förra kvalificerade för användning i identifierare medan de senare diskvalificeras. För mer information, se `Unicode Character Database Changes <https://www.unicode.org/versions/Unicode6.0.0/#Database_Changes>`_.

source: Support was added for *cp720* Arabic DOS encoding (:issue:`1616979`).
sv: Stöd har lagts till för *cp720* arabisk DOS-kodning (:issue:`1616979`).

source: MBCS encoding no longer ignores the error handler argument. In the default strict mode, it raises an :exc:`UnicodeDecodeError` when it encounters an undecodable byte sequence and an :exc:`UnicodeEncodeError` for an unencodable character.
sv: MBCS-kodning ignorerar inte längre felhanteringsargumentet. I standardläget strict ger den upphov till ett :exc:`UnicodeDecodeError` när den stöter på en oavkodbar byte-sekvens och ett :exc:`UnicodeEncodeError` för ett oavkodbart tecken.

source: The MBCS codec supports ``'strict'`` and ``'ignore'`` error handlers for decoding, and ``'strict'`` and ``'replace'`` for encoding.
sv: MBCS codec stöder felhanterarna ``'strict'`` och ``'ignore'`` för avkodning och ``'strict'`` och ``'replace'`` för kodning.

source: To emulate Python3.1 MBCS encoding, select the ``'ignore'`` handler for decoding and the ``'replace'`` handler for encoding.
sv: För att emulera Python3.1 MBCS-kodning, välj ``'ignore'`` hanteraren för avkodning och ``'replace'`` hanteraren för kodning.

source: On Mac OS X, Python decodes command line arguments with ``'utf-8'`` rather than the locale encoding.
sv: På Mac OS X avkodar Python kommandoradsargument med ``'utf-8'`` snarare än med lokal kodning.

source: By default, :mod:`tarfile` uses ``'utf-8'`` encoding on Windows (instead of ``'mbcs'``) and the ``'surrogateescape'`` error handler on all operating systems.
sv: Som standard använder :mod:`tarfile` kodningen ``'utf-8`` i Windows (i stället för ``'mbcs``) och felhanteraren ``'surrogateescape`` i alla operativsystem.

source: Documentation
sv: Dokumentation

source: The documentation continues to be improved.
sv: Dokumentationen fortsätter att förbättras.

source: A table of quick links has been added to the top of lengthy sections such as :ref:`built-in-funcs`. In the case of :mod:`itertools`, the links are accompanied by tables of cheatsheet-style summaries to provide an overview and memory jog without having to read all of the docs.
sv: En tabell med snabblänkar har lagts till längst upp i långa avsnitt som :ref:`built-in-funcs`. När det gäller :mod:`itertools` åtföljs länkarna av tabeller med sammanfattningar i fusklappsstil för att ge en översikt och en minneshjälp utan att behöva läsa hela dokumentationen.

source: In some cases, the pure Python source code can be a helpful adjunct to the documentation, so now many modules now feature quick links to the latest version of the source code. For example, the :mod:`functools` module documentation has a quick link at the top labeled:
sv: I vissa fall kan den rena Python-källkoden vara ett bra komplement till dokumentationen, så nu har många moduler snabblänkar till den senaste versionen av källkoden. Till exempel har dokumentationen för modulen :mod:`functools` en snabblänk högst upp med texten:

source: **Source code** :source:`Lib/functools.py`.
sv: **Källkod** :source:`Lib/functools.py`.

source: (Contributed by Raymond Hettinger; see `rationale <https://rhettinger.wordpress.com/2011/01/28/open-your-source-more/>`_.)
sv: (Bidrag från Raymond Hettinger; se `rationale <https://rhettinger.wordpress.com/2011/01/28/open-your-source-more/>`_.)

source: The docs now contain more examples and recipes. In particular, :mod:`re` module has an extensive section, :ref:`re-examples`. Likewise, the :mod:`itertools` module continues to be updated with new :ref:`itertools-recipes`.
sv: Dokumentationen innehåller nu fler exempel och recept. I synnerhet har modulen :mod:`re` ett omfattande avsnitt, :ref:`re-examples`. På samma sätt fortsätter modulen :mod:`itertools` att uppdateras med nya :ref:`itertools-recipes`.

source: The :mod:`datetime` module now has an auxiliary implementation in pure Python. No functionality was changed. This just provides an easier-to-read alternate implementation.
sv: Modulen :mod:`datetime` har nu en hjälpartimplementering i ren Python. Ingen funktionalitet har ändrats. Detta ger bara en mer lättläst alternativ implementering.

source: (Contributed by Alexander Belopolsky in :issue:`9528`.)
sv: (Bidrag från Alexander Belopolsky i :issue:`9528`.)
