Repository: yeager/python-docs-sv
Catalog: whatsnew/3.2.po
Languages: sv

source: What's New In Python 3.2
sv: Vad är nytt i Python 3.2

source: Author
sv: Författare

source: This article explains the new features in Python 3.2 as compared to 3.1. Python 3.2 was released on February 20, 2011. It focuses on a few highlights and gives a few examples. For full details, see the `Misc/NEWS <https://github.com/python/cpython/blob/076ca6c3c8df3030307e548d9be792ce3c1c6eea/Misc/NEWS>`__ file.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.2 jämfört med 3.1. Python 3.2 släpptes den 20 februari 2011. Den fokuserar på några få höjdpunkter och ger några exempel. För fullständig information, se filen `Misc/NEWS <https://github.com/python/cpython/blob/076ca6c3c8df3030307e548d9be792ce3c1c6eea/Misc/NEWS>`__.

source: :pep:`392` - Python 3.2 Release Schedule
sv: :pep:`392` - Python 3.2 Utgivningsschema

source: PEP 384: Defining a Stable ABI
sv: PEP 384: Att definiera en stabil ABI

source: In the past, extension modules built for one Python version were often not usable with other Python versions. Particularly on Windows, every feature release of Python required rebuilding all extension modules that one wanted to use. This requirement was the result of the free access to Python interpreter internals that extension modules could use.
sv: Tidigare var tilläggsmoduler som byggts för en Python-version ofta inte användbara med andra Python-versioner. Särskilt på Windows krävde varje funktionsversion av Python att man byggde om alla tilläggsmoduler som man ville använda. Detta krav var resultatet av den fria tillgången till Pythons tolkinterna som tilläggsmoduler kunde använda.

source: With Python 3.2, an alternative approach becomes available: extension modules which restrict themselves to a limited API (by defining Py_LIMITED_API) cannot use many of the internals, but are constrained to a set of API functions that are promised to be stable for several releases. As a consequence, extension modules built for 3.2 in that mode will also work with 3.3, 3.4, and so on. Extension modules that make use of details of memory structures can still be built, but will need to be recompiled for every feature release.
sv: Med Python 3.2 blir ett alternativt tillvägagångssätt tillgängligt: tilläggsmoduler som begränsar sig till ett begränsat API (genom att definiera Py_LIMITED_API) kan inte använda många av de interna funktionerna, men begränsas till en uppsättning API-funktioner som lovas vara stabila i flera utgåvor. Som en följd av detta kommer tilläggsmoduler som byggts för 3.2 i det läget också att fungera med 3.3, 3.4 och så vidare. Tilläggsmoduler som använder detaljer i minnesstrukturer kan fortfarande byggas, men de måste kompileras om för varje funktionsversion.

source: :pep:`384` - Defining a Stable ABI
sv: :pep:`384` - Att definiera en stabil ABI

source: PEP written by Martin von Löwis.
sv: PEP skriven av Martin von Löwis.

source: PEP 389: Argparse Command Line Parsing Module
sv: PEP 389: Argparse-modul för parsning av kommandoraden

source: A new module for command line parsing, :mod:`argparse`, was introduced to overcome the limitations of :mod:`optparse` which did not provide support for positional arguments (not just options), subcommands, required options and other common patterns of specifying and validating options.
sv: En ny modul för kommandoradsanalys, :mod:`argparse`, introducerades för att övervinna begränsningarna i :mod:`optparse` som inte hade stöd för positionella argument (inte bara alternativ), underkommandon, obligatoriska alternativ och andra vanliga mönster för att ange och validera alternativ.

source: This module has already had widespread success in the community as a third-party module. Being more fully featured than its predecessor, the :mod:`argparse` module is now the preferred module for command-line processing. The older module is still being kept available because of the substantial amount of legacy code that depends on it.
sv: Denna modul har redan haft stor framgång i samhället som en tredjepartsmodul. Modulen :mod:`argparse` är mer komplett än sin föregångare och är nu den föredragna modulen för kommandoradsbehandling. Den äldre modulen hålls fortfarande tillgänglig på grund av den stora mängd äldre kod som är beroende av den.

source: Here's an annotated example parser showing features like limiting results to a set of choices, specifying a *metavar* in the help screen, validating that one or more positional arguments is present, and making a required option::
sv: Här är ett kommenterat exempel på en parser som visar funktioner som att begränsa resultaten till en uppsättning val, ange en *metavar* i hjälpskärmen, validera att ett eller flera positionsargument finns och göra ett obligatoriskt alternativ::

source: Example of calling the parser on a command string::
sv: Exempel på anrop av parsern på en kommandosträng::

source: >>> cmd = 'deploy sneezy.example.com sleepy.example.com -u skycaptain' >>> result = parser.parse_args(cmd.split()) >>> result.action 'deploy' >>> result.targets ['sneezy.example.com', 'sleepy.example.com'] >>> result.user 'skycaptain'
sv: >>> cmd = 'deploy sneezy.example.com sleepy.example.com -u skycaptain' >>> resultat = parser.parse_args(cmd.split()) >>> resultat.åtgärd 'deploy' >>> resultat.mål ['sneezy.example.com', 'sleepy.example.com'] >>> resultat.användare 'skycaptain'

source: Example of the parser's automatically generated help::
sv: Exempel på den automatiskt genererade hjälpen i parsern::

source: >>> parser.parse_args('-h'.split()) usage: manage_cloud.py [-h] -u USER {deploy,start,stop} HOSTNAME [HOSTNAME ...] Manage servers positional arguments: {deploy,start,stop} action on each target HOSTNAME url for target machines optional arguments: -h, --help show this help message and exit -u USER, --user USER login as user Tested on Solaris and Linux
sv: >>> parser.parse_args('-h'.split()) användning: manage_cloud.py [-h] -u USER {deploy,start,stop} VÄRDNAMN [VÄRDNAMN ...] Hantera servrar positionella argument: {deploy,start,stop} åtgärd för varje mål HOSTNAME url för målmaskiner valfria argument: -h, --help visa detta hjälpmeddelande och avsluta -u USER, --user USER logga in som användare Testat på Solaris och Linux

source: An especially nice :mod:`argparse` feature is the ability to define subparsers, each with their own argument patterns and help displays::
sv: En särskilt trevlig :mod:`argparse`-funktion är möjligheten att definiera underparsers, var och en med sina egna argumentmönster och hjälpdisplayer::

source: import argparse parser = argparse.ArgumentParser(prog='HELM') subparsers = parser.add_subparsers() parser_l = subparsers.add_parser('launch', help='Launch Control') # first subgroup parser_l.add_argument('-m', '--missiles', action='store_true') parser_l.add_argument('-t', '--torpedos', action='store_true') parser_m = subparsers.add_parser('move', help='Move Vessel', # second subgroup aliases=('steer', 'turn')) # equivalent names parser_m.add_argument('-c', '--course', type=int, required=True) parser_m.add_argument('-s', '--speed', type=int, default=0)
sv: import argparse parser = argparse.ArgumentParser(prog='HELM') subparsers = parser.add_subparsers() parser_l = subparsers.add_parser('launch', help='Launch Control') # första undergruppen parser_l.add_argument('-m', '--missiles', action='store_true') parser_l.add_argument('-t', '--torpedos', action='store_true') parser_m = subparsers.add_parser('move', help='Flytta fartyg', # andra undergruppen alias=('styra', 'vända')) # likvärdiga namn parser_m.add_argument('-c', '--course', type=int, required=True) parser_m.add_argument('-s', '--speed', type=int, default=0)

source: $ ./helm.py --help # top level help (launch and move) $ ./helm.py launch --help # help for launch options $ ./helm.py launch --missiles # set missiles=True and torpedos=False $ ./helm.py steer --course 180 --speed 5 # set movement parameters
sv: $ ./helm.py --help # hjälp på högsta nivå (start och flytt) $ ./helm.py launch --help # hjälp för avfyrningsalternativ $ ./helm.py launch --missiles # ställ in missiler=True och torpeder=False $ ./helm.py steer --kurs 180 --hastighet 5 # ställ in rörelseparametrar

source: :pep:`389` - New Command Line Parsing Module
sv: :pep:`389` - Ny modul för parsning av kommandorader

source: PEP written by Steven Bethard.
sv: PEP skriven av Steven Bethard.

source: :ref:`upgrading-optparse-code` for details on the differences from :mod:`optparse`.
sv: :ref:`upgrading-optparse-code` för detaljer om skillnaderna från :mod:`optparse`.

source: PEP 391: Dictionary Based Configuration for Logging
sv: PEP 391: Ordboksbaserad konfiguration för loggning

source: The :mod:`logging` module provided two kinds of configuration, one style with function calls for each option or another style driven by an external file saved in a :mod:`configparser` format. Those options did not provide the flexibility to create configurations from JSON or YAML files, nor did they support incremental configuration, which is needed for specifying logger options from a command line.
sv: Modulen :mod:`logging` tillhandahöll två typer av konfigurering, en stil med funktionsanrop för varje alternativ eller en annan stil som drivs av en extern fil som sparas i formatet :mod:`configparser`. Dessa alternativ gav inte flexibiliteten att skapa konfigurationer från JSON- eller YAML-filer, och de stödde inte heller inkrementell konfiguration, vilket behövs för att ange loggaralternativ från en kommandorad.

source: To support a more flexible style, the module now offers :func:`logging.config.dictConfig` for specifying logging configuration with plain Python dictionaries. The configuration options include formatters, handlers, filters, and loggers. Here's a working example of a configuration dictionary::
sv: För att stödja en mer flexibel stil erbjuder modulen nu :func:`logging.config.dictConfig` för att ange loggningskonfiguration med vanliga Python-ordböcker. Konfigurationsalternativen inkluderar formaterare, hanterare, filter och loggar. Här är ett fungerande exempel på en konfigurationsordbok::

source: {"version": 1, "formatters": {"brief": {"format": "%(levelname)-8s: %(name)-15s: %(message)s"}, "full": {"format": "%(asctime)s %(name)-15s %(levelname)-8s %(message)s"} }, "handlers": {"console": { "class": "logging.StreamHandler", "formatter": "brief", "level": "INFO", "stream": "ext://sys.stdout"}, "console_priority": { "class": "logging.StreamHandler", "formatter": "full", "level": "ERROR", "stream": "ext://sys.stderr"} }, "root": {"level": "DEBUG", "handlers": ["console", "console_priority"]}}
sv: {"version": 1, "formatter": {"brief": {"format": "%(levelname)-8s: %(name)-15s: %(message)s"}, "full": {"format": "%(asctime)s %(name)-15s %(levelname)-8s %(message)s"} }, "handlers": {"console": { "class": "logging.StreamHandler", "formatter": "brief", "level": "INFO", "stream": "ext://sys.stdout"}, "console_priority": { "class": "logging.StreamHandler", "formatter": "full", "level": "ERROR", "stream": "ext://sys.stderr"} }, "root": {"level": "DEBUG", "handlers": ["console", "console_priority"]}}

source: If that dictionary is stored in a file called :file:`conf.json`, it can be loaded and called with code like this::
sv: Om ordlistan lagras i en fil som heter :file:`conf.json`, kan den laddas och anropas med kod som denna::

source: >>> import json, logging.config >>> with open('conf.json') as f: ... conf = json.load(f) ... >>> logging.config.dictConfig(conf) >>> logging.info("Transaction completed normally") INFO : root : Transaction completed normally >>> logging.critical("Abnormal termination") 2011-02-17 11:14:36,694 root CRITICAL Abnormal termination
sv: >>> import json, loggning.config >>> med open('conf.json') som f: ... conf = json.load(f) ... >>> logging.config.dictConfig(conf) >>> logging.info("Transaktionen slutfördes normalt") INFO : root : Transaktionen slutfördes normalt >>> logging.critical("Onormal avslutning") 2011-02-17 11:14:36,694 root CRITICAL Onormal avslutning

source: :pep:`391` - Dictionary Based Configuration for Logging
sv: :pep:`391` - Konfiguration baserad på ordbok för loggning

source: PEP written by Vinay Sajip.
sv: PEP skriven av Vinay Sajip.

source: PEP 3148: The ``concurrent.futures`` module
sv: PEP 3148: Modulen ``concurrent.futures``

source: Code for creating and managing concurrency is being collected in a new top-level namespace, *concurrent*. Its first member is a *futures* package which provides a uniform high-level interface for managing threads and processes.
sv: Kod för att skapa och hantera samtidighet samlas i ett nytt namnområde på högsta nivå, *concurrent*. Dess första medlem är ett *futures*-paket som tillhandahåller ett enhetligt gränssnitt på hög nivå för hantering av trådar och processer.

source: The design for :mod:`concurrent.futures` was inspired by the *java.util.concurrent* package. In that model, a running call and its result are represented by a :class:`~concurrent.futures.Future` object that abstracts features common to threads, processes, and remote procedure calls. That object supports status checks (running or done), timeouts, cancellations, adding callbacks, and access to results or exceptions.
sv: Utformningen av :mod:`concurrent.futures` har inspirerats av paketet *java.util.concurrent*. I den modellen representeras ett pågående anrop och dess resultat av ett :class:`~concurrent.futures.Future`-objekt som abstraherar funktioner som är gemensamma för trådar, processer och fjärrproceduranrop. Objektet stöder statuskontroller (körs eller görs), timeouts, avbrytanden, tillägg av callbacks och åtkomst till resultat eller undantag.

source: The primary offering of the new module is a pair of executor classes for launching and managing calls. The goal of the executors is to make it easier to use existing tools for making parallel calls. They save the effort needed to setup a pool of resources, launch the calls, create a results queue, add time-out handling, and limit the total number of threads, processes, or remote procedure calls.
sv: Den nya modulen består främst av ett par exekverande klasser för att starta och hantera anrop. Målet med exekveringsmodulerna är att göra det enklare att använda befintliga verktyg för att göra parallella anrop. De sparar det arbete som krävs för att konfigurera en resurspool, starta anrop, skapa en resultatkö, lägga till timeout-hantering och begränsa det totala antalet trådar, processer eller fjärrproceduranrop.

source: Ideally, each application should share a single executor across multiple components so that process and thread limits can be centrally managed. This solves the design challenge that arises when each component has its own competing strategy for resource management.
sv: Helst bör varje applikation dela en enda exekverare mellan flera komponenter så att process- och trådgränser kan hanteras centralt. Detta löser den designutmaning som uppstår när varje komponent har sin egen konkurrerande strategi för resurshantering.

source: Both classes share a common interface with three methods: :meth:`~concurrent.futures.Executor.submit` for scheduling a callable and returning a :class:`~concurrent.futures.Future` object; :meth:`~concurrent.futures.Executor.map` for scheduling many asynchronous calls at a time, and :meth:`~concurrent.futures.Executor.shutdown` for freeing resources. The class is a :term:`context manager` and can be used in a :keyword:`with` statement to assure that resources are automatically released when currently pending futures are done executing.
sv: Båda klasserna har ett gemensamt gränssnitt med tre metoder: :meth:`~concurrent.futures.Executor.submit` för att schemalägga ett anrop och returnera ett :class:`~concurrent.futures.Future`-objekt; :meth:`~concurrent.futures.Executor.map` för att schemalägga många asynkrona anrop åt gången, och :meth:`~concurrent.futures.Executor.shutdown` för att frigöra resurser. Klassen är en :term:`context manager` och kan användas i en :keyword:`with`-sats för att säkerställa att resurser automatiskt frigörs när pågående futures är klara med exekveringen.

source: A simple of example of :class:`~concurrent.futures.ThreadPoolExecutor` is a launch of four parallel threads for copying files::
sv: Ett enkelt exempel på :class:`~concurrent.futures.ThreadPoolExecutor` är en start av fyra parallella trådar för kopiering av filer::

source: :pep:`3148` - Futures -- Execute Computations Asynchronously
sv: :pep:`3148` - Futures -- Utför beräkningar asynkront

source: PEP written by Brian Quinlan.
sv: PEP skriven av Brian Quinlan.

source: :ref:`Code for Threaded Parallel URL reads<threadpoolexecutor-example>`, an example using threads to fetch multiple web pages in parallel.
sv: :ref:`Kod för parallell URL-läsning med trådar<threadpoolexecutor-example>`, ett exempel där trådar används för att hämta flera webbsidor parallellt.

source: :ref:`Code for computing prime numbers in parallel<processpoolexecutor-example>`, an example demonstrating :class:`~concurrent.futures.ProcessPoolExecutor`.
sv: :ref:`Kod för beräkning av primtal i parallell<processpoolexecutor-example>`, ett exempel som demonstrerar :class:`~concurrent.futures.ProcessPoolExecutor`.

source: PEP 3147: PYC Repository Directories
sv: PEP 3147: Kataloger för PYC-förvar

source: Python's scheme for caching bytecode in *.pyc* files did not work well in environments with multiple Python interpreters. If one interpreter encountered a cached file created by another interpreter, it would recompile the source and overwrite the cached file, thus losing the benefits of caching.
sv: Pythons system för att cachelagra bytekod i *.pyc*-filer fungerade inte bra i miljöer med flera Python-tolkar. Om en tolk stötte på en cachad fil som skapats av en annan tolk, skulle den kompilera om källkoden och skriva över den cachade filen, och därmed förlora fördelarna med cachning.

source: The issue of "pyc fights" has become more pronounced as it has become commonplace for Linux distributions to ship with multiple versions of Python. These conflicts also arise with CPython alternatives such as Unladen Swallow.
sv: Frågan om "pyc-fighter" har blivit mer uttalad eftersom det har blivit vanligt att Linux-distributioner levereras med flera versioner av Python. Dessa konflikter uppstår också med CPython-alternativ som Unladen Swallow.

source: To solve this problem, Python's import machinery has been extended to use distinct filenames for each interpreter. Instead of Python 3.2 and Python 3.3 and Unladen Swallow each competing for a file called "mymodule.pyc", they will now look for "mymodule.cpython-32.pyc", "mymodule.cpython-33.pyc", and "mymodule.unladen10.pyc". And to prevent all of these new files from cluttering source directories, the *pyc* files are now collected in a "__pycache__" directory stored under the package directory.
sv: För att lösa detta problem har Pythons importmaskineri utökats så att olika filnamn används för varje tolk. I stället för att Python 3.2 och Python 3.3 och Unladen Swallow konkurrerar om en fil som heter "mymodule.pyc", kommer de nu att leta efter "mymodule.cpython-32.pyc", "mymodule.cpython-33.pyc" och "mymodule.unladen10.pyc". Och för att förhindra att alla dessa nya filer rör till källkatalogerna samlas *pyc*-filerna nu i en "__pycache__"-katalog som lagras under paketkatalogen.

source: Aside from the filenames and target directories, the new scheme has a few aspects that are visible to the programmer:
sv: Bortsett från filnamnen och målkatalogerna har det nya systemet några aspekter som är synliga för programmeraren:

source: Imported modules now have a :attr:`~module.__cached__` attribute which stores the name of the actual file that was imported:
sv: Importerade moduler har nu ett :attr:`~module.__cached__`-attribut som lagrar namnet på den faktiska filen som importerades:

source: The tag that is unique to each interpreter is accessible from the :mod:`!imp` module:
sv: Den tagg som är unik för varje tolk är tillgänglig från modulen :mod:`!imp`:

source: Scripts that try to deduce source filename from the imported file now need to be smarter. It is no longer sufficient to simply strip the "c" from a ".pyc" filename. Instead, use the new functions in the :mod:`!imp` module:
sv: Skript som försöker härleda källfilnamnet från den importerade filen måste nu vara smartare. Det räcker inte längre att bara ta bort "c" från ett ".pyc"-filnamn. Använd istället de nya funktionerna i modulen :mod:`!imp`:

source: The :mod:`py_compile` and :mod:`compileall` modules have been updated to reflect the new naming convention and target directory. The command-line invocation of *compileall* has new options: ``-i`` for specifying a list of files and directories to compile and ``-b`` which causes bytecode files to be written to their legacy location rather than *__pycache__*.
sv: Modulerna :mod:`py_compile` och :mod:`compileall` har uppdaterats för att återspegla den nya namnkonventionen och målkatalogen. Kommandoradsuppmaningen *compileall* har nya alternativ: ``-i`` för att ange en lista över filer och kataloger som ska kompileras och ``-b`` som gör att bytecode-filer skrivs till sin gamla plats i stället för till *__pycache__*.

source: The :mod:`importlib.abc` module has been updated with new :term:`abstract base classes <abstract base class>` for loading bytecode files. The obsolete ABCs, :class:`!PyLoader` and :class:`!PyPycLoader`, have been deprecated (instructions on how to stay Python 3.1 compatible are included with the documentation).
sv: Modulen :mod:`importlib.abc` har uppdaterats med nya :term:`abstract base classes <abstract base class>` för laddning av bytecode-filer. De föråldrade ABC:erna, :class:`!PyLoader` och :class:`!PyPycLoader`, har utgått (instruktioner om hur man håller sig kompatibel med Python 3.1 finns i dokumentationen).

source: :pep:`3147` - PYC Repository Directories
sv: :pep:`3147` - Kataloger för PYC-förvar

source: PEP written by Barry Warsaw.
sv: PEP skriven av Barry Warsaw.

source: PEP 3149: ABI Version Tagged .so Files
sv: PEP 3149: ABI-version märkta .so-filer

source: The PYC repository directory allows multiple bytecode cache files to be co-located. This PEP implements a similar mechanism for shared object files by giving them a common directory and distinct names for each version.
sv: PYC-repository-katalogen gör det möjligt att samlokalisera flera bytecode-cache-filer. Denna PEP implementerar en liknande mekanism för delade objektfiler genom att ge dem en gemensam katalog och distinkta namn för varje version.

source: The common directory is "pyshared" and the file names are made distinct by identifying the Python implementation (such as CPython, PyPy, Jython, etc.), the major and minor version numbers, and optional build flags (such as "d" for debug, "m" for pymalloc, "u" for wide-unicode). For an arbitrary package "foo", you may see these files when the distribution package is installed::
sv: Den gemensamma katalogen är "pyshared" och filnamnen särskiljs genom att identifiera Python-implementationen (t.ex. CPython, PyPy, Jython etc.), versionsnumren för major och minor samt valfria build-flaggor (t.ex. "d" för debug, "m" för pymalloc, "u" för wide-unicode). För ett godtyckligt paket "foo" kan du se dessa filer när distributionspaketet installeras::

source: In Python itself, the tags are accessible from functions in the :mod:`sysconfig` module::
sv: I Python är taggarna tillgängliga från funktioner i modulen :mod:`sysconfig`::

source: :pep:`3149` - ABI Version Tagged .so Files
sv: :pep:`3149` - ABI-version taggade .so-filer

source: PEP 3333: Python Web Server Gateway Interface v1.0.1
sv: PEP 3333: Python Web Server Gateway-gränssnitt v1.0.1
