Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: You can query the SSL compression algorithm used by an SSL socket, thanks to its new :meth:`~ssl.SSLSocket.compression` method. The new attribute :const:`~ssl.OP_NO_COMPRESSION` can be used to disable compression. (Contributed by Antoine Pitrou in :issue:`13634`.)
sv: Du kan fråga vilken SSL-komprimeringsalgoritm som används av en SSL-socket tack vare den nya metoden :meth:`~ssl.SSLSocket.compression`. Det nya attributet :const:`~ssl.OP_NO_COMPRESSION` kan användas för att inaktivera komprimering. (Bidrag från Antoine Pitrou i :issue:`13634`.)

source: Support has been added for the Next Protocol Negotiation extension using the :meth:`ssl.SSLContext.set_npn_protocols` method. (Contributed by Colin Marc in :issue:`14204`.)
sv: Stöd har lagts till för tillägget Next Protocol Negotiation med hjälp av metoden :meth:`ssl.SSLContext.set_npn_protocols`. (Bidrag från Colin Marc i :issue:`14204`.)

source: SSL errors can now be introspected more easily thanks to :attr:`~ssl.SSLError.library` and :attr:`~ssl.SSLError.reason` attributes. (Contributed by Antoine Pitrou in :issue:`14837`.)
sv: SSL-fel kan nu introspekteras lättare tack vare attributen :attr:`~ssl.SSLError.library` och :attr:`~ssl.SSLError.reason`. (Bidrag från Antoine Pitrou i :issue:`14837`.)

source: The :func:`~ssl.get_server_certificate` function now supports IPv6. (Contributed by Charles-François Natali in :issue:`11811`.)
sv: Funktionen :func:`~ssl.get_server_certificate` har nu stöd för IPv6. (Bidrag från Charles-François Natali i :issue:`11811`.)

source: New attribute :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` allows setting SSLv3 server sockets to use the server's cipher ordering preference rather than the client's (:issue:`13635`).
sv: Nytt attribut :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` tillåter inställning av SSLv3-serveruttag för att använda serverns preferens för chifferordning snarare än klientens (:issue:`13635`).

source: The undocumented tarfile.filemode function has been moved to :func:`stat.filemode`. It can be used to convert a file's mode to a string of the form '-rwxrwxrwx'.
sv: Den odokumenterade funktionen tarfile.filemode har flyttats till :func:`stat.filemode`. Den kan användas för att konvertera en fils läge till en sträng av formen '-rwxrwxrwx'.

source: (Contributed by Giampaolo Rodolà in :issue:`14807`.)
sv: (Bidrag från Giampaolo Rodolà i :issue:`14807`.)

source: struct
sv: struktur

source: The :mod:`struct` module now supports :c:type:`ssize_t` and :c:type:`size_t` via the new codes ``n`` and ``N``, respectively. (Contributed by Antoine Pitrou in :issue:`3163`.)
sv: Modulen :mod:`struct` stöder nu :c:type:`ssize_t` och :c:type:`size_t` via de nya koderna ``n`` respektive ``N``. (Bidrag från Antoine Pitrou i :issue:`3163`.)

source: subprocess
sv: delprocess

source: Command strings can now be bytes objects on posix platforms. (Contributed by Victor Stinner in :issue:`8513`.)
sv: Kommandosträngar kan nu vara bytesobjekt på posix-plattformar. (Bidrag från Victor Stinner i :issue:`8513`.)

source: A new constant :const:`~subprocess.DEVNULL` allows suppressing output in a platform-independent fashion. (Contributed by Ross Lagerwall in :issue:`5870`.)
sv: En ny konstant :const:`~subprocess.DEVNULL` gör det möjligt att undertrycka utdata på ett plattformsoberoende sätt. (Bidrag från Ross Lagerwall i :issue:`5870`.)

source: sys
sv: system

source: The :mod:`sys` module has a new :data:`~sys.thread_info` :term:`named tuple` holding information about the thread implementation (:issue:`11223`).
sv: Modulen :mod:`sys` har en ny :data:`~sys.thread_info` :term:`named tuple` som innehåller information om trådimplementationen (:issue:`11223`).

source: tarfile
sv: tarfil

source: :mod:`tarfile` now supports ``lzma`` encoding via the :mod:`lzma` module. (Contributed by Lars Gustäbel in :issue:`5689`.)
sv: :mod:`tarfile` stöder nu ``lzma``-kodning via modulen :mod:`lzma`. (Bidrag från Lars Gustäbel i :issue:`5689`.)

source: tempfile
sv: tempfil

source: :class:`tempfile.SpooledTemporaryFile`\'s :meth:`~tempfile.SpooledTemporaryFile.truncate` method now accepts a ``size`` parameter. (Contributed by Ryan Kelly in :issue:`9957`.)
sv: :class:`tempfile.SpooledTemporaryFile`'s :meth:`~tempfile.SpooledTemporaryFile.truncate` method accepterar nu en ``size`` parameter. (Bidrag från Ryan Kelly i :issue:`9957`.)

source: textwrap
sv: textbrytning

source: The :mod:`textwrap` module has a new :func:`~textwrap.indent` that makes it straightforward to add a common prefix to selected lines in a block of text (:issue:`13857`).
sv: Modulen :mod:`textwrap` har fått en ny :func:`~textwrap.indent` som gör det enkelt att lägga till ett gemensamt prefix till markerade rader i ett textblock (:issue:`13857`).

source: threading
sv: gängning

source: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event`, and :class:`threading.Timer`, all of which used to be factory functions returning a class instance, are now classes and may be subclassed. (Contributed by Éric Araujo in :issue:`10968`.)
sv: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event`, och :class:`threading.Timer`, som alla tidigare var fabriksfunktioner som returnerade en klassinstans, är nu klasser och kan underklassas. (Bidrag från Éric Araujo i :issue:`10968`.)

source: The :class:`threading.Thread` constructor now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag value from the parent thread (:issue:`6064`).
sv: Konstruktorn :class:`threading.Thread` accepterar nu ett nyckelordsargument ``daemon`` för att åsidosätta standardbeteendet att ärva flaggvärdet ``daemon`` från den överordnade tråden (:issue:`6064`).

source: The formerly private function ``_thread.get_ident`` is now available as the public function :func:`threading.get_ident`. This eliminates several cases of direct access to the ``_thread`` module in the stdlib. Third party code that used ``_thread.get_ident`` should likewise be changed to use the new public interface.
sv: Den tidigare privata funktionen ``_thread.get_ident`` är nu tillgänglig som den publika funktionen :func:`threading.get_ident`. Detta eliminerar flera fall av direktåtkomst till ``_thread``-modulen i stdlib. Tredjepartskod som använde ``_thread.get_ident`` bör också ändras för att använda det nya publika gränssnittet.

source: time
sv: tid

source: The :pep:`418` added new functions to the :mod:`time` module:
sv: Med :pep:`418` lades nya funktioner till i modulen :mod:`time`:

source: :func:`~time.get_clock_info`: Get information on a clock.
sv: :func:`~time.get_clock_info`: Hämta information om en klocka.

source: :func:`~time.monotonic`: Monotonic clock (cannot go backward), not affected by system clock updates.
sv: :func:`~time.monotonic`: Monotonisk klocka (kan inte gå bakåt), påverkas inte av uppdateringar av systemklockan.

source: :func:`~time.perf_counter`: Performance counter with the highest available resolution to measure a short duration.
sv: :func:`~time.perf_counter`: Prestandaräknare med högsta tillgängliga upplösning för att mäta en kort varaktighet.

source: :func:`~time.process_time`: Sum of the system and user CPU time of the current process.
sv: :func:`~time.process_time`: Summan av systemets och användarens CPU-tid för den aktuella processen.

source: Other new functions:
sv: Andra nya funktioner:

source: :func:`~time.clock_getres`, :func:`~time.clock_gettime` and :func:`~time.clock_settime` functions with :samp:`CLOCK_{xxx}` constants. (Contributed by Victor Stinner in :issue:`10278`.)
sv: :func:`~time.clock_getres`, :func:`~time.clock_gettime` och :func:`~time.clock_settime` funktioner med :samp:`CLOCK_{xxx}` konstanter. (Bidrag från Victor Stinner i :issue:`10278`.)

source: To improve cross platform consistency, :func:`~time.sleep` now raises a :exc:`ValueError` when passed a negative sleep value. Previously this was an error on posix, but produced an infinite sleep on Windows.
sv: För att förbättra konsistensen mellan plattformar ger :func:`~time.sleep` nu upphov till ett :exc:`ValueError` när ett negativt sömnvärde skickas. Tidigare var detta ett fel på posix, men producerade en oändlig sömn på Windows.

source: types
sv: typer

source: Add a new :class:`types.MappingProxyType` class: Read-only proxy of a mapping. (:issue:`14386`)
sv: Lägg till en ny :class:`types.MappingProxyType`-klass: Skrivskyddad proxy för en mappning. (:issue:`14386`)

source: The new functions :func:`types.new_class` and :func:`types.prepare_class` provide support for :pep:`3115` compliant dynamic type creation. (:issue:`14588`)
sv: De nya funktionerna :func:`types.new_class` och :func:`types.prepare_class` ger stöd för dynamisk typskapning i enlighet med :pep:`3115`. (:issue:`14588`)

source: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns`, and :meth:`.assertWarnsRegex` now accept a keyword argument *msg* when used as context managers. (Contributed by Ezio Melotti and Winston Ewert in :issue:`10775`.)
sv: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns` och :meth:`.assertWarnsRegex` accepterar nu ett nyckelordsargument *msg* när de används som kontexthanterare. (Bidrag från Ezio Melotti och Winston Ewert i :issue:`10775`.)

source: :meth:`unittest.TestCase.run` now returns the :class:`~unittest.TestResult` object.
sv: :meth:`unittest.TestCase.run` returnerar nu :class:`~unittest.TestResult`-objektet.

source: The :class:`~urllib.request.Request` class, now accepts a *method* argument used by :meth:`~urllib.request.Request.get_method` to determine what HTTP method should be used. For example, this will send a ``'HEAD'`` request::
sv: Klassen :class:`~urllib.request.Request` accepterar nu ett *method*-argument som används av :meth:`~urllib.request.Request.get_method` för att avgöra vilken HTTP-metod som ska användas. Till exempel kommer detta att skicka en ``'HEAD'`` begäran::

source: (:issue:`1673007`)
sv: (:utgåva:`1673007`)

source: webbrowser
sv: webbläsare

source: The :mod:`webbrowser` module supports more "browsers": Google Chrome (named :program:`chrome`, :program:`chromium`, :program:`chrome-browser` or :program:`chromium-browser` depending on the version and operating system), and the generic launchers :program:`xdg-open`, from the FreeDesktop.org project, and :program:`gvfs-open`, which is the default URI handler for GNOME 3. (The former contributed by Arnaud Calmettes in :issue:`13620`, the latter by Matthias Klose in :issue:`14493`.)
sv: Modulen :mod:`webbrowser` stöder fler "webbläsare": Google Chrome (med namnen :program:`chrome`, :program:`chromium`, :program:`chrome-browser` eller :program:`chromium-browser` beroende på version och operativsystem), och de generiska startprogrammen :program:`xdg-open`, från FreeDesktop.org-projektet, och :program:`gvfs-open`, som är standard URI-hanteraren för GNOME 3. (Det förstnämnda bidraget kommer från Arnaud Calmettes i :issue:`13620`, det sistnämnda från Matthias Klose i :issue:`14493`)

source: The :mod:`xml.etree.ElementTree` module now imports its C accelerator by default; there is no longer a need to explicitly import :mod:`xml.etree.cElementTree` (this module stays for backwards compatibility, but is now deprecated). In addition, the ``iter`` family of methods of :class:`~xml.etree.ElementTree.Element` has been optimized (rewritten in C). The module's documentation has also been greatly improved with added examples and a more detailed reference.
sv: Modulen :mod:`xml.etree.ElementTree` importerar nu sin C-accelerator som standard; det finns inte längre något behov av att uttryckligen importera :mod:`xml.etree.cElementTree` (denna modul finns kvar för bakåtkompatibilitet, men är nu avskriven). Dessutom har ``iter``-familjen av metoder i :class:`~xml.etree.ElementTree.Element` optimerats (omskrivna i C). Modulens dokumentation har också förbättrats avsevärt med fler exempel och en mer detaljerad referens.

source: New attribute :attr:`zlib.Decompress.eof` makes it possible to distinguish between a properly formed compressed stream and an incomplete or truncated one. (Contributed by Nadeem Vawda in :issue:`12646`.)
sv: Det nya attributet :attr:`zlib.Decompress.eof` gör det möjligt att skilja mellan en korrekt formad komprimerad ström och en ofullständig eller avkortad ström. (Bidrag från Nadeem Vawda i :issue:`12646`.)

source: New attribute :const:`zlib.ZLIB_RUNTIME_VERSION` reports the version string of the underlying ``zlib`` library that is loaded at runtime. (Contributed by Torsten Landschoff in :issue:`12306`.)
sv: Nytt attribut :const:`zlib.ZLIB_RUNTIME_VERSION` rapporterar versionssträngen för det underliggande ``zlib``-biblioteket som laddas vid körning. (Bidrag från Torsten Landschoff i :issue:`12306`.)

source: Optimizations
sv: Optimeringar

source: Major performance enhancements have been added:
sv: Stora prestandaförbättringar har lagts till:

source: Thanks to :pep:`393`, some operations on Unicode strings have been optimized:
sv: Tack vare :pep:`393` har vissa operationer på Unicode-strängar optimerats:

source: the memory footprint is divided by 2 to 4 depending on the text
sv: minnesavtrycket delas med 2 till 4 beroende på texten

source: encode an ASCII string to UTF-8 doesn't need to encode characters anymore, the UTF-8 representation is shared with the ASCII representation
sv: koda en ASCII-sträng till UTF-8 behöver inte koda tecken längre, UTF-8-representationen delas med ASCII-representationen

source: the UTF-8 encoder has been optimized
sv: uTF-8-kodaren har optimerats

source: repeating a single ASCII letter and getting a substring of an ASCII string is 4 times faster
sv: att upprepa en enda ASCII-bokstav och få en delsträng av en ASCII-sträng är 4 gånger snabbare

source: UTF-8 is now 2x to 4x faster. UTF-16 encoding is now up to 10x faster.
sv: UTF-8 är nu 2x till 4x snabbare. UTF-16-kodning är nu upp till 10x snabbare.

source: (Contributed by Serhiy Storchaka, :issue:`14624`, :issue:`14738` and :issue:`15026`.)
sv: (Bidrag från Serhiy Storchaka, :issue:`14624`, :issue:`14738` och :issue:`15026`.)

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Changes to Python's build process and to the C API include:
sv: Ändringar i Pythons byggprocess och i C API inkluderar:

source: New :pep:`3118` related function:
sv: Ny :pep:`3118` relaterad funktion:

source: :pep:`393` added new Unicode types, macros and functions:
sv: :pep:`393` lade till nya Unicode-typer, makron och funktioner:

source: High-level API:
sv: API på hög nivå:

source: Low-level API:
sv: API på låg nivå:

source: :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4` types
sv: :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4` typer

source: :c:type:`PyASCIIObject` and :c:type:`PyCompactUnicodeObject` structures
sv: :c:type:`PyASCIIObject` och :c:type:`PyCompactUnicodeObject` strukturer

source: :c:macro:`PyUnicode_KIND` with :c:enum:`PyUnicode_Kind` enum: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`
sv: :c:macro:`PyUnicode_KIND` med :c:enum:`PyUnicode_Kind` enum: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`

source: :c:macro:`PyArg_ParseTuple` now accepts a :class:`bytearray` for the ``c`` format (:issue:`12380`).
sv: :c:macro:`PyArg_ParseTuple` accepterar nu en :class:`bytearray` för ``c``-formatet (:issue:`12380`).

source: Deprecated
sv: Föråldrat

source: Unsupported Operating Systems
sv: Operativsystem som inte stöds

source: OS/2 and VMS are no longer supported due to the lack of a maintainer.
sv: OS/2 och VMS stöds inte längre på grund av avsaknad av en underhållare.

source: Windows 2000 and Windows platforms which set ``COMSPEC`` to ``command.com`` are no longer supported due to maintenance burden.
sv: Windows 2000 och Windows-plattformar som ställer in ``COMSPEC`` till ``command.com`` stöds inte längre på grund av underhållsbehov.

source: OSF support, which was deprecated in 3.2, has been completely removed.
sv: OSF-stödet, som inte längre var aktuellt i 3.2, har tagits bort helt.

source: Deprecated Python modules, functions and methods
sv: Föråldrade Python-moduler, -funktioner och -metoder

source: Passing a non-empty string to ``object.__format__()`` is deprecated, and will produce a :exc:`TypeError` in Python 3.4 (:issue:`9856`).
sv: Att skicka en icke-tom sträng till ``object.__format__()`` är föråldrat, och kommer att producera en :exc:`TypeError` i Python 3.4 (:issue:`9856`).

source: The ``unicode_internal`` codec has been deprecated because of the :pep:`393`, use UTF-8, UTF-16 (``utf-16-le`` or ``utf-16-be``), or UTF-32 (``utf-32-le`` or ``utf-32-be``)
sv: Codec ``unicode_internal`` har utgått på grund av :pep:`393`, använd UTF-8, UTF-16 (``utf-16-le`` eller ``utf-16-be``), eller UTF-32 (``utf-32-le`` eller ``utf-32-be``)

source: :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`: use :meth:`ftplib.FTP.mlsd`
sv: :meth:`ftplib.FTP.nlst` och :meth:`ftplib.FTP.dir`: använd :meth:`ftplib.FTP.mlsd`

source: :func:`platform.popen`: use the :mod:`subprocess` module. Check especially the :ref:`subprocess-replacements` section (:issue:`11377`).
sv: :func:`platform.popen`: använd modulen :mod:`subprocess`. Kontrollera särskilt :ref:`subprocess-replacements` avsnittet (:issue:`11377`).

source: :issue:`13374`: The Windows bytes API has been deprecated in the :mod:`os` module. Use Unicode filenames, instead of bytes filenames, to not depend on the ANSI code page anymore and to support any filename.
sv: :issue:`13374`: Windows bytes API har utgått i modulen :mod:`os`. Använd Unicode-filnamn i stället för bytes-filnamn för att inte längre vara beroende av ANSI-kodsidan och för att stödja alla filnamn.

source: :issue:`13988`: The :mod:`xml.etree.cElementTree` module is deprecated. The accelerator is used automatically whenever available.
sv: :issue:`13988`: Modulen :mod:`xml.etree.cElementTree` är föråldrad. Acceleratorn används automatiskt när den är tillgänglig.

source: The behaviour of :func:`time.clock` depends on the platform: use the new :func:`time.perf_counter` or :func:`time.process_time` function instead, depending on your requirements, to have a well defined behaviour.
sv: Beteendet för :func:`time.clock` beror på plattformen: använd den nya funktionen :func:`time.perf_counter` eller :func:`time.process_time` istället, beroende på dina krav, för att få ett väldefinierat beteende.

source: The :func:`os.stat_float_times` function is deprecated.
sv: Funktionen :func:`os.stat_float_times` är föråldrad.

source: :mod:`abc` module:
sv: :mod:`abc` modul:

source: :mod:`importlib` package:
sv: :mod:`importlib` paket:

source: :meth:`importlib.abc.SourceLoader.path_mtime` is now deprecated in favour of :meth:`importlib.abc.SourceLoader.path_stats` as bytecode files now store both the modification time and size of the source file the bytecode file was compiled from.
sv: :meth:`importlib.abc.SourceLoader.path_mtime` är nu föråldrad till förmån för :meth:`importlib.abc.SourceLoader.path_stats` eftersom bytecode-filer nu lagrar både modifieringstiden och storleken på källfilen som bytecode-filen kompilerades från.

source: Deprecated functions and types of the C API
sv: Föråldrade funktioner och typer i C API

source: The :c:type:`Py_UNICODE` has been deprecated by :pep:`393` and will be removed in Python 4. All functions using this type are deprecated:
sv: :c:type:`Py_UNICODE` har blivit föråldrad av :pep:`393` och kommer att tas bort i Python 4. Alla funktioner som använder denna typ är föråldrade:

source: Unicode functions and methods using :c:type:`Py_UNICODE` and :c:expr:`Py_UNICODE*` types:
sv: Unicode-funktioner och -metoder som använder typerna :c:type:`Py_UNICODE` och :c:expr:`Py_UNICODE*`:

source: :c:macro:`!PyUnicode_FromUnicode`: use :c:func:`PyUnicode_FromWideChar` or :c:func:`PyUnicode_FromKindAndData`
sv: :c:macro:`!PyUnicode_FromUnicode`: använd :c:func:`PyUnicode_FromWideChar` eller :c:func:`PyUnicode_FromKindAndData`

source: :c:macro:`!PyUnicode_AS_UNICODE`, :c:func:`!PyUnicode_AsUnicode`, :c:func:`!PyUnicode_AsUnicodeAndSize`: use :c:func:`PyUnicode_AsWideCharString`
sv: :c:macro:`!PyUnicode_AS_UNICODE`, :c:func:`!PyUnicode_AsUnicode`, :c:func:`!PyUnicode_AsUnicodeAndSize`: använd :c:func:`PyUnicode_AsWideCharString`

source: :c:macro:`!PyUnicode_AS_DATA`: use :c:macro:`PyUnicode_DATA` with :c:macro:`PyUnicode_READ` and :c:macro:`PyUnicode_WRITE`
sv: :c:macro:`!PyUnicode_AS_DATA`: använd :c:macro:`PyUnicode_DATA` med :c:macro:`PyUnicode_READ` och :c:macro:`PyUnicode_WRITE`

source: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: use :c:macro:`PyUnicode_GET_LENGTH` or :c:func:`PyUnicode_GetLength`
sv: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: använd :c:macro:`PyUnicode_GET_LENGTH` eller :c:func:`PyUnicode_GetLength`

source: :c:macro:`!PyUnicode_GET_DATA_SIZE`: use ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (only work on ready strings)
sv: :c:macro:`!PyUnicode_GET_DATA_SIZE`: använd ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (fungerar bara på färdiga strängar)

source: :c:func:`!PyUnicode_AsUnicodeCopy`: use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString`
sv: :c:func:`!PyUnicode_AsUnicodeCopy`: använd :c:func:`PyUnicode_AsUCS4Copy` eller :c:func:`PyUnicode_AsWideCharString`

source: Functions and macros manipulating Py_UNICODE* strings:
sv: Funktioner och makron som manipulerar Py_UNICODE*-strängar:

source: :c:macro:`!Py_UNICODE_strlen()`: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
sv: :c:macro:`!Py_UNICODE_strlen()`: använd :c:func:`PyUnicode_GetLength` eller :c:macro:`PyUnicode_GET_LENGTH`

source: :c:macro:`!Py_UNICODE_strcat()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
sv: :c:macro:`!Py_UNICODE_strcat()`: använd :c:func:`PyUnicode_CopyCharacters` eller :c:func:`PyUnicode_FromFormat`

source: :c:macro:`!Py_UNICODE_strcpy()`, :c:macro:`!Py_UNICODE_strncpy()`, :c:macro:`!Py_UNICODE_COPY()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
sv: :c:macro:`!Py_UNICODE_strcpy()`, :c:macro:`!Py_UNICODE_strncpy()`, :c:macro:`!Py_UNICODE_COPY()`: använd :c:func:`PyUnicode_CopyCharacters` eller :c:func:`PyUnicode_Substring`

source: :c:macro:`!Py_UNICODE_strcmp()`: use :c:func:`PyUnicode_Compare`
sv: :c:macro:`!Py_UNICODE_strcmp()`: använd :c:func:`PyUnicode_Compare`

source: :c:macro:`!Py_UNICODE_strncmp()`: use :c:func:`PyUnicode_Tailmatch`
sv: :c:macro:`!Py_UNICODE_strncmp()`: använd :c:func:`PyUnicode_Tailmatch`

source: Encoders:
sv: Kodare:

source: :c:func:`!PyUnicode_Encode`: use :c:func:`!PyUnicode_AsEncodedObject`
sv: :c:func:`!PyUnicode_Encode`: använd :c:func:`!PyUnicode_AsEncodedObject`

source: :c:func:`!PyUnicode_EncodeUTF8`: use :c:func:`PyUnicode_AsUTF8` or :c:func:`PyUnicode_AsUTF8String`
sv: :c:func:`!PyUnicode_EncodeUTF8`: använd :c:func:`PyUnicode_AsUTF8` eller :c:func:`PyUnicode_AsUTF8String`

source: :c:func:`!PyUnicode_EncodeLatin1`: use :c:func:`PyUnicode_AsLatin1String`
sv: :c:func:`!PyUnicode_EncodeLatin1`: använd :c:func:`PyUnicode_AsLatin1String`

source: :c:func:`!PyUnicode_EncodeASCII`: use :c:func:`PyUnicode_AsASCIIString`
sv: :c:func:`!PyUnicode_EncodeASCII`: använd :c:func:`PyUnicode_AsASCIIString`

source: :c:func:`!PyUnicode_EncodeMBCS`: use :c:func:`PyUnicode_AsMBCSString` or :c:func:`PyUnicode_EncodeCodePage` (with ``CP_ACP`` code_page)
sv: :c:func:`!PyUnicode_EncodeMBCS`: använd :c:func:`PyUnicode_AsMBCSString` eller :c:func:`PyUnicode_EncodeCodePage` (med kodsidan ``CP_ACP``)
