Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: What's New In Python 3.3
sv: Vad är nytt i Python 3.3

source: This article explains the new features in Python 3.3, compared to 3.2. Python 3.3 was released on September 29, 2012. For full details, see the `changelog <https://docs.python.org/3.3/whatsnew/changelog.html>`_.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.3 jämfört med 3.2. Python 3.3 släpptes den 29 september 2012. För fullständig information, se `changelog <https://docs.python.org/3.3/whatsnew/changelog.html>`_.

source: :pep:`398` - Python 3.3 Release Schedule
sv: :pep:`398` - Python 3.3 Utgivningsschema

source: Summary -- Release highlights
sv: Sammanfattning -- Release highlights

source: New syntax features:
sv: Nya syntaxfunktioner:

source: New ``yield from`` expression for :ref:`generator delegation <pep-380>`.
sv: Nytt ``yield from`` uttryck för :ref:`generator delegation <pep-380>`.

source: The ``u'unicode'`` syntax is accepted again for :class:`str` objects.
sv: Syntaxen ``u'unicode'`` accepteras igen för :class:`str`-objekt.

source: New library modules:
sv: Nya biblioteksmoduler:

source: :mod:`faulthandler` (helps debugging low-level crashes)
sv: :mod:`faulthandler` (hjälper till att felsöka krascher på låg nivå)

source: :mod:`ipaddress` (high-level objects representing IP addresses and masks)
sv: :mod:`ipaddress` (högnivåobjekt som representerar IP-adresser och masker)

source: :mod:`lzma` (compress data using the XZ / LZMA algorithm)
sv: :mod:`lzma` (komprimera data med hjälp av XZ/LZMA-algoritmen)

source: :mod:`unittest.mock` (replace parts of your system under test with mock objects)
sv: :mod:`unittest.mock` (ersätt delar av ditt system under test med låtsasobjekt)

source: :mod:`venv` (Python :ref:`virtual environments <pep-405>`, as in the popular ``virtualenv`` package)
sv: :mod:`venv` (Python :ref:`virtuella miljöer <pep-405>`, som i det populära paketet ``virtualenv``)

source: New built-in features:
sv: Nya inbyggda funktioner:

source: Reworked :ref:`I/O exception hierarchy <pep-3151>`.
sv: Omarbetad :ref:`I/O undantagshierarki <pep-3151>`.

source: Implementation improvements:
sv: Förbättringar av genomförandet:

source: Rewritten :ref:`import machinery <importlib>` based on :mod:`importlib`.
sv: Omskriven :ref:`import machinery <importlib>` baserat på :mod:`importlib`.

source: More compact :ref:`unicode strings <pep-393>`.
sv: Mer kompakt :ref:`unicode strängar <pep-393>`.

source: More compact :ref:`attribute dictionaries <pep-412>`.
sv: Mer kompakt :ref:`attributordböcker <pep-412>`.

source: Significantly Improved Library Modules:
sv: Betydligt förbättrade biblioteksmoduler:

source: C Accelerator for the :ref:`decimal <new-decimal>` module.
sv: C Accelerator för modulen :ref:`decimal <new-decimal>`.

source: Better unicode handling in the :ref:`email <new-email>` module (:term:`provisional <provisional package>`).
sv: Bättre unicode-hantering i modulen :ref:`email <new-email>` (:term:`provisional <provisional package>`).

source: Security improvements:
sv: Förbättringar av säkerheten:

source: Hash randomization is switched on by default.
sv: Hash-randomisering är aktiverad som standard.

source: Please read on for a comprehensive list of user-facing changes.
sv: Läs vidare för en omfattande lista över förändringar som riktar sig till användarna.

source: PEP 405: Virtual Environments
sv: PEP 405: Virtuella miljöer

source: Virtual environments help create separate Python setups while sharing a system-wide base install, for ease of maintenance. Virtual environments have their own set of private site packages (i.e. locally installed libraries), and are optionally segregated from the system-wide site packages. Their concept and implementation are inspired by the popular ``virtualenv`` third-party package, but benefit from tighter integration with the interpreter core.
sv: Virtuella miljöer hjälper till att skapa separata Python-installationer samtidigt som de delar en systemomfattande basinstallation för att underlätta underhållet. Virtuella miljöer har sin egen uppsättning privata webbplatspaket (dvs. lokalt installerade bibliotek) och är valfritt separerade från de systemomfattande webbplatspaketen. Konceptet och implementeringen är inspirerat av det populära tredjepartspaketet ``virtualenv``, men har en tätare integration med tolkens kärna.

source: This PEP adds the :mod:`venv` module for programmatic access, and the ``pyvenv`` script for command-line access and administration. The Python interpreter checks for a ``pyvenv.cfg``, file whose existence signals the base of a virtual environment's directory tree.
sv: Denna PEP lägger till modulen :mod:`venv` för programmatisk åtkomst och skriptet ``pyvenv`` för kommandoradsåtkomst och administration. Python-tolken kontrollerar om det finns en "pyvenv.cfg"-fil, vars existens signalerar basen i en virtuell miljös katalogträd.

source: :pep:`405` - Python Virtual Environments
sv: :pep:`405` - Virtuella Python-miljöer

source: PEP written by Carl Meyer; implementation by Carl Meyer and Vinay Sajip
sv: PEP skriven av Carl Meyer; implementation av Carl Meyer och Vinay Sajip

source: PEP 420: Implicit Namespace Packages
sv: PEP 420: Implicita namnrymdsförpackningar

source: Native support for package directories that don't require ``__init__.py`` marker files and can automatically span multiple path segments (inspired by various third party approaches to namespace packages, as described in :pep:`420`)
sv: Inbyggt stöd för paketkataloger som inte kräver ``__init__.py``-markörfiler och som automatiskt kan sträcka sig över flera sökvägssegment (inspirerat av olika tredjepartsansatser för namnområdespaket, som beskrivs i :pep:`420`)

source: :pep:`420` - Implicit Namespace Packages
sv: :pep:`420` - Implicita paket i namnrymden

source: PEP written by Eric V. Smith; implementation by Eric V. Smith and Barry Warsaw
sv: PEP utarbetat av Eric V. Smith; genomförande av Eric V. Smith och Barry Warsaw

source: PEP 3118: New memoryview implementation and buffer protocol documentation
sv: PEP 3118: Ny implementering av memoryview och dokumentation av buffertprotokoll

source: The implementation of :pep:`3118` has been significantly improved.
sv: Implementeringen av :pep:`3118` har förbättrats avsevärt.

source: The new memoryview implementation comprehensively fixes all ownership and lifetime issues of dynamically allocated fields in the Py_buffer struct that led to multiple crash reports. Additionally, several functions that crashed or returned incorrect results for non-contiguous or multi-dimensional input have been fixed.
sv: Den nya implementeringen av memoryview åtgärdar alla ägande- och livstidsproblem med dynamiskt allokerade fält i Py_buffer-strukturen som ledde till flera kraschrapporter. Dessutom har flera funktioner som kraschade eller returnerade felaktiga resultat för icke-sammanhängande eller flerdimensionell indata åtgärdats.

source: The memoryview object now has a PEP-3118 compliant getbufferproc() that checks the consumer's request type. Many new features have been added, most of them work in full generality for non-contiguous arrays and arrays with suboffsets.
sv: Memoryview-objektet har nu en PEP-3118-kompatibel getbufferproc() som kontrollerar konsumentens begärandetyp. Många nya funktioner har lagts till, de flesta av dem fungerar i full generalitet för icke sammanhängande arrayer och arrayer med suboffsets.

source: The documentation has been updated, clearly spelling out responsibilities for both exporters and consumers. Buffer request flags are grouped into basic and compound flags. The memory layout of non-contiguous and multi-dimensional NumPy-style arrays is explained.
sv: Dokumentationen har uppdaterats och anger tydligt ansvarsområdena för både exportörer och konsumenter. Flaggor för buffertbegäran är indelade i grundläggande och sammansatta flaggor. Minneslayouten för icke-sammanhängande och flerdimensionella matriser i NumPy-stil förklaras.

source: Features
sv: Funktioner

source: All native single character format specifiers in struct module syntax (optionally prefixed with '@') are now supported.
sv: Alla inbyggda formatspecifikatorer för enstaka tecken i struct-modulsyntax (eventuellt med prefixet '@') stöds nu.

source: With some restrictions, the cast() method allows changing of format and shape of C-contiguous arrays.
sv: Med vissa begränsningar kan cast()-metoden ändra format och form på C-slutna matriser.

source: Multi-dimensional list representations are supported for any array type.
sv: Flerdimensionella listrepresentationer stöds för alla array-typer.

source: Multi-dimensional comparisons are supported for any array type.
sv: Flerdimensionella jämförelser stöds för alla typer av matriser.

source: One-dimensional memoryviews of hashable (read-only) types with formats B, b or c are now hashable. (Contributed by Antoine Pitrou in :issue:`13411`.)
sv: Endimensionella minnesvyer av hashbara (skrivskyddade) typer med formaten B, b eller c är nu hashbara. (Bidrag från Antoine Pitrou i :issue:`13411`.)

source: Arbitrary slicing of any 1-D arrays type is supported. For example, it is now possible to reverse a memoryview in *O*\ (1) by using a negative step.
sv: Stöd finns för godtycklig skivning av alla typer av 1-D matriser. Till exempel är det nu möjligt att vända en minnesvy i *O*\ (1) genom att använda ett negativt steg.

source: API changes
sv: API-ändringar

source: The maximum number of dimensions is officially limited to 64.
sv: Det maximala antalet dimensioner är officiellt begränsat till 64.

source: The representation of empty shape, strides and suboffsets is now an empty tuple instead of ``None``.
sv: Representationen av tom form, strides och suboffsets är nu en tom tupel istället för ``None``.

source: Accessing a memoryview element with format 'B' (unsigned bytes) now returns an integer (in accordance with the struct module syntax). For returning a bytes object the view must be cast to 'c' first.
sv: Åtkomst till ett memoryview-element med formatet 'B' (unsigned bytes) returnerar nu ett heltal (i enlighet med struct-modulens syntax). För att returnera ett bytes-objekt måste vyn först castas till 'c'.

source: memoryview comparisons now use the logical structure of the operands and compare all array elements by value. All format strings in struct module syntax are supported. Views with unrecognised format strings are still permitted, but will always compare as unequal, regardless of view contents.
sv: memoryview-jämförelser använder nu operandernas logiska struktur och jämför alla arrayelement med värde. Alla formatsträngar i struct-modulsyntax stöds. Vyer med formatsträngar som inte känns igen är fortfarande tillåtna, men kommer alltid att jämföras som ojämlika, oavsett vyns innehåll.

source: For further changes see `Build and C API Changes`_ and `Porting C code`_.
sv: För ytterligare ändringar se `Build and C API Changes`_ och `Porting C code`_.

source: (Contributed by Stefan Krah in :issue:`10181`.)
sv: (Bidrag från Stefan Krah i :issue:`10181`.)

source: :pep:`3118` - Revising the Buffer Protocol
sv: :pep:`3118` - Revidering av buffertprotokollet

source: PEP 393: Flexible String Representation
sv: PEP 393: Flexibel strängrepresentation

source: The Unicode string type is changed to support multiple internal representations, depending on the character with the largest Unicode ordinal (1, 2, or 4 bytes) in the represented string. This allows a space-efficient representation in common cases, but gives access to full UCS-4 on all systems. For compatibility with existing APIs, several representations may exist in parallel; over time, this compatibility should be phased out.
sv: Unicode-strängtypen ändras för att stödja flera interna representationer, beroende på tecknet med den största Unicode-ordinalen (1, 2 eller 4 byte) i den representerade strängen. Detta möjliggör en utrymmeseffektiv representation i vanliga fall, men ger tillgång till fullständig UCS-4 på alla system. För kompatibilitet med befintliga API:er kan flera representationer existera parallellt; med tiden bör denna kompatibilitet fasas ut.

source: On the Python side, there should be no downside to this change.
sv: På Python-sidan bör det inte finnas några nackdelar med denna förändring.

source: On the C API side, :pep:`393` is fully backward compatible. The legacy API should remain available at least five years. Applications using the legacy API will not fully benefit of the memory reduction, or - worse - may use a bit more memory, because Python may have to maintain two versions of each string (in the legacy format and in the new efficient storage).
sv: På C API-sidan är :pep:`393` helt bakåtkompatibel. Det äldre API:et bör vara tillgängligt i minst fem år. Program som använder det äldre API:et kommer inte att dra full nytta av minnesminskningen, eller - ännu värre - kan använda lite mer minne, eftersom Python kan behöva underhålla två versioner av varje sträng (i det äldre formatet och i den nya effektiva lagringen).

source: Functionality
sv: Funktionalitet

source: Changes introduced by :pep:`393` are the following:
sv: Ändringar införda av :pep:`393` är följande:

source: Python now always supports the full range of Unicode code points, including non-BMP ones (i.e. from ``U+0000`` to ``U+10FFFF``). The distinction between narrow and wide builds no longer exists and Python now behaves like a wide build, even under Windows.
sv: Python stöder nu alltid hela utbudet av Unicode-kodpunkter, inklusive icke-BMP-kodpunkter (dvs. från ``U+0000`` till ``U+10FFFF``). Skillnaden mellan narrow och wide builds finns inte längre och Python beter sig nu som en wide build, även under Windows.

source: With the death of narrow builds, the problems specific to narrow builds have also been fixed, for example:
sv: Med döden för smala byggnader har de problem som är specifika för smala byggnader också åtgärdats, till exempel:

source: :func:`len` now always returns 1 for non-BMP characters, so ``len('\U0010FFFF') == 1``;
sv: :func:`len` returnerar nu alltid 1 för icke-BMP-tecken, så ``len('\U0010FFFF') == 1``;

source: surrogate pairs are not recombined in string literals, so ``'\uDBFF\uDFFF' != '\U0010FFFF'``;
sv: surrogatpar kombineras inte om i stränglitteraler, så ``'\uDBFF\uDFFF' != '\U0010FFFF'``;

source: indexing or slicing non-BMP characters returns the expected value, so ``'\U0010FFFF'[0]`` now returns ``'\U0010FFFF'`` and not ``'\uDBFF'``;
sv: indexering eller skärning av icke-BMP-tecken returnerar det förväntade värdet, så ``'\U0010FFFF'[0]`` returnerar nu ``'\U0010FFFF'`` och inte ``'\uDBFF'``;

source: all other functions in the standard library now correctly handle non-BMP code points.
sv: alla andra funktioner i standardbiblioteket hanterar nu korrekt icke-BMP-kodpunkter.

source: The value of :data:`sys.maxunicode` is now always ``1114111`` (``0x10FFFF`` in hexadecimal). The :c:func:`!PyUnicode_GetMax` function still returns either ``0xFFFF`` or ``0x10FFFF`` for backward compatibility, and it should not be used with the new Unicode API (see :issue:`13054`).
sv: Värdet för :data:`sys.maxunicode` är nu alltid ``1114111`` (``0x10FFFF`` i hexadecimal). Funktionen :c:func:`!PyUnicode_GetMax` returnerar fortfarande antingen ``0xFFFF`` eller ``0x10FFFF`` för bakåtkompatibilitet, och den bör inte användas med det nya Unicode API:et (se :issue:`13054`).

source: The :file:`./configure` flag ``--with-wide-unicode`` has been removed.
sv: Flaggan :file:`./configure` ``--with-wide-unicode`` har tagits bort.

source: Performance and resource usage
sv: Prestanda och resursanvändning

source: The storage of Unicode strings now depends on the highest code point in the string:
sv: Lagringen av Unicode-strängar beror nu på den högsta kodpunkten i strängen:

source: pure ASCII and Latin1 strings (``U+0000-U+00FF``) use 1 byte per code point;
sv: rena ASCII- och Latin1-strängar (``U+0000-U+00FF``) använder 1 byte per kodpunkt;

source: BMP strings (``U+0000-U+FFFF``) use 2 bytes per code point;
sv: BMP-strängar (``U+0000-U+FFFF``) använder 2 byte per kodpunkt;

source: non-BMP strings (``U+10000-U+10FFFF``) use 4 bytes per code point.
sv: icke-BMP-strängar (``U+10000-U+10FFFF``) använder 4 byte per kodpunkt.

source: The net effect is that for most applications, memory usage of string storage should decrease significantly - especially compared to former wide unicode builds - as, in many cases, strings will be pure ASCII even in international contexts (because many strings store non-human language data, such as XML fragments, HTTP headers, JSON-encoded data, etc.). We also hope that it will, for the same reasons, increase CPU cache efficiency on non-trivial applications. The memory usage of Python 3.3 is two to three times smaller than Python 3.2, and a little bit better than Python 2.7, on a Django benchmark (see the PEP for details).
sv: Nettoeffekten är att för de flesta applikationer bör minnesanvändningen för stränglagring minska avsevärt - särskilt jämfört med tidigare breda unicode-byggnader - eftersom strängar i många fall kommer att vara ren ASCII även i internationella sammanhang (eftersom många strängar lagrar data som inte är mänskligt språk, t.ex. XML-fragment, HTTP-rubriker, JSON-kodade data etc.). Vi hoppas också att det, av samma skäl, kommer att öka CPU-cacheeffektiviteten i icke-triviala applikationer. Minnesanvändningen för Python 3.3 är två till tre gånger mindre än för Python 3.2 och lite bättre än för Python 2.7 i ett Django-benchmark (se PEP för detaljer).

source: :pep:`393` - Flexible String Representation
sv: :pep:`393` - Flexibel strängrepresentation

source: PEP written by Martin von Löwis; implementation by Torsten Becker and Martin von Löwis.
sv: PEP skriven av Martin von Löwis; implementation av Torsten Becker och Martin von Löwis.

source: PEP 397: Python Launcher for Windows
sv: PEP 397: Python Launcher för Windows

source: The Python 3.3 Windows installer now includes a ``py`` launcher application that can be used to launch Python applications in a version independent fashion.
sv: Windows-installationsprogrammet för Python 3.3 innehåller nu en startapplikation för Python som kan användas för att starta Python-applikationer på ett versionsoberoende sätt.

source: This launcher is invoked implicitly when double-clicking ``*.py`` files. If only a single Python version is installed on the system, that version will be used to run the file. If multiple versions are installed, the most recent version is used by default, but this can be overridden by including a Unix-style "shebang line" in the Python script.
sv: Den här startprogrammet anropas implicit när man dubbelklickar på ``*.py``-filer. Om bara en enda Python-version är installerad på systemet kommer den versionen att användas för att köra filen. Om flera versioner är installerade används den senaste versionen som standard, men detta kan åsidosättas genom att inkludera en Unix-liknande "shebang-rad" i Python-skriptet.

source: The launcher can also be used explicitly from the command line as the ``py`` application. Running ``py`` follows the same version selection rules as implicitly launching scripts, but a more specific version can be selected by passing appropriate arguments (such as ``-3`` to request Python 3 when Python 2 is also installed, or ``-2.6`` to specifically request an earlier Python version when a more recent version is installed).
sv: Startprogrammet kan också användas explicit från kommandoraden som programmet ``py``. Att köra ``py`` följer samma regler för versionsval som implicit start av skript, men en mer specifik version kan väljas genom att skicka lämpliga argument (t.ex. ``-3`` för att begära Python 3 när Python 2 också är installerat, eller ``-2.6`` för att specifikt begära en tidigare Python-version när en nyare version är installerad).

source: In addition to the launcher, the Windows installer now includes an option to add the newly installed Python to the system PATH. (Contributed by Brian Curtin in :issue:`3561`.)
sv: Förutom startprogrammet innehåller Windows-installationsprogrammet nu ett alternativ för att lägga till det nyinstallerade Python i systemets PATH. (Bidrag från Brian Curtin i :issue:`3561`.)

source: :pep:`397` - Python Launcher for Windows
sv: :pep:`397` - Python Launcher för Windows

source: PEP written by Mark Hammond and Martin v. Löwis; implementation by Vinay Sajip.
sv: PEP skriven av Mark Hammond och Martin v. Löwis; implementation av Vinay Sajip.

source: Launcher documentation: :ref:`launcher`
sv: Dokumentation om startprogrammet: :ref:`launcher`

source: Installer PATH modification: :ref:`windows-path-mod`
sv: Ändring av installationsprogrammets PATH: :ref:`windows-path-mod`

source: PEP 3151: Reworking the OS and IO exception hierarchy
sv: PEP 3151: Omarbetning av undantagshierarkin för OS och IO

source: The hierarchy of exceptions raised by operating system errors is now both simplified and finer-grained.
sv: Hierarkin av undantag som orsakas av fel i operativsystemet är nu både förenklad och mer finkornig.

source: You don't have to worry anymore about choosing the appropriate exception type between :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error`, :exc:`socket.error` or :exc:`select.error`. All these exception types are now only one: :exc:`OSError`. The other names are kept as aliases for compatibility reasons.
sv: Du behöver inte längre oroa dig för att välja rätt undantagstyp mellan :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error`, :exc:`socket.error` eller :exc:`select.error`. Alla dessa undantagstyper är nu bara en: :exc:`OSError`. De andra namnen behålls som alias av kompatibilitetsskäl.

source: Also, it is now easier to catch a specific error condition. Instead of inspecting the ``errno`` attribute (or ``args[0]``) for a particular constant from the :mod:`errno` module, you can catch the adequate :exc:`OSError` subclass. The available subclasses are the following:
sv: Det är nu också lättare att fånga upp ett specifikt feltillstånd. Istället för att inspektera attributet ``errno`` (eller ``args[0]``) för en viss konstant från modulen :mod:`errno`, kan du fånga den lämpliga underklassen :exc:`OSError`. De tillgängliga underklasserna är följande:

source: :exc:`ConnectionError`
sv: :exc:`AnslutningFel`

source: :exc:`InterruptedError`
sv: :exc:`AvbrutetFel`

source: And the :exc:`ConnectionError` itself has finer-grained subclasses:
sv: Och :exc:`ConnectionError` i sig har finkornigare underklasser:

source: :exc:`ConnectionAbortedError`
sv: :exc:`Fel vid avbruten anslutning`

source: :exc:`ConnectionRefusedError`
sv: :exc:`AnslutningRefusedError`

source: :exc:`ConnectionResetError`
sv: :exc:`Fel vid återställning av anslutning`

source: Thanks to the new exceptions, common usages of the :mod:`errno` can now be avoided. For example, the following code written for Python 3.2::
sv: Tack vare de nya undantagen kan vanliga användningar av :mod:`errno` nu undvikas. Till exempel, följande kod skriven för Python 3.2::

source: from errno import ENOENT, EACCES, EPERM try: with open("document.txt") as f: content = f.read() except IOError as err: if err.errno == ENOENT: print("document.txt file is missing") elif err.errno in (EACCES, EPERM): print("You are not allowed to read document.txt") else: raise
sv: från errno import ENOENT, EACCES, EPERM försök: med open("document.txt") som f: innehåll = f.read() except IOError as err: if err.errno == ENOENT: print("filen document.txt saknas") elif err.errno in (EACCES, EPERM): print("Du har inte tillåtelse att läsa document.txt") else: raise
