Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: In summary, if you use one of the new policies, header manipulation works the way it ought to: your application works with unicode strings, and the email package transparently encodes and decodes the unicode to and from the RFC standard Content Transfer Encodings.
sv: Om du använder en av de nya policyerna fungerar manipuleringen av rubriker som den ska: din applikation arbetar med unicode-strängar och e-postpaketet kodar och avkodar unicode på ett transparent sätt till och från RFC-standarden Content Transfer Encodings.

source: Other API Changes
sv: Andra API-ändringar

source: New :class:`~email.parser.BytesHeaderParser`, added to the :mod:`~email.parser` module to complement :class:`~email.parser.HeaderParser` and complete the Bytes API.
sv: Ny :class:`~email.parser.BytesHeaderParser`, tillagd i modulen :mod:`~email.parser` för att komplettera :class:`~email.parser.HeaderParser` och komplettera Bytes API.

source: New utility functions:
sv: Nya nyttofunktioner:

source: :func:`~email.utils.format_datetime`: given a :class:`~datetime.datetime`, produce a string formatted for use in an email header.
sv: :func:`~email.utils.format_datetime`: givet en :class:`~datetime.datetime`, producera en sträng formaterad för att användas i ett e-posthuvud.

source: :func:`~email.utils.parsedate_to_datetime`: given a date string from an email header, convert it into an aware :class:`~datetime.datetime`, or a naive :class:`~datetime.datetime` if the offset is ``-0000``.
sv: :func:`~email.utils.parsedate_to_datetime`: givet en datumsträng från ett e-posthuvud, konvertera den till en medveten :class:`~datetime.datetime`, eller en naiv :class:`~datetime.datetime` om förskjutningen är ``-0000``.

source: :func:`~email.utils.localtime`: With no argument, returns the current local time as an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`. Given an aware :class:`~datetime.datetime`, converts it into an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`.
sv: :func:`~email.utils.localtime`: Utan argument returneras den aktuella lokala tiden som en medveten :class:`~datetime.datetime` med hjälp av den lokala :class:`~datetime.timezone`. Given an aware :class:`~datetime.datetime`, converts it into an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`.

source: :class:`ftplib.FTP` now accepts a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Giampaolo Rodolà in :issue:`8594`.)
sv: :class:`ftplib.FTP` accepterar nu ett ``source_address`` nyckelordsargument för att ange ``(host, port)`` att använda som källadress i bind-anropet när man skapar den utgående sockeln. (Bidrag från Giampaolo Rodolà i :issue:`8594`.)

source: The :class:`~ftplib.FTP_TLS` class now provides a new :func:`~ftplib.FTP_TLS.ccc` function to revert control channel back to plaintext. This can be useful to take advantage of firewalls that know how to handle NAT with non-secure FTP without opening fixed ports. (Contributed by Giampaolo Rodolà in :issue:`12139`.)
sv: Klassen :class:`~ftplib.FTP_TLS` tillhandahåller nu en ny :func:`~ftplib.FTP_TLS.ccc`-funktion för att återställa kontrollkanalen till klartext. Detta kan vara användbart för att dra nytta av brandväggar som vet hur man hanterar NAT med icke-säker FTP utan att öppna fasta portar. (Bidrag från Giampaolo Rodolà i :issue:`12139`.)

source: Added :meth:`ftplib.FTP.mlsd` method which provides a parsable directory listing format and deprecates :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`. (Contributed by Giampaolo Rodolà in :issue:`11072`.)
sv: Lagt till :meth:`ftplib.FTP.mlsd`-metoden som tillhandahåller ett analyserbart kataloglistningsformat och tar bort :meth:`ftplib.FTP.nlst` och :meth:`ftplib.FTP.dir`. (Bidrag från Giampaolo Rodolà i :issue:`11072`.)

source: The :func:`functools.lru_cache` decorator now accepts a ``typed`` keyword argument (that defaults to ``False`` to ensure that it caches values of different types that compare equal in separate cache slots. (Contributed by Raymond Hettinger in :issue:`13227`.)
sv: Dekoratorn :func:`functools.lru_cache` accepterar nu ett ``typed`` nyckelordsargument (som standard är ``False`` för att säkerställa att den cachar värden av olika typer som jämför lika i separata cacheplatser. (Bidrag från Raymond Hettinger i :issue:`13227`.)

source: It is now possible to register callbacks invoked by the garbage collector before and after collection using the new :data:`~gc.callbacks` list.
sv: Det är nu möjligt att registrera callbacks som anropas av garbage collector före och efter insamlingen med hjälp av den nya :data:`~gc.callbacks`-listan.

source: A new :func:`~hmac.compare_digest` function has been added to prevent side channel attacks on digests through timing analysis. (Contributed by Nick Coghlan and Christian Heimes in :issue:`15061`.)
sv: En ny :func:`~hmac.compare_digest`-funktion har lagts till för att förhindra sidokanalattacker på sammanställningar genom tidsanalys. (Bidrag från Nick Coghlan och Christian Heimes i :issue:`15061`.)

source: :class:`http.server.BaseHTTPRequestHandler` now buffers the headers and writes them all at once when :meth:`~http.server.BaseHTTPRequestHandler.end_headers` is called. A new method :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` can be used to directly manage when the accumulated headers are sent. (Contributed by Andrew Schaaf in :issue:`3709`.)
sv: :class:`http.server.BaseHTTPRequestHandler` buffrar nu headers och skriver dem alla på en gång när :meth:`~http.server.BaseHTTPRequestHandler.end_headers` anropas. En ny metod :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` kan användas för att direkt hantera när de ackumulerade headers skickas. (Bidrag från Andrew Schaaf i :issue:`3709`.)

source: :class:`http.server` now produces valid ``HTML 4.01 strict`` output. (Contributed by Ezio Melotti in :issue:`13295`.)
sv: :class:`http.server` producerar nu giltig ``HTML 4.01 strict`` utdata. (Bidrag från Ezio Melotti i :issue:`13295`.)

source: :class:`http.client.HTTPResponse` now has a :meth:`~http.client.HTTPResponse.readinto` method, which means it can be used as an :class:`io.RawIOBase` class. (Contributed by John Kuhn in :issue:`13464`.)
sv: :class:`http.client.HTTPResponse` har nu en :meth:`~http.client.HTTPResponse.readinto`-metod, vilket innebär att den kan användas som en :class:`io.RawIOBase`-klass. (Bidrag från John Kuhn i :issue:`13464`.)

source: :class:`html.parser.HTMLParser` is now able to parse broken markup without raising errors, therefore the *strict* argument of the constructor and the :exc:`~html.parser.HTMLParseError` exception are now deprecated. The ability to parse broken markup is the result of a number of bug fixes that are also available on the latest bug fix releases of Python 2.7/3.2. (Contributed by Ezio Melotti in :issue:`15114`, and :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)
sv: :class:`html.parser.HTMLParser` kan nu analysera trasig markup utan att orsaka fel, därför är *strict*-argumentet i konstruktorn och :exc:`~html.parser.HTMLParseError`-undantaget nu föråldrade. Möjligheten att parsa trasig markup är resultatet av ett antal buggfixar som också finns tillgängliga i de senaste buggfixversionerna av Python 2.7/3.2. (Bidrag från Ezio Melotti i :issue:`15114`, and :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)

source: A new :data:`~html.entities.html5` dictionary that maps HTML5 named character references to the equivalent Unicode character(s) (e.g. ``html5['gt;'] == '>'``) has been added to the :mod:`html.entities` module. The dictionary is now also used by :class:`~html.parser.HTMLParser`. (Contributed by Ezio Melotti in :issue:`11113` and :issue:`15156`.)
sv: En ny :data:`~html.entities.html5`-ordbok som mappar HTML5 namngivna teckenreferenser till motsvarande Unicode-tecken (t.ex. ``html5['gt;'] == '>'``) har lagts till i modulen :mod:`html.entities`. Ordboken används nu även av :class:`~html.parser.HTMLParser`. (Bidrag från Ezio Melotti i :issue:`11113` och :issue:`15156`.)

source: The :class:`~imaplib.IMAP4_SSL` constructor now accepts an SSLContext parameter to control parameters of the secure channel.
sv: Konstruktorn :class:`~imaplib.IMAP4_SSL` accepterar nu en SSLContext-parameter för att styra parametrarna för den säkra kanalen.

source: (Contributed by Sijin Joseph in :issue:`8808`.)
sv: (Bidrag från Sijin Joseph i :issue:`8808`.)

source: inspect
sv: inspektera

source: A new :func:`~inspect.getclosurevars` function has been added. This function reports the current binding of all names referenced from the function body and where those names were resolved, making it easier to verify correct internal state when testing code that relies on stateful closures.
sv: En ny :func:`~inspect.getclosurevars`-funktion har lagts till. Denna funktion rapporterar den aktuella bindningen av alla namn som refereras från funktionskroppen och var dessa namn löstes, vilket gör det lättare att verifiera korrekt internt tillstånd när man testar kod som förlitar sig på stateful closures.

source: (Contributed by Meador Inge and Nick Coghlan in :issue:`13062`.)
sv: (Bidrag från Meador Inge och Nick Coghlan i :issue:`13062`.)

source: A new :func:`~inspect.getgeneratorlocals` function has been added. This function reports the current binding of local variables in the generator's stack frame, making it easier to verify correct internal state when testing generators.
sv: En ny :func:`~inspect.getgeneratorlocals`-funktion har lagts till. Denna funktion rapporterar den aktuella bindningen av lokala variabler i generatorns stackram, vilket gör det lättare att verifiera korrekt internt tillstånd vid testning av generatorer.

source: (Contributed by Meador Inge in :issue:`15153`.)
sv: (Bidrag från Meador Inge i :issue:`15153`.)

source: The :func:`~io.open` function has a new ``'x'`` mode that can be used to exclusively create a new file, and raise a :exc:`FileExistsError` if the file already exists. It is based on the C11 'x' mode to fopen().
sv: Funktionen :func:`~io.open` har ett nytt ``'x'``-läge som kan användas för att uteslutande skapa en ny fil, och ge upphov till ett :exc:`FileExistsError` om filen redan finns. Det är baserat på C11 'x'-läget för fopen().

source: (Contributed by David Townshend in :issue:`12760`.)
sv: (Bidrag från David Townshend i :issue:`12760`.)

source: The constructor of the :class:`~io.TextIOWrapper` class has a new *write_through* optional argument. If *write_through* is ``True``, calls to :meth:`~io.TextIOWrapper.write` are guaranteed not to be buffered: any data written on the :class:`~io.TextIOWrapper` object is immediately handled to its underlying binary buffer.
sv: Konstruktorn för klassen :class:`~io.TextIOWrapper` har ett nytt *write_through* valfritt argument. Om *write_through* är ``True`` garanteras att anrop till :meth:`~io.TextIOWrapper.write` inte buffras: all data som skrivs på :class:`~io.TextIOWrapper`-objektet hanteras omedelbart till dess underliggande binära buffert.

source: :func:`~itertools.accumulate` now takes an optional ``func`` argument for providing a user-supplied binary function.
sv: :func:`~itertools.accumulate` tar nu ett valfritt ``func``-argument för att tillhandahålla en binär funktion från användaren.

source: logging
sv: loggning

source: The :func:`~logging.basicConfig` function now supports an optional ``handlers`` argument taking an iterable of handlers to be added to the root logger.
sv: Funktionen :func:`~logging.basicConfig` stöder nu ett valfritt ``handlers``-argument som tar en iterabel av handläggare som ska läggas till rotloggaren.

source: A class level attribute :attr:`~logging.handlers.SysLogHandler.append_nul` has been added to :class:`~logging.handlers.SysLogHandler` to allow control of the appending of the ``NUL`` (``\000``) byte to syslog records, since for some daemons it is required while for others it is passed through to the log.
sv: Ett klassnivåattribut :attr:`~logging.handlers.SysLogHandler.append_nul` har lagts till i :class:`~logging.handlers.SysLogHandler` för att möjliggöra kontroll av tillägget av byte ``NUL`` (``\000``) till syslogposter, eftersom det krävs för vissa daemoner medan det för andra skickas vidare till loggen.

source: math
sv: matematik

source: The :mod:`math` module has a new function, :func:`~math.log2`, which returns the base-2 logarithm of *x*.
sv: Modulen :mod:`math` har en ny funktion, :func:`~math.log2`, som returnerar bas-2-logaritmen för *x*.

source: (Written by Mark Dickinson in :issue:`11888`.)
sv: (Skrivet av Mark Dickinson i :issue:`11888`.)

source: The :meth:`~mmap.mmap.read` method is now more compatible with other file-like objects: if the argument is omitted or specified as ``None``, it returns the bytes from the current file position to the end of the mapping. (Contributed by Petri Lehtinen in :issue:`12021`.)
sv: Metoden :meth:`~mmap.mmap.read` är nu mer kompatibel med andra filliknande objekt: om argumentet utelämnas eller anges som ``None`` returnerar den bytena från den aktuella filpositionen till slutet av mappningen. (Bidrag från Petri Lehtinen i :issue:`12021`.)

source: The new :func:`multiprocessing.connection.wait` function allows polling multiple objects (such as connections, sockets and pipes) with a timeout. (Contributed by Richard Oudkerk in :issue:`12328`.)
sv: Den nya funktionen :func:`multiprocessing.connection.wait` gör det möjligt att polla flera objekt (t.ex. anslutningar, sockets och pipes) med en timeout. (Bidrag från Richard Oudkerk i :issue:`12328`.)

source: :class:`multiprocessing.Connection` objects can now be transferred over multiprocessing connections. (Contributed by Richard Oudkerk in :issue:`4892`.)
sv: :class:`multiprocessing.Connection`-objekt kan nu överföras över multiprocessing-anslutningar. (Bidrag från Richard Oudkerk i :issue:`4892`.)

source: :class:`multiprocessing.Process` now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag from the parent process (:issue:`6064`).
sv: :class:`multiprocessing.Process` accepterar nu ett ``daemon`` nyckelordsargument för att åsidosätta standardbeteendet att ärva ``daemon`` flaggan från den överordnade processen (:issue:`6064`).

source: New attribute :data:`multiprocessing.Process.sentinel` allows a program to wait on multiple :class:`~multiprocessing.Process` objects at one time using the appropriate OS primitives (for example, :mod:`select` on posix systems).
sv: Med det nya attributet :data:`multiprocessing.Process.sentinel` kan ett program vänta på flera :class:`~multiprocessing.Process`-objekt samtidigt med hjälp av lämpliga OS-primitiver (t.ex. :mod:`select` på posix-system).

source: New methods :meth:`multiprocessing.pool.Pool.starmap` and :meth:`~multiprocessing.pool.Pool.starmap_async` provide :func:`itertools.starmap` equivalents to the existing :meth:`multiprocessing.pool.Pool.map` and :meth:`~multiprocessing.pool.Pool.map_async` functions. (Contributed by Hynek Schlawack in :issue:`12708`.)
sv: Nya metoder :meth:`multiprocessing.pool.Pool.starmap` och :meth:`~multiprocessing.pool.Pool.starmap_async` ger :func:`itertools.starmap` motsvarigheter till de befintliga funktionerna :meth:`multiprocessing.pool.Pool.map` och :meth:`~multiprocessing.pool.Pool.map_async`. (Bidrag från Hynek Schlawack i :issue:`12708`.)

source: The :class:`!nntplib.NNTP` class now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the NNTP connection when done::
sv: Klassen :class:`!nntplib.NNTP` stöder nu kontexthanteringsprotokollet för att ovillkorligen konsumera :exc:`socket.error` undantag och för att stänga NNTP-anslutningen när den är klar::

source: (Contributed by Giampaolo Rodolà in :issue:`9795`.)
sv: (Bidrag från Giampaolo Rodolà i :issue:`9795`.)

source: The :mod:`os` module has a new :func:`~os.pipe2` function that makes it possible to create a pipe with :const:`~os.O_CLOEXEC` or :const:`~os.O_NONBLOCK` flags set atomically. This is especially useful to avoid race conditions in multi-threaded programs.
sv: Modulen :mod:`os` har en ny funktion :func:`~os.pipe2` som gör det möjligt att skapa en pipe med flaggorna :const:`~os.O_CLOEXEC` eller :const:`~os.O_NONBLOCK` atomiskt. Detta är särskilt användbart för att undvika tävlingsförhållanden i flertrådade program.

source: The :mod:`os` module has a new :func:`~os.sendfile` function which provides an efficient "zero-copy" way for copying data from one file (or socket) descriptor to another. The phrase "zero-copy" refers to the fact that all of the copying of data between the two descriptors is done entirely by the kernel, with no copying of data into userspace buffers. :func:`~os.sendfile` can be used to efficiently copy data from a file on disk to a network socket, e.g. for downloading a file.
sv: Modulen :mod:`os` har en ny funktion :func:`~os.sendfile` som ger ett effektivt "zero-copy"-sätt att kopiera data från en fil- (eller socket-) deskriptor till en annan. Uttrycket "zero-copy" syftar på det faktum att all kopiering av data mellan de två deskriptorerna görs helt av kärnan, utan att data kopieras till buffertar i userspace. :func:`~os.sendfile` kan användas för att effektivt kopiera data från en fil på disk till en nätverkssocket, t.ex. för att ladda ner en fil.

source: (Patch submitted by Ross Lagerwall and Giampaolo Rodolà in :issue:`10882`.)
sv: (Patch inlämnad av Ross Lagerwall och Giampaolo Rodolà i :issue:`10882`.)

source: To avoid race conditions like symlink attacks and issues with temporary files and directories, it is more reliable (and also faster) to manipulate file descriptors instead of file names. Python 3.3 enhances existing functions and introduces new functions to work on file descriptors (:issue:`4761`, :issue:`10755` and :issue:`14626`).
sv: För att undvika tävlingsförhållanden som symlänkattacker och problem med temporära filer och kataloger är det mer tillförlitligt (och även snabbare) att manipulera filbeskrivare istället för filnamn. Python 3.3 förbättrar befintliga funktioner och introducerar nya funktioner för att arbeta med filbeskrivare (:issue:`4761`, :issue:`10755` och :issue:`14626`).

source: The :mod:`os` module has a new :func:`~os.fwalk` function similar to :func:`~os.walk` except that it also yields file descriptors referring to the directories visited. This is especially useful to avoid symlink races.
sv: Modulen :mod:`os` har en ny funktion :func:`~os.fwalk` som liknar :func:`~os.walk` förutom att den också ger filbeskrivningar som hänvisar till de besökta katalogerna. Detta är speciellt användbart för att undvika symlink-race.

source: The following functions get new optional *dir_fd* (:ref:`paths relative to directory descriptors <dir_fd>`) and/or *follow_symlinks* (:ref:`not following symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Platform support for using these parameters can be checked via the sets :data:`os.supports_dir_fd` and :data:`os.supports_follows_symlinks`.
sv: Följande funktioner får nya valfria *dir_fd* (:ref:`sökvägar i förhållande till katalogbeskrivare <dir_fd>`) och/eller *follow_symlinks* (:ref:`följer inte symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Plattformsstöd för användning av dessa parametrar kan kontrolleras via uppsättningarna :data:`os.supports_dir_fd` och :data:`os.supports_follows_symlinks`.

source: The following functions now support a file descriptor for their path argument: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. Platform support for this can be checked via the :data:`os.supports_fd` set.
sv: Följande funktioner stöder nu en filbeskrivare för sitt path-argument: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. Plattformsstöd för detta kan kontrolleras via uppsättningen :data:`os.supports_fd`.

source: :func:`~os.access` accepts an ``effective_ids`` keyword argument to turn on using the effective uid/gid rather than the real uid/gid in the access check. Platform support for this can be checked via the :data:`~os.supports_effective_ids` set.
sv: :func:`~os.access` accepterar ett ``effective_ids`` nyckelordsargument för att aktivera användning av effektiv uid/gid istället för verklig uid/gid i åtkomstkontrollen. Plattformsstöd för detta kan kontrolleras via uppsättningen :data:`~os.supports_effective_ids`.

source: The :mod:`os` module has two new functions: :func:`~os.getpriority` and :func:`~os.setpriority`. They can be used to get or set process niceness/priority in a fashion similar to :func:`os.nice` but extended to all processes instead of just the current one.
sv: Modulen :mod:`os` har två nya funktioner: :func:`~os.getpriority` och :func:`~os.setpriority`. De kan användas för att hämta eller ställa in processens niceness/prioritet på ett sätt som liknar :func:`os.nice` men utökat till alla processer istället för bara den aktuella.

source: (Patch submitted by Giampaolo Rodolà in :issue:`10784`.)
sv: (Patch inlämnad av Giampaolo Rodolà i :issue:`10784`.)

source: The new :func:`os.replace` function allows cross-platform renaming of a file with overwriting the destination. With :func:`os.rename`, an existing destination file is overwritten under POSIX, but raises an error under Windows. (Contributed by Antoine Pitrou in :issue:`8828`.)
sv: Den nya funktionen :func:`os.replace` gör det möjligt att byta namn på en fil över flera plattformar med överskrivning av destinationsfilen. Med :func:`os.rename` skrivs en befintlig destinationsfil över under POSIX, men ger upphov till ett fel under Windows. (Bidrag från Antoine Pitrou i :issue:`8828`.)

source: The stat family of functions (:func:`~os.stat`, :func:`~os.fstat`, and :func:`~os.lstat`) now support reading a file's timestamps with nanosecond precision. Symmetrically, :func:`~os.utime` can now write file timestamps with nanosecond precision. (Contributed by Larry Hastings in :issue:`14127`.)
sv: Stat-familjen av funktioner (:func:`~os.stat`, :func:`~os.fstat` och :func:`~os.lstat`) stöder nu läsning av en fils tidsstämplar med nanosekunders precision. Symmetriskt kan :func:`~os.utime` nu skriva filens tidsstämplar med nanosekundsprecision. (Bidrag från Larry Hastings i :issue:`14127`.)
