Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: Deprecated features
sv: Föråldrade funktioner

source: The :mod:`array` module's ``'u'`` format code is now deprecated and will be removed in Python 4 together with the rest of the (:c:type:`Py_UNICODE`) API.
sv: Modulen :mod:`array` ``'u'`` formatkod är nu föråldrad och kommer att tas bort i Python 4 tillsammans med resten av (:c:type:`Py_UNICODE`) API.

source: Porting to Python 3.3
sv: Portning till Python 3.3

source: This section lists previously described changes and other bugfixes that may require changes to your code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Porting Python code
sv: Portning av Python-kod

source: Hash randomization is enabled by default. Set the :envvar:`PYTHONHASHSEED` environment variable to ``0`` to disable hash randomization. See also the :meth:`object.__hash__` method.
sv: Randomisering av hash är aktiverat som standard. Ställ in miljövariabeln :envvar:`PYTHONHASHSEED` till ``0`` för att inaktivera hashslumpning. Se även metoden :meth:`object.__hash__`.

source: :issue:`12326`: On Linux, sys.platform doesn't contain the major version anymore. It is now always 'linux', instead of 'linux2' or 'linux3' depending on the Linux version used to build Python. Replace sys.platform == 'linux2' with sys.platform.startswith('linux'), or directly sys.platform == 'linux' if you don't need to support older Python versions.
sv: :problem:`12326`: På Linux innehåller sys.platform inte längre huvudversionen. Den är nu alltid 'linux', istället för 'linux2' eller 'linux3' beroende på vilken Linux-version som används för att bygga Python. Ersätt sys.platform == 'linux2' med sys.platform.startswith('linux'), eller direkt sys.platform == 'linux' om du inte behöver stödja äldre Python-versioner.

source: :issue:`13847`, :issue:`14180`: :mod:`time` and :mod:`datetime`: :exc:`OverflowError` is now raised instead of :exc:`ValueError` if a timestamp is out of range. :exc:`OSError` is now raised if C functions :c:func:`gmtime` or :c:func:`localtime` failed.
sv: :issue:`13847`, :issue:`14180`: :mod:`time` och :mod:`datetime`: :exc:`OverflowError` visas nu istället för :exc:`ValueError` om en tidsmarkör är utanför intervallet. :exc:`OSError` visas nu om C-funktionerna :c:func:`gmtime` eller :c:func:`localtime` misslyckades.

source: The default finders used by import now utilize a cache of what is contained within a specific directory. If you create a Python source file or sourceless bytecode file, make sure to call :func:`importlib.invalidate_caches` to clear out the cache for the finders to notice the new file.
sv: De standardsökare som används av import använder nu en cache av vad som finns i en specifik katalog. Om du skapar en Python-källfil eller en bytecode-fil utan källa, se till att anropa :func:`importlib.invalidate_caches` för att rensa cacheminnet så att sökarna märker den nya filen.

source: :exc:`ImportError` now uses the full name of the module that was attempted to be imported. Doctests that check ImportErrors' message will need to be updated to use the full name of the module instead of just the tail of the name.
sv: :exc:`ImportError` använder nu det fullständiga namnet på modulen som man försökte importera. Doctests som kontrollerar ImportErrors meddelande måste uppdateras för att använda modulens fullständiga namn istället för bara svansen av namnet.

source: The *index* argument to :func:`__import__` now defaults to 0 instead of -1 and no longer support negative values. It was an oversight when :pep:`328` was implemented that the default value remained -1. If you need to continue to perform a relative import followed by an absolute import, then perform the relative import using an index of 1, followed by another import using an index of 0. It is preferred, though, that you use :func:`importlib.import_module` rather than call :func:`__import__` directly.
sv: Argumentet *index* till :func:`__import__` har nu standardvärdet 0 istället för -1 och stöder inte längre negativa värden. Det var ett förbiseende när :pep:`328` implementerades att standardvärdet förblev -1. Om du behöver fortsätta att utföra en relativ import följt av en absolut import, utför då den relativa importen med ett index på 1, följt av en annan import med ett index på 0. Det är dock att föredra att du använder :func:`importlib.import_module` snarare än att anropa :func:`__import__` direkt.

source: :func:`__import__` no longer allows one to use an index value other than 0 for top-level modules. E.g. ``__import__('sys', level=1)`` is now an error.
sv: :func:`__import__` tillåter inte längre att man använder ett annat indexvärde än 0 för moduler på högsta nivån. T.ex. ```__import__('sys', level=1)`` är nu ett fel.

source: Because :data:`sys.meta_path` and :data:`sys.path_hooks` now have finders on them by default, you will most likely want to use :meth:`list.insert` instead of :meth:`list.append` to add to those lists.
sv: Eftersom :data:`sys.meta_path` och :data:`sys.path_hooks` nu har sökare som standard kommer du troligen att vilja använda :meth:`list.insert` i stället för :meth:`list.append` för att lägga till i dessa listor.

source: Because ``None`` is now inserted into :data:`sys.path_importer_cache`, if you are clearing out entries in the dictionary of paths that do not have a finder, you will need to remove keys paired with values of ``None`` **and** :class:`!imp.NullImporter` to be backwards-compatible. This will lead to extra overhead on older versions of Python that re-insert ``None`` into :data:`sys.path_importer_cache` where it represents the use of implicit finders, but semantically it should not change anything.
sv: Eftersom ``None`` nu är infogad i :data:`sys.path_importer_cache`, om du rensar ut poster i ordlistan över sökvägar som inte har en sökare, måste du ta bort nycklar som är parade med värden av ``None`` **och** :class:`!imp.NullImporter` för att vara bakåtkompatibel. Detta kommer att leda till extra overhead på äldre versioner av Python som återinför ``None`` i :data:`sys.path_importer_cache` där det representerar användningen av implicita sökare, men semantiskt bör det inte ändra någonting.

source: :class:`!importlib.abc.Finder` no longer specifies a ``find_module()`` abstract method that must be implemented. If you were relying on subclasses to implement that method, make sure to check for the method's existence first. You will probably want to check for ``find_loader()`` first, though, in the case of working with :term:`path entry finders <path entry finder>`.
sv: :class:`!importlib.abc.Finder` anger inte längre en abstrakt metod ``find_module()`` som måste implementeras. Om du förlitade dig på att underklasser skulle implementera den metoden, se till att kontrollera att metoden finns först. Du kommer förmodligen att vilja kontrollera för ``find_loader()`` först, dock, i fallet med att arbeta med :term:`path entry finders <path entry finder>`.

source: :mod:`pkgutil` has been converted to use :mod:`importlib` internally. This eliminates many edge cases where the old behaviour of the :pep:`302` import emulation failed to match the behaviour of the real import system. The import emulation itself is still present, but is now deprecated. The :func:`pkgutil.iter_importers` and :func:`pkgutil.walk_packages` functions special case the standard import hooks so they are still supported even though they do not provide the non-standard ``iter_modules()`` method.
sv: :mod:`pkgutil` har konverterats till att använda :mod:`importlib` internt. Detta eliminerar många kantfall där det gamla beteendet hos :pep:`302` import-emuleringen inte stämde överens med beteendet hos det riktiga importsystemet. Själva import-emuleringen finns fortfarande kvar, men är nu föråldrad. Funktionerna :func:`pkgutil.iter_importers` och :func:`pkgutil.walk_packages` är specialfall för standardimportkrokarna så de stöds fortfarande även om de inte tillhandahåller den icke-standardiserade metoden ``iter_modules()``.

source: A longstanding RFC-compliance bug (:issue:`1079`) in the parsing done by :func:`email.header.decode_header` has been fixed. Code that uses the standard idiom to convert encoded headers into unicode (``str(make_header(decode_header(h))``) will see no change, but code that looks at the individual tuples returned by decode_header will see that whitespace that precedes or follows ``ASCII`` sections is now included in the ``ASCII`` section. Code that builds headers using ``make_header`` should also continue to work without change, since ``make_header`` continues to add whitespace between ``ASCII`` and non-``ASCII`` sections if it is not already present in the input strings.
sv: Ett långvarigt RFC-kompatibilitetsfel (:issue:`1079`) i parsningen som görs av :func:`email.header.decode_header` har åtgärdats. Kod som använder standardidiomet för att konvertera kodade headers till unicode (``str(make_header(decode_header(h))``) kommer inte att märka någon förändring, men kod som tittar på de enskilda tuples som returneras av decode_header kommer att se att blanksteg som föregår eller följer ``ASCII``-avsnitt nu ingår i ``ASCII``-avsnittet. Kod som bygger rubriker med hjälp av ``make_header`` bör också fortsätta att fungera utan ändringar, eftersom ``make_header`` fortsätter att lägga till blanksteg mellan ``ASCII`` och icke-`ASCII``-avsnitt om det inte redan finns i indatasträngarna.

source: :func:`email.utils.formataddr` now does the correct content transfer encoding when passed non-``ASCII`` display names. Any code that depended on the previous buggy behavior that preserved the non-``ASCII`` unicode in the formatted output string will need to be changed (:issue:`1690608`).
sv: :func:`email.utils.formataddr` gör nu rätt innehållsöverföringskodning när den skickas till displaynamn som inte är ``ASCII``. All kod som var beroende av det tidigare buggiga beteendet som bevarade unicode som inte var ``ASCII`` i den formaterade utdatasträngen måste ändras (:issue:`1690608`).

source: :meth:`poplib.POP3.quit` may now raise protocol errors like all other ``poplib`` methods. Code that assumes ``quit`` does not raise :exc:`poplib.error_proto` errors may need to be changed if errors on ``quit`` are encountered by a particular application (:issue:`11291`).
sv: :meth:`poplib.POP3.quit` kan nu ge upphov till protokollfel som alla andra ``poplib``-metoder. Kod som förutsätter att ``quit`` inte ger upphov till :exc:`poplib.error_proto`-fel kan behöva ändras om fel vid ``quit`` uppstår i ett visst program (:issue:`11291``).

source: The ``strict`` argument to :class:`email.parser.Parser`, deprecated since Python 2.4, has finally been removed.
sv: Argumentet ``strict`` till :class:`email.parser.Parser`, föråldrat sedan Python 2.4, har slutligen tagits bort.

source: The deprecated method ``unittest.TestCase.assertSameElements`` has been removed.
sv: Den föråldrade metoden ``unittest.TestCase.assertSameElements`` har tagits bort.

source: The deprecated variable ``time.accept2dyear`` has been removed.
sv: Den föråldrade variabeln ``time.accept2dyear`` har tagits bort.

source: The deprecated ``Context._clamp`` attribute has been removed from the :mod:`decimal` module. It was previously replaced by the public attribute :attr:`~decimal.Context.clamp`. (See :issue:`8540`.)
sv: Det föråldrade attributet ``Context._clamp`` har tagits bort från modulen :mod:`decimal`. Det ersattes tidigare av det publika attributet :attr:`~decimal.Context.clamp`. (Se :issue:`8540`.)

source: The undocumented internal helper class ``SSLFakeFile`` has been removed from :mod:`smtplib`, since its functionality has long been provided directly by :meth:`socket.socket.makefile`.
sv: Den odokumenterade interna hjälpklassen ``SSLFakeFile`` har tagits bort från :mod:`smtplib`, eftersom dess funktionalitet sedan länge tillhandahålls direkt av :meth:`socket.socket.makefile`.

source: Passing a negative value to :func:`time.sleep` on Windows now raises an error instead of sleeping forever. It has always raised an error on posix.
sv: Att skicka ett negativt värde till :func:`time.sleep` på Windows ger nu upphov till ett fel istället för att sova för evigt. Det har alltid gett ett felmeddelande på posix.

source: The ``ast.__version__`` constant has been removed. If you need to make decisions affected by the AST version, use :data:`sys.version_info` to make the decision.
sv: Konstanten ``ast.__version__`` har tagits bort. Om du behöver fatta beslut som påverkas av AST-versionen, använd :data:`sys.version_info` för att fatta beslutet.

source: Code that used to work around the fact that the :mod:`threading` module used factory functions by subclassing the private classes will need to change to subclass the now-public classes.
sv: Kod som brukade kringgå det faktum att modulen :mod:`threading` använde fabriksfunktioner genom att underklassa de privata klasserna måste ändras till att underklassa de nu offentliga klasserna.

source: The undocumented debugging machinery in the threading module has been removed, simplifying the code. This should have no effect on production code, but is mentioned here in case any application debug frameworks were interacting with it (:issue:`13550`).
sv: Det odokumenterade felsökningsmaskineriet i threading-modulen har tagits bort, vilket förenklar koden. Detta bör inte ha någon effekt på produktionskoden, men nämns här ifall något ramverk för felsökning av applikationer interagerar med den (:issue:`13550`).

source: Porting C code
sv: Portning av C-kod

source: In the course of changes to the buffer API the undocumented :c:member:`!smalltable` member of the :c:type:`Py_buffer` structure has been removed and the layout of the :c:type:`PyMemoryViewObject` has changed.
sv: I samband med ändringar i buffert-API:et har den odokumenterade :c:member:`!smalltable`-medlemmen i :c:type:`Py_buffer`-strukturen tagits bort och layouten för :c:type:`PyMemoryViewObject` har ändrats.

source: All extensions relying on the relevant parts in ``memoryobject.h`` or ``object.h`` must be rebuilt.
sv: Alla tillägg som förlitar sig på de relevanta delarna i ``memoryobject.h`` eller ``object.h`` måste byggas om.

source: Due to :ref:`PEP 393 <pep-393>`, the :c:type:`Py_UNICODE` type and all functions using this type are deprecated (but will stay available for at least five years). If you were using low-level Unicode APIs to construct and access unicode objects and you want to benefit of the memory footprint reduction provided by :pep:`393`, you have to convert your code to the new :doc:`Unicode API <../c-api/unicode>`.
sv: På grund av :ref:`PEP 393 <pep-393>`, är typen :c:type:`Py_UNICODE` och alla funktioner som använder denna typ föråldrade (men kommer att vara tillgängliga i minst fem år). Om du använder Unicode API:er på låg nivå för att konstruera och komma åt Unicode-objekt och du vill dra nytta av den minskning av minnesavtrycket som :pep:`393` ger, måste du konvertera din kod till den nya :doc:`Unicode API &lt;../c-api/unicode&gt;`.

source: However, if you only have been using high-level functions such as :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` or :c:func:`PyUnicode_FromFormat()`, your code will automatically take advantage of the new unicode representations.
sv: Men om du bara har använt högnivåfunktioner som :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` eller :c:func:`PyUnicode_FromFormat()`, kommer din kod automatiskt att dra nytta av de nya unicode-representationerna.

source: :c:func:`PyImport_GetMagicNumber` now returns ``-1`` upon failure.
sv: :c:func:`PyImport_GetMagicNumber` returnerar nu ``-1`` vid fel.

source: As a negative value for the *level* argument to :func:`__import__` is no longer valid, the same now holds for :c:func:`PyImport_ImportModuleLevel`. This also means that the value of *level* used by :c:func:`PyImport_ImportModuleEx` is now ``0`` instead of ``-1``.
sv: Eftersom ett negativt värde för *level*-argumentet till :func:`__import__` inte längre är giltigt, gäller nu samma sak för :c:func:`PyImport_ImportModuleLevel`. Detta innebär också att värdet för *level* som används av :c:func:`PyImport_ImportModuleEx` nu är ``0`` istället för ``-1``.

source: Building C extensions
sv: Tillbyggnad av byggnad C

source: The range of possible file names for C extensions has been narrowed. Very rarely used spellings have been suppressed: under POSIX, files named ``xxxmodule.so``, ``xxxmodule.abi3.so`` and ``xxxmodule.cpython-*.so`` are no longer recognized as implementing the ``xxx`` module. If you had been generating such files, you have to switch to the other spellings (i.e., remove the ``module`` string from the file names).
sv: Utbudet av möjliga filnamn för C-tillägg har minskats. Mycket sällan använda stavningar har undertryckts: under POSIX erkänns inte längre filer med namnen ``xxxmodule.so``, ``xxxmodule.abi3.so`` och ``xxxmodule.cpython-*.so`` som implementeringar av ``xxx``-modulen. Om du har genererat sådana filer måste du byta till de andra stavningarna (dvs. ta bort strängen ``module`` från filnamnen).

source: (implemented in :issue:`14040`.)
sv: (implementerad i :issue:`14040`.)

source: Command Line Switch Changes
sv: Ändringar i kommandoradsväxeln

source: The -Q command-line flag and related artifacts have been removed. Code checking sys.flags.division_warning will need updating.
sv: Kommandoradsflaggan -Q och relaterade artefakter har tagits bort. Kod som kontrollerar sys.flags.division_warning behöver uppdateras.

source: (:issue:`10998`, contributed by Éric Araujo.)
sv: (:issue:`10998`, bidrag från Éric Araujo.)

source: When :program:`python` is started with :option:`-S`, ``import site`` will no longer add site-specific paths to the module search paths. In previous versions, it did.
sv: När :program:`python` startas med :option:`-S`, kommer ``import site`` inte längre att lägga till platsspecifika sökvägar till modulens sökvägar. I tidigare versioner gjorde den det.

source: (:issue:`11591`, contributed by Carl Meyer with editions by Éric Araujo.)
sv: (:issue:`11591`, bidrag från Carl Meyer med redigering av Éric Araujo.)

source: yield
sv: avkastning

source: yield from (in What's New)
sv: avkastning från (i Vad är nytt)
