Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: The new :func:`os.get_terminal_size` function queries the size of the terminal attached to a file descriptor. See also :func:`shutil.get_terminal_size`. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
sv: Den nya funktionen :func:`os.get_terminal_size` frågar efter storleken på terminalen som är kopplad till en filbeskrivare. Se även :func:`shutil.get_terminal_size`. (Bidrag från Zbigniew Jędrzejewski-Szmek i :issue:`13609`.)

source: New functions to support Linux extended attributes (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.
sv: Nya funktioner för stöd för Linux utökade attribut (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.

source: New interface to the scheduler. These functions control how a process is allocated CPU time by the operating system. New functions: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`,
sv: Nytt gränssnitt till schemaläggaren. Dessa funktioner styr hur en process tilldelas CPU-tid av operativsystemet. Nya funktioner: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`,

source: New functions to control the file system:
sv: Nya funktioner för att styra filsystemet:

source: :func:`~os.posix_fadvise`: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations.
sv: :func:`~os.posix_fadvise`: Tillkännager en avsikt att komma åt data i ett specifikt mönster vilket gör det möjligt för kärnan att göra optimeringar.

source: :func:`~os.posix_fallocate`: Ensures that enough disk space is allocated for a file.
sv: :func:`~os.posix_fallocate`: Säkerställer att tillräckligt med diskutrymme allokeras för en fil.

source: :func:`~os.sync`: Force write of everything to disk.
sv: :func:`~os.sync`: Tvinga fram skrivning av allt till disk.

source: Additional new posix functions:
sv: Ytterligare nya posix-funktioner:

source: :func:`~os.lockf`: Apply, test or remove a POSIX lock on an open file descriptor.
sv: :func:`~os.lockf`: Tillämpa, testa eller ta bort ett POSIX-lås på en öppen filbeskrivare.

source: :func:`~os.pread`: Read from a file descriptor at an offset, the file offset remains unchanged.
sv: :func:`~os.pread`: Läs från en filbeskrivare vid en offset, filens offset förblir oförändrad.

source: :func:`~os.pwrite`: Write to a file descriptor from an offset, leaving the file offset unchanged.
sv: :func:`~os.pwrite`: Skriv till en filbeskrivare från en offset, vilket lämnar filoffseten oförändrad.

source: :func:`~os.readv`: Read from a file descriptor into a number of writable buffers.
sv: :func:`~os.readv`: Läser från en filbeskrivare till ett antal skrivbara buffertar.

source: :func:`~os.truncate`: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
sv: :func:`~os.truncate`: Trunkerar filen som motsvarar *sökväg*, så att den är högst *längd* byte stor.

source: :func:`~os.waitid`: Wait for the completion of one or more child processes.
sv: :func:`~os.waitid`: Vänta på att en eller flera underordnade processer ska slutföras.

source: :func:`~os.writev`: Write the contents of *buffers* to a file descriptor, where *buffers* is an arbitrary sequence of buffers.
sv: :func:`~os.writev`: Skriv innehållet i *buffertar* till en filbeskrivare, där *buffertar* är en godtycklig sekvens av buffertar.

source: :func:`~os.getgrouplist` (:issue:`9344`): Return list of group ids that specified user belongs to.
sv: :func:`~os.getgrouplist` (:issue:`9344`): Returnerar en lista med grupp-ID:n som den angivna användaren tillhör.

source: :func:`~os.times` and :func:`~os.uname`: Return type changed from a tuple to a tuple-like object with named attributes.
sv: :func:`~os.times` och :func:`~os.uname`: Returtypen ändrad från en tupel till ett tupelliknande objekt med namngivna attribut.

source: Some platforms now support additional constants for the :func:`~os.lseek` function, such as ``os.SEEK_HOLE`` and ``os.SEEK_DATA``.
sv: Vissa plattformar stöder nu ytterligare konstanter för funktionen :func:`~os.lseek`, t.ex. ``os.SEEK_HOLE`` och ``os.SEEK_DATA``.

source: New constants :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE`, :const:`~os.RTLD_NOLOAD`, and :const:`~os.RTLD_DEEPBIND` are available on platforms that support them. These are for use with the :func:`sys.setdlopenflags` function, and supersede the similar constants defined in :mod:`ctypes` and :mod:`DLFCN`. (Contributed by Victor Stinner in :issue:`13226`.)
sv: Nya konstanter :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE`, :const:`~os.RTLD_NOLOAD` och :const:`~os.RTLD_DEEPBIND` finns tillgängliga på plattformar som stöder dem. Dessa är avsedda att användas med funktionen :func:`sys.setdlopenflags` och ersätter de liknande konstanter som definieras i :mod:`ctypes` och :mod:`DLFCN`. (Bidrag från Victor Stinner i :issue:`13226`.)

source: :func:`os.symlink` now accepts (and ignores) the ``target_is_directory`` keyword argument on non-Windows platforms, to ease cross-platform support.
sv: :func:`os.symlink` accepterar nu (och ignorerar) nyckelordsargumentet ``target_is_directory`` på icke-Windows-plattformar, för att underlätta stöd för flera plattformar.

source: Tab-completion is now available not only for command names, but also their arguments. For example, for the ``break`` command, function and file names are completed.
sv: Tabbkomplettering är nu tillgänglig inte bara för kommandonamn utan även för deras argument. För kommandot ``break`` kompletteras t.ex. funktions- och filnamn.

source: (Contributed by Georg Brandl in :issue:`14210`)
sv: (Bidrag från Georg Brandl i :issue:`14210`)

source: pickle
sv: gurka

source: :class:`pickle.Pickler` objects now have an optional :attr:`~pickle.Pickler.dispatch_table` attribute allowing per-pickler reduction functions to be set.
sv: :class:`pickle.Pickler`-objekt har nu ett valfritt :attr:`~pickle.Pickler.dispatch_table`-attribut som gör det möjligt att ställa in reduktionsfunktioner för varje pickler.

source: (Contributed by Richard Oudkerk in :issue:`14166`.)
sv: (Bidrag från Richard Oudkerk i :issue:`14166`.)

source: The Tk GUI and the :func:`~pydoc.serve` function have been removed from the :mod:`pydoc` module: ``pydoc -g`` and :func:`~pydoc.serve` have been deprecated in Python 3.2.
sv: Tk GUI och funktionen :func:`~pydoc.serve` har tagits bort från modulen :mod:`pydoc`: ``pydoc -g`` och :func:`~pydoc.serve` har utgått i Python 3.2.

source: :class:`str` regular expressions now support ``\u`` and ``\U`` escapes.
sv: :class:`str` reguljära uttryck stöder nu ``\u`` och ``U`` escapes.

source: (Contributed by Serhiy Storchaka in :issue:`3665`.)
sv: (Bidrag från Serhiy Storchaka i :issue:`3665`.)

source: sched
sv: schema

source: :meth:`~sched.scheduler.run` now accepts a *blocking* parameter which when set to false makes the method execute the scheduled events due to expire soonest (if any) and then return immediately. This is useful in case you want to use the :class:`~sched.scheduler` in non-blocking applications. (Contributed by Giampaolo Rodolà in :issue:`13449`.)
sv: :meth:`~sched.scheduler.run` accepterar nu en *blockerande* parameter som när den sätts till false gör att metoden kör de schemalagda händelser som kommer att löpa ut tidigast (om det finns några) och sedan återgår omedelbart. Detta är användbart om du vill använda :class:`~sched.scheduler` i icke-blockerande applikationer. (Bidrag från Giampaolo Rodolà i :issue:`13449`.)

source: :class:`~sched.scheduler` class can now be safely used in multi-threaded environments. (Contributed by Josiah Carlson and Giampaolo Rodolà in :issue:`8684`.)
sv: :class:`~sched.scheduler` kan nu användas på ett säkert sätt i flertrådade miljöer. (Bidrag från Josiah Carlson och Giampaolo Rodolà i :issue:`8684`.)

source: *timefunc* and *delayfunct* parameters of :class:`~sched.scheduler` class constructor are now optional and defaults to :func:`time.time` and :func:`time.sleep` respectively. (Contributed by Chris Clark in :issue:`13245`.)
sv: *timefunc* och *delayfunct* parametrarna i :class:`~sched.scheduler` klasskonstruktören är nu valfria och standardvärdena är :func:`time.time` respektive :func:`time.sleep`. (Bidrag från Chris Clark i :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` *argument* parameter is now optional. (Contributed by Chris Clark in :issue:`13245`.)
sv: :meth:`~sched.scheduler.enter` och :meth:`~sched.scheduler.enterabs` *argument* parametern är nu valfri. (Bidrag från Chris Clark i :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` now accept a *kwargs* parameter. (Contributed by Chris Clark in :issue:`13245`.)
sv: :meth:`~sched.scheduler.enter` och :meth:`~sched.scheduler.enterabs` accepterar nu en *kwargs* parameter. (Bidrag från Chris Clark i :issue:`13245`.)

source: select
sv: välj

source: Solaris and derivative platforms have a new class :class:`select.devpoll` for high performance asynchronous sockets via :file:`/dev/poll`. (Contributed by Jesús Cea Avión in :issue:`6397`.)
sv: Solaris och avledda plattformar har en ny klass :class:`select.devpoll` för högpresterande asynkrona sockets via :file:`/dev/poll`. (Bidrag från Jesús Cea Avión i :issue:`6397`.)

source: The previously undocumented helper function ``quote`` from the :mod:`!pipes` modules has been moved to the :mod:`shlex` module and documented. :func:`~shlex.quote` properly escapes all characters in a string that might be otherwise given special meaning by the shell.
sv: Den tidigare odokumenterade hjälpfunktionen ``quote`` från :mod:`!pipes`-modulerna har flyttats till :mod:`shlex`-modulen och dokumenterats. :func:`~shlex.quote` undviker på rätt sätt alla tecken i en sträng som annars skulle kunna ges en speciell betydelse av skalet.

source: New functions:
sv: Nya funktioner:

source: :func:`~shutil.disk_usage`: provides total, used and free disk space statistics. (Contributed by Giampaolo Rodolà in :issue:`12442`.)
sv: :func:`~shutil.disk_usage`: ger statistik över totalt, använt och ledigt diskutrymme. (Bidrag från Giampaolo Rodolà i :issue:`12442`.)

source: :func:`~shutil.chown`: allows one to change user and/or group of the given path also specifying the user/group names and not only their numeric ids. (Contributed by Sandro Tosi in :issue:`12191`.)
sv: :func:`~shutil.chown`: gör det möjligt att ändra användare och/eller grupp för den angivna sökvägen genom att ange användarens/gruppens namn och inte bara deras numeriska id. (Bidrag från Sandro Tosi i :issue:`12191`.)

source: :func:`shutil.get_terminal_size`: returns the size of the terminal window to which the interpreter is attached. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
sv: :func:`shutil.get_terminal_size`: returnerar storleken på terminalfönstret som tolken är kopplad till. (Bidrag från Zbigniew Jędrzejewski-Szmek i :issue:`13609`.)

source: :func:`~shutil.copy2` and :func:`~shutil.copystat` now preserve file timestamps with nanosecond precision on platforms that support it. They also preserve file "extended attributes" on Linux. (Contributed by Larry Hastings in :issue:`14127` and :issue:`15238`.)
sv: :func:`~shutil.copy2` och :func:`~shutil.copystat` bevarar nu filernas tidsstämplar med nanosekundsprecision på plattformar som stöder detta. De bevarar även filens "utökade attribut" på Linux. (Bidrag från Larry Hastings i :issue:`14127` och :issue:`15238`.)

source: Several functions now take an optional ``symlinks`` argument: when that parameter is true, symlinks aren't dereferenced and the operation instead acts on the symlink itself (or creates one, if relevant). (Contributed by Hynek Schlawack in :issue:`12715`.)
sv: Flera funktioner tar nu ett valfritt ``symlinks``-argument: när den parametern är sann, avrefereras inte symlinks och operationen agerar istället på själva symlinken (eller skapar en, om relevant). (Bidrag från Hynek Schlawack i :issue:`12715`.)

source: When copying files to a different file system, :func:`~shutil.move` now handles symlinks the way the posix ``mv`` command does, recreating the symlink rather than copying the target file contents. (Contributed by Jonathan Niehof in :issue:`9993`.) :func:`~shutil.move` now also returns the ``dst`` argument as its result.
sv: Vid kopiering av filer till ett annat filsystem hanterar :func:`~shutil.move` nu symbollänkar på samma sätt som posix-kommandot ``mv`` gör, genom att återskapa symbollänken istället för att kopiera innehållet i målfilen. (Bidrag från Jonathan Niehof i :issue:`9993`.) :func:`~shutil.move` returnerar nu även argumentet ``dst`` som sitt resultat.

source: :func:`~shutil.rmtree` is now resistant to symlink attacks on platforms which support the new ``dir_fd`` parameter in :func:`os.open` and :func:`os.unlink`. (Contributed by Martin von Löwis and Hynek Schlawack in :issue:`4489`.)
sv: :func:`~shutil.rmtree` är nu resistent mot symlänk-attacker på plattformar som stöder den nya ``dir_fd``-parametern i :func:`os.open` och :func:`os.unlink`. (Bidrag från Martin von Löwis och Hynek Schlawack i :issue:`4489`.)

source: The :mod:`signal` module has new functions:
sv: Modulen :mod:`signal` har fått nya funktioner:

source: :func:`~signal.pthread_sigmask`: fetch and/or change the signal mask of the calling thread (Contributed by Jean-Paul Calderone in :issue:`8407`);
sv: :func:`~signal.pthread_sigmask`: hämta och/eller ändra signalmasken för den anropande tråden (Bidrag från Jean-Paul Calderone i :issue:`8407`);

source: :func:`~signal.pthread_kill`: send a signal to a thread;
sv: :func:`~signal.pthread_kill`: skicka en signal till en tråd;

source: :func:`~signal.sigpending`: examine pending functions;
sv: :func:`~signal.sigpending`: undersöka väntande funktioner;

source: :func:`~signal.sigwait`: wait a signal;
sv: :func:`~signal.sigwait`: vänta på en signal;

source: :func:`~signal.sigwaitinfo`: wait for a signal, returning detailed information about it;
sv: :func:`~signal.sigwaitinfo`: väntar på en signal och returnerar detaljerad information om den;

source: :func:`~signal.sigtimedwait`: like :func:`~signal.sigwaitinfo` but with a timeout.
sv: :func:`~signal.sigtimedwait`: som :func:`~signal.sigwaitinfo` men med en timeout.

source: The signal handler writes the signal number as a single byte instead of a nul byte into the wakeup file descriptor. So it is possible to wait more than one signal and know which signals were raised.
sv: Signalhanteraren skriver signalnumret som en enda byte i stället för en nul-byte i wakeup-filens deskriptor. Det är alltså möjligt att vänta på mer än en signal och veta vilka signaler som utlöstes.

source: :func:`signal.signal` and :func:`signal.siginterrupt` raise an OSError, instead of a RuntimeError: OSError has an errno attribute.
sv: :func:`signal.signal` och :func:`signal.siginterrupt` ger upphov till ett OSError, istället för ett RuntimeError: OSError har ett errno attribut.

source: The :mod:`!smtpd` module now supports :rfc:`5321` (extended SMTP) and :rfc:`1870` (size extension). Per the standard, these extensions are enabled if and only if the client initiates the session with an ``EHLO`` command.
sv: Modulen :mod:`!smtpd` stöder nu :rfc:`5321` (extended SMTP) och :rfc:`1870` (size extension). Enligt standarden aktiveras dessa tillägg om och endast om klienten initierar sessionen med ett ``EHLO``-kommando.

source: (Initial ``ELHO`` support by Alberto Trevino. Size extension by Juhana Jauhiainen. Substantial additional work on the patch contributed by Michele Orrù and Dan Boswell. :issue:`8739`)
sv: (Initialt stöd för ``ELHO`` av Alberto Trevino. Storleksutökning av Juhana Jauhiainen. Betydande ytterligare arbete på patchen bidragit av Michele Orrù och Dan Boswell. :issue:`8739`)

source: The :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL`, and :class:`~smtplib.LMTP` classes now accept a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Paulo Scardine in :issue:`11281`.)
sv: Klasserna :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL` och :class:`~smtplib.LMTP` accepterar nu ett ```source_address`` nyckelordsargument för att ange ``(host, port)`` att använda som källadress i bind-anropet när det utgående uttaget skapas. (Bidrag från Paulo Scardine i :issue:`11281`.)

source: :class:`~smtplib.SMTP` now supports the context management protocol, allowing an ``SMTP`` instance to be used in a ``with`` statement. (Contributed by Giampaolo Rodolà in :issue:`11289`.)
sv: :class:`~smtplib.SMTP` har nu stöd för kontexthanteringsprotokollet, vilket gör att en ``SMTP``-instans kan användas i en ``with``-sats. (Bidrag från Giampaolo Rodolà i :issue:`11289`.)

source: The :class:`~smtplib.SMTP_SSL` constructor and the :meth:`~smtplib.SMTP.starttls` method now accept an SSLContext parameter to control parameters of the secure channel. (Contributed by Kasun Herath in :issue:`8809`.)
sv: Konstruktorn :class:`~smtplib.SMTP_SSL` och metoden :meth:`~smtplib.SMTP.starttls` accepterar nu en SSLContext-parameter för att kontrollera parametrarna för den säkra kanalen. (Bidrag från Kasun Herath i :issue:`8809`.)

source: socket
sv: kortplats

source: The :class:`~socket.socket` class now exposes additional methods to process ancillary data when supported by the underlying platform:
sv: Klassen :class:`~socket.socket` innehåller nu ytterligare metoder för att bearbeta tilläggsdata när detta stöds av den underliggande plattformen:

source: (Contributed by David Watson in :issue:`6560`, based on an earlier patch by Heiko Wundram)
sv: (Bidrag från David Watson i :issue:`6560`, baserat på en tidigare patch av Heiko Wundram)

source: The :class:`~socket.socket` class now supports the PF_CAN protocol family (https://en.wikipedia.org/wiki/Socketcan), on Linux (https://lwn.net/Articles/253425).
sv: Klassen :class:`~socket.socket` har nu stöd för PF_CAN-protokollfamiljen (https://en.wikipedia.org/wiki/Socketcan), på Linux (https://lwn.net/Articles/253425).

source: (Contributed by Matthias Fuchs, updated by Tiago Gonçalves in :issue:`10141`.)
sv: (Bidrag från Matthias Fuchs, uppdaterad av Tiago Gonçalves i :issue:`10141`.)

source: The :class:`~socket.socket` class now supports the PF_RDS protocol family (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets and `https://oss.oracle.com/projects/rds <https://web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).
sv: Klassen :class:`~socket.socket` har nu stöd för PF_RDS-protokollfamiljen (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets och `https://oss.oracle.com/projects/rds <https://web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).

source: The :class:`~socket.socket` class now supports the ``PF_SYSTEM`` protocol family on OS X. (Contributed by Michael Goderbauer in :issue:`13777`.)
sv: Klassen :class:`~socket.socket` har nu stöd för protokollfamiljen ``PF_SYSTEM`` på OS X. (Bidrag från Michael Goderbauer i :issue:`13777`.)

source: New function :func:`~socket.sethostname` allows the hostname to be set on Unix systems if the calling process has sufficient privileges. (Contributed by Ross Lagerwall in :issue:`10866`.)
sv: Den nya funktionen :func:`~socket.sethostname` gör det möjligt att ställa in värdnamnet på Unix-system om den anropande processen har tillräckliga privilegier. (Bidrag från Ross Lagerwall i :issue:`10866`.)

source: :class:`~socketserver.BaseServer` now has an overridable method :meth:`~socketserver.BaseServer.service_actions` that is called by the :meth:`~socketserver.BaseServer.serve_forever` method in the service loop. :class:`~socketserver.ForkingMixIn` now uses this to clean up zombie child processes. (Contributed by Justin Warkentin in :issue:`11109`.)
sv: :class:`~socketserver.BaseServer` har nu en åsidosättbar metod :meth:`~socketserver.BaseServer.service_actions` som anropas av metoden :meth:`~socketserver.BaseServer.serve_forever` i serviceslingan. :class:`~socketserver.ForkingMixIn` använder nu detta för att rensa upp zombiebarnprocesser. (Bidrag från Justin Warkentin i :issue:`11109`.)

source: New :class:`sqlite3.Connection` method :meth:`~sqlite3.Connection.set_trace_callback` can be used to capture a trace of all sql commands processed by sqlite. (Contributed by Torsten Landschoff in :issue:`11688`.)
sv: Ny :class:`sqlite3.Connection`-metod :meth:`~sqlite3.Connection.set_trace_callback` kan användas för att fånga en spårning av alla sql-kommandon som bearbetas av sqlite. (Bidrag från Torsten Landschoff i :issue:`11688`.)

source: The :mod:`ssl` module has two new random generation functions:
sv: Modulen :mod:`ssl` har två nya funktioner för slumpgenerering:

source: :func:`~ssl.RAND_bytes`: generate cryptographically strong pseudo-random bytes.
sv: :func:`~ssl.RAND_bytes`: genererar kryptografiskt starka pseudoslumpmässiga bytes.

source: :func:`~ssl.RAND_pseudo_bytes`: generate pseudo-random bytes.
sv: :func:`~ssl.RAND_pseudo_bytes`: generera pseudoslumpmässiga byte.

source: (Contributed by Victor Stinner in :issue:`12049`.)
sv: (Bidrag från Victor Stinner i :issue:`12049`.)

source: The :mod:`ssl` module now exposes a finer-grained exception hierarchy in order to make it easier to inspect the various kinds of errors. (Contributed by Antoine Pitrou in :issue:`11183`.)
sv: Modulen :mod:`ssl` visar nu en mer finfördelad undantagshierarki för att göra det enklare att inspektera olika typer av fel. (Bidrag från Antoine Pitrou i :issue:`11183`.)

source: :meth:`~ssl.SSLContext.load_cert_chain` now accepts a *password* argument to be used if the private key is encrypted. (Contributed by Adam Simpkins in :issue:`12803`.)
sv: :meth:`~ssl.SSLContext.load_cert_chain` accepterar nu ett *password*-argument som ska användas om den privata nyckeln är krypterad. (Bidrag från Adam Simpkins i :issue:`12803`.)

source: Diffie-Hellman key exchange, both regular and Elliptic Curve-based, is now supported through the :meth:`~ssl.SSLContext.load_dh_params` and :meth:`~ssl.SSLContext.set_ecdh_curve` methods. (Contributed by Antoine Pitrou in :issue:`13626` and :issue:`13627`.)
sv: Diffie-Hellman nyckelutbyte, både vanligt och Elliptic Curve-baserat, stöds nu genom metoderna :meth:`~ssl.SSLContext.load_dh_params` och :meth:`~ssl.SSLContext.set_ecdh_curve`. (Bidrag från Antoine Pitrou i :issue:`13626` och :issue:`13627`.)

source: SSL sockets have a new :meth:`~ssl.SSLSocket.get_channel_binding` method allowing the implementation of certain authentication mechanisms such as SCRAM-SHA-1-PLUS. (Contributed by Jacek Konieczny in :issue:`12551`.)
sv: SSL-sockets har en ny :meth:`~ssl.SSLSocket.get_channel_binding`-metod som gör det möjligt att implementera vissa autentiseringsmekanismer som SCRAM-SHA-1-PLUS. (Bidrag från Jacek Konieczny i :issue:`12551`.)
