Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: :class:`~contextlib.ExitStack` now provides a solid foundation for programmatic manipulation of context managers and similar cleanup functionality. Unlike the previous ``contextlib.nested`` API (which was deprecated and removed), the new API is designed to work correctly regardless of whether context managers acquire their resources in their ``__init__`` method (for example, file objects) or in their ``__enter__`` method (for example, synchronisation objects from the :mod:`threading` module).
sv: :class:`~contextlib.ExitStack` ger nu en solid grund för programmatisk manipulation av kontexthanterare och liknande upprensningsfunktioner. Till skillnad från det tidigare API:et ``contextlib.nested`` (som föråldrades och togs bort), är det nya API:et utformat för att fungera korrekt oavsett om kontexthanterare förvärvar sina resurser i sin ``__init__``-metod (till exempel filobjekt) eller i sin ``__enter__``-metod (till exempel synkroniseringsobjekt från modulen :mod:`threading`).

source: (:issue:`13585`)
sv: (:utgåva:`13585`)

source: crypt
sv: kryptan

source: Addition of salt and modular crypt format (hashing method) and the :func:`!mksalt` function to the :mod:`!crypt` module.
sv: Tillägg av salt och modulärt kryptformat (hashingmetod) och funktionen :func:`!mksalt` till modulen :mod:`!crypt`.

source: (:issue:`10924`)
sv: (:utgåva:`10924`)

source: curses
sv: förbannelser

source: If the :mod:`curses` module is linked to the ncursesw library, use Unicode functions when Unicode strings or characters are passed (e.g. :c:func:`waddwstr`), and bytes functions otherwise (e.g. :c:func:`waddstr`).
sv: Om modulen :mod:`curses` är länkad till biblioteket ncursesw, använd Unicode-funktioner när Unicode-strängar eller tecken skickas (t.ex. :c:func:`waddwstr`), och bytes-funktioner annars (t.ex. :c:func:`waddstr`).

source: Use the locale encoding instead of ``utf-8`` to encode Unicode strings.
sv: Använd den lokala kodningen istället för ``utf-8`` för att koda Unicode-strängar.

source: :class:`curses.window` has a new :attr:`curses.window.encoding` attribute.
sv: :class:`curses.window` har ett nytt attribut :attr:`curses.window.encoding`.

source: The :class:`curses.window` class has a new :meth:`~curses.window.get_wch` method to get a wide character
sv: Klassen :class:`curses.window` har en ny :meth:`~curses.window.get_wch`-metod för att få ett brett tecken

source: The :mod:`curses` module has a new :meth:`~curses.unget_wch` function to push a wide character so the next :meth:`~curses.window.get_wch` will return it
sv: Modulen :mod:`curses` har en ny :meth:`~curses.unget_wch`-funktion för att skjuta upp ett brett tecken så att nästa :meth:`~curses.window.get_wch` returnerar det

source: (Contributed by Iñigo Serna in :issue:`6755`.)
sv: (Bidrag från Iñigo Serna i :issue:`6755`.)

source: datetime
sv: datatid

source: Equality comparisons between naive and aware :class:`~datetime.datetime` instances now return :const:`False` instead of raising :exc:`TypeError` (:issue:`15006`).
sv: Jämlikhetsjämförelser mellan naiva och medvetna :class:`~datetime.datetime`-instanser returnerar nu :const:`False` istället för att ge upphov till :exc:`TypeError` (:issue:`15006`).

source: New :meth:`datetime.datetime.timestamp` method: Return POSIX timestamp corresponding to the :class:`~datetime.datetime` instance.
sv: Ny :meth:`datetime.datetime.timestamp`-metod: Returnerar POSIX-tidsstämpel som motsvarar :class:`~datetime.datetime`-instansen.

source: The :meth:`datetime.datetime.strftime` method supports formatting years older than 1000.
sv: Metoden :meth:`datetime.datetime.strftime` stöder formatering av årtal äldre än 1000.

source: The :meth:`datetime.datetime.astimezone` method can now be called without arguments to convert datetime instance to the system timezone.
sv: Metoden :meth:`datetime.datetime.astimezone` kan nu anropas utan argument för att konvertera datetime-instansen till systemets tidszon.

source: :issue:`7652` - integrate fast native decimal arithmetic.
sv: :issue:`7652` - integrera snabb inbyggd decimalaritmetik.

source: C-module and libmpdec written by Stefan Krah.
sv: C-modul och libmpdec skrivna av Stefan Krah.

source: The new C version of the decimal module integrates the high speed libmpdec library for arbitrary precision correctly rounded decimal floating-point arithmetic. libmpdec conforms to IBM's General Decimal Arithmetic Specification.
sv: Den nya C-versionen av decimalmodulen integrerar det snabba libmpdec-biblioteket för flyttalsaritmetik med godtycklig precision och korrekt avrundad decimal. libmpdec överensstämmer med IBM:s General Decimal Arithmetic Specification.

source: Performance gains range from 10x for database applications to 100x for numerically intensive applications. These numbers are expected gains for standard precisions used in decimal floating-point arithmetic. Since the precision is user configurable, the exact figures may vary. For example, in integer bignum arithmetic the differences can be significantly higher.
sv: Prestandavinsterna varierar från 10x för databasapplikationer till 100x för numeriskt intensiva applikationer. Dessa siffror är förväntade vinster för standardprecisioner som används i decimal aritmetik med flyttal. Eftersom precisionen kan konfigureras av användaren kan de exakta siffrorna variera. Till exempel kan skillnaderna vara betydligt större i aritmetik med heltal och bignum.

source: The following table is meant as an illustration. Benchmarks are available at https://www.bytereef.org/mpdecimal/quickstart.html.
sv: Följande tabell är avsedd som en illustration. Benchmarks finns tillgängliga på https://www.bytereef.org/mpdecimal/quickstart.html.

source: speedup
sv: acceleration

source: telco
sv: telekom

source: The :exc:`~decimal.FloatOperation` signal optionally enables stricter semantics for mixing floats and Decimals.
sv: Signalen :exc:`~decimal.FloatOperation` ger möjlighet till striktare semantik för att blanda floats och decimaler.

source: If Python is compiled without threads, the C version automatically disables the expensive thread local context machinery. In this case, the variable :const:`~decimal.HAVE_THREADS` is set to ``False``.
sv: Om Python kompileras utan trådar, inaktiverar C-versionen automatiskt den dyra lokala kontextmekanismen för trådar. I detta fall sätts variabeln :const:`~decimal.HAVE_THREADS` till ``False``.

source: The C module has the following context limits, depending on the machine architecture:
sv: C-modulen har följande kontextgränser, beroende på maskinens arkitektur:

source: 32-bit
sv: 32-bitars

source: 64-bit
sv: 64-bitars

source: In the context templates (:const:`~decimal.DefaultContext`, :const:`~decimal.BasicContext` and :const:`~decimal.ExtendedContext`) the magnitude of :attr:`~decimal.Context.Emax` and :attr:`~decimal.Context.Emin` has changed to ``999999``.
sv: I kontextmallarna (:const:`~decimal.DefaultContext`, :const:`~decimal.BasicContext` och :const:`~decimal.ExtendedContext`) har storleken på :attr:`~decimal.Context.Emax` och :attr:`~decimal.Context.Emin` ändrats till ``999999``.

source: The :class:`~decimal.Decimal` constructor in decimal.py does not observe the context limits and converts values with arbitrary exponents or precision exactly. Since the C version has internal limits, the following scheme is used: If possible, values are converted exactly, otherwise :exc:`~decimal.InvalidOperation` is raised and the result is NaN. In the latter case it is always possible to use :meth:`~decimal.Context.create_decimal` in order to obtain a rounded or inexact value.
sv: Konstruktorn :class:`~decimal.Decimal` i decimal.py följer inte kontextgränserna och konverterar värden med godtyckliga exponenter eller precision exakt. Eftersom C-versionen har interna gränser används följande schema: Om möjligt konverteras värden exakt, annars :exc:`~decimal.InvalidOperation` och resultatet blir NaN. I det senare fallet är det alltid möjligt att använda :meth:`~decimal.Context.create_decimal` för att få ett avrundat eller inexakt värde.

source: The power function in decimal.py is always correctly rounded. In the C version, it is defined in terms of the correctly rounded :meth:`~decimal.Decimal.exp` and :meth:`~decimal.Decimal.ln` functions, but the final result is only "almost always correctly rounded".
sv: Potensfunktionen i decimal.py är alltid korrekt avrundad. I C-versionen definieras den i termer av de korrekt avrundade funktionerna :meth:`~decimal.Decimal.exp` och :meth:`~decimal.Decimal.ln`, men slutresultatet är bara "nästan alltid korrekt avrundat".

source: In the C version, the context dictionary containing the signals is a :class:`~collections.abc.MutableMapping`. For speed reasons, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` always refer to the same :class:`~collections.abc.MutableMapping` that the context was initialized with. If a new signal dictionary is assigned, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` are updated with the new values, but they do not reference the RHS dictionary.
sv: I C-versionen är kontextordboken som innehåller signalerna en :class:`~collections.abc.MutableMapping`. Av hastighetsskäl refererar :attr:`~decimal.Context.flags` och :attr:`~decimal.Context.traps` alltid till samma :class:`~collections.abc.MutableMapping` som kontexten initialiserades med. Om en ny signalordbok tilldelas, uppdateras :attr:`~decimal.Context.flags` och :attr:`~decimal.Context.traps` med de nya värdena, men de refererar inte till RHS ordbok.

source: Pickling a :class:`~decimal.Context` produces a different output in order to have a common interchange format for the Python and C versions.
sv: Pickling av en :class:`~decimal.Context` ger en annan utdata för att ha ett gemensamt utbytesformat för Python- och C-versionerna.

source: The order of arguments in the :class:`~decimal.Context` constructor has been changed to match the order displayed by :func:`repr`.
sv: Ordningen på argumenten i :class:`~decimal.Context`-konstruktören har ändrats så att den stämmer överens med den ordning som visas av :func:`repr`.

source: The ``watchexp`` parameter in the :meth:`~decimal.Decimal.quantize` method is deprecated.
sv: Parametern ``watchexp`` i metoden :meth:`~decimal.Decimal.quantize` är föråldrad.

source: email
sv: e-post

source: Policy Framework
sv: Politiskt ramverk

source: The email package now has a :mod:`~email.policy` framework. A :class:`~email.policy.Policy` is an object with several methods and properties that control how the email package behaves. The primary policy for Python 3.3 is the :class:`~email.policy.Compat32` policy, which provides backward compatibility with the email package in Python 3.2. A ``policy`` can be specified when an email message is parsed by a :mod:`~email.parser`, or when a :class:`~email.message.Message` object is created, or when an email is serialized using a :mod:`~email.generator`. Unless overridden, a policy passed to a ``parser`` is inherited by all the ``Message`` object and sub-objects created by the ``parser``. By default a ``generator`` will use the policy of the ``Message`` object it is serializing. The default policy is :data:`~email.policy.compat32`.
sv: E-postpaketet har nu ett :mod:`~email.policy`-ramverk. En :class:`~email.policy.policy` är ett objekt med flera metoder och egenskaper som styr hur e-postpaketet beter sig. Den primära policyn för Python 3.3 är :class:`~email.policy.Compat32`-policyn, som ger bakåtkompatibilitet med e-postpaketet i Python 3.2. En ``policy`` kan anges när ett e-postmeddelande analyseras av en :mod:`~email.parser`, eller när ett :class:`~email.message.Message`-objekt skapas, eller när ett e-postmeddelande serialiseras med en :mod:`~email.generator`. Om den inte åsidosätts ärvs en policy som skickas till en ``parser`` av alla ``Message``-objekt och underobjekt som skapas av ``parser``. Som standard kommer en ``generator`` att använda policyn för det ``Message``-objekt som den serialiserar. Standardpolicyn är :data:`~email.policy.compat32`.

source: The minimum set of controls implemented by all ``policy`` objects are:
sv: Den minsta uppsättning kontroller som implementeras av alla ``policy``-objekt är:

source: max_line_length
sv: max_radlängd

source: The maximum length, excluding the linesep character(s), individual lines may have when a ``Message`` is serialized. Defaults to 78.
sv: Den maximala längden, exklusive linesep-tecknet/tecknen, som enskilda rader kan ha när ett ``Message`` serialiseras. Standardvärdet är 78.

source: linesep
sv: linjespets

source: The character used to separate individual lines when a ``Message`` is serialized. Defaults to ``\n``.
sv: Det tecken som används för att separera enskilda rader när ett ``Message`` serialiseras. Standard är ``n``.

source: cte_type
sv: cte_typ

source: ``7bit`` or ``8bit``. ``8bit`` applies only to a ``Bytes`` ``generator``, and means that non-ASCII may be used where allowed by the protocol (or where it exists in the original input).
sv: ``7bit`` eller ``8bit``. ``8bit`` gäller endast för en ``Bytes`` ``generator`` och innebär att icke-ASCII kan användas där det är tillåtet enligt protokollet (eller där det finns i den ursprungliga inmatningen).

source: raise_on_defect
sv: höja_på_defekt

source: Causes a ``parser`` to raise error when defects are encountered instead of adding them to the ``Message`` object's ``defects`` list.
sv: Gör att en ``parser`` utlöser ett fel när defekter påträffas istället för att lägga till dem i ``Message``-objektets ``defects``-lista.

source: A new policy instance, with new settings, is created using the :meth:`~email.policy.Policy.clone` method of policy objects. ``clone`` takes any of the above controls as keyword arguments. Any control not specified in the call retains its default value. Thus you can create a policy that uses ``\r\n`` linesep characters like this::
sv: En ny policyinstans med nya inställningar skapas med hjälp av metoden :meth:`~email.policy.Policy.clone` för policyobjekt. ``clone`` tar någon av ovanstående kontroller som nyckelordsargument. Alla kontroller som inte anges i anropet behåller sitt standardvärde. På så sätt kan du skapa en policy som använder linjära tecken som "r" så här::

source: Policies can be used to make the generation of messages in the format needed by your application simpler. Instead of having to remember to specify ``linesep='\r\n'`` in all the places you call a ``generator``, you can specify it once, when you set the policy used by the ``parser`` or the ``Message``, whichever your program uses to create ``Message`` objects. On the other hand, if you need to generate messages in multiple forms, you can still specify the parameters in the appropriate ``generator`` call. Or you can have custom policy instances for your different cases, and pass those in when you create the ``generator``.
sv: Policies kan användas för att förenkla genereringen av meddelanden i det format som behövs i din applikation. Istället för att behöva komma ihåg att ange ``linesep='\r\n'`` på alla ställen där du anropar en ``generator``, kan du ange det en gång, när du anger den policy som används av ``parser`` eller ``Message``, beroende på vilket ditt program använder för att skapa ``Message``-objekt. Om du å andra sidan behöver generera meddelanden i flera olika former kan du fortfarande ange parametrarna i det lämpliga anropet till ``generator``. Eller så kan du ha anpassade policyinstanser för dina olika fall och skicka in dem när du skapar ``generator``.

source: Provisional Policy with New Header API
sv: Provisorisk policy med nytt Header API

source: While the policy framework is worthwhile all by itself, the main motivation for introducing it is to allow the creation of new policies that implement new features for the email package in a way that maintains backward compatibility for those who do not use the new policies. Because the new policies introduce a new API, we are releasing them in Python 3.3 as a :term:`provisional policy <provisional package>`. Backwards incompatible changes (up to and including removal of the code) may occur if deemed necessary by the core developers.
sv: Policyramverket är värdefullt i sig, men huvudmotivet för att introducera det är att möjliggöra skapandet av nya policyer som implementerar nya funktioner för e-postpaketet på ett sätt som bibehåller bakåtkompatibilitet för dem som inte använder de nya policyerna. Eftersom de nya policyerna introducerar ett nytt API, släpper vi dem i Python 3.3 som en :term:``provisorisk policy <provisional package>``. Bakåtkompatibla ändringar (upp till och inklusive borttagning av koden) kan förekomma om det anses nödvändigt av kärnutvecklarna.

source: The new policies are instances of :class:`~email.policy.EmailPolicy`, and add the following additional controls:
sv: De nya policyerna är instanser av :class:`~email.policy.EmailPolicy`, och lägger till följande ytterligare kontroller:

source: refold_source
sv: refold_källa

source: Controls whether or not headers parsed by a :mod:`~email.parser` are refolded by the :mod:`~email.generator`. It can be ``none``, ``long``, or ``all``. The default is ``long``, which means that source headers with a line longer than ``max_line_length`` get refolded. ``none`` means no line get refolded, and ``all`` means that all lines get refolded.
sv: Styr om rubriker som analyseras av en :mod:`~email.parser` ska vikas om av :mod:`~email.generator` eller inte. Det kan vara ``none``, ``long`` eller ``all``. Standardvärdet är ``long``, vilket innebär att källhuvuden med en rad längre än ``max_line_length`` viks om. ``none`` innebär att ingen rad viks om och ``all`` innebär att alla rader viks om.

source: A callable that take a ``name`` and ``value`` and produces a custom header object.
sv: En callable som tar ett ``namn`` och ``värde`` och producerar ett anpassat header-objekt.

source: The ``header_factory`` is the key to the new features provided by the new policies. When one of the new policies is used, any header retrieved from a ``Message`` object is an object produced by the ``header_factory``, and any time you set a header on a ``Message`` it becomes an object produced by ``header_factory``. All such header objects have a ``name`` attribute equal to the header name. Address and Date headers have additional attributes that give you access to the parsed data of the header. This means you can now do things like this::
sv: ``header_factory`` är nyckeln till de nya funktioner som de nya policyerna ger. När en av de nya policyerna används är varje header som hämtas från ett ``Message``-objekt ett objekt som produceras av ``header_factory``, och varje gång du ställer in en header på ett ``Message`` blir det ett objekt som produceras av ``header_factory``. Alla sådana headerobjekt har attributet ``name`` som är lika med headerns namn. Adress- och datumrubriker har ytterligare attribut som ger dig tillgång till rubrikens analyserade data. Detta innebär att du nu kan göra saker som detta::

source: >>> m = Message(policy=SMTP) >>> m['To'] = 'Éric <foo@example.com>' >>> m['to'] 'Éric <foo@example.com>' >>> m['to'].addresses (Address(display_name='Éric', username='foo', domain='example.com'),) >>> m['to'].addresses[0].username 'foo' >>> m['to'].addresses[0].display_name 'Éric' >>> m['Date'] = email.utils.localtime() >>> m['Date'].datetime datetime.datetime(2012, 5, 25, 21, 39, 24, 465484, tzinfo=datetime.timezone(datetime.timedelta(-1, 72000), 'EDT')) >>> m['Date'] 'Fri, 25 May 2012 21:44:27 -0400' >>> print(m) To: =?utf-8?q?=C3=89ric?= <foo@example.com> Date: Fri, 25 May 2012 21:44:27 -0400
sv: >>> m = Meddelande(policy=SMTP) >>> m['To'] = 'Éric <foo@example.com>' >>> m['to'] 'Éric <foo@example.com>' >>> m['to'].adresser (Address(display_name='Éric', username='foo', domain='example.com'),) >>> m['till'].adresser[0].användarnamn 'foo' >>> m['till'].adresser[0].visningsnamn 'Éric' >>> m['Datum'] = email.utils.localtime() >>> m['Datum'].datetime datetime.datetime(2012, 5, 25, 21, 39, 24, 465484, tzinfo=datetime.timezone(datetime.timedelta(-1, 72000), 'EDT')) >>> m['Datum'] 'Fri, 25 maj 2012 21:44:27 -0400' >>> print(m) Till: =?utf-8?q?=C3=89ric?= <foo@example.com> Date: Fri, 25 May 2012 21:44:27 -0400

source: You will note that the unicode display name is automatically encoded as ``utf-8`` when the message is serialized, but that when the header is accessed directly, you get the unicode version. This eliminates any need to deal with the :mod:`email.header` :meth:`~email.header.decode_header` or :meth:`~email.header.make_header` functions.
sv: Du kommer att märka att det unicodade visningsnamnet automatiskt kodas som ``utf-8`` när meddelandet serialiseras, men att du får den unicodade versionen när rubriken öppnas direkt. Detta eliminerar behovet av att hantera funktionerna :mod:`email.header` :meth:`~email.header.decode_header` eller :meth:`~email.header.make_header`.

source: You can also create addresses from parts::
sv: Du kan också skapa adresser från delar::

source: >>> m['cc'] = [Group('pals', [Address('Bob', 'bob', 'example.com'), ... Address('Sally', 'sally', 'example.com')]), ... Address('Bonzo', addr_spec='bonz@laugh.com')] >>> print(m) To: =?utf-8?q?=C3=89ric?= <foo@example.com> Date: Fri, 25 May 2012 21:44:27 -0400 cc: pals: Bob <bob@example.com>, Sally <sally@example.com>;, Bonzo <bonz@laugh.com>
sv: >>> m['cc'] = [Group('pals', [Address('Bob', 'bob', 'example.com'), ... Adress('Sally', 'sally', 'example.com')]), ... Adress('Bonzo', addr_spec='bonz@laugh.com')] >>> print(m) Till: =?utf-8?q?=C3=89ric?= <foo@example.com> Date: Fre, 25 maj 2012 21:44:27 -0400 cc: kompisar: Bob <bob@example.com>, Sally <sally@example.com>;, Bonzo <bonz@laugh.com>

source: Decoding to unicode is done automatically::
sv: Avkodning till unicode sker automatiskt::

source: >>> m2 = message_from_string(str(m)) >>> m2['to'] 'Éric <foo@example.com>'
sv: >>> m2 = meddelande_från_sträng(str(m)) >>> m2['till'] 'Éric <foo@example.com>'

source: When you parse a message, you can use the ``addresses`` and ``groups`` attributes of the header objects to access the groups and individual addresses::
sv: När du analyserar ett meddelande kan du använda attributen ``addresses`` och ``groups`` i rubrikobjekten för att komma åt grupperna och de enskilda adresserna::

source: >>> m2['cc'].addresses (Address(display_name='Bob', username='bob', domain='example.com'), Address(display_name='Sally', username='sally', domain='example.com'), Address(display_name='Bonzo', username='bonz', domain='laugh.com')) >>> m2['cc'].groups (Group(display_name='pals', addresses=(Address(display_name='Bob', username='bob', domain='example.com'), Address(display_name='Sally', username='sally', domain='example.com')), Group(display_name=None, addresses=(Address(display_name='Bonzo', username='bonz', domain='laugh.com'),))
sv: >>> m2['cc'].adresser (Address(display_name='Bob', username='bob', domain='example.com'), Address(display_name='Sally', username='sally', domain='example.com'), Address(display_name='Bonzo', username='bonz', domain='laugh.com')) >>> m2['cc'].grupper (Group(display_name='pals', addresses=(Address(display_name='Bob', username='bob', domain='example.com'), Address(display_name='Sally', username='sally', domain='example.com')), Group(display_name=None, addresses=(Address(display_name='Bonzo', username='bonz', domain='laugh.com'),))
