Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: :exc:`ImportError` now has ``name`` and ``path`` attributes which are set when there is relevant data to provide. The message for failed imports will also provide the full name of the module now instead of just the tail end of the module's name.
sv: :exc:`ImportError` har nu attributen ``name`` och ``path`` som anges när det finns relevanta data att tillhandahålla. Meddelandet för misslyckad import kommer nu också att innehålla modulens fullständiga namn istället för bara slutet av modulens namn.

source: The :func:`importlib.invalidate_caches` function will now call the method with the same name on all finders cached in :data:`sys.path_importer_cache` to help clean up any stored state as necessary.
sv: Funktionen :func:`importlib.invalidate_caches` kommer nu att anropa metoden med samma namn på alla sökare som cachats i :data:`sys.path_importer_cache` för att hjälpa till att rensa upp i lagrat tillstånd vid behov.

source: Visible Changes
sv: Synliga förändringar

source: For potential required changes to code, see the `Porting Python code`_ section.
sv: För eventuella nödvändiga ändringar i koden, se avsnittet `Porting Python code`_.

source: Beyond the expanse of what :mod:`importlib` now exposes, there are other visible changes to import. The biggest is that :data:`sys.meta_path` and :data:`sys.path_hooks` now store all of the meta path finders and path entry hooks used by import. Previously the finders were implicit and hidden within the C code of import instead of being directly exposed. This means that one can now easily remove or change the order of the various finders to fit one's needs.
sv: Utöver den stora mängden av vad :mod:`importlib` nu exponerar, finns det andra synliga förändringar i import. Den största är att :data:`sys.meta_path` och :data:`sys.path_hooks` nu lagrar alla metasökvägssökare och sökvägskrokar som används av import. Tidigare var sökarna implicita och gömda i C-koden för import i stället för att vara direkt exponerade. Detta innebär att man nu enkelt kan ta bort eller ändra ordningen på de olika sökarna så att de passar ens behov.

source: Another change is that all modules have a ``__loader__`` attribute, storing the loader used to create the module. :pep:`302` has been updated to make this attribute mandatory for loaders to implement, so in the future once 3rd-party loaders have been updated people will be able to rely on the existence of the attribute. Until such time, though, import is setting the module post-load.
sv: En annan förändring är att alla moduler har ett ``__loader__``-attribut, som lagrar den laddare som användes för att skapa modulen. :pep:`302` har uppdaterats för att göra detta attribut obligatoriskt för laddare att implementera, så i framtiden när laddare från tredje part har uppdaterats kommer folk att kunna lita på att attributet finns. Fram till dess ställer dock import in modulen efter laddning.

source: Loaders are also now expected to set the ``__package__`` attribute from :pep:`366`. Once again, import itself is already setting this on all loaders from :mod:`importlib` and import itself is setting the attribute post-load.
sv: Laddare förväntas nu också ställa in attributet ``__package__`` från :pep:`366`. Än en gång, import själv ställer redan in detta på alla laddare från :mod:`importlib` och import själv ställer in attributet efter laddning.

source: ``None`` is now inserted into :data:`sys.path_importer_cache` when no finder can be found on :data:`sys.path_hooks`. Since :class:`!imp.NullImporter` is not directly exposed on :data:`sys.path_hooks` it could no longer be relied upon to always be available to use as a value representing no finder found.
sv: ``None`` infogas nu i :data:`sys.path_importer_cache` när ingen sökare kan hittas i :data:`sys.path_hooks`. Eftersom :class:`!imp.NullImporter` inte är direkt exponerad på :data:`sys.path_hooks` kan man inte längre förlita sig på att den alltid är tillgänglig för att användas som ett värde som representerar att ingen sökare hittats.

source: All other changes relate to semantic changes which should be taken into consideration when updating code for Python 3.3, and thus should be read about in the `Porting Python code`_ section of this document.
sv: Alla andra ändringar avser semantiska ändringar som bör beaktas vid uppdatering av kod för Python 3.3, och bör därför läsas om i avsnittet `Porting Python code`_ i detta dokument.

source: (Implementation by Brett Cannon)
sv: (Genomförande av Brett Cannon)

source: Other Language Changes
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:

source: Added support for Unicode name aliases and named sequences. Both :func:`unicodedata.lookup` and ``'\N{...}'`` now resolve name aliases, and :func:`unicodedata.lookup` resolves named sequences too.
sv: Stöd för Unicode-namnaliaser och namngivna sekvenser har lagts till. Både :func:`unicodedata.lookup` och ``'\N{...}'`` löser nu namnaliaser, och :func:`unicodedata.lookup` löser även namngivna sekvenser.

source: (Contributed by Ezio Melotti in :issue:`12753`.)
sv: (Bidrag från Ezio Melotti i :issue:`12753`.)

source: Unicode database updated to UCD version 6.1.0
sv: Unicode-databasen uppdaterad till UCD version 6.1.0

source: Equality comparisons on :func:`range` objects now return a result reflecting the equality of the underlying sequences generated by those range objects. (:issue:`13201`)
sv: Jämlikhetsjämförelser på :func:`range`-objekt returnerar nu ett resultat som återspeglar likheten mellan de underliggande sekvenser som genereras av dessa range-objekt. (:issue:`13201`)

source: The ``count()``, ``find()``, ``rfind()``, ``index()`` and ``rindex()`` methods of :class:`bytes` and :class:`bytearray` objects now accept an integer between 0 and 255 as their first argument.
sv: Metoderna ``count()``, ``find()``, ``rfind()``, ``index()`` och ``rindex()`` för objekten :class:`bytes` och :class:`bytearray` accepterar nu ett heltal mellan 0 och 255 som sitt första argument.

source: (Contributed by Petri Lehtinen in :issue:`12170`.)
sv: (Bidrag från Petri Lehtinen i :issue:`12170`.)

source: The ``rjust()``, ``ljust()``, and ``center()`` methods of :class:`bytes` and :class:`bytearray` now accept a :class:`bytearray` for the ``fill`` argument. (Contributed by Petri Lehtinen in :issue:`12380`.)
sv: Metoderna ``rjust()``, ``ljust()`` och ``center()`` i :class:`bytes` och :class:`bytearray` accepterar nu :class:`bytearray` som argument för ``fill``. (Bidrag från Petri Lehtinen i :issue:`12380`.)

source: New methods have been added to :class:`list` and :class:`bytearray`: ``copy()`` and ``clear()`` (:issue:`10516`). Consequently, :class:`~collections.abc.MutableSequence` now also defines a :meth:`~collections.abc.MutableSequence.clear` method (:issue:`11388`).
sv: Nya metoder har lagts till i :class:`list` och :class:`bytearray`: ``copy()`` och ``clear()`` (:issue:`10516`). Följaktligen definierar :class:`~collections.abc.MutableSequence` nu också en :meth:`~collections.abc.MutableSequence.clear`-metod (:issue:`11388`).

source: Raw bytes literals can now be written ``rb"..."`` as well as ``br"..."``.
sv: Raw bytes literaler kan nu skrivas ``rb"..."`` såväl som ``br"..."``.

source: (Contributed by Antoine Pitrou in :issue:`13748`.)
sv: (Bidrag från Antoine Pitrou i :issue:`13748`.)

source: :meth:`dict.setdefault` now does only one lookup for the given key, making it atomic when used with built-in types.
sv: :meth:`dict.setdefault` gör nu bara en uppslagning för den angivna nyckeln, vilket gör den atomisk när den används med inbyggda typer.

source: (Contributed by Filip Gruszczyński in :issue:`13521`.)
sv: (Bidrag från Filip Gruszczyński i :issue:`13521`.)

source: The error messages produced when a function call does not match the function signature have been significantly improved.
sv: De felmeddelanden som visas när ett funktionsanrop inte stämmer överens med funktionssignaturen har förbättrats avsevärt.

source: (Contributed by Benjamin Peterson.)
sv: (Bidrag från Benjamin Peterson.)

source: A Finer-Grained Import Lock
sv: Ett mer finfördelat importlås

source: Previous versions of CPython have always relied on a global import lock. This led to unexpected annoyances, such as deadlocks when importing a module would trigger code execution in a different thread as a side-effect. Clumsy workarounds were sometimes employed, such as the :c:func:`PyImport_ImportModuleNoBlock` C API function.
sv: Tidigare versioner av CPython har alltid förlitat sig på ett globalt importlås. Detta ledde till oväntade irritationsmoment, t.ex. dödlägen när import av en modul skulle utlösa kodkörning i en annan tråd som en bieffekt. Klumpiga lösningar användes ibland, till exempel C API-funktionen :c:func:`PyImport_ImportModuleNoBlock`.

source: In Python 3.3, importing a module takes a per-module lock. This correctly serializes importation of a given module from multiple threads (preventing the exposure of incompletely initialized modules), while eliminating the aforementioned annoyances.
sv: I Python 3.3 tar import av en modul ett lås per modul. Detta serialiserar importen av en viss modul från flera trådar på ett korrekt sätt (vilket förhindrar exponering av ofullständigt initialiserade moduler), samtidigt som de tidigare nämnda irritationsmomenten elimineras.

source: (Contributed by Antoine Pitrou in :issue:`9260`.)
sv: (Bidrag från Antoine Pitrou i :issue:`9260`.)

source: Builtin functions and types
sv: Inbyggda funktioner och typer

source: :func:`open` gets a new *opener* parameter: the underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). It can be used to use custom flags like :const:`os.O_CLOEXEC` for example. The ``'x'`` mode was added: open for exclusive creation, failing if the file already exists.
sv: :func:`open` får en ny parameter *opener*: den underliggande filbeskrivaren för filobjektet erhålls sedan genom att anropa *opener* med (*file*, *flags*). Det kan användas för att använda anpassade flaggor som till exempel :const:`os.O_CLOEXEC`. Läget ``'x'`` lades till: öppet för exklusivt skapande, misslyckas om filen redan finns.

source: :func:`print`: added the *flush* keyword argument. If the *flush* keyword argument is true, the stream is forcibly flushed.
sv: :func:`print`: lade till nyckelordsargumentet *flush*. Om nyckelordsargumentet *flush* är sant, spolas flödet med våld.

source: :func:`hash`: hash randomization is enabled by default, see :meth:`object.__hash__` and :envvar:`PYTHONHASHSEED`.
sv: :func:`hash`: hashslumpning är aktiverad som standard, se :meth:`object.__hash__` och :envvar:`PYTHONHASHSEED`.

source: The :class:`str` type gets a new :meth:`~str.casefold` method: return a casefolded copy of the string, casefolded strings may be used for caseless matching. For example, ``'ß'.casefold()`` returns ``'ss'``.
sv: Typen :class:`str` får en ny :meth:`~str.casefold`-metod: returnerar en casefoldad kopia av strängen, casefoldade strängar kan användas för caseless matchning. Till exempel, ``'ß'.casefold()`` returnerar ``'ss'``.

source: The sequence documentation has been substantially rewritten to better explain the binary/text sequence distinction and to provide specific documentation sections for the individual builtin sequence types (:issue:`4966`).
sv: Dokumentationen för sekvenser har skrivits om i stor utsträckning för att bättre förklara skillnaden mellan binära och textsekvenser och för att tillhandahålla specifika dokumentationsavsnitt för de enskilda inbyggda sekvenstyperna (:issue:`4966`).

source: New Modules
sv: Nya moduler

source: faulthandler
sv: felhanterare

source: This new debug module :mod:`faulthandler` contains functions to dump Python tracebacks explicitly, on a fault (a crash like a segmentation fault), after a timeout, or on a user signal. Call :func:`faulthandler.enable` to install fault handlers for the :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS`, and :const:`SIGILL` signals. You can also enable them at startup by setting the :envvar:`PYTHONFAULTHANDLER` environment variable or by using :option:`-X` ``faulthandler`` command line option.
sv: Denna nya felsökningsmodul :mod:`faulthandler` innehåller funktioner för att dumpa Python-spårningar explicit, vid ett fel (en krasch som ett segmenteringsfel), efter en timeout eller vid en användarsignal. Anropa :func:`faulthandler.enable` för att installera felhanterare för signalerna :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` och :const:`SIGILL`. Du kan också aktivera dem vid start genom att ställa in miljövariabeln :envvar:`PYTHONFAULTHANDLER` eller genom att använda kommandoradsalternativet :option:`-X` ``faulthandler``.

source: Example of a segmentation fault on Linux:
sv: Exempel på ett segmenteringsfel på Linux:

source: $ python -q -X faulthandler >>> import ctypes >>> ctypes.string_at(0) Fatal Python error: Segmentation fault Current thread 0x00007fb899f39700: File "/home/python/cpython/Lib/ctypes/__init__.py", line 486 in string_at File "<stdin>", line 1 in <module> Segmentation fault
sv: $ python -q -X faulthandler &gt;&gt;&gt; import ctypes &gt;&gt;&gt; ctypes.string_at(0) Fatalt Python-fel: Segmenteringsfel Aktuell tråd 0x00007fb899f39700: Fil "/home/python/cpython/Lib/ctypes/__init__.py", rad 486 i string_at Fil "<stdin>", rad 1 i <module> Segmenteringsfel

source: ipaddress
sv: ipadress

source: The new :mod:`ipaddress` module provides tools for creating and manipulating objects representing IPv4 and IPv6 addresses, networks and interfaces (i.e. an IP address associated with a specific IP subnet).
sv: Den nya modulen :mod:`ipaddress` tillhandahåller verktyg för att skapa och manipulera objekt som representerar IPv4- och IPv6-adresser, nätverk och gränssnitt (dvs. en IP-adress som är associerad med ett specifikt IP-subnät).

source: (Contributed by Google and Peter Moody in :pep:`3144`.)
sv: (Bidrag från Google och Peter Moody i :pep:`3144`.)

source: The newly added :mod:`lzma` module provides data compression and decompression using the LZMA algorithm, including support for the ``.xz`` and ``.lzma`` file formats.
sv: Den nyligen tillagda modulen :mod:`lzma` tillhandahåller datakomprimering och dekomprimering med hjälp av LZMA-algoritmen, inklusive stöd för filformaten ``.xz`` och ``.lzma``.

source: (Contributed by Nadeem Vawda and Per Øyvind Karlsen in :issue:`6715`.)
sv: (Bidrag från Nadeem Vawda och Per Øyvind Karlsen i :issue:`6715`.)

source: Improved Modules
sv: Förbättrade moduler

source: Improved support for abstract base classes containing descriptors composed with abstract methods. The recommended approach to declaring abstract descriptors is now to provide :attr:`__isabstractmethod__` as a dynamically updated property. The built-in descriptors have been updated accordingly.
sv: Förbättrat stöd för abstrakta basklasser som innehåller deskriptorer som består av abstrakta metoder. Det rekommenderade tillvägagångssättet för att deklarera abstrakta deskriptorer är nu att tillhandahålla :attr:`__isabstractmethod__` som en dynamiskt uppdaterad egenskap. De inbyggda deskriptorerna har uppdaterats i enlighet med detta.

source: :class:`abc.abstractproperty` has been deprecated, use :class:`property` with :func:`abc.abstractmethod` instead.
sv: :class:`abc.abstractproperty` har utgått, använd :class:`property` med :func:`abc.abstractmethod` istället.

source: :class:`abc.abstractclassmethod` has been deprecated, use :class:`classmethod` with :func:`abc.abstractmethod` instead.
sv: :class:`abc.abstractclassmethod` har utgått, använd :class:`classmethod` med :func:`abc.abstractmethod` istället.

source: :class:`abc.abstractstaticmethod` has been deprecated, use :class:`staticmethod` with :func:`abc.abstractmethod` instead.
sv: :class:`abc.abstractstaticmethod` har utgått, använd :class:`staticmethod` med :func:`abc.abstractmethod` istället.

source: (Contributed by Darren Dale in :issue:`11610`.)
sv: (Bidrag från Darren Dale i :issue:`11610`.)

source: :meth:`abc.ABCMeta.register` now returns the registered subclass, which means it can now be used as a class decorator (:issue:`10868`).
sv: :meth:`abc.ABCMeta.register` returnerar nu den registrerade underklassen, vilket innebär att den nu kan användas som en klassdekorator (:issue:`10868`).

source: The :mod:`array` module supports the :c:expr:`long long` type using ``q`` and ``Q`` type codes.
sv: Modulen :mod:`array` stöder typen :c:expr:`long long` med hjälp av typkoderna ``q`` och ``Q``.

source: (Contributed by Oren Tirosh and Hirokazu Yamamoto in :issue:`1172711`.)
sv: (Bidrag från Oren Tirosh och Hirokazu Yamamoto i :issue:`1172711`.)

source: base64
sv: bas64

source: ASCII-only Unicode strings are now accepted by the decoding functions of the :mod:`base64` modern interface. For example, ``base64.b64decode('YWJj')`` returns ``b'abc'``. (Contributed by Catalin Iacob in :issue:`13641`.)
sv: ASCII-only Unicode-strängar accepteras nu av avkodningsfunktionerna i det moderna gränssnittet :mod:`base64`. Till exempel, ``base64.b64decode('YWJj')`` returnerar ``b'abc'``. (Bidrag från Catalin Iacob i :issue:`13641`.)

source: In addition to the binary objects they normally accept, the ``a2b_`` functions now all also accept ASCII-only strings as input. (Contributed by Antoine Pitrou in :issue:`13637`.)
sv: Förutom de binära objekt som de normalt accepterar, accepterar nu alla ``a2b_``-funktioner även ASCII-strängar som indata. (Bidrag från Antoine Pitrou i :issue:`13637`.)

source: The :mod:`bz2` module has been rewritten from scratch. In the process, several new features have been added:
sv: Modulen :mod:`bz2` har skrivits om från grunden. Under processen har flera nya funktioner lagts till:

source: New :func:`bz2.open` function: open a bzip2-compressed file in binary or text mode.
sv: Ny :func:`bz2.open`-funktion: öppna en bzip2-komprimerad fil i binärt eller textläge.

source: :class:`bz2.BZ2File` can now read from and write to arbitrary file-like objects, by means of its constructor's *fileobj* argument.
sv: :class:`bz2.BZ2File` kan nu läsa från och skriva till godtyckliga filliknande objekt, med hjälp av konstruktörens *fileobj*-argument.

source: (Contributed by Nadeem Vawda in :issue:`5863`.)
sv: (Bidrag från Nadeem Vawda i :issue:`5863`.)

source: :class:`bz2.BZ2File` and :func:`bz2.decompress` can now decompress multi-stream inputs (such as those produced by the :program:`pbzip2` tool). :class:`bz2.BZ2File` can now also be used to create this type of file, using the ``'a'`` (append) mode.
sv: :class:`bz2.BZ2File` och :func:`bz2.decompress` kan nu dekomprimera inmatningar med flera strömmar (t.ex. de som produceras av verktyget :program:`pbzip2`). :class:`bz2.BZ2File` kan nu också användas för att skapa den här typen av filer med läget ``'a`` (append).

source: (Contributed by Nir Aides in :issue:`1625`.)
sv: (Bidrag från Nir Aides i :issue:`1625`.)

source: :class:`bz2.BZ2File` now implements all of the :class:`io.BufferedIOBase` API, except for the :meth:`detach` and :meth:`truncate` methods.
sv: :class:`bz2.BZ2File` implementerar nu hela :class:`io.BufferedIOBase` API, förutom metoderna :meth:`detach` och :meth:`truncate`.

source: The :mod:`~encodings.mbcs` codec has been rewritten to handle correctly ``replace`` and ``ignore`` error handlers on all Windows versions. The :mod:`~encodings.mbcs` codec now supports all error handlers, instead of only ``replace`` to encode and ``ignore`` to decode.
sv: Codec :mod:`~encodings.mbcs` har skrivits om för att korrekt hantera felhanterarna ``replace`` och ``ignore`` på alla Windows-versioner. Codecen :mod:`~encodings.mbcs` stöder nu alla felhanterare, istället för bara ``replace`` för kodning och ``ignore`` för avkodning.

source: A new Windows-only codec has been added: ``cp65001`` (:issue:`13216`). It is the Windows code page 65001 (Windows UTF-8, ``CP_UTF8``). For example, it is used by ``sys.stdout`` if the console output code page is set to cp65001 (e.g., using ``chcp 65001`` command).
sv: En ny codec för enbart Windows har lagts till: ``cp65001`` (:issue:`13216``). Det är Windows-kodsidan 65001 (Windows UTF-8, ``CP_UTF8``). Den används till exempel av ``sys.stdout`` om kodsidan för konsolutmatning är inställd på cp65001 (t.ex. med kommandot ``chcp 65001``).

source: Multibyte CJK decoders now resynchronize faster. They only ignore the first byte of an invalid byte sequence. For example, ``b'\xff\n'.decode('gb2312', 'replace')`` now returns a ``\n`` after the replacement character.
sv: CJK-avkodare för flera byte återsynkroniseras nu snabbare. De ignorerar bara den första byten i en ogiltig byte-sekvens. Till exempel, ``b'\xff\n'.decode('gb2312', 'replace')`` returnerar nu ett ``\n`` efter ersättningstecknet.

source: (:issue:`12016`)
sv: (:utgåva:`12016`)

source: Incremental CJK codec encoders are no longer reset at each call to their encode() methods. For example::
sv: Inkrementella CJK-codec-kodare nollställs inte längre vid varje anrop till deras encode()-metoder. Till exempel::

source: >>> import codecs >>> encoder = codecs.getincrementalencoder('hz')('strict') >>> b''.join(encoder.encode(x) for x in '\u52ff\u65bd\u65bc\u4eba\u3002 Bye.') b'~{NpJ)l6HK!#~} Bye.'
sv: >>> import codecs >>> kodare = codecs.getincrementalencoder('hz')('strict') >>> b''.join(encoder.encode(x) for x in '\u52ff\u65bd\u65bc\u4eba\u3002 Hej då.') b'~{NpJ)l6HK!#~} Hej då.'

source: This example gives ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` with older Python versions.
sv: Detta exempel ger ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` med äldre Python-versioner.

source: (:issue:`12100`)
sv: (:utgåva:`12100`)

source: The ``unicode_internal`` codec has been deprecated.
sv: Codec ``unicode_internal`` har utgått.

source: collections
sv: samlingar

source: Addition of a new :class:`~collections.ChainMap` class to allow treating a number of mappings as a single unit. (Written by Raymond Hettinger for :issue:`11089`, made public in :issue:`11297`.)
sv: Tillägg av en ny :class:`~collections.ChainMap`-klass som gör det möjligt att behandla ett antal mappningar som en enda enhet. (Skrivet av Raymond Hettinger för :issue:`11089`, publicerat i :issue:`11297`.)

source: The abstract base classes have been moved in a new :mod:`collections.abc` module, to better differentiate between the abstract and the concrete collections classes. Aliases for ABCs are still present in the :mod:`collections` module to preserve existing imports. (:issue:`11085`)
sv: De abstrakta basklasserna har flyttats till en ny modul :mod:`collections.abc` för att bättre skilja mellan de abstrakta och de konkreta samlingsklasserna. Alias för ABC finns fortfarande kvar i modulen :mod:`collections` för att bevara befintlig import. (:issue:`11085`)

source: The :class:`~collections.Counter` class now supports the unary ``+`` and ``-`` operators, as well as the in-place operators ``+=``, ``-=``, ``|=``, and ``&=``. (Contributed by Raymond Hettinger in :issue:`13121`.)
sv: Klassen :class:`~collections.Counter` har nu stöd för de unära operatorerna ``+`` och ``-``, samt för in-place-operatorerna ``+=``, ``-=``, ``|=`` och ``&=``. (Bidrag från Raymond Hettinger i :issue:`13121`.)
