Repository: yeager/python-docs-sv
Catalog: whatsnew/3.3.po
Languages: sv

source: can now be written without the :mod:`errno` import and without manual inspection of exception attributes::
sv: kan nu skrivas utan :mod:`errno`-importen och utan manuell inspektion av undantagsattribut::

source: try: with open("document.txt") as f: content = f.read() except FileNotFoundError: print("document.txt file is missing") except PermissionError: print("You are not allowed to read document.txt")
sv: försök: med open("document.txt") som f: innehåll = f.read() except FileNotFoundError: print("filen document.txt saknas") except PermissionError: print("Du har inte tillåtelse att läsa document.txt")

source: :pep:`3151` - Reworking the OS and IO Exception Hierarchy
sv: :pep:`3151` - Omarbetning av undantagshierarkin för OS och IO

source: PEP written and implemented by Antoine Pitrou
sv: PEP skrivet och genomfört av Antoine Pitrou

source: PEP 380: Syntax for Delegating to a Subgenerator
sv: PEP 380: Syntax för delegering till en undergenerator

source: PEP 380 adds the ``yield from`` expression, allowing a :term:`generator` to delegate part of its operations to another generator. This allows a section of code containing :keyword:`yield` to be factored out and placed in another generator. Additionally, the subgenerator is allowed to return with a value, and the value is made available to the delegating generator.
sv: PEP 380 lägger till uttrycket ``yield from``, vilket gör det möjligt för en :term:`generator` att delegera en del av sina operationer till en annan generator. Detta gör att ett kodavsnitt som innehåller :keyword:`yield` kan faktoriseras ut och placeras i en annan generator. Dessutom tillåts subgeneratorn att returnera ett värde, och värdet görs tillgängligt för den delegerande generatorn.

source: While designed primarily for use in delegating to a subgenerator, the ``yield from`` expression actually allows delegation to arbitrary subiterators.
sv: Uttrycket ``yield from`` är främst avsett att användas för delegering till en subgenerator, men det tillåter faktiskt delegering till godtyckliga subiteratorer.

source: For simple iterators, ``yield from iterable`` is essentially just a shortened form of ``for item in iterable: yield item``::
sv: För enkla iteratorer är ``yield from iterable`` i huvudsak bara en förkortad form av ``for item in iterable: yield item``::

source: >>> def g(x): ... yield from range(x, 0, -1) ... yield from range(x) ... >>> list(g(5)) [5, 4, 3, 2, 1, 0, 1, 2, 3, 4]
sv: >>> def g(x): ... yield from range(x, 0, -1) ... avkastning från intervall(x) ... >>> list(g(5)) [5, 4, 3, 2, 1, 0, 1, 2, 3, 4]

source: However, unlike an ordinary loop, ``yield from`` allows subgenerators to receive sent and thrown values directly from the calling scope, and return a final value to the outer generator::
sv: Till skillnad från en vanlig loop tillåter dock ``yield from`` undergeneratorer att ta emot skickade och kastade värden direkt från det anropande området och returnera ett slutvärde till den yttre generatorn::

source: >>> def accumulate(): ... tally = 0 ... while 1: ... next = yield ... if next is None: ... return tally ... tally += next ... >>> def gather_tallies(tallies): ... while 1: ... tally = yield from accumulate() ... tallies.append(tally) ... >>> tallies = [] >>> acc = gather_tallies(tallies) >>> next(acc) # Ensure the accumulator is ready to accept values >>> for i in range(4): ... acc.send(i) ... >>> acc.send(None) # Finish the first tally >>> for i in range(5): ... acc.send(i) ... >>> acc.send(None) # Finish the second tally >>> tallies [6, 10]
sv: >>> def ackumulera(): ... tally = 0 ... medan 1: ... nästa = avkastning ... om nästa är ingen: ... returnera tally ... tally += nästa ... >>> def samla_tallies(tallies): ... while 1: ... tally = avkastning från accumulate() ... tallies.append(tally) ... >>> tallies = [] >>> acc = samla_tallies(tallies) >>> next(acc) # Se till att ackumulatorn är redo att ta emot värden >>> for i in range(4): ... acc.send(i) ... >>> acc.send(None) # Avsluta den första tally >>> för i i intervall(5): ... acc.send(i) ... >>> acc.send(None) # Avsluta den andra räkningen >>> tallies [6, 10]

source: The main principle driving this change is to allow even generators that are designed to be used with the ``send`` and ``throw`` methods to be split into multiple subgenerators as easily as a single large function can be split into multiple subfunctions.
sv: Huvudprincipen bakom denna ändring är att även generatorer som är utformade för att användas med metoderna ``send`` och ``throw`` ska kunna delas upp i flera undergeneratorer lika enkelt som en enda stor funktion kan delas upp i flera underfunktioner.

source: :pep:`380` - Syntax for Delegating to a Subgenerator
sv: :pep:`380` - Syntax för att delegera till en undergenerator

source: PEP written by Greg Ewing; implementation by Greg Ewing, integrated into 3.3 by Renaud Blanch, Ryan Kelly and Nick Coghlan; documentation by Zbigniew Jędrzejewski-Szmek and Nick Coghlan
sv: PEP skriven av Greg Ewing; implementering av Greg Ewing, integrerad i 3.3 av Renaud Blanch, Ryan Kelly och Nick Coghlan; dokumentation av Zbigniew Jędrzejewski-Szmek och Nick Coghlan

source: PEP 409: Suppressing exception context
sv: PEP 409: Undertryckande av undantagskontext

source: PEP 409 introduces new syntax that allows the display of the chained exception context to be disabled. This allows cleaner error messages in applications that convert between exception types::
sv: PEP 409 introducerar en ny syntax som gör det möjligt att inaktivera visningen av den kedjade undantagskontexten. Detta möjliggör renare felmeddelanden i applikationer som konverterar mellan undantagstyper::

source: >>> class D: ... def __init__(self, extra): ... self._extra_attributes = extra ... def __getattr__(self, attr): ... try: ... return self._extra_attributes[attr] ... except KeyError: ... raise AttributeError(attr) from None ... >>> D({}).x Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 8, in __getattr__ AttributeError: x
sv: &gt;&gt;&gt; klass D: ... def __init__(self, extra): ... self._extra_attributes = extra ... def __getattr__(self, attr): ... try: ... return self._extra_attributes[attr] ... except KeyError: ... raise AttributeError(attr) from None ... &gt;&gt;&gt; D({}).x Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> Fil "<stdin>", rad 8, i __getattr__ Attributfel: x

source: Without the ``from None`` suffix to suppress the cause, the original exception would be displayed by default::
sv: Utan suffixet ``from None`` för att undertrycka orsaken skulle det ursprungliga undantaget visas som standard::

source: >>> class C: ... def __init__(self, extra): ... self._extra_attributes = extra ... def __getattr__(self, attr): ... try: ... return self._extra_attributes[attr] ... except KeyError: ... raise AttributeError(attr) ... >>> C({}).x Traceback (most recent call last): File "<stdin>", line 6, in __getattr__ KeyError: 'x' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 8, in __getattr__ AttributeError: x
sv: &gt;&gt;&gt; klass C: ... def __init__(self, extra): ... self._extra_attributes = extra ... def __getattr__(self, attr): ... try: ... return self._extra_attributes[attr] ... except KeyError: ... raise AttributeError(attr) ... &gt;&gt;&gt; C({}).x Traceback (senaste anropet senast): Fil "<stdin>", rad 6, i __getattr__ KeyError: 'x' Under hanteringen av ovanstående undantag inträffade ett annat undantag: Traceback (senaste anropet sist): Fil "<stdin>", rad 1, i <module> Fil "<stdin>", rad 8, i __getattr__ Attributfel: x

source: No debugging capability is lost, as the original exception context remains available if needed (for example, if an intervening library has incorrectly suppressed valuable underlying details)::
sv: Ingen felsökningskapacitet går förlorad, eftersom den ursprungliga undantagskontexten förblir tillgänglig om det behövs (till exempel om ett mellanliggande bibliotek felaktigt har undertryckt värdefulla underliggande detaljer)::

source: >>> try: ... D({}).x ... except AttributeError as exc: ... print(repr(exc.__context__)) ... KeyError('x',)
sv: >>> försök: ... D({}).x ... except AttributeError as exc: ... print(repr(exc.__context__)) ... KeyError('x',)

source: :pep:`409` - Suppressing exception context
sv: :pep:`409` - Undertryckande av undantagskontext

source: PEP written by Ethan Furman; implemented by Ethan Furman and Nick Coghlan.
sv: PEP skriven av Ethan Furman; implementerad av Ethan Furman och Nick Coghlan.

source: PEP 414: Explicit Unicode literals
sv: PEP 414: Explicita Unicode-litteraler

source: To ease the transition from Python 2 for Unicode aware Python applications that make heavy use of Unicode literals, Python 3.3 once again supports the "``u``" prefix for string literals. This prefix has no semantic significance in Python 3, it is provided solely to reduce the number of purely mechanical changes in migrating to Python 3, making it easier for developers to focus on the more significant semantic changes (such as the stricter default separation of binary and text data).
sv: För att underlätta övergången från Python 2 för Unicode-medvetna Python-applikationer som använder Unicode-litteraler i stor utsträckning, stöder Python 3.3 återigen prefixet "``u``" för stränglitteraler. Detta prefix har ingen semantisk betydelse i Python 3, det tillhandahålls enbart för att minska antalet rent mekaniska förändringar vid migrering till Python 3, vilket gör det lättare för utvecklare att fokusera på de mer betydande semantiska förändringarna (såsom den striktare standardseparationen av binär- och textdata).

source: :pep:`414` - Explicit Unicode literals
sv: :pep:`414` - Explicita Unicode-litteraler

source: PEP written by Armin Ronacher.
sv: PEP skriven av Armin Ronacher.

source: PEP 3155: Qualified name for classes and functions
sv: PEP 3155: Kvalificerade namn för klasser och funktioner

source: Functions and class objects have a new :attr:`~definition.__qualname__` attribute representing the "path" from the module top-level to their definition. For global functions and classes, this is the same as :attr:`~definition.__name__`. For other functions and classes, it provides better information about where they were actually defined, and how they might be accessible from the global scope.
sv: Funktioner och klassobjekt har ett nytt attribut :attr:`~definition.__qualname__` som representerar "sökvägen" från modulens toppnivå till deras definition. För globala funktioner och klasser är detta samma sak som :attr:`~definition.__name__`. För andra funktioner och klasser ger det bättre information om var de faktiskt definierades och hur de kan vara åtkomliga från det globala omfånget.

source: Example with (non-bound) methods::
sv: Exempel med (icke bundna) metoder::

source: >>> class C: ... def meth(self): ... pass ... >>> C.meth.__name__ 'meth' >>> C.meth.__qualname__ 'C.meth'
sv: >>> klass C: ... def meth(self): ... pass ... >>> C.meth.__name__ 'meth' >>> C.meth.__qualname__ 'C.meth'

source: Example with nested classes::
sv: Exempel med nästlade klasser::

source: >>> class C: ... class D: ... def meth(self): ... pass ... >>> C.D.__name__ 'D' >>> C.D.__qualname__ 'C.D' >>> C.D.meth.__name__ 'meth' >>> C.D.meth.__qualname__ 'C.D.meth'
sv: >>> klass C: ... klass D: ... def meth(self): ... pass ... >>> C.D.__name__ 'D' >>> C.D.__kvalnamn 'C.D' >>> C.D.meth.__name__ 'meth' >>> C.D.meth.__kvalnamn 'C.D.meth'

source: Example with nested functions::
sv: Exempel med nästlade funktioner::

source: >>> def outer(): ... def inner(): ... pass ... return inner ... >>> outer().__name__ 'inner' >>> outer().__qualname__ 'outer.<locals>.inner'
sv: &gt;&gt;&gt; def outer(): ... def inner(): ... pass ... returnera inre ... &gt;&gt;&gt; yttre().__name__ 'inner' &gt;&gt;&gt; yttre().__kvalnamn__ 'outer.<locals>.inner'

source: The string representation of those objects is also changed to include the new, more precise information::
sv: Strängrepresentationen av dessa objekt ändras också för att inkludera den nya, mer exakta informationen::

source: >>> str(C.D) "<class '__main__.C.D'>" >>> str(C.D.meth) '<function C.D.meth at 0x7f46b9fe31e0>'
sv: >>> str(C.D) "<klass '__main__.C.D'>" >>> str(C.D.meth) "<funktion C.D.meth på 0x7f46b9fe31e0>

source: :pep:`3155` - Qualified name for classes and functions
sv: :pep:`3155` - Kvalificerat namn för klasser och funktioner

source: PEP written and implemented by Antoine Pitrou.
sv: PEP skrivet och genomfört av Antoine Pitrou.

source: PEP 412: Key-Sharing Dictionary
sv: PEP 412: Ordbok för nyckelutbyte

source: Dictionaries used for the storage of objects' attributes are now able to share part of their internal storage between each other (namely, the part which stores the keys and their respective hashes). This reduces the memory consumption of programs creating many instances of non-builtin types.
sv: Dictionaries som används för lagring av objektens attribut kan nu dela en del av sitt interna minne mellan varandra (nämligen den del som lagrar nycklarna och deras respektive hash). Detta minskar minnesförbrukningen i program som skapar många instanser av icke byggda typer.

source: :pep:`412` - Key-Sharing Dictionary
sv: :pep:`412` - Ordbok för nyckeldelning

source: PEP written and implemented by Mark Shannon.
sv: PEP skrivet och genomfört av Mark Shannon.

source: PEP 362: Function Signature Object
sv: PEP 362: Funktion Signatur Objekt

source: A new function :func:`inspect.signature` makes introspection of python callables easy and straightforward. A broad range of callables is supported: python functions, decorated or not, classes, and :func:`functools.partial` objects. New classes :class:`inspect.Signature`, :class:`inspect.Parameter` and :class:`inspect.BoundArguments` hold information about the call signatures, such as, annotations, default values, parameters kinds, and bound arguments, which considerably simplifies writing decorators and any code that validates or amends calling signatures or arguments.
sv: En ny funktion :func:`inspect.signature` gör introspektion av python callables enkel och okomplicerad. Ett brett spektrum av anropsbara objekt stöds: pythonfunktioner, dekorerade eller ej, klasser och :func:`functools.partial`-objekt. De nya klasserna :class:`inspect.Signature`, :class:`inspect.Parameter` och :class:`inspect.BoundArguments` innehåller information om anropssignaturer, t.ex. annoteringar, standardvärden, parametertyper och bundna argument, vilket avsevärt förenklar skrivandet av dekoratorer och annan kod som validerar eller ändrar anropssignaturer eller argument.

source: :pep:`362`: - Function Signature Object
sv: :pep:`362`: - Funktion Signatur Objekt

source: PEP written by Brett Cannon, Yury Selivanov, Larry Hastings, Jiwon Seo; implemented by Yury Selivanov.
sv: PEP skriven av Brett Cannon, Yury Selivanov, Larry Hastings, Jiwon Seo; implementerad av Yury Selivanov.

source: PEP 421: Adding sys.implementation
sv: PEP 421: Lägga till sys.implementation

source: A new attribute on the :mod:`sys` module exposes details specific to the implementation of the currently running interpreter. The initial set of attributes on :data:`sys.implementation` are ``name``, ``version``, ``hexversion``, and ``cache_tag``.
sv: Ett nytt attribut på modulen :mod:`sys` visar detaljer som är specifika för implementationen av den tolk som körs för tillfället. Den första uppsättningen attribut på :data:`sys.implementation` är ``name``, ``version``, ``hexversion`` och ``cache_tag``.

source: The intention of ``sys.implementation`` is to consolidate into one namespace the implementation-specific data used by the standard library. This allows different Python implementations to share a single standard library code base much more easily. In its initial state, ``sys.implementation`` holds only a small portion of the implementation-specific data. Over time that ratio will shift in order to make the standard library more portable.
sv: Avsikten med ``sys.implementation`` är att konsolidera implementationsspecifika data som används av standardbiblioteket i ett namnområde. Detta gör det möjligt för olika Python-implementationer att dela en enda kodbas för standardbiblioteket mycket lättare. I sitt initiala tillstånd innehåller ``sys.implementation`` endast en liten del av de implementationsspecifika data. Med tiden kommer detta förhållande att förändras för att göra standardbiblioteket mer portabelt.

source: One example of improved standard library portability is ``cache_tag``. As of Python 3.3, ``sys.implementation.cache_tag`` is used by :mod:`importlib` to support :pep:`3147` compliance. Any Python implementation that uses ``importlib`` for its built-in import system may use ``cache_tag`` to control the caching behavior for modules.
sv: Ett exempel på förbättrad standardbiblioteksportabilitet är ``cache_tag``. Från och med Python 3.3 används ``sys.implementation.cache_tag`` av :mod:`importlib` för att stödja :pep:`3147` efterlevnad. Alla Python-implementationer som använder ``importlib`` för sitt inbyggda importsystem kan använda ``cache_tag`` för att kontrollera cachelagringsbeteendet för moduler.

source: SimpleNamespace
sv: EnkeltNamnområde

source: The implementation of ``sys.implementation`` also introduces a new type to Python: :class:`types.SimpleNamespace`. In contrast to a mapping-based namespace, like :class:`dict`, ``SimpleNamespace`` is attribute-based, like :class:`object`. However, unlike ``object``, ``SimpleNamespace`` instances are writable. This means that you can add, remove, and modify the namespace through normal attribute access.
sv: Implementationen av ``sys.implementation`` introducerar också en ny typ i Python: :class:`types.SimpleNamespace`. I motsats till en mappningsbaserad namnrymd, som :class:`dict`, är ``SimpleNamespace`` attributbaserad, som :class:`object`. Men till skillnad från ``object`` är ``SimpleNamespace``-instanser skrivbara. Detta innebär att du kan lägga till, ta bort och ändra namnområdet genom normal attributåtkomst.

source: :pep:`421` - Adding sys.implementation
sv: :pep:`421` - Lägger till sys.implementation

source: PEP written and implemented by Eric Snow.
sv: PEP skrivet och implementerat av Eric Snow.

source: Using importlib as the Implementation of Import
sv: Använda importlib som implementering av import

source: :issue:`2377` - Replace __import__ w/ importlib.__import__ :issue:`13959` - Re-implement parts of :mod:`!imp` in pure Python :issue:`14605` - Make import machinery explicit :issue:`14646` - Require loaders set __loader__ and __package__
sv: :issue:`2377` - Ersätt __import__ med importlib.__import__ :issue:`13959` - Återimplementera delar av :mod:`!imp` i ren Python :issue:`14605` - Gör importmaskiner explicit :issue:`14646` - Kräv att laddare anger __loader__ och __package__

source: The :func:`__import__` function is now powered by :func:`importlib.__import__`. This work leads to the completion of "phase 2" of :pep:`302`. There are multiple benefits to this change. First, it has allowed for more of the machinery powering import to be exposed instead of being implicit and hidden within the C code. It also provides a single implementation for all Python VMs supporting Python 3.3 to use, helping to end any VM-specific deviations in import semantics. And finally it eases the maintenance of import, allowing for future growth to occur.
sv: Funktionen :func:`__import__` drivs nu av :func:`importlib.__import__`. Detta arbete leder till slutförandet av "fas 2" av :pep:`302`. Det finns flera fördelar med den här förändringen. För det första har det gjort det möjligt att exponera mer av maskineriet som driver import istället för att vara implicit och dolt i C-koden. Det ger också en enda implementering för alla Python VMs som stöder Python 3.3 att använda, vilket hjälper till att avsluta alla VM-specifika avvikelser i import semantik. Och slutligen underlättar det underhållet av import, vilket gör att framtida tillväxt kan ske.

source: For the common user, there should be no visible change in semantics. For those whose code currently manipulates import or calls import programmatically, the code changes that might possibly be required are covered in the `Porting Python code`_ section of this document.
sv: För den vanliga användaren bör det inte finnas någon synlig förändring i semantiken. För dem vars kod för närvarande manipulerar import eller anropar import programmatiskt, beskrivs de kodändringar som eventuellt kan krävas i avsnittet `Porting Python code`_ i detta dokument.

source: New APIs
sv: Nya API:er

source: One of the large benefits of this work is the exposure of what goes into making the import statement work. That means the various importers that were once implicit are now fully exposed as part of the :mod:`importlib` package.
sv: En av de stora fördelarna med detta arbete är exponeringen av vad som krävs för att importdeklarationen ska fungera. Det innebär att de olika importörer som en gång var implicita nu är helt exponerade som en del av :mod:`importlib`-paketet.

source: The abstract base classes defined in :mod:`importlib.abc` have been expanded to properly delineate between :term:`meta path finders <meta path finder>` and :term:`path entry finders <path entry finder>` by introducing :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder`, respectively. The old ABC of :class:`!importlib.abc.Finder` is now only provided for backwards-compatibility and does not enforce any method requirements.
sv: De abstrakta basklasserna som definieras i :mod:`importlib.abc` har utökats för att korrekt skilja mellan :term:`meta path finders <meta path finder>` och :term:`path entry finders <path entry finder>` genom att introducera :class:`importlib.abc.MetaPathFinder` respektive :class:`importlib.abc.PathEntryFinder`. Den gamla ABC:en :class:`!importlib.abc.Finder` finns nu bara för bakåtkompatibilitet och upprätthåller inga metodkrav.

source: In terms of finders, :class:`importlib.machinery.FileFinder` exposes the mechanism used to search for source and bytecode files of a module. Previously this class was an implicit member of :data:`sys.path_hooks`.
sv: När det gäller sökare visar :class:`importlib.machinery.FileFinder` den mekanism som används för att söka efter käll- och bytecode-filer för en modul. Tidigare var denna klass en implicit medlem av :data:`sys.path_hooks`.

source: For loaders, the new abstract base class :class:`importlib.abc.FileLoader` helps write a loader that uses the file system as the storage mechanism for a module's code. The loader for source files (:class:`importlib.machinery.SourceFileLoader`), sourceless bytecode files (:class:`importlib.machinery.SourcelessFileLoader`), and extension modules (:class:`importlib.machinery.ExtensionFileLoader`) are now available for direct use.
sv: För laddare hjälper den nya abstrakta basklassen :class:`importlib.abc.FileLoader` till att skriva en laddare som använder filsystemet som lagringsmekanism för en moduls kod. Laddaren för källfiler (:class:`importlib.machinery.SourceFileLoader`), sourceless bytecode-filer (:class:`importlib.machinery.SourcelessFileLoader`) och tilläggsmoduler (:class:`importlib.machinery.ExtensionFileLoader`) är nu tillgängliga för direkt användning.
