Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: The :mod:`dis` module is now built around an :class:`~dis.Instruction` class that provides object oriented access to the details of each individual bytecode operation.
sv: Modulen :mod:`dis` är nu uppbyggd kring en klass :class:`~dis.Instruction` som ger objektorienterad tillgång till detaljerna i varje enskild bytecode-operation.

source: A new method, :func:`~dis.get_instructions`, provides an iterator that emits the Instruction stream for a given piece of Python code. Thus it is now possible to write a program that inspects and manipulates a bytecode object in ways different from those provided by the :mod:`~dis` module itself. For example::
sv: En ny metod, :func:`~dis.get_instructions`, tillhandahåller en iterator som emitterar instruktionsflödet för en viss del av Python-koden. Det är alltså nu möjligt att skriva ett program som inspekterar och manipulerar ett bytecode-objekt på andra sätt än de som tillhandahålls av :mod:`~dis`-modulen själv. Till exempel::

source: The various display tools in the :mod:`dis` module have been rewritten to use these new components.
sv: De olika visningsverktygen i modulen :mod:`dis` har skrivits om för att använda dessa nya komponenter.

source: In addition, a new application-friendly class :class:`~dis.Bytecode` provides an object-oriented API for inspecting bytecode in both in human-readable form and for iterating over instructions. The :class:`~dis.Bytecode` constructor takes the same arguments that :func:`~dis.get_instruction` does (plus an optional *current_offset*), and the resulting object can be iterated to produce :class:`~dis.Instruction` objects. But it also has a :mod:`~dis.Bytecode.dis` method, equivalent to calling :mod:`~dis.dis` on the constructor argument, but returned as a multi-line string::
sv: Dessutom finns en ny applikationsvänlig klass :class:`~dis.Bytecode` som ger ett objektorienterat API för att inspektera bytecode i både läsbar form och för att iterera över instruktioner. Konstruktorn :class:`~dis.Bytecode` tar samma argument som :func:`~dis.get_instruction` gör (plus en valfri *current_offset*), och det resulterande objektet kan itereras för att producera :class:`~dis.Instruction`-objekt. Men den har också en :mod:`~dis.Bytecode.dis`-metod, som motsvarar anropet :mod:`~dis.dis` på konstruktörsargumentet, men returneras som en sträng med flera rader::

source: >>> bytecode = dis.Bytecode(lambda x: x + 1, current_offset=3) >>> for instr in bytecode: ... print('{} ({})'.format(instr.opname, instr.opcode)) LOAD_FAST (124) LOAD_CONST (100) BINARY_ADD (23) RETURN_VALUE (83) >>> bytecode.dis().splitlines() [' 1 0 LOAD_FAST 0 (x)', ' --> 3 LOAD_CONST 1 (1)', ' 6 BINARY_ADD', ' 7 RETURN_VALUE']
sv: >>> bytecode = dis.Bytecode(lambda x: x + 1, current_offset=3) >>> för instr i bytecode: ... print('{} ({})'.format(instr.opname, instr.opcode)) LOAD_FAST (124) LOAD_CONST (100) BINÄR_ADD (23) RETURN_VALUE (83) >>> bytecode.dis().splitlines() [' 1 0 LOAD_FAST 0 (x)', ' --> 3 LOAD_CONST 1 (1)', ' 6 BINÄR_ADD', ' 7 RETURN_VALUE']

source: :class:`~dis.Bytecode` also has a class method, :meth:`~dis.Bytecode.from_traceback`, that provides the ability to manipulate a traceback (that is, ``print(Bytecode.from_traceback(tb).dis())`` is equivalent to ``distb(tb)``).
sv: :class:`~dis.Bytecode` har också en klassmetod, :meth:`~dis.Bytecode.from_traceback`, som ger möjlighet att manipulera en traceback (det vill säga, ``print(Bytecode.from_traceback(tb).dis())`` är likvärdigt med ``distb(tb)``).

source: (Contributed by Nick Coghlan, Ryan Kelly and Thomas Kluyver in :issue:`11816` and Claudiu Popa in :issue:`17916`.)
sv: (Bidrag från Nick Coghlan, Ryan Kelly och Thomas Kluyver i :issue:`11816` och Claudiu Popa i :issue:`17916`.)

source: New function :func:`~dis.stack_effect` computes the effect on the Python stack of a given opcode and argument, information that is not otherwise available. (Contributed by Larry Hastings in :issue:`19722`.)
sv: Ny funktion :func:`~dis.stack_effect` beräknar effekten på Python-stacken av en given opcode och argument, information som inte är tillgänglig på annat sätt. (Bidrag från Larry Hastings i :issue:`19722`.)

source: doctest
sv: doktest

source: A new :ref:`option flag <doctest-options>`, :const:`~doctest.FAIL_FAST`, halts test running as soon as the first failure is detected. (Contributed by R. David Murray and Daniel Urban in :issue:`16522`.)
sv: En ny :ref:`alternativflagga <doctest-options>`, :const:`~doctest.FAIL_FAST`, stoppar testkörningen så snart det första felet upptäcks. (Bidrag från R. David Murray och Daniel Urban i :issue:`16522`.)

source: The :mod:`doctest` command line interface now uses :mod:`argparse`, and has two new options, ``-o`` and ``-f``. ``-o`` allows :ref:`doctest options <doctest-options>` to be specified on the command line, and ``-f`` is a shorthand for ``-o FAIL_FAST`` (to parallel the similar option supported by the :mod:`unittest` CLI). (Contributed by R. David Murray in :issue:`11390`.)
sv: Kommandoradsgränssnittet :mod:`doctest` använder nu :mod:`argparse` och har två nya alternativ, ``-o`` och ``-f``. med ``-o`` kan :ref:`doctest options <doctest-options>` anges på kommandoraden, och ``-f`` är en förkortning för ``-o FAIL_FAST`` (för att motsvara det liknande alternativ som stöds av :mod:`unittest` CLI). (Bidrag från R. David Murray i :issue:`11390`.)

source: :mod:`doctest` will now find doctests in extension module ``__doc__`` strings. (Contributed by Zachary Ware in :issue:`3158`.)
sv: :mod:`doctest` kommer nu att hitta doctests i tilläggsmodulen ``__doc__`` strängar. (Bidrag från Zachary Ware i :issue:`3158`.)

source: email
sv: e-post

source: :meth:`~email.message.Message.as_string` now accepts a *policy* argument to override the default policy of the message when generating a string representation of it. This means that ``as_string`` can now be used in more circumstances, instead of having to create and use a :mod:`~email.generator` in order to pass formatting parameters to its ``flatten`` method. (Contributed by R. David Murray in :issue:`18600`.)
sv: :meth:`~email.message.Message.as_string` accepterar nu ett *policy*-argument för att åsidosätta standardpolicyn för meddelandet när en strängrepresentation av det genereras. Detta innebär att ``as_string`` nu kan användas under fler omständigheter, istället för att behöva skapa och använda en :mod:`~email.generator` för att skicka formateringsparametrar till dess ``flatten``-metod. (Bidrag från R. David Murray i :issue:`18600`.)

source: New method :meth:`~email.message.Message.as_bytes` added to produce a bytes representation of the message in a fashion similar to how ``as_string`` produces a string representation. It does not accept the *maxheaderlen* argument, but does accept the *unixfrom* and *policy* arguments. The :class:`~email.message.Message` :meth:`~email.message.Message.__bytes__` method calls it, meaning that ``bytes(mymsg)`` will now produce the intuitive result: a bytes object containing the fully formatted message. (Contributed by R. David Murray in :issue:`18600`.)
sv: Ny metod :meth:`~email.message.Message.as_bytes` tillagd för att producera en bytesrepresentation av meddelandet på ett sätt som liknar hur ``as_string`` producerar en strängrepresentation. Den accepterar inte *maxheaderlen*-argumentet, men däremot *unixfrom*- och *policy*-argumenten. Metoden :class:`~email.message.Message` :meth:`~email.message.Message.__bytes__` anropar den, vilket innebär att ``bytes(mymsg)`` nu kommer att ge det intuitiva resultatet: ett bytesobjekt som innehåller det fullständigt formaterade meddelandet. (Bidrag från R. David Murray i :issue:`18600`.)

source: The :meth:`.Message.set_param` message now accepts a *replace* keyword argument. When specified, the associated header will be updated without changing its location in the list of headers. For backward compatibility, the default is ``False``. (Contributed by R. David Murray in :issue:`18891`.)
sv: Meddelandet :meth:`.Message.set_param` accepterar nu ett *replace* nyckelordsargument. När det anges kommer den associerade rubriken att uppdateras utan att ändra dess plats i listan över rubriker. För bakåtkompatibilitet är standardinställningen ``False``. (Bidrag från R. David Murray i :issue:`18891`.)

source: A pair of new subclasses of :class:`~email.message.Message` have been added (:class:`.EmailMessage` and :class:`.MIMEPart`), along with a new sub-module, :mod:`~email.contentmanager` and a new :mod:`~email.policy` attribute :attr:`~email.policy.EmailPolicy.content_manager`. All documentation is currently in the new module, which is being added as part of email's new :term:`provisional API`. These classes provide a number of new methods that make extracting content from and inserting content into email messages much easier. For details, see the :mod:`~email.contentmanager` documentation and the :ref:`email-examples`. These API additions complete the bulk of the work that was planned as part of the email6 project. The currently provisional API is scheduled to become final in Python 3.5 (possibly with a few minor additions in the area of error handling). (Contributed by R. David Murray in :issue:`18891`.)
sv: Ett par nya underklasser till :class:`~email.message.Message` har lagts till (:class:`.EmailMessage` och :class:`.MIMEPart`), tillsammans med en ny undermodul, :mod:`~email.contentmanager` och ett nytt :mod:`~email.policy`-attribut :attr:`~email.policy.EmailPolicy.content_manager`. All dokumentation finns för närvarande i den nya modulen, som läggs till som en del av email:s nya :term:`provisional API`. Dessa klasser tillhandahåller ett antal nya metoder som gör det mycket enklare att extrahera innehåll från och infoga innehåll i e-postmeddelanden. För detaljer, se :mod:`~email.contentmanager` dokumentation och :ref:`email-examples`. Dessa API-tillägg fullbordar huvuddelen av det arbete som planerades som en del av email6-projektet. Det nuvarande provisoriska API:et är planerat att bli slutgiltigt i Python 3.5 (eventuellt med några mindre tillägg inom området felhantering). (Bidrag från R. David Murray i :issue:`18891`.)

source: A new :func:`~filecmp.clear_cache` function provides the ability to clear the :mod:`filecmp` comparison cache, which uses :func:`os.stat` information to determine if the file has changed since the last compare. This can be used, for example, if the file might have been changed and re-checked in less time than the resolution of a particular filesystem's file modification time field. (Contributed by Mark Levitt in :issue:`18149`.)
sv: En ny :func:`~filecmp.clear_cache`-funktion gör det möjligt att rensa :mod:`filecmp`-jämförelsecachen, som använder :func:`os.stat`-information för att avgöra om filen har ändrats sedan den senaste jämförelsen. Detta kan till exempel användas om filen kan ha ändrats och kontrollerats igen på kortare tid än upplösningen av ett visst filsystems fält för filändringstid. (Bidrag från Mark Levitt i :issue:`18149`.)

source: New module attribute :const:`~filecmp.DEFAULT_IGNORES` provides the list of directories that are used as the default value for the *ignore* parameter of the :func:`~filecmp.dircmp` function. (Contributed by Eli Bendersky in :issue:`15442`.)
sv: Det nya modulattributet :const:`~filecmp.DEFAULT_IGNORES` innehåller en lista över kataloger som används som standardvärde för parametern *ignore* i funktionen :func:`~filecmp.dircmp`. (Bidrag från Eli Bendersky i :issue:`15442`.)

source: The new :func:`~functools.partialmethod` descriptor brings partial argument application to descriptors, just as :func:`~functools.partial` provides for normal callables. The new descriptor also makes it easier to get arbitrary callables (including :func:`~functools.partial` instances) to behave like normal instance methods when included in a class definition. (Contributed by Alon Horev and Nick Coghlan in :issue:`4331`.)
sv: Den nya deskriptorn :func:`~functools.partialmethod` gör det möjligt att använda partiella argument i deskriptorer, precis som :func:`~functools.partial` gör för vanliga anropsbara metoder. Den nya deskriptorn gör det också lättare att få godtyckliga anropbara metoder (inklusive :func:`~functools.partial`-instanser) att bete sig som normala instansmetoder när de ingår i en klassdefinition. (Bidrag från Alon Horev och Nick Coghlan i :issue:`4331`.)

source: The new :func:`~functools.singledispatch` decorator brings support for single-dispatch generic functions to the Python standard library. Where object oriented programming focuses on grouping multiple operations on a common set of data into a class, a generic function focuses on grouping multiple implementations of an operation that allows it to work with *different* kinds of data.
sv: Den nya :func:`~functools.singledispatch`-dekoratorn ger stöd för generiska funktioner med enkel distribution till Pythons standardbibliotek. Där objektorienterad programmering fokuserar på att gruppera flera operationer på en gemensam uppsättning data i en klass, fokuserar en generisk funktion på att gruppera flera implementeringar av en operation som gör att den kan arbeta med *olika* typer av data.

source: :pep:`443` -- Single-dispatch generic functions
sv: :pep:`443` -- Generiska funktioner för enstaka leverans

source: PEP written and implemented by Łukasz Langa.
sv: PEP skrivet och genomfört av Łukasz Langa.

source: :func:`~functools.total_ordering` now supports a return value of :data:`NotImplemented` from the underlying comparison function. (Contributed by Katie Miller in :issue:`10042`.)
sv: :func:`~functools.total_ordering` stöder nu ett returvärde av :data:`NotImplemented` från den underliggande jämförelsefunktionen. (Bidrag från Katie Miller i :issue:`10042`.)

source: A pure-python version of the :func:`~functools.partial` function is now in the stdlib; in CPython it is overridden by the C accelerated version, but it is available for other implementations to use. (Contributed by Brian Thorne in :issue:`12428`.)
sv: En ren Python-version av :func:`~functools.partial`-funktionen finns nu i stdlib; i CPython åsidosätts den av den C-accelererade versionen, men den är tillgänglig för andra implementationer att använda. (Bidrag från Brian Thorne i :issue:`12428`.)

source: New function :func:`~gc.get_stats` returns a list of three per-generation dictionaries containing the collections statistics since interpreter startup. (Contributed by Antoine Pitrou in :issue:`16351`.)
sv: Den nya funktionen :func:`~gc.get_stats` returnerar en lista med tre lexikon per generation som innehåller statistik över samlingar sedan tolken startades. (Bidrag från Antoine Pitrou i :issue:`16351`.)

source: glob
sv: klot

source: A new function :func:`~glob.escape` provides a way to escape special characters in a filename so that they do not become part of the globbing expansion but are instead matched literally. (Contributed by Serhiy Storchaka in :issue:`8402`.)
sv: En ny funktion :func:`~glob.escape` ger ett sätt att undkomma specialtecken i ett filnamn så att de inte blir en del av globbing-expansionen utan istället matchas bokstavligen. (Bidrag från Serhiy Storchaka i :issue:`8402`.)

source: A new :func:`hashlib.pbkdf2_hmac` function provides the `PKCS#5 password-based key derivation function 2 <https://en.wikipedia.org/wiki/PBKDF2>`_. (Contributed by Christian Heimes in :issue:`18582`.)
sv: En ny :func:`hashlib.pbkdf2_hmac`-funktion tillhandahåller `PKCS#5 lösenordsbaserad nyckeldrivningsfunktion 2 <https://en.wikipedia.org/wiki/PBKDF2>`_. (Bidrag från Christian Heimes i :issue:`18582`.)

source: The :attr:`~hashlib.hash.name` attribute of :mod:`hashlib` hash objects is now a formally supported interface. It has always existed in CPython's :mod:`hashlib` (although it did not return lower case names for all supported hashes), but it was not a public interface and so some other Python implementations have not previously supported it. (Contributed by Jason R. Coombs in :issue:`18532`.)
sv: Attributet :attr:`~hashlib.hash.name` för :mod:`hashlib`-hashobjekt är nu ett gränssnitt som stöds formellt. Det har alltid funnits i CPythons :mod:`hashlib` (även om det inte returnerade gemena namn för alla hashar som stöds), men det var inte ett offentligt gränssnitt och därför har vissa andra Python-implementationer inte tidigare stött det. (Bidrag från Jason R. Coombs i :issue:`18532`.)

source: :mod:`hmac` now accepts ``bytearray`` as well as ``bytes`` for the *key* argument to the :func:`~hmac.new` function, and the *msg* parameter to both the :func:`~hmac.new` function and the :meth:`~hmac.HMAC.update` method now accepts any type supported by the :mod:`hashlib` module. (Contributed by Jonas Borgström in :issue:`18240`.)
sv: :mod:`hmac` accepterar nu ``bytearray`` såväl som ``bytes`` för argumentet *key* till funktionen :func:`~hmac.new`, och parametern *msg* till både funktionen :func:`~hmac.new` och metoden :meth:`~hmac.HMAC.update` accepterar nu alla typer som stöds av modulen :mod:`hashlib`. (Bidrag från Jonas Borgström i :issue:`18240`.)

source: The *digestmod* argument to the :func:`hmac.new` function may now be any hash digest name recognized by :mod:`hashlib`. In addition, the current behavior in which the value of *digestmod* defaults to ``MD5`` is deprecated: in a future version of Python there will be no default value. (Contributed by Christian Heimes in :issue:`17276`.)
sv: Argumentet *digestmod* till funktionen :func:`hmac.new` kan nu vara vilket hash digest-namn som helst som känns igen av :mod:`hashlib`. Dessutom är det nuvarande beteendet där värdet på *digestmod* är standardvärdet ``MD5`` föråldrat: i en framtida version av Python kommer det inte att finnas något standardvärde. (Bidrag från Christian Heimes i :issue:`17276`.)

source: With the addition of :attr:`~hmac.HMAC.block_size` and :attr:`~hmac.HMAC.name` attributes (and the formal documentation of the :attr:`~hmac.HMAC.digest_size` attribute), the :mod:`hmac` module now conforms fully to the :pep:`247` API. (Contributed by Christian Heimes in :issue:`18775`.)
sv: Med tillägget av attributen :attr:`~hmac.HMAC.block_size` och :attr:`~hmac.HMAC.name` (och den formella dokumentationen av attributet :attr:`~hmac.HMAC.digest_size`), överensstämmer nu modulen :mod:`hmac` helt med API:t :pep:`247`. (Bidrag från Christian Heimes i :issue:`18775`.)

source: New function :func:`~html.unescape` function converts HTML5 character references to the corresponding Unicode characters. (Contributed by Ezio Melotti in :issue:`2927`.)
sv: Ny funktion :func:`~html.unescape` konverterar HTML5-teckenreferenser till motsvarande Unicode-tecken. (Bidrag från Ezio Melotti i :issue:`2927`.)

source: :class:`~html.parser.HTMLParser` accepts a new keyword argument *convert_charrefs* that, when ``True``, automatically converts all character references. For backward-compatibility, its value defaults to ``False``, but it will change to ``True`` in a future version of Python, so you are invited to set it explicitly and update your code to use this new feature. (Contributed by Ezio Melotti in :issue:`13633`.)
sv: :class:`~html.parser.HTMLParser` accepterar ett nytt nyckelordsargument *convert_charrefs* som, när det är ``True``, automatiskt konverterar alla teckenreferenser. För bakåtkompatibilitet är dess värde som standard ``False``, men det kommer att ändras till ``True`` i en framtida version av Python, så du uppmanas att ställa in det uttryckligen och uppdatera din kod för att använda den här nya funktionen. (Bidrag från Ezio Melotti i :issue:`13633`.)

source: The *strict* argument of :class:`~html.parser.HTMLParser` is now deprecated. (Contributed by Ezio Melotti in :issue:`15114`.)
sv: Argumentet *strict* i :class:`~html.parser.HTMLParser` är nu föråldrat. (Bidrag från Ezio Melotti i :issue:`15114`.)

source: :meth:`~http.server.BaseHTTPRequestHandler.send_error` now accepts an optional additional *explain* parameter which can be used to provide an extended error description, overriding the hardcoded default if there is one. This extended error description will be formatted using the :attr:`~http.server.HTTP.error_message_format` attribute and sent as the body of the error response. (Contributed by Karl Cow in :issue:`12921`.)
sv: :meth:`~http.server.BaseHTTPRequestHandler.send_error` accepterar nu en valfri ytterligare *explain* parameter som kan användas för att ge en utökad felbeskrivning, som åsidosätter den hårdkodade standardbeskrivningen om det finns en sådan. Denna utökade felbeskrivning formateras med hjälp av attributet :attr:`~http.server.HTTP.error_message_format` och skickas som brödtext i felsvaret. (Bidrag från Karl Cow i :issue:`12921`.)

source: The :mod:`http.server` :ref:`command line interface <http-server-cli>` now has a ``-b/--bind`` option that causes the server to listen on a specific address. (Contributed by Malte Swart in :issue:`17764`.)
sv: :mod:`http.server` :ref:``kommandoradsgränssnitt <http-server-cli>`` har nu ett ``-b/--bind``-alternativ som gör att servern lyssnar på en specifik adress. (Bidrag från Malte Swart i :issue:`17764`.)

source: idlelib and IDLE
sv: idlelib och IDLE

source: Since idlelib implements the IDLE shell and editor and is not intended for import by other programs, it gets improvements with every release. See :file:`Lib/idlelib/NEWS.txt` for a cumulative list of changes since 3.3.0, as well as changes made in future 3.4.x releases. This file is also available from the IDLE :menuselection:`Help --> About IDLE` dialog.
sv: Eftersom idlelib implementerar IDLE:s skal och redigerare och inte är avsett att importeras av andra program, förbättras det för varje utgåva. Se :file:`Lib/idlelib/NEWS.txt` för en kumulativ lista över ändringar sedan 3.3.0, samt ändringar som görs i framtida 3.4.x utgåvor. Denna fil är också tillgänglig från IDLE:s :menuselection:`Hjälp --> Om IDLE` dialogruta.

source: The :class:`~importlib.abc.InspectLoader` ABC defines a new method, :meth:`~importlib.abc.InspectLoader.source_to_code` that accepts source data and a path and returns a code object. The default implementation is equivalent to ``compile(data, path, 'exec', dont_inherit=True)``. (Contributed by Eric Snow and Brett Cannon in :issue:`15627`.)
sv: ABC:s :class:`~importlib.abc.InspectLoader` definierar en ny metod, :meth:`~importlib.abc.InspectLoader.source_to_code` som accepterar källdata och en sökväg och returnerar ett kodobjekt. Standardimplementeringen är likvärdig med ``compile(data, path, 'exec', dont_inherit=True)``. (Bidrag från Eric Snow och Brett Cannon i :issue:`15627`.)

source: :class:`~importlib.abc.InspectLoader` also now has a default implementation for the :meth:`~importlib.abc.InspectLoader.get_code` method. However, it will normally be desirable to override the default implementation for performance reasons. (Contributed by Brett Cannon in :issue:`18072`.)
sv: :class:`~importlib.abc.InspectLoader` har nu också en standardimplementation för metoden :meth:`~importlib.abc.InspectLoader.get_code`. Det kommer dock normalt att vara önskvärt att åsidosätta standardimplementationen av prestandaskäl. (Bidrag från Brett Cannon i :issue:`18072`.)

source: The :func:`~importlib.reload` function has been moved from :mod:`!imp` to :mod:`importlib` as part of the :mod:`!imp` module deprecation. (Contributed by Berker Peksag in :issue:`18193`.)
sv: Funktionen :func:`~importlib.reload` har flyttats från :mod:`!imp` till :mod:`importlib` som en del av :mod:`!imp` modulen deprecation. (Bidrag från Berker Peksag i :issue:`18193`.)
