Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: :pep:`456` follows up on earlier security fix work done on Python's hash algorithm to address certain DOS attacks to which public facing APIs backed by dictionary lookups may be subject. (See :issue:`14621` for the start of the current round of improvements.) The PEP unifies CPython's hash code to make it easier for a packager to substitute a different hash algorithm, and switches Python's default implementation to a SipHash implementation on platforms that have a 64 bit data type. Any performance differences in comparison with the older FNV algorithm are trivial.
sv: :pep:`456` följer upp tidigare säkerhetsfixar som gjorts på Pythons hash-algoritm för att hantera vissa DOS-attacker som API:er som vänder sig till allmänheten och som stöds av ordboksuppslagningar kan utsättas för. (Se :issue:`14621` för starten av den aktuella förbättringsrundan.) PEP:n förenar CPythons hashkod för att göra det lättare för en pakettillverkare att ersätta en annan hashalgoritm, och byter Pythons standardimplementation till en SipHash-implementation på plattformar som har en 64-bitars datatyp. Eventuella prestandaskillnader i jämförelse med den äldre FNV-algoritmen är triviala.

source: The PEP adds additional fields to the :data:`sys.hash_info` named tuple to describe the hash algorithm in use by the currently executing binary. Otherwise, the PEP does not alter any existing CPython APIs.
sv: PEP:n lägger till ytterligare fält i :data:`sys.hash_info` named tuple för att beskriva den hashalgoritm som används av den binärfil som körs för tillfället. I övrigt ändrar PEP:n inte några befintliga CPython API:er.

source: PEP 436: Argument Clinic
sv: PEP 436: Argumentklinik

source: "Argument Clinic" (:pep:`436`) is now part of the CPython build process and can be used to simplify the process of defining and maintaining accurate signatures for builtins and standard library extension modules implemented in C.
sv: "Argument Clinic" (:pep:`436`) är nu en del av CPythons byggprocess och kan användas för att förenkla processen med att definiera och underhålla korrekta signaturer för builtins och standardbibliotekets tilläggsmoduler som implementeras i C.

source: Some standard library extension modules have been converted to use Argument Clinic in Python 3.4, and :mod:`pydoc` and :mod:`inspect` have been updated accordingly.
sv: Vissa tilläggsmoduler i standardbiblioteket har konverterats för att använda Argument Clinic i Python 3.4, och :mod:`pydoc` och :mod:`inspect` har uppdaterats i enlighet med detta.

source: It is expected that signature metadata for programmatic introspection will be added to additional callables implemented in C as part of Python 3.4 maintenance releases.
sv: Det förväntas att signaturmetadata för programmatisk introspektion kommer att läggas till ytterligare anropbara filer som implementeras i C som en del av Python 3.4 underhållsversioner.

source: The Argument Clinic PEP is not fully up to date with the state of the implementation. This has been deemed acceptable by the release manager and core development team in this case, as Argument Clinic will not be made available as a public API for third party use in Python 3.4.
sv: Argument Clinic PEP är inte helt uppdaterad med läget för implementationen. Detta har ansetts acceptabelt av release manager och core development team i det här fallet, eftersom Argument Clinic inte kommer att göras tillgängligt som ett offentligt API för tredjepartsbruk i Python 3.4.

source: :pep:`436` -- The Argument Clinic DSL
sv: :pep:`436` -- Argumentkliniken DSL

source: PEP written and implemented by Larry Hastings.
sv: PEP skrivet och implementerat av Larry Hastings.

source: Other Build and C API Changes
sv: Andra ändringar i Build och C API

source: The new :c:func:`PyType_GetSlot` function has been added to the stable ABI, allowing retrieval of function pointers from named type slots when using the limited API. (Contributed by Martin von Löwis in :issue:`17162`.)
sv: Den nya :c:func:`PyType_GetSlot`-funktionen har lagts till i det stabila ABI:t, vilket gör det möjligt att hämta funktionspekare från namngivna typslots när man använder det begränsade API:t. (Bidrag från Martin von Löwis i :issue:`17162`.)

source: The new :c:func:`!Py_SetStandardStreamEncoding` pre-initialization API allows applications embedding the CPython interpreter to reliably force a particular encoding and error handler for the standard streams. (Contributed by Bastien Montagne and Nick Coghlan in :issue:`16129`.)
sv: Det nya :c:func:`!Py_SetStandardStreamEncoding` förinitialiserings-API:et gör det möjligt för applikationer som bäddar in CPython-tolken att på ett tillförlitligt sätt tvinga fram en viss kodning och felhantering för standardströmmarna. (Bidrag från Bastien Montagne och Nick Coghlan i :issue:`16129`.)

source: Most Python C APIs that don't mutate string arguments are now correctly marked as accepting ``const char *`` rather than ``char *``. (Contributed by Serhiy Storchaka in :issue:`1772673`.)
sv: De flesta Python C API:er som inte muterar strängargument är nu korrekt markerade som att de accepterar ``const char *`` istället för ``char *``. (Bidrag från Serhiy Storchaka i :issue:`1772673`.)

source: A new shell version of ``python-config`` can be used even when a python interpreter is not available (for example, in cross compilation scenarios).
sv: En ny shell-version av ``python-config`` kan användas även när en python-tolk inte är tillgänglig (t.ex. i cross compilation-scenarier).

source: :c:func:`PyUnicode_FromFormat` now supports width and precision specifications for ``%s``, ``%A``, ``%U``, ``%V``, ``%S``, and ``%R``. (Contributed by Ysj Ray and Victor Stinner in :issue:`7330`.)
sv: :c:func:`PyUnicode_FromFormat` stöder nu bredd- och precisionsspecifikationer för ``%s``, ``%A``, ``%U``, ``%V``, ``%S`` och ``%R``. (Bidrag från Ysj Ray och Victor Stinner i :issue:`7330`.)

source: New function :c:func:`PyStructSequence_InitType2` supplements the existing :c:func:`PyStructSequence_InitType` function. The difference is that it returns ``0`` on success and ``-1`` on failure.
sv: Den nya funktionen :c:func:`PyStructSequence_InitType2` kompletterar den befintliga funktionen :c:func:`PyStructSequence_InitType`. Skillnaden är att den returnerar ``0`` vid framgång och ``-1`` vid misslyckande.

source: The CPython source can now be compiled using the address sanity checking features of recent versions of GCC and clang: the false alarms in the small object allocator have been silenced. (Contributed by Dhiru Kholia in :issue:`18596`.)
sv: CPython-källan kan nu kompileras med hjälp av funktionerna för kontroll av adresssäkerheten i de senaste versionerna av GCC och clang: de falska larmen i allokatorn för små objekt har tystnat. (Bidrag från Dhiru Kholia i :issue:`18596`.)

source: The Windows build now uses `Address Space Layout Randomization <https://en.wikipedia.org/wiki/Address_space_layout_randomization>`_ and `Data Execution Prevention <https://en.wikipedia.org/wiki/Data_Execution_Prevention>`_. (Contributed by Christian Heimes in :issue:`16632`.)
sv: Windows-versionen använder nu `Address Space Layout Randomization <https://en.wikipedia.org/wiki/Address_space_layout_randomization>`_ och `Data Execution Prevention <https://en.wikipedia.org/wiki/Data_Execution_Prevention>`_. (Bidrag från Christian Heimes i :issue:`16632`.)

source: New function :c:func:`PyObject_LengthHint` is the C API equivalent of :func:`operator.length_hint`. (Contributed by Armin Ronacher in :issue:`16148`.)
sv: Den nya funktionen :c:func:`PyObject_LengthHint` är C API-motsvarigheten till :func:`operator.length_hint`. (Bidrag från Armin Ronacher i :issue:`16148`.)

source: Other Improvements
sv: Övriga förbättringar

source: The :ref:`python <using-on-cmdline>` command has a new :ref:`option <using-on-misc-options>`, ``-I``, which causes it to run in "isolated mode", which means that :data:`sys.path` contains neither the script's directory nor the user's ``site-packages`` directory, and all :envvar:`!PYTHON*` environment variables are ignored (it implies both ``-s`` and ``-E``). Other restrictions may also be applied in the future, with the goal being to isolate the execution of a script from the user's environment. This is appropriate, for example, when Python is used to run a system script. On most POSIX systems it can and should be used in the ``#!`` line of system scripts. (Contributed by Christian Heimes in :issue:`16499`.)
sv: Kommandot :ref:`python <using-on-cmdline>` har ett nytt :ref:`option <using-on-misc-options>`, ``-I``, som gör att det körs i "isolerat läge", vilket innebär att :data:`sys.path` varken innehåller skriptets katalog eller användarens katalog ``site-packages``, och alla :envvar:`!PYTHON*` miljövariabler ignoreras (det innebär både ``-s`` och ``-E``). Andra begränsningar kan också komma att tillämpas i framtiden, med målet att isolera exekveringen av ett skript från användarens miljö. Detta är till exempel lämpligt när Python används för att köra ett systemskript. På de flesta POSIX-system kan och bör det användas i ``#!``-raden i systemskript. (Bidrag från Christian Heimes i :issue:`16499`.)

source: Tab-completion is now enabled by default in the interactive interpreter on systems that support :mod:`readline`. History is also enabled by default, and is written to (and read from) the file :file:`~/.python-history`. (Contributed by Antoine Pitrou and Éric Araujo in :issue:`5845`.)
sv: Tabbkomplettering är nu aktiverad som standard i den interaktiva tolken på system som stöder :mod:`readline`. Historik är också aktiverat som standard, och skrivs till (och läses från) filen :file:`~/.python-history`. (Bidrag från Antoine Pitrou och Éric Araujo i :issue:`5845`.)

source: Invoking the Python interpreter with ``--version`` now outputs the version to standard output instead of standard error (:issue:`18338`). Similar changes were made to :mod:`argparse` (:issue:`18920`) and other modules that have script-like invocation capabilities (:issue:`18922`).
sv: När Python-tolken anropas med ``--version`` skrivs nu versionen ut till standardutmatningen istället för standardfelet (:issue:`18338`). Liknande ändringar gjordes i :mod:`argparse` (:issue:`18920`) och andra moduler som har skriptliknande anropsfunktioner (:issue:`18922`).

source: The CPython Windows installer now adds ``.py`` to the :envvar:`PATHEXT` variable when extensions are registered, allowing users to run a python script at the windows command prompt by just typing its name without the ``.py`` extension. (Contributed by Paul Moore in :issue:`18569`.)
sv: Installationsprogrammet för CPython i Windows lägger nu till ``.py`` i variabeln :envvar:`PATHEXT`` när tillägg registreras, vilket gör att användare kan köra ett pythonskript i Windows kommandotolk genom att bara skriva dess namn utan tillägget ``.py``. (Bidrag från Paul Moore i :issue:`18569`.)

source: A new ``make`` target `coverage-report <https://devguide.python.org/coverage/#measuring-coverage-of-c-code-with-gcov-and-lcov>`_ will build python, run the test suite, and generate an HTML coverage report for the C codebase using ``gcov`` and `lcov <https://github.com/linux-test-project/lcov>`_.
sv: Ett nytt ``make``-mål `coverage-report <https://devguide.python.org/coverage/#measuring-coverage-of-c-code-with-gcov-and-lcov>`_ kommer att bygga python, köra testsviten och generera en HTML-täckningsrapport för C-kodbasen med hjälp av ``gcov`` och `lcov <https://github.com/linux-test-project/lcov>`_.

source: The ``-R`` option to the :ref:`python regression test suite <regrtest>` now also checks for memory allocation leaks, using :func:`sys.getallocatedblocks`. (Contributed by Antoine Pitrou in :issue:`13390`.)
sv: Alternativet ``-R`` till :ref:`python regression test suite <regrtest>`` kontrollerar nu även för minnesallokeringsläckor, med :func:`sys.getallocatedblocks`. (Bidrag från Antoine Pitrou i :issue:`13390`.)

source: ``python -m`` now works with namespace packages.
sv: ``python -m`` fungerar nu med namespace-paket.

source: The :mod:`stat` module is now implemented in C, which means it gets the values for its constants from the C header files, instead of having the values hard-coded in the python module as was previously the case.
sv: Modulen :mod:`stat` är nu implementerad i C, vilket innebär att den hämtar värdena för sina konstanter från C-headerfilerna, istället för att ha värdena hårdkodade i pythonmodulen som tidigare var fallet.

source: Loading multiple python modules from a single OS module (``.so``, ``.dll``) now works correctly (previously it silently returned the first python module in the file). (Contributed by Václav Šmilauer in :issue:`16421`.)
sv: Att ladda flera python-moduler från en enda OS-modul (``.so``, ``.dll``) fungerar nu korrekt (tidigare returnerades den första python-modulen i filen). (Bidrag från Václav Šmilauer i :issue:`16421`.)

source: A new opcode, :opcode:`!LOAD_CLASSDEREF`, has been added to fix a bug in the loading of free variables in class bodies that could be triggered by certain uses of :ref:`__prepare__ <prepare>`. (Contributed by Benjamin Peterson in :issue:`17853`.)
sv: En ny opcode, :opcode:`!LOAD_CLASSDEREF`, har lagts till för att åtgärda en bugg i laddningen av fria variabler i klasskroppar som kunde utlösas av vissa användningar av :ref:`__prepare__ <prepare>`. (Bidrag från Benjamin Peterson i :issue:`17853`.)

source: A number of MemoryError-related crashes were identified and fixed by Victor Stinner using his :pep:`445`-based ``pyfailmalloc`` tool (:issue:`18408`, :issue:`18520`).
sv: Ett antal MemoryError-relaterade krascher identifierades och åtgärdades av Victor Stinner med hjälp av hans :pep:`445`-baserade verktyg ``pyfailmalloc`` (:issue:`18408`, :issue:`18520`).

source: The ``pyvenv`` command now accepts a ``--copies`` option to use copies rather than symlinks even on systems where symlinks are the default. (Contributed by Vinay Sajip in :issue:`18807`.)
sv: Kommandot ``pyvenv`` accepterar nu alternativet ``--copies`` för att använda kopior i stället för symlänkar även på system där symlänkar är standard. (Bidrag från Vinay Sajip i :issue:`18807`.)

source: The ``pyvenv`` command also accepts a ``--without-pip`` option to suppress the otherwise-automatic bootstrapping of pip into the virtual environment. (Contributed by Nick Coghlan in :issue:`19552` as part of the :pep:`453` implementation.)
sv: Kommandot ``pyvenv`` accepterar också alternativet ``--without-pip`` för att undertrycka den annars automatiska uppstarten av pip i den virtuella miljön. (Bidrag från Nick Coghlan i :issue:`19552` som en del av implementeringen av :pep:`453`)

source: The encoding name is now optional in the value set for the :envvar:`PYTHONIOENCODING` environment variable. This makes it possible to set just the error handler, without changing the default encoding. (Contributed by Serhiy Storchaka in :issue:`18818`.)
sv: Kodningsnamnet är nu valfritt i värdeuppsättningen för miljövariabeln :envvar:`PYTHONIOENCODING`. Detta gör det möjligt att bara ställa in felhanteraren utan att ändra standardkodningen. (Bidrag från Serhiy Storchaka i :issue:`18818`.)

source: The :mod:`bz2`, :mod:`lzma`, and :mod:`gzip` module ``open`` functions now support ``x`` (exclusive creation) mode. (Contributed by Tim Heaney and Vajrasky Kok in :issue:`19201`, :issue:`19222`, and :issue:`19223`.)
sv: Modulfunktionerna :mod:`bz2`, :mod:`lzma` och :mod:`gzip` ``open`` stöder nu läget ``x`` (exklusivt skapande). (Bidrag från Tim Heaney och Vajrasky Kok i :issue:`19201`, :issue:`19222` och :issue:`19223`.)

source: Significant Optimizations
sv: Betydande optimeringar

source: The UTF-32 decoder is now 3x to 4x faster. (Contributed by Serhiy Storchaka in :issue:`14625`.)
sv: UTF-32-avkodaren är nu 3x till 4x snabbare. (Bidrag från Serhiy Storchaka i :issue:`14625`.)

source: The cost of hash collisions for sets is now reduced. Each hash table probe now checks a series of consecutive, adjacent key/hash pairs before continuing to make random probes through the hash table. This exploits cache locality to make collision resolution less expensive. The collision resolution scheme can be described as a hybrid of linear probing and open addressing. The number of additional linear probes defaults to nine. This can be changed at compile-time by defining LINEAR_PROBES to be any value. Set LINEAR_PROBES=0 to turn-off linear probing entirely. (Contributed by Raymond Hettinger in :issue:`18771`.)
sv: Kostnaden för hashkollisioner för set är nu reducerad. Varje hashtabellsprobe kontrollerar nu en serie på varandra följande, intilliggande nyckel/hash-par innan den fortsätter att göra slumpmässiga prober genom hashtabellen. Detta utnyttjar cache-lokalitet för att göra kollisionsupplösning billigare. Kollisionslösningsschemat kan beskrivas som en hybrid av linjär sondering och öppen adressering. Antalet ytterligare linjära sonderingar är som standard nio. Detta kan ändras vid kompilering genom att definiera LINEAR_PROBES till valfritt värde. Ställ in LINEAR_PROBES=0 för att stänga av linjär probning helt och hållet. (Bidrag från Raymond Hettinger i :issue:`18771`.)

source: The interpreter starts about 30% faster. A couple of measures lead to the speedup. The interpreter loads fewer modules on startup, e.g. the :mod:`re`, :mod:`collections` and :mod:`locale` modules and their dependencies are no longer imported by default. The marshal module has been improved to load compiled Python code faster. (Contributed by Antoine Pitrou, Christian Heimes and Victor Stinner in :issue:`19219`, :issue:`19218`, :issue:`19209`, :issue:`19205` and :issue:`9548`.)
sv: Tolken startar ungefär 30% faster. Ett par åtgärder leder till den ökade hastigheten. Tolken laddar färre moduler vid uppstart, t.ex. importeras inte längre modulerna :mod:`re`, :mod:`collections` och :mod:`locale` och deras beroenden som standard. Modulen marshal har förbättrats för att ladda kompilerad Python-kod snabbare. (Bidrag från Antoine Pitrou, Christian Heimes och Victor Stinner i :issue:`19219`, :issue:`19218`, :issue:`19209`, :issue:`19205` och :issue:`9548`.)

source: :class:`bz2.BZ2File` is now as fast or faster than the Python2 version for most cases. :class:`lzma.LZMAFile` has also been optimized. (Contributed by Serhiy Storchaka and Nadeem Vawda in :issue:`16034`.)
sv: :class:`bz2.BZ2File` är nu lika snabb eller snabbare än Python2-versionen i de flesta fall. :class:`lzma.LZMAFile` har också optimerats. (Bidrag från Serhiy Storchaka och Nadeem Vawda i :issue:`16034`.)

source: :func:`random.getrandbits` is 20%-40% faster for small integers (the most common use case). (Contributed by Serhiy Storchaka in :issue:`16674`.)
sv: :func:`random.getrandbits` är 20%-40% snabbare för små heltal (det vanligaste användningsfallet). (Bidrag från Serhiy Storchaka i :issue:`16674`.)

source: By taking advantage of the new storage format for strings, pickling of strings is now significantly faster. (Contributed by Victor Stinner and Antoine Pitrou in :issue:`15596`.)
sv: Genom att dra nytta av det nya lagringsformatet för strängar är betning av strängar nu betydligt snabbare. (Bidrag från Victor Stinner och Antoine Pitrou i :issue:`15596`.)

source: A performance issue in :meth:`io.FileIO.readall` has been solved. This particularly affects Windows, and significantly speeds up the case of piping significant amounts of data through :mod:`subprocess`. (Contributed by Richard Oudkerk in :issue:`15758`.)
sv: Ett prestandaproblem i :meth:`io.FileIO.readall` har lösts. Detta påverkar särskilt Windows, och snabbar upp fallet med piping av betydande mängder data genom :mod:`subprocess`. (Bidrag från Richard Oudkerk i :issue:`15758`.)

source: :func:`html.escape` is now 10x faster. (Contributed by Matt Bryant in :issue:`18020`.)
sv: :func:`html.escape` är nu 10x snabbare. (Bidrag från Matt Bryant i :issue:`18020`.)

source: On Windows, the native ``VirtualAlloc`` is now used instead of the CRT ``malloc`` in ``obmalloc``. Artificial benchmarks show about a 3% memory savings.
sv: I Windows används nu den inbyggda ``VirtualAlloc`` istället för CRT ``malloc`` i ``obmalloc``. Artificiella benchmarks visar på en minnesbesparing på ca 3%.

source: :func:`os.urandom` now uses a lazily opened persistent file descriptor so as to avoid using many file descriptors when run in parallel from multiple threads. (Contributed by Antoine Pitrou in :issue:`18756`.)
sv: :func:`os.urandom` använder nu en latent öppnad persistent filbeskrivare för att undvika att använda många filbeskrivare när den körs parallellt från flera trådar. (Bidrag från Antoine Pitrou i :issue:`18756`.)

source: Deprecated
sv: Föråldrat

source: This section covers various APIs and other features that have been deprecated in Python 3.4, and will be removed in Python 3.5 or later. In most (but not all) cases, using the deprecated APIs will produce a :exc:`DeprecationWarning` when the interpreter is run with deprecation warnings enabled (for example, by using ``-Wd``).
sv: Detta avsnitt täcker olika API:er och andra funktioner som har utgått i Python 3.4 och som kommer att tas bort i Python 3.5 eller senare. I de flesta (men inte alla) fall kommer användningen av de föråldrade API:erna att producera en :exc:`DeprecationWarning` när tolken körs med deprecation-varningar aktiverade (till exempel genom att använda ``-Wd``).

source: Deprecations in the Python API
sv: Avvecklingar i Python API
