Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: :mod:`importlib.util` now has a :const:`~importlib.util.MAGIC_NUMBER` attribute providing access to the bytecode version number. This replaces the :func:`!get_magic` function in the deprecated :mod:`!imp` module. (Contributed by Brett Cannon in :issue:`18192`.)
sv: :mod:`importlib.util` har nu ett :const:`~importlib.util.MAGIC_NUMBER`-attribut som ger tillgång till bytekodsversionsnumret. Detta ersätter funktionen :func:`!get_magic` i den utfasade modulen :mod:`!imp`. (Bidrag från Brett Cannon i :issue:`18192`.)

source: New :mod:`importlib.util` functions :func:`~importlib.util.cache_from_source` and :func:`~importlib.util.source_from_cache` replace the same-named functions in the deprecated :mod:`!imp` module. (Contributed by Brett Cannon in :issue:`18194`.)
sv: De nya funktionerna :mod:`importlib.util` :func:`~importlib.util.cache_from_source` och :func:`~importlib.util.source_from_cache` ersätter funktionerna med samma namn i den föråldrade modulen :mod:`!imp`. (Bidrag från Brett Cannon i :issue:`18194`.)

source: The :mod:`importlib` bootstrap :class:`.NamespaceLoader` now conforms to the :class:`.InspectLoader` ABC, which means that ``runpy`` and ``python -m`` can now be used with namespace packages. (Contributed by Brett Cannon in :issue:`18058`.)
sv: :mod:`importlib` bootstrap :class:`.NamespaceLoader` överensstämmer nu med :class:`.InspectLoader` ABC, vilket innebär att ``runpy`` och ``python -m`` nu kan användas med namespace-paket. (Bidrag från Brett Cannon i :issue:`18058`.)

source: :mod:`importlib.util` has a new function :func:`~importlib.util.decode_source` that decodes source from bytes using universal newline processing. This is useful for implementing :meth:`.InspectLoader.get_source` methods.
sv: :mod:`importlib.util` har en ny funktion :func:`~importlib.util.decode_source` som avkodar källkod från bytes med hjälp av universal newline processing. Detta är användbart för att implementera :meth:`.InspectLoader.get_source`-metoder.

source: :class:`importlib.machinery.ExtensionFileLoader` now has a :meth:`~importlib.machinery.ExtensionFileLoader.get_filename` method. This was inadvertently omitted in the original implementation. (Contributed by Eric Snow in :issue:`19152`.)
sv: :class:`importlib.machinery.ExtensionFileLoader` har nu en :meth:`~importlib.machinery.ExtensionFileLoader.get_filename`-metod. Detta utelämnades oavsiktligt i den ursprungliga implementationen. (Bidrag från Eric Snow i :issue:`19152`.)

source: inspect
sv: inspektera

source: The :mod:`inspect` module now offers a basic :ref:`command line interface <inspect-module-cli>` to quickly display source code and other information for modules, classes and functions. (Contributed by Claudiu Popa and Nick Coghlan in :issue:`18626`.)
sv: Modulen :mod:`inspect` erbjuder nu ett grundläggande :ref:`kommandoradsgränssnitt <inspect-module-cli>` för att snabbt visa källkod och annan information för moduler, klasser och funktioner. (Bidrag från Claudiu Popa och Nick Coghlan i :issue:`18626`.)

source: :func:`~inspect.unwrap` makes it easy to unravel wrapper function chains created by :func:`functools.wraps` (and any other API that sets the ``__wrapped__`` attribute on a wrapper function). (Contributed by Daniel Urban, Aaron Iles and Nick Coghlan in :issue:`13266`.)
sv: :func:`~inspect.unwrap` gör det enkelt att lösa upp kedjor av omslagsfunktioner som skapats av :func:`functools.wraps` (och alla andra API:er som sätter attributet ``__wrapped__`` på en omslagsfunktion). (Bidrag från Daniel Urban, Aaron Iles och Nick Coghlan i :issue:`13266`.)

source: As part of the implementation of the new :mod:`enum` module, the :mod:`inspect` module now has substantially better support for custom ``__dir__`` methods and dynamic class attributes provided through metaclasses. (Contributed by Ethan Furman in :issue:`18929` and :issue:`19030`.)
sv: Som en del av implementeringen av den nya modulen :mod:`enum` har modulen :mod:`inspect` nu betydligt bättre stöd för anpassade ``__dir__``-metoder och dynamiska klassattribut som tillhandahålls genom metaklasser. (Bidrag från Ethan Furman i :issue:`18929` och :issue:`19030`.)

source: :func:`~inspect.getfullargspec` and :func:`~inspect.getargspec` now use the :func:`~inspect.signature` API. This allows them to support a much broader range of callables, including those with ``__signature__`` attributes, those with metadata provided by argument clinic, :func:`functools.partial` objects and more. Note that, unlike :func:`~inspect.signature`, these functions still ignore ``__wrapped__`` attributes, and report the already bound first argument for bound methods, so it is still necessary to update your code to use :func:`~inspect.signature` directly if those features are desired. (Contributed by Yury Selivanov in :issue:`17481`.)
sv: :func:`~inspect.getfullargspec` och :func:`~inspect.getargspec` använder nu API:t :func:`~inspect.signature`. Detta gör att de kan stödja ett mycket bredare utbud av anropbara objekt, inklusive de med ``__signature__``-attribut, de med metadata som tillhandahålls av argumentklinik, :func:`functools.partial`-objekt med mera. Observera att till skillnad från :func:`~inspect.signature` ignorerar dessa funktioner fortfarande ``__wrapped__``-attribut och rapporterar det redan bundna första argumentet för bundna metoder, så det är fortfarande nödvändigt att uppdatera din kod för att använda :func:`~inspect.signature` direkt om dessa funktioner önskas. (Bidrag från Yury Selivanov i :issue:`17481`.)

source: :func:`~inspect.signature` now supports duck types of CPython functions, which adds support for functions compiled with Cython. (Contributed by Stefan Behnel and Yury Selivanov in :issue:`17159`.)
sv: :func:`~inspect.signature` har nu stöd för CPython-funktioner av typen duck, vilket ger stöd för funktioner kompilerade med Cython. (Bidrag från Stefan Behnel och Yury Selivanov i :issue:`17159`.)

source: ipaddress
sv: ipadress

source: :mod:`ipaddress` was added to the standard library in Python 3.3 as a :term:`provisional API`. With the release of Python 3.4, this qualification has been removed: :mod:`ipaddress` is now considered a stable API, covered by the normal standard library requirements to maintain backwards compatibility.
sv: :mod:`ipaddress` lades till i standardbiblioteket i Python 3.3 som ett :term:`provisoriskt API`. Med lanseringen av Python 3.4 har denna kvalifikation tagits bort: :mod:`ipaddress` betraktas nu som ett stabilt API, som omfattas av de normala kraven för standardbiblioteket för att upprätthålla bakåtkompatibilitet.

source: A new :attr:`~ipaddress.IPv4Address.is_global` property is ``True`` if an address is globally routeable. (Contributed by Peter Moody in :issue:`17400`.)
sv: En ny :attr:`~ipaddress.IPv4Address.is_global` egenskap är ``True`` om en adress är globalt dirigerbar. (Bidrag från Peter Moody i :issue:`17400`.)

source: logging
sv: loggning

source: The :class:`~logging.handlers.TimedRotatingFileHandler` has a new *atTime* parameter that can be used to specify the time of day when rollover should happen. (Contributed by Ronald Oussoren in :issue:`9556`.)
sv: :class:`~logging.handlers.TimedRotatingFileHandler` har en ny *atTime* parameter som kan användas för att ange när på dygnet rollover ska ske. (Bidrag från Ronald Oussoren i :issue:`9556`.)

source: :class:`~logging.handlers.SocketHandler` and :class:`~logging.handlers.DatagramHandler` now support Unix domain sockets (by setting *port* to ``None``). (Contributed by Vinay Sajip in commit ce46195b56a9.)
sv: :class:`~logging.handlers.SocketHandler` och :class:`~logging.handlers.DatagramHandler` har nu stöd för Unix domänuttag (genom att sätta *port* till ``None``). (Bidrag från Vinay Sajip i commit ce46195b56a9.)

source: :func:`~logging.config.fileConfig` now accepts a :class:`configparser.RawConfigParser` subclass instance for the *fname* parameter. This facilitates using a configuration file when logging configuration is just a part of the overall application configuration, or where the application modifies the configuration before passing it to :func:`~logging.config.fileConfig`. (Contributed by Vinay Sajip in :issue:`16110`.)
sv: :func:`~logging.config.fileConfig` accepterar nu en underklassinstans av :class:`configparser.RawConfigParser` för parametern *fname*. Detta gör det lättare att använda en konfigurationsfil när loggningskonfigurationen bara är en del av den övergripande programkonfigurationen, eller när programmet ändrar konfigurationen innan den skickas till :func:`~logging.config.fileConfig`. (Bidrag från Vinay Sajip i :issue:`16110`.)

source: Logging configuration data received from a socket via the :func:`logging.config.listen` function can now be validated before being processed by supplying a verification function as the argument to the new *verify* keyword argument. (Contributed by Vinay Sajip in :issue:`15452`.)
sv: Loggningskonfigurationsdata som tas emot från en socket via funktionen :func:`logging.config.listen` kan nu valideras innan de bearbetas genom att ange en verifieringsfunktion som argument till det nya nyckelordsargumentet *verify*. (Bidrag från Vinay Sajip i :issue:`15452`.)

source: marshal
sv: sheriff

source: The default :mod:`marshal` version has been bumped to 3. The code implementing the new version restores the Python2 behavior of recording only one copy of interned strings and preserving the interning on deserialization, and extends this "one copy" ability to any object type (including handling recursive references). This reduces both the size of ``.pyc`` files and the amount of memory a module occupies in memory when it is loaded from a ``.pyc`` (or ``.pyo``) file. (Contributed by Kristján Valur Jónsson in :issue:`16475`, with additional speedups by Antoine Pitrou in :issue:`19219`.)
sv: Standardversionen av :mod:`marshal` har ökats till 3. Koden som implementerar den nya versionen återställer Python2-beteendet att endast registrera en kopia av internerade strängar och bevara interneringen vid deserialisering, och utökar denna "en kopia"-förmåga till alla objekttyper (inklusive hantering av rekursiva referenser). Detta minskar både storleken på ``.pyc``-filer och mängden minne som en modul upptar i minnet när den laddas från en ``.pyc`` (eller ``.pyo``) fil. (Bidrag från Kristján Valur Jónsson i :issue:`16475`, med ytterligare hastighetsökningar av Antoine Pitrou i :issue:`19219`.)

source: mmap objects are now :ref:`weakly referenceable <mod-weakref>`. (Contributed by Valerie Lambert in :issue:`4885`.)
sv: mmap-objekt är nu :ref:`svagt refererbara <mod-weakref>`. (Bidrag från Valerie Lambert i :issue:`4885`.)

source: On Unix two new :ref:`start methods <multiprocessing-start-methods>`, ``spawn`` and ``forkserver``, have been added for starting processes using :mod:`multiprocessing`. These make the mixing of processes with threads more robust, and the ``spawn`` method matches the semantics that multiprocessing has always used on Windows. New function :func:`~multiprocessing.get_all_start_methods` reports all start methods available on the platform, :func:`~multiprocessing.get_start_method` reports the current start method, and :func:`~multiprocessing.set_start_method` sets the start method. (Contributed by Richard Oudkerk in :issue:`8713`.)
sv: På Unix har två nya :ref:`startmetoder <multiprocessing-start-methods>`, ``spawn`` och ``forkserver``, lagts till för att starta processer som använder :mod:`multiprocessing`. Dessa gör blandningen av processer med trådar mer robust, och metoden ``spawn`` matchar den semantik som multiprocessing alltid har använt i Windows. Ny funktion :func:`~multiprocessing.get_all_start_methods` rapporterar alla startmetoder som finns tillgängliga på plattformen, :func:`~multiprocessing.get_start_method` rapporterar den aktuella startmetoden och :func:`~multiprocessing.set_start_method` ställer in startmetoden. (Bidrag från Richard Oudkerk i :issue:`8713`.)

source: :mod:`multiprocessing` also now has the concept of a ``context``, which determines how child processes are created. New function :func:`~multiprocessing.get_context` returns a context that uses a specified start method. It has the same API as the :mod:`multiprocessing` module itself, so you can use it to create :class:`~multiprocessing.pool.Pool`\ s and other objects that will operate within that context. This allows a framework and an application or different parts of the same application to use multiprocessing without interfering with each other. (Contributed by Richard Oudkerk in :issue:`18999`.)
sv: :mod:`multiprocessing` har nu också konceptet ``context``, som avgör hur barnprocesser skapas. Ny funktion :func:`~multiprocessing.get_context` returnerar ett sammanhang som använder en angiven startmetod. Den har samma API som själva modulen :mod:`multiprocessing`, så du kan använda den för att skapa :class:`~multiprocessing.pool.Pool` och andra objekt som kommer att fungera i det sammanhanget. Detta gör att ett ramverk och en applikation eller olika delar av samma applikation kan använda multiprocessing utan att störa varandra. (Bidrag från Richard Oudkerk i :issue:`18999`.)

source: Except when using the old *fork* start method, child processes no longer inherit unneeded handles/file descriptors from their parents (part of :issue:`8713`).
sv: Förutom när den gamla startmetoden *fork* används, ärver inte längre barnprocesser onödiga handtag/filbeskrivare från sina föräldrar (del av :issue:`8713`).

source: :mod:`multiprocessing` now relies on :mod:`runpy` (which implements the ``-m`` switch) to initialise ``__main__`` appropriately in child processes when using the ``spawn`` or ``forkserver`` start methods. This resolves some edge cases where combining multiprocessing, the ``-m`` command line switch, and explicit relative imports could cause obscure failures in child processes. (Contributed by Nick Coghlan in :issue:`19946`.)
sv: :mod:`multiprocessing` förlitar sig nu på :mod:`runpy` (som implementerar ``-m``-omkopplaren) för att initiera ``__main__`` på rätt sätt i underordnade processer när startmetoderna ``spawn`` eller ``forkserver`` används. Detta löser några kantfall där kombinationen av multiprocessing, kommandoradsbytet ``-m`` och explicit relativ import kunde orsaka obskyra fel i underordnade processer. (Bidrag från Nick Coghlan i :issue:`19946`.)

source: New function :func:`~operator.length_hint` provides an implementation of the specification for how the :meth:`~object.__length_hint__` special method should be used, as part of the :pep:`424` formal specification of this language feature. (Contributed by Armin Ronacher in :issue:`16148`.)
sv: Den nya funktionen :func:`~operator.length_hint` ger en implementation av specifikationen för hur specialmetoden :meth:`~object.__length_hint__` skall användas, som en del av den formella specifikationen :pep:`424` för denna språkfunktion. (Bidrag från Armin Ronacher i :issue:`16148`.)

source: There is now a pure-python version of the :mod:`operator` module available for reference and for use by alternate implementations of Python. (Contributed by Zachary Ware in :issue:`16694`.)
sv: Det finns nu en ren Python-version av modulen :mod:`operator` tillgänglig för referens och för användning av alternativa implementationer av Python. (Bidrag från Zachary Ware i :issue:`16694`.)

source: There are new functions to get and set the :ref:`inheritable flag <fd_inheritance>` of a file descriptor (:func:`os.get_inheritable`, :func:`os.set_inheritable`) or a Windows handle (:func:`os.get_handle_inheritable`, :func:`os.set_handle_inheritable`).
sv: Det finns nya funktioner för att hämta och ställa in :ref:`inheritable flag <fd_inheritance>` för en filbeskrivning (:func:`os.get_inheritable`, :func:`os.set_inheritable`) eller ett Windows-handtag (:func:`os.get_handle_inheritable`, :func:`os.set_handle_inheritable`).

source: New function :func:`~os.cpu_count` reports the number of CPUs available on the platform on which Python is running (or ``None`` if the count can't be determined). The :func:`multiprocessing.cpu_count` function is now implemented in terms of this function). (Contributed by Trent Nelson, Yogesh Chaudhari, Victor Stinner, and Charles-François Natali in :issue:`17914`.)
sv: Den nya funktionen :func:`~os.cpu_count` rapporterar antalet tillgängliga processorer på plattformen som Python körs på (eller ``None`` om antalet inte kan bestämmas). Funktionen :func:`multiprocessing.cpu_count` är nu implementerad i termer av denna funktion). (Bidrag från Trent Nelson, Yogesh Chaudhari, Victor Stinner och Charles-François Natali i :issue:`17914`.)

source: :func:`os.path.samestat` is now available on the Windows platform (and the :func:`os.path.samefile` implementation is now shared between Unix and Windows). (Contributed by Brian Curtin in :issue:`11939`.)
sv: :func:`os.path.samestat` är nu tillgänglig på Windows-plattformen (och :func:`os.path.samefile`-implementationen delas nu mellan Unix och Windows). (Bidrag från Brian Curtin i :issue:`11939`.)

source: :func:`os.path.ismount` now recognizes volumes mounted below a drive root on Windows. (Contributed by Tim Golden in :issue:`9035`.)
sv: :func:`os.path.ismount` känner nu igen volymer som är monterade under en enhetsrot i Windows. (Bidrag från Tim Golden i :issue:`9035`.)

source: :func:`os.open` supports two new flags on platforms that provide them, :const:`~os.O_PATH` (un-opened file descriptor), and :const:`~os.O_TMPFILE` (unnamed temporary file; as of 3.4.0 release available only on Linux systems with a kernel version of 3.11 or newer that have uapi headers). (Contributed by Christian Heimes in :issue:`18673` and Benjamin Peterson, respectively.)
sv: :func:`os.open` stöder två nya flaggor på plattformar som tillhandahåller dem, :const:`~os.O_PATH` (oöppnad filbeskrivare) och :const:`~os.O_TMPFILE` (namnlös temporär fil; från och med version 3.4.0 endast tillgänglig på Linux-system med en kärnversion av 3.11 eller nyare som har uapi-headers). (Bidrag från Christian Heimes i :issue:`18673` respektive Benjamin Peterson.)

source: :mod:`pdb` has been enhanced to handle generators, :keyword:`yield`, and ``yield from`` in a more useful fashion. This is especially helpful when debugging :mod:`asyncio` based programs. (Contributed by Andrew Svetlov and Xavier de Gaye in :issue:`16596`.)
sv: :mod:`pdb` har förbättrats för att hantera generatorer, :keyword:`yield` och ``yield from`` på ett mer användbart sätt. Detta är särskilt användbart vid felsökning av :mod:`asyncio`-baserade program. (Bidrag från Andrew Svetlov och Xavier de Gaye i :issue:`16596`.)

source: The ``print`` command has been removed from :mod:`pdb`, restoring access to the Python :func:`print` function from the pdb command line. Python2's ``pdb`` did not have a ``print`` command; instead, entering ``print`` executed the ``print`` statement. In Python3 ``print`` was mistakenly made an alias for the pdb :pdbcmd:`p` command. ``p``, however, prints the ``repr`` of its argument, not the ``str`` like the Python2 ``print`` command did. Worse, the Python3 ``pdb print`` command shadowed the Python3 ``print`` function, making it inaccessible at the ``pdb`` prompt. (Contributed by Connor Osborn in :issue:`18764`.)
sv: Kommandot ``print`` har tagits bort från :mod:`pdb`, vilket återställer åtkomsten till Python :func:`print`-funktionen från pdb-kommandoraden. Python2:s ``pdb`` hade inget ``print``-kommando, utan när man skrev ``print`` utfördes ``print``-satsen. I Python3 gjordes ``print`` av misstag till ett alias för kommandot pdb :pdbcmd:`p`. ``p`` skriver dock ut ``repr`` av sitt argument, inte ``str`` som kommandot ``print`` i Python2 gjorde. Än värre var att Python3-kommandot ``pdb print`` skuggade Python3-funktionen ``print``, vilket gjorde den otillgänglig vid ``pdb``-prompten. (Bidrag från Connor Osborn i :issue:`18764`.)

source: pickle
sv: gurka

source: :mod:`pickle` now supports (but does not use by default) a new pickle protocol, protocol 4. This new protocol addresses a number of issues that were present in previous protocols, such as the serialization of nested classes, very large strings and containers, and classes whose :meth:`__new__` method takes keyword-only arguments. It also provides some efficiency improvements.
sv: :mod:`pickle` har nu stöd för (men använder inte som standard) ett nytt pickle-protokoll, protokoll 4. Detta nya protokoll tar upp ett antal problem som fanns i tidigare protokoll, t.ex. serialisering av nästlade klasser, mycket stora strängar och behållare samt klasser vars :meth:`__new__`-metod endast tar nyckelordsargument. Det ger också vissa effektivitetsförbättringar.

source: :pep:`3154` -- Pickle protocol 4
sv: :pep:`3154` -- Pickle protokoll 4

source: PEP written by Antoine Pitrou and implemented by Alexandre Vassalotti.
sv: PEP skriven av Antoine Pitrou och implementerad av Alexandre Vassalotti.

source: :mod:`plistlib` now has an API that is similar to the standard pattern for stdlib serialization protocols, with new :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads`, and :func:`~plistlib.dumps` functions. (The older API is now deprecated.) In addition to the already supported XML plist format (:const:`~plistlib.FMT_XML`), it also now supports the binary plist format (:const:`~plistlib.FMT_BINARY`). (Contributed by Ronald Oussoren and others in :issue:`14455`.)
sv: :mod:`plistlib` har nu ett API som liknar standardmönstret för stdlib-serialiseringsprotokoll, med nya funktioner :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads` och :func:`~plistlib.dumps`. (Det äldre API:et är nu föråldrat.) Förutom det redan stödda XML-plistformatet (:const:`~plistlib.FMT_XML`), stöds nu även det binära plistformatet (:const:`~plistlib.FMT_BINARY`). (Bidrag från Ronald Oussoren och andra i :issue:`14455`.)

source: Two new methods have been added to :mod:`poplib`: :meth:`~poplib.POP3.capa`, which returns the list of capabilities advertised by the POP server, and :meth:`~poplib.POP3.stls`, which switches a clear-text POP3 session into an encrypted POP3 session if the POP server supports it. (Contributed by Lorenzo Catucci in :issue:`4473`.)
sv: Två nya metoder har lagts till i :mod:`poplib`: :meth:`~poplib.POP3.capa`, som returnerar listan över funktioner som annonseras av POP-servern, och :meth:`~poplib.POP3.stls`, som växlar en POP3-session i klartext till en krypterad POP3-session om POP-servern stöder det. (Bidrag från Lorenzo Catucci i :issue:`4473`.)

source: pprint
sv: tryck

source: The :mod:`pprint` module's :class:`~pprint.PrettyPrinter` class and its :func:`~pprint.pformat`, and :func:`~pprint.pprint` functions have a new option, *compact*, that controls how the output is formatted. Currently setting *compact* to ``True`` means that sequences will be printed with as many sequence elements as will fit within *width* on each (indented) line. (Contributed by Serhiy Storchaka in :issue:`19132`.)
sv: Modulen :mod:`pprint`:s klass :class:`~pprint.PrettyPrinter` och dess funktioner :func:`~pprint.pformat` och :func:`~pprint.pprint` har ett nytt alternativ, *compact*, som styr hur utdata formateras. Om *compact* för närvarande sätts till ``True`` innebär det att sekvenser skrivs ut med så många sekvenselement som ryms inom *bredd* på varje (indragen) rad. (Bidrag från Serhiy Storchaka i :issue:`19132`.)

source: Long strings are now wrapped using Python's normal line continuation syntax. (Contributed by Antoine Pitrou in :issue:`17150`.)
sv: Långa strängar omsluts nu med Pythons normala syntax för radfortsättning. (Bidrag från Antoine Pitrou i :issue:`17150`.)
