Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: As mentioned in :ref:`whatsnew-pep-451`, a number of :mod:`importlib` methods and functions are deprecated: :meth:`!importlib.find_loader` is replaced by :func:`importlib.util.find_spec`; :meth:`!importlib.machinery.PathFinder.find_module` is replaced by :meth:`importlib.machinery.PathFinder.find_spec`; :meth:`!importlib.abc.MetaPathFinder.find_module` is replaced by :meth:`importlib.abc.MetaPathFinder.find_spec`; :meth:`!importlib.abc.PathEntryFinder.find_loader` and :meth:`!find_module` are replaced by :meth:`importlib.abc.PathEntryFinder.find_spec`; all of the :samp:`{xxx}Loader` ABC ``load_module`` methods (:meth:`!importlib.abc.Loader.load_module`, :meth:`!importlib.abc.InspectLoader.load_module`, :meth:`!importlib.abc.FileLoader.load_module`, :meth:`!importlib.abc.SourceLoader.load_module`) should no longer be implemented, instead loaders should implement an ``exec_module`` method (:meth:`importlib.abc.Loader.exec_module`, :meth:`importlib.abc.InspectLoader.exec_module` :meth:`importlib.abc.SourceLoader.exec_module`) and let the import system take care of the rest; and :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.util.module_for_loader`, :meth:`!importlib.util.set_loader`, and :meth:`!importlib.util.set_package` are no longer needed because their functions are now handled automatically by the import system.
sv: Som nämnts i :ref:`whatsnew-pep-451`, är ett antal :mod:`importlib`-metoder och funktioner föråldrade: :meth:`!importlib.find_loader` ersätts av :func:`importlib.util.find_spec`; :meth:`!importlib.machinery.PathFinder.find_module` ersätts av :meth:`importlib.machinery.PathFinder.find_spec`; :meth:`!importlib.abc.MetaPathFinder.find_module` ersätts av :meth:`importlib.abc.MetaPathFinder.find_spec`; :meth:`!importlib.abc.PathEntryFinder.find_loader` och :meth:`!find_module` ersätts av :meth:`importlib.abc.PathEntryFinder.find_spec`; alla :samp:`{xxx}Loader` ABC ``load_module`` metoder (:meth:`!importlib.abc.Loader.load_module`, :meth:`!importlib.abc.InspectLoader.load_module`, :meth:`!importlib.abc.FileLoader.load_module`, :meth:`!importlib.abc.SourceLoader.load_module`) bör inte längre implementeras, istället bör laddare implementera en ``exec_module`` metod (:meth:`importlib.abc.Loader.exec_module`, :meth:`importlib.abc.InspectLoader.exec_module` :meth:`importlib.abc.SourceLoader.exec_module`) och låta importsystemet ta hand om resten; och :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.util.module_for_loader`, :meth:`!importlib.util.set_loader`, och :meth:`!importlib.util.set_package` behövs inte längre eftersom deras funktioner nu hanteras automatiskt av importsystemet.

source: The :mod:`!imp` module is pending deprecation. To keep compatibility with Python 2/3 code bases, the module's removal is currently not scheduled.
sv: Modulen :mod:`!imp` väntar på att tas bort. För att behålla kompatibiliteten med Python 2/3 kodbaser, är modulens borttagning för närvarande inte planerad.

source: The :mod:`formatter` module is pending deprecation and is slated for removal in Python 3.6.
sv: Modulen :mod:`formatter` är under avveckling och kommer att tas bort i Python 3.6.

source: ``MD5`` as the default *digestmod* for the :func:`hmac.new` function is deprecated. Python 3.6 will require an explicit digest name or constructor as *digestmod* argument.
sv: ``MD5`` som standard *digestmod* för funktionen :func:`hmac.new` är föråldrad. Python 3.6 kommer att kräva ett explicit digestnamn eller konstruktör som *digestmod*-argument.

source: The internal ``Netrc`` class in the :mod:`ftplib` module has been documented as deprecated in its docstring for quite some time. It now emits a :exc:`DeprecationWarning` and will be removed completely in Python 3.5.
sv: Den interna ``Netrc``-klassen i :mod:`ftplib`-modulen har dokumenterats som föråldrad i sin dokumentsträng under en längre tid. Den avger nu en :exc:`DeprecationWarning` och kommer att tas bort helt i Python 3.5.

source: The undocumented *endtime* argument to :meth:`subprocess.Popen.wait` should not have been exposed and is hopefully not in use; it is deprecated and will mostly likely be removed in Python 3.5.
sv: Det odokumenterade *endtime*-argumentet till :meth:`subprocess.Popen.wait` borde inte ha exponerats och används förhoppningsvis inte; det är föråldrat och kommer med största sannolikhet att tas bort i Python 3.5.

source: The *strict* argument of :class:`~html.parser.HTMLParser` is deprecated.
sv: Argumentet *strict* i :class:`~html.parser.HTMLParser` är föråldrat.

source: The :mod:`plistlib` :func:`~plistlib.readPlist`, :func:`~plistlib.writePlist`, :func:`~plistlib.readPlistFromBytes`, and :func:`~plistlib.writePlistToBytes` functions are deprecated in favor of the corresponding new functions :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads`, and :func:`~plistlib.dumps`. :func:`~plistlib.Data` is deprecated in favor of just using the :class:`bytes` constructor.
sv: Funktionerna :mod:`plistlib` :func:`~plistlib.readPlist`, :func:`~plistlib.writePlist`, :func:`~plistlib.readPlistFromBytes`, och :func:`~plistlib.writePlistToBytes` är utdaterade till förmån för motsvarande nya funktioner :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads`, och :func:`~plistlib.dumps`. :func:`~plistlib.Data` är föråldrad till förmån för att bara använda :class:`bytes` konstruktören.

source: The :mod:`sysconfig` key ``SO`` is deprecated, it has been replaced by ``EXT_SUFFIX``.
sv: Nyckel :mod:`sysconfig` ``SO`` är föråldrad och har ersatts av ``EXT_SUFFIX``.

source: The ``U`` mode accepted by various ``open`` functions is deprecated. In Python3 it does not do anything useful, and should be replaced by appropriate uses of :class:`io.TextIOWrapper` (if needed) and its *newline* argument.
sv: Läget ``U`` som accepteras av olika ``open``-funktioner är föråldrat. I Python3 gör det inget användbart och bör ersättas av lämpliga användningar av :class:`io.TextIOWrapper` (om det behövs) och dess *newline*-argument.

source: The *parser* argument of :func:`xml.etree.ElementTree.iterparse` has been deprecated, as has the *html* argument of :func:`~xml.etree.ElementTree.XMLParser`. To prepare for the removal of the latter, all arguments to ``XMLParser`` should be passed by keyword.
sv: Argumentet *parser* i :func:`xml.etree.ElementTree.iterparse` har utgått, liksom argumentet *html* i :func:`~xml.etree.ElementTree.XMLParser`. För att förbereda borttagandet av det senare bör alla argument till ``XMLParser`` skickas med nyckelord.

source: Deprecated Features
sv: Föråldrade funktioner

source: Running :ref:`idle` with the ``-n`` flag (no subprocess) is deprecated. However, the feature will not be removed until :issue:`18823` is resolved.
sv: Att köra :ref:`idle` med flaggan ``-n`` (ingen underprocess) är föråldrat. Funktionen kommer dock inte att tas bort förrän :issue:`18823` är löst.

source: The site module adding a "site-python" directory to sys.path, if it exists, is deprecated (:issue:`19375`).
sv: Site-modulen som lägger till en "site-python"-katalog i sys.path, om den finns, är föråldrad (:issue:`19375`).

source: Removed
sv: Borttagen

source: Operating Systems No Longer Supported
sv: Operativsystem som inte längre stöds

source: Support for the following operating systems has been removed from the source and build tools:
sv: Stöd för följande operativsystem har tagits bort från käll- och byggverktygen:

source: Windows 2000 (changeset e52df05b496a).
sv: Windows 2000 (ändring e52df05b496a).

source: Windows systems where ``COMSPEC`` points to ``command.com`` (:issue:`14470`).
sv: Windows-system där ``COMSPEC`` pekar på ``command.com`` (:issue:`14470`).

source: API and Feature Removals
sv: Borttagning av API och funktioner

source: The following obsolete and previously deprecated APIs and features have been removed:
sv: Följande föråldrade och tidigare utfasade API:er och funktioner har tagits bort:

source: The unmaintained ``Misc/TextMate`` and ``Misc/vim`` directories have been removed (see the `devguide <https://devguide.python.org>`_ for suggestions on what to use instead).
sv: De ounderhållna katalogerna ``Misc/TextMate`` och ``Misc/vim`` har tagits bort (se `devguide <https://devguide.python.org>`_ för förslag på vad som kan användas istället).

source: The ``SO`` makefile macro is removed (it was replaced by the ``SHLIB_SUFFIX`` and ``EXT_SUFFIX`` macros) (:issue:`16754`).
sv: Makrot ``SO`` i makefilen har tagits bort (det ersattes av makrot ``SHLIB_SUFFIX`` och ``EXT_SUFFIX``) (:issue:`16754`).

source: The ``PyThreadState.tick_counter`` field has been removed; its value has been meaningless since Python 3.2, when the "new GIL" was introduced (:issue:`19199`).
sv: Fältet ``PyThreadState.tick_counter`` har tagits bort; dess värde har varit meningslöst sedan Python 3.2, när den "nya GIL" introducerades (:issue:`19199``).

source: ``PyLoader`` and ``PyPycLoader`` have been removed from :mod:`importlib`. (Contributed by Taras Lyapun in :issue:`15641`.)
sv: ``PyLoader`` och ``PyPycLoader`` har tagits bort från :mod:`importlib`. (Bidrag från Taras Lyapun i :issue:`15641`.)

source: The *strict* argument to :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` has been removed. HTTP 0.9-style "Simple Responses" are no longer supported.
sv: Argumentet *strict* till :class:`~http.client.HTTPConnection` och :class:`~http.client.HTTPSConnection` har tagits bort. HTTP 0.9-stil "Simple Responses" stöds inte längre.

source: The deprecated :mod:`urllib.request.Request` getter and setter methods ``add_data``, ``has_data``, ``get_data``, ``get_type``, ``get_host``, ``get_selector``, ``set_proxy``, ``get_origin_req_host``, and ``is_unverifiable`` have been removed (use direct attribute access instead).
sv: De föråldrade :mod:`urllib.request.Request` getter- och setter-metoderna ``add_data``, ``has_data``, ``get_data``, ``get_type``, ``get_host``, ``get_selector``, ``set_proxy``, ``get_origin_req_host`` och ``is_unverifiable`` har tagits bort (använd direkt attributåtkomst istället).

source: Support for loading the deprecated ``TYPE_INT64`` has been removed from :mod:`marshal`. (Contributed by Dan Riti in :issue:`15480`.)
sv: Stöd för laddning av den föråldrade ``TYPE_INT64`` har tagits bort från :mod:`marshal`. (Bidrag från Dan Riti i :issue:`15480`.)

source: :class:`inspect.Signature`: positional-only parameters are now required to have a valid name.
sv: :class:`inspect.Signature`: parametrar som endast är positionella måste nu ha ett giltigt namn.

source: :meth:`object.__format__` no longer accepts non-empty format strings, it now raises a :exc:`TypeError` instead. Using a non-empty string has been deprecated since Python 3.2. This change has been made to prevent a situation where previously working (but incorrect) code would start failing if an object gained a __format__ method, which means that your code may now raise a :exc:`TypeError` if you are using an ``'s'`` format code with objects that do not have a __format__ method that handles it. See :issue:`7994` for background.
sv: :meth:`object.__format__` accepterar inte längre icke-tomma formatsträngar, den ger nu upphov till ett :exc:`TypeError` istället. Att använda en icke-tom sträng har varit föråldrat sedan Python 3.2. Denna ändring har gjorts för att förhindra en situation där tidigare fungerande (men felaktig) kod skulle börja misslyckas om ett objekt fick en __format__-metod, vilket innebär att din kod nu kan ge upphov till ett :exc:`TypeError` om du använder en ``'s'``-formatkod med objekt som inte har en __format__-metod som hanterar den. Se :issue:`7994` för bakgrund.

source: :meth:`difflib.SequenceMatcher.isbjunk` and :meth:`difflib.SequenceMatcher.isbpopular` were deprecated in 3.2, and have now been removed: use ``x in sm.bjunk`` and ``x in sm.bpopular``, where *sm* is a :class:`~difflib.SequenceMatcher` object (:issue:`13248`).
sv: :meth:`difflib.SequenceMatcher.isbjunk` och :meth:`difflib.SequenceMatcher.isbpopular` var föråldrade i 3.2 och har nu tagits bort: använd ``x in sm.bjunk`` och ``x in sm.bpopular``, där *sm* är ett :class:`~difflib.SequenceMatcher`-objekt (:issue:`13248`).

source: Code Cleanups
sv: Uppstädning av kod

source: The unused and undocumented internal ``Scanner`` class has been removed from the :mod:`pydoc` module.
sv: Den oanvända och odokumenterade interna klassen ``Scanner`` har tagits bort från modulen :mod:`pydoc`.

source: The private and effectively unused ``_gestalt`` module has been removed, along with the private :mod:`platform` functions ``_mac_ver_lookup``, ``_mac_ver_gstalt``, and ``_bcd2str``, which would only have ever been called on badly broken OSX systems (see :issue:`18393`).
sv: Den privata och i praktiken oanvända modulen ``_gestalt`` har tagits bort, tillsammans med de privata :mod:`platform`-funktionerna ``_mac_ver_lookup``, ``_mac_ver_gstalt`` och ``_bcd2str``, som bara skulle ha anropats på dåligt fungerande OSX-system (se :issue:`18393`).

source: The hardcoded copies of certain :mod:`stat` constants that were included in the :mod:`tarfile` module namespace have been removed.
sv: De hårdkodade kopiorna av vissa :mod:`stat`-konstanter som ingick i :mod:`tarfile`-modulens namnrymd har tagits bort.

source: Porting to Python 3.4
sv: Portning till Python 3.4

source: This section lists previously described changes and other bugfixes that may require changes to your code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Changes in 'python' Command Behavior
sv: Ändringar i beteendet för kommandot "python

source: In a posix shell, setting the :envvar:`PATH` environment variable to an empty value is equivalent to not setting it at all. However, setting :envvar:`PYTHONPATH` to an empty value was *not* equivalent to not setting it at all: setting :envvar:`PYTHONPATH` to an empty value was equivalent to setting it to ``.``, which leads to confusion when reasoning by analogy to how :envvar:`PATH` works. The behavior now conforms to the posix convention for :envvar:`PATH`.
sv: I ett posix-skal är det likvärdigt med att inte ange miljövariabeln :envvar:`PATH` alls om den anges till ett tomt värde. Men att sätta :envvar:`PYTHONPATH` till ett tomt värde var *inte* likvärdigt med att inte sätta den alls: att sätta :envvar:`PYTHONPATH` till ett tomt värde var likvärdigt med att sätta den till ``.``, vilket leder till förvirring när man resonerar analogt med hur :envvar:`PATH` fungerar. Beteendet överensstämmer nu med posix-konventionen för :envvar:`PATH`.

source: The [X refs, Y blocks] output of a debug (``--with-pydebug``) build of the CPython interpreter is now off by default. It can be re-enabled using the ``-X showrefcount`` option. (Contributed by Ezio Melotti in :issue:`17323`.)
sv: Utdata [X refs, Y blocks] från en debug (``--med-pydebug``) -byggnad av CPython-tolken är nu avstängd som standard. Den kan återaktiveras med hjälp av alternativet ``-X showrefcount``. (Bidrag från Ezio Melotti i :issue:`17323`.)

source: The python command and most stdlib scripts (as well as :mod:`argparse`) now output ``--version`` information to ``stdout`` instead of ``stderr`` (for issue list see :ref:`other-improvements-3.4` above).
sv: Python-kommandot och de flesta stdlib-skript (samt :mod:`argparse`) skickar nu ut ``--version``-information till ``stdout`` istället för ``stderr`` (för problemlista se :ref:`other-improvement-3.4` ovan).

source: Changes in the Python API
sv: Ändringar i Python API

source: The ABCs defined in :mod:`importlib.abc` now either raise the appropriate exception or return a default value instead of raising :exc:`NotImplementedError` blindly. This will only affect code calling :func:`super` and falling through all the way to the ABCs. For compatibility, catch both :exc:`NotImplementedError` or the appropriate exception as needed.
sv: De ABC:er som definieras i :mod:`importlib.abc` ger nu antingen upphov till lämpligt undantag eller returnerar ett standardvärde istället för att ge upphov till :exc:`NotImplementedError` i blindo. Detta kommer endast att påverka kod som anropar :func:`super` och som faller igenom hela vägen till ABC. För kompatibilitet, fånga både :exc:`NotImplementedError` eller det lämpliga undantaget efter behov.

source: The module type now initializes the :attr:`~module.__package__` and :attr:`~module.__loader__` attributes to ``None`` by default. To determine if these attributes were set in a backwards-compatible fashion, use e.g. ``getattr(module, '__loader__', None) is not None``. (:issue:`17115`.)
sv: Modultypen initierar nu attributen :attr:`~module.__package__` och :attr:`~module.__loader__` till ``None`` som standard. För att avgöra om dessa attribut har ställts in på ett bakåtkompatibelt sätt, använd t.ex. ``getattr(module, '__loader__', None) is not None``. (:issue:`17115`.)

source: :meth:`!importlib.util.module_for_loader` now sets ``__loader__`` and ``__package__`` unconditionally to properly support reloading. If this is not desired then you will need to set these attributes manually. You can use :func:`importlib.util.module_to_load` for module management.
sv: :meth:`!importlib.util.module_for_loader` ställer nu in ``__loader__`` och ``__package__`` villkorslöst för att korrekt stödja omlastning. Om detta inte är önskvärt måste du ställa in dessa attribut manuellt. Du kan använda :func:`importlib.util.module_to_load` för modulhantering.

source: Import now resets relevant attributes (e.g. ``__name__``, ``__loader__``, ``__package__``, ``__file__``, ``__cached__``) unconditionally when reloading. Note that this restores a pre-3.3 behavior in that it means a module is re-found when re-loaded (:issue:`19413`).
sv: Import återställer nu relevanta attribut (t.ex. ``__name__``, ``__loader__``, ``__package__``, ``__file__``, ``__cached__``) villkorslöst när den laddas om. Observera att detta återställer ett pre-3.3-beteende i och med att det innebär att en modul hittas på nytt när den laddas om (:issue:`19413`).

source: Frozen packages no longer set ``__path__`` to a list containing the package name, they now set it to an empty list. The previous behavior could cause the import system to do the wrong thing on submodule imports if there was also a directory with the same name as the frozen package. The correct way to determine if a module is a package or not is to use ``hasattr(module, '__path__')`` (:issue:`18065`).
sv: Frusna paket sätter inte längre ``__path__`` till en lista som innehåller paketnamnet, utan nu till en tom lista. Det tidigare beteendet kunde leda till att importsystemet gjorde fel sak vid import av undermoduler om det också fanns en katalog med samma namn som det frysta paketet. Det korrekta sättet att avgöra om en modul är ett paket eller inte är att använda ``hasattr(module, '__path__')`` (:issue:`18065`).

source: Frozen modules no longer define a ``__file__`` attribute. It's semantically incorrect for frozen modules to set the attribute as they are not loaded from any explicit location. If you must know that a module comes from frozen code then you can see if the module's ``__spec__.location`` is set to ``'frozen'``, check if the loader is a subclass of :class:`importlib.machinery.FrozenImporter`, or if Python 2 compatibility is necessary you can use :func:`!imp.is_frozen`.
sv: Frysta moduler definierar inte längre attributet ``__file__``. Det är semantiskt inkorrekt för frysta moduler att ange attributet eftersom de inte laddas från någon explicit plats. Om du måste veta att en modul kommer från frusen kod kan du se om modulens ``__spec__.location`` är inställd på ``'frozen'``, kontrollera om laddaren är en underklass till :class:`importlib.machinery.FrozenImporter`, eller om Python 2-kompatibilitet är nödvändig kan du använda :func:`!imp.is_frozen`.

source: :func:`py_compile.compile` now raises :exc:`FileExistsError` if the file path it would write to is a symlink or a non-regular file. This is to act as a warning that import will overwrite those files with a regular file regardless of what type of file path they were originally.
sv: :func:`py_compile.compile` ger nu upphov till :exc:`FileExistsError` om filsökvägen som den skulle skriva till är en symlänk eller en icke-vanlig fil. Detta är för att varna för att importen kommer att skriva över dessa filer med en vanlig fil oavsett vilken typ av filsökväg de ursprungligen hade.

source: :meth:`importlib.abc.SourceLoader.get_source` no longer raises :exc:`ImportError` when the source code being loaded triggers a :exc:`SyntaxError` or :exc:`UnicodeDecodeError`. As :exc:`ImportError` is meant to be raised only when source code cannot be found but it should, it was felt to be over-reaching/overloading of that meaning when the source code is found but improperly structured. If you were catching ImportError before and wish to continue to ignore syntax or decoding issues, catch all three exceptions now.
sv: :meth:`importlib.abc.SourceLoader.get_source` ger inte längre upphov till :exc:`ImportError` när källkoden som laddas utlöser ett :exc:`SyntaxError` eller :exc:`UnicodeDecodeError`. Eftersom :exc:`ImportError` endast är avsett att utlösas när källkoden inte kan hittas men borde kunna det, ansågs det vara att gå för långt/överbelasta den betydelsen när källkoden hittas men är felaktigt strukturerad. Om du fångade ImportError tidigare och vill fortsätta att ignorera syntax- eller avkodningsproblem, fånga alla tre undantagen nu.

source: :func:`functools.update_wrapper` and :func:`functools.wraps` now correctly set the ``__wrapped__`` attribute to the function being wrapped, even if that function also had its ``__wrapped__`` attribute set. This means ``__wrapped__`` attributes now correctly link a stack of decorated functions rather than every ``__wrapped__`` attribute in the chain referring to the innermost function. Introspection libraries that assumed the previous behaviour was intentional can use :func:`inspect.unwrap` to access the first function in the chain that has no ``__wrapped__`` attribute.
sv: :func:`functools.update_wrapper` och :func:`functools.wraps` sätter nu attributet ``__wrapped__`` korrekt till den funktion som omsluts, även om den funktionen också hade attributet ``__wrapped__`` satt. Detta innebär att ``__wrapped__``-attribut nu korrekt länkar en stack av dekorerade funktioner snarare än att varje ``__wrapped__``-attribut i kedjan refererar till den innersta funktionen. Introspektionsbibliotek som antog att det tidigare beteendet var avsiktligt kan använda :func:`inspect.unwrap` för att komma åt den första funktionen i kedjan som inte har något ``__wrapped__``-attribut.

source: :func:`inspect.getfullargspec` has been reimplemented on top of :func:`inspect.signature` and hence handles a much wider variety of callable objects than it did in the past. It is expected that additional builtin and extension module callables will gain signature metadata over the course of the Python 3.4 series. Code that assumes that :func:`inspect.getfullargspec` will fail on non-Python callables may need to be adjusted accordingly.
sv: :func:`inspect.getfullargspec` har omimplementerats ovanpå :func:`inspect.signature` och hanterar därför en mycket större variation av anropsbara objekt än tidigare. Det förväntas att ytterligare inbyggda och tilläggsmodulers anropbara objekt kommer att få signaturmetadata under Python 3.4-seriens gång. Kod som antar att :func:`inspect.getfullargspec` kommer att misslyckas på icke-Python-kallobjekt kan behöva justeras i enlighet med detta.
