Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: :pep:`451` provides an encapsulation of the information about a module that the import machinery will use to load it (that is, a module specification). This helps simplify both the import implementation and several import-related APIs. The change is also a stepping stone for `several future import-related improvements`__.
sv: :pep:`451` tillhandahåller en inkapsling av informationen om en modul som importmaskineriet kommer att använda för att ladda den (det vill säga en modulspecifikation). Detta hjälper till att förenkla både importimplementationen och flera importrelaterade API:er. Ändringen är också en språngbräda för `flera framtida importrelaterade förbättringar`__.

source: The public-facing changes from the PEP are entirely backward-compatible. Furthermore, they should be transparent to everyone but importer authors. Key finder and loader methods have been deprecated, but they will continue working. New importers should use the new methods described in the PEP. Existing importers should be updated to implement the new methods. See the :ref:`deprecated-3.4` section for a list of methods that should be replaced and their replacements.
sv: De ändringar från PEP som vänder sig till allmänheten är helt bakåtkompatibla. Dessutom bör de vara transparenta för alla utom importörsförfattare. Metoderna för nyckelsökare och laddare har utgått, men de kommer att fortsätta att fungera. Nya importörer bör använda de nya metoder som beskrivs i PEP. Befintliga importörer bör uppdateras för att implementera de nya metoderna. Se avsnittet :ref:`deprecated-3.4` för en lista över metoder som bör ersättas och deras ersättare.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:

source: Unicode database updated to UCD version 6.3.
sv: Unicode-databasen uppdaterad till UCD version 6.3.

source: :func:`min` and :func:`max` now accept a *default* keyword-only argument that can be used to specify the value they return if the iterable they are evaluating has no elements. (Contributed by Julian Berman in :issue:`18111`.)
sv: :func:`min` och :func:`max` accepterar nu ett *default* nyckelordsargument som kan användas för att ange det värde de returnerar om den iterabel de utvärderar inte har några element. (Bidrag från Julian Berman i :issue:`18111`.)

source: Module objects are now :ref:`weakly referenceable <mod-weakref>`.
sv: Modulobjekt är nu :ref:`svagt refererbara <mod-weakref>`.

source: Module ``__file__`` attributes (and related values) should now always contain absolute paths by default, with the sole exception of ``__main__.__file__`` when a script has been executed directly using a relative path. (Contributed by Brett Cannon in :issue:`18416`.)
sv: Modulens ``__file__``-attribut (och relaterade värden) ska nu alltid innehålla absoluta sökvägar som standard, med undantag för ``__main__.__file__`` när ett skript har exekverats direkt med en relativ sökväg. (Bidrag från Brett Cannon i :issue:`18416`.)

source: All the UTF-\* codecs (except UTF-7) now reject surrogates during both encoding and decoding unless the ``surrogatepass`` error handler is used, with the exception of the UTF-16 decoder (which accepts valid surrogate pairs) and the UTF-16 encoder (which produces them while encoding non-BMP characters). (Contributed by Victor Stinner, Kang-Hao (Kenny) Lu and Serhiy Storchaka in :issue:`12892`.)
sv: Alla UTF-\*-codecs (utom UTF-7) avvisar nu surrogat under både kodning och avkodning om inte felhanteraren ``surrogatepass`` används, med undantag för UTF-16-avkodaren (som accepterar giltiga surrogatpar) och UTF-16-kodaren (som producerar dem vid kodning av icke-BMP-tecken). (Bidrag från Victor Stinner, Kang-Hao (Kenny) Lu och Serhiy Storchaka i :issue:`12892`.)

source: New German EBCDIC :ref:`codec <standard-encodings>` ``cp273``. (Contributed by Michael Bierenfeld and Andrew Kuchling in :issue:`1097797`.)
sv: Ny tysk EBCDIC :ref:`codec <standard-encodings>` ``cp273``. (Bidrag från Michael Bierenfeld och Andrew Kuchling i :issue:`1097797`.)

source: New Ukrainian :ref:`codec <standard-encodings>` ``cp1125``. (Contributed by Serhiy Storchaka in :issue:`19668`.)
sv: Ny ukrainsk :ref:`codec <standard-encodings>` ``cp1125``. (Bidrag från Serhiy Storchaka i :issue:`19668`.)

source: :class:`bytes`.join() and :class:`bytearray`.join() now accept arbitrary buffer objects as arguments. (Contributed by Antoine Pitrou in :issue:`15958`.)
sv: :class:`bytes`.join() och :class:`bytearray`.join() accepterar nu godtyckliga buffertobjekt som argument. (Bidrag från Antoine Pitrou i :issue:`15958`.)

source: The :class:`int` constructor now accepts any object that has an ``__index__`` method for its *base* argument. (Contributed by Mark Dickinson in :issue:`16772`.)
sv: Konstruktorn :class:`int` accepterar nu alla objekt som har en ``__index__``-metod för sitt *base*-argument. (Bidrag från Mark Dickinson i :issue:`16772`.)

source: Frame objects now have a :func:`~frame.clear` method that clears all references to local variables from the frame. (Contributed by Antoine Pitrou in :issue:`17934`.)
sv: Frame-objekt har nu en :func:`~frame.clear`-metod som rensar alla referenser till lokala variabler från ramen. (Bidrag från Antoine Pitrou i :issue:`17934`.)

source: :class:`memoryview` is now registered as a :class:`Sequence <collections.abc>`, and supports the :func:`reversed` builtin. (Contributed by Nick Coghlan and Claudiu Popa in :issue:`18690` and :issue:`19078`.)
sv: :class:`memoryview` är nu registrerad som en :class:`Sequence <collections.abc>`, och stödjer :func:`reversed` builtin. (Bidrag från Nick Coghlan och Claudiu Popa i :issue:`18690` och :issue:`19078`.)

source: Signatures reported by :func:`help` have been modified and improved in several cases as a result of the introduction of Argument Clinic and other changes to the :mod:`inspect` and :mod:`pydoc` modules.
sv: Signaturer som rapporteras av :func:`help` har modifierats och förbättrats i flera fall som ett resultat av införandet av Argument Clinic och andra ändringar i modulerna :mod:`inspect` och :mod:`pydoc`.

source: :meth:`~object.__length_hint__` is now part of the formal language specification (see :pep:`424`). (Contributed by Armin Ronacher in :issue:`16148`.)
sv: :meth:`~object.__length_hint__` är nu en del av den formella språkspecifikationen (se :pep:`424`). (Bidrag från Armin Ronacher i :issue:`16148`.)

source: New Modules
sv: Nya moduler

source: The new :mod:`asyncio` module (defined in :pep:`3156`) provides a standard pluggable event loop model for Python, providing solid asynchronous IO support in the standard library, and making it easier for other event loop implementations to interoperate with the standard library and each other.
sv: Den nya modulen :mod:`asyncio` (definierad i :pep:`3156`) tillhandahåller en standardiserad pluggbar modell för händelseslingor i Python, vilket ger ett gediget stöd för asynkron IO i standardbiblioteket och gör det enklare för andra implementeringar av händelseslingor att samverka med standardbiblioteket och varandra.

source: For Python 3.4, this module is considered a :term:`provisional API`.
sv: För Python 3.4 anses denna modul vara ett :term:`provisoriskt API`.

source: :pep:`3156` -- Asynchronous IO Support Rebooted: the "asyncio" Module
sv: :pep:`3156` -- Asynkront IO-stöd återstartat: modulen "asyncio"

source: PEP written and implementation led by Guido van Rossum.
sv: PEP skrivs och genomförandet leds av Guido van Rossum.

source: ensurepip
sv: säkerställa pip

source: The new :mod:`ensurepip` module is the primary infrastructure for the :pep:`453` implementation. In the normal course of events end users will not need to interact with this module, but it can be used to manually bootstrap ``pip`` if the automated bootstrapping into an installation or virtual environment was declined.
sv: Den nya modulen :mod:`ensurepip` är den primära infrastrukturen för implementeringen av :pep:`453`. I normala fall behöver slutanvändarna inte interagera med den här modulen, men den kan användas för att manuellt starta upp ``pip`` om den automatiska uppstarten till en installation eller virtuell miljö inte fungerar.

source: :mod:`ensurepip` includes a bundled copy of ``pip``, up-to-date as of the first release candidate of the release of CPython with which it ships (this applies to both maintenance releases and feature releases). ``ensurepip`` does not access the internet. If the installation has internet access, after ``ensurepip`` is run the bundled ``pip`` can be used to upgrade ``pip`` to a more recent release than the bundled one. (Note that such an upgraded version of ``pip`` is considered to be a separately installed package and will not be removed if Python is uninstalled.)
sv: :mod:`ensurepip` innehåller en buntad kopia av ``pip``, uppdaterad från och med den första releasekandidaten för den version av CPython som den levereras med (detta gäller både underhållsreleaser och funktionsreleaser). ``ensurepip`` har inte tillgång till internet. Om installationen har tillgång till Internet, efter att ``ensurepip`` har körts, kan den medföljande ``pip`` användas för att uppgradera ``pip`` till en nyare version än den medföljande. (Observera att en sådan uppgraderad version av ``pip`` anses vara ett separat installerat paket och kommer inte att tas bort om Python avinstalleras)

source: The module is named *ensure*\ pip because if called when ``pip`` is already installed, it does nothing. It also has an ``--upgrade`` option that will cause it to install the bundled copy of ``pip`` if the existing installed version of ``pip`` is older than the bundled copy.
sv: Modulen heter *ensure* pip eftersom den inte gör någonting om den anropas när ``pip`` redan är installerat. Den har också ett alternativ ``--upgrade`` som gör att den installerar den medföljande kopian av ``pip`` om den befintliga installerade versionen av ``pip`` är äldre än den medföljande kopian.

source: The new :mod:`enum` module (defined in :pep:`435`) provides a standard implementation of enumeration types, allowing other modules (such as :mod:`socket`) to provide more informative error messages and better debugging support by replacing opaque integer constants with backwards compatible enumeration values.
sv: Den nya modulen :mod:`enum` (definierad i :pep:`435`) ger en standardimplementering av uppräkningstyper, vilket gör att andra moduler (t.ex. :mod:`socket`) kan ge mer informativa felmeddelanden och bättre felsökningsstöd genom att ersätta opaka heltalskonstanter med bakåtkompatibla uppräkningsvärden.

source: :pep:`435` -- Adding an Enum type to the Python standard library
sv: :pep:`435` -- Lägga till en Enum-typ i Pythons standardbibliotek

source: PEP written by Barry Warsaw, Eli Bendersky and Ethan Furman, implemented by Ethan Furman.
sv: PEP skriven av Barry Warsaw, Eli Bendersky och Ethan Furman, implementerad av Ethan Furman.

source: pathlib
sv: sökväg

source: The new :mod:`pathlib` module offers classes representing filesystem paths with semantics appropriate for different operating systems. Path classes are divided between *pure paths*, which provide purely computational operations without I/O, and *concrete paths*, which inherit from pure paths but also provide I/O operations.
sv: Den nya modulen :mod:`pathlib` erbjuder klasser som representerar sökvägar i filsystemet med semantik som är lämplig för olika operativsystem. Sökvägsklasserna är uppdelade i *rena sökvägar*, som tillhandahåller rena beräkningsoperationer utan I/O, och *konkreta sökvägar*, som ärver från rena sökvägar men också tillhandahåller I/O-operationer.

source: :pep:`428` -- The pathlib module -- object-oriented filesystem paths
sv: :pep:`428` -- Pathlib-modulen -- objektorienterade sökvägar i filsystemet

source: PEP written and implemented by Antoine Pitrou.
sv: PEP skrivet och genomfört av Antoine Pitrou.

source: selectors
sv: väljare

source: The new :mod:`selectors` module (created as part of implementing :pep:`3156`) allows high-level and efficient I/O multiplexing, built upon the :mod:`select` module primitives.
sv: Den nya modulen :mod:`selectors` (skapad som en del av implementeringen av :pep:`3156`) möjliggör högnivå och effektiv I/O-multiplexering, byggd på :mod:`select`-modulens primitiver.

source: statistics
sv: statistik

source: The new :mod:`statistics` module (defined in :pep:`450`) offers some core statistics functionality directly in the standard library. This module supports calculation of the mean, median, mode, variance and standard deviation of a data series.
sv: Den nya modulen :mod:`statistics` (definierad i :pep:`450`) erbjuder en del grundläggande statistikfunktioner direkt i standardbiblioteket. Denna modul stöder beräkning av medelvärde, median, läge, varians och standardavvikelse för en dataserie.

source: :pep:`450` -- Adding A Statistics Module To The Standard Library
sv: :pep:`450` -- Lägga till en statistikmodul i standardbiblioteket

source: PEP written and implemented by Steven D'Aprano
sv: PEP skrivet och implementerat av Steven D'Aprano

source: The new :mod:`tracemalloc` module (defined in :pep:`454`) is a debug tool to trace memory blocks allocated by Python. It provides the following information:
sv: Den nya modulen :mod:`tracemalloc` (definierad i :pep:`454`) är ett felsökningsverktyg för att spåra minnesblock som allokerats av Python. Den ger följande information:

source: Trace where an object was allocated
sv: Spåra var ett objekt allokerades

source: Statistics on allocated memory blocks per filename and per line number: total size, number and average size of allocated memory blocks
sv: Statistik över allokerade minnesblock per filnamn och radnummer: total storlek, antal och genomsnittlig storlek på allokerade minnesblock

source: Compute the differences between two snapshots to detect memory leaks
sv: Beräkna skillnaderna mellan två ögonblicksbilder för att upptäcka minnesläckor

source: :pep:`454` -- Add a new tracemalloc module to trace Python memory allocations
sv: :pep:`454` -- Lägg till en ny tracemalloc-modul för att spåra Python-minnesallokeringar

source: PEP written and implemented by Victor Stinner
sv: PEP skrivet och implementerat av Victor Stinner

source: Improved Modules
sv: Förbättrade moduler

source: New function :func:`abc.get_cache_token` can be used to know when to invalidate caches that are affected by changes in the object graph. (Contributed by Łukasz Langa in :issue:`16832`.)
sv: Ny funktion :func:`abc.get_cache_token` kan användas för att veta när cacher som påverkas av ändringar i objektgrafen ska ogiltigförklaras. (Bidrag från Łukasz Langa i :issue:`16832`.)

source: New class :class:`~abc.ABC` has :class:`~abc.ABCMeta` as its meta class. Using ``ABC`` as a base class has essentially the same effect as specifying ``metaclass=abc.ABCMeta``, but is simpler to type and easier to read. (Contributed by Bruno Dupuis in :issue:`16049`.)
sv: Den nya klassen :class:`~abc.ABC` har :class:`~abc.ABCMeta` som metaklass. Att använda ``ABC`` som basklass har i stort sett samma effekt som att ange ``metaclass=abc.ABCMeta``, men är enklare att skriva och lättare att läsa. (Bidrag från Bruno Dupuis i :issue:`16049`.)

source: The :meth:`!getparams` method now returns a namedtuple rather than a plain tuple. (Contributed by Claudiu Popa in :issue:`17818`.)
sv: Metoden :meth:`!getparams` returnerar nu en namngiven tupel istället för en vanlig tupel. (Bidrag från Claudiu Popa i :issue:`17818`.)

source: :func:`!aifc.open` now supports the context management protocol: when used in a :keyword:`with` block, the :meth:`!close` method of the returned object will be called automatically at the end of the block. (Contributed by Serhiy Storchacha in :issue:`16486`.)
sv: :func:`!aifc.open` har nu stöd för kontexthanteringsprotokollet: när det används i ett :keyword:`with`-block kommer :meth:`!close`-metoden för det returnerade objektet att anropas automatiskt i slutet av blocket. (Bidrag från Serhiy Storchacha i :issue:`16486`.)

source: The :meth:`!writeframesraw` and :meth:`!writeframes` methods now accept any :term:`bytes-like object`. (Contributed by Serhiy Storchaka in :issue:`8311`.)
sv: Metoderna :meth:`!writeframesraw` och :meth:`!writeframes` accepterar nu alla :term:`bytes-liknande objekt`. (Bidrag från Serhiy Storchaka i :issue:`8311`.)

source: The :class:`~argparse.FileType` class now accepts *encoding* and *errors* arguments, which are passed through to :func:`open`. (Contributed by Lucas Maystre in :issue:`11175`.)
sv: Klassen :class:`~argparse.FileType` accepterar nu *encoding* och *errors* argument, som skickas vidare till :func:`open`. (Bidrag från Lucas Maystre i :issue:`11175`.)

source: :mod:`!audioop` now supports 24-bit samples. (Contributed by Serhiy Storchaka in :issue:`12866`.)
sv: :mod:`!audioop` stöder nu 24-bitars samplingar. (Bidrag från Serhiy Storchaka i :issue:`12866`.)

source: New :func:`!byteswap` function converts big-endian samples to little-endian and vice versa. (Contributed by Serhiy Storchaka in :issue:`19641`.)
sv: Ny :func:`!byteswap`-funktion konverterar big-endian-samplingar till little-endian och vice versa. (Bidrag från Serhiy Storchaka i :issue:`19641`.)

source: All :mod:`!audioop` functions now accept any :term:`bytes-like object`. Strings are not accepted: they didn't work before, now they raise an error right away. (Contributed by Serhiy Storchaka in :issue:`16685`.)
sv: Alla :mod:`!audioop`-funktioner accepterar nu alla :term:`bytesliknande objekt`. Strängar accepteras inte: de fungerade inte tidigare, nu ger de upphov till ett fel direkt. (Bidrag från Serhiy Storchaka i :issue:`16685`.)

source: base64
sv: bas64

source: The encoding and decoding functions in :mod:`base64` now accept any :term:`bytes-like object` in cases where it previously required a :class:`bytes` or :class:`bytearray` instance. (Contributed by Nick Coghlan in :issue:`17839`.)
sv: Kodnings- och avkodningsfunktionerna i :mod:`base64` accepterar nu alla :term:`bytesliknande objekt` i fall där det tidigare krävdes en instans av :class:`bytes` eller :class:`bytearray`. (Bidrag från Nick Coghlan i :issue:`17839`.)

source: New functions :func:`~base64.a85encode`, :func:`~base64.a85decode`, :func:`~base64.b85encode`, and :func:`~base64.b85decode` provide the ability to encode and decode binary data from and to ``Ascii85`` and the git/mercurial ``Base85`` formats, respectively. The ``a85`` functions have options that can be used to make them compatible with the variants of the ``Ascii85`` encoding, including the Adobe variant. (Contributed by Martin Morrison, the Mercurial project, Serhiy Storchaka, and Antoine Pitrou in :issue:`17618`.)
sv: Nya funktioner :func:`~base64.a85encode`, :func:`~base64.a85decode`, :func:`~base64.b85encode`, och :func:`~base64.b85decode` ger möjlighet att koda och avkoda binärdata från och till ``Ascii85`` respektive git/mercurial ``Base85``-formaten. Funktionerna i ``a85`` har alternativ som kan användas för att göra dem kompatibla med olika varianter av kodningen ``Ascii85``, inklusive Adobe-varianten. (Bidrag från Martin Morrison, Mercurial-projektet, Serhiy Storchaka och Antoine Pitrou i :issue:`17618`.)

source: collections
sv: samlingar

source: The :meth:`.ChainMap.new_child` method now accepts an *m* argument specifying the child map to add to the chain. This allows an existing mapping and/or a custom mapping type to be used for the child. (Contributed by Vinay Sajip in :issue:`16613`.)
sv: Metoden :meth:`.ChainMap.new_child` accepterar nu ett *m*-argument som anger den underordnade mappningen som ska läggas till i kedjan. Detta gör att en befintlig mappning och/eller en anpassad mappningstyp kan användas för barnet. (Bidrag från Vinay Sajip i :issue:`16613`.)

source: colorsys
sv: färgämnen

source: The number of digits in the coefficients for the RGB --- YIQ conversions have been expanded so that they match the FCC NTSC versions. The change in results should be less than 1% and may better match results found elsewhere. (Contributed by Brian Landers and Serhiy Storchaka in :issue:`14323`.)
sv: Antalet siffror i koefficienterna för RGB --- YIQ-konverteringarna har utökats så att de stämmer överens med FCC NTSC-versionerna. Förändringen i resultat bör vara mindre än 1% a och kan bättre matcha resultat som finns på andra ställen. (Bidrag från Brian Landers och Serhiy Storchaka i :issue:`14323`.)

source: The new :class:`contextlib.suppress` context manager helps to clarify the intent of code that deliberately suppresses exceptions from a single statement. (Contributed by Raymond Hettinger in :issue:`15806` and Zero Piraeus in :issue:`19266`.)
sv: Den nya :class:`contextlib.suppress` kontexthanteraren hjälper till att klargöra avsikten med kod som avsiktligt undertrycker undantag från ett enda uttalande. (Bidrag från Raymond Hettinger i :issue:`15806` och Zero Piraeus i :issue:`19266`.)

source: The new :func:`contextlib.redirect_stdout` context manager makes it easier for utility scripts to handle inflexible APIs that write their output to :data:`sys.stdout` and don't provide any options to redirect it. Using the context manager, the :data:`sys.stdout` output can be redirected to any other stream or, in conjunction with :class:`io.StringIO`, to a string. The latter can be especially useful, for example, to capture output from a function that was written to implement a command line interface. It is recommended only for utility scripts because it affects the global state of :data:`sys.stdout`. (Contributed by Raymond Hettinger in :issue:`15805`.)
sv: Den nya kontexthanteraren :func:`contextlib.redirect_stdout` gör det enklare för verktygsskript att hantera oflexibla API:er som skriver utdata till :data:`sys.stdout` och inte ger några alternativ för att omdirigera den. Med hjälp av kontexthanteraren kan utdata från :data:`sys.stdout` omdirigeras till valfri annan ström eller, i kombination med :class:`io.StringIO`, till en sträng. Det senare kan vara särskilt användbart, till exempel för att fånga utdata från en funktion som skrevs för att implementera ett kommandoradsgränssnitt. Det rekommenderas endast för verktygsskript eftersom det påverkar det globala tillståndet för :data:`sys.stdout`. (Bidrag från Raymond Hettinger i :issue:`15805`.)

source: The :mod:`contextlib` documentation has also been updated to include a :ref:`discussion <single-use-reusable-and-reentrant-cms>` of the differences between single use, reusable and reentrant context managers.
sv: Dokumentationen :mod:`contextlib` har också uppdaterats med en :ref:`discussion <single-use-reusable-and-reentrant-cms>` om skillnaderna mellan single use, reusable och reentrant context managers.

source: :func:`dbm.open` objects now support the context management protocol. When used in a :keyword:`with` statement, the ``close`` method of the database object will be called automatically at the end of the block. (Contributed by Claudiu Popa and Nick Coghlan in :issue:`19282`.)
sv: :func:`dbm.open`-objekt har nu stöd för kontexthanteringsprotokollet. När det används i en :keyword:`with`-sats kommer databasobjektets ``close``-metod att anropas automatiskt i slutet av blocket. (Bidrag från Claudiu Popa och Nick Coghlan i :issue:`19282`.)

source: Functions :func:`~dis.show_code`, :func:`~dis.dis`, :func:`~dis.distb`, and :func:`~dis.disassemble` now accept a keyword-only *file* argument that controls where they write their output.
sv: Funktionerna :func:`~dis.show_code`, :func:`~dis.dis`, :func:`~dis.distb` och :func:`~dis.disassemble` accepterar nu ett *file*-argument som endast innehåller nyckelord och som styr var de skriver sina utdata.
