Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: When the Python interpreter starts in :ref:`interactive mode <tut-interactive>`, it checks for an :data:`~sys.__interactivehook__` attribute on the :mod:`sys` module. If the attribute exists, its value is called with no arguments just before interactive mode is started. The check is made after the :envvar:`PYTHONSTARTUP` file is read, so it can be set there. The :mod:`site` module :ref:`sets it <rlcompleter-config>` to a function that enables tab completion and history saving (in :file:`~/.python-history`) if the platform supports :mod:`readline`. If you do not want this (new) behavior, you can override it in :envvar:`PYTHONSTARTUP`, :mod:`sitecustomize`, or :mod:`usercustomize` by deleting this attribute from :mod:`sys` (or setting it to some other callable). (Contributed by Éric Araujo and Antoine Pitrou in :issue:`5845`.)
sv: När Python-tolken startar i :ref:`interaktivt läge <tut-interactive>`, kontrollerar den om det finns ett :data:`~sys.__interactivehook__`-attribut i :mod:`sys`-modulen. Om attributet finns anropas dess värde utan argument precis innan det interaktiva läget startas. Kontrollen görs efter att filen :envvar:`PYTHONSTARTUP` har lästs, så det kan ställas in där. Modulen :mod:`site` :ref:`sets it <rlcompleter-config>` till en funktion som möjliggör tabbkomplettering och historiksparande (i :file:`~/.python-history`) om plattformen stöder :mod:`readline`. Om du inte vill ha det här (nya) beteendet kan du åsidosätta det i :envvar:`PYTHONSTARTUP`, :mod:`sitecustomize` eller :mod:`usercustomize` genom att ta bort det här attributet från :mod:`sys` (eller ställa in det på någon annan callable). (Bidrag från Éric Araujo och Antoine Pitrou i :issue:`5845`.)

source: tarfile
sv: tarfil

source: The :mod:`tarfile` module now supports a simple :ref:`tarfile-commandline` when called as a script directly or via ``-m``. This can be used to create and extract tarfile archives. (Contributed by Berker Peksag in :issue:`13477`.)
sv: Modulen :mod:`tarfile` har nu stöd för en enkel :ref:`tarfile-commandline` när den anropas som ett skript direkt eller via ``-m``. Detta kan användas för att skapa och extrahera tarfile-arkiv. (Bidrag från Berker Peksag i :issue:`13477`.)

source: textwrap
sv: textbrytning

source: The :class:`~textwrap.TextWrapper` class has two new attributes/constructor arguments: :attr:`~textwrap.TextWrapper.max_lines`, which limits the number of lines in the output, and :attr:`~textwrap.TextWrapper.placeholder`, which is a string that will appear at the end of the output if it has been truncated because of *max_lines*. Building on these capabilities, a new convenience function :func:`~textwrap.shorten` collapses all of the whitespace in the input to single spaces and produces a single line of a given *width* that ends with the *placeholder* (by default, ``[...]``). (Contributed by Antoine Pitrou and Serhiy Storchaka in :issue:`18585` and :issue:`18725`.)
sv: Klassen :class:`~textwrap.TextWrapper` har två nya attribut/konstruktörsargument: :attr:`~textwrap.TextWrapper.max_lines`, som begränsar antalet rader i utdata, och :attr:`~textwrap.TextWrapper.placeholder`, som är en sträng som kommer att visas i slutet av utdata om den har avkortats på grund av *max_lines*. En ny bekvämlighetsfunktion :func:`~textwrap.shorten` bygger vidare på dessa möjligheter och komprimerar alla blanksteg i indata till enstaka blanksteg och producerar en enda rad med en given *bredd* som slutar med *platshållaren* (som standard ``[...]``). (Bidrag från Antoine Pitrou och Serhiy Storchaka i :issue:`18585` och :issue:`18725`.)

source: threading
sv: gängning

source: The :class:`~threading.Thread` object representing the main thread can be obtained from the new :func:`~threading.main_thread` function. In normal conditions this will be the thread from which the Python interpreter was started. (Contributed by Andrew Svetlov in :issue:`18882`.)
sv: Objektet :class:`~threading.Thread` som representerar huvudtråden kan erhållas från den nya funktionen :func:`~threading.main_thread`. Under normala förhållanden kommer detta att vara den tråd från vilken Python-tolken startades. (Bidrag från Andrew Svetlov i :issue:`18882`.)

source: traceback
sv: spårning

source: A new :func:`traceback.clear_frames` function takes a traceback object and clears the local variables in all of the frames it references, reducing the amount of memory consumed. (Contributed by Andrew Kuchling in :issue:`1565525`.)
sv: En ny :func:`traceback.clear_frames`-funktion tar ett traceback-objekt och rensar de lokala variablerna i alla de frames som den refererar till, vilket minskar mängden minne som förbrukas. (Bidrag från Andrew Kuchling i :issue:`1565525`.)

source: types
sv: typer

source: A new :func:`~types.DynamicClassAttribute` descriptor provides a way to define an attribute that acts normally when looked up through an instance object, but which is routed to the *class* ``__getattr__`` when looked up through the class. This allows one to have properties active on a class, and have virtual attributes on the class with the same name (see :mod:`Enum` for an example). (Contributed by Ethan Furman in :issue:`19030`.)
sv: En ny :func:`~types.DynamicClassAttribute`-deskriptor ger möjlighet att definiera ett attribut som fungerar normalt när det söks upp via ett instansobjekt, men som dirigeras till *klassen* ``__getattr__`` när det söks upp via klassen. Detta gör att man kan ha egenskaper som är aktiva på en klass och ha virtuella attribut på klassen med samma namn (se :mod:`Enum` för ett exempel). (Bidrag från Ethan Furman i :issue:`19030`.)

source: :mod:`urllib.request` now supports ``data:`` URLs via the :class:`~urllib.request.DataHandler` class. (Contributed by Mathias Panzenböck in :issue:`16423`.)
sv: :mod:`urllib.request` stöder nu ``data:`` URL:er via :class:`~urllib.request.DataHandler`-klassen. (Bidrag från Mathias Panzenböck i :issue:`16423`.)

source: The http method that will be used by a :class:`~urllib.request.Request` class can now be specified by setting a :class:`~urllib.request.Request.method` class attribute on the subclass. (Contributed by Jason R Coombs in :issue:`18978`.)
sv: Den http-metod som kommer att användas av en :class:`~urllib.request.Request`-klass kan nu specificeras genom att ange ett :class:`~urllib.request.Request.method`-klassattribut på underklassen. (Bidrag från Jason R Coombs i :issue:`18978`.)

source: :class:`~urllib.request.Request` objects are now reusable: if the :attr:`~urllib.request.Request.full_url` or :attr:`~urllib.request.Request.data` attributes are modified, all relevant internal properties are updated. This means, for example, that it is now possible to use the same :class:`~urllib.request.Request` object in more than one :meth:`.OpenerDirector.open` call with different *data* arguments, or to modify a :class:`~urllib.request.Request`\ 's ``url`` rather than recomputing it from scratch. There is also a new :meth:`~urllib.request.Request.remove_header` method that can be used to remove headers from a :class:`~urllib.request.Request`. (Contributed by Alexey Kachayev in :issue:`16464`, Daniel Wozniak in :issue:`17485`, and Damien Brecht and Senthil Kumaran in :issue:`17272`.)
sv: :class:`~urllib.request.Request`-objekt är nu återanvändbara: om attributen :attr:`~urllib.request.Request.full_url` eller :attr:`~urllib.request.Request.data` ändras, uppdateras alla relevanta interna egenskaper. Detta innebär t.ex. att det nu är möjligt att använda samma :class:`~urllib.request.request`-objekt i mer än ett :meth:`.OpenerDirector.open`-anrop med olika *data*-argument, eller att modifiera en :class:`~urllib.request.request`'s ``url`` i stället för att beräkna den från början. Det finns också en ny :meth:`~urllib.request.Request.remove_header`-metod som kan användas för att ta bort headers från en :class:`~urllib.request.Request`. (Bidrag från Alexey Kachayev i :issue:`16464`, Daniel Wozniak i :issue:`17485`, och Damien Brecht och Senthil Kumaran i :issue:`17272`.)

source: :class:`~urllib.error.HTTPError` objects now have a :attr:`~urllib.error.HTTPError.headers` attribute that provides access to the HTTP response headers associated with the error. (Contributed by Berker Peksag in :issue:`15701`.)
sv: :class:`~urllib.error.HTTPError`-objekt har nu ett :attr:`~urllib.error.HTTPError.headers`-attribut som ger tillgång till de HTTP-svarshuvuden som är associerade med felet. (Bidrag från Berker Peksag i :issue:`15701`.)

source: The :class:`~unittest.TestCase` class has a new method, :meth:`~unittest.TestCase.subTest`, that produces a context manager whose :keyword:`with` block becomes a "sub-test". This context manager allows a test method to dynamically generate subtests by, say, calling the ``subTest`` context manager inside a loop. A single test method can thereby produce an indefinite number of separately identified and separately counted tests, all of which will run even if one or more of them fail. For example::
sv: Klassen :class:`~unittest.TestCase` har en ny metod, :meth:`~unittest.TestCase.subTest`, som producerar en kontexthanterare vars :keyword:`with`-block blir ett "sub-test". Denna kontexthanterare gör det möjligt för en testmetod att dynamiskt generera undertest genom att t.ex. anropa kontexthanteraren ``subTest`` i en loop. En enda testmetod kan därmed producera ett obegränsat antal separat identifierade och separat räknade tester, som alla kommer att köras även om ett eller flera av dem misslyckas. Till exempel::

source: class NumbersTest(unittest.TestCase): def test_even(self): for i in range(6): with self.subTest(i=i): self.assertEqual(i % 2, 0)
sv: klass NumbersTest(unittest.TestCase): def test_even(self): för i i intervall(6): med self.subTest(i=i): self.assertEqual(i % 2, 0)

source: will result in six subtests, each identified in the unittest verbose output with a label consisting of the variable name ``i`` and a particular value for that variable (``i=0``, ``i=1``, etc). See :ref:`subtests` for the full version of this example. (Contributed by Antoine Pitrou in :issue:`16997`.)
sv: kommer att resultera i sex deltester, var och en identifierad i unittest verbose-utdata med en etikett som består av variabelnamnet ``i`` och ett visst värde för den variabeln (``i=0``, ``i=1``, etc). Se :ref:`subtests` för den fullständiga versionen av detta exempel. (Bidrag från Antoine Pitrou i :issue:`16997`.)

source: :func:`unittest.main` now accepts an iterable of test names for *defaultTest*, where previously it only accepted a single test name as a string. (Contributed by Jyrki Pulliainen in :issue:`15132`.)
sv: :func:`unittest.main` accepterar nu en iterabel av testnamn för *defaultTest*, där den tidigare endast accepterade ett enda testnamn som en sträng. (Bidrag från Jyrki Pulliainen i :issue:`15132`.)

source: If :class:`~unittest.SkipTest` is raised during test discovery (that is, at the module level in the test file), it is now reported as a skip instead of an error. (Contributed by Zach Ware in :issue:`16935`.)
sv: Om :class:`~unittest.SkipTest` aktiveras under testupptäckt (dvs. på modulnivå i testfilen), rapporteras det nu som en skip istället för ett fel. (Bidrag från Zach Ware i :issue:`16935`.)

source: :meth:`~unittest.TestLoader.discover` now sorts the discovered files to provide consistent test ordering. (Contributed by Martin Melin and Jeff Ramnani in :issue:`16709`.)
sv: :meth:`~unittest.TestLoader.discover` sorterar nu de upptäckta filerna för att ge konsekvent testordning. (Bidrag från Martin Melin och Jeff Ramnani i :issue:`16709`.)

source: :class:`~unittest.TestSuite` now drops references to tests as soon as the test has been run, if the test is successful. On Python interpreters that do garbage collection, this allows the tests to be garbage collected if nothing else is holding a reference to the test. It is possible to override this behavior by creating a :class:`~unittest.TestSuite` subclass that defines a custom ``_removeTestAtIndex`` method. (Contributed by Tom Wardill, Matt McClure, and Andrew Svetlov in :issue:`11798`.)
sv: :class:`~unittest.TestSuite` släpper nu referenser till tester så snart testet har körts, om testet är framgångsrikt. På Python-tolkar som gör garbage collection, gör detta att testerna kan garbage collectas om inget annat har en referens till testet. Det är möjligt att åsidosätta detta beteende genom att skapa en :class:`~unittest.TestSuite`-underklass som definierar en anpassad ``_removeTestAtIndex``-metod. (Bidrag från Tom Wardill, Matt McClure och Andrew Svetlov i :issue:`11798`.)

source: A new test assertion context-manager, :meth:`~unittest.TestCase.assertLogs`, will ensure that a given block of code emits a log message using the :mod:`logging` module. By default the message can come from any logger and have a priority of ``INFO`` or higher, but both the logger name and an alternative minimum logging level may be specified. The object returned by the context manager can be queried for the :class:`~logging.LogRecord`\ s and/or formatted messages that were logged. (Contributed by Antoine Pitrou in :issue:`18937`.)
sv: En ny kontexthanterare för testpåståenden, :meth:`~unittest.TestCase.assertLogs`, säkerställer att ett visst kodblock skickar ett loggmeddelande med modulen :mod:`logging`. Som standard kan meddelandet komma från vilken logger som helst och ha en prioritet på ``INFO`` eller högre, men både loggarens namn och en alternativ lägsta loggningsnivå kan anges. Objektet som returneras av kontexthanteraren kan efterfrågas för :class:`~logging.LogRecord` s och/eller formaterade meddelanden som loggades. (Bidrag från Antoine Pitrou i :issue:`18937`.)

source: Test discovery now works with namespace packages (Contributed by Claudiu Popa in :issue:`17457`.)
sv: Test discovery fungerar nu med namespace-paket (Bidrag från Claudiu Popa i :issue:`17457`.)

source: :mod:`unittest.mock` objects now inspect their specification signatures when matching calls, which means an argument can now be matched by either position or name, instead of only by position. (Contributed by Antoine Pitrou in :issue:`17015`.)
sv: :mod:`unittest.mock`-objekt inspekterar nu sina specifikationssignaturer när de matchar anrop, vilket innebär att ett argument nu kan matchas med antingen position eller namn, istället för bara med position. (Bidrag från Antoine Pitrou i :issue:`17015`.)

source: :func:`~mock.mock_open` objects now have ``readline`` and ``readlines`` methods. (Contributed by Toshio Kuratomi in :issue:`17467`.)
sv: :func:`~mock.mock_open`-objekt har nu metoderna ``readline`` och ``readlines``. (Bidrag från Toshio Kuratomi i :issue:`17467`.)

source: venv
sv: ven

source: :mod:`venv` now includes activation scripts for the ``csh`` and ``fish`` shells. (Contributed by Andrew Svetlov in :issue:`15417`.)
sv: :mod:`venv` innehåller nu aktiveringsskript för skalen ``csh`` och ``fish``. (Bidrag från Andrew Svetlov i :issue:`15417`.)

source: :class:`~venv.EnvBuilder` and the :func:`~venv.create` convenience function take a new keyword argument *with_pip*, which defaults to ``False``, that controls whether or not :class:`~venv.EnvBuilder` ensures that ``pip`` is installed in the virtual environment. (Contributed by Nick Coghlan in :issue:`19552` as part of the :pep:`453` implementation.)
sv: :class:`~venv.EnvBuilder` och bekvämlighetsfunktionen :func:`~venv.create` tar ett nytt nyckelordsargument *with_pip*, som standard är ``False``, som kontrollerar om :class:`~venv.EnvBuilder` säkerställer att ``pip`` är installerat i den virtuella miljön eller inte. (Bidrag från Nick Coghlan i :issue:`19552` som en del av :pep:`453`-implementationen)

source: wave
sv: våg

source: The :meth:`~wave.getparams` method now returns a namedtuple rather than a plain tuple. (Contributed by Claudiu Popa in :issue:`17487`.)
sv: Metoden :meth:`~wave.getparams` returnerar nu en namedtuple istället för en vanlig tuple. (Bidrag från Claudiu Popa i :issue:`17487`.)

source: :meth:`wave.open` now supports the context management protocol. (Contributed by Claudiu Popa in :issue:`17616`.)
sv: :meth:`wave.open` stöder nu protokollet för kontexthantering. (Bidrag från Claudiu Popa i :issue:`17616`.)

source: :mod:`wave` can now :ref:`write output to unseekable files <wave-write-objects>`. (Contributed by David Jones, Guilherme Polo, and Serhiy Storchaka in :issue:`5202`.)
sv: :mod:`wave` kan nu :ref:`skriva utdata till filer som inte kan sökas <wave-write-objects>`. (Bidrag från David Jones, Guilherme Polo och Serhiy Storchaka i :issue:`5202`.)

source: The :meth:`~wave.Wave_write.writeframesraw` and :meth:`~wave.Wave_write.writeframes` methods now accept any :term:`bytes-like object`. (Contributed by Serhiy Storchaka in :issue:`8311`.)
sv: Metoderna :meth:`~wave.Wave_write.writeframesraw` och :meth:`~wave.Wave_write.writeframes` accepterar nu alla :term:`bytes-liknande objekt`. (Bidrag från Serhiy Storchaka i :issue:`8311`.)

source: weakref
sv: svagref

source: New :class:`~weakref.WeakMethod` class simulates weak references to bound methods. (Contributed by Antoine Pitrou in :issue:`14631`.)
sv: Ny :class:`~weakref.WeakMethod`-klass simulerar svaga referenser till bundna metoder. (Bidrag från Antoine Pitrou i :issue:`14631`.)

source: New :class:`~weakref.finalize` class makes it possible to register a callback to be invoked when an object is garbage collected, without needing to carefully manage the lifecycle of the weak reference itself. (Contributed by Richard Oudkerk in :issue:`15528`.)
sv: Ny :class:`~weakref.finalize`-klass gör det möjligt att registrera en återuppringning som ska anropas när ett objekt samlas in, utan att behöva hantera livscykeln för själva den svaga referensen. (Bidrag från Richard Oudkerk i :issue:`15528`.)

source: The callback, if any, associated with a :class:`~weakref.ref` is now exposed via the :attr:`~weakref.ref.__callback__` attribute. (Contributed by Mark Dickinson in :issue:`17643`.)
sv: Den eventuella återuppringning som är associerad med en :class:`~weakref.ref` visas nu via attributet :attr:`~weakref.ref.__callback__`. (Bidrag från Mark Dickinson i :issue:`17643`.)

source: A new parser, :class:`~xml.etree.ElementTree.XMLPullParser`, allows a non-blocking applications to parse XML documents. An example can be seen at :ref:`elementtree-pull-parsing`. (Contributed by Antoine Pitrou in :issue:`17741`.)
sv: En ny parser, :class:`~xml.etree.ElementTree.XMLPullParser`, gör det möjligt för en icke-blockerande applikation att parsa XML-dokument. Ett exempel kan ses på :ref:`elementtree-pull-parsing`. (Bidrag från Antoine Pitrou i :issue:`17741`.)

source: The :mod:`xml.etree.ElementTree` :func:`~xml.etree.ElementTree.tostring` and :func:`~xml.etree.ElementTree.tostringlist` functions, and the :class:`~xml.etree.ElementTree.ElementTree` :meth:`~xml.etree.ElementTree.ElementTree.write` method, now have a *short_empty_elements* :ref:`keyword-only parameter <keyword-only_parameter>` providing control over whether elements with no content are written in abbreviated (``<tag />``) or expanded (``<tag></tag>``) form. (Contributed by Ariel Poliak and Serhiy Storchaka in :issue:`14377`.)
sv: Funktionerna :mod:`xml.etree.ElementTree` :func:`~xml.etree.ElementTree.tostring` och :func:`~xml.etree.ElementTree.tostringlist`, samt :class:`~xml.etree.ElementTree.ElementTree` :meth:`~xml.etree.ElementTree.ElementTree.write` method, har nu en *short_empty_elements* :ref:``keyword-only parameter <keyword-only_parameter>` som ger kontroll över om element utan innehåll skrivs i förkortad (``<tag />``) eller utökad (``<tag></tag>``) form. (Bidrag från Ariel Poliak och Serhiy Storchaka i :issue:`14377`.)

source: zipfile
sv: zip-fil

source: The :meth:`~zipfile.PyZipFile.writepy` method of the :class:`~zipfile.PyZipFile` class has a new *filterfunc* option that can be used to control which directories and files are added to the archive. For example, this could be used to exclude test files from the archive. (Contributed by Christian Tismer in :issue:`19274`.)
sv: Metoden :meth:`~zipfile.PyZipFile.writepy` i klassen :class:`~zipfile.PyZipFile` har ett nytt alternativ *filterfunc* som kan användas för att styra vilka kataloger och filer som läggs till i arkivet. Detta kan t.ex. användas för att utesluta testfiler från arkivet. (Bidrag från Christian Tismer i :issue:`19274`.)

source: The *allowZip64* parameter to :class:`~zipfile.ZipFile` and :class:`~zipfile.PyZipfile` is now ``True`` by default. (Contributed by William Mallard in :issue:`17201`.)
sv: Parametern *allowZip64* till :class:`~zipfile.ZipFile` och :class:`~zipfile.PyZipfile` är nu ``True`` som standard. (Bidrag från William Mallard i :issue:`17201`.)

source: CPython Implementation Changes
sv: Ändringar i CPython-implementeringen

source: PEP 445: Customization of CPython Memory Allocators
sv: PEP 445: Anpassning av CPythons minnesallokatorer

source: :pep:`445` adds new C level interfaces to customize memory allocation in the CPython interpreter.
sv: :pep:`445` lägger till nya gränssnitt på C-nivå för att anpassa minnesallokeringen i CPython-tolken.

source: :pep:`445` -- Add new APIs to customize Python memory allocators
sv: :pep:`445` -- Lägg till nya API:er för att anpassa Pythons minnesallokatorer

source: PEP 442: Safe Object Finalization
sv: PEP 442: Slutförande av säkert objekt

source: :pep:`442` removes the current limitations and quirks of object finalization in CPython. With it, objects with :meth:`__del__` methods, as well as generators with :keyword:`finally` clauses, can be finalized when they are part of a reference cycle.
sv: :pep:`442` tar bort de nuvarande begränsningarna och konstigheterna med objektavslut i CPython. Med den kan objekt med :meth:`__del__`-metoder, liksom generatorer med :keyword:`finally`-klausuler, slutföras när de är en del av en referenscykel.

source: As part of this change, module globals are no longer forcibly set to :const:`None` during interpreter shutdown in most cases, instead relying on the normal operation of the cyclic garbage collector. This avoids a whole class of interpreter-shutdown-time errors, usually involving ``__del__`` methods, that have plagued Python since the cyclic GC was first introduced.
sv: Som en del av denna förändring sätts modulglobaler inte längre med våld till :const:`None` under tolkens avstängning i de flesta fall, utan förlitar sig istället på den normala driften av den cykliska skräpsamlaren. Detta undviker en hel klass av tolkningsavstängningsfel, vanligtvis involverande ``__del__``-metoder, som har plågat Python sedan den cykliska GC först introducerades.

source: :pep:`442` -- Safe object finalization
sv: :pep:`442` -- Slutförande av säkert objekt

source: PEP 456: Secure and Interchangeable Hash Algorithm
sv: PEP 456: Säker och utbytbar hashalgoritm
