Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: :func:`pty.spawn` now returns the status value from :func:`os.waitpid` on the child process, instead of ``None``. (Contributed by Gregory P. Smith.)
sv: :func:`pty.spawn` returnerar nu statusvärdet från :func:`os.waitpid` på barnprocessen, istället för ``None``. (Bidrag från Gregory P. Smith.)

source: The :mod:`pydoc` module is now based directly on the :func:`inspect.signature` introspection API, allowing it to provide signature information for a wider variety of callable objects. This change also means that ``__wrapped__`` attributes are now taken into account when displaying help information. (Contributed by Larry Hastings in :issue:`19674`.)
sv: Modulen :mod:`pydoc` är nu baserad direkt på introspektions-API:t :func:`inspect.signature`, vilket gör att den kan tillhandahålla signaturinformation för ett större antal anropsbara objekt. Den här ändringen innebär också att ``__wrapped__``-attribut nu tas med i beräkningen när hjälpinformation visas. (Bidrag från Larry Hastings i :issue:`19674`.)

source: The :mod:`pydoc` module no longer displays the ``self`` parameter for already bound methods. Instead, it aims to always display the exact current signature of the supplied callable. (Contributed by Larry Hastings in :issue:`20710`.)
sv: Modulen :mod:`pydoc` visar inte längre parametern ``self`` för redan bundna metoder. Istället strävar den efter att alltid visa den exakta aktuella signaturen för den medföljande anropbara koden. (Bidrag från Larry Hastings i :issue:`20710`.)

source: In addition to the changes that have been made to :mod:`pydoc` directly, its handling of custom ``__dir__`` methods and various descriptor behaviours has also been improved substantially by the underlying changes in the :mod:`inspect` module.
sv: Förutom de ändringar som har gjorts i :mod:`pydoc` direkt, har dess hantering av anpassade ``__dir__``-metoder och olika beskrivningsbeteenden också förbättrats avsevärt genom de underliggande ändringarna i modulen :mod:`inspect`.

source: As the :func:`help` builtin is based on :mod:`pydoc`, the above changes also affect the behaviour of :func:`help`.
sv: Eftersom inbyggda :func:`help` baseras på :mod:`pydoc`, påverkar ovanstående ändringar även beteendet hos :func:`help`.

source: New :func:`~re.fullmatch` function and :meth:`.regex.fullmatch` method anchor the pattern at both ends of the string to match. This provides a way to be explicit about the goal of the match, which avoids a class of subtle bugs where ``$`` characters get lost during code changes or the addition of alternatives to an existing regular expression. (Contributed by Matthew Barnett in :issue:`16203`.)
sv: Nya :func:`~re.fullmatch`-funktionen och :meth:`.regex.fullmatch`-metoden förankrar mönstret i båda ändarna av den sträng som ska matchas. Detta ger ett sätt att vara explicit om målet med matchningen, vilket undviker en klass av subtila buggar där ``$``-tecken går förlorade under kodändringar eller tillägg av alternativ till ett befintligt reguljärt uttryck. (Bidrag från Matthew Barnett i :issue:`16203`.)

source: The repr of :ref:`regex objects <re-objects>` now includes the pattern and the flags; the repr of :ref:`match objects <match-objects>` now includes the start, end, and the part of the string that matched. (Contributed by Hugo Lopes Tavares and Serhiy Storchaka in :issue:`13592` and :issue:`17087`.)
sv: Återgivningen av :ref:`regex objects <re-objects>` innehåller nu mönstret och flaggorna; återgivningen av :ref:`match objects <match-objects>` innehåller nu början, slutet och den del av strängen som matchade. (Bidrag från Hugo Lopes Tavares och Serhiy Storchaka i :issue:`13592` och :issue:`17087`.)

source: resource
sv: resurs

source: New :func:`~resource.prlimit` function, available on Linux platforms with a kernel version of 2.6.36 or later and glibc of 2.13 or later, provides the ability to query or set the resource limits for processes other than the one making the call. (Contributed by Christian Heimes in :issue:`16595`.)
sv: Den nya funktionen :func:`~resource.prlimit`, tillgänglig på Linux-plattformar med en kärnversion av 2.6.36 eller senare och glibc av 2.13 eller senare, ger möjlighet att fråga efter eller ställa in resursgränser för andra processer än den som gör anropet. (Bidrag från Christian Heimes i :issue:`16595`.)

source: On Linux kernel version 2.6.36 or later, there are also some new Linux specific constants: :const:`~resource.RLIMIT_MSGQUEUE`, :const:`~resource.RLIMIT_NICE`, :const:`~resource.RLIMIT_RTPRIO`, :const:`~resource.RLIMIT_RTTIME`, and :const:`~resource.RLIMIT_SIGPENDING`. (Contributed by Christian Heimes in :issue:`19324`.)
sv: I Linux-kärnan version 2.6.36 eller senare finns det också några nya Linux-specifika konstanter: :const:`~resource.RLIMIT_MSGQUEUE`, :const:`~resource.RLIMIT_NICE`, :const:`~resource.RLIMIT_RTPRIO`, :const:`~resource.RLIMIT_RTTIME` och :const:`~resource.RLIMIT_SIGPENDING`. (Bidrag från Christian Heimes i :issue:`19324`.)

source: On FreeBSD version 9 and later, there some new FreeBSD specific constants: :const:`~resource.RLIMIT_SBSIZE`, :const:`~resource.RLIMIT_SWAP`, and :const:`~resource.RLIMIT_NPTS`. (Contributed by Claudiu Popa in :issue:`19343`.)
sv: På FreeBSD version 9 och senare finns det några nya FreeBSD-specifika konstanter: :const:`~resource.RLIMIT_SBSIZE`, :const:`~resource.RLIMIT_SWAP`, och :const:`~resource.RLIMIT_NPTS`. (Bidrag från Claudiu Popa i :issue:`19343`.)

source: select
sv: välj

source: :class:`~select.epoll` objects now support the context management protocol. When used in a :keyword:`with` statement, the :meth:`~select.epoll.close` method will be called automatically at the end of the block. (Contributed by Serhiy Storchaka in :issue:`16488`.)
sv: :class:`~select.epoll`-objekt har nu stöd för kontexthanteringsprotokollet. När det används i en :keyword:`with`-sats kommer :meth:`~select.epoll.close`-metoden att anropas automatiskt i slutet av blocket. (Bidrag från Serhiy Storchaka i :issue:`16488`.)

source: :class:`~select.devpoll` objects now have :meth:`~select.devpoll.fileno` and :meth:`~select.devpoll.close` methods, as well as a new attribute :attr:`~select.devpoll.closed`. (Contributed by Victor Stinner in :issue:`18794`.)
sv: :class:`~select.devpoll`-objekt har nu metoderna :meth:`~select.devpoll.fileno` och :meth:`~select.devpoll.close`, samt ett nytt attribut :attr:`~select.devpoll.closed`. (Bidrag från Victor Stinner i :issue:`18794`.)

source: shelve
sv: hylla

source: :class:`~shelve.Shelf` instances may now be used in :keyword:`with` statements, and will be automatically closed at the end of the :keyword:`!with` block. (Contributed by Filip Gruszczyński in :issue:`13896`.)
sv: :class:`~shelve.Shelf`-instanser kan nu användas i :keyword:`with`-satser, och kommer automatiskt att stängas i slutet av :keyword:`!with`-blocket. (Bidrag från Filip Gruszczyński i :issue:`13896`.)

source: :func:`~shutil.copyfile` now raises a specific :exc:`~shutil.Error` subclass, :exc:`~shutil.SameFileError`, when the source and destination are the same file, which allows an application to take appropriate action on this specific error. (Contributed by Atsuo Ishimoto and Hynek Schlawack in :issue:`1492704`.)
sv: :func:`~shutil.copyfile` ger nu upphov till en specifik :exc:`~shutil.Error`-underklass, :exc:`~shutil.SameFileError`, när källan och destinationen är samma fil, vilket gör det möjligt för ett program att vidta lämpliga åtgärder vid detta specifika fel. (Bidrag från Atsuo Ishimoto och Hynek Schlawack i :issue:`1492704`.)

source: The :class:`!SMTPServer` and :class:`!SMTPChannel` classes now accept a *map* keyword argument which, if specified, is passed in to :class:`!asynchat.async_chat` as its *map* argument. This allows an application to avoid affecting the global socket map. (Contributed by Vinay Sajip in :issue:`11959`.)
sv: Klasserna :class:`!SMTPServer` och :class:`!SMTPChannel` accepterar nu ett *map* nyckelordsargument som, om det anges, skickas in till :class:`!asynchat.async_chat` som dess *map* argument. Detta gör att ett program kan undvika att påverka den globala socketkartan. (Bidrag från Vinay Sajip i :issue:`11959`.)

source: :exc:`~smtplib.SMTPException` is now a subclass of :exc:`OSError`, which allows both socket level errors and SMTP protocol level errors to be caught in one try/except statement by code that only cares whether or not an error occurred. (Contributed by Ned Jackson Lovely in :issue:`2118`.)
sv: :exc:`~smtplib.SMTPException` är nu en underklass till :exc:`OSError`, vilket gör att både fel på socketnivå och fel på SMTP-protokollnivå kan fångas upp i en try/except-sats av kod som bara bryr sig om huruvida ett fel inträffade eller inte. (Bidrag från Ned Jackson Lovely i :issue:`2118`.)

source: socket
sv: kortplats

source: The socket module now supports the :const:`~socket.CAN_BCM` protocol on platforms that support it. (Contributed by Brian Thorne in :issue:`15359`.)
sv: Socket-modulen stöder nu :const:`~socket.CAN_BCM`-protokollet på plattformar som stöder det. (Bidrag från Brian Thorne i :issue:`15359`.)

source: Socket objects have new methods to get or set their :ref:`inheritable flag <fd_inheritance>`, :meth:`~socket.socket.get_inheritable` and :meth:`~socket.socket.set_inheritable`.
sv: Socket-objekt har nya metoder för att hämta eller ställa in sin :ref:`inheritable flag <fd_inheritance>`, :meth:`~socket.socket.get_inheritable` och :meth:`~socket.socket.set_inheritable`.

source: The ``socket.AF_*`` and ``socket.SOCK_*`` constants are now enumeration values using the new :mod:`enum` module. This allows meaningful names to be printed during debugging, instead of integer "magic numbers".
sv: Konstanterna ``socket.AF_*`` och ``socket.SOCK_*`` är nu uppräkningsvärden med hjälp av den nya modulen :mod:`enum`. Detta gör att meningsfulla namn kan skrivas ut under felsökning, istället för "magiska siffror" i heltal.

source: The :const:`~socket.AF_LINK` constant is now available on BSD and OSX.
sv: Konstanten :const:`~socket.AF_LINK` är nu tillgänglig på BSD och OSX.

source: :func:`~socket.inet_pton` and :func:`~socket.inet_ntop` are now supported on Windows. (Contributed by Atsuo Ishimoto in :issue:`7171`.)
sv: :func:`~socket.inet_pton` och :func:`~socket.inet_ntop` stöds nu i Windows. (Bidrag från Atsuo Ishimoto i :issue:`7171`.)

source: A new boolean parameter to the :func:`~sqlite3.connect` function, *uri*, can be used to indicate that the *database* parameter is a ``uri`` (see the `SQLite URI documentation <https://www.sqlite.org/uri.html>`_). (Contributed by poq in :issue:`13773`.)
sv: En ny boolesk parameter till funktionen :func:`~sqlite3.connect`, *uri*, kan användas för att indikera att parametern *database* är en ``uri`` (se `SQLite URI documentation <https://www.sqlite.org/uri.html>`_). (Bidrag från poq i :issue:`13773`.)

source: :data:`~ssl.PROTOCOL_TLSv1_1` and :data:`~ssl.PROTOCOL_TLSv1_2` (TLSv1.1 and TLSv1.2 support) have been added; support for these protocols is only available if Python is linked with OpenSSL 1.0.1 or later. (Contributed by Michele Orrù and Antoine Pitrou in :issue:`16692`.)
sv: :data:`~ssl.PROTOCOL_TLSv1_1` och :data:`~ssl.PROTOCOL_TLSv1_2` (stöd för TLSv1.1 och TLSv1.2) har lagts till; stöd för dessa protokoll är endast tillgängligt om Python är länkat med OpenSSL 1.0.1 eller senare. (Bidrag från Michele Orrù och Antoine Pitrou i :issue:`16692`.)

source: New function :func:`~ssl.create_default_context` provides a standard way to obtain an :class:`~ssl.SSLContext` whose settings are intended to be a reasonable balance between compatibility and security. These settings are more stringent than the defaults provided by the :class:`~ssl.SSLContext` constructor, and may be adjusted in the future, without prior deprecation, if best-practice security requirements change. The new recommended best practice for using stdlib libraries that support SSL is to use :func:`~ssl.create_default_context` to obtain an :class:`~ssl.SSLContext` object, modify it if needed, and then pass it as the *context* argument of the appropriate stdlib API. (Contributed by Christian Heimes in :issue:`19689`.)
sv: Den nya funktionen :func:`~ssl.create_default_context` tillhandahåller ett standardiserat sätt att erhålla en :class:`~ssl.SSLContext` vars inställningar är avsedda att vara en rimlig balans mellan kompatibilitet och säkerhet. Dessa inställningar är strängare än de standardinställningar som tillhandahålls av :class:`~ssl.SSLContext`-konstruktören och kan justeras i framtiden, utan föregående avskrivning, om säkerhetskraven för bästa praxis ändras. Den nya rekommenderade bästa praxis för att använda stdlib-bibliotek som stöder SSL är att använda :func:`~ssl.create_default_context` för att erhålla ett :class:`~ssl.SSLContext`-objekt, modifiera det vid behov och sedan skicka det som *context*-argumentet för lämpligt stdlib-API. (Bidrag från Christian Heimes i :issue:`19689`.)

source: :class:`~ssl.SSLContext` method :meth:`~ssl.SSLContext.load_verify_locations` accepts a new optional argument *cadata*, which can be used to provide PEM or DER encoded certificates directly via strings or bytes, respectively. (Contributed by Christian Heimes in :issue:`18138`.)
sv: :class:`~ssl.SSLContext` method :meth:`~ssl.SSLContext.load_verify_locations` accepterar ett nytt valfritt argument *cadata*, som kan användas för att tillhandahålla PEM- eller DER-kodade certifikat direkt via strängar respektive bytes. (Bidrag från Christian Heimes i :issue:`18138`.)

source: New function :func:`~ssl.get_default_verify_paths` returns a named tuple of the paths and environment variables that the :meth:`~ssl.SSLContext.set_default_verify_paths` method uses to set OpenSSL's default ``cafile`` and ``capath``. This can be an aid in debugging default verification issues. (Contributed by Christian Heimes in :issue:`18143`.)
sv: Den nya funktionen :func:`~ssl.get_default_verify_paths` returnerar en namngiven tupel av de sökvägar och miljövariabler som metoden :meth:`~ssl.SSLContext.set_default_verify_paths` använder för att ställa in OpenSSL:s standard ``cafile`` och ``capath``. Detta kan vara till hjälp vid felsökning av problem med standardverifiering. (Bidrag från Christian Heimes i :issue:`18143`.)

source: :class:`~ssl.SSLContext` has a new method, :meth:`~ssl.SSLContext.cert_store_stats`, that reports the number of loaded ``X.509`` certs, ``X.509 CA`` certs, and certificate revocation lists (``crl``\ s), as well as a :meth:`~ssl.SSLContext.get_ca_certs` method that returns a list of the loaded ``CA`` certificates. (Contributed by Christian Heimes in :issue:`18147`.)
sv: :class:`~ssl.SSLContext` har en ny metod, :meth:`~ssl.SSLContext.cert_store_stats`, som rapporterar antalet laddade ``X.509``-certifikat, ``X.509 CA``-certifikat och listor över återkallade certifikat (``crl``), samt en metod :meth:`~ssl.SSLContext.get_ca_certs` som returnerar en lista över laddade ``CA``-certifikat. (Bidrag från Christian Heimes i :issue:`18147`.)

source: If OpenSSL 0.9.8 or later is available, :class:`~ssl.SSLContext` has a new attribute :attr:`~ssl.SSLContext.verify_flags` that can be used to control the certificate verification process by setting it to some combination of the new constants :const:`~ssl.VERIFY_DEFAULT`, :const:`~ssl.VERIFY_CRL_CHECK_LEAF`, :const:`~ssl.VERIFY_CRL_CHECK_CHAIN`, or :const:`~ssl.VERIFY_X509_STRICT`. OpenSSL does not do any CRL verification by default. (Contributed by Christien Heimes in :issue:`8813`.)
sv: Om OpenSSL 0.9.8 eller senare är tillgängligt har :class:`~ssl.SSLContext` ett nytt attribut :attr:`~ssl.SSLContext.verify_flags` som kan användas för att styra certifikatverifieringsprocessen genom att ställa in det på en kombination av de nya konstanterna :const:`~ssl.VERIFY_DEFAULT`, :const:`~ssl.VERIFY_CRL_CHECK_LEAF`, :const:`~ssl.VERIFY_CRL_CHECK_CHAIN`, eller :const:`~ssl.VERIFY_X509_STRICT`. OpenSSL gör inte någon CRL-verifiering som standard. (Bidrag från Christien Heimes i :issue:`8813`.)

source: New :class:`~ssl.SSLContext` method :meth:`~ssl.SSLContext.load_default_certs` loads a set of default "certificate authority" (CA) certificates from default locations, which vary according to the platform. It can be used to load both TLS web server authentication certificates (``purpose=``:data:`~ssl.Purpose.SERVER_AUTH`) for a client to use to verify a server, and certificates for a server to use in verifying client certificates (``purpose=``:data:`~ssl.Purpose.CLIENT_AUTH`). (Contributed by Christian Heimes in :issue:`19292`.)
sv: Ny :class:`~ssl.SSLContext`-metod :meth:`~ssl.SSLContext.load_default_certs` laddar en uppsättning standardcertifikat för "certifikatutfärdare" (CA) från standardplatser, som varierar beroende på plattform. Det kan användas för att ladda både TLS-certifikat för webbserverautentisering (``purpose=``:data:`~ssl.Purpose.SERVER_AUTH`) som en klient kan använda för att verifiera en server och certifikat som en server kan använda för att verifiera klientcertifikat (``purpose=``:data:`~ssl.Purpose.CLIENT_AUTH`). (Bidrag från Christian Heimes i :issue:`19292`.)

source: Two new windows-only functions, :func:`~ssl.enum_certificates` and :func:`~ssl.enum_crls` provide the ability to retrieve certificates, certificate information, and CRLs from the Windows cert store. (Contributed by Christian Heimes in :issue:`17134`.)
sv: Två nya funktioner som endast finns i Windows, :func:`~ssl.enum_certificates` och :func:`~ssl.enum_crls`, gör det möjligt att hämta certifikat, certifikatinformation och CRL:er från Windows certifikatarkiv. (Bidrag från Christian Heimes i :issue:`17134`.)

source: Support for server-side SNI (Server Name Indication) using the new :meth:`ssl.SSLContext.set_servername_callback` method. (Contributed by Daniel Black in :issue:`8109`.)
sv: Stöd för SNI (Server Name Indication) på serversidan med hjälp av den nya metoden :meth:`ssl.SSLContext.set_servername_callback`. (Bidrag från Daniel Black i :issue:`8109`.)

source: The dictionary returned by :meth:`.SSLSocket.getpeercert` contains additional ``X509v3`` extension items: ``crlDistributionPoints``, ``calIssuers``, and ``OCSP`` URIs. (Contributed by Christian Heimes in :issue:`18379`.)
sv: Den ordbok som returneras av :meth:`.SSLSocket.getpeercert` innehåller ytterligare ``X509v3`` tilläggsobjekt: ``crlDistributionPoints``, ``calIssuers`` och ``OCSP`` URI:er. (Bidrag från Christian Heimes i :issue:`18379`.)

source: The :mod:`stat` module is now backed by a C implementation in :mod:`!_stat`. A C implementation is required as most of the values aren't standardized and are platform-dependent. (Contributed by Christian Heimes in :issue:`11016`.)
sv: Modulen :mod:`stat` backas nu upp av en C-implementation i :mod:`!_stat`. En C-implementering krävs eftersom de flesta värden inte är standardiserade och är plattformsberoende. (Bidrag från Christian Heimes i :issue:`11016`.)

source: The module supports new :mod:`~stat.ST_MODE` flags, :mod:`~stat.S_IFDOOR`, :const:`~stat.S_IFPORT`, and :const:`~stat.S_IFWHT`. (Contributed by Christian Hiemes in :issue:`11016`.)
sv: Modulen stöder de nya flaggorna :mod:`~stat.ST_MODE`, :mod:`~stat.S_IFDOOR`, :const:`~stat.S_IFPORT` och :const:`~stat.S_IFWHT`. (Bidrag från Christian Hiemes i :issue:`11016`.)

source: struct
sv: struktur

source: New function :mod:`~struct.iter_unpack` and a new :meth:`struct.Struct.iter_unpack` method on compiled formats provide streamed unpacking of a buffer containing repeated instances of a given format of data. (Contributed by Antoine Pitrou in :issue:`17804`.)
sv: Ny funktion :mod:`~struct.iter_unpack` och en ny :meth:`struct.Struct.iter_unpack`-metod för kompilerade format ger strömmad uppackning av en buffert som innehåller upprepade instanser av ett visst dataformat. (Bidrag från Antoine Pitrou i :issue:`17804`.)

source: subprocess
sv: delprocess

source: :func:`~subprocess.check_output` now accepts an *input* argument that can be used to provide the contents of ``stdin`` for the command that is run. (Contributed by Zack Weinberg in :issue:`16624`.)
sv: :func:`~subprocess.check_output` accepterar nu ett *input*-argument som kan användas för att ange innehållet i ``stdin`` för det kommando som körs. (Bidrag från Zack Weinberg i :issue:`16624`.)

source: :func:`~subprocess.getstatus` and :func:`~subprocess.getstatusoutput` now work on Windows. This change was actually inadvertently made in 3.3.4. (Contributed by Tim Golden in :issue:`10197`.)
sv: :func:`~subprocess.getstatus` och :func:`~subprocess.getstatusoutput` fungerar nu på Windows. Denna ändring gjordes faktiskt oavsiktligt i 3.3.4. (Bidrag från Tim Golden i :issue:`10197`.)

source: The :meth:`!getparams` method now returns a namedtuple rather than a plain tuple. (Contributed by Claudiu Popa in :issue:`18901`.)
sv: Metoden :meth:`!getparams` returnerar nu en namngiven tupel istället för en vanlig tupel. (Bidrag från Claudiu Popa i :issue:`18901`.)

source: :meth:`!sunau.open` now supports the context management protocol: when used in a :keyword:`with` block, the ``close`` method of the returned object will be called automatically at the end of the block. (Contributed by Serhiy Storchaka in :issue:`18878`.)
sv: :meth:`!sunau.open` stöder nu kontexthanteringsprotokollet: när det används i ett :keyword:`with` block, kommer ``close`` metoden för det returnerade objektet att anropas automatiskt i slutet av blocket. (Bidrag från Serhiy Storchaka i :issue:`18878`.)

source: :meth:`.AU_write.setsampwidth` now supports 24 bit samples, thus adding support for writing 24 sample using the module. (Contributed by Serhiy Storchaka in :issue:`19261`.)
sv: :meth:`.AU_write.setsampwidth` stöder nu 24 bitars samplingar, vilket ger stöd för att skriva 24 samplingar med modulen. (Bidrag från Serhiy Storchaka i :issue:`19261`.)

source: sys
sv: system

source: New function :func:`sys.getallocatedblocks` returns the current number of blocks allocated by the interpreter. (In CPython with the default ``--with-pymalloc`` setting, this is allocations made through the :c:func:`PyObject_Malloc` API.) This can be useful for tracking memory leaks, especially if automated via a test suite. (Contributed by Antoine Pitrou in :issue:`13390`.)
sv: Den nya funktionen :func:`sys.getallocatedblocks` returnerar det aktuella antalet block som tolken har allokerat. (I CPython med standardinställningen ``--with-pymalloc`` är detta allokeringar som görs via API:et :c:func:`PyObject_Malloc`) Detta kan vara användbart för att spåra minnesläckor, speciellt om det är automatiserat via en testsvit. (Bidrag från Antoine Pitrou i :issue:`13390`.)
