Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: :class:`importlib.machinery.PathFinder` now passes on the current working directory to objects in :data:`sys.path_hooks` for the empty string. This results in :data:`sys.path_importer_cache` never containing ``''``, thus iterating through :data:`sys.path_importer_cache` based on :data:`sys.path` will not find all keys. A module's ``__file__`` when imported in the current working directory will also now have an absolute path, including when using ``-m`` with the interpreter (except for ``__main__.__file__`` when a script has been executed directly using a relative path) (Contributed by Brett Cannon in :issue:`18416`). is specified on the command-line) (:issue:`18416`).
sv: :class:`importlib.machinery.PathFinder` skickar nu vidare den aktuella arbetskatalogen till objekt i :data:`sys.path_hooks` för den tomma strängen. Detta resulterar i att :data:`sys.path_importer_cache` aldrig innehåller ``''``, vilket innebär att iterering genom :data:`sys.path_importer_cache` baserat på :data:`sys.path` inte kommer att hitta alla nycklar. En moduls ``__file__`` när den importeras i den aktuella arbetskatalogen kommer nu också att ha en absolut sökväg, inklusive när ``-m`` används med tolken (utom för ``__main__.__file__`` när ett skript har exekverats direkt med en relativ sökväg) (Bidrag från Brett Cannon i :issue:`18416`). anges på kommandoraden) (:issue:`18416`).

source: The removal of the *strict* argument to :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` changes the meaning of the remaining arguments if you are specifying them positionally rather than by keyword. If you've been paying attention to deprecation warnings your code should already be specifying any additional arguments via keywords.
sv: Borttagandet av *strict*-argumentet till :class:`~http.client.HTTPConnection` och :class:`~http.client.HTTPSConnection` ändrar betydelsen av de återstående argumenten om du anger dem positionellt i stället för med nyckelord. Om du har varit uppmärksam på deprecation-varningar bör din kod redan ange eventuella ytterligare argument via nyckelord.

source: Strings between ``from __future__ import ...`` statements now *always* raise a :exc:`SyntaxError`. Previously if there was no leading docstring, an interstitial string would sometimes be ignored. This brings CPython into compliance with the language spec; Jython and PyPy already were. (:issue:`17434`).
sv: Strängar mellan ``from __future__ import ...``-satser ger nu *alltid* upphov till ett :exc:`SyntaxError`. Tidigare, om det inte fanns någon ledande docstring, kunde en mellanliggande sträng ibland ignoreras. Detta gör att CPython överensstämmer med språkspecifikationen; Jython och PyPy gjorde det redan. (:issue:`17434`).

source: :meth:`ssl.SSLSocket.getpeercert` and :meth:`ssl.SSLSocket.do_handshake` now raise an :exc:`OSError` with ``ENOTCONN`` when the ``SSLSocket`` is not connected, instead of the previous behavior of raising an :exc:`AttributeError`. In addition, :meth:`~ssl.SSLSocket.getpeercert` will raise a :exc:`ValueError` if the handshake has not yet been done.
sv: :meth:`ssl.SSLSocket.getpeercert` och :meth:`ssl.SSLSocket.do_handshake` ger nu upphov till ett :exc:`OSError` med ``ENOTCONN`` när ``SSLSocket`` inte är ansluten, istället för det tidigare beteendet att ge upphov till ett :exc:`AttributeError`. Dessutom kommer :meth:`~ssl.SSLSocket.getpeercert` att ge upphov till ett :exc:`ValueError` om handskakningen ännu inte har genomförts.

source: :func:`base64.b32decode` now raises a :exc:`binascii.Error` when the input string contains non-b32-alphabet characters, instead of a :exc:`TypeError`. This particular :exc:`TypeError` was missed when the other :exc:`TypeError`\ s were converted. (Contributed by Serhiy Storchaka in :issue:`18011`.) Note: this change was also inadvertently applied in Python 3.3.3.
sv: :func:`base64.b32decode` ger nu upphov till ett :exc:`binascii.Error` när indatasträngen innehåller icke-b32-alphabet tecken, istället för ett :exc:`TypeError`. Detta speciella :exc:`TypeError` missades när de andra :exc:`TypeError` konverterades. (Bidrag från Serhiy Storchaka i :issue:`18011`.) Observera: denna ändring tillämpades också oavsiktligt i Python 3.3.3.

source: The :attr:`!file` attribute is now automatically closed when the creating :class:`!cgi.FieldStorage` instance is garbage collected. If you were pulling the file object out separately from the :class:`!cgi.FieldStorage` instance and not keeping the instance alive, then you should either store the entire :class:`!cgi.FieldStorage` instance or read the contents of the file before the :class:`!cgi.FieldStorage` instance is garbage collected.
sv: Attributet :attr:`!file` stängs nu automatiskt när den skapande :class:`!cgi.FieldStorage`-instansen garbage collected. Om du drog ut filobjektet separat från :class:`!cgi.FieldStorage`-instansen och inte höll instansen vid liv, bör du antingen lagra hela :class:`!cgi.FieldStorage`-instansen eller läsa innehållet i filen innan :class:`!cgi.FieldStorage`-instansen garbage collected.

source: Calling ``read`` or ``write`` on a closed SSL socket now raises an informative :exc:`ValueError` rather than the previous more mysterious :exc:`AttributeError` (:issue:`9177`).
sv: Anrop av ``read`` eller ``write`` på ett stängt SSL-uttag ger nu upphov till ett informativt :exc:`ValueError` istället för det tidigare mer mystiska :exc:`AttributeError` (:issue:`9177`).

source: :meth:`slice.indices` no longer produces an :exc:`OverflowError` for huge values. As a consequence of this fix, :meth:`slice.indices` now raises a :exc:`ValueError` if given a negative length; previously it returned nonsense values (:issue:`14794`).
sv: :meth:`slice.indices` producerar inte längre ett :exc:`OverflowError` för stora värden. Som en konsekvens av denna korrigering ger :meth:`slice.indices` nu upphov till ett :exc:`ValueError` om det ges en negativ längd; tidigare returnerade det nonsensvärden (:issue:`14794`).

source: The :class:`complex` constructor, unlike the :mod:`cmath` functions, was incorrectly accepting :class:`float` values if an object's ``__complex__`` special method returned one. This now raises a :exc:`TypeError`. (:issue:`16290`.)
sv: Konstruktorn :class:`complex`, till skillnad från funktionerna :mod:`cmath`, accepterade felaktigt värdena :class:`float` om objektets specialmetod ``__complex__`` returnerade ett värde. Detta ger nu upphov till ett :exc:`TypeError`. (:issue:`16290`.)

source: The :class:`int` constructor in 3.2 and 3.3 erroneously accepts :class:`float` values for the *base* parameter. It is unlikely anyone was doing this, but if so, it will now raise a :exc:`TypeError` (:issue:`16772`).
sv: Konstruktorn :class:`int` i 3.2 och 3.3 accepterar felaktigt :class:`float`-värden för parametern *base*. Det är osannolikt att någon gjorde detta, men om så är fallet kommer det nu att ge upphov till ett :exc:`TypeError` (:issue:`16772`).

source: Defaults for keyword-only arguments are now evaluated *after* defaults for regular keyword arguments, instead of before. Hopefully no one wrote any code that depends on the previous buggy behavior (:issue:`16967`).
sv: Standardvärden för argument som endast innehåller nyckelord utvärderas nu *efter* standardvärden för vanliga nyckelordsargument, istället för före. Förhoppningsvis har ingen skrivit någon kod som är beroende av det tidigare buggiga beteendet (:issue:`16967`).

source: Stale thread states are now cleared after :func:`~os.fork`. This may cause some system resources to be released that previously were incorrectly kept perpetually alive (for example, database connections kept in thread-local storage). (:issue:`17094`.)
sv: Föråldrade trådtillstånd rensas nu efter :func:`~os.fork`. Detta kan leda till att vissa systemresurser frigörs som tidigare felaktigt hölls vid liv för evigt (t.ex. databasanslutningar i trådlokal lagring). (:issue:`17094`.)

source: Parameter names in ``__annotations__`` dicts are now mangled properly, similarly to :attr:`~function.__kwdefaults__`. (Contributed by Yury Selivanov in :issue:`20625`.)
sv: Parameternamn i ``__annotations__``-dikter manglas nu korrekt, på samma sätt som :attr:`~function.__kwdefaults__`. (Bidrag från Yury Selivanov i :issue:`20625`.)

source: :attr:`hashlib.hash.name` now always returns the identifier in lower case. Previously some builtin hashes had uppercase names, but now that it is a formal public interface the naming has been made consistent (:issue:`18532`).
sv: :attr:`hashlib.hash.name` returnerar nu alltid identifieraren med små bokstäver. Tidigare hade vissa inbyggda hashar namn med versaler, men nu när det är ett formellt offentligt gränssnitt har namngivningen gjorts konsekvent (:issue:`18532`).

source: Because :mod:`unittest.TestSuite` now drops references to tests after they are run, test harnesses that reuse a :class:`~unittest.TestSuite` to re-run a set of tests may fail. Test suites should not be re-used in this fashion since it means state is retained between test runs, breaking the test isolation that :mod:`unittest` is designed to provide. However, if the lack of isolation is considered acceptable, the old behavior can be restored by creating a :mod:`~unittest.TestSuite` subclass that defines a ``_removeTestAtIndex`` method that does nothing (see :meth:`.TestSuite.__iter__`) (:issue:`11798`).
sv: Eftersom :mod:`unittest.TestSuite` nu tappar referenser till tester efter att de har körts, kan testprogram som återanvänder en :class:`~unittest.TestSuite` för att köra om en uppsättning tester misslyckas. Testsviter bör inte återanvändas på det här sättet eftersom det innebär att tillstånd behålls mellan testkörningar, vilket bryter testisoleringen som :mod:`unittest` är utformad för att tillhandahålla. Men om bristen på isolering anses acceptabel kan det gamla beteendet återställas genom att skapa en :mod:`~unittest.TestSuite`-underklass som definierar en ``_removeTestAtIndex``-metod som inte gör någonting (se :meth:`.TestSuite.__iter__`) (:issue:`11798`).

source: :mod:`unittest` now uses :mod:`argparse` for command line parsing. There are certain invalid command forms that used to work that are no longer allowed; in theory this should not cause backward compatibility issues since the disallowed command forms didn't make any sense and are unlikely to be in use.
sv: :mod:`unittest` använder nu :mod:`argparse` för kommandoradsanalys. Det finns vissa ogiltiga kommandoformer som tidigare fungerade och som inte längre tillåts; i teorin bör detta inte orsaka problem med bakåtkompatibilitet eftersom de otillåtna kommandoformerna inte var meningsfulla och troligen inte används.

source: The :func:`re.split`, :func:`re.findall`, and :func:`re.sub` functions, and the :meth:`~re.match.group` and :meth:`~re.match.groups` methods of ``match`` objects now always return a *bytes* object when the string to be matched is a :term:`bytes-like object`. Previously the return type matched the input type, so if your code was depending on the return value being, say, a ``bytearray``, you will need to change your code.
sv: Funktionerna :func:`re.split`, :func:`re.findall`, och :func:`re.sub`, samt metoderna :meth:`~re.match.group` och :meth:`~re.match.groups` för ``match``-objekt returnerar nu alltid ett *bytes*-objekt när strängen som ska matchas är ett :term:`bytes-liknande objekt`. Tidigare matchade returtypen indatatypen, så om din kod var beroende av att returvärdet var, säg, en ``bytearray``, måste du ändra din kod.

source: :mod:`!audioop` functions now raise an error immediately if passed string input, instead of failing randomly later on (:issue:`16685`).
sv: :mod:`!audioop`-funktioner ger nu upphov till ett fel omedelbart om de får stränginmatning, istället för att misslyckas slumpmässigt senare (:issue:`16685`).

source: The new *convert_charrefs* argument to :class:`~html.parser.HTMLParser` currently defaults to ``False`` for backward compatibility, but will eventually be changed to default to ``True``. It is recommended that you add this keyword, with the appropriate value, to any :class:`~html.parser.HTMLParser` calls in your code (:issue:`13633`).
sv: Det nya argumentet *convert_charrefs* till :class:`~html.parser.HTMLParser` har för närvarande ``False`` som standard för bakåtkompatibilitet, men kommer så småningom att ändras till ``True`` som standard. Det rekommenderas att du lägger till detta nyckelord, med lämpligt värde, till alla :class:`~html.parser.HTMLParser`-anrop i din kod (:issue:`13633`).

source: Since the *digestmod* argument to the :func:`hmac.new` function will in the future have no default, all calls to :func:`hmac.new` should be changed to explicitly specify a *digestmod* (:issue:`17276`).
sv: Eftersom argumentet *digestmod* till funktionen :func:`hmac.new` i framtiden inte kommer att ha någon standard, bör alla anrop till :func:`hmac.new` ändras så att de uttryckligen anger en *digestmod* (:issue:`17276`).

source: Calling :func:`sysconfig.get_config_var` with the ``SO`` key, or looking ``SO`` up in the results of a call to :func:`sysconfig.get_config_vars` is deprecated. This key should be replaced by ``EXT_SUFFIX`` or ``SHLIB_SUFFIX``, depending on the context (:issue:`19555`).
sv: Att anropa :func:`sysconfig.get_config_var` med nyckeln ``SO``, eller att leta upp ``SO`` i resultatet av ett anrop till :func:`sysconfig.get_config_vars` är föråldrat. Denna nyckel bör ersättas av ``EXT_SUFFIX`` eller ``SHLIB_SUFFIX``, beroende på sammanhanget (:issue:`19555`).

source: Any calls to ``open`` functions that specify ``U`` should be modified. ``U`` is ineffective in Python3 and will eventually raise an error if used. Depending on the function, the equivalent of its old Python2 behavior can be achieved using either a *newline* argument, or if necessary by wrapping the stream in :mod:`~io.TextIOWrapper` to use its *newline* argument (:issue:`15204`).
sv: Alla anrop till ``open`` funktioner som specificerar ``U`` bör modifieras. ``U`` är ineffektivt i Python3 och kommer så småningom att ge upphov till ett fel om det används. Beroende på funktionen kan motsvarigheten till dess gamla Python2-beteende uppnås genom att använda antingen ett *newline*-argument, eller om nödvändigt genom att paketera strömmen i :mod:`~io.TextIOWrapper` för att använda dess *newline*-argument (:issue:`15204`).

source: If you use ``pyvenv`` in a script and desire that pip *not* be installed, you must add ``--without-pip`` to your command invocation.
sv: Om du använder ``pyvenv`` i ett skript och vill att pip *inte* ska installeras måste du lägga till ``--without-pip`` i din kommandoupprop.

source: The default behavior of :func:`json.dump` and :func:`json.dumps` when an indent is specified has changed: it no longer produces trailing spaces after the item separating commas at the ends of lines. This will matter only if you have tests that are doing white-space-sensitive comparisons of such output (:issue:`16333`).
sv: Standardbeteendet för :func:`json.dump` och :func:`json.dumps` när ett indrag anges har ändrats: det producerar inte längre efterföljande mellanslag efter kommatecken i slutet av rader. Detta kommer endast att ha betydelse om du har tester som gör jämförelser av sådana utdata med känsligt blanksteg (:issue:`16333`).

source: :mod:`doctest` now looks for doctests in extension module ``__doc__`` strings, so if your doctest test discovery includes extension modules that have things that look like doctests in them you may see test failures you've never seen before when running your tests (:issue:`3158`).
sv: :mod:`doctest` letar nu efter doctests i tilläggsmodulens ``__doc__`` strängar, så om din doctest-testupptäckt inkluderar tilläggsmoduler som har saker som ser ut som doctests i dem kan du se testfel som du aldrig sett tidigare när du kör dina tester (:issue:`3158`).

source: The :mod:`collections.abc` module has been slightly refactored as part of the Python startup improvements. As a consequence of this, it is no longer the case that importing :mod:`collections` automatically imports :mod:`collections.abc`. If your program depended on the (undocumented) implicit import, you will need to add an explicit ``import collections.abc`` (:issue:`20784`).
sv: Modulen :mod:`collections.abc` har omarbetats något som en del av Pythons uppstartsförbättringar. Som en konsekvens av detta är det inte längre så att import av :mod:`collections` automatiskt importerar :mod:`collections.abc`. Om ditt program var beroende av den (odokumenterade) implicita importen, måste du lägga till en explicit ``import collections.abc`` (:issue:`20784`).

source: Changes in the C API
sv: Förändringar i C API

source: :c:func:`PyEval_EvalFrameEx`, :c:func:`PyObject_Repr`, and :c:func:`PyObject_Str`, along with some other internal C APIs, now include a debugging assertion that ensures they are not used in situations where they may silently discard a currently active exception. In cases where discarding the active exception is expected and desired (for example, because it has already been saved locally with :c:func:`PyErr_Fetch` or is being deliberately replaced with a different exception), an explicit :c:func:`PyErr_Clear` call will be needed to avoid triggering the assertion when invoking these operations (directly or indirectly) and running against a version of Python that is compiled with assertions enabled.
sv: :c:func:`PyEval_EvalFrameEx`, :c:func:`PyObject_Repr` och :c:func:`PyObject_Str`, tillsammans med några andra interna C API:er, innehåller nu ett felsökningsuttalande som säkerställer att de inte används i situationer där de tyst kan kasta bort ett för närvarande aktivt undantag. I fall där det aktiva undantaget förväntas och önskas kasseras (till exempel för att det redan har sparats lokalt med :c:func:`PyErr_Fetch` eller avsiktligt ersätts med ett annat undantag), kommer ett uttryckligt :c:func:`PyErr_Clear`-anrop att behövas för att undvika att påståendet utlöses när dessa operationer anropas (direkt eller indirekt) och körs mot en version av Python som är kompilerad med påståenden aktiverade.

source: :c:func:`PyErr_SetImportError` now sets :exc:`TypeError` when its **msg** argument is not set. Previously only ``NULL`` was returned with no exception set.
sv: :c:func:`PyErr_SetImportError` sätter nu :exc:`TypeError` när dess **msg** argument inte är satt. Tidigare returnerades endast ``NULL`` utan att något undantag angavs.

source: The result of the :c:data:`PyOS_ReadlineFunctionPointer` callback must now be a string allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, or ``NULL`` if an error occurred, instead of a string allocated by :c:func:`PyMem_Malloc` or :c:func:`PyMem_Realloc` (:issue:`16742`)
sv: Resultatet av anropet :c:data:`PyOS_ReadlineFunctionPointer` måste nu vara en sträng som allokerats av :c:func:`PyMem_RawMalloc` eller :c:func:`PyMem_RawRealloc`, eller ``NULL`` om ett fel inträffade, istället för en sträng som allokerats av :c:func:`PyMem_Malloc` eller :c:func:`PyMem_Realloc` (:issue:`16742``)

source: :c:func:`PyThread_set_key_value` now always set the value. In Python 3.3, the function did nothing if the key already exists (if the current value is a non-``NULL`` pointer).
sv: :c:func:`PyThread_set_key_value` sätter nu alltid värdet. I Python 3.3 gjorde funktionen ingenting om nyckeln redan fanns (om det aktuella värdet är en pekare som inte är ``NULL``).

source: The ``f_tstate`` (thread state) field of the :c:type:`PyFrameObject` structure has been removed to fix a bug: see :issue:`14432` for the rationale.
sv: Fältet ``f_tstate`` (thread state) i :c:type:`PyFrameObject`-strukturen har tagits bort för att åtgärda ett fel: se :issue:`14432` för motiveringen.

source: Changed in 3.4.3
sv: Ändrat i 3.4.3

source: PEP 476: Enabling certificate verification by default for stdlib http clients
sv: PEP 476: Aktivera certifikatverifiering som standard för stdlib http-klienter

source: :mod:`http.client` and modules which use it, such as :mod:`urllib.request` and :mod:`xmlrpc.client`, will now verify that the server presents a certificate which is signed by a CA in the platform trust store and whose hostname matches the hostname being requested by default, significantly improving security for many applications.
sv: :mod:`http.client` och moduler som använder den, t.ex. :mod:`urllib.request` och :mod:`xmlrpc.client`, kommer nu att verifiera att servern presenterar ett certifikat som är signerat av en CA i plattformens trust store och vars värdnamn matchar det värdnamn som begärs som standard, vilket avsevärt förbättrar säkerheten för många applikationer.

source: For applications which require the old previous behavior, they can pass an alternate context::
sv: För applikationer som kräver det gamla tidigare beteendet kan de skicka en alternativ context::
