Repository: yeager/python-docs-sv
Catalog: whatsnew/3.4.po
Languages: sv

source: What's New In Python 3.4
sv: Vad är nytt i Python 3.4

source: Author
sv: Författare

source: R. David Murray <rdmurray@bitdance.com> (Editor)
sv: R. David Murray <rdmurray@bitdance.com> (redaktör)

source: This article explains the new features in Python 3.4, compared to 3.3. Python 3.4 was released on March 16, 2014. For full details, see the `changelog <https://docs.python.org/3.4/whatsnew/changelog.html>`_.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.4 jämfört med 3.3. Python 3.4 släpptes den 16 mars 2014. För fullständig information, se `changelog <https://docs.python.org/3.4/whatsnew/changelog.html>`_.

source: :pep:`429` -- Python 3.4 Release Schedule
sv: :pep:`429` -- Python 3.4 Utgivningsschema

source: Summary -- Release Highlights
sv: Sammanfattning -- Release Highlights

source: New syntax features:
sv: Nya syntaxfunktioner:

source: No new syntax features were added in Python 3.4.
sv: Inga nya syntaxfunktioner har lagts till i Python 3.4.

source: Other new features:
sv: Andra nya funktioner:

source: :ref:`pip should always be available <whatsnew-pep-453>` (:pep:`453`).
sv: :ref:`pip ska alltid vara tillgängligt <whatsnew-pep-453>` (:pep:`453`).

source: :ref:`Newly created file descriptors are non-inheritable <whatsnew-pep-446>` (:pep:`446`).
sv: :ref:`Nyskapade filbeskrivare är inte ärftliga <whatsnew-pep-446>` (:pep:`446`).

source: command line option for :ref:`isolated mode <whatsnew-isolated-mode>` (:issue:`16499`).
sv: kommandoradsalternativ för :ref:`isolerat läge <whatsnew-isolated-mode>` (:utgåva:`16499`).

source: :ref:`improvements in the handling of codecs <codec-handling-improvements>` that are not text encodings (multiple issues).
sv: :ref:`förbättringar i hanteringen av codecs <codec-handling-improvements>` som inte är textkodningar (flera frågor).

source: :ref:`A ModuleSpec Type <whatsnew-pep-451>` for the Import System (:pep:`451`). (Affects importer authors.)
sv: :ref:``En ModuleSpec-typ <whatsnew-pep-451>`` för importsystemet (:pep:`451`). (Påverkar importörsförfattare.)

source: The :mod:`marshal` format has been made :ref:`more compact and efficient <whatsnew-marshal-3>` (:issue:`16475`).
sv: Formatet :mod:`marshal` har gjorts :ref:`mer kompakt och effektivt <whatsnew-marshal-3>` (:issue:`16475`).

source: New library modules:
sv: Nya biblioteksmoduler:

source: :mod:`asyncio`: :ref:`New provisional API for asynchronous IO <whatsnew-asyncio>` (:pep:`3156`).
sv: :mod:`asyncio`: :ref:`Nytt provisoriskt API för asynkron IO <whatsnew-asyncio>` (:pep:`3156`).

source: :mod:`enum`: :ref:`Support for enumeration types <whatsnew-enum>` (:pep:`435`).
sv: :mod:`enum`: :ref:`Stöd för uppräkningstyper <whatsnew-enum>` (:pep:`435`).

source: :mod:`pathlib`: :ref:`Object-oriented filesystem paths <whatsnew-pathlib>` (:pep:`428`).
sv: :mod:`pathlib`: :ref:`Objektorienterade filsystemssökvägar <whatsnew-pathlib>` (:pep:`428`).

source: :mod:`selectors`: :ref:`High-level and efficient I/O multiplexing <whatsnew-selectors>`, built upon the :mod:`select` module primitives (part of :pep:`3156`).
sv: :mod:`selectors`: :ref:`Hög nivå och effektiv I/O-multiplexering <whatsnew-selectors>`, byggd på :mod:`select`-modulens primitiver (del av :pep:`3156`).

source: :mod:`statistics`: A basic :ref:`numerically stable statistics library <whatsnew-statistics>` (:pep:`450`).
sv: :mod:`statistics`: Ett grundläggande :ref:``numeriskt stabilt statistikbibliotek <whatsnew-statistics>` (:pep:`450`).

source: Significantly improved library modules:
sv: Betydligt förbättrade biblioteksmoduler:

source: :ref:`Single-dispatch generic functions <whatsnew-singledispatch>` in :mod:`functools` (:pep:`443`).
sv: :ref:`Single-dispatch generiska funktioner <whatsnew-singledispatch>` i :mod:`functools` (:pep:`443`).

source: New :mod:`pickle` :ref:`protocol 4 <whatsnew-protocol-4>` (:pep:`3154`).
sv: Ny :mod:`pickle` :ref:`protocol 4 <whatsnew-protocol-4>` (:pep:`3154`).

source: :mod:`multiprocessing` now has :ref:`an option to avoid using os.fork on Unix <whatsnew-multiprocessing-no-fork>` (:issue:`8713`).
sv: :mod:`multiprocessing` har nu :ref:`ett alternativ för att undvika att använda os.fork på Unix <whatsnew-multiprocessing-no-fork>` (:issue:`8713`).

source: :mod:`email` has a new submodule, :mod:`~email.contentmanager`, and a new :mod:`~email.message.Message` subclass (:class:`~email.contentmanager.EmailMessage`) that :ref:`simplify MIME handling <whatsnew_email_contentmanager>` (:issue:`18891`).
sv: :mod:`email` har en ny undermodul, :mod:`~email.contentmanager`, och en ny :mod:`~email.message.Message`-underklass (:class:`~email.contentmanager.EmailMessage`) som :ref:`förenklar MIME-hanteringen <whatsnew_email_contentmanager>` (:issue:`18891`).

source: The :mod:`inspect` and :mod:`pydoc` modules are now capable of correct introspection of a much wider variety of callable objects, which improves the output of the Python :func:`help` system.
sv: Modulerna :mod:`inspect` och :mod:`pydoc` kan nu göra korrekt introspektion av en mycket större mängd anropsbara objekt, vilket förbättrar utdata från Pythons :func:`help`-system.

source: The :mod:`ipaddress` module API has been declared stable
sv: API:et för modulen :mod:`ipaddress` har förklarats stabilt

source: Security improvements:
sv: Förbättringar av säkerheten:

source: :ref:`Secure and interchangeable hash algorithm <whatsnew-pep-456>` (:pep:`456`).
sv: :ref:`Säker och utbytbar hashalgoritm <whatsnew-pep-456>` (:pep:`456`).

source: :ref:`Make newly created file descriptors non-inheritable <whatsnew-pep-446>` (:pep:`446`) to avoid leaking file descriptors to child processes.
sv: :ref:`Gör nyskapade filbeskrivare icke-ärftliga <whatsnew-pep-446>` (:pep:`446`) för att undvika läckage av filbeskrivare till underordnade processer.

source: New command line option for :ref:`isolated mode <whatsnew-isolated-mode>`, (:issue:`16499`).
sv: Nytt kommandoradsalternativ för :ref:`isolated mode <whatsnew-isolated-mode>`, (:issue:`16499`).

source: :mod:`multiprocessing` now has :ref:`an option to avoid using os.fork on Unix <whatsnew-multiprocessing-no-fork>`. *spawn* and *forkserver* are more secure because they avoid sharing data with child processes.
sv: :mod:`multiprocessing` har nu :ref:`ett alternativ för att undvika att använda os.fork på Unix <whatsnew-multiprocessing-no-fork>`. *spawn* och *forkserver* är säkrare eftersom de undviker att dela data med underordnade processer.

source: :mod:`multiprocessing` child processes on Windows no longer inherit all of the parent's inheritable handles, only the necessary ones.
sv: :mod:`multiprocessing`-barnprocesser i Windows ärver inte längre alla förälderns ärvbara handtag, bara de nödvändiga.

source: A new :func:`hashlib.pbkdf2_hmac` function provides the `PKCS#5 password-based key derivation function 2 <https://en.wikipedia.org/wiki/PBKDF2>`_.
sv: En ny :func:`hashlib.pbkdf2_hmac`-funktion tillhandahåller `PKCS#5 password-based key derivation function 2 <https://en.wikipedia.org/wiki/PBKDF2>`_.

source: :ref:`TLSv1.1 and TLSv1.2 support <whatsnew-tls-11-12>` for :mod:`ssl`.
sv: :ref:`TLSv1.1 och TLSv1.2 stöd <whatsnew-tls-11-12>` för :mod:`ssl`.

source: :ref:`Retrieving certificates from the Windows system cert store support <whatsnew34-win-cert-store>` for :mod:`ssl`.
sv: :ref:`Hämtning av certifikat från Windows systemets cert-arkiv stöd <whatsnew34-win-cert-store>` för :mod:`ssl`.

source: :ref:`Server-side SNI (Server Name Indication) support <whatsnew34-sni>` for :mod:`ssl`.
sv: :ref:`Server-side SNI (Server Name Indication) support <whatsnew34-sni>` för :mod:`ssl`.

source: The :class:`ssl.SSLContext` class has a :ref:`lot of improvements <whatsnew34-sslcontext>`.
sv: Klassen :class:`ssl.SSLContext` har en :ref:`många förbättringar <whatsnew34-sslcontext>`.

source: All modules in the standard library that support SSL now support server certificate verification, including hostname matching (:func:`ssl.match_hostname`) and CRLs (Certificate Revocation lists, see :func:`ssl.SSLContext.load_verify_locations`).
sv: Alla moduler i standardbiblioteket som stöder SSL stöder nu verifiering av servercertifikat, inklusive matchning av värdnamn (:func:`ssl.match_hostname`) och CRL:er (listor över återkallade certifikat, se :func:`ssl.SSLContext.load_verify_locations`).

source: CPython implementation improvements:
sv: Förbättringar av CPython-implementeringen:

source: Leveraging :pep:`442`, in most cases :ref:`module globals are no longer set to None during finalization <whatsnew-pep-442>` (:issue:`18214`).
sv: Med hjälp av :pep:`442`, i de flesta fall :ref:``modulglobaler sätts inte längre till None under slutförande <whatsnew-pep-442>` (:issue:`18214`).

source: :ref:`Configurable memory allocators <whatsnew-pep-445>` (:pep:`445`).
sv: :ref:`Konfigurerbara minnesallokatorer <whatsnew-pep-445>` (:pep:`445`).

source: :ref:`Argument Clinic <whatsnew-pep-436>` (:pep:`436`).
sv: :ref:`Argumentklinik <whatsnew-pep-436>` (:pep:`436`).

source: Please read on for a comprehensive list of user-facing changes, including many other smaller improvements, CPython optimizations, deprecations, and potential porting issues.
sv: Läs vidare för en omfattande lista över användarorienterade ändringar, inklusive många andra mindre förbättringar, CPython-optimeringar, avskrivningar och potentiella portningsproblem.

source: New Features
sv: Nya funktioner

source: PEP 453: Explicit Bootstrapping of PIP in Python Installations
sv: PEP 453: Explicit bootstrapping av PIP i Python-installationer

source: Bootstrapping pip By Default
sv: Bootstrapping pip som standard

source: The new :mod:`ensurepip` module (defined in :pep:`453`) provides a standard cross-platform mechanism to bootstrap the pip installer into Python installations and virtual environments. The version of ``pip`` included with Python 3.4.0 is ``pip`` 1.5.4, and future 3.4.x maintenance releases will update the bundled version to the latest version of ``pip`` that is available at the time of creating the release candidate.
sv: Den nya modulen :mod:`ensurepip` (definierad i :pep:`453`) tillhandahåller en plattformsoberoende standardmekanism för att starta upp pip-installationsprogrammet i Python-installationer och virtuella miljöer. Den version av ``pip`` som ingår i Python 3.4.0 är ``pip`` 1.5.4, och framtida underhållsutgåvor av 3.4.x kommer att uppdatera den medföljande versionen till den senaste versionen av ``pip`` som är tillgänglig vid tidpunkten för skapandet av release candidate.

source: By default, the commands ``pipX`` and ``pipX.Y`` will be installed on all platforms (where X.Y stands for the version of the Python installation), along with the ``pip`` Python package and its dependencies. On Windows and in virtual environments on all platforms, the unversioned ``pip`` command will also be installed. On other platforms, the system wide unversioned ``pip`` command typically refers to the separately installed Python 2 version.
sv: Som standard installeras kommandona ``pipX`` och ``pipX.Y`` på alla plattformar (där X.Y står för versionen av Python-installationen), tillsammans med Python-paketet ``pip`` och dess beroenden. I Windows och i virtuella miljöer på alla plattformar installeras även det oversionerade kommandot ``pip``. På andra plattformar hänvisar det systemomfattande kommandot ``pip`` unversioned vanligtvis till den separat installerade Python 2-versionen.

source: The ``pyvenv`` command line utility and the :mod:`venv` module make use of the :mod:`ensurepip` module to make ``pip`` readily available in virtual environments. When using the command line utility, ``pip`` is installed by default, while when using the :mod:`venv` module :ref:`venv-api` installation of ``pip`` must be requested explicitly.
sv: Kommandoradsverktyget ``pyvenv`` och modulen :mod:`venv`` använder modulen :mod:`ensurepip`` för att göra ``pip`` lättillgängligt i virtuella miljöer. När kommandoradsverktyget används installeras ``pip`` som standard, medan installation av ``pip`` måste begäras uttryckligen när modulen :mod:`venv` :ref:`venv-api` används.

source: For CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, the ``make install`` and ``make altinstall`` commands bootstrap ``pip`` by default. This behaviour can be controlled through configure options, and overridden through Makefile options.
sv: För CPython :ref:`source builds på POSIX-system <building-python-on-unix>`, bootstrappar kommandona ``make install`` och ``make altinstall`` ``pip`` som standard. Detta beteende kan kontrolleras genom configure-alternativ och åsidosättas genom Makefile-alternativ.

source: On Windows and Mac OS X, the CPython installers now default to installing ``pip`` along with CPython itself (users may opt out of installing it during the installation process). Window users will need to opt in to the automatic ``PATH`` modifications to have ``pip`` available from the command line by default, otherwise it can still be accessed through the Python launcher for Windows as ``py -m pip``.
sv: På Windows och Mac OS X installerar CPython-installatörerna nu som standard ``pip`` tillsammans med CPython själv (användare kan välja bort att installera det under installationsprocessen). Windows-användare måste välja de automatiska ``PATH``-ändringarna för att ``pip`` ska vara tillgängligt från kommandoraden som standard, annars kan det fortfarande nås via Python-startprogrammet för Windows som ``py -m pip``.

source: As :pep:`discussed in the PEP <0453#recommendations-for-downstream-distributors>` platform packagers may choose not to install these commands by default, as long as, when invoked, they provide clear and simple directions on how to install them on that platform (usually using the system package manager).
sv: Som :pep:`diskuteras i PEP <0453#recommendations-for-downstream-distributors>` kan plattformspaketörer välja att inte installera dessa kommandon som standard, så länge som de, när de anropas, ger tydliga och enkla anvisningar om hur de installeras på den plattformen (vanligtvis med hjälp av systempakethanteraren).

source: To avoid conflicts between parallel Python 2 and Python 3 installations, only the versioned ``pip3`` and ``pip3.4`` commands are bootstrapped by default when ``ensurepip`` is invoked directly - the ``--default-pip`` option is needed to also request the unversioned ``pip`` command. ``pyvenv`` and the Windows installer ensure that the unqualified ``pip`` command is made available in those environments, and ``pip`` can always be invoked via the ``-m`` switch rather than directly to avoid ambiguity on systems with multiple Python installations.
sv: För att undvika konflikter mellan parallella Python 2- och Python 3-installationer startas endast de versionerade kommandona ``pip3`` och ``pip3.4`` som standard när ``ensurepip`` anropas direkt - alternativet ``--default-pip`` behövs för att även begära det oversionerade kommandot ``pip``. ``pyvenv`` och Windows-installationsprogrammet säkerställer att det okvalificerade kommandot ``pip`` görs tillgängligt i dessa miljöer, och ``pip`` kan alltid anropas via ``-m``-omkopplaren istället för direkt för att undvika tvetydighet på system med flera Python-installationer.

source: Documentation Changes
sv: Förändringar i dokumentation

source: As part of this change, the :ref:`installing-index` and :ref:`distributing-index` sections of the documentation have been completely redesigned as short getting started and FAQ documents. Most packaging documentation has now been moved out to the Python Packaging Authority maintained `Python Packaging User Guide <https://packaging.python.org>`__ and the documentation of the individual projects.
sv: Som en del av denna förändring har avsnitten :ref:`installing-index` och :ref:`distributing-index` i dokumentationen helt omarbetats till korta dokument om att komma igång och vanliga frågor. Den mesta förpackningsdokumentationen har nu flyttats ut till Python Packaging Authoritys underhållna `Python Packaging User Guide <https://packaging.python.org>`__ och dokumentationen för de enskilda projekten.

source: However, as this migration is currently still incomplete, the legacy versions of those guides remaining available as :ref:`install-index` and :ref:`setuptools-index`.
sv: Men eftersom den här migreringen för närvarande fortfarande är ofullständig, finns de äldre versionerna av dessa guider fortfarande tillgängliga som :ref:`install-index` och :ref:`setuptools-index`.

source: :pep:`453` -- Explicit bootstrapping of pip in Python installations
sv: :pep:`453` -- Explicit bootstrapping av pip i Python-installationer

source: PEP written by Donald Stufft and Nick Coghlan, implemented by Donald Stufft, Nick Coghlan, Martin von Löwis and Ned Deily.
sv: PEP skriven av Donald Stufft och Nick Coghlan, implementerad av Donald Stufft, Nick Coghlan, Martin von Löwis och Ned Deily.

source: PEP 446: Newly Created File Descriptors Are Non-Inheritable
sv: PEP 446: Nyskapade filbeskrivare är inte ärftliga

source: :pep:`446` makes newly created file descriptors :ref:`non-inheritable <fd_inheritance>`. In general, this is the behavior an application will want: when launching a new process, having currently open files also open in the new process can lead to all sorts of hard to find bugs, and potentially to security issues.
sv: :pep:`446` gör nyskapade filbeskrivare :ref:`icke-ärftliga <fd_inheritance>`. I allmänhet är detta det beteende som ett program vill ha: när en ny process startas kan det leda till alla möjliga svårfunna buggar och potentiellt till säkerhetsproblem om filer som för närvarande är öppna också är öppna i den nya processen.

source: However, there are occasions when inheritance is desired. To support these cases, the following new functions and methods are available:
sv: Det finns dock tillfällen då arv är önskvärt. För att stödja dessa fall finns följande nya funktioner och metoder tillgängliga:

source: :pep:`446` -- Make newly created file descriptors non-inheritable
sv: :pep:`446` -- Gör nyskapade filbeskrivare icke-ärftliga

source: PEP written and implemented by Victor Stinner.
sv: PEP skrivet och implementerat av Victor Stinner.

source: Improvements to Codec Handling
sv: Förbättringar av Codec-hantering

source: Since it was first introduced, the :mod:`codecs` module has always been intended to operate as a type-neutral dynamic encoding and decoding system. However, its close coupling with the Python text model, especially the type restricted convenience methods on the builtin :class:`str`, :class:`bytes` and :class:`bytearray` types, has historically obscured that fact.
sv: Sedan den först introducerades har modulen :mod:`codecs` alltid varit avsedd att fungera som ett typneutralt dynamiskt kodnings- och avkodningssystem. Men dess nära koppling till Pythons textmodell, särskilt de typbegränsade bekvämlighetsmetoderna för de inbyggda typerna :class:`str`, :class:`bytes` och :class:`bytearray`, har historiskt sett dolt detta faktum.

source: As a key step in clarifying the situation, the :meth:`codecs.encode` and :meth:`codecs.decode` convenience functions are now properly documented in Python 2.7, 3.3 and 3.4. These functions have existed in the :mod:`codecs` module (and have been covered by the regression test suite) since Python 2.4, but were previously only discoverable through runtime introspection.
sv: Som ett viktigt steg i att klargöra situationen är bekvämlighetsfunktionerna :meth:`codecs.encode` och :meth:`codecs.decode` nu korrekt dokumenterade i Python 2.7, 3.3 och 3.4. Dessa funktioner har funnits i modulen :mod:`codecs` (och har täckts av regressionstestsviten) sedan Python 2.4, men var tidigare endast upptäckbara genom introspektion under körning.

source: Unlike the convenience methods on :class:`str`, :class:`bytes` and :class:`bytearray`, the :mod:`codecs` convenience functions support arbitrary codecs in both Python 2 and Python 3, rather than being limited to Unicode text encodings (in Python 3) or ``basestring`` <-> ``basestring`` conversions (in Python 2).
sv: Till skillnad från bekvämlighetsmetoderna för :class:`str`, :class:`bytes` och :class:`bytearray` stöder :mod:`codecs` bekvämlighetsfunktioner godtyckliga codecs i både Python 2 och Python 3, snarare än att vara begränsade till Unicode-textkodningar (i Python 3) eller ``basstrings`` <-> ``basstrings``-konverteringar (i Python 2).

source: In Python 3.4, the interpreter is able to identify the known non-text encodings provided in the standard library and direct users towards these general purpose convenience functions when appropriate::
sv: I Python 3.4 kan tolken identifiera de kända icke-textkodningar som finns i standardbiblioteket och hänvisa användare till dessa allmänna bekvämlighetsfunktioner när det är lämpligt::

source: >>> b"abcdef".decode("hex") Traceback (most recent call last): File "<stdin>", line 1, in <module> LookupError: 'hex' is not a text encoding; use codecs.decode() to handle arbitrary codecs >>> "hello".encode("rot13") Traceback (most recent call last): File "<stdin>", line 1, in <module> LookupError: 'rot13' is not a text encoding; use codecs.encode() to handle arbitrary codecs >>> open("foo.txt", encoding="hex") Traceback (most recent call last): File "<stdin>", line 1, in <module> LookupError: 'hex' is not a text encoding; use codecs.open() to handle arbitrary codecs
sv: &gt;&gt;&gt; b"abcdef".avkoda("hex") Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> LookupError: 'hex' är inte en textkodning; använd codecs.decode() för att hantera godtyckliga codecs &gt;&gt;&gt; "hello".encode("rot13") Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> LookupError: 'rot13' är inte en textkodning; använd codecs.encode() för att hantera godtyckliga kodningar &gt;&gt;&gt; open("foo.txt", kodning="hex") Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> LookupError: 'hex' är inte en textkodning; använd codecs.open() för att hantera godtyckliga kodningar

source: In a related change, whenever it is feasible without breaking backwards compatibility, exceptions raised during encoding and decoding operations are wrapped in a chained exception of the same type that mentions the name of the codec responsible for producing the error::
sv: I en relaterad ändring, när det är möjligt utan att bryta bakåtkompatibiliteten, är undantag som uppstår under kodnings- och avkodningsoperationer inslagna i ett kedjat undantag av samma typ som nämner namnet på den codec som är ansvarig för att producera felet::

source: Finally, as the examples above show, these improvements have permitted the restoration of the convenience aliases for the non-Unicode codecs that were themselves restored in Python 3.2. This means that encoding binary data to and from its hexadecimal representation (for example) can now be written as::
sv: Slutligen, som exemplen ovan visar, har dessa förbättringar gjort det möjligt att återställa de praktiska alias för icke-Unicode-codecs som själva återställdes i Python 3.2. Detta innebär att kodning av binära data till och från dess hexadecimala representation (till exempel) nu kan skrivas som::

source: The binary and text transforms provided in the standard library are detailed in :ref:`binary-transforms` and :ref:`text-transforms`.
sv: De binär- och texttransformationer som finns i standardbiblioteket beskrivs närmare i :ref:`binary-transforms` och :ref:`text-transforms`.

source: (Contributed by Nick Coghlan in :issue:`7475`, :issue:`17827`, :issue:`17828` and :issue:`19619`.)
sv: (Bidrag från Nick Coghlan i :issue:`7475`, :issue:`17827`, :issue:`17828` och :issue:`19619`.)

source: PEP 451: A ModuleSpec Type for the Import System
sv: PEP 451: En ModuleSpec-typ för importsystemet
