Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: :func:`~fileinput.hook_encoded` now supports the *errors* argument. (Contributed by Joseph Hackman in :issue:`25788`.)
sv: :func:`~fileinput.hook_encoded` stöder nu argumentet *errors*. (Bidrag från Joseph Hackman i :issue:`25788`.)

source: :mod:`hashlib` supports OpenSSL 1.1.0. The minimum recommend version is 1.0.2. (Contributed by Christian Heimes in :issue:`26470`.)
sv: :mod:`hashlib` stöder OpenSSL 1.1.0. Den minsta rekommenderade versionen är 1.0.2. (Bidrag från Christian Heimes i :issue:`26470`.)

source: BLAKE2 hash functions were added to the module. :func:`~hashlib.blake2b` and :func:`~hashlib.blake2s` are always available and support the full feature set of BLAKE2. (Contributed by Christian Heimes in :issue:`26798` based on code by Dmitry Chestnykh and Samuel Neves. Documentation written by Dmitry Chestnykh.)
sv: BLAKE2-hashfunktioner lades till i modulen. :func:`~hashlib.blake2b` och :func:`~hashlib.blake2s` är alltid tillgängliga och stöder hela funktionsuppsättningen i BLAKE2. (Bidrag från Christian Heimes i :issue:`26798` baserat på kod av Dmitry Chestnykh och Samuel Neves. Dokumentation skriven av Dmitry Chestnykh)

source: The SHA-3 hash functions :func:`~hashlib.sha3_224`, :func:`~hashlib.sha3_256`, :func:`~hashlib.sha3_384`, :func:`~hashlib.sha3_512`, and SHAKE hash functions :func:`~hashlib.shake_128` and :func:`~hashlib.shake_256` were added. (Contributed by Christian Heimes in :issue:`16113`. Keccak Code Package by Guido Bertoni, Joan Daemen, Michaël Peeters, Gilles Van Assche, and Ronny Van Keer.)
sv: SHA-3-hashfunktionerna :func:`~hashlib.sha3_224`, :func:`~hashlib.sha3_256`, :func:`~hashlib.sha3_384`, :func:`~hashlib.sha3_512`, och SHAKE-hashfunktionerna :func:`~hashlib.shake_128` och :func:`~hashlib.shake_256` lades till. (Bidrag från Christian Heimes i :issue:`16113`. Keccak kodpaket av Guido Bertoni, Joan Daemen, Michaël Peeters, Gilles Van Assche och Ronny Van Keer)

source: The password-based key derivation function :func:`~hashlib.scrypt` is now available with OpenSSL 1.1.0 and newer. (Contributed by Christian Heimes in :issue:`27928`.)
sv: Den lösenordsbaserade nyckelfunktionen :func:`~hashlib.scrypt` är nu tillgänglig med OpenSSL 1.1.0 och nyare. (Bidrag från Christian Heimes i :issue:`27928`.)

source: http.client
sv: http.klient

source: :meth:`HTTPConnection.request() <http.client.HTTPConnection.request>` and :meth:`~http.client.HTTPConnection.endheaders` both now support chunked encoding request bodies. (Contributed by Demian Brecht and Rolf Krahl in :issue:`12319`.)
sv: :meth:`HTTPConnection.request() <http.client.HTTPConnection.request>` och :meth:`~http.client.HTTPConnection.endheaders` stöder nu båda chunked encoding request bodies. (Bidrag från Demian Brecht och Rolf Krahl i :issue:`12319`.)

source: idlelib and IDLE
sv: idlelib och IDLE

source: The idlelib package is being modernized and refactored to make IDLE look and work better and to make the code easier to understand, test, and improve. Part of making IDLE look better, especially on Linux and Mac, is using ttk widgets, mostly in the dialogs. As a result, IDLE no longer runs with tcl/tk 8.4. It now requires tcl/tk 8.5 or 8.6. We recommend running the latest release of either.
sv: Paketet idlelib moderniseras och omarbetas för att IDLE ska se bättre ut och fungera bättre och för att koden ska bli lättare att förstå, testa och förbättra. En del i att få IDLE att se bättre ut, särskilt på Linux och Mac, är att använda ttk-widgetar, främst i dialogrutorna. Som ett resultat av detta körs IDLE inte längre med tcl/tk 8.4. Nu krävs tcl/tk 8.5 eller 8.6. Vi rekommenderar att du kör den senaste versionen av någon av dessa.

source: 'Modernizing' includes renaming and consolidation of idlelib modules. The renaming of files with partial uppercase names is similar to the renaming of, for instance, Tkinter and TkFont to tkinter and tkinter.font in 3.0. As a result, imports of idlelib files that worked in 3.5 will usually not work in 3.6. At least a module name change will be needed (see idlelib/README.txt), sometimes more. (Name changes contributed by Al Swiegart and Terry Reedy in :issue:`24225`. Most idlelib patches since have been and will be part of the process.)
sv: "Moderniseringen" omfattar namnbyte och konsolidering av idlelib-moduler. Omdöpningen av filer med delvis versala namn liknar omdöpningen av till exempel Tkinter och TkFont till tkinter och tkinter.font i 3.0. Som ett resultat av detta kommer import av idlelib-filer som fungerade i 3.5 vanligtvis inte att fungera i 3.6. Åtminstone en ändring av modulnamnet kommer att behövas (se idlelib/README.txt), ibland mer. (Namnändringar som Al Swiegart och Terry Reedy bidrog med i :issue:`24225`. De flesta idlelib-patchar sedan dess har varit och kommer att vara en del av processen)

source: In compensation, the eventual result with be that some idlelib classes will be easier to use, with better APIs and docstrings explaining them. Additional useful information will be added to idlelib when available.
sv: Som kompensation blir det slutliga resultatet att vissa idlelib-klasser blir enklare att använda, med bättre API:er och dokument som förklarar dem. Ytterligare användbar information kommer att läggas till i idlelib när den är tillgänglig.

source: New in 3.6.2:
sv: Nytt i 3.6.2:

source: Multiple fixes for autocompletion. (Contributed by Louie Lu in :issue:`15786`.)
sv: Flera korrigeringar för autokomplettering. (Bidrag från Louie Lu i :issue:`15786`.)

source: New in 3.6.3:
sv: Nytt i 3.6.3:

source: Module Browser (on the File menu, formerly called Class Browser), now displays nested functions and classes in addition to top-level functions and classes. (Contributed by Guilherme Polo, Cheryl Sabella, and Terry Jan Reedy in :issue:`1612262`.)
sv: Modulbläddraren (på Arkiv-menyn, tidigare kallad Klassbläddraren) visar nu nästlade funktioner och klasser utöver funktioner och klasser på toppnivå. (Bidrag från Guilherme Polo, Cheryl Sabella och Terry Jan Reedy i :issue:`1612262`.)

source: The IDLE features formerly implemented as extensions have been reimplemented as normal features. Their settings have been moved from the Extensions tab to other dialog tabs. (Contributed by Charles Wohlganger and Terry Jan Reedy in :issue:`27099`.)
sv: De IDLE-funktioner som tidigare implementerades som tillägg har nu implementerats som vanliga funktioner. Deras inställningar har flyttats från fliken Extensions till andra dialogflikar. (Bidrag från Charles Wohlganger och Terry Jan Reedy i :issue:`27099`.)

source: The Settings dialog (Options, Configure IDLE) has been partly rewritten to improve both appearance and function. (Contributed by Cheryl Sabella and Terry Jan Reedy in multiple issues.)
sv: Dialogrutan Inställningar (Alternativ, Konfigurera IDLE) har delvis skrivits om för att förbättra både utseende och funktion. (Bidrag från Cheryl Sabella och Terry Jan Reedy i flera utgåvor)

source: New in 3.6.4:
sv: Nytt i 3.6.4:

source: The font sample now includes a selection of non-Latin characters so that users can better see the effect of selecting a particular font. (Contributed by Terry Jan Reedy in :issue:`13802`.) The sample can be edited to include other characters. (Contributed by Serhiy Storchaka in :issue:`31860`.)
sv: Teckensnittsexemplet innehåller nu ett urval av icke-latinska tecken så att användarna bättre kan se effekten av att välja ett visst teckensnitt. (Bidrag från Terry Jan Reedy i :issue:`13802`.) Exemplet kan redigeras för att inkludera andra tecken. (Bidrag från Serhiy Storchaka i :issue:`31860`.)

source: New in 3.6.6:
sv: Nytt i 3.6.6:

source: Editor code context option revised. Box displays all context lines up to maxlines. Clicking on a context line jumps the editor to that line. Context colors for custom themes is added to Highlights tab of Settings dialog. (Contributed by Cheryl Sabella and Terry Jan Reedy in :issue:`33642`, :issue:`33768`, and :issue:`33679`.)
sv: Redigeringsalternativet för kodkontext reviderat. Rutan visar alla kontextlinjer upp till maxlinjer. Om du klickar på en kontextlinje hoppar redigeraren till den linjen. Kontextfärger för anpassade teman har lagts till på fliken Höjdpunkter i dialogrutan Inställningar. (Bidrag från Cheryl Sabella och Terry Jan Reedy i :issue:`33642`, :issue:`33768`, och :issue:`33679`.)

source: On Windows, a new API call tells Windows that tk scales for DPI. On Windows 8.1+ or 10, with DPI compatibility properties of the Python binary unchanged, and a monitor resolution greater than 96 DPI, this should make text and lines sharper. It should otherwise have no effect. (Contributed by Terry Jan Reedy in :issue:`33656`.)
sv: I Windows säger ett nytt API-anrop till Windows att tk skalar för DPI. På Windows 8.1+ eller 10, med oförändrade DPI-kompatibilitetsegenskaper för Python-binären och en skärmupplösning som är större än 96 DPI, bör detta göra text och linjer skarpare. I övrigt bör det inte ha någon effekt. (Bidrag från Terry Jan Reedy i :issue:`33656`.)

source: New in 3.6.7:
sv: Nytt i 3.6.7:

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
sv: Utdata över N rader (50 som standard) pressas ner till en knapp. N kan ändras i avsnittet PyShell på sidan Allmänt i dialogrutan Inställningar. Färre, men eventuellt extra långa, rader kan pressas genom att högerklicka på utmatningen. Pressad utdata kan expanderas på plats genom att dubbelklicka på knappen eller till urklippet eller ett separat fönster genom att högerklicka på knappen. (Bidrag från Tal Einat i :issue:`1529353`.)

source: Import now raises the new exception :exc:`ModuleNotFoundError` (subclass of :exc:`ImportError`) when it cannot find a module. Code that current checks for ``ImportError`` (in try-except) will still work. (Contributed by Eric Snow in :issue:`15767`.)
sv: Import ger nu upphov till det nya undantaget :exc:`ModuleNotFoundError` (underklass till :exc:`ImportError`) när den inte kan hitta en modul. Kod som för närvarande kontrollerar för ``ImportError`` (i try-except) kommer fortfarande att fungera. (Bidrag från Eric Snow i :issue:`15767`.)

source: :class:`importlib.util.LazyLoader` now calls :meth:`~importlib.abc.Loader.create_module` on the wrapped loader, removing the restriction that :class:`importlib.machinery.BuiltinImporter` and :class:`importlib.machinery.ExtensionFileLoader` couldn't be used with :class:`importlib.util.LazyLoader`.
sv: :class:`importlib.util.LazyLoader` anropar nu :meth:`~importlib.abc.Loader.create_module` på den inkapslade laddaren, vilket tar bort begränsningen att :class:`importlib.machinery.BuiltinImporter` och :class:`importlib.machinery.ExtensionFileLoader` inte kunde användas med :class:`importlib.util.LazyLoader`.

source: :func:`importlib.util.cache_from_source`, :func:`importlib.util.source_from_cache`, and :func:`importlib.util.spec_from_file_location` now accept a :term:`path-like object`.
sv: :func:`importlib.util.cache_from_source`, :func:`importlib.util.source_from_cache`, och :func:`importlib.util.spec_from_file_location` accepterar nu en :term:`path-like object`.

source: inspect
sv: inspektera

source: The :func:`inspect.signature() <inspect.signature>` function now reports the implicit ``.0`` parameters generated by the compiler for comprehension and generator expression scopes as if they were positional-only parameters called ``implicit0``. (Contributed by Jelle Zijlstra in :issue:`19611`.)
sv: Funktionen :func:`inspect.signature() <inspect.signature>`` rapporterar nu de implicita ``.0``-parametrarna som genereras av kompilatorn för förståelse- och generatoruttrycksomfång som om de vore enbart positionella parametrar med namnet ``implicit0``. (Bidrag från Jelle Zijlstra i :issue:`19611`.)

source: To reduce code churn when upgrading from Python 2.7 and the legacy :func:`inspect.getargspec` API, the previously documented deprecation of :func:`inspect.getfullargspec` has been reversed. While this function is convenient for single/source Python 2/3 code bases, the richer :func:`inspect.signature` interface remains the recommended approach for new code. (Contributed by Nick Coghlan in :issue:`27172`)
sv: För att minska kodförlusten vid uppgradering från Python 2.7 och det äldre :func:`inspect.getargspec` API:et, har den tidigare dokumenterade utfasningen av :func:`inspect.getfullargspec` återställts. Även om denna funktion är bekväm för Python 2/3-kodbaser med en enda källa, är det rikare :func:`inspect.signature`-gränssnittet fortfarande det rekommenderade tillvägagångssättet för ny kod. (Bidrag från Nick Coghlan i :issue:`27172`)

source: :func:`json.load` and :func:`json.loads` now support binary input. Encoded JSON should be represented using either UTF-8, UTF-16, or UTF-32. (Contributed by Serhiy Storchaka in :issue:`17909`.)
sv: :func:`json.load` och :func:`json.loads` stöder nu binär indata. Kodad JSON bör representeras med antingen UTF-8, UTF-16 eller UTF-32. (Bidrag från Serhiy Storchaka i :issue:`17909`.)

source: logging
sv: loggning

source: The new :meth:`WatchedFileHandler.reopenIfNeeded() <logging.handlers.WatchedFileHandler.reopenIfNeeded>` method has been added to add the ability to check if the log file needs to be reopened. (Contributed by Marian Horban in :issue:`24884`.)
sv: Den nya :meth:`WatchedFileHandler.reopenIfNeeded() <logging.handlers.WatchedFileHandler.reopenIfNeeded>` metoden har lagts till för att ge möjlighet att kontrollera om loggfilen behöver öppnas igen. (Bidrag från Marian Horban i :issue:`24884`.)

source: math
sv: matematik

source: The tau (*τ*) constant has been added to the :mod:`math` and :mod:`cmath` modules. (Contributed by Lisa Roach in :issue:`12345`, see :pep:`628` for details.)
sv: Tau (*τ*)-konstanten har lagts till i modulerna :mod:`math` och :mod:`cmath`. (Bidrag från Lisa Roach i :issue:`12345`, se :pep:`628` för detaljer)

source: :ref:`Proxy Objects <multiprocessing-proxy_objects>` returned by :func:`multiprocessing.Manager` can now be nested. (Contributed by Davin Potts in :issue:`6766`.)
sv: :ref:`Proxyobjekt <multiprocessing-proxy_objects>` som returneras av :func:`multiprocessing.Manager` kan nu nästlas. (Bidrag från Davin Potts i :issue:`6766`.)

source: See the summary of :ref:`PEP 519 <whatsnew36-pep519>` for details on how the :mod:`os` and :mod:`os.path` modules now support :term:`path-like objects <path-like object>`.
sv: Se sammanfattningen av :ref:`PEP 519 <whatsnew36-pep519>` för detaljer om hur modulerna :mod:`os` och :mod:`os.path` nu stöder :term:`path-liknande objekt <path-like object>`.

source: :func:`~os.scandir` now supports :class:`bytes` paths on Windows.
sv: :func:`~os.scandir` stöder nu :class:`bytes` sökvägar på Windows.

source: A new :meth:`~os.scandir.close` method allows explicitly closing a :func:`~os.scandir` iterator. The :func:`~os.scandir` iterator now supports the :term:`context manager` protocol. If a :func:`scandir` iterator is neither exhausted nor explicitly closed a :exc:`ResourceWarning` will be emitted in its destructor. (Contributed by Serhiy Storchaka in :issue:`25994`.)
sv: En ny metod :meth:`~os.scandir.close` gör det möjligt att explicit stänga en :func:`~os.scandir` iterator. Iteratorn :func:`~os.scandir` har nu stöd för protokollet :term:`context manager`. Om en :func:`scandir` iterator varken är uttömd eller explicit stängd kommer en :exc:`ResourceWarning` att skickas ut i dess destruktor. (Bidrag från Serhiy Storchaka i :issue:`25994`.)

source: The Linux ``getrandom()`` syscall (get random bytes) is now exposed as the new :func:`os.getrandom` function. (Contributed by Victor Stinner, part of the :pep:`524`)
sv: Linux ``getrandom()`` syscall (hämta slumpmässiga byte) är nu exponerad som den nya :func:`os.getrandom` funktionen. (Bidrag från Victor Stinner, en del av :pep:`524`)

source: pathlib
sv: sökväg

source: :mod:`pathlib` now supports :term:`path-like objects <path-like object>`. (Contributed by Brett Cannon in :issue:`27186`.)
sv: :mod:`pathlib` stöder nu :term:`path-liknande objekt <path-like object>`. (Bidrag från Brett Cannon i :issue:`27186`.)

source: See the summary of :ref:`PEP 519 <whatsnew36-pep519>` for details.
sv: Se sammanfattningen av :ref:`PEP 519 <whatsnew36-pep519>` för mer information.

source: The :class:`~pdb.Pdb` class constructor has a new optional *readrc* argument to control whether ``.pdbrc`` files should be read.
sv: Klassens :class:`~pdb.Pdb`-konstruktor har ett nytt valfritt *readrc*-argument för att styra om ``.pdbrc``-filer ska läsas.

source: pickle
sv: gurka

source: Objects that need ``__new__`` called with keyword arguments can now be pickled using :ref:`pickle protocols <pickle-protocols>` older than protocol version 4. Protocol version 4 already supports this case. (Contributed by Serhiy Storchaka in :issue:`24164`.)
sv: Objekt som behöver ``__new__`` anropas med nyckelordsargument kan nu picklas med :ref:`pickle protocols <pickle-protocols>` äldre än protokollversion 4. Protokollversion 4 stöder redan detta fall. (Bidrag från Serhiy Storchaka i :issue:`24164`.)

source: :func:`pickletools.dis` now outputs the implicit memo index for the ``MEMOIZE`` opcode. (Contributed by Serhiy Storchaka in :issue:`25382`.)
sv: :func:`pickletools.dis` skriver nu ut det implicita memoindexet för ``MEMOIZE``-opkoden. (Bidrag från Serhiy Storchaka i :issue:`25382`.)

source: The :mod:`pydoc` module has learned to respect the ``MANPAGER`` environment variable. (Contributed by Matthias Klose in :issue:`8637`.)
sv: Modulen :mod:`pydoc` har lärt sig att respektera miljövariabeln ``MANPAGER``. (Bidrag från Matthias Klose i :issue:`8637`.)

source: :func:`help` and :mod:`pydoc` can now list named tuple fields in the order they were defined rather than alphabetically. (Contributed by Raymond Hettinger in :issue:`24879`.)
sv: :func:`help` och :mod:`pydoc` kan nu lista namngivna tupelfält i den ordning de definierades istället för i alfabetisk ordning. (Bidrag från Raymond Hettinger i :issue:`24879`.)

source: random
sv: slumpvis

source: The new :func:`~random.choices` function returns a list of elements of specified size from the given population with optional weights. (Contributed by Raymond Hettinger in :issue:`18844`.)
sv: Den nya funktionen :func:`~random.choices` returnerar en lista med element av angiven storlek från den givna populationen med valfria vikter. (Bidrag från Raymond Hettinger i :issue:`18844`.)

source: Added support of modifier spans in regular expressions. Examples: ``'(?i:p)ython'`` matches ``'python'`` and ``'Python'``, but not ``'PYTHON'``; ``'(?i)g(?-i:v)r'`` matches ``'GvR'`` and ``'gvr'``, but not ``'GVR'``. (Contributed by Serhiy Storchaka in :issue:`433028`.)
sv: Stöd för modifieringsspann i reguljära uttryck har lagts till. Exempel på detta: ``'(?i:p)ython'`` matchar ``'python'`` och ``'Python'``, men inte ``'PYTHON'``; ``'(?i)g(?-i:v)r'`` matchar ``'GvR'`` och ``'gvr'``, men inte ``'GVR'``. (Bidrag från Serhiy Storchaka i :issue:`433028`.)

source: Match object groups can be accessed by ``__getitem__``, which is equivalent to ``group()``. So ``mo['name']`` is now equivalent to ``mo.group('name')``. (Contributed by Eric Smith in :issue:`24454`.)
sv: Grupper av matchningsobjekt kan nås med ``__getitem__``, vilket motsvarar ``group()``. Så ``mo['name']`` är nu likvärdigt med ``mo.group('name')``. (Bidrag från Eric Smith i :issue:`24454`.)

source: :class:`~re.Match` objects now support :meth:`index-like objects <object.__index__>` as group indices. (Contributed by Jeroen Demeyer and Xiang Zhang in :issue:`27177`.)
sv: :class:`~re.Match`-objekt stöder nu :meth:`indexliknande objekt <object.__index__>` som gruppindex. (Bidrag från Jeroen Demeyer och Xiang Zhang i :issue:`27177`.)

source: readline
sv: läslinje

source: Added :func:`~readline.set_auto_history` to enable or disable automatic addition of input to the history list. (Contributed by Tyler Crompton in :issue:`26870`.)
sv: Lagt till :func:`~readline.set_auto_history` för att aktivera eller inaktivera automatiskt tillägg av indata till historiklistan. (Bidrag från Tyler Crompton i :issue:`26870`.)

source: Private and special attribute names now are omitted unless the prefix starts with underscores. A space or a colon is added after some completed keywords. (Contributed by Serhiy Storchaka in :issue:`25011` and :issue:`25209`.)
sv: Privata och speciella attributnamn utelämnas nu om inte prefixet börjar med understrykningstecken. Ett mellanslag eller en kolon läggs till efter vissa avslutade nyckelord. (Bidrag från Serhiy Storchaka i :issue:`25011` och :issue:`25209`.)

source: The :class:`~shlex.shlex` has much :ref:`improved shell compatibility <improved-shell-compatibility>` through the new *punctuation_chars* argument to control which characters are treated as punctuation. (Contributed by Vinay Sajip in :issue:`1521950`.)
sv: Klassen:`~shlex.shlex` har mycket :ref:`förbättrad skalkompatibilitet <improved-shell-compatibility>` genom det nya argumentet *punctuation_chars* för att kontrollera vilka tecken som behandlas som skiljetecken. (Bidrag från Vinay Sajip i :issue:`1521950`.)

source: site
sv: plats

source: When specifying paths to add to :data:`sys.path` in a ``.pth`` file, you may now specify file paths on top of directories (e.g. zip files). (Contributed by Wolfgang Langner in :issue:`26587`).
sv: När du anger sökvägar att lägga till i :data:`sys.path` i en ``.pth``-fil, kan du nu ange filsökvägar ovanpå kataloger (t.ex. zip-filer). (Bidrag från Wolfgang Langner i :issue:`26587`).

source: :attr:`sqlite3.Cursor.lastrowid` now supports the ``REPLACE`` statement. (Contributed by Alex LordThorsen in :issue:`16864`.)
sv: :attr:`sqlite3.Cursor.lastrowid` stöder nu ``REPLACE``-satsen. (Bidrag från Alex LordThorsen i :issue:`16864`.)

source: socket
sv: kortplats

source: The :func:`~socket.socket.ioctl` function now supports the :const:`~socket.SIO_LOOPBACK_FAST_PATH` control code. (Contributed by Daniel Stokes in :issue:`26536`.)
sv: Funktionen :func:`~socket.socket.ioctl` har nu stöd för kontrollkoden :const:`~socket.SIO_LOOPBACK_FAST_PATH`. (Bidrag från Daniel Stokes i :issue:`26536`.)

source: The :meth:`~socket.socket.getsockopt` constants ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC``, and ``SO_PASSSEC`` are now supported. (Contributed by Christian Heimes in :issue:`26907`.)
sv: Konstanterna :meth:`~socket.socket.getsockopt`` ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC`` och ``SO_PASSSEC`` stöds nu. (Bidrag från Christian Heimes i :issue:`26907`.)

source: The :meth:`~socket.socket.setsockopt` now supports the ``setsockopt(level, optname, None, optlen: int)`` form. (Contributed by Christian Heimes in :issue:`27744`.)
sv: :meth:`~socket.socket.setsockopt` stöder nu formen ``setsockopt(level, optname, None, optlen: int)``. (Bidrag från Christian Heimes i :issue:`27744`.)

source: The socket module now supports the address family :const:`~socket.AF_ALG` to interface with Linux Kernel crypto API. ``ALG_*``, ``SOL_ALG`` and :meth:`~socket.socket.sendmsg_afalg` were added. (Contributed by Christian Heimes in :issue:`27744` with support from Victor Stinner.)
sv: Socket-modulen har nu stöd för adressfamiljen :const:`~socket.AF_ALG` för gränssnitt mot Linux Kernel crypto API. ``ALG_*``, ``SOL_ALG`` och :meth:`~socket.socket.sendmsg_afalg` lades till. (Bidrag från Christian Heimes i :issue:`27744` med stöd från Victor Stinner.)
