Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: New Linux constants ``TCP_USER_TIMEOUT`` and ``TCP_CONGESTION`` were added. (Contributed by Omar Sandoval, :issue:`26273`).
sv: Nya Linux-konstanter ``TCP_USER_TIMEOUT`` och ``TCP_CONGESTION`` lades till. (Bidrag från Omar Sandoval, :issue:`26273`).

source: Servers based on the :mod:`socketserver` module, including those defined in :mod:`http.server`, :mod:`xmlrpc.server` and :mod:`wsgiref.simple_server`, now support the :term:`context manager` protocol. (Contributed by Aviv Palivoda in :issue:`26404`.)
sv: Servrar baserade på modulen :mod:`socketserver`, inklusive de som definieras i :mod:`http.server`, :mod:`xmlrpc.server` och :mod:`wsgiref.simple_server`, stöder nu protokollet :term:`context manager`. (Bidrag från Aviv Palivoda i :issue:`26404`.)

source: The :attr:`~socketserver.StreamRequestHandler.wfile` attribute of :class:`~socketserver.StreamRequestHandler` classes now implements the :class:`io.BufferedIOBase` writable interface. In particular, calling :meth:`~io.BufferedIOBase.write` is now guaranteed to send the data in full. (Contributed by Martin Panter in :issue:`26721`.)
sv: Attributet :attr:`~socketserver.StreamRequestHandler.wfile` i klasserna :class:`~socketserver.StreamRequestHandler` implementerar nu det skrivbara gränssnittet :class:`io.BufferedIOBase`. I synnerhet är anrop av :meth:`~io.BufferedIOBase.write` nu garanterat att skicka data i sin helhet. (Bidrag från Martin Panter i :issue:`26721`.)

source: :mod:`ssl` supports OpenSSL 1.1.0. The minimum recommend version is 1.0.2. (Contributed by Christian Heimes in :issue:`26470`.)
sv: :mod:`ssl` stöder OpenSSL 1.1.0. Den minsta rekommenderade versionen är 1.0.2. (Bidrag från Christian Heimes i :issue:`26470`.)

source: 3DES has been removed from the default cipher suites and ChaCha20 Poly1305 cipher suites have been added. (Contributed by Christian Heimes in :issue:`27850` and :issue:`27766`.)
sv: 3DES har tagits bort från standardchiffersviterna och ChaCha20 Poly1305-chiffersviter har lagts till. (Bidrag från Christian Heimes i :issue:`27850` och :issue:`27766`.)

source: :class:`~ssl.SSLContext` has better default configuration for options and ciphers. (Contributed by Christian Heimes in :issue:`28043`.)
sv: :class:`~ssl.SSLContext` har bättre standardkonfiguration för alternativ och chiffer. (Bidrag från Christian Heimes i :issue:`28043`.)

source: SSL session can be copied from one client-side connection to another with the new :class:`~ssl.SSLSession` class. TLS session resumption can speed up the initial handshake, reduce latency and improve performance (Contributed by Christian Heimes in :issue:`19500` based on a draft by Alex Warhawk.)
sv: SSL-session kan kopieras från en anslutning på klientsidan till en annan med den nya :class:`~ssl.SSLSession`-klassen. TLS session resumption can speed up the initial handshake, reduce latency and improve performance (Bidrag från Christian Heimes i :issue:`19500` baserat på ett utkast av Alex Warhawk.)

source: The new :meth:`~ssl.SSLContext.get_ciphers` method can be used to get a list of enabled ciphers in order of cipher priority.
sv: Den nya metoden :meth:`~ssl.SSLContext.get_ciphers` kan användas för att få en lista över aktiverade chiffer i prioritetsordning.

source: All constants and flags have been converted to :class:`~enum.IntEnum` and :class:`~enum.IntFlags`. (Contributed by Christian Heimes in :issue:`28025`.)
sv: Alla konstanter och flaggor har konverterats till :class:`~enum.IntEnum` och :class:`~enum.IntFlags`. (Bidrag från Christian Heimes i :issue:`28025`.)

source: Server and client-side specific TLS protocols for :class:`~ssl.SSLContext` were added. (Contributed by Christian Heimes in :issue:`28085`.)
sv: Server- och klientsidespecifika TLS-protokoll för :class:`~ssl.SSLContext` lades till. (Bidrag från Christian Heimes i :issue:`28085`.)

source: Added :attr:`ssl.SSLContext.post_handshake_auth` to enable and :meth:`ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :gh:`78851`.)
sv: Lagt till :attr:`ssl.SSLContext.post_handshake_auth` för att aktivera och :meth:`ssl.SSLSocket.verify_client_post_handshake` för att initiera TLS 1.3 post-handshake-autentisering. (Bidrag från Christian Heimes i :gh:`78851`.)

source: statistics
sv: statistik

source: A new :func:`~statistics.harmonic_mean` function has been added. (Contributed by Steven D'Aprano in :issue:`27181`.)
sv: En ny :func:`~statistics.harmonic_mean`-funktion har lagts till. (Bidrag från Steven D'Aprano i :issue:`27181`.)

source: struct
sv: struktur

source: :mod:`struct` now supports IEEE 754 half-precision floats via the ``'e'`` format specifier. (Contributed by Eli Stevens, Mark Dickinson in :issue:`11734`.)
sv: :mod:`struct` stöder nu IEEE 754 halvprecisionsflottor via formatspecificeraren ``'e'``. (Bidrag från Eli Stevens, Mark Dickinson i :issue:`11734`.)

source: subprocess
sv: delprocess

source: :class:`subprocess.Popen` destructor now emits a :exc:`ResourceWarning` warning if the child process is still running. Use the context manager protocol (``with proc: ...``) or explicitly call the :meth:`~subprocess.Popen.wait` method to read the exit status of the child process. (Contributed by Victor Stinner in :issue:`26741`.)
sv: :class:`subprocess.Popen` destructor avger nu en :exc:`ResourceWarning`-varning om underordnad process fortfarande körs. Använd kontexthanterarprotokollet (``with proc: ...``) eller anropa explicit metoden :meth:`~subprocess.Popen.wait` för att läsa barnprocessens utgångsstatus. (Bidrag från Victor Stinner i :issue:`26741`.)

source: The :class:`subprocess.Popen` constructor and all functions that pass arguments through to it now accept *encoding* and *errors* arguments. Specifying either of these will enable text mode for the *stdin*, *stdout* and *stderr* streams. (Contributed by Steve Dower in :issue:`6135`.)
sv: Konstruktorn :class:`subprocess.Popen` och alla funktioner som skickar argument till den accepterar nu argumenten *encoding* och *errors*. Om något av dessa anges aktiveras textläge för strömmarna *stdin*, *stdout* och *stderr*. (Bidrag från Steve Dower i :issue:`6135`.)

source: sys
sv: system

source: The new :func:`~sys.getfilesystemencodeerrors` function returns the name of the error mode used to convert between Unicode filenames and bytes filenames. (Contributed by Steve Dower in :issue:`27781`.)
sv: Den nya funktionen :func:`~sys.getfilesystemencodeerrors` returnerar namnet på det felläge som används för att konvertera mellan Unicode-filnamn och bytes-filnamn. (Bidrag från Steve Dower i :issue:`27781`.)

source: On Windows the return value of the :func:`~sys.getwindowsversion` function now includes the *platform_version* field which contains the accurate major version, minor version and build number of the current operating system, rather than the version that is being emulated for the process (Contributed by Steve Dower in :issue:`27932`.)
sv: I Windows innehåller returvärdet för funktionen :func:`~sys.getwindowsversion` nu fältet *platform_version* som innehåller den exakta huvudversionen, minoritetsversionen och byggnumret för det aktuella operativsystemet, snarare än den version som emuleras för processen (Bidrag från Steve Dower i :issue:`27932`.)

source: :class:`!telnetlib.Telnet` is now a context manager (contributed by Stéphane Wirtel in :issue:`25485`).
sv: :class:`!telnetlib.Telnet` är nu en kontexthanterare (bidrag från Stéphane Wirtel i :issue:`25485`).

source: time
sv: tid

source: The :class:`~time.struct_time` attributes :attr:`tm_gmtoff` and :attr:`tm_zone` are now available on all platforms.
sv: Attributen :class:`~time.struct_time` :attr:`tm_gmtoff` och :attr:`tm_zone` är nu tillgängliga på alla plattformar.

source: timeit
sv: tidsinställning

source: The new :meth:`Timer.autorange() <timeit.Timer.autorange>` convenience method has been added to call :meth:`Timer.timeit() <timeit.Timer.timeit>` repeatedly so that the total run time is greater or equal to 200 milliseconds. (Contributed by Steven D'Aprano in :issue:`6422`.)
sv: Den nya :meth:`Timer.autorange() <timeit.Timer.autorange>` bekvämlighetsmetoden har lagts till för att anropa :meth:`Timer.timeit() <timeit.Timer.timeit>` upprepade gånger så att den totala körtiden är större än eller lika med 200 millisekunder. (Bidrag från Steven D'Aprano i :issue:`6422`.)

source: :mod:`timeit` now warns when there is substantial (4x) variance between best and worst times. (Contributed by Serhiy Storchaka in :issue:`23552`.)
sv: :mod:`timeit` varnar nu när det finns en betydande (4x) varians mellan bästa och sämsta tid. (Bidrag från Serhiy Storchaka i :issue:`23552`.)

source: Added methods :meth:`~tkinter.Variable.trace_add`, :meth:`~tkinter.Variable.trace_remove` and :meth:`~tkinter.Variable.trace_info` in the :class:`tkinter.Variable` class. They replace old methods :meth:`~tkinter.Variable.trace_variable`, :meth:`~tkinter.Variable.trace`, :meth:`~tkinter.Variable.trace_vdelete` and :meth:`~tkinter.Variable.trace_vinfo` that use obsolete Tcl commands and might not work in future versions of Tcl. (Contributed by Serhiy Storchaka in :issue:`22115`).
sv: Lagt till metoderna :meth:`~tkinter.Variable.trace_add`, :meth:`~tkinter.Variable.trace_remove` och :meth:`~tkinter.Variable.trace_info` i klassen :class:`tkinter.Variable`. De ersätter gamla metoder :meth:`~tkinter.Variable.trace_variable`, :meth:`~tkinter.Variable.trace`, :meth:`~tkinter.Variable.trace_vdelete` och :meth:`~tkinter.Variable.trace_vinfo` som använder föråldrade Tcl-kommandon och kanske inte fungerar i framtida versioner av Tcl. (Bidrag från Serhiy Storchaka i :issue:`22115`).

source: traceback
sv: spårning

source: Both the traceback module and the interpreter's builtin exception display now abbreviate long sequences of repeated lines in tracebacks as shown in the following example::
sv: Både spårningsmodulen och tolkens inbyggda undantagsvisning förkortar nu långa sekvenser av upprepade rader i spårningar som visas i följande exempel::

source: >>> def f(): f() ... >>> f() Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 1, in f File "<stdin>", line 1, in f File "<stdin>", line 1, in f [Previous line repeated 995 more times] RecursionError: maximum recursion depth exceeded
sv: &gt;&gt;&gt; def f(): f() ... &gt;&gt;&gt; f() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> Fil "<stdin>", rad 1, i f Fil "<stdin>", rad 1, i f Fil "<stdin>", rad 1, i f [Föregående rad upprepas ytterligare 995 gånger] RecursionError: maximalt rekursionsdjup överskridet

source: (Contributed by Emanuel Barry in :issue:`26823`.)
sv: (Bidrag från Emanuel Barry i :issue:`26823`.)

source: The :mod:`tracemalloc` module now supports tracing memory allocations in multiple different address spaces.
sv: Modulen :mod:`tracemalloc` stöder nu spårning av minnesallokeringar i flera olika adressrymder.

source: The new :class:`~tracemalloc.DomainFilter` filter class has been added to filter block traces by their address space (domain).
sv: Den nya filterklassen :class:`~tracemalloc.DomainFilter` har lagts till för att filtrera blockspårningar efter deras adressutrymme (domän).

source: (Contributed by Victor Stinner in :issue:`26588`.)
sv: (Bidrag från Victor Stinner i :issue:`26588`.)

source: typing
sv: maskinskrivning

source: Since the :mod:`typing` module is :term:`provisional <provisional API>`, all changes introduced in Python 3.6 have also been backported to Python 3.5.x.
sv: Eftersom modulen :mod:`typing` är :term:``provisional <provisional API>`, har alla ändringar som introducerades i Python 3.6 också backporterats till Python 3.5.x.

source: The :mod:`typing` module has a much improved support for generic type aliases. For example ``Dict[str, Tuple[S, T]]`` is now a valid type annotation. (Contributed by Guido van Rossum in `Github #195 <https://github.com/python/typing/pull/195>`_.)
sv: Modulen :mod:`typing` har ett mycket förbättrat stöd för generiska typalias. Till exempel är ``Dict[str, Tuple[S, T]]`` nu en giltig typannotering. (Bidrag från Guido van Rossum i `Github #195 <https://github.com/python/typing/pull/195>`_.)

source: The :class:`typing.ContextManager` class has been added for representing :class:`contextlib.AbstractContextManager`. (Contributed by Brett Cannon in :issue:`25609`.)
sv: Klassen :class:`typing.ContextManager` har lagts till för att representera :class:`contextlib.AbstractContextManager`. (Bidrag från Brett Cannon i :issue:`25609`.)

source: The :class:`typing.Collection` class has been added for representing :class:`collections.abc.Collection`. (Contributed by Ivan Levkivskyi in :issue:`27598`.)
sv: Klassen :class:`typing.Collection` har lagts till för att representera :class:`collections.abc.Collection`. (Bidrag från Ivan Levkivskyi i :issue:`27598`.)

source: The :const:`typing.ClassVar` type construct has been added to mark class variables. As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. (Contributed by Ivan Levkivskyi in `Github #280 <https://github.com/python/typing/pull/280>`_.)
sv: Typkonstruktionen :const:`typing.ClassVar` har lagts till för att markera klassvariabler. Som introducerades i :pep:`526`, indikerar en variabelannotation som är inlindad i ClassVar att ett givet attribut är avsett att användas som en klassvariabel och inte bör ställas in på instanser av den klassen. (Bidrag från Ivan Levkivskyi i `Github #280 <https://github.com/python/typing/pull/280>`_.)

source: A new :const:`~typing.TYPE_CHECKING` constant that is assumed to be ``True`` by the static type checkers, but is ``False`` at runtime. (Contributed by Guido van Rossum in `Github #230 <https://github.com/python/typing/issues/230>`_.)
sv: En ny :const:`~typing.TYPE_CHECKING`-konstant som antas vara ``True`` av de statiska typkontrollerna, men är ``False`` vid körning. (Bidrag från Guido van Rossum i `Github #230 <https://github.com/python/typing/issues/230>`_.)

source: A new :func:`~typing.NewType` helper function has been added to create lightweight distinct types for annotations::
sv: En ny :func:`~typing.NewType` hjälpfunktion har lagts till för att skapa lätta distinkta typer för annoteringar::

source: from typing import NewType UserId = NewType('UserId', int) some_id = UserId(524313)
sv: från typing import NewType UserId = NewType('UserId', int) some_id = UserId(524313)

source: The static type checker will treat the new type as if it were a subclass of the original type. (Contributed by Ivan Levkivskyi in `Github #189 <https://github.com/python/typing/issues/189>`_.)
sv: Den statiska typkontrollen kommer att behandla den nya typen som om den vore en underklass av den ursprungliga typen. (Bidrag från Ivan Levkivskyi i `Github #189 <https://github.com/python/typing/issues/189>`_.)

source: The :mod:`unicodedata` module now uses data from `Unicode 9.0.0 <https://unicode.org/versions/Unicode9.0.0/>`_. (Contributed by Benjamin Peterson.)
sv: Modulen :mod:`unicodedata` använder nu data från `Unicode 9.0.0 <https://unicode.org/versions/Unicode9.0.0/>`_. (Bidrag från Benjamin Peterson.)

source: The :class:`~unittest.mock.Mock` class has the following improvements:
sv: Klassen :class:`~unittest.mock.Mock` har följande förbättringar:

source: Two new methods, :meth:`Mock.assert_called() <unittest.mock.Mock.assert_called>` and :meth:`Mock.assert_called_once() <unittest.mock.Mock.assert_called_once>` to check if the mock object was called. (Contributed by Amit Saha in :issue:`26323`.)
sv: Två nya metoder, :meth:`Mock.assert_called() <unittest.mock.Mock.assert_called>` och :meth:`Mock.assert_called_once() <unittest.mock.Mock.assert_called_once>` för att kontrollera om mock-objektet anropades. (Bidrag från Amit Saha i :issue:`26323`.)

source: The :meth:`Mock.reset_mock() <unittest.mock.Mock.reset_mock>` method now has two optional keyword only arguments: *return_value* and *side_effect*. (Contributed by Kushal Das in :issue:`21271`.)
sv: Metoden :meth:`Mock.reset_mock() <unittest.mock.Mock.reset_mock>` har nu två valfria argument som endast gäller nyckelord: *return_value* och *side_effect*. (Bidrag från Kushal Das i :issue:`21271`.)

source: urllib.request
sv: urllib.begäran

source: If a HTTP request has a file or iterable body (other than a bytes object) but no ``Content-Length`` header, rather than throwing an error, :class:`~urllib.request.AbstractHTTPHandler` now falls back to use chunked transfer encoding. (Contributed by Demian Brecht and Rolf Krahl in :issue:`12319`.)
sv: Om en HTTP-förfrågan har en fil eller en iterabel kropp (annat än ett bytes-objekt) men ingen ``Content-Length`` header, istället för att kasta ett fel, faller :class:`~urllib.request.AbstractHTTPHandler` nu tillbaka till att använda chunked transfer encoding. (Bidrag från Demian Brecht och Rolf Krahl i :issue:`12319`.)

source: :class:`~urllib.robotparser.RobotFileParser` now supports the ``Crawl-delay`` and ``Request-rate`` extensions. (Contributed by Nikolay Bogoychev in :issue:`16099`.)
sv: :class:`~urllib.robotparser.RobotFileParser` stöder nu tillägget ``Crawl-delay`` och ``Request-rate``. (Bidrag från Nikolay Bogoychev i :issue:`16099`.)

source: venv
sv: ven

source: :mod:`venv` accepts a new parameter ``--prompt``. This parameter provides an alternative prefix for the virtual environment. (Proposed by Łukasz Balcerzak and ported to 3.6 by Stéphane Wirtel in :issue:`22829`.)
sv: :mod:`venv` accepterar en ny parameter ``--prompt``. Denna parameter ger ett alternativt prefix för den virtuella miljön. (Föreslagen av Łukasz Balcerzak och portad till 3.6 av Stéphane Wirtel i :issue:`22829`)

source: warnings
sv: varningar

source: A new optional *source* parameter has been added to the :func:`warnings.warn_explicit` function: the destroyed object which emitted a :exc:`ResourceWarning`. A *source* attribute has also been added to :class:`warnings.WarningMessage` (contributed by Victor Stinner in :issue:`26568` and :issue:`26567`).
sv: En ny valfri *source* parameter har lagts till i funktionen :func:`warnings.warn_explicit`: det förstörda objektet som gav upphov till en :exc:`ResourceWarning`. Ett *source*-attribut har också lagts till i :class:`warnings.WarningMessage` (bidrag från Victor Stinner i :issue:`26568` och :issue:`26567`).

source: When a :exc:`ResourceWarning` warning is logged, the :mod:`tracemalloc` module is now used to try to retrieve the traceback where the destroyed object was allocated.
sv: När en :exc:`ResourceWarning`-varning loggas, används nu :mod:`tracemalloc`-modulen för att försöka hämta den traceback där det förstörda objektet allokerades.

source: Example with the script ``example.py``::
sv: Exempel med skriptet ``example.py``::

source: Output of the command ``python3.6 -Wd -X tracemalloc=5 example.py``::
sv: Utdata från kommandot ``python3.6 -Wd -X tracemalloc=5 example.py``::

source: example.py:7: ResourceWarning: unclosed file <_io.TextIOWrapper name='example.py' mode='r' encoding='UTF-8'> f = None Object allocated at (most recent call first): File "example.py", lineno 4 return open(__file__) File "example.py", lineno 6 f = func()
sv: exempel.py:7: ResourceWarning: oavslutad fil <_io.TextIOWrapper name='example.py' mode='r' encoding='UTF-8'> f = Ingen Objekt allokerat vid (senaste anropet först): Fil "example.py", lineno 4 return open(__file__) Fil "exempel.py", lineno 6 f = func()

source: The "Object allocated at" traceback is new and is only displayed if :mod:`tracemalloc` is tracing Python memory allocations and if the :mod:`warnings` module was already imported.
sv: Spårningen "Objekt allokerat vid" är ny och visas endast om :mod:`tracemalloc` spårar Python-minnesallokeringar och om modulen :mod:`warnings` redan har importerats.

source: Added the 64-bit integer type :data:`REG_QWORD <winreg.REG_QWORD>`. (Contributed by Clement Rouault in :issue:`23026`.)
sv: Lagt till 64-bitars heltalstypen :data:`REG_QWORD <winreg.REG_QWORD>`. (Bidrag från Clement Rouault i :issue:`23026`.)

source: Allowed keyword arguments to be passed to :func:`Beep <winsound.Beep>`, :func:`MessageBeep <winsound.MessageBeep>`, and :func:`PlaySound <winsound.PlaySound>` (:issue:`27982`).
sv: Tillät nyckelordsargument att skickas till :func:`Beep <winsound.Beep>`, :func:`MessageBeep <winsound.MessageBeep>`, och :func:`PlaySound <winsound.PlaySound>` (:issue:`27982`).

source: xmlrpc.client
sv: xmlrpc.klient

source: The :mod:`xmlrpc.client` module now supports unmarshalling additional data types used by the Apache XML-RPC implementation for numerics and ``None``. (Contributed by Serhiy Storchaka in :issue:`26885`.)
sv: Modulen :mod:`xmlrpc.client` stöder nu avmarshalling av ytterligare datatyper som används av Apache XML-RPC-implementeringen för numeriska värden och ``None``. (Bidrag från Serhiy Storchaka i :issue:`26885`.)

source: zipfile
sv: zip-fil

source: A new :meth:`ZipInfo.from_file() <zipfile.ZipInfo.from_file>` class method allows making a :class:`~zipfile.ZipInfo` instance from a filesystem file. A new :meth:`ZipInfo.is_dir() <zipfile.ZipInfo.is_dir>` method can be used to check if the :class:`~zipfile.ZipInfo` instance represents a directory. (Contributed by Thomas Kluyver in :issue:`26039`.)
sv: En ny klassmetod :meth:`ZipInfo.from_file() <zipfile.ZipInfo.from_file>` gör det möjligt att skapa en :class:`~zipfile.ZipInfo`-instans från en fil i filsystemet. En ny :meth:`ZipInfo.is_dir() <zipfile.ZipInfo.is_dir>`-metod kan användas för att kontrollera om :class:`~zipfile.ZipInfo`-instansen representerar en katalog. (Bidrag från Thomas Kluyver i :issue:`26039`.)

source: The :meth:`ZipFile.open() <zipfile.ZipFile.open>` method can now be used to write data into a ZIP file, as well as for extracting data. (Contributed by Thomas Kluyver in :issue:`26039`.)
sv: Metoden :meth:`ZipFile.open() <zipfile.ZipFile.open>` kan nu användas för att skriva in data i en ZIP-fil, samt för att extrahera data. (Bidrag från Thomas Kluyver i :issue:`26039`.)

source: The :func:`~zlib.compress` and :func:`~zlib.decompress` functions now accept keyword arguments. (Contributed by Aviv Palivoda in :issue:`26243` and Xiang Zhang in :issue:`16764` respectively.)
sv: Funktionerna :func:`~zlib.compress` och :func:`~zlib.decompress` accepterar nu nyckelordsargument. (Bidrag från Aviv Palivoda i :issue:`26243` respektive Xiang Zhang i :issue:`16764`)

source: Optimizations
sv: Optimeringar

source: The Python interpreter now uses a 16-bit wordcode instead of bytecode which made a number of opcode optimizations possible. (Contributed by Demur Rumed with input and reviews from Serhiy Storchaka and Victor Stinner in :issue:`26647` and :issue:`28050`.)
sv: Python-tolken använder nu en 16-bitars ordkod istället för bytekod vilket möjliggjorde ett antal opcode-optimeringar. (Bidrag från Demur Rumed med input och recensioner från Serhiy Storchaka och Victor Stinner i :issue:`26647` och :issue:`28050`.)

source: The :class:`asyncio.Future` class now has an optimized C implementation. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26081`.)
sv: Klassen :class:`asyncio.Future` har nu en optimerad C-implementering. (Bidrag från Yury Selivanov och INADA Naoki i :issue:`26081`.)

source: The :class:`asyncio.Task` class now has an optimized C implementation. (Contributed by Yury Selivanov in :issue:`28544`.)
sv: Klassen :class:`asyncio.Task` har nu en optimerad C-implementering. (Bidrag från Yury Selivanov i :issue:`28544`.)
