Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: To fix this situation, a new interface represented by :class:`os.PathLike` has been defined. By implementing the :meth:`~os.PathLike.__fspath__` method, an object signals that it represents a path. An object can then provide a low-level representation of a file system path as a :class:`str` or :class:`bytes` object. This means an object is considered :term:`path-like <path-like object>` if it implements :class:`os.PathLike` or is a :class:`str` or :class:`bytes` object which represents a file system path. Code can use :func:`os.fspath`, :func:`os.fsdecode`, or :func:`os.fsencode` to explicitly get a :class:`str` and/or :class:`bytes` representation of a path-like object.
sv: För att lösa denna situation har ett nytt gränssnitt som representeras av :class:`os.PathLike` definierats. Genom att implementera metoden :meth:`~os.PathLike.__fspath__` signalerar ett objekt att det representerar en sökväg. Ett objekt kan sedan tillhandahålla en lågnivårepresentation av en filsystemssökväg som ett :class:`str`- eller :class:`bytes`-objekt. Detta innebär att ett objekt anses vara :term:`sökvägsliknande <path-like object>` om det implementerar :class:`os.PathLike` eller är ett :class:`str` eller :class:`bytes` objekt som representerar en filsystemssökväg. Kod kan använda :func:`os.fspath`, :func:`os.fsdecode`, eller :func:`os.fsencode` för att explicit få en :class:`str` och/eller :class:`bytes` representation av ett sökvägsliknande objekt.

source: The built-in :func:`open` function has been updated to accept :class:`os.PathLike` objects, as have all relevant functions in the :mod:`os` and :mod:`os.path` modules, and most other functions and classes in the standard library. The :class:`os.DirEntry` class and relevant classes in :mod:`pathlib` have also been updated to implement :class:`os.PathLike`.
sv: Den inbyggda funktionen :func:`open` har uppdaterats för att acceptera :class:`os.PathLike`-objekt, liksom alla relevanta funktioner i modulerna :mod:`os` och :mod:`os.path`, och de flesta andra funktioner och klasser i standardbiblioteket. Klassen :class:`os.DirEntry` och relevanta klasser i :mod:`pathlib` har också uppdaterats för att implementera :class:`os.PathLike`.

source: The hope is that updating the fundamental functions for operating on file system paths will lead to third-party code to implicitly support all :term:`path-like objects <path-like object>` without any code changes, or at least very minimal ones (e.g. calling :func:`os.fspath` at the beginning of code before operating on a path-like object).
sv: Förhoppningen är att en uppdatering av de grundläggande funktionerna för att hantera sökvägar i filsystemet kommer att leda till att tredjepartskod implicit stöder alla :term:`sökvägsliknande objekt <path-like object>` utan några kodändringar, eller åtminstone mycket minimala sådana (t.ex. anrop av :func:`os.fspath` i början av koden innan ett sökvägsliknande objekt hanteras).

source: Here are some examples of how the new interface allows for :class:`pathlib.Path` to be used more easily and transparently with pre-existing code::
sv: Här är några exempel på hur det nya gränssnittet gör det möjligt att använda :class:`pathlib.Path` på ett enklare och mer transparent sätt med redan existerande kod::

source: (Implemented by Brett Cannon, Ethan Furman, Dusty Phillips, and Jelle Zijlstra.)
sv: (Implementerad av Brett Cannon, Ethan Furman, Dusty Phillips och Jelle Zijlstra.)

source: :pep:`519` -- Adding a file system path protocol
sv: :pep:`519` -- Lägga till ett protokoll för filsystemets sökväg

source: PEP written by Brett Cannon and Koos Zevenhoven.
sv: PEP skriven av Brett Cannon och Koos Zevenhoven.

source: PEP 495: Local Time Disambiguation
sv: PEP 495: Förtydligande av lokal tid

source: In most world locations, there have been and will be times when local clocks are moved back. In those times, intervals are introduced in which local clocks show the same time twice in the same day. In these situations, the information displayed on a local clock (or stored in a Python datetime instance) is insufficient to identify a particular moment in time.
sv: På de flesta platser i världen har det funnits och kommer att finnas tillfällen då lokala klockor flyttas tillbaka. Under dessa tider införs intervaller där lokala klockor visar samma tid två gånger under samma dag. I dessa situationer är den information som visas på en lokal klocka (eller lagras i en Python datetime-instans) otillräcklig för att identifiera en viss tidpunkt.

source: :pep:`495` adds the new *fold* attribute to instances of :class:`datetime.datetime` and :class:`datetime.time` classes to differentiate between two moments in time for which local times are the same::
sv: :pep:`495` lägger till det nya attributet *fold* till instanser av klasserna :class:`datetime.datetime` och :class:`datetime.time` för att skilja mellan två tidpunkter för vilka de lokala tiderna är desamma::

source: >>> u0 = datetime(2016, 11, 6, 4, tzinfo=timezone.utc) >>> for i in range(4): ... u = u0 + i*HOUR ... t = u.astimezone(Eastern) ... print(u.time(), 'UTC =', t.time(), t.tzname(), t.fold) ... 04:00:00 UTC = 00:00:00 EDT 0 05:00:00 UTC = 01:00:00 EDT 0 06:00:00 UTC = 01:00:00 EST 1 07:00:00 UTC = 02:00:00 EST 0
sv: >>> u0 = datetime(2016, 11, 6, 4, tzinfo=tidszon.utc) >>> för i i intervall(4): ... u = u0 + i*HOUR ... t = u.astimezone(Eastern) ... print(u.time(), 'UTC =', t.time(), t.tzname(), t.fold) ... 04:00:00 UTC = 00:00:00 EDT 0 05:00:00 UTC = 01:00:00 EDT 0 06:00:00 UTC = 01:00:00 EST 1 07:00:00 UTC = 02:00:00 EST 0

source: The values of the :attr:`fold <datetime.datetime.fold>` attribute have the value ``0`` for all instances except those that represent the second (chronologically) moment in time in an ambiguous case.
sv: Värdena för attributet :attr:`fold <datetime.datetime.fold>` har värdet ``0`` för alla instanser utom de som representerar det andra (kronologiska) ögonblicket i tiden i ett tvetydigt fall.

source: :pep:`495` -- Local Time Disambiguation
sv: :pep:`495` -- Förväxling av lokal tid

source: PEP written by Alexander Belopolsky and Tim Peters, implementation by Alexander Belopolsky.
sv: PEP skriven av Alexander Belopolsky och Tim Peters, implementation av Alexander Belopolsky.

source: PEP 529: Change Windows filesystem encoding to UTF-8
sv: PEP 529: Ändra kodning av Windows-filsystem till UTF-8

source: Representing filesystem paths is best performed with str (Unicode) rather than bytes. However, there are some situations where using bytes is sufficient and correct.
sv: Filsystemets sökvägar representeras bäst med str (Unicode) i stället för bytes. Det finns dock vissa situationer där det är tillräckligt och korrekt att använda bytes.

source: Prior to Python 3.6, data loss could result when using bytes paths on Windows. With this change, using bytes to represent paths is now supported on Windows, provided those bytes are encoded with the encoding returned by :func:`sys.getfilesystemencoding`, which now defaults to ``'utf-8'``.
sv: Före Python 3.6 kunde dataförlust uppstå när byte-sökvägar användes i Windows. Med denna ändring stöds nu användning av byte för att representera sökvägar i Windows, förutsatt att dessa byte är kodade med den kodning som returneras av :func:`sys.getfilesystemencoding`, som nu har ``'utf-8'`` som standard.

source: Applications that do not use str to represent paths should use :func:`os.fsencode` and :func:`os.fsdecode` to ensure their bytes are correctly encoded. To revert to the previous behaviour, set :envvar:`PYTHONLEGACYWINDOWSFSENCODING` or call :func:`sys._enablelegacywindowsfsencoding`.
sv: Program som inte använder str för att representera sökvägar bör använda :func:`os.fsencode` och :func:`os.fsdecode` för att säkerställa att deras byte är korrekt kodade. För att återgå till det tidigare beteendet, ställ in :envvar:`PYTHONLEGACYWINDOWSFSENCODING` eller anropa :func:`sys._enablelegacywindowsfsencoding`.

source: See :pep:`529` for more information and discussion of code modifications that may be required.
sv: Se :pep:`529` för mer information och diskussion om kodändringar som kan krävas.

source: PEP 528: Change Windows console encoding to UTF-8
sv: PEP 528: Ändra kodningen för Windows-konsolen till UTF-8

source: The default console on Windows will now accept all Unicode characters and provide correctly read str objects to Python code. ``sys.stdin``, ``sys.stdout`` and ``sys.stderr`` now default to utf-8 encoding.
sv: Standardkonsolen i Windows accepterar nu alla Unicode-tecken och ger korrekt lästa str-objekt till Python-kod. ``sys.stdin``, ``sys.stdout`` och ``sys.stderr`` använder nu utf-8-kodning som standard.

source: This change only applies when using an interactive console, and not when redirecting files or pipes. To revert to the previous behaviour for interactive console use, set :envvar:`PYTHONLEGACYWINDOWSSTDIO`.
sv: Den här ändringen gäller bara när du använder en interaktiv konsol och inte när du omdirigerar filer eller pipes. Om du vill återgå till det tidigare beteendet vid användning av en interaktiv konsol anger du :envvar:`PYTHONLEGACYWINDOWSSTDIO`.

source: :pep:`528` -- Change Windows console encoding to UTF-8
sv: :pep:`528` -- Ändra kodningen för Windows-konsolen till UTF-8

source: PEP written and implemented by Steve Dower.
sv: PEP skrivet och implementerat av Steve Dower.

source: PEP 520: Preserving Class Attribute Definition Order
sv: PEP 520: Bevarande av klassattributets definitionsordning

source: Attributes in a class definition body have a natural ordering: the same order in which the names appear in the source. This order is now preserved in the new class's :attr:`~type.__dict__` attribute.
sv: Attribut i en klassdefinition har en naturlig ordningsföljd: samma ordning som namnen förekommer i källan. Denna ordning bevaras nu i den nya klassens attribut :attr:`~type.__dict__`.

source: Also, the effective default class *execution* namespace (returned from :ref:`type.__prepare__() <prepare>`) is now an insertion-order-preserving mapping.
sv: Dessutom är den effektiva standardnamnrymden för klassen *execution* (returnerad från :ref:`type.__prepare__() <prepare>`) nu en mappning som bevarar insättningsordningen.

source: :pep:`520` -- Preserving Class Attribute Definition Order
sv: :pep:`520` -- Bevarande av klassattributets definitionsordning

source: PEP written and implemented by Eric Snow.
sv: PEP skrivet och implementerat av Eric Snow.

source: PEP 468: Preserving Keyword Argument Order
sv: PEP 468: Bevara ordningen på nyckelordsargument

source: ``**kwargs`` in a function signature is now guaranteed to be an insertion-order-preserving mapping.
sv: ``**kwargs`` i en funktionssignatur är nu garanterad att vara en mappning som bevarar insättningsordningen.

source: :pep:`468` -- Preserving Keyword Argument Order
sv: :pep:`468` -- Bevara ordningen på nyckelordsargument

source: New :ref:`dict <typesmapping>` implementation
sv: Ny :ref:`dict <typesmapping>` implementation

source: The :ref:`dict <typesmapping>` type now uses a "compact" representation based on `a proposal by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_ which was `first implemented by PyPy <https://morepypy.blogspot.com/2015/01/faster-more-memory-efficient-and-more.html>`_. The memory usage of the new :func:`dict` is between 20% and 25% smaller compared to Python 3.5.
sv: Typen :ref:`dict <typesmapping>` använder nu en "kompakt" representation baserad på `ett förslag av Raymond Hettinger &lt;https://mail.python.org/pipermail/python-dev/2012-December/123028.html&gt;`_ som `först implementerades av PyPy &lt;https://morepypy.blogspot.com/2015/01/faster-more-memory-efficient-and-more.html&gt;`_. Minnesanvändningen för den nya :func:`dict` är mellan 20% aoch 25% smaller jämfört med Python 3.5.

source: The order-preserving aspect of this new implementation is considered an implementation detail and should not be relied upon (this may change in the future, but it is desired to have this new dict implementation in the language for a few releases before changing the language spec to mandate order-preserving semantics for all current and future Python implementations; this also helps preserve backwards-compatibility with older versions of the language where random iteration order is still in effect, e.g. Python 3.5).
sv: Den orderbevarande aspekten av denna nya implementering betraktas som en implementeringsdetalj och bör inte förlitas på (detta kan ändras i framtiden, men det är önskvärt att ha denna nya dict-implementering i språket för några utgåvor innan språkspecifikationen ändras för att kräva orderbevarande semantik för alla nuvarande och framtida Python-implementeringar; detta hjälper också till att bevara bakåtkompatibilitet med äldre versioner av språket där slumpmässig iterationsordning fortfarande gäller, t.ex. Python 3.5).

source: (Contributed by INADA Naoki in :issue:`27350`. Idea `originally suggested by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_.)
sv: (Bidrag från INADA Naoki i :issue:`27350`. Idé `ursprungligen föreslagen av Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_.)

source: PEP 523: Adding a frame evaluation API to CPython
sv: PEP 523: Lägga till ett API för ramutvärdering i CPython

source: While Python provides extensive support to customize how code executes, one place it has not done so is in the evaluation of frame objects. If you wanted some way to intercept frame evaluation in Python there really wasn't any way without directly manipulating function pointers for defined functions.
sv: Även om Python ger omfattande stöd för att anpassa hur kod körs, är det ett ställe där det inte har gjort det i utvärderingen av ramobjekt. Om du ville ha något sätt att avlyssna ramutvärdering i Python fanns det verkligen inget sätt utan att direkt manipulera funktionspekare för definierade funktioner.

source: :pep:`523` changes this by providing an API to make frame evaluation pluggable at the C level. This will allow for tools such as debuggers and JITs to intercept frame evaluation before the execution of Python code begins. This enables the use of alternative evaluation implementations for Python code, tracking frame evaluation, etc.
sv: :pep:`523` ändrar detta genom att tillhandahålla ett API för att göra ramutvärdering pluggbar på C-nivå. Detta gör det möjligt för verktyg som debuggers och JITs att fånga upp ramutvärderingen innan exekveringen av Python-koden börjar. Detta gör det möjligt att använda alternativa utvärderingsimplementeringar för Python-kod, spåra ramutvärdering etc.

source: This API is not part of the limited C API and is marked as private to signal that usage of this API is expected to be limited and only applicable to very select, low-level use-cases. Semantics of the API will change with Python as necessary.
sv: Detta API är inte en del av det begränsade C API och är markerat som privat för att signalera att användningen av detta API förväntas vara begränsad och endast tillämplig på mycket utvalda användningsfall på låg nivå. Semantiken för API:et kommer att ändras med Python vid behov.

source: :pep:`523` -- Adding a frame evaluation API to CPython
sv: :pep:`523` -- Lägga till ett API för bildutvärdering i CPython

source: PEP written by Brett Cannon and Dino Viehland.
sv: PEP skriven av Brett Cannon och Dino Viehland.

source: PYTHONMALLOC environment variable
sv: PYTHONMALLOC miljövariabel

source: The new :envvar:`PYTHONMALLOC` environment variable allows setting the Python memory allocators and installing debug hooks.
sv: Den nya miljövariabeln :envvar:`PYTHONMALLOC` gör det möjligt att ställa in Pythons minnesallokatorer och installera debug-krokar.

source: It is now possible to install debug hooks on Python memory allocators on Python compiled in release mode using ``PYTHONMALLOC=debug``. Effects of debug hooks:
sv: Det är nu möjligt att installera debug-krokar på Python-minnesallokatorer på Python kompilerad i release-läge med ``PYTHONMALLOC=debug``. Effekter av debug-krokar:

source: Newly allocated memory is filled with the byte ``0xCB``
sv: Nytilldelat minne fylls med byte ``0xCB``

source: Freed memory is filled with the byte ``0xDB``
sv: Frigjort minne är fyllt med byte ``0xDB``

source: Detect violations of the Python memory allocator API. For example, :c:func:`PyObject_Free` called on a memory block allocated by :c:func:`PyMem_Malloc`.
sv: Upptäck brott mot Pythons API för minnesallokering. Till exempel, :c:func:`PyObject_Free` anropas på ett minnesblock som allokerats av :c:func:`PyMem_Malloc`.

source: Detect writes before the start of a buffer (buffer underflows)
sv: Upptäcka skrivningar före början av en buffert (buffer underflows)

source: Detect writes after the end of a buffer (buffer overflows)
sv: Upptäcka skrivningar efter slutet av en buffert (buffertöverskridanden)

source: Check that the :term:`GIL <global interpreter lock>` is held when allocator functions of :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) and :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) domains are called.
sv: Kontrollera att :term:`GIL <global interpreter lock>` hålls när allokeringsfunktioner i domänerna :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) och :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) anropas.

source: Checking if the GIL is held is also a new feature of Python 3.6.
sv: Att kontrollera om GIL hålls är också en ny funktion i Python 3.6.

source: See the :c:func:`PyMem_SetupDebugHooks` function for debug hooks on Python memory allocators.
sv: Se funktionen :c:func:`PyMem_SetupDebugHooks` för felsökningskrokar på Python-minnesallokatorer.

source: It is now also possible to force the usage of the :c:func:`malloc` allocator of the C library for all Python memory allocations using ``PYTHONMALLOC=malloc``. This is helpful when using external memory debuggers like Valgrind on a Python compiled in release mode.
sv: Det är nu också möjligt att tvinga fram användning av C-bibliotekets :c:func:`malloc`-allokering för alla Python-minnesallokeringar genom att använda ``PYTHONMALLOC=malloc``. Detta är användbart när man använder externa minnesdebuggar som Valgrind på en Python kompilerad i release-läge.

source: On error, the debug hooks on Python memory allocators now use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated.
sv: Vid fel använder felsökningskrokarna på Pythons minnesallokatorer nu modulen :mod:`tracemalloc` för att få spårningen där ett minnesblock allokerades.

source: Example of fatal error on buffer overflow using ``python3.6 -X tracemalloc=5`` (store 5 frames in traces)::
sv: Exempel på fatalt fel vid buffertöverskridning med ``python3.6 -X tracemalloc=5`` (lagra 5 bilder i spår)::

source: Debug memory block at address p=0x7fbcd41666f8: API 'o' 4 bytes originally requested The 7 pad bytes at p-7 are FORBIDDENBYTE, as expected. The 8 pad bytes at tail=0x7fbcd41666fc are not all FORBIDDENBYTE (0xfb): at tail+0: 0x02 *** OUCH at tail+1: 0xfb at tail+2: 0xfb at tail+3: 0xfb at tail+4: 0xfb at tail+5: 0xfb at tail+6: 0xfb at tail+7: 0xfb The block was made by call #1233329 to debug malloc/realloc. Data at p: 1a 2b 30 00 Memory block allocated at (most recent call first): File "test/test_bytes.py", line 323 File "unittest/case.py", line 600 File "unittest/case.py", line 648 File "unittest/suite.py", line 122 File "unittest/suite.py", line 84 Fatal Python error: bad trailing pad byte Current thread 0x00007fbcdbd32700 (most recent call first): File "test/test_bytes.py", line 323 in test_hex File "unittest/case.py", line 600 in run File "unittest/case.py", line 648 in __call__ File "unittest/suite.py", line 122 in run File "unittest/suite.py", line 84 in __call__ File "unittest/suite.py", line 122 in run File "unittest/suite.py", line 84 in __call__ ...
sv: Debug-minnesblock på adress p=0x7fbcd41666f8: API 'o' 4 byte ursprungligen begärda De 7 padbytena på p-7 är FORBIDDENBYTE, som förväntat. De 8 padbytena vid tail=0x7fbcd41666fc är inte alla FORBIDDENBYTE (0xfb): vid tail+0: 0x02 *** OUCH vid svans+1: 0xfb vid svans+2: 0xfb vid tail+3: 0xfb vid tail+4: 0xfb vid ingång+5: 0xfb vid svans+6: 0xfb vid svans+7: 0xfb Blocket skapades av anrop #1233329 för att felsöka malloc/realloc. Data på p: 1a 2b 30 00 Minnesblock allokerat vid (senaste anropet först): Fil "test/test_bytes.py", rad 323 Fil "unittest/case.py", rad 600 Fil "unittest/case.py", rad 648 Fil "unittest/suite.py", rad 122 Fil "unittest/suite.py", rad 84 Fatalt Python-fel: dålig efterföljande pad-byte Aktuell tråd 0x00007fbcdbd32700 (senaste anropet först): Fil "test/test_bytes.py", rad 323 i test_hex Fil "unittest/case.py", rad 600 i run Fil "unittest/case.py", rad 648 i __call__ Fil "unittest/suite.py", rad 122 i run Fil "unittest/suite.py", rad 84 i __call__ Fil "unittest/suite.py", rad 122 i run Fil "unittest/suite.py", rad 84 i __call__ ...

source: (Contributed by Victor Stinner in :issue:`26516` and :issue:`26564`.)
sv: (Bidrag från Victor Stinner i :issue:`26516` och :issue:`26564`.)

source: DTrace and SystemTap probing support
sv: Stöd för DTrace- och SystemTap-probing

source: Python can now be built ``--with-dtrace`` which enables static markers for the following events in the interpreter:
sv: Python kan nu byggas ``--med-dtrace`` vilket möjliggör statiska markörer för följande händelser i tolken:

source: function call/return
sv: funktion anrop/retur

source: garbage collection started/finished
sv: skräpinsamling påbörjad/avslutad

source: line of code executed.
sv: rad av kod som exekveras.

source: This can be used to instrument running interpreters in production, without the need to recompile specific :ref:`debug builds <debug-build>` or providing application-specific profiling/debugging code.
sv: Detta kan användas för att instrumentera tolkar som körs i produktion, utan att behöva kompilera om specifika :ref:`debug builds <debug-build>` eller tillhandahålla programspecifik profilerings-/debuggningskod.

source: More details in :ref:`instrumentation`.
sv: Mer information finns i :ref:`instrumentation`.

source: The current implementation is tested on Linux and macOS. Additional markers may be added in the future.
sv: Den nuvarande implementeringen testas på Linux och macOS. Ytterligare markörer kan komma att läggas till i framtiden.

source: (Contributed by Łukasz Langa in :issue:`21590`, based on patches by Jesús Cea Avión, David Malcolm, and Nikhil Benesch.)
sv: (Bidrag från Łukasz Langa i :issue:`21590`, baserat på korrigeringar av Jesús Cea Avión, David Malcolm och Nikhil Benesch.)

source: Other Language Changes
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:

source: A ``global`` or ``nonlocal`` statement must now textually appear before the first use of the affected name in the same scope. Previously this was a :exc:`SyntaxWarning`.
sv: Ett ``globalt`` eller ``icke-lokalt`` uttalande måste nu textuellt visas före den första användningen av det berörda namnet i samma scope. Tidigare var detta en :exc:`SyntaxWarning`.
