Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: Various implementation improvements in the :mod:`typing` module (such as caching of generic types) allow up to 30 times performance improvements and reduced memory footprint.
sv: Olika implementeringsförbättringar i modulen :mod:`typing` (t.ex. cachelagring av generiska typer) ger upp till 30 gånger bättre prestanda och minskat minnesavtryck.

source: The ASCII decoder is now up to 60 times as fast for error handlers ``surrogateescape``, ``ignore`` and ``replace`` (Contributed by Victor Stinner in :issue:`24870`).
sv: ASCII-avkodaren är nu upp till 60 gånger så snabb för felhanterarna ``surrogateescape``, ``ignore`` och ``replace`` (Bidrag från Victor Stinner i :issue:`24870`).

source: The ASCII and the Latin1 encoders are now up to 3 times as fast for the error handler ``surrogateescape`` (Contributed by Victor Stinner in :issue:`25227`).
sv: ASCII- och Latin1-kodarna är nu upp till 3 gånger så snabba för felhanteraren ``surrogateescape`` (Bidrag från Victor Stinner i :issue:`25227`).

source: The UTF-8 encoder is now up to 75 times as fast for error handlers ``ignore``, ``replace``, ``surrogateescape``, ``surrogatepass`` (Contributed by Victor Stinner in :issue:`25267`).
sv: UTF-8-kodaren är nu upp till 75 gånger så snabb för felhanterarna ``ignore``, ``replace``, ``surrogateescape``, ``surrogatepass`` (Bidrag från Victor Stinner i :issue:`25267`).

source: The UTF-8 decoder is now up to 15 times as fast for error handlers ``ignore``, ``replace`` and ``surrogateescape`` (Contributed by Victor Stinner in :issue:`25301`).
sv: UTF-8-avkodaren är nu upp till 15 gånger så snabb för felhanterarna ``ignore``, ``replace`` och ``surrogateescape`` (Bidrag från Victor Stinner i :issue:`25301`).

source: ``bytes % args`` is now up to 2 times faster. (Contributed by Victor Stinner in :issue:`25349`).
sv: ```bytes % args`` är nu upp till 2 gånger snabbare. (Bidrag från Victor Stinner i :issue:`25349`).

source: ``bytearray % args`` is now between 2.5 and 5 times faster. (Contributed by Victor Stinner in :issue:`25399`).
sv: ``bytearray % args`` är nu mellan 2,5 och 5 gånger snabbare. (Bidrag från Victor Stinner i :issue:`25399`).

source: Optimize :meth:`bytes.fromhex` and :meth:`bytearray.fromhex`: they are now between 2x and 3.5x faster. (Contributed by Victor Stinner in :issue:`25401`).
sv: Optimera :meth:`bytes.fromhex` och :meth:`bytearray.fromhex`: de är nu mellan 2x och 3,5x snabbare. (Bidrag från Victor Stinner i :issue:`25401`).

source: Optimize ``bytes.replace(b'', b'.')`` and ``bytearray.replace(b'', b'.')``: up to 80% faster. (Contributed by Josh Snider in :issue:`26574`).
sv: Optimera ``bytes.replace(b'', b'.'')`` och ``bytearray.replace(b'', b'.'')``: upp till 80% faster. (Bidrag från Josh Snider i :issue:`26574`).

source: Allocator functions of the :c:func:`PyMem_Malloc` domain (:c:macro:`PYMEM_DOMAIN_MEM`) now use the :ref:`pymalloc memory allocator <pymalloc>` instead of :c:func:`malloc` function of the C library. The pymalloc allocator is optimized for objects smaller or equal to 512 bytes with a short lifetime, and use :c:func:`malloc` for larger memory blocks. (Contributed by Victor Stinner in :issue:`26249`).
sv: Allokeringsfunktioner i :c:func:`PyMem_Malloc`-domänen (:c:macro:`PYMEM_DOMAIN_MEM`) använder nu :ref:`pymalloc memory allocator <pymalloc>` istället för :c:func:`malloc`-funktionen i C-biblioteket. Allokeringsfunktionen pymalloc är optimerad för objekt som är mindre än eller lika med 512 byte och har kort livslängd, medan :c:func:`malloc` används för större minnesblock. (Bidrag från Victor Stinner i :issue:`26249`).

source: :func:`pickle.load` and :func:`pickle.loads` are now up to 10% faster when deserializing many small objects (Contributed by Victor Stinner in :issue:`27056`).
sv: :func:`pickle.load` och :func:`pickle.loads` är nu upp till 10% faster när många små objekt deserialiseras (Bidrag från Victor Stinner i :issue:`27056`).

source: Passing :term:`keyword arguments <keyword argument>` to a function has an overhead in comparison with passing :term:`positional arguments <positional argument>`. Now in extension functions implemented with using Argument Clinic this overhead is significantly decreased. (Contributed by Serhiy Storchaka in :issue:`27574`).
sv: Att skicka :term:`keyword arguments <keyword argument>` till en funktion har en overhead i jämförelse med att skicka :term:`positional arguments <positional argument>`. I tilläggsfunktioner som implementeras med hjälp av Argument Clinic minskar nu denna overhead avsevärt. (Bidrag från Serhiy Storchaka i :issue:`27574`).

source: Optimized :func:`~glob.glob` and :func:`~glob.iglob` functions in the :mod:`glob` module; they are now about 3--6 times faster. (Contributed by Serhiy Storchaka in :issue:`25596`).
sv: Optimerade :func:`~glob.glob` och :func:`~glob.iglob` funktioner i :mod:`glob` modulen; de är nu ca 3--6 gånger snabbare. (Bidrag från Serhiy Storchaka i :issue:`25596`).

source: Optimized globbing in :mod:`pathlib` by using :func:`os.scandir`; it is now about 1.5--4 times faster. (Contributed by Serhiy Storchaka in :issue:`26032`).
sv: Optimerade globbing i :mod:`pathlib` genom att använda :func:`os.scandir`; det är nu ca 1,5--4 gånger snabbare. (Bidrag från Serhiy Storchaka i :issue:`26032`).

source: :class:`xml.etree.ElementTree` parsing, iteration and deepcopy performance has been significantly improved. (Contributed by Serhiy Storchaka in :issue:`25638`, :issue:`25873`, and :issue:`25869`.)
sv: :class:`xml.etree.ElementTree` prestanda för parsning, iteration och deepcopy har förbättrats avsevärt. (Bidrag från Serhiy Storchaka i :issue:`25638`, :issue:`25873`, och :issue:`25869`.)

source: Creation of :class:`fractions.Fraction` instances from floats and decimals is now 2 to 3 times faster. (Contributed by Serhiy Storchaka in :issue:`25971`.)
sv: Skapandet av :class:`fractions.Fraction`-instanser från floats och decimaler är nu 2 till 3 gånger snabbare. (Bidrag från Serhiy Storchaka i :issue:`25971`.)

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Python now requires some C99 support in the toolchain to build. Most notably, Python now uses standard integer types and macros in place of custom macros like ``PY_LONG_LONG``. For more information, see :pep:`7` and :issue:`17884`.
sv: Python kräver nu visst C99-stöd i verktygskedjan för att kunna byggas. Mest anmärkningsvärt är att Python nu använder standardiserade heltalstyper och makron i stället för anpassade makron som ``PY_LONG_LONG``. För mer information, se :pep:`7` och :issue:`17884`.

source: Cross-compiling CPython with the Android NDK and the Android API level set to 21 (Android 5.0 Lollipop) or greater runs successfully. While Android is not yet a supported platform, the Python test suite runs on the Android emulator with only about 16 tests failures. See the Android meta-issue :issue:`26865`.
sv: Korskompilering av CPython med Android NDK och Android API-nivå inställd på 21 (Android 5.0 Lollipop) eller högre körs framgångsrikt. Även om Android ännu inte är en plattform som stöds, körs Python-testsviten på Android-emulatorn med endast cirka 16 testfel. Se metaproblemet för Android :issue:`26865`.

source: The ``--enable-optimizations`` configure flag has been added. Turning it on will activate expensive optimizations like PGO. (Original patch by Alecsandru Patrascu of Intel in :issue:`26359`.)
sv: Konfigureringsflaggan ``--enable-optimizations`` har lagts till. Om den aktiveras kommer dyra optimeringar som PGO att aktiveras. (Ursprunglig patch av Alecsandru Patrascu från Intel i :issue:`26359`.)

source: The :term:`GIL <global interpreter lock>` must now be held when allocator functions of :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) and :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) domains are called.
sv: Nu måste :term:`GIL <global interpreter lock>` hållas när allokeringsfunktioner i domänerna :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) och :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) anropas.

source: New :c:func:`Py_FinalizeEx` API which indicates if flushing buffered data failed. (Contributed by Martin Panter in :issue:`5319`.)
sv: Nytt :c:func:`Py_FinalizeEx` API som indikerar om rensning av buffrad data misslyckades. (Bidrag från Martin Panter i :issue:`5319`.)

source: :c:func:`PyArg_ParseTupleAndKeywords` now supports :ref:`positional-only parameters <positional-only_parameter>`. Positional-only parameters are defined by empty names. (Contributed by Serhiy Storchaka in :issue:`26282`).
sv: :c:func:`PyArg_ParseTupleAndKeywords` har nu stöd för :ref:`parametrar som endast är positionella <positional-only_parameter>`. Endast positionella parametrar definieras av tomma namn. (Bidrag från Serhiy Storchaka i :issue:`26282`).

source: ``PyTraceback_Print`` method now abbreviates long sequences of repeated lines as ``"[Previous line repeated {count} more times]"``. (Contributed by Emanuel Barry in :issue:`26823`.)
sv: metoden ``PyTraceback_Print`` förkortar nu långa sekvenser av upprepade rader som ``"[Föregående rad upprepad {count} fler gånger]"``. (Bidrag från Emanuel Barry i :issue:`26823`.)

source: The new :c:func:`PyErr_SetImportErrorSubclass` function allows for specifying a subclass of :exc:`ImportError` to raise. (Contributed by Eric Snow in :issue:`15767`.)
sv: Den nya funktionen :c:func:`PyErr_SetImportErrorSubclass` gör det möjligt att specificera en underklass av :exc:`ImportError` som skall uppstå. (Bidrag från Eric Snow i :issue:`15767`.)

source: The new :c:func:`PyErr_ResourceWarning` function can be used to generate a :exc:`ResourceWarning` providing the source of the resource allocation. (Contributed by Victor Stinner in :issue:`26567`.)
sv: Den nya funktionen :c:func:`PyErr_ResourceWarning` kan användas för att generera en :exc:`ResourceWarning` som anger källan till resursallokeringen. (Bidrag från Victor Stinner i :issue:`26567`.)

source: The new :c:func:`PyOS_FSPath` function returns the file system representation of a :term:`path-like object`. (Contributed by Brett Cannon in :issue:`27186`.)
sv: Den nya funktionen :c:func:`PyOS_FSPath` returnerar filsystemets representation av ett :term:`path-liknande objekt`. (Bidrag från Brett Cannon i :issue:`27186`.)

source: The :c:func:`PyUnicode_FSConverter` and :c:func:`PyUnicode_FSDecoder` functions will now accept :term:`path-like objects <path-like object>`.
sv: Funktionerna :c:func:`PyUnicode_FSConverter` och :c:func:`PyUnicode_FSDecoder` accepterar nu :term:`path-like objects <path-like object>`.

source: Other Improvements
sv: Övriga förbättringar

source: When :option:`--version` (short form: :option:`-V`) is supplied twice, Python prints :data:`sys.version` for detailed information.
sv: När :option:`--version` (kortform: :option:`-V`) anges två gånger, skriver Python ut :data:`sys.version` för detaljerad information.

source: $ ./python -VV Python 3.6.0b4+ (3.6:223967b49e49+, Nov 21 2016, 20:55:04) [GCC 4.2.1 Compatible Apple LLVM 8.0.0 (clang-800.0.42.1)]
sv: $ ./python -VV Python 3.6.0b4+ (3.6:223967b49e49+, 21 nov 2016, 20:55:04) [GCC 4.2.1 Kompatibel Apple LLVM 8.0.0 (clang-800.0.42.1)]

source: Deprecated
sv: Föråldrat

source: New Keywords
sv: Nya nyckelord

source: ``async`` and ``await`` are not recommended to be used as variable, class, function or module names. Introduced by :pep:`492` in Python 3.5, they will become proper keywords in Python 3.7. Starting in Python 3.6, the use of ``async`` or ``await`` as names will generate a :exc:`DeprecationWarning`.
sv: ``async`` och ``await`` rekommenderas inte att användas som variabel-, klass-, funktions- eller modulnamn. De introducerades av :pep:`492` i Python 3.5 och kommer att bli riktiga nyckelord i Python 3.7. Från och med Python 3.6 kommer användningen av ``async`` eller ``await`` som namn att generera en :exc:`DeprecationWarning`.

source: Deprecated Python behavior
sv: Föråldrat Python-beteende

source: Raising the :exc:`StopIteration` exception inside a generator will now generate a :exc:`DeprecationWarning`, and will trigger a :exc:`RuntimeError` in Python 3.7. See :ref:`whatsnew-pep-479` for details.
sv: Om man väcker :exc:`StopIteration`-undantaget inuti en generator kommer det nu att generera en :exc:`DeprecationWarning`, och kommer att utlösa en :exc:`RuntimeError` i Python 3.7. Se :ref:`whatsnew-pep-479` för detaljer.

source: The :meth:`__aiter__` method is now expected to return an asynchronous iterator directly instead of returning an awaitable as previously. Doing the former will trigger a :exc:`DeprecationWarning`. Backward compatibility will be removed in Python 3.7. (Contributed by Yury Selivanov in :issue:`27243`.)
sv: Metoden :meth:`__aiter__` förväntas nu returnera en asynkron iterator direkt istället för att returnera en awaitable som tidigare. Att göra det förra kommer att utlösa en :exc:`DeprecationWarning`. Bakåtkompatibiliteten kommer att tas bort i Python 3.7. (Bidrag från Yury Selivanov i :issue:`27243`.)

source: A backslash-character pair that is not a valid escape sequence now generates a :exc:`DeprecationWarning`. Although this will eventually become a :exc:`SyntaxError`, that will not be for several Python releases. (Contributed by Emanuel Barry in :issue:`27364`.)
sv: Ett backslash-teckenpar som inte är en giltig escape-sekvens genererar nu en :exc:`DeprecationWarning`. Även om detta så småningom kommer att bli ett :exc:`SyntaxError`, kommer det inte att ske förrän efter flera Python-utgåvor. (Bidrag från Emanuel Barry i :issue:`27364`.)

source: When performing a relative import, falling back on ``__name__`` and ``__path__`` from the calling module when ``__spec__`` or ``__package__`` are not defined now raises an :exc:`ImportWarning`. (Contributed by Rose Ames in :issue:`25791`.)
sv: När man utför en relativ import och använder ``__name__`` och ``__path__`` från den anropande modulen när ``__spec__`` eller ``__package__`` inte är definierade, utlöses nu en :exc:`ImportWarning`. (Bidrag från Rose Ames i :issue:`25791`.)

source: Deprecated Python modules, functions and methods
sv: Föråldrade Python-moduler, -funktioner och -metoder

source: asynchat
sv: asynchatt

source: The :mod:`!asynchat` has been deprecated in favor of :mod:`asyncio`. (Contributed by Mariatta in :issue:`25002`.)
sv: :mod:`!asynchat` har utgått till förmån för :mod:`asyncio`. (Bidrag från Mariatta i :issue:`25002`.)

source: asyncore
sv: asynkron

source: The :mod:`!asyncore` has been deprecated in favor of :mod:`asyncio`. (Contributed by Mariatta in :issue:`25002`.)
sv: :mod:`!asyncore` har utgått till förmån för :mod:`asyncio`. (Bidrag från Mariatta i :issue:`25002`.)

source: Unlike other :mod:`dbm` implementations, the :mod:`dbm.dumb` module creates databases with the ``'rw'`` mode and allows modifying the database opened with the ``'r'`` mode. This behavior is now deprecated and will be removed in 3.8. (Contributed by Serhiy Storchaka in :issue:`21708`.)
sv: Till skillnad från andra :mod:`dbm`-implementationer skapar :mod:`dbm.dumb`-modulen databaser med läget ``'rw'`` och tillåter modifiering av databasen som öppnats med läget ``'r'``. Detta beteende är nu föråldrat och kommer att tas bort i 3.8. (Bidrag från Serhiy Storchaka i :issue:`21708`.)

source: The undocumented ``extra_path`` argument to the ``distutils.Distribution`` constructor is now considered deprecated and will raise a warning if set. Support for this parameter will be removed in a future Python release. See :issue:`27919` for details.
sv: Det odokumenterade ``extra_path``-argumentet till ``distutils.Distribution``-konstruktören anses nu vara föråldrat och kommer att ge upphov till en varning om det anges. Stöd för denna parameter kommer att tas bort i en framtida Python-version. Se :issue:`27919` för detaljer.

source: The support of non-integer arguments in :func:`~grp.getgrgid` has been deprecated. (Contributed by Serhiy Storchaka in :issue:`26129`.)
sv: Stödet för argument som inte är heltal i :func:`~grp.getgrgid` har tagits bort. (Bidrag från Serhiy Storchaka i :issue:`26129`.)

source: The :meth:`importlib.machinery.SourceFileLoader.load_module` and :meth:`importlib.machinery.SourcelessFileLoader.load_module` methods are now deprecated. They were the only remaining implementations of :meth:`importlib.abc.Loader.load_module` in :mod:`importlib` that had not been deprecated in previous versions of Python in favour of :meth:`importlib.abc.Loader.exec_module`.
sv: Metoderna :meth:`importlib.machinery.SourceFileLoader.load_module` och :meth:`importlib.machinery.SourcelessFileLoader.load_module` är nu föråldrade. De var de enda återstående implementationerna av :meth:`importlib.abc.Loader.load_module` i :mod:`importlib` som inte hade blivit avförda i tidigare versioner av Python till förmån för :meth:`importlib.abc.Loader.exec_module`.

source: The :class:`importlib.machinery.WindowsRegistryFinder` class is now deprecated. As of 3.6.0, it is still added to :data:`sys.meta_path` by default (on Windows), but this may change in future releases.
sv: Klassen :class:`importlib.machinery.WindowsRegistryFinder` är nu föråldrad. Från och med 3.6.0 läggs den fortfarande till i :data:`sys.meta_path` som standard (på Windows), men detta kan ändras i framtida versioner.

source: Undocumented support of general :term:`bytes-like objects <bytes-like object>` as paths in :mod:`os` functions, :func:`compile` and similar functions is now deprecated. (Contributed by Serhiy Storchaka in :issue:`25791` and :issue:`26754`.)
sv: Odokumenterat stöd för allmänna :term:`bytesliknande objekt <bytes-like object>` som sökvägar i :mod:`os`-funktioner, :func:`compile` och liknande funktioner är nu avfört. (Bidrag från Serhiy Storchaka i :issue:`25791` och :issue:`26754`.)

source: Support for inline flags ``(?letters)`` in the middle of the regular expression has been deprecated and will be removed in a future Python version. Flags at the start of a regular expression are still allowed. (Contributed by Serhiy Storchaka in :issue:`22493`.)
sv: Stöd för inline-flaggor ``(?letters)`` mitt i det reguljära uttrycket har föråldrats och kommer att tas bort i en framtida Python-version. Flaggor i början av ett reguljärt uttryck är fortfarande tillåtna. (Bidrag från Serhiy Storchaka i :issue:`22493`.)

source: OpenSSL 0.9.8, 1.0.0 and 1.0.1 are deprecated and no longer supported. In the future the :mod:`ssl` module will require at least OpenSSL 1.0.2 or 1.1.0.
sv: OpenSSL 0.9.8, 1.0.0 och 1.0.1 är föråldrade och stöds inte längre. I framtiden kommer modulen :mod:`ssl` att kräva minst OpenSSL 1.0.2 eller 1.1.0.

source: SSL-related arguments like ``certfile``, ``keyfile`` and ``check_hostname`` in :mod:`ftplib`, :mod:`http.client`, :mod:`imaplib`, :mod:`poplib`, and :mod:`smtplib` have been deprecated in favor of ``context``. (Contributed by Christian Heimes in :issue:`28022`.)
sv: SSL-relaterade argument som ``certfile``, ``keyfile`` och ``check_hostname`` i :mod:`ftplib`, :mod:`http.client`, :mod:`imaplib`, :mod:`poplib` och :mod:`smtplib` har utgått till förmån för ``context``. (Bidrag från Christian Heimes i :issue:`28022`.)

source: A couple of protocols and functions of the :mod:`ssl` module are now deprecated. Some features will no longer be available in future versions of OpenSSL. Other features are deprecated in favor of a different API. (Contributed by Christian Heimes in :issue:`28022` and :issue:`26470`.)
sv: Ett par protokoll och funktioner i modulen :mod:`ssl` är nu föråldrade. Vissa funktioner kommer inte längre att vara tillgängliga i framtida versioner av OpenSSL. Andra funktioner är utfasade till förmån för ett annat API. (Bidrag från Christian Heimes i :issue:`28022` och :issue:`26470`.)

source: The :mod:`!tkinter.tix` module is now deprecated. :mod:`tkinter` users should use :mod:`tkinter.ttk` instead.
sv: Modulen :mod:`!tkinter.tix` är nu föråldrad. :mod:`tkinter`-användare bör använda :mod:`tkinter.ttk` istället.

source: The ``pyvenv`` script has been deprecated in favour of ``python3 -m venv``. This prevents confusion as to what Python interpreter ``pyvenv`` is connected to and thus what Python interpreter will be used by the virtual environment. (Contributed by Brett Cannon in :issue:`25154`.)
sv: Skriptet ``pyvenv`` har utgått till förmån för ``python3 -m venv``. Detta förhindrar förvirring om vilken Python-tolk ``pyvenv`` är ansluten till och därmed vilken Python-tolk som kommer att användas av den virtuella miljön. (Bidrag från Brett Cannon i :issue:`25154`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :gh:`61441`.)
sv: Som en åtgärd mot hämtning av DTD:er och externa entiteter bearbetar modulerna :mod:`xml.dom.minidom` och :mod:`xml.sax` inte längre externa entiteter som standard. (Bidrag från Christian Heimes i :gh:`61441`.)

source: Deprecated functions and types of the C API
sv: Föråldrade funktioner och typer i C API

source: Undocumented functions :c:func:`!PyUnicode_AsEncodedObject`, :c:func:`!PyUnicode_AsDecodedObject`, :c:func:`!PyUnicode_AsEncodedUnicode` and :c:func:`!PyUnicode_AsDecodedUnicode` are deprecated now. Use the :ref:`generic codec based API <codec-registry>` instead.
sv: Odokumenterade funktioner :c:func:`!PyUnicode_AsEncodedObject`, :c:func:`!PyUnicode_AsDecodedObject`, :c:func:`!PyUnicode_AsEncodedUnicode` och :c:func:`!PyUnicode_AsDecodedUnicode` är nu föråldrade. Använd :ref:``generisk codec-baserad API <codec-registry>` istället.

source: Deprecated Build Options
sv: Föråldrade byggalternativ

source: The ``--with-system-ffi`` configure flag is now on by default on non-macOS UNIX platforms. It may be disabled by using ``--without-system-ffi``, but using the flag is deprecated and will not be accepted in Python 3.7. macOS is unaffected by this change. Note that many OS distributors already use the ``--with-system-ffi`` flag when building their system Python.
sv: Konfigurationsflaggan ``--with-system-ffi`` är nu aktiverad som standard på UNIX-plattformar som inte är macOS. Den kan inaktiveras genom att använda ``--without-system-ffi``, men att använda flaggan är föråldrat och kommer inte att accepteras i Python 3.7. macOS påverkas inte av denna ändring. Observera att många OS-distributörer redan använder flaggan ``--with-system-ffi`` när de bygger sina Python-system.

source: Removed
sv: Borttagen

source: API and Feature Removals
sv: Borttagning av API och funktioner

source: Unknown escapes consisting of ``'\'`` and an ASCII letter in regular expressions will now cause an error. In replacement templates for :func:`re.sub` they are still allowed, but deprecated. The :const:`re.LOCALE` flag can now only be used with binary patterns.
sv: Okända escapes bestående av ``'\'`` och en ASCII-bokstav i reguljära uttryck kommer nu att orsaka ett fel. I ersättningsmallar för :func:`re.sub` är de fortfarande tillåtna, men föråldrade. Flaggan :const:`re.LOCALE` kan nu endast användas med binära mönster.

source: ``inspect.getmoduleinfo()`` was removed (was deprecated since CPython 3.3). :func:`inspect.getmodulename` should be used for obtaining the module name for a given path. (Contributed by Yury Selivanov in :issue:`13248`.)
sv: ``inspect.getmoduleinfo()`` togs bort (var föråldrad sedan CPython 3.3). :func:``inspect.getmodulename`` bör användas för att få fram modulnamnet för en given sökväg. (Bidrag från Yury Selivanov i :issue:`13248`.)
