Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: It is now possible to set a :ref:`special method <specialnames>` to ``None`` to indicate that the corresponding operation is not available. For example, if a class sets :meth:`__iter__` to ``None``, the class is not iterable. (Contributed by Andrew Barnert and Ivan Levkivskyi in :issue:`25958`.)
sv: Det är nu möjligt att sätta en :ref:`specialmetod <specialnames>` till ``None`` för att ange att motsvarande operation inte är tillgänglig. Till exempel, om en klass sätter :meth:`__iter__` till ``None``, är klassen inte iterabel. (Bidrag från Andrew Barnert och Ivan Levkivskyi i :issue:`25958`.)

source: Long sequences of repeated traceback lines are now abbreviated as ``"[Previous line repeated {count} more times]"`` (see :ref:`whatsnew36-traceback` for an example). (Contributed by Emanuel Barry in :issue:`26823`.)
sv: Långa sekvenser av upprepade spårningsrader förkortas nu som ``"[Föregående rad upprepad {count} gånger till]"`` (se :ref:`whatsnew36-traceback` för ett exempel). (Bidrag från Emanuel Barry i :issue:`26823`.)

source: Import now raises the new exception :exc:`ModuleNotFoundError` (subclass of :exc:`ImportError`) when it cannot find a module. Code that currently checks for ImportError (in try-except) will still work. (Contributed by Eric Snow in :issue:`15767`.)
sv: Import ger nu det nya undantaget :exc:`ModuleNotFoundError` (underklass till :exc:`ImportError`) när den inte kan hitta en modul. Kod som för närvarande kontrollerar för ImportError (i try-except) kommer fortfarande att fungera. (Bidrag från Eric Snow i :issue:`15767`.)

source: Class methods relying on zero-argument ``super()`` will now work correctly when called from metaclass methods during class creation. (Contributed by Martin Teichmann in :issue:`23722`.)
sv: Klassmetoder som förlitar sig på ``super()`` med nollargument fungerar nu korrekt när de anropas från metaklassmetoder under skapandet av en klass. (Bidrag från Martin Teichmann i :issue:`23722`.)

source: New Modules
sv: Nya moduler

source: secrets
sv: hemligheter

source: The main purpose of the new :mod:`secrets` module is to provide an obvious way to reliably generate cryptographically strong pseudo-random values suitable for managing secrets, such as account authentication, tokens, and similar.
sv: Huvudsyftet med den nya modulen :mod:`secrets` är att tillhandahålla ett uppenbart sätt att på ett tillförlitligt sätt generera kryptografiskt starka pseudoslumpmässiga värden som är lämpliga för hantering av hemligheter, t.ex. kontoautentisering, tokens och liknande.

source: Note that the pseudo-random generators in the :mod:`random` module should *NOT* be used for security purposes. Use :mod:`secrets` on Python 3.6+ and :func:`os.urandom` on Python 3.5 and earlier.
sv: Observera att pseudoslumpgeneratorerna i modulen :mod:`random` * INTE* ska användas för säkerhetsändamål. Använd :mod:`secrets` på Python 3.6+ och :func:`os.urandom` på Python 3.5 och tidigare.

source: :pep:`506` -- Adding A Secrets Module To The Standard Library
sv: :pep:`506` -- Att lägga till en hemlighetsmodul i standardbiblioteket

source: PEP written and implemented by Steven D'Aprano.
sv: PEP skrivet och genomfört av Steven D'Aprano.

source: Improved Modules
sv: Förbättrade moduler

source: Exhausted iterators of :class:`array.array` will now stay exhausted even if the iterated array is extended. This is consistent with the behavior of other mutable sequences.
sv: Utmattade iteratorer av :class:`array.array` kommer nu att förbli utmattade även om den itererade arrayen utökas. Detta överensstämmer med beteendet hos andra muterbara sekvenser.

source: Contributed by Serhiy Storchaka in :issue:`26492`.
sv: Bidrag från Serhiy Storchaka i :issue:`26492`.

source: The new :class:`ast.Constant` AST node has been added. It can be used by external AST optimizers for the purposes of constant folding.
sv: Den nya :class:`ast.Constant` AST-noden har lagts till. Den kan användas av externa AST-optimerare i syfte att vika konstanter.

source: Contributed by Victor Stinner in :issue:`26146`.
sv: Bidrag från Victor Stinner i :issue:`26146`.

source: Starting with Python 3.6 the ``asyncio`` module is no longer provisional and its API is considered stable.
sv: Från och med Python 3.6 är modulen ``asyncio`` inte längre provisorisk och dess API anses vara stabilt.

source: Notable changes in the :mod:`asyncio` module since Python 3.5.0 (all backported to 3.5.x due to the provisional status):
sv: Noterbara ändringar i modulen :mod:`asyncio` sedan Python 3.5.0 (alla backporterade till 3.5.x på grund av den preliminära statusen):

source: The :func:`~asyncio.get_event_loop` function has been changed to always return the currently running loop when called from coroutines and callbacks. (Contributed by Yury Selivanov in :issue:`28613`.)
sv: Funktionen :func:`~asyncio.get_event_loop` har ändrats så att den alltid returnerar den pågående loopen när den anropas från coroutines och callbacks. (Bidrag från Yury Selivanov i :issue:`28613`.)

source: The :func:`~asyncio.ensure_future` function and all functions that use it, such as :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, now accept all kinds of :term:`awaitable objects <awaitable>`. (Contributed by Yury Selivanov.)
sv: Funktionen :func:`~asyncio.ensure_future` och alla funktioner som använder den, till exempel :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, accepterar nu alla typer av :term:`awaitable objects <awaitable>`. (Bidrag från Yury Selivanov.)

source: New :func:`~asyncio.run_coroutine_threadsafe` function to submit coroutines to event loops from other threads. (Contributed by Vincent Michel.)
sv: Ny :func:`~asyncio.run_coroutine_threadsafe`-funktion för att skicka coroutines till händelseslingor från andra trådar. (Bidrag från Vincent Michel.)

source: New :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` method to check if the transport is closing or closed. (Contributed by Yury Selivanov.)
sv: Ny :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>`-metod för att kontrollera om transporten stängs eller stängs. (Bidrag från Yury Selivanov.)

source: The :meth:`loop.create_server() <asyncio.loop.create_server>` method can now accept a list of hosts. (Contributed by Yann Sionneau.)
sv: Metoden :meth:`loop.create_server() <asyncio.loop.create_server>` kan nu acceptera en lista med värdar. (Bidrag från Yann Sionneau.)

source: New :meth:`loop.create_future() <asyncio.loop.create_future>` method to create Future objects. This allows alternative event loop implementations, such as `uvloop <https://github.com/MagicStack/uvloop>`_, to provide a faster :class:`asyncio.Future` implementation. (Contributed by Yury Selivanov in :issue:`27041`.)
sv: Ny :meth:`loop.create_future() <asyncio.loop.create_future>`-metod för att skapa Future-objekt. Detta gör det möjligt för alternativa implementationer av händelseslingor, som `uvloop <https://github.com/MagicStack/uvloop>`_, att tillhandahålla en snabbare :class:`asyncio.Future`-implementation. (Bidrag från Yury Selivanov i :issue:`27041`.)

source: New :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>` method to get the current exception handler. (Contributed by Yury Selivanov in :issue:`27040`.)
sv: Ny :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>`-metod för att hämta den aktuella undantagshanteraren. (Bidrag från Yury Selivanov i :issue:`27040`.)

source: New :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` method to read data from the stream until a separator bytes sequence appears. (Contributed by Mark Korenberg.)
sv: Ny :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>`-metod för att läsa data från strömmen tills en separatorbyte-sekvens visas. (Bidrag från Mark Korenberg.)

source: The performance of :meth:`StreamReader.readexactly() <asyncio.StreamReader.readexactly>` has been improved. (Contributed by Mark Korenberg in :issue:`28370`.)
sv: Prestandan för :meth:`StreamReader.readexactly() <asyncio.StreamReader.readexactly>` har förbättrats. (Bidrag från Mark Korenberg i :issue:`28370`.)

source: The :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>` method is optimized to avoid calling the system ``getaddrinfo`` function if the address is already resolved. (Contributed by A. Jesse Jiryu Davis.)
sv: Metoden :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>` är optimerad för att undvika att anropa systemets funktion ``getaddrinfo`` om adressen redan är löst. (Bidrag från A. Jesse Jiryu Davis.)

source: The :meth:`loop.stop() <asyncio.loop.stop>` method has been changed to stop the loop immediately after the current iteration. Any new callbacks scheduled as a result of the last iteration will be discarded. (Contributed by Guido van Rossum in :issue:`25593`.)
sv: Metoden :meth:`loop.stop() <asyncio.loop.stop>` har ändrats så att den stoppar loopen omedelbart efter den aktuella iterationen. Alla nya återuppringningar som schemalagts som ett resultat av den senaste iterationen kommer att kasseras. (Bidrag från Guido van Rossum i :issue:`25593`.)

source: :meth:`Future.set_exception <asyncio.futures.Future.set_exception>` will now raise :exc:`TypeError` when passed an instance of the :exc:`StopIteration` exception. (Contributed by Chris Angelico in :issue:`26221`.)
sv: :meth:`Future.set_exception <asyncio.futures.Future.set_exception>` kommer nu att ge upphov till :exc:`TypeError` när en instans av undantaget :exc:`StopIteration` skickas. (Bidrag från Chris Angelico i :issue:`26221`.)

source: New :meth:`loop.connect_accepted_socket() <asyncio.loop.connect_accepted_socket>` method to be used by servers that accept connections outside of asyncio, but that use asyncio to handle them. (Contributed by Jim Fulton in :issue:`27392`.)
sv: Ny :meth:`loop.connect_accepted_socket() <asyncio.loop.connect_accepted_socket>` metod att användas av servrar som accepterar anslutningar utanför asyncio, men som använder asyncio för att hantera dem. (Bidrag från Jim Fulton i :issue:`27392`.)

source: ``TCP_NODELAY`` flag is now set for all TCP transports by default. (Contributed by Yury Selivanov in :issue:`27456`.)
sv: flaggan ``TCP_NODELAY`` är nu inställd som standard för alla TCP-transporter. (Bidrag från Yury Selivanov i :issue:`27456`.)

source: New :meth:`loop.shutdown_asyncgens() <asyncio.loop.shutdown_asyncgens>` to properly close pending asynchronous generators before closing the loop. (Contributed by Yury Selivanov in :issue:`28003`.)
sv: Ny :meth:`loop.shutdown_asyncgens() <asyncio.loop.shutdown_asyncgens>` för att korrekt stänga väntande asynkrona generatorer innan loopen stängs. (Bidrag från Yury Selivanov i :issue:`28003`.)

source: :class:`Future <asyncio.Future>` and :class:`Task <asyncio.Task>` classes now have an optimized C implementation which makes asyncio code up to 30% faster. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26081` and :issue:`28544`.)
sv: klasserna :class:`Future <asyncio.Future>` och :class:`Task <asyncio.Task>` har nu en optimerad C-implementation som gör asynciokoden upp till 30% faster. (Bidrag från Yury Selivanov och INADA Naoki i :issue:`26081` och :issue:`28544`.)

source: The :func:`~binascii.b2a_base64` function now accepts an optional *newline* keyword argument to control whether the newline character is appended to the return value. (Contributed by Victor Stinner in :issue:`25357`.)
sv: Funktionen :func:`~binascii.b2a_base64` accepterar nu ett valfritt *newline* nyckelordsargument för att kontrollera om newline-tecknet skall läggas till i returvärdet. (Bidrag från Victor Stinner i :issue:`25357`.)

source: The new :const:`cmath.tau` (*τ*) constant has been added. (Contributed by Lisa Roach in :issue:`12345`, see :pep:`628` for details.)
sv: Den nya konstanten :const:`cmath.tau` (*τ*) har lagts till. (Bidrag från Lisa Roach i :issue:`12345`, se :pep:`628` för detaljer.)

source: New constants: :const:`cmath.inf` and :const:`cmath.nan` to match :const:`math.inf` and :const:`math.nan`, and also :const:`cmath.infj` and :const:`cmath.nanj` to match the format used by complex repr. (Contributed by Mark Dickinson in :issue:`23229`.)
sv: Nya konstanter: :const:`cmath.inf` och :const:`cmath.nan` för att matcha :const:`math.inf` och :const:`math.nan`, och även :const:`cmath.infj` och :const:`cmath.nanj` för att matcha det format som används av complex repr. (Bidrag från Mark Dickinson i :issue:`23229`.)

source: collections
sv: samlingar

source: The new :class:`~collections.abc.Collection` abstract base class has been added to represent sized iterable container classes. (Contributed by Ivan Levkivskyi, docs by Neil Girdhar in :issue:`27598`.)
sv: Den nya abstrakta basklassen :class:`~collections.abc.Collection` har lagts till för att representera stora iterabla containerklasser. (Bidrag från Ivan Levkivskyi, dokument av Neil Girdhar i :issue:`27598`.)

source: The new :class:`~collections.abc.Reversible` abstract base class represents iterable classes that also provide the :meth:`__reversed__` method. (Contributed by Ivan Levkivskyi in :issue:`25987`.)
sv: Den nya abstrakta basklassen :class:`~collections.abc.Reversible` representerar iterabla klasser som också tillhandahåller metoden :meth:`__reversed__`. (Bidrag från Ivan Levkivskyi i :issue:`25987`.)

source: The new :class:`~collections.abc.AsyncGenerator` abstract base class represents asynchronous generators. (Contributed by Yury Selivanov in :issue:`28720`.)
sv: Den nya :class:`~collections.abc.AsyncGenerator` abstrakta basklassen representerar asynkrona generatorer. (Bidrag från Yury Selivanov i :issue:`28720`.)

source: The :func:`~collections.namedtuple` function now accepts an optional keyword argument *module*, which, when specified, is used for the :attr:`~type.__module__` attribute of the returned named tuple class. (Contributed by Raymond Hettinger in :issue:`17941`.)
sv: Funktionen :func:`~collections.namedtuple` accepterar nu ett valfritt nyckelordsargument *module*, som när det anges används för attributet :attr:`~type.__module__` i den returnerade namngivna tuple-klassen. (Bidrag från Raymond Hettinger i :issue:`17941`.)

source: The *verbose* and *rename* arguments for :func:`~collections.namedtuple` are now keyword-only. (Contributed by Raymond Hettinger in :issue:`25628`.)
sv: Argumenten *verbose* och *rename* för :func:`~collections.namedtuple` är nu endast nyckelord. (Bidrag från Raymond Hettinger i :issue:`25628`.)

source: Recursive :class:`collections.deque` instances can now be pickled. (Contributed by Serhiy Storchaka in :issue:`26482`.)
sv: Rekursiva :class:`collections.deque`-instanser kan nu picklas. (Bidrag från Serhiy Storchaka i :issue:`26482`.)

source: The :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` class constructor now accepts an optional *thread_name_prefix* argument to make it possible to customize the names of the threads created by the pool. (Contributed by Gregory P. Smith in :issue:`27664`.)
sv: Klassens :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>`-konstruktor accepterar nu ett valfritt *thread_name_prefix*-argument för att göra det möjligt att anpassa namnen på de trådar som skapas av poolen. (Bidrag från Gregory P. Smith i :issue:`27664`.)

source: The :class:`contextlib.AbstractContextManager` class has been added to provide an abstract base class for context managers. It provides a sensible default implementation for ``__enter__()`` which returns ``self`` and leaves ``__exit__()`` an abstract method. A matching class has been added to the :mod:`typing` module as :class:`typing.ContextManager`. (Contributed by Brett Cannon in :issue:`25609`.)
sv: Klassen :class:`contextlib.AbstractContextManager` har lagts till för att tillhandahålla en abstrakt basklass för kontexthanterare. Den tillhandahåller en förnuftig standardimplementation för ``__enter__()`` som returnerar ``self`` och lämnar ``__exit__()`` som en abstrakt metod. En matchande klass har lagts till i modulen :mod:`typing` som :class:`typing.ContextManager`. (Bidrag från Brett Cannon i :issue:`25609`.)

source: datetime
sv: datatid

source: The :class:`~datetime.datetime` and :class:`~datetime.time` classes have the new :attr:`~time.fold` attribute used to disambiguate local time when necessary. Many functions in the :mod:`datetime` have been updated to support local time disambiguation. See :ref:`Local Time Disambiguation <whatsnew36-pep495>` section for more information. (Contributed by Alexander Belopolsky in :issue:`24773`.)
sv: Klasserna :class:`~datetime.datetime` och :class:`~datetime.time` har det nya attributet :attr:`~time.fold` som används för att särskilja lokal tid när det behövs. Många funktioner i :mod:`datetime` har uppdaterats för att stödja entydighet av lokal tid. Se :ref:`Local Time Disambiguation <whatsnew36-pep495>` avsnittet för mer information. (Bidrag från Alexander Belopolsky i :issue:`24773`.)

source: The :meth:`datetime.strftime() <datetime.datetime.strftime>` and :meth:`date.strftime() <datetime.date.strftime>` methods now support ISO 8601 date directives ``%G``, ``%u`` and ``%V``. (Contributed by Ashley Anderson in :issue:`12006`.)
sv: Metoderna :meth:`datetime.strftime() <datetime.datetime.strftime>` och :meth:`date.strftime() <datetime.date.strftime>` stöder nu ISO 8601-datadirektiven ``%G``, ``%u`` och ``%V``. (Bidrag från Ashley Anderson i :issue:`12006`.)

source: The :func:`datetime.isoformat() <datetime.datetime.isoformat>` function now accepts an optional *timespec* argument that specifies the number of additional components of the time value to include. (Contributed by Alessandro Cucci and Alexander Belopolsky in :issue:`19475`.)
sv: Funktionen :func:`datetime.isoformat() <datetime.datetime.isoformat>` accepterar nu ett valfritt *timespec*-argument som anger antalet ytterligare komponenter i tidsvärdet som ska inkluderas. (Bidrag från Alessandro Cucci och Alexander Belopolsky i :issue:`19475`.)

source: The :meth:`datetime.combine() <datetime.datetime.combine>` now accepts an optional *tzinfo* argument. (Contributed by Alexander Belopolsky in :issue:`27661`.)
sv: :meth:`datetime.combine() <datetime.datetime.combine>` accepterar nu ett valfritt *tzinfo*-argument. (Bidrag från Alexander Belopolsky i :issue:`27661`.)

source: New :meth:`Decimal.as_integer_ratio() <decimal.Decimal.as_integer_ratio>` method that returns a pair ``(n, d)`` of integers that represent the given :class:`~decimal.Decimal` instance as a fraction, in lowest terms and with a positive denominator::
sv: Ny :meth:`Decimal.as_integer_ratio() <decimal.Decimal.as_integer_ratio>`-metod som returnerar ett par ``(n, d)`` heltal som representerar den givna :class:`~decimal.Decimal`-instansen som ett bråk, i lägsta termer och med en positiv nämnare::

source: (Contributed by Stefan Krah amd Mark Dickinson in :issue:`25928`.)
sv: (Bidrag från Stefan Krah och Mark Dickinson i :issue:`25928`.)

source: The ``default_format`` attribute has been removed from ``distutils.command.sdist.sdist`` and the ``formats`` attribute defaults to ``['gztar']``. Although not anticipated, any code relying on the presence of ``default_format`` may need to be adapted. See :issue:`27819` for more details.
sv: Attributet ``default_format`` har tagits bort från ``distutils.command.sdist.sdist`` och attributet ``formats`` har ``['gztar']`` som standard. Även om det inte är förväntat, kan all kod som förlitar sig på förekomsten av ``default_format`` behöva anpassas. Se :issue:`27819` för mer information.

source: email
sv: e-post

source: The new email API, enabled via the *policy* keyword to various constructors, is no longer provisional. The :mod:`email` documentation has been reorganized and rewritten to focus on the new API, while retaining the old documentation for the legacy API. (Contributed by R. David Murray in :issue:`24277`.)
sv: Det nya API:et för e-post, som aktiveras via nyckelordet *policy* i olika konstruktörer, är inte längre provisoriskt. Dokumentationen för :mod:`email` har omorganiserats och skrivits om för att fokusera på det nya API:et, medan den gamla dokumentationen för det äldre API:et har behållits. (Bidrag från R. David Murray i :issue:`24277`.)

source: The :mod:`email.mime` classes now all accept an optional *policy* keyword. (Contributed by Berker Peksag in :issue:`27331`.)
sv: Klasserna :mod:`email.mime` accepterar nu alla ett valfritt nyckelord *policy*. (Bidrag från Berker Peksag i :issue:`27331`.)

source: The :class:`~email.generator.DecodedGenerator` now supports the *policy* keyword.
sv: Klassen:`~email.generator.DecodedGenerator` har nu stöd för nyckelordet *policy*.

source: There is a new :mod:`~email.policy` attribute, :attr:`~email.policy.Policy.message_factory`, that controls what class is used by default when the parser creates new message objects. For the :attr:`email.policy.compat32` policy this is :class:`~email.message.Message`, for the new policies it is :class:`~email.message.EmailMessage`. (Contributed by R. David Murray in :issue:`20476`.)
sv: Det finns ett nytt attribut :mod:`~email.policy`, :attr:`~email.policy.Policy.message_factory`, som styr vilken klass som används som standard när parsern skapar nya meddelandeobjekt. För policyn :attr:`email.policy.compat32` är detta :class:`~email.message.Message`, för de nya policyerna är det :class:`~email.message.EmailMessage`. (Bidrag från R. David Murray i :issue:`20476`.)

source: encodings
sv: kodningar

source: On Windows, added the ``'oem'`` encoding to use ``CP_OEMCP``, and the ``'ansi'`` alias for the existing ``'mbcs'`` encoding, which uses the ``CP_ACP`` code page. (Contributed by Steve Dower in :issue:`27959`.)
sv: I Windows har kodningen ``'oem`` lagts till för att använda ``CP_OEMCP``, och aliaset ``'ansi`` för den befintliga kodningen ``'mbcs``, som använder kodsidan ``CP_ACP``. (Bidrag från Steve Dower i :issue:`27959`.)

source: Two new enumeration base classes have been added to the :mod:`enum` module: :class:`~enum.Flag` and :class:`~enum.IntFlags`. Both are used to define constants that can be combined using the bitwise operators. (Contributed by Ethan Furman in :issue:`23591`.)
sv: Två nya basklasser för uppräkning har lagts till i modulen :mod:`enum`: :class:`~enum.Flag` och :class:`~enum.IntFlags`. Båda används för att definiera konstanter som kan kombineras med bitvisa operatorer. (Bidrag från Ethan Furman i :issue:`23591`.)

source: Many standard library modules have been updated to use the :class:`~enum.IntFlags` class for their constants.
sv: Många standardbiblioteksmoduler har uppdaterats så att de använder klassen :class:`~enum.IntFlags` för sina konstanter.

source: The new :class:`enum.auto` value can be used to assign values to enum members automatically::
sv: Det nya :class:`enum.auto`-värdet kan användas för att automatiskt tilldela värden till enum-medlemmar::

source: >>> from enum import Enum, auto >>> class Color(Enum): ... red = auto() ... blue = auto() ... green = auto() ... >>> list(Color) [<Color.red: 1>, <Color.blue: 2>, <Color.green: 3>]
sv: >>> from enum import Enum, auto >>> klass Färg(Enum): ... röd = auto() ... blå = auto() ... grön = auto() ... >>> list(Färg) [<Color.red: 1>, <Color.blue: 2>, <Color.green: 3>]

source: faulthandler
sv: felhanterare

source: On Windows, the :mod:`faulthandler` module now installs a handler for Windows exceptions: see :func:`faulthandler.enable`. (Contributed by Victor Stinner in :issue:`23848`.)
sv: I Windows installerar modulen :mod:`faulthandler` nu en hanterare för Windows-undantag: se :func:`faulthandler.enable`. (Bidrag från Victor Stinner i :issue:`23848`.)

source: fileinput
sv: filinmatning
