Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: What's New In Python 3.6
sv: Vad är nytt i Python 3.6

source: Editors
sv: Redigerare

source: This article explains the new features in Python 3.6, compared to 3.5. Python 3.6 was released on December 23, 2016. See the `changelog <https://docs.python.org/3.6/whatsnew/changelog.html>`_ for a full list of changes.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.6 jämfört med 3.5. Python 3.6 släpptes den 23 december 2016. Se `changelog <https://docs.python.org/3.6/whatsnew/changelog.html>`_ för en fullständig lista över ändringar.

source: :pep:`494` - Python 3.6 Release Schedule
sv: :pep:`494` - Python 3.6 Utgivningsschema

source: Summary -- Release highlights
sv: Sammanfattning -- Release highlights

source: New syntax features:
sv: Nya syntaxfunktioner:

source: :ref:`PEP 498 <whatsnew36-pep498>`, formatted string literals.
sv: :ref:`PEP 498 <whatsnew36-pep498>`, formaterade stränglitteraler.

source: :ref:`PEP 515 <whatsnew36-pep515>`, underscores in numeric literals.
sv: :ref:`PEP 515 <whatsnew36-pep515>`, understrykningstecken i numeriska literaler.

source: :ref:`PEP 526 <whatsnew36-pep526>`, syntax for variable annotations.
sv: :ref:`PEP 526 <whatsnew36-pep526>`, syntax för variabelkommentarer.

source: :ref:`PEP 525 <whatsnew36-pep525>`, asynchronous generators.
sv: :ref:`PEP 525 <whatsnew36-pep525>`, asynkrona generatorer.

source: :ref:`PEP 530 <whatsnew36-pep530>`: asynchronous comprehensions.
sv: :ref:`PEP 530 <whatsnew36-pep530>`: asynkrona förståelser.

source: New library modules:
sv: Nya biblioteksmoduler:

source: :mod:`secrets`: :ref:`PEP 506 -- Adding A Secrets Module To The Standard Library <whatsnew36-pep506>`.
sv: :mod:`secrets`: :ref:`PEP 506 -- Att lägga till en Secrets-modul till standardbiblioteket <whatsnew36-pep506>`.

source: CPython implementation improvements:
sv: Förbättringar av CPython-implementeringen:

source: The :ref:`dict <typesmapping>` type has been reimplemented to use a :ref:`more compact representation <whatsnew36-compactdict>` based on `a proposal by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_ and similar to the `PyPy dict implementation`_. This resulted in dictionaries using 20% to 25% less memory when compared to Python 3.5.
sv: Typen :ref:`dict <typesmapping>` har omimplementerats för att använda en :ref:`mer kompakt representation <whatsnew36-compactdict>` baserad på `ett förslag av Raymond Hettinger &lt;https://mail.python.org/pipermail/python-dev/2012-December/123028.html&gt;`_ och liknande `PyPy dict-implementationen`_. Detta resulterade i att ordböcker använde 20% to 25% less minne jämfört med Python 3.5.

source: Customization of class creation has been simplified with the :ref:`new protocol <whatsnew36-pep487>`.
sv: Anpassning av klassskapande har förenklats med :ref:`nytt protokoll <whatsnew36-pep487>`.

source: The class attribute definition order is :ref:`now preserved <whatsnew36-pep520>`.
sv: Klassattributets definitionsordning är :ref:`now preserved <whatsnew36-pep520>`.

source: The order of elements in ``**kwargs`` now :ref:`corresponds to the order <whatsnew36-pep468>` in which keyword arguments were passed to the function.
sv: Ordningen på elementen i ``**kwargs`` motsvarar nu :ref:``ordningen <whatsnew36-pep468>` i vilken nyckelordsargumenten skickades till funktionen.

source: DTrace and SystemTap :ref:`probing support <whatsnew36-tracing>` has been added.
sv: DTrace och SystemTap :ref:``probing support <whatsnew36-tracing>`` har lagts till.

source: The new :ref:`PYTHONMALLOC <whatsnew36-pythonmalloc>` environment variable can now be used to debug the interpreter memory allocation and access errors.
sv: Den nya miljövariabeln :ref:`PYTHONMALLOC <whatsnew36-pythonmalloc>` kan nu användas för att felsöka fel i tolkens minnesallokering och åtkomst.

source: Significant improvements in the standard library:
sv: Betydande förbättringar i standardbiblioteket:

source: The :mod:`asyncio` module has received new features, significant usability and performance improvements, and a fair amount of bug fixes. Starting with Python 3.6 the ``asyncio`` module is no longer provisional and its API is considered stable.
sv: Modulen :mod:`asyncio` har fått nya funktioner, betydande förbättringar av användbarhet och prestanda samt en hel del buggfixar. Från och med Python 3.6 är modulen ``asyncio`` inte längre provisorisk och dess API anses vara stabilt.

source: A new :ref:`file system path protocol <whatsnew36-pep519>` has been implemented to support :term:`path-like objects <path-like object>`. All standard library functions operating on paths have been updated to work with the new protocol.
sv: Ett nytt :ref:`filsystemets sökvägsprotokoll <whatsnew36-pep519>` har implementerats för att stödja :term:`sökvägsliknande objekt <path-like object>`. Alla standardbiblioteksfunktioner som arbetar med sökvägar har uppdaterats för att fungera med det nya protokollet.

source: The :mod:`datetime` module has gained support for :ref:`Local Time Disambiguation <whatsnew36-pep495>`.
sv: Modulen :mod:`datetime` har fått stöd för :ref:`Local Time Disambiguation <whatsnew36-pep495>`.

source: The :mod:`typing` module received a number of :ref:`improvements <whatsnew36-typing>`.
sv: Modulen :mod:`typing` har fått ett antal :ref:`förbättringar <whatsnew36-typing>`.

source: The :mod:`tracemalloc` module has been significantly reworked and is now used to provide better output for :exc:`ResourceWarning` as well as provide better diagnostics for memory allocation errors. See the :ref:`PYTHONMALLOC section <whatsnew36-pythonmalloc>` for more information.
sv: Modulen :mod:`tracemalloc` har omarbetats avsevärt och används nu för att ge bättre utdata för :exc:`ResourceWarning` samt för att ge bättre diagnostik för minnesallokeringsfel. Se :ref:`PYTHONMALLOC-avsnittet <whatsnew36-pythonmalloc>` för mer information.

source: Security improvements:
sv: Förbättringar av säkerheten:

source: The new :mod:`secrets` module has been added to simplify the generation of cryptographically strong pseudo-random numbers suitable for managing secrets such as account authentication, tokens, and similar.
sv: Den nya modulen :mod:`secrets` har lagts till för att förenkla genereringen av kryptografiskt starka pseudoslumptal som lämpar sig för hantering av hemligheter som kontoautentisering, tokens och liknande.

source: On Linux, :func:`os.urandom` now blocks until the system urandom entropy pool is initialized to increase the security. See the :pep:`524` for the rationale.
sv: På Linux blockerar :func:`os.urandom` nu tills systemets urandom-entropipool har initialiserats för att öka säkerheten. Se :pep:`524` för förklaringen.

source: The :mod:`hashlib` and :mod:`ssl` modules now support OpenSSL 1.1.0.
sv: Modulerna :mod:`hashlib` och :mod:`ssl` har nu stöd för OpenSSL 1.1.0.

source: The default settings and feature set of the :mod:`ssl` module have been improved.
sv: Standardinställningarna och funktionsuppsättningen för modulen :mod:`ssl` har förbättrats.

source: The :mod:`hashlib` module received support for the BLAKE2, SHA-3 and SHAKE hash algorithms and the :func:`~hashlib.scrypt` key derivation function.
sv: Modulen :mod:`hashlib` fick stöd för hashalgoritmerna BLAKE2, SHA-3 och SHAKE samt nyckelavledningsfunktionen :func:`~hashlib.scrypt`.

source: Windows improvements:
sv: Förbättringar i Windows:

source: :ref:`PEP 528 <whatsnew36-pep528>` and :ref:`PEP 529 <whatsnew36-pep529>`, Windows filesystem and console encoding changed to UTF-8.
sv: :ref:`PEP 528 <whatsnew36-pep528>` och :ref:`PEP 529 <whatsnew36-pep529>`, Windows filsystem och konsolkodning ändras till UTF-8.

source: The ``py.exe`` launcher, when used interactively, no longer prefers Python 2 over Python 3 when the user doesn't specify a version (via command line arguments or a config file). Handling of shebang lines remains unchanged - "python" refers to Python 2 in that case.
sv: Startprogrammet ``py.exe``, när det används interaktivt, föredrar inte längre Python 2 framför Python 3 när användaren inte anger någon version (via kommandoradsargument eller en konfigurationsfil). Hanteringen av shebang-rader förblir oförändrad - "python" hänvisar till Python 2 i det fallet.

source: ``python.exe`` and ``pythonw.exe`` have been marked as long-path aware, which means that the 260 character path limit may no longer apply. See :ref:`removing the MAX_PATH limitation <max-path>` for details.
sv: ``python.exe`` och ``pythonw.exe`` har markerats som medvetna om långa sökvägar, vilket innebär att sökvägsgränsen på 260 tecken kanske inte längre gäller. Se :ref:`borttagande av MAX_PATH-begränsningen <max-path>` för mer information.

source: A ``._pth`` file can be added to force isolated mode and fully specify all search paths to avoid registry and environment lookup. See :ref:`the documentation <windows_finding_modules>` for more information.
sv: En fil med namnet ``._pth`` kan läggas till för att tvinga fram isolerat läge och fullständigt ange alla sökvägar för att undvika register- och miljöuppslagning. Se :ref:``dokumentationen <windows_finding_modules>` för mer information.

source: A ``python36.zip`` file now works as a landmark to infer :envvar:`PYTHONHOME`. See :ref:`the documentation <windows_finding_modules>` for more information.
sv: En ``python36.zip``-fil fungerar nu som ett landmärke för att härleda :envvar:`PYTHONHOME`. Se :ref:``dokumentationen <windows_finding_modules>` för mer information.

source: New Features
sv: Nya funktioner

source: PEP 498: Formatted string literals
sv: PEP 498: Formaterade stränglitteraler

source: :pep:`498` introduces a new kind of string literals: *f-strings*, or :ref:`formatted string literals <f-strings>`.
sv: :pep:`498` introducerar en ny typ av stränglitteraler: *f-strings*, eller :ref:``formaterade stränglitteraler <f-strings>`.

source: Formatted string literals are prefixed with ``'f'`` and are similar to the format strings accepted by :meth:`str.format`. They contain replacement fields surrounded by curly braces. The replacement fields are expressions, which are evaluated at run time, and then formatted using the :func:`format` protocol::
sv: Formaterade stränglitteraler har prefixet ``'f'`` och liknar de formatsträngar som accepteras av :meth:`str.format`. De innehåller ersättningsfält omgivna av hakparenteser. Ersättningsfälten är uttryck som utvärderas vid körning och sedan formateras med hjälp av :func:`format`-protokollet::

source: >>> name = "Fred" >>> f"He said his name is {name}." 'He said his name is Fred.' >>> width = 10 >>> precision = 4 >>> value = decimal.Decimal("12.34567") >>> f"result: {value:{width}.{precision}}" # nested fields 'result: 12.35'
sv: >>> namn = "Fred" >>> f"Han sa att hans namn är {name}." "Han sa att hans namn är Fred >>> bredd = 10 >>> precision = 4 >>> värde = decimal.decimal("12.34567") >>> f"resultat: {värde:{width}.{precision}}" # nästlade fält "resultat: 12,35

source: :pep:`498` -- Literal String Interpolation.
sv: :pep:`498` -- Interpolation av bokstavliga strängar.

source: PEP written and implemented by Eric V. Smith.
sv: PEP skrivet och genomfört av Eric V. Smith.

source: :ref:`Feature documentation <f-strings>`.
sv: :ref:`Funktionell dokumentation <f-strings>`.

source: PEP 526: Syntax for variable annotations
sv: PEP 526: Syntax för variabelannoteringar

source: :pep:`484` introduced the standard for type annotations of function parameters, a.k.a. type hints. This PEP adds syntax to Python for annotating the types of variables including class variables and instance variables::
sv: :pep:`484` introducerade standarden för typannoteringar av funktionsparametrar, även kallat typtips. Denna PEP lägger till syntax till Python för att annotera typerna av variabler inklusive klassvariabler och instansvariabler::

source: primes: List[int] = [] captain: str # Note: no initial value! class Starship: stats: Dict[str, int] = {}
sv: primtal: Lista[int] = [] captain: str # Obs: inget initialt värde! klass Stjärnskepp: statistik: Dict[str, int] = {}

source: Just as for function annotations, the Python interpreter does not attach any particular meaning to variable annotations and only stores them in the ``__annotations__`` attribute of a class or module.
sv: Precis som för funktionsannoteringar lägger Python-tolken inte någon särskild betydelse i variabelannoteringar och lagrar dem endast i attributet ``__annoteringar__`` för en klass eller modul.

source: In contrast to variable declarations in statically typed languages, the goal of annotation syntax is to provide an easy way to specify structured type metadata for third party tools and libraries via the abstract syntax tree and the ``__annotations__`` attribute.
sv: I motsats till variabeldeklarationer i statiskt typade språk är målet med annotationssyntaxen att tillhandahålla ett enkelt sätt att ange strukturerade typmetadata för verktyg och bibliotek från tredje part via det abstrakta syntaxträdet och attributet ``__annotations__``.

source: :pep:`526` -- Syntax for variable annotations.
sv: :pep:`526` -- Syntax för variabelannoteringar.

source: PEP written by Ryan Gonzalez, Philip House, Ivan Levkivskyi, Lisa Roach, and Guido van Rossum. Implemented by Ivan Levkivskyi.
sv: PEP skriven av Ryan Gonzalez, Philip House, Ivan Levkivskyi, Lisa Roach och Guido van Rossum. Implementerad av Ivan Levkivskyi.

source: Tools that use or will use the new syntax: `mypy <https://www.mypy-lang.org/>`_, `pytype <https://github.com/google/pytype>`_, PyCharm, etc.
sv: Verktyg som använder eller kommer att använda den nya syntaxen: `mypy <https://www.mypy-lang.org/>`_, `pytype <https://github.com/google/pytype>`_, PyCharm, etc.

source: PEP 515: Underscores in Numeric Literals
sv: PEP 515: Underscorer i numeriska bokstäver

source: :pep:`515` adds the ability to use underscores in numeric literals for improved readability. For example::
sv: :pep:`515` lägger till möjligheten att använda understrykningstecken i numeriska literaler för ökad läsbarhet. Till exempel::

source: Single underscores are allowed between digits and after any base specifier. Leading, trailing, or multiple underscores in a row are not allowed.
sv: Enstaka understrykningstecken tillåts mellan siffror och efter varje basspecifikator. Ledande, efterföljande eller flera understreck i rad är inte tillåtna.

source: The :ref:`string formatting <formatspec>` language also now has support for the ``'_'`` option to signal the use of an underscore for a thousands separator for floating-point presentation types and for integer presentation type ``'d'``. For integer presentation types ``'b'``, ``'o'``, ``'x'``, and ``'X'``, underscores will be inserted every 4 digits::
sv: Språket :ref:`strängformatering <formatspec>` har nu också stöd för alternativet ``'_'`` för att signalera att ett understreck används som tusentalsavgränsare för presentationstyper med flyttal och för presentationstypen för heltal ``'d'``. För heltalspresentationstyperna ``'b'``, ``'o'``, ``'x'`` och ``'X'`` kommer understreck att infogas var 4:e siffra::

source: >>> '{:_}'.format(1000000) '1_000_000' >>> '{:_x}'.format(0xFFFFFFFF) 'ffff_ffff'
sv: >>> '{:_}'.format(1000000) '1_000_000' >>> '{:_x}'.format(0xFFFFFFFF) 'ffff_ffffff'

source: :pep:`515` -- Underscores in Numeric Literals
sv: :pep:`515` -- Understreck i numeriska bokstäver

source: PEP written by Georg Brandl and Serhiy Storchaka.
sv: PEP skriven av Georg Brandl och Serhiy Storchaka.

source: PEP 525: Asynchronous Generators
sv: PEP 525: Asynkrona generatorer

source: :pep:`492` introduced support for native coroutines and ``async`` / ``await`` syntax to Python 3.5. A notable limitation of the Python 3.5 implementation is that it was not possible to use ``await`` and ``yield`` in the same function body. In Python 3.6 this restriction has been lifted, making it possible to define *asynchronous generators*::
sv: :pep:`492` introducerade stöd för inbyggda coroutines och ``async`` / ``await`` syntax till Python 3.5. En anmärkningsvärd begränsning i Python 3.5-implementeringen är att det inte var möjligt att använda ``await`` och ``yield`` i samma funktionskropp. I Python 3.6 har denna begränsning tagits bort, vilket gör det möjligt att definiera *asynkrona generatorer*::

source: async def ticker(delay, to): """Yield numbers from 0 to *to* every *delay* seconds.""" for i in range(to): yield i await asyncio.sleep(delay)
sv: async def ticker(fördröjning, till): """Avkastar siffror från 0 till *till* varje *fördröjning* sekund.""" för i i intervall(till): avkastning i await asyncio.sleep(fördröjning)

source: The new syntax allows for faster and more concise code.
sv: Den nya syntaxen ger snabbare och mer kortfattad kod.

source: :pep:`525` -- Asynchronous Generators
sv: :pep:`525` -- Asynkrona generatorer

source: PEP written and implemented by Yury Selivanov.
sv: PEP skrivet och implementerat av Yury Selivanov.

source: PEP 530: Asynchronous Comprehensions
sv: PEP 530: Asynkrona förståelser

source: :pep:`530` adds support for using ``async for`` in list, set, dict comprehensions and generator expressions::
sv: :pep:`530` lägger till stöd för att använda ``async for`` i list-, set-, dict-förståelser och generatoruttryck::

source: result = [i async for i in aiter() if i % 2]
sv: resultat = [i async för i i aiter() if i % 2]

source: Additionally, ``await`` expressions are supported in all kinds of comprehensions::
sv: Dessutom stöds ``await``-uttryck i alla typer av förståelser::

source: result = [await fun() for fun in funcs if await condition()]
sv: resultat = [await fun() for fun in funcs if await condition()]

source: :pep:`530` -- Asynchronous Comprehensions
sv: :pep:`530` -- Asynkrona förståelser

source: PEP 487: Simpler customization of class creation
sv: PEP 487: Enklare anpassning av klassskapande

source: It is now possible to customize subclass creation without using a metaclass. The new ``__init_subclass__`` classmethod will be called on the base class whenever a new subclass is created::
sv: Det är nu möjligt att anpassa skapandet av underklasser utan att använda en metaklass. Den nya klassmetoden ``__init_subclass__`` kommer att anropas på basklassen när en ny underklass skapas::

source: class PluginBase: subclasses = [] def __init_subclass__(cls, **kwargs): super().__init_subclass__(**kwargs) cls.subclasses.append(cls) class Plugin1(PluginBase): pass class Plugin2(PluginBase): pass
sv: klass PluginBase: underklasser = [] def __init_subclass__(cls, **kwargs): super().__init_subclass__(**kwargs) cls.subclasses.append(cls) klass Plugin1(PluginBase): pass klass Plugin2(PluginBase): pass

source: In order to allow zero-argument :func:`super` calls to work correctly from :meth:`~object.__init_subclass__` implementations, custom metaclasses must ensure that the new ``__classcell__`` namespace entry is propagated to ``type.__new__`` (as described in :ref:`class-object-creation`).
sv: För att tillåta nollargument :func:`super`-anrop att fungera korrekt från :meth:`~object.__init_subclass__`-implementationer, måste anpassade metaklasser säkerställa att den nya ``__classcell__``-namnrymdsposten sprids till ``type.__new__`` (som beskrivs i :ref:`class-object-creation`).

source: :pep:`487` -- Simpler customization of class creation
sv: :pep:`487` -- Enklare anpassning av klassskapande

source: PEP written and implemented by Martin Teichmann.
sv: PEP skrivet och genomfört av Martin Teichmann.

source: :ref:`Feature documentation <class-customization>`
sv: :ref:`Funktionell dokumentation <class-customization>`

source: PEP 487: Descriptor Protocol Enhancements
sv: PEP 487: Förbättringar av deskriptorprotokollet

source: :pep:`487` extends the descriptor protocol to include the new optional :meth:`~object.__set_name__` method. Whenever a new class is defined, the new method will be called on all descriptors included in the definition, providing them with a reference to the class being defined and the name given to the descriptor within the class namespace. In other words, instances of descriptors can now know the attribute name of the descriptor in the owner class::
sv: :pep:`487` utökar descriptorprotokollet till att omfatta den nya valfria metoden :meth:`~object.__set_name__`. När en ny klass definieras kommer den nya metoden att anropas på alla deskriptorer som ingår i definitionen och förse dem med en referens till den klass som definieras och det namn som deskriptorn har fått i klassens namnrymd. Med andra ord kan instanser av deskriptorer nu veta attributnamnet på deskriptorn i ägarklassen::

source: class IntField: def __get__(self, instance, owner): return instance.__dict__[self.name] def __set__(self, instance, value): if not isinstance(value, int): raise ValueError(f'expecting integer in {self.name}') instance.__dict__[self.name] = value # this is the new initializer: def __set_name__(self, owner, name): self.name = name class Model: int_field = IntField()
sv: klass IntField: def __get__(self, instance, owner): return instans.__dict__[self.name] def __set__(self, instance, value): if not isinstance(värde, int): raise ValueError(f'förväntar sig heltal i {self.name}') instance.__dict__[self.name] = värde # detta är den nya initialiseraren: def __set_name__(self, owner, name): self.name = namn klass Modell: int_field = IntField()

source: :ref:`Feature documentation <descriptors>`
sv: :ref:`Funktionell dokumentation <descriptors>`

source: PEP 519: Adding a file system path protocol
sv: PEP 519: Lägga till ett sökvägsprotokoll för filsystem

source: File system paths have historically been represented as :class:`str` or :class:`bytes` objects. This has led to people who write code which operate on file system paths to assume that such objects are only one of those two types (an :class:`int` representing a file descriptor does not count as that is not a file path). Unfortunately that assumption prevents alternative object representations of file system paths like :mod:`pathlib` from working with pre-existing code, including Python's standard library.
sv: Filsystemsökvägar har historiskt representerats som :class:`str` eller :class:`bytes` objekt. Detta har lett till att personer som skriver kod som använder filsystemsökvägar antar att sådana objekt endast är en av dessa två typer (en :class:`int` som representerar en filbeskrivning räknas inte eftersom det inte är en filsökväg). Tyvärr förhindrar detta antagande alternativa objektrepresentationer av filsystemsökvägar som :mod:`pathlib` från att fungera med redan existerande kod, inklusive Pythons standardbibliotek.
