Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: ``traceback.Ignore`` class and ``traceback.usage``, ``traceback.modname``, ``traceback.fullmodname``, ``traceback.find_lines_from_code``, ``traceback.find_lines``, ``traceback.find_strings``, ``traceback.find_executable_lines`` methods were removed from the :mod:`traceback` module. They were undocumented methods deprecated since Python 3.2 and equivalent functionality is available from private methods.
sv: klassen ``traceback.Ignore`` och metoderna ``traceback.usage``, ``traceback.modname``, ``traceback.fullmodname``, ``traceback.find_lines_from_code``, ``traceback.find_lines``, ``traceback.find_strings``, ``traceback.find_executable_lines`` togs bort från modulen :mod:`traceback`. De var odokumenterade metoder som utgått sedan Python 3.2 och motsvarande funktionalitet är tillgänglig från privata metoder.

source: The ``tk_menuBar()`` and ``tk_bindForTraversal()`` dummy methods in :mod:`tkinter` widget classes were removed (corresponding Tk commands were obsolete since Tk 4.0).
sv: Dummy-metoderna ``tk_menuBar()`` och ``tk_bindForTraversal()`` i widgetklasserna :mod:`tkinter` togs bort (motsvarande Tk-kommandon var föråldrade sedan Tk 4.0).

source: The :meth:`~zipfile.ZipFile.open` method of the :class:`zipfile.ZipFile` class no longer supports the ``'U'`` mode (was deprecated since Python 3.4). Use :class:`io.TextIOWrapper` for reading compressed text files in :term:`universal newlines` mode.
sv: Metoden :meth:`~zipfile.ZipFile.open` i klassen :class:`zipfile.ZipFile` stöder inte längre läget ``'U'`` (har inte använts sedan Python 3.4). Använd :class:`io.TextIOWrapper` för att läsa komprimerade textfiler i :term:`universal newlines`-läge.

source: The undocumented ``IN``, ``CDROM``, ``DLFCN``, ``TYPES``, ``CDIO``, and ``STROPTS`` modules have been removed. They had been available in the platform specific ``Lib/plat-*/`` directories, but were chronically out of date, inconsistently available across platforms, and unmaintained. The script that created these modules is still available in the source distribution at `Tools/scripts/h2py.py <https://github.com/python/cpython/blob/v3.6.15/Tools/scripts/h2py.py>`_.
sv: De odokumenterade modulerna ``IN``, ``CDROM``, ``DLFCN``, ``TYPES``, ``CDIO`` och ``STROPTS`` har tagits bort. De har funnits tillgängliga i de plattformsspecifika katalogerna ``Lib/plat-*/``, men var kroniskt föråldrade, inkonsekvent tillgängliga på olika plattformar och ounderhållna. Skriptet som skapade dessa moduler finns fortfarande tillgängligt i källdistributionen på `Tools/scripts/h2py.py <https://github.com/python/cpython/blob/v3.6.15/Tools/scripts/h2py.py>`_.

source: The deprecated ``asynchat.fifo`` class has been removed.
sv: Den föråldrade klassen ``asynchat.fifo`` har tagits bort.

source: Porting to Python 3.6
sv: Portning till Python 3.6

source: This section lists previously described changes and other bugfixes that may require changes to your code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Changes in 'python' Command Behavior
sv: Ändringar i beteendet för kommandot "python

source: The output of a special Python build with defined ``COUNT_ALLOCS``, ``SHOW_ALLOC_COUNT`` or ``SHOW_TRACK_COUNT`` macros is now off by default. It can be re-enabled using the ``-X showalloccount`` option. It now outputs to ``stderr`` instead of ``stdout``. (Contributed by Serhiy Storchaka in :issue:`23034`.)
sv: Utdata från en speciell Python-byggnad med definierade makron ``COUNT_ALLOCS``, ``SHOW_ALLOC_COUNT`` eller ``SHOW_TRACK_COUNT`` är nu avstängd som standard. Det kan återaktiveras med alternativet ``-X showalloccount``. Det matas nu ut till ``stderr`` istället för ``stdout``. (Bidrag från Serhiy Storchaka i :issue:`23034`.)

source: Changes in the Python API
sv: Ändringar i Python API

source: :func:`open() <open>` will no longer allow combining the ``'U'`` mode flag with ``'+'``. (Contributed by Jeff Balogh and John O'Connor in :issue:`2091`.)
sv: :func:`open() <open>` tillåter inte längre att kombinera lägesflaggan ``'U'`` med ``'+'``. (Bidrag från Jeff Balogh och John O'Connor i :issue:`2091`.)

source: :mod:`sqlite3` no longer implicitly commits an open transaction before DDL statements.
sv: :mod:`sqlite3` genomför inte längre implicit en öppen transaktion före DDL-satser.

source: On Linux, :func:`os.urandom` now blocks until the system urandom entropy pool is initialized to increase the security.
sv: På Linux blockerar :func:`os.urandom` nu tills systemets urandom-entropipool har initialiserats för att öka säkerheten.

source: When :meth:`importlib.abc.Loader.exec_module` is defined, :meth:`importlib.abc.Loader.create_module` must also be defined.
sv: När :meth:`importlib.abc.Loader.exec_module` definieras måste även :meth:`importlib.abc.Loader.create_module` definieras.

source: :c:func:`PyErr_SetImportError` now sets :exc:`TypeError` when its **msg** argument is not set. Previously only ``NULL`` was returned.
sv: :c:func:`PyErr_SetImportError` sätter nu :exc:`TypeError` när dess **msg**-argument inte är satt. Tidigare returnerades endast ``NULL``.

source: The format of the :attr:`~codeobject.co_lnotab` attribute of code objects changed to support a negative line number delta. By default, Python does not emit bytecode with a negative line number delta. Functions using :attr:`frame.f_lineno`, ``PyFrame_GetLineNumber()`` or ``PyCode_Addr2Line()`` are not affected. Functions directly decoding :attr:`!co_lnotab` should be updated to use a signed 8-bit integer type for the line number delta, but this is only required to support applications using a negative line number delta. See ``Objects/lnotab_notes.txt`` for the :attr:`!co_lnotab` format and how to decode it, and see the :pep:`511` for the rationale.
sv: Formatet för attributet :attr:`~codeobject.co_lnotab` för kodobjekt ändrades för att stödja ett negativt radnummerdelta. Som standard emitterar Python inte bytekod med ett negativt radnummerdelta. Funktioner som använder :attr:`frame.f_lineno`, ``PyFrame_GetLineNumber()`` eller ``PyCode_Addr2Line()`` påverkas inte. Funktioner som direkt avkodar :attr:`!co_lnotab` bör uppdateras för att använda en signerad 8-bitars heltalstyp för radnummerdeltaet, men detta krävs endast för att stödja applikationer som använder ett negativt radnummerdelta. Se ``Objects/lnotab_notes.txt`` för :attr:`!co_lnotab`-formatet och hur man avkodar det, och se :pep:`511` för motiveringen.

source: The functions in the :mod:`compileall` module now return booleans instead of ``1`` or ``0`` to represent success or failure, respectively. Thanks to booleans being a subclass of integers, this should only be an issue if you were doing identity checks for ``1`` or ``0``. See :issue:`25768`.
sv: Funktionerna i modulen :mod:`compileall` returnerar nu booleaner istället för ``1`` eller ``0`` för att representera framgång respektive misslyckande. Tack vare att booleans är en underklass till heltal, bör detta endast vara ett problem om du gör identitetskontroller för ``1`` eller ``0``. Se :issue:`25768`.

source: Reading the :attr:`~urllib.parse.SplitResult.port` attribute of :func:`urllib.parse.urlsplit` and :func:`~urllib.parse.urlparse` results now raises :exc:`ValueError` for out-of-range values, rather than returning :const:`None`. See :issue:`20059`.
sv: Att läsa attributet :attr:`~urllib.parse.SplitResult.port` av resultaten :func:`urllib.parse.urlsplit` och :func:`~urllib.parse.urlparse` ger nu upphov till :exc:`ValueError` för värden utanför intervallet, istället för att returnera :const:`None`. Se :issue:`20059`.

source: The :mod:`!imp` module now raises a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`.
sv: Modulen :mod:`!imp` ger nu upphov till en :exc:`DeprecationWarning` istället för :exc:`PendingDeprecationWarning`.

source: The following modules have had missing APIs added to their :attr:`__all__` attributes to match the documented APIs: :mod:`calendar`, :mod:`!cgi`, :mod:`csv`, :mod:`~xml.etree.ElementTree`, :mod:`enum`, :mod:`fileinput`, :mod:`ftplib`, :mod:`logging`, :mod:`mailbox`, :mod:`mimetypes`, :mod:`optparse`, :mod:`plistlib`, :mod:`!smtpd`, :mod:`subprocess`, :mod:`tarfile`, :mod:`threading` and :mod:`wave`. This means they will export new symbols when ``import *`` is used. (Contributed by Joel Taddei and Jacek Kołodziej in :issue:`23883`.)
sv: Följande moduler har fått saknade API:er tillagda i sina :attr:`__all__`-attribut för att matcha de dokumenterade API:erna: :mod:`calendar`, :mod:`!cgi`, :mod:`csv`, :mod:`~xml.etree.ElementTree`, :mod:`enum`, :mod:`fileinput`, :mod:`ftplib`, :mod:`logging`, :mod:`mailbox`, :mod:`mimetypes`, :mod:`optparse`, :mod:`plistlib`, :mod:`!smtpd`, :mod:`subprocess`, :mod:`tarfile`, :mod:`threading` och :mod:`wave`. Detta innebär att de kommer att exportera nya symboler när ``import *`` används. (Bidrag från Joel Taddei och Jacek Kołodziej i :issue:`23883`.)

source: When performing a relative import, if ``__package__`` does not compare equal to ``__spec__.parent`` then :exc:`ImportWarning` is raised. (Contributed by Brett Cannon in :issue:`25791`.)
sv: Vid relativ import, om ``__package__`` inte jämför lika med ``__spec__.parent`` så kommer :exc:`ImportWarning` att visas. (Bidrag från Brett Cannon i :issue:`25791`.)

source: When a relative import is performed and no parent package is known, then :exc:`ImportError` will be raised. Previously, :exc:`SystemError` could be raised. (Contributed by Brett Cannon in :issue:`18018`.)
sv: När en relativ import utförs och inget överordnat paket är känt, kommer :exc:`ImportError` att visas. Tidigare kunde :exc:`SystemError` visas. (Bidrag från Brett Cannon i :issue:`18018`.)

source: Servers based on the :mod:`socketserver` module, including those defined in :mod:`http.server`, :mod:`xmlrpc.server` and :mod:`wsgiref.simple_server`, now only catch exceptions derived from :exc:`Exception`. Therefore if a request handler raises an exception like :exc:`SystemExit` or :exc:`KeyboardInterrupt`, :meth:`~socketserver.BaseServer.handle_error` is no longer called, and the exception will stop a single-threaded server. (Contributed by Martin Panter in :issue:`23430`.)
sv: Servrar som baseras på modulen :mod:`socketserver`, inklusive de som definieras i :mod:`http.server`, :mod:`xmlrpc.server` och :mod:`wsgiref.simple_server`, fångar nu bara upp undantag som härrör från :exc:`Exception`. Därför, om en request hanterare ger upphov till ett undantag som :exc:`SystemExit` eller :exc:`KeyboardInterrupt`, anropas inte längre :meth:`~socketserver.BaseServer.handle_error`, och undantaget kommer att stoppa en enkeltrådad server. (Bidrag från Martin Panter i :issue:`23430`.)

source: :func:`!spwd.getspnam` now raises a :exc:`PermissionError` instead of :exc:`KeyError` if the user doesn't have privileges.
sv: :func:`!spwd.getspnam` ger nu upphov till :exc:`PermissionError` istället för :exc:`KeyError` om användaren inte har behörighet.

source: The :meth:`socket.socket.close` method now raises an exception if an error (e.g. ``EBADF``) was reported by the underlying system call. (Contributed by Martin Panter in :issue:`26685`.)
sv: Metoden :meth:`socket.socket.close` ger nu upphov till ett undantag om ett fel (t.ex. ``EBADF``) rapporterades av det underliggande systemanropet. (Bidrag från Martin Panter i :issue:`26685`.)

source: The *decode_data* argument for the :class:`!smtpd.SMTPChannel` and :class:`!smtpd.SMTPServer` constructors is now ``False`` by default. This means that the argument passed to :meth:`!process_message` is now a bytes object by default, and :meth:`!process_message` will be passed keyword arguments. Code that has already been updated in accordance with the deprecation warning generated by 3.5 will not be affected.
sv: Argumentet *decode_data* för konstruktörerna :class:`!smtpd.SMTPChannel` och :class:`!smtpd.SMTPServer` är nu ``False`` som standard. Detta innebär att argumentet som skickas till :meth:`!process_message` nu är ett bytes-objekt som standard, och :meth:`!process_message` kommer att skickas nyckelordsargument. Kod som redan har uppdaterats i enlighet med deprecation-varningen som genererades av 3.5 kommer inte att påverkas.

source: All optional arguments of the :func:`~json.dump`, :func:`~json.dumps`, :func:`~json.load` and :func:`~json.loads` functions and :class:`~json.JSONEncoder` and :class:`~json.JSONDecoder` class constructors in the :mod:`json` module are now :ref:`keyword-only <keyword-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`18726`.)
sv: Alla valfria argument i funktionerna :func:`~json.dump`, :func:`~json.dumps`, :func:`~json.load` och :func:`~json.loads` och klasskonstruktörerna :class:`~json.JSONEncoder` och :class:`~json.JSONDecoder` i modulen :mod:`json` är nu :ref:`keyword-only <keyword-only_parameter>`. (Bidrag från Serhiy Storchaka i :issue:`18726`.)

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
sv: Underklasser till :class:`type` som inte åsidosätter ``type.__new__`` får inte längre använda formuläret med ett argument för att få fram typen av ett objekt.

source: As part of :pep:`487`, the handling of keyword arguments passed to :class:`type` (other than the metaclass hint, ``metaclass``) is now consistently delegated to :meth:`object.__init_subclass__`. This means that :meth:`type.__new__` and :meth:`type.__init__` both now accept arbitrary keyword arguments, but :meth:`object.__init_subclass__` (which is called from :meth:`type.__new__`) will reject them by default. Custom metaclasses accepting additional keyword arguments will need to adjust their calls to :meth:`type.__new__` (whether direct or via :class:`super`) accordingly.
sv: Som en del av :pep:`487`, är hanteringen av nyckelordsargument som skickas till :class:`type` (andra än metaklasstipset, ``metaclass``) nu konsekvent delegerad till :meth:`object.__init_subclass__`. Detta innebär att :meth:`type.__new__` och :meth:`type.__init__` båda nu accepterar godtyckliga nyckelordsargument, men :meth:`object.__init_subclass__` (som anropas från :meth:`type.__new__`) kommer att avvisa dem som standard. Anpassade metaklasser som accepterar ytterligare nyckelordsargument kommer att behöva justera sina anrop till :meth:`type.__new__` (antingen direkt eller via :class:`super`) i enlighet med detta.

source: In ``distutils.command.sdist.sdist``, the ``default_format`` attribute has been removed and is no longer honored. Instead, the gzipped tarfile format is the default on all platforms and no platform-specific selection is made. In environments where distributions are built on Windows and zip distributions are required, configure the project with a ``setup.cfg`` file containing the following:
sv: I ``distutils.command.sdist.sdist`` har attributet ``default_format`` tagits bort och används inte längre. Istället är det gzippade tarfilformatet standard på alla plattformar och inget plattformsspecifikt val görs. I miljöer där distributioner byggs på Windows och zip-distributioner krävs, konfigurerar du projektet med en ``setup.cfg``-fil som innehåller följande:

source: [sdist] formats=zip
sv: [sdist] format=zip

source: This behavior has also been backported to earlier Python versions by Setuptools 26.0.0.
sv: Detta beteende har också backporterats till tidigare Python-versioner av Setuptools 26.0.0.

source: In the :mod:`urllib.request` module and the :meth:`http.client.HTTPConnection.request` method, if no Content-Length header field has been specified and the request body is a file object, it is now sent with HTTP 1.1 chunked encoding. If a file object has to be sent to a HTTP 1.0 server, the Content-Length value now has to be specified by the caller. (Contributed by Demian Brecht and Rolf Krahl with tweaks from Martin Panter in :issue:`12319`.)
sv: I :mod:`urllib.request`-modulen och :meth:`http.client.HTTPConnection.request`-metoden, om inget Content-Length-huvudfält har angetts och begäran är ett filobjekt, skickas det nu med HTTP 1.1 chunked-kodning. Om ett filobjekt måste skickas till en HTTP 1.0-server måste nu Content-Length-värdet anges av den som anropar. (Bidrag från Demian Brecht och Rolf Krahl med tweaks från Martin Panter i :issue:`12319`.)

source: The :class:`~csv.DictReader` now returns rows of type :class:`~collections.OrderedDict`. (Contributed by Steve Holden in :issue:`27842`.)
sv: :class:`~csv.DictReader` returnerar nu rader av typen :class:`~collections.OrderedDict`. (Bidrag från Steve Holden i :issue:`27842`.)

source: The :const:`!crypt.METHOD_CRYPT` will no longer be added to ``crypt.methods`` if unsupported by the platform. (Contributed by Victor Stinner in :issue:`25287`.)
sv: :const:`!crypt.METHOD_CRYPT` kommer inte längre att läggas till i ``crypt.methods`` om den inte stöds av plattformen. (Bidrag från Victor Stinner i :issue:`25287`.)

source: On Linux, :func:`ctypes.util.find_library` now looks in ``LD_LIBRARY_PATH`` for shared libraries. (Contributed by Vinay Sajip in :issue:`9998`.)
sv: På Linux letar :func:`ctypes.util.find_library` nu i ``LD_LIBRARY_PATH`` efter delade bibliotek. (Bidrag från Vinay Sajip i :issue:`9998`.)

source: The :class:`imaplib.IMAP4` class now handles flags containing the ``']'`` character in messages sent from the server to improve real-world compatibility. (Contributed by Lita Cho in :issue:`21815`.)
sv: Klassen :class:`imaplib.IMAP4` hanterar nu flaggor som innehåller tecknet ``']'`` i meddelanden som skickas från servern för att förbättra kompatibiliteten i verkligheten. (Bidrag från Lita Cho i :issue:`21815`.)

source: The :func:`mmap.write() <mmap.write>` function now returns the number of bytes written like other write methods. (Contributed by Jakub Stasiak in :issue:`26335`.)
sv: Funktionen :func:`mmap.write() <mmap.write>` returnerar nu antalet byte som skrivits, precis som andra skrivmetoder. (Bidrag från Jakub Stasiak i :issue:`26335`.)

source: The :func:`pkgutil.iter_modules` and :func:`pkgutil.walk_packages` functions now return :class:`~pkgutil.ModuleInfo` named tuples. (Contributed by Ramchandra Apte in :issue:`17211`.)
sv: Funktionerna :func:`pkgutil.iter_modules` och :func:`pkgutil.walk_packages` returnerar nu :class:`~pkgutil.ModuleInfo` namngivna tuples. (Bidrag från Ramchandra Apte i :issue:`17211`.)

source: :func:`re.sub` now raises an error for invalid numerical group references in replacement templates even if the pattern is not found in the string. The error message for invalid group references now includes the group index and the position of the reference. (Contributed by SilentGhost, Serhiy Storchaka in :issue:`25953`.)
sv: :func:`re.sub` ger nu upphov till ett felmeddelande för ogiltiga numeriska gruppreferenser i ersättningsmallar även om mönstret inte finns i strängen. Felmeddelandet för ogiltiga gruppreferenser innehåller nu gruppindex och referensens position. (Bidrag från SilentGhost, Serhiy Storchaka i :issue:`25953`.)

source: :class:`zipfile.ZipFile` will now raise :exc:`NotImplementedError` for unrecognized compression values. Previously a plain :exc:`RuntimeError` was raised. Additionally, calling :class:`~zipfile.ZipFile` methods on a closed ZipFile or calling the :meth:`~zipfile.ZipFile.write` method on a ZipFile created with mode ``'r'`` will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised in those scenarios.
sv: :class:`zipfile.ZipFile` kommer nu att ge upphov till :exc:`NotImplementedError` för okända komprimeringsvärden. Tidigare gavs ett vanligt :exc:`RuntimeError`. Dessutom kommer anrop av :class:`~zipfile.ZipFile`-metoder på en stängd ZipFile eller anrop av :meth:`~zipfile.ZipFile.write`-metoden på en ZipFile skapad med läge ``'r'`` att ge upphov till ett :exc:`ValueError`. Tidigare gavs ett :exc:`RuntimeError` i dessa scenarier.

source: when custom metaclasses are combined with zero-argument :func:`super` or direct references from methods to the implicit ``__class__`` closure variable, the implicit ``__classcell__`` namespace entry must now be passed up to ``type.__new__`` for initialisation. Failing to do so will result in a :exc:`DeprecationWarning` in Python 3.6 and a :exc:`RuntimeError` in Python 3.8.
sv: när anpassade metaklasser kombineras med nollargument :func:`super` eller direkta referenser från metoder till den implicita ``__class__`` stängningsvariabeln, måste den implicita ``__classcell__`` namnrymdsposten nu skickas upp till ``type.__new__`` för initialisering. Om detta inte görs kommer det att resultera i en :exc:`DeprecationWarning` i Python 3.6 och en :exc:`RuntimeError` i Python 3.8.

source: With the introduction of :exc:`ModuleNotFoundError`, import system consumers may start expecting import system replacements to raise that more specific exception when appropriate, rather than the less-specific :exc:`ImportError`. To provide future compatibility with such consumers, implementers of alternative import systems that completely replace :func:`__import__` will need to update their implementations to raise the new subclass when a module can't be found at all. Implementers of compliant plugins to the default import system shouldn't need to make any changes, as the default import system will raise the new subclass when appropriate.
sv: Med introduktionen av :exc:`ModuleNotFoundError`, kan importsystemkonsumenter börja förvänta sig att importsystemersättare ska lyfta det mer specifika undantaget när det är lämpligt, snarare än det mindre specifika :exc:`ImportError`. För att ge framtida kompatibilitet med sådana konsumenter måste implementatörer av alternativa importsystem som helt ersätter :func:`__import__` uppdatera sina implementationer så att de ger upphov till den nya underklassen när en modul inte kan hittas alls. Implementatörer av kompatibla tillägg till standardimportsystemet bör inte behöva göra några ändringar, eftersom standardimportsystemet kommer att visa den nya underklassen när så är lämpligt.

source: Changes in the C API
sv: Förändringar i C API

source: The :c:func:`PyMem_Malloc` allocator family now uses the :ref:`pymalloc allocator <pymalloc>` rather than the system :c:func:`malloc`. Applications calling :c:func:`PyMem_Malloc` without holding the GIL can now crash. Set the :envvar:`PYTHONMALLOC` environment variable to ``debug`` to validate the usage of memory allocators in your application. See :issue:`26249`.
sv: Allokeringsfamiljen :c:func:`PyMem_Malloc` använder nu :ref:`pymalloc allocator <pymalloc>` istället för systemets :c:func:`malloc`. Program som anropar :c:func:`PyMem_Malloc` utan att ha GIL:en kan nu krascha. Sätt miljövariabeln :envvar:`PYTHONMALLOC` till ``debug`` för att validera användningen av minnesallokatorer i ditt program. Se :issue:`26249`.

source: :c:func:`Py_Exit` (and the main interpreter) now override the exit status with 120 if flushing buffered data failed. See :issue:`5319`.
sv: :c:func:`Py_Exit` (och huvudtolken) åsidosätter nu utgångsstatusen med 120 om spolningen av buffrade data misslyckades. Se :issue:`5319`.

source: CPython bytecode changes
sv: CPython bytecode-ändringar

source: There have been several major changes to the :term:`bytecode` in Python 3.6.
sv: Det har skett flera stora förändringar av :term:`bytecode` i Python 3.6.

source: The Python interpreter now uses a 16-bit wordcode instead of bytecode. (Contributed by Demur Rumed with input and reviews from Serhiy Storchaka and Victor Stinner in :issue:`26647` and :issue:`28050`.)
sv: Python-tolken använder nu en 16-bitars ordkod istället för bytekod. (Bidrag från Demur Rumed med input och recensioner från Serhiy Storchaka och Victor Stinner i :issue:`26647` och :issue:`28050`.)
