Repository: yeager/python-docs-sv
Catalog: whatsnew/3.6.po
Languages: sv

source: The new :opcode:`!FORMAT_VALUE` and :opcode:`BUILD_STRING` opcodes as part of the :ref:`formatted string literal <whatsnew36-pep498>` implementation. (Contributed by Eric Smith in :issue:`25483` and Serhiy Storchaka in :issue:`27078`.)
sv: De nya opkoderna :opcode:`!FORMAT_VALUE` och :opcode:`BUILD_STRING` som en del av implementationen :ref:`formatted string literal <whatsnew36-pep498>`. (Bidrag från Eric Smith i :issue:`25483` och Serhiy Storchaka i :issue:`27078`.)

source: The new :opcode:`!BUILD_CONST_KEY_MAP` opcode to optimize the creation of dictionaries with constant keys. (Contributed by Serhiy Storchaka in :issue:`27140`.)
sv: Den nya :opcode:`!BUILD_CONST_KEY_MAP` opcode för att optimera skapandet av ordböcker med konstanta nycklar. (Bidrag från Serhiy Storchaka i :issue:`27140`.)

source: The function call opcodes have been heavily reworked for better performance and simpler implementation. The :opcode:`MAKE_FUNCTION`, :opcode:`!CALL_FUNCTION`, :opcode:`!CALL_FUNCTION_KW` and :opcode:`!BUILD_MAP_UNPACK_WITH_CALL` opcodes have been modified, the new :opcode:`CALL_FUNCTION_EX` and :opcode:`!BUILD_TUPLE_UNPACK_WITH_CALL` have been added, and ``CALL_FUNCTION_VAR``, ``CALL_FUNCTION_VAR_KW`` and ``MAKE_CLOSURE`` opcodes have been removed. (Contributed by Demur Rumed in :issue:`27095`, and Serhiy Storchaka in :issue:`27213`, :issue:`28257`.)
sv: Opkoderna för funktionsanrop har omarbetats kraftigt för bättre prestanda och enklare implementering. Opkoderna :opcode:`MAKE_FUNCTION`, :opcode:`!CALL_FUNCTION`, :opcode:`!CALL_FUNCTION_KW` och :opcode:`!BUILD_MAP_UNPACK_WITH_CALL` har modifierats, de nya :opcode:`CALL_FUNCTION_EX` och :opcode:`!BUILD_TUPLE_UNPACK_WITH_CALL` har lagts till, och opkoderna ``CALL_FUNCTION_VAR``, ``CALL_FUNCTION_VAR_KW`` och ``MAKE_CLOSURE`` har tagits bort. (Bidrag från Demur Rumed i :issue:`27095`, och Serhiy Storchaka i :issue:`27213`, :issue:`28257`.)

source: The new :opcode:`SETUP_ANNOTATIONS` and :opcode:`!STORE_ANNOTATION` opcodes have been added to support the new :term:`variable annotation` syntax. (Contributed by Ivan Levkivskyi in :issue:`27985`.)
sv: De nya opkoderna :opcode:`SETUP_ANNOTATIONS` och :opcode:`!STORE_ANNOTATION` har lagts till för att stödja den nya syntaxen :term:`variable annotation`. (Bidrag från Ivan Levkivskyi i :issue:`27985`.)

source: Notable changes in Python 3.6.2
sv: Viktiga ändringar i Python 3.6.2

source: New ``make regen-all`` build target
sv: Nytt byggmål för ``make regen-all``

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
sv: För att förenkla korskompilering och säkerställa att CPython kan kompileras på ett tillförlitligt sätt utan att det krävs att en befintlig version av Python redan finns tillgänglig, försöker det autotools-baserade byggsystemet inte längre att implicit kompilera om genererade filer baserat på filändringstider.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
sv: Istället har ett nytt ``make regen-all``-kommando lagts till för att tvinga fram regenerering av dessa filer när så önskas (t.ex. efter att en första version av Python redan har byggts baserat på de förgenererade versionerna).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
sv: Mer selektiva regenereringsmål definieras också - se :source:`Makefile.pre.in` för detaljer.

source: (Contributed by Victor Stinner in :issue:`23404`.)
sv: (Bidrag från Victor Stinner i :issue:`23404`.)

source: Removal of ``make touch`` build target
sv: Borttagning av byggmålet ``make touch``

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
sv: Byggmålet ``make touch`` som tidigare användes för att begära implicit regenerering av genererade filer genom att uppdatera deras modifieringstider har tagits bort.

source: It has been replaced by the new ``make regen-all`` target.
sv: Det har ersatts av det nya målet ``make regen-all``.

source: Notable changes in Python 3.6.4
sv: Viktiga ändringar i Python 3.6.4

source: The ``PyExc_RecursionErrorInst`` singleton that was part of the public API has been removed as its members being never cleared may cause a segfault during finalization of the interpreter. (Contributed by Xavier de Gaye in :issue:`22898` and :issue:`30697`.)
sv: Singletonen ``PyExc_RecursionErrorInst`` som var en del av det publika API:et har tagits bort eftersom dess medlemmar aldrig rensas och detta kan orsaka ett segfault under slutförandet av tolken. (Bidrag från Xavier de Gaye i :issue:`22898` och :issue:`30697`.)

source: Notable changes in Python 3.6.5
sv: Viktiga ändringar i Python 3.6.5

source: The :func:`locale.localeconv` function now sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases. (Contributed by Victor Stinner in :issue:`31900`.)
sv: Funktionen :func:`locale.localeconv` ställer nu temporärt in ``LC_CTYPE`` locale till ``LC_NUMERIC`` locale i vissa fall. (Bidrag från Victor Stinner i :issue:`31900`.)

source: Notable changes in Python 3.6.7
sv: Viktiga ändringar i Python 3.6.7

source: :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. See also :gh:`61441`.
sv: modulerna :mod:`xml.dom.minidom` och :mod:`xml.sax` bearbetar inte längre externa enheter som standard. Se även :gh:`61441`.

source: In 3.6.7 the :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
sv: I 3.6.7 ger modulen :mod:`tokenize` nu implicit ut en ``NEWLINE``-token när den förses med indata som inte har en efterföljande ny rad. Detta beteende matchar nu vad C-tokenizer gör internt. (Bidrag från Ammar Askar i :issue:`33899`.)

source: Notable changes in Python 3.6.10
sv: Anmärkningsvärda ändringar i Python 3.6.10

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
sv: På grund av betydande säkerhetsproblem stöds inte längre parametern *reuse_address* i :meth:`asyncio.loop.create_datagram_endpoint`. Detta beror på beteendet hos socket-alternativet ``SO_REUSEADDR`` i UDP. För mer information, se dokumentationen för ``loop.create_datagram_endpoint()``. (Bidrag från Kyle Stanley, Antoine Pitrou och Yury Selivanov i :issue:`37228`.)

source: Notable changes in Python 3.6.13
sv: Viktiga ändringar i Python 3.6.13

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
sv: Tidigare Python-versioner tillät användning av både ``;`` och ``&`` som separatorer för frågeparametrar i :func:`urllib.parse.parse_qs` och :func:`urllib.parse.parse_qsl`. På grund av säkerhetsproblem och för att överensstämma med nyare W3C-rekommendationer har detta ändrats så att endast en enda separatornyckel tillåts, med ``&`` som standard. Denna ändring påverkar även :func:`!cgi.parse` och :func:`!cgi.parse_multipart` eftersom de använder de berörda funktionerna internt. För mer information, vänligen se deras respektive dokumentation. (Bidrag från Adam Goldschmidt, Senthil Kumaran och Ken Jin i :issue:`42967`.)

source: Notable changes in Python 3.6.14
sv: Viktiga ändringar i Python 3.6.14

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
sv: En säkerhetsfix ändrar :class:`ftplib.FTP`-beteendet så att det inte litar på den IPv4-adress som skickas från fjärrservern när en passiv datakanal sätts upp. Vi återanvänder istället ftp-serverns IP-adress. För ovanlig kod som kräver det gamla beteendet, ställ in attributet ``trust_server_pasv_ipv4_address`` på din FTP-instans till ``True``. (Se :gh:`87451`)

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates RFC 3986, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser :func:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
sv: Förekomsten av newline- eller tabb-tecken i delar av en URL möjliggör vissa former av attacker. I enlighet med WHATWG-specifikationen som uppdaterar RFC 3986, tas ASCII-tecken för ny rad ``n``, ``r`` och tabb ``t`` bort från URL:en av parsern :func:`urllib.parse` för att förhindra sådana attacker. De borttagna tecknen styrs av en ny variabel på modulnivå, ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Se :gh:`88048`)
