Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :issue:`43882`)
sv: Förekomsten av newline- eller tabb-tecken i delar av en URL möjliggör vissa former av attacker. I enlighet med WHATWG-specifikationen som uppdaterar :rfc:`3986`, tas ASCII newline ``n``, ``\r`` och tabb ``t``-tecken bort från URL:en av parsern i :mod:`urllib.parse` för att förhindra sådana attacker. De borttagna tecknen styrs av en ny variabel på modulnivå, ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Se :issue:`43882`)

source: Notable changes in Python 3.8.12
sv: Viktiga ändringar i Python 3.8.12

source: Starting with Python 3.8.12 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros.
sv: Från och med Python 3.8.12 accepterar modulen :mod:`ipaddress` inte längre några ledande nollor i IPv4-adresssträngar. Ledande nollor är tvetydiga och tolkas som oktal notation av vissa bibliotek. Till exempel behandlar den äldre funktionen :func:`socket.inet_aton` ledande nollor som oktal notation. glibc-implementeringen av den moderna :func:`~socket.inet_pton` accepterar inte några ledande nollor.

source: (Originally contributed by Christian Heimes in :issue:`36384`, and backported to 3.8 by Achraf Merzouki.)
sv: (Ursprungligen bidragit av Christian Heimes i :issue:`36384`, och bakåtporterat till 3.8 av Achraf Merzouki.)

source: Notable security feature in 3.8.14
sv: Anmärkningsvärd säkerhetsfunktion i 3.8.14

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
sv: Konvertering mellan :class:`int` och :class:`str` i andra baser än 2 (binär), 4, 8 (oktal), 16 (hexadecimal) eller 32 såsom bas 10 (decimal) ger nu upphov till ett :exc:`ValueError` om antalet siffror i strängform är över en gräns för att undvika potentiella överbelastningsattacker på grund av den algoritmiska komplexiteten. Detta är en begränsning av :cve:`2020-10735`. Den här gränsen kan konfigureras eller inaktiveras med hjälp av en miljövariabel, kommandoradsflagga eller :mod:`sys` API:er. Se dokumentationen :ref:`Längdsbegränsning för konvertering av heltalssträngar <int_max_str_digits>`. Standardgränsen är 4300 siffror i strängform.

source: Notable changes in 3.8.17
sv: Viktiga ändringar i 3.8.17

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
sv: Extraktionsmetoderna i :mod:`tarfile` och :func:`shutil.unpack_archive` har ett nytt *filter*-argument som gör det möjligt att begränsa tarfunktioner som kan vara överraskande eller farliga, t.ex. att skapa filer utanför destinationskatalogen. Se :ref:`tarfile-extraction-filter` för detaljer. I Python 3.12 kommer användning utan *filter*-argumentet att visa en :exc:`DeprecationWarning`. I Python 3.14 kommer standardinställningen att ändras till ``'data'``. (Bidrag från Petr Viktorin i :pep:`706`.)
