Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: The header files and functions related to pgen have been removed after its replacement by a pure Python implementation. (Contributed by Pablo Galindo in :issue:`36623`.)
sv: Huvudfilerna och funktionerna relaterade till pgen har tagits bort efter att de ersatts av en ren Python-implementation. (Bidrag från Pablo Galindo i :issue:`36623`.)

source: :class:`types.CodeType` has a new parameter in the second position of the constructor (*posonlyargcount*) to support positional-only arguments defined in :pep:`570`. The first argument (*argcount*) now represents the total number of positional arguments (including positional-only arguments). The new ``replace()`` method of :class:`types.CodeType` can be used to make the code future-proof.
sv: :class:`types.CodeType` har en ny parameter i konstruktörens andra position (*posonlyargcount*) för att stödja enbart positionella argument definierade i :pep:`570`. Det första argumentet (*argcount*) representerar nu det totala antalet positionella argument (inklusive enbart positionella argument). Den nya metoden ``replace()`` i :class:`types.CodeType` kan användas för att göra koden framtidssäker.

source: The parameter ``digestmod`` for :func:`hmac.new` no longer uses the MD5 digest by default.
sv: Parametern ``digestmod`` för :func:`hmac.new` använder inte längre MD5-digest som standard.

source: Changes in the C API
sv: Förändringar i C API

source: The :c:struct:`PyCompilerFlags` structure got a new *cf_feature_version* field. It should be initialized to ``PY_MINOR_VERSION``. The field is ignored by default, and is used if and only if ``PyCF_ONLY_AST`` flag is set in *cf_flags*. (Contributed by Guido van Rossum in :issue:`35766`.)
sv: Strukturen :c:struct:`PyCompilerFlags` har fått ett nytt fält *cf_feature_version*. Det bör initialiseras till ``PY_MINOR_VERSION``. Fältet ignoreras som standard och används om och endast om flaggan ``PyCF_ONLY_AST`` är inställd i *cf_flags*. (Bidrag från Guido van Rossum i :issue:`35766`.)

source: The :c:func:`!PyEval_ReInitThreads` function has been removed from the C API. It should not be called explicitly: use :c:func:`PyOS_AfterFork_Child` instead. (Contributed by Victor Stinner in :issue:`36728`.)
sv: Funktionen :c:func:`!PyEval_ReInitThreads` har tagits bort från C API. Den bör inte anropas explicit: använd :c:func:`PyOS_AfterFork_Child` istället. (Bidrag från Victor Stinner i :issue:`36728`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. When Python is embedded, ``libpython`` must not be loaded with ``RTLD_LOCAL``, but ``RTLD_GLOBAL`` instead. Previously, using ``RTLD_LOCAL``, it was already not possible to load C extensions which were not linked to ``libpython``, like C extensions of the standard library built by the ``*shared*`` section of ``Modules/Setup``. (Contributed by Victor Stinner in :issue:`21536`.)
sv: På Unix länkas inte längre C-tillägg till libpython, utom på Android och Cygwin. När Python är inbäddat får inte ``libpython`` laddas med ``RTLD_LOCAL`` utan ``RTLD_GLOBAL`` istället. Tidigare, med ``RTLD_LOCAL``, var det redan inte möjligt att ladda C-tillägg som inte var länkade till ``libpython``, som C-tillägg till standardbiblioteket som byggdes av ``*shared*`` sektionen i ``Modules/Setup``. (Bidrag från Victor Stinner i :issue:`21536`.)

source: Use of ``#`` variants of formats in parsing or building value (e.g. :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, etc.) without ``PY_SSIZE_T_CLEAN`` defined raises ``DeprecationWarning`` now. It will be removed in 3.10 or 4.0. Read :ref:`arg-parsing` for detail. (Contributed by Inada Naoki in :issue:`36381`.)
sv: Användning av ``#`` varianter av format vid parsning eller skapande av värde (t.ex. :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, etc.) utan ``PY_SSIZE_T_CLEAN`` definierad ger upphov till ``DeprecationWarning`` nu. Det kommer att tas bort i 3.10 eller 4.0. Läs :ref:`arg-parsing` för detaljer. (Bidrag från Inada Naoki i :issue:`36381`.)

source: Instances of heap-allocated types (such as those created with :c:func:`PyType_FromSpec`) hold a reference to their type object. Increasing the reference count of these type objects has been moved from :c:func:`PyType_GenericAlloc` to the more low-level functions, :c:func:`PyObject_Init` and :c:func:`PyObject_INIT`. This makes types created through :c:func:`PyType_FromSpec` behave like other classes in managed code.
sv: Instanser av heap-allokerade typer (t.ex. de som skapats med :c:func:`PyType_FromSpec`) har en referens till sitt typobjekt. Ökningen av antalet referenser till dessa typobjekt har flyttats från :c:func:`PyType_GenericAlloc` till lågnivåfunktionerna :c:func:`PyObject_Init` och :c:func:`PyObject_INIT`. Detta gör att typer som skapas genom :c:func:`PyType_FromSpec` beter sig som andra klasser i hanterad kod.

source: :ref:`Statically allocated types <static-types>` are not affected.
sv: :ref:`Statiskt allokerade typer <static-types>` påverkas inte.

source: For the vast majority of cases, there should be no side effect. However, types that manually increase the reference count after allocating an instance (perhaps to work around the bug) may now become immortal. To avoid this, these classes need to call Py_DECREF on the type object during instance deallocation.
sv: För de allra flesta fall bör det inte finnas någon bieffekt. Men typer som manuellt ökar referensantalet efter att ha allokerat en instans (kanske för att kringgå buggen) kan nu bli odödliga. För att undvika detta måste dessa klasser anropa Py_DECREF på typobjektet under avallokering av instansen.

source: To correctly port these types into 3.8, please apply the following changes:
sv: För att korrekt porta dessa typer till 3.8, vänligen gör följande ändringar:

source: Remove :c:macro:`Py_INCREF` on the type object after allocating an instance - if any. This may happen after calling :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar`, or any other custom allocator that uses :c:func:`PyObject_Init` or :c:func:`PyObject_INIT`.
sv: Ta bort :c:macro:`Py_INCREF` på typobjektet efter allokering av en instans - om någon. Detta kan hända efter anrop av :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar`, eller någon annan anpassad allokator som använder :c:func:`PyObject_Init` eller :c:func:`PyObject_INIT`.

source: Example:
sv: Exempel:

source: static foo_struct * foo_new(PyObject *type) { foo_struct *foo = PyObject_GC_New(foo_struct, (PyTypeObject *) type); if (foo == NULL) return NULL; #if PY_VERSION_HEX < 0x03080000 // Workaround for Python issue 35810; no longer necessary in Python 3.8 PY_INCREF(type) #endif return foo; }
sv: statisk foo_struct * foo_new(PyObject *typ) { foo_struct *foo = PyObject_GC_New(foo_struct, (PyTypeObject *) type); if (foo == NULL) returnera NULL; #if PY_VERSION_HEX < 0x03080000 // Lösning för Python-problem 35810; inte längre nödvändigt i Python 3.8 PY_INCREF(typ) #endif returnera foo; }

source: Ensure that all custom ``tp_dealloc`` functions of heap-allocated types decrease the type's reference count.
sv: Säkerställ att alla anpassade ``tp_dealloc``-funktioner för heap-allokerade typer minskar typens referensantal.

source: static void foo_dealloc(foo_struct *instance) { PyObject *type = Py_TYPE(instance); PyObject_GC_Del(instance); #if PY_VERSION_HEX >= 0x03080000 // This was not needed before Python 3.8 (Python issue 35810) Py_DECREF(type); #endif }
sv: statiskt void foo_dealloc(foo_struct *instans) { PyObject *type = Py_TYPE(instans); PyObject_GC_Del(instans); #if PY_VERSION_HEX >= 0x03080000 // Detta behövdes inte före Python 3.8 (Python issue 35810) Py_DECREF(typ); #endif }

source: (Contributed by Eddie Elizondo in :issue:`35810`.)
sv: (Bidrag från Eddie Elizondo i :issue:`35810`.)

source: The :c:macro:`Py_DEPRECATED()` macro has been implemented for MSVC. The macro now must be placed before the symbol name.
sv: Makrot :c:macro:`Py_DEPRECATED()` har implementerats för MSVC. Makrot måste nu placeras före symbolnamnet.

source: (Contributed by Zackery Spytz in :issue:`33407`.)
sv: (Bidrag från Zackery Spytz i :issue:`33407`.)

source: The interpreter does not pretend to support binary compatibility of extension types across feature releases, anymore. A :c:type:`PyTypeObject` exported by a third-party extension module is supposed to have all the slots expected in the current Python version, including :c:member:`~PyTypeObject.tp_finalize` (:c:macro:`Py_TPFLAGS_HAVE_FINALIZE` is not checked anymore before reading :c:member:`~PyTypeObject.tp_finalize`).
sv: Tolken låtsas inte längre stödja binär kompatibilitet för tilläggstyper över funktionsutgåvor. En :c:type:`PyTypeObject` som exporteras av en tilläggsmodul från tredje part ska ha alla slots som förväntas i den aktuella Python-versionen, inklusive :c:member:`~PyTypeObject.tp_finalize` (:c:macro:`Py_TPFLAGS_HAVE_FINALIZE` kontrolleras inte längre innan läsning av :c:member:`~PyTypeObject.tp_finalize`).

source: (Contributed by Antoine Pitrou in :issue:`32388`.)
sv: (Bidrag från Antoine Pitrou i :issue:`32388`.)

source: The functions :c:func:`!PyNode_AddChild` and :c:func:`!PyParser_AddToken` now accept two additional ``int`` arguments *end_lineno* and *end_col_offset*.
sv: Funktionerna :c:func:`!PyNode_AddChild` och :c:func:`!PyParser_AddToken` accepterar nu två ytterligare ``int``-argument *end_lineno* och *end_col_offset*.

source: The :file:`libpython38.a` file to allow MinGW tools to link directly against :file:`python38.dll` is no longer included in the regular Windows distribution. If you require this file, it may be generated with the ``gendef`` and ``dlltool`` tools, which are part of the MinGW binutils package:
sv: Filen :file:`libpython38.a` som gör det möjligt för MinGW-verktyg att länka direkt mot :file:`python38.dll` ingår inte längre i den vanliga Windows-distributionen. Om du behöver den här filen kan den genereras med verktygen ``gendef`` och ``dlltool``, som ingår i MinGW binutils-paketet:

source: The location of an installed :file:`pythonXY.dll` will depend on the installation options and the version and language of Windows. See :ref:`using-on-windows` for more information. The resulting library should be placed in the same directory as :file:`pythonXY.lib`, which is generally the :file:`libs` directory under your Python installation.
sv: Platsen för en installerad :file:`pythonXY.dll` beror på installationsalternativen och versionen av och språket i Windows. Se :ref:`using-on-windows` för mer information. Det resulterande biblioteket bör placeras i samma katalog som :file:`pythonXY.lib`, vilket i allmänhet är :file:`libs`-katalogen under din Python-installation.

source: (Contributed by Steve Dower in :issue:`37351`.)
sv: (Bidrag från Steve Dower i :issue:`37351`.)

source: CPython bytecode changes
sv: CPython bytecode-ändringar

source: The interpreter loop has been simplified by moving the logic of unrolling the stack of blocks into the compiler. The compiler emits now explicit instructions for adjusting the stack of values and calling the cleaning-up code for :keyword:`break`, :keyword:`continue` and :keyword:`return`.
sv: Tolkningsloopen har förenklats genom att logiken för att rulla ut blockstapeln har flyttats till kompilatorn. Kompilatorn ger nu uttryckliga instruktioner för att justera stapeln med värden och anropa uppstädningskoden för :keyword:`break`, :keyword:`continue` och :keyword:`return`.

source: Removed opcodes :opcode:`!BREAK_LOOP`, :opcode:`!CONTINUE_LOOP`, :opcode:`!SETUP_LOOP` and :opcode:`!SETUP_EXCEPT`. Added new opcodes :opcode:`!ROT_FOUR`, :opcode:`!BEGIN_FINALLY`, :opcode:`!CALL_FINALLY` and :opcode:`!POP_FINALLY`. Changed the behavior of :opcode:`!END_FINALLY` and :opcode:`!WITH_CLEANUP_START`.
sv: Borttagna opkoder :opcode:`!BREAK_LOOP`, :opcode:`!CONTINUE_LOOP`, :opcode:`!SETUP_LOOP` och :opcode:`!SETUP_EXCEPT`. Lagt till nya opkoder :opcode:`!ROT_FOUR`, :opcode:`!BEGIN_FINALLY`, :opcode:`!CALL_FINALLY` och :opcode:`!POP_FINALLY`. Ändrat beteende för :opcode:`!END_FINALLY` och :opcode:`!WITH_CLEANUP_START`.

source: (Contributed by Mark Shannon, Antoine Pitrou and Serhiy Storchaka in :issue:`17611`.)
sv: (Bidrag från Mark Shannon, Antoine Pitrou och Serhiy Storchaka i :issue:`17611`.)

source: Added new opcode :opcode:`END_ASYNC_FOR` for handling exceptions raised when awaiting a next item in an :keyword:`async for` loop. (Contributed by Serhiy Storchaka in :issue:`33041`.)
sv: Lagt till ny opcode :opcode:`END_ASYNC_FOR` för hantering av undantag som uppstår när man väntar på nästa objekt i en :keyword:`async for`-loop. (Bidrag från Serhiy Storchaka i :issue:`33041`.)

source: The :opcode:`MAP_ADD` now expects the value as the first element in the stack and the key as the second element. This change was made so the key is always evaluated before the value in dictionary comprehensions, as proposed by :pep:`572`. (Contributed by Jörn Heissler in :issue:`35224`.)
sv: :opcode:`MAP_ADD` förväntar sig nu värdet som det första elementet i stacken och nyckeln som det andra elementet. Denna ändring gjordes så att nyckeln alltid utvärderas före värdet i ordboksförståelser, vilket föreslogs av :pep:`572`. (Bidrag från Jörn Heissler i :issue:`35224`.)

source: Demos and Tools
sv: Demonstrationer och verktyg

source: Added a benchmark script for timing various ways to access variables: ``Tools/scripts/var_access_benchmark.py``. (Contributed by Raymond Hettinger in :issue:`35884`.)
sv: Lagt till ett benchmarkskript för att mäta olika sätt att komma åt variabler: ``Tools/scripts/var_access_benchmark.py``. (Bidrag från Raymond Hettinger i :issue:`35884`.)

source: Here's a summary of performance improvements since Python 3.3:
sv: Här är en sammanfattning av prestandaförbättringar sedan Python 3.3:

source: Python version 3.3 3.4 3.5 3.6 3.7 3.8 -------------- --- --- --- --- --- --- Variable and attribute read access: read_local 4.0 7.1 7.1 5.4 5.1 3.9 read_nonlocal 5.3 7.1 8.1 5.8 5.4 4.4 read_global 13.3 15.5 19.0 14.3 13.6 7.6 read_builtin 20.0 21.1 21.6 18.5 19.0 7.5 read_classvar_from_class 20.5 25.6 26.5 20.7 19.5 18.4 read_classvar_from_instance 18.5 22.8 23.5 18.8 17.1 16.4 read_instancevar 26.8 32.4 33.1 28.0 26.3 25.4 read_instancevar_slots 23.7 27.8 31.3 20.8 20.8 20.2 read_namedtuple 68.5 73.8 57.5 45.0 46.8 18.4 read_boundmethod 29.8 37.6 37.9 29.6 26.9 27.7 Variable and attribute write access: write_local 4.6 8.7 9.3 5.5 5.3 4.3 write_nonlocal 7.3 10.5 11.1 5.6 5.5 4.7 write_global 15.9 19.7 21.2 18.0 18.0 15.8 write_classvar 81.9 92.9 96.0 104.6 102.1 39.2 write_instancevar 36.4 44.6 45.8 40.0 38.9 35.5 write_instancevar_slots 28.7 35.6 36.1 27.3 26.6 25.7 Data structure read access: read_list 19.2 24.2 24.5 20.8 20.8 19.0 read_deque 19.9 24.7 25.5 20.2 20.6 19.8 read_dict 19.7 24.3 25.7 22.3 23.0 21.0 read_strdict 17.9 22.6 24.3 19.5 21.2 18.9 Data structure write access: write_list 21.2 27.1 28.5 22.5 21.6 20.0 write_deque 23.8 28.7 30.1 22.7 21.8 23.5 write_dict 25.9 31.4 33.3 29.3 29.2 24.7 write_strdict 22.9 28.4 29.9 27.5 25.2 23.1 Stack (or queue) operations: list_append_pop 144.2 93.4 112.7 75.4 74.2 50.8 deque_append_pop 30.4 43.5 57.0 49.4 49.2 42.5 deque_append_popleft 30.8 43.7 57.3 49.7 49.7 42.8 Timing loop: loop_overhead 0.3 0.5 0.6 0.4 0.3 0.3
sv: Python version 3,3 3,4 3,5 3,6 3,7 3,8 -------------- --- --- --- --- --- --- Läsåtkomst för variabler och attribut: read_local 4,0 7,1 7,1 5,4 5,1 3,9 read_nonlocal 5,3 7,1 8,1 5,8 5,4 4,4 läs_global 13,3 15,5 19,0 14,3 13,6 7,6 read_builtin 20,0 21,1 21,6 18,5 19,0 7,5 läs_klassvar_från_klass 20,5 25,6 26,5 20,7 19,5 18,4 read_classvar_from_instance 18,5 22,8 23,5 18,8 17,1 16,4 read_instancevar 26,8 32,4 33,1 28,0 26,3 25,4 read_instancevar_slots 23,7 27,8 31,3 20,8 20,8 20,2 read_namedtuple 68,5 73,8 57,5 45,0 46,8 18,4 read_boundmethod 29,8 37,6 37,9 29,6 26,9 27,7 Skrivåtkomst för variabler och attribut: write_local 4,6 8,7 9,3 5,5 5,3 4,3 write_nonlocal 7,3 10,5 11,1 5,6 5,5 4,7 write_global 15,9 19,7 21,2 18,0 18,0 15,8 write_classvar 81,9 92,9 96,0 104,6 102,1 39,2 write_instancevar 36,4 44,6 45,8 40,0 38,9 35,5 write_instancevar_slots 28,7 35,6 36,1 27,3 26,6 25,7 Läsåtkomst för datastruktur: read_list 19,2 24,2 24,5 20,8 20,8 19,0 read_deque 19,9 24,7 25,5 20,2 20,6 19,8 read_dict 19,7 24,3 25,7 22,3 23,0 21,0 read_strdict 17,9 22,6 24,3 19,5 21,2 18,9 Skrivåtkomst till datastruktur: write_list 21,2 27,1 28,5 22,5 21,6 20,0 write_deque 23,8 28,7 30,1 22,7 21,8 23,5 write_dict 25,9 31,4 33,3 29,3 29,2 24,7 write_strdict 22,9 28,4 29,9 27,5 25,2 23,1 Stapel- (eller kö-) operationer: list_append_pop 144,2 93,4 112,7 75,4 74,2 50,8 deque_append_pop 30,4 43,5 57,0 49,4 49,2 42,5 deque_append_popleft 30,8 43,7 57,3 49,7 49,7 42,8 Tidtagning av slinga: loop_overhead 0,3 0,5 0,6 0,4 0,3 0,3

source: The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/macos/>`_. The benchmark script displays timings in nanoseconds.
sv: Riktmärkena uppmättes på en `Intel® Core™ i7-4960HQ-processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ som körde macOS 64-bitars builds som finns på `python.org <https://www.python.org/downloads/macos/>`_. Benchmarkskriptet visar tidsangivelser i nanosekunder.

source: Notable changes in Python 3.8.1
sv: Viktiga ändringar i Python 3.8.1

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
sv: På grund av betydande säkerhetsproblem stöds inte längre parametern *reuse_address* i :meth:`asyncio.loop.create_datagram_endpoint`. Detta beror på beteendet hos socket-alternativet ``SO_REUSEADDR`` i UDP. För mer information, se dokumentationen för ``loop.create_datagram_endpoint()``. (Bidrag från Kyle Stanley, Antoine Pitrou och Yury Selivanov i :issue:`37228`.)

source: Notable changes in Python 3.8.2
sv: Viktiga ändringar i Python 3.8.2

source: Fixed a regression with the ``ignore`` callback of :func:`shutil.copytree`. The argument types are now str and List[str] again. (Contributed by Manuel Barkhau and Giampaolo Rodola in :gh:`83571`.)
sv: Åtgärdade en regression med ``ignore`` callback av :func:`shutil.copytree`. Argumenttyperna är nu str och List[str] igen. (Bidrag från Manuel Barkhau och Giampaolo Rodola i :gh:`83571`.)

source: Notable changes in Python 3.8.3
sv: Viktiga ändringar i Python 3.8.3

source: The constant values of future flags in the :mod:`__future__` module are updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :gh:`83743`)
sv: De konstanta värdena för framtidsflaggor i modulen :mod:`__future__` uppdateras för att förhindra kollision med kompilatorflaggor. Tidigare krockade ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` med ``CO_FUTURE_DIVISION``. (Bidrag från Batuhan Taskaya i :gh:`83743`)

source: Notable changes in Python 3.8.8
sv: Noterbara ändringar i Python 3.8.8

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
sv: Tidigare Python-versioner tillät användning av både ``;`` och ``&`` som separatorer för frågeparametrar i :func:`urllib.parse.parse_qs` och :func:`urllib.parse.parse_qsl`. På grund av säkerhetsproblem och för att överensstämma med nyare W3C-rekommendationer har detta ändrats så att endast en enda separatornyckel tillåts, med ``&`` som standard. Denna ändring påverkar även :func:`!cgi.parse` och :func:`!cgi.parse_multipart` eftersom de använder de berörda funktionerna internt. För mer information, vänligen se deras respektive dokumentation. (Bidrag från Adam Goldschmidt, Senthil Kumaran och Ken Jin i :issue:`42967`.)

source: Notable changes in Python 3.8.9
sv: Viktiga ändringar i Python 3.8.9

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
sv: En säkerhetsfix ändrar :class:`ftplib.FTP`-beteendet så att det inte litar på den IPv4-adress som skickas från fjärrservern när en passiv datakanal sätts upp. Vi återanvänder istället ftp-serverns IP-adress. För ovanlig kod som kräver det gamla beteendet, ställ in attributet ``trust_server_pasv_ipv4_address`` på din FTP-instans till ``True``. (Se :gh:`87451`)

source: Notable changes in Python 3.8.10
sv: Viktiga ändringar i Python 3.8.10

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
sv: macOS 11.0 (Big Sur) och stöd för Apple Silicon Mac

source: As of 3.8.10, Python now supports building and running on macOS 11 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Note that support for "weaklinking", building binaries targeted for newer versions of macOS that will also run correctly on older versions by testing at runtime for missing features, is not included in this backport from Python 3.9; to support a range of macOS versions, continue to target for and build on the oldest version in the range.
sv: Från och med 3.8.10 stöder Python nu byggande och körning på macOS 11 (Big Sur) och på Apple Silicon Macs (baserat på ``ARM64``-arkitekturen). En ny universell byggvariant, ``universal2``, finns nu tillgänglig för inbyggt stöd för både ``ARM64`` och ``Intel 64`` i en uppsättning körbara filer. Observera att stöd för "weaklinking", att bygga binära filer riktade till nyare versioner av macOS som också kommer att köras korrekt på äldre versioner genom att testa vid körning för saknade funktioner, inte ingår i denna bakport från Python 3.9; för att stödja en rad macOS-versioner, fortsätt att rikta in dig på och bygga på den äldsta versionen i intervallet.

source: (Originally contributed by Ronald Oussoren and Lawrence D'Anna in :gh:`85272`, with fixes by FX Coudert and Eli Rykoff, and backported to 3.8 by Maxime Bélanger and Ned Deily)
sv: (Ursprungligen bidragit av Ronald Oussoren och Lawrence D'Anna i :gh:`85272`, med korrigeringar av FX Coudert och Eli Rykoff, och bakåtporterad till 3.8 av Maxime Bélanger och Ned Deily)
