Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: The syntax allowed for keyword names in function calls was further restricted. In particular, ``f((keyword)=arg)`` is no longer allowed. It was never intended to permit more than a bare name on the left-hand side of a keyword argument assignment term. (Contributed by Benjamin Peterson in :issue:`34641`.)
sv: Den syntax som tillåts för nyckelordsnamn i funktionsanrop har begränsats ytterligare. I synnerhet är ``f((nyckelord)=arg)`` inte längre tillåtet. Det var aldrig meningen att tillåta mer än ett namn på vänstersidan av ett nyckelords argumenttilldelningsterm. (Bidrag från Benjamin Peterson i :issue:`34641`.)

source: Generalized iterable unpacking in :keyword:`yield` and :keyword:`return` statements no longer requires enclosing parentheses. This brings the *yield* and *return* syntax into better agreement with normal assignment syntax::
sv: Generaliserad iterabeluppackning i :keyword:`yield`- och :keyword:`return`-satser kräver inte längre omslutande parenteser. Detta gör att syntaxen för *yield* och *return* stämmer bättre överens med normal syntax för tilldelningar::

source: >>> def parse(family): ... lastname, *members = family.split() ... return lastname.upper(), *members ... >>> parse('simpsons homer marge bart lisa maggie') ('SIMPSONS', 'homer', 'marge', 'bart', 'lisa', 'maggie')
sv: >>> def parse(familj): ... efternamn, *medlemmar = familj.split() ... return efternamn.övre(), *medlemmar ... >>> parse('simpsons homer marge bart lisa maggie') ('SIMPSONS', 'homer', 'marge', 'bart', 'lisa', 'maggie')

source: (Contributed by David Cuthbert and Jordan Chapman in :issue:`32117`.)
sv: (Bidrag från David Cuthbert och Jordan Chapman i :issue:`32117`.)

source: When a comma is missed in code such as ``[(10, 20) (30, 40)]``, the compiler displays a :exc:`SyntaxWarning` with a helpful suggestion. This improves on just having a :exc:`TypeError` indicating that the first tuple was not callable. (Contributed by Serhiy Storchaka in :issue:`15248`.)
sv: När ett kommatecken missas i kod som ``[(10, 20) (30, 40)]``, visar kompilatorn en :exc:`SyntaxWarning` med ett användbart förslag. Detta är en förbättring jämfört med att bara ha en :exc:`TypeError` som indikerar att den första tupeln inte var anropsbar. (Bidrag från Serhiy Storchaka i :issue:`15248`.)

source: Arithmetic operations between subclasses of :class:`datetime.date` or :class:`datetime.datetime` and :class:`datetime.timedelta` objects now return an instance of the subclass, rather than the base class. This also affects the return type of operations whose implementation (directly or indirectly) uses :class:`datetime.timedelta` arithmetic, such as :meth:`~datetime.datetime.astimezone`. (Contributed by Paul Ganssle in :issue:`32417`.)
sv: Aritmetiska operationer mellan underklasser av :class:`datetime.date` eller :class:`datetime.datetime` och :class:`datetime.timedelta`-objekt returnerar nu en instans av underklassen, snarare än basklassen. Detta påverkar också returtypen för operationer vars implementering (direkt eller indirekt) använder :class:`datetime.timedelta`-aritmetik, till exempel :meth:`~datetime.datetime.astimezone`. (Bidrag från Paul Ganssle i :issue:`32417`.)

source: When the Python interpreter is interrupted by Ctrl-C (SIGINT) and the resulting :exc:`KeyboardInterrupt` exception is not caught, the Python process now exits via a SIGINT signal or with the correct exit code such that the calling process can detect that it died due to a Ctrl-C. Shells on POSIX and Windows use this to properly terminate scripts in interactive sessions. (Contributed by Google via Gregory P. Smith in :issue:`1054041`.)
sv: När Python-tolken avbryts av Ctrl-C (SIGINT) och det resulterande :exc:`KeyboardInterrupt`-undantaget inte fångas upp, avslutas Python-processen nu via en SIGINT-signal eller med rätt utgångskod så att den anropande processen kan upptäcka att den dog på grund av ett Ctrl-C. Skal på POSIX och Windows använder detta för att avsluta skript i interaktiva sessioner på rätt sätt. (Bidrag från Google via Gregory P. Smith i :issue:`1054041`.)

source: Some advanced styles of programming require updating the :class:`types.CodeType` object for an existing function. Since code objects are immutable, a new code object needs to be created, one that is modeled on the existing code object. With 19 parameters, this was somewhat tedious. Now, the new ``replace()`` method makes it possible to create a clone with a few altered parameters.
sv: Vissa avancerade programmeringsstilar kräver uppdatering av :class:`types.CodeType`-objektet för en befintlig funktion. Eftersom kodobjekt är oföränderliga måste ett nytt kodobjekt skapas, ett som är modellerat på det befintliga kodobjektet. Med 19 parametrar var detta något tråkigt. Nu gör den nya metoden ``replace()`` det möjligt att skapa en klon med några få ändrade parametrar.

source: Here's an example that alters the :func:`statistics.mean` function to prevent the *data* parameter from being used as a keyword argument::
sv: Här är ett exempel som ändrar funktionen :func:`statistics.mean` för att förhindra att parametern *data* används som ett nyckelordsargument::

source: >>> from statistics import mean >>> mean(data=[10, 20, 90]) 40 >>> mean.__code__ = mean.__code__.replace(co_posonlyargcount=1) >>> mean(data=[10, 20, 90]) Traceback (most recent call last): ... TypeError: mean() got some positional-only arguments passed as keyword arguments: 'data'
sv: >>> från statistik import medelvärde >>> medelvärde(data=[10, 20, 90]) 40 >>> mean.__code__ = mean.__code__.replace(co_posonlyargcount=1) >>> medelvärde(data=[10, 20, 90]) Traceback (senaste anropet senast): ... TypeError: mean() fick några endast positionella argument som nyckelordsargument: 'data'

source: (Contributed by Victor Stinner in :issue:`37032`.)
sv: (Bidrag från Victor Stinner i :issue:`37032`.)

source: For integers, the three-argument form of the :func:`pow` function now permits the exponent to be negative in the case where the base is relatively prime to the modulus. It then computes a modular inverse to the base when the exponent is ``-1``, and a suitable power of that inverse for other negative exponents. For example, to compute the `modular multiplicative inverse <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ of 38 modulo 137, write::
sv: För heltal tillåter nu :func:`pow`-funktionens treargumentform att exponenten är negativ i de fall där basen är relativt prim till modulus. Den beräknar sedan en modulär invers till basen när exponenten är ``-1``, och en lämplig potens av denna invers för andra negativa exponenter. För att till exempel beräkna den `modulära multiplikativa inversen <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ av 38 modulo 137, skriv::

source: Modular inverses arise in the solution of `linear Diophantine equations <https://en.wikipedia.org/wiki/Diophantine_equation>`_. For example, to find integer solutions for ``4258𝑥 + 147𝑦 = 369``, first rewrite as ``4258𝑥 ≡ 369 (mod 147)`` then solve:
sv: Modulära inverser förekommer vid lösning av `linjära diofantiska ekvationer <https://en.wikipedia.org/wiki/Diophantine_equation>`_. Till exempel, för att hitta heltalslösningar för ``4258𝑥 + 147𝑦 = 369``, skriv först om till ``4258𝑥 ≡ 369 (mod 147)`` och lös sedan:

source: (Contributed by Mark Dickinson in :issue:`36027`.)
sv: (Bidrag från Mark Dickinson i :issue:`36027`.)

source: Dict comprehensions have been synced-up with dict literals so that the key is computed first and the value second::
sv: Dict-komprehensioner har synkroniserats med dict-litteraler så att nyckeln beräknas först och värdet sedan::

source: >>> # Dict comprehension >>> cast = {input('role? '): input('actor? ') for i in range(2)} role? King Arthur actor? Chapman role? Black Knight actor? Cleese >>> # Dict literal >>> cast = {input('role? '): input('actor? ')} role? Sir Robin actor? Eric Idle
sv: >>> # Dict-förståelse >>> cast = {input('role? '): input('actor? ') for i in range(2)} roll? Kung Arthur skådespelare? Chapman roll? Svarte riddaren skådespelare? Cleese >>> # Dict bokstavlig >>> cast = {input('roll? '): input('skådespelare? ')} roll? Sir Robin skådespelare? Eric Idle

source: The guaranteed execution order is helpful with assignment expressions because variables assigned in the key expression will be available in the value expression::
sv: Den garanterade exekveringsordningen är användbar med tilldelningsuttryck eftersom variabler som tilldelats i nyckeluttrycket kommer att vara tillgängliga i värdeuttrycket::

source: >>> names = ['Martin von Löwis', 'Łukasz Langa', 'Walter Dörwald'] >>> {(n := normalize('NFC', name)).casefold() : n for name in names} {'martin von löwis': 'Martin von Löwis', 'łukasz langa': 'Łukasz Langa', 'walter dörwald': 'Walter Dörwald'}
sv: >>> namn = ['Martin von Löwis', 'Łukasz Langa', 'Walter Dörwald'] >>> {(n := normalize('NFC') namn) >>> {(n := normalize('NFC', name)).casefold() : n för namn i names} {'martin von löwis': 'Martin von Löwis', "łukasz langa": "Łukasz Langa", "walter dörwald": "Walter Dörwald"}

source: (Contributed by Jörn Heissler in :issue:`35224`.)
sv: (Bidrag från Jörn Heissler i :issue:`35224`.)

source: The :meth:`object.__reduce__` method can now return a tuple from two to six elements long. Formerly, five was the limit. The new, optional sixth element is a callable with a ``(obj, state)`` signature. This allows the direct control over the state-updating behavior of a specific object. If not *None*, this callable will have priority over the object's :meth:`~__setstate__` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
sv: Metoden :meth:`object.__reduce__` kan nu returnera en tupel som är mellan två och sex element lång. Tidigare var fem gränsen. Det nya, valfria sjätte elementet är en callable med signaturen ``(obj, state)``. Detta möjliggör direkt kontroll över tillståndsuppdateringsbeteendet för ett specifikt objekt. Om inte *None*, kommer denna callable att ha prioritet över objektets :meth:`~__setstate__`-metod. (Bidrag från Pierre Glaser och Olivier Grisel i :issue:`35900`.)

source: New Modules
sv: Nya moduler

source: The new :mod:`importlib.metadata` module provides (provisional) support for reading metadata from third-party packages. For example, it can extract an installed package's version number, list of entry points, and more::
sv: Den nya :mod:`importlib.metadata`-modulen ger (provisoriskt) stöd för att läsa metadata från tredjepartspaket. Den kan till exempel extrahera ett installerat pakets versionsnummer, lista över ingångspunkter med mera:

source: >>> # Note following example requires that the popular "requests" >>> # package has been installed. >>> >>> from importlib.metadata import version, requires, files >>> version('requests') '2.22.0' >>> list(requires('requests')) ['chardet (<3.1.0,>=3.0.2)'] >>> list(files('requests'))[:5] [PackagePath('requests-2.22.0.dist-info/INSTALLER'), PackagePath('requests-2.22.0.dist-info/LICENSE'), PackagePath('requests-2.22.0.dist-info/METADATA'), PackagePath('requests-2.22.0.dist-info/RECORD'), PackagePath('requests-2.22.0.dist-info/WHEEL')]
sv: >>> # Observera att följande exempel kräver att det populära "requests" >>> # paketet har installerats. >>> >>> from importlib.metadata import version, requires, files >>> version('requests') '2.22.0' >>> list(krav('requests')) ['chardet (<3.1.0,>=3.0.2)'] >>> list(filer('requests'))[:5] [PackagePath('requests-2.22.0.dist-info/INSTALLER'), PackagePath('requests-2.22.0.dist-info/LICENSE'), PackagePath('requests-2.22.0.dist-info/METADATA'), PackagePath('requests-2.22.0.dist-info/RECORD'), PackagePath('requests-2.22.0.dist-info/WHEEL')]

source: (Contributed by Barry Warsaw and Jason R. Coombs in :issue:`34632`.)
sv: (Bidrag från Barry Warsaw och Jason R. Coombs i :issue:`34632`.)

source: Improved Modules
sv: Förbättrade moduler

source: AST nodes now have ``end_lineno`` and ``end_col_offset`` attributes, which give the precise location of the end of the node. (This only applies to nodes that have ``lineno`` and ``col_offset`` attributes.)
sv: AST-noder har nu attributen ``end_lineno`` och ``end_col_offset``, som anger den exakta platsen för nodens slut. (Detta gäller endast för noder som har attributen ``lineno`` och ``col_offset``)

source: New function :func:`ast.get_source_segment` returns the source code for a specific AST node.
sv: Ny funktion :func:`ast.get_source_segment` returnerar källkoden för en specifik AST-nod.

source: (Contributed by Ivan Levkivskyi in :issue:`33416`.)
sv: (Bidrag från Ivan Levkivskyi i :issue:`33416`.)

source: The :func:`ast.parse` function has some new flags:
sv: Funktionen :func:`ast.parse` har fått några nya flaggor:

source: ``type_comments=True`` causes it to return the text of :pep:`484` and :pep:`526` type comments associated with certain AST nodes;
sv: ``type_comments=True`` gör att den returnerar texten i kommentarer av typen :pep:`484` och :pep:`526` som är associerade med vissa AST-noder;

source: ``mode='func_type'`` can be used to parse :pep:`484` "signature type comments" (returned for function definition AST nodes);
sv: ``mode='func_type'`` kan användas för att analysera :pep:`484` "signature type comments" (returneras för funktionsdefinition AST-noder);

source: ``feature_version=(3, N)`` allows specifying an earlier Python 3 version. For example, ``feature_version=(3, 4)`` will treat :keyword:`async` and :keyword:`await` as non-reserved words.
sv: ``feature_version=(3, N)`` gör det möjligt att ange en tidigare Python 3-version. Till exempel, ``feature_version=(3, 4)`` kommer att behandla :keyword:`async` och :keyword:`await` som icke-reserverade ord.

source: (Contributed by Guido van Rossum in :issue:`35766`.)
sv: (Bidrag från Guido van Rossum i :issue:`35766`.)

source: :func:`asyncio.run` has graduated from the provisional to stable API. This function can be used to execute a :term:`coroutine` and return the result while automatically managing the event loop. For example::
sv: :func:`asyncio.run` har gått från provisional till stable API. Denna funktion kan användas för att exekvera en :term:`coroutine` och returnera resultatet samtidigt som händelseslingan hanteras automatiskt. Till exempel::

source: This is *roughly* equivalent to::
sv: Detta är *helt* likvärdigt med::

source: The actual implementation is significantly more complex. Thus, :func:`asyncio.run` should be the preferred way of running asyncio programs.
sv: Den faktiska implementationen är betydligt mer komplex. Därför bör :func:`asyncio.run` vara det föredragna sättet att köra asyncioprogram.

source: (Contributed by Yury Selivanov in :issue:`32314`.)
sv: (Bidrag från Yury Selivanov i :issue:`32314`.)

source: Running ``python -m asyncio`` launches a natively async REPL. This allows rapid experimentation with code that has a top-level :keyword:`await`. There is no longer a need to directly call ``asyncio.run()`` which would spawn a new event loop on every invocation:
sv: Genom att köra ``python -m asyncio`` startas en inbyggd asynkron REPL. Detta möjliggör snabba experiment med kod som har en toppnivå :keyword:`await`. Det finns inte längre något behov av att direkt anropa ``asyncio.run()`` vilket skulle skapa en ny händelseslinga vid varje anrop:

source: (Contributed by Yury Selivanov in :issue:`37028`.)
sv: (Bidrag från Yury Selivanov i :issue:`37028`.)

source: The exception :class:`asyncio.CancelledError` now inherits from :class:`BaseException` rather than :class:`Exception` and no longer inherits from :class:`concurrent.futures.CancelledError`. (Contributed by Yury Selivanov in :issue:`32528`.)
sv: Undantaget :class:`asyncio.CancelledError` ärver nu från :class:`BaseException` snarare än :class:`Exception` och ärver inte längre från :class:`concurrent.futures.CancelledError`. (Bidrag från Yury Selivanov i :issue:`32528`.)

source: On Windows, the default event loop is now :class:`~asyncio.ProactorEventLoop`. (Contributed by Victor Stinner in :issue:`34687`.)
sv: I Windows är standardhändelseslingan nu :class:`~asyncio.ProactorEventLoop`. (Bidrag från Victor Stinner i :issue:`34687`.)

source: :class:`~asyncio.ProactorEventLoop` now also supports UDP. (Contributed by Adam Meily and Andrew Svetlov in :issue:`29883`.)
sv: :class:`~asyncio.ProactorEventLoop` stöder nu även UDP. (Bidrag från Adam Meily och Andrew Svetlov i :issue:`29883`.)

source: :class:`~asyncio.ProactorEventLoop` can now be interrupted by :exc:`KeyboardInterrupt` ("CTRL+C"). (Contributed by Vladimir Matveev in :issue:`23057`.)
sv: :class:`~asyncio.ProactorEventLoop` kan nu avbrytas med :exc:`KeyboardInterrupt` ("CTRL+C"). (Bidrag från Vladimir Matveev i :issue:`23057`.)

source: Added :meth:`asyncio.Task.get_coro` for getting the wrapped coroutine within an :class:`asyncio.Task`. (Contributed by Alex Grönholm in :issue:`36999`.)
sv: Lagt till :meth:`asyncio.Task.get_coro` för att hämta den omslutna coroutinen inom en :class:`asyncio.Task`. (Bidrag från Alex Grönholm i :issue:`36999`.)

source: Asyncio tasks can now be named, either by passing the ``name`` keyword argument to :func:`asyncio.create_task` or the :meth:`~asyncio.loop.create_task` event loop method, or by calling the :meth:`~asyncio.Task.set_name` method on the task object. The task name is visible in the ``repr()`` output of :class:`asyncio.Task` and can also be retrieved using the :meth:`~asyncio.Task.get_name` method. (Contributed by Alex Grönholm in :issue:`34270`.)
sv: Asyncio-uppgifter kan nu namnges, antingen genom att skicka nyckelordsargumentet ``name`` till :func:`asyncio.create_task` eller :meth:`~asyncio.loop.create_task` event loop-metoden, eller genom att anropa :meth:`~asyncio.Task.set_name`-metoden på uppgiftsobjektet. Uppgiftsnamnet är synligt i ``repr()``-utdata från :class:`asyncio.Task` och kan också hämtas med metoden :meth:`~asyncio.Task.get_name`. (Bidrag från Alex Grönholm i :issue:`34270`.)

source: Added support for `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ to :func:`asyncio.loop.create_connection`. To specify the behavior, two new parameters have been added: *happy_eyeballs_delay* and *interleave*. The Happy Eyeballs algorithm improves responsiveness in applications that support IPv4 and IPv6 by attempting to simultaneously connect using both. (Contributed by twisteroid ambassador in :issue:`33530`.)
sv: Stöd för `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ har lagts till i :func:`asyncio.loop.create_connection`. För att specificera beteendet har två nya parametrar lagts till: *happy_eyeballs_delay* och *interleave*. Happy Eyeballs-algoritmen förbättrar responsen i applikationer som stöder IPv4 och IPv6 genom att försöka ansluta samtidigt med båda. (Bidrag från twisteroid-ambassadören i :issue:`33530`.)

source: builtins
sv: inbyggda

source: The :func:`compile` built-in has been improved to accept the ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` flag. With this new flag passed, :func:`compile` will allow top-level ``await``, ``async for`` and ``async with`` constructs that are usually considered invalid syntax. Asynchronous code object marked with the ``CO_COROUTINE`` flag may then be returned. (Contributed by Matthias Bussonnier in :issue:`34616`)
sv: Den inbyggda :func:`compile` har förbättrats för att acceptera ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` flaggan. Med denna nya flagga godkänd, kommer :func:`compile` att tillåta toppnivå ``await``, ``async for`` och ``async with`` konstruktioner som vanligtvis anses vara ogiltig syntax. Asynkrona kodobjekt markerade med flaggan ``CO_COROUTINE`` kan då returneras. (Bidrag från Matthias Bussonnier i :issue:`34616`)

source: collections
sv: samlingar

source: The :meth:`~collections.somenamedtuple._asdict` method for :func:`collections.namedtuple` now returns a :class:`dict` instead of a :class:`collections.OrderedDict`. This works because regular dicts have guaranteed ordering since Python 3.7. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``. (Contributed by Raymond Hettinger in :issue:`35864`.)
sv: Metoden :meth:`~collections.somenamedtuple._asdict` för :func:`collections.namedtuple` returnerar nu en :class:`dict` istället för en :class:`collections.OrderedDict`. Detta fungerar eftersom vanliga dicts har garanterad ordning sedan Python 3.7. Om de extra funktionerna i :class:`OrderedDict` krävs, är den föreslagna lösningen att kasta resultatet till önskad typ: ``OrderedDict(nt._asdict())``. (Bidrag från Raymond Hettinger i :issue:`35864`.)

source: cProfile
sv: cProfil

source: The :class:`cProfile.Profile <profile.Profile>` class can now be used as a context manager. Profile a block of code by running::
sv: Klassen :class:`cProfile.Profile <profile.Profile>` kan nu användas som en kontexthanterare. Profilera ett kodblock genom att köra::

source: import cProfile with cProfile.Profile() as profiler: # code to be profiled ...
sv: import cProfile med cProfile.Profile() som profilerare: # kod som ska profileras ...

source: (Contributed by Scott Sanderson in :issue:`29235`.)
sv: (Bidrag från Scott Sanderson i :issue:`29235`.)

source: The :class:`csv.DictReader` now returns instances of :class:`dict` instead of a :class:`collections.OrderedDict`. The tool is now faster and uses less memory while still preserving the field order. (Contributed by Michael Selik in :issue:`34003`.)
sv: :class:`csv.DictReader` returnerar nu instanser av :class:`dict` istället för en :class:`collections.OrderedDict`. Verktyget är nu snabbare och använder mindre minne samtidigt som fältordningen bevaras. (Bidrag från Michael Selik i :issue:`34003`.)

source: curses
sv: förbannelser

source: Added a new variable holding structured version information for the underlying ncurses library: :data:`~curses.ncurses_version`. (Contributed by Serhiy Storchaka in :issue:`31680`.)
sv: En ny variabel har lagts till som innehåller strukturerad versionsinformation för det underliggande ncurses-biblioteket: :data:`~curses.ncurses_version`. (Bidrag från Serhiy Storchaka i :issue:`31680`.)

source: ctypes
sv: ctyper

source: On Windows, :class:`~ctypes.CDLL` and subclasses now accept a *winmode* parameter to specify flags for the underlying ``LoadLibraryEx`` call. The default flags are set to only load DLL dependencies from trusted locations, including the path where the DLL is stored (if a full or partial path is used to load the initial DLL) and paths added by :func:`~os.add_dll_directory`. (Contributed by Steve Dower in :issue:`36085`.)
sv: I Windows accepterar nu :class:`~ctypes.CDLL` och underklasser en *winmode*-parameter för att ange flaggor för det underliggande ``LoadLibraryEx``-anropet. Standardflaggorna är inställda på att endast ladda DLL-beroenden från betrodda platser, inklusive sökvägen där DLL:en är lagrad (om en fullständig eller partiell sökväg används för att ladda den ursprungliga DLL:en) och sökvägar som lagts till av :func:`~os.add_dll_directory`. (Bidrag från Steve Dower i :issue:`36085`.)

source: datetime
sv: datatid

source: Added new alternate constructors :meth:`datetime.date.fromisocalendar` and :meth:`datetime.datetime.fromisocalendar`, which construct :class:`~datetime.date` and :class:`~datetime.datetime` objects respectively from ISO year, week number, and weekday; these are the inverse of each class's ``isocalendar`` method. (Contributed by Paul Ganssle in :issue:`36004`.)
sv: Lagt till nya alternativa konstruktörer :meth:`datetime.date.fromisocalendar` och :meth:`datetime.datetime.fromisocalendar`, som konstruerar :class:`~datetime.date` och :class:`~datetime.datetime`-objekt från ISO-år, veckonummer respektive veckodag; dessa är inversen av varje klass ``isocalendar``-metod. (Bidrag från Paul Ganssle i :issue:`36004`.)
