Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: :func:`functools.lru_cache` can now be used as a straight decorator rather than as a function returning a decorator. So both of these are now supported::
sv: :func:`functools.lru_cache` kan nu användas som en direkt dekorator snarare än som en funktion som returnerar en dekorator. Så båda dessa stöds nu::

source: @lru_cache def f(x): ... @lru_cache(maxsize=256) def f(x): ...
sv: @lru_cache def f(x): ... @lru_cache(maxstorlek=256) def f(x): ...

source: (Contributed by Raymond Hettinger in :issue:`36772`.)
sv: (Bidrag från Raymond Hettinger i :issue:`36772`.)

source: Added a new :func:`functools.cached_property` decorator, for computed properties cached for the life of the instance. ::
sv: Lagt till en ny :func:`functools.cached_property`-dekorator, för beräknade egenskaper som cachas under instansens livstid. ::

source: (Contributed by Carl Meyer in :issue:`21145`)
sv: (Bidrag från Carl Meyer i :issue:`21145`)

source: Added a new :func:`functools.singledispatchmethod` decorator that converts methods into :term:`generic functions <generic function>` using :term:`single dispatch`::
sv: Lagt till en ny :func:`functools.singledispatchmethod`-dekorator som konverterar metoder till :term:`generiska funktioner <generic function>` med :term:`single dispatch`::

source: (Contributed by Ethan Smith in :issue:`32380`)
sv: (Bidrag från Ethan Smith i :issue:`32380`)

source: :func:`~gc.get_objects` can now receive an optional *generation* parameter indicating a generation to get objects from. (Contributed by Pablo Galindo in :issue:`36016`.)
sv: :func:`~gc.get_objects` kan nu ta emot en valfri *generation* parameter som anger en generation att hämta objekt från. (Bidrag från Pablo Galindo i :issue:`36016`.)

source: Added :func:`~gettext.pgettext` and its variants. (Contributed by Franz Glasner, Éric Araujo, and Cheryl Sabella in :issue:`2504`.)
sv: Lagt till :func:`~gettext.pgettext` och dess varianter. (Bidrag från Franz Glasner, Éric Araujo och Cheryl Sabella i :issue:`2504`.)

source: Added the *mtime* parameter to :func:`gzip.compress` for reproducible output. (Contributed by Guo Ci Teo in :issue:`34898`.)
sv: Lade till parametern *mtime* i :func:`gzip.compress` för reproducerbar utdata. (Bidrag från Guo Ci Teo i :issue:`34898`.)

source: A :exc:`~gzip.BadGzipFile` exception is now raised instead of :exc:`OSError` for certain types of invalid or corrupt gzip files. (Contributed by Filip Gruszczyński, Michele Orrù, and Zackery Spytz in :issue:`6584`.)
sv: Ett :exc:`~gzip.BadGzipFile`-undantag tas nu upp istället för :exc:`OSError` för vissa typer av ogiltiga eller korrupta gzip-filer. (Bidrag från Filip Gruszczyński, Michele Orrù och Zackery Spytz i :issue:`6584`.)

source: IDLE and idlelib
sv: IDLE och idlelib

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
sv: Utdata över N rader (50 som standard) pressas ner till en knapp. N kan ändras i avsnittet PyShell på sidan Allmänt i dialogrutan Inställningar. Färre, men eventuellt extra långa, rader kan pressas genom att högerklicka på utmatningen. Pressad utdata kan expanderas på plats genom att dubbelklicka på knappen eller till urklippet eller ett separat fönster genom att högerklicka på knappen. (Bidrag från Tal Einat i :issue:`1529353`.)

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They also re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
sv: Lägg till "Run Customized" i Run-menyn för att köra en modul med anpassade inställningar. Alla kommandoradsargument som anges läggs till i sys.argv. De visas också igen i rutan för nästa anpassade körning. Man kan också undertrycka den normala omstarten av Shell-huvudmodulen. (Bidrag från Cheryl Sabella, Terry Jan Reedy och andra i :issue:`5680` och :issue:`37627`.)

source: Added optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
sv: Valfria radnummer för IDLE-redigeringsfönster har lagts till. Fönster öppnas utan radnummer om inget annat anges på fliken Allmänt i konfigurationsdialogrutan. Radnummer för ett befintligt fönster visas och döljs i menyn Alternativ. (Bidrag från Tal Einat och Saimadhav Heblikar i :issue:`17535`.)

source: OS native encoding is now used for converting between Python strings and Tcl objects. This allows IDLE to work with emoji and other non-BMP characters. These characters can be displayed or copied and pasted to or from the clipboard. Converting strings from Tcl to Python and back now never fails. (Many people worked on this for eight years but the problem was finally solved by Serhiy Storchaka in :issue:`13153`.)
sv: Nu används OS:s inbyggda kodning för konvertering mellan Python-strängar och Tcl-objekt. Detta gör att IDLE kan arbeta med emoji och andra icke-BMP-tecken. Dessa tecken kan visas eller kopieras och klistras in till eller från urklippet. Konvertering av strängar från Tcl till Python och tillbaka misslyckas nu aldrig. (Många människor arbetade med detta i åtta år men problemet löstes slutligen av Serhiy Storchaka i :issue:`13153`)

source: New in 3.8.1:
sv: Nytt i 3.8.1:

source: Add option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
sv: Lägg till alternativ för att stänga av markörens blinkning. (Bidrag från Zackery Spytz i :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
sv: Escape-tangenten stänger nu IDLE-avslutningsfönster. (Bidrag från Johnny Najera i :issue:`38944`.)

source: The changes above have been backported to 3.7 maintenance releases.
sv: Ändringarna ovan har backporterats till underhållsversionerna av 3.7.

source: Add keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
sv: Lägg till nyckelord i listan för komplettering av modulnamn. (Bidrag från Terry J. Reedy i :issue:`37765`.)

source: inspect
sv: inspektera

source: The :func:`inspect.getdoc` function can now find docstrings for ``__slots__`` if that attribute is a :class:`dict` where the values are docstrings. This provides documentation options similar to what we already have for :func:`property`, :func:`classmethod`, and :func:`staticmethod`::
sv: Funktionen :func:`inspect.getdoc` kan nu hitta dokumentationssträngar för ``__slots__`` om attributet är en :class:`dict` där värdena är dokumentationssträngar. Detta ger dokumentationsalternativ liknande de som vi redan har för :func:`property`, :func:`classmethod` och :func:`staticmethod`::

source: class AudioClip: __slots__ = {'bit_rate': 'expressed in kilohertz to one decimal place', 'duration': 'in seconds, rounded up to an integer'} def __init__(self, bit_rate, duration): self.bit_rate = round(bit_rate / 1000.0, 1) self.duration = ceil(duration)
sv: klass AudioClip: __slots__ = {'bit_rate': 'uttryckt i kilohertz med en decimal', "duration": "i sekunder, avrundat uppåt till ett heltal"} def __init__(self, bit_rate, duration): self.bit_rate = round(bit_rate / 1000,0, 1) self.duration = ceil(duration)

source: (Contributed by Raymond Hettinger in :issue:`36326`.)
sv: (Bidrag från Raymond Hettinger i :issue:`36326`.)

source: In development mode (:option:`-X` ``env``) and in :ref:`debug build <debug-build>`, the :class:`io.IOBase` finalizer now logs the exception if the ``close()`` method fails. The exception is ignored silently by default in release build. (Contributed by Victor Stinner in :issue:`18748`.)
sv: I utvecklingsläge (:option:`-X` ``env``) och i :ref:`debug build <debug-build>`, loggar nu :class:`io.IOBase` finalizer undantaget om metoden ``close()`` misslyckas. Undantaget ignoreras tyst som standard i release-versionen. (Bidrag från Victor Stinner i :issue:`18748`.)

source: The :func:`itertools.accumulate` function added an option *initial* keyword argument to specify an initial value::
sv: Funktionen :func:`itertools.accumulate` lade till ett alternativ *initial* nyckelordsargument för att ange ett initialt värde::

source: (Contributed by Lisa Roach in :issue:`34659`.)
sv: (Bidrag från Lisa Roach i :issue:`34659`.)

source: json.tool
sv: json.verktyg

source: Add option ``--json-lines`` to parse every input line as a separate JSON object. (Contributed by Weipeng Hong in :issue:`31553`.)
sv: Lägg till alternativet ``--json-lines`` för att analysera varje inmatningsrad som ett separat JSON-objekt. (Bidrag från Weipeng Hong i :issue:`31553`.)

source: logging
sv: loggning

source: Added a *force* keyword argument to :func:`logging.basicConfig`. When set to true, any existing handlers attached to the root logger are removed and closed before carrying out the configuration specified by the other arguments.
sv: Lade till ett *force* nyckelordsargument till :func:`logging.basicConfig`. När det är satt till true tas alla befintliga hanterare som är kopplade till rotloggaren bort och stängs innan konfigurationen som anges av de andra argumenten utförs.

source: This solves a long-standing problem. Once a logger or *basicConfig()* had been called, subsequent calls to *basicConfig()* were silently ignored. This made it difficult to update, experiment with, or teach the various logging configuration options using the interactive prompt or a Jupyter notebook.
sv: Detta löser ett långvarigt problem. När en logger eller *basicConfig()* hade anropats, ignorerades efterföljande anrop till *basicConfig()* i tysthet. Detta gjorde det svårt att uppdatera, experimentera med eller lära ut de olika konfigurationsalternativen för loggning med hjälp av den interaktiva prompten eller en Jupyter-anteckningsbok.

source: (Suggested by Raymond Hettinger, implemented by Donghee Na, and reviewed by Vinay Sajip in :issue:`33897`.)
sv: (Föreslagen av Raymond Hettinger, implementerad av Donghee Na, och granskad av Vinay Sajip i :issue:`33897`.)

source: math
sv: matematik

source: Added new function :func:`math.dist` for computing Euclidean distance between two points. (Contributed by Raymond Hettinger in :issue:`33089`.)
sv: Lagt till ny funktion :func:`math.dist` för beräkning av Euclidean-avstånd mellan två punkter. (Bidrag från Raymond Hettinger i :issue:`33089`.)

source: Expanded the :func:`math.hypot` function to handle multiple dimensions. Formerly, it only supported the 2-D case. (Contributed by Raymond Hettinger in :issue:`33089`.)
sv: Funktionen :func:`math.hypot` har utökats för att hantera flera dimensioner. Tidigare stödde den endast 2D-fallet. (Bidrag från Raymond Hettinger i :issue:`33089`.)

source: Added new function, :func:`math.prod`, as analogous function to :func:`sum` that returns the product of a 'start' value (default: 1) times an iterable of numbers::
sv: Lagt till en ny funktion, :func:`math.prod`, som en analog funktion till :func:`sum` som returnerar produkten av ett startvärde (standard: 1) gånger en iterabel av tal::

source: (Contributed by Pablo Galindo in :issue:`35606`.)
sv: (Bidrag från Pablo Galindo i :issue:`35606`.)

source: Added two new combinatoric functions :func:`math.perm` and :func:`math.comb`::
sv: Lade till två nya kombinatoriska funktioner :func:`math.perm` och :func:`math.comb`::

source: >>> math.perm(10, 3) # Permutations of 10 things taken 3 at a time 720 >>> math.comb(10, 3) # Combinations of 10 things taken 3 at a time 120
sv: >>> math.perm(10, 3) # Permutationer av 10 saker som tas 3 åt gången 720 >>> math.comb(10, 3) # Kombinationer av 10 saker tagna 3 åt gången 120

source: (Contributed by Yash Aggarwal, Keller Fuchs, Serhiy Storchaka, and Raymond Hettinger in :issue:`37128`, :issue:`37178`, and :issue:`35431`.)
sv: (Bidrag från Yash Aggarwal, Keller Fuchs, Serhiy Storchaka och Raymond Hettinger i :issue:`37128`, :issue:`37178` och :issue:`35431`.)

source: Added a new function :func:`math.isqrt` for computing accurate integer square roots without conversion to floating point. The new function supports arbitrarily large integers. It is faster than ``floor(sqrt(n))`` but slower than :func:`math.sqrt`::
sv: Lagt till en ny funktion :func:`math.isqrt` för att beräkna exakta kvadratrötter för heltal utan konvertering till flyttal. Den nya funktionen stöder godtyckligt stora heltal. Den är snabbare än ``floor(sqrt(n))`` men långsammare än :func:`math.sqrt`::

source: >>> r = 650320427 >>> s = r ** 2 >>> isqrt(s - 1) # correct 650320426 >>> floor(sqrt(s - 1)) # incorrect 650320427
sv: >>> r = 650320427 >>> s = r ** 2 >>> isqrt(s - 1) # korrekt 650320426 >>> golv(sqrt(s - 1)) # felaktig 650320427

source: (Contributed by Mark Dickinson in :issue:`36887`.)
sv: (Bidrag från Mark Dickinson i :issue:`36887`.)

source: The function :func:`math.factorial` no longer accepts arguments that are not int-like. (Contributed by Pablo Galindo in :issue:`33083`.)
sv: Funktionen :func:`math.factorial` accepterar inte längre argument som inte är int-liknande. (Bidrag från Pablo Galindo i :issue:`33083`.)

source: The :class:`mmap.mmap` class now has an :meth:`~mmap.mmap.madvise` method to access the ``madvise()`` system call. (Contributed by Zackery Spytz in :issue:`32941`.)
sv: Klassen :class:`mmap.mmap` har nu en :meth:`~mmap.mmap.madvise`-metod för att komma åt systemanropet ``madvise()``. (Bidrag från Zackery Spytz i :issue:`32941`.)

source: Added new :mod:`multiprocessing.shared_memory` module. (Contributed by Davin Potts in :issue:`35813`.)
sv: Lagt till ny :mod:`multiprocessing.shared_memory` modul. (Bidrag från Davin Potts i :issue:`35813`.)

source: On macOS, the *spawn* start method is now used by default. (Contributed by Victor Stinner in :issue:`33725`.)
sv: På macOS används nu startmetoden *spawn* som standard. (Bidrag från Victor Stinner i :issue:`33725`.)

source: Added new function :func:`~os.add_dll_directory` on Windows for providing additional search paths for native dependencies when importing extension modules or loading DLLs using :mod:`ctypes`. (Contributed by Steve Dower in :issue:`36085`.)
sv: Lagt till ny funktion :func:`~os.add_dll_directory` på Windows för att tillhandahålla ytterligare sökvägar för inbyggda beroenden vid import av tilläggsmoduler eller laddning av DLL:er med :mod:`ctypes`. (Bidrag från Steve Dower i :issue:`36085`.)

source: A new :func:`os.memfd_create` function was added to wrap the ``memfd_create()`` syscall. (Contributed by Zackery Spytz and Christian Heimes in :issue:`26836`.)
sv: En ny :func:`os.memfd_create`-funktion lades till för att omsluta syscallen ``memfd_create()``. (Bidrag från Zackery Spytz och Christian Heimes i :issue:`26836`.)

source: On Windows, much of the manual logic for handling reparse points (including symlinks and directory junctions) has been delegated to the operating system. Specifically, :func:`os.stat` will now traverse anything supported by the operating system, while :func:`os.lstat` will only open reparse points that identify as "name surrogates" while others are opened as for :func:`os.stat`. In all cases, :attr:`stat_result.st_mode` will only have ``S_IFLNK`` set for symbolic links and not other kinds of reparse points. To identify other kinds of reparse point, check the new :attr:`stat_result.st_reparse_tag` attribute.
sv: I Windows har en stor del av den manuella logiken för hantering av reparse-punkter (inklusive symlinks och directory junctions) delegerats till operativsystemet. Specifikt kommer :func:`os.stat` nu att korsa allt som stöds av operativsystemet, medan :func:`os.lstat` endast kommer att öppna reparse-punkter som identifieras som "namnsurrogat" medan andra öppnas som för :func:`os.stat`. I samtliga fall kommer :attr:`stat_result.st_mode` endast att ha ``S_IFLNK`` inställt för symboliska länkar och inte för andra typer av reparse-punkter. För att identifiera andra typer av reparse-punkter, kontrollera det nya attributet :attr:`stat_result.st_reparse_tag`.

source: On Windows, :func:`os.readlink` is now able to read directory junctions. Note that :func:`~os.path.islink` will return ``False`` for directory junctions, and so code that checks ``islink`` first will continue to treat junctions as directories, while code that handles errors from :func:`os.readlink` may now treat junctions as links.
sv: I Windows kan :func:`os.readlink` nu läsa katalogförgreningar. Observera att :func:`~os.path.islink` kommer att returnera ``False`` för katalogförgreningar, så kod som kontrollerar ``islink`` först kommer att fortsätta att behandla förgreningar som kataloger, medan kod som hanterar fel från :func:`os.readlink` nu kan behandla förgreningar som länkar.

source: (Contributed by Steve Dower in :issue:`37834`.)
sv: (Bidrag från Steve Dower i :issue:`37834`.)

source: :mod:`os.path` functions that return a boolean result like :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink`, and :func:`~os.path.ismount` now return ``False`` instead of raising :exc:`ValueError` or its subclasses :exc:`UnicodeEncodeError` and :exc:`UnicodeDecodeError` for paths that contain characters or bytes unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
sv: :mod:`os.path` funktioner som returnerar ett booleskt resultat som :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink`, och :func:`~os.path.ismount` returnerar nu ``False`` istället för att ge upphov till :exc:`ValueError` eller dess underklasser :exc:`UnicodeEncodeError` och :exc:`UnicodeDecodeError` för sökvägar som innehåller tecken eller byte som inte kan representeras på OS-nivå. (Bidrag från Serhiy Storchaka i :issue:`33721`.)

source: :func:`~os.path.expanduser` on Windows now prefers the :envvar:`USERPROFILE` environment variable and does not use :envvar:`HOME`, which is not normally set for regular user accounts. (Contributed by Anthony Sottile in :issue:`36264`.)
sv: :func:`~os.path.expanduser` på Windows föredrar nu miljövariabeln :envvar:`USERPROFILE` och använder inte :envvar:`HOME`, som normalt inte är inställd för vanliga användarkonton. (Bidrag från Anthony Sottile i :issue:`36264`.)

source: :func:`~os.path.isdir` on Windows no longer returns ``True`` for a link to a non-existent directory.
sv: :func:`~os.path.isdir` på Windows returnerar inte längre ``True`` för en länk till en icke-existerande katalog.

source: :func:`~os.path.realpath` on Windows now resolves reparse points, including symlinks and directory junctions.
sv: :func:`~os.path.realpath` på Windows löser nu reparse-punkter, inklusive symlinks och directory junctions.

source: :mod:`pathlib.Path` methods that return a boolean result like :meth:`~pathlib.Path.exists`, :meth:`~pathlib.Path.is_dir`, :meth:`~pathlib.Path.is_file`, :meth:`~pathlib.Path.is_mount`, :meth:`~pathlib.Path.is_symlink`, :meth:`~pathlib.Path.is_block_device`, :meth:`~pathlib.Path.is_char_device`, :meth:`~pathlib.Path.is_fifo`, :meth:`~pathlib.Path.is_socket` now return ``False`` instead of raising :exc:`ValueError` or its subclass :exc:`UnicodeEncodeError` for paths that contain characters unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
sv: :mod:`pathlib.Path`-metoder som returnerar ett booleskt resultat som :meth:`~pathlib.Path.exists`, :meth:`~pathlib.Path.is_dir`, :meth:`~pathlib.Path.is_file`, :meth:`~pathlib.Path.is_mount`, :meth:`~pathlib.Path.is_symlink`, :meth:`~pathlib.Path.is_block_device`, :meth:`~pathlib.Path.is_char_device`, :meth:`~pathlib.Path.is_fifo`.Path.is_char_device`, :meth:`~pathlib.Path.is_fifo`, :meth:`~pathlib.Path.is_socket` returnerar nu ``False`` istället för att ge upphov till :exc:`ValueError` eller dess underklass :exc:`UnicodeEncodeError` för sökvägar som innehåller tecken som inte kan representeras på OS-nivå. (Bidrag från Serhiy Storchaka i :issue:`33721`.)

source: Added :meth:`!pathlib.Path.link_to` which creates a hard link pointing to a path. (Contributed by Joannah Nanjekye in :issue:`26978`) Note that ``link_to`` was deprecated in 3.10 and removed in 3.12 in favor of a ``hardlink_to`` method added in 3.10 which matches the semantics of the existing ``symlink_to`` method.
sv: Lagt till :meth:`!pathlib.Path.link_to` som skapar en hård länk som pekar på en sökväg. (Bidrag från Joannah Nanjekye i :issue:`26978`) Observera att ``link_to`` utrangerades i 3.10 och togs bort i 3.12 till förmån för en ``hardlink_to``-metod som lades till i 3.10 och som matchar semantiken i den befintliga ``symlink_to``-metoden.

source: :mod:`pickle` extensions subclassing the C-optimized :class:`~pickle.Pickler` can now override the pickling logic of functions and classes by defining the special :meth:`~pickle.Pickler.reducer_override` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
sv: :mod:`pickle`-tillägg som underklassar den C-optimerade :class:`~pickle.Pickler` kan nu åsidosätta pickling-logiken för funktioner och klasser genom att definiera den speciella :meth:`~pickle.Pickler.reducer_override`-metoden. (Bidrag från Pierre Glaser och Olivier Grisel i :issue:`35900`.)

source: Added new :class:`plistlib.UID` and enabled support for reading and writing NSKeyedArchiver-encoded binary plists. (Contributed by Jon Janzen in :issue:`26707`.)
sv: Lade till ny :class:`plistlib.UID` och aktiverade stöd för att läsa och skriva NSKeyedArchiver-kodade binära plistor. (Bidrag från Jon Janzen i :issue:`26707`.)

source: The :mod:`pprint` module added a *sort_dicts* parameter to several functions. By default, those functions continue to sort dictionaries before rendering or printing. However, if *sort_dicts* is set to false, the dictionaries retain the order that keys were inserted. This can be useful for comparison to JSON inputs during debugging.
sv: Modulen :mod:`pprint` lade till en *sort_dicts*-parameter till flera funktioner. Som standard fortsätter dessa funktioner att sortera lexikon före rendering eller utskrift. Men om *sort_dicts* är satt till false behåller ordböckerna den ordning som nycklarna infogades. Detta kan vara användbart vid jämförelse med JSON-inmatningar under felsökning.

source: In addition, there is a convenience new function, :func:`pprint.pp` that is like :func:`pprint.pprint` but with *sort_dicts* defaulting to ``False``::
sv: Dessutom finns det en ny funktion, :func:`pprint.pp` som är som :func:`pprint.pprint` men med *sort_dicts* som standard till ``False``::

source: >>> from pprint import pprint, pp >>> d = dict(source='input.txt', operation='filter', destination='output.txt') >>> pp(d, width=40) # Original order {'source': 'input.txt', 'operation': 'filter', 'destination': 'output.txt'} >>> pprint(d, width=40) # Keys sorted alphabetically {'destination': 'output.txt', 'operation': 'filter', 'source': 'input.txt'}
sv: >>> from pprint import pprint, pp >>> d = dict(källa='input.txt', operation='filter', destination='output.txt') >>> pp(d, width=40) # Ursprunglig ordning {'source': 'input.txt', 'operation': 'filter', 'destination': 'output.txt'} >>> pprint(d, width=40) # Nycklar sorterade i alfabetisk ordning {'destination': 'output.txt', 'operation': 'filter', 'källa': 'input.txt'}
