Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: (Contributed by Rémi Lapeyre in :issue:`30670`.)
sv: (Bidrag från Rémi Lapeyre i :issue:`30670`.)

source: :func:`py_compile.compile` now supports silent mode. (Contributed by Joannah Nanjekye in :issue:`22640`.)
sv: :func:`py_compile.compile` stöder nu tyst läge. (Bidrag från Joannah Nanjekye i :issue:`22640`.)

source: The new :func:`shlex.join` function acts as the inverse of :func:`shlex.split`. (Contributed by Bo Bayles in :issue:`32102`.)
sv: Den nya funktionen :func:`shlex.join` fungerar som inversen av :func:`shlex.split`. (Bidrag från Bo Bayles i :issue:`32102`.)

source: :func:`shutil.copytree` now accepts a new ``dirs_exist_ok`` keyword argument. (Contributed by Josh Bronson in :issue:`20849`.)
sv: :func:`shutil.copytree` accepterar nu ett nytt ``dirs_exist_ok`` nyckelordsargument. (Bidrag från Josh Bronson i :issue:`20849`.)

source: :func:`shutil.make_archive` now defaults to the modern pax (POSIX.1-2001) format for new archives to improve portability and standards conformance, inherited from the corresponding change to the :mod:`tarfile` module. (Contributed by C.A.M. Gerlach in :issue:`30661`.)
sv: :func:`shutil.make_archive` använder nu som standard det moderna pax-formatet (POSIX.1-2001) för nya arkiv för att förbättra portabiliteten och överensstämmelsen med standarder, vilket är ett arv från motsvarande ändring i modulen :mod:`tarfile`. (Bidrag från C.A.M. Gerlach i :issue:`30661`.)

source: :func:`shutil.rmtree` on Windows now removes directory junctions without recursively removing their contents first. (Contributed by Steve Dower in :issue:`37834`.)
sv: :func:`shutil.rmtree` på Windows tar nu bort katalogförgreningar utan att rekursivt ta bort deras innehåll först. (Bidrag från Steve Dower i :issue:`37834`.)

source: Added :meth:`~socket.create_server` and :meth:`~socket.has_dualstack_ipv6` convenience functions to automate the necessary tasks usually involved when creating a server socket, including accepting both IPv4 and IPv6 connections on the same socket. (Contributed by Giampaolo Rodolà in :issue:`17561`.)
sv: Lagt till :meth:`~socket.create_server` och :meth:`~socket.has_dualstack_ipv6` bekvämlighetsfunktioner för att automatisera de nödvändiga uppgifter som vanligtvis ingår när man skapar en server socket, inklusive att acceptera både IPv4 och IPv6 anslutningar på samma socket. (Bidrag från Giampaolo Rodolà i :issue:`17561`.)

source: The :func:`socket.if_nameindex`, :func:`socket.if_nametoindex`, and :func:`socket.if_indextoname` functions have been implemented on Windows. (Contributed by Zackery Spytz in :issue:`37007`.)
sv: Funktionerna :func:`socket.if_nameindex`, :func:`socket.if_nametoindex` och :func:`socket.if_indextoname` har implementerats i Windows. (Bidrag från Zackery Spytz i :issue:`37007`.)

source: Added :attr:`~ssl.SSLContext.post_handshake_auth` to enable and :meth:`~ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :issue:`34670`.)
sv: Lagt till :attr:`~ssl.SSLContext.post_handshake_auth` för att aktivera och :meth:`~ssl.SSLSocket.verify_client_post_handshake` för att initiera TLS 1.3 post-handshake-autentisering. (Bidrag från Christian Heimes i :issue:`34670`.)

source: Added :func:`statistics.fmean` as a faster, floating-point variant of :func:`statistics.mean`. (Contributed by Raymond Hettinger and Steven D'Aprano in :issue:`35904`.)
sv: Lagt till :func:`statistics.fmean` som en snabbare variant med flyttal av :func:`statistics.mean`. (Bidrag från Raymond Hettinger och Steven D'Aprano i :issue:`35904`.)

source: Added :func:`statistics.geometric_mean` (Contributed by Raymond Hettinger in :issue:`27181`.)
sv: Lagt till :func:`statistics.geometric_mean` (Bidrag från Raymond Hettinger i :issue:`27181`.)

source: Added :func:`statistics.multimode` that returns a list of the most common values. (Contributed by Raymond Hettinger in :issue:`35892`.)
sv: Lagt till :func:`statistics.multimode` som returnerar en lista med de vanligaste värdena. (Bidrag från Raymond Hettinger i :issue:`35892`.)

source: Added :func:`statistics.quantiles` that divides data or a distribution in to equiprobable intervals (e.g. quartiles, deciles, or percentiles). (Contributed by Raymond Hettinger in :issue:`36546`.)
sv: Lagt till :func:`statistics.quantiles` som delar in data eller en fördelning i utjämningsbara intervall (t.ex. kvartiler, deciler eller percentiler). (Bidrag från Raymond Hettinger i :issue:`36546`.)

source: Added :class:`statistics.NormalDist`, a tool for creating and manipulating normal distributions of a random variable. (Contributed by Raymond Hettinger in :issue:`36018`.)
sv: Lagt till :class:`statistics.NormalDist`, ett verktyg för att skapa och manipulera normalfördelningar av en slumpmässig variabel. (Bidrag från Raymond Hettinger i :issue:`36018`.)

source: >>> temperature_feb = NormalDist.from_samples([4, 12, -3, 2, 7, 14]) >>> temperature_feb.mean 6.0 >>> temperature_feb.stdev 6.356099432828281 >>> temperature_feb.cdf(3) # Chance of being under 3 degrees 0.3184678262814532 >>> # Relative chance of being 7 degrees versus 10 degrees >>> temperature_feb.pdf(7) / temperature_feb.pdf(10) 1.2039930378537762 >>> el_niño = NormalDist(4, 2.5) >>> temperature_feb += el_niño # Add in a climate effect >>> temperature_feb NormalDist(mu=10.0, sigma=6.830080526611674) >>> temperature_feb * (9/5) + 32 # Convert to Fahrenheit NormalDist(mu=50.0, sigma=12.294144947901014) >>> temperature_feb.samples(3) # Generate random samples [7.672102882379219, 12.000027119750287, 4.647488369766392]
sv: >>> temperatur_feb = NormalDist.from_samples([4, 12, -3, 2, 7, 14]) >>> temperatur_feb.medelvärde 6.0 >>> temperatur_feb.stdev 6.356099432828281 >>> temperature_feb.cdf(3) # Chans att vara under 3 grader 0.3184678262814532 >>> # Relativ chans att vara 7 grader jämfört med 10 grader >>> temperatur_feb.pdf(7) / temperatur_feb.pdf(10) 1.2039930378537762 >>> el_niño = NormalDist(4, 2,5) >>> temperature_feb += el_niño # Lägg till en klimateffekt >>> temperatur_feb NormalDist(mu=10.0, sigma=6.830080526611674) >>> temperatur_feb * (9/5) + 32 # Konvertera till Fahrenheit NormalDist(mu=50.0, sigma=12.294144947901014) >>> temperature_feb.samples(3) # Generera slumpmässiga urval [7.672102882379219, 12.000027119750287, 4.647488369766392]

source: Add new :func:`sys.unraisablehook` function which can be overridden to control how "unraisable exceptions" are handled. It is called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`). (Contributed by Victor Stinner in :issue:`36829`.)
sv: Lägg till ny :func:`sys.unraisablehook`-funktion som kan åsidosättas för att styra hur "unraisable exceptions" hanteras. Den anropas när ett undantag har inträffat men det inte finns något sätt för Python att hantera det. Till exempel när en destruktor gör ett undantag eller under skräpplockning (:func:`gc.collect`). (Bidrag från Victor Stinner i :issue:`36829`.)

source: The :mod:`tarfile` module now defaults to the modern pax (POSIX.1-2001) format for new archives, instead of the previous GNU-specific one. This improves cross-platform portability with a consistent encoding (UTF-8) in a standardized and extensible format, and offers several other benefits. (Contributed by C.A.M. Gerlach in :issue:`36268`.)
sv: Modulen :mod:`tarfile` använder nu som standard det moderna pax-formatet (POSIX.1-2001) för nya arkiv, i stället för det tidigare GNU-specifika formatet. Detta förbättrar portabiliteten mellan olika plattformar med en konsekvent kodning (UTF-8) i ett standardiserat och utbyggbart format, och ger flera andra fördelar. (Bidrag från C.A.M. Gerlach i :issue:`36268`.)

source: Add a new :func:`threading.excepthook` function which handles uncaught :meth:`threading.Thread.run` exception. It can be overridden to control how uncaught :meth:`threading.Thread.run` exceptions are handled. (Contributed by Victor Stinner in :issue:`1230540`.)
sv: Lägg till en ny :func:`threading.excepthook`-funktion som hanterar ej fångade :meth:`threading.Thread.run`-undantag. Den kan åsidosättas för att kontrollera hur ej fångade :meth:`threading.Thread.run`-undantag hanteras. (Bidrag från Victor Stinner i :issue:`1230540`.)

source: Add a new :func:`threading.get_native_id` function and a :data:`~threading.Thread.native_id` attribute to the :class:`threading.Thread` class. These return the native integral Thread ID of the current thread assigned by the kernel. This feature is only available on certain platforms, see :func:`get_native_id <threading.get_native_id>` for more information. (Contributed by Jake Tesler in :issue:`36084`.)
sv: Lägg till en ny :func:`threading.get_native_id`-funktion och ett :data:`~threading.Thread.native_id`-attribut till :class:`threading.Thread`-klassen. Dessa returnerar det inbyggda integrerade tråd-ID:t för den aktuella tråden som tilldelats av kärnan. Den här funktionen är endast tillgänglig på vissa plattformar, se :func:`get_native_id <threading.get_native_id>` för mer information. (Bidrag från Jake Tesler i :issue:`36084`.)

source: The :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
sv: Modulen :mod:`tokenize` emitterar nu implicit en ``NEWLINE``-token när den förses med indata som inte har en efterföljande ny rad. Detta beteende matchar nu vad C:s tokenizer gör internt. (Bidrag från Ammar Askar i :issue:`33899`.)

source: Added methods :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` and :meth:`~tkinter.Spinbox.selection_to` in the :class:`tkinter.Spinbox` class. (Contributed by Juliette Monsel in :issue:`34829`.)
sv: Lagt till metoderna :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` och :meth:`~tkinter.Spinbox.selection_to` i klassen :class:`tkinter.Spinbox`. (Bidrag från Juliette Monsel i :issue:`34829`.)

source: Added method :meth:`~tkinter.Canvas.moveto` in the :class:`tkinter.Canvas` class. (Contributed by Juliette Monsel in :issue:`23831`.)
sv: Lagt till metoden :meth:`~tkinter.Canvas.moveto` i klassen :class:`tkinter.Canvas`. (Bidrag från Juliette Monsel i :issue:`23831`.)

source: The :class:`tkinter.PhotoImage` class now has :meth:`~tkinter.PhotoImage.transparency_get` and :meth:`~tkinter.PhotoImage.transparency_set` methods. (Contributed by Zackery Spytz in :issue:`25451`.)
sv: Klassen :class:`tkinter.PhotoImage` har nu metoderna :meth:`~tkinter.PhotoImage.transparency_get` och :meth:`~tkinter.PhotoImage.transparency_set`. (Bidrag från Zackery Spytz i :issue:`25451`.)

source: Added new clock :const:`~time.CLOCK_UPTIME_RAW` for macOS 10.12. (Contributed by Joannah Nanjekye in :issue:`35702`.)
sv: Lagt till ny klocka :const:`~time.CLOCK_UPTIME_RAW` för macOS 10.12. (Bidrag från Joannah Nanjekye i :issue:`35702`.)

source: The :mod:`typing` module incorporates several new features:
sv: Modulen :mod:`typing` innehåller flera nya funktioner:

source: A dictionary type with per-key types. See :pep:`589` and :class:`typing.TypedDict`. TypedDict uses only string keys. By default, every key is required to be present. Specify "total=False" to allow keys to be optional::
sv: En ordbokstyp med typer per nyckel. Se :pep:`589` och :class:`typing.TypedDict`. TypedDict använder endast strängnycklar. Som standard måste alla nycklar vara närvarande. Ange "total=False" för att tillåta att nycklar är valfria:

source: class Location(TypedDict, total=False): lat_long: tuple grid_square: str xy_coordinate: tuple
sv: class Location(TypedDict, total=False): lat_long: tuple grid_square: str xy_koordinat: tuple

source: Literal types. See :pep:`586` and :class:`typing.Literal`. Literal types indicate that a parameter or return value is constrained to one or more specific literal values::
sv: Litterala typer. Se :pep:`586` och :class:`typing.Literal`. Literal-typer anger att en parameter eller ett returvärde är begränsat till ett eller flera specifika literal-värden::

source: "Final" variables, functions, methods and classes. See :pep:`591`, :class:`typing.Final` and :func:`typing.final`. The final qualifier instructs a static type checker to restrict subclassing, overriding, or reassignment::
sv: "Final"-variabler, -funktioner, -metoder och -klasser. Se :pep:`591`, :class:`typing.Final` och :func:`typing.final`. Kvalificeraren final instruerar en statisk typkontrollör att begränsa underklassning, överstyrning eller omtilldelning::

source: Protocol definitions. See :pep:`544`, :class:`typing.Protocol` and :func:`typing.runtime_checkable`. Simple ABCs like :class:`typing.SupportsInt` are now ``Protocol`` subclasses.
sv: Definitioner av protokoll. Se :pep:`544`, :class:`typing.Protocol` och :func:`typing.runtime_checkable`. Enkla ABC som :class:`typing.SupportsInt` är nu ``Protocol`` subklasser.

source: New protocol class :class:`typing.SupportsIndex`.
sv: Ny protokollklass :class:`typing.SupportsIndex`.

source: New functions :func:`typing.get_origin` and :func:`typing.get_args`.
sv: Nya funktioner :func:`typing.get_origin` och :func:`typing.get_args`.

source: The :mod:`unicodedata` module has been upgraded to use the `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_ release.
sv: Modulen :mod:`unicodedata` har uppgraderats för att använda utgåvan `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_.

source: New function :func:`~unicodedata.is_normalized` can be used to verify a string is in a specific normal form, often much faster than by actually normalizing the string. (Contributed by Max Belanger, David Euresti, and Greg Price in :issue:`32285` and :issue:`37966`).
sv: Den nya funktionen :func:`~unicodedata.is_normalized` kan användas för att verifiera att en sträng är i en viss normalform, ofta mycket snabbare än genom att faktiskt normalisera strängen. (Bidrag från Max Belanger, David Euresti och Greg Price i :issue:`32285` och :issue:`37966`).

source: Added :class:`~unittest.mock.AsyncMock` to support an asynchronous version of :class:`~unittest.mock.Mock`. Appropriate new assert functions for testing have been added as well. (Contributed by Lisa Roach in :issue:`26467`).
sv: Lagt till :class:`~unittest.mock.AsyncMock` för att stödja en asynkron version av :class:`~unittest.mock.Mock`. Lämpliga nya assert-funktioner för testning har också lagts till. (Bidrag från Lisa Roach i :issue:`26467`).

source: Added :func:`~unittest.addModuleCleanup` and :meth:`~unittest.TestCase.addClassCleanup` to unittest to support cleanups for :func:`~unittest.setUpModule` and :meth:`~unittest.TestCase.setUpClass`. (Contributed by Lisa Roach in :issue:`24412`.)
sv: Lagt till :func:`~unittest.addModuleCleanup` och :meth:`~unittest.TestCase.addClassCleanup` till unittest för att stödja upprensningar för :func:`~unittest.setUpModule` och :meth:`~unittest.TestCase.setUpClass`. (Bidrag från Lisa Roach i :issue:`24412`.)

source: Several mock assert functions now also print a list of actual calls upon failure. (Contributed by Petter Strandmark in :issue:`35047`.)
sv: Flera mock assert-funktioner skriver nu också ut en lista över faktiska anrop om de misslyckas. (Bidrag från Petter Strandmark i :issue:`35047`.)

source: :mod:`unittest` module gained support for coroutines to be used as test cases with :class:`unittest.IsolatedAsyncioTestCase`. (Contributed by Andrew Svetlov in :issue:`32972`.)
sv: :mod:`unittest`-modulen fick stöd för coroutines som kan användas som testfall med :class:`unittest.IsolatedAsyncioTestCase`. (Bidrag från Andrew Svetlov i :issue:`32972`.)

source: Example::
sv: Exempel::

source: :mod:`venv` now includes an ``Activate.ps1`` script on all platforms for activating virtual environments under PowerShell Core 6.1. (Contributed by Brett Cannon in :issue:`32718`.)
sv: :mod:`venv` innehåller nu ett ``Activate.ps1``-skript på alla plattformar för aktivering av virtuella miljöer under PowerShell Core 6.1. (Bidrag från Brett Cannon i :issue:`32718`.)

source: The proxy objects returned by :func:`weakref.proxy` now support the matrix multiplication operators ``@`` and ``@=`` in addition to the other numeric operators. (Contributed by Mark Dickinson in :issue:`36669`.)
sv: De proxyobjekt som returneras av :func:`weakref.proxy` har nu stöd för matrismultiplikationsoperatorerna ``@`` och ``@=`` utöver de andra numeriska operatorerna. (Bidrag från Mark Dickinson i :issue:`36669`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
sv: Som en åtgärd mot hämtning av DTD:er och externa entiteter bearbetar modulerna :mod:`xml.dom.minidom` och :mod:`xml.sax` inte längre externa entiteter som standard. (Bidrag från Christian Heimes i :issue:`17239`.)

source: The ``.find*()`` methods in the :mod:`xml.etree.ElementTree` module support wildcard searches like ``{*}tag`` which ignores the namespace and ``{namespace}*`` which returns all tags in the given namespace. (Contributed by Stefan Behnel in :issue:`28238`.)
sv: Metoderna ``.find*()`` i modulen :mod:`xml.etree.ElementTree` stöder sökningar med jokertecken som ``{*}tag`` som ignorerar namnrymden och ``{namespace}*`` som returnerar alla taggar i den angivna namnrymden. (Bidrag från Stefan Behnel i :issue:`28238`.)

source: The :mod:`xml.etree.ElementTree` module provides a new function :func:`–xml.etree.ElementTree.canonicalize` that implements C14N 2.0. (Contributed by Stefan Behnel in :issue:`13611`.)
sv: Modulen :mod:`xml.etree.ElementTree` tillhandahåller en ny funktion :func:`-xml.etree.ElementTree.canonicalize` som implementerar C14N 2.0. (Bidrag från Stefan Behnel i :issue:`13611`.)

source: The target object of :class:`xml.etree.ElementTree.XMLParser` can receive namespace declaration events through the new callback methods ``start_ns()`` and ``end_ns()``. Additionally, the :class:`xml.etree.ElementTree.TreeBuilder` target can be configured to process events about comments and processing instructions to include them in the generated tree. (Contributed by Stefan Behnel in :issue:`36676` and :issue:`36673`.)
sv: Målobjektet för :class:`xml.etree.ElementTree.XMLParser` kan ta emot namnrymdsdeklarationshändelser genom de nya callback-metoderna ``start_ns()`` och ``end_ns()``. Dessutom kan målet :class:`xml.etree.ElementTree.TreeBuilder` konfigureras för att bearbeta händelser om kommentarer och bearbetningsinstruktioner för att inkludera dem i det genererade trädet. (Bidrag från Stefan Behnel i :issue:`36676` och :issue:`36673`.)

source: :class:`xmlrpc.client.ServerProxy` now supports an optional *headers* keyword argument for a sequence of HTTP headers to be sent with each request. Among other things, this makes it possible to upgrade from default basic authentication to faster session authentication. (Contributed by Cédric Krier in :issue:`35153`.)
sv: :class:`xmlrpc.client.ServerProxy` stöder nu ett valfritt *headers* nyckelordsargument för en sekvens av HTTP-rubriker som ska skickas med varje förfrågan. Detta gör det bland annat möjligt att uppgradera från grundläggande autentisering till snabbare sessionsautentisering. (Bidrag från Cédric Krier i :issue:`35153`.)

source: Optimizations
sv: Optimeringar

source: The :mod:`subprocess` module can now use the :func:`os.posix_spawn` function in some cases for better performance. Currently, it is only used on macOS and Linux (using glibc 2.24 or newer) if all these conditions are met:
sv: Modulen :mod:`subprocess` kan nu använda funktionen :func:`os.posix_spawn` i vissa fall för bättre prestanda. För närvarande används den endast på macOS och Linux (med glibc 2.24 eller nyare) om alla dessa villkor är uppfyllda:

source: *close_fds* is false;
sv: *close_fds* är falsk;

source: *preexec_fn*, *pass_fds*, *cwd* and *start_new_session* parameters are not set;
sv: *parametrarna preexec_fn*, *pass_fds*, *cwd* och *start_new_session* är inte inställda;

source: the *executable* path contains a directory.
sv: den *exekverbara* sökvägen innehåller en katalog.

source: (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
sv: (Bidrag från Joannah Nanjekye och Victor Stinner i :issue:`35537`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls on Linux and macOS in order to copy the file more efficiently. "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``". On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 16 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used. The speedup for copying a 512 MiB file within the same partition is about +26% on Linux, +50% on macOS and +40% on Windows. Also, much less CPU cycles are consumed. See :ref:`shutil-platform-dependent-efficient-copy-operations` section. (Contributed by Giampaolo Rodolà in :issue:`33671`.)
sv: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` och :func:`shutil.move` använder plattformsspecifika "fast-copy" syscalls på Linux och macOS för att kopiera filen mer effektivt. "Fast-copy" innebär att kopieringsoperationen sker i kärnan, vilket undviker användning av userspace-buffertar i Python som i "``outfd.write(infd.read())``". På Windows använder :func:`shutil.copyfile` en större standardbuffertstorlek (1 MiB istället för 16 KiB) och en :func:`memoryview`-baserad variant av :func:`shutil.copyfileobj` används. Hastighetsökningen för att kopiera en 512 MiB-fil inom samma partition är ca +26% on Linux, +50% on macOS och +40% on Windows. Dessutom förbrukas mycket mindre CPU-cykler. Se :ref:`shutil-plattformsberoende-effektiva-kopieringsoperationer` avsnitt. (Bidrag från Giampaolo Rodolà i :issue:`33671`.)

source: :func:`shutil.copytree` uses :func:`os.scandir` function and all copy functions depending from it use cached :func:`os.stat` values. The speedup for copying a directory with 8000 files is around +9% on Linux, +20% on Windows and +30% on a Windows SMB share. Also the number of :func:`os.stat` syscalls is reduced by 38% making :func:`shutil.copytree` especially faster on network filesystems. (Contributed by Giampaolo Rodolà in :issue:`33695`.)
sv: :func:`shutil.copytree` använder :func:`os.scandir`-funktionen och alla kopieringsfunktioner som är beroende av den använder cachade :func:`os.stat`-värden. Hastighetsökningen för att kopiera en katalog med 8000 filer är cirka +9% on Linux, +20% on Windows och +30% on en Windows SMB-delning. Även antalet :func:`os.stat` syscalls minskas med 38% vilket gör :func:`shutil.copytree` särskilt snabbare på nätverksfilsystem. (Bidrag från Giampaolo Rodolà i :issue:`33695`.)

source: The default protocol in the :mod:`pickle` module is now Protocol 4, first introduced in Python 3.4. It offers better performance and smaller size compared to Protocol 3 available since Python 3.0.
sv: Standardprotokollet i modulen :mod:`pickle` är nu Protocol 4, som först introducerades i Python 3.4. Det erbjuder bättre prestanda och mindre storlek jämfört med Protocol 3 som funnits tillgängligt sedan Python 3.0.
