Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: What's New In Python 3.8
sv: Vad är nytt i Python 3.8

source: Editor
sv: Redigerare

source: This article explains the new features in Python 3.8, compared to 3.7. Python 3.8 was released on October 14, 2019. For full details, see the :ref:`changelog <changelog>`.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.8 jämfört med 3.7. Python 3.8 släpptes den 14 oktober 2019. För fullständig information, se :ref:`changelog <changelog>`.

source: Summary -- Release highlights
sv: Sammanfattning -- Release highlights

source: New Features
sv: Nya funktioner

source: Assignment expressions
sv: Uppdragets uttryck

source: There is new syntax ``:=`` that assigns values to variables as part of a larger expression. It is affectionately known as "the walrus operator" due to its resemblance to `the eyes and tusks of a walrus <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168).jpg>`_.
sv: Det finns en ny syntax ``:=`` som tilldelar värden till variabler som en del av ett större uttryck. Den är kärleksfullt känd som "valrossoperatorn" på grund av dess likhet med `ögon och betar hos en valross <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168).jpg>`_.

source: In this example, the assignment expression helps avoid calling :func:`len` twice::
sv: I det här exemplet hjälper assignment-uttrycket till att undvika att anropa :func:`len` två gånger::

source: if (n := len(a)) > 10: print(f"List is too long ({n} elements, expected <= 10)")
sv: if (n := len(a)) > 10: print(f"Listan är för lång ({n} element, förväntat <= 10)")

source: A similar benefit arises during regular expression matching where match objects are needed twice, once to test whether a match occurred and another to extract a subgroup::
sv: En liknande fördel uppstår vid matchning med reguljära uttryck där matchningsobjekt behövs två gånger, en gång för att testa om en matchning inträffade och en annan gång för att extrahera en undergrupp::

source: discount = 0.0 if (mo := re.search(r'(\d+)% discount', advertisement)): discount = float(mo.group(1)) / 100.0
sv: rabatt = 0,0 if (mo := re.search(r'(\d+)% discount', annons)): rabatt = float(mo.grupp(1)) / 100,0

source: The operator is also useful with while-loops that compute a value to test loop termination and then need that same value again in the body of the loop::
sv: Operatorn är också användbar med while-loopar som beräknar ett värde för att testa loopens avslutning och sedan behöver samma värde igen i loopens kropp::

source: # Loop over fixed length blocks while (block := f.read(256)) != '': process(block)
sv: # Loopa över block med fast längd while (block := f.read(256)) != '': process(block)

source: Another motivating use case arises in list comprehensions where a value computed in a filtering condition is also needed in the expression body::
sv: Ett annat motiverande användningsfall uppstår i listförståelser där ett värde som beräknats i ett filtreringsvillkor också behövs i uttryckskroppen::

source: [clean_name.title() for name in names if (clean_name := normalize('NFC', name)) in allowed_names]
sv: [clean_name.title() för namn i namn if (clean_name := normalize('NFC', name)) in tillåtna_namn]

source: Try to limit use of the walrus operator to clean cases that reduce complexity and improve readability.
sv: Försök att begränsa användningen av valrossoperatorn till rena fall som minskar komplexiteten och förbättrar läsbarheten.

source: See :pep:`572` for a full description.
sv: Se :pep:`572` för en fullständig beskrivning.

source: (Contributed by Emily Morehouse in :issue:`35224`.)
sv: (Bidrag från Emily Morehouse i :issue:`35224`.)

source: Positional-only parameters
sv: Parametrar som endast är positionsbestämda

source: There is a new function parameter syntax ``/`` to indicate that some function parameters must be specified positionally and cannot be used as keyword arguments. This is the same notation shown by ``help()`` for C functions annotated with Larry Hastings' `Argument Clinic <https://devguide.python.org/development-tools/clinic/>`__ tool.
sv: Det finns en ny syntax för funktionsparametrar ``/`` för att ange att vissa funktionsparametrar måste anges positionellt och inte kan användas som nyckelordsargument. Detta är samma notation som visas av ``help()`` för C-funktioner som är annoterade med Larry Hastings verktyg `Argument Clinic <https://devguide.python.org/development-tools/clinic/>`__.

source: In the following example, parameters *a* and *b* are positional-only, while *c* or *d* can be positional or keyword, and *e* or *f* are required to be keywords::
sv: I följande exempel är parametrarna *a* och *b* endast positionella, medan *c* eller *d* kan vara positionella eller nyckelord, och *e* eller *f* måste vara nyckelord::

source: The following is a valid call::
sv: Följande är ett giltigt anrop::

source: However, these are invalid calls::
sv: Dessa är dock ogiltiga samtal::

source: f(10, b=20, c=30, d=40, e=50, f=60) # b cannot be a keyword argument f(10, 20, 30, 40, 50, f=60) # e must be a keyword argument
sv: f(10, b=20, c=30, d=40, e=50, f=60) # b kan inte vara ett nyckelordsargument f(10, 20, 30, 40, 50, f=60) # e måste vara ett nyckelordsargument

source: One use case for this notation is that it allows pure Python functions to fully emulate behaviors of existing C coded functions. For example, the built-in :func:`divmod` function does not accept keyword arguments::
sv: Ett användningsområde för denna notation är att den gör det möjligt för rena Python-funktioner att helt emulera beteenden hos befintliga C-kodade funktioner. Till exempel accepterar den inbyggda :func:`divmod`-funktionen inte nyckelordsargument::

source: def divmod(a, b, /): "Emulate the built in divmod() function" return (a // b, a % b)
sv: def divmod(a, b, /): "Emulera den inbyggda divmod()-funktionen" return (a // b, a % b)

source: Another use case is to preclude keyword arguments when the parameter name is not helpful. For example, the builtin :func:`len` function has the signature ``len(obj, /)``. This precludes awkward calls such as::
sv: Ett annat användningsfall är att utesluta nyckelordsargument när parameternamnet inte är till hjälp. Till exempel har den inbyggda funktionen :func:`len` signaturen ``len(obj, /)``. Detta utesluter besvärliga anrop som::

source: len(obj='hello') # The "obj" keyword argument impairs readability
sv: len(obj='hello') # Nyckelordsargumentet "obj" försämrar läsbarheten

source: A further benefit of marking a parameter as positional-only is that it allows the parameter name to be changed in the future without risk of breaking client code. For example, in the :mod:`statistics` module, the parameter name *dist* may be changed in the future. This was made possible with the following function specification::
sv: En ytterligare fördel med att markera en parameter som endast positionell är att det gör det möjligt att ändra parameternamnet i framtiden utan att riskera att bryta klientkoden. I modulen :mod:`statistics` kan t.ex. parameternamnet *dist* ändras i framtiden. Detta möjliggjordes med följande funktionsspecifikation::

source: Since the parameters to the left of ``/`` are not exposed as possible keywords, the parameters names remain available for use in ``**kwargs``::
sv: Eftersom parametrarna till vänster om ``/`` inte exponeras som möjliga nyckelord, förblir parameternamnen tillgängliga för användning i ``**kwargs``::

source: >>> def f(a, b, /, **kwargs): ... print(a, b, kwargs) ... >>> f(10, 20, a=1, b=2, c=3) # a and b are used in two ways 10 20 {'a': 1, 'b': 2, 'c': 3}
sv: >>> def f(a, b, /, **kwargs): ... print(a, b, kwargs) ... >>> f(10, 20, a=1, b=2, c=3) # a och b används på två sätt 10 20 {'a': 1, 'b': 2, 'c': 3}

source: This greatly simplifies the implementation of functions and methods that need to accept arbitrary keyword arguments. For example, here is an excerpt from code in the :mod:`collections` module::
sv: Detta förenklar avsevärt implementeringen av funktioner och metoder som behöver acceptera godtyckliga nyckelordsargument. Här är till exempel ett utdrag ur koden i modulen :mod:`collections`::

source: class Counter(dict): def __init__(self, iterable=None, /, **kwds): # Note "iterable" is a possible keyword argument
sv: klass Räknare(dict): def __init__(self, iterable=None, /, **kwds): # Notera att "iterable" är ett möjligt nyckelordsargument

source: See :pep:`570` for a full description.
sv: Se :pep:`570` för en fullständig beskrivning.

source: (Contributed by Pablo Galindo in :issue:`36540`.)
sv: (Bidrag från Pablo Galindo i :issue:`36540`.)

source: Parallel filesystem cache for compiled bytecode files
sv: Parallell filsystemcache för kompilerade bytecode-filer

source: The new :envvar:`PYTHONPYCACHEPREFIX` setting (also available as :option:`-X` ``pycache_prefix``) configures the implicit bytecode cache to use a separate parallel filesystem tree, rather than the default ``__pycache__`` subdirectories within each source directory.
sv: Den nya inställningen :envvar:`PYTHONPYCACHEPREFIX` (även tillgänglig som :option:`-X` ``pycache_prefix``) konfigurerar den implicita bytecode-cachen att använda ett separat parallellt filsystemträd, i stället för standardunderkatalogerna ``__pycache__`` i varje källkatalog.

source: The location of the cache is reported in :data:`sys.pycache_prefix` (:const:`None` indicates the default location in ``__pycache__`` subdirectories).
sv: Cachens plats rapporteras i :data:`sys.pycache_prefix` (:const:`None` anger standardplatsen i underkatalogerna ``__pycache__``).

source: (Contributed by Carl Meyer in :issue:`33499`.)
sv: (Bidrag från Carl Meyer i :issue:`33499`.)

source: Debug build uses the same ABI as release build
sv: Debug build använder samma ABI som release build

source: Python now uses the same ABI whether it's built in release or debug mode. On Unix, when Python is built in debug mode, it is now possible to load C extensions built in release mode and C extensions built using the stable ABI.
sv: Python använder nu samma ABI oavsett om det byggs i release- eller debug-läge. På Unix, när Python byggs i felsökningsläge, är det nu möjligt att läsa in C-tillägg som byggts i release-läge och C-tillägg som byggts med det stabila ABI:t.

source: Release builds and :ref:`debug builds <debug-build>` are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro, which introduces the only ABI incompatibility. The ``Py_TRACE_REFS`` macro, which adds the :func:`sys.getobjects` function and the :envvar:`PYTHONDUMPREFS` environment variable, can be set using the new :option:`./configure --with-trace-refs <--with-trace-refs>` build option. (Contributed by Victor Stinner in :issue:`36465`.)
sv: Release builds och :ref:`debug builds <debug-build>` är nu ABI-kompatibla: att definiera makrot ``Py_DEBUG`` innebär inte längre makrot ``Py_TRACE_REFS``, vilket introducerar den enda ABI-inkompatibiliteten. Makrot ``Py_TRACE_REFS``, som lägger till funktionen :func:`sys.getobjects`` och miljövariabeln :envvar:`PYTHONDUMPREFS``, kan ställas in med det nya byggalternativet :option:`./configure --with-trace-refs <--with-trace-refs>`. (Bidrag från Victor Stinner i :issue:`36465`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. It is now possible for a statically linked Python to load a C extension built using a shared library Python. (Contributed by Victor Stinner in :issue:`21536`.)
sv: På Unix är C-tillägg inte längre länkade till libpython, förutom på Android och Cygwin. Det är nu möjligt för en statiskt länkad Python att läsa in ett C-tillägg som byggts med hjälp av ett delat Python-bibliotek. (Bidrag från Victor Stinner i :issue:`21536`.)

source: On Unix, when Python is built in debug mode, import now also looks for C extensions compiled in release mode and for C extensions compiled with the stable ABI. (Contributed by Victor Stinner in :issue:`36722`.)
sv: På Unix, när Python byggs i felsökningsläge, letar import nu även efter C-tillägg som kompilerats i release-läge och efter C-tillägg som kompilerats med det stabila ABI. (Bidrag från Victor Stinner i :issue:`36722`.)

source: To embed Python into an application, a new ``--embed`` option must be passed to ``python3-config --libs --embed`` to get ``-lpython3.8`` (link the application to libpython). To support both 3.8 and older, try ``python3-config --libs --embed`` first and fallback to ``python3-config --libs`` (without ``--embed``) if the previous command fails.
sv: För att bädda in Python i ett program måste ett nytt alternativ ``--embed`` skickas till ``python3-config --libs --embed`` för att få ``-lpython3.8`` (länka programmet till libpython). För att stödja både 3.8 och äldre, prova ``python3-config --libs --embed`` först och fallbacka till ``python3-config --libs`` (utan ``--embed``) om det föregående kommandot misslyckas.

source: Add a pkg-config ``python-3.8-embed`` module to embed Python into an application: ``pkg-config python-3.8-embed --libs`` includes ``-lpython3.8``. To support both 3.8 and older, try ``pkg-config python-X.Y-embed --libs`` first and fallback to ``pkg-config python-X.Y --libs`` (without ``--embed``) if the previous command fails (replace ``X.Y`` with the Python version).
sv: Lägg till en pkg-config-modul ``python-3.8-embed`` för att bädda in Python i ett program: ``pkg-config python-3.8-embed --libs`` inkluderar ``-lpython3.8``. För att stödja både 3.8 och äldre, prova ``pkg-config python-X.Y-embed --libs`` först och fallbacka till ``pkg-config python-X.Y --libs`` (utan ``--embed``) om det föregående kommandot misslyckas (ersätt ``X.Y`` med Python-versionen).

source: On the other hand, ``pkg-config python3.8 --libs`` no longer contains ``-lpython3.8``. C extensions must not be linked to libpython (except on Android and Cygwin, whose cases are handled by the script); this change is backward incompatible on purpose. (Contributed by Victor Stinner in :issue:`36721`.)
sv: Å andra sidan innehåller ``pkg-config python3.8 --libs`` inte längre ``-lpython3.8``. C-tillägg får inte länkas till libpython (utom på Android och Cygwin, vars fall hanteras av skriptet); denna ändring är avsiktligt bakåtkompatibel. (Bidrag från Victor Stinner i :issue:`36721`.)

source: f-strings support ``=`` for self-documenting expressions and debugging
sv: f-strings stödjer ``=`` för självdokumenterande uttryck och felsökning

source: Added an ``=`` specifier to :term:`f-string`\s. An f-string such as ``f'{expr=}'`` will expand to the text of the expression, an equal sign, then the representation of the evaluated expression. For example:
sv: Lade till en ``=`` specifikator till :term:`f-string`s. En f-sträng som ``f'{expr=}'`` kommer att expandera till uttryckets text, ett likhetstecken och sedan representationen av det utvärderade uttrycket. Ett exempel:

source: The usual :ref:`f-string format specifiers <f-strings>` allow more control over how the result of the expression is displayed::
sv: De vanliga :ref:`f-string-formatspecifikationerna <f-strings>` ger mer kontroll över hur resultatet av uttrycket visas::

source: >>> delta = date.today() - member_since >>> f'{user=!s} {delta.days=:,d}' 'user=eric_idle delta.days=16,075'
sv: >>> delta = date.today() - member_since >>> f'{user=!s} {delta.days=:,d}' 'användare=eric_idle delta.dagar=16.075'

source: The ``=`` specifier will display the whole expression so that calculations can be shown::
sv: Specificeraren ``=`` visar hela uttrycket så att beräkningar kan visas::

source: >>> print(f'{theta=} {cos(radians(theta))=:.3f}') theta=30 cos(radians(theta))=0.866
sv: >>> print(f'{theta=} {cos(radians(theta))=:.3f}') theta=30 cos(radianer(theta))=0,866

source: (Contributed by Eric V. Smith and Larry Hastings in :issue:`36817`.)
sv: (Bidrag från Eric V. Smith och Larry Hastings i :issue:`36817`.)

source: The PEP adds an Audit Hook and Verified Open Hook. Both are available from Python and native code, allowing applications and frameworks written in pure Python code to take advantage of extra notifications, while also allowing embedders or system administrators to deploy builds of Python where auditing is always enabled.
sv: PEP:n lägger till en Audit Hook och Verified Open Hook. Båda är tillgängliga från Python och inbyggd kod, vilket gör att applikationer och ramverk skrivna i ren Python-kod kan dra nytta av extra meddelanden, samtidigt som inbäddare eller systemadministratörer kan distribuera Python-byggnader där granskning alltid är aktiverad.

source: See :pep:`578` for full details.
sv: Se :pep:`578` för fullständig information.

source: PEP 587: Python Initialization Configuration
sv: PEP 587: Konfiguration av Python-initialisering

source: The :pep:`587` adds a new C API to configure the Python Initialization providing finer control on the whole configuration and better error reporting.
sv: :pep:`587` lägger till ett nytt C API för att konfigurera Python Initialization, vilket ger finare kontroll över hela konfigurationen och bättre felrapportering.

source: New structures:
sv: Nya strukturer:

source: :c:type:`PyConfig`
sv: :c:typ:`PyConfig`

source: :c:type:`PyPreConfig`
sv: :c:typ:`PyPreConfig`

source: :c:type:`PyStatus`
sv: :c:typ:`PyStatus`

source: :c:type:`PyWideStringList`
sv: :c:typ:`PyWideStringList`

source: New functions:
sv: Nya funktioner:

source: This PEP also adds ``_PyRuntimeState.preconfig`` (:c:type:`PyPreConfig` type) and ``PyInterpreterState.config`` (:c:type:`PyConfig` type) fields to these internal structures. ``PyInterpreterState.config`` becomes the new reference configuration, replacing global configuration variables and other private variables.
sv: Denna PEP lägger också till ``_PyRuntimeState.preconfig`` (:c:type:`PyPreConfig` type) och ``PyInterpreterState.config`` (:c:type:`PyConfig` type) fält till dessa interna strukturer. ``PyInterpreterState.config`` blir den nya referenskonfigurationen och ersätter globala konfigurationsvariabler och andra privata variabler.

source: See :ref:`Python Initialization Configuration <init-config>` for the documentation.
sv: Se :ref:`Python Initialization Configuration <init-config>` för dokumentation.

source: See :pep:`587` for a full description.
sv: Se :pep:`587` för en fullständig beskrivning.

source: (Contributed by Victor Stinner in :issue:`36763`.)
sv: (Bidrag från Victor Stinner i :issue:`36763`.)

source: PEP 590: Vectorcall: a fast calling protocol for CPython
sv: PEP 590: Vectorcall: ett snabbt anropsprotokoll för CPython

source: :ref:`vectorcall` is added to the Python/C API. It is meant to formalize existing optimizations which were already done for various classes. Any :ref:`static type <static-types>` implementing a callable can use this protocol.
sv: :ref:`vectorcall` har lagts till i Python/C API. Det är tänkt att formalisera befintliga optimeringar som redan gjorts för olika klasser. Alla :ref:`static type <static-types>` som implementerar en callable kan använda detta protokoll.

source: This is currently provisional. The aim is to make it fully public in Python 3.9.
sv: Detta är för närvarande provisoriskt. Målet är att göra det helt offentligt i Python 3.9.

source: See :pep:`590` for a full description.
sv: Se :pep:`590` för en fullständig beskrivning.

source: (Contributed by Jeroen Demeyer, Mark Shannon and Petr Viktorin in :issue:`36974`.)
sv: (Bidrag från Jeroen Demeyer, Mark Shannon och Petr Viktorin i :issue:`36974`.)

source: Pickle protocol 5 with out-of-band data buffers
sv: Pickle-protokoll 5 med buffertar för data utanför bandet

source: When :mod:`pickle` is used to transfer large data between Python processes in order to take advantage of multi-core or multi-machine processing, it is important to optimize the transfer by reducing memory copies, and possibly by applying custom techniques such as data-dependent compression.
sv: När :mod:`pickle` används för att överföra stora datamängder mellan Python-processer för att dra nytta av bearbetning med flera kärnor eller maskiner är det viktigt att optimera överföringen genom att minska antalet minneskopior och eventuellt tillämpa anpassade tekniker som databeroende komprimering.

source: The :mod:`pickle` protocol 5 introduces support for out-of-band buffers where :pep:`3118`-compatible data can be transmitted separately from the main pickle stream, at the discretion of the communication layer.
sv: Protokollet :mod:`pickle` 5 introducerar stöd för out-of-band buffertar där :pep:`3118`-kompatibla data kan överföras separat från huvudflödet av pickle, efter kommunikationslagrets gottfinnande.

source: See :pep:`574` for a full description.
sv: Se :pep:`574` för en fullständig beskrivning.

source: (Contributed by Antoine Pitrou in :issue:`36785`.)
sv: (Bidrag från Antoine Pitrou i :issue:`36785`.)

source: Other Language Changes
sv: Andra språkliga förändringar

source: A :keyword:`continue` statement was illegal in the :keyword:`finally` clause due to a problem with the implementation. In Python 3.8 this restriction was lifted. (Contributed by Serhiy Storchaka in :issue:`32489`.)
sv: En :keyword:`continue`-sats var olaglig i :keyword:`finally`-satsen på grund av ett problem med implementeringen. I Python 3.8 togs denna begränsning bort. (Bidrag från Serhiy Storchaka i :issue:`32489`.)

source: The :class:`bool`, :class:`int`, and :class:`fractions.Fraction` types now have an :meth:`~int.as_integer_ratio` method like that found in :class:`float` and :class:`decimal.Decimal`. This minor API extension makes it possible to write ``numerator, denominator = x.as_integer_ratio()`` and have it work across multiple numeric types. (Contributed by Lisa Roach in :issue:`33073` and Raymond Hettinger in :issue:`37819`.)
sv: Typerna :class:`bool`, :class:`int`, och :class:`fractions.Fraction` har nu en :meth:`~int.as_integer_ratio`-metod som den som finns i :class:`float` och :class:`decimal.Decimal`. Detta mindre API-tillägg gör det möjligt att skriva ``numerator, denominator = x.as_integer_ratio()`` och få det att fungera över flera numeriska typer. (Bidrag från Lisa Roach i :issue:`33073` och Raymond Hettinger i :issue:`37819`.)

source: Constructors of :class:`int`, :class:`float` and :class:`complex` will now use the :meth:`~object.__index__` special method, if available and the corresponding method :meth:`~object.__int__`, :meth:`~object.__float__` or :meth:`~object.__complex__` is not available. (Contributed by Serhiy Storchaka in :issue:`20092`.)
sv: Konstruktörer av :class:`int`, :class:`float` och :class:`complex` kommer nu att använda specialmetoden :meth:`~object.__index__`, om den är tillgänglig och motsvarande metod :meth:`~object.__int__`, :meth:`~object.__float__` eller :meth:`~object.__complex__` inte är tillgänglig. (Bidrag från Serhiy Storchaka i :issue:`20092`.)

source: Added support of :samp:`\\N\\{{name}\\}` escapes in :mod:`regular expressions <re>`::
sv: Lagt till stöd för :samp:`\\N\\{{name}\\}` escapes i :mod:`regular expressions <re>`::

source: >>> notice = 'Copyright © 2019' >>> copyright_year_pattern = re.compile(r'\N{copyright sign}\s*(\d{4})') >>> int(copyright_year_pattern.search(notice).group(1)) 2019
sv: >>> notice = 'Upphovsrätt © 2019' >>> copyright_year_pattern = re.compile(r'\N{copyright-sign}\s*(\d{4})') >>> int(copyright_year_pattern.search(notice).group(1)) 2019

source: (Contributed by Jonathan Eunice and Serhiy Storchaka in :issue:`30688`.)
sv: (Bidrag från Jonathan Eunice och Serhiy Storchaka i :issue:`30688`.)

source: Dict and dictviews are now iterable in reversed insertion order using :func:`reversed`. (Contributed by Rémi Lapeyre in :issue:`33462`.)
sv: Dict och dictviews är nu itererbara i omvänd inmatningsordning med :func:`reversed`. (Bidrag från Rémi Lapeyre i :issue:`33462`.)
