Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: Removed one :c:type:`Py_ssize_t` member from ``PyGC_Head``. All GC tracked objects (e.g. tuple, list, dict) size is reduced 4 or 8 bytes. (Contributed by Inada Naoki in :issue:`33597`.)
sv: Tog bort en :c:type:`Py_ssize_t`-medlem från ``PyGC_Head``. Alla GC-spårade objekt (t.ex. tuple, list, dict) minskas med 4 eller 8 byte. (Bidrag från Inada Naoki i :issue:`33597`.)

source: :class:`uuid.UUID` now uses ``__slots__`` to reduce its memory footprint. (Contributed by Wouter Bolsterlee and Tal Einat in :issue:`30977`)
sv: :class:`uuid.UUID` använder nu ``__slots__`` för att minska sitt minnesavtryck. (Bidrag från Wouter Bolsterlee och Tal Einat i :issue:`30977`)

source: Improved performance of :func:`operator.itemgetter` by 33%. Optimized argument handling and added a fast path for the common case of a single non-negative integer index into a tuple (which is the typical use case in the standard library). (Contributed by Raymond Hettinger in :issue:`35664`.)
sv: Förbättrad prestanda för :func:`operator.itemgetter` med 33%. Optimerad argumenthantering och en snabb väg har lagts till för det vanliga fallet med ett enda icke-negativt heltalsindex i en tupel (vilket är det typiska användningsfallet i standardbiblioteket). (Bidrag från Raymond Hettinger i :issue:`35664`.)

source: Sped-up field lookups in :func:`collections.namedtuple`. They are now more than two times faster, making them the fastest form of instance variable lookup in Python. (Contributed by Raymond Hettinger, Pablo Galindo, and Joe Jevnik, Serhiy Storchaka in :issue:`32492`.)
sv: Snabbare fältuppslagningar i :func:`collections.namedtuple`. De är nu mer än två gånger snabbare, vilket gör dem till den snabbaste formen av instansvariabeluppslagning i Python. (Bidrag från Raymond Hettinger, Pablo Galindo, och Joe Jevnik, Serhiy Storchaka i :issue:`32492`.)

source: The :class:`list` constructor does not overallocate the internal item buffer if the input iterable has a known length (the input implements ``__len__``). This makes the created list 12% smaller on average. (Contributed by Raymond Hettinger and Pablo Galindo in :issue:`33234`.)
sv: Konstruktorn :class:`list` overallokerar inte den interna objektbufferten om den ingående iterabeln har en känd längd (den ingående implementerar ``__len__``). Detta gör den skapade listan 12% smaller i genomsnitt. (Bidrag från Raymond Hettinger och Pablo Galindo i :issue:`33234`.)

source: Doubled the speed of class variable writes. When a non-dunder attribute was updated, there was an unnecessary call to update slots. (Contributed by Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer, and Serhiy Storchaka in :issue:`36012`.)
sv: Fördubblade hastigheten för skrivningar av klassvariabler. När ett icke-dunder-attribut uppdaterades fanns det ett onödigt anrop till update slots. (Bidrag från Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer, och Serhiy Storchaka i :issue:`36012`.)

source: Reduced an overhead of converting arguments passed to many builtin functions and methods. This sped up calling some simple builtin functions and methods up to 20--50%. (Contributed by Serhiy Storchaka in :issue:`23867`, :issue:`35582` and :issue:`36127`.)
sv: Minskade omkostnaderna för att konvertera argument som skickas till många inbyggda funktioner och metoder. Detta påskyndade anrop av vissa enkla inbyggda funktioner och metoder upp till 20--50%. (Bidrag från Serhiy Storchaka i :issue:`23867`, :issue:`35582` och :issue:`36127`.)

source: ``LOAD_GLOBAL`` instruction now uses new "per opcode cache" mechanism. It is about 40% faster now. (Contributed by Yury Selivanov and Inada Naoki in :issue:`26219`.)
sv: ``LOAD_GLOBAL`` instruktionen använder nu den nya "per opcode cache" mekanismen. Den är ungefär 40% faster nu. (Bidrag från Yury Selivanov och Inada Naoki i :issue:`26219`.)

source: Build and C API Changes
sv: Ändringar i Build och C API

source: Default :data:`sys.abiflags` became an empty string: the ``m`` flag for pymalloc became useless (builds with and without pymalloc are ABI compatible) and so has been removed. (Contributed by Victor Stinner in :issue:`36707`.)
sv: Standard :data:`sys.abiflags` blev en tom sträng: flaggan ``m`` för pymalloc blev värdelös (byggen med och utan pymalloc är ABI-kompatibla) och har därför tagits bort. (Bidrag från Victor Stinner i :issue:`36707`.)

source: Example of changes:
sv: Exempel på förändringar:

source: Only ``python3.8`` program is installed, ``python3.8m`` program is gone.
sv: Endast programmet ``python3.8`` är installerat, programmet ``python3.8m`` är borta.

source: Only ``python3.8-config`` script is installed, ``python3.8m-config`` script is gone.
sv: Endast skriptet ``python3.8-config`` är installerat, skriptet ``python3.8m-config`` är borta.

source: The ``m`` flag has been removed from the suffix of dynamic library filenames: extension modules in the standard library as well as those produced and installed by third-party packages, like those downloaded from PyPI. On Linux, for example, the Python 3.7 suffix ``.cpython-37m-x86_64-linux-gnu.so`` became ``.cpython-38-x86_64-linux-gnu.so`` in Python 3.8.
sv: Flaggan ``m`` har tagits bort från suffixet för dynamiska biblioteksfilnamn: tilläggsmoduler i standardbiblioteket samt de som produceras och installeras av tredjepartspaket, som de som hämtas från PyPI. På Linux, till exempel, blev Python 3.7-suffixet ``.cpython-37m-x86_64-linux-gnu.so`` ``.cpython-38-x86_64-linux-gnu.so`` i Python 3.8.

source: The header files have been reorganized to better separate the different kinds of APIs:
sv: Huvudfilerna har omorganiserats för att bättre separera de olika typerna av API:er:

source: ``Include/*.h`` should be the portable public stable C API.
sv: ``Include/*.h`` bör vara det portabla offentliga stabila C API.

source: ``Include/cpython/*.h`` should be the unstable C API specific to CPython; public API, with some private API prefixed by ``_Py`` or ``_PY``.
sv: ``Include/cpython/*.h`` bör vara det instabila C API som är specifikt för CPython; offentligt API, med vissa privata API som föregås av ``_Py`` eller ``_PY``.

source: ``Include/internal/*.h`` is the private internal C API very specific to CPython. This API comes with no backward compatibility warranty and should not be used outside CPython. It is only exposed for very specific needs like debuggers and profiles which has to access to CPython internals without calling functions. This API is now installed by ``make install``.
sv: ``Include/internal/*.h`` är det privata interna C API:et som är mycket specifikt för CPython. Detta API kommer med ingen garanti för bakåtkompatibilitet och bör inte användas utanför CPython. Det är endast exponerat för mycket specifika behov som debuggers och profiler som måste komma åt CPython-interna utan att anropa funktioner. Detta API installeras nu av ``make install``.

source: (Contributed by Victor Stinner in :issue:`35134` and :issue:`35081`, work initiated by Eric Snow in Python 3.7.)
sv: (Bidrag från Victor Stinner i :issue:`35134` och :issue:`35081`, arbete påbörjat av Eric Snow i Python 3.7.)

source: Some macros have been converted to static inline functions: parameter types and return type are well defined, they don't have issues specific to macros, variables have a local scopes. Examples:
sv: Vissa makron har konverterats till statiska inline-funktioner: parametertyper och returtyp är väldefinierade, de har inte problem som är specifika för makron, variabler har lokala räckvidder. Exempel på detta:

source: Private functions: :c:func:`!_PyObject_GC_TRACK`, :c:func:`!_PyObject_GC_UNTRACK`, :c:func:`!_Py_Dealloc`
sv: Privata funktioner: :c:func:`!_PyObject_GC_TRACK`, :c:func:`!_PyObject_GC_UNTRACK`, :c:func:`!_Py_Dealloc`

source: (Contributed by Victor Stinner in :issue:`35059`.)
sv: (Bidrag från Victor Stinner i :issue:`35059`.)

source: The :c:func:`!PyByteArray_Init` and :c:func:`!PyByteArray_Fini` functions have been removed. They did nothing since Python 2.7.4 and Python 3.2.0, were excluded from the limited API (stable ABI), and were not documented. (Contributed by Victor Stinner in :issue:`35713`.)
sv: Funktionerna :c:func:`!PyByteArray_Init` och :c:func:`!PyByteArray_Fini` har tagits bort. De gjorde ingenting sedan Python 2.7.4 och Python 3.2.0, var uteslutna från det begränsade API:et (stabilt ABI) och var inte dokumenterade. (Bidrag från Victor Stinner i :issue:`35713`.)

source: The result of :c:func:`PyExceptionClass_Name` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`33818`.)
sv: Resultatet av :c:func:`PyExceptionClass_Name` är nu av typen ``const char *`` istället för ``char *``. (Bidrag från Serhiy Storchaka i :issue:`33818`.)

source: The duality of ``Modules/Setup.dist`` and ``Modules/Setup`` has been removed. Previously, when updating the CPython source tree, one had to manually copy ``Modules/Setup.dist`` (inside the source tree) to ``Modules/Setup`` (inside the build tree) in order to reflect any changes upstream. This was of a small benefit to packagers at the expense of a frequent annoyance to developers following CPython development, as forgetting to copy the file could produce build failures.
sv: Dubbelheten mellan ``Modules/Setup.dist`` och ``Modules/Setup`` har tagits bort. Tidigare, när man uppdaterade CPythons källträd, var man tvungen att manuellt kopiera ``Modules/Setup.dist`` (i källträdet) till ``Modules/Setup`` (i byggträdet) för att återspegla eventuella ändringar uppströms. Detta var en liten fördel för paketerare på bekostnad av ett ofta förekommande irritationsmoment för utvecklare som följde CPython-utvecklingen, eftersom om man glömde att kopiera filen kunde det leda till byggfel.

source: Now the build system always reads from ``Modules/Setup`` inside the source tree. People who want to customize that file are encouraged to maintain their changes in a git fork of CPython or as patch files, as they would do for any other change to the source tree.
sv: Nu läser byggsystemet alltid från ``Modules/Setup`` inuti källträdet. Personer som vill anpassa den filen uppmuntras att underhålla sina ändringar i en git-fork av CPython eller som patch-filer, som de skulle göra för alla andra ändringar i källträdet.

source: (Contributed by Antoine Pitrou in :issue:`32430`.)
sv: (Bidrag från Antoine Pitrou i :issue:`32430`.)

source: Functions that convert Python number to C integer like :c:func:`PyLong_AsLong` and argument parsing functions like :c:func:`PyArg_ParseTuple` with integer converting format units like ``'i'`` will now use the :meth:`~object.__index__` special method instead of :meth:`~object.__int__`, if available. The deprecation warning will be emitted for objects with the ``__int__()`` method but without the ``__index__()`` method (like :class:`~decimal.Decimal` and :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` will now return ``1`` for objects implementing ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` and :c:func:`PyFloat_AsDouble` also now use the ``__index__()`` method if available. (Contributed by Serhiy Storchaka in :issue:`36048` and :issue:`20092`.)
sv: Funktioner som konverterar Pythontal till C-integral som :c:func:`PyLong_AsLong` och argumentparsingfunktioner som :c:func:`PyArg_ParseTuple` med heltalskonverteringsformatenheter som ``'i'`` kommer nu att använda specialmetoden :meth:`~object.__index__` istället för :meth:`~object.__int__`, om tillgänglig. Deprecation-varningen kommer att utfärdas för objekt med metoden ``__int__()`` men utan metoden ``__index__()`` (som :class:`~decimal.Decimal` och :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` kommer nu att returnera ``1`` för objekt som implementerar ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` och :c:func:`PyFloat_AsDouble` använder nu också metoden ``__index__()`` om den är tillgänglig. (Bidrag från Serhiy Storchaka i :issue:`36048` och :issue:`20092`.)

source: Heap-allocated type objects will now increase their reference count in :c:func:`PyObject_Init` (and its parallel macro ``PyObject_INIT``) instead of in :c:func:`PyType_GenericAlloc`. Types that modify instance allocation or deallocation may need to be adjusted. (Contributed by Eddie Elizondo in :issue:`35810`.)
sv: Heap-allokerade typobjekt kommer nu att öka sitt referensantal i :c:func:`PyObject_Init` (och dess parallella makro ``PyObject_INIT``) istället för i :c:func:`PyType_GenericAlloc`. Typer som modifierar instansallokering eller -deallokering kan behöva justeras. (Bidrag från Eddie Elizondo i :issue:`35810`.)

source: The new function :c:func:`!PyCode_NewWithPosOnlyArgs` allows to create code objects like :c:func:`!PyCode_New`, but with an extra *posonlyargcount* parameter for indicating the number of positional-only arguments. (Contributed by Pablo Galindo in :issue:`37221`.)
sv: Den nya funktionen :c:func:`!PyCode_NewWithPosOnlyArgs` gör det möjligt att skapa kodobjekt som :c:func:`!PyCode_New`, men med en extra *posonlyargcount* parameter för att ange antalet enbart positionella argument. (Bidrag från Pablo Galindo i :issue:`37221`.)

source: :c:func:`!Py_SetPath` now sets :data:`sys.executable` to the program full path (:c:func:`Py_GetProgramFullPath`) rather than to the program name (:c:func:`Py_GetProgramName`). (Contributed by Victor Stinner in :issue:`38234`.)
sv: :c:func:`!Py_SetPath` sätter nu :data:`sys.executable` till programmets fullständiga sökväg (:c:func:`Py_GetProgramFullPath`) istället för till programnamnet (:c:func:`Py_GetProgramName`). (Bidrag från Victor Stinner i :issue:`38234`.)

source: Deprecated
sv: Föråldrat

source: The distutils ``bdist_wininst`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Victor Stinner in :issue:`37481`.)
sv: Kommandot distutils ``bdist_wininst`` är nu föråldrat, använd ``bdist_wheel`` (wheel-paket) istället. (Bidrag från Victor Stinner i :issue:`37481`.)

source: Deprecated methods ``getchildren()`` and ``getiterator()`` in the :mod:`~xml.etree.ElementTree` module now emit a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`. They will be removed in Python 3.9. (Contributed by Serhiy Storchaka in :issue:`29209`.)
sv: De föråldrade metoderna ``getchildren()`` och ``getiterator()`` i modulen :mod:`~xml.etree.ElementTree` avger nu en :exc:`DeprecationWarning` istället för :exc:`PendingDeprecationWarning`. De kommer att tas bort i Python 3.9. (Bidrag från Serhiy Storchaka i :issue:`29209`.)

source: Passing an object that is not an instance of :class:`concurrent.futures.ThreadPoolExecutor` to :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` is deprecated and will be prohibited in Python 3.9. (Contributed by Elvis Pranskevichus in :issue:`34075`.)
sv: Att skicka ett objekt som inte är en instans av :class:`concurrent.futures.ThreadPoolExecutor` till :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` är föråldrat och kommer att förbjudas i Python 3.9. (Bidrag från Elvis Pranskevichus i :issue:`34075`.)

source: The :meth:`~object.__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput` have been deprecated.
sv: Metoderna :meth:`~object.__getitem__` för :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` och :class:`fileinput.FileInput` har utgått.

source: Implementations of these methods have been ignoring their *index* parameter, and returning the next item instead. (Contributed by Berker Peksag in :issue:`9372`.)
sv: Implementeringar av dessa metoder har ignorerat deras *index*-parameter och returnerat nästa objekt istället. (Bidrag från Berker Peksag i :issue:`9372`.)

source: The :class:`typing.NamedTuple` class has deprecated the ``_field_types`` attribute in favor of the ``__annotations__`` attribute which has the same information. (Contributed by Raymond Hettinger in :issue:`36320`.)
sv: Klassen :class:`typing.NamedTuple` har tagit bort attributet ``_field_types`` till förmån för attributet ``__annotations__`` som innehåller samma information. (Bidrag från Raymond Hettinger i :issue:`36320`.)

source: :mod:`ast` classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` are considered deprecated and will be removed in future Python versions. :class:`~ast.Constant` should be used instead. (Contributed by Serhiy Storchaka in :issue:`32892`.)
sv: :mod:`ast`-klasserna ``Num``, ``Str``, ``Bytes``, ``NameConstant`` och ``Ellipsis`` anses vara föråldrade och kommer att tas bort i framtida Python-versioner. :class:`~ast.Constant` bör användas istället. (Bidrag från Serhiy Storchaka i :issue:`32892`.)

source: :class:`ast.NodeVisitor` methods ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` and ``visit_Ellipsis()`` are deprecated now and will not be called in future Python versions. Add the :meth:`~ast.NodeVisitor.visit_Constant` method to handle all constant nodes. (Contributed by Serhiy Storchaka in :issue:`36917`.)
sv: :class:`ast.NodeVisitor` metoderna ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` och ``visit_Ellipsis()`` är nu avförda och kommer inte att anropas i framtida Python-versioner. Lägg till metoden :meth:`~ast.NodeVisitor.visit_Constant` för att hantera alla konstanta noder. (Bidrag från Serhiy Storchaka i :issue:`36917`.)

source: The :func:`asyncio.coroutine` :term:`decorator` is deprecated and will be removed in version 3.10. Instead of ``@asyncio.coroutine``, use :keyword:`async def` instead. (Contributed by Andrew Svetlov in :issue:`36921`.)
sv: :func:`asyncio.coroutine` :term:`decorator` är föråldrad och kommer att tas bort i version 3.10. Istället för ``@asyncio.coroutine``, använd :keyword:`async def` istället. (Bidrag från Andrew Svetlov i :issue:`36921`.)

source: In :mod:`asyncio`, the explicit passing of a *loop* argument has been deprecated and will be removed in version 3.10 for the following: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, and :func:`asyncio.create_subprocess_shell`.
sv: I :mod:`asyncio` har det uttryckliga passandet av ett *loop*-argument föråldrats och kommer att tas bort i version 3.10 för följande: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, och :func:`asyncio.create_subprocess_shell`.

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov in :issue:`34790`.)
sv: Den explicita överföringen av coroutine-objekt till :func:`asyncio.wait` har föråldrats och kommer att tas bort i version 3.11. (Bidrag från Yury Selivanov i :issue:`34790`.)

source: The following functions and methods are deprecated in the :mod:`gettext` module: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` and :func:`~gettext.ldngettext`. They return encoded bytes, and it's possible that you will get unexpected Unicode-related exceptions if there are encoding problems with the translated strings. It's much better to use alternatives which return Unicode strings in Python 3. These functions have been broken for a long time.
sv: Följande funktioner och metoder är föråldrade i modulen :mod:`gettext`: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` och :func:`~gettext.ldngettext`. De returnerar kodade byte och det är möjligt att du får oväntade Unicode-relaterade undantag om det finns kodningsproblem med de översatta strängarna. Det är mycket bättre att använda alternativ som returnerar Unicode-strängar i Python 3. Dessa funktioner har varit trasiga under en lång tid.

source: Function :func:`~gettext.bind_textdomain_codeset`, methods :meth:`~gettext.NullTranslations.output_charset` and :meth:`~gettext.NullTranslations.set_output_charset`, and the *codeset* parameter of functions :func:`~gettext.translation` and :func:`~gettext.install` are also deprecated, since they are only used for the ``l*gettext()`` functions. (Contributed by Serhiy Storchaka in :issue:`33710`.)
sv: Funktionen :func:`~gettext.bind_textdomain_codeset`, metoderna :meth:`~gettext.NullTranslations.output_charset` och :meth:`~gettext.NullTranslations.set_output_charset`, och parametern *codeset* i funktionerna :func:`~gettext.translation` och :func:`~gettext.install` är också utfasade, eftersom de bara används för funktionerna ``l*gettext()``. (Bidrag från Serhiy Storchaka i :issue:`33710`.)

source: The :meth:`~threading.Thread.isAlive` method of :class:`threading.Thread` has been deprecated. (Contributed by Donghee Na in :issue:`35283`.)
sv: Metoden :meth:`~threading.Thread.isAlive` för :class:`threading.Thread` har utgått. (Bidrag från Donghee Na i :issue:`35283`.)

source: Many builtin and extension functions that take integer arguments will now emit a deprecation warning for :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and any other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). In future version they will be errors. (Contributed by Serhiy Storchaka in :issue:`36048`.)
sv: Många inbyggda funktioner och tilläggsfunktioner som tar heltalsargument kommer nu att avge en varning om föråldring för :class:`~decimal.Decimal`` s, :class:`~fractions.Fraction`` s och alla andra objekt som kan konverteras till heltal endast med förlust (t.ex. som har :meth:`~object.__int__`-metoden men inte har :meth:`~object.__index__`-metoden). I framtida versioner kommer de att vara fel. (Bidrag från Serhiy Storchaka i :issue:`36048`.)

source: Deprecated passing the following arguments as keyword arguments:
sv: Föråldrat att skicka följande argument som nyckelordsargument:

source: *func* in :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` and :func:`curses.wrapper`.
sv: *func* i :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` och :func:`curses.wrapper`.

source: *function* in :meth:`unittest.TestCase.addCleanup`.
sv: *function* i :meth:`unittest.TestCase.addCleanup`.

source: *fn* in the :meth:`~concurrent.futures.Executor.submit` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor`.
sv: *fn* i metoden :meth:`~concurrent.futures.Executor.submit` i :class:`concurrent.futures.ThreadPoolExecutor` och :class:`concurrent.futures.ProcessPoolExecutor`.

source: *callback* in :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` and :meth:`contextlib.AsyncExitStack.push_async_callback`.
sv: *callback* i :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` och :meth:`contextlib.AsyncExitStack.push_async_callback`.
