Repository: yeager/python-docs-sv
Catalog: whatsnew/3.8.po
Languages: sv

source: *c* and *typeid* in the :meth:`~multiprocessing.managers.Server.create` method of :class:`multiprocessing.managers.Server` and :class:`multiprocessing.managers.SharedMemoryServer`.
sv: *c* och *typeid* i metoden :meth:`~multiprocessing.managers.Server.create` i :class:`multiprocessing.managers.Server` och :class:`multiprocessing.managers.SharedMemoryServer`.

source: *obj* in :func:`weakref.finalize`.
sv: *obj* i :func:`weakref.finalize`.

source: In future releases of Python, they will be :ref:`positional-only <positional-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`36492`.)
sv: I framtida utgåvor av Python kommer de att vara :ref:``positional-only <positional-only_parameter>`. (Bidrag från Serhiy Storchaka i :issue:`36492`.)

source: API and Feature Removals
sv: Borttagning av API och funktioner

source: The following features and APIs have been removed from Python 3.8:
sv: Följande funktioner och API:er har tagits bort från Python 3.8:

source: Starting with Python 3.3, importing ABCs from :mod:`collections` was deprecated, and importing should be done from :mod:`collections.abc`. Being able to import from collections was marked for removal in 3.8, but has been delayed to 3.9. (See :gh:`81134`.)
sv: Från och med Python 3.3 är import av ABC från :mod:`collections` föråldrad, och import ska göras från :mod:`collections.abc`. Att kunna importera från samlingar var markerat för borttagning i 3.8, men har försenats till 3.9. (Se :gh:`81134`.)

source: The :mod:`macpath` module, deprecated in Python 3.7, has been removed. (Contributed by Victor Stinner in :issue:`35471`.)
sv: Modulen :mod:`macpath`, som är föråldrad i Python 3.7, har tagits bort. (Bidrag från Victor Stinner i :issue:`35471`.)

source: The function :func:`platform.popen` has been removed, after having been deprecated since Python 3.3: use :func:`os.popen` instead. (Contributed by Victor Stinner in :issue:`35345`.)
sv: Funktionen :func:`platform.popen` har tagits bort, efter att ha varit föråldrad sedan Python 3.3: använd :func:`os.popen` istället. (Bidrag från Victor Stinner i :issue:`35345`.)

source: The function :func:`time.clock` has been removed, after having been deprecated since Python 3.3: use :func:`time.perf_counter` or :func:`time.process_time` instead, depending on your requirements, to have well-defined behavior. (Contributed by Matthias Bussonnier in :issue:`36895`.)
sv: Funktionen :func:`time.clock` har tagits bort, efter att ha varit föråldrad sedan Python 3.3: använd :func:`time.perf_counter` eller :func:`time.process_time` istället, beroende på dina krav, för att få ett väldefinierat beteende. (Bidrag från Matthias Bussonnier i :issue:`36895`.)

source: The ``pyvenv`` script has been removed in favor of ``python3.8 -m venv`` to help eliminate confusion as to what Python interpreter the ``pyvenv`` script is tied to. (Contributed by Brett Cannon in :issue:`25427`.)
sv: Skriptet ``pyvenv`` har tagits bort till förmån för ``python3.8 -m venv`` för att hjälpa till att eliminera förvirring om vilken Python-tolk skriptet ``pyvenv`` är knutet till. (Bidrag från Brett Cannon i :issue:`25427`.)

source: ``parse_qs``, ``parse_qsl``, and ``escape`` are removed from the :mod:`!cgi` module. They are deprecated in Python 3.2 or older. They should be imported from the ``urllib.parse`` and ``html`` modules instead.
sv: ``parse_qs``, ``parse_qsl`` och ``escape`` har tagits bort från modulen :mod:`!cgi`. De är föråldrade i Python 3.2 eller äldre. De bör importeras från modulerna ``urllib.parse`` och ``html`` istället.

source: ``filemode`` function is removed from the :mod:`tarfile` module. It is not documented and deprecated since Python 3.3.
sv: ``filemode`` funktionen är borttagen från :mod:`tarfile` modulen. Den är inte dokumenterad och föråldrad sedan Python 3.3.

source: The :class:`~xml.etree.ElementTree.XMLParser` constructor no longer accepts the *html* argument. It never had an effect and was deprecated in Python 3.4. All other parameters are now :ref:`keyword-only <keyword-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
sv: Konstruktorn :class:`~xml.etree.ElementTree.XMLParser` accepterar inte längre argumentet *html*. Det hade aldrig någon effekt och utrangerades i Python 3.4. Alla andra parametrar är nu :ref:`keyword-only <keyword-only_parameter>`. (Bidrag från Serhiy Storchaka i :issue:`29209`.)

source: Removed the ``doctype()`` method of :class:`~xml.etree.ElementTree.XMLParser`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
sv: Tog bort metoden ``doctype()`` i :class:`~xml.etree.ElementTree.XMLParser`. (Bidrag från Serhiy Storchaka i :issue:`29209`.)

source: "unicode_internal" codec is removed. (Contributed by Inada Naoki in :issue:`36297`.)
sv: "unicode_internal" codec är borttagen. (Bidrag från Inada Naoki i :issue:`36297`.)

source: The ``Cache`` and ``Statement`` objects of the :mod:`sqlite3` module are not exposed to the user. (Contributed by Aviv Palivoda in :issue:`30262`.)
sv: Objekten ``Cache`` och ``Statement`` i modulen :mod:`sqlite3` är inte exponerade för användaren. (Bidrag från Aviv Palivoda i :issue:`30262`.)

source: The ``bufsize`` keyword argument of :func:`fileinput.input` and :func:`fileinput.FileInput` which was ignored and deprecated since Python 3.6 has been removed. :issue:`36952` (Contributed by Matthias Bussonnier.)
sv: Nyckelordsargumentet ``bufsize`` i :func:`fileinput.input` och :func:`fileinput.FileInput` som ignorerades och var föråldrat sedan Python 3.6 har tagits bort. :issue:`36952`` (Bidrag från Matthias Bussonnier.)

source: The functions :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper` deprecated in Python 3.7 have been removed; :issue:`36933` (Contributed by Matthias Bussonnier.)
sv: Funktionerna :func:`sys.set_coroutine_wrapper` och :func:`sys.get_coroutine_wrapper` som är föråldrade i Python 3.7 har tagits bort; :issue:`36933` (Bidrag från Matthias Bussonnier.)

source: Porting to Python 3.8
sv: Portning till Python 3.8

source: This section lists previously described changes and other bugfixes that may require changes to your code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Changes in Python behavior
sv: Förändringar i Pythons beteende

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now disallowed in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). (Contributed by Serhiy Storchaka in :issue:`10544`.)
sv: Yield-uttryck (både ``yield`` och ``yield from``-klausuler) är nu inte tillåtna i förståelser och generatoruttryck (förutom det iterabla uttrycket i :keyword:`!for`-klausulen längst till vänster). (Bidrag från Serhiy Storchaka i :issue:`10544`.)

source: The compiler now produces a :exc:`SyntaxWarning` when identity checks (``is`` and ``is not``) are used with certain types of literals (e.g. strings, numbers). These can often work by accident in CPython, but are not guaranteed by the language spec. The warning advises users to use equality tests (``==`` and ``!=``) instead. (Contributed by Serhiy Storchaka in :issue:`34850`.)
sv: Kompilatorn producerar nu en :exc:`SyntaxWarning` när identitetskontroller (``is`` och ``is not``) används med vissa typer av literaler (t.ex. strängar, tal). Dessa kan ofta fungera av misstag i CPython, men garanteras inte av språkspecifikationen. Varningen råder användare att använda likhetstester (``==`` och ``!=``) istället. (Bidrag från Serhiy Storchaka i :issue:`34850`.)

source: The CPython interpreter can swallow exceptions in some circumstances. In Python 3.8 this happens in fewer cases. In particular, exceptions raised when getting the attribute from the type dictionary are no longer ignored. (Contributed by Serhiy Storchaka in :issue:`35459`.)
sv: CPython-tolken kan svälja undantag under vissa omständigheter. I Python 3.8 händer detta i färre fall. I synnerhet ignoreras inte längre undantag som uppstår när attributet hämtas från typordboken. (Bidrag från Serhiy Storchaka i :issue:`35459`.)

source: Removed ``__str__`` implementations from builtin types :class:`bool`, :class:`int`, :class:`float`, :class:`complex` and few classes from the standard library. They now inherit ``__str__()`` from :class:`object`. As result, defining the ``__repr__()`` method in the subclass of these classes will affect their string representation. (Contributed by Serhiy Storchaka in :issue:`36793`.)
sv: Tog bort ``__str__`` implementationer från inbyggda typer :class:`bool`, :class:`int`, :class:`float`, :class:`complex` och några klasser från standardbiblioteket. De ärver nu ``__str__()`` från :class:`object`. Som ett resultat kommer definitionen av metoden ``__repr__()`` i underklassen av dessa klasser att påverka deras strängrepresentation. (Bidrag från Serhiy Storchaka i :issue:`36793`.)

source: On AIX, :data:`sys.platform` doesn't contain the major version anymore. It is always ``'aix'``, instead of ``'aix3'`` .. ``'aix7'``. Since older Python versions include the version number, so it is recommended to always use ``sys.platform.startswith('aix')``. (Contributed by M. Felt in :issue:`36588`.)
sv: På AIX innehåller :data:`sys.platform` inte längre huvudversionen. Den är alltid ``'aix'``, istället för ``'aix3'`` ... ``'aix7'``. Eftersom äldre Python-versioner innehåller versionsnumret, så rekommenderas det att alltid använda ``sys.platform.startswith('aix')``. (Bidrag från M. Felt i :issue:`36588`.)

source: :c:func:`!PyEval_AcquireLock` and :c:func:`!PyEval_AcquireThread` now terminate the current thread if called while the interpreter is finalizing, making them consistent with :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS`, and :c:func:`PyGILState_Ensure`. If this behavior is not desired, guard the call by checking :c:func:`!_Py_IsFinalizing` or :func:`sys.is_finalizing`. (Contributed by Joannah Nanjekye in :issue:`36475`.)
sv: :c:func:`!PyEval_AcquireLock` och :c:func:`!PyEval_AcquireThread` avslutar nu den aktuella tråden om de anropas medan tolken håller på att slutföras, vilket gör dem konsekventa med :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS` och :c:func:`PyGILState_Ensure`. Om detta beteende inte är önskvärt, bevaka anropet genom att kontrollera :c:func:`!_Py_IsFinalizing` eller :func:`sys.is_finalizing`. (Bidrag från Joannah Nanjekye i :issue:`36475`.)

source: Changes in the Python API
sv: Ändringar i Python API

source: The :func:`os.getcwdb` function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows. (Contributed by Victor Stinner in :issue:`37412`.)
sv: Funktionen :func:`os.getcwdb` använder nu UTF-8-kodning i Windows, snarare än ANSI-kodsidan: se :pep:`529` för motivering. Funktionen är inte längre föråldrad i Windows. (Bidrag från Victor Stinner i :issue:`37412`.)

source: :class:`subprocess.Popen` can now use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, the :class:`Popen` constructor using :func:`os.posix_spawn` no longer raises an exception on errors like "missing program". Instead the child process fails with a non-zero :attr:`~Popen.returncode`. (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
sv: :class:`subprocess.Popen` kan nu använda :func:`os.posix_spawn` i vissa fall för bättre prestanda. I Windows Subsystem for Linux och QEMU User Emulation ger konstruktorn :class:`Popen` som använder :func:`os.posix_spawn` inte längre upphov till ett undantag vid fel som "missing program". Istället misslyckas barnprocessen med en :attr:`~Popen.returncode` som inte är noll. (Bidrag från Joannah Nanjekye och Victor Stinner i :issue:`35537`.)

source: The *preexec_fn* argument of * :class:`subprocess.Popen` is no longer compatible with subinterpreters. The use of the parameter in a subinterpreter now raises :exc:`RuntimeError`. (Contributed by Eric Snow in :issue:`34651`, modified by Christian Heimes in :issue:`37951`.)
sv: Argumentet *preexec_fn* i * :class:`subprocess.Popen` är inte längre kompatibelt med undertolkare. Användningen av parametern i en undertolk ger nu upphov till :exc:`RuntimeError`. (Bidrag från Eric Snow i :issue:`34651`, modifierat av Christian Heimes i :issue:`37951`.)

source: The :meth:`imap.IMAP4.logout` method no longer silently ignores arbitrary exceptions. (Contributed by Victor Stinner in :issue:`36348`.)
sv: Metoden :meth:`imap.IMAP4.logout` ignorerar inte längre godtyckliga undantag. (Bidrag från Victor Stinner i :issue:`36348`.)

source: The :func:`statistics.mode` function no longer raises an exception when given multimodal data. Instead, it returns the first mode encountered in the input data. (Contributed by Raymond Hettinger in :issue:`35892`.)
sv: Funktionen :func:`statistics.mode` ger inte längre upphov till ett undantag när den får multimodala data. Istället returnerar den det första läget som påträffas i indata. (Bidrag från Raymond Hettinger i :issue:`35892`.)

source: The :meth:`~tkinter.ttk.Treeview.selection` method of the :class:`tkinter.ttk.Treeview` class no longer takes arguments. Using it with arguments for changing the selection was deprecated in Python 3.6. Use specialized methods like :meth:`~tkinter.ttk.Treeview.selection_set` for changing the selection. (Contributed by Serhiy Storchaka in :issue:`31508`.)
sv: Metoden :meth:`~tkinter.ttk.Treeview.selection` i klassen :class:`tkinter.ttk.Treeview` tar inte längre emot argument. Att använda den med argument för att ändra urvalet var föråldrat i Python 3.6. Använd specialiserade metoder som :meth:`~tkinter.ttk.Treeview.selection_set` för att ändra urvalet. (Bidrag från Serhiy Storchaka i :issue:`31508`.)

source: The :meth:`writexml`, :meth:`toxml` and :meth:`toprettyxml` methods of :mod:`xml.dom.minidom`, and the :meth:`write` method of :mod:`xml.etree`, now preserve the attribute order specified by the user. (Contributed by Diego Rojas and Raymond Hettinger in :issue:`34160`.)
sv: Metoderna :meth:`writexml`, :meth:`toxml` och :meth:`toprettyxml` i :mod:`xml.dom.minidom`, och metoden :meth:`write` i :mod:`xml.etree`, bevarar nu den attributordning som anges av användaren. (Bidrag från Diego Rojas och Raymond Hettinger i :issue:`34160`.)

source: A :mod:`dbm.dumb` database opened with flags ``'r'`` is now read-only. :func:`dbm.dumb.open` with flags ``'r'`` and ``'w'`` no longer creates a database if it does not exist. (Contributed by Serhiy Storchaka in :issue:`32749`.)
sv: En :mod:`dbm.dumb` databas som öppnats med flaggorna ``'r'`` är nu skrivskyddad. :func:`dbm.dumb.open` med flaggorna ``'r'`` och ``'w'`` skapar inte längre en databas om den inte existerar. (Bidrag från Serhiy Storchaka i :issue:`32749`.)

source: The ``doctype()`` method defined in a subclass of :class:`~xml.etree.ElementTree.XMLParser` will no longer be called and will emit a :exc:`RuntimeWarning` instead of a :exc:`DeprecationWarning`. Define the :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` method on a target for handling an XML doctype declaration. (Contributed by Serhiy Storchaka in :issue:`29209`.)
sv: Metoden ``doctype()`` som definieras i en underklass till :class:`~xml.etree.ElementTree.XMLParser` kommer inte längre att anropas och avger en :exc:`RuntimeWarning` istället för en :exc:`DeprecationWarning`. Definiera metoden :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` på ett mål för hantering av en XML-doktypdeklaration. (Bidrag från Serhiy Storchaka i :issue:`29209`.)

source: A :exc:`RuntimeError` is now raised when the custom metaclass doesn't provide the ``__classcell__`` entry in the namespace passed to ``type.__new__``. A :exc:`DeprecationWarning` was emitted in Python 3.6--3.7. (Contributed by Serhiy Storchaka in :issue:`23722`.)
sv: Ett :exc:`RuntimeError` utlöses nu när den anpassade metaklassen inte tillhandahåller ``__classcell__``-objektet i namnrymden som skickas till ``type.__new__``. En :exc:`DeprecationWarning` gavs ut i Python 3.6--3.7. (Bidrag från Serhiy Storchaka i :issue:`23722`.)

source: The :class:`cProfile.Profile` class can now be used as a context manager. (Contributed by Scott Sanderson in :issue:`29235`.)
sv: Klassen :class:`cProfile.Profile` kan nu användas som en kontexthanterare. (Bidrag från Scott Sanderson i :issue:`29235`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls (see :ref:`shutil-platform-dependent-efficient-copy-operations` section).
sv: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` och :func:`shutil.move` använder plattformsspecifika "fast-copy" syscalls (se avsnittet :ref:`shutil-platform-dependent-efficient-copy-operations`).

source: :func:`shutil.copyfile` default buffer size on Windows was changed from 16 KiB to 1 MiB.
sv: :func:`shutil.copyfile` standardbuffertstorlek i Windows ändrades från 16 KiB till 1 MiB.

source: The ``PyGC_Head`` struct has changed completely. All code that touched the struct member should be rewritten. (See :issue:`33597`.)
sv: Strukturen ``PyGC_Head`` har ändrats helt. All kod som berör struct-medlemmen bör skrivas om. (Se :issue:`33597`.)

source: The :c:type:`PyInterpreterState` struct has been moved into the "internal" header files (specifically Include/internal/pycore_pystate.h). An opaque ``PyInterpreterState`` is still available as part of the public API (and stable ABI). The docs indicate that none of the struct's fields are public, so we hope no one has been using them. However, if you do rely on one or more of those private fields and have no alternative then please open a BPO issue. We'll work on helping you adjust (possibly including adding accessor functions to the public API). (See :issue:`35886`.)
sv: Strukturen :c:type:`PyInterpreterState` har flyttats till de "interna" header-filerna (särskilt Include/internal/pycore_pystate.h). En opak ``PyInterpreterState`` är fortfarande tillgänglig som en del av det offentliga API:et (och stabila ABI). Dokumentationen indikerar att inga av strukturens fält är offentliga, så vi hoppas att ingen har använt dem. Men om du förlitar dig på ett eller flera av dessa privata fält och inte har något alternativ, vänligen öppna en BPO-fråga. Vi ska försöka hjälpa dig att anpassa dig (eventuellt genom att lägga till accessorfunktioner till det publika API:et). (Se :issue:`35886`.)

source: The :meth:`mmap.flush() <mmap.mmap.flush>` method now returns ``None`` on success and raises an exception on error under all platforms. Previously, its behavior was platform-dependent: a nonzero value was returned on success; zero was returned on error under Windows. A zero value was returned on success; an exception was raised on error under Unix. (Contributed by Berker Peksag in :issue:`2122`.)
sv: Metoden :meth:`mmap.flush() <mmap.mmap.flush>` returnerar nu ``None`` vid framgång och ger upphov till ett undantag vid fel under alla plattformar. Tidigare var dess beteende plattformsberoende: ett värde som inte var noll returnerades vid framgång; noll returnerades vid fel under Windows. Ett nollvärde returnerades vid framgång; ett undantag utlöstes vid fel under Unix. (Bidrag från Berker Peksag i :issue:`2122`.)

source: :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
sv: modulerna :mod:`xml.dom.minidom` och :mod:`xml.sax` bearbetar inte längre externa enheter som standard. (Bidrag från Christian Heimes i :issue:`17239`.)

source: Deleting a key from a read-only :mod:`dbm` database (:mod:`dbm.dumb`, :mod:`dbm.gnu` or :mod:`dbm.ndbm`) raises :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` or :exc:`dbm.ndbm.error`) instead of :exc:`KeyError`. (Contributed by Xiang Zhang in :issue:`33106`.)
sv: Om en nyckel raderas från en skrivskyddad :mod:`dbm`-databas (:mod:`dbm.dumb`, :mod:`dbm.gnu` eller :mod:`dbm.ndbm`) uppstår :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` eller :exc:`dbm.ndbm.error`) istället för :exc:`KeyError`. (Bidrag från Xiang Zhang i :issue:`33106`.)

source: Simplified AST for literals. All constants will be represented as :class:`ast.Constant` instances. Instantiating old classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` will return an instance of ``Constant``. (Contributed by Serhiy Storchaka in :issue:`32892`.)
sv: Förenklad AST för literaler. Alla konstanter kommer att representeras som :class:`ast.Constant`-instanser. Instansiering av gamla klasser ``Num``, ``Str``, ``Bytes``, ``NameConstant`` och ``Ellipsis`` kommer att returnera en instans av ``Constant``. (Bidrag från Serhiy Storchaka i :issue:`32892`.)

source: The function :func:`asyncio.wait_for` now correctly waits for cancellation when using an instance of :class:`asyncio.Task`. Previously, upon reaching *timeout*, it was cancelled and immediately returned. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
sv: Funktionen :func:`asyncio.wait_for` väntar nu korrekt på avbrytande när den använder en instans av :class:`asyncio.Task`. Tidigare, när *timeout* nåddes, avbröts funktionen och returnerades omedelbart. (Bidrag från Elvis Pranskevichus i :issue:`32751`.)

source: The function :func:`asyncio.BaseTransport.get_extra_info` now returns a safe to use socket object when 'socket' is passed to the *name* parameter. (Contributed by Yury Selivanov in :issue:`37027`.)
sv: Funktionen :func:`asyncio.BaseTransport.get_extra_info` returnerar nu ett socket-objekt som är säkert att använda när 'socket' skickas till parametern *name*. (Bidrag från Yury Selivanov i :issue:`37027`.)

source: :class:`asyncio.BufferedProtocol` has graduated to the stable API.
sv: :class:`asyncio.BufferedProtocol` har gått över till det stabila API:et.

source: DLL dependencies for extension modules and DLLs loaded with :mod:`ctypes` on Windows are now resolved more securely. Only the system paths, the directory containing the DLL or PYD file, and directories added with :func:`~os.add_dll_directory` are searched for load-time dependencies. Specifically, :envvar:`PATH` and the current working directory are no longer used, and modifications to these will no longer have any effect on normal DLL resolution. If your application relies on these mechanisms, you should check for :func:`~os.add_dll_directory` and if it exists, use it to add your DLLs directory while loading your library. Note that Windows 7 users will need to ensure that Windows Update KB2533623 has been installed (this is also verified by the installer). (Contributed by Steve Dower in :issue:`36085`.)
sv: DLL-beroenden för tilläggsmoduler och DLL:er som laddas med :mod:`ctypes` i Windows löses nu på ett säkrare sätt. Endast systemsökvägarna, katalogen som innehåller DLL- eller PYD-filen och kataloger som lagts till med :func:`~os.add_dll_directory` genomsöks efter beroenden vid laddningstillfället. Specifikt används inte längre :envvar:`PATH` och den aktuella arbetskatalogen, och ändringar av dessa kommer inte längre att ha någon effekt på normal DLL-upplösning. Om ditt program är beroende av dessa mekanismer bör du söka efter :func:`~os.add_dll_directory` och om den finns, använda den för att lägga till DLL-katalogen när du laddar ditt bibliotek. Observera att Windows 7-användare måste se till att Windows Update KB2533623 har installerats (detta verifieras också av installationsprogrammet). (Bidrag från Steve Dower i :issue:`36085`.)
