Repository: yeager/python-docs-sv
Catalog: whatsnew/3.9.po
Languages: sv

source: On AIX, :func:`~time.thread_time` is now implemented with ``thread_cputime()`` which has nanosecond resolution, rather than ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` which has a resolution of 10 milliseconds. (Contributed by Batuhan Taskaya in :issue:`40192`)
sv: På AIX implementeras nu :func:`~time.thread_time` med ``thread_cputime()`` som har en upplösning på nanosekunder, istället för ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` som har en upplösning på 10 millisekunder. (Bidrag från Batuhan Taskaya i :issue:`40192`)

source: sys
sv: system

source: Added a new :data:`sys.platlibdir` attribute: name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules. It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
sv: Lade till ett nytt :data:`sys.platlibdir`-attribut: namnet på den plattformsspecifika bibliotekskatalogen. Den används för att bygga sökvägen till standardbiblioteket och sökvägarna till installerade tilläggsmoduler. Det är lika med ``"lib"`` på de flesta plattformar. På Fedora och SuSE är det lika med ``"lib64"`` på 64-bitars plattformar. (Bidrag från Jan Matějek, Matěj Cepl, Charalampos Stratakis och Victor Stinner i :issue:`1294959`.)

source: Previously, :data:`sys.stderr` was block-buffered when non-interactive. Now ``stderr`` defaults to always being line-buffered. (Contributed by Jendrik Seipp in :issue:`13601`.)
sv: Tidigare var :data:`sys.stderr` blockbuffrad när den inte var interaktiv. Nu är ``stderr`` standardinställning att alltid vara linje-buffrad. (Bidrag från Jendrik Seipp i :issue:`13601`.)

source: Added :func:`tracemalloc.reset_peak` to set the peak size of traced memory blocks to the current size, to measure the peak of specific pieces of code. (Contributed by Huon Wilson in :issue:`40630`.)
sv: Lagt till :func:`tracemalloc.reset_peak` för att ställa in toppstorleken för spårade minnesblock till den aktuella storleken, för att mäta toppen för specifika bitar av kod. (Bidrag från Huon Wilson i :issue:`40630`.)

source: typing
sv: maskinskrivning

source: :pep:`593` introduced an :data:`typing.Annotated` type to decorate existing types with context-specific metadata and new ``include_extras`` parameter to :func:`typing.get_type_hints` to access the metadata at runtime. (Contributed by Till Varoquaux and Konstantin Kashin.)
sv: :pep:`593` introducerade en :data:`typing.Annotated`-typ för att dekorera befintliga typer med kontextspecifika metadata och en ny ``include_extras``-parameter till :func:`typing.get_type_hints` för att komma åt metadata vid körning. (Bidrag från Till Varoquaux och Konstantin Kashin.)

source: The Unicode database has been updated to version 13.0.0. (:issue:`39926`).
sv: Unicode-databasen har uppdaterats till version 13.0.0. (:issue:`39926`).

source: venv
sv: ven

source: The activation scripts provided by :mod:`venv` now all specify their prompt customization consistently by always using the value specified by ``__VENV_PROMPT__``. Previously some scripts unconditionally used ``__VENV_PROMPT__``, others only if it happened to be set (which was the default case), and one used ``__VENV_NAME__`` instead. (Contributed by Brett Cannon in :issue:`37663`.)
sv: De aktiveringsskript som tillhandahålls av :mod:`venv` anger nu alla sin promptanpassning konsekvent genom att alltid använda det värde som anges av ``__VENV_PROMPT__``. Tidigare använde vissa skript ovillkorligen ``__VENV_PROMPT__``, andra bara om det råkade vara inställt (vilket var standardfallet) och ett skript använde ``__VENV_NAME__`` istället. (Bidrag från Brett Cannon i :issue:`37663`.)

source: White space characters within attributes are now preserved when serializing :mod:`xml.etree.ElementTree` to XML file. EOLNs are no longer normalized to "\n". This is the result of discussion about how to interpret section 2.11 of XML spec. (Contributed by Mefistotelis in :issue:`39011`.)
sv: Vita tecken inom attribut bevaras nu vid serialisering av :mod:`xml.etree.ElementTree` till XML-fil. EOLNs normaliseras inte längre till "\n". Detta är resultatet av en diskussion om hur man ska tolka avsnitt 2.11 i XML-specifikationen. (Bidrag från Mefistotelis i :issue:`39011`.)

source: Optimizations
sv: Optimeringar

source: Optimized the idiom for assignment a temporary variable in comprehensions. Now ``for y in [expr]`` in comprehensions is as fast as a simple assignment ``y = expr``. For example:
sv: Optimerat idiomet för tilldelning av en temporär variabel i förståelser. Nu är ``for y in [expr]`` i förståelser lika snabbt som en enkel tilldelning ``y = expr``. Till exempel:

source: sums = [s for s in [0] for x in data for s in [s + x]]
sv: summor = [s för s i [0] för x i data för s i [s + x]]

source: Unlike the ``:=`` operator this idiom does not leak a variable to the outer scope.
sv: Till skillnad från operatorn ``:=`` läcker detta idiom inte en variabel till det yttre omfånget.

source: (Contributed by Serhiy Storchaka in :issue:`32856`.)
sv: (Bidrag från Serhiy Storchaka i :issue:`32856`.)

source: Optimized signal handling in multithreaded applications. If a thread different than the main thread gets a signal, the bytecode evaluation loop is no longer interrupted at each bytecode instruction to check for pending signals which cannot be handled. Only the main thread of the main interpreter can handle signals.
sv: Optimerad signalhantering i flertrådade program. Om en annan tråd än huvudtråden får en signal, avbryts inte längre bytecode-utvärderingsloopen vid varje bytecode-instruktion för att kontrollera om det finns väntande signaler som inte kan hanteras. Endast huvudtråden i huvudtolken kan hantera signaler.

source: Previously, the bytecode evaluation loop was interrupted at each instruction until the main thread handles signals. (Contributed by Victor Stinner in :issue:`40010`.)
sv: Tidigare avbröts bytecode-utvärderingsslingan vid varje instruktion tills huvudtråden hanterade signaler. (Bidrag från Victor Stinner i :issue:`40010`.)

source: Optimized the :mod:`subprocess` module on FreeBSD using ``closefrom()``. (Contributed by Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak and Victor Stinner in :issue:`38061`.)
sv: Optimerade modulen :mod:`subprocess` på FreeBSD med hjälp av ``closefrom()``. (Bidrag från Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak och Victor Stinner i :issue:`38061`.)

source: :c:func:`PyLong_FromDouble` is now up to 1.87x faster for values that fit into :c:expr:`long`. (Contributed by Sergey Fedoseev in :issue:`37986`.)
sv: :c:func:`PyLong_FromDouble` är nu upp till 1,87 gånger snabbare för värden som passar in i :c:expr:`long`. (Bidrag från Sergey Fedoseev i :issue:`37986`.)

source: A number of Python builtins (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) are now sped up by using :pep:`590` vectorcall protocol. (Contributed by Donghee Na, Mark Shannon, Jeroen Demeyer and Petr Viktorin in :issue:`37207`.)
sv: Ett antal Python-inbyggnader (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) snabbas nu upp genom att använda :pep:`590` vectorcall-protokollet. (Bidrag från Donghee Na, Mark Shannon, Jeroen Demeyer och Petr Viktorin i :issue:`37207`.)

source: Optimized :meth:`!set.difference_update` for the case when the other set is much larger than the base set. (Suggested by Evgeny Kapun with code contributed by Michele Orrù in :issue:`8425`.)
sv: Optimerade :meth:`!set.difference_update` för fallet när den andra uppsättningen är mycket större än basuppsättningen. (Föreslagen av Evgeny Kapun med kod från Michele Orrù i :issue:`8425`.)

source: Python's small object allocator (``obmalloc.c``) now allows (no more than) one empty arena to remain available for immediate reuse, without returning it to the OS. This prevents thrashing in simple loops where an arena could be created and destroyed anew on each iteration. (Contributed by Tim Peters in :issue:`37257`.)
sv: Pythons allokator för små objekt (``obmalloc.c``) tillåter nu (högst) en tom arena att förbli tillgänglig för omedelbar återanvändning, utan att återlämna den till operativsystemet. Detta förhindrar thrashing i enkla loopar där en arena skulle kunna skapas och förstöras på nytt vid varje iteration. (Bidrag från Tim Peters i :issue:`37257`.)

source: :term:`floor division` of float operation now has a better performance. Also the message of :exc:`ZeroDivisionError` for this operation is updated. (Contributed by Donghee Na in :issue:`39434`.)
sv: :term:`floor division` of float operation har nu bättre prestanda. Även meddelandet för :exc:`ZeroDivisionError` för denna operation har uppdaterats. (Bidrag från Donghee Na i :issue:`39434`.)

source: Decoding short ASCII strings with UTF-8 and ascii codecs is now about 15% faster. (Contributed by Inada Naoki in :issue:`37348`.)
sv: Avkodning av korta ASCII-strängar med UTF-8 och ascii-codecs är nu ca 15% faster. (Bidrag från Inada Naoki i :issue:`37348`.)

source: Here's a summary of performance improvements from Python 3.4 through Python 3.9:
sv: Här är en sammanfattning av prestandaförbättringar från Python 3.4 till Python 3.9:

source: Python version 3.4 3.5 3.6 3.7 3.8 3.9 -------------- --- --- --- --- --- --- Variable and attribute read access: read_local 7.1 7.1 5.4 5.1 3.9 3.9 read_nonlocal 7.1 8.1 5.8 5.4 4.4 4.5 read_global 15.5 19.0 14.3 13.6 7.6 7.8 read_builtin 21.1 21.6 18.5 19.0 7.5 7.8 read_classvar_from_class 25.6 26.5 20.7 19.5 18.4 17.9 read_classvar_from_instance 22.8 23.5 18.8 17.1 16.4 16.9 read_instancevar 32.4 33.1 28.0 26.3 25.4 25.3 read_instancevar_slots 27.8 31.3 20.8 20.8 20.2 20.5 read_namedtuple 73.8 57.5 45.0 46.8 18.4 18.7 read_boundmethod 37.6 37.9 29.6 26.9 27.7 41.1 Variable and attribute write access: write_local 8.7 9.3 5.5 5.3 4.3 4.3 write_nonlocal 10.5 11.1 5.6 5.5 4.7 4.8 write_global 19.7 21.2 18.0 18.0 15.8 16.7 write_classvar 92.9 96.0 104.6 102.1 39.2 39.8 write_instancevar 44.6 45.8 40.0 38.9 35.5 37.4 write_instancevar_slots 35.6 36.1 27.3 26.6 25.7 25.8 Data structure read access: read_list 24.2 24.5 20.8 20.8 19.0 19.5 read_deque 24.7 25.5 20.2 20.6 19.8 20.2 read_dict 24.3 25.7 22.3 23.0 21.0 22.4 read_strdict 22.6 24.3 19.5 21.2 18.9 21.5 Data structure write access: write_list 27.1 28.5 22.5 21.6 20.0 20.0 write_deque 28.7 30.1 22.7 21.8 23.5 21.7 write_dict 31.4 33.3 29.3 29.2 24.7 25.4 write_strdict 28.4 29.9 27.5 25.2 23.1 24.5 Stack (or queue) operations: list_append_pop 93.4 112.7 75.4 74.2 50.8 50.6 deque_append_pop 43.5 57.0 49.4 49.2 42.5 44.2 deque_append_popleft 43.7 57.3 49.7 49.7 42.8 46.4 Timing loop: loop_overhead 0.5 0.6 0.4 0.3 0.3 0.3
sv: Python version 3,4 3,5 3,6 3,7 3,8 3,9 -------------- --- --- --- --- --- --- Läsåtkomst för variabler och attribut: read_local 7,1 7,1 5,4 5,1 3,9 3,9 read_nonlocal 7,1 8,1 5,8 5,4 4,4 4,5 läs_global 15,5 19,0 14,3 13,6 7,6 7,8 read_builtin 21,1 21,6 18,5 19,0 7,5 7,8 läs_klassvar_från_klass 25,6 26,5 20,7 19,5 18,4 17,9 read_classvar_from_instance 22,8 23,5 18,8 17,1 16,4 16,9 read_instancevar 32,4 33,1 28,0 26,3 25,4 25,3 read_instancevar_slots 27,8 31,3 20,8 20,8 20,2 20,5 read_namedtuple 73,8 57,5 45,0 46,8 18,4 18,7 read_boundmethod 37,6 37,9 29,6 26,9 27,7 41,1 Skrivåtkomst för variabler och attribut: write_local 8,7 9,3 5,5 5,3 4,3 4,3 4,3 write_nonlocal 10,5 11,1 5,6 5,5 4,7 4,8 write_global 19,7 21,2 18,0 18,0 15,8 16,7 write_classvar 92,9 96,0 104,6 102,1 39,2 39,8 write_instancevar 44,6 45,8 40,0 38,9 35,5 37,4 write_instancevar_slots 35,6 36,1 27,3 26,6 25,7 25,8 Läsåtkomst för datastruktur: read_list 24,2 24,5 20,8 20,8 19,0 19,5 read_deque 24,7 25,5 20,2 20,6 19,8 20,2 read_dict 24,3 25,7 22,3 23,0 21,0 22,4 read_strdict 22,6 24,3 19,5 21,2 18,9 21,5 Skrivåtkomst för datastruktur: write_list 27,1 28,5 22,5 21,6 20,0 20,0 write_deque 28,7 30,1 22,7 21,8 23,5 21,7 write_dict 31,4 33,3 29,3 29,2 24,7 25,4 write_strdict 28,4 29,9 27,5 25,2 23,1 24,5 Stapel- (eller kö-) operationer: list_append_pop 93,4 112,7 75,4 74,2 50,8 50,6 deque_append_pop 43,5 57,0 49,4 49,2 42,5 44,2 deque_append_popleft 43,7 57,3 49,7 49,7 42,8 46,4 Tidtagning av slinga: loop_overhead 0,5 0,6 0,4 0,3 0,3 0,3 0,3

source: These results were generated from the variable access benchmark script at: ``Tools/scripts/var_access_benchmark.py``. The benchmark script displays timings in nanoseconds. The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/macos/>`_.
sv: Dessa resultat genererades från skriptet Variable Access Benchmark på : ``Tools/scripts/var_access_benchmark.py``. Benchmarkskriptet visar tidsangivelser i nanosekunder. Riktmärkena uppmättes på en `Intel® Core™ i7-4960HQ-processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ som körde macOS 64-bitars builds som finns på `python.org <https://www.python.org/downloads/macos/>`_.

source: Deprecated
sv: Föråldrat

source: The distutils ``bdist_msi`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`39586`.)
sv: Distutils kommandot ``bdist_msi`` är nu föråldrat, använd ``bdist_wheel`` (wheel-paket) istället. (Bidrag från Hugo van Kemenade i :issue:`39586`.)

source: Currently :func:`math.factorial` accepts :class:`float` instances with non-negative integer values (like ``5.0``). It raises a :exc:`ValueError` for non-integral and negative floats. It is now deprecated. In future Python versions it will raise a :exc:`TypeError` for all floats. (Contributed by Serhiy Storchaka in :issue:`37315`.)
sv: För närvarande accepterar :func:`math.factorial` :class:`float` instanser med icke-negativa heltalsvärden (som ``5.0``). Den ger upphov till ett :exc:`ValueError` för icke-integrala och negativa float-värden. Det är nu föråldrat. I framtida Python-versioner kommer den att ge upphov till ett :exc:`TypeError` för alla flyttal. (Bidrag från Serhiy Storchaka i :issue:`37315`.)

source: The :mod:`!parser` and :mod:`!symbol` modules are deprecated and will be removed in future versions of Python. For the majority of use cases, users can leverage the Abstract Syntax Tree (AST) generation and compilation stage, using the :mod:`ast` module.
sv: Modulerna :mod:`!parser` och :mod:`!symbol` är föråldrade och kommer att tas bort i framtida versioner av Python. För de flesta användningsfall kan användare utnyttja genererings- och kompileringssteget för AST (Abstract Syntax Tree) med modulen :mod:`ast`.

source: The Public C API functions :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` and :c:func:`!PyNode_Compile` are deprecated and will be removed in Python 3.10 together with the old parser.
sv: De offentliga C API-funktionerna :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` och :c:func:`!PyNode_Compile` är föråldrade och kommer att tas bort i Python 3.10 tillsammans med den gamla parsern.

source: Using :data:`NotImplemented` in a boolean context has been deprecated, as it is almost exclusively the result of incorrect rich comparator implementations. It will be made a :exc:`TypeError` in a future version of Python. (Contributed by Josh Rosenberg in :issue:`35712`.)
sv: Att använda :data:`NotImplemented` i en boolesk kontext har uteslutits, eftersom det nästan uteslutande är resultatet av felaktiga implementationer av rik komparator. Det kommer att göras till ett :exc:`TypeError` i en framtida version av Python. (Bidrag från Josh Rosenberg i :issue:`35712`.)

source: The :mod:`random` module currently accepts any hashable type as a possible seed value. Unfortunately, some of those types are not guaranteed to have a deterministic hash value. After Python 3.9, the module will restrict its seeds to :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, and :class:`bytearray`.
sv: Modulen :mod:`random` accepterar för närvarande vilken hashbar typ som helst som ett möjligt seed-värde. Tyvärr är vissa av dessa typer inte garanterade att ha ett deterministiskt hashvärde. Efter Python 3.9 kommer modulen att begränsa sina fröer till :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` och :class:`bytearray`.

source: Opening the :class:`~gzip.GzipFile` file for writing without specifying the *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* argument for opening it for writing and silencing a warning. (Contributed by Serhiy Storchaka in :issue:`28286`.)
sv: Att öppna :class:`~gzip.GzipFile`-filen för skrivning utan att ange *mode*-argumentet är föråldrat. I framtida Python-versioner kommer den alltid att öppnas för läsning som standard. Ange *mode*-argumentet för att öppna den för skrivning och tysta en varning. (Bidrag från Serhiy Storchaka i :issue:`28286`.)

source: Deprecated the ``split()`` method of :class:`!_tkinter.TkappType` in favour of the ``splitlist()`` method which has more consistent and predictable behavior. (Contributed by Serhiy Storchaka in :issue:`38371`.)
sv: Föråldrade metoden ``split()`` i :class:`!_tkinter.TkappType` till förmån för metoden ``splitlist()`` som har ett mer konsekvent och förutsägbart beteende. (Bidrag från Serhiy Storchaka i :issue:`38371`.)

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov and Kyle Stanley in :issue:`34790`.)
sv: Den uttryckliga överföringen av coroutine-objekt till :func:`asyncio.wait` har föråldrats och kommer att tas bort i version 3.11. (Bidrag från Yury Selivanov och Kyle Stanley i :issue:`34790`.)

source: binhex4 and hexbin4 standards are now deprecated. The :mod:`!binhex` module and the following :mod:`binascii` functions are now deprecated:
sv: binhex4- och hexbin4-standarderna är nu föråldrade. Modulen :mod:`!binhex` och följande funktioner :mod:`binascii` är nu föråldrade:

source: (Contributed by Victor Stinner in :issue:`39353`.)
sv: (Bidrag från Victor Stinner i :issue:`39353`.)

source: :mod:`ast` classes ``slice``, ``Index`` and ``ExtSlice`` are considered deprecated and will be removed in future Python versions. ``value`` itself should be used instead of ``Index(value)``. ``Tuple(slices, Load())`` should be used instead of ``ExtSlice(slices)``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
sv: :mod:`ast` klasserna ``lice``, ``Index`` och ``ExtSlice`` anses vara föråldrade och kommer att tas bort i framtida Python-versioner. ``value`` själv bör användas istället för ``Index(value)``. ``Tuple(slices, Load())`` bör användas istället för ``ExtSlice(slices)``. (Bidrag från Serhiy Storchaka i :issue:`34822`.)

source: :mod:`ast` classes ``Suite``, ``Param``, ``AugLoad`` and ``AugStore`` are considered deprecated and will be removed in future Python versions. They were not generated by the parser and not accepted by the code generator in Python 3. (Contributed by Batuhan Taskaya in :issue:`39639` and :issue:`39969` and Serhiy Storchaka in :issue:`39988`.)
sv: :mod:`ast`-klasserna ``Suite``, ``Param``, ``AugLoad`` och ``AugStore`` anses vara föråldrade och kommer att tas bort i framtida Python-versioner. De genererades inte av parsern och accepterades inte av kodgeneratorn i Python 3. (Bidrag från Batuhan Taskaya i :issue:`39639` och :issue:`39969` och Serhiy Storchaka i :issue:`39988`.)

source: The :c:func:`!PyEval_InitThreads` and :c:func:`!PyEval_ThreadsInitialized` functions are now deprecated and will be removed in Python 3.11. Calling :c:func:`!PyEval_InitThreads` now does nothing. The :term:`GIL` is initialized by :c:func:`Py_Initialize` since Python 3.7. (Contributed by Victor Stinner in :issue:`39877`.)
sv: Funktionerna :c:func:`!PyEval_InitThreads` och :c:func:`!PyEval_ThreadsInitialized` är nu föråldrade och kommer att tas bort i Python 3.11. Anrop av :c:func:`!PyEval_InitThreads` gör nu ingenting. :term:`GIL` initialiseras av :c:func:`Py_Initialize` sedan Python 3.7. (Bidrag från Victor Stinner i :issue:`39877`.)

source: Passing ``None`` as the first argument to the :func:`shlex.split` function has been deprecated. (Contributed by Zackery Spytz in :issue:`33262`.)
sv: Att skicka ``None`` som det första argumentet till :func:`shlex.split`-funktionen har blivit föråldrat. (Bidrag från Zackery Spytz i :issue:`33262`.)

source: :func:`!smtpd.MailmanProxy` is now deprecated as it is unusable without an external module, ``mailman``. (Contributed by Samuel Colvin in :issue:`35800`.)
sv: :func:`!smtpd.MailmanProxy` är nu föråldrad eftersom den är oanvändbar utan en extern modul, ``mailman``. (Bidrag från Samuel Colvin i :issue:`35800`.)

source: The :mod:`!lib2to3` module now emits a :exc:`PendingDeprecationWarning`. Python 3.9 switched to a PEG parser (see :pep:`617`), and Python 3.10 may include new language syntax that is not parsable by lib2to3's LL(1) parser. The :mod:`!lib2to3` module may be removed from the standard library in a future Python version. Consider third-party alternatives such as `LibCST`_ or `parso`_. (Contributed by Carl Meyer in :issue:`40360`.)
sv: Modulen :mod:`!lib2to3` avger nu en :exc:`PendingDeprecationWarning`. Python 3.9 bytte till en PEG-parser (se :pep:`617`), och Python 3.10 kan innehålla ny språksyntax som inte kan analyseras av lib2to3:s LL(1)-parser. Modulen :mod:`!lib2to3` kan komma att tas bort från standardbiblioteket i en framtida Python-version. Överväg alternativ från tredje part som `LibCST`_ eller `parso`_. (Bidrag från Carl Meyer i :issue:`40360`.)

source: The *random* parameter of :func:`random.shuffle` has been deprecated. (Contributed by Raymond Hettinger in :issue:`40465`)
sv: Parametern *random* i :func:`random.shuffle` har utgått. (Bidrag från Raymond Hettinger i :issue:`40465`)

source: Removed
sv: Borttagen

source: The erroneous version at :data:`!unittest.mock.__version__` has been removed.
sv: Den felaktiga versionen i :data:`!unittest.mock.__version__` har tagits bort.

source: :class:`!nntplib.NNTP`: ``xpath()`` and ``xgtitle()`` methods have been removed. These methods are deprecated since Python 3.3. Generally, these extensions are not supported or not enabled by NNTP server administrators. For ``xgtitle()``, please use :meth:`!nntplib.NNTP.descriptions` or :meth:`!nntplib.NNTP.description` instead. (Contributed by Donghee Na in :issue:`39366`.)
sv: :class:`!nntplib.NNTP`: ``xpath()`` och ``xgtitle()`` metoderna har tagits bort. Dessa metoder är föråldrade sedan Python 3.3. I allmänhet stöds inte dessa tillägg eller aktiveras inte av NNTP-serveradministratörer. För ``xgtitle()``, använd :meth:`!nntplib.NNTP.descriptions` eller :meth:`!nntplib.NNTP.description` istället. (Bidrag från Donghee Na i :issue:`39366`.)

source: :class:`array.array`: ``tostring()`` and ``fromstring()`` methods have been removed. They were aliases to ``tobytes()`` and ``frombytes()``, deprecated since Python 3.2. (Contributed by Victor Stinner in :issue:`38916`.)
sv: :class:`array.array`: Metoderna ``tostring()`` och ``fromstring()`` har tagits bort. De var alias till ``tobytes()`` och ``frombytes()``, föråldrade sedan Python 3.2. (Bidrag från Victor Stinner i :issue:`38916`.)
