Repository: yeager/python-docs-sv
Catalog: whatsnew/3.9.po
Languages: sv

source: The undocumented ``sys.callstats()`` function has been removed. Since Python 3.7, it was deprecated and always returned :const:`None`. It required a special build option ``CALL_PROFILE`` which was already removed in Python 3.7. (Contributed by Victor Stinner in :issue:`37414`.)
sv: Den odokumenterade funktionen ``sys.callstats()`` har tagits bort. Sedan Python 3.7 var den föråldrad och returnerade alltid :const:`None`. Den krävde ett speciellt byggalternativ ``CALL_PROFILE`` som redan var borttaget i Python 3.7. (Bidrag från Victor Stinner i :issue:`37414`.)

source: The ``sys.getcheckinterval()`` and ``sys.setcheckinterval()`` functions have been removed. They were deprecated since Python 3.2. Use :func:`sys.getswitchinterval` and :func:`sys.setswitchinterval` instead. (Contributed by Victor Stinner in :issue:`37392`.)
sv: Funktionerna ``sys.getcheckinterval()`` och ``sys.setcheckinterval()`` har tagits bort. De var föråldrade sedan Python 3.2. Använd :func:`sys.getswitchinterval` och :func:`sys.setswitchinterval` istället. (Bidrag från Victor Stinner i :issue:`37392`.)

source: The C function ``PyImport_Cleanup()`` has been removed. It was documented as: "Empty the module table. For internal use only." (Contributed by Victor Stinner in :issue:`36710`.)
sv: C-funktionen ``PyImport_Cleanup()`` har tagits bort. Den var dokumenterad som: "Tömmer modultabellen. Endast för internt bruk." (Bidrag från Victor Stinner i :issue:`36710`.)

source: ``_dummy_thread`` and ``dummy_threading`` modules have been removed. These modules were deprecated since Python 3.7 which requires threading support. (Contributed by Victor Stinner in :issue:`37312`.)
sv: modulerna ``dummy_thread`` och ``dummy_threading`` har tagits bort. Dessa moduler är föråldrade sedan Python 3.7 som kräver stöd för trådning. (Bidrag från Victor Stinner i :issue:`37312`.)

source: ``aifc.openfp()`` alias to ``aifc.open()``, ``sunau.openfp()`` alias to ``sunau.open()``, and ``wave.openfp()`` alias to :func:`wave.open` have been removed. They were deprecated since Python 3.7. (Contributed by Victor Stinner in :issue:`37320`.)
sv: ``aifc.openfp()`` alias till ``aifc.open()``, ``unau.openfp()`` alias till ``unau.open()`` och ``wave.openfp()`` alias till :func:`wave.open` har tagits bort. De var föråldrade sedan Python 3.7. (Bidrag från Victor Stinner i :issue:`37320`.)

source: The :meth:`!isAlive` method of :class:`threading.Thread` has been removed. It was deprecated since Python 3.8. Use :meth:`~threading.Thread.is_alive` instead. (Contributed by Donghee Na in :issue:`37804`.)
sv: Metoden :meth:`!isAlive` i :class:`threading.Thread` har tagits bort. Den var föråldrad sedan Python 3.8. Använd :meth:`~threading.Thread.is_alive` istället. (Bidrag från Donghee Na i :issue:`37804`.)

source: Methods ``getchildren()`` and ``getiterator()`` of classes :class:`~xml.etree.ElementTree.ElementTree` and :class:`~xml.etree.ElementTree.Element` in the :mod:`~xml.etree.ElementTree` module have been removed. They were deprecated in Python 3.2. Use ``iter(x)`` or ``list(x)`` instead of ``x.getchildren()`` and ``x.iter()`` or ``list(x.iter())`` instead of ``x.getiterator()``. (Contributed by Serhiy Storchaka in :issue:`36543`.)
sv: Metoderna ``getchildren()`` och ``getiterator()`` i klasserna :class:`~xml.etree.ElementTree.ElementTree` och :class:`~xml.etree.ElementTree.Element` i modulen :mod:`~xml.etree.ElementTree` har tagits bort. De var föråldrade i Python 3.2. Använd ``iter(x)`` eller ``list(x)`` istället för ``x.getchildren()`` och ``x.iter()`` eller ``list(x.iter())`` istället för ``x.getiterator()``. (Bidrag från Serhiy Storchaka i :issue:`36543`.)

source: The old :mod:`plistlib` API has been removed, it was deprecated since Python 3.4. Use the :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump`, and :func:`~plistlib.dumps` functions. Additionally, the *use_builtin_types* parameter was removed, standard :class:`bytes` objects are always used instead. (Contributed by Jon Janzen in :issue:`36409`.)
sv: Det gamla :mod:`plistlib` API:et har tagits bort, det var föråldrat sedan Python 3.4. Använd funktionerna :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump` och :func:`~plistlib.dumps`. Dessutom togs parametern *use_builtin_types* bort, standard :class:`bytes`-objekt används alltid istället. (Bidrag från Jon Janzen i :issue:`36409`.)

source: The C function ``PyGen_NeedsFinalizing`` has been removed. It was not documented, tested, or used anywhere within CPython after the implementation of :pep:`442`. Patch by Joannah Nanjekye. (Contributed by Joannah Nanjekye in :issue:`15088`)
sv: C-funktionen ``PyGen_NeedsFinalizing`` har tagits bort. Den var inte dokumenterad, testad eller använd någonstans inom CPython efter implementeringen av :pep:`442`. Patch av Joannah Nanjekye. (Bidrag från Joannah Nanjekye i :issue:`15088`)

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
sv: ``base64.encodestring()`` och ``base64.decodestring()``, alias som är föråldrade sedan Python 3.1, har tagits bort: använd :func:`base64.encodebytes` och :func:`base64.decodebytes` istället. (Bidrag från Victor Stinner i :issue:`39351`.)

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
sv: funktionen ``fractions.gcd()`` har tagits bort, den är föråldrad sedan Python 3.5 (:issue:`22486`): använd :func:`math.gcd` istället. (Bidrag från Victor Stinner i :issue:`39350`.)

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
sv: Parametern *buffring* i :class:`bz2.BZ2File` har tagits bort. Sedan Python 3.0 ignorerades den och att använda den gav en :exc:`DeprecationWarning`. Skicka ett open file-objekt för att kontrollera hur filen öppnas. (Bidrag från Victor Stinner i :issue:`39357`.)

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
sv: Parametern *encoding* i :func:`json.loads` har tagits bort. Från och med Python 3.1 var den föråldrad och ignorerades; att använda den har gett upphov till en :exc:`DeprecationWarning` sedan Python 3.8. (Bidrag från Inada Naoki i :issue:`39377`)

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
sv: ``with (await asyncio.lock):`` och ``with (yield from asyncio.lock):`` uttalanden stöds inte längre, använd ``async with lock`` istället. Detsamma gäller för ``asyncio.Condition`` och ``asyncio.Semaphore``. (Bidrag från Andrew Svetlov i :issue:`34793`.)

source: The :func:`!sys.getcounts` function, the ``-X showalloccount`` command line option and the ``show_alloc_count`` field of the C structure :c:type:`PyConfig` have been removed. They required a special Python build by defining ``COUNT_ALLOCS`` macro. (Contributed by Victor Stinner in :issue:`39489`.)
sv: Funktionen :func:`!sys.getcounts`, kommandoradsalternativet ``-X showalloccount`` och fältet ``show_alloc_count`` i C-strukturen :c:type:`PyConfig` har tagits bort. De krävde en speciell Python-byggnad genom att definiera makrot ``COUNT_ALLOCS``. (Bidrag från Victor Stinner i :issue:`39489`.)

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
sv: Attributet ``_field_types`` i klassen :class:`typing.NamedTuple` har tagits bort. Det var föråldrat sedan Python 3.8. Använd attributet ``__annotations__`` istället. (Bidrag från Serhiy Storchaka i :issue:`40182`.)

source: The :meth:`!symtable.SymbolTable.has_exec` method has been removed. It was deprecated since 2006, and only returning ``False`` when it's called. (Contributed by Batuhan Taskaya in :issue:`40208`)
sv: Metoden :meth:`!symtable.SymbolTable.has_exec` har tagits bort. Den var föråldrad sedan 2006 och returnerade bara ``False`` när den anropades. (Bidrag från Batuhan Taskaya i :issue:`40208`)

source: The :meth:`!asyncio.Task.current_task` and :meth:`!asyncio.Task.all_tasks` have been removed. They were deprecated since Python 3.7 and you can use :func:`asyncio.current_task` and :func:`asyncio.all_tasks` instead. (Contributed by Rémi Lapeyre in :issue:`40967`)
sv: :meth:`!asyncio.Task.current_task` och :meth:`!asyncio.Task.all_tasks` har tagits bort. De är föråldrade sedan Python 3.7 och du kan använda :func:`asyncio.current_task` och :func:`asyncio.all_tasks` istället. (Bidrag från Rémi Lapeyre i :issue:`40967`)

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
sv: Metoden ``unescape()`` i klassen :class:`html.parser.HTMLParser` har tagits bort (den har varit föråldrad sedan Python 3.4). :func:`html.unescape` bör användas för att konvertera teckenreferenser till motsvarande unicode-tecken.

source: Porting to Python 3.9
sv: Portning till Python 3.9

source: This section lists previously described changes and other bugfixes that may require changes to your code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Changes in the Python API
sv: Ändringar i Python API

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
sv: :func:`__import__` och :func:`importlib.util.resolve_name` ger nu upphov till :exc:`ImportError` där det tidigare gav upphov till :exc:`ValueError`. Anropare som fångar den specifika undantagstypen och stöder både Python 3.9 och tidigare versioner måste fånga båda med hjälp av ``except (ImportError, ValueError):``.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
sv: Aktiveringsskriptet :mod:`venv` är inte längre ett specialfall när ``__VENV_PROMPT__`` är satt till ``""``.

source: The :meth:`select.epoll.unregister` method no longer ignores the :const:`~errno.EBADF` error. (Contributed by Victor Stinner in :issue:`39239`.)
sv: Metoden :meth:`select.epoll.unregister` ignorerar inte längre felet :const:`~errno.EBADF`. (Bidrag från Victor Stinner i :issue:`39239`.)

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
sv: Parametern *compresslevel* i :class:`bz2.BZ2File` blev endast nyckelord, eftersom parametern *buffering* har tagits bort. (Bidrag från Victor Stinner i :issue:`39357`.)

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
sv: Förenklad AST för prenumeration. Enkla index kommer att representeras av deras värde, utökade slices kommer att representeras som tuples. ``Index(värde)`` kommer att returnera ett ``värde`` själv, ``ExtSlice(slices)`` kommer att returnera ``Tuple(slices, Load())``. (Bidrag från Serhiy Storchaka i :issue:`34822`.)

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
sv: Modulen :mod:`importlib` ignorerar nu miljövariabeln :envvar:`PYTHONCASEOK` när kommandoradsalternativen :option:`-E` eller :option:`-I` används.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
sv: Parametern *encoding* har lagts till i klasserna :class:`ftplib.FTP` och :class:`ftplib.FTP_TLS` som en parameter med endast nyckelord, och standardkodningen har ändrats från Latin-1 till UTF-8 för att följa :rfc:`2640`.

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
sv: :meth:`asyncio.loop.shutdown_default_executor` har lagts till i :class:`~asyncio.AbstractEventLoop`, vilket innebär att alternativa händelseslingor som ärver från den bör ha denna metod definierad. (Bidrag från Kyle Stanley i :issue:`34037`.)

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
sv: De konstanta värdena för framtidsflaggor i modulen :mod:`__future__` har uppdaterats för att förhindra kollision med kompilatorflaggor. Tidigare krockade ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` med ``CO_FUTURE_DIVISION``. (Bidrag från Batuhan Taskaya i :issue:`39562`)

source: ``array('u')`` now uses :c:type:`wchar_t` as C type instead of ``Py_UNICODE``. This change doesn't affect to its behavior because ``Py_UNICODE`` is alias of :c:type:`wchar_t` since Python 3.3. (Contributed by Inada Naoki in :issue:`34538`.)
sv: ``array('u')`` använder nu :c:type:`wchar_t` som C-typ istället för ``Py_UNICODE``. Denna ändring påverkar inte dess beteende eftersom ``Py_UNICODE`` är alias för :c:type:`wchar_t` sedan Python 3.3. (Bidrag från Inada Naoki i :issue:`34538`.)

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
sv: API:et :func:`logging.getLogger` returnerar nu rotloggaren när namnet ``'root'`` anges, medan det tidigare returnerade en icke-rotloggare med namnet ``'root'``. Detta kan påverka fall där användarkod uttryckligen vill ha en icke-rotlogger med namnet ``'root``, eller instansierar en logger med hjälp av ``logging.getLogger(__name__)`` i någon toppnivåmodul som heter ``'root.py'``. (Bidrag från Vinay Sajip i :issue:`37742`.)

source: Division handling of :class:`~pathlib.PurePath` now returns :data:`NotImplemented` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
sv: Divisionshanteringen av :class:`~pathlib.PurePath` returnerar nu :data:`NotImplemented` istället för att ge upphov till :exc:`TypeError` när något annat än en instans av ``str`` eller :class:`~pathlib.PurePath` skickas. Detta gör det möjligt att skapa kompatibla klasser som inte ärver från de nämnda typerna. (Bidrag från Roger Aiudi i :issue:`34775`).

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notatation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros. (Contributed by Christian Heimes in :issue:`36384`).
sv: Från och med Python 3.9.5 accepterar modulen :mod:`ipaddress` inte längre några ledande nollor i IPv4-adresssträngar. Ledande nollor är tvetydiga och tolkas som oktal notation av vissa bibliotek. Till exempel behandlar den äldre funktionen :func:`socket.inet_aton` ledande nollor som oktalnotation. glibc-implementeringen av den moderna :func:`~socket.inet_pton` accepterar inte några ledande nollor. (Bidrag från Christian Heimes i :issue:`36384`).

source: :func:`codecs.lookup` now normalizes the encoding name the same way as :func:`encodings.normalize_encoding`, except that :func:`codecs.lookup` also converts the name to lower case. For example, ``"latex+latin1"`` encoding name is now normalized to ``"latex_latin1"``. (Contributed by Jordon Xu in :issue:`37751`.)
sv: :func:`codecs.lookup` normaliserar nu kodningsnamnet på samma sätt som :func:`encodings.normalize_encoding`, förutom att :func:`codecs.lookup` även konverterar namnet till gemener. Till exempel, ``"latex+latin1"`` kodningsnamn är nu normaliserat till ``"latex_latin1"``. (Bidrag från Jordon Xu i :issue:`37751`.)

source: Changes in the C API
sv: Förändringar i C API

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
sv: Instanser av :ref:``heap-allocated types <heap-types>`` (som de som skapats med :c:func:`PyType_FromSpec` och liknande API:er) håller en referens till sitt typobjekt sedan Python 3.8. Som anges i "Changes in the C API" i Python 3.8, för de allra flesta fall, bör det inte finnas någon bieffekt men för typer som har en anpassad :c:member:`~PyTypeObject.tp_traverse`-funktion, se till att alla anpassade ``tp_traverse``-funktioner av heap-allokerade typer besöker objektets typ.

source: int foo_traverse(PyObject *self, visitproc visit, void *arg) { // Rest of the traverse function #if PY_VERSION_HEX >= 0x03090000 // This was not needed before Python 3.9 (Python issue 35810 and 40217) Py_VISIT(Py_TYPE(self)); #endif }
sv: int foo_traverse(PyObject *self, visitproc visit, void *arg) { // Resten av traverseringsfunktionen #if PY_VERSION_HEX >= 0x03090000 // Detta behövdes inte före Python 3.9 (Python issue 35810 och 40217) Py_VISIT(Py_TYPE(self)); #endif }

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
sv: Om din traversefunktion delegerar till ``tp_traverse`` i sin basklass (eller en annan typ), se till att ``Py_TYPE(self)`` bara besöks en gång. Observera att endast :ref:``heap type <heap-types>`` förväntas besöka typen i ``tp_traverse``.

source: For example, if your ``tp_traverse`` function includes:
sv: Till exempel, om din ``tp_traverse``-funktion innehåller:

source: base->tp_traverse(self, visit, arg)
sv: base->tp_traverse(self, besök, arg)

source: then add:
sv: lägg sedan till:

source: #if PY_VERSION_HEX >= 0x03090000 // This was not needed before Python 3.9 (bpo-35810 and bpo-40217) if (base->tp_flags & Py_TPFLAGS_HEAPTYPE) { // a heap type's tp_traverse already visited Py_TYPE(self) } else { Py_VISIT(Py_TYPE(self)); } #else
sv: #if PY_VERSION_HEX >= 0x03090000 // Detta behövdes inte före Python 3.9 (bpo-35810 och bpo-40217) if (bas->tp_flags & Py_TPFLAGS_HEAPTYPE) { // en heap-typs tp_traverse har redan besökt Py_TYPE(self) } else { Py_VISIT(Py_TYPE(self)); } #else

source: (See :issue:`35810` and :issue:`40217` for more information.)
sv: (Se :issue:`35810` och :issue:`40217` för mer information)

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
sv: Funktionerna ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` och ``PyEval_CallObjectWithKeywords`` är föråldrade. Använd :c:func:`PyObject_Call` och dess varianter istället. (Se mer detaljer i :issue:`29548`.)

source: CPython bytecode changes
sv: CPython bytecode-ändringar

source: The :opcode:`!LOAD_ASSERTION_ERROR` opcode was added for handling the :keyword:`assert` statement. Previously, the assert statement would not work correctly if the :exc:`AssertionError` exception was being shadowed. (Contributed by Zackery Spytz in :issue:`34880`.)
sv: Opkoden :opcode:`!LOAD_ASSERTION_ERROR` lades till för hantering av :keyword:`assert`-satsen. Tidigare skulle assert-satsen inte fungera korrekt om :exc:`AssertionError` undantaget skuggades. (Bidrag från Zackery Spytz i :issue:`34880`.)

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
sv: Opkoden :opcode:`COMPARE_OP` delades upp i fyra olika instruktioner:

source: ``COMPARE_OP`` for rich comparisons
sv: ``COMPARE_OP`` för omfattande jämförelser

source: ``IS_OP`` for 'is' and 'is not' tests
sv: ``IS_OP`` för "är"- och "är inte"-tester

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
sv: ``CONTAINS_OP`` för "in"- och "not in"-tester

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
sv: ``JUMP_IF_NOT_EXC_MATCH`` för kontroll av undantag i 'try-except'-satser.

source: (Contributed by Mark Shannon in :issue:`39156`.)
sv: (Bidrag från Mark Shannon i :issue:`39156`.)

source: Build Changes
sv: Förändringar i byggning

source: Added ``--with-platlibdir`` option to the ``configure`` script: name of the platform-specific library directory, stored in the new :data:`sys.platlibdir` attribute. See :data:`sys.platlibdir` attribute for more information. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
sv: Lagt till alternativet ``--with-platlibdir`` till ``configure``-skriptet: namnet på den plattformsspecifika bibliotekskatalogen, lagrad i det nya attributet :data:`sys.platlibdir`. Se attributet :data:`sys.platlibdir` för mer information. (Bidrag från Jan Matějek, Matěj Cepl, Charalampos Stratakis och Victor Stinner i :issue:`1294959`.)

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
sv: Det speciella byggmakrot ``COUNT_ALLOCS`` har tagits bort. (Bidrag från Victor Stinner i :issue:`39489`.)

source: On non-Windows platforms, the :c:func:`!setenv` and :c:func:`!unsetenv` functions are now required to build Python. (Contributed by Victor Stinner in :issue:`39395`.)
sv: På icke-Windows-plattformar krävs nu funktionerna :c:func:`!setenv` och :c:func:`!unsetenv` för att bygga Python. (Bidrag från Victor Stinner i :issue:`39395`.)

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
sv: På icke-Windows-plattformar stöds nu inte skapandet av ``bdist_wininst``-installationsprogram officiellt. (Se :issue:`10945` för mer information.)
