Repository: yeager/python-docs-sv
Catalog: whatsnew/3.9.po
Languages: sv

source: Added a new :term:`coroutine` :func:`asyncio.to_thread`. It is mainly used for running IO-bound functions in a separate thread to avoid blocking the event loop, and essentially works as a high-level version of :meth:`~asyncio.loop.run_in_executor` that can directly take keyword arguments. (Contributed by Kyle Stanley and Yury Selivanov in :issue:`32309`.)
sv: Lade till en ny :term:`coroutine` :func:`asyncio.to_thread`. Den används huvudsakligen för att köra IO-bundna funktioner i en separat tråd för att undvika blockering av händelseslingan, och fungerar i huvudsak som en högnivåversion av :meth:`~asyncio.loop.run_in_executor` som direkt kan ta nyckelordsargument. (Bidrag från Kyle Stanley och Yury Selivanov i :issue:`32309`.)

source: When cancelling the task due to a timeout, :meth:`asyncio.wait_for` will now wait until the cancellation is complete also in the case when *timeout* is <= 0, like it does with positive timeouts. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
sv: När en uppgift avbryts på grund av en timeout, kommer :meth:`asyncio.wait_for` nu att vänta tills avbrytandet är klart även i fallet när *timeout* är <= 0, precis som den gör med positiva timeouts. (Bidrag från Elvis Pranskevichus i :issue:`32751`.)

source: :mod:`asyncio` now raises :exc:`TypeError` when calling incompatible methods with an :class:`ssl.SSLSocket` socket. (Contributed by Ido Michael in :issue:`37404`.)
sv: :mod:`asyncio` ger nu upphov till :exc:`TypeError` när man anropar inkompatibla metoder med en :class:`ssl.SSLSocket` socket. (Bidrag från Ido Michael i :issue:`37404`.)

source: compileall
sv: kompilera alla

source: Added new possibility to use hardlinks for duplicated ``.pyc`` files: *hardlink_dupes* parameter and --hardlink-dupes command line option. (Contributed by Lumír 'Frenzy' Balhar in :issue:`40495`.)
sv: Lagt till ny möjlighet att använda hardlinks för duplicerade ``.pyc``-filer: *parametern hardlink_dupes* och kommandoradsalternativet --hardlink-dupes. (Bidrag från Lumír 'Frenzy' Balhar i :issue:`40495`.)

source: Added new options for path manipulation in resulting ``.pyc`` files: *stripdir*, *prependdir*, *limit_sl_dest* parameters and -s, -p, -e command line options. Added the possibility to specify the option for an optimization level multiple times. (Contributed by Lumír 'Frenzy' Balhar in :issue:`38112`.)
sv: Nya alternativ för sökvägsmanipulation i resulterande ``.pyc``-filer har lagts till: *parametrarna stripdir*, *prependdir*, *limit_sl_dest* och kommandoradsalternativen -s, -p, -e. Lagt till möjligheten att ange alternativet för en optimeringsnivå flera gånger. (Bidrag från Lumír 'Frenzy' Balhar i :issue:`38112`.)

source: Added a new *cancel_futures* parameter to :meth:`concurrent.futures.Executor.shutdown` that cancels all pending futures which have not started running, instead of waiting for them to complete before shutting down the executor. (Contributed by Kyle Stanley in :issue:`39349`.)
sv: Lade till en ny *cancel_futures* parameter till :meth:`concurrent.futures.Executor.shutdown` som avbryter alla väntande futures som inte har börjat köras, istället för att vänta på att de ska slutföras innan exekutorn stängs av. (Bidrag från Kyle Stanley i :issue:`39349`.)

source: Removed daemon threads from :class:`~concurrent.futures.ThreadPoolExecutor` and :class:`~concurrent.futures.ProcessPoolExecutor`. This improves compatibility with subinterpreters and predictability in their shutdown processes. (Contributed by Kyle Stanley in :issue:`39812`.)
sv: Tog bort daemon-trådar från :class:`~concurrent.futures.ThreadPoolExecutor` och :class:`~concurrent.futures.ProcessPoolExecutor`. Detta förbättrar kompatibiliteten med undertolkare och förutsägbarheten i deras avstängningsprocesser. (Bidrag från Kyle Stanley i :issue:`39812`.)

source: Workers in :class:`~concurrent.futures.ProcessPoolExecutor` are now spawned on demand, only when there are no available idle workers to reuse. This optimizes startup overhead and reduces the amount of lost CPU time to idle workers. (Contributed by Kyle Stanley in :issue:`39207`.)
sv: Arbetare i :class:`~concurrent.futures.ProcessPoolExecutor` skapas nu på begäran, endast när det inte finns några lediga arbetare att återanvända. Detta optimerar startomkostnaderna och minskar mängden förlorad CPU-tid till inaktiva arbetare. (Bidrag från Kyle Stanley i :issue:`39207`.)

source: curses
sv: förbannelser

source: Added :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, and :func:`curses.set_tabsize` functions. (Contributed by Anthony Sottile in :issue:`38312`.)
sv: Lagt till funktionerna :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize` och :func:`curses.set_tabsize`. (Bidrag från Anthony Sottile i :issue:`38312`.)

source: datetime
sv: datatid

source: The :meth:`~datetime.date.isocalendar` of :class:`datetime.date` and :meth:`~datetime.datetime.isocalendar` of :class:`datetime.datetime` methods now returns a :func:`~collections.namedtuple` instead of a :class:`tuple`. (Contributed by Donghee Na in :issue:`24416`.)
sv: Metoderna :meth:`~datetime.date.isocalendar` av :class:`datetime.date` och :meth:`~datetime.datetime.isocalendar` av :class:`datetime.datetime` returnerar nu en :func:`~collections.namedtuple` istället för en :class:`tuple`. (Bidrag från Donghee Na i :issue:`24416`.)

source: The :command:`upload` command now creates SHA2-256 and Blake2b-256 hash digests. It skips MD5 on platforms that block MD5 digest. (Contributed by Christian Heimes in :issue:`40698`.)
sv: Kommandot :command:`upload` skapar nu SHA2-256- och Blake2b-256-hashtester. Det hoppar över MD5 på plattformar som blockerar MD5-digest. (Bidrag från Christian Heimes i :issue:`40698`.)

source: Added constants :const:`!fcntl.F_OFD_GETLK`, :const:`!fcntl.F_OFD_SETLK` and :const:`!fcntl.F_OFD_SETLKW`. (Contributed by Donghee Na in :issue:`38602`.)
sv: Lagt till konstanterna :const:`!fcntl.F_OFD_GETLK`, :const:`!fcntl.F_OFD_SETLK` och :const:`!fcntl.F_OFD_SETLKW`. (Bidrag från Donghee Na i :issue:`38602`.)

source: :class:`~ftplib.FTP` and :class:`~ftplib.FTP_TLS` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
sv: :class:`~ftplib.FTP` och :class:`~ftplib.FTP_TLS` ger nu upphov till ett :class:`ValueError` om den angivna timeouten för deras konstruktörer är noll för att förhindra skapandet av en icke-blockerande socket. (Bidrag från Donghee Na i :issue:`39259`.)

source: When the garbage collector makes a collection in which some objects resurrect (they are reachable from outside the isolated cycles after the finalizers have been executed), do not block the collection of all objects that are still unreachable. (Contributed by Pablo Galindo and Tim Peters in :issue:`38379`.)
sv: När skräpsamlaren gör en insamling där vissa objekt återuppstår (de är nåbara utanför de isolerade cyklerna efter att finalizers har exekverats), blockera inte insamlingen av alla objekt som fortfarande är oåtkomliga. (Bidrag från Pablo Galindo och Tim Peters i :issue:`38379`.)

source: Added a new function :func:`gc.is_finalized` to check if an object has been finalized by the garbage collector. (Contributed by Pablo Galindo in :issue:`39322`.)
sv: Lagt till en ny funktion :func:`gc.is_finalized` för att kontrollera om ett objekt har slutbehandlats av skräpsamlaren. (Bidrag från Pablo Galindo i :issue:`39322`.)

source: The :mod:`hashlib` module can now use SHA3 hashes and SHAKE XOF from OpenSSL when available. (Contributed by Christian Heimes in :issue:`37630`.)
sv: Modulen :mod:`hashlib` kan nu använda SHA3-hashar och SHAKE XOF från OpenSSL när de är tillgängliga. (Bidrag från Christian Heimes i :issue:`37630`.)

source: Builtin hash modules can now be disabled with ``./configure --without-builtin-hashlib-hashes`` or selectively enabled with e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` to force use of OpenSSL based implementation. (Contributed by Christian Heimes in :issue:`40479`)
sv: Inbyggda hashmoduler kan nu inaktiveras med ``./configure --without-builtin-hashlib-hashes`` eller selektivt aktiveras med t.ex. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` för att tvinga fram användning av OpenSSL-baserad implementering. (Bidrag från Christian Heimes i :issue:`40479`)

source: HTTP status codes ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` and ``425 TOO_EARLY`` are added to :class:`http.HTTPStatus`. (Contributed by Donghee Na in :issue:`39509` and Ross Rhodes in :issue:`39507`.)
sv: HTTP-statuskoderna ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` och ``425 TOO_EARLY`` läggs till i :class:`http.HTTPStatus`. (Bidrag från Donghee Na i :issue:`39509` och Ross Rhodes i :issue:`39507`.)

source: IDLE and idlelib
sv: IDLE och idlelib

source: Added option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
sv: Lagt till alternativ för att slå av markörblinkning. (Bidrag från Zackery Spytz i :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
sv: Escape-tangenten stänger nu IDLE-avslutningsfönster. (Bidrag från Johnny Najera i :issue:`38944`.)

source: Added keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
sv: Lade till nyckelord i listan för komplettering av modulnamn. (Bidrag från Terry J. Reedy i :issue:`37765`.)

source: New in 3.9 maintenance releases
sv: Nytt i 3.9 underhållsversioner

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
sv: Få IDLE att anropa :func:`sys.excepthook` (när den startas utan '-n'). Användarkrokar ignorerades tidigare. (Bidrag från Ken Hilton i :issue:`43008`.)

source: The changes above have been backported to 3.8 maintenance releases.
sv: Ändringarna ovan har backporterats till underhållsversionerna av 3.8.

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
sv: Omorganisera dialogrutan för inställningar. Dela upp fliken Allmänt i flikarna Windows och Shell/Ed. Flytta hjälpkällor, som utökar Hjälp-menyn, till fliken Tillägg. Gör plats för nya alternativ och förkorta dialogrutan. Det senare gör att dialogrutan passar bättre på små skärmar. (Bidrag från Terry Jan Reedy i :issue:`40468`.) Flytta inställningen för indragningsutrymme från fliken Font till den nya fliken Windows. (Bidrag från Mark Roseman och Terry Jan Reedy i :issue:`33962`.)

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
sv: Tillämpa syntaxmarkering på ``.pyi``-filer. (Bidrag från Alex Waygood och Terry Jan Reedy i :issue:`45447`.)

source: :class:`~imaplib.IMAP4` and :class:`~imaplib.IMAP4_SSL` now have an optional *timeout* parameter for their constructors. Also, the :meth:`~imaplib.IMAP4.open` method now has an optional *timeout* parameter with this change. The overridden methods of :class:`~imaplib.IMAP4_SSL` and :class:`~imaplib.IMAP4_stream` were applied to this change. (Contributed by Donghee Na in :issue:`38615`.)
sv: :class:`~imaplib.IMAP4` och :class:`~imaplib.IMAP4_SSL` har nu en valfri *timeout*-parameter för sina konstruktörer. Även metoden :meth:`~imaplib.IMAP4.open` har nu en valfri *timeout*-parameter i och med denna ändring. De åsidosatta metoderna i :class:`~imaplib.IMAP4_SSL` och :class:`~imaplib.IMAP4_stream` tillämpades på denna ändring. (Bidrag från Donghee Na i :issue:`38615`.)

source: :meth:`imaplib.IMAP4.unselect` is added. :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox. (Contributed by Donghee Na in :issue:`40375`.)
sv: :meth:`imaplib.IMAP4.unselect` läggs till. :meth:`imaplib.IMAP4.unselect` frigör serverns resurser som är associerade med den valda brevlådan och återställer servern till det autentiserade tillståndet. Det här kommandot utför samma åtgärder som :meth:`imaplib.IMAP4.close`, förutom att inga meddelanden tas bort permanent från den valda brevlådan. (Bidrag från Donghee Na i :issue:`40375`.)

source: To improve consistency with import statements, :func:`importlib.util.resolve_name` now raises :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts. (Contributed by Ngalim Siregar in :issue:`37444`.)
sv: För att förbättra konsekvensen med importmeddelanden, ger :func:`importlib.util.resolve_name` nu :exc:`ImportError` istället för :exc:`ValueError` för ogiltiga relativa importförsök. (Bidrag från Ngalim Siregar i :issue:`37444`.)

source: Import loaders which publish immutable module objects can now publish immutable packages in addition to individual modules. (Contributed by Dino Viehland in :issue:`39336`.)
sv: Importladdare som publicerar oföränderliga modulobjekt kan nu publicera oföränderliga paket utöver enskilda moduler. (Bidrag från Dino Viehland i :issue:`39336`.)

source: Added :func:`importlib.resources.files` function with support for subdirectories in package data, matching backport in ``importlib_resources`` version 1.5. (Contributed by Jason R. Coombs in :issue:`39791`.)
sv: Lagt till :func:`importlib.resources.files`-funktionen med stöd för underkataloger i paketdata, motsvarande backport i ``importlib_resources`` version 1.5. (Bidrag från Jason R. Coombs i :issue:`39791`.)

source: Refreshed ``importlib.metadata`` from ``importlib_metadata`` version 1.6.1.
sv: Uppdaterade ``importlib.metadata`` från ``importlib_metadata`` version 1.6.1.

source: inspect
sv: inspektera

source: :attr:`inspect.BoundArguments.arguments` is changed from ``OrderedDict`` to regular dict. (Contributed by Inada Naoki in :issue:`36350` and :issue:`39775`.)
sv: :attr:`inspect.BoundArguments.arguments` ändras från ``OrderedDict`` till vanlig dict. (Bidrag från Inada Naoki i :issue:`36350` och :issue:`39775`.)

source: ipaddress
sv: ipadress

source: :mod:`ipaddress` now supports IPv6 Scoped Addresses (IPv6 address with suffix ``%<scope_id>``).
sv: :mod:`ipaddress` har nu stöd för IPv6 Scoped Addresses (IPv6-adress med suffixet ``%<scope_id>``).

source: Scoped IPv6 addresses can be parsed using :class:`ipaddress.IPv6Address`. If present, scope zone ID is available through the :attr:`~ipaddress.IPv6Address.scope_id` attribute. (Contributed by Oleksandr Pavliuk in :issue:`34788`.)
sv: Scoped IPv6-adresser kan tolkas med hjälp av :class:`ipaddress.IPv6Address`. Om det finns ett scope zone ID är det tillgängligt via attributet :attr:`~ipaddress.IPv6Address.scope_id`. (Bidrag från Oleksandr Pavliuk i :issue:`34788`.)

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. (Contributed by Christian Heimes in :issue:`36384`).
sv: Från och med Python 3.9.5 accepterar modulen :mod:`ipaddress` inte längre några inledande nollor i IPv4-adresssträngar. (Bidrag från Christian Heimes i :issue:`36384`).

source: math
sv: matematik

source: Expanded the :func:`math.gcd` function to handle multiple arguments. Formerly, it only supported two arguments. (Contributed by Serhiy Storchaka in :issue:`39648`.)
sv: Utökade :func:`math.gcd`-funktionen till att hantera flera argument. Tidigare hade den bara stöd för två argument. (Bidrag från Serhiy Storchaka i :issue:`39648`.)

source: Added :func:`math.lcm`: return the least common multiple of specified arguments. (Contributed by Mark Dickinson, Ananthakrishnan and Serhiy Storchaka in :issue:`39479` and :issue:`39648`.)
sv: Lagt till :func:`math.lcm`: returnerar den minsta gemensamma multipeln av angivna argument. (Bidrag från Mark Dickinson, Ananthakrishnan och Serhiy Storchaka i :issue:`39479` och :issue:`39648`.)

source: Added :func:`math.nextafter`: return the next floating-point value after *x* towards *y*. (Contributed by Victor Stinner in :issue:`39288`.)
sv: Lagt till :func:`math.nextafter`: returnerar nästa flyttalsvärde efter *x* mot *y*. (Bidrag från Victor Stinner i :issue:`39288`.)

source: Added :func:`math.ulp`: return the value of the least significant bit of a float. (Contributed by Victor Stinner in :issue:`39310`.)
sv: Lagt till :func:`math.ulp`: returnerar värdet av den minst signifikanta biten i en float. (Bidrag från Victor Stinner i :issue:`39310`.)

source: The :class:`multiprocessing.SimpleQueue` class has a new :meth:`~multiprocessing.SimpleQueue.close` method to explicitly close the queue. (Contributed by Victor Stinner in :issue:`30966`.)
sv: Klassen :class:`multiprocessing.SimpleQueue` har en ny :meth:`~multiprocessing.SimpleQueue.close`-metod för att explicit stänga kön. (Bidrag från Victor Stinner i :issue:`30966`.)

source: :class:`!NNTP` and :class:`!NNTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
sv: :class:`!NNTP` och :class:`!NNTP_SSL` ger nu upphov till ett :class:`ValueError` om den angivna timeouten för deras konstruktörer är noll för att förhindra skapandet av en icke-blockerande socket. (Bidrag från Donghee Na i :issue:`39259`.)

source: Added :const:`~os.CLD_KILLED` and :const:`~os.CLD_STOPPED` for :attr:`!si_code`. (Contributed by Donghee Na in :issue:`38493`.)
sv: Lade till :const:`~os.CLD_KILLED` och :const:`~os.CLD_STOPPED` för :attr:`!si_code`. (Bidrag från Donghee Na i :issue:`38493`.)

source: Exposed the Linux-specific :func:`os.pidfd_open` (:issue:`38692`) and :const:`os.P_PIDFD` (:issue:`38713`) for process management with file descriptors.
sv: Exponerade de Linux-specifika :func:`os.pidfd_open` (:issue:`38692`) och :const:`os.P_PIDFD` (:issue:`38713`) för processhantering med filbeskrivare.

source: The :func:`os.unsetenv` function is now also available on Windows. (Contributed by Victor Stinner in :issue:`39413`.)
sv: Funktionen :func:`os.unsetenv` är nu även tillgänglig i Windows. (Bidrag från Victor Stinner i :issue:`39413`.)

source: The :func:`os.putenv` and :func:`os.unsetenv` functions are now always available. (Contributed by Victor Stinner in :issue:`39395`.)
sv: Funktionerna :func:`os.putenv` och :func:`os.unsetenv` är nu alltid tillgängliga. (Bidrag från Victor Stinner i :issue:`39395`.)

source: Added :func:`os.waitstatus_to_exitcode` function: convert a wait status to an exit code. (Contributed by Victor Stinner in :issue:`40094`.)
sv: Lagt till :func:`os.waitstatus_to_exitcode` funktion: konverterar en väntestatus till en utgångskod. (Bidrag från Victor Stinner i :issue:`40094`.)

source: pathlib
sv: sökväg

source: Added :meth:`pathlib.Path.readlink` which acts similarly to :func:`os.readlink`. (Contributed by Girts Folkmanis in :issue:`30618`)
sv: Lagt till :meth:`pathlib.Path.readlink` som fungerar på liknande sätt som :func:`os.readlink`. (Bidrag från Girts Folkmanis i :issue:`30618`)

source: On Windows now :class:`~pdb.Pdb` supports ``~/.pdbrc``. (Contributed by Tim Hopper and Dan Lidral-Porter in :issue:`20523`.)
sv: På Windows stöder nu :class:`~pdb.Pdb` ``~/.pdbrc``. (Bidrag från Tim Hopper och Dan Lidral-Porter i :issue:`20523`.)

source: :class:`~poplib.POP3` and :class:`~poplib.POP3_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
sv: :class:`~poplib.POP3` och :class:`~poplib.POP3_SSL` ger nu upphov till ett :class:`ValueError` om den angivna timeouten för deras konstruktörer är noll för att förhindra att ett icke-blockerande uttag skapas. (Bidrag från Donghee Na i :issue:`39259`.)

source: pprint
sv: tryck

source: :mod:`pprint` can now pretty-print :class:`types.SimpleNamespace`. (Contributed by Carl Bordum Hansen in :issue:`37376`.)
sv: :mod:`pprint` kan nu pretty-printa :class:`types.SimpleNamespace`. (Bidrag från Carl Bordum Hansen i :issue:`37376`.)

source: The documentation string is now shown not only for class, function, method etc, but for any object that has its own :attr:`~definition.__doc__` attribute. (Contributed by Serhiy Storchaka in :issue:`40257`.)
sv: Dokumentationssträngen visas nu inte bara för klass, funktion, metod etc, utan för alla objekt som har sitt eget :attr:`~definition.__doc__`-attribut. (Bidrag från Serhiy Storchaka i :issue:`40257`.)

source: random
sv: slumpvis

source: Added a new :meth:`random.Random.randbytes` method: generate random bytes. (Contributed by Victor Stinner in :issue:`40286`.)
sv: Lagt till en ny :meth:`random.Random.randbytes`-metod: generera slumpmässiga byte. (Bidrag från Victor Stinner i :issue:`40286`.)

source: Exposed the Linux-specific :func:`signal.pidfd_send_signal` for sending to signals to a process using a file descriptor instead of a pid. (:issue:`38712`)
sv: Exponerade den Linux-specifika :func:`signal.pidfd_send_signal` för att skicka signaler till en process som använder en filbeskrivare istället för en pid. (:issue:`38712`)

source: :class:`~smtplib.SMTP` and :class:`~smtplib.SMTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
sv: :class:`~smtplib.SMTP` och :class:`~smtplib.SMTP_SSL` ger nu upphov till ett :class:`ValueError` om den angivna timeouten för deras konstruktörer är noll för att förhindra att en icke-blockerande socket skapas. (Bidrag från Donghee Na i :issue:`39259`.)

source: :class:`~smtplib.LMTP` constructor now has an optional *timeout* parameter. (Contributed by Donghee Na in :issue:`39329`.)
sv: :class:`~smtplib.LMTP`-konstruktören har nu en valfri *timeout*-parameter. (Bidrag från Donghee Na i :issue:`39329`.)

source: socket
sv: kortplats

source: The :mod:`socket` module now exports the :const:`~socket.CAN_RAW_JOIN_FILTERS` constant on Linux 4.1 and greater. (Contributed by Stefan Tatschner and Zackery Spytz in :issue:`25780`.)
sv: Modulen :mod:`socket` exporterar nu konstanten :const:`~socket.CAN_RAW_JOIN_FILTERS` på Linux 4.1 och senare. (Bidrag från Stefan Tatschner och Zackery Spytz i :issue:`25780`.)

source: The socket module now supports the :const:`~socket.CAN_J1939` protocol on platforms that support it. (Contributed by Karl Ding in :issue:`40291`.)
sv: Socket-modulen stöder nu :const:`~socket.CAN_J1939`-protokollet på plattformar som stöder det. (Bidrag från Karl Ding i :issue:`40291`.)

source: The socket module now has the :func:`socket.send_fds` and :func:`socket.recv_fds` functions. (Contributed by Joannah Nanjekye, Shinya Okano and Victor Stinner in :issue:`28724`.)
sv: Socket-modulen har nu funktionerna :func:`socket.send_fds` och :func:`socket.recv_fds`. (Bidrag från Joannah Nanjekye, Shinya Okano och Victor Stinner i :issue:`28724`.)

source: time
sv: tid
