Repository: yeager/python-docs-sv
Catalog: whatsnew/3.9.po
Languages: sv

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. A :exc:`DeprecationWarning` may be emitted for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9.1. This :exc:`DeprecationWarning` will become a :exc:`TypeError` in Python 3.10. (Contributed by Ken Jin in :issue:`42195`.)
sv: :class:`collections.abc.Callable` generic plattar nu till typ-parametrar, liknande vad :data:`typing.Callable` gör för närvarande. Detta innebär att ``collections.abc.Callable[[int, str], str]`` kommer att ha ``__args__`` av ``(int, str, str)``; tidigare var detta ``([int, str], str)``. För att möjliggöra denna ändring kan :class:`types.GenericAlias` nu underklassas, och en underklass kommer att returneras vid subskription av typen :class:`collections.abc.Callable`. Kod som kommer åt argumenten via :func:`typing.get_args` eller ``__args__`` måste ta hänsyn till denna ändring. En :exc:`DeprecationWarning` kan komma att skickas ut för ogiltiga former av parametrisering av :class:`collections.abc.Callable` som kan ha passerat tyst i Python 3.9.1. Denna :exc:`DeprecationWarning` kommer att bli en :exc:`TypeError` i Python 3.10. (Bidrag från Ken Jin i :issue:`42195`.)

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
sv: Tidigare Python-versioner tillät användning av både ``;`` och ``&`` som separatorer för frågeparametrar i :func:`urllib.parse.parse_qs` och :func:`urllib.parse.parse_qsl`. På grund av säkerhetsproblem och för att överensstämma med nyare W3C-rekommendationer har detta ändrats så att endast en enda separatornyckel tillåts, med ``&`` som standard. Denna ändring påverkar även :func:`!cgi.parse` och :func:`!cgi.parse_multipart` eftersom de använder de berörda funktionerna internt. För mer information, vänligen se deras respektive dokumentation. (Bidrag från Adam Goldschmidt, Senthil Kumaran och Ken Jin i :issue:`42967`.)

source: Notable changes in Python 3.9.3
sv: Viktiga ändringar i Python 3.9.3

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
sv: En säkerhetsfix ändrar :class:`ftplib.FTP`-beteendet så att det inte litar på den IPv4-adress som skickas från fjärrservern när en passiv datakanal sätts upp. Vi återanvänder istället ftp-serverns IP-adress. För ovanlig kod som kräver det gamla beteendet, ställ in attributet ``trust_server_pasv_ipv4_address`` på din FTP-instans till ``True``. (Se :gh:`87451`)

source: Notable changes in Python 3.9.5
sv: Viktiga ändringar i Python 3.9.5

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
sv: Förekomsten av newline- eller tabb-tecken i delar av en URL möjliggör vissa former av attacker. I enlighet med WHATWG-specifikationen som uppdaterar :rfc:`3986`, tas ASCII newline ``n``, ``\r`` och tabb ``t``-tecken bort från URL:en av parsern i :mod:`urllib.parse` för att förhindra sådana attacker. De borttagna tecknen styrs av en ny variabel på modulnivå, ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Se :gh:`88048`)

source: Notable security feature in 3.9.14
sv: Anmärkningsvärd säkerhetsfunktion i 3.9.14

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
sv: Konvertering mellan :class:`int` och :class:`str` i andra baser än 2 (binär), 4, 8 (oktal), 16 (hexadecimal) eller 32 såsom bas 10 (decimal) ger nu upphov till ett :exc:`ValueError` om antalet siffror i strängform är över en gräns för att undvika potentiella överbelastningsattacker på grund av den algoritmiska komplexiteten. Detta är en begränsning av :cve:`2020-10735`. Den här gränsen kan konfigureras eller inaktiveras med hjälp av en miljövariabel, kommandoradsflagga eller :mod:`sys` API:er. Se dokumentationen :ref:`Längdsbegränsning för konvertering av heltalssträngar <int_max_str_digits>`. Standardgränsen är 4300 siffror i strängform.

source: Notable changes in 3.9.17
sv: Viktiga ändringar i 3.9.17

source: tarfile
sv: tarfil

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
sv: Extraktionsmetoderna i :mod:`tarfile` och :func:`shutil.unpack_archive` har ett nytt *filter*-argument som gör det möjligt att begränsa tarfunktioner som kan vara överraskande eller farliga, t.ex. att skapa filer utanför destinationskatalogen. Se :ref:`tarfile-extraction-filter` för detaljer. I Python 3.12 kommer användning utan *filter*-argumentet att visa en :exc:`DeprecationWarning`. I Python 3.14 kommer standardinställningen att ändras till ``'data'``. (Bidrag från Petr Viktorin i :pep:`706`.)
