Repository: yeager/python-docs-sv
Catalog: whatsnew/3.9.po
Languages: sv

source: What's New In Python 3.9
sv: Vad är nytt i Python 3.9

source: Editor
sv: Redigerare

source: This article explains the new features in Python 3.9, compared to 3.8. Python 3.9 was released on October 5, 2020. For full details, see the :ref:`changelog <changelog>`.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.9 jämfört med 3.8. Python 3.9 släpptes den 5 oktober 2020. För fullständig information, se :ref:`changelog <changelog>`.

source: :pep:`596` - Python 3.9 Release Schedule
sv: :pep:`596` - Python 3.9 Utgivningsschema

source: Summary -- Release highlights
sv: Sammanfattning -- Release highlights

source: New syntax features:
sv: Nya syntaxfunktioner:

source: :pep:`584`, union operators added to ``dict``;
sv: :pep:`584`, unionsoperatorer tillagda i ``dict``;

source: :pep:`585`, type hinting generics in standard collections;
sv: :pep:`585`, typhintande generik i standardsamlingar;

source: :pep:`614`, relaxed grammar restrictions on decorators.
sv: :pep:`614`, lättade på grammatiska begränsningar för dekoratorer.

source: New built-in features:
sv: Nya inbyggda funktioner:

source: :pep:`616`, string methods to remove prefixes and suffixes.
sv: :pep:`616`, strängmetoder för att ta bort prefix och suffix.

source: New features in the standard library:
sv: Nya funktioner i standardbiblioteket:

source: :pep:`593`, flexible function and variable annotations;
sv: :pep:`593`, flexibla funktions- och variabelanteckningar;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
sv: :func:`os.pidfd_open` tillagd som möjliggör processhantering utan tävlingar och signaler.

source: Interpreter improvements:
sv: Förbättringar av tolkar:

source: :pep:`573`, fast access to module state from methods of C extension types;
sv: :pep:`573`, snabb tillgång till modulstatus från metoder för C-tilläggstyper;

source: :pep:`617`, CPython now uses a new parser based on PEG;
sv: :pep:`617`, CPython använder nu en ny parser baserad på PEG;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
sv: ett antal Python-inbyggda program (range, tuple, set, frozenset, list, dict) snabbas nu upp med :pep:`590` vectorcall;

source: garbage collection does not block on resurrected objects;
sv: skräpinsamlingen blockerar inte på återuppståndna objekt;

source: a number of Python modules (:mod:`!_abc`, :mod:`!audioop`, :mod:`!_bz2`, :mod:`!_codecs`, :mod:`!_contextvars`, :mod:`!_crypt`, :mod:`!_functools`, :mod:`!_json`, :mod:`!_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`!_weakref`) now use multiphase initialization as defined by PEP 489;
sv: ett antal Python-moduler (:mod:`!_abc`, :mod:`!audioop`, :mod:`!_bz2`, :mod:`!_codecs`, :mod:`!_contextvars`, :mod:`!_crypt`, :mod:`!_functools`, :mod:`!_json`, :mod:`!_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`!_weakref`) använder nu flerfasinitialisering enligt definitionen i PEP 489;

source: a number of standard library modules (:mod:`!audioop`, :mod:`ast`, :mod:`grp`, :mod:`!_hashlib`, :mod:`pwd`, :mod:`!_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) are now using the stable ABI defined by PEP 384.
sv: ett antal standardbiblioteksmoduler (:mod:`!audioop`, :mod:`ast`, :mod:`grp`, :mod:`!_hashlib`, :mod:`pwd`, :mod:`!_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) använder nu det stabila ABI som definieras av PEP 384.

source: New library modules:
sv: Nya biblioteksmoduler:

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
sv: :pep:`615`, IANA:s tidszonsdatabas finns nu i standardbiblioteket i modulen :mod:`zoneinfo`;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
sv: en implementation av en topologisk sortering av en graf finns nu i den nya :mod:`graphlib`-modulen.

source: Release process changes:
sv: Förändringar i releaseprocessen:

source: :pep:`602`, CPython adopts an annual release cycle.
sv: :pep:`602`, CPython antar en årlig utgivningscykel.

source: You should check for DeprecationWarning in your code
sv: Du bör kontrollera om det finns DeprecationWarning i din kod

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
sv: När Python 2.7 fortfarande stöddes behölls en hel del funktionalitet i Python 3 för bakåtkompatibilitet med Python 2.7. I och med slutet av Python 2-stödet har dessa bakåtkompatibilitetslager tagits bort eller kommer snart att tas bort. De flesta av dem utfärdade en :exc:`DeprecationWarning`-varning i flera år. Om du till exempel använder ``collections.Mapping`` i stället för ``collections.abc.Mapping`` visas en :exc:`DeprecationWarning` sedan Python 3.3, som släpptes 2012.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
sv: Testa din applikation med kommandoradsalternativet :option:`-W` ``default`` för att se :exc:`DeprecationWarning` och :exc:`PendingDeprecationWarning`, eller till och med med :option:`-W` ``error`` för att behandla dem som fel. :ref:`Warnings Filter <warning-filter>` kan användas för att ignorera varningar från tredjepartskod.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
sv: Python 3.9 är den sista versionen som tillhandahåller dessa Python 2 bakåtkompatibilitetslager, för att ge mer tid till Python-projektansvariga att organisera borttagningen av Python 2-stödet och lägga till stöd för Python 3.9.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
sv: Aliaser till :ref:`Abstract Base Classes <collections-abstract-base-classes>` i modulen :mod:`collections`, som ``collections.Mapping`` alias till :class:`collections.abc.Mapping`, behålls i en sista version för bakåtkompatibilitet. De kommer att tas bort från Python 3.10.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
sv: Mer generellt, försök att köra dina tester i :ref:`Python Development Mode <devmode>` som hjälper till att förbereda din kod för att göra den kompatibel med nästa Python-version.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
sv: Notera: ett antal redan existerande deprecations togs bort i denna version av Python också. Se avsnittet :ref:`removed-in-python-39`.

source: New Features
sv: Nya funktioner

source: Dictionary Merge & Update Operators
sv: Operatorer för sammanslagning och uppdatering av ordböcker

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
sv: Operatorerna merge (``|``) och update (``|=``) har lagts till i den inbyggda klassen :class:`dict`. Dessa kompletterar de befintliga metoderna ``dict.update`` och ``{**d1, **d2}`` för sammanslagning av ordböcker.

source: Example::
sv: Exempel::

source: >>> x = {"key1": "value1 from x", "key2": "value2 from x"} >>> y = {"key2": "value2 from y", "key3": "value3 from y"} >>> x | y {'key1': 'value1 from x', 'key2': 'value2 from y', 'key3': 'value3 from y'} >>> y | x {'key2': 'value2 from x', 'key3': 'value3 from y', 'key1': 'value1 from x'}
sv: >>> x = {"key1": "värde1 från x", "nyckel2": "värde2 från x"} >>> y = {"nyckel2": "värde2 från y", "nyckel3": "värde3 från y"} >>> x | y {"key1": "värde1 från x", "key2": "värde2 från y", "key3": "värde3 från y"} >>> y | x {'key2': 'värde2 från x', 'key3': 'värde3 från y', 'key1': 'värde1 från x'}

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
sv: Se :pep:`584` för en fullständig beskrivning. (Bidrag från Brandt Bucher i :issue:`36144`.)

source: New String Methods to Remove Prefixes and Suffixes
sv: Nya strängmetoder för att ta bort prefix och suffix

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
sv: :meth:`str.removeprefix(prefix)<str.removeprefix>` och :meth:`str.removesuffix(suffix)<str.removesuffix>` har lagts till för att enkelt ta bort ett onödigt prefix eller suffix från en sträng. Motsvarande metoder ``bytes``, ``bytearray`` och ``collections.UserString`` har också lagts till. Se :pep:`616` för en fullständig beskrivning. (Bidrag från Dennis Sweeney i :issue:`39939`.)

source: Type Hinting Generics in Standard Collections
sv: Typhintande generik i standardkollektioner

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
sv: I typannoteringar kan du nu använda inbyggda samlingstyper som ``list`` och ``dict`` som generiska typer istället för att importera motsvarande typer med stor bokstav (t.ex. ``List`` eller ``Dict``) från ``typing``. Vissa andra typer i standardbiblioteket är nu också generiska, till exempel ``queue.Queue``.

source: Example:
sv: Exempel:

source: def greet_all(names: list[str]) -> None: for name in names: print("Hello", name)
sv: def greet_all(names: list[str]) -> None: för namn i names: print("Hello", namn)

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
sv: Se :pep:`585` för mer information. (Bidrag från Guido van Rossum, Ethan Smith och Batuhan Taşkaya i :issue:`39481`.)

source: New Parser
sv: Ny parser

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
sv: Python 3.9 använder en ny parser, baserad på `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ istället för `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. Den nya parserns prestanda är ungefär jämförbar med den gamla parserns, men PEG-formalismen är mer flexibel än LL(1) när det gäller att utforma nya språkfunktioner. Vi kommer att börja använda denna flexibilitet i Python 3.10 och senare.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
sv: Modulen :mod:`ast` använder den nya parsern och producerar samma AST som den gamla parsern.

source: In Python 3.10, the old parser will be deleted and so will all functionality that depends on it (primarily the :mod:`!parser` module, which has long been deprecated). In Python 3.9 *only*, you can switch back to the LL(1) parser using a command line switch (``-X oldparser``) or an environment variable (``PYTHONOLDPARSER=1``).
sv: I Python 3.10 kommer den gamla parsern att raderas, liksom all funktionalitet som är beroende av den (främst modulen :mod:`!parser`, som sedan länge är föråldrad). I Python 3.9 *endast* kan du byta tillbaka till LL(1)-parsern med hjälp av en kommandoradsväxel (``-X oldparser``) eller en miljövariabel (``PYTHONOLDPARSER=1``).

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
sv: Se :pep:`617` för mer information. (Bidrag från Guido van Rossum, Pablo Galindo och Lysandros Nikolaou i :issue:`40334`.)

source: Other Language Changes
sv: Andra språkliga förändringar

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
sv: :func:`__import__` ger nu upphov till :exc:`ImportError` istället för :exc:`ValueError`, vilket brukade inträffa när en relativ import gick förbi sitt toppnivåpaket. (Bidrag från Ngalim Siregar i :issue:`37444`.)

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
sv: Python får nu den absoluta sökvägen till skriptfilnamnet som anges på kommandoraden (ex: ``python3 script.py``): attributet ``__file__`` i modulen :mod:`__main__` blev en absolut sökväg, snarare än en relativ sökväg. Dessa sökvägar förblir nu giltiga efter att den aktuella katalogen har ändrats med :func:`os.chdir`. Som en bieffekt visar spårningen även den absoluta sökvägen för :mod:`__main__`-modulramarna i det här fallet. (Bidrag från Victor Stinner i :issue:`20443`.)

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
sv: I :ref:`Python Development Mode <devmode>` och i :ref:`debug build <debug-build>` kontrolleras nu argumenten *encoding* och *errors* för strängkodning och avkodning. Exempel: :func:`open`, :meth:`str.encode` och :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
sv: Som standard, för bästa prestanda, kontrolleras *errors*-argumentet endast vid det första kodnings-/avkodningsfelet och *encoding*-argumentet ignoreras ibland för tomma strängar. (Bidrag från Victor Stinner i :issue:`37388`.)

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
sv: ``"".replace("", s, n)`` returnerar nu ``s`` istället för en tom sträng för alla ``n`` som inte är noll. Det är nu konsekvent med ``"".replace("", s)``. Det finns liknande ändringar för objekten :class:`bytes` och :class:`bytearray`. (Bidrag från Serhiy Storchaka i :issue:`28029`.)

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
sv: Alla giltiga uttryck kan nu användas som en :term:`decorator`. Tidigare var grammatiken mycket mer restriktiv. Se :pep:`614` för detaljer. (Bidrag från Brandt Bucher i :issue:`39702`.)

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
sv: Förbättrad hjälp för modulen :mod:`typing`. Nu visas dokumentsträngar för alla specialformer och speciella generiska alias (som ``Union`` och ``List``). Om du använder :func:`help` med ett generiskt alias som ``List[int]`` visas hjälpen för den motsvarande konkreta typen (``list`` i det här fallet). (Bidrag från Serhiy Storchaka i :issue:`40257`.)

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
sv: Parallellkörning av :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` är nu förbjuden och ``ag_running`` återspeglar nu den faktiska körstatusen för asyncgeneratorn. (Bidrag från Yury Selivanov i :issue:`30773`.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
sv: Oväntade fel vid anrop av metoden ``__iter__`` maskeras inte längre av ``TypeError`` i operatorn :keyword:`in` och funktionerna :func:`~operator.contains`, :func:`~operator.indexOf` och :func:`~operator.countOf` i modulen :mod:`operator`. (Bidrag från Serhiy Storchaka i :issue:`40824`.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
sv: Lambdauttryck som inte är parenthesized kan inte längre vara uttrycksdelen i en ``if``-sats i förståelser och generatoruttryck. Se :issue:`41848` och :issue:`43755` för detaljer.

source: New Modules
sv: Nya moduler

source: zoneinfo
sv: zoninfo

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
sv: Modulen :mod:`zoneinfo` ger stöd för IANA:s tidszonsdatabas till standardbiblioteket. Den lägger till :class:`zoneinfo.ZoneInfo`, en konkret implementation av :class:`datetime.tzinfo` som stöds av systemets tidszonsdata.

source: As a fall-back source of data for platforms that don't ship the IANA database, the :pypi:`tzdata` module was released as a first-party package -- distributed via PyPI and maintained by the CPython core team.
sv: Som en reservkälla för data för plattformar som inte levererar IANA-databasen släpptes modulen :pypi:`tzdata` som ett förstapartspaket - distribuerat via PyPI och underhållet av CPython-kärnteamet.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
sv: :pep:`615` -- Stöd för IANA:s tidszonsdatabas i standardbiblioteket

source: PEP written and implemented by Paul Ganssle
sv: PEP skrivet och implementerat av Paul Ganssle

source: graphlib
sv: graflib

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
sv: En ny modul, :mod:`graphlib`, har lagts till som innehåller klassen :class:`graphlib.TopologicalSorter` för att erbjuda funktionalitet för att utföra topologisk sortering av grafer. (Bidrag från Pablo Galindo, Tim Peters och Larry Hastings i :issue:`17005`.)

source: Improved Modules
sv: Förbättrade moduler

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
sv: Lade till alternativet *indent* till :func:`~ast.dump` som gör det möjligt att producera en flerradig indragen utdata. (Bidrag från Serhiy Storchaka i :issue:`37995`.)

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
sv: Lade till :func:`ast.unparse` som en funktion i modulen :mod:`ast` som kan användas för att unparsa ett :class:`ast.AST`-objekt och producera en sträng med kod som skulle producera ett motsvarande :class:`ast.AST`-objekt när det parsas. (Bidrag från Pablo Galindo och Batuhan Taskaya i :issue:`38870`.)

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
sv: Lade till docstrings till AST-noder som innehåller ASDL-signaturen som användes för att konstruera den noden. (Bidrag från Batuhan Taskaya i :issue:`39638`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
sv: På grund av betydande säkerhetsproblem stöds inte längre parametern *reuse_address* i :meth:`asyncio.loop.create_datagram_endpoint`. Detta beror på beteendet hos socket-alternativet ``SO_REUSEADDR`` i UDP. För mer information, se dokumentationen för ``loop.create_datagram_endpoint()``. (Bidrag från Kyle Stanley, Antoine Pitrou och Yury Selivanov i :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
sv: Lagt till en ny :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` som schemalägger en avstängning för standardutföraren som väntar på att :class:`~concurrent.futures.ThreadPoolExecutor` ska stängas. Dessutom har :func:`asyncio.run` uppdaterats för att använda den nya :termen:`coroutine`. (Bidrag från Kyle Stanley i :issue:`34037`.)

source: Added :class:`!asyncio.PidfdChildWatcher`, a Linux-specific child watcher implementation that polls process file descriptors. (:issue:`38692`)
sv: Lagt till :class:`!asyncio.PidfdChildWatcher`, en Linux-specifik implementation av en child watcher som pollar process file descriptors. (:issue:`38692`)
