Repository: yeager/python-docs-sv
Catalog: whatsnew/3.9.po
Languages: sv

source: When building Python on macOS from source, ``_tkinter`` now links with non-system Tcl and Tk frameworks if they are installed in ``/Library/Frameworks``, as had been the case on older releases of macOS. If a macOS SDK is explicitly configured, by using :option:`--enable-universalsdk` or ``-isysroot``, only the SDK itself is searched. The default behavior can still be overridden with ``--with-tcltk-includes`` and ``--with-tcltk-libs``. (Contributed by Ned Deily in :issue:`34956`.)
sv: När Python byggs på macOS från källkod, länkar ``_tkinter`` nu med Tcl- och Tk-ramverk som inte finns i systemet om de är installerade i ``/Library/Frameworks``, vilket har varit fallet på äldre versioner av macOS. Om ett macOS SDK är explicit konfigurerat, genom att använda :option:`--enable-universalsdk` eller ``-isysroot``, söks endast SDK:n själv. Standardbeteendet kan fortfarande åsidosättas med ``--with-tcltk-includes`` och ``--with-tcltk-libs``. (Bidrag från Ned Deily i :issue:`34956`.)

source: Python can now be built for Windows 10 ARM64. (Contributed by Steve Dower in :issue:`33125`.)
sv: Python kan nu byggas för Windows 10 ARM64. (Bidrag från Steve Dower i :issue:`33125`.)

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
sv: Vissa enskilda tester hoppas nu över när ``--pgo`` används. Testerna i fråga ökade PGO-uppgiftens tid avsevärt och bidrog sannolikt inte till att förbättra optimeringen av den slutliga körbara filen. Detta påskyndar uppgiften med en faktor på cirka 15x. Att köra hela enhetstestsviten är långsamt. Den här ändringen kan resultera i en något mindre optimerad version eftersom inte lika många kodgrenar kommer att köras. Om du är villig att vänta på den mycket långsammare byggningen kan det gamla beteendet återställas med hjälp av ``./configure [...] PROFILE_TASK="-m test --pgo-extended"``. Vi ger inga garantier för vilken PGO-uppgiftsuppsättning som ger en snabbare konstruktion. Användare som bryr sig bör köra sina egna relevanta riktmärken eftersom resultaten kan bero på miljö, arbetsbelastning och kompilatorverktygskedja. (Se :issue:`36044` och :issue:`37707` för mer information)

source: C API Changes
sv: Ändringar i C API

source: :pep:`573`: Added :c:func:`PyType_FromModuleAndSpec` to associate a module with a class; :c:func:`PyType_GetModule` and :c:func:`PyType_GetModuleState` to retrieve the module and its state; and :c:type:`PyCMethod` and :c:macro:`METH_METHOD` to allow a method to access the class it was defined in. (Contributed by Marcel Plch and Petr Viktorin in :issue:`38787`.)
sv: :pep:`573`: Lagt till :c:func:`PyType_FromModuleAndSpec` för att associera en modul med en klass; :c:func:`PyType_GetModule` och :c:func:`PyType_GetModuleState` för att hämta modulen och dess tillstånd; och :c:type:`PyCMethod` och :c:macro:`METH_METHOD` för att tillåta en metod att komma åt klassen den definierades i. (Bidrag från Marcel Plch och Petr Viktorin i :issue:`38787`.)

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
sv: Lagt till :c:func:`PyFrame_GetCode` funktion: hämtar en ramkod. Lagt till :c:func:`PyFrame_GetBack` funktion: hämta nästa yttre ram. (Bidrag från Victor Stinner i :issue:`40421`.)

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
sv: Lagt till :c:func:`PyFrame_GetLineNumber` till det begränsade C API:et. (Bidrag från Victor Stinner i :issue:`40421`.)

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
sv: Lagt till :c:func:`PyThreadState_GetInterpreter` och :c:func:`PyInterpreterState_Get` funktioner för att hämta tolken. Lagt till :c:func:`PyThreadState_GetFrame` för att hämta den aktuella ramen i ett Python-trådtillstånd. Lagt till :c:func:`PyThreadState_GetID` funktion: hämta den unika identifieraren för ett Python-trådtillstånd. (Bidrag från Victor Stinner i :issue:`39947`.)

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
sv: Lade till en ny publik :c:func:`PyObject_CallNoArgs`-funktion till C API, som anropar ett anropbart Python-objekt utan några argument. Det är det mest effektiva sättet att anropa ett anropbart Python-objekt utan några argument. (Bidrag från Victor Stinner i :issue:`37194`.)

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
sv: Ändringar i det begränsade C API:et (om makrot ``Py_LIMITED_API`` är definierat):

source: Provide :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` as regular functions for the limited API. Previously, there were defined as macros, but these macros didn't compile with the limited C API which cannot access ``PyThreadState.recursion_depth`` field (the structure is opaque in the limited C API).
sv: Tillhandahåll :c:func:`Py_EnterRecursiveCall` och :c:func:`Py_LeaveRecursiveCall` som vanliga funktioner för det begränsade API:et. Tidigare definierades de som makron, men dessa makron kompilerade inte med det begränsade C API:et som inte kan komma åt fältet ``PyThreadState.recursion_depth`` (strukturen är ogenomskinlig i det begränsade C API:et).

source: ``PyObject_INIT()`` and ``PyObject_INIT_VAR()`` become regular "opaque" function to hide implementation details.
sv: ``PyObject_INIT()`` och ``PyObject_INIT_VAR()`` blir vanliga "opaka" funktioner för att dölja implementeringsdetaljer.

source: (Contributed by Victor Stinner in :issue:`38644` and :issue:`39542`.)
sv: (Bidrag från Victor Stinner i :issue:`38644` och :issue:`39542`.)

source: The :c:func:`PyModule_AddType` function is added to help adding a type to a module. (Contributed by Donghee Na in :issue:`40024`.)
sv: Funktionen :c:func:`PyModule_AddType` har lagts till för att hjälpa till att lägga till en typ till en modul. (Bidrag från Donghee Na i :issue:`40024`.)

source: Added the functions :c:func:`PyObject_GC_IsTracked` and :c:func:`PyObject_GC_IsFinalized` to the public API to allow to query if Python objects are being currently tracked or have been already finalized by the garbage collector respectively. (Contributed by Pablo Galindo Salgado in :issue:`40241`.)
sv: Lade till funktionerna :c:func:`PyObject_GC_IsTracked` och :c:func:`PyObject_GC_IsFinalized` till det publika API:et för att göra det möjligt att fråga om Python-objekt för närvarande spåras eller redan har slutförts av skräpsamlaren. (Bidrag från Pablo Galindo Salgado i :issue:`40241`.)

source: Added :c:func:`!_PyObject_FunctionStr` to get a user-friendly string representation of a function-like object. (Patch by Jeroen Demeyer in :issue:`37645`.)
sv: Lagt till :c:func:`!_PyObject_FunctionStr` för att få en användarvänlig strängrepresentation av ett funktionsliknande objekt. (Patch av Jeroen Demeyer i :issue:`37645`.)

source: Added :c:func:`PyObject_CallOneArg` for calling an object with one positional argument (Patch by Jeroen Demeyer in :issue:`37483`.)
sv: Lagt till :c:func:`PyObject_CallOneArg` för att anropa ett objekt med ett positionellt argument (Patch by Jeroen Demeyer in :issue:`37483`.)

source: ``PyInterpreterState.eval_frame`` (:pep:`523`) now requires a new mandatory *tstate* parameter (``PyThreadState*``). (Contributed by Victor Stinner in :issue:`38500`.)
sv: ``PyInterpreterState.eval_frame`` (:pep:`523``) kräver nu en ny obligatorisk *tstate* parameter (``PyThreadState*``). (Bidrag från Victor Stinner i :issue:`38500`.)

source: Extension modules: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef` are no longer called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, these functions are not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
sv: Tilläggsmoduler: funktionerna :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` och :c:member:`~PyModuleDef.m_free` i :c:type:`PyModuleDef` anropas inte längre om modultillståndet begärdes men ännu inte har allokerats. Detta är fallet omedelbart efter att modulen har skapats och innan modulen körs (:c:data:`Py_mod_exec` function). Mer exakt anropas inte dessa funktioner om :c:member:`~PyModuleDef.m_size` är större än 0 och modultillståndet (som returneras av :c:func:`PyModule_GetState`) är ``NULL``.

source: Extension modules without module state (``m_size <= 0``) are not affected.
sv: Tilläggsmoduler utan modulstatus (``m_size <= 0``) påverkas inte.

source: If :c:func:`Py_AddPendingCall` is called in a subinterpreter, the function is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls. (Contributed by Victor Stinner in :issue:`39984`.)
sv: Om :c:func:`Py_AddPendingCall` anropas i en undertolk, schemaläggs nu funktionen för att anropas från undertolken, i stället för att anropas från huvudtolken. Varje undertolk har nu sin egen lista över schemalagda anrop. (Bidrag från Victor Stinner i :issue:`39984`.)

source: The Windows registry is no longer used to initialize :data:`sys.path` when the ``-E`` option is used (if :c:member:`PyConfig.use_environment` is set to ``0``). This is significant when embedding Python on Windows. (Contributed by Zackery Spytz in :issue:`8901`.)
sv: Windows-registret används inte längre för att initiera :data:`sys.path` när alternativet ``-E`` används (om :c:member:`PyConfig.use_environment`` är satt till ``0``). Detta är viktigt vid inbäddning av Python på Windows. (Bidrag från Zackery Spytz i :issue:`8901`.)

source: The global variable :c:data:`PyStructSequence_UnnamedField` is now a constant and refers to a constant string. (Contributed by Serhiy Storchaka in :issue:`38650`.)
sv: Den globala variabeln :c:data:`PyStructSequence_UnnamedField` är nu en konstant och refererar till en konstant sträng. (Bidrag från Serhiy Storchaka i :issue:`38650`.)

source: The :c:type:`!PyGC_Head` structure is now opaque. It is only defined in the internal C API (``pycore_gc.h``). (Contributed by Victor Stinner in :issue:`40241`.)
sv: Strukturen :c:type:`!PyGC_Head` är nu opak. Den definieras endast i det interna C API:et (``pycore_gc.h``). (Bidrag från Victor Stinner i :issue:`40241`.)

source: The ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, and :c:func:`!PyUnicode_AsUnicodeAndSize` are marked as deprecated in C. They have been deprecated by :pep:`393` since Python 3.3. (Contributed by Inada Naoki in :issue:`36346`.)
sv: ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode`` och :c:func:`!PyUnicode_AsUnicodeAndSize` är markerade som föråldrade i C. De har varit föråldrade av :pep:`393` sedan Python 3.3. (Bidrag från Inada Naoki i :issue:`36346`.)

source: The :c:func:`Py_FatalError` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined. (Contributed by Victor Stinner in :issue:`39882`.)
sv: Funktionen :c:func:`Py_FatalError` är ersatt med ett makro som automatiskt loggar namnet på den aktuella funktionen, såvida inte makrot ``Py_LIMITED_API`` är definierat. (Bidrag från Victor Stinner i :issue:`39882`.)

source: The vectorcall protocol now requires that the caller passes only strings as keyword names. (See :issue:`37540` for more information.)
sv: Protokollet vectorcall kräver nu att anroparen endast skickar strängar som nyckelordsnamn. (Se :issue:`37540` för mer information.)

source: Implementation details of a number of macros and functions are now hidden:
sv: Implementeringsdetaljer för ett antal makron och funktioner är nu dolda:

source: :c:func:`PyObject_IS_GC` macro was converted to a function.
sv: :c:func:`PyObject_IS_GC` makro konverterades till en funktion.

source: The :c:func:`!PyObject_NEW` macro becomes an alias to the :c:macro:`PyObject_New` macro, and the :c:func:`!PyObject_NEW_VAR` macro becomes an alias to the :c:macro:`PyObject_NewVar` macro. They no longer access directly the :c:member:`PyTypeObject.tp_basicsize` member.
sv: Makrot :c:func:`!PyObject_NEW` blir ett alias till makrot :c:macro:`PyObject_New`, och makrot :c:func:`!PyObject_NEW_VAR` blir ett alias till makrot :c:macro:`PyObject_NewVar`. De har inte längre direkt åtkomst till :c:member:`PyTypeObject.tp_basicsize`-medlemmen.

source: :c:func:`!PyObject_GET_WEAKREFS_LISTPTR` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_weaklistoffset` member.
sv: makrot :c:func:`!PyObject_GET_WEAKREFS_LISTPTR` konverterades till en funktion: makrot använde direkt medlemmen :c:member:`PyTypeObject.tp_weaklistoffset`.

source: :c:func:`PyObject_CheckBuffer` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_as_buffer` member.
sv: makrot :c:func:`PyObject_CheckBuffer` konverterades till en funktion: Makrot använde direkt medlemmen :c:member:`PyTypeObject.tp_as_buffer`.

source: :c:func:`PyIndex_Check` is now always declared as an opaque function to hide implementation details: removed the ``PyIndex_Check()`` macro. The macro accessed directly the :c:member:`PyTypeObject.tp_as_number` member.
sv: :c:func:`PyIndex_Check` deklareras nu alltid som en opak funktion för att dölja implementationsdetaljer: tog bort makrot ``PyIndex_Check()``. Makrot hade direkt åtkomst till medlemmen :c:member:`PyTypeObject.tp_as_number`.

source: (See :issue:`40170` for more details.)
sv: (Se :issue:`40170` för mer information.)

source: Excluded ``PyFPE_START_PROTECT()`` and ``PyFPE_END_PROTECT()`` macros of ``pyfpe.h`` from the limited C API. (Contributed by Victor Stinner in :issue:`38835`.)
sv: Uteslöt ``PyFPE_START_PROTECT()`` och ``PyFPE_END_PROTECT()`` makron i ``pyfpe.h`` från det begränsade C API:et. (Bidrag från Victor Stinner i :issue:`38835`.)

source: The ``tp_print`` slot of :ref:`PyTypeObject <type-structs>` has been removed. It was used for printing objects to files in Python 2.7 and before. Since Python 3.0, it has been ignored and unused. (Contributed by Jeroen Demeyer in :issue:`36974`.)
sv: ``tp_print`` slot i :ref:`PyTypeObject <type-structs>`` har tagits bort. Den användes för att skriva ut objekt till filer i Python 2.7 och tidigare. Sedan Python 3.0 har den ignorerats och är oanvänd. (Bidrag från Jeroen Demeyer i :issue:`36974`.)

source: Excluded the following functions from the limited C API:
sv: Följande funktioner har uteslutits från det begränsade C API:et:

source: ``PyThreadState_DeleteCurrent()`` (Contributed by Joannah Nanjekye in :issue:`37878`.)
sv: ``PyThreadState_DeleteCurrent()`` (Bidrag från Joannah Nanjekye i :issue:`37878`.)

source: The trashcan mechanism which never worked in the limited C API.
sv: Papperskorgsmekanismen som aldrig fungerade i det begränsade C API:et.

source: Moved following functions and definitions to the internal C API:
sv: Följande funktioner och definitioner har flyttats till det interna C API:et:

source: ``_Py_AddToAllObjects()`` (specific to ``Py_TRACE_REFS`` build)
sv: ``_Py_AddToAllObjects() `` (specifik för ``Py_TRACE_REFS``-byggnad)

source: Removed ``_PyRuntime.getframe`` hook and removed ``_PyThreadState_GetFrame`` macro which was an alias to ``_PyRuntime.getframe``. They were only exposed by the internal C API. Removed also ``PyThreadFrameGetter`` type. (Contributed by Victor Stinner in :issue:`39946`.)
sv: Borttagen ``_PyRuntime.getframe`` krok och borttaget ``_PyThreadState_GetFrame`` makro som var ett alias till ``_PyRuntime.getframe``. De var endast exponerade av det interna C API. Tog även bort typen ``PyThreadFrameGetter``. (Bidrag från Victor Stinner i :issue:`39946`.)

source: Removed the following functions from the C API. Call :c:func:`PyGC_Collect` explicitly to clear all free lists. (Contributed by Inada Naoki and Victor Stinner in :issue:`37340`, :issue:`38896` and :issue:`40428`.)
sv: Följande funktioner har tagits bort från C API. Anropa :c:func:`PyGC_Collect` explicit för att rensa alla fria listor. (Bidrag från Inada Naoki och Victor Stinner i :issue:`37340`, :issue:`38896` och :issue:`40428`.)

source: ``PyMethod_ClearFreeList()`` and ``PyCFunction_ClearFreeList()``: the free lists of bound method objects have been removed.
sv: ``PyMethod_ClearFreeList()`` och ``PyCFunction_ClearFreeList()``: de fria listorna för bundna metodobjekt har tagits bort.

source: ``PySet_ClearFreeList()``: the set free list has been removed in Python 3.4.
sv: ``PySet_ClearFreeList()``: listan över fria set har tagits bort i Python 3.4.

source: ``PyUnicode_ClearFreeList()``: the Unicode free list has been removed in Python 3.3.
sv: ``PyUnicode_ClearFreeList()``: Unicodes fria lista har tagits bort i Python 3.3.

source: Removed ``_PyUnicode_ClearStaticStrings()`` function. (Contributed by Victor Stinner in :issue:`39465`.)
sv: Tog bort funktionen ``_PyUnicode_ClearStaticStrings()``. (Bidrag från Victor Stinner i :issue:`39465`.)

source: Removed ``Py_UNICODE_MATCH``. It has been deprecated by :pep:`393`, and broken since Python 3.3. The :c:func:`PyUnicode_Tailmatch` function can be used instead. (Contributed by Inada Naoki in :issue:`36346`.)
sv: Tog bort ``Py_UNICODE_MATCH``. Den har föråldrats av :pep:`393` och är trasig sedan Python 3.3. Funktionen :c:func:`PyUnicode_Tailmatch` kan användas istället. (Bidrag från Inada Naoki i :issue:`36346`.)

source: Cleaned header files of interfaces defined but with no implementation. The public API symbols being removed are: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contributed by Pablo Galindo Salgado in :issue:`39372`.)
sv: Rensade header-filer från gränssnitt som definierats men som inte har någon implementation. De offentliga API-symbolerna som tas bort är: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Bidrag från Pablo Galindo Salgado i :issue:`39372`.)

source: Notable changes in Python 3.9.1
sv: Viktiga ändringar i Python 3.9.1

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
sv: Beteendet för :class:`typing.Literal` ändrades för att överensstämma med :pep:`586` och för att matcha beteendet hos statiska typkontrollanter som anges i PEP.

source: ``Literal`` now de-duplicates parameters.
sv: ``Literal`` avduplicerar nu parametrar.

source: Equality comparisons between ``Literal`` objects are now order independent.
sv: Jämlikhetsjämförelser mellan ``Literal``-objekt är nu orderoberoende.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
sv: jämförelser av ``Literal`` respekterar nu typer. Till exempel, ``Literal[0] == Literal[False]`` utvärderades tidigare till ``True``. Nu är det ``False``. För att stödja denna förändring stöder den internt använda typcachen nu differentierande typer.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with mutable parameters will not throw an error::
sv: ``Literal`` objekt kommer nu att ge upphov till ett :exc:`TypeError` undantag under jämlikhetsjämförelser om någon av deras parametrar inte är :term:`hashable`. Observera att deklaration av ``Literal`` med mutabla parametrar inte kommer att ge upphov till ett fel::

source: >>> from typing import Literal >>> Literal[{0}] >>> Literal[{0}] == Literal[{False}] Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: unhashable type: 'set'
sv: &gt;&gt;&gt; från typing import Literal &gt;&gt;&gt; Literal[{0}] &gt;&gt;&gt; Litteral[{0}] == Litteral[{False}] Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: ohashbar typ: 'set'

source: (Contributed by Yurii Karabas in :issue:`42345`.)
sv: (Bidrag från Yurii Karabas i :issue:`42345`.)

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
sv: macOS 11.0 (Big Sur) och stöd för Apple Silicon Mac

source: As of 3.9.1, Python now fully supports building and running on macOS 11.0 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Binaries can also now be built on current versions of macOS to be deployed on a range of older macOS versions (tested to 10.9) while making some newer OS functions and options conditionally available based on the operating system version in use at runtime ("weaklinking").
sv: Från och med 3.9.1 har Python nu fullt stöd för att bygga och köra på macOS 11.0 (Big Sur) och på Apple Silicon Macs (baserade på ``ARM64``-arkitekturen). En ny universell byggvariant, ``universal2``, finns nu tillgänglig för inbyggt stöd för både ``ARM64`` och ``Intel 64`` i en uppsättning körbara filer. Binaries kan nu också byggas på aktuella versioner av macOS för att distribueras på en rad äldre macOS-versioner (testade till 10.9) samtidigt som vissa nyare OS-funktioner och alternativ görs villkorligt tillgängliga baserat på den operativsystemversion som används vid körning ("weaklinking").

source: (Contributed by Ronald Oussoren and Lawrence D'Anna in :issue:`41100`.)
sv: (Bidrag från Ronald Oussoren och Lawrence D'Anna i :issue:`41100`.)

source: Notable changes in Python 3.9.2
sv: Viktiga ändringar i Python 3.9.2

source: collections.abc
sv: samlingar.abc
