Repository: yeager/python-docs-sv
Catalog: tutorial/appetite.po
Languages: sv

source: Whetting Your Appetite
sv: Att stilla din aptit

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
sv: Om du arbetar mycket med datorer kommer du så småningom att upptäcka att det finns någon uppgift som du skulle vilja automatisera. Du kanske till exempel vill söka och ersätta ett stort antal textfiler, eller byta namn på och ordna om ett antal fotofiler på ett komplicerat sätt. Du kanske vill skriva en liten anpassad databas, en specialiserad GUI-applikation eller ett enkelt spel.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
sv: Om du är en professionell programvaruutvecklare kanske du måste arbeta med flera C/C++/Java-bibliotek men tycker att den vanliga skriv/kompilera/testa/re-kompilera-cykeln är för långsam. Kanske skriver du en testsvit för ett sådant bibliotek och tycker att det är en tråkig uppgift att skriva testkoden. Eller så har du kanske skrivit ett program som kan använda ett tilläggsspråk, men du vill inte designa och implementera ett helt nytt språk för din applikation.

source: Python is just the language for you.
sv: Python är precis rätt språk för dig.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, macOS, and Unix operating systems, and will help you get the job done more quickly.
sv: Du kan skriva ett Unix-skalskript eller Windows-batchfiler för några av dessa uppgifter, men skalskript är bäst på att flytta runt filer och ändra textdata, och passar inte så bra för GUI-applikationer eller spel. Du kan skriva ett C/C++/Java-program, men det kan ta mycket utvecklingstid att ens få ett första utkast till ett program. Python är enklare att använda, finns på operativsystemen Windows, macOS och Unix och hjälper dig att få jobbet gjort snabbare.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
sv: Python är enkelt att använda, men det är ett riktigt programmeringsspråk som erbjuder mycket mer struktur och stöd för stora program än vad skalskript eller batchfiler kan erbjuda. Å andra sidan erbjuder Python också mycket mer felkontroll än C, och eftersom det är ett *mycket högnivåspråk* har det inbyggda datatyper på hög nivå, till exempel flexibla arrayer och dictionaries. På grund av sina mer allmänna datatyper är Python tillämpligt på en mycket större problemdomän än Awk eller till och med Perl, men många saker är minst lika enkla i Python som i dessa språk.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
sv: Med Python kan du dela upp ditt program i moduler som kan återanvändas i andra Python-program. Det levereras med en stor samling standardmoduler som du kan använda som grund för dina program --- eller som exempel för att börja lära dig att programmera i Python. Några av dessa moduler tillhandahåller saker som fil-I/O, systemanrop, sockets och till och med gränssnitt till verktyg för grafiska användargränssnitt som Tk.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
sv: Python är ett tolkat språk, vilket kan spara mycket tid under programutvecklingen eftersom ingen kompilering och länkning behövs. Tolken kan användas interaktivt, vilket gör det enkelt att experimentera med språkets funktioner, skriva program för att kasta bort eller testa funktioner under programutveckling nedifrån och upp. Det är också en praktisk skrivbordsräknare.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
sv: Python gör det möjligt att skriva kompakta och läsbara program. Program skrivna i Python är vanligtvis mycket kortare än motsvarande C-, C++- eller Java-program, av flera skäl:

source: the high-level data types allow you to express complex operations in a single statement;
sv: datatyperna på hög nivå gör att du kan uttrycka komplexa operationer i en enda sats;

source: statement grouping is done by indentation instead of beginning and ending brackets;
sv: gruppering av uttalanden sker genom indragning i stället för genom start- och slutparenteser;

source: no variable or argument declarations are necessary.
sv: inga variabel- eller argumentdeklarationer är nödvändiga.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
sv: Python är *utvidgningsbart*: om du kan programmera i C är det lätt att lägga till en ny inbyggd funktion eller modul i tolken, antingen för att utföra kritiska operationer med maximal hastighet eller för att länka Python-program till bibliotek som kanske bara finns tillgängliga i binär form (t.ex. ett leverantörsspecifikt grafikbibliotek). När du verkligen är fast kan du länka Python-tolken till en applikation skriven i C och använda den som ett tillägg eller kommandospråk för den applikationen.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
sv: Språket är förresten uppkallat efter BBC-serien "Monty Python's Flying Circus" och har inget med reptiler att göra. Att göra referenser till Monty Python-sketcher i dokumentationen är inte bara tillåtet, det uppmuntras!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
sv: Nu när du är helt upphetsad över Python vill du säkert undersöka det lite mer i detalj. Eftersom det bästa sättet att lära sig ett språk är att använda det, inbjuder handledningen dig att leka med Python-tolken medan du läser.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
sv: I nästa kapitel förklaras hur man använder tolken. Det är ganska vardaglig information, men den är viktig för att kunna prova de exempel som visas senare.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
sv: Resten av handledningen introducerar olika funktioner i Python-språket och systemet genom exempel, från enkla uttryck, satser och datatyper till funktioner och moduler, och slutligen berörs avancerade begrepp som undantag och användardefinierade klasser.
