Repository: yeager/python-docs-sv
Catalog: tutorial/appendix.po
Languages: sv

source: Interactive Mode
sv: Interaktivt läge

source: There are two variants of the interactive :term:`REPL`. The classic basic interpreter is supported on all platforms with minimal line control capabilities.
sv: Det finns två varianter av den interaktiva :term:`REPL`. Den klassiska grundläggande tolken stöds på alla plattformar med minimala linjekontrollfunktioner.

source: On Windows, or Unix-like systems with :mod:`curses` support, a new interactive shell is used by default. This one supports color, multiline editing, history browsing, and paste mode. To disable color, see :ref:`using-on-controlling-color` for details. Function keys provide some additional functionality. :kbd:`F1` enters the interactive help browser :mod:`pydoc`. :kbd:`F2` allows for browsing command-line history with neither output nor the :term:`>>>` and :term:`...` prompts. :kbd:`F3` enters "paste mode", which makes pasting larger blocks of code easier. Press :kbd:`F3` to return to the regular prompt.
sv: I Windows eller Unix-liknande system med stöd för :mod:`curses` används ett nytt interaktivt skal som standard. Detta har stöd för färg, multilinjeredigering, historikbläddring och klistra in-läge. För att inaktivera färg, se :ref:`using-on-controlling-color` för detaljer. Funktionstangenter ger ytterligare funktionalitet. :kbd:`F1` öppnar den interaktiva hjälpbläddraren :mod:`pydoc`. :kbd:`F2` gör det möjligt att bläddra i kommandoradshistoriken utan vare sig utdata eller uppmaningarna :term:`>>>` och :term:`...`. :kbd:`F3` öppnar "klistra-läget", som gör det enklare att klistra in större kodblock. Tryck på :kbd:`F3` för att återgå till den vanliga prompten.

source: When using the new interactive shell, exit the shell by typing :kbd:`exit` or :kbd:`quit`. Adding call parentheses after those commands is not required.
sv: När du använder det nya interaktiva skalet, avsluta skalet genom att skriva :kbd:`exit` eller :kbd:`quit`. Det är inte nödvändigt att lägga till samtalsparenteser efter dessa kommandon.

source: If the new interactive shell is not desired, it can be disabled via the :envvar:`PYTHON_BASIC_REPL` environment variable.
sv: Om det nya interaktiva skalet inte är önskvärt kan det avaktiveras med miljövariabeln :envvar:`PYTHON_BASIC_REPL`.

source: Error Handling
sv: Felhantering

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit status; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
sv: När ett fel inträffar skriver tolken ut ett felmeddelande och en stackspårning. I interaktivt läge återgår den sedan till den primära prompten; när indata kom från en fil avslutas den med en utgångsstatus som inte är noll efter att stackspårningen skrivits ut. (Undantag som hanteras av en :keyword:`except`-klausul i en :keyword:`try`-sats är inte fel i det här sammanhanget) Vissa fel är ovillkorligen fatala och orsakar en avslutning med en avslutningsstatus som inte är noll; detta gäller interna inkonsekvenser och vissa fall av minnesbrist. Alla felmeddelanden skrivs till standardfelflödet; normal utdata från utförda kommandon skrivs till standardutdata.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
sv: Om du skriver avbrottstecknet (vanligtvis :kbd:`Control-C` eller :kbd:`Delete`) i den primära eller sekundära prompten avbryts inmatningen och du återgår till den primära prompten. [#]_ Att skriva ett avbrottstecken medan ett kommando körs ger upphov till undantaget :exc:`KeyboardInterrupt`, som kan hanteras med en :keyword:`try`-sats.

source: Executable Python Scripts
sv: Exekverbara Python-skript

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
sv: På BSD'ish Unix-system kan Python-skript göras direkt körbara, som shell-skript, genom att lägga till raden ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
sv: (förutsatt att tolken finns på användarens :envvar:`PATH`) i början av skriptet och ger filen ett körbart läge. ``#!`` måste vara de två första tecknen i filen. På vissa plattformar måste den första raden avslutas med en Unix-radändelse (``'\n'``), inte en Windows-radändelse (``'\r\n'``). Observera att hash- eller pundtecknet ``'#'`` används för att starta en kommentar i Python.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
sv: Skriptet kan ges ett körbart läge, eller behörighet, med hjälp av kommandot :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
sv: På Windows-system finns det ingen uppfattning om ett "körbart läge". Installationsprogrammet för Python associerar automatiskt ``.py``-filer med ``python.exe`` så att en dubbelklickning på en Python-fil kör den som ett skript. Tillägget kan också vara ``.pyw``, i så fall undertrycks det konsolfönster som normalt visas.

source: The Interactive Startup File
sv: Den interaktiva startfilen

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
sv: När du använder Python interaktivt är det ofta praktiskt att ha några standardkommandon som körs varje gång tolken startas. Du kan göra detta genom att ställa in en miljövariabel med namnet :envvar:`PYTHONSTARTUP` till namnet på en fil som innehåller dina startkommandon. Detta liknar funktionen :file:`.profile` i Unix-skalen.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
sv: Den här filen läses bara i interaktiva sessioner, inte när Python läser kommandon från ett skript och inte när :file:`/dev/tty` anges som explicit källa för kommandon (vilket annars beter sig som en interaktiv session). Den körs i samma namnrymd där interaktiva kommandon körs, så att objekt som den definierar eller importerar kan användas utan förbehåll i den interaktiva sessionen. Du kan också ändra prompterna ``sys.ps1`` och ``sys.ps2`` i den här filen.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
sv: Om du vill läsa ytterligare en startfil från den aktuella katalogen kan du programmera detta i den globala startfilen med hjälp av kod som ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. Om du vill använda startfilen i ett skript måste du göra detta uttryckligen i skriptet::

source: The Customization Modules
sv: Anpassningsmodulerna

source: Python provides two hooks to let you customize it: :index:`sitecustomize` and :index:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
sv: Python tillhandahåller två krokar så att du kan anpassa den: :index:`sitecustomize` och :index:`usercustomize`. För att se hur det fungerar måste du först hitta platsen för din användares webbplats-paketkatalog. Starta Python och kör den här koden::

source: >>> import site >>> site.getusersitepackages() '/home/user/.local/lib/python3.x/site-packages'
sv: >>> import site >>> site.getusersitepackages() '/home/user/.local/lib/python3.x/site-paket'

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
sv: Nu kan du skapa en fil med namnet :file:`usercustomize.py` i den katalogen och lägga in vad du vill i den. Det kommer att påverka varje anrop av Python, såvida det inte startas med alternativet :option:`-s` för att inaktivera den automatiska importen.

source: :index:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :index:`usercustomize`. See the documentation of the :mod:`site` module for more details.
sv: :index:`sitecustomize` fungerar på samma sätt, men skapas vanligtvis av en administratör på datorn i den globala katalogen site-packages och importeras före :index:`usercustomize`. Se dokumentationen för modulen :mod:`site` för mer information.

source: Footnotes
sv: Fotnoter

source: A problem with the GNU Readline package may prevent this.
sv: Ett problem med GNU Readline-paketet kan förhindra detta.
