Repository: yeager/python-docs-sv
Catalog: tutorial/classes.po
Languages: sv

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
sv: *Attributreferenser* använder den standardsyntax som används för alla attributreferenser i Python: ``obj.name``. Giltiga attributnamn är alla de namn som fanns i klassens namnrymd när klassobjektet skapades. Så, om klassdefinitionen såg ut så här::

source: class MyClass: """A simple example class""" i = 12345 def f(self): return 'hello world'
sv: klass MyClass: """En enkel exempelklass""" i = 12345 def f(self): return 'hej världen'

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`~type.__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
sv: så är ``MyClass.i`` och ``MyClass.f`` giltiga attributreferenser, som returnerar ett heltal respektive ett funktionsobjekt. Klassattribut kan också tilldelas, så du kan ändra värdet på ``MyClass.i`` genom tilldelning. :attr:`~type.__doc__` är också ett giltigt attribut, som returnerar den dokumentsträng som tillhör klassen: ``"En enkel exempelklass"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
sv: Klass *instantiering* använder funktionsnotation. Låtsas bara att klassobjektet är en parameterlös funktion som returnerar en ny instans av klassen. Till exempel (med antagande av ovanstående klass)::

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
sv: skapar en ny *instans* av klassen och tilldelar detta objekt till den lokala variabeln ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`~object.__init__`, like this::
sv: Instantiering ("anrop" av ett klassobjekt) skapar ett tomt objekt. Många klasser vill skapa objekt med instanser som är anpassade till ett visst initialt tillstånd. Därför kan en klass definiera en speciell metod med namnet :meth:`~object.__init__`, så här::

source: When a class defines an :meth:`~object.__init__` method, class instantiation automatically invokes :meth:`!__init__` for the newly created class instance. So in this example, a new, initialized instance can be obtained by::
sv: När en klass definierar en :meth:`~object.__init__`-metod, anropar klassinstantiering automatiskt :meth:`!__init__` för den nyskapade klassinstansen. Så i det här exemplet kan en ny, initialiserad instans erhållas genom att::

source: Of course, the :meth:`~object.__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`!__init__`. For example, ::
sv: Naturligtvis kan metoden :meth:`~object.__init__` ha argument för större flexibilitet. I så fall skickas de argument som ges till operatorn för klassinstantiering vidare till :meth:`!__init__`. Till exempel ::

source: >>> class Complex: ... def __init__(self, realpart, imagpart): ... self.r = realpart ... self.i = imagpart ... >>> x = Complex(3.0, -4.5) >>> x.r, x.i (3.0, -4.5)
sv: >>> klass Komplex: ... def __init__(self, realpart, imagpart): ... self.r = realpart ... self.i = imagpart ... >>> x = Komplex(3,0, -4,5) >>> x.r, x.i (3.0, -4.5)

source: Instance Objects
sv: Instansobjekt

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
sv: Vad kan vi nu göra med instansobjekt? De enda operationer som förstås av instansobjekt är attributreferenser. Det finns två typer av giltiga attributnamn: dataattribut och metoder.

source: *Data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`!MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
sv: *Dataattribut* motsvarar "instansvariabler" i Smalltalk och "datamedlemmar" i C++. Dataattribut behöver inte deklareras; precis som lokala variabler uppstår de när de först tilldelas. Om till exempel ``x`` är instansen av :class:`!MyClass` som skapades ovan, kommer följande kod att skriva ut värdet ``16``, utan att lämna några spår::

source: x.counter = 1 while x.counter < 10: x.counter = x.counter * 2 print(x.counter) del x.counter
sv: x.counter = 1 medan x.counter < 10: x.räknare = x.räknare * 2 print(x.räknare) radera x.räknare

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object.
sv: Den andra typen av instansattributreferens är en *metod*. En metod är en funktion som "hör till" ett objekt.

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
sv: Giltiga metodnamn för ett instansobjekt beror på dess klass. Per definition definierar alla attribut för en klass som är funktionsobjekt motsvarande metoder för dess instanser. Så i vårt exempel är ``x.f`` en giltig metodreferens, eftersom ``MyClass.f`` är en funktion, men ``x.i`` är det inte, eftersom ``MyClass.i`` inte är det. Men ``x.f`` är inte samma sak som ``MyClass.f`` --- det är ett *metodobjekt*, inte ett funktionsobjekt.

source: Method Objects
sv: Metod Objekt

source: Usually, a method is called right after it is bound::
sv: Vanligtvis anropas en metod direkt efter att den har bundits::

source: In the :class:`!MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
sv: I exemplet :class:`!MyClass` kommer detta att returnera strängen ``'hello world'``. Det är dock inte nödvändigt att anropa en metod direkt: ``x.f`` är ett metodobjekt som kan sparas och anropas vid ett senare tillfälle. Till exempel::

source: xf = x.f while True: print(xf())
sv: xf = x.f medan True: print(xf())

source: will continue to print ``hello world`` until the end of time.
sv: kommer att fortsätta att skriva ut "Hello World" till tidens ände.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`!f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
sv: Vad händer egentligen när en metod anropas? Du kanske har lagt märke till att ``x.f()`` anropades utan argument ovan, trots att funktionsdefinitionen för :meth:`!f` angav ett argument. Vad hände med argumentet? Python gör väl ett undantag när en funktion som kräver ett argument anropas utan något --- även om argumentet faktiskt inte används...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
sv: Egentligen har du kanske gissat svaret: det speciella med metoder är att instansobjektet skickas som funktionens första argument. I vårt exempel är anropet ``x.f()`` exakt likvärdigt med ``MyClass.f(x)``. I allmänhet är anrop av en metod med en lista med *n* argument likvärdigt med anrop av motsvarande funktion med en argumentlista som skapas genom att infoga metodens instansobjekt före det första argumentet.

source: In general, methods work as follows. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, references to both the instance object and the function object are packed into a method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
sv: I allmänhet fungerar metoder på följande sätt. När ett icke-dataattribut för en instans refereras, söks instansens klass. Om namnet anger ett giltigt klassattribut som är ett funktionsobjekt, packas referenser till både instansobjektet och funktionsobjektet in i ett metodobjekt. När metodobjektet anropas med en argumentlista, konstrueras en ny argumentlista av instansobjektet och argumentlistan, och funktionsobjektet anropas med denna nya argumentlista.

source: Class and Instance Variables
sv: Klass- och instansvariabler

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
sv: Generellt sett är instansvariabler för data som är unika för varje instans och klassvariabler för attribut och metoder som delas av alla instanser av klassen::

source: class Dog: kind = 'canine' # class variable shared by all instances def __init__(self, name): self.name = name # instance variable unique to each instance >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.kind # shared by all dogs 'canine' >>> e.kind # shared by all dogs 'canine' >>> d.name # unique to d 'Fido' >>> e.name # unique to e 'Buddy'
sv: klass Hund: kind = "canine" # klassvariabel som delas av alla instanser def __init__(self, namn): self.name = name # instansvariabel som är unik för varje instans >>> d = Hund('Fido') >>> e = Hund('Buddy') >>> d.kind # delas av alla hundar 'canine' >>> e.kind # delas av alla hundar 'canine' >>> d.name # unikt för d 'Fido' >>> e.name # unikt för e 'Buddy'

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
sv: Som diskuterats i :ref:`tut-object` kan delade data ha överraskande effekter när det gäller :term:`mutable`-objekt som listor och ordböcker. Till exempel bör listan *tricks* i följande kod inte användas som en klassvariabel eftersom bara en enda lista skulle delas av alla *Dog*-instanser::

source: class Dog: tricks = [] # mistaken use of a class variable def __init__(self, name): self.name = name def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks # unexpectedly shared by all dogs ['roll over', 'play dead']
sv: klass Hund: tricks = [] # felaktig användning av en klassvariabel def __init__(self, namn): self.name = namn def add_trick(self, trick): self.tricks.append(trick) >>> d = Hund('Fido') >>> e = Hund('Buddy') >>> d.add_trick('rulla över') >>> e.add_trick('spela död') >>> d.tricks # delas oväntat av alla hundar ['roll over', 'play dead']

source: Correct design of the class should use an instance variable instead::
sv: Korrekt design av klassen bör använda en instansvariabel istället::

source: class Dog: def __init__(self, name): self.name = name self.tricks = [] # creates a new empty list for each dog def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks ['roll over'] >>> e.tricks ['play dead']
sv: klass Hund: def __init__(self, namn): self.name = namn self.tricks = [] # skapar en ny tom lista för varje hund def add_trick(self, trick): self.tricks.append(trick) >>> d = Hund('Fido') >>> e = Hund('Buddy') >>> d.add_trick('rulla över') >>> e.add_trick('spela död') >>> d.tricks ['vält'] >>> e.tricks ['spela död']

source: Random Remarks
sv: Slumpmässiga kommentarer

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
sv: Om samma attributnamn förekommer både i en instans och i en klass, prioriterar attributuppslagningen instansen::

source: >>> class Warehouse: ... purpose = 'storage' ... region = 'west' ... >>> w1 = Warehouse() >>> print(w1.purpose, w1.region) storage west >>> w2 = Warehouse() >>> w2.region = 'east' >>> print(w2.purpose, w2.region) storage east
sv: >>> klass Lager: ... ändamål = 'förvaring' ... region = 'väst' ... >>> w1 = Lager() >>> print(w1.purpose, w1.region) förvaring väst >>> w2 = Lager() >>> w2.region = 'öst' >>> print(w2.syfte, w2.region) förvaring öst

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
sv: Dataattribut kan refereras till av metoder såväl som av vanliga användare ("klienter") av ett objekt. Med andra ord är klasser inte användbara för att implementera rena abstrakta datatyper. Faktum är att ingenting i Python gör det möjligt att genomdriva datahölje --- allt är baserat på konvention. (Å andra sidan kan Python-implementationen, skriven i C, helt dölja implementationsdetaljer och kontrollera åtkomst till ett objekt om det behövs; detta kan användas av tillägg till Python skrivna i C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
sv: Klienter bör använda dataattribut med försiktighet --- klienter kan förstöra invarianter som upprätthålls av metoderna genom att stämpla på sina dataattribut. Observera att klienter kan lägga till egna dataattribut till ett instansobjekt utan att påverka metodernas giltighet, så länge namnkonflikter undviks --- återigen kan en namngivningskonvention spara mycket huvudvärk här.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
sv: Det finns ingen förkortning för att referera till dataattribut (eller andra metoder!) inom metoder. Jag tycker att detta faktiskt ökar metodernas läsbarhet: det finns ingen risk för att man blandar ihop lokala variabler och instansvariabler när man tittar igenom en metod.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
sv: Ofta kallas det första argumentet i en metod för ``self``. Detta är inget annat än en konvention: namnet ``self`` har absolut ingen speciell betydelse för Python. Observera dock att om du inte följer konventionen kan din kod vara mindre läsbar för andra Python-programmerare, och det är också tänkbart att ett *class browser*-program kan skrivas som förlitar sig på en sådan konvention.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
sv: Varje funktionsobjekt som är ett klassattribut definierar en metod för instanser av den klassen. Det är inte nödvändigt att funktionsdefinitionen är textuellt innesluten i klassdefinitionen: att tilldela ett funktionsobjekt till en lokal variabel i klassen är också ok. Till exempel::

source: # Function defined outside the class def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'hello world' h = g
sv: # Funktion definierad utanför klassen def f1(self, x, y): return min(x, x+y) klassen C: f = f1 def g(self): return 'hej världen' h = g

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`!C` that refer to function objects, and consequently they are all methods of instances of :class:`!C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
sv: Nu är ``f``, ``g`` och ``h`` alla attribut av klassen :class:`!C` som refererar till funktionsobjekt, och följaktligen är de alla metoder för instanser av :class:`!C` --- ``h`` är exakt ekvivalent med ``g``. Notera att denna praxis oftast bara tjänar till att förvirra läsaren av ett program.

source: Methods may call other methods by using method attributes of the ``self`` argument::
sv: Metoder kan anropa andra metoder genom att använda metodattribut för argumentet ``self``::

source: class Bag: def __init__(self): self.data = [] def add(self, x): self.data.append(x) def addtwice(self, x): self.add(x) self.add(x)
sv: klass Väska: def __init__(self): self.data = [] def add(self, x): self.data.append(x) def addtwice(self, x): self.add(x) self.add(x)

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
sv: Metoder kan referera till globala namn på samma sätt som vanliga funktioner. Det globala scope som associeras med en metod är den modul som innehåller dess definition. (En klass används aldrig som globalt scope.) Även om det sällan finns någon bra anledning att använda globala data i en metod, finns det många legitima användningsområden för det globala scopet: För det första kan funktioner och moduler som importeras till det globala scopet användas av metoder, liksom funktioner och klasser som definieras i det. Vanligtvis är klassen som innehåller metoden själv definierad i detta globala scope, och i nästa avsnitt hittar vi några goda skäl till varför en metod skulle vilja referera till sin egen klass.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
sv: Varje värde är ett objekt och har därför en *klass* (även kallad *typ*). Den lagras som ``object.__class__``.

source: Inheritance
sv: Ärftlighet

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
sv: Naturligtvis skulle en språkfunktion inte vara värd namnet "klass" utan att stödja arv. Syntaxen för en härledd klassdefinition ser ut så här::

source: class DerivedClassName(BaseClassName): <statement-1> . . . <statement-N>
sv: klass AvleddaKlassnamn(BasKlassnamn): <statement-1> . . . <statement-N>

source: The name :class:`!BaseClassName` must be defined in a namespace accessible from the scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
sv: Namnet :class:`!BaseClassName` måste definieras i en namnrymd som är tillgänglig från det scope som innehåller den härledda klassdefinitionen. I stället för ett basklassnamn är även andra godtyckliga uttryck tillåtna. Detta kan vara användbart t.ex. när basklassen är definierad i en annan modul::

source: class DerivedClassName(modname.BaseClassName):
sv: class AvleddaKlassnamn(modnamn.BasKlassnamn):

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
sv: Exekveringen av en härledd klassdefinition sker på samma sätt som för en basklass. När klassobjektet konstrueras kommer basklassen ihåg. Detta används för att lösa attributreferenser: om ett efterfrågat attribut inte finns i klassen, fortsätter sökningen i basklassen. Denna regel tillämpas rekursivt om basklassen i sig själv är härledd från någon annan klass.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
sv: Det finns inget speciellt med instansiering av härledda klasser: ``DerivedClassName()`` skapar en ny instans av klassen. Metodreferenser löses på följande sätt: motsvarande klassattribut söks, vid behov nedåt i kedjan av basklasser, och metodreferensen är giltig om detta ger ett funktionsobjekt.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
sv: Härledda klasser kan åsidosätta metoder i sina basklasser. Eftersom metoder inte har några speciella privilegier när de anropar andra metoder i samma objekt, kan en metod i en basklass som anropar en annan metod som definieras i samma basklass sluta med att anropa en metod i en härledd klass som åsidosätter den. (För C++-programmerare: alla metoder i Python är i praktiken ``virtuella``)
