Repository: yeager/python-docs-sv
Catalog: tutorial/datastructures.po
Languages: sv

source: >>> empty = () >>> singleton = 'hello', # <-- note trailing comma >>> len(empty) 0 >>> len(singleton) 1 >>> singleton ('hello',)
sv: &gt;&gt;&gt; tom = () &gt;&gt;&gt; singleton = 'hello', # <-- note trailing comma >&gt;&gt; len(empty) 0 &gt;&gt;&gt; len(singleton) 1 &gt;&gt;&gt; singleton ('hello',)

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
sv: Satsen ``t = 12345, 54321, 'hello!'`` är ett exempel på *tuple packing*: värdena ``12345``, ``54321`` och ``'hello!'`` packas ihop till en tuple. Den omvända operationen är också möjlig::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
sv: Detta kallas, passande nog, *sequence unpacking* och fungerar för alla sekvenser på höger sida. Sekvensuppackning kräver att det finns lika många variabler på vänster sida om likhetstecknet som det finns element i sekvensen. Observera att multipel tilldelning egentligen bara är en kombination av tupelpackning och sekvensuppackning.

source: Sets
sv: Uppsättningar

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
sv: Python innehåller också en datatyp för *sets*. En set är en oordnad samling utan duplicerade element. Grundläggande användningsområden inkluderar medlemskapstestning och eliminering av dubbla poster. Set-objekt stöder också matematiska operationer som union, intersektion, differens och symmetrisk differens.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
sv: Curly braces eller funktionen :func:`set` kan användas för att skapa uppsättningar. Observera: för att skapa en tom uppsättning måste du använda ``set()``, inte ``{}``; den senare skapar en tom ordbok, en datastruktur som vi diskuterar i nästa avsnitt.

source: Here is a brief demonstration::
sv: Här är en kort demonstration::

source: >>> basket = {'apple', 'orange', 'apple', 'pear', 'orange', 'banana'} >>> print(basket) # show that duplicates have been removed {'orange', 'banana', 'pear', 'apple'} >>> 'orange' in basket # fast membership testing True >>> 'crabgrass' in basket False >>> # Demonstrate set operations on unique letters from two words >>> >>> a = set('abracadabra') >>> b = set('alacazam') >>> a # unique letters in a {'a', 'r', 'b', 'c', 'd'} >>> a - b # letters in a but not in b {'r', 'd', 'b'} >>> a | b # letters in a or b or both {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # letters in both a and b {'a', 'c'} >>> a ^ b # letters in a or b but not both {'r', 'd', 'b', 'm', 'z', 'l'}
sv: >>> korg = {'äpple', 'apelsin', 'äpple', 'päron', 'apelsin', 'banan'} >>> print(korg) # visa att dubbletter har tagits bort {'apelsin', 'banan', 'päron', 'äpple'} >>> 'orange' i korgen # snabb testning av medlemskap True >>> 'crabgrass' i korgen False >>> # Demonstrera set-operationer på unika bokstäver från två ord >>> >>> a = set('abracadabra') >>> b = uppsättning('alacazam') >>> a # unika bokstäver i a {'a', 'r', 'b', 'c', 'd'} >>> a - b # bokstäver i a men inte i b {'r', 'd', 'b'} >>> a | b # bokstäver i a eller b eller båda {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # bokstäver i både a och b {'a', 'c'} >>> a ^ b # bokstäver i a eller b men inte båda {'r', 'd', 'b', 'm', 'z', 'l'}

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
sv: På samma sätt som :ref:`listförståelse <tut-listcomps>`, stöds även setförståelse::

source: >>> a = {x for x in 'abracadabra' if x not in 'abc'} >>> a {'r', 'd'}
sv: >>> a = {x för x i 'abracadabra' om x inte finns i 'abc'} >>> a {'r', 'd'}

source: Dictionaries
sv: Ordböcker

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`!append` and :meth:`!extend`.
sv: En annan användbar datatyp som är inbyggd i Python är *ordboken* (se :ref:`typesmapping`). Ordböcker finns ibland i andra språk som "associativa minnen" eller "associativa matriser". Till skillnad från sekvenser, som indexeras av ett talområde, indexeras ordböcker av *nycklar*, som kan vara vilken oföränderlig typ som helst; strängar och tal kan alltid vara nycklar. Tupler kan användas som nycklar om de bara innehåller strängar, tal eller tupler; om en tupel innehåller något föränderligt objekt, antingen direkt eller indirekt, kan den inte användas som nyckel. Du kan inte använda listor som nycklar, eftersom listor kan ändras på plats med hjälp av indextilldelningar, slice-tilldelningar eller metoder som :meth:`!append` och :meth:`!extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
sv: Det är bäst att tänka på en ordbok som en uppsättning *nyckel: värde*-par, med kravet att nycklarna är unika (inom en ordbok). Ett par hakparenteser skapar en tom ordbok: ``{}``. Om du placerar en kommaseparerad lista med nyckel:värde-par inom hakparenteserna läggs de första nyckel:värde-paren till i ordboken; det är också så ordböcker skrivs på utdatasidan.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
sv: De viktigaste operationerna i en ordbok är att lagra ett värde med en nyckel och att extrahera värdet med hjälp av nyckeln. Det är också möjligt att ta bort ett nyckel:värde-par med ``del``. Om du lagrar med en nyckel som redan används, glöms det gamla värdet som är associerat med den nyckeln bort. Det är ett fel att extrahera ett värde med en icke-existerande nyckel.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
sv: Om du utför ``list(d)`` på en ordbok returneras en lista över alla nycklar som används i ordboken, i inmatningsordning (om du vill ha den sorterad använder du ``sorted(d)`` istället). Om du vill kontrollera om en enskild nyckel finns i ordlistan använder du nyckelordet :keyword:`in`.

source: Here is a small example using a dictionary::
sv: Här är ett litet exempel med hjälp av en ordbok::

source: >>> tel = {'jack': 4098, 'sape': 4139} >>> tel['guido'] = 4127 >>> tel {'jack': 4098, 'sape': 4139, 'guido': 4127} >>> tel['jack'] 4098 >>> del tel['sape'] >>> tel['irv'] = 4127 >>> tel {'jack': 4098, 'guido': 4127, 'irv': 4127} >>> list(tel) ['jack', 'guido', 'irv'] >>> sorted(tel) ['guido', 'irv', 'jack'] >>> 'guido' in tel True >>> 'jack' not in tel False
sv: >>> tel = {'jack': 4098, 'sape': 4139} >>> tel['guido'] = 4127 >>> tel {'jack': 4098, 'sape': 4139, 'guido': 4127} >>> tel['jack'] 4098 >>> del tel['sape'] >>> tel['irv'] = 4127 >>> tel {"jack": 4098, 'guido': 4127, 'irv': 4127} >>> list(tel) ['jack', 'guido', 'irv'] >>> sorterad(tel) ['guido', 'irv', 'jack'] >>> 'guido' i tel Sant >>> 'jack' inte i tel Falsk

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
sv: Konstruktören :func:`dict` bygger upp lexikon direkt från sekvenser av nyckel-värde-par::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
sv: Dessutom kan dict comprehensions användas för att skapa ordböcker från godtyckliga nyckel- och värdeuttryck::

source: >>> {x: x**2 for x in (2, 4, 6)} {2: 4, 4: 16, 6: 36}
sv: >>> {x: x**2 för x i (2, 4, 6)} {2: 4, 4: 16, 6: 36}

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
sv: När nycklarna är enkla strängar är det ibland enklare att ange par med hjälp av nyckelordsargument::

source: Looping Techniques
sv: Looping-tekniker

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
sv: Vid loopning genom lexikon kan nyckeln och motsvarande värde hämtas samtidigt med hjälp av metoden :meth:`~dict.items`. ::

source: >>> knights = {'gallahad': 'the pure', 'robin': 'the brave'} >>> for k, v in knights.items(): ... print(k, v) ... gallahad the pure robin the brave
sv: >>> riddare = {'gallahad': 'den rene', 'robin': 'den modige'} >>> för k, v i knights.items(): ... print(k, v) ... gallahad den renlärige robin den modige

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
sv: Vid loopning genom en sekvens kan positionsindex och motsvarande värde hämtas samtidigt med hjälp av funktionen :func:`enumerate`. ::

source: >>> for i, v in enumerate(['tic', 'tac', 'toe']): ... print(i, v) ... 0 tic 1 tac 2 toe
sv: >>> for i, v in enumerate(['tic', 'tac', 'toe']): ... print(i, v) ... 0 tic 1 tac 2 tå

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
sv: För att loopa över två eller flera sekvenser samtidigt kan posterna kopplas ihop med funktionen :func:`zip`. ::

source: >>> questions = ['name', 'quest', 'favorite color'] >>> answers = ['lancelot', 'the holy grail', 'blue'] >>> for q, a in zip(questions, answers): ... print('What is your {0}? It is {1}.'.format(q, a)) ... What is your name? It is lancelot. What is your quest? It is the holy grail. What is your favorite color? It is blue.
sv: >>> frågor = ['namn', 'uppdrag', 'favoritfärg'] >>> svar = ['lancelot', 'den heliga graal', 'blå'] >>> svar = ['lancelot', 'den heliga graalen', 'blå'] >>> för q, a i zip(frågor, svar): ... print('Vad är din {0}? Det är {1}.'.format(q, a)) ... Vad är ditt namn? Det är lancelot. Vad är ditt uppdrag? Det är den heliga graalen. Vilken är din favoritfärg? Den är blå.

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
sv: För att loopa över en sekvens i omvänd riktning anger du först sekvensen i framåtriktad riktning och anropar sedan funktionen :func:`reversed`. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
sv: För att loopa över en sekvens i sorterad ordning, använd funktionen :func:`sorted` som returnerar en ny sorterad lista medan källan lämnas oförändrad. ::

source: >>> basket = ['apple', 'orange', 'apple', 'pear', 'orange', 'banana'] >>> for i in sorted(basket): ... print(i) ... apple apple banana orange orange pear
sv: >>> korg = ['äpple', 'apelsin', 'äpple', 'päron', 'apelsin', 'banan'] >>> i >>> för i i sorterad(korg): ... print(i) ... äpple äpple banan apelsin apelsin päron

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
sv: Genom att använda :func:`set` på en sekvens elimineras duplicerade element. Användningen av :func:`sorted` i kombination med :func:`set` över en sekvens är ett idiomatiskt sätt att loopa över unika element i sekvensen i sorterad ordning. ::

source: >>> basket = ['apple', 'orange', 'apple', 'pear', 'orange', 'banana'] >>> for f in sorted(set(basket)): ... print(f) ... apple banana orange pear
sv: >>> korg = ['äpple', 'apelsin', 'äpple', 'päron', 'apelsin', 'banan'] >>> f >>> for f in sorted(set(korg)): ... print(f) ... äpple banan apelsin päron

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
sv: Det är ibland frestande att ändra i en lista medan man går igenom den, men det är ofta enklare och säkrare att skapa en ny lista istället:

source: >>> import math >>> raw_data = [56.2, float('NaN'), 51.7, 55.3, 52.5, float('NaN'), 47.8] >>> filtered_data = [] >>> for value in raw_data: ... if not math.isnan(value): ... filtered_data.append(value) ... >>> filtered_data [56.2, 51.7, 55.3, 52.5, 47.8]
sv: >>> import matematik >>> rådata = [56,2, float('NaN'), 51,7, 55,3, 52,5, float('NaN'), 47,8] >>> filtrerade_data = [] >>> för värde i rå_data: ... if not math.isnan(värde): ... filtrerad_data.append(värde) ... >>> filtrerad_data [56.2, 51.7, 55.3, 52.5, 47.8]

source: More on Conditions
sv: Mer om villkor

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
sv: De villkor som används i ``while`` och ``if``-satser kan innehålla alla operatorer, inte bara jämförelser.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
sv: Jämförelseoperatorerna ``in`` och ``not in`` är medlemskapstester som avgör om ett värde finns i (eller inte finns i) en container. Operatorerna ``is`` och ``is not`` jämför om två objekt verkligen är samma objekt. Alla jämförelseoperatorer har samma prioritet, som är lägre än för alla numeriska operatorer.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
sv: Jämförelser kan kedjas. Till exempel testar ``a < b == c`` om ``a`` är mindre än ``b`` och dessutom om ``b`` är lika med ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
sv: Jämförelser kan kombineras med hjälp av de booleska operatorerna ``och`` och ``eller``, och resultatet av en jämförelse (eller av något annat booleskt uttryck) kan negeras med ``not``. Dessa har lägre prioritet än jämförelseoperatorer; mellan dem har ``not`` högst prioritet och ``or`` lägst, så att ``A och inte B eller C`` är ekvivalent med ``(A och (inte B)) eller C``. Som alltid kan parenteser användas för att uttrycka den önskade sammansättningen.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
sv: De booleska operatorerna ``och`` och ``eller`` är så kallade *kortslutningsoperatorer*: deras argument utvärderas från vänster till höger, och utvärderingen avslutas så snart resultatet har bestämts. Om t.ex. ``A`` och ``C`` är sanna men ``B`` är falsk, utvärderar ``A och B och C`` inte uttrycket ``C``. När en kortslutningsoperator används som ett allmänt värde och inte som en booleansk operator, är returvärdet det senast utvärderade argumentet.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
sv: Det är möjligt att tilldela resultatet av en jämförelse eller ett annat booleskt uttryck till en variabel. Till exempel ::

source: >>> string1, string2, string3 = '', 'Trondheim', 'Hammer Dance' >>> non_null = string1 or string2 or string3 >>> non_null 'Trondheim'
sv: >>> string1, string2, string3 = '', 'Trondheim', 'Hammer Dance' >>> non_null = sträng1 eller sträng2 eller sträng3 >>> non_null "Trondheim

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
sv: Observera att i Python, till skillnad från C, måste tilldelning inuti uttryck göras explicit med :ref:`walrus-operatorn <why-can-t-i-use-an-assignment-in-an-expression>``:=``. Detta undviker en vanlig typ av problem som uppstår i C-program: att skriva ``=`` i ett uttryck när ``==`` var avsett.

source: Comparing Sequences and Other Types
sv: Jämförelse mellan sekvenser och andra typer

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
sv: Sekvensobjekt kan typiskt sett jämföras med andra objekt av samma sekvenstyp. Jämförelsen använder *lexikografisk* ordning: först jämförs de två första objekten, och om de skiljer sig åt avgör detta resultatet av jämförelsen; om de är lika jämförs nästa två objekt, och så vidare tills någon av sekvenserna är uttömd. Om två objekt som ska jämföras själva är sekvenser av samma typ, utförs den lexikografiska jämförelsen rekursivt. Om alla element i två sekvenser jämförs lika, anses sekvenserna vara lika. Om den ena sekvensen är en initial subsekvens av den andra, är den kortare sekvensen den mindre (lesser). Lexikografisk ordning för strängar använder Unicodes kodpunktsnummer för att ordna enskilda tecken. Några exempel på jämförelser mellan sekvenser av samma typ::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
sv: Observera att det är lagligt att jämföra objekt av olika typer med ``<`` eller ``>``, förutsatt att objekten har lämpliga jämförelsemetoder. Till exempel jämförs blandade numeriska typer enligt deras numeriska värde, så 0 är lika med 0,0 osv. Annars kommer tolken, i stället för att tillhandahålla en godtycklig ordning, att ge upphov till ett :exc:`TypeError`-undantag.

source: Footnotes
sv: Fotnoter

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
sv: Andra språk kan returnera det muterade objektet, vilket möjliggör metodkedjor, till exempel ``d->insert("a")->remove("b")->sort();``.
