Repository: yeager/python-docs-sv
Catalog: tutorial/datastructures.po
Languages: sv

source: Data Structures
sv: Datastrukturer

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
sv: I det här kapitlet beskrivs vissa saker som du redan har lärt dig mer ingående, och några nya saker läggs till.

source: More on Lists
sv: Mer om listor

source: The list data type has some more methods. Here are all of the methods of list objects:
sv: Datatypen list har några fler metoder. Här är alla metoder för listobjekt:

source: Add an item to the end of the list. Similar to ``a[len(a):] = [x]``.
sv: Lägger till ett objekt i slutet av listan. Liknar ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Similar to ``a[len(a):] = iterable``.
sv: Förläng listan genom att lägga till alla objekt från iterabeln. Liknar ``a[len(a):] = iterabel``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
sv: Infoga ett element på en given position. Det första argumentet är indexet för det element som ska infogas före, så ``a.insert(0, x)`` infogar längst fram i listan, och ``a.insert(len(a), x)`` är likvärdigt med ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
sv: Tar bort det första objektet från listan vars värde är lika med *x*. Det ger upphov till ett :exc:`ValueError` om det inte finns något sådant objekt.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. It raises an :exc:`IndexError` if the list is empty or the index is outside the list range.
sv: Tar bort objektet på den angivna positionen i listan och returnerar det. Om inget index anges, tar ``a.pop()`` bort och returnerar det sista objektet i listan. Den ger upphov till ett :exc:`IndexError` om listan är tom eller om indexet ligger utanför listintervallet.

source: Remove all items from the list. Similar to ``del a[:]``.
sv: Ta bort alla objekt från listan. Påminner om ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
sv: Returnerar nollbaserat index i listan för det första objektet vars värde är lika med *x*. Utlöser ett :exc:`ValueError` om det inte finns något sådant objekt.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
sv: De valfria argumenten *start* och *end* tolkas som i slice-notationen och används för att begränsa sökningen till en viss delsekvens av listan. Det returnerade indexet beräknas i förhållande till början av den fullständiga sekvensen i stället för argumentet *start*.

source: Return the number of times *x* appears in the list.
sv: Returnera antalet gånger *x* förekommer i listan.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
sv: Sortera objekten i listan på plats (argumenten kan användas för att anpassa sorteringen, se :func:`sorted` för deras förklaring).

source: Reverse the elements of the list in place.
sv: Backa tillbaka elementen i listan på plats.

source: Return a shallow copy of the list. Similar to ``a[:]``.
sv: Returnerar en ytlig kopia av listan. Liknar ``a[:]``.

source: An example that uses most of the list methods::
sv: Ett exempel som använder de flesta av listans metoder::

source: >>> fruits = ['orange', 'apple', 'pear', 'banana', 'kiwi', 'apple', 'banana'] >>> fruits.count('apple') 2 >>> fruits.count('tangerine') 0 >>> fruits.index('banana') 3 >>> fruits.index('banana', 4) # Find next banana starting at position 4 6 >>> fruits.reverse() >>> fruits ['banana', 'apple', 'kiwi', 'banana', 'pear', 'apple', 'orange'] >>> fruits.append('grape') >>> fruits ['banana', 'apple', 'kiwi', 'banana', 'pear', 'apple', 'orange', 'grape'] >>> fruits.sort() >>> fruits ['apple', 'apple', 'banana', 'banana', 'grape', 'kiwi', 'orange', 'pear'] >>> fruits.pop() 'pear'
sv: >>> frukter = ['apelsin', 'äpple', 'päron', 'banan', 'kiwi', 'äpple', 'banan'] >>> frukter >>> frukter.räkna('äpple') 2 >>> frukter.räkning('mandarin') 0 >>> frukt.index('banan') 3 >>> fruits.index('banana', 4) # Hitta nästa banan med början vid position 4 6 >>> frukter.omvänd() >>> frukter ['banan', 'äpple', 'kiwi', 'banan', 'päron', 'äpple', 'apelsin'] >>> frukt.lägg till('druva') >>> frukter ['banan', 'äpple', 'kiwi', 'banan', 'päron', 'äpple', 'apelsin', 'druva'] >>> frukter.sortera() >>> frukter ['äpple', 'äpple', 'banan', 'banan', 'druva', 'kiwi', 'apelsin', 'päron'] >>> frukter.pop() "päron

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
sv: Du kanske har märkt att metoder som ``insert``, ``remove`` eller ``sort`` som bara ändrar listan inte har något returvärde utskrivet - de returnerar standardvärdet ``None``. [Detta är en designprincip för alla föränderliga datastrukturer i Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and ``None`` can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
sv: En annan sak som du kanske märker är att inte alla data kan sorteras eller jämföras. Till exempel sorterar inte ``[None, 'hello', 10]`` eftersom heltal inte kan jämföras med strängar och ``None`` inte kan jämföras med andra typer. Det finns också vissa typer som inte har någon definierad ordningsrelation. Till exempel är ``3+4j < 5+7j`` inte en giltig jämförelse.

source: Using Lists as Stacks
sv: Använda listor som staplar

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`!append`. To retrieve an item from the top of the stack, use :meth:`!pop` without an explicit index. For example::
sv: Listmetoderna gör det mycket enkelt att använda en lista som en stapel, där det sista elementet som läggs till är det första elementet som hämtas ("sist in, först ut"). För att lägga till ett element överst i stapeln, använd :meth:`!append`. För att hämta ett objekt från toppen av stacken, använd :meth:`!pop` utan ett explicit index. Till exempel::

source: >>> stack = [3, 4, 5] >>> stack.append(6) >>> stack.append(7) >>> stack [3, 4, 5, 6, 7] >>> stack.pop() 7 >>> stack [3, 4, 5, 6] >>> stack.pop() 6 >>> stack.pop() 5 >>> stack [3, 4]
sv: >>> stack = [3, 4, 5] >>> stack.lägg till(6) >>> stack.append(7) >>> stack [3, 4, 5, 6, 7] >>> stack.pop() 7 >>> stack [3, 4, 5, 6] >>> stapel.pop() 6 >>> stapel.pop() 5 >>> stapel [3, 4]

source: Using Lists as Queues
sv: Använda listor som köer

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
sv: Det är också möjligt att använda en lista som en kö, där det första elementet som läggs till är det första elementet som hämtas ("först in, först ut"); listor är dock inte effektiva för detta ändamål. Det går snabbt att lägga till och ta bort element från slutet av en lista, men det går långsamt att lägga till eller ta bort element från början av en lista (eftersom alla andra element måste flyttas med ett).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
sv: För att implementera en kö, använd :class:`collections.deque` som är utformad för att ha snabba appends och pops från båda ändar. Till exempel::

source: >>> from collections import deque >>> queue = deque(["Eric", "John", "Michael"]) >>> queue.append("Terry") # Terry arrives >>> queue.append("Graham") # Graham arrives >>> queue.popleft() # The first to arrive now leaves 'Eric' >>> queue.popleft() # The second to arrive now leaves 'John' >>> queue # Remaining queue in order of arrival deque(['Michael', 'Terry', 'Graham'])
sv: >>> from collections import deque >>> queue = deque(["Eric", "John", "Michael"]) >>> queue.append("Terry") # Terry anländer >>> queue.append("Graham") # Graham anländer >>> queue.popleft() # Den första som anländer lämnar nu "Eric >>> queue.popleft() # Den andre som anländer lämnar nu 'John' >>> queue # Återstående kö i ankomstordning deque(['Michael', 'Terry', 'Graham'])

source: List Comprehensions
sv: Listförståelse

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
sv: List Comprehensions ger ett kortfattat sätt att skapa listor. Vanliga tillämpningar är att skapa nya listor där varje element är resultatet av vissa operationer som tillämpas på varje medlem i en annan sekvens eller iterabel, eller att skapa en undersekvens av de element som uppfyller ett visst villkor.

source: For example, assume we want to create a list of squares, like::
sv: Anta till exempel att vi vill skapa en lista med kvadrater, till exempel::

source: >>> squares = [] >>> for x in range(10): ... squares.append(x**2) ... >>> squares [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
sv: >>> rutor = [] >>> för x i intervall(10): ... squares.append(x**2) ... >>> rutor [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
sv: Observera att detta skapar (eller skriver över) en variabel med namnet ``x`` som fortfarande existerar efter att slingan har avslutats. Vi kan beräkna listan med kvadrater utan några bieffekter med::

source: or, equivalently::
sv: eller, på motsvarande sätt::

source: which is more concise and readable.
sv: som är mer kortfattad och läsbar.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
sv: En list comprehension består av parenteser som innehåller ett uttryck följt av en :keyword:`!for`-klausul, sedan noll eller fler :keyword:`!for`- eller :keyword:`!if`-klausuler. Resultatet blir en ny lista som är resultatet av utvärderingen av uttrycket i kontexten av :keyword:`!for`- och :keyword:`!if`-klausulerna som följer efter det. Till exempel kombinerar denna listcomp elementen i två listor om de inte är lika::

source: and it's equivalent to::
sv: och det är likvärdigt med::

source: >>> combs = [] >>> for x in [1,2,3]: ... for y in [3,1,4]: ... if x != y: ... combs.append((x, y)) ... >>> combs [(1, 3), (1, 4), (2, 3), (2, 1), (2, 4), (3, 1), (3, 4)]
sv: >>> kammar = [] >>> för x i [1,2,3]: ... för y i [3,1,4]: ... if x != y: ... combs.append((x, y)) ... >>> kammar [(1, 3), (1, 4), (2, 3), (2, 1), (2, 4), (3, 1), (3, 4)]

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
sv: Observera att ordningen på :keyword:`for`- och :keyword:`if`-satserna är densamma i båda dessa utdrag.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
sv: Om uttrycket är en tupel (t.ex. ``(x, y)`` i föregående exempel) måste det vara inom parentes. ::

source: >>> vec = [-4, -2, 0, 2, 4] >>> # create a new list with the values doubled >>> [x*2 for x in vec] [-8, -4, 0, 4, 8] >>> # filter the list to exclude negative numbers >>> [x for x in vec if x >= 0] [0, 2, 4] >>> # apply a function to all the elements >>> [abs(x) for x in vec] [4, 2, 0, 2, 4] >>> # call a method on each element >>> freshfruit = [' banana', ' loganberry ', 'passion fruit '] >>> [weapon.strip() for weapon in freshfruit] ['banana', 'loganberry', 'passion fruit'] >>> # create a list of 2-tuples like (number, square) >>> [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] >>> # the tuple must be parenthesized, otherwise an error is raised >>> [x, x**2 for x in range(6)] File "<stdin>", line 1 [x, x**2 for x in range(6)] ^^^^^^^ SyntaxError: did you forget parentheses around the comprehension target? >>> # flatten a list using a listcomp with two 'for' >>> vec = [[1,2,3], [4,5,6], [7,8,9]] >>> [num for elem in vec for num in elem] [1, 2, 3, 4, 5, 6, 7, 8, 9]
sv: &gt;&gt;&gt; vec = [-4, -2, 0, 2, 4] &gt;&gt;&gt; # skapa en ny lista med de fördubblade värdena &gt;&gt;&gt; [x*2 för x i vec] [-8, -4, 0, 4, 8] &gt;&gt;&gt; # filtrera listan för att utesluta negativa tal &gt;&gt;&gt; [x for x in vec if x &gt;= 0] [0, 2, 4] &gt;&gt;&gt; # tillämpa en funktion på alla element &gt;&gt;&gt; [abs(x) för x i vec] [4, 2, 0, 2, 4] &gt;&gt;&gt; # anropa en metod på varje element &gt;&gt;&gt; freshfruit = ['banan', 'loganbär', 'passionsfrukt'] [weapon.strip() &gt;&gt;&gt; [vapen.strip() för vapen i färskfrukt] ['banana', 'loganberry', 'passionsfrukt'] &gt;&gt;&gt; # skapa en lista med 2-tuples som (nummer, kvadrat) &gt;&gt;&gt; [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] &gt;&gt;&gt; # tupeln måste vara parentetisk, annars uppstår ett fel &gt;&gt;&gt; [x, x**2 för x i intervall(6)] Fil "<stdin>", rad 1 [x, x**2 för x i intervall(6)] ^^^^^^^ SyntaxError: glömde du parenteser runt förståelsemålet? &gt;&gt;&gt; # platta till en lista med hjälp av en listcomp med två 'for' &gt;&gt;&gt; vec = [[1,2,3], [4,5,6], [7,8,9]] &gt;&gt;&gt; [num för elem i vec för num i elem] [1, 2, 3, 4, 5, 6, 7, 8, 9]

source: List comprehensions can contain complex expressions and nested functions::
sv: Listförståelser kan innehålla komplexa uttryck och nästlade funktioner::

source: Nested List Comprehensions
sv: Förståelse av nästlade listor

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
sv: Det första uttrycket i en listkomprehension kan vara vilket godtyckligt uttryck som helst, inklusive en annan listkomprehension.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
sv: Betrakta följande exempel på en 3x4-matris som implementerats som en lista med 3 listor med längden 4::

source: >>> matrix = [ ... [1, 2, 3, 4], ... [5, 6, 7, 8], ... [9, 10, 11, 12], ... ]
sv: >>> matris = [ ... [1, 2, 3, 4], ... [5, 6, 7, 8], ... [9, 10, 11, 12], ... ]

source: The following list comprehension will transpose rows and columns::
sv: Följande listförståelse kommer att transponera rader och kolumner::

source: >>> [[row[i] for row in matrix] for i in range(4)] [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
sv: >>> [[rad[i] för rad i matris] för i i intervall(4)] [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
sv: Som vi såg i föregående avsnitt utvärderas den inre listförståelsen i kontexten för det :keyword:`for` som följer efter den, så det här exemplet är likvärdigt med::

source: >>> transposed = [] >>> for i in range(4): ... transposed.append([row[i] for row in matrix]) ... >>> transposed [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
sv: >>> transposed = [] >>> för i i intervall(4): ... transposed.append([rad[i] för rad i matris]) ... >>> transposed [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: which, in turn, is the same as::
sv: vilket i sin tur är detsamma som::

source: >>> transposed = [] >>> for i in range(4): ... # the following 3 lines implement the nested listcomp ... transposed_row = [] ... for row in matrix: ... transposed_row.append(row[i]) ... transposed.append(transposed_row) ... >>> transposed [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
sv: >>> transposed = [] >>> för i i intervall(4): ... # följande 3 rader implementerar den nästlade listcomp ... transponerad_rad = [] ... för rad i matris: ... transposed_row.append(rad[i]) ... transposed.append(transposed_row) ... >>> transponering [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
sv: I den verkliga världen bör du föredra inbyggda funktioner framför komplexa flödesbeskrivningar. Funktionen :func:`zip` skulle göra ett bra jobb för detta användningsfall::

source: >>> list(zip(*matrix)) [(1, 5, 9), (2, 6, 10), (3, 7, 11), (4, 8, 12)]
sv: >>> list(zip(*matris)) [(1, 5, 9), (2, 6, 10), (3, 7, 11), (4, 8, 12)]

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
sv: Se :ref:`tut-unpacking-arguments` för detaljer om asterisken i den här raden.

source: The :keyword:`!del` statement
sv: :nyckelord:`!del`-satsen

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`!pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
sv: Det finns ett sätt att ta bort ett objekt från en lista genom att ange dess index istället för dess värde: :keyword:`del` statement. Detta skiljer sig från metoden :meth:`!pop` som returnerar ett värde. Satsen :keyword:`!del` kan också användas för att ta bort delar från en lista eller rensa hela listan (vilket vi gjorde tidigare genom att tilldela en tom lista till delen). Till exempel::

source: :keyword:`del` can also be used to delete entire variables::
sv: :keyword:`del` kan också användas för att radera hela variabler::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
sv: Att referera till namnet ``a`` i fortsättningen är ett fel (åtminstone tills ett annat värde tilldelas det). Vi kommer att hitta andra användningsområden för :keyword:`del` senare.

source: Tuples and Sequences
sv: Tupler och sekvenser

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
sv: Vi såg att listor och strängar har många gemensamma egenskaper, t.ex. indexerings- och skivningsoperationer. De är två exempel på *sekvens*-datatyper (se :ref:`typesseq`). Eftersom Python är ett språk under utveckling kan andra sekvensdatatyper komma att läggas till. Det finns också en annan standardsekvensdatatyp: *tuple*.

source: A tuple consists of a number of values separated by commas, for instance::
sv: En tuple består av ett antal värden som separeras med kommatecken, till exempel::

source: >>> t = 12345, 54321, 'hello!' >>> t[0] 12345 >>> t (12345, 54321, 'hello!') >>> # Tuples may be nested: >>> u = t, (1, 2, 3, 4, 5) >>> u ((12345, 54321, 'hello!'), (1, 2, 3, 4, 5)) >>> # Tuples are immutable: >>> t[0] = 88888 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'tuple' object does not support item assignment >>> # but they can contain mutable objects: >>> v = ([1, 2, 3], [3, 2, 1]) >>> v ([1, 2, 3], [3, 2, 1])
sv: &gt;&gt;&gt; t = 12345, 54321, "hej! &gt;&gt;&gt; t[0] 12345 &gt;&gt;&gt; t (12345, 54321, 'hej!') &gt;&gt;&gt; # Tuplar kan vara nästlade: &gt;&gt;&gt; u = t, (1, 2, 3, 4, 5) &gt;&gt;&gt; u ((12345, 54321, 'hallå!'), (1, 2, 3, 4, 5)) &gt;&gt;&gt; # Tuplar är oföränderliga: &gt;&gt;&gt; t[0] = 88888 Traceback (senaste anropet sist): Fil "<stdin>", rad 1, i <module> TypeError: 'tuple'-objektet stöder inte tilldelning av objekt &gt;&gt;&gt; # men de kan innehålla mutabla objekt: &gt;&gt;&gt; v = ([1, 2, 3], [3, 2, 1]) &gt;&gt;&gt; v ([1, 2, 3], [3, 2, 1])

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
sv: Som du ser är tupler alltid inneslutna i parenteser vid utmatning, så att nästlade tupler tolkas korrekt; de kan matas in med eller utan omgivande parenteser, även om parenteser ofta är nödvändiga ändå (om tupeln är en del av ett större uttryck). Det är inte möjligt att tilldela de enskilda objekten i en tupel, men det är möjligt att skapa tuplar som innehåller föränderliga objekt, t.ex. listor.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
sv: Även om tupler kan tyckas likna listor används de ofta i olika situationer och för olika syften. Tuples är :term:`immutable`, och innehåller vanligtvis en heterogen sekvens av element som nås via uppackning (se senare i detta avsnitt) eller indexering (eller till och med via attribut i fallet :func:`namedtuples <collections.namedtuple>`). Listor är :term:`mutabla`, och deras element är vanligtvis homogena och nås genom att iterera över listan.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
sv: Ett speciellt problem är konstruktionen av tupler som innehåller 0 eller 1 objekt: syntaxen har några extra finesser för att hantera dessa. Tomma tupler konstrueras med ett tomt par parenteser; en tupel med ett objekt konstrueras genom att följa ett värde med ett kommatecken (det räcker inte att omsluta ett enda värde med parenteser). Fult, men effektivt. Till exempel::
