Repository: yeager/python-docs-sv
Catalog: tutorial/inputoutput.po
Languages: sv

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
sv: Det är god praxis att använda nyckelordet :keyword:`with` när man hanterar filobjekt. Fördelen är att filen stängs på rätt sätt när dess svit är klar, även om ett undantag uppstår vid något tillfälle. Att använda :keyword:`!with` är också mycket kortare än att skriva motsvarande :keyword:`try`- :keyword:`finally`-block::

source: >>> with open('workfile', encoding="utf-8") as f: ... read_data = f.read() >>> # We can check that the file has been automatically closed. >>> f.closed True
sv: >>> med open('workfile', encoding="utf-8") som f: ... read_data = f.read() >>> # Vi kan kontrollera att filen har stängts automatiskt. >>> f.closed Sant

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
sv: Om du inte använder nyckelordet :keyword:`with` bör du anropa ``f.close()`` för att stänga filen och omedelbart frigöra alla systemresurser som används av den.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
sv: Anrop av ``f.write()`` utan att använda nyckelordet :keyword:`!with` eller anrop av ``f.close()`` **kan** resultera i att argumenten i ``f.write()`` inte skrivs ut fullständigt till disken, även om programmet avslutas framgångsrikt.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
sv: När ett filobjekt har stängts, antingen genom en :keyword:`with`-sats eller genom att anropa ``f.close()``, kommer försök att använda filobjektet automatiskt att misslyckas. ::

source: >>> f.close() >>> f.read() Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: I/O operation on closed file.
sv: &gt;&gt;&gt; f.stäng() &gt;&gt;&gt; f.read() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> ValueError (värdefel): I/O-operation på stängd fil.

source: Methods of File Objects
sv: Metoder för filobjekt

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
sv: I resten av exemplen i det här avsnittet förutsätts att ett filobjekt med namnet ``f`` redan har skapats.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
sv: För att läsa en fils innehåll, anropa ``f.read(size)``, som läser en viss mängd data och returnerar den som en sträng (i textläge) eller ett bytesobjekt (i binärt läge). *size* är ett valfritt numeriskt argument. När *size* utelämnas eller är negativt kommer hela filens innehåll att läsas och returneras; det är ditt problem om filen är dubbelt så stor som din maskins minne. Annars läses och returneras högst *size* tecken (i textläge) eller *size* byte (i binärt läge). Om slutet av filen har nåtts kommer ``f.read()`` att returnera en tom sträng (``''``). ::

source: >>> f.read() 'This is the entire file.\n' >>> f.read() ''
sv: >>> f.read() 'Detta är hela filen.\n' >>> f.read() ''

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
sv: ``f.readline()`` läser en enda rad från filen; ett tecken för ny rad (``\n``) lämnas i slutet av strängen och utelämnas endast på den sista raden i filen om filen inte slutar med en ny rad. Detta gör returvärdet otvetydigt; om ``f.readline()`` returnerar en tom sträng har slutet på filen nåtts, medan en tom rad representeras av ``'\n'``, en sträng som bara innehåller en enda ny rad. ::

source: >>> f.readline() 'This is the first line of the file.\n' >>> f.readline() 'Second line of the file\n' >>> f.readline() ''
sv: >>> f.readline() 'Detta är den första raden i filen.\n' >>> f.readline() 'Andra raden i filen\n' >>> f.readline() ''

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
sv: För att läsa rader från en fil kan du loopa över filobjektet. Detta är minnessnålt, snabbt och leder till enkel kod::

source: >>> for line in f: ... print(line, end='') ... This is the first line of the file. Second line of the file
sv: >>> för rad i f: ... print(rad, end='') ... Detta är den första raden i filen. Andra raden i filen

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
sv: Om du vill läsa alla rader i en fil i en lista kan du också använda ``list(f)`` eller ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
sv: ```f.write(string)``` skriver innehållet i *string* till filen och returnerar antalet tecken som skrivits. ::

source: >>> f.write('This is a test\n') 15
sv: >>> f.write('Detta är ett test\n') 15

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
sv: Andra typer av objekt måste konverteras - antingen till en sträng (i textläge) eller till ett bytesobjekt (i binärt läge) - innan de skrivs::

source: >>> value = ('the answer', 42) >>> s = str(value) # convert the tuple to string >>> f.write(s) 18
sv: >>> värde = ('svaret', 42) >>> s = str(värde) # konvertera tupeln till sträng >>> f.write(s) 18

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
sv: ``f.tell()`` returnerar ett heltal som anger filobjektets aktuella position i filen representerat som antal byte från början av filen i binärläge och ett opakt tal i textläge.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
sv: Om du vill ändra filobjektets position använder du ``f.seek(offset, whence)``. Positionen beräknas genom att lägga till *offset* till en referenspunkt; referenspunkten väljs med argumentet *whence*. Ett *whence*-värde på 0 mäter från början av filen, 1 använder den aktuella filpositionen och 2 använder slutet av filen som referenspunkt. *whence* kan utelämnas och har standardvärdet 0, vilket innebär att filens början används som referenspunkt. ::

source: >>> f = open('workfile', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Go to the 6th byte in the file 5 >>> f.read(1) b'5' >>> f.seek(-3, 2) # Go to the 3rd byte before the end 13 >>> f.read(1) b'd'
sv: >>> f = open('workfile', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Gå till den 6:e byten i filen 5 >>> f.read(1) b'5' >>> f.seek(-3, 2) # Gå till den 3:e byten före slutet 13 >>> f.read(1) b'd'

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
sv: I textfiler (som öppnas utan ``b`` i lägessträngen) tillåts endast sökningar relativt början av filen (undantaget är sökning till slutet av filen med ``seek(0, 2)``) och de enda giltiga *offset*-värdena är de som returneras från ``f.tell()``, eller noll. Alla andra *offset*-värden ger ett odefinierat beteende.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
sv: Filobjekt har några ytterligare metoder, t.ex. :meth:`~io.IOBase.isatty` och :meth:`~io.IOBase.truncate` som används mindre ofta; se Library Reference för en fullständig guide till filobjekt.

source: Saving structured data with :mod:`json`
sv: Spara strukturerad data med :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
sv: Strängar kan enkelt skrivas till och läsas från en fil. Siffror kräver lite mer ansträngning, eftersom metoden :meth:`~io.TextIOBase.read` bara returnerar strängar, som måste skickas till en funktion som :func:`int`, som tar en sträng som ``'123'`` och returnerar dess numeriska värde 123. När du vill spara mer komplexa datatyper som nästlade listor och lexikon blir det komplicerat att parsa och serialisera för hand.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
sv: I stället för att användarna ständigt måste skriva och felsöka kod för att spara komplicerade datatyper i filer, kan du med Python använda det populära datautbytesformatet `JSON (JavaScript Object Notation) <https://json.org>`_. Standardmodulen som kallas :mod:`json` kan ta Python-datahierarkier och konvertera dem till strängrepresentationer; denna process kallas :dfn:`serializing`. Att rekonstruera data från strängrepresentationen kallas :dfn:`deserializing`. Mellan serialisering och deserialisering kan strängen som representerar objektet ha lagrats i en fil eller data, eller skickats över en nätverksanslutning till någon avlägsen maskin.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
sv: JSON-formatet används ofta av moderna applikationer för att möjliggöra datautbyte. Många programmerare är redan bekanta med det, vilket gör det till ett bra val för interoperabilitet.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
sv: Om du har ett objekt ``x`` kan du visa dess JSON-strängrepresentation med en enkel kodrad::

source: >>> import json >>> x = [1, 'simple', 'list'] >>> json.dumps(x) '[1, "simple", "list"]'
sv: >>> import json >>> x = [1, 'enkel', 'lista'] >>> json.dumps(x) '[1, "enkel", "lista"]''

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
sv: En annan variant av funktionen :func:`~json.dumps`, som kallas :func:`~json.dump`, serialiserar helt enkelt objektet till en :term:`textfil`. Så om ``f`` är ett :term:`text file`-objekt som är öppet för skrivning kan vi göra så här::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
sv: För att avkoda objektet igen, om ``f`` är ett :term:`binärfil`- eller :term:`textfil`-objekt som har öppnats för läsning::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
sv: JSON-filer måste vara kodade i UTF-8. Använd ``encoding="utf-8"`` när du öppnar JSON-filen som en :term:`textfil` för både läsning och skrivning.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
sv: Denna enkla serialiseringsteknik kan hantera listor och ordböcker, men serialisering av godtyckliga klassinstanser i JSON kräver lite extra ansträngning. Referensen för modulen :mod:`json` innehåller en förklaring av detta.

source: :mod:`pickle` - the pickle module
sv: :mod:`pickle` - pickle-modulen

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
sv: I motsats till :ref:`JSON <tut-json>` är *pickle* ett protokoll som tillåter serialisering av godtyckligt komplexa Python-objekt. Som sådant är det specifikt för Python och kan inte användas för att kommunicera med applikationer skrivna på andra språk. Det är också osäkert som standard: deserialisering av pickle-data som kommer från en icke betrodd källa kan exekvera godtycklig kod om data har skapats av en skicklig angripare.

source: formatted string literal
sv: formaterad sträng bokstavlig

source: interpolated string literal
sv: interpolerad sträng bokstavlig

source: string
sv: sträng

source: formatted literal
sv: formaterad bokstav

source: interpolated literal
sv: interpolerad bokstavlig

source: f-string
sv: f-sträng

source: fstring
sv: fsträng

source: built-in function
sv: inbyggd funktion

source: open
sv: öppen

source: object
sv: objekt

source: file
sv: fil

source: module
sv: modul
