Repository: yeager/python-docs-sv
Catalog: tutorial/inputoutput.po
Languages: sv

source: Input and Output
sv: Inmatning och utmatning

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
sv: Det finns flera sätt att presentera utdata från ett program; data kan skrivas ut i en läsbar form eller skrivas till en fil för framtida användning. I detta kapitel diskuteras några av dessa möjligheter.

source: Fancier Output Formatting
sv: Mer avancerad utmatningsformatering

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`~io.TextIOBase.write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
sv: Hittills har vi stött på två sätt att skriva värden: *uttryckssatser* och funktionen :func:`print`. (Ett tredje sätt är att använda metoden :meth:`~io.TextIOBase.write` för filobjekt; standardutdatafilen kan refereras till som ``sys.stdout``. Se biblioteksreferensen för mer information om detta)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
sv: Ofta vill du ha mer kontroll över formateringen av dina utdata än att bara skriva ut mellanslagsseparerade värden. Det finns flera sätt att formatera utdata.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
sv: För att använda :ref:``formaterade stränglitteraler <tut-f-strings>`, börja en sträng med ``f`` eller ``F`` före det inledande citattecknet eller trippelcitationstecknet. Inuti denna sträng kan du skriva ett Python-uttryck mellan tecknen ``{`` och ``}`` som kan referera till variabler eller bokstavliga värden.

source: >>> year = 2016 >>> event = 'Referendum' >>> f'Results of the {year} {event}' 'Results of the 2016 Referendum'
sv: >>> år = 2016 >>> händelse = 'Folkomröstning' >>> f'Resultat av {year} {event}' "Resultat av folkomröstningen 2016

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted. In the following code block there are two examples of how to format variables:
sv: Metoden :meth:`str.format` för strängar kräver mer manuellt arbete. Du kommer fortfarande att använda ``{`` och ``}`` för att markera var en variabel ska ersättas och kan ge detaljerade formateringsdirektiv, men du måste också tillhandahålla den information som ska formateras. I följande kodblock finns två exempel på hur man formaterar variabler:

source: >>> yes_votes = 42_572_654 >>> total_votes = 85_705_149 >>> percentage = yes_votes / total_votes >>> '{:-9} YES votes {:2.2%}'.format(yes_votes, percentage) ' 42572654 YES votes 49.67%'
sv: >>> ja_röster = 42_572_654 >>> totalt antal röster = 85_705_149 >>> procent = ja_röster / totala_röster >>> '{:-9} JA-röster {:2.2%}'.format(yes_votes, procent) ' 42572654 JA-röster 49,67%'

source: Notice how the ``yes_votes`` are padded with spaces and a negative sign only for negative numbers. The example also prints ``percentage`` multiplied by 100, with 2 decimal places and followed by a percent sign (see :ref:`formatspec` for details).
sv: Lägg märke till hur ``yes_votes`` fylls i med mellanslag och ett negativt tecken endast för negativa tal. I exemplet skrivs även ``procent`` ut multiplicerat med 100, med 2 decimaler och följt av ett procenttecken (se :ref:`formatspec` för detaljer).

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
sv: Slutligen kan du göra all stränghantering själv genom att använda strängskärning och konkatenering för att skapa vilken layout du än kan tänka dig. Strängtypen har några metoder som utför användbara operationer för att fylla ut strängar till en given kolumnbredd.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
sv: Om du inte behöver några avancerade utdata utan bara vill ha en snabb visning av några variabler för felsökning kan du konvertera valfritt värde till en sträng med funktionerna :func:`repr` eller :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
sv: Funktionen :func:`str` är tänkt att returnera representationer av värden som är någorlunda läsbara för människor, medan :func:`repr` är tänkt att generera representationer som kan läsas av tolken (eller tvinga fram ett :exc:`SyntaxError` om det inte finns någon motsvarande syntax). För objekt som inte har en särskild representation för mänsklig konsumtion, kommer :func:`str` att returnera samma värde som :func:`repr`. Många värden, t.ex. tal eller strukturer som listor och ordböcker, har samma representation med båda funktionerna. Strängar, i synnerhet, har två olika representationer.

source: Some examples::
sv: Några exempel::

source: >>> s = 'Hello, world.' >>> str(s) 'Hello, world.' >>> repr(s) "'Hello, world.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'The value of x is ' + repr(x) + ', and y is ' + repr(y) + '...' >>> print(s) The value of x is 32.5, and y is 40000... >>> # The repr() of a string adds string quotes and backslashes: >>> hello = 'hello, world\n' >>> hellos = repr(hello) >>> print(hellos) 'hello, world\n' >>> # The argument to repr() may be any Python object: >>> repr((x, y, ('spam', 'eggs'))) "(32.5, 40000, ('spam', 'eggs'))"
sv: >>> s = "Hej, världen >>> str(s) "Hej, världen >>> repr(s) "'Hej, världen.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'Värdet på x är ' + repr(x) + ', och y är ' + repr(y) + '...' >>> print(s) Värdet på x är 32,5 och y är 40000... >>> # repr() av en sträng lägger till strängcitat och backslash: >>> hallå = 'hallå, världen\n' >>> hellos = repr(hello) >>> print(hellos) 'hej, världen\n' >>> # Argumentet till repr() kan vara vilket Python-objekt som helst: >>> repr((x, y, ('spam', 'ägg'))) "(32,5, 40000, ('spam', 'ägg'))"

source: The :mod:`string` module also contains support for so-called :ref:`$-strings <template-strings-pep292>` that offer yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary. This syntax is easy to use, although it offers much less control of the formatting.
sv: Modulen :mod:`string` innehåller också stöd för så kallade :ref:`$-strings <template-strings-pep292>` som erbjuder ännu ett sätt att ersätta värden i strängar, genom att använda platshållare som ``$x`` och ersätta dem med värden från en ordbok. Den här syntaxen är enkel att använda, även om den ger mycket mindre kontroll över formateringen.

source: Formatted String Literals
sv: Formaterade strängbokstäver

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
sv: :ref:`Formaterade stränglitteraler <f-strings>` (även kallade f-strängar i korthet) låter dig inkludera värdet av Python-uttryck inuti en sträng genom att prefixera strängen med ``f`` eller ``F`` och skriva uttryck som ``{expression}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
sv: En valfri formatspecifikator kan följa efter uttrycket. Detta ger större kontroll över hur värdet formateras. I följande exempel avrundas pi till tre ställen efter decimalen::

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
sv: Om du skickar ett heltal efter ``':'`` blir fältet minst ett antal tecken brett. Detta är användbart för att få kolumner att rada upp sig. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for name, phone in table.items(): ... print(f'{name:10} ==> {phone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678
sv: >>> tabell = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for name, phone in table.items(): ... print(f'{name:10} ==> {phone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
sv: Andra modifierare kan användas för att konvertera värdet innan det formateras. ``'!a'`` tillämpar :func:`ascii`, ``'!s'`` tillämpar :func:`str`, och ``'!r'`` tillämpar :func:`repr`::

source: >>> animals = 'eels' >>> print(f'My hovercraft is full of {animals}.') My hovercraft is full of eels. >>> print(f'My hovercraft is full of {animals!r}.') My hovercraft is full of 'eels'.
sv: >>> djur = 'ålar' >>> print(f'Min svävare är full av {animals}.') Min svävare är full av ålar. >>> print(f'Min svävare är full av {animals!r}.') Min svävare är full av 'ålar'.

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression:
sv: Specificeraren ``=`` kan användas för att expandera ett uttryck till texten i uttrycket, ett likhetstecken och sedan representationen av det utvärderade uttrycket:

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
sv: Se :ref:``self-documenting expressions <bpo-36817-whatsnew>` för mer information om ``=`` specifikatorn. För en referens om dessa formatspecifikationer, se referensguiden för :ref:`formatspec`.

source: The String format() Method
sv: Metoden String format()

source: Basic usage of the :meth:`str.format` method looks like this::
sv: Grundläggande användning av metoden :meth:`str.format` ser ut så här::

source: >>> print('We are the {} who say "{}!"'.format('knights', 'Ni')) We are the knights who say "Ni!"
sv: >>> print('Vi är de {} som säger "{}!"'.format('riddare', 'Ni')) Vi är riddarna som säger "Ni!"

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
sv: Parenteserna och tecknen inom dem (som kallas formatfält) ersätts med de objekt som skickas till metoden :meth:`str.format`. Ett tal inom parentes kan användas för att referera till positionen för det objekt som skickas till metoden :meth:`str.format`. ::

source: >>> print('{0} and {1}'.format('spam', 'eggs')) spam and eggs >>> print('{1} and {0}'.format('spam', 'eggs')) eggs and spam
sv: >>> print('{0} och {1}'.format('spam', 'ägg')) skräppost och ägg >>> print('{1} och {0}'.format('spam', 'ägg')) ägg och skräppost

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
sv: Om nyckelordsargument används i metoden :meth:`str.format` refereras till deras värden genom att använda argumentets namn. ::

source: >>> print('This {food} is {adjective}.'.format( ... food='spam', adjective='absolutely horrible')) This spam is absolutely horrible.
sv: >>> print('Den här {food} är {adjective}.'.format( ... mat='skräppost', adjektiv='helt fruktansvärt')) Detta skräppost är helt fruktansvärt.

source: Positional and keyword arguments can be arbitrarily combined::
sv: Positions- och nyckelordsargument kan kombineras godtyckligt::

source: >>> print('The story of {0}, {1}, and {other}.'.format('Bill', 'Manfred', ... other='Georg')) The story of Bill, Manfred, and Georg.
sv: >>> print('Berättelsen om {0}, {1} och {other}.'.format('Bill', 'Manfred', ... annan='Georg')) Berättelsen om Bill, Manfred och Georg.

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
sv: Om du har en riktigt lång formatsträng som du inte vill dela upp, skulle det vara bra om du kunde referera till variablerna som ska formateras med namn istället för med position. Detta kan göras genom att helt enkelt skicka dict och använda hakparenteser ``'[]'`` för att komma åt nycklarna. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
sv: >>> tabell = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(tabell)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
sv: Detta kan också göras genom att skicka ``table``-ordlistan som nyckelordsargument med ``**``-notationen. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
sv: >>> tabell = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables::
sv: Detta är särskilt användbart i kombination med den inbyggda funktionen :func:`vars`, som returnerar en ordbok som innehåller alla lokala variabler::

source: >>> table = {k: str(v) for k, v in vars().items()} >>> message = " ".join([f'{k}: ' + '{' + k +'};' for k in table.keys()]) >>> print(message.format(**table)) __name__: __main__; __doc__: None; __package__: None; __loader__: ...
sv: >>> table = {k: str(v) for k, v in vars().items()} >>> message = "".join([f'{k}: ' + '{' + k + '};' for k in table.keys()]) >>> meddelande = "".join([f'{k}: ' + '{' + k +'};' for k in table.keys()]) >>> print(meddelande.format(**tabell)) __namn__: __main__; __doc__: None; __package__: None; __loader__: ...

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
sv: Som exempel kan nämnas att följande rader ger en välordnad uppsättning kolumner med heltal och deras kvadrater och kuber::

source: >>> for x in range(1, 11): ... print('{0:2d} {1:3d} {2:4d}'.format(x, x*x, x*x*x)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
sv: >>> för x i intervall(1, 11): ... print('{0:2d} {1:3d} {2:4d}'.format(x, x*x, x*x*x)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
sv: För en fullständig översikt över strängformatering med :meth:`str.format`, se :ref:`formatstrings`.

source: Manual String Formatting
sv: Manuell strängformatering

source: Here's the same table of squares and cubes, formatted manually::
sv: Här är samma tabell med kvadrater och kuber, formaterad manuellt::

source: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note use of 'end' on previous line ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
sv: >>> för x i intervall(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Notera användningen av 'end' på föregående rad ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
sv: (Observera att ett mellanslag mellan varje kolumn lades till på grund av hur :func:`print` fungerar: den lägger alltid till mellanslag mellan sina argument)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
sv: Metoden :meth:`str.rjust` för strängobjekt högerjusterar en sträng i ett fält med en given bredd genom att fylla ut den med mellanslag till vänster. Det finns liknande metoder :meth:`str.ljust` och :meth:`str.center`. Dessa metoder skriver inte något, de returnerar bara en ny sträng. Om indatasträngen är för lång trunkerar de den inte utan returnerar den oförändrad; detta kommer att röra till din kolumnlayout men det är vanligtvis bättre än alternativet, vilket skulle vara att ljuga om ett värde. (Om du verkligen vill ha trunkering kan du alltid lägga till en slice-operation, som i ``x.ljust(n)[:n]``)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
sv: Det finns en annan metod, :meth:`str.zfill`, som fyller ut en numerisk sträng till vänster med nollor. Den förstår sig på plus- och minustecken::

source: Old string formatting
sv: Gammal strängformatering

source: The % operator (modulo) can also be used for string formatting. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. This operation is commonly known as string interpolation. For example::
sv: % operatorn (modulo) kan också användas för strängformatering. Givet ``format % värden`` (där *format* är en sträng), ersätts ``%`` konverteringsspecifikationer i *format* med noll eller flera element i *värden*. Denna operation är allmänt känd som stränginterpolation. Till exempel::

source: More information can be found in the :ref:`old-string-formatting` section.
sv: Mer information finns i avsnittet :ref:`old-string-formatting`.

source: Reading and Writing Files
sv: Läsa och skriva filer

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
sv: :func:`open` returnerar ett :term:`file-objekt`, och används oftast med två positionella argument och ett nyckelordsargument: ``open(filnamn, mode, encoding=None)``

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
sv: Det första argumentet är en sträng som innehåller filnamnet. Det andra argumentet är en annan sträng som innehåller några tecken som beskriver hur filen ska användas. *mode* kan vara ``'r'`` om filen bara ska läsas, ``'w'`` om den bara ska skrivas (en befintlig fil med samma namn raderas), och ``'a'`` öppnar filen för tillägg; all data som skrivs till filen läggs automatiskt till i slutet. ``'r+'`` öppnar filen för både läsning och skrivning. Argumentet *mode* är valfritt; ``'r'`` kommer att antas om det utelämnas.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
sv: Normalt öppnas filer i :dfn:`text mode`, vilket innebär att du läser och skriver strängar från och till filen, som är kodade i en specifik *encoding*. Om *encoding* inte anges är standardinställningen plattformsberoende (se :func:`open`). Eftersom UTF-8 är den moderna de-facto-standarden rekommenderas ``encoding="utf-8"`` om du inte vet att du behöver använda en annan kodning. Genom att lägga till ``'b'`` till mode öppnas filen i :dfn:`binary mode`. Data i binärt läge läses och skrivs som :class:`bytes`-objekt. Du kan inte ange *kodning* när du öppnar en fil i binärt läge.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
sv: I textläge är standardinställningen vid läsning att konvertera plattformsspecifika radavslutningar (``\n`` på Unix, ``\r\n`` på Windows) till bara ``\n``. När du skriver i textläge är standardinställningen att konvertera förekomster av ``\n`` tillbaka till plattformsspecifika radavslut. Denna bakomliggande modifiering av fildata är bra för textfiler, men kommer att korrumpera binära data som i :file:`JPEG`- eller :file:`EXE`-filer. Var mycket försiktig med att använda binärt läge när du läser och skriver sådana filer.
