Repository: yeager/python-docs-sv
Catalog: tutorial/interpreter.po
Languages: sv

source: Using the Python Interpreter
sv: Använda Pythons tolkprogram

source: Invoking the Interpreter
sv: Anropa tolken

source: The Python interpreter is usually installed as |usr_local_bin_python_x_dot_y_literal| on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
sv: Python-tolken är vanligtvis installerad som |usr_local_bin_python_x_dot_y_literal| på de maskiner där den är tillgänglig; om du lägger till :file:`/usr/local/bin` i sökvägen för ditt Unix-skal kan du starta den genom att skriva kommandot:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
sv: till skalet. [#]_ Eftersom valet av katalog där tolken bor är ett installationsalternativ, är andra platser möjliga; kolla med din lokala Python-guru eller systemadministratör. (T.ex. är :file:`/usr/local/python` en populär alternativ plats)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the |python_x_dot_y_literal| command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
sv: På Windows-maskiner där du har installerat Python från :ref:`Microsoft Store <windows-store>`, kommer kommandot |python_x_dot_y_literal| att vara tillgängligt. Om du har :ref:`py.exe launcher <launcher>` installerat kan du använda kommandot :file:`py`. Se :ref:`setting-envvars` för andra sätt att starta Python.

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
sv: Om du skriver ett tecken för slutet av filen (:kbd:`Control-D` på Unix, :kbd:`Control-Z` på Windows) vid den primära prompten avslutas tolken med utgångsstatus noll. Om det inte fungerar kan du avsluta tolken genom att skriva följande kommando: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
sv: Tolkens funktioner för radredigering inkluderar interaktiv redigering, historikersättning och kodkomplettering på system som stöder biblioteket `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_. Den kanske snabbaste kontrollen för att se om kommandoradsredigering stöds är att skriva :kbd:`Control-P` till den första Python-prompten du får. Om det piper har du kommandoradsredigering; se Appendix :ref:`tut-interacting` för en introduktion till tangenterna. Om ingenting verkar hända, eller om ``^P`` ekas, är kommandoradsredigering inte tillgänglig; du kan bara använda backspace för att ta bort tecken från den aktuella raden.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
sv: Tolken fungerar ungefär som Unix-skalet: när den anropas med standardinmatning ansluten till en tty-enhet läser och utför den kommandon interaktivt; när den anropas med ett filnamnsargument eller med en fil som standardinmatning läser och utför den ett *skript* från den filen.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety.
sv: Ett annat sätt att starta tolken är ``python -c command [arg] ...``, som exekverar satsen/satserna i *command*, på samma sätt som skalets :option:`-c`. Eftersom Python-satser ofta innehåller mellanslag eller andra tecken som är speciella för skalet, är det oftast lämpligt att citera *command* i sin helhet.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
sv: Vissa Python-moduler är också användbara som skript. Dessa kan anropas med ``python -m module [arg] ...``, som exekverar källfilen för *module* som om du hade stavat ut hela namnet på kommandoraden.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
sv: När en skriptfil används är det ibland användbart att kunna köra skriptet och gå in i interaktivt läge efteråt. Detta kan göras genom att skicka :option:`-i` före skriptet.

source: All command line options are described in :ref:`using-on-general`.
sv: Alla kommandoradsalternativ beskrivs i :ref:`using-on-general`.

source: Argument Passing
sv: Överföring av argument

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
sv: När tolken känner till skriptnamnet och de ytterligare argument som följer omvandlas de till en lista med strängar och tilldelas variabeln ``argv`` i modulen ``sys``. Du kan komma åt den här listan genom att köra ``import sys``. Längden på listan är minst ett; när inget skript och inga argument anges är ```sys.argv[0]`` en tom sträng. När skriptnamnet anges som ``'-'`` (vilket betyder standardinmatning), sätts ``sys.argv[0]`` till ``'-'``. När :option:`-c` *kommando* används, sätts ``sys.argv[0]`` till ``'-c'``. När :option:`-m` *module* används, sätts ``sys.argv[0]`` till det fullständiga namnet på den modul som finns. Alternativ som hittas efter :option:`-c` *kommando* eller :option:`-m` *modul* används inte av Python-tolkens alternativbehandling utan lämnas kvar i ``sys.argv`` för kommandot eller modulen att hantera.

source: Interactive Mode
sv: Interaktivt läge

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
sv: När kommandon läses från en tty sägs tolken befinna sig i *interaktivt läge*. I detta läge frågar den efter nästa kommando med den *primära prompten*, vanligtvis tre större-än-tecken (``>>>``); för fortsättningsrader frågar den med den *sekundära prompten*, som standard tre punkter (``...``). Tolken skriver ut ett välkomstmeddelande med versionsnummer och ett copyrightmeddelande innan den första prompten skrivs ut:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
sv: Fortsättningsrader behövs när du skriver in en konstruktion med flera rader. Som ett exempel, ta en titt på detta :keyword:`if`-sats::

source: >>> the_world_is_flat = True >>> if the_world_is_flat: ... print("Be careful not to fall off!") ... Be careful not to fall off!
sv: >>> the_world_is_flat = True >>> if the_world_is_flat: ... print("Var försiktig så att du inte ramlar av!") ... Var försiktig så att du inte ramlar av!

source: For more on interactive mode, see :ref:`tut-interac`.
sv: För mer information om interaktivt läge, se :ref:`tut-interac`.

source: The Interpreter and Its Environment
sv: Tolken och dess omgivning

source: Source Code Encoding
sv: Kodning av källkod

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
sv: Som standard behandlas Python-källfiler som kodade i UTF-8. I den kodningen kan tecken från de flesta språk i världen användas samtidigt i stränglitteraler, identifierare och kommentarer --- även om standardbiblioteket endast använder ASCII-tecken för identifierare, en konvention som all portabel kod bör följa. För att kunna visa alla dessa tecken på rätt sätt måste din editor känna igen att filen är UTF-8 och använda ett typsnitt som stöder alla tecken i filen.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
sv: För att deklarera en annan kodning än standardkodningen måste en speciell kommentarrad läggas till som *första* rad i filen. Syntaxen är som följer::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
sv: där *encoding* är en av de giltiga :mod:`codecs` som stöds av Python.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
sv: Om du t.ex. vill ange att Windows-1252-kodning ska användas ska den första raden i källkodsfilen vara::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
sv: Ett undantag från *första raden*-regeln är när källkoden börjar med en :ref:`UNIX "shebang"-rad <tut-scripts>`. I så fall ska kodningsdeklarationen läggas till som andra rad i filen. Till exempel::

source: Footnotes
sv: Fotnoter

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
sv: På Unix installeras Python 3.x-tolken som standard inte med den körbara filen med namnet ``python``, så att den inte hamnar i konflikt med en samtidigt installerad Python 2.x-körbar fil.
