Repository: yeager/python-docs-sv
Catalog: tutorial/introduction.po
Languages: sv

source: An Informal Introduction to Python
sv: En informell introduktion till Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
sv: I följande exempel skiljer sig inmatning och utmatning åt genom förekomst eller frånvaro av prompter (:term:`>>>` och :term:`...`): för att upprepa exemplet måste du skriva allt efter prompten, när prompten visas; rader som inte börjar med en prompt matas ut från tolken. Observera att en sekundär prompt på en egen rad i ett exempel innebär att du måste skriva en tom rad; detta används för att avsluta ett kommando med flera rader.

source: You can use the "Copy" button (it appears in the upper-right corner when hovering over or tapping a code example), which strips prompts and omits output, to copy and paste the input lines into your interpreter.
sv: Du kan använda knappen "Kopiera" (den visas i det övre högra hörnet när du håller muspekaren över eller trycker på ett kodexempel), som tar bort uppmaningar och utelämnar utdata, för att kopiera och klistra in inmatningsraderna i din tolk.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
sv: Många av exemplen i den här handboken, även de som skrivs in i den interaktiva prompten, innehåller kommentarer. Kommentarer i Python börjar med hashtecknet, ``#``, och sträcker sig till slutet av den fysiska raden. En kommentar kan förekomma i början av en rad eller efter blanksteg eller kod, men inte inom en stränglitteral. Ett hash-tecken inom en stränglitual är bara ett hash-tecken. Eftersom kommentarer är till för att förtydliga koden och inte tolkas av Python, kan de utelämnas när du skriver in exempel.

source: Some examples::
sv: Några exempel::

source: # this is the first comment spam = 1 # and this is the second comment # ... and now a third! text = "# This is not a comment because it's inside quotes."
sv: # detta är den första kommentaren spam = 1 # och det här är den andra kommentaren # ... och nu en tredje! text = "# Det här är inte en kommentar eftersom den är inom citationstecken."

source: Using Python as a Calculator
sv: Använda Python som kalkylator

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
sv: Låt oss prova några enkla Python-kommandon. Starta tolken och vänta på den första prompten, ``>>>``. (Det borde inte ta lång tid.)

source: Numbers
sv: Nummer

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` can be used to perform arithmetic; parentheses (``()``) can be used for grouping. For example::
sv: Tolken fungerar som en enkel miniräknare: du kan skriva in ett uttryck i den och den skriver ut värdet. Uttryckets syntax är enkel: operatorerna ``+``, ``-``, ``*`` och ``/`` kan användas för att utföra aritmetik; parenteser (``()``) kan användas för gruppering. Till exempel::

source: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # division always returns a floating-point number 1.6
sv: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # division returnerar alltid ett flyttal 1.6

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
sv: Heltalen (t.ex. ``2``, ``4``, ``20``) har typen :class:`int`, de med en bråkdel (t.ex. ``5,0``, ``1,6``) har typen :class:`float`. Vi kommer att se mer om numeriska typer senare i handledningen.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
sv: Division (``/``) returnerar alltid en float. För att göra :term:`floor division` och få ett heltalsresultat kan du använda operatorn ``//``; för att beräkna resten kan du använda ``%``::

source: >>> 17 / 3 # classic division returns a float 5.666666666666667 >>> >>> 17 // 3 # floor division discards the fractional part 5 >>> 17 % 3 # the % operator returns the remainder of the division 2 >>> 5 * 3 + 2 # floored quotient * divisor + remainder 17
sv: >>> 17 / 3 # klassisk division returnerar en flottör 5.666666666666667 >>> >>> 17 // 3 # golvdelning kasserar den bråkiga delen 5 >>> 17 % 3 # % operatorn returnerar återstoden av divisionen 2 >>> 5 * 3 + 2 # golvkvot * divisor + rest 17

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
sv: Med Python är det möjligt att använda operatorn ``**`` för att beräkna potenser [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
sv: Likhetstecknet (``=``) används för att tilldela en variabel ett värde. Därefter visas inget resultat före nästa interaktiva prompt::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
sv: Om en variabel inte är "definierad" (tilldelad ett värde) får du ett felmeddelande när du försöker använda den::

source: >>> n # try to access an undefined variable Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'n' is not defined
sv: &gt;&gt;&gt; n # försök att komma åt en odefinierad variabel Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> NameError: namnet 'n' är inte definierat

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
sv: Det finns fullt stöd för flyttal; operatorer med operander av blandad typ konverterar heltalsoperanden till flyttal::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
sv: I interaktivt läge tilldelas det senast utskrivna uttrycket till variabeln ``_``. Detta innebär att när du använder Python som en skrivbordsräknare, är det något lättare att fortsätta beräkningar, till exempel::

source: >>> tax = 12.5 / 100 >>> price = 100.50 >>> price * tax 12.5625 >>> price + _ 113.0625 >>> round(_, 2) 113.06
sv: >>> skatt = 12,5 / 100 >>> pris = 100,50 >>> pris * skatt 12.5625 >>> pris + _ 113.0625 >>> runda(_, 2) 113.06

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
sv: Denna variabel bör behandlas som skrivskyddad av användaren. Tilldela inte uttryckligen ett värde till den --- du skulle skapa en oberoende lokal variabel med samma namn som maskerar den inbyggda variabeln med sitt magiska beteende.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
sv: Förutom :class:`int` och :class:`float` har Python stöd för andra typer av tal, till exempel :class:`~decimal.Decimal` och :class:`~fractions.Fraction`. Python har också inbyggt stöd för :ref:`komplexa tal <typesnumeric>`, och använder suffixet ``j`` eller ``J`` för att ange den imaginära delen (t.ex. ``3+5j``).

source: Python can manipulate text (represented by type :class:`str`, so-called "strings") as well as numbers. This includes characters "``!``", words "``rabbit``", names "``Paris``", sentences "``Got your back.``", etc. "``Yay! :)``". They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_.
sv: Python kan manipulera text (representerad av typen :class:`str`, s.k. "strängar") såväl som siffror. Detta inkluderar tecken "``!``", ord "``kanin``", namn "``Paris``", meningar "``Got your back.``", etc. "``Yay! :)``". De kan omslutas av enkla citattecken (``'...'``) eller dubbla citattecken (``"...'``) med samma resultat [#]_.

source: >>> 'spam eggs' # single quotes 'spam eggs' >>> "Paris rabbit got your back :)! Yay!" # double quotes 'Paris rabbit got your back :)! Yay!' >>> '1975' # digits and numerals enclosed in quotes are also strings '1975'
sv: >>> 'spamägg' # enkla citattecken 'spam ägg' >>> "Paris kanin har din rygg :)! Yay!" # dubbla citattecken "Paris kanin fick din rygg :)! Yay!' >>> '1975' # siffror och numeraler inom citationstecken är också strängar '1975'

source: To quote a quote, we need to "escape" it, by preceding it with ``\``. Alternatively, we can use the other type of quotation marks::
sv: För att citera ett citat måste vi "undkomma" det genom att föregå det med `````. Alternativt kan vi använda den andra typen av citattecken::

source: >>> 'doesn\'t' # use \' to escape the single quote... "doesn't" >>> "doesn't" # ...or use double quotes instead "doesn't" >>> '"Yes," they said.' '"Yes," they said.' >>> "\"Yes,\" they said." '"Yes," they said.' >>> '"Isn\'t," they said.' '"Isn\'t," they said.'
sv: >>> 'doesn\'t' # använd \' för att undkomma det enkla citatet ... "gör inte" >>> "gör inte" # ...eller använd dubbla citattecken istället "gör inte" >>> ''Ja,'' sa de.'' '"Ja," sa de.' >>> "\"Ja,\" sa de." '"Ja", sa de.' >>> ""Är inte", sa de." ""Är inte", sa de."

source: In the Python shell, the string definition and output string can look different. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
sv: I Python-skalet kan strängdefinitionen och utdatasträngen se olika ut. Funktionen :func:`print` ger en mer läsbar utdata genom att utelämna de omslutande citattecknen och skriva ut undangömda tecken och specialtecken::

source: >>> s = 'First line.\nSecond line.' # \n means newline >>> s # without print(), special characters are included in the string 'First line.\nSecond line.' >>> print(s) # with print(), special characters are interpreted, so \n produces new line First line. Second line.
sv: >>> s = 'Första raden.\nTvåa raden.' # \n betyder ny rad >>> s # utan print() inkluderas specialtecken i strängen "Första raden. \n Andra raden >>> print(s) # med print() tolkas specialtecken, så \n ger ny rad Första raden. Andra raden.

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
sv: Om du inte vill att tecken som inleds med ``\`` ska tolkas som specialtecken kan du använda *raw strings* genom att lägga till ett ``r`` före det första citatet::

source: >>> print('C:\some\name') # here \n means newline! C:\some ame >>> print(r'C:\some\name') # note the r before the quote C:\some\name
sv: >>> print('C:\some\name') # här betyder \n ny rad! C:\some ame >>> print(r'C:\some\name') # notera r:et före citatet C:\some\namn

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
sv: Det finns en subtil aspekt av råa strängar: en rå sträng får inte sluta med ett udda antal "``"-tecken; se :ref:`` FAQ-artikeln <faq-programming-raw-string-backslash>` för mer information och lösningar.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End-of-line characters are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. In the following example, the initial newline is not included::
sv: Stränglitteraler kan sträcka sig över flera rader. Ett sätt är att använda tredubbla citationstecken: ``"""...""""`` eller ``'''...'''``. Tecken i slutet av raden inkluderas automatiskt i strängen, men det är möjligt att förhindra detta genom att lägga till en ````` i slutet av raden. I följande exempel inkluderas inte den inledande nya linjen::

source: >>> print("""\ ... Usage: thingy [OPTIONS] ... -h Display this usage message ... -H hostname Hostname to connect to ... """) Usage: thingy [OPTIONS] -h Display this usage message -H hostname Hostname to connect to >>>
sv: >>> print("""\") ... Användning: thingy [ALTERNATIV] ... -h Visa detta användningsmeddelande ... -H hostname Värdnamn att ansluta till ... """) Användning: thingy [ALTERNATIV] -h Visa detta användningsmeddelande -H hostname Värdnamn att ansluta till >>>

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
sv: Strängar kan konkateneras (sammanfogas) med operatorn ``+`` och upprepas med ``*``::

source: >>> # 3 times 'un', followed by 'ium' >>> 3 * 'un' + 'ium' 'unununium'
sv: >>> # 3 gånger 'un', följt av 'ium' >>> 3 * 'un' + 'ium' 'ununununium'

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
sv: Två eller flera *stränglitteraler* (dvs. de som är inneslutna mellan citattecken) bredvid varandra konkateneras automatiskt. ::

source: This feature is particularly useful when you want to break long strings::
sv: Denna funktion är särskilt användbar när du vill bryta långa strängar::

source: >>> text = ('Put several strings within parentheses ' ... 'to have them joined together.') >>> text 'Put several strings within parentheses to have them joined together.'
sv: >>> text = ('Sätt flera strängar inom parentes ' ... 'för att få dem sammanfogade.') >>> text "Sätt flera strängar inom parentes för att få dem sammanfogade

source: This only works with two literals though, not with variables or expressions::
sv: Detta fungerar dock bara med två literaler, inte med variabler eller uttryck::

source: >>> prefix = 'Py' >>> prefix 'thon' # can't concatenate a variable and a string literal File "<stdin>", line 1 prefix 'thon' ^^^^^^ SyntaxError: invalid syntax >>> ('un' * 3) 'ium' File "<stdin>", line 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: invalid syntax
sv: &gt;&gt;&gt; prefix = 'Py' &gt;&gt;&gt; prefix 'thon' # kan inte konkatenera en variabel och en stränglitteral Fil "<stdin>", rad 1 prefix 'thon' ^^^^^^ SyntaxError: ogiltig syntax &gt;&gt;&gt; ('un' * 3) 'ium' Fil "<stdin>", rad 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: ogiltig syntax

source: If you want to concatenate variables or a variable and a literal, use ``+``::
sv: Om du vill sammanfoga variabler eller en variabel och en bokstav, använd ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
sv: Strängar kan *indexeras* (subskriberas), varvid det första tecknet har index 0. Det finns ingen separat teckentyp, utan ett tecken är helt enkelt en sträng av storleken ett::

source: >>> word = 'Python' >>> word[0] # character in position 0 'P' >>> word[5] # character in position 5 'n'
sv: >>> ord = 'Python' >>> word[0] # tecken i position 0 'P' >>> word[5] # tecken i position 5 'n'

source: Indices may also be negative numbers, to start counting from the right::
sv: Index kan också vara negativa tal, för att börja räkna från höger::

source: >>> word[-1] # last character 'n' >>> word[-2] # second-last character 'o' >>> word[-6] 'P'
sv: >>> word[-1] # sista tecknet 'n' >>> ord[-2] # näst sista tecknet 'o' >>> ord[-6] 'P'

source: Note that since -0 is the same as 0, negative indices start from -1.
sv: Observera att eftersom -0 är samma sak som 0, börjar negativa index från -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain a substring::
sv: Förutom indexering stöds även *slicing*. Medan indexering används för att få fram enskilda tecken, kan du med *slicing* få fram en delsträng::

source: >>> word[0:2] # characters from position 0 (included) to 2 (excluded) 'Py' >>> word[2:5] # characters from position 2 (included) to 5 (excluded) 'tho'
sv: >>> word[0:2] # tecken från position 0 (inkluderad) till 2 (exkluderad) 'Py' >>> ord[2:5] # tecken från position 2 (inkluderad) till 5 (exkluderad) 'tho'

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
sv: Slice-index har användbara standardvärden; ett utelämnat första index har standardvärdet noll, ett utelämnat andra index har standardvärdet storleken på den sträng som ska skivas:

source: >>> word[:2] # character from the beginning to position 2 (excluded) 'Py' >>> word[4:] # characters from position 4 (included) to the end 'on' >>> word[-2:] # characters from the second-last (included) to the end 'on'
sv: >>> word[:2] # tecken från början till position 2 (uteslutet) 'Py' >>> ord[4:] # tecken från position 4 (inkluderat) till slutet 'on' >>> ord[-2:] # tecken från näst sista (inkluderat) till slutet 'on'

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
sv: Notera att början alltid är inkluderad och slutet alltid exkluderat. Detta säkerställer att ``s[:i] + s[i:]`` alltid är lika med ``s``::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
sv: Ett sätt att komma ihåg hur skivorna fungerar är att tänka på indexen som pekande *mellan* tecken, med vänsterkanten på det första tecknet numrerat 0. Sedan har högerkanten på det sista tecknet i en sträng med *n* tecken index *n*, till exempel::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
sv: Den första talraden anger positionen för indexen 0...6 i strängen; den andra talraden anger motsvarande negativa index. Skivan från *i* till *j* består av alla tecken mellan kanterna märkta *i* respektive *j*.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
sv: För icke-negativa index är längden på en skiva skillnaden mellan indexen, om båda är inom gränserna. Till exempel är längden på ``ord[1:3]`` 2.

source: Attempting to use an index that is too large will result in an error::
sv: Försök att använda ett index som är för stort kommer att resultera i ett felmeddelande::

source: >>> word[42] # the word only has 6 characters Traceback (most recent call last): File "<stdin>", line 1, in <module> IndexError: string index out of range
sv: &gt;&gt;&gt; ord[42] # ordet har bara 6 tecken Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> IndexError: strängindex utanför intervallet

source: However, out of range slice indexes are handled gracefully when used for slicing::
sv: Slice-index som ligger utanför intervallet hanteras dock på ett elegant sätt när de används för slicing::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
sv: Python-strängar kan inte ändras --- de är :term:`immutable`. Därför resulterar tilldelning till en indexerad position i strängen i ett fel::

source: >>> word[0] = 'J' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment >>> word[2:] = 'py' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment
sv: >>> ord[0] = 'J' Traceback (senaste anropet senast): Filen "<stdin>", rad 1, i <module> TypeError: Objektet 'str' stöder inte tilldelning av objekt >>> word[2:] = 'py' Traceback (senaste anropet senast): Filen "<stdin>", rad 1, i <module> TypeError: 'str'-objektet stöder inte tilldelning av objekt

source: If you need a different string, you should create a new one::
sv: Om du behöver en annan sträng ska du skapa en ny::

source: The built-in function :func:`len` returns the length of a string::
sv: Den inbyggda funktionen :func:`len` returnerar längden på en sträng::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
sv: Strängar är exempel på *sekvenstyper* och stöder de vanliga operationer som stöds av sådana typer.

source: Strings support a large number of methods for basic transformations and searching.
sv: Strängar har stöd för ett stort antal metoder för grundläggande omvandlingar och sökning.

source: String literals that have embedded expressions.
sv: Stränglitteraler som har inbäddade uttryck.

source: Information about string formatting with :meth:`str.format`.
sv: Information om strängformatering med :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
sv: De gamla formateringsoperationerna som används när strängar är den vänstra operanden i operatorn ``%`` beskrivs mer i detalj här.

source: Lists
sv: Listor

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
sv: Python känner till ett antal *compound*-datatyper, som används för att gruppera andra värden. Den mest mångsidiga är *list*, som kan skrivas som en lista med kommaseparerade värden (objekt) mellan hakparenteser. Listor kan innehålla objekt av olika typer, men vanligtvis har alla objekt samma typ. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
sv: Precis som strängar (och alla andra inbyggda :term:`sequence`-typer) kan listor indexeras och skivas:

source: >>> squares[0] # indexing returns the item 1 >>> squares[-1] 25 >>> squares[-3:] # slicing returns a new list [9, 16, 25]
sv: >>> squares[0] # indexering returnerar objektet 1 >>> squares[-1] 25 >>> squares[-3:] # slicing returnerar en ny lista [9, 16, 25]

source: Lists also support operations like concatenation::
sv: Listor stöder också operationer som konkatenering::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
sv: Till skillnad från strängar, som är :term:`immutable`, är listor en :term:`mutable` typ, dvs. det är möjligt att ändra deras innehåll::
