Repository: yeager/python-docs-sv
Catalog: tutorial/introduction.po
Languages: sv

source: >>> cubes = [1, 8, 27, 65, 125] # something's wrong here >>> 4 ** 3 # the cube of 4 is 64, not 65! 64 >>> cubes[3] = 64 # replace the wrong value >>> cubes [1, 8, 27, 64, 125]
sv: >>> cubes = [1, 8, 27, 65, 125] # något är fel här >>> 4 ** 3 # kuben av 4 är 64, inte 65! 64 >>> cubes[3] = 64 # ersätt det felaktiga värdet >>> cubes [1, 8, 27, 64, 125]

source: You can also add new items at the end of the list, by using the :meth:`!list.append` *method* (we will see more about methods later)::
sv: Du kan också lägga till nya objekt i slutet av listan genom att använda :meth:`!list.append` *metod* (vi kommer att se mer om metoder senare)::

source: >>> cubes.append(216) # add the cube of 6 >>> cubes.append(7 ** 3) # and the cube of 7 >>> cubes [1, 8, 27, 64, 125, 216, 343]
sv: >>> cubes.append(216) # lägg till kuben av 6 >>> cubes.append(7 ** 3) # och kuben av 7 >>> cubes [1, 8, 27, 64, 125, 216, 343]

source: Simple assignment in Python never copies data. When you assign a list to a variable, the variable refers to the *existing list*. Any changes you make to the list through one variable will be seen through all other variables that refer to it.::
sv: Enkel tilldelning i Python kopierar aldrig data. När du tilldelar en lista till en variabel, refererar variabeln till den *existerande listan*. Alla ändringar som du gör i listan genom en variabel kommer att ses genom alla andra variabler som refererar till den:

source: >>> rgb = ["Red", "Green", "Blue"] >>> rgba = rgb >>> id(rgb) == id(rgba) # they reference the same object True >>> rgba.append("Alph") >>> rgb ["Red", "Green", "Blue", "Alph"]
sv: >>> rgb = ["Red", "Green", "Blue"] >>> rgba = rgb >>> id(rgb) == id(rgba) # de refererar till samma objekt True >>> rgba.append("Alph") >>> rgb ["Red", "Green", "Blue", "Alph"]

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
sv: Alla slice-operationer returnerar en ny lista som innehåller de begärda elementen. Detta innebär att följande slice returnerar en :ref:`skallig kopia <shallow_vs_deep_copy>` av listan::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
sv: Tilldelning till skivor är också möjlig, och detta kan till och med ändra listans storlek eller rensa den helt::

source: >>> letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> letters ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # replace some values >>> letters[2:5] = ['C', 'D', 'E'] >>> letters ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # now remove them >>> letters[2:5] = [] >>> letters ['a', 'b', 'f', 'g'] >>> # clear the list by replacing all the elements with an empty list >>> letters[:] = [] >>> letters []
sv: >>> bokstäver = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> bokstäver = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> bokstäver ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # ersätta vissa värden >>> bokstäver[2:5] = ['C', 'D', 'E'] >>> bokstäver ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # ta nu bort dem >>> bokstäver[2:5] = [] >>> bokstäver ['a', 'b', 'f', 'g'] >>> # rensa listan genom att ersätta alla element med en tom lista >>> bokstäver[:] = [] >>> bokstäver []

source: The built-in function :func:`len` also applies to lists::
sv: Den inbyggda funktionen :func:`len` gäller även för listor::

source: It is possible to nest lists (create lists containing other lists), for example::
sv: Det är möjligt att nesta listor (skapa listor som innehåller andra listor), till exempel::

source: First Steps Towards Programming
sv: Första stegen mot programmering

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ as follows::
sv: Naturligtvis kan vi använda Python för mer komplicerade uppgifter än att lägga ihop två och två. Vi kan till exempel skriva en första undersekvens av Fibonacci-serien <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ på följande sätt::

source: >>> # Fibonacci series: >>> # the sum of two elements defines the next >>> a, b = 0, 1 >>> while a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8
sv: >>> # Fibonacci-serien: >>> # summan av två element definierar nästa >>> a, b = 0, 1 >>> medan a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8

source: This example introduces several new features.
sv: I detta exempel introduceras flera nya funktioner.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
sv: Den första raden innehåller en *multipeltilldelning*: variablerna ``a`` och ``b`` får samtidigt de nya värdena 0 och 1. På den sista raden används detta igen, vilket visar att uttrycken på höger sida alla utvärderas först innan någon av tilldelningarna äger rum. Uttrycken på höger sida utvärderas från vänster till höger.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
sv: Slingan :keyword:`while` körs så länge villkoret (här: ``a < 10``) förblir sant. I Python, precis som i C, är alla heltalsvärden som inte är noll sanna; noll är falskt. Villkoret kan också vara en sträng eller ett listvärde, i själva verket vilken sekvens som helst; allt med en längd som inte är noll är sant, tomma sekvenser är falska. Testet som används i exemplet är en enkel jämförelse. Standardoperatorerna för jämförelser skrivs på samma sätt som i C: ``<`` (mindre än), ``>`` (större än), ``==`` (lika med), ``<=`` (mindre än eller lika med), ``>=`` (större än eller lika med) och ``!=`` (inte lika med).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
sv: Slingans *brödtext* är *indragen*: indrag är Pythons sätt att gruppera satser. Vid den interaktiva prompten måste du skriva en tabb eller ett mellanslag för varje indragen rad. I praktiken kommer du att förbereda mer komplicerad inmatning för Python med en textredigerare; alla anständiga textredigerare har en automatisk indenteringsfunktion. När en sammansatt sats skrivs in interaktivt måste den följas av en tom rad för att visa att den är klar (eftersom parsern inte kan gissa när du har skrivit den sista raden). Observera att varje rad inom ett basblock måste vara indragen lika mycket.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating-point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
sv: Funktionen :func:`print` skriver ut värdet på det eller de argument som den får. Den skiljer sig från att bara skriva det uttryck du vill skriva (som vi gjorde tidigare i räknarexemplen) genom sättet den hanterar flera argument, flyttalsmängder och strängar. Strängar skrivs ut utan citattecken och ett mellanslag infogas mellan objekten, så att du kan formatera saker snyggt, så här::

source: >>> i = 256*256 >>> print('The value of i is', i) The value of i is 65536
sv: >>> i = 256*256 >>> print('Värdet av i är', i) Värdet av i är 65536

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
sv: Nyckelordsargumentet *end* kan användas för att undvika ny rad efter utdata, eller avsluta utdata med en annan sträng::

source: >>> a, b = 0, 1 >>> while a < 1000: ... print(a, end=',') ... a, b = b, a+b ... 0,1,1,2,3,5,8,13,21,34,55,89,144,233,377,610,987,
sv: >>> a, b = 0, 1 >>> medan a < 1000: ... print(a, end=',') ... a, b = b, a+b ... 0,1,1,2,3,5,8,13,21,34,55,89,144,233,377,610,987,

source: Footnotes
sv: Fotnoter

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
sv: Eftersom ``**`` har högre prioritet än ``-`` kommer ``-3**2`` att tolkas som ``-(3**2)`` och därmed resultera i ``-9``. För att undvika detta och få ``9`` kan du använda ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
sv: Till skillnad från andra språk har specialtecken som ``\n`` samma betydelse med både enkla (``'...'``) och dubbla (``"...'``) citattecken. Den enda skillnaden mellan de två är att inom enkla citattecken behöver du inte undkomma ``"`` (men du måste undkomma ``\'``) och vice versa.

source: comment
sv: kommentar
