Repository: yeager/python-docs-sv
Catalog: tutorial/venv.po
Languages: sv

source: Virtual Environments and Packages
sv: Virtuella miljöer och paket

source: Introduction
sv: Introduktion

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
sv: Python-applikationer använder ofta paket och moduler som inte ingår i standardbiblioteket. Applikationer behöver ibland en specifik version av ett bibliotek, eftersom applikationen kan kräva att en viss bugg har åtgärdats eller applikationen kan vara skriven med en föråldrad version av bibliotekets gränssnitt.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
sv: Detta innebär att det kanske inte är möjligt för en Python-installation att uppfylla kraven för alla applikationer. Om program A behöver version 1.0 av en viss modul men program B behöver version 2.0, så står kraven i konflikt med varandra och om man installerar antingen version 1.0 eller 2.0 kommer ett program inte att kunna köras.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
sv: Lösningen på det här problemet är att skapa en :term:`virtuell miljö`, ett fristående katalogträd som innehåller en Python-installation för en viss version av Python, plus ett antal ytterligare paket.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
sv: Olika applikationer kan då använda olika virtuella miljöer. För att lösa det tidigare exemplet med motstridiga krav kan applikation A ha en egen virtuell miljö med version 1.0 installerad medan applikation B har en annan virtuell miljö med version 2.0. Om applikation B kräver att ett bibliotek ska uppgraderas till version 3.0 påverkar detta inte applikation A:s miljö.

source: Creating Virtual Environments
sv: Skapa virtuella miljöer

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will install the Python version from which the command was run (as reported by the :option:`--version` option). For instance, executing the command with ``python3.12`` will install version 3.12.
sv: Modulen som används för att skapa och hantera virtuella miljöer heter :mod:`venv`. :mod:`venv` installerar den Python-version som kommandot kördes från (vilket rapporteras av alternativet :option:`--version`). Om du till exempel kör kommandot med ``python3.12`` installeras version 3.12.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
sv: För att skapa en virtuell miljö bestämmer du en katalog där du vill placera den och kör modulen :mod:`venv` som ett skript med katalogsökvägen::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
sv: Detta skapar katalogen ``tutorial-env`` om den inte redan finns, och skapar även kataloger i den som innehåller en kopia av Python-tolken och olika stödfiler.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
sv: En vanlig katalogplats för en virtuell miljö är ``.venv``. Det här namnet gör att katalogen vanligtvis är dold i ditt skal och därmed inte är i vägen samtidigt som den får ett namn som förklarar varför katalogen finns. Det förhindrar också krockar med ``.env`` definitionsfiler för miljövariabler som vissa verktyg stöder.

source: Once you've created a virtual environment, you may activate it.
sv: När du har skapat en virtuell miljö kan du aktivera den.

source: On Windows, run::
sv: I Windows kör du::

source: On Unix or MacOS, run::
sv: På Unix eller MacOS kör du::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
sv: (Det här skriptet är skrivet för bash-skalet. Om du använder skalen :program:`csh` eller :program:`fish` finns det alternativa skript ``activate.csh`` och ``activate.fish`` som du bör använda istället)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
sv: Om du aktiverar den virtuella miljön ändras skalets prompt så att den visar vilken virtuell miljö du använder och miljön ändras så att du får den specifika versionen och installationen av Python om du kör ``python``. Ett exempel:

source: To deactivate a virtual environment, type::
sv: Om du vill inaktivera en virtuell miljö skriver du::

source: into the terminal.
sv: in i terminalen.

source: Managing Packages with pip
sv: Hantera paket med pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
sv: Du kan installera, uppgradera och ta bort paket med hjälp av ett program som heter :program:`pip`. Som standard installerar ``pip`` paket från `Python Package Index <https://pypi.org>`_. Du kan bläddra i Python Package Index genom att gå till det i din webbläsare.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
sv: ``pip`` har ett antal underkommandon: "install", "uninstall", "freeze", etc. (Se guiden :ref:`installing-index` för fullständig dokumentation för ``pip``)

source: You can install the latest version of a package by specifying a package's name:
sv: Du kan installera den senaste versionen av ett paket genom att ange paketets namn:

source: (tutorial-env) $ python -m pip install novas Collecting novas Downloading novas-3.1.1.3.tar.gz (136kB) Installing collected packages: novas Running setup.py install for novas Successfully installed novas-3.1.1.3
sv: (tutorial-env) $ python -m pip installera novas Samla in novas Hämtar novas-3.1.1.3.tar.gz (136kB) Installera insamlade paket: novas Kör setup.py install för novas Installerade framgångsrikt novas-3.1.1.3

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
sv: Du kan också installera en specifik version av ett paket genom att ange paketnamnet följt av ``==`` och versionsnumret:

source: (tutorial-env) $ python -m pip install requests==2.6.0 Collecting requests==2.6.0 Using cached requests-2.6.0-py2.py3-none-any.whl Installing collected packages: requests Successfully installed requests-2.6.0
sv: (tutorial-env) $ python -m pip install requests==2.6.0 Samla in förfrågningar==2.6.0 Använda cachelagrade requests-2.6.0-py2.py3-none-any.whl Installerar insamlade paket: requests Installerade framgångsrikt requests-2.6.0

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
sv: Om du kör det här kommandot igen kommer ``pip`` att märka att den begärda versionen redan är installerad och inte göra någonting. Du kan ange ett annat versionsnummer för att hämta den versionen, eller så kan du köra ``python -m pip install --upgrade`` för att uppgradera paketet till den senaste versionen:

source: (tutorial-env) $ python -m pip install --upgrade requests Collecting requests Installing collected packages: requests Found existing installation: requests 2.6.0 Uninstalling requests-2.6.0: Successfully uninstalled requests-2.6.0 Successfully installed requests-2.7.0
sv: (tutorial-env) $ python -m pip install --upgrade förfrågningar Samla in förfrågningar Installerar insamlade paket: requests Hittade befintlig installation: requests 2.6.0 Avinstallation av requests-2.6.0: Framgångsrikt avinstallerat requests-2.6.0 Installerade framgångsrikt requests-2.7.0

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
sv: ``python -m pip uninstall`` följt av ett eller flera paketnamn tar bort paketen från den virtuella miljön.

source: ``python -m pip show`` will display information about a particular package:
sv: ``python -m pip show`` visar information om ett visst paket:

source: (tutorial-env) $ python -m pip show requests --- Metadata-Version: 2.0 Name: requests Version: 2.7.0 Summary: Python HTTP for Humans. Home-page: http://python-requests.org Author: Kenneth Reitz Author-email: me@kennethreitz.com License: Apache 2.0 Location: /Users/akuchling/envs/tutorial-env/lib/python3.4/site-packages Requires:
sv: (tutorial-env) $ python -m pip visa förfrågningar --- Metadata-version: 2.0 Namn: förfrågningar Version: 2.7.0 Sammanfattning: Python HTTP för människor. Hemsida: http://python-requests.org Författare:: Kenneth Reitz E-post för författare: me@kennethreitz.com Licens: Apache 2.0 Apache 2.0 Plats: /Users/akuchling/envs/tutorial-env/lib/python3.4/site-packages Kräver:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
sv: ``python -m pip list`` visar alla paket som är installerade i den virtuella miljön:

source: (tutorial-env) $ python -m pip list novas (3.1.1.3) numpy (1.9.2) pip (7.0.3) requests (2.7.0) setuptools (16.0)
sv: (tutorial-env) $ python -m pip lista novas (3.1.1.3) numpy (1.9.2) pip (7.0.3) förfrågningar (2.7.0) setuptools (16.0)

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
sv: ``python -m pip freeze`` kommer att producera en liknande lista över de installerade paketen, men utdata använder det format som ``python -m pip install`` förväntar sig. En vanlig konvention är att lägga den här listan i filen ``requirements.txt``:

source: (tutorial-env) $ python -m pip freeze > requirements.txt (tutorial-env) $ cat requirements.txt novas==3.1.1.3 numpy==1.9.2 requests==2.7.0
sv: (handledning-env) $ python -m pip freeze > krav.txt (handledning-env) $ cat krav.txt novas==3.1.1.3 numpy==1.9.2 förfrågningar==2.7.0

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
sv: ``requirements.txt`` kan sedan överföras till versionskontroll och levereras som en del av en applikation. Användare kan sedan installera alla nödvändiga paket med ``install -r``:

source: (tutorial-env) $ python -m pip install -r requirements.txt Collecting novas==3.1.1.3 (from -r requirements.txt (line 1)) ... Collecting numpy==1.9.2 (from -r requirements.txt (line 2)) ... Collecting requests==2.7.0 (from -r requirements.txt (line 3)) ... Installing collected packages: novas, numpy, requests Running setup.py install for novas Successfully installed novas-3.1.1.3 numpy-1.9.2 requests-2.7.0
sv: (tutorial-env) $ python -m pip install -r requirements.txt Samlar in novas==3.1.1.3 (från -r requirements.txt (rad 1)) ... Samlar numpy==1.9.2 (från -r requirements.txt (rad 2)) ... Samlar in requests==2.7.0 (från -r requirements.txt (rad 3)) ... Installerar insamlade paket: novas, numpy, requests Kör setup.py install för novas Installerade framgångsrikt novas-3.1.1.3 numpy-1.9.2 requests-2.7.0

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
sv: ``pip`` har många fler alternativ. Se guiden :ref:`installing-index` för fullständig dokumentation för ``pip``. När du har skrivit ett paket och vill göra det tillgängligt på Python Package Index, se `Python packaging user guide`_.
