Repository: yeager/python-docs-sv
Catalog: tutorial/whatnow.po
Languages: sv

source: What Now?
sv: Vad händer nu?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
sv: Att läsa denna handledning har förmodligen förstärkt ditt intresse för att använda Python --- du borde vara angelägen om att tillämpa Python för att lösa dina verkliga problem. Vart ska du gå för att lära dig mer?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
sv: Denna handledning är en del av Pythons dokumentationsuppsättning. Några andra dokument i uppsättningen är:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
sv: Du bör bläddra igenom den här manualen, som innehåller komplett (om än kortfattat) referensmaterial om typer, funktioner och modulerna i standardbiblioteket. Standarddistributionen av Python innehåller *mycket* extra kod. Det finns moduler för att läsa Unix-brevlådor, hämta dokument via HTTP, generera slumptal, analysera kommandoradsalternativ, komprimera data och många andra uppgifter. Genom att skumma igenom biblioteksreferensen får du en uppfattning om vad som finns tillgängligt.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
sv: :ref:`installing-index` förklarar hur man installerar ytterligare moduler som skrivits av andra Python-användare.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
sv: :ref:`referens-index`: En detaljerad förklaring av Pythons syntax och semantik. Det är tung läsning, men är användbart som en komplett guide till själva språket.

source: More Python resources:
sv: Fler Python-resurser:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
sv: https://www.python.org: Den viktigaste Python-webbplatsen. Den innehåller kod, dokumentation och pekare till Python-relaterade sidor runt om på webben.

source: https://docs.python.org: Fast access to Python's documentation.
sv: https://docs.python.org: Snabb tillgång till Pythons dokumentation.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
sv: https://pypi.org: Python Package Index, som tidigare även kallades Cheese Shop [#]_, är ett index över användarskapade Python-moduler som är tillgängliga för nedladdning. När du börjar släppa kod kan du registrera den här så att andra kan hitta den.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
sv: https://code.activestate.com/recipes/langs/python/: Python Cookbook är en omfattande samling av kodexempel, större moduler och användbara skript. Särskilt anmärkningsvärda bidrag finns samlade i en bok som också heter Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
sv: https://pyvideo.org samlar länkar till Python-relaterade videor från konferenser och användargruppsmöten.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
sv: https://scipy.org: Scientific Python-projektet innehåller moduler för snabba matrisberäkningar och manipulationer samt en mängd paket för sådant som linjär algebra, Fouriertransformer, icke-linjära lösare, slumptalsdistributioner, statistisk analys och liknande.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
sv: Python-relaterade frågor och problemrapporter kan du skicka till nyhetsgruppen :newsgroup:`comp.lang.python` eller till e-postlistan python-list@python.org. Nyhetsgruppen och e-postlistan är gatewayed, så meddelanden som postas till den ena kommer automatiskt att vidarebefordras till den andra. Det görs hundratals inlägg varje dag, där man ställer (och besvarar) frågor, föreslår nya funktioner och tillkännager nya moduler. Mailinglistans arkiv finns tillgängliga på https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
sv: Innan du skriver ett inlägg bör du kontrollera listan över :ref:``Frequently Asked Questions <faq-index>`` (även kallad FAQ). FAQ besvarar många av de frågor som dyker upp om och om igen, och kanske innehåller den redan lösningen på ditt problem.

source: Footnotes
sv: Fotnoter

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
sv: "Cheese Shop" är en Monty Python-sketch: en kund kommer in i en ostbutik, men den ost han frågar efter saknas enligt expediten.
