Repository: yeager/python-docs-sv
Catalog: license.po
Languages: sv

source: The XML-RPC client interface is Copyright (c) 1999-2002 by Secret Labs AB Copyright (c) 1999-2002 by Fredrik Lundh By obtaining, using, and/or copying this software and/or its associated documentation, you agree that you have read, understood, and will comply with the following terms and conditions: Permission to use, copy, modify, and distribute this software and its associated documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appears in all copies, and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Secret Labs AB or the author not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. SECRET LABS AB AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANT- ABILITY AND FITNESS. IN NO EVENT SHALL SECRET LABS AB OR THE AUTHOR BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
sv: XML-RPC-klientgränssnittet är Copyright (c) 1999-2002 av Secret Labs AB Upphovsrätt (c) 1999-2002 av Fredrik Lundh Genom att skaffa, använda och/eller kopiera denna programvara och/eller dess tillhörande dokumentation, samtycker du till att du har läst, förstått och kommer att följa följande villkor och bestämmelser: Tillstånd att använda, kopiera, modifiera och distribuera denna programvara och tillhörande dokumentation för alla ändamål och utan avgift beviljas härmed härmed beviljas, förutsatt att ovanstående meddelande om upphovsrätt visas i alla kopior, och att både upphovsrättsmeddelandet och detta meddelande om tillstånd och detta tillståndsmeddelande visas i stöddokumentationen, och att namnet på Secret Labs AB eller författarens namn inte får användas i reklam eller publicitet eller publicitet som rör distribution av programvaran utan specifikt, skriftligt skriftligt förhandstillstånd. SECRET LABS AB OCH FÖRFATTAREN AVSÄGER SIG ALLA GARANTIER MED AVSEENDE PÅ PROGRAMVARAN, INKLUSIVE ALLA UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET FÖRMÅGA OCH LÄMPLIGHET. UNDER INGA OMSTÄNDIGHETER SKA SECRET LABS AB ELLER FÖRFATTAREN VARA ANSVARIGA FÖR NÅGRA SPECIELLA, INDIREKTA ELLER FÖLJDSKADOR ELLER NÅGRA SKADOR SOM UPPSTÅR TILL FÖLJD AV FÖRLUST AV ANVÄNDNING, DATA ELLER VINST, OAVSETT OM DET RÖR SIG OM EN TALAN OM AVTAL, FÖRSUMLIGHET ELLER ANNAN SOM UPPSTÅR PÅ GRUND AV ELLER I SAMBAND MED ANVÄNDNING ELLER UTFÖRANDE AV AV DENNA PROGRAMVARA.

source: The :mod:`!test.test_epoll` module contains the following notice::
sv: Modulen :mod:`!test.test_epoll` innehåller följande meddelande::

source: Copyright (c) 2001-2006 Twisted Matrix Laboratories. Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
sv: Copyright (c) 2001-2006 Twisted Matrix Laboratories. Tillstånd beviljas härmed, kostnadsfritt, till varje person som erhåller en kopia av denna programvara och tillhörande dokumentationsfiler ("Programvaran") "Programvaran"), att handla med Programvaran utan begränsning, inklusive utan begränsning rätten att använda, kopiera, modifiera, sammanfoga, publicera distribuera, underlicensiera och/eller sälja kopior av programvaran, och att tillåta personer till vilka programvaran tillhandahålls att göra detta, med förbehåll för följande villkor: Ovanstående meddelande om upphovsrätt och detta meddelande om tillstånd ska ingå i alla kopior eller väsentliga delar av programvaran. PROGRAMVARAN TILLHANDAHÅLLS "I BEFINTLIGT SKICK", UTAN GARANTIER AV NÅGOT SLAG, UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA, INKLUSIVE MEN INTE BEGRÄNSAT TILL GARANTIERNA FÖR SÄLJBARHET, LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL OCH ICKE-INTRÅNG. UNDER INGA OMSTÄNDIGHETER SKA FÖRFATTARNA ELLER UPPHOVSRÄTTSINNEHAVARNA VARA ANSVARIG FÖR NÅGOT ANSPRÅK, SKADESTÅND ELLER ANNAT ANSVAR, VARE SIG I EN TALAN KONTRAKT, SKADESTÅND ELLER PÅ ANNAT SÄTT, SOM UPPSTÅR FRÅN, UR ELLER I SAMBAND MED MED PROGRAMVARAN ELLER ANVÄNDNING ELLER ANNAN HANTERING AV PROGRAMVARAN.

source: Select kqueue
sv: Välj kqueue

source: The :mod:`select` module contains the following notice for the kqueue interface::
sv: Modulen :mod:`select` innehåller följande meddelande för kqueue-gränssnittet::

source: Copyright (c) 2000 Doug White, 2006 James Knight, 2007 Christian Heimes All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
sv: Upphovsrätt (c) 2000 Doug White, 2006 James Knight, 2007 Christian Heimes Alla rättigheter förbehållna. Vidaredistribution och användning i käll- och binärform, med eller utan eller utan modifiering, är tillåtet under förutsättning att följande villkor är uppfyllda: 1. Vidaredistribution av källkod måste innehålla ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista över villkor och följande ansvarsfriskrivning. 2. Vidaredistribution i binär form måste återge ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista med villkor och följande ansvarsfriskrivning i dokumentation och/eller annat material som tillhandahålls med distributionen. DENNA PROGRAMVARA TILLHANDAHÅLLS AV FÖRFATTAREN OCH BIDRAGSGIVARNA "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE BEGRÄNSAT TILL UNDERFÖRSTÅDDA GARANTIERNA FÖR SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL FÖR ETT VISST ÄNDAMÅL. UNDER INGA OMSTÄNDIGHETER SKA FÖRFATTAREN ELLER BIDRAGSGIVARNA VARA ANSVARIGA FÖR DIREKTA, INDIREKTA, TILLFÄLLIGA, SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR SKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL, ANSKAFFNING AV ERSÄTTNINGSVAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER VINSTER; ELLER AFFÄRSAVBROTT) OAVSETT ORSAK OCH OAVSETT ANSVARSTEORI, OAVSETT OM DET RÖR SIG OM AVTAL, STRIKT STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE VÅRDSLÖSHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR AV ANVÄNDNINGEN AV DENNA PROGRAMVARA, ÄVEN OM DU INFORMERATS OM MÖJLIGHETEN TILL SÅDAN SKADA.

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
sv: Filen :file:`Python/pyhash.c` innehåller Marek Majkowski's implementation av Dan Bernstein's SipHash24 algoritm. Den innehåller följande anmärkning::

source: <MIT License> Copyright (c) 2013 Marek Majkowski <marek@popcount.org> Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. </MIT License> Original location: https://github.com/majek/csiphash/ Solution inspired by code from: Samuel Neves (supercop/crypto_auth/siphash24/little) djb (supercop/crypto_auth/siphash24/little2) Jean-Philippe Aumasson (https://131002.net/siphash/siphash24.c)
sv: <MIT License> Upphovsrätt (c) 2013 Marek Majkowski <marek@popcount.org> Tillstånd beviljas härmed, kostnadsfritt, till varje person som erhåller en kopia av denna programvara och tillhörande dokumentationsfiler ("Programvaran"), att handla i programvaran utan begränsning, inklusive utan begränsning rättigheterna att använda, kopiera, modifiera, sammanfoga, publicera, distribuera, underlicensiera och/eller sälja och/eller sälja kopior av programvaran, och att tillåta personer till vilka programvaran tillhandahålls att göra detta, med förbehåll för följande villkor: Ovanstående meddelande om upphovsrätt och detta meddelande om tillstånd ska ingå i alla kopior eller väsentliga delar av programvaran. </MIT License> Ursprunglig plats: https://github.com/majek/csiphash/ Lösning inspirerad av kod från: Samuel Neves (supercop/crypto_auth/siphash24/little) djb (supercop/crypto_auth/siphash24/little2) Jean-Philippe Aumasson (https://131002.net/siphash/siphash24.c)

source: strtod and dtoa
sv: strtod och dtoa

source: The file :file:`Python/dtoa.c`, which supplies C functions dtoa and strtod for conversion of C doubles to and from strings, is derived from the file of the same name by David M. Gay, currently available from https://web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c. The original file, as retrieved on March 16, 2009, contains the following copyright and licensing notice::
sv: Filen :file:`Python/dtoa.c`, som tillhandahåller C-funktionerna dtoa och strtod för konvertering av C-dubbletter till och från strängar, härrör från filen med samma namn av David M. Gay, för närvarande tillgänglig från https://web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c. Originalfilen, som hämtades den 16 mars 2009, innehåller följande copyright- och licensmeddelande::

source: /**************************************************************** * * The author of this software is David M. Gay. * * Copyright (c) 1991, 2000, 2001 by Lucent Technologies. * * Permission to use, copy, modify, and distribute this software for any * purpose without fee is hereby granted, provided that this entire notice * is included in all copies of any software which is or includes a copy * or modification of this software and in all copies of the supporting * documentation for such software. * * THIS SOFTWARE IS BEING PROVIDED "AS IS", WITHOUT ANY EXPRESS OR IMPLIED * WARRANTY. IN PARTICULAR, NEITHER THE AUTHOR NOR LUCENT MAKES ANY * REPRESENTATION OR WARRANTY OF ANY KIND CONCERNING THE MERCHANTABILITY * OF THIS SOFTWARE OR ITS FITNESS FOR ANY PARTICULAR PURPOSE. * ***************************************************************/
sv: /**************************************************************** * * Författaren till denna programvara är David M. Gay. * * Upphovsrätt (c) 1991, 2000, 2001 av Lucent Technologies. * * Tillstånd att använda, kopiera, modifiera och distribuera denna programvara för alla * ändamål utan avgift beviljas härmed, under förutsättning att hela detta meddelande * ingår i alla kopior av all programvara som är eller innehåller en kopia eller * eller modifiering av denna programvara och i alla kopior av stöddokumentationen * dokumentation för sådan programvara. * * DENNA PROGRAMVARA TILLHANDAHÅLLS "I BEFINTLIGT SKICK", UTAN NÅGON UTTRYCKLIG ELLER UNDERFÖRSTÅDD * GARANTI. I SYNNERHET GÖR VARKEN FÖRFATTAREN ELLER LUCENT NÅGON * UTFÄSTELSE ELLER GARANTI AV NÅGOT SLAG BETRÄFFANDE SÄLJBARHETEN * AV DENNA PROGRAMVARA ELLER DESS LÄMPLIGHET FÖR NÅGOT SÄRSKILT ÄNDAMÅL. * ***************************************************************/

source: The modules :mod:`hashlib`, :mod:`posix` and :mod:`ssl` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and macOS installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here. For the OpenSSL 3.0 release, and later releases derived from that, the Apache License v2 applies::
sv: Modulerna :mod:`hashlib`, :mod:`posix` och :mod:`ssl` använder OpenSSL-biblioteket för extra prestanda om det görs tillgängligt av operativsystemet. Dessutom kan Windows- och macOS-installationsprogrammen för Python innehålla en kopia av OpenSSL-biblioteken, så vi inkluderar en kopia av OpenSSL-licensen här. För OpenSSL 3.0-versionen och senare versioner som härrör från den gäller Apache-licensen v2::
