Repository: yeager/python-docs-sv
Catalog: license.po
Languages: sv

source: Zstandard bindings in :file:`Modules/_zstd` and :file:`Lib/compression/zstd` are based on code from the `pyzstd library <https://github.com/Rogdham/pyzstd/>`_, copyright Ma Lin and contributors. The pyzstd code is distributed under the 3-Clause BSD License::
sv: Zstandardbindningar i :file:`Modules/_zstd` och :file:`Lib/compression/zstd` är baserade på kod från `pyzstd-biblioteket <https://github.com/Rogdham/pyzstd/>`_, copyright Ma Lin och bidragsgivare. Koden för pyzstd distribueras under 3-Clause BSD License::

source: Copyright (c) 2020-present, Ma Lin and contributors. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
sv: Copyright (c) 2020-nuvarande, Ma Lin och bidragsgivare. Alla rättigheter förbehållna. Vidaredistribution och användning i käll- och binärform, med eller utan modifiering, är tillåtet under förutsättning att följande villkor uppfylls: 1. Vidaredistribution av källkod måste innehålla ovanstående meddelande om upphovsrätt, denna lista över villkor och följande ansvarsfriskrivning. 2. Vidaredistributioner i binär form måste återge ovanstående meddelande om upphovsrätt, denna lista med villkor och följande ansvarsfriskrivning i dokumentationen och/eller och/eller annat material som tillhandahålls med distributionen. 3. Varken namnet på upphovsrättsinnehavaren eller namnen på dess bidragsgivare får användas för att stödja eller marknadsföra produkter som härrör från denna programvara utan särskilt skriftligt tillstånd i förväg. DENNA PROGRAMVARA TILLHANDAHÅLLS AV UPPHOVSRÄTTSINNEHAVARNA OCH BIDRAGSGIVARNA "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE BEGRÄNSAT TILL UNDERFÖRSTÅDDA GARANTIERNA FÖR SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL FRÅNSKRIVS. UNDER INGA OMSTÄNDIGHETER SKA UPPHOVSRÄTTSINNEHAVAREN ELLER BIDRAGSGIVARNA VARA ANSVARIGA FÖR DIREKTA, INDIREKTA, TILLFÄLLIGA, SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR SKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL, ANSKAFFNING AV ERSÄTTNINGSVAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER VINST; ELLER AVBROTT I VERKSAMHETEN) OAVSETT ORSAKADE OCH PÅ NÅGON ANSVARSTEORI, OAVSETT OM DET ÄR I KONTRAKT, STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE VÅRDSLÖSHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR UR ANVÄNDNINGEN AV AV DENNA PROGRAMVARA, ÄVEN OM MAN INFORMERATS OM MÖJLIGHETEN TILL SÅDAN SKADA.
