Repository: yeager/python-docs-sv
Catalog: license.po
Languages: sv

source: Copyright © 1991 - 1995, Stichting Mathematisch Centrum Amsterdam, The Netherlands. All rights reserved. Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Stichting Mathematisch Centrum or CWI not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. STICHTING MATHEMATISCH CENTRUM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL STICHTING MATHEMATISCH CENTRUM BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
sv: Copyright © 1991 - 1995, Stichting Mathematisch Centrum Amsterdam, Nederländerna Nederländerna. Alla rättigheter förbehållna. Tillstånd att använda, kopiera, modifiera och distribuera denna programvara och dess dokumentation för alla ändamål och utan avgift beviljas härmed, under förutsättning att ovanstående upphovsrättsmeddelande visas i alla kopior och att både upphovsrättsmeddelandet och upphovsrättsmeddelandet och detta tillståndsmeddelande visas i stöddokumentationen, och att stichting Mathematisch Centrums eller CWI:s namn inte används i reklam eller publicitet publicitet som rör distribution av programvaran utan specifikt, skriftligt förhandstillstånd skriftligt förhandstillstånd. STICHTING MATHEMATISCH CENTRUM AVSÄGER SIG ALLA GARANTIER MED AVSEENDE PÅ DENNA PROGRAMVARAN, INKLUSIVE ALLA UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET OCH LÄMPLIGHET, UNDER INGA STICHTING MATHEMATISCH CENTRUM SKA INTE I NÅGOT FALL HÅLLAS ANSVARIGT FÖR NÅGRA SPECIELLA, INDIREKTA ELLER FÖLJDSKADOR ELLER NÅGRA SOM HELST SKADOR TILL FÖLJD AV FÖRLUST AV ANVÄNDNING, DATA ELLER VINSTER, VARE SIG DET ÄR I EN TALAN OM KONTRAKT, FÖRSUMLIGHET ELLER ANNAN SKADESTÅNDSGRUNDANDE SOM UPPSTÅR PÅ GRUND AV ELLER I SAMBAND MED ANVÄNDNING ELLER UTFÖRANDE AV DENNA PROGRAMVARAN.

source: ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON DOCUMENTATION
sv: BSD-LICENS MED NOLLKLAUSUL FÖR KOD I PYTHON-DOKUMENTATIONEN

source: Permission to use, copy, modify, and/or distribute this software for any purpose with or without fee is hereby granted. THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
sv: Tillstånd att använda, kopiera, modifiera och/eller distribuera denna programvara för alla ändamål med eller utan avgift beviljas härmed. PROGRAMVARAN TILLHANDAHÅLLS "I BEFINTLIGT SKICK" OCH FÖRFATTAREN FRÅNSÄGER SIG ALLA GARANTIER AVSEENDE DENNA PROGRAMVARA INKLUSIVE ALLA UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET OCH LÄMPLIGHET. UNDER INGA OMSTÄNDIGHETER SKALL FÖRFATTAREN VARA ANSVARIG FÖR NÅGRA SPECIELLA, DIREKTA, INDIREKTA SKADOR ELLER FÖLJDSKADOR ELLER NÅGRA SOM HELST SKADOR TILL FÖLJD AV FÖRLUST AV ANVÄNDNING, DATA ELLER VINST, OAVSETT OM DET GÄLLER EN TALAN OM KONTRAKT, FÖRSUMLIGHET ELLER ELLER ANNAN SKADESTÅNDSGRUNDANDE HANDLING, SOM UPPSTÅR PÅ GRUND AV ELLER I SAMBAND MED ANVÄNDNINGEN ELLER ELLER PRESTANDA AV DENNA PROGRAMVARA.

source: Licenses and Acknowledgements for Incorporated Software
sv: Licenser och erkännanden för inkorporerad programvara

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
sv: Detta avsnitt är en ofullständig, men växande lista över licenser och erkännanden för programvara från tredje part som ingår i Python-distributionen.

source: The :mod:`!_random` C extension underlying the :mod:`random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
sv: C-tillägget :mod:`!_random` som ligger till grund för modulen :mod:`random` innehåller kod baserad på en nedladdning från http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. Följande är de ordagranna kommentarerna från originalkoden::

source: A C-program for MT19937, with initialization improved 2002/1/26. Coded by Takuji Nishimura and Makoto Matsumoto. Before using, initialize the state by using init_genrand(seed) or init_by_array(init_key, key_length). Copyright (C) 1997 - 2002, Makoto Matsumoto and Takuji Nishimura, All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. The names of its contributors may not be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. Any feedback is very welcome. http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/emt.html email: m-mat @ math.sci.hiroshima-u.ac.jp (remove space)
sv: Ett C-program för MT19937, med initialisering förbättrad 2002/1/26. Kodat av Takuji Nishimura och Makoto Matsumoto. Innan du använder programmet, initiera tillståndet genom att använda init_genrand(seed) eller init_by_array(init_key, key_length). Copyright (C) 1997 - 2002, Makoto Matsumoto och Takuji Nishimura, Alla rättigheter förbehållna. Vidaredistribution och användning i käll- och binärform, med eller utan eller utan modifiering, är tillåtet under förutsättning att följande villkor är uppfyllda: 1. Vidaredistribution av källkod måste innehålla ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista över villkor och följande ansvarsfriskrivning. 2. Vidaredistribution i binär form måste återge ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista med villkor och följande ansvarsfriskrivning i dokumentation och/eller annat material som tillhandahålls med distributionen. 3. Namnen på dess bidragsgivare får inte användas för att stödja eller marknadsföra eller marknadsföra produkter som härrör från denna programvara utan särskilt skriftligt skriftligt tillstånd. DENNA PROGRAMVARA TILLHANDAHÅLLS AV UPPHOVSRÄTTSINNEHAVARNA OCH BIDRAGSGIVARNA "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE MEN INTE BEGRÄNSAT TILL, UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST SYFTE FRÅNSÄGS. UNDER INGA OMSTÄNDIGHETER SKA UPPHOVSRÄTTSINNEHAVAREN ELLER BIDRAGSGIVARE VARA ANSVARIGA FÖR DIREKTA, INDIREKTA, TILLFÄLLIGA, SÄRSKILDA SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL ANSKAFFNING AV ERSÄTTANDE VAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER DATA ELLER VINSTER; ELLER AVBROTT I VERKSAMHETEN) OAVSETT ORSAK OCH OAVSETT TEORI OM ANSVAR, OAVSETT OM DET GÄLLER AVTAL, STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE (INKLUSIVE VÅRDSLÖSHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR TILL FÖLJD AV ANVÄNDNINGEN AV DENNA PROGRAMVARAN, ÄVEN OM MAN INFORMERATS OM MÖJLIGHETEN TILL SÅDAN SKADA. All feedback är mycket välkommen. http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/emt.html e-post: m-mat @ math.sci.hiroshima-u.ac.jp (ta bort mellanslag)

source: Sockets
sv: Uttag

source: The :mod:`socket` module uses the functions, :c:func:`!getaddrinfo`, and :c:func:`!getnameinfo`, which are coded in separate source files from the WIDE Project, https://www.wide.ad.jp/. ::
sv: Modulen :mod:`socket` använder funktionerna :c:func:`!getaddrinfo` och :c:func:`!getnameinfo`, som kodas i separata källfiler från WIDE-projektet, https://www.wide.ad.jp/. ::

source: Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. Neither the name of the project nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
sv: Copyright (C) 1995, 1996, 1997 och 1998 WIDE Project. Alla rättigheter förbehållna. Vidaredistribution och användning i källkods- och binärform, med eller utan eller utan modifiering, är tillåtet under förutsättning att följande villkor är uppfyllda: 1. Vidaredistribution av källkod måste innehålla ovanstående meddelande om upphovsrätt upphovsrätt, denna lista med villkor och följande ansvarsfriskrivning. 2. Vidaredistribution i binär form måste återge ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista med villkor och följande ansvarsfriskrivning i dokumentation och/eller annat material som tillhandahålls med distributionen. 3. Varken namnet på projektet eller namnen på dess bidragsgivare får användas för att stödja eller marknadsföra produkter som härrör från denna programvara utan särskilt skriftligt tillstånd i förväg. DENNA PROGRAMVARA TILLHANDAHÅLLS AV PROJEKTET OCH BIDRAGSGIVARNA "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE BEGRÄNSAT TILL UNDERFÖRSTÅDDA GARANTIERNA FÖR SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL FÖR ETT VISST ÄNDAMÅL. UNDER INGA OMSTÄNDIGHETER SKA PROJEKTET ELLER BIDRAGSGIVARNA VARA ANSVARIGA FÖR DIREKTA, INDIREKTA, TILLFÄLLIGA, SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR SKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL, ANSKAFFNING AV ERSÄTTANDE VAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER VINST; ELLER AVBROTT I VERKSAMHETEN) OAVSETT ORSAK OCH OAVSETT ANSVARSTEORI, OAVSETT OM DET RÖR SIG OM AVTAL, STRIKT STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE VÅRDSLÖSHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR AV ANVÄNDNINGEN AV DENNA PROGRAMVARA, ÄVEN OM DU INFORMERATS OM MÖJLIGHETEN TILL SÅDAN SKADA.

source: Asynchronous socket services
sv: Asynkrona socket-tjänster

source: The :mod:`!test.support.asynchat` and :mod:`!test.support.asyncore` modules contain the following notice::
sv: Modulerna :mod:`!test.support.asynchat` och :mod:`!test.support.asyncore` innehåller följande meddelande::

source: Copyright 1996 by Sam Rushing All Rights Reserved Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Sam Rushing not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. SAM RUSHING DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL SAM RUSHING BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
sv: Copyright 1996 av Sam Rushing Alla rättigheter reserverade Tillstånd att använda, kopiera, modifiera och distribuera denna programvara och dess dokumentation för alla ändamål och utan avgift beviljas härmed under förutsättning att ovanstående meddelande om upphovsrätt finns med i alla kopior kopior och att både upphovsrättsmeddelandet och detta meddelande om tillstånd i stöddokumentationen, och att Sam Rushings namn inte används i reklam eller Rushing inte används i reklam eller publicitet som rör distribution av programvaran distribution av programvaran utan specifikt, skriftligt förhandstillstånd skriftligt tillstånd. SAM RUSHING FRÅNSÄGER SIG ALLA GARANTIER MED AVSEENDE PÅ DENNA PROGRAMVARA, INKLUSIVE ALLA UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET OCH LÄMPLIGHET, I SAM RUSHING SKA UNDER INGA OMSTÄNDIGHETER VARA ANSVARIG FÖR NÅGRA SÄRSKILDA, INDIREKTA ELLER ELLER FÖLJDSKADOR ELLER NÅGRA SOM HELST SKADOR TILL FÖLJD AV FÖRLUST AV AV ANVÄNDNING, DATA ELLER VINST, OAVSETT OM DET ÄR I EN TALAN OM KONTRAKT, VÅRDSLÖSHET ELLER ANNAN SKADESTÅNDSGRUNDANDE HANDLING, SOM UPPSTÅR PÅ GRUND AV ELLER I SAMBAND MED ANVÄNDNING ELLER PRESTANDA FÖR DENNA PROGRAMVARA.

source: Cookie management
sv: Hantering av cookies

source: The :mod:`http.cookies` module contains the following notice::
sv: Modulen :mod:`http.cookies` innehåller följande meddelande::

source: Copyright 2000 by Timothy O'Malley <timo@alum.mit.edu> All Rights Reserved Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Timothy O'Malley not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. Timothy O'Malley DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL Timothy O'Malley BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
sv: Copyright 2000 av Timothy O'Malley <timo@alum.mit.edu> Alla rättigheter reserverade Tillstånd att använda, kopiera, modifiera och distribuera denna programvara och dess dokumentation för alla ändamål och utan avgift beviljas härmed förutsatt att ovanstående upphovsrättsmeddelande visas i alla kopior och att både kopior och att både upphovsrättsmeddelandet och detta meddelande om tillstånd i stöddokumentationen, och att namnet Timothy O'Malley inte Timothy O'Malley inte får användas i reklam eller publicitet publicitet som rör distribution av programvaran utan specifikt, skriftligt skriftligt förhandstillstånd. Timothy O'Malley frånsäger sig alla garantier med avseende på denna PROGRAMVARAN, INKLUSIVE ALLA UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET Och lämplighet, under inga omständigheter skall Timothy O'Malley vara ansvarig för NÅGRA SPECIELLA, INDIREKTA ELLER FÖLJDSKADOR ELLER NÅGRA SKADOR TILL FÖLJD AV FÖRLUST AV ANVÄNDNING, DATA ELLER VINSTER, OAVSETT OM DET GÄLLER EN TALAN OM AVTAL, FÖRSUMLIGHET ELLER ANNAN SKADESTÅNDSGRUNDANDE SOM UPPSTÅR PÅ GRUND AV ELLER I SAMBAND MED ANVÄNDNING ELLER UTFÖRANDE AV ELLER PRESTANDA AV DENNA PROGRAMVARA.

source: Execution tracing
sv: Spårning av exekvering

source: The :mod:`trace` module contains the following notice::
sv: Modulen :mod:`trace` innehåller följande meddelande::

source: portions copyright 2001, Autonomous Zones Industries, Inc., all rights... err... reserved and offered to the public under the terms of the Python 2.2 license. Author: Zooko O'Whielacronx http://zooko.com/ mailto:zooko@zooko.com Copyright 2000, Mojam Media, Inc., all rights reserved. Author: Skip Montanaro Copyright 1999, Bioreason, Inc., all rights reserved. Author: Andrew Dalke Copyright 1995-1997, Automatrix, Inc., all rights reserved. Author: Skip Montanaro Copyright 1991-1995, Stichting Mathematisch Centrum, all rights reserved. Permission to use, copy, modify, and distribute this Python software and its associated documentation for any purpose without fee is hereby granted, provided that the above copyright notice appears in all copies, and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of neither Automatrix, Bioreason or Mojam Media be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission.
sv: delar copyright 2001, Autonomous Zones Industries, Inc, alla rättigheter... ... reserverade och erbjuds allmänheten enligt villkoren i Python 2.2 licens. Författare: Zooko O'Whielacronx http://zooko.com/ mailto:zooko@zooko.com Copyright 2000, Mojam Media, Inc, alla rättigheter förbehållna. Författare: Skip Montanaro Copyright 1999, Bioreason, Inc, alla rättigheter förbehållna. Författare: Andrew Dalke Upphovsrätt 1995-1997, Automatrix, Inc, alla rättigheter förbehållna. Författare: Skip Montanaro Upphovsrätt 1991-1995, Stichting Mathematisch Centrum, alla rättigheter förbehållna. Tillstånd att använda, kopiera, modifiera och distribuera denna Python-programvara och dess tillhörande dokumentation för alla ändamål utan avgift beviljas härmed beviljas, förutsatt att ovanstående upphovsrättsmeddelande visas i alla kopior, och att både detta upphovsrättsmeddelande och detta meddelande om tillstånd visas i dokumentation, och att namnet på varken Automatrix, Bioreason eller Mojam Media används i reklam eller publicitet som rör distribution av distribution av programvaran utan särskilt, skriftligt förhandstillstånd.

source: UUencode and UUdecode functions
sv: UUencode- och UUdecode-funktioner

source: The ``uu`` codec contains the following notice::
sv: Codec ``uu`` innehåller följande meddelande::

source: Copyright 1994 by Lance Ellinghouse Cathedral City, California Republic, United States of America. All Rights Reserved Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Lance Ellinghouse not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. LANCE ELLINGHOUSE DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL LANCE ELLINGHOUSE CENTRUM BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE. Modified by Jack Jansen, CWI, July 1995: - Use binascii module to do the actual line-by-line conversion between ascii and binary. This results in a 1000-fold speedup. The C version is still 5 times faster, though. - Arguments more compliant with Python standard
sv: Copyright 1994 av Lance Ellinghouse Cathedral City, Republiken Kalifornien, Amerikas förenta stater. Alla rättigheter reserverade Tillstånd att använda, kopiera, modifiera och distribuera denna programvara och dess dokumentation för alla ändamål och utan avgift beviljas härmed, under förutsättning att ovanstående meddelande om upphovsrätt finns med i alla kopior och att både detta upphovsrättsmeddelande och detta meddelande om tillstånd visas i dokumentation, och att namnet Lance Ellinghouse inte används i reklam eller inte används i reklam eller publicitet som rör distribution av programvaran av programvaran utan specifikt, skriftligt förhandstillstånd. LANCE ELLINGHOUSE FRÅNSÄGER SIG ALLA GARANTIER MED AVSEENDE PÅ DENNA PROGRAMVARA, INKLUSIVE ALLA UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET OCH LÄMPLIGHET, UNDER INGA OMSTÄNDIGHETER SKA LANCE ELLINGHOUSE CENTRUM VARA ANSVARIGT FÖR NÅGRA SPECIELLA, INDIREKTA ELLER FÖLJDSKADOR ELLER NÅGRA SKADOR TILL FÖLJD AV FÖRLUST AV ANVÄNDNING, DATA ELLER VINSTER, OAVSETT OM DET ÄR KONTRAKT, FÖRSUMLIGHET ELLER ANNAN SKADESTÅNDSGRUNDANDE HANDLING, SOM UPPSTÅR UR AV ELLER I SAMBAND MED ANVÄNDNING ELLER UTFÖRANDE AV DENNA PROGRAMVARA. Modifierad av Jack Jansen, CWI, juli 1995: - Använd binascii-modulen för att göra den faktiska rad-för-rad-konverteringen mellan ascii och binär. Detta resulterar i en 1000-faldig hastighetsökning. C versionen är dock fortfarande 5 gånger snabbare. - Argument som är mer kompatibla med Python-standarden

source: XML Remote Procedure Calls
sv: XML-anrop för fjärrprocedurer

source: The :mod:`xmlrpc.client` module contains the following notice::
sv: Modulen :mod:`xmlrpc.client` innehåller följande meddelande::
