Repository: yeager/python-docs-sv
Catalog: license.po
Languages: sv

source: History and License
sv: Historik och licens

source: History of the software
sv: Programvarans historia

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
sv: Python skapades i början av 1990-talet av Guido van Rossum vid Stichting Mathematisch Centrum (CWI, se https://www.cwi.nl) i Nederländerna som en efterföljare till ett språk som kallades ABC. Guido är fortfarande Pythons huvudförfattare, även om det innehåller många bidrag från andra.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us) in Reston, Virginia where he released several versions of the software.
sv: Under 1995 fortsatte Guido sitt arbete med Python på Corporation for National Research Initiatives (CNRI, se https://www.cnri.reston.va.us) i Reston, Virginia, där han släppte flera versioner av programvaran.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations, which became Zope Corporation. In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation was a sponsoring member of the PSF.
sv: I maj 2000 flyttade Guido och Python core development team till BeOpen.com för att bilda BeOpen PythonLabs team. I oktober samma år flyttade PythonLabs-teamet till Digital Creations, som blev Zope Corporation. År 2001 bildades Python Software Foundation (PSF, se https://www.python.org/psf/), en ideell organisation som skapades specifikt för att äga Python-relaterad immateriell egendom. Zope Corporation var en av PSF:s sponsrande medlemmar.

source: All Python releases are Open Source (see https://opensource.org for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
sv: Alla Python-versioner är Open Source (se https://opensource.org för definitionen av Open Source). Historiskt sett har de flesta, men inte alla, Python-versioner också varit GPL-kompatibla; tabellen nedan sammanfattar de olika versionerna.

source: Derived from
sv: Hämtad från

source: Year
sv: År

source: Owner
sv: Ägare

source: GPL-compatible? (1)
sv: GPL-kompatibel? (1)

source: 0.9.0 thru 1.2
sv: 0.9,0 till och med 1,2

source: yes
sv: ja

source: 1.3 thru 1.5.2
sv: 1.3 genom 1.5.2

source: no
sv: nej

source: yes (2)
sv: ja (2)

source: 2.2 and above
sv: 2.2 och högre

source: 2001-now
sv: 2001-nu

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
sv: GPL-kompatibel betyder inte att vi distribuerar Python under GPL. Alla Python-licenser, till skillnad från GPL, låter dig distribuera en modifierad version utan att göra dina ändringar till öppen källkod. De GPL-kompatibla licenserna gör det möjligt att kombinera Python med annan programvara som släpps under GPL; de andra gör det inte.

source: According to Richard Stallman, 1.6.1 is not GPL-compatible, because its license has a choice of law clause. According to CNRI, however, Stallman's lawyer has told CNRI's lawyer that 1.6.1 is "not incompatible" with the GPL.
sv: Enligt Richard Stallman är 1.6.1 inte kompatibel med GPL, eftersom licensen innehåller en klausul om lagval. Enligt CNRI har dock Stallmans advokat sagt till CNRI:s advokat att 1.6.1 "inte är oförenlig" med GPL.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
sv: Tack till de många externa volontärer som har arbetat under Guidos ledning för att göra dessa utgåvor möjliga.

source: Terms and conditions for accessing or otherwise using Python
sv: Villkor för åtkomst till eller annan användning av Python

source: Python software and documentation are licensed under the Python Software Foundation License Version 2.
sv: Python-programvara och dokumentation är licensierad enligt Python Software Foundation License Version 2.

source: Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Version 2 and the :ref:`Zero-Clause BSD license <BSD0>`.
sv: Från och med Python 3.8.6 är exempel, recept och annan kod i dokumentationen dubbellicensierad enligt PSF-licensen version 2 och :ref:``Zero-Clause BSD license <BSD0>``.

source: Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. See :ref:`OtherLicenses` for an incomplete list of these licenses.
sv: Viss programvara som ingår i Python är under olika licenser. Licenserna listas med kod som faller under den licensen. Se :ref:`OtherLicenses` för en ofullständig lista över dessa licenser.

source: PYTHON SOFTWARE FOUNDATION LICENSE VERSION 2
sv: PYTHON SOFTWARE FOUNDATION LICENS VERSION 2

source: 1. This LICENSE AGREEMENT is between the Python Software Foundation ("PSF"), and the Individual or Organization ("Licensee") accessing and otherwise using this software ("Python") in source or binary form and its associated documentation. 2. Subject to the terms and conditions of this License Agreement, PSF hereby grants Licensee a nonexclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use Python alone or in any derivative version, provided, however, that PSF's License Agreement and PSF's notice of copyright, i.e., "Copyright © 2001 Python Software Foundation; All Rights Reserved" are retained in Python alone or in any derivative version prepared by Licensee. 3. In the event Licensee prepares a derivative work that is based on or incorporates Python or any part thereof, and wants to make the derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python. 4. PSF is making Python available to Licensee on an "AS IS" basis. PSF MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, PSF MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 5. PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 6. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 7. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between PSF and Licensee. This License Agreement does not grant permission to use PSF trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party. 8. By copying, installing or otherwise using Python, Licensee agrees to be bound by the terms and conditions of this License Agreement.
sv: 1. Detta licensavtal gäller mellan Python Software Foundation ("PSF") och den individ eller organisation ("licenstagare") som får tillgång till och på annat sätt använder denna programvaran ("Python") i källkod eller binär form och dess tillhörande dokumentation. 2. I enlighet med villkoren i detta licensavtal beviljar PSF härmed bevilja Licenstagaren en icke-exklusiv, royaltyfri, världsomspännande licens att reproducera, analysera, testa, utföra och/eller visa offentligt, förbereda härledda verk distribuera och på annat sätt använda Python ensam eller i någon derivatversion version, dock under förutsättning att PSF:s licensavtal och PSF:s meddelande om upphovsrätt, dvs. "Copyright © 2001 Python Software Foundation; Alla rättigheter Förbehållna", finns kvar i Python eller i någon avledande version som som utarbetats av licensinnehavaren. 3. Om licensinnehavaren utarbetar ett härlett verk som baseras på eller python eller någon del därav, och vill göra det härledda arbetet tillgängligt vill göra det härledda arbetet tillgängligt för andra enligt vad som anges här, samtycker licenstagaren härmed samtycker Licenstagaren härmed till att i ett sådant arbete inkludera en kort sammanfattning av de ändringar som gjorts i Python. 4. PSF gör Python tillgängligt för Licenstagaren på en "SOM DET ÄR"-basis. PSF GÖR INGA UTFÄSTELSER ELLER GARANTIER, VARE SIG UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA. SOM EXEMPEL, MEN INTE BEGRÄNSNING, GÖR PSF INGA OCH FRÅNSÄGER SIG ALLA UTFÄSTELSER ELLER GARANTI FÖR SÄLJBARHET ELLER LÄMPLIGHET FÖR NÅGOT SÄRSKILT ÄNDAMÅL ELLER ATT ANVÄNDNING AV PYTHON INTE KOMMER ATT GÖRA INTRÅNG I TREDJE PARTS RÄTTIGHETER. 5. PSF SKA INTE VARA ANSVARIGT GENTEMOT LICENSTAGAREN ELLER ANDRA ANVÄNDARE AV PYTHON FÖR EVENTUELLA TILLFÄLLIGA, SPECIELLA ELLER FÖLJDSKADOR ELLER FÖRLUSTER SOM ETT RESULTAT AV MODIFIERING, DISTRIBUTION ELLER ANNAN ANVÄNDNING AV PYTHON, ELLER NÅGOT DERIVAT DÄRAV DÄRAV, ÄVEN OM DE INFORMERATS OM MÖJLIGHETEN TILL DETTA. 6. Detta licensavtal upphör automatiskt att gälla vid ett väsentligt brott mot dess villkor och bestämmelser. 7. Ingenting i detta licensavtal ska anses skapa något förhållande mellan PSF och agentur, partnerskap eller joint venture mellan PSF och licenstagaren. Detta licensavtal Licensavtalet ger inte tillstånd att använda PSF:s varumärken eller firmanamn i för att stödja eller marknadsföra produkter eller tjänster som tillhör licenstagaren eller någon tredje part. 8. Genom att kopiera, installera eller på annat sätt använda Python samtycker licenstagaren till att att vara bunden av villkoren i detta licensavtal.

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
sv: BEOPEN.COM LICENSAVTAL FÖR PYTHON 2.0

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
sv: BEOPEN PYTHON LICENSAVTAL FÖR ÖPPEN KÄLLKOD VERSION 1

source: 1. This LICENSE AGREEMENT is between BeOpen.com ("BeOpen"), having an office at 160 Saratoga Avenue, Santa Clara, CA 95051, and the Individual or Organization ("Licensee") accessing and otherwise using this software in source or binary form and its associated documentation ("the Software"). 2. Subject to the terms and conditions of this BeOpen Python License Agreement, BeOpen hereby grants Licensee a non-exclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use the Software alone or in any derivative version, provided, however, that the BeOpen Python License is retained in the Software, alone or in any derivative version prepared by Licensee. 3. BeOpen is making the Software available to Licensee on an "AS IS" basis. BEOPEN MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, BEOPEN MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 4. BEOPEN SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE SOFTWARE FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 5. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 6. This License Agreement shall be governed by and interpreted in all respects by the law of the State of California, excluding conflict of law provisions. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between BeOpen and Licensee. This License Agreement does not grant permission to use BeOpen trademarks or trade names in a trademark sense to endorse or promote products or services of Licensee, or any third party. As an exception, the "BeOpen Python" logos available at http://www.pythonlabs.com/logos.html may be used according to the permissions granted on that web page. 7. By copying, installing or otherwise using the software, Licensee agrees to be bound by the terms and conditions of this License Agreement.
sv: 1. Detta LICENSAVTAL är mellan BeOpen.com ("BeOpen"), med kontor på 160 Saratoga Avenue, Santa Clara, CA 95051, och den individ eller organisation ("Licenstagaren") som får tillgång till och på annat sätt använder denna programvara i källkods- eller binär form och dess tillhörande dokumentation ("Programvaran"). 2. Med förbehåll för villkoren i detta BeOpen Python-licensavtal, BeOpen härmed Licenstagaren en icke-exklusiv, royaltyfri, världsomspännande licens att reproducera, analysera, testa, utföra och/eller visa offentligt, förbereda härledda distribuera och på annat sätt använda programvaran ensam eller i någon härledd version, förutsatt version, dock under förutsättning att BeOpen Python-licensen behålls i programvaran, ensam Programvaran, ensam eller i någon derivatversion som utarbetats av licenstagaren. 3. BeOpen gör Programvaran tillgänglig för Licenstagaren på en "SOM DEN ÄR"-basis. BEOPEN GÖR INGA UTFÄSTELSER ELLER GARANTIER, UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA. SOM EXEMPEL, MEN INTE BEGRÄNSAT TILL, GÖR BEOPEN INGA OCH FRÅNSÄGER SIG ALLA UTFÄSTELSER ELLER ELLER GARANTI FÖR SÄLJBARHET ELLER LÄMPLIGHET FÖR NÅGOT SÄRSKILT ÄNDAMÅL ELLER ATT ANVÄNDNING AV PROGRAMVARAN INTE KOMMER ATT GÖRA INTRÅNG I TREDJE PARTS RÄTTIGHETER. 4. BEOPEN SKA INTE VARA ANSVARIGT GENTEMOT LICENSTAGAREN ELLER ANDRA ANVÄNDARE AV PROGRAMVARAN FÖR EVENTUELLA TILLFÄLLIGA, SÄRSKILDA ELLER FÖLJDSKADOR ELLER FÖRLUSTER TILL FÖLJD AV ANVÄNDNING, MODIFIERING ELLER DISTRIBUTION AV PROGRAMVARAN MODIFIERA ELLER DISTRIBUERA PROGRAMVARAN, ELLER NÅGOT DERIVAT DÄRAV, ÄVEN OM OM UNDERRÄTTAD OM MÖJLIGHETEN TILL DETTA. 5. Detta licensavtal upphör automatiskt att gälla vid ett väsentligt brott mot dess villkor och bestämmelser. 6. Detta licensavtal ska i alla avseenden regleras av och tolkas enligt av lagen i delstaten Kalifornien, med undantag för bestämmelser om lagkonflikter. Ingenting i detta licensavtal ska anses skapa något förhållande av agentur, partnerskap eller joint venture mellan BeOpen och licenstagaren. Detta licensavtal Licensavtalet ger inte tillstånd att använda BeOpen-varumärken eller handelsnamn i varumärkes för att stödja eller marknadsföra produkter eller tjänster från Licenstagaren eller någon tredje part. Som ett undantag får "BeOpen Python"-logotyperna som finns tillgängliga på http://www.pythonlabs.com/logos.html får användas i enlighet med de tillstånd som som beviljas på den webbsidan. 7. Genom att kopiera, installera eller på annat sätt använda programvaran samtycker licensinnehavaren till att vara till att vara bunden av villkoren i detta licensavtal.

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
sv: CNRI LICENSAVTAL FÖR PYTHON 1.6.1

source: 1. This LICENSE AGREEMENT is between the Corporation for National Research Initiatives, having an office at 1895 Preston White Drive, Reston, VA 20191 ("CNRI"), and the Individual or Organization ("Licensee") accessing and otherwise using Python 1.6.1 software in source or binary form and its associated documentation. 2. Subject to the terms and conditions of this License Agreement, CNRI hereby grants Licensee a nonexclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use Python 1.6.1 alone or in any derivative version, provided, however, that CNRI's License Agreement and CNRI's notice of copyright, i.e., "Copyright © 1995-2001 Corporation for National Research Initiatives; All Rights Reserved" are retained in Python 1.6.1 alone or in any derivative version prepared by Licensee. Alternately, in lieu of CNRI's License Agreement, Licensee may substitute the following text (omitting the quotes): "Python 1.6.1 is made available subject to the terms and conditions in CNRI's License Agreement. This Agreement together with Python 1.6.1 may be located on the internet using the following unique, persistent identifier (known as a handle): 1895.22/1013. This Agreement may also be obtained from a proxy server on the internet using the following URL: http://hdl.handle.net/1895.22/1013". 3. In the event Licensee prepares a derivative work that is based on or incorporates Python 1.6.1 or any part thereof, and wants to make the derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python 1.6.1. 4. CNRI is making Python 1.6.1 available to Licensee on an "AS IS" basis. CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6.1 WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 5. CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON 1.6.1 FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON 1.6.1, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 6. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 7. This License Agreement shall be governed by the federal intellectual property law of the United States, including without limitation the federal copyright law, and, to the extent such U.S. federal law does not apply, by the law of the Commonwealth of Virginia, excluding Virginia's conflict of law provisions. Notwithstanding the foregoing, with regard to derivative works based on Python 1.6.1 that incorporate non-separable material that was previously distributed under the GNU General Public License (GPL), the law of the Commonwealth of Virginia shall govern this License Agreement only as to issues arising under or with respect to Paragraphs 4, 5, and 7 of this License Agreement. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between CNRI and Licensee. This License Agreement does not grant permission to use CNRI trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party. 8. By clicking on the "ACCEPT" button where indicated, or by copying, installing or otherwise using Python 1.6.1, Licensee agrees to be bound by the terms and conditions of this License Agreement.
sv: 1. Detta licensavtal ingås mellan Corporation for National Research Initiatives Initiatives, med kontor på 1895 Preston White Drive, Reston, VA 20191 ("CNRI") och den individ eller organisation ("licenstagaren") som får tillgång till och på annat sätt använda Python 1.6.1-programvara i källkod eller binär form och dess tillhörande dokumentation. 2. I enlighet med villkoren i detta licensavtal beviljar CNRI härmed ger CNRI härmed licenstagaren en icke-exklusiv, royaltyfri, världsomspännande licens att reproducera analysera, testa, utföra och/eller visa offentligt, förbereda härledda verk distribuera och på annat sätt använda Python 1.6.1 ensam eller i någon derivatversion, dock under förutsättning att CNRI:s licensavtal och CNRI:s meddelande om upphovsrätt, dvs. "Copyright © 1995-2001 Corporation for National Research Initiatives; Alla rättigheter Rights Reserved" behålls i Python 1.6.1 ensam eller i någon derivatversion som som utarbetats av licensinnehavaren. Alternativt, i stället för CNRI:s licensavtal, Licenstagaren får ersätta följande text (utan citattecken): "Python 1.6.1 görs tillgänglig i enlighet med villkoren i CNRI:s licensavtal Licensavtal. Detta avtal tillsammans med Python 1.6.1 kan lokaliseras på internet internet med hjälp av följande unika, beständiga identifierare (känd som ett handtag): 1895.22/1013. Detta avtal kan också erhållas från en proxyserver på internet internet med hjälp av följande URL: http://hdl.handle.net/1895.22/1013". 3. I händelse av att Licenstagaren förbereder ett härlett arbete som är baserat på eller python 1.6.1 eller någon del därav, och vill göra det härledda arbetet tillgängligt för tillgängligt för andra enligt vad som anges häri, samtycker Licenstagaren härmed till att inkludera en kort sammanfattning av de ändringar som gjorts i Python 1.6.1 i ett sådant arbete. 4. CNRI gör Python 1.6.1 tillgängligt för licenstagaren i befintligt skick. CNRI GÖR INGA UTFÄSTELSER ELLER GARANTIER, VARE SIG UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA. SOM EXEMPEL, MEN INTE BEGRÄNSAT, GÖR CNRI INGA OCH FRÅNSÄGER SIG ALLA UTFÄSTELSER ELLER GARANTIER OM SÄLJBARHET ELLER LÄMPLIGHET FÖR NÅGOT SÄRSKILT ÄNDAMÅL ELLER ATT ANVÄNDNINGEN AV PYTHON 1.6.1 INTE KOMMER ATT GÖRA INTRÅNG I TREDJE PARTS RÄTTIGHETER. 5. CNRI SKA INTE VARA ANSVARIGT GENTEMOT LICENSTAGAREN ELLER ANDRA ANVÄNDARE AV PYTHON 1.6.1 FÖR NÅGRA TILLFÄLLIGA, SPECIELLA ELLER FÖLJDSKADOR ELLER FÖRLUSTER TILL FÖLJD AV MODIFIERING, DISTRIBUTION ELLER ANNAN ANVÄNDNING AV PYTHON 1.6.1, ELLER NÅGOT DERIVAT DÄRAV DÄRAV, ÄVEN OM DE INFORMERATS OM MÖJLIGHETEN TILL DETTA. 6. Detta licensavtal upphör automatiskt att gälla vid ett väsentligt brott mot dess villkor och bestämmelser. 7. Detta licensavtal ska regleras av federal immaterialrättslig lagstiftning i immateriella rättigheter i USA, inklusive utan begränsning den federala upphovsrättslagen upphovsrätt, och, i den mån sådan amerikansk federal lag inte är tillämplig, av lagen i Commonwealth Virginia, med undantag för Virginias bestämmelser om lagkonflikter. Oaktat det föregående, med avseende på härledda verk baserade på Python 1.6.1 som innehåller icke-separerbart material som tidigare distribuerats under GNU General Public License (GPL), ska lagen i Commonwealth of Virginia reglera detta Virginia ska styra detta licensavtal endast när det gäller frågor som uppstår under eller med avseende på med avseende på paragraferna 4, 5 och 7 i detta licensavtal. Ingenting i detta detta licensavtal skall inte anses skapa något agentförhållande, partnerskap partnerskap eller joint venture mellan CNRI och licenstagaren. Detta licensavtal ger inte tillstånd att använda CNRI:s varumärken eller firmanamn i varumärkesmässig för att stödja eller marknadsföra produkter eller tjänster från licenstagaren eller någon tredje part tredje part. 8. Genom att klicka på knappen "ACCEPTERA" där så anges, eller genom att kopiera, installera eller på annat sätt använda Python 1.6.1, samtycker licenstagaren till att vara bunden av villkoren i villkoren i detta licensavtal.

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
sv: CWI LICENSAVTAL FÖR PYTHON 0.9.0 TILL OCH MED 1.2
