Repository: yeager/python-docs-sv
Catalog: license.po
Languages: sv

source: Copyright (c) 1996-2008 Red Hat, Inc and others. Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
sv: Copyright (c) 1996-2008 Red Hat, Inc och andra. Tillstånd beviljas härmed, kostnadsfritt, till varje person som erhåller en kopia av denna programvara och tillhörande dokumentationsfiler ("Programvaran") "Programvaran"), att handla med Programvaran utan begränsning, inklusive utan begränsning rätten att använda, kopiera, modifiera, sammanfoga, publicera distribuera, underlicensiera och/eller sälja kopior av programvaran, och att tillåta personer till vilka programvaran tillhandahålls att göra detta, med förbehåll för följande villkor: Ovanstående upphovsrättsmeddelande och detta meddelande om tillstånd ska inkluderas i alla kopior eller väsentliga delar av programvaran. PROGRAMVARAN TILLHANDAHÅLLS "I BEFINTLIGT SKICK", UTAN GARANTIER AV NÅGOT SLAG, UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA, INKLUSIVE MEN INTE BEGRÄNSAT TILL GARANTIERNA FÖR SÄLJBARHET, LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL OCH ICKE-INTRÅNG. UNDER INGA OMSTÄNDIGHETER SKA FÖRFATTARNA ELLER UPPHOVSRÄTTSINNEHAVARNA UPPHOVSRÄTTSINNEHAVARE VARA ANSVARIGA FÖR NÅGOT ANSPRÅK, SKADESTÅND ELLER ANNAT ANSVAR, OAVSETT OM DET RÖR SIG OM AVTAL, SKADESTÅND ELLER ANNAT, SOM HÄRRÖR FRÅN, FRÅN, UR ELLER I SAMBAND MED PROGRAMVARAN ELLER ANVÄNDNINGEN ELLER ANNAN ANVÄNDNING ELLER ANNAN HANTERING AV PROGRAMVARAN.

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
sv: Tillägget :mod:`zlib` byggs med en inkluderad kopia av zlib-källorna om den zlib-version som finns i systemet är för gammal för att användas för build::

source: Copyright (C) 1995-2011 Jean-loup Gailly and Mark Adler This software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software. Permission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions: 1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required. 2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software. 3. This notice may not be removed or altered from any source distribution. Jean-loup Gailly Mark Adler jloup@gzip.org madler@alumni.caltech.edu
sv: Copyright (C) 1995-2011 Jean-loup Gailly och Mark Adler Denna programvara tillhandahålls "i befintligt skick", utan någon uttrycklig eller underförstådd garanti. Författarna kan inte under några omständigheter hållas ansvariga för skador som uppstår till följd av användningen av denna programvara. Tillstånd ges till vem som helst att använda denna programvara för alla ändamål, inklusive kommersiella applikationer, och att ändra den och omfördela den fritt, med förbehåll för följande begränsningar: 1. Ursprunget till denna programvara får inte förvrängas; du får inte hävda att du har skrivit den ursprungliga programvaran. Om du använder den här programvaran i en produkt, skulle en bekräftelse i produktdokumentationen uppskattas men uppskattas men är inte ett krav. 2. Ändrade källversioner måste tydligt markeras som sådana och får inte felaktigt framställas som den ursprungliga programvaran. 3. Detta meddelande får inte tas bort eller ändras från någon källdistribution. Jean-loup Gailly Mark Adler jloup@gzip.org madler@alumni.caltech.edu

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
sv: Implementeringen av hashtabellen som används av :mod:`tracemalloc` är baserad på cfuhash-projektet::

source: Copyright (c) 2005 Don Owens All rights reserved. This code is released under the BSD license: Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: * Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. * Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. * Neither the name of the author nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
sv: Upphovsrätt (c) 2005 Don Owens Alla rättigheter förbehållna. Denna kod är släppt under BSD-licensen: Omdistribution och användning i käll- och binärform, med eller utan eller utan modifiering, är tillåtet under förutsättning att följande villkor är uppfyllda: * Vidaredistribution av källkod måste innehålla ovanstående meddelande om upphovsrätt upphovsrätt, denna lista med villkor och följande ansvarsfriskrivning. * Vidaredistributioner i binär form måste återge ovanstående upphovsrättsmeddelandet, denna lista över villkor och följande ansvarsfriskrivning i dokumentationen och/eller annat material som tillhandahålls med distributionen. * Varken författarens namn eller namnen på dess bidragsgivare bidragsgivare får användas för att stödja eller marknadsföra produkter som härrör från denna programvara utan särskilt skriftligt tillstånd i förväg. DENNA PROGRAMVARA TILLHANDAHÅLLS AV UPPHOVSRÄTTSINNEHAVARNA OCH BIDRAGSGIVARNA "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE MEN INTE BEGRÄNSAT TILL, UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL FRÅNSÄGS. UNDER INGA OMSTÄNDIGHETER SKA UPPHOVSRÄTTSINNEHAVAREN ELLER BIDRAGSGIVARNA VARA ANSVARIGA FÖR DIREKTA, INDIREKTA INDIREKTA, TILLFÄLLIGA, SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL, ANSKAFFNING AV ERSÄTTNINGSVAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER VINST; ELLER AVBROTT I VERKSAMHETEN) OAVSETT ORSAK OCH OAVSETT ANSVARSTEORI, OAVSETT OM DET RÖR SIG OM AVTAL STRIKT ANSVAR ELLER SKADESTÅNDSSKYLDIGHET (INKLUSIVE VÅRDSLÖSHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR TILL FÖLJD AV ANVÄNDNINGEN AV DENNA PROGRAMVARA, ÄVEN OM OM MÖJLIGHETEN TILL SÅDAN SKADA.

source: The :mod:`!_decimal` C extension underlying the :mod:`decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
sv: C-tillägget :mod:`!_decimal`, som ligger till grund för modulen :mod:`decimal`, byggs med en inkluderad kopia av libmpdec-biblioteket, såvida inte konfigurationen är ``--with-system-libmpdec``::

source: Copyright (c) 2008-2020 Stefan Krah. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
sv: Copyright (c) 2008-2020 Stefan Krah. Alla rättigheter reserverade. Vidaredistribution och användning i käll- och binärform, med eller utan eller utan modifiering, är tillåtna förutsatt att följande villkor är uppfyllda: 1. Vidaredistribution av källkod måste innehålla ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista över villkor och följande ansvarsfriskrivning. 2. Vidaredistribution i binär form måste återge ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista med villkor och följande ansvarsfriskrivning i dokumentation och/eller annat material som tillhandahålls med distributionen. DENNA PROGRAMVARA TILLHANDAHÅLLS AV FÖRFATTAREN OCH BIDRAGSGIVARNA "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE BEGRÄNSAT TILL UNDERFÖRSTÅDDA GARANTIERNA FÖR SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL FÖR ETT VISST ÄNDAMÅL. UNDER INGA OMSTÄNDIGHETER SKA FÖRFATTAREN ELLER BIDRAGSGIVARNA VARA ANSVARIGA FÖR DIREKTA, INDIREKTA, TILLFÄLLIGA, SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR SKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL, ANSKAFFNING AV ERSÄTTNINGSVAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER VINSTER; ELLER AFFÄRSAVBROTT) OAVSETT ORSAK OCH OAVSETT ANSVARSTEORI, OAVSETT OM DET RÖR SIG OM AVTAL, STRIKT STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE VÅRDSLÖSHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR AV ANVÄNDNINGEN AV DENNA PROGRAMVARA, ÄVEN OM DU INFORMERATS OM MÖJLIGHETEN TILL SÅDAN SKADA.

source: W3C C14N test suite
sv: W3C C14N testsvit

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license::
sv: Testsviten för C14N 2.0 i paketet :mod:`test` (``Lib/test/xmltestdata/c14n-20/``) hämtades från W3C:s webbplats på https://www.w3.org/TR/xml-c14n2-testcases/ och distribueras under BSD-licensen 3-clause::

source: Copyright (c) 2013 W3C(R) (MIT, ERCIM, Keio, Beihang), All Rights Reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: * Redistributions of works must retain the original copyright notice, this list of conditions and the following disclaimer. * Redistributions in binary form must reproduce the original copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. * Neither the name of the W3C nor the names of its contributors may be used to endorse or promote products derived from this work without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
sv: Copyright (c) 2013 W3C(R) (MIT, ERCIM, Keio, Beihang), Alla rättigheter reserverade. Vidaredistribution och användning i käll- och binärform, med eller utan eller utan modifiering, är tillåtet under förutsättning att följande villkor är uppfyllda: * Vidaredistribution av verk måste behålla det ursprungliga upphovsrättsmeddelandet, denna lista med villkor och följande ansvarsfriskrivning. * Omdistributioner i binär form måste återge det ursprungliga upphovsrättsmeddelandet upphovsrättsmeddelandet, denna lista med villkor och följande ansvarsfriskrivning i dokumentation och/eller annat material som tillhandahålls med distributionen. * Varken W3C:s namn eller namnen på dess bidragsgivare får användas för att användas för att stödja eller marknadsföra produkter som härrör från detta arbete utan särskilt skriftligt tillstånd i förväg. DENNA PROGRAMVARA TILLHANDAHÅLLS AV UPPHOVSRÄTTSINNEHAVARNA OCH BIDRAGSGIVARNA "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE MEN INTE BEGRÄNSAT TILL, UNDERFÖRSTÅDDA GARANTIER FÖR SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST SYFTE FRÅNSÄGS. UNDER INGA OMSTÄNDIGHETER SKA UPPHOVSRÄTTSINNEHAVAREN UPPHOVSRÄTTSINNEHAVAREN ELLER BIDRAGSGIVARNA VARA ANSVARIGA FÖR DIREKTA, INDIREKTA, TILLFÄLLIGA SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR (INKLUSIVE, MEN INTE BEGRÄNSAT TILL, ANSKAFFNING AV ERSÄTTANDE VAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER VINSTER; ELLER AVBROTT I VERKSAMHETEN) OAVSETT ORSAK OCH PÅ NÅGON ANSVARSTEORI, OAVSETT OM DET GÄLLER AVTAL, STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE FÖRSUMLIGHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR UR ANVÄNDNINGEN AV AV DENNA PROGRAMVARA, ÄVEN OM MAN INFORMERATS OM MÖJLIGHETEN TILL SÅDAN SKADA.

source: MIT License::
sv: MIT-licens::

source: Copyright (c) 2018-2021 Microsoft Corporation, Daan Leijen Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
sv: Upphovsrätt (c) 2018-2021 Microsoft Corporation, Daan Leijen Tillstånd beviljas härmed, kostnadsfritt, till alla personer som erhåller en kopia av denna programvara och tillhörande dokumentationsfiler ("Programvaran"), att handla i programvaran utan begränsning, inklusive utan begränsning rättigheterna att använda, kopiera, modifiera, sammanfoga, publicera, distribuera, underlicensiera och/eller sälja och/eller sälja kopior av programvaran, och att tillåta personer till vilka programvaran tillhandahålls att göra detta, med förbehåll för följande villkor: Ovanstående meddelande om upphovsrätt och detta meddelande om tillstånd ska ingå i alla kopior eller väsentliga delar av programvaran. PROGRAMVARAN TILLHANDAHÅLLS "I BEFINTLIGT SKICK", UTAN GARANTIER AV NÅGOT SLAG, UTTRYCKLIGA ELLER ELLER UNDERFÖRSTÅDD, INKLUSIVE MEN INTE BEGRÄNSAT TILL GARANTIERNA FÖR SÄLJBARHET LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL OCH ICKE-INTRÅNG. UNDER INGA OMSTÄNDIGHETER SKA UPPHOVSMÄNNEN ELLER UPPHOVSRÄTTSINNEHAVARNA VARA ANSVARIGA FÖR ANSPRÅK, SKADESTÅND ELLER ANNAN SKADESTÅND ELLER ANNAT ANSVAR, OAVSETT OM DET RÖR SIG OM AVTAL, SKADESTÅND ELLER ANNAT, SOM HÄRRÖR FRÅN FRÅN, UR ELLER I SAMBAND MED PROGRAMVARAN ELLER ANVÄNDNING ELLER ANNAN HANTERING AV PROGRAMVARAN.

source: Parts of the :mod:`asyncio` module are incorporated from `uvloop 0.16 <https://github.com/MagicStack/uvloop/tree/v0.16.0>`_, which is distributed under the MIT license::
sv: Delar av modulen :mod:`asyncio` är hämtade från `uvloop 0.16 <https://github.com/MagicStack/uvloop/tree/v0.16.0>`_, som distribueras under MIT-licensen::

source: Copyright (c) 2015-2021 MagicStack Inc. http://magic.io Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
sv: Copyright (c) 2015-2021 MagicStack Inc. http://magic.io Tillstånd beviljas härmed, kostnadsfritt, till alla personer som erhåller en kopia av denna programvara och tillhörande dokumentationsfiler ("Programvaran") "Programvaran"), att handla med Programvaran utan begränsning, inklusive utan begränsning rätten att använda, kopiera, modifiera, slå samman, publicera distribuera, underlicensiera och/eller sälja kopior av programvaran, och att tillåta personer till vilka programvaran tillhandahålls att göra detta, med förbehåll för följande villkor: Ovanstående meddelande om upphovsrätt och detta meddelande om tillstånd ska ingå i alla kopior eller väsentliga delar av programvaran. PROGRAMVARAN TILLHANDAHÅLLS "I BEFINTLIGT SKICK", UTAN GARANTIER AV NÅGOT SLAG, UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA, INKLUSIVE MEN INTE BEGRÄNSAT TILL GARANTIERNA FÖR SÄLJBARHET, LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL OCH ICKE-INTRÅNG. UNDER INGA OMSTÄNDIGHETER SKA FÖRFATTARNA ELLER UPPHOVSRÄTTSINNEHAVARNA VARA ANSVARIG FÖR NÅGOT ANSPRÅK, SKADESTÅND ELLER ANNAT ANSVAR, VARE SIG I EN TALAN KONTRAKT, SKADESTÅND ELLER PÅ ANNAT SÄTT, SOM UPPSTÅR FRÅN, UR ELLER I SAMBAND MED MED PROGRAMVARAN ELLER ANVÄNDNINGEN ELLER ANNAN HANTERING AV PROGRAMVARAN.

source: Global Unbounded Sequences (GUS)
sv: Globala obegränsade sekvenser (GUS)

source: The file :file:`Python/qsbr.c` is adapted from FreeBSD's "Global Unbounded Sequences" safe memory reclamation scheme in `subr_smr.c <https://github.com/freebsd/freebsd-src/blob/main/sys/kern/subr_smr.c>`_. The file is distributed under the 2-Clause BSD License::
sv: Filen :file:`Python/qsbr.c` är anpassad från FreeBSD:s "Global Unbounded Sequences" säkra minnesåtervinningsschema i `subr_smr.c <https://github.com/freebsd/freebsd-src/blob/main/sys/kern/subr_smr.c>`_. Filen distribueras under 2-Clause BSD License::

source: Copyright (c) 2019,2020 Jeffrey Roberson <jeff@FreeBSD.org> Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice unmodified, this list of conditions, and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE AUTHOR "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
sv: Copyright (c) 2019,2020 Jeffrey Roberson <jeff@FreeBSD.org> Vidaredistribution och användning i käll- och binärform, med eller utan modifiering, är tillåtet under förutsättning att följande villkor är uppfyllda: 1. Vidaredistribution av källkod måste behålla ovanstående upphovsrättsmeddelande oförändrat, denna lista med villkor och följande ansvarsfriskrivning ansvarsfriskrivning. 2. Vidaredistribution i binär form måste återge ovanstående meddelande om upphovsrätt ovanstående upphovsrättsmeddelande, denna lista med villkor och följande ansvarsfriskrivning i dokumentation och/eller annat material som tillhandahålls med distributionen. DENNA PROGRAMVARA TILLHANDAHÅLLS AV FÖRFATTAREN "I BEFINTLIGT SKICK" OCH ALLA UTTRYCKLIGA ELLER ELLER UNDERFÖRSTÅDDA GARANTIER, INKLUSIVE, MEN INTE BEGRÄNSAT TILL, DE UNDERFÖRSTÅDDA GARANTIERNA AV SÄLJBARHET OCH LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL FRÅNSÄGS. FÖRFATTAREN SKALL UNDER INGA OMSTÄNDIGHETER HÅLLAS ANSVARIG FÖR DIREKTA, INDIREKTA, INDIREKTA, TILLFÄLLIGA, SPECIELLA, EXEMPLIFIERANDE ELLER FÖLJDSKADOR (INKLUSIVE, MEN MEN INTE BEGRÄNSAT TILL, UPPHANDLING AV ERSÄTTNINGSVAROR ELLER TJÄNSTER; FÖRLUST AV ANVÄNDNING, DATA ELLER VINSTER; ELLER AVBROTT I VERKSAMHETEN) OAVSETT ORSAK OCH PÅ NÅGON ANSVARSTEORI, OAVSETT OM DET GÄLLER AVTAL, STRIKT ANSVAR ELLER SKADESTÅND (INKLUSIVE FÖRSUMLIGHET ELLER ANNAT) SOM PÅ NÅGOT SÄTT UPPSTÅR GENOM ANVÄNDNINGEN AV DENNA PROGRAMVARA, ÄVEN OM DU INFORMERATS OM MÖJLIGHETEN TILL SÅDAN SKADA.

source: Zstandard bindings
sv: Zstandard-bindningar
