Repository: yeager/python-docs-sv
Catalog: license.po
Languages: sv

source: Apache License Version 2.0, January 2004 https://www.apache.org/licenses/ TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION 1. Definitions. "License" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document. "Licensor" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License. "Legal Entity" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, "control" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity. "You" (or "Your") shall mean an individual or Legal Entity exercising permissions granted by this License. "Source" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files. "Object" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types. "Work" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below). "Derivative Works" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof. "Contribution" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, "submitted" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as "Not a Contribution." "Contributor" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work. 2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form. 3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed. 4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions: (a) You must give any other recipients of the Work or Derivative Works a copy of this License; and (b) You must cause any modified files to carry prominent notices stating that You changed the files; and (c) You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and (d) If the Work includes a "NOTICE" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License. You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License. 5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions. 6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file. 7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License. 8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages. 9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability. END OF TERMS AND CONDITIONS
sv: Apache-licens Version 2.0, januari 2004 https://www.apache.org/licenses/ VILLKOR FÖR ANVÄNDNING, REPRODUKTION OCH DISTRIBUTION 1. Definitioner. med "licens" avses de villkor för användning, reproduktion och distribution och distribution enligt definitionerna i avsnitten 1-9 i detta dokument. med "licensgivare" avses upphovsrättsinnehavaren eller den enhet som auktoriserats av upphovsrättsinnehavaren som beviljar licensen. "Juridisk enhet" avser sammanslutningen av den agerande enheten och alla andra enheter som kontrollerar, kontrolleras av eller står under gemensam kontroll med den enheten. Vid tillämpningen av denna definition avses med "kontroll": (i) befogenhet, direkt eller indirekt, att styra eller leda eller ledningen av ett sådant företag, oavsett om det sker genom avtal eller på annat sätt, eller (ii) ägande av femtio procent (50%) eller mer av de utestående utestående aktier, eller (iii) verkligt ägande av en sådan enhet. "Du" (eller "Din") ska betyda en enskild person eller juridisk enhet som utövar de rättigheter som beviljas genom denna licens. med "källform" avses den form som föredras för att göra ändringar, inklusive men inte begränsat till källkod för programvara, dokumentation dokumentationskälla och konfigurationsfiler. med "objektform" avses varje form som är resultatet av mekanisk mekanisk omvandling eller översättning av en källform, inklusive men men inte begränsat till kompilerad objektkod, genererad dokumentation och konvertering till andra medietyper. med "verk" avses det upphovsrättsliga verk, oavsett om det är i käll- eller Objektform, som görs tillgängligt under Licensen, vilket framgår av en upphovsrättsmeddelande som ingår i eller är bifogat till verket (ett exempel ges i bilagan nedan). "Derivatverk" avser varje verk, oavsett om det är i käll- eller objektform form, som är baserat på (eller härrör från) verket och för vilket de redaktionella redaktionella revideringar, anteckningar, utarbetanden eller andra modifieringar som helhet utgör ett originalverk av författarskap. Vid tillämpningen denna licens ska härledda verk inte omfatta verk som förblir separerbara från, eller endast länkar (eller binder med namn) till gränssnitten i, verket och härledda verk därav. med "Bidrag" avses varje form av författarskap, inklusive den ursprungliga versionen av verket och eventuella ändringar eller tillägg eller tillägg till detta verk eller härledda verk därav, som avsiktligt till Licensgivaren för att inkluderas i Verket av upphovsrättsinnehavaren eller av en person eller juridisk enhet som är behörig att lämna in på uppdrag av upphovsrättsinnehavarens vägnar. I denna definition avses med "inlämnat" avses alla former av elektronisk, muntlig eller skriftlig kommunikation som skickas till licensgivaren eller dess representanter, inklusive men inte begränsat till kommunikation på elektroniska sändlistor, system för kontroll av källkod källkodskontrollsystem och problemspårningssystem som hanteras av, eller på uppdrag av Licensgivaren i syfte att diskutera och förbättra Verket, men exklusive kommunikation som är iögonfallande märkt eller på annat sätt skriftligen eller på annat sätt skriftligen anges av upphovsrättsinnehavaren som "Inte ett bidrag" "Bidragsgivare" ska betyda Licensgivaren och varje enskild person eller juridisk enhet för vars räkning ett Bidrag har mottagits av Licensgivaren och därefter därefter införlivats i Verket. 2. Beviljande av upphovsrättslicens. Med förbehåll för villkoren i denna licens villkoren i denna licens, beviljar varje bidragsgivare dig härmed en evig, världsomspännande, icke-exklusiv, kostnadsfri, royaltyfri, oåterkallelig upphovsrättslicens för att reproducera, förbereda härledda verk av, offentligt visa, offentligt framföra, underlicensiera och distribuera verket och Och distribuera verket och sådana härledda verk i käll- eller objektform. 3. Beviljande av patentlicens. Med förbehåll för villkoren i denna licens denna licens, beviljar varje bidragsgivare dig härmed en evig, världsomspännande världsomspännande, icke-exklusiv, kostnadsfri, royaltyfri, oåterkallelig (med undantag för vad som anges i detta avsnitt) patentlicens att tillverka, låta tillverka använda, erbjuda till försäljning, sälja, importera och på annat sätt överföra Verket, där sådan licens endast gäller för de patentkrav som är licensierbara av sådan Bidragslämnare som nödvändigtvis kränks av deras Bidrag Bidrag ensamt eller genom en kombination av deras bidrag med det verk med det Verk till vilket sådant Bidrag lämnades in. Om du inleder patenttvister mot någon enhet (inklusive ett motkrav eller genkäromål i en rättegång) som påstår att Verket eller ett eller ett Bidrag som ingår i Verket utgör ett direkt eller medverkande eller medverkande till patentintrång, ska alla patentlicenser som som beviljats Dig enligt denna Licens för det Verket ska upphöra att gälla från och med den dag då sådan talan väcks. 4. Vidaredistribution. Du får reproducera och distribuera kopior av verket eller Verket eller härledda verk därav i vilket medium som helst, med eller utan modifieringar, och i käll- eller objektform, förutsatt att Du uppfyller följande villkor: (a) Du måste ge alla andra mottagare av Verket eller Härledda verk en kopia av denna licens; och (b) Du måste se till att alla ändrade filer har framträdande meddelanden som anger att du har ändrat filerna; och (c) Du måste behålla, i källformen för alla härledda verk som du distribuerar, alla meddelanden om upphovsrätt, patent, varumärken och och attributionsmeddelanden från verkets källform, exklusive de meddelanden som inte avser någon del av de härledda de härledda arbetena; och (d) Om verket innehåller en textfil med "NOTICE" som en del av dess distribution distribution, måste alla härledda verk som du distribuerar innehålla en läsbar kopia av innehålla en läsbar kopia av de attributionsmeddelanden som finns i en sådan NOTICE-fil, exklusive de meddelanden som inte avser någon del av de härledda verken, på minst en av följande av följande platser: inom en NOTICE-textfil som distribueras som en del av de härledda verken; inom källformatet eller dokumentation, om den tillhandahålls tillsammans med härledda verk; eller, inom en display som genereras av härledda verk, om och där sådana meddelanden från tredje part normalt visas. Innehållet nOTICE-filens innehåll är endast avsett för informationsändamål och ändrar inte Licensen. Du kan lägga till dina egna attributionsmeddelanden i härledda verk som du distribuerar, tillsammans med eller som eller som ett tillägg till NOTICE-texten från verket, förutsatt förutsatt att sådana ytterligare attributionsmeddelanden inte kan tolkas som en ändring av Licensen. Du får lägga till ditt eget upphovsrättsmeddelande i dina ändringar och kan tillhandahålla ytterligare eller andra licensvillkor för användning, reproduktion för användning, reproduktion eller distribution av dina ändringar, eller för alla sådana härledda verk som helhet, förutsatt att din användning, reproduktion reproduktion och distribution av verket i övrigt överensstämmer med de villkor som villkoren som anges i denna Licens. 5. Inlämning av bidrag. Om du inte uttryckligen anger något annat ska alla Bidrag som avsiktligt lämnas in för att ingå i Verket av Dig till av dig till licensgivaren ska ske enligt villkoren i denna licens, utan ytterligare denna Licens, utan några ytterligare villkor. Oaktat ovanstående ska inget i detta avtal ersätta eller modifiera villkoren i något separat licensavtal som du kan ha ingått med Licensgivaren med Licensgivaren avseende sådana Bidrag. 6. Varumärken. Denna licens ger inte tillstånd att använda licensgivarens licensgivarens handelsnamn, varumärken, servicemärken eller produktnamn, förutom vad som krävs för rimlig och sedvanlig användning för att beskriva verkets beskriva verkets ursprung och reproducera innehållet i NOTICE-filen. 7. Friskrivning från garanti. Om inte annat krävs enligt tillämplig lag eller eller skriftligen överenskommits, tillhandahåller Licensgivaren Verket (och varje Bidragsgivare tillhandahåller sina bidrag) på en "SOM DET ÄR"- BAS, UTAN GARANTIER ELLER VILLKOR AV NÅGOT SLAG, vare sig uttryckliga eller underförstådda eller underförstådda, inklusive, utan begränsning, några garantier eller villkor av ÄGANDERÄTT, INTE-ÖVERTRÄDELSE, SÄLJBARHET eller LÄMPLIGHET FÖR ETT SÄRSKILT ÄNDAMÅL. Du är ensam ansvarig för att avgöra om det är lämpligheten av att använda eller omfördela arbetet och ta på dig alla risker risker som är förknippade med utövandet av rättigheter enligt denna licens. 8. Begränsning av ansvarsskyldighet. Under inga omständigheter och under ingen juridisk teori, oavsett om det rör sig om skadestånd (inklusive vårdslöshet), avtal eller annat, såvida det inte krävs enligt tillämplig lag (såsom avsiktliga och grovt försumliga handlingar) eller skriftligen överenskommits, ska någon Bidragsgivare vara ansvarig gentemot Dig för skador, inklusive direkta, indirekta, särskilda eller följdskador av något slag som uppkommer till följd av denna Licens eller till följd av denna Licens eller av användning eller oförmåga att använda (inklusive men inte begränsat till skadestånd för förlust av goodwill, arbetsstopp arbetsstopp, datorfel eller funktionsfel eller alla andra alla andra kommersiella skador eller förluster), även om sådan Bidragsgivare har informerats om möjligheten till sådana skador. 9. Godkännande av garanti eller ytterligare ansvar. Vid omfördelning av verket eller härledda verk därav, kan du välja att erbjuda och ta ut en avgift för, godkännande av support, garanti, skadestånd, eller andra ansvarsskyldigheter och/eller rättigheter som överensstämmer med denna Licens. När Ni accepterar sådana skyldigheter får Ni emellertid endast agera för egen räkning och på eget ansvar, inte för någon annan bidragsgivares räkning för någon annan Bidragande part, och endast om Du samtycker till att hålla varje Bidragande part skadeslös försvara och hålla varje Bidragsgivare skadeslös för allt ansvar som eller anspråk som görs gällande mot sådan Bidragande part på grund av att på grund av att du accepterar någon sådan garanti eller ytterligare ansvar. SLUT PÅ VILLKOR OCH BESTÄMMELSER

source: expat
sv: utvandrare

source: The :mod:`pyexpat <xml.parsers.expat>` extension is built using an included copy of the expat sources unless the build is configured ``--with-system-expat``::
sv: Tillägget :mod:`pyexpat <xml.parsers.expat>` byggs med hjälp av en inkluderad kopia av expat-källorna om inte byggandet konfigureras ``--with-system-expat``::

source: Copyright (c) 1998, 1999, 2000 Thai Open Source Software Center Ltd and Clark Cooper Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
sv: Copyright (c) 1998, 1999, 2000 Thai Open Source Software Center Ltd och Clark Cooper Tillstånd beviljas härmed, kostnadsfritt, till varje person som erhåller en kopia av denna programvara och tillhörande dokumentationsfiler ("Programvaran") "Programvaran"), att handla med Programvaran utan begränsning, inklusive utan begränsning rätten att använda, kopiera, modifiera, sammanfoga, publicera distribuera, underlicensiera och/eller sälja kopior av programvaran, och att tillåta personer till vilka programvaran tillhandahålls att göra detta, med förbehåll för följande villkor: Ovanstående upphovsrättsmeddelande och detta meddelande om tillstånd ska inkluderas i alla kopior eller väsentliga delar av programvaran. PROGRAMVARAN TILLHANDAHÅLLS "I BEFINTLIGT SKICK", UTAN GARANTIER AV NÅGOT SLAG, UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA, INKLUSIVE MEN INTE BEGRÄNSAT TILL GARANTIERNA FÖR SÄLJBARHET, LÄMPLIGHET FÖR ETT VISST ÄNDAMÅL OCH ICKE-INTRÅNG. UNDER INGA OMSTÄNDIGHETER SKA FÖRFATTARNA ELLER UPPHOVSRÄTTSINNEHAVARNA VARA ANSVARIGA FÖR ANSPRÅK, SKADESTÅND ELLER ANNAT ANSVAR, VARE SIG I EN TALAN OM AVTAL SKADESTÅND ELLER PÅ ANNAT SÄTT, SOM UPPSTÅR FRÅN, UR ELLER I SAMBAND MED PROGRAMVARAN PROGRAMVARAN ELLER ANVÄNDNINGEN AV ELLER ANNAN HANTERING AV PROGRAMVARAN.

source: The :mod:`!_ctypes` C extension underlying the :mod:`ctypes` module is built using an included copy of the libffi sources unless the build is configured ``--with-system-libffi``::
sv: C-tillägget :mod:`!_ctypes`, som ligger till grund för modulen :mod:`ctypes`, byggs med en inkluderad kopia av libffi-källorna om inte byggkonfigurationen är ``--with-system-libffi``::
