Repository: yeager/python-docs-sv
Catalog: extending/embedding.po
Languages: sv

source: To find out the required compiler and linker flags, you can execute the :file:`python{X.Y}-config` script which is generated as part of the installation process (a :file:`python3-config` script may also be available). This script has several options, of which the following will be directly useful to you:
sv: För att ta reda på vilka kompilator- och länkarflaggor som krävs kan du köra skriptet :file:`python{X.Y}-config` som genereras som en del av installationsprocessen (ett skript :file:`python3-config` kan också finnas tillgängligt). Detta skript har flera alternativ, av vilka följande kommer att vara direkt användbara för dig:

source: ``pythonX.Y-config --cflags`` will give you the recommended flags when compiling:
sv: ``pythonX.Y-config --cflags`` kommer att ge dig de rekommenderade flaggorna vid kompilering:

source: ``pythonX.Y-config --ldflags --embed`` will give you the recommended flags when linking:
sv: ``pythonX.Y-config --ldflags --embed`` kommer att ge dig de rekommenderade flaggorna när du länkar:

source: To avoid confusion between several Python installations (and especially between the system Python and your own compiled Python), it is recommended that you use the absolute path to :file:`python{X.Y}-config`, as in the above example.
sv: För att undvika förväxling mellan olika Python-installationer (och särskilt mellan systemets Python och ditt eget kompilerade Python) rekommenderas att du använder den absoluta sökvägen till :file:`python{X.Y}-config`, som i exemplet ovan.

source: If this procedure doesn't work for you (it is not guaranteed to work for all Unix-like platforms; however, we welcome :ref:`bug reports <reporting-bugs>`) you will have to read your system's documentation about dynamic linking and/or examine Python's :file:`Makefile` (use :func:`sysconfig.get_makefile_filename` to find its location) and compilation options. In this case, the :mod:`sysconfig` module is a useful tool to programmatically extract the configuration values that you will want to combine together. For example:
sv: Om den här proceduren inte fungerar för dig (det är inte garanterat att den fungerar för alla Unix-liknande plattformar; vi välkomnar dock :ref:`bug reports <reporting-bugs>`) måste du läsa ditt systems dokumentation om dynamisk länkning och/eller undersöka Pythons :file:`Makefile` (använd :func:`sysconfig.get_makefile_filename` för att hitta dess plats) och kompileringsalternativ. I det här fallet är modulen :mod:`sysconfig` ett användbart verktyg för att programmatiskt extrahera de konfigurationsvärden som du vill kombinera tillsammans. Till exempel

source: >>> import sysconfig >>> sysconfig.get_config_var('LIBS') '-lpthread -ldl -lutil' >>> sysconfig.get_config_var('LINKFORSHARED') '-Xlinker -export-dynamic'
sv: >>> import sysconfig >>> sysconfig.get_config_var('LIBS') '-lpthread -ldl -lutil' >>> sysconfig.get_config_var('LINKFORSHARED') '-Xlinker -export-dynamisk'
