Repository: yeager/python-docs-sv
Catalog: extending/embedding.po
Languages: sv

source: Embedding Python in Another Application
sv: Bädda in Python i en annan applikation

source: The previous chapters discussed how to extend Python, that is, how to extend the functionality of Python by attaching a library of C functions to it. It is also possible to do it the other way around: enrich your C/C++ application by embedding Python in it. Embedding provides your application with the ability to implement some of the functionality of your application in Python rather than C or C++. This can be used for many purposes; one example would be to allow users to tailor the application to their needs by writing some scripts in Python. You can also use it yourself if some of the functionality can be written in Python more easily.
sv: I de föregående kapitlen diskuterades hur man utökar Python, det vill säga hur man utökar Pythons funktionalitet genom att koppla ett bibliotek med C-funktioner till det. Det är också möjligt att göra tvärtom: berika din C/C++-applikation genom att bädda in Python i den. Inbäddning ger din applikation möjlighet att implementera en del av funktionaliteten i din applikation i Python snarare än i C eller C++. Detta kan användas för många ändamål; ett exempel skulle kunna vara att låta användarna skräddarsy applikationen efter sina behov genom att skriva några skript i Python. Du kan också använda det själv om en del av funktionaliteten lättare kan skrivas i Python.

source: Embedding Python is similar to extending it, but not quite. The difference is that when you extend Python, the main program of the application is still the Python interpreter, while if you embed Python, the main program may have nothing to do with Python --- instead, some parts of the application occasionally call the Python interpreter to run some Python code.
sv: Att bädda in Python liknar att utöka det, men inte riktigt. Skillnaden är att när du utökar Python är applikationens huvudprogram fortfarande Python-tolken, medan om du bäddar in Python kanske huvudprogrammet inte har något att göra med Python --- istället kallar vissa delar av applikationen ibland Python-tolken för att köra lite Python-kod.

source: So if you are embedding Python, you are providing your own main program. One of the things this main program has to do is initialize the Python interpreter. At the very least, you have to call the function :c:func:`Py_Initialize`. There are optional calls to pass command line arguments to Python. Then later you can call the interpreter from any part of the application.
sv: Så om du bäddar in Python tillhandahåller du ditt eget huvudprogram. En av de saker som detta huvudprogram måste göra är att initiera Python-tolken. Åtminstone måste du anropa funktionen :c:func:`Py_Initialize`. Det finns valfria anrop för att skicka kommandoradsargument till Python. Senare kan du anropa tolken från vilken del som helst av programmet.

source: There are several different ways to call the interpreter: you can pass a string containing Python statements to :c:func:`PyRun_SimpleString`, or you can pass a stdio file pointer and a file name (for identification in error messages only) to :c:func:`PyRun_SimpleFile`. You can also call the lower-level operations described in the previous chapters to construct and use Python objects.
sv: Det finns flera olika sätt att anropa tolken: du kan skicka en sträng som innehåller Python-satser till :c:func:`PyRun_SimpleString`, eller så kan du skicka en stdio-filpekare och ett filnamn (endast för identifiering i felmeddelanden) till :c:func:`PyRun_SimpleFile`. Du kan också anropa de operationer på lägre nivå som beskrivs i de föregående kapitlen för att konstruera och använda Python-objekt.

source: The details of Python's C interface are given in this manual. A great deal of necessary information can be found here.
sv: Detaljerna i Pythons C-gränssnitt beskrivs i den här handboken. En stor del av den nödvändiga informationen finns här.

source: Very High Level Embedding
sv: Inbäddning på mycket hög nivå

source: The simplest form of embedding Python is the use of the very high level interface. This interface is intended to execute a Python script without needing to interact with the application directly. This can for example be used to perform some operation on a file. ::
sv: Den enklaste formen av Python-inbäddning är att använda ett gränssnitt på mycket hög nivå. Detta gränssnitt är avsett att exekvera ett Python-skript utan att behöva interagera med applikationen direkt. Detta kan t.ex. användas för att utföra någon operation på en fil:

source: #define PY_SSIZE_T_CLEAN #include <Python.h> int main(int argc, char *argv[]) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* optional but recommended */ status = PyConfig_SetBytesString(&config, &config.program_name, argv[0]); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); PyRun_SimpleString("from time import time,ctime\n" "print('Today is', ctime(time()))\n"); if (Py_FinalizeEx() < 0) { exit(120); } return 0; exception: PyConfig_Clear(&config); Py_ExitStatusException(status); }
sv: #definiera PY_SSIZE_T_CLEAN #inkludera <Python.h> int main(int argc, char *argv[]) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* valfritt men rekommenderas */ status = PyConfig_SetBytesString(&config, &config.program_name, argv[0]); if (PyStatus_Exception(status)) { goto undantag; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { gå till undantaget; } PyConfig_Clear(&config); PyRun_SimpleString("from time import time,ctime\n" "print('Idag är', ctime(time()))\n"); if (Py_FinalizeEx() < 0) { exit(120); } return 0; undantag: PyConfig_Clear(&config); Py_ExitStatusException(status); }

source: ``#define PY_SSIZE_T_CLEAN`` was used to indicate that ``Py_ssize_t`` should be used in some APIs instead of ``int``. It is not necessary since Python 3.13, but we keep it here for backward compatibility. See :ref:`arg-parsing-string-and-buffers` for a description of this macro.
sv: ``#define PY_SSIZE_T_CLEAN`` användes för att indikera att ``Py_ssize_t`` skulle användas i vissa API:er istället för ``int``. Det är inte nödvändigt sedan Python 3.13, men vi behåller det här för bakåtkompatibilitet. Se :ref:`arg-parsing-string-and-buffers` för en beskrivning av detta makro.

source: Setting :c:member:`PyConfig.program_name` should be called before :c:func:`Py_InitializeFromConfig` to inform the interpreter about paths to Python run-time libraries. Next, the Python interpreter is initialized with :c:func:`Py_Initialize`, followed by the execution of a hard-coded Python script that prints the date and time. Afterwards, the :c:func:`Py_FinalizeEx` call shuts the interpreter down, followed by the end of the program. In a real program, you may want to get the Python script from another source, perhaps a text-editor routine, a file, or a database. Getting the Python code from a file can better be done by using the :c:func:`PyRun_SimpleFile` function, which saves you the trouble of allocating memory space and loading the file contents.
sv: Inställningen :c:member:`PyConfig.program_name` bör anropas före :c:func:`Py_InitializeFromConfig` för att informera tolken om sökvägar till Pythons run-time-bibliotek. Därefter initieras Python-tolken med :c:func:`Py_Initialize`, följt av exekveringen av ett hårdkodat Python-skript som skriver ut datum och tid. Därefter stänger anropet :c:func:`Py_FinalizeEx` av tolken, följt av slutet på programmet. I ett riktigt program kanske du vill hämta Python-skriptet från en annan källa, kanske en textredigeringsrutin, en fil eller en databas. Det är lättare att hämta Python-koden från en fil genom att använda funktionen :c:func:`PyRun_SimpleFile`, som sparar dig besväret med att allokera minnesutrymme och ladda filens innehåll.

source: Beyond Very High Level Embedding: An overview
sv: Bortom inbäddning på mycket hög nivå: En översikt

source: The high level interface gives you the ability to execute arbitrary pieces of Python code from your application, but exchanging data values is quite cumbersome to say the least. If you want that, you should use lower level calls. At the cost of having to write more C code, you can achieve almost anything.
sv: Högnivågränssnittet ger dig möjlighet att exekvera godtyckliga bitar av Python-kod från din applikation, men att utbyta datavärden är minst sagt besvärligt. Om du vill ha det bör du använda anrop på lägre nivå. På bekostnad av att behöva skriva mer C-kod kan du uppnå nästan vad som helst.

source: It should be noted that extending Python and embedding Python is quite the same activity, despite the different intent. Most topics discussed in the previous chapters are still valid. To show this, consider what the extension code from Python to C really does:
sv: Det bör noteras att utöka Python och bädda in Python är ganska samma aktivitet, trots den olika avsikten. De flesta ämnen som diskuterats i de tidigare kapitlen är fortfarande giltiga. För att visa detta kan du fundera på vad förlängningskoden från Python till C verkligen gör:

source: Convert data values from Python to C,
sv: Konvertera datavärden från Python till C,

source: Perform a function call to a C routine using the converted values, and
sv: Utföra ett funktionsanrop till en C-rutin med hjälp av de konverterade värdena, och

source: Convert the data values from the call from C to Python.
sv: Konvertera datavärdena från anropet från C till Python.

source: When embedding Python, the interface code does:
sv: Vid inbäddning av Python gör gränssnittskoden det:

source: Convert data values from C to Python,
sv: Konvertera datavärden från C till Python,

source: Perform a function call to a Python interface routine using the converted values, and
sv: Utföra ett funktionsanrop till en Python-gränssnittsrutin med hjälp av de konverterade värdena, och

source: Convert the data values from the call from Python to C.
sv: Konvertera datavärdena från anropet från Python till C.

source: As you can see, the data conversion steps are simply swapped to accommodate the different direction of the cross-language transfer. The only difference is the routine that you call between both data conversions. When extending, you call a C routine, when embedding, you call a Python routine.
sv: Som du kan se byts datakonverteringsstegen helt enkelt ut för att passa den olika riktningen för överföringen mellan språken. Den enda skillnaden är den rutin som du anropar mellan de båda datakonverteringarna. Vid förlängning anropar du en C-rutin, vid inbäddning anropar du en Python-rutin.

source: This chapter will not discuss how to convert data from Python to C and vice versa. Also, proper use of references and dealing with errors is assumed to be understood. Since these aspects do not differ from extending the interpreter, you can refer to earlier chapters for the required information.
sv: Detta kapitel kommer inte att diskutera hur man konverterar data från Python till C och vice versa. Även korrekt användning av referenser och hantering av fel förutsätts vara förstått. Eftersom dessa aspekter inte skiljer sig från att utöka tolken, kan du hänvisa till tidigare kapitel för den information som krävs.

source: Pure Embedding
sv: Ren inbäddning

source: The first program aims to execute a function in a Python script. Like in the section about the very high level interface, the Python interpreter does not directly interact with the application (but that will change in the next section).
sv: Det första programmet syftar till att exekvera en funktion i ett Python-skript. Precis som i avsnittet om gränssnittet på mycket hög nivå interagerar Python-tolken inte direkt med programmet (men det kommer att ändras i nästa avsnitt).

source: The code to run a function defined in a Python script is:
sv: Koden för att köra en funktion som definieras i ett Python-skript är:

source: #define PY_SSIZE_T_CLEAN #include <Python.h> int main(int argc, char *argv[]) { PyObject *pName, *pModule, *pFunc; PyObject *pArgs, *pValue; int i; if (argc < 3) { fprintf(stderr,"Usage: call pythonfile funcname [args]\n"); return 1; } Py_Initialize(); pName = PyUnicode_DecodeFSDefault(argv[1]); /* Error checking of pName left out */ pModule = PyImport_Import(pName); Py_DECREF(pName); if (pModule != NULL) { pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc is a new reference */ if (pFunc && PyCallable_Check(pFunc)) { pArgs = PyTuple_New(argc - 3); for (i = 0; i < argc - 3; ++i) { pValue = PyLong_FromLong(atoi(argv[i + 3])); if (!pValue) { Py_DECREF(pArgs); Py_DECREF(pModule); fprintf(stderr, "Cannot convert argument\n"); return 1; } /* pValue reference stolen here: */ PyTuple_SetItem(pArgs, i, pValue); } pValue = PyObject_CallObject(pFunc, pArgs); Py_DECREF(pArgs); if (pValue != NULL) { printf("Result of call: %ld\n", PyLong_AsLong(pValue)); Py_DECREF(pValue); } else { Py_DECREF(pFunc); Py_DECREF(pModule); PyErr_Print(); fprintf(stderr,"Call failed\n"); return 1; } } else { if (PyErr_Occurred()) PyErr_Print(); fprintf(stderr, "Cannot find function \"%s\"\n", argv[2]); } Py_XDECREF(pFunc); Py_DECREF(pModule); } else { PyErr_Print(); fprintf(stderr, "Failed to load \"%s\"\n", argv[1]); return 1; } if (Py_FinalizeEx() < 0) { return 120; } return 0; }
sv: #definiera PY_SSIZE_T_CLEAN #inkludera <Python.h> int main(int argc, char *argv[]) { PyObject *pName, *pModule, *pFunc; PyObject *pArgs, *pValue; int i; if (argc < 3) { fprintf(stderr,"Användning: anropa pythonfil funcname [args]\n"); return 1; } Py_Initialize(); pName = PyUnicode_DecodeFSDefault(argv[1]); /* Felkontroll av pName utelämnad */ pModule = PyImport_Import(pName); Py_DECREF(pName); if (pModule != NULL) { pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc är en ny referens */ if (pFunc && PyCallable_Check(pFunc)) { pArgs = PyTuple_New(argc - 3); for (i = 0; i < argc - 3; ++i) { pValue = PyLong_FromLong(atoi(argv[i + 3])); if (!pValue) { Py_DECREF(pArgs); Py_DECREF(pModule); fprintf(stderr, "Kan inte konvertera argument\n"); return 1; } /* pValue-referensen stulen här: */ PyTuple_SetItem(pArgs, i, pValue); } pValue = PyObject_CallObject(pFunc, pArgs); Py_DECREF(pArgs); if (pValue != NULL) { printf("Resultat av anrop: %ld\n", PyLong_AsLong(pValue)); Py_DECREF(pValue); } else { Py_DECREF(pFunc); Py_DECREF(pModule); PyErr_Print(); fprintf(stderr,"Anropet misslyckades\n"); return 1; } } annat { if (PyErr_Occurred()) PyErr_Print(); fprintf(stderr, "Kan inte hitta funktionen \"%s\"\n", argv[2]); } Py_XDECREF(pFunc); Py_DECREF(pModule); } else { PyErr_Print(); fprintf(stderr,"Misslyckades med att ladda \"%s\"\n", argv[1]); return 1; } if (Py_FinalizeEx() < 0) { return 120; } return 0; }

source: This code loads a Python script using ``argv[1]``, and calls the function named in ``argv[2]``. Its integer arguments are the other values of the ``argv`` array. If you :ref:`compile and link <compiling>` this program (let's call the finished executable :program:`call`), and use it to execute a Python script, such as:
sv: Den här koden laddar ett Python-skript med hjälp av ``argv[1]`` och anropar funktionen som namnges i ``argv[2]``. Dess heltalsargument är de andra värdena i ``argv``-arrayen. Om du :ref:`kompilerar och länkar <compiling>` detta program (låt oss kalla den färdiga körbara filen :program:`call`), och använder den för att köra ett Python-skript, t.ex:

source: def multiply(a,b): print("Will compute", a, "times", b) c = 0 for i in range(0, a): c = c + b return c
sv: def multiplicera(a,b): print("Beräknar", a, "gånger", b) c = 0 för i i intervallet(0, a): c = c + b returnerar c

source: then the result should be:
sv: då borde resultatet bli:

source: $ call multiply multiply 3 2 Will compute 3 times 2 Result of call: 6
sv: $ samtal multiplicera multiplicera 3 2 Beräknar 3 gånger 2 Resultatet av anropet: 6

source: Although the program is quite large for its functionality, most of the code is for data conversion between Python and C, and for error reporting. The interesting part with respect to embedding Python starts with ::
sv: Även om programmet är ganska stort för sin funktionalitet, är det mesta av koden för datakonvertering mellan Python och C, och för felrapportering. Den intressanta delen när det gäller inbäddning av Python börjar med ::

source: Py_Initialize(); pName = PyUnicode_DecodeFSDefault(argv[1]); /* Error checking of pName left out */ pModule = PyImport_Import(pName);
sv: Py_Initialize(); pName = PyUnicode_DecodeFSDefault(argv[1]); /* Felkontroll av pName utelämnad */ pModule = PyImport_Import(pName);

source: After initializing the interpreter, the script is loaded using :c:func:`PyImport_Import`. This routine needs a Python string as its argument, which is constructed using the :c:func:`PyUnicode_DecodeFSDefault` data conversion routine. ::
sv: Efter initiering av tolken laddas skriptet med hjälp av :c:func:`PyImport_Import`. Denna rutin behöver en Python-sträng som sitt argument, vilken konstrueras med hjälp av datakonverteringsrutinen :c:func:`PyUnicode_DecodeFSDefault`. ::

source: pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc is a new reference */ if (pFunc && PyCallable_Check(pFunc)) { ... } Py_XDECREF(pFunc);
sv: pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc är en ny referens */ if (pFunc && PyCallable_Check(pFunc)) { ... } Py_XDECREF(pFunc);

source: Once the script is loaded, the name we're looking for is retrieved using :c:func:`PyObject_GetAttrString`. If the name exists, and the object returned is callable, you can safely assume that it is a function. The program then proceeds by constructing a tuple of arguments as normal. The call to the Python function is then made with::
sv: När skriptet har laddats hämtas det namn vi letar efter med hjälp av :c:func:`PyObject_GetAttrString`. Om namnet finns och objektet som returneras är anropsbart kan man lugnt anta att det är en funktion. Programmet fortsätter sedan med att konstruera en tupel av argument som normalt. Anropet till Python-funktionen görs sedan med::

source: Upon return of the function, ``pValue`` is either ``NULL`` or it contains a reference to the return value of the function. Be sure to release the reference after examining the value.
sv: När funktionen returneras är ``pValue`` antingen ``NULL`` eller så innehåller den en referens till funktionens returvärde. Var noga med att släppa referensen efter att ha undersökt värdet.

source: Extending Embedded Python
sv: Utökning av inbäddad Python

source: Until now, the embedded Python interpreter had no access to functionality from the application itself. The Python API allows this by extending the embedded interpreter. That is, the embedded interpreter gets extended with routines provided by the application. While it sounds complex, it is not so bad. Simply forget for a while that the application starts the Python interpreter. Instead, consider the application to be a set of subroutines, and write some glue code that gives Python access to those routines, just like you would write a normal Python extension. For example::
sv: Fram till nu har den inbäddade Python-tolken inte haft tillgång till funktionalitet från själva applikationen. Python API tillåter detta genom att utöka den inbäddade tolken. Det vill säga, den inbäddade tolken utökas med rutiner som tillhandahålls av applikationen. Även om det låter komplicerat är det inte så illa. Glöm bara för ett tag att applikationen startar Python-tolken. Betrakta istället applikationen som en uppsättning underrutiner och skriv lite limkod som ger Python tillgång till dessa rutiner, precis som du skulle skriva ett vanligt Python-tillägg. Till exempel::

source: static int numargs=0; /* Return the number of arguments of the application command line */ static PyObject* emb_numargs(PyObject *self, PyObject *args) { if(!PyArg_ParseTuple(args, ":numargs")) return NULL; return PyLong_FromLong(numargs); } static PyMethodDef emb_module_methods[] = { {"numargs", emb_numargs, METH_VARARGS, "Return the number of arguments received by the process."}, {NULL, NULL, 0, NULL} }; static struct PyModuleDef emb_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "emb", .m_size = 0, .m_methods = emb_module_methods, }; static PyObject* PyInit_emb(void) { return PyModuleDef_Init(&emb_module); }
sv: statisk int numargs=0; /* Returnerar antalet argument i programmets kommandorad */ statiskt PyObject* emb_numargs(PyObject *self, PyObject *args) { if(!PyArg_ParseTuple(args, ":numargs")) returnera NULL; return PyLong_FromLong(numargs); } static PyMethodDef emb_module_methods[] = { {"numargs", emb_numargs, METH_VARARGS, "Returnera antalet argument som processen har tagit emot."}, {NULL, NULL, 0, NULL} }; static struct PyModuleDef emb_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "emb", .m_size = 0, .m_methods = emb_module_methods, }; statiskt PyObject* PyInit_emb(void) { return PyModuleDef_Init(&emb_module); }

source: Insert the above code just above the :c:func:`main` function. Also, insert the following two statements before the call to :c:func:`Py_Initialize`::
sv: Infoga ovanstående kod precis ovanför funktionen :c:func:`main`. Infoga också följande två satser före anropet till :c:func:`Py_Initialize`::

source: These two lines initialize the ``numargs`` variable, and make the :func:`!emb.numargs` function accessible to the embedded Python interpreter. With these extensions, the Python script can do things like
sv: Dessa två rader initierar variabeln ``numargs`` och gör funktionen :func:`!emb.numargs`` tillgänglig för den inbäddade Python-tolken. Med dessa tillägg kan Python-skriptet göra saker som

source: In a real application, the methods will expose an API of the application to Python.
sv: I en verklig applikation kommer metoderna att exponera ett API för applikationen till Python.

source: Embedding Python in C++
sv: Inbäddning av Python i C++

source: It is also possible to embed Python in a C++ program; precisely how this is done will depend on the details of the C++ system used; in general you will need to write the main program in C++, and use the C++ compiler to compile and link your program. There is no need to recompile Python itself using C++.
sv: Det är också möjligt att bädda in Python i ett C++-program; exakt hur detta görs beror på detaljerna i det C++-system som används; i allmänhet måste du skriva huvudprogrammet i C++ och använda C++-kompilatorn för att kompilera och länka ditt program. Det finns inget behov av att kompilera om Python själv med hjälp av C++.

source: Compiling and Linking under Unix-like systems
sv: Kompilering och länkning under Unix-liknande system

source: It is not necessarily trivial to find the right flags to pass to your compiler (and linker) in order to embed the Python interpreter into your application, particularly because Python needs to load library modules implemented as C dynamic extensions (:file:`.so` files) linked against it.
sv: Det är inte nödvändigtvis trivialt att hitta rätt flaggor att skicka till din kompilator (och länkare) för att bädda in Python-tolken i din applikation, särskilt eftersom Python måste ladda biblioteksmoduler som implementeras som dynamiska C-tillägg (:file:`.so`-filer) länkade mot den.
