Repository: yeager/python-docs-sv
Catalog: extending/extending.po
Languages: sv

source: Extending Python with C or C++
sv: Utöka Python med C eller C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
sv: Det är ganska enkelt att lägga till nya inbyggda moduler till Python, om du vet hur man programmerar i C. Sådana :dfn:`extension modules` kan göra två saker som inte kan göras direkt i Python: de kan implementera nya inbyggda objekttyper, och de kan anropa C-biblioteksfunktioner och systemanrop.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
sv: För att stödja tillägg definierar Python API (Application Programmers Interface) en uppsättning funktioner, makron och variabler som ger tillgång till de flesta aspekter av Pythons runtime-system. Python API införlivas i en C-källfil genom att inkludera rubriken ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
sv: Sammanställningen av en tilläggsmodul beror på hur den ska användas och på hur systemet är uppbyggt; mer information om detta finns i senare kapitel.

source: The C extension interface is specific to CPython, and extension modules do not work on other Python implementations. In many cases, it is possible to avoid writing C extensions and preserve portability to other implementations. For example, if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module or the `cffi <https://cffi.readthedocs.io/>`_ library rather than writing custom C code. These modules let you write Python code to interface with C code and are more portable between implementations of Python than writing and compiling a C extension module.
sv: Gränssnittet för C-tillägg är specifikt för CPython, och tilläggsmoduler fungerar inte på andra Python-implementeringar. I många fall är det möjligt att undvika att skriva C-tillägg och bevara portabiliteten till andra implementationer. Om ditt användningsområde till exempel är att anropa C-biblioteksfunktioner eller systemanrop, bör du överväga att använda :mod:`ctypes`-modulen eller biblioteket `cffi <https://cffi.readthedocs.io/>`_ i stället för att skriva egen C-kod. Med dessa moduler kan du skriva Python-kod för gränssnitt med C-kod och de är mer portabla mellan olika implementationer av Python än att skriva och kompilera en C-tilläggsmodul.

source: A Simple Example
sv: Ett enkelt exempel

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :c:func:`system` [#]_. This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows:
sv: Låt oss skapa en tilläggsmodul som heter ``spam`` (Monty Python-fansens favoritmat...) och låt oss säga att vi vill skapa ett Python-gränssnitt till C-bibliotekets funktion :c:func:`system` [#]_. Denna funktion tar en nollavslutad teckensträng som argument och returnerar ett heltal. Vi vill att denna funktion ska kunna anropas från Python enligt följande:

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
sv: Börja med att skapa en fil :file:`spammodule.c`. (Historiskt sett, om en modul heter ``spam``, heter C-filen som innehåller dess implementation :file:`spammodule.c`; om modulnamnet är mycket långt, som ``spammify``, kan modulnamnet bara vara :file:`spammify.c`)

source: The first two lines of our file can be::
sv: De två första raderna i vår fil kan vara::

source: #define PY_SSIZE_T_CLEAN #include <Python.h>
sv: #definiera PY_SSIZE_T_CLEAN #inkludera <Python.h>

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
sv: som hämtar Python API (du kan lägga till en kommentar som beskriver syftet med modulen och ett upphovsrättsmeddelande om du vill).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
sv: Eftersom Python kan definiera vissa preprocessordefinitioner som påverkar standardrubrikerna på vissa system, måste du *inkludera* :file:`Python.h` innan några standardrubriker inkluderas.

source: ``#define PY_SSIZE_T_CLEAN`` was used to indicate that ``Py_ssize_t`` should be used in some APIs instead of ``int``. It is not necessary since Python 3.13, but we keep it here for backward compatibility. See :ref:`arg-parsing-string-and-buffers` for a description of this macro.
sv: ``#define PY_SSIZE_T_CLEAN`` användes för att indikera att ``Py_ssize_t`` skulle användas i vissa API:er istället för ``int``. Det är inte nödvändigt sedan Python 3.13, men vi behåller det här för bakåtkompatibilitet. Se :ref:`arg-parsing-string-and-buffers` för en beskrivning av detta makro.

source: All user-visible symbols defined by :file:`Python.h` have a prefix of ``Py`` or ``PY``, except those defined in standard header files. For convenience, and since they are used extensively by the Python interpreter, ``"Python.h"`` includes a few standard header files: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, and ``<stdlib.h>``. If the latter header file does not exist on your system, it declares the functions :c:func:`malloc`, :c:func:`free` and :c:func:`realloc` directly.
sv: Alla användarsynliga symboler som definieras av :file:`Python.h` har prefixet ``Py`` eller ``PY``, utom de som definieras i standardhuvudfiler. För enkelhetens skull, och eftersom de används flitigt av Python-tolken, innehåller ``"Python.h"`` några standardheaderfiler: ``<stdio.h>``, ``<string.h>``, ``<errno.h>`` och ``<stdlib.h>`. Om den senare huvudfilen inte finns på ditt system, deklarerar den funktionerna :c:func:`malloc`, :c:func:`free` och :c:func:`realloc` direkt.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
sv: Nästa sak vi lägger till i vår modulfil är den C-funktion som kommer att anropas när Python-uttrycket ``spam.system(string)`` utvärderas (vi ska snart se hur den kommer att anropas)::

source: static PyObject * spam_system(PyObject *self, PyObject *args) { const char *command; int sts; if (!PyArg_ParseTuple(args, "s", &command)) return NULL; sts = system(command); return PyLong_FromLong(sts); }
sv: statiskt PyObject * spam_system(PyObject *self, PyObject *args) { const char *kommando; int sts; if (!PyArg_ParseTuple(args, "s", &command)) returnera NULL; sts = system(kommando); return PyLong_FromLong(sts); }

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
sv: Det finns en enkel översättning från argumentlistan i Python (t.ex. det enkla uttrycket ``"ls -l"``) till de argument som skickas till C-funktionen. C-funktionen har alltid två argument, konventionellt benämnda *self* och *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
sv: Argumentet *self* pekar på modulobjektet för funktioner på modulnivå; för en metod skulle det peka på objektinstansen.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :c:func:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
sv: Argumentet *args* kommer att vara en pekare till ett Python-tuple-objekt som innehåller argumenten. Varje post i tupeln motsvarar ett argument i anropets argumentlista. Argumenten är Python-objekt --- för att kunna göra något med dem i vår C-funktion måste vi konvertera dem till C-värden. Funktionen :c:func:`PyArg_ParseTuple` i Python API kontrollerar argumenttyperna och konverterar dem till C-värden. Den använder en mallsträng för att bestämma de nödvändiga typerna av argumenten samt typerna av de C-variabler som de konverterade värdena ska lagras i. Mer om detta senare.

source: :c:func:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return ``NULL`` immediately (as we saw in the example).
sv: :c:func:`PyArg_ParseTuple` returnerar true (icke-noll) om alla argument har rätt typ och dess komponenter har lagrats i de variabler vars adresser skickas. Den returnerar false (noll) om en ogiltig argumentlista har skickats. I det senare fallet ger den också upphov till ett lämpligt undantag så att den anropande funktionen kan returnera ``NULL`` omedelbart (som vi såg i exemplet).

source: Intermezzo: Errors and Exceptions
sv: Intermezzo: Fel och undantag

source: An important convention throughout the Python interpreter is the following: when a function fails, it should set an exception condition and return an error value (usually ``-1`` or a ``NULL`` pointer). Exception information is stored in three members of the interpreter's thread state. These are ``NULL`` if there is no exception. Otherwise they are the C equivalents of the members of the Python tuple returned by :meth:`sys.exc_info`. These are the exception type, exception instance, and a traceback object. It is important to know about them to understand how errors are passed around.
sv: En viktig konvention i hela Python-tolken är följande: när en funktion misslyckas ska den ställa in ett undantagsvillkor och returnera ett felvärde (vanligtvis ``-1`` eller en ``NULL``-pekare). Undantagsinformation lagras i tre medlemmar av tolkens trådtillstånd. Dessa är ``NULL`` om det inte finns något undantag. Annars är de C-ekvivalenter till medlemmarna i Python-tupeln som returneras av :meth:`sys.exc_info`. Dessa är undantagstypen, undantagsinstansen och ett traceback-objekt. Det är viktigt att känna till dem för att förstå hur fel skickas runt.

source: The Python API defines a number of functions to set various types of exceptions.
sv: Python API definierar ett antal funktioner för att ställa in olika typer av undantag.

source: The most common one is :c:func:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :c:data:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
sv: Den vanligaste är :c:func:`PyErr_SetString`. Dess argument är ett undantagsobjekt och en C-sträng. Undantagsobjektet är vanligtvis ett fördefinierat objekt som :c:data:`PyExc_ZeroDivisionError`. C-strängen anger orsaken till felet och konverteras till ett Python-strängobjekt och lagras som det "associerade värdet" för undantaget.

source: Another useful function is :c:func:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :c:data:`errno`. The most general function is :c:func:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :c:func:`Py_INCREF` the objects passed to any of these functions.
sv: En annan användbar funktion är :c:func:`PyErr_SetFromErrno`, som bara tar ett undantagsargument och konstruerar det associerade värdet genom inspektion av den globala variabeln :c:data:`errno`. Den mest allmänna funktionen är :c:func:`PyErr_SetObject`, som tar två objektargument, undantaget och dess associerade värde. Du behöver inte :c:func:`Py_INCREF` de objekt som skickas till någon av dessa funktioner.

source: You can test non-destructively whether an exception has been set with :c:func:`PyErr_Occurred`. This returns the current exception object, or ``NULL`` if no exception has occurred. You normally don't need to call :c:func:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
sv: Du kan testa icke-destruktivt om ett undantag har ställts in med :c:func:`PyErr_Occurred`. Detta returnerar det aktuella undantagsobjektet, eller ``NULL`` om inget undantag har inträffat. Du behöver normalt inte anropa :c:func:`PyErr_Occurred` för att se om ett fel inträffade i ett funktionsanrop, eftersom du bör kunna se det från returvärdet.

source: When a function *f* that calls another function *g* detects that the latter fails, *f* should itself return an error value (usually ``NULL`` or ``-1``). It should *not* call one of the ``PyErr_*`` functions --- one has already been called by *g*. *f*'s caller is then supposed to also return an error indication to *its* caller, again *without* calling ``PyErr_*``, and so on --- the most detailed cause of the error was already reported by the function that first detected it. Once the error reaches the Python interpreter's main loop, this aborts the currently executing Python code and tries to find an exception handler specified by the Python programmer.
sv: När en funktion *f* som anropar en annan funktion *g* upptäcker att den senare misslyckas, bör *f* själv returnera ett felvärde (vanligtvis ``NULL`` eller ``-1``). Den ska *inte* anropa någon av funktionerna ``PyErr_*`` --- en sådan har redan anropats av *g*. *f*:s anropare ska sedan också returnera en felindikation till *sin* anropare, återigen *utan* att anropa ``PyErr_*``, och så vidare --- den mest detaljerade orsaken till felet rapporterades redan av den funktion som först upptäckte det. När felet når Python-tolkens huvudslinga avbryter denna den Python-kod som för närvarande körs och försöker hitta en undantagshanterare som specificerats av Python-programmeraren.

source: (There are situations where a module can actually give a more detailed error message by calling another ``PyErr_*`` function, and in such cases it is fine to do so. As a general rule, however, this is not necessary, and can cause information about the cause of the error to be lost: most operations can fail for a variety of reasons.)
sv: (Det finns situationer där en modul faktiskt kan ge ett mer detaljerat felmeddelande genom att anropa en annan ``PyErr_*``-funktion, och i sådana fall är det bra att göra det. Som en allmän regel är detta dock inte nödvändigt och kan leda till att information om orsaken till felet går förlorad: de flesta operationer kan misslyckas av olika skäl)

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :c:func:`PyErr_Clear`. The only time C code should call :c:func:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
sv: Om du vill ignorera ett undantag som skapats av ett funktionsanrop som misslyckades måste undantagsvillkoret rensas explicit genom att anropa :c:func:`PyErr_Clear`. Den enda gången C-kod bör anropa :c:func:`PyErr_Clear` är om den inte vill skicka felet vidare till tolken utan vill hantera det helt själv (eventuellt genom att prova något annat eller låtsas att inget gick fel).

source: Every failing :c:func:`malloc` call must be turned into an exception --- the direct caller of :c:func:`malloc` (or :c:func:`realloc`) must call :c:func:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :c:func:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :c:func:`malloc` directly.
sv: Varje misslyckat anrop av :c:func:`malloc` måste förvandlas till ett undantag --- den som direkt anropar :c:func:`malloc` (eller :c:func:`realloc`) måste anropa :c:func:`PyErr_NoMemory` och själv returnera en felindikator. Alla objektskapande funktioner (t.ex. :c:func:`PyLong_FromLong`) gör redan detta, så denna anmärkning är bara relevant för dem som anropar :c:func:`malloc` direkt.

source: Also note that, with the important exception of :c:func:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
sv: Observera också att, med det viktiga undantaget :c:func:`PyArg_ParseTuple` och vänner, funktioner som returnerar en heltalsstatus vanligtvis returnerar ett positivt värde eller noll för framgång och ``-1`` för misslyckande, som Unix systemanrop.

source: Finally, be careful to clean up garbage (by making :c:func:`Py_XDECREF` or :c:func:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
sv: Slutligen, var noga med att rensa bort skräp (genom att göra :c:func:`Py_XDECREF` eller :c:func:`Py_DECREF` anrop för objekt som du redan har skapat) när du returnerar en felindikator!

source: The choice of which exception to raise is entirely yours. There are predeclared C objects corresponding to all built-in Python exceptions, such as :c:data:`PyExc_ZeroDivisionError`, which you can use directly. Of course, you should choose exceptions wisely --- don't use :c:data:`PyExc_TypeError` to mean that a file couldn't be opened (that should probably be :c:data:`PyExc_OSError`). If something's wrong with the argument list, the :c:func:`PyArg_ParseTuple` function usually raises :c:data:`PyExc_TypeError`. If you have an argument whose value must be in a particular range or must satisfy other conditions, :c:data:`PyExc_ValueError` is appropriate.
sv: Valet av vilket undantag som ska tas upp är helt och hållet ditt. Det finns fördeklarerade C-objekt som motsvarar alla inbyggda Python-undantag, till exempel :c:data:`PyExc_ZeroDivisionError`, som du kan använda direkt. Naturligtvis bör du välja undantag klokt --- använd inte :c:data:`PyExc_TypeError` för att betyda att en fil inte kunde öppnas (det borde förmodligen vara :c:data:`PyExc_OSError`). Om något är fel med argumentlistan ger funktionen :c:func:`PyArg_ParseTuple` vanligtvis :c:data:`PyExc_TypeError`. Om du har ett argument vars värde måste ligga inom ett visst intervall eller måste uppfylla andra villkor, är :c:data:`PyExc_ValueError` lämplig.

source: You can also define a new exception that is unique to your module. The simplest way to do this is to declare a static global object variable at the beginning of the file::
sv: Du kan också definiera ett nytt undantag som är unikt för din modul. Det enklaste sättet att göra detta är att deklarera en statisk global objektvariabel i början av filen::

source: static PyObject *SpamError = NULL;
sv: statiskt PyObject *SpamError = NULL;

source: and initialize it by calling :c:func:`PyErr_NewException` in the module's :c:data:`Py_mod_exec` function (:c:func:`!spam_module_exec`)::
sv: och initiera den genom att anropa :c:func:`PyErr_NewException` i modulens :c:data:`Py_mod_exec`-funktion (:c:func:`!spam_module_exec`)::

source: Since :c:data:`!SpamError` is a global variable, it will be overwitten every time the module is reinitialized, when the :c:data:`Py_mod_exec` function is called.
sv: Eftersom :c:data:`!SpamError` är en global variabel kommer den att skrivas över varje gång modulen initieras på nytt, när funktionen :c:data:`Py_mod_exec` anropas.

source: For now, let's avoid the issue: we will block repeated initialization by raising an :py:exc:`ImportError`::
sv: För tillfället undviker vi problemet: vi blockerar upprepade initialiseringar genom att skapa ett :py:exc:`ImportError`::

source: static PyObject *SpamError = NULL; static int spam_module_exec(PyObject *m) { if (SpamError != NULL) { PyErr_SetString(PyExc_ImportError, "cannot initialize spam module more than once"); return -1; } SpamError = PyErr_NewException("spam.error", NULL, NULL); if (PyModule_AddObjectRef(m, "SpamError", SpamError) < 0) { return -1; } return 0; } static PyModuleDef_Slot spam_module_slots[] = { {Py_mod_exec, spam_module_exec}, {0, NULL} }; static struct PyModuleDef spam_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "spam", .m_size = 0, // non-negative .m_slots = spam_module_slots, }; PyMODINIT_FUNC PyInit_spam(void) { return PyModuleDef_Init(&spam_module); }
sv: statiskt PyObject *SpamError = NULL; statisk int spam_module_exec(PyObject *m) { if (SpamError != NULL) { PyErr_SetString(PyExc_ImportError, "kan inte initiera spammodulen mer än en gång"); return -1; } SpamError = PyErr_NewException("spam.error", NULL, NULL); if (PyModule_AddObjectRef(m, "SpamError", SpamError) < 0) { return -1; } return 0; } static PyModuleDef_Slot spam_module_slots[] = { {Py_mod_exec, spam_module_exec}, {0, NULL} }; statisk struct PyModuleDef spam_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "spam", .m_size = 0, // icke-negativ .m_slots = spam_module_slots, }; PyMODINIT_FUNC PyInit_spam(void) { return PyModuleDef_Init(&spam_module); }

source: Note that the Python name for the exception object is :exc:`!spam.error`. The :c:func:`PyErr_NewException` function may create a class with the base class being :exc:`Exception` (unless another class is passed in instead of ``NULL``), described in :ref:`bltin-exceptions`.
sv: Observera att Python-namnet för undantagsobjektet är :exc:`!spam.error`. Funktionen :c:func:`PyErr_NewException` kan skapa en klass med basklassen :exc:`Exception` (om inte en annan klass anges istället för ``NULL``), som beskrivs i :ref:`bltin-exceptions`.

source: Note also that the :c:data:`!SpamError` variable retains a reference to the newly created exception class; this is intentional! Since the exception could be removed from the module by external code, an owned reference to the class is needed to ensure that it will not be discarded, causing :c:data:`!SpamError` to become a dangling pointer. Should it become a dangling pointer, C code which raises the exception could cause a core dump or other unintended side effects.
sv: Notera också att variabeln :c:data:`!SpamError` behåller en referens till den nyskapade undantagsklassen; detta är avsiktligt! Eftersom undantaget kan tas bort från modulen av extern kod, behövs en ägd referens till klassen för att säkerställa att den inte kasseras, vilket gör att :c:data:`!SpamError` blir en dinglande pekare. Om den blir en dinglande pekare kan C-kod som väcker undantaget orsaka en kärndump eller andra oavsiktliga bieffekter.
