Repository: yeager/python-docs-sv
Catalog: extending/extending.po
Languages: sv

source: For now, the :c:func:`Py_DECREF` call to remove this reference is missing. Even when the Python interpreter shuts down, the global :c:data:`!SpamError` variable will not be garbage-collected. It will "leak". We did, however, ensure that this will happen at most once per process.
sv: För tillfället saknas :c:func:`Py_DECREF`-anropet för att ta bort denna referens. Även när Python-tolken stängs av kommer den globala :c:data:`!SpamError`-variabeln inte att samlas in. Den kommer att "läcka". Vi har dock försäkrat oss om att detta kommer att ske högst en gång per process.

source: We discuss the use of :c:macro:`PyMODINIT_FUNC` as a function return type later in this sample.
sv: Vi diskuterar användningen av :c:macro:`PyMODINIT_FUNC` som funktionens returtyp senare i detta exempel.

source: The :exc:`!spam.error` exception can be raised in your extension module using a call to :c:func:`PyErr_SetString` as shown below::
sv: Undantaget :exc:`!spam.error` kan skapas i din tilläggsmodul med hjälp av ett anrop till :c:func:`PyErr_SetString` enligt nedan::

source: static PyObject * spam_system(PyObject *self, PyObject *args) { const char *command; int sts; if (!PyArg_ParseTuple(args, "s", &command)) return NULL; sts = system(command); if (sts < 0) { PyErr_SetString(SpamError, "System command failed"); return NULL; } return PyLong_FromLong(sts); }
sv: statiskt PyObject * spam_system(PyObject *self, PyObject *args) { const char *kommando; int sts; if (!PyArg_ParseTuple(args, "s", &command)) returnera NULL; sts = system(kommando); if (sts < 0) { PyErr_SetString(SpamError, "Systemkommando misslyckades"); returnera NULL; } return PyLong_FromLong(sts); }

source: Back to the Example
sv: Tillbaka till exemplet

source: Going back to our example function, you should now be able to understand this statement::
sv: Om vi går tillbaka till vår exempelfunktion bör du nu kunna förstå detta uttalande::

source: if (!PyArg_ParseTuple(args, "s", &command)) return NULL;
sv: if (!PyArg_ParseTuple(args, "s", &kommando)) returnera NULL;

source: It returns ``NULL`` (the error indicator for functions returning object pointers) if an error is detected in the argument list, relying on the exception set by :c:func:`PyArg_ParseTuple`. Otherwise the string value of the argument has been copied to the local variable :c:data:`!command`. This is a pointer assignment and you are not supposed to modify the string to which it points (so in Standard C, the variable :c:data:`!command` should properly be declared as ``const char *command``).
sv: Den returnerar ``NULL`` (felindikatorn för funktioner som returnerar objektpekare) om ett fel upptäcks i argumentlistan och förlitar sig på undantaget som anges av :c:func:`PyArg_ParseTuple`. Annars har argumentets strängvärde kopierats till den lokala variabeln :c:data:`!command`. Detta är en pekartilldelning och det är inte meningen att du ska ändra strängen som den pekar på (så i Standard C bör variabeln :c:data:`!command` korrekt deklareras som ``const char *command``).

source: The next statement is a call to the Unix function :c:func:`system`, passing it the string we just got from :c:func:`PyArg_ParseTuple`::
sv: Nästa sats är ett anrop till Unix-funktionen :c:func:`system` och skickar den strängen som vi just fick från :c:func:`PyArg_ParseTuple`::

source: sts = system(command);
sv: sts = system(kommando);

source: Our :func:`!spam.system` function must return the value of :c:data:`!sts` as a Python object. This is done using the function :c:func:`PyLong_FromLong`. ::
sv: Vår funktion :func:`!spam.system` måste returnera värdet av :c:data:`!sts` som ett Python-objekt. Detta görs med hjälp av funktionen :c:func:`PyLong_FromLong`. ::

source: return PyLong_FromLong(sts);
sv: return PyLong_FromLong(m);

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
sv: I det här fallet kommer det att returnera ett heltalsobjekt. (Ja, även heltal är objekt på heapen i Python!)

source: If you have a C function that returns no useful argument (a function returning :c:expr:`void`), the corresponding Python function must return ``None``. You need this idiom to do so (which is implemented by the :c:macro:`Py_RETURN_NONE` macro)::
sv: Om du har en C-funktion som inte returnerar något användbart argument (en funktion som returnerar :c:expr:`void`), måste motsvarande Python-funktion returnera ``None``. Du behöver detta idiom för att göra det (som implementeras av :c:macro:`Py_RETURN_NONE` macro)::

source: Py_INCREF(Py_None); return Py_None;
sv: Py_INCREF(Py_None); returnera Py_None;

source: :c:data:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a ``NULL`` pointer, which means "error" in most contexts, as we have seen.
sv: :c:data:`Py_None` är C-namnet för det speciella Python-objektet ``None``. Det är ett äkta Python-objekt snarare än en ``NULL``-pekare, som betyder "fel" i de flesta sammanhang, som vi har sett.

source: The Module's Method Table and Initialization Function
sv: Modulens metodtabell och initialiseringsfunktion

source: I promised to show how :c:func:`!spam_system` is called from Python programs. First, we need to list its name and address in a "method table"::
sv: Jag lovade att visa hur :c:func:`!spam_system` anropas från Python-program. Först måste vi lista dess namn och adress i en "metodtabell"::

source: static PyMethodDef spam_methods[] = { ... {"system", spam_system, METH_VARARGS, "Execute a shell command."}, ... {NULL, NULL, 0, NULL} /* Sentinel */ };
sv: statisk PyMethodDef spam_methods[] = { ... {"system", spam_system, METH_VARARGS, "Utför ett shell-kommando."}, ... {NULL, NULL, 0, NULL} /* Sentinel */ };

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :c:func:`PyArg_ParseTuple` is used.
sv: Lägg märke till den tredje posten (``METH_VARARGS``). Detta är en flagga som talar om för tolken vilken anropskonvention som ska användas för C-funktionen. Den bör normalt alltid vara ``METH_VARARGS`` eller ``METH_VARARGS | METH_KEYWORDS``; ett värde på ``0`` betyder att en föråldrad variant av :c:func:`PyArg_ParseTuple` används.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :c:func:`PyArg_ParseTuple`; more information on this function is provided below.
sv: När endast ``METH_VARARGS`` används bör funktionen förvänta sig att parametrarna på Python-nivå skickas in som en tupel som kan tolkas via :c:func:`PyArg_ParseTuple`; mer information om denna funktion finns nedan.

source: The :c:macro:`METH_KEYWORDS` bit may be set in the third field if keyword arguments should be passed to the function. In this case, the C function should accept a third ``PyObject *`` parameter which will be a dictionary of keywords. Use :c:func:`PyArg_ParseTupleAndKeywords` to parse the arguments to such a function.
sv: Bit :c:macro:`METH_KEYWORDS` kan sättas i det tredje fältet om nyckelordsargument skall skickas till funktionen. I detta fall bör C-funktionen acceptera en tredje ``PyObject *`` parameter som kommer att vara en ordbok med nyckelord. Använd :c:func:`PyArg_ParseTupleAndKeywords` för att analysera argumenten till en sådan funktion.

source: The method table must be referenced in the module definition structure::
sv: Metodtabellen måste refereras till i modulens definitionsstruktur::

source: This structure, in turn, must be passed to the interpreter in the module's initialization function. The initialization function must be named :c:func:`!PyInit_name`, where *name* is the name of the module, and should be the only non-\ ``static`` item defined in the module file::
sv: Denna struktur måste i sin tur skickas till tolken i modulens initialiseringsfunktion. Initialiseringsfunktionen måste heta :c:func:`!PyInit_name`, där *name* är modulens namn, och bör vara det enda icke-statiska objektet som definieras i modulfilen::

source: Note that :c:macro:`PyMODINIT_FUNC` declares the function as ``PyObject *`` return type, declares any special linkage declarations required by the platform, and for C++ declares the function as ``extern "C"``.
sv: Observera att :c:macro:`PyMODINIT_FUNC` deklarerar funktionen som ``PyObject *`` returtyp, deklarerar eventuella speciella länkdeklarationer som krävs av plattformen, och för C++ deklarerar funktionen som ``extern "C"``.

source: :c:func:`!PyInit_spam` is called when each interpreter imports its module :mod:`!spam` for the first time. (See below for comments about embedding Python.) A pointer to the module definition must be returned via :c:func:`PyModuleDef_Init`, so that the import machinery can create the module and store it in ``sys.modules``.
sv: :c:func:`!PyInit_spam` anropas när varje tolk importerar sin modul :mod:`!spam` för första gången. (Se nedan för kommentarer om inbäddning av Python.) En pekare till moduldefinitionen måste returneras via :c:func:`PyModuleDef_Init`, så att importmaskineriet kan skapa modulen och lagra den i ``sys.modules``.

source: When embedding Python, the :c:func:`!PyInit_spam` function is not called automatically unless there's an entry in the :c:data:`PyImport_Inittab` table. To add the module to the initialization table, use :c:func:`PyImport_AppendInittab`, optionally followed by an import of the module::
sv: Vid inbäddning av Python anropas inte funktionen :c:func:`!PyInit_spam` automatiskt om det inte finns en post i tabellen :c:data:`PyImport_Inittab`. För att lägga till modulen i initialiseringstabellen, använd :c:func:`PyImport_AppendInittab`, eventuellt följt av en import av modulen::

source: If you declare a global variable or a local static one, the module may experience unintended side-effects on re-initialisation, for example when removing entries from ``sys.modules`` or importing compiled modules into multiple interpreters within a process (or following a :c:func:`fork` without an intervening :c:func:`exec`). If module state is not yet fully :ref:`isolated <isolating-extensions-howto>`, authors should consider marking the module as having no support for subinterpreters (via :c:macro:`Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED`).
sv: Om du deklarerar en global variabel eller en lokal statisk variabel kan modulen få oavsiktliga bieffekter vid ominitialisering, till exempel när du tar bort poster från ``sys.modules`` eller importerar kompilerade moduler till flera tolkar inom en process (eller efter en :c:func:`fork`` utan en mellanliggande :c:func:`exec``). Om modultillståndet ännu inte är helt :ref:`isolerat <isolating-extensions-howto>`, bör författare överväga att markera modulen som att den inte har stöd för undertolkare (via :c:macro:`Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED`).

source: A more substantial example module is included in the Python source distribution as :file:`Modules/xxlimited.c`. This file may be used as a template or simply read as an example.
sv: En mer omfattande exempelmodul ingår i Python-källdistributionen som :file:`Modules/xxlimited.c`. Denna fil kan användas som en mall eller helt enkelt läsas som ett exempel.

source: Compilation and Linkage
sv: Sammanställning och länkning

source: There are two more things to do before you can use your new extension: compiling and linking it with the Python system. If you use dynamic loading, the details may depend on the style of dynamic loading your system uses; see the chapters about building extension modules (chapter :ref:`building`) and additional information that pertains only to building on Windows (chapter :ref:`building-on-windows`) for more information about this.
sv: Det finns ytterligare två saker att göra innan du kan använda ditt nya tillägg: att kompilera och länka det med Python-systemet. Om du använder dynamisk laddning kan detaljerna bero på vilken typ av dynamisk laddning ditt system använder; se kapitlen om att bygga tilläggsmoduler (kapitel :ref:`building`) och ytterligare information som endast gäller för att bygga på Windows (kapitel :ref:`building-on-windows`) för mer information om detta.

source: If you can't use dynamic loading, or if you want to make your module a permanent part of the Python interpreter, you will have to change the configuration setup and rebuild the interpreter. Luckily, this is very simple on Unix: just place your file (:file:`spammodule.c` for example) in the :file:`Modules/` directory of an unpacked source distribution, add a line to the file :file:`Modules/Setup.local` describing your file:
sv: Om du inte kan använda dynamisk laddning, eller om du vill göra din modul till en permanent del av Python-tolken, måste du ändra konfigurationsinställningarna och bygga om tolken. Lyckligtvis är detta mycket enkelt på Unix: placera bara din fil (:file:`spammodule.c` till exempel) i katalogen :file:`Modules/` i en uppackad källkodsdistribution, lägg till en rad i filen :file:`Modules/Setup.local` som beskriver din fil:

source: spam spammodule.o
sv: skräppost spammodule.o

source: and rebuild the interpreter by running :program:`make` in the toplevel directory. You can also run :program:`make` in the :file:`Modules/` subdirectory, but then you must first rebuild :file:`Makefile` there by running ':program:`make` Makefile'. (This is necessary each time you change the :file:`Setup` file.)
sv: och bygga om tolken genom att köra :program:`make` i toplevel-katalogen. Du kan också köra :program:`make` i underkatalogen :file:`Modules/`, men då måste du först bygga om :file:`Makefile` där genom att köra ':program:`make` Makefile'. (Detta är nödvändigt varje gång du ändrar filen :file:`Setup`)

source: If your module requires additional libraries to link with, these can be listed on the line in the configuration file as well, for instance:
sv: Om din modul kräver ytterligare bibliotek att länka med kan dessa också anges på raden i konfigurationsfilen, till exempel:

source: Calling Python Functions from C
sv: Anropa Python-funktioner från C

source: So far we have concentrated on making C functions callable from Python. The reverse is also useful: calling Python functions from C. This is especially the case for libraries that support so-called "callback" functions. If a C interface makes use of callbacks, the equivalent Python often needs to provide a callback mechanism to the Python programmer; the implementation will require calling the Python callback functions from a C callback. Other uses are also imaginable.
sv: Hittills har vi koncentrerat oss på att göra C-funktioner anropsbara från Python. Det omvända är också användbart: att anropa Python-funktioner från C. Detta är särskilt fallet för bibliotek som stöder så kallade "callback"-funktioner. Om ett C-gränssnitt använder sig av callbacks behöver motsvarande Python ofta tillhandahålla en callback-mekanism till Python-programmeraren; implementeringen kräver att Pythons callback-funktioner anropas från en C-callback. Andra användningsområden är också tänkbara.

source: Fortunately, the Python interpreter is easily called recursively, and there is a standard interface to call a Python function. (I won't dwell on how to call the Python parser with a particular string as input --- if you're interested, have a look at the implementation of the :option:`-c` command line option in :file:`Modules/main.c` from the Python source code.)
sv: Lyckligtvis är det lätt att anropa Python-tolken rekursivt och det finns ett standardgränssnitt för att anropa en Python-funktion. (Jag ska inte uppehålla mig vid hur man anropar Python-parsern med en viss sträng som indata --- om du är intresserad kan du titta på implementeringen av kommandoradsalternativet :option:`-c` i :file:`Modules/main.c` från Pythons källkod)

source: Calling a Python function is easy. First, the Python program must somehow pass you the Python function object. You should provide a function (or some other interface) to do this. When this function is called, save a pointer to the Python function object (be careful to :c:func:`Py_INCREF` it!) in a global variable --- or wherever you see fit. For example, the following function might be part of a module definition::
sv: Att anropa en Python-funktion är enkelt. Först måste Python-programmet på något sätt skicka Python-funktionsobjektet till dig. Du bör tillhandahålla en funktion (eller något annat gränssnitt) för att göra detta. När denna funktion anropas sparar du en pekare till Python-funktionsobjektet (var noga med att :c:func:`Py_INCREF` det!) i en global variabel --- eller var du vill. Till exempel kan följande funktion vara en del av en moduldefinition::

source: static PyObject *my_callback = NULL; static PyObject * my_set_callback(PyObject *dummy, PyObject *args) { PyObject *result = NULL; PyObject *temp; if (PyArg_ParseTuple(args, "O:set_callback", &temp)) { if (!PyCallable_Check(temp)) { PyErr_SetString(PyExc_TypeError, "parameter must be callable"); return NULL; } Py_XINCREF(temp); /* Add a reference to new callback */ Py_XDECREF(my_callback); /* Dispose of previous callback */ my_callback = temp; /* Remember new callback */ /* Boilerplate to return "None" */ Py_INCREF(Py_None); result = Py_None; } return result; }
sv: statiskt PyObject *my_callback = NULL; statiskt PyObject * my_set_callback(PyObject *dummy, PyObject *args) { PyObject *resultat = NULL; PyObject *temp; if (PyArg_ParseTuple(args, "O:set_callback", &temp)) { if (!PyCallable_Check(temp)) { PyErr_SetString(PyExc_TypeError, "parametern måste vara anropsbar"); returnera NULL; } Py_XINCREF(temp); /* Lägg till en referens till den nya återuppringningen */ Py_XDECREF(my_callback); /* Avyttra föregående anrop */ my_callback = temp; /* Kom ihåg det nya anropet */ /* Boilerplate för att returnera "None" */ Py_INCREF(Py_None); resultat = Py_None; } returnera resultat; }

source: This function must be registered with the interpreter using the :c:macro:`METH_VARARGS` flag; this is described in section :ref:`methodtable`. The :c:func:`PyArg_ParseTuple` function and its arguments are documented in section :ref:`parsetuple`.
sv: Denna funktion måste registreras hos tolken med hjälp av flaggan :c:macro:`METH_VARARGS`; detta beskrivs i avsnitt :ref:`methodtable`. Funktionen :c:func:`PyArg_ParseTuple` och dess argument finns dokumenterade i avsnitt :ref:`parsetuple`.

source: The macros :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of ``NULL`` pointers (but note that *temp* will not be ``NULL`` in this context). More info on them in section :ref:`refcounts`.
sv: Makrot :c:func:`Py_XINCREF` och :c:func:`Py_XDECREF` ökar/de minskar referensantalet för ett objekt och är säkra i närvaro av ``NULL``pekare (men observera att *temp* inte kommer att vara ``NULL`` i detta sammanhang). Mer information om dem finns i avsnittet :ref:`refcounts`.

source: Later, when it is time to call the function, you call the C function :c:func:`PyObject_CallObject`. This function has two arguments, both pointers to arbitrary Python objects: the Python function, and the argument list. The argument list must always be a tuple object, whose length is the number of arguments. To call the Python function with no arguments, pass in ``NULL``, or an empty tuple; to call it with one argument, pass a singleton tuple. :c:func:`Py_BuildValue` returns a tuple when its format string consists of zero or more format codes between parentheses. For example::
sv: Senare, när det är dags att anropa funktionen, anropar du C-funktionen :c:func:`PyObject_CallObject`. Denna funktion har två argument, båda pekare till godtyckliga Python-objekt: Python-funktionen och argumentlistan. Argumentlistan måste alltid vara ett tuple-objekt, vars längd är antalet argument. För att anropa Python-funktionen utan argument, skicka in ``NULL``, eller en tom tupel; för att anropa den med ett argument, skicka en singleton-tupel. :c:func:`Py_BuildValue` returnerar en tupel när dess formatsträng består av noll eller flera formatkoder mellan parenteser. Till exempel::

source: int arg; PyObject *arglist; PyObject *result; ... arg = 123; ... /* Time to call the callback */ arglist = Py_BuildValue("(i)", arg); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist);
sv: int arg; PyObject *arglist; PyObject *resultat; ... arg = 123; ... /* Dags att anropa återuppringningen */ arglist = Py_BuildValue("(i)", arg); resultat = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist);

source: :c:func:`PyObject_CallObject` returns a Python object pointer: this is the return value of the Python function. :c:func:`PyObject_CallObject` is "reference-count-neutral" with respect to its arguments. In the example a new tuple was created to serve as the argument list, which is :c:func:`Py_DECREF`\ -ed immediately after the :c:func:`PyObject_CallObject` call.
sv: :c:func:`PyObject_CallObject` returnerar en Python-objektpekare: detta är Python-funktionens returvärde. :c:func:`PyObject_CallObject` är "referensräkningsneutral" med avseende på sina argument. I exemplet skapades en ny tupel för att fungera som argumentlista, som :c:func:`Py_DECREF` -ed omedelbart efter anropet av :c:func:`PyObject_CallObject`.

source: The return value of :c:func:`PyObject_CallObject` is "new": either it is a brand new object, or it is an existing object whose reference count has been incremented. So, unless you want to save it in a global variable, you should somehow :c:func:`Py_DECREF` the result, even (especially!) if you are not interested in its value.
sv: Returvärdet för :c:func:`PyObject_CallObject` är "nytt": antingen är det ett helt nytt objekt, eller så är det ett befintligt objekt vars referensantal har ökats. Så om du inte vill spara det i en global variabel bör du på något sätt :c:func:`Py_DECREF` resultatet, även (särskilt!) om du inte är intresserad av dess värde.

source: Before you do this, however, it is important to check that the return value isn't ``NULL``. If it is, the Python function terminated by raising an exception. If the C code that called :c:func:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :c:func:`PyErr_Clear`. For example::
sv: Innan du gör detta är det dock viktigt att kontrollera att returvärdet inte är ``NULL``. Om det är det, avslutas Python-funktionen med ett undantag. Om C-koden som anropade :c:func:`PyObject_CallObject` anropas från Python, bör den nu returnera en felindikation till sin Python-anropare, så att tolken kan skriva ut en stack trace, eller så att den anropande Python-koden kan hantera undantaget. Om detta inte är möjligt eller önskvärt, bör undantaget rensas genom att anropa :c:func:`PyErr_Clear`. Till exempel::

source: if (result == NULL) return NULL; /* Pass error back */ ...use result... Py_DECREF(result);
sv: if (resultat == NULL) return NULL; /* Skicka felet tillbaka */ ...använd resultatet... Py_DECREF(resultat);
