Repository: yeager/python-docs-sv
Catalog: extending/extending.po
Languages: sv

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :c:func:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :c:func:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
sv: Beroende på det önskade gränssnittet till Pythons återuppringningsfunktion kan du också behöva tillhandahålla en argumentlista till :c:func:`PyObject_CallObject`. I vissa fall tillhandahålls argumentlistan också av Python-programmet, genom samma gränssnitt som specificerade callback-funktionen. Den kan då sparas och användas på samma sätt som funktionsobjektet. I andra fall kan du behöva konstruera en ny tupel att skicka som argumentlista. Det enklaste sättet att göra detta är att anropa :c:func:`Py_BuildValue`. Om du t.ex. vill skicka en integrerad händelsekod kan du använda följande kod::

source: PyObject *arglist; ... arglist = Py_BuildValue("(l)", eventcode); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist); if (result == NULL) return NULL; /* Pass error back */ /* Here maybe use the result */ Py_DECREF(result);
sv: PyObject *arglist; ... arglist = Py_BuildValue("(l)", händelsekod); resultat = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist); if (resultat == NULL) return NULL; /* Skicka felet tillbaka */ /* Här kan du kanske använda resultatet */ Py_DECREF(resultat);

source: Note the placement of ``Py_DECREF(arglist)`` immediately after the call, before the error check! Also note that strictly speaking this code is not complete: :c:func:`Py_BuildValue` may run out of memory, and this should be checked.
sv: Notera placeringen av ``Py_DECREF(arglist)`` omedelbart efter anropet, före felkontrollen! Observera också att denna kod inte är komplett i strikt mening: :c:func:`Py_BuildValue` kan få slut på minne, och detta bör kontrolleras.

source: You may also call a function with keyword arguments by using :c:func:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :c:func:`Py_BuildValue` to construct the dictionary. ::
sv: Du kan också anropa en funktion med nyckelordsargument genom att använda :c:func:`PyObject_Call`, som stöder argument och nyckelordsargument. Som i exemplet ovan använder vi :c:func:`Py_BuildValue` för att konstruera ordlistan. ::

source: PyObject *dict; ... dict = Py_BuildValue("{s:i}", "name", val); result = PyObject_Call(my_callback, NULL, dict); Py_DECREF(dict); if (result == NULL) return NULL; /* Pass error back */ /* Here maybe use the result */ Py_DECREF(result);
sv: PyObject *dict; ... dict = Py_BuildValue("{s:i}", "namn", val); resultat = PyObject_Call(my_callback, NULL, dict); Py_DECREF(dict); if (resultat == NULL) return NULL; /* Skicka felet tillbaka */ /* Här kan du kanske använda resultatet */ Py_DECREF(resultat);

source: Extracting Parameters in Extension Functions
sv: Extrahera parametrar i tilläggsfunktioner

source: The :c:func:`PyArg_ParseTuple` function is declared as follows::
sv: Funktionen :c:func:`PyArg_ParseTuple` deklareras enligt följande::

source: The *arg* argument must be a tuple object containing an argument list passed from Python to a C function. The *format* argument must be a format string, whose syntax is explained in :ref:`arg-parsing` in the Python/C API Reference Manual. The remaining arguments must be addresses of variables whose type is determined by the format string.
sv: Argumentet *arg* måste vara ett tuple-objekt som innehåller en argumentlista som skickas från Python till en C-funktion. Argumentet *format* måste vara en formatsträng, vars syntax förklaras i :ref:`arg-parsing` i Python/C API Reference Manual. De återstående argumenten måste vara adresser till variabler vars typ bestäms av formatsträngen.

source: Note that while :c:func:`PyArg_ParseTuple` checks that the Python arguments have the required types, it cannot check the validity of the addresses of C variables passed to the call: if you make mistakes there, your code will probably crash or at least overwrite random bits in memory. So be careful!
sv: Observera att medan :c:func:`PyArg_ParseTuple` kontrollerar att Python-argumenten har de nödvändiga typerna, kan den inte kontrollera giltigheten av adresserna för C-variabler som skickas till anropet: om du gör misstag där kommer din kod förmodligen att krascha eller åtminstone skriva över slumpmässiga bitar i minnet. Så var försiktig!

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
sv: Observera att alla Python-objektreferenser som tillhandahålls till den som anropar är *lånade* referenser; minska inte deras referensantal!

source: Some example calls::
sv: Några exempel på samtal::

source: int ok; int i, j; long k, l; const char *s; Py_ssize_t size; ok = PyArg_ParseTuple(args, ""); /* No arguments */ /* Python call: f() */
sv: int ok; int i, j; lång k, l; konst char *s; Py_ssize_t storlek; ok = PyArg_ParseTuple(args, ""); /* Inga argument */ /* Python-anrop: f() */

source: ok = PyArg_ParseTuple(args, "s", &s); /* A string */ /* Possible Python call: f('whoops!') */
sv: ok = PyArg_ParseTuple(args, "s", &s); /* En sträng */ /* Möjligt Python-anrop: f('whoops!') */

source: ok = PyArg_ParseTuple(args, "lls", &k, &l, &s); /* Two longs and a string */ /* Possible Python call: f(1, 2, 'three') */
sv: ok = PyArg_ParseTuple(args, "lls", &k, &l, &s); /* Två longs och en sträng */ /* Möjligt Python-anrop: f(1, 2, 'tre') */

source: ok = PyArg_ParseTuple(args, "(ii)s#", &i, &j, &s, &size); /* A pair of ints and a string, whose size is also returned */ /* Possible Python call: f((1, 2), 'three') */
sv: ok = PyArg_ParseTuple(args, "(ii)s#", &i, &j, &s, &size); /* Ett par ints och en sträng, vars storlek också returneras */ /* Möjligt Python-anrop: f((1, 2), 'tre') */

source: { const char *file; const char *mode = "r"; int bufsize = 0; ok = PyArg_ParseTuple(args, "s|si", &file, &mode, &bufsize); /* A string, and optionally another string and an integer */ /* Possible Python calls: f('spam') f('spam', 'w') f('spam', 'wb', 100000) */ }
sv: { const char *file; const char *mode = "r"; int bufsize = 0; ok = PyArg_ParseTuple(args, "s|si", &file, &mode, &bufsize); /* En sträng, och eventuellt en annan sträng och ett heltal */ /* Möjliga Python-anrop: f('spam') f('spam', 'w') f('spam', 'wb', 100000) */ }

source: { int left, top, right, bottom, h, v; ok = PyArg_ParseTuple(args, "((ii)(ii))(ii)", &left, &top, &right, &bottom, &h, &v); /* A rectangle and a point */ /* Possible Python call: f(((0, 0), (400, 300)), (10, 10)) */ }
sv: { int vänster, topp, höger, botten, h, v; ok = PyArg_ParseTuple(args, "((ii)(ii))(ii)", &left, &top, &right, &bottom, &h, &v); /* En rektangel och en punkt */ /* Möjligt Python-anrop: f(((0, 0), (400, 300)), (10, 10)) */ }

source: { Py_complex c; ok = PyArg_ParseTuple(args, "D:myfunction", &c); /* a complex, also providing a function name for errors */ /* Possible Python call: myfunction(1+2j) */ }
sv: { Py_komplex c; ok = PyArg_ParseTuple(args, "D:myfunction", &c); /* ett komplex, som också tillhandahåller ett funktionsnamn för fel */ /* Möjligt Python-anrop: myfunction(1+2j) */ }

source: Keyword Parameters for Extension Functions
sv: Nyckelordsparametrar för tilläggsfunktioner

source: The :c:func:`PyArg_ParseTupleAndKeywords` function is declared as follows::
sv: Funktionen :c:func:`PyArg_ParseTupleAndKeywords` deklareras enligt följande::

source: The *arg* and *format* parameters are identical to those of the :c:func:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a ``NULL``-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :c:func:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
sv: Parametrarna *arg* och *format* är identiska med dem i funktionen :c:func:`PyArg_ParseTuple`. Parametern *kwdict* är den ordbok med nyckelord som tas emot som tredje parameter från Pythons runtime. Parametern *kwlist* är en ``NULL``-avslutad lista med strängar som identifierar parametrarna; namnen matchas med typinformationen från *format* från vänster till höger. Vid framgång returnerar :c:func:`PyArg_ParseTupleAndKeywords` true, annars returnerar den false och ger upphov till ett lämpligt undantag.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
sv: Nästlade tupler kan inte analyseras när nyckelordsargument används! Nyckelordsparametrar som skickas in och som inte finns i *kwlist* kommer att orsaka :exc:`TypeError`.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
sv: Här är ett exempel på en modul som använder nyckelord, baserat på ett exempel av Geoff Philbrick (philbrick@hks.com)::

source: #define PY_SSIZE_T_CLEAN #include <Python.h> static PyObject * keywdarg_parrot(PyObject *self, PyObject *args, PyObject *keywds) { int voltage; const char *state = "a stiff"; const char *action = "voom"; const char *type = "Norwegian Blue"; static char *kwlist[] = {"voltage", "state", "action", "type", NULL}; if (!PyArg_ParseTupleAndKeywords(args, keywds, "i|sss", kwlist, &voltage, &state, &action, &type)) return NULL; printf("-- This parrot wouldn't %s if you put %i Volts through it.\n", action, voltage); printf("-- Lovely plumage, the %s -- It's %s!\n", type, state); Py_RETURN_NONE; } static PyMethodDef keywdarg_methods[] = { /* The cast of the function is necessary since PyCFunction values * only take two PyObject* parameters, and keywdarg_parrot() takes * three. */ {"parrot", (PyCFunction)(void(*)(void))keywdarg_parrot, METH_VARARGS | METH_KEYWORDS, "Print a lovely skit to standard output."}, {NULL, NULL, 0, NULL} /* sentinel */ }; static struct PyModuleDef keywdarg_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "keywdarg", .m_size = 0, .m_methods = keywdarg_methods, }; PyMODINIT_FUNC PyInit_keywdarg(void) { return PyModuleDef_Init(&keywdarg_module); }
sv: #definiera PY_SSIZE_T_CLEAN #inkludera <Python.h> statiskt PyObject * keywdarg_parrot(PyObject *self, PyObject *args, PyObject *keywds) { int spänning; const char *state = "en styv"; const char *action = "voom"; const char *type = "norsk blå"; static char *kwlist[] = {"voltage", "state", "action", "type", NULL}; if (!PyArg_ParseTupleAndKeywords(args, keywds, "i|sss", kwlist, &voltage, &state, &action, &type)) returneras NULL; printf("-- Den här papegojan skulle inte %s om du satte %i volt genom den.\n", åtgärd, spänning); printf("-- Vacker fjäderdräkt, den %s -- Den är %s!\n", typ, tillstånd); Py_RETURN_NONE; } static PyMethodDef keywdarg_methods[] = { /* Castningen av funktionen är nödvändig eftersom PyCFunction-värden * bara tar två PyObject* parametrar och keywdarg_parrot() tar tre * tre. */ {"parrot", (PyCFunction)(void(*)(void))keywdarg_parrot, METH_VARARGS | METH_KEYWORDS, "Skriv ut en vacker sketch till standardutmatningen."}, {NULL, NULL, 0, NULL} /* sentinel */ }; static struct PyModuleDef keywdarg_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "keywdarg", .m_size = 0, .m_methods = keywdarg_methods, }; PyMODINIT_FUNC PyInit_keywdarg(void) { return PyModuleDef_Init(&keywdarg_module); }

source: Building Arbitrary Values
sv: Att bygga godtyckliga värden

source: This function is the counterpart to :c:func:`PyArg_ParseTuple`. It is declared as follows::
sv: Denna funktion är motsvarigheten till :c:func:`PyArg_ParseTuple`. Den deklareras på följande sätt::

source: It recognizes a set of format units similar to the ones recognized by :c:func:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
sv: Den känner igen en uppsättning formatenheter som liknar dem som känns igen av :c:func:`PyArg_ParseTuple`, men argumenten (som är indata till funktionen, inte utdata) får inte vara pekare, bara värden. Den returnerar ett nytt Python-objekt, lämpligt för att returnera från en C-funktion som anropas från Python.

source: One difference with :c:func:`PyArg_ParseTuple`: while the latter requires its first argument to be a tuple (since Python argument lists are always represented as tuples internally), :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
sv: En skillnad med :c:func:`PyArg_ParseTuple`: medan den senare kräver att dess första argument är en tupel (eftersom Python-argumentlistor alltid representeras som tuplar internt), bygger :c:func:`Py_BuildValue` inte alltid en tupel. Den bygger en tupel endast om dess formatsträng innehåller två eller fler formatenheter. Om formatsträngen är tom returnerar den ``None``; om den innehåller exakt en formatenhet returnerar den det objekt som beskrivs av den formatenheten. Om du vill tvinga den att returnera en tupel av storlek 0 eller ett, sätter du formatsträngen i parentes.

source: Examples (to the left the call, to the right the resulting Python value):
sv: Exempel (till vänster anropet, till höger det resulterande Python-värdet):

source: Py_BuildValue("") None Py_BuildValue("i", 123) 123 Py_BuildValue("iii", 123, 456, 789) (123, 456, 789) Py_BuildValue("s", "hello") 'hello' Py_BuildValue("y", "hello") b'hello' Py_BuildValue("ss", "hello", "world") ('hello', 'world') Py_BuildValue("s#", "hello", 4) 'hell' Py_BuildValue("y#", "hello", 4) b'hell' Py_BuildValue("()") () Py_BuildValue("(i)", 123) (123,) Py_BuildValue("(ii)", 123, 456) (123, 456) Py_BuildValue("(i,i)", 123, 456) (123, 456) Py_BuildValue("[i,i]", 123, 456) [123, 456] Py_BuildValue("{s:i,s:i}", "abc", 123, "def", 456) {'abc': 123, 'def': 456} Py_BuildValue("((ii)(ii)) (ii)", 1, 2, 3, 4, 5, 6) (((1, 2), (3, 4)), (5, 6))
sv: Py_BuildValue("") Ingen Py_BuildValue("i", 123) 123 Py_BuildValue("iii", 123, 456, 789) (123, 456, 789) Py_BuildValue("s", "hallå") 'hallå' Py_BuildValue("y", "hallå") b'hallå' Py_BuildValue("ss", "hallå", "värld") ("hallå", "värld") Py_BuildValue("s#", "hallå", 4) 'helvete' Py_BuildValue("y#", "hallå", 4) b'helvete' Py_BuildValue("()") () Py_BuildValue("(i)", 123) (123,) Py_BuildValue("(ii)", 123, 456) (123, 456) Py_BuildValue("(i,i)", 123, 456) (123, 456) Py_BuildValue("[i,i]", 123, 456) [123, 456] Py_BuildValue("[i,i]", 123, 456) Py_BuildValue("{s:i,s:i}", "abc", 123, "def", 456) {'abc': 123, 'def': 456} Py_BuildValue("((ii)(ii)) (ii)", 1, 2, 3, 4, 5, 6) (((1, 2), (3, 4)), (5, 6))

source: Reference Counts
sv: Referensräkningar

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :c:func:`malloc` and :c:func:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
sv: I språk som C eller C++ är programmeraren ansvarig för dynamisk allokering och avallokering av minne på heapen. I C görs detta med hjälp av funktionerna :c:func:`malloc` och :c:func:`free`. I C++ används operatorerna ``new`` och ``delete`` med i stort sett samma innebörd och vi kommer att begränsa följande diskussion till C-fallet.

source: Every block of memory allocated with :c:func:`malloc` should eventually be returned to the pool of available memory by exactly one call to :c:func:`free`. It is important to call :c:func:`free` at the right time. If a block's address is forgotten but :c:func:`free` is not called for it, the memory it occupies cannot be reused until the program terminates. This is called a :dfn:`memory leak`. On the other hand, if a program calls :c:func:`free` for a block and then continues to use the block, it creates a conflict with reuse of the block through another :c:func:`malloc` call. This is called :dfn:`using freed memory`. It has the same bad consequences as referencing uninitialized data --- core dumps, wrong results, mysterious crashes.
sv: Varje minnesblock som allokerats med :c:func:`malloc` bör så småningom återföras till poolen av tillgängligt minne genom exakt ett anrop till :c:func:`free`. Det är viktigt att anropa :c:func:`free` vid rätt tidpunkt. Om adressen till ett block glöms bort men :c:func:`free` inte anropas för det, kan det minne som det upptar inte återanvändas förrän programmet avslutas. Detta kallas för en :dfn:`minnesläcka`. Å andra sidan, om ett program anropar :c:func:`free` för ett block och sedan fortsätter att använda blocket, skapar det en konflikt med återanvändning av blocket genom ett annat :c:func:`malloc`-anrop. Detta kallas :dfn:`using freed memory`. Det har samma dåliga konsekvenser som att referera till oinitialiserade data --- kärndumpar, felaktiga resultat, mystiska krascher.

source: Common causes of memory leaks are unusual paths through the code. For instance, a function may allocate a block of memory, do some calculation, and then free the block again. Now a change in the requirements for the function may add a test to the calculation that detects an error condition and can return prematurely from the function. It's easy to forget to free the allocated memory block when taking this premature exit, especially when it is added later to the code. Such leaks, once introduced, often go undetected for a long time: the error exit is taken only in a small fraction of all calls, and most modern machines have plenty of virtual memory, so the leak only becomes apparent in a long-running process that uses the leaking function frequently. Therefore, it's important to prevent leaks from happening by having a coding convention or strategy that minimizes this kind of errors.
sv: Vanliga orsaker till minnesläckage är ovanliga vägar genom koden. En funktion kan t.ex. allokera ett minnesblock, göra en beräkning och sedan frigöra blocket igen. Nu kan en ändring i kraven för funktionen lägga till ett test i beräkningen som upptäcker ett feltillstånd och kan återvända i förtid från funktionen. Det är lätt att glömma att frigöra det allokerade minnesblocket när man gör denna för tidiga exit, särskilt när det läggs till senare i koden. När sådana läckor väl har uppstått går de ofta oupptäckta under lång tid: felreturen sker bara i en liten del av alla anrop, och de flesta moderna maskiner har gott om virtuellt minne, så läckan blir bara uppenbar i en långvarig process som använder den läckande funktionen ofta. Därför är det viktigt att förhindra att läckor uppstår genom att ha en kodningskonvention eller strategi som minimerar den här typen av fel.

source: Since Python makes heavy use of :c:func:`malloc` and :c:func:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
sv: Eftersom Python använder sig mycket av :c:func:`malloc` och :c:func:`free`, behöver det en strategi för att undvika minnesläckor och användning av frigjort minne. Den valda metoden kallas :dfn:`referensräkning`. Principen är enkel: varje objekt innehåller en räknare, som ökas när en referens till objektet lagras någonstans, och som minskas när en referens till det tas bort. När räknaren når noll har den sista referensen till objektet raderats och objektet är frigjort.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :c:func:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :c:func:`malloc` and :c:func:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
sv: En alternativ strategi kallas :dfn:`automatic garbage collection`. (Ibland kallas referensräkning också för en skräpinsamlingsstrategi, därav min användning av "automatisk" för att skilja de två åt) Den stora fördelen med automatisk garbage collection är att användaren inte behöver anropa :c:func:`free` explicit. (En annan påstådd fördel är en förbättring av hastighet eller minnesanvändning --- detta är dock inget hårt faktum.) Nackdelen är att det för C inte finns någon verkligt portabel automatisk garbage collector, medan referensräkning kan implementeras portabelt (så länge funktionerna :c:func:`malloc` och :c:func:`free` är tillgängliga --- vilket C-standarden garanterar). Kanske kommer en dag en tillräckligt portabel automatisk skräpsamlare att finnas tillgänglig för C. Till dess får vi leva med referensräkning.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
sv: Python använder den traditionella referensräkningsimplementeringen, men erbjuder också en cykeldetektor som upptäcker referenscykler. Detta gör att applikationer inte behöver oroa sig för att skapa direkta eller indirekta cirkulära referenser; dessa är svagheten hos skräpsamling som implementeras med endast referensräkning. Referenscykler består av objekt som innehåller (eventuellt indirekta) referenser till sig själva, så att varje objekt i cykeln har ett referensantal som inte är noll. Typiska implementationer av referensräkning kan inte återta det minne som tillhör något objekt i en referenscykel, eller som refereras från objekten i cykeln, även om det inte finns några ytterligare referenser till själva cykeln.
