Repository: yeager/python-docs-sv
Catalog: extending/extending.po
Languages: sv

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
sv: Portabilitet kräver därför att man inte gör några antaganden om symbolers synlighet. Detta innebär att alla symboler i tilläggsmoduler bör deklareras ``statiska``, med undantag för modulens initialiseringsfunktion, för att undvika namnkrockar med andra tilläggsmoduler (vilket diskuteras i avsnitt :ref:`methodtable`). Och det innebär att symboler som *bör* vara åtkomliga från andra tilläggsmoduler måste exporteras på ett annat sätt.

source: Python provides a special mechanism to pass C-level information (pointers) from one extension module to another one: Capsules. A Capsule is a Python data type which stores a pointer (:c:expr:`void \*`). Capsules can only be created and accessed via their C API, but they can be passed around like any other Python object. In particular, they can be assigned to a name in an extension module's namespace. Other extension modules can then import this module, retrieve the value of this name, and then retrieve the pointer from the Capsule.
sv: Python tillhandahåller en speciell mekanism för att skicka information på C-nivå (pekare) från en tilläggsmodul till en annan: Kapslar. En Capsule är en Python-datatyp som lagrar en pekare (:c:expr:`void \*`). Kapslar kan bara skapas och nås via deras C API, men de kan skickas runt som vilket annat Python-objekt som helst. I synnerhet kan de tilldelas ett namn i en tilläggsmoduls namnrymd. Andra tilläggsmoduler kan sedan importera den här modulen, hämta värdet på det här namnet och sedan hämta pekaren från Capsule.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
sv: Det finns många sätt att använda kapslar för att exportera C API för en tilläggsmodul. Varje funktion kan få sin egen Capsule, eller så kan alla C API-pekare lagras i en array vars adress publiceras i en Capsule. Och de olika uppgifterna för att lagra och hämta pekarna kan fördelas på olika sätt mellan modulen som tillhandahåller koden och klientmodulerna.

source: Whichever method you choose, it's important to name your Capsules properly. The function :c:func:`PyCapsule_New` takes a name parameter (:c:expr:`const char \*`); you're permitted to pass in a ``NULL`` name, but we strongly encourage you to specify a name. Properly named Capsules provide a degree of runtime type-safety; there is no feasible way to tell one unnamed Capsule from another.
sv: Oavsett vilken metod du väljer är det viktigt att namnge dina kapslar på rätt sätt. Funktionen :c:func:`PyCapsule_New` tar emot en namnparameter (:c:expr:`const char \*`); du får skicka in ett ``NULL`` namn, men vi uppmuntrar dig starkt att ange ett namn. Korrekt namngivna kapslar ger en viss grad av typsäkerhet under körning; det finns inget genomförbart sätt att skilja en namnlös kapsel från en annan.

source: In particular, Capsules used to expose C APIs should be given a name following this convention::
sv: I synnerhet bör kapslar som används för att exponera C API:er ges ett namn enligt följande konvention::

source: modulename.attributename
sv: modulename.attributnamn

source: The convenience function :c:func:`PyCapsule_Import` makes it easy to load a C API provided via a Capsule, but only if the Capsule's name matches this convention. This behavior gives C API users a high degree of certainty that the Capsule they load contains the correct C API.
sv: Bekvämlighetsfunktionen :c:func:`PyCapsule_Import` gör det enkelt att ladda ett C API som tillhandahålls via en Capsule, men bara om Capsulens namn matchar denna konvention. Detta beteende ger C API-användare en hög grad av säkerhet att den Capsule de laddar innehåller rätt C API.

source: The following example demonstrates an approach that puts most of the burden on the writer of the exporting module, which is appropriate for commonly used library modules. It stores all C API pointers (just one in the example!) in an array of :c:expr:`void` pointers which becomes the value of a Capsule. The header file corresponding to the module provides a macro that takes care of importing the module and retrieving its C API pointers; client modules only have to call this macro before accessing the C API.
sv: Följande exempel visar ett tillvägagångssätt som lägger det mesta av bördan på författaren av den exporterande modulen, vilket är lämpligt för vanliga biblioteksmoduler. Den lagrar alla C API-pekare (bara en i exemplet!) i en array av :c:expr:`void`-pekare som blir värdet på en Capsule. Headerfilen som motsvarar modulen innehåller ett makro som tar hand om att importera modulen och hämta dess C API-pekare; klientmoduler behöver bara anropa detta makro innan de får tillgång till C API.

source: The exporting module is a modification of the :mod:`!spam` module from section :ref:`extending-simpleexample`. The function :func:`!spam.system` does not call the C library function :c:func:`system` directly, but a function :c:func:`!PySpam_System`, which would of course do something more complicated in reality (such as adding "spam" to every command). This function :c:func:`!PySpam_System` is also exported to other extension modules.
sv: Den exporterande modulen är en modifiering av :mod:`!spam`-modulen från avsnitt :ref:`extending-simpleexample`. Funktionen :func:`!spam.system` anropar inte C-bibliotekets funktion :c:func:`system` direkt, utan en funktion :c:func:`!PySpam_System`, som naturligtvis skulle göra något mer komplicerat i verkligheten (som att lägga till "spam" till varje kommando). Denna funktion :c:func:`!PySpam_System` exporteras också till andra tilläggsmoduler.

source: The function :c:func:`!PySpam_System` is a plain C function, declared ``static`` like everything else::
sv: Funktionen :c:func:`!PySpam_System` är en vanlig C-funktion, deklarerad ``static`` som allt annat::

source: static int PySpam_System(const char *command) { return system(command); }
sv: statisk int PySpam_System(const char *kommando) { return system(kommando); }

source: The function :c:func:`!spam_system` is modified in a trivial way::
sv: Funktionen :c:func:`!spam_system` modifieras på ett trivialt sätt::

source: static PyObject * spam_system(PyObject *self, PyObject *args) { const char *command; int sts; if (!PyArg_ParseTuple(args, "s", &command)) return NULL; sts = PySpam_System(command); return PyLong_FromLong(sts); }
sv: statiskt PyObject * spam_system(PyObject *self, PyObject *args) { const char *kommando; int sts; if (!PyArg_ParseTuple(args, "s", &command)) returnera NULL; sts = PySpam_System(kommando); return PyLong_FromLong(sts); }

source: In the beginning of the module, right after the line ::
sv: I början av modulen, direkt efter raden ::

source: #include <Python.h>
sv: #inkludera <Python.h>

source: two more lines must be added::
sv: ytterligare två rader måste läggas till::

source: #define SPAM_MODULE #include "spammodule.h"
sv: #definiera SPAM_MODULE #inkludera "spammodule.h"

source: The ``#define`` is used to tell the header file that it is being included in the exporting module, not a client module. Finally, the module's :c:data:`mod_exec <Py_mod_exec>` function must take care of initializing the C API pointer array::
sv: ``#define`` används för att tala om för headerfilen att den ingår i den exporterande modulen, inte i en klientmodul. Slutligen måste modulens funktion :c:data:`mod_exec <Py_mod_exec>` ta hand om initialiseringen av C API-pekaren array::

source: static int spam_module_exec(PyObject *m) { static void *PySpam_API[PySpam_API_pointers]; PyObject *c_api_object; /* Initialize the C API pointer array */ PySpam_API[PySpam_System_NUM] = (void *)PySpam_System; /* Create a Capsule containing the API pointer array's address */ c_api_object = PyCapsule_New((void *)PySpam_API, "spam._C_API", NULL); if (PyModule_Add(m, "_C_API", c_api_object) < 0) { return -1; } return 0; }
sv: statisk int spam_module_exec(PyObject *m) { statiskt void *PySpam_API[PySpam_API_pointers]; PyObject *c_api_object; /* Initialisera C API-pekararrayen */ PySpam_API[PySpam_System_NUM] = (void *)PySpam_System; /* Skapa en kapsel som innehåller API-pekararrayens adress */ c_api_object = PyCapsule_New((void *)PySpam_API, "spam._C_API", NULL); if (PyModule_Add(m, "_C_API", c_api_object) < 0) { return -1; } return 0; }

source: Note that ``PySpam_API`` is declared ``static``; otherwise the pointer array would disappear when :c:func:`!PyInit_spam` terminates!
sv: Observera att ``PySpam_API`` är deklarerat ``statiskt``; annars skulle pekararrayen försvinna när :c:func:`!PyInit_spam` avslutas!

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
sv: Huvuddelen av arbetet ligger i header-filen :file:`spammodule.h`, som ser ut så här::

source: #ifndef Py_SPAMMODULE_H #define Py_SPAMMODULE_H #ifdef __cplusplus extern "C" { #endif /* Header file for spammodule */ /* C API functions */ #define PySpam_System_NUM 0 #define PySpam_System_RETURN int #define PySpam_System_PROTO (const char *command) /* Total number of C API pointers */ #define PySpam_API_pointers 1 #ifdef SPAM_MODULE /* This section is used when compiling spammodule.c */ static PySpam_System_RETURN PySpam_System PySpam_System_PROTO; #else /* This section is used in modules that use spammodule's API */ static void **PySpam_API; #define PySpam_System \ (*(PySpam_System_RETURN (*)PySpam_System_PROTO) PySpam_API[PySpam_System_NUM]) /* Return -1 on error, 0 on success. * PyCapsule_Import will set an exception if there's an error. */ static int import_spam(void) { PySpam_API = (void **)PyCapsule_Import("spam._C_API", 0); return (PySpam_API != NULL) ? 0 : -1; } #endif #ifdef __cplusplus } #endif #endif /* !defined(Py_SPAMMODULE_H) */
sv: #ifndef Py_SPAMMODULE_H #define Py_SPAMMODULE_H #ifdef __cplusplus extern "C" { #endif /* Huvudfil för spammodul */ /* C API-funktioner */ #definiera PySpam_System_NUM 0 #define PySpam_System_RETURN int #define PySpam_System_PROTO (const char *kommando) /* Totalt antal C API-pekare */ #define PySpam_API_pointers 1 #ifdef SPAM_MODULE /* Detta avsnitt används vid kompilering av spammodule.c */ static PySpam_System_RETURN PySpam_System PySpam_System_PROTO; #else /* Detta avsnitt används i moduler som använder spammodules API */ statiskt void **PySpam_API; #definiera PySpam_System \ (*(PySpam_System_RETURN (*)PySpam_System_PROTO) PySpam_API[PySpam_System_NUM]) /* Returnerar -1 vid fel, 0 vid framgång. * PyCapsule_Import kommer att sätta ett undantag om det finns ett fel. */ statisk int import_spam(void) { PySpam_API = (void **)PyCapsule_Import("spam._C_API", 0); return (PySpam_API != NULL) ? 0 : -1; } #endif #ifdef __cplusplus } #endif #endif /* !defined(Py_SPAMMODULE_H) */

source: All that a client module must do in order to have access to the function :c:func:`!PySpam_System` is to call the function (or rather macro) :c:func:`!import_spam` in its :c:data:`mod_exec <Py_mod_exec>` function::
sv: Allt som en klientmodul behöver göra för att få tillgång till funktionen :c:func:`!PySpam_System` är att anropa funktionen (eller snarare makrot) :c:func:`!import_spam` i sin :c:data:`mod_exec <Py_mod_exec>`-funktion::

source: static int client_module_exec(PyObject *m) { if (import_spam() < 0) { return -1; } /* additional initialization can happen here */ return 0; }
sv: statisk int client_module_exec(PyObject *m) { if (import_spam() < 0) { returnerar -1; } /* ytterligare initialisering kan ske här */ return 0; }

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
sv: Den största nackdelen med detta tillvägagångssätt är att filen :file:`spammodule.h` är ganska komplicerad. Grundstrukturen är dock densamma för varje funktion som exporteras, så den behöver bara läras in en gång.

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
sv: Slutligen bör det nämnas att Capsules erbjuder ytterligare funktionalitet, som är särskilt användbar för minnesallokering och deallokering av pekaren som lagras i en Capsule. Detaljerna beskrivs i Python/C API Reference Manual i avsnittet :ref:`capsules` och i implementationen av Capsules (filerna :file:`Include/pycapsule.h` och :file:`Objects/pycapsule.c` i Pythons källkodsdistribution).

source: Footnotes
sv: Fotnoter

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
sv: Ett gränssnitt för denna funktion finns redan i standardmodulen :mod:`os` --- den valdes som ett enkelt och okomplicerat exempel.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
sv: Metaforen med att "låna" en referens är inte helt korrekt: ägaren har fortfarande en kopia av referensen.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
sv: Att kontrollera att referensantalet är minst 1 **fungerar inte** --- själva referensantalet kan finnas i det frigjorda minnet och kan därmed återanvändas för ett annat objekt!

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
sv: Dessa garantier gäller inte när du använder den "gamla" anropskonventionen --- detta finns fortfarande i mycket befintlig kod.

source: PyObject_CallObject (C function)
sv: PyObject_CallObject (C-funktion)

source: PyArg_ParseTuple (C function)
sv: PyArg_ParseTuple (C-funktion)

source: PyArg_ParseTupleAndKeywords (C function)
sv: PyArg_ParseTupleAndKeywords (C-funktion)
