Repository: yeager/python-docs-sv
Catalog: extending/extending.po
Languages: sv

source: The cycle detector is able to detect garbage cycles and can reclaim them. The :mod:`gc` module exposes a way to run the detector (the :func:`~gc.collect` function), as well as configuration interfaces and the ability to disable the detector at runtime.
sv: Cykeldetektorn kan upptäcka skräpcykler och kan återta dem. Modulen :mod:`gc` exponerar ett sätt att köra detektorn (funktionen :func:`~gc.collect`), samt konfigurationsgränssnitt och möjligheten att inaktivera detektorn vid körning.

source: Reference Counting in Python
sv: Referensräkning i Python

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :c:func:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :c:func:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
sv: Det finns två makron, ``Py_INCREF(x)`` och ``Py_DECREF(x)``, som hanterar inkrementering och dekrementering av referensantalet. :c:func:`Py_DECREF` frigör också objektet när antalet når noll. För flexibilitetens skull anropar den inte :c:func:`free` direkt --- utan den gör ett anrop via en funktionspekare i objektets :dfn:`type object`. För detta ändamål (och andra) innehåller varje objekt också en pekare till sitt typobjekt.

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :c:func:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :c:func:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
sv: Nu återstår den stora frågan: när ska man använda ``Py_INCREF(x)`` och ``Py_DECREF(x)``? Låt oss först introducera några termer. Ingen "äger" ett objekt, men du kan :dfn:`äga en referens` till ett objekt. Ett objekts referensantal definieras nu som antalet ägda referenser till det. Ägaren till en referens är ansvarig för att anropa :c:func:`Py_DECREF` när referensen inte längre behövs. Äganderätten till en referens kan överföras. Det finns tre sätt att göra sig av med en ägd referens: skicka den vidare, lagra den eller anropa :c:func:`Py_DECREF`. Om man glömmer att göra sig av med en ägd referens uppstår en minnesläcka.

source: It is also possible to :dfn:`borrow` [#]_ a reference to an object. The borrower of a reference should not call :c:func:`Py_DECREF`. The borrower must not hold on to the object longer than the owner from which it was borrowed. Using a borrowed reference after the owner has disposed of it risks using freed memory and should be avoided completely [#]_.
sv: Det är också möjligt att :dfn:`låna` [#]_ en referens till ett objekt. Låntagaren av en referens bör inte anropa :c:func:`Py_DECREF`. Låntagaren får inte behålla objektet längre än ägaren från vilken det lånades. Att använda en lånad referens efter att ägaren har gjort sig av med den riskerar att använda frigjort minne och bör undvikas helt [#]_.

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
sv: Fördelen med att låna en referens jämfört med att äga den är att du inte behöver ta hand om referensen på alla möjliga vägar genom koden --- med andra ord, med en lånad referens löper du inte risken att läcka när en för tidig exit tas. Nackdelen med att låna i stället för att äga är att det finns vissa subtila situationer där en lånad referens i till synes korrekt kod kan användas efter att ägaren som den lånades från i själva verket har gjort sig av med den.

source: A borrowed reference can be changed into an owned reference by calling :c:func:`Py_INCREF`. This does not affect the status of the owner from which the reference was borrowed --- it creates a new owned reference, and gives full owner responsibilities (the new owner must dispose of the reference properly, as well as the previous owner).
sv: En lånad referens kan ändras till en ägd referens genom att anropa :c:func:`Py_INCREF`. Detta påverkar inte statusen för den ägare från vilken referensen lånades --- det skapar en ny ägd referens och ger ägaren fullt ansvar (den nya ägaren måste göra sig av med referensen på rätt sätt, liksom den tidigare ägaren).

source: Ownership Rules
sv: Regler för ägande

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
sv: När en objektreferens skickas in i eller ut ur en funktion är det en del av funktionens gränssnittsspecifikation om äganderätten överförs med referensen eller inte.

source: Most functions that return a reference to an object pass on ownership with the reference. In particular, all functions whose function it is to create a new object, such as :c:func:`PyLong_FromLong` and :c:func:`Py_BuildValue`, pass ownership to the receiver. Even if the object is not actually new, you still receive ownership of a new reference to that object. For instance, :c:func:`PyLong_FromLong` maintains a cache of popular values and can return a reference to a cached item.
sv: De flesta funktioner som returnerar en referens till ett objekt skickar äganderätten vidare med referensen. I synnerhet alla funktioner vars funktion är att skapa ett nytt objekt, till exempel :c:func:`PyLong_FromLong` och :c:func:`Py_BuildValue`, överför äganderätten till mottagaren. Även om objektet egentligen inte är nytt, får du ändå äganderätten till en ny referens till objektet. Till exempel upprätthåller :c:func:`PyLong_FromLong` en cache av populära värden och kan returnera en referens till ett cachat objekt.

source: Many functions that extract objects from other objects also transfer ownership with the reference, for instance :c:func:`PyObject_GetAttrString`. The picture is less clear, here, however, since a few common routines are exceptions: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, and :c:func:`PyDict_GetItemString` all return references that you borrow from the tuple, list or dictionary.
sv: Många funktioner som extraherar objekt från andra objekt överför också äganderätten med referensen, till exempel :c:func:`PyObject_GetAttrString`. Här är bilden dock inte lika tydlig eftersom några vanliga rutiner utgör undantag: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem` och :c:func:`PyDict_GetItemString` returnerar alla referenser som du lånar från tupeln, listan eller ordboken.

source: The function :c:func:`PyImport_AddModule` also returns a borrowed reference, even though it may actually create the object it returns: this is possible because an owned reference to the object is stored in ``sys.modules``.
sv: Funktionen :c:func:`PyImport_AddModule` returnerar också en lånad referens, även om den faktiskt kan skapa det objekt den returnerar: detta är möjligt eftersom en ägd referens till objektet lagras i ``sys.modules``.

source: When you pass an object reference into another function, in general, the function borrows the reference from you --- if it needs to store it, it will use :c:func:`Py_INCREF` to become an independent owner. There are exactly two important exceptions to this rule: :c:func:`PyTuple_SetItem` and :c:func:`PyList_SetItem`. These functions take over ownership of the item passed to them --- even if they fail! (Note that :c:func:`PyDict_SetItem` and friends don't take over ownership --- they are "normal.")
sv: När du skickar en objektreferens till en annan funktion lånar funktionen i allmänhet referensen från dig --- om den behöver lagra den kommer den att använda :c:func:`Py_INCREF` för att bli en oberoende ägare. Det finns exakt två viktiga undantag från denna regel: :c:func:`PyTuple_SetItem` och :c:func:`PyList_SetItem`. Dessa funktioner tar över ägandet av det objekt som skickas till dem --- även om de misslyckas! (Observera att :c:func:`PyDict_SetItem` och vänner inte tar över ägandet --- de är "normala.")

source: When a C function is called from Python, it borrows references to its arguments from the caller. The caller owns a reference to the object, so the borrowed reference's lifetime is guaranteed until the function returns. Only when such a borrowed reference must be stored or passed on, it must be turned into an owned reference by calling :c:func:`Py_INCREF`.
sv: När en C-funktion anropas från Python lånar den referenser till sina argument från den som anropar. Den som anropar äger en referens till objektet, så den lånade referensens livstid är garanterad tills funktionen returneras. Endast när en sådan lånad referens måste lagras eller skickas vidare, måste den omvandlas till en ägd referens genom att anropa :c:func:`Py_INCREF`.

source: The object reference returned from a C function that is called from Python must be an owned reference --- ownership is transferred from the function to its caller.
sv: Den objektreferens som returneras från en C-funktion som anropas från Python måste vara en ägd referens --- ägandet överförs från funktionen till den som anropar.

source: Thin Ice
sv: Tunn is

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
sv: Det finns några situationer där en till synes harmlös användning av en lånad referens kan leda till problem. Dessa har alla att göra med implicita anrop av tolken, vilket kan leda till att ägaren av en referens gör sig av med den.

source: The first and most important case to know about is using :c:func:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
sv: Det första och viktigaste fallet att känna till är att använda :c:func:`Py_DECREF` på ett orelaterat objekt medan man lånar en referens till ett listobjekt. Till exempel::

source: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(item, stdout, 0); /* BUG! */ }
sv: void bug(PyObject *lista) { PyObject *item = PyList_GetItem(list, 0); PyList_SetItem(lista, 1, PyLong_FromLong(0L)); PyObject_Print(item, stdout, 0); /* BUG! */ }

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
sv: Den här funktionen lånar först en referens till ``list[0]``, ersätter sedan ``list[1]`` med värdet ``0`` och skriver slutligen ut den lånade referensen. Ser ofarligt ut, eller hur? Men det är det inte!

source: Let's follow the control flow into :c:func:`PyList_SetItem`. The list owns references to all its items, so when item 1 is replaced, it has to dispose of the original item 1. Now let's suppose the original item 1 was an instance of a user-defined class, and let's further suppose that the class defined a :meth:`!__del__` method. If this class instance has a reference count of 1, disposing of it will call its :meth:`!__del__` method.
sv: Låt oss följa kontrollflödet in i :c:func:`PyList_SetItem`. Listan äger referenser till alla sina objekt, så när objekt 1 ersätts måste den göra sig av med det ursprungliga objektet 1. Låt oss nu anta att det ursprungliga objektet 1 var en instans av en användardefinierad klass, och låt oss vidare anta att klassen definierade en :meth:`!__del__`-metod. Om denna klassinstans har ett referensantal på 1, kommer dess :meth:`!__del__`-metod att anropas när den kasseras.

source: Since it is written in Python, the :meth:`!__del__` method can execute arbitrary Python code. Could it perhaps do something to invalidate the reference to ``item`` in :c:func:`!bug`? You bet! Assuming that the list passed into :c:func:`!bug` is accessible to the :meth:`!__del__` method, it could execute a statement to the effect of ``del list[0]``, and assuming this was the last reference to that object, it would free the memory associated with it, thereby invalidating ``item``.
sv: Eftersom den är skriven i Python kan metoden :meth:`!__del__` exekvera godtycklig Python-kod. Kan den kanske göra något för att ogiltigförklara referensen till ``item`` i :c:func:`!bug`? Det kan du ge dig på! Förutsatt att listan som skickas till :c:func:`!bug` är tillgänglig för metoden :meth:`!__del__`, skulle den kunna utföra ett uttalande med effekten ``del list[0]``, och förutsatt att detta var den sista referensen till det objektet, skulle den frigöra minnet som är associerat med det, och därmed ogiltigförklara ``item``.

source: The solution, once you know the source of the problem, is easy: temporarily increment the reference count. The correct version of the function reads::
sv: Lösningen, när du väl känner till källan till problemet, är enkel: öka referensantalet tillfälligt. Den korrekta versionen av funktionen lyder::

source: void no_bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); Py_INCREF(item); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(item, stdout, 0); Py_DECREF(item); }
sv: ogiltigt no_bug(PyObject *lista) { PyObject *item = PyList_GetItem(list, 0); Py_INCREF(item); PyList_SetItem(lista, 1, PyLong_FromLong(0L)); PyObject_Print(objekt, stdout, 0); Py_DECREF(objekt); }

source: This is a true story. An older version of Python contained variants of this bug and someone spent a considerable amount of time in a C debugger to figure out why his :meth:`!__del__` methods would fail...
sv: Det här är en sann historia. En äldre version av Python innehöll varianter av denna bugg och någon tillbringade en avsevärd tid i en C-debugger för att räkna ut varför hans :meth:`!__del__`-metoder misslyckades...

source: The second case of problems with a borrowed reference is a variant involving threads. Normally, multiple threads in the Python interpreter can't get in each other's way, because there is a :term:`global lock <global interpreter lock>` protecting Python's entire object space. However, it is possible to temporarily release this lock using the macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, and to re-acquire it using :c:macro:`Py_END_ALLOW_THREADS`. This is common around blocking I/O calls, to let other threads use the processor while waiting for the I/O to complete. Obviously, the following function has the same problem as the previous one::
sv: Det andra fallet av problem med en lånad referens är en variant som involverar trådar. Normalt kan flera trådar i Python-tolken inte komma i vägen för varandra, eftersom det finns ett :term:`globalt lås <global interpreter lock>` som skyddar hela Pythons objektutrymme. Det är dock möjligt att tillfälligt frigöra detta lås med hjälp av makrot :c:macro:`Py_BEGIN_ALLOW_THREADS`, och att återta det med hjälp av :c:macro:`Py_END_ALLOW_THREADS`. Detta är vanligt vid blockerande I/O-anrop, för att låta andra trådar använda processorn medan de väntar på att I/O ska slutföras. Uppenbarligen har följande funktion samma problem som den föregående::

source: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); Py_BEGIN_ALLOW_THREADS ...some blocking I/O call... Py_END_ALLOW_THREADS PyObject_Print(item, stdout, 0); /* BUG! */ }
sv: void bug(PyObject *lista) { PyObject *item = PyList_GetItem(list, 0); Py_BEGIN_ALLOW_THREADS ...något blockerande I/O-anrop... Py_END_ALLOW_THREADS PyObject_Print(item, stdout, 0); /* BUG! */ }

source: NULL Pointers
sv: NULL-pekare

source: In general, functions that take object references as arguments do not expect you to pass them ``NULL`` pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return ``NULL`` only to indicate that an exception occurred. The reason for not testing for ``NULL`` arguments is that functions often pass the objects they receive on to other function --- if each function were to test for ``NULL``, there would be a lot of redundant tests and the code would run more slowly.
sv: I allmänhet förväntar sig inte funktioner som tar objektreferenser som argument att du ska skicka ``NULL``-pekare till dem, och de kommer att dumpa kärnan (eller orsaka senare dumpningar av kärnan) om du gör det. Funktioner som returnerar objektreferenser returnerar i allmänhet ``NULL`` endast för att indikera att ett undantag inträffat. Anledningen till att man inte testar för ``NULL``-argument är att funktioner ofta skickar de objekt de tar emot vidare till andra funktioner --- om varje funktion skulle testa för ``NULL`` skulle det finnas många överflödiga tester och koden skulle gå långsammare.

source: It is better to test for ``NULL`` only at the "source:" when a pointer that may be ``NULL`` is received, for example, from :c:func:`malloc` or from a function that may raise an exception.
sv: Det är bättre att testa för ``NULL`` endast vid "källan:" när en pekare som kan vara ``NULL`` tas emot, till exempel från :c:func:`malloc` eller från en funktion som kan ge upphov till ett undantag.

source: The macros :c:func:`Py_INCREF` and :c:func:`Py_DECREF` do not check for ``NULL`` pointers --- however, their variants :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` do.
sv: Makron :c:func:`Py_INCREF` och :c:func:`Py_DECREF` kontrollerar inte för ``NULL`` pekare --- men det gör däremot deras varianter :c:func:`Py_XINCREF` och :c:func:`Py_XDECREF`.

source: The macros for checking for a particular object type (``Pytype_Check()``) don't check for ``NULL`` pointers --- again, there is much code that calls several of these in a row to test an object against various different expected types, and this would generate redundant tests. There are no variants with ``NULL`` checking.
sv: Makron för att kontrollera en viss objekttyp (``Pytype_Check()``) kontrollerar inte för ``NULL`` pekare --- återigen, det finns mycket kod som anropar flera av dessa i rad för att testa ett objekt mot olika olika förväntade typer, och detta skulle generera överflödiga tester. Det finns inga varianter med ``NULL`` kontroll.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never ``NULL`` --- in fact it guarantees that it is always a tuple [#]_.
sv: C-funktionens anropsmekanism garanterar att den argumentlista som skickas till C-funktioner (``args`` i exemplen) aldrig är ``NULL`` --- i själva verket garanterar den att den alltid är en tupel [#]_.

source: It is a severe error to ever let a ``NULL`` pointer "escape" to the Python user.
sv: Det är ett allvarligt fel att någonsin låta en ``NULL``-pekare "fly" till Python-användaren.

source: Writing Extensions in C++
sv: Skriva tillägg i C++

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
sv: Det är möjligt att skriva tilläggsmoduler i C++. Vissa begränsningar gäller. Om huvudprogrammet (Python-tolken) kompileras och länkas av en C-kompilator kan globala eller statiska objekt med konstruktörer inte användas. Detta är inte ett problem om huvudprogrammet länkas av C++-kompilatorn. Funktioner som kommer att anropas av Python-tolken (i synnerhet modulinitialiseringsfunktioner) måste deklareras med hjälp av ``extern "C"``. Det är onödigt att bifoga Pythons headerfiler i ``extern "C" {...}`` --- de använder denna form redan om symbolen ``__cplusplus`` är definierad (alla nyare C++-kompilatorer definierar denna symbol).

source: Providing a C API for an Extension Module
sv: Tillhandahålla ett C API för en tilläggsmodul

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
sv: Många tilläggsmoduler tillhandahåller bara nya funktioner och typer som kan användas från Python, men ibland kan koden i en tilläggsmodul vara användbar för andra tilläggsmoduler. Till exempel kan en tilläggsmodul implementera en typ "collection" som fungerar som listor utan ordning. Precis som Pythons standardtyp list har ett C-API som tillåter tilläggsmoduler att skapa och manipulera listor, bör denna nya samlingstyp ha en uppsättning C-funktioner för direkt manipulation från andra tilläggsmoduler.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
sv: Vid första anblicken verkar detta enkelt: skriv bara funktionerna (naturligtvis utan att deklarera dem som "statiska"), tillhandahåll en lämplig header-fil och dokumentera C API. Och det skulle faktiskt fungera om alla tilläggsmoduler alltid länkades statiskt med Python-tolken. När moduler används som delade bibliotek kan det dock hända att de symboler som definieras i en modul inte är synliga för en annan modul. Detaljerna kring synlighet beror på operativsystemet; vissa system använder ett globalt namnområde för Python-tolken och alla tilläggsmoduler (Windows, till exempel), medan andra kräver en explicit lista över importerade symboler vid modullänkning (AIX är ett exempel), eller erbjuder ett urval av olika strategier (de flesta Unices). Och även om symbolerna är globalt synliga är det inte säkert att den modul vars funktioner man vill anropa har laddats in än!
