Repository: yeager/python-docs-sv
Catalog: extending/index.po
Languages: sv

source: Extending and Embedding the Python Interpreter
sv: Utöka och bädda in Pythons tolkprogram

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
sv: Detta dokument beskriver hur man skriver moduler i C eller C++ för att utöka Python-tolken med nya moduler. Dessa moduler kan inte bara definiera nya funktioner utan även nya objekttyper och deras metoder. Dokumentet beskriver också hur man bäddar in Python-tolken i en annan applikation, för användning som ett tilläggsspråk. Slutligen visas hur man kompilerar och länkar tilläggsmoduler så att de kan laddas dynamiskt (vid körning) i tolken, om det underliggande operativsystemet stöder denna funktion.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
sv: Detta dokument förutsätter grundläggande kunskaper om Python. För en informell introduktion till språket, se :ref:`tutorial-index`. :ref:`reference-index` ger en mer formell definition av språket. :ref:`library-index` dokumenterar de befintliga objekttyper, funktioner och moduler (både inbyggda och skrivna i Python) som ger språket dess breda användningsområde.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
sv: För en detaljerad beskrivning av hela Python/C API, se den separata :ref:`c-api-index`.

source: Recommended third party tools
sv: Rekommenderade verktyg från tredje part

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Some :ref:`third party tools <c-api-tools>` offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
sv: Denna guide täcker endast de grundläggande verktygen för att skapa tillägg som tillhandahålls som en del av denna version av CPython. Vissa :ref:`verktyg från tredje part <c-api-tools>` erbjuder både enklare och mer sofistikerade metoder för att skapa C- och C++-tillägg för Python.

source: Creating extensions without third party tools
sv: Skapa tillägg utan verktyg från tredje part

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
sv: Det här avsnittet i handboken handlar om att skapa C- och C++-tillägg utan hjälp av verktyg från tredje part. Det är främst avsett för skapare av dessa verktyg, snarare än att vara ett rekommenderat sätt att skapa dina egna C-tillägg.

source: :pep:`489` -- Multi-phase extension module initialization
sv: :pep:`489` -- Initialisering av flerfasig tilläggsmodul

source: Embedding the CPython runtime in a larger application
sv: Inbäddning av CPython-körtiden i en större applikation

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
sv: Ibland är det önskvärt att istället för att skapa ett tillägg som körs i Python-tolken som huvudapplikationen, istället bädda in CPython-körtiden i en större applikation. I detta avsnitt beskrivs några av de detaljer som krävs för att göra det på ett framgångsrikt sätt.
