Repository: yeager/python-docs-sv
Catalog: extending/newtypes.po
Languages: sv

source: If :c:member:`~PyTypeObject.tp_methods` is not ``NULL``, it must refer to an array of :c:type:`PyMethodDef` structures. Each entry in the table is an instance of this structure::
sv: Om :c:member:`~PyTypeObject.tp_methods` inte är ``NULL``, måste den referera till en array av :c:type:`PyMethodDef`-strukturer. Varje post i tabellen är en instans av denna struktur::

source: typedef struct PyMethodDef { const char *ml_name; /* method name */ PyCFunction ml_meth; /* implementation function */ int ml_flags; /* flags */ const char *ml_doc; /* docstring */ } PyMethodDef;
sv: typedef struct PyMethodDef { const char *ml_name; /* metodens namn */ PyCFunction ml_meth; /* implementeringsfunktion */ int ml_flags; /* flaggor */ const char *ml_doc; /* dokumentsträng */ } PyMethodDef;

source: One entry should be defined for each method provided by the type; no entries are needed for methods inherited from a base type. One additional entry is needed at the end; it is a sentinel that marks the end of the array. The :c:member:`~PyMethodDef.ml_name` field of the sentinel must be ``NULL``.
sv: En post ska definieras för varje metod som tillhandahålls av typen; inga poster behövs för metoder som ärvs från en bastyp. Ytterligare en post behövs i slutet; det är en sentinel som markerar slutet på arrayen. Fältet :c:member:`~PyMethodDef.ml_name` i sentineln måste vara ``NULL``.

source: The second table is used to define attributes which map directly to data stored in the instance. A variety of primitive C types are supported, and access may be read-only or read-write. The structures in the table are defined as::
sv: Den andra tabellen används för att definiera attribut som är direkt kopplade till data som lagras i instansen. En mängd olika primitiva C-typer stöds och åtkomsten kan vara skrivskyddad eller skrivskyddad. Strukturerna i tabellen definieras enligt följande::

source: typedef struct PyMemberDef { const char *name; int type; int offset; int flags; const char *doc; } PyMemberDef;
sv: typedef struct PyMemberDef { const char *namn; int typ; int offset; int flaggor; const char *doc; } PyMemberDef;

source: For each entry in the table, a :term:`descriptor` will be constructed and added to the type which will be able to extract a value from the instance structure. The :c:member:`~PyMemberDef.type` field should contain a type code like :c:macro:`Py_T_INT` or :c:macro:`Py_T_DOUBLE`; the value will be used to determine how to convert Python values to and from C values. The :c:member:`~PyMemberDef.flags` field is used to store flags which control how the attribute can be accessed: you can set it to :c:macro:`Py_READONLY` to prevent Python code from setting it.
sv: För varje post i tabellen kommer en :term:`descriptor` att konstrueras och läggas till typen som kommer att kunna extrahera ett värde från instansstrukturen. Fältet :c:member:`~PyMemberDef.type` bör innehålla en typkod som :c:macro:`Py_T_INT` eller :c:macro:`Py_T_DOUBLE`; värdet kommer att användas för att bestämma hur Python-värden skall konverteras till och från C-värden. Fältet :c:member:`~PyMemberDef.flags` används för att lagra flaggor som styr hur attributet kan nås: du kan sätta det till :c:macro:`Py_READONLY` för att förhindra Python-kod från att sätta det.

source: An interesting advantage of using the :c:member:`~PyTypeObject.tp_members` table to build descriptors that are used at runtime is that any attribute defined this way can have an associated doc string simply by providing the text in the table. An application can use the introspection API to retrieve the descriptor from the class object, and get the doc string using its :attr:`~type.__doc__` attribute.
sv: En intressant fördel med att använda tabellen :c:member:`~PyTypeObject.tp_members` för att skapa beskrivningar som används vid körning är att alla attribut som definieras på det här sättet kan ha en associerad doc-sträng genom att helt enkelt tillhandahålla texten i tabellen. Ett program kan använda introspektions-API:et för att hämta deskriptorn från klassobjektet och hämta dokumentsträngen med hjälp av attributet :attr:`~type.__doc__`.

source: As with the :c:member:`~PyTypeObject.tp_methods` table, a sentinel entry with a :c:member:`~PyMethodDef.ml_name` value of ``NULL`` is required.
sv: Precis som i tabellen :c:member:`~PyTypeObject.tp_methods` krävs en sentinel-post med värdet ``NULL`` i :c:member:`~PyMethodDef.ml_name`.

source: Type-specific Attribute Management
sv: Typspecifik attributhantering

source: For simplicity, only the :c:expr:`char\*` version will be demonstrated here; the type of the name parameter is the only difference between the :c:expr:`char\*` and :c:expr:`PyObject*` flavors of the interface. This example effectively does the same thing as the generic example above, but does not use the generic support added in Python 2.2. It explains how the handler functions are called, so that if you do need to extend their functionality, you'll understand what needs to be done.
sv: För enkelhetens skull kommer endast :c:expr:`char\*`-versionen att demonstreras här; typen av namnparametern är den enda skillnaden mellan :c:expr:`char\*`- och :c:expr:`PyObject*`-versionerna av gränssnittet. Det här exemplet gör i princip samma sak som det generiska exemplet ovan, men använder inte det generiska stöd som tillkom i Python 2.2. Det förklarar hur hanterarfunktionerna anropas, så att du förstår vad som behöver göras om du behöver utöka deras funktionalitet.

source: The :c:member:`~PyTypeObject.tp_getattr` handler is called when the object requires an attribute look-up. It is called in the same situations where the :meth:`~object.__getattr__` method of a class would be called.
sv: Hanteraren :c:member:`~PyTypeObject.tp_getattr` anropas när objektet kräver en attributuppslagning. Den anropas i samma situationer som :meth:`~object.__getattr__`-metoden för en klass skulle anropas.

source: Here is an example::
sv: Här är ett exempel::

source: static PyObject * newdatatype_getattr(PyObject *op, char *name) { newdatatypeobject *self = (newdatatypeobject *) op; if (strcmp(name, "data") == 0) { return PyLong_FromLong(self->data); } PyErr_Format(PyExc_AttributeError, "'%.100s' object has no attribute '%.400s'", Py_TYPE(self)->tp_name, name); return NULL; }
sv: statiskt PyObject * newdatatype_getattr(PyObject *op, char *namn) { newdatatypeobject *self = (newdatatypeobject *) op; if (strcmp(namn, "data") == 0) { return PyLong_FromLong(self->data); } PyErr_Format(PyExc_AttributeError, "'%.100s' objekt har inget attribut '%.400s'", Py_TYPE(self)->tp_name, namn); returnera NULL; }

source: The :c:member:`~PyTypeObject.tp_setattr` handler is called when the :meth:`~object.__setattr__` or :meth:`~object.__delattr__` method of a class instance would be called. When an attribute should be deleted, the third parameter will be ``NULL``. Here is an example that simply raises an exception; if this were really all you wanted, the :c:member:`~PyTypeObject.tp_setattr` handler should be set to ``NULL``. ::
sv: Hanteraren :c:member:`~PyTypeObject.tp_setattr` anropas när metoden :meth:`~object.__setattr__` eller :meth:`~object.__delattr__` för en klassinstans skulle anropas. När ett attribut skall tas bort kommer den tredje parametern att vara ``NULL``. Här är ett exempel som helt enkelt ger upphov till ett undantag; om detta verkligen var allt du ville ha, skulle handläggaren :c:member:`~PyTypeObject.tp_setattr` sättas till ``NULL``. ::

source: static int newdatatype_setattr(PyObject *op, char *name, PyObject *v) { PyErr_Format(PyExc_RuntimeError, "Read-only attribute: %s", name); return -1; }
sv: statisk int newdatatype_setattr(PyObject *op, char *name, PyObject *v) { PyErr_Format(PyExc_RuntimeError, "Skrivskyddat attribut: %s", namn); return -1; }

source: Object Comparison
sv: Jämförelse av objekt

source: The :c:member:`~PyTypeObject.tp_richcompare` handler is called when comparisons are needed. It is analogous to the :ref:`rich comparison methods <richcmpfuncs>`, like :meth:`!__lt__`, and also called by :c:func:`PyObject_RichCompare` and :c:func:`PyObject_RichCompareBool`.
sv: Hanteraren :c:member:`~PyTypeObject.tp_richcompare` anropas när jämförelser behövs. Den är analog med :ref:`rich comparison methods <richcmpfuncs>`, som :meth:`!__lt__`, och anropas även av :c:func:`PyObject_RichCompare` och :c:func:`PyObject_RichCompareBool`.

source: This function is called with two Python objects and the operator as arguments, where the operator is one of ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` or ``Py_GT``. It should compare the two objects with respect to the specified operator and return ``Py_True`` or ``Py_False`` if the comparison is successful, ``Py_NotImplemented`` to indicate that comparison is not implemented and the other object's comparison method should be tried, or ``NULL`` if an exception was set.
sv: Denna funktion anropas med två Python-objekt och operatorn som argument, där operatorn är en av ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` eller ``Py_GT``. Den bör jämföra de två objekten med avseende på den angivna operatorn och returnera ``Py_True`` eller ``Py_False`` om jämförelsen lyckas, ``Py_NotImplemented`` för att indikera att jämförelsen inte är implementerad och att det andra objektets jämförelsemetod bör prövas, eller ``NULL`` om ett undantag har angetts.

source: Here is a sample implementation, for a datatype that is considered equal if the size of an internal pointer is equal::
sv: Här är ett exempel på implementering, för en datatyp som anses vara lika om storleken på en intern pekare är lika::

source: static PyObject * newdatatype_richcmp(PyObject *lhs, PyObject *rhs, int op) { newdatatypeobject *obj1 = (newdatatypeobject *) lhs; newdatatypeobject *obj2 = (newdatatypeobject *) rhs; PyObject *result; int c, size1, size2; /* code to make sure that both arguments are of type newdatatype omitted */ size1 = obj1->obj_UnderlyingDatatypePtr->size; size2 = obj2->obj_UnderlyingDatatypePtr->size; switch (op) { case Py_LT: c = size1 < size2; break; case Py_LE: c = size1 <= size2; break; case Py_EQ: c = size1 == size2; break; case Py_NE: c = size1 != size2; break; case Py_GT: c = size1 > size2; break; case Py_GE: c = size1 >= size2; break; } result = c ? Py_True : Py_False; return Py_NewRef(result); }
sv: statiskt PyObject * newdatatype_richcmp(PyObject *lhs, PyObject *rhs, int op) { newdatatypeobject *obj1 = (newdatatypeobject *) lhs; newdatatypeobject *obj2 = (newdatatypeobject *) rhs; PyObject *resultat; int c, storlek1, storlek2; /* kod för att se till att båda argumenten är av typen nydatatyp utelämnad */ size1 = obj1->obj_UnderliggandeDatatypPtr->size; size2 = obj2->obj_UnderlyingDatatypePtr->size; switch (op) { fall Py_LT: c = storlek1 < storlek2; bryt; fall Py_LE: c = storlek1 <= storlek2; bryt; fall Py_EQ: c = storlek1 == storlek2; bryt; fall Py_NE: c = storlek1 != storlek2; bryt; fall Py_GT: c = storlek1 > storlek2; bryt; fall Py_GE: c = storlek1 >= storlek2; bryt; } resultat = c ? Py_True : Py_False; return Py_NewRef(resultat); }

source: Abstract Protocol Support
sv: Stöd för abstrakta protokoll

source: Python supports a variety of *abstract* 'protocols;' the specific interfaces provided to use these interfaces are documented in :ref:`abstract`.
sv: Python stöder en mängd olika *abstrakta* "protokoll"; de specifika gränssnitt som tillhandahålls för att använda dessa gränssnitt dokumenteras i :ref:`abstract`.

source: A number of these abstract interfaces were defined early in the development of the Python implementation. In particular, the number, mapping, and sequence protocols have been part of Python since the beginning. Other protocols have been added over time. For protocols which depend on several handler routines from the type implementation, the older protocols have been defined as optional blocks of handlers referenced by the type object. For newer protocols there are additional slots in the main type object, with a flag bit being set to indicate that the slots are present and should be checked by the interpreter. (The flag bit does not indicate that the slot values are non-``NULL``. The flag may be set to indicate the presence of a slot, but a slot may still be unfilled.) ::
sv: Ett antal av dessa abstrakta gränssnitt definierades tidigt i utvecklingen av Python-implementeringen. I synnerhet har nummer-, mappnings- och sekvensprotokollen varit en del av Python sedan början. Andra protokoll har lagts till över tiden. För protokoll som är beroende av flera hanterarrutiner från typimplementationen har de äldre protokollen definierats som valfria block av hanterare som refereras av typobjektet. För nyare protokoll finns det ytterligare slots i huvudtypobjektet, med en flaggbit som sätts för att indikera att slots finns och bör kontrolleras av tolken. (Flaggbiten anger inte att slotvärdena är icke-``NULL``. Flaggan kan vara satt för att ange att en slot finns, men en slot kan fortfarande vara ofylld) ::

source: If you wish your object to be able to act like a number, a sequence, or a mapping object, then you place the address of a structure that implements the C type :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, or :c:type:`PyMappingMethods`, respectively. It is up to you to fill in this structure with appropriate values. You can find examples of the use of each of these in the :file:`Objects` directory of the Python source distribution. ::
sv: Om du vill att ditt objekt ska kunna fungera som ett nummer, en sekvens eller ett mappningsobjekt, så placerar du adressen till en struktur som implementerar C-typen :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, eller :c:type:`PyMappingMethods`, respektive. Det är upp till dig att fylla i denna struktur med lämpliga värden. Du kan hitta exempel på användningen av var och en av dessa i :file:`Objects`-katalogen i Python-källdistributionen. ::

source: This function, if you choose to provide it, should return a hash number for an instance of your data type. Here is a simple example::
sv: Denna funktion, om du väljer att tillhandahålla den, ska returnera ett hashnummer för en instans av din datatyp. Här är ett enkelt exempel::

source: static Py_hash_t newdatatype_hash(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; Py_hash_t result; result = self->some_size + 32767 * self->some_number; if (result == -1) { result = -2; } return result; }
sv: statisk Py_hash_t newdatatype_hash(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; Py_hash_t resultat; resultat = self->some_size + 32767 * self->some_number; if (resultat == -1) { resultat = -2; } return result; }

source: :c:type:`Py_hash_t` is a signed integer type with a platform-varying width. Returning ``-1`` from :c:member:`~PyTypeObject.tp_hash` indicates an error, which is why you should be careful to avoid returning it when hash computation is successful, as seen above.
sv: :c:type:`Py_hash_t` är en signerad heltalstyp med plattformsvarierande bredd. Att returnera ``-1`` från :c:member:`~PyTypeObject.tp_hash` indikerar ett fel, vilket är anledningen till att du bör vara noga med att undvika att returnera det när hashberäkningen lyckas, som ovan.

source: This function is called when an instance of your data type is "called", for example, if ``obj1`` is an instance of your data type and the Python script contains ``obj1('hello')``, the :c:member:`~PyTypeObject.tp_call` handler is invoked.
sv: Denna funktion anropas när en instans av din datatyp "anropas", t.ex. om ``obj1`` är en instans av din datatyp och Python-skriptet innehåller ``obj1('hello')``, anropas hanteraren :c:member:`~PyTypeObject.tp_call`.

source: This function takes three arguments:
sv: Denna funktion tar tre argument:

source: *self* is the instance of the data type which is the subject of the call. If the call is ``obj1('hello')``, then *self* is ``obj1``.
sv: *self* är instansen av den datatyp som är föremål för anropet. Om anropet är ``obj1('hello')``, så är *self* ``obj1``.

source: *args* is a tuple containing the arguments to the call. You can use :c:func:`PyArg_ParseTuple` to extract the arguments.
sv: *args* är en tupel som innehåller argumenten till anropet. Du kan använda :c:func:`PyArg_ParseTuple` för att extrahera argumenten.

source: *kwds* is a dictionary of keyword arguments that were passed. If this is non-``NULL`` and you support keyword arguments, use :c:func:`PyArg_ParseTupleAndKeywords` to extract the arguments. If you do not want to support keyword arguments and this is non-``NULL``, raise a :exc:`TypeError` with a message saying that keyword arguments are not supported.
sv: *kwds* är en ordbok med nyckelordsargument som skickades. Om detta är icke-``NULL`` och du stöder nyckelordsargument, använd :c:func:`PyArg_ParseTupleAndKeywords` för att extrahera argumenten. Om du inte vill stödja nyckelordsargument och detta är icke-``NULL``, skapa ett :exc:`TypeError` med ett meddelande som säger att nyckelordsargument inte stöds.

source: Here is a toy ``tp_call`` implementation::
sv: Här är en leksaksimplementation av ``tp_call``::

source: static PyObject * newdatatype_call(PyObject *op, PyObject *args, PyObject *kwds) { newdatatypeobject *self = (newdatatypeobject *) op; PyObject *result; const char *arg1; const char *arg2; const char *arg3; if (!PyArg_ParseTuple(args, "sss:call", &arg1, &arg2, &arg3)) { return NULL; } result = PyUnicode_FromFormat( "Returning -- value: [%d] arg1: [%s] arg2: [%s] arg3: [%s]\n", self->obj_UnderlyingDatatypePtr->size, arg1, arg2, arg3); return result; }
sv: statiskt PyObject * newdatatype_call(PyObject *op, PyObject *args, PyObject *kwds) { newdatatypeobject *self = (newdatatypeobject *) op; PyObject *resultat; const char *arg1; const char *arg2; const char *arg3; if (!PyArg_ParseTuple(args, "sss:call", &arg1, &arg2, &arg3)) { returneras NULL; } result = PyUnicode_FromFormat( "Återlämnar -- värde: [%d] arg1: [%s] arg2: [%s] arg3: [%s]\n", self->obj_UnderliggandeDatatypPtr->storlek, arg1, arg2, arg3); returnera resultatet; }

source: /* Iterators */ getiterfunc tp_iter; iternextfunc tp_iternext;
sv: /* Iteratorer */ getiterfunc tp_iter; iternextfunc tp_iternext;

source: These functions provide support for the iterator protocol. Both handlers take exactly one parameter, the instance for which they are being called, and return a new reference. In the case of an error, they should set an exception and return ``NULL``. :c:member:`~PyTypeObject.tp_iter` corresponds to the Python :meth:`~object.__iter__` method, while :c:member:`~PyTypeObject.tp_iternext` corresponds to the Python :meth:`~iterator.__next__` method.
sv: Dessa funktioner ger stöd för iteratorprotokollet. Båda hanterarna tar exakt en parameter, den instans som de anropas för, och returnerar en ny referens. I händelse av ett fel bör de ange ett undantag och returnera ``NULL``. :c:member:`~PyTypeObject.tp_iter` motsvarar Pythons :meth:`~object.__iter__`-metod, medan :c:member:`~PyTypeObject.tp_iternext` motsvarar Pythons :meth:`~iterator.__next__`-metod.

source: Any :term:`iterable` object must implement the :c:member:`~PyTypeObject.tp_iter` handler, which must return an :term:`iterator` object. Here the same guidelines apply as for Python classes:
sv: Alla :term:`iterable`-objekt måste implementera :c:member:`~PyTypeObject.tp_iter`-hanteraren, som måste returnera ett :term:`iterator`-objekt. Här gäller samma riktlinjer som för Python-klasser:

source: For collections (such as lists and tuples) which can support multiple independent iterators, a new iterator should be created and returned by each call to :c:member:`~PyTypeObject.tp_iter`.
sv: För samlingar (t.ex. listor och tupler) som kan stödja flera oberoende iteratorer bör en ny iterator skapas och returneras vid varje anrop till :c:member:`~PyTypeObject.tp_iter`.

source: Objects which can only be iterated over once (usually due to side effects of iteration, such as file objects) can implement :c:member:`~PyTypeObject.tp_iter` by returning a new reference to themselves -- and should also therefore implement the :c:member:`~PyTypeObject.tp_iternext` handler.
sv: Objekt som bara kan itereras över en gång (vanligtvis på grund av bieffekter av iteration, t.ex. filobjekt) kan implementera :c:member:`~PyTypeObject.tp_iter` genom att returnera en ny referens till sig själva -- och bör därför också implementera :c:member:`~PyTypeObject.tp_iternext`-hanteraren.

source: Any :term:`iterator` object should implement both :c:member:`~PyTypeObject.tp_iter` and :c:member:`~PyTypeObject.tp_iternext`. An iterator's :c:member:`~PyTypeObject.tp_iter` handler should return a new reference to the iterator. Its :c:member:`~PyTypeObject.tp_iternext` handler should return a new reference to the next object in the iteration, if there is one. If the iteration has reached the end, :c:member:`~PyTypeObject.tp_iternext` may return ``NULL`` without setting an exception, or it may set :exc:`StopIteration` *in addition* to returning ``NULL``; avoiding the exception can yield slightly better performance. If an actual error occurs, :c:member:`~PyTypeObject.tp_iternext` should always set an exception and return ``NULL``.
sv: Varje :term:`iterator`-objekt bör implementera både :c:member:`~PyTypeObject.tp_iter` och :c:member:`~PyTypeObject.tp_iternext`. En iterators :c:member:`~PyTypeObject.tp_iter`-hanterare bör returnera en ny referens till iteratorn. Dess :c:member:`~PyTypeObject.tp_iternext`-hanterare bör returnera en ny referens till nästa objekt i iterationen, om det finns ett sådant. Om iterationen har nått slutet kan :c:member:`~PyTypeObject.tp_iternext` returnera ``NULL`` utan att ställa in ett undantag, eller så kan den ställa in :exc:`StopIteration` *i tillägg* till att returnera ``NULL``; att undvika undantaget kan ge något bättre prestanda. Om ett faktiskt fel inträffar bör :c:member:`~PyTypeObject.tp_iternext` alltid sätta ett undantag och returnera ``NULL``.

source: Weak Reference Support
sv: Svagt referensstöd

source: One of the goals of Python's weak reference implementation is to allow any type to participate in the weak reference mechanism without incurring the overhead on performance-critical objects (such as numbers).
sv: Ett av målen med Pythons implementering av svaga referenser är att låta alla typer delta i mekanismen för svaga referenser utan att det uppstår overhead på prestandakritiska objekt (t.ex. tal).

source: Documentation for the :mod:`weakref` module.
sv: Dokumentation för modulen :mod:`weakref`.

source: For an object to be weakly referenceable, the extension type must set the ``Py_TPFLAGS_MANAGED_WEAKREF`` bit of the :c:member:`~PyTypeObject.tp_flags` field. The legacy :c:member:`~PyTypeObject.tp_weaklistoffset` field should be left as zero.
sv: För att ett objekt ska vara svagt refererbart måste tilläggstypen sätta ``Py_TPFLAGS_MANAGED_WEAKREF`` bit i fältet :c:member:`~PyTypeObject.tp_flags`. Det äldre fältet :c:member:`~PyTypeObject.tp_weaklistoffset` bör lämnas som noll.

source: Concretely, here is how the statically declared type object would look::
sv: Konkret ser det statiskt deklarerade typobjektet ut på följande sätt::

source: static PyTypeObject TrivialType = { PyVarObject_HEAD_INIT(NULL, 0) /* ... other members omitted for brevity ... */ .tp_flags = Py_TPFLAGS_MANAGED_WEAKREF | ..., };
sv: static PyTypeObject TrivialType = { PyVarObject_HEAD_INIT(NULL, 0) /* ... andra medlemmar utelämnade för korthetens skull ... */ .tp_flags = Py_TPFLAGS_MANAGED_WEAKREF | ..., };

source: The only further addition is that ``tp_dealloc`` needs to clear any weak references (by calling :c:func:`PyObject_ClearWeakRefs`)::
sv: Det enda ytterligare tillägget är att ``tp_dealloc`` måste rensa alla svaga referenser (genom att anropa :c:func:`PyObject_ClearWeakRefs`)::
