Repository: yeager/python-docs-sv
Catalog: extending/newtypes.po
Languages: sv

source: Defining Extension Types: Assorted Topics
sv: Definiera utökningstyper: Blandade ämnen

source: This section aims to give a quick fly-by on the various type methods you can implement and what they do.
sv: Detta avsnitt syftar till att ge en snabb genomgång av de olika typmetoder som du kan implementera och vad de gör.

source: Here is the definition of :c:type:`PyTypeObject`, with some fields only used in :ref:`debug builds <debug-build>` omitted:
sv: Här är definitionen av :c:type:`PyTypeObject`, med vissa fält som endast används i :ref:`debug builds <debug-build>` utelämnade:

source: typedef struct _typeobject { PyObject_VAR_HEAD const char *tp_name; /* For printing, in format "<module>.<name>" */ Py_ssize_t tp_basicsize, tp_itemsize; /* For allocation */ /* Methods to implement standard operations */ destructor tp_dealloc; Py_ssize_t tp_vectorcall_offset; getattrfunc tp_getattr; setattrfunc tp_setattr; PyAsyncMethods *tp_as_async; /* formerly known as tp_compare (Python 2) or tp_reserved (Python 3) */ reprfunc tp_repr; /* Method suites for standard classes */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* More standard operations (here for binary compatibility) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Functions to access object as input/output buffer */ PyBufferProcs *tp_as_buffer; /* Flags to define presence of optional/expanded features */ unsigned long tp_flags; const char *tp_doc; /* Documentation string */ /* Assigned meaning in release 2.0 */ /* call function for all accessible objects */ traverseproc tp_traverse; /* delete references to contained objects */ inquiry tp_clear; /* Assigned meaning in release 2.1 */ /* rich comparisons */ richcmpfunc tp_richcompare; /* weak reference enabler */ Py_ssize_t tp_weaklistoffset; /* Iterators */ getiterfunc tp_iter; iternextfunc tp_iternext; /* Attribute descriptor and subclassing stuff */ PyMethodDef *tp_methods; PyMemberDef *tp_members; PyGetSetDef *tp_getset; // Strong reference on a heap type, borrowed reference on a static type PyTypeObject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; Py_ssize_t tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Low-level free-memory routine */ inquiry tp_is_gc; /* For PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* method resolution order */ PyObject *tp_cache; /* no longer used */ void *tp_subclasses; /* for static builtin types this is an index */ PyObject *tp_weaklist; /* not used for static builtin types */ destructor tp_del; /* Type attribute cache version tag. Added in version 2.6. * If zero, the cache is invalid and must be initialized. */ unsigned int tp_version_tag; destructor tp_finalize; vectorcallfunc tp_vectorcall; /* bitset of which type-watchers care about this type */ unsigned char tp_watched; /* Number of tp_version_tag values used. * Set to _Py_ATTR_CACHE_UNUSED if the attribute cache is * disabled for this type (e.g. due to custom MRO entries). * Otherwise, limited to MAX_VERSIONS_PER_CLASS (defined elsewhere). */ uint16_t tp_versions_used; } PyTypeObject;
sv: typedef struct _typeobject { PyObject_VAR_HEAD const char *tp_name; /* För utskrift, i formatet "<module>.<name>" */ Py_ssize_t tp_basicsize, tp_itemsize; /* För allokering */ /* Metoder för att implementera standardoperationer */ destruktor tp_dealloc; Py_ssize_t tp_vectorcall_offset; getattrfunc tp_getattr; setattrfunc tp_setattr; PyAsyncMethods *tp_as_async; /* tidigare känd som tp_compare (Python 2) eller tp_reserved (Python 3) */ reprfunc tp_repr; /* Metodsviter för standardklasser */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* Fler standardoperationer (här för binär kompatibilitet) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Funktioner för att komma åt objekt som inmatnings-/utmatningsbuffert */ PyBufferProcs *tp_as_buffer; /* Flaggor för att definiera förekomst av valfria/utökade funktioner */ osignerad lång tp_flags; const char *tp_doc; /* Dokumentationssträng */ /* Tilldelad betydelse i version 2.0 */ /* anropsfunktion för alla tillgängliga objekt */ traverseproc tp_traverse; /* radera referenser till inneslutna objekt */ förfrågan tp_clear; /* Tilldelad betydelse i version 2.1 */ /* rika jämförelser */ richcmpfunc tp_richcompare; /* Möjliggör svag referens */ Py_ssize_t tp_weaklistoffset; /* Iteratorer */ getiterfunc tp_iter; iternextfunc tp_iternext; /* Attributbeskrivare och underklassningsgrejer */ PyMethodDef *tp_methods; PyMemberDef *tp_members; PyGetSetDef *tp_getset; // Stark referens på en heap-typ, lånad referens på en statisk typ PyTypeObject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; Py_ssize_t tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Rutin för fritt minne på låg nivå */ inquiry tp_is_gc; /* För PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* metodupplösningsordning */ PyObject *tp_cache; /* används inte längre */ void *tp_subclasses; /* för statiska inbyggda typer är detta ett index */ PyObject *tp_weaklist; /* används inte för statiska inbyggda typer */ destruktor tp_del; /* Typattribut för cacheversionstagg. Tillagd i version 2.6. * Om noll är cacheminnet ogiltigt och måste initialiseras. */ unsigned int tp_version_tag; destruktor tp_finalize; vektorcallfunc tp_vectorcall; /* bituppsättning av vilka typövervakare som bryr sig om denna typ */ osignerad char tp_watched; /* Antal använda tp_version_tag-värden. * Sätts till _Py_ATTR_CACHE_UNUSED om attributcachen är * inaktiverad för den här typen (t.ex. på grund av anpassade MRO-poster). * Annars begränsat till MAX_VERSIONS_PER_CLASS (definieras på annan plats). */ uint16_t tp_versions_used; } PyTypeObject;

source: Now that's a *lot* of methods. Don't worry too much though -- if you have a type you want to define, the chances are very good that you will only implement a handful of these.
sv: Nu är det en *mängd* metoder. Oroa dig dock inte för mycket - om du har en typ som du vill definiera är chansen mycket stor att du bara kommer att implementera en handfull av dessa.

source: As you probably expect by now, we're going to go over this and give more information about the various handlers. We won't go in the order they are defined in the structure, because there is a lot of historical baggage that impacts the ordering of the fields. It's often easiest to find an example that includes the fields you need and then change the values to suit your new type. ::
sv: Som du förmodligen förväntar dig vid det här laget kommer vi att gå igenom detta och ge mer information om de olika hanterarna. Vi kommer inte att gå igenom dem i den ordning de definieras i strukturen, eftersom det finns en hel del historiskt bagage som påverkar ordningen på fälten. Det är ofta enklast att hitta ett exempel som innehåller de fält du behöver och sedan ändra värdena så att de passar din nya typ:

source: const char *tp_name; /* For printing */
sv: const char *tp_name; /* För utskrift */

source: The name of the type -- as mentioned in the previous chapter, this will appear in various places, almost entirely for diagnostic purposes. Try to choose something that will be helpful in such a situation! ::
sv: Typens namn - som nämndes i föregående kapitel kommer detta att visas på olika ställen, nästan uteslutande för diagnostiska ändamål. Försök att välja något som kan vara till hjälp i en sådan situation! ::

source: Py_ssize_t tp_basicsize, tp_itemsize; /* For allocation */
sv: Py_ssize_t tp_basicsize, tp_itemsize; /* För allokering */

source: These fields tell the runtime how much memory to allocate when new objects of this type are created. Python has some built-in support for variable length structures (think: strings, tuples) which is where the :c:member:`~PyTypeObject.tp_itemsize` field comes in. This will be dealt with later. ::
sv: Dessa fält talar om för runtime hur mycket minne som ska allokeras när nya objekt av den här typen skapas. Python har en del inbyggt stöd för strukturer med variabel längd (tänk: strängar, tupler) och det är här fältet :c:member:`~PyTypeObject.tp_itemsize` kommer in i bilden. Detta kommer att behandlas senare. ::

source: Here you can put a string (or its address) that you want returned when the Python script references ``obj.__doc__`` to retrieve the doc string.
sv: Här kan du lägga in en sträng (eller dess adress) som du vill ska returneras när Python-skriptet refererar till ``obj.__doc__`` för att hämta doc-strängen.

source: Now we come to the basic type methods -- the ones most extension types will implement.
sv: Nu kommer vi till de grundläggande typmetoderna - de som de flesta extensionstyper kommer att implementera.

source: Finalization and De-allocation
sv: Slutförande och avyttring

source: destructor tp_dealloc;
sv: destruktor tp_dealloc;

source: This function is called when the reference count of the instance of your type is reduced to zero and the Python interpreter wants to reclaim it. If your type has memory to free or other clean-up to perform, you can put it here. The object itself needs to be freed here as well. Here is an example of this function::
sv: Denna funktion anropas när referensantalet för instansen av din typ har reducerats till noll och Python-tolken vill återta den. Om din typ har minne att frigöra eller annan upprensning att utföra, kan du lägga det här. Själva objektet måste också frigöras här. Här är ett exempel på denna funktion::

source: static void newdatatype_dealloc(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; free(self->obj_UnderlyingDatatypePtr); Py_TYPE(self)->tp_free(self); }
sv: statiskt void newdatatype_dealloc(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; free(self->obj_UnderlyingDatatypePtr); Py_TYPE(self)->tp_free(self); }

source: If your type supports garbage collection, the destructor should call :c:func:`PyObject_GC_UnTrack` before clearing any member fields::
sv: Om din typ stöder sopsortering bör destruktorn anropa :c:func:`PyObject_GC_UnTrack` innan den rensar alla medlemsfält::

source: static void newdatatype_dealloc(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; PyObject_GC_UnTrack(op); Py_CLEAR(self->other_obj); ... Py_TYPE(self)->tp_free(self); }
sv: statiskt void newdatatype_dealloc(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; PyObject_GC_UnTrack(op); Py_CLEAR(self->other_obj); ... Py_TYPE(self)->tp_free(self); }

source: One important requirement of the deallocator function is that it leaves any pending exceptions alone. This is important since deallocators are frequently called as the interpreter unwinds the Python stack; when the stack is unwound due to an exception (rather than normal returns), nothing is done to protect the deallocators from seeing that an exception has already been set. Any actions which a deallocator performs which may cause additional Python code to be executed may detect that an exception has been set. This can lead to misleading errors from the interpreter. The proper way to protect against this is to save a pending exception before performing the unsafe action, and restoring it when done. This can be done using the :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore` functions::
sv: Ett viktigt krav på deallocator-funktionen är att den lämnar alla väntande undantag i fred. Detta är viktigt eftersom deallokatorer ofta anropas när tolken rullar upp Python-stacken; när stacken rullas upp på grund av ett undantag (snarare än normala returer) görs ingenting för att skydda deallokatorerna från att se att ett undantag redan har ställts in. Alla åtgärder som en deallokator utför som kan orsaka att ytterligare Python-kod exekveras kan upptäcka att ett undantag har satts. Detta kan leda till missvisande fel från tolken. Det korrekta sättet att skydda sig mot detta är att spara ett väntande undantag innan man utför den osäkra åtgärden och återställa det när man är klar. Detta kan göras med hjälp av funktionerna :c:func:`PyErr_Fetch` och :c:func:`PyErr_Restore`::

source: static void my_dealloc(PyObject *obj) { MyObject *self = (MyObject *) obj; PyObject *cbresult; if (self->my_callback != NULL) { PyObject *err_type, *err_value, *err_traceback; /* This saves the current exception state */ PyErr_Fetch(&err_type, &err_value, &err_traceback); cbresult = PyObject_CallNoArgs(self->my_callback); if (cbresult == NULL) { PyErr_WriteUnraisable(self->my_callback); } else { Py_DECREF(cbresult); } /* This restores the saved exception state */ PyErr_Restore(err_type, err_value, err_traceback); Py_DECREF(self->my_callback); } Py_TYPE(self)->tp_free(self); }
sv: statiskt void my_dealloc(PyObject *obj) { MyObject *self = (MyObject *) obj; PyObject *cbresultat; if (self->my_callback != NULL) { PyObject *err_type, *err_value, *err_traceback; /* Detta sparar det aktuella undantagstillståndet */ PyErr_Fetch(&err_type, &err_value, &err_traceback); cbresult = PyObject_CallNoArgs(self->my_callback); if (cbresult == NULL) { PyErr_WriteUnraisable(self->my_callback); } else { Py_DECREF(cbresult); } /* Detta återställer det sparade undantagstillståndet */ PyErr_Restore(err_type, err_value, err_traceback); Py_DECREF(self->my_callback); } Py_TYPE(self)->tp_free(self); }

source: There are limitations to what you can safely do in a deallocator function. First, if your type supports garbage collection (using :c:member:`~PyTypeObject.tp_traverse` and/or :c:member:`~PyTypeObject.tp_clear`), some of the object's members can have been cleared or finalized by the time :c:member:`~PyTypeObject.tp_dealloc` is called. Second, in :c:member:`~PyTypeObject.tp_dealloc`, your object is in an unstable state: its reference count is equal to zero. Any call to a non-trivial object or API (as in the example above) might end up calling :c:member:`~PyTypeObject.tp_dealloc` again, causing a double free and a crash.
sv: Det finns begränsningar för vad du säkert kan göra i en deallokeringsfunktion. För det första, om din typ stöder garbage collection (med :c:member:`~PyTypeObject.tp_traverse` och/eller :c:member:`~PyTypeObject.tp_clear`), kan några av objektets medlemmar ha rensats eller slutförts när :c:member:`~PyTypeObject.tp_dealloc` anropas. För det andra, i :c:member:`~PyTypeObject.tp_dealloc` är ditt objekt i ett instabilt tillstånd: dess referensantal är lika med noll. Varje anrop till ett icke-trivialt objekt eller API (som i exemplet ovan) kan sluta med att :c:member:`~PyTypeObject.tp_dealloc` anropas igen, vilket orsakar en dubbel free och en krasch.

source: Starting with Python 3.4, it is recommended not to put any complex finalization code in :c:member:`~PyTypeObject.tp_dealloc`, and instead use the new :c:member:`~PyTypeObject.tp_finalize` type method.
sv: Från och med Python 3.4 rekommenderas det att inte lägga in någon komplex avslutningskod i :c:member:`~PyTypeObject.tp_dealloc`, utan istället använda den nya typmetoden :c:member:`~PyTypeObject.tp_finalize`.

source: :pep:`442` explains the new finalization scheme.
sv: :pep:`442` förklarar det nya finaliseringsschemat.

source: Object Presentation
sv: Presentation av objekt

source: In Python, there are two ways to generate a textual representation of an object: the :func:`repr` function, and the :func:`str` function. (The :func:`print` function just calls :func:`str`.) These handlers are both optional.
sv: I Python finns det två sätt att generera en textuell representation av ett objekt: funktionen :func:`repr` och funktionen :func:`str`. (Funktionen :func:`print` anropar bara :func:`str`.) Dessa hanterare är båda valfria.

source: The :c:member:`~PyTypeObject.tp_repr` handler should return a string object containing a representation of the instance for which it is called. Here is a simple example::
sv: Hanteraren :c:member:`~PyTypeObject.tp_repr` bör returnera ett strängobjekt som innehåller en representation av den instans för vilken den anropas. Här är ett enkelt exempel::

source: static PyObject * newdatatype_repr(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; return PyUnicode_FromFormat("Repr-ified_newdatatype{{size:%d}}", self->obj_UnderlyingDatatypePtr->size); }
sv: statiskt PyObject * newdatatype_repr(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; return PyUnicode_FromFormat("Repr-ified_newdatatype{{size:%d}}", self->obj_UnderlyingDatatypePtr->size); }

source: If no :c:member:`~PyTypeObject.tp_repr` handler is specified, the interpreter will supply a representation that uses the type's :c:member:`~PyTypeObject.tp_name` and a uniquely identifying value for the object.
sv: Om ingen :c:member:`~PyTypeObject.tp_repr`-hanterare har angetts kommer tolken att tillhandahålla en representation som använder typens :c:member:`~PyTypeObject.tp_name` och ett unikt identifierande värde för objektet.

source: The :c:member:`~PyTypeObject.tp_str` handler is to :func:`str` what the :c:member:`~PyTypeObject.tp_repr` handler described above is to :func:`repr`; that is, it is called when Python code calls :func:`str` on an instance of your object. Its implementation is very similar to the :c:member:`~PyTypeObject.tp_repr` function, but the resulting string is intended for human consumption. If :c:member:`~PyTypeObject.tp_str` is not specified, the :c:member:`~PyTypeObject.tp_repr` handler is used instead.
sv: Hanteraren :c:member:`~PyTypeObject.tp_str` är för :func:`str` vad hanteraren :c:member:`~PyTypeObject.tp_repr` som beskrivs ovan är för :func:`repr`; det vill säga den anropas när Python-kod anropar :func:`str` på en instans av ditt objekt. Dess implementering är mycket lik :c:member:`~PyTypeObject.tp_repr`-funktionen, men den resulterande strängen är avsedd för mänsklig konsumtion. Om :c:member:`~PyTypeObject.tp_str` inte specificeras används istället :c:member:`~PyTypeObject.tp_repr`.

source: Here is a simple example::
sv: Här är ett enkelt exempel::

source: static PyObject * newdatatype_str(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; return PyUnicode_FromFormat("Stringified_newdatatype{{size:%d}}", self->obj_UnderlyingDatatypePtr->size); }
sv: statiskt PyObject * newdatatype_str(PyObject *op) { newdatatypeobject *self = (newdatatypeobject *) op; return PyUnicode_FromFormat("Stringified_newdatatype{{size:%d}}", self->obj_UnderlyingDatatypePtr->size); }

source: Attribute Management
sv: Hantering av attribut

source: For every object which can support attributes, the corresponding type must provide the functions that control how the attributes are resolved. There needs to be a function which can retrieve attributes (if any are defined), and another to set attributes (if setting attributes is allowed). Removing an attribute is a special case, for which the new value passed to the handler is ``NULL``.
sv: För varje objekt som kan stödja attribut måste motsvarande typ tillhandahålla de funktioner som styr hur attributen löses. Det måste finnas en funktion som kan hämta attribut (om några är definierade) och en annan för att ställa in attribut (om det är tillåtet att ställa in attribut). Att ta bort ett attribut är ett specialfall, för vilket det nya värdet som skickas till hanteraren är ``NULL``.

source: Python supports two pairs of attribute handlers; a type that supports attributes only needs to implement the functions for one pair. The difference is that one pair takes the name of the attribute as a :c:expr:`char\*`, while the other accepts a :c:expr:`PyObject*`. Each type can use whichever pair makes more sense for the implementation's convenience. ::
sv: Python stöder två par attributhanterare; en typ som stöder attribut behöver bara implementera funktionerna för ett par. Skillnaden är att det ena paret tar namnet på attributet som ett :c:expr:`char\*`, medan det andra accepterar ett :c:expr:`PyObject*`. Varje typ kan använda det par som är mest meningsfullt för implementeringens bekvämlighet. ::

source: If accessing attributes of an object is always a simple operation (this will be explained shortly), there are generic implementations which can be used to provide the :c:expr:`PyObject*` version of the attribute management functions. The actual need for type-specific attribute handlers almost completely disappeared starting with Python 2.2, though there are many examples which have not been updated to use some of the new generic mechanism that is available.
sv: Om åtkomst till attribut för ett objekt alltid är en enkel operation (detta kommer att förklaras inom kort), finns det generiska implementationer som kan användas för att tillhandahålla :c:expr:`PyObject*`-versionen av attributhanteringsfunktionerna. Det faktiska behovet av typspecifika attributhanterare försvann nästan helt från och med Python 2.2, även om det finns många exempel som inte har uppdaterats för att använda några av de nya generiska mekanismer som finns tillgängliga.

source: Generic Attribute Management
sv: Generisk attributhantering

source: Most extension types only use *simple* attributes. So, what makes the attributes simple? There are only a couple of conditions that must be met:
sv: De flesta tilläggstyper använder bara *enkla* attribut. Vad är det då som gör attributen enkla? Det finns bara ett par villkor som måste uppfyllas:

source: The name of the attributes must be known when :c:func:`PyType_Ready` is called.
sv: Namnet på attributen måste vara känt när :c:func:`PyType_Ready` anropas.

source: No special processing is needed to record that an attribute was looked up or set, nor do actions need to be taken based on the value.
sv: Ingen särskild behandling behövs för att registrera att ett attribut har sökts upp eller ställts in, och inga åtgärder behöver vidtas baserat på värdet.

source: Note that this list does not place any restrictions on the values of the attributes, when the values are computed, or how relevant data is stored.
sv: Observera att denna lista inte innehåller några restriktioner för attributens värden, när värdena beräknas eller hur relevanta data lagras.

source: When :c:func:`PyType_Ready` is called, it uses three tables referenced by the type object to create :term:`descriptor`\s which are placed in the dictionary of the type object. Each descriptor controls access to one attribute of the instance object. Each of the tables is optional; if all three are ``NULL``, instances of the type will only have attributes that are inherited from their base type, and should leave the :c:member:`~PyTypeObject.tp_getattro` and :c:member:`~PyTypeObject.tp_setattro` fields ``NULL`` as well, allowing the base type to handle attributes.
sv: När :c:func:`PyType_Ready` anropas används tre tabeller som refereras av typobjektet för att skapa :term:`descriptor` som placeras i typobjektets dictionary. Varje deskriptor kontrollerar åtkomst till ett attribut hos instansobjektet. Var och en av tabellerna är valfri; om alla tre är ``NULL`` kommer instanser av typen endast att ha attribut som ärvs från deras bastyp, och bör lämna fälten :c:member:`~PyTypeObject.tp_getattro` och :c:member:`~PyTypeObject.tp_setattro` ``NULL`` också, så att bastypen kan hantera attribut.

source: The tables are declared as three fields of the type object::
sv: Tabellerna deklareras som tre fält av typen object::
