Repository: yeager/python-docs-sv
Catalog: extending/newtypes_tutorial.po
Languages: sv

source: A disadvantage of this approach is that it doesn't provide a way to restrict the types of objects that can be assigned to the Python attributes. We expect the first and last names to be strings, but any Python objects can be assigned. Further, the attributes can be deleted, setting the C pointers to ``NULL``. Even though we can make sure the members are initialized to non-``NULL`` values, the members can be set to ``NULL`` if the attributes are deleted.
sv: En nackdel med detta tillvägagångssätt är att det inte ger något sätt att begränsa de typer av objekt som kan tilldelas Python-attributen. Vi förväntar oss att för- och efternamn ska vara strängar, men alla Python-objekt kan tilldelas. Dessutom kan attributen tas bort genom att C-pekarna sätts till ``NULL``. Även om vi kan se till att medlemmarna initialiseras till värden som inte är ``NULL``, kan medlemmarna sättas till ``NULL`` om attributen raderas.

source: We define a single method, :meth:`!Custom.name`, that outputs the objects name as the concatenation of the first and last names. ::
sv: Vi definierar en enda metod, :meth:`!Custom.name`, som matar ut objektets namn som en sammankoppling av för- och efternamn. ::

source: static PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; if (self->first == NULL) { PyErr_SetString(PyExc_AttributeError, "first"); return NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "last"); return NULL; } return PyUnicode_FromFormat("%S %S", self->first, self->last); }
sv: statiskt PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; if (self->first == NULL) { PyErr_SetString(PyExc_AttributeError, "first"); returnera NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "last"); returnera NULL; } return PyUnicode_FromFormat("%S %S", self->first, self->last); }

source: The method is implemented as a C function that takes a :class:`!Custom` (or :class:`!Custom` subclass) instance as the first argument. Methods always take an instance as the first argument. Methods often take positional and keyword arguments as well, but in this case we don't take any and don't need to accept a positional argument tuple or keyword argument dictionary. This method is equivalent to the Python method:
sv: Metoden är implementerad som en C-funktion som tar en instans av :class:`!Custom` (eller :class:`!Custom` subclass) som första argument. Metoder tar alltid en instans som första argument. Metoder tar ofta positionella argument och nyckelordsargument också, men i det här fallet tar vi inga och behöver inte acceptera en tupel med positionella argument eller en ordbok med nyckelordsargument. Denna metod är likvärdig med Python-metoden:

source: def name(self): return "%s %s" % (self.first, self.last)
sv: def namn(self): return "%s %s" % (self.first, self.last)

source: Note that we have to check for the possibility that our :attr:`!first` and :attr:`!last` members are ``NULL``. This is because they can be deleted, in which case they are set to ``NULL``. It would be better to prevent deletion of these attributes and to restrict the attribute values to be strings. We'll see how to do that in the next section.
sv: Observera att vi måste kontrollera om våra medlemmar :attr:`!first` och :attr:`!last` är ``NULL``. Detta beror på att de kan raderas, i vilket fall de sätts till ``NULL``. Det vore bättre att förhindra radering av dessa attribut och att begränsa attributvärdena till strängar. Vi ska se hur man gör det i nästa avsnitt.

source: Now that we've defined the method, we need to create an array of method definitions::
sv: Nu när vi har definierat metoden måste vi skapa en matris med metoddefinitioner::

source: static PyMethodDef Custom_methods[] = { {"name", Custom_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ };
sv: statisk PyMethodDef Custom_methods[] = { {"name", Eget_namn, METH_NOARGS, "Returnera namnet genom att kombinera för- och efternamn" }, {NULL} /* Sentinel */ };

source: (note that we used the :c:macro:`METH_NOARGS` flag to indicate that the method is expecting no arguments other than *self*)
sv: (notera att vi använde :c:macro:`METH_NOARGS`-flaggan för att ange att metoden inte förväntar sig några andra argument än *self*)

source: and assign it to the :c:member:`~PyTypeObject.tp_methods` slot::
sv: och tilldela den till :c:member:`~PyTypeObject.tp_methods` slot::

source: .tp_methods = Custom_methods,
sv: .tp_methods = Anpassade_metoder,

source: Finally, we'll make our type usable as a base class for subclassing. We've written our methods carefully so far so that they don't make any assumptions about the type of the object being created or used, so all we need to do is to add the :c:macro:`Py_TPFLAGS_BASETYPE` to our class flag definition::
sv: Slutligen ska vi göra vår typ användbar som basklass för underklassning. Vi har hittills skrivit våra metoder noggrant så att de inte gör några antaganden om typen av det objekt som skapas eller används, så allt vi behöver göra är att lägga till :c:macro:`Py_TPFLAGS_BASETYPE` till vår klassflaggdefinition::

source: We rename :c:func:`!PyInit_custom` to :c:func:`!PyInit_custom2`, update the module name in the :c:type:`PyModuleDef` struct, and update the full class name in the :c:type:`PyTypeObject` struct.
sv: Vi byter namn på :c:func:`!PyInit_custom` till :c:func:`!PyInit_custom2`, uppdaterar modulnamnet i struct:en :c:type:`PyModuleDef` och uppdaterar det fullständiga klassnamnet i struct:en :c:type:`PyTypeObject`.

source: Finally, we update our :file:`setup.py` file to include the new module,
sv: Slutligen uppdaterar vi vår :file:`setup.py`-fil så att den inkluderar den nya modulen,

source: from setuptools import Extension, setup setup(ext_modules=[ Extension("custom", ["custom.c"]), Extension("custom2", ["custom2.c"]), ])
sv: from setuptools import Förlängning, setup setup(ext_modules=[ Extension("custom", ["custom.c"]), Extension("custom2", ["custom2.c"]), ])

source: and then we re-install so that we can ``import custom2``:
sv: och sedan installerar vi om så att vi kan ``importera custom2``:

source: Providing finer control over data attributes
sv: Tillhandahåller finare kontroll över dataattribut

source: In this section, we'll provide finer control over how the :attr:`!first` and :attr:`!last` attributes are set in the :class:`!Custom` example. In the previous version of our module, the instance variables :attr:`!first` and :attr:`!last` could be set to non-string values or even deleted. We want to make sure that these attributes always contain strings.
sv: I det här avsnittet ska vi ge finare kontroll över hur attributen :attr:`!first` och :attr:`!last` anges i exemplet :class:`!Custom`. I den tidigare versionen av vår modul kunde instansvariablerna :attr:`!first` och :attr:`!last` sättas till icke-strängvärden eller till och med raderas. Vi vill se till att dessa attribut alltid innehåller strängar.

source: #define PY_SSIZE_T_CLEAN #include <Python.h> #include <stddef.h> /* for offsetof() */ typedef struct { PyObject_HEAD PyObject *first; /* first name */ PyObject *last; /* last name */ int number; } CustomObject; static void Custom_dealloc(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_XDECREF(self->first); Py_XDECREF(self->last); Py_TYPE(self)->tp_free(self); } static PyObject * Custom_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *) self; } static int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|UUi", kwlist, &first, &last, &self->number)) return -1; if (first) { Py_SETREF(self->first, Py_NewRef(first)); } if (last) { Py_SETREF(self->last, Py_NewRef(last)); } return 0; } static PyMemberDef Custom_members[] = { {"number", Py_T_INT, offsetof(CustomObject, number), 0, "custom number"}, {NULL} /* Sentinel */ }; static PyObject * Custom_getfirst(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->first); } static int Custom_setfirst(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the first attribute"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "The first attribute value must be a string"); return -1; } Py_SETREF(self->first, Py_NewRef(value)); return 0; } static PyObject * Custom_getlast(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->last); } static int Custom_setlast(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the last attribute"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "The last attribute value must be a string"); return -1; } Py_SETREF(self->last, Py_NewRef(value)); return 0; } static PyGetSetDef Custom_getsetters[] = { {"first", Custom_getfirst, Custom_setfirst, "first name", NULL}, {"last", Custom_getlast, Custom_setlast, "last name", NULL}, {NULL} /* Sentinel */ }; static PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; return PyUnicode_FromFormat("%S %S", self->first, self->last); } static PyMethodDef Custom_methods[] = { {"name", Custom_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ }; static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom3.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, .tp_new = Custom_new, .tp_init = Custom_init, .tp_dealloc = Custom_dealloc, .tp_members = Custom_members, .tp_methods = Custom_methods, .tp_getset = Custom_getsetters, }; static int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; static PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "custom3", .m_doc = "Example module that creates an extension type.", .m_size = 0, .m_slots = custom_module_slots, }; PyMODINIT_FUNC PyInit_custom3(void) { return PyModuleDef_Init(&custom_module); }
sv: #definiera PY_SSIZE_T_CLEAN #include <Python.h> #include <stddef.h> /* för offsetof() #include <stddef.h> /* för offsetof() */ typedef struct { PyObject_Huvud PyObject *first; /* förnamn */ PyObject *last; /* efternamn */ int nummer; } CustomObject; statiskt void Custom_dealloc(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_XDECREF(själv>första); Py_XDECREF(self->last); Py_TYPE(self)->tp_free(self); } statiskt PyObject * Custom_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->first == NULL) { Py_DECREF(self); returnera NULL; } self->last = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->last == NULL) { Py_DECREF(self); returnera NULL; } self->number = 0; } return (PyObject *) self; } statisk int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|UUUi", kwlist, &first, &last, &själv->nummer)) return -1; if (första) { Py_SETREF(self->first, Py_NewRef(first)); } if (last) { Py_SETREF(self->last, Py_NewRef(last)); } return 0; } static PyMemberDef Custom_members[] = { {"number", Py_T_INT, offsetof(CustomObject, number), 0, "anpassat nummer"}, {NULL} /* Sentinel */ }; statiskt PyObject * Custom_getfirst(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->first); } statisk int Custom_setfirst(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (värde == NULL) { PyErr_SetString(PyExc_TypeError, "Det går inte att ta bort det första attributet"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "Det första attributvärdet måste vara en sträng"); return -1; } Py_SETREF(self->first, Py_NewRef(value)); return 0; } statiskt PyObject * Custom_getlast(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->last); } statisk int Custom_setlast(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (värde == NULL) { PyErr_SetString(PyExc_TypeError, "Det går inte att ta bort det sista attributet"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "Det sista attributvärdet måste vara en sträng"); return -1; } Py_SETREF(self->last, Py_NewRef(value)); return 0; } static PyGetSetDef Custom_getsetters[] = { {"first", Custom_getfirst, Custom_setfirst, "förnamn", NULL}, {"last", Custom_getlast, Custom_setlast, "efternamn", NULL}, {NULL} /* Sentinel */ }; statiskt PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; return PyUnicode_FromFormat("%S %S", self->first, self->last); } static PyMethodDef Custom_methods[] = { {"name", Eget_namn, METH_NOARGS, "Returnera namnet genom att kombinera för- och efternamn" }, {NULL} /* Sentinel */ }; statisk PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom3.Custom", .tp_doc = PyDoc_STR("Anpassade objekt"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, .tp_new = Egen_ny, .tp_init = Anpassad_init, .tp_dealloc = Custom_dealloc, .tp_members = Anpassad_members, .tp_methods = Egna_metoder, .tp_getset = Egna_getsetters, }; statisk int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { returnera -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; statisk PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "anpassad3", .m_doc = "Exempelmodul som skapar en tilläggstyp.", .m_size = 0, .m_slots = anpassade_modul_slots, }; PyMODINIT_FUNC PyInit_custom3(void) { return PyModuleDef_Init(&custom_module); }

source: To provide greater control, over the :attr:`!first` and :attr:`!last` attributes, we'll use custom getter and setter functions. Here are the functions for getting and setting the :attr:`!first` attribute::
sv: För att ge större kontroll över attributen :attr:`!first` och :attr:`!last` använder vi anpassade getter- och setter-funktioner. Här är funktionerna för att hämta och ställa in attributet :attr:`!first`::

source: static PyObject * Custom_getfirst(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; Py_INCREF(self->first); return self->first; } static int Custom_setfirst(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; PyObject *tmp; if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the first attribute"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "The first attribute value must be a string"); return -1; } tmp = self->first; Py_INCREF(value); self->first = value; Py_DECREF(tmp); return 0; }
sv: statiskt PyObject * Custom_getfirst(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; Py_INCREF(self->first); return self->first; } statisk int Custom_setfirst(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; PyObject *tmp; if (värde == NULL) { PyErr_SetString(PyExc_TypeError, "Det går inte att ta bort det första attributet"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "Det första attributvärdet måste vara en sträng"); return -1; } tmp = själv>första; Py_INCREF(värde); self->first = värde; Py_DECREF(tmp); return 0; }

source: The getter function is passed a :class:`!Custom` object and a "closure", which is a void pointer. In this case, the closure is ignored. (The closure supports an advanced usage in which definition data is passed to the getter and setter. This could, for example, be used to allow a single set of getter and setter functions that decide the attribute to get or set based on data in the closure.)
sv: Getter-funktionen får ett :class:`!Custom`-objekt och en "closure", som är en void-pekare. I det här fallet ignoreras closure. (Closure stöder en avancerad användning där definitionsdata skickas till getter- och setterfunktionerna. Detta kan t.ex. användas för att tillåta en enda uppsättning getter- och setterfunktioner som bestämmer vilket attribut som ska hämtas eller sättas baserat på data i closure)

source: The setter function is passed the :class:`!Custom` object, the new value, and the closure. The new value may be ``NULL``, in which case the attribute is being deleted. In our setter, we raise an error if the attribute is deleted or if its new value is not a string.
sv: Setter-funktionen får :class:`!Custom`-objektet, det nya värdet och avslutningen. Det nya värdet kan vara ``NULL``, i vilket fall attributet tas bort. I vår setter ger vi ett felmeddelande om attributet raderas eller om det nya värdet inte är en sträng.

source: We create an array of :c:type:`PyGetSetDef` structures::
sv: Vi skapar en array av :c:type:`PyGetSetDef`-strukturer::

source: static PyGetSetDef Custom_getsetters[] = { {"first", Custom_getfirst, Custom_setfirst, "first name", NULL}, {"last", Custom_getlast, Custom_setlast, "last name", NULL}, {NULL} /* Sentinel */ };
sv: statisk PyGetSetDef Custom_getsetters[] = { {"first", Custom_getfirst, Custom_setfirst, "förnamn", NULL}, {"last", Custom_getlast, Custom_setlast, "efternamn", NULL}, {NULL} /* Sentinel */ };

source: and register it in the :c:member:`~PyTypeObject.tp_getset` slot::
sv: och registrera den i :c:member:`~PyTypeObject.tp_getset` slot::

source: .tp_getset = Custom_getsetters,
sv: .tp_getset = Anpassade_getsetters,

source: The last item in a :c:type:`PyGetSetDef` structure is the "closure" mentioned above. In this case, we aren't using a closure, so we just pass ``NULL``.
sv: Det sista objektet i en :c:type:`PyGetSetDef`-struktur är den "closure" som nämns ovan. I det här fallet använder vi inte en closure, så vi skickar bara ``NULL``.

source: We also remove the member definitions for these attributes::
sv: Vi tar också bort medlemsdefinitionerna för dessa attribut::

source: static PyMemberDef Custom_members[] = { {"number", Py_T_INT, offsetof(CustomObject, number), 0, "custom number"}, {NULL} /* Sentinel */ };
sv: static PyMemberDef Custom_members[] = { {"number", Py_T_INT, offsetof(CustomObject, number), 0, "anpassat nummer"}, {NULL} /* Sentinel */ };

source: We also need to update the :c:member:`~PyTypeObject.tp_init` handler to only allow strings [#]_ to be passed::
sv: Vi måste också uppdatera :c:member:`~PyTypeObject.tp_init`-handlaren så att den bara tillåter strängar [#]_ att skickas::

source: static int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL, *tmp; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|UUi", kwlist, &first, &last, &self->number)) return -1; if (first) { tmp = self->first; Py_INCREF(first); self->first = first; Py_DECREF(tmp); } if (last) { tmp = self->last; Py_INCREF(last); self->last = last; Py_DECREF(tmp); } return 0; }
sv: statisk int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL, *tmp; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|UUUi", kwlist, &first, &last, &själv->nummer)) return -1; if (första) { tmp = själv>första; Py_INCREF(första); själv>första = första; Py_DECREF(tmp); } if (sista) { tmp = self->last; Py_INCREF(sista); self->last = last; Py_DECREF(tmp); } return 0; }

source: With these changes, we can assure that the ``first`` and ``last`` members are never ``NULL`` so we can remove checks for ``NULL`` values in almost all cases. This means that most of the :c:func:`Py_XDECREF` calls can be converted to :c:func:`Py_DECREF` calls. The only place we can't change these calls is in the ``tp_dealloc`` implementation, where there is the possibility that the initialization of these members failed in ``tp_new``.
sv: Med dessa ändringar kan vi försäkra oss om att medlemmarna ``first`` och ``last`` aldrig är ``NULL`` så vi kan ta bort kontroller för ``NULL``-värden i nästan alla fall. Detta innebär att de flesta :c:func:`Py_XDECREF`-anrop kan konverteras till :c:func:`Py_DECREF`-anrop. Det enda stället där vi inte kan ändra dessa anrop är i implementationen av ``tp_dealloc``, där det finns en möjlighet att initialiseringen av dessa medlemmar misslyckades i ``tp_new``.

source: We also rename the module initialization function and module name in the initialization function, as we did before, and we add an extra definition to the :file:`setup.py` file.
sv: Vi byter också namn på modulinitialiseringsfunktionen och modulnamnet i initialiseringsfunktionen, som vi gjorde tidigare, och vi lägger till en extra definition i filen :file:`setup.py`.

source: Supporting cyclic garbage collection
sv: Stöd för cyklisk skräpinsamling

source: Python has a :term:`cyclic garbage collector (GC) <garbage collection>` that can identify unneeded objects even when their reference counts are not zero. This can happen when objects are involved in cycles. For example, consider:
sv: Python har en :term:``cyklisk garbage collector (GC) <garbage collection>`` som kan identifiera onödiga objekt även när deras referensantal inte är noll. Detta kan hända när objekt är involverade i cykler. Tänk till exempel på:

source: >>> l = [] >>> l.append(l) >>> del l
sv: >>> l = [] >>> l.lägg till(l) >>> del l

source: In this example, we create a list that contains itself. When we delete it, it still has a reference from itself. Its reference count doesn't drop to zero. Fortunately, Python's cyclic garbage collector will eventually figure out that the list is garbage and free it.
sv: I det här exemplet skapar vi en lista som innehåller sig själv. När vi tar bort den har den fortfarande en referens från sig själv. Dess referensantal sjunker inte till noll. Lyckligtvis kommer Pythons cykliska skräpsamlare så småningom att räkna ut att listan är skräp och frigöra den.
