Repository: yeager/python-docs-sv
Catalog: extending/newtypes_tutorial.po
Languages: sv

source: #define PY_SSIZE_T_CLEAN #include <Python.h> #include <stddef.h> /* for offsetof() */ typedef struct { PyObject_HEAD PyObject *first; /* first name */ PyObject *last; /* last name */ int number; } CustomObject; static void Custom_dealloc(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_XDECREF(self->first); Py_XDECREF(self->last); Py_TYPE(self)->tp_free(self); } static PyObject * Custom_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *) self; } static int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &first, &last, &self->number)) return -1; if (first) { Py_XSETREF(self->first, Py_NewRef(first)); } if (last) { Py_XSETREF(self->last, Py_NewRef(last)); } return 0; } static PyMemberDef Custom_members[] = { {"first", Py_T_OBJECT_EX, offsetof(CustomObject, first), 0, "first name"}, {"last", Py_T_OBJECT_EX, offsetof(CustomObject, last), 0, "last name"}, {"number", Py_T_INT, offsetof(CustomObject, number), 0, "custom number"}, {NULL} /* Sentinel */ }; static PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; if (self->first == NULL) { PyErr_SetString(PyExc_AttributeError, "first"); return NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "last"); return NULL; } return PyUnicode_FromFormat("%S %S", self->first, self->last); } static PyMethodDef Custom_methods[] = { {"name", Custom_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ }; static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom2.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, .tp_new = Custom_new, .tp_init = Custom_init, .tp_dealloc = Custom_dealloc, .tp_members = Custom_members, .tp_methods = Custom_methods, }; static int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; static PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "custom2", .m_doc = "Example module that creates an extension type.", .m_size = 0, .m_slots = custom_module_slots, }; PyMODINIT_FUNC PyInit_custom2(void) { return PyModuleDef_Init(&custom_module); }
sv: #definiera PY_SSIZE_T_CLEAN #include <Python.h> #include <stddef.h> /* för offsetof() #include <stddef.h> /* för offsetof() */ typedef struct { PyObject_Huvud PyObject *first; /* förnamn */ PyObject *last; /* efternamn */ int nummer; } CustomObject; statiskt void Custom_dealloc(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_XDECREF(själv>första); Py_XDECREF(self->last); Py_TYPE(self)->tp_free(self); } statiskt PyObject * Custom_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->first == NULL) { Py_DECREF(self); returnera NULL; } self->last = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->last == NULL) { Py_DECREF(self); returnera NULL; } self->number = 0; } return (PyObject *) self; } statisk int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &first, &last, &själv->nummer)) return -1; if (första) { Py_XSETREF(self->first, Py_NewRef(first)); } if (sista) { Py_XSETREF(self->last, Py_NewRef(last)); } return 0; } static PyMemberDef Custom_members[] = { {"first", Py_T_OBJECT_EX, offsetof(CustomObject, first), 0, "förnamn"}, {"last", Py_T_OBJECT_EX, offsetof(CustomObject, last), 0,"efternamn"}, {"last", Py_T_OBJECT_EX, offsetof(CustomObject, last), 0, "efternamn"}, {"number", Py_T_INT, offsetof(CustomObject, number), 0, "anpassat nummer"}, {NULL} /* Sentinel */ }; statiskt PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; if (self->first == NULL) { PyErr_SetString(PyExc_AttributeError, "first"); returnera NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "last"); returnera NULL; } return PyUnicode_FromFormat("%S %S", self->first, self->last); } static PyMethodDef Custom_methods[] = { {"name", Eget_namn, METH_NOARGS, "Returnera namnet genom att kombinera för- och efternamn" }, {NULL} /* Sentinel */ }; statisk PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom2.Custom", .tp_doc = PyDoc_STR("Anpassade objekt"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, .tp_new = Egen_ny, .tp_init = Anpassad_init, .tp_dealloc = Custom_dealloc, .tp_members = Anpassad_members, .tp_methods = Custom_methods, }; statisk int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { returnera -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; statisk PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "anpassad2", .m_doc = "Exempelmodul som skapar en tilläggstyp.", .m_size = 0, .m_slots = anpassade_modul_slots, }; PyMODINIT_FUNC PyInit_custom2(void) { return PyModuleDef_Init(&custom_module); }

source: This version of the module has a number of changes.
sv: Denna version av modulen har ett antal ändringar.

source: The :class:`!Custom` type now has three data attributes in its C struct, *first*, *last*, and *number*. The *first* and *last* variables are Python strings containing first and last names. The *number* attribute is a C integer.
sv: Typen :class:`!Custom` har nu tre dataattribut i sin C-struktur, *first*, *last* och *number*. Variablerna *first* och *last* är Python-strängar som innehåller för- och efternamn. Attributet *number* är ett heltal i C.

source: The object structure is updated accordingly::
sv: Objektstrukturen uppdateras i enlighet med detta::

source: typedef struct { PyObject_HEAD PyObject *first; /* first name */ PyObject *last; /* last name */ int number; } CustomObject;
sv: typedef struct { PyObject_Huvud PyObject *first; /* förnamn */ PyObject *last; /* efternamn */ int nummer; } CustomObject;

source: Because we now have data to manage, we have to be more careful about object allocation and deallocation. At a minimum, we need a deallocation method::
sv: Eftersom vi nu har data att hantera måste vi vara mer försiktiga med objektallokering och -deallokering. Vi behöver åtminstone en metod för avallokering::

source: static void Custom_dealloc(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_XDECREF(self->first); Py_XDECREF(self->last); Py_TYPE(self)->tp_free(self); }
sv: statiskt void Custom_dealloc(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_XDECREF(själv>första); Py_XDECREF(self->last); Py_TYPE(self)->tp_free(self); }

source: which is assigned to the :c:member:`~PyTypeObject.tp_dealloc` member::
sv: som är tilldelad :c:member:`~PyTypeObject.tp_dealloc` member::

source: .tp_dealloc = Custom_dealloc,
sv: .tp_dealloc = Anpassad_dealloc,

source: This method first clears the reference counts of the two Python attributes. :c:func:`Py_XDECREF` correctly handles the case where its argument is ``NULL`` (which might happen here if ``tp_new`` failed midway). It then calls the :c:member:`~PyTypeObject.tp_free` member of the object's type (computed by ``Py_TYPE(self)``) to free the object's memory. Note that the object's type might not be :class:`!CustomType`, because the object may be an instance of a subclass.
sv: Denna metod rensar först referensräkningarna för de två Python-attributen. :c:func:`Py_XDECREF` hanterar korrekt fallet där dess argument är ``NULL`` (vilket kan hända här om ``tp_new`` misslyckades halvvägs). Den anropar sedan :c:member:`~PyTypeObject.tp_free`-medlemmen av objektets typ (beräknad av ``Py_TYPE(self)``) för att frigöra objektets minne. Observera att objektets typ kanske inte är :class:`!CustomType`, eftersom objektet kan vara en instans av en underklass.

source: The explicit cast to ``CustomObject *`` above is needed because we defined ``Custom_dealloc`` to take a ``PyObject *`` argument, as the ``tp_dealloc`` function pointer expects to receive a ``PyObject *`` argument. By assigning to the ``tp_dealloc`` slot of a type, we declare that it can only be called with instances of our ``CustomObject`` class, so the cast to ``(CustomObject *)`` is safe. This is object-oriented polymorphism, in C!
sv: Den uttryckliga castningen till ``CustomObject *`` ovan behövs eftersom vi definierade ``Custom_dealloc`` att ta ett ``PyObject *`` argument, eftersom ``tp_dealloc`` funktionspekaren förväntar sig att ta emot ett ``PyObject *`` argument. Genom att tilldela ``tp_dealloc`` slot till en typ, deklarerar vi att den endast kan anropas med instanser av vår ``CustomObject`` klass, så castet till ``(CustomObject *)`` är säkert. Detta är objektorienterad polymorfism, i C!

source: In existing code, or in previous versions of this tutorial, you might see similar functions take a pointer to the subtype object structure (``CustomObject*``) directly, like this::
sv: I befintlig kod, eller i tidigare versioner av denna handledning, kan du se liknande funktioner som tar en pekare till subtypens objektstruktur (``CustomObject*``) direkt, så här::

source: Custom_dealloc(CustomObject *self) { Py_XDECREF(self->first); Py_XDECREF(self->last); Py_TYPE(self)->tp_free((PyObject *) self); } ... .tp_dealloc = (destructor) Custom_dealloc,
sv: Custom_dealloc(CustomObject *self) { Py_XDECREF(själv>första); Py_XDECREF(self->last); Py_TYPE(self)->tp_free((PyObject *) self); } ... .tp_dealloc = (destructor) Custom_dealloc,

source: This does the same thing on all architectures that CPython supports, but according to the C standard, it invokes undefined behavior.
sv: Detta gör samma sak på alla arkitekturer som CPython stöder, men enligt C-standarden ger det upphov till ett odefinierat beteende.

source: We want to make sure that the first and last names are initialized to empty strings, so we provide a ``tp_new`` implementation::
sv: Vi vill se till att för- och efternamn initialiseras till tomma strängar, så vi tillhandahåller en ``tp_new``-implementering::

source: static PyObject * Custom_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = PyUnicode_FromString(""); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = PyUnicode_FromString(""); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *) self; }
sv: statiskt PyObject * Custom_new(PyTypeObject *typ, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = PyUnicode_FromString(""); if (self->first == NULL) { Py_DECREF(self); returnera NULL; } self->last = PyUnicode_FromString(""); if (self->last == NULL) { Py_DECREF(self); returnera NULL; } self->number = 0; } return (PyObject *) self; }

source: and install it in the :c:member:`~PyTypeObject.tp_new` member::
sv: och installera den i :c:member:`~PyTypeObject.tp_new` member::

source: .tp_new = Custom_new,
sv: .tp_new = Anpassad_ny,

source: The ``tp_new`` handler is responsible for creating (as opposed to initializing) objects of the type. It is exposed in Python as the :meth:`~object.__new__` method. It is not required to define a ``tp_new`` member, and indeed many extension types will simply reuse :c:func:`PyType_GenericNew` as done in the first version of the :class:`!Custom` type above. In this case, we use the ``tp_new`` handler to initialize the ``first`` and ``last`` attributes to non-``NULL`` default values.
sv: Hanteraren ``tp_new`` är ansvarig för att skapa (i motsats till att initialisera) objekt av typen. Den exponeras i Python som metoden :meth:`~object.__new__`. Det är inte nödvändigt att definiera en ``tp_new``-medlem, och många tilläggstyper kommer helt enkelt att återanvända :c:func:`PyType_GenericNew`` som i den första versionen av :class:`!Custom`-typen ovan. I det här fallet använder vi hanteraren ``tp_new`` för att initiera attributen ``first`` och ``last`` till standardvärden som inte är ``NULL``.

source: ``tp_new`` is passed the type being instantiated (not necessarily ``CustomType``, if a subclass is instantiated) and any arguments passed when the type was called, and is expected to return the instance created. ``tp_new`` handlers always accept positional and keyword arguments, but they often ignore the arguments, leaving the argument handling to initializer (a.k.a. ``tp_init`` in C or ``__init__`` in Python) methods.
sv: ``tp_new`` får den typ som instansieras (inte nödvändigtvis ``CustomType``, om en underklass instansieras) och eventuella argument som skickades när typen anropades, och förväntas returnera den instans som skapats. ``tp_new``-hanterare accepterar alltid positions- och nyckelordsargument, men de ignorerar ofta argumenten och lämnar argumenthanteringen till initialiseringsmetoder (a.k.a. ``tp_init`` i C eller ``__init__`` i Python).

source: ``tp_new`` shouldn't call ``tp_init`` explicitly, as the interpreter will do it itself.
sv: ``tp_new`` bör inte anropa ``tp_init`` explicit, eftersom tolken kommer att göra det själv.

source: The ``tp_new`` implementation calls the :c:member:`~PyTypeObject.tp_alloc` slot to allocate memory::
sv: Implementationen ``tp_new`` anropar :c:member:`~PyTypeObject.tp_alloc` för att allokera minne::

source: Since memory allocation may fail, we must check the :c:member:`~PyTypeObject.tp_alloc` result against ``NULL`` before proceeding.
sv: Eftersom minnesallokering kan misslyckas måste vi kontrollera :c:member:`~PyTypeObject.tp_alloc`-resultatet mot ``NULL`` innan vi fortsätter.

source: We didn't fill the :c:member:`~PyTypeObject.tp_alloc` slot ourselves. Rather :c:func:`PyType_Ready` fills it for us by inheriting it from our base class, which is :class:`object` by default. Most types use the default allocation strategy.
sv: Vi har inte fyllt :c:member:`~PyTypeObject.tp_alloc`-platsen själva. Istället fyller :c:func:`PyType_Ready` den åt oss genom att ärva den från vår basklass, som är :class:`object` som standard. De flesta typer använder standardallokeringsstrategin.

source: If you are creating a co-operative :c:member:`~PyTypeObject.tp_new` (one that calls a base type's :c:member:`~PyTypeObject.tp_new` or :meth:`~object.__new__`), you must *not* try to determine what method to call using method resolution order at runtime. Always statically determine what type you are going to call, and call its :c:member:`~PyTypeObject.tp_new` directly, or via ``type->tp_base->tp_new``. If you do not do this, Python subclasses of your type that also inherit from other Python-defined classes may not work correctly. (Specifically, you may not be able to create instances of such subclasses without getting a :exc:`TypeError`.)
sv: Om du skapar en kooperativ :c:member:`~PyTypeObject.tp_new` (en som anropar en bastyps :c:member:`~PyTypeObject.tp_new` eller :meth:`~object.__new__`), får du *inte* försöka avgöra vilken metod som ska anropas med hjälp av metodresolutionsordning vid körning. Bestäm alltid statiskt vilken typ du ska anropa, och anropa dess :c:member:`~PyTypeObject.tp_new` direkt, eller via ``type->tp_base->tp_new``. Om du inte gör detta kan det hända att Python-subklasser av din typ som också ärver från andra Python-definierade klasser inte fungerar korrekt. (Specifikt kanske du inte kan skapa instanser av sådana subklasser utan att få ett :exc:`TypeError`)

source: We also define an initialization function which accepts arguments to provide initial values for our instance::
sv: Vi definierar också en initialiseringsfunktion som accepterar argument för att tillhandahålla initiala värden för vår instans::

source: static int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL, *tmp; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &first, &last, &self->number)) return -1; if (first) { tmp = self->first; Py_INCREF(first); self->first = first; Py_XDECREF(tmp); } if (last) { tmp = self->last; Py_INCREF(last); self->last = last; Py_XDECREF(tmp); } return 0; }
sv: statisk int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL, *tmp; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &first, &last, &själv->nummer)) return -1; if (första) { tmp = själv>första; Py_INCREF(första); själv>första = första; Py_XDECREF(tmp); } if (sista) { tmp = self->last; Py_INCREF(sista); self->last = sista; Py_XDECREF(tmp); } return 0; }

source: by filling the :c:member:`~PyTypeObject.tp_init` slot. ::
sv: genom att fylla :c:member:`~PyTypeObject.tp_init` slot. ::

source: The :c:member:`~PyTypeObject.tp_init` slot is exposed in Python as the :meth:`~object.__init__` method. It is used to initialize an object after it's created. Initializers always accept positional and keyword arguments, and they should return either ``0`` on success or ``-1`` on error.
sv: Slotten :c:member:`~PyTypeObject.tp_init` exponeras i Python som metoden :meth:`~object.__init__`. Den används för att initiera ett objekt efter att det har skapats. Initialiserare accepterar alltid positionella argument och nyckelordsargument, och de bör returnera antingen ``0`` vid framgång eller ``-1`` vid fel.

source: Unlike the ``tp_new`` handler, there is no guarantee that ``tp_init`` is called at all (for example, the :mod:`pickle` module by default doesn't call :meth:`~object.__init__` on unpickled instances). It can also be called multiple times. Anyone can call the :meth:`!__init__` method on our objects. For this reason, we have to be extra careful when assigning the new attribute values. We might be tempted, for example to assign the ``first`` member like this::
sv: Till skillnad från ``tp_new``-hanteraren finns det ingen garanti för att ``tp_init`` anropas överhuvudtaget (till exempel anropar modulen :mod:`pickle` som standard inte :meth:`~object.__init__` på instanser som inte har plockats upp). Den kan också anropas flera gånger. Vem som helst kan anropa metoden :meth:`!__init__` på våra objekt. Av denna anledning måste vi vara extra försiktiga när vi tilldelar de nya attributvärdena. Vi kan t.ex. frestas att tilldela ``first``-medlemmen så här::

source: if (first) { Py_XDECREF(self->first); Py_INCREF(first); self->first = first; }
sv: if (första) { Py_XDECREF(själv>först); Py_INCREF(första); self->first = första; }

source: But this would be risky. Our type doesn't restrict the type of the ``first`` member, so it could be any kind of object. It could have a destructor that causes code to be executed that tries to access the ``first`` member; or that destructor could detach the :term:`thread state <attached thread state>` and let arbitrary code run in other threads that accesses and modifies our object.
sv: Men detta skulle vara riskabelt. Vår typ begränsar inte typen av den ``första`` medlemmen, så det kan vara vilken typ av objekt som helst. Det skulle kunna ha en destruktor som gör att kod exekveras som försöker komma åt ``first``-medlemmen; eller så skulle den destruktorn kunna koppla bort :term:``thread state <attached thread state>`` och låta godtycklig kod köras i andra trådar som kommer åt och modifierar vårt objekt.

source: To be paranoid and protect ourselves against this possibility, we almost always reassign members before decrementing their reference counts. When don't we have to do this?
sv: För att vara paranoid och skydda oss mot denna möjlighet omplacerar vi nästan alltid medlemmar innan vi minskar deras referensantal. När behöver vi inte göra detta?

source: when we absolutely know that the reference count is greater than 1;
sv: när vi absolut vet att referensantalet är större än 1;

source: when we know that deallocation of the object [#]_ will neither detach the :term:`thread state <attached thread state>` nor cause any calls back into our type's code;
sv: när vi vet att deallokering av objektet [#]_ varken kommer att ta bort :term:`thread state <attached thread state>` eller orsaka några anrop tillbaka till vår typs kod;

source: when decrementing a reference count in a :c:member:`~PyTypeObject.tp_dealloc` handler on a type which doesn't support cyclic garbage collection [#]_.
sv: vid dekrementering av ett referensantal i en :c:member:`~PyTypeObject.tp_dealloc`-hanterare på en typ som inte stöder cyklisk skräpinsamling [#]_.

source: We want to expose our instance variables as attributes. There are a number of ways to do that. The simplest way is to define member definitions::
sv: Vi vill exponera våra instansvariabler som attribut. Det finns ett antal olika sätt att göra det på. Det enklaste sättet är att definiera medlemsdefinitioner::

source: static PyMemberDef Custom_members[] = { {"first", Py_T_OBJECT_EX, offsetof(CustomObject, first), 0, "first name"}, {"last", Py_T_OBJECT_EX, offsetof(CustomObject, last), 0, "last name"}, {"number", Py_T_INT, offsetof(CustomObject, number), 0, "custom number"}, {NULL} /* Sentinel */ };
sv: static PyMemberDef Custom_members[] = { {"first", Py_T_OBJECT_EX, offsetof(CustomObject, first), 0, "förnamn"}, {"last", Py_T_OBJECT_EX, offsetof(CustomObject, last), 0,"efternamn"}, {"last", Py_T_OBJECT_EX, offsetof(CustomObject, last), 0, "efternamn"}, {"number", Py_T_INT, offsetof(CustomObject, number), 0, "anpassat nummer"}, {NULL} /* Sentinel */ };

source: and put the definitions in the :c:member:`~PyTypeObject.tp_members` slot::
sv: och placera definitionerna i :c:member:`~PyTypeObject.tp_members` slot::

source: .tp_members = Custom_members,
sv: .tp_members = Anpassade_medlemmar,

source: Each member definition has a member name, type, offset, access flags and documentation string. See the :ref:`Generic-Attribute-Management` section below for details.
sv: Varje medlemsdefinition har ett medlemsnamn, typ, offset, åtkomstflaggor och dokumentationssträng. Se avsnittet :ref:`Generic-Attribute-Management` nedan för mer information.
