Repository: yeager/python-docs-sv
Catalog: extending/newtypes.po
Languages: sv

source: static void Trivial_dealloc(PyObject *op) { /* Clear weakrefs first before calling any destructors */ PyObject_ClearWeakRefs(op); /* ... remainder of destruction code omitted for brevity ... */ Py_TYPE(op)->tp_free(op); }
sv: statiskt void Trivial_dealloc(PyObject *op) { /* Rensa svagreferenser först innan du anropar några destruktorer */ PyObject_ClearWeakRefs(op); /* ... resten av destruktionskoden utelämnad för korthetens skull ... */ Py_TYPE(op)->tp_free(op); }

source: More Suggestions
sv: Fler förslag

source: In order to learn how to implement any specific method for your new data type, get the :term:`CPython` source code. Go to the :file:`Objects` directory, then search the C source files for ``tp_`` plus the function you want (for example, ``tp_richcompare``). You will find examples of the function you want to implement.
sv: För att lära dig hur du implementerar en specifik metod för din nya datatyp, hämta :term:`CPython` källkod. Gå till katalogen :file:`Objects` och sök sedan i C-källfilerna efter ``tp_`` plus den funktion du vill ha (t.ex. ``tp_richcompare``). Där hittar du exempel på den funktion som du vill implementera.

source: When you need to verify that an object is a concrete instance of the type you are implementing, use the :c:func:`PyObject_TypeCheck` function. A sample of its use might be something like the following::
sv: När du behöver verifiera att ett objekt är en konkret instans av den typ du implementerar, använd funktionen :c:func:`PyObject_TypeCheck`. Ett exempel på dess användning kan vara något i stil med följande::

source: if (!PyObject_TypeCheck(some_object, &MyType)) { PyErr_SetString(PyExc_TypeError, "arg #1 not a mything"); return NULL; }
sv: if (!PyObject_TypeCheck(some_object, &MyType)) { PyErr_SetString(PyExc_TypeError, "arg #1 inte en mything"); returnera NULL; }

source: Download CPython source releases.
sv: Ladda ner CPython källversioner.

source: The CPython project on GitHub, where the CPython source code is developed.
sv: CPython-projektet på GitHub, där källkoden för CPython utvecklas.

source: object
sv: objekt

source: deallocation
sv: avallokering

source: deallocation, object
sv: deallokering, objekt

source: finalization
sv: slutförande

source: finalization, of objects
sv: slutförande, av objekt

source: PyErr_Fetch (C function)
sv: PyErr_Fetch (C-funktion)

source: PyErr_Restore (C function)
sv: PyErr_Restore (C-funktion)

source: string
sv: sträng

source: object representation
sv: objektrepresentation

source: built-in function
sv: inbyggd funktion
