Repository: yeager/python-docs-sv
Catalog: extending/newtypes_tutorial.po
Languages: sv

source: Defining Extension Types: Tutorial
sv: Definiera typer av tillägg: Handledning

source: Python allows the writer of a C extension module to define new types that can be manipulated from Python code, much like the built-in :class:`str` and :class:`list` types. The code for all extension types follows a pattern, but there are some details that you need to understand before you can get started. This document is a gentle introduction to the topic.
sv: Python tillåter skribenten av en C-tilläggsmodul att definiera nya typer som kan manipuleras från Python-kod, ungefär som de inbyggda typerna :class:`str` och :class:`list`. Koden för alla tilläggstyper följer ett mönster, men det finns några detaljer som du behöver förstå innan du kan komma igång. Detta dokument är en lätt introduktion till ämnet.

source: The Basics
sv: Grunderna

source: The :term:`CPython` runtime sees all Python objects as variables of type :c:expr:`PyObject*`, which serves as a "base type" for all Python objects. The :c:type:`PyObject` structure itself only contains the object's :term:`reference count` and a pointer to the object's "type object". This is where the action is; the type object determines which (C) functions get called by the interpreter when, for instance, an attribute gets looked up on an object, a method called, or it is multiplied by another object. These C functions are called "type methods".
sv: Körningsprogrammet :term:`CPython` ser alla Python-objekt som variabler av typen :c:expr:`PyObject*`, som fungerar som en "bastyp" för alla Python-objekt. Själva :c:type:`PyObject`-strukturen innehåller bara objektets :term:`referensantal` och en pekare till objektets "typobjekt". Det är här det händer; typobjektet avgör vilka (C)-funktioner som anropas av tolken när t.ex. ett attribut slås upp på ett objekt, en metod anropas eller det multipliceras med ett annat objekt. Dessa C-funktioner kallas "typmetoder".

source: So, if you want to define a new extension type, you need to create a new type object.
sv: Om du vill definiera en ny förlängningstyp måste du alltså skapa ett nytt typobjekt.

source: This sort of thing can only be explained by example, so here's a minimal, but complete, module that defines a new type named :class:`!Custom` inside a C extension module :mod:`!custom`:
sv: Den här typen av saker kan bara förklaras med exempel, så här är en minimal, men komplett, modul som definierar en ny typ med namnet :class:`!Custom` inuti en C-tilläggsmodul :mod:`!custom`:

source: What we're showing here is the traditional way of defining *static* extension types. It should be adequate for most uses. The C API also allows defining heap-allocated extension types using the :c:func:`PyType_FromSpec` function, which isn't covered in this tutorial.
sv: Det vi visar här är det traditionella sättet att definiera *statiska* förlängningstyper. Det bör vara tillräckligt för de flesta användningsområden. C API tillåter också att definiera heap-allokerade tilläggstyper med hjälp av funktionen :c:func:`PyType_FromSpec`, som inte behandlas i denna handledning.

source: #define PY_SSIZE_T_CLEAN #include <Python.h> typedef struct { PyObject_HEAD /* Type-specific fields go here. */ } CustomObject; static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, }; static int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, // Just use this while using static types {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; static PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "custom", .m_doc = "Example module that creates an extension type.", .m_size = 0, .m_slots = custom_module_slots, }; PyMODINIT_FUNC PyInit_custom(void) { return PyModuleDef_Init(&custom_module); }
sv: #definiera PY_SSIZE_T_CLEAN #inkludera <Python.h> typedef struct { PyObject_Huvud /* Typspecifika fält hamnar här. */ } Anpassat objekt; statisk PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "anpassad.anpassad", .tp_doc = PyDoc_STR("Anpassade objekt"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, }; statisk int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { returnera -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, // Använd bara detta när du använder statiska typer {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; statisk PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "anpassad", .m_doc = "Exempelmodul som skapar en tilläggstyp.", .m_size = 0, .m_slots = anpassade_modul_slots, }; PyMODINIT_FUNC PyInit_custom(void) { return PyModuleDef_Init(&custom_module); }

source: Now that's quite a bit to take in at once, but hopefully bits will seem familiar from the previous chapter. This file defines three things:
sv: Nu är det en hel del att ta in på en gång, men förhoppningsvis kommer bitar att verka bekanta från föregående kapitel. Den här filen definierar tre saker:

source: What a :class:`!Custom` **object** contains: this is the ``CustomObject`` struct, which is allocated once for each :class:`!Custom` instance.
sv: Vad ett :class:`!Custom` **objekt** innehåller: detta är strukturen ``CustomObject``, som allokeras en gång för varje :class:`!Custom`-instans.

source: How the :class:`!Custom` **type** behaves: this is the ``CustomType`` struct, which defines a set of flags and function pointers that the interpreter inspects when specific operations are requested.
sv: Hur :class:`!Custom` **type** beter sig: detta är ``CustomType``-strukturen, som definierar en uppsättning flaggor och funktionspoängare som tolken inspekterar när specifika operationer begärs.

source: How to define and execute the :mod:`!custom` module: this is the ``PyInit_custom`` function and the associated ``custom_module`` struct for defining the module, and the ``custom_module_exec`` function to set up a fresh module object.
sv: Hur man definierar och kör :mod:`!custom`-modulen: detta är funktionen ``PyInit_custom`` och den tillhörande ``custom_module``-strukturen för att definiera modulen, och funktionen ``custom_module_exec`` för att skapa ett nytt modulobjekt.

source: The first bit is::
sv: Den första biten är::

source: typedef struct { PyObject_HEAD } CustomObject;
sv: typedef struct { PyObject_HEAD } Anpassat objekt;

source: This is what a Custom object will contain. ``PyObject_HEAD`` is mandatory at the start of each object struct and defines a field called ``ob_base`` of type :c:type:`PyObject`, containing a pointer to a type object and a reference count (these can be accessed using the macros :c:macro:`Py_TYPE` and :c:macro:`Py_REFCNT` respectively). The reason for the macro is to abstract away the layout and to enable additional fields in :ref:`debug builds <debug-build>`.
sv: Det här är vad ett Custom-objekt kommer att innehålla. ``PyObject_HEAD`` är obligatoriskt i början av varje objektstruktur och definierar ett fält som heter ``ob_base`` av typen :c:type:`PyObject`, som innehåller en pekare till ett typobjekt och ett referensantal (dessa kan nås med hjälp av makrot :c:macro:`Py_TYPE` respektive :c:macro:`Py_REFCNT`). Anledningen till makrot är att abstrahera bort layouten och att möjliggöra ytterligare fält i :ref:`debug builds <debug-build>`.

source: There is no semicolon above after the :c:macro:`PyObject_HEAD` macro. Be wary of adding one by accident: some compilers will complain.
sv: Det finns inget semikolon ovan efter makrot :c:macro:`PyObject_HEAD`. Var försiktig med att lägga till ett av misstag: vissa kompilatorer kommer att klaga.

source: Of course, objects generally store additional data besides the standard ``PyObject_HEAD`` boilerplate; for example, here is the definition for standard Python floats::
sv: Naturligtvis lagrar objekt i allmänhet ytterligare data utöver standard ``PyObject_HEAD``; här är till exempel definitionen för standard Python-flottor::

source: typedef struct { PyObject_HEAD double ob_fval; } PyFloatObject;
sv: typedef struct { PyObjekt_Huvud dubbel ob_fval; } PyFloatObject;

source: The second bit is the definition of the type object. ::
sv: Den andra biten är definitionen av typen objekt. ::

source: static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, };
sv: static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom.Custom", .tp_doc = PyDoc_STR("Anpassade objekt"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, };

source: We recommend using C99-style designated initializers as above, to avoid listing all the :c:type:`PyTypeObject` fields that you don't care about and also to avoid caring about the fields' declaration order.
sv: Vi rekommenderar att man använder C99-stil för angivna initialiserare enligt ovan, för att undvika att lista alla :c:type:`PyTypeObject`-fält som man inte bryr sig om och även för att undvika att bry sig om fältens deklarationsordning.

source: The actual definition of :c:type:`PyTypeObject` in :file:`object.h` has many more :ref:`fields <type-structs>` than the definition above. The remaining fields will be filled with zeros by the C compiler, and it's common practice to not specify them explicitly unless you need them.
sv: Den faktiska definitionen av :c:type:`PyTypeObject` i :file:`object.h` har många fler :ref:`fields <type-structs>` än definitionen ovan. De återstående fälten kommer att fyllas med nollor av C-kompilatorn, och det är vanligt att inte ange dem explicit om du inte behöver dem.

source: We're going to pick it apart, one field at a time::
sv: Vi kommer att plocka isär det, ett fält i taget::

source: This line is mandatory boilerplate to initialize the ``ob_base`` field mentioned above. ::
sv: Denna rad är en obligatorisk boilerplate för att initiera fältet ``ob_base`` som nämns ovan. ::

source: The name of our type. This will appear in the default textual representation of our objects and in some error messages, for example:
sv: Namnet på vår typ. Detta kommer att visas i standardtextrepresentationen av våra objekt och i vissa felmeddelanden, till exempel:

source: >>> "" + custom.Custom() Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: can only concatenate str (not "custom.Custom") to str
sv: &gt;&gt;&gt; "" + anpassad.anpassad() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: kan bara konkatenera str (inte "custom.Custom") till str

source: Note that the name is a dotted name that includes both the module name and the name of the type within the module. The module in this case is :mod:`!custom` and the type is :class:`!Custom`, so we set the type name to :class:`!custom.Custom`. Using the real dotted import path is important to make your type compatible with the :mod:`pydoc` and :mod:`pickle` modules. ::
sv: Observera att namnet är ett punktformat namn som innehåller både modulnamnet och namnet på typen i modulen. Modulen i det här fallet är :mod:`!custom` och typen är :class:`!Custom`, så vi sätter typnamnet till :class:`!custom.Custom`. Att använda den riktiga prickade importvägen är viktigt för att göra din typ kompatibel med modulerna :mod:`pydoc` och :mod:`pickle`. ::

source: This is so that Python knows how much memory to allocate when creating new :class:`!Custom` instances. :c:member:`~PyTypeObject.tp_itemsize` is only used for variable-sized objects and should otherwise be zero.
sv: Detta för att Python ska veta hur mycket minne som ska allokeras när nya :class:`!Custom`-instanser skapas. :c:member:`~PyTypeObject.tp_itemsize` används endast för objekt med variabel storlek och ska annars vara noll.

source: If you want your type to be subclassable from Python, and your type has the same :c:member:`~PyTypeObject.tp_basicsize` as its base type, you may have problems with multiple inheritance. A Python subclass of your type will have to list your type first in its :attr:`~type.__bases__`, or else it will not be able to call your type's :meth:`~object.__new__` method without getting an error. You can avoid this problem by ensuring that your type has a larger value for :c:member:`~PyTypeObject.tp_basicsize` than its base type does. Most of the time, this will be true anyway, because either your base type will be :class:`object`, or else you will be adding data members to your base type, and therefore increasing its size.
sv: Om du vill att din typ ska vara subklassbar från Python, och din typ har samma :c:member:`~PyTypeObject.tp_basicsize` som sin bastyp, kan du få problem med multipelt arv. En Python-subklass av din typ måste lista din typ först i sin :attr:`~type.__bases__`, annars kommer den inte att kunna anropa din typs :meth:`~object.__new__`-metod utan att få ett fel. Du kan undvika det här problemet genom att se till att din typ har ett större värde för :c:member:`~PyTypeObject.tp_basicsize` än vad dess bastyp har. För det mesta kommer detta att vara sant ändå, eftersom antingen din bastyp kommer att vara :class:`object`, eller så kommer du att lägga till datamedlemmar till din bastyp och därför öka dess storlek.

source: We set the class flags to :c:macro:`Py_TPFLAGS_DEFAULT`. ::
sv: Vi sätter klassflaggorna till :c:macro:`Py_TPFLAGS_DEFAULT`. ::

source: All types should include this constant in their flags. It enables all of the members defined until at least Python 3.3. If you need further members, you will need to OR the corresponding flags.
sv: Alla typer bör inkludera denna konstant i sina flaggor. Den aktiverar alla medlemmar som definierats fram till åtminstone Python 3.3. Om du behöver ytterligare medlemmar måste du OR motsvarande flaggor.

source: We provide a doc string for the type in :c:member:`~PyTypeObject.tp_doc`. ::
sv: Vi tillhandahåller en dokumentsträng för typen i :c:member:`~PyTypeObject.tp_doc`. ::

source: .tp_doc = PyDoc_STR("Custom objects"),
sv: .tp_doc = PyDoc_STR("Anpassade objekt"),

source: To enable object creation, we have to provide a :c:member:`~PyTypeObject.tp_new` handler. This is the equivalent of the Python method :meth:`~object.__new__`, but has to be specified explicitly. In this case, we can just use the default implementation provided by the API function :c:func:`PyType_GenericNew`. ::
sv: För att möjliggöra skapandet av objekt måste vi tillhandahålla en :c:member:`~PyTypeObject.tp_new`-hanterare. Detta är motsvarigheten till Python-metoden :meth:`~object.__new__`, men måste specificeras explicit. I det här fallet kan vi bara använda standardimplementeringen som tillhandahålls av API-funktionen :c:func:`PyType_GenericNew`. ::

source: Everything else in the file should be familiar, except for some code in :c:func:`!custom_module_exec`::
sv: Allt annat i filen bör vara bekant, förutom en del kod i :c:func:`!custom_module_exec`::

source: if (PyType_Ready(&CustomType) < 0) { return -1; }
sv: if (PyType_Ready(&CustomType) < 0) { returnera -1; }

source: This initializes the :class:`!Custom` type, filling in a number of members to the appropriate default values, including :c:member:`~PyObject.ob_type` that we initially set to ``NULL``. ::
sv: Detta initierar typen :class:`!Custom` och fyller i ett antal medlemmar med lämpliga standardvärden, inklusive :c:member:`~PyObject.ob_type` som vi ursprungligen satte till ``NULL``. ::

source: This adds the type to the module dictionary. This allows us to create :class:`!Custom` instances by calling the :class:`!Custom` class:
sv: Detta lägger till typen i modulens ordlista. Detta gör att vi kan skapa :class:`!Custom`-instanser genom att anropa :class:`!Custom`-klassen:

source: That's it! All that remains is to build it; put the above code in a file called :file:`custom.c`,
sv: Nu är det klart! Allt som återstår är att bygga den; lägg ovanstående kod i en fil som heter :file:`custom.c`,

source: [build-system] requires = ["setuptools"] build-backend = "setuptools.build_meta" [project] name = "custom" version = "1"
sv: [byggsystem] kräver = ["setuptools"] bygg-backend = "setuptools.build_meta" [projekt] namn = "anpassad" version = "1"

source: in a file called :file:`pyproject.toml`, and
sv: i en fil som heter :file:`pyproject.toml`, och

source: from setuptools import Extension, setup setup(ext_modules=[Extension("custom", ["custom.c"])])
sv: from setuptools import Tillägg, setup setup(ext_modules=[Tillägg("custom", ["custom.c"]))])

source: in a file called :file:`setup.py`; then typing
sv: i en fil som heter :file:`setup.py`; sedan skriver du

source: $ python -m pip install .
sv: $ python -m pip installera .

source: in a shell should produce a file :file:`custom.so` in a subdirectory and install it; now fire up Python --- you should be able to ``import custom`` and play around with ``Custom`` objects.
sv: i ett skal bör producera en fil :file:`custom.so` i en underkatalog och installera den; starta nu Python --- du bör kunna ``importera custom`` och leka med ``Custom``-objekt.

source: That wasn't so hard, was it?
sv: Det var väl inte så svårt, eller hur?

source: Of course, the current Custom type is pretty uninteresting. It has no data and doesn't do anything. It can't even be subclassed.
sv: Naturligtvis är den nuvarande Custom-typen ganska ointressant. Den har inga data och gör ingenting. Den kan inte ens underklassificeras.

source: Adding data and methods to the Basic example
sv: Lägga till data och metoder i Basic-exemplet

source: Let's extend the basic example to add some data and methods. Let's also make the type usable as a base class. We'll create a new module, :mod:`!custom2` that adds these capabilities:
sv: Låt oss utöka grundexemplet för att lägga till data och metoder. Låt oss också göra typen användbar som basklass. Vi skapar en ny modul, :mod:`!custom2`, som lägger till dessa funktioner:
