Repository: yeager/python-docs-sv
Catalog: extending/newtypes_tutorial.po
Languages: sv

source: The :c:type:`PyTypeObject` struct supports a :c:member:`~PyTypeObject.tp_base` specifying the type's concrete base class. Due to cross-platform compiler issues, you can't fill that field directly with a reference to :c:type:`PyList_Type`; it should be done in the :c:data:`Py_mod_exec` function::
sv: Strukturen :c:type:`PyTypeObject` stöder en :c:member:`~PyTypeObject.tp_base` som anger typens konkreta basklass. På grund av kompilatorproblem mellan plattformar kan du inte fylla i det fältet direkt med en referens till :c:type:`PyList_Type`; det bör göras i funktionen :c:data:`Py_mod_exec`::

source: static int sublist_module_exec(PyObject *m) { SubListType.tp_base = &PyList_Type; if (PyType_Ready(&SubListType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "SubList", (PyObject *) &SubListType) < 0) { return -1; } return 0; }
sv: statisk int sublist_module_exec(PyObject *m) { SubListType.tp_base = &PyList_Type; if (PyType_Ready(&SubListType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "SubList", (PyObject *) &SubListType) < 0) { return -1; } return 0; }

source: Before calling :c:func:`PyType_Ready`, the type structure must have the :c:member:`~PyTypeObject.tp_base` slot filled in. When we are deriving an existing type, it is not necessary to fill out the :c:member:`~PyTypeObject.tp_alloc` slot with :c:func:`PyType_GenericNew` -- the allocation function from the base type will be inherited.
sv: Innan :c:func:`PyType_Ready` anropas måste typstrukturen ha :c:member:`~PyTypeObject.tp_base` slot ifylld. När vi härleder en befintlig typ är det inte nödvändigt att fylla i :c:member:`~PyTypeObject.tp_alloc` med :c:func:`PyType_GenericNew` -- allokeringsfunktionen från bastypen kommer att ärvas.

source: After that, calling :c:func:`PyType_Ready` and adding the type object to the module is the same as with the basic :class:`!Custom` examples.
sv: Därefter anropas :c:func:`PyType_Ready` och typobjektet läggs till i modulen på samma sätt som i de grundläggande :class:`!Custom`-exemplen.

source: Footnotes
sv: Fotnoter

source: This is true when we know that the object is a basic type, like a string or a float.
sv: Detta är sant när vi vet att objektet är en grundläggande typ, som en sträng eller en float.

source: We relied on this in the :c:member:`~PyTypeObject.tp_dealloc` handler in this example, because our type doesn't support garbage collection.
sv: Vi förlitade oss på detta i :c:member:`~PyTypeObject.tp_dealloc`-hanteraren i det här exemplet, eftersom vår typ inte stöder garbage collection.

source: We now know that the first and last members are strings, so perhaps we could be less careful about decrementing their reference counts, however, we accept instances of string subclasses. Even though deallocating normal strings won't call back into our objects, we can't guarantee that deallocating an instance of a string subclass won't call back into our objects.
sv: Vi vet nu att den första och den sista medlemmen är strängar, så vi kanske kan vara mindre försiktiga med att minska deras referensantal, men vi accepterar instanser av strängunderklasser. Även om deallokering av normala strängar inte kommer att ringa tillbaka till våra objekt, kan vi inte garantera att deallokering av en instans av en strängunderklass inte kommer att anropa tillbaka till våra objekt.

source: Also, even with our attributes restricted to strings instances, the user could pass arbitrary :class:`str` subclasses and therefore still create reference cycles.
sv: Även med våra attribut begränsade till stränginstanser kan användaren skicka godtyckliga :class:`str`-subklasser och därför fortfarande skapa referenscykler.
