Repository: yeager/python-docs-sv
Catalog: extending/newtypes_tutorial.po
Languages: sv

source: In the second version of the :class:`!Custom` example, we allowed any kind of object to be stored in the :attr:`!first` or :attr:`!last` attributes [#]_. Besides, in the second and third versions, we allowed subclassing :class:`!Custom`, and subclasses may add arbitrary attributes. For any of those two reasons, :class:`!Custom` objects can participate in cycles:
sv: I den andra versionen av exemplet :class:`!Custom` tillät vi att alla typer av objekt lagrades i attributen :attr:`!first` eller :attr:`!last` [#]_. Dessutom, i den andra och tredje versionen, tillät vi underklassning av :class:`!Custom`, och underklasser kan lägga till godtyckliga attribut. Av någon av dessa två anledningar kan :class:`!Custom`-objekt delta i cykler:

source: >>> import custom3 >>> class Derived(custom3.Custom): pass ... >>> n = Derived() >>> n.some_attribute = n
sv: >>> import custom3 >>> class Avledda(custom3.Custom): pass ... >>> n = Avledd() >>> n.some_attribute = n

source: To allow a :class:`!Custom` instance participating in a reference cycle to be properly detected and collected by the cyclic GC, our :class:`!Custom` type needs to fill two additional slots and to enable a flag that enables these slots:
sv: För att en :class:`!Custom`-instans som deltar i en referenscykel ska kunna upptäckas och samlas in på rätt sätt av den cykliska GC:n, måste vår :class:`!Custom`-typ fylla två ytterligare slots och aktivera en flagga som aktiverar dessa slots:

source: #define PY_SSIZE_T_CLEAN #include <Python.h> #include <stddef.h> /* for offsetof() */ typedef struct { PyObject_HEAD PyObject *first; /* first name */ PyObject *last; /* last name */ int number; } CustomObject; static int Custom_traverse(PyObject *op, visitproc visit, void *arg) { CustomObject *self = (CustomObject *) op; Py_VISIT(self->first); Py_VISIT(self->last); return 0; } static int Custom_clear(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_CLEAR(self->first); Py_CLEAR(self->last); return 0; } static void Custom_dealloc(PyObject *op) { PyObject_GC_UnTrack(op); (void)Custom_clear(op); Py_TYPE(op)->tp_free(op); } static PyObject * Custom_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *) self; } static int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|UUi", kwlist, &first, &last, &self->number)) return -1; if (first) { Py_SETREF(self->first, Py_NewRef(first)); } if (last) { Py_SETREF(self->last, Py_NewRef(last)); } return 0; } static PyMemberDef Custom_members[] = { {"number", Py_T_INT, offsetof(CustomObject, number), 0, "custom number"}, {NULL} /* Sentinel */ }; static PyObject * Custom_getfirst(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->first); } static int Custom_setfirst(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the first attribute"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "The first attribute value must be a string"); return -1; } Py_XSETREF(self->first, Py_NewRef(value)); return 0; } static PyObject * Custom_getlast(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->last); } static int Custom_setlast(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (value == NULL) { PyErr_SetString(PyExc_TypeError, "Cannot delete the last attribute"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "The last attribute value must be a string"); return -1; } Py_XSETREF(self->last, Py_NewRef(value)); return 0; } static PyGetSetDef Custom_getsetters[] = { {"first", Custom_getfirst, Custom_setfirst, "first name", NULL}, {"last", Custom_getlast, Custom_setlast, "last name", NULL}, {NULL} /* Sentinel */ }; static PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; return PyUnicode_FromFormat("%S %S", self->first, self->last); } static PyMethodDef Custom_methods[] = { {"name", Custom_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ }; static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom4.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE | Py_TPFLAGS_HAVE_GC, .tp_new = Custom_new, .tp_init = Custom_init, .tp_dealloc = Custom_dealloc, .tp_traverse = Custom_traverse, .tp_clear = Custom_clear, .tp_members = Custom_members, .tp_methods = Custom_methods, .tp_getset = Custom_getsetters, }; static int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; static PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "custom4", .m_doc = "Example module that creates an extension type.", .m_size = 0, .m_slots = custom_module_slots, }; PyMODINIT_FUNC PyInit_custom4(void) { return PyModuleDef_Init(&custom_module); }
sv: #definiera PY_SSIZE_T_CLEAN #include <Python.h> #include <stddef.h> /* för offsetof() #include <stddef.h> /* för offsetof() */ typedef struct { PyObject_Huvud PyObject *first; /* förnamn */ PyObject *last; /* efternamn */ int nummer; } CustomObject; statisk int Custom_traverse(PyObject *op, visitproc visit, void *arg) { CustomObject *self = (CustomObject *) op; Py_VISIT(själv>första); Py_VISIT(self->last); return 0; } statisk int Custom_clear(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_CLEAR(själv>första); Py_CLEAR(self->last); return 0; } statiskt void Custom_dealloc(PyObject *op) { PyObject_GC_UnTrack(op); (void)Custom_clear(op); Py_TYPE(op)->tp_free(op); } statisk PyObject* Custom_new(PyTypeObject Custom_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { CustomObject *self; self = (CustomObject *) type->tp_alloc(type, 0); if (self != NULL) { self->first = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->first == NULL) { Py_DECREF(self); returnera NULL; } self->last = Py_GetConstant(Py_CONSTANT_EMPTY_STR); if (self->last == NULL) { Py_DECREF(self); returnera NULL; } self->number = 0; } return (PyObject *) self; } statisk int Custom_init(PyObject *op, PyObject *args, PyObject *kwds) { CustomObject *self = (CustomObject *) op; static char *kwlist[] = {"first", "last", "number", NULL}; PyObject *first = NULL, *last = NULL; if (!PyArg_ParseTupleAndKeywords(args, kwds, "|UUUi", kwlist, &first, &last, &själv->nummer)) return -1; if (första) { Py_SETREF(self->first, Py_NewRef(first)); } if (last) { Py_SETREF(self->last, Py_NewRef(last)); } return 0; } static PyMemberDef Custom_members[] = { {"number", Py_T_INT, offsetof(CustomObject, number), 0, "anpassat nummer"}, {NULL} /* Sentinel */ }; statiskt PyObject * Custom_getfirst(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->first); } statisk int Custom_setfirst(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (värde == NULL) { PyErr_SetString(PyExc_TypeError, "Det går inte att ta bort det första attributet"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "Det första attributvärdet måste vara en sträng"); return -1; } Py_XSETREF(self->first, Py_NewRef(value)); return 0; } statiskt PyObject * Custom_getlast(PyObject *op, void *closure) { CustomObject *self = (CustomObject *) op; return Py_NewRef(self->last); } statisk int Custom_setlast(PyObject *op, PyObject *value, void *closure) { CustomObject *self = (CustomObject *) op; if (värde == NULL) { PyErr_SetString(PyExc_TypeError, "Det går inte att ta bort det sista attributet"); return -1; } if (!PyUnicode_Check(value)) { PyErr_SetString(PyExc_TypeError, "Det sista attributvärdet måste vara en sträng"); return -1; } Py_XSETREF(self->last, Py_NewRef(value)); return 0; } static PyGetSetDef Custom_getsetters[] = { {"first", Custom_getfirst, Custom_setfirst, "förnamn", NULL}, {"last", Custom_getlast, Custom_setlast, "efternamn", NULL}, {NULL} /* Sentinel */ }; statiskt PyObject * Custom_name(PyObject *op, PyObject *Py_UNUSED(dummy)) { CustomObject *self = (CustomObject *) op; return PyUnicode_FromFormat("%S %S", self->first, self->last); } static PyMethodDef Custom_methods[] = { {"name", Eget_namn, METH_NOARGS, "Returnera namnet genom att kombinera för- och efternamn" }, {NULL} /* Sentinel */ }; statisk PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom4.Custom", .tp_doc = PyDoc_STR("Anpassade objekt"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE | Py_TPFLAGS_HAVE_GC, .tp_new = Anpassad_ny, .tp_init = Anpassad_init, .tp_dealloc = Custom_dealloc, .tp_traverse = Egen_traverse, .tp_clear = Egen_clear, .tp_members = Anpassad_members, .tp_methods = Egna_metoder, .tp_getset = Egna_getsetters, }; statisk int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { returnera -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; statisk PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "anpassad4", .m_doc = "Exempelmodul som skapar en tilläggstyp.", .m_size = 0, .m_slots = anpassade_modul_slots, }; PyMODINIT_FUNC PyInit_custom4(void) { return PyModuleDef_Init(&custom_module); }

source: First, the traversal method lets the cyclic GC know about subobjects that could participate in cycles::
sv: För det första låter traversalmetoden den cykliska GC:n veta om underobjekt som kan delta i cykler::

source: static int Custom_traverse(PyObject *op, visitproc visit, void *arg) { CustomObject *self = (CustomObject *) op; int vret; if (self->first) { vret = visit(self->first, arg); if (vret != 0) return vret; } if (self->last) { vret = visit(self->last, arg); if (vret != 0) return vret; } return 0; }
sv: statisk int Custom_traverse(PyObject *op, visitproc visit, void *arg) { CustomObject *self = (CustomObject *) op; int vret; if (själv>första) { vret = visit(self->first, arg); if (vret != 0) returnera vret; } if (själv>sist) { vret = besök(själv>sist, arg); om (vret != 0) returnera vret; } return 0; }

source: For each subobject that can participate in cycles, we need to call the :c:func:`!visit` function, which is passed to the traversal method. The :c:func:`!visit` function takes as arguments the subobject and the extra argument *arg* passed to the traversal method. It returns an integer value that must be returned if it is non-zero.
sv: För varje subobjekt som kan delta i cykler måste vi anropa funktionen :c:func:`!visit`, som skickas till traversalmetoden. Funktionen :c:func:`!visit` tar som argument subobjektet och det extra argumentet *arg* som skickas till traversalmetoden. Den returnerar ett heltalsvärde som måste returneras om det inte är noll.

source: Python provides a :c:func:`Py_VISIT` macro that automates calling visit functions. With :c:func:`Py_VISIT`, we can minimize the amount of boilerplate in ``Custom_traverse``::
sv: Python tillhandahåller ett :c:func:`Py_VISIT`-makro som automatiserar anrop av visitfunktioner. Med :c:func:`Py_VISIT` kan vi minimera mängden boilerplate i ``Custom_traverse``::

source: static int Custom_traverse(PyObject *op, visitproc visit, void *arg) { CustomObject *self = (CustomObject *) op; Py_VISIT(self->first); Py_VISIT(self->last); return 0; }
sv: statisk int Custom_traverse(PyObject *op, visitproc visit, void *arg) { CustomObject *self = (CustomObject *) op; Py_VISIT(själv>första); Py_VISIT(self->last); return 0; }

source: The :c:member:`~PyTypeObject.tp_traverse` implementation must name its arguments exactly *visit* and *arg* in order to use :c:func:`Py_VISIT`.
sv: Implementationen :c:member:`~PyTypeObject.tp_traverse` måste namnge sina argument exakt *visit* och *arg* för att kunna använda :c:func:`Py_VISIT`.

source: Second, we need to provide a method for clearing any subobjects that can participate in cycles::
sv: För det andra måste vi tillhandahålla en metod för att rensa alla underobjekt som kan delta i cycles::

source: static int Custom_clear(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_CLEAR(self->first); Py_CLEAR(self->last); return 0; }
sv: statisk int Custom_clear(PyObject *op) { CustomObject *self = (CustomObject *) op; Py_CLEAR(själv>första); Py_CLEAR(self->last); return 0; }

source: Notice the use of the :c:func:`Py_CLEAR` macro. It is the recommended and safe way to clear data attributes of arbitrary types while decrementing their reference counts. If you were to call :c:func:`Py_XDECREF` instead on the attribute before setting it to ``NULL``, there is a possibility that the attribute's destructor would call back into code that reads the attribute again (*especially* if there is a reference cycle).
sv: Lägg märke till användningen av makrot :c:func:`Py_CLEAR`. Det är det rekommenderade och säkra sättet att rensa dataattribut av godtyckliga typer samtidigt som deras referensantal dekrementeras. Om du istället skulle anropa :c:func:`Py_XDECREF` på attributet innan du sätter det till ``NULL``, finns det en möjlighet att attributets destruktor skulle anropa tillbaka till kod som läser attributet igen (*särskilt* om det finns en referenscykel).

source: You could emulate :c:func:`Py_CLEAR` by writing::
sv: Du kan emulera :c:func:`Py_CLEAR` genom att skriva::

source: PyObject *tmp; tmp = self->first; self->first = NULL; Py_XDECREF(tmp);
sv: PyObject *tmp; tmp = själv>första; self->first = NULL; Py_XDECREF(tmp);

source: Nevertheless, it is much easier and less error-prone to always use :c:func:`Py_CLEAR` when deleting an attribute. Don't try to micro-optimize at the expense of robustness!
sv: Det är dock mycket enklare och mindre felbenäget att alltid använda :c:func:`Py_CLEAR` när man tar bort ett attribut. Försök inte mikrooptimera på bekostnad av robusthet!

source: The deallocator ``Custom_dealloc`` may call arbitrary code when clearing attributes. It means the circular GC can be triggered inside the function. Since the GC assumes reference count is not zero, we need to untrack the object from the GC by calling :c:func:`PyObject_GC_UnTrack` before clearing members. Here is our reimplemented deallocator using :c:func:`PyObject_GC_UnTrack` and ``Custom_clear``::
sv: Deallokatorn ``Custom_dealloc`` kan anropa godtycklig kod när attribut rensas. Det betyder att den cirkulära GC kan utlösas inuti funktionen. Eftersom GC antar att referensantalet inte är noll måste vi spåra objektet från GC genom att anropa :c:func:`PyObject_GC_UnTrack` innan vi rensar medlemmar. Här är vår reimplementerade deallocator som använder :c:func:`PyObject_GC_UnTrack` och ``Custom_clear``::

source: static void Custom_dealloc(PyObject *op) { PyObject_GC_UnTrack(op); (void)Custom_clear(op); Py_TYPE(op)->tp_free(op); }
sv: statiskt void Custom_dealloc(PyObject *op) { PyObject_GC_UnTrack(op); (void)Custom_clear(op); Py_TYPE(op)->tp_free(op); }

source: Finally, we add the :c:macro:`Py_TPFLAGS_HAVE_GC` flag to the class flags::
sv: Slutligen lägger vi till flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` i klassen flags::

source: That's pretty much it. If we had written custom :c:member:`~PyTypeObject.tp_alloc` or :c:member:`~PyTypeObject.tp_free` handlers, we'd need to modify them for cyclic garbage collection. Most extensions will use the versions automatically provided.
sv: Det är i stort sett allt. Om vi hade skrivit egna :c:member:`~PyTypeObject.tp_alloc`- eller :c:member:`~PyTypeObject.tp_free`-hanterare, skulle vi behöva modifiera dem för cyklisk skräpinsamling. De flesta tillägg kommer att använda de versioner som automatiskt tillhandahålls.

source: Subclassing other types
sv: Underklassificering av andra typer

source: It is possible to create new extension types that are derived from existing types. It is easiest to inherit from the built in types, since an extension can easily use the :c:type:`PyTypeObject` it needs. It can be difficult to share these :c:type:`PyTypeObject` structures between extension modules.
sv: Det är möjligt att skapa nya tilläggstyper som härrör från befintliga typer. Det är lättast att ärva från de inbyggda typerna, eftersom ett tillägg enkelt kan använda de :c:type:`PyTypeObject` som det behöver. Det kan vara svårt att dela dessa :c:type:`PyTypeObject`-strukturer mellan tilläggsmoduler.

source: In this example we will create a :class:`!SubList` type that inherits from the built-in :class:`list` type. The new type will be completely compatible with regular lists, but will have an additional :meth:`!increment` method that increases an internal counter:
sv: I det här exemplet skapar vi en :class:`!SubList`-typ som ärver från den inbyggda :class:`list`-typen. Den nya typen kommer att vara helt kompatibel med vanliga listor, men kommer att ha en ytterligare :meth:`!increment`-metod som ökar en intern räknare:

source: #define PY_SSIZE_T_CLEAN #include <Python.h> typedef struct { PyListObject list; int state; } SubListObject; static PyObject * SubList_increment(PyObject *op, PyObject *Py_UNUSED(dummy)) { SubListObject *self = (SubListObject *) op; self->state++; return PyLong_FromLong(self->state); } static PyMethodDef SubList_methods[] = { {"increment", SubList_increment, METH_NOARGS, PyDoc_STR("increment state counter")}, {NULL}, }; static int SubList_init(PyObject *op, PyObject *args, PyObject *kwds) { SubListObject *self = (SubListObject *) op; if (PyList_Type.tp_init(op, args, kwds) < 0) return -1; self->state = 0; return 0; } static PyTypeObject SubListType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "sublist.SubList", .tp_doc = PyDoc_STR("SubList objects"), .tp_basicsize = sizeof(SubListObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, .tp_init = SubList_init, .tp_methods = SubList_methods, }; static int sublist_module_exec(PyObject *m) { SubListType.tp_base = &PyList_Type; if (PyType_Ready(&SubListType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "SubList", (PyObject *) &SubListType) < 0) { return -1; } return 0; } static PyModuleDef_Slot sublist_module_slots[] = { {Py_mod_exec, sublist_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; static PyModuleDef sublist_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "sublist", .m_doc = "Example module that creates an extension type.", .m_size = 0, .m_slots = sublist_module_slots, }; PyMODINIT_FUNC PyInit_sublist(void) { return PyModuleDef_Init(&sublist_module); }
sv: #definiera PY_SSIZE_T_CLEAN #inkludera <Python.h> typedef struct { PyListObject-lista; int tillstånd; } SubListObject; statiskt PyObject * SubList_increment(PyObject *op, PyObject *Py_UNUSED(dummy)) { SubListObject *self = (SubListObject *) op; self->state++; return PyLong_FromLong(self->state); } static PyMethodDef SubList_methods[] = { {"increment", SubList_increment, METH_NOARGS, PyDoc_STR("inkrementera tillståndsräknare")}, {NULL}, }; statisk int SubList_init(PyObject *op, PyObject *args, PyObject *kwds) { SubListObject *self = (SubListObject *) op; if (PyList_Type.tp_init(op, args, kwds) < 0) return -1; self->state = 0; return 0; } statiskt PyTypeObject SubListType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "sublist.SubList", .tp_doc = PyDoc_STR("SubList-objekt"), .tp_basicsize = sizeof(SubListObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, .tp_init = SubList_init, .tp_methods = SubList_methods, }; statisk int sublist_module_exec(PyObject *m) { SubListType.tp_base = &PyList_Type; if (PyType_Ready(&SubListType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "SubList", (PyObject *) &SubListType) < 0) { return -1; } return 0; } static PyModuleDef_Slot sublist_module_slots[] = { {Py_mod_exec, sublist_module_exec}, {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; statisk PyModuleDef sublist_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "sublist", .m_doc = "Exempelmodul som skapar en tilläggstyp.", .m_size = 0, .m_slots = sublist_module_slots, }; PyMODINIT_FUNC PyInit_sublist(void) { return PyModuleDef_Init(&sublist_module); }

source: As you can see, the source code closely resembles the :class:`!Custom` examples in previous sections. We will break down the main differences between them. ::
sv: Som du kan se är källkoden mycket lik :class:`!Custom`-exemplen i tidigare avsnitt. Vi kommer att bryta ner de viktigaste skillnaderna mellan dem. ::

source: typedef struct { PyListObject list; int state; } SubListObject;
sv: typedef struct { PyListObject lista; int tillstånd; } SubListObject;

source: The primary difference for derived type objects is that the base type's object structure must be the first value. The base type will already include the :c:func:`PyObject_HEAD` at the beginning of its structure.
sv: Den primära skillnaden för objekt av härledd typ är att objektstrukturen för bastypen måste vara det första värdet. Bastypen kommer redan att innehålla :c:func:`PyObject_HEAD` i början av sin struktur.

source: When a Python object is a :class:`!SubList` instance, its ``PyObject *`` pointer can be safely cast to both ``PyListObject *`` and ``SubListObject *``::
sv: När ett Python-objekt är en :class:`!SubList`-instans, kan dess ``PyObject *``-pekare säkert kastas till både ``PyListObject *`` och ``SubListObject *``::

source: static int SubList_init(PyObject *op, PyObject *args, PyObject *kwds) { SubListObject *self = (SubListObject *) op; if (PyList_Type.tp_init(op, args, kwds) < 0) return -1; self->state = 0; return 0; }
sv: statisk int SubList_init(PyObject *op, PyObject *args, PyObject *kwds) { SubListObject *self = (SubListObject *) op; if (PyList_Type.tp_init(op, args, kwds) < 0) return -1; self->state = 0; return 0; }

source: We see above how to call through to the :meth:`~object.__init__` method of the base type.
sv: Vi ser ovan hur man anropar till :meth:`~object.__init__`-metoden för bastypen.

source: This pattern is important when writing a type with custom :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_dealloc` members. The :c:member:`~PyTypeObject.tp_new` handler should not actually create the memory for the object with its :c:member:`~PyTypeObject.tp_alloc`, but let the base class handle it by calling its own :c:member:`~PyTypeObject.tp_new`.
sv: Detta mönster är viktigt när man skriver en typ med anpassade :c:member:`~PyTypeObject.tp_new` och :c:member:`~PyTypeObject.tp_dealloc`-medlemmar. Hanteraren :c:member:`~PyTypeObject.tp_new` ska inte skapa minnet för objektet med sin :c:member:`~PyTypeObject.tp_alloc`, utan låta basklassen hantera det genom att anropa sin egen :c:member:`~PyTypeObject.tp_new`.
