Repository: yeager/python-docs-sv
Catalog: reference/introduction.po
Languages: sv

source: Introduction
sv: Introduktion

source: This reference manual describes the Python programming language. It is not intended as a tutorial.
sv: Denna referenshandbok beskriver programmeringsspråket Python. Den är inte avsedd som en handledning.

source: While I am trying to be as precise as possible, I chose to use English rather than formal specifications for everything except syntax and lexical analysis. This should make the document more understandable to the average reader, but will leave room for ambiguities. Consequently, if you were coming from Mars and tried to re-implement Python from this document alone, you might have to guess things and in fact you would probably end up implementing quite a different language. On the other hand, if you are using Python and wonder what the precise rules about a particular area of the language are, you should definitely be able to find them here. If you would like to see a more formal definition of the language, maybe you could volunteer your time --- or invent a cloning machine :-).
sv: Även om jag försöker vara så exakt som möjligt har jag valt att använda svenska snarare än formella specifikationer för allt utom syntax och lexikal analys. Detta bör göra dokumentet mer begripligt för den genomsnittlige läsaren, men lämnar utrymme för tvetydigheter. Om man kommer från Mars och försöker återimplementera Python enbart med hjälp av detta dokument, kan man därför bli tvungen att gissa sig till saker och ting, och i själva verket skulle man förmodligen implementera ett helt annat språk. Å andra sidan, om du använder Python och undrar vad de exakta reglerna för ett visst område av språket är, bör du definitivt kunna hitta dem här. Om du skulle vilja se en mer formell definition av språket, kanske du skulle kunna erbjuda din tid --- eller uppfinna en kloningsmaskin :-).

source: It is dangerous to add too many implementation details to a language reference document --- the implementation may change, and other implementations of the same language may work differently. On the other hand, CPython is the one Python implementation in widespread use (although alternate implementations continue to gain support), and its particular quirks are sometimes worth being mentioned, especially where the implementation imposes additional limitations. Therefore, you'll find short "implementation notes" sprinkled throughout the text.
sv: Det är farligt att lägga till för många implementeringsdetaljer i ett språkreferensdokument --- implementeringen kan ändras och andra implementeringar av samma språk kan fungera annorlunda. Å andra sidan är CPython den Python-implementation som används mest (även om alternativa implementationer fortsätter att få stöd), och dess speciella egenheter är ibland värda att nämnas, särskilt när implementationen innebär ytterligare begränsningar. Därför kommer du att hitta korta "implementeringsanteckningar" utspridda i hela texten.

source: Every Python implementation comes with a number of built-in and standard modules. These are documented in :ref:`library-index`. A few built-in modules are mentioned when they interact in a significant way with the language definition.
sv: Varje Python-implementation levereras med ett antal inbyggda moduler och standardmoduler. Dessa finns dokumenterade i :ref:`library-index`. Några inbyggda moduler nämns när de interagerar på ett betydande sätt med språkdefinitionen.

source: Alternate Implementations
sv: Alternativa implementeringar

source: Though there is one Python implementation which is by far the most popular, there are some alternate implementations which are of particular interest to different audiences.
sv: Även om det finns en Python-implementering som är den absolut mest populära, finns det några alternativa implementeringar som är av särskilt intresse för olika målgrupper.

source: Known implementations include:
sv: Kända implementeringar inkluderar:

source: This is the original and most-maintained implementation of Python, written in C. New language features generally appear here first.
sv: Detta är den ursprungliga och mest underhållna implementeringen av Python, skriven i C. Nya språkfunktioner visas vanligtvis här först.

source: Python implemented in Java. This implementation can be used as a scripting language for Java applications, or can be used to create applications using the Java class libraries. It is also often used to create tests for Java libraries. More information can be found at `the Jython website <https://www.jython.org/>`_.
sv: Python implementerat i Java. Denna implementation kan användas som ett skriptspråk för Java-applikationer eller för att skapa applikationer med hjälp av Javas klassbibliotek. Det används också ofta för att skapa tester för Java-bibliotek. Mer information finns på `the Jython website <https://www.jython.org/>`_.

source: Python for .NET
sv: Python för .NET

source: This implementation actually uses the CPython implementation, but is a managed .NET application and makes .NET libraries available. It was created by Brian Lloyd. For more information, see the `Python for .NET home page <https://pythonnet.github.io/>`_.
sv: Den här implementationen använder faktiskt CPython-implementationen, men är en hanterad .NET-applikation och gör .NET-bibliotek tillgängliga. Den har skapats av Brian Lloyd. Mer information finns på hemsidan för `Python for .NET <https://pythonnet.github.io/>`_.

source: An alternate Python for .NET. Unlike Python.NET, this is a complete Python implementation that generates IL, and compiles Python code directly to .NET assemblies. It was created by Jim Hugunin, the original creator of Jython. For more information, see `the IronPython website <https://ironpython.net/>`_.
sv: En alternativ Python för .NET. Till skillnad från Python.NET är detta en komplett Python-implementering som genererar IL och kompilerar Python-kod direkt till .NET-assemblies. Den skapades av Jim Hugunin, den ursprungliga skaparen av Jython. För mer information, se IronPythons webbplats <https://ironpython.net/>`_.

source: An implementation of Python written completely in Python. It supports several advanced features not found in other implementations like stackless support and a Just in Time compiler. One of the goals of the project is to encourage experimentation with the language itself by making it easier to modify the interpreter (since it is written in Python). Additional information is available on `the PyPy project's home page <https://pypy.org/>`_.
sv: En implementering av Python som är helt skriven i Python. Den stöder flera avancerade funktioner som inte finns i andra implementationer, till exempel stöd för stackless och en Just in Time-kompilator. Ett av målen med projektet är att uppmuntra experimenterande med själva språket genom att göra det lättare att modifiera tolken (eftersom den är skriven i Python). Ytterligare information finns på PyPy-projektets hemsida <https://pypy.org/>`_.

source: Each of these implementations varies in some way from the language as documented in this manual, or introduces specific information beyond what's covered in the standard Python documentation. Please refer to the implementation-specific documentation to determine what else you need to know about the specific implementation you're using.
sv: Var och en av dessa implementationer skiljer sig på något sätt från språket som det dokumenteras i den här handboken, eller introducerar specifik information utöver vad som täcks av standarddokumentationen för Python. Se den implementationsspecifika dokumentationen för att avgöra vad mer du behöver veta om den specifika implementationen du använder.

source: The descriptions of lexical analysis and syntax use a grammar notation that is a mixture of `EBNF <https://en.wikipedia.org/wiki/Extended_Backus%E2%80%93Naur_form>`_ and `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_. For example:
sv: I beskrivningarna av lexikal analys och syntax används en grammatisk notation som är en blandning av `EBNF <https://en.wikipedia.org/wiki/Extended_Backus%E2%80%93Naur_form>`_ och `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_. Till exempel

source: In this example, the first line says that a ``name`` is a ``letter`` followed by a sequence of zero or more ``letter``\ s, ``digit``\ s, and underscores. A ``letter`` in turn is any of the single characters ``'a'`` through ``'z'`` and ``A`` through ``Z``; a ``digit`` is a single character from ``0`` to ``9``.
sv: I detta exempel säger den första raden att ett "namn" är en "bokstav" följd av en sekvens av noll eller flera "bokstavstecken", "siffertecken" och understrykningstecken. En "bokstav" är i sin tur något av de enskilda tecknen "a" till "z" och "A" till "Z"; en "siffra" är ett enskilt tecken från "0" till "9".

source: Each rule begins with a name (which identifies the rule that's being defined) followed by a colon, ``:``. The definition to the right of the colon uses the following syntax elements:
sv: Varje regel inleds med ett namn (som identifierar den regel som definieras) följt av ett kolon, ``:``. Definitionen till höger om kolon använder följande syntaxelement:

source: ``name``: A name refers to another rule. Where possible, it is a link to the rule's definition.
sv: ``namn``: Ett namn hänvisar till en annan regel. Om möjligt är det en länk till regelns definition.

source: ``TOKEN``: An uppercase name refers to a :term:`token`. For the purposes of grammar definitions, tokens are the same as rules.
sv: ``TOKEN``: Ett namn med versaler hänvisar till en :term:`token`. När det gäller grammatikdefinitioner är tokens samma sak som regler.

source: ``"text"``, ``'text'``: Text in single or double quotes must match literally (without the quotes). The type of quote is chosen according to the meaning of ``text``:
sv: ``"text"``, ``'text'``: Text inom enkla eller dubbla citattecken måste matcha bokstavligen (utan citattecken). Typ av citat väljs beroende på betydelsen av ``text``:

source: ``'if'``: A name in single quotes denotes a :ref:`keyword <keywords>`.
sv: ``'om'``: Ett namn inom enkla citattecken betecknar ett :ref:`nyckelord <keywords>`.

source: ``"case"``: A name in double quotes denotes a :ref:`soft-keyword <soft-keywords>`.
sv: ``"fall"``: Ett namn inom dubbla citattecken betecknar ett :ref:`mjukt nyckelord <soft-keywords>`.

source: ``'@'``: A non-letter symbol in single quotes denotes an :py:data:`~token.OP` token, that is, a :ref:`delimiter <delimiters>` or :ref:`operator <operators>`.
sv: ``'@'``: En symbol som inte är en bokstav inom enkla citattecken betecknar en :py:data:`~token.OP`-token, det vill säga en :ref:`delimiter <delimiters>` eller :ref:`operator <operators>`.

source: ``e1 e2``: Items separated only by whitespace denote a sequence. Here, ``e1`` must be followed by ``e2``.
sv: ``e1 e2``: Objekt som endast är åtskilda av blanksteg anger en sekvens. Här måste ``e1`` följas av ``e2``.

source: ``e1 | e2``: A vertical bar is used to separate alternatives. It denotes PEG's "ordered choice": if ``e1`` matches, ``e2`` is not considered. In traditional PEG grammars, this is written as a slash, ``/``, rather than a vertical bar. See :pep:`617` for more background and details.
sv: ``e1 | e2``: En vertikal stapel används för att separera alternativ. Den betecknar PEG:s "ordnade val": om ``e1`` matchar, beaktas inte ``e2``. I traditionella PEG-grammatiker skrivs detta som ett snedstreck, ``/``, snarare än en vertikal stapel. Se :pep:`617` för mer bakgrund och detaljer.

source: ``e*``: A star means zero or more repetitions of the preceding item.
sv: ``e*``: En stjärna betyder noll eller flera upprepningar av föregående punkt.

source: ``e+``: Likewise, a plus means one or more repetitions.
sv: ``e+``: På samma sätt betyder ett plus en eller flera upprepningar.

source: ``[e]``: A phrase enclosed in square brackets means zero or one occurrences. In other words, the enclosed phrase is optional.
sv: ``[e]``: En fras inom hakparenteser betyder noll eller en förekomst. Med andra ord är den inneslutna frasen valfri.

source: ``e?``: A question mark has exactly the same meaning as square brackets: the preceding item is optional.
sv: ``e?``: Ett frågetecken har exakt samma betydelse som hakparenteser: föregående punkt är valfri.

source: ``(e)``: Parentheses are used for grouping.
sv: ``(e)``: Parenteser används för gruppering.

source: The following notation is only used in :ref:`lexical definitions <notation-lexical-vs-syntactic>`.
sv: Följande notation används endast i :ref:``lexikala definitioner <notation-lexical-vs-syntactic>`.

source: ``"a"..."z"``: Two literal characters separated by three dots mean a choice of any single character in the given (inclusive) range of ASCII characters.
sv: ``"a"..."z"``: Två bokstavstecken åtskilda av tre punkter innebär att man kan välja vilket tecken som helst i det angivna (inkluderande) ASCII-teckenområdet.

source: ``<...>``: A phrase between angular brackets gives an informal description of the matched symbol (for example, ``<any ASCII character except "\">``), or an abbreviation that is defined in nearby text (for example, ``<Lu>``).
sv: ``<...>``: En fras mellan vinkelparenteser ger en informell beskrivning av den matchade symbolen (t.ex. ``&lt;alla ASCII-tecken utom "\"&gt;``) eller en förkortning som definieras i närliggande text (t.ex. ``&lt;Lu&gt;``).

source: Some definitions also use *lookaheads*, which indicate that an element must (or must not) match at a given position, but without consuming any input:
sv: I vissa definitioner används också *lookaheads*, som anger att ett element måste (eller inte måste) matcha på en given position, men utan att konsumera någon input:

source: ``&e``: a positive lookahead (that is, ``e`` is required to match)
sv: ``&e``: en positiv lookahead (det vill säga, ``e`` måste matcha)

source: ``!e``: a negative lookahead (that is, ``e`` is required *not* to match)
sv: ``!e``: en negativ lookahead (det vill säga, ``e`` måste *inte* matcha)

source: The unary operators (``*``, ``+``, ``?``) bind as tightly as possible; the vertical bar (``|``) binds most loosely.
sv: De unära operatorerna (``*``, ``+``, ``?``) binder så hårt som möjligt; den vertikala stapeln (``|``) binder mest löst.

source: White space is only meaningful to separate tokens.
sv: Vitt utrymme är endast meningsfullt för att separera tokens.

source: Rules are normally contained on a single line, but rules that are too long may be wrapped:
sv: Reglerna står normalt på en rad, men om de är för långa kan de ombrytas:

source: Alternatively, rules may be formatted with the first line ending at the colon, and each alternative beginning with a vertical bar on a new line. For example:
sv: Alternativt kan reglerna formateras så att den första raden slutar med kolon och varje alternativ börjar med ett vertikalt streck på en ny rad. Till exempel

source: This does *not* mean that there is an empty first alternative.
sv: Detta betyder *inte* att det finns ett tomt första alternativ.

source: Lexical and Syntactic definitions
sv: Lexikala och syntaktiska definitioner

source: There is some difference between *lexical* and *syntactic* analysis: the :term:`lexical analyzer` operates on the individual characters of the input source, while the *parser* (syntactic analyzer) operates on the stream of :term:`tokens <token>` generated by the lexical analysis. However, in some cases the exact boundary between the two phases is a CPython implementation detail.
sv: Det finns en viss skillnad mellan *lexikal* och *syntaktisk* analys: :term:`lexical analyzer` arbetar med de enskilda tecknen i inmatningskällan, medan *parser* (syntaktisk analysator) arbetar med den ström av :term:`tokens <token>` som genereras av den lexikala analysen. I vissa fall är dock den exakta gränsen mellan de två faserna en implementeringsdetalj i CPython.

source: The practical difference between the two is that in *lexical* definitions, all whitespace is significant. The lexical analyzer :ref:`discards <whitespace>` all whitespace that is not converted to tokens like :data:`token.INDENT` or :data:`~token.NEWLINE`. *Syntactic* definitions then use these tokens, rather than source characters.
sv: Den praktiska skillnaden mellan de två är att i *lexikala* definitioner är alla blanksteg betydelsefulla. Den lexikala analysatorn :ref:`discards <whitespace>` alla blanksteg som inte omvandlas till tokens som :data:`token.INDENT` eller :data:`~token.NEWLINE`. *Syntaktiska* definitioner använder sedan dessa tokens i stället för källtecken.

source: This documentation uses the same BNF grammar for both styles of definitions. All uses of BNF in the next chapter (:ref:`lexical`) are lexical definitions; uses in subsequent chapters are syntactic definitions.
sv: I denna dokumentation används samma BNF-grammatik för båda definitionstyperna. Alla användningar av BNF i nästa kapitel (:ref:`lexical`) är lexikala definitioner; användningar i efterföljande kapitel är syntaktiska definitioner.

source: grammar
sv: grammatik

source: lexical definitions
sv: lexikala definitioner
