Repository: yeager/python-docs-sv
Catalog: reference/toplevel_components.po
Languages: sv

source: Top-level components
sv: Komponenter på högsta nivå

source: The Python interpreter can get its input from a number of sources: from a script passed to it as standard input or as program argument, typed in interactively, from a module source file, etc. This chapter gives the syntax used in these cases.
sv: Python-tolken kan få sin indata från ett antal källor: från ett skript som skickas till den som standardinmatning eller som programargument, som skrivs in interaktivt, från en moduls källfil, etc. I detta kapitel beskrivs den syntax som används i dessa fall.

source: Complete Python programs
sv: Kompletta Python-program

source: While a language specification need not prescribe how the language interpreter is invoked, it is useful to have a notion of a complete Python program. A complete Python program is executed in a minimally initialized environment: all built-in and standard modules are available, but none have been initialized, except for :mod:`sys` (various system services), :mod:`builtins` (built-in functions, exceptions and ``None``) and :mod:`__main__`. The latter is used to provide the local and global namespace for execution of the complete program.
sv: Även om en språkspecifikation inte behöver föreskriva hur språktolken anropas, är det användbart att ha en uppfattning om ett komplett Python-program. Ett komplett Python-program exekveras i en minimalt initialiserad miljö: alla inbyggda och standardmoduler är tillgängliga, men inga har initialiserats, förutom :mod:`sys` (olika systemtjänster), :mod:`builtins` (inbyggda funktioner, undantag och ``None``) och :mod:`__main__`. Den senare används för att tillhandahålla det lokala och globala namnområdet för exekvering av hela programmet.

source: The syntax for a complete Python program is that for file input, described in the next section.
sv: Syntaxen för ett komplett Python-program är den för filinmatning, som beskrivs i nästa avsnitt.

source: The interpreter may also be invoked in interactive mode; in this case, it does not read and execute a complete program but reads and executes one statement (possibly compound) at a time. The initial environment is identical to that of a complete program; each statement is executed in the namespace of :mod:`__main__`.
sv: Tolken kan också anropas i interaktivt läge; i detta fall läser och exekverar den inte ett komplett program utan läser och exekverar en sats (eventuellt sammansatt) i taget. Den initiala miljön är identisk med den för ett komplett program; varje sats exekveras i namnrymden för :mod:`__main__`.

source: A complete program can be passed to the interpreter in three forms: with the :option:`-c` *string* command line option, as a file passed as the first command line argument, or as standard input. If the file or standard input is a tty device, the interpreter enters interactive mode; otherwise, it executes the file as a complete program.
sv: Ett komplett program kan skickas till tolken på tre olika sätt: med kommandoradsalternativet :option:`-c` *string*, som en fil som skickas som första argument på kommandoraden eller som standardinmatning. Om filen eller standardinmatningen är en tty-enhet går tolken in i interaktivt läge, annars exekveras filen som ett komplett program.

source: File input
sv: Filinmatning

source: All input read from non-interactive files has the same form:
sv: Alla indata som läses från icke-interaktiva filer har samma form:

source: This syntax is used in the following situations:
sv: Denna syntax används i följande situationer:

source: when parsing a complete Python program (from a file or from a string);
sv: vid parsning av ett komplett Python-program (från en fil eller från en sträng);

source: when parsing a module;
sv: vid parsning av en modul;

source: when parsing a string passed to the :func:`exec` function;
sv: vid parsning av en sträng som skickas till funktionen :func:`exec`;

source: Interactive input
sv: Interaktiv inmatning

source: Input in interactive mode is parsed using the following grammar:
sv: Inmatning i interaktivt läge analyseras med hjälp av följande grammatik:

source: Note that a (top-level) compound statement must be followed by a blank line in interactive mode; this is needed to help the parser detect the end of the input.
sv: Observera att en sammansatt sats (på högsta nivån) måste följas av en blankrad i interaktivt läge; detta behövs för att hjälpa parsern att upptäcka slutet på inmatningen.

source: Expression input
sv: Uttrycksinmatning

source: :func:`eval` is used for expression input. It ignores leading whitespace. The string argument to :func:`eval` must have the following form:
sv: :func:`eval` används för att mata in uttryck. Den ignorerar ledande blanksteg. Strängargumentet till :func:`eval` måste ha följande form:

source: interpreter
sv: tolk

source: module
sv: modul

source: sys
sv: system

source: builtins
sv: inbyggda

source: interactive mode
sv: interaktivt läge

source: command line
sv: kommandoraden

source: standard input
sv: standardinmatning

source: built-in function
sv: inbyggd funktion
