Repository: yeager/python-docs-sv
Catalog: library/__future__.po
Languages: sv

source: :mod:`!__future__` --- Future statement definitions
sv: :mod:`!__future__` --- Definitioner av framtidsuttalanden

source: **Source code:** :source:`Lib/__future__.py`
sv: **Källkod:** :source:`Lib/__future__.py`

source: Imports of the form ``from __future__ import feature`` are called :ref:`future statements <future>`. These are special-cased by the Python compiler to allow the use of new Python features in modules containing the future statement before the release in which the feature becomes standard.
sv: Import av formen ``from __future__ import feature`` kallas :ref:``future statements <future>``. Dessa är specialanpassade av Python-kompilatorn för att tillåta användning av nya Python-funktioner i moduler som innehåller framtidsuttalandet före den utgåva där funktionen blir standard.

source: While these future statements are given additional special meaning by the Python compiler, they are still executed like any other import statement and the :mod:`__future__` exists and is handled by the import system the same way any other Python module would be. This design serves three purposes:
sv: Även om dessa future-satser ges ytterligare speciell betydelse av Python-kompilatorn, exekveras de fortfarande som vilken annan importsats som helst och :mod:`__future__` existerar och hanteras av importsystemet på samma sätt som vilken annan Python-modul som helst. Denna design tjänar tre syften:

source: To avoid confusing existing tools that analyze import statements and expect to find the modules they're importing.
sv: För att undvika förvirring hos befintliga verktyg som analyserar importmeddelanden och förväntar sig att hitta de moduler som de importerar.

source: To document when incompatible changes were introduced, and when they will be --- or were --- made mandatory. This is a form of executable documentation, and can be inspected programmatically via importing :mod:`__future__` and examining its contents.
sv: För att dokumentera när inkompatibla ändringar infördes och när de kommer att bli --- eller var --- obligatoriska. Detta är en form av körbar dokumentation och kan inspekteras programmatiskt genom att importera :mod:`__future__` och undersöka dess innehåll.

source: To ensure that :ref:`future statements <future>` run under releases prior to Python 2.1 at least yield runtime exceptions (the import of :mod:`__future__` will fail, because there was no module of that name prior to 2.1).
sv: För att säkerställa att :ref:`future statements <future>` som körs under utgåvor före Python 2.1 åtminstone ger upphov till körtidsundantag (importen av :mod:`__future__` kommer att misslyckas, eftersom det inte fanns någon modul med det namnet före 2.1).

source: Module Contents
sv: Modulens innehåll

source: No feature description will ever be deleted from :mod:`__future__`. Since its introduction in Python 2.1 the following features have found their way into the language using this mechanism:
sv: Ingen funktionsbeskrivning kommer någonsin att tas bort från :mod:`__future__`. Sedan introduktionen i Python 2.1 har följande funktioner hittat sin väg in i språket med hjälp av denna mekanism:

source: feature
sv: funktion

source: optional in
sv: valfritt i

source: mandatory in
sv: obligatorisk i

source: effect
sv: effekt

source: :pep:`227`: *Statically Nested Scopes*
sv: :pep:`227`: *Statiskt nästlade scopes

source: :pep:`255`: *Simple Generators*
sv: :pep:`255`: *Enkla generatorer*

source: :pep:`238`: *Changing the Division Operator*
sv: :pep:`238`: *Byte av divisionsoperator*

source: :pep:`328`: *Imports: Multi-Line and Absolute/Relative*
sv: :pep:`328`: *Importerar: Flera rader och absolut/relativ*

source: :pep:`343`: *The “with” Statement*
sv: :pep:`343`: *”with”-uttalandet*

source: :pep:`3105`: *Make print a function*
sv: :pep:`3105`: *Gör print till en funktion*

source: :pep:`3112`: *Bytes literals in Python 3000*
sv: :pep:`3112`: *Byteslitteraler i Python 3000*

source: :pep:`479`: *StopIteration handling inside generators*
sv: :pep:`479`: *StopIteration-hantering i generatorer*

source: :pep:`563`: *Postponed evaluation of annotations*, :pep:`649`: *Deferred evaluation of annotations using descriptors*
sv: :pep:`563`: *Uppskjuten utvärdering av anteckningar*, :pep:`649`: *Uppskjuten utvärdering av anteckningar med hjälp av deskriptorer*

source: Each statement in :file:`__future__.py` is of the form::
sv: Varje uttalande i :file:`__future__.py` är av formen::

source: where, normally, *OptionalRelease* is less than *MandatoryRelease*, and both are 5-tuples of the same form as :data:`sys.version_info`::
sv: där normalt *OptionalRelease* är mindre än *MandatoryRelease*, och båda är 5-tupler av samma form som :data:`sys.version_info`::

source: (PY_MAJOR_VERSION, # the 2 in 2.1.0a3; an int PY_MINOR_VERSION, # the 1; an int PY_MICRO_VERSION, # the 0; an int PY_RELEASE_LEVEL, # "alpha", "beta", "candidate" or "final"; string PY_RELEASE_SERIAL # the 3; an int )
sv: (PY_MAJOR_VERSION, # den 2 i 2.1.0a3; ett int PY_MINOR_VERSION, # den 1; ett int PY_MICRO_VERSION, # den 0; ett int PY_RELEASE_LEVEL, # "alpha", "beta", "candidate" eller "final"; sträng PY_RELEASE_SERIAL # 3; ett int )

source: *OptionalRelease* records the first release in which the feature was accepted.
sv: *OptionalRelease* registrerar den första utgåvan i vilken funktionen accepterades.

source: In the case of a *MandatoryRelease* that has not yet occurred, *MandatoryRelease* predicts the release in which the feature will become part of the language.
sv: När det gäller en *MandatoryRelease* som ännu inte har inträffat, förutspår *MandatoryRelease* den version där funktionen kommer att bli en del av språket.

source: Else *MandatoryRelease* records when the feature became part of the language; in releases at or after that, modules no longer need a future statement to use the feature in question, but may continue to use such imports.
sv: Else *MandatoryRelease* registrerar när funktionen blev en del av språket; i utgåvor från och med den tidpunkten behöver moduler inte längre ett framtida uttalande för att använda funktionen i fråga, men kan fortsätta att använda sådana importer.

source: *MandatoryRelease* may also be ``None``, meaning that a planned feature got dropped or that it is not yet decided.
sv: *MandatoryRelease* kan också vara ``None``, vilket innebär att en planerad funktion har strukits eller att den ännu inte är beslutad.

source: *CompilerFlag* is the (bitfield) flag that should be passed in the fourth argument to the built-in function :func:`compile` to enable the feature in dynamically compiled code. This flag is stored in the :attr:`_Feature.compiler_flag` attribute on :class:`_Feature` instances.
sv: *CompilerFlag* är den (bitfield) flagga som ska skickas i det fjärde argumentet till den inbyggda funktionen :func:`compile` för att aktivera funktionen i dynamiskt kompilerad kod. Denna flagga lagras i attributet :attr:`_Feature.compiler_flag` på :class:`_Feature`-instanser.

source: ``from __future__ import annotations`` was previously scheduled to become mandatory in Python 3.10, but the change was delayed and ultimately canceled. This feature will eventually be deprecated and removed. See :pep:`649` and :pep:`749`.
sv: ``from __future__ import annotations`` var tidigare planerad att bli obligatorisk i Python 3.10, men ändringen försenades och ställdes slutligen in. Denna funktion kommer så småningom att bli föråldrad och tas bort. Se :pep:`649` och :pep:`749`.

source: How the compiler treats future imports.
sv: Hur kompilatorn behandlar framtida import.

source: :pep:`236` - Back to the __future__
sv: :pep:`236` - Tillbaka till __future__

source: The original proposal for the __future__ mechanism.
sv: Det ursprungliga förslaget till mekanismen __future__.
