Repository: yeager/python-docs-sv
Catalog: library/annotationlib.po
Languages: sv

source: :meth:`typing.TypeVar.evaluate_default`, the default value of type variables
sv: :meth:`typing.TypeVar.evaluate_default`, standardvärdet för typvariabler

source: :meth:`typing.ParamSpec.evaluate_default`, the default value of parameter specifications
sv: :meth:`typing.ParamSpec.evaluate_default`, standardvärdet för parameterspecifikationer

source: :meth:`typing.TypeVarTuple.evaluate_default`, the default value of type variable tuples
sv: :meth:`typing.TypeVarTuple.evaluate_default`, standardvärdet för typvariabeltuplar

source: *owner* is the object that owns the evaluate function, such as the type alias or type variable object.
sv: *owner* är det objekt som äger funktionen evaluate, t.ex. typalias eller typvariabelobjekt.

source: *format* can be used to control the format in which the value is returned:
sv: *format* kan användas för att styra det format som värdet returneras i:

source: >>> type Alias = undefined >>> call_evaluate_function(Alias.evaluate_value, Format.VALUE) Traceback (most recent call last): ... NameError: name 'undefined' is not defined >>> call_evaluate_function(Alias.evaluate_value, Format.FORWARDREF) ForwardRef('undefined') >>> call_evaluate_function(Alias.evaluate_value, Format.STRING) 'undefined'
sv: >>> typ Alias = odefinierad >>> call_evaluate_function(Alias.evaluate_value, Format.VALUE) Traceback (senaste anropet senast): ... NameError: namnet 'undefined' är inte definierat >>> call_evaluate_function(Alias.evaluate_value, Format.FORWARDREF) ForwardRef('odefinierad') >>> call_evaluate_function(Alias.evaluate_value, Format.STRING) 'odefinierad'

source: Retrieve the :term:`annotate function` from a class namespace dictionary *namespace*. Return :const:`!None` if the namespace does not contain an annotate function. This is primarily useful before the class has been fully created (e.g., in a metaclass); after the class exists, the annotate function can be retrieved with ``cls.__annotate__``. See :ref:`below <annotationlib-metaclass>` for an example using this function in a metaclass.
sv: Hämtar :term:`annotate function` från en klassnamnrymdsordbok *namnrymd*. Returnerar :const:`!None` om namnrymden inte innehåller någon annotate-funktion. Detta är främst användbart innan klassen har skapats helt (t.ex. i en metaklass); när klassen finns kan annotate-funktionen hämtas med ``cls.__annotate__``. Se :ref:`below <annotationlib-metaclass>` för ett exempel på användning av denna funktion i en metaklass.

source: Compute the annotations dict for an object.
sv: Beräkna annoteringsdikten för ett objekt.

source: *obj* may be a callable, class, module, or other object with :attr:`~object.__annotate__` or :attr:`~object.__annotations__` attributes. Passing any other object raises :exc:`TypeError`.
sv: *obj* kan vara en anropsbar, klass, modul eller annat objekt med :attr:`~object.__annotate__` eller :attr:`~object.__annotations__` attribut. Att skicka något annat objekt ger upphov till :exc:`TypeError`.

source: The *format* parameter controls the format in which annotations are returned, and must be a member of the :class:`Format` enum or its integer equivalent. The different formats work as follows:
sv: Parametern *format* styr det format i vilket anteckningarna returneras och måste vara en medlem i enum :class:`Format` eller dess heltalsekvivalent. De olika formaten fungerar på följande sätt:

source: VALUE: :attr:`!object.__annotations__` is tried first; if that does not exist, the :attr:`!object.__annotate__` function is called if it exists.
sv: VÄRDE: :attr:`!object.__annotations__` prövas först; om den inte finns anropas funktionen :attr:`!object.__annotate__` om den finns.

source: FORWARDREF: If :attr:`!object.__annotations__` exists and can be evaluated successfully, it is used; otherwise, the :attr:`!object.__annotate__` function is called. If it does not exist either, :attr:`!object.__annotations__` is tried again and any error from accessing it is re-raised.
sv: FORWARDREF: Om :attr:`!object.__annotations__` finns och kan utvärderas framgångsrikt, används den; annars anropas funktionen :attr:`!object.__annotate__`. Om den inte heller finns, försöker :attr:`!object.__annotations__` igen och eventuella fel från åtkomsten till den tas upp igen.

source: STRING: If :attr:`!object.__annotate__` exists, it is called first; otherwise, :attr:`!object.__annotations__` is used and stringified using :func:`annotations_to_string`.
sv: STRING: Om :attr:`!object.__annotate__` finns, anropas den först; annars används :attr:`!object.__annotations__` och strängifieras med :func:`annotations_to_string`.

source: Returns a dict. :func:`!get_annotations` returns a new dict every time it's called; calling it twice on the same object will return two different but equivalent dicts.
sv: Returnerar en dict. :func:`!get_annotations` returnerar en ny dict varje gång den anropas; om den anropas två gånger på samma objekt returneras två olika men likvärdiga dicts.

source: This function handles several details for you:
sv: Denna funktion hanterar flera detaljer åt dig:

source: If *eval_str* is true, values of type :class:`!str` will be un-stringized using :func:`eval`. This is intended for use with stringized annotations (``from __future__ import annotations``). It is an error to set *eval_str* to true with formats other than :attr:`Format.VALUE`.
sv: Om *eval_str* är true, kommer värden av typen :class:`!str` att avsträngas med hjälp av :func:`eval`. Detta är avsett att användas med strängade annotationer (``from __future__ import annotations``). Det är ett fel att sätta *eval_str* till true med andra format än :attr:`Format.VALUE`.

source: If *obj* doesn't have an annotations dict, returns an empty dict. (Functions and methods always have an annotations dict; classes, modules, and other types of callables may not.)
sv: Om *obj* inte har någon annotationsdikt returneras en tom dikt. (Funktioner och metoder har alltid en annotationsdikt; klasser, moduler och andra typer av anropsbara objekt kanske inte har det)

source: Ignores inherited annotations on classes, as well as annotations on metaclasses. If a class doesn't have its own annotations dict, returns an empty dict.
sv: Ignorerar ärvda annotationer på klasser, liksom annotationer på metaklasser. Om en klass inte har någon egen annotationsdikt returneras en tom dikt.

source: All accesses to object members and dict values are done using ``getattr()`` and ``dict.get()`` for safety.
sv: Alla åtkomster till objektmedlemmar och dict-värden görs med hjälp av ``getattr()`` och ``dict.get()`` för säkerhets skull.

source: *eval_str* controls whether or not values of type :class:`!str` are replaced with the result of calling :func:`eval` on those values:
sv: *eval_str* styr om värden av typen :class:`!str` ska ersättas med resultatet av anropet av :func:`eval` på dessa värden:

source: If eval_str is true, :func:`eval` is called on values of type :class:`!str`. (Note that :func:`!get_annotations` doesn't catch exceptions; if :func:`eval` raises an exception, it will unwind the stack past the :func:`!get_annotations` call.)
sv: Om eval_str är true, anropas :func:`eval` på värden av typen :class:`!str`. (Observera att :func:`!get_annotations` inte fångar upp undantag; om :func:`eval` ger upphov till ett undantag kommer den att spola tillbaka stacken förbi anropet av :func:`!get_annotations`)

source: If *eval_str* is false (the default), values of type :class:`!str` are unchanged.
sv: Om *eval_str* är false (standard) är värden av typen :class:`!str` oförändrade.

source: *globals* and *locals* are passed in to :func:`eval`; see the documentation for :func:`eval` for more information. If *globals* or *locals* is :const:`!None`, this function may replace that value with a context-specific default, contingent on ``type(obj)``:
sv: *globals* och *locals* skickas in till :func:`eval`; se dokumentationen för :func:`eval` för mer information. Om *globals* eller *locals* är :const:`!None`, kan denna funktion ersätta det värdet med en kontextspecifik standard, beroende på ``type(obj)``:

source: If *obj* is a module, *globals* defaults to ``obj.__dict__``.
sv: Om *obj* är en modul är *globals* standardvärdet för ``obj.__dict__``.

source: If *obj* is a class, *globals* defaults to ``sys.modules[obj.__module__].__dict__`` and *locals* defaults to the *obj* class namespace.
sv: Om *obj* är en klass är *globals* standardvärdet ``sys.modules[obj.__module__].__dict__`` och *locals* standardvärdet klassnamnrymden för *obj*.

source: If *obj* is a callable, *globals* defaults to :attr:`obj.__globals__ <function.__globals__>`, although if *obj* is a wrapped function (using :func:`functools.update_wrapper`) or a :class:`functools.partial` object, it is unwrapped until a non-wrapped function is found.
sv: Om *obj* är en callable är *globals* standardvärdet för :attr:`obj.__globals__ <function.__globals__>`, men om *obj* är en omsluten funktion (med :func:`functools.update_wrapper`) eller ett :class:`functools.partial`-objekt, är den omsluten tills en icke omsluten funktion hittas.

source: Calling :func:`!get_annotations` is best practice for accessing the annotations dict of any object. See :ref:`annotations-howto` for more information on annotations best practices.
sv: Att anropa :func:`!get_annotations` är bästa praxis för att få tillgång till annotationsdikten för ett objekt. Se :ref:`annotations-howto` för mer information om bästa praxis för annotationer.

source: >>> def f(a: int, b: str) -> float: ... pass >>> get_annotations(f) {'a': <class 'int'>, 'b': <class 'str'>, 'return': <class 'float'>}
sv: >>> def f(a: int, b: str) -> float: ... passera >>> get_annotations(f) {'a': <klass 'int'>, 'b': <class 'str'>, 'return': <klass 'float'>}

source: Convert an arbitrary Python value to a format suitable for use by the :attr:`~Format.STRING` format. This calls :func:`repr` for most objects, but has special handling for some objects, such as type objects.
sv: Konverterar ett godtyckligt Python-värde till ett format som kan användas av :attr:`~Format.STRING`-formatet. Detta anropar :func:`repr` för de flesta objekt, men har speciell hantering för vissa objekt, t.ex. typobjekt.

source: This is meant as a helper for user-provided annotate functions that support the :attr:`~Format.STRING` format but do not have access to the code creating the annotations. It can also be used to provide a user-friendly string representation for other objects that contain values that are commonly encountered in annotations.
sv: Detta är tänkt som en hjälp för användartillhandahållna annotate-funktioner som stöder formatet :attr:`~Format.STRING` men som inte har tillgång till koden som skapar annotationerna. Det kan också användas för att tillhandahålla en användarvänlig strängrepresentation för andra objekt som innehåller värden som är vanliga i annoteringar.

source: Recipes
sv: Recept

source: Using annotations in a metaclass
sv: Använda annoteringar i en metaklass

source: A :ref:`metaclass <metaclasses>` may want to inspect or even modify the annotations in a class body during class creation. Doing so requires retrieving annotations from the class namespace dictionary. For classes created with ``from __future__ import annotations``, the annotations will be in the ``__annotations__`` key of the dictionary. For other classes with annotations, :func:`get_annotate_from_class_namespace` can be used to get the annotate function, and :func:`call_annotate_function` can be used to call it and retrieve the annotations. Using the :attr:`~Format.FORWARDREF` format will usually be best, because this allows the annotations to refer to names that cannot yet be resolved when the class is created.
sv: En :ref:`metaklass <metaclasses>` kan vilja inspektera eller till och med ändra annoteringarna i en klass kropp under klassens skapande. För att göra detta krävs att anteckningar hämtas från klassens namnrymdsordbok. För klasser som skapats med ``from __future__ import annotations`` kommer annotationerna att finnas i nyckeln ``__annotations__`` i ordlistan. För andra klasser med anteckningar kan :func:`get_annotate_from_class_namespace` användas för att hämta anteckningsfunktionen och :func:`call_annotate_function` kan användas för att anropa den och hämta anteckningarna. Att använda formatet :attr:`~Format.FORWARDREF` är oftast bäst, eftersom det gör det möjligt för annoteringarna att referera till namn som ännu inte kan lösas när klassen skapas.

source: To modify the annotations, it is best to create a wrapper annotate function that calls the original annotate function, makes any necessary adjustments, and returns the result.
sv: För att modifiera annotationerna är det bäst att skapa en annotate-funktion som anropar den ursprungliga annotate-funktionen, gör eventuella nödvändiga justeringar och returnerar resultatet.

source: Below is an example of a metaclass that filters out all :class:`typing.ClassVar` annotations from the class and puts them in a separate attribute:
sv: Nedan visas ett exempel på en metaklass som filtrerar bort alla :class:`typing.ClassVar`-annoteringar från klassen och placerar dem i ett separat attribut:

source: Limitations of the ``STRING`` format
sv: Begränsningar av formatet ``STRING``

source: The :attr:`~Format.STRING` format is meant to approximate the source code of the annotation, but the implementation strategy used means that it is not always possible to recover the exact source code.
sv: Formatet :attr:`~Format.STRING` är avsett att approximera källkoden för anteckningen, men den implementeringsstrategi som används innebär att det inte alltid är möjligt att återskapa den exakta källkoden.

source: First, the stringifier of course cannot recover any information that is not present in the compiled code, including comments, whitespace, parenthesization, and operations that get simplified by the compiler.
sv: För det första kan strängifieraren naturligtvis inte återskapa någon information som inte finns i den kompilerade koden, inklusive kommentarer, blanksteg, parenteser och operationer som förenklas av kompilatorn.

source: Second, the stringifier can intercept almost all operations that involve names looked up in some scope, but it cannot intercept operations that operate fully on constants. As a corollary, this also means it is not safe to request the ``STRING`` format on untrusted code: Python is powerful enough that it is possible to achieve arbitrary code execution even with no access to any globals or builtins. For example:
sv: För det andra kan stringifieraren fånga upp nästan alla operationer som involverar namn som letas upp i något scope, men den kan inte fånga upp operationer som helt och hållet arbetar med konstanter. Som en följd av detta betyder det också att det inte är säkert att begära ``STRING``-formatet på opålitlig kod: Python är tillräckligt kraftfullt för att det är möjligt att utföra godtycklig kod även utan tillgång till några globaler eller inbyggda program. Till exempel:

source: >>> def f(x: (1).__class__.__base__.__subclasses__()[-1].__init__.__builtins__["print"]("Hello world")): pass ... >>> annotationlib.get_annotations(f, format=annotationlib.Format.STRING) Hello world {'x': 'None'}
sv: >>> def f(x: (1).__class__.__base__.__subclasses__()[-1].__init__.__builtins__["print"]("Hello world")): pass ... >>> annotationlib.get_annotations(f, format=annotationlib.Format.STRING) Hej världen {'x': 'Ingen'}

source: This particular example works as of the time of writing, but it relies on implementation details and is not guaranteed to work in the future.
sv: Det här exemplet fungerar i skrivande stund, men det är beroende av implementeringsdetaljer och det finns ingen garanti för att det fungerar i framtiden.

source: Among the different kinds of expressions that exist in Python, as represented by the :mod:`ast` module, some expressions are supported, meaning that the ``STRING`` format can generally recover the original source code; others are unsupported, meaning that they may result in incorrect output or an error.
sv: Bland de olika typer av uttryck som finns i Python, som representeras av modulen :mod:`ast`, stöds vissa uttryck, vilket innebär att ``STRING``-formatet i allmänhet kan återskapa den ursprungliga källkoden; andra stöds inte, vilket innebär att de kan resultera i felaktig utdata eller ett fel.

source: The following are supported (sometimes with caveats):
sv: Följande stöds (ibland med förbehåll):

source: :class:`ast.Invert` (``~``), :class:`ast.UAdd` (``+``), and :class:`ast.USub` (``-``) are supported
sv: :class:`ast.Invert` (``~``), :class:`ast.UAdd` (``+``), och :class:`ast.USub` (``-``) stöds

source: :class:`ast.Not` (``not``) is not supported
sv: :class:`ast.Not` (``not``) stöds inte

source: :class:`ast.Dict` (except when using ``**`` unpacking)
sv: :class:`ast.Dict` (utom när du använder ``**`` uppackning)

source: :class:`ast.Eq` and :class:`ast.NotEq` are supported
sv: :class:`ast.Eq` och :class:`ast.NotEq` stöds

source: :class:`ast.Lt`, :class:`ast.LtE`, :class:`ast.Gt`, and :class:`ast.GtE` are supported, but the operand may be flipped
sv: :class:`ast.Lt`, :class:`ast.LtE`, :class:`ast.Gt` och :class:`ast.GtE` stöds, men operanden kan vändas

source: :class:`ast.Is`, :class:`ast.IsNot`, :class:`ast.In`, and :class:`ast.NotIn` are not supported
sv: :class:`ast.Is`, :class:`ast.IsNot`, :class:`ast.In` och :class:`ast.NotIn` stöds inte

source: :class:`ast.Call` (except when using ``**`` unpacking)
sv: :class:`ast.Call` (utom vid användning av ``**`` uppackning)

source: :class:`ast.Constant` (though not the exact representation of the constant; for example, escape sequences in strings are lost; hexadecimal numbers are converted to decimal)
sv: :class:`ast.Constant` (dock inte den exakta representationen av konstanten; t.ex. försvinner escape-sekvenser i strängar; hexadecimala tal konverteras till decimal)

source: :class:`ast.Attribute` (assuming the value is not a constant)
sv: :class:`ast.Attribute` (förutsatt att värdet inte är en konstant)

source: :class:`ast.Subscript` (assuming the value is not a constant)
sv: :class:`ast.Subscript` (förutsatt att värdet inte är en konstant)

source: :class:`ast.Starred` (``*`` unpacking)
sv: :class:`ast.Starred` (``*`` uppackning)

source: :class:`ast.Name`
sv: :class:`ast.namn`

source: The following are unsupported, but throw an informative error when encountered by the stringifier:
sv: Följande stöds inte, men ger ett informativt fel när strängifieraren stöter på dem:

source: :class:`ast.FormattedValue` (f-strings; error is not detected if conversion specifiers like ``!r`` are used)
sv: :class:`ast.FormattedValue` (f-strängar; felet upptäcks inte om konverteringsspecifikatorer som ``!r`` används)

source: :class:`ast.JoinedStr` (f-strings)
sv: :class:`ast.JoinedStr` (f-strängar)

source: The following are unsupported and result in incorrect output:
sv: Följande stöds inte och resulterar i felaktiga utdata:

source: :class:`ast.BoolOp` (``and`` and ``or``)
sv: :class:`ast.BoolOp` (``och`` och ``eller``)

source: The following are disallowed in annotation scopes and therefore not relevant:
sv: Följande är inte tillåtna i annotationsomfång och är därför inte relevanta:

source: Limitations of the ``FORWARDREF`` format
sv: Begränsningar av formatet ``FORWARDREF``

source: The :attr:`~Format.FORWARDREF` format aims to produce real values as much as possible, with anything that cannot be resolved replaced with :class:`ForwardRef` objects. It is affected by broadly the same Limitations as the :attr:`~Format.STRING` format: annotations that perform operations on literals or that use unsupported expression types may raise exceptions when evaluated using the :attr:`~Format.FORWARDREF` format.
sv: Formatet :attr:`~Format.FORWARDREF` syftar till att producera verkliga värden så mycket som möjligt, och allt som inte kan lösas upp ersätts med :class:`ForwardRef`-objekt. Det påverkas av i stort sett samma begränsningar som formatet :attr:`~Format.STRING`: anteckningar som utför operationer på litteraler eller som använder uttryckstyper som inte stöds kan ge upphov till undantag när de utvärderas med formatet :attr:`~Format.FORWARDREF`.

source: Below are a few examples of the behavior with unsupported expressions:
sv: Nedan följer några exempel på beteendet med uttryck som inte stöds:

source: >>> from annotationlib import get_annotations, Format >>> def zerodiv(x: 1 / 0): ... >>> get_annotations(zerodiv, format=Format.STRING) Traceback (most recent call last): ... ZeroDivisionError: division by zero >>> get_annotations(zerodiv, format=Format.FORWARDREF) Traceback (most recent call last): ... ZeroDivisionError: division by zero >>> def ifexp(x: 1 if y else 0): ... >>> get_annotations(ifexp, format=Format.STRING) {'x': '1'}
sv: >>> from annotationlib import get_annotations, Format >>> def zerodiv(x: 1 / 0): ... >>> get_annotations(zerodiv, format=Format.STRING) Traceback (senaste anropet senast): ... ZeroDivisionError: division med noll >>> get_annotations(zerodiv, format=Format.FORWARDREF) Traceback (senaste anropet senast): ... ZeroDivisionError: division med noll >>> def ifexp(x: 1 if y else 0): ... >>> get_annotations(ifexp, format=Format.STRING) {'x': '1'}
