Repository: yeager/python-docs-sv
Catalog: library/annotationlib.po
Languages: sv

source: :mod:`!annotationlib` --- Functionality for introspecting annotations
sv: :mod:`!annotationlib` --- Funktionalitet för introspektion av annoteringar

source: **Source code:** :source:`Lib/annotationlib.py`
sv: **Källkod:** :source:`Lib/annotationlib.py`

source: The :mod:`!annotationlib` module provides tools for introspecting :term:`annotations <annotation>` on modules, classes, and functions.
sv: Modulen :mod:`!annotationlib` tillhandahåller verktyg för introspektion av :term:`annotationer <annotation>` på moduler, klasser och funktioner.

source: Annotations are :ref:`lazily evaluated <lazy-evaluation>` and often contain forward references to objects that are not yet defined when the annotation is created. This module provides a set of low-level tools that can be used to retrieve annotations in a reliable way, even in the presence of forward references and other edge cases.
sv: Annotationer är :ref:``långsamt utvärderade <lazy-evaluation>` och innehåller ofta framåtriktade referenser till objekt som ännu inte är definierade när annotationen skapas. Den här modulen innehåller en uppsättning lågnivåverktyg som kan användas för att hämta annoteringar på ett tillförlitligt sätt, även om det finns framåtriktade referenser och andra gränsfall.

source: This module supports retrieving annotations in three main formats (see :class:`Format`), each of which works best for different use cases:
sv: Den här modulen stöder hämtning av anteckningar i tre huvudformat (se :class:`Format`), som var och en fungerar bäst för olika användningsfall:

source: :attr:`~Format.VALUE` evaluates the annotations and returns their value. This is most straightforward to work with, but it may raise errors, for example if the annotations contain references to undefined names.
sv: :attr:`~Format.VALUE` utvärderar annoteringarna och returnerar deras värde. Detta är enklast att arbeta med, men det kan ge upphov till fel, t.ex. om annotationerna innehåller referenser till odefinierade namn.

source: :attr:`~Format.FORWARDREF` returns :class:`ForwardRef` objects for annotations that cannot be resolved, allowing you to inspect the annotations without evaluating them. This is useful when you need to work with annotations that may contain unresolved forward references.
sv: :attr:`~Format.FORWARDREF` returnerar :class:`ForwardRef`-objekt för annoteringar som inte kan lösas, vilket gör att du kan inspektera annoteringarna utan att utvärdera dem. Detta är användbart när du behöver arbeta med annoteringar som kan innehålla olösta framåtriktade referenser.

source: :attr:`~Format.STRING` returns the annotations as a string, similar to how it would appear in the source file. This is useful for documentation generators that want to display annotations in a readable way.
sv: :attr:`~Format.STRING` returnerar anteckningarna som en sträng, liknande hur de skulle se ut i källfilen. Detta är användbart för dokumentationsgeneratorer som vill visa anteckningar på ett läsbart sätt.

source: The :func:`get_annotations` function is the main entry point for retrieving annotations. Given a function, class, or module, it returns an annotations dictionary in the requested format. This module also provides functionality for working directly with the :term:`annotate function` that is used to evaluate annotations, such as :func:`get_annotate_from_class_namespace` and :func:`call_annotate_function`, as well as the :func:`call_evaluate_function` function for working with :term:`evaluate functions <evaluate function>`.
sv: Funktionen :func:`get_annotations` är den huvudsakliga ingångspunkten för att hämta anteckningar. Om en funktion, klass eller modul anges returnerar den en annotationsordbok i det begärda formatet. Den här modulen innehåller också funktioner för att arbeta direkt med :term:`annotate function` som används för att utvärdera anteckningar, till exempel :func:`get_annotate_from_class_namespace` och :func:`call_annotate_function`, samt funktionen :func:`call_evaluate_function` för att arbeta med :term:`evaluate functions <evaluate function>`.

source: :pep:`649` proposed the current model for how annotations work in Python.
sv: :pep:`649` föreslog den nuvarande modellen för hur annoteringar fungerar i Python.

source: :pep:`749` expanded on various aspects of :pep:`649` and introduced the :mod:`!annotationlib` module.
sv: :pep:`749` utvidgade olika aspekter av :pep:`649` och introducerade modulen :mod:`!annotationlib`.

source: :ref:`annotations-howto` provides best practices for working with annotations.
sv: :ref:`annotations-howto` ger bästa praxis för att arbeta med annoteringar.

source: :pypi:`typing-extensions` provides a backport of :func:`get_annotations` that works on earlier versions of Python.
sv: :pypi:`typing-extensions` tillhandahåller en backport av :func:`get_annotations` som fungerar på tidigare versioner av Python.

source: Annotation semantics
sv: Semantik för annoteringar

source: The way annotations are evaluated has changed over the history of Python 3, and currently still depends on a :ref:`future import <future>`. There have been execution models for annotations:
sv: Hur annoteringar utvärderas har förändrats under Python 3:s historia, och beror för närvarande fortfarande på en :ref:`future import <future>`. Det har funnits exekveringsmodeller för annotationer:

source: *Stock semantics* (default in Python 3.0 through 3.13; see :pep:`3107` and :pep:`526`): Annotations are evaluated eagerly, as they are encountered in the source code.
sv: *Stock semantics* (standard i Python 3.0 till och med 3.13; se :pep:`3107` och :pep:`526`): Annoteringar utvärderas ivrigt, när de påträffas i källkoden.

source: *Stringified annotations* (used with ``from __future__ import annotations`` in Python 3.7 and newer; see :pep:`563`): Annotations are stored as strings only.
sv: *Stringifierade annoteringar* (används med ``from __future__ import annotations`` i Python 3.7 och senare; se :pep:`563`): Annotationer lagras endast som strängar.

source: *Deferred evaluation* (default in Python 3.14 and newer; see :pep:`649` and :pep:`749`): Annotations are evaluated lazily, only when they are accessed.
sv: *Uppskjuten utvärdering* (standard i Python 3.14 och nyare; se :pep:`649` och :pep:`749`): Annoteringar utvärderas latent, endast när de används.

source: As an example, consider the following program::
sv: Som ett exempel kan man tänka sig följande program::

source: def func(a: Cls) -> None: print(a) class Cls: pass print(func.__annotations__)
sv: def func(a: Cls) -> Ingen: print(a) klass Cls: pass print(func.__annotations__)

source: This will behave as follows:
sv: Detta kommer att bete sig på följande sätt:

source: Under stock semantics (Python 3.13 and earlier), it will throw a :exc:`NameError` at the line where ``func`` is defined, because ``Cls`` is an undefined name at that point.
sv: Under standardsemantik (Python 3.13 och tidigare) kommer den att kasta ett :exc:`NameError` på raden där ``func`` definieras, eftersom ``Cls`` är ett odefinierat namn vid den tidpunkten.

source: Under stringified annotations (if ``from __future__ import annotations`` is used), it will print ``{'a': 'Cls', 'return': 'None'}``.
sv: Under strängifierade anteckningar (om ``from __future__ import annotations`` används) kommer den att skriva ut ``{'a': 'Cls', 'return': 'None'}``.

source: Under deferred evaluation (Python 3.14 and later), it will print ``{'a': <class 'Cls'>, 'return': None}``.
sv: Under uppskjuten utvärdering (Python 3.14 och senare) kommer den att skriva ut ``{'a': <klass 'Cls'>, 'return': None}``.

source: Stock semantics were used when function annotations were first introduced in Python 3.0 (by :pep:`3107`) because this was the simplest, most obvious way to implement annotations. The same execution model was used when variable annotations were introduced in Python 3.6 (by :pep:`526`). However, stock semantics caused problems when using annotations as type hints, such as a need to refer to names that are not yet defined when the annotation is encountered. In addition, there were performance problems with executing annotations at module import time. Therefore, in Python 3.7, :pep:`563` introduced the ability to store annotations as strings using the ``from __future__ import annotations`` syntax. The plan at the time was to eventually make this behavior the default, but a problem appeared: stringified annotations are more difficult to process for those who introspect annotations at runtime. An alternative proposal, :pep:`649`, introduced the third execution model, deferred evaluation, and was implemented in Python 3.14. Stringified annotations are still used if ``from __future__ import annotations`` is present, but this behavior will eventually be removed.
sv: Stocksemantik användes när funktionsannoteringar först introducerades i Python 3.0 (av :pep:`3107`) eftersom detta var det enklaste och mest uppenbara sättet att implementera annoteringar. Samma exekveringsmodell användes när variabelannoteringar introducerades i Python 3.6 (av :pep:`526`). Stocksemantik orsakade dock problem när man använde annotationer som typtips, till exempel ett behov av att hänvisa till namn som ännu inte är definierade när annotationen påträffas. Dessutom fanns det prestandaproblem med att exekvera annotationer vid modulimport. Därför introducerade :pep:`563` i Python 3.7 möjligheten att lagra annotationer som strängar med syntaxen ``from __future__ import annotations``. Planen vid den tidpunkten var att så småningom göra detta beteende till standard, men ett problem uppstod: strängifierade annoteringar är svårare att bearbeta för dem som introspekterar annoteringar vid körning. Ett alternativt förslag, :pep:`649`, introducerade den tredje exekveringsmodellen, uppskjuten utvärdering, och implementerades i Python 3.14. Stringifierade annoteringar används fortfarande om ``from __future__ import annotations`` är närvarande, men detta beteende kommer så småningom att tas bort.

source: Classes
sv: Klasser

source: An :class:`~enum.IntEnum` describing the formats in which annotations can be returned. Members of the enum, or their equivalent integer values, can be passed to :func:`get_annotations` and other functions in this module, as well as to :attr:`~object.__annotate__` functions.
sv: En :class:`~enum.IntEnum` som beskriver de format i vilka anteckningar kan returneras. Medlemmar i enum, eller deras motsvarande heltalsvärden, kan skickas till :func:`get_annotations` och andra funktioner i denna modul, samt till :attr:`~object.__annotate__` funktioner.

source: Values are the result of evaluating the annotation expressions.
sv: Värdena är resultatet av utvärderingen av annoteringsuttrycken.

source: Special value used to signal that an annotate function is being evaluated in a special environment with fake globals. When passed this value, annotate functions should either return the same value as for the :attr:`Format.VALUE` format, or raise :exc:`NotImplementedError` to signal that they do not support execution in this environment. This format is only used internally and should not be passed to the functions in this module.
sv: Specialvärde som används för att signalera att en annotate-funktion utvärderas i en speciell miljö med falska globaler. När detta värde skickas till annotate-funktioner ska de antingen returnera samma värde som för formatet :attr:`Format.VALUE`, eller ge upphov till :exc:`NotImplementedError` för att signalera att de inte stöder exekvering i denna miljö. Detta format används endast internt och bör inte skickas till funktionerna i denna modul.

source: Values are real annotation values (as per :attr:`Format.VALUE` format) for defined values, and :class:`ForwardRef` proxies for undefined values. Real objects may contain references to :class:`ForwardRef` proxy objects.
sv: Värdena är verkliga annoteringsvärden (enligt formatet :attr:`Format.VALUE`) för definierade värden och :class:`ForwardRef`-proxyer för odefinierade värden. Verkliga objekt kan innehålla referenser till :class:`ForwardRef` proxyobjekt.

source: Values are the text string of the annotation as it appears in the source code, up to modifications including, but not restricted to, whitespace normalizations and constant values optimizations.
sv: Värdena är textsträngen i annotationen som den visas i källkoden, upp till ändringar inklusive, men inte begränsat till, normaliseringar av blanksteg och optimeringar av konstantvärden.

source: The exact values of these strings may change in future versions of Python.
sv: De exakta värdena för dessa strängar kan komma att ändras i framtida versioner av Python.

source: A proxy object for forward references in annotations.
sv: Ett proxyobjekt för framåtriktade referenser i annotationer.

source: Instances of this class are returned when the :attr:`~Format.FORWARDREF` format is used and annotations contain a name that cannot be resolved. This can happen when a forward reference is used in an annotation, such as when a class is referenced before it is defined.
sv: Instanser av denna klass returneras när formatet :attr:`~Format.FORWARDREF` används och annotationer innehåller ett namn som inte kan lösas. Detta kan inträffa när en framåtriktad referens används i en annotering, t.ex. när en klass refereras innan den har definierats.

source: A string containing the code that was evaluated to produce the :class:`~ForwardRef`. The string may not be exactly equivalent to the original source.
sv: En sträng som innehåller den kod som utvärderades för att producera :class:`~ForwardRef`. Strängen kanske inte är exakt likvärdig med den ursprungliga källan.

source: Evaluate the forward reference, returning its value.
sv: Utvärdera den framåtriktade referensen och återge dess värde.

source: If the *format* argument is :attr:`~Format.VALUE` (the default), this method may throw an exception, such as :exc:`NameError`, if the forward reference refers to a name that cannot be resolved. The arguments to this method can be used to provide bindings for names that would otherwise be undefined. If the *format* argument is :attr:`~Format.FORWARDREF`, the method will never throw an exception, but may return a :class:`~ForwardRef` instance. For example, if the forward reference object contains the code ``list[undefined]``, where ``undefined`` is a name that is not defined, evaluating it with the :attr:`~Format.FORWARDREF` format will return ``list[ForwardRef('undefined')]``. If the *format* argument is :attr:`~Format.STRING`, the method will return :attr:`~ForwardRef.__forward_arg__`.
sv: Om argumentet *format* är :attr:`~Format.VALUE` (standard) kan den här metoden ge upphov till ett undantag, t.ex. :exc:`NameError`, om den framåtriktade referensen hänvisar till ett namn som inte kan lösas. Argumenten till denna metod kan användas för att tillhandahålla bindningar för namn som annars skulle vara odefinierade. Om argumentet *format* är :attr:`~Format.FORWARDREF`, kommer metoden aldrig att ge upphov till ett undantag, men kan returnera en :class:`~ForwardRef`-instans. Om till exempel forward reference-objektet innehåller koden ``list[undefined]``, där ``undefined`` är ett namn som inte är definierat, kommer utvärderingen med :attr:`~Format.FORWARDREF`-formatet att returnera ``list[ForwardRef('undefined')]``. Om argumentet *format* är :attr:`~Format.STRING`, kommer metoden att returnera :attr:`~ForwardRef.__forward_arg__`.

source: The *owner* parameter provides the preferred mechanism for passing scope information to this method. The owner of a :class:`~ForwardRef` is the object that contains the annotation from which the :class:`~ForwardRef` derives, such as a module object, type object, or function object.
sv: Parametern *owner* anger vilken mekanism som föredras för att skicka information om omfattning till denna metod. Ägaren till en :class:`~ForwardRef` är det objekt som innehåller den annotation som :class:`~ForwardRef` härrör från, t.ex. ett modulobjekt, typobjekt eller funktionsobjekt.

source: The *globals*, *locals*, and *type_params* parameters provide a more precise mechanism for influencing the names that are available when the :class:`~ForwardRef` is evaluated. *globals* and *locals* are passed to :func:`eval`, representing the global and local namespaces in which the name is evaluated. The *type_params* parameter is relevant for objects created using the native syntax for :ref:`generic classes <generic-classes>` and :ref:`functions <generic-functions>`. It is a tuple of :ref:`type parameters <type-params>` that are in scope while the forward reference is being evaluated. For example, if evaluating a :class:`~ForwardRef` retrieved from an annotation found in the class namespace of a generic class ``C``, *type_params* should be set to ``C.__type_params__``.
sv: Parametrarna *globals*, *locals* och *type_params* ger en mer exakt mekanism för att påverka de namn som är tillgängliga när :class:`~ForwardRef` utvärderas. *globals* och *locals* skickas till :func:`eval` och representerar de globala och lokala namnrymder i vilka namnet utvärderas. Parametern *type_params* är relevant för objekt som skapas med den ursprungliga syntaxen för :ref:`generic classes <generic-classes>` och :ref:`functions <generic-functions>`. Det är en tupel av :ref:`typ-parametrar <type-params>` som är i omfattning medan den framåtriktade referensen utvärderas. Om man t.ex. utvärderar en :class:`~ForwardRef` som hämtats från en annotation som finns i klassnamnrymden för en generisk klass ``C``, bör *type_params* sättas till ``C.__type_params__``.

source: :class:`~ForwardRef` instances returned by :func:`get_annotations` retain references to information about the scope they originated from, so calling this method with no further arguments may be sufficient to evaluate such objects. :class:`~ForwardRef` instances created by other means may not have any information about their scope, so passing arguments to this method may be necessary to evaluate them successfully.
sv: :class:`~ForwardRef`-instanser som returneras av :func:`get_annotations` behåller referenser till information om det scope de härstammar från, så det kan räcka med att anropa denna metod utan ytterligare argument för att utvärdera sådana objekt. :class:`~ForwardRef`-instanser som skapas på annat sätt kanske inte har någon information om sitt scope, så det kan vara nödvändigt att skicka argument till denna metod för att utvärdera dem framgångsrikt.

source: If no *owner*, *globals*, *locals*, or *type_params* are provided and the :class:`~ForwardRef` does not contain information about its origin, empty globals and locals dictionaries are used.
sv: Om inga *owner*, *globals*, *locals* eller *type_params* anges och :class:`~ForwardRef` inte innehåller information om sitt ursprung, används tomma globals- och locals-ordlistor.

source: Functions
sv: Funktioner

source: Convert an annotations dict containing runtime values to a dict containing only strings. If the values are not already strings, they are converted using :func:`type_repr`. This is meant as a helper for user-provided annotate functions that support the :attr:`~Format.STRING` format but do not have access to the code creating the annotations.
sv: Konverterar en annotationsdikt som innehåller runtime-värden till en dikt som bara innehåller strängar. Om värdena inte redan är strängar konverteras de med hjälp av :func:`type_repr`. Detta är tänkt som en hjälp för användartillhandahållna annotate-funktioner som stöder formatet :attr:`~Format.STRING` men som inte har tillgång till koden som skapar annotationerna.

source: For example, this is used to implement the :attr:`~Format.STRING` for :class:`typing.TypedDict` classes created through the functional syntax:
sv: Detta används t.ex. för att implementera :attr:`~Format.STRING` för :class:`typing.TypedDict`-klasser som skapats genom den funktionella syntaxen:

source: >>> from typing import TypedDict >>> Movie = TypedDict("movie", {"name": str, "year": int}) >>> get_annotations(Movie, format=Format.STRING) {'name': 'str', 'year': 'int'}
sv: >>> from typing import TypedDict >>> Movie = TypedDict("movie", {"name": str, "year": int}) >>> get_annotations(Movie, format=Format.STRING) {'namn': 'str', 'år': 'int'}

source: Call the :term:`annotate function` *annotate* with the given *format*, a member of the :class:`Format` enum, and return the annotations dictionary produced by the function.
sv: Anropa :term:`annotate-funktionen` *annotate* med det angivna *formatet*, en medlem av enum :class:`Format`, och returnera den annoteringsordbok som funktionen har producerat.

source: This helper function is required because annotate functions generated by the compiler for functions, classes, and modules only support the :attr:`~Format.VALUE` format when called directly. To support other formats, this function calls the annotate function in a special environment that allows it to produce annotations in the other formats. This is a useful building block when implementing functionality that needs to partially evaluate annotations while a class is being constructed.
sv: Denna hjälpfunktion behövs eftersom annoteringsfunktioner som genereras av kompilatorn för funktioner, klasser och moduler endast stöder formatet :attr:`~Format.VALUE` när de anropas direkt. För att stödja andra format anropar den här funktionen annotate-funktionen i en speciell miljö som gör det möjligt att producera annotationer i de andra formaten. Detta är en användbar byggsten när man implementerar funktionalitet som delvis behöver utvärdera annotationer medan en klass konstrueras.

source: *owner* is the object that owns the annotation function, usually a function, class, or module. If provided, it is used in the :attr:`~Format.FORWARDREF` format to produce a :class:`ForwardRef` object that carries more information.
sv: *owner* är det objekt som äger annoteringsfunktionen, vanligtvis en funktion, klass eller modul. Om det anges används det i formatet :attr:`~Format.FORWARDREF` för att producera ett :class:`ForwardRef`-objekt som innehåller mer information.

source: :PEP:`PEP 649 <649#the-stringizer-and-the-fake-globals-environment>` contains an explanation of the implementation technique used by this function.
sv: :PEP:`PEP 649 <649#the-stringizer-and-the-fake-globals-environment>` innehåller en förklaring av den implementeringsteknik som används av denna funktion.

source: Call the :term:`evaluate function` *evaluate* with the given *format*, a member of the :class:`Format` enum, and return the value produced by the function. This is similar to :func:`call_annotate_function`, but the latter always returns a dictionary mapping strings to annotations, while this function returns a single value.
sv: Anropar :term:`evaluate-funktionen` *evaluate* med det angivna *formatet*, en medlem av enum :class:`Format`, och returnerar det värde som funktionen producerar. Detta liknar :func:`call_annotate_function`, men den senare returnerar alltid en ordbok som mappar strängar till annoteringar, medan denna funktion returnerar ett enda värde.

source: This is intended for use with the evaluate functions generated for lazily evaluated elements related to type aliases and type parameters:
sv: Detta är avsett att användas med de utvärderingsfunktioner som genereras för latent utvärderade element relaterade till typaliaser och typparametrar:

source: :meth:`typing.TypeAliasType.evaluate_value`, the value of type aliases
sv: :meth:`typing.TypeAliasType.evaluate_value`, värdet av typaliaser

source: :meth:`typing.TypeVar.evaluate_bound`, the bound of type variables
sv: :meth:`typing.TypeVar.evaluate_bound`, bindning av typvariabler

source: :meth:`typing.TypeVar.evaluate_constraints`, the constraints of type variables
sv: :meth:`typing.TypeVar.evaluate_constraints`, begränsningarna för typvariabler
