Repository: yeager/python-docs-sv
Catalog: library/argparse.po
Languages: sv

source: *title* - title for the sub-parser group in help output; by default "subcommands" if description is provided, otherwise uses title for positional arguments
sv: *title* - titel för sub-parser-gruppen i hjälputmatningen; standard är "subcommands" om beskrivning anges, annars används titel för positionsargument

source: *description* - description for the sub-parser group in help output, by default ``None``
sv: *description* - beskrivning för sub-parser-gruppen i hjälputdata, standard ``None``

source: *prog* - usage information that will be displayed with sub-command help, by default the name of the program and any positional arguments before the subparser argument
sv: *prog* - användningsinformation som kommer att visas med hjälp för underkommandon, som standard namnet på programmet och eventuella positionsargument före subparser-argumentet

source: *parser_class* - class which will be used to create sub-parser instances, by default the class of the current parser (e.g. :class:`ArgumentParser`)
sv: *parser_class* - klass som kommer att användas för att skapa sub-parser-instanser, som standard klassen för den aktuella parsern (t.ex. :class:`ArgumentParser`)

source: action_ - the basic type of action to be taken when this argument is encountered at the command line
sv: action_ - den grundläggande typ av åtgärd som ska vidtas när detta argument påträffas på kommandoraden

source: dest_ - name of the attribute under which sub-command name will be stored; by default ``None`` and no value is stored
sv: dest_ - namnet på det attribut under vilket namnet på underkommandot lagras; som standard ``None`` och inget värde lagras

source: required_ - Whether or not a subcommand must be provided, by default ``False`` (added in 3.7)
sv: required_ - Huruvida ett underkommando måste anges eller inte, som standard ``False`` (tillagd i 3.7)

source: help_ - help for sub-parser group in help output, by default ``None``
sv: help_ - hjälp för sub-parser-gruppen i hjälputmatningen, som standard ``None``

source: metavar_ - string presenting available subcommands in help; by default it is ``None`` and presents subcommands in form {cmd1, cmd2, ..}
sv: metavar_ - sträng som presenterar tillgängliga underkommandon i hjälpen; som standard är den ``None`` och presenterar underkommandon i form {cmd1, cmd2, ..}

source: Some example usage::
sv: Några exempel på användning::

source: >>> # create the top-level parser >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', action='store_true', help='foo help') >>> subparsers = parser.add_subparsers(help='subcommand help') >>> >>> # create the parser for the "a" command >>> parser_a = subparsers.add_parser('a', help='a help') >>> parser_a.add_argument('bar', type=int, help='bar help') >>> >>> # create the parser for the "b" command >>> parser_b = subparsers.add_parser('b', help='b help') >>> parser_b.add_argument('--baz', choices=('X', 'Y', 'Z'), help='baz help') >>> >>> # parse some argument lists >>> parser.parse_args(['a', '12']) Namespace(bar=12, foo=False) >>> parser.parse_args(['--foo', 'b', '--baz', 'Z']) Namespace(baz='Z', foo=True)
sv: >>> # skapa parsern på högsta nivån >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', action='store_true', help='foo help') >>> subparsers = parser.add_subparsers(help='underkommandohjälp') >>> >>> # skapa parsern för kommandot "a" >>> parser_a = subparsers.add_parser('a', help='a hjälp') >>> parser_a.add_argument('bar', type=int, help='bar hjälp') >>> >>> # skapa parsern för kommandot "b" >>> parser_b = subparsers.add_parser('b', help='b help') >>> parser_b.add_argument('--baz', choices=('X', 'Y', 'Z'), help='baz help') >>> >>> # analysera några argumentlistor >>> parser.parse_args(['a', '12']) Namnrymd(bar=12, foo=False) >>> parser.parse_args(['--foo', 'b', '--baz', 'Z']) Namnrymd(baz='Z', foo=True)

source: Note that the object returned by :meth:`parse_args` will only contain attributes for the main parser and the subparser that was selected by the command line (and not any other subparsers). So in the example above, when the ``a`` command is specified, only the ``foo`` and ``bar`` attributes are present, and when the ``b`` command is specified, only the ``foo`` and ``baz`` attributes are present.
sv: Observera att det objekt som returneras av :meth:`parse_args` endast innehåller attribut för huvudparsern och den underparser som valdes på kommandoraden (och inte några andra underparsers). Så i exemplet ovan, när kommandot ``a`` anges, är det bara attributen ``foo`` och ``bar`` som finns, och när kommandot ``b`` anges, är det bara attributen ``foo`` och ``baz`` som finns.

source: Similarly, when a help message is requested from a subparser, only the help for that particular parser will be printed. The help message will not include parent parser or sibling parser messages. (A help message for each subparser command, however, can be given by supplying the ``help=`` argument to :meth:`~_SubParsersAction.add_parser` as above.)
sv: På samma sätt gäller att när ett hjälpmeddelande begärs från en subparser, skrivs endast hjälpen för den aktuella parsern ut. Hjälpmeddelandet innehåller inte meddelanden från den överordnade parsern eller syskonparsern. (Ett hjälpmeddelande för varje subparser-kommando kan dock ges genom att ange argumentet ``help=`` till :meth:`~_SubParsersAction.add_parser` enligt ovan)

source: >>> parser.parse_args(['--help']) usage: PROG [-h] [--foo] {a,b} ... positional arguments: {a,b} subcommand help a a help b b help options: -h, --help show this help message and exit --foo foo help >>> parser.parse_args(['a', '--help']) usage: PROG a [-h] bar positional arguments: bar bar help options: -h, --help show this help message and exit >>> parser.parse_args(['b', '--help']) usage: PROG b [-h] [--baz {X,Y,Z}] options: -h, --help show this help message and exit --baz {X,Y,Z} baz help
sv: >>> parser.parse_args(['--help']) användning: PROG [-h] [--foo] {a,b} ... positionella argument: {a,b} underkommando hjälp a a hjälp b b hjälp alternativ: -h, --help visa detta hjälpmeddelande och avsluta --foo foo hjälp >>> parser.parse_args(['a', '--help']) användning: PROG a [-h] bar positionella argument: bar bar hjälp alternativ: -h, --help visa detta hjälpmeddelande och avsluta >>> parser.parse_args(['b', '--help']) användning: PROG b [-h] [--baz {X,Y,Z}] alternativ: -h, --help visa detta hjälpmeddelande och avsluta --baz {X,Y,Z} baz hjälp

source: The :meth:`add_subparsers` method also supports ``title`` and ``description`` keyword arguments. When either is present, the subparser's commands will appear in their own group in the help output. For example::
sv: Metoden :meth:`add_subparsers` har även stöd för nyckelordsargumenten ``title`` och ``description``. När något av dem finns med visas kommandona för underparsaren i en egen grupp i hjälputmatningen. Till exempel::

source: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(title='subcommands', ... description='valid subcommands', ... help='additional help') >>> subparsers.add_parser('foo') >>> subparsers.add_parser('bar') >>> parser.parse_args(['-h']) usage: [-h] {foo,bar} ... options: -h, --help show this help message and exit subcommands: valid subcommands {foo,bar} additional help
sv: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(title='underkommandon', ... description='giltiga underkommandon', ... help='ytterligare hjälp') >>> subparsers.add_parser('foo') >>> subparsers.add_parser('bar') >>> parser.parse_args(['-h']) användning: [-h] {foo,bar} ... alternativ: -h, --help visa detta hjälpmeddelande och avsluta underkommandon: giltiga underkommandon {foo,bar} ytterligare hjälp

source: Furthermore, :meth:`~_SubParsersAction.add_parser` supports an additional *aliases* argument, which allows multiple strings to refer to the same subparser. This example, like ``svn``, aliases ``co`` as a shorthand for ``checkout``::
sv: Dessutom stöder :meth:`~_SubParsersAction.add_parser` ett ytterligare *aliases*-argument, vilket gör att flera strängar kan referera till samma subparser. Detta exempel, liksom ```svn``, alias ``co`` som en förkortning för ``checkout``::

source: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers() >>> checkout = subparsers.add_parser('checkout', aliases=['co']) >>> checkout.add_argument('foo') >>> parser.parse_args(['co', 'bar']) Namespace(foo='bar')
sv: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers() >>> checkout = subparsers.add_parser('checkout', alias=['co']) >>> checkout.add_argument('foo') >>> parser.parse_args(['co', 'bar']) Namnrymd(foo='bar')

source: :meth:`~_SubParsersAction.add_parser` supports also an additional *deprecated* argument, which allows to deprecate the subparser.
sv: :meth:`~_SubParsersAction.add_parser` stöder också ett ytterligare *deprecated*-argument, som gör det möjligt att depreciera subparsern.

source: One particularly effective way of handling subcommands is to combine the use of the :meth:`add_subparsers` method with calls to :meth:`set_defaults` so that each subparser knows which Python function it should execute. For example::
sv: Ett särskilt effektivt sätt att hantera underkommandon är att kombinera användningen av metoden :meth:`add_subparsers` med anrop till :meth:`set_defaults` så att varje subparser vet vilken Python-funktion den ska utföra. Till exempel::

source: >>> # subcommand functions >>> def foo(args): ... print(args.x * args.y) ... >>> def bar(args): ... print('((%s))' % args.z) ... >>> # create the top-level parser >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(required=True) >>> >>> # create the parser for the "foo" command >>> parser_foo = subparsers.add_parser('foo') >>> parser_foo.add_argument('-x', type=int, default=1) >>> parser_foo.add_argument('y', type=float) >>> parser_foo.set_defaults(func=foo) >>> >>> # create the parser for the "bar" command >>> parser_bar = subparsers.add_parser('bar') >>> parser_bar.add_argument('z') >>> parser_bar.set_defaults(func=bar) >>> >>> # parse the args and call whatever function was selected >>> args = parser.parse_args('foo 1 -x 2'.split()) >>> args.func(args) 2.0 >>> >>> # parse the args and call whatever function was selected >>> args = parser.parse_args('bar XYZYX'.split()) >>> args.func(args) ((XYZYX))
sv: >>> # funktioner för underkommandon >>> def foo(args): ... print(args.x * args.y) ... >>> def bar(args): ... print('((%s))' % args.z) ... >>> # skapa parsern på högsta nivån >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(required=True) >>> >>> # skapa parsern för kommandot "foo" >>> parser_foo = subparsers.add_parser('foo') >>> parser_foo.add_argument('-x', type=int, default=1) >>> parser_foo.add_argument('y', type=float) >>> parser_foo.set_defaults(func=foo) >>> >>> # skapa parsern för kommandot "bar" >>> parser_bar = subparsers.add_parser('bar') >>> parser_bar.add_argument('z') >>> parser_bar.set_defaults(func=bar) >>> >>> # analysera args och anropa den funktion som valdes >>> args = parser.parse_args('foo 1 -x 2'.split()) >>> args.func(args) 2.0 >>> >>> # analysera args och anropa den funktion som valdes >>> args = parser.parse_args('bar XYZYX'.split()) >>> args.func(args) ((XYZYX))

source: This way, you can let :meth:`parse_args` do the job of calling the appropriate function after argument parsing is complete. Associating functions with actions like this is typically the easiest way to handle the different actions for each of your subparsers. However, if it is necessary to check the name of the subparser that was invoked, the ``dest`` keyword argument to the :meth:`add_subparsers` call will work::
sv: På så sätt kan du låta :meth:`parse_args` göra jobbet att anropa lämplig funktion efter att parsningen av argumenten är klar. Att associera funktioner med åtgärder på det här sättet är vanligtvis det enklaste sättet att hantera olika åtgärder för var och en av dina subparsers. Men om det är nödvändigt att kontrollera namnet på den subparsare som anropades, fungerar nyckelordsargumentet ``dest`` till :meth:`add_subparsers`-anropet::

source: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(dest='subparser_name') >>> subparser1 = subparsers.add_parser('1') >>> subparser1.add_argument('-x') >>> subparser2 = subparsers.add_parser('2') >>> subparser2.add_argument('y') >>> parser.parse_args(['2', 'frobble']) Namespace(subparser_name='2', y='frobble')
sv: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(dest='subparser_name') >>> subparser1 = subparsers.add_parser('1') >>> subparser1.add_argument('-x') >>> subparser2 = subparsers.add_parser('2') >>> subparser2.add_argument('y') >>> parser.parse_args(['2', 'frobble']) Namnrymd(subparser_name='2', y='frobble')

source: New *required* keyword-only parameter.
sv: Ny *krävd* parameter som endast innehåller nyckelord.

source: Subparser's *prog* is no longer affected by a custom usage message in the main parser.
sv: Subparsers *prog* påverkas inte längre av ett anpassat användningsmeddelande i huvudparsern.

source: FileType objects
sv: FileType-objekt

source: The :class:`FileType` factory creates objects that can be passed to the type argument of :meth:`ArgumentParser.add_argument`. Arguments that have :class:`FileType` objects as their type will open command-line arguments as files with the requested modes, buffer sizes, encodings and error handling (see the :func:`open` function for more details)::
sv: Fabriken :class:`FileType` skapar objekt som kan skickas till typargumentet i :meth:`ArgumentParser.add_argument`. Argument som har :class:`FileType`-objekt som typ kommer att öppna kommandoradsargument som filer med de begärda lägena, buffertstorlekarna, kodningarna och felhanteringen (se funktionen :func:`open` för mer information)::

source: FileType objects understand the pseudo-argument ``'-'`` and automatically convert this into :data:`sys.stdin` for readable :class:`FileType` objects and :data:`sys.stdout` for writable :class:`FileType` objects::
sv: FileType-objekt förstår pseudoargumentet ``'-'`` och konverterar detta automatiskt till :data:`sys.stdin` för läsbara :class:`FileType`-objekt och :data:`sys.stdout` för skrivbara :class:`FileType`-objekt::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('infile', type=argparse.FileType('r')) >>> parser.parse_args(['-']) Namespace(infile=<_io.TextIOWrapper name='<stdin>' encoding='UTF-8'>)
sv: &gt;&gt;&gt; parser = argparse.ArgumentParser() &gt;&gt;&gt; parser.add_argument('infile', type=argparse.FileType('r')) &gt;&gt;&gt; parser.parse_args(['-']) Namnrymd(infile=<_io.TextIOWrapper name='<stdin>' encoding='UTF-8'>)

source: If one argument uses *FileType* and then a subsequent argument fails, an error is reported but the file is not automatically closed. This can also clobber the output files. In this case, it would be better to wait until after the parser has run and then use the :keyword:`with`-statement to manage the files.
sv: Om ett argument använder *FileType* och ett efterföljande argument misslyckas, rapporteras ett fel men filen stängs inte automatiskt. Detta kan också förstöra utdatafilerna. I det här fallet är det bättre att vänta tills parsern har körts och sedan använda :keyword:`with`-statement för att hantera filerna.

source: Added the *encodings* and *errors* parameters.
sv: Parametrarna *encodings* och *errors* har lagts till.

source: Argument groups
sv: Argumentgrupper

source: By default, :class:`ArgumentParser` groups command-line arguments into "positional arguments" and "options" when displaying help messages. When there is a better conceptual grouping of arguments than this default one, appropriate groups can be created using the :meth:`!add_argument_group` method::
sv: Som standard grupperar :class:`ArgumentParser` kommandoradsargument i "positionella argument" och "alternativ" när hjälpmeddelanden visas. När det finns en bättre konceptuell gruppering av argument än denna standardgruppering kan lämpliga grupper skapas med hjälp av metoden :meth:`!add_argument_group`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group = parser.add_argument_group('group') >>> group.add_argument('--foo', help='foo help') >>> group.add_argument('bar', help='bar help') >>> parser.print_help() usage: PROG [--foo FOO] bar group: bar bar help --foo FOO foo help
sv: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group = parser.add_argument_group('group') >>> group.add_argument('--foo', help='foo hjälp') >>> group.add_argument('bar', help='bar hjälp') >>> parser.print_help() användning: PROG [--foo FOO] bar grupp: bar bar hjälp --foo FOO foo hjälp

source: The :meth:`add_argument_group` method returns an argument group object which has an :meth:`~ArgumentParser.add_argument` method just like a regular :class:`ArgumentParser`. When an argument is added to the group, the parser treats it just like a normal argument, but displays the argument in a separate group for help messages. The :meth:`!add_argument_group` method accepts *title* and *description* arguments which can be used to customize this display::
sv: Metoden :meth:`add_argument_group` returnerar ett argumentgruppsobjekt som har en metod :meth:`~ArgumentParser.add_argument` precis som en vanlig :class:`ArgumentParser`. När ett argument läggs till i gruppen behandlar parsern det precis som ett vanligt argument, men visar argumentet i en separat grupp för hjälpmeddelanden. Metoden :meth:`!add_argument_group` accepterar argumenten *title* och *description* som kan användas för att anpassa denna visning::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group1 = parser.add_argument_group('group1', 'group1 description') >>> group1.add_argument('foo', help='foo help') >>> group2 = parser.add_argument_group('group2', 'group2 description') >>> group2.add_argument('--bar', help='bar help') >>> parser.print_help() usage: PROG [--bar BAR] foo group1: group1 description foo foo help group2: group2 description --bar BAR bar help
sv: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group1 = parser.add_argument_group('group1', 'group1 beskrivning') >>> group1.add_argument('foo', help='foo hjälp') >>> group2 = parser.add_argument_group('group2', 'group2 description') >>> group2.add_argument('--bar', help='bar hjälp') >>> parser.print_help() användning: PROG [--bar BAR] foo grupp1: grupp1 beskrivning foo foo hjälp grupp2 beskrivning grupp2 beskrivning --bar BAR BAR bar hjälp

source: The optional, keyword-only parameters argument_default_ and conflict_handler_ allow for finer-grained control of the behavior of the argument group. These parameters have the same meaning as in the :class:`ArgumentParser` constructor, but apply specifically to the argument group rather than the entire parser.
sv: De valfria parametrarna argument_default_ och conflict_handler_, som endast innehåller nyckelord, ger möjlighet till mer detaljerad kontroll av argumentgruppens beteende. Dessa parametrar har samma betydelse som i :class:`ArgumentParser`-konstruktören, men gäller specifikt för argumentgruppen snarare än för hela parsern.

source: Note that any arguments not in your user-defined groups will end up back in the usual "positional arguments" and "optional arguments" sections.
sv: Observera att alla argument som inte finns i dina användardefinierade grupper hamnar tillbaka i de vanliga avsnitten "positionella argument" och "valfria argument".

source: Calling :meth:`add_argument_group` on an argument group now raises an exception. This nesting was never supported, often failed to work correctly, and was unintentionally exposed through inheritance.
sv: Anrop av :meth:`add_argument_group` på en argumentgrupp ger nu upphov till ett undantag. Denna nestning stöddes aldrig, fungerade ofta inte korrekt och exponerades oavsiktligt genom arv.

source: Passing prefix_chars_ to :meth:`add_argument_group` is now deprecated.
sv: Att skicka prefix_chars_ till :meth:`add_argument_group` är nu föråldrat.

source: Mutual exclusion
sv: Ömsesidigt uteslutande

source: Create a mutually exclusive group. :mod:`!argparse` will make sure that only one of the arguments in the mutually exclusive group was present on the command line::
sv: Skapa en ömsesidigt exklusiv grupp. :mod:`!argparse` kommer att se till att endast ett av argumenten i den ömsesidigt exklusiva gruppen fanns på kommandoraden::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group() >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args(['--foo']) Namespace(bar=True, foo=True) >>> parser.parse_args(['--bar']) Namespace(bar=False, foo=False) >>> parser.parse_args(['--foo', '--bar']) usage: PROG [-h] [--foo | --bar] PROG: error: argument --bar: not allowed with argument --foo
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group() >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args(['--foo']) Namnrymd(bar=True, foo=True) >>> parser.parse_args(['--bar']) Namnområde(bar=False, foo=False) >>> parser.parse_args(['--foo', '--bar']) användning: PROG [-h] [--foo | --bar] PROG: fel: argument --bar: inte tillåtet med argument --foo

source: The :meth:`add_mutually_exclusive_group` method also accepts a *required* argument, to indicate that at least one of the mutually exclusive arguments is required::
sv: Metoden :meth:`add_mutually_exclusive_group` accepterar också ett *required*-argument, för att ange att minst ett av de ömsesidigt uteslutande argumenten krävs::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group(required=True) >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args([]) usage: PROG [-h] (--foo | --bar) PROG: error: one of the arguments --foo --bar is required
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group(required=True) >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args([]) användning: PROG [-h] (--foo | --bar) PROG: fel: ett av argumenten --foo --bar är obligatoriskt

source: Note that currently mutually exclusive argument groups do not support the *title* and *description* arguments of :meth:`~ArgumentParser.add_argument_group`. However, a mutually exclusive group can be added to an argument group that has a title and description. For example::
sv: Observera att argumentgrupper som för närvarande är ömsesidigt exklusiva inte stöder argumenten *title* och *description* i :meth:`~ArgumentParser.add_argument_group`. En ömsesidigt exklusiv grupp kan dock läggas till i en argumentgrupp som har en titel och en beskrivning. Till exempel::
