Repository: yeager/python-docs-sv
Catalog: library/argparse.po
Languages: sv

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.ArgumentDefaultsHelpFormatter) >>> parser.add_argument('--foo', type=int, default=42, help='FOO!') >>> parser.add_argument('bar', nargs='*', default=[1, 2, 3], help='BAR!') >>> parser.print_help() usage: PROG [-h] [--foo FOO] [bar ...] positional arguments: bar BAR! (default: [1, 2, 3]) options: -h, --help show this help message and exit --foo FOO FOO! (default: 42)
sv: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.ArgumentDefaultsHelpFormatter) >>> parser.add_argument('--foo', type=int, default=42, help='FOO!') >>> parser.add_argument('bar', nargs='*', default=[1, 2, 3], help='BAR!') >>> parser.print_help() användning: PROG [-h] [--foo FOO] [bar ...] positionella argument: bar BAR! (standard: [1, 2, 3]) alternativ: -h, --help visa detta hjälpmeddelande och avsluta --foo FOO FOO FOO! (standard: 42)

source: :class:`MetavarTypeHelpFormatter` uses the name of the type_ argument for each argument as the display name for its values (rather than using the dest_ as the regular formatter does)::
sv: :class:`MetavarTypeHelpFormatter` använder namnet på typ_argumentet för varje argument som visningsnamn för dess värden (i stället för att använda dest_ som den vanliga formateraren gör)::

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.MetavarTypeHelpFormatter) >>> parser.add_argument('--foo', type=int) >>> parser.add_argument('bar', type=float) >>> parser.print_help() usage: PROG [-h] [--foo int] float positional arguments: float options: -h, --help show this help message and exit --foo int
sv: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.MetavarTypeHelpFormatter) >>> parser.add_argument('--foo', type=int) >>> parser.add_argument('bar', type=float) >>> parser.print_help() användning: PROG [-h] [--foo int] float positionella argument: float alternativ: -h, --help visa detta hjälpmeddelande och avsluta --foo int

source: Most command-line options will use ``-`` as the prefix, e.g. ``-f/--foo``. Parsers that need to support different or additional prefix characters, e.g. for options like ``+f`` or ``/foo``, may specify them using the ``prefix_chars=`` argument to the :class:`ArgumentParser` constructor::
sv: De flesta kommandoradsalternativ använder ``-`` som prefix, t.ex. ``-f/--foo``. Parsers som behöver stödja andra eller ytterligare prefixtecken, t.ex. för alternativ som ``+f`` eller ``/foo``, kan ange dem med argumentet ``prefix_chars=`` till :class:`ArgumentParser`-konstruktören::

source: >>> parser = argparse.ArgumentParser(prog='PROG', prefix_chars='-+') >>> parser.add_argument('+f') >>> parser.add_argument('++bar') >>> parser.parse_args('+f X ++bar Y'.split()) Namespace(bar='Y', f='X')
sv: >>> parser = argparse.ArgumentParser(prog='PROG', prefix_chars='-+') >>> parser.lägg_till_argument('+f') >>> parser.lägg_till_argument('++bar') >>> parser.parse_args('+f X ++bar Y'.split()) Namnrymd(bar='Y', f='X')

source: The ``prefix_chars=`` argument defaults to ``'-'``. Supplying a set of characters that does not include ``-`` will cause ``-f/--foo`` options to be disallowed.
sv: Argumentet ``prefix_chars=`` är som standard ``'-'``. Om du anger en uppsättning tecken som inte innehåller ``-`` kommer alternativen ``-f/--foo`` inte att tillåtas.

source: fromfile_prefix_chars
sv: frånfil_prefix_chars

source: Sometimes, when dealing with a particularly long argument list, it may make sense to keep the list of arguments in a file rather than typing it out at the command line. If the ``fromfile_prefix_chars=`` argument is given to the :class:`ArgumentParser` constructor, then arguments that start with any of the specified characters will be treated as files, and will be replaced by the arguments they contain. For example::
sv: Ibland, när man har att göra med en särskilt lång argumentlista, kan det vara vettigt att spara listan med argument i en fil i stället för att skriva ut den på kommandoraden. Om argumentet ``fromfile_prefix_chars=`` ges till konstruktören :class:`ArgumentParser`, kommer argument som börjar med något av de angivna tecknen att behandlas som filer och ersättas av de argument de innehåller. Till exempel::

source: >>> with open('args.txt', 'w', encoding=sys.getfilesystemencoding()) as fp: ... fp.write('-f\nbar') ... >>> parser = argparse.ArgumentParser(fromfile_prefix_chars='@') >>> parser.add_argument('-f') >>> parser.parse_args(['-f', 'foo', '@args.txt']) Namespace(f='bar')
sv: >>> med open('args.txt', 'w', encoding=sys.getfilesystemencoding()) som fp: ... fp.write('-f\nbar') ... >>> parser = argparse.ArgumentParser(fromfile_prefix_chars='@') >>> parser.add_argument('-f') >>> parser.parse_args(['-f', 'foo', '@args.txt']) Namnrymd(f='bar')

source: Arguments read from a file must be one per line by default (but see also :meth:`~ArgumentParser.convert_arg_line_to_args`) and are treated as if they were in the same place as the original file referencing argument on the command line. So in the example above, the expression ``['-f', 'foo', '@args.txt']`` is considered equivalent to the expression ``['-f', 'foo', '-f', 'bar']``.
sv: Argument som läses från en fil måste som standard vara en per rad (men se även :meth:`~ArgumentParser.convert_arg_line_to_args`) och behandlas som om de stod på samma plats som det ursprungliga filrefererande argumentet på kommandoraden. I exemplet ovan anses alltså uttrycket ``['-f', 'foo', '@args.txt']`` vara likvärdigt med uttrycket ``['-f', 'foo', '-f', 'bar']``.

source: Empty lines are treated as empty strings (``''``), which are allowed as values but not as arguments. Empty lines that are read as arguments will result in an "unrecognized arguments" error.
sv: Tomma rader behandlas som tomma strängar (``''``), som är tillåtna som värden men inte som argument. Tomma rader som läses som argument resulterar i felet "unrecognized arguments".

source: :class:`ArgumentParser` uses :term:`filesystem encoding and error handler` to read the file containing arguments.
sv: :class:`ArgumentParser` använder :term:`filsystemkodning och felhantering` för att läsa filen som innehåller argument.

source: The ``fromfile_prefix_chars=`` argument defaults to ``None``, meaning that arguments will never be treated as file references.
sv: Argumentet ``fromfile_prefix_chars=`` har standardvärdet ``None``, vilket innebär att argument aldrig kommer att behandlas som filreferenser.

source: :class:`ArgumentParser` changed encoding and errors to read arguments files from default (e.g. :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` and ``"strict"``) to the :term:`filesystem encoding and error handler`. Arguments file should be encoded in UTF-8 instead of ANSI Codepage on Windows.
sv: :class:`ArgumentParser` ändrade kodning och fel för att läsa argumentfiler från standard (t.ex. :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` och ``"strict"``) till :term:`filsystemets kodning och felhantering`. Argumentsfilen bör kodas i UTF-8 istället för ANSI Codepage på Windows.

source: Generally, argument defaults are specified either by passing a default to :meth:`~ArgumentParser.add_argument` or by calling the :meth:`~ArgumentParser.set_defaults` methods with a specific set of name-value pairs. Sometimes however, it may be useful to specify a single parser-wide default for arguments. This can be accomplished by passing the ``argument_default=`` keyword argument to :class:`ArgumentParser`. For example, to globally suppress attribute creation on :meth:`~ArgumentParser.parse_args` calls, we supply ``argument_default=SUPPRESS``::
sv: I allmänhet anges standardvärden för argument antingen genom att skicka ett standardvärde till :meth:`~ArgumentParser.add_argument` eller genom att anropa metoderna :meth:`~ArgumentParser.set_defaults` med en specifik uppsättning namn-värde-par. Ibland kan det dock vara användbart att ange en enda parser-omfattande standard för argument. Detta kan åstadkommas genom att skicka nyckelordsargumentet ``argument_default=`` till :class:`ArgumentParser`. Till exempel, för att globalt undertrycka skapandet av attribut vid :meth:`~ArgumentParser.parse_args`-anrop, anger vi ``argument_default=SUPPRESS``::

source: >>> parser = argparse.ArgumentParser(argument_default=argparse.SUPPRESS) >>> parser.add_argument('--foo') >>> parser.add_argument('bar', nargs='?') >>> parser.parse_args(['--foo', '1', 'BAR']) Namespace(bar='BAR', foo='1') >>> parser.parse_args([]) Namespace()
sv: >>> parser = argparse.ArgumentParser(argument_default=argparse.SUPPRESS) >>> parser.lägg_till_argument('--foo') >>> parser.add_argument('bar', nargs='?') >>> parser.parse_args(['--foo', '1', 'BAR']) Namnrymd(bar='BAR', foo='1') >>> parser.parse_args([]) Namnrymd()

source: allow_abbrev
sv: tillåt_abbrev

source: Normally, when you pass an argument list to the :meth:`~ArgumentParser.parse_args` method of an :class:`ArgumentParser`, it :ref:`recognizes abbreviations <prefix-matching>` of long options.
sv: Normalt, när du skickar en argumentlista till metoden :meth:`~ArgumentParser.parse_args` i en :class:`ArgumentParser`, :ref:``känner den igen förkortningar <prefix-matching>` av långa alternativ.

source: This feature can be disabled by setting ``allow_abbrev`` to ``False``::
sv: Denna funktion kan avaktiveras genom att ställa in ``allow_abbrev`` till ``False``::

source: >>> parser = argparse.ArgumentParser(prog='PROG', allow_abbrev=False) >>> parser.add_argument('--foobar', action='store_true') >>> parser.add_argument('--foonley', action='store_false') >>> parser.parse_args(['--foon']) usage: PROG [-h] [--foobar] [--foonley] PROG: error: unrecognized arguments: --foon
sv: >>> parser = argparse.ArgumentParser(prog='PROG', allow_abbrev=False) >>> parser.add_argument('--foobar', action='store_true') >>> parser.add_argument('--foonley', action='store_false') >>> parser.parse_args(['--foon']) användning: PROG [-h] [--foobar] [--foonley] PROG: fel: oigenkända argument: --foon

source: conflict_handler
sv: konflikt_hanterare

source: :class:`ArgumentParser` objects do not allow two actions with the same option string. By default, :class:`ArgumentParser` objects raise an exception if an attempt is made to create an argument with an option string that is already in use::
sv: :class:`ArgumentParser`-objekt tillåter inte två åtgärder med samma alternativsträng. Som standard gör :class:`ArgumentParser`-objekt ett undantag om ett försök görs att skapa ett argument med en alternativsträng som redan används::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo', help='old foo help') >>> parser.add_argument('--foo', help='new foo help') Traceback (most recent call last): .. ArgumentError: argument --foo: conflicting option string(s): --foo
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo', help='gammal foo hjälp') >>> parser.add_argument('--foo', help='ny foo-hjälp') Traceback (senaste anropet senast): .. ArgumentError: argument --foo: motstridiga alternativ sträng(ar): --foo

source: Sometimes (e.g. when using parents_) it may be useful to simply override any older arguments with the same option string. To get this behavior, the value ``'resolve'`` can be supplied to the ``conflict_handler=`` argument of :class:`ArgumentParser`::
sv: Ibland (t.ex. när man använder parents_) kan det vara användbart att helt enkelt åsidosätta äldre argument med samma alternativsträng. För att få detta beteende kan värdet ``'resolve'`` anges till argumentet ``conflict_handler=`` i :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', conflict_handler='resolve') >>> parser.add_argument('-f', '--foo', help='old foo help') >>> parser.add_argument('--foo', help='new foo help') >>> parser.print_help() usage: PROG [-h] [-f FOO] [--foo FOO] options: -h, --help show this help message and exit -f FOO old foo help --foo FOO new foo help
sv: >>> parser = argparse.ArgumentParser(prog='PROG', conflict_handler='resolve') >>> parser.add_argument('-f', '--foo', help='gammal foo hjälp') >>> parser.add_argument('--foo', help='ny foo-hjälp') >>> parser.print_help() användning: PROG [-h] [-f FOO] [--foo FOO] alternativ: -h, --help visa detta hjälpmeddelande och avsluta -f FOO gammal foo hjälp --foo FOO ny foo hjälp

source: Note that :class:`ArgumentParser` objects only remove an action if all of its option strings are overridden. So, in the example above, the old ``-f/--foo`` action is retained as the ``-f`` action, because only the ``--foo`` option string was overridden.
sv: Observera att :class:`ArgumentParser`-objekt endast tar bort en åtgärd om alla dess alternativsträngar är åsidosatta. Så i exemplet ovan behålls den gamla åtgärden ``-f/--foo`` som åtgärden ``-f``, eftersom endast alternativsträngen ``--foo`` åsidosattes.

source: add_help
sv: lägg till_hjälp

source: By default, :class:`ArgumentParser` objects add an option which simply displays the parser's help message. If ``-h`` or ``--help`` is supplied at the command line, the :class:`!ArgumentParser` help will be printed.
sv: Som standard lägger :class:`ArgumentParser`-objekt till ett alternativ som helt enkelt visar parserns hjälpmeddelande. Om ``-h`` eller ``--help`` anges på kommandoraden, kommer :class:`!ArgumentParser` hjälp att skrivas ut.

source: Occasionally, it may be useful to disable the addition of this help option. This can be achieved by passing ``False`` as the ``add_help=`` argument to :class:`ArgumentParser`::
sv: Ibland kan det vara bra att avaktivera tillägget av detta hjälpalternativ. Detta kan göras genom att ange ``False`` som argument för ``add_help=`` till :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> parser.add_argument('--foo', help='foo help') >>> parser.print_help() usage: PROG [--foo FOO] options: --foo FOO foo help
sv: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> parser.add_argument('--foo', help='foo hjälp') >>> parser.print_help() användning: PROG [--foo FOO] alternativ: --foo FOO foo hjälp

source: The help option is typically ``-h/--help``. The exception to this is if the ``prefix_chars=`` is specified and does not include ``-``, in which case ``-h`` and ``--help`` are not valid options. In this case, the first character in ``prefix_chars`` is used to prefix the help options::
sv: Hjälpalternativet är vanligtvis ``-h/--help``. Undantaget är om ``prefix_chars=`` anges och inte inkluderar ``-``, i vilket fall ``-h`` och ``--help`` inte är giltiga alternativ. I detta fall används det första tecknet i ``prefix_chars`` som prefix för hjälpalternativen::

source: >>> parser = argparse.ArgumentParser(prog='PROG', prefix_chars='+/') >>> parser.print_help() usage: PROG [+h] options: +h, ++help show this help message and exit
sv: >>> parser = argparse.ArgumentParser(prog='PROG', prefix_chars='+/') >>> parser.print_help() användning: PROG [+h] alternativ: +h, ++help visa detta hjälpmeddelande och avsluta

source: Normally, when you pass an invalid argument list to the :meth:`~ArgumentParser.parse_args` method of an :class:`ArgumentParser`, it will print a *message* to :data:`sys.stderr` and exit with a status code of 2.
sv: När du skickar en ogiltig argumentlista till metoden :meth:`~ArgumentParser.parse_args` i en :class:`ArgumentParser`, skriver den normalt ut ett *meddelande* till :data:`sys.stderr` och avslutas med statuskoden 2.

source: If the user would like to catch errors manually, the feature can be enabled by setting ``exit_on_error`` to ``False``::
sv: Om användaren vill fånga upp fel manuellt kan funktionen aktiveras genom att ställa in ``exit_on_error`` till ``False``::

source: >>> parser = argparse.ArgumentParser(exit_on_error=False) >>> parser.add_argument('--integers', type=int) _StoreAction(option_strings=['--integers'], dest='integers', nargs=None, const=None, default=None, type=<class 'int'>, choices=None, help=None, metavar=None) >>> try: ... parser.parse_args('--integers a'.split()) ... except argparse.ArgumentError: ... print('Catching an argumentError') ... Catching an argumentError
sv: >>> parser = argparse.ArgumentParser(exit_on_error=False) >>> parser.add_argument('--integers', type=int) _StoreAction(option_strings=['--integers'], dest='integers', nargs=None, const=None, default=None, type=<class 'int'>, choices=None, help=None, metavar=None) >>> försök: ... parser.parse_args('--integers a'.split()) ... except argparse.argumentError: ... print('Fångar ett argumentfel') ... Fångar upp ett argumentFel

source: suggest_on_error
sv: föreslå_på_fel

source: By default, when a user passes an invalid argument choice or subparser name, :class:`ArgumentParser` will exit with error info and list the permissible argument choices (if specified) or subparser names as part of the error message.
sv: Som standard, när en användare skickar ett ogiltigt argumentval eller subparsernamn, kommer :class:`ArgumentParser` att avslutas med felinformation och lista de tillåtna argumentvalen (om de anges) eller subparsernamnen som en del av felmeddelandet.

source: If the user would like to enable suggestions for mistyped argument choices and subparser names, the feature can be enabled by setting ``suggest_on_error`` to ``True``. Note that this only applies for arguments when the choices specified are strings::
sv: Om användaren vill aktivera förslag för felskrivna argumentval och namn på subparser kan funktionen aktiveras genom att ställa in ```uggest_on_error`` till ``True``. Observera att detta endast gäller för argument när de angivna alternativen är strängar::

source: >>> parser = argparse.ArgumentParser(description='Process some integers.', suggest_on_error=True) >>> parser.add_argument('--action', choices=['sum', 'max']) >>> parser.add_argument('integers', metavar='N', type=int, nargs='+', ... help='an integer for the accumulator') >>> parser.parse_args(['--action', 'sumn', 1, 2, 3]) tester.py: error: argument --action: invalid choice: 'sumn', maybe you meant 'sum'? (choose from 'sum', 'max')
sv: >>> parser = argparse.ArgumentParser(description='Bearbeta några heltal.', suggest_on_error=True) >>> parser.add_argument('--action', choices=['sum', 'max']) >>> parser.add_argument('heltal', metavar='N', type=int, nargs='+', ... help='ett heltal för ackumulatorn') >>> parser.parse_args(['--action', 'sumn', 1, 2, 3]) tester.py: error: argument --action: ogiltigt val: 'sumn', du kanske menade 'sum'? (välj bland 'sum', 'max')

source: If you're writing code that needs to be compatible with older Python versions and want to opportunistically use ``suggest_on_error`` when it's available, you can set it as an attribute after initializing the parser instead of using the keyword argument::
sv: Om du skriver kod som måste vara kompatibel med äldre Python-versioner och vill använda ``suggest_on_error`` när det är tillgängligt, kan du ställa in det som ett attribut efter initiering av parsern istället för att använda nyckelordsargumentet::

source: >>> parser = argparse.ArgumentParser(description='Process some integers.') >>> parser.suggest_on_error = True
sv: >>> parser = argparse.ArgumentParser(description="Bearbeta några heltal.") >>> parser.suggest_on_error = True

source: color
sv: färg

source: By default, the help message is printed in color using `ANSI escape sequences <https://en.wikipedia.org/wiki/ANSI_escape_code>`__. If you want plain text help messages, you can disable this :ref:`in your local environment <using-on-controlling-color>`, or in the argument parser itself by setting ``color`` to ``False``::
sv: Som standard skrivs hjälpmeddelandet ut i färg med hjälp av `ANSI escape-sekvenser &lt;https://en.wikipedia.org/wiki/ANSI_escape_code&gt;`__. Om du vill ha hjälpmeddelanden i klartext kan du inaktivera detta :ref:``i din lokala miljö <using-on-controlling-color>`, eller i själva argumentparsern genom att sätta ``color`` till ``False``::

source: >>> parser = argparse.ArgumentParser(description='Process some integers.', ... color=False) >>> parser.add_argument('--action', choices=['sum', 'max']) >>> parser.add_argument('integers', metavar='N', type=int, nargs='+', ... help='an integer for the accumulator') >>> parser.parse_args(['--help'])
sv: >>> parser = argparse.ArgumentParser(description='Behandla några heltal.', ... color=False) >>> parser.add_argument('--action', choices=['sum', 'max']) >>> parser.add_argument('integers', metavar='N', type=int, nargs='+', ... help='ett heltal för ackumulatorn') >>> parser.parse_args(['--help'])

source: The add_argument() method
sv: Metoden add_argument()

source: Define how a single command-line argument should be parsed. Each parameter has its own more detailed description below, but in short they are:
sv: Definiera hur ett enskilt kommandoradsargument ska tolkas. Varje parameter har sin egen mer detaljerade beskrivning nedan, men i korthet är de följande:

source: `name or flags`_ - Either a name or a list of option strings, e.g. ``'foo'`` or ``'-f', '--foo'``.
sv: `namn eller flaggor`_ - Antingen ett namn eller en lista med alternativsträngar, t.ex. ``'foo'`` eller ``'-f', '--foo'``.

source: action_ - The basic type of action to be taken when this argument is encountered at the command line.
sv: action_ - Den grundläggande typ av åtgärd som ska vidtas när detta argument påträffas på kommandoraden.

source: nargs_ - The number of command-line arguments that should be consumed.
sv: nargs_ - Antalet kommandoradsargument som ska användas.

source: const_ - A constant value required by some action_ and nargs_ selections.
sv: const_ - Ett konstant värde som krävs för vissa action_- och nargs_-val.

source: default_ - The value produced if the argument is absent from the command line and if it is absent from the namespace object.
sv: default_ - Det värde som produceras om argumentet inte finns på kommandoraden och om det inte finns i namnrymdsobjektet.

source: type_ - The type to which the command-line argument should be converted.
sv: type_ - Den typ som kommandoradsargumentet ska konverteras till.

source: choices_ - A sequence of the allowable values for the argument.
sv: choices_ - En sekvens av tillåtna värden för argumentet.

source: required_ - Whether or not the command-line option may be omitted (optionals only).
sv: required_ - Om kommandoradsalternativet kan utelämnas eller inte (endast optioner).

source: help_ - A brief description of what the argument does.
sv: help_ - En kort beskrivning av vad argumentet gör.

source: metavar_ - A name for the argument in usage messages.
sv: metavar_ - Ett namn för argumentet i användningsmeddelanden.

source: dest_ - The name of the attribute to be added to the object returned by :meth:`parse_args`.
sv: dest_ - Namnet på det attribut som ska läggas till i det objekt som returneras av :meth:`parse_args`.

source: deprecated_ - Whether or not use of the argument is deprecated.
sv: deprecated_ - Om användningen av argumentet är föråldrad eller inte.

source: name or flags
sv: namn eller flaggor

source: The :meth:`~ArgumentParser.add_argument` method must know whether an optional argument, like ``-f`` or ``--foo``, or a positional argument, like a list of filenames, is expected. The first arguments passed to :meth:`~ArgumentParser.add_argument` must therefore be either a series of flags, or a simple argument name.
sv: Metoden :meth:`~ArgumentParser.add_argument` måste veta om ett valfritt argument, som ``-f`` eller ``--foo``, eller ett positionellt argument, som en lista med filnamn, förväntas. De första argumenten som skickas till :meth:`~ArgumentParser.add_argument` måste därför vara antingen en serie flaggor eller ett enkelt argumentnamn.
