Repository: yeager/python-docs-sv
Catalog: library/argparse.po
Languages: sv

source: During a project's lifetime, some arguments may need to be removed from the command line. Before removing them, you should inform your users that the arguments are deprecated and will be removed. The ``deprecated`` keyword argument of :meth:`~ArgumentParser.add_argument`, which defaults to ``False``, specifies if the argument is deprecated and will be removed in the future. For arguments, if ``deprecated`` is ``True``, then a warning will be printed to :data:`sys.stderr` when the argument is used::
sv: Under ett projekts livstid kan vissa argument behöva tas bort från kommandoraden. Innan du tar bort dem bör du informera dina användare om att argumenten är föråldrade och kommer att tas bort. Nyckelordsargumentet ``deprecated`` i :meth:`~ArgumentParser.add_argument`, som har ``False`` som standard, anger om argumentet är föråldrat och kommer att tas bort i framtiden. För argument, om ``deprecated`` är ``True``, kommer en varning att skrivas ut till :data:`sys.stderr` när argumentet används::

source: >>> import argparse >>> parser = argparse.ArgumentParser(prog='snake.py') >>> parser.add_argument('--legs', default=0, type=int, deprecated=True) >>> parser.parse_args([]) Namespace(legs=0) >>> parser.parse_args(['--legs', '4']) snake.py: warning: option '--legs' is deprecated Namespace(legs=4)
sv: >>> import argparse >>> parser = argparse.ArgumentParser(prog='snake.py') >>> parser.add_argument('--legs', default=0, type=int, deprecated=True) >>> parser.parse_args([]) Namnområde(ben=0) >>> parser.parse_args(['--legs', '4']) snake.py: varning: alternativet '--legs' är föråldrat Namnrymd(ben=4)

source: Action classes
sv: Åtgärdsklasser

source: :class:`!Action` classes implement the Action API, a callable which returns a callable which processes arguments from the command-line. Any object which follows this API may be passed as the ``action`` parameter to :meth:`~ArgumentParser.add_argument`.
sv: :class:`!Action`-klasser implementerar Action API, en anropsbar som returnerar en anropsbar som bearbetar argument från kommandoraden. Alla objekt som följer detta API kan skickas som parametern ``action`` till :meth:`~ArgumentParser.add_argument`.

source: :class:`!Action` objects are used by an :class:`ArgumentParser` to represent the information needed to parse a single argument from one or more strings from the command line. The :class:`!Action` class must accept the two positional arguments plus any keyword arguments passed to :meth:`ArgumentParser.add_argument` except for the ``action`` itself.
sv: :class:`!Action`-objekt används av en :class:`ArgumentParser` för att representera den information som behövs för att analysera ett enda argument från en eller flera strängar från kommandoraden. Klassen :class:`!Action` måste acceptera de två positionella argumenten plus alla nyckelordsargument som skickas till :meth:`ArgumentParser.add_argument` förutom själva ``action``.

source: Instances of :class:`!Action` (or return value of any callable to the ``action`` parameter) should have attributes :attr:`!dest`, :attr:`!option_strings`, :attr:`!default`, :attr:`!type`, :attr:`!required`, :attr:`!help`, etc. defined. The easiest way to ensure these attributes are defined is to call :meth:`!Action.__init__`.
sv: Instanser av :class:`!Action` (eller returvärdet av en anropbar till parametern ``action``) bör ha attributen :attr:`!dest`, :attr:`!option_strings`, :attr:`!default`, :attr:`!type`, :attr:`!required`, :attr:`!help`, etc. definierade. Det enklaste sättet att säkerställa att dessa attribut är definierade är att anropa :meth:`!Action.__init__`.

source: :class:`!Action` instances should be callable, so subclasses must override the :meth:`!__call__` method, which should accept four parameters:
sv: :class:`!Action`-instanser ska vara anropsbara, så underklasser måste åsidosätta :meth:`!__call__`-metoden, som ska acceptera fyra parametrar:

source: *parser* - The :class:`ArgumentParser` object which contains this action.
sv: *parser* - Det :class:`ArgumentParser`-objekt som innehåller denna åtgärd.

source: *namespace* - The :class:`Namespace` object that will be returned by :meth:`~ArgumentParser.parse_args`. Most actions add an attribute to this object using :func:`setattr`.
sv: *namespace* - Det :class:`Namespace`-objekt som kommer att returneras av :meth:`~ArgumentParser.parse_args`. De flesta åtgärder lägger till ett attribut till detta objekt med hjälp av :func:`setattr`.

source: *values* - The associated command-line arguments, with any type conversions applied. Type conversions are specified with the type_ keyword argument to :meth:`~ArgumentParser.add_argument`.
sv: *values* - De associerade kommandoradsargumenten, med eventuella typkonverteringar tillämpade. Typkonverteringar anges med nyckelordsargumentet type_ till :meth:`~ArgumentParser.add_argument`.

source: *option_string* - The option string that was used to invoke this action. The ``option_string`` argument is optional, and will be absent if the action is associated with a positional argument.
sv: *option_string* - Den alternativsträng som användes för att anropa denna åtgärd. Argumentet ``option_string`` är valfritt och saknas om åtgärden associeras med ett positionellt argument.

source: The :meth:`!__call__` method may perform arbitrary actions, but will typically set attributes on the ``namespace`` based on ``dest`` and ``values``.
sv: Metoden :meth:`!__call__` kan utföra godtyckliga åtgärder, men kommer vanligtvis att ställa in attribut på ``namespace`` baserat på ``dest`` och ``values``.

source: :class:`!Action` subclasses can define a :meth:`!format_usage` method that takes no argument and return a string which will be used when printing the usage of the program. If such method is not provided, a sensible default will be used.
sv: :class:`!Action` subklasser kan definiera en :meth:`!format_usage` metod som inte tar något argument och returnerar en sträng som kommer att användas vid utskrift av programmets användning. Om en sådan metod inte tillhandahålls kommer en förnuftig standard att användas.

source: A subclass of :class:`Action` for handling boolean flags with positive and negative options. Adding a single argument such as ``--foo`` automatically creates both ``--foo`` and ``--no-foo`` options, storing ``True`` and ``False`` respectively::
sv: En subklass av :class:`Action` för hantering av booleska flaggor med positiva och negativa alternativ. Genom att lägga till ett enda argument som ``--foo`` skapas automatiskt både ``--foo`` och ``--no-foo`` alternativ, som lagrar ``True`` respektive ``False``::

source: >>> import argparse >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action=argparse.BooleanOptionalAction) >>> parser.parse_args(['--no-foo']) Namespace(foo=False)
sv: >>> import argparse >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action=argparse.BooleanOptionalAction) >>> parser.parse_args(['--no-foo']) Namnrymd(foo=False)

source: The parse_args() method
sv: Metoden parse_args()

source: Convert argument strings to objects and assign them as attributes of the namespace. Return the populated namespace.
sv: Konverterar argumentsträngar till objekt och tilldelar dem som attribut för namnrymden. Returnera det ifyllda namnområdet.

source: Previous calls to :meth:`add_argument` determine exactly what objects are created and how they are assigned. See the documentation for :meth:`!add_argument` for details.
sv: Tidigare anrop till :meth:`add_argument` avgör exakt vilka objekt som skapas och hur de tilldelas. Se dokumentationen för :meth:`!add_argument` för mer information.

source: args_ - List of strings to parse. The default is taken from :data:`sys.argv`.
sv: args_ - Lista över strängar som ska analyseras. Standardvärdet hämtas från :data:`sys.argv`.

source: namespace_ - An object to take the attributes. The default is a new empty :class:`Namespace` object.
sv: namespace_ - Ett objekt som tar emot attributen. Standard är ett nytt tomt :class:`Namespace`-objekt.

source: Option value syntax
sv: Syntax för optionsvärde

source: The :meth:`~ArgumentParser.parse_args` method supports several ways of specifying the value of an option (if it takes one). In the simplest case, the option and its value are passed as two separate arguments::
sv: Metoden :meth:`~ArgumentParser.parse_args` stöder flera sätt att ange värdet på ett alternativ (om det tar ett sådant). I det enklaste fallet skickas alternativet och dess värde som två separata argument::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x') >>> parser.add_argument('--foo') >>> parser.parse_args(['-x', 'X']) Namespace(foo=None, x='X') >>> parser.parse_args(['--foo', 'FOO']) Namespace(foo='FOO', x=None)
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.lägg_till_argument('-x') >>> parser.add_argument('--foo') >>> parser.parse_args(['-x', 'X']) Namnrymd(foo=None, x='X') >>> parser.parse_args(['--foo', 'FOO']) Namnrymd(foo='FOO', x=None)

source: For long options (options with names longer than a single character), the option and value can also be passed as a single command-line argument, using ``=`` to separate them::
sv: För långa alternativ (alternativ med namn som är längre än ett enda tecken) kan alternativet och värdet också skickas som ett enda argument på kommandoraden, med ``=`` för att separera dem::

source: >>> parser.parse_args(['--foo=FOO']) Namespace(foo='FOO', x=None)
sv: >>> parser.parse_args(['--foo=FOO']) Namnrymd(foo='FOO', x=None)

source: For short options (options only one character long), the option and its value can be concatenated::
sv: För korta alternativ (alternativ som bara är ett tecken långa) kan alternativet och dess värde sammankopplas::

source: >>> parser.parse_args(['-xX']) Namespace(foo=None, x='X')
sv: >>> parser.parse_args(['-xX']) Namnrymd(foo=None, x='X')

source: Several short options can be joined together, using only a single ``-`` prefix, as long as only the last option (or none of them) requires a value::
sv: Flera korta alternativ kan sammanfogas med hjälp av ett enda prefix ``-``, så länge som endast det sista alternativet (eller inget av dem) kräver ett värde::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x', action='store_true') >>> parser.add_argument('-y', action='store_true') >>> parser.add_argument('-z') >>> parser.parse_args(['-xyzZ']) Namespace(x=True, y=True, z='Z')
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x', action='store_true') >>> parser.add_argument('-y', action='store_true') >>> parser.add_argument('-z') >>> parser.parse_args(['-xyzZ']) Namnrymd(x=True, y=True, z='Z')

source: Invalid arguments
sv: Ogiltiga argument

source: While parsing the command line, :meth:`~ArgumentParser.parse_args` checks for a variety of errors, including ambiguous options, invalid types, invalid options, wrong number of positional arguments, etc. When it encounters such an error, it exits and prints the error along with a usage message::
sv: När kommandoraden analyseras kontrollerar :meth:`~ArgumentParser.parse_args` en mängd olika fel, inklusive tvetydiga alternativ, ogiltiga typer, ogiltiga alternativ, fel antal positionella argument, etc. När den stöter på ett sådant fel avslutas den och skriver ut felet tillsammans med ett användningsmeddelande::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', type=int) >>> parser.add_argument('bar', nargs='?') >>> # invalid type >>> parser.parse_args(['--foo', 'spam']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: argument --foo: invalid int value: 'spam' >>> # invalid option >>> parser.parse_args(['--bar']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: no such option: --bar >>> # wrong number of arguments >>> parser.parse_args(['spam', 'badger']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: extra arguments found: badger
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.lägg_till_argument('--foo', type=int) >>> parser.add_argument('bar', nargs='?') >>> # ogiltig typ >>> parser.parse_args(['--foo', 'spam']) användning: PROG [-h] [--foo FOO] [bar] PROG: fel: argument --foo: ogiltigt int-värde: 'spam' >>> # ogiltigt alternativ >>> parser.parse_args(['--bar']) användning: PROG [-h] [--foo FOO] [bar] PROG: fel: inget sådant alternativ: --bar >>> # fel antal argument >>> parser.parse_args(['spam', 'badger']) användning: PROG [-h] [--foo FOO] [bar] PROG: fel: extra argument hittades: badger

source: Arguments containing ``-``
sv: Argument som innehåller ``-``

source: The :meth:`~ArgumentParser.parse_args` method attempts to give errors whenever the user has clearly made a mistake, but some situations are inherently ambiguous. For example, the command-line argument ``-1`` could either be an attempt to specify an option or an attempt to provide a positional argument. The :meth:`~ArgumentParser.parse_args` method is cautious here: positional arguments may only begin with ``-`` if they look like negative numbers and there are no options in the parser that look like negative numbers::
sv: Metoden :meth:`~ArgumentParser.parse_args` försöker ge felmeddelanden när det är uppenbart att användaren har gjort ett misstag, men vissa situationer är i sig tvetydiga. Till exempel kan kommandoradsargumentet ``-1`` antingen vara ett försök att ange ett alternativ eller ett försök att ange ett positionsargument. Metoden :meth:`~ArgumentParser.parse_args` är försiktig här: positionella argument får endast börja med ``-`` om de ser ut som negativa tal och det inte finns några alternativ i parsern som ser ut som negativa tal::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x') >>> parser.add_argument('foo', nargs='?') >>> # no negative number options, so -1 is a positional argument >>> parser.parse_args(['-x', '-1']) Namespace(foo=None, x='-1') >>> # no negative number options, so -1 and -5 are positional arguments >>> parser.parse_args(['-x', '-1', '-5']) Namespace(foo='-5', x='-1') >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-1', dest='one') >>> parser.add_argument('foo', nargs='?') >>> # negative number options present, so -1 is an option >>> parser.parse_args(['-1', 'X']) Namespace(foo=None, one='X') >>> # negative number options present, so -2 is an option >>> parser.parse_args(['-2']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: no such option: -2 >>> # negative number options present, so both -1s are options >>> parser.parse_args(['-1', '-1']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: argument -1: expected one argument
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.lägg_till_argument('-x') >>> parser.add_argument('foo', nargs='?') >>> # inga negativa talalternativ, så -1 är ett positionellt argument >>> parser.parse_args(['-x', '-1']) Namnrymd(foo=None, x='-1') >>> # inga negativa talalternativ, så -1 och -5 är positionella argument >>> parser.parse_args(['-x', '-1', '-5']) Namespace(foo='-5', x='-1') >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-1', dest='one') >>> parser.add_argument('foo', nargs='?') >>> # alternativ för negativa tal finns, så -1 är ett alternativ >>> parser.parse_args(['-1', 'X']) Namnrymd(foo=None, one='X') >>> # alternativ för negativa tal finns, så -2 är ett alternativ >>> parser.parse_args(['-2']) användning: PROG [-h] [-1 ONE] [foo] PROG: fel: inget sådant alternativ: -2 >>> # negativt antal alternativ närvarande, så båda -1 är alternativ >>> parser.parse_args(['-1', '-1']) användning: PROG [-h] [-1 ONE] [foo] PROG: fel: argument -1: förväntat ett argument

source: If you have positional arguments that must begin with ``-`` and don't look like negative numbers, you can insert the pseudo-argument ``'--'`` which tells :meth:`~ArgumentParser.parse_args` that everything after that is a positional argument::
sv: Om du har positionella argument som måste börja med ``-`` och inte ser ut som negativa tal, kan du infoga pseudoargumentet ``'--'`` som talar om för :meth:`~ArgumentParser.parse_args` att allt efter det är ett positionellt argument::

source: >>> parser.parse_args(['--', '-f']) Namespace(foo='-f', one=None)
sv: >>> parser.parse_args(['--', '-f']) Namnrymd(foo='-f', one=None)

source: See also :ref:`the argparse howto on ambiguous arguments <specifying-ambiguous-arguments>` for more details.
sv: Se även :ref:`the argparse howto on ambiguous arguments <specifying-ambiguous-arguments>` för mer information.

source: Argument abbreviations (prefix matching)
sv: Argumentförkortningar (prefixmatchning)

source: The :meth:`~ArgumentParser.parse_args` method :ref:`by default <allow_abbrev>` allows long options to be abbreviated to a prefix, if the abbreviation is unambiguous (the prefix matches a unique option)::
sv: Metoden :meth:`~ArgumentParser.parse_args` :ref:``by default <allow_abbrev>` tillåter att långa alternativ förkortas till ett prefix, om förkortningen är otvetydig (prefixet matchar ett unikt alternativ)::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-bacon') >>> parser.add_argument('-badger') >>> parser.parse_args('-bac MMM'.split()) Namespace(bacon='MMM', badger=None) >>> parser.parse_args('-bad WOOD'.split()) Namespace(bacon=None, badger='WOOD') >>> parser.parse_args('-ba BA'.split()) usage: PROG [-h] [-bacon BACON] [-badger BADGER] PROG: error: ambiguous option: -ba could match -badger, -bacon
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.lägg_till_argument('-bacon') >>> parser.lägg_till_argument('-badger') >>> parser.parse_args('-bac MMM'.split()) Namnrymd(bacon='MMM', badger=None) >>> parser.parse_args('-bad WOOD'.split()) Namnrymd(bacon=None, grävling='WOOD') >>> parser.parse_args('-ba BA'.split()) användning: PROG [-h] [-bacon BACON] [-badger BADGER] PROG: fel: tvetydigt alternativ: -ba kan matcha -badger, -bacon

source: An error is produced for arguments that could produce more than one options. This feature can be disabled by setting :ref:`allow_abbrev` to ``False``.
sv: Ett felmeddelande visas för argument som kan ge mer än ett alternativ. Denna funktion kan avaktiveras genom att ställa in :ref:`allow_abbrev` till ``False``.

source: Beyond ``sys.argv``
sv: Bortom ``sys.argv``

source: Sometimes it may be useful to have an :class:`ArgumentParser` parse arguments other than those of :data:`sys.argv`. This can be accomplished by passing a list of strings to :meth:`~ArgumentParser.parse_args`. This is useful for testing at the interactive prompt::
sv: Ibland kan det vara användbart att låta en :class:`ArgumentParser` analysera andra argument än de som finns i :data:`sys.argv`. Detta kan åstadkommas genom att skicka en lista med strängar till :meth:`~ArgumentParser.parse_args`. Detta är användbart för att testa vid den interaktiva prompten::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument( ... 'integers', metavar='int', type=int, choices=range(10), ... nargs='+', help='an integer in the range 0..9') >>> parser.add_argument( ... '--sum', dest='accumulate', action='store_const', const=sum, ... default=max, help='sum the integers (default: find the max)') >>> parser.parse_args(['1', '2', '3', '4']) Namespace(accumulate=<built-in function max>, integers=[1, 2, 3, 4]) >>> parser.parse_args(['1', '2', '3', '4', '--sum']) Namespace(accumulate=<built-in function sum>, integers=[1, 2, 3, 4])
sv: &gt;&gt;&gt; parser = argparse.ArgumentParser() &gt;&gt;&gt; parser.lägg_till_argument( ... 'heltal', metavar='int', type=int, choices=intervall(10), ... nargs='+', help='ett heltal i intervallet 0..9') &gt;&gt;&gt; parser.add_argument( ... '--sum', dest='accumulate', action='store_const', const=sum, ... default=max, help='summera heltalen (default: hitta max)') &gt;&gt;&gt; parser.parse_args(['1', '2', '3', '4']) Namespace(ackumulera=<built-in function max>, heltal=[1, 2, 3, 4]) &gt;&gt;&gt; parser.parse_args(['1', '2', '3', '4', '--sum']) Namespace(ackumulera=<built-in function sum>, heltal=[1, 2, 3, 4])

source: The Namespace object
sv: Namespace-objektet

source: Simple class used by default by :meth:`~ArgumentParser.parse_args` to create an object holding attributes and return it.
sv: Enkel klass som används som standard av :meth:`~ArgumentParser.parse_args` för att skapa ett objekt som innehåller attribut och returnera det.

source: This class is deliberately simple, just an :class:`object` subclass with a readable string representation. If you prefer to have dict-like view of the attributes, you can use the standard Python idiom, :func:`vars`::
sv: Den här klassen är avsiktligt enkel, bara en :class:`object`-underklass med en läsbar strängrepresentation. Om du föredrar att ha en diktliknande vy över attributen kan du använda Pythons standardidiom, :func:`vars`::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo') >>> args = parser.parse_args(['--foo', 'BAR']) >>> vars(args) {'foo': 'BAR'}
sv: >>> parser = argparse.ArgumentParser() >>> parser.lägg_till_argument('--foo') >>> args = parser.parse_args(['--foo', 'BAR']) >>> vars(args) {'foo': 'BAR'}

source: It may also be useful to have an :class:`ArgumentParser` assign attributes to an already existing object, rather than a new :class:`Namespace` object. This can be achieved by specifying the ``namespace=`` keyword argument::
sv: Det kan också vara användbart att låta en :class:`ArgumentParser` tilldela attribut till ett redan existerande objekt, snarare än ett nytt :class:`Namespace`-objekt. Detta kan uppnås genom att ange nyckelordet ``namespace=`` argument::

source: >>> class C: ... pass ... >>> c = C() >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo') >>> parser.parse_args(args=['--foo', 'BAR'], namespace=c) >>> c.foo 'BAR'
sv: >>> klass C: ... pass ... >>> c = C() >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo') >>> parser.parse_args(args=['--foo', 'BAR'], namespace=c) >>> c.foo 'BAR'

source: Other utilities
sv: Andra verktyg

source: Sub-commands
sv: Underkommandon

source: Many programs split up their functionality into a number of subcommands, for example, the ``svn`` program can invoke subcommands like ``svn checkout``, ``svn update``, and ``svn commit``. Splitting up functionality this way can be a particularly good idea when a program performs several different functions which require different kinds of command-line arguments. :class:`ArgumentParser` supports the creation of such subcommands with the :meth:`!add_subparsers` method. The :meth:`!add_subparsers` method is normally called with no arguments and returns a special action object. This object has a single method, :meth:`~_SubParsersAction.add_parser`, which takes a command name and any :class:`!ArgumentParser` constructor arguments, and returns an :class:`!ArgumentParser` object that can be modified as usual.
sv: Många program delar upp sin funktionalitet i ett antal underkommandon, till exempel kan programmet ```svn`` anropa underkommandon som ```svn checkout``, ``vn update`` och ``vn commit``. Att dela upp funktionalitet på det här sättet kan vara en särskilt bra idé när ett program utför flera olika funktioner som kräver olika typer av kommandoradsargument. :class:`ArgumentParser` stöder skapandet av sådana underkommandon med metoden :meth:`!add_subparsers`. Metoden :meth:`!add_subparsers` anropas normalt utan argument och returnerar ett speciellt action-objekt. Detta objekt har en enda metod, :meth:`~_SubParsersAction.add_parser`, som tar ett kommandonamn och eventuella :class:`!ArgumentParser`-konstruktorargument, och returnerar ett :class:`!ArgumentParser`-objekt som kan modifieras som vanligt.

source: Description of parameters:
sv: Beskrivning av parametrar:
