Repository: yeager/python-docs-sv
Catalog: library/argparse.po
Languages: sv

source: For example, an optional argument could be created like::
sv: Ett valfritt argument kan t.ex. skapas på följande sätt::

source: while a positional argument could be created like::
sv: medan ett positionellt argument kan skapas som::

source: When :meth:`~ArgumentParser.parse_args` is called, optional arguments will be identified by the ``-`` prefix, and the remaining arguments will be assumed to be positional::
sv: När :meth:`~ArgumentParser.parse_args` anropas kommer valfria argument att identifieras med prefixet ``-``, och de återstående argumenten kommer att antas vara positionella::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo') >>> parser.add_argument('bar') >>> parser.parse_args(['BAR']) Namespace(bar='BAR', foo=None) >>> parser.parse_args(['BAR', '--foo', 'FOO']) Namespace(bar='BAR', foo='FOO') >>> parser.parse_args(['--foo', 'FOO']) usage: PROG [-h] [-f FOO] bar PROG: error: the following arguments are required: bar
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.lägg_till_argument('-f', '--foo') >>> parser.lägg_till_argument('bar') >>> parser.parse_args(['BAR']) Namnrymd(bar='BAR', foo=None) >>> parser.parse_args(['BAR', '--foo', 'FOO']) Namespace(bar='BAR', foo='FOO') >>> parser.parse_args(['--foo', 'FOO']) användning: PROG [-h] [-f FOO] bar PROG: fel: följande argument krävs: bar

source: By default, :mod:`!argparse` automatically handles the internal naming and display names of arguments, simplifying the process without requiring additional configuration. As such, you do not need to specify the dest_ and metavar_ parameters. The dest_ parameter defaults to the argument name with underscores ``_`` replacing hyphens ``-`` . The metavar_ parameter defaults to the upper-cased name. For example::
sv: Som standard hanterar :mod:`!argparse` automatiskt den interna namngivningen och visningsnamnen för argument, vilket förenklar processen utan att kräva ytterligare konfiguration. Därför behöver du inte ange parametrarna dest_ och metavar_. Parametern dest_ är som standard argumentnamnet med understrykningar ``_`` som ersätter bindestreck ``-`` . Parametern metavar_ använder som standard namnet med versaler. Till exempel::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo-bar') >>> parser.parse_args(['--foo-bar', 'FOO-BAR'] Namespace(foo_bar='FOO-BAR') >>> parser.print_help() usage: [-h] [--foo-bar FOO-BAR] optional arguments: -h, --help show this help message and exit --foo-bar FOO-BAR
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo-bar') >>> parser.parse_args(['--foo-bar', 'FOO-BAR'] Namespace(foo_bar='FOO-BAR') >>> parser.print_help() användning: [-h] [--foo-bar FOO-BAR] valfria argument: -h, --help visa detta hjälpmeddelande och avsluta --foo-bar FOO-BAR

source: action
sv: åtgärd

source: :class:`ArgumentParser` objects associate command-line arguments with actions. These actions can do just about anything with the command-line arguments associated with them, though most actions simply add an attribute to the object returned by :meth:`~ArgumentParser.parse_args`. The ``action`` keyword argument specifies how the command-line arguments should be handled. The supplied actions are:
sv: :class:`ArgumentParser`-objekt associerar kommandoradsargument med åtgärder. Dessa åtgärder kan göra nästan vad som helst med de kommandoradsargument som associeras med dem, även om de flesta åtgärder helt enkelt lägger till ett attribut till det objekt som returneras av :meth:`~ArgumentParser.parse_args`. Nyckelordsargumentet ``action`` anger hur kommandoradsargumenten ska hanteras. De medföljande åtgärderna är:

source: ``'store'`` - This just stores the argument's value. This is the default action.
sv: ``'store'`` - Detta lagrar bara argumentets värde. Detta är standardåtgärden.

source: ``'store_const'`` - This stores the value specified by the const_ keyword argument; note that the const_ keyword argument defaults to ``None``. The ``'store_const'`` action is most commonly used with optional arguments that specify some sort of flag. For example::
sv: ``'store_const'`` - Detta lagrar det värde som anges av const_-nyckelordsargumentet; observera att const_-nyckelordsargumentet som standard är ``None``. Aktionen ``'store_const'`` används oftast med valfria argument som anger någon form av flagga. Till exempel::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_const', const=42) >>> parser.parse_args(['--foo']) Namespace(foo=42)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_const', const=42) >>> parser.parse_args(['--foo']) Namnrymd(foo=42)

source: ``'store_true'`` and ``'store_false'`` - These are special cases of ``'store_const'`` used for storing the values ``True`` and ``False`` respectively. In addition, they create default values of ``False`` and ``True`` respectively::
sv: ``'store_true'`` och ``'store_false'`` - Dessa är specialfall av ``'store_const'`` som används för att lagra värdena ``True`` respektive ``False``. Dessutom skapar de standardvärden för ``False`` respektive ``True``::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_true') >>> parser.add_argument('--bar', action='store_false') >>> parser.add_argument('--baz', action='store_false') >>> parser.parse_args('--foo --bar'.split()) Namespace(foo=True, bar=False, baz=True)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_true') >>> parser.add_argument('--bar', action='store_false') >>> parser.add_argument('--baz', action='store_false') >>> parser.parse_args('--foo --bar'.split()) Namnrymd(foo=True, bar=False, baz=True)

source: ``'append'`` - This stores a list, and appends each argument value to the list. It is useful to allow an option to be specified multiple times. If the default value is non-empty, the default elements will be present in the parsed value for the option, with any values from the command line appended after those default values. Example usage::
sv: ``'append'`` - Detta lagrar en lista och lägger till varje argumentvärde i listan. Det är användbart för att tillåta att ett alternativ anges flera gånger. Om standardvärdet inte är tomt kommer standardelementen att finnas i det analyserade värdet för alternativet, med eventuella värden från kommandoraden tillagda efter dessa standardvärden. Exempel på användning::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='append') >>> parser.parse_args('--foo 1 --foo 2'.split()) Namespace(foo=['1', '2'])
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='append') >>> parser.parse_args('--foo 1 --foo 2'.split()) Namnrymd(foo=['1', '2'])

source: ``'append_const'`` - This stores a list, and appends the value specified by the const_ keyword argument to the list; note that the const_ keyword argument defaults to ``None``. The ``'append_const'`` action is typically useful when multiple arguments need to store constants to the same list. For example::
sv: ``'append_const'`` - Detta lagrar en lista och lägger till det värde som anges av const_-nyckelordsargumentet till listan; observera att const_-nyckelordsargumentet som standard är ``None``. Åtgärden ``'append_const'`` är vanligtvis användbar när flera argument behöver lagra konstanter i samma lista. Till exempel::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--str', dest='types', action='append_const', const=str) >>> parser.add_argument('--int', dest='types', action='append_const', const=int) >>> parser.parse_args('--str --int'.split()) Namespace(types=[<class 'str'>, <class 'int'>])
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--str', dest='types', action='append_const', const=str) >>> parser.add_argument('--int', dest='types', action='append_const', const=int) >>> parser.parse_args('--str --int'.split()) Namnrymd(types=[<class 'str'>, <class 'int'>])

source: ``'extend'`` - This stores a list and appends each item from the multi-value argument list to it. The ``'extend'`` action is typically used with the nargs_ keyword argument value ``'+'`` or ``'*'``. Note that when nargs_ is ``None`` (the default) or ``'?'``, each character of the argument string will be appended to the list. Example usage::
sv: ``'extend'`` - Detta lagrar en lista och lägger till varje objekt från den flervärdiga argumentlistan till den. Åtgärden ``'extend'`` används vanligtvis med nyckelordet nargs_ med argumentvärdet ``'+'`` eller ``'*'``. Observera att när nargs_ är ``None`` (standard) eller ``'?'``, kommer varje tecken i argumentsträngen att läggas till i listan. Exempel på användning::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument("--foo", action="extend", nargs="+", type=str) >>> parser.parse_args(["--foo", "f1", "--foo", "f2", "f3", "f4"]) Namespace(foo=['f1', 'f2', 'f3', 'f4'])
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument("--foo", action="extend", nargs="+", type=str) >>> parser.parse_args(["--foo", "f1", "--foo", "f2", "f3", "f4"]) Namnrymd(foo=['f1', 'f2', 'f3', 'f4'])

source: ``'count'`` - This counts the number of times a keyword argument occurs. For example, this is useful for increasing verbosity levels::
sv: ``'count'`` - Detta räknar antalet gånger ett nyckelordsargument förekommer. Detta är t.ex. användbart för att öka ordrikedomen::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--verbose', '-v', action='count', default=0) >>> parser.parse_args(['-vvv']) Namespace(verbose=3)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--verbose', '-v', action='count', default=0) >>> parser.parse_args(['-vvv']) Namnrymd(verbose=3)

source: Note, the *default* will be ``None`` unless explicitly set to *0*.
sv: Observera att *standard* kommer att vara ``None`` om det inte uttryckligen sätts till *0*.

source: ``'help'`` - This prints a complete help message for all the options in the current parser and then exits. By default a help action is automatically added to the parser. See :class:`ArgumentParser` for details of how the output is created.
sv: ``'help'`` - Detta skriver ut ett komplett hjälpmeddelande för alla alternativ i den aktuella parsern och avslutar sedan. Som standard läggs en hjälpåtgärd automatiskt till i parsern. Se :class:`ArgumentParser` för detaljer om hur utdata skapas.

source: ``'version'`` - This expects a ``version=`` keyword argument in the :meth:`~ArgumentParser.add_argument` call, and prints version information and exits when invoked::
sv: ``'version'`` - Detta förväntar sig ett ``version=`` nyckelordsargument i :meth:`~ArgumentParser.add_argument`-anropet, och skriver ut versionsinformation och avslutas när det anropas::

source: You may also specify an arbitrary action by passing an :class:`Action` subclass (e.g. :class:`BooleanOptionalAction`) or other object that implements the same interface. Only actions that consume command-line arguments (e.g. ``'store'``, ``'append'``, ``'extend'``, or custom actions with non-zero ``nargs``) can be used with positional arguments.
sv: Du kan också ange en godtycklig åtgärd genom att skicka en :class:`Action`-underklass (t.ex. :class:`BooleanOptionalAction`) eller ett annat objekt som implementerar samma gränssnitt. Endast åtgärder som använder kommandoradsargument (t.ex. ``'store'``, ``'append'``, ``'extend'`` eller anpassade åtgärder med ``nargs`` som inte är noll) kan användas med positionella argument.

source: The recommended way to create a custom action is to extend :class:`Action`, overriding the :meth:`!__call__` method and optionally the :meth:`!__init__` and :meth:`!format_usage` methods. You can also register custom actions using the :meth:`~ArgumentParser.register` method and reference them by their registered name.
sv: Det rekommenderade sättet att skapa en anpassad åtgärd är att utöka :class:`Action`, åsidosätta metoden :meth:`!__call__` och eventuellt metoderna :meth:`!__init__` och :meth:`!format_usage`. Du kan också registrera anpassade åtgärder med hjälp av metoden :meth:`~ArgumentParser.register` och referera till dem med deras registrerade namn.

source: An example of a custom action::
sv: Ett exempel på en anpassad åtgärd::

source: >>> class FooAction(argparse.Action): ... def __init__(self, option_strings, dest, nargs=None, **kwargs): ... if nargs is not None: ... raise ValueError("nargs not allowed") ... super().__init__(option_strings, dest, **kwargs) ... def __call__(self, parser, namespace, values, option_string=None): ... print('%r %r %r' % (namespace, values, option_string)) ... setattr(namespace, self.dest, values) ... >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action=FooAction) >>> parser.add_argument('bar', action=FooAction) >>> args = parser.parse_args('1 --foo 2'.split()) Namespace(bar=None, foo=None) '1' None Namespace(bar='1', foo=None) '2' '--foo' >>> args Namespace(bar='1', foo='2')
sv: >>> klass FooAction(argparse.Action): ... def __init__(self, option_strings, dest, nargs=None, **kwargs): ... om nargs inte är None: ... raise ValueError("nargs är inte tillåtet") ... super().__init__(option_strings, dest, **kwargs) ... def __call__(self, parser, namespace, values, option_string=None): ... print('%r %r %r' % (namespace, values, option_string)) ... setattr(namespace, self.dest, värden) ... >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action=FooAction) >>> parser.add_argument('bar', action=FooAction) >>> args = parser.parse_args('1 --foo 2'.split()) Namespace(bar=None, foo=None) '1' None Namespace(bar='1', foo=None) '2' '--foo' >>> args Namespace(bar='1', foo='2')

source: For more details, see :class:`Action`.
sv: För mer information, se :class:`Action`.

source: :class:`ArgumentParser` objects usually associate a single command-line argument with a single action to be taken. The ``nargs`` keyword argument associates a different number of command-line arguments with a single action. See also :ref:`specifying-ambiguous-arguments`. The supported values are:
sv: :class:`ArgumentParser`-objekt associerar vanligtvis ett enda kommandoradsargument med en enda åtgärd som skall vidtas. Nyckelordsargumentet ``nargs`` associerar ett annat antal kommandoradsargument med en enda åtgärd. Se även :ref:`specifying-ambiguous-arguments`. De värden som stöds är:

source: ``N`` (an integer). ``N`` arguments from the command line will be gathered together into a list. For example::
sv: ``N`` (ett heltal). ``N`` argument från kommandoraden kommer att samlas ihop till en lista. Till exempel::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', nargs=2) >>> parser.add_argument('bar', nargs=1) >>> parser.parse_args('c --foo a b'.split()) Namespace(bar=['c'], foo=['a', 'b'])
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', nargs=2) >>> parser.add_argument('bar', nargs=1) >>> parser.parse_args('c --foo a b'.split()) Namnrymd(bar=['c'], foo=['a', 'b'])

source: Note that ``nargs=1`` produces a list of one item. This is different from the default, in which the item is produced by itself.
sv: Observera att ``nargs=1`` producerar en lista med ett objekt. Detta skiljer sig från standardinställningen, där varje objekt produceras för sig.

source: ``'?'``. One argument will be consumed from the command line if possible, and produced as a single item. If no command-line argument is present, the value from default_ will be produced. Note that for optional arguments, there is an additional case - the option string is present but not followed by a command-line argument. In this case the value from const_ will be produced. Some examples to illustrate this::
sv: ``'?'``. Ett argument hämtas från kommandoraden om möjligt och produceras som ett enda objekt. Om det inte finns något argument på kommandoraden produceras värdet från default_. Observera att för valfria argument finns det ytterligare ett fall - alternativsträngen finns men följs inte av ett kommandoradsargument. I detta fall kommer värdet från const_ att produceras. Några exempel för att illustrera detta::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', nargs='?', const='c', default='d') >>> parser.add_argument('bar', nargs='?', default='d') >>> parser.parse_args(['XX', '--foo', 'YY']) Namespace(bar='XX', foo='YY') >>> parser.parse_args(['XX', '--foo']) Namespace(bar='XX', foo='c') >>> parser.parse_args([]) Namespace(bar='d', foo='d')
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', nargs='?', const='c', default='d') >>> parser.add_argument('bar', nargs='?', default='d') >>> parser.parse_args(['XX', '--foo', 'YY']) Namnrymd(bar='XX', foo='YY') >>> parser.parse_args(['XX', '--foo']) Namnrymd(bar='XX', foo='c') >>> parser.parse_args([]) Namnområde(bar='d', foo='d')

source: One of the more common uses of ``nargs='?'`` is to allow optional input and output files::
sv: En av de vanligaste användningarna av ``nargs='?'`` är att tillåta valfria inmatnings- och utdatafiler::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('infile', nargs='?') >>> parser.add_argument('outfile', nargs='?') >>> parser.parse_args(['input.txt', 'output.txt']) Namespace(infile='input.txt', outfile='output.txt') >>> parser.parse_args(['input.txt']) Namespace(infile='input.txt', outfile=None) >>> parser.parse_args([]) Namespace(infile=None, outfile=None)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('infile', nargs='?') >>> parser.add_argument('outfile', nargs='?') >>> parser.parse_args(['input.txt', 'output.txt']) Namnrymd(infile='input.txt', outfile='output.txt') >>> parser.parse_args(['input.txt']) Namespace(infile='input.txt', outfile=None) >>> parser.parse_args([]) Namnrymd(infile=None, outfile=None)

source: ``'*'``. All command-line arguments present are gathered into a list. Note that it generally doesn't make much sense to have more than one positional argument with ``nargs='*'``, but multiple optional arguments with ``nargs='*'`` is possible. For example::
sv: ``'*'``. Alla kommandoradsargument som finns samlas i en lista. Observera att det i allmänhet inte är särskilt meningsfullt att ha mer än ett positionellt argument med ``nargs='*'``, men det är möjligt att ha flera valfria argument med ``nargs='*'``. Till exempel::

source: ``'+'``. Just like ``'*'``, all command-line arguments present are gathered into a list. Additionally, an error message will be generated if there wasn't at least one command-line argument present. For example::
sv: ``'+'``. Precis som i ``'*'`` samlas alla kommandoradsargument som finns i en lista. Dessutom genereras ett felmeddelande om det inte fanns minst ett kommandoradsargument. Till exempel::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', nargs='+') >>> parser.parse_args(['a', 'b']) Namespace(foo=['a', 'b']) >>> parser.parse_args([]) usage: PROG [-h] foo [foo ...] PROG: error: the following arguments are required: foo
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', nargs='+') >>> parser.parse_args(['a', 'b']) Namespace(foo=['a', 'b']) >>> parser.parse_args([]) användning: PROG [-h] foo [foo ...] PROG: fel: följande argument krävs: foo

source: If the ``nargs`` keyword argument is not provided, the number of arguments consumed is determined by the action_. Generally this means a single command-line argument will be consumed and a single item (not a list) will be produced. Actions that do not consume command-line arguments (e.g. ``'store_const'``) set ``nargs=0``.
sv: Om nyckelordsargumentet ``nargs`` inte anges, bestäms antalet argument som förbrukas av action_. I allmänhet innebär detta att ett enda kommandoradsargument kommer att förbrukas och ett enda objekt (inte en lista) kommer att produceras. Åtgärder som inte förbrukar kommandoradsargument (t.ex. ``'store_const'``) anger ``nargs=0``.

source: const
sv: konst

source: The ``const`` argument of :meth:`~ArgumentParser.add_argument` is used to hold constant values that are not read from the command line but are required for the various :class:`ArgumentParser` actions. The two most common uses of it are:
sv: Argumentet ``const`` i :meth:`~ArgumentParser.add_argument` används för att hålla konstanta värden som inte läses från kommandoraden men som krävs för de olika :class:`ArgumentParser`-åtgärderna. De två vanligaste användningarna av den är:

source: When :meth:`~ArgumentParser.add_argument` is called with ``action='store_const'`` or ``action='append_const'``. These actions add the ``const`` value to one of the attributes of the object returned by :meth:`~ArgumentParser.parse_args`. See the action_ description for examples. If ``const`` is not provided to :meth:`~ArgumentParser.add_argument`, it will receive a default value of ``None``.
sv: När :meth:`~ArgumentParser.add_argument` anropas med ``action='store_const'`` eller ``action='append_const'``. Dessa åtgärder lägger till ``const``-värdet till ett av attributen i objektet som returneras av :meth:`~ArgumentParser.parse_args`. Se beskrivningen av action_ för exempel. Om ``const`` inte anges till :meth:`~ArgumentParser.add_argument`, kommer det att få ett standardvärde på ``None``.

source: When :meth:`~ArgumentParser.add_argument` is called with option strings (like ``-f`` or ``--foo``) and ``nargs='?'``. This creates an optional argument that can be followed by zero or one command-line arguments. When parsing the command line, if the option string is encountered with no command-line argument following it, the value of ``const`` will be assumed to be ``None`` instead. See the nargs_ description for examples.
sv: När :meth:`~ArgumentParser.add_argument` anropas med optionssträngar (som ``-f`` eller ``--foo``) och ``nargs='?'``. Detta skapar ett valfritt argument som kan följas av noll eller ett kommandoradsargument. Om alternativsträngen påträffas utan något efterföljande kommandoradsargument när kommandoraden analyseras, kommer värdet på ``const`` att antas vara ``None`` istället. Se nargs_-beskrivningen för exempel.

source: ``const=None`` by default, including when ``action='append_const'`` or ``action='store_const'``.
sv: ``const=None`` som standard, inklusive när ``action='append_const'`` eller ``action='store_const'``.

source: default
sv: standard

source: All optional arguments and some positional arguments may be omitted at the command line. The ``default`` keyword argument of :meth:`~ArgumentParser.add_argument`, whose value defaults to ``None``, specifies what value should be used if the command-line argument is not present. For optional arguments, the ``default`` value is used when the option string was not present at the command line::
sv: Alla valfria argument och vissa positionella argument kan utelämnas på kommandoraden. Nyckelordsargumentet ``default`` i :meth:`~ArgumentParser.add_argument`, vars standardvärde är ``None``, anger vilket värde som ska användas om kommandoradsargumentet inte finns med. För valfria argument används ``default``-värdet när alternativsträngen inte fanns på kommandoraden::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default=42) >>> parser.parse_args(['--foo', '2']) Namespace(foo='2') >>> parser.parse_args([]) Namespace(foo=42)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default=42) >>> parser.parse_args(['--foo', '2']) Namnrymd(foo='2') >>> parser.parse_args([]) Namnrymd(foo=42)
