Repository: yeager/python-docs-sv
Catalog: library/argparse.po
Languages: sv

source: :mod:`!argparse` --- Parser for command-line options, arguments and subcommands
sv: :mod:`!argparse` --- Parser för kommandoradsalternativ, argument och underkommandon

source: **Source code:** :source:`Lib/argparse.py`
sv: **Källkod:** :source:`Lib/argparse.py`

source: While :mod:`argparse` is the default recommended standard library module for implementing basic command line applications, authors with more exacting requirements for exactly how their command line applications behave may find it doesn't provide the necessary level of control. Refer to :ref:`choosing-an-argument-parser` for alternatives to consider when ``argparse`` doesn't support behaviors that the application requires (such as entirely disabling support for interspersed options and positional arguments, or accepting option parameter values that start with ``-`` even when they correspond to another defined option).
sv: Medan :mod:`argparse` är den rekommenderade standardbiblioteksmodulen för implementering av grundläggande kommandoradsapplikationer, kan författare med mer krävande krav på exakt hur deras kommandoradsapplikationer beter sig tycka att den inte ger den nödvändiga kontrollnivån. Se :ref:`choosing-an-argument-parser` för alternativ att överväga när ``argparse`` inte stöder beteenden som programmet kräver (t.ex. att helt inaktivera stöd för insprängda alternativ och positionella argument, eller att acceptera alternativparametervärden som börjar med ``-`` även om de motsvarar ett annat definierat alternativ).

source: Tutorial
sv: Handledning

source: This page contains the API reference information. For a more gentle introduction to Python command-line parsing, have a look at the :ref:`argparse tutorial <argparse-tutorial>`.
sv: Den här sidan innehåller API-referensinformation. För en mer skonsam introduktion till Python kommandoradsanalys, ta en titt på :ref:`argparse tutorial <argparse-tutorial>`.

source: The :mod:`!argparse` module makes it easy to write user-friendly command-line interfaces. The program defines what arguments it requires, and :mod:`!argparse` will figure out how to parse those out of :data:`sys.argv`. The :mod:`!argparse` module also automatically generates help and usage messages. The module will also issue errors when users give the program invalid arguments.
sv: Modulen :mod:`!argparse` gör det enkelt att skriva användarvänliga kommandoradsgränssnitt. Programmet definierar vilka argument det behöver och :mod:`!argparse` räknar ut hur dessa ska tolkas ur :data:`sys.argv`. Modulen :mod:`!argparse` genererar också automatiskt hjälp- och användningsmeddelanden. Modulen kommer också att ge felmeddelanden när användare ger programmet ogiltiga argument.

source: The :mod:`!argparse` module's support for command-line interfaces is built around an instance of :class:`argparse.ArgumentParser`. It is a container for argument specifications and has options that apply to the parser as whole::
sv: :mod:`!argparse`-modulens stöd för kommandoradsgränssnitt är uppbyggt kring en instans av :class:`argparse.ArgumentParser`. Den är en behållare för argumentspecifikationer och har alternativ som gäller för parsern som helhet::

source: parser = argparse.ArgumentParser( prog='ProgramName', description='What the program does', epilog='Text at the bottom of help')
sv: parser = argparse.ArgumentParser( prog='Programnamn', description='Vad programmet gör', epilog='Text längst ner i hjälpen')

source: The :meth:`ArgumentParser.add_argument` method attaches individual argument specifications to the parser. It supports positional arguments, options that accept values, and on/off flags::
sv: Metoden :meth:`ArgumentParser.add_argument` kopplar individuella argumentspecifikationer till parsern. Den stöder positionella argument, alternativ som accepterar värden och on/off-flaggor::

source: parser.add_argument('filename') # positional argument parser.add_argument('-c', '--count') # option that takes a value parser.add_argument('-v', '--verbose', action='store_true') # on/off flag
sv: parser.add_argument('filnamn') # positionellt argument parser.add_argument('-c', '--count') # alternativ som tar ett värde parser.add_argument('-v', '--verbose', action='store_true') # på/av-flagga

source: The :meth:`ArgumentParser.parse_args` method runs the parser and places the extracted data in a :class:`argparse.Namespace` object::
sv: Metoden :meth:`ArgumentParser.parse_args` kör parsern och placerar de extraherade uppgifterna i ett :class:`argparse.Namespace`-objekt::

source: args = parser.parse_args() print(args.filename, args.count, args.verbose)
sv: args = parser.parse_args() print(args.filnamn, args.antal, args.verbose)

source: If you're looking for a guide about how to upgrade :mod:`optparse` code to :mod:`!argparse`, see :ref:`Upgrading Optparse Code <upgrading-optparse-code>`.
sv: Om du letar efter en guide om hur du uppgraderar :mod:`optparse`-kod till :mod:`!argparse`, se :ref:`Uppgradering av Optparse-kod <upgrading-optparse-code>`.

source: ArgumentParser objects
sv: ArgumentParser-objekt

source: Create a new :class:`ArgumentParser` object. All parameters should be passed as keyword arguments. Each parameter has its own more detailed description below, but in short they are:
sv: Skapa ett nytt :class:`ArgumentParser`-objekt. Alla parametrar ska skickas som nyckelordsargument. Varje parameter har sin egen mer detaljerade beskrivning nedan, men i korthet är de:

source: prog_ - The name of the program (default: generated from the ``__main__`` module attributes and ``sys.argv[0]``)
sv: prog_ - Namnet på programmet (standard: genereras från modulattributen ``__main__`` och ```sys.argv[0]``)

source: usage_ - The string describing the program usage (default: generated from arguments added to parser)
sv: usage_ - Sträng som beskriver hur programmet används (standard: genereras från argument som läggs till i parsern)

source: description_ - Text to display before the argument help (by default, no text)
sv: description_ - Text som ska visas före argumentet help (ingen text som standard)

source: epilog_ - Text to display after the argument help (by default, no text)
sv: epilog_ - Text som ska visas efter argumentet help (ingen text som standard)

source: parents_ - A list of :class:`ArgumentParser` objects whose arguments should also be included
sv: parents_ - En lista över :class:`ArgumentParser`-objekt vars argument också ska inkluderas

source: formatter_class_ - A class for customizing the help output
sv: formatter_class_ - En klass för att anpassa hjälputmatningen

source: prefix_chars_ - The set of characters that prefix optional arguments (default: '-')
sv: prefix_chars_ - Uppsättningen av tecken som prefixar valfria argument (standard: '-')

source: fromfile_prefix_chars_ - The set of characters that prefix files from which additional arguments should be read (default: ``None``)
sv: fromfile_prefix_chars_ - Uppsättningen tecken som prefixar filer från vilka ytterligare argument ska läsas (standard: ``None``)

source: argument_default_ - The global default value for arguments (default: ``None``)
sv: argument_default_ - Det globala standardvärdet för argument (standard: ``None``)

source: conflict_handler_ - The strategy for resolving conflicting optionals (usually unnecessary)
sv: conflict_handler_ - Strategi för att lösa motstridiga tillval (vanligtvis onödig)

source: add_help_ - Add a ``-h/--help`` option to the parser (default: ``True``)
sv: add_help_ - Lägg till ett ``-h/--help``-alternativ till parsern (standard: ``True``)

source: allow_abbrev_ - Allows long options to be abbreviated if the abbreviation is unambiguous (default: ``True``)
sv: allow_abbrev_ - Tillåter att långa alternativ förkortas om förkortningen är entydig (standard: ``True``)

source: exit_on_error_ - Determines whether or not :class:`!ArgumentParser` exits with error info when an error occurs. (default: ``True``)
sv: exit_on_error_ - Bestämmer om :class:`!ArgumentParser` avslutas med felinformation när ett fel inträffar eller inte. (standard: ``True``)

source: suggest_on_error_ - Enables suggestions for mistyped argument choices and subparser names (default: ``False``)
sv: suggest_on_error_ - Aktiverar förslag för felskrivna argumentval och namn på subparser (standard: ``False``)

source: color_ - Allow color output (default: ``True``)
sv: color_ - Tillåt färgutmatning (standard: ``True``)

source: *allow_abbrev* parameter was added.
sv: *parametern allow_abbrev* har lagts till.

source: In previous versions, *allow_abbrev* also disabled grouping of short flags such as ``-vv`` to mean ``-v -v``.
sv: I tidigare versioner avaktiverade *allow_abbrev* också gruppering av korta flaggor som ``-vv`` för att betyda ``-v -v``.

source: *exit_on_error* parameter was added.
sv: *parametern exit_on_error* har lagts till.

source: *suggest_on_error* and *color* parameters were added.
sv: *parametrarna suggest_on_error* och *color* har lagts till.

source: The following sections describe how each of these are used.
sv: I följande avsnitt beskrivs hur de olika funktionerna används.

source: By default, :class:`ArgumentParser` calculates the name of the program to display in help messages depending on the way the Python interpreter was run:
sv: Som standard beräknar :class:`ArgumentParser` namnet på det program som ska visas i hjälpmeddelanden beroende på hur Python-tolken kördes:

source: The :func:`base name <os.path.basename>` of ``sys.argv[0]`` if a file was passed as argument.
sv: :func:`basnamn <os.path.basename>` av ``sys.argv[0]`` om en fil skickades som argument.

source: The Python interpreter name followed by ``sys.argv[0]`` if a directory or a zipfile was passed as argument.
sv: Namnet på Python-tolken följt av ``sys.argv[0]`` om en katalog eller en zip-fil skickades som argument.

source: The Python interpreter name followed by ``-m`` followed by the module or package name if the :option:`-m` option was used.
sv: Python-tolkens namn följt av ``-m`` följt av modul- eller paketnamnet om alternativet :option:`-m` användes.

source: This default is almost always desirable because it will make the help messages match the string that was used to invoke the program on the command line. However, to change this default behavior, another value can be supplied using the ``prog=`` argument to :class:`ArgumentParser`::
sv: Denna standard är nästan alltid önskvärd eftersom det gör att hjälpmeddelandena matchar den sträng som användes för att anropa programmet på kommandoraden. För att ändra detta standardbeteende kan dock ett annat värde anges med argumentet ``prog=`` till :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.print_help() usage: myprogram [-h] options: -h, --help show this help message and exit
sv: >>> parser = argparse.ArgumentParser(prog='mittprogram') >>> parser.print_help() användning: myprogram [-h] alternativ: -h, --help visa detta hjälpmeddelande och avsluta

source: Note that the program name, whether determined from ``sys.argv[0]``, from the ``__main__`` module attributes or from the ``prog=`` argument, is available to help messages using the ``%(prog)s`` format specifier.
sv: Observera att programnamnet, oavsett om det hämtas från ```sys.argv[0]``, från modulattributen ``__main__`` eller från argumentet ``prog=``, är tillgängligt för hjälpmeddelanden som använder formatspecificeraren ``%(prog)s``.

source: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.add_argument('--foo', help='foo of the %(prog)s program') >>> parser.print_help() usage: myprogram [-h] [--foo FOO] options: -h, --help show this help message and exit --foo FOO foo of the myprogram program
sv: >>> parser = argparse.ArgumentParser(prog='mittprogram') >>> parser.add_argument('--foo', help='foo i %(prog)s-programmet') >>> parser.print_help() användning: myprogram [-h] [--foo FOO] alternativ: -h, --help visa detta hjälpmeddelande och avsluta --foo FOO foo i programmet myprogram

source: The default ``prog`` value now reflects how ``__main__`` was actually executed, rather than always being ``os.path.basename(sys.argv[0])``.
sv: Standardvärdet för ``prog`` återspeglar nu hur ``__main__`` faktiskt exekverades, i stället för att alltid vara ``os.path.basename(sys.argv[0])``.

source: usage
sv: användning

source: By default, :class:`ArgumentParser` calculates the usage message from the arguments it contains. The default message can be overridden with the ``usage=`` keyword argument::
sv: Som standard beräknar :class:`ArgumentParser` användningsmeddelandet från de argument som den innehåller. Standardmeddelandet kan åsidosättas med nyckelordet ``usage=`` argument::

source: >>> parser = argparse.ArgumentParser(prog='PROG', usage='%(prog)s [options]') >>> parser.add_argument('--foo', nargs='?', help='foo help') >>> parser.add_argument('bar', nargs='+', help='bar help') >>> parser.print_help() usage: PROG [options] positional arguments: bar bar help options: -h, --help show this help message and exit --foo [FOO] foo help
sv: >>> parser = argparse.ArgumentParser(prog='PROG', usage='%(prog)s [options]') >>> parser.add_argument('--foo', nargs='?', help='foo help') >>> parser.add_argument('bar', nargs='+', help='bar hjälp') >>> parser.print_help() användning: PROG [alternativ] positionella argument: bar bar hjälp alternativ: -h, --help visa detta hjälpmeddelande och avsluta --foo [FOO] foo hjälp

source: The ``%(prog)s`` format specifier is available to fill in the program name in your usage messages.
sv: Formatangivelsen ``%(prog)s`` är tillgänglig för att fylla i programnamnet i dina användningsmeddelanden.

source: When a custom usage message is specified for the main parser, you may also want to consider passing the ``prog`` argument to :meth:`~ArgumentParser.add_subparsers` or the ``prog`` and the ``usage`` arguments to :meth:`~_SubParsersAction.add_parser`, to ensure consistent command prefixes and usage information across subparsers.
sv: När ett anpassat användningsmeddelande anges för huvudparsern kanske du också vill överväga att skicka argumentet ``prog`` till :meth:`~ArgumentParser.add_subparsers` eller argumenten ``prog`` och ``usage`` till :meth:`~_SubParsersAction.add_parser`, för att säkerställa konsekventa kommandoprefix och användningsinformation mellan underparsers.

source: description
sv: beskrivning

source: Most calls to the :class:`ArgumentParser` constructor will use the ``description=`` keyword argument. This argument gives a brief description of what the program does and how it works. In help messages, the description is displayed between the command-line usage string and the help messages for the various arguments.
sv: De flesta anrop till konstruktören :class:`ArgumentParser` kommer att använda nyckelordsargumentet ``description=``. Detta argument ger en kort beskrivning av vad programmet gör och hur det fungerar. I hjälpmeddelanden visas beskrivningen mellan kommandoradsanvändningssträngen och hjälpmeddelandena för de olika argumenten.

source: By default, the description will be line-wrapped so that it fits within the given space. To change this behavior, see the formatter_class_ argument.
sv: Som standard kommer beskrivningen att radbrytas så att den ryms inom det angivna utrymmet. För att ändra detta beteende, se argumentet formatter_class_.

source: Some programs like to display additional description of the program after the description of the arguments. Such text can be specified using the ``epilog=`` argument to :class:`ArgumentParser`::
sv: Vissa program vill visa ytterligare en beskrivning av programmet efter beskrivningen av argumenten. Sådan text kan anges med hjälp av argumentet ``epilog=`` till :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser( ... description='A foo that bars', ... epilog="And that's how you'd foo a bar") >>> parser.print_help() usage: argparse.py [-h] A foo that bars options: -h, --help show this help message and exit And that's how you'd foo a bar
sv: >>> parser = argparse.ArgumentParser( ... beskrivning="En foo som barrar", ... epilog="Och det är så du skulle foo en bar") >>> parser.print_help() användning: argparse.py [-h] En foo som barrar alternativ: -h, --help visa detta hjälpmeddelande och avsluta Och det är så du gör foo en bar

source: As with the description_ argument, the ``epilog=`` text is by default line-wrapped, but this behavior can be adjusted with the formatter_class_ argument to :class:`ArgumentParser`.
sv: Precis som med argumentet description_ är texten ``epilog=`` som standard radbrytande, men detta beteende kan justeras med argumentet formatter_class_ till :class:`ArgumentParser`.

source: parents
sv: föräldrar

source: Sometimes, several parsers share a common set of arguments. Rather than repeating the definitions of these arguments, a single parser with all the shared arguments and passed to ``parents=`` argument to :class:`ArgumentParser` can be used. The ``parents=`` argument takes a list of :class:`ArgumentParser` objects, collects all the positional and optional actions from them, and adds these actions to the :class:`ArgumentParser` object being constructed::
sv: Ibland delar flera parsers en gemensam uppsättning argument. Istället för att upprepa definitionerna av dessa argument, kan en enda parser med alla de delade argumenten och som skickas till ``parents=`` argumentet till :class:`ArgumentParser` användas. Argumentet ``parents=`` tar en lista med :class:`ArgumentParser`-objekt, samlar in alla positionella och valfria åtgärder från dem och lägger till dessa åtgärder till :class:`ArgumentParser`-objektet som konstrueras::

source: >>> parent_parser = argparse.ArgumentParser(add_help=False) >>> parent_parser.add_argument('--parent', type=int) >>> foo_parser = argparse.ArgumentParser(parents=[parent_parser]) >>> foo_parser.add_argument('foo') >>> foo_parser.parse_args(['--parent', '2', 'XXX']) Namespace(foo='XXX', parent=2) >>> bar_parser = argparse.ArgumentParser(parents=[parent_parser]) >>> bar_parser.add_argument('--bar') >>> bar_parser.parse_args(['--bar', 'YYY']) Namespace(bar='YYY', parent=None)
sv: >>> parent_parser = argparse.ArgumentParser(add_help=False) >>> parent_parser.add_argument('--parent', type=int) >>> foo_parser = argparse.ArgumentParser(parents=[parent_parser]) >>> foo_parser.add_argument('foo') >>> foo_parser.parse_args(['--parent', '2', 'XXX']) Namnrymd(foo='XXX', förälder=2) >>> bar_parser = argparse.ArgumentParser(parents=[parent_parser]) >>> bar_parser.add_argument('--bar') >>> bar_parser.parse_args(['--bar', 'YYY']) Namnrymd(bar='YYY', förälder=None)

source: Note that most parent parsers will specify ``add_help=False``. Otherwise, the :class:`ArgumentParser` will see two ``-h/--help`` options (one in the parent and one in the child) and raise an error.
sv: Observera att de flesta överordnade parsers kommer att ange ``add_help=False``. Annars kommer :class:`ArgumentParser` att se två ``-h/--help``-alternativ (ett i den överordnade och ett i den underordnade) och ge upphov till ett fel.

source: You must fully initialize the parsers before passing them via ``parents=``. If you change the parent parsers after the child parser, those changes will not be reflected in the child.
sv: Du måste initialisera parsarna fullständigt innan du skickar dem via ``parents=``. Om du ändrar de överordnade parsarna efter den underordnade parsern kommer dessa ändringar inte att återspeglas i den underordnade parsern.

source: formatter_class
sv: formatter_klass

source: :class:`ArgumentParser` objects allow the help formatting to be customized by specifying an alternate formatting class. Currently, there are four such classes:
sv: :class:`ArgumentParser`-objekt gör det möjligt att anpassa hjälpformateringen genom att ange en alternativ formateringsklass. För närvarande finns det fyra sådana klasser:

source: :class:`RawDescriptionHelpFormatter` and :class:`RawTextHelpFormatter` give more control over how textual descriptions are displayed. By default, :class:`ArgumentParser` objects line-wrap the description_ and epilog_ texts in command-line help messages::
sv: :class:`RawDescriptionHelpFormatter` och :class:`RawTextHelpFormatter` ger mer kontroll över hur textbeskrivningar visas. Som standard radbryter :class:`ArgumentParser`-objekten texten description_ och epilog_ i kommandoradshjälpmeddelanden::

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... description='''this description ... was indented weird ... but that is okay''', ... epilog=''' ... likewise for this epilog whose whitespace will ... be cleaned up and whose words will be wrapped ... across a couple lines''') >>> parser.print_help() usage: PROG [-h] this description was indented weird but that is okay options: -h, --help show this help message and exit likewise for this epilog whose whitespace will be cleaned up and whose words will be wrapped across a couple lines
sv: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... description='''den här beskrivningen ... var indragen konstigt ... men det är okej''', ... epilog=''' ... likaså för denna epilog vars blanksteg kommer att ... städas upp och vars ord kommer att lindas in ... över ett par rader''') >>> parser.print_help() användning: PROG [-h] den här beskrivningen var indragen konstigt men det är okej alternativ: -h, --help visa detta hjälpmeddelande och avsluta likadant för denna epilog vars blanksteg kommer att rensas upp och vars ord kommer att lindas in över ett par rader

source: Passing :class:`RawDescriptionHelpFormatter` as ``formatter_class=`` indicates that description_ and epilog_ are already correctly formatted and should not be line-wrapped::
sv: Om du anger :class:`RawDescriptionHelpFormatter` som ``formatter_class=`` indikerar det att description_ och epilog_ redan är korrekt formaterade och inte ska radbrytas:

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.RawDescriptionHelpFormatter, ... description=textwrap.dedent('''\ ... Please do not mess up this text! ... -------------------------------- ... I have indented it ... exactly the way ... I want it ... ''')) >>> parser.print_help() usage: PROG [-h] Please do not mess up this text! -------------------------------- I have indented it exactly the way I want it options: -h, --help show this help message and exit
sv: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.RawDescriptionHelpFormatter, ... description=textwrap.dedent('''\ ... Snälla, förstör inte den här texten! ... -------------------------------- ... Jag har indragit den ... exakt på samma sätt ... Jag vill ha det ... ''')) >>> parser.print_help() användning: PROG [-h] Snälla, förstör inte den här texten! -------------------------------- Jag har indragit den exakt på det sätt Jag vill ha det alternativ: -h, --help visa detta hjälpmeddelande och avsluta

source: :class:`RawTextHelpFormatter` maintains whitespace for all sorts of help text, including argument descriptions. However, multiple newlines are replaced with one. If you wish to preserve multiple blank lines, add spaces between the newlines.
sv: :class:`RawTextHelpFormatter` bibehåller blanksteg för alla typer av hjälptexter, inklusive argumentbeskrivningar. Flera nya linjer ersätts dock med en. Om du vill bevara flera tomma rader lägger du till mellanslag mellan nylinjerna.

source: :class:`ArgumentDefaultsHelpFormatter` automatically adds information about default values to each of the argument help messages::
sv: :class:`ArgumentDefaultsHelpFormatter` lägger automatiskt till information om standardvärden till varje argumenthjälpmeddelande::
