Repository: yeager/python-docs-sv
Catalog: library/argparse.po
Languages: sv

source: If the target namespace already has an attribute set, the action *default* will not overwrite it::
sv: Om målnamnrymden redan har en attributuppsättning kommer åtgärden *default* inte att skriva över den::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default=42) >>> parser.parse_args([], namespace=argparse.Namespace(foo=101)) Namespace(foo=101)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default=42) >>> parser.parse_args([], namespace=argparse.Namespace(foo=101)) Namnområde(foo=101)

source: If the ``default`` value is a string, the parser parses the value as if it were a command-line argument. In particular, the parser applies any type_ conversion argument, if provided, before setting the attribute on the :class:`Namespace` return value. Otherwise, the parser uses the value as is::
sv: Om ``default``-värdet är en sträng, analyserar parsern värdet som om det vore ett kommandoradsargument. I synnerhet tillämpar parsern ett typ_-konverteringsargument, om det tillhandahålls, innan attributet ställs in på returvärdet för :class:`Namespace`. Annars använder parsern värdet som det är::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--length', default='10', type=int) >>> parser.add_argument('--width', default=10.5, type=int) >>> parser.parse_args() Namespace(length=10, width=10.5)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--length', default='10', type=int) >>> parser.add_argument('--width', default=10.5, type=int) >>> parser.parse_args() Namnrymd(längd=10, bredd=10,5)

source: For positional arguments with nargs_ equal to ``?`` or ``*``, the ``default`` value is used when no command-line argument was present::
sv: För positionella argument med nargs_ lika med ``?`` eller ``*`` används ``default``-värdet om inget kommandoradsargument fanns::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('foo', nargs='?', default=42) >>> parser.parse_args(['a']) Namespace(foo='a') >>> parser.parse_args([]) Namespace(foo=42)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('foo', nargs='?', default=42) >>> parser.parse_args(['a']) Namnrymd(foo='a') >>> parser.parse_args([]) Namnrymd(foo=42)

source: For required_ arguments, the ``default`` value is ignored. For example, this applies to positional arguments with nargs_ values other than ``?`` or ``*``, or optional arguments marked as ``required=True``.
sv: För obligatoriska_ argument ignoreras ``default``-värdet. Detta gäller t.ex. positionella argument med nargs_-värden andra än ``?`` eller ``*``, eller valfria argument markerade som ``required=True``.

source: Providing ``default=argparse.SUPPRESS`` causes no attribute to be added if the command-line argument was not present::
sv: Om du anger ``default=argparse.SUPPRESS`` läggs inget attribut till om kommandoradsargumentet inte fanns::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default=argparse.SUPPRESS) >>> parser.parse_args([]) Namespace() >>> parser.parse_args(['--foo', '1']) Namespace(foo='1')
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default=argparse.SUPPRESS) >>> parser.parse_args([]) Namnrymd() >>> parser.parse_args(['--foo', '1']) Namnrymd(foo='1')

source: type
sv: typ

source: By default, the parser reads command-line arguments in as simple strings. However, quite often the command-line string should instead be interpreted as another type, such as a :class:`float` or :class:`int`. The ``type`` keyword for :meth:`~ArgumentParser.add_argument` allows any necessary type-checking and type conversions to be performed.
sv: Som standard läser parsern in kommandoradsargument som enkla strängar. Men ofta bör kommandoradssträngen istället tolkas som en annan typ, t.ex. en :class:`float` eller :class:`int`. Nyckelordet ``type`` för :meth:`~ArgumentParser.add_argument` gör att alla nödvändiga typkontroller och typkonverteringar kan utföras.

source: If the type_ keyword is used with the default_ keyword, the type converter is only applied if the default is a string.
sv: Om nyckelordet type_ används tillsammans med nyckelordet default_ tillämpas typomvandlaren endast om default är en sträng.

source: The argument to ``type`` can be a callable that accepts a single string or the name of a registered type (see :meth:`~ArgumentParser.register`) If the function raises :exc:`ArgumentTypeError`, :exc:`TypeError`, or :exc:`ValueError`, the exception is caught and a nicely formatted error message is displayed. Other exception types are not handled.
sv: Argumentet till ``type`` kan vara en callable som accepterar en enda sträng eller namnet på en registrerad typ (se :meth:`~ArgumentParser.register`) Om funktionen ger upphov till :exc:`ArgumentTypeError`, :exc:`TypeError` eller :exc:`ValueError` fångas undantaget upp och ett snyggt formaterat felmeddelande visas. Andra undantagstyper hanteras inte.

source: Common built-in types and functions can be used as type converters:
sv: Vanliga inbyggda typer och funktioner kan användas som typomvandlare:

source: User defined functions can be used as well:
sv: Användardefinierade funktioner kan också användas:

source: >>> def hyphenated(string): ... return '-'.join([word[:4] for word in string.casefold().split()]) ... >>> parser = argparse.ArgumentParser() >>> _ = parser.add_argument('short_title', type=hyphenated) >>> parser.parse_args(['"The Tale of Two Cities"']) Namespace(short_title='"the-tale-of-two-citi')
sv: >>> def bindestreck(sträng): ... return '-'.join([ord[:4] för ord i string.casefold().split()]) ... >>> parser = argparse.ArgumentParser() >>> _ = parser.add_argument('short_title', type=hyphenated) >>> parser.parse_args([''Berättelsen om två städer'']) Namespace(kort_titel='"berättelsen-om-två-städer"')

source: The :func:`bool` function is not recommended as a type converter. All it does is convert empty strings to ``False`` and non-empty strings to ``True``. This is usually not what is desired.
sv: Funktionen :func:`bool` rekommenderas inte som typomvandlare. Allt den gör är att konvertera tomma strängar till ``False`` och icke-tomma strängar till ``True``. Detta är vanligtvis inte vad som önskas.

source: In general, the ``type`` keyword is a convenience that should only be used for simple conversions that can only raise one of the three supported exceptions. Anything with more interesting error-handling or resource management should be done downstream after the arguments are parsed.
sv: I allmänhet är nyckelordet ``type`` en bekvämlighet som bara bör användas för enkla konverteringar som bara kan ge upphov till ett av de tre undantag som stöds. Allt med mer intressant felhantering eller resurshantering bör göras nedströms efter att argumenten har analyserats.

source: For example, JSON or YAML conversions have complex error cases that require better reporting than can be given by the ``type`` keyword. A :exc:`~json.JSONDecodeError` would not be well formatted and a :exc:`FileNotFoundError` exception would not be handled at all.
sv: Till exempel har JSON- eller YAML-konverteringar komplexa fel som kräver bättre rapportering än vad som kan ges av nyckelordet ``type``. Ett :exc:`~json.JSONDecodeError` skulle inte vara välformaterat och ett :exc:`FileNotFoundError` undantag skulle inte hanteras alls.

source: Even :class:`~argparse.FileType` has its limitations for use with the ``type`` keyword. If one argument uses :class:`~argparse.FileType` and then a subsequent argument fails, an error is reported but the file is not automatically closed. In this case, it would be better to wait until after the parser has run and then use the :keyword:`with`-statement to manage the files.
sv: Även :class:`~argparse.FileType` har sina begränsningar för användning med nyckelordet ``type``. Om ett argument använder :class:`~argparse.FileType` och sedan ett efterföljande argument misslyckas, rapporteras ett fel men filen stängs inte automatiskt. I det här fallet är det bättre att vänta tills efter att parsern har körts och sedan använda :keyword:`with`-statement för att hantera filerna.

source: For type checkers that simply check against a fixed set of values, consider using the choices_ keyword instead.
sv: För typkontrollprogram som bara kontrollerar mot en fast uppsättning värden kan du överväga att använda nyckelordet choices_ i stället.

source: choices
sv: val

source: Some command-line arguments should be selected from a restricted set of values. These can be handled by passing a sequence object as the *choices* keyword argument to :meth:`~ArgumentParser.add_argument`. When the command line is parsed, argument values will be checked, and an error message will be displayed if the argument was not one of the acceptable values::
sv: Vissa kommandoradsargument bör väljas från en begränsad uppsättning värden. Dessa kan hanteras genom att skicka ett sequence-objekt som argument för nyckelordet *choices* till :meth:`~ArgumentParser.add_argument`. När kommandoraden analyseras kontrolleras argumentvärdena och ett felmeddelande visas om argumentet inte var ett av de godtagbara värdena::

source: >>> parser = argparse.ArgumentParser(prog='game.py') >>> parser.add_argument('move', choices=['rock', 'paper', 'scissors']) >>> parser.parse_args(['rock']) Namespace(move='rock') >>> parser.parse_args(['fire']) usage: game.py [-h] {rock,paper,scissors} game.py: error: argument move: invalid choice: 'fire' (choose from 'rock', 'paper', 'scissors')
sv: >>> parser = argparse.ArgumentParser(prog='game.py') >>> parser.add_argument('move', val=['sten', 'papper', 'sax']) >>> parser.parse_args(['rock']) Namnrymd(move='rock') >>> parser.parse_args(['fire']) användning: game.py [-h] {rock,paper,scissors} game.py: error: argument move: ogiltigt val: 'fire' (välj från 'rock', 'papper', 'sax')

source: Note that inclusion in the *choices* sequence is checked after any type_ conversions have been performed, so the type of the objects in the *choices* sequence should match the type_ specified.
sv: Observera att inkludering i *choices*-sekvensen kontrolleras efter att eventuella typ_-konverteringar har utförts, så typen av objekten i *choices*-sekvensen bör överensstämma med den typ_ som anges.

source: Any sequence can be passed as the *choices* value, so :class:`list` objects, :class:`tuple` objects, and custom sequences are all supported.
sv: Vilken sekvens som helst kan skickas som *choices*-värde, så :class:`list`-objekt, :class:`tuple`-objekt och anpassade sekvenser stöds alla.

source: Use of :class:`enum.Enum` is not recommended because it is difficult to control its appearance in usage, help, and error messages.
sv: Användning av :class:`enum.Enum` rekommenderas inte eftersom det är svårt att kontrollera dess utseende i användnings-, hjälp- och felmeddelanden.

source: Formatted choices override the default *metavar* which is normally derived from *dest*. This is usually what you want because the user never sees the *dest* parameter. If this display isn't desirable (perhaps because there are many choices), just specify an explicit metavar_.
sv: Formaterade val åsidosätter standardvärdet *metavar* som normalt härleds från *dest*. Detta är vanligtvis vad du vill ha eftersom användaren aldrig ser parametern *dest*. Om den här visningen inte är önskvärd (kanske för att det finns många valmöjligheter), ange bara en explicit metavar_.

source: required
sv: obligatoriskt

source: In general, the :mod:`!argparse` module assumes that flags like ``-f`` and ``--bar`` indicate *optional* arguments, which can always be omitted at the command line. To make an option *required*, ``True`` can be specified for the ``required=`` keyword argument to :meth:`~ArgumentParser.add_argument`::
sv: I allmänhet antar modulen :mod:`!argparse` att flaggor som ``-f`` och ``--bar`` anger *valfria* argument, som alltid kan utelämnas på kommandoraden. För att göra ett alternativ *krävt* kan ``True`` anges för nyckelordsargumentet ``required=`` till :meth:`~ArgumentParser.add_argument`::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', required=True) >>> parser.parse_args(['--foo', 'BAR']) Namespace(foo='BAR') >>> parser.parse_args([]) usage: [-h] --foo FOO : error: the following arguments are required: --foo
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', required=True) >>> parser.parse_args(['--foo', 'BAR']) Namespace(foo='BAR') >>> parser.parse_args([]) användning: [-h] --foo FOO : fel: följande argument krävs: --foo

source: As the example shows, if an option is marked as ``required``, :meth:`~ArgumentParser.parse_args` will report an error if that option is not present at the command line.
sv: Som exemplet visar, om ett alternativ är markerat som ``required``, kommer :meth:`~ArgumentParser.parse_args` att rapportera ett fel om det alternativet inte finns på kommandoraden.

source: Required options are generally considered bad form because users expect *options* to be *optional*, and thus they should be avoided when possible.
sv: Obligatoriska alternativ anses i allmänhet vara dålig form eftersom användare förväntar sig att *alternativ* ska vara *valbara*, och därför bör de undvikas när det är möjligt.

source: help
sv: hjälp

source: The ``help`` value is a string containing a brief description of the argument. When a user requests help (usually by using ``-h`` or ``--help`` at the command line), these ``help`` descriptions will be displayed with each argument.
sv: Värdet ``help`` är en sträng som innehåller en kort beskrivning av argumentet. När en användare begär hjälp (vanligtvis genom att använda ``-h`` eller ``--help`` på kommandoraden) visas dessa ``help``-beskrivningar för varje argument.

source: The ``help`` strings can include various format specifiers to avoid repetition of things like the program name or the argument default_. The available specifiers include the program name, ``%(prog)s`` and most keyword arguments to :meth:`~ArgumentParser.add_argument`, e.g. ``%(default)s``, ``%(type)s``, etc.::
sv: Strängarna ``help`` kan innehålla olika formatspecifikatorer för att undvika upprepning av t.ex. programnamnet eller argumentet default_. De tillgängliga specifikatorerna inkluderar programnamnet, ``%(prog)s`` och de flesta nyckelordsargument till :meth:`~ArgumentParser.add_argument`, t.ex. ``%(default)s``, ``%(type)s``, etc:

source: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('bar', nargs='?', type=int, default=42, ... help='the bar to %(prog)s (default: %(default)s)') >>> parser.print_help() usage: frobble [-h] [bar] positional arguments: bar the bar to frobble (default: 42) options: -h, --help show this help message and exit
sv: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('bar', nargs='?', type=int, default=42, ... help='stapeln till %(prog)s (standard: %(default)s)') >>> parser.print_help() användning: frobble [-h] [bar] positionella argument: bar baren till frobble (standard: 42) alternativ: -h, --help visa detta hjälpmeddelande och avsluta

source: As the help string supports %-formatting, if you want a literal ``%`` to appear in the help string, you must escape it as ``%%``.
sv: Eftersom hjälpsträngen stöder %-f-matrisering måste du, om du vill att en bokstavlig ``%`` ska visas i hjälpsträngen, escapen den som ``%%``.

source: :mod:`!argparse` supports silencing the help entry for certain options, by setting the ``help`` value to ``argparse.SUPPRESS``::
sv: :mod:`!argparse` stöder att tysta ner hjälptexten för vissa alternativ genom att ställa in värdet ``help`` till ``argparse.SUPPRESS``::

source: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('--foo', help=argparse.SUPPRESS) >>> parser.print_help() usage: frobble [-h] options: -h, --help show this help message and exit
sv: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('--foo', help=argparse.SUPPRESS) >>> parser.print_help() användning: frobble [-h] alternativ: -h, --help visa detta hjälpmeddelande och avsluta

source: When :class:`ArgumentParser` generates help messages, it needs some way to refer to each expected argument. By default, :class:`!ArgumentParser` objects use the dest_ value as the "name" of each object. By default, for positional argument actions, the dest_ value is used directly, and for optional argument actions, the dest_ value is uppercased. So, a single positional argument with ``dest='bar'`` will be referred to as ``bar``. A single optional argument ``--foo`` that should be followed by a single command-line argument will be referred to as ``FOO``. An example::
sv: När :class:`ArgumentParser` genererar hjälpmeddelanden behöver den något sätt att hänvisa till varje förväntat argument. Som standard använder :class:`!ArgumentParser`-objekt dest_-värdet som "namn" för varje objekt. Som standard används dest_-värdet direkt för åtgärder med positionella argument, och för åtgärder med valfria argument används dest_-värdet med versaler. Ett enskilt positionellt argument med ``dest='bar'`` kommer alltså att kallas ``bar``. Ett enda valfritt argument ``--foo`` som ska följas av ett enda kommandoradsargument kommer att refereras till som ``FOO``. Ett exempel::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo') >>> parser.add_argument('bar') >>> parser.parse_args('X --foo Y'.split()) Namespace(bar='X', foo='Y') >>> parser.print_help() usage: [-h] [--foo FOO] bar positional arguments: bar options: -h, --help show this help message and exit --foo FOO
sv: >>> parser = argparse.ArgumentParser() >>> parser.lägg_till_argument('--foo') >>> parser.lägg_till_argument('bar') >>> parser.parse_args('X --foo Y'.split()) Namnrymd(bar='X', foo='Y') >>> parser.print_help() användning: [-h] [--foo FOO] bar positionella argument: bar alternativ: -h, --help visa detta hjälpmeddelande och avsluta --foo FOO

source: An alternative name can be specified with ``metavar``::
sv: Ett alternativt namn kan anges med ``metavar``::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', metavar='YYY') >>> parser.add_argument('bar', metavar='XXX') >>> parser.parse_args('X --foo Y'.split()) Namespace(bar='X', foo='Y') >>> parser.print_help() usage: [-h] [--foo YYY] XXX positional arguments: XXX options: -h, --help show this help message and exit --foo YYY
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', metavar='YYY') >>> parser.add_argument('bar', metavar='XXX') >>> parser.parse_args('X --foo Y'.split()) Namnrymd(bar='X', foo='Y') >>> parser.print_help() användning: [-h] [--foo YYYY] XXX positionella argument: XXX alternativ: -h, --help visa detta hjälpmeddelande och avsluta --foo YYY

source: Note that ``metavar`` only changes the *displayed* name - the name of the attribute on the :meth:`~ArgumentParser.parse_args` object is still determined by the dest_ value.
sv: Observera att ``metavar`` endast ändrar det *visade* namnet - attributets namn på :meth:`~ArgumentParser.parse_args`-objektet bestäms fortfarande av dest_-värdet.

source: Different values of ``nargs`` may cause the metavar to be used multiple times. Providing a tuple to ``metavar`` specifies a different display for each of the arguments::
sv: Olika värden på ``nargs`` kan göra att metavar används flera gånger. Om man ger en tupel till ``metavar`` anges en annan visning för vart och ett av argumenten::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x', nargs=2) >>> parser.add_argument('--foo', nargs=2, metavar=('bar', 'baz')) >>> parser.print_help() usage: PROG [-h] [-x X X] [--foo bar baz] options: -h, --help show this help message and exit -x X X --foo bar baz
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x', nargs=2) >>> parser.add_argument('--foo', nargs=2, metavar=('bar', 'baz')) >>> parser.print_help() användning: PROG [-h] [-x X X] [--foo bar baz] alternativ: -h, --help visa detta hjälpmeddelande och avsluta -x X X --foo bar baz

source: Most :class:`ArgumentParser` actions add some value as an attribute of the object returned by :meth:`~ArgumentParser.parse_args`. The name of this attribute is determined by the ``dest`` keyword argument of :meth:`~ArgumentParser.add_argument`. For positional argument actions, ``dest`` is normally supplied as the first argument to :meth:`~ArgumentParser.add_argument`::
sv: De flesta :class:`ArgumentParser`-åtgärder lägger till ett värde som ett attribut för det objekt som returneras av :meth:`~ArgumentParser.parse_args`. Namnet på detta attribut bestäms av nyckelordsargumentet ``dest`` i :meth:`~ArgumentParser.add_argument`. För åtgärder med positionella argument anges ``dest`` normalt som det första argumentet till :meth:`~ArgumentParser.add_argument`::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('bar') >>> parser.parse_args(['XXX']) Namespace(bar='XXX')
sv: >>> parser = argparse.ArgumentParser() >>> parser.lägg_till_argument('bar') >>> parser.parse_args(['XXX']) Namnrymd(bar='XXX')

source: For optional argument actions, the value of ``dest`` is normally inferred from the option strings. :class:`ArgumentParser` generates the value of ``dest`` by taking the first long option string and stripping away the initial ``--`` string. If no long option strings were supplied, ``dest`` will be derived from the first short option string by stripping the initial ``-`` character. Any internal ``-`` characters will be converted to ``_`` characters to make sure the string is a valid attribute name. The examples below illustrate this behavior::
sv: För valfria argumentåtgärder härleds värdet av ``dest`` normalt från alternativsträngarna. :class:`ArgumentParser` genererar värdet av ``dest`` genom att ta den första långa alternativsträngen och ta bort den inledande ``--``-strängen. Om inga långa alternativsträngar har angetts, kommer ``dest`` att härledas från den första korta alternativsträngen genom att ta bort det inledande tecknet ``-``. Alla interna ``-``-tecken konverteras till ``_``-tecken för att säkerställa att strängen är ett giltigt attributnamn. Exemplen nedan illustrerar detta beteende::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('-f', '--foo-bar', '--foo') >>> parser.add_argument('-x', '-y') >>> parser.parse_args('-f 1 -x 2'.split()) Namespace(foo_bar='1', x='2') >>> parser.parse_args('--foo 1 -y 2'.split()) Namespace(foo_bar='1', x='2')
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('-f', '--foo-bar', '--foo') >>> parser.lägg_till_argument('-x', '-y') >>> parser.parse_args('-f 1 -x 2'.split()) Namnrymd(foo_bar='1', x='2') >>> parser.parse_args('--foo 1 -y 2'.split()) Namnområde(foo_bar='1', x='2')

source: ``dest`` allows a custom attribute name to be provided::
sv: ``dest`` tillåter att ett anpassat attributnamn anges::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', dest='bar') >>> parser.parse_args('--foo XXX'.split()) Namespace(bar='XXX')
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', dest='bar') >>> parser.parse_args('--foo XXX'.split()) Namnrymd(bar='XXX')

source: deprecated
sv: utfasad
