Repository: yeager/python-docs-sv
Catalog: library/argparse.po
Languages: sv

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_argument_group('Group title', 'Group description') >>> exclusive_group = group.add_mutually_exclusive_group(required=True) >>> exclusive_group.add_argument('--foo', help='foo help') >>> exclusive_group.add_argument('--bar', help='bar help') >>> parser.print_help() usage: PROG [-h] (--foo FOO | --bar BAR) options: -h, --help show this help message and exit Group title: Group description --foo FOO foo help --bar BAR bar help
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_argument_group('Grupptitel', 'Gruppbeskrivning') >>> exclusive_group = group.add_mutually_exclusive_group(required=True) >>> exclusive_group.add_argument('--foo', help='foo hjälp') >>> exclusive_group.add_argument('--bar', help='bar hjälp') >>> parser.print_help() användning: PROG [-h] (--foo FOO | --bar BAR) alternativ: -h, --help visa detta hjälpmeddelande och avsluta Gruppens titel: Gruppens beskrivning --foo FOO foo hjälp --bar BAR bar bar hjälp

source: Calling :meth:`add_argument_group` or :meth:`add_mutually_exclusive_group` on a mutually exclusive group now raises an exception. This nesting was never supported, often failed to work correctly, and was unintentionally exposed through inheritance.
sv: Anrop av :meth:`add_argument_group` eller :meth:`add_mutually_exclusive_group` på en ömsesidigt exklusiv grupp ger nu upphov till ett undantag. Denna nestning stöddes aldrig, fungerade ofta inte korrekt och exponerades oavsiktligt genom arv.

source: Parser defaults
sv: Standardvärden för parser

source: Most of the time, the attributes of the object returned by :meth:`parse_args` will be fully determined by inspecting the command-line arguments and the argument actions. :meth:`set_defaults` allows some additional attributes that are determined without any inspection of the command line to be added::
sv: För det mesta kommer attributen för det objekt som returneras av :meth:`parse_args` att vara helt bestämda genom att inspektera kommandoradsargumenten och argumentåtgärderna. :meth:`set_defaults` gör att några ytterligare attribut som bestäms utan någon inspektion av kommandoraden kan läggas till::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('foo', type=int) >>> parser.set_defaults(bar=42, baz='badger') >>> parser.parse_args(['736']) Namespace(bar=42, baz='badger', foo=736)
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('foo', type=int) >>> parser.set_defaults(bar=42, baz='badger') >>> parser.parse_args(['736']) Namnrymd(bar=42, baz='badger', foo=736)

source: Note that parser-level defaults always override argument-level defaults::
sv: Observera att standardvärden på parsernivå alltid åsidosätter standardvärden på argumentnivå::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default='bar') >>> parser.set_defaults(foo='spam') >>> parser.parse_args([]) Namespace(foo='spam')
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default='bar') >>> parser.set_defaults(foo='spam') >>> parser.parse_args([]) Namnrymd(foo='spam')

source: Parser-level defaults can be particularly useful when working with multiple parsers. See the :meth:`~ArgumentParser.add_subparsers` method for an example of this type.
sv: Standardvärden på parser-nivå kan vara särskilt användbara när man arbetar med flera parsers. Se metoden :meth:`~ArgumentParser.add_subparsers` för ett exempel på denna typ.

source: Get the default value for a namespace attribute, as set by either :meth:`~ArgumentParser.add_argument` or by :meth:`~ArgumentParser.set_defaults`::
sv: Hämta standardvärdet för ett namnrymdsattribut, som anges antingen av :meth:`~ArgumentParser.add_argument` eller av :meth:`~ArgumentParser.set_defaults`::

source: Printing help
sv: Hjälp med utskrift

source: In most typical applications, :meth:`~ArgumentParser.parse_args` will take care of formatting and printing any usage or error messages. However, several formatting methods are available:
sv: I de flesta typiska applikationer kommer :meth:`~ArgumentParser.parse_args` att ta hand om formateringen och skriva ut eventuella användnings- eller felmeddelanden. Det finns dock flera formateringsmetoder tillgängliga:

source: Print a brief description of how the :class:`ArgumentParser` should be invoked on the command line. If *file* is ``None``, :data:`sys.stdout` is assumed.
sv: Skriv ut en kort beskrivning av hur :class:`ArgumentParser` ska anropas på kommandoraden. Om *file* är ``None``, antas :data:`sys.stdout`.

source: Print a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`. If *file* is ``None``, :data:`sys.stdout` is assumed.
sv: Skriv ut ett hjälpmeddelande, inklusive programanvändning och information om de argument som registrerats med :class:`ArgumentParser`. Om *file* är ``None``, antas :data:`sys.stdout`.

source: There are also variants of these methods that simply return a string instead of printing it:
sv: Det finns också varianter av dessa metoder som helt enkelt returnerar en sträng i stället för att skriva ut den:

source: Return a string containing a brief description of how the :class:`ArgumentParser` should be invoked on the command line.
sv: Returnerar en sträng som innehåller en kort beskrivning av hur :class:`ArgumentParser` ska anropas på kommandoraden.

source: Return a string containing a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`.
sv: Returnerar en sträng som innehåller ett hjälpmeddelande, inklusive programanvändning och information om de argument som registrerats med :class:`ArgumentParser`.

source: Partial parsing
sv: Partiell parsning

source: Sometimes a script only needs to handle a specific set of command-line arguments, leaving any unrecognized arguments for another script or program. In these cases, the :meth:`~ArgumentParser.parse_known_args` method can be useful.
sv: Ibland behöver ett skript bara hantera en viss uppsättning kommandoradsargument och lämna eventuella oigenkända argument till ett annat skript eller program. I dessa fall kan metoden :meth:`~ArgumentParser.parse_known_args` vara användbar.

source: This method works similarly to :meth:`~ArgumentParser.parse_args`, but it does not raise an error for extra, unrecognized arguments. Instead, it parses the known arguments and returns a two item tuple that contains the populated namespace and the list of any unrecognized arguments.
sv: Den här metoden fungerar på samma sätt som :meth:`~ArgumentParser.parse_args`, men den ger inte felmeddelanden för extra, okända argument. Istället analyserar den de kända argumenten och returnerar en tupel med två objekt som innehåller den fyllda namnrymden och listan över eventuella okända argument.

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_true') >>> parser.add_argument('bar') >>> parser.parse_known_args(['--foo', '--badger', 'BAR', 'spam']) (Namespace(bar='BAR', foo=True), ['--badger', 'spam'])
sv: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_true') >>> parser.lägg_till_argument('bar') >>> parser.parse_known_args(['--foo', '--badger', 'BAR', 'spam']) (Namnrymd(bar='BAR', foo=True), ['--badger', 'spam'])

source: :ref:`Prefix matching <prefix-matching>` rules apply to :meth:`~ArgumentParser.parse_known_args`. The parser may consume an option even if it's just a prefix of one of its known options, instead of leaving it in the remaining arguments list.
sv: :ref:`Prefixmatchning <prefix-matching>` regler gäller för :meth:`~ArgumentParser.parse_known_args`. Parsern kan konsumera ett alternativ även om det bara är ett prefix av ett av dess kända alternativ, istället för att lämna det i den återstående argumentlistan.

source: Customizing file parsing
sv: Anpassa filparsning

source: Arguments that are read from a file (see the *fromfile_prefix_chars* keyword argument to the :class:`ArgumentParser` constructor) are read one argument per line. :meth:`convert_arg_line_to_args` can be overridden for fancier reading.
sv: Argument som läses från en fil (se nyckelordsargumentet *fromfile_prefix_chars* till konstruktören :class:`ArgumentParser`) läses ett argument per rad. :meth:`convert_arg_line_to_args` kan åsidosättas för mer avancerad läsning.

source: This method takes a single argument *arg_line* which is a string read from the argument file. It returns a list of arguments parsed from this string. The method is called once per line read from the argument file, in order.
sv: Denna metod tar ett enda argument *arg_line* som är en sträng som läses från argumentfilen. Den returnerar en lista med argument som tolkats från denna sträng. Metoden anropas en gång per rad som läses från argumentfilen, i ordning.

source: A useful override of this method is one that treats each space-separated word as an argument. The following example demonstrates how to do this::
sv: En användbar överstyrning av denna metod är en som behandlar varje mellanslagsseparerat ord som ett argument. Följande exempel visar hur man gör detta::

source: class MyArgumentParser(argparse.ArgumentParser): def convert_arg_line_to_args(self, arg_line): return arg_line.split()
sv: klass MyArgumentParser(argparse.ArgumentParser): def convert_arg_line_to_args(self, arg_line): return arg_line.split()

source: Exiting methods
sv: Spännande metoder

source: This method terminates the program, exiting with the specified *status* and, if given, it prints a *message* to :data:`sys.stderr` before that. The user can override this method to handle these steps differently::
sv: Den här metoden avslutar programmet med den angivna *statusen* och, om den anges, skriver den ut ett *meddelande* till :data:`sys.stderr` innan dess. Användaren kan åsidosätta den här metoden för att hantera dessa steg annorlunda::

source: class ErrorCatchingArgumentParser(argparse.ArgumentParser): def exit(self, status=0, message=None): if status: raise Exception(f'Exiting because of an error: {message}') exit(status)
sv: class ErrorCatchingArgumentParser(argparse.ArgumentParser): def exit(self, status=0, message=None): if status: raise Exception(f'Avslutar på grund av ett fel: {message}') exit(status)

source: This method prints a usage message, including the *message*, to :data:`sys.stderr` and terminates the program with a status code of 2.
sv: Denna metod skriver ut ett användningsmeddelande, inklusive *message*, till :data:`sys.stderr` och avslutar programmet med statuskoden 2.

source: Intermixed parsing
sv: Intermixad parsning

source: A number of Unix commands allow the user to intermix optional arguments with positional arguments. The :meth:`~ArgumentParser.parse_intermixed_args` and :meth:`~ArgumentParser.parse_known_intermixed_args` methods support this parsing style.
sv: Ett antal Unix-kommandon tillåter användaren att blanda valfria argument med positionella argument. Metoderna :meth:`~ArgumentParser.parse_intermixed_args` och :meth:`~ArgumentParser.parse_known_intermixed_args` stöder denna parsningsstil.

source: These parsers do not support all the :mod:`!argparse` features, and will raise exceptions if unsupported features are used. In particular, subparsers, and mutually exclusive groups that include both optionals and positionals are not supported.
sv: Dessa parsers har inte stöd för alla :mod:`!argparse`-funktioner, och kommer att ge upphov till undantag om funktioner som inte stöds används. I synnerhet stöds inte subparsers och ömsesidigt exklusiva grupper som innehåller både optionals och positionals.

source: The following example shows the difference between :meth:`~ArgumentParser.parse_known_args` and :meth:`~ArgumentParser.parse_intermixed_args`: the former returns ``['2', '3']`` as unparsed arguments, while the latter collects all the positionals into ``rest``. ::
sv: Följande exempel visar skillnaden mellan :meth:`~ArgumentParser.parse_known_args` och :meth:`~ArgumentParser.parse_intermixed_args`: den förra returnerar ``['2', '3']`` som oanalyserade argument, medan den senare samlar alla positionaler i ``rest``. ::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo') >>> parser.add_argument('cmd') >>> parser.add_argument('rest', nargs='*', type=int) >>> parser.parse_known_args('doit 1 --foo bar 2 3'.split()) (Namespace(cmd='doit', foo='bar', rest=[1]), ['2', '3']) >>> parser.parse_intermixed_args('doit 1 --foo bar 2 3'.split()) Namespace(cmd='doit', foo='bar', rest=[1, 2, 3])
sv: >>> parser = argparse.ArgumentParser() >>> parser.lägg_till_argument('--foo') >>> parser.add_argument('cmd') >>> parser.add_argument('rest', nargs='*', type=int) >>> parser.parse_known_args('doit 1 --foo bar 2 3'.split()) (Namespace(cmd='doit', foo='bar', rest=[1]), ['2', '3']) >>> parser.parse_intermixed_args('doit 1 --foo bar 2 3'.split()) Namnrymd(cmd='doit', foo='bar', rest=[1, 2, 3])

source: :meth:`~ArgumentParser.parse_known_intermixed_args` returns a two item tuple containing the populated namespace and the list of remaining argument strings. :meth:`~ArgumentParser.parse_intermixed_args` raises an error if there are any remaining unparsed argument strings.
sv: :meth:`~ArgumentParser.parse_known_intermixed_args` returnerar en tupel med två objekt som innehåller den fyllda namnrymden och listan över återstående argumentsträngar. :meth:`~ArgumentParser.parse_intermixed_args` ger upphov till ett fel om det finns några återstående oanalyserade argumentsträngar.

source: Registering custom types or actions
sv: Registrering av anpassade typer eller åtgärder

source: Sometimes it's desirable to use a custom string in error messages to provide more user-friendly output. In these cases, :meth:`!register` can be used to register custom actions or types with a parser and allow you to reference the type by their registered name instead of their callable name.
sv: Ibland är det önskvärt att använda en anpassad sträng i felmeddelanden för att ge en mer användarvänlig utdata. I dessa fall kan :meth:`!register` användas för att registrera anpassade åtgärder eller typer med en parser och låta dig referera till typen med deras registrerade namn istället för deras anropsbara namn.

source: The :meth:`!register` method accepts three arguments - a *registry_name*, specifying the internal registry where the object will be stored (e.g., ``action``, ``type``), *value*, which is the key under which the object will be registered, and object, the callable to be registered.
sv: Metoden :meth:`!register` tar emot tre argument - ett *registry_name*, som anger det interna register där objektet ska lagras (t.ex. ``action``, ``type``), *value*, som är den nyckel under vilken objektet ska registreras, och object, den anropbara enhet som ska registreras.

source: The following example shows how to register a custom type with a parser::
sv: Följande exempel visar hur man registrerar en anpassad typ med en parser::

source: >>> import argparse >>> parser = argparse.ArgumentParser() >>> parser.register('type', 'hexadecimal integer', lambda s: int(s, 16)) >>> parser.add_argument('--foo', type='hexadecimal integer') _StoreAction(option_strings=['--foo'], dest='foo', nargs=None, const=None, default=None, type='hexadecimal integer', choices=None, required=False, help=None, metavar=None, deprecated=False) >>> parser.parse_args(['--foo', '0xFA']) Namespace(foo=250) >>> parser.parse_args(['--foo', '1.2']) usage: PROG [-h] [--foo FOO] PROG: error: argument --foo: invalid 'hexadecimal integer' value: '1.2'
sv: >>> import argparse >>> parser = argparse.ArgumentParser() >>> parser.register('type', 'hexadecimalt heltal', lambda s: int(s, 16)) >>> parser.add_argument('--foo', typ='hexadecimalt heltal') _StoreAction(option_strings=['--foo'], dest='foo', nargs=None, const=None, default=None, type='hexadecimal integer', choices=None, required=False, help=None, metavar=None, deprecated=False) >>> parser.parse_args(['--foo', '0xFA']) Namnrymd(foo=250) >>> parser.parse_args(['--foo', '1.2']) användning: PROG [-h] [--foo FOO] PROG: fel: argument --foo: ogiltigt 'hexadecimalt heltal' värde: '1.2'

source: Exceptions
sv: Undantag

source: An error from creating or using an argument (optional or positional).
sv: Ett fel vid skapande eller användning av ett argument (valfritt eller positionellt).

source: The string value of this exception is the message, augmented with information about the argument that caused it.
sv: Strängvärdet för detta undantag är meddelandet, kompletterat med information om det argument som orsakade det.

source: Raised when something goes wrong converting a command line string to a type.
sv: Utlöses när något går fel när en kommandoradssträng konverteras till en typ.

source: Guides and Tutorials
sv: Guider och handledning

source: ? (question mark)
sv: ? (frågetecken)

source: in argparse module
sv: i argparse-modulen
