Repository: yeager/python-docs-sv
Catalog: library/asyncio-future.po
Languages: sv

source: **Source code:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`
sv: **Källkod:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`

source: *Future* objects are used to bridge **low-level callback-based code** with high-level async/await code.
sv: *Future*-objekt används för att överbrygga **kallelsebaserad kod på låg nivå** med async/await-kod på hög nivå.

source: Future Functions
sv: Framtida funktioner

source: Return ``True`` if *obj* is either of:
sv: Returnera ``True`` om *obj* är något av:

source: an instance of :class:`asyncio.Future`,
sv: en instans av :class:`asyncio.Future`,

source: an instance of :class:`asyncio.Task`,
sv: en instans av :class:`asyncio.Task`,

source: a Future-like object with a ``_asyncio_future_blocking`` attribute.
sv: ett Future-liknande objekt med attributet ``_asyncio_future_blocking``.

source: Return:
sv: Returnera:

source: *obj* argument as is, if *obj* is a :class:`Future`, a :class:`Task`, or a Future-like object (:func:`isfuture` is used for the test.)
sv: *obj* argument som det är, om *obj* är en :class:`Future`, en :class:`Task`, eller ett Future-liknande objekt (:func:`isfuture` används för testet.)

source: a :class:`Task` object wrapping *obj*, if *obj* is a coroutine (:func:`iscoroutine` is used for the test); in this case the coroutine will be scheduled by ``ensure_future()``.
sv: ett :class:`Task`-objekt som omsluter *obj*, om *obj* är en coroutine (:func:`iscoroutine` används för testet); i detta fall kommer coroutinen att schemaläggas med ``ensure_future()``.

source: a :class:`Task` object that would await on *obj*, if *obj* is an awaitable (:func:`inspect.isawaitable` is used for the test.)
sv: ett :class:`Task`-objekt som skulle awaita på *obj*, om *obj* är en awaitable (:func:`inspect.isawaitable` används för testet.)

source: If *obj* is neither of the above a :exc:`TypeError` is raised.
sv: Om *obj* inte är någon av de ovan nämnda händelserna uppstår ett :exc:`TypeError`.

source: Save a reference to the result of this function, to avoid a task disappearing mid-execution.
sv: Spara en referens till resultatet av denna funktion, för att undvika att en uppgift försvinner mitt under utförandet.

source: See also the :func:`create_task` function which is the preferred way for creating new tasks or use :class:`asyncio.TaskGroup` which keeps reference to the task internally.
sv: Se även funktionen :func:`create_task` som är det föredragna sättet att skapa nya uppgifter eller använd :class:`asyncio.TaskGroup` som håller referensen till uppgiften internt.

source: The function accepts any :term:`awaitable` object.
sv: Funktionen accepterar alla :term:`awaitable`-objekt.

source: Deprecation warning is emitted if *obj* is not a Future-like object and *loop* is not specified and there is no running event loop.
sv: Deprecation-varning utfärdas om *obj* inte är ett Future-liknande objekt och *loop* inte anges och det inte finns någon pågående händelseslinga.

source: Wrap a :class:`concurrent.futures.Future` object in a :class:`asyncio.Future` object.
sv: Packa in ett :class:`concurrent.futures.Future`-objekt i ett :class:`asyncio.Future`-objekt.

source: Deprecation warning is emitted if *future* is not a Future-like object and *loop* is not specified and there is no running event loop.
sv: Deprecation-varning utfärdas om *future* inte är ett Future-liknande objekt och *loop* inte anges och det inte finns någon pågående händelseslinga.

source: Future Object
sv: Framtida objekt

source: A Future represents an eventual result of an asynchronous operation. Not thread-safe.
sv: En Future representerar ett eventuellt resultat av en asynkron operation. Inte tråd-säker.

source: Future is an :term:`awaitable` object. Coroutines can await on Future objects until they either have a result or an exception set, or until they are cancelled. A Future can be awaited multiple times and the result is same.
sv: Future är ett :term:`awaitable`-objekt. Coroutines kan vänta på Future-objekt tills de antingen har ett resultat eller ett undantag inställt, eller tills de avbryts. En Future kan väntas flera gånger och resultatet blir detsamma.

source: Typically Futures are used to enable low-level callback-based code (e.g. in protocols implemented using asyncio :ref:`transports <asyncio-transports-protocols>`) to interoperate with high-level async/await code.
sv: Futures används vanligtvis för att göra det möjligt för callback-baserad kod på låg nivå (t.ex. i protokoll som implementeras med asyncio :ref:`transports <asyncio-transports-protocols>`) att samverka med async/await-kod på hög nivå.

source: The rule of thumb is to never expose Future objects in user-facing APIs, and the recommended way to create a Future object is to call :meth:`loop.create_future`. This way alternative event loop implementations can inject their own optimized implementations of a Future object.
sv: Tumregeln är att aldrig exponera Future-objekt i API:er som vänder sig till användare, och det rekommenderade sättet att skapa ett Future-objekt är att anropa :meth:`loop.create_future`. På så sätt kan alternativa implementeringar av händelseslingor injicera sina egna optimerade implementeringar av ett Future-objekt.

source: Added support for the :mod:`contextvars` module.
sv: Lagt till stöd för modulen :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
sv: Deprecation-varning utfärdas om *loop* inte anges och det inte finns någon pågående händelseslinga.

source: Return the result of the Future.
sv: Returnera resultatet av Future.

source: If the Future is *done* and has a result set by the :meth:`set_result` method, the result value is returned.
sv: Om Future är *done* och har ett resultat som ställts in med metoden :meth:`set_result`, returneras resultatvärdet.

source: If the Future is *done* and has an exception set by the :meth:`set_exception` method, this method raises the exception.
sv: Om Future är *done* och har ett undantag som ställts in med metoden :meth:`set_exception`, kommer undantaget att tas upp med denna metod.

source: If the Future has been *cancelled*, this method raises a :exc:`CancelledError` exception.
sv: Om framtiden har *avbrutits*, ger denna metod upphov till ett :exc:`CancelledError`-undantag.

source: If the Future's result isn't yet available, this method raises an :exc:`InvalidStateError` exception.
sv: Om framtidens resultat ännu inte är tillgängligt, ger denna metod upphov till ett :exc:`InvalidStateError`-undantag.

source: Mark the Future as *done* and set its result.
sv: Markera Future som *utförd* och ange dess resultat.

source: Raises an :exc:`InvalidStateError` error if the Future is already *done*.
sv: Utlöser ett :exc:`InvalidStateError`-fel om Future redan är *done*.

source: Mark the Future as *done* and set an exception.
sv: Markera Future som *done* och ställ in ett undantag.

source: Return ``True`` if the Future is *done*.
sv: Returnerar ``True`` om framtiden är *done*.

source: A Future is *done* if it was *cancelled* or if it has a result or an exception set with :meth:`set_result` or :meth:`set_exception` calls.
sv: En Future är *done* om den *cancelled* eller om den har ett resultat eller ett undantag som ställts in med :meth:`set_result` eller :meth:`set_exception` anrop.

source: Return ``True`` if the Future was *cancelled*.
sv: Returnerar ``True`` om Framtiden var *avbruten*.

source: The method is usually used to check if a Future is not *cancelled* before setting a result or an exception for it::
sv: Metoden används vanligtvis för att kontrollera om en Future inte är *cancelled* innan ett resultat eller ett undantag anges för den::

source: if not fut.cancelled(): fut.set_result(42)
sv: om inte fut.cancelled(): fut.set_result(42)

source: Add a callback to be run when the Future is *done*.
sv: Lägg till en återuppringning som ska köras när Future är *done*.

source: The *callback* is called with the Future object as its only argument.
sv: *Callback* anropas med Future-objektet som enda argument.

source: If the Future is already *done* when this method is called, the callback is scheduled with :meth:`loop.call_soon`.
sv: Om Future redan är *färdig* när den här metoden anropas, schemaläggs återuppringningen med :meth:`loop.call_soon`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
sv: Ett valfritt argument *context* med endast nyckelord gör det möjligt att ange en anpassad :class:`contextvars.Context` som *callback* ska köras i. Den aktuella kontexten används när ingen *kontext* anges.

source: :func:`functools.partial` can be used to pass parameters to the callback, e.g.::
sv: :func:`functools.partial` kan användas för att skicka parametrar till återuppringningen, t.ex.::

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
sv: Parametern *context* (endast nyckelord) har lagts till. Se :pep:`567` för mer information.

source: Remove *callback* from the callbacks list.
sv: Ta bort *callback* från listan över callbacks.

source: Returns the number of callbacks removed, which is typically 1, unless a callback was added more than once.
sv: Returnerar antalet borttagna återuppringningar, vilket vanligtvis är 1, såvida inte en återuppringning har lagts till mer än en gång.

source: Cancel the Future and schedule callbacks.
sv: Avbryt Future och schemalägg callbacks.

source: If the Future is already *done* or *cancelled*, return ``False``. Otherwise, change the Future's state to *cancelled*, schedule the callbacks, and return ``True``.
sv: Om framtiden redan är *done* eller *cancelled*, returneras ``False``. I annat fall ändras Framtidens tillstånd till *avbruten*, schemalägger återuppringningarna och returnerar ``True``.

source: Added the *msg* parameter.
sv: Parametern *msg* har lagts till.

source: Return the exception that was set on this Future.
sv: Returnerar det undantag som ställdes in för denna Future.

source: The exception (or ``None`` if no exception was set) is returned only if the Future is *done*.
sv: Undantaget (eller ``None`` om inget undantag har angetts) returneras endast om Future är *done*.

source: If the Future isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
sv: Om Future inte är *färdig* ännu, ger denna metod upphov till ett :exc:`InvalidStateError`-undantag.

source: Return the event loop the Future object is bound to.
sv: Returnerar den händelseslinga som Future-objektet är bundet till.

source: This example creates a Future object, creates and schedules an asynchronous Task to set result for the Future, and waits until the Future has a result::
sv: I det här exemplet skapas ett Future-objekt, en asynkron Task skapas och schemaläggs för att ange resultat för Future och väntar tills Future har ett resultat::

source: The Future object was designed to mimic :class:`concurrent.futures.Future`. Key differences include:
sv: Future-objektet har utformats för att efterlikna :class:`concurrent.futures.Future`. Viktiga skillnader inkluderar:

source: unlike asyncio Futures, :class:`concurrent.futures.Future` instances cannot be awaited.
sv: till skillnad från asyncio Futures, kan :class:`concurrent.futures.Future`-instanser inte inväntas.

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` do not accept the *timeout* argument.
sv: :meth:`asyncio.Future.result` och :meth:`asyncio.Future.exception` accepterar inte argumentet *timeout*.

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` raise an :exc:`InvalidStateError` exception when the Future is not *done*.
sv: :meth:`asyncio.Future.result` och :meth:`asyncio.Future.exception` ger upphov till ett :exc:`InvalidStateError` undantag när framtiden inte är *done*.

source: Callbacks registered with :meth:`asyncio.Future.add_done_callback` are not called immediately. They are scheduled with :meth:`loop.call_soon` instead.
sv: Återanrop som registrerats med :meth:`asyncio.Future.add_done_callback` anropas inte omedelbart. De schemaläggs med :meth:`loop.call_soon` istället.

source: asyncio Future is not compatible with the :func:`concurrent.futures.wait` and :func:`concurrent.futures.as_completed` functions.
sv: asyncio Future är inte kompatibel med funktionerna :func:`concurrent.futures.wait` och :func:`concurrent.futures.as_completed`.

source: :meth:`asyncio.Future.cancel` accepts an optional ``msg`` argument, but :meth:`concurrent.futures.Future.cancel` does not.
sv: :meth:`asyncio.Future.cancel` accepterar ett valfritt ``msg`` argument, men :meth:`concurrent.futures.Future.cancel` gör det inte.
