Repository: yeager/python-docs-sv
Catalog: library/asyncio-eventloop.po
Languages: sv

source: If *factory* is ``None`` the default task factory will be set. Otherwise, *factory* must be a *callable* with the signature matching ``(loop, coro, **kwargs)``, where *loop* is a reference to the active event loop, and *coro* is a coroutine object. The callable must pass on all *kwargs*, and return a :class:`asyncio.Task`-compatible object.
sv: Om *factory* är ``None`` kommer standarduppgiftsfabriken att ställas in. Annars måste *factory* vara en *callable* med en signatur som matchar ``(loop, coro, **kwargs)``, där *loop* är en referens till den aktiva händelseslingan och *coro* är ett coroutine-objekt. Callable måste skicka vidare alla *kwargs* och returnera ett :class:`asyncio.Task`-kompatibelt objekt.

source: Required that all *kwargs* are passed on to :class:`asyncio.Task`.
sv: Kräver att alla *kwargs* skickas vidare till :class:`asyncio.Task`.

source: *name* is no longer passed to task factories. *context* is no longer passed to task factories if it is ``None``.
sv: *name* skickas inte längre till uppgiftsfabriker. *context* skickas inte längre till uppgiftsfabriker om det är ``None``.

source: *name* and *context* are now unconditionally passed on to task factories again.
sv: *name* och *context* skickas nu ovillkorligen vidare till uppgiftsfabrikerna igen.

source: Return a task factory or ``None`` if the default one is in use.
sv: Returnerar en uppgiftsfabrik eller ``None`` om standardfabriken används.

source: Opening network connections
sv: Öppna nätverksanslutningar

source: Open a streaming transport connection to a given address specified by *host* and *port*.
sv: Öppna en anslutning för strömmande transport till en given adress som specificeras av *host* och *port*.

source: The socket family can be either :py:const:`~socket.AF_INET` or :py:const:`~socket.AF_INET6` depending on *host* (or the *family* argument, if provided).
sv: Socketfamiljen kan vara antingen :py:const:`~socket.AF_INET` eller :py:const:`~socket.AF_INET6` beroende på *host* (eller argumentet *family*, om det anges).

source: The socket type will be :py:const:`~socket.SOCK_STREAM`.
sv: Socket-typen kommer att vara :py:const:`~socket.SOCK_STREAM`.

source: *protocol_factory* must be a callable returning an :ref:`asyncio protocol <asyncio-protocol>` implementation.
sv: *protocol_factory* måste vara en anropsbar som returnerar en :ref:`asyncio protocol <asyncio-protocol>`-implementering.

source: This method will try to establish the connection in the background. When successful, it returns a ``(transport, protocol)`` pair.
sv: Denna metod försöker upprätta anslutningen i bakgrunden. Om det lyckas returnerar den ett par ``(transport, protokoll)``.

source: The chronological synopsis of the underlying operation is as follows:
sv: Den kronologiska sammanfattningen av den underliggande transaktionen är följande:

source: The connection is established and a :ref:`transport <asyncio-transport>` is created for it.
sv: Anslutningen upprättas och en :ref:`transport <asyncio-transport>` skapas för den.

source: *protocol_factory* is called without arguments and is expected to return a :ref:`protocol <asyncio-protocol>` instance.
sv: *protocol_factory* anropas utan argument och förväntas returnera en :ref:`protocol <asyncio-protocol>`-instans.

source: The protocol instance is coupled with the transport by calling its :meth:`~BaseProtocol.connection_made` method.
sv: Protokollinstansen kopplas till transporten genom att anropa dess metod :meth:`~BaseProtocol.connection_made`.

source: A ``(transport, protocol)`` tuple is returned on success.
sv: En ``(transport, protokoll)``-tupel returneras vid framgång.

source: The created transport is an implementation-dependent bidirectional stream.
sv: Den skapade transporten är en implementationsberoende dubbelriktad ström.

source: Other arguments:
sv: Övriga argument:

source: *ssl*: if given and not false, a SSL/TLS transport is created (by default a plain TCP transport is created). If *ssl* is a :class:`ssl.SSLContext` object, this context is used to create the transport; if *ssl* is :const:`True`, a default context returned from :func:`ssl.create_default_context` is used.
sv: *ssl*: om den anges och inte är false, skapas en SSL/TLS-transport (som standard skapas en vanlig TCP-transport). Om *ssl* är ett :class:`ssl.SSLContext`-objekt används detta sammanhang för att skapa transporten; om *ssl* är :const:`True` används ett standardkontext som returneras från :func:`ssl.create_default_context`.

source: :ref:`SSL/TLS security considerations <ssl-security>`
sv: :ref:`SSL/TLS säkerhetsaspekter <ssl-security>`

source: *server_hostname* sets or overrides the hostname that the target server's certificate will be matched against. Should only be passed if *ssl* is not ``None``. By default the value of the *host* argument is used. If *host* is empty, there is no default and you must pass a value for *server_hostname*. If *server_hostname* is an empty string, hostname matching is disabled (which is a serious security risk, allowing for potential man-in-the-middle attacks).
sv: *server_hostname* anger eller åsidosätter det värdnamn som målserverns certifikat ska matchas mot. Ska endast skickas om *ssl* inte är ``None``. Som standard används värdet för *host*-argumentet. Om *host* är tomt finns det inget standardvärde och du måste ange ett värde för *server_hostname*. Om *server_hostname* är en tom sträng inaktiveras matchning av värdnamn (vilket är en allvarlig säkerhetsrisk eftersom det möjliggör potentiella man-in-the-middle-attacker).

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to getaddrinfo() for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
sv: *family*, *proto*, *flags* är den valfria adressfamiljen, protokollet och flaggorna som ska skickas vidare till getaddrinfo() för upplösning av *host*. Om de anges bör de alla vara heltal från motsvarande :mod:`socket`-modulkonstanter.

source: *happy_eyeballs_delay*, if given, enables Happy Eyeballs for this connection. It should be a floating-point number representing the amount of time in seconds to wait for a connection attempt to complete, before starting the next attempt in parallel. This is the "Connection Attempt Delay" as defined in :rfc:`8305`. A sensible default value recommended by the RFC is ``0.25`` (250 milliseconds).
sv: *happy_eyeballs_delay*, om det anges, aktiverar Happy Eyeballs för den här anslutningen. Det bör vara ett flyttal som representerar den tid i sekunder som ska vänta på att ett anslutningsförsök ska slutföras innan nästa försök påbörjas parallellt. Detta är "Connection Attempt Delay" enligt definitionen i :rfc:`8305`. Ett förnuftigt standardvärde som rekommenderas av RFC är ``0,25`` (250 millisekunder).

source: *interleave* controls address reordering when a host name resolves to multiple IP addresses. If ``0`` or unspecified, no reordering is done, and addresses are tried in the order returned by :meth:`getaddrinfo`. If a positive integer is specified, the addresses are interleaved by address family, and the given integer is interpreted as "First Address Family Count" as defined in :rfc:`8305`. The default is ``0`` if *happy_eyeballs_delay* is not specified, and ``1`` if it is.
sv: *interleave* styr omordning av adresser när ett värdnamn kopplas till flera IP-adresser. Om ``0`` eller ospecificerat görs ingen omordning och adresserna prövas i den ordning som returneras av :meth:`getaddrinfo`. Om ett positivt heltal anges, sammanflätas adresserna efter adressfamilj och det angivna heltalet tolkas som "First Address Family Count" enligt definitionen i :rfc:`8305`. Standardvärdet är ``0`` om *happy_eyeballs_delay* inte har angetts och ``1`` om så är fallet.

source: *sock*, if given, should be an existing, already connected :class:`socket.socket` object to be used by the transport. If *sock* is given, none of *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* and *local_addr* should be specified.
sv: *sock*, om det anges, ska vara ett befintligt, redan anslutet :class:`socket.socket'-objekt som ska användas av transporten. Om *sock* anges ska inget av *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* eller *local_addr* specificeras.

source: The *sock* argument transfers ownership of the socket to the transport created. To close the socket, call the transport's :meth:`~asyncio.BaseTransport.close` method.
sv: Argumentet *sock* överför ägandet av sockeln till den transport som skapats. För att stänga sockeln anropar du transportens :meth:`~asyncio.BaseTransport.close`-metod.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using ``getaddrinfo()``, similarly to *host* and *port*.
sv: *local_addr*, om det anges, är en ``(local_host, local_port)``-tupel som används för att binda uttaget lokalt. *local_host* och *local_port* söks upp med hjälp av ``getaddrinfo()``, på samma sätt som *host* och *port*.

source: *ssl_handshake_timeout* is (for a TLS connection) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
sv: *ssl_handshake_timeout* är (för en TLS-anslutning) den tid i sekunder som ska vänta på att TLS-handskakningen ska slutföras innan anslutningen avbryts. ``60,0`` sekunder om ``None`` (standard).

source: *ssl_shutdown_timeout* is the time in seconds to wait for the SSL shutdown to complete before aborting the connection. ``30.0`` seconds if ``None`` (default).
sv: *ssl_shutdown_timeout* är den tid i sekunder som ska vänta på att SSL-avstängningen ska slutföras innan anslutningen avbryts. ``30.0`` sekunder om ``None`` (standard).

source: *all_errors* determines what exceptions are raised when a connection cannot be created. By default, only a single ``Exception`` is raised: the first exception if there is only one or all errors have same message, or a single ``OSError`` with the error messages combined. When ``all_errors`` is ``True``, an ``ExceptionGroup`` will be raised containing all exceptions (even if there is only one).
sv: *all_errors* avgör vilka undantag som tas upp när en anslutning inte kan skapas. Som standard genereras endast ett enda ``Exception``: det första undantaget om det bara finns ett eller om alla fel har samma meddelande, eller ett enda ``OSError`` med felmeddelandena kombinerade. När ``all_errors`` är ``True`` kommer en ``ExceptionGroup`` att skapas som innehåller alla undantag (även om det bara finns ett).

source: Added support for SSL/TLS in :class:`ProactorEventLoop`.
sv: Lagt till stöd för SSL/TLS i :class:`ProactorEventLoop`.

source: The socket option :ref:`socket.TCP_NODELAY <socket-unix-constants>` is set by default for all TCP connections.
sv: Socket-alternativet :ref:`socket.TCP_NODELAY <socket-unix-constants>` är inställt som standard för alla TCP-anslutningar.

source: Added the *ssl_handshake_timeout* parameter.
sv: Parametern *ssl_handshake_timeout* har lagts till.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
sv: Lagt till parametrarna *happy_eyeballs_delay* och *interleave*.

source: Happy Eyeballs Algorithm: Success with Dual-Stack Hosts. When a server's IPv4 path and protocol are working, but the server's IPv6 path and protocol are not working, a dual-stack client application experiences significant connection delay compared to an IPv4-only client. This is undesirable because it causes the dual-stack client to have a worse user experience. This document specifies requirements for algorithms that reduce this user-visible delay and provides an algorithm.
sv: Algoritm för glada ögonbollar: Framgång med Dual-Stack-värdar. När en servers IPv4-sökväg och -protokoll fungerar, men serverns IPv6-sökväg och -protokoll inte fungerar, upplever en dual-stack-klientapplikation en betydande anslutningsfördröjning jämfört med en klient med enbart IPv4. Detta är inte önskvärt eftersom det leder till att dual-stack-klienten får en sämre användarupplevelse. Detta dokument specificerar krav för algoritmer som minskar denna för användaren synliga fördröjning och tillhandahåller en algoritm.

source: For more information: https://datatracker.ietf.org/doc/html/rfc6555
sv: För mer information: https://datatracker.ietf.org/doc/html/rfc6555

source: Added the *ssl_shutdown_timeout* parameter.
sv: Parametern *ssl_shutdown_timeout* har lagts till.

source: *all_errors* was added.
sv: *all_errors* har lagts till.

source: The :func:`open_connection` function is a high-level alternative API. It returns a pair of (:class:`StreamReader`, :class:`StreamWriter`) that can be used directly in async/await code.
sv: Funktionen :func:`open_connection` är ett alternativt API på hög nivå. Den returnerar ett par (:class:`StreamReader`, :class:`StreamWriter`) som kan användas direkt i async/await-kod.

source: Create a datagram connection.
sv: Skapa en datagramanslutning.

source: The socket family can be either :py:const:`~socket.AF_INET`, :py:const:`~socket.AF_INET6`, or :py:const:`~socket.AF_UNIX`, depending on *host* (or the *family* argument, if provided).
sv: Socketfamiljen kan vara antingen :py:const:`~socket.AF_INET`, :py:const:`~socket.AF_INET6` eller :py:const:`~socket.AF_UNIX`, beroende på *host* (eller argumentet *family*, om det anges).

source: The socket type will be :py:const:`~socket.SOCK_DGRAM`.
sv: Socket-typen är :py:const:`~socket.SOCK_DGRAM`.

source: *protocol_factory* must be a callable returning a :ref:`protocol <asyncio-protocol>` implementation.
sv: *protocol_factory* måste vara en callable som returnerar en :ref:`protocol <asyncio-protocol>` implementation.

source: A tuple of ``(transport, protocol)`` is returned on success.
sv: En tupel av ``(transport, protokoll)`` returneras vid framgång.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using :meth:`getaddrinfo`.
sv: *local_addr*, om den anges, är en ``(local_host, local_port)``-tupel som används för att binda socket lokalt. *local_host* och *local_port* söks upp med hjälp av :meth:`getaddrinfo`.

source: On Windows, when using the proactor event loop with ``local_addr=None``, an :exc:`OSError` with :attr:`!errno.WSAEINVAL` will be raised when running it.
sv: I Windows, när du använder proactor-händelseslingan med ``local_addr=None``, kommer ett :exc:`OSError` med :attr:`!errno.WSAEINVAL` att uppstå när du kör det.

source: *remote_addr*, if given, is a ``(remote_host, remote_port)`` tuple used to connect the socket to a remote address. The *remote_host* and *remote_port* are looked up using :meth:`getaddrinfo`.
sv: *remote_addr*, om den anges, är en ``(remote_host, remote_port)``-tupel som används för att ansluta sockeln till en fjärradress. *remote_host* och *remote_port* söks upp med hjälp av :meth:`getaddrinfo`.

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to :meth:`getaddrinfo` for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
sv: *family*, *proto*, *flags* är den valfria adressfamiljen, protokollet och flaggorna som ska skickas vidare till :meth:`getaddrinfo` för *host*-upplösning. Om de anges bör de alla vara heltal från motsvarande :mod:`socket`-modulkonstanter.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows and some Unixes. If the :ref:`socket.SO_REUSEPORT <socket-unix-constants>` constant is not defined then this capability is unsupported.
sv: *reuse_port* talar om för kärnan att den här ändpunkten får vara bunden till samma port som andra befintliga ändpunkter är bundna till, så länge de alla sätter denna flagga när de skapas. Detta alternativ stöds inte av Windows och vissa Unix. Om konstanten :ref:`socket.SO_REUSEPORT <socket-unix-constants>` inte är definierad stöds inte denna funktion.

source: *allow_broadcast* tells the kernel to allow this endpoint to send messages to the broadcast address.
sv: *allow_broadcast* talar om för kärnan att den här slutpunkten får skicka meddelanden till broadcast-adressen.

source: *sock* can optionally be specified in order to use a preexisting, already connected, :class:`socket.socket` object to be used by the transport. If specified, *local_addr* and *remote_addr* should be omitted (must be :const:`None`).
sv: *sock* kan eventuellt anges för att använda ett befintligt, redan anslutet, :class:`socket.socket`-objekt som ska användas av transporten. Om detta anges ska *local_addr* och *remote_addr* utelämnas (måste vara :const:`None`).

source: See :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` and :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>` examples.
sv: Se :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` och :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>` exempel.

source: The *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast*, and *sock* parameters were added.
sv: Parametrarna *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast* och *sock* har lagts till.

source: Added support for Windows.
sv: Stöd för Windows har lagts till.

source: The *reuse_address* parameter is no longer supported, as using :ref:`socket.SO_REUSEADDR <socket-unix-constants>` poses a significant security concern for UDP. Explicitly passing ``reuse_address=True`` will raise an exception.
sv: Parametern *reuse_address* stöds inte längre, eftersom användning av :ref:`socket.SO_REUSEADDR <socket-unix-constants>` utgör ett betydande säkerhetsproblem för UDP. Om du uttryckligen skickar ``reuse_address=True`` kommer ett undantag att uppstå.

source: When multiple processes with differing UIDs assign sockets to an identical UDP socket address with ``SO_REUSEADDR``, incoming packets can become randomly distributed among the sockets.
sv: När flera processer med olika UID:er tilldelar uttag till en identisk UDP-socketadress med ``SO_REUSEADDR`` kan inkommande paket fördelas slumpmässigt mellan uttagen.

source: For supported platforms, *reuse_port* can be used as a replacement for similar functionality. With *reuse_port*, :ref:`socket.SO_REUSEPORT <socket-unix-constants>` is used instead, which specifically prevents processes with differing UIDs from assigning sockets to the same socket address.
sv: För plattformar som stöds kan *reuse_port* användas som ersättning för liknande funktionalitet. Med *reuse_port* används istället :ref:`socket.SO_REUSEPORT <socket-unix-constants>`, vilket specifikt förhindrar att processer med olika UID:n tilldelar uttag till samma uttagsadress.

source: The *reuse_address* parameter, disabled since Python 3.8.1, 3.7.6 and 3.6.10, has been entirely removed.
sv: Parametern *reuse_address*, som varit inaktiverad sedan Python 3.8.1, 3.7.6 och 3.6.10, har tagits bort helt.

source: Create a Unix connection.
sv: Skapa en Unix-anslutning.

source: The socket family will be :py:const:`~socket.AF_UNIX`; socket type will be :py:const:`~socket.SOCK_STREAM`.
sv: Socket-familjen är :py:const:`~socket.AF_UNIX`; socket-typen är :py:const:`~socket.SOCK_STREAM`.

source: *path* is the name of a Unix domain socket and is required, unless a *sock* parameter is specified. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
sv: *path* är namnet på ett Unix-domänuttag och är obligatoriskt om inte parametern *sock* har angetts. Abstrakta Unix-sockets, :class:`str`, :class:`bytes` och :class:`~pathlib.Path`-sökvägar stöds.

source: See the documentation of the :meth:`loop.create_connection` method for information about arguments to this method.
sv: Se dokumentationen för metoden :meth:`loop.create_connection` för information om argument till denna metod.

source: Availability
sv: Tillgänglighet

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`.
sv: Parametern *ssl_handshake_timeout* har lagts till. Parametern *path* kan nu vara en :term:`path-liknande objekt`.

source: Creating network servers
sv: Skapa nätverksservrar

source: Create a TCP server (socket type :const:`~socket.SOCK_STREAM`) listening on *port* of the *host* address.
sv: Skapa en TCP-server (socket-typ :const:`~socket.SOCK_STREAM`) som lyssnar på *port* på *host*-adressen.

source: Returns a :class:`Server` object.
sv: Returnerar ett :class:`Server`-objekt.

source: Arguments:
sv: Argument:

source: The *host* parameter can be set to several types which determine where the server would be listening:
sv: Parametern *host* kan ställas in på flera olika typer som avgör var servern ska lyssna:

source: If *host* is a string, the TCP server is bound to a single network interface specified by *host*.
sv: Om *host* är en sträng är TCP-servern bunden till ett enda nätverksgränssnitt som anges av *host*.

source: If *host* is a sequence of strings, the TCP server is bound to all network interfaces specified by the sequence.
sv: Om *host* är en sekvens av strängar, är TCP-servern bunden till alla nätverksgränssnitt som anges av sekvensen.

source: If *host* is an empty string or ``None``, all interfaces are assumed and a list of multiple sockets will be returned (most likely one for IPv4 and another one for IPv6).
sv: Om *host* är en tom sträng eller ``None`` antas alla gränssnitt och en lista med flera socklar returneras (troligen en för IPv4 och en annan för IPv6).

source: The *port* parameter can be set to specify which port the server should listen on. If ``0`` or ``None`` (the default), a random unused port will be selected (note that if *host* resolves to multiple network interfaces, a different random port will be selected for each interface).
sv: Parametern *port* kan användas för att ange vilken port som servern ska lyssna på. Om ``0`` eller ``None`` (standard) väljs en slumpmässig oanvänd port (observera att om *host* är kopplad till flera nätverksgränssnitt väljs en slumpmässig port för varje gränssnitt).

source: *family* can be set to either :const:`socket.AF_INET` or :const:`~socket.AF_INET6` to force the socket to use IPv4 or IPv6. If not set, the *family* will be determined from host name (defaults to :const:`~socket.AF_UNSPEC`).
sv: *family* kan sättas till antingen :const:`socket.AF_INET` eller :const:`~socket.AF_INET6` för att tvinga uttaget att använda IPv4 eller IPv6. Om den inte anges kommer *familjen* att bestämmas utifrån värdnamnet (standard är :const:`~socket.AF_UNSPEC`).

source: *flags* is a bitmask for :meth:`getaddrinfo`.
sv: *flags* är en bitmask för :meth:`getaddrinfo`.

source: *sock* can optionally be specified in order to use a preexisting socket object. If specified, *host* and *port* must not be specified.
sv: *sock* kan eventuellt anges för att använda ett redan befintligt socket-objekt. Om *host* och *port* anges får de inte specificeras.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
sv: Argumentet *sock* överför äganderätten till sockeln till den server som skapats. För att stänga sockeln anropar du serverns :meth:`~asyncio.Server.close`-metod.

source: *backlog* is the maximum number of queued connections passed to :meth:`~socket.socket.listen` (defaults to 100).
sv: *backlog* är det maximala antalet anslutningar i kö som skickas till :meth:`~socket.socket.listen` (standardvärde 100).
