Repository: yeager/python-docs-sv
Catalog: library/asyncio-task.po
Languages: sv

source: ipv4_connect = create_task(open_connection("127.0.0.1", 80)) ipv6_connect = create_task(open_connection("::1", 80)) tasks = [ipv4_connect, ipv6_connect] async for earliest_connect in as_completed(tasks): # earliest_connect is done. The result can be obtained by # awaiting it or calling earliest_connect.result() reader, writer = await earliest_connect if earliest_connect is ipv6_connect: print("IPv6 connection established.") else: print("IPv4 connection established.")
sv: ipv4_connect = create_task(open_connection("127.0.0.1", 80)) ipv6_connect = create_task(open_connection("::1", 80)) uppgifter = [ipv4_connect, ipv6_connect] async for earliest_connect in as_completed(tasks): # earliest_connect är klar. Resultatet kan erhållas genom att # vänta på det eller anropa earliest_connect.result() reader, writer = vänta på earliest_connect om earliest_connect är ipv6_connect: print("IPv6-anslutning upprättad.") annat: print("IPv4-anslutning upprättad.")

source: During asynchronous iteration, implicitly-created tasks will be yielded for supplied awaitables that aren't tasks or futures.
sv: Under asynkron iteration kommer implicit skapade uppgifter att ges för levererade awaitables som inte är uppgifter eller futures.

source: When used as a plain iterator, each iteration yields a new coroutine that returns the result or raises the exception of the next completed awaitable. This pattern is compatible with Python versions older than 3.13::
sv: När den används som en vanlig iterator ger varje iteration en ny coroutine som returnerar resultatet eller väcker undantaget för nästa slutförda awaitable. Detta mönster är kompatibelt med Python-versioner äldre än 3.13::

source: ipv4_connect = create_task(open_connection("127.0.0.1", 80)) ipv6_connect = create_task(open_connection("::1", 80)) tasks = [ipv4_connect, ipv6_connect] for next_connect in as_completed(tasks): # next_connect is not one of the original task objects. It must be # awaited to obtain the result value or raise the exception of the # awaitable that finishes next. reader, writer = await next_connect
sv: ipv4_connect = create_task(open_connection("127.0.0.1", 80)) ipv6_connect = create_task(open_connection("::1", 80)) uppgifter = [ipv4_connect, ipv6_connect] for next_connect in as_completed(tasks): # next_connect är inte ett av de ursprungliga uppgiftsobjekten. Det måste vara # väntas för att få fram resultatvärdet eller väcka undantag för den # awaitable som avslutas härnäst. reader, writer = vänta på next_connect

source: A :exc:`TimeoutError` is raised if the timeout occurs before all awaitables are done. This is raised by the ``async for`` loop during asynchronous iteration or by the coroutines yielded during plain iteration.
sv: Ett :exc:`TimeoutError` uppstår om timeouten inträffar innan alla awaitables är klara. Detta orsakas av ``async for``-loopen under asynkron iteration eller av de coroutines som uppstår under vanlig iteration.

source: Deprecation warning is emitted if not all awaitable objects in the *aws* iterable are Future-like objects and there is no running event loop.
sv: Deprecation-varning utfärdas om inte alla awaitable-objekt i *aws*-iterabeln är Future-liknande objekt och det inte finns någon pågående händelseslinga.

source: The result can now be used as either an :term:`asynchronous iterator` or as a plain :term:`iterator` (previously it was only a plain iterator).
sv: Resultatet kan nu användas som antingen en :term:`asynkron iterator` eller som en vanlig :term:`iterator` (tidigare var det bara en vanlig iterator).

source: Running in Threads
sv: Löpande i trådar

source: Asynchronously run function *func* in a separate thread.
sv: Asynkron körning av funktionen *func* i en separat tråd.

source: Any \*args and \*\*kwargs supplied for this function are directly passed to *func*. Also, the current :class:`contextvars.Context` is propagated, allowing context variables from the event loop thread to be accessed in the separate thread.
sv: Alla \*args och \*\*kwargs som anges för denna funktion skickas direkt till *func*. Dessutom sprids den aktuella :class:`contextvars.Context`, vilket gör att kontextvariabler från händelseslingans tråd kan nås i den separata tråden.

source: Return a coroutine that can be awaited to get the eventual result of *func*.
sv: Returnera en coroutine som kan inväntas för att få det slutliga resultatet av *func*.

source: This coroutine function is primarily intended to be used for executing IO-bound functions/methods that would otherwise block the event loop if they were run in the main thread. For example::
sv: Denna coroutine-funktion är främst avsedd att användas för att köra IO-bundna funktioner/metoder som annars skulle blockera händelseslingan om de kördes i huvudtråden. Till exempel::

source: def blocking_io(): print(f"start blocking_io at {time.strftime('%X')}") # Note that time.sleep() can be replaced with any blocking # IO-bound operation, such as file operations. time.sleep(1) print(f"blocking_io complete at {time.strftime('%X')}") async def main(): print(f"started main at {time.strftime('%X')}") await asyncio.gather( asyncio.to_thread(blocking_io), asyncio.sleep(1)) print(f"finished main at {time.strftime('%X')}") asyncio.run(main()) # Expected output: # # started main at 19:50:53 # start blocking_io at 19:50:53 # blocking_io complete at 19:50:54 # finished main at 19:50:54
sv: def blocking_io(): print(f"starta blockering_io vid {time.strftime('%X')}") # Observera att time.sleep() kan ersättas med vilken blockerande # IO-bunden operation, t.ex. filoperationer. time.sleep(1) print(f"blockering_io slutförd vid {time.strftime('%X')}") async def main(): print(f"startade main vid {time.strftime('%X')}") await asyncio.gather( asyncio.to_thread(blocking_io), asyncio.sleep(1)) print(f"avslutade huvudtråden vid {time.strftime('%X')}") asyncio.run(main()) # Förväntad utgång: # # startade main kl 19:50:53 # start blocking_io at 19:50:53 # blocking_io complete at 19:50:54 # finished main at 19:50:54

source: Directly calling ``blocking_io()`` in any coroutine would block the event loop for its duration, resulting in an additional 1 second of run time. Instead, by using ``asyncio.to_thread()``, we can run it in a separate thread without blocking the event loop.
sv: Att direkt anropa ``blocking_io()`` i en coroutine skulle blockera händelseslingan under hela dess varaktighet, vilket resulterar i ytterligare 1 sekunds körtid. Genom att istället använda ``asyncio.to_thread()`` kan vi köra den i en separat tråd utan att blockera händelseslingan.

source: Due to the :term:`GIL`, ``asyncio.to_thread()`` can typically only be used to make IO-bound functions non-blocking. However, for extension modules that release the GIL or alternative Python implementations that don't have one, ``asyncio.to_thread()`` can also be used for CPU-bound functions.
sv: På grund av :term:`GIL` kan ``asyncio.to_thread()`` vanligtvis bara användas för att göra IO-bundna funktioner icke-blockerande. Men för tilläggsmoduler som släpper GIL eller alternativa Python-implementationer som inte har någon, kan ``asyncio.to_thread()`` även användas för CPU-bundna funktioner.

source: Scheduling From Other Threads
sv: Schemaläggning från andra trådar

source: Submit a coroutine to the given event loop. Thread-safe.
sv: Skicka en coroutine till den angivna händelseslingan. Tråd-säker.

source: Return a :class:`concurrent.futures.Future` to wait for the result from another OS thread.
sv: Returnera en :class:`concurrent.futures.Future` för att vänta på resultatet från en annan OS-tråd.

source: This function is meant to be called from a different OS thread than the one where the event loop is running. Example::
sv: Denna funktion är avsedd att anropas från en annan OS-tråd än den där händelseslingan körs. Exempel::

source: def in_thread(loop: asyncio.AbstractEventLoop) -> None: # Run some blocking IO pathlib.Path("example.txt").write_text("hello world", encoding="utf8") # Create a coroutine coro = asyncio.sleep(1, result=3) # Submit the coroutine to a given loop future = asyncio.run_coroutine_threadsafe(coro, loop) # Wait for the result with an optional timeout argument assert future.result(timeout=2) == 3 async def amain() -> None: # Get the running loop loop = asyncio.get_running_loop() # Run something in a thread await asyncio.to_thread(in_thread, loop)
sv: def in_thread(loop: asyncio.AbstractEventLoop) -> None: # Kör lite blockerande IO pathlib.Path("exempel.txt").write_text("hallå världen", encoding="utf8") # Skapa en coroutine coro = asyncio.sleep(1, resultat=3) # Skicka coroutinen till en given loop future = asyncio.run_coroutine_threadsafe(coro, loop) # Vänta på resultatet med ett valfritt timeout-argument assert future.result(timeout=2) == 3 async def amain() -> Ingen: # Hämta den pågående slingan loop = asyncio.get_running_loop() # Kör något i en tråd await asyncio.to_thread(in_thread, loop)

source: It's also possible to run the other way around. Example::
sv: Det är också möjligt att köra tvärtom. Exempel::

source: @contextlib.contextmanager def loop_in_thread() -> Generator[asyncio.AbstractEventLoop]: loop_fut = concurrent.futures.Future[asyncio.AbstractEventLoop]() stop_event = asyncio.Event() async def main() -> None: loop_fut.set_result(asyncio.get_running_loop()) await stop_event.wait() with concurrent.futures.ThreadPoolExecutor(1) as tpe: complete_fut = tpe.submit(asyncio.run, main()) for fut in concurrent.futures.as_completed((loop_fut, complete_fut)): if fut is loop_fut: loop = loop_fut.result() try: yield loop finally: loop.call_soon_threadsafe(stop_event.set) else: fut.result() # Create a loop in another thread with loop_in_thread() as loop: # Create a coroutine coro = asyncio.sleep(1, result=3) # Submit the coroutine to a given loop future = asyncio.run_coroutine_threadsafe(coro, loop) # Wait for the result with an optional timeout argument assert future.result(timeout=2) == 3
sv: @kontextlib.kontexthanterare def loop_in_thread() -> Generator[asyncio.AbstractEventLoop]: loop_fut = concurrent.futures.Future[asyncio.AbstractEventLoop]() stop_event = asyncio.Event() async def main() -> None: loop_fut.set_result(asyncio.get_running_loop()) await stop_event.wait() med concurrent.futures.ThreadPoolExecutor(1) som tpe: complete_fut = tpe.submit(asyncio.run, main()) for fut in concurrent.futures.as_completed((loop_fut, complete_fut)): if fut is loop_fut: loop = loop_fut.result() försök: ge loop till sist: loop.call_soon_threadsafe(stop_event.set) else: fut.result() # Skapa en slinga i en annan tråd med loop_in_thread() som loop: # Skapa en coroutine coro = asyncio.sleep(1, resultat=3) # Skicka coroutinen till en given slinga future = asyncio.run_coroutine_threadsafe(coro, loop) # Vänta på resultatet med ett valfritt timeout-argument assert future.result(timeout=2) == 3

source: If an exception is raised in the coroutine, the returned Future will be notified. It can also be used to cancel the task in the event loop::
sv: Om ett undantag inträffar i coroutinen kommer den returnerade Future att meddelas. Den kan också användas för att avbryta uppgiften i händelseslingan::

source: try: result = future.result(timeout) except TimeoutError: print('The coroutine took too long, cancelling the task...') future.cancel() except Exception as exc: print(f'The coroutine raised an exception: {exc!r}') else: print(f'The coroutine returned: {result!r}')
sv: försök: resultat = future.result(timeout) except TimeoutError: print('Coroutinen tog för lång tid och avbröt uppgiften...') future.cancel() except Exception as exc: print(f'Coroutinen tog upp ett undantag: {exc!r}') else: print(f'Coroutinen returnerade: {result!r}')

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
sv: Se :ref:``concurrency and multithreading <asyncio-multithreading>` i dokumentationen.

source: Unlike other asyncio functions this function requires the *loop* argument to be passed explicitly.
sv: Till skillnad från andra asynciofunktioner kräver den här funktionen att argumentet *loop* skickas explicit.

source: Introspection
sv: Introspektion

source: Return the currently running :class:`Task` instance, or ``None`` if no task is running.
sv: Returnerar den instans av :class:`Task` som körs för tillfället, eller ``None`` om ingen uppgift körs.

source: If *loop* is ``None`` :func:`get_running_loop` is used to get the current loop.
sv: Om *loop* är ``None`` används :func:`get_running_loop` för att hämta den aktuella loopen.

source: Return a set of not yet finished :class:`Task` objects run by the loop.
sv: Returnerar en uppsättning ännu inte avslutade :class:`Task`-objekt som körs av slingan.

source: If *loop* is ``None``, :func:`get_running_loop` is used for getting current loop.
sv: Om *loop* är ``None``, används :func:`get_running_loop` för att hämta aktuell loop.

source: Return ``True`` if *obj* is a coroutine object.
sv: Returnerar ``True`` om *obj* är ett coroutine-objekt.

source: Task Object
sv: Uppgiftsobjekt

source: A :class:`Future-like <Future>` object that runs a Python :ref:`coroutine <coroutine>`. Not thread-safe.
sv: Ett :class:`Future-liknande <Future>`-objekt som kör en Python :ref:`coroutine <coroutine>`. Inte tråd-säkert.

source: Tasks are used to run coroutines in event loops. If a coroutine awaits on a Future, the Task suspends the execution of the coroutine and waits for the completion of the Future. When the Future is *done*, the execution of the wrapped coroutine resumes.
sv: Tasks används för att köra coroutines i händelseslingor. Om en coroutine väntar på en Future, avbryter Task exekveringen av coroutinen och väntar på att Future ska slutföras. När framtiden är *färdig* återupptas exekveringen av den omslutna coroutinen.

source: Event loops use cooperative scheduling: an event loop runs one Task at a time. While a Task awaits for the completion of a Future, the event loop runs other Tasks, callbacks, or performs IO operations.
sv: Eventloops använder kooperativ schemaläggning: en eventloop kör en Task åt gången. Medan en Task väntar på att en Future ska slutföras, kör eventloopen andra Tasks, callbacks eller utför IO-operationer.

source: Use the high-level :func:`asyncio.create_task` function to create Tasks, or the low-level :meth:`loop.create_task` or :func:`ensure_future` functions. Manual instantiation of Tasks is discouraged.
sv: Använd högnivåfunktionen :func:`asyncio.create_task` för att skapa Tasks, eller lågnivåfunktionerna :meth:`loop.create_task` eller :func:`ensure_future`. Manuell instansiering av Tasks avråds.

source: To cancel a running Task use the :meth:`cancel` method. Calling it will cause the Task to throw a :exc:`CancelledError` exception into the wrapped coroutine. If a coroutine is awaiting on a Future object during cancellation, the Future object will be cancelled.
sv: För att avbryta en pågående Task används metoden :meth:`cancel`. Om du anropar den kommer uppgiften att kasta ett :exc:`CancelledError` undantag i den omslutna coroutinen. Om en coroutine väntar på ett Future-objekt under avbrytandet, kommer Future-objektet att avbrytas.

source: :meth:`cancelled` can be used to check if the Task was cancelled. The method returns ``True`` if the wrapped coroutine did not suppress the :exc:`CancelledError` exception and was actually cancelled.
sv: :meth:`cancelled` kan användas för att kontrollera om uppgiften avbröts. Metoden returnerar ``True`` om den inlindade coroutinen inte undertryckte :exc:`CancelledError` undantaget och faktiskt avbröts.

source: :class:`asyncio.Task` inherits from :class:`Future` all of its APIs except :meth:`Future.set_result` and :meth:`Future.set_exception`.
sv: :class:`asyncio.Task` ärver från :class:`Future` alla dess API:er utom :meth:`Future.set_result` och :meth:`Future.set_exception`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. If no *context* is provided, the Task copies the current context and later runs its coroutine in the copied context.
sv: Ett valfritt argument *context* med endast nyckelord gör det möjligt att ange en anpassad :class:`contextvars.Context` som *coro* ska köras i. Om ingen *kontext* anges kopierar uppgiften den aktuella kontexten och kör senare sin coroutine i den kopierade kontexten.

source: An optional keyword-only *eager_start* argument allows eagerly starting the execution of the :class:`asyncio.Task` at task creation time. If set to ``True`` and the event loop is running, the task will start executing the coroutine immediately, until the first time the coroutine blocks. If the coroutine returns or raises without blocking, the task will be finished eagerly and will skip scheduling to the event loop.
sv: Ett valfritt argument *eager_start* som endast innehåller nyckelord gör det möjligt att ivrigt starta exekveringen av :class:`asyncio.Task` när uppgiften skapas. Om värdet är satt till ``True`` och händelseslingan körs, kommer uppgiften att börja exekvera coroutinen omedelbart, tills första gången coroutinen blockerar. Om coroutinen returnerar eller höjs utan att blockera, kommer uppgiften att slutföras ivrigt och hoppa över schemaläggningen till händelseslingan.

source: Added support for the :mod:`contextvars` module.
sv: Lagt till stöd för modulen :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
sv: Deprecation-varning utfärdas om *loop* inte anges och det inte finns någon pågående händelseslinga.

source: Added the *eager_start* parameter.
sv: Parametern *eager_start* har lagts till.

source: Return ``True`` if the Task is *done*.
sv: Returnerar ``True`` om uppgiften är *done*.

source: A Task is *done* when the wrapped coroutine either returned a value, raised an exception, or the Task was cancelled.
sv: En Task är *färdig* när den omslutna coroutinen antingen returnerade ett värde, utlöste ett undantag eller när Task avbröts.

source: Return the result of the Task.
sv: Returnera resultatet av uppgiften.

source: If the Task is *done*, the result of the wrapped coroutine is returned (or if the coroutine raised an exception, that exception is re-raised.)
sv: Om uppgiften är *utförd* returneras resultatet av den omslutna coroutinen (eller om coroutinen gav upphov till ett undantag, ges det undantaget upp igen)

source: If the Task has been *cancelled*, this method raises a :exc:`CancelledError` exception.
sv: Om uppgiften har *avbrutits* ger den här metoden upphov till ett :exc:`CancelledError`-undantag.

source: If the Task's result isn't yet available, this method raises an :exc:`InvalidStateError` exception.
sv: Om uppgiftens resultat ännu inte är tillgängligt ger denna metod upphov till ett :exc:`InvalidStateError`-undantag.

source: Return the exception of the Task.
sv: Returnera undantaget för uppgiften.

source: If the wrapped coroutine raised an exception that exception is returned. If the wrapped coroutine returned normally this method returns ``None``.
sv: Om den inkapslade coroutinen gav upphov till ett undantag returneras undantaget. Om den inkapslade coroutinen returnerades normalt returnerar denna metod ``None``.

source: If the Task isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
sv: Om uppgiften inte är *färdig* ännu, ger denna metod upphov till ett :exc:`InvalidStateError`-undantag.

source: Add a callback to be run when the Task is *done*.
sv: Lägg till en återuppringning som ska köras när uppgiften är *klar*.

source: This method should only be used in low-level callback-based code.
sv: Denna metod bör endast användas i kod som bygger på återuppringning på låg nivå.

source: See the documentation of :meth:`Future.add_done_callback` for more details.
sv: Se dokumentationen av :meth:`Future.add_done_callback` för mer information.

source: Remove *callback* from the callbacks list.
sv: Ta bort *callback* från listan över callbacks.

source: See the documentation of :meth:`Future.remove_done_callback` for more details.
sv: Se dokumentationen av :meth:`Future.remove_done_callback` för mer information.

source: Return the list of stack frames for this Task.
sv: Returnera listan med stapelramar för denna Task.

source: If the wrapped coroutine is not done, this returns the stack where it is suspended. If the coroutine has completed successfully or was cancelled, this returns an empty list. If the coroutine was terminated by an exception, this returns the list of traceback frames.
sv: Om den inkapslade coroutinen inte är klar returneras den stack där den är avbruten. Om coroutinen har slutförts framgångsrikt eller avbrutits, returneras en tom lista. Om coroutinen avslutades av ett undantag returneras listan med spårningsramar.

source: The frames are always ordered from oldest to newest.
sv: Ramarna är alltid sorterade från äldst till nyast.

source: Only one stack frame is returned for a suspended coroutine.
sv: Endast en stackram returneras för en avbruten coroutine.

source: The optional *limit* argument sets the maximum number of frames to return; by default all available frames are returned. The ordering of the returned list differs depending on whether a stack or a traceback is returned: the newest frames of a stack are returned, but the oldest frames of a traceback are returned. (This matches the behavior of the traceback module.)
sv: Det valfria argumentet *limit* anger det maximala antalet ramar som ska returneras; som standard returneras alla tillgängliga ramar. Ordningen på listan som returneras skiljer sig åt beroende på om en stack eller en traceback returneras: de nyaste ramarna i en stack returneras, men de äldsta ramarna i en traceback returneras. (Detta motsvarar beteendet hos traceback-modulen)

source: Print the stack or traceback for this Task.
sv: Skriv ut stacken eller traceback för den här uppgiften.

source: This produces output similar to that of the traceback module for the frames retrieved by :meth:`get_stack`.
sv: Detta ger liknande utdata som traceback-modulen för de ramar som hämtas av :meth:`get_stack`.

source: The *limit* argument is passed to :meth:`get_stack` directly.
sv: Argumentet *limit* skickas direkt till :meth:`get_stack`.

source: The *file* argument is an I/O stream to which the output is written; by default output is written to :data:`sys.stdout`.
sv: Argumentet *file* är en I/O-ström som utdata skrivs till; som standard skrivs utdata till :data:`sys.stdout`.

source: Return the coroutine object wrapped by the :class:`Task`.
sv: Returnerar coroutine-objektet som omsluts av :class:`Task`.

source: This will return ``None`` for Tasks which have already completed eagerly. See the :ref:`Eager Task Factory <eager-task-factory>`.
sv: Detta kommer att returnera ``None`` för uppgifter som redan har slutförts ivrigt. Se :ref:`Eager Task Factory <eager-task-factory>`.

source: Newly added eager task execution means result may be ``None``.
sv: Nyligen tillagd ivrig uppgiftsutförande innebär att resultatet kan vara ``None``.

source: Return the :class:`contextvars.Context` object associated with the task.
sv: Returnerar :class:`contextvars.Context`-objektet som är associerat med uppgiften.

source: Return the name of the Task.
sv: Returnera namnet på uppgiften.

source: If no name has been explicitly assigned to the Task, the default asyncio Task implementation generates a default name during instantiation.
sv: Om inget namn uttryckligen har tilldelats uppgiften genererar standardimplementeringen av asyncio-uppgiften ett standardnamn under instantiering.

source: Set the name of the Task.
sv: Ange namnet på uppgiften.

source: The *value* argument can be any object, which is then converted to a string.
sv: Argumentet *value* kan vara vilket objekt som helst, som sedan konverteras till en sträng.
