Repository: yeager/python-docs-sv
Catalog: library/asyncio-dev.po
Languages: sv

source: Developing with asyncio
sv: Utveckla med asyncio

source: Asynchronous programming is different from classic "sequential" programming.
sv: Asynkron programmering skiljer sig från klassisk "sekventiell" programmering.

source: This page lists common mistakes and traps and explains how to avoid them.
sv: På den här sidan listas vanliga misstag och fällor och det förklaras hur man undviker dem.

source: Debug Mode
sv: Felsökningsläge

source: By default asyncio runs in production mode. In order to ease the development asyncio has a *debug mode*.
sv: Som standard körs asyncio i produktionsläge. För att underlätta utvecklingen har asyncio ett *debuggläge*.

source: There are several ways to enable asyncio debug mode:
sv: Det finns flera sätt att aktivera felsökningsläget för asyncio:

source: Setting the :envvar:`PYTHONASYNCIODEBUG` environment variable to ``1``.
sv: Miljövariabeln :envvar:`PYTHONASYNCIODEBUG` sätts till ``1``.

source: Using the :ref:`Python Development Mode <devmode>`.
sv: Använda :ref:`Python Development Mode <devmode>`.

source: Passing ``debug=True`` to :func:`asyncio.run`.
sv: Överlämnar ``debug=True`` till :func:`asyncio.run`.

source: Calling :meth:`loop.set_debug`.
sv: Anropar :meth:`loop.set_debug`.

source: In addition to enabling the debug mode, consider also:
sv: Förutom att aktivera felsökningsläget bör du också överväga:

source: setting the log level of the :ref:`asyncio logger <asyncio-logger>` to :py:const:`logging.DEBUG`, for example the following snippet of code can be run at startup of the application::
sv: ställa in loggnivån för :ref:`asyncio logger <asyncio-logger>` till :py:const:`logging.DEBUG`, till exempel kan följande kodavsnitt köras vid start av applikationen::

source: configuring the :mod:`warnings` module to display :exc:`ResourceWarning` warnings. One way of doing that is by using the :option:`-W` ``default`` command line option.
sv: konfigurera modulen :mod:`warnings` så att den visar :exc:`ResourceWarning`-varningar. Ett sätt att göra det är att använda kommandoradsalternativet :option:`-W` ``default``.

source: When the debug mode is enabled:
sv: När felsökningsläget är aktiverat:

source: Many non-threadsafe asyncio APIs (such as :meth:`loop.call_soon` and :meth:`loop.call_at` methods) raise an exception if they are called from a wrong thread.
sv: Många asyncio API:er som inte är trådlösa (t.ex. metoderna :meth:`loop.call_soon` och :meth:`loop.call_at`) ger upphov till ett undantag om de anropas från fel tråd.

source: The execution time of the I/O selector is logged if it takes too long to perform an I/O operation.
sv: I/O-väljarens exekveringstid loggas om det tar för lång tid att utföra en I/O-operation.

source: Callbacks taking longer than 100 milliseconds are logged. The :attr:`loop.slow_callback_duration` attribute can be used to set the minimum execution duration in seconds that is considered "slow".
sv: Återkallelser som tar längre tid än 100 millisekunder loggas. Attributet :attr:`loop.slow_callback_duration` kan användas för att ange den minsta exekveringstid i sekunder som anses vara "långsam".

source: Concurrency and Multithreading
sv: Samtidighet och multithreading

source: An event loop runs in a thread (typically the main thread) and executes all callbacks and Tasks in its thread. While a Task is running in the event loop, no other Tasks can run in the same thread. When a Task executes an ``await`` expression, the running Task gets suspended, and the event loop executes the next Task.
sv: En händelseslinga körs i en tråd (vanligtvis huvudtråden) och utför alla callbacks och Tasks i sin tråd. Medan en uppgift körs i händelseslingan kan inga andra uppgifter köras i samma tråd. När en uppgift utför ett ``await``-uttryck avbryts den pågående uppgiften och händelseslingan utför nästa uppgift.

source: To schedule a :term:`callback` from another OS thread, the :meth:`loop.call_soon_threadsafe` method should be used. Example::
sv: För att schemalägga en :term:`callback` från en annan OS-tråd bör metoden :meth:`loop.call_soon_threadsafe` användas. Exempel::

source: Almost all asyncio objects are not thread safe, which is typically not a problem unless there is code that works with them from outside of a Task or a callback. If there's a need for such code to call a low-level asyncio API, the :meth:`loop.call_soon_threadsafe` method should be used, e.g.::
sv: Nästan alla asyncio-objekt är inte trådsäkra, vilket vanligtvis inte är ett problem om det inte finns kod som arbetar med dem utanför en Task eller en callback. Om det finns ett behov för sådan kod att anropa ett asyncio API på låg nivå, bör metoden :meth:`loop.call_soon_threadsafe` användas, t.ex.::

source: To schedule a coroutine object from a different OS thread, the :func:`run_coroutine_threadsafe` function should be used. It returns a :class:`concurrent.futures.Future` to access the result::
sv: För att schemalägga ett coroutine-objekt från en annan OS-tråd bör funktionen :func:`run_coroutine_threadsafe` användas. Den returnerar en :class:`concurrent.futures.Future` för att komma åt resultatet::

source: To handle signals the event loop must be run in the main thread.
sv: För att hantera signaler måste händelseslingan köras i huvudtråden.

source: The :meth:`loop.run_in_executor` method can be used with a :class:`concurrent.futures.ThreadPoolExecutor` or :class:`~concurrent.futures.InterpreterPoolExecutor` to execute blocking code in a different OS thread without blocking the OS thread that the event loop runs in.
sv: Metoden :meth:`loop.run_in_executor` kan användas med en :class:`concurrent.futures.ThreadPoolExecutor` eller :class:`~concurrent.futures.InterpreterPoolExecutor` för att köra blockerande kod i en annan OS-tråd utan att blockera den OS-tråd som händelseslingan körs i.

source: There is currently no way to schedule coroutines or callbacks directly from a different process (such as one started with :mod:`multiprocessing`). The :ref:`asyncio-event-loop-methods` section lists APIs that can read from pipes and watch file descriptors without blocking the event loop. In addition, asyncio's :ref:`Subprocess <asyncio-subprocess>` APIs provide a way to start a process and communicate with it from the event loop. Lastly, the aforementioned :meth:`loop.run_in_executor` method can also be used with a :class:`concurrent.futures.ProcessPoolExecutor` to execute code in a different process.
sv: Det finns för närvarande inget sätt att schemalägga coroutines eller callbacks direkt från en annan process (t.ex. en process som startats med :mod:`multiprocessing`). Avsnittet :ref:`asyncio-event-loop-methods` listar API:er som kan läsa från rör och titta på filbeskrivare utan att blockera händelseslingan. Dessutom ger asyncios API:er :ref:`Subprocess <asyncio-subprocess>` ett sätt att starta en process och kommunicera med den från händelseslingan. Slutligen kan den tidigare nämnda :meth:`loop.run_in_executor`-metoden också användas med en :class:`concurrent.futures.ProcessPoolExecutor` för att exekvera kod i en annan process.

source: Running Blocking Code
sv: Körning av blockerande kod

source: Blocking (CPU-bound) code should not be called directly. For example, if a function performs a CPU-intensive calculation for 1 second, all concurrent asyncio Tasks and IO operations would be delayed by 1 second.
sv: Blockerande (CPU-bunden) kod bör inte anropas direkt. Om en funktion t.ex. utför en CPU-intensiv beräkning under 1 sekund, kommer alla samtidiga asyncio Tasks och IO-operationer att försenas med 1 sekund.

source: An executor can be used to run a task in a different thread, including in a different interpreter, or even in a different process to avoid blocking the OS thread with the event loop. See the :meth:`loop.run_in_executor` method for more details.
sv: En executor kan användas för att köra en uppgift i en annan tråd, inklusive i en annan tolk, eller till och med i en annan process för att undvika att blockera OS-tråden med händelseslingan. Se metoden :meth:`loop.run_in_executor` för mer information.

source: Logging
sv: Loggning

source: asyncio uses the :mod:`logging` module and all logging is performed via the ``"asyncio"`` logger.
sv: asyncio använder modulen :mod:`logging` och all loggning sker via loggern ``"asyncio"``.

source: The default log level is :py:const:`logging.INFO`, which can be easily adjusted::
sv: Standardloggnivån är :py:const:`logging.INFO`, som enkelt kan justeras::

source: Network logging can block the event loop. It is recommended to use a separate thread for handling logs or use non-blocking IO. For example, see :ref:`blocking-handlers`.
sv: Nätverksloggning kan blockera händelseslingan. Vi rekommenderar att du använder en separat tråd för att hantera loggar eller använder icke-blockerande IO. Se till exempel :ref:`blocking-handlers`.

source: Detect never-awaited coroutines
sv: Upptäck aldrig efterlängtade coroutines

source: When a coroutine function is called, but not awaited (e.g. ``coro()`` instead of ``await coro()``) or the coroutine is not scheduled with :meth:`asyncio.create_task`, asyncio will emit a :exc:`RuntimeWarning`::
sv: När en coroutine-funktion anropas, men inte väntar (t.ex. ``coro()`` istället för ``await coro()``) eller coroutinen inte schemaläggs med :meth:`asyncio.create_task`, kommer asyncio att avge en :exc:`RuntimeWarning`::

source: Output::
sv: Utgång::

source: Output in debug mode::
sv: Utdata i felsökningsläge::

source: test.py:7: RuntimeWarning: coroutine 'test' was never awaited Coroutine created at (most recent call last) File "../t.py", line 9, in <module> asyncio.run(main(), debug=True) < .. > File "../t.py", line 7, in main test() test()
sv: test.py:7: RuntimeWarning: Coroutine 'test' var aldrig väntad Coroutine skapad vid (senaste anropet senast) Fil "../t.py", rad 9, i <module> asyncio.run(main(), debug=True) < .. > Fil "../t.py", rad 7, i main test() test()

source: The usual fix is to either await the coroutine or call the :meth:`asyncio.create_task` function::
sv: Den vanliga lösningen är att antingen vänta på coroutinen eller anropa funktionen :meth:`asyncio.create_task`::

source: Detect never-retrieved exceptions
sv: Upptäck undantag som aldrig hämtats

source: If a :meth:`Future.set_exception` is called but the Future object is never awaited on, the exception would never be propagated to the user code. In this case, asyncio would emit a log message when the Future object is garbage collected.
sv: Om en :meth:`Future.set_exception` anropas men Future-objektet aldrig blir väntat på, kommer undantaget aldrig att spridas till användarkoden. I detta fall skulle asyncio skicka ut ett loggmeddelande när Future-objektet samlas in.

source: Example of an unhandled exception::
sv: Exempel på ett ohanterat undantag::

source: Task exception was never retrieved future: <Task finished coro=<bug() done, defined at test.py:3> exception=Exception('not consumed')> Traceback (most recent call last): File "test.py", line 4, in bug raise Exception("not consumed") Exception: not consumed
sv: Uppgiftsundantaget hämtades aldrig i framtiden: <Uppgift slutförd coro=<bug() utförd, definierad vid test.py:3> exception=Undantag('inte förbrukad')> Traceback (senaste anropet senast): Fil "test.py", rad 4, i bug raise Undantag("inte förbrukad") Undantag: inte förbrukad

source: :ref:`Enable the debug mode <asyncio-debug-mode>` to get the traceback where the task was created::
sv: :ref:`Aktivera felsökningsläget <asyncio-debug-mode>` för att få en spårning av var uppgiften skapades::
