Repository: yeager/python-docs-sv
Catalog: library/asyncio-eventloop.po
Languages: sv

source: The callback will be invoked by *loop*, along with other queued callbacks and runnable coroutines of that event loop. Unlike signal handlers registered using :func:`signal.signal`, a callback registered with this function is allowed to interact with the event loop.
sv: Återanropet kommer att anropas av *loop*, tillsammans med andra köade återanrop och körbara coroutines i den händelseslingan. Till skillnad från signalhanterare som registreras med :func:`signal.signal`, får en återuppringning som registreras med den här funktionen interagera med händelseslingan.

source: Raise :exc:`ValueError` if the signal number is invalid or uncatchable. Raise :exc:`RuntimeError` if there is a problem setting up the handler.
sv: Ge upphov till :exc:`ValueError` om signalnumret är ogiltigt eller inte kan fångas upp. Raise :exc:`RuntimeError` om det finns ett problem med att konfigurera hanteraren.

source: Like :func:`signal.signal`, this function must be invoked in the main thread.
sv: Precis som :func:`signal.signal` måste den här funktionen anropas i huvudtråden.

source: Remove the handler for the *sig* signal.
sv: Ta bort hanteraren för signalen *sig*.

source: Return ``True`` if the signal handler was removed, or ``False`` if no handler was set for the given signal.
sv: Returnerar ``True`` om signalhanteraren togs bort, eller ``False`` om ingen hanterare ställdes in för den givna signalen.

source: The :mod:`signal` module.
sv: Modulen :mod:`signal`.

source: Executing code in thread or process pools
sv: Exekvering av kod i tråd- eller processpooler

source: Arrange for *func* to be called in the specified executor.
sv: Ordna så att *func* anropas i den angivna exekveraren.

source: The *executor* argument should be an :class:`concurrent.futures.Executor` instance. The default executor is used if *executor* is ``None``. The default executor can be set by :meth:`loop.set_default_executor`, otherwise, a :class:`concurrent.futures.ThreadPoolExecutor` will be lazy-initialized and used by :func:`run_in_executor` if needed.
sv: Argumentet *executor* bör vara en instans av :class:`concurrent.futures.Executor`. Standardutföraren används om *executor* är ``None``. Standardutföraren kan ställas in med :meth:`loop.set_default_executor`, annars kommer en :class:`concurrent.futures.ThreadPoolExecutor` att initieras latent och användas av :func:`run_in_executor` vid behov.

source: import asyncio import concurrent.futures def blocking_io(): # File operations (such as logging) can block the # event loop: run them in a thread pool. with open('/dev/urandom', 'rb') as f: return f.read(100) def cpu_bound(): # CPU-bound operations will block the event loop: # in general it is preferable to run them in a # process pool. return sum(i * i for i in range(10 ** 7)) async def main(): loop = asyncio.get_running_loop() ## Options: # 1. Run in the default loop's executor: result = await loop.run_in_executor( None, blocking_io) print('default thread pool', result) # 2. Run in a custom thread pool: with concurrent.futures.ThreadPoolExecutor() as pool: result = await loop.run_in_executor( pool, blocking_io) print('custom thread pool', result) # 3. Run in a custom process pool: with concurrent.futures.ProcessPoolExecutor() as pool: result = await loop.run_in_executor( pool, cpu_bound) print('custom process pool', result) # 4. Run in a custom interpreter pool: with concurrent.futures.InterpreterPoolExecutor() as pool: result = await loop.run_in_executor( pool, cpu_bound) print('custom interpreter pool', result) if __name__ == '__main__': asyncio.run(main())
sv: import asyncio import concurrent.futures def blocking_io(): # Filoperationer (t.ex. loggning) kan blockera # händelseslingan: kör dem i en trådpool. med open('/dev/urandom', 'rb') som f: return f.read(100) def cpu_bound(): # CPU-bundna operationer kommer att blockera händelseslingan: # i allmänhet är det att föredra att köra dem i en # processpool. return sum(i * i för i i intervallet(10 ** 7)) async def main(): loop = asyncio.get_running_loop() ## Alternativ: # 1. Kör i standardslingans exekverare: result = await loop.run_in_executor( Ingen, blockering_io) print('standard trådpool', resultat) # 2. Kör i en anpassad trådpool: med concurrent.futures.ThreadPoolExecutor() som pool: result = await loop.run_in_executor( pool, blockering_io) print('anpassad trådpool', resultat) # 3. Kör i en anpassad processpool: med concurrent.futures.ProcessPoolExecutor() som pool: result = await loop.run_in_executor( pool, cpu_bound) print('anpassad processpool', resultat) # 4. Kör i en anpassad tolkpool: med concurrent.futures.InterpreterPoolExecutor() som pool: result = await loop.run_in_executor( pool, cpu_bound) print('anpassad tolkpool', resultat) if __name__ == '__main__': asyncio.run(main())

source: Note that the entry point guard (``if __name__ == '__main__'``) is required for option 3 due to the peculiarities of :mod:`multiprocessing`, which is used by :class:`~concurrent.futures.ProcessPoolExecutor`. See :ref:`Safe importing of main module <multiprocessing-safe-main-import>`.
sv: Observera att startpunktsskyddet (``if __name__ == '__main__'``) krävs för alternativ 3 på grund av de speciella egenskaperna hos :mod:`multiprocessing`, som används av :class:`~concurrent.futures.ProcessPoolExecutor`. Se :ref:``Säker import av huvudmodulen <multiprocessing-safe-main-import>`.

source: This method returns a :class:`asyncio.Future` object.
sv: Denna metod returnerar ett :class:`asyncio.Future`-objekt.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *func*.
sv: Använd :func:`functools.partial` :ref:`för att skicka nyckelordsargument <asyncio-pass-keywords>` till *func*.

source: :meth:`loop.run_in_executor` no longer configures the ``max_workers`` of the thread pool executor it creates, instead leaving it up to the thread pool executor (:class:`~concurrent.futures.ThreadPoolExecutor`) to set the default.
sv: :meth:`loop.run_in_executor` konfigurerar inte längre ``max_workers`` för den trådpoolsexekutor som den skapar, utan överlåter det till trådpoolsexekutorn (:class:`~concurrent.futures.ThreadPoolExecutor`) att ange standardvärdet.

source: Set *executor* as the default executor used by :meth:`run_in_executor`. *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`, which includes :class:`~concurrent.futures.InterpreterPoolExecutor`.
sv: Ställ in *executor* som den standardexecutor som används av :meth:`run_in_executor`. *executor* måste vara en instans av :class:`~concurrent.futures.ThreadPoolExecutor`, vilket inkluderar :class:`~concurrent.futures.InterpreterPoolExecutor`.

source: *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
sv: *executor* måste vara en instans av :class:`~concurrent.futures.ThreadPoolExecutor`.

source: Error Handling API
sv: API för felhantering

source: Allows customizing how exceptions are handled in the event loop.
sv: Gör det möjligt att anpassa hur undantag hanteras i händelseslingan.

source: Set *handler* as the new event loop exception handler.
sv: Ange *handler* som den nya undantagshanteraren för händelseslingan.

source: If *handler* is ``None``, the default exception handler will be set. Otherwise, *handler* must be a callable with the signature matching ``(loop, context)``, where ``loop`` is a reference to the active event loop, and ``context`` is a ``dict`` object containing the details of the exception (see :meth:`call_exception_handler` documentation for details about context).
sv: Om *handler* är ``None`` kommer standardhanteraren för undantag att användas. Annars måste *handler* vara en callable med en signatur som matchar ``(loop, context)``, där ``loop`` är en referens till den aktiva händelseslingan och ``context`` är ett ``dict``-objekt som innehåller detaljer om undantaget (se :meth:`call_exception_handler`-dokumentationen för detaljer om context).

source: If the handler is called on behalf of a :class:`~asyncio.Task` or :class:`~asyncio.Handle`, it is run in the :class:`contextvars.Context` of that task or callback handle.
sv: Om hanteraren anropas på uppdrag av en :class:`~asyncio.Task` eller :class:`~asyncio.Handle`, körs den i :class:`contextvars.Context` för den uppgiften eller callback-handtaget.

source: The handler may be called in the :class:`~contextvars.Context` of the task or handle where the exception originated.
sv: Hanteraren kan anropas i :class:`~contextvars.Context` för den uppgift eller det handtag där undantaget uppstod.

source: Return the current exception handler, or ``None`` if no custom exception handler was set.
sv: Returnerar den aktuella undantagshanteraren, eller ``None`` om ingen egen undantagshanterare har angetts.

source: Default exception handler.
sv: Standardhantering av undantag.

source: This is called when an exception occurs and no exception handler is set. This can be called by a custom exception handler that wants to defer to the default handler behavior.
sv: Detta anropas när ett undantag inträffar och ingen undantagshanterare är inställd. Detta kan anropas av en anpassad undantagshanterare som vill använda standardhanterarens beteende.

source: *context* parameter has the same meaning as in :meth:`call_exception_handler`.
sv: *context*-parametern har samma betydelse som i :meth:`call_exception_handler`.

source: Call the current event loop exception handler.
sv: Anropa den aktuella undantagshanteraren för händelseslingan.

source: *context* is a ``dict`` object containing the following keys (new keys may be introduced in future Python versions):
sv: *context* är ett ``dict``-objekt som innehåller följande nycklar (nya nycklar kan komma att införas i framtida Python-versioner):

source: 'message': Error message;
sv: "meddelande": Felmeddelande;

source: 'exception' (optional): Exception object;
sv: "undantag" (valfritt): Objekt för undantag;

source: 'future' (optional): :class:`asyncio.Future` instance;
sv: "future" (valfritt): :class:`asyncio.Future` instans;

source: 'task' (optional): :class:`asyncio.Task` instance;
sv: 'task' (valfritt): :class:`asyncio.Task` instans;

source: 'handle' (optional): :class:`asyncio.Handle` instance;
sv: 'handle' (valfritt): :class:`asyncio.Handle` instans;

source: 'protocol' (optional): :ref:`Protocol <asyncio-protocol>` instance;
sv: "protocol" (valfritt): :ref:`Protocol <asyncio-protocol>` instance;

source: 'transport' (optional): :ref:`Transport <asyncio-transport>` instance;
sv: "transport" (valfritt): :ref:`Transport <asyncio-transport>` instance;

source: 'socket' (optional): :class:`socket.socket` instance;
sv: 'socket' (valfritt): :class:`socket.socket` instans;

source: 'source_traceback' (optional): Traceback of the source;
sv: "source_traceback" (valfritt): Traceback för källan;

source: 'handle_traceback' (optional): Traceback of the handle;
sv: "handle_traceback" (valfritt): Traceback för handtaget;

source: 'asyncgen' (optional): Asynchronous generator that caused
sv: "asyncgen" (valfritt): Asynkron generator som orsakade

source: the exception.
sv: undantaget.

source: This method should not be overloaded in subclassed event loops. For custom exception handling, use the :meth:`set_exception_handler` method.
sv: Denna metod bör inte överbelastas i underklassade händelseslingor. För anpassad undantagshantering, använd metoden :meth:`set_exception_handler`.

source: Enabling debug mode
sv: Aktivering av felsökningsläge

source: Get the debug mode (:class:`bool`) of the event loop.
sv: Hämta felsökningsläget (:class:`bool`) för händelseslingan.

source: The default value is ``True`` if the environment variable :envvar:`PYTHONASYNCIODEBUG` is set to a non-empty string, ``False`` otherwise.
sv: Standardvärdet är ``True`` om miljövariabeln :envvar:`PYTHONASYNCIODEBUG` är inställd på en icke-tom sträng, annars ``False``.

source: Set the debug mode of the event loop.
sv: Ställ in felsökningsläget för händelseslingan.

source: The new :ref:`Python Development Mode <devmode>` can now also be used to enable the debug mode.
sv: Den nya :ref:`Python Development Mode <devmode>` kan nu också användas för att aktivera felsökningsläget.

source: This attribute can be used to set the minimum execution duration in seconds that is considered "slow". When debug mode is enabled, "slow" callbacks are logged.
sv: Detta attribut kan användas för att ange den minsta exekveringstid i sekunder som anses vara "långsam". När felsökningsläget är aktiverat loggas "långsamma" callbacks.

source: Default value is 100 milliseconds.
sv: Standardvärdet är 100 millisekunder.

source: The :ref:`debug mode of asyncio <asyncio-debug-mode>`.
sv: :ref:`debuggläge för asyncio <asyncio-debug-mode>`.

source: Running Subprocesses
sv: Körning av underprocesser

source: Methods described in this subsections are low-level. In regular async/await code consider using the high-level :func:`asyncio.create_subprocess_shell` and :func:`asyncio.create_subprocess_exec` convenience functions instead.
sv: Metoder som beskrivs i detta underavsnitt är på låg nivå. I vanlig async/await-kod bör du överväga att använda bekvämlighetsfunktionerna på hög nivå :func:`asyncio.create_subprocess_shell` och :func:`asyncio.create_subprocess_exec` istället.

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
sv: I Windows har standardhändelseslingan :class:`ProactorEventLoop` stöd för underprocesser, medan :class:`SelectorEventLoop` inte har det. Se :ref:``Subprocessstöd på Windows <asyncio-windows-subprocess>` för mer information.

source: Create a subprocess from one or more string arguments specified by *args*.
sv: Skapa en subprocess från ett eller flera strängargument som anges av *args*.

source: *args* must be a list of strings represented by:
sv: *args* måste vara en lista med strängar som representeras av:

source: or :class:`bytes`, encoded to the :ref:`filesystem encoding <filesystem-encoding>`.
sv: eller :class:`bytes`, kodad enligt :ref:`filsystemskodning <filesystem-encoding>`.

source: The first string specifies the program executable, and the remaining strings specify the arguments. Together, string arguments form the ``argv`` of the program.
sv: Den första strängen anger det körbara programmet och de återstående strängarna anger argumenten. Tillsammans bildar strängargumenten programmets ``argv``.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=False`` and the list of strings passed as the first argument; however, where :class:`~subprocess.Popen` takes a single argument which is list of strings, *subprocess_exec* takes multiple string arguments.
sv: Detta liknar standardbibliotekets klass :class:`subprocess.Popen` som anropas med ``shell=False`` och en lista med strängar som första argument; men där :class:`~subprocess.Popen` tar ett enda argument som är en lista med strängar, tar *subprocess_exec* flera strängargument.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`asyncio.SubprocessProtocol` class.
sv: *protocol_factory* måste vara en callable som returnerar en subklass av klassen :class:`asyncio.SubprocessProtocol`.

source: Other parameters:
sv: Övriga parametrar:

source: *stdin* can be any of these:
sv: *stdin* kan vara vilket som helst av dessa:

source: a file-like object
sv: ett filliknande objekt

source: an existing file descriptor (a positive integer), for example those created with :meth:`os.pipe`
sv: en befintlig filbeskrivare (ett positivt heltal), t.ex. de som skapats med :meth:`os.pipe`

source: the :const:`subprocess.PIPE` constant (default) which will create a new pipe and connect it,
sv: konstanten :const:`subprocess.PIPE` (standard) som skapar ett nytt rör och ansluter det,

source: the value ``None`` which will make the subprocess inherit the file descriptor from this process
sv: värdet ``None`` som gör att subprocessen ärver filbeskrivaren från den här processen

source: the :const:`subprocess.DEVNULL` constant which indicates that the special :data:`os.devnull` file will be used
sv: konstanten :const:`subprocess.DEVNULL` som anger att den speciella filen :data:`os.devnull` ska användas

source: *stdout* can be any of these:
sv: *stdout* kan vara vilken som helst av dessa:

source: *stderr* can be any of these:
sv: *stderr* kan vara vilken som helst av dessa:

source: the :const:`subprocess.STDOUT` constant which will connect the standard error stream to the process' standard output stream
sv: konstanten :const:`subprocess.STDOUT` som kopplar standardfelströmmen till processens standardutgångsström

source: All other keyword arguments are passed to :class:`subprocess.Popen` without interpretation, except for *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* and *errors*, which should not be specified at all.
sv: Alla andra nyckelordsargument skickas till :class:`subprocess.Popen` utan tolkning, med undantag för *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* och *errors*, som inte bör anges alls.

source: The ``asyncio`` subprocess API does not support decoding the streams as text. :func:`bytes.decode` can be used to convert the bytes returned from the stream to text.
sv: API:et för underprocesser i ``asyncio`` stöder inte avkodning av strömmar som text. :func:`bytes.decode` kan användas för att konvertera byte som returneras från strömmen till text.

source: If a file-like object passed as *stdin*, *stdout* or *stderr* represents a pipe, then the other side of this pipe should be registered with :meth:`~loop.connect_write_pipe` or :meth:`~loop.connect_read_pipe` for use with the event loop.
sv: Om ett filliknande objekt som skickas som *stdin*, *stdout* eller *stderr* representerar en pipe, ska den andra sidan av denna pipe registreras med :meth:`~loop.connect_write_pipe` eller :meth:`~loop.connect_read_pipe` för användning med händelseslingan.

source: See the constructor of the :class:`subprocess.Popen` class for documentation on other arguments.
sv: Se konstruktören för klassen :class:`subprocess.Popen` för dokumentation om andra argument.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`asyncio.SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
sv: Returnerar ett par ``(transport, protocol)``, där *transport* överensstämmer med basklassen :class:`asyncio.SubprocessTransport` och *protocol* är ett objekt som instantierats av *protocol_factory*.

source: Create a subprocess from *cmd*, which can be a :class:`str` or a :class:`bytes` string encoded to the :ref:`filesystem encoding <filesystem-encoding>`, using the platform's "shell" syntax.
sv: Skapa en underprocess från *cmd*, som kan vara en :class:`str` eller en :class:`bytes`-sträng kodad enligt :ref:`filsystemets kodning <filesystem-encoding>`, med hjälp av plattformens "shell"-syntax.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=True``.
sv: Detta liknar standardbibliotekets :class:`subprocess.Popen`-klass som anropas med ``shell=True``.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`SubprocessProtocol` class.
sv: *protocol_factory* måste vara en callable som returnerar en subklass av klassen :class:`SubprocessProtocol`.

source: See :meth:`~loop.subprocess_exec` for more details about the remaining arguments.
sv: Se :meth:`~loop.subprocess_exec` för mer information om de återstående argumenten.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
sv: Returnerar ett par ``(transport, protocol)``, där *transport* överensstämmer med basklassen :class:`SubprocessTransport` och *protocol* är ett objekt som instantierats av *protocol_factory*.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special characters in strings that are going to be used to construct shell commands.
sv: Det är applikationens ansvar att se till att alla blanksteg och specialtecken citeras på rätt sätt för att undvika `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ sårbarheter. Funktionen :func:`shlex.quote` kan användas för att på rätt sätt undkomma blanksteg och specialtecken i strängar som ska användas för att konstruera skalkommandon.

source: Callback Handles
sv: Handtag för återuppringning

source: A callback wrapper object returned by :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.
sv: Ett omslagsobjekt för återuppringning som returneras av :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.

source: Return the :class:`contextvars.Context` object associated with the handle.
sv: Returnerar :class:`contextvars.Context`-objektet som är associerat med handtaget.

source: Cancel the callback. If the callback has already been canceled or executed, this method has no effect.
sv: Avbryt återuppringningen. Om återkallelsen redan har avbrutits eller utförts har denna metod ingen effekt.

source: Return ``True`` if the callback was cancelled.
sv: Returnerar ``True`` om återuppringningen avbröts.

source: A callback wrapper object returned by :meth:`loop.call_later`, and :meth:`loop.call_at`.
sv: Ett omslagsobjekt för återuppringning som returneras av :meth:`loop.call_later` och :meth:`loop.call_at`.

source: This class is a subclass of :class:`Handle`.
sv: Denna klass är en underklass till :class:`Handle`.

source: Return a scheduled callback time as :class:`float` seconds.
sv: Returnerar en schemalagd callback-tid som :class:`float` sekunder.

source: The time is an absolute timestamp, using the same time reference as :meth:`loop.time`.
sv: Tiden är en absolut tidsstämpel som använder samma tidsreferens som :meth:`loop.time`.

source: Server Objects
sv: Serverobjekt

source: Server objects are created by :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, and :func:`start_unix_server` functions.
sv: Serverobjekt skapas av funktionerna :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server` och :func:`start_unix_server`.

source: Do not instantiate the :class:`Server` class directly.
sv: Instansiera inte :class:`Server`-klassen direkt.

source: *Server* objects are asynchronous context managers. When used in an ``async with`` statement, it's guaranteed that the Server object is closed and not accepting new connections when the ``async with`` statement is completed::
sv: *Server*-objekt är asynkrona kontexthanterare. När det används i en ``async with``-sats är det garanterat att Server-objektet är stängt och inte accepterar nya anslutningar när ``async with``-satsen är klar::

source: srv = await loop.create_server(...) async with srv: # some code # At this point, srv is closed and no longer accepts new connections.
sv: srv = await loop.skapa_server(...) asynkron med srv: # lite kod # Vid denna tidpunkt är srv stängd och accepterar inte längre nya anslutningar.

source: Server object is an asynchronous context manager since Python 3.7.
sv: Server-objektet är en asynkron kontexthanterare sedan Python 3.7.

source: This class was exposed publicly as ``asyncio.Server`` in Python 3.9.11, 3.10.3 and 3.11.
sv: Denna klass exponerades offentligt som ``asyncio.Server`` i Python 3.9.11, 3.10.3 och 3.11.
