Repository: yeager/python-docs-sv
Catalog: library/asyncio-task.po
Languages: sv

source: In the default Task implementation, the name will be visible in the :func:`repr` output of a task object.
sv: I standardimplementeringen av Task kommer namnet att synas i :func:`repr`-utmatningen från ett Task-objekt.

source: Request the Task to be cancelled.
sv: Begär att uppgiften ska avbrytas.

source: If the Task is already *done* or *cancelled*, return ``False``, otherwise, return ``True``.
sv: Om uppgiften redan är *utförd* eller *annullerad*, returneras ``False``, annars returneras ``True``.

source: The method arranges for a :exc:`CancelledError` exception to be thrown into the wrapped coroutine on the next cycle of the event loop.
sv: Metoden ser till att ett :exc:`CancelledError`-undantag kastas in i den omslutna coroutinen vid nästa cykel i händelseslingan.

source: The coroutine then has a chance to clean up or even deny the request by suppressing the exception with a :keyword:`try` ... ... ``except CancelledError`` ... :keyword:`finally` block. Therefore, unlike :meth:`Future.cancel`, :meth:`Task.cancel` does not guarantee that the Task will be cancelled, although suppressing cancellation completely is not common and is actively discouraged. Should the coroutine nevertheless decide to suppress the cancellation, it needs to call :meth:`Task.uncancel` in addition to catching the exception.
sv: Coroutinen har sedan en chans att städa upp eller till och med neka begäran genom att undertrycka undantaget med ett :keyword:`try` ... ... ... ``except CancelledError`` ... :keyword:`finally` block. Till skillnad från :meth:`Future.cancel` garanterar därför :meth:`Task.cancel` inte att uppgiften kommer att avbrytas, även om det inte är vanligt att helt undertrycka avbrytande och aktivt avråds från detta. Om coroutinen ändå bestämmer sig för att undertrycka annulleringen måste den anropa :meth:`Task.uncancel` utöver att fånga upp undantaget.

source: Added the *msg* parameter.
sv: Parametern *msg* har lagts till.

source: The ``msg`` parameter is propagated from cancelled task to its awaiter.
sv: Parametern ``msg`` sprids från den avbrutna uppgiften till den som väntar på den.

source: The following example illustrates how coroutines can intercept the cancellation request::
sv: Följande exempel illustrerar hur coroutines kan fånga upp begäran om annullering::

source: async def cancel_me(): print('cancel_me(): before sleep') try: # Wait for 1 hour await asyncio.sleep(3600) except asyncio.CancelledError: print('cancel_me(): cancel sleep') raise finally: print('cancel_me(): after sleep') async def main(): # Create a "cancel_me" Task task = asyncio.create_task(cancel_me()) # Wait for 1 second await asyncio.sleep(1) task.cancel() try: await task except asyncio.CancelledError: print("main(): cancel_me is cancelled now") asyncio.run(main()) # Expected output: # # cancel_me(): before sleep # cancel_me(): cancel sleep # cancel_me(): after sleep # main(): cancel_me is cancelled now
sv: async def cancel_me(): print('cancel_me(): före sömn') försök: # Vänta i 1 timme await asyncio.sleep(3600) except asyncio.CancelledError: print('cancel_me(): avbryt sömn') höja slutligen: print('cancel_me(): efter sömn') async def main(): # Skapa en "cancel_me"-uppgift uppgift = asyncio.create_task(cancel_me()) # Vänta i 1 sekund await asyncio.sleep(1) uppgift.avbryt() försök: await uppgift except asyncio.CancelledError: print("main(): cancel_me är avbruten nu") asyncio.run(main()) # Förväntad utgång: # # cancel_me(): före sömn # cancel_me(): avbryta sömn # cancel_me(): efter sömn # main(): cancel_me är avbruten nu

source: Return ``True`` if the Task is *cancelled*.
sv: Returnerar ``True`` om uppgiften är *annullerad*.

source: The Task is *cancelled* when the cancellation was requested with :meth:`cancel` and the wrapped coroutine propagated the :exc:`CancelledError` exception thrown into it.
sv: Uppgiften är *avbruten* när avbrytandet begärdes med :meth:`cancel` och den omslutna coroutinen spred undantaget :exc:`CancelledError` som kastades in i den.

source: Decrement the count of cancellation requests to this Task.
sv: Minska antalet avbokningsbegäranden för den här uppgiften.

source: Returns the remaining number of cancellation requests.
sv: Returnerar det återstående antalet avbokningsbegäranden.

source: Note that once execution of a cancelled task completed, further calls to :meth:`uncancel` are ineffective.
sv: Observera att när en avbruten uppgift har utförts är ytterligare anrop till :meth:`uncancel` ineffektiva.

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. In particular, if a Task gets successfully uncancelled, this allows for elements of structured concurrency like :ref:`taskgroups` and :func:`asyncio.timeout` to continue running, isolating cancellation to the respective structured block. For example::
sv: Den här metoden används av asyncios interna funktioner och förväntas inte användas av slutanvändarkod. I synnerhet, om en uppgift framgångsrikt avbokas, gör detta att element av strukturerad samtidighet som :ref:`taskgroups` och :func:`asyncio.timeout` kan fortsätta att köras, vilket isolerar avbokningen till respektive strukturerat block. Till exempel::

source: async def make_request_with_timeout(): try: async with asyncio.timeout(1): # Structured block affected by the timeout: await make_request() await make_another_request() except TimeoutError: log("There was a timeout") # Outer code not affected by the timeout: await unrelated_code()
sv: async def make_request_with_timeout(): try: async med asyncio.timeout(1): # Strukturerat block som påverkas av timeouten: await make_request() await make_another_request() except TimeoutError: log("Det uppstod en timeout") # Yttre kod som inte påverkas av timeouten: await orelaterad_kod()

source: While the block with ``make_request()`` and ``make_another_request()`` might get cancelled due to the timeout, ``unrelated_code()`` should continue running even in case of the timeout. This is implemented with :meth:`uncancel`. :class:`TaskGroup` context managers use :func:`uncancel` in a similar fashion.
sv: Medan blocken med ``make_request()`` och ``make_another_request()`` kan avbrytas på grund av timeout, bör ``unrelated_code()`` fortsätta att köras även om timeout inträffar. Detta implementeras med :meth:`uncancel`. :class:`TaskGroup` kontexthanterare använder :func:`uncancel` på ett liknande sätt.

source: If end-user code is, for some reason, suppressing cancellation by catching :exc:`CancelledError`, it needs to call this method to remove the cancellation state.
sv: Om slutanvändarkoden av någon anledning undertrycker annullering genom att fånga :exc:`CancelledError`, måste den anropa denna metod för att ta bort annulleringstillståndet.

source: When this method decrements the cancellation count to zero, the method checks if a previous :meth:`cancel` call had arranged for :exc:`CancelledError` to be thrown into the task. If it hasn't been thrown yet, that arrangement will be rescinded (by resetting the internal ``_must_cancel`` flag).
sv: När den här metoden minskar antalet avbokningar till noll, kontrollerar metoden om ett tidigare :meth:`cancel`-anrop hade ordnat så att :exc:`CancelledError` kunde kastas in i uppgiften. Om det inte har gjorts ännu, kommer det arrangemanget att återkallas (genom att återställa den interna ``_must_cancel`` flaggan).

source: Changed to rescind pending cancellation requests upon reaching zero.
sv: Ändrad för att återkalla pågående annulleringsförfrågningar när de når noll.

source: Return the number of pending cancellation requests to this Task, i.e., the number of calls to :meth:`cancel` less the number of :meth:`uncancel` calls.
sv: Returnerar antalet väntande avbokningsbegäranden till denna uppgift, dvs. antalet anrop till :meth:`cancel` minus antalet anrop till :meth:`uncancel`.

source: Note that if this number is greater than zero but the Task is still executing, :meth:`cancelled` will still return ``False``. This is because this number can be lowered by calling :meth:`uncancel`, which can lead to the task not being cancelled after all if the cancellation requests go down to zero.
sv: Observera att om detta antal är större än noll men uppgiften fortfarande körs, kommer :meth:`cancelled` fortfarande att returnera ``False``. Detta beror på att detta antal kan sänkas genom att anropa :meth:`uncancel`, vilket kan leda till att uppgiften inte avbryts trots allt om begäran om avbrytande går ner till noll.

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. See :meth:`uncancel` for more details.
sv: Den här metoden används av asyncios interna funktioner och förväntas inte användas av slutanvändarkod. Se :meth:`uncancel` för mer information.
