Repository: yeager/python-docs-sv
Catalog: library/asyncio-eventloop.po
Languages: sv

source: Event Loop
sv: Händelseslinga

source: **Source code:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`
sv: **Källkod:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`

source: Preface
sv: Förord

source: The event loop is the core of every asyncio application. Event loops run asynchronous tasks and callbacks, perform network IO operations, and run subprocesses.
sv: Händelseslingan är kärnan i varje asyncio-applikation. Händelseslingor kör asynkrona uppgifter och återuppringningar, utför IO-operationer i nätverket och kör underprocesser.

source: Application developers should typically use the high-level asyncio functions, such as :func:`asyncio.run`, and should rarely need to reference the loop object or call its methods. This section is intended mostly for authors of lower-level code, libraries, and frameworks, who need finer control over the event loop behavior.
sv: Programutvecklare bör vanligtvis använda asynciofunktionerna på hög nivå, till exempel :func:`asyncio.run`, och bör sällan behöva referera till loopobjektet eller anropa dess metoder. Det här avsnittet är främst avsett för författare av kod på lägre nivå, bibliotek och ramverk som behöver finare kontroll över händelseslingans beteende.

source: Obtaining the Event Loop
sv: Få fram händelseslingan

source: The following low-level functions can be used to get, set, or create an event loop:
sv: Följande lågnivåfunktioner kan användas för att hämta, ställa in eller skapa en händelseslinga:

source: Return the running event loop in the current OS thread.
sv: Returnerar den pågående händelseslingan i den aktuella OS-tråden.

source: Raise a :exc:`RuntimeError` if there is no running event loop.
sv: Skapa ett :exc:`RuntimeError` om det inte finns någon pågående händelseslinga.

source: This function can only be called from a coroutine or a callback.
sv: Denna funktion kan endast anropas från en coroutine eller en callback.

source: Get the current event loop.
sv: Hämta den aktuella händelseslingan.

source: When called from a coroutine or a callback (e.g. scheduled with call_soon or similar API), this function will always return the running event loop.
sv: När den här funktionen anropas från en coroutine eller en callback (t.ex. schemalagd med call_soon eller liknande API) returnerar den alltid den pågående händelseslingan.

source: If there is no running event loop set, the function will return the result of the ``get_event_loop_policy().get_event_loop()`` call.
sv: Om det inte finns någon pågående händelseslinga inställd, returnerar funktionen resultatet av anropet ``get_event_loop_policy().get_event_loop()``.

source: Because this function has rather complex behavior (especially when custom event loop policies are in use), using the :func:`get_running_loop` function is preferred to :func:`get_event_loop` in coroutines and callbacks.
sv: Eftersom den här funktionen har ett ganska komplext beteende (särskilt när anpassade policys för händelseslingor används) är det bättre att använda funktionen :func:`get_running_loop` än :func:`get_event_loop` i coroutines och callbacks.

source: As noted above, consider using the higher-level :func:`asyncio.run` function, instead of using these lower level functions to manually create and close an event loop.
sv: Som nämnts ovan bör du överväga att använda funktionen :func:`asyncio.run` på högre nivå istället för att använda dessa funktioner på lägre nivå för att manuellt skapa och stänga en händelseslinga.

source: Raises a :exc:`RuntimeError` if there is no current event loop.
sv: Utlöser ett :exc:`RuntimeError` om det inte finns någon aktuell händelseslinga.

source: The :mod:`!asyncio` policy system is deprecated and will be removed in Python 3.16; from there on, this function will return the current running event loop if present else it will return the loop set by :func:`set_event_loop`.
sv: Policysystemet :mod:`!asyncio` är föråldrat och kommer att tas bort i Python 3.16; från och med då kommer denna funktion att returnera den aktuella pågående händelseslingan om den finns annars kommer den att returnera den slinga som ställts in av :func:`set_event_loop`.

source: Set *loop* as the current event loop for the current OS thread.
sv: Ange *loop* som aktuell händelseslinga för den aktuella OS-tråden.

source: Create and return a new event loop object.
sv: Skapa och returnera ett nytt objekt för händelseslingan.

source: Note that the behaviour of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop` functions can be altered by :ref:`setting a custom event loop policy <asyncio-policies>`.
sv: Observera att beteendet hos funktionerna :func:`get_event_loop`, :func:`set_event_loop` och :func:`new_event_loop` kan ändras genom :ref:`setting a custom event loop policy <asyncio-policies>`.

source: Contents
sv: Innehåll

source: This documentation page contains the following sections:
sv: Denna dokumentationssida innehåller följande avsnitt:

source: The `Event Loop Methods`_ section is the reference documentation of the event loop APIs;
sv: Avsnittet `Event Loop Methods`_ är referensdokumentationen för API:erna för händelseslingan;

source: The `Callback Handles`_ section documents the :class:`Handle` and :class:`TimerHandle` instances which are returned from scheduling methods such as :meth:`loop.call_soon` and :meth:`loop.call_later`;
sv: Avsnittet `Callback Handles`_ dokumenterar instanserna :class:`Handle` och :class:`TimerHandle` som returneras från schemaläggningsmetoder som :meth:`loop.call_soon` och :meth:`loop.call_later`;

source: The `Server Objects`_ section documents types returned from event loop methods like :meth:`loop.create_server`;
sv: Avsnittet `Server Objects`_ dokumenterar typer som returneras från metoder för händelseslingor som :meth:`loop.create_server`;

source: The `Event Loop Implementations`_ section documents the :class:`SelectorEventLoop` and :class:`ProactorEventLoop` classes;
sv: Avsnittet `Event Loop Implementations`_ dokumenterar klasserna :class:`SelectorEventLoop` och :class:`ProactorEventLoop`;

source: The `Examples`_ section showcases how to work with some event loop APIs.
sv: Avsnittet "Exempel" visar hur man arbetar med vissa API:er för händelseslingor.

source: Event Loop Methods
sv: Metoder för händelseslingor

source: Event loops have **low-level** APIs for the following:
sv: Händelseslingor har **lågnivå** API:er för följande:

source: Running and stopping the loop
sv: Starta och stoppa slingan

source: Run until the *future* (an instance of :class:`Future`) has completed.
sv: Kör tills *future* (en instans av :class:`Future`) har slutförts.

source: If the argument is a :ref:`coroutine object <coroutine>` it is implicitly scheduled to run as a :class:`asyncio.Task`.
sv: Om argumentet är ett :ref:`coroutine-objekt <coroutine>` schemaläggs det implicit för att köras som en :class:`asyncio.Task`.

source: Return the Future's result or raise its exception.
sv: Returnera Framtidens resultat eller ta upp dess undantag.

source: Run the event loop until :meth:`stop` is called.
sv: Kör händelseslingan tills :meth:`stop` anropas.

source: If :meth:`stop` is called before :meth:`run_forever` is called, the loop will poll the I/O selector once with a timeout of zero, run all callbacks scheduled in response to I/O events (and those that were already scheduled), and then exit.
sv: Om :meth:`stop` anropas innan :meth:`run_forever` anropas, kommer loopen att fråga I/O-väljaren en gång med en timeout på noll, köra alla callbacks som är schemalagda som svar på I/O-händelser (och de som redan var schemalagda) och sedan avsluta.

source: If :meth:`stop` is called while :meth:`run_forever` is running, the loop will run the current batch of callbacks and then exit. Note that new callbacks scheduled by callbacks will not run in this case; instead, they will run the next time :meth:`run_forever` or :meth:`run_until_complete` is called.
sv: Om :meth:`stop` anropas medan :meth:`run_forever` körs, kommer loopen att köra den aktuella batchen av callbacks och sedan avslutas. Observera att nya återuppringningar som schemalagts av återuppringningar inte kommer att köras i det här fallet; istället kommer de att köras nästa gång :meth:`run_forever` eller :meth:`run_until_complete` anropas.

source: Stop the event loop.
sv: Stoppa händelseslingan.

source: Return ``True`` if the event loop is currently running.
sv: Returnerar ``True`` om händelseslingan körs för närvarande.

source: Return ``True`` if the event loop was closed.
sv: Returnerar ``True`` om händelseslingan stängdes.

source: Close the event loop.
sv: Stäng händelseslingan.

source: The loop must not be running when this function is called. Any pending callbacks will be discarded.
sv: Slingan får inte vara igång när denna funktion anropas. Alla väntande återuppringningar kommer att kasseras.

source: This method clears all queues and shuts down the executor, but does not wait for the executor to finish.
sv: Den här metoden rensar alla köer och stänger av exekveraren, men väntar inte på att exekveraren ska bli klar.

source: This method is idempotent and irreversible. No other methods should be called after the event loop is closed.
sv: Denna metod är idempotent och irreversibel. Inga andra metoder bör anropas efter att händelseslingan har stängts.

source: Schedule all currently open :term:`asynchronous generator` objects to close with an :meth:`~agen.aclose` call. After calling this method, the event loop will issue a warning if a new asynchronous generator is iterated. This should be used to reliably finalize all scheduled asynchronous generators.
sv: Schemalägger alla öppna :term:`asynkrona generator`-objekt att stängas med ett :meth:`~agen.aclose`-anrop. Efter anrop av denna metod kommer händelseslingan att utfärda en varning om en ny asynkron generator itereras. Detta bör användas för att på ett tillförlitligt sätt avsluta alla schemalagda asynkrona generatorer.

source: Note that there is no need to call this function when :func:`asyncio.run` is used.
sv: Observera att det inte finns något behov av att anropa denna funktion när :func:`asyncio.run` används.

source: Example::
sv: Exempel::

source: try: loop.run_forever() finally: loop.run_until_complete(loop.shutdown_asyncgens()) loop.close()
sv: försök: loop.run_forever() finally: kör loop.run_until_complete(loop.shutdown_asyncgens()) loop.close()

source: Schedule the closure of the default executor and wait for it to join all of the threads in the :class:`~concurrent.futures.ThreadPoolExecutor`. Once this method has been called, using the default executor with :meth:`loop.run_in_executor` will raise a :exc:`RuntimeError`.
sv: Schemalägg stängningen av standardutföraren och vänta på att den ska ansluta sig till alla trådar i :class:`~concurrent.futures.ThreadPoolExecutor`. När denna metod har anropats, kommer användning av standardutföraren med :meth:`loop.run_in_executor` att ge upphov till ett :exc:`RuntimeError`.

source: The *timeout* parameter specifies the amount of time (in :class:`float` seconds) the executor will be given to finish joining. With the default, ``None``, the executor is allowed an unlimited amount of time.
sv: Parametern *timeout* anger hur lång tid (i :class:`float`-sekunder) som köraren får på sig att avsluta anslutningen. Med standardvärdet ``None`` får exekutören obegränsad tid på sig.

source: If the *timeout* is reached, a :exc:`RuntimeWarning` is emitted and the default executor is terminated without waiting for its threads to finish joining.
sv: Om *timeout* uppnås skickas en :exc:`RuntimeWarning` ut och standardkörningen avslutas utan att vänta på att dess trådar ska ansluta sig.

source: Do not call this method when using :func:`asyncio.run`, as the latter handles default executor shutdown automatically.
sv: Anropa inte den här metoden när du använder :func:`asyncio.run`, eftersom den senare hanterar standardavstängning av exekveraren automatiskt.

source: Added the *timeout* parameter.
sv: Parametern *timeout* har lagts till.

source: Scheduling callbacks
sv: Schemaläggning av återuppringningar

source: Schedule the *callback* :term:`callback` to be called with *args* arguments at the next iteration of the event loop.
sv: Schemalägg *callback* :term:`callback` så att den anropas med *args*-argument vid nästa iteration av händelseslingan.

source: Return an instance of :class:`asyncio.Handle`, which can be used later to cancel the callback.
sv: Returnerar en instans av :class:`asyncio.Handle`, som kan användas senare för att avbryta återuppringningen.

source: Callbacks are called in the order in which they are registered. Each callback will be called exactly once.
sv: Callbacks anropas i den ordning som de registrerades. Varje callback kommer att anropas exakt en gång.

source: The optional keyword-only *context* argument specifies a custom :class:`contextvars.Context` for the *callback* to run in. Callbacks use the current context when no *context* is provided.
sv: Det valfria argumentet *context*, som endast innehåller nyckelord, anger en anpassad :class:`contextvars.Context` som *callback* ska köras i. Återkallelser använder den aktuella kontexten när ingen *kontext* anges.

source: Unlike :meth:`call_soon_threadsafe`, this method is not thread-safe.
sv: Till skillnad från :meth:`call_soon_threadsafe` är den här metoden inte trådsäker.

source: A thread-safe variant of :meth:`call_soon`. When scheduling callbacks from another thread, this function *must* be used, since :meth:`call_soon` is not thread-safe.
sv: En trådsäker variant av :meth:`call_soon`. Vid schemaläggning av callbacks från en annan tråd *måste* denna funktion användas, eftersom :meth:`call_soon` inte är trådsäker.

source: This function is safe to be called from a reentrant context or signal handler, however, it is not safe or fruitful to use the returned handle in such contexts.
sv: Denna funktion är säker att anropa från en reentrant kontext eller signalhanterare, men det är inte säkert eller fruktbart att använda det returnerade handtaget i sådana sammanhang.

source: Raises :exc:`RuntimeError` if called on a loop that's been closed. This can happen on a secondary thread when the main application is shutting down.
sv: Utlöser :exc:`RuntimeError` om den anropas i en loop som har stängts. Detta kan hända i en sekundär tråd när huvudapplikationen stängs ner.

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
sv: Se :ref:``concurrency and multithreading <asyncio-multithreading>` i dokumentationen.

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
sv: Parametern *context* (endast nyckelord) har lagts till. Se :pep:`567` för mer information.

source: Most :mod:`asyncio` scheduling functions don't allow passing keyword arguments. To do that, use :func:`functools.partial`::
sv: De flesta :mod:`asyncio`-schemaläggningsfunktioner tillåter inte att nyckelordsargument skickas. För att göra det, använd :func:`functools.partial`::

source: # will schedule "print("Hello", flush=True)" loop.call_soon( functools.partial(print, "Hello", flush=True))
sv: # kommer att schemalägga "print("Hello", flush=True)" loop.call_soon( functools.partial(print, "Hello", flush=True))

source: Using partial objects is usually more convenient than using lambdas, as asyncio can render partial objects better in debug and error messages.
sv: Att använda partiella objekt är vanligtvis mer praktiskt än att använda lambdas, eftersom asyncio kan göra partiella objekt bättre i felsöknings- och felmeddelanden.

source: Scheduling delayed callbacks
sv: Schemaläggning av fördröjda återuppringningar

source: Event loop provides mechanisms to schedule callback functions to be called at some point in the future. Event loop uses monotonic clocks to track time.
sv: Event loop tillhandahåller mekanismer för att schemalägga callback-funktioner som ska anropas vid någon tidpunkt i framtiden. Händelseslingan använder monotona klockor för att hålla reda på tiden.

source: Schedule *callback* to be called after the given *delay* number of seconds (can be either an int or a float).
sv: Schemalägg *callback* som ska anropas efter det angivna *delay*-antalet sekunder (kan vara antingen ett int eller ett float).

source: An instance of :class:`asyncio.TimerHandle` is returned which can be used to cancel the callback.
sv: En instans av :class:`asyncio.TimerHandle` returneras som kan användas för att avbryta återuppringningen.

source: *callback* will be called exactly once. If two callbacks are scheduled for exactly the same time, the order in which they are called is undefined.
sv: *callback* kommer att anropas exakt en gång. Om två callbacks är schemalagda för exakt samma tid, är ordningen i vilken de anropas odefinierad.

source: The optional positional *args* will be passed to the callback when it is called. If you want the callback to be called with keyword arguments use :func:`functools.partial`.
sv: De valfria positionella *args* kommer att skickas till callbacken när den anropas. Om du vill att återuppringningen ska anropas med nyckelordsargument använder du :func:`functools.partial`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
sv: Ett valfritt argument *context* med endast nyckelord gör det möjligt att ange en anpassad :class:`contextvars.Context` som *callback* ska köras i. Den aktuella kontexten används när ingen *kontext* anges.

source: In Python 3.7 and earlier with the default event loop implementation, the *delay* could not exceed one day. This has been fixed in Python 3.8.
sv: I Python 3.7 och tidigare med standardimplementeringen av händelseslingan kunde *fördröjningen* inte överstiga en dag. Detta har åtgärdats i Python 3.8.

source: Schedule *callback* to be called at the given absolute timestamp *when* (an int or a float), using the same time reference as :meth:`loop.time`.
sv: Schemalägg *callback* så att den anropas vid den angivna absoluta tidsstämpeln *when* (en int eller en float), med samma tidsreferens som :meth:`loop.time`.

source: This method's behavior is the same as :meth:`call_later`.
sv: Den här metodens beteende är detsamma som :meth:`call_later`.

source: In Python 3.7 and earlier with the default event loop implementation, the difference between *when* and the current time could not exceed one day. This has been fixed in Python 3.8.
sv: I Python 3.7 och tidigare med standardimplementeringen av händelseslingan kunde skillnaden mellan *when* och aktuell tid inte överstiga en dag. Detta har åtgärdats i Python 3.8.

source: Return the current time, as a :class:`float` value, according to the event loop's internal monotonic clock.
sv: Returnerar aktuell tid, som ett :class:`float`-värde, enligt händelseslingans interna monotona klocka.

source: In Python 3.7 and earlier timeouts (relative *delay* or absolute *when*) should not exceed one day. This has been fixed in Python 3.8.
sv: I Python 3.7 och tidigare skulle timeouts (relativ *delay* eller absolut *when*) inte överstiga en dag. Detta har åtgärdats i Python 3.8.

source: The :func:`asyncio.sleep` function.
sv: Funktionen :func:`asyncio.sleep`.

source: Creating Futures and Tasks
sv: Skapa framtidsutsikter och uppgifter

source: Create an :class:`asyncio.Future` object attached to the event loop.
sv: Skapa ett :class:`asyncio.Future`-objekt som är kopplat till händelseslingan.

source: This is the preferred way to create Futures in asyncio. This lets third-party event loops provide alternative implementations of the Future object (with better performance or instrumentation).
sv: Detta är det föredragna sättet att skapa Futures i asyncio. Detta gör det möjligt för tredjeparts händelseslingor att tillhandahålla alternativa implementeringar av Future-objektet (med bättre prestanda eller instrumentering).

source: Schedule the execution of :ref:`coroutine <coroutine>` *coro*. Return a :class:`Task` object.
sv: Schemalägg utförandet av :ref:`coroutine <coroutine>` *coro*. Returnerar ett :class:`Task`-objekt.

source: Third-party event loops can use their own subclass of :class:`Task` for interoperability. In this case, the result type is a subclass of :class:`Task`.
sv: Händelseslingor från tredje part kan använda sin egen subklass av :class:`Task` för interoperabilitet. I det här fallet är resultattypen en subklass av :class:`Task`.

source: The full function signature is largely the same as that of the :class:`Task` constructor (or factory) - all of the keyword arguments to this function are passed through to that interface.
sv: Den fullständiga funktionssignaturen är i stort sett densamma som för :class:`Task`-konstruktören (eller fabriken) - alla nyckelordsargument till denna funktion skickas vidare till det gränssnittet.

source: If the *name* argument is provided and not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
sv: Om argumentet *name* anges och inte ``None``, anges det som namnet på uppgiften med hjälp av :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
sv: Ett valfritt argument *context* med endast nyckelord gör det möjligt att ange en anpassad :class:`contextvars.Context` som *coro* ska köras i. Den aktuella kontextkopian skapas när ingen *kontext* anges.

source: An optional keyword-only *eager_start* argument allows specifying if the task should execute eagerly during the call to create_task, or be scheduled later. If *eager_start* is not passed the mode set by :meth:`loop.set_task_factory` will be used.
sv: Ett valfritt argument *eager_start*, som endast innehåller nyckelord, gör det möjligt att ange om uppgiften ska utföras ivrigt under anropet till create_task eller schemaläggas senare. Om *eager_start* inte anges kommer det läge som anges av :meth:`loop.set_task_factory` att användas.

source: Added the *name* parameter.
sv: Parametern *name* har lagts till.

source: Added the *context* parameter.
sv: Parametern *context* har lagts till.

source: Added ``kwargs`` which passes on arbitrary extra parameters, including ``name`` and ``context``.
sv: Lagt till ``kwargs`` som skickar vidare godtyckliga extra parametrar, inklusive ``name`` och ``context``.

source: Rolled back the change that passes on *name* and *context* (if it is None), while still passing on other arbitrary keyword arguments (to avoid breaking backwards compatibility with 3.13.3).
sv: Återställde ändringen som skickar vidare *name* och *context* (om det är None), men som fortfarande skickar vidare andra godtyckliga nyckelordsargument (för att undvika att bryta bakåtkompatibiliteten med 3.13.3).

source: All *kwargs* are now passed on. The *eager_start* parameter works with eager task factories.
sv: Alla *kwargs* skickas nu vidare. Parametern *eager_start* fungerar med "eager task factories".

source: Set a task factory that will be used by :meth:`loop.create_task`.
sv: Ange en uppgiftsfabrik som ska användas av :meth:`loop.create_task`.
