Repository: yeager/python-docs-sv
Catalog: library/asyncio-eventloop.po
Languages: sv

source: Stop serving: close listening sockets and set the :attr:`sockets` attribute to ``None``.
sv: Stoppa servering: stäng lyssnande uttag och sätt attributet :attr:`sockets` till ``None``.

source: The sockets that represent existing incoming client connections are left open.
sv: De uttag som representerar befintliga inkommande klientanslutningar lämnas öppna.

source: The server is closed asynchronously; use the :meth:`wait_closed` coroutine to wait until the server is closed (and no more connections are active).
sv: Servern stängs asynkront; använd :meth:`wait_closed` coroutine för att vänta tills servern är stängd (och inga fler anslutningar är aktiva).

source: Close all existing incoming client connections.
sv: Stäng alla befintliga inkommande kundanslutningar.

source: Calls :meth:`~asyncio.BaseTransport.close` on all associated transports.
sv: Anropar :meth:`~asyncio.BaseTransport.close` på alla associerade transporter.

source: :meth:`close` should be called before :meth:`close_clients` when closing the server to avoid races with new clients connecting.
sv: :meth:`close` bör anropas före :meth:`close_clients` när servern stängs för att undvika tävlingar med nya klienter som ansluter.

source: Close all existing incoming client connections immediately, without waiting for pending operations to complete.
sv: Stäng alla befintliga inkommande klientanslutningar omedelbart, utan att vänta på att väntande åtgärder ska slutföras.

source: Calls :meth:`~asyncio.WriteTransport.abort` on all associated transports.
sv: Anropar :meth:`~asyncio.WriteTransport.abort` på alla associerade transporter.

source: :meth:`close` should be called before :meth:`abort_clients` when closing the server to avoid races with new clients connecting.
sv: :meth:`close` bör anropas före :meth:`abort_clients` när servern stängs för att undvika tävlingar med nya klienter som ansluter.

source: Return the event loop associated with the server object.
sv: Returnerar den händelseslinga som är kopplad till serverobjektet.

source: Start accepting connections.
sv: Börja acceptera kontakter.

source: This method is idempotent, so it can be called when the server is already serving.
sv: Denna metod är idempotent, så den kan anropas när servern redan är i drift.

source: The *start_serving* keyword-only parameter to :meth:`loop.create_server` and :meth:`asyncio.start_server` allows creating a Server object that is not accepting connections initially. In this case ``Server.start_serving()``, or :meth:`Server.serve_forever` can be used to make the Server start accepting connections.
sv: Nyckelordsparametern *start_serving* till :meth:`loop.create_server` och :meth:`asyncio.start_server` gör det möjligt att skapa ett serverobjekt som inte accepterar anslutningar initialt. I det här fallet kan ``Server.start_serving()`` eller :meth:`Server.serve_forever` användas för att få servern att börja acceptera anslutningar.

source: Start accepting connections until the coroutine is cancelled. Cancellation of ``serve_forever`` task causes the server to be closed.
sv: Börja acceptera anslutningar tills coroutinen avbryts. Om uppgiften ``serve_forever`` avbryts stängs servern.

source: This method can be called if the server is already accepting connections. Only one ``serve_forever`` task can exist per one *Server* object.
sv: Denna metod kan anropas om servern redan accepterar anslutningar. Endast en ``serve_forever`` uppgift kan finnas per ett *Server*-objekt.

source: async def client_connected(reader, writer): # Communicate with the client with # reader/writer streams. For example: await reader.readline() async def main(host, port): srv = await asyncio.start_server( client_connected, host, port) await srv.serve_forever() asyncio.run(main('127.0.0.1', 0))
sv: async def client_connected(läsare, skribent): # Kommunicera med klienten med # strömmar av läsare/skrivare. Till exempel await läsare.readline() async def main(host, port): srv = await asyncio.start_server( client_connected, host, port) await srv.serve_forever() asyncio.run(main('127.0.0.1', 0))

source: Return ``True`` if the server is accepting new connections.
sv: Returnerar ``True`` om servern accepterar nya anslutningar.

source: Wait until the :meth:`close` method completes and all active connections have finished.
sv: Vänta tills metoden :meth:`close` har slutförts och alla aktiva anslutningar har avslutats.

source: List of socket-like objects, ``asyncio.trsock.TransportSocket``, which the server is listening on.
sv: Lista över socket-liknande objekt, ``asyncio.trsock.TransportSocket``, som servern lyssnar på.

source: Prior to Python 3.7 ``Server.sockets`` used to return an internal list of server sockets directly. In 3.7 a copy of that list is returned.
sv: Före Python 3.7 brukade ``Server.sockets`` returnera en intern lista över serverns sockets direkt. I 3.7 returneras en kopia av den listan.

source: Event Loop Implementations
sv: Implementering av händelseslingor

source: asyncio ships with two different event loop implementations: :class:`SelectorEventLoop` and :class:`ProactorEventLoop`.
sv: asyncio levereras med två olika implementationer av händelseslingor: :class:`SelectorEventLoop` och :class:`ProactorEventLoop`.

source: By default asyncio is configured to use :class:`EventLoop`.
sv: Som standard är asyncio konfigurerat att använda :class:`EventLoop`.

source: A subclass of :class:`AbstractEventLoop` based on the :mod:`selectors` module.
sv: En underklass till :class:`AbstractEventLoop` baserad på modulen :mod:`selectors`.

source: Uses the most efficient *selector* available for the given platform. It is also possible to manually configure the exact selector implementation to be used::
sv: Använder den effektivaste *väljaren* som finns tillgänglig för den givna plattformen. Det är också möjligt att manuellt konfigurera den exakta implementeringen av väljaren som ska användas::

source: import asyncio import selectors async def main(): ... loop_factory = lambda: asyncio.SelectorEventLoop(selectors.SelectSelector()) asyncio.run(main(), loop_factory=loop_factory)
sv: import asyncio import väljare async def main(): ... loop_factory = lambda: asyncio.SelectorEventLoop(selectors.SelectSelector()) asyncio.run(main(), loop_factory=loop_factory)

source: A subclass of :class:`AbstractEventLoop` for Windows that uses "I/O Completion Ports" (IOCP).
sv: En underklass till :class:`AbstractEventLoop` för Windows som använder "I/O Completion Ports" (IOCP).

source: `MSDN documentation on I/O Completion Ports <https://learn.microsoft.com/windows/win32/fileio/i-o-completion-ports>`_.
sv: mSDN-dokumentation om I/O Completion Ports <https://learn.microsoft.com/windows/win32/fileio/i-o-completion-ports>`_.

source: An alias to the most efficient available subclass of :class:`AbstractEventLoop` for the given platform.
sv: Ett alias till den mest effektiva tillgängliga underklassen till :class:`AbstractEventLoop` för den givna plattformen.

source: It is an alias to :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
sv: Det är ett alias till :class:`SelectorEventLoop` på Unix och :class:`ProactorEventLoop` på Windows.

source: Abstract base class for asyncio-compliant event loops.
sv: Abstrakt basklass för asynciokompatibla händelseslingor.

source: The :ref:`asyncio-event-loop-methods` section lists all methods that an alternative implementation of ``AbstractEventLoop`` should have defined.
sv: Avsnittet :ref:`asyncio-event-loop-methods` listar alla metoder som en alternativ implementation av ``AbstractEventLoop`` borde ha definierat.

source: Examples
sv: Exempel

source: Note that all examples in this section **purposefully** show how to use the low-level event loop APIs, such as :meth:`loop.run_forever` and :meth:`loop.call_soon`. Modern asyncio applications rarely need to be written this way; consider using the high-level functions like :func:`asyncio.run`.
sv: Observera att alla exempel i detta avsnitt **avsiktligt** visar hur man använder lågnivå-API:er för händelseslingor, som :meth:`loop.run_forever` och :meth:`loop.call_soon`. Moderna asyncio-applikationer behöver sällan skrivas på det här sättet; överväg att använda högnivåfunktioner som :func:`asyncio.run`.

source: Hello World with call_soon()
sv: Hello World med call_soon()

source: An example using the :meth:`loop.call_soon` method to schedule a callback. The callback displays ``"Hello World"`` and then stops the event loop::
sv: Ett exempel där metoden :meth:`loop.call_soon` används för att schemalägga en återuppringning. Återkallelsen visar ``"Hello World"`` och stoppar sedan händelseslingan::

source: A similar :ref:`Hello World <coroutine>` example created with a coroutine and the :func:`run` function.
sv: Ett liknande :ref:`Hello World <coroutine>` exempel skapat med en coroutine och funktionen :func:`run`.

source: Display the current date with call_later()
sv: Visa aktuellt datum med call_later()

source: An example of a callback displaying the current date every second. The callback uses the :meth:`loop.call_later` method to reschedule itself after 5 seconds, and then stops the event loop::
sv: Ett exempel på en callback som visar aktuellt datum varje sekund. Återuppringningen använder metoden :meth:`loop.call_later` för att schemalägga om sig själv efter 5 sekunder, och stoppar sedan händelseslingan::

source: import asyncio import datetime def display_date(end_time, loop): print(datetime.datetime.now()) if (loop.time() + 1.0) < end_time: loop.call_later(1, display_date, end_time, loop) else: loop.stop() loop = asyncio.new_event_loop() # Schedule the first call to display_date() end_time = loop.time() + 5.0 loop.call_soon(display_date, end_time, loop) # Blocking call interrupted by loop.stop() try: loop.run_forever() finally: loop.close()
sv: import asyncio import datetime def display_date(slut_tid, loop): print(datetime.datetime.now()) if (loop.time() + 1.0) < end_time: loop.call_later(1, display_date, end_time, loop) annat: loop.stop() loop = asyncio.new_event_loop() # Schemalägg det första anropet till display_date() end_time = loop.time() + 5.0 loop.call_soon(display_date, end_time, loop) # Blockerande anrop avbrutet av loop.stop() försök: loop.run_forever() finally: loop.run_forever() loop.close()

source: A similar :ref:`current date <asyncio_example_sleep>` example created with a coroutine and the :func:`run` function.
sv: Ett liknande :ref:`aktuellt datum <asyncio_example_sleep>` exempel skapat med en coroutine och funktionen :func:`run`.

source: Watch a file descriptor for read events
sv: Bevaka en filbeskrivare för läshändelser

source: Wait until a file descriptor received some data using the :meth:`loop.add_reader` method and then close the event loop::
sv: Vänta tills en filbeskrivningsenhet har tagit emot data med hjälp av metoden :meth:`loop.add_reader` och stäng sedan händelseslingan::

source: A similar :ref:`example <asyncio_example_create_connection>` using transports, protocols, and the :meth:`loop.create_connection` method.
sv: En liknande :ref:`example <asyncio_example_create_connection>` med transporter, protokoll och metoden :meth:`loop.create_connection`.

source: Another similar :ref:`example <asyncio_example_create_connection-streams>` using the high-level :func:`asyncio.open_connection` function and streams.
sv: En annan liknande :ref:`exempel <asyncio_example_create_connection-streams>` som använder högnivåfunktionen :func:`asyncio.open_connection` och streams.

source: Set signal handlers for SIGINT and SIGTERM
sv: Ange signalhanterare för SIGINT och SIGTERM

source: (This ``signals`` example only works on Unix.)
sv: (Detta ``signals``-exempel fungerar bara på Unix.)

source: Register handlers for signals :const:`~signal.SIGINT` and :const:`~signal.SIGTERM` using the :meth:`loop.add_signal_handler` method::
sv: Registrera hanterare för signalerna :const:`~signal.SIGINT` och :const:`~signal.SIGTERM` med hjälp av metoden :meth:`loop.add_signal_handler`::
