Repository: yeager/python-docs-sv
Catalog: library/asyncio-subprocess.po
Languages: sv

source: Subprocesses
sv: Delprocesser

source: **Source code:** :source:`Lib/asyncio/subprocess.py`, :source:`Lib/asyncio/base_subprocess.py`
sv: **Källkod:** :source:`Lib/asyncio/subprocess.py`, :source:`Lib/asyncio/base_subprocess.py`

source: This section describes high-level async/await asyncio APIs to create and manage subprocesses.
sv: I detta avsnitt beskrivs async/await asyncio API:er på hög nivå för att skapa och hantera underprocesser.

source: Here's an example of how asyncio can run a shell command and obtain its result::
sv: Här är ett exempel på hur asyncio kan köra ett shell-kommando och få resultatet av det::

source: will print::
sv: kommer att skriva ut::

source: ['ls /zzz' exited with 1] [stderr] ls: /zzz: No such file or directory
sv: ['ls /zzz' avslutades med 1] [stderr] ls: /zzz: Ingen sådan fil eller katalog

source: Because all asyncio subprocess functions are asynchronous and asyncio provides many tools to work with such functions, it is easy to execute and monitor multiple subprocesses in parallel. It is indeed trivial to modify the above example to run several commands simultaneously::
sv: Eftersom alla asyncios subprocessfunktioner är asynkrona och asyncio tillhandahåller många verktyg för att arbeta med sådana funktioner, är det enkelt att köra och övervaka flera subprocesser parallellt. Det är faktiskt trivialt att modifiera ovanstående exempel för att köra flera kommandon samtidigt::

source: See also the `Examples`_ subsection.
sv: Se även underavsnittet `Exempel`_.

source: Creating Subprocesses
sv: Skapa underprocesser

source: Create a subprocess.
sv: Skapa en underprocess.

source: The *limit* argument sets the buffer limit for :class:`StreamReader` wrappers for :attr:`~asyncio.subprocess.Process.stdout` and :attr:`~asyncio.subprocess.Process.stderr` (if :const:`subprocess.PIPE` is passed to *stdout* and *stderr* arguments).
sv: Argumentet *limit* anger buffertgränsen för :class:`StreamReader` omslag för :attr:`~asyncio.subprocess.Process.stdout` och :attr:`~asyncio.subprocess.Process.stderr` (om :const:`subprocess.PIPE` skickas till argumenten *stdout* och *stderr*).

source: Return a :class:`~asyncio.subprocess.Process` instance.
sv: Returnerar en :class:`~asyncio.subprocess.Process`-instans.

source: See the documentation of :meth:`loop.subprocess_exec` for other parameters.
sv: Se dokumentationen för :meth:`loop.subprocess_exec` för andra parametrar.

source: Removed the *loop* parameter.
sv: Parametern *loop* har tagits bort.

source: Run the *cmd* shell command.
sv: Kör skalkommandot *cmd*.

source: See the documentation of :meth:`loop.subprocess_shell` for other parameters.
sv: Se dokumentationen för :meth:`loop.subprocess_shell` för andra parametrar.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special shell characters in strings that are going to be used to construct shell commands.
sv: Det är programmets ansvar att se till att alla blanksteg och specialtecken citeras på rätt sätt för att undvika `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_-sårbarheter. Funktionen :func:`shlex.quote` kan användas för att på rätt sätt undkomma blanksteg och speciella skaltecken i strängar som ska användas för att konstruera skalkommandon.

source: Subprocesses are available for Windows if a :class:`ProactorEventLoop` is used. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
sv: Underprocesser är tillgängliga för Windows om en :class:`ProactorEventLoop` används. Se :ref:`Subprocessstöd på Windows <asyncio-windows-subprocess>` för mer information.

source: asyncio also has the following *low-level* APIs to work with subprocesses: :meth:`loop.subprocess_exec`, :meth:`loop.subprocess_shell`, :meth:`loop.connect_read_pipe`, :meth:`loop.connect_write_pipe`, as well as the :ref:`Subprocess Transports <asyncio-subprocess-transports>` and :ref:`Subprocess Protocols <asyncio-subprocess-protocols>`.
sv: asyncio har även följande *lågnivå* API:er för att arbeta med subprocesser: :meth:`loop.subprocess_exec`, :meth:`loop.subprocess_shell`, :meth:`loop.connect_read_pipe`, :meth:`loop.connect_write_pipe`, samt :ref:`Subprocess Transports <asyncio-subprocess-transports>` och :ref:`Subprocess Protocols <asyncio-subprocess-protocols>`.

source: Constants
sv: Konstanter

source: Can be passed to the *stdin*, *stdout* or *stderr* parameters.
sv: Kan skickas till parametrarna *stdin*, *stdout* eller *stderr*.

source: If *PIPE* is passed to *stdin* argument, the :attr:`Process.stdin <asyncio.subprocess.Process.stdin>` attribute will point to a :class:`~asyncio.StreamWriter` instance.
sv: Om *PIPE* skickas till argumentet *stdin* kommer attributet :attr:`Process.stdin <asyncio.subprocess.Process.stdin>` att peka på en instans av :class:`~asyncio.StreamWriter`.

source: If *PIPE* is passed to *stdout* or *stderr* arguments, the :attr:`Process.stdout <asyncio.subprocess.Process.stdout>` and :attr:`Process.stderr <asyncio.subprocess.Process.stderr>` attributes will point to :class:`~asyncio.StreamReader` instances.
sv: Om *PIPE* skickas till argumenten *stdout* eller *stderr* kommer attributen :attr:`Process.stdout <asyncio.subprocess.Process.stdout>` och :attr:`Process.stderr <asyncio.subprocess.Process.stderr>` att peka på :class:`~asyncio.StreamReader`-instanser.

source: Special value that can be used as the *stderr* argument and indicates that standard error should be redirected into standard output.
sv: Specialvärde som kan användas som argumentet *stderr* och som anger att standardfelet ska omdirigeras till standardutmatningen.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to process creation functions. It indicates that the special file :data:`os.devnull` will be used for the corresponding subprocess stream.
sv: Specialvärde som kan användas som *stdin*-, *stdout*- eller *stderr*-argument i processskapande funktioner. Det anger att specialfilen :data:`os.devnull` kommer att användas för motsvarande subprocessström.

source: Interacting with Subprocesses
sv: Interagera med underprocesser

source: Both :func:`create_subprocess_exec` and :func:`create_subprocess_shell` functions return instances of the *Process* class. *Process* is a high-level wrapper that allows communicating with subprocesses and watching for their completion.
sv: Både funktionerna :func:`create_subprocess_exec` och :func:`create_subprocess_shell` returnerar instanser av klassen *Process*. *Process* är ett omslag på hög nivå som gör det möjligt att kommunicera med subprocesser och övervaka att de slutförs.

source: An object that wraps OS processes created by the :func:`~asyncio.create_subprocess_exec` and :func:`~asyncio.create_subprocess_shell` functions.
sv: Ett objekt som omsluter OS-processer som skapats av funktionerna :func:`~asyncio.create_subprocess_exec` och :func:`~asyncio.create_subprocess_shell`.

source: This class is designed to have a similar API to the :class:`subprocess.Popen` class, but there are some notable differences:
sv: Denna klass är utformad för att ha ett liknande API som klassen :class:`subprocess.Popen`, men det finns några anmärkningsvärda skillnader:

source: unlike Popen, Process instances do not have an equivalent to the :meth:`~subprocess.Popen.poll` method;
sv: till skillnad från Popen har Process-instanser ingen motsvarighet till metoden :meth:`~subprocess.Popen.poll`;

source: the :meth:`~asyncio.subprocess.Process.communicate` and :meth:`~asyncio.subprocess.Process.wait` methods don't have a *timeout* parameter: use the :func:`~asyncio.wait_for` function;
sv: metoderna :meth:`~asyncio.subprocess.Process.communicate` och :meth:`~asyncio.subprocess.Process.wait` har ingen parameter *timeout*: använd funktionen :func:`~asyncio.wait_for`;

source: the :meth:`Process.wait() <asyncio.subprocess.Process.wait>` method is asynchronous, whereas :meth:`subprocess.Popen.wait` method is implemented as a blocking busy loop;
sv: metoden :meth:`Process.wait() <asyncio.subprocess.Process.wait>` är asynkron, medan metoden :meth:`subprocess.Popen.wait` implementeras som en blockerande busy loop;

source: the *universal_newlines* parameter is not supported.
sv: parametern *universal_newlines* stöds inte.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
sv: Den här klassen är :ref:`inte trådsäker <asyncio-multithreading>`.

source: See also the :ref:`Subprocess and Threads <asyncio-subprocess-threads>` section.
sv: Se även avsnittet :ref:`Subprocesser och trådar <asyncio-subprocess-threads>`.

source: Wait for the child process to terminate.
sv: Vänta tills barnprocessen har avslutats.

source: Set and return the :attr:`returncode` attribute.
sv: Ange och returnera attributet :attr:`returncode`.

source: This method can deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates so much output that it blocks waiting for the OS pipe buffer to accept more data. Use the :meth:`communicate` method when using pipes to avoid this condition.
sv: Den här metoden kan leda till dödläge när ``stdout=PIPE`` eller ``stderr=PIPE`` används och barnprocessen genererar så mycket utdata att den blockeras i väntan på att OS-pipebufferten ska ta emot mer data. Använd metoden :meth:`communicate` när du använder pipes för att undvika detta tillstånd.

source: Interact with process:
sv: Interagera med processen:

source: send data to *stdin* (if *input* is not ``None``);
sv: skicka data till *stdin* (om *input* inte är ``None``);

source: closes *stdin*;
sv: stänger *stdin*;

source: read data from *stdout* and *stderr*, until EOF is reached;
sv: läser data från *stdout* och *stderr* tills EOF nås;

source: wait for process to terminate.
sv: vänta på att processen ska avslutas.

source: The optional *input* argument is the data (:class:`bytes` object) that will be sent to the child process.
sv: Det valfria argumentet *input* är de data (:class:`bytes`-objekt) som ska skickas till underordnad process.

source: Return a tuple ``(stdout_data, stderr_data)``.
sv: Returnera en tupel ``(stdout_data, stderr_data)``.

source: If either :exc:`BrokenPipeError` or :exc:`ConnectionResetError` exception is raised when writing *input* into *stdin*, the exception is ignored. This condition occurs when the process exits before all data are written into *stdin*.
sv: Om något av undantagen :exc:`BrokenPipeError` eller :exc:`ConnectionResetError` uppstår när *input* skrivs in i *stdin*, ignoreras undantaget. Detta tillstånd inträffar när processen avslutas innan alla data har skrivits in i *stdin*.

source: If it is desired to send data to the process' *stdin*, the process needs to be created with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, the process has to be created with ``stdout=PIPE`` and/or ``stderr=PIPE`` arguments.
sv: Om man vill skicka data till processens *stdin*, måste processen skapas med ``stdin=PIPE``. På samma sätt, för att få något annat än ``None`` i resultattupeln, måste processen skapas med ``stdout=PIPE`` och/eller ``stderr=PIPE`` argument.

source: Note, that the data read is buffered in memory, so do not use this method if the data size is large or unlimited.
sv: Observera att de data som läses buffras i minnet, så använd inte den här metoden om datastorleken är stor eller obegränsad.

source: *stdin* gets closed when ``input=None`` too.
sv: *stdin* stängs även när ``input=None``.

source: Sends the signal *signal* to the child process.
sv: Skickar signalen *signal* till den underordnade processen.

source: On Windows, :py:const:`~signal.SIGTERM` is an alias for :meth:`terminate`. ``CTRL_C_EVENT`` and ``CTRL_BREAK_EVENT`` can be sent to processes started with a *creationflags* parameter which includes ``CREATE_NEW_PROCESS_GROUP``.
sv: I Windows är :py:const:`~signal.SIGTERM` ett alias för :meth:`terminate`. ``CTRL_C_EVENT`` och ``CTRL_BREAK_EVENT`` kan skickas till processer som startats med en *creationflags*-parameter som inkluderar ``CREATE_NEW_PROCESS_GROUP``.

source: Stop the child process.
sv: Stoppa barnprocessen.

source: On POSIX systems this method sends :py:const:`~signal.SIGTERM` to the child process.
sv: På POSIX-system skickar den här metoden :py:const:`~signal.SIGTERM` till barnprocessen.

source: On Windows the Win32 API function :c:func:`!TerminateProcess` is called to stop the child process.
sv: I Windows anropas Win32 API-funktionen :c:func:`!TerminateProcess` för att stoppa underordnad process.

source: Kill the child process.
sv: Avsluta barnprocessen.

source: On POSIX systems this method sends :py:data:`~signal.SIGKILL` to the child process.
sv: På POSIX-system skickar den här metoden :py:data:`~signal.SIGKILL` till barnprocessen.

source: On Windows this method is an alias for :meth:`terminate`.
sv: I Windows är denna metod ett alias för :meth:`terminate`.

source: Standard input stream (:class:`~asyncio.StreamWriter`) or ``None`` if the process was created with ``stdin=None``.
sv: Standardinmatningsström (:class:`~asyncio.StreamWriter`) eller ``None`` om processen skapades med ``stdin=None``.

source: Standard output stream (:class:`~asyncio.StreamReader`) or ``None`` if the process was created with ``stdout=None``.
sv: Standardutdataström (:class:`~asyncio.StreamReader`) eller ``None`` om processen skapades med ``stdout=None``.

source: Standard error stream (:class:`~asyncio.StreamReader`) or ``None`` if the process was created with ``stderr=None``.
sv: Standardfelström (:class:`~asyncio.StreamReader`) eller ``None`` om processen skapades med ``stderr=None``.

source: Use the :meth:`communicate` method rather than :attr:`process.stdin.write() <stdin>`, :attr:`await process.stdout.read() <stdout>` or :attr:`await process.stderr.read() <stderr>`. This avoids deadlocks due to streams pausing reading or writing and blocking the child process.
sv: Använd metoden :meth:`communicate` i stället för :attr:`process.stdin.write() <stdin>`, :attr:`await process.stdout.read() <stdout>` eller :attr:`await process.stderr.read() <stderr>`. På så sätt undviks dödlägen på grund av att strömmar pausar läsning eller skrivning och blockerar barnprocessen.

source: Process identification number (PID).
sv: Processens identifikationsnummer (PID).

source: Note that for processes created by the :func:`~asyncio.create_subprocess_shell` function, this attribute is the PID of the spawned shell.
sv: Observera att för processer som skapats av funktionen :func:`~asyncio.create_subprocess_shell` är detta attribut PID för det skapade skalet.

source: Return code of the process when it exits.
sv: Processens returkod när den avslutas.

source: A ``None`` value indicates that the process has not terminated yet.
sv: Ett värde på ``None`` anger att processen inte har avslutats ännu.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
sv: Ett negativt värde ``-N`` anger att barnet avslutades med signal ``N`` (endast POSIX).

source: Subprocess and Threads
sv: Underprocesser och trådar

source: Standard asyncio event loop supports running subprocesses from different threads by default.
sv: Standard asyncio event loop stöder som standard att köra subprocesser från olika trådar.

source: On Windows subprocesses are provided by :class:`ProactorEventLoop` only (default), :class:`SelectorEventLoop` has no subprocess support.
sv: I Windows tillhandahålls underprocesser endast av :class:`ProactorEventLoop` (standard), :class:`SelectorEventLoop` har inget stöd för underprocesser.

source: Note that alternative event loop implementations might have own limitations; please refer to their documentation.
sv: Observera att alternativa implementeringar av händelseslingor kan ha egna begränsningar; se deras dokumentation.

source: The :ref:`Concurrency and multithreading in asyncio <asyncio-multithreading>` section.
sv: Avsnittet :ref:`Concurrency och multithreading i asyncio <asyncio-multithreading>`.

source: Examples
sv: Exempel

source: An example using the :class:`~asyncio.subprocess.Process` class to control a subprocess and the :class:`StreamReader` class to read from its standard output.
sv: Ett exempel där klassen :class:`~asyncio.subprocess.Process` används för att styra en subprocess och klassen :class:`StreamReader` för att läsa från dess standardutdata.

source: The subprocess is created by the :func:`create_subprocess_exec` function::
sv: Subprocessen skapas med funktionen :func:`create_subprocess_exec`::

source: See also the :ref:`same example <asyncio_example_subprocess_proto>` written using low-level APIs.
sv: Se även :ref:`samme exempel <asyncio_example_subprocess_proto>` skrivet med hjälp av API:er på låg nivå.
