Repository: yeager/python-docs-sv
Catalog: library/asyncio-graph.po
Languages: sv

source: Call Graph Introspection
sv: Introspektion av anropsgrafen

source: **Source code:** :source:`Lib/asyncio/graph.py`
sv: **Källkod:** :source:`Lib/asyncio/graph.py`

source: asyncio has powerful runtime call graph introspection utilities to trace the entire call graph of a running *coroutine* or *task*, or a suspended *future*. These utilities and the underlying machinery can be used from within a Python program or by external profilers and debuggers.
sv: asyncio har kraftfulla verktyg för introspektion av anropsgrafen under körning för att spåra hela anropsgrafen för en körande *coroutine* eller *task*, eller en suspenderad *future*. Dessa verktyg och det underliggande maskineriet kan användas inifrån ett Python-program eller av externa profilerare och debuggers.

source: Print the async call graph for the current task or the provided :class:`Task` or :class:`Future`.
sv: Skriv ut grafen för asynkrona anrop för den aktuella uppgiften eller den angivna :class:`Task` eller :class:`Future`.

source: This function prints entries starting from the top frame and going down towards the invocation point.
sv: Denna funktion skriver ut poster med början från den övre ramen och nedåt mot anropspunkten.

source: The function receives an optional *future* argument. If not passed, the current running task will be used.
sv: Funktionen tar emot ett valfritt *future*-argument. Om det inte skickas med kommer den aktuella körningen att användas.

source: If the function is called on *the current task*, the optional keyword-only *depth* argument can be used to skip the specified number of frames from top of the stack.
sv: Om funktionen anropas på *den aktuella uppgiften* kan det valfria argumentet *depth*, som endast innehåller nyckelord, användas för att hoppa över det angivna antalet bildrutor från toppen av stacken.

source: If the optional keyword-only *limit* argument is provided, each call stack in the resulting graph is truncated to include at most ``abs(limit)`` entries. If *limit* is positive, the entries left are the closest to the invocation point. If *limit* is negative, the topmost entries are left. If *limit* is omitted or ``None``, all entries are present. If *limit* is ``0``, the call stack is not printed at all, only "awaited by" information is printed.
sv: Om det valfria argumentet *limit*, som endast innehåller nyckelord, anges, trunkeras varje anropsstack i den resulterande grafen så att den innehåller högst ``abs(limit)`` poster. Om *limit* är positiv, är de poster som lämnas kvar de som ligger närmast anropspunkten. Om *limit* är negativ, lämnas de översta posterna. Om *limit* utelämnas eller är ``None`` finns alla poster kvar. Om *limit* är ``0`` skrivs inte anropsstacken ut alls, endast "awaited by"-information skrivs ut.

source: If *file* is omitted or ``None``, the function will print to :data:`sys.stdout`.
sv: Om *file* utelämnas eller ``None``, kommer funktionen att skriva ut till :data:`sys.stdout`.

source: **Example:**
sv: **Exempel:**

source: The following Python code:
sv: Följande Python-kod:

source: will print::
sv: kommer att skriva ut::

source: * Task(name='test', id=0x1039f0fe0) + Call stack: | File 't2.py', line 4, in async test() + Awaited by: * Task(name='Task-1', id=0x103a5e060) + Call stack: | File 'taskgroups.py', line 107, in async TaskGroup.__aexit__() | File 't2.py', line 7, in async main()
sv: * Uppgift(name='test', id=0x1039f0fe0) + Anropsstack: | Fil 't2.py', rad 4, i async test() + Väntas av: * Task(name='Task-1', id=0x103a5e060) + Anropsstack: | Fil 'taskgroups.py', rad 107, i async TaskGroup.__aexit__() | Fil 't2.py', rad 7, i async main()

source: Like :func:`print_call_graph`, but returns a string. If *future* is ``None`` and there's no current task, the function returns an empty string.
sv: Som :func:`print_call_graph`, men returnerar en sträng. Om *future* är ``None`` och det inte finns någon aktuell uppgift, returnerar funktionen en tom sträng.

source: Capture the async call graph for the current task or the provided :class:`Task` or :class:`Future`.
sv: Fångar async-anropsgrafen för den aktuella uppgiften eller den angivna :class:`Task` eller :class:`Future`.

source: The function receives an optional *future* argument. If not passed, the current running task will be used. If there's no current task, the function returns ``None``.
sv: Funktionen tar emot ett valfritt *future*-argument. Om det inte skickas med kommer den aktuella körningen att användas. Om det inte finns någon aktuell uppgift returnerar funktionen ``None``.

source: Returns a ``FutureCallGraph`` data class object:
sv: Returnerar ett dataklassobjekt av typen ``FutureCallGraph``:

source: ``FutureCallGraph(future, call_stack, awaited_by)``
sv: ``FutureCallGraph(framtid, call_stack, väntat_by)``

source: Where *future* is a reference to a :class:`Future` or a :class:`Task` (or their subclasses.)
sv: Där *future* är en referens till en :class:`Future` eller en :class:`Task` (eller deras underklasser.)

source: ``call_stack`` is a tuple of ``FrameCallGraphEntry`` objects.
sv: ``call_stack`` är en tupel av ``FrameCallGraphEntry`` objekt.

source: ``awaited_by`` is a tuple of ``FutureCallGraph`` objects.
sv: ``awaited_by`` är en tupel av ``FutureCallGraph`` objekt.

source: ``FrameCallGraphEntry(frame)``
sv: ``FrameCallGraphEntry(ram)``

source: Where *frame* is a frame object of a regular Python function in the call stack.
sv: Där *frame* är ett frame-objekt för en vanlig Python-funktion i anropsstacken.

source: Low level utility functions
sv: Nyttofunktioner på låg nivå

source: To introspect an async call graph asyncio requires cooperation from control flow structures, such as :func:`shield` or :class:`TaskGroup`. Any time an intermediate :class:`Future` object with low-level APIs like :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` is involved, the following two functions should be used to inform asyncio about how exactly such intermediate future objects are connected with the tasks they wrap or control.
sv: För att introspektera en asynkron anropsgraf kräver asyncio samarbete från kontrollflödesstrukturer, såsom :func:`shield` eller :class:`TaskGroup`. Varje gång ett mellanliggande :class:`Future`-objekt med lågnivå-API:er som :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` är inblandat, bör följande två funktioner användas för att informera asyncio om exakt hur sådana mellanliggande future-objekt är kopplade till de uppgifter de omsluter eller kontrollerar.

source: Record that *future* is awaited on by *waiter*.
sv: Registrera att *framtiden* inväntas av *vaktmästaren*.

source: Both *future* and *waiter* must be instances of :class:`Future` or :class:`Task` or their subclasses, otherwise the call would have no effect.
sv: Både *future* och *waiter* måste vara instanser av :class:`Future` eller :class:`Task` eller deras subklasser, annars har anropet ingen effekt.

source: A call to ``future_add_to_awaited_by()`` must be followed by an eventual call to the :func:`future_discard_from_awaited_by` function with the same arguments.
sv: Ett anrop till ``future_add_to_awaited_by()`` måste följas av ett eventuellt anrop till funktionen :func:`future_discard_from_awaited_by` med samma argument.

source: Record that *future* is no longer awaited on by *waiter*.
sv: Registrera att *framtiden* inte längre inväntas av *vaktmästaren*.
