Repository: yeager/python-docs-sv
Catalog: library/asyncio-queue.po
Languages: sv

source: Queues
sv: Köer

source: **Source code:** :source:`Lib/asyncio/queues.py`
sv: **Källkod:** :source:`Lib/asyncio/queues.py`

source: asyncio queues are designed to be similar to classes of the :mod:`queue` module. Although asyncio queues are not thread-safe, they are designed to be used specifically in async/await code.
sv: asyncio-köer är utformade för att likna klasser i modulen :mod:`queue`. Även om asyncio-köer inte är trådsäkra är de utformade för att användas specifikt i async/await-kod.

source: Note that methods of asyncio queues don't have a *timeout* parameter; use :func:`asyncio.wait_for` function to do queue operations with a timeout.
sv: Observera att metoder för asyncioköer inte har en *timeout*-parameter; använd :func:`asyncio.wait_for`-funktionen för att göra köoperationer med en timeout.

source: See also the `Examples`_ section below.
sv: Se även avsnittet `Exempel` nedan.

source: Queue
sv: Kö

source: A first in, first out (FIFO) queue.
sv: En FIFO-kö (först in, först ut).

source: If *maxsize* is less than or equal to zero, the queue size is infinite. If it is an integer greater than ``0``, then ``await put()`` blocks when the queue reaches *maxsize* until an item is removed by :meth:`get`.
sv: Om *maxsize* är mindre än eller lika med noll är köns storlek oändlig. Om det är ett heltal större än ``0``, blockerar ``await put()`` när kön når *maxsize* tills ett objekt tas bort med :meth:`get`.

source: Unlike the standard library threading :mod:`queue`, the size of the queue is always known and can be returned by calling the :meth:`qsize` method.
sv: Till skillnad från standardbibliotekets trådning :mod:`queue` är storleken på kön alltid känd och kan returneras genom att anropa metoden :meth:`qsize`.

source: Removed the *loop* parameter.
sv: Parametern *loop* har tagits bort.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
sv: Den här klassen är :ref:`inte trådsäker <asyncio-multithreading>`.

source: Number of items allowed in the queue.
sv: Antal objekt som tillåts i kön.

source: Return ``True`` if the queue is empty, ``False`` otherwise.
sv: Returnerar ``True`` om kön är tom, annars ``False``.

source: Return ``True`` if there are :attr:`maxsize` items in the queue.
sv: Returnerar ``True`` om det finns :attr:`maxsize` objekt i kön.

source: If the queue was initialized with ``maxsize=0`` (the default), then :meth:`full` never returns ``True``.
sv: Om kön initialiserades med ``maxsize=0`` (standard) returnerar :meth:`full` aldrig ``True``.

source: Remove and return an item from the queue. If queue is empty, wait until an item is available.
sv: Ta bort och returnera ett objekt från kön. Om kön är tom, vänta tills ett objekt är tillgängligt.

source: Raises :exc:`QueueShutDown` if the queue has been shut down and is empty, or if the queue has been shut down immediately.
sv: Utlöser :exc:`QueueShutDown` om kön har stängts av och är tom, eller om kön har stängts av omedelbart.

source: Return an item if one is immediately available, else raise :exc:`QueueEmpty`.
sv: Returnera ett objekt om det finns ett omedelbart tillgängligt, annars uppstår :exc:`QueueEmpty`.

source: Block until all items in the queue have been received and processed.
sv: Blockera tills alla artiklar i kön har tagits emot och behandlats.

source: The count of unfinished tasks goes up whenever an item is added to the queue. The count goes down whenever a consumer coroutine calls :meth:`task_done` to indicate that the item was retrieved and all work on it is complete. When the count of unfinished tasks drops to zero, :meth:`join` unblocks.
sv: Antalet oavslutade uppgifter ökar varje gång ett objekt läggs till i kön. Antalet sjunker när en consumer coroutine anropar :meth:`task_done` för att ange att objektet har hämtats och att allt arbete med det är slutfört. När antalet oavslutade uppgifter sjunker till noll avblockeras :meth:`join`.

source: Put an item into the queue. If the queue is full, wait until a free slot is available before adding the item.
sv: Lägg till ett objekt i kön. Om kön är full väntar du tills en ledig plats finns tillgänglig innan du lägger till objektet.

source: Raises :exc:`QueueShutDown` if the queue has been shut down.
sv: Utlöser :exc:`QueueShutDown` om kön har stängts av.

source: Put an item into the queue without blocking.
sv: Lägg in ett objekt i kön utan att blockera.

source: If no free slot is immediately available, raise :exc:`QueueFull`.
sv: Om ingen ledig plats finns omedelbart tillgänglig, uppstår :exc:`QueueFull`.

source: Return the number of items in the queue.
sv: Returnerar antalet objekt i kön.

source: Shut down the queue, making :meth:`~Queue.get` and :meth:`~Queue.put` raise :exc:`QueueShutDown`.
sv: Stänger av kön, vilket gör att :meth:`~Queue.get` och :meth:`~Queue.put` ger upphov till :exc:`QueueShutDown`.

source: By default, :meth:`~Queue.get` on a shut down queue will only raise once the queue is empty. Set *immediate* to true to make :meth:`~Queue.get` raise immediately instead.
sv: Som standard kommer :meth:`~Queue.get` på en avstängd kö inte att aktiveras förrän kön är tom. Sätt *immediate* till true för att få :meth:`~Queue.get` att starta omedelbart istället.

source: All blocked callers of :meth:`~Queue.put` and :meth:`~Queue.get` will be unblocked. If *immediate* is true, a task will be marked as done for each remaining item in the queue, which may unblock callers of :meth:`~Queue.join`.
sv: Alla blockerade anropare av :meth:`~Queue.put` och :meth:`~Queue.get` kommer att avblockeras. Om *immediate* är true, kommer en uppgift att markeras som utförd för varje återstående objekt i kön, vilket kan avblockera anropare av :meth:`~Queue.join`.

source: Indicate that a formerly enqueued work item is complete.
sv: Anger att ett arbetsobjekt som tidigare var i kö är klart.

source: Used by queue consumers. For each :meth:`~Queue.get` used to fetch a work item, a subsequent call to :meth:`task_done` tells the queue that the processing on the work item is complete.
sv: Används av köanvändare. För varje :meth:`~Queue.get` som används för att hämta ett arbetsobjekt, talar ett efterföljande anrop till :meth:`task_done` om för kön att bearbetningen av arbetsobjektet är klar.

source: If a :meth:`join` is currently blocking, it will resume when all items have been processed (meaning that a :meth:`task_done` call was received for every item that had been :meth:`~Queue.put` into the queue).
sv: Om en :meth:`join` för närvarande blockeras, kommer den att återupptas när alla objekt har bearbetats (vilket innebär att ett :meth:`task_done`-anrop mottogs för varje objekt som hade :meth:`~Queue.put` i kön).

source: ``shutdown(immediate=True)`` calls :meth:`task_done` for each remaining item in the queue.
sv: ``shutdown(immediate=True)`` anropar :meth:`task_done` för varje återstående objekt i kön.

source: Raises :exc:`ValueError` if called more times than there were items placed in the queue.
sv: Utlöser :exc:`ValueError` om den anropas fler gånger än det finns objekt i kön.

source: Priority Queue
sv: Prioriterad kö

source: A variant of :class:`Queue`; retrieves entries in priority order (lowest first).
sv: En variant av :class:`Queue`; hämtar poster i prioritetsordning (lägst först).

source: Entries are typically tuples of the form ``(priority_number, data)``.
sv: Posterna är vanligtvis tupler av formen ``(priority_number, data)``.

source: LIFO Queue
sv: LIFO-kö

source: A variant of :class:`Queue` that retrieves most recently added entries first (last in, first out).
sv: En variant av :class:`Queue` som hämtar de senast tillagda posterna först (sist in, först ut).

source: Exceptions
sv: Undantag

source: This exception is raised when the :meth:`~Queue.get_nowait` method is called on an empty queue.
sv: Detta undantag uppstår när metoden :meth:`~Queue.get_nowait` anropas på en tom kö.

source: Exception raised when the :meth:`~Queue.put_nowait` method is called on a queue that has reached its *maxsize*.
sv: Exception som uppstår när metoden :meth:`~Queue.put_nowait` anropas på en kö som har nått sin *maxsize*.

source: Exception raised when :meth:`~Queue.put` or :meth:`~Queue.get` is called on a queue which has been shut down.
sv: Exception som uppstår när :meth:`~Queue.put` eller :meth:`~Queue.get` anropas på en kö som har stängts ner.

source: Examples
sv: Exempel

source: Queues can be used to distribute workload between several concurrent tasks::
sv: Köer kan användas för att fördela arbetsbelastningen mellan flera samtidiga uppgifter::
