Repository: yeager/python-docs-sv
Catalog: library/asyncio-llapi-index.po
Languages: sv

source: Low-level API Index
sv: API-index på låg nivå

source: This page lists all low-level asyncio APIs.
sv: På den här sidan listas alla asyncios API:er på låg nivå.

source: Obtaining the Event Loop
sv: Få fram händelseslingan

source: The **preferred** function to get the running event loop.
sv: Den **företrädes** funktionen för att få den löpande händelseslingan.

source: Get an event loop instance (running or current via the current policy).
sv: Hämta en instans för händelseslinga (pågående eller aktuell via aktuell policy).

source: Set the event loop as current via the current policy.
sv: Ställ in händelseslingan som aktuell via den aktuella policyn.

source: Create a new event loop.
sv: Skapa en ny händelseslinga.

source: Examples
sv: Exempel

source: Event Loop Methods
sv: Metoder för händelseslingor

source: See also the main documentation section about the :ref:`asyncio-event-loop-methods`.
sv: Se även huvuddokumentationsavsnittet om :ref:`asyncio-event-loop-methods`.

source: Lifecycle
sv: Livscykel

source: Run a Future/Task/awaitable until complete.
sv: Kör en Future/Task/awaitable tills den är klar.

source: Run the event loop forever.
sv: Kör händelseslingan för evigt.

source: Stop the event loop.
sv: Stoppa händelseslingan.

source: Close the event loop.
sv: Stäng händelseslingan.

source: Return ``True`` if the event loop is running.
sv: Returnerar ``True`` om händelseslingan är igång.

source: Return ``True`` if the event loop is closed.
sv: Returnerar ``True`` om händelseslingan är stängd.

source: Close asynchronous generators.
sv: Stäng av asynkrona generatorer.

source: Debugging
sv: Felsökning

source: Enable or disable the debug mode.
sv: Aktivera eller inaktivera felsökningsläget.

source: Get the current debug mode.
sv: Hämta aktuellt felsökningsläge.

source: Scheduling Callbacks
sv: Schemaläggning av återuppringningar

source: Invoke a callback soon.
sv: Anropa en återuppringning snart.

source: A thread-safe variant of :meth:`loop.call_soon`.
sv: En trådsäker variant av :meth:`loop.call_soon`.

source: Invoke a callback *after* the given time.
sv: Anropar en callback *efter* den angivna tiden.

source: Invoke a callback *at* the given time.
sv: Anropar ett återuppringningsprogram *vid* den angivna tidpunkten.

source: Thread/Interpreter/Process Pool
sv: Tråd/Interpreterare/Processpool

source: Run a CPU-bound or other blocking function in a :mod:`concurrent.futures` executor.
sv: Kör en CPU-bunden eller annan blockerande funktion i en :mod:`concurrent.futures` exekverare.

source: Set the default executor for :meth:`loop.run_in_executor`.
sv: Ange standardutförare för :meth:`loop.run_in_executor`.

source: Tasks and Futures
sv: Uppgifter och framtid

source: :meth:`loop.create_future`
sv: :meth:`loop.skapa_future`

source: Create a :class:`Future` object.
sv: Skapa ett :class:`Future`-objekt.

source: Schedule coroutine as a :class:`Task`.
sv: Schemalägg coroutine som en :class:`Task`.

source: Set a factory used by :meth:`loop.create_task` to create :class:`Tasks <Task>`.
sv: Ange en fabrik som används av :meth:`loop.create_task` för att skapa :class:`Tasks <Task>`.

source: Get the factory :meth:`loop.create_task` uses to create :class:`Tasks <Task>`.
sv: Hämta fabriken som :meth:`loop.create_task` använder för att skapa :class:`Tasks <Task>`.

source: Asynchronous version of :meth:`socket.getaddrinfo`.
sv: Asynkron version av :meth:`socket.getaddrinfo`.

source: Asynchronous version of :meth:`socket.getnameinfo`.
sv: Asynkron version av :meth:`socket.getnameinfo`.

source: Networking and IPC
sv: Nätverk och IPC

source: ``await`` :meth:`loop.create_connection`
sv: ``await`` :meth:`loop.skapa_anslutning`

source: Open a TCP connection.
sv: Öppna en TCP-anslutning.

source: ``await`` :meth:`loop.create_server`
sv: ``await`` :meth:`loop.skapa_server`

source: Create a TCP server.
sv: Skapa en TCP-server.

source: ``await`` :meth:`loop.create_unix_connection`
sv: ``await`` :meth:`loop.skapa_unix_connection`

source: Open a Unix socket connection.
sv: Öppna en Unix-socketanslutning.

source: ``await`` :meth:`loop.create_unix_server`
sv: ``await`` :meth:`loop.skapa_unix_server`

source: Create a Unix socket server.
sv: Skapa en Unix-socket-server.

source: Wrap a :class:`~socket.socket` into a ``(transport, protocol)`` pair.
sv: Packa in en :class:`~socket.socket` till ett ``(transport, protokoll)``-par.

source: ``await`` :meth:`loop.create_datagram_endpoint`
sv: ``await`` :meth:`loop.skapa_datagram_ändpunkt`

source: Open a datagram (UDP) connection.
sv: Öppna en UDP-anslutning (datagram).

source: Send a file over a transport.
sv: Skicka en fil över en transport.

source: Upgrade an existing connection to TLS.
sv: Uppgradera en befintlig anslutning till TLS.

source: Wrap a read end of a pipe into a ``(transport, protocol)`` pair.
sv: Packa in en läsande ände av en pipe i ett ``(transport, protokoll)``-par.

source: Wrap a write end of a pipe into a ``(transport, protocol)`` pair.
sv: Packa in en skrivande ände av en pipe i ett ``(transport, protokoll)``-par.

source: Sockets
sv: Uttag

source: ``await`` :meth:`loop.sock_recv`
sv: ``await`` :meth:`loop.sock_recv`` :meth:`loop.sock_recv`

source: Receive data from the :class:`~socket.socket`.
sv: Ta emot data från :class:`~socket.socket`.

source: Receive data from the :class:`~socket.socket` into a buffer.
sv: Ta emot data från :class:`~socket.socket` till en buffert.

source: ``await`` :meth:`loop.sock_recvfrom`
sv: ``await`` :meth:`loop.sock_recvfrom`` :meth:`loop.sock_recvfrom`

source: Receive a datagram from the :class:`~socket.socket`.
sv: Ta emot ett datagram från :class:`~socket.socket`.

source: ``await`` :meth:`loop.sock_recvfrom_into`
sv: ``await`` :meth:`loop.sock_recvvfrom_into`

source: Receive a datagram from the :class:`~socket.socket` into a buffer.
sv: Ta emot ett datagram från :class:`~socket.socket` till en buffert.

source: ``await`` :meth:`loop.sock_sendall`
sv: ``await`` :meth:`loop.sock_sendall`` :meth:`loop.sock_sendall`

source: Send data to the :class:`~socket.socket`.
sv: Skicka data till :class:`~socket.socket`.

source: ``await`` :meth:`loop.sock_sendto`
sv: ``await`` :meth:`loop.sock_sendto`` :meth:`loop.sock_sendto`

source: Send a datagram via the :class:`~socket.socket` to the given address.
sv: Skicka ett datagram via :class:`~socket.socket` till den angivna adressen.

source: Connect the :class:`~socket.socket`.
sv: Anslut :class:`~socket.socket`.

source: Accept a :class:`~socket.socket` connection.
sv: Acceptera en :class:`~socket.socket`-anslutning.

source: Send a file over the :class:`~socket.socket`.
sv: Skicka en fil över :class:`~socket.socket`.

source: Start watching a file descriptor for read availability.
sv: Börja bevaka en filbeskrivare för lästillgänglighet.

source: Stop watching a file descriptor for read availability.
sv: Sluta bevaka en filbeskrivare för lästillgänglighet.

source: Start watching a file descriptor for write availability.
sv: Börja bevaka en filbeskrivare för skrivtillgänglighet.

source: Stop watching a file descriptor for write availability.
sv: Sluta bevaka en filbeskrivare för skrivtillgänglighet.

source: Unix Signals
sv: Unix-signaler

source: Add a handler for a :mod:`signal`.
sv: Lägg till en hanterare för en :mod:`signal`.

source: Remove a handler for a :mod:`signal`.
sv: Ta bort en hanterare för en :mod:`signal`.

source: Subprocesses
sv: Delprocesser

source: Spawn a subprocess.
sv: Starta en underprocess.

source: Spawn a subprocess from a shell command.
sv: Starta en subprocess från ett shell-kommando.

source: Error Handling
sv: Felhantering

source: Call the exception handler.
sv: Anropa undantagshanteraren.

source: Set a new exception handler.
sv: Ställ in en ny undantagshanterare.

source: Get the current exception handler.
sv: Hämta den aktuella undantagshanteraren.

source: The default exception handler implementation.
sv: Standardimplementeringen av undantagshanteraren.

source: :ref:`Using asyncio.new_event_loop() and loop.run_forever() <asyncio_example_lowlevel_helloworld>`.
sv: :ref:`Använder asyncio.new_event_loop() och loop.run_forever() <asyncio_example_lowlevel_helloworld>`.

source: :ref:`Using loop.call_later() <asyncio_example_call_later>`.
sv: :ref:`Använder loop.call_later() <asyncio_example_call_later>`.

source: Using ``loop.create_connection()`` to implement :ref:`an echo-client <asyncio_example_tcp_echo_client_protocol>`.
sv: Använda ``loop.create_connection()`` för att implementera :ref:`en echo-client <asyncio_example_tcp_echo_client_protocol>`.

source: Using ``loop.create_connection()`` to :ref:`connect a socket <asyncio_example_create_connection>`.
sv: Använda ``loop.create_connection()`` för att :ref:`ansluta ett uttag <asyncio_example_create_connection>`.

source: :ref:`Using add_reader() to watch an FD for read events <asyncio_example_watch_fd>`.
sv: :ref:`Använder add_reader() för att bevaka en FD för läshändelser <asyncio_example_watch_fd>`.

source: Transports
sv: Transportkvitton

source: All transports implement the following methods:
sv: Alla transporter implementerar följande metoder:

source: Close the transport.
sv: Stäng transporten.

source: Return ``True`` if the transport is closing or is closed.
sv: Returnerar ``True`` om transporten håller på att stängas eller är stängd.

source: Request for information about the transport.
sv: Begäran om information om transporten.

source: Set a new protocol.
sv: Ställ in ett nytt protokoll.

source: Return the current protocol.
sv: Returnerar det aktuella protokollet.

source: Transports that can receive data (TCP and Unix connections, pipes, etc). Returned from methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_read_pipe`, etc:
sv: Transporter som kan ta emot data (TCP- och Unix-anslutningar, pipes etc.). Returneras från metoder som :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_read_pipe`, etc:

source: Read Transports
sv: Läs transporter

source: :meth:`transport.is_reading() <ReadTransport.is_reading>`
sv: :meth:`transport.is_reading() <LäsTransport.is_reading>`

source: Return ``True`` if the transport is receiving.
sv: Returnerar ``True`` om transporten är mottagande.

source: :meth:`transport.pause_reading() <ReadTransport.pause_reading>`
sv: :meth:`transport.pause_reading() <Lästransport.pause_reading>`

source: Pause receiving.
sv: Pausa mottagning.

source: :meth:`transport.resume_reading() <ReadTransport.resume_reading>`
sv: :meth:`transport.resume_reading() <Lästransport.resume_reading>`

source: Resume receiving.
sv: Resumé mottagande.

source: Transports that can Send data (TCP and Unix connections, pipes, etc). Returned from methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_write_pipe`, etc:
sv: Transporter som kan skicka data (TCP- och Unix-anslutningar, pipes etc.). Returneras från metoder som :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_write_pipe`, etc:

source: Write Transports
sv: Skriva transporter

source: Write data to the transport.
sv: Skriv data till transportmedlet.

source: Write buffers to the transport.
sv: Skriv buffertar till transportmedlet.

source: Return :const:`True` if the transport supports sending EOF.
sv: Returnerar :const:`True` om transporten har stöd för att skicka EOF.

source: Close and send EOF after flushing buffered data.
sv: Stäng och skicka EOF efter rensning av buffrad data.

source: Close the transport immediately.
sv: Stäng transporten omedelbart.

source: Return the current size of the output buffer.
sv: Returnerar den aktuella storleken på utmatningsbufferten.

source: Return high and low water marks for write flow control.
sv: Returnera hög- och lågvattenmärken för kontroll av skrivflöde.

source: Set new high and low water marks for write flow control.
sv: Sätt nya hög- och lågvattenmärken för kontroll av skrivflödet.

source: Transports returned by :meth:`loop.create_datagram_endpoint`:
sv: Transporter returnerade av :meth:`loop.create_datagram_endpoint`:

source: Datagram Transports
sv: Datagramtransporter

source: Send data to the remote peer.
sv: Skicka data till den fjärranslutna motparten.

source: Low-level transport abstraction over subprocesses. Returned by :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell`:
sv: Transportabstraktion på låg nivå över subprocesser. Returneras av :meth:`loop.subprocess_exec` och :meth:`loop.subprocess_shell`:

source: Subprocess Transports
sv: Underprocess transporter

source: Return the subprocess process id.
sv: Returnerar underprocessens process-ID.

source: Return the transport for the requested communication pipe (*stdin*, *stdout*, or *stderr*).
sv: Returnerar transporten för den begärda kommunikationsröret (*stdin*, *stdout* eller *stderr*).

source: Return the subprocess return code.
sv: Returnerar subprocessens returkod.

source: Kill the subprocess.
sv: Stäng av underprocessen.

source: Send a signal to the subprocess.
sv: Skicka en signal till underprocessen.

source: Stop the subprocess.
sv: Stoppa underprocessen.

source: Kill the subprocess and close all pipes.
sv: Avsluta subprocessen och stäng alla rör.

source: Protocols
sv: Protokoll

source: Protocol classes can implement the following **callback methods**:
sv: Protokollklasser kan implementera följande **callback-metoder**:

source: Called when a connection is made.
sv: Anropas när en anslutning har gjorts.

source: Called when the connection is lost or closed.
sv: Anropas när anslutningen bryts eller stängs.

source: Called when the transport's buffer goes over the high water mark.
sv: Anropas när transportens buffert går över högvattengränsen.

source: Called when the transport's buffer drains below the low water mark.
sv: Anropas när transportens buffert dräneras under lågvattenlinjen.

source: Streaming Protocols (TCP, Unix Sockets, Pipes)
sv: Streamingprotokoll (TCP, Unix Sockets, Pipes)

source: Called when some data is received.
sv: Anropas när data har tagits emot.

source: Called when an EOF is received.
sv: Anropas när en EOF tas emot.

source: Buffered Streaming Protocols
sv: Protokoll för buffrad strömning

source: Called to allocate a new receive buffer.
sv: Anropas för att allokera en ny mottagningsbuffert.

source: Called when the buffer was updated with the received data.
sv: Anropas när bufferten har uppdaterats med de mottagna uppgifterna.

source: Datagram Protocols
sv: Datagram-protokoll

source: Called when a datagram is received.
sv: Anropas när ett datagram tas emot.

source: Called when a previous send or receive operation raises an :class:`OSError`.
sv: Anropas när en tidigare sändnings- eller mottagningsoperation ger upphov till ett :class:`OSError`.

source: Subprocess Protocols
sv: Protokoll för delprocesser

source: Called when the child process writes data into its *stdout* or *stderr* pipe.
sv: Anropas när barnprocessen skriver data till sin *stdout*- eller *stderr*-pipe.

source: Called when one of the pipes communicating with the child process is closed.
sv: Anropas när ett av de rör som kommunicerar med barnprocessen stängs.

source: Called when the child process has exited. It can be called before :meth:`~SubprocessProtocol.pipe_data_received` and :meth:`~SubprocessProtocol.pipe_connection_lost` methods.
sv: Anropas när underordnad process har avslutats. Den kan anropas före metoderna :meth:`~SubprocessProtocol.pipe_data_received` och :meth:`~SubprocessProtocol.pipe_connection_lost`.

source: Event Loop Policies
sv: Policyer för händelseslingor

source: Policies is a low-level mechanism to alter the behavior of functions like :func:`asyncio.get_event_loop`. See also the main :ref:`policies section <asyncio-policies>` for more details.
sv: Policies är en mekanism på låg nivå för att ändra beteendet hos funktioner som :func:`asyncio.get_event_loop`. Se även huvudavsnittet :ref:`policies <asyncio-policies>` för mer information.

source: Accessing Policies
sv: Tillgång till policyer

source: Return the current process-wide policy.
sv: Returnera den aktuella processomfattande policyn.

source: Set a new process-wide policy.
sv: Ange en ny policy för hela processen.

source: Base class for policy objects.
sv: Basklass för policyobjekt.
