Repository: yeager/python-docs-sv
Catalog: library/asyncio-eventloop.po
Languages: sv

source: *ssl* can be set to an :class:`~ssl.SSLContext` instance to enable TLS over the accepted connections.
sv: *ssl* kan sättas till en :class:`~ssl.SSLContext`-instans för att aktivera TLS över de accepterade anslutningarna.

source: *reuse_address* tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire. If not specified will automatically be set to ``True`` on Unix.
sv: *reuse_address* säger till kärnan att återanvända en lokal socket i ``TIME_WAIT``-tillstånd, utan att vänta på att dess naturliga timeout ska löpa ut. Om inte specificerat kommer det automatiskt att sättas till ``True`` på Unix.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows.
sv: *reuse_port* talar om för kärnan att den här ändpunkten får vara bunden till samma port som andra befintliga ändpunkter är bundna till, så länge de alla sätter denna flagga när de skapas. Detta alternativ stöds inte i Windows.

source: *keep_alive* set to ``True`` keeps connections active by enabling the periodic transmission of messages.
sv: *keep_alive* satt till ``True`` håller anslutningar aktiva genom att möjliggöra periodisk överföring av meddelanden.

source: Added the *keep_alive* parameter.
sv: Parametern *keep_alive* har lagts till.

source: *ssl_handshake_timeout* is (for a TLS server) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
sv: *ssl_handshake_timeout* är (för en TLS-server) den tid i sekunder som ska vänta på att TLS-handskakningen ska slutföras innan anslutningen avbryts. ``60,0`` sekunder om ``None`` (standard).

source: *start_serving* set to ``True`` (the default) causes the created server to start accepting connections immediately. When set to ``False``, the user should await on :meth:`Server.start_serving` or :meth:`Server.serve_forever` to make the server to start accepting connections.
sv: *start_serving* satt till ``True`` (standard) gör att den skapade servern börjar ta emot anslutningar omedelbart. När den är inställd på ``False`` bör användaren vänta på :meth:`Server.start_serving` eller :meth:`Server.serve_forever` för att få servern att börja acceptera anslutningar.

source: The *host* parameter can be a sequence of strings.
sv: Parametern *host* kan vara en sekvens av strängar.

source: Added *ssl_handshake_timeout* and *start_serving* parameters. The socket option :ref:`socket.TCP_NODELAY <socket-unix-constants>` is set by default for all TCP connections.
sv: Parametrarna *ssl_handshake_timeout* och *start_serving* har lagts till. Socket-alternativet :ref:`socket.TCP_NODELAY <socket-unix-constants>` är inställt som standard för alla TCP-anslutningar.

source: The :func:`start_server` function is a higher-level alternative API that returns a pair of :class:`StreamReader` and :class:`StreamWriter` that can be used in an async/await code.
sv: Funktionen :func:`start_server` är ett alternativt API på högre nivå som returnerar ett par av :class:`StreamReader` och :class:`StreamWriter` som kan användas i en async/await-kod.

source: Similar to :meth:`loop.create_server` but works with the :py:const:`~socket.AF_UNIX` socket family.
sv: Liknar :meth:`loop.create_server` men fungerar med socketfamiljen :py:const:`~socket.AF_UNIX`.

source: *path* is the name of a Unix domain socket, and is required, unless a *sock* argument is provided. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
sv: *path* är namnet på ett Unix-domänuttag och är obligatoriskt om inte ett *sock*-argument anges. Abstrakta Unix-sockets, :class:`str`, :class:`bytes` och :class:`~pathlib.Path`-sökvägar stöds.

source: If *cleanup_socket* is true then the Unix socket will automatically be removed from the filesystem when the server is closed, unless the socket has been replaced after the server has been created.
sv: Om *cleanup_socket* är true kommer Unix-sockeln automatiskt att tas bort från filsystemet när servern stängs, såvida inte sockeln har bytts ut efter att servern skapades.

source: See the documentation of the :meth:`loop.create_server` method for information about arguments to this method.
sv: Se dokumentationen för metoden :meth:`loop.create_server` för information om argument till den här metoden.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :class:`~pathlib.Path` object.
sv: Parametrarna *ssl_handshake_timeout* och *start_serving* har lagts till. Parametern *path* kan nu vara ett :class:`~pathlib.Path`-objekt.

source: Added the *cleanup_socket* parameter.
sv: Parametern *cleanup_socket* har lagts till.

source: Wrap an already accepted connection into a transport/protocol pair.
sv: Omhänderta en redan accepterad anslutning till ett transport/protokoll-par.

source: This method can be used by servers that accept connections outside of asyncio but that use asyncio to handle them.
sv: Den här metoden kan användas av servrar som accepterar anslutningar utanför asyncio men som använder asyncio för att hantera dem.

source: Parameters:
sv: Parametrar:

source: *sock* is a preexisting socket object returned from :meth:`socket.accept <socket.socket.accept>`.
sv: *sock* är ett redan existerande socket-objekt som returneras från :meth:`socket.accept <socket.socket.accept>`.

source: *ssl* can be set to an :class:`~ssl.SSLContext` to enable SSL over the accepted connections.
sv: *ssl* kan sättas till en :class:`~ssl.SSLContext` för att aktivera SSL över de accepterade anslutningarna.

source: *ssl_handshake_timeout* is (for an SSL connection) the time in seconds to wait for the SSL handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
sv: *ssl_handshake_timeout* är (för en SSL-anslutning) den tid i sekunder som ska vänta på att SSL-handskakningen ska slutföras innan anslutningen avbryts. ``60,0`` sekunder om ``None`` (standard).

source: Returns a ``(transport, protocol)`` pair.
sv: Returnerar ett par ``(transport, protokoll)``.

source: Transferring files
sv: Överföring av filer

source: Send a *file* over a *transport*. Return the total number of bytes sent.
sv: Skicka en *fil* över en *transport*. Returnera det totala antalet bytes som skickats.

source: The method uses high-performance :meth:`os.sendfile` if available.
sv: Metoden använder högpresterande :meth:`os.sendfile` om sådan finns tillgänglig.

source: *file* must be a regular file object opened in binary mode.
sv: *file* måste vara ett vanligt filobjekt som öppnas i binärt läge.

source: *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is always updated, even when this method raises an error, and :meth:`file.tell() <io.IOBase.tell>` can be used to obtain the actual number of bytes sent.
sv: *offset* anger varifrån filen ska börja läsas. Om det anges är *count* det totala antalet byte som ska överföras i motsats till att skicka filen tills EOF nås. Filens position uppdateras alltid, även om metoden ger upphov till ett fel, och :meth:`file.tell() <io.IOBase.tell>` kan användas för att få fram det faktiska antalet byte som skickats.

source: *fallback* set to ``True`` makes asyncio to manually read and send the file when the platform does not support the sendfile system call (e.g. Windows or SSL socket on Unix).
sv: *fallback* satt till ``True`` gör att asyncio manuellt läser och skickar filen när plattformen inte stöder systemanropet sendfile (t.ex. Windows eller SSL-socket på Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support the *sendfile* syscall and *fallback* is ``False``.
sv: Utlöser :exc:`SendfileNotAvailableError` om systemet inte stöder syscallen *sendfile* och *fallback* är ``False``.

source: TLS Upgrade
sv: TLS-uppgradering

source: Upgrade an existing transport-based connection to TLS.
sv: Uppgradera en befintlig transportbaserad anslutning till TLS.

source: Create a TLS coder/decoder instance and insert it between the *transport* and the *protocol*. The coder/decoder implements both *transport*-facing protocol and *protocol*-facing transport.
sv: Skapa en TLS-kodare/avkodare-instans och infoga den mellan *transport* och *protokoll*. Kodaren/avkodaren implementerar både protokoll som vetter mot *transport* och transport som vetter mot *protokoll*.

source: Return the created two-interface instance. After *await*, the *protocol* must stop using the original *transport* and communicate with the returned object only because the coder caches *protocol*-side data and sporadically exchanges extra TLS session packets with *transport*.
sv: Returnerar den skapade instansen med två gränssnitt. Efter *await* måste *protokollet* sluta använda den ursprungliga *transporten* och kommunicera med det returnerade objektet endast eftersom kodaren cachar data på *protokollsidan* och sporadiskt utbyter extra TLS-sessionspaket med *transport*.

source: In some situations (e.g. when the passed transport is already closing) this may return ``None``.
sv: I vissa situationer (t.ex. när den passerade transporten redan är stängd) kan detta returnera ``None``.

source: *transport* and *protocol* instances that methods like :meth:`~loop.create_server` and :meth:`~loop.create_connection` return.
sv: *transport* och *protocol* instanser som metoder som :meth:`~loop.create_server` och :meth:`~loop.create_connection` returnerar.

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
sv: *sslcontext*: en konfigurerad instans av :class:`~ssl.SSLContext`.

source: *server_side* pass ``True`` when a server-side connection is being upgraded (like the one created by :meth:`~loop.create_server`).
sv: *server_side* passerar ``True`` när en anslutning på serversidan uppgraderas (som den som skapades av :meth:`~loop.create_server`).

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
sv: *server_hostname*: anger eller åsidosätter det värdnamn som målserverns certifikat ska matchas mot.

source: Watching file descriptors
sv: Titta på filbeskrivningar

source: Start monitoring the *fd* file descriptor for read availability and invoke *callback* with the specified arguments once *fd* is available for reading.
sv: Börja övervaka filbeskrivaren *fd* för lästillgänglighet och anropa *callback* med de angivna argumenten när *fd* är tillgänglig för läsning.

source: Any preexisting callback registered for *fd* is cancelled and replaced by *callback*.
sv: Eventuella tidigare registrerade callbacks för *fd* avbryts och ersätts av *callback*.

source: Stop monitoring the *fd* file descriptor for read availability. Returns ``True`` if *fd* was previously being monitored for reads.
sv: Slutar övervaka filbeskrivaren *fd* för lästillgänglighet. Returnerar ``True`` om *fd* tidigare övervakades för läsningar.

source: Start monitoring the *fd* file descriptor for write availability and invoke *callback* with the specified arguments once *fd* is available for writing.
sv: Börja övervaka filbeskrivaren *fd* för skrivtillgänglighet och anropa *callback* med de angivna argumenten när *fd* är tillgänglig för skrivning.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *callback*.
sv: Använd :func:`functools.partial` :ref:`för att skicka nyckelordsargument <asyncio-pass-keywords>` till *callback*.

source: Stop monitoring the *fd* file descriptor for write availability. Returns ``True`` if *fd* was previously being monitored for writes.
sv: Slutar övervaka filbeskrivaren *fd* för skrivtillgänglighet. Returnerar ``True`` om *fd* tidigare övervakades för skrivningar.

source: See also :ref:`Platform Support <asyncio-platform-support>` section for some limitations of these methods.
sv: Se även :ref:``Platformstöd <asyncio-platform-support>` för vissa begränsningar av dessa metoder.

source: Working with socket objects directly
sv: Arbeta direkt med socket-objekt

source: In general, protocol implementations that use transport-based APIs such as :meth:`loop.create_connection` and :meth:`loop.create_server` are faster than implementations that work with sockets directly. However, there are some use cases when performance is not critical, and working with :class:`~socket.socket` objects directly is more convenient.
sv: I allmänhet är protokollimplementeringar som använder transportbaserade API:er som :meth:`loop.create_connection` och :meth:`loop.create_server` snabbare än implementeringar som arbetar direkt med sockets. Det finns dock vissa användningsfall när prestanda inte är avgörande och det är bekvämare att arbeta med :class:`~socket.socket`-objekt direkt.

source: Receive up to *nbytes* from *sock*. Asynchronous version of :meth:`socket.recv() <socket.socket.recv>`.
sv: Ta emot upp till *nbytes* från *sock*. Asynkron version av :meth:`socket.recv() <socket.socket.recv>`.

source: Return the received data as a bytes object.
sv: Returnerar den mottagna datan som ett bytesobjekt.

source: *sock* must be a non-blocking socket.
sv: *sock* måste vara ett icke-blockerande uttag.

source: Even though this method was always documented as a coroutine method, releases before Python 3.7 returned a :class:`Future`. Since Python 3.7 this is an ``async def`` method.
sv: Även om den här metoden alltid har dokumenterats som en coroutine-metod, returnerade utgåvor före Python 3.7 en :class:`Future`. Sedan Python 3.7 är detta en ``async def``-metod.

source: Receive data from *sock* into the *buf* buffer. Modeled after the blocking :meth:`socket.recv_into() <socket.socket.recv_into>` method.
sv: Tar emot data från *sock* till bufferten *buf*. Modellerad efter den blockerande :meth:`socket.recv_into() <socket.socket.recv_into>`-metoden.

source: Return the number of bytes written to the buffer.
sv: Returnerar antalet bytes som skrivits till bufferten.

source: Receive a datagram of up to *bufsize* from *sock*. Asynchronous version of :meth:`socket.recvfrom() <socket.socket.recvfrom>`.
sv: Ta emot ett datagram på upp till *bufsize* från *sock*. Asynkron version av :meth:`socket.recvfrom() <socket.socket.recvfrom>`.

source: Return a tuple of (received data, remote address).
sv: Returnera en tupel av (mottagna data, fjärradress).

source: Receive a datagram of up to *nbytes* from *sock* into *buf*. Asynchronous version of :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.
sv: Ta emot ett datagram på upp till *nbytes* från *sock* till *buf*. Asynkron version av :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.

source: Return a tuple of (number of bytes received, remote address).
sv: Returnera en tupel av (antal mottagna byte, fjärradress).

source: Send *data* to the *sock* socket. Asynchronous version of :meth:`socket.sendall() <socket.socket.sendall>`.
sv: Skicka *data* till *sock* socket. Asynkron version av :meth:`socket.sendall() <socket.socket.sendall>`.

source: This method continues to send to the socket until either all data in *data* has been sent or an error occurs. ``None`` is returned on success. On error, an exception is raised. Additionally, there is no way to determine how much data, if any, was successfully processed by the receiving end of the connection.
sv: Denna metod fortsätter att skicka till uttaget tills antingen all data i *data* har skickats eller ett fel inträffar. ``None`` returneras vid framgång. Vid fel uppstår ett undantag. Dessutom finns det inget sätt att avgöra hur mycket data, om någon, som framgångsrikt behandlades av den mottagande änden av anslutningen.

source: Even though the method was always documented as a coroutine method, before Python 3.7 it returned a :class:`Future`. Since Python 3.7, this is an ``async def`` method.
sv: Även om metoden alltid dokumenterats som en coroutine-metod, returnerade den före Python 3.7 en :class:`Future`. Sedan Python 3.7 är detta en ``async def``-metod.

source: Send a datagram from *sock* to *address*. Asynchronous version of :meth:`socket.sendto() <socket.socket.sendto>`.
sv: Skicka ett datagram från *sock* till *address*. Asynkron version av :meth:`socket.sendto() <socket.socket.sendto>`.

source: Return the number of bytes sent.
sv: Returnera antalet bytes som skickats.

source: Connect *sock* to a remote socket at *address*.
sv: Anslut *sock* till en fjärrsockel på *address*.

source: Asynchronous version of :meth:`socket.connect() <socket.socket.connect>`.
sv: Asynkron version av :meth:`socket.connect() <socket.socket.connect>`.

source: ``address`` no longer needs to be resolved. ``sock_connect`` will try to check if the *address* is already resolved by calling :func:`socket.inet_pton`. If not, :meth:`loop.getaddrinfo` will be used to resolve the *address*.
sv: ``address`` behöver inte längre lösas. ``sock_connect`` kommer att försöka kontrollera om *adressen* redan är löst genom att anropa :func:`socket.inet_pton`. Om inte, kommer :meth:`loop.getaddrinfo` att användas för att lösa upp *adressen*.

source: :meth:`loop.create_connection` and :func:`asyncio.open_connection() <open_connection>`.
sv: :meth:`loop.create_connection` och :func:`asyncio.open_connection() <open_connection>`.

source: Accept a connection. Modeled after the blocking :meth:`socket.accept() <socket.socket.accept>` method.
sv: Acceptera en anslutning. Modellerad efter den blockerande :meth:`socket.accept() <socket.socket.accept>`-metoden.

source: The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
sv: Uttaget måste vara bundet till en adress och lyssna efter anslutningar. Returvärdet är ett par ``(conn, address)`` där *conn* är ett *nytt* socketobjekt som kan användas för att skicka och ta emot data på anslutningen och *address* är den adress som är bunden till sockeln i andra änden av anslutningen.

source: :meth:`loop.create_server` and :func:`start_server`.
sv: :meth:`loop.create_server` och :func:`start_server`.

source: Send a file using high-performance :mod:`os.sendfile` if possible. Return the total number of bytes sent.
sv: Skicka en fil med hjälp av högpresterande :mod:`os.sendfile` om möjligt. Returnerar det totala antalet bytes som skickats.

source: Asynchronous version of :meth:`socket.sendfile() <socket.socket.sendfile>`.
sv: Asynkron version av :meth:`socket.sendfile() <socket.socket.sendfile>`.

source: *sock* must be a non-blocking :const:`socket.SOCK_STREAM` :class:`~socket.socket`.
sv: *sock* måste vara en icke-blockerande :const:`socket.SOCK_STREAM` :class:`~socket.socket`.

source: *file* must be a regular file object open in binary mode.
sv: *file* måste vara ett vanligt filobjekt som öppnas i binärt läge.

source: *fallback*, when set to ``True``, makes asyncio manually read and send the file when the platform does not support the sendfile syscall (e.g. Windows or SSL socket on Unix).
sv: *fallback*, när den är inställd på ``True``, gör att asyncio manuellt läser och skickar filen när plattformen inte stöder sendfile syscall (t.ex. Windows eller SSL-socket på Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support *sendfile* syscall and *fallback* is ``False``.
sv: Utlöser :exc:`SendfileNotAvailableError` om systemet inte stöder syscall *sendfile* och *fallback* är ``False``.

source: Asynchronous version of :meth:`socket.getaddrinfo`.
sv: Asynkron version av :meth:`socket.getaddrinfo`.

source: Asynchronous version of :meth:`socket.getnameinfo`.
sv: Asynkron version av :meth:`socket.getnameinfo`.

source: Both *getaddrinfo* and *getnameinfo* internally utilize their synchronous versions through the loop's default thread pool executor. When this executor is saturated, these methods may experience delays, which higher-level networking libraries may report as increased timeouts. To mitigate this, consider using a custom executor for other user tasks, or setting a default executor with a larger number of workers.
sv: Både *getaddrinfo* och *getnameinfo* använder internt sina synkrona versioner via loopens standardtrådpoolsexekverare. När denna exekverare är mättad kan dessa metoder uppleva fördröjningar, vilket nätverksbibliotek på högre nivå kan rapportera som ökade tidsavbrott. För att mildra detta bör du överväga att använda en anpassad exekverare för andra användaruppgifter eller ställa in en standardexekverare med ett större antal arbetare.

source: Both *getaddrinfo* and *getnameinfo* methods were always documented to return a coroutine, but prior to Python 3.7 they were, in fact, returning :class:`asyncio.Future` objects. Starting with Python 3.7 both methods are coroutines.
sv: Både metoderna *getaddrinfo* och *getnameinfo* har alltid dokumenterats att returnera en coroutine, men före Python 3.7 returnerade de i själva verket :class:`asyncio.Future`-objekt. Från och med Python 3.7 är båda metoderna coroutines.

source: Working with pipes
sv: Arbeta med rör

source: Register the read end of *pipe* in the event loop.
sv: Registrera lässlutet av *pipe* i händelseslingan.

source: *pipe* is a :term:`file-like object <file object>`.
sv: *pipe* är en :term:`filliknande objekt <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports the :class:`ReadTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
sv: Returnerar paret ``(transport, protocol)``, där *transport* stöder gränssnittet :class:`ReadTransport` och *protocol* är ett objekt som instantierats av *protocol_factory*.

source: With :class:`SelectorEventLoop` event loop, the *pipe* is set to non-blocking mode.
sv: Med :class:`SelectorEventLoop` händelseslinga är *pipe* inställd på icke-blockerande läge.

source: Register the write end of *pipe* in the event loop.
sv: Registrera den skrivande änden av *pipe* i händelseslingan.

source: *pipe* is :term:`file-like object <file object>`.
sv: *pipe* är :term:`filliknande objekt <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports :class:`WriteTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
sv: Returnerar paret ``(transport, protocol)``, där *transport* stöder :class:`WriteTransport`-gränssnittet och *protocol* är ett objekt som instantierats av *protocol_factory*.

source: :class:`SelectorEventLoop` does not support the above methods on Windows. Use :class:`ProactorEventLoop` instead for Windows.
sv: :class:`SelectorEventLoop` har inte stöd för ovanstående metoder i Windows. Använd :class:`ProactorEventLoop` istället för Windows.

source: The :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
sv: Metoderna :meth:`loop.subprocess_exec` och :meth:`loop.subprocess_shell`.

source: Unix signals
sv: Unix-signaler

source: Set *callback* as the handler for the *signum* signal.
sv: Ställ in *callback* som hanterare av signalen *signum*.
