Repository: yeager/python-docs-sv
Catalog: library/asyncio-task.po
Languages: sv

source: Setting the delay to 0 provides an optimized path to allow other tasks to run. This can be used by long-running functions to avoid blocking the event loop for the full duration of the function call.
sv: Om du ställer in fördröjningen till 0 får du en optimerad väg så att andra uppgifter kan köras. Detta kan användas av funktioner som körs under lång tid för att undvika att blockera händelseslingan under hela funktionsanropet.

source: Example of coroutine displaying the current date every second for 5 seconds::
sv: Exempel på coroutine som visar aktuellt datum varannan sekund i 5 sekunder::

source: import asyncio import datetime async def display_date(): loop = asyncio.get_running_loop() end_time = loop.time() + 5.0 while True: print(datetime.datetime.now()) if (loop.time() + 1.0) >= end_time: break await asyncio.sleep(1) asyncio.run(display_date())
sv: import asyncio import datetime async def display_date(): loop = asyncio.get_running_loop() end_time = loop.time() + 5.0 medan True: print(datetime.datetime.now()) if (loop.time() + 1.0) >= end_time: break await asyncio.sleep(1) asyncio.run(display_date())

source: Removed the *loop* parameter.
sv: Parametern *loop* har tagits bort.

source: Raises :exc:`ValueError` if *delay* is :data:`~math.nan`.
sv: Utlöser :exc:`ValueError` om *delay* är :data:`~math.nan`.

source: Running Tasks Concurrently
sv: Köra uppgifter samtidigt

source: Run :ref:`awaitable objects <asyncio-awaitables>` in the *aws* sequence *concurrently*.
sv: Kör :ref:`awaitable objects <asyncio-awaitables>` i *aws*-sekvensen *samtidigt*.

source: If any awaitable in *aws* is a coroutine, it is automatically scheduled as a Task.
sv: Om någon awaitable i *aws* är en coroutine schemaläggs den automatiskt som en Task.

source: If all awaitables are completed successfully, the result is an aggregate list of returned values. The order of result values corresponds to the order of awaitables in *aws*.
sv: Om alla awaitables har slutförts framgångsrikt är resultatet en aggregerad lista över returnerade värden. Ordningen på resultatvärdena motsvarar ordningen på awaitables i *aws*.

source: If *return_exceptions* is ``False`` (default), the first raised exception is immediately propagated to the task that awaits on ``gather()``. Other awaitables in the *aws* sequence **won't be cancelled** and will continue to run.
sv: Om *return_exceptions* är ``False`` (standard), kommer det första undantaget som uppstår omedelbart att överföras till den uppgift som väntar på ``gather()``. Andra awaitables i *aws*-sekvensen **avbryts inte** och fortsätter att köras.

source: If *return_exceptions* is ``True``, exceptions are treated the same as successful results, and aggregated in the result list.
sv: Om *return_exceptions* är ``True``, behandlas undantag på samma sätt som lyckade resultat och sammanställs i resultatlistan.

source: If ``gather()`` is *cancelled*, all submitted awaitables (that have not completed yet) are also *cancelled*.
sv: Om ``gather()`` är *avbruten*, är alla inskickade awaitables (som inte har slutförts ännu) också *avbrutna*.

source: If any Task or Future from the *aws* sequence is *cancelled*, it is treated as if it raised :exc:`CancelledError` -- the ``gather()`` call is **not** cancelled in this case. This is to prevent the cancellation of one submitted Task/Future to cause other Tasks/Futures to be cancelled.
sv: Om någon uppgift eller framtid från *aws*-sekvensen *annulleras*, behandlas den som om den gav upphov till :exc:`CancelledError` -- anropet ``gather()`` annulleras **inte** i detta fall. Detta för att förhindra att avbrytandet av en inskickad Task/Future orsakar avbrytande av andra Tasks/Futures.

source: A new alternative to create and run tasks concurrently and wait for their completion is :class:`asyncio.TaskGroup`. *TaskGroup* provides stronger safety guarantees than *gather* for scheduling a nesting of subtasks: if a task (or a subtask, a task scheduled by a task) raises an exception, *TaskGroup* will, while *gather* will not, cancel the remaining scheduled tasks).
sv: Ett nytt alternativ för att skapa och köra uppgifter samtidigt och vänta på att de ska slutföras är :class:`asyncio.TaskGroup`. *TaskGroup* ger starkare säkerhetsgarantier än *gather* för schemaläggning av en nestning av underuppgifter: om en uppgift (eller en underuppgift, en uppgift som schemaläggs av en uppgift) ger upphov till ett undantag kommer *TaskGroup*, medan *gather* inte gör det, att avbryta de återstående schemalagda uppgifterna).

source: If *return_exceptions* is false, cancelling gather() after it has been marked done won't cancel any submitted awaitables. For instance, gather can be marked done after propagating an exception to the caller, therefore, calling ``gather.cancel()`` after catching an exception (raised by one of the awaitables) from gather won't cancel any other awaitables.
sv: Om *return_exceptions* är false, kommer en avbrytning av gather() efter att den har markerats som utförd inte att avbryta några inlämnade awaitables. Till exempel kan gather markeras som utförd efter att ett undantag har spridits till den som anropar, därför kommer inte anrop av ``gather.cancel()`` efter att ett undantag har fångats upp (av en av awaitables) från gather att avbryta någon annan awaitable.

source: If the *gather* itself is cancelled, the cancellation is propagated regardless of *return_exceptions*.
sv: Om *gather* själv avbryts, sprids avbrottet oavsett *return_exceptions*.

source: Deprecation warning is emitted if no positional arguments are provided or not all positional arguments are Future-like objects and there is no running event loop.
sv: Deprecation-varning utfärdas om inga positionella argument anges eller om inte alla positionella argument är Future-liknande objekt och det inte finns någon pågående händelseslinga.

source: A task factory for eager task execution.
sv: En uppgiftsfabrik för ivrig exekvering av uppgifter.

source: When using this factory (via :meth:`loop.set_task_factory(asyncio.eager_task_factory) <loop.set_task_factory>`), coroutines begin execution synchronously during :class:`Task` construction. Tasks are only scheduled on the event loop if they block. This can be a performance improvement as the overhead of loop scheduling is avoided for coroutines that complete synchronously.
sv: När denna fabrik används (via :meth:`loop.set_task_factory(asyncio.eager_task_factory) <loop.set_task_factory>`), börjar coroutines exekveras synkront under :class:`Task`-konstruktionen. Uppgifterna schemaläggs endast i händelseslingan om de blockeras. Detta kan förbättra prestandan eftersom overhead för schemaläggning av loopar undviks för coroutines som slutförs synkront.

source: A common example where this is beneficial is coroutines which employ caching or memoization to avoid actual I/O when possible.
sv: Ett vanligt exempel där detta är fördelaktigt är coroutines som använder caching eller memoization för att undvika faktisk I/O när det är möjligt.

source: Immediate execution of the coroutine is a semantic change. If the coroutine returns or raises, the task is never scheduled to the event loop. If the coroutine execution blocks, the task is scheduled to the event loop. This change may introduce behavior changes to existing applications. For example, the application's task execution order is likely to change.
sv: Omedelbar exekvering av coroutinen är en semantisk förändring. Om coroutinen returnerar eller höjer, schemaläggs aldrig uppgiften till händelseslingan. Om coroutine-exekveringen blockeras schemaläggs uppgiften till händelseslingan. Denna förändring kan medföra beteendeförändringar i befintliga applikationer. Till exempel kommer applikationens exekveringsordning för uppgifter sannolikt att ändras.

source: Create an eager task factory, similar to :func:`eager_task_factory`, using the provided *custom_task_constructor* when creating a new task instead of the default :class:`Task`.
sv: Skapa en fabrik för ivriga uppgifter, liknande :func:`eager_task_factory`, som använder den medföljande *custom_task_constructor* när en ny uppgift skapas istället för standard :class:`Task`.

source: *custom_task_constructor* must be a *callable* with the signature matching the signature of :class:`Task.__init__ <Task>`. The callable must return a :class:`asyncio.Task`-compatible object.
sv: *custom_task_constructor* måste vara en *kallbar* med en signatur som matchar signaturen för :class:`Task.__init__ <Task>`. Anropsbarheten måste returnera ett :class:`asyncio.Task`-kompatibelt objekt.

source: This function returns a *callable* intended to be used as a task factory of an event loop via :meth:`loop.set_task_factory(factory) <loop.set_task_factory>`).
sv: Denna funktion returnerar en *kallbar* som är avsedd att användas som en uppgiftsfabrik för en händelseslinga via :meth:`loop.set_task_factory(factory) <loop.set_task_factory>`).

source: Shielding From Cancellation
sv: Avskärmning från annullering

source: Protect an :ref:`awaitable object <asyncio-awaitables>` from being :meth:`cancelled <Task.cancel>`.
sv: Skydda ett :ref:`awaitable object <asyncio-awaitables>` från att bli :meth:`cancelled <Task.cancel>`.

source: If *aw* is a coroutine it is automatically scheduled as a Task.
sv: Om *aw* är en coroutine schemaläggs den automatiskt som en Task.

source: The statement::
sv: Uttalandet::

source: task = asyncio.create_task(something()) res = await shield(task)
sv: uppgift = asyncio.create_task(något()) res = await shield(uppgift)

source: is equivalent to::
sv: är likvärdig med::

source: res = await something()
sv: res = vänta på något()

source: *except* that if the coroutine containing it is cancelled, the Task running in ``something()`` is not cancelled. From the point of view of ``something()``, the cancellation did not happen. Although its caller is still cancelled, so the "await" expression still raises a :exc:`CancelledError`.
sv: *utom* att om coroutinen som innehåller den avbryts, avbryts inte den Task som körs i ``något()``. Ur ``något()`` synvinkel skedde inte avbrytandet. Även om dess anropare fortfarande avbryts, så ger "await"-uttrycket fortfarande upphov till ett :exc:`CancelledError`.

source: If ``something()`` is cancelled by other means (i.e. from within itself) that would also cancel ``shield()``.
sv: Om ``något()`` upphävs på annat sätt (dvs. inifrån sig själv) skulle det också upphäva ``sköld()``.

source: If it is desired to completely ignore cancellation (not recommended) the ``shield()`` function should be combined with a try/except clause, as follows::
sv: Om man vill ignorera annulleringen helt (rekommenderas inte) bör funktionen ``shield()`` kombineras med en try/except-sats enligt följande::

source: task = asyncio.create_task(something()) try: res = await shield(task) except CancelledError: res = None
sv: uppgift = asyncio.create_task(något()) försök: res = await shield(uppgift) except CancelledError: res = Ingen

source: Save a reference to tasks passed to this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done.
sv: Spara en referens till uppgifter som skickas till denna funktion, för att undvika att en uppgift försvinner mitt under utförandet. Händelseslingan behåller bara svaga referenser till uppgifter. En uppgift som inte refereras någon annanstans kan när som helst bli skräpinsamlad, även innan den är klar.

source: Deprecation warning is emitted if *aw* is not Future-like object and there is no running event loop.
sv: Deprecation-varning utfärdas om *aw* inte är ett Future-like-objekt och det inte finns någon pågående händelseslinga.

source: Timeouts
sv: Tidsfrister

source: Return an :ref:`asynchronous context manager <async-context-managers>` that can be used to limit the amount of time spent waiting on something.
sv: Returnerar en :ref:``asynkron kontexthanterare <async-context-managers>`` som kan användas för att begränsa den tid det tar att vänta på något.

source: *delay* can either be ``None``, or a float/int number of seconds to wait. If *delay* is ``None``, no time limit will be applied; this can be useful if the delay is unknown when the context manager is created.
sv: *delay* kan antingen vara ``None``, eller ett float/int antal sekunder att vänta. Om *delay* är ``None`` kommer ingen tidsgräns att tillämpas; detta kan vara användbart om fördröjningen är okänd när kontexthanteraren skapas.

source: In either case, the context manager can be rescheduled after creation using :meth:`Timeout.reschedule`.
sv: I båda fallen kan kontexthanteraren omplaneras efter skapandet med hjälp av :meth:`Timeout.reschedule`.

source: async def main(): async with asyncio.timeout(10): await long_running_task()
sv: async def main(): async med asyncio.timeout(10): await long_running_task()

source: If ``long_running_task`` takes more than 10 seconds to complete, the context manager will cancel the current task and handle the resulting :exc:`asyncio.CancelledError` internally, transforming it into a :exc:`TimeoutError` which can be caught and handled.
sv: Om ``long_running_task`` tar mer än 10 sekunder att slutföra kommer kontexthanteraren att avbryta den aktuella uppgiften och hantera det resulterande :exc:`asyncio.CancelledError` internt och omvandla det till ett :exc:`TimeoutError` som kan fångas upp och hanteras.

source: The :func:`asyncio.timeout` context manager is what transforms the :exc:`asyncio.CancelledError` into a :exc:`TimeoutError`, which means the :exc:`TimeoutError` can only be caught *outside* of the context manager.
sv: Kontexthanteraren :func:`asyncio.timeout` omvandlar :exc:`asyncio.CancelledError` till ett :exc:`TimeoutError`, vilket innebär att :exc:`TimeoutError` endast kan fångas *utanför* kontexthanteraren.

source: Example of catching :exc:`TimeoutError`::
sv: Exempel på att fånga :exc:`TimeoutError`::

source: async def main(): try: async with asyncio.timeout(10): await long_running_task() except TimeoutError: print("The long operation timed out, but we've handled it.") print("This statement will run regardless.")
sv: async def main(): try: async med asyncio.timeout(10): await long_running_task() except TimeoutError: print("Den långa operationen fick en timeout, men vi har hanterat det.") print("Detta uttalande kommer att köras oavsett.")

source: The context manager produced by :func:`asyncio.timeout` can be rescheduled to a different deadline and inspected.
sv: Den kontexthanterare som produceras av :func:`asyncio.timeout` kan schemaläggas om till en annan deadline och inspekteras.

source: An :ref:`asynchronous context manager <async-context-managers>` for cancelling overdue coroutines.
sv: En :ref:``asynkron kontexthanterare <async-context-managers>` för att avbryta försenade coroutines.

source: ``when`` should be an absolute time at which the context should time out, as measured by the event loop's clock:
sv: ``when`` ska vara en absolut tidpunkt då kontexten ska ta slut, mätt med händelseslingans klocka:

source: If ``when`` is ``None``, the timeout will never trigger.
sv: Om ``when`` är ``None`` kommer timeouten aldrig att utlösas.

source: If ``when < loop.time()``, the timeout will trigger on the next iteration of the event loop.
sv: Om ``when < loop.time()``, kommer timeouten att utlösas vid nästa iteration av händelseslingan.

source: Return the current deadline, or ``None`` if the current deadline is not set.
sv: Returnerar den aktuella tidsfristen, eller ``None`` om den aktuella tidsfristen inte har angetts.

source: Reschedule the timeout.
sv: Flytta fram timeouten.

source: Return whether the context manager has exceeded its deadline (expired).
sv: Returnerar om kontexthanteraren har överskridit sin tidsfrist (expired).

source: async def main(): try: # We do not know the timeout when starting, so we pass ``None``. async with asyncio.timeout(None) as cm: # We know the timeout now, so we reschedule it. new_deadline = get_running_loop().time() + 10 cm.reschedule(new_deadline) await long_running_task() except TimeoutError: pass if cm.expired(): print("Looks like we haven't finished on time.")
sv: async def main(): try: # Vi vet inte timeouten när vi startar, så vi skickar ``None``. async med asyncio.timeout(None) som cm: # Vi känner till tidsgränsen nu, så vi flyttar den. new_deadline = get_running_loop().time() + 10 cm.reschedule(ny_deadline) await long_running_task() utom TimeoutError: passera if cm.expired(): print("Det ser ut som om vi inte blev klara i tid.")

source: Timeout context managers can be safely nested.
sv: Timeout-kontexthanterare kan säkert nästlas.

source: Similar to :func:`asyncio.timeout`, except *when* is the absolute time to stop waiting, or ``None``.
sv: Liknar :func:`asyncio.timeout`, förutom att *when* är den absoluta tiden för att sluta vänta, eller ``None``.

source: async def main(): loop = get_running_loop() deadline = loop.time() + 20 try: async with asyncio.timeout_at(deadline): await long_running_task() except TimeoutError: print("The long operation timed out, but we've handled it.") print("This statement will run regardless.")
sv: async def main(): loop = get_running_loop() deadline = loop.tid() + 20 försök: async med asyncio.timeout_at(deadline): await long_running_task() except TimeoutError: print("Den långa operationen timade ut, men vi har hanterat det.") print("Detta uttalande kommer att köras oavsett.")

source: Wait for the *aw* :ref:`awaitable <asyncio-awaitables>` to complete with a timeout.
sv: Vänta på att *aw* :ref:`awaitable <asyncio-awaitables>` ska slutföras med en timeout.

source: *timeout* can either be ``None`` or a float or int number of seconds to wait for. If *timeout* is ``None``, block until the future completes.
sv: *timeout* kan antingen vara ``None`` eller ett float eller int antal sekunder att vänta på. Om *timeout* är ``None``, blockeras tills framtiden är klar.

source: If a timeout occurs, it cancels the task and raises :exc:`TimeoutError`.
sv: Om en timeout inträffar avbryts uppgiften och :exc:`TimeoutError` visas.

source: To avoid the task :meth:`cancellation <Task.cancel>`, wrap it in :func:`shield`.
sv: För att undvika uppgiften :meth:`cancellation <Task.cancel>`, linda in den i :func:`shield`.

source: The function will wait until the future is actually cancelled, so the total wait time may exceed the *timeout*. If an exception happens during cancellation, it is propagated.
sv: Funktionen kommer att vänta tills framtiden faktiskt avbryts, så den totala väntetiden kan överstiga *timeout*. Om ett undantag inträffar under annulleringen sprids det.

source: If the wait is cancelled, the future *aw* is also cancelled.
sv: Om väntan avbryts, avbryts också den framtida *aw*.

source: async def eternity(): # Sleep for one hour await asyncio.sleep(3600) print('yay!') async def main(): # Wait for at most 1 second try: await asyncio.wait_for(eternity(), timeout=1.0) except TimeoutError: print('timeout!') asyncio.run(main()) # Expected output: # # timeout!
sv: async def evighet(): # Sova i en timme await asyncio.sleep(3600) print('yay!') async def main(): # Vänta i högst 1 sekund försök: await asyncio.wait_for(evighet(), timeout=1.0) except TimeoutError: print('timeout!') asyncio.run(main()) # Förväntad utgång: # # timeout!

source: When *aw* is cancelled due to a timeout, ``wait_for`` waits for *aw* to be cancelled. Previously, it raised :exc:`TimeoutError` immediately.
sv: När *aw* avbryts på grund av en timeout, väntar ``wait_for`` på att *aw* ska avbrytas. Tidigare gav det upphov till :exc:`TimeoutError` omedelbart.

source: Raises :exc:`TimeoutError` instead of :exc:`asyncio.TimeoutError`.
sv: Utlöser :exc:`TimeoutError` istället för :exc:`asyncio.TimeoutError`.

source: Waiting Primitives
sv: Primitiva väntetider

source: Run :class:`~asyncio.Future` and :class:`~asyncio.Task` instances in the *aws* iterable concurrently and block until the condition specified by *return_when*.
sv: Kör :class:`~asyncio.Future` och :class:`~asyncio.Task`-instanser i *aws*-iterabeln samtidigt och blockera till det villkor som anges av *return_when*.

source: The *aws* iterable must not be empty.
sv: *aws*-iterabeln får inte vara tom.

source: Returns two sets of Tasks/Futures: ``(done, pending)``.
sv: Returnerar två uppsättningar av Tasks/Futures: ``(utförd, väntande)``.

source: Usage::
sv: Användning::

source: *timeout* (a float or int), if specified, can be used to control the maximum number of seconds to wait before returning.
sv: *timeout* (en float eller int), om den anges, kan användas för att styra det maximala antalet sekunder som ska väntas innan återgång.

source: Note that this function does not raise :exc:`TimeoutError`. Futures or Tasks that aren't done when the timeout occurs are simply returned in the second set.
sv: Observera att denna funktion inte ger upphov till :exc:`TimeoutError`. Futures eller Tasks som inte är klara när timeouten inträffar returneras helt enkelt i den andra uppsättningen.

source: *return_when* indicates when this function should return. It must be one of the following constants:
sv: *return_when* anger när denna funktion ska returnera. Den måste vara en av följande konstanter:

source: Constant
sv: Konstant

source: Description
sv: Beskrivning

source: The function will return when any future finishes or is cancelled.
sv: Funktionen kommer att återkomma när någon framtid avslutas eller avbryts.

source: The function will return when any future finishes by raising an exception. If no future raises an exception then it is equivalent to :const:`ALL_COMPLETED`.
sv: Funktionen återkommer när en framtid avslutas genom att ett undantag utlöses. Om ingen framtid ger upphov till ett undantag så är det likvärdigt med :const:`ALL_COMPLETED`.

source: The function will return when all futures finish or are cancelled.
sv: Funktionen återkommer när alla terminer är avslutade eller avbrutna.

source: Unlike :func:`~asyncio.wait_for`, ``wait()`` does not cancel the futures when a timeout occurs.
sv: Till skillnad från :func:`~asyncio.wait_for` avbryter inte ``wait()`` futures när en timeout inträffar.

source: Passing coroutine objects to ``wait()`` directly is forbidden.
sv: Det är förbjudet att skicka coroutine-objekt direkt till ``wait()``.

source: Added support for generators yielding tasks.
sv: Stöd för generatorer som ger uppgifter har lagts till.

source: Run :ref:`awaitable objects <asyncio-awaitables>` in the *aws* iterable concurrently. The returned object can be iterated to obtain the results of the awaitables as they finish.
sv: Kör :ref:``awaitable objects <asyncio-awaitables>`` i *aws*-iterabeln samtidigt. Det returnerade objektet kan itereras för att få resultaten från awaitables när de avslutas.

source: The object returned by ``as_completed()`` can be iterated as an :term:`asynchronous iterator` or a plain :term:`iterator`. When asynchronous iteration is used, the originally-supplied awaitables are yielded if they are tasks or futures. This makes it easy to correlate previously-scheduled tasks with their results. Example::
sv: Objektet som returneras av ``as_completed()`` kan itereras som en :term:`asynkron iterator` eller en vanlig :term:`iterator`. När asynkron iteration används, blir de ursprungligen levererade awaitables yielded om de är tasks eller futures. Detta gör det enkelt att korrelera tidigare schemalagda uppgifter med deras resultat. Exempel::
