Repository: yeager/python-docs-sv
Catalog: library/asyncio-task.po
Languages: sv

source: Coroutines and Tasks
sv: Coroutines och Tasks

source: This section outlines high-level asyncio APIs to work with coroutines and Tasks.
sv: Detta avsnitt beskriver asyncio-API:er på hög nivå för att arbeta med coroutines och Tasks.

source: **Source code:** :source:`Lib/asyncio/coroutines.py`
sv: **Källkod:** :source:`Lib/asyncio/coroutines.py`

source: :term:`Coroutines <coroutine>` declared with the async/await syntax is the preferred way of writing asyncio applications. For example, the following snippet of code prints "hello", waits 1 second, and then prints "world"::
sv: sammanfattning : term:`Coroutines <coroutine>` deklarerade med async/await-syntaxen är det föredragna sättet att skriva asyncio-applikationer. Följande kodavsnitt skriver till exempel ut "hello", väntar 1 sekund och skriver sedan ut "world"::

source: Note that simply calling a coroutine will not schedule it to be executed::
sv: Observera att det inte räcker med att anropa en coroutine för att den ska exekveras::

source: >>> main() <coroutine object main at 0x1053bb7c8>
sv: &gt;&gt;&gt; main() <coroutine object main at 0x1053bb7c8>

source: To actually run a coroutine, asyncio provides the following mechanisms:
sv: För att faktiskt köra en coroutine tillhandahåller asyncio följande mekanismer:

source: The :func:`asyncio.run` function to run the top-level entry point "main()" function (see the above example.)
sv: Funktionen :func:`asyncio.run` för att köra funktionen "main()" på den högsta nivån (se exemplet ovan)

source: Awaiting on a coroutine. The following snippet of code will print "hello" after waiting for 1 second, and then print "world" after waiting for *another* 2 seconds::
sv: Väntar på en coroutine. Följande kodavsnitt kommer att skriva ut "hello" efter att ha väntat i 1 sekund, och sedan skriva ut "world" efter att ha väntat i *ytterligare* 2 sekunder::

source: Expected output::
sv: Förväntad utgång::

source: started at 17:13:52 hello world finished at 17:13:55
sv: började kl 17:13:52 hej värld avslutat kl. 17:13:55

source: The :func:`asyncio.create_task` function to run coroutines concurrently as asyncio :class:`Tasks <Task>`.
sv: Funktionen :func:`asyncio.create_task` för att köra coroutines samtidigt som asyncio :class:`Tasks <Task>`.

source: Let's modify the above example and run two ``say_after`` coroutines *concurrently*::
sv: Låt oss modifiera exemplet ovan och köra två ``say_after`` coroutines *samtidigt*::

source: async def main(): task1 = asyncio.create_task( say_after(1, 'hello')) task2 = asyncio.create_task( say_after(2, 'world')) print(f"started at {time.strftime('%X')}") # Wait until both tasks are completed (should take # around 2 seconds.) await task1 await task2 print(f"finished at {time.strftime('%X')}")
sv: async def main(): uppgift1 = asyncio.create_task( say_after(1, 'hej')) uppgift2 = asyncio.create_task( say_after(2, 'värld')) print(f"startade vid {time.strftime('%X')}") # Vänta tills båda uppgifterna är slutförda (bör ta # cirka 2 sekunder.) vänta uppgift1 vänta uppgift2 print(f"klar vid {time.strftime('%X')}")

source: Note that expected output now shows that the snippet runs 1 second faster than before::
sv: Observera att den förväntade utdata nu visar att utdraget körs 1 sekund snabbare än tidigare::

source: started at 17:14:32 hello world finished at 17:14:34
sv: började kl 17:14:32 hej värld avslutat kl. 17:14:34

source: The :class:`asyncio.TaskGroup` class provides a more modern alternative to :func:`create_task`. Using this API, the last example becomes::
sv: Klassen :class:`asyncio.TaskGroup` ger ett mer modernt alternativ till :func:`create_task`. Med hjälp av detta API blir det sista exemplet::

source: async def main(): async with asyncio.TaskGroup() as tg: task1 = tg.create_task( say_after(1, 'hello')) task2 = tg.create_task( say_after(2, 'world')) print(f"started at {time.strftime('%X')}") # The await is implicit when the context manager exits. print(f"finished at {time.strftime('%X')}")
sv: async def main(): async med asyncio.TaskGroup() som tg: uppgift1 = tg.create_task( say_after(1, 'hej')) uppgift2 = tg.create_task( say_after(2, 'värld')) print(f"startade vid {time.strftime('%X')}") # Await är implicit när kontexthanteraren avslutas. print(f"klar vid {time.strftime('%X')}")

source: The timing and output should be the same as for the previous version.
sv: Tidpunkten och resultatet ska vara detsamma som för den tidigare versionen.

source: Awaitables
sv: Förväntansfulla

source: We say that an object is an **awaitable** object if it can be used in an :keyword:`await` expression. Many asyncio APIs are designed to accept awaitables.
sv: Vi säger att ett objekt är ett **awaitable**-objekt om det kan användas i ett :keyword:`await`-uttryck. Många asyncio API:er är utformade för att acceptera awaitables.

source: There are three main types of *awaitable* objects: **coroutines**, **Tasks**, and **Futures**.
sv: Det finns tre huvudtyper av *awaitable*-objekt: **Koroutiner**, **Uppgifter** och **Futures**.

source: Python coroutines are *awaitables* and therefore can be awaited from other coroutines::
sv: Python coroutines är *awaitables* och kan därför väntas från andra coroutines::

source: In this documentation the term "coroutine" can be used for two closely related concepts:
sv: I den här dokumentationen kan termen "coroutine" användas för två närbesläktade begrepp:

source: a *coroutine function*: an :keyword:`async def` function;
sv: en *coroutine-funktion*: en :keyword:`async def`-funktion;

source: a *coroutine object*: an object returned by calling a *coroutine function*.
sv: ett *koroutinobjekt*: ett objekt som returneras genom anrop av en *koroutinfunktion*.

source: Tasks
sv: Uppgifter

source: *Tasks* are used to schedule coroutines *concurrently*.
sv: *Tasks* används för att schemalägga coroutines *samtidigt*.

source: When a coroutine is wrapped into a *Task* with functions like :func:`asyncio.create_task` the coroutine is automatically scheduled to run soon::
sv: När en coroutine paketeras in i en *Task* med funktioner som :func:`asyncio.create_task` schemaläggs coroutinen automatiskt för att köras snart::

source: Futures
sv: Terminskontrakt

source: A :class:`Future` is a special **low-level** awaitable object that represents an **eventual result** of an asynchronous operation.
sv: En :class:`Future` är ett speciellt **lågnivå** väntande objekt som representerar ett **eventuellt resultat** av en asynkron operation.

source: When a Future object is *awaited* it means that the coroutine will wait until the Future is resolved in some other place.
sv: När ett Future-objekt är *awaited* betyder det att coroutinen kommer att vänta tills Future-objektet har lösts upp på något annat ställe.

source: Future objects in asyncio are needed to allow callback-based code to be used with async/await.
sv: Framtida objekt i asyncio behövs för att göra det möjligt att använda callback-baserad kod med async/await.

source: Normally **there is no need** to create Future objects at the application level code.
sv: Normalt **finns det inget behov** av att skapa Future-objekt på applikationsnivå.

source: Future objects, sometimes exposed by libraries and some asyncio APIs, can be awaited::
sv: Framtida objekt, som ibland exponeras av bibliotek och vissa asyncio API:er, kan inväntas::

source: async def main(): await function_that_returns_a_future_object() # this is also valid: await asyncio.gather( function_that_returns_a_future_object(), some_python_coroutine() )
sv: async def main(): await function_that_returns_a_future_object() # detta är också giltigt: await asyncio.gather( function_that_returns_a_future_object(), någon_python_koroutin() )

source: A good example of a low-level function that returns a Future object is :meth:`loop.run_in_executor`.
sv: Ett bra exempel på en lågnivåfunktion som returnerar ett Future-objekt är :meth:`loop.run_in_executor`.

source: Creating Tasks
sv: Skapa uppgifter

source: **Source code:** :source:`Lib/asyncio/tasks.py`
sv: **Källkod:** :source:`Lib/asyncio/tasks.py`

source: Wrap the *coro* :ref:`coroutine <coroutine>` into a :class:`Task` and schedule its execution. Return the Task object.
sv: Packa in *coro* :ref:`coroutine <coroutine>` i en :class:`Task` och schemalägg dess exekvering. Returnera Task-objektet.

source: The full function signature is largely the same as that of the :class:`Task` constructor (or factory) - all of the keyword arguments to this function are passed through to that interface.
sv: Den fullständiga funktionssignaturen är i stort sett densamma som för :class:`Task`-konstruktören (eller fabriken) - alla nyckelordsargument till denna funktion skickas vidare till det gränssnittet.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
sv: Ett valfritt argument *context* med endast nyckelord gör det möjligt att ange en anpassad :class:`contextvars.Context` som *coro* ska köras i. Den aktuella kontextkopian skapas när ingen *kontext* anges.

source: An optional keyword-only *eager_start* argument allows specifying if the task should execute eagerly during the call to create_task, or be scheduled later. If *eager_start* is not passed the mode set by :meth:`loop.set_task_factory` will be used.
sv: Ett valfritt argument *eager_start*, som endast innehåller nyckelord, gör det möjligt att ange om uppgiften ska utföras ivrigt under anropet till create_task eller schemaläggas senare. Om *eager_start* inte anges kommer det läge som anges av :meth:`loop.set_task_factory` att användas.

source: The task is executed in the loop returned by :func:`get_running_loop`, :exc:`RuntimeError` is raised if there is no running loop in current thread.
sv: Uppgiften utförs i den loop som returneras av :func:`get_running_loop`, :exc:`RuntimeError` uppstår om det inte finns någon loop i den aktuella tråden.

source: :meth:`asyncio.TaskGroup.create_task` is a new alternative leveraging structural concurrency; it allows for waiting for a group of related tasks with strong safety guarantees.
sv: :meth:`asyncio.TaskGroup.create_task` är ett nytt alternativ som utnyttjar strukturell samtidighet; det gör det möjligt att vänta på en grupp relaterade uppgifter med starka säkerhetsgarantier.

source: Save a reference to the result of this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done. For reliable "fire-and-forget" background tasks, gather them in a collection::
sv: Spara en referens till resultatet av denna funktion för att undvika att en uppgift försvinner mitt under utförandet. Händelseslingan behåller bara svaga referenser till uppgifter. En uppgift som inte refereras någon annanstans kan när som helst bli skräpinsamlad, till och med innan den är klar. För tillförlitliga "skjut-och-glöm"-bakgrundsuppgifter, samla dem i en samling::

source: background_tasks = set() for i in range(10): task = asyncio.create_task(some_coro(param=i)) # Add task to the set. This creates a strong reference. background_tasks.add(task) # To prevent keeping references to finished tasks forever, # make each task remove its own reference from the set after # completion: task.add_done_callback(background_tasks.discard)
sv: background_tasks = set() för i i intervall(10): uppgift = asyncio.create_task(some_coro(param=i)) # Lägg till uppgift till uppsättningen. Detta skapar en stark referens. background_tasks.add(uppgift) # För att undvika att behålla referenser till avslutade uppgifter för evigt, # varje uppgift ta bort sin egen referens från uppsättningen efter # slutförandet: task.add_done_callback(background_tasks.discard)

source: Added the *name* parameter.
sv: Parametern *name* har lagts till.

source: Added the *context* parameter.
sv: Parametern *context* har lagts till.

source: Added the *eager_start* parameter by passing on all *kwargs*.
sv: Lade till parametern *eager_start* genom att skicka vidare alla *kwargs*.

source: Task Cancellation
sv: Avbokning av uppdrag

source: Tasks can easily and safely be cancelled. When a task is cancelled, :exc:`asyncio.CancelledError` will be raised in the task at the next opportunity.
sv: Uppgifter kan enkelt och säkert avbrytas. När en uppgift avbryts kommer :exc:`asyncio.CancelledError` att skapas i uppgiften vid nästa tillfälle.

source: It is recommended that coroutines use ``try/finally`` blocks to robustly perform clean-up logic. In case :exc:`asyncio.CancelledError` is explicitly caught, it should generally be propagated when clean-up is complete. :exc:`asyncio.CancelledError` directly subclasses :exc:`BaseException` so most code will not need to be aware of it.
sv: Det rekommenderas att coroutines använder ``try/finally`` block för att robust utföra rensningslogik. Om :exc:`asyncio.CancelledError` fångas explicit, bör det i allmänhet spridas när upprensningen är klar. :exc:`asyncio.CancelledError` underklassar direkt :exc:`BaseException` så den mesta koden behöver inte vara medveten om det.

source: The asyncio components that enable structured concurrency, like :class:`asyncio.TaskGroup` and :func:`asyncio.timeout`, are implemented using cancellation internally and might misbehave if a coroutine swallows :exc:`asyncio.CancelledError`. Similarly, user code should not generally call :meth:`uncancel <asyncio.Task.uncancel>`. However, in cases when suppressing :exc:`asyncio.CancelledError` is truly desired, it is necessary to also call ``uncancel()`` to completely remove the cancellation state.
sv: De asynciokomponenter som möjliggör strukturerad samtidighet, som :class:`asyncio.TaskGroup` och :func:`asyncio.timeout`, implementeras med hjälp av annullering internt och kan bete sig illa om en coroutine sväljer :exc:`asyncio.CancelledError`. På samma sätt bör användarkod i allmänhet inte anropa :meth:`uncancel <asyncio.Task.uncancel>`. Men i de fall då det verkligen är önskvärt att undertrycka :exc:`asyncio.CancelledError`, är det nödvändigt att också anropa ``uncancel()`` för att helt ta bort annulleringstillståndet.

source: Task Groups
sv: Arbetsgrupper

source: Task groups combine a task creation API with a convenient and reliable way to wait for all tasks in the group to finish.
sv: Uppgiftsgrupper kombinerar ett API för skapande av uppgifter med ett bekvämt och tillförlitligt sätt att vänta på att alla uppgifter i gruppen ska bli klara.

source: An :ref:`asynchronous context manager <async-context-managers>` holding a group of tasks. Tasks can be added to the group using :meth:`create_task`. All tasks are awaited when the context manager exits.
sv: En :ref:``asynkron kontexthanterare <async-context-managers>`` som innehåller en grupp av uppgifter. Uppgifter kan läggas till i gruppen med :meth:`create_task`. Alla uppgifter är väntade när kontexthanteraren avslutas.

source: Create a task in this task group. The signature matches that of :func:`asyncio.create_task`. If the task group is inactive (e.g. not yet entered, already finished, or in the process of shutting down), we will close the given ``coro``.
sv: Skapa en uppgift i denna uppgiftsgrupp. Signaturen matchar den för :func:`asyncio.create_task`. Om uppgiftsgruppen är inaktiv (t.ex. ännu inte påbörjad, redan avslutad eller håller på att stängas ner), stänger vi den givna ``coro``.

source: Close the given coroutine if the task group is not active.
sv: Stäng den givna coroutinen om uppgiftsgruppen inte är aktiv.

source: Passes on all *kwargs* to :meth:`loop.create_task`
sv: Vidarebefordrar alla *kwargs* till :meth:`loop.create_task`

source: Example::
sv: Exempel::

source: async def main(): async with asyncio.TaskGroup() as tg: task1 = tg.create_task(some_coro(...)) task2 = tg.create_task(another_coro(...)) print(f"Both tasks have completed now: {task1.result()}, {task2.result()}")
sv: async def main(): async med asyncio.TaskGroup() som tg: uppgift1 = tg.create_task(någon_coro(...)) uppgift2 = tg.create_task(en annan_coro(...)) print(f"Båda uppgifterna har slutförts nu: {task1.result()}, {task2.result()}")

source: The ``async with`` statement will wait for all tasks in the group to finish. While waiting, new tasks may still be added to the group (for example, by passing ``tg`` into one of the coroutines and calling ``tg.create_task()`` in that coroutine). Once the last task has finished and the ``async with`` block is exited, no new tasks may be added to the group.
sv: Satsen ``async with`` väntar på att alla uppgifter i gruppen ska bli klara. Under väntetiden kan nya uppgifter fortfarande läggas till i gruppen (till exempel genom att skicka ``tg`` till en av coroutinerna och anropa ``tg.create_task()`` i den coroutinen). När den sista uppgiften har slutförts och ``async with``-blocket har avslutats, kan inga nya uppgifter läggas till i gruppen.

source: The first time any of the tasks belonging to the group fails with an exception other than :exc:`asyncio.CancelledError`, the remaining tasks in the group are cancelled. No further tasks can then be added to the group. At this point, if the body of the ``async with`` statement is still active (i.e., :meth:`~object.__aexit__` hasn't been called yet), the task directly containing the ``async with`` statement is also cancelled. The resulting :exc:`asyncio.CancelledError` will interrupt an ``await``, but it will not bubble out of the containing ``async with`` statement.
sv: Första gången någon av de uppgifter som tillhör gruppen misslyckas med ett annat undantag än :exc:`asyncio.CancelledError`, avbryts de återstående uppgifterna i gruppen. Inga ytterligare uppgifter kan då läggas till i gruppen. Vid denna tidpunkt, om kroppen i ``async with``-satsen fortfarande är aktiv (dvs. :meth:`~object.__aexit__` har inte anropats ännu), avbryts också den uppgift som direkt innehåller ``async with``-satsen. Det resulterande :exc:`asyncio.CancelledError` kommer att avbryta en ``await``, men det kommer inte att bubbla ut från den innehållande ``async with``-satsen.

source: Once all tasks have finished, if any tasks have failed with an exception other than :exc:`asyncio.CancelledError`, those exceptions are combined in an :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup` (as appropriate; see their documentation) which is then raised.
sv: När alla uppgifter har slutförts, om några uppgifter har misslyckats med ett annat undantag än :exc:`asyncio.CancelledError`, kombineras dessa undantag i en :exc:`ExceptionGroup` eller :exc:`BaseExceptionGroup` (beroende på vad som är lämpligt; se deras dokumentation) som sedan tas upp.

source: Two base exceptions are treated specially: If any task fails with :exc:`KeyboardInterrupt` or :exc:`SystemExit`, the task group still cancels the remaining tasks and waits for them, but then the initial :exc:`KeyboardInterrupt` or :exc:`SystemExit` is re-raised instead of :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup`.
sv: Två basundantag behandlas speciellt: Om någon uppgift misslyckas med :exc:`KeyboardInterrupt` eller :exc:`SystemExit`, avbryter uppgiftsgruppen fortfarande de återstående uppgifterna och väntar på dem, men då återkallas den ursprungliga :exc:`KeyboardInterrupt` eller :exc:`SystemExit` istället för :exc:`ExceptionGroup` eller :exc:`BaseExceptionGroup`.

source: If the body of the ``async with`` statement exits with an exception (so :meth:`~object.__aexit__` is called with an exception set), this is treated the same as if one of the tasks failed: the remaining tasks are cancelled and then waited for, and non-cancellation exceptions are grouped into an exception group and raised. The exception passed into :meth:`~object.__aexit__`, unless it is :exc:`asyncio.CancelledError`, is also included in the exception group. The same special case is made for :exc:`KeyboardInterrupt` and :exc:`SystemExit` as in the previous paragraph.
sv: Om ``async with``-satsens kropp avslutas med ett undantag (så att :meth:`~object.__aexit__` anropas med en undantagsuppsättning), behandlas detta på samma sätt som om en av uppgifterna misslyckades: de återstående uppgifterna avbryts och väntar sedan, och undantag som inte avbryts grupperas i en undantagsgrupp och tas upp. Undantaget som skickas in i :meth:`~object.__aexit__`, om det inte är :exc:`asyncio.CancelledError`, ingår också i undantagsgruppen. Samma specialfall görs för :exc:`KeyboardInterrupt` och :exc:`SystemExit` som i föregående stycke.

source: Task groups are careful not to mix up the internal cancellation used to "wake up" their :meth:`~object.__aexit__` with cancellation requests for the task in which they are running made by other parties. In particular, when one task group is syntactically nested in another, and both experience an exception in one of their child tasks simultaneously, the inner task group will process its exceptions, and then the outer task group will receive another cancellation and process its own exceptions.
sv: Uppgiftsgrupper är noga med att inte blanda ihop den interna annullering som används för att "väcka" deras :meth:`~object.__aexit__` med andra parters annulleringsbegäran för den uppgift där de körs. I synnerhet när en uppgiftsgrupp är syntaktiskt nästlad i en annan, och båda upplever ett undantag i en av sina underordnade uppgifter samtidigt, kommer den inre uppgiftsgruppen att behandla sina undantag, och sedan kommer den yttre uppgiftsgruppen att få en annan annullering och behandla sina egna undantag.

source: In the case where a task group is cancelled externally and also must raise an :exc:`ExceptionGroup`, it will call the parent task's :meth:`~asyncio.Task.cancel` method. This ensures that a :exc:`asyncio.CancelledError` will be raised at the next :keyword:`await`, so the cancellation is not lost.
sv: I det fall en uppgiftsgrupp avbryts externt och även måste ge upphov till en :exc:`ExceptionGroup`, kommer den att anropa den överordnade uppgiftens :meth:`~asyncio.Task.cancel`-metod. Detta säkerställer att ett :exc:`asyncio.CancelledError` kommer att uppstå vid nästa :keyword:`await`, så att annulleringen inte går förlorad.

source: Task groups preserve the cancellation count reported by :meth:`asyncio.Task.cancelling`.
sv: Uppgiftsgrupper behåller antalet avbokningar som rapporteras av :meth:`asyncio.Task.cancelling`.

source: Improved handling of simultaneous internal and external cancellations and correct preservation of cancellation counts.
sv: Förbättrad hantering av samtidiga interna och externa avbeställningar och korrekt bevarande av antalet avbeställningar.

source: Terminating a Task Group
sv: Avsluta en arbetsgrupp

source: While terminating a task group is not natively supported by the standard library, termination can be achieved by adding an exception-raising task to the task group and ignoring the raised exception:
sv: Även om standardbiblioteket inte har något inbyggt stöd för att avsluta en uppgiftsgrupp, kan man göra det genom att lägga till en undantagshöjande uppgift i uppgiftsgruppen och ignorera det undantag som uppstått:

source: Expected output:
sv: Förväntad utgång:

source: Task 1: start Task 2: start Task 1: done
sv: Uppgift 1: start Uppgift 2: start Uppgift 1: klar

source: Sleeping
sv: Sovande

source: Block for *delay* seconds.
sv: Blockera i *fördröjning* sekunder.

source: If *result* is provided, it is returned to the caller when the coroutine completes.
sv: Om *result* anges returneras det till den som anropar när coroutinen avslutas.

source: ``sleep()`` always suspends the current task, allowing other tasks to run.
sv: ```sleep()`` avbryter alltid den aktuella uppgiften, så att andra uppgifter kan köras.
