Repository: yeager/python-docs-sv
Catalog: library/base64.po
Languages: sv

source: :mod:`!base64` --- Base16, Base32, Base64, Base85 Data Encodings
sv: :mod:`!base64` --- Base16, Base32, Base64, Base85 datakodningar

source: **Source code:** :source:`Lib/base64.py`
sv: **Källkod:** :source:`Lib/base64.py`

source: This module provides functions for encoding binary data to printable ASCII characters and decoding such encodings back to binary data. This includes the :ref:`encodings specified in <base64-rfc-4648>` :rfc:`4648` (Base64, Base32 and Base16) and the non-standard :ref:`Base85 encodings <base64-base-85>`.
sv: Denna modul innehåller funktioner för kodning av binära data till skrivbara ASCII-tecken och avkodning av sådana kodningar tillbaka till binära data. Detta inkluderar :ref:`-kodningarna som anges i <base64-rfc-4648>` :rfc:`4648` (Base64, Base32 och Base16) och de icke-standardiserade :ref:`Base85-kodningarna <base64-base-85>`.

source: There are two interfaces provided by this module. The modern interface supports encoding :term:`bytes-like objects <bytes-like object>` to ASCII :class:`bytes`, and decoding :term:`bytes-like objects <bytes-like object>` or strings containing ASCII to :class:`bytes`. Both base-64 alphabets defined in :rfc:`4648` (normal, and URL- and filesystem-safe) are supported.
sv: Det finns två gränssnitt i den här modulen. Det moderna gränssnittet stöder kodning av :term:`bytesliknande objekt <bytes-like object>` till ASCII :class:`bytes`, och avkodning av :term:`bytesliknande objekt <bytes-like object>` eller strängar som innehåller ASCII till :class:`bytes`. Båda base-64-alfabeten som definieras i :rfc:`4648` (normal, URL- och filsystemssäker) stöds.

source: The :ref:`legacy interface <base64-legacy>` does not support decoding from strings, but it does provide functions for encoding and decoding to and from :term:`file objects <file object>`. It only supports the Base64 standard alphabet, and it adds newlines every 76 characters as per :rfc:`2045`. Note that if you are looking for :rfc:`2045` support you probably want to be looking at the :mod:`email` package instead.
sv: Gränssnittet :ref:`legacy <base64-legacy>` stöder inte avkodning från strängar, men det innehåller funktioner för kodning och avkodning till och från :term:`filobjekt <file object>`. Det stöder endast Base64-standardalfabetet och lägger till nya rader var 76:e tecken enligt :rfc:`2045`. Observera att om du letar efter stöd för :rfc:`2045` bör du förmodligen titta på paketet :mod:`email` istället.

source: ASCII-only Unicode strings are now accepted by the decoding functions of the modern interface.
sv: Unicode-strängar som bara innehåller ASCII accepteras nu av avkodningsfunktionerna i det moderna gränssnittet.

source: Any :term:`bytes-like objects <bytes-like object>` are now accepted by all encoding and decoding functions in this module. Ascii85/Base85 support added.
sv: Alla :term:`bytesliknande objekt <bytes-like object>` accepteras nu av alla kodnings- och avkodningsfunktioner i den här modulen. Stöd för Ascii85/Base85 har lagts till.

source: RFC 4648 Encodings
sv: RFC 4648-kodningar

source: The :rfc:`4648` encodings are suitable for encoding binary data so that it can be safely sent by email, used as parts of URLs, or included as part of an HTTP POST request.
sv: Kodningarna :rfc:`4648` är lämpliga för kodning av binära data så att de kan skickas säkert via e-post, användas som delar av URL:er eller ingå som en del av en HTTP POST-begäran.

source: Encode the :term:`bytes-like object` *s* using Base64 and return the encoded :class:`bytes`.
sv: Kodar :term:`bytesliknande objekt` *s* med Base64 och returnerar den kodade :class:`bytes`.

source: Optional *altchars* must be a :term:`bytes-like object` of length 2 which specifies an alternative alphabet for the ``+`` and ``/`` characters. This allows an application to e.g. generate URL or filesystem safe Base64 strings. The default is ``None``, for which the standard Base64 alphabet is used.
sv: Det valfria *altchars* måste vara ett :term:`bytesliknande objekt` av längd 2 som anger ett alternativt alfabet för tecknen ``+`` och ``/``. Detta gör det möjligt för en applikation att t.ex. generera URL- eller filsystemssäkra Base64-strängar. Standardvärdet är ``None``, för vilket standard Base64-alfabetet används.

source: May assert or raise a :exc:`ValueError` if the length of *altchars* is not 2. Raises a :exc:`TypeError` if *altchars* is not a :term:`bytes-like object`.
sv: Kan hävda eller ge upphov till ett :exc:`ValueError` om längden på *altchars* inte är 2. Ger upphov till ett :exc:`TypeError` om *altchars* inte är ett :term:`bytesliknande objekt`.

source: Decode the Base64 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
sv: Avkodar den Base64-kodade :term:`bytesliknande objekt` eller ASCII-strängen *s* och returnerar den avkodade :class:`bytes`.

source: Optional *altchars* must be a :term:`bytes-like object` or ASCII string of length 2 which specifies the alternative alphabet used instead of the ``+`` and ``/`` characters.
sv: Valfri *altchars* måste vara en :term:`bytesliknande objekt` eller ASCII-sträng av längd 2 som anger det alternativa alfabet som används i stället för tecknen ``+`` och ``/``.

source: A :exc:`binascii.Error` exception is raised if *s* is incorrectly padded.
sv: Ett :exc:`binascii.Error`-undantag uppstår om *s* är felaktigt utfylld.

source: If *validate* is ``False`` (the default), characters that are neither in the normal base-64 alphabet nor the alternative alphabet are discarded prior to the padding check. If *validate* is ``True``, these non-alphabet characters in the input result in a :exc:`binascii.Error`.
sv: Om *validate* är ``False`` (standard), kasseras tecken som varken finns i det normala bas-64-alfabetet eller i det alternativa alfabetet före utfyllnadskontrollen. Om *validate* är ``True`` resulterar dessa icke-alfabetiska tecken i indata i ett :exc:`binascii.Error`.

source: For more information about the strict base64 check, see :func:`binascii.a2b_base64`
sv: För mer information om den strikta base64-kontrollen, se :func:`binascii.a2b_base64`

source: May assert or raise a :exc:`ValueError` if the length of *altchars* is not 2.
sv: Kan hävda eller ge upphov till ett :exc:`ValueError` om längden på *altchars* inte är 2.

source: Encode :term:`bytes-like object` *s* using the standard Base64 alphabet and return the encoded :class:`bytes`.
sv: Kodar :term:`bytesliknande objekt` *s* med hjälp av standard Base64-alfabetet och returnerar den kodade :class:`bytes`.

source: Decode :term:`bytes-like object` or ASCII string *s* using the standard Base64 alphabet and return the decoded :class:`bytes`.
sv: Avkodar :term:`bytesliknande objekt` eller ASCII-sträng *s* med hjälp av standard Base64-alfabetet och returnerar den avkodade :class:`bytes`.

source: Encode :term:`bytes-like object` *s* using the URL- and filesystem-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet, and return the encoded :class:`bytes`. The result can still contain ``=``.
sv: Kodar :term:`bytesliknande objekt` *s* med det URL- och filsystemssäkra alfabetet, som ersätter ``-`` istället för ``+`` och ``_`` istället för ``/`` i standard Base64-alfabetet, och returnerar den kodade :class:`bytes`. Resultatet kan fortfarande innehålla ``=``.

source: Decode :term:`bytes-like object` or ASCII string *s* using the URL- and filesystem-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet, and return the decoded :class:`bytes`.
sv: Avkoda :term:`bytesliknande objekt` eller ASCII-sträng *s* med URL- och filsystemssäkert alfabet, som ersätter ``-`` istället för ``+`` och ``_`` istället för ``/`` i standard Base64-alfabetet, och returnera den avkodade :class:`bytes`.

source: Encode the :term:`bytes-like object` *s* using Base32 and return the encoded :class:`bytes`.
sv: Kodar :term:`bytesliknande objekt` *s* med Base32 och returnerar den kodade :class:`bytes`.

source: Decode the Base32 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
sv: Avkodar den Base32-kodade :term:`bytesliknande objekt` eller ASCII-strängen *s* och returnerar den avkodade :class:`bytes`.

source: Optional *casefold* is a flag specifying whether a lowercase alphabet is acceptable as input. For security purposes, the default is ``False``.
sv: Valfritt *casefold* är en flagga som anger om ett alfabet med små bokstäver kan accepteras som indata. Av säkerhetsskäl är standardinställningen ``False``.

source: :rfc:`4648` allows for optional mapping of the digit 0 (zero) to the letter O (oh), and for optional mapping of the digit 1 (one) to either the letter I (eye) or letter L (el). The optional argument *map01* when not ``None``, specifies which letter the digit 1 should be mapped to (when *map01* is not ``None``, the digit 0 is always mapped to the letter O). For security purposes the default is ``None``, so that 0 and 1 are not allowed in the input.
sv: :rfc:`4648` tillåter valfri mappning av siffran 0 (noll) till bokstaven O (oh), och valfri mappning av siffran 1 (ett) till antingen bokstaven I (eye) eller bokstaven L (el). Det valfria argumentet *map01* anger, när det inte är ``None``, vilken bokstav siffran 1 ska mappas till (när *map01* inte är ``None`` mappas siffran 0 alltid till bokstaven O). Av säkerhetsskäl är standardvärdet ``None``, vilket innebär att 0 och 1 inte tillåts i indata.

source: A :exc:`binascii.Error` is raised if *s* is incorrectly padded or if there are non-alphabet characters present in the input.
sv: Ett :exc:`binascii.Error` uppstår om *s* är felaktigt utfylld eller om det finns tecken som inte är alfabetiska i indata.

source: Similar to :func:`b32encode` but uses the Extended Hex Alphabet, as defined in :rfc:`4648`.
sv: Liknar :func:`b32encode` men använder det utökade hexalfabetet, enligt definitionen i :rfc:`4648`.

source: Similar to :func:`b32decode` but uses the Extended Hex Alphabet, as defined in :rfc:`4648`.
sv: Liknar :func:`b32decode` men använder det utökade hexalfabetet, enligt definitionen i :rfc:`4648`.

source: This version does not allow the digit 0 (zero) to the letter O (oh) and digit 1 (one) to either the letter I (eye) or letter L (el) mappings, all these characters are included in the Extended Hex Alphabet and are not interchangeable.
sv: Den här versionen tillåter inte mappningar av siffran 0 (noll) till bokstaven O (oh) och siffran 1 (ett) till varken bokstaven I (eye) eller bokstaven L (el), eftersom alla dessa tecken ingår i det utökade hexalfabetet och inte är utbytbara.

source: Encode the :term:`bytes-like object` *s* using Base16 and return the encoded :class:`bytes`.
sv: Kodar :term:`bytesliknande objekt` *s* med Base16 och returnerar den kodade :class:`bytes`.

source: Decode the Base16 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
sv: Avkodar den Base16-kodade :term:`bytesliknande objekt` eller ASCII-strängen *s* och returnerar den avkodade :class:`bytes`.

source: Base85 Encodings
sv: Base85-kodningar

source: Base85 encoding is not formally specified but rather a de facto standard, thus different systems perform the encoding differently.
sv: Base85-kodningen är inte formellt specificerad utan snarare en de facto-standard, vilket innebär att olika system utför kodningen på olika sätt.

source: The :func:`a85encode` and :func:`b85encode` functions in this module are two implementations of the de facto standard. You should call the function with the Base85 implementation used by the software you intend to work with.
sv: Funktionerna :func:`a85encode` och :func:`b85encode` i den här modulen är två implementeringar av de facto-standarden. Du bör anropa funktionen med den Base85-implementering som används av den programvara du tänker arbeta med.

source: The two functions present in this module differ in how they handle the following:
sv: De två funktioner som finns i denna modul skiljer sig åt när det gäller hur de hanterar följande:

source: Whether to include enclosing ``<~`` and ``~>`` markers
sv: Huruvida omslutande ``<~`` och ``~>`` markörer ska inkluderas

source: Whether to include newline characters
sv: Huruvida tecken för nya rader ska inkluderas

source: The set of ASCII characters used for encoding
sv: Den uppsättning ASCII-tecken som används för kodning

source: Handling of null bytes
sv: Hantering av nollbytes

source: Refer to the documentation of the individual functions for more information.
sv: Se dokumentationen för de enskilda funktionerna för mer information.

source: Encode the :term:`bytes-like object` *b* using Ascii85 and return the encoded :class:`bytes`.
sv: Koda :term:`bytesliknande objekt` *b* med Ascii85 och returnera den kodade :class:`bytes`.

source: *foldspaces* is an optional flag that uses the special short sequence 'y' instead of 4 consecutive spaces (ASCII 0x20) as supported by 'btoa'. This feature is not supported by the "standard" Ascii85 encoding.
sv: *foldspaces* är en valfri flagga som använder den speciella kortsekvensen 'y' istället för 4 på varandra följande mellanslag (ASCII 0x20) som stöds av 'btoa'. Denna funktion stöds inte av "standard" Ascii85-kodningen.

source: *wrapcol* controls whether the output should have newline (``b'\n'``) characters added to it. If this is non-zero, each output line will be at most this many characters long, excluding the trailing newline.
sv: *wrapcol* styr om utdata ska ha nya radtecken (``b'\n'``) tillagda. Om värdet är annat än noll kommer varje utdatarad att vara högst så här många tecken lång, exklusive den efterföljande nya raden.

source: *pad* controls whether the input is padded to a multiple of 4 before encoding. Note that the ``btoa`` implementation always pads.
sv: *pad* styr om indata ska fyllas i till en multipel av 4 före kodning. Observera att ``btoa``-implementationen alltid paddar.

source: *adobe* controls whether the encoded byte sequence is framed with ``<~`` and ``~>``, which is used by the Adobe implementation.
sv: *adobe* styr om den kodade byte-sekvensen ska ramas in med ``<~`` och ``~>``, vilket används av Adobe-implementationen.

source: Decode the Ascii85 encoded :term:`bytes-like object` or ASCII string *b* and return the decoded :class:`bytes`.
sv: Avkodar den Ascii85-kodade :term:`bytesliknande objekt` eller ASCII-strängen *b* och returnerar den avkodade :class:`bytes`.

source: *foldspaces* is a flag that specifies whether the 'y' short sequence should be accepted as shorthand for 4 consecutive spaces (ASCII 0x20). This feature is not supported by the "standard" Ascii85 encoding.
sv: *foldspaces* är en flagga som anger om kortsekvensen 'y' ska accepteras som kortform för 4 på varandra följande mellanslag (ASCII 0x20). Denna funktion stöds inte av "standard" Ascii85-kodningen.

source: *adobe* controls whether the input sequence is in Adobe Ascii85 format (i.e. is framed with <~ and ~>).
sv: *adobe* kontrollerar om inmatningssekvensen är i Adobe Ascii85-format (dvs. är inramad med <~ och ~>).

source: *ignorechars* should be a :term:`bytes-like object` or ASCII string containing characters to ignore from the input. This should only contain whitespace characters, and by default contains all whitespace characters in ASCII.
sv: *ignorechars* ska vara en :term:`bytesliknande objekt` eller ASCII-sträng som innehåller tecken som ska ignoreras från indata. Den bör endast innehålla blanksteg och innehåller som standard alla blanksteg i ASCII.

source: Encode the :term:`bytes-like object` *b* using base85 (as used in e.g. git-style binary diffs) and return the encoded :class:`bytes`.
sv: Kodar :term:`bytesliknande objekt` *b* med base85 (som används i t.ex. binära diffar i git-stil) och returnerar den kodade :class:`bytes`.

source: If *pad* is true, the input is padded with ``b'\0'`` so its length is a multiple of 4 bytes before encoding.
sv: Om *pad* är true, fylls indata på med ``b'\0'`` så att dess längd blir en multipel av 4 byte före kodning.

source: Decode the base85-encoded :term:`bytes-like object` or ASCII string *b* and return the decoded :class:`bytes`. Padding is implicitly removed, if necessary.
sv: Avkodar den base85-kodade :term:`bytesliknande objekt` eller ASCII-strängen *b* och returnerar den avkodade :class:`bytes`. Utfyllnad tas bort implicit, om nödvändigt.

source: Encode the :term:`bytes-like object` *s* using Z85 (as used in ZeroMQ) and return the encoded :class:`bytes`. See `Z85 specification <https://rfc.zeromq.org/spec/32/>`_ for more information.
sv: Kodar :term:`bytes-liknande objekt` *s* med Z85 (som används i ZeroMQ) och returnerar den kodade :class:`bytes`. Se `Z85-specifikationen <https://rfc.zeromq.org/spec/32/>`_ för mer information.

source: Decode the Z85-encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`. See `Z85 specification <https://rfc.zeromq.org/spec/32/>`_ for more information.
sv: Avkodar den Z85-kodade :term:`bytesliknande objekt` eller ASCII-strängen *s* och returnerar den avkodade :class:`bytes`. Se `Z85-specifikationen <https://rfc.zeromq.org/spec/32/>`_ för mer information.

source: Legacy Interface
sv: Äldre gränssnitt

source: Decode the contents of the binary *input* file and write the resulting binary data to the *output* file. *input* and *output* must be :term:`file objects <file object>`. *input* will be read until ``input.readline()`` returns an empty bytes object.
sv: Avkodar innehållet i den binära filen *input* och skriver den resulterande binära datan till filen *output*. *input* och *output* måste vara :term:`filobjekt <file object>`. *input* kommer att läsas tills ``input.readline()`` returnerar ett tomt bytes-objekt.

source: Decode the :term:`bytes-like object` *s*, which must contain one or more lines of base64 encoded data, and return the decoded :class:`bytes`.
sv: Avkodar :term:`bytes-liknande objekt` *s*, som måste innehålla en eller flera rader med base64-kodade data, och returnerar den avkodade :class:`bytes`.

source: Encode the contents of the binary *input* file and write the resulting base64 encoded data to the *output* file. *input* and *output* must be :term:`file objects <file object>`. *input* will be read until ``input.read()`` returns an empty bytes object. :func:`encode` inserts a newline character (``b'\n'``) after every 76 bytes of the output, as well as ensuring that the output always ends with a newline, as per :rfc:`2045` (MIME).
sv: Kodar innehållet i den binära *input*-filen och skriver de resulterande base64-kodade data till *output*-filen. *input* och *output* måste vara :term:`filobjekt <file object>`. *input* kommer att läsas tills ``input.read()`` returnerar ett tomt bytesobjekt. :func:`encode` infogar en ny rad (``b'\n'``) efter var 76:e byte i utdata, samt säkerställer att utdata alltid slutar med en ny rad, enligt :rfc:`2045` (MIME).

source: Encode the :term:`bytes-like object` *s*, which can contain arbitrary binary data, and return :class:`bytes` containing the base64-encoded data, with newlines (``b'\n'``) inserted after every 76 bytes of output, and ensuring that there is a trailing newline, as per :rfc:`2045` (MIME).
sv: Koda :term:`bytes-liknande objekt` *s*, som kan innehålla godtyckliga binära data, och returnera :class:`bytes` som innehåller base64-kodade data, med nya rader (``b'\n'``) infogade efter var 76:e bytes utdata, och se till att det finns en efterföljande ny rad, enligt :rfc:`2045` (MIME).

source: An example usage of the module:
sv: Ett exempel på användning av modulen:

source: Security Considerations
sv: Säkerhetsöverväganden

source: A new security considerations section was added to :rfc:`4648` (section 12); it's recommended to review the security section for any code deployed to production.
sv: Ett nytt avsnitt om säkerhetsöverväganden har lagts till i :rfc:`4648` (avsnitt 12); det rekommenderas att säkerhetsavsnittet granskas för all kod som distribueras till produktion.

source: Module :mod:`binascii`
sv: Modul :mod:`binascii`

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
sv: Stödmodul som innehåller konvertering av ASCII till binär och binär till ASCII.

source: :rfc:`1521` - MIME (Multipurpose Internet Mail Extensions) Part One: Mechanisms for Specifying and Describing the Format of Internet Message Bodies
sv: :rfc:`1521` - MIME (Multipurpose Internet Mail Extensions) Del 1: Mekanismer för att specificera och beskriva formatet för Internetmeddelanden

source: Section 5.2, "Base64 Content-Transfer-Encoding," provides the definition of the base64 encoding.
sv: Avsnitt 5.2, "Base64 Content-Transfer-Encoding", innehåller en definition av base64-kodningen.

source: base64
sv: bas64

source: encoding
sv: kodning

source: base64 encoding
sv: base64-kodning
