Repository: yeager/python-docs-sv
Catalog: library/bisect.po
Languages: sv

source: :mod:`!bisect` --- Array bisection algorithm
sv: :mod:`!bisect` --- Bisektionsalgoritm för array

source: **Source code:** :source:`Lib/bisect.py`
sv: **Källkod:** :source:`Lib/bisect.py`

source: This module provides support for maintaining a list in sorted order without having to sort the list after each insertion. For long lists of items with expensive comparison operations, this can be an improvement over linear searches or frequent resorting.
sv: Den här modulen ger stöd för att hålla en lista i sorterad ordning utan att behöva sortera listan efter varje inmatning. För långa listor med objekt med dyra jämförelseoperationer kan detta vara en förbättring jämfört med linjära sökningar eller frekventa sorteringar.

source: The module is called :mod:`bisect` because it uses a basic bisection algorithm to do its work. Unlike other bisection tools that search for a specific value, the functions in this module are designed to locate an insertion point. Accordingly, the functions never call an :meth:`~object.__eq__` method to determine whether a value has been found. Instead, the functions only call the :meth:`~object.__lt__` method and will return an insertion point between values in an array.
sv: Modulen kallas :mod:`bisect` eftersom den använder en grundläggande bisektionsalgoritm för att utföra sitt arbete. Till skillnad från andra bisektionsverktyg som söker efter ett specifikt värde är funktionerna i den här modulen utformade för att hitta en insättningspunkt. Följaktligen anropar funktionerna aldrig en :meth:`~object.__eq__`-metod för att avgöra om ett värde har hittats. Istället anropar funktionerna endast metoden :meth:`~object.__lt__` och returnerar en insättningspunkt mellan värden i en array.

source: The functions in this module are not thread-safe. If multiple threads concurrently use :mod:`bisect` functions on the same sequence, this may result in undefined behaviour. Likewise, if the provided sequence is mutated by a different thread while a :mod:`bisect` function is operating on it, the result is undefined. For example, using :py:func:`~bisect.insort_left` on the same list from multiple threads may result in the list becoming unsorted.
sv: Funktionerna i denna modul är inte trådsäkra. Om flera trådar samtidigt använder :mod:`bisect`-funktioner på samma sekvens kan detta leda till odefinierat beteende. På samma sätt blir resultatet odefinierat om den angivna sekvensen muteras av en annan tråd medan en :mod:`bisect`-funktion används på den. Till exempel kan användning av :py:func:`~bisect.insort_left` på samma lista från flera trådar resultera i att listan blir osorterad.

source: The following functions are provided:
sv: Följande funktioner finns tillgängliga:

source: Locate the insertion point for *x* in *a* to maintain sorted order. The parameters *lo* and *hi* may be used to specify a subset of the list which should be considered; by default the entire list is used. If *x* is already present in *a*, the insertion point will be before (to the left of) any existing entries. The return value is suitable for use as the first parameter to ``list.insert()`` assuming that *a* is already sorted.
sv: Placera insättningspunkten för *x* i *a* för att bibehålla den sorterade ordningen. Parametrarna *lo* och *hi* kan användas för att ange en delmängd av listan som ska beaktas; som standard används hela listan. Om *x* redan finns i *a* kommer inmatningspunkten att ligga före (till vänster om) alla befintliga poster. Returvärdet är lämpligt att använda som första parameter i ``list.insert()`` förutsatt att *a* redan är sorterad.

source: The returned insertion point *ip* partitions the array *a* into two slices such that ``all(elem < x for elem in a[lo : ip])`` is true for the left slice and ``all(elem >= x for elem in a[ip : hi])`` is true for the right slice.
sv: Den returnerade insättningspunkten *ip* delar upp matrisen *a* i två skivor så att ``all(elem < x for elem in a[lo : ip])`` är sann för den vänstra skivan och ``all(elem >= x for elem in a[ip : hi])`` är sann för den högra skivan.

source: *key* specifies a :term:`key function` of one argument that is used to extract a comparison key from each element in the array. To support searching complex records, the key function is not applied to the *x* value.
sv: *key* anger en :term:`key function` med ett argument som används för att extrahera en jämförelsenyckel från varje element i matrisen. För att underlätta sökning i komplexa poster tillämpas inte nyckelfunktionen på *x*-värdet.

source: If *key* is ``None``, the elements are compared directly and no key function is called.
sv: Om *key* är ``None`` jämförs elementen direkt och ingen nyckelfunktion anropas.

source: Added the *key* parameter.
sv: Lagt till parametern *key*.

source: Similar to :py:func:`~bisect.bisect_left`, but returns an insertion point which comes after (to the right of) any existing entries of *x* in *a*.
sv: Liknar :py:func:`~bisect.bisect_left`, men returnerar en insättningspunkt som kommer efter (till höger om) alla befintliga poster av *x* i *a*.

source: The returned insertion point *ip* partitions the array *a* into two slices such that ``all(elem <= x for elem in a[lo : ip])`` is true for the left slice and ``all(elem > x for elem in a[ip : hi])`` is true for the right slice.
sv: Den returnerade insättningspunkten *ip* delar upp matrisen *a* i två skivor så att ``all(elem <= x for elem in a[lo : ip])`` är sann för den vänstra skivan och ``all(elem > x for elem in a[ip : hi])`` är sann för den högra skivan.

source: Insert *x* in *a* in sorted order.
sv: Infoga *x* i *a* i sorterad ordning.

source: This function first runs :py:func:`~bisect.bisect_left` to locate an insertion point. Next, it runs the :meth:`!insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
sv: Denna funktion kör först :py:func:`~bisect.bisect_left` för att lokalisera en infogningspunkt. Därefter kör den metoden :meth:`!insert` på *a* för att infoga *x* på lämplig plats för att bibehålla sorteringsordningen.

source: To support inserting records in a table, the *key* function (if any) is applied to *x* for the search step but not for the insertion step.
sv: För att stödja infogning av poster i en tabell tillämpas *key*-funktionen (om sådan finns) på *x* för söksteget men inte för infogningssteget.

source: Keep in mind that the *O*\ (log *n*) search is dominated by the slow *O*\ (*n*) insertion step.
sv: Tänk på att *O*\ (log *n*)-sökningen domineras av det långsamma *O*\ (*n*)-insättningssteget.

source: Similar to :py:func:`~bisect.insort_left`, but inserting *x* in *a* after any existing entries of *x*.
sv: Liknar :py:func:`~bisect.insort_left`, men infogar *x* i *a* efter alla befintliga poster av *x*.

source: This function first runs :py:func:`~bisect.bisect_right` to locate an insertion point. Next, it runs the :meth:`!insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
sv: Denna funktion kör först :py:func:`~bisect.bisect_right` för att lokalisera en insättningspunkt. Därefter kör den metoden :meth:`!insert` på *a* för att infoga *x* på lämplig plats för att bibehålla sorteringsordningen.

source: Performance Notes
sv: Anteckningar om prestanda

source: When writing time sensitive code using *bisect()* and *insort()*, keep these thoughts in mind:
sv: När du skriver tidskänslig kod med hjälp av *bisect()* och *insort()* ska du tänka på följande:

source: Bisection is effective for searching ranges of values. For locating specific values, dictionaries are more performant.
sv: Bisektion är effektivt för sökning av värdeintervall. För att hitta specifika värden är ordböcker mer effektiva.

source: The *insort()* functions are *O*\ (*n*) because the logarithmic search step is dominated by the linear time insertion step.
sv: Funktionerna *insort()* är *O*\ (*n*) eftersom det logaritmiska söksteget domineras av det linjära tidsinsättningssteget.

source: The search functions are stateless and discard key function results after they are used. Consequently, if the search functions are used in a loop, the key function may be called again and again on the same array elements. If the key function isn't fast, consider wrapping it with :py:func:`functools.cache` to avoid duplicate computations. Alternatively, consider searching an array of precomputed keys to locate the insertion point (as shown in the examples section below).
sv: Sökfunktionerna är stateless och kasserar nyckelfunktionens resultat efter att de har använts. Om sökfunktionerna används i en slinga kan nyckelfunktionen därför anropas om och om igen på samma arrayelement. Om nyckelfunktionen inte är snabb kan du överväga att omsluta den med :py:func:`functools.cache` för att undvika dubbla beräkningar. Alternativt kan du överväga att söka i en matris med förberäknade nycklar för att lokalisera insättningspunkten (som visas i exempelavsnittet nedan).

source: `Sorted Collections <https://grantjenks.com/docs/sortedcollections/>`_ is a high performance module that uses *bisect* to managed sorted collections of data.
sv: `Sorted Collections <https://grantjenks.com/docs/sortedcollections/>`_ är en högpresterande modul som använder *bisect* för att hantera sorterade samlingar av data.

source: The `SortedCollection recipe <https://code.activestate.com/recipes/577197-sortedcollection/>`_ uses bisect to build a full-featured collection class with straight-forward search methods and support for a key-function. The keys are precomputed to save unnecessary calls to the key function during searches.
sv: Receptet `SortedCollection <https://code.activestate.com/recipes/577197-sortedcollection/>`_ använder bisect för att bygga en fullfjädrad samlingsklass med enkla sökmetoder och stöd för en nyckelfunktion. Nycklarna är förberäknade för att spara onödiga anrop till nyckelfunktionen under sökningar.

source: Searching Sorted Lists
sv: Söka i sorterade listor

source: The above `bisect functions`_ are useful for finding insertion points but can be tricky or awkward to use for common searching tasks. The following five functions show how to transform them into the standard lookups for sorted lists::
sv: Ovanstående `bisect-funktioner`_ är användbara för att hitta insättningspunkter men kan vara knepiga eller besvärliga att använda för vanliga sökuppgifter. Följande fem funktioner visar hur man omvandlar dem till standarduppslagningar för sorterade listor::

source: def index(a, x): 'Locate the leftmost value exactly equal to x' i = bisect_left(a, x) if i != len(a) and a[i] == x: return i raise ValueError def find_lt(a, x): 'Find rightmost value less than x' i = bisect_left(a, x) if i: return a[i-1] raise ValueError def find_le(a, x): 'Find rightmost value less than or equal to x' i = bisect_right(a, x) if i: return a[i-1] raise ValueError def find_gt(a, x): 'Find leftmost value greater than x' i = bisect_right(a, x) if i != len(a): return a[i] raise ValueError def find_ge(a, x): 'Find leftmost item greater than or equal to x' i = bisect_left(a, x) if i != len(a): return a[i] raise ValueError
sv: def index(a, x): "Leta reda på värdet längst till vänster som är exakt lika med x i = bisect_left(a, x) om i != len(a) och a[i] == x: returnera i höja ValueError def find_lt(a, x): "Hitta värdet längst till höger som är mindre än x i = bisect_left(a, x) if i: returnera a[i-1] raise Värdefel def find_le(a, x): "Hitta värdet längst till höger som är mindre än eller lika med x i = bisect_right(a, x) om i: returnera a[i-1] raise Värdefel def find_gt(a, x): "Hitta värdet längst till vänster som är större än x i = bisect_right(a, x) om i != len(a): returnera a[i] raise VärdeFel def find_ge(a, x): "Hitta objektet längst till vänster som är större än eller lika med x i = bisect_left(a, x) om i != len(a): returnera a[i] raise VärdeFel

source: Examples
sv: Exempel

source: The :py:func:`~bisect.bisect` function can be useful for numeric table lookups. This example uses :py:func:`~bisect.bisect` to look up a letter grade for an exam score (say) based on a set of ordered numeric breakpoints: 90 and up is an 'A', 80 to 89 is a 'B', and so on::
sv: Funktionen :py:func:`~bisect.bisect` kan vara användbar för numeriska tabelluppslagningar. I detta exempel används :py:func:`~bisect.bisect` för att slå upp ett bokstavsbetyg för ett provresultat (säg) baserat på en uppsättning ordnade numeriska brytpunkter: 90 och uppåt är ett 'A', 80 till 89 är ett 'B', och så vidare::

source: >>> def grade(score, breakpoints=[60, 70, 80, 90], grades='FDCBA'): ... i = bisect(breakpoints, score) ... return grades[i] ... >>> [grade(score) for score in [33, 99, 77, 70, 89, 90, 100]] ['F', 'A', 'C', 'C', 'B', 'A', 'A']
sv: >>> def grade(score, brytpunkter=[60, 70, 80, 90], betyg='FDCBA'): ... i = bisect(brytpunkter, poäng) ... return betyg[i] ... >>> [grade(score) for score in [33, 99, 77, 70, 89, 90, 100]] ['F', 'A', 'C', 'C', 'B', 'A', 'A']

source: The :py:func:`~bisect.bisect` and :py:func:`~bisect.insort` functions also work with lists of tuples. The *key* argument can serve to extract the field used for ordering records in a table::
sv: Funktionerna :py:func:`~bisect.bisect` och :py:func:`~bisect.insort` fungerar också med listor av tupler. Argumentet *key* kan användas för att extrahera det fält som används för att ordna poster i en tabell::

source: If the key function is expensive, it is possible to avoid repeated function calls by searching a list of precomputed keys to find the index of a record::
sv: Om nyckelfunktionen är dyr är det möjligt att undvika upprepade funktionsanrop genom att söka i en lista med förberäknade nycklar för att hitta indexet för en post::

source: >>> data = [('red', 5), ('blue', 1), ('yellow', 8), ('black', 0)] >>> data.sort(key=lambda r: r[1]) # Or use operator.itemgetter(1). >>> keys = [r[1] for r in data] # Precompute a list of keys. >>> data[bisect_left(keys, 0)] ('black', 0) >>> data[bisect_left(keys, 1)] ('blue', 1) >>> data[bisect_left(keys, 5)] ('red', 5) >>> data[bisect_left(keys, 8)] ('yellow', 8)
sv: >>> data = [('röd', 5), ('blå', 1), ('gul', 8), ('svart', 0)] >>> data.sort(key=lambda r: r[1]) # Eller använd operator.itemgetter(1). >>> nycklar = [r[1] för r i data] # Förberäkna en lista med nycklar. >>> data[bisect_left(keys, 0)] ('svart', 0) >>> data[bisect_left(keys, 1)] ('blå', 1) >>> data[bisect_left(keys, 5)] ('röd', 5) >>> data[bisect_left(keys, 8)] ('gul', 8)
