Repository: yeager/python-docs-sv
Catalog: library/collections.po
Languages: sv

source: With the acceptance of :pep:`468`, order is retained for keyword arguments passed to the :class:`OrderedDict` constructor and its :meth:`~dict.update` method.
sv: Med godkännandet av :pep:`468`, behålls ordningen för nyckelordsargument som skickas till :class:`OrderedDict`-konstruktören och dess :meth:`~dict.update`-metod.

source: :class:`OrderedDict` Examples and Recipes
sv: :class:`OrderedDict` Exempel och recept

source: It is straightforward to create an ordered dictionary variant that remembers the order the keys were *last* inserted. If a new entry overwrites an existing entry, the original insertion position is changed and moved to the end::
sv: Det är enkelt att skapa en ordnad ordboksvariant som kommer ihåg den ordning som nycklarna *senast* infogades. Om en ny post skriver över en befintlig post, ändras den ursprungliga inmatningspositionen och flyttas till slutet::

source: class LastUpdatedOrderedDict(OrderedDict): 'Store items in the order the keys were last added' def __setitem__(self, key, value): super().__setitem__(key, value) self.move_to_end(key)
sv: class LastUpdatedOrderedDict(OrderedDict): "Lagra objekt i den ordning som nycklarna senast lades till def __setitem__(self, nyckel, värde): super().__setitem__(nyckel, värde) self.move_to_end(nyckel)

source: An :class:`OrderedDict` would also be useful for implementing variants of :func:`functools.lru_cache`:
sv: En :class:`OrderedDict` skulle också vara användbar för att implementera varianter av :func:`functools.lru_cache`:

source: class MultiHitLRUCache: """ LRU cache that defers caching a result until it has been requested multiple times. To avoid flushing the LRU cache with one-time requests, we don't cache until a request has been made more than once. """ def __init__(self, func, maxsize=128, maxrequests=4096, cache_after=1): self.requests = OrderedDict() # { uncached_key : request_count } self.cache = OrderedDict() # { cached_key : function_result } self.func = func self.maxrequests = maxrequests # max number of uncached requests self.maxsize = maxsize # max number of stored return values self.cache_after = cache_after def __call__(self, *args): if args in self.cache: self.cache.move_to_end(args) return self.cache[args] result = self.func(*args) self.requests[args] = self.requests.get(args, 0) + 1 if self.requests[args] <= self.cache_after: self.requests.move_to_end(args) if len(self.requests) > self.maxrequests: self.requests.popitem(last=False) else: self.requests.pop(args, None) self.cache[args] = result if len(self.cache) > self.maxsize: self.cache.popitem(last=False) return result
sv: klass MultiHitLRUCache: """ LRU-cache som väntar med att cachelagra ett resultat tills tills det har begärts flera gånger. För att undvika att LRU-cachen töms med engångsförfrågningar, vi inte cachelagring förrän en begäran har gjorts mer än en gång. """ def __init__(self, func, maxsize=128, maxrequests=4096, cache_after=1): self.requests = OrderedDict() # { uncached_key : request_count } self.cache = OrderedDict() # { cached_key : funktion_resultat } self.func = func self.maxrequests = maxrequests # max antal icke-cachade förfrågningar self.maxsize = maxsize # max antal lagrade returvärden self.cache_after = cache_after def __call__(self, *args): om args i self.cache: self.cache.move_to_end(args) return self.cache[args] resultat = self.func(*args) self.requests[args] = self.requests.get(args, 0) + 1 if self.requests[args] <= self.cache_after: self.requests.move_to_end(args) if len(self.requests) > self.maxrequests: self.requests.popitem(last=False) annat: self.requests.pop(args, None) self.cache[args] = resultat if len(self.cache) > self.maxsize: self.cache.popitem(last=False) returnera resultat

source: :class:`UserDict` objects
sv: :class:`UserDict`-objekt

source: The class, :class:`UserDict` acts as a wrapper around dictionary objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`dict`; however, this class can be easier to work with because the underlying dictionary is accessible as an attribute.
sv: Klassen :class:`UserDict` fungerar som ett omslag runt ordboksobjekt. Behovet av denna klass har delvis ersatts av möjligheten att subklassa direkt från :class:`dict`; denna klass kan dock vara lättare att arbeta med eftersom den underliggande ordboken är tillgänglig som ett attribut.

source: Class that simulates a dictionary. The instance's contents are kept in a regular dictionary, which is accessible via the :attr:`data` attribute of :class:`UserDict` instances. If *initialdata* is provided, :attr:`data` is initialized with its contents; note that a reference to *initialdata* will not be kept, allowing it to be used for other purposes.
sv: Klass som simulerar en ordbok. Instansens innehåll sparas i en vanlig ordbok, som är tillgänglig via attributet :attr:`data` i :class:`UserDict`-instanser. Om *initialdata* anges initialiseras :attr:`data` med dess innehåll; notera att en referens till *initialdata* inte sparas, vilket gör att den kan användas för andra ändamål.

source: In addition to supporting the methods and operations of mappings, :class:`UserDict` instances provide the following attribute:
sv: Förutom att stödja metoder och operationer för mappningar, ger :class:`UserDict`-instanser följande attribut:

source: A real dictionary used to store the contents of the :class:`UserDict` class.
sv: En riktig ordbok som används för att lagra innehållet i :class:`UserDict`-klassen.

source: :class:`UserList` objects
sv: :class:`UserList`-objekt

source: This class acts as a wrapper around list objects. It is a useful base class for your own list-like classes which can inherit from them and override existing methods or add new ones. In this way, one can add new behaviors to lists.
sv: Den här klassen fungerar som ett hölje runt listobjekt. Det är en användbar basklass för dina egna listliknande klasser som kan ärva från dem och åsidosätta befintliga metoder eller lägga till nya. På så sätt kan man lägga till nya beteenden i listor.

source: The need for this class has been partially supplanted by the ability to subclass directly from :class:`list`; however, this class can be easier to work with because the underlying list is accessible as an attribute.
sv: Behovet av denna klass har delvis ersatts av möjligheten att subklassa direkt från :class:`list`; denna klass kan dock vara lättare att arbeta med eftersom den underliggande listan är tillgänglig som ett attribut.

source: Class that simulates a list. The instance's contents are kept in a regular list, which is accessible via the :attr:`data` attribute of :class:`UserList` instances. The instance's contents are initially set to a copy of *list*, defaulting to the empty list ``[]``. *list* can be any iterable, for example a real Python list or a :class:`UserList` object.
sv: Klass som simulerar en lista. Instansens innehåll sparas i en vanlig lista, som är tillgänglig via attributet :attr:`data` i :class:`UserList`-instanser. Instansens innehåll är initialt inställt på en kopia av *list*, med den tomma listan ``[]`` som standard. *list* kan vara vilken iterabel som helst, t.ex. en riktig Python-lista eller ett :class:`UserList`-objekt.

source: In addition to supporting the methods and operations of mutable sequences, :class:`UserList` instances provide the following attribute:
sv: Förutom att stödja metoder och operationer för muterbara sekvenser, ger :class:`UserList`-instanser följande attribut:

source: A real :class:`list` object used to store the contents of the :class:`UserList` class.
sv: Ett verkligt :class:`list`-objekt som används för att lagra innehållet i :class:`UserList`-klassen.

source: **Subclassing requirements:** Subclasses of :class:`UserList` are expected to offer a constructor which can be called with either no arguments or one argument. List operations which return a new sequence attempt to create an instance of the actual implementation class. To do so, it assumes that the constructor can be called with a single parameter, which is a sequence object used as a data source.
sv: **Subklassningskrav:** Subklasser av :class:`UserList` förväntas erbjuda en konstruktor som kan anropas med antingen inga argument eller ett argument. Listoperationer som returnerar en ny sekvens försöker skapa en instans av den faktiska implementationsklassen. För att göra detta förutsätts att konstruktören kan anropas med en enda parameter, som är ett sekvensobjekt som används som datakälla.

source: If a derived class does not wish to comply with this requirement, all of the special methods supported by this class will need to be overridden; please consult the sources for information about the methods which need to be provided in that case.
sv: Om en härledd klass inte vill uppfylla detta krav måste alla specialmetoder som stöds av denna klass åsidosättas; se källorna för information om vilka metoder som måste tillhandahållas i så fall.

source: :class:`UserString` objects
sv: :class:`UserString`-objekt

source: The class, :class:`UserString` acts as a wrapper around string objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`str`; however, this class can be easier to work with because the underlying string is accessible as an attribute.
sv: Klassen :class:`UserString` fungerar som ett omslag runt strängobjekt. Behovet av denna klass har delvis ersatts av möjligheten att subklassa direkt från :class:`str`; denna klass kan dock vara lättare att arbeta med eftersom den underliggande strängen är tillgänglig som ett attribut.

source: Class that simulates a string object. The instance's content is kept in a regular string object, which is accessible via the :attr:`data` attribute of :class:`UserString` instances. The instance's contents are initially set to a copy of *seq*. The *seq* argument can be any object which can be converted into a string using the built-in :func:`str` function.
sv: Klass som simulerar ett strängobjekt. Instansens innehåll förvaras i ett vanligt strängobjekt, som är tillgängligt via attributet :attr:`data` i :class:`UserString`-instanser. Instansens innehåll sätts initialt till en kopia av *seq*. Argumentet *seq* kan vara vilket objekt som helst som kan konverteras till en sträng med hjälp av den inbyggda funktionen :func:`str`.

source: In addition to supporting the methods and operations of strings, :class:`UserString` instances provide the following attribute:
sv: Förutom att stödja metoder och operationer för strängar, ger :class:`UserString`-instanser följande attribut:

source: A real :class:`str` object used to store the contents of the :class:`UserString` class.
sv: Ett verkligt :class:`str`-objekt som används för att lagra innehållet i :class:`UserString`-klassen.

source: New methods ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable``, and ``maketrans``.
sv: Nya metoder ```getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable`` och ``maketrans``.
