Repository: yeager/python-docs-sv
Catalog: library/collections.po
Languages: sv

source: When each key is encountered for the first time, it is not already in the mapping; so an entry is automatically created using the :attr:`~defaultdict.default_factory` function which returns an empty :class:`list`. The :meth:`!list.append` operation then attaches the value to the new list. When keys are encountered again, the look-up proceeds normally (returning the list for that key) and the :meth:`!list.append` operation adds another value to the list. This technique is simpler and faster than an equivalent technique using :meth:`dict.setdefault`:
sv: När varje nyckel påträffas för första gången finns den inte redan i mappningen, så en post skapas automatiskt med hjälp av funktionen :attr:`~defaultdict.default_factory` som returnerar en tom :class:`list`. Operationen :meth:`!list.append` lägger sedan till värdet i den nya listan. När nycklar påträffas igen fortsätter uppslagningen normalt (listan för den nyckeln returneras) och operationen :meth:`!list.append` lägger till ett annat värde i listan. Denna teknik är enklare och snabbare än motsvarande teknik som använder :meth:`dict.setdefault`:

source: Setting the :attr:`~defaultdict.default_factory` to :class:`int` makes the :class:`defaultdict` useful for counting (like a bag or multiset in other languages):
sv: Om du ställer in :attr:`~defaultdict.default_factory` till :class:`int` blir :class:`defaultdict` användbar för räkning (som en påse eller multiset på andra språk):

source: When a letter is first encountered, it is missing from the mapping, so the :attr:`~defaultdict.default_factory` function calls :func:`int` to supply a default count of zero. The increment operation then builds up the count for each letter.
sv: När en bokstav först påträffas saknas den i mappningen, så funktionen :attr:`~defaultdict.default_factory` anropar :func:`int` för att ange ett standardantal på noll. Inkrementoperationen bygger sedan upp räkningen för varje bokstav.

source: The function :func:`int` which always returns zero is just a special case of constant functions. A faster and more flexible way to create constant functions is to use a lambda function which can supply any constant value (not just zero):
sv: Funktionen :func:`int` som alltid returnerar noll är bara ett specialfall av konstantfunktioner. Ett snabbare och mer flexibelt sätt att skapa konstantfunktioner är att använda en lambda-funktion som kan ge vilket konstant värde som helst (inte bara noll):

source: Setting the :attr:`~defaultdict.default_factory` to :class:`set` makes the :class:`defaultdict` useful for building a dictionary of sets:
sv: Om du ställer in :attr:`~defaultdict.default_factory` på :class:`set` blir :class:`defaultdict` användbar för att bygga en ordbok med set:

source: :func:`namedtuple` Factory Function for Tuples with Named Fields
sv: :func:`namedtuple` Fabriksfunktion för tupler med namngivna fält

source: Named tuples assign meaning to each position in a tuple and allow for more readable, self-documenting code. They can be used wherever regular tuples are used, and they add the ability to access fields by name instead of position index.
sv: Namngivna tupler tilldelar varje position i en tupel en betydelse och möjliggör mer läsbar och självdokumenterande kod. De kan användas överallt där vanliga tuplar används, och de ger möjlighet att komma åt fält med namn i stället för positionsindex.

source: Returns a new tuple subclass named *typename*. The new subclass is used to create tuple-like objects that have fields accessible by attribute lookup as well as being indexable and iterable. Instances of the subclass also have a helpful docstring (with *typename* and *field_names*) and a helpful :meth:`~object.__repr__` method which lists the tuple contents in a ``name=value`` format.
sv: Returnerar en ny tuple-subklass med namnet *typename*. Den nya underklassen används för att skapa tuple-liknande objekt som har fält som är tillgängliga genom attributuppslagning samt indexerbara och itererbara. Instanser av subklassen har också en användbar docstring (med *typename* och *field_names*) och en användbar :meth:`~object.__repr__`-metod som listar tuple-innehållet i ett ``namn=värde``-format.

source: The *field_names* are a sequence of strings such as ``['x', 'y']``. Alternatively, *field_names* can be a single string with each fieldname separated by whitespace and/or commas, for example ``'x y'`` or ``'x, y'``.
sv: *field_names* är en sekvens av strängar, t.ex. ``['x', 'y']``. Alternativt kan *field_names* vara en enda sträng där varje fältnamn separeras med blanksteg och/eller kommatecken, t.ex. ``'x y'`` eller ``'x, y'``.

source: Any valid Python identifier may be used for a fieldname except for names starting with an underscore. Valid identifiers consist of letters, digits, and underscores but do not start with a digit or underscore and cannot be a :mod:`keyword` such as *class*, *for*, *return*, *global*, *pass*, or *raise*.
sv: Alla giltiga Python-identifierare kan användas för ett fältnamn utom namn som börjar med ett understreck. Giltiga identifierare består av bokstäver, siffror och understreck men börjar inte med en siffra eller ett understreck och kan inte vara ett :mod:`nyckelord` som *class*, *for*, *return*, *global*, *pass* eller *raise*.

source: If *rename* is true, invalid fieldnames are automatically replaced with positional names. For example, ``['abc', 'def', 'ghi', 'abc']`` is converted to ``['abc', '_1', 'ghi', '_3']``, eliminating the keyword ``def`` and the duplicate fieldname ``abc``.
sv: Om *rename* är true ersätts ogiltiga fältnamn automatiskt med positionsnamn. Till exempel konverteras ``['abc', 'def', 'ghi', 'abc']`` till ``['abc', '_1', 'ghi', '_3']``, vilket eliminerar nyckelordet ``def`` och det dubbla fältnamnet ``abc``.

source: *defaults* can be ``None`` or an :term:`iterable` of default values. Since fields with a default value must come after any fields without a default, the *defaults* are applied to the rightmost parameters. For example, if the fieldnames are ``['x', 'y', 'z']`` and the defaults are ``(1, 2)``, then ``x`` will be a required argument, ``y`` will default to ``1``, and ``z`` will default to ``2``.
sv: *defaults* kan vara ``None`` eller en :term:`iterable` av standardvärden. Eftersom fält med ett standardvärde måste komma efter fält utan ett standardvärde, tillämpas *defaults* på parametrarna längst till höger. Om fältnamnen till exempel är ``['x', 'y', 'z']`` och standardvärdena är ``(1, 2)``, kommer ``x`` att vara ett obligatoriskt argument, ``y`` kommer att vara standardvärdet ``1`` och ``z`` kommer att vara standardvärdet ``2``.

source: If *module* is defined, the :attr:`~type.__module__` attribute of the named tuple is set to that value.
sv: Om *module* definieras sätts attributet :attr:`~type.__module__` i den namngivna tupeln till det värdet.

source: Named tuple instances do not have per-instance dictionaries, so they are lightweight and require no more memory than regular tuples.
sv: Namngivna tuple-instanser har inga ordböcker per instans, så de är lätta och kräver inte mer minne än vanliga tupler.

source: To support pickling, the named tuple class should be assigned to a variable that matches *typename*.
sv: För att stödja pickling bör den namngivna tuple-klassen tilldelas en variabel som matchar *typename*.

source: Added support for *rename*.
sv: Lagt till stöd för *rename*.

source: The *verbose* and *rename* parameters became :ref:`keyword-only arguments <keyword-only_parameter>`.
sv: Parametrarna *verbose* och *rename* blev :ref:`keyword-only arguments <keyword-only_parameter>`.

source: Added the *module* parameter.
sv: Parametern *module* har lagts till.

source: Removed the *verbose* parameter and the :attr:`!_source` attribute.
sv: Parametern *verbose* och attributet :attr:`!_source` har tagits bort.

source: Added the *defaults* parameter and the :attr:`~somenamedtuple._field_defaults` attribute.
sv: Lagt till parametern *defaults* och attributet :attr:`~somenamedtuple._field_defaults`.

source: >>> # Basic example >>> Point = namedtuple('Point', ['x', 'y']) >>> p = Point(11, y=22) # instantiate with positional or keyword arguments >>> p[0] + p[1] # indexable like the plain tuple (11, 22) 33 >>> x, y = p # unpack like a regular tuple >>> x, y (11, 22) >>> p.x + p.y # fields also accessible by name 33 >>> p # readable __repr__ with a name=value style Point(x=11, y=22)
sv: >>> # Grundläggande exempel >>> Point = namntuple('Point', ['x', 'y']) >>> p = Point(11, y=22) # instansiera med positionella eller nyckelordsargument >>> p[0] + p[1] # indexerbar som den vanliga tupeln (11, 22) 33 >>> x, y = p # packa upp som en vanlig tupel >>> x, y (11, 22) >>> p.x + p.y # fälten är också tillgängliga via namn 33 >>> p # läsbar __repr__ med en name=value-stil Punkt(x=11, y=22)

source: Named tuples are especially useful for assigning field names to result tuples returned by the :mod:`csv` or :mod:`sqlite3` modules::
sv: Namngivna tupler är särskilt användbara för att tilldela fältnamn till resultattuplar som returneras av modulerna :mod:`csv` eller :mod:`sqlite3`::

source: In addition to the methods inherited from tuples, named tuples support three additional methods and two attributes. To prevent conflicts with field names, the method and attribute names start with an underscore.
sv: Utöver de metoder som ärvs från tuples har named tuples stöd för ytterligare tre metoder och två attribut. För att undvika konflikter med fältnamn börjar metod- och attributnamnen med ett understreck.

source: Class method that makes a new instance from an existing sequence or iterable.
sv: Klassmetod som skapar en ny instans från en befintlig sekvens eller iterabel.

source: >>> t = [11, 22] >>> Point._make(t) Point(x=11, y=22)
sv: >>> t = [11, 22] >>> Point._make(t) Punkt(x=11, y=22)

source: Return a new :class:`dict` which maps field names to their corresponding values:
sv: Returnerar en ny :class:`dict` som mappar fältnamn till deras motsvarande värden:

source: >>> p = Point(x=11, y=22) >>> p._asdict() {'x': 11, 'y': 22}
sv: >>> p = Punkt(x=11, y=22) >>> p._asdict() {'x': 11, 'y': 22}

source: Returns an :class:`OrderedDict` instead of a regular :class:`dict`.
sv: Returnerar en :class:`OrderedDict` istället för en vanlig :class:`dict`.

source: Returns a regular :class:`dict` instead of an :class:`OrderedDict`. As of Python 3.7, regular dicts are guaranteed to be ordered. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``.
sv: Returnerar en vanlig :class:`dict` istället för en :class:`OrderedDict`. Från och med Python 3.7 garanteras att vanliga dicts är ordnade. Om de extra funktionerna i :class:`OrderedDict` krävs, är den föreslagna lösningen att casta resultatet till önskad typ: ``OrderedDict(nt._asdict())``.

source: Return a new instance of the named tuple replacing specified fields with new values::
sv: Returnerar en ny instans av den namngivna tupeln genom att ersätta angivna fält med nya värden::

source: >>> p = Point(x=11, y=22) >>> p._replace(x=33) Point(x=33, y=22) >>> for partnum, record in inventory.items(): ... inventory[partnum] = record._replace(price=newprices[partnum], timestamp=time.now())
sv: >>> p = Punkt(x=11, y=22) >>> p._replace(x=33) Punkt(x=33, y=22) >>> for partnum, record in inventory.items(): ... inventory[partnum] = record._replace(price=nya priser[partnum], timestamp=time.now())

source: Named tuples are also supported by generic function :func:`copy.replace`.
sv: Namngivna tupler stöds också av den generiska funktionen :func:`copy.replace`.

source: Raise :exc:`TypeError` instead of :exc:`ValueError` for invalid keyword arguments.
sv: Utlös :exc:`TypeError` istället för :exc:`ValueError` för ogiltiga nyckelordsargument.

source: Tuple of strings listing the field names. Useful for introspection and for creating new named tuple types from existing named tuples.
sv: Tupel med strängar som listar fältnamnen. Användbar för introspektion och för att skapa nya namngivna tupeltyper från befintliga namngivna tuplar.

source: >>> p._fields # view the field names ('x', 'y') >>> Color = namedtuple('Color', 'red green blue') >>> Pixel = namedtuple('Pixel', Point._fields + Color._fields) >>> Pixel(11, 22, 128, 255, 0) Pixel(x=11, y=22, red=128, green=255, blue=0)
sv: >>> p._fields # visa fältnamnen ('x', 'y') >>> Color = namedtuple('Color', 'röd grön blå') >>> Pixel = namntupel('Pixel', Point._fields + Color._fields) >>> Pixel(11, 22, 128, 255, 0) Pixel(x=11, y=22, röd=128, grön=255, blå=0)

source: Dictionary mapping field names to default values.
sv: Ordbok som mappar fältnamn till standardvärden.

source: >>> Account = namedtuple('Account', ['type', 'balance'], defaults=[0]) >>> Account._field_defaults {'balance': 0} >>> Account('premium') Account(type='premium', balance=0)
sv: >>> Account = namedtuple('Account', ['type', 'balance'], defaults=[0]) >>> Account._field_defaults {"saldo": 0} >>> Konto('premium') Konto(typ='premium', saldo=0)

source: To retrieve a field whose name is stored in a string, use the :func:`getattr` function:
sv: Om du vill hämta ett fält vars namn lagras i en sträng använder du funktionen :func:`getattr`:

source: To convert a dictionary to a named tuple, use the double-star-operator (as described in :ref:`tut-unpacking-arguments`):
sv: Om du vill konvertera en ordbok till en namngiven tupel använder du dubbelstjärneoperatorn (enligt beskrivningen i :ref:`tut-unpacking-arguments`):

source: Since a named tuple is a regular Python class, it is easy to add or change functionality with a subclass. Here is how to add a calculated field and a fixed-width print format:
sv: Eftersom en named tuple är en vanlig Python-klass är det lätt att lägga till eller ändra funktionalitet med en subklass. Så här lägger du till ett beräknat fält och ett utskriftsformat med fast bredd:

source: >>> class Point(namedtuple('Point', ['x', 'y'])): ... __slots__ = () ... @property ... def hypot(self): ... return (self.x ** 2 + self.y ** 2) ** 0.5 ... def __str__(self): ... return 'Point: x=%6.3f y=%6.3f hypot=%6.3f' % (self.x, self.y, self.hypot) >>> for p in Point(3, 4), Point(14, 5/7): ... print(p) Point: x= 3.000 y= 4.000 hypot= 5.000 Point: x=14.000 y= 0.714 hypot=14.018
sv: >>> class Point(namedtuple('Point', ['x', 'y'])): ... __slots__ = () ... @egenskap ... def hypot(self): ... return (self.x ** 2 + self.y ** 2) ** 0,5 ... def __str__(self): ... return 'Punkt: x=%6.3f y=%6.3f hypot=%6.3f' % (self.x, self.y, self.hypot) >>> for p in Point(3, 4), Point(14, 5/7): ... print(p) Punkt: x= 3,000 y= 4,000 hypot= 5,000 Punkt: x=14,000 y= 0,714 hypot=14,018

source: The subclass shown above sets ``__slots__`` to an empty tuple. This helps keep memory requirements low by preventing the creation of instance dictionaries.
sv: Den subklass som visas ovan sätter ``__slots__`` till en tom tupel. Detta hjälper till att hålla minneskraven låga genom att förhindra skapandet av instansordböcker.

source: Subclassing is not useful for adding new, stored fields. Instead, simply create a new named tuple type from the :attr:`~somenamedtuple._fields` attribute:
sv: Subklassning är inte användbart för att lägga till nya, lagrade fält. Istället skapar du helt enkelt en ny namngiven tupeltyp från attributet :attr:`~somenamedtuple._fields`:

source: Docstrings can be customized by making direct assignments to the ``__doc__`` fields:
sv: Dokumentsträngar kan anpassas genom att göra direkta tilldelningar till fälten ``__doc__``:

source: Property docstrings became writeable.
sv: Property docstrings blev skrivbara.

source: See :class:`typing.NamedTuple` for a way to add type hints for named tuples. It also provides an elegant notation using the :keyword:`class` keyword::
sv: Se :class:`typing.NamedTuple` för ett sätt att lägga till typhintar för namngivna tupler. Det ger också en elegant notation med hjälp av nyckelordet :keyword:`class`::

source: class Component(NamedTuple): part_number: int weight: float description: Optional[str] = None
sv: class Komponent(NamedTuple): part_number: int vikt: float description (beskrivning): Valfri[str] = Ingen

source: See :meth:`types.SimpleNamespace` for a mutable namespace based on an underlying dictionary instead of a tuple.
sv: Se :meth:`types.SimpleNamespace` för en föränderlig namnrymd som baseras på en underliggande ordbok i stället för en tupel.

source: The :mod:`dataclasses` module provides a decorator and functions for automatically adding generated special methods to user-defined classes.
sv: Modulen :mod:`dataclasses` innehåller en dekorator och funktioner för att automatiskt lägga till genererade specialmetoder till användardefinierade klasser.

source: :class:`OrderedDict` objects
sv: :class:`OrderedDict`-objekt

source: Ordered dictionaries are just like regular dictionaries but have some extra capabilities relating to ordering operations. They have become less important now that the built-in :class:`dict` class gained the ability to remember insertion order (this new behavior became guaranteed in Python 3.7).
sv: Ordnade ordböcker är precis som vanliga ordböcker men har några extra funktioner som rör ordningsoperationer. De har blivit mindre viktiga nu när den inbyggda :class:`dict`-klassen har fått förmågan att komma ihåg insättningsordning (detta nya beteende blev garanterat i Python 3.7).

source: Some differences from :class:`dict` still remain:
sv: Vissa skillnader från :class:`dict` kvarstår fortfarande:

source: The regular :class:`dict` was designed to be very good at mapping operations. Tracking insertion order was secondary.
sv: Den vanliga :class:`dict` utformades för att vara mycket bra på mappningsoperationer. Att spåra insättningsordning var sekundärt.

source: The :class:`OrderedDict` was designed to be good at reordering operations. Space efficiency, iteration speed, and the performance of update operations were secondary.
sv: :class:`OrderedDict` utformades för att vara bra på omordningsoperationer. Utrymmeseffektivitet, iterationshastighet och prestanda för uppdateringsoperationer var sekundära.

source: The :class:`OrderedDict` algorithm can handle frequent reordering operations better than :class:`dict`. As shown in the recipes below, this makes it suitable for implementing various kinds of LRU caches.
sv: Algoritmen :class:`OrderedDict` kan hantera frekventa omordningsoperationer bättre än :class:`dict`. Som visas i recepten nedan gör detta att den lämpar sig för implementering av olika typer av LRU-cacher.

source: The equality operation for :class:`OrderedDict` checks for matching order.
sv: Jämlikhetsoperationen för :class:`OrderedDict` kontrollerar matchande ordning.

source: A regular :class:`dict` can emulate the order sensitive equality test with ``p == q and all(k1 == k2 for k1, k2 in zip(p, q))``.
sv: En vanlig :class:`dict` kan emulera det ordningskänsliga likhetstestet med ``p == q and all(k1 == k2 for k1, k2 in zip(p, q))``.

source: The :meth:`~OrderedDict.popitem` method of :class:`OrderedDict` has a different signature. It accepts an optional argument to specify which item is popped.
sv: Metoden :meth:`~OrderedDict.popitem` i :class:`OrderedDict` har en annan signatur. Den accepterar ett valfritt argument för att specificera vilket objekt som ska poppas.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=True)`` with ``d.popitem()`` which is guaranteed to pop the rightmost (last) item.
sv: En vanlig :class:`dict` kan efterlikna OrderedDicts ``od.popitem(last=True)`` med ``d.popitem()`` som garanterat öppnar det längst till höger (sista) objektet.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=False)`` with ``(k := next(iter(d)), d.pop(k))`` which will return and remove the leftmost (first) item if it exists.
sv: En vanlig :class:`dict` kan emulera OrderedDicts ``od.popitem(last=False)`` med ``(k := next(iter(d)), d.pop(k))`` som returnerar och tar bort det längst till vänster (första) objektet om det finns.

source: :class:`OrderedDict` has a :meth:`~OrderedDict.move_to_end` method to efficiently reposition an element to an endpoint.
sv: :class:`OrderedDict` har en :meth:`~OrderedDict.move_to_end`-metod för att effektivt flytta ett element till en slutpunkt.

source: A regular :class:`dict` can emulate OrderedDict's ``od.move_to_end(k, last=True)`` with ``d[k] = d.pop(k)`` which will move the key and its associated value to the rightmost (last) position.
sv: En vanlig :class:`dict` kan emulera OrderedDicts ``od.move_to_end(k, last=True)`` med ``d[k] = d.pop(k)`` vilket flyttar nyckeln och dess associerade värde till den högra (sista) positionen.

source: A regular :class:`dict` does not have an efficient equivalent for OrderedDict's ``od.move_to_end(k, last=False)`` which moves the key and its associated value to the leftmost (first) position.
sv: En vanlig :class:`dict` har inte någon effektiv motsvarighet till OrderedDicts ``od.move_to_end(k, last=False)`` som flyttar nyckeln och dess associerade värde till den vänstra (första) positionen.

source: Until Python 3.8, :class:`dict` lacked a :meth:`~object.__reversed__` method.
sv: Fram till Python 3.8 saknade :class:`dict` en :meth:`~object.__reversed__`-metod.

source: Return an instance of a :class:`dict` subclass that has methods specialized for rearranging dictionary order.
sv: Returnerar en instans av en :class:`dict`-underklass som har metoder specialiserade på att omorganisera ordningsföljden i ordböcker.

source: The :meth:`popitem` method for ordered dictionaries returns and removes a (key, value) pair. The pairs are returned in :abbr:`LIFO (last-in, first-out)` order if *last* is true or :abbr:`FIFO (first-in, first-out)` order if false.
sv: Metoden :meth:`popitem` för ordnade lexikon returnerar och tar bort ett (nyckel, värde)-par. Paren returneras i :abbr:`LIFO (last-in, first-out)` ordning om *last* är sant eller :abbr:`FIFO (first-in, first-out)` ordning om false.

source: Move an existing *key* to either end of an ordered dictionary. The item is moved to the right end if *last* is true (the default) or to the beginning if *last* is false. Raises :exc:`KeyError` if the *key* does not exist:
sv: Flytta en befintlig *key* till endera änden av en ordnad ordbok. Objektet flyttas till den högra änden om *last* är true (standard) eller till början om *last* är false. Utlöser :exc:`KeyError` om *nyckeln* inte finns:

source: In addition to the usual mapping methods, ordered dictionaries also support reverse iteration using :func:`reversed`.
sv: Förutom de vanliga mappningsmetoderna stöder ordnade lexikon även omvänd iteration med hjälp av :func:`reversed`.

source: Equality tests between :class:`OrderedDict` objects are order-sensitive and are roughly equivalent to ``list(od1.items())==list(od2.items())``.
sv: Likhetstester mellan :class:`OrderedDict`-objekt är ordningskänsliga och motsvarar ungefär ``list(od1.items())==list(od2.items())``.

source: Equality tests between :class:`OrderedDict` objects and other :class:`~collections.abc.Mapping` objects are order-insensitive like regular dictionaries. This allows :class:`OrderedDict` objects to be substituted anywhere a regular dictionary is used.
sv: Jämlikhetstester mellan :class:`OrderedDict`-objekt och andra :class:`~collections.abc.Mapping`-objekt är okänsliga för ordning som vanliga ordböcker. Detta gör att :class:`OrderedDict`-objekt kan ersättas var som helst där en vanlig ordbok används.

source: The items, keys, and values :term:`views <dictionary view>` of :class:`OrderedDict` now support reverse iteration using :func:`reversed`.
sv: Objekten, nycklarna och värdena :term:`views <dictionary view>` i :class:`OrderedDict` stöder nu omvänd iteration med :func:`reversed`.
