Repository: yeager/python-docs-sv
Catalog: library/collections.po
Languages: sv

source: :mod:`!collections` --- Container datatypes
sv: :mod:`!collections` --- Datatyper för behållare

source: **Source code:** :source:`Lib/collections/__init__.py`
sv: **Källkod:** :source:`Lib/collections/__init__.py`

source: This module implements specialized container datatypes providing alternatives to Python's general purpose built-in containers, :class:`dict`, :class:`list`, :class:`set`, and :class:`tuple`.
sv: Denna modul implementerar specialiserade datatyper för containrar som ger alternativ till Pythons inbyggda containrar för allmänna ändamål, :class:`dict`, :class:`list`, :class:`set` och :class:`tuple`.

source: factory function for creating tuple subclasses with named fields
sv: fabriksfunktion för att skapa tuple-subklasser med namngivna fält

source: list-like container with fast appends and pops on either end
sv: listliknande behållare med snabba tillägg och öppningar i båda ändar

source: :class:`ChainMap`
sv: :class:`KedjeMap`

source: dict-like class for creating a single view of multiple mappings
sv: diktliknande klass för att skapa en enda vy av flera mappningar

source: dict subclass for counting :term:`hashable` objects
sv: dict-underklass för räkning av :term:`hashable`-objekt

source: dict subclass that remembers the order entries were added
sv: dict-underklass som kommer ihåg i vilken ordning posterna lades till

source: dict subclass that calls a factory function to supply missing values
sv: dict-underklass som anropar en fabriksfunktion för att leverera saknade värden

source: wrapper around dictionary objects for easier dict subclassing
sv: omslag runt ordboksobjekt för enklare underklassning av ordböcker

source: wrapper around list objects for easier list subclassing
sv: omslag runt listobjekt för enklare underklassning av listor

source: wrapper around string objects for easier string subclassing
sv: omslag runt strängobjekt för enklare underklassning av strängar

source: :class:`ChainMap` objects
sv: :class:`ChainMap`-objekt

source: A :class:`ChainMap` class is provided for quickly linking a number of mappings so they can be treated as a single unit. It is often much faster than creating a new dictionary and running multiple :meth:`~dict.update` calls.
sv: En :class:`ChainMap`-klass tillhandahålls för att snabbt länka ett antal mappningar så att de kan behandlas som en enda enhet. Det är ofta mycket snabbare än att skapa en ny ordbok och köra flera :meth:`~dict.update`-anrop.

source: The class can be used to simulate nested scopes and is useful in templating.
sv: Klassen kan användas för att simulera nästlade scopes och är användbar i templating.

source: A :class:`ChainMap` groups multiple dicts or other mappings together to create a single, updateable view. If no *maps* are specified, a single empty dictionary is provided so that a new chain always has at least one mapping.
sv: En :class:`ChainMap` grupperar flera dicts eller andra mappningar tillsammans för att skapa en enda, uppdaterbar vy. Om inga *mappningar* anges, tillhandahålls en enda tom ordbok så att en ny kedja alltid har minst en mappning.

source: The underlying mappings are stored in a list. That list is public and can be accessed or updated using the *maps* attribute. There is no other state.
sv: De underliggande mappningarna lagras i en lista. Listan är offentlig och kan nås eller uppdateras med hjälp av attributet *maps*. Det finns inget annat tillstånd.

source: Lookups search the underlying mappings successively until a key is found. In contrast, writes, updates, and deletions only operate on the first mapping.
sv: Lookups söker igenom de underliggande mappningarna successivt tills en nyckel hittas. Skrivningar, uppdateringar och borttagningar påverkar däremot bara den första mappningen.

source: A :class:`ChainMap` incorporates the underlying mappings by reference. So, if one of the underlying mappings gets updated, those changes will be reflected in :class:`ChainMap`.
sv: En :class:`ChainMap` innehåller de underliggande mappningarna genom referens. Så om en av de underliggande mappningarna uppdateras, kommer dessa ändringar att återspeglas i :class:`ChainMap`.

source: All of the usual dictionary methods are supported. In addition, there is a *maps* attribute, a method for creating new subcontexts, and a property for accessing all but the first mapping:
sv: Alla de vanliga metoderna för ordböcker stöds. Dessutom finns ett *maps*-attribut, en metod för att skapa nya underkontexter och en egenskap för att komma åt alla mappningar utom den första:

source: A user updateable list of mappings. The list is ordered from first-searched to last-searched. It is the only stored state and can be modified to change which mappings are searched. The list should always contain at least one mapping.
sv: En lista med mappningar som kan uppdateras av användaren. Listan är ordnad från först sökta till sist sökta. Det är det enda lagrade tillståndet och kan modifieras för att ändra vilka mappningar som ska sökas. Listan bör alltid innehålla minst en mappning.

source: Returns a new :class:`ChainMap` containing a new map followed by all of the maps in the current instance. If ``m`` is specified, it becomes the new map at the front of the list of mappings; if not specified, an empty dict is used, so that a call to ``d.new_child()`` is equivalent to: ``ChainMap({}, *d.maps)``. If any keyword arguments are specified, they update passed map or new empty dict. This method is used for creating subcontexts that can be updated without altering values in any of the parent mappings.
sv: Returnerar en ny :class:`ChainMap` som innehåller en ny karta följd av alla kartor i den aktuella instansen. Om ``m`` specificeras blir det den nya kartan längst fram i listan över mappningar; om den inte specificeras används en tom dict, så att ett anrop till ``d.new_child()`` är likvärdigt med: ``ChainMap({}, *d.maps)``. Om några nyckelordsargument anges uppdaterar de den map som skickas eller en ny tom dict. Den här metoden används för att skapa underkontexter som kan uppdateras utan att ändra värden i någon av de överordnade mappningarna.

source: The optional ``m`` parameter was added.
sv: Den valfria parametern ``m`` har lagts till.

source: Keyword arguments support was added.
sv: Stöd för sökordsargument har lagts till.

source: Property returning a new :class:`ChainMap` containing all of the maps in the current instance except the first one. This is useful for skipping the first map in the search. Use cases are similar to those for the :keyword:`nonlocal` keyword used in :term:`nested scopes <nested scope>`. The use cases also parallel those for the built-in :func:`super` function. A reference to ``d.parents`` is equivalent to: ``ChainMap(*d.maps[1:])``.
sv: Egenskap som returnerar en ny :class:`ChainMap` som innehåller alla kartor i den aktuella instansen utom den första. Detta är användbart för att hoppa över den första kartan i sökningen. Användningsfallen liknar dem för nyckelordet :keyword:`nonlocal` som används i :term:`nested scopes <nested scope>`. Användningsfallen är också parallella med dem för den inbyggda funktionen :func:`super`. En referens till ``d.parents`` är likvärdig med: ``ChainMap(*d.maps[1:])``.

source: Note, the iteration order of a :class:`ChainMap` is determined by scanning the mappings last to first::
sv: Observera att iterationsordningen för en :class:`ChainMap` bestäms genom att skanna mappningarna från sist till först::

source: >>> baseline = {'music': 'bach', 'art': 'rembrandt'} >>> adjustments = {'art': 'van gogh', 'opera': 'carmen'} >>> list(ChainMap(adjustments, baseline)) ['music', 'art', 'opera']
sv: >>> baseline = {'music': 'bach', 'konst': 'rembrandt'} >>> justeringar = {'konst': 'van gogh', 'opera': 'carmen'} >>> list(ChainMap(justeringar, baslinje)) ['musik', 'konst', 'opera']

source: This gives the same ordering as a series of :meth:`dict.update` calls starting with the last mapping::
sv: Detta ger samma ordning som en serie :meth:`dict.update`-anrop som börjar med den sista mappningen::

source: >>> combined = baseline.copy() >>> combined.update(adjustments) >>> list(combined) ['music', 'art', 'opera']
sv: >>> kombinerad = baslinje.kopiera() >>> kombinerad.uppdatera(justeringar) >>> list(kombinerad) ['musik', 'konst', 'opera']

source: Added support for ``|`` and ``|=`` operators, specified in :pep:`584`.
sv: Lagt till stöd för operatorerna ``|`` och ``|=``, specificerat i :pep:`584`.

source: The `MultiContext class <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ in the Enthought `CodeTools package <https://github.com/enthought/codetools>`_ has options to support writing to any mapping in the chain.
sv: Klassen `MultiContext <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ i Enthoughts `CodeTools-paket <https://github.com/enthought/codetools>`_ har alternativ för att stödja skrivning till alla mappningar i kedjan.

source: Django's `Context class <https://github.com/django/django/blob/main/django/template/context.py>`_ for templating is a read-only chain of mappings. It also features pushing and popping of contexts similar to the :meth:`~collections.ChainMap.new_child` method and the :attr:`~collections.ChainMap.parents` property.
sv: Djangos `Context class <https://github.com/django/django/blob/main/django/template/context.py>`_ för templating är en skrivskyddad kedja av mappningar. Den innehåller också pushing och popping av kontexter som liknar metoden :meth:`~collections.ChainMap.new_child` och egenskapen :attr:`~collections.ChainMap.parents`.

source: The `Nested Contexts recipe <https://code.activestate.com/recipes/577434-nested-contexts-a-chain-of-mapping-objects/>`_ has options to control whether writes and other mutations apply only to the first mapping or to any mapping in the chain.
sv: Receptet "Nested Contexts" <https://code.activestate.com/recipes/577434-nested-contexts-a-chain-of-mapping-objects/>`_ har alternativ för att styra om skrivningar och andra mutationer endast ska gälla den första mappningen eller alla mappningar i kedjan.

source: A `greatly simplified read-only version of Chainmap <https://code.activestate.com/recipes/305268/>`_.
sv: En "kraftigt förenklad skrivskyddad version av Chainmap <https://code.activestate.com/recipes/305268/>`_.

source: :class:`ChainMap` Examples and Recipes
sv: :class:`ChainMap` Exempel och recept

source: This section shows various approaches to working with chained maps.
sv: I detta avsnitt visas olika sätt att arbeta med kedjade kartor.

source: Example of simulating Python's internal lookup chain::
sv: Exempel på simulering av Pythons interna lookup-kedja::

source: Example of letting user specified command-line arguments take precedence over environment variables which in turn take precedence over default values::
sv: Exempel på att låta användarspecifika kommandoradsargument ha företräde framför miljövariabler som i sin tur har företräde framför standardvärden::

source: Example patterns for using the :class:`ChainMap` class to simulate nested contexts::
sv: Exempel på mönster för användning av klassen :class:`ChainMap` för att simulera nästlade kontexter::

source: c = ChainMap() # Create root context d = c.new_child() # Create nested child context e = c.new_child() # Child of c, independent from d e.maps[0] # Current context dictionary -- like Python's locals() e.maps[-1] # Root context -- like Python's globals() e.parents # Enclosing context chain -- like Python's nonlocals d['x'] = 1 # Set value in current context d['x'] # Get first key in the chain of contexts del d['x'] # Delete from current context list(d) # All nested values k in d # Check all nested values len(d) # Number of nested values d.items() # All nested items dict(d) # Flatten into a regular dictionary
sv: c = ChainMap() # Skapa rotkontext d = c.new_child() # Skapa ett nästlat barnkontext e = c.new_child() # Barn till c, oberoende av d e.maps[0] # Aktuell kontextordbok -- som Pythons locals() e.maps[-1] # Rotkontext -- som Pythons globals() e.parents # Omslutande kontextkedja -- som Pythons nonlocals d['x'] = 1 # Ange värde i aktuell kontext d['x'] # Hämta första nyckeln i kedjan av kontexter del d['x'] # Ta bort från aktuell kontext list(d) # Alla nästlade värden k in d # Kontrollera alla nästlade värden len(d) # Antal nästlade värden d.items() # Alla nästlade objekt dict(d) # Plattas ut till en vanlig ordbok

source: The :class:`ChainMap` class only makes updates (writes and deletions) to the first mapping in the chain while lookups will search the full chain. However, if deep writes and deletions are desired, it is easy to make a subclass that updates keys found deeper in the chain::
sv: Klassen :class:`ChainMap` gör bara uppdateringar (skrivningar och raderingar) till den första mappningen i kedjan medan uppslagningar söker i hela kedjan. Men om djupa skrivningar och raderingar önskas är det enkelt att skapa en underklass som uppdaterar nycklar som finns djupare i kedjan::

source: class DeepChainMap(ChainMap): 'Variant of ChainMap that allows direct updates to inner scopes' def __setitem__(self, key, value): for mapping in self.maps: if key in mapping: mapping[key] = value return self.maps[0][key] = value def __delitem__(self, key): for mapping in self.maps: if key in mapping: del mapping[key] return raise KeyError(key) >>> d = DeepChainMap({'zebra': 'black'}, {'elephant': 'blue'}, {'lion': 'yellow'}) >>> d['lion'] = 'orange' # update an existing key two levels down >>> d['snake'] = 'red' # new keys get added to the topmost dict >>> del d['elephant'] # remove an existing key one level down >>> d # display result DeepChainMap({'zebra': 'black', 'snake': 'red'}, {}, {'lion': 'orange'})
sv: klass DeepChainMap(ChainMap): 'Variant av ChainMap som tillåter direkta uppdateringar till inre scopes' def __setitem__(self, nyckel, värde): för mappning i self.maps: if nyckel i mappning: mappning[nyckel] = värde returnera self.maps[0][nyckel] = värde def __delitem__(self, nyckel): för mappning i self.maps: om nyckel i mappning: del mappning[nyckel] return raise KeyError(nyckel) >>> d = DeepChainMap({'zebra': 'svart'}, {'elefant': 'blå'}, {'lejon': 'gul'}) >>> d['lion'] = 'orange' # uppdatera en befintlig nyckel två nivåer ner >>> d['snake'] = 'red' # nya nycklar läggs till i den översta dict >>> del d['elephant'] # ta bort en befintlig nyckel en nivå ner >>> d # visa resultat DeepChainMap({'zebra': 'svart', 'orm': 'röd'}, {}, {'lejon': 'orange'})

source: :class:`Counter` objects
sv: :class:`Counter`-objekt

source: A counter tool is provided to support convenient and rapid tallies. For example::
sv: Ett räkneverktyg tillhandahålls för att stödja praktiska och snabba räkningar. Till exempel::

source: >>> # Tally occurrences of words in a list >>> cnt = Counter() >>> for word in ['red', 'blue', 'red', 'green', 'blue', 'blue']: ... cnt[word] += 1 ... >>> cnt Counter({'blue': 3, 'red': 2, 'green': 1}) >>> # Find the ten most common words in Hamlet >>> import re >>> words = re.findall(r'\w+', open('hamlet.txt').read().lower()) >>> Counter(words).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('you', 554), ('a', 546), ('my', 514), ('hamlet', 471), ('in', 451)]
sv: >>> # Räkna upp förekomster av ord i en lista >>> cnt = Räknare() >>> for word in ['röd', 'blå', 'röd', 'grön', 'blå', 'blå']: ... cnt[ord] += 1 ... >>> cnt Counter({'blå': 3, 'röd': 2, 'grön': 1}) >>> # Hitta de tio vanligaste orden i Hamlet >>> import re >>> ord = re.findall(r'\w+', open('hamlet.txt').read().lower()) >>> Counter(ord).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('du', 554), ('en', 546), ('min', 514), ('hamlet', 471), ('i', 451)]

source: A :class:`Counter` is a :class:`dict` subclass for counting :term:`hashable` objects. It is a collection where elements are stored as dictionary keys and their counts are stored as dictionary values. Counts are allowed to be any integer value including zero or negative counts. The :class:`Counter` class is similar to bags or multisets in other languages.
sv: En :class:`Counter` är en :class:`dict`-underklass för att räkna :term:`hashable`-objekt. Det är en samling där element lagras som nycklar i en ordbok och deras antal lagras som ordboksvärden. Antalet kan vara vilket heltalsvärde som helst, inklusive noll eller negativa värden. Klassen :class:`Counter` liknar påsar eller multisets i andra språk.

source: Elements are counted from an *iterable* or initialized from another *mapping* (or counter):
sv: Element räknas från en *iterable* eller initialiseras från en annan *mapping* (eller räknare):

source: Counter objects have a dictionary interface except that they return a zero count for missing items instead of raising a :exc:`KeyError`:
sv: Counter-objekt har ett dictionary-gränssnitt förutom att de returnerar ett nollvärde för saknade objekt i stället för att ge upphov till ett :exc:`KeyError`:

source: Setting a count to zero does not remove an element from a counter. Use ``del`` to remove it entirely:
sv: Att nollställa ett räkneverk tar inte bort ett element från ett räkneverk. Använd ``del`` för att ta bort det helt:

source: As a :class:`dict` subclass, :class:`Counter` inherited the capability to remember insertion order. Math operations on *Counter* objects also preserve order. Results are ordered according to when an element is first encountered in the left operand and then by the order encountered in the right operand.
sv: Som en underklass till :class:`dict` ärvde :class:`Counter` förmågan att komma ihåg inmatningsordning. Matematiska operationer på *Counter*-objekt bevarar också ordningen. Resultaten sorteras efter när ett element först påträffas i den vänstra operanden och sedan efter den ordning som det påträffas i den högra operanden.

source: Counter objects support additional methods beyond those available for all dictionaries:
sv: Counter-objekt stöder ytterligare metoder utöver de som är tillgängliga för alla ordböcker:

source: Return an iterator over elements repeating each as many times as its count. Elements are returned in the order first encountered. If an element's count is less than one, :meth:`elements` will ignore it.
sv: Returnerar en iterator över element som upprepar varje element lika många gånger som dess antal. Elementen returneras i den ordning de först påträffades. Om ett elements antal är mindre än ett kommer :meth:`elements` att ignorera det.

source: Return a list of the *n* most common elements and their counts from the most common to the least. If *n* is omitted or ``None``, :meth:`most_common` returns *all* elements in the counter. Elements with equal counts are ordered in the order first encountered:
sv: Returnerar en lista med de *n* vanligaste elementen och deras antal från det vanligaste till det minst vanliga. Om *n* utelämnas eller ``None`` returnerar :meth:`most_common` *alla* element i räknaren. Element med lika antal ordnas i den ordning som de först påträffades:

source: Elements are subtracted from an *iterable* or from another *mapping* (or counter). Like :meth:`dict.update` but subtracts counts instead of replacing them. Both inputs and outputs may be zero or negative.
sv: Element subtraheras från en *iterable* eller från en annan *mappning* (eller räknare). Som :meth:`dict.update` men subtraherar räkningar istället för att ersätta dem. Både ingångar och utgångar kan vara noll eller negativa.

source: Compute the sum of the counts.
sv: Beräkna summan av räkningarna.

source: The usual dictionary methods are available for :class:`Counter` objects except for two which work differently for counters.
sv: De vanliga ordboksmetoderna är tillgängliga för :class:`Counter`-objekt, förutom två som fungerar annorlunda för räknare.

source: This class method is not implemented for :class:`Counter` objects.
sv: Denna klassmetod är inte implementerad för :class:`Counter`-objekt.

source: Elements are counted from an *iterable* or added-in from another *mapping* (or counter). Like :meth:`dict.update` but adds counts instead of replacing them. Also, the *iterable* is expected to be a sequence of elements, not a sequence of ``(key, value)`` pairs.
sv: Element räknas från en *iterable* eller läggs till från en annan *mappning* (eller räknare). Som :meth:`dict.update` men lägger till räkningar istället för att ersätta dem. Dessutom förväntas *iterable* vara en sekvens av element, inte en sekvens av par av typen ``(nyckel, värde)``.

source: Counters support rich comparison operators for equality, subset, and superset relationships: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``. All of those tests treat missing elements as having zero counts so that ``Counter(a=1) == Counter(a=1, b=0)`` returns true.
sv: Counters stöder omfattande jämförelseoperatorer för jämlikhet, delmängd och övermängdsrelationer: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``. Alla dessa tester behandlar saknade element som om de har noll i antal, så att ``Counter(a=1) == Counter(a=1, b=0)`` returnerar sant.

source: Rich comparison operations were added.
sv: Rika jämförelseoperationer har lagts till.

source: In equality tests, missing elements are treated as having zero counts. Formerly, ``Counter(a=3)`` and ``Counter(a=3, b=0)`` were considered distinct.
sv: I likhetstester behandlas saknade element som om de hade noll räkningar. Tidigare ansågs ``Counter(a=3)`` och ``Counter(a=3, b=0)`` vara skilda.

source: Common patterns for working with :class:`Counter` objects::
sv: Vanliga mönster för att arbeta med :class:`Counter`-objekt::

source: c.total() # total of all counts c.clear() # reset all counts list(c) # list unique elements set(c) # convert to a set dict(c) # convert to a regular dictionary c.items() # access the (elem, cnt) pairs Counter(dict(list_of_pairs)) # convert from a list of (elem, cnt) pairs c.most_common()[:-n-1:-1] # n least common elements +c # remove zero and negative counts
sv: c.total() # summa av alla räkningar c.clear() # återställ alla räkningar list(c) # lista unika element set(c) # konvertera till en uppsättning dict(c) # konvertera till en vanlig ordbok c.items() # tillgång till paren (elem, cnt) Counter(dict(list_of_pairs)) # konvertera från en lista med (elem, cnt)-par c.most_common()[:-n-1:-1] # n minst gemensamma element +c # ta bort noll och negativa räkningar

source: Several mathematical operations are provided for combining :class:`Counter` objects to produce multisets (counters that have counts greater than zero). Addition and subtraction combine counters by adding or subtracting the counts of corresponding elements. Intersection and union return the minimum and maximum of corresponding counts. Equality and inclusion compare corresponding counts. Each operation can accept inputs with signed counts, but the output will exclude results with counts of zero or less.
sv: Flera matematiska operationer finns för att kombinera :class:`Counter`-objekt för att producera multisets (räknare som har antal större än noll). Addition och subtraktion kombinerar räknare genom att addera eller subtrahera räknevärdena för motsvarande element. Intersection och union returnerar minimum och maximum av motsvarande räkningar. Equality och inclusion jämför motsvarande räkningar. Varje operation kan acceptera inmatningar med signerade räkningar, men utmatningen kommer att utesluta resultat med räkningar på noll eller mindre.
