Repository: yeager/python-docs-sv
Catalog: library/collections.po
Languages: sv

source: >>> c = Counter(a=3, b=1) >>> d = Counter(a=1, b=2) >>> c + d # add two counters together: c[x] + d[x] Counter({'a': 4, 'b': 3}) >>> c - d # subtract (keeping only positive counts) Counter({'a': 2}) >>> c & d # intersection: min(c[x], d[x]) Counter({'a': 1, 'b': 1}) >>> c | d # union: max(c[x], d[x]) Counter({'a': 3, 'b': 2}) >>> c == d # equality: c[x] == d[x] False >>> c <= d # inclusion: c[x] <= d[x] False
sv: >>> c = Räknare(a=3, b=1) >>> d = Räknare(a=1, b=2) >>> c + d # lägg till två räknare tillsammans: c[x] + d[x] Räknare({'a': 4, 'b': 3}) >>> c - d # subtrahera (behåller endast positiva räkningar) Räknare({'a': 2}) >>> c & d # skärningspunkt: min(c[x], d[x]) Räknare({'a': 1, 'b': 1}) >>> c | d # union: max(c[x], d[x]) Räknare({'a': 3, 'b': 2}) >>> c == d # jämlikhet: c[x] == d[x] Falskt >>> c <= d # inkludering: c[x] <= d[x] False

source: Unary addition and subtraction are shortcuts for adding an empty counter or subtracting from an empty counter.
sv: Unary addition och subtraction är genvägar för att addera en tom räknare eller subtrahera från en tom räknare.

source: Added support for unary plus, unary minus, and in-place multiset operations.
sv: Stöd för unary plus, unary minus och in-place multiset-operationer har lagts till.

source: Counters were primarily designed to work with positive integers to represent running counts; however, care was taken to not unnecessarily preclude use cases needing other types or negative values. To help with those use cases, this section documents the minimum range and type restrictions.
sv: Räknare utformades i första hand för att fungera med positiva heltal för att representera löpande räkningar, men man var noga med att inte i onödan utesluta användningsfall som behövde andra typer eller negativa värden. För att hjälpa till med dessa användningsfall dokumenterar detta avsnitt minimiintervall och typbegränsningar.

source: The :class:`Counter` class itself is a dictionary subclass with no restrictions on its keys and values. The values are intended to be numbers representing counts, but you *could* store anything in the value field.
sv: Klassen :class:`Counter` är i sig en dictionary-subklass utan några restriktioner för dess nycklar och värden. Värdena är avsedda att vara siffror som representerar antal, men du *kan* lagra vad som helst i värdefältet.

source: The :meth:`~Counter.most_common` method requires only that the values be orderable.
sv: Metoden :meth:`~Counter.most_common` kräver endast att värdena är ordningsbara.

source: For in-place operations such as ``c[key] += 1``, the value type need only support addition and subtraction. So fractions, floats, and decimals would work and negative values are supported. The same is also true for :meth:`~Counter.update` and :meth:`~Counter.subtract` which allow negative and zero values for both inputs and outputs.
sv: För in-place-operationer som ``c[key] += 1`` behöver värdetypen bara stödja addition och subtraktion. Så bråk, flyttal och decimaler skulle fungera och negativa värden stöds. Detsamma gäller även för :meth:`~Counter.update` och :meth:`~Counter.subtract` som tillåter negativa och nollvärden för både in- och utdata.

source: The multiset methods are designed only for use cases with positive values. The inputs may be negative or zero, but only outputs with positive values are created. There are no type restrictions, but the value type needs to support addition, subtraction, and comparison.
sv: Multiset-metoderna är endast avsedda för användningsfall med positiva värden. Ingångsvärdena kan vara negativa eller noll, men endast utgångar med positiva värden skapas. Det finns inga typbegränsningar, men värdetypen måste stödja addition, subtraktion och jämförelse.

source: The :meth:`~Counter.elements` method requires integer counts. It ignores zero and negative counts.
sv: Metoden :meth:`~Counter.elements` kräver heltalsräkningar. Den ignorerar noll och negativa räkningar.

source: `Bag class <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ in Smalltalk.
sv: `Bag-klass <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ i Smalltalk.

source: Wikipedia entry for `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.
sv: Wikipedia-inlägg för `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.

source: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ tutorial with examples.
sv: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ handledning med exempel.

source: For mathematical operations on multisets and their use cases, see *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*.
sv: För matematiska operationer på flermängder och deras användningsområden, se *Knuth, Donald. The Art of Computer Programming Volume II, avsnitt 4.6.3, övning 19*.

source: To enumerate all distinct multisets of a given size over a given set of elements, see :func:`itertools.combinations_with_replacement`::
sv: För att räkna upp alla distinkta fleruppsättningar av en viss storlek över en viss uppsättning element, se :func:`itertools.combinations_with_replacement`::

source: map(Counter, combinations_with_replacement('ABC', 2)) # --> AA AB AC BB BC CC
sv: map(Räknare, kombinationer_med_ersättning('ABC', 2)) # --> AA AB AC BB BC CC

source: :class:`deque` objects
sv: :class:`deque`-objekt

source: Returns a new deque object initialized left-to-right (using :meth:`append`) with data from *iterable*. If *iterable* is not specified, the new deque is empty.
sv: Returnerar ett nytt deque-objekt som initierats från vänster till höger (med :meth:`append`) med data från *iterable*. Om *iterable* inte anges är det nya deque-objektet tomt.

source: Deques are a generalization of stacks and queues (the name is pronounced "deck" and is short for "double-ended queue"). Deques support thread-safe, memory efficient appends and pops from either side of the deque with approximately the same *O*\ (1) performance in either direction.
sv: Deques är en generalisering av staplar och köer (namnet uttalas "deck" och är en förkortning av "double-ended queue"). Deques stöder trådsäkra, minneseffektiva appends och pops från vardera sidan av deque med ungefär samma *O*\ (1) prestanda i båda riktningarna.

source: Though :class:`list` objects support similar operations, they are optimized for fast fixed-length operations and incur *O*\ (*n*) memory movement costs for ``pop(0)`` and ``insert(0, v)`` operations which change both the size and position of the underlying data representation.
sv: Även om :class:`list`-objekt stöder liknande operationer är de optimerade för snabba operationer med fasta längder och medför *O*\ (*n*) minnesförflyttningskostnader för operationerna ``pop(0)`` och ``insert(0, v)`` som ändrar både storleken och positionen för den underliggande datarepresentationen.

source: If *maxlen* is not specified or is ``None``, deques may grow to an arbitrary length. Otherwise, the deque is bounded to the specified maximum length. Once a bounded length deque is full, when new items are added, a corresponding number of items are discarded from the opposite end. Bounded length deques provide functionality similar to the ``tail`` filter in Unix. They are also useful for tracking transactions and other pools of data where only the most recent activity is of interest.
sv: Om *maxlen* inte anges eller är ``None``, kan deques växa till godtycklig längd. I annat fall är deque begränsad till den angivna maximala längden. När en deque med begränsad längd är full, när nya objekt läggs till, kasseras ett motsvarande antal objekt från den motsatta änden. Deques med begränsad längd har en funktionalitet som liknar filtret ``tail`` i Unix. De är också användbara för att spåra transaktioner och andra datapooler där endast den senaste aktiviteten är av intresse.

source: Deque objects support the following methods:
sv: Deque-objekt stöder följande metoder:

source: Add *x* to the right side of the deque.
sv: Lägg till *x* på höger sida av deque.

source: Add *x* to the left side of the deque.
sv: Lägg till *x* på vänster sida av deque.

source: Remove all elements from the deque leaving it with length 0.
sv: Ta bort alla element från deque och lämna den med längd 0.

source: Create a shallow copy of the deque.
sv: Skapa en ytlig kopia av deque.

source: Count the number of deque elements equal to *x*.
sv: Räkna antalet deque-element som är lika med *x*.

source: Extend the right side of the deque by appending elements from the iterable argument.
sv: Förläng höger sida av deque genom att lägga till element från iterable-argumentet.

source: Extend the left side of the deque by appending elements from *iterable*. Note, the series of left appends results in reversing the order of elements in the iterable argument.
sv: Förläng vänster sida av deque genom att lägga till element från *iterable*. Observera att serien av vänstra appends resulterar i att ordningen på elementen i iterable-argumentet vänds.

source: Return the position of *x* in the deque (at or after index *start* and before index *stop*). Returns the first match or raises :exc:`ValueError` if not found.
sv: Returnerar positionen för *x* i deque (vid eller efter index *start* och före index *stop*). Returnerar den första matchningen eller ger :exc:`ValueError` om den inte hittas.

source: Insert *x* into the deque at position *i*.
sv: Sätt in *x* i deque på position *i*.

source: If the insertion would cause a bounded deque to grow beyond *maxlen*, an :exc:`IndexError` is raised.
sv: Om införandet skulle leda till att en avgränsad deque växer bortom *maxlen*, kommer ett :exc:`IndexError` att uppstå.

source: Remove and return an element from the right side of the deque. If no elements are present, raises an :exc:`IndexError`.
sv: Tar bort och returnerar ett element från höger sida av deque. Om inga element finns, uppstår ett :exc:`IndexError`.

source: Remove and return an element from the left side of the deque. If no elements are present, raises an :exc:`IndexError`.
sv: Tar bort och returnerar ett element från vänster sida av deque. Om inga element finns, uppstår ett :exc:`IndexError`.

source: Remove the first occurrence of *value*. If not found, raises a :exc:`ValueError`.
sv: Tar bort den första förekomsten av *värde*. Om det inte hittas, uppstår ett :exc:`ValueError`.

source: Reverse the elements of the deque in-place and then return ``None``.
sv: Vänd elementen i deque på plats och returnera sedan ``None``.

source: Rotate the deque *n* steps to the right. If *n* is negative, rotate to the left.
sv: Rotera dekanen *n* steg åt höger. Om *n* är negativ, rotera till vänster.

source: When the deque is not empty, rotating one step to the right is equivalent to ``d.appendleft(d.pop())``, and rotating one step to the left is equivalent to ``d.append(d.popleft())``.
sv: När deque inte är tom är rotation ett steg åt höger likvärdigt med ``d.appendleft(d.pop())``, och rotation ett steg åt vänster är likvärdigt med ``d.append(d.popleft())``.

source: Deque objects also provide one read-only attribute:
sv: Deque-objekt har också ett skrivskyddat attribut:

source: Maximum size of a deque or ``None`` if unbounded.
sv: Maximal storlek på en deque eller ``None`` om den är obegränsad.

source: In addition to the above, deques support iteration, pickling, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, membership testing with the :keyword:`in` operator, and subscript references such as ``d[0]`` to access the first element. Indexed access is *O*\ (1) at both ends but slows to *O*\ (*n*) in the middle. For fast random access, use lists instead.
sv: Förutom ovanstående stöder deques iteration, pickling, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, medlemskapstestning med operatorn :keyword:`in` och subskriptreferenser som ``d[0]`` för åtkomst till det första elementet. Indexerad åtkomst är *O*\ (1) i båda ändar men saktar ner till *O*\ (*n*) i mitten. För snabb slumpmässig åtkomst, använd listor istället.

source: Starting in version 3.5, deques support ``__add__()``, ``__mul__()``, and ``__imul__()``.
sv: Från och med version 3.5 har deques stöd för ``__add__()``, ``__mul__()`` och ``__imul__()``.

source: Example:
sv: Exempel:

source: >>> from collections import deque >>> d = deque('ghi') # make a new deque with three items >>> for elem in d: # iterate over the deque's elements ... print(elem.upper()) G H I >>> d.append('j') # add a new entry to the right side >>> d.appendleft('f') # add a new entry to the left side >>> d # show the representation of the deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # return and remove the rightmost item 'j' >>> d.popleft() # return and remove the leftmost item 'f' >>> list(d) # list the contents of the deque ['g', 'h', 'i'] >>> d[0] # peek at leftmost item 'g' >>> d[-1] # peek at rightmost item 'i' >>> list(reversed(d)) # list the contents of a deque in reverse ['i', 'h', 'g'] >>> 'h' in d # search the deque True >>> d.extend('jkl') # add multiple elements at once >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> d.rotate(1) # right rotation >>> d deque(['l', 'g', 'h', 'i', 'j', 'k']) >>> d.rotate(-1) # left rotation >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> deque(reversed(d)) # make a new deque in reverse order deque(['l', 'k', 'j', 'i', 'h', 'g']) >>> d.clear() # empty the deque >>> d.pop() # cannot pop from an empty deque Traceback (most recent call last): File "<pyshell#6>", line 1, in -toplevel- d.pop() IndexError: pop from an empty deque >>> d.extendleft('abc') # extendleft() reverses the input order >>> d deque(['c', 'b', 'a'])
sv: >>> from collections import deque >>> d = deque('ghi') # skapa en ny deque med tre objekt >>> för elem i d: # iterera över deques element ... print(elem.upper()) G H I >>> d.append('j') # lägg till en ny post på höger sida >>> d.appendleft('f') # lägg till en ny post på vänster sida >>> d # visa representationen av deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # returnera och ta bort objektet längst till höger 'j' >>> d.popleft() # returnera och ta bort objektet längst till vänster 'f' >>> list(d) # lista innehållet i deque ['g', 'h', 'i'] >>> d[0] # kika på objektet längst till vänster 'g' >>> d[-1] # kika på objektet längst till höger 'i' >>> list(reversed(d)) # lista innehållet i en deque i omvänd ordning ['i', 'h', 'g'] >>> 'h' i d # sök i deque True >>> d.extend('jkl') # lägg till flera element på en gång >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> d.rotate(1) # högerrotation >>> d deque(['l', 'g', 'h', 'i', 'j', 'k']) >>> d.rotate(-1) # vänsterrotation >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> deque(reversed(d)) # gör en ny deque i omvänd ordning deque(['l', 'k', 'j', 'i', 'h', 'g']) >>> d.clear() # töm deque >>> d.pop() # kan inte popa från en tom deque Återkoppling (senaste anropet sist): Fil "<pyshell#6>", rad 1, i -toplevel- d.pop() IndexError: popa från en tom deque >>> d.extendleft('abc') # extendleft() vänder på inmatningsordningen >>> d deque(['c', 'b', 'a'])

source: :class:`deque` Recipes
sv: :class:`deque` Recept

source: This section shows various approaches to working with deques.
sv: I detta avsnitt visas olika sätt att arbeta med deques.

source: Bounded length deques provide functionality similar to the ``tail`` filter in Unix::
sv: Deques med begränsad längd ger funktionalitet som liknar filtret ``tail`` i Unix::

source: def tail(filename, n=10): 'Return the last n lines of a file' with open(filename) as f: return deque(f, n)
sv: def tail(filnamn, n=10): 'Returnera de sista n raderna i en fil' med open(filnamn) som f: returnera deque(f, n)

source: Another approach to using deques is to maintain a sequence of recently added elements by appending to the right and popping to the left::
sv: Ett annat sätt att använda deques är att upprätthålla en sekvens av nyligen tillagda element genom att appendiera till höger och poppa till vänster::

source: def moving_average(iterable, n=3): # moving_average([40, 30, 50, 46, 39, 44]) --> 40.0 42.0 45.0 43.0 # https://en.wikipedia.org/wiki/Moving_average it = iter(iterable) d = deque(itertools.islice(it, n-1)) d.appendleft(0) s = sum(d) for elem in it: s += elem - d.popleft() d.append(elem) yield s / n
sv: def glidande_medelvärde(iterabel, n=3): # moving_average([40, 30, 50, 46, 39, 44]) --> 40,0 42,0 45,0 43,0 # https://en.wikipedia.org/wiki/Moving_average it = iter(iterabel) d = deque(itertools.islice(it, n-1)) d.appendleft(0) s = summa(d) för elem i it: s += elem - d.popleft() d.append(elem) ger s / n

source: A `round-robin scheduler <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ can be implemented with input iterators stored in a :class:`deque`. Values are yielded from the active iterator in position zero. If that iterator is exhausted, it can be removed with :meth:`~deque.popleft`; otherwise, it can be cycled back to the end with the :meth:`~deque.rotate` method::
sv: En `round-robin schemaläggare <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ kan implementeras med inmatningsiteratorer lagrade i en :class:`deque`. Värden erhålls från den aktiva iteratorn i position noll. Om den iteratorn är uttömd kan den tas bort med :meth:`~deque.popleft`; annars kan den cyklas tillbaka till slutet med :meth:`~deque.rotate`-metoden::

source: def roundrobin(*iterables): "roundrobin('ABC', 'D', 'EF') --> A D E B F C" iterators = deque(map(iter, iterables)) while iterators: try: while True: yield next(iterators[0]) iterators.rotate(-1) except StopIteration: # Remove an exhausted iterator. iterators.popleft()
sv: def roundrobin(*iterables): "roundrobin('ABC', 'D', 'EF') --> A D E B F C" iteratorer = deque(map(iter, iterables)) while iterators: försök: while True: yield next(iteratorer[0]) iteratorer.rotera(-1) except StopIteration: # Ta bort en uttömd iterator. iteratorer.popleft()

source: The :meth:`~deque.rotate` method provides a way to implement :class:`deque` slicing and deletion. For example, a pure Python implementation of ``del d[n]`` relies on the ``rotate()`` method to position elements to be popped::
sv: Metoden :meth:`~deque.rotate` ger ett sätt att implementera :class:`deque` skivning och borttagning. Till exempel, en ren Python-implementering av ``del d[n]`` förlitar sig på ``rotate()``-metoden för att positionera element som ska poppas::

source: def delete_nth(d, n): d.rotate(-n) d.popleft() d.rotate(n)
sv: def delete_nth(d, n): d.rotera(-n) d.popleft() d.rotera(n)

source: To implement :class:`deque` slicing, use a similar approach applying :meth:`~deque.rotate` to bring a target element to the left side of the deque. Remove old entries with :meth:`~deque.popleft`, add new entries with :meth:`~deque.extend`, and then reverse the rotation. With minor variations on that approach, it is easy to implement Forth style stack manipulations such as ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot``, and ``roll``.
sv: För att implementera :class:`deque` slicing, använd ett liknande tillvägagångssätt med :meth:`~deque.rotate` för att föra ett målelement till vänster sida av deque. Ta bort gamla poster med :meth:`~deque.popleft`, lägg till nya poster med :meth:`~deque.extend`, och vänd sedan rotationen. Med mindre variationer på detta tillvägagångssätt är det lätt att implementera stackmanipulationer i Forth-stil som ``dup``, ``drop``, ``wap``, ``over``, ``pick``, ``rot`` och ``roll``.

source: :class:`defaultdict` objects
sv: :class:`defaultdict`-objekt

source: Return a new dictionary-like object. :class:`defaultdict` is a subclass of the built-in :class:`dict` class. It overrides one method and adds one writable instance variable. The remaining functionality is the same as for the :class:`dict` class and is not documented here.
sv: Returnerar ett nytt ordboksliknande objekt. :class:`defaultdict` är en subklass av den inbyggda :class:`dict`-klassen. Den åsidosätter en metod och lägger till en skrivbar instansvariabel. Resterande funktionalitet är densamma som för klassen :class:`dict` och dokumenteras inte här.

source: The first argument provides the initial value for the :attr:`default_factory` attribute; it defaults to ``None``. All remaining arguments are treated the same as if they were passed to the :class:`dict` constructor, including keyword arguments.
sv: Det första argumentet anger det initiala värdet för attributet :attr:`default_factory`; standardvärdet är ``None``. Alla återstående argument behandlas på samma sätt som om de skickades till :class:`dict`-konstruktören, inklusive nyckelordsargument.

source: :class:`defaultdict` objects support the following method in addition to the standard :class:`dict` operations:
sv: :class:`defaultdict`-objekt stöder följande metod utöver de vanliga :class:`dict`-operationerna:

source: If the :attr:`default_factory` attribute is ``None``, this raises a :exc:`KeyError` exception with the *key* as argument.
sv: Om attributet :attr:`default_factory` är ``None``, utlöses ett :exc:`KeyError` undantag med *key* som argument.

source: If :attr:`default_factory` is not ``None``, it is called without arguments to provide a default value for the given *key*, this value is inserted in the dictionary for the *key*, and returned.
sv: Om :attr:`default_factory` inte är ``None`` anropas den utan argument för att ange ett standardvärde för den angivna *key*, detta värde infogas i ordlistan för *key* och returneras.

source: If calling :attr:`default_factory` raises an exception this exception is propagated unchanged.
sv: Om anrop av :attr:`default_factory` ger upphov till ett undantag, sprids detta undantag oförändrat.

source: This method is called by the :meth:`~object.__getitem__` method of the :class:`dict` class when the requested key is not found; whatever it returns or raises is then returned or raised by :meth:`~object.__getitem__`.
sv: Denna metod anropas av :meth:`~object.__getitem__`-metoden i :class:`dict`-klassen när den begärda nyckeln inte hittas; vad den returnerar eller väcker returneras eller väcks sedan av :meth:`~object.__getitem__`.

source: Note that :meth:`__missing__` is *not* called for any operations besides :meth:`~object.__getitem__`. This means that :meth:`~dict.get` will, like normal dictionaries, return ``None`` as a default rather than using :attr:`default_factory`.
sv: Observera att :meth:`__missing__` *inte* anropas för några andra operationer än :meth:`~object.__getitem__`. Detta innebär att :meth:`~dict.get` kommer, precis som vanliga ordböcker, att returnera ``None`` som standard istället för att använda :attr:`default_factory`.

source: :class:`defaultdict` objects support the following instance variable:
sv: :class:`defaultdict`-objekt har stöd för följande instansvariabel:

source: This attribute is used by the :meth:`__missing__` method; it is initialized from the first argument to the constructor, if present, or to ``None``, if absent.
sv: Detta attribut används av metoden :meth:`__missing__`; det initialiseras från det första argumentet till konstruktören, om det finns, eller till ``None``, om det saknas.

source: Added merge (``|``) and update (``|=``) operators, specified in :pep:`584`.
sv: Lagt till operatorer för sammanslagning (``|``) och uppdatering (``|=``), specificerade i :pep:`584`.

source: :class:`defaultdict` Examples
sv: :class:`defaultdict` Exempel

source: Using :class:`list` as the :attr:`~defaultdict.default_factory`, it is easy to group a sequence of key-value pairs into a dictionary of lists:
sv: Med :class:`list` som :attr:`~defaultdict.default_factory` är det enkelt att gruppera en sekvens av nyckel-värde-par till en ordbok med listor:
