Repository: yeager/python-docs-sv
Catalog: library/compileall.po
Languages: sv

source: :mod:`!compileall` --- Byte-compile Python libraries
sv: :mod:`!compileall` --- Byte-kompilera Python-bibliotek

source: **Source code:** :source:`Lib/compileall.py`
sv: **Källkod:** :source:`Lib/compileall.py`

source: This module provides some utility functions to support installing Python libraries. These functions compile Python source files in a directory tree. This module can be used to create the cached byte-code files at library installation time, which makes them available for use even by users who don't have write permission to the library directories.
sv: Den här modulen innehåller några verktygsfunktioner för att stödja installation av Python-bibliotek. Dessa funktioner kompilerar Python-källfiler i ett katalogträd. Den här modulen kan användas för att skapa cachade bytekodfiler vid biblioteksinstallationen, vilket gör att de kan användas även av användare som inte har skrivbehörighet till bibliotekskatalogerna.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: Command-line use
sv: Användning av kommandoraden

source: This module can work as a script (using :program:`python -m compileall`) to compile Python sources.
sv: Denna modul kan fungera som ett skript (med :program:`python -m compileall`) för att kompilera Python-källor.

source: Positional arguments are files to compile or directories that contain source files, traversed recursively. If no argument is given, behave as if the command line was :samp:`-l {<directories from sys.path>}`.
sv: Positionella argument är filer som ska kompileras eller kataloger som innehåller källfiler, som genomkorsas rekursivt. Om inget argument anges, beter sig programmet som om kommandoraden var :samp:`-l {<kataloger från sys.path>}`.

source: Do not recurse into subdirectories, only compile source code files directly contained in the named or implied directories.
sv: Gå inte tillbaka till underkataloger, utan kompilera endast källkodsfiler som finns direkt i de namngivna eller underförstådda katalogerna.

source: Force rebuild even if timestamps are up-to-date.
sv: Tvinga fram en ombyggnad även om tidsstämplarna är uppdaterade.

source: Do not print the list of files compiled. If passed once, error messages will still be printed. If passed twice (``-qq``), all output is suppressed.
sv: Skriv inte ut listan över kompilerade filer. Om det anges en gång kommer felmeddelanden fortfarande att skrivas ut. Om det skickas två gånger (``-qq``), kommer alla utdata att undertryckas.

source: Directory prepended to the path to each file being compiled. This will appear in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
sv: Katalog som föregås av sökvägen till varje fil som kompileras. Detta visas i spårningar under kompileringstiden och kompileras också in i byte-kodfilen, där det används i spårningar och andra meddelanden i de fall källfilen inte finns när byte-kodfilen körs.

source: Remove the given prefix from paths recorded in the ``.pyc`` files. Paths are made relative to the prefix.
sv: Tar bort det angivna prefixet från sökvägar som registrerats i filerna ``.pyc``. Sökvägarna görs relativt till prefixet.

source: This option can be used with ``-p`` but not with ``-d``.
sv: Detta alternativ kan användas med ``-p`` men inte med ``-d``.

source: Prepend the given prefix to paths recorded in the ``.pyc`` files. Use ``-p /`` to make the paths absolute.
sv: Lägg till det angivna prefixet till sökvägar som registrerats i filerna ``.pyc``. Använd ``-p /`` för att göra sökvägarna absoluta.

source: This option can be used with ``-s`` but not with ``-d``.
sv: Detta alternativ kan användas med ``-s`` men inte med ``-d``.

source: regex is used to search the full path to each file considered for compilation, and if the regex produces a match, the file is skipped.
sv: regex används för att söka igenom hela sökvägen till varje fil som övervägs för kompilering, och om regex ger en träff hoppas filen över.

source: Read the file ``list`` and add each line that it contains to the list of files and directories to compile. If ``list`` is ``-``, read lines from ``stdin``.
sv: Läs filen ``list`` och lägg till varje rad som den innehåller i listan över filer och kataloger som ska kompileras. Om ``list`` är ``-``, läs rader från ``stdin``.

source: Write the byte-code files to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
sv: Skriv byte-kodfilerna till deras äldre platser och namn, vilket kan skriva över byte-kodfiler som skapats av en annan version av Python. Standardinställningen är att skriva filer till deras :pep:`3147`-platser och namn, vilket gör att byte-kodfiler från flera versioner av Python kan samexistera.

source: Control the maximum recursion level for subdirectories. If this is given, then ``-l`` option will not be taken into account. :program:`python -m compileall <directory> -r 0` is equivalent to :program:`python -m compileall <directory> -l`.
sv: Styr den maximala rekursionsnivån för underkataloger. Om detta anges kommer alternativet ``-l`` inte att beaktas. :program:`python -m compileall <directory> -r 0` är likvärdigt med :program:`python -m compileall <directory> -l`.

source: Use *N* workers to compile the files within the given directory. If ``0`` is used, then the result of :func:`os.process_cpu_count` will be used.
sv: Använd *N* arbetare för att kompilera filerna i den angivna katalogen. Om ``0`` används, kommer resultatet av :func:`os.process_cpu_count` att användas.

source: Control how the generated byte-code files are invalidated at runtime. The ``timestamp`` value, means that ``.pyc`` files with the source timestamp and size embedded will be generated. The ``checked-hash`` and ``unchecked-hash`` values cause hash-based pycs to be generated. Hash-based pycs embed a hash of the source file contents rather than a timestamp. See :ref:`pyc-invalidation` for more information on how Python validates bytecode cache files at runtime. The default is ``timestamp`` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is not set, and ``checked-hash`` if the ``SOURCE_DATE_EPOCH`` environment variable is set.
sv: Styr hur de genererade bytekodfilerna ogiltigförklaras vid körning. Värdet ``timestamp`` innebär att ``.pyc``-filer med källans tidsstämpel och storlek inbäddade kommer att genereras. Värdena ``checked-hash`` och ``unchecked-hash`` gör att hash-baserade pycs genereras. Hash-baserade pycs bäddar in en hash av källfilens innehåll i stället för en tidsstämpel. Se :ref:`pyc-invalidation` för mer information om hur Python validerar bytecode-cache-filer vid körning. Standardvärdet är ``timestamp`` om miljövariabeln :envvar:`SOURCE_DATE_EPOCH`` inte är angiven, och ``checked-hash`` om miljövariabeln ``SOURCE_DATE_EPOCH`` är angiven.

source: Compile with the given optimization level. May be used multiple times to compile for multiple levels at a time (for example, ``compileall -o 1 -o 2``).
sv: Kompilera med den angivna optimeringsnivån. Kan användas flera gånger för att kompilera för flera nivåer åt gången (t.ex. ``compileall -o 1 -o 2``).

source: Ignore symlinks pointing outside the given directory.
sv: Ignorera symlänkar som pekar utanför den angivna katalogen.

source: If two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
sv: Om två ``.pyc``-filer med olika optimeringsnivå har samma innehåll, använd hårda länkar för att konsolidera duplicerade filer.

source: Added the ``-i``, ``-b`` and ``-h`` options.
sv: Lagt till alternativen ``-i``, ``-b`` och ``-h``.

source: Added the ``-j``, ``-r``, and ``-qq`` options. ``-q`` option was changed to a multilevel value. ``-b`` will always produce a byte-code file ending in ``.pyc``, never ``.pyo``.
sv: Lagt till alternativen ``-j``, ``-r`` och ``-qq``. alternativet ``-q`` ändrades till ett värde med flera nivåer. ``-b`` kommer alltid att producera en bytekodfil som slutar på ``.pyc``, aldrig ``.pyo``.

source: Added the ``--invalidation-mode`` option.
sv: Lagt till alternativet ``--invalidation-mode``.

source: Added the ``-s``, ``-p``, ``-e`` and ``--hardlink-dupes`` options. Raised the default recursion limit from 10 to :py:func:`sys.getrecursionlimit()`. Added the possibility to specify the ``-o`` option multiple times.
sv: Lade till alternativen ``-s``, ``-p``, ``-e`` och ``--hardlink-dupes``. Höjde standardrekursionsgränsen från 10 till :py:func:`sys.getrecursionlimit()`. Lagt till möjligheten att ange alternativet ``-o`` flera gånger.

source: There is no command-line option to control the optimization level used by the :func:`compile` function, because the Python interpreter itself already provides the option: :program:`python -O -m compileall`.
sv: Det finns inget kommandoradsalternativ för att styra optimeringsnivån som används av :func:`compile`-funktionen, eftersom Python-tolken själv redan tillhandahåller alternativet: :program:`python -O -m compileall`.

source: Similarly, the :func:`compile` function respects the :data:`sys.pycache_prefix` setting. The generated bytecode cache will only be useful if :func:`compile` is run with the same :data:`sys.pycache_prefix` (if any) that will be used at runtime.
sv: På samma sätt respekterar funktionen :func:`compile` inställningen :data:`sys.pycache_prefix`. Den genererade bytecode-cachen kommer bara att vara användbar om :func:`compile` körs med samma :data:`sys.pycache_prefix` (om något) som kommer att användas vid körning.

source: Public functions
sv: Offentliga funktioner

source: Recursively descend the directory tree named by *dir*, compiling all :file:`.py` files along the way. Return a true value if all the files compiled successfully, and a false value otherwise.
sv: Går rekursivt ner i katalogträdet som namnges av *dir* och kompilerar alla :file:`.py`-filer längs vägen. Returnerar ett sant värde om alla filer har kompilerats framgångsrikt, och ett falskt värde annars.

source: The *maxlevels* parameter is used to limit the depth of the recursion; it defaults to ``sys.getrecursionlimit()``.
sv: Parametern *maxlevels* används för att begränsa djupet på rekursionen; standardvärdet är ``sys.getrecursionlimit()``.

source: If *ddir* is given, it is prepended to the path to each file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
sv: Om *ddir* anges läggs den till sökvägen till varje fil som kompileras för att användas i spårningar under kompileringstiden och kompileras även in i byte-kodfilen, där den används i spårningar och andra meddelanden i de fall källfilen inte finns när byte-kodfilen körs.

source: If *force* is true, modules are re-compiled even if the timestamps are up to date.
sv: Om *force* är sant kompileras moduler om även om tidsstämplarna är uppdaterade.

source: If *rx* is given, its ``search`` method is called on the complete path to each file considered for compilation, and if it returns a true value, the file is skipped. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
sv: Om *rx* anges, anropas dess ``search``-metod på den fullständiga sökvägen till varje fil som övervägs för kompilering, och om den returnerar ett sant värde hoppas filen över. Detta kan användas för att utesluta filer som matchar ett reguljärt uttryck, givet som ett :ref:`re.Pattern <re-objects>`-objekt.

source: If *quiet* is ``False`` or ``0`` (the default), the filenames and other information are printed to standard out. Set to ``1``, only errors are printed. Set to ``2``, all output is suppressed.
sv: Om *quiet* är ``False`` eller ``0`` (standard) skrivs filnamnen och annan information ut till standardutskriften. Om värdet är ``1`` skrivs endast fel ut. Om värdet är ``2`` undertrycks alla utdata.

source: If *legacy* is true, byte-code files are written to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
sv: Om *legacy* är sant skrivs byte-kodfiler till sina äldre platser och namn, vilket kan skriva över byte-kodfiler som skapats av en annan version av Python. Standardinställningen är att skriva filer till deras :pep:`3147`-platser och namn, vilket gör att byte-kodfiler från flera versioner av Python kan samexistera.

source: *optimize* specifies the optimization level for the compiler. It is passed to the built-in :func:`compile` function. Accepts also a sequence of optimization levels which lead to multiple compilations of one :file:`.py` file in one call.
sv: *optimize* anger optimeringsnivån för kompilatorn. Den skickas till den inbyggda funktionen :func:`compile`. Accepterar även en sekvens av optimeringsnivåer som leder till flera kompileringar av en :file:`.py`-fil i ett anrop.

source: The argument *workers* specifies how many workers are used to compile files in parallel. The default is to not use multiple workers. If the platform can't use multiple workers and *workers* argument is given, then sequential compilation will be used as a fallback. If *workers* is 0, the number of cores in the system is used. If *workers* is lower than ``0``, a :exc:`ValueError` will be raised.
sv: Argumentet *workers* anger hur många workers som används för att kompilera filer parallellt. Standardinställningen är att inte använda flera arbetare. Om plattformen inte kan använda flera arbetare och argumentet *workers* anges, kommer sekventiell kompilering att användas som en reservlösning. Om *workers* är 0 används antalet kärnor i systemet. Om *workers* är lägre än ``0``, kommer ett :exc:`ValueError` att uppstå.

source: *invalidation_mode* should be a member of the :class:`py_compile.PycInvalidationMode` enum and controls how the generated pycs are invalidated at runtime.
sv: *invalidation_mode* bör vara en medlem av enum :class:`py_compile.PycInvalidationMode` och styr hur de genererade pycs ogiltigförklaras vid körning.

source: The *stripdir*, *prependdir* and *limit_sl_dest* arguments correspond to the ``-s``, ``-p`` and ``-e`` options described above. They may be specified as ``str`` or :py:class:`os.PathLike`.
sv: Argumenten *stripdir*, *prependdir* och *limit_sl_dest* motsvarar alternativen ``-s``, ``-p`` och ``-e`` som beskrivs ovan. De kan anges som ``str`` eller :py:class:`os.PathLike`.

source: If *hardlink_dupes* is true and two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
sv: Om *hardlink_dupes* är true och två ``.pyc``-filer med olika optimeringsnivå har samma innehåll, används hårda länkar för att konsolidera duplicerade filer.

source: Added the *legacy* and *optimize* parameter.
sv: Lagt till parametrarna *legacy* och *optimize*.

source: Added the *workers* parameter.
sv: Parametern *workers* har lagts till.

source: *quiet* parameter was changed to a multilevel value.
sv: *parametern quiet* har ändrats till ett värde med flera nivåer.

source: The *legacy* parameter only writes out ``.pyc`` files, not ``.pyo`` files no matter what the value of *optimize* is.
sv: Parametern *legacy* skriver bara ut ``.pyc``-filer, inte ``.pyo``-filer, oavsett värdet på *optimize*.

source: Accepts a :term:`path-like object`.
sv: Accepterar en :term:`path-liknande objekt`.

source: The *invalidation_mode* parameter was added.
sv: Parametern *invalidation_mode* har lagts till.

source: The *invalidation_mode* parameter's default value is updated to ``None``.
sv: Parametern *invalidation_mode*:s standardvärde uppdateras till ``None``.

source: Setting *workers* to 0 now chooses the optimal number of cores.
sv: Om *workers* sätts till 0 väljs nu det optimala antalet kärnor.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments. Default value of *maxlevels* was changed from ``10`` to ``sys.getrecursionlimit()``
sv: Argumenten *stripdir*, *prependdir*, *limit_sl_dest* och *hardlink_dupes* lades till. Standardvärdet för *maxlevels* ändrades från ``10`` till ```sys.getrecursionlimit()``

source: Compile the file with path *fullname*. Return a true value if the file compiled successfully, and a false value otherwise.
sv: Kompilera filen med sökvägen *fullname*. Returnerar ett sant värde om filen har kompilerats framgångsrikt, och ett falskt värde annars.

source: If *ddir* is given, it is prepended to the path to the file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
sv: Om *ddir* anges, läggs den till sökvägen till den fil som kompileras för att användas i spårningar under kompileringstiden och kompileras även in i byte-kodfilen, där den används i spårningar och andra meddelanden i de fall källfilen inte finns när byte-kodfilen körs.

source: If *rx* is given, its ``search`` method is passed the full path name to the file being compiled, and if it returns a true value, the file is not compiled and ``True`` is returned. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
sv: Om *rx* anges får dess metod ``search`` det fullständiga sökvägsnamnet till den fil som ska kompileras och om den returnerar ett sant värde kompileras inte filen och ``True`` returneras. Detta kan användas för att utesluta filer som matchar ett reguljärt uttryck, givet som ett :ref:`re.Pattern <re-objects>`-objekt.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments.
sv: Lagt till argumenten *stripdir*, *prependdir*, *limit_sl_dest* och *hardlink_dupes*.

source: Byte-compile all the :file:`.py` files found along ``sys.path``. Return a true value if all the files compiled successfully, and a false value otherwise.
sv: Bytekompilera alla :file:`.py`-filer som finns längs ``sys.path``. Returnerar ett sant värde om alla filer har kompilerats framgångsrikt, och ett falskt värde annars.

source: If *skip_curdir* is true (the default), the current directory is not included in the search. All other parameters are passed to the :func:`compile_dir` function. Note that unlike the other compile functions, ``maxlevels`` defaults to ``0``.
sv: Om *skip_curdir* är true (standard) inkluderas inte den aktuella katalogen i sökningen. Alla andra parametrar skickas till funktionen :func:`compile_dir`. Observera att till skillnad från de andra kompileringsfunktionerna är ``maxlevels`` standardvärdet ``0``.

source: To force a recompile of all the :file:`.py` files in the :file:`Lib/` subdirectory and all its subdirectories::
sv: För att tvinga fram en omkompilering av alla :file:`.py`-filer i :file:`Lib/`-underkatalogen och alla dess underkataloger::

source: Module :mod:`py_compile`
sv: Modul :mod:`py_compile`

source: Byte-compile a single source file.
sv: Bytekompilera en enda källfil.
