Repository: yeager/python-docs-sv
Catalog: library/configparser.po
Languages: sv

source: More advanced customization may be achieved by overriding default values of these parser attributes. The defaults are defined on the classes, so they may be overridden by subclasses or by attribute assignment.
sv: Mer avancerad anpassning kan uppnås genom att åsidosätta standardvärdena för dessa parserattribut. Standardvärdena definieras för klasserna, så de kan åsidosättas av subklasser eller genom attributtilldelning.

source: By default when using :meth:`~ConfigParser.getboolean`, config parsers consider the following values ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` and the following values ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. You can override this by specifying a custom dictionary of strings and their Boolean outcomes. For example:
sv: Som standard när :meth:`~ConfigParser.getboolean` används, beaktar config-parser följande värden ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` och följande värden ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. Du kan åsidosätta detta genom att ange en anpassad ordlista med strängar och deras booleska resultat. Till exempel:

source: >>> custom = configparser.ConfigParser() >>> custom['section1'] = {'funky': 'nope'} >>> custom['section1'].getboolean('funky') Traceback (most recent call last): ... ValueError: Not a boolean: nope >>> custom.BOOLEAN_STATES = {'sure': True, 'nope': False} >>> custom['section1'].getboolean('funky') False
sv: >>> anpassad = configparser.ConfigParser() >>> custom['section1'] = {'funky': 'nope'} >>> custom['section1'].getboolean('funky') Traceback (senaste anropet senast): ... ValueError (värdefel): Inte en boolean: nope >>> custom.BOOLEAN_STATES = {'sure': True, 'nope': False} >>> custom['section1'].getboolean('funky') False

source: Other typical Boolean pairs include ``accept``/``reject`` or ``enabled``/``disabled``.
sv: Andra typiska booleska par är ``accept``/`reject`` eller ``enabled``/`disabled``.

source: This method transforms option names on every read, get, or set operation. The default converts the name to lowercase. This also means that when a configuration file gets written, all keys will be lowercase. Override this method if that's unsuitable. For example:
sv: Denna metod omvandlar optionsnamn vid varje read-, get- eller set-operation. Som standard konverteras namnet till gemener. Detta innebär också att när en konfigurationsfil skrivs kommer alla nycklar att vara gemener. Åsidosätt denna metod om det är olämpligt. Till exempel:

source: >>> config = """ ... [Section1] ... Key = Value ... ... [Section2] ... AnotherKey = Value ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> list(typical['Section1'].keys()) ['key'] >>> list(typical['Section2'].keys()) ['anotherkey'] >>> custom = configparser.RawConfigParser() >>> custom.optionxform = lambda option: option >>> custom.read_string(config) >>> list(custom['Section1'].keys()) ['Key'] >>> list(custom['Section2'].keys()) ['AnotherKey']
sv: >>> config = """ ... [Avsnitt1] ... Nyckel = Värde ... ... [Avsnitt2] ... En annan nyckel = värde ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> list(typical['Section1'].keys()) ['key'] >>> list(typical['Section2'].keys()) ['anotherkey'] >>> anpassad = configparser.RawConfigParser() >>> custom.optionxform = lambda option: option >>> custom.read_string(config) >>> list(custom['Section1'].keys()) ['Key'] >>> list(custom['Section2'].keys()) ['AnotherKey']

source: The optionxform function transforms option names to a canonical form. This should be an idempotent function: if the name is already in canonical form, it should be returned unchanged.
sv: Funktionen optionxform omvandlar optionsnamn till en kanonisk form. Detta bör vara en idempotent funktion: om namnet redan är i kanonisk form bör det returneras oförändrat.

source: A compiled regular expression used to parse section headers. The default matches ``[section]`` to the name ``"section"``. Whitespace is considered part of the section name, thus ``[ larch ]`` will be read as a section of name ``" larch "``. Override this attribute if that's unsuitable. For example:
sv: Ett kompilerat reguljärt uttryck som används för att analysera sektionsrubriker. Standardvärdet matchar ``[section]`` till namnet ``"section"``. Whitespace anses vara en del av sektionsnamnet, så ``[ larch ]`` kommer att läsas som en sektion med namnet ``" larch"``. Åsidosätt detta attribut om det är olämpligt. Exempelvis:

source: >>> import re >>> config = """ ... [Section 1] ... option = value ... ... [ Section 2 ] ... another = val ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> typical.sections() ['Section 1', ' Section 2 '] >>> custom = configparser.ConfigParser() >>> custom.SECTCRE = re.compile(r"\[ *(?P<header>[^]]+?) *\]") >>> custom.read_string(config) >>> custom.sections() ['Section 1', 'Section 2']
sv: &gt;&gt;&gt; import re &gt;&gt;&gt; config = """ ... [Avsnitt 1] ... alternativ = värde ... ... [ Avsnitt 2 ] ... annan = val ... """ &gt;&gt;&gt; typical = configparser.ConfigParser() &gt;&gt;&gt; typical.read_string(config) &gt;&gt;&gt; typical.sections() ['Avsnitt 1', ' Avsnitt 2'] &gt;&gt;&gt; anpassad = configparser.ConfigParser() &gt;&gt;&gt; custom.SECTCRE = re.compile(r"\[ *(?P<header>[^]]+?) *\]") &gt;&gt;&gt; custom.read_string(config) &gt;&gt;&gt; custom.sections() ['Avsnitt 1', 'Avsnitt 2']

source: While ConfigParser objects also use an ``OPTCRE`` attribute for recognizing option lines, it's not recommended to override it because that would interfere with constructor options *allow_no_value* and *delimiters*.
sv: Även om ConfigParser-objekt också använder ett ``OPTCRE``-attribut för att känna igen optionsrader rekommenderas det inte att åsidosätta det eftersom det skulle störa konstruktoralternativen *allow_no_value* och *delimiters*.

source: Legacy API Examples
sv: Exempel på äldre API

source: Mainly because of backwards compatibility concerns, :mod:`configparser` provides also a legacy API with explicit ``get``/``set`` methods. While there are valid use cases for the methods outlined below, mapping protocol access is preferred for new projects. The legacy API is at times more advanced, low-level and downright counterintuitive.
sv: Främst på grund av bakåtkompatibilitet tillhandahåller :mod:`configparser` också ett äldre API med explicita ``get``/``set``-metoder. Även om det finns giltiga användningsfall för de metoder som beskrivs nedan, föredras åtkomst via mappningsprotokoll för nya projekt. Det äldre API:et är ibland mer avancerat, på låg nivå och rent av kontraintuitivt.

source: An example of writing to a configuration file::
sv: Ett exempel på hur man skriver till en konfigurationsfil::

source: An example of reading the configuration file again::
sv: Ett exempel på att läsa konfigurationsfilen igen::

source: To get interpolation, use :class:`ConfigParser`::
sv: För att få interpolation, använd :class:`ConfigParser`::

source: Default values are available in both types of ConfigParsers. They are used in interpolation if an option used is not defined elsewhere. ::
sv: Standardvärden finns tillgängliga i båda typerna av ConfigParsers. De används vid interpolering om ett alternativ som används inte är definierat någon annanstans. ::

source: ConfigParser Objects
sv: ConfigParser-objekt

source: The main configuration parser. When *defaults* is given, it is initialized into the dictionary of intrinsic defaults. When *dict_type* is given, it will be used to create the dictionary objects for the list of sections, for the options within a section, and for the default values.
sv: Den huvudsakliga konfigurationsparsern. När *defaults* anges initialiseras den till en ordbok med inneboende standardvärden. När *dict_type* anges kommer den att användas för att skapa ordboksobjekt för listan över avsnitt, för alternativen inom ett avsnitt och för standardvärdena.

source: When *delimiters* is given, it is used as the set of substrings that divide keys from values. When *comment_prefixes* is given, it will be used as the set of substrings that prefix comments in otherwise empty lines. Comments can be indented. When *inline_comment_prefixes* is given, it will be used as the set of substrings that prefix comments in non-empty lines.
sv: När *delimiters* anges används det som den uppsättning substrängar som skiljer nycklar från värden. När *comment_prefixes* anges kommer det att användas som en uppsättning substrängar som prefixar kommentarer i annars tomma rader. Kommentarer kan vara indragna. När *inline_comment_prefixes* anges kommer det att användas som den uppsättning substrängar som prefixar kommentarer på icke-tomma rader.

source: When *strict* is ``True`` (the default), the parser won't allow for any section or option duplicates while reading from a single source (file, string or dictionary), raising :exc:`DuplicateSectionError` or :exc:`DuplicateOptionError`. When *empty_lines_in_values* is ``False`` (default: ``True``), each empty line marks the end of an option. Otherwise, internal empty lines of a multiline option are kept as part of the value. When *allow_no_value* is ``True`` (default: ``False``), options without values are accepted; the value held for these is ``None`` and they are serialized without the trailing delimiter.
sv: När *strict* är ``True`` (standard) kommer parsern inte att tillåta dubbletter av avsnitt eller alternativ när den läser från en enda källa (fil, sträng eller ordbok), vilket ger :exc:`DuplicateSectionError` eller :exc:`DuplicateOptionError`. När *empty_lines_in_values* är ``False`` (standard: ``True``) markerar varje tom rad slutet på ett alternativ. Annars behålls interna tomma rader i ett flerradigt alternativ som en del av värdet. När *allow_no_value* är ``True`` (standard: ``False``) accepteras alternativ utan värden; värdet för dessa är ``None`` och de serialiseras utan den efterföljande avgränsaren.

source: When *default_section* is given, it specifies the name for the special section holding default values for other sections and interpolation purposes (normally named ``"DEFAULT"``). This value can be retrieved and changed at runtime using the ``default_section`` instance attribute. This won't re-evaluate an already parsed config file, but will be used when writing parsed settings to a new config file.
sv: När *default_section* anges, specificeras namnet på det speciella avsnitt som innehåller standardvärden för andra avsnitt och för interpoleringsändamål (normalt benämnt ``"DEFAULT"``). Detta värde kan hämtas och ändras vid körning med hjälp av instansattributet ``default_section``. Detta kommer inte att omvärdera en redan analyserad konfigurationsfil, men kommer att användas när du skriver analyserade inställningar till en ny konfigurationsfil.

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_.
sv: Interpolationsbeteendet kan anpassas genom att tillhandahålla en anpassad hanterare via argumentet *interpolation*. ``None`` kan användas för att stänga av interpolering helt, ``ExtendedInterpolation()`` ger en mer avancerad variant inspirerad av ``zc.buildout``. Mer om ämnet i det `dedikerade dokumentationsavsnittet <#interpolation-av-värden>`_.

source: All option names used in interpolation will be passed through the :meth:`optionxform` method just like any other option name reference. For example, using the default implementation of :meth:`optionxform` (which converts option names to lower case), the values ``foo %(bar)s`` and ``foo %(BAR)s`` are equivalent.
sv: Alla alternativnamn som används i interpoleringen skickas genom metoden :meth:`optionxform` precis som alla andra referenser till alternativnamn. Till exempel, med standardimplementeringen av :meth:`optionxform` (som konverterar alternativnamn till gemener), är värdena ``foo %(bar)s`` och ``foo %(BAR)s`` likvärdiga.

source: When *converters* is given, it should be a dictionary where each key represents the name of a type converter and each value is a callable implementing the conversion from string to the desired datatype. Every converter gets its own corresponding :meth:`!get*` method on the parser object and section proxies.
sv: När *converters* anges bör det vara en dictionary där varje nyckel representerar namnet på en typomvandlare och varje värde är en anropsbar som implementerar omvandlingen från sträng till önskad datatyp. Varje omvandlare får sin egen motsvarande :meth:`!get*`-metod på parserobjektet och sektionsproxyerna.

source: When *allow_unnamed_section* is ``True`` (default: ``False``), the first section name can be omitted. See the `"Unnamed Sections" section <#unnamed-sections>`_.
sv: När *allow_unnamed_section* är ``True`` (standard: ``False``) kan det första sektionsnamnet utelämnas. Se avsnittet `"Unnamed Sections" <#unnamed-sections>`_.

source: The default *dict_type* is :class:`collections.OrderedDict`.
sv: Standardvärdet för *dict_type* är :class:`collections.OrderedDict`.

source: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* and *interpolation* were added.
sv: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* och *interpolation* har lagts till.

source: The *converters* argument was added.
sv: Argumentet *konverterare* har lagts till.

source: The *defaults* argument is read with :meth:`read_dict`, providing consistent behavior across the parser: non-string keys and values are implicitly converted to strings.
sv: Argumentet *defaults* läses med :meth:`read_dict`, vilket ger ett konsekvent beteende i hela parsern: nycklar och värden som inte är strängar konverteras implicit till strängar.

source: The default *dict_type* is :class:`dict`, since it now preserves insertion order.
sv: Standard *dict_type* är :class:`dict`, eftersom den nu bevarar inmatningsordningen.

source: Raise a :exc:`MultilineContinuationError` when *allow_no_value* is ``True``, and a key without a value is continued with an indented line.
sv: Skapar ett :exc:`MultilineContinuationError` när *allow_no_value* är ``True``, och en nyckel utan värde fortsätter med en indragen rad.

source: The *allow_unnamed_section* argument was added.
sv: Argumentet *allow_unnamed_section* har lagts till.

source: Return a dictionary containing the instance-wide defaults.
sv: Returnerar en ordbok som innehåller de instansövergripande standardvärdena.

source: Return a list of the sections available; the *default section* is not included in the list.
sv: Returnerar en lista över tillgängliga sektioner; *standardsektionen* ingår inte i listan.

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised. The name of the section must be a string; if not, :exc:`TypeError` is raised.
sv: Lägger till en sektion med namnet *section* till instansen. Om en sektion med det angivna namnet redan existerar, :exc:`DuplicateSectionError` tas upp. Om *default section*-namnet anges, genereras :exc:`ValueError`. Namnet på sektionen måste vara en sträng, annars visas :exc:`TypeError`.

source: Non-string section names raise :exc:`TypeError`.
sv: Icke-strängade sektionsnamn ger upphov till :exc:`TypeError`.

source: Indicates whether the named *section* is present in the configuration. The *default section* is not acknowledged.
sv: Indikerar om den namngivna *sektionen* finns i konfigurationen. Standardavsnittet *default section* bekräftas inte.

source: Return a list of options available in the specified *section*.
sv: Returnerar en lista över alternativ som är tillgängliga i den angivna *sektionen*.

source: If the given *section* exists, and contains the given *option*, return :const:`True`; otherwise return :const:`False`. If the specified *section* is :const:`None` or an empty string, DEFAULT is assumed.
sv: Om den angivna *sektionen* finns och innehåller den angivna *optionen*, returneras :const:`True`; annars returneras :const:`False`. Om den angivna *sektionen* är :const:`None` eller en tom sträng, antas DEFAULT.

source: Attempt to read and parse an iterable of filenames, returning a list of filenames which were successfully parsed.
sv: Försöker läsa och analysera en iterabel med filnamn och returnerar en lista med filnamn som analyserats framgångsrikt.

source: If *filenames* is a string, a :class:`bytes` object or a :term:`path-like object`, it is treated as a single filename. If a file named in *filenames* cannot be opened, that file will be ignored. This is designed so that you can specify an iterable of potential configuration file locations (for example, the current directory, the user's home directory, and some system-wide directory), and all existing configuration files in the iterable will be read.
sv: Om *filnamn* är en sträng, ett :class:`bytes`-objekt eller ett :term:`path-liknande objekt`, behandlas det som ett enda filnamn. Om en fil som anges i *filnamn* inte kan öppnas ignoreras den filen. Detta är utformat så att du kan ange en iterabel av potentiella platser för konfigurationsfiler (till exempel den aktuella katalogen, användarens hemkatalog och någon systemomfattande katalog), och alla befintliga konfigurationsfiler i den iterabla kommer att läsas.

source: If none of the named files exist, the :class:`ConfigParser` instance will contain an empty dataset. An application which requires initial values to be loaded from a file should load the required file or files using :meth:`read_file` before calling :meth:`read` for any optional files::
sv: Om ingen av de namngivna filerna finns, kommer :class:`ConfigParser`-instansen att innehålla en tom dataset. En applikation som kräver att initiala värden laddas från en fil bör ladda den eller de filer som krävs med hjälp av :meth:`read_file` innan den anropar :meth:`read` för eventuella valfria filer:

source: Added the *encoding* parameter. Previously, all files were read using the default encoding for :func:`open`.
sv: Parametern *encoding* har lagts till. Tidigare lästes alla filer med hjälp av standardkodningen för :func:`open`.

source: The *filenames* parameter accepts a :term:`path-like object`.
sv: Parametern *filnamn* accepterar en :term:`path-liknande objekt`.

source: The *filenames* parameter accepts a :class:`bytes` object.
sv: Parametern *filnamn* accepterar ett :class:`bytes`-objekt.

source: Read and parse configuration data from *f* which must be an iterable yielding Unicode strings (for example files opened in text mode).
sv: Läser och analyserar konfigurationsdata från *f* som måste vara en iterabel som ger Unicode-strängar (t.ex. filer som öppnas i textläge).

source: Optional argument *source* specifies the name of the file being read. If not given and *f* has a :attr:`!name` attribute, that is used for *source*; the default is ``'<???>'``.
sv: Det valfria argumentet *källa* anger namnet på den fil som läses. Om det inte anges och *f* har attributet :attr:`!name`, används det för *source*; standardvärdet är ``'<???>'``.

source: Replaces :meth:`!readfp`.
sv: Ersätter :meth:`!readfp`.

source: Parse configuration data from a string.
sv: Analyserar konfigurationsdata från en sträng.

source: Optional argument *source* specifies a context-specific name of the string passed. If not given, ``'<string>'`` is used. This should commonly be a filesystem path or a URL.
sv: Det valfria argumentet *source* anger ett kontextspecifikt namn på den sträng som skickas. Om det inte anges används ``'<string>'``. Detta bör vanligtvis vara en filsystemssökväg eller en URL.

source: Load configuration from any object that provides a dict-like ``items()`` method. Keys are section names, values are dictionaries with keys and values that should be present in the section. If the used dictionary type preserves order, sections and their keys will be added in order. Values are automatically converted to strings.
sv: Ladda konfiguration från ett objekt som tillhandahåller en diktliknande metod ``items()``. Nycklar är namn på sektioner, värden är ordböcker med nycklar och värden som ska finnas i sektionen. Om den använda ordbokstypen bevarar ordningen kommer sektioner och deras nycklar att läggas till i ordning. Värden konverteras automatiskt till strängar.

source: Optional argument *source* specifies a context-specific name of the dictionary passed. If not given, ``<dict>`` is used.
sv: Det valfria argumentet *source* anger ett kontextspecifikt namn på den ordbok som skickas. Om det inte anges används ``<dict>``.

source: This method can be used to copy state between parsers.
sv: Denna metod kan användas för att kopiera tillstånd mellan parsers.

source: Get an *option* value for the named *section*. If *vars* is provided, it must be a dictionary. The *option* is looked up in *vars* (if provided), *section*, and in *DEFAULTSECT* in that order. If the key is not found and *fallback* is provided, it is used as a fallback value. ``None`` can be provided as a *fallback* value.
sv: Hämta ett *option*-värde för den namngivna *section*. Om *vars* anges måste det vara en ordbok. *Alternativet* söks upp i *vars* (om det finns), *section* och *DEFAULTSECT* i den ordningen. Om nyckeln inte hittas och *fallback* anges, används den som ett reservvärde. ``None`` kan anges som ett *fallback*-värde.

source: All the ``'%'`` interpolations are expanded in the return values, unless the *raw* argument is true. Values for interpolation keys are looked up in the same manner as the option.
sv: Alla ``'%'``-interpoleringar expanderas i returvärdena, såvida inte argumentet *raw* är true. Värden för interpolationsnycklar söks upp på samma sätt som för alternativet.

source: Arguments *raw*, *vars* and *fallback* are keyword only to protect users from trying to use the third argument as the *fallback* fallback (especially when using the mapping protocol).
sv: Argumenten *raw*, *vars* och *fallback* är nyckelord endast för att skydda användare från att försöka använda det tredje argumentet som *fallback*-fallback (särskilt vid användning av mappningsprotokollet).

source: A convenience method which coerces the *option* in the specified *section* to an integer. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
sv: En praktisk metod som omvandlar *alternativet* i den angivna *sektionen* till ett heltal. Se :meth:`get` för förklaring av *raw*, *vars* och *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a floating-point number. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
sv: En praktisk metod som omvandlar *alternativet* i den angivna *sektionen* till ett flyttal. Se :meth:`get` för förklaring av *raw*, *vars* och *fallback*.
