Repository: yeager/python-docs-sv
Catalog: library/configparser.po
Languages: sv

source: :mod:`!configparser` --- Configuration file parser
sv: :mod:`!configparser` --- Parser för konfigurationsfiler

source: **Source code:** :source:`Lib/configparser.py`
sv: **Källkod:** :source:`Lib/configparser.py`

source: This module provides the :class:`ConfigParser` class which implements a basic configuration language which provides a structure similar to what's found in Microsoft Windows INI files. You can use this to write Python programs which can be customized by end users easily.
sv: Denna modul tillhandahåller :class:`ConfigParser`-klassen som implementerar ett grundläggande konfigurationsspråk som ger en struktur som liknar den som finns i Microsoft Windows INI-filer. Du kan använda detta för att skriva Python-program som enkelt kan anpassas av slutanvändare.

source: This library does *not* interpret or write the value-type prefixes used in the Windows Registry extended version of INI syntax.
sv: Det här biblioteket tolkar eller skriver *inte* de prefix för värdetyper som används i Windows-registrets utökade version av INI-syntax.

source: Module :mod:`tomllib`
sv: Modul :mod:`tomllib`

source: TOML is a well-specified format for application configuration files. It is specifically designed to be an improved version of INI.
sv: TOML är ett väl specificerat format för konfigurationsfiler för program. Det är särskilt utformat för att vara en förbättrad version av INI.

source: Module :mod:`shlex`
sv: Modul :mod:`shlex`

source: Support for creating Unix shell-like mini-languages which can also be used for application configuration files.
sv: Stöd för att skapa Unix shell-liknande minispråk som också kan användas för konfigurationsfiler för applikationer.

source: Module :mod:`json`
sv: Modul :mod:`json`

source: The ``json`` module implements a subset of JavaScript syntax which is sometimes used for configuration, but does not support comments.
sv: Modulen ``json`` implementerar en delmängd av JavaScript-syntax som ibland används för konfiguration, men stöder inte kommentarer.

source: Quick Start
sv: Snabbstart

source: Let's take a very basic configuration file that looks like this:
sv: Låt oss ta en mycket grundläggande konfigurationsfil som ser ut så här:

source: [DEFAULT] ServerAliveInterval = 45 Compression = yes CompressionLevel = 9 ForwardX11 = yes [forge.example] User = hg [topsecret.server.example] Port = 50022 ForwardX11 = no
sv: [DEFAULT] ServerAliveInterval = 45 Komprimering = ja Komprimeringsnivå = 9 ForwardX11 = ja [forge.exempel] Användare = hg [topsecret.server.exempel] Port = 50022 ForwardX11 = nej

source: The structure of INI files is described `in the following section <#supported-ini-file-structure>`_. Essentially, the file consists of sections, each of which contains keys with values. :mod:`configparser` classes can read and write such files. Let's start by creating the above configuration file programmatically.
sv: INI-filernas struktur beskrivs `i följande avsnitt <#supported-ini-file-structure>`_. I huvudsak består filen av sektioner, som var och en innehåller nycklar med värden. :mod:`configparser`-klasser kan läsa och skriva sådana filer. Låt oss börja med att skapa ovanstående konfigurationsfil programmatiskt.

source: >>> import configparser >>> config = configparser.ConfigParser() >>> config['DEFAULT'] = {'ServerAliveInterval': '45', ... 'Compression': 'yes', ... 'CompressionLevel': '9'} >>> config['forge.example'] = {} >>> config['forge.example']['User'] = 'hg' >>> config['topsecret.server.example'] = {} >>> topsecret = config['topsecret.server.example'] >>> topsecret['Port'] = '50022' # mutates the parser >>> topsecret['ForwardX11'] = 'no' # same here >>> config['DEFAULT']['ForwardX11'] = 'yes' >>> with open('example.ini', 'w') as configfile: ... config.write(configfile) ...
sv: >>> import configparser >>> config = configparser.ConfigParser() >>> config['DEFAULT'] = {'ServerAliveInterval': '45', ... 'Komprimering': 'ja', ... 'CompressionLevel': '9'} >>> config['forge.example'] = {} >>> config['forge.example'] = {} >>> config['forge.example']['User'] = 'hg' >>> config['topsecret.server.example'] = {} >>> topsecret = config['topsecret.server.example']['User'] = 'hg' >>> topsecret = config['topsecret.server.example'] >>> topsecret['Port'] = '50022' # muterar parsern >>> topsecret['ForwardX11'] = 'no' # samma här >>> config['DEFAULT']['ForwardX11'] = 'yes' >>> med open('example.ini', 'w') som configfile: ... config.write(configfile) ...

source: As you can see, we can treat a config parser much like a dictionary. There are differences, `outlined later <#mapping-protocol-access>`_, but the behavior is very close to what you would expect from a dictionary.
sv: Som du kan se kan vi behandla en config-parser ungefär som en ordbok. Det finns skillnader, "beskrivs senare <#mapping-protocol-access>", men beteendet ligger mycket nära vad du kan förvänta dig av en ordbok.

source: Now that we have created and saved a configuration file, let's read it back and explore the data it holds.
sv: Nu när vi har skapat och sparat en konfigurationsfil ska vi läsa upp den och utforska vilka data den innehåller.

source: >>> config = configparser.ConfigParser() >>> config.sections() [] >>> config.read('example.ini') ['example.ini'] >>> config.sections() ['forge.example', 'topsecret.server.example'] >>> 'forge.example' in config True >>> 'python.org' in config False >>> config['forge.example']['User'] 'hg' >>> config['DEFAULT']['Compression'] 'yes' >>> topsecret = config['topsecret.server.example'] >>> topsecret['ForwardX11'] 'no' >>> topsecret['Port'] '50022' >>> for key in config['forge.example']: ... print(key) user compressionlevel serveraliveinterval compression forwardx11 >>> config['forge.example']['ForwardX11'] 'yes'
sv: >>> config = configparser.ConfigParser() >>> config.sektioner() [] >>> config.read('exempel.ini') ['exempel.ini'] >>> config.sections() ['forge.exempel', 'topsecret.server.exempel'] >>> 'forge.example' i config Sant >>> "python.org" i konfigurationen False >>> config['forge.example']['User'] 'hg' >>> config['DEFAULT']['Komprimering'] 'yes' >>> topsecret = config['topsecret.server.example'] >>> topsecret['ForwardX11'] 'nej' >>> topsecret['Port'] '50022' >>> for key in config['forge.example']: ... print(nyckel) användare komprimeringsnivå serveraliveintervall komprimering forwardx11 >>> config['forge.exempel']['ForwardX11'] 'yes'

source: As we can see above, the API is pretty straightforward. The only bit of magic involves the ``DEFAULT`` section which provides default values for all other sections [1]_. Note also that keys in sections are case-insensitive and stored in lowercase [1]_.
sv: Som vi kan se ovan är API:et ganska okomplicerat. Det enda magiska är avsnittet ``DEFAULT`` som innehåller standardvärden för alla andra avsnitt [1]_. Observera också att nycklar i sektioner är skiftlägesokänsliga och lagras med gemener [1]_.

source: It is possible to read several configurations into a single :class:`ConfigParser`, where the most recently added configuration has the highest priority. Any conflicting keys are taken from the more recent configuration while the previously existing keys are retained. The example below reads in an ``override.ini`` file, which will override any conflicting keys from the ``example.ini`` file.
sv: Det är möjligt att läsa in flera konfigurationer i en enda :class:`ConfigParser`, där den senast tillagda konfigurationen har högsta prioritet. Eventuella motstridiga nycklar hämtas från den senaste konfigurationen medan de tidigare befintliga nycklarna behålls. I exemplet nedan läses en fil med namnet ``override.ini`` in, som åsidosätter alla motstridiga nycklar från filen ``example.ini``.

source: >>> config_override = configparser.ConfigParser() >>> config_override['DEFAULT'] = {'ServerAliveInterval': '-1'} >>> with open('override.ini', 'w') as configfile: ... config_override.write(configfile) ... >>> config_override = configparser.ConfigParser() >>> config_override.read(['example.ini', 'override.ini']) ['example.ini', 'override.ini'] >>> print(config_override.get('DEFAULT', 'ServerAliveInterval')) -1
sv: >>> config_override = configparser.ConfigParser() >>> config_override['DEFAULT'] = {'ServerAliveInterval': '-1'} >>> med open('override.ini', 'w') som configfile: ... config_override.write(configfile) ... >>> config_override = configparser.ConfigParser() >>> config_override.read(['example.ini', 'override.ini']) ['example.ini', 'override.ini'] ['example.ini', 'override.ini' >>> print(config_override.get('DEFAULT', 'ServerAliveInterval')) -1

source: This behaviour is equivalent to a :meth:`ConfigParser.read` call with several files passed to the *filenames* parameter.
sv: Detta beteende motsvarar ett anrop av :meth:`ConfigParser.read` med flera filer som skickas till parametern *filnamn*.

source: Supported Datatypes
sv: Datatyper som stöds

source: Config parsers do not guess datatypes of values in configuration files, always storing them internally as strings. This means that if you need other datatypes, you should convert on your own:
sv: Config-parsers gissar inte datatyperna för värden i konfigurationsfiler, utan lagrar dem alltid internt som strängar. Detta innebär att om du behöver andra datatyper bör du konvertera på egen hand:

source: Since this task is so common, config parsers provide a range of handy getter methods to handle integers, floats and booleans. The last one is the most interesting because simply passing the value to ``bool()`` would do no good since ``bool('False')`` is still ``True``. This is why config parsers also provide :meth:`~ConfigParser.getboolean`. This method is case-insensitive and recognizes Boolean values from ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` and ``'1'``/``'0'`` [1]_. For example:
sv: Eftersom den här uppgiften är så vanlig tillhandahåller config-parsers en rad praktiska getter-metoder för att hantera heltal, flottörer och booleaner. Den sista är den mest intressanta eftersom det inte skulle vara bra att bara skicka värdet till ``bool()`` eftersom ``bool('False')`` fortfarande är ``True``. Det är därför som config-parsers också tillhandahåller :meth:`~ConfigParser.getboolean`. Denna metod är skiftlägesokänslig och känner igen booleska värden från ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` och ``'1'``/``'0'`` [1]_. Till exempel:

source: >>> topsecret.getboolean('ForwardX11') False >>> config['forge.example'].getboolean('ForwardX11') True >>> config.getboolean('forge.example', 'Compression') True
sv: >>> topsecret.getboolean('ForwardX11') Falsk >>> config['forge.example'].getboolean('ForwardX11') True >>> config.getboolean('forge.example', 'Compression') True

source: Apart from :meth:`~ConfigParser.getboolean`, config parsers also provide equivalent :meth:`~ConfigParser.getint` and :meth:`~ConfigParser.getfloat` methods. You can register your own converters and customize the provided ones. [1]_
sv: Förutom :meth:`~ConfigParser.getboolean` tillhandahåller config-parser också motsvarande metoder :meth:`~ConfigParser.getint` och :meth:`~ConfigParser.getfloat`. Du kan registrera dina egna omvandlare och anpassa de som tillhandahålls. [1]_

source: Fallback Values
sv: Reservvärden

source: As with a dictionary, you can use a section's :meth:`~ConfigParser.get` method to provide fallback values:
sv: Precis som med en ordbok kan du använda en sektions :meth:`~ConfigParser.get`-metod för att tillhandahålla reservvärden:

source: >>> topsecret.get('Port') '50022' >>> topsecret.get('CompressionLevel') '9' >>> topsecret.get('Cipher') >>> topsecret.get('Cipher', '3des-cbc') '3des-cbc'
sv: >>> topsecret.get('Port') '50022' >>> topsecret.get('Kompressionsnivå') '9' >>> topsecret.get('Cipher') >>> topsecret.get('Cipher', '3des-cbc') '3des-cbc'

source: Please note that default values have precedence over fallback values. For instance, in our example the ``'CompressionLevel'`` key was specified only in the ``'DEFAULT'`` section. If we try to get it from the section ``'topsecret.server.example'``, we will always get the default, even if we specify a fallback:
sv: Observera att standardvärden har företräde framför reservvärden. I vårt exempel har nyckeln ``'CompressionLevel'`` endast angetts i avsnittet ``'DEFAULT'``. Om vi försöker hämta den från avsnittet ``'topsecret.server.example'`` får vi alltid standardvärdet, även om vi anger ett reservvärde:

source: >>> topsecret.get('CompressionLevel', '3') '9'
sv: >>> topsecret.get('Kompressionsnivå', '3') '9'

source: One more thing to be aware of is that the parser-level :meth:`~ConfigParser.get` method provides a custom, more complex interface, maintained for backwards compatibility. When using this method, a fallback value can be provided via the ``fallback`` keyword-only argument:
sv: Ytterligare en sak att vara medveten om är att metoden :meth:`~ConfigParser.get` på parser-nivå ger ett anpassat, mer komplext gränssnitt, som bibehålls för bakåtkompatibilitet. När du använder den här metoden kan ett reservvärde anges via det enda nyckelordsargumentet ``fallback``:

source: >>> config.get('forge.example', 'monster', ... fallback='No such things as monsters') 'No such things as monsters'
sv: >>> config.get('smedja.exempel', 'monster', ... fallback="Det finns inga sådana saker som monster") "Det finns inga sådana saker som monster

source: The same ``fallback`` argument can be used with the :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` and :meth:`~ConfigParser.getboolean` methods, for example:
sv: Samma ``fallback``-argument kan t.ex. användas med metoderna :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` och :meth:`~ConfigParser.getboolean`:

source: >>> 'BatchMode' in topsecret False >>> topsecret.getboolean('BatchMode', fallback=True) True >>> config['DEFAULT']['BatchMode'] = 'no' >>> topsecret.getboolean('BatchMode', fallback=True) False
sv: >>> "BatchMode" i topsecret Falsk >>> topsecret.getboolean('BatchMode', fallback=True) Sant >>> config['DEFAULT']['BatchMode'] = 'no' >>> topsecret.getboolean('BatchMode', fallback=True) False

source: Supported INI File Structure
sv: INI-filstruktur som stöds

source: A configuration file consists of sections, each led by a ``[section]`` header, followed by key/value entries separated by a specific string (``=`` or ``:`` by default [1]_). By default, section names are case sensitive but keys are not [1]_. Leading and trailing whitespace is removed from keys and values. Values can be omitted if the parser is configured to allow it [1]_, in which case the key/value delimiter may also be left out. Values can also span multiple lines, as long as they are indented deeper than the first line of the value. Depending on the parser's mode, blank lines may be treated as parts of multiline values or ignored.
sv: En konfigurationsfil består av sektioner, var och en inledd med en rubrik ``[section]``, följt av nyckel-/värdeposter åtskilda av en specifik sträng (``=`` eller ``:`` som standard [1]_). Som standard är avsnittsnamn skiftlägeskänsliga, men nycklar är det inte [1]_. Ledande och efterföljande blanksteg tas bort från nycklar och värden. Värden kan utelämnas om parsern är konfigurerad att tillåta det [1]_, i vilket fall avgränsaren för nyckel/värde också kan utelämnas. Värden kan också sträcka sig över flera rader, så länge de är indragna djupare än den första raden i värdet. Beroende på parserns läge kan tomma rader behandlas som delar av värden på flera rader eller ignoreras.

source: By default, a valid section name can be any string that does not contain '\\n'. To change this, see :attr:`ConfigParser.SECTCRE`.
sv: Som standard kan ett giltigt sektionsnamn vara en sträng som inte innehåller "\\n". För att ändra detta, se :attr:`ConfigParser.SECTCRE`.

source: The first section name may be omitted if the parser is configured to allow an unnamed top level section with ``allow_unnamed_section=True``. In this case, the keys/values may be retrieved by :const:`UNNAMED_SECTION` as in ``config[UNNAMED_SECTION]``.
sv: Det första sektionsnamnet kan utelämnas om parsern är konfigurerad att tillåta en icke namngiven sektion på högsta nivån med ``allow_unnamed_section=True``. I detta fall kan nycklarna/värdena hämtas med :const:`UNNAMED_SECTION` som i ``config[UNNAMED_SECTION]``.

source: Configuration files may include comments, prefixed by specific characters (``#`` and ``;`` by default [1]_). Comments may appear on their own on an otherwise empty line, possibly indented. [1]_
sv: Konfigurationsfiler kan innehålla kommentarer, som inleds med specifika tecken (``#`` och ``;`` som standard [1]_). Kommentarer kan visas separat på en i övrigt tom rad, eventuellt indragna. [1]_

source: For example:
sv: Till exempel:

source: [Simple Values] key=value spaces in keys=allowed spaces in values=allowed as well spaces around the delimiter = obviously you can also use : to delimit keys from values [All Values Are Strings] values like this: 1000000 or this: 3.14159265359 are they treated as numbers? : no integers, floats and booleans are held as: strings can use the API to get converted values directly: true [Multiline Values] chorus: I'm a lumberjack, and I'm okay I sleep all night and I work all day [No Values] key_without_value empty string value here = [You can use comments] # like this ; or this # By default only in an empty line. # Inline comments can be harmful because they prevent users # from using the delimiting characters as parts of values. # That being said, this can be customized. [Sections Can Be Indented] can_values_be_as_well = True does_that_mean_anything_special = False purpose = formatting for readability multiline_values = are handled just fine as long as they are indented deeper than the first line of a value # Did I mention we can indent comments, too?
sv: [Enkla värden] nyckel=värde mellanslag i nycklar=tillåtet mellanslag i värden=tillåtet också mellanslag runt avgränsaren = självklart du kan också använda : för att avgränsa nycklar från värden [Alla värden är strängar] värden som detta: 1000000 eller detta: 3.14159265359 behandlas de som siffror? : nej heltal, flyttal och booleaner hålls som: strängar kan använda API:et för att få konverterade värden direkt: true [Värden på flera rader] kör: Jag är en skogshuggare, och jag är okej Jag sover hela natten och jag arbetar hela dagen [Inga värden] nyckel_utan_värde tomt strängvärde här = [Du kan använda kommentarer] # så här ; eller så här # Som standard endast på en tom rad. # Inline-kommentarer kan vara skadliga eftersom de hindrar användare # från att använda avgränsande tecken som delar av värden. # Med det sagt kan detta anpassas. [Avsnitt kan vara indragna] can_values_be_as_well = Sant betyder_det_något_speciellt = False syfte = formatering för läsbarhet multiline_values = är hanteras helt okej så länge så länge de är indragna djupare än den första raden av ett värde # Nämnde jag att vi kan indentera kommentarer också?

source: Unnamed Sections
sv: Icke namngivna sektioner

source: The name of the first section (or unique) may be omitted and values retrieved by the :const:`UNNAMED_SECTION` attribute.
sv: Namnet på den första (eller unika) sektionen kan utelämnas och värden hämtas med attributet :const:`UNNAMED_SECTION`.

source: >>> config = """ ... option = value ... ... [ Section 2 ] ... another = val ... """ >>> unnamed = configparser.ConfigParser(allow_unnamed_section=True) >>> unnamed.read_string(config) >>> unnamed.get(configparser.UNNAMED_SECTION, 'option') 'value'
sv: >>> config = """ ... alternativ = värde ... ... [ Avsnitt 2 ] ... en annan = val ... """ >>> unnamed = configparser.ConfigParser(allow_unnamed_section=True) >>> unnamed.read_string(config) >>> unnamed.get(configparser.UNNAMAMED_SECTION, 'option') 'värde'

source: Interpolation of values
sv: Interpolering av värden

source: On top of the core functionality, :class:`ConfigParser` supports interpolation. This means values can be preprocessed before returning them from ``get()`` calls.
sv: Utöver kärnfunktionaliteten har :class:`ConfigParser` stöd för interpolering. Detta innebär att värden kan förbehandlas innan de returneras från ``get()``-anrop.

source: The default implementation used by :class:`ConfigParser`. It enables values to contain format strings which refer to other values in the same section, or values in the special default section [1]_. Additional default values can be provided on initialization.
sv: Standardimplementationen som används av :class:`ConfigParser`. Den gör det möjligt för värden att innehålla formatsträngar som hänvisar till andra värden i samma avsnitt, eller värden i det speciella standardavsnittet [1]_. Ytterligare standardvärden kan anges vid initiering.

source: [Paths] home_dir: /Users my_dir: %(home_dir)s/lumberjack my_pictures: %(my_dir)s/Pictures [Escape] # use a %% to escape the % sign (% is the only character that needs to be escaped): gain: 80%%
sv: [Sökvägar] hem_dir: /Användare min_dir: %(home_dir)s/lumberjack my_pictures: %(my_dir)s/Bilder [Escape] # använd en %% för att undkomma % sign (% i är det enda tecken som behöver undkommas): vinst: 80%%

source: In the example above, :class:`ConfigParser` with *interpolation* set to ``BasicInterpolation()`` would resolve ``%(home_dir)s`` to the value of ``home_dir`` (``/Users`` in this case). ``%(my_dir)s`` in effect would resolve to ``/Users/lumberjack``. All interpolations are done on demand so keys used in the chain of references do not have to be specified in any specific order in the configuration file.
sv: I exemplet ovan skulle :class:`ConfigParser` med *interpolation* inställd på ``BasicInterpolation()`` lösa ``%(home_dir)s`` till värdet av ``home_dir`` (``/Users`` i det här fallet). ``%(my_dir)s`` skulle i praktiken motsvara ``/Users/lumberjack``. Alla interpoleringar görs på begäran så nycklar som används i kedjan av referenser behöver inte anges i någon specifik ordning i konfigurationsfilen.

source: With ``interpolation`` set to ``None``, the parser would simply return ``%(my_dir)s/Pictures`` as the value of ``my_pictures`` and ``%(home_dir)s/lumberjack`` as the value of ``my_dir``.
sv: Med ``interpolation`` inställd på ``None`` skulle parsern helt enkelt returnera ``%(my_dir)s/Pictures`` som värdet på ``my_pictures`` och ``%(home_dir)s/lumberjack`` som värdet på ``my_dir``.

source: An alternative handler for interpolation which implements a more advanced syntax, used for instance in ``zc.buildout``. Extended interpolation is using ``${section:option}`` to denote a value from a foreign section. Interpolation can span multiple levels. For convenience, if the ``section:`` part is omitted, interpolation defaults to the current section (and possibly the default values from the special section).
sv: En alternativ hanterare för interpolering som implementerar en mer avancerad syntax, som t.ex. används i ``zc.buildout``. Utökad interpolering är att använda ``${section:option}`` för att beteckna ett värde från en utländsk sektion. Interpolering kan sträcka sig över flera nivåer. För enkelhetens skull, om ``section:`` utelämnas, blir standardvärdet för interpolering det aktuella avsnittet (och eventuellt standardvärdena från specialavsnittet).

source: For example, the configuration specified above with basic interpolation, would look like this with extended interpolation:
sv: Den konfiguration som anges ovan med grundläggande interpolering skulle t.ex. se ut så här med utökad interpolering:
