Repository: yeager/python-docs-sv
Catalog: library/configparser.po
Languages: sv

source: [Paths] home_dir: /Users my_dir: ${home_dir}/lumberjack my_pictures: ${my_dir}/Pictures [Escape] # use a $$ to escape the $ sign ($ is the only character that needs to be escaped): cost: $$80
sv: [Sökvägar] hem_dir: /Användare min_dir: ${home_dir}/lumberjack my_pictures: ${my_dir}/Bilder [Escape] # använd en $$ för att undkomma tecknet $ ($ är det enda tecken som behöver undkommas): kostnad: $$80

source: Values from other sections can be fetched as well:
sv: Värden från andra sektioner kan också hämtas:

source: [Common] home_dir: /Users library_dir: /Library system_dir: /System macports_dir: /opt/local [Frameworks] Python: 3.2 path: ${Common:system_dir}/Library/Frameworks/ [Arthur] nickname: Two Sheds last_name: Jackson my_dir: ${Common:home_dir}/twosheds my_pictures: ${my_dir}/Pictures python_dir: ${Frameworks:path}/Python/Versions/${Frameworks:Python}
sv: [Vanlig] hem_dir: /Användare bibliotek_dir: /Bibliotek system_dir: /System macports_dir: /opt/lokal [Ramverk] Python: 3.2 sökväg: ${Common:system_dir}/Bibliotek/Framverk/ [Arthur] smeknamn: Two Sheds efternamn: Jackson min_dir: ${Common:home_dir}/twosheds mina_bilder: ${my_dir}/Bilder python_dir: ${Frameworks:path}/Python/Versioner/${Frameworks:Python}

source: Mapping Protocol Access
sv: Mappning Protokoll Åtkomst

source: Mapping protocol access is a generic name for functionality that enables using custom objects as if they were dictionaries. In case of :mod:`configparser`, the mapping interface implementation is using the ``parser['section']['option']`` notation.
sv: Mappningsprotokollåtkomst är ett generiskt namn för funktionalitet som gör det möjligt att använda anpassade objekt som om de vore lexikon. I fallet med :mod:`configparser` använder implementationen av mappningsgränssnittet notationen ``parser['section']['option']``.

source: ``parser['section']`` in particular returns a proxy for the section's data in the parser. This means that the values are not copied but they are taken from the original parser on demand. What's even more important is that when values are changed on a section proxy, they are actually mutated in the original parser.
sv: ``parser['section']`` returnerar i synnerhet en proxy för sektionens data i parsern. Detta innebär att värdena inte kopieras utan hämtas från den ursprungliga parsern på begäran. Vad som är ännu viktigare är att när värden ändras på en sektionsproxy, så ändras de faktiskt i den ursprungliga parsern.

source: :mod:`configparser` objects behave as close to actual dictionaries as possible. The mapping interface is complete and adheres to the :class:`~collections.abc.MutableMapping` ABC. However, there are a few differences that should be taken into account:
sv: :mod:`configparser`-objekt beter sig så nära faktiska ordböcker som möjligt. Mappningsgränssnittet är komplett och följer :class:`~collections.abc.MutableMapping` ABC. Det finns dock några skillnader som bör tas med i beräkningen:

source: By default, all keys in sections are accessible in a case-insensitive manner [1]_. E.g. ``for option in parser["section"]`` yields only ``optionxform``'ed option key names. This means lowercased keys by default. At the same time, for a section that holds the key ``'a'``, both expressions return ``True``::
sv: Som standard är alla nycklar i sektioner tillgängliga på ett skiftlägesokänsligt sätt [1]_. T.ex. ``for option in parser["section"]`` ger endast ``optionxform``'ed alternativnyckelnamn. Detta innebär att nycklarna som standard har gemener. Samtidigt, för ett avsnitt som innehåller nyckeln ``'a'``, returnerar båda uttrycken ``True``::

source: "a" in parser["section"] "A" in parser["section"]
sv: "a" i parser["section"] "A" i parser["section"]

source: All sections include ``DEFAULTSECT`` values as well which means that ``.clear()`` on a section may not leave the section visibly empty. This is because default values cannot be deleted from the section (because technically they are not there). If they are overridden in the section, deleting causes the default value to be visible again. Trying to delete a default value causes a :exc:`KeyError`.
sv: Alla sektioner innehåller även ``DEFAULTSECT``-värden, vilket innebär att ``.clear()`` på en sektion kanske inte lämnar sektionen synligt tom. Detta beror på att standardvärden inte kan tas bort från avsnittet (eftersom de tekniskt sett inte finns där). Om de är åsidosatta i avsnittet, gör borttagningen att standardvärdet blir synligt igen. Försök att ta bort ett standardvärde orsakar ett :exc:`KeyError`.

source: ``DEFAULTSECT`` cannot be removed from the parser:
sv: ``DEFAULTSECT`` kan inte tas bort från parsern:

source: trying to delete it raises :exc:`ValueError`,
sv: försök att ta bort det ger :exc:`ValueError`,

source: ``parser.clear()`` leaves it intact,
sv: ``parser.clear()`` lämnar den intakt,

source: ``parser.popitem()`` never returns it.
sv: ``parser.popitem()`` returnerar den aldrig.

source: ``parser.get(section, option, **kwargs)`` - the second argument is **not** a fallback value. Note however that the section-level ``get()`` methods are compatible both with the mapping protocol and the classic configparser API.
sv: ``parser.get(section, option, **kwargs)`` - det andra argumentet är **inte** ett fallback-värde. Observera dock att metoderna ``get()`` på sektionsnivå är kompatibla både med mappningsprotokollet och det klassiska configparser-API:et.

source: ``parser.items()`` is compatible with the mapping protocol (returns a list of *section_name*, *section_proxy* pairs including the DEFAULTSECT). However, this method can also be invoked with arguments: ``parser.items(section, raw, vars)``. The latter call returns a list of *option*, *value* pairs for a specified ``section``, with all interpolations expanded (unless ``raw=True`` is provided).
sv: ``parser.items()`` är kompatibel med mappningsprotokollet (returnerar en lista med paren *section_name*, *section_proxy* inklusive DEFAULTSECT). Den här metoden kan dock också anropas med argument: ``parser.items(section, raw, vars)``. Det senare anropet returnerar en lista med paren *option*, *value* för en angiven ``section``, med alla interpoleringar expanderade (om inte ``raw=True`` anges).

source: The mapping protocol is implemented on top of the existing legacy API so that subclasses overriding the original interface still should have mappings working as expected.
sv: Mappningsprotokollet implementeras ovanpå det befintliga äldre API:et så att subklasser som åsidosätter det ursprungliga gränssnittet fortfarande bör ha mappningar som fungerar som förväntat.

source: Customizing Parser Behaviour
sv: Anpassa parserns beteende

source: There are nearly as many INI format variants as there are applications using it. :mod:`configparser` goes a long way to provide support for the largest sensible set of INI styles available. The default functionality is mainly dictated by historical background and it's very likely that you will want to customize some of the features.
sv: Det finns nästan lika många INI-formatvarianter som det finns applikationer som använder det. :mod:`configparser` gör mycket för att ge stöd för den största möjliga uppsättningen INI-stilar som finns tillgängliga. Standardfunktionaliteten dikteras huvudsakligen av historisk bakgrund och det är mycket troligt att du kommer att vilja anpassa några av funktionerna.

source: The most common way to change the way a specific config parser works is to use the :meth:`!__init__` options:
sv: Det vanligaste sättet att ändra hur en specifik konfigurationsparser fungerar är att använda :meth:`!__init__`-alternativen:

source: *defaults*, default value: ``None``
sv: *defaults*, standardvärde: ``None``

source: This option accepts a dictionary of key-value pairs which will be initially put in the ``DEFAULT`` section. This makes for an elegant way to support concise configuration files that don't specify values which are the same as the documented default.
sv: Detta alternativ accepterar en ordlista med nyckel-värdepar som initialt kommer att placeras i avsnittet ``DEFAULT``. Detta är ett elegant sätt att stödja kortfattade konfigurationsfiler som inte anger värden som är desamma som den dokumenterade standardinställningen.

source: Hint: if you want to specify default values for a specific section, use :meth:`~ConfigParser.read_dict` before you read the actual file.
sv: Tips: Om du vill ange standardvärden för ett visst avsnitt använder du :meth:`~ConfigParser.read_dict` innan du läser den faktiska filen.

source: *dict_type*, default value: :class:`dict`
sv: *dict_type*, standardvärde: :class:`dict`

source: This option has a major impact on how the mapping protocol will behave and how the written configuration files look. With the standard dictionary, every section is stored in the order they were added to the parser. Same goes for options within sections.
sv: Detta alternativ har stor inverkan på hur mappningsprotokollet kommer att bete sig och hur de skrivna konfigurationsfilerna ser ut. Med standardordboken lagras varje avsnitt i den ordning som de lades till i parsern. Detsamma gäller för alternativ inom avsnitt.

source: An alternative dictionary type can be used for example to sort sections and options on write-back.
sv: En alternativ ordbokstyp kan t.ex. användas för att sortera sektioner och alternativ på write-back.

source: Please note: there are ways to add a set of key-value pairs in a single operation. When you use a regular dictionary in those operations, the order of the keys will be ordered. For example:
sv: Observera: Det finns sätt att lägga till en uppsättning nyckel-värdepar i en enda operation. När du använder en vanlig ordbok i dessa operationer kommer ordningen på nycklarna att vara ordnad. Till exempel:

source: >>> parser = configparser.ConfigParser() >>> parser.read_dict({'section1': {'key1': 'value1', ... 'key2': 'value2', ... 'key3': 'value3'}, ... 'section2': {'keyA': 'valueA', ... 'keyB': 'valueB', ... 'keyC': 'valueC'}, ... 'section3': {'foo': 'x', ... 'bar': 'y', ... 'baz': 'z'} ... }) >>> parser.sections() ['section1', 'section2', 'section3'] >>> [option for option in parser['section3']] ['foo', 'bar', 'baz']
sv: >>> parser = configparser.ConfigParser() >>> parser.read_dict({'section1': {'key1': 'value1', ... 'key2': 'value2', ... 'key3': 'value3'}, ... 'section2': {'keyA': 'valueA', ... 'keyB': 'valueB', ... 'keyC': 'valueC'}, ... 'section3': {'foo': 'x', ... 'bar': 'y', ... 'baz': 'z'} ... }) >>> parser.sections() ['section1', 'section2', 'section3'] >>> [alternativ för alternativ i parser['section3']]] ['foo', 'bar', 'baz']

source: *allow_no_value*, default value: ``False``
sv: *allow_no_value*, standardvärde: ``False``

source: Some configuration files are known to include settings without values, but which otherwise conform to the syntax supported by :mod:`configparser`. The *allow_no_value* parameter to the constructor can be used to indicate that such values should be accepted:
sv: Det är känt att vissa konfigurationsfiler innehåller inställningar utan värden, men som i övrigt överensstämmer med den syntax som stöds av :mod:`configparser`. Parametern *allow_no_value* till konstruktören kan användas för att ange att sådana värden ska accepteras:

source: *delimiters*, default value: ``('=', ':')``
sv: *avgränsningstecken*, standardvärde: ``('=', ':')``

source: Delimiters are substrings that delimit keys from values within a section. The first occurrence of a delimiting substring on a line is considered a delimiter. This means values (but not keys) can contain the delimiters.
sv: Avgränsare är substrängar som avgränsar nycklar från värden inom ett avsnitt. Den första förekomsten av en avgränsande substräng på en rad betraktas som en avgränsare. Detta innebär att värden (men inte nycklar) kan innehålla avgränsare.

source: See also the *space_around_delimiters* argument to :meth:`ConfigParser.write`.
sv: Se även argumentet *space_around_delimiters* till :meth:`ConfigParser.write`.

source: *comment_prefixes*, default value: ``('#', ';')``
sv: *comment_prefixes*, standardvärde: ``('#', ';')```

source: *inline_comment_prefixes*, default value: ``None``
sv: *inline_comment_prefixes*, standardvärde: ``None``

source: Comment prefixes are strings that indicate the start of a valid comment within a config file. *comment_prefixes* are used only on otherwise empty lines (optionally indented) whereas *inline_comment_prefixes* can be used after every valid value (e.g. section names, options and empty lines as well). By default inline comments are disabled and ``'#'`` and ``';'`` are used as prefixes for whole line comments.
sv: Comment prefixes är strängar som anger början på en giltig kommentar i en konfigurationsfil. *comment_prefixes* används endast på annars tomma rader (eventuellt indragna) medan *inline_comment_prefixes* kan användas efter varje giltigt värde (t.ex. sektionsnamn, alternativ och även tomma rader). Som standard är inline-kommentarer inaktiverade och ``'#'`` och ``';'`` används som prefix för kommentarer på hela rader.

source: In previous versions of :mod:`configparser` behaviour matched ``comment_prefixes=('#',';')`` and ``inline_comment_prefixes=(';',)``.
sv: I tidigare versioner av :mod:`configparser` matchade beteendet ``comment_prefixes=('#',';')`` och ``inline_comment_prefixes=(';',)``.

source: Please note that config parsers don't support escaping of comment prefixes so using *inline_comment_prefixes* may prevent users from specifying option values with characters used as comment prefixes. When in doubt, avoid setting *inline_comment_prefixes*. In any circumstances, the only way of storing comment prefix characters at the beginning of a line in multiline values is to interpolate the prefix, for example::
sv: Observera att konfigurationsanalysatorer inte stöder escaping av kommentarprefix, så om du använder *inline_comment_prefixes* kan det hindra användare från att ange alternativvärden med tecken som används som kommentarprefix. Undvik att ange *inline_comment_prefixes* när du är osäker. Under alla omständigheter är det enda sättet att lagra prefixtecken för kommentarer i början av en rad i flerradiga värden att interpolera prefixet, t.ex.::

source: >>> from configparser import ConfigParser, ExtendedInterpolation >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> # the default BasicInterpolation could be used as well >>> parser.read_string(""" ... [DEFAULT] ... hash = # ... ... [hashes] ... shebang = ... ${hash}!/usr/bin/env python ... ${hash} -*- coding: utf-8 -*- ... ... extensions = ... enabled_extension ... another_extension ... #disabled_by_comment ... yet_another_extension ... ... interpolation not necessary = if # is not at line start ... even in multiline values = line #1 ... line #2 ... line #3 ... """) >>> print(parser['hashes']['shebang']) #!/usr/bin/env python # -*- coding: utf-8 -*- >>> print(parser['hashes']['extensions']) enabled_extension another_extension yet_another_extension >>> print(parser['hashes']['interpolation not necessary']) if # is not at line start >>> print(parser['hashes']['even in multiline values']) line #1 line #2 line #3
sv: >>> from configparser import ConfigParser, UtökadInterpolation >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> # standard BasicInterpolation kan också användas >>> parser.read_string(""" ... [DEFAULT] ... hash = # ... ... [hash] ... shebang = ... ${hash}!/usr/bin/env python ... ${hash} -*- kodning: utf-8 -*- ... ... tillägg = ... aktiverad_utvidgning ... en annan_utvidgning ... # inaktiverad_av_kommentar ... ännu_en annan_förlängning ... ... interpolering inte nödvändig = om # inte är i början av raden ... även i värden med flera rader = rad #1 ... rad 2 ... rad #3 ... """) >>> print(parser['hashes']['shebang']) #!/usr/bin/env python # -*- kodning: utf-8 -*- >>> print(parser['hashes']['extensions']) aktiverad_utvidgning another_extension yet_another_extension >>> print(parser['hashes']['interpolation ej nödvändig']) om # inte är vid radstart >>> print(parser['hashes']['även i värden med flera rader']) rad #1 rad #2 rad #3

source: *strict*, default value: ``True``
sv: *strict*, standardvärde: ``True``

source: When set to ``True``, the parser will not allow for any section or option duplicates while reading from a single source (using :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` or :meth:`~ConfigParser.read_dict`). It is recommended to use strict parsers in new applications.
sv: När inställningen är ``True`` tillåter inte parsern att avsnitt eller alternativ dupliceras när den läser från en enda källa (med :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` eller :meth:`~ConfigParser.read_dict`). Det rekommenderas att använda strikta parsers i nya applikationer.

source: In previous versions of :mod:`configparser` behaviour matched ``strict=False``.
sv: I tidigare versioner av :mod:`configparser` matchade beteendet ``strict=False``.

source: *empty_lines_in_values*, default value: ``True``
sv: *empty_lines_in_values*, standardvärde: ``True``

source: In config parsers, values can span multiple lines as long as they are indented more than the key that holds them. By default parsers also let empty lines to be parts of values. At the same time, keys can be arbitrarily indented themselves to improve readability. In consequence, when configuration files get big and complex, it is easy for the user to lose track of the file structure. Take for instance:
sv: I config-parsers kan värden sträcka sig över flera rader så länge de är indragna mer än den nyckel som innehåller dem. Som standard låter parsers även tomma rader vara delar av värden. Samtidigt kan nycklarna själva vara godtyckligt indragna för att förbättra läsbarheten. När konfigurationsfiler blir stora och komplexa är det därför lätt för användaren att tappa bort filstrukturen. Ta till exempel:

source: [Section] key = multiline value with a gotcha this = is still a part of the multiline value of 'key'
sv: [Sektion] nyckel = multilinje värde med en gotcha detta = är fortfarande en del av det flerledade värdet av 'nyckel'

source: This can be especially problematic for the user to see if she's using a proportional font to edit the file. That is why when your application does not need values with empty lines, you should consider disallowing them. This will make empty lines split keys every time. In the example above, it would produce two keys, ``key`` and ``this``.
sv: Detta kan vara särskilt problematiskt för användaren att se om hon använder ett proportionellt teckensnitt för att redigera filen. Det är därför du bör överväga att inte tillåta värden med tomma rader när din applikation inte behöver dem. Detta kommer att göra att tomma rader delar tangenter varje gång. I exemplet ovan skulle det ge två nycklar, ``key`` och ``this``.

source: *default_section*, default value: ``configparser.DEFAULTSECT`` (that is: ``"DEFAULT"``)
sv: *default_section*, standardvärde: ``configparser.DEFAULTSECT`` (det vill säga: ``"DEFAULT"``)

source: The convention of allowing a special section of default values for other sections or interpolation purposes is a powerful concept of this library, letting users create complex declarative configurations. This section is normally called ``"DEFAULT"`` but this can be customized to point to any other valid section name. Some typical values include: ``"general"`` or ``"common"``. The name provided is used for recognizing default sections when reading from any source and is used when writing configuration back to a file. Its current value can be retrieved using the ``parser_instance.default_section`` attribute and may be modified at runtime (i.e. to convert files from one format to another).
sv: Konventionen att tillåta ett speciellt avsnitt med standardvärden för andra avsnitt eller interpoleringsändamål är ett kraftfullt koncept i detta bibliotek, vilket gör det möjligt för användare att skapa komplexa deklarativa konfigurationer. Detta avsnitt kallas normalt ``"DEFAULT"`` men det kan anpassas så att det pekar på vilket annat giltigt avsnittsnamn som helst. Några typiska värden är t.ex: ``"general"`` eller ``"common"``. Det angivna namnet används för att känna igen standardavsnitt när man läser från en källa och används när man skriver tillbaka konfigurationen till en fil. Dess aktuella värde kan hämtas med hjälp av attributet ``parser_instance.default_section`` och kan ändras under körning (t.ex. för att konvertera filer från ett format till ett annat).

source: *interpolation*, default value: ``configparser.BasicInterpolation``
sv: *interpolation*, standardvärde: ``configparser.BasicInterpolation``

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_. :class:`RawConfigParser` has a default value of ``None``.
sv: Interpolationsbeteendet kan anpassas genom att tillhandahålla en anpassad hanterare via argumentet *interpolation*. ``None`` kan användas för att stänga av interpolering helt, ``ExtendedInterpolation()`` ger en mer avancerad variant inspirerad av ``zc.buildout``. Mer om ämnet i det `dedikerade dokumentationsavsnittet <#interpolation-av-värden>`_. :class:`RawConfigParser` har ett standardvärde på ``None``.

source: *converters*, default value: not set
sv: *omvandlare*, standardvärde: inte inställt

source: Config parsers provide option value getters that perform type conversion. By default :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat`, and :meth:`~ConfigParser.getboolean` are implemented. Should other getters be desirable, users may define them in a subclass or pass a dictionary where each key is a name of the converter and each value is a callable implementing said conversion. For instance, passing ``{'decimal': decimal.Decimal}`` would add :meth:`!getdecimal` on both the parser object and all section proxies. In other words, it will be possible to write both ``parser_instance.getdecimal('section', 'key', fallback=0)`` and ``parser_instance['section'].getdecimal('key', 0)``.
sv: Config-parsers tillhandahåller getters för alternativvärden som utför typkonvertering. Som standard implementeras :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` och :meth:`~ConfigParser.getboolean`. Om andra getters är önskvärda kan användare definiera dem i en subklass eller skicka en dictionary där varje nyckel är ett namn på omvandlaren och varje värde är en anropsbar som implementerar omvandlingen. Till exempel, om man skickar ``{'decimal': decimal.Decimal}`` skulle man lägga till :meth:`!getdecimal` på både parserobjektet och alla sektionsproxies. Med andra ord kommer det att vara möjligt att skriva både ``parser_instance.getdecimal('section', 'key', fallback=0)`` och ``parser_instance['section'].getdecimal('key', 0)``.

source: If the converter needs to access the state of the parser, it can be implemented as a method on a config parser subclass. If the name of this method starts with ``get``, it will be available on all section proxies, in the dict-compatible form (see the ``getdecimal()`` example above).
sv: Om omvandlaren behöver komma åt parserns tillstånd kan det implementeras som en metod i en config parser-underklass. Om namnet på denna metod börjar med ``get`` kommer den att vara tillgänglig på alla sektionsproxyer, i den dict-kompatibla formen (se exemplet ``getdecimal()`` ovan).
