Repository: yeager/python-docs-sv
Catalog: library/configparser.po
Languages: sv

source: A convenience method which coerces the *option* in the specified *section* to a Boolean value. Note that the accepted values for the option are ``'1'``, ``'yes'``, ``'true'``, and ``'on'``, which cause this method to return ``True``, and ``'0'``, ``'no'``, ``'false'``, and ``'off'``, which cause it to return ``False``. These string values are checked in a case-insensitive manner. Any other value will cause it to raise :exc:`ValueError`. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
sv: En bekvämlighetsmetod som tvingar *alternativet* i den angivna *sektionen* till ett booleskt värde. Observera att de accepterade värdena för alternativet är ``'1'``, ``'yes'``, ``'true'`` och ``'on'``, som gör att denna metod returnerar ``True``, och ``'0'``, ``'no'``, ``'false'`` och ``'off'``, som gör att den returnerar ``False``. Dessa strängvärden kontrolleras på ett sätt som inte tar hänsyn till skiftlägesskillnader. Alla andra värden kommer att ge upphov till :exc:`ValueError`. Se :meth:`get` för förklaring av *raw*, *vars* och *fallback*.

source: When *section* is not given, return a list of *section_name*, *section_proxy* pairs, including DEFAULTSECT.
sv: Om *section* inte anges, returneras en lista med paren *section_name*, *section_proxy*, inklusive DEFAULTSECT.

source: Otherwise, return a list of *name*, *value* pairs for the options in the given *section*. Optional arguments have the same meaning as for the :meth:`get` method.
sv: I annat fall returneras en lista med paren *namn*, *värde* för alternativen i den angivna *sektionen*. Valfria argument har samma betydelse som för metoden :meth:`get`.

source: Items present in *vars* no longer appear in the result. The previous behaviour mixed actual parser options with variables provided for interpolation.
sv: Objekt som finns i *vars* visas inte längre i resultatet. Det tidigare beteendet blandade faktiska parseralternativ med variabler som tillhandahölls för interpolering.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. *option* and *value* must be strings; if not, :exc:`TypeError` is raised.
sv: Om det givna avsnittet finns, sätt det givna alternativet till det angivna värdet; annars uppstår :exc:`NoSectionError`. *option* och *value* måste vara strängar; om inte, uppstår :exc:`TypeError`.

source: Write a representation of the configuration to the specified :term:`file object`, which must be opened in text mode (accepting strings). This representation can be parsed by a future :meth:`read` call. If *space_around_delimiters* is true, delimiters between keys and values are surrounded by spaces.
sv: Skriver en representation av konfigurationen till det angivna :term:`filobjektet`, som måste öppnas i textläge (accepterar strängar). Denna representation kan analyseras av ett framtida :meth:`read`-anrop. Om *space_around_delimiters* är true, omges avgränsningar mellan nycklar och värden av mellanslag.

source: Raises InvalidWriteError if this would write a representation which cannot be accurately parsed by a future :meth:`read` call from this parser.
sv: Utlöser InvalidWriteError om detta skulle skriva en representation som inte kan analyseras korrekt av ett framtida :meth:`read`-anrop från denna analysator.

source: Comments in the original configuration file are not preserved when writing the configuration back. What is considered a comment, depends on the given values for *comment_prefix* and *inline_comment_prefix*.
sv: Kommentarer i den ursprungliga konfigurationsfilen bevaras inte när konfigurationen skrivs tillbaka. Vad som betraktas som en kommentar beror på de angivna värdena för *comment_prefix* och *inline_comment_prefix*.

source: Remove the specified *option* from the specified *section*. If the section does not exist, raise :exc:`NoSectionError`. If the option existed to be removed, return :const:`True`; otherwise return :const:`False`.
sv: Tar bort det angivna *alternativet* från det angivna *avsnittet*. Om sektionen inte finns, returneras :exc:`NoSectionError`. Om alternativet existerade för att tas bort, returneras :const:`True`; annars returneras :const:`False`.

source: Remove the specified *section* from the configuration. If the section in fact existed, return ``True``. Otherwise return ``False``.
sv: Tar bort den angivna *sektionen* från konfigurationen. Om avsnittet faktiskt existerade returneras ``True``. Annars returneras ``False``.

source: Transforms the option name *option* as found in an input file or as passed in by client code to the form that should be used in the internal structures. The default implementation returns a lower-case version of *option*; subclasses may override this or client code can set an attribute of this name on instances to affect this behavior.
sv: Transformerar optionsnamnet *option* som finns i en indatafil eller som skickas in av klientkod till den form som ska användas i de interna strukturerna. Standardimplementeringen returnerar en version av *option* med små bokstäver; subklasser kan åsidosätta detta eller så kan klientkoden ange ett attribut med detta namn på instanser för att påverka detta beteende.

source: You don't need to subclass the parser to use this method, you can also set it on an instance, to a function that takes a string argument and returns a string. Setting it to ``str``, for example, would make option names case sensitive::
sv: Du behöver inte underklassa parsern för att använda den här metoden, du kan också ställa in den på en instans, till en funktion som tar ett strängargument och returnerar en sträng. Att ställa in den till ``str``, till exempel, skulle göra alternativnamn skiftlägeskänsliga::

source: Note that when reading configuration files, whitespace around the option names is stripped before :meth:`optionxform` is called.
sv: Observera att vid läsning av konfigurationsfiler tas blanksteg runt alternativnamnen bort innan :meth:`optionxform` anropas.

source: A special object representing a section name used to reference the unnamed section (see :ref:`unnamed-sections`).
sv: Ett specialobjekt som representerar ett sektionsnamn som används för att referera till en icke namngiven sektion (se :ref:`unnamed-sections`).

source: The maximum depth for recursive interpolation for :meth:`~configparser.ConfigParser.get` when the *raw* parameter is false. This is relevant only when the default *interpolation* is used.
sv: Det maximala djupet för rekursiv interpolation för :meth:`~configparser.ConfigParser.get` när parametern *raw* är false. Detta är endast relevant när standardvärdet *interpolation* används.

source: RawConfigParser Objects
sv: RawConfigParser-objekt

source: Legacy variant of the :class:`ConfigParser`. It has interpolation disabled by default and allows for non-string section names, option names, and values via its unsafe ``add_section`` and ``set`` methods, as well as the legacy ``defaults=`` keyword argument handling.
sv: Äldre variant av :class:`ConfigParser`. Den har interpolering inaktiverad som standard och tillåter icke-strängade sektionsnamn, alternativnamn och värden via dess osäkra metoder ``add_section`` och ``set``, samt den äldre ``defaults=`` nyckelordsargumenthanteringen.

source: Consider using :class:`ConfigParser` instead which checks types of the values to be stored internally. If you don't want interpolation, you can use ``ConfigParser(interpolation=None)``.
sv: Överväg att använda :class:`ConfigParser` istället, som kontrollerar typerna för de värden som ska lagras internt. Om du inte vill ha interpolering kan du använda ``ConfigParser(interpolation=None)``.

source: Add a section named *section* or :const:`UNNAMED_SECTION` to the instance.
sv: Lägg till en sektion med namnet *section* eller :const:`UNNAMED_SECTION` till instansen.

source: If the given section already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised. If :const:`UNNAMED_SECTION` is passed and support is disabled, :exc:`UnnamedSectionDisabledError` is raised.
sv: Om den angivna sektionen redan existerar, :exc:`DuplicateSectionError`. Om *standardnamnet* på sektionen anges, genereras :exc:`ValueError`. Om :const:`UNNAMED_SECTION` anges och stödet är inaktiverat, genereras :exc:`UnnamedSectionDisabledError`.

source: Type of *section* is not checked which lets users create non-string named sections. This behaviour is unsupported and may cause internal errors.
sv: Type of *section* kontrolleras inte, vilket gör det möjligt för användare att skapa avsnitt med namn som inte är strängnamn. Detta beteende stöds inte och kan orsaka interna fel.

source: Added support for :const:`UNNAMED_SECTION`.
sv: Lagt till stöd för :const:`UNNAMED_SECTION`.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. While it is possible to use :class:`RawConfigParser` (or :class:`ConfigParser` with *raw* parameters set to true) for *internal* storage of non-string values, full functionality (including interpolation and output to files) can only be achieved using string values.
sv: Om den givna sektionen finns, sätt det givna alternativet till det angivna värdet; annars uppstår :exc:`NoSectionError`. Det är möjligt att använda :class:`RawConfigParser` (eller :class:`ConfigParser` med *raw*-parametrar inställda på true) för *intern* lagring av värden som inte är strängvärden, men full funktionalitet (inklusive interpolering och utmatning till filer) kan endast uppnås med strängvärden.

source: This method lets users assign non-string values to keys internally. This behaviour is unsupported and will cause errors when attempting to write to a file or get it in non-raw mode. **Use the mapping protocol API** which does not allow such assignments to take place.
sv: Med den här metoden kan användare tilldela icke-strängvärden till nycklar internt. Detta beteende stöds inte och kommer att orsaka fel när man försöker skriva till en fil eller hämta den i icke-rått läge. **Använd mappningsprotokollets API** som inte tillåter att sådana tilldelningar sker.

source: Exceptions
sv: Undantag

source: Base class for all other :mod:`configparser` exceptions.
sv: Basklass för alla andra :mod:`configparser`-undantag.

source: Exception raised when a specified section is not found.
sv: Undantag som uppstår när ett angivet avsnitt inte hittas.

source: Exception raised if :meth:`~ConfigParser.add_section` is called with the name of a section that is already present or in strict parsers when a section if found more than once in a single input file, string or dictionary.
sv: Undantag om :meth:`~ConfigParser.add_section` anropas med namnet på ett avsnitt som redan finns eller i strikta parsers när ett avsnitt hittas mer än en gång i en enda indatafil, sträng eller ordbok.

source: Added the optional *source* and *lineno* attributes and parameters to :meth:`!__init__`.
sv: Lagt till de valfria attributen och parametrarna *source* och *lineno* till :meth:`!__init__`.

source: Exception raised by strict parsers if a single option appears twice during reading from a single file, string or dictionary. This catches misspellings and case sensitivity-related errors, e.g. a dictionary may have two keys representing the same case-insensitive configuration key.
sv: Undantag som tas upp av strikta parsers om ett enda alternativ visas två gånger under läsning från en enda fil, sträng eller ordbok. Detta fångar upp felstavningar och fel relaterade till skiftlägeskänslighet, t.ex. kan en ordbok ha två nycklar som representerar samma skiftlägesokänsliga konfigurationsnyckel.

source: Exception raised when a specified option is not found in the specified section.
sv: Undantag som uppstår när ett angivet alternativ inte finns i det angivna avsnittet.

source: Base class for exceptions raised when problems occur performing string interpolation.
sv: Basklass för undantag som uppstår när det uppstår problem vid stränginterpolering.

source: Exception raised when string interpolation cannot be completed because the number of iterations exceeds :const:`MAX_INTERPOLATION_DEPTH`. Subclass of :exc:`InterpolationError`.
sv: Undantag som uppstår när stränginterpolering inte kan slutföras eftersom antalet iterationer överstiger :const:`MAX_INTERPOLATION_DEPTH`. Underklass till :exc:`InterpolationError`.

source: Exception raised when an option referenced from a value does not exist. Subclass of :exc:`InterpolationError`.
sv: Undantag som uppstår när ett alternativ som refereras från ett värde inte finns. Underklass till :exc:`InterpolationError`.

source: Exception raised when the source text into which substitutions are made does not conform to the required syntax. Subclass of :exc:`InterpolationError`.
sv: Undantag som uppstår när källtexten i vilken substitutioner görs inte överensstämmer med den syntax som krävs. Underklass till :exc:`InterpolationError`.

source: Exception raised when attempting to parse a file which has no section headers.
sv: Exception vid försök att analysera en fil som inte har några avsnittsrubriker.

source: Exception raised when errors occur attempting to parse a file.
sv: Undantag som uppstår när fel inträffar vid försök att analysera en fil.

source: The ``filename`` attribute and :meth:`!__init__` constructor argument were removed. They have been available using the name ``source`` since 3.2.
sv: Attributet ``filnamn`` och :meth:`!__init__`-konstruktörsargumentet togs bort. De har varit tillgängliga med namnet ``source`` sedan 3.2.

source: Exception raised when a key without a corresponding value is continued with an indented line.
sv: Undantag när en tangent utan motsvarande värde fortsätter med en indragen rad.

source: Exception raised when attempting to use the :const:`UNNAMED_SECTION` without enabling it.
sv: Exception uppstod när man försökte använda :const:`UNNAMED_SECTION` utan att aktivera den.

source: Exception raised when an attempted :meth:`ConfigParser.write` would not be parsed accurately with a future :meth:`ConfigParser.read` call.
sv: Exception uppstod när ett försök till :meth:`ConfigParser.write` inte skulle tolkas korrekt med ett framtida :meth:`ConfigParser.read`-anrop.

source: Ex: Writing a key beginning with the :attr:`ConfigParser.SECTCRE` pattern would parse as a section header when read. Attempting to write this will raise this exception.
sv: Ex: Att skriva en nyckel som börjar med mönstret :attr:`ConfigParser.SECTCRE` skulle tolkas som en sektionsrubrik när den läses. Försök att skriva detta kommer att ge upphov till detta undantag.

source: Footnotes
sv: Fotnoter

source: Config parsers allow for heavy customization. If you are interested in changing the behaviour outlined by the footnote reference, consult the `Customizing Parser Behaviour`_ section.
sv: Config-parsers tillåter omfattande anpassningar. Om du är intresserad av att ändra det beteende som beskrivs i fotnotens referens, se avsnittet "Anpassa parserbeteendet".

source: file
sv: fil

source: configuration
sv: konfiguration

source: ini file
sv: ini-fil

source: Windows ini file
sv: Windows ini-fil

source: % (percent)
sv: % (procent)

source: interpolation in configuration files
sv: interpolation i konfigurationsfiler
