Repository: yeager/python-docs-sv
Catalog: library/constants.po
Languages: sv

source: Built-in Constants
sv: Inbyggda konstanter

source: A small number of constants live in the built-in namespace. They are:
sv: Ett litet antal konstanter finns i den inbyggda namnrymden. De är följande:

source: The false value of the :class:`bool` type. Assignments to ``False`` are illegal and raise a :exc:`SyntaxError`.
sv: Det falska värdet av typen :class:`bool`. Tilldelningar till ``False`` är olagliga och ger upphov till ett :exc:`SyntaxError`.

source: The true value of the :class:`bool` type. Assignments to ``True`` are illegal and raise a :exc:`SyntaxError`.
sv: Det sanna värdet av typen :class:`bool`. Tilldelningar till ``True`` är olagliga och ger upphov till ett :exc:`SyntaxError`.

source: An object frequently used to represent the absence of a value, as when default arguments are not passed to a function. Assignments to ``None`` are illegal and raise a :exc:`SyntaxError`. ``None`` is the sole instance of the :data:`~types.NoneType` type.
sv: Ett objekt som ofta används för att representera avsaknaden av ett värde, t.ex. när standardargument inte skickas till en funktion. Tilldelningar till ``None`` är olagliga och ger upphov till ett :exc:`SyntaxError`. ``None`` är den enda förekomsten av typen :data:`~types.NoneType`.

source: A special value which should be returned by the binary special methods (e.g. :meth:`~object.__eq__`, :meth:`~object.__lt__`, :meth:`~object.__add__`, :meth:`~object.__rsub__`, etc.) to indicate that the operation is not implemented with respect to the other type; may be returned by the in-place binary special methods (e.g. :meth:`~object.__imul__`, :meth:`~object.__iand__`, etc.) for the same purpose. It should not be evaluated in a boolean context. :data:`!NotImplemented` is the sole instance of the :data:`types.NotImplementedType` type.
sv: Ett speciellt värde som bör returneras av de binära specialmetoderna (t.ex. :meth:`~object.__eq__`, :meth:`~object.__lt__`, :meth:`~object.__add__`, :meth:`~object.__rsub__`, etc.) för att ange att operationen inte är implementerad med avseende på den andra typen; kan returneras av de binära specialmetoderna på plats (t.ex. :meth:`~object.__imul__`, :meth:`~object.__iand__`, etc.) för samma ändamål. Den bör inte utvärderas i ett booleskt sammanhang. :data:`!NotImplemented` är den enda förekomsten av typen :data:`types.NotImplementedType`.

source: When a binary (or in-place) method returns :data:`!NotImplemented` the interpreter will try the reflected operation on the other type (or some other fallback, depending on the operator). If all attempts return :data:`!NotImplemented`, the interpreter will raise an appropriate exception. Incorrectly returning :data:`!NotImplemented` will result in a misleading error message or the :data:`!NotImplemented` value being returned to Python code.
sv: När en binär (eller in-place) metod returnerar :data:`!NotImplemented` kommer tolken att försöka med den reflekterade operationen på den andra typen (eller någon annan fallback, beroende på operator). Om alla försök returnerar :data:`!NotImplemented`, kommer tolken att ge upphov till ett lämpligt undantag. Felaktig retur av :data:`!NotImplemented` kommer att resultera i ett vilseledande felmeddelande eller att värdet :data:`!NotImplemented` returneras till Python-koden.

source: See :ref:`implementing-the-arithmetic-operations` for examples.
sv: Se :ref:`implementing-the-arithmetic-operations` för exempel.

source: :data:`!NotImplemented` and :exc:`!NotImplementedError` are not interchangeable. This constant should only be used as described above; see :exc:`NotImplementedError` for details on correct usage of the exception.
sv: :data:`!NotImplemented` och :exc:`!NotImplementedError` är inte utbytbara. Denna konstant bör endast användas enligt beskrivningen ovan; se :exc:`NotImplementedError` för detaljer om korrekt användning av undantaget.

source: Evaluating :data:`!NotImplemented` in a boolean context was deprecated.
sv: Utvärdering av :data:`!NotImplemented` i en boolesk kontext var föråldrad.

source: Evaluating :data:`!NotImplemented` in a boolean context now raises a :exc:`TypeError`. It previously evaluated to :const:`True` and emitted a :exc:`DeprecationWarning` since Python 3.9.
sv: Utvärdering av :data:`!NotImplemented` i ett booleanskt sammanhang ger nu upphov till ett :exc:`TypeError`. Det utvärderades tidigare till :const:`True` och gav upphov till en :exc:`DeprecationWarning` sedan Python 3.9.

source: The same as the ellipsis literal "``...``". Special value used mostly in conjunction with extended slicing syntax for user-defined container data types. ``Ellipsis`` is the sole instance of the :data:`types.EllipsisType` type.
sv: Samma som ellipsformuleringen "``...``". Specialvärde som främst används i samband med utökad slicing-syntax för användardefinierade containerdatatyper. ``Ellipsis`` är den enda förekomsten av typen :data:`types.EllipsisType`.

source: This constant is true if Python was not started with an :option:`-O` option. See also the :keyword:`assert` statement.
sv: Denna konstant är sann om Python inte startades med ett :option:`-O`-alternativ. Se även :keyword:`assert`-satsen.

source: The names :data:`None`, :data:`False`, :data:`True` and :data:`__debug__` cannot be reassigned (assignments to them, even as an attribute name, raise :exc:`SyntaxError`), so they can be considered "true" constants.
sv: Namnen :data:`None`, :data:`False`, :data:`True` och :data:`__debug__` kan inte tilldelas på nytt (tilldelningar till dem, även som ett attributnamn, ger upphov till :exc:`SyntaxError`), så de kan betraktas som "sanna" konstanter.

source: Constants added by the :mod:`site` module
sv: Konstanter som läggs till av modulen :mod:`site

source: The :mod:`site` module (which is imported automatically during startup, except if the :option:`-S` command-line option is given) adds several constants to the built-in namespace. They are useful for the interactive interpreter shell and should not be used in programs.
sv: Modulen :mod:`site` (som importeras automatiskt vid uppstart, utom om kommandoradsalternativet :option:`-S` anges) lägger till flera konstanter i det inbyggda namnområdet. De är användbara för det interaktiva tolkskalet och bör inte användas i program.

source: Objects that when printed, print a message like "Use quit() or Ctrl-D (i.e. EOF) to exit", and when called, raise :exc:`SystemExit` with the specified exit code.
sv: Objekt som när de skrivs ut skriver ut ett meddelande som "Använd quit() eller Ctrl-D (dvs. EOF) för att avsluta", och som när de anropas ger upphov till :exc:`SystemExit` med den angivna avslutningskoden.

source: Object that when printed, prints the message "Type help() for interactive help, or help(object) for help about object.", and when called, acts as described :func:`elsewhere <help>`.
sv: Objekt som när det skrivs ut visar meddelandet "Skriv help() för interaktiv hjälp, eller help(object) för hjälp om objektet.", och som när det anropas fungerar enligt beskrivningen :func:`elsewhere <help>`.

source: Objects that when printed or called, print the text of copyright or credits, respectively.
sv: Objekt som när de skrivs ut eller anropas skriver ut texten för copyright respektive credits.

source: Object that when printed, prints the message "Type license() to see the full license text", and when called, displays the full license text in a pager-like fashion (one screen at a time).
sv: Objekt som när det skrivs ut visar meddelandet "Skriv license() för att se hela licenstexten" och när det anropas visar hela licenstexten på ett personsökarliknande sätt (en skärm i taget).

source: ellipsis literal
sv: ellips bokstavlig
