Repository: yeager/python-docs-sv
Catalog: library/contextvars.po
Languages: sv

source: :mod:`!contextvars` --- Context Variables
sv: :mod:`!contextvars` --- Kontextvariabler

source: This module provides APIs to manage, store, and access context-local state. The :class:`~contextvars.ContextVar` class is used to declare and work with *Context Variables*. The :func:`~contextvars.copy_context` function and the :class:`~contextvars.Context` class should be used to manage the current context in asynchronous frameworks.
sv: Denna modul tillhandahåller API:er för att hantera, lagra och komma åt kontextlokalt tillstånd. Klassen :class:`~contextvars.ContextVar` används för att deklarera och arbeta med *kontextvariabler*. Funktionen :func:`~contextvars.copy_context` och klassen :class:`~contextvars.Context` bör användas för att hantera den aktuella kontexten i asynkrona ramverk.

source: Context managers that have state should use Context Variables instead of :func:`threading.local` to prevent their state from bleeding to other code unexpectedly, when used in concurrent code.
sv: Kontexthanterare som har tillstånd bör använda kontextvariabler istället för :func:`threading.local` för att förhindra att deras tillstånd oväntat sprids till annan kod när de används i samtidig kod.

source: See also :pep:`567` for additional details.
sv: Se även :pep:`567` för ytterligare information.

source: Context Variables
sv: Variabler för kontext

source: This class is used to declare a new Context Variable, e.g.::
sv: Denna klass används för att deklarera en ny kontextvariabel, t.ex.::

source: The required *name* parameter is used for introspection and debug purposes.
sv: Den obligatoriska parametern *name* används för introspektion och felsökning.

source: The optional keyword-only *default* parameter is returned by :meth:`ContextVar.get` when no value for the variable is found in the current context.
sv: Den valfria parametern *default*, som endast innehåller nyckelord, returneras av :meth:`ContextVar.get` när inget värde för variabeln hittas i den aktuella kontexten.

source: **Important:** Context Variables should be created at the top module level and never in closures. :class:`Context` objects hold strong references to context variables which prevents context variables from being properly garbage collected.
sv: **Viktigt:** Kontextvariabler ska skapas på den översta modulnivån och aldrig i avslutningar. :class:`Context`-objekt innehåller starka referenser till kontextvariabler vilket förhindrar att kontextvariablerna samlas in på rätt sätt.

source: The name of the variable. This is a read-only property.
sv: Namnet på variabeln. Detta är en skrivskyddad egenskap.

source: Return a value for the context variable for the current context.
sv: Returnerar ett värde för kontextvariabeln för den aktuella kontexten.

source: If there is no value for the variable in the current context, the method will:
sv: Om det inte finns något värde för variabeln i det aktuella sammanhanget kommer metoden att göra det:

source: return the value of the *default* argument of the method, if provided; or
sv: returnera värdet för metodens *standard*-argument, om ett sådant har angetts; eller

source: return the default value for the context variable, if it was created with one; or
sv: returnera standardvärdet för kontextvariabeln, om den skapades med ett sådant; eller

source: raise a :exc:`LookupError`.
sv: skapa ett :exc:`LookupError`.

source: Call to set a new value for the context variable in the current context.
sv: Anrop för att ange ett nytt värde för kontextvariabeln i den aktuella kontexten.

source: The required *value* argument is the new value for the context variable.
sv: Det obligatoriska argumentet *value* är det nya värdet för kontextvariabeln.

source: Returns a :class:`~contextvars.Token` object that can be used to restore the variable to its previous value via the :meth:`ContextVar.reset` method.
sv: Returnerar ett :class:`~contextvars.Token`-objekt som kan användas för att återställa variabeln till dess tidigare värde via metoden :meth:`ContextVar.reset`.

source: Reset the context variable to the value it had before the :meth:`ContextVar.set` that created the *token* was used.
sv: Återställer kontextvariabeln till det värde den hade innan :meth:`ContextVar.set` som skapade *token* användes.

source: For example::
sv: Till exempel::

source: *Token* objects are returned by the :meth:`ContextVar.set` method. They can be passed to the :meth:`ContextVar.reset` method to revert the value of the variable to what it was before the corresponding *set*.
sv: *Token*-objekt returneras av metoden :meth:`ContextVar.set`. De kan skickas till metoden :meth:`ContextVar.reset` för att återställa variabelns värde till vad det var före motsvarande *set*.

source: The token supports :ref:`context manager protocol <context-managers>` to restore the corresponding context variable value at the exit from :keyword:`with` block::
sv: Token stöder :ref:``context manager protocol <context-managers>`` för att återställa motsvarande kontextvariabelvärde vid utgången från :keyword:`with` block::

source: Added support for usage as a context manager.
sv: Stöd för användning som kontexthanterare har lagts till.

source: A read-only property. Points to the :class:`ContextVar` object that created the token.
sv: En skrivskyddad egenskap. Pekar på det :class:`ContextVar`-objekt som skapade token.

source: A read-only property. Set to the value the variable had before the :meth:`ContextVar.set` method call that created the token. It points to :attr:`Token.MISSING` if the variable was not set before the call.
sv: En skrivskyddad egenskap. Ställs in till det värde variabeln hade före metodanropet :meth:`ContextVar.set` som skapade token. Den pekar på :attr:`Token.MISSING` om variabeln inte var inställd före anropet.

source: A marker object used by :attr:`Token.old_value`.
sv: Ett markörobjekt som används av :attr:`Token.old_value`.

source: Manual Context Management
sv: Manuell kontexthantering

source: Returns a copy of the current :class:`~contextvars.Context` object.
sv: Returnerar en kopia av det aktuella :class:`~contextvars.Context`-objektet.

source: The following snippet gets a copy of the current context and prints all variables and their values that are set in it::
sv: Följande utdrag hämtar en kopia av den aktuella kontexten och skriver ut alla variabler och deras värden som har angetts i den::

source: The function has an *O*\ (1) complexity, i.e. works equally fast for contexts with a few context variables and for contexts that have a lot of them.
sv: Funktionen har en *O*\ (1) komplexitet, dvs. den arbetar lika snabbt för kontexter med ett fåtal kontextvariabler som för kontexter med många.

source: A mapping of :class:`ContextVars <ContextVar>` to their values.
sv: En mappning av :class:`ContextVars <ContextVar>` till deras värden.

source: ``Context()`` creates an empty context with no values in it. To get a copy of the current context use the :func:`~contextvars.copy_context` function.
sv: ``Context()`` skapar en tom kontext utan några värden i den. För att få en kopia av den aktuella kontexten används funktionen :func:`~contextvars.copy_context`.

source: Each thread has its own effective stack of :class:`!Context` objects. The :term:`current context` is the :class:`!Context` object at the top of the current thread's stack. All :class:`!Context` objects in the stacks are considered to be *entered*.
sv: Varje tråd har sin egen effektiva stack av :class:`!Context`-objekt. Den :term:`aktuella kontexten` är det :class:`!Context`-objekt som ligger överst i den aktuella trådens stack. Alla :class:`!Context`-objekt i staplarna anses vara *inmatade*.

source: *Entering* a context, which can be done by calling its :meth:`~Context.run` method, makes the context the current context by pushing it onto the top of the current thread's context stack.
sv: *När man går in i* en kontext, vilket kan göras genom att anropa dess :meth:`~Context.run`-metod, blir kontexten den aktuella kontexten genom att den läggs överst i den aktuella trådens kontextstapel.

source: *Exiting* from the current context, which can be done by returning from the callback passed to the :meth:`~Context.run` method, restores the current context to what it was before the context was entered by popping the context off the top of the context stack.
sv: *När du lämnar* den aktuella kontexten, vilket kan göras genom att återvända från den återuppringning som skickades till metoden :meth:`~Context.run`, återställs den aktuella kontexten till vad den var innan kontexten angavs genom att kontexten flyttas från toppen av kontextstapeln.

source: Since each thread has its own context stack, :class:`ContextVar` objects behave in a similar fashion to :func:`threading.local` when values are assigned in different threads.
sv: Eftersom varje tråd har sin egen kontextstack, beter sig :class:`ContextVar`-objekt på ett liknande sätt som :func:`threading.local` när värden tilldelas i olika trådar.

source: Attempting to enter an already entered context, including contexts entered in other threads, raises a :exc:`RuntimeError`.
sv: Försök att ange en redan angiven kontext, inklusive kontexter som angetts i andra trådar, ger upphov till ett :exc:`RuntimeError`.

source: After exiting a context, it can later be re-entered (from any thread).
sv: När du har lämnat ett sammanhang kan du senare gå in i det igen (från vilken tråd som helst).

source: Any changes to :class:`ContextVar` values via the :meth:`ContextVar.set` method are recorded in the current context. The :meth:`ContextVar.get` method returns the value associated with the current context. Exiting a context effectively reverts any changes made to context variables while the context was entered (if needed, the values can be restored by re-entering the context).
sv: Alla ändringar av :class:`ContextVar`-värden via metoden :meth:`ContextVar.set` registreras i den aktuella kontexten. Metoden :meth:`ContextVar.get` returnerar det värde som är associerat med den aktuella kontexten. När en kontext avslutas återställs alla ändringar som gjorts i kontextvariablerna när kontexten öppnades (vid behov kan värdena återställas genom att kontexten öppnas på nytt).

source: Context implements the :class:`collections.abc.Mapping` interface.
sv: Kontexten implementerar gränssnittet :class:`collections.abc.Mapping`.

source: Enters the Context, executes ``callable(*args, **kwargs)``, then exits the Context. Returns *callable*'s return value, or propagates an exception if one occurred.
sv: Går in i kontexten, utför ``callable(*args, **kwargs)`` och går sedan ut ur kontexten. Returnerar *callable*:s returvärde, eller sprider ett undantag om ett sådant inträffat.

source: Example:
sv: Exempel:

source: Return a shallow copy of the context object.
sv: Returnerar en ytlig kopia av kontextobjektet.

source: Return ``True`` if the *context* has a value for *var* set; return ``False`` otherwise.
sv: Returnerar ``True`` om *kontexten* har ett värde för *var* inställt; returnerar ``False`` annars.

source: Return the value of the *var* :class:`ContextVar` variable. If the variable is not set in the context object, a :exc:`KeyError` is raised.
sv: Returnerar värdet på variabeln *var* :class:`ContextVar`. Om variabeln inte är inställd i context-objektet, uppstår ett :exc:`KeyError`.

source: Return the value for *var* if *var* has the value in the context object. Return *default* otherwise. If *default* is not given, return ``None``.
sv: Returnerar värdet för *var* om *var* har värdet i kontextobjektet. Returnerar annars *default*. Om *default* inte anges, returneras ``None``.

source: Return an iterator over the variables stored in the context object.
sv: Returnerar en iterator över de variabler som finns lagrade i kontextobjektet.

source: Return the number of variables set in the context object.
sv: Returnerar antalet variabler som ställts in i kontextobjektet.

source: Return a list of all variables in the context object.
sv: Returnerar en lista över alla variabler i kontextobjektet.

source: Return a list of all variables' values in the context object.
sv: Returnerar en lista över alla variablers värden i kontextobjektet.

source: Return a list of 2-tuples containing all variables and their values in the context object.
sv: Returnerar en lista med 2-tuples som innehåller alla variabler och deras värden i kontextobjektet.

source: asyncio support
sv: stöd för asyncio

source: Context variables are natively supported in :mod:`asyncio` and are ready to be used without any extra configuration. For example, here is a simple echo server, that uses a context variable to make the address of a remote client available in the Task that handles that client::
sv: Kontextvariabler stöds inbyggt i :mod:`asyncio` och är redo att användas utan någon extra konfiguration. Här är till exempel en enkel ekoserver som använder en kontextvariabel för att göra adressen till en fjärrklient tillgänglig i den Task som hanterar den klienten::
