Repository: yeager/python-docs-sv
Catalog: library/copyreg.po
Languages: sv

source: :mod:`!copyreg` --- Register :mod:`!pickle` support functions
sv: :mod:`!copyreg` --- Registrera :mod:`!pickle` stödfunktioner

source: **Source code:** :source:`Lib/copyreg.py`
sv: **Källkod:** :source:`Lib/copyreg.py`

source: The :mod:`copyreg` module offers a way to define functions used while pickling specific objects. The :mod:`pickle` and :mod:`copy` modules use those functions when pickling/copying those objects. The module provides configuration information about object constructors which are not classes. Such constructors may be factory functions or class instances.
sv: Modulen :mod:`copyreg` erbjuder ett sätt att definiera funktioner som används vid inläggning av specifika objekt. Modulerna :mod:`pickle` och :mod:`copy` använder dessa funktioner när de betar/kopierar dessa objekt. Modulen tillhandahåller konfigurationsinformation om objektkonstruktörer som inte är klasser. Sådana konstruktörer kan vara fabriksfunktioner eller klassinstanser.

source: Declares *object* to be a valid constructor. If *object* is not callable (and hence not valid as a constructor), raises :exc:`TypeError`.
sv: Deklarerar att *object* är en giltig konstruktör. Om *object* inte är anropsbar (och därmed inte giltig som konstruktör), utlöses :exc:`TypeError`.

source: Declares that *function* should be used as a "reduction" function for objects of type *type*. *function* must return either a string or a tuple containing between two and six elements. See the :attr:`~pickle.Pickler.dispatch_table` for more details on the interface of *function*.
sv: Deklarerar att *function* ska användas som en "reduction"-funktion för objekt av typen *type*. *function* måste returnera antingen en sträng eller en tupel som innehåller mellan två och sex element. Se :attr:`~pickle.Pickler.dispatch_table` för mer information om gränssnittet för *function*.

source: The *constructor_ob* parameter is a legacy feature and is now ignored, but if passed it must be a callable.
sv: Parametern *constructor_ob* är en äldre funktion och ignoreras nu, men om den skickas måste den vara en callable.

source: Note that the :attr:`~pickle.Pickler.dispatch_table` attribute of a pickler object or subclass of :class:`pickle.Pickler` can also be used for declaring reduction functions.
sv: Observera att attributet :attr:`~pickle.Pickler.dispatch_table` för ett pickler-objekt eller en subklass av :class:`pickle.Pickler` också kan användas för att deklarera reduktionsfunktioner.

source: Example
sv: Exempel

source: The example below would like to show how to register a pickle function and how it will be used:
sv: Exemplet nedan vill visa hur man registrerar en pickle-funktion och hur den kommer att användas:

source: module
sv: modul

source: copy
sv: kopiera
