Repository: yeager/python-docs-sv
Catalog: library/curses.panel.po
Languages: sv

source: :mod:`!curses.panel` --- A panel stack extension for curses
sv: :mod:`!curses.panel` --- En panelstack för curses

source: Panels are windows with the added feature of depth, so they can be stacked on top of each other, and only the visible portions of each window will be displayed. Panels can be added, moved up or down in the stack, and removed.
sv: Paneler är fönster med ett extra djup, så att de kan staplas ovanpå varandra och endast de synliga delarna av varje fönster visas. Paneler kan läggas till, flyttas uppåt eller nedåt i stapeln och tas bort.

source: Functions
sv: Funktioner

source: The module :mod:`curses.panel` defines the following functions:
sv: Modulen :mod:`curses.panel` definierar följande funktioner:

source: Returns the bottom panel in the panel stack.
sv: Returnerar den nedersta panelen i panelstapeln.

source: Returns a panel object, associating it with the given window *win*. Be aware that you need to keep the returned panel object referenced explicitly. If you don't, the panel object is garbage collected and removed from the panel stack.
sv: Returnerar ett panelobjekt som associeras med det angivna fönstret *win*. Tänk på att du måste hålla det returnerade panelobjektet refererat explicit. Om du inte gör det samlas panelobjektet in och tas bort från panelstacken.

source: Returns the top panel in the panel stack.
sv: Returnerar den översta panelen i panelstapeln.

source: Updates the virtual screen after changes in the panel stack. This does not call :func:`curses.doupdate`, so you'll have to do this yourself.
sv: Uppdaterar den virtuella skärmen efter ändringar i panelstacken. Detta anropar inte :func:`curses.doupdate`, så du måste göra det själv.

source: Panel Objects
sv: Objekt i panelen

source: Panel objects, as returned by :func:`new_panel` above, are windows with a stacking order. There's always a window associated with a panel which determines the content, while the panel methods are responsible for the window's depth in the panel stack.
sv: Panelobjekt, som returneras av :func:`new_panel` ovan, är fönster med en staplingsordning. Det finns alltid ett fönster associerat med en panel som bestämmer innehållet, medan panelmetoderna är ansvariga för fönstrets djup i panelstapeln.

source: Panel objects have the following methods:
sv: Panelobjekt har följande metoder:

source: Returns the panel above the current panel.
sv: Returnerar panelen ovanför den aktuella panelen.

source: Returns the panel below the current panel.
sv: Returnerar panelen under den aktuella panelen.

source: Push the panel to the bottom of the stack.
sv: Skjut in panelen längst ner i stapeln.

source: Returns ``True`` if the panel is hidden (not visible), ``False`` otherwise.
sv: Returnerar ``True`` om panelen är dold (inte synlig), ``False`` annars.

source: Hide the panel. This does not delete the object, it just makes the window on screen invisible.
sv: Dölj panelen. Detta raderar inte objektet, det gör bara fönstret på skärmen osynligt.

source: Move the panel to the screen coordinates ``(y, x)``.
sv: Flytta panelen till skärmkoordinaterna ``(y, x)``.

source: Change the window associated with the panel to the window *win*.
sv: Ändra det fönster som är kopplat till panelen till fönstret *win*.

source: Set the panel's user pointer to *obj*. This is used to associate an arbitrary piece of data with the panel, and can be any Python object.
sv: Ställ in panelens användarpekare till *obj*. Detta används för att associera en godtycklig del av data med panelen, och kan vara vilket Python-objekt som helst.

source: Display the panel (which might have been hidden).
sv: Visa panelen (som kan ha varit dold).

source: Push panel to the top of the stack.
sv: Skjut panelen till toppen av stapeln.

source: Returns the user pointer for the panel. This might be any Python object.
sv: Returnerar användarpekaren för panelen. Detta kan vara vilket Python-objekt som helst.

source: Returns the window object associated with the panel.
sv: Returnerar det fönsterobjekt som är kopplat till panelen.
