Repository: yeager/python-docs-sv
Catalog: library/curses.po
Languages: sv

source: Remove attribute *attr* from the "background" set applied to all writes to the current window.
sv: Ta bort attributet *attr* från "background"-uppsättningen som används för alla skrivningar till det aktuella fönstret.

source: Add attribute *attr* from the "background" set applied to all writes to the current window.
sv: Lägg till attributet *attr* från "background"-uppsättningen som används för alla skrivningar till det aktuella fönstret.

source: Set the "background" set of attributes to *attr*. This set is initially ``0`` (no attributes).
sv: Ställ in "bakgrunds"-uppsättningen av attribut till *attr*. Denna uppsättning är initialt ``0`` (inga attribut).

source: Set the background property of the window to the character *ch*, with attributes *attr*. The change is then applied to every character position in that window:
sv: Ställ in fönstrets bakgrundsegenskap till tecknet *ch*, med attribut *attr*. Ändringen tillämpas sedan på varje teckenposition i det fönstret:

source: The attribute of every character in the window is changed to the new background attribute.
sv: Attributet för varje tecken i fönstret ändras till det nya bakgrundsattributet.

source: Wherever the former background character appears, it is changed to the new background character.
sv: Varhelst den tidigare bakgrundskaraktären dyker upp byts den ut mot den nya bakgrundskaraktären.

source: Set the window's background. A window's background consists of a character and any combination of attributes. The attribute part of the background is combined (OR'ed) with all non-blank characters that are written into the window. Both the character and attribute parts of the background are combined with the blank characters. The background becomes a property of the character and moves with the character through any scrolling and insert/delete line/character operations.
sv: Ställ in fönstrets bakgrund. Ett fönsters bakgrund består av ett tecken och en valfri kombination av attribut. Attributdelen av bakgrunden kombineras (OR'ed) med alla icke-tomma tecken som skrivs in i fönstret. Både karaktärs- och attributdelen av bakgrunden kombineras med de tomma tecknen. Bakgrunden blir en egenskap hos tecknet och flyttas med tecknet genom alla skrollningar och operationer för att infoga/ta bort rader/tecken.

source: Draw a border around the edges of the window. Each parameter specifies the character to use for a specific part of the border; see the table below for more details.
sv: Rita en kant runt fönstrets kanter. Varje parameter anger vilket tecken som ska användas för en viss del av kanten; se tabellen nedan för mer information.

source: A ``0`` value for any parameter will cause the default character to be used for that parameter. Keyword parameters can *not* be used. The defaults are listed in this table:
sv: Ett värde ``0`` för en parameter innebär att standardtecknet används för den parametern. Nyckelordsparametrar kan *inte* användas. Standardvärdena anges i denna tabell:

source: Description
sv: Beskrivning

source: Default value
sv: Standardvärde

source: Left side
sv: Vänster sida

source: Right side
sv: Höger sida

source: Top
sv: Topp

source: Bottom
sv: Botten

source: Upper-left corner
sv: Övre vänstra hörnet

source: Upper-right corner
sv: Övre högra hörnet

source: Bottom-left corner
sv: Nedre vänstra hörnet

source: Bottom-right corner
sv: Nedre högra hörnet

source: Similar to :meth:`border`, but both *ls* and *rs* are *vertch* and both *ts* and *bs* are *horch*. The default corner characters are always used by this function.
sv: Liknar :meth:`border`, men både *ls* och *rs* är *vertch* och både *ts* och *bs* är *horch*. Standardhörntecknen används alltid av denna funktion.

source: Set the attributes of *num* characters at the current cursor position, or at position ``(y, x)`` if supplied. If *num* is not given or is ``-1``, the attribute will be set on all the characters to the end of the line. This function moves cursor to position ``(y, x)`` if supplied. The changed line will be touched using the :meth:`touchline` method so that the contents will be redisplayed by the next window refresh.
sv: Ställ in attributen för *num* tecken vid den aktuella markörpositionen, eller vid position ``(y, x)`` om den anges. Om *num* inte anges eller är ``-1``, kommer attributet att sättas på alla tecken till slutet av raden. Denna funktion flyttar markören till position ``(y, x)`` om den anges. Den ändrade raden kommer att beröras med metoden :meth:`touchline` så att innehållet visas igen vid nästa fönsteruppdatering.

source: Like :meth:`erase`, but also cause the whole window to be repainted upon next call to :meth:`refresh`.
sv: Som :meth:`erase`, men gör också att hela fönstret målas om vid nästa anrop till :meth:`refresh`.

source: If *flag* is ``True``, the next call to :meth:`refresh` will clear the window completely.
sv: Om *flag* är ``True`` kommer nästa anrop till :meth:`refresh` att rensa fönstret helt och hållet.

source: Erase from cursor to the end of the window: all lines below the cursor are deleted, and then the equivalent of :meth:`clrtoeol` is performed.
sv: Radera från markören till slutet av fönstret: alla rader under markören raderas, och sedan utförs motsvarande :meth:`clrtoeol`.

source: Erase from cursor to the end of the line.
sv: Raderar från markören till slutet av raden.

source: Update the current cursor position of all the ancestors of the window to reflect the current cursor position of the window.
sv: Uppdaterar den aktuella markörpositionen för alla fönstrets förfäder så att den återspeglar fönstrets aktuella markörposition.

source: Delete any character at ``(y, x)``.
sv: Ta bort valfritt tecken vid ``(y, x)``.

source: Delete the line under the cursor. All following lines are moved up by one line.
sv: Radera raden under markören. Alla följande rader flyttas upp med en rad.

source: An abbreviation for "derive window", :meth:`derwin` is the same as calling :meth:`subwin`, except that *begin_y* and *begin_x* are relative to the origin of the window, rather than relative to the entire screen. Return a window object for the derived window.
sv: En förkortning för "derive window", :meth:`derwin` är samma sak som att anropa :meth:`subwin`, förutom att *begin_y* och *begin_x* är relativa till fönstrets ursprung, snarare än relativa till hela skärmen. Returnerar ett fönsterobjekt för det härledda fönstret.

source: Add character *ch* with attribute *attr*, and immediately call :meth:`refresh` on the window.
sv: Lägg till tecken *ch* med attributet *attr*, och anropa omedelbart :meth:`refresh` i fönstret.

source: Test whether the given pair of screen-relative character-cell coordinates are enclosed by the given window, returning ``True`` or ``False``. It is useful for determining what subset of the screen windows enclose the location of a mouse event.
sv: Testar om det givna paret av skärmrelativa teckencellskoordinater innesluts av det givna fönstret och returnerar ``True`` eller ``False``. Det är användbart för att avgöra vilken delmängd av skärmens fönster som omsluter platsen för en mushändelse.

source: Previously it returned ``1`` or ``0`` instead of ``True`` or ``False``.
sv: Tidigare returnerade den ``1`` eller ``0`` istället för ``True`` eller ``False``.

source: Encoding used to encode method arguments (Unicode strings and characters). The encoding attribute is inherited from the parent window when a subwindow is created, for example with :meth:`window.subwin`. By default, current locale encoding is used (see :func:`locale.getencoding`).
sv: Kodning som används för att koda metodargument (Unicode-strängar och -tecken). Kodningsattributet ärvs från moderfönstret när ett underfönster skapas, t.ex. med :meth:`window.subwin`. Som standard används den aktuella locale-kodningen (se :func:`locale.getencoding`).

source: Clear the window.
sv: Töm fönstret.

source: Return a tuple ``(y, x)`` of coordinates of upper-left corner.
sv: Returnerar en tupel ``(y, x)`` av koordinaterna för det övre vänstra hörnet.

source: Return the given window's current background character/attribute pair.
sv: Returnerar det givna fönstrets aktuella bakgrundskaraktär/attributpar.

source: Get a character. Note that the integer returned does *not* have to be in ASCII range: function keys, keypad keys and so on are represented by numbers higher than 255. In no-delay mode, return ``-1`` if there is no input, otherwise wait until a key is pressed.
sv: Hämta ett tecken. Observera att det returnerade heltalet inte *behöver* ligga inom ASCII-området: funktionstangenter, knappsatser och så vidare representeras av tal högre än 255. I läget utan fördröjning returneras ``-1`` om det inte finns någon inmatning, annars väntar man tills en tangent trycks in.

source: Get a wide character. Return a character for most keys, or an integer for function keys, keypad keys, and other special keys. In no-delay mode, raise an exception if there is no input.
sv: Hämta ett brett tecken. Returnerar ett tecken för de flesta tangenter, eller ett heltal för funktionstangenter, knappsatser och andra specialtangenter. I läget utan fördröjning uppstår ett undantag om det inte finns någon inmatning.

source: Get a character, returning a string instead of an integer, as :meth:`getch` does. Function keys, keypad keys and other special keys return a multibyte string containing the key name. In no-delay mode, raise an exception if there is no input.
sv: Hämta ett tecken och returnera en sträng i stället för ett heltal, som :meth:`getch` gör. Funktionstangenter, knappsatser och andra specialtangenter returnerar en multibyte-sträng som innehåller tangentens namn. I läget utan fördröjning, gör ett undantag om det inte finns någon inmatning.

source: Return a tuple ``(y, x)`` of the height and width of the window.
sv: Returnerar en tupel ``(y, x)`` av fönstrets höjd och bredd.

source: Return the beginning coordinates of this window relative to its parent window as a tuple ``(y, x)``. Return ``(-1, -1)`` if this window has no parent.
sv: Returnerar startkoordinaterna för detta fönster i förhållande till dess föräldrafönster som en tupel ``(y, x)``. Returnerar ``(-1, -1)`` om fönstret inte har någon förälder.

source: Read a bytes object from the user, with primitive line editing capacity. The maximum value for *n* is 2047.
sv: Läs ett bytesobjekt från användaren, med primitiv radredigeringskapacitet. Det maximala värdet för *n* är 2047.

source: The maximum value for *n* was increased from 1023 to 2047.
sv: Maxvärdet för *n* höjdes från 1023 till 2047.

source: Return a tuple ``(y, x)`` of current cursor position relative to the window's upper-left corner.
sv: Returnerar en tupel ``(y, x)`` av aktuell markörposition i förhållande till fönstrets övre vänstra hörn.

source: Display a horizontal line starting at ``(y, x)`` with length *n* consisting of the character *ch*.
sv: Visa en horisontell linje som börjar vid ``(y, x)`` med längden *n* och som består av tecknet *ch*.

source: If *flag* is ``False``, curses no longer considers using the hardware insert/delete character feature of the terminal; if *flag* is ``True``, use of character insertion and deletion is enabled. When curses is first initialized, use of character insert/delete is enabled by default.
sv: Om *flag* är ``False``, överväger curses inte längre att använda terminalens maskinvarufunktion för att infoga/radera tecken; om *flag* är ``True``, aktiveras användning av infogning och radering av tecken. När curses initieras första gången är användning av teckeninsättning/radering aktiverad som standard.

source: If *flag* is ``True``, :mod:`curses` will try and use hardware line editing facilities. Otherwise, line insertion/deletion are disabled.
sv: Om *flag* är ``True`` kommer :mod:`curses` att försöka använda hårdvarans funktioner för radredigering. Annars är radinklädning/radradering inaktiverat.

source: If *flag* is ``True``, any change in the window image automatically causes the window to be refreshed; you no longer have to call :meth:`refresh` yourself. However, it may degrade performance considerably, due to repeated calls to wrefresh. This option is disabled by default.
sv: Om *flag* är ``True`` kommer varje förändring i fönsterbilden automatiskt att leda till att fönstret uppdateras; du behöver inte längre anropa :meth:`refresh` själv. Det kan dock försämra prestandan avsevärt på grund av upprepade anrop till wrefresh. Detta alternativ är avaktiverat som standard.

source: Return the character at the given position in the window. The bottom 8 bits are the character proper, and upper bits are the attributes.
sv: Returnerar tecknet på den angivna positionen i fönstret. De nedre 8 bitarna är själva tecknet och de övre bitarna är attributen.

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, moving the line from position *x* right by one character.
sv: Måla tecken *ch* vid ``(y, x)`` med attribut *attr*, flytta linjen från position *x* höger med ett tecken.

source: Insert *nlines* lines into the specified window above the current line. The *nlines* bottom lines are lost. For negative *nlines*, delete *nlines* lines starting with the one under the cursor, and move the remaining lines up. The bottom *nlines* lines are cleared. The current cursor position remains the same.
sv: Infoga *nlines* rader i det angivna fönstret ovanför den aktuella raden. De nedersta *nlines*-raderna går förlorade. För negativa *nlines*, ta bort *nlines* rader som börjar med den under markören, och flytta de återstående raderna uppåt. De nedersta *nlines*-raderna rensas. Den aktuella markörpositionen förblir densamma.

source: Insert a blank line under the cursor. All following lines are moved down by one line.
sv: Infoga en tom rad under markören. Alla följande rader flyttas ned en rad.

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor, up to *n* characters. If *n* is zero or negative, the entire string is inserted. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
sv: Infoga en teckensträng (så många tecken som får plats på raden) före tecknet under markören, upp till *n* tecken. Om *n* är noll eller negativt infogas hela strängen. Alla tecken till höger om markören förskjuts åt höger, varvid de tecken som ligger längst till höger på raden försvinner. Markörens position ändras inte (efter förflyttning till *y*, *x*, om detta anges).

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
sv: Infoga en teckensträng (så många tecken som får plats på raden) före tecknet under markören. Alla tecken till höger om markören flyttas till höger, och de tecken som ligger längst till höger på raden försvinner. Markörens position ändras inte (efter att ha flyttats till *y*, *x*, om detta har angetts).

source: Return a bytes object of characters, extracted from the window starting at the current cursor position, or at *y*, *x* if specified. Attributes are stripped from the characters. If *n* is specified, :meth:`instr` returns a string at most *n* characters long (exclusive of the trailing NUL). The maximum value for *n* is 2047.
sv: Returnerar ett bytesobjekt med tecken, extraherade från fönstret med början vid den aktuella markörpositionen, eller vid *y*, *x* om så anges. Attribut tas bort från tecknen. Om *n* anges returnerar :meth:`instr` en sträng som är högst *n* tecken lång (exklusive det efterföljande NUL). Det maximala värdet för *n* är 2047.

source: Return ``True`` if the specified line was modified since the last call to :meth:`refresh`; otherwise return ``False``. Raise a :exc:`curses.error` exception if *line* is not valid for the given window.
sv: Returnerar ``True`` om den angivna raden har ändrats sedan det senaste anropet till :meth:`refresh`; annars returneras ``False``. Utlöser ett :exc:`curses.error` undantag om *line* inte är giltig för det angivna fönstret.

source: Return ``True`` if the specified window was modified since the last call to :meth:`refresh`; otherwise return ``False``.
sv: Returnerar ``True`` om det angivna fönstret har ändrats sedan det senaste anropet till :meth:`refresh`; annars returneras ``False``.

source: If *flag* is ``True``, escape sequences generated by some keys (keypad, function keys) will be interpreted by :mod:`curses`. If *flag* is ``False``, escape sequences will be left as is in the input stream.
sv: Om *flag* är ``True``, kommer escape-sekvenser som genereras av vissa tangenter (knappsats, funktionstangenter) att tolkas av :mod:`curses`. Om *flag* är ``False`` kommer escape-sekvenser att lämnas som de är i inmatningsflödet.

source: If *flag* is ``True``, cursor is left where it is on update, instead of being at "cursor position." This reduces cursor movement where possible. If possible the cursor will be made invisible.
sv: Om *flag* är ``True``, lämnas markören där den är vid uppdateringen, istället för att vara på "markörpositionen" Detta minskar markörens rörelse där det är möjligt. Om möjligt kommer markören att göras osynlig.

source: If *flag* is ``False``, cursor will always be at "cursor position" after an update.
sv: Om *flag* är ``False`` kommer markören alltid att vara på "markörpositionen" efter en uppdatering.

source: Move cursor to ``(new_y, new_x)``.
sv: Flytta markören till ``(new_y, new_x)``.

source: Move the window inside its parent window. The screen-relative parameters of the window are not changed. This routine is used to display different parts of the parent window at the same physical position on the screen.
sv: Flytta fönstret inuti dess föräldrafönster. De skärmrelativa parametrarna för fönstret ändras inte. Denna rutin används för att visa olika delar av det överordnade fönstret på samma fysiska position på skärmen.

source: Move the window so its upper-left corner is at ``(new_y, new_x)``.
sv: Flytta fönstret så att dess övre vänstra hörn ligger vid ``(new_y, new_x)``.

source: If *flag* is ``True``, :meth:`getch` will be non-blocking.
sv: Om *flag* är ``True``, kommer :meth:`getch` att vara icke-blockerande.

source: If *flag* is ``True``, escape sequences will not be timed out.
sv: Om *flag* är ``True`` kommer escape-sekvenser inte att tidsbegränsas.

source: If *flag* is ``False``, after a few milliseconds, an escape sequence will not be interpreted, and will be left in the input stream as is.
sv: Om *flag* är ``False`` kommer en escape-sekvens efter några millisekunder inte att tolkas utan lämnas kvar i inmatningsflödet som den är.

source: Mark for refresh but wait. This function updates the data structure representing the desired state of the window, but does not force an update of the physical screen. To accomplish that, call :func:`doupdate`.
sv: Markera för uppdatering men vänta. Denna funktion uppdaterar datastrukturen som representerar det önskade tillståndet för fönstret, men tvingar inte fram en uppdatering av den fysiska skärmen. För att åstadkomma detta, anropa :func:`doupdate`.

source: Overlay the window on top of *destwin*. The windows need not be the same size, only the overlapping region is copied. This copy is non-destructive, which means that the current background character does not overwrite the old contents of *destwin*.
sv: Överlagra fönstret ovanpå *destwin*. Fönstren behöver inte vara lika stora, endast den överlappande regionen kopieras. Denna kopiering är icke-destruktiv, vilket innebär att det aktuella bakgrundstecknet inte skriver över det gamla innehållet i *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overlay` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, and the other variables mark a rectangle in the destination window.
sv: För att få finkornig kontroll över den kopierade regionen kan den andra formen av :meth:`overlay` användas. *sminrow* och *smincol* är de övre vänstra koordinaterna i källfönstret, och de andra variablerna markerar en rektangel i målfönstret.

source: Overwrite the window on top of *destwin*. The windows need not be the same size, in which case only the overlapping region is copied. This copy is destructive, which means that the current background character overwrites the old contents of *destwin*.
sv: Skriv över fönstret ovanpå *destwin*. Fönstren behöver inte vara lika stora, i så fall kopieras endast den överlappande regionen. Denna kopiering är destruktiv, vilket innebär att det aktuella bakgrundstecknet skriver över det gamla innehållet i *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overwrite` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, the other variables mark a rectangle in the destination window.
sv: För att få finkornig kontroll över den kopierade regionen kan den andra formen av :meth:`overwrite` användas. *sminrow* och *smincol* är de övre vänstra koordinaterna i källfönstret, de andra variablerna markerar en rektangel i målfönstret.

source: Write all data associated with the window into the provided file object. This information can be later retrieved using the :func:`getwin` function.
sv: Skriver all data som är kopplad till fönstret till det angivna filobjektet. Denna information kan senare hämtas med hjälp av funktionen :func:`getwin`.

source: Indicate that the *num* screen lines, starting at line *beg*, are corrupted and should be completely redrawn on the next :meth:`refresh` call.
sv: Anger att *antal* rader på skärmen, med början på rad *beg*, är skadade och bör ritas om helt vid nästa :meth:`refresh`-anrop.

source: Touch the entire window, causing it to be completely redrawn on the next :meth:`refresh` call.
sv: Rör vid hela fönstret, vilket gör att det ritas om helt och hållet vid nästa :meth:`refresh`-anrop.

source: Update the display immediately (sync actual screen with previous drawing/deleting methods).
sv: Uppdatera visningen omedelbart (synkronisera den faktiska skärmen med tidigare ritnings-/raderingsmetoder).

source: The 6 optional arguments can only be specified when the window is a pad created with :func:`newpad`. The additional parameters are needed to indicate what part of the pad and screen are involved. *pminrow* and *pmincol* specify the upper left-hand corner of the rectangle to be displayed in the pad. *sminrow*, *smincol*, *smaxrow*, and *smaxcol* specify the edges of the rectangle to be displayed on the screen. The lower right-hand corner of the rectangle to be displayed in the pad is calculated from the screen coordinates, since the rectangles must be the same size. Both rectangles must be entirely contained within their respective structures. Negative values of *pminrow*, *pmincol*, *sminrow*, or *smincol* are treated as if they were zero.
sv: De 6 valfria argumenten kan endast anges när fönstret är en pad som skapats med :func:`newpad`. De ytterligare parametrarna behövs för att ange vilken del av padden och skärmen som är inblandad. *pminrow* och *pmincol* anger det övre vänstra hörnet av den rektangel som ska visas i padden. *sminrow*, *smincol*, *smaxrow* och *smaxcol* anger kanterna på den rektangel som ska visas på skärmen. Det nedre högra hörnet på den rektangel som ska visas i padden beräknas utifrån skärmkoordinaterna, eftersom rektanglarna måste vara lika stora. Båda rektanglarna måste vara helt inneslutna i sina respektive strukturer. Negativa värden av *pminrow*, *pmincol*, *sminrow* eller *smincol* behandlas som om de vore noll.
