Repository: yeager/python-docs-sv
Catalog: library/curses.po
Languages: sv

source: Set the maximum time in milliseconds that can elapse between press and release events in order for them to be recognized as a click, and return the previous interval value. The default value is 200 milliseconds, or one fifth of a second.
sv: Ställ in den maximala tid i millisekunder som kan förflyta mellan press- och releasehändelser för att de ska uppfattas som ett klick och returnera det tidigare intervallvärdet. Standardvärdet är 200 millisekunder, eller en femtedel av en sekund.

source: Set the mouse events to be reported, and return a tuple ``(availmask, oldmask)``. *availmask* indicates which of the specified mouse events can be reported; on complete failure it returns ``0``. *oldmask* is the previous value of the given window's mouse event mask. If this function is never called, no mouse events are ever reported.
sv: Ställ in vilka mushändelser som ska rapporteras och returnera en tupel ``(availmask, oldmask)``. *availmask* anger vilka av de angivna mushändelserna som kan rapporteras; vid fullständigt misslyckande returneras ``0``. *oldmask* är det tidigare värdet för det angivna fönstrets mushändelsemask. Om denna funktion aldrig anropas rapporteras aldrig några mushändelser.

source: Sleep for *ms* milliseconds.
sv: Sömn i *ms* millisekunder.

source: Create and return a pointer to a new pad data structure with the given number of lines and columns. Return a pad as a window object.
sv: Skapa och returnera en pekare till en ny pad-datastruktur med det angivna antalet rader och kolumner. Returnera en pad som ett window-objekt.

source: A pad is like a window, except that it is not restricted by the screen size, and is not necessarily associated with a particular part of the screen. Pads can be used when a large window is needed, and only a part of the window will be on the screen at one time. Automatic refreshes of pads (such as from scrolling or echoing of input) do not occur. The :meth:`~window.refresh` and :meth:`~window.noutrefresh` methods of a pad require 6 arguments to specify the part of the pad to be displayed and the location on the screen to be used for the display. The arguments are *pminrow*, *pmincol*, *sminrow*, *smincol*, *smaxrow*, *smaxcol*; the *p* arguments refer to the upper left corner of the pad region to be displayed and the *s* arguments define a clipping box on the screen within which the pad region is to be displayed.
sv: En pad är som ett fönster, förutom att den inte begränsas av skärmens storlek och inte nödvändigtvis är kopplad till en viss del av skärmen. Pads kan användas när ett stort fönster behövs och endast en del av fönstret visas på skärmen samtidigt. Automatiska uppdateringar av pads (t.ex. från scrollning eller eko av inmatning) sker inte. Metoderna :meth:`~window.refresh` och :meth:`~window.noutrefresh` för en pad kräver 6 argument för att specificera den del av padden som ska visas och den plats på skärmen som ska användas för visningen. Argumenten är *pminrow*, *pmincol*, *sminrow*, *smincol*, *smaxrow*, *smaxcol*; *p*-argumenten hänvisar till det övre vänstra hörnet av den pad-region som ska visas och *s*-argumenten definierar en klippbox på skärmen inom vilken pad-regionen ska visas.

source: Return a new :ref:`window <curses-window-objects>`, whose left-upper corner is at ``(begin_y, begin_x)``, and whose height/width is *nlines*/*ncols*.
sv: Returnerar ett nytt :ref:`fönster <curses-window-objects>`, vars vänstra övre hörn är vid ``(begin_y, begin_x)``, och vars höjd/bredd är *nlines*/*ncols*.

source: By default, the window will extend from the specified position to the lower right corner of the screen.
sv: Som standard kommer fönstret att sträcka sig från den angivna positionen till skärmens nedre högra hörn.

source: Enter newline mode. This mode translates the return key into newline on input, and translates newline into return and line-feed on output. Newline mode is initially on.
sv: Starta newline-läge. Detta läge översätter returtangenten till newline vid inmatning och översätter newline till retur och radmatning vid utmatning. Newline-läget är initialt aktiverat.

source: Leave cbreak mode. Return to normal "cooked" mode with line buffering.
sv: Lämna cbreak-läget. Återgå till normalt "cooked"-läge med linjebuffring.

source: Leave echo mode. Echoing of input characters is turned off.
sv: Lämna ekoläget. Ekot av inmatningstecken stängs av.

source: Leave newline mode. Disable translation of return into newline on input, and disable low-level translation of newline into newline/return on output (but this does not change the behavior of ``addch('\n')``, which always does the equivalent of return and line feed on the virtual screen). With translation off, curses can sometimes speed up vertical motion a little; also, it will be able to detect the return key on input.
sv: Lämna newline-läget. Inaktivera översättning av retur till ny rad vid inmatning och inaktivera lågnivåöversättning av ny rad till ny rad/retur vid utmatning (men detta ändrar inte beteendet hos ``addch('\n')``, som alltid gör motsvarande retur och radmatning på den virtuella skärmen). Med översättning avstängd kan curses ibland snabba upp den vertikala rörelsen lite; den kommer också att kunna upptäcka return-tangenten på inmatningen.

source: When the :func:`!noqiflush` routine is used, normal flush of input and output queues associated with the ``INTR``, ``QUIT`` and ``SUSP`` characters will not be done. You may want to call :func:`!noqiflush` in a signal handler if you want output to continue as though the interrupt had not occurred, after the handler exits.
sv: När rutinen :func:`!noqiflush` används, sker ingen normal rensning av in- och utmatningsköerna i samband med tecknen ``INTR``, ``QUIT`` och ``SUSP``. Du kanske vill anropa :func:`!noqiflush` i en signalhanterare om du vill att utdata ska fortsätta som om avbrottet inte hade inträffat, efter att hanteraren har avslutats.

source: Leave raw mode. Return to normal "cooked" mode with line buffering.
sv: Lämna rått läge. Återgå till normalt "cooked"-läge med linjebuffring.

source: Return a tuple ``(fg, bg)`` containing the colors for the requested color pair. The value of *pair_number* must be between ``0`` and ``COLOR_PAIRS - 1``.
sv: Returnerar en tupel ``(fg, bg)`` som innehåller färgerna för det begärda färgparet. Värdet på *pair_number* måste ligga mellan ``0`` och ``COLOR_PAIRS - 1``.

source: Return the number of the color-pair set by the attribute value *attr*. :func:`color_pair` is the counterpart to this function.
sv: Returnerar numret på det färgpar som anges av attributvärdet *attr*. :func:`color_pair` är motsvarigheten till denna funktion.

source: Equivalent to ``tputs(str, 1, putchar)``; emit the value of a specified terminfo capability for the current terminal. Note that the output of :func:`putp` always goes to standard output.
sv: Motsvarar ``tputs(str, 1, putchar)``; ger ut värdet av en angiven terminfo-kapacitet för den aktuella terminalen. Observera att utdata från :func:`putp` alltid går till standardutdata.

source: If *flag* is ``False``, the effect is the same as calling :func:`noqiflush`. If *flag* is ``True``, or no argument is provided, the queues will be flushed when these control characters are read.
sv: Om *flag* är ``False`` är effekten densamma som att anropa :func:`noqiflush`. Om *flag* är ``True``, eller om inget argument anges, kommer köerna att tömmas när dessa kontrolltecken läses.

source: Enter raw mode. In raw mode, normal line buffering and processing of interrupt, quit, suspend, and flow control keys are turned off; characters are presented to curses input functions one by one.
sv: Gå till raw-läge. I raw mode är normal linjebuffring och bearbetning av avbrott, quit, suspend och flödeskontrollknappar avstängda; tecken presenteras för curses inmatningsfunktioner en efter en.

source: Restore the terminal to "program" mode, as previously saved by :func:`def_prog_mode`.
sv: Återställ terminalen till "program"-läge, som tidigare sparats av :func:`def_prog_mode`.

source: Restore the terminal to "shell" mode, as previously saved by :func:`def_shell_mode`.
sv: Återställer terminalen till "shell"-läge, som tidigare sparats av :func:`def_shell_mode`.

source: Restore the state of the terminal modes to what it was at the last call to :func:`savetty`.
sv: Återställer tillståndet för terminallägena till vad det var vid det senaste anropet till :func:`savetty`.

source: Backend function used by :func:`resizeterm`, performing most of the work; when resizing the windows, :func:`resize_term` blank-fills the areas that are extended. The calling application should fill in these areas with appropriate data. The :func:`!resize_term` function attempts to resize all windows. However, due to the calling convention of pads, it is not possible to resize these without additional interaction with the application.
sv: Backend-funktion som används av :func:`resizeterm` och som utför det mesta av arbetet; vid ändring av fönsterstorlek fyller :func:`resize_term` i de områden som utökas. Den anropande applikationen bör fylla i dessa områden med lämpliga data. Funktionen :func:`!resize_term` försöker ändra storlek på alla fönster. På grund av anropskonventionen för pads är det dock inte möjligt att ändra storlek på dessa utan ytterligare interaktion med applikationen.

source: Resize the standard and current windows to the specified dimensions, and adjusts other bookkeeping data used by the curses library that record the window dimensions (in particular the SIGWINCH handler).
sv: Ändrar storlek på standardfönstret och det aktuella fönstret till de angivna dimensionerna och justerar andra bokföringsdata som används av curses-biblioteket som registrerar fönsterdimensionerna (i synnerhet SIGWINCH-hanteraren).

source: Save the current state of the terminal modes in a buffer, usable by :func:`resetty`.
sv: Spara det aktuella tillståndet för terminallägena i en buffert, som kan användas av :func:`resetty`.

source: Retrieves the value set by :func:`set_escdelay`.
sv: Hämtar det värde som ställdes in av :func:`set_escdelay`.

source: Sets the number of milliseconds to wait after reading an escape character, to distinguish between an individual escape character entered on the keyboard from escape sequences sent by cursor and function keys.
sv: Ställer in antalet millisekunder som ska vänta efter att ett escape-tecken har lästs, för att skilja mellan ett enskilt escape-tecken som skrivs in på tangentbordet och escape-sekvenser som skickas med markör- och funktionstangenter.

source: Retrieves the value set by :func:`set_tabsize`.
sv: Hämtar det värde som ställdes in av :func:`set_tabsize`.

source: Sets the number of columns used by the curses library when converting a tab character to spaces as it adds the tab to a window.
sv: Anger antalet kolumner som används av curses-biblioteket när ett tabbtecken konverteras till mellanslag när tabben läggs till i ett fönster.

source: Set the virtual screen cursor to *y*, *x*. If *y* and *x* are both ``-1``, then :meth:`leaveok <window.leaveok>` is set ``True``.
sv: Ställ in markören på den virtuella skärmen till *y*, *x*. Om *y* och *x* båda är ``-1``, sätts :meth:`leaveok <window.leaveok>`` till ``True``.

source: Initialize the terminal. *term* is a string giving the terminal name, or ``None``; if omitted or ``None``, the value of the :envvar:`TERM` environment variable will be used. *fd* is the file descriptor to which any initialization sequences will be sent; if not supplied or ``-1``, the file descriptor for ``sys.stdout`` will be used.
sv: Initialiserar terminalen. *term* är en sträng som anger terminalens namn, eller ``None``; om den utelämnas eller ``None``, kommer värdet för miljövariabeln :envvar:`TERM` att användas. *fd* är filbeskrivaren till vilken initialiseringssekvenser skickas; om den inte anges eller om ``-1``, används filbeskrivaren för ``sys.stdout``.

source: Must be called if the programmer wants to use colors, and before any other color manipulation routine is called. It is good practice to call this routine right after :func:`initscr`.
sv: Måste anropas om programmeraren vill använda färger, och innan någon annan färgmanipuleringsrutin anropas. Det är god praxis att anropa denna rutin direkt efter :func:`initscr`.

source: :func:`start_color` initializes eight basic colors (black, red, green, yellow, blue, magenta, cyan, and white), and two global variables in the :mod:`curses` module, :const:`COLORS` and :const:`COLOR_PAIRS`, containing the maximum number of colors and color-pairs the terminal can support. It also restores the colors on the terminal to the values they had when the terminal was just turned on.
sv: :func:`start_color` initierar åtta grundfärger (svart, röd, grön, gul, blå, magenta, cyan och vit) och två globala variabler i modulen :mod:`curses`, :const:`COLORS` och :const:`COLOR_PAIRS`, som innehåller det maximala antalet färger och färgpar som terminalen kan stödja. Den återställer också färgerna på terminalen till de värden de hade när terminalen precis hade slagits på.

source: Return a logical OR of all video attributes supported by the terminal. This information is useful when a curses program needs complete control over the appearance of the screen.
sv: Returnerar ett logiskt ELLER av alla videoattribut som stöds av terminalen. Denna information är användbar när ett curses-program behöver fullständig kontroll över skärmens utseende.

source: Return the value of the environment variable :envvar:`TERM`, as a bytes object, truncated to 14 characters.
sv: Returnera värdet för miljövariabeln :envvar:`TERM`, som ett bytesobjekt, trunkerat till 14 tecken.

source: Return the value of the Boolean capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-1`` if *capname* is not a Boolean capability, or ``0`` if it is canceled or absent from the terminal description.
sv: Returnerar värdet för den booleska egenskapen som motsvarar terminfo-egenskapsnamnet *capname* som ett heltal. Returnerar värdet ``-1`` om *capname* inte är en boolesk egenskap, eller ``0`` om den är avbruten eller saknas i terminalbeskrivningen.

source: Return the value of the numeric capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-2`` if *capname* is not a numeric capability, or ``-1`` if it is canceled or absent from the terminal description.
sv: Returnerar värdet för den numeriska kapacitet som motsvarar terminfo-kapacitetsnamnet *capname* som ett heltal. Returnerar värdet ``-2`` om *capname* inte är en numerisk kapacitet, eller ``-1`` om den är avbruten eller saknas i terminalbeskrivningen.

source: Return the value of the string capability corresponding to the terminfo capability name *capname* as a bytes object. Return ``None`` if *capname* is not a terminfo "string capability", or is canceled or absent from the terminal description.
sv: Returnerar värdet för strängkapaciteten som motsvarar terminfo-kapacitetsnamnet *capname* som ett bytesobjekt. Returnerar ``None`` om *capname* inte är en terminfo "string capability", eller är avbruten eller saknas i terminalbeskrivningen.

source: Instantiate the bytes object *str* with the supplied parameters, where *str* should be a parameterized string obtained from the terminfo database. E.g. ``tparm(tigetstr("cup"), 5, 3)`` could result in ``b'\033[6;4H'``, the exact result depending on terminal type.
sv: Instansiera bytesobjektet *str* med de angivna parametrarna, där *str* ska vara en parameteriserad sträng som hämtas från terminfo-databasen. T.ex. kan ``tparm(tigetstr("cup"), 5, 3)`` resultera i ``b'\033[6;4H'``, det exakta resultatet beror på terminaltyp.

source: Specify that the file descriptor *fd* be used for typeahead checking. If *fd* is ``-1``, then no typeahead checking is done.
sv: Ange att filbeskrivaren *fd* ska användas för typhuvudkontroll. Om *fd* är ``-1`` görs ingen typhuvudkontroll.

source: The curses library does "line-breakout optimization" by looking for typeahead periodically while updating the screen. If input is found, and it is coming from a tty, the current update is postponed until refresh or doupdate is called again, allowing faster response to commands typed in advance. This function allows specifying a different file descriptor for typeahead checking.
sv: Curses-biblioteket gör "line-breakout optimization" genom att leta efter typeahead med jämna mellanrum när skärmen uppdateras. Om inmatning hittas och den kommer från en tty, skjuts den aktuella uppdateringen upp tills refresh eller doupdate anropas igen, vilket ger snabbare svar på kommandon som skrivits i förväg. Den här funktionen gör det möjligt att ange en annan filbeskrivare för typahead-kontroll.

source: Return a bytes object which is a printable representation of the character *ch*. Control characters are represented as a caret followed by the character, for example as ``b'^C'``. Printing characters are left as they are.
sv: Returnerar ett bytesobjekt som är en utskriftsvänlig representation av tecknet *ch*. Kontrolltecken representeras av en caret följt av tecknet, t.ex. ``b'^C'``. Utskriftstecken lämnas som de är.

source: Push *ch* so the next :meth:`~window.getch` will return it.
sv: Tryck *ch* så att nästa :meth:`~window.getch` returnerar den.

source: Only one *ch* can be pushed before :meth:`!getch` is called.
sv: Endast en *ch* kan skjutas innan :meth:`!getch` anropas.

source: Update the :const:`LINES` and :const:`COLS` module variables. Useful for detecting manual screen resize.
sv: Uppdatera modulvariablerna :const:`LINES` och :const:`COLS`. Användbar för att upptäcka manuell skärmstorleksändring.

source: Push *ch* so the next :meth:`~window.get_wch` will return it.
sv: Tryck *ch* så att nästa :meth:`~window.get_wch` returnerar den.

source: Only one *ch* can be pushed before :meth:`!get_wch` is called.
sv: Endast en *ch* kan skjutas innan :meth:`!get_wch` anropas.

source: Push a :const:`KEY_MOUSE` event onto the input queue, associating the given state data with it.
sv: Lägg till en händelse av typen :const:`KEY_MOUSE` i indatakön och associera den med de angivna tillståndsuppgifterna.

source: If used, this function should be called before :func:`initscr` or newterm are called. When *flag* is ``False``, the values of lines and columns specified in the terminfo database will be used, even if environment variables :envvar:`LINES` and :envvar:`COLUMNS` (used by default) are set, or if curses is running in a window (in which case default behavior would be to use the window size if :envvar:`LINES` and :envvar:`COLUMNS` are not set).
sv: Om denna funktion används bör den anropas innan :func:`initscr` eller newterm anropas. När *flag* är ``False`` kommer värdena för rader och kolumner som anges i terminfo-databasen att användas, även om miljövariablerna :envvar:`LINES` och :envvar:`COLUMNS` (används som standard) är inställda, eller om curses körs i ett fönster (i vilket fall standardbeteendet skulle vara att använda fönsterstorleken om :envvar:`LINES` och :envvar:`COLUMNS` inte är inställda).

source: Equivalent to ``assume_default_colors(-1, -1)``.
sv: Motsvarar ``assume_default_colors(-1, -1)``.

source: Initialize curses and call another callable object, *func*, which should be the rest of your curses-using application. If the application raises an exception, this function will restore the terminal to a sane state before re-raising the exception and generating a traceback. The callable object *func* is then passed the main window 'stdscr' as its first argument, followed by any other arguments passed to :func:`!wrapper`. Before calling *func*, :func:`!wrapper` turns on cbreak mode, turns off echo, enables the terminal keypad, and initializes colors if the terminal has color support. On exit (whether normally or by exception) it restores cooked mode, turns on echo, and disables the terminal keypad.
sv: Initialiserar curses och anropar ett annat anropsbart objekt, *func*, som bör vara resten av din curses-användande applikation. Om programmet ger upphov till ett undantag kommer den här funktionen att återställa terminalen till ett sunt tillstånd innan undantaget ges upphov till ett nytt undantag och en spårning genereras. Det anropbara objektet *func* får sedan huvudfönstret 'stdscr' som sitt första argument, följt av alla andra argument som skickas till :func:`!wrapper`. Innan *func* anropas slår :func:`!wrapper` på cbreak-läget, stänger av echo, aktiverar terminalens knappsats och initialiserar färger om terminalen har färgstöd. När programmet avslutas (normalt eller genom undantag) återställs cooked mode, echo slås på och terminalens knappsats inaktiveras.

source: Window Objects
sv: Fönsterobjekt

source: Window objects, as returned by :func:`initscr` and :func:`newwin` above, have the following methods and attributes:
sv: Fönsterobjekt, som returneras av :func:`initscr` och :func:`newwin` ovan, har följande metoder och attribut:

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, overwriting any character previously painted at that location. By default, the character position and attributes are the current settings for the window object.
sv: Måla tecknet *ch* på ``(y, x)`` med attributen *attr*, och skriv över alla tecken som tidigare målats på den platsen. Som standard är teckenpositionen och attributen de aktuella inställningarna för fönsterobjektet.

source: Writing outside the window, subwindow, or pad raises a :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the character is printed.
sv: Skrivning utanför fönstret, underfönstret eller padden ger upphov till ett :exc:`curses.error`. Om du försöker skriva till det nedre högra hörnet av ett fönster, underfönster eller block kommer ett undantag att uppstå efter att tecknet har skrivits ut.

source: Paint at most *n* characters of the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
sv: Måla högst *n* tecken i teckensträngen *str* vid ``(y, x)`` med attributen *attr* och skriv över allt som tidigare visats på skärmen.

source: Paint the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
sv: Måla teckensträngen *str* vid ``(y, x)`` med attributen *attr* och skriv över allt som tidigare visats på skärmen.

source: Writing outside the window, subwindow, or pad raises :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the string is printed.
sv: Skrivning utanför fönstret, underfönstret eller dynan ger upphov till :exc:`curses.error`. Om du försöker skriva till det nedre högra hörnet av ett fönster, underfönster eller block kommer ett undantag att uppstå efter att strängen har skrivits ut.

source: A `bug in ncurses <https://bugs.python.org/issue35924>`_, the backend for this Python module, can cause SegFaults when resizing windows. This is fixed in ncurses-6.1-20190511. If you are stuck with an earlier ncurses, you can avoid triggering this if you do not call :func:`addstr` with a *str* that has embedded newlines. Instead, call :func:`addstr` separately for each line.
sv: En `bugg i ncurses <https://bugs.python.org/issue35924>`_, backend för denna Python-modul, kan orsaka SegFaults vid ändring av fönsterstorlek. Detta är åtgärdat i ncurses-6.1-20190511. Om du sitter fast med en tidigare ncurses kan du undvika att utlösa detta om du inte anropar :func:`addstr` med en *str* som har inbäddade nya linjer. Anropa istället :func:`addstr` separat för varje rad.
