Repository: yeager/python-docs-sv
Catalog: library/curses.po
Languages: sv

source: :mod:`!curses` --- Terminal handling for character-cell displays
sv: :mod:`!curses` --- Terminalhantering för tecken-cell-displayer

source: **Source code:** :source:`Lib/curses`
sv: **Källkod:** :source:`Lib/curses`

source: The :mod:`curses` module provides an interface to the curses library, the de-facto standard for portable advanced terminal handling.
sv: Modulen :mod:`curses` ger ett gränssnitt till curses-biblioteket, de facto-standarden för portabel avancerad terminalhantering.

source: While curses is most widely used in the Unix environment, versions are available for Windows, DOS, and possibly other systems as well. This extension module is designed to match the API of ncurses, an open-source curses library hosted on Linux and the BSD variants of Unix.
sv: Även om curses används mest i Unix-miljön finns det versioner för Windows, DOS och eventuellt andra system. Denna tilläggsmodul är utformad för att matcha API:et i ncurses, ett curses-bibliotek med öppen källkod som finns på Linux och BSD-varianterna av Unix.

source: Availability
sv: Tillgänglighet

source: This module is not supported on :ref:`mobile platforms <mobile-availability>` or :ref:`WebAssembly platforms <wasm-availability>`.
sv: Denna modul stöds inte på :ref:`mobile platforms <mobile-availability>` eller :ref:`WebAssembly platforms <wasm-availability>`.

source: Whenever the documentation mentions a *character* it can be specified as an integer, a one-character Unicode string or a one-byte byte string.
sv: Närhelst dokumentationen nämner ett *tecken* kan det anges som ett heltal, en Unicode-sträng med ett tecken eller en byte-sträng med en byte.

source: Whenever the documentation mentions a *character string* it can be specified as a Unicode string or a byte string.
sv: När dokumentationen nämner en *teckensträng* kan den anges som en Unicode-sträng eller en byte-sträng.

source: Module :mod:`curses.ascii`
sv: Modul :mod:`curses.ascii`

source: Utilities for working with ASCII characters, regardless of your locale settings.
sv: Verktyg för att arbeta med ASCII-tecken, oberoende av dina lokala inställningar.

source: Module :mod:`curses.panel`
sv: Modul :mod:`curses.panel`

source: A panel stack extension that adds depth to curses windows.
sv: En panel stack extension som ger djup till curses-fönster.

source: Module :mod:`curses.textpad`
sv: Modul :mod:`curses.textpad`

source: Editable text widget for curses supporting :program:`Emacs`\ -like bindings.
sv: Redigerbar textwidget för curses med stöd för :program:`Emacs`-liknande bindningar.

source: Tutorial material on using curses with Python, by Andrew Kuchling and Eric Raymond.
sv: Handledningsmaterial om hur man använder curses med Python, av Andrew Kuchling och Eric Raymond.

source: Functions
sv: Funktioner

source: The module :mod:`curses` defines the following exception:
sv: Modulen :mod:`curses` definierar följande undantag:

source: Exception raised when a curses library function returns an error.
sv: Undantag som uppstår när en funktion i curses-biblioteket returnerar ett fel.

source: Whenever *x* or *y* arguments to a function or a method are optional, they default to the current cursor location. Whenever *attr* is optional, it defaults to :const:`A_NORMAL`.
sv: När *x* eller *y* argument till en funktion eller en metod är valfria, används de som standard till den aktuella markörpositionen. När *attr* är valfritt, är det standardvärdet :const:`A_NORMAL`.

source: The module :mod:`curses` defines the following functions:
sv: Modulen :mod:`curses` definierar följande funktioner:

source: Allow use of default values for colors on terminals supporting this feature. Use this to support transparency in your application.
sv: Tillåt användning av standardvärden för färger på terminaler som stöder denna funktion. Använd detta för att stödja transparens i din applikation.

source: Assign terminal default foreground/background colors to color number ``-1``. So ``init_pair(x, COLOR_RED, -1)`` will initialize pair *x* as red on default background and ``init_pair(x, -1, COLOR_BLUE)`` will initialize pair *x* as default foreground on blue.
sv: Tilldela terminalens standardfärger för förgrund/bakgrund till färgnumret ``-1``. Så ``init_pair(x, COLOR_RED, -1)`` initierar paret *x* som rött på standardbakgrund och ``init_pair(x, -1, COLOR_BLUE)`` initierar paret *x* som standardförgrund på blått.

source: Change the definition of the color-pair ``0`` to ``(fg, bg)``.
sv: Ändra definitionen av färgparet ``0`` till ``(fg, bg)``.

source: Return the output speed of the terminal in bits per second. On software terminal emulators it will have a fixed high value. Included for historical reasons; in former times, it was used to write output loops for time delays and occasionally to change interfaces depending on the line speed.
sv: Returnerar terminalens utmatningshastighet i bitar per sekund. På mjukvaruterminalemulatorer kommer den att ha ett fast högt värde. Inkluderad av historiska skäl; förr i tiden användes den för att skriva utmatningsloopar för tidsfördröjningar och ibland för att ändra gränssnitt beroende på linjehastigheten.

source: Emit a short attention sound.
sv: Avge ett kort uppmärksamhetsljud.

source: Return ``True`` or ``False``, depending on whether the programmer can change the colors displayed by the terminal.
sv: Returnerar ``True`` eller ``False``, beroende på om programmeraren kan ändra färgerna som visas av terminalen.

source: Enter cbreak mode. In cbreak mode (sometimes called "rare" mode) normal tty line buffering is turned off and characters are available to be read one by one. However, unlike raw mode, special characters (interrupt, quit, suspend, and flow control) retain their effects on the tty driver and calling program. Calling first :func:`raw` then :func:`cbreak` leaves the terminal in cbreak mode.
sv: Gå till cbreak-läge. I cbreak-läge (ibland kallat "rare"-läge) stängs den normala buffringen av tty-linjer av och tecken kan läsas ett efter ett. Till skillnad från raw-läget behåller dock specialtecken (interrupt, quit, suspend och flow control) sina effekter på tty-drivrutinen och det anropande programmet. Om du först anropar :func:`raw` och sedan :func:`cbreak` lämnas terminalen i cbreak-läge.

source: Return the intensity of the red, green, and blue (RGB) components in the color *color_number*, which must be between ``0`` and ``COLORS - 1``. Return a 3-tuple, containing the R,G,B values for the given color, which will be between ``0`` (no component) and ``1000`` (maximum amount of component).
sv: Returnerar intensiteten för de röda, gröna och blå (RGB) komponenterna i färgen *color_number*, som måste ligga mellan ``0`` och ``COLORS - 1``. Returnerar en 3-tupel som innehåller R,G,B-värdena för den angivna färgen, som kommer att ligga mellan ``0`` (ingen komponent) och ``1000`` (maximal mängd komponent).

source: Return the attribute value for displaying text in the specified color pair. Only the first 256 color pairs are supported. This attribute value can be combined with :const:`A_STANDOUT`, :const:`A_REVERSE`, and the other :const:`!A_\*` attributes. :func:`pair_number` is the counterpart to this function.
sv: Returnerar attributvärdet för visning av text i det angivna färgparet. Endast de första 256 färgparen stöds. Detta attributvärde kan kombineras med :const:`A_STANDOUT`, :const:`A_REVERSE` och de andra :const:`!A_\*`-attributen. :func:`pair_number` är motsvarigheten till denna funktion.

source: Set the cursor state. *visibility* can be set to ``0``, ``1``, or ``2``, for invisible, normal, or very visible. If the terminal supports the visibility requested, return the previous cursor state; otherwise raise an exception. On many terminals, the "visible" mode is an underline cursor and the "very visible" mode is a block cursor.
sv: Ställer in markörens tillstånd. *visibility* kan sättas till ``0``, ``1`` eller ``2``, för osynlig, normal eller mycket synlig. Om terminalen stöder den begärda synligheten, returneras det tidigare markörtillståndet; annars uppstår ett undantag. På många terminaler är läget "synlig" en understruken markör och läget "mycket synlig" en blockmarkör.

source: Save the current terminal mode as the "program" mode, the mode when the running program is using curses. (Its counterpart is the "shell" mode, for when the program is not in curses.) Subsequent calls to :func:`reset_prog_mode` will restore this mode.
sv: Sparar det aktuella terminalläget som "program"-läge, det läge då det program som körs använder curses. (Dess motsvarighet är "shell"-läget, för när programmet inte använder curses.) Efterföljande anrop till :func:`reset_prog_mode` kommer att återställa detta läge.

source: Save the current terminal mode as the "shell" mode, the mode when the running program is not using curses. (Its counterpart is the "program" mode, when the program is using curses capabilities.) Subsequent calls to :func:`reset_shell_mode` will restore this mode.
sv: Spara det aktuella terminalläget som "shell"-läge, det vill säga det läge då det program som körs inte använder curses. (Dess motsvarighet är "program"-läget, när programmet använder curses-funktioner) Efterföljande anrop till :func:`reset_shell_mode` kommer att återställa detta läge.

source: Insert an *ms* millisecond pause in output.
sv: Infoga en *ms* millisekunds paus i utmatningen.

source: Update the physical screen. The curses library keeps two data structures, one representing the current physical screen contents and a virtual screen representing the desired next state. The :func:`doupdate` ground updates the physical screen to match the virtual screen.
sv: Uppdatera den fysiska skärmen. Curses-biblioteket har två datastrukturer, en som representerar det aktuella fysiska skärminnehållet och en virtuell skärm som representerar det önskade nästa tillståndet. Med :func:`doupdate` uppdateras den fysiska skärmen så att den matchar den virtuella skärmen.

source: The virtual screen may be updated by a :meth:`~window.noutrefresh` call after write operations such as :meth:`~window.addstr` have been performed on a window. The normal :meth:`~window.refresh` call is simply :meth:`!noutrefresh` followed by :func:`!doupdate`; if you have to update multiple windows, you can speed performance and perhaps reduce screen flicker by issuing :meth:`!noutrefresh` calls on all windows, followed by a single :func:`!doupdate`.
sv: Den virtuella skärmen kan uppdateras genom ett :meth:`~window.noutrefresh`-anrop efter att skrivoperationer som :meth:`~window.addstr` har utförts på ett fönster. Det normala :meth:`~window.refresh`-anropet är helt enkelt :meth:`!noutrefresh` följt av :func:`!doupdate`; om du måste uppdatera flera fönster kan du öka prestandan och kanske minska skärmflimmer genom att utfärda :meth:`!noutrefresh`-anrop på alla fönster, följt av en enda :func:`!doupdate`.

source: Enter echo mode. In echo mode, each character input is echoed to the screen as it is entered.
sv: Gå till ekoläge. I ekoläge ekas varje tecken som matas in på skärmen när det matas in.

source: De-initialize the library, and return terminal to normal status.
sv: Avinitialisera biblioteket och återställ terminalen till normal status.

source: Return the user's current erase character as a one-byte bytes object. Under Unix operating systems this is a property of the controlling tty of the curses program, and is not set by the curses library itself.
sv: Returnerar användarens aktuella raderingstecken som ett objekt på en byte. Under Unix-operativsystem är detta en egenskap hos den tty som styr curses-programmet, och ställs inte in av själva curses-biblioteket.

source: The :func:`.filter` routine, if used, must be called before :func:`initscr` is called. The effect is that, during those calls, :envvar:`LINES` is set to ``1``; the capabilities ``clear``, ``cup``, ``cud``, ``cud1``, ``cuu1``, ``cuu``, ``vpa`` are disabled; and the ``home`` string is set to the value of ``cr``. The effect is that the cursor is confined to the current line, and so are screen updates. This may be used for enabling character-at-a-time line editing without touching the rest of the screen.
sv: Rutinen :func:`.filter`, om den används, måste anropas innan :func:`initscr` anropas. Effekten är att, under dessa anrop, :envvar:`LINES` sätts till ``1``; funktionerna ``clear``, ``cup``, ``cud``, ``cud1``, ``cuu1``, ``cuu``, ``vpa`` inaktiveras; och strängen ``home`` sätts till värdet av ``cr``. Effekten blir att markören begränsas till den aktuella raden, och det gäller även skärmuppdateringar. Detta kan användas för att göra det möjligt att redigera en rad med ett tecken i taget utan att röra resten av skärmen.

source: Flash the screen. That is, change it to reverse-video and then change it back in a short interval. Some people prefer such as 'visible bell' to the audible attention signal produced by :func:`beep`.
sv: Flasha skärmen. Det vill säga, ändra till omvänd video och sedan ändra tillbaka igen med kort intervall. Vissa människor föredrar en sådan "synlig klocka" framför den hörbara uppmärksamhetssignal som produceras av :func:`beep`.

source: Flush all input buffers. This throws away any typeahead that has been typed by the user and has not yet been processed by the program.
sv: Töm alla inmatningsbuffertar. Detta kastar bort all typahead som har skrivits av användaren och som ännu inte har bearbetats av programmet.

source: After :meth:`~window.getch` returns :const:`KEY_MOUSE` to signal a mouse event, this method should be called to retrieve the queued mouse event, represented as a 5-tuple ``(id, x, y, z, bstate)``. *id* is an ID value used to distinguish multiple devices, and *x*, *y*, *z* are the event's coordinates. (*z* is currently unused.) *bstate* is an integer value whose bits will be set to indicate the type of event, and will be the bitwise OR of one or more of the following constants, where *n* is the button number from 1 to 5: :const:`BUTTONn_PRESSED`, :const:`BUTTONn_RELEASED`, :const:`BUTTONn_CLICKED`, :const:`BUTTONn_DOUBLE_CLICKED`, :const:`BUTTONn_TRIPLE_CLICKED`, :const:`BUTTON_SHIFT`, :const:`BUTTON_CTRL`, :const:`BUTTON_ALT`.
sv: Efter att :meth:`~window.getch` returnerar :const:`KEY_MOUSE` för att signalera en mushändelse, bör denna metod anropas för att hämta den köade mushändelsen, representerad som en 5-tupel ``(id, x, y, z, bstate)``. *id* är ett ID-värde som används för att särskilja flera enheter, och *x*, *y*, *z* är händelsens koordinater. (*z* är för närvarande oanvänd.) *bstate* är ett heltalsvärde vars bitar ställs in för att ange händelsetyp och är det bitvisa ELLER-värdet av en eller flera av följande konstanter, där *n* är knappnumret från 1 till 5: :const:`BUTTONn_PRESSED`, :const:`BUTTONn_RELEASED`, :const:`BUTTONn_CLICKED`, :const:`BUTTONn_DOUBLE_CLICKED`, :const:`BUTTONn_TRIPLE_CLICKED`, :const:`BUTTON_SHIFT`, :const:`BUTTON_CTRL`, :const:`BUTTON_ALT`.

source: The ``BUTTON5_*`` constants are now exposed if they are provided by the underlying curses library.
sv: Konstanterna ``BUTTON5_*`` exponeras nu om de tillhandahålls av det underliggande curses-biblioteket.

source: Return the current coordinates of the virtual screen cursor as a tuple ``(y, x)``. If :meth:`leaveok <window.leaveok>` is currently ``True``, then return ``(-1, -1)``.
sv: Returnerar de aktuella koordinaterna för den virtuella skärmens markör som en tupel ``(y, x)``. Om :meth:`leaveok <window.leaveok>` för närvarande är ``True``, returneras ``(-1, -1)``.

source: Read window related data stored in the file by an earlier :func:`window.putwin` call. The routine then creates and initializes a new window using that data, returning the new window object.
sv: Läser fönsterrelaterade data som lagrats i filen genom ett tidigare :func:`window.putwin`-anrop. Rutinen skapar och initialiserar sedan ett nytt fönster med hjälp av dessa data och returnerar det nya fönsterobjektet.

source: Return ``True`` if the terminal can display colors; otherwise, return ``False``.
sv: Returnerar ``True`` om terminalen kan visa färger; annars returneras ``False``.

source: Return ``True`` if the module supports extended colors; otherwise, return ``False``. Extended color support allows more than 256 color pairs for terminals that support more than 16 colors (e.g. xterm-256color).
sv: Returnerar ``True`` om modulen stöder utökade färger, annars returneras ``False``. Utökat färgstöd tillåter fler än 256 färgpar för terminaler som stöder fler än 16 färger (t.ex. xterm-256color).

source: Extended color support requires ncurses version 6.1 or later.
sv: För utökat färgstöd krävs ncurses version 6.1 eller senare.

source: Return ``True`` if the terminal has insert- and delete-character capabilities. This function is included for historical reasons only, as all modern software terminal emulators have such capabilities.
sv: Returnerar ``True`` om terminalen har funktioner för att infoga och ta bort tecken. Denna funktion är endast med av historiska skäl, eftersom alla moderna mjukvaruterminalemulatorer har sådana funktioner.

source: Return ``True`` if the terminal has insert- and delete-line capabilities, or can simulate them using scrolling regions. This function is included for historical reasons only, as all modern software terminal emulators have such capabilities.
sv: Returnerar ``True`` om terminalen har funktioner för att infoga och radera rader, eller kan simulera dem med hjälp av rullningsområden. Denna funktion är endast med av historiska skäl, eftersom alla moderna mjukvaruterminalemulatorer har sådana funktioner.

source: Take a key value *ch*, and return ``True`` if the current terminal type recognizes a key with that value.
sv: Ta ett nyckelvärde *ch* och returnera ``True`` om den aktuella terminaltypen känner igen en nyckel med det värdet.

source: Used for half-delay mode, which is similar to cbreak mode in that characters typed by the user are immediately available to the program. However, after blocking for *tenths* tenths of seconds, raise an exception if nothing has been typed. The value of *tenths* must be a number between ``1`` and ``255``. Use :func:`nocbreak` to leave half-delay mode.
sv: Används för halvfördröjningsläge, som liknar cbreak-läge genom att tecken som skrivs av användaren omedelbart är tillgängliga för programmet. Men efter att ha blockerat i *tendelar* tiondelar av sekunder, ska ett undantag uppstå om inget har skrivits. Värdet på *tenths* måste vara ett tal mellan ``1`` och ``255``. Använd :func:`nocbreak` för att lämna halvfördröjningsläget.

source: Change the definition of a color, taking the number of the color to be changed followed by three RGB values (for the amounts of red, green, and blue components). The value of *color_number* must be between ``0`` and ``COLORS - 1``. Each of *r*, *g*, *b*, must be a value between ``0`` and ``1000``. When :func:`init_color` is used, all occurrences of that color on the screen immediately change to the new definition. This function is a no-op on most terminals; it is active only if :func:`can_change_color` returns ``True``.
sv: Ändra definitionen av en färg genom att ta numret på den färg som ska ändras följt av tre RGB-värden (för mängden röda, gröna och blå komponenter). Värdet på *color_number* måste ligga mellan ``0`` och ``COLORS - 1``. Var och en av *r*, *g*, *b* måste vara ett värde mellan ``0`` och ``1000``. När :func:`init_color` används, ändras alla förekomster av den färgen på skärmen omedelbart till den nya definitionen. Denna funktion är inte tillgänglig på de flesta terminaler; den är endast aktiv om :func:`can_change_color` returnerar ``True``.

source: Change the definition of a color-pair. It takes three arguments: the number of the color-pair to be changed, the foreground color number, and the background color number. The value of *pair_number* must be between ``1`` and ``COLOR_PAIRS - 1`` (the ``0`` color pair can only be changed by :func:`use_default_colors` and :func:`assume_default_colors`). The value of *fg* and *bg* arguments must be between ``0`` and ``COLORS - 1``, or, after calling :func:`!use_default_colors` or :func:`!assume_default_colors`, ``-1``. If the color-pair was previously initialized, the screen is refreshed and all occurrences of that color-pair are changed to the new definition.
sv: Ändrar definitionen av ett färgpar. Den tar tre argument: numret på det färgpar som ska ändras, numret på förgrundsfärgen och numret på bakgrundsfärgen. Värdet på *pair_number* måste vara mellan ``1`` och ``COLOR_PAIRS - 1`` (färgparet ``0`` kan endast ändras med :func:`use_default_colors` och :func:`assume_default_colors`). Värdet på argumenten *fg* och *bg* måste vara mellan ``0`` och ``COLORS - 1``, eller, efter anrop av :func:`!use_default_colors` eller :func:`!assume_default_colors`, ``-1``. Om färgparet tidigare har initialiserats uppdateras skärmen och alla förekomster av färgparet ändras till den nya definitionen.

source: Initialize the library. Return a :ref:`window <curses-window-objects>` object which represents the whole screen.
sv: Initialiserar biblioteket. Returnerar ett :ref:`window <curses-window-objects>`-objekt som representerar hela skärmen.

source: If there is an error opening the terminal, the underlying curses library may cause the interpreter to exit.
sv: Om det uppstår ett fel när terminalen öppnas kan det underliggande curses-biblioteket göra att tolken avslutas.

source: Return ``True`` if :func:`resize_term` would modify the window structure, ``False`` otherwise.
sv: Returnerar ``True`` om :func:`resize_term` skulle ändra fönsterstrukturen, ``False`` annars.

source: Return ``True`` if :func:`endwin` has been called (that is, the curses library has been deinitialized).
sv: Returnerar ``True`` om :func:`endwin` har anropats (det vill säga, curses-biblioteket har deinitialiserats).

source: Return the name of the key numbered *k* as a bytes object. The name of a key generating printable ASCII character is the key's character. The name of a control-key combination is a two-byte bytes object consisting of a caret (``b'^'``) followed by the corresponding printable ASCII character. The name of an alt-key combination (128--255) is a bytes object consisting of the prefix ``b'M-'`` followed by the name of the corresponding ASCII character.
sv: Returnerar namnet på nyckeln numrerad *k* som ett bytesobjekt. Namnet på en nyckel som genererar ett utskrivbart ASCII-tecken är nyckelns tecken. Namnet på en kontrolltangentkombination är ett bytesobjekt på två byte som består av en caret (``b'^'``) följt av motsvarande utskrivbara ASCII-tecken. Namnet på en alt-key-kombination (128--255) är ett bytesobjekt som består av prefixet ``b'M-'`` följt av namnet på motsvarande ASCII-tecken.

source: Return the user's current line kill character as a one-byte bytes object. Under Unix operating systems this is a property of the controlling tty of the curses program, and is not set by the curses library itself.
sv: Returnerar användarens aktuella radavbrytningstecken som ett objekt med en byte. Under Unix-operativsystem är detta en egenskap hos den tty som styr curses-programmet och ställs inte in av själva curses-biblioteket.

source: Return a bytes object containing the terminfo long name field describing the current terminal. The maximum length of a verbose description is 128 characters. It is defined only after the call to :func:`initscr`.
sv: Returnerar ett bytesobjekt som innehåller terminfo long name-fältet som beskriver den aktuella terminalen. Den maximala längden på en utförlig beskrivning är 128 tecken. Den definieras endast efter anropet till :func:`initscr`.

source: If *flag* is ``True``, allow 8-bit characters to be input. If *flag* is ``False``, allow only 7-bit chars.
sv: Om *flag* är ``True`` tillåts 8-bitars tecken att matas in. Om *flag* är ``False`` tillåts endast 7-bitars tecken.
