Repository: yeager/python-docs-sv
Catalog: library/curses.po
Languages: sv

source: Reallocate storage for a curses window to adjust its dimensions to the specified values. If either dimension is larger than the current values, the window's data is filled with blanks that have the current background rendition (as set by :meth:`bkgdset`) merged into them.
sv: Omallokerar lagring för ett curses-fönster för att justera dess dimensioner till de angivna värdena. Om någon av dimensionerna är större än de aktuella värdena fylls fönstrets data med blanksteg som har den aktuella bakgrundsrenderingen (enligt :meth:`bkgdset`) sammanfogad i dem.

source: Scroll the screen or scrolling region upward by *lines* lines.
sv: Skrolla skärmen eller skrollområdet uppåt med *linjer* linjer.

source: Control what happens when the cursor of a window is moved off the edge of the window or scrolling region, either as a result of a newline action on the bottom line, or typing the last character of the last line. If *flag* is ``False``, the cursor is left on the bottom line. If *flag* is ``True``, the window is scrolled up one line. Note that in order to get the physical scrolling effect on the terminal, it is also necessary to call :meth:`idlok`.
sv: Styr vad som händer när markören i ett fönster flyttas från kanten av fönstret eller rullningsområdet, antingen som ett resultat av en ny rad på den nedre raden eller genom att skriva det sista tecknet på den sista raden. Om *flag* är ``False``, lämnas markören kvar på den nedersta raden. Om *flag* är ``True`` rullas fönstret upp en rad. Observera att för att få den fysiska scrollningseffekten på terminalen är det också nödvändigt att anropa :meth:`idlok`.

source: Set the scrolling region from line *top* to line *bottom*. All scrolling actions will take place in this region.
sv: Ställ in rullningsregionen från rad *överst* till rad *nederst*. Alla skrollningar kommer att ske i denna region.

source: Turn off the standout attribute. On some terminals this has the side effect of turning off all attributes.
sv: Stäng av det utmärkande attributet. På vissa terminaler har detta som bieffekt att alla attribut stängs av.

source: Turn on attribute *A_STANDOUT*.
sv: Slå på attributet *A_STANDOUT*.

source: Return a sub-window, whose upper-left corner is at ``(begin_y, begin_x)``, and whose width/height is *ncols*/*nlines*.
sv: Returnerar ett underfönster, vars övre vänstra hörn är vid ``(begin_y, begin_x)``, och vars bredd/höjd är *ncols*/*nlines*.

source: By default, the sub-window will extend from the specified position to the lower right corner of the window.
sv: Som standard kommer underfönstret att sträcka sig från den angivna positionen till fönstrets nedre högra hörn.

source: Touch each location in the window that has been touched in any of its ancestor windows. This routine is called by :meth:`refresh`, so it should almost never be necessary to call it manually.
sv: Rör vid varje plats i fönstret som har rörts vid i något av dess förfädersfönster. Denna rutin anropas av :meth:`refresh`, så det bör nästan aldrig vara nödvändigt att anropa den manuellt.

source: If *flag* is ``True``, then :meth:`syncup` is called automatically whenever there is a change in the window.
sv: Om *flag* är ``True``, anropas :meth:`syncup` automatiskt närhelst det sker en förändring i fönstret.

source: Touch all locations in ancestors of the window that have been changed in the window.
sv: Tryck på alla platser i fönstrets förfäder som har ändrats i fönstret.

source: Set blocking or non-blocking read behavior for the window. If *delay* is negative, blocking read is used (which will wait indefinitely for input). If *delay* is zero, then non-blocking read is used, and :meth:`getch` will return ``-1`` if no input is waiting. If *delay* is positive, then :meth:`getch` will block for *delay* milliseconds, and return ``-1`` if there is still no input at the end of that time.
sv: Ställ in blockerande eller icke-blockerande läsbeteende för fönstret. Om *delay* är negativ används blockerande läsning (som väntar på indata på obestämd tid). Om *delay* är noll används icke-blockerande läsning och :meth:`getch` returnerar ``-1`` om ingen indata väntar. Om *delay* är positiv kommer :meth:`getch` att blockera i *delay* millisekunder och returnera ``-1`` om det fortfarande inte finns någon indata efter den tiden.

source: Pretend *count* lines have been changed, starting with line *start*. If *changed* is supplied, it specifies whether the affected lines are marked as having been changed (*changed*\ ``=True``) or unchanged (*changed*\ ``=False``).
sv: Låtsas att *antal* rader har ändrats, med början på rad *start*. Om *changed* anges, specificeras om de berörda raderna ska markeras som ändrade (*changed*\``=True``) eller oförändrade (*changed*\``=False``).

source: Pretend the whole window has been changed, for purposes of drawing optimizations.
sv: Låtsas att hela fönstret har ändrats för att optimera ritningen.

source: Mark all lines in the window as unchanged since the last call to :meth:`refresh`.
sv: Markera alla rader i fönstret som oförändrade sedan det senaste anropet till :meth:`refresh`.

source: Display a vertical line starting at ``(y, x)`` with length *n* consisting of the character *ch* with attributes *attr*.
sv: Visa en vertikal linje som börjar vid ``(y, x)`` med längden *n* och som består av tecknet *ch* med attributen *attr*.

source: Constants
sv: Konstanter

source: The :mod:`curses` module defines the following data members:
sv: Modulen :mod:`curses` definierar följande datamedlemmar:

source: Some curses routines that return an integer, such as :meth:`~window.getch`, return :const:`ERR` upon failure.
sv: Vissa curses-rutiner som returnerar ett heltal, t.ex. :meth:`~window.getch`, returnerar :const:`ERR` om de misslyckas.

source: Some curses routines that return an integer, such as :func:`napms`, return :const:`OK` upon success.
sv: Vissa curses-rutiner som returnerar ett heltal, t.ex. :func:`napms`, returnerar :const:`OK` när de lyckas.

source: A bytes object representing the current version of the module.
sv: Ett bytesobjekt som representerar den aktuella versionen av modulen.

source: A named tuple containing the three components of the ncurses library version: *major*, *minor*, and *patch*. All values are integers. The components can also be accessed by name, so ``curses.ncurses_version[0]`` is equivalent to ``curses.ncurses_version.major`` and so on.
sv: En namngiven tupel som innehåller de tre komponenterna i ncurses-bibliotekets version: *major*, *minor* och *patch*. Alla värden är heltal. Komponenterna kan också nås via namn, så ``curses.ncurses_version[0]`` är likvärdigt med ``curses.ncurses_version.major`` och så vidare.

source: Availability: if the ncurses library is used.
sv: Tillgänglighet: om biblioteket ncurses används.

source: The maximum number of colors the terminal can support. It is defined only after the call to :func:`start_color`.
sv: Det maximala antalet färger som terminalen kan stödja. Det definieras först efter anropet till :func:`start_color`.

source: The maximum number of color pairs the terminal can support. It is defined only after the call to :func:`start_color`.
sv: Det maximala antalet färgpar som terminalen kan stödja. Det definieras först efter anropet till :func:`start_color`.

source: The width of the screen, i.e., the number of columns. It is defined only after the call to :func:`initscr`. Updated by :func:`update_lines_cols`, :func:`resizeterm` and :func:`resize_term`.
sv: Skärmens bredd, d.v.s. antalet kolumner. Den definieras först efter anropet till :func:`initscr`. Uppdateras av :func:`update_lines_cols`, :func:`resizeterm` och :func:`resize_term`.

source: The height of the screen, i.e., the number of lines. It is defined only after the call to :func:`initscr`. Updated by :func:`update_lines_cols`, :func:`resizeterm` and :func:`resize_term`.
sv: Skärmens höjd, d.v.s. antalet rader. Den definieras först efter anropet till :func:`initscr`. Uppdateras av :func:`update_lines_cols`, :func:`resizeterm` och :func:`resize_term`.

source: Some constants are available to specify character cell attributes. The exact constants available are system dependent.
sv: Vissa konstanter finns tillgängliga för att ange teckencellens attribut. Exakt vilka konstanter som är tillgängliga är systemberoende.

source: Attribute
sv: Attribut

source: Meaning
sv: Betydelse

source: Alternate character set mode
sv: Läge för alternativ teckenuppsättning

source: Blink mode
sv: Blink-läge

source: Bold mode
sv: Fet stil

source: Dim mode
sv: Dim-läge

source: Invisible or blank mode
sv: Osynligt eller tomt läge

source: Italic mode
sv: Kursivt läge

source: Normal attribute
sv: Normalt attribut

source: Protected mode
sv: Skyddat läge

source: Reverse background and foreground colors
sv: Omvända bakgrunds- och förgrundsfärger

source: Standout mode
sv: Utmärkande läge

source: Underline mode
sv: Understrykningsläge

source: Horizontal highlight
sv: Horisontell markering

source: Left highlight
sv: Vänster markering

source: Low highlight
sv: Låg höjdpunkt

source: Right highlight
sv: Höger höjdpunkt

source: Top highlight
sv: Högsta höjdpunkt

source: Vertical highlight
sv: Vertikal markering

source: ``A_ITALIC`` was added.
sv: ``A_ITALIC`` lades till.

source: Several constants are available to extract corresponding attributes returned by some methods.
sv: Flera konstanter finns tillgängliga för att extrahera motsvarande attribut som returneras av vissa metoder.

source: Bit-mask to extract attributes
sv: Bit-mask för att extrahera attribut

source: Bit-mask to extract a character
sv: Bit-mask för att extrahera ett tecken

source: Bit-mask to extract color-pair field information
sv: Bit-mask för att extrahera information om färgparsfält

source: Keys are referred to by integer constants with names starting with ``KEY_``. The exact keycaps available are system dependent.
sv: Nycklar refereras till av heltalskonstanter med namn som börjar med ``KEY_``. Exakt vilka tangentbord som är tillgängliga är systemberoende.

source: Key constant
sv: Nyckel konstant

source: Key
sv: Nyckel

source: Minimum key value
sv: Minsta nyckelvärde

source: Break key (unreliable)
sv: Bryt nyckel (opålitlig)

source: Down-arrow
sv: Pil nedåt

source: Up-arrow
sv: Pil upp

source: Left-arrow
sv: Vänster pil

source: Right-arrow
sv: Pil höger

source: Home key (upward+left arrow)
sv: Hemknapp (uppåt+vänsterpil)

source: Backspace (unreliable)
sv: Backspace (opålitlig)

source: Function keys. Up to 64 function keys are supported.
sv: Funktionstangenter. Upp till 64 funktionsknappar stöds.

source: Value of function key *n*
sv: Värde för funktionsknapp *n*

source: Delete line
sv: Radera rad

source: Insert line
sv: Infoga rad

source: Delete character
sv: Radera tecken

source: Insert char or enter insert mode
sv: Infoga tecken eller gå till infogningsläge

source: Exit insert char mode
sv: Avsluta insättning av char-läge

source: Clear screen
sv: Rensa skärmen

source: Clear to end of screen
sv: Rensa till slutet av skärmen

source: Clear to end of line
sv: Rensa till slutet av raden

source: Scroll 1 line forward
sv: Bläddra 1 rad framåt

source: Scroll 1 line backward (reverse)
sv: Bläddra 1 rad bakåt (bakåt)

source: Next page
sv: Nästa sida

source: Previous page
sv: Föregående sida

source: Set tab
sv: Ställ in fliken

source: Clear tab
sv: Rensa fliken

source: Clear all tabs
sv: Rensa alla flikar

source: Enter or send (unreliable)
sv: Skriv in eller skicka (opålitlig)

source: Soft (partial) reset (unreliable)
sv: Mjuk (partiell) återställning (otillförlitlig)

source: Reset or hard reset (unreliable)
sv: Återställning eller hård återställning (otillförlitlig)

source: Print
sv: Skriv ut

source: Home down or bottom (lower left)
sv: Startsida nedåt eller nedåt (längst ned till vänster)

source: Upper left of keypad
sv: Övre vänstra delen av knappsatsen

source: Upper right of keypad
sv: Övre högra delen av knappsatsen

source: Center of keypad
sv: Knappsatsens mitt

source: Lower left of keypad
sv: Nedre vänstra delen av knappsatsen

source: Lower right of keypad
sv: Nedre högra delen av knappsatsen

source: Back tab
sv: Bakre fliken

source: Beg (beginning)
sv: Beg (början)

source: Cancel
sv: Avbryt

source: Close
sv: Stäng

source: Cmd (command)
sv: Cmd (kommando)

source: Copy
sv: Kopiera

source: Create
sv: Skapa

source: End
sv: Slut

source: Exit
sv: Avsluta

source: Find
sv: Hitta

source: Help
sv: Hjälp

source: Mark
sv: Markera

source: Message
sv: Meddelande

source: Move
sv: Flytta

source: Next
sv: Nästa

source: Open
sv: Öppen

source: Options
sv: Alternativ

source: Prev (previous)
sv: Prev (föregående)

source: Redo
sv: Gör om

source: Ref (reference)
sv: Ref (referens)

source: Refresh
sv: Uppdatera

source: Replace
sv: Ersätt

source: Restart
sv: Starta om

source: Resume
sv: Återuppta

source: Save
sv: Spara

source: Shifted Beg (beginning)
sv: Shifted Beg (början)

source: Shifted Cancel
sv: Shifted Avbryt

source: Shifted Command
sv: Förskjutet kommando

source: Shifted Copy
sv: Förskjuten kopia

source: Shifted Delete char
sv: Skiftad Delete-symbol

source: Shifted Delete line
sv: Skiftad Delete-linje

source: Select
sv: Välj

source: Shifted End
sv: Förskjutet slut

source: Shifted Clear line
sv: Förskjutet Fri linje

source: Shifted Exit
sv: Skiftad utgång

source: Shifted Find
sv: Förskjutet fynd

source: Shifted Help
sv: Förskjuten hjälp

source: Shifted Home
sv: Förflyttad hem

source: Shifted Input
sv: Skiftad inmatning

source: Shifted Left arrow
sv: Skiftad vänsterpil

source: Shifted Message
sv: Förskjutet meddelande

source: Shifted Move
sv: Skiftad rörelse

source: Shifted Next
sv: Shifted Nästa

source: Shifted Options
sv: Förskjutna alternativ

source: Shifted Prev
sv: Förskjuten Prev

source: Shifted Replace
sv: Skiftad ersättning

source: Shifted Right arrow
sv: Skiftad högerpil

source: Shifted Resume
sv: Förskjutet CV

source: Suspend
sv: Pausa

source: Undo
sv: Ångra

source: Mouse event has occurred
sv: En mushändelse har inträffat

source: Terminal resize event
sv: Händelse för storleksändring av terminal

source: Maximum key value
sv: Maximalt nyckelvärde

source: On VT100s and their software emulations, such as X terminal emulators, there are normally at least four function keys (:const:`KEY_F1 <KEY_Fn>`, :const:`KEY_F2 <KEY_Fn>`, :const:`KEY_F3 <KEY_Fn>`, :const:`KEY_F4 <KEY_Fn>`) available, and the arrow keys mapped to :const:`KEY_UP`, :const:`KEY_DOWN`, :const:`KEY_LEFT` and :const:`KEY_RIGHT` in the obvious way. If your machine has a PC keyboard, it is safe to expect arrow keys and twelve function keys (older PC keyboards may have only ten function keys); also, the following keypad mappings are standard:
sv: På VT100 och deras mjukvaruemuleringar, t.ex. X-terminalemulatorer, finns det normalt minst fyra funktionstangenter (:const:`KEY_F1 <KEY_Fn>`, :const:`KEY_F2 <KEY_Fn>`, :const:`KEY_F3 <KEY_Fn>`, :const:`KEY_F4 <KEY_Fn>`) tillgängliga, och piltangenterna mappas till :const:`KEY_UP`, :const:`KEY_DOWN`, :const:`KEY_LEFT` och :const:`KEY_RIGHT` på det uppenbara sättet. Om din maskin har ett PC-tangentbord är det säkert att förvänta sig piltangenter och tolv funktionstangenter (äldre PC-tangentbord kanske bara har tio funktionstangenter); dessutom är följande knappsatsmappningar standard:

source: Keycap
sv: Nyckelkap

source: Constant
sv: Konstant

source: :kbd:`Insert`
sv: :kbd:`Infoga`

source: :kbd:`End`
sv: :kbd:`Slut`

source: :kbd:`Page Up`
sv: :kbd:`Sida upp`

source: :kbd:`Page Down`
sv: :kbd:`Sida ner`

source: KEY_NPAGE
sv: NYCKELSIDA

source: The following table lists characters from the alternate character set. These are inherited from the VT100 terminal, and will generally be available on software emulations such as X terminals. When there is no graphic available, curses falls back on a crude printable ASCII approximation.
sv: I följande tabell listas tecken från den alternativa teckenuppsättningen. Dessa är ärvda från VT100-terminalen och kommer i allmänhet att vara tillgängliga på programvaruemuleringar som X-terminaler. När det inte finns någon grafik tillgänglig använder curses en grov approximation av ASCII för utskrift.

source: These are available only after :func:`initscr` has been called.
sv: Dessa är tillgängliga först efter att :func:`initscr` har anropats.

source: ACS code
sv: ACS-kod

source: alternate name for upper right corner
sv: alternativt namn för övre högra hörnet

source: solid square block
sv: massivt fyrkantigt block

source: board of squares
sv: bräda av rutor

source: alternate name for horizontal line
sv: alternativt namn för horisontell linje

source: alternate name for upper left corner
sv: alternativt namn för övre vänstra hörnet

source: alternate name for top tee
sv: alternativt namn för topptee

source: bottom tee
sv: nederdel tee

source: bullet
sv: kula

source: checker board (stipple)
sv: rutmönster (stipple)

source: arrow pointing down
sv: pil som pekar nedåt

source: degree symbol
sv: gradsymbol

source: diamond
sv: diamant

source: greater-than-or-equal-to
sv: större än eller lika med

source: horizontal line
sv: horisontell linje

source: lantern symbol
sv: symbol för lykta

source: left arrow
sv: vänster pil

source: less-than-or-equal-to
sv: mindre än eller lika med

source: lower left-hand corner
sv: nedre vänstra hörnet

source: lower right-hand corner
sv: nedre högra hörnet

source: left tee
sv: vänster tee

source: not-equal sign
sv: tecken som inte är lika med

source: letter pi
sv: bokstaven pi

source: plus-or-minus sign
sv: plus-eller-minus-tecken

source: big plus sign
sv: stort plustecken

source: right arrow
sv: pil höger

source: right tee
sv: rätt tee

source: scan line 1
sv: scanningslinje 1

source: scan line 3
sv: scanningslinje 3

source: scan line 7
sv: scanningslinje 7

source: scan line 9
sv: scanningslinje 9

source: alternate name for lower right corner
sv: alternativt namn för nedre högra hörnet

source: alternate name for vertical line
sv: alternativt namn för vertikal linje

source: alternate name for right tee
sv: alternativt namn för höger tee

source: alternate name for lower left corner
sv: alternativt namn för nedre vänstra hörnet

source: alternate name for bottom tee
sv: alternativt namn för bottentee

source: alternate name for left tee
sv: alternativt namn för vänster tee

source: alternate name for crossover or big plus
sv: alternativt namn för crossover eller big plus

source: pound sterling
sv: pund sterling

source: top tee
sv: topp tee

source: up arrow
sv: pil upp

source: upper left corner
sv: övre vänstra hörnet

source: upper right corner
sv: övre högra hörnet

source: vertical line
sv: vertikal linje

source: The following table lists mouse button constants used by :meth:`getmouse`:
sv: Följande tabell listar musknappskonstanter som används av :meth:`getmouse`:

source: Mouse button constant
sv: Musknapp konstant

source: Mouse button *n* pressed
sv: Musknapp *n* intryckt

source: Mouse button *n* released
sv: Musknapp *n* släppt

source: Mouse button *n* clicked
sv: Musknapp *n* klickad

source: Mouse button *n* double clicked
sv: Musknapp *n* dubbelklickad

source: Mouse button *n* triple clicked
sv: Musknapp *n* tre gånger klickad

source: Shift was down during button state change
sv: Skiftet var nere under byte av knappstatus

source: Control was down during button state change
sv: Kontrollen var avstängd under ändring av knappstatus

source: The following table lists the predefined colors:
sv: I följande tabell listas de fördefinierade färgerna:

source: Color
sv: Färg

source: Black
sv: Svart

source: Blue
sv: Blå

source: Cyan (light greenish blue)
sv: Cyan (ljus grönblå)

source: Green
sv: Grön

source: Magenta (purplish red)
sv: Magenta (purpurfärgad röd)

source: Red
sv: Röd

source: White
sv: Vit

source: Yellow
sv: Gult

source: :mod:`curses.textpad` --- Text input widget for curses programs
sv: :mod:`curses.textpad` --- Widget för inmatning av text i curses-program

source: The :mod:`curses.textpad` module provides a :class:`Textbox` class that handles elementary text editing in a curses window, supporting a set of keybindings resembling those of Emacs (thus, also of Netscape Navigator, BBedit 6.x, FrameMaker, and many other programs). The module also provides a rectangle-drawing function useful for framing text boxes or for other purposes.
sv: Modulen :mod:`curses.textpad` innehåller en :class:`Textbox`-klass som hanterar elementär textredigering i ett curses-fönster, med stöd för en uppsättning tangentbindningar som liknar dem i Emacs (och därmed också i Netscape Navigator, BBedit 6.x, FrameMaker och många andra program). Modulen innehåller också en funktion för att rita rektanglar som är användbar för att rama in textrutor eller för andra ändamål.

source: The module :mod:`curses.textpad` defines the following function:
sv: Modulen :mod:`curses.textpad` definierar följande funktion:

source: Draw a rectangle. The first argument must be a window object; the remaining arguments are coordinates relative to that window. The second and third arguments are the y and x coordinates of the upper left hand corner of the rectangle to be drawn; the fourth and fifth arguments are the y and x coordinates of the lower right hand corner. The rectangle will be drawn using VT100/IBM PC forms characters on terminals that make this possible (including xterm and most other software terminal emulators). Otherwise it will be drawn with ASCII dashes, vertical bars, and plus signs.
sv: Rita en rektangel. Det första argumentet måste vara ett fönsterobjekt; de återstående argumenten är koordinater i förhållande till det fönstret. Det andra och tredje argumentet är y- och x-koordinaterna för det övre vänstra hörnet av den rektangel som ska ritas; det fjärde och femte argumentet är y- och x-koordinaterna för det nedre högra hörnet. Rektangeln ritas med VT100/IBM PC-formtecken på terminaler som gör detta möjligt (inklusive xterm och de flesta andra mjukvaruterminalemulatorer). Annars ritas den med ASCII-streck, vertikala staplar och plustecken.

source: Textbox objects
sv: Textbox-objekt

source: You can instantiate a :class:`Textbox` object as follows:
sv: Du kan instansiera ett :class:`Textbox`-objekt på följande sätt:

source: Return a textbox widget object. The *win* argument should be a curses :ref:`window <curses-window-objects>` object in which the textbox is to be contained. The edit cursor of the textbox is initially located at the upper left hand corner of the containing window, with coordinates ``(0, 0)``. The instance's :attr:`stripspaces` flag is initially on.
sv: Returnerar ett widgetobjekt för en textruta. Argumentet *win* bör vara ett curses :ref:`window <curses-window-objects>`-objekt som textrutan ska ingå i. Redigeringsmarkören för textrutan är initialt placerad i det övre vänstra hörnet av det innehållande fönstret, med koordinaterna ``(0, 0)``. Instansens flagga :attr:`stripspaces` är initialt aktiverad.

source: :class:`Textbox` objects have the following methods:
sv: :class:`Textbox`-objekt har följande metoder:
