Repository: yeager/python-docs-sv
Catalog: library/curses.po
Languages: sv

source: This is the entry point you will normally use. It accepts editing keystrokes until one of the termination keystrokes is entered. If *validator* is supplied, it must be a function. It will be called for each keystroke entered with the keystroke as a parameter; command dispatch is done on the result. This method returns the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` attribute.
sv: Detta är den inmatningspunkt som du normalt kommer att använda. Den accepterar redigeringstangenttryckningar tills en av avslutningstangenttryckningarna anges. Om *validator* anges måste det vara en funktion. Den kommer att anropas för varje tangenttryckning som görs med tangenttryckningen som parameter; kommandot skickas med resultatet. Denna metod returnerar fönstrets innehåll som en sträng; huruvida blanksteg i fönstret inkluderas påverkas av attributet :attr:`stripspaces`.

source: Process a single command keystroke. Here are the supported special keystrokes:
sv: Behandla en enda kommandotangenttryckning. Här är de speciella tangenttryckningar som stöds:

source: Keystroke
sv: Tangenttryckning

source: Action
sv: Åtgärd

source: Go to left edge of window.
sv: Gå till vänstra kanten av fönstret.

source: Cursor left, wrapping to previous line if appropriate.
sv: Cursor vänster, ombrytning till föregående rad om så är lämpligt.

source: Delete character under cursor.
sv: Radera tecken under markören.

source: Go to right edge (stripspaces off) or end of line (stripspaces on).
sv: Gå till höger kant (stripspaces off) eller slutet av raden (stripspaces on).

source: :kbd:`Control-F`
sv: :kbd:`Kontroll-F`

source: Cursor right, wrapping to next line when appropriate.
sv: Cursor höger, brytning till nästa rad när så är lämpligt.

source: Terminate, returning the window contents.
sv: Avsluta och returnera fönstrets innehåll.

source: Delete character backward.
sv: Radera tecken bakåt.

source: Terminate if the window is 1 line, otherwise insert newline.
sv: Avsluta om fönstret är 1 rad, annars infoga ny rad.

source: :kbd:`Control-K`
sv: :kbd:`Kontroll-K`

source: If line is blank, delete it, otherwise clear to end of line.
sv: Om raden är tom, radera den, annars fortsätt till slutet av raden.

source: Refresh screen.
sv: Uppdatera skärmen.

source: Cursor down; move down one line.
sv: Nedåtpekare; flytta en rad nedåt.

source: Insert a blank line at cursor location.
sv: Infoga en tom rad vid markörens position.

source: Cursor up; move up one line.
sv: Cursor upp; flytta upp en rad.

source: Move operations do nothing if the cursor is at an edge where the movement is not possible. The following synonyms are supported where possible:
sv: Flyttoperationer gör ingenting om markören befinner sig på en kant där förflyttningen inte är möjlig. Följande synonymer stöds där så är möjligt:

source: All other keystrokes are treated as a command to insert the given character and move right (with line wrapping).
sv: Alla andra tangenttryckningar behandlas som ett kommando att infoga det angivna tecknet och flytta till höger (med radbrytning).

source: Return the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` member.
sv: Returnerar fönstrets innehåll som en sträng; huruvida blanksteg i fönstret inkluderas påverkas av :attr:`stripspaces`-medlemmen.

source: This attribute is a flag which controls the interpretation of blanks in the window. When it is on, trailing blanks on each line are ignored; any cursor motion that would land the cursor on a trailing blank goes to the end of that line instead, and trailing blanks are stripped when the window contents are gathered.
sv: Detta attribut är en flagga som styr tolkningen av blanksteg i fönstret. När den är aktiverad ignoreras blanksteg på varje rad; alla markörrörelser som skulle placera markören på ett blanksteg går till slutet av raden istället, och blanksteg tas bort när fönstrets innehåll samlas in.
