Repository: yeager/python-docs-sv
Catalog: library/dataclasses.po
Languages: sv

source: :mod:`!dataclasses` --- Data Classes
sv: :mod:`!dataclasses` --- Dataklasser

source: **Source code:** :source:`Lib/dataclasses.py`
sv: **Källkod:** :source:`Lib/dataclasses.py`

source: This module provides a decorator and functions for automatically adding generated :term:`special methods <special method>` such as :meth:`~object.__init__` and :meth:`~object.__repr__` to user-defined classes. It was originally described in :pep:`557`.
sv: Denna modul tillhandahåller en dekorator och funktioner för att automatiskt lägga till genererade :term:`specialmetoder <special method>` såsom :meth:`~object.__init__` och :meth:`~object.__repr__` till användardefinierade klasser. Den beskrevs ursprungligen i :pep:`557`.

source: The member variables to use in these generated methods are defined using :pep:`526` type annotations. For example, this code::
sv: De medlemsvariabler som ska användas i dessa genererade metoder definieras med hjälp av :pep:`526` typannoteringar. Till exempel den här koden::

source: from dataclasses import dataclass @dataclass class InventoryItem: """Class for keeping track of an item in inventory.""" name: str unit_price: float quantity_on_hand: int = 0 def total_cost(self) -> float: return self.unit_price * self.quantity_on_hand
sv: from dataclasses import dataclass @dataklass klass InventoryItem: """Klass för att hålla reda på ett objekt i inventering.""" name: str unit_price: float kvantitet_på_hand: int = 0 def total_cost(self) -> float: return self.unit_price * self.quantity_on_hand

source: will add, among other things, a :meth:`!__init__` that looks like::
sv: kommer bland annat att lägga till en :meth:`!__init__` som ser ut så här::

source: def __init__(self, name: str, unit_price: float, quantity_on_hand: int = 0): self.name = name self.unit_price = unit_price self.quantity_on_hand = quantity_on_hand
sv: def __init__(self, name: str, unit_price: float, quantity_on_hand: int = 0): self.name = namn self.unit_price = enhetspris self.quantity_on_hand = kvantitet_on_hand

source: Note that this method is automatically added to the class: it is not directly specified in the :class:`!InventoryItem` definition shown above.
sv: Notera att denna metod automatiskt läggs till i klassen: den är inte direkt specificerad i :class:`!InventoryItem`-definitionen som visas ovan.

source: Module contents
sv: Modulens innehåll

source: This function is a :term:`decorator` that is used to add generated :term:`special methods <special method>` to classes, as described below.
sv: Denna funktion är en :term:`decorator` som används för att lägga till genererade :term:`special methods <special method>` till klasser, enligt beskrivningen nedan.

source: The ``@dataclass`` decorator examines the class to find ``field``\s. A ``field`` is defined as a class variable that has a :term:`type annotation <variable annotation>`. With two exceptions described below, nothing in ``@dataclass`` examines the type specified in the variable annotation.
sv: Dekoratorn ``@dataclass`` undersöker klassen för att hitta ``field``. Ett ``field`` definieras som en klassvariabel som har en :term:`type annotation <variable annotation>`. Med två undantag som beskrivs nedan, undersöker ingenting i ``@dataclass`` den typ som anges i variabelannoteringen.

source: The order of the fields in all of the generated methods is the order in which they appear in the class definition.
sv: Ordningen på fälten i alla de genererade metoderna är den ordning i vilken de förekommer i klassdefinitionen.

source: The ``@dataclass`` decorator will add various "dunder" methods to the class, described below. If any of the added methods already exist in the class, the behavior depends on the parameter, as documented below. The decorator returns the same class that it is called on; no new class is created.
sv: Dekoratorn ``@dataclass`` kommer att lägga till olika "dunder"-metoder till klassen, beskrivna nedan. Om någon av de tillagda metoderna redan finns i klassen beror beteendet på parametern, vilket dokumenteras nedan. Dekoratorn returnerar samma klass som den anropas på; ingen ny klass skapas.

source: If ``@dataclass`` is used just as a simple decorator with no parameters, it acts as if it has the default values documented in this signature. That is, these three uses of ``@dataclass`` are equivalent::
sv: Om ``@dataclass`` bara används som en enkel dekorator utan parametrar, fungerar den som om den har de standardvärden som dokumenteras i denna signatur. Det vill säga, dessa tre användningar av ``@dataclass`` är likvärdiga::

source: @dataclass class C: ... @dataclass() class C: ... @dataclass(init=True, repr=True, eq=True, order=False, unsafe_hash=False, frozen=False, match_args=True, kw_only=False, slots=False, weakref_slot=False) class C: ...
sv: @dataklass klass C: ... @dataklass() klass C: ..: ... @dataklass(init=True, repr=True, eq=True, order=False, unsafe_hash=False, frozen=False, match_args=True, kw_only=False, slots=False, weakref_slot=False) klass C: ...

source: The parameters to ``@dataclass`` are:
sv: Parametrarna till ``@dataclass`` är:

source: *init*: If true (the default), a :meth:`~object.__init__` method will be generated.
sv: *init*: Om true (standard) kommer en :meth:`~object.__init__`-metod att genereras.

source: If the class already defines :meth:`!__init__`, this parameter is ignored.
sv: Om klassen redan definierar :meth:`!__init__`, ignoreras denna parameter.

source: *repr*: If true (the default), a :meth:`~object.__repr__` method will be generated. The generated repr string will have the class name and the name and repr of each field, in the order they are defined in the class. Fields that are marked as being excluded from the repr are not included. For example: ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.
sv: *repr*: Om true (standard) kommer en :meth:`~object.__repr__`-metod att genereras. Den genererade repr-strängen innehåller klassnamnet samt namn och repr för varje fält, i den ordning de definieras i klassen. Fält som är markerade som uteslutna från repr inkluderas inte. Till exempel: ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.

source: If the class already defines :meth:`!__repr__`, this parameter is ignored.
sv: Om klassen redan definierar :meth:`!__repr__`, ignoreras denna parameter.

source: *eq*: If true (the default), an :meth:`~object.__eq__` method will be generated. This method compares the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type.
sv: *eq*: Om true (standard) kommer en :meth:`~object.__eq__`-metod att genereras. Denna metod jämför klassen som om den vore en tupel av dess fält, i ordning. Båda instanserna i jämförelsen måste vara av samma typ.

source: If the class already defines :meth:`!__eq__`, this parameter is ignored.
sv: Om klassen redan definierar :meth:`!__eq__`, ignoreras denna parameter.

source: *order*: If true (the default is ``False``), :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, and :meth:`~object.__ge__` methods will be generated. These compare the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type. If *order* is true and *eq* is false, a :exc:`ValueError` is raised.
sv: *order*: Om true (standardvärdet är ``False``) kommer metoderna :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__` och :meth:`~object.__ge__` att genereras. Dessa jämför klassen som om den vore en tupel av dess fält, i ordning. Båda instanserna i jämförelsen måste vara av samma typ. Om *order* är sant och *eq* är falskt, genereras ett :exc:`ValueError`.

source: If the class already defines any of :meth:`!__lt__`, :meth:`!__le__`, :meth:`!__gt__`, or :meth:`!__ge__`, then :exc:`TypeError` is raised.
sv: Om klassen redan definierar något av :meth:`!__lt__`, :meth:`!__le__`, :meth:`!__gt__`, eller :meth:`!__ge__`, så kommer :exc:`TypeError` att tas upp.

source: *unsafe_hash*: If true, force ``dataclasses`` to create a :meth:`~object.__hash__` method, even though it may not be safe to do so. Otherwise, generate a :meth:`~object.__hash__` method according to how *eq* and *frozen* are set. The default value is ``False``.
sv: *unsafe_hash*: Om true, tvinga ``dataclasses`` att skapa en :meth:`~object.__hash__`-metod, även om det kanske inte är säkert att göra det. Annars genereras en :meth:`~object.__hash__`-metod enligt hur *eq* och *frozen* är inställda. Standardvärdet är ``False``.

source: :meth:`!__hash__` is used by built-in :meth:`hash`, and when objects are added to hashed collections such as dictionaries and sets. Having a :meth:`!__hash__` implies that instances of the class are immutable. Mutability is a complicated property that depends on the programmer's intent, the existence and behavior of :meth:`!__eq__`, and the values of the *eq* and *frozen* flags in the ``@dataclass`` decorator.
sv: :meth:`!__hash__` används av den inbyggda :meth:`hash`, och när objekt läggs till i hashade samlingar som dictionaries och sets. Att ha en :meth:`!__hash__` innebär att instanser av klassen är oföränderliga. Föränderlighet är en komplicerad egenskap som beror på programmerarens avsikt, förekomsten av och beteendet hos :meth:`!__eq__` samt värdena på flaggorna *eq* och *frozen* i dekoratorn ``@dataclass``.

source: By default, ``@dataclass`` will not implicitly add a :meth:`~object.__hash__` method unless it is safe to do so. Neither will it add or change an existing explicitly defined :meth:`!__hash__` method. Setting the class attribute ``__hash__ = None`` has a specific meaning to Python, as described in the :meth:`!__hash__` documentation.
sv: Som standard kommer ``@dataclass`` inte att implicit lägga till en :meth:`~object.__hash__`-metod om det inte är säkert att göra det. Inte heller kommer den att lägga till eller ändra en befintlig explicit definierad :meth:`!__hash__`-metod. Att ställa in klassattributet ``__hash__ = None`` har en specifik betydelse för Python, som beskrivs i :meth:`!__hash__`-dokumentationen.

source: If :meth:`!__hash__` is not explicitly defined, or if it is set to ``None``, then ``@dataclass`` *may* add an implicit :meth:`!__hash__` method. Although not recommended, you can force ``@dataclass`` to create a :meth:`!__hash__` method with ``unsafe_hash=True``. This might be the case if your class is logically immutable but can still be mutated. This is a specialized use case and should be considered carefully.
sv: Om :meth:`!__hash__` inte är explicit definierad, eller om den är satt till ``None``, så *kan* ``@dataclass`` lägga till en implicit :meth:`!__hash__`-metod. Även om det inte rekommenderas kan du tvinga ``@dataklass`` att skapa en :meth:`!__hash__`` metod med ``unsafe_hash=True``. Detta kan vara fallet om din klass är logiskt oföränderlig men fortfarande kan muteras. Detta är ett specialiserat användningsfall och bör övervägas noggrant.

source: Here are the rules governing implicit creation of a :meth:`!__hash__` method. Note that you cannot both have an explicit :meth:`!__hash__` method in your dataclass and set ``unsafe_hash=True``; this will result in a :exc:`TypeError`.
sv: Här är reglerna för implicit skapande av en :meth:`!__hash__`-metod. Observera att du inte både kan ha en explicit :meth:`!__hash__`-metod i din dataklass och sätta ``unsafe_hash=True``; detta kommer att resultera i ett :exc:`TypeError`.

source: If *eq* and *frozen* are both true, by default ``@dataclass`` will generate a :meth:`!__hash__` method for you. If *eq* is true and *frozen* is false, :meth:`!__hash__` will be set to ``None``, marking it unhashable (which it is, since it is mutable). If *eq* is false, :meth:`!__hash__` will be left untouched meaning the :meth:`!__hash__` method of the superclass will be used (if the superclass is :class:`object`, this means it will fall back to id-based hashing).
sv: Om *eq* och *frozen* båda är true, kommer ``@dataclass`` som standard att generera en :meth:`!__hash__`-metod åt dig. Om *eq* är sant och *frozen* är falskt, kommer :meth:`!__hash__` att sättas till ``None``, vilket markerar att den inte är hashbar (vilket den är, eftersom den är mutabel). Om *eq* är false, kommer :meth:`!__hash__` att lämnas orörd vilket innebär att :meth:`!__hash__` metoden i superklassen kommer att användas (om superklassen är :class:`object`, innebär detta att den kommer att falla tillbaka till id-baserad hashing).

source: *frozen*: If true (the default is ``False``), assigning to fields will generate an exception. This emulates read-only frozen instances. If :meth:`~object.__setattr__` or :meth:`~object.__delattr__` is defined in the class, then :exc:`TypeError` is raised. See the discussion below.
sv: *fryst*: Om true (standard är ``False``), kommer tilldelning till fält att generera ett undantag. Detta emulerar skrivskyddade frysta instanser. Om :meth:`~object.__setattr__` eller :meth:`~object.__delattr__` är definierad i klassen, så genereras :exc:`TypeError`. Se diskussionen nedan.

source: *match_args*: If true (the default is ``True``), the :attr:`~object.__match_args__` tuple will be created from the list of non keyword-only parameters to the generated :meth:`~object.__init__` method (even if :meth:`!__init__` is not generated, see above). If false, or if :attr:`!__match_args__` is already defined in the class, then :attr:`!__match_args__` will not be generated.
sv: *match_args*: Om true (standardvärdet är ``True``) skapas tupeln :attr:`~object.__match_args__` från listan över parametrar som inte innehåller nyckelord till den genererade metoden :meth:`~object.__init__` (även om :meth:`!__init__` inte genereras, se ovan). Om false, eller om :attr:`!__match_args__` redan är definierad i klassen, kommer :attr:`!__match_args__` inte att genereras.

source: *kw_only*: If true (the default value is ``False``), then all fields will be marked as keyword-only. If a field is marked as keyword-only, then the only effect is that the :meth:`~object.__init__` parameter generated from a keyword-only field must be specified with a keyword when :meth:`!__init__` is called. See the :term:`parameter` glossary entry for details. Also see the :const:`KW_ONLY` section.
sv: *kw_only*: Om true anges (standardvärdet är ``False``) kommer alla fält att markeras som keyword-only. Om ett fält markeras som endast nyckelord är den enda effekten att parametern :meth:`~object.__init__` som genereras från ett fält med endast nyckelord måste anges med ett nyckelord när :meth:`!__init__` anropas. Se ordlistan :term:`parameter` för mer information. Se även avsnittet :const:`KW_ONLY`.

source: Keyword-only fields are not included in :attr:`!__match_args__`.
sv: Fält som endast innehåller nyckelord ingår inte i :attr:`!__match_args__`.

source: *slots*: If true (the default is ``False``), :attr:`~object.__slots__` attribute will be generated and new class will be returned instead of the original one. If :attr:`!__slots__` is already defined in the class, then :exc:`TypeError` is raised.
sv: *slots*: Om true (default är ``False``), kommer attributet :attr:`~object.__slots__` att genereras och en ny klass kommer att returneras istället för den ursprungliga. Om :attr:`!__slots__` redan är definierat i klassen, kommer :exc:`TypeError` att returneras.

source: Passing parameters to a base class :meth:`~object.__init_subclass__` when using ``slots=True`` will result in a :exc:`TypeError`. Either use ``__init_subclass__`` with no parameters or use default values as a workaround. See :gh:`91126` for full details.
sv: Att skicka parametrar till en basklass :meth:`~object.__init_subclass__` när man använder ``slots=True`` kommer att resultera i ett :exc:`TypeError`. Använd antingen ``__init_subclass__`` utan parametrar eller använd standardvärden som en lösning. Se :gh:`91126` för fullständig information.

source: If a field name is already included in the :attr:`!__slots__` of a base class, it will not be included in the generated :attr:`!__slots__` to prevent :ref:`overriding them <datamodel-note-slots>`. Therefore, do not use :attr:`!__slots__` to retrieve the field names of a dataclass. Use :func:`fields` instead. To be able to determine inherited slots, base class :attr:`!__slots__` may be any iterable, but *not* an iterator.
sv: Om ett fältnamn redan ingår i :attr:`!__slots__` för en basklass kommer det inte att ingå i den genererade :attr:`!__slots__` för att förhindra att :ref:`överskriver dem <datamodel-note-slots>`. Använd därför inte :attr:`!__slots__` för att hämta fältnamnen i en dataklass. Använd :func:`fields` istället. För att kunna bestämma ärvda slots kan basklassen :attr:`!__slots__` vara vilken iterabel som helst, men *inte* en iterator.

source: *weakref_slot*: If true (the default is ``False``), add a slot named "__weakref__", which is required to make an instance :func:`weakref-able <weakref.ref>`. It is an error to specify ``weakref_slot=True`` without also specifying ``slots=True``.
sv: *weakref_slot*: Om true (standard är ``False``), lägg till en slot med namnet "__weakref__", som krävs för att göra en instans :func:`weakref-able <weakref.ref>`. Det är ett fel att ange ``weakref_slot=True`` utan att också ange ``slots=True``.

source: ``field``\s may optionally specify a default value, using normal Python syntax::
sv: ``field`` kan valfritt ange ett standardvärde, med normal Python-syntax::

source: @dataclass class C: a: int # 'a' has no default value b: int = 0 # assign a default value for 'b'
sv: @dataklass klass C: a: int # 'a' har inget förinställt värde b: int = 0 # tilldela ett förinställt värde för 'b'

source: In this example, both :attr:`!a` and :attr:`!b` will be included in the added :meth:`~object.__init__` method, which will be defined as::
sv: I detta exempel kommer både :attr:`!a` och :attr:`!b` att inkluderas i den tillagda :meth:`~object.__init__`-metoden, som kommer att definieras som::

source: :exc:`TypeError` will be raised if a field without a default value follows a field with a default value. This is true whether this occurs in a single class, or as a result of class inheritance.
sv: :exc:`TypeError` kommer att uppstå om ett fält utan ett standardvärde följer ett fält med ett standardvärde. Detta gäller oavsett om det sker i en enda klass eller som ett resultat av klassarv.

source: For common and simple use cases, no other functionality is required. There are, however, some dataclass features that require additional per-field information. To satisfy this need for additional information, you can replace the default field value with a call to the provided :func:`!field` function. For example::
sv: För vanliga och enkla användningsfall krävs ingen annan funktionalitet. Det finns dock vissa dataklassfunktioner som kräver ytterligare information per fält. För att tillgodose detta behov av ytterligare information kan du ersätta standardvärdet för fältet med ett anrop till den medföljande funktionen :func:`!field`. Till exempel::

source: @dataclass class C: mylist: list[int] = field(default_factory=list) c = C() c.mylist += [1, 2, 3]
sv: @dataklass klass C: mylist: list[int] = field(default_factory=list) c = C() c.mylist += [1, 2, 3]

source: As shown above, the :const:`MISSING` value is a sentinel object used to detect if some parameters are provided by the user. This sentinel is used because ``None`` is a valid value for some parameters with a distinct meaning. No code should directly use the :const:`MISSING` value.
sv: Som visas ovan är :const:`MISSING`-värdet ett sentinel-objekt som används för att upptäcka om vissa parametrar tillhandahålls av användaren. Denna sentinel används eftersom ``None`` är ett giltigt värde för vissa parametrar med en distinkt betydelse. Ingen kod bör direkt använda :const:`MISSING`-värdet.

source: The parameters to :func:`!field` are:
sv: Parametrarna till :func:`!field` är:

source: *default*: If provided, this will be the default value for this field. This is needed because the :func:`!field` call itself replaces the normal position of the default value.
sv: *default*: Om det anges kommer detta att vara standardvärdet för fältet. Detta behövs eftersom :func:`!field`-anropet i sig ersätter den normala positionen för standardvärdet.

source: *default_factory*: If provided, it must be a zero-argument callable that will be called when a default value is needed for this field. Among other purposes, this can be used to specify fields with mutable default values, as discussed below. It is an error to specify both *default* and *default_factory*.
sv: *default_factory*: Om det anges måste det vara en nollargumentskallelse som anropas när ett standardvärde behövs för detta fält. Detta kan bland annat användas för att ange fält med föränderliga standardvärden, vilket diskuteras nedan. Det är ett fel att ange både *default* och *default_factory*.

source: *init*: If true (the default), this field is included as a parameter to the generated :meth:`~object.__init__` method.
sv: *init*: Om true (standard) inkluderas detta fält som en parameter i den genererade :meth:`~object.__init__`-metoden.

source: *repr*: If true (the default), this field is included in the string returned by the generated :meth:`~object.__repr__` method.
sv: *repr*: Om true (standard) inkluderas detta fält i den sträng som returneras av den genererade metoden :meth:`~object.__repr__`.

source: *hash*: This can be a bool or ``None``. If true, this field is included in the generated :meth:`~object.__hash__` method. If false, this field is excluded from the generated :meth:`~object.__hash__`. If ``None`` (the default), use the value of *compare*: this would normally be the expected behavior, since a field should be included in the hash if it's used for comparisons. Setting this value to anything other than ``None`` is discouraged.
sv: *hash*: Detta kan vara en bool eller ``None``. Om true, inkluderas detta fält i den genererade metoden :meth:`~object.__hash__`. Om false, exkluderas detta fält från den genererade :meth:`~object.__hash__`. Om ``None`` (standard), använd värdet för *compare*: detta skulle normalt vara det förväntade beteendet, eftersom ett fält bör ingå i hashen om det används för jämförelser. Att ställa in detta värde till något annat än ``None`` avråds.

source: One possible reason to set ``hash=False`` but ``compare=True`` would be if a field is expensive to compute a hash value for, that field is needed for equality testing, and there are other fields that contribute to the type's hash value. Even if a field is excluded from the hash, it will still be used for comparisons.
sv: En möjlig anledning till att ställa in ``hash=False`` men ``compare=True`` skulle vara om ett fält är dyrt att beräkna ett hashvärde för, det fältet behövs för likhetstestning och det finns andra fält som bidrar till typens hashvärde. Även om ett fält utesluts från hashvärdet kommer det ändå att användas för jämförelser.

source: *compare*: If true (the default), this field is included in the generated equality and comparison methods (:meth:`~object.__eq__`, :meth:`~object.__gt__`, et al.).
sv: *compare*: Om true (standard) inkluderas detta fält i de genererade metoderna för likhet och jämförelse (:meth:`~object.__eq__`, :meth:`~object.__gt__`, etc.).
