Repository: yeager/python-docs-sv
Catalog: library/dataclasses.po
Languages: sv

source: There is a tiny performance penalty when using ``frozen=True``: :meth:`~object.__init__` cannot use simple assignment to initialize fields, and must use :meth:`!object.__setattr__`.
sv: Det finns en liten prestandaförlust när man använder ``frozen=True``: :meth:`~object.__init__` kan inte använda enkel tilldelning för att initiera fält, utan måste använda :meth:`!object.__setattr__`.

source: Inheritance
sv: Ärftlighet

source: When the dataclass is being created by the :func:`@dataclass <dataclass>` decorator, it looks through all of the class's base classes in reverse MRO (that is, starting at :class:`object`) and, for each dataclass that it finds, adds the fields from that base class to an ordered mapping of fields. After all of the base class fields are added, it adds its own fields to the ordered mapping. All of the generated methods will use this combined, calculated ordered mapping of fields. Because the fields are in insertion order, derived classes override base classes. An example::
sv: När dataklassen skapas av dekoratorn :func:`@dataclass <dataclass>` går den igenom alla klassens basklasser i omvänd MRO (dvs. börjar med :class:`object`) och för varje dataklass som den hittar lägger den till fälten från basklassen i en ordnad mappning av fält. När alla basklassens fält har lagts till, lägger den till sina egna fält i den ordnade mappningen. Alla genererade metoder kommer att använda denna kombinerade, beräknade ordnade mappning av fält. Eftersom fälten är i inmatningsordning åsidosätter härledda klasser basklasser. Ett exempel::

source: @dataclass class Base: x: Any = 15.0 y: int = 0 @dataclass class C(Base): z: int = 10 x: int = 15
sv: @dataklass klass Bas: x: Valfritt = 15.0 y: int = 0 @dataklass klass C(Bas): z: int = 10 x: int = 15

source: The final list of fields is, in order, :attr:`!x`, :attr:`!y`, :attr:`!z`. The final type of :attr:`!x` is :class:`int`, as specified in class :class:`!C`.
sv: Den slutliga listan av fält är, i ordning, :attr:`!x`, :attr:`!y`, :attr:`!z`. Den slutliga typen av :attr:`!x` är :class:`int`, som specificeras i klassen :class:`!C`.

source: The generated :meth:`~object.__init__` method for :class:`!C` will look like::
sv: Den genererade :meth:`~object.__init__`-metoden för :class:`!C` kommer att se ut så här::

source: Re-ordering of keyword-only parameters in :meth:`!__init__`
sv: Omordning av parametrar som endast innehåller nyckelord i :meth:`!__init__`

source: After the parameters needed for :meth:`~object.__init__` are computed, any keyword-only parameters are moved to come after all regular (non-keyword-only) parameters. This is a requirement of how keyword-only parameters are implemented in Python: they must come after non-keyword-only parameters.
sv: Efter att de parametrar som behövs för :meth:`~object.__init__` har beräknats, flyttas alla parametrar med endast nyckelord till att komma efter alla vanliga (icke-nyckelordsbara) parametrar. Detta är ett krav på hur parametrar med endast nyckelord implementeras i Python: de måste komma efter parametrar utan endast nyckelord.

source: In this example, :attr:`!Base.y`, :attr:`!Base.w`, and :attr:`!D.t` are keyword-only fields, and :attr:`!Base.x` and :attr:`!D.z` are regular fields::
sv: I det här exemplet är :attr:`!Base.y`, :attr:`!Base.w` och :attr:`!D.t` fält med endast nyckelord, och :attr:`!Base.x` och :attr:`!D.z` är vanliga fält:

source: @dataclass class Base: x: Any = 15.0 _: KW_ONLY y: int = 0 w: int = 1 @dataclass class D(Base): z: int = 10 t: int = field(kw_only=True, default=0)
sv: @dataklass klass Bas: x: Valfritt = 15.0 _: KW_ONLY y: int = 0 w: int = 1 @dataklass klass D(Bas): z: int = 10 t: int = fält(kw_only=True, default=0)

source: The generated :meth:`!__init__` method for :class:`!D` will look like::
sv: Den genererade :meth:`!__init__`-metoden för :class:`!D` kommer att se ut så här::

source: Note that the parameters have been re-ordered from how they appear in the list of fields: parameters derived from regular fields are followed by parameters derived from keyword-only fields.
sv: Observera att parametrarna har ordnats om från hur de visas i listan över fält: parametrar som härrör från vanliga fält följs av parametrar som härrör från fält som endast innehåller nyckelord.

source: The relative ordering of keyword-only parameters is maintained in the re-ordered :meth:`!__init__` parameter list.
sv: Den relativa ordningsföljden för parametrar som endast innehåller nyckelord bibehålls i den omordnade parameterlistan :meth:`!__init__`.

source: Default factory functions
sv: Fabriksinställda funktioner

source: If a :func:`field` specifies a *default_factory*, it is called with zero arguments when a default value for the field is needed. For example, to create a new instance of a list, use::
sv: Om en :func:`field` specificerar en *default_factory*, anropas den med noll argument när ett standardvärde för fältet behövs. Om du t.ex. vill skapa en ny instans av en lista använder du::

source: mylist: list = field(default_factory=list)
sv: mylist: lista = fält(default_factory=lista)

source: If a field is excluded from :meth:`~object.__init__` (using ``init=False``) and the field also specifies *default_factory*, then the default factory function will always be called from the generated :meth:`!__init__` function. This happens because there is no other way to give the field an initial value.
sv: Om ett fält utesluts från :meth:`~object.__init__` (med ``init=False``) och fältet också anger *default_factory*, kommer default factory-funktionen alltid att anropas från den genererade :meth:`!__init__`-funktionen. Detta sker eftersom det inte finns något annat sätt att ge fältet ett initialt värde.

source: Mutable default values
sv: Föränderliga standardvärden

source: Python stores default member variable values in class attributes. Consider this example, not using dataclasses::
sv: Python lagrar standardvärden för medlemsvariabler i klassattribut. Tänk på detta exempel, utan att använda dataklasser::

source: class C: x = [] def add(self, element): self.x.append(element) o1 = C() o2 = C() o1.add(1) o2.add(2) assert o1.x == [1, 2] assert o1.x is o2.x
sv: klass C: x = [] def add(self, element): self.x.append(element) o1 = C() o2 = C() o1.add(1) o2.add(2) assert o1.x == [1, 2] assert o1.x är o2.x

source: Note that the two instances of class :class:`!C` share the same class variable :attr:`!x`, as expected.
sv: Observera att de två instanserna av klassen :class:`!C` delar samma klassvariabel :attr:`!x`, som förväntat.

source: Using dataclasses, *if* this code was valid::
sv: Med hjälp av dataklasser, *om* denna kod var giltig::

source: @dataclass class D: x: list = [] # This code raises ValueError def add(self, element): self.x.append(element)
sv: @dataklass klass D: x: list = [] # Denna kod ger upphov till ValueError def add(self, element): self.x.append(element)

source: it would generate code similar to::
sv: skulle det generera kod som liknar::

source: class D: x = [] def __init__(self, x=x): self.x = x def add(self, element): self.x.append(element) assert D().x is D().x
sv: klass D: x = [] def __init__(self, x=x): self.x = x def add(self, element): self.x.append(element) assert D().x är D().x

source: This has the same issue as the original example using class :class:`!C`. That is, two instances of class :class:`!D` that do not specify a value for :attr:`!x` when creating a class instance will share the same copy of :attr:`!x`. Because dataclasses just use normal Python class creation they also share this behavior. There is no general way for Data Classes to detect this condition. Instead, the :func:`@dataclass <dataclass>` decorator will raise a :exc:`ValueError` if it detects an unhashable default parameter. The assumption is that if a value is unhashable, it is mutable. This is a partial solution, but it does protect against many common errors.
sv: Detta har samma problem som det ursprungliga exemplet med klassen :class:`!C`. Det vill säga, två instanser av klassen :class:`!D` som inte anger ett värde för :attr:`!x` när de skapar en klassinstans kommer att dela samma kopia av :attr:`!x`. Eftersom dataklasser bara använder normal Python-klassskapande delar de också detta beteende. Det finns inget allmänt sätt för dataklasser att upptäcka detta tillstånd. Istället kommer dekoratorn :func:`@dataklass <dataclass>` att ge upphov till ett :exc:`ValueError` om den upptäcker en standardparameter som inte går att hasha. Antagandet är att om ett värde är ohashable, så är det mutable. Detta är en partiell lösning, men den skyddar mot många vanliga fel.

source: Using default factory functions is a way to create new instances of mutable types as default values for fields::
sv: Att använda standardfabriksfunktioner är ett sätt att skapa nya instanser av föränderliga typer som standardvärden för fält::

source: @dataclass class D: x: list = field(default_factory=list) assert D().x is not D().x
sv: @dataklass klass D: x: list = fält(default_factory=list) assert D().x är inte D().x

source: Instead of looking for and disallowing objects of type :class:`list`, :class:`dict`, or :class:`set`, unhashable objects are now not allowed as default values. Unhashability is used to approximate mutability.
sv: Istället för att leta efter och förbjuda objekt av typen :class:`list`, :class:`dict` eller :class:`set`, tillåts nu inte ohashbara objekt som standardvärden. Unhashability används för att approximera mutability.

source: Descriptor-typed fields
sv: Deskriptortypade fält

source: Fields that are assigned :ref:`descriptor objects <descriptors>` as their default value have the following special behaviors:
sv: Fält som tilldelas :ref:``descriptor objects <descriptors>`` som standardvärde har följande speciella beteenden:

source: The value for the field passed to the dataclass's :meth:`~object.__init__` method is passed to the descriptor's :meth:`~object.__set__` method rather than overwriting the descriptor object.
sv: Värdet för det fält som skickas till dataklassens metod :meth:`~object.__init__` skickas till deskriptorns metod :meth:`~object.__set__` i stället för att skriva över deskriptorobjektet.

source: Similarly, when getting or setting the field, the descriptor's :meth:`~object.__get__` or :meth:`!__set__` method is called rather than returning or overwriting the descriptor object.
sv: På samma sätt anropas deskriptorns :meth:`~object.__get__`- eller :meth:`!__set__`-metod när fältet hämtas eller ställs in, i stället för att returnera eller skriva över deskriptorobjektet.

source: To determine whether a field contains a default value, :func:`@dataclass <dataclass>` will call the descriptor's :meth:`!__get__` method using its class access form: ``descriptor.__get__(obj=None, type=cls)``. If the descriptor returns a value in this case, it will be used as the field's default. On the other hand, if the descriptor raises :exc:`AttributeError` in this situation, no default value will be provided for the field.
sv: För att avgöra om ett fält innehåller ett standardvärde anropar :func:`@dataclass <dataclass>` deskriptorns :meth:`!__get__`-metod med hjälp av dess klassåtkomstform: ``descriptor.__get__(obj=None, type=cls)``. Om deskriptorn returnerar ett värde i det här fallet kommer det att användas som fältets standardvärde. Å andra sidan, om deskriptorn ger upphov till :exc:`AttributeError` i denna situation, kommer inget standardvärde att tillhandahållas för fältet.

source: class IntConversionDescriptor: def __init__(self, *, default): self._default = default def __set_name__(self, owner, name): self._name = "_" + name def __get__(self, obj, type): if obj is None: return self._default return getattr(obj, self._name, self._default) def __set__(self, obj, value): setattr(obj, self._name, int(value)) @dataclass class InventoryItem: quantity_on_hand: IntConversionDescriptor = IntConversionDescriptor(default=100) i = InventoryItem() print(i.quantity_on_hand) # 100 i.quantity_on_hand = 2.5 # calls __set__ with 2.5 print(i.quantity_on_hand) # 2
sv: klass IntConversionDescriptor: def __init__(self, *, default): self._default = default def __set_name__(self, ägare, namn): self._name = "_" + namn def __get__(self, obj, type): om obj är None: return self._default return getattr(obj, self._name, self._default) def __set__(self, obj, värde): setattr(obj, self._name, int(värde)) @dataklass klass InventoryItem: quantity_on_hand: IntConversionDescriptor = IntConversionDescriptor(default=100) i = InventoryItem() print(i.kvantitet_på_hand) # 100 i.quantity_on_hand = 2.5 # anropar __set__ med 2.5 print(i.quantity_on_hand) # 2

source: Note that if a field is annotated with a descriptor type, but is not assigned a descriptor object as its default value, the field will act like a normal field.
sv: Observera att om ett fält är annoterat med en deskriptortyp, men inte har tilldelats ett deskriptorobjekt som standardvärde, kommer fältet att fungera som ett vanligt fält.
