Repository: yeager/python-docs-sv
Catalog: library/dataclasses.po
Languages: sv

source: *metadata*: This can be a mapping or ``None``. ``None`` is treated as an empty dict. This value is wrapped in :func:`~types.MappingProxyType` to make it read-only, and exposed on the :class:`Field` object. It is not used at all by Data Classes, and is provided as a third-party extension mechanism. Multiple third-parties can each have their own key, to use as a namespace in the metadata.
sv: *metadata*: Detta kan vara en mappning eller ``None``. ``None`` behandlas som en tom dict. Detta värde är inkapslat i :func:`~types.MappingProxyType` för att göra det skrivskyddat och exponeras på :class:`Field`-objektet. Det används inte alls av dataklasser, utan tillhandahålls som en tilläggsmekanism från tredje part. Flera tredje parter kan var och en ha sin egen nyckel, för att användas som ett namnområde i metadata.

source: *kw_only*: If true, this field will be marked as keyword-only. This is used when the generated :meth:`~object.__init__` method's parameters are computed.
sv: *kw_only*: Om true, markeras detta fält som keyword-only. Detta används när parametrarna för den genererade :meth:`~object.__init__`-metoden beräknas.

source: Keyword-only fields are also not included in :attr:`!__match_args__`.
sv: Fält som endast innehåller nyckelord ingår inte heller i :attr:`!__match_args__`.

source: *doc*: optional docstring for this field.
sv: *doc*: valfri docstring för detta fält.

source: If the default value of a field is specified by a call to :func:`!field`, then the class attribute for this field will be replaced by the specified *default* value. If *default* is not provided, then the class attribute will be deleted. The intent is that after the :func:`@dataclass <dataclass>` decorator runs, the class attributes will all contain the default values for the fields, just as if the default value itself were specified. For example, after::
sv: Om standardvärdet för ett fält anges genom ett anrop till :func:`!field`, kommer klassattributet för detta fält att ersättas med det angivna *default*-värdet. Om *default* inte anges kommer klassattributet att tas bort. Avsikten är att efter att dekoratorn :func:`@dataclass <dataclass>` har körts, kommer alla klassattribut att innehålla standardvärden för fälten, precis som om standardvärdet självt hade angetts. Till exempel, efter::

source: @dataclass class C: x: int y: int = field(repr=False) z: int = field(repr=False, default=10) t: int = 20
sv: @dataklass klass C: x: int y: int = fält(repr=False) z: int = fält(repr=False, default=10) t: int = 20

source: The class attribute :attr:`!C.z` will be ``10``, the class attribute :attr:`!C.t` will be ``20``, and the class attributes :attr:`!C.x` and :attr:`!C.y` will not be set.
sv: Klassattributet :attr:`!C.z` kommer att vara ``10``, klassattributet :attr:`!C.t` kommer att vara ``20`` och klassattributen :attr:`!C.x` och :attr:`!C.y` kommer inte att anges.

source: :class:`!Field` objects describe each defined field. These objects are created internally, and are returned by the :func:`fields` module-level method (see below). Users should never instantiate a :class:`!Field` object directly. Its documented attributes are:
sv: :class:`!Field`-objekt beskriver varje definierat fält. Dessa objekt skapas internt och returneras av metoden :func:`fields` på modulnivå (se nedan). Användare bör aldrig instansiera ett :class:`!Field`-objekt direkt. Dess dokumenterade attribut är:

source: :attr:`!name`: The name of the field.
sv: :attr:`!name`: Namnet på fältet.

source: :attr:`!type`: The type of the field.
sv: :attr:`!typ`: Typen av fält.

source: :attr:`!default`, :attr:`!default_factory`, :attr:`!init`, :attr:`!repr`, :attr:`!hash`, :attr:`!compare`, :attr:`!metadata`, and :attr:`!kw_only` have the identical meaning and values as they do in the :func:`field` function.
sv: :attr:`!default`, :attr:`!default_factory`, :attr:`!init`, :attr:`!repr`, :attr:`!hash`, :attr:`!compare`, :attr:`!metadata` och :attr:`!kw_only` har samma betydelse och värden som de har i funktionen :func:`field`.

source: Other attributes may exist, but they are private and must not be inspected or relied on.
sv: Andra attribut kan finnas, men de är privata och får inte inspekteras eller åberopas.

source: ``InitVar[T]`` type annotations describe variables that are :ref:`init-only <dataclasses-init-only-variables>`. Fields annotated with :class:`!InitVar` are considered pseudo-fields, and thus are neither returned by the :func:`fields` function nor used in any way except adding them as parameters to :meth:`~object.__init__` and an optional :meth:`__post_init__`.
sv: typannoteringarna ``InitVar[T]`` beskriver variabler som är :ref:``init-only <dataclasses-init-only-variables>``. Fält annoterade med :class:`!InitVar` betraktas som pseudofält och returneras därför varken av funktionen :func:`fields` eller används på något annat sätt än att de läggs till som parametrar i :meth:`~object.__init__` och en valfri :meth:`__post_init__`.

source: Returns a tuple of :class:`Field` objects that define the fields for this dataclass. Accepts either a dataclass, or an instance of a dataclass. Raises :exc:`TypeError` if not passed a dataclass or instance of one. Does not return pseudo-fields which are ``ClassVar`` or ``InitVar``.
sv: Returnerar en tupel av :class:`Field`-objekt som definierar fälten för denna dataklass. Accepterar antingen en dataklass eller en instans av en dataklass. Utlöser :exc:`TypeError` om ingen dataklass eller instans av en dataklass skickas. Returnerar inte pseudofält som är ``ClassVar`` eller ``InitVar``.

source: Converts the dataclass *obj* to a dict (by using the factory function *dict_factory*). Each dataclass is converted to a dict of its fields, as ``name: value`` pairs. dataclasses, dicts, lists, and tuples are recursed into. Other objects are copied with :func:`copy.deepcopy`.
sv: Konverterar dataklassen *obj* till en dict (med hjälp av fabriksfunktionen *dict_factory*). Varje dataklass konverteras till en dict av dess fält, som ``namn: värde``-par. dataklasser, dicts, listor och tupler recursas in i. Andra objekt kopieras med :func:`copy.deepcopy`.

source: Example of using :func:`!asdict` on nested dataclasses::
sv: Exempel på användning av :func:`!asdict` på nästlade dataklasser::

source: @dataclass class Point: x: int y: int @dataclass class C: mylist: list[Point] p = Point(10, 20) assert asdict(p) == {'x': 10, 'y': 20} c = C([Point(0, 0), Point(10, 4)]) assert asdict(c) == {'mylist': [{'x': 0, 'y': 0}, {'x': 10, 'y': 4}]}
sv: @dataklass klass Punkt: x: int y: int @dataklass klass C: mylist: lista[Punkt] p = Punkt(10, 20) assert asdict(p) == {'x': 10, 'y': 20} c = C([Punkt(0, 0), Punkt(10, 4)]) assert asdict(c) == {'mylist': [{'x': 0, 'y': 0}, {'x': 10, 'y': 4}]}

source: To create a shallow copy, the following workaround may be used::
sv: Om du vill skapa en ytlig kopia kan du använda följande lösning::

source: :func:`!asdict` raises :exc:`TypeError` if *obj* is not a dataclass instance.
sv: :func:`!asdict` ger upphov till :exc:`TypeError` om *obj* inte är en dataklassinstans.

source: Converts the dataclass *obj* to a tuple (by using the factory function *tuple_factory*). Each dataclass is converted to a tuple of its field values. dataclasses, dicts, lists, and tuples are recursed into. Other objects are copied with :func:`copy.deepcopy`.
sv: Konverterar dataklassen *obj* till en tupel (med hjälp av fabriksfunktionen *tuple_factory*). Varje dataklass konverteras till en tupel av dess fältvärden. dataklasser, dicts, listor och tuplar recursas till. Andra objekt kopieras med :func:`copy.deepcopy`.

source: Continuing from the previous example::
sv: Fortsättning från föregående exempel::

source: :func:`!astuple` raises :exc:`TypeError` if *obj* is not a dataclass instance.
sv: :func:`!astuple` ger upphov till :exc:`TypeError` om *obj* inte är en dataklassinstans.

source: Creates a new dataclass with name *cls_name*, fields as defined in *fields*, base classes as given in *bases*, and initialized with a namespace as given in *namespace*. *fields* is an iterable whose elements are each either ``name``, ``(name, type)``, or ``(name, type, Field)``. If just ``name`` is supplied, :data:`typing.Any` is used for ``type``. The values of *init*, *repr*, *eq*, *order*, *unsafe_hash*, *frozen*, *match_args*, *kw_only*, *slots*, and *weakref_slot* have the same meaning as they do in :func:`@dataclass <dataclass>`.
sv: Skapar en ny dataklass med namnet *cls_name*, fält som definieras i *fields*, basklasser som anges i *bases* och initialiseras med ett namnområde som anges i *namespace*. *fields* är en iterabel vars element är antingen ``name``, ``(name, type)`` eller ``(name, type, Field)``. Om bara ``name`` anges, används :data:`typing.Any` för ``type``. Värdena för *init*, *repr*, *eq*, *order*, *unsafe_hash*, *frozen*, *match_args*, *kw_only*, *slots* och *weakref_slot* har samma betydelse som de har i :func:`@dataclass <dataclass>`.

source: If *module* is defined, the :attr:`!__module__` attribute of the dataclass is set to that value. By default, it is set to the module name of the caller.
sv: Om *module* är definierat, kommer attributet :attr:`!__module__` i dataklassen att sättas till det värdet. Som standard sätts det till modulnamnet för den som anropar.

source: The *decorator* parameter is a callable that will be used to create the dataclass. It should take the class object as a first argument and the same keyword arguments as :func:`@dataclass <dataclass>`. By default, the :func:`@dataclass <dataclass>` function is used.
sv: Parametern *decorator* är en callable som kommer att användas för att skapa dataklassen. Den bör ta klassobjektet som ett första argument och samma nyckelordsargument som :func:`@dataclass <dataclass>`. Som standard används funktionen :func:`@dataclass <dataclass>`.

source: This function is not strictly required, because any Python mechanism for creating a new class with :attr:`!__annotations__` can then apply the :func:`@dataclass <dataclass>` function to convert that class to a dataclass. This function is provided as a convenience. For example::
sv: Denna funktion är inte absolut nödvändig, eftersom alla Python-mekanismer för att skapa en ny klass med :attr:`!__annotations__` sedan kan använda funktionen :func:`@dataclass <dataclass>` för att konvertera klassen till en dataklass. Denna funktion tillhandahålls som en bekvämlighet. Till exempel::

source: Is equivalent to::
sv: Är likvärdig med::

source: @dataclass class C: x: int y: 'typing.Any' z: int = 5 def add_one(self): return self.x + 1
sv: @dataklass klass C: x: int y: 'typing.Any' z: int = 5 def add_one(self): returnera self.x + 1

source: Added the *decorator* parameter.
sv: Parametern *decorator* har lagts till.

source: Creates a new object of the same type as *obj*, replacing fields with values from *changes*. If *obj* is not a Data Class, raises :exc:`TypeError`. If keys in *changes* are not field names of the given dataclass, raises :exc:`TypeError`.
sv: Skapar ett nytt objekt av samma typ som *obj* och ersätter fälten med värden från *changes*. Om *obj* inte är en dataklass, uppstår :exc:`TypeError`. Om nycklarna i *changes* inte är fältnamn i den angivna dataklassen, uppstår :exc:`TypeError`.

source: The newly returned object is created by calling the :meth:`~object.__init__` method of the dataclass. This ensures that :meth:`__post_init__`, if present, is also called.
sv: Det nyligen returnerade objektet skapas genom anrop av metoden :meth:`~object.__init__` i dataklassen. Detta säkerställer att :meth:`__post_init__`, om sådan finns, också anropas.

source: Init-only variables without default values, if any exist, must be specified on the call to :func:`!replace` so that they can be passed to :meth:`!__init__` and :meth:`__post_init__`.
sv: Init-only variabler utan standardvärden, om sådana finns, måste anges i anropet till :func:`!replace` så att de kan skickas till :meth:`!__init__` och :meth:`__post_init__`.

source: It is an error for *changes* to contain any fields that are defined as having ``init=False``. A :exc:`ValueError` will be raised in this case.
sv: Det är ett fel om *changes* innehåller några fält som definieras som att de har ``init=False``. Ett :exc:`ValueError` kommer att uppstå i detta fall.

source: Be forewarned about how ``init=False`` fields work during a call to :func:`!replace`. They are not copied from the source object, but rather are initialized in :meth:`__post_init__`, if they're initialized at all. It is expected that ``init=False`` fields will be rarely and judiciously used. If they are used, it might be wise to have alternate class constructors, or perhaps a custom :func:`!replace` (or similarly named) method which handles instance copying.
sv: Var försiktig med hur ``init=False``-fält fungerar under ett anrop till :func:`!replace`. De kopieras inte från källobjektet utan initieras i :meth:`__post_init__`, om de initieras överhuvudtaget. Det förväntas att ``init=False``-fält kommer att användas sällan och med omdöme. Om de används kan det vara klokt att ha alternativa klasskonstruktörer, eller kanske en anpassad :func:`!replace`-metod (eller liknande namn) som hanterar kopiering av instanser.

source: Dataclass instances are also supported by generic function :func:`copy.replace`.
sv: Dataklassinstanser stöds också av den generiska funktionen :func:`copy.replace`.

source: Return ``True`` if its parameter is a dataclass (including subclasses of a dataclass) or an instance of one, otherwise return ``False``.
sv: Returnerar ``True`` om dess parameter är en dataklass (inklusive underklasser av en dataklass) eller en instans av en sådan, annars returneras ``False``.

source: If you need to know if a class is an instance of a dataclass (and not a dataclass itself), then add a further check for ``not isinstance(obj, type)``::
sv: Om du behöver veta om en klass är en instans av en dataklass (och inte en dataklass i sig), lägg då till ytterligare en kontroll för ``not isinstance(obj, type)``::

source: def is_dataclass_instance(obj): return is_dataclass(obj) and not isinstance(obj, type)
sv: def is_dataclass_instance(obj): return is_dataclass(obj) och inte isinstance(obj, type)

source: A sentinel value signifying a missing default or default_factory.
sv: Ett sentinelvärde som visar att default eller default_factory saknas.

source: A sentinel value used as a type annotation. Any fields after a pseudo-field with the type of :const:`!KW_ONLY` are marked as keyword-only fields. Note that a pseudo-field of type :const:`!KW_ONLY` is otherwise completely ignored. This includes the name of such a field. By convention, a name of ``_`` is used for a :const:`!KW_ONLY` field. Keyword-only fields signify :meth:`~object.__init__` parameters that must be specified as keywords when the class is instantiated.
sv: Ett sentinelvärde som används som en typannotering. Alla fält efter ett pseudofält av typen :const:`!KW_ONLY` markeras som fält som endast innehåller nyckelord. Observera att ett pseudofält av typen :const:`!KW_ONLY` annars ignoreras helt. Detta gäller även namnet på ett sådant fält. Av konvention används namnet ``_`` för ett fält av typen :const:`!KW_ONLY`. Fält som endast innehåller nyckelord betecknar :meth:`~object.__init__`-parametrar som måste anges som nyckelord när klassen instansieras.

source: In this example, the fields ``y`` and ``z`` will be marked as keyword-only fields::
sv: I det här exemplet markeras fälten ``y`` och ``z`` som fält med endast nyckelord::

source: @dataclass class Point: x: float _: KW_ONLY y: float z: float p = Point(0, y=1.5, z=2.0)
sv: @dataklass klass Punkt: x: float _: KW_ONLY y: float z: float p = Punkt(0, y=1,5, z=2,0)

source: In a single dataclass, it is an error to specify more than one field whose type is :const:`!KW_ONLY`.
sv: I en enskild dataklass är det ett fel att ange mer än ett fält vars typ är :const:`!KW_ONLY`.

source: Raised when an implicitly defined :meth:`~object.__setattr__` or :meth:`~object.__delattr__` is called on a dataclass which was defined with ``frozen=True``. It is a subclass of :exc:`AttributeError`.
sv: Uppstår när en implicit definierad :meth:`~object.__setattr__` eller :meth:`~object.__delattr__` anropas på en dataklass som definierades med ``frozen=True``. Det är en underklass till :exc:`AttributeError`.

source: Post-init processing
sv: Behandling efter initiering

source: When defined on the class, it will be called by the generated :meth:`~object.__init__`, normally as :meth:`!self.__post_init__`. However, if any ``InitVar`` fields are defined, they will also be passed to :meth:`!__post_init__` in the order they were defined in the class. If no :meth:`!__init__` method is generated, then :meth:`!__post_init__` will not automatically be called.
sv: När den definieras i klassen kommer den att anropas av den genererade :meth:`~object.__init__`, normalt som :meth:`!self.__post_init__`. Men om några ``InitVar``-fält är definierade, kommer de också att skickas till :meth:`!__post_init__` i den ordning de definierades i klassen. Om ingen :meth:`!__init__`-metod genereras kommer :meth:`!__post_init__` inte att anropas automatiskt.

source: Among other uses, this allows for initializing field values that depend on one or more other fields. For example::
sv: Detta gör det bland annat möjligt att initiera fältvärden som är beroende av ett eller flera andra fält. Till exempel::

source: @dataclass class C: a: float b: float c: float = field(init=False) def __post_init__(self): self.c = self.a + self.b
sv: @dataklass klass C: a: float b: float c: float = fält(init=False) def __post_init__(self): self.c = self.a + self.b

source: The :meth:`~object.__init__` method generated by :func:`@dataclass <dataclass>` does not call base class :meth:`!__init__` methods. If the base class has an :meth:`!__init__` method that has to be called, it is common to call this method in a :meth:`__post_init__` method::
sv: Metoden :meth:`~object.__init__` som genereras av :func:`@dataclass <dataclass>` anropar inte basklassens :meth:`!__init__`-metoder. Om basklassen har en :meth:`!__init__`-metod som måste anropas är det vanligt att anropa denna metod i en :meth:`__post_init__`-metod::

source: class Rectangle: def __init__(self, height, width): self.height = height self.width = width @dataclass class Square(Rectangle): side: float def __post_init__(self): super().__init__(self.side, self.side)
sv: klass Rektangel: def __init__(self, höjd, bredd): self.height = höjd self.width = bredd @dataklass klass Kvadrat(Rektangel): sida: float def __post_init__(self): super().__init__(self.side, self.side)

source: Note, however, that in general the dataclass-generated :meth:`!__init__` methods don't need to be called, since the derived dataclass will take care of initializing all fields of any base class that is a dataclass itself.
sv: Observera dock att de dataklassgenererade :meth:`!__init__'-metoderna i allmänhet inte behöver anropas, eftersom den härledda dataklassen tar hand om initieringen av alla fält i alla basklasser som själva är en dataklass.

source: See the section below on init-only variables for ways to pass parameters to :meth:`!__post_init__`. Also see the warning about how :func:`replace` handles ``init=False`` fields.
sv: Se avsnittet nedan om init-only variabler för sätt att skicka parametrar till :meth:`!__post_init__`. Se även varningen om hur :func:`replace` hanterar ``init=False`` fält.

source: Class variables
sv: Klassvariabler

source: One of the few places where :func:`@dataclass <dataclass>` actually inspects the type of a field is to determine if a field is a class variable as defined in :pep:`526`. It does this by checking if the type of the field is :data:`typing.ClassVar`. If a field is a ``ClassVar``, it is excluded from consideration as a field and is ignored by the dataclass mechanisms. Such ``ClassVar`` pseudo-fields are not returned by the module-level :func:`fields` function.
sv: Ett av de få ställen där :func:`@dataclass <dataclass>` faktiskt kontrollerar typen av ett fält är för att avgöra om ett fält är en klassvariabel enligt definitionen i :pep:`526`. Detta görs genom att kontrollera om fältets typ är :data:`typing.ClassVar`. Om ett fält är en ``ClassVar`` är det uteslutet från att betraktas som ett fält och ignoreras av dataklassmekanismerna. Sådana pseudofält av typen ``ClassVar`` returneras inte av funktionen :func:`fields` på modulnivå.

source: Init-only variables
sv: Init-only-variabler

source: Another place where :func:`@dataclass <dataclass>` inspects a type annotation is to determine if a field is an init-only variable. It does this by seeing if the type of a field is of type :class:`InitVar`. If a field is an :class:`InitVar`, it is considered a pseudo-field called an init-only field. As it is not a true field, it is not returned by the module-level :func:`fields` function. Init-only fields are added as parameters to the generated :meth:`~object.__init__` method, and are passed to the optional :meth:`__post_init__` method. They are not otherwise used by dataclasses.
sv: Ett annat ställe där :func:`@dataclass <dataclass>` inspekterar en typannotering är för att avgöra om ett fält är en init-only-variabel. Detta görs genom att se om fältets typ är av typen :class:`InitVar`. Om ett fält är av typen :class:`InitVar`, betraktas det som ett pseudofält som kallas ett init-only-fält. Eftersom det inte är ett riktigt fält returneras det inte av funktionen :func:`fields` på modulnivå. Init-only-fält läggs till som parametrar i den genererade metoden :meth:`~object.__init__` och skickas till den valfria metoden :meth:`__post_init__`. De används inte på annat sätt av dataklasser.

source: For example, suppose a field will be initialized from a database, if a value is not provided when creating the class::
sv: Anta t.ex. att ett fält initieras från en databas om inget värde anges när klassen skapas::

source: @dataclass class C: i: int j: int | None = None database: InitVar[DatabaseType | None] = None def __post_init__(self, database): if self.j is None and database is not None: self.j = database.lookup('j') c = C(10, database=my_database)
sv: @dataklass klass C: i: int j: int | Ingen = Ingen databas: InitVar[DatabaseType | None] = None def __post_init__(self, databas): om self.j är None och databasen inte är None: self.j = databas.lookup('j') c = C(10, databas=min_databas)

source: In this case, :func:`fields` will return :class:`Field` objects for :attr:`!i` and :attr:`!j`, but not for :attr:`!database`.
sv: I det här fallet kommer :func:`fields` att returnera :class:`Field`-objekt för :attr:`!i` och :attr:`!j`, men inte för :attr:`!database`.

source: Frozen instances
sv: Frysta instanser

source: It is not possible to create truly immutable Python objects. However, by passing ``frozen=True`` to the :func:`@dataclass <dataclass>` decorator you can emulate immutability. In that case, dataclasses will add :meth:`~object.__setattr__` and :meth:`~object.__delattr__` methods to the class. These methods will raise a :exc:`FrozenInstanceError` when invoked.
sv: Det är inte möjligt att skapa verkligt oföränderliga Python-objekt. Men genom att skicka ``frozen=True`` till :func:`@dataclass <dataclass>` dekoratorn kan du emulera oföränderlighet. I så fall kommer dataclasses att lägga till :meth:`~object.__setattr__` och :meth:`~object.__delattr__` metoder till klassen. Dessa metoder kommer att ge upphov till ett :exc:`FrozenInstanceError` när de anropas.
