Repository: yeager/python-docs-sv
Catalog: library/decimal.po
Languages: sv

source: ``"+Infinity"``, indicating that the operand is positive infinity.
sv: ``"+Infinity"``, vilket indikerar att operanden är positiv oändlighet.

source: ``"NaN"``, indicating that the operand is a quiet NaN (Not a Number).
sv: ``"NaN"``, vilket indikerar att operanden är ett tyst NaN (Not a Number).

source: ``"sNaN"``, indicating that the operand is a signaling NaN.
sv: ``"sNaN"``, vilket indikerar att operanden är en NaN-signal.

source: Return a value equal to the first operand after rounding and having the exponent of the second operand.
sv: Returnerar ett värde som är lika med den första operanden efter avrundning och med den andra operandens exponent.

source: Unlike other operations, if the length of the coefficient after the quantize operation would be greater than precision, then an :const:`InvalidOperation` is signaled. This guarantees that, unless there is an error condition, the quantized exponent is always equal to that of the right-hand operand.
sv: Till skillnad från andra operationer, om koefficientens längd efter kvantiseringsoperationen skulle vara större än precisionen, så signaleras en :const:`InvalidOperation`. Detta garanterar att den kvantiserade exponenten alltid är lika med den högra operandens exponent, såvida inte ett feltillstånd föreligger.

source: Also unlike other operations, quantize never signals Underflow, even if the result is subnormal and inexact.
sv: Till skillnad från andra operationer signalerar quantize aldrig underflöde, även om resultatet är onormalt och inexakt.

source: If the exponent of the second operand is larger than that of the first then rounding may be necessary. In this case, the rounding mode is determined by the ``rounding`` argument if given, else by the given ``context`` argument; if neither argument is given the rounding mode of the current thread's context is used.
sv: Om exponenten i den andra operanden är större än i den första kan avrundning vara nödvändig. I detta fall bestäms avrundningssättet av argumentet ``rounding`` om det ges, annars av det givna argumentet ``context``; om inget av argumenten ges används avrundningssättet för den aktuella trådens kontext.

source: An error is returned whenever the resulting exponent is greater than :attr:`~Context.Emax` or less than :meth:`~Context.Etiny`.
sv: Ett fel returneras när den resulterande exponenten är större än :attr:`~Context.Emax` eller mindre än :meth:`~Context.Etiny`.

source: Return ``Decimal(10)``, the radix (base) in which the :class:`Decimal` class does all its arithmetic. Included for compatibility with the specification.
sv: Returnerar ``Decimal(10)``, den radix (bas) i vilken :class:`Decimal`-klassen gör all sin aritmetik. Inkluderad för kompatibilitet med specifikationen.

source: Return the remainder from dividing *self* by *other*. This differs from ``self % other`` in that the sign of the remainder is chosen so as to minimize its absolute value. More precisely, the return value is ``self - n * other`` where ``n`` is the integer nearest to the exact value of ``self / other``, and if two integers are equally near then the even one is chosen.
sv: Returnerar resten från att dividera *self* med *other*. Detta skiljer sig från ``self % other`` genom att tecknet på återstoden väljs så att dess absoluta värde minimeras. Mer exakt är returvärdet ``self - n * other`` där ``n`` är det heltal som ligger närmast det exakta värdet av ``self / other``, och om två heltal ligger lika nära väljs det jämna.

source: If the result is zero then its sign will be the sign of *self*.
sv: Om resultatet är noll kommer dess tecken att vara tecknet för *själv*.

source: Return the result of rotating the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to rotate. If the second operand is positive then rotation is to the left; otherwise rotation is to the right. The coefficient of the first operand is padded on the left with zeros to length precision if necessary. The sign and exponent of the first operand are unchanged.
sv: Returnerar resultatet av att rotera siffrorna i den första operanden med en mängd som anges av den andra operanden. Det andra operandet måste vara ett heltal i intervallet -precision till precision. Det andra operandets absoluta värde anger antalet platser som ska roteras. Om det andra operandvärdet är positivt sker rotationen åt vänster, annars åt höger. Koefficienten i det första operandet fylls vid behov på vänster sida med nollor för att förlänga precisionen. Tecknet och exponenten för den första operanden är oförändrade.

source: Test whether self and other have the same exponent or whether both are ``NaN``.
sv: Testa om self och other har samma exponent eller om båda är ``NaN``.

source: Return the first operand with exponent adjusted by the second. Equivalently, return the first operand multiplied by ``10**other``. The second operand must be an integer.
sv: Returnerar den första operanden med exponenten justerad med den andra. På motsvarande sätt returneras den första operanden multiplicerad med ``10**annan``. Den andra operanden måste vara ett heltal.

source: Return the result of shifting the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to shift. If the second operand is positive then the shift is to the left; otherwise the shift is to the right. Digits shifted into the coefficient are zeros. The sign and exponent of the first operand are unchanged.
sv: Returnerar resultatet av att flytta siffrorna i den första operanden med ett belopp som anges av den andra operanden. Det andra operandet måste vara ett heltal i intervallet -precision till precision. Det andra operandets absoluta värde anger antalet platser som ska skiftas. Om det andra operandet är positivt sker förskjutningen åt vänster, annars åt höger. Siffror som flyttas in i koefficienten är nollor. Tecknet och exponenten för den första operanden är oförändrade.

source: Return the square root of the argument to full precision.
sv: Returnera kvadratroten av argumentet till full precision.

source: Convert to a string, using engineering notation if an exponent is needed.
sv: Konvertera till en sträng, med hjälp av ingenjörsnotation om en exponent behövs.

source: Engineering notation has an exponent which is a multiple of 3. This can leave up to 3 digits to the left of the decimal place and may require the addition of either one or two trailing zeros.
sv: Teknisk notation har en exponent som är en multipel av 3. Detta kan ge upp till 3 siffror till vänster om decimaltecknet och kan kräva tillägg av antingen en eller två efterföljande nollor.

source: For example, this converts ``Decimal('123E+1')`` to ``Decimal('1.23E+3')``.
sv: Detta konverterar till exempel ``Decimal('123E+1')`` till ``Decimal('1.23E+3')``.

source: Identical to the :meth:`to_integral_value` method. The ``to_integral`` name has been kept for compatibility with older versions.
sv: Identisk med metoden :meth:`to_integral_value`. Namnet ``to_integral`` har behållits för kompatibilitet med äldre versioner.

source: Round to the nearest integer, signaling :const:`Inexact` or :const:`Rounded` as appropriate if rounding occurs. The rounding mode is determined by the ``rounding`` parameter if given, else by the given ``context``. If neither parameter is given then the rounding mode of the current context is used.
sv: Avrunda till närmaste heltal, signalera :const:`Inexact` eller :const:`Rounded` som lämpligt om avrundning sker. Avrundningsläget bestäms av parametern ``rounding`` om den är angiven, annars av den angivna ``contexten``. Om ingen av parametrarna anges används avrundningsläget för den aktuella kontexten.

source: Round to the nearest integer without signaling :const:`Inexact` or :const:`Rounded`. If given, applies *rounding*; otherwise, uses the rounding method in either the supplied *context* or the current context.
sv: Avrunda till närmaste heltal utan att signalera :const:`Inexact` eller :const:`Rounded`. Om den anges, tillämpas *avrundning*; annars används avrundningsmetoden i antingen den medföljande *kontexten* eller den aktuella kontexten.

source: Decimal numbers can be rounded using the :func:`.round` function:
sv: Decimaltal kan avrundas med hjälp av funktionen :func:`.round`:

source: If *ndigits* is not given or ``None``, returns the nearest :class:`int` to *number*, rounding ties to even, and ignoring the rounding mode of the :class:`Decimal` context. Raises :exc:`OverflowError` if *number* is an infinity or :exc:`ValueError` if it is a (quiet or signaling) NaN.
sv: Om *ndigits* inte anges eller ``None``, returneras det närmaste :class:`int` till *number*, med avrundning till jämnt och utan hänsyn till avrundningssättet i :class:`Decimal`-kontexten. Utlöser :exc:`OverflowError` om *number* är en oändlighet eller :exc:`ValueError` om det är ett (tyst eller signalerande) NaN.

source: If *ndigits* is an :class:`int`, the context's rounding mode is respected and a :class:`Decimal` representing *number* rounded to the nearest multiple of ``Decimal('1E-ndigits')`` is returned; in this case, ``round(number, ndigits)`` is equivalent to ``self.quantize(Decimal('1E-ndigits'))``. Returns ``Decimal('NaN')`` if *number* is a quiet NaN. Raises :class:`InvalidOperation` if *number* is an infinity, a signaling NaN, or if the length of the coefficient after the quantize operation would be greater than the current context's precision. In other words, for the non-corner cases:
sv: Om *ndigits* är en :class:`int`, respekteras kontextens avrundningsläge och en :class:`Decimal` som representerar *tal* avrundat till närmaste multipel av ``Decimal('1E-ndigits')`` returneras; i detta fall är ``round(number, ndigits)`` ekvivalent med ``self.quantize(Decimal('1E-ndigits'))``. Returnerar ``Decimal('NaN')`` om *tal* är ett tyst NaN. Utlöser :class:`InvalidOperation` om *tal* är ett oändligt tal, ett signalerande NaN eller om koefficientens längd efter kvantiseringsoperationen skulle vara större än det aktuella sammanhangets precision. Med andra ord, för de fall som inte är hörnfall:

source: if *ndigits* is positive, return *number* rounded to *ndigits* decimal places;
sv: om *ndigits* är positiv, returnera *number* avrundat till *ndigits* decimaler;

source: if *ndigits* is zero, return *number* rounded to the nearest integer;
sv: om *ndigits* är noll, returnera *number* avrundat till närmaste heltal;

source: if *ndigits* is negative, return *number* rounded to the nearest multiple of ``10**abs(ndigits)``.
sv: om *ndigits* är negativt, returnera *number* avrundat till närmaste multipel av ``10**abs(ndigits)``.

source: For example::
sv: Till exempel::

source: >>> from decimal import Decimal, getcontext, ROUND_DOWN >>> getcontext().rounding = ROUND_DOWN >>> round(Decimal('3.75')) # context rounding ignored 4 >>> round(Decimal('3.5')) # round-ties-to-even 4 >>> round(Decimal('3.75'), 0) # uses the context rounding Decimal('3') >>> round(Decimal('3.75'), 1) Decimal('3.7') >>> round(Decimal('3.75'), -1) Decimal('0E+1')
sv: >>> from decimal import Decimal, getcontext, ROUND_DOWN >>> getcontext().avrundning = ROUND_DOWN >>> round(Decimal('3,75')) # kontextavrundning ignoreras 4 >>> runda(Decimal('3,5')) # runda-ties-till-jämn 4 >>> round(Decimal('3.75'), 0) # använder kontextavrundningen Decimal('3') >>> runda(Decimal('3.75'), 1) Decimal('3,7') >>> avrunda(Decimal('3.75'), -1) Decimal('0E+1')

source: Logical operands
sv: Logiska operander

source: The :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or`, and :meth:`~Decimal.logical_xor` methods expect their arguments to be *logical operands*. A *logical operand* is a :class:`Decimal` instance whose exponent and sign are both zero, and whose digits are all either ``0`` or ``1``.
sv: Metoderna :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or` och :meth:`~Decimal.logical_xor` förväntar sig att deras argument är *logiska operander*. En *logisk operand* är en :class:`Decimal`-instans vars exponent och tecken båda är noll, och vars siffror alla är antingen ``0`` eller ``1``.

source: Context objects
sv: Objekt i kontext

source: Contexts are environments for arithmetic operations. They govern precision, set rules for rounding, determine which signals are treated as exceptions, and limit the range for exponents.
sv: Kontexter är miljöer för aritmetiska operationer. De styr precisionen, sätter regler för avrundning, bestämmer vilka signaler som ska behandlas som undantag och begränsar intervallet för exponenter.

source: Each thread has its own current context which is accessed or changed using the :func:`getcontext` and :func:`setcontext` functions:
sv: Varje tråd har sin egen aktuella kontext som kan nås eller ändras med hjälp av funktionerna :func:`getcontext` och :func:`setcontext`:

source: Return the current context for the active thread.
sv: Returnerar det aktuella sammanhanget för den aktiva tråden.

source: Set the current context for the active thread to *c*.
sv: Ställ in det aktuella sammanhanget för den aktiva tråden till *c*.

source: You can also use the :keyword:`with` statement and the :func:`localcontext` function to temporarily change the active context.
sv: Du kan också använda :keyword:`with`-satsen och :func:`localcontext`-funktionen för att tillfälligt ändra den aktiva kontexten.

source: Return a context manager that will set the current context for the active thread to a copy of *ctx* on entry to the with-statement and restore the previous context when exiting the with-statement. If no context is specified, a copy of the current context is used. The *kwargs* argument is used to set the attributes of the new context.
sv: Returnerar en kontexthanterare som sätter den aktuella kontexten för den aktiva tråden till en kopia av *ctx* vid ingången till with-satsen och återställer den tidigare kontexten när with-satsen avslutas. Om ingen kontext anges används en kopia av den aktuella kontexten. Argumentet *kwargs* används för att ställa in attributen för den nya kontexten.

source: For example, the following code sets the current decimal precision to 42 places, performs a calculation, and then automatically restores the previous context::
sv: Följande kod ställer t.ex. in den aktuella decimalprecisionen till 42 enheter, utför en beräkning och återställer sedan automatiskt det tidigare sammanhanget::

source: from decimal import localcontext with localcontext() as ctx: ctx.prec = 42 # Perform a high precision calculation s = calculate_something() s = +s # Round the final result back to the default precision
sv: från decimal import localcontext med localcontext() som ctx: ctx.prec = 42 # Utför en beräkning med hög precision s = beräkna_något() s = +s # Runda tillbaka slutresultatet till standardprecisionen

source: Using keyword arguments, the code would be the following::
sv: Med hjälp av nyckelordsargument skulle koden vara följande::

source: from decimal import localcontext with localcontext(prec=42) as ctx: s = calculate_something() s = +s
sv: från decimal import localcontext med localcontext(prec=42) som ctx: s = beräkna_något() s = +s

source: Raises :exc:`TypeError` if *kwargs* supplies an attribute that :class:`Context` doesn't support. Raises either :exc:`TypeError` or :exc:`ValueError` if *kwargs* supplies an invalid value for an attribute.
sv: Utlöser :exc:`TypeError` om *kwargs* anger ett attribut som :class:`Context` inte stöder. Utlöser antingen :exc:`TypeError` eller :exc:`ValueError` om *kwargs* anger ett ogiltigt värde för ett attribut.

source: :meth:`localcontext` now supports setting context attributes through the use of keyword arguments.
sv: :meth:`localcontext` stöder nu inställning av kontextattribut genom användning av nyckelordsargument.

source: Return a context object initialized to the proper values for one of the IEEE interchange formats. The argument must be a multiple of 32 and less than :const:`IEEE_CONTEXT_MAX_BITS`.
sv: Returnerar ett kontextobjekt som initierats till rätt värden för ett av IEEE:s utbytesformat. Argumentet måste vara en multipel av 32 och mindre än :const:`IEEE_CONTEXT_MAX_BITS`.

source: New contexts can also be created using the :class:`Context` constructor described below. In addition, the module provides three pre-made contexts:
sv: Nya kontexter kan också skapas med hjälp av :class:`Context`-konstruktören som beskrivs nedan. Dessutom tillhandahåller modulen tre färdiga kontexter:

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_UP`. All flags are cleared. All traps are enabled (treated as exceptions) except :const:`Inexact`, :const:`Rounded`, and :const:`Subnormal`.
sv: Detta är en standardkontext som definieras av General Decimal Arithmetic Specification. Precisionen är satt till nio. Avrundning är satt till :const:`ROUND_HALF_UP`. Alla flaggor är rensade. Alla traps är aktiverade (behandlas som undantag) utom :const:`Inexact`, :const:`Rounded` och :const:`Subnormal`.

source: Because many of the traps are enabled, this context is useful for debugging.
sv: Eftersom många av fällorna är aktiverade är detta sammanhang användbart för felsökning.

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_EVEN`. All flags are cleared. No traps are enabled (so that exceptions are not raised during computations).
sv: Detta är en standardkontext som definieras av General Decimal Arithmetic Specification. Precisionen är satt till nio. Avrundning är satt till :const:`ROUND_HALF_EVEN`. Alla flaggor är rensade. Inga fällor är aktiverade (så att undantag inte uppstår under beräkningar).

source: Because the traps are disabled, this context is useful for applications that prefer to have result value of ``NaN`` or ``Infinity`` instead of raising exceptions. This allows an application to complete a run in the presence of conditions that would otherwise halt the program.
sv: Eftersom fällorna är inaktiverade är detta sammanhang användbart för applikationer som föredrar att ha resultatvärdet ``NaN`` eller ``Infinity`` istället för att skapa undantag. Detta gör att en applikation kan slutföra en körning trots förhållanden som annars skulle stoppa programmet.

source: This context is used by the :class:`Context` constructor as a prototype for new contexts. Changing a field (such a precision) has the effect of changing the default for new contexts created by the :class:`Context` constructor.
sv: Denna kontext används av :class:`Context`-konstruktören som en prototyp för nya kontexter. Om man ändrar ett fält (t.ex. precision) ändras standardvärdet för nya kontexter som skapas av konstruktören :class:`Context`.

source: This context is most useful in multi-threaded environments. Changing one of the fields before threads are started has the effect of setting system-wide defaults. Changing the fields after threads have started is not recommended as it would require thread synchronization to prevent race conditions.
sv: Detta sammanhang är mest användbart i flertrådade miljöer. Om du ändrar ett av fälten innan trådarna har startats innebär det att du ställer in systemomfattande standardvärden. Det är inte rekommenderat att ändra fälten efter att trådarna har startat eftersom det kräver trådsynkronisering för att förhindra tävlingsförhållanden.

source: In single threaded environments, it is preferable to not use this context at all. Instead, simply create contexts explicitly as described below.
sv: I enkeltrådade miljöer är det att föredra att inte använda detta sammanhang alls. Skapa istället kontexter explicit enligt beskrivningen nedan.

source: The default values are :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN`, and enabled traps for :class:`Overflow`, :class:`InvalidOperation`, and :class:`DivisionByZero`.
sv: Standardvärdena är :attr:`Context.prec`\ =\``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN`, och aktiverade fällor för :class:`Overflow`, :class:`InvalidOperation`, och :class:`DivisionByZero`.

source: In addition to the three supplied contexts, new contexts can be created with the :class:`Context` constructor.
sv: Förutom de tre medföljande kontexterna kan nya kontexter skapas med :class:`Context`-konstruktören.

source: Creates a new context. If a field is not specified or is :const:`None`, the default values are copied from the :const:`DefaultContext`. If the *flags* field is not specified or is :const:`None`, all flags are cleared.
sv: Skapar en ny kontext. Om ett fält inte anges eller är :const:`None`, kopieras standardvärdena från :const:`DefaultContext`. Om fältet *flags* inte anges eller är :const:`None`, rensas alla flaggor.

source: An integer in the range [``1``, :const:`MAX_PREC`] that sets the precision for arithmetic operations in the context.
sv: Ett heltal i intervallet [``1``, :const:`MAX_PREC``] som anger precisionen för aritmetiska operationer i kontexten.

source: One of the constants listed in the section `Rounding Modes`_.
sv: En av de konstanter som anges i avsnittet `Rounding Modes`_.

source: Lists of any signals to be set. Generally, new contexts should only set traps and leave the flags clear.
sv: Listor över eventuella signaler som ska ställas in. I allmänhet bör nya kontexter endast ställa in fällor och lämna flaggorna fria.

source: Integers specifying the outer limits allowable for exponents. *Emin* must be in the range [:const:`MIN_EMIN`, ``0``], *Emax* in the range [``0``, :const:`MAX_EMAX`].
sv: Heltal som anger de yttre gränser som tillåts för exponenter. *Emin* måste ligga i intervallet [:const:`MIN_EMIN`, ``0``], *Emax* i intervallet [``0``, :const:`MAX_EMAX`].

source: Either ``0`` or ``1`` (the default). If set to ``1``, exponents are printed with a capital ``E``; otherwise, a lowercase ``e`` is used: ``Decimal('6.02e+23')``.
sv: Antingen ``0`` eller ``1`` (standard). Om värdet är satt till ``1`` skrivs exponenter ut med ett stort ``E``; annars används ett litet ``e``: ``Decimal('6.02e+23')``.

source: Either ``0`` (the default) or ``1``. If set to ``1``, the exponent ``e`` of a :class:`Decimal` instance representable in this context is strictly limited to the range ``Emin - prec + 1 <= e <= Emax - prec + 1``. If *clamp* is ``0`` then a weaker condition holds: the adjusted exponent of the :class:`Decimal` instance is at most :attr:`~Context.Emax`. When *clamp* is ``1``, a large normal number will, where possible, have its exponent reduced and a corresponding number of zeros added to its coefficient, in order to fit the exponent constraints; this preserves the value of the number but loses information about significant trailing zeros. For example::
sv: Antingen ``0`` (standard) eller ``1``. Om den är satt till ``1``, är exponenten ``e`` för en :class:`Decimal`-instans som kan representeras i detta sammanhang strikt begränsad till intervallet ``Emin - prec + 1 <= e <= Emax - prec + 1``. Om *clamp* är ``0`` gäller ett svagare villkor: den justerade exponenten för :class:`Decimal`-instansen är högst :attr:`~Context.Emax`. När *clamp* är ``1`` kommer ett stort normalt tal, där så är möjligt, att få sin exponent reducerad och ett motsvarande antal nollor tillagda till sin koefficient, för att passa exponentbegränsningarna; detta bevarar talets värde men förlorar information om signifikanta efterföljande nollor. Till exempel::
