Repository: yeager/python-docs-sv
Catalog: library/decimal.po
Languages: sv

source: A. The :meth:`~Decimal.normalize` method maps all equivalent values to a single representative:
sv: A. Metoden :meth:`~Decimal.normalize` mappar alla likvärdiga värden till en enda representant:

source: Q. When does rounding occur in a computation?
sv: Q. När sker avrundning i en beräkning?

source: A. It occurs *after* the computation. The philosophy of the decimal specification is that numbers are considered exact and are created independent of the current context. They can even have greater precision than current context. Computations process with those exact inputs and then rounding (or other context operations) is applied to the *result* of the computation::
sv: A. Det sker *efter* beräkningen. Filosofin bakom decimalspecifikationen är att tal betraktas som exakta och skapas oberoende av det aktuella sammanhanget. De kan till och med ha större precision än det aktuella sammanhanget. Beräkningar utförs med dessa exakta indata och sedan tillämpas avrundning (eller andra kontextoperationer) på *resultatet* av beräkningen::

source: >>> getcontext().prec = 5 >>> pi = Decimal('3.1415926535') # More than 5 digits >>> pi # All digits are retained Decimal('3.1415926535') >>> pi + 0 # Rounded after an addition Decimal('3.1416') >>> pi - Decimal('0.00005') # Subtract unrounded numbers, then round Decimal('3.1415') >>> pi + 0 - Decimal('0.00005'). # Intermediate values are rounded Decimal('3.1416')
sv: >>> getcontext().prec = 5 >>> pi = Decimal('3.1415926535') # Mer än 5 siffror >>> pi # Alla siffror behålls Decimal('3.1415926535') >>> pi + 0 # Avrundad efter en addition Decimal('3.1416') >>> pi - Decimal('0.00005') # Subtrahera oavrundade tal, avrunda sedan Decimal('3,1415') >>> pi + 0 - Decimal('0.00005'). # Mellanliggande värden avrundas Decimal('3,1416')

source: Q. Some decimal values always print with exponential notation. Is there a way to get a non-exponential representation?
sv: Q. Vissa decimalvärden skrivs alltid ut med exponentiell notation. Finns det något sätt att få en icke-exponentiell representation?

source: A. For some values, exponential notation is the only way to express the number of significant places in the coefficient. For example, expressing ``5.0E+3`` as ``5000`` keeps the value constant but cannot show the original's two-place significance.
sv: A. För vissa värden är exponentiell notation det enda sättet att uttrycka antalet signifikanta ställen i koefficienten. Om man t.ex. uttrycker ``5,0E+3`` som ``5000`` hålls värdet konstant, men man kan inte visa originalets signifikans på två ställen.

source: If an application does not care about tracking significance, it is easy to remove the exponent and trailing zeroes, losing significance, but keeping the value unchanged:
sv: Om en applikation inte bryr sig om att spåra signifikans är det enkelt att ta bort exponenten och de efterföljande nollorna, vilket gör att signifikansen försvinner men värdet förblir oförändrat:

source: Q. Is there a way to convert a regular float to a :class:`Decimal`?
sv: Q. Finns det något sätt att konvertera en vanlig float till en :class:`Decimal`?

source: A. Yes, any binary floating-point number can be exactly expressed as a Decimal though an exact conversion may take more precision than intuition would suggest:
sv: A. Ja, alla binära flyttal kan uttryckas exakt som decimaltal, även om en exakt konvertering kan kräva mer precision än intuitionen skulle föreslå:

source: Q. Within a complex calculation, how can I make sure that I haven't gotten a spurious result because of insufficient precision or rounding anomalies.
sv: Q. Hur kan jag i en komplex beräkning försäkra mig om att jag inte har fått ett felaktigt resultat på grund av otillräcklig precision eller avrundningsavvikelser?

source: A. The decimal module makes it easy to test results. A best practice is to re-run calculations using greater precision and with various rounding modes. Widely differing results indicate insufficient precision, rounding mode issues, ill-conditioned inputs, or a numerically unstable algorithm.
sv: A. Decimalmodulen gör det enkelt att testa resultat. En bra metod är att köra om beräkningarna med större precision och med olika avrundningslägen. Om resultaten skiljer sig mycket åt tyder det på otillräcklig precision, problem med avrundningslägen, dåligt konditionerade indata eller en numeriskt instabil algoritm.

source: Q. I noticed that context precision is applied to the results of operations but not to the inputs. Is there anything to watch out for when mixing values of different precisions?
sv: Q. Jag har märkt att kontextprecision tillämpas på resultatet av operationer men inte på indata. Finns det något att se upp med när man blandar värden med olika precisioner?

source: A. Yes. The principle is that all values are considered to be exact and so is the arithmetic on those values. Only the results are rounded. The advantage for inputs is that "what you type is what you get". A disadvantage is that the results can look odd if you forget that the inputs haven't been rounded:
sv: A. Ja, det stämmer. Principen är att alla värden anses vara exakta och det gäller även aritmetiken för dessa värden. Endast resultaten avrundas. Fördelen med inmatningar är att "det du skriver är det du får". En nackdel är att resultaten kan se konstiga ut om man glömmer att indata inte har avrundats:

source: The solution is either to increase precision or to force rounding of inputs using the unary plus operation:
sv: Lösningen är antingen att öka precisionen eller att tvinga fram avrundning av indata med hjälp av den unära plusoperationen:

source: >>> getcontext().prec = 3 >>> +Decimal('1.23456789') # unary plus triggers rounding Decimal('1.23')
sv: >>> getcontext().prec = 3 >>> +Decimal('1.23456789') # unary plus triggar avrundning Decimal('1.23')

source: Alternatively, inputs can be rounded upon creation using the :meth:`Context.create_decimal` method:
sv: Alternativt kan indata avrundas vid skapandet med hjälp av metoden :meth:`Context.create_decimal`:

source: Q. Is the CPython implementation fast for large numbers?
sv: Q. Är CPython-implementeringen snabb för stora tal?

source: A. Yes. In the CPython and PyPy3 implementations, the C/CFFI versions of the decimal module integrate the high speed `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ library for arbitrary precision correctly rounded decimal floating-point arithmetic [#]_. ``libmpdec`` uses `Karatsuba multiplication <https://en.wikipedia.org/wiki/Karatsuba_algorithm>`_ for medium-sized numbers and the `Number Theoretic Transform <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ for very large numbers.
sv: A. Ja, det stämmer. I CPython- och PyPy3-implementeringarna integrerar C/CFFI-versionerna av decimalmodulen höghastighetsbiblioteket `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ för aritmetik med flytande punkter med godtycklig precision och korrekt avrundad decimal [#]_. ``libmpdec`` använder `Karatsuba-multiplikation <https://en.wikipedia.org/wiki/Karatsuba_algorithm>`_ för medelstora tal och `Number Theoretic Transform <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ för mycket stora tal.

source: The context must be adapted for exact arbitrary precision arithmetic. :attr:`~Context.Emin` and :attr:`~Context.Emax` should always be set to the maximum values, :attr:`~Context.clamp` should always be 0 (the default). Setting :attr:`~Context.prec` requires some care.
sv: Kontexten måste anpassas för aritmetik med exakt godtycklig precision. :attr:`~Context.Emin` och :attr:`~Context.Emax` bör alltid sättas till maximala värden, :attr:`~Context.clamp` bör alltid vara 0 (standard). Att ställa in :attr:`~Context.prec` kräver viss försiktighet.

source: The easiest approach for trying out bignum arithmetic is to use the maximum value for :attr:`~Context.prec` as well [#]_::
sv: Den enklaste metoden för att prova bignum-aritmetik är att använda det maximala värdet för :attr:`~Context.prec` samt [#]_::

source: For inexact results, :const:`MAX_PREC` is far too large on 64-bit platforms and the available memory will be insufficient::
sv: För inexakta resultat är :const:`MAX_PREC` alldeles för stor på 64-bitars plattformar och det tillgängliga minnet kommer inte att räcka till::

source: >>> Decimal(1) / 3 Traceback (most recent call last): File "<stdin>", line 1, in <module> MemoryError
sv: &gt;&gt;&gt; Decimal(1) / 3 Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> Minnesfel

source: On systems with overallocation (e.g. Linux), a more sophisticated approach is to adjust :attr:`~Context.prec` to the amount of available RAM. Suppose that you have 8GB of RAM and expect 10 simultaneous operands using a maximum of 500MB each::
sv: På system med overallokering (t.ex. Linux) är en mer sofistikerad metod att justera :attr:`~Context.prec` till mängden tillgängligt RAM-minne. Anta att du har 8 GB RAM och förväntar dig 10 samtidiga operander som använder maximalt 500 MB vardera::

source: In general (and especially on systems without overallocation), it is recommended to estimate even tighter bounds and set the :attr:`Inexact` trap if all calculations are expected to be exact.
sv: I allmänhet (och i synnerhet i system utan overallokering) rekommenderas att man uppskattar ännu snävare gränser och ställer in :attr:`Inexact`-fällan om alla beräkningar förväntas vara exakta.

source: This approach now works for all exact results except for non-integer powers.
sv: Detta tillvägagångssätt fungerar nu för alla exakta resultat utom för icke-integrerade potenser.
