Repository: yeager/python-docs-sv
Catalog: library/decimal.po
Languages: sv

source: A *clamp* value of ``1`` allows compatibility with the fixed-width decimal interchange formats specified in IEEE 754.
sv: Ett *clamp*-värde på ``1`` ger kompatibilitet med de decimala utbytesformat med fast bredd som anges i IEEE 754.

source: The :class:`Context` class defines several general purpose methods as well as a large number of methods for doing arithmetic directly in a given context. In addition, for each of the :class:`Decimal` methods described above (with the exception of the :meth:`~Decimal.adjusted` and :meth:`~Decimal.as_tuple` methods) there is a corresponding :class:`Context` method. For example, for a :class:`Context` instance ``C`` and :class:`Decimal` instance ``x``, ``C.exp(x)`` is equivalent to ``x.exp(context=C)``. Each :class:`Context` method accepts a Python integer (an instance of :class:`int`) anywhere that a Decimal instance is accepted.
sv: Klassen :class:`Context` definierar flera metoder för allmänna ändamål samt ett stort antal metoder för att utföra aritmetik direkt i ett givet sammanhang. Dessutom finns det för var och en av de :class:`Decimal`-metoder som beskrivs ovan (med undantag för metoderna :meth:`~Decimal.adjusted` och :meth:`~Decimal.as_tuple`) en motsvarande :class:`Context`-metod. Till exempel, för en :class:`Context`-instans ``C`` och :class:`Decimal`-instans ``x``, är ``C.exp(x)`` ekvivalent med ``x.exp(context=C)``. Varje :class:`Context`-metod accepterar ett Python-heltal (en instans av :class:`int`) överallt där en Decimal-instans accepteras.

source: Resets all of the flags to ``0``.
sv: Återställer alla flaggor till ``0``.

source: Resets all of the traps to ``0``.
sv: Återställer alla fällor till ``0``.

source: Return a duplicate of the context.
sv: Returnerar en kopia av kontexten.

source: Return a copy of the Decimal instance num.
sv: Returnerar en kopia av Decimal-instansen num.

source: Creates a new Decimal instance from *num* but using *self* as context. Unlike the :class:`Decimal` constructor, the context precision, rounding method, flags, and traps are applied to the conversion.
sv: Skapar en ny Decimal-instans från *num* men använder *self* som kontext. Till skillnad från :class:`Decimal`-konstruktören tillämpas kontextens precision, avrundningsmetod, flaggor och fällor på konverteringen.

source: This is useful because constants are often given to a greater precision than is needed by the application. Another benefit is that rounding immediately eliminates unintended effects from digits beyond the current precision. In the following example, using unrounded inputs means that adding zero to a sum can change the result:
sv: Detta är användbart eftersom konstanter ofta ges med större precision än vad som behövs i programmet. En annan fördel är att avrundning omedelbart eliminerar oavsiktliga effekter från siffror som ligger utanför den aktuella precisionen. I följande exempel innebär oavrundade indata att resultatet kan ändras om man lägger till noll i en summa:

source: This method implements the to-number operation of the IBM specification. If the argument is a string, no leading or trailing whitespace or underscores are permitted.
sv: Denna metod implementerar IBM-specifikationens "to-number"-operation. Om argumentet är en sträng tillåts inga inledande eller avslutande blanksteg eller understrykningstecken.

source: Creates a new Decimal instance from a float *f* but rounding using *self* as the context. Unlike the :meth:`Decimal.from_float` class method, the context precision, rounding method, flags, and traps are applied to the conversion.
sv: Skapar en ny Decimal-instans från en float *f* men avrundning med *self* som kontext. Till skillnad från klassmetoden :meth:`Decimal.from_float` tillämpas kontextens precision, avrundningsmetod, flaggor och fällor på konverteringen.

source: >>> context = Context(prec=5, rounding=ROUND_DOWN) >>> context.create_decimal_from_float(math.pi) Decimal('3.1415') >>> context = Context(prec=5, traps=[Inexact]) >>> context.create_decimal_from_float(math.pi) Traceback (most recent call last): ... decimal.Inexact: None
sv: >>> context = Context(prec=5, avrundning=ROUND_DOWN) >>> context.create_decimal_from_float(math.pi) Decimal('3,1415') >>> context = Context(prec=5, fällor=[Inexakt]) >>> context.create_decimal_from_float(math.pi) Traceback (senaste anropet senast): ... decimal.Inexakt: Ingen

source: Returns a value equal to ``Emin - prec + 1`` which is the minimum exponent value for subnormal results. When underflow occurs, the exponent is set to :const:`Etiny`.
sv: Returnerar ett värde lika med ``Emin - prec + 1``, vilket är det lägsta exponentvärdet för subnormala resultat. När underflöde inträffar sätts exponenten till :const:`Etiny`.

source: Returns a value equal to ``Emax - prec + 1``.
sv: Returnerar ett värde som är lika med ``Emax - prec + 1``.

source: The usual approach to working with decimals is to create :class:`Decimal` instances and then apply arithmetic operations which take place within the current context for the active thread. An alternative approach is to use context methods for calculating within a specific context. The methods are similar to those for the :class:`Decimal` class and are only briefly recounted here.
sv: Det vanliga sättet att arbeta med decimaler är att skapa :class:`Decimal`-instanser och sedan tillämpa aritmetiska operationer som äger rum inom den aktuella kontexten för den aktiva tråden. Ett alternativt tillvägagångssätt är att använda kontextmetoder för att beräkna inom en specifik kontext. Metoderna liknar dem för klassen :class:`Decimal` och beskrivs bara kortfattat här.

source: Returns the absolute value of *x*.
sv: Returnerar det absoluta värdet av *x*.

source: Return the sum of *x* and *y*.
sv: Returnera summan av *x* och *y*.

source: Returns the same Decimal object *x*.
sv: Returnerar samma Decimal-objekt *x*.

source: Compares *x* and *y* numerically.
sv: Jämför *x* och *y* numeriskt.

source: Compares the values of the two operands numerically.
sv: Jämför värdena för de två operanderna numeriskt.

source: Compares two operands using their abstract representation.
sv: Jämför två operander med hjälp av deras abstrakta representation.

source: Compares two operands using their abstract representation, ignoring sign.
sv: Jämför två operander med hjälp av deras abstrakta representation, utan att ta hänsyn till tecken.

source: Returns a copy of *x* with the sign set to 0.
sv: Returnerar en kopia av *x* med tecknet satt till 0.

source: Returns a copy of *x* with the sign inverted.
sv: Returnerar en kopia av *x* med inverterat tecken.

source: Copies the sign from *y* to *x*.
sv: Kopierar tecknet från *y* till *x*.

source: Return *x* divided by *y*.
sv: Returnera *x* dividerat med *y*.

source: Return *x* divided by *y*, truncated to an integer.
sv: Returnerar *x* dividerat med *y*, trunkerat till ett heltal.

source: Divides two numbers and returns the integer part of the result.
sv: Dividerar två tal och returnerar heltalsdelen av resultatet.

source: Returns ``e ** x``.
sv: Returnerar ``e ** x``.

source: Returns *x* multiplied by *y*, plus *z*.
sv: Returnerar *x* multiplicerat med *y*, plus *z*.

source: Returns ``True`` if *x* is canonical; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är kanonisk; annars returneras ``False``.

source: Returns ``True`` if *x* is finite; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är ändlig; annars returneras ``False``.

source: Returns ``True`` if *x* is infinite; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är oändlig; annars returneras ``False``.

source: Returns ``True`` if *x* is a qNaN or sNaN; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är en qNaN eller sNaN; annars returneras ``False``.

source: Returns ``True`` if *x* is a normal number; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är ett normalt tal; annars returneras ``False``.

source: Returns ``True`` if *x* is a quiet NaN; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är ett tyst NaN; annars returneras ``False``.

source: Returns ``True`` if *x* is negative; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är negativ; annars returneras ``False``.

source: Returns ``True`` if *x* is a signaling NaN; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är en signalerande NaN; annars returneras ``False``.

source: Returns ``True`` if *x* is subnormal; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är subnormal; annars returneras ``False``.

source: Returns ``True`` if *x* is a zero; otherwise returns ``False``.
sv: Returnerar ``True`` om *x* är en nolla; annars returneras ``False``.

source: Returns the natural (base e) logarithm of *x*.
sv: Returnerar den naturliga (bas e) logaritmen för *x*.

source: Returns the base 10 logarithm of *x*.
sv: Returnerar bas 10-logaritmen för *x*.

source: Returns the exponent of the magnitude of the operand's MSD.
sv: Returnerar exponenten av magnituden för operandens MSD.

source: Applies the logical operation *and* between each operand's digits.
sv: Använder den logiska operationen *och* mellan varje operands siffror.

source: Invert all the digits in *x*.
sv: Invertera alla siffrorna i *x*.

source: Applies the logical operation *or* between each operand's digits.
sv: Tillämpar den logiska operationen *eller* mellan varje operands siffror.

source: Applies the logical operation *xor* between each operand's digits.
sv: Tillämpar den logiska operationen *xor* mellan varje operands siffror.

source: Compares two values numerically and returns the maximum.
sv: Jämför två värden numeriskt och returnerar det högsta värdet.

source: Compares the values numerically with their sign ignored.
sv: Jämför värdena numeriskt utan att ta hänsyn till deras tecken.

source: Compares two values numerically and returns the minimum.
sv: Jämför två värden numeriskt och returnerar det lägsta värdet.

source: Minus corresponds to the unary prefix minus operator in Python.
sv: Minus motsvarar den unära prefixoperatorn minus i Python.

source: Return the product of *x* and *y*.
sv: Returnera produkten av *x* och *y*.

source: Returns the largest representable number smaller than *x*.
sv: Returnerar det största representerbara talet som är mindre än *x*.

source: Returns the smallest representable number larger than *x*.
sv: Returnerar det minsta representerbara talet som är större än *x*.

source: Returns the number closest to *x*, in direction towards *y*.
sv: Returnerar det tal som ligger närmast *x*, i riktning mot *y*.

source: Reduces *x* to its simplest form.
sv: Reducerar *x* till sin enklaste form.

source: Returns an indication of the class of *x*.
sv: Returnerar en indikation på klassen för *x*.

source: Plus corresponds to the unary prefix plus operator in Python. This operation applies the context precision and rounding, so it is *not* an identity operation.
sv: Plus motsvarar den unära prefixoperatorn plus i Python. Denna operation tillämpar kontextens precision och avrundning, så det är *inte* en identitetsoperation.

source: Return ``x`` to the power of ``y``, reduced modulo ``modulo`` if given.
sv: Returnerar ``x`` till potensen av ``y``, reducerad modulo ``modulo`` om den anges.

source: With two arguments, compute ``x**y``. If ``x`` is negative then ``y`` must be integral. The result will be inexact unless ``y`` is integral and the result is finite and can be expressed exactly in 'precision' digits. The rounding mode of the context is used. Results are always correctly rounded in the Python version.
sv: Beräkna ``x**y`` med två argument. Om ``x`` är negativt måste ``y`` vara heltal. Resultatet blir inexakt om inte ``y`` är heltal och resultatet är ändligt och kan uttryckas exakt i 'precisionssiffror'. Kontextens avrundningsläge används. Resultat avrundas alltid korrekt i Python-versionen.

source: ``Decimal(0) ** Decimal(0)`` results in ``InvalidOperation``, and if ``InvalidOperation`` is not trapped, then results in ``Decimal('NaN')``.
sv: ``Decimal(0) ** Decimal(0)`` resulterar i ``InvalidOperation``, och om ``InvalidOperation`` inte fångas, resulterar det i ``Decimal('NaN')``.

source: The C module computes :meth:`power` in terms of the correctly rounded :meth:`exp` and :meth:`ln` functions. The result is well-defined but only "almost always correctly rounded".
sv: C-modulen beräknar :meth:`power` i termer av de korrekt avrundade funktionerna :meth:`exp` och :meth:`ln`. Resultatet är väldefinierat men bara "nästan alltid korrekt avrundat".

source: With three arguments, compute ``(x**y) % modulo``. For the three argument form, the following restrictions on the arguments hold:
sv: Med tre argument beräkna ``(x**y) % modulo``. För formen med tre argument gäller följande restriktioner för argumenten:

source: all three arguments must be integral
sv: alla tre argumenten måste vara integrerade

source: ``y`` must be nonnegative
sv: ``y`` måste vara icke-negativ

source: at least one of ``x`` or ``y`` must be nonzero
sv: minst en av ``x`` eller ``y`` måste vara icke-noll

source: ``modulo`` must be nonzero and have at most 'precision' digits
sv: ``modulo`` måste vara icke-noll och ha högst 'precision' siffror

source: The value resulting from ``Context.power(x, y, modulo)`` is equal to the value that would be obtained by computing ``(x**y) % modulo`` with unbounded precision, but is computed more efficiently. The exponent of the result is zero, regardless of the exponents of ``x``, ``y`` and ``modulo``. The result is always exact.
sv: Det värde som erhålls genom ``Context.power(x, y, modulo)`` är lika med det värde som skulle erhållas genom att beräkna ``(x**y) % modulo`` med obegränsad precision, men beräknas mer effektivt. Resultatets exponent är noll, oavsett exponenterna för ``x``, ``y`` och ``modulo``. Resultatet är alltid exakt.

source: Returns a value equal to *x* (rounded), having the exponent of *y*.
sv: Returnerar ett värde som är lika med *x* (avrundat), med exponenten *y*.

source: Just returns 10, as this is Decimal, :)
sv: Returnerar bara 10, eftersom detta är decimal, :)

source: Returns the remainder from integer division.
sv: Returnerar restvärdet från heltalsdivision.

source: The sign of the result, if non-zero, is the same as that of the original dividend.
sv: Om resultatet inte är noll har det samma tecken som den ursprungliga utdelningen.

source: Returns ``x - y * n``, where *n* is the integer nearest the exact value of ``x / y`` (if the result is 0 then its sign will be the sign of *x*).
sv: Returnerar ``x - y * n``, där *n* är det heltal som ligger närmast det exakta värdet av ``x / y`` (om resultatet är 0 kommer dess tecken att vara tecknet för *x*).

source: Returns a rotated copy of *x*, *y* times.
sv: Returnerar en roterad kopia av *x*, *y* gånger.

source: Returns ``True`` if the two operands have the same exponent.
sv: Returnerar ``True`` om de två operanderna har samma exponent.

source: Returns the first operand after adding the second value its exp.
sv: Returnerar den första operanden efter att ha adderat det andra värdet dess exp.

source: Returns a shifted copy of *x*, *y* times.
sv: Returnerar en förskjuten kopia av *x*, *y* gånger.

source: Square root of a non-negative number to context precision.
sv: Kvadratrot av ett icke-negativt tal med kontextprecision.

source: Return the difference between *x* and *y*.
sv: Returnera skillnaden mellan *x* och *y*.

source: Rounds to an integer.
sv: Avrundas till ett heltal.

source: Converts a number to a string using scientific notation.
sv: Konverterar ett tal till en sträng med vetenskaplig notation.

source: Constants
sv: Konstanter

source: The constants in this section are only relevant for the C module. They are also included in the pure Python version for compatibility.
sv: Konstanterna i detta avsnitt är endast relevanta för C-modulen. De ingår också i den rena Python-versionen för kompatibilitet.

source: 32-bit
sv: 32-bitars

source: 64-bit
sv: 64-bitars

source: The value is ``True``. Deprecated, because Python now always has threads.
sv: Värdet är ``True``. Föråldrad, eftersom Python nu alltid har trådar.

source: The default value is ``True``. If Python is :option:`configured using the --without-decimal-contextvar option <--without-decimal-contextvar>`, the C version uses a thread-local rather than a coroutine-local context and the value is ``False``. This is slightly faster in some nested context scenarios.
sv: Standardvärdet är ``True``. Om Python är :option:`konfigurerad med alternativet --without-decimal-contextvar <--without-decimal-contextvar>`, använder C-versionen en trådlokal snarare än en koroutinlokal kontext och värdet är ``False``. Detta är något snabbare i vissa scenarier med nästlade kontexter.

source: Rounding modes
sv: Avrundningslägen

source: Round towards ``Infinity``.
sv: Runda mot ``Infinity``.

source: Round towards zero.
sv: Runda mot noll.

source: Round towards ``-Infinity``.
sv: Runda mot ``Infinity``.

source: Round to nearest with ties going towards zero.
sv: Avrunda till närmaste med oavgjorda tal mot noll.

source: Round to nearest with ties going to nearest even integer.
sv: Avrunda till närmaste med oavgjort till närmaste jämna heltal.

source: Round to nearest with ties going away from zero.
sv: Avrunda till närmaste med tiotal som går bort från noll.

source: Round away from zero.
sv: Avrunda bort från noll.

source: Round away from zero if last digit after rounding towards zero would have been 0 or 5; otherwise round towards zero.
sv: Avrunda bort från noll om sista siffran efter avrundning mot noll skulle ha varit 0 eller 5; annars avrunda mot noll.

source: Signals
sv: Signaler

source: Signals represent conditions that arise during computation. Each corresponds to one context flag and one context trap enabler.
sv: Signalerna representerar förhållanden som uppstår under beräkningen. Var och en motsvarar en kontextflagga och en kontextfälla.

source: The context flag is set whenever the condition is encountered. After the computation, flags may be checked for informational purposes (for instance, to determine whether a computation was exact). After checking the flags, be sure to clear all flags before starting the next computation.
sv: Kontextflaggan sätts närhelst villkoret uppfylls. Efter beräkningen kan flaggorna kontrolleras i informationssyfte (t.ex. för att avgöra om en beräkning var exakt). När du har kontrollerat flaggorna måste du rensa alla flaggor innan du startar nästa beräkning.

source: If the context's trap enabler is set for the signal, then the condition causes a Python exception to be raised. For example, if the :class:`DivisionByZero` trap is set, then a :exc:`DivisionByZero` exception is raised upon encountering the condition.
sv: Om kontextens trap enabler är inställd för signalen, orsakar villkoret att ett Python-undantag utlöses. Till exempel, om :class:`DivisionByZero`-fällan är inställd, kommer ett :exc:`DivisionByZero`-undantag att utlösas när villkoret påträffas.

source: Altered an exponent to fit representation constraints.
sv: Ändrade en exponent för att passa representationsbegränsningar.

source: Typically, clamping occurs when an exponent falls outside the context's :attr:`~Context.Emin` and :attr:`~Context.Emax` limits. If possible, the exponent is reduced to fit by adding zeros to the coefficient.
sv: Vanligtvis sker fastspänning när en exponent faller utanför kontextens gränser :attr:`~Context.Emin` och :attr:`~Context.Emax`. Om möjligt reduceras exponenten så att den passar genom att nollor läggs till i koefficienten.

source: Base class for other signals and a subclass of :exc:`ArithmeticError`.
sv: Basklass för andra signaler och en underklass till :exc:`ArithmeticError`.

source: Signals the division of a non-infinite number by zero.
sv: Signalerar division av ett icke oändligt tal med noll.

source: Can occur with division, modulo division, or when raising a number to a negative power. If this signal is not trapped, returns ``Infinity`` or ``-Infinity`` with the sign determined by the inputs to the calculation.
sv: Kan uppstå vid division, modulo-division eller när ett tal upphöjs till en negativ potens. Om denna signal inte fångas upp returneras ``Oändlighet`` eller ``Oändlighet`` med det tecken som bestäms av ingångarna till beräkningen.

source: Indicates that rounding occurred and the result is not exact.
sv: Indikerar att avrundning har skett och att resultatet inte är exakt.

source: Signals when non-zero digits were discarded during rounding. The rounded result is returned. The signal flag or trap is used to detect when results are inexact.
sv: Signalerar när siffror som inte är noll har tagits bort under avrundningen. Det avrundade resultatet returneras. Signalflaggan eller trap används för att upptäcka när resultaten är inexakta.

source: An invalid operation was performed.
sv: En ogiltig operation utfördes.

source: Indicates that an operation was requested that does not make sense. If not trapped, returns ``NaN``. Possible causes include::
sv: Indikerar att en åtgärd begärdes som inte är meningsfull. Om den inte fångas upp returneras ``NaN``. Möjliga orsaker inkluderar::

source: Infinity - Infinity 0 * Infinity Infinity / Infinity x % 0 Infinity % x sqrt(-x) and x > 0 0 ** 0 x ** (non-integer) x ** Infinity
sv: Oändlighet - Oändlighet 0 * Infinity Oändlighet / Oändlighet x % 0 Oändligt % x sqrt(-x) och x > 0 0 ** 0 x ** (icke heltal) x ** oändlighet

source: Numerical overflow.
sv: Numeriskt överflöde.

source: Indicates the exponent is larger than :attr:`Context.Emax` after rounding has occurred. If not trapped, the result depends on the rounding mode, either pulling inward to the largest representable finite number or rounding outward to ``Infinity``. In either case, :class:`Inexact` and :class:`Rounded` are also signaled.
sv: Anger att exponenten är större än :attr:`Context.Emax` efter att avrundning har skett. Om den inte fångas beror resultatet på avrundningsläget, antingen dras det inåt till det största representativa ändliga talet eller avrundas utåt till ``Infinity``. I båda fallen signaleras också :class:`Inexact` och :class:`Rounded`.

source: Rounding occurred though possibly no information was lost.
sv: Avrundning skedde, men möjligen gick ingen information förlorad.

source: Signaled whenever rounding discards digits; even if those digits are zero (such as rounding ``5.00`` to ``5.0``). If not trapped, returns the result unchanged. This signal is used to detect loss of significant digits.
sv: Signaleras när avrundning tar bort siffror, även om dessa siffror är noll (t.ex. avrundning av ``5,00`` till ``5,0``). Om den inte fångas, returneras resultatet oförändrat. Denna signal används för att upptäcka förlust av signifikanta siffror.

source: Exponent was lower than :attr:`~Context.Emin` prior to rounding.
sv: Exponent var lägre än :attr:`~Context.Emin` före avrundning.

source: Occurs when an operation result is subnormal (the exponent is too small). If not trapped, returns the result unchanged.
sv: Inträffar när ett operationsresultat är onormalt (exponenten är för liten). Om det inte fångas, returneras resultatet oförändrat.

source: Numerical underflow with result rounded to zero.
sv: Numeriskt underflöde med resultatet avrundat till noll.

source: Occurs when a subnormal result is pushed to zero by rounding. :class:`Inexact` and :class:`Subnormal` are also signaled.
sv: Inträffar när ett subnormalt resultat pressas till noll genom avrundning. :class:`Inexact` och :class:`Subnormal` signaleras också.

source: Enable stricter semantics for mixing floats and Decimals.
sv: Möjliggör striktare semantik för blandning av floats och decimaler.
