Repository: yeager/python-docs-sv
Catalog: library/decimal.po
Languages: sv

source: :mod:`!decimal` --- Decimal fixed-point and floating-point arithmetic
sv: :mod:`!decimal` --- Decimal aritmetik med fasta och flytande kommatecken

source: **Source code:** :source:`Lib/decimal.py`
sv: **Källkod:** :source:`Lib/decimal.py`

source: The :mod:`decimal` module provides support for fast correctly rounded decimal floating-point arithmetic. It offers several advantages over the :class:`float` datatype:
sv: Modulen :mod:`decimal` ger stöd för snabb, korrekt avrundad decimal aritmetik med flyttal. Den erbjuder flera fördelar jämfört med datatypen :class:`float`:

source: Decimal "is based on a floating-point model which was designed with people in mind, and necessarily has a paramount guiding principle -- computers must provide an arithmetic that works in the same way as the arithmetic that people learn at school." -- excerpt from the decimal arithmetic specification.
sv: Decimal "är baserat på en flyttalsmodell som utformades med människor i åtanke och som nödvändigtvis har en överordnad vägledande princip - datorer måste tillhandahålla en aritmetik som fungerar på samma sätt som den aritmetik som människor lär sig i skolan." -- Utdrag ur specifikationen för decimal aritmetik.

source: Decimal numbers can be represented exactly. In contrast, numbers like ``1.1`` and ``2.2`` do not have exact representations in binary floating point. End users typically would not expect ``1.1 + 2.2`` to display as ``3.3000000000000003`` as it does with binary floating point.
sv: Decimaltal kan representeras exakt. Däremot har tal som ``1,1`` och ``2,2`` inte exakta representationer i binär flyttal. Slutanvändare förväntar sig vanligtvis inte att ``1,1 + 2,2`` ska visas som ``3,3000000000000003`` som det gör med binär flyttal.

source: The exactness carries over into arithmetic. In decimal floating point, ``0.1 + 0.1 + 0.1 - 0.3`` is exactly equal to zero. In binary floating point, the result is ``5.5511151231257827e-017``. While near to zero, the differences prevent reliable equality testing and differences can accumulate. For this reason, decimal is preferred in accounting applications which have strict equality invariants.
sv: Exaktheten överförs till aritmetik. I decimal flyttal är ``0,1 + 0,1 + 0,1 - 0,3`` exakt lika med noll. I binär flyttal blir resultatet ``5,5511151231257827e-017``. Även om skillnaderna är nära noll förhindrar de tillförlitlig jämlikhetstestning och skillnaderna kan ackumuleras. Av denna anledning föredras decimal i bokföringsapplikationer som har strikta jämlikhetsinvarianter.

source: The decimal module incorporates a notion of significant places so that ``1.30 + 1.20`` is ``2.50``. The trailing zero is kept to indicate significance. This is the customary presentation for monetary applications. For multiplication, the "schoolbook" approach uses all the figures in the multiplicands. For instance, ``1.3 * 1.2`` gives ``1.56`` while ``1.30 * 1.20`` gives ``1.5600``.
sv: Decimalmodulen innehåller ett begrepp om signifikanta ställen så att ``1,30 + 1,20`` är ``2,50``. Den efterföljande nollan behålls för att indikera signifikans. Detta är den gängse presentationen för monetära tillämpningar. Vid multiplikation används enligt "skolboken" alla siffror i multiplikanden. Till exempel ger ``1,3 * 1,2`` ``1,56`` medan ``1,30 * 1,20`` ger ``1,5600``.

source: Unlike hardware based binary floating point, the decimal module has a user alterable precision (defaulting to 28 places) which can be as large as needed for a given problem:
sv: Till skillnad från maskinvarubaserad binär flyttalsräkning har decimalmodulen en precision som kan ändras av användaren (standard är 28 enheter) och som kan vara så stor som behövs för ett visst problem:

source: Both binary and decimal floating point are implemented in terms of published standards. While the built-in float type exposes only a modest portion of its capabilities, the decimal module exposes all required parts of the standard. When needed, the programmer has full control over rounding and signal handling. This includes an option to enforce exact arithmetic by using exceptions to block any inexact operations.
sv: Både binär och decimal flyttal implementeras i enlighet med publicerade standarder. Medan den inbyggda float-typen bara visar en blygsam del av sina möjligheter, visar decimalmodulen alla nödvändiga delar av standarden. När det behövs har programmeraren full kontroll över avrundning och signalhantering. Detta inkluderar ett alternativ för att genomdriva exakt aritmetik genom att använda undantag för att blockera alla inexakta operationer.

source: The decimal module was designed to support "without prejudice, both exact unrounded decimal arithmetic (sometimes called fixed-point arithmetic) and rounded floating-point arithmetic." -- excerpt from the decimal arithmetic specification.
sv: Decimalmodulen utformades för att "utan fördomar stödja både exakt oavrundad decimalaritmetik (ibland kallad fastpunktsaritmetik) och avrundad flyttalsaritmetik" -- Utdrag ur specifikationen för decimalaritmetik.

source: The module design is centered around three concepts: the decimal number, the context for arithmetic, and signals.
sv: Modulens design är centrerad kring tre koncept: decimaltalet, sammanhanget för aritmetik och signaler.

source: A decimal number is immutable. It has a sign, coefficient digits, and an exponent. To preserve significance, the coefficient digits do not truncate trailing zeros. Decimals also include special values such as ``Infinity``, ``-Infinity``, and ``NaN``. The standard also differentiates ``-0`` from ``+0``.
sv: Ett decimaltal är oföränderligt. Det har ett tecken, koefficientsiffror och en exponent. För att bevara signifikansen trunkeras inte nollorna i koefficientsiffrorna. Decimaltal innehåller också specialvärden som ``Oändlighet``, ``Oändlighet`` och ``NaN``. Standarden skiljer också mellan ``-0`` och ``+0``.

source: The context for arithmetic is an environment specifying precision, rounding rules, limits on exponents, flags indicating the results of operations, and trap enablers which determine whether signals are treated as exceptions. Rounding options include :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP`, and :const:`ROUND_05UP`.
sv: Kontexten för aritmetik är en miljö som anger precision, avrundningsregler, gränser för exponenter, flaggor som anger resultatet av operationer och trap enablers som avgör om signaler ska behandlas som undantag. Avrundningsalternativ inkluderar :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP` och :const:`ROUND_05UP`.

source: Signals are groups of exceptional conditions arising during the course of computation. Depending on the needs of the application, signals may be ignored, considered as informational, or treated as exceptions. The signals in the decimal module are: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` and :const:`FloatOperation`.
sv: Signaler är grupper av exceptionella förhållanden som uppstår under beräkningarnas gång. Beroende på applikationens behov kan signaler ignoreras, betraktas som information eller behandlas som undantag. Signalerna i decimalmodulen är: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` och :const:`FloatOperation`.

source: For each signal there is a flag and a trap enabler. When a signal is encountered, its flag is set to one, then, if the trap enabler is set to one, an exception is raised. Flags are sticky, so the user needs to reset them before monitoring a calculation.
sv: För varje signal finns det en flagga och en fällaktiverare. När en signal påträffas sätts dess flagga till ett, och om trap enabler sätts till ett utlöses ett undantag. Flaggor är "sticky", så användaren måste återställa dem innan han/hon övervakar en beräkning.

source: IBM's General Decimal Arithmetic Specification, `The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_.
sv: IBM:s allmänna decimalaritmetiska specifikation, "The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_.

source: Quick-start tutorial
sv: Handledning för snabbstart

source: The usual start to using decimals is importing the module, viewing the current context with :func:`getcontext` and, if necessary, setting new values for precision, rounding, or enabled traps::
sv: Den vanliga starten för att använda decimaler är att importera modulen, se den aktuella kontexten med :func:`getcontext` och, om nödvändigt, ange nya värden för precision, avrundning eller aktiverade fällor::

source: >>> from decimal import * >>> getcontext() Context(prec=28, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capitals=1, clamp=0, flags=[], traps=[Overflow, DivisionByZero, InvalidOperation]) >>> getcontext().prec = 7 # Set a new precision
sv: >>> från decimal import * >>> getcontext() Context(prec=28, avrundning=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capital=1, clamp=0, flags=[], traps=[Överflöde, DivisionByZero, InvalidOperation]) >>> getcontext().prec = 7 # Ställ in en ny precision

source: Decimal instances can be constructed from integers, strings, floats, or tuples. Construction from an integer or a float performs an exact conversion of the value of that integer or float. Decimal numbers include special values such as ``NaN`` which stands for "Not a number", positive and negative ``Infinity``, and ``-0``::
sv: Decimalinstanser kan konstrueras från heltal, strängar, flyttal eller tupler. Konstruktion från ett heltal eller en float utför en exakt konvertering av värdet för det heltalet eller floaten. Decimaltal innehåller specialvärden som ``NaN`` som står för "Not a number", positiva och negativa ``Infinity``, och ``-0``::

source: If the :exc:`FloatOperation` signal is trapped, accidental mixing of decimals and floats in constructors or ordering comparisons raises an exception::
sv: Om signalen :exc:`FloatOperation` är fångad, kommer oavsiktlig blandning av decimaler och flyttal i konstruktörer eller orderjämförelser att ge upphov till ett undantag::

source: >>> c = getcontext() >>> c.traps[FloatOperation] = True >>> Decimal(3.14) Traceback (most recent call last): File "<stdin>", line 1, in <module> decimal.FloatOperation: [<class 'decimal.FloatOperation'>] >>> Decimal('3.5') < 3.7 Traceback (most recent call last): File "<stdin>", line 1, in <module> decimal.FloatOperation: [<class 'decimal.FloatOperation'>] >>> Decimal('3.5') == 3.5 True
sv: &gt;&gt;&gt; c = hämta kontext() &gt;&gt;&gt; c.traps[FloatOperation] = True &gt;&gt;&gt; Decimal(3,14) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> decimal.FloatOperation: [<class 'decimal.FloatOperation'>] &gt;&gt;&gt; Decimal('3,5') &lt; 3,7 Återkoppling (senaste anropet senast): Fil "&lt;stdin&gt;", rad 1, i <module> decimal.FloatOperation: [<class 'decimal.FloatOperation'>] &gt;&gt;&gt; Decimal('3,5') == 3,5 Sant

source: The significance of a new Decimal is determined solely by the number of digits input. Context precision and rounding only come into play during arithmetic operations.
sv: Betydelsen av en ny decimal bestäms enbart av antalet inmatade siffror. Kontextens precision och avrundning spelar bara in under aritmetiska operationer.

source: If the internal limits of the C version are exceeded, constructing a decimal raises :class:`InvalidOperation`::
sv: Om de interna gränserna för C-versionen överskrids, ger konstruktionen av en decimal :class:`InvalidOperation`::

source: >>> Decimal("1e9999999999999999999") Traceback (most recent call last): File "<stdin>", line 1, in <module> decimal.InvalidOperation: [<class 'decimal.InvalidOperation'>]
sv: &gt;&gt;&gt; Decimal("1e9999999999999999999") Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> decimal.InvalidOperation: [<class 'decimal.InvalidOperation'>]

source: Decimals interact well with much of the rest of Python. Here is a small decimal floating-point flying circus:
sv: Decimaler samverkar bra med mycket av resten av Python. Här är en liten flygande cirkus med decimala flyttal:

source: >>> data = list(map(Decimal, '1.34 1.87 3.45 2.35 1.00 0.03 9.25'.split())) >>> max(data) Decimal('9.25') >>> min(data) Decimal('0.03') >>> sorted(data) [Decimal('0.03'), Decimal('1.00'), Decimal('1.34'), Decimal('1.87'), Decimal('2.35'), Decimal('3.45'), Decimal('9.25')] >>> sum(data) Decimal('19.29') >>> a,b,c = data[:3] >>> str(a) '1.34' >>> float(a) 1.34 >>> round(a, 1) Decimal('1.3') >>> int(a) 1 >>> a * 5 Decimal('6.70') >>> a * b Decimal('2.5058') >>> c % a Decimal('0.77')
sv: >>> data = list(map(Decimal, '1,34 1,87 3,45 2,35 1,00 0,03 9,25'.split()))) >>> max(data) Decimal('9,25') >>> min(data) Decimal('0,03') >>> sorterad(data) [Decimal('0,03'), Decimal('1,00'), Decimal('1,34'), Decimal('1,87'), Decimal('2,35'), Decimal('3,45'), Decimal('9,25')] >>> sum(data) Decimal('19,29') >>> a,b,c = data[:3] >>> str(a) '1.34' >>> float(a) 1.34 >>> runda(a, 1) Decimal('1,3') >>> int(a) 1 >>> a * 5 Decimal('6,70') >>> a * b Decimal('2,5058') >>> c % a Decimal('0,77')

source: And some mathematical functions are also available to Decimal:
sv: Och vissa matematiska funktioner är också tillgängliga för Decimal:

source: The :meth:`~Decimal.quantize` method rounds a number to a fixed exponent. This method is useful for monetary applications that often round results to a fixed number of places:
sv: Metoden :meth:`~Decimal.quantize` avrundar ett tal till en fast exponent. Denna metod är användbar för monetära applikationer som ofta avrundar resultat till ett fast antal enheter:

source: As shown above, the :func:`getcontext` function accesses the current context and allows the settings to be changed. This approach meets the needs of most applications.
sv: Som visas ovan får funktionen :func:`getcontext` tillgång till det aktuella sammanhanget och gör det möjligt att ändra inställningarna. Detta tillvägagångssätt uppfyller behoven i de flesta applikationer.

source: For more advanced work, it may be useful to create alternate contexts using the Context() constructor. To make an alternate active, use the :func:`setcontext` function.
sv: För mer avancerat arbete kan det vara användbart att skapa alternativa kontexter med hjälp av Context()-konstruktören. För att göra en alternativ kontext aktiv, använd funktionen :func:`setcontext`.

source: In accordance with the standard, the :mod:`decimal` module provides two ready to use standard contexts, :const:`BasicContext` and :const:`ExtendedContext`. The former is especially useful for debugging because many of the traps are enabled:
sv: I enlighet med standarden tillhandahåller modulen :mod:`decimal` två standardkontexter som är färdiga att använda, :const:`BasicContext` och :const:`ExtendedContext`. Den förstnämnda är speciellt användbar för felsökning eftersom många av fällorna är aktiverade:

source: >>> myothercontext = Context(prec=60, rounding=ROUND_HALF_DOWN) >>> setcontext(myothercontext) >>> Decimal(1) / Decimal(7) Decimal('0.142857142857142857142857142857142857142857142857142857142857') >>> ExtendedContext Context(prec=9, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capitals=1, clamp=0, flags=[], traps=[]) >>> setcontext(ExtendedContext) >>> Decimal(1) / Decimal(7) Decimal('0.142857143') >>> Decimal(42) / Decimal(0) Decimal('Infinity') >>> setcontext(BasicContext) >>> Decimal(42) / Decimal(0) Traceback (most recent call last): File "<pyshell#143>", line 1, in -toplevel- Decimal(42) / Decimal(0) DivisionByZero: x / 0
sv: >>> myothercontext = Context(prec=60, avrundning=ROUND_HALF_DOWN) >>> setcontext(myothercontext) >>> Decimal(1) / Decimal(7) Decimal('0.142857142857142857142857142857142857142857142857142857142857') >>> ExtendedContext Context(prec=9, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, huvudstäder=1, clamp=0, flaggor=[], fällor=[]) >>> setcontext(ExtendedContext) >>> Decimal(1) / Decimal(7) Decimal('0.142857143') >>> Decimal(42) / Decimal(0) Decimal('Oändlighet') >>> setcontext(BasicContext) >>> Decimal(42) / Decimal(0) Traceback (senaste anropet senast): Fil "<pyshell#143>", rad 1, i -toplevel- Decimal(42) / Decimal(0) DivisionByZero: x / 0

source: Contexts also have signal flags for monitoring exceptional conditions encountered during computations. The flags remain set until explicitly cleared, so it is best to clear the flags before each set of monitored computations by using the :meth:`~Context.clear_flags` method. ::
sv: Kontexter har också signalflaggor för övervakning av exceptionella förhållanden som uppstår under beräkningar. Flaggorna förblir inställda tills de uttryckligen rensas, så det är bäst att rensa flaggorna före varje uppsättning av övervakade beräkningar genom att använda metoden :meth:`~Context.clear_flags`. ::

source: >>> setcontext(ExtendedContext) >>> getcontext().clear_flags() >>> Decimal(355) / Decimal(113) Decimal('3.14159292') >>> getcontext() Context(prec=9, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capitals=1, clamp=0, flags=[Inexact, Rounded], traps=[])
sv: >>> setcontext(ExtendedContext) >>> getcontext().clear_flags() >>> Decimal(355) / Decimal(113) Decimal('3.14159292') >>> getcontext() Context(prec=9, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, versaler=1, clamp=0, flaggor=[Inexakt, Avrundad], fällor=[])

source: The *flags* entry shows that the rational approximation to pi was rounded (digits beyond the context precision were thrown away) and that the result is inexact (some of the discarded digits were non-zero).
sv: Posten *flags* visar att den rationella approximationen av pi avrundades (siffror utanför kontextprecisionen kastades bort) och att resultatet är inexakt (några av de bortkastade siffrorna var andra än noll).

source: Individual traps are set using the dictionary in the :attr:`~Context.traps` attribute of a context:
sv: Enskilda fällor ställs in med hjälp av ordlistan i attributet :attr:`~Context.traps` i en kontext:

source: >>> setcontext(ExtendedContext) >>> Decimal(1) / Decimal(0) Decimal('Infinity') >>> getcontext().traps[DivisionByZero] = 1 >>> Decimal(1) / Decimal(0) Traceback (most recent call last): File "<pyshell#112>", line 1, in -toplevel- Decimal(1) / Decimal(0) DivisionByZero: x / 0
sv: >>> setcontext(ExtendedContext) >>> Decimal(1) / Decimal(0) Decimal('Infinity') >>> getcontext().traps[DivisionByZero] = 1 >>> Decimal(1) / Decimal(0) Traceback (senaste anropet senast): Fil "<pyshell#112>", rad 1, i -toplevel- Decimal(1) / Decimal(0) DivisionByZero: x / 0

source: Most programs adjust the current context only once, at the beginning of the program. And, in many applications, data is converted to :class:`Decimal` with a single cast inside a loop. With context set and decimals created, the bulk of the program manipulates the data no differently than with other Python numeric types.
sv: De flesta program justerar den aktuella kontexten endast en gång, i början av programmet. Och i många applikationer konverteras data till :class:`Decimal` med en enda cast inuti en loop. När kontexten är inställd och decimaler skapade, manipulerar huvuddelen av programmet data på samma sätt som med andra numeriska Python-typer.

source: Decimal objects
sv: Decimala objekt

source: Construct a new :class:`Decimal` object based from *value*.
sv: Konstruera ett nytt :class:`Decimal`-objekt baserat på *värde*.

source: *value* can be an integer, string, tuple, :class:`float`, or another :class:`Decimal` object. If no *value* is given, returns ``Decimal('0')``. If *value* is a string, it should conform to the decimal numeric string syntax after leading and trailing whitespace characters, as well as underscores throughout, are removed::
sv: *value* kan vara ett heltal, en sträng, en tupel, :class:`float` eller ett annat :class:`Decimal`-objekt. Om inget *värde* anges returneras ``Decimal('0')``. Om *värde* är en sträng bör den överensstämma med den decimala numeriska strängsyntaxen efter att inledande och avslutande blankstegstecken, samt understrykningstecken, har tagits bort::

source: sign ::= '+' | '-' digit ::= '0' | '1' | '2' | '3' | '4' | '5' | '6' | '7' | '8' | '9' indicator ::= 'e' | 'E' digits ::= digit [digit]... decimal-part ::= digits '.' [digits] | ['.'] digits exponent-part ::= indicator [sign] digits infinity ::= 'Infinity' | 'Inf' nan ::= 'NaN' [digits] | 'sNaN' [digits] numeric-value ::= decimal-part [exponent-part] | infinity numeric-string ::= [sign] numeric-value | [sign] nan
sv: tecken ::= '+' | '-' siffra ::= '0' | '1' | '2' | '3' | '4' | '5' | '6' | '7' | '8' | '9' indikator ::= 'e' | 'E' siffror ::= siffra [siffra]... decimal-del ::= siffror '.' [siffror] | ['.'] siffror exponent-del ::= indikator [tecken] siffror infinity ::= 'Oändlighet' | 'Inf' nan ::= 'NaN' [siffror] | 'sNaN' [siffror] numeriskt värde ::= decimaldel [exponentdel] | oändlighet numerisk-sträng ::= [tecken] numeriskt-värde | [tecken] nan

source: Other Unicode decimal digits are also permitted where ``digit`` appears above. These include decimal digits from various other alphabets (for example, Arabic-Indic and Devanāgarī digits) along with the fullwidth digits ``'\uff10'`` through ``'\uff19'``. Case is not significant, so, for example, ``inf``, ``Inf``, ``INFINITY``, and ``iNfINity`` are all acceptable spellings for positive infinity.
sv: Andra Unicode decimalsiffror är också tillåtna där ``digit`` visas ovan. Dessa inkluderar decimalsiffror från olika andra alfabet (till exempel arabisk-indiska och Devanāgarī-siffror) tillsammans med fullbreddssiffrorna ``'\uff10`` till ``'\uff19``. Versal är inte signifikant, så till exempel ``inf``, ``Inf``, ``INFINITY`` och ``iNfINity`` är alla acceptabla stavningar för positiv oändlighet.

source: If *value* is a :class:`tuple`, it should have three components, a sign (``0`` for positive or ``1`` for negative), a :class:`tuple` of digits, and an integer exponent. For example, ``Decimal((0, (1, 4, 1, 4), -3))`` returns ``Decimal('1.414')``.
sv: Om *värde* är en :class:`tupel` ska den ha tre komponenter, ett tecken (``0`` för positiv eller ``1`` för negativ), en :class:`tupel` av siffror och en heltalsexponent. Till exempel ger ``Decimal((0, (1, 4, 1, 4), -3))`` ``Decimal('1.414')``.

source: If *value* is a :class:`float`, the binary floating-point value is losslessly converted to its exact decimal equivalent. This conversion can often require 53 or more digits of precision. For example, ``Decimal(float('1.1'))`` converts to ``Decimal('1.100000000000000088817841970012523233890533447265625')``.
sv: Om *värde* är en :class:`float` konverteras det binära flyttalsvärdet förlustfritt till sin exakta decimala motsvarighet. Denna konvertering kan ofta kräva 53 eller fler precisionssiffror. Till exempel konverterar ``Decimal(float('1.1'))`` till ``Decimal('1.100000000000000088817841970012523233890533447265625')``.

source: The *context* precision does not affect how many digits are stored. That is determined exclusively by the number of digits in *value*. For example, ``Decimal('3.00000')`` records all five zeros even if the context precision is only three.
sv: Precisionen i *kontexten* påverkar inte hur många siffror som lagras. Det bestäms uteslutande av antalet siffror i *värdet*. Till exempel, ``Decimal('3.00000')`` registrerar alla fem nollor även om kontextprecisionen bara är tre.
