Repository: yeager/python-docs-sv
Catalog: library/decimal.po
Languages: sv

source: If the signal is not trapped (default), mixing floats and Decimals is permitted in the :class:`~decimal.Decimal` constructor, :meth:`~decimal.Context.create_decimal` and all comparison operators. Both conversion and comparisons are exact. Any occurrence of a mixed operation is silently recorded by setting :exc:`FloatOperation` in the context flags. Explicit conversions with :meth:`~decimal.Decimal.from_float` or :meth:`~decimal.Context.create_decimal_from_float` do not set the flag.
sv: Om signalen inte är fångad (standard) är det tillåtet att blanda floats och decimaler i :class:`~decimal.Decimal`-konstruktorn, :meth:`~decimal.Context.create_decimal` och alla jämförelseoperatorer. Både konvertering och jämförelser är exakta. Varje förekomst av en blandad operation registreras tyst genom att ställa in :exc:`FloatOperation` i kontextflaggorna. Explicita konverteringar med :meth:`~decimal.Decimal.from_float` eller :meth:`~decimal.Context.create_decimal_from_float` sätter inte flaggan.

source: Otherwise (the signal is trapped), only equality comparisons and explicit conversions are silent. All other mixed operations raise :exc:`FloatOperation`.
sv: I annat fall (signalen fångas upp) är endast jämlikhetsjämförelser och explicita konverteringar tysta. Alla andra blandade operationer ger upphov till :exc:`FloatOperation`.

source: The following table summarizes the hierarchy of signals::
sv: Följande tabell sammanfattar signalernas hierarki::

source: exceptions.ArithmeticError(exceptions.Exception) DecimalException Clamped DivisionByZero(DecimalException, exceptions.ZeroDivisionError) Inexact Overflow(Inexact, Rounded) Underflow(Inexact, Rounded, Subnormal) InvalidOperation Rounded Subnormal FloatOperation(DecimalException, exceptions.TypeError)
sv: exceptions.ArithmeticError(exceptions.Exception) DecimalException Klämd DivisionByZero(DecimalException, exceptions.ZeroDivisionError) Inexakt Överflöde(Inexakt, Avrundad) Underflow(Inexact, Rounded, Subnormal) OgiltigOperation Avrundad Subnormal FloatOperation(DecimalException, undantag.TypeError)

source: Floating-point notes
sv: Flyttalsnoteringar

source: Mitigating round-off error with increased precision
sv: Minska avrundningsfel med ökad precision

source: The use of decimal floating point eliminates decimal representation error (making it possible to represent ``0.1`` exactly); however, some operations can still incur round-off error when non-zero digits exceed the fixed precision.
sv: Användningen av decimalt flyttal eliminerar fel i decimalrepresentationen (vilket gör det möjligt att representera ``0,1`` exakt); vissa operationer kan dock fortfarande medföra avrundningsfel när siffror som inte är noll överstiger den fasta precisionen.

source: The effects of round-off error can be amplified by the addition or subtraction of nearly offsetting quantities resulting in loss of significance. Knuth provides two instructive examples where rounded floating-point arithmetic with insufficient precision causes the breakdown of the associative and distributive properties of addition:
sv: Effekterna av avrundningsfel kan förstärkas genom addition eller subtraktion av nästan motsatta mängder, vilket leder till förlust av signifikans. Knuth ger två instruktiva exempel där avrundad aritmetik med flyttal med otillräcklig precision leder till att de associativa och distributiva egenskaperna hos addition bryts ned:

source: # Examples from Seminumerical Algorithms, Section 4.2.2. >>> from decimal import Decimal, getcontext >>> getcontext().prec = 8 >>> u, v, w = Decimal(11111113), Decimal(-11111111), Decimal('7.51111111') >>> (u + v) + w Decimal('9.5111111') >>> u + (v + w) Decimal('10') >>> u, v, w = Decimal(20000), Decimal(-6), Decimal('6.0000003') >>> (u*v) + (u*w) Decimal('0.01') >>> u * (v+w) Decimal('0.0060000')
sv: # Exempel från Seminumeriska algoritmer, avsnitt 4.2.2. >>> from decimal import Decimal, getcontext >>> getcontext().prec = 8 >>> u, v, w = Decimal(11111113), Decimal(-11111111), Decimal('7.51111111') >>> (u + v) + w Decimal('9.5111111') >>> u + (v + w) Decimal('10') >>> u, v, w = Decimal(20000), Decimal(-6), Decimal('6.0000003') >>> (u*v) + (u*w) Decimal('0,01') >>> u * (v+w) Decimal('0.0060000')

source: The :mod:`decimal` module makes it possible to restore the identities by expanding the precision sufficiently to avoid loss of significance:
sv: Modulen :mod:`decimal` gör det möjligt att återställa identiteterna genom att utöka precisionen tillräckligt för att undvika förlust av signifikans:

source: Special values
sv: Särskilda värden

source: The number system for the :mod:`decimal` module provides special values including ``NaN``, ``sNaN``, ``-Infinity``, ``Infinity``, and two zeros, ``+0`` and ``-0``.
sv: Talsystemet för modulen :mod:`decimal` innehåller specialvärden som ``NaN``, ``NaN``, ``Infinity``, ``Infinity`` och två nollor, ``+0`` och ``-0``.

source: Infinities can be constructed directly with: ``Decimal('Infinity')``. Also, they can arise from dividing by zero when the :exc:`DivisionByZero` signal is not trapped. Likewise, when the :exc:`Overflow` signal is not trapped, infinity can result from rounding beyond the limits of the largest representable number.
sv: Oändligheter kan konstrueras direkt med: ``Decimal('Infinity')``. De kan också uppstå genom att dividera med noll när signalen :exc:`DivisionByZero` inte är spärrad. På samma sätt kan oändlighet uppstå när man avrundar bortom gränserna för det största representerbara talet när signalen :exc:`Overflow` inte fångas upp.

source: The infinities are signed (affine) and can be used in arithmetic operations where they get treated as very large, indeterminate numbers. For instance, adding a constant to infinity gives another infinite result.
sv: De oändliga talen är signerade (affina) och kan användas i aritmetiska operationer där de behandlas som mycket stora, obestämda tal. Om man t.ex. adderar en konstant till oändligheten får man ett annat oändligt resultat.

source: Some operations are indeterminate and return ``NaN``, or if the :exc:`InvalidOperation` signal is trapped, raise an exception. For example, ``0/0`` returns ``NaN`` which means "not a number". This variety of ``NaN`` is quiet and, once created, will flow through other computations always resulting in another ``NaN``. This behavior can be useful for a series of computations that occasionally have missing inputs --- it allows the calculation to proceed while flagging specific results as invalid.
sv: Vissa operationer är obestämda och returnerar ``NaN``, eller om :exc:`InvalidOperation`-signalen fångas, ger upphov till ett undantag. Till exempel, ``0/0`` returnerar ``NaN`` vilket betyder "inte ett tal". Denna variant av ``NaN`` är tyst och när den väl har skapats kommer den att flöda genom andra beräkningar som alltid resulterar i en annan ``NaN``. Detta beteende kan vara användbart för en serie beräkningar som ibland saknar indata --- det gör att beräkningen kan fortsätta medan specifika resultat flaggas som ogiltiga.

source: A variant is ``sNaN`` which signals rather than remaining quiet after every operation. This is a useful return value when an invalid result needs to interrupt a calculation for special handling.
sv: En variant är ``NaN`` som signalerar istället för att vara tyst efter varje operation. Detta är ett användbart returvärde när ett ogiltigt resultat måste avbryta en beräkning för särskild hantering.

source: The behavior of Python's comparison operators can be a little surprising where a ``NaN`` is involved. A test for equality where one of the operands is a quiet or signaling ``NaN`` always returns :const:`False` (even when doing ``Decimal('NaN')==Decimal('NaN')``), while a test for inequality always returns :const:`True`. An attempt to compare two Decimals using any of the ``<``, ``<=``, ``>`` or ``>=`` operators will raise the :exc:`InvalidOperation` signal if either operand is a ``NaN``, and return :const:`False` if this signal is not trapped. Note that the General Decimal Arithmetic specification does not specify the behavior of direct comparisons; these rules for comparisons involving a ``NaN`` were taken from the IEEE 854 standard (see Table 3 in section 5.7). To ensure strict standards-compliance, use the :meth:`~Decimal.compare` and :meth:`~Decimal.compare_signal` methods instead.
sv: Beteendet hos Pythons jämförelseoperatorer kan vara lite förvånande när en ``NaN`` är inblandad. Ett test för likhet där en av operanderna är en tyst eller signalerande ``NaN`` returnerar alltid :const:`False`` (även när man gör ``Decimal('NaN')==Decimal('NaN')``), medan ett test för olikhet alltid returnerar :const:`True``. Ett försök att jämföra två decimaler med någon av operatorerna ``<``, ``<=``, ``>`` eller ``>=`` kommer att ge upphov till signalen :exc:`InvalidOperation` om någon av operanderna är ett ``NaN``, och returnera :const:`False` om denna signal inte fångas upp. Observera att General Decimal Arithmetic-specifikationen inte specificerar beteendet för direkta jämförelser; dessa regler för jämförelser som involverar ett ``NaN`` har hämtats från IEEE 854-standarden (se tabell 3 i avsnitt 5.7). För att säkerställa strikt standardöverensstämmelse, använd metoderna :meth:`~Decimal.compare` och :meth:`~Decimal.compare_signal` istället.

source: The signed zeros can result from calculations that underflow. They keep the sign that would have resulted if the calculation had been carried out to greater precision. Since their magnitude is zero, both positive and negative zeros are treated as equal and their sign is informational.
sv: De signerade nollorna kan uppstå vid beräkningar som underflödar. De behåller det tecken som skulle ha blivit resultatet om beräkningen hade utförts med större precision. Eftersom deras magnitud är noll behandlas både positiva och negativa nollor som lika och deras tecken är informativt.

source: In addition to the two signed zeros which are distinct yet equal, there are various representations of zero with differing precisions yet equivalent in value. This takes a bit of getting used to. For an eye accustomed to normalized floating-point representations, it is not immediately obvious that the following calculation returns a value equal to zero:
sv: Förutom de två signerade nollorna, som är olika men ändå lika, finns det olika representationer av noll med olika noggrannhet men ändå likvärdiga i värde. Detta tar lite tid att vänja sig vid. För ett öga som är vant vid normaliserade flyttalsrepresentationer är det inte omedelbart uppenbart att följande beräkning ger ett värde som är lika med noll:

source: Working with threads
sv: Arbeta med trådar

source: The :func:`getcontext` function accesses a different :class:`Context` object for each thread. Having separate thread contexts means that threads may make changes (such as ``getcontext().prec=10``) without interfering with other threads.
sv: Funktionen :func:`getcontext` ger åtkomst till ett olika :class:`Context`-objekt för varje tråd. Att ha separata trådkontexter innebär att trådar kan göra ändringar (t.ex. ``getcontext().prec=10``) utan att störa andra trådar.

source: Likewise, the :func:`setcontext` function automatically assigns its target to the current thread.
sv: På samma sätt tilldelar funktionen :func:`setcontext` automatiskt sitt mål till den aktuella tråden.

source: If :func:`setcontext` has not been called before :func:`getcontext`, then :func:`getcontext` will automatically create a new context for use in the current thread. New context objects have default values set from the :data:`decimal.DefaultContext` object.
sv: Om :func:`setcontext` inte har anropats före :func:`getcontext`, kommer :func:`getcontext` automatiskt att skapa en ny kontext för användning i den aktuella tråden. Nya kontextobjekt har standardvärden från :data:`decimal.DefaultContext`-objektet.

source: The :data:`sys.flags.thread_inherit_context` flag affects the context for new threads. If the flag is false, new threads will start with an empty context. In this case, :func:`getcontext` will create a new context object when called and use the default values from *DefaultContext*. If the flag is true, new threads will start with a copy of context from the caller of :meth:`threading.Thread.start`.
sv: Flaggan :data:`sys.flags.thread_inherit_context` påverkar kontexten för nya trådar. Om flaggan är false kommer nya trådar att starta med en tom kontext. I detta fall kommer :func:`getcontext` att skapa ett nytt kontextobjekt när den anropas och använda standardvärdena från *DefaultContext*. Om flaggan är true kommer nya trådar att starta med en kopia av kontexten från den som anropar :meth:`threading.Thread.start`.

source: To control the defaults so that each thread will use the same values throughout the application, directly modify the *DefaultContext* object. This should be done *before* any threads are started so that there won't be a race condition between threads calling :func:`getcontext`. For example::
sv: För att styra standardvärdena så att varje tråd använder samma värden i hela applikationen, modifierar du *DefaultContext*-objektet direkt. Detta bör göras *innan* några trådar startas så att det inte blir ett race condition mellan trådar som anropar :func:`getcontext`. Till exempel::

source: # Set applicationwide defaults for all threads about to be launched DefaultContext.prec = 12 DefaultContext.rounding = ROUND_DOWN DefaultContext.traps = ExtendedContext.traps.copy() DefaultContext.traps[InvalidOperation] = 1 setcontext(DefaultContext) # Afterwards, the threads can be started t1.start() t2.start() t3.start() . . .
sv: # Ställ in applikationsomfattande standardvärden för alla trådar som ska startas DefaultContext.prec = 12 DefaultContext.avrundning = ROUND_DOWN DefaultContext.traps = ExtendedContext.traps.copy() DefaultContext.traps[InvalidOperation] = 1 setcontext(DefaultContext) # Efteråt kan trådarna startas t1.start() t2.start() t3.start() . . .

source: Recipes
sv: Recept

source: Here are a few recipes that serve as utility functions and that demonstrate ways to work with the :class:`Decimal` class::
sv: Här är några recept som fungerar som verktygsfunktioner och som visar hur man kan arbeta med klassen :class:`Decimal`::

source: def moneyfmt(value, places=2, curr='', sep=',', dp='.', pos='', neg='-', trailneg=''): """Convert Decimal to a money formatted string. places: required number of places after the decimal point curr: optional currency symbol before the sign (may be blank) sep: optional grouping separator (comma, period, space, or blank) dp: decimal point indicator (comma or period) only specify as blank when places is zero pos: optional sign for positive numbers: '+', space or blank neg: optional sign for negative numbers: '-', '(', space or blank trailneg:optional trailing minus indicator: '-', ')', space or blank >>> d = Decimal('-1234567.8901') >>> moneyfmt(d, curr='$') '-$1,234,567.89' >>> moneyfmt(d, places=0, sep='.', dp='', neg='', trailneg='-') '1.234.568-' >>> moneyfmt(d, curr='$', neg='(', trailneg=')') '($1,234,567.89)' >>> moneyfmt(Decimal(123456789), sep=' ') '123 456 789.00' >>> moneyfmt(Decimal('-0.02'), neg='<', trailneg='>') '<0.02>' """ q = Decimal(10) ** -places # 2 places --> '0.01' sign, digits, exp = value.quantize(q).as_tuple() result = [] digits = list(map(str, digits)) build, next = result.append, digits.pop if sign: build(trailneg) for i in range(places): build(next() if digits else '0') if places: build(dp) if not digits: build('0') i = 0 while digits: build(next()) i += 1 if i == 3 and digits: i = 0 build(sep) build(curr) build(neg if sign else pos) return ''.join(reversed(result)) def pi(): """Compute Pi to the current precision. >>> print(pi()) 3.141592653589793238462643383 """ getcontext().prec += 2 # extra digits for intermediate steps three = Decimal(3) # substitute "three=3.0" for regular floats lasts, t, s, n, na, d, da = 0, three, 3, 1, 0, 0, 24 while s != lasts: lasts = s n, na = n+na, na+8 d, da = d+da, da+32 t = (t * n) / d s += t getcontext().prec -= 2 return +s # unary plus applies the new precision def exp(x): """Return e raised to the power of x. Result type matches input type. >>> print(exp(Decimal(1))) 2.718281828459045235360287471 >>> print(exp(Decimal(2))) 7.389056098930650227230427461 >>> print(exp(2.0)) 7.38905609893 >>> print(exp(2+0j)) (7.38905609893+0j) """ getcontext().prec += 2 i, lasts, s, fact, num = 0, 0, 1, 1, 1 while s != lasts: lasts = s i += 1 fact *= i num *= x s += num / fact getcontext().prec -= 2 return +s def cos(x): """Return the cosine of x as measured in radians. The Taylor series approximation works best for a small value of x. For larger values, first compute x = x % (2 * pi). >>> print(cos(Decimal('0.5'))) 0.8775825618903727161162815826 >>> print(cos(0.5)) 0.87758256189 >>> print(cos(0.5+0j)) (0.87758256189+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 0, 0, 1, 1, 1, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s def sin(x): """Return the sine of x as measured in radians. The Taylor series approximation works best for a small value of x. For larger values, first compute x = x % (2 * pi). >>> print(sin(Decimal('0.5'))) 0.4794255386042030002732879352 >>> print(sin(0.5)) 0.479425538604 >>> print(sin(0.5+0j)) (0.479425538604+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 1, 0, x, 1, x, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s
sv: def moneyfmt(värde, places=2, curr='', sep=',', dp='.'', pos='', neg='-', trailneg=''): """Konvertera decimaltal till en sträng i penningformat. places: önskat antal platser efter decimaltecknet curr: valfri valutasymbol före tecknet (kan vara tom) sep: valfri grupperingsavskiljare (kommatecken, punkt, mellanslag eller blank) dp: decimalpunktsindikator (kommatecken eller punkt) anges endast som blank när places är noll pos: valfritt tecken för positiva tal: "+", mellanslag eller blanksteg neg: valfritt tecken för negativa tal: '-', '(', mellanslag eller blanksteg trailneg: valfri indikator för efterföljande minus: '-', ')', mellanslag eller blank >>> d = Decimal('-1234567.8901') >>> moneyfmt(d, curr='$') '-$1,234,567.89' >>> moneyfmt(d, places=0, sep='.', dp='', neg='', trailneg='-') '1.234.568-' >>> moneyfmt(d, curr='$', neg='(', trailneg=')') '($1,234,567.89)' >>> moneyfmt(Decimal(123456789), sep=' ') '123 456 789.00' >>> moneyfmt(Decimal('-0,02'), neg='<', trailneg='>') '<0.02>' """ q = Decimal(10) ** -platser # 2 platser --> '0,01' tecken, siffror, exp = värde.quantize(q).as_tuple() resultat = [] digits = list(map(str, digits)) build, nästa = result.append, digits.pop om tecken: build(trailneg) för i i intervall(platser): build(next() if siffror else '0') if platser: build(dp) om inte siffror: build('0') i = 0 medan siffror: build(nästa()) i += 1 if i == 3 and digits: i = 0 build(sep) build(curr) build(neg if tecken else pos) return ''.join(reversed(resultat)) def pi(): """Beräkna Pi med aktuell precision. >>> print(pi()) 3.141592653589793238462643383 """ getcontext().prec += 2 # extra siffror för mellanliggande steg three = Decimal(3) # ersätt "three=3.0" för vanliga flyttal lasts, t, s, n, na, d, da = 0, three, 3, 1, 0, 0, 24 while s != lasts: sista = s n, na = n+na, na+8 d, da = d+da, da+32 t = (t * n) / d s += t getcontext().prec -= 2 return +s # unary plus tillämpar den nya precisionen def exp(x): """Returnerar e upphöjt till potensen av x. Resultattypen matchar indatatypen. >>> print(exp(Decimal(1)))) 2.718281828459045235360287471 >>> print(exp(Decimal(2)))) 7.389056098930650227230427461 >>> Skriv ut(exp(2,0)) 7.38905609893 >>> skriv ut(exp(2+0j)) (7.38905609893+0j) """ getcontext().prec += 2 i, lasts, s, fact, num = 0, 0, 1, 1, 1, 1 while s != lasts: sista = s i += 1 fakta *= i num *= x s += num / fakta getcontext().prec -= 2 returnera +s def cos(x): """Returnerar cosinus för x mätt i radianer. Taylorseriens approximation fungerar bäst för ett litet värde på x. För större värden beräknar du först x = x % (2 * pi). >>> print(cos(Decimal('0,5'))) 0.8775825618903727161162815826 >>> Skriv ut(cos(0,5)) 0.87758256189 >>> Skriv ut(cos(0,5+0j)) (0.87758256189+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 0, 0, 1, 1, 1, 1, 1 medan s != sista: sista = s i += 2 fakta *= i * (i-1) num *= x * x tecken *= -1 s += num / fact * tecken getcontext().prec -= 2 returnera +s def sin(x): """Returnerar sinus för x mätt i radianer. Taylorseriens approximation fungerar bäst för ett litet värde på x. För större värden beräknar du först x = x % (2 * pi). >>> print(sin(Decimal('0,5'))) 0.4794255386042030002732879352 >>> Skriv ut(sin(0,5)) 0.479425538604 >>> Skriv ut(sin(0,5+0j)) (0.479425538604+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 1, 0, x, 1, x, 1 medan s != sista: sista = s i += 2 fakta *= i * (i-1) num *= x * x tecken *= -1 s += num / fact * tecken getcontext().prec -= 2 returnera +s

source: Q. It is cumbersome to type ``decimal.Decimal('1234.5')``. Is there a way to minimize typing when using the interactive interpreter?
sv: Q. Det är besvärligt att skriva ``decimal.Decimal('1234.5')``. Finns det något sätt att minimera skrivandet när man använder den interaktiva tolken?

source: A. Some users abbreviate the constructor to just a single letter:
sv: A. Vissa användare förkortar konstruktören till bara en enda bokstav:

source: Q. In a fixed-point application with two decimal places, some inputs have many places and need to be rounded. Others are not supposed to have excess digits and need to be validated. What methods should be used?
sv: Q. I en fastpunktsapplikation med två decimaler har vissa indata många decimaler och måste avrundas. Andra ska inte ha överflödiga siffror och måste valideras. Vilka metoder bör användas?

source: A. The :meth:`~Decimal.quantize` method rounds to a fixed number of decimal places. If the :const:`Inexact` trap is set, it is also useful for validation:
sv: A. Metoden :meth:`~Decimal.quantize` avrundar till ett fast antal decimaler. Om :const:`Inexact`-fällan är inställd är den också användbar för validering:

source: Q. Once I have valid two place inputs, how do I maintain that invariant throughout an application?
sv: Q. När jag väl har giltiga tvåplatsinmatningar, hur behåller jag den invariansen genom en applikation?

source: A. Some operations like addition, subtraction, and multiplication by an integer will automatically preserve fixed point. Others operations, like division and non-integer multiplication, will change the number of decimal places and need to be followed-up with a :meth:`~Decimal.quantize` step:
sv: A. Vissa operationer, som addition, subtraktion och multiplikation med ett heltal, bevarar automatiskt fixpunkten. Andra operationer, t.ex. division och multiplikation med annat än heltal, ändrar antalet decimaler och måste följas upp med ett :meth:`~Decimal.quantize`-steg:

source: In developing fixed-point applications, it is convenient to define functions to handle the :meth:`~Decimal.quantize` step:
sv: Vid utveckling av fastpunktstillämpningar är det praktiskt att definiera funktioner för att hantera :meth:`~Decimal.quantize`-steget:

source: Q. There are many ways to express the same value. The numbers ``200``, ``200.000``, ``2E2``, and ``.02E+4`` all have the same value at various precisions. Is there a way to transform them to a single recognizable canonical value?
sv: Q. Det finns många sätt att uttrycka samma värde. Siffrorna ``200``, ``200.000``, ``2E2`` och ``.02E+4`` har alla samma värde med olika noggrannhet. Finns det något sätt att omvandla dem till ett enda igenkännbart kanoniskt värde?
