Repository: yeager/python-docs-sv
Catalog: library/decimal.po
Languages: sv

source: The purpose of the *context* argument is determining what to do if *value* is a malformed string. If the context traps :const:`InvalidOperation`, an exception is raised; otherwise, the constructor returns a new Decimal with the value of ``NaN``.
sv: Syftet med argumentet *context* är att bestämma vad som ska göras om *value* är en felformad sträng. Om kontexten fångar :const:`InvalidOperation`, väcks ett undantag; i annat fall returnerar konstruktören en ny Decimal med värdet ``NaN``.

source: Once constructed, :class:`Decimal` objects are immutable.
sv: När :class:`Decimal`-objekt har konstruerats är de oföränderliga.

source: The argument to the constructor is now permitted to be a :class:`float` instance.
sv: Argumentet till konstruktören får nu vara en :class:`float`-instans.

source: :class:`float` arguments raise an exception if the :exc:`FloatOperation` trap is set. By default the trap is off.
sv: :class:`float`-argument ger upphov till ett undantag om :exc:`FloatOperation`-fällan är inställd. Som standard är fällan avstängd.

source: Underscores are allowed for grouping, as with integral and floating-point literals in code.
sv: Underscores är tillåtna för gruppering, som med integral- och flyttalslitteraler i kod.

source: Decimal floating-point objects share many properties with the other built-in numeric types such as :class:`float` and :class:`int`. All of the usual math operations and special methods apply. Likewise, decimal objects can be copied, pickled, printed, used as dictionary keys, used as set elements, compared, sorted, and coerced to another type (such as :class:`float` or :class:`int`).
sv: Decimala flyttalsobjekt delar många egenskaper med de andra inbyggda numeriska typerna, t.ex. :class:`float` och :class:`int`. Alla vanliga matematiska operationer och specialmetoder gäller. På samma sätt kan decimalobjekt kopieras, betas, skrivas ut, användas som ordboksnycklar, användas som set-element, jämföras, sorteras och tvingas till en annan typ (t.ex. :class:`float` eller :class:`int`).

source: There are some small differences between arithmetic on Decimal objects and arithmetic on integers and floats. When the remainder operator ``%`` is applied to Decimal objects, the sign of the result is the sign of the *dividend* rather than the sign of the divisor::
sv: Det finns några små skillnader mellan aritmetik på decimalobjekt och aritmetik på heltal och flyttal. När restoperatorn ``%`` används på decimalobjekt är resultatets tecken tecknet på *divisorn* i stället för tecknet på divisorn::

source: The integer division operator ``//`` behaves analogously, returning the integer part of the true quotient (truncating towards zero) rather than its floor, so as to preserve the usual identity ``x == (x // y) * y + x % y``::
sv: Operatorn för heltalsdivision ``//`` fungerar på samma sätt och returnerar heltalsdelen av den verkliga kvoten (trunkerad mot noll) i stället för dess golv, så att den vanliga identiteten ``x == (x // y) * y + x % y`` bevaras::

source: The ``%`` and ``//`` operators implement the ``remainder`` and ``divide-integer`` operations (respectively) as described in the specification.
sv: Operatorerna ``%`` och ``//`` implementerar operationerna ``remainder`` respektive ``divide-integer`` enligt beskrivningen i specifikationen.

source: Decimal objects cannot generally be combined with floats or instances of :class:`fractions.Fraction` in arithmetic operations: an attempt to add a :class:`Decimal` to a :class:`float`, for example, will raise a :exc:`TypeError`. However, it is possible to use Python's comparison operators to compare a :class:`Decimal` instance ``x`` with another number ``y``. This avoids confusing results when doing equality comparisons between numbers of different types.
sv: Decimalobjekt kan i allmänhet inte kombineras med float eller instanser av :class:`fractions.Fraction` i aritmetiska operationer: ett försök att lägga till en :class:`Decimal` till en :class:`float`, till exempel, kommer att ge upphov till ett :exc:`TypeError`. Det är dock möjligt att använda Pythons jämförelseoperatorer för att jämföra en :class:`Decimal`-instans ``x`` med ett annat tal ``y``. Detta undviker förvirrande resultat när man gör jämlikhetsjämförelser mellan tal av olika typer.

source: Mixed-type comparisons between :class:`Decimal` instances and other numeric types are now fully supported.
sv: Jämförelser av blandade typer mellan :class:`Decimal`-instanser och andra numeriska typer stöds nu fullt ut.

source: In addition to the standard numeric properties, decimal floating-point objects also have a number of specialized methods:
sv: Förutom de numeriska standardegenskaperna har decimala flyttalsobjekt också ett antal specialiserade metoder:

source: Return the adjusted exponent after shifting out the coefficient's rightmost digits until only the lead digit remains: ``Decimal('321e+5').adjusted()`` returns seven. Used for determining the position of the most significant digit with respect to the decimal point.
sv: Returnerar den justerade exponenten efter att koefficientens högra siffror har flyttats ut tills endast den första siffran återstår: ``Decimal('321e+5').adjusted()`` returnerar sju. Används för att bestämma positionen för den mest signifikanta siffran i förhållande till decimaltecknet.

source: Return a pair ``(n, d)`` of integers that represent the given :class:`Decimal` instance as a fraction, in lowest terms and with a positive denominator::
sv: Returnerar ett par ``(n, d)`` av heltal som representerar den givna :class:`Decimal`-instansen som ett bråk, i lägsta termer och med en positiv nämnare::

source: The conversion is exact. Raise OverflowError on infinities and ValueError on NaNs.
sv: Omvandlingen är exakt. Ge upphov till OverflowError för oändligheter och ValueError för NaNs.

source: Return a :term:`named tuple` representation of the number: ``DecimalTuple(sign, digits, exponent)``.
sv: Returnera en :term:`named tuple` representation av talet: ``DecimalTuple(sign, digits, exponent)``.

source: Return the canonical encoding of the argument. Currently, the encoding of a :class:`Decimal` instance is always canonical, so this operation returns its argument unchanged.
sv: Returnerar den kanoniska kodningen av argumentet. För närvarande är kodningen av en :class:`Decimal`-instans alltid kanonisk, så denna operation returnerar sitt argument oförändrat.

source: Compare the values of two Decimal instances. :meth:`compare` returns a Decimal instance, and if either operand is a NaN then the result is a NaN::
sv: Jämför värdena för två decimalinstanser. :meth:`compare` returnerar en decimalinstans, och om någon av operanderna är ett NaN blir resultatet ett NaN::

source: a or b is a NaN ==> Decimal('NaN') a < b ==> Decimal('-1') a == b ==> Decimal('0') a > b ==> Decimal('1')
sv: a eller b är en NaN ==> Decimal('NaN') a < b ==> Decimal('-1') a == b ==> Decimal('0') a > b ==> Decimal('1')

source: This operation is identical to the :meth:`compare` method, except that all NaNs signal. That is, if neither operand is a signaling NaN then any quiet NaN operand is treated as though it were a signaling NaN.
sv: Denna operation är identisk med metoden :meth:`compare`, förutom att alla NaN signalerar. Det vill säga, om ingen av operanderna är ett signalerande NaN, behandlas varje tyst NaN-operand som om det vore ett signalerande NaN.

source: Compare two operands using their abstract representation rather than their numerical value. Similar to the :meth:`compare` method, but the result gives a total ordering on :class:`Decimal` instances. Two :class:`Decimal` instances with the same numeric value but different representations compare unequal in this ordering:
sv: Jämför två operander med hjälp av deras abstrakta representation snarare än deras numeriska värde. Liknar metoden :meth:`compare`, men resultatet ger en total ordning på :class:`Decimal`-instanser. Två :class:`Decimal`-instanser med samma numeriska värde men olika representationer jämförs ojämlikt i denna ordning:

source: Quiet and signaling NaNs are also included in the total ordering. The result of this function is ``Decimal('0')`` if both operands have the same representation, ``Decimal('-1')`` if the first operand is lower in the total order than the second, and ``Decimal('1')`` if the first operand is higher in the total order than the second operand. See the specification for details of the total order.
sv: Tysta och signalerande NaNs ingår också i den totala ordningen. Resultatet av denna funktion är ``Decimal('0')`` om båda operanderna har samma representation, ``Decimal('-1')`` om den första operanden är lägre i den totala ordningen än den andra, och ``Decimal('1')`` om den första operanden är högre i den totala ordningen än den andra operanden. Se specifikationen för detaljer om den totala ordningen.

source: This operation is unaffected by context and is quiet: no flags are changed and no rounding is performed. As an exception, the C version may raise InvalidOperation if the second operand cannot be converted exactly.
sv: Denna operation påverkas inte av kontexten och är tyst: inga flaggor ändras och ingen avrundning utförs. Som ett undantag kan C-versionen ge upphov till InvalidOperation om den andra operanden inte kan konverteras exakt.

source: Compare two operands using their abstract representation rather than their value as in :meth:`compare_total`, but ignoring the sign of each operand. ``x.compare_total_mag(y)`` is equivalent to ``x.copy_abs().compare_total(y.copy_abs())``.
sv: Jämför två operander med hjälp av deras abstrakta representation i stället för deras värde som i :meth:`compare_total`, men ignorerar tecknet för varje operand. ``x.compare_total_mag(y)`` är ekvivalent med ``x.copy_abs().compare_total(y.copy_abs())``.

source: Just returns self, this method is only to comply with the Decimal Specification.
sv: Returnerar bara self, denna metod är endast till för att uppfylla Decimal Specification.

source: Return the absolute value of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
sv: Returnerar argumentets absoluta värde. Denna operation påverkas inte av kontexten och är tyst: inga flaggor ändras och ingen avrundning utförs.

source: Return the negation of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
sv: Returnerar negationen av argumentet. Denna operation påverkas inte av kontexten och är tyst: inga flaggor ändras och ingen avrundning utförs.

source: Return a copy of the first operand with the sign set to be the same as the sign of the second operand. For example:
sv: Returnerar en kopia av det första operandet med tecknet satt till samma som tecknet för det andra operandet. Till exempel

source: Return the value of the (natural) exponential function ``e**x`` at the given number. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
sv: Returnerar värdet av den (naturliga) exponentialfunktionen ``e**x`` vid det angivna talet. Resultatet avrundas korrekt med hjälp av avrundningsläget :const:`ROUND_HALF_EVEN`.

source: Alternative constructor that only accepts instances of :class:`float` or :class:`int`.
sv: Alternativ konstruktör som endast accepterar instanser av :class:`float` eller :class:`int`.

source: Note ``Decimal.from_float(0.1)`` is not the same as ``Decimal('0.1')``. Since 0.1 is not exactly representable in binary floating point, the value is stored as the nearest representable value which is ``0x1.999999999999ap-4``. That equivalent value in decimal is ``0.1000000000000000055511151231257827021181583404541015625``.
sv: Observera att ``Decimal.from_float(0.1)`` inte är detsamma som ``Decimal('0.1')``. Eftersom 0,1 inte är exakt representerbart i binär flyttal lagras värdet som det närmaste representerbara värdet som är ``0x1.999999999999ap-4``. Det motsvarande värdet i decimal är "0,1000000000000000055511151231257827021181583404541015625".

source: From Python 3.2 onwards, a :class:`Decimal` instance can also be constructed directly from a :class:`float`.
sv: Från Python 3.2 och framåt kan en :class:`Decimal`-instans också konstrueras direkt från en :class:`float`.

source: >>> Decimal.from_float(0.1) Decimal('0.1000000000000000055511151231257827021181583404541015625') >>> Decimal.from_float(float('nan')) Decimal('NaN') >>> Decimal.from_float(float('inf')) Decimal('Infinity') >>> Decimal.from_float(float('-inf')) Decimal('-Infinity')
sv: >>> Decimal.from_float(0.1) Decimal('0.1000000000000000055511151231257827021181583404541015625') >>> Decimal.from_float(float('nan')) Decimal('NaN') >>> Decimal.from_float(float('inf')) Decimal('Infinity') >>> Decimal.from_float(float('-inf')) Decimal('-Oändlighet')

source: Alternative constructor that only accepts instances of :class:`float`, :class:`int` or :class:`Decimal`, but not strings or tuples.
sv: Alternativ konstruktör som endast accepterar instanser av :class:`float`, :class:`int` eller :class:`Decimal`, men inte strängar eller tupler.

source: Fused multiply-add. Return self*other+third with no rounding of the intermediate product self*other.
sv: Fusionerad multiplicera-add. Returnera self*other+third utan avrundning av mellanprodukten self*other.

source: Return :const:`True` if the argument is canonical and :const:`False` otherwise. Currently, a :class:`Decimal` instance is always canonical, so this operation always returns :const:`True`.
sv: Returnerar :const:`True` om argumentet är kanoniskt och :const:`False` annars. För närvarande är en :class:`Decimal`-instans alltid kanonisk, så denna operation returnerar alltid :const:`True`.

source: Return :const:`True` if the argument is a finite number, and :const:`False` if the argument is an infinity or a NaN.
sv: Returnerar :const:`True` om argumentet är ett ändligt tal, och :const:`False` om argumentet är oändligt eller NaN.

source: Return :const:`True` if the argument is either positive or negative infinity and :const:`False` otherwise.
sv: Returnerar :const:`True` om argumentet är antingen positiv eller negativ oändlighet och :const:`False` annars.

source: Return :const:`True` if the argument is a (quiet or signaling) NaN and :const:`False` otherwise.
sv: Returnerar :const:`True` om argumentet är en (tyst eller signalerande) NaN och :const:`False` annars.

source: Return :const:`True` if the argument is a *normal* finite number. Return :const:`False` if the argument is zero, subnormal, infinite or a NaN.
sv: Returnerar :const:`True` om argumentet är ett *normalt* ändligt tal. Returnerar :const:`False` om argumentet är noll, subnormalt, oändligt eller ett NaN.

source: Return :const:`True` if the argument is a quiet NaN, and :const:`False` otherwise.
sv: Returnerar :const:`True` om argumentet är ett tyst NaN, och :const:`False` i annat fall.

source: Return :const:`True` if the argument has a negative sign and :const:`False` otherwise. Note that zeros and NaNs can both carry signs.
sv: Returnerar :const:`True` om argumentet har ett negativt tecken och :const:`False` annars. Observera att både nollor och NaNs kan ha tecken.

source: Return :const:`True` if the argument is a signaling NaN and :const:`False` otherwise.
sv: Returnerar :const:`True` om argumentet är en NaN-signal och :const:`False` annars.

source: Return :const:`True` if the argument is subnormal, and :const:`False` otherwise.
sv: Returnerar :const:`True` om argumentet är subnormal, och :const:`False` annars.

source: Return :const:`True` if the argument is a (positive or negative) zero and :const:`False` otherwise.
sv: Returnerar :const:`True` om argumentet är en (positiv eller negativ) nolla och :const:`False` annars.

source: Return the natural (base e) logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
sv: Returnerar den naturliga (bas e) logaritmen av operanden. Resultatet avrundas korrekt med hjälp av avrundningsläget :const:`ROUND_HALF_EVEN`.

source: Return the base ten logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
sv: Returnerar bas tio logaritmen av operanden. Resultatet är korrekt avrundat med :const:`ROUND_HALF_EVEN` avrundningsläge.

source: For a nonzero number, return the adjusted exponent of its operand as a :class:`Decimal` instance. If the operand is a zero then ``Decimal('-Infinity')`` is returned and the :const:`DivisionByZero` flag is raised. If the operand is an infinity then ``Decimal('Infinity')`` is returned.
sv: För ett tal som inte är noll, returneras den justerade exponenten för operanden som en :class:`Decimal`-instans. Om operanden är en nolla returneras ``Decimal('-Infinity')`` och flaggan :const:`DivisionByZero`` aktiveras. Om operanden är en oändlighet returneras ``Decimal('Infinity')``.

source: :meth:`logical_and` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``and`` of the two operands.
sv: :meth:`logical_and` är en logisk operation som tar två *logiska operander* (se :ref:`logical_operands_label`). Resultatet är det siffervisa ``och`` av de två operanderna.

source: :meth:`logical_invert` is a logical operation. The result is the digit-wise inversion of the operand.
sv: :meth:`logical_invert` är en logisk operation. Resultatet är den siffermässiga inverteringen av operanden.

source: :meth:`logical_or` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``or`` of the two operands.
sv: :meth:`logical_or` är en logisk operation som tar två *logiska operander* (se :ref:`logical_operands_label`). Resultatet är det siffervisa ``eller`` av de två operanderna.

source: :meth:`logical_xor` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise exclusive or of the two operands.
sv: :meth:`logical_xor` är en logisk operation som tar två *logiska operander* (se :ref:`logical_operands_label`). Resultatet är det siffermässigt uteslutande eller av de två operanderna.

source: Like ``max(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
sv: Som ``max(self, other)`` förutom att kontextens avrundningsregel tillämpas innan den returneras och att ``NaN``-värden antingen signaleras eller ignoreras (beroende på kontexten och om de är signalerande eller tysta).

source: Similar to the :meth:`.max` method, but the comparison is done using the absolute values of the operands.
sv: Påminner om metoden :meth:`.max`, men jämförelsen görs med hjälp av operandernas absoluta värden.

source: Like ``min(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
sv: Som ``min(self, other)`` förutom att kontextens avrundningsregel tillämpas innan den returneras och att ``NaN``-värden antingen signaleras eller ignoreras (beroende på kontexten och om de är signalerande eller tysta).

source: Similar to the :meth:`.min` method, but the comparison is done using the absolute values of the operands.
sv: Påminner om metoden :meth:`.min`, men jämförelsen görs med hjälp av operandernas absoluta värden.

source: Return the largest number representable in the given context (or in the current thread's context if no context is given) that is smaller than the given operand.
sv: Returnerar det största tal som kan representeras i den givna kontexten (eller i den aktuella trådens kontext om ingen kontext anges) som är mindre än den givna operanden.

source: Return the smallest number representable in the given context (or in the current thread's context if no context is given) that is larger than the given operand.
sv: Returnerar det minsta tal som kan representeras i den givna kontexten (eller i den aktuella trådens kontext om ingen kontext anges) som är större än den givna operanden.

source: If the two operands are unequal, return the number closest to the first operand in the direction of the second operand. If both operands are numerically equal, return a copy of the first operand with the sign set to be the same as the sign of the second operand.
sv: Om de två operanderna är olika, returneras det tal som ligger närmast den första operanden i riktning mot den andra operanden. Om båda operanderna är numeriskt lika, returneras en kopia av den första operanden med tecknet satt till samma som tecknet för den andra operanden.

source: Used for producing canonical values of an equivalence class within either the current context or the specified context.
sv: Används för att producera kanoniska värden för en ekvivalensklass inom antingen den aktuella kontexten eller den angivna kontexten.

source: This has the same semantics as the unary plus operation, except that if the final result is finite it is reduced to its simplest form, with all trailing zeros removed and its sign preserved. That is, while the coefficient is non-zero and a multiple of ten the coefficient is divided by ten and the exponent is incremented by 1. Otherwise (the coefficient is zero) the exponent is set to 0. In all cases the sign is unchanged.
sv: Detta har samma semantik som den unära plusoperationen, förutom att om slutresultatet är ändligt reduceras det till sin enklaste form, med alla efterföljande nollor borttagna och dess tecken bevarat. Det vill säga, om koefficienten inte är noll och är en multipel av tio divideras koefficienten med tio och exponenten ökas med 1. I annat fall (koefficienten är noll) sätts exponenten till 0. I samtliga fall är tecknet oförändrat.

source: For example, ``Decimal('32.100')`` and ``Decimal('0.321000e+2')`` both normalize to the equivalent value ``Decimal('32.1')``.
sv: Till exempel normaliseras ``Decimal('32.100')`` och ``Decimal('0.321000e+2')`` båda till det likvärdiga värdet ``Decimal('32.1')``.

source: Note that rounding is applied *before* reducing to simplest form.
sv: Observera att avrundning görs *innan* reducering till enklaste form.

source: In the latest versions of the specification, this operation is also known as ``reduce``.
sv: I de senaste versionerna av specifikationen kallas denna operation även för "reducera".

source: Return a string describing the *class* of the operand. The returned value is one of the following ten strings.
sv: Returnerar en sträng som beskriver operandens *klass*. Det returnerade värdet är en av följande tio strängar.

source: ``"-Infinity"``, indicating that the operand is negative infinity.
sv: ``"-Infinity"``, vilket indikerar att operanden är negativ oändlighet.

source: ``"-Normal"``, indicating that the operand is a negative normal number.
sv: ``"-Normal"``, vilket indikerar att operanden är ett negativt normaltal.

source: ``"-Subnormal"``, indicating that the operand is negative and subnormal.
sv: ``"-Subnormal"``, vilket indikerar att operanden är negativ och subnormal.

source: ``"-Zero"``, indicating that the operand is a negative zero.
sv: ``"-Zero"``, vilket indikerar att operanden är en negativ nolla.

source: ``"+Zero"``, indicating that the operand is a positive zero.
sv: ``"+Zero"``, vilket indikerar att operanden är en positiv nolla.

source: ``"+Subnormal"``, indicating that the operand is positive and subnormal.
sv: ``"+Subnormal"``, vilket indikerar att operanden är positiv och subnormal.

source: ``"+Normal"``, indicating that the operand is a positive normal number.
sv: ``"+Normal"``, vilket indikerar att operanden är ett positivt normalt tal.
