Repository: yeager/python-docs-sv
Catalog: library/devmode.po
Languages: sv

source: Python Development Mode
sv: Python-utvecklingsläge

source: The Python Development Mode introduces additional runtime checks that are too expensive to be enabled by default. It should not be more verbose than the default if the code is correct; new warnings are only emitted when an issue is detected.
sv: Python Development Mode introducerar ytterligare körtidskontroller som är för dyra för att aktiveras som standard. Det bör inte vara mer mångordigt än standardvärdet om koden är korrekt; nya varningar utfärdas endast när ett problem upptäcks.

source: It can be enabled using the :option:`-X dev <-X>` command line option or by setting the :envvar:`PYTHONDEVMODE` environment variable to ``1``.
sv: Det kan aktiveras med kommandoradsalternativet :option:`-X dev <-X>` eller genom att ställa in miljövariabeln :envvar:`PYTHONDEVMODE` till ``1``.

source: See also :ref:`Python debug build <debug-build>`.
sv: Se även :ref:`Python debug build <debug-build>`.

source: Effects of the Python Development Mode
sv: Effekter av Pythons utvecklingsläge

source: Enabling the Python Development Mode is similar to the following command, but with additional effects described below::
sv: Aktivering av Python Development Mode liknar följande kommando, men med ytterligare effekter som beskrivs nedan::

source: Effects of the Python Development Mode:
sv: Effekter av Pythons utvecklingsläge:

source: Add ``default`` :ref:`warning filter <describing-warning-filters>`. The following warnings are shown:
sv: Lägg till ``default`` :ref:`warning filter <describing-warning-filters>`. Följande varningar visas:

source: Normally, the above warnings are filtered by the default :ref:`warning filters <describing-warning-filters>`.
sv: Normalt filtreras ovanstående varningar med standard :ref:`warning filters <describing-warning-filters>`.

source: It behaves as if the :option:`-W default <-W>` command line option is used.
sv: Det beter sig som om kommandoradsalternativet :option:`-W default <-W>` används.

source: Use the :option:`-W error <-W>` command line option or set the :envvar:`PYTHONWARNINGS` environment variable to ``error`` to treat warnings as errors.
sv: Använd kommandoradsalternativet :option:`-W error <-W>` eller sätt miljövariabeln :envvar:`PYTHONWARNINGS` till `error`` för att behandla varningar som fel.

source: Install debug hooks on memory allocators to check for:
sv: Installera felsökningskrokar på minnesallokatorer för att kontrollera:

source: Buffer underflow
sv: Underflöde i buffert

source: Buffer overflow
sv: Buffertöverfyllnad

source: Memory allocator API violation
sv: Överträdelse av API för minnesallokering

source: Unsafe usage of the GIL
sv: Osäker användning av GIL

source: See the :c:func:`PyMem_SetupDebugHooks` C function.
sv: Se C-funktionen :c:func:`PyMem_SetupDebugHooks`.

source: It behaves as if the :envvar:`PYTHONMALLOC` environment variable is set to ``debug``.
sv: Det beter sig som om miljövariabeln :envvar:`PYTHONMALLOC` är inställd på ``debug``.

source: To enable the Python Development Mode without installing debug hooks on memory allocators, set the :envvar:`PYTHONMALLOC` environment variable to ``default``.
sv: För att aktivera Python Development Mode utan att installera debug-krokar på minnesallokatorer, ställ in miljövariabeln :envvar:`PYTHONMALLOC` till ``default``.

source: Call :func:`faulthandler.enable` at Python startup to install handlers for the :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` and :const:`~signal.SIGILL` signals to dump the Python traceback on a crash.
sv: Anropa :func:`faulthandler.enable` vid Python-start för att installera hanterare för signalerna :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` och :const:`~signal.SIGILL` för att dumpa Python-traceback vid en krasch.

source: It behaves as if the :option:`-X faulthandler <-X>` command line option is used or if the :envvar:`PYTHONFAULTHANDLER` environment variable is set to ``1``.
sv: Det beter sig som om kommandoradsalternativet :option:`-X faulthandler <-X>` används eller om miljövariabeln :envvar:`PYTHONFAULTHANDLER` är satt till ``1``.

source: Enable :ref:`asyncio debug mode <asyncio-debug-mode>`. For example, :mod:`asyncio` checks for coroutines that were not awaited and logs them.
sv: Aktivera :ref:`asyncio felsökningsläge <asyncio-debug-mode>`. Till exempel kontrollerar :mod:`asyncio` om det finns coroutines som inte var väntade och loggar dem.

source: It behaves as if the :envvar:`PYTHONASYNCIODEBUG` environment variable is set to ``1``.
sv: Det beter sig som om miljövariabeln :envvar:`PYTHONASYNCIODEBUG` är inställd på ``1``.

source: Check the *encoding* and *errors* arguments for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
sv: Kontrollera argumenten *encoding* och *errors* för strängkodnings- och avkodningsoperationer. Exempel: :func:`open`, :meth:`str.encode` och :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings.
sv: Som standard, för bästa prestanda, kontrolleras *errors*-argumentet endast vid det första kodnings-/avkodningsfelet och *encoding*-argumentet ignoreras ibland för tomma strängar.

source: The :class:`io.IOBase` destructor logs ``close()`` exceptions.
sv: Destruktorn för :class:`io.IOBase` loggar ``close()`` undantag.

source: Set the :attr:`~sys.flags.dev_mode` attribute of :data:`sys.flags` to ``True``.
sv: Sätt attributet :attr:`~sys.flags.dev_mode` i :data:`sys.flags` till ``True``.

source: The Python Development Mode does not enable the :mod:`tracemalloc` module by default, because the overhead cost (to performance and memory) would be too large. Enabling the :mod:`tracemalloc` module provides additional information on the origin of some errors. For example, :exc:`ResourceWarning` logs the traceback where the resource was allocated, and a buffer overflow error logs the traceback where the memory block was allocated.
sv: I Pythons utvecklingsläge aktiveras inte modulen :mod:`tracemalloc` som standard, eftersom kostnaden (för prestanda och minne) skulle bli för stor. Om du aktiverar modulen :mod:`tracemalloc` får du ytterligare information om ursprunget till vissa fel. Till exempel loggar :exc:`ResourceWarning` spårningen där resursen allokerades, och ett buffer overflow-fel loggar spårningen där minnesblocket allokerades.

source: The Python Development Mode does not prevent the :option:`-O` command line option from removing :keyword:`assert` statements nor from setting :const:`__debug__` to ``False``.
sv: Python Development Mode hindrar inte kommandoradsalternativet :option:`-O` från att ta bort :keyword:`assert`-satser eller från att sätta :const:`__debug__` till ``False``.

source: The Python Development Mode can only be enabled at the Python startup. Its value can be read from :data:`sys.flags.dev_mode <sys.flags>`.
sv: Pythons utvecklingsläge kan endast aktiveras när Python startas. Dess värde kan läsas från :data:`sys.flags.dev_mode <sys.flags>`.

source: The :class:`io.IOBase` destructor now logs ``close()`` exceptions.
sv: Destruktorn :class:`io.IOBase` loggar nu ``close()``-undantag.

source: The *encoding* and *errors* arguments are now checked for string encoding and decoding operations.
sv: Argumenten *encoding* och *errors* kontrolleras nu för kodning och avkodning av strängar.

source: ResourceWarning Example
sv: Exempel på ResourceWarning

source: Example of a script counting the number of lines of the text file specified in the command line::
sv: Exempel på ett skript som räknar antalet rader i den textfil som anges på kommandoraden::

source: The script does not close the file explicitly. By default, Python does not emit any warning. Example using README.txt, which has 269 lines:
sv: Skriptet stänger inte filen explicit. Som standard ger Python inte ut någon varning. I exemplet används README.txt, som har 269 rader:

source: Enabling the Python Development Mode displays a :exc:`ResourceWarning` warning:
sv: Om du aktiverar Python Development Mode visas en :exc:`ResourceWarning`-varning:

source: In addition, enabling :mod:`tracemalloc` shows the line where the file was opened:
sv: Om du aktiverar :mod:`tracemalloc` visas dessutom den rad där filen öppnades:

source: The fix is to close explicitly the file. Example using a context manager::
sv: Lösningen är att stänga filen explicit. Exempel med hjälp av en kontexthanterare::

source: Not closing a resource explicitly can leave a resource open for way longer than expected; it can cause severe issues upon exiting Python. It is bad in CPython, but it is even worse in PyPy. Closing resources explicitly makes an application more deterministic and more reliable.
sv: Att inte stänga en resurs explicit kan lämna en resurs öppen mycket längre än förväntat; det kan orsaka allvarliga problem när Python avslutas. Det är illa i CPython, men det är ännu värre i PyPy. Att stänga resurser explicit gör en applikation mer deterministisk och mer tillförlitlig.

source: Bad file descriptor error example
sv: Exempel på fel i dålig filbeskrivare

source: Script displaying the first line of itself::
sv: Skriptet visar den första raden av sig själv::

source: By default, Python does not emit any warning:
sv: Som standard ger Python inte ut någon varning:

source: The Python Development Mode shows a :exc:`ResourceWarning` and logs a "Bad file descriptor" error when finalizing the file object:
sv: Python Development Mode visar en :exc:`ResourceWarning` och loggar ett "Bad file descriptor"-fel när filobjektet slutförs:

source: ``os.close(fp.fileno())`` closes the file descriptor. When the file object finalizer tries to close the file descriptor again, it fails with the ``Bad file descriptor`` error. A file descriptor must be closed only once. In the worst case scenario, closing it twice can lead to a crash (see :issue:`18748` for an example).
sv: ```os.close(fp.fileno())`` stänger filbeskrivaren. När filobjektets slutbehandlare försöker stänga filbeskrivaren igen misslyckas den med felet ``Bad file descriptor``. En file descriptor får bara stängas en gång. I värsta fall kan det leda till en krasch om den stängs två gånger (se :issue:`18748` för ett exempel).

source: The fix is to remove the ``os.close(fp.fileno())`` line, or open the file with ``closefd=False``.
sv: Lösningen är att ta bort raden ``os.close(fp.fileno())`` eller öppna filen med ``closefd=False``.
