Repository: yeager/python-docs-sv
Catalog: library/dis.po
Languages: sv

source: ``True`` if other code jumps to here, otherwise ``False``
sv: ``True`` om annan kod hoppar till här, annars ``False``

source: bytecode index of the jump target if this is a jump operation, otherwise ``None``
sv: bytecode-index för hoppmålet om detta är en hoppoperation, annars ``None``

source: :class:`dis.Positions` object holding the start and end locations that are covered by this instruction.
sv: :class:`dis.Positions`-objekt som innehåller de start- och slutpositioner som omfattas av denna instruktion.

source: Information about the cache entries of this instruction, as triplets of the form ``(name, size, data)``, where the ``name`` and ``size`` describe the cache format and data is the contents of the cache. ``cache_info`` is ``None`` if the instruction does not have caches.
sv: Information om instruktionens cacheposter, som tripletter av formen ``(name, size, data)``, där ``name`` och ``size`` beskriver cacheformatet och data är innehållet i cachen. ``cache_info`` är ``None`` om instruktionen inte har några cacheminnen.

source: Field ``positions`` is added.
sv: Fältet ``positions`` har lagts till.

source: Changed field ``starts_line``.
sv: Ändrat fält ``starts_line``.

source: Added fields ``start_offset``, ``cache_offset``, ``end_offset``, ``baseopname``, ``baseopcode``, ``jump_target``, ``oparg``, ``line_number`` and ``cache_info``.
sv: Lagt till fälten ``start_offset``, ``cache_offset``, ``end_offset``, ``baseopname``, ``baseopcode``, ``jump_target``, ``oparg``, ``line_number`` och ``cache_info``.

source: In case the information is not available, some fields might be ``None``.
sv: Om informationen inte är tillgänglig kan vissa fält vara ``None``.

source: The Python compiler currently generates the following bytecode instructions.
sv: Python-kompilatorn genererar för närvarande följande bytecode-instruktioner.

source: **General instructions**
sv: **Allmänna instruktioner**

source: In the following, We will refer to the interpreter stack as ``STACK`` and describe operations on it as if it was a Python list. The top of the stack corresponds to ``STACK[-1]`` in this language.
sv: I det följande kommer vi att referera till tolkens stack som ``STACK`` och beskriva operationer på den som om den vore en Python-lista. Toppen av stacken motsvarar ``STACK[-1]`` i detta språk.

source: Do nothing code. Used as a placeholder by the bytecode optimizer, and to generate line tracing events.
sv: Gör ingenting-kod. Används som platshållare av bytekodsoptimeraren och för att generera linjespårningshändelser.

source: Removes the top-of-stack item::
sv: Tar bort det översta objektet i stapeln::

source: Removes the top-of-stack item. Equivalent to ``POP_TOP``. Used to clean up at the end of loops, hence the name.
sv: Tar bort det översta objektet i stapeln. Motsvarar ``POP_TOP``. Används för att städa upp i slutet av loopar, därav namnet.

source: Implements ``del STACK[-2]``. Used to clean up when a generator exits.
sv: Implementerar ``del STACK[-2]``. Används för att städa upp när en generator lämnar.

source: Push the i-th item to the top of the stack without removing it from its original location::
sv: Lägg det i:te föremålet överst i högen utan att ta bort det från dess ursprungliga plats::

source: Swap the top of the stack with the i-th element::
sv: Byt ut toppen av stacken mot det i:e elementet::

source: Rather than being an actual instruction, this opcode is used to mark extra space for the interpreter to cache useful data directly in the bytecode itself. It is automatically hidden by all ``dis`` utilities, but can be viewed with ``show_caches=True``.
sv: I stället för att vara en faktisk instruktion används denna opcode för att markera extra utrymme för tolken att cacha användbara data direkt i själva bytekoden. Den döljs automatiskt av alla ``dis``-verktyg, men kan visas med ``show_caches=True``.

source: Logically, this space is part of the preceding instruction. Many opcodes expect to be followed by an exact number of caches, and will instruct the interpreter to skip over them at runtime.
sv: Logiskt sett är detta utrymme en del av den föregående instruktionen. Många opkoder förväntar sig att följas av ett exakt antal cacher, och instruerar tolken att hoppa över dem vid körning.

source: Populated caches can look like arbitrary instructions, so great care should be taken when reading or modifying raw, adaptive bytecode containing quickened data.
sv: Fyllda cacheminnen kan se ut som godtyckliga instruktioner, så stor försiktighet bör iakttas vid läsning eller modifiering av rå, adaptiv bytecode som innehåller quickened data.

source: **Unary operations**
sv: **Unära operationer**

source: Unary operations take the top of the stack, apply the operation, and push the result back on the stack.
sv: Unära operationer tar toppen av stapeln, tillämpar operationen och skjuter tillbaka resultatet på stapeln.

source: Implements ``STACK[-1] = -STACK[-1]``.
sv: Tillämpar ``STACK[-1] = -STACK[-1]``.

source: Implements ``STACK[-1] = not STACK[-1]``.
sv: Tillämpar ``STACK[-1] = not STACK[-1]``.

source: This instruction now requires an exact :class:`bool` operand.
sv: Denna instruktion kräver nu ett exakt :class:`bool`-operand.

source: Implements ``STACK[-1] = ~STACK[-1]``.
sv: Tillämpar ``STACK[-1] = ~STACK[-1]``.

source: Implements ``STACK[-1] = iter(STACK[-1])``.
sv: Tillämpar ``STACK[-1] = iter(STACK[-1])``.

source: If ``STACK[-1]`` is a :term:`generator iterator` or :term:`coroutine` object it is left as is. Otherwise, implements ``STACK[-1] = iter(STACK[-1])``.
sv: Om ``STACK[-1]`` är ett :term:`generator iterator` eller :term:`coroutine` objekt lämnas det som det är. I annat fall implementeras ``STACK[-1] = iter(STACK[-1])``.

source: Implements ``STACK[-1] = bool(STACK[-1])``.
sv: Tillämpar ``STACK[-1] = bool(STACK[-1])``.

source: **Binary and in-place operations**
sv: **Binär- och platsoperationer**

source: Binary operations remove the top two items from the stack (``STACK[-1]`` and ``STACK[-2]``). They perform the operation, then put the result back on the stack.
sv: Binära operationer tar bort de två översta objekten från stacken (``STACK[-1]`` och ``STACK[-2]``). De utför operationen och lägger sedan tillbaka resultatet på stapeln.

source: In-place operations are like binary operations, but the operation is done in-place when ``STACK[-2]`` supports it, and the resulting ``STACK[-1]`` may be (but does not have to be) the original ``STACK[-2]``.
sv: In-place-operationer är som binära operationer, men operationen görs in-place när ``STACK[-2]`` stöder det, och den resulterande ``STACK[-1]`` kan vara (men behöver inte vara) den ursprungliga ``STACK[-2]``.

source: Implements the binary and in-place operators (depending on the value of *op*)::
sv: Implementerar binära och in-place-operatorer (beroende på värdet av *op*)::

source: With oparg :``NB_SUBSCR``, implements binary subscript (replaces opcode ``BINARY_SUBSCR``)
sv: Med oparg :``NB_SUBSCR``, implementerar binärt subscript (ersätter opcode ``BINARY_SUBSCR``)

source: Implements::
sv: Redskap::

source: key = STACK.pop() container = STACK.pop() value = STACK.pop() container[key] = value
sv: nyckel = STACK.pop() container = STACK.pop() värde = STACK.pop() behållare[nyckel] = värde

source: key = STACK.pop() container = STACK.pop() del container[key]
sv: nyckel = STACK.pop() container = STACK.pop() del container[nyckel]

source: end = STACK.pop() start = STACK.pop() container = STACK.pop() STACK.append(container[start:end])
sv: slut = STACK.pop() start = STACK.pop() container = STACK.pop() STACK.append(behållare[start:slut])

source: end = STACK.pop() start = STACK.pop() container = STACK.pop() values = STACK.pop() container[start:end] = value
sv: slut = STACK.pop() start = STACK.pop() behållare = STACK.pop() värden = STACK.pop() behållare[start:slut] = värde

source: **Coroutine opcodes**
sv: **Coroutine-operationskoder**

source: Implements ``STACK[-1] = get_awaitable(STACK[-1])``, where ``get_awaitable(o)`` returns ``o`` if ``o`` is a coroutine object or a generator object with the :data:`~inspect.CO_ITERABLE_COROUTINE` flag, or resolves ``o.__await__``.
sv: Implementerar ``STACK[-1] = get_awaitable(STACK[-1])``, där ``get_awaitable(o)`` returnerar ``o`` om ``o`` är ett coroutine-objekt eller ett generatorobjekt med :data:`~inspect.CO_ITERABLE_COROUTINE`-flaggan, eller löser ``o.__await__``.

source: If the ``where`` operand is nonzero, it indicates where the instruction occurs:
sv: Om operanden ``where`` inte är noll anger den var instruktionen inträffar:

source: ``1``: After a call to ``__aenter__``
sv: ``1``: Efter ett samtal till ``__aenter__``

source: ``2``: After a call to ``__aexit__``
sv: ``2``: Efter ett anrop till ``__aexit__``

source: Previously, this instruction did not have an oparg.
sv: Tidigare hade denna instruktion inte någon oparg.

source: Implements ``STACK[-1] = STACK[-1].__aiter__()``.
sv: Tillämpar ``STACK[-1] = STACK[-1].__aiter__()``.

source: Returning awaitable objects from ``__aiter__`` is no longer supported.
sv: Att returnera väntande objekt från ``__aiter__`` stöds inte längre.

source: Implement ``STACK.append(get_awaitable(STACK[-1].__anext__()))`` to the stack. See ``GET_AWAITABLE`` for details about ``get_awaitable``.
sv: Implementera ``STACK.append(get_awaitable(STACK[-1].__anext__()))`` till stacken. Se ``GET_AWAITABLE`` för detaljer om ``get_awaitable``.

source: Terminates an :keyword:`async for` loop. Handles an exception raised when awaiting a next item. The stack contains the async iterable in ``STACK[-2]`` and the raised exception in ``STACK[-1]``. Both are popped. If the exception is not :exc:`StopAsyncIteration`, it is re-raised.
sv: Avslutar en :keyword:`async for`-slinga. Hanterar ett undantag som uppstår i väntan på nästa objekt. Stapeln innehåller den asynkrona iterabeln i ``STACK[-2]`` och det undantag som uppstod i ``STACK[-1]``. Båda poppas. Om undantaget inte är :exc:`StopAsyncIteration`, tas det upp igen.

source: Exception representation on the stack now consist of one, not three, items.
sv: Undantagsrepresentationen på stacken består nu av ett, inte tre, objekt.

source: Handles an exception raised during a :meth:`~generator.throw` or :meth:`~generator.close` call through the current frame. If ``STACK[-1]`` is an instance of :exc:`StopIteration`, pop three values from the stack and push its ``value`` member. Otherwise, re-raise ``STACK[-1]``.
sv: Hanterar ett undantag som uppstår under ett anrop av :meth:`~generator.throw` eller :meth:`~generator.close` genom den aktuella ramen. Om ``STACK[-1]`` är en instans av :exc:`StopIteration`, popa tre värden från stacken och pusha dess ``value`` medlem. I annat fall höjer du ``STACK[-1]`` igen.

source: **Miscellaneous opcodes**
sv: **Diverse opkoder**

source: item = STACK.pop() set.add(STACK[-i], item)
sv: item = STACK.pop() set.add(STACK[-i], objekt)

source: Used to implement set comprehensions.
sv: Används för att implementera set comprehensions.

source: item = STACK.pop() list.append(STACK[-i], item)
sv: item = STACK.pop() list.append(STACK[-i], objekt)

source: Used to implement list comprehensions.
sv: Används för att implementera listförståelse.

source: value = STACK.pop() key = STACK.pop() dict.__setitem__(STACK[-i], key, value)
sv: värde = STACK.pop() nyckel = STACK.pop() dict.__setitem__(STACK[-i], nyckel, värde)

source: Used to implement dict comprehensions.
sv: Används för att implementera diktförståelse.

source: Map value is ``STACK[-1]`` and map key is ``STACK[-2]``. Before, those were reversed.
sv: Kartans värde är ``STACK[-1]`` och kartans nyckel är ``STACK[-2]``. Tidigare var de omvända.

source: For all of the :opcode:`SET_ADD`, :opcode:`LIST_APPEND` and :opcode:`MAP_ADD` instructions, while the added value or key/value pair is popped off, the container object remains on the stack so that it is available for further iterations of the loop.
sv: För alla instruktionerna :opcode:`SET_ADD`, :opcode:`LIST_APPEND` och :opcode:`MAP_ADD`, medan det tillagda värdet eller nyckel/värde-paret poppas ut, ligger containerobjektet kvar på stacken så att det är tillgängligt för ytterligare iterationer av loopen.

source: Returns with ``STACK[-1]`` to the caller of the function.
sv: Returneras med ``STACK[-1]`` till den som anropar funktionen.

source: Yields ``STACK.pop()`` from a :term:`generator`.
sv: Ger ``STACK.pop()`` från en :term:`generator`.

source: oparg set to be the stack depth.
sv: oparg satt till att vara stackdjupet.

source: oparg set to be the exception block depth, for efficient closing of generators.
sv: oparg satt till att vara undantagsblockets djup, för effektiv stängning av generatorer.

source: oparg is ``1`` if this instruction is part of a yield-from or await, and ``0`` otherwise.
sv: oparg är ``1`` om denna instruktion är en del av en yield-from eller await, och ``0`` annars.

source: Checks whether ``__annotations__`` is defined in ``locals()``, if not it is set up to an empty ``dict``. This opcode is only emitted if a class or module body contains :term:`variable annotations <variable annotation>` statically.
sv: Kontrollerar om ``__annotations__`` är definierad i ``locals()``, om inte sätts den upp till en tom ``dict``. Denna opcode skickas endast ut om en klass eller modul innehåller :term:`variable annotations <variable annotation>` statiskt.

source: Pops a value from the stack, which is used to restore the exception state.
sv: Plockar upp ett värde från stacken, som används för att återställa undantagstillståndet.

source: Re-raises the exception currently on top of the stack. If oparg is non-zero, pops an additional value from the stack which is used to set :attr:`~frame.f_lasti` of the current frame.
sv: Återupptar undantaget som för närvarande ligger överst på stacken. Om oparg inte är noll, plockas ett ytterligare värde från stacken som används för att ställa in :attr:`~frame.f_lasti` för den aktuella ramen.

source: Pops a value from the stack. Pushes the current exception to the top of the stack. Pushes the value originally popped back to the stack. Used in exception handlers.
sv: Plockar ett värde från stacken. Flyttar det aktuella undantaget till toppen av stacken. Skjuter tillbaka det ursprungligen poppade värdet till stacken. Används i undantagshanterare.

source: Performs exception matching for ``except``. Tests whether the ``STACK[-2]`` is an exception matching ``STACK[-1]``. Pops ``STACK[-1]`` and pushes the boolean result of the test.
sv: Utför undantagsmatchning för ``except``. Testar om ``STACK[-2]`` är ett undantag som matchar ``STACK[-1]``. Plockar upp ``STACK[-1]`` och lägger till det booleska resultatet av testet.

source: Performs exception matching for ``except*``. Applies ``split(STACK[-1])`` on the exception group representing ``STACK[-2]``.
sv: Utför undantagsmatchning för ``except*``. Tillämpar ``split(STACK[-1])`` på den undantagsgrupp som representerar ``STACK[-2]``.

source: In case of a match, pops two items from the stack and pushes the non-matching subgroup (``None`` in case of full match) followed by the matching subgroup. When there is no match, pops one item (the match type) and pushes ``None``.
sv: Vid en matchning plockas två objekt från stacken och den icke-matchande undergruppen (``None`` vid fullständig matchning) skjuts upp, följt av den matchande undergruppen. När det inte finns någon matchning, plockas ett objekt (matchningstypen) ut och ``None`` skjuts in.

source: Calls the function in position 4 on the stack with arguments (type, val, tb) representing the exception at the top of the stack. Used to implement the call ``context_manager.__exit__(*exc_info())`` when an exception has occurred in a :keyword:`with` statement.
sv: Anropar funktionen i position 4 på stacken med argument (type, val, tb) som representerar undantaget högst upp på stacken. Används för att implementera anropet ``context_manager.__exit__(*exc_info())`` när ett undantag har inträffat i en :keyword:`with`-sats.

source: The ``__exit__`` function is in position 4 of the stack rather than 7. Exception representation on the stack now consist of one, not three, items.
sv: Funktionen ``__exit__`` ligger på position 4 i stacken i stället för 7. Undantagsrepresentationen på stacken består nu av ett objekt i stället för tre.

source: Pushes a common constant onto the stack. The interpreter contains a hardcoded list of constants supported by this instruction. Used by the :keyword:`assert` statement to load :exc:`AssertionError`.
sv: Skjuter upp en vanlig konstant på stacken. Tolken innehåller en hårdkodad lista över konstanter som stöds av denna instruktion. Används av :keyword:`assert`-satsen för att ladda :exc:`AssertionError`.

source: Pushes :func:`!builtins.__build_class__` onto the stack. It is later called to construct a class.
sv: Lägger :func:`!builtins.__build_class__` på stacken. Den anropas senare för att konstruera en klass.

source: Perform ``STACK.append(len(STACK[-1]))``. Used in :keyword:`match` statements where comparison with structure of pattern is needed.
sv: Utför ``STACK.append(len(STACK[-1]))``. Används i :keyword:`match`-satser där jämförelse med mönstrets struktur behövs.

source: If ``STACK[-1]`` is an instance of :class:`collections.abc.Mapping` (or, more technically: if it has the :c:macro:`Py_TPFLAGS_MAPPING` flag set in its :c:member:`~PyTypeObject.tp_flags`), push ``True`` onto the stack. Otherwise, push ``False``.
sv: Om ``STACK[-1]`` är en instans av :class:`collections.abc.Mapping` (eller, mer tekniskt: om den har :c:macro:`Py_TPFLAGS_MAPPING` flaggan inställd i sin :c:member:`~PyTypeObject.tp_flags`), lägg ``True`` på stacken. Annars läggs ``False`` till.

source: If ``STACK[-1]`` is an instance of :class:`collections.abc.Sequence` and is *not* an instance of :class:`str`/:class:`bytes`/:class:`bytearray` (or, more technically: if it has the :c:macro:`Py_TPFLAGS_SEQUENCE` flag set in its :c:member:`~PyTypeObject.tp_flags`), push ``True`` onto the stack. Otherwise, push ``False``.
sv: Om ``STACK[-1]`` är en instans av :class:`collections.abc.Sequence` och *inte* är en instans av :class:`str`/:class:`bytes`/:class:`bytearray` (eller, mer tekniskt: om den har :c:macro:`Py_TPFLAGS_SEQUENCE` flaggan inställd i sin :c:member:`~PyTypeObject.tp_flags`), lägg ``True`` på stacken. Annars läggs ``False`` till.

source: ``STACK[-1]`` is a tuple of mapping keys, and ``STACK[-2]`` is the match subject. If ``STACK[-2]`` contains all of the keys in ``STACK[-1]``, push a :class:`tuple` containing the corresponding values. Otherwise, push ``None``.
sv: ``STACK[-1]`` är en tupel med mappningsnycklar och ``STACK[-2]`` är matchningsobjektet. Om ``STACK[-2]`` innehåller alla nycklar i ``STACK[-1]``, pushar du en :class:`tuple` som innehåller motsvarande värden. I annat fall skickas ``None``.

source: Previously, this instruction also pushed a boolean value indicating success (``True``) or failure (``False``).
sv: Tidigare skickade denna instruktion också ett booleskt värde som indikerade framgång (``True``) eller misslyckande (``False``).

source: Implements ``name = STACK.pop()``. *namei* is the index of *name* in the attribute :attr:`~codeobject.co_names` of the :ref:`code object <code-objects>`. The compiler tries to use :opcode:`STORE_FAST` or :opcode:`STORE_GLOBAL` if possible.
sv: Implementerar ``name = STACK.pop()``. *namei* är indexet för *name* i attributet :attr:`~codeobject.co_names` i :ref:``code object <code-objects>`. Kompilatorn försöker använda :opcode:`STORE_FAST` eller :opcode:`STORE_GLOBAL` om möjligt.

source: Implements ``del name``, where *namei* is the index into :attr:`~codeobject.co_names` attribute of the :ref:`code object <code-objects>`.
sv: Implementerar ``del name``, där *namei* är indexet i attributet :attr:`~codeobject.co_names` i :ref:`code object <code-objects>`.

source: Unpacks ``STACK[-1]`` into *count* individual values, which are put onto the stack right-to-left. Require there to be exactly *count* values.::
sv: Packar upp ``STACK[-1]`` till *antal* enskilda värden, som läggs på stacken från höger till vänster. Kräver att det finns exakt *antal* värden::

source: Implements assignment with a starred target: Unpacks an iterable in ``STACK[-1]`` into individual values, where the total number of values can be smaller than the number of items in the iterable: one of the new values will be a list of all leftover items.
sv: Implementerar assignment med ett stjärnmärkt mål: Packar upp en iterabel i ``STACK[-1]`` i enskilda värden, där det totala antalet värden kan vara mindre än antalet objekt i iterabeln: ett av de nya värdena kommer att vara en lista över alla kvarvarande objekt.

source: The number of values before and after the list value is limited to 255.
sv: Antalet värden före och efter listvärdet är begränsat till 255.

source: The number of values before the list value is encoded in the argument of the opcode. The number of values after the list if any is encoded using an ``EXTENDED_ARG``. As a consequence, the argument can be seen as a two bytes values where the low byte of *counts* is the number of values before the list value, the high byte of *counts* the number of values after it.
sv: Antalet värden före listvärdet kodas i opkodens argument. Antalet värden efter listan, om det finns några, kodas med hjälp av en ``EXTENDED_ARG``. Som en följd av detta kan argumentet ses som ett värde på två byte där den låga byten i *counts* är antalet värden före listvärdet, den höga byten i *counts* är antalet värden efter det.

source: The extracted values are put onto the stack right-to-left, i.e. ``a, *b, c = d`` will be stored after execution as ``STACK.extend((a, b, c))``.
sv: De extraherade värdena läggs på stacken från höger till vänster, dvs. ``a, *b, c = d`` kommer efter exekvering att lagras som ``STACK.extend((a, b, c))``.

source: obj = STACK.pop() value = STACK.pop() obj.name = value
sv: obj = STACK.pop() värde = STACK.pop() obj.namn = värde

source: where *namei* is the index of name in :attr:`~codeobject.co_names` of the :ref:`code object <code-objects>`.
sv: där *namei* är index för namn i :attr:`~codeobject.co_names` för :ref:`code object <code-objects>`.

source: obj = STACK.pop() del obj.name
sv: obj = STACK.pop() del obj.namn

source: where *namei* is the index of name into :attr:`~codeobject.co_names` of the :ref:`code object <code-objects>`.
sv: där *namei* är index för namn i :attr:`~codeobject.co_names` för :ref:`code object <code-objects>`.

source: Works as :opcode:`STORE_NAME`, but stores the name as a global.
sv: Fungerar som :opcode:`STORE_NAME`, men lagrar namnet som en global.

source: Works as :opcode:`DELETE_NAME`, but deletes a global name.
sv: Fungerar som :opcode:`DELETE_NAME`, men raderar ett globalt namn.

source: Pushes ``co_consts[consti]`` onto the stack.
sv: Lägger ``co_consts[consti]`` på stacken.

source: Pushes the integer ``i`` onto the stack. ``i`` must be in ``range(256)``
sv: Skjuter upp heltalet ``i`` på stacken. ``i`` måste ligga inom ``intervall(256)``

source: Pushes the value associated with ``co_names[namei]`` onto the stack. The name is looked up within the locals, then the globals, then the builtins.
sv: Lägger det värde som associeras med ``co_names[namei]`` på stacken. Namnet söks upp i de lokala, sedan i de globala och sedan i de inbyggda.

source: Pushes a reference to the locals dictionary onto the stack. This is used to prepare namespace dictionaries for :opcode:`LOAD_FROM_DICT_OR_DEREF` and :opcode:`LOAD_FROM_DICT_OR_GLOBALS`.
sv: Lägger en referens till locals-ordlistan på stacken. Detta används för att förbereda namnrymdsordböcker för :opcode:`LOAD_FROM_DICT_OR_DEREF` och :opcode:`LOAD_FROM_DICT_OR_GLOBALS`.
