Repository: yeager/python-docs-sv
Catalog: library/dis.po
Languages: sv

source: :mod:`!dis` --- Disassembler for Python bytecode
sv: :mod:`!dis` --- Disassemblerare för Python bytecode

source: **Source code:** :source:`Lib/dis.py`
sv: **Källkod:** :source:`Lib/dis.py`

source: The :mod:`dis` module supports the analysis of CPython :term:`bytecode` by disassembling it. The CPython bytecode which this module takes as an input is defined in the file :file:`Include/opcode.h` and used by the compiler and the interpreter.
sv: Modulen :mod:`dis` stöder analys av CPython :term:`bytecode` genom att demontera den. CPython-bytekoden som den här modulen tar som indata definieras i filen :file:`Include/opcode.h` och används av kompilatorn och tolken.

source: Bytecode is an implementation detail of the CPython interpreter. No guarantees are made that bytecode will not be added, removed, or changed between versions of Python. Use of this module should not be considered to work across Python VMs or Python releases.
sv: Bytecode är en implementationsdetalj av CPython-tolken. Det finns inga garantier för att bytecode inte kommer att läggas till, tas bort eller ändras mellan olika versioner av Python. Användning av denna modul bör inte anses fungera över Python VM eller Python-versioner.

source: Use 2 bytes for each instruction. Previously the number of bytes varied by instruction.
sv: Använd 2 byte för varje instruktion. Tidigare varierade antalet byte beroende på instruktion.

source: The argument of jump, exception handling and loop instructions is now the instruction offset rather than the byte offset.
sv: Argumentet för hopp-, undantagshanterings- och loopinstruktioner är nu instruktionsoffset i stället för byteoffset.

source: Some instructions are accompanied by one or more inline cache entries, which take the form of :opcode:`CACHE` instructions. These instructions are hidden by default, but can be shown by passing ``show_caches=True`` to any :mod:`dis` utility. Furthermore, the interpreter now adapts the bytecode to specialize it for different runtime conditions. The adaptive bytecode can be shown by passing ``adaptive=True``.
sv: Vissa instruktioner åtföljs av en eller flera inline-cacheposter, som har formen av :opcode:`CACHE`-instruktioner. Dessa instruktioner är dolda som standard, men kan visas genom att skicka ``show_caches=True`` till valfritt :mod:`dis`-verktyg. Dessutom anpassar tolken nu bytekoden för att specialisera den för olika körtidsförhållanden. Den adaptiva bytekoden kan visas genom att ange ``adaptive=True``.

source: The argument of a jump is the offset of the target instruction relative to the instruction that appears immediately after the jump instruction's :opcode:`CACHE` entries.
sv: Argumentet för ett hopp är målinstruktionens offset i förhållande till den instruktion som visas omedelbart efter hoppinstruktionens :opcode:`CACHE`-poster.

source: As a consequence, the presence of the :opcode:`CACHE` instructions is transparent for forward jumps but needs to be taken into account when reasoning about backward jumps.
sv: Följaktligen är förekomsten av instruktionerna :opcode:`CACHE` transparent för hopp framåt, men måste tas med i beräkningen när man resonerar om hopp bakåt.

source: The output shows logical labels rather than instruction offsets for jump targets and exception handlers. The ``-O`` command line option and the ``show_offsets`` argument were added.
sv: Utdata visar logiska etiketter i stället för instruktionsoffset för hoppmål och undantagshanterare. Kommandoradsalternativet ``-O`` och argumentet ``show_offsets`` har lagts till.

source: The :option:`-P <dis --show-positions>` command-line option and the ``show_positions`` argument were added.
sv: Kommandoradsalternativet :option:`-P <dis --show-positions>` och argumentet ``show_positions`` har lagts till.

source: The :option:`-S <dis --specialized>` command-line option is added.
sv: Kommandoradsalternativet :option:`-S <dis --specialized>` har lagts till.

source: Example: Given the function :func:`!myfunc`::
sv: Exempel: Givet funktionen :func:`!myfunc`::

source: def myfunc(alist): return len(alist)
sv: def myfunc(alist): returnera len(alist)

source: the following command can be used to display the disassembly of :func:`!myfunc`:
sv: följande kommando kan användas för att visa demonteringen av :func:`!myfunc`:

source: >>> dis.dis(myfunc) 2 RESUME 0 3 LOAD_GLOBAL 1 (len + NULL) LOAD_FAST_BORROW 0 (alist) CALL 1 RETURN_VALUE
sv: >>> dis.dis(myfunc) 2 ÅTERGÅ 0 3 LOAD_GLOBAL 1 (len + NULL) LOAD_FAST_BORROW 0 (alist) CALL 1 RETURN_VALUE

source: (The "2" is a line number).
sv: (2" är ett linjenummer).

source: Command-line interface
sv: Kommandoradsgränssnitt

source: The :mod:`dis` module can be invoked as a script from the command line:
sv: Modulen :mod:`dis` kan anropas som ett skript från kommandoraden:

source: The following options are accepted:
sv: Följande alternativ accepteras:

source: Display usage and exit.
sv: Visa användning och avsluta.

source: Show inline caches.
sv: Visa inline-cacher.

source: Show offsets of instructions.
sv: Visa offsets för instruktioner.

source: Show positions of instructions in the source code.
sv: Visa var instruktionerna finns i källkoden.

source: Show specialized bytecode.
sv: Visa specialiserad bytekod.

source: If :file:`infile` is specified, its disassembled code will be written to stdout. Otherwise, disassembly is performed on compiled source code received from stdin.
sv: Om :file:`infile` anges kommer dess demonterade kod att skrivas till stdout. I annat fall utförs demonteringen på kompilerad källkod som tas emot från stdin.

source: Bytecode analysis
sv: Bytecode-analys

source: The bytecode analysis API allows pieces of Python code to be wrapped in a :class:`Bytecode` object that provides easy access to details of the compiled code.
sv: API:et för bytecodeanalys gör att delar av Python-koden kan förpackas i ett :class:`Bytecode`-objekt som ger enkel åtkomst till detaljer i den kompilerade koden.

source: Analyse the bytecode corresponding to a function, generator, asynchronous generator, coroutine, method, string of source code, or a code object (as returned by :func:`compile`).
sv: Analysera bytekoden som motsvarar en funktion, generator, asynkron generator, coroutine, metod, sträng med källkod eller ett kodobjekt (som returneras av :func:`compile`).

source: This is a convenience wrapper around many of the functions listed below, most notably :func:`get_instructions`, as iterating over a :class:`Bytecode` instance yields the bytecode operations as :class:`Instruction` instances.
sv: Detta är en bekväm omslutning av många av de funktioner som anges nedan, särskilt :func:`get_instructions`, eftersom iterering över en :class:`Bytecode`-instans ger bytecode-operationerna som :class:`Instruction`-instanser.

source: If *first_line* is not ``None``, it indicates the line number that should be reported for the first source line in the disassembled code. Otherwise, the source line information (if any) is taken directly from the disassembled code object.
sv: Om *first_line* inte är ``None``, anges det radnummer som ska rapporteras för den första källkodsraden i den demonterade koden. I annat fall hämtas informationen om källraden (om sådan finns) direkt från det demonterade kodobjektet.

source: If *current_offset* is not ``None``, it refers to an instruction offset in the disassembled code. Setting this means :meth:`.dis` will display a "current instruction" marker against the specified opcode.
sv: Om *current_offset* inte är ``None``, refererar det till en instruktionsoffset i den demonterade koden. Om du ställer in detta betyder det att :meth:`.dis` kommer att visa en "aktuell instruktion"-markör mot den angivna opkoden.

source: If *show_caches* is ``True``, :meth:`.dis` will display inline cache entries used by the interpreter to specialize the bytecode.
sv: Om *show_caches* är ``True`` kommer :meth:`.dis` att visa inline-cacheposter som används av tolken för att specialisera bytekoden.

source: If *adaptive* is ``True``, :meth:`.dis` will display specialized bytecode that may be different from the original bytecode.
sv: Om *adaptive* är ``True`` kommer :meth:`.dis` att visa specialiserad bytekod som kan skilja sig från den ursprungliga bytekoden.

source: If *show_offsets* is ``True``, :meth:`.dis` will include instruction offsets in the output.
sv: Om *show_offsets* är ``True`` kommer :meth:`.dis` att inkludera instruktionsoffsets i utdata.

source: If *show_positions* is ``True``, :meth:`.dis` will include instruction source code positions in the output.
sv: Om *show_positions* är ``True`` kommer :meth:`.dis` att inkludera positioner för instruktionskällkod i utdata.

source: Construct a :class:`Bytecode` instance from the given traceback, setting *current_offset* to the instruction responsible for the exception.
sv: Konstruera en :class:`Bytecode`-instans från den angivna tracebacken, och sätt *current_offset* till den instruktion som är ansvarig för undantaget.

source: The compiled code object.
sv: Det kompilerade kodobjektet.

source: The first source line of the code object (if available)
sv: Den första källraden i kodobjektet (om den finns tillgänglig)

source: Return a formatted view of the bytecode operations (the same as printed by :func:`dis.dis`, but returned as a multi-line string).
sv: Returnerar en formaterad vy av bytecode-operationerna (samma som skrivs ut av :func:`dis.dis`, men returneras som en sträng med flera rader).

source: Return a formatted multi-line string with detailed information about the code object, like :func:`code_info`.
sv: Returnerar en formaterad sträng med flera rader med detaljerad information om kodobjektet, som :func:`code_info`.

source: This can now handle coroutine and asynchronous generator objects.
sv: Detta kan nu hantera coroutine- och asynkrona generatorobjekt.

source: Added the *show_caches* and *adaptive* parameters.
sv: Parametrarna *show_caches* och *adaptive* har lagts till.

source: Added the *show_offsets* parameter
sv: Parametern *show_offsets* har lagts till

source: Added the *show_positions* parameter.
sv: Parametern *show_positions* har lagts till.

source: Example:
sv: Exempel:

source: >>> bytecode = dis.Bytecode(myfunc) >>> for instr in bytecode: ... print(instr.opname) ... RESUME LOAD_GLOBAL LOAD_FAST_BORROW CALL RETURN_VALUE
sv: >>> bytecode = dis.Bytecode(myfunc) >>> för instr i bytecode: ... print(instr.opname) ... ÅTERUPPTA LADDA_GLOBAL LADDA_SNABBT_LÅNA RINGA RETURN_VALUE

source: Analysis functions
sv: Analysfunktioner

source: The :mod:`dis` module also defines the following analysis functions that convert the input directly to the desired output. They can be useful if only a single operation is being performed, so the intermediate analysis object isn't useful:
sv: Modulen :mod:`dis` definierar även följande analysfunktioner som omvandlar indata direkt till önskad utdata. De kan vara användbara om endast en enda operation utförs, så att det mellanliggande analysobjektet inte är användbart:

source: Return a formatted multi-line string with detailed code object information for the supplied function, generator, asynchronous generator, coroutine, method, source code string or code object.
sv: Returnerar en formaterad flerradig sträng med detaljerad kodobjektinformation för den angivna funktionen, generatorn, asynkrongeneratorn, coroutinen, metoden, källkodsträngen eller kodobjektet.

source: Note that the exact contents of code info strings are highly implementation dependent and they may change arbitrarily across Python VMs or Python releases.
sv: Observera att det exakta innehållet i kodinfosträngarna är mycket beroende av implementationen och att det kan ändras godtyckligt mellan olika Python-VM:er eller Python-utgåvor.

source: Print detailed code object information for the supplied function, method, source code string or code object to *file* (or ``sys.stdout`` if *file* is not specified).
sv: Skriv ut detaljerad kodobjektinformation för den angivna funktionen, metoden, källkodsträngen eller kodobjektet till *file* (eller ``sys.stdout`` om *file* inte anges).

source: This is a convenient shorthand for ``print(code_info(x), file=file)``, intended for interactive exploration at the interpreter prompt.
sv: Detta är en praktisk kortform för ``print(code_info(x), file=file)``, avsedd för interaktiv utforskning vid tolkens prompt.

source: Added *file* parameter.
sv: Parametern *file* har lagts till.

source: Disassemble the *x* object. *x* can denote either a module, a class, a method, a function, a generator, an asynchronous generator, a coroutine, a code object, a string of source code or a byte sequence of raw bytecode. For a module, it disassembles all functions. For a class, it disassembles all methods (including class and static methods). For a code object or sequence of raw bytecode, it prints one line per bytecode instruction. It also recursively disassembles nested code objects. These can include generator expressions, nested functions, the bodies of nested classes, and the code objects used for :ref:`annotation scopes <annotation-scopes>`. Strings are first compiled to code objects with the :func:`compile` built-in function before being disassembled. If no object is provided, this function disassembles the last traceback.
sv: Demontera *x*-objektet. *x* kan beteckna antingen en modul, en klass, en metod, en funktion, en generator, en asynkron generator, en coroutine, ett kodobjekt, en sträng med källkod eller en byte-sekvens med rå bytecode. För en modul demonteras alla funktioner. För en klass demonteras alla metoder (inklusive klass- och statiska metoder). För ett kodobjekt eller en sekvens av rå bytecode skrivs en rad per bytecode-instruktion ut. Den demonterar även nästlade kodobjekt rekursivt. Dessa kan inkludera generatoruttryck, nästlade funktioner, kropparna i nästlade klasser och de kodobjekt som används för :ref:`annotation scopes <annotation-scopes>`. Strängar kompileras först till kodobjekt med den inbyggda funktionen :func:`compile` innan de plockas isär. Om inget objekt anges, demonterar denna funktion det senaste traceback.

source: The disassembly is written as text to the supplied *file* argument if provided and to ``sys.stdout`` otherwise.
sv: Demonteringen skrivs som text till det medföljande *file*-argumentet om det tillhandahålls och till ``sys.stdout`` annars.

source: The maximal depth of recursion is limited by *depth* unless it is ``None``. ``depth=0`` means no recursion.
sv: Det maximala djupet för rekursion begränsas av *depth* om det inte är ``None``. ``depth=0`` innebär ingen rekursion.

source: If *show_caches* is ``True``, this function will display inline cache entries used by the interpreter to specialize the bytecode.
sv: Om *show_caches* är ``True``, kommer denna funktion att visa inline cache-poster som används av tolken för att specialisera bytekoden.

source: If *adaptive* is ``True``, this function will display specialized bytecode that may be different from the original bytecode.
sv: Om *adaptive* är ``True``, kommer denna funktion att visa specialiserad bytecode som kan skilja sig från den ursprungliga bytecoden.

source: Implemented recursive disassembling and added *depth* parameter.
sv: Implementerade rekursiv demontering och lade till parametern *depth*.

source: Added the *show_offsets* parameter.
sv: Parametern *show_offsets* har lagts till.

source: Disassemble the top-of-stack function of a traceback, using the last traceback if none was passed. The instruction causing the exception is indicated.
sv: Demontera funktionen högst upp i stapeln för en spårning, med hjälp av den sista spårningen om ingen har skickats. Den instruktion som orsakade undantaget anges.

source: Disassemble a code object, indicating the last instruction if *lasti* was provided. The output is divided in the following columns:
sv: Demontera ett kodobjekt och ange den sista instruktionen om *lasti* har angetts. Utmatningen är uppdelad i följande kolumner:

source: the source code location of the instruction. Complete location information is shown if *show_positions* is true. Otherwise (the default) only the line number is displayed.
sv: instruktionens plats i källkoden. Fullständig platsinformation visas om *show_positions* är true. Annars (standard) visas endast radnumret.

source: the current instruction, indicated as ``-->``,
sv: den aktuella instruktionen, angiven som ``-->``,

source: a labelled instruction, indicated with ``>>``,
sv: en märkt instruktion, markerad med ``>>``,

source: the address of the instruction,
sv: adressen till instruktionen,

source: the operation code name,
sv: operationens kodnamn,

source: operation parameters, and
sv: driftsparametrar, och

source: interpretation of the parameters in parentheses.
sv: tolkning av parametrarna inom parentes.

source: The parameter interpretation recognizes local and global variable names, constant values, branch targets, and compare operators.
sv: Parametertolkningen känner igen lokala och globala variabelnamn, konstantvärden, förgreningsmål och jämförelseoperatorer.

source: Return an iterator over the instructions in the supplied function, method, source code string or code object.
sv: Returnerar en iterator över instruktionerna i den angivna funktionen, metoden, källkodsträngen eller kodobjektet.

source: The iterator generates a series of :class:`Instruction` named tuples giving the details of each operation in the supplied code.
sv: Iteratorn genererar en serie :class:`Instruction`-namngivna tuples som ger detaljerna för varje operation i den medföljande koden.

source: The *adaptive* parameter works as it does in :func:`dis`.
sv: Parametern *adaptive* fungerar som den gör i :func:`dis`.

source: The *show_caches* parameter is deprecated and has no effect. The iterator generates the :class:`Instruction` instances with the *cache_info* field populated (regardless of the value of *show_caches*) and it no longer generates separate items for the cache entries.
sv: Parametern *show_caches* är föråldrad och har ingen effekt. Iteratorn genererar :class:`Instruction`-instanser med fältet *cache_info* ifyllt (oavsett värdet på *show_caches*) och den genererar inte längre separata objekt för cache-posterna.

source: This generator function uses the :meth:`~codeobject.co_lines` method of the :ref:`code object <code-objects>` *code* to find the offsets which are starts of lines in the source code. They are generated as ``(offset, lineno)`` pairs.
sv: Denna generatorfunktion använder metoden :meth:`~codeobject.co_lines` i :ref:`code object <code-objects>` *code* för att hitta de offsets som är början på rader i källkoden. De genereras som par av typen ``(offset, lineno)``.

source: Line numbers can be decreasing. Before, they were always increasing.
sv: Linjenummer kan vara minskande. Tidigare var de alltid ökande.

source: The :pep:`626` :meth:`~codeobject.co_lines` method is used instead of the :attr:`~codeobject.co_firstlineno` and :attr:`~codeobject.co_lnotab` attributes of the :ref:`code object <code-objects>`.
sv: Metoden :pep:`626` :meth:`~codeobject.co_lines` används istället för attributen :attr:`~codeobject.co_firstlineno` och :attr:`~codeobject.co_lnotab` i :ref:`codeobjekt <code-objects>`.

source: Line numbers can be ``None`` for bytecode that does not map to source lines.
sv: Radnummer kan vara ``None`` för bytecode som inte mappas till källkodsrader.

source: Detect all offsets in the raw compiled bytecode string *code* which are jump targets, and return a list of these offsets.
sv: Detektera alla offsets i den råa kompilerade bytecode-strängen *code* som är hoppmål och returnera en lista över dessa offsets.

source: Compute the stack effect of *opcode* with argument *oparg*.
sv: Beräkna stapeleffekten av *opcode* med argumentet *oparg*.

source: If the code has a jump target and *jump* is ``True``, :func:`~stack_effect` will return the stack effect of jumping. If *jump* is ``False``, it will return the stack effect of not jumping. And if *jump* is ``None`` (default), it will return the maximal stack effect of both cases.
sv: Om koden har ett hoppmål och *jump* är ``True``, kommer :func:`~stack_effect` att returnera stapeleffekten av att hoppa. Om *jump* är ``False``, kommer den att returnera stapeleffekten av att inte hoppa. Och om *jump* är ``None`` (standard), kommer den att returnera den maximala stapeleffekten av båda fallen.

source: Added *jump* parameter.
sv: Lagt till parametern *jump*.

source: If ``oparg`` is omitted (or ``None``), the stack effect is now returned for ``oparg=0``. Previously this was an error for opcodes that use their arg. It is also no longer an error to pass an integer ``oparg`` when the ``opcode`` does not use it; the ``oparg`` in this case is ignored.
sv: Om ``oparg`` utelämnas (eller ``None``), returneras nu stackeffekten för ``oparg=0``. Tidigare var detta ett fel för opkoder som använder sitt arg. Det är inte heller längre ett fel att skicka ett heltal ``oparg`` när ``opcode`` inte använder det; ``oparg`` ignoreras i detta fall.

source: Python Bytecode Instructions
sv: Python Bytecode Instruktioner

source: The :func:`get_instructions` function and :class:`Bytecode` class provide details of bytecode instructions as :class:`Instruction` instances:
sv: Funktionen :func:`get_instructions` och klassen :class:`Bytecode` ger detaljer om bytecode-instruktioner som :class:`Instruction`-instanser:

source: Details for a bytecode operation
sv: Detaljer för en bytecode-operation

source: numeric code for operation, corresponding to the opcode values listed below and the bytecode values in the :ref:`opcode_collections`.
sv: numerisk kod för operationen, som motsvarar de opcode-värden som anges nedan och bytecode-värdena i :ref:`opcode_collections`.

source: human readable name for operation
sv: mänskligt läsbart namn för operationen

source: numeric code for the base operation if operation is specialized; otherwise equal to :data:`opcode`
sv: numerisk kod för basoperationen om operationen är specialiserad; annars lika med :data:`opcode`

source: human readable name for the base operation if operation is specialized; otherwise equal to :data:`opname`
sv: mänskligt läsbart namn för basoperationen om operationen är specialiserad; annars lika med :data:`opname`

source: numeric argument to operation (if any), otherwise ``None``
sv: numeriskt argument till operationen (om sådant finns), annars ``None``

source: alias for :data:`arg`
sv: alias för :data:`arg`

source: resolved arg value (if any), otherwise ``None``
sv: löst arg-värde (om sådant finns), annars ``None``

source: human readable description of operation argument (if any), otherwise an empty string.
sv: mänsklig läsbar beskrivning av operationsargumentet (om sådant finns), annars en tom sträng.

source: start index of operation within bytecode sequence
sv: startindex för operation inom bytecode-sekvens

source: start index of operation within bytecode sequence, including prefixed ``EXTENDED_ARG`` operations if present; otherwise equal to :data:`offset`
sv: startindex för operation inom bytecode-sekvens, inklusive prefixet ``EXTENDED_ARG`` om sådant finns; annars lika med :data:`offset`

source: start index of the cache entries following the operation
sv: startindex för de cacheposter som följer efter operationen

source: end index of the cache entries following the operation
sv: slutindex för de cacheposter som följer på operationen

source: ``True`` if this opcode starts a source line, otherwise ``False``
sv: ``True`` om denna opcode startar en källkodsrad, annars ``False``

source: source line number associated with this opcode (if any), otherwise ``None``
sv: källans radnummer associerat med denna opcode (om det finns någon), annars ``None``
