Repository: yeager/python-docs-sv
Catalog: library/dis.po
Languages: sv

source: ``0x04`` a tuple of strings containing parameters' annotations
sv: ``0x04`` en tupel av strängar som innehåller parametrarnas anteckningar

source: ``0x08`` a tuple containing cells for free variables, making a closure
sv: ``0x08`` en tupel som innehåller celler för fria variabler, vilket ger en stängning

source: Pushes a slice object on the stack. *argc* must be 2 or 3. If it is 2, implements::
sv: Skjuter upp ett slice-objekt på stacken. *argc* måste vara 2 eller 3. Om det är 2, implementeras::

source: end = STACK.pop() start = STACK.pop() STACK.append(slice(start, end))
sv: slut = STACK.pop() start = STACK.pop() STACK.append(slice(start, slut))

source: if it is 3, implements::
sv: om det är 3, implementerar::

source: step = STACK.pop() end = STACK.pop() start = STACK.pop() STACK.append(slice(start, end, step))
sv: steg = STACK.pop() slut = STACK.pop() start = STACK.pop() STACK.append(slice(start, slut, steg))

source: See the :func:`slice` built-in function for more information.
sv: Se den inbyggda funktionen :func:`slice` för mer information.

source: Prefixes any opcode which has an argument too big to fit into the default one byte. *ext* holds an additional byte which act as higher bits in the argument. For each opcode, at most three prefixal ``EXTENDED_ARG`` are allowed, forming an argument from two-byte to four-byte.
sv: Prefix för alla op-koder som har ett argument som är för stort för att rymmas i den standardiserade en byte. *ext* innehåller ytterligare en byte som fungerar som högre bitar i argumentet. För varje opcode tillåts högst tre prefixala ``EXTENDED_ARG``, som bildar ett argument från två byte till fyra byte.

source: Convert value to a string, depending on ``oparg``::
sv: Konverterar värdet till en sträng, beroende på ``oparg``::

source: value = STACK.pop() result = func(value) STACK.append(result)
sv: värde = STACK.pop() resultat = func(värde) STACK.append(resultat)

source: ``oparg == 1``: call :func:`str` on *value*
sv: ``oparg == 1``: anropa :func:`str` på *värde*

source: ``oparg == 2``: call :func:`repr` on *value*
sv: ``oparg == 2``: anropa :func:`repr` på *värde*

source: ``oparg == 3``: call :func:`ascii` on *value*
sv: ``oparg == 3``: anropa :func:`ascii` på *värde*

source: Used for implementing formatted string literals (f-strings).
sv: Används för att implementera formaterade stränglitteraler (f-strings).

source: Formats the value on top of stack::
sv: Formaterar värdet på toppen av stapeln::

source: value = STACK.pop() result = value.__format__("") STACK.append(result)
sv: värde = STACK.pop() resultat = värde.__format__("") STACK.append(resultat)

source: Formats the given value with the given format spec::
sv: Formaterar det angivna värdet med det angivna formatet spec::

source: spec = STACK.pop() value = STACK.pop() result = value.__format__(spec) STACK.append(result)
sv: spec = STACK.pop() värde = STACK.pop() resultat = värde.__format__(spec) STACK.append(resultat)

source: ``STACK[-1]`` is a tuple of keyword attribute names, ``STACK[-2]`` is the class being matched against, and ``STACK[-3]`` is the match subject. *count* is the number of positional sub-patterns.
sv: ``STACK[-1]`` är en tupel av nyckelordsattributnamn, ``STACK[-2]`` är den klass som matchningen görs mot och ``STACK[-3]`` är matchningsobjektet. *count* är antalet positionella undermönster.

source: Pop ``STACK[-1]``, ``STACK[-2]``, and ``STACK[-3]``. If ``STACK[-3]`` is an instance of ``STACK[-2]`` and has the positional and keyword attributes required by *count* and ``STACK[-1]``, push a tuple of extracted attributes. Otherwise, push ``None``.
sv: Popa ``STACK[-1]``, ``STACK[-2]`` och ``STACK[-3]``. Om ``STACK[-3]`` är en instans av ``STACK[-2]`` och har de positions- och nyckelordsattribut som krävs av *count* och ``STACK[-1]``, pushar du en tupel av extraherade attribut. I annat fall, skicka ``None``.

source: A no-op. Performs internal tracing, debugging and optimization checks.
sv: Ingen funktion. Utför interna spårnings-, felsöknings- och optimeringskontroller.

source: The ``context`` operand consists of two parts. The lowest two bits indicate where the ``RESUME`` occurs:
sv: Operanden ``context`` består av två delar. De två lägsta bitarna anger var ``RESUME`` sker:

source: ``0`` The start of a function, which is neither a generator, coroutine nor an async generator
sv: ``0`` Början på en funktion, som varken är en generator, coroutine eller en async-generator

source: ``1`` After a ``yield`` expression
sv: ``1`` Efter ett ``avkastande`` uttryck

source: ``2`` After a ``yield from`` expression
sv: ``2`` Efter ett ``utbyte från`` uttryck

source: ``3`` After an ``await`` expression
sv: ``3`` Efter ett ``await`` uttryck

source: The next bit is ``1`` if the RESUME is at except-depth ``1``, and ``0`` otherwise.
sv: Nästa bit är ``1`` om RESUME är på except-depth ``1``, och ``0`` annars.

source: The oparg value changed to include information about except-depth
sv: Oparg-värdet ändrades för att inkludera information om except-depth

source: Create a generator, coroutine, or async generator from the current frame. Used as first opcode of in code object for the above mentioned callables. Clear the current frame and return the newly created generator.
sv: Skapa en generator, coroutine eller async-generator från den aktuella bildrutan. Används som första opcode i in code-objektet för ovan nämnda callables. Rensa den aktuella ramen och returnera den nyskapade generatorn.

source: Equivalent to ``STACK[-1] = STACK[-2].send(STACK[-1])``. Used in ``yield from`` and ``await`` statements.
sv: Motsvarar ``STACK[-1] = STACK[-2].send(STACK[-1])``. Används i ``yield from`` och ``await``-satser.

source: If the call raises :exc:`StopIteration`, pop the top value from the stack, push the exception's ``value`` attribute, and increment the bytecode counter by *delta*.
sv: Om anropet ger upphov till :exc:`StopIteration`, plockas det översta värdet från stacken, undantagets ``value``-attribut skjuts upp och bytekodsräknaren ökas med *delta*.

source: This is not really an opcode. It identifies the dividing line between opcodes in the range [0,255] which don't use their argument and those that do (``< HAVE_ARGUMENT`` and ``>= HAVE_ARGUMENT``, respectively).
sv: Detta är egentligen inte en opcode. Den identifierar skiljelinjen mellan opkoder i intervallet [0,255] som inte använder sitt argument och de som gör det (``< HAVE_ARGUMENT`` respektive ``>= HAVE_ARGUMENT``).

source: If your application uses pseudo instructions or specialized instructions, use the :data:`hasarg` collection instead.
sv: Om ditt program använder pseudoinstruktioner eller specialinstruktioner, använd :data:`hasarg`-samlingen istället.

source: Now every instruction has an argument, but opcodes ``< HAVE_ARGUMENT`` ignore it. Before, only opcodes ``>= HAVE_ARGUMENT`` had an argument.
sv: Nu har varje instruktion ett argument, men opkoderna ``< HAVE_ARGUMENT`` ignorerar det. Tidigare hade endast opkoderna ``>= HAVE_ARGUMENT`` ett argument.

source: Pseudo instructions were added to the :mod:`dis` module, and for them it is not true that comparison with ``HAVE_ARGUMENT`` indicates whether they use their arg.
sv: Pseudoinstruktioner lades till i modulen :mod:`dis`, och för dem är det inte sant att jämförelse med ``HAVE_ARGUMENT`` visar om de använder sitt arg.

source: Use :data:`hasarg` instead.
sv: Använd :data:`hasarg` istället.

source: Calls an intrinsic function with one argument. Passes ``STACK[-1]`` as the argument and sets ``STACK[-1]`` to the result. Used to implement functionality that is not performance critical.
sv: Anropar en egen funktion med ett argument. Anropar ``STACK[-1]`` som argument och sätter ``STACK[-1]`` till resultatet. Används för att implementera funktionalitet som inte är prestandakritisk.

source: The operand determines which intrinsic function is called:
sv: Operanden avgör vilken egen funktion som anropas:

source: Description
sv: Beskrivning

source: Not valid
sv: Ej giltig

source: Prints the argument to standard out. Used in the REPL.
sv: Skriver ut argumentet till standardutskrift. Används i REPL.

source: ``INTRINSIC_IMPORT_STAR``
sv: ``INTRINSIC_IMPORT_STJÄRNA``

source: Performs ``import *`` for the named module.
sv: Utför ``import *`` för den namngivna modulen.

source: Extracts the return value from a ``StopIteration`` exception.
sv: Extraherar returvärdet från ett ``StopIteration``-undantag.

source: Wraps an async generator value
sv: Omsluter ett asynkront generatorvärde

source: Performs the unary ``+`` operation
sv: Utför den unära ``+``-operationen

source: Converts a list to a tuple
sv: Konverterar en lista till en tupel

source: Creates a :class:`typing.TypeVar`
sv: Skapar en :class:`typing.TypeVar`

source: Creates a :class:`typing.ParamSpec`
sv: Skapar en :class:`typing.ParamSpec`

source: Creates a :class:`typing.TypeVarTuple`
sv: Skapar en :class:`typing.TypeVarTuple`

source: Returns :class:`typing.Generic` subscripted with the argument
sv: Returnerar :class:`typing.Generic` subskriberad med argumentet

source: Creates a :class:`typing.TypeAliasType`; used in the :keyword:`type` statement. The argument is a tuple of the type alias's name, type parameters, and value.
sv: Skapar en :class:`typing.TypeAliasType`; som används i :keyword:`type`-satsen. Argumentet är en tupel av typaliasets namn, typparametrar och värde.

source: Calls an intrinsic function with two arguments. Used to implement functionality that is not performance critical::
sv: Anropar en inneboende funktion med två argument. Används för att implementera funktionalitet som inte är prestandakritisk::

source: arg2 = STACK.pop() arg1 = STACK.pop() result = intrinsic2(arg1, arg2) STACK.append(result)
sv: arg2 = STACK.pop() arg1 = STACK.pop() resultat = intrinsic2(arg1, arg2) STACK.append(resultat)

source: Calculates the :exc:`ExceptionGroup` to raise from a ``try-except*``.
sv: Beräknar den :exc:`ExceptionGroup` som ska tas fram från ett ``try-except*``.

source: ``INTRINSIC_TYPEVAR_WITH_BOUND``
sv: ``INTRINSIC_TYPEVAR_MED_BOUND``

source: Creates a :class:`typing.TypeVar` with a bound.
sv: Skapar en :class:`typing.TypeVar` med en bound.

source: ``INTRINSIC_TYPEVAR_WITH_CONSTRAINTS``
sv: ``INTRINSIC_TYPEVAR_MED_BEGRÄNSNINGAR``

source: Creates a :class:`typing.TypeVar` with constraints.
sv: Skapar en :class:`typing.TypeVar` med begränsningar.

source: Sets the ``__type_params__`` attribute of a function.
sv: Ställer in attributet ``__type_params__`` för en funktion.

source: Performs special method lookup on ``STACK[-1]``. If ``type(STACK[-1]).__xxx__`` is a method, leave ``type(STACK[-1]).__xxx__; STACK[-1]`` on the stack. If ``type(STACK[-1]).__xxx__`` is not a method, leave ``STACK[-1].__xxx__; NULL`` on the stack.
sv: Utför en speciell metoduppslagning på ``STACK[-1]``. Om ``type(STACK[-1]).__xxx__`` är en metod, lämna ``type(STACK[-1]).__xxx__; STACK[-1]`` på stacken. Om ``type(STACK[-1]).__xxx__`` inte är en metod, lämna ``STACK[-1].__xxx__; NULL`` på stacken.

source: **Pseudo-instructions**
sv: **Pseudo-instruktioner**

source: These opcodes do not appear in Python bytecode. They are used by the compiler but are replaced by real opcodes or removed before bytecode is generated.
sv: Dessa opkoder visas inte i Python bytecode. De används av kompilatorn men ersätts av riktiga opkoder eller tas bort innan bytekoden genereras.

source: Set up an exception handler for the following code block. If an exception occurs, the value stack level is restored to its current state and control is transferred to the exception handler at ``target``.
sv: Skapa en undantagshanterare för följande kodblock. Om ett undantag inträffar återställs värde-stacknivån till sitt aktuella tillstånd och kontrollen överförs till undantagshanteraren i ``target``.

source: Like ``SETUP_FINALLY``, but in case of an exception also pushes the last instruction (``lasti``) to the stack so that ``RERAISE`` can restore it. If an exception occurs, the value stack level and the last instruction on the frame are restored to their current state, and control is transferred to the exception handler at ``target``.
sv: Som ``SETUP_FINALLY``, men i händelse av ett undantag flyttas även den sista instruktionen (``lasti``) till stacken så att ``RERAISE`` kan återställa den. Om ett undantag inträffar återställs värdet på stacknivån och den sista instruktionen på ramen till sitt nuvarande tillstånd och kontrollen överförs till undantagshanteraren på ``target``.

source: Like ``SETUP_CLEANUP``, but in case of an exception one more item is popped from the stack before control is transferred to the exception handler at ``target``.
sv: Som ``SETUP_CLEANUP``, men i händelse av ett undantag poppas ytterligare ett objekt från stacken innan kontrollen överförs till undantagshanteraren i ``target``.

source: This variant is used in :keyword:`with` and :keyword:`async with` constructs, which push the return value of the context manager's :meth:`~object.__enter__` or :meth:`~object.__aenter__` to the stack.
sv: Den här varianten används i konstruktionerna :keyword:`with` och :keyword:`async with`, som flyttar returvärdet för kontexthanterarens :meth:`~object.__enter__` eller :meth:`~object.__aenter__` till stacken.

source: Marks the end of the code block associated with the last ``SETUP_FINALLY``, ``SETUP_CLEANUP`` or ``SETUP_WITH``.
sv: Markerar slutet på det kodblock som är associerat med den senaste ``SETUP_FINALLY``, ``SETUP_CLEANUP`` eller ``SETUP_WITH``.

source: Undirected relative jump instructions which are replaced by their directed (forward/backward) counterparts by the assembler.
sv: Oriktade relativa hoppinstruktioner som ersätts av sina riktade (framåt/bakåt) motsvarigheter av assemblerprogrammet.

source: Conditional jumps which do not impact the stack. Replaced by the sequence ``COPY 1``, ``TO_BOOL``, ``POP_JUMP_IF_TRUE/FALSE``.
sv: Villkorliga hopp som inte påverkar stacken. Ersätts av sekvensen ``COPY 1``, ``TO_BOOL``, ``POP_JUMP_IF_TRUE/FALSE``.

source: Pushes a reference to the cell contained in slot ``i`` of the "fast locals" storage.
sv: Skickar en referens till den cell som finns på plats ``i`` i lagret "Fast Locals".

source: Note that ``LOAD_CLOSURE`` is replaced with ``LOAD_FAST`` in the assembler.
sv: Observera att ``LOAD_CLOSURE`` ersätts med ``LOAD_FAST`` i assemblern.

source: This opcode is now a pseudo-instruction.
sv: Denna opkod är nu en pseudo-instruktion.

source: Optimized unbound method lookup. Emitted as a ``LOAD_ATTR`` opcode with a flag set in the arg.
sv: Optimerad uppslagning av obunden metod. Utfärdas som en ``LOAD_ATTR`` opcode med en flagga inställd i arg.

source: Opcode collections
sv: Opcode-samlingar

source: These collections are provided for automatic introspection of bytecode instructions:
sv: Dessa samlingar tillhandahålls för automatisk introspektion av bytecode-instruktioner:

source: The collections now contain pseudo instructions and instrumented instructions as well. These are opcodes with values ``>= MIN_PSEUDO_OPCODE`` and ``>= MIN_INSTRUMENTED_OPCODE``.
sv: Samlingarna innehåller nu även pseudoinstruktioner och instrumenterade instruktioner. Dessa är opkoder med värdena ``>= MIN_PSEUDO_OPCODE`` och ``>= MIN_INSTRUMENTED_OPCODE``.

source: Sequence of operation names, indexable using the bytecode.
sv: Sekvens av operationsnamn, indexerbara med hjälp av bytekoden.

source: Dictionary mapping operation names to bytecodes.
sv: Ordbok som mappar operationsnamn till bytecodes.

source: Sequence of all compare operation names.
sv: Sekvens av alla namn på jämförelseoperationer.

source: Sequence of bytecodes that use their argument.
sv: Sekvens av bytecodes som använder argumentet.

source: Sequence of bytecodes that access a constant.
sv: Sekvens av bytekoder som har tillgång till en konstant.

source: Sequence of bytecodes that access a :term:`free (closure) variable <closure variable>`. 'free' in this context refers to names in the current scope that are referenced by inner scopes or names in outer scopes that are referenced from this scope. It does *not* include references to global or builtin scopes.
sv: Sekvens av bytekoder som har tillgång till en :term:`free (closure) variabel <closure variable>`. "free" i detta sammanhang avser namn i det aktuella omfånget som refereras av inre omfång eller namn i yttre omfång som refereras från detta omfång. Det inkluderar *inte* referenser till globala eller inbyggda scope.

source: Sequence of bytecodes that access an attribute by name.
sv: Sekvens av bytecodes som öppnar ett attribut med namn.

source: Sequence of bytecodes that have a jump target. All jumps are relative.
sv: Sekvens av bytecodes som har ett hoppmål. Alla hopp är relativa.

source: Sequence of bytecodes that access a local variable.
sv: Sekvens av bytekoder som har åtkomst till en lokal variabel.

source: Sequence of bytecodes of Boolean operations.
sv: Sekvens av bytecodes för booleska operationer.

source: Sequence of bytecodes that set an exception handler.
sv: Sekvens av bytecodes som anger en undantagshanterare.

source: Sequence of bytecodes that have a relative jump target.
sv: Sekvens av bytecodes som har ett relativt hoppmål.

source: All jumps are now relative. Use :data:`hasjump`.
sv: Alla hopp är nu relativa. Använd :data:`hasjump`.

source: Sequence of bytecodes that have an absolute jump target.
sv: Sekvens av bytecodes som har ett absolut hoppmål.

source: All jumps are now relative. This list is empty.
sv: Alla hopp är nu relativa. Denna lista är tom.

source: built-in function
sv: inbyggd funktion

source: slice
sv: skiva
