Repository: yeager/python-docs-sv
Catalog: library/dis.po
Languages: sv

source: Pops a mapping off the stack and looks up the value for ``co_names[namei]``. If the name is not found there, looks it up in the globals and then the builtins, similar to :opcode:`LOAD_GLOBAL`. This is used for loading global variables in :ref:`annotation scopes <annotation-scopes>` within class bodies.
sv: Plockar upp en mappning från stacken och letar upp värdet för ``co_names[namei]``. Om namnet inte hittas där, letar det upp det i de globala variablerna och sedan i de inbyggda variablerna, liknande :opcode:`LOAD_GLOBAL`. Detta används för att ladda globala variabler i :ref:``annotation scopes <annotation-scopes>`` inom klasskroppar.

source: Constructs a new :class:`~string.templatelib.Template` from a tuple of strings and a tuple of interpolations and pushes the resulting instance onto the stack::
sv: Konstruerar en ny :class:`~string.templatelib.Template` från en tupel strängar och en tupel interpoleringar och lägger den resulterande instansen på stacken::

source: interpolations = STACK.pop() strings = STACK.pop() STACK.append(_build_template(strings, interpolations))
sv: interpolationer = STACK.pop() strängar = STACK.pop() STACK.append(_build_template(strängar, interpolationer))

source: Constructs a new :class:`~string.templatelib.Interpolation` from a value and its source expression and pushes the resulting instance onto the stack.
sv: Konstruerar en ny :class:`~string.templatelib.Interpolation` från ett värde och dess källuttryck och lägger den resulterande instansen på stacken.

source: If no conversion or format specification is present, ``format`` is set to ``2``.
sv: Om ingen konvertering eller formatspecifikation finns, sätts ``format`` till ``2``.

source: If the low bit of ``format`` is set, it indicates that the interpolation contains a format specification.
sv: Om den låga biten i ``format`` är inställd, indikerar det att interpoleringen innehåller en formatspecifikation.

source: If ``format >> 2`` is non-zero, it indicates that the interpolation contains a conversion. The value of ``format >> 2`` is the conversion type (``0`` for no conversion, ``1`` for ``!s``, ``2`` for ``!r``, and ``3`` for ``!a``)::
sv: Om ``format >> 2`` är icke-noll, indikerar det att interpoleringen innehåller en konvertering. Värdet på ``format >> 2`` är konverteringstypen (``0`` för ingen konvertering, ``1`` för ``!s``, ``2`` för ``!r`` och ``3`` för ``!a``)::

source: conversion = format >> 2 if format & 1: format_spec = STACK.pop() else: format_spec = None expression = STACK.pop() value = STACK.pop() STACK.append(_build_interpolation(value, expression, conversion, format_spec))
sv: konvertering = format >> 2 om format & 1: format_spec = STACK.pop() annat: format_spec = Ingen uttryck = STACK.pop() värde = STACK.pop() STACK.append(_build_interpolation(värde, uttryck, konvertering, format_spec))

source: Creates a tuple consuming *count* items from the stack, and pushes the resulting tuple onto the stack::
sv: Skapar en tupel som använder *antal* objekt från stacken, och lägger den resulterande tupeln på stacken::

source: if count == 0: value = () else: value = tuple(STACK[-count:]) STACK = STACK[:-count] STACK.append(value)
sv: om count == 0: värde = () i annat fall värde = tuple(STACK[-count:]) STACK = STACK[:-count] STACK.append(värde)

source: Works as :opcode:`BUILD_TUPLE`, but creates a list.
sv: Fungerar som :opcode:`BUILD_TUPLE`, men skapar en lista.

source: Works as :opcode:`BUILD_TUPLE`, but creates a set.
sv: Fungerar som :opcode:`BUILD_TUPLE`, men skapar en uppsättning.

source: Pushes a new dictionary object onto the stack. Pops ``2 * count`` items so that the dictionary holds *count* entries: ``{..., STACK[-4]: STACK[-3], STACK[-2]: STACK[-1]}``.
sv: Lägger ett nytt ordboksobjekt på stacken. Popar upp ``2 * count`` objekt så att ordboken innehåller *count* poster: ``{..., STACK[-4]: STACK[-3], STACK[-2]: STACK[-1]}``.

source: The dictionary is created from stack items instead of creating an empty dictionary pre-sized to hold *count* items.
sv: Ordboken skapas från stapelobjekt istället för att skapa en tom ordbok som är förstorad för att rymma *antal* objekt.

source: Concatenates *count* strings from the stack and pushes the resulting string onto the stack.
sv: Sammanfogar *antal* strängar från stacken och lägger den resulterande strängen på stacken.

source: Used to build lists.
sv: Används för att bygga listor.

source: Used to build sets.
sv: Används för att bygga set.

source: Used to build dicts.
sv: Används för att bygga dikter.

source: Like :opcode:`DICT_UPDATE` but raises an exception for duplicate keys.
sv: Som :opcode:`DICT_UPDATE` men ger upphov till ett undantag för dubbla nycklar.

source: If the low bit of ``namei`` is not set, this replaces ``STACK[-1]`` with ``getattr(STACK[-1], co_names[namei>>1])``.
sv: Om den låga biten i ``namei`` inte är inställd, ersätts ``STACK[-1]`` med ``getattr(STACK[-1], co_names[namei>>1])``.

source: If the low bit of ``namei`` is set, this will attempt to load a method named ``co_names[namei>>1]`` from the ``STACK[-1]`` object. ``STACK[-1]`` is popped. This bytecode distinguishes two cases: if ``STACK[-1]`` has a method with the correct name, the bytecode pushes the unbound method and ``STACK[-1]``. ``STACK[-1]`` will be used as the first argument (``self``) by :opcode:`CALL` or :opcode:`CALL_KW` when calling the unbound method. Otherwise, ``NULL`` and the object returned by the attribute lookup are pushed.
sv: Om den låga biten i ``namei`` är satt, kommer detta att försöka ladda en metod med namnet ``co_names[namei>>1]`` från ``STACK[-1]``-objektet. ``STACK[-1]`` poppas. Denna bytecode skiljer på två fall: om ``STACK[-1]`` har en metod med rätt namn, pushar bytecoden den obundna metoden och ``STACK[-1]``. ``STACK[-1]`` kommer att användas som det första argumentet (``self``) av :opcode:`CALL` eller :opcode:`CALL_KW` när den obundna metoden anropas. Annars skjuts ``NULL`` och det objekt som returneras av attributuppslagningen.

source: If the low bit of ``namei`` is set, then a ``NULL`` or ``self`` is pushed to the stack before the attribute or unbound method respectively.
sv: Om den låga biten i ``namei`` är satt, läggs en ``NULL`` eller ``self`` till stacken före attributet respektive den obundna metoden.

source: This opcode implements :func:`super`, both in its zero-argument and two-argument forms (e.g. ``super().method()``, ``super().attr`` and ``super(cls, self).method()``, ``super(cls, self).attr``).
sv: Denna opcode implementerar :func:`super`, både i dess nollargument- och tvåargumentform (t.ex. ``super().method()``, ``super().attr`` och ``super(cls, self).method()``, ``super(cls, self).attr``).

source: It pops three values from the stack (from top of stack down):
sv: Den plockar ut tre värden från stacken (från toppen av stacken och nedåt):

source: ``self``: the first argument to the current method
sv: ``self``: det första argumentet till den aktuella metoden

source: ``cls``: the class within which the current method was defined
sv: ``cls``: den klass inom vilken den aktuella metoden definierades

source: the global ``super``
sv: den globala ``super``

source: With respect to its argument, it works similarly to :opcode:`LOAD_ATTR`, except that ``namei`` is shifted left by 2 bits instead of 1.
sv: När det gäller dess argument fungerar den på samma sätt som :opcode:`LOAD_ATTR`, förutom att ``namei`` vänsterförskjuts med 2 bitar istället för 1.

source: The low bit of ``namei`` signals to attempt a method load, as with :opcode:`LOAD_ATTR`, which results in pushing ``NULL`` and the loaded method. When it is unset a single value is pushed to the stack.
sv: Den låga biten i ``namei`` signalerar att man ska försöka ladda en metod, som med :opcode:`LOAD_ATTR`, vilket resulterar i att ``NULL`` och den laddade metoden skjuts upp. När den inte är inställd flyttas ett enda värde till stacken.

source: The second-low bit of ``namei``, if set, means that this was a two-argument call to :func:`super` (unset means zero-argument).
sv: Den näst lägsta biten i ``namei``, om den är satt, betyder att detta var ett anrop med två argument till :func:`super` (om den inte är satt betyder det noll argument).

source: Performs a Boolean operation. The operation name can be found in ``cmp_op[opname >> 5]``. If the fifth-lowest bit of ``opname`` is set (``opname & 16``), the result should be coerced to ``bool``.
sv: Utför en boolesk operation. Operationsnamnet kan hittas i ``cmp_op[opname >> 5]``. Om den femte lägsta biten i ``opname`` är inställd (``opname & 16``), bör resultatet tvingas till ``bool``.

source: The fifth-lowest bit of the oparg now indicates a forced conversion to :class:`bool`.
sv: Den femte lägsta biten i oparget indikerar nu en tvingad konvertering till :class:`bool`.

source: Performs ``is`` comparison, or ``is not`` if ``invert`` is 1.
sv: Utför jämförelse med ``is``, eller ``is not`` om ``invert`` är 1.

source: Performs ``in`` comparison, or ``not in`` if ``invert`` is 1.
sv: Utför jämförelse ``in``, eller ``not in`` om ``invert`` är 1.

source: Imports the module ``co_names[namei]``. ``STACK[-1]`` and ``STACK[-2]`` are popped and provide the *fromlist* and *level* arguments of :func:`__import__`. The module object is pushed onto the stack. The current namespace is not affected: for a proper import statement, a subsequent :opcode:`STORE_FAST` instruction modifies the namespace.
sv: Importerar modulen ``co_names[namei]``. ``STACK[-1]`` och ``STACK[-2]`` poppas och ger argumenten *fromlist* och *level* i :func:`__import__`. Modulobjektet skjuts upp på stacken. Den aktuella namnrymden påverkas inte: för en korrekt importsats modifieras namnrymden av en efterföljande :opcode:`STORE_FAST'-instruktion.

source: Loads the attribute ``co_names[namei]`` from the module found in ``STACK[-1]``. The resulting object is pushed onto the stack, to be subsequently stored by a :opcode:`STORE_FAST` instruction.
sv: Läser in attributet ``co_names[namei]`` från den modul som finns i ``STACK[-1]``. Det resulterande objektet läggs på stacken, för att sedan lagras med en :opcode:`STORE_FAST` instruktion.

source: Increments bytecode counter by *delta*.
sv: Ökar bytekodsräknaren med *delta*.

source: Decrements bytecode counter by *delta*. Checks for interrupts.
sv: Minskar bytekodsräknaren med *delta*. Kontrollerar för avbrott.

source: Decrements bytecode counter by *delta*. Does not check for interrupts.
sv: Minskar bytekodsräknaren med *delta*. Kontrollerar inte för avbrott.

source: If ``STACK[-1]`` is true, increments the bytecode counter by *delta*. ``STACK[-1]`` is popped.
sv: Om ``STACK[-1]`` är true, ökas bytecode-räknaren med *delta*. om ``STACK[-1]`` är poppad.

source: The oparg is now a relative delta rather than an absolute target. This opcode is a pseudo-instruction, replaced in final bytecode by the directed versions (forward/backward).
sv: Oparget är nu ett relativt delta snarare än ett absolut mål. Denna opcode är en pseudo-instruktion som i den slutliga bytekoden ersätts av de riktade versionerna (framåt/bakåt).

source: This is no longer a pseudo-instruction.
sv: Detta är inte längre en pseudo-instruktion.

source: If ``STACK[-1]`` is false, increments the bytecode counter by *delta*. ``STACK[-1]`` is popped.
sv: Om ``STACK[-1]`` är false, ökas bytecode-räknaren med *delta*. ``STACK[-1]`` är poppad.

source: If ``STACK[-1]`` is not ``None``, increments the bytecode counter by *delta*. ``STACK[-1]`` is popped.
sv: Om ``STACK[-1]`` inte är ``None``, ökas bytekodräknaren med *delta*. ``STACK[-1]`` poppas.

source: If ``STACK[-1]`` is ``None``, increments the bytecode counter by *delta*. ``STACK[-1]`` is popped.
sv: Om ``STACK[-1]`` är ``None``, ökas bytekodsräknaren med *delta*. ``STACK[-1]`` är poppat.

source: ``STACK[-1]`` is an :term:`iterator`. Call its :meth:`~iterator.__next__` method. If this yields a new value, push it on the stack (leaving the iterator below it). If the iterator indicates it is exhausted then the byte code counter is incremented by *delta*.
sv: ``STACK[-1]`` är en :term:`iterator`. Anropa dess :meth:`~iterator.__next__`-metod. Om detta ger ett nytt värde, lägg det på stacken (och lämna iteratorn under det). Om iteratorn indikerar att den är uttömd ökas bytekodsräknaren med *delta*.

source: Up until 3.11 the iterator was popped when it was exhausted.
sv: Fram till 3.11 poppades iteratorn när den var uttömd.

source: Loads the global named ``co_names[namei>>1]`` onto the stack.
sv: Läser in den globala filen med namnet ``co_names[namei>>1]`` på stacken.

source: If the low bit of ``namei`` is set, then a ``NULL`` is pushed to the stack before the global variable.
sv: Om den låga biten i ``namei`` är inställd, skjuts en ``NULL`` till stacken före den globala variabeln.

source: Pushes a reference to the local ``co_varnames[var_num]`` onto the stack.
sv: Lägger en referens till den lokala ``co_varnames[var_num]`` på stacken.

source: This opcode is now only used in situations where the local variable is guaranteed to be initialized. It cannot raise :exc:`UnboundLocalError`.
sv: Denna opcode används nu endast i situationer där den lokala variabeln garanterat kommer att initialiseras. Den kan inte ge upphov till :exc:`UnboundLocalError`.

source: Pushes a borrowed reference to the local ``co_varnames[var_num]`` onto the stack.
sv: Lägger en lånad referens till den lokala ``co_varnames[var_num]`` på stacken.

source: Pushes references to ``co_varnames[var_nums >> 4]`` and ``co_varnames[var_nums & 15]`` onto the stack.
sv: Flyttar referenser till ``co_varnames[var_nums >> 4]`` och ``co_varnames[var_nums & 15]`` till stacken.

source: Pushes borrowed references to ``co_varnames[var_nums >> 4]`` and ``co_varnames[var_nums & 15]`` onto the stack.
sv: Lägger upp lånade referenser till ``co_varnames[var_nums >> 4]`` och ``co_varnames[var_nums & 15]`` på stacken.

source: Pushes a reference to the local ``co_varnames[var_num]`` onto the stack, raising an :exc:`UnboundLocalError` if the local variable has not been initialized.
sv: Lägger en referens till den lokala ``co_varnames[var_num]`` på stacken, vilket ger upphov till :exc:`UnboundLocalError` om den lokala variabeln inte har initialiserats.

source: Pushes a reference to the local ``co_varnames[var_num]`` onto the stack (or pushes ``NULL`` onto the stack if the local variable has not been initialized) and sets ``co_varnames[var_num]`` to ``NULL``.
sv: Lägger en referens till den lokala ``co_varnames[var_num]`` på stacken (eller lägger ``NULL`` på stacken om den lokala variabeln inte har initialiserats) och sätter ``co_varnames[var_num]`` till ``NULL``.

source: Stores ``STACK.pop()`` into the local ``co_varnames[var_num]``.
sv: Lagrar ``STACK.pop()`` i den lokala ``co_varnames[var_num]``.

source: Stores ``STACK[-1]`` into ``co_varnames[var_nums >> 4]`` and ``STACK[-2]`` into ``co_varnames[var_nums & 15]``.
sv: Lagrar ``STACK[-1]`` i ``co_varnames[var_nums >> 4]`` och ``STACK[-2]`` i ``co_varnames[var_nums & 15]``.

source: Stores ``STACK.pop()`` into the local ``co_varnames[var_nums >> 4]`` and pushes a reference to the local ``co_varnames[var_nums & 15]`` onto the stack.
sv: Lagrar ``STACK.pop()`` i den lokala ``co_varnames[var_nums >> 4]`` och lägger en referens till den lokala ``co_varnames[var_nums & 15]`` på stacken.

source: Deletes local ``co_varnames[var_num]``.
sv: Raderar lokala ``co_varnames[var_num]``.

source: Creates a new cell in slot ``i``. If that slot is nonempty then that value is stored into the new cell.
sv: Skapar en ny cell i slot ``i``. Om den platsen inte är tom lagras värdet i den nya cellen.

source: Loads the cell contained in slot ``i`` of the "fast locals" storage. Pushes a reference to the object the cell contains on the stack.
sv: Laddar cellen som finns på plats ``i`` i "fast locals"-lagret. Lägger en referens till det objekt som cellen innehåller på stacken.

source: ``i`` is no longer offset by the length of :attr:`~codeobject.co_varnames`.
sv: ``i`` kompenseras inte längre av längden på :attr:`~codeobject.co_varnames`.

source: Pops a mapping off the stack and looks up the name associated with slot ``i`` of the "fast locals" storage in this mapping. If the name is not found there, loads it from the cell contained in slot ``i``, similar to :opcode:`LOAD_DEREF`. This is used for loading :term:`closure variables <closure variable>` in class bodies (which previously used :opcode:`!LOAD_CLASSDEREF`) and in :ref:`annotation scopes <annotation-scopes>` within class bodies.
sv: Tar en mappning från stacken och letar upp det namn som är associerat med plats ``i`` i "fast locals"-lagret i denna mappning. Om namnet inte hittas där, laddas det från cellen som finns i slot ``i``, liknande :opcode:`LOAD_DEREF`. Detta används för att läsa in :term:`closure variables <closure variable>` i class bodies (som tidigare använde :opcode:`!LOAD_CLASSDEREF`) och i :ref:`annotation scopes <annotation-scopes>` inom class bodies.

source: Stores ``STACK.pop()`` into the cell contained in slot ``i`` of the "fast locals" storage.
sv: Lagrar ``STACK.pop()`` i cellen som finns på plats ``i`` i "fast locals"-lagret.

source: Empties the cell contained in slot ``i`` of the "fast locals" storage. Used by the :keyword:`del` statement.
sv: Tömmer cellen som finns i plats ``i`` i lagret för "snabba lokala". Används av :keyword:`del`-satsen.

source: Copies the ``n`` :term:`free (closure) variables <closure variable>` from the closure into the frame. Removes the need for special code on the caller's side when calling closures.
sv: Kopierar ``n`` :term:`free (closure) variables <closure variable>` från closure till frame. Tar bort behovet av specialkod på anroparens sida vid anrop av closures.

source: Raises an exception using one of the 3 forms of the ``raise`` statement, depending on the value of *argc*:
sv: Utlöser ett undantag med hjälp av en av de tre formerna av ``raise``-satsen, beroende på värdet på *argc*:

source: 0: ``raise`` (re-raise previous exception)
sv: 0: ``raise`` (åter höja tidigare undantag)

source: 1: ``raise STACK[-1]`` (raise exception instance or type at ``STACK[-1]``)
sv: 1: ``raise STACK[-1]`` (skapa undantag för instans eller typ vid ``STACK[-1]``)

source: Calls a callable object with the number of arguments specified by ``argc``. On the stack are (in ascending order):
sv: Anropar ett anropsbart objekt med det antal argument som anges av ``argc``. På stacken finns (i stigande ordning):

source: The callable
sv: Den infordringsbara

source: ``self`` or ``NULL``
sv: ``själv`` eller ``NULL``

source: The remaining positional arguments
sv: De återstående positionella argumenten

source: ``argc`` is the total of the positional arguments, excluding ``self``.
sv: ``argc`` är summan av de positionella argumenten, exklusive ``self``.

source: ``CALL`` pops all arguments and the callable object off the stack, calls the callable object with those arguments, and pushes the return value returned by the callable object.
sv: ``CALL`` plockar alla argument och det anropbara objektet från stacken, anropar det anropbara objektet med dessa argument och flyttar returvärdet som returneras av det anropbara objektet.

source: The callable now always appears at the same position on the stack.
sv: Det anropbara objektet visas nu alltid på samma plats i stacken.

source: Calls with keyword arguments are now handled by :opcode:`CALL_KW`.
sv: Anrop med nyckelordsargument hanteras nu av :opcode:`CALL_KW`.

source: Calls a callable object with the number of arguments specified by ``argc``, including one or more named arguments. On the stack are (in ascending order):
sv: Anropar ett anropsbart objekt med det antal argument som anges av ``argc``, inklusive ett eller flera namngivna argument. På stacken finns (i stigande ordning):

source: The named arguments
sv: De namngivna argumenten

source: A :class:`tuple` of keyword argument names
sv: En :class:`tupel` av nyckelordsargumentnamn

source: ``argc`` is the total of the positional and named arguments, excluding ``self``. The length of the tuple of keyword argument names is the number of named arguments.
sv: ``argc`` är summan av de positionella och namngivna argumenten, exklusive ``self``. Längden på tupeln med nyckelordsargumentnamn är antalet namngivna argument.

source: ``CALL_KW`` pops all arguments, the keyword names, and the callable object off the stack, calls the callable object with those arguments, and pushes the return value returned by the callable object.
sv: ``CALL_KW`` plockar alla argument, nyckelordsnamnen och det anropbara objektet från stacken, anropar det anropbara objektet med dessa argument och flyttar returvärdet som returneras av det anropbara objektet.

source: Calls a callable object with variable set of positional and keyword arguments. If the lowest bit of *flags* is set, the top of the stack contains a mapping object containing additional keyword arguments. Before the callable is called, the mapping object and iterable object are each "unpacked" and their contents passed in as keyword and positional arguments respectively. ``CALL_FUNCTION_EX`` pops all arguments and the callable object off the stack, calls the callable object with those arguments, and pushes the return value returned by the callable object.
sv: Anropar ett anropsbart objekt med en variabel uppsättning positions- och nyckelordsargument. Om den lägsta biten i *flags* är inställd, innehåller toppen av stacken ett mappningsobjekt som innehåller ytterligare nyckelordsargument. Innan den anropbara funktionen anropas "packas" mappningsobjektet och iterable-objektet upp och deras innehåll skickas in som nyckelords- respektive positionsargument. ``CALL_FUNCTION_EX`` plockar alla argument och det anropbara objektet från stacken, anropar det anropbara objektet med dessa argument och flyttar returvärdet som returneras av det anropbara objektet.

source: Pushes a ``NULL`` to the stack. Used in the call sequence to match the ``NULL`` pushed by :opcode:`LOAD_METHOD` for non-method calls.
sv: Skickar en ``NULL`` till stacken. Används i anropssekvensen för att matcha den ``NULL`` som pushas av :opcode:`LOAD_METHOD` för icke-metodanrop.

source: Pushes a new function object on the stack built from the code object at ``STACK[-1]``.
sv: Lägger ett nytt funktionsobjekt på stacken som byggts upp från kodobjektet på ``STACK[-1]``.

source: Flag value ``0x04`` is a tuple of strings instead of dictionary
sv: Flaggvärdet ``0x04`` är en tupel av strängar istället för en ordbok

source: Qualified name at ``STACK[-1]`` was removed.
sv: Kvalificerat namn vid ``STACK[-1]`` togs bort.

source: Extra function attributes on the stack, signaled by oparg flags, were removed. They now use :opcode:`SET_FUNCTION_ATTRIBUTE`.
sv: Extra funktionsattribut på stacken, som signaleras av oparg-flaggor, har tagits bort. De använder nu :opcode:`SET_FUNCTION_ATTRIBUTE`.

source: Sets an attribute on a function object. Expects the function at ``STACK[-1]`` and the attribute value to set at ``STACK[-2]``; consumes both and leaves the function at ``STACK[-1]``. The flag determines which attribute to set:
sv: Ställer in ett attribut på ett funktionsobjekt. Förväntar sig funktionen på ``STACK[-1]`` och attributvärdet som ska sättas på ``STACK[-2]``; konsumerar båda och lämnar funktionen på ``STACK[-1]``. Flaggan avgör vilket attribut som ska ställas in:

source: ``0x01`` a tuple of default values for positional-only and positional-or-keyword parameters in positional order
sv: ``0x01`` en tupel av standardvärden för parametrar som endast är positionella och positionella eller nyckelord i positionell ordning

source: ``0x02`` a dictionary of keyword-only parameters' default values
sv: ``0x02`` en ordbok med standardvärden för parametrar som endast innehåller nyckelord
