Repository: yeager/python-docs-sv
Catalog: library/doctest.po
Languages: sv

source: Doctest can't guess whether your expected output came from an exception traceback or from ordinary printing. So, e.g., an example that expects ``ValueError: 42 is prime`` will pass whether :exc:`ValueError` is actually raised or if the example merely prints that traceback text. In practice, ordinary output rarely begins with a traceback header line, so this doesn't create real problems.
sv: Doctest kan inte gissa om den förväntade utmatningen kommer från en exception traceback eller från vanlig utskrift. Så, t.ex., ett exempel som förväntar sig ``ValueError: 42 is prime`` kommer att godkännas oavsett om :exc:`ValueError` faktiskt uppstår eller om exemplet bara skriver ut den spårningstexten. I praktiken börjar vanliga utdata sällan med en spårningshuvudrad, så det här skapar inga verkliga problem.

source: Each line of the traceback stack (if present) must be indented further than the first line of the example, *or* start with a non-alphanumeric character. The first line following the traceback header indented the same and starting with an alphanumeric is taken to be the start of the exception detail. Of course this does the right thing for genuine tracebacks.
sv: Varje rad i spårningsstacken (om sådan finns) måste vara indragen längre än den första raden i exemplet, *eller* börja med ett icke-alfanumeriskt tecken. Den första raden efter spårningshuvudet som är indragen på samma sätt och som börjar med ett alfanumeriskt tecken anses vara början på undantagsdetaljen. Naturligtvis gör detta det rätta för äkta spårningar.

source: When the :const:`IGNORE_EXCEPTION_DETAIL` doctest option is specified, everything following the leftmost colon and any module information in the exception name is ignored.
sv: När doctest-alternativet :const:`IGNORE_EXCEPTION_DETAIL` anges ignoreras allt som följer efter kolon längst till vänster och all modulinformation i undantagsnamnet.

source: The interactive shell omits the traceback header line for some :exc:`SyntaxError`\ s. But doctest uses the traceback header line to distinguish exceptions from non-exceptions. So in the rare case where you need to test a :exc:`!SyntaxError` that omits the traceback header, you will need to manually add the traceback header line to your test example.
sv: Det interaktiva skalet utelämnar spårningshuvudraden för vissa :exc:`SyntaxError`. Men doctest använder spårningshuvudraden för att skilja undantag från icke-undantag. Så i det sällsynta fall då du behöver testa ett :exc:`!SyntaxError` som utelämnar traceback-rubriken, måste du manuellt lägga till traceback-rubriken i ditt testexempel.

source: For some exceptions, Python displays the position of the error using ``^`` markers and tildes::
sv: För vissa undantag visar Python felets position med hjälp av ``^``-markörer och tildes::

source: Since the lines showing the position of the error come before the exception type and detail, they are not checked by doctest. For example, the following test would pass, even though it puts the ``^`` marker in the wrong location::
sv: Eftersom raderna som visar felets position kommer före undantagstypen och detaljerna, kontrolleras de inte av doctest. Till exempel skulle följande test godkännas, även om det placerar ``^``-markören på fel plats::

source: Option Flags
sv: Flaggor för alternativ

source: A number of option flags control various aspects of doctest's behavior. Symbolic names for the flags are supplied as module constants, which can be :ref:`bitwise ORed <bitwise>` together and passed to various functions. The names can also be used in :ref:`doctest directives <doctest-directives>`, and may be passed to the doctest command line interface via the ``-o`` option.
sv: Ett antal optionsflaggor styr olika aspekter av doctests beteende. Symboliska namn för flaggorna anges som modulkonstanter, som kan :ref:`bitwise ORed <bitwise>` ihop och skickas till olika funktioner. Namnen kan också användas i :ref:``doctest-direktiv <doctest-directives>`, och kan skickas till doctests kommandoradsgränssnitt via alternativet ``-o``.

source: The first group of options define test semantics, controlling aspects of how doctest decides whether actual output matches an example's expected output:
sv: Den första gruppen av alternativ definierar testets semantik och styr aspekter av hur doctest avgör om den faktiska utdata stämmer överens med ett exempels förväntade utdata:

source: By default, if an expected output block contains just ``1``, an actual output block containing just ``1`` or just ``True`` is considered to be a match, and similarly for ``0`` versus ``False``. When :const:`DONT_ACCEPT_TRUE_FOR_1` is specified, neither substitution is allowed. The default behavior caters to that Python changed the return type of many functions from integer to boolean; doctests expecting "little integer" output still work in these cases. This option will probably go away, but not for several years.
sv: Som standard, om ett förväntat utdatablock innehåller bara ``1``, anses ett faktiskt utdatablock som innehåller bara ``1`` eller bara ``True`` vara en matchning, och på samma sätt för ``0`` kontra ``False``. När :const:`DONT_ACCEPT_TRUE_FOR_1` anges tillåts ingen av dessa substitutioner. Standardbeteendet tar hänsyn till att Python ändrade returtypen för många funktioner från heltal till boolean; doktester som förväntar sig "little integer"-utdata fungerar fortfarande i dessa fall. Detta alternativ kommer förmodligen att försvinna, men inte på flera år.

source: By default, if an expected output block contains a line containing only the string ``<BLANKLINE>``, then that line will match a blank line in the actual output. Because a genuinely blank line delimits the expected output, this is the only way to communicate that a blank line is expected. When :const:`DONT_ACCEPT_BLANKLINE` is specified, this substitution is not allowed.
sv: Om ett förväntat utdatablock innehåller en rad som bara innehåller strängen ``<BLANKLINE>``, kommer den raden som standard att matcha en tom rad i den faktiska utdatan. Eftersom en blank rad verkligen avgränsar den förväntade utdata, är detta det enda sättet att kommunicera att en blank rad förväntas. När :const:`DONT_ACCEPT_BLANKLINE` anges är denna substitution inte tillåten.

source: When specified, all sequences of whitespace (blanks and newlines) are treated as equal. Any sequence of whitespace within the expected output will match any sequence of whitespace within the actual output. By default, whitespace must match exactly. :const:`NORMALIZE_WHITESPACE` is especially useful when a line of expected output is very long, and you want to wrap it across multiple lines in your source.
sv: När detta anges behandlas alla sekvenser av blanktecken (blanksteg och nya linjer) som lika. Alla sekvenser av blanksteg i den förväntade utskriften kommer att matcha alla sekvenser av blanksteg i den faktiska utskriften. Som standard måste blanksteg matcha exakt. :const:`NORMALIZE_WHITESPACE` är särskilt användbart när en rad med förväntad utdata är mycket lång och du vill lägga den över flera rader i källan.

source: When specified, an ellipsis marker (``...``) in the expected output can match any substring in the actual output. This includes substrings that span line boundaries, and empty substrings, so it's best to keep usage of this simple. Complicated uses can lead to the same kinds of "oops, it matched too much!" surprises that ``.*`` is prone to in regular expressions.
sv: När detta anges kan en ellipsmarkör (``...``) i den förväntade utdata matcha vilken delsträng som helst i den faktiska utdata. Detta inkluderar substrängar som sträcker sig över radgränser och tomma substrängar, så det är bäst att hålla användningen av detta enkel. Komplicerade användningar kan leda till samma typ av "oops, det matchade för mycket!" överraskningar som ``.*`` är benägen att i reguljära uttryck.

source: When specified, doctests expecting exceptions pass so long as an exception of the expected type is raised, even if the details (message and fully qualified exception name) don't match.
sv: När detta anges godkänns doctests som väntar på undantag så länge ett undantag av den förväntade typen uppstår, även om detaljerna (meddelande och fullständigt kvalificerat undantagsnamn) inte stämmer överens.

source: For example, an example expecting ``ValueError: 42`` will pass if the actual exception raised is ``ValueError: 3*14``, but will fail if, say, a :exc:`TypeError` is raised instead. It will also ignore any fully qualified name included before the exception class, which can vary between implementations and versions of Python and the code/libraries in use. Hence, all three of these variations will work with the flag specified:
sv: Till exempel kommer ett exempel som förväntar sig ``ValueError: 42`` kommer att godkännas om det faktiska undantaget är ``ValueError: 3*14``, men kommer att misslyckas om, säg, ett :exc:`TypeError` tas upp istället. Den kommer också att ignorera alla fullständigt kvalificerade namn som ingår före undantagsklassen, vilket kan variera mellan implementationer och versioner av Python och den kod / bibliotek som används. Därför kommer alla dessa tre variationer att fungera med den angivna flaggan:

source: Note that :const:`ELLIPSIS` can also be used to ignore the details of the exception message, but such a test may still fail based on whether the module name is present or matches exactly.
sv: Observera att :const:`ELLIPSIS` också kan användas för att ignorera detaljerna i undantagsmeddelandet, men ett sådant test kan fortfarande misslyckas beroende på om modulnamnet finns eller matchar exakt.

source: :const:`IGNORE_EXCEPTION_DETAIL` now also ignores any information relating to the module containing the exception under test.
sv: :const:`IGNORE_EXCEPTION_DETAIL` ignorerar nu även all information som rör den modul som innehåller det undantag som testas.

source: When specified, do not run the example at all. This can be useful in contexts where doctest examples serve as both documentation and test cases, and an example should be included for documentation purposes, but should not be checked. E.g., the example's output might be random; or the example might depend on resources which would be unavailable to the test driver.
sv: Om detta anges ska exemplet inte köras alls. Detta kan vara användbart i sammanhang där doctest-exempel fungerar som både dokumentation och testfall, och ett exempel bör inkluderas för dokumentationsändamål, men inte bör kontrolleras. Exemplets utdata kan t.ex. vara slumpmässig, eller så kan exemplet vara beroende av resurser som inte är tillgängliga för testföraren.

source: The SKIP flag can also be used for temporarily "commenting out" examples.
sv: SKIP-flaggan kan också användas för att tillfälligt "kommentera bort" exempel.

source: A bitmask or'ing together all the comparison flags above.
sv: En bitmask som kombinerar alla jämförelseflaggorna ovan.

source: The second group of options controls how test failures are reported:
sv: Den andra gruppen av alternativ styr hur testfel rapporteras:

source: When specified, failures that involve multi-line expected and actual outputs are displayed using a unified diff.
sv: När så anges visas fel som omfattar förväntade och faktiska utdata på flera rader med en enhetlig diff.

source: When specified, failures that involve multi-line expected and actual outputs will be displayed using a context diff.
sv: Om detta anges kommer fel som innehåller flera rader med förväntade och faktiska utdata att visas med hjälp av en kontextdiff.

source: When specified, differences are computed by ``difflib.Differ``, using the same algorithm as the popular :file:`ndiff.py` utility. This is the only method that marks differences within lines as well as across lines. For example, if a line of expected output contains digit ``1`` where actual output contains letter ``l``, a line is inserted with a caret marking the mismatching column positions.
sv: När detta anges beräknas skillnaderna av ``difflib.Differ``, som använder samma algoritm som det populära verktyget :file:`ndiff.py`. Detta är den enda metod som markerar skillnader inom rader såväl som mellan rader. Om t.ex. en rad med förväntad utmatning innehåller siffran ``1`` medan den faktiska utmatningen innehåller bokstaven ``l``, infogas en rad med en caret som markerar de felaktiga kolumnpositionerna.

source: When specified, display the first failing example in each doctest, but suppress output for all remaining examples. This will prevent doctest from reporting correct examples that break because of earlier failures; but it might also hide incorrect examples that fail independently of the first failure. When :const:`REPORT_ONLY_FIRST_FAILURE` is specified, the remaining examples are still run, and still count towards the total number of failures reported; only the output is suppressed.
sv: När detta anges visas det första misslyckade exemplet i varje doctest, men utdata för alla återstående exempel undertrycks. Detta kommer att förhindra doctest från att rapportera korrekta exempel som misslyckas på grund av tidigare misslyckanden; men det kan också dölja felaktiga exempel som misslyckas oberoende av det första misslyckandet. När :const:`REPORT_ONLY_FIRST_FAILURE` anges, körs de återstående exemplen fortfarande och räknas fortfarande in i det totala antalet fel som rapporteras; endast utdata undertrycks.

source: When specified, exit after the first failing example and don't attempt to run the remaining examples. Thus, the number of failures reported will be at most 1. This flag may be useful during debugging, since examples after the first failure won't even produce debugging output.
sv: När den anges avslutas programmet efter det första misslyckade exemplet och försöker inte köra de återstående exemplen. Antalet misslyckanden som rapporteras blir således högst 1. Denna flagga kan vara användbar under felsökning, eftersom exempel efter det första misslyckandet inte ens kommer att producera felsökningsutdata.

source: A bitmask or'ing together all the reporting flags above.
sv: En bitmask som kombinerar alla rapporteringsflaggor ovan.

source: There is also a way to register new option flag names, though this isn't useful unless you intend to extend :mod:`doctest` internals via subclassing:
sv: Det finns också ett sätt att registrera nya alternativflaggnamn, men detta är inte användbart om du inte tänker utöka :mod:`doctest` internals via underklassning:

source: Create a new option flag with a given name, and return the new flag's integer value. :func:`register_optionflag` can be used when subclassing :class:`OutputChecker` or :class:`DocTestRunner` to create new options that are supported by your subclasses. :func:`register_optionflag` should always be called using the following idiom::
sv: Skapa en ny alternativflagga med ett givet namn och returnera den nya flaggans heltalsvärde. :func:`register_optionflag` kan användas när du underklassar :class:`OutputChecker` eller :class:`DocTestRunner` för att skapa nya alternativ som stöds av dina underklasser. :func:`register_optionflag` bör alltid anropas med följande idiom::

source: Directives
sv: Direktiv

source: Doctest directives may be used to modify the :ref:`option flags <doctest-options>` for an individual example. Doctest directives are special Python comments following an example's source code:
sv: Doctest-direktiv kan användas för att ändra :ref:`alternativflaggor <doctest-options>` för ett enskilt exempel. Doctest-direktiv är speciella Python-kommentarer som följer efter ett exempels källkod:

source: Whitespace is not allowed between the ``+`` or ``-`` and the directive option name. The directive option name can be any of the option flag names explained above.
sv: Whitespace är inte tillåtet mellan ``+`` eller ``-`` och namnet på direktivalternativet. Namnet på direktivalternativet kan vara vilket som helst av de flaggnamn för alternativ som förklaras ovan.

source: An example's doctest directives modify doctest's behavior for that single example. Use ``+`` to enable the named behavior, or ``-`` to disable it.
sv: Ett exempels doctest-direktiv ändrar doctests beteende för det enskilda exemplet. Använd ``+`` för att aktivera det angivna beteendet, eller ``-`` för att inaktivera det.

source: For example, this test passes:
sv: Det här testet är till exempel godkänt:

source: Without the directive it would fail, both because the actual output doesn't have two blanks before the single-digit list elements, and because the actual output is on a single line. This test also passes, and also requires a directive to do so:
sv: Utan direktivet skulle det misslyckas, både för att den faktiska utmatningen inte har två blanksteg före de ensiffriga listelementen och för att den faktiska utmatningen är på en enda rad. Det här testet är också godkänt och kräver också ett direktiv för att bli det:

source: Multiple directives can be used on a single physical line, separated by commas:
sv: Flera direktiv kan användas på en och samma fysiska rad, åtskilda med kommatecken:

source: If multiple directive comments are used for a single example, then they are combined:
sv: Om flera direktivkommentarer används för ett och samma exempel, kombineras de:

source: As the previous example shows, you can add ``...`` lines to your example containing only directives. This can be useful when an example is too long for a directive to comfortably fit on the same line:
sv: Som det föregående exemplet visar kan du lägga till ``...`` rader till ditt exempel som bara innehåller direktiv. Detta kan vara användbart när ett exempel är för långt för att ett direktiv ska rymmas på samma rad:

source: Note that since all options are disabled by default, and directives apply only to the example they appear in, enabling options (via ``+`` in a directive) is usually the only meaningful choice. However, option flags can also be passed to functions that run doctests, establishing different defaults. In such cases, disabling an option via ``-`` in a directive can be useful.
sv: Observera att eftersom alla alternativ är inaktiverade som standard och direktiv endast gäller för det exempel de förekommer i, är aktivering av alternativ (via ``+`` i ett direktiv) vanligtvis det enda meningsfulla valet. Alternativflaggor kan emellertid också skickas till funktioner som kör doctests och fastställa olika standardvärden. I sådana fall kan det vara användbart att inaktivera ett alternativ via ``-`` i ett direktiv.

source: Warnings
sv: Varningar

source: :mod:`doctest` is serious about requiring exact matches in expected output. If even a single character doesn't match, the test fails. This will probably surprise you a few times, as you learn exactly what Python does and doesn't guarantee about output. For example, when printing a set, Python doesn't guarantee that the element is printed in any particular order, so a test like ::
sv: :mod:`doctest` är seriös när det gäller att kräva exakta matchningar i förväntad utdata. Om inte ens ett enda tecken matchar, misslyckas testet. Detta kommer förmodligen att överraska dig några gånger, eftersom du lär dig exakt vad Python gör och inte garanterar om utdata. Till exempel, när du skriver ut en uppsättning garanterar Python inte att elementen skrivs ut i någon särskild ordning, så ett test som ::

source: >>> foo() {"spam", "eggs"}
sv: >>> foo() {"spam", "ägg"}

source: is vulnerable! One workaround is to do ::
sv: är sårbar! En lösning är att göra ::

source: >>> foo() == {"spam", "eggs"} True
sv: >>> foo() == {"spam", "ägg"} True

source: instead. Another is to do ::
sv: istället. Ett annat är att göra ::

source: There are others, but you get the idea.
sv: Det finns fler, men du förstår säkert.

source: Another bad idea is to print things that embed an object address, like
sv: En annan dålig idé är att skriva ut saker som innehåller en objektadress, t.ex

source: The :const:`ELLIPSIS` directive gives a nice approach for the last example:
sv: Direktivet :const:`ELLIPSIS` ger en bra metod för det sista exemplet:

source: Floating-point numbers are also subject to small output variations across platforms, because Python defers to the platform C library for some floating-point calculations, and C libraries vary widely in quality here. ::
sv: Flyttal är också föremål för små variationer i utdata mellan plattformar, eftersom Python använder plattformens C-bibliotek för vissa beräkningar med flyttal, och C-biblioteken varierar mycket i kvalitet här:

source: Numbers of the form ``I/2.**J`` are safe across all platforms, and I often contrive doctest examples to produce numbers of that form::
sv: Tal av formen ``I/2.**J`` är säkra på alla plattformar, och jag hittar ofta på doctest-exempel för att producera tal av den formen::

source: Simple fractions are also easier for people to understand, and that makes for better documentation.
sv: Enkla bråk är också lättare för människor att förstå, och det ger bättre dokumentation.

source: Basic API
sv: Grundläggande API

source: The functions :func:`testmod` and :func:`testfile` provide a simple interface to doctest that should be sufficient for most basic uses. For a less formal introduction to these two functions, see sections :ref:`doctest-simple-testmod` and :ref:`doctest-simple-testfile`.
sv: Funktionerna :func:`testmod` och :func:`testfile` ger ett enkelt gränssnitt till doctest som bör vara tillräckligt för de flesta grundläggande användningsområden. För en mindre formell introduktion till dessa två funktioner, se avsnitten :ref:`doctest-simple-testmod` och :ref:`doctest-simple-testfile`.

source: All arguments except *filename* are optional, and should be specified in keyword form.
sv: Alla argument utom *filnamn* är valfria och bör anges i nyckelordsform.

source: Test examples in the file named *filename*. Return ``(failure_count, test_count)``.
sv: Testa exempel i filen med namnet *filnamn*. Returnerar ``(misslyckande_antal, test_antal)``.

source: Optional argument *module_relative* specifies how the filename should be interpreted:
sv: Det valfria argumentet *module_relative* anger hur filnamnet ska tolkas:

source: If *module_relative* is ``True`` (the default), then *filename* specifies an OS-independent module-relative path. By default, this path is relative to the calling module's directory; but if the *package* argument is specified, then it is relative to that package. To ensure OS-independence, *filename* should use ``/`` characters to separate path segments, and may not be an absolute path (i.e., it may not begin with ``/``).
sv: Om *module_relative* är ``True`` (standard), anger *filename* en OS-oberoende modulrelativ sökväg. Som standard är den här sökvägen relativ till den anropande modulens katalog, men om argumentet *package* anges är den relativ till det paketet. För att säkerställa OS-oberoende bör *filnamn* använda ``/``-tecken för att separera sökvägssegment, och får inte vara en absolut sökväg (dvs. den får inte börja med ``/``).

source: If *module_relative* is ``False``, then *filename* specifies an OS-specific path. The path may be absolute or relative; relative paths are resolved with respect to the current working directory.
sv: Om *module_relative* är ``False``, anger *filnamn* en OS-specifik sökväg. Sökvägen kan vara absolut eller relativ; relativa sökvägar löses med avseende på den aktuella arbetskatalogen.

source: Optional argument *name* gives the name of the test; by default, or if ``None``, ``os.path.basename(filename)`` is used.
sv: Det valfria argumentet *name* anger namnet på testet; som standard, eller om ``None``, används ``os.path.basename(filnamn)``.
