Repository: yeager/python-docs-sv
Catalog: library/doctest.po
Languages: sv

source: :mod:`!doctest` --- Test interactive Python examples
sv: :mod:`!doctest` --- Testa interaktiva Python-exempel

source: **Source code:** :source:`Lib/doctest.py`
sv: **Källkod:** :source:`Lib/doctest.py`

source: The :mod:`doctest` module searches for pieces of text that look like interactive Python sessions, and then executes those sessions to verify that they work exactly as shown. There are several common ways to use doctest:
sv: Modulen :mod:`doctest` söker efter textstycken som ser ut som interaktiva Python-sessioner och kör sedan dessa sessioner för att verifiera att de fungerar exakt som de visas. Det finns flera vanliga sätt att använda doctest:

source: To check that a module's docstrings are up-to-date by verifying that all interactive examples still work as documented.
sv: För att kontrollera att en moduls dokumentation är uppdaterad genom att verifiera att alla interaktiva exempel fortfarande fungerar enligt dokumentationen.

source: To perform regression testing by verifying that interactive examples from a test file or a test object work as expected.
sv: Att utföra regressionstest genom att verifiera att interaktiva exempel från en testfil eller ett testobjekt fungerar som förväntat.

source: To write tutorial documentation for a package, liberally illustrated with input-output examples. Depending on whether the examples or the expository text are emphasized, this has the flavor of "literate testing" or "executable documentation".
sv: Att skriva handledningsdokumentation för ett paket, rikligt illustrerad med exempel på inmatning och utmatning. Beroende på om exemplen eller den förklarande texten betonas, har detta en smak av "litterat testande" eller "körbar dokumentation".

source: Here's a complete but small example module::
sv: Här är en komplett men liten exempelmodul::

source: If you run :file:`example.py` directly from the command line, :mod:`doctest` works its magic:
sv: Om du kör :file:`example.py` direkt från kommandoraden, kommer :mod:`doctest` att utföra sin magi:

source: There's no output! That's normal, and it means all the examples worked. Pass ``-v`` to the script, and :mod:`doctest` prints a detailed log of what it's trying, and prints a summary at the end:
sv: Det finns ingen utdata! Det är normalt, och det betyder att alla exempel fungerade. Skicka ``-v`` till skriptet, och :mod:`doctest` skriver ut en detaljerad logg över vad det försöker göra, och skriver ut en sammanfattning i slutet:

source: And so on, eventually ending with:
sv: Och så vidare, för att slutligen sluta med:

source: That's all you need to know to start making productive use of :mod:`doctest`! Jump in. The following sections provide full details. Note that there are many examples of doctests in the standard Python test suite and libraries. Especially useful examples can be found in the standard test file :file:`Lib/test/test_doctest/test_doctest.py`.
sv: Det är allt du behöver veta för att börja använda :mod:`doctest` på ett produktivt sätt! Hoppa in. Följande avsnitt ger fullständiga detaljer. Observera att det finns många exempel på doctests i Pythons standardtestsvit och bibliotek. Speciellt användbara exempel finns i standardtestfilen :file:`Lib/test/test_doctest/test_doctest.py`.

source: Output is colorized by default and can be :ref:`controlled using environment variables <using-on-controlling-color>`.
sv: Utdata är färgade som standard och kan :ref:`kontrolleras med hjälp av miljövariabler <using-on-controlling-color>`.

source: Simple Usage: Checking Examples in Docstrings
sv: Enkel användning: Kontrollera exempel i dokumentsträngar

source: The simplest way to start using doctest (but not necessarily the way you'll continue to do it) is to end each module :mod:`!M` with::
sv: Det enklaste sättet att börja använda doctest (men inte nödvändigtvis det sätt som du kommer att fortsätta att göra det på) är att avsluta varje modul :mod:`!M` med::

source: :mod:`!doctest` then examines docstrings in module :mod:`!M`.
sv: :mod:`!doctest` undersöker sedan dokumentsträngar i modulen :mod:`!M`.

source: Running the module as a script causes the examples in the docstrings to get executed and verified::
sv: Om modulen körs som ett skript kommer exemplen i dokumentationen att köras och verifieras::

source: This won't display anything unless an example fails, in which case the failing example(s) and the cause(s) of the failure(s) are printed to stdout, and the final line of output is ``***Test Failed*** N failures.``, where *N* is the number of examples that failed.
sv: Detta kommer inte att visa någonting om inte ett exempel misslyckas, i vilket fall de misslyckade exemplen och orsaken till misslyckandet skrivs ut till stdout, och den sista utdataraden är ``***Test Failed*** N failures.``, där *N* är antalet exempel som misslyckades.

source: Run it with the ``-v`` switch instead::
sv: Kör det med ``-v``-omkopplaren istället::

source: and a detailed report of all examples tried is printed to standard output, along with assorted summaries at the end.
sv: och en detaljerad rapport om alla exempel som provats skrivs ut till standardutmatningen, tillsammans med diverse sammanfattningar i slutet.

source: You can force verbose mode by passing ``verbose=True`` to :func:`testmod`, or prohibit it by passing ``verbose=False``. In either of those cases, :data:`sys.argv` is not examined by :func:`testmod` (so passing ``-v`` or not has no effect).
sv: Du kan tvinga fram verbose-läge genom att skicka ``verbose=True`` till :func:`testmod`, eller förbjuda det genom att skicka ``verbose=False``. I något av dessa fall undersöks inte :data:`sys.argv` av :func:`testmod` (så att skicka ``-v`` eller inte har ingen effekt).

source: There is also a command line shortcut for running :func:`testmod`, see section :ref:`doctest-cli`.
sv: Det finns också en kommandoradsgenväg för att köra :func:`testmod`, se avsnitt :ref:`doctest-cli`.

source: For more information on :func:`testmod`, see section :ref:`doctest-basic-api`.
sv: För mer information om :func:`testmod`, se avsnitt :ref:`doctest-basic-api`.

source: Simple Usage: Checking Examples in a Text File
sv: Enkel användning: Kontrollera exempel i en textfil

source: Another simple application of doctest is testing interactive examples in a text file. This can be done with the :func:`testfile` function::
sv: En annan enkel tillämpning av doctest är att testa interaktiva exempel i en textfil. Detta kan göras med funktionen :func:`testfile`::

source: import doctest doctest.testfile("example.txt")
sv: import doctest doctest.testfile("exempel.txt")

source: That short script executes and verifies any interactive Python examples contained in the file :file:`example.txt`. The file content is treated as if it were a single giant docstring; the file doesn't need to contain a Python program! For example, perhaps :file:`example.txt` contains this:
sv: Det korta skriptet exekverar och verifierar alla interaktiva Python-exempel som finns i filen :file:`example.txt`. Filens innehåll behandlas som om det vore en enda stor dokumentsträng; filen behöver inte innehålla ett Python-program! Till exempel kanske :file:`example.txt` innehåller detta:

source: Running ``doctest.testfile("example.txt")`` then finds the error in this documentation::
sv: När man kör ``doctest.testfile("example.txt")`` hittar man sedan felet i denna dokumentation::

source: As with :func:`testmod`, :func:`testfile` won't display anything unless an example fails. If an example does fail, then the failing example(s) and the cause(s) of the failure(s) are printed to stdout, using the same format as :func:`!testmod`.
sv: Precis som med :func:`testmod` kommer :func:`testfile` inte att visa något om inte ett exempel misslyckas. Om ett exempel misslyckas, skrivs det eller de misslyckade exemplen och orsaken till misslyckandet ut till stdout, i samma format som :func:`!testmod`.

source: By default, :func:`testfile` looks for files in the calling module's directory. See section :ref:`doctest-basic-api` for a description of the optional arguments that can be used to tell it to look for files in other locations.
sv: Som standard letar :func:`testfile` efter filer i den anropande modulens katalog. Se avsnitt :ref:`doctest-basic-api` för en beskrivning av de valfria argument som kan användas för att be den leta efter filer på andra platser.

source: Like :func:`testmod`, :func:`testfile`'s verbosity can be set with the ``-v`` command-line switch or with the optional keyword argument *verbose*.
sv: I likhet med :func:`testmod` kan :func:`testfile`:s ordrikedom ställas in med kommandoradskommandot ``-v`` eller med det valfria nyckelordsargumentet *verbose*.

source: There is also a command line shortcut for running :func:`testfile`, see section :ref:`doctest-cli`.
sv: Det finns också en kommandoradsgenväg för att köra :func:`testfile`, se avsnitt :ref:`doctest-cli`.

source: For more information on :func:`testfile`, see section :ref:`doctest-basic-api`.
sv: För mer information om :func:`testfile`, se avsnitt :ref:`doctest-basic-api`.

source: Command-line Usage
sv: Användning på kommandoraden

source: The :mod:`doctest` module can be invoked as a script from the command line:
sv: Modulen :mod:`doctest` kan startas som ett skript från kommandoraden:

source: Detailed report of all examples tried is printed to standard output, along with assorted summaries at the end::
sv: En detaljerad rapport över alla exempel som testats skrivs ut till standardutdata, tillsammans med diverse sammanfattningar i slutet::

source: This will import :file:`example.py` as a standalone module and run :func:`testmod` on it. Note that this may not work correctly if the file is part of a package and imports other submodules from that package.
sv: Detta kommer att importera :file:`example.py` som en fristående modul och köra :func:`testmod` på den. Observera att det här kanske inte fungerar korrekt om filen är en del av ett paket och importerar andra undermoduler från det paketet.

source: If the file name does not end with :file:`.py`, :mod:`!doctest` infers that it must be run with :func:`testfile` instead::
sv: Om filnamnet inte slutar med :file:`.py`, drar :mod:`!doctest` slutsatsen att den måste köras med :func:`testfile` istället::

source: Option flags control various aspects of doctest's behavior, see section :ref:`doctest-options`.
sv: Optionsflaggor styr olika aspekter av doctests beteende, se avsnitt :ref:`doctest-options`.

source: This is shorthand for ``-o FAIL_FAST``.
sv: Detta är en förkortning för ``-o FAIL_FAST``.

source: How It Works
sv: Hur det fungerar

source: This section examines in detail how doctest works: which docstrings it looks at, how it finds interactive examples, what execution context it uses, how it handles exceptions, and how option flags can be used to control its behavior. This is the information that you need to know to write doctest examples; for information about actually running doctest on these examples, see the following sections.
sv: I det här avsnittet undersöks i detalj hur doctest fungerar: vilka dokumentsträngar det tittar på, hur det hittar interaktiva exempel, vilket exekveringskontext det använder, hur det hanterar undantag och hur alternativflaggor kan användas för att styra dess beteende. Detta är den information som du behöver för att skriva doctest-exempel; för information om hur du faktiskt kör doctest på dessa exempel, se följande avsnitt.

source: Which Docstrings Are Examined?
sv: Vilka dokumentsträngar granskas?

source: The module docstring, and all function, class and method docstrings are searched. Objects imported into the module are not searched.
sv: Modulens dokumentsträng och alla funktions-, klass- och metoddokumentsträngar genomsöks. Objekt som importeras till modulen genomsöks inte.

source: In addition, there are cases when you want tests to be part of a module but not part of the help text, which requires that the tests not be included in the docstring. Doctest looks for a module-level variable called ``__test__`` and uses it to locate other tests. If ``M.__test__`` exists, it must be a dict, and each entry maps a (string) name to a function object, class object, or string. Function and class object docstrings found from ``M.__test__`` are searched, and strings are treated as if they were docstrings. In output, a key ``K`` in ``M.__test__`` appears with name ``M.__test__.K``.
sv: Dessutom finns det fall där du vill att tester ska vara en del av en modul men inte en del av hjälptexten, vilket kräver att testerna inte ingår i dokumentsträngen. Doctest letar efter en variabel på modulnivå som heter ``__test__`` och använder den för att hitta andra tester. Om ``M.__test__`` finns måste den vara en dict, och varje post mappar ett (sträng)namn till ett funktionsobjekt, klassobjekt eller en sträng. Dokumentsträngar för funktions- och klassobjekt som hittas från ``M.__test__`` söks igenom och strängar behandlas som om de vore dokumentsträngar. I utdata visas en nyckel ``K`` i ``M.__test__`` med namnet ``M.__test__.K``.

source: For example, place this block of code at the top of :file:`example.py`:
sv: Placera till exempel det här kodblocket högst upp i :file:`example.py`:

source: The value of ``example.__test__["numbers"]`` will be treated as a docstring and all the tests inside it will be run. It is important to note that the value can be mapped to a function, class object, or module; if so, :mod:`!doctest` searches them recursively for docstrings, which are then scanned for tests.
sv: Värdet av ``example.__test__["numbers"]`` kommer att behandlas som en docstring och alla tester i den kommer att köras. Det är viktigt att notera att värdet kan mappas till en funktion, ett klassobjekt eller en modul; om så är fallet söker :mod:`!doctest` igenom dem rekursivt efter docstrings, som sedan genomsöks efter tester.

source: Any classes found are recursively searched similarly, to test docstrings in their contained methods and nested classes.
sv: Alla klasser som hittas genomsöks rekursivt på samma sätt för att testa dokumentsträngar i de metoder och nästlade klasser som ingår.

source: How are Docstring Examples Recognized?
sv: Hur känns Docstring-exempel igen?

source: In most cases a copy-and-paste of an interactive console session works fine, but doctest isn't trying to do an exact emulation of any specific Python shell.
sv: I de flesta fall fungerar en kopia och klistra in av en interaktiv konsolsession bra, men doctest försöker inte göra en exakt emulering av något specifikt Python-skal.

source: Any expected output must immediately follow the final ``'>>> '`` or ``'... '`` line containing the code, and the expected output (if any) extends to the next ``'>>> '`` or all-whitespace line.
sv: Eventuella förväntade resultat måste följa omedelbart efter den sista ``'>>> '`` eller ``'... '`` rad som innehåller koden, och den förväntade utmatningen (om någon) sträcker sig till nästa ``'>>> '`` eller rad med enbart blanksteg.

source: The fine print:
sv: Det finstilta:

source: Expected output cannot contain an all-whitespace line, since such a line is taken to signal the end of expected output. If expected output does contain a blank line, put ``<BLANKLINE>`` in your doctest example each place a blank line is expected.
sv: Förväntad utdata kan inte innehålla en rad med enbart blanksteg, eftersom en sådan rad anses signalera slutet på förväntad utdata. Om förväntad utdata innehåller en blankrad, lägg till ``<BLANKLINE>`` i ditt doctest-exempel varje gång en blankrad förväntas.

source: All hard tab characters are expanded to spaces, using 8-column tab stops. Tabs in output generated by the tested code are not modified. Because any hard tabs in the sample output *are* expanded, this means that if the code output includes hard tabs, the only way the doctest can pass is if the :const:`NORMALIZE_WHITESPACE` option or :ref:`directive <doctest-directives>` is in effect. Alternatively, the test can be rewritten to capture the output and compare it to an expected value as part of the test. This handling of tabs in the source was arrived at through trial and error, and has proven to be the least error prone way of handling them. It is possible to use a different algorithm for handling tabs by writing a custom :class:`DocTestParser` class.
sv: Alla hårda tabbtecken expanderas till mellanslag med tabbstopp i 8 kolumner. Tabbar i utdata som genereras av den testade koden ändras inte. Eftersom alla hårda tabbar i exempelutmatningen *expanderas* innebär detta att om kodutmatningen innehåller hårda tabbar är det enda sättet för doctestet att bli godkänt om alternativet :const:`NORMALIZE_WHITESPACE` eller :ref:`directive <doctest-directives>` är i kraft. Alternativt kan testet skrivas om för att fånga utdata och jämföra det med ett förväntat värde som en del av testet. Den här hanteringen av tabbar i källan har kommit till genom försök och misstag och har visat sig vara det minst felbenägna sättet att hantera dem. Det är möjligt att använda en annan algoritm för att hantera tabbar genom att skriva en egen :class:`DocTestParser`-klass.

source: Output to stdout is captured, but not output to stderr (exception tracebacks are captured via a different means).
sv: Utdata till stdout fångas upp, men inte utdata till stderr (spårningar av undantag fångas upp på ett annat sätt).

source: If you continue a line via backslashing in an interactive session, or for any other reason use a backslash, you should use a raw docstring, which will preserve your backslashes exactly as you type them::
sv: Om du fortsätter en rad med hjälp av backslash i en interaktiv session, eller av någon annan anledning använder backslash, bör du använda en rå docstring, som bevarar dina backslash exakt som du skriver dem::

source: Otherwise, the backslash will be interpreted as part of the string. For example, the ``\n`` above would be interpreted as a newline character. Alternatively, you can double each backslash in the doctest version (and not use a raw string)::
sv: I annat fall tolkas backslash som en del av strängen. Till exempel skulle ``n`` ovan tolkas som ett tecken för ny rad. Alternativt kan du fördubbla varje backslash i doctest-versionen (och inte använda en rå sträng)::

source: The starting column doesn't matter::
sv: Startkolumnen spelar ingen roll::

source: and as many leading whitespace characters are stripped from the expected output as appeared in the initial ``'>>> '`` line that started the example.
sv: och lika många inledande blankstegstecken tas bort från den förväntade utdatan som fanns i den första ``'>>> '``-raden som inledde exemplet.

source: What's the Execution Context?
sv: Vad är exekveringskontexten?

source: By default, each time :mod:`doctest` finds a docstring to test, it uses a *shallow copy* of :mod:`!M`'s globals, so that running tests doesn't change the module's real globals, and so that one test in :mod:`!M` can't leave behind crumbs that accidentally allow another test to work. This means examples can freely use any names defined at top-level in :mod:`!M`, and names defined earlier in the docstring being run. Examples cannot see names defined in other docstrings.
sv: Som standard, varje gång :mod:`doctest` hittar en dokumentsträng att testa, använder den en *grunt kopia* av :mod:`!M`:s globaler, så att körning av tester inte ändrar modulens verkliga globaler, och så att ett test i :mod:`!M` inte kan lämna efter sig smulor som av misstag tillåter ett annat test att fungera. Detta innebär att exempel fritt kan använda alla namn som definieras på toppnivå i :mod:`!M`, och namn som definieras tidigare i den dokumentsträng som körs. Exempel kan inte se namn som definierats i andra dokumentsträngar.

source: You can force use of your own dict as the execution context by passing ``globs=your_dict`` to :func:`testmod` or :func:`testfile` instead.
sv: Du kan tvinga fram användning av din egen dict som exekveringskontext genom att skicka ``globs=your_dict`` till :func:`testmod` eller :func:`testfile` istället.

source: What About Exceptions?
sv: Hur är det med undantag?

source: No problem, provided that the traceback is the only output produced by the example: just paste in the traceback. [#]_ Since tracebacks contain details that are likely to change rapidly (for example, exact file paths and line numbers), this is one case where doctest works hard to be flexible in what it accepts.
sv: Inga problem, förutsatt att spårningen är den enda utdata som exemplet ger: klistra bara in spårningen. [Eftersom spårningar innehåller detaljer som sannolikt kommer att ändras snabbt (till exempel exakta filsökvägar och radnummer) är detta ett fall där doctest arbetar hårt för att vara flexibel i vad den accepterar.

source: Simple example::
sv: Ett enkelt exempel::

source: That doctest succeeds if :exc:`ValueError` is raised, with the ``list.remove(x): x not in list`` detail as shown.
sv: Detta doctest lyckas om :exc:`ValueError` tas upp, med ``list.remove(x): x not in list`` detalj som visas.

source: The expected output for an exception must start with a traceback header, which may be either of the following two lines, indented the same as the first line of the example::
sv: Den förväntade utdata för ett undantag måste börja med en spårningsrubrik, som kan vara någon av följande två rader, indragna på samma sätt som den första raden i exemplet::

source: The traceback header is followed by an optional traceback stack, whose contents are ignored by doctest. The traceback stack is typically omitted, or copied verbatim from an interactive session.
sv: Traceback-huvudet följs av en valfri traceback-stack, vars innehåll ignoreras av doctest. Traceback-stacken utelämnas vanligtvis eller kopieras ordagrant från en interaktiv session.

source: The traceback stack is followed by the most interesting part: the line(s) containing the exception type and detail. This is usually the last line of a traceback, but can extend across multiple lines if the exception has a multi-line detail::
sv: Efter spårningsstacken följer den mest intressanta delen: raden/raderna som innehåller undantagstypen och detaljerna. Detta är vanligtvis den sista raden i en spårning, men kan sträcka sig över flera rader om undantaget har en detalj med flera rader::

source: The last three lines (starting with :exc:`ValueError`) are compared against the exception's type and detail, and the rest are ignored.
sv: De tre sista raderna (som börjar med :exc:`ValueError`) jämförs med undantagets typ och detalj, och resten ignoreras.

source: Best practice is to omit the traceback stack, unless it adds significant documentation value to the example. So the last example is probably better as::
sv: Bästa praxis är att utelämna traceback-stacken, såvida den inte tillför ett betydande dokumentationsvärde till exemplet. Så det sista exemplet är förmodligen bättre som::

source: Note that tracebacks are treated very specially. In particular, in the rewritten example, the use of ``...`` is independent of doctest's :const:`ELLIPSIS` option. The ellipsis in that example could be left out, or could just as well be three (or three hundred) commas or digits, or an indented transcript of a Monty Python skit.
sv: Observera att spårningar behandlas mycket speciellt. I synnerhet i det omskrivna exemplet är användningen av ``...`` oberoende av doctests :const:`ELLIPSIS`-alternativ. Ellipsen i det exemplet kan utelämnas, eller lika gärna vara tre (eller trehundra) kommatecken eller siffror, eller en indragen utskrift av en Monty Python-sketch.

source: Some details you should read once, but won't need to remember:
sv: Vissa detaljer bör du läsa en gång, men behöver inte komma ihåg:
