Repository: yeager/python-docs-sv
Catalog: library/doctest.po
Languages: sv

source: Optional argument *package* is a Python package or the name of a Python package whose directory should be used as the base directory for a module-relative filename. If no package is specified, then the calling module's directory is used as the base directory for module-relative filenames. It is an error to specify *package* if *module_relative* is ``False``.
sv: Valfritt argument *package* är ett Python-paket eller namnet på ett Python-paket vars katalog ska användas som baskatalog för ett modulrelativt filnamn. Om inget paket anges används den anropande modulens katalog som baskatalog för modulrelativa filnamn. Det är ett fel att ange *package* om *module_relative* är ``False``.

source: Optional argument *globs* gives a dict to be used as the globals when executing examples. A new shallow copy of this dict is created for the doctest, so its examples start with a clean slate. By default, or if ``None``, a new empty dict is used.
sv: Det valfria argumentet *globs* ger en dict som ska användas som globaler när exempel körs. En ny ytlig kopia av denna dict skapas för doctestet, så att dess exempel börjar med ett rent blad. Som standard, eller om ``None``, används en ny tom dict.

source: Optional argument *extraglobs* gives a dict merged into the globals used to execute examples. This works like :meth:`dict.update`: if *globs* and *extraglobs* have a common key, the associated value in *extraglobs* appears in the combined dict. By default, or if ``None``, no extra globals are used. This is an advanced feature that allows parameterization of doctests. For example, a doctest can be written for a base class, using a generic name for the class, then reused to test any number of subclasses by passing an *extraglobs* dict mapping the generic name to the subclass to be tested.
sv: Det valfria argumentet *extraglobs* ger en dict som sammanfogats till de globaler som används för att exekvera exempel. Detta fungerar som :meth:`dict.update`: om *globs* och *extraglobs* har en gemensam nyckel, visas det associerade värdet i *extraglobs* i den kombinerade dict. Som standard, eller om ``None``, används inga extra globaler. Detta är en avancerad funktion som gör det möjligt att parametrisera doctests. Till exempel kan ett doctest skrivas för en basklass, med ett generiskt namn för klassen, och sedan återanvändas för att testa valfritt antal underklasser genom att skicka en *extraglobs*-dict som mappar det generiska namnet till den underklass som ska testas.

source: Optional argument *verbose* prints lots of stuff if true, and prints only failures if false; by default, or if ``None``, it's true if and only if ``'-v'`` is in :data:`sys.argv`.
sv: Det valfria argumentet *verbose* skriver ut en massa saker om det är sant, och skriver bara ut fel om det är falskt; som standard, eller om ``None``, är det sant om och endast om ``'-v'`` finns i :data:`sys.argv`.

source: Optional argument *report* prints a summary at the end when true, else prints nothing at the end. In verbose mode, the summary is detailed, else the summary is very brief (in fact, empty if all tests passed).
sv: Det valfria argumentet *report* skriver ut en sammanfattning i slutet när det är sant, annars skrivs ingenting ut i slutet. I verbose-läge är sammanfattningen detaljerad, annars är sammanfattningen mycket kort (i själva verket tom om alla tester är godkända).

source: Optional argument *optionflags* (default value ``0``) takes the :ref:`bitwise OR <bitwise>` of option flags. See section :ref:`doctest-options`.
sv: Det valfria argumentet *optionflags* (standardvärde ``0``) tar :ref:`bitwise OR <bitwise>` av optionsflaggor. Se avsnitt :ref:`doctest-options`.

source: Optional argument *raise_on_error* defaults to false. If true, an exception is raised upon the first failure or unexpected exception in an example. This allows failures to be post-mortem debugged. Default behavior is to continue running examples.
sv: Det valfria argumentet *raise_on_error* är som standard false. Om det är sant utlöses ett undantag vid det första felet eller oväntade undantaget i ett exempel. Detta gör att misslyckanden kan felsökas efteråt. Standardbeteendet är att fortsätta köra exempel.

source: Optional argument *parser* specifies a :class:`DocTestParser` (or subclass) that should be used to extract tests from the files. It defaults to a normal parser (i.e., ``DocTestParser()``).
sv: Det valfria argumentet *parser* anger en :class:`DocTestParser` (eller underklass) som ska användas för att extrahera tester från filerna. Standardvärdet är en normal parser (dvs. ``DocTestParser()``).

source: Optional argument *encoding* specifies an encoding that should be used to convert the file to unicode.
sv: Det valfria argumentet *encoding* anger en kodning som ska användas för att konvertera filen till unicode.

source: All arguments are optional, and all except for *m* should be specified in keyword form.
sv: Alla argument är valfria och alla utom *m* ska anges i nyckelordsform.

source: Test examples in docstrings in functions and classes reachable from module *m* (or module :mod:`__main__` if *m* is not supplied or is ``None``), starting with ``m.__doc__``.
sv: Testexempel i dokumentationssträngar i funktioner och klasser som kan nås från modul *m* (eller modul :mod:`__main__` om *m* inte anges eller är ``None``), med början i ``m.__doc__``.

source: Also test examples reachable from dict ``m.__test__``, if it exists. ``m.__test__`` maps names (strings) to functions, classes and strings; function and class docstrings are searched for examples; strings are searched directly, as if they were docstrings.
sv: Testa även exempel som kan nås från dict ``m.__test__``, om den finns. ``m.__test__`` mappar namn (strängar) till funktioner, klasser och strängar; funktions- och klassdokstrings söks efter exempel; strängar söks direkt, som om de vore dokstrings.

source: Only docstrings attached to objects belonging to module *m* are searched.
sv: Endast dokumentsträngar som är kopplade till objekt som tillhör modul *m* söks.

source: Optional argument *name* gives the name of the module; by default, or if ``None``, ``m.__name__`` is used.
sv: Det valfria argumentet *name* anger namnet på modulen; som standard, eller om ``None``, används ``m.__name__``.

source: Optional argument *exclude_empty* defaults to false. If true, objects for which no doctests are found are excluded from consideration. The default is a backward compatibility hack, so that code still using :meth:`doctest.master.summarize <DocTestRunner.summarize>` in conjunction with :func:`testmod` continues to get output for objects with no tests. The *exclude_empty* argument to the newer :class:`DocTestFinder` constructor defaults to true.
sv: Det valfria argumentet *exclude_empty* är som standard false. Om det är sant utesluts objekt för vilka inga doctests hittas från att beaktas. Standardvärdet är ett hack för bakåtkompatibilitet, så att kod som fortfarande använder :meth:`doctest.master.summarize <DocTestRunner.summarize>` i kombination med :func:`testmod` fortsätter att få utdata för objekt utan tester. Argumentet *exclude_empty* till den nyare :class:`DocTestFinder`-konstruktorn är som standard true.

source: Optional arguments *extraglobs*, *verbose*, *report*, *optionflags*, *raise_on_error*, and *globs* are the same as for function :func:`testfile` above, except that *globs* defaults to ``m.__dict__``.
sv: De valfria argumenten *extraglobs*, *verbose*, *report*, *optionflags*, *raise_on_error* och *globs* är desamma som för funktionen :func:`testfile` ovan, förutom att *globs* som standard är ``m.__dict__``.

source: Test examples associated with object *f*; for example, *f* may be a string, a module, a function, or a class object.
sv: Testexempel som är associerade med objektet *f*; *f* kan t.ex. vara en sträng, en modul, en funktion eller ett klassobjekt.

source: A shallow copy of dictionary argument *globs* is used for the execution context.
sv: En ytlig kopia av ordboksargumentet *globs* används för exekveringskontexten.

source: Optional argument *name* is used in failure messages, and defaults to ``"NoName"``.
sv: Det valfria argumentet *name* används i felmeddelanden och är som standard ``"NoName"``.

source: If optional argument *verbose* is true, output is generated even if there are no failures. By default, output is generated only in case of an example failure.
sv: Om det valfria argumentet *verbose* är true, genereras utdata även om det inte finns några fel. Som standard genereras utdata endast i händelse av ett exempel på fel.

source: Optional argument *compileflags* gives the set of flags that should be used by the Python compiler when running the examples. By default, or if ``None``, flags are deduced corresponding to the set of future features found in *globs*.
sv: Det valfria argumentet *compileflags* anger den uppsättning flaggor som ska användas av Python-kompilatorn när exemplen körs. Som standard, eller om ``None``, härleds flaggor som motsvarar den uppsättning framtida funktioner som finns i *globs*.

source: Optional argument *optionflags* works as for function :func:`testfile` above.
sv: Det valfria argumentet *optionflags* fungerar som för funktionen :func:`testfile` ovan.

source: As your collection of doctest'ed modules grows, you'll want a way to run all their doctests systematically. :mod:`doctest` provides two functions that can be used to create :mod:`unittest` test suites from modules and text files containing doctests. To integrate with :mod:`unittest` test discovery, include a :ref:`load_tests <load_tests-protocol>` function in your test module::
sv: När din samling av doctest'ed-moduler växer, kommer du att vilja ha ett sätt att köra alla deras doctests systematiskt. :mod:`doctest` tillhandahåller två funktioner som kan användas för att skapa :mod:`unittest` testsviter från moduler och textfiler som innehåller doctests. För att integrera med :mod:`unittest` testupptäckt, inkludera en :ref:`load_tests <load_tests-protocol>` funktion i din testmodul::

source: There are two main functions for creating :class:`unittest.TestSuite` instances from text files and modules with doctests:
sv: Det finns två huvudfunktioner för att skapa :class:`unittest.TestSuite`-instanser från textfiler och moduler med doctests:

source: Convert doctest tests from one or more text files to a :class:`unittest.TestSuite`.
sv: Konvertera doctest-tester från en eller flera textfiler till en :class:`unittest.TestSuite`.

source: The returned :class:`unittest.TestSuite` is to be run by the unittest framework and runs the interactive examples in each file. If an example in any file fails, then the synthesized unit test fails, and a :exc:`~unittest.TestCase.failureException` exception is raised showing the name of the file containing the test and a (sometimes approximate) line number. If all the examples in a file are skipped, then the synthesized unit test is also marked as skipped.
sv: Den returnerade :class:`unittest.TestSuite` ska köras av unittest-ramverket och kör de interaktiva exemplen i varje fil. Om ett exempel i någon fil misslyckas, misslyckas det syntetiserade enhetstestet och ett :exc:`~unittest.TestCase.failureException`-undantag skapas som visar namnet på filen som innehåller testet och ett (ibland ungefärligt) radnummer. Om alla exempel i en fil hoppas över markeras även det syntetiserade enhetstestet som överhoppat.

source: Pass one or more paths (as strings) to text files to be examined.
sv: Skicka en eller flera sökvägar (som strängar) till textfiler som ska undersökas.

source: Options may be provided as keyword arguments:
sv: Alternativ kan anges som nyckelordsargument:

source: Optional argument *module_relative* specifies how the filenames in *paths* should be interpreted:
sv: Det valfria argumentet *module_relative* anger hur filnamnen i *paths* ska tolkas:

source: If *module_relative* is ``True`` (the default), then each filename in *paths* specifies an OS-independent module-relative path. By default, this path is relative to the calling module's directory; but if the *package* argument is specified, then it is relative to that package. To ensure OS-independence, each filename should use ``/`` characters to separate path segments, and may not be an absolute path (i.e., it may not begin with ``/``).
sv: Om *module_relative* är ``True`` (standard), anger varje filnamn i *paths* en OS-oberoende modulrelativ sökväg. Som standard är den här sökvägen relativ till den anropande modulens katalog, men om argumentet *package* anges är den relativ till det paketet. För att säkerställa OS-oberoende bör varje filnamn använda ``/``-tecken för att separera sökvägssegment, och får inte vara en absolut sökväg (dvs. den får inte börja med ``/``).

source: If *module_relative* is ``False``, then each filename in *paths* specifies an OS-specific path. The path may be absolute or relative; relative paths are resolved with respect to the current working directory.
sv: Om *module_relative* är ``False``, anger varje filnamn i *paths* en OS-specifik sökväg. Sökvägen kan vara absolut eller relativ; relativa sökvägar löses med avseende på den aktuella arbetskatalogen.

source: Optional argument *package* is a Python package or the name of a Python package whose directory should be used as the base directory for module-relative filenames in *paths*. If no package is specified, then the calling module's directory is used as the base directory for module-relative filenames. It is an error to specify *package* if *module_relative* is ``False``.
sv: Det valfria argumentet *package* är ett Python-paket eller namnet på ett Python-paket vars katalog ska användas som baskatalog för modulrelativa filnamn i *paths*. Om inget paket anges används den anropande modulens katalog som baskatalog för modulrelativa filnamn. Det är ett fel att ange *package* om *module_relative* är ``False``.

source: Optional argument *setUp* specifies a set-up function for the test suite. This is called before running the tests in each file. The *setUp* function will be passed a :class:`DocTest` object. The *setUp* function can access the test globals as the :attr:`~DocTest.globs` attribute of the test passed.
sv: Det valfria argumentet *setUp* anger en konfigurationsfunktion för testsviten. Denna anropas innan testerna i varje fil körs. Funktionen *setUp* får ett objekt av :class:`DocTest`. Funktionen *setUp* kan komma åt testglobalerna som attributet :attr:`~DocTest.globs` för det test som skickas.

source: Optional argument *tearDown* specifies a tear-down function for the test suite. This is called after running the tests in each file. The *tearDown* function will be passed a :class:`DocTest` object. The *tearDown* function can access the test globals as the :attr:`~DocTest.globs` attribute of the test passed.
sv: Det valfria argumentet *tearDown* anger en nedmonteringsfunktion för testsviten. Denna anropas efter att testerna i varje fil har körts. Funktionen *tearDown* kommer att få ett objekt av :class:`DocTest`. Funktionen *tearDown* kan komma åt testglobalerna som attributet :attr:`~DocTest.globs` i det test som skickas.

source: Optional argument *globs* is a dictionary containing the initial global variables for the tests. A new copy of this dictionary is created for each test. By default, *globs* is a new empty dictionary.
sv: Det valfria argumentet *globs* är en ordbok som innehåller de första globala variablerna för testerna. En ny kopia av denna ordbok skapas för varje test. Som standard är *globs* en ny tom ordbok.

source: Optional argument *optionflags* specifies the default doctest options for the tests, created by or-ing together individual option flags. See section :ref:`doctest-options`. See function :func:`set_unittest_reportflags` below for a better way to set reporting options.
sv: Det valfria argumentet *optionflags* anger standardalternativen för doctest för testerna, som skapas genom att kombinera enskilda alternativflaggor. Se avsnitt :ref:`doctest-options`. Se funktionen :func:`set_unittest_reportflags` nedan för ett bättre sätt att ställa in rapporteringsalternativ.

source: The global ``__file__`` is added to the globals provided to doctests loaded from a text file using :func:`DocFileSuite`.
sv: Den globala ``__file__`` läggs till i de globaler som tillhandahålls för doktester som laddas från en textfil med :func:`DocFileSuite`.

source: Convert doctest tests for a module to a :class:`unittest.TestSuite`.
sv: Konvertera doctest-tester för en modul till en :class:`unittest.TestSuite`.

source: The returned :class:`unittest.TestSuite` is to be run by the unittest framework and runs each doctest in the module. Each docstring is run as a separate unit test. If any of the doctests fail, then the synthesized unit test fails, and a :exc:`unittest.TestCase.failureException` exception is raised showing the name of the file containing the test and a (sometimes approximate) line number. If all the examples in a docstring are skipped, then the
sv: Den returnerade :class:`unittest.TestSuite` ska köras av unittest-ramverket och kör varje doctest i modulen. Varje dokumentsträng körs som ett separat enhetstest. Om något av doctesterna misslyckas, misslyckas det syntetiserade enhetstestet och ett :exc:`unittest.TestCase.failureException`-undantag skapas som visar namnet på filen som innehåller testet och ett (ibland ungefärligt) radnummer. Om alla exempel i en dokumentsträng hoppas över, kommer

source: Optional argument *module* provides the module to be tested. It can be a module object or a (possibly dotted) module name. If not specified, the module calling this function is used.
sv: Det valfria argumentet *module* anger vilken modul som ska testas. Det kan vara ett modulobjekt eller ett (eventuellt prickat) modulnamn. Om det inte anges används den modul som anropar denna funktion.

source: Optional argument *globs* is a dictionary containing the initial global variables for the tests. A new copy of this dictionary is created for each test. By default, *globs* is the module's :attr:`~module.__dict__`.
sv: Det valfria argumentet *globs* är en ordbok som innehåller de första globala variablerna för testerna. En ny kopia av denna dictionary skapas för varje test. Som standard är *globs* modulens :attr:`~module.__dict__`.

source: Optional argument *extraglobs* specifies an extra set of global variables, which is merged into *globs*. By default, no extra globals are used.
sv: Det valfria argumentet *extraglobs* anger en extra uppsättning globala variabler som slås samman med *globs*. Som standard används inga extra globala variabler.

source: Optional argument *test_finder* is the :class:`DocTestFinder` object (or a drop-in replacement) that is used to extract doctests from the module.
sv: Valfritt argument *test_finder* är :class:`DocTestFinder`-objektet (eller en direkt ersättare) som används för att extrahera doctests från modulen.

source: Optional arguments *setUp*, *tearDown*, and *optionflags* are the same as for function :func:`DocFileSuite` above, but they are called for each docstring.
sv: De valfria argumenten *setUp*, *tearDown* och *optionflags* är desamma som för funktionen :func:`DocFileSuite` ovan, men de anropas för varje dokumentsträng.

source: This function uses the same search technique as :func:`testmod`.
sv: Denna funktion använder samma sökteknik som :func:`testmod`.

source: :func:`DocTestSuite` returns an empty :class:`unittest.TestSuite` if *module* contains no docstrings instead of raising :exc:`ValueError`.
sv: :func:`DocTestSuite` returnerar en tom :class:`unittest.TestSuite` om *modul* inte innehåller några docstrings istället för att ge :exc:`ValueError`.

source: Under the covers, :func:`DocTestSuite` creates a :class:`unittest.TestSuite` out of :class:`!doctest.DocTestCase` instances, and :class:`!DocTestCase` is a subclass of :class:`unittest.TestCase`. :class:`!DocTestCase` isn't documented here (it's an internal detail), but studying its code can answer questions about the exact details of :mod:`unittest` integration.
sv: Under täckmanteln skapar :func:`DocTestSuite` en :class:`unittest.TestSuite` av :class:`!doctest.DocTestCase`-instanser, och :class:`!DocTestCase` är en underklass till :class:`unittest.TestCase`. :class:`!DocTestCase` dokumenteras inte här (det är en intern detalj), men att studera dess kod kan svara på frågor om de exakta detaljerna i :mod:`unittest`-integrationen.

source: Similarly, :func:`DocFileSuite` creates a :class:`unittest.TestSuite` out of :class:`!doctest.DocFileCase` instances, and :class:`!DocFileCase` is a subclass of :class:`!DocTestCase`.
sv: På samma sätt skapar :func:`DocFileSuite` en :class:`unittest.TestSuite` av :class:`!doctest.DocFileCase`-instanser, och :class:`!DocFileCase` är en subklass av :class:`!DocTestCase`.

source: So both ways of creating a :class:`unittest.TestSuite` run instances of :class:`!DocTestCase`. This is important for a subtle reason: when you run :mod:`doctest` functions yourself, you can control the :mod:`!doctest` options in use directly, by passing option flags to :mod:`!doctest` functions. However, if you're writing a :mod:`unittest` framework, :mod:`!unittest` ultimately controls when and how tests get run. The framework author typically wants to control :mod:`!doctest` reporting options (perhaps, e.g., specified by command line options), but there's no way to pass options through :mod:`!unittest` to :mod:`!doctest` test runners.
sv: Så båda sätten att skapa en :class:`unittest.TestSuite` kör instanser av :class:`!DocTestCase`. Detta är viktigt av en subtil anledning: när du kör :mod:`doctest`-funktioner själv, kan du styra :mod:`!doctest`-alternativen som används direkt, genom att skicka alternativflaggor till :mod:`!doctest`-funktioner. Men om du skriver ett :mod:`unittest`-ramverk, kontrollerar :mod:`!unittest` i slutändan när och hur tester körs. Ramverkets författare vill vanligtvis kontrollera :mod:`!doctest` rapporteringsalternativ (kanske, t.ex., specificerade av kommandoradsalternativ), men det finns inget sätt att skicka alternativ genom :mod:`!unittest` till :mod:`!doctest` testlöpare.

source: For this reason, :mod:`doctest` also supports a notion of :mod:`!doctest` reporting flags specific to :mod:`unittest` support, via this function:
sv: Av denna anledning stödjer :mod:`doctest` också ett begrepp som :mod:`!doctest` som rapporterar flaggor som är specifika för :mod:`unittest`-stöd, via denna funktion:

source: Set the :mod:`doctest` reporting flags to use.
sv: Ange vilka :mod:`doctest`-rapporteringsflaggor som ska användas.

source: Argument *flags* takes the :ref:`bitwise OR <bitwise>` of option flags. See section :ref:`doctest-options`. Only "reporting flags" can be used.
sv: Argument *flags* tar :ref:`bitvis ELLER <bitwise>` av alternativflaggor. Se avsnitt :ref:`doctest-options`. Endast "rapporteringsflaggor" kan användas.
