Repository: yeager/python-docs-sv
Catalog: library/doctest.po
Languages: sv

source: Report that the given example ran successfully. This method is provided to allow subclasses of :class:`DocTestRunner` to customize their output; it should not be called directly.
sv: Rapportera att det givna exemplet kördes framgångsrikt. Denna metod tillhandahålls för att underklasser till :class:`DocTestRunner` ska kunna anpassa sin utdata; den ska inte anropas direkt.

source: *example* is the example about to be processed. *got* is the actual output from the example. *test* is the test containing *example*. *out* is the output function that was passed to :meth:`DocTestRunner.run`.
sv: *example* är exemplet som ska bearbetas. *got* är den faktiska utmatningen från exemplet. *test* är testet som innehåller *example*. *out* är den utdatafunktion som skickades till :meth:`DocTestRunner.run`.

source: Report that the given example failed. This method is provided to allow subclasses of :class:`DocTestRunner` to customize their output; it should not be called directly.
sv: Rapportera att det givna exemplet misslyckades. Den här metoden tillhandahålls för att underklasser till :class:`DocTestRunner` ska kunna anpassa sin utdata; den ska inte anropas direkt.

source: Report that the given example raised an unexpected exception. This method is provided to allow subclasses of :class:`DocTestRunner` to customize their output; it should not be called directly.
sv: Rapportera att det givna exemplet gav upphov till ett oväntat undantag. Denna metod tillhandahålls för att underklasser till :class:`DocTestRunner` ska kunna anpassa sina utdata; den ska inte anropas direkt.

source: *example* is the example about to be processed. *exc_info* is a tuple containing information about the unexpected exception (as returned by :func:`sys.exc_info`). *test* is the test containing *example*. *out* is the output function that was passed to :meth:`DocTestRunner.run`.
sv: *example* är det exempel som ska bearbetas. *exc_info* är en tupel som innehåller information om det oväntade undantaget (som returneras av :func:`sys.exc_info`). *test* är testet som innehåller *exempel*. *out* är den utdatafunktion som skickades till :meth:`DocTestRunner.run`.

source: Run the examples in *test* (a :class:`DocTest` object), and display the results using the writer function *out*. Return a :class:`TestResults` instance.
sv: Kör exemplen i *test* (ett :class:`DocTest`-objekt) och visa resultaten med hjälp av skrivarfunktionen *out*. Returnerar en instans av :class:`TestResults`.

source: The examples are run in the namespace ``test.globs``. If *clear_globs* is true (the default), then this namespace will be cleared after the test runs, to help with garbage collection. If you would like to examine the namespace after the test completes, then use *clear_globs=False*.
sv: Exemplen körs i namnrymden ``test.globs``. Om *clear_globs* är true (standard) kommer detta namnområde att rensas efter att testet har körts, för att hjälpa till med skräpsamlingen. Om du vill undersöka namnrymden efter att testet har slutförts använder du *clear_globs=False*.

source: *compileflags* gives the set of flags that should be used by the Python compiler when running the examples. If not specified, then it will default to the set of future-import flags that apply to *globs*.
sv: *compileflags* anger den uppsättning flaggor som ska användas av Python-kompilatorn när exemplen körs. Om den inte anges kommer den som standard att använda den uppsättning flaggor för framtida import som gäller för *globs*.

source: The output of each example is checked using the :class:`DocTestRunner`'s output checker, and the results are formatted by the :meth:`!DocTestRunner.report_\*` methods.
sv: Utdata för varje exempel kontrolleras med hjälp av :class:`DocTestRunner`:s utdatakontroll och resultaten formateras med :meth:`!DocTestRunner.report_\*`-metoderna.

source: Print a summary of all the test cases that have been run by this DocTestRunner, and return a :class:`TestResults` instance.
sv: Skriv ut en sammanfattning av alla testfall som har körts av denna DocTestRunner, och returnera en :class:`TestResults`-instans.

source: The optional *verbose* argument controls how detailed the summary is. If the verbosity is not specified, then the :class:`DocTestRunner`'s verbosity is used.
sv: Det valfria argumentet *verbose* styr hur detaljerad sammanfattningen är. Om ordrikhet inte anges används :class:`DocTestRunner`:s ordrikhet.

source: :class:`DocTestParser` has the following attributes:
sv: :class:`DocTestParser` har följande attribut:

source: Number of attempted examples.
sv: Antal försök till exempel.

source: Number of failed examples.
sv: Antal misslyckade exempel.

source: Number of skipped examples.
sv: Antal överhoppade exempel.

source: OutputChecker objects
sv: OutputChecker-objekt

source: A class used to check the whether the actual output from a doctest example matches the expected output. :class:`OutputChecker` defines two methods: :meth:`check_output`, which compares a given pair of outputs, and returns ``True`` if they match; and :meth:`output_difference`, which returns a string describing the differences between two outputs.
sv: En klass som används för att kontrollera om den faktiska utmatningen från ett doctest-exempel matchar den förväntade utmatningen. :class:`OutputChecker` definierar två metoder: :meth:`check_output`, som jämför ett givet par utmatningar och returnerar ``True`` om de matchar; och :meth:`output_difference`, som returnerar en sträng som beskriver skillnaderna mellan två utmatningar.

source: :class:`OutputChecker` defines the following methods:
sv: :class:`OutputChecker` definierar följande metoder:

source: Return ``True`` iff the actual output from an example (*got*) matches the expected output (*want*). These strings are always considered to match if they are identical; but depending on what option flags the test runner is using, several non-exact match types are also possible. See section :ref:`doctest-options` for more information about option flags.
sv: Returnerar ``True`` om den faktiska utdata från ett exempel (*got*) matchar den förväntade utdata (*want*). Dessa strängar anses alltid matcha om de är identiska; men beroende på vilka alternativflaggor testköraren använder är flera icke-exakta matchningstyper också möjliga. Se avsnitt :ref:`doctest-options` för mer information om alternativflaggor.

source: Return a string describing the differences between the expected output for a given example (*example*) and the actual output (*got*). *optionflags* is the set of option flags used to compare *want* and *got*.
sv: Returnerar en sträng som beskriver skillnaderna mellan det förväntade utfallet för ett visst exempel (*example*) och det faktiska utfallet (*got*). *optionflags* är den uppsättning optionsflaggor som används för att jämföra *want* och *got*.

source: Debugging
sv: Felsökning

source: Doctest provides several mechanisms for debugging doctest examples:
sv: Doctest tillhandahåller flera mekanismer för felsökning av doctest-exempel:

source: Several functions convert doctests to executable Python programs, which can be run under the Python debugger, :mod:`pdb`.
sv: Flera funktioner konverterar doctests till körbara Python-program, som kan köras under Pythons debugger, :mod:`pdb`.

source: The :class:`DebugRunner` class is a subclass of :class:`DocTestRunner` that raises an exception for the first failing example, containing information about that example. This information can be used to perform post-mortem debugging on the example.
sv: Klassen :class:`DebugRunner` är en underklass till :class:`DocTestRunner` som skapar ett undantag för det första misslyckade exemplet och innehåller information om det exemplet. Denna information kan användas för att utföra felsökning av exemplet efteråt.

source: The :mod:`unittest` cases generated by :func:`DocTestSuite` support the :meth:`debug` method defined by :class:`unittest.TestCase`.
sv: De :mod:`unittest`-fall som genereras av :func:`DocTestSuite` stöder :meth:`debug`-metoden som definieras av :class:`unittest.TestCase`.

source: You can add a call to :func:`pdb.set_trace` in a doctest example, and you'll drop into the Python debugger when that line is executed. Then you can inspect current values of variables, and so on. For example, suppose :file:`a.py` contains just this module docstring::
sv: Du kan lägga till ett anrop till :func:`pdb.set_trace` i ett doctest-exempel, och du kommer att hamna i Pythons debugger när den raden körs. Sedan kan du inspektera aktuella värden för variabler och så vidare. Anta till exempel att :file:`a.py` innehåller just den här modulen docstring::

source: Then an interactive Python session may look like this::
sv: Då kan en interaktiv Python-session se ut så här::

source: Functions that convert doctests to Python code, and possibly run the synthesized code under the debugger:
sv: Funktioner som konverterar doctests till Python-kod och eventuellt kör den syntetiserade koden under felsökaren:

source: Convert text with examples to a script.
sv: Konvertera text med exempel till ett skript.

source: Argument *s* is a string containing doctest examples. The string is converted to a Python script, where doctest examples in *s* are converted to regular code, and everything else is converted to Python comments. The generated script is returned as a string. For example, ::
sv: Argument *s* är en sträng som innehåller doctest-exempel. Strängen konverteras till ett Python-skript, där doctest-exemplen i *s* konverteras till vanlig kod och allt annat konverteras till Python-kommentarer. Det genererade skriptet returneras som en sträng. Till exempel ::

source: displays::
sv: visar::

source: # Set x and y to 1 and 2. x, y = 1, 2 # # Print their sum: print(x+y) # Expected: ## 3
sv: # Ställ in x och y till 1 och 2. x, y = 1, 2 # # Skriv ut deras summa: print(x+y) # Förväntat: ## 3

source: This function is used internally by other functions (see below), but can also be useful when you want to transform an interactive Python session into a Python script.
sv: Denna funktion används internt av andra funktioner (se nedan), men kan också vara användbar när du vill omvandla en interaktiv Python-session till ett Python-skript.

source: Convert the doctest for an object to a script.
sv: Konvertera doctestet för ett objekt till ett skript.

source: Argument *module* is a module object, or dotted name of a module, containing the object whose doctests are of interest. Argument *name* is the name (within the module) of the object with the doctests of interest. The result is a string, containing the object's docstring converted to a Python script, as described for :func:`script_from_examples` above. For example, if module :file:`a.py` contains a top-level function :func:`!f`, then ::
sv: Argument *module* är ett modulobjekt, eller ett punktat namn på en modul, som innehåller det objekt vars doctests är av intresse. Argument *name* är namnet (inom modulen) på objektet med de doctests som är av intresse. Resultatet är en sträng som innehåller objektets dokumentsträng konverterad till ett Python-skript, enligt beskrivningen för :func:`script_from_examples` ovan. Om till exempel modulen :file:`a.py` innehåller en toppnivåfunktion :func:`!f`, så är ::

source: prints a script version of function :func:`!f`'s docstring, with doctests converted to code, and the rest placed in comments.
sv: skriver ut en skriptversion av funktionen :func:`!f`'s docstring, med doctests konverterade till kod och resten placerade i kommentarer.

source: Debug the doctests for an object.
sv: Felsök doctesterna för ett objekt.

source: The *module* and *name* arguments are the same as for function :func:`testsource` above. The synthesized Python script for the named object's docstring is written to a temporary file, and then that file is run under the control of the Python debugger, :mod:`pdb`.
sv: Argumenten *module* och *name* är desamma som för funktionen :func:`testsource` ovan. Det syntetiserade Python-skriptet för det namngivna objektets docstring skrivs till en temporär fil, och sedan körs filen under kontroll av Python-debuggern, :mod:`pdb`.

source: A shallow copy of ``module.__dict__`` is used for both local and global execution context.
sv: En ytlig kopia av ``module.__dict__`` används för både lokal och global exekveringskontext.

source: Optional argument *pm* controls whether post-mortem debugging is used. If *pm* has a true value, the script file is run directly, and the debugger gets involved only if the script terminates via raising an unhandled exception. If it does, then post-mortem debugging is invoked, via :func:`pdb.post_mortem`, passing the traceback object from the unhandled exception. If *pm* is not specified, or is false, the script is run under the debugger from the start, via passing an appropriate :func:`exec` call to :func:`pdb.run`.
sv: Det valfria argumentet *pm* styr om felsökning efter avslutad körning ska användas. Om *pm* har ett sant värde körs skriptfilen direkt och felsökaren blir inblandad endast om skriptet avslutas genom att ett ohanterat undantag uppstår. Om så är fallet aktiveras post-mortem-felsökning via :func:`pdb.post_mortem`, som skickar spårningsobjektet från det ohanterade undantaget. Om *pm* inte anges, eller är false, körs skriptet under debuggern från början, genom att skicka ett lämpligt :func:`exec`-anrop till :func:`pdb.run`.

source: Debug the doctests in a string.
sv: Felsök doctesterna i en sträng.

source: This is like function :func:`debug` above, except that a string containing doctest examples is specified directly, via the *src* argument.
sv: Detta är som funktionen :func:`debug` ovan, förutom att en sträng som innehåller doctest-exempel anges direkt via argumentet *src*.

source: Optional argument *pm* has the same meaning as in function :func:`debug` above.
sv: Det valfria argumentet *pm* har samma betydelse som i funktionen :func:`debug` ovan.

source: Optional argument *globs* gives a dictionary to use as both local and global execution context. If not specified, or ``None``, an empty dictionary is used. If specified, a shallow copy of the dictionary is used.
sv: Det valfria argumentet *globs* anger en ordbok som ska användas som både lokalt och globalt exekveringskontext. Om det inte anges, eller ``None``, används en tom ordbok. Om det anges används en ytlig kopia av ordlistan.

source: The :class:`DebugRunner` class, and the special exceptions it may raise, are of most interest to testing framework authors, and will only be sketched here. See the source code, and especially :class:`DebugRunner`'s docstring (which is a doctest!) for more details:
sv: Klassen :class:`DebugRunner`, och de speciella undantag som den kan ge upphov till, är av störst intresse för utvecklare av testramverk och kommer endast att beskrivas översiktligt här. Se källkoden, och särskilt :class:`DebugRunner` s docstring (som är ett doctest!) för mer information:

source: A subclass of :class:`DocTestRunner` that raises an exception as soon as a failure is encountered. If an unexpected exception occurs, an :exc:`UnexpectedException` exception is raised, containing the test, the example, and the original exception. If the output doesn't match, then a :exc:`DocTestFailure` exception is raised, containing the test, the example, and the actual output.
sv: En underklass till :class:`DocTestRunner` som ger upphov till ett undantag så snart ett fel uppstår. Om ett oväntat undantag inträffar, skapas ett :exc:`UnexpectedException`-undantag som innehåller testet, exemplet och det ursprungliga undantaget. Om utdata inte stämmer överens skapas ett :exc:`DocTestFailure`-undantag som innehåller testet, exemplet och den faktiska utdatan.

source: For information about the constructor parameters and methods, see the documentation for :class:`DocTestRunner` in section :ref:`doctest-advanced-api`.
sv: För information om konstruktörens parametrar och metoder, se dokumentationen för :class:`DocTestRunner` i avsnitt :ref:`doctest-advanced-api`.

source: There are two exceptions that may be raised by :class:`DebugRunner` instances:
sv: Det finns två undantag som kan uppstå i :class:`DebugRunner`-instanser:

source: An exception raised by :class:`DocTestRunner` to signal that a doctest example's actual output did not match its expected output. The constructor arguments are used to initialize the attributes of the same names.
sv: Ett undantag som tas upp av :class:`DocTestRunner` för att signalera att ett doctest-exempels faktiska resultat inte stämde överens med det förväntade resultatet. Argumenten i konstruktorn används för att initiera attributen med samma namn.

source: :exc:`DocTestFailure` defines the following attributes:
sv: :exc:`DocTestFailure` definierar följande attribut:

source: The :class:`DocTest` object that was being run when the example failed.
sv: Objektet :class:`DocTest` som kördes när exemplet misslyckades.

source: The :class:`Example` that failed.
sv: Den :class:`Example` som misslyckades.

source: The example's actual output.
sv: Exemplets faktiska utdata.

source: An exception raised by :class:`DocTestRunner` to signal that a doctest example raised an unexpected exception. The constructor arguments are used to initialize the attributes of the same names.
sv: Ett undantag som skapas av :class:`DocTestRunner` för att signalera att ett doctest-exempel skapade ett oväntat undantag. Argumenten i konstruktorn används för att initiera attributen med samma namn.

source: :exc:`UnexpectedException` defines the following attributes:
sv: :exc:`UnexpectedException` definierar följande attribut:

source: A tuple containing information about the unexpected exception, as returned by :func:`sys.exc_info`.
sv: En tupel som innehåller information om det oväntade undantaget, som returneras av :func:`sys.exc_info`.

source: As mentioned in the introduction, :mod:`doctest` has grown to have three primary uses:
sv: Som nämndes i inledningen har :mod:`doctest` vuxit till att ha tre primära användningsområden:

source: Checking examples in docstrings.
sv: Kontroll av exempel i docstrings.

source: Regression testing.
sv: Regressionstestning.

source: Executable documentation / literate testing.
sv: Exekverbar dokumentation / litterat test.

source: These uses have different requirements, and it is important to distinguish them. In particular, filling your docstrings with obscure test cases makes for bad documentation.
sv: Dessa användningsområden har olika krav, och det är viktigt att skilja dem åt. Framför allt blir dokumentationen dålig om man fyller den med obskyra testfall.

source: When writing a docstring, choose docstring examples with care. There's an art to this that needs to be learned---it may not be natural at first. Examples should add genuine value to the documentation. A good example can often be worth many words. If done with care, the examples will be invaluable for your users, and will pay back the time it takes to collect them many times over as the years go by and things change. I'm still amazed at how often one of my :mod:`doctest` examples stops working after a "harmless" change.
sv: När du skriver en docstring ska du välja docstring-exempel med omsorg. Det här är en konst som måste läras - det kanske inte är naturligt i början. Exemplen bör tillföra dokumentationen ett verkligt värde. Ett bra exempel kan ofta vara värt många ord. Om du gör det med omsorg kommer exemplen att vara ovärderliga för dina användare och betala tillbaka den tid det tar att samla in dem många gånger om när åren går och saker och ting förändras. Jag är fortfarande förvånad över hur ofta ett av mina :mod:`doctest`-exempel slutar fungera efter en "harmlös" förändring.

source: Doctest also makes an excellent tool for regression testing, especially if you don't skimp on explanatory text. By interleaving prose and examples, it becomes much easier to keep track of what's actually being tested, and why. When a test fails, good prose can make it much easier to figure out what the problem is, and how it should be fixed. It's true that you could write extensive comments in code-based testing, but few programmers do. Many have found that using doctest approaches instead leads to much clearer tests. Perhaps this is simply because doctest makes writing prose a little easier than writing code, while writing comments in code is a little harder. I think it goes deeper than just that: the natural attitude when writing a doctest-based test is that you want to explain the fine points of your software, and illustrate them with examples. This in turn naturally leads to test files that start with the simplest features, and logically progress to complications and edge cases. A coherent narrative is the result, instead of a collection of isolated functions that test isolated bits of functionality seemingly at random. It's a different attitude, and produces different results, blurring the distinction between testing and explaining.
sv: Doctest är också ett utmärkt verktyg för regressionstestning, särskilt om man inte snålar med den förklarande texten. Genom att varva prosa och exempel blir det mycket lättare att hålla reda på vad som faktiskt testas och varför. När ett test misslyckas kan bra prosa göra det mycket lättare att räkna ut vad problemet är och hur det ska åtgärdas. Det är sant att man kan skriva omfattande kommentarer i kodbaserade tester, men det är få programmerare som gör det. Många har upptäckt att man får mycket tydligare tester om man istället använder sig av doctest-metoder. Kanske beror det helt enkelt på att doctest gör det lite enklare att skriva prosa än att skriva kod, medan det är lite svårare att skriva kommentarer i kod. Jag tror att det går djupare än så: den naturliga inställningen när man skriver ett doctest-baserat test är att man vill förklara de små detaljerna i sin programvara och illustrera dem med exempel. Detta leder i sin tur naturligt till testfiler som börjar med de enklaste funktionerna och logiskt går vidare till komplikationer och kantfall. Resultatet blir en sammanhängande berättelse i stället för en samling isolerade funktioner som testar isolerade bitar av funktionalitet till synes slumpmässigt. Det är en annan attityd som ger andra resultat och suddar ut skillnaden mellan att testa och att förklara.

source: Regression testing is best confined to dedicated objects or files. There are several options for organizing tests:
sv: Regressionstester bör helst begränsas till särskilda objekt eller filer. Det finns flera alternativ för att organisera tester:

source: Write text files containing test cases as interactive examples, and test the files using :func:`testfile` or :func:`DocFileSuite`. This is recommended, although is easiest to do for new projects, designed from the start to use doctest.
sv: Skriv textfiler som innehåller testfall som interaktiva exempel och testa filerna med :func:`testfile` eller :func:`DocFileSuite`. Detta rekommenderas, men är lättast att göra för nya projekt som redan från början är utformade för att använda doctest.

source: Define functions named ``_regrtest_topic`` that consist of single docstrings, containing test cases for the named topics. These functions can be included in the same file as the module, or separated out into a separate test file.
sv: Definiera funktioner med namnet ``_regrtest_topic`` som består av enskilda dokumentsträngar som innehåller testfall för de namngivna ämnena. Dessa funktioner kan inkluderas i samma fil som modulen, eller separeras till en separat testfil.

source: Define a :attr:`~module.__test__` dictionary mapping from regression test topics to docstrings containing test cases.
sv: Definiera en :attr:`~module.__test__`-ordbok som mappar från regressionstestämnen till dokumentsträngar som innehåller testfall.
