Repository: yeager/python-docs-sv
Catalog: library/doctest.po
Languages: sv

source: When you have placed your tests in a module, the module can itself be the test runner. When a test fails, you can arrange for your test runner to re-run only the failing doctest while you debug the problem. Here is a minimal example of such a test runner::
sv: När du har placerat dina tester i en modul kan modulen själv vara testköraren. När ett test misslyckas kan du ordna så att din testkörare bara kör om det misslyckade testet medan du felsöker problemet. Här är ett minimalt exempel på en sådan testlöpare::

source: Footnotes
sv: Fotnoter

source: Examples containing both expected output and an exception are not supported. Trying to guess where one ends and the other begins is too error-prone, and that also makes for a confusing test.
sv: Exempel som innehåller både förväntad utdata och ett undantag stöds inte. Att försöka gissa var det ena slutar och det andra börjar är alltför felbenäget, och det ger också ett förvirrande test.

source: interpreter prompt
sv: tolkprompt

source: marker
sv: markör

source: in doctests
sv: i doctests
