Repository: yeager/python-docs-sv
Catalog: library/doctest.po
Languages: sv

source: This is a module-global setting, and affects all future doctests run by module :mod:`unittest`: the :meth:`!runTest` method of :class:`!DocTestCase` looks at the option flags specified for the test case when the :class:`!DocTestCase` instance was constructed. If no reporting flags were specified (which is the typical and expected case), :mod:`!doctest`'s :mod:`!unittest` reporting flags are :ref:`bitwise ORed <bitwise>` into the option flags, and the option flags so augmented are passed to the :class:`DocTestRunner` instance created to run the doctest. If any reporting flags were specified when the :class:`!DocTestCase` instance was constructed, :mod:`!doctest`'s :mod:`!unittest` reporting flags are ignored.
sv: Detta är en modul-global inställning, och påverkar alla framtida doctest som körs av modulen :mod:`unittest`: :meth:`!runTest`-metoden i :class:`!DocTestCase` tittar på de alternativflaggor som specificerades för testfallet när :class:`!DocTestCase`-instansen konstruerades. Om inga rapporteringsflaggor specificerades (vilket är det typiska och förväntade fallet), :mod:`!doctest` :mod:`!unittest` rapporteringsflaggor är :ref:``bitwise ORed <bitwise>`` i alternativflaggorna, och alternativflaggorna så förstärkta skickas till :class:`DocTestRunner` instansen skapad för att köra doctestet. Om några rapporteringsflaggor specificerades när :class:`!DocTestCase`-instansen konstruerades, ignoreras :mod:`!doctest`:s :mod:`!unittest` rapporteringsflaggor.

source: The value of the :mod:`unittest` reporting flags in effect before the function was called is returned by the function.
sv: Funktionen returnerar värdet på :mod:`unittest`-rapporteringsflaggorna som gällde innan funktionen anropades.

source: Advanced API
sv: Avancerat API

source: The basic API is a simple wrapper that's intended to make doctest easy to use. It is fairly flexible, and should meet most users' needs; however, if you require more fine-grained control over testing, or wish to extend doctest's capabilities, then you should use the advanced API.
sv: Det grundläggande API:et är en enkel wrapper som är avsedd att göra doctest lätt att använda. Det är ganska flexibelt och bör uppfylla de flesta användares behov; men om du behöver mer finkornig kontroll över testningen eller vill utöka doctests funktioner bör du använda det avancerade API:et.

source: The advanced API revolves around two container classes, which are used to store the interactive examples extracted from doctest cases:
sv: Det avancerade API:et kretsar kring två containerklasser som används för att lagra de interaktiva exempel som hämtas från doctest-fall:

source: :class:`Example`: A single Python :term:`statement`, paired with its expected output.
sv: :class:`Exempel`: En enda Python :term:`statement`, parat med dess förväntade resultat.

source: :class:`DocTest`: A collection of :class:`Example`\ s, typically extracted from a single docstring or text file.
sv: :class:`DocTest`: En samling av :class:`Example`, vanligtvis extraherade från en enda dokumentsträng eller textfil.

source: Additional processing classes are defined to find, parse, and run, and check doctest examples:
sv: Ytterligare bearbetningsklasser definieras för att hitta, analysera och köra samt kontrollera doctest-exempel:

source: :class:`DocTestFinder`: Finds all docstrings in a given module, and uses a :class:`DocTestParser` to create a :class:`DocTest` from every docstring that contains interactive examples.
sv: :class:`DocTestFinder`: Hittar alla dokumentsträngar i en given modul och använder en :class:`DocTestParser` för att skapa en :class:`DocTest` från varje dokumentsträng som innehåller interaktiva exempel.

source: :class:`DocTestParser`: Creates a :class:`DocTest` object from a string (such as an object's docstring).
sv: :class:`DocTestParser`: Skapar ett :class:`DocTest`-objekt från en sträng (t.ex. ett objekts docstring).

source: :class:`DocTestRunner`: Executes the examples in a :class:`DocTest`, and uses an :class:`OutputChecker` to verify their output.
sv: :class:`DocTestRunner`: Exekverar exemplen i en :class:`DocTest` och använder en :class:`OutputChecker` för att verifiera utdata.

source: :class:`OutputChecker`: Compares the actual output from a doctest example with the expected output, and decides whether they match.
sv: :class:`OutputChecker`: Jämför den faktiska utdata från ett doctest-exempel med den förväntade utdata och avgör om de stämmer överens.

source: The relationships among these processing classes are summarized in the following diagram::
sv: Relationerna mellan dessa bearbetningsklasser sammanfattas i följande diagram::

source: DocTest Objects
sv: DocTest-objekt

source: A collection of doctest examples that should be run in a single namespace. The constructor arguments are used to initialize the attributes of the same names.
sv: En samling doctest-exempel som bör köras i ett enda namnområde. Argumenten i konstruktorn används för att initiera attributen med samma namn.

source: :class:`DocTest` defines the following attributes. They are initialized by the constructor, and should not be modified directly.
sv: :class:`DocTest` definierar följande attribut. De initialiseras av konstruktören och bör inte modifieras direkt.

source: A list of :class:`Example` objects encoding the individual interactive Python examples that should be run by this test.
sv: En lista med :class:`Example`-objekt som kodar för de enskilda interaktiva Python-exempel som ska köras av detta test.

source: The namespace (aka globals) that the examples should be run in. This is a dictionary mapping names to values. Any changes to the namespace made by the examples (such as binding new variables) will be reflected in :attr:`globs` after the test is run.
sv: Namnrymden (även kallad globals) som exemplen ska köras i. Detta är en ordbok som mappar namn till värden. Alla ändringar i namnrymden som görs av exemplen (t.ex. bindning av nya variabler) kommer att återspeglas i :attr:`globs` efter att testet har körts.

source: A string name identifying the :class:`DocTest`. Typically, this is the name of the object or file that the test was extracted from.
sv: Ett strängnamn som identifierar :class:`DocTest`. Vanligtvis är detta namnet på det objekt eller den fil som testet extraherades från.

source: The name of the file that this :class:`DocTest` was extracted from; or ``None`` if the filename is unknown, or if the :class:`!DocTest` was not extracted from a file.
sv: Namnet på filen som detta :class:`DocTest` extraherades från; eller ``None`` om filnamnet är okänt, eller om :class:`!DocTest` inte extraherades från en fil.

source: The line number within :attr:`filename` where this :class:`DocTest` begins, or ``None`` if the line number is unavailable. This line number is zero-based with respect to the beginning of the file.
sv: Radnumret i :attr:`filename` där denna :class:`DocTest` börjar, eller ``None`` om radnumret inte är tillgängligt. Radnumret är nollbaserat i förhållande till början av filen.

source: The string that the test was extracted from, or ``None`` if the string is unavailable, or if the test was not extracted from a string.
sv: Den sträng som testet extraherades från, eller ``None`` om strängen inte är tillgänglig, eller om testet inte extraherades från en sträng.

source: Example Objects
sv: Exempel på objekt

source: A single interactive example, consisting of a Python statement and its expected output. The constructor arguments are used to initialize the attributes of the same names.
sv: Ett enda interaktivt exempel som består av en Python-sats och dess förväntade utdata. Argumenten i konstruktorn används för att initiera attributen med samma namn.

source: :class:`Example` defines the following attributes. They are initialized by the constructor, and should not be modified directly.
sv: :class:`Example` definierar följande attribut. De initialiseras av konstruktören och bör inte modifieras direkt.

source: A string containing the example's source code. This source code consists of a single Python statement, and always ends with a newline; the constructor adds a newline when necessary.
sv: En sträng som innehåller exemplets källkod. Källkoden består av en enda Python-sats och avslutas alltid med en ny rad; konstruktören lägger till en ny rad när det behövs.

source: The expected output from running the example's source code (either from stdout, or a traceback in case of exception). :attr:`want` ends with a newline unless no output is expected, in which case it's an empty string. The constructor adds a newline when necessary.
sv: Den förväntade utdata från körning av exemplets källkod (antingen från stdout eller en spårning vid undantag). :attr:`want` slutar med en ny rad om ingen utdata förväntas, i vilket fall det är en tom sträng. Konstruktören lägger till en ny rad när det behövs.

source: The exception message generated by the example, if the example is expected to generate an exception; or ``None`` if it is not expected to generate an exception. This exception message is compared against the return value of :func:`traceback.format_exception_only`. :attr:`exc_msg` ends with a newline unless it's ``None``. The constructor adds a newline if needed.
sv: Det undantagsmeddelande som genereras av exemplet, om exemplet förväntas generera ett undantag; eller ``None`` om det inte förväntas generera ett undantag. Detta undantagsmeddelande jämförs med returvärdet för :func:`traceback.format_exception_only`. :attr:`exc_msg` slutar med en ny rad om det inte är ``None``. Konstruktören lägger till en ny rad om det behövs.

source: The line number within the string containing this example where the example begins. This line number is zero-based with respect to the beginning of the containing string.
sv: Radnumret i den sträng som innehåller detta exempel där exemplet börjar. Radnumret är nollbaserat i förhållande till början av den sträng som innehåller exemplet.

source: The example's indentation in the containing string, i.e., the number of space characters that precede the example's first prompt.
sv: Exemplets indrag i den innehållande strängen, dvs. antalet mellanslagstecken som föregår exemplets första prompt.

source: A dictionary mapping from option flags to ``True`` or ``False``, which is used to override default options for this example. Any option flags not contained in this dictionary are left at their default value (as specified by the :class:`DocTestRunner`'s :ref:`optionflags <doctest-options>`). By default, no options are set.
sv: En ordbok som mappar från alternativflaggor till ``True`` eller ``False``, som används för att åsidosätta standardalternativ för detta exempel. Alla alternativflaggor som inte finns i denna ordbok lämnas med sitt standardvärde (som anges av :class:`DocTestRunner` :ref:`optionflags <doctest-options>`). Som standard är inga alternativ inställda.

source: DocTestFinder objects
sv: DocTestFinder-objekt

source: A processing class used to extract the :class:`DocTest`\ s that are relevant to a given object, from its docstring and the docstrings of its contained objects. :class:`DocTest`\ s can be extracted from modules, classes, functions, methods, staticmethods, classmethods, and properties.
sv: En bearbetningsklass som används för att extrahera de :class:`DocTest` s som är relevanta för ett visst objekt, från dess docstring och docstrings för de objekt som ingår. :class:`DocTest` s kan extraheras från moduler, klasser, funktioner, metoder, staticmethods, classmethods och properties.

source: The optional argument *verbose* can be used to display the objects searched by the finder. It defaults to ``False`` (no output).
sv: Det valfria argumentet *verbose* kan användas för att visa de objekt som sökts av sökaren. Standardvärdet är ``False`` (ingen utdata).

source: The optional argument *parser* specifies the :class:`DocTestParser` object (or a drop-in replacement) that is used to extract doctests from docstrings.
sv: Det valfria argumentet *parser* anger objektet :class:`DocTestParser` (eller en direkt ersättare) som används för att extrahera doctests från docstrings.

source: If the optional argument *recurse* is false, then :meth:`DocTestFinder.find` will only examine the given object, and not any contained objects.
sv: Om det valfria argumentet *recurse* är false, kommer :meth:`DocTestFinder.find` endast att undersöka det givna objektet, och inte några ingående objekt.

source: If the optional argument *exclude_empty* is false, then :meth:`DocTestFinder.find` will include tests for objects with empty docstrings.
sv: Om det valfria argumentet *exclude_empty* är false, kommer :meth:`DocTestFinder.find` att inkludera tester för objekt med tomma dokumentsträngar.

source: :class:`DocTestFinder` defines the following method:
sv: :class:`DocTestFinder` definierar följande metod:

source: Return a list of the :class:`DocTest`\ s that are defined by *obj*'s docstring, or by any of its contained objects' docstrings.
sv: Returnerar en lista över :class:`DocTest` s som definieras av *obj*s docstring, eller av någon av dess ingående objekts docstrings.

source: The optional argument *name* specifies the object's name; this name will be used to construct names for the returned :class:`DocTest`\ s. If *name* is not specified, then ``obj.__name__`` is used.
sv: Det valfria argumentet *name* anger objektets namn; detta namn kommer att användas för att konstruera namn för de returnerade :class:`DocTest` s. Om *name* inte anges används ``obj.__name__``.

source: The optional parameter *module* is the module that contains the given object. If the module is not specified or is ``None``, then the test finder will attempt to automatically determine the correct module. The object's module is used:
sv: Den valfria parametern *module* är den modul som innehåller det angivna objektet. Om modulen inte anges eller är ``None``, kommer testfinder att försöka att automatiskt bestämma rätt modul. Objektets modul används:

source: As a default namespace, if *globs* is not specified.
sv: Som standardnamnrymd om *globs* inte anges.

source: To prevent the DocTestFinder from extracting DocTests from objects that are imported from other modules. (Contained objects with modules other than *module* are ignored.)
sv: För att förhindra DocTestFinder från att extrahera DocTests från objekt som importeras från andra moduler. (Inneslutna objekt med andra moduler än *modul* ignoreras)

source: To find the name of the file containing the object.
sv: För att hitta namnet på den fil som innehåller objektet.

source: To help find the line number of the object within its file.
sv: För att hjälpa till att hitta radnumret för objektet i dess fil.

source: If *module* is ``False``, no attempt to find the module will be made. This is obscure, of use mostly in testing doctest itself: if *module* is ``False``, or is ``None`` but cannot be found automatically, then all objects are considered to belong to the (non-existent) module, so all contained objects will (recursively) be searched for doctests.
sv: Om *module* är ``False`` kommer inget försök att hitta modulen att göras. Detta är oklart och används mest för att testa själva doctest: om *module* är ``False``, eller är ``None`` men inte kan hittas automatiskt, anses alla objekt tillhöra den (icke-existerande) modulen, så alla objekt som ingår kommer (rekursivt) att sökas efter doctests.

source: The globals for each :class:`DocTest` is formed by combining *globs* and *extraglobs* (bindings in *extraglobs* override bindings in *globs*). A new shallow copy of the globals dictionary is created for each :class:`!DocTest`. If *globs* is not specified, then it defaults to the module's :attr:`~module.__dict__`, if specified, or ``{}`` otherwise. If *extraglobs* is not specified, then it defaults to ``{}``.
sv: Globalerna för varje :class:`DocTest` bildas genom att kombinera *globs* och *extraglobs* (bindningar i *extraglobs* åsidosätter bindningar i *globs*). En ny ytlig kopia av globals-ordlistan skapas för varje :class:`!DocTest`. Om *globs* inte anges är standardvärdet modulens :attr:`~module.__dict__`, om den anges, eller ``{}`` annars. Om *extraglobs* inte anges är standardvärdet ``{}``.

source: DocTestParser objects
sv: DocTestParser-objekt

source: A processing class used to extract interactive examples from a string, and use them to create a :class:`DocTest` object.
sv: En bearbetningsklass som används för att extrahera interaktiva exempel från en sträng och använda dem för att skapa ett :class:`DocTest`-objekt.

source: :class:`DocTestParser` defines the following methods:
sv: :class:`DocTestParser` definierar följande metoder:

source: Extract all doctest examples from the given string, and collect them into a :class:`DocTest` object.
sv: Extrahera alla doctest-exempel från den angivna strängen och samla dem i ett :class:`DocTest`-objekt.

source: *globs*, *name*, *filename*, and *lineno* are attributes for the new :class:`!DocTest` object. See the documentation for :class:`DocTest` for more information.
sv: *globs*, *name*, *filename* och *lineno* är attribut för det nya :class:`!DocTest`-objektet. Se dokumentationen för :class:`DocTest` för mer information.

source: Extract all doctest examples from the given string, and return them as a list of :class:`Example` objects. Line numbers are 0-based. The optional argument *name* is a name identifying this string, and is only used for error messages.
sv: Extraherar alla doctest-exempel från den angivna strängen och returnerar dem som en lista med :class:`Example`-objekt. Radnummer är 0-baserade. Det valfria argumentet *name* är ett namn som identifierar den här strängen och används endast för felmeddelanden.

source: Divide the given string into examples and intervening text, and return them as a list of alternating :class:`Example`\ s and strings. Line numbers for the :class:`!Example`\ s are 0-based. The optional argument *name* is a name identifying this string, and is only used for error messages.
sv: Dela upp den angivna strängen i exempel och mellanliggande text, och returnera dem som en lista med omväxlande :class:`Example`\ s och strängar. Radnumren för :class:`!Example` s är 0-baserade. Det valfria argumentet *name* är ett namn som identifierar den här strängen och används endast för felmeddelanden.

source: TestResults objects
sv: TestResults-objekt

source: Number of failed tests.
sv: Antal misslyckade tester.

source: Number of attempted tests.
sv: Antal testförsök.

source: Number of skipped tests.
sv: Antal överhoppade tester.

source: DocTestRunner objects
sv: DocTestRunner-objekt

source: A processing class used to execute and verify the interactive examples in a :class:`DocTest`.
sv: En bearbetningsklass som används för att exekvera och verifiera de interaktiva exemplen i en :class:`DocTest`.

source: The comparison between expected outputs and actual outputs is done by an :class:`OutputChecker`. This comparison may be customized with a number of option flags; see section :ref:`doctest-options` for more information. If the option flags are insufficient, then the comparison may also be customized by passing a subclass of :class:`!OutputChecker` to the constructor.
sv: Jämförelsen mellan förväntade utdata och faktiska utdata görs av en :class:`OutputChecker`. Denna jämförelse kan anpassas med ett antal alternativflaggor; se avsnitt :ref:`doctest-options` för mer information. Om optionsflaggorna är otillräckliga kan jämförelsen också anpassas genom att skicka en underklass av :class:`!OutputChecker` till konstruktören.

source: The test runner's display output can be controlled in two ways. First, an output function can be passed to :meth:`run`; this function will be called with strings that should be displayed. It defaults to ``sys.stdout.write``. If capturing the output is not sufficient, then the display output can be also customized by subclassing DocTestRunner, and overriding the methods :meth:`report_start`, :meth:`report_success`, :meth:`report_unexpected_exception`, and :meth:`report_failure`.
sv: Testlöparens displayutmatning kan styras på två sätt. För det första kan en utdatafunktion skickas till :meth:`run`; denna funktion kommer att anropas med strängar som ska visas. Standardvärdet är ``sys.stdout.write``. Om det inte är tillräckligt att fånga utdata kan visningsutdata också anpassas genom att subklassa DocTestRunner och åsidosätta metoderna :meth:`report_start`, :meth:`report_success`, :meth:`report_unexpected_exception` och :meth:`report_failure`.

source: The optional keyword argument *checker* specifies the :class:`OutputChecker` object (or drop-in replacement) that should be used to compare the expected outputs to the actual outputs of doctest examples.
sv: Det valfria nyckelordsargumentet *checker* anger objektet :class:`OutputChecker` (eller en ersättare) som ska användas för att jämföra förväntade utdata med faktiska utdata för doctest-exempel.

source: The optional keyword argument *verbose* controls the :class:`DocTestRunner`'s verbosity. If *verbose* is ``True``, then information is printed about each example, as it is run. If *verbose* is ``False``, then only failures are printed. If *verbose* is unspecified, or ``None``, then verbose output is used iff the command-line switch ``-v`` is used.
sv: Det valfria nyckelordsargumentet *verbose* styr :class:`DocTestRunner` s ordrikedom. Om *verbose* är ``True``, skrivs information ut om varje exempel, allteftersom det körs. Om *verbose* är ``False`` skrivs endast misslyckanden ut. Om *verbose* är ospecificerat, eller ``None``, så används verbose-utmatning om kommandoradsväxeln ``-v`` används.

source: The optional keyword argument *optionflags* can be used to control how the test runner compares expected output to actual output, and how it displays failures. For more information, see section :ref:`doctest-options`.
sv: Det valfria nyckelordsargumentet *optionflags* kan användas för att styra hur testlöparen jämför förväntade resultat med faktiska resultat och hur den visar misslyckanden. För mer information, se avsnitt :ref:`doctest-options`.

source: The test runner accumulates statistics. The aggregated number of attempted, failed and skipped examples is also available via the :attr:`tries`, :attr:`failures` and :attr:`skips` attributes. The :meth:`run` and :meth:`summarize` methods return a :class:`TestResults` instance.
sv: Testlöparen samlar in statistik. Det sammanlagda antalet försök, misslyckade och överhoppade exempel är också tillgängligt via attributen :attr:`tries`, :attr:`failures` och :attr:`skips`. Metoderna :meth:`run` och :meth:`summarize` returnerar en instans av :class:`TestResults`.

source: :class:`DocTestRunner` defines the following methods:
sv: :class:`DocTestRunner` definierar följande metoder:

source: Report that the test runner is about to process the given example. This method is provided to allow subclasses of :class:`DocTestRunner` to customize their output; it should not be called directly.
sv: Rapporterar att testlöparen håller på att bearbeta det givna exemplet. Denna metod tillhandahålls för att underklasser till :class:`DocTestRunner` ska kunna anpassa sin utdata; den ska inte anropas direkt.

source: *example* is the example about to be processed. *test* is the test containing *example*. *out* is the output function that was passed to :meth:`DocTestRunner.run`.
sv: *exempel* är det exempel som ska bearbetas. *test* är testet som innehåller *example*. *out* är den utdatafunktion som skickades till :meth:`DocTestRunner.run`.
