Repository: yeager/python-docs-sv
Catalog: library/email.utils.po
Languages: sv

source: :mod:`!email.utils`: Miscellaneous utilities
sv: :mod:`!email.utils`: Diverse verktyg

source: **Source code:** :source:`Lib/email/utils.py`
sv: **Källkod:** :source:`Lib/email/utils.py`

source: There are a couple of useful utilities provided in the :mod:`email.utils` module:
sv: Det finns ett par användbara verktyg i modulen :mod:`email.utils`:

source: Return local time as an aware datetime object. If called without arguments, return current time. Otherwise *dt* argument should be a :class:`~datetime.datetime` instance, and it is converted to the local time zone according to the system time zone database. If *dt* is naive (that is, ``dt.tzinfo`` is ``None``), it is assumed to be in local time.
sv: Returnerar lokal tid som ett medvetet datetime-objekt. Om den anropas utan argument, returneras aktuell tid. Annars bör *dt*-argumentet vara en :class:`~datetime.datetime`-instans, och den konverteras till den lokala tidszonen enligt systemets tidszonsdatabas. Om *dt* är naiv (det vill säga, ``dt.tzinfo`` är ``None``), antas den vara i lokal tid.

source: The *isdst* parameter.
sv: Parametern *isdst*.

source: Returns a string suitable for an :rfc:`2822`\ -compliant :mailheader:`Message-ID` header. Optional *idstring* if given, is a string used to strengthen the uniqueness of the message id. Optional *domain* if given provides the portion of the msgid after the '@'. The default is the local hostname. It is not normally necessary to override this default, but may be useful certain cases, such as a constructing distributed system that uses a consistent domain name across multiple hosts.
sv: Returnerar en sträng som passar för ett :rfc:`2822`-kompatibelt :mailheader:`Message-ID`-huvud. Valfri *idstring* om den anges, är en sträng som används för att stärka det unika i meddelandets id. Valfri *domain* om den anges, anger den del av msgid som kommer efter "@". Standardvärdet är det lokala värdnamnet. Det är normalt inte nödvändigt att åsidosätta denna standard, men det kan vara användbart i vissa fall, t.ex. i ett distribuerat system som använder ett konsekvent domännamn på flera värdar.

source: Added the *domain* keyword.
sv: Nyckelordet *domain* har lagts till.

source: The remaining functions are part of the legacy (``Compat32``) email API. There is no need to directly use these with the new API, since the parsing and formatting they provide is done automatically by the header parsing machinery of the new API.
sv: De återstående funktionerna är en del av det äldre (``Compat32``) e-post-API:et. Det finns inget behov av att direkt använda dessa med det nya API:et, eftersom den parsning och formatering som de tillhandahåller görs automatiskt av det nya API:ets maskineri för parsning av rubriker.

source: Return a new string with backslashes in *str* replaced by two backslashes, and double quotes replaced by backslash-double quote.
sv: Returnerar en ny sträng med bindestreck i *str* ersatta av två bindestreck och dubbla citattecken ersatta av backslash-dubbla citattecken.

source: Return a new string which is an *unquoted* version of *str*. If *str* ends and begins with double quotes, they are stripped off. Likewise if *str* ends and begins with angle brackets, they are stripped off.
sv: Returnerar en ny sträng som är en *okvoterad* version av *str*. Om *str* börjar och slutar med dubbla citattecken tas de bort. Likaså om *str* slutar och börjar med vinkelparenteser, tas de bort.

source: Parse address -- which should be the value of some address-containing field such as :mailheader:`To` or :mailheader:`Cc` -- into its constituent *realname* and *email address* parts. Returns a tuple of that information, unless the parse fails, in which case a 2-tuple of ``('', '')`` is returned.
sv: Analyserar adressen -- som bör vara värdet i ett adressinnehållande fält som :mailheader:`To` eller :mailheader:`Cc` -- i dess beståndsdelar *realname* och *email address*. Returnerar en tupel av denna information, såvida inte parsen misslyckas, i vilket fall en 2-tupel av ``('', '')`` returneras.

source: If *strict* is true, use a strict parser which rejects malformed inputs.
sv: Om *strict* är true, använd en strikt parser som avvisar felaktiga inmatningar.

source: Add *strict* optional parameter and reject malformed inputs by default.
sv: Lägg till *strict* valfri parameter och avvisa felaktiga inmatningar som standard.

source: The inverse of :meth:`parseaddr`, this takes a 2-tuple of the form ``(realname, email_address)`` and returns the string value suitable for a :mailheader:`To` or :mailheader:`Cc` header. If the first element of *pair* is false, then the second element is returned unmodified.
sv: Detta är inversen av :meth:`parseaddr` och tar en 2-tupel av formen ``(realname, email_address)`` och returnerar det strängvärde som passar för en :mailheader:`To` eller :mailheader:`Cc` header. Om det första elementet i *pair* är falskt returneras det andra elementet oförändrat.

source: Optional *charset* is the character set that will be used in the :rfc:`2047` encoding of the ``realname`` if the ``realname`` contains non-ASCII characters. Can be an instance of :class:`str` or a :class:`~email.charset.Charset`. Defaults to ``utf-8``.
sv: Valfri *charset* är den teckenuppsättning som kommer att användas i :rfc:`2047`-kodningen av ``realname`` om ``realname`` innehåller icke-ASCII-tecken. Kan vara en instans av :class:`str` eller en :class:`~email.charset.Charset`. Standardvärdet är ``utf-8``.

source: Added the *charset* option.
sv: Alternativet *charset* har lagts till.

source: This method returns a list of 2-tuples of the form returned by ``parseaddr()``. *fieldvalues* is a sequence of header field values as might be returned by :meth:`Message.get_all <email.message.Message.get_all>`.
sv: Denna metod returnerar en lista med 2-tuples av den form som returneras av ``parseaddr()``. *fieldvalues* är en sekvens av värden för rubrikfält som kan returneras av :meth:`Message.get_all <email.message.Message.get_all>`.

source: Here's a simple example that gets all the recipients of a message::
sv: Här är ett enkelt exempel som hämtar alla mottagare av ett meddelande::

source: Attempts to parse a date according to the rules in :rfc:`2822`. however, some mailers don't follow that format as specified, so :func:`parsedate` tries to guess correctly in such cases. *date* is a string containing an :rfc:`2822` date, such as ``"Mon, 20 Nov 1995 19:12:08 -0500"``. If it succeeds in parsing the date, :func:`parsedate` returns a 9-tuple that can be passed directly to :func:`time.mktime`; otherwise ``None`` will be returned. Note that indexes 6, 7, and 8 of the result tuple are not usable.
sv: Försöker tolka ett datum enligt reglerna i :rfc:`2822`. Vissa utskick följer dock inte formatet som det är specificerat, så :func:`parsedate` försöker gissa rätt i sådana fall. *date* är en sträng som innehåller ett :rfc:`2822` datum, till exempel ``"Mon, 20 Nov 1995 19:12:08 -0500"``. Om den lyckas analysera datumet returnerar :func:`parsedate` en 9-tupel som kan skickas direkt till :func:`time.mktime`; annars returneras ``None``. Observera att index 6, 7 och 8 i resultattupeln inte är användbara.

source: Performs the same function as :func:`parsedate`, but returns either ``None`` or a 10-tuple; the first 9 elements make up a tuple that can be passed directly to :func:`time.mktime`, and the tenth is the offset of the date's timezone from UTC (which is the official term for Greenwich Mean Time) [#]_. If the input string has no timezone, the last element of the tuple returned is ``0``, which represents UTC. Note that indexes 6, 7, and 8 of the result tuple are not usable.
sv: Utför samma funktion som :func:`parsedate`, men returnerar antingen ``None`` eller en 10-tupel; de första 9 elementen utgör en tupel som kan skickas direkt till :func:`time.mktime`, och det tionde är förskjutningen av datumets tidszon från UTC (som är den officiella termen för Greenwich Mean Time) [#]_. Om indatasträngen inte har någon tidszon är det sista elementet i den tupel som returneras ``0``, vilket representerar UTC. Observera att index 6, 7 och 8 i resultattupeln inte är användbara.

source: The inverse of :func:`format_datetime`. Performs the same function as :func:`parsedate`, but on success returns a :mod:`~datetime.datetime`; otherwise ``ValueError`` is raised if *date* contains an invalid value such as an hour greater than 23 or a timezone offset not between -24 and 24 hours. If the input date has a timezone of ``-0000``, the ``datetime`` will be a naive ``datetime``, and if the date is conforming to the RFCs it will represent a time in UTC but with no indication of the actual source timezone of the message the date comes from. If the input date has any other valid timezone offset, the ``datetime`` will be an aware ``datetime`` with the corresponding a :class:`~datetime.timezone` :class:`~datetime.tzinfo`.
sv: Inversen av :func:`format_datetime`. Utför samma funktion som :func:`parsedate`, men vid framgång returneras en :mod:`~datetime.datetime`; annars uppstår ``ValueError`` om *date* innehåller ett ogiltigt värde, t.ex. en timme större än 23 eller en tidszonsförskjutning som inte är mellan -24 och 24 timmar. Om indatadatumet har en tidszon på ``-0000`` kommer ``datetime`` att vara en naiv ``datetime``, och om datumet överensstämmer med RFC kommer det att representera en tid i UTC men utan någon indikation på den faktiska källtidszonen för meddelandet som datumet kommer från. Om indatadatumet har någon annan giltig tidszonsförskjutning, kommer ``datetime`` att vara en medveten ``datetime`` med motsvarande a :class:`~datetime.timezone` :class:`~datetime.tzinfo`.

source: Turn a 10-tuple as returned by :func:`parsedate_tz` into a UTC timestamp (seconds since the Epoch). If the timezone item in the tuple is ``None``, assume local time.
sv: Gör om en 10-tupel som returneras av :func:`parsedate_tz` till en UTC-tidsmarkör (sekunder sedan epoken). Om tidszonsobjektet i tupeln är ``None``, antas lokal tid.

source: Returns a date string as per :rfc:`2822`, e.g.::
sv: Returnerar en datumsträng enligt :rfc:`2822`, t.ex.::

source: Optional *timeval* if given is a floating-point time value as accepted by :func:`time.gmtime` and :func:`time.localtime`, otherwise the current time is used.
sv: Valfri *timeval* om den ges är ett tidsvärde med flyttal som accepteras av :func:`time.gmtime` och :func:`time.localtime`, annars används aktuell tid.

source: Optional *localtime* is a flag that when ``True``, interprets *timeval*, and returns a date relative to the local timezone instead of UTC, properly taking daylight savings time into account. The default is ``False`` meaning UTC is used.
sv: Valfri *localtime* är en flagga som när den är ``True`` tolkar *timeval* och returnerar ett datum i förhållande till den lokala tidszonen istället för UTC, med korrekt hänsyn till sommartid. Standardvärdet är ``False``, vilket innebär att UTC används.

source: Optional *usegmt* is a flag that when ``True``, outputs a date string with the timezone as an ascii string ``GMT``, rather than a numeric ``-0000``. This is needed for some protocols (such as HTTP). This only applies when *localtime* is ``False``. The default is ``False``.
sv: Valfri *usegmt* är en flagga som när den är ``True``, matar ut en datumsträng med tidszonen som en ascii-sträng ``GMT``, snarare än en numerisk ``-0000``. Detta behövs för vissa protokoll (t.ex. HTTP). Detta gäller endast när *localtime* är ``False``. Standardvärdet är ``False``.

source: Like ``formatdate``, but the input is a :mod:`datetime` instance. If it is a naive datetime, it is assumed to be "UTC with no information about the source timezone", and the conventional ``-0000`` is used for the timezone. If it is an aware ``datetime``, then the numeric timezone offset is used. If it is an aware timezone with offset zero, then *usegmt* may be set to ``True``, in which case the string ``GMT`` is used instead of the numeric timezone offset. This provides a way to generate standards conformant HTTP date headers.
sv: Som ``formatdate``, men indata är en :mod:`datetime`-instans. Om det är en naiv datatid antas den vara "UTC utan information om källans tidszon" och den konventionella ``-0000`` används för tidszonen. Om det är en medveten ``datetime`` används den numeriska tidszonsförskjutningen. Om det är en medveten tidszon med offset noll, kan *usegmt* sättas till ``True``, i vilket fall strängen ``GMT`` används istället för den numeriska tidszonsförskjutningen. Detta ger ett sätt att generera standardkonforma HTTP-datahuvuden.

source: Decode the string *s* according to :rfc:`2231`.
sv: Avkoda strängen *s* enligt :rfc:`2231`.

source: Encode the string *s* according to :rfc:`2231`. Optional *charset* and *language*, if given is the character set name and language name to use. If neither is given, *s* is returned as-is. If *charset* is given but *language* is not, the string is encoded using the empty string for *language*.
sv: Kodar strängen *s* enligt :rfc:`2231`. De valfria *charset* och *language*, om de anges, är namnet på den teckenuppsättning och det språk som ska användas. Om inget av dessa anges returneras *s* i befintligt skick. Om *charset* anges men inte *language*, kodas strängen med hjälp av den tomma strängen för *language*.

source: When a header parameter is encoded in :rfc:`2231` format, :meth:`Message.get_param <email.message.Message.get_param>` may return a 3-tuple containing the character set, language, and value. :func:`collapse_rfc2231_value` turns this into a unicode string. Optional *errors* is passed to the *errors* argument of :class:`str`'s :func:`~str.encode` method; it defaults to ``'replace'``. Optional *fallback_charset* specifies the character set to use if the one in the :rfc:`2231` header is not known by Python; it defaults to ``'us-ascii'``.
sv: När en rubrikparameter är kodad i :rfc:`2231`-format kan :meth:`Message.get_param <email.message.Message.get_param>` returnera en 3-tupel som innehåller teckenuppsättning, språk och värde. :func:`collapse_rfc2231_value` omvandlar detta till en unicode-sträng. Den valfria *errors* skickas till *errors*-argumentet i :class:`str` :func:`~str.encode`-metoden; standardvärdet är ``'replace'``. Valfri *fallback_charset* anger den teckenuppsättning som ska användas om den i :rfc:`2231`-huvudet inte är känd av Python; standard är ``'us-ascii'``.

source: For convenience, if the *value* passed to :func:`collapse_rfc2231_value` is not a tuple, it should be a string and it is returned unquoted.
sv: För enkelhetens skull, om *värdet* som skickas till :func:`collapse_rfc2231_value` inte är en tupel, bör det vara en sträng och den returneras utan citat.

source: Decode parameters list according to :rfc:`2231`. *params* is a sequence of 2-tuples containing elements of the form ``(content-type, string-value)``.
sv: Avkodar parameterlista enligt :rfc:`2231`. *params* är en sekvens av 2-tupler som innehåller element av formen ``(content-type, string-value)``.

source: Footnotes
sv: Fotnoter

source: Note that the sign of the timezone offset is the opposite of the sign of the ``time.timezone`` variable for the same timezone; the latter variable follows the POSIX standard while this module follows :rfc:`2822`.
sv: Observera att tecknet för tidszonsförskjutningen är det motsatta till tecknet för variabeln ``time.timezone`` för samma tidszon; den senare variabeln följer POSIX-standarden medan den här modulen följer :rfc:`2822`.
