Repository: yeager/python-docs-sv
Catalog: library/email.iterators.po
Languages: sv

source: :mod:`!email.iterators`: Iterators
sv: :mod:`!email.iterators`: Iteratorer

source: **Source code:** :source:`Lib/email/iterators.py`
sv: **Källkod:** :source:`Lib/email/iterators.py`

source: Iterating over a message object tree is fairly easy with the :meth:`Message.walk <email.message.Message.walk>` method. The :mod:`email.iterators` module provides some useful higher level iterations over message object trees.
sv: Att iterera över ett meddelandeobjektträd är ganska enkelt med metoden :meth:`Message.walk <email.message.Message.walk>`. Modulen :mod:`email.iterators` ger några användbara iterationer på högre nivå över träd med meddelandeobjekt.

source: This iterates over all the payloads in all the subparts of *msg*, returning the string payloads line-by-line. It skips over all the subpart headers, and it skips over any subpart with a payload that isn't a Python string. This is somewhat equivalent to reading the flat text representation of the message from a file using :meth:`~io.TextIOBase.readline`, skipping over all the intervening headers.
sv: Detta itererar över alla nyttoladdningar i alla underdelar av *msg* och returnerar strängnyttoladdningarna rad för rad. Den hoppar över alla underavdelningsrubriker och den hoppar över alla underavdelningar med en nyttolast som inte är en Python-sträng. Detta motsvarar i viss mån att läsa den platta textrepresentationen av meddelandet från en fil med :meth:`~io.TextIOBase.readline`, och hoppa över alla mellanliggande rubriker.

source: Optional *decode* is passed through to :meth:`Message.get_payload <email.message.Message.get_payload>`.
sv: Valfri *decode* skickas vidare till :meth:`Message.get_payload <email.message.Message.get_payload>`.

source: This iterates over all the subparts of *msg*, returning only those subparts that match the MIME type specified by *maintype* and *subtype*.
sv: Detta itererar över alla underdelar av *msg* och returnerar endast de underdelar som matchar den MIME-typ som anges av *maintype* och *subtype*.

source: Note that *subtype* is optional; if omitted, then subpart MIME type matching is done only with the main type. *maintype* is optional too; it defaults to :mimetype:`text`.
sv: Observera att *subtype* är valfri; om den utelämnas görs matchning av MIME-typer för underdelar endast med huvudtypen. *maintype* är också valfritt; standardvärdet är :mimetype:`text`.

source: Thus, by default :func:`typed_subpart_iterator` returns each subpart that has a MIME type of :mimetype:`text/\*`.
sv: Som standard returnerar alltså :func:`typed_subpart_iterator` varje underavsnitt som har MIME-typen :mimetype:`text/\*`.

source: The following function has been added as a useful debugging tool. It should *not* be considered part of the supported public interface for the package.
sv: Följande funktion har lagts till som ett användbart felsökningsverktyg. Den ska *inte* betraktas som en del av det offentliga gränssnitt som stöds för paketet.

source: Prints an indented representation of the content types of the message object structure. For example:
sv: Skriver ut en indragen representation av innehållstyperna i meddelandeobjektstrukturen. Till exempel

source: Optional *fp* is a file-like object to print the output to. It must be suitable for Python's :func:`print` function. *level* is used internally. *include_default*, if true, prints the default type as well.
sv: Valfritt *fp* är ett filliknande objekt att skriva ut utdata till. Det måste vara lämpligt för Pythons funktion :func:`print`. *level* används internt. *include_default*, om true, skriver ut standardtypen också.
