Repository: yeager/python-docs-sv
Catalog: library/email.message.po
Languages: sv

source: (According to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value. :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.)
sv: (Enligt :rfc:`2045` har meddelanden alltid en standardtyp, :meth:`get_content_type` kommer alltid att returnera ett värde. :rfc:`2045` definierar ett meddelandes standardtyp till att vara :mimetype:`text/plain` såvida det inte visas i en :mimetype:`multipart/digest`-container, i vilket fall det skulle vara :mimetype:`message/rfc822`. Om rubriken :mailheader:`Content-Type` har en ogiltig typspecifikation, föreskriver :rfc:`2045` att standardtypen skall vara :mimetype:`text/plain`)

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
sv: Returnerar meddelandets huvudsakliga innehållstyp. Detta är :mimetype:`maintype`-delen av strängen som returneras av :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
sv: Returnerar meddelandets typ av underinnehåll. Detta är :mimetype:`subtype`-delen av strängen som returneras av :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
sv: Returnerar den förvalda innehållstypen. De flesta meddelanden har standardinnehållstypen :mimetype:`text/plain`, utom meddelanden som är underdelar av behållare av typen :mimetype:`multipart/digest`. Sådana underdelar har en standardinnehållstyp av typen :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header, so it only affects the return value of the ``get_content_type`` methods when no :mailheader:`Content-Type` header is present in the message.
sv: Ställer in standardinnehållstypen. *ctype* bör antingen vara :mimetype:`text/plain` eller :mimetype:`message/rfc822`, även om detta inte är obligatoriskt. Standardinnehållstypen lagras inte i :mailheader:`Content-Type`-rubriken, så den påverkar bara returvärdet för metoderna ``get_content_type`` när ingen :mailheader:`Content-Type`-rubrik finns i meddelandet.

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, replace its value with *value*. When *header* is ``Content-Type`` (the default) and the header does not yet exist in the message, add it, set its value to :mimetype:`text/plain`, and append the new parameter value. Optional *header* specifies an alternative header to :mailheader:`Content-Type`.
sv: Ställer in en parameter i :mailheader:`Content-Type`-huvudet. Om parametern redan finns i rubriken ersätts dess värde med *värde*. När *header* är ``Content-Type`` (standard) och rubriken ännu inte finns i meddelandet, lägg till den, sätt dess värde till :mimetype:`text/plain` och lägg till det nya parametervärdet. Det valfria *header* anger ett alternativt huvud till :mailheader:`Content-Type`.

source: If the value contains non-ASCII characters, the charset and language may be explicitly specified using the optional *charset* and *language* parameters. Optional *language* specifies the :rfc:`2231` language, defaulting to the empty string. Both *charset* and *language* should be strings. The default is to use the ``utf8`` *charset* and ``None`` for the *language*.
sv: Om värdet innehåller icke-ASCII-tecken kan teckenuppsättning och språk anges explicit med hjälp av de valfria parametrarna *charset* och *language*. Den valfria parametern *language* anger språket enligt :rfc:`2231` och är som standard den tomma strängen. Både *charset* och *language* bör vara strängar. Standardinställningen är att använda ``utf8`` *charset* och ``None`` för *language*.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
sv: Om *replace* är ``False`` (standard) flyttas rubriken till slutet av listan med rubriker. Om *replace* är ``True`` kommer rubriken att uppdateras på plats.

source: Use of the *requote* parameter with :class:`EmailMessage` objects is deprecated.
sv: Användningen av parametern *requote* med :class:`EmailMessage`-objekt är föråldrad.

source: Note that existing parameter values of headers may be accessed through the :attr:`~email.headerregistry.ParameterizedMIMEHeader.params` attribute of the header value (for example, ``msg['Content-Type'].params['charset']``).
sv: Observera att befintliga parametervärden för rubriker kan nås via attributet :attr:`~email.headerregistry.ParameterizedMIMEHeader.params` för rubrikvärdet (t.ex. ``msg['Content-Type'].params['charset']``).

source: ``replace`` keyword was added.
sv: nyckelordet ``replace`` har lagts till.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. Optional *header* specifies an alternative to :mailheader:`Content-Type`.
sv: Tar bort den angivna parametern helt från :mailheader:`Content-Type`-huvudet. Rubriken kommer att skrivas om på plats utan parametern eller dess värde. Det valfria *header* anger ett alternativ till :mailheader:`Content-Type`.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
sv: Returnerar värdet på parametern ``filename`` i :mailheader:`Content-Disposition`-rubriken i meddelandet. Om rubriken inte har någon parameter för ``filename``, går denna metod tillbaka till att leta efter parametern ``name`` i rubriken :mailheader:`Content-Type`. Om ingen av dessa hittas, eller om rubriken saknas, returneras *failobj*. Den returnerade strängen kommer alltid att vara ociterad enligt :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
sv: Returnerar värdet på parametern ``boundary`` i :mailheader:`Content-Type`-rubriken i meddelandet, eller *failobj* om rubriken saknas eller inte har någon parameter för ``boundary``. Den returnerade strängen kommer alltid att vara ociterad enligt :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
sv: Ställ in parametern ``boundary`` i rubriken :mailheader:`Content-Type` till *boundary*. :meth:`set_boundary` kommer alltid att citera *boundary* om det behövs. Ett :exc:`~email.errors.HeaderParseError` uppstår om meddelandeobjektet inte har något :mailheader:`Content-Type`-huvud.

source: Note that using this method is subtly different from deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers.
sv: Observera att denna metod skiljer sig något från att ta bort den gamla :mailheader:`Content-Type`-rubriken och lägga till en ny med den nya gränsen via :meth:`add_header`, eftersom :meth:`set_boundary` bevarar ordningen på :mailheader:`Content-Type`-rubriken i listan över rubriker.

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
sv: Returnerar parametern ``charset`` för rubriken :mailheader:`Content-Type`, omgjord till gemener. Om det inte finns någon :mailheader:`Content-Type` header, eller om den headern inte har någon ``charset`` parameter, returneras *failobj*.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
sv: Returnerar en lista som innehåller teckenuppsättningsnamnen i meddelandet. Om meddelandet är en :mimetype:`multipart`, kommer listan att innehålla ett element för varje underdel i nyttolasten, annars kommer det att vara en lista med längden 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. If the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
sv: Varje post i listan kommer att vara en sträng som är värdet på parametern ``charset`` i rubriken :mailheader:`Content-Type` för den representerade underdelen. Om underdelen inte har något :mailheader:`Content-Type`-huvud, ingen ``charset``-parameter eller inte är av huvud-MIME-typen :mimetype:`text`, kommer den posten i den returnerade listan att vara *failobj*.

source: Return ``True`` if there is a :mailheader:`Content-Disposition` header and its (case insensitive) value is ``attachment``, ``False`` otherwise.
sv: Returnerar ``True`` om det finns en :mailheader:`Content-Disposition` header och dess (skiftlägesokänsliga) värde är ``attachment``, annars ``False``.

source: is_attachment is now a method instead of a property, for consistency with :meth:`~email.message.Message.is_multipart`.
sv: is_attachment är nu en metod istället för en egenskap, för överensstämmelse med :meth:`~email.message.Message.is_multipart`.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
sv: Returnerar det gemena värdet (utan parametrar) av meddelandets :mailheader:`Content-Disposition`-huvud om det har ett sådant, eller ``None``. De möjliga värdena för denna metod är *inline*, *attachment* eller ``None`` om meddelandet följer :rfc:`2183`.

source: The following methods relate to interrogating and manipulating the content (payload) of the message.
sv: Följande metoder avser avfrågning och manipulering av innehållet (nyttolasten) i meddelandet.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
sv: Metoden :meth:`walk` är en allroundgenerator som kan användas för att iterera över alla delar och underdelar i ett meddelandeobjektträd, i djupförsta traversalordning. Du kommer vanligtvis att använda :meth:`walk` som iterator i en ``for``-loop; varje iteration returnerar nästa underdel.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
sv: Här är ett exempel som skriver ut MIME-typen för varje del i en flerdelad meddelandestruktur:

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
sv: ``walk`` itererar över underdelarna av alla delar där :meth:`is_multipart`` returnerar ``True``, även om ``msg.get_content_maintype() == 'multipart'`` kan returnera ``False``. Vi kan se detta i vårt exempel genom att använda hjälpfunktionen ``_structure`` debug:

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
sv: Här är ``message`` delarna inte ``multiparts``, men de innehåller subparts. ``is_multipart()`` returnerar ``True`` och ``walk`` går ner i underdelarna.

source: Return the MIME part that is the best candidate to be the "body" of the message.
sv: Returnerar den MIME-del som är den bästa kandidaten för att vara "body" i meddelandet.

source: *preferencelist* must be a sequence of strings from the set ``related``, ``html``, and ``plain``, and indicates the order of preference for the content type of the part returned.
sv: *preferencelist* måste vara en sekvens av strängar från uppsättningen ``related``, ``html`` och ``plain``, och anger preferensordningen för innehållstypen för den returnerade delen.

source: Start looking for candidate matches with the object on which the ``get_body`` method is called.
sv: Börja leta efter kandidatmatchningar med det objekt som metoden ``get_body`` anropas på.

source: If ``related`` is not included in *preferencelist*, consider the root part (or subpart of the root part) of any related encountered as a candidate if the (sub-)part matches a preference.
sv: Om ``related`` inte ingår i *preferencelist*, betrakta rotdelen (eller underdelen av rotdelen) av alla relaterade som påträffas som en kandidat om (under)delen matchar en preferens.

source: When encountering a ``multipart/related``, check the ``start`` parameter and if a part with a matching :mailheader:`Content-ID` is found, consider only it when looking for candidate matches. Otherwise consider only the first (default root) part of the ``multipart/related``.
sv: När du stöter på en ``multipart/related``, kontrollera ``start`` parametern och om en del med en matchande :mailheader:`Content-ID` hittas, beakta endast den när du letar efter kandidatmatchningar. I annat fall beaktas endast den första (standardrot) delen av ``multipart/related``.

source: If a part has a :mailheader:`Content-Disposition` header, only consider the part a candidate match if the value of the header is ``inline``.
sv: Om en del har ett :mailheader:`Content-Disposition`-huvud, ska delen endast betraktas som en kandidatmatchning om värdet på huvudet är ``inline``.

source: If none of the candidates matches any of the preferences in *preferencelist*, return ``None``.
sv: Om ingen av kandidaterna matchar någon av preferenserna i *preferencelist*, returneras ``None``.

source: Notes: (1) For most applications the only *preferencelist* combinations that really make sense are ``('plain',)``, ``('html', 'plain')``, and the default ``('related', 'html', 'plain')``. (2) Because matching starts with the object on which ``get_body`` is called, calling ``get_body`` on a ``multipart/related`` will return the object itself unless *preferencelist* has a non-default value. (3) Messages (or message parts) that do not specify a :mailheader:`Content-Type` or whose :mailheader:`Content-Type` header is invalid will be treated as if they are of type ``text/plain``, which may occasionally cause ``get_body`` to return unexpected results.
sv: Anmärkningar: (1) För de flesta tillämpningar är de enda *preferencelist*-kombinationerna som verkligen är meningsfulla ``('plain',)``, ``('html', 'plain')`` och standardalternativet ``('related', 'html', 'plain')``. (2) Eftersom matchningen börjar med det objekt som ``get_body`` anropas på, kommer anrop av ``get_body`` på en ``multipart/related`` att returnera själva objektet om inte *preferencelist* har ett annat värde än standardvärdet. (3) Meddelanden (eller meddelandedelar) som inte anger någon :mailheader:`Content-Type` eller vars :mailheader:`Content-Type`-rubrik är ogiltig kommer att behandlas som om de vore av typen ``text/plain``, vilket ibland kan leda till att ``get_body`` ger oväntade resultat.

source: Return an iterator over all of the immediate sub-parts of the message that are not candidate "body" parts. That is, skip the first occurrence of each of ``text/plain``, ``text/html``, ``multipart/related``, or ``multipart/alternative`` (unless they are explicitly marked as attachments via :mailheader:`Content-Disposition: attachment`), and return all remaining parts. When applied directly to a ``multipart/related``, return an iterator over the all the related parts except the root part (ie: the part pointed to by the ``start`` parameter, or the first part if there is no ``start`` parameter or the ``start`` parameter doesn't match the :mailheader:`Content-ID` of any of the parts). When applied directly to a ``multipart/alternative`` or a non-``multipart``, return an empty iterator.
sv: Returnerar en iterator över alla omedelbara underdelar av meddelandet som inte är kandidat-"body"-delar. Det vill säga, hoppa över den första förekomsten av var och en av ``text/plain``, ``text/html``, ``multipart/related``, eller ``multipart/alternative`` (såvida de inte uttryckligen är markerade som bilagor via :mailheader:`Content-Disposition: attachment`), och returnera alla återstående delar. När det tillämpas direkt på en ``multipart/related``, returneras en iterator över alla relaterade delar utom rotdelen (dvs. den del som pekas ut av parametern ``start``, eller den första delen om det inte finns någon parameter ``start`` eller om parametern ``start`` inte matchar :mailheader:`Content-ID` för någon av delarna). När den tillämpas direkt på en ``multipart/alternative`` eller en icke-``multipart``, returneras en tom iterator.

source: Return an iterator over all of the immediate sub-parts of the message, which will be empty for a non-``multipart``. (See also :meth:`~email.message.EmailMessage.walk`.)
sv: Returnerar en iterator över alla omedelbara underdelar av meddelandet, som kommer att vara tom för en icke-``multipart``. (Se även :meth:`~email.message.EmailMessage.walk`.)

source: Call the :meth:`~email.contentmanager.ContentManager.get_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
sv: Anropa metoden :meth:`~email.contentmanager.ContentManager.get_content` för *content_manager*, med self som meddelandeobjekt och eventuella andra argument eller nyckelord som ytterligare argument. Om *content_manager* inte anges, används den ``content_manager`` som anges av den aktuella :mod:`~email.policy`.

source: Call the :meth:`~email.contentmanager.ContentManager.set_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
sv: Anropa metoden :meth:`~email.contentmanager.ContentManager.set_content` för *content_manager*, med self som meddelandeobjekt och eventuella andra argument eller nyckelord som ytterligare argument. Om *content_manager* inte anges, används den ``content_manager`` som anges av den aktuella :mod:`~email.policy`.

source: Convert a non-``multipart`` message into a ``multipart/related`` message, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
sv: Konverterar ett icke-``multipart``meddelande till ett ``multipart/related``meddelande, flyttar alla befintliga :mailheader:`Content-`-rubriker och payload till en (ny) första del av ``multipart``. Om *boundary* anges, använd den som gränssträng i multipart, annars kan gränsen skapas automatiskt när den behövs (t.ex. när meddelandet serialiseras).

source: Convert a non-``multipart`` or a ``multipart/related`` into a ``multipart/alternative``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
sv: Konverterar en icke-``multipart`` eller en ``multipart/related`` till en ``multipart/alternative``, flyttar alla befintliga :mailheader:`Content-`-rubriker och nyttolast till en (ny) första del av ``multipart``. Om *boundary* anges, använd den som gränssträng i multipart, annars kan gränsen skapas automatiskt när den behövs (t.ex. när meddelandet serialiseras).

source: Convert a non-``multipart``, a ``multipart/related``, or a ``multipart-alternative`` into a ``multipart/mixed``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
sv: Konverterar en icke-``multipart``, en ``multipart/related``, eller en ``multipart-alternative`` till en ``multipart/mixed``, flyttar alla befintliga :mailheader:`Content-`-rubriker och payload till en (ny) första del av ``multipart``. Om *boundary* anges, används den som gränssträng i multipart, annars lämnas gränsen för att skapas automatiskt när den behövs (till exempel när meddelandet serialiseras).

source: If the message is a ``multipart/related``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, call :meth:`make_related` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``inline``.
sv: Om meddelandet är ett ``multipart/related``, skapa ett nytt meddelandeobjekt, skicka alla argument till dess :meth:`set_content`-metod och :meth:`~email.message.Message.attach` det till ``multipart``. Om meddelandet är en icke-``multipart``, anropa :meth:`make_related` och fortsätt sedan enligt ovan. Om meddelandet är någon annan typ av ``multipart``, utlöses ett :exc:`TypeError`. Om *content_manager* inte anges, används den ``content_manager`` som anges av den aktuella :mod:`~email.policy`. Om den tillagda delen inte har någon :mailheader:`Content-Disposition` header, lägg till en med värdet ``inline``.
