Repository: yeager/python-docs-sv
Catalog: library/email.policy.po
Languages: sv

source: :mod:`!email.policy`: Policy Objects
sv: :mod:`!email.policy`: Policy-objekt

source: **Source code:** :source:`Lib/email/policy.py`
sv: **Källkod:** :source:`Lib/email/policy.py`

source: The :mod:`email` package's prime focus is the handling of email messages as described by the various email and MIME RFCs. However, the general format of email messages (a block of header fields each consisting of a name followed by a colon followed by a value, the whole block followed by a blank line and an arbitrary 'body'), is a format that has found utility outside of the realm of email. Some of these uses conform fairly closely to the main email RFCs, some do not. Even when working with email, there are times when it is desirable to break strict compliance with the RFCs, such as generating emails that interoperate with email servers that do not themselves follow the standards, or that implement extensions you want to use in ways that violate the standards.
sv: Paketet :mod:`email` fokuserar i första hand på hanteringen av e-postmeddelanden enligt beskrivningen i de olika RFC:erna för e-post och MIME. Det allmänna formatet för e-postmeddelanden (ett block med rubrikfält som vart och ett består av ett namn följt av ett kolon följt av ett värde, hela blocket följt av en blankrad och en godtycklig "body") är dock ett format som har hittat användningsområden utanför e-postområdet. Vissa av dessa användningsområden överensstämmer ganska nära med de viktigaste RFC:erna för e-post, andra inte. Även när man arbetar med e-post finns det tillfällen då det är önskvärt att inte strikt följa RFC:erna, till exempel för att generera e-postmeddelanden som fungerar tillsammans med e-postservrar som inte själva följer standarderna, eller som implementerar tillägg som du vill använda på sätt som bryter mot standarderna.

source: Policy objects give the email package the flexibility to handle all these disparate use cases.
sv: Policyobjekt ger e-postpaketet den flexibilitet som krävs för att hantera alla dessa olika användningsområden.

source: A :class:`Policy` object encapsulates a set of attributes and methods that control the behavior of various components of the email package during use. :class:`Policy` instances can be passed to various classes and methods in the email package to alter the default behavior. The settable values and their defaults are described below.
sv: Ett :class:`Policy`-objekt kapslar in en uppsättning attribut och metoder som styr beteendet hos olika komponenter i e-postpaketet under användning. :class:`Policy`-instanser kan skickas till olika klasser och metoder i e-postpaketet för att ändra standardbeteendet. De inställbara värdena och deras standardvärden beskrivs nedan.

source: There is a default policy used by all classes in the email package. For all of the :mod:`~email.parser` classes and the related convenience functions, and for the :class:`~email.message.Message` class, this is the :class:`Compat32` policy, via its corresponding pre-defined instance :const:`compat32`. This policy provides for complete backward compatibility (in some cases, including bug compatibility) with the pre-Python3.3 version of the email package.
sv: Det finns en standardpolicy som används av alla klasser i e-postpaketet. För alla :mod:`~email.parser`-klasserna och de relaterade bekvämlighetsfunktionerna, och för :class:`~email.message.Message`-klassen, är detta :class:`Compat32`-policyn, via dess motsvarande fördefinierade instans :const:`compat32`. Denna policy ger fullständig bakåtkompatibilitet (i vissa fall, inklusive buggkompatibilitet) med versionen av e-postpaketet före Python3.3.

source: This default value for the *policy* keyword to :class:`~email.message.EmailMessage` is the :class:`EmailPolicy` policy, via its pre-defined instance :data:`~default`.
sv: Detta standardvärde för nyckelordet *policy* till :class:`~email.message.EmailMessage` är policyn :class:`EmailPolicy`, via dess fördefinierade instans :data:`~default`.

source: When a :class:`~email.message.Message` or :class:`~email.message.EmailMessage` object is created, it acquires a policy. If the message is created by a :mod:`~email.parser`, a policy passed to the parser will be the policy used by the message it creates. If the message is created by the program, then the policy can be specified when it is created. When a message is passed to a :mod:`~email.generator`, the generator uses the policy from the message by default, but you can also pass a specific policy to the generator that will override the one stored on the message object.
sv: När ett :class:`~email.message.Message` eller :class:`~email.message.EmailMessage`-objekt skapas får det en policy. Om meddelandet skapas av en :mod:`~email.parser`, kommer en policy som skickas till parsern att vara den policy som används av det meddelande som den skapar. Om meddelandet skapas av programmet kan policyn anges när det skapas. När ett meddelande skickas till en :mod:`~email.generator` använder generatorn som standard policyn från meddelandet, men du kan också skicka en specifik policy till generatorn som åsidosätter den som finns lagrad på meddelandeobjektet.

source: The default value for the *policy* keyword for the :mod:`email.parser` classes and the parser convenience functions **will be changing** in a future version of Python. Therefore you should **always specify explicitly which policy you want to use** when calling any of the classes and functions described in the :mod:`~email.parser` module.
sv: Standardvärdet för nyckelordet *policy* för :mod:`email.parser'-klasserna och parserns bekvämlighetsfunktioner **kommer att ändras** i en framtida version av Python. Därför bör du **alltid uttryckligen ange vilken policy du vill använda** när du anropar någon av de klasser och funktioner som beskrivs i modulen :mod:`~email.parser`.

source: The first part of this documentation covers the features of :class:`Policy`, an :term:`abstract base class` that defines the features that are common to all policy objects, including :const:`compat32`. This includes certain hook methods that are called internally by the email package, which a custom policy could override to obtain different behavior. The second part describes the concrete classes :class:`EmailPolicy` and :class:`Compat32`, which implement the hooks that provide the standard behavior and the backward compatible behavior and features, respectively.
sv: Den första delen av denna dokumentation täcker funktionerna i :class:`Policy`, en :term:`abstrakt basklass` som definierar de funktioner som är gemensamma för alla policyobjekt, inklusive :const:`compat32`. Detta inkluderar vissa hook-metoder som anropas internt av e-postpaketet, som en anpassad policy kan åsidosätta för att få ett annat beteende. I den andra delen beskrivs de konkreta klasserna :class:`EmailPolicy` och :class:`Compat32`, som implementerar de krokar som ger standardbeteendet respektive det bakåtkompatibla beteendet och funktionerna.

source: :class:`Policy` instances are immutable, but they can be cloned, accepting the same keyword arguments as the class constructor and returning a new :class:`Policy` instance that is a copy of the original but with the specified attributes values changed.
sv: :class:`Policy`-instanser är oföränderliga, men de kan klonas genom att acceptera samma nyckelordsargument som klasskonstruktören och returnera en ny :class:`Policy`-instans som är en kopia av originalet men med de angivna attributvärdena ändrade.

source: As an example, the following code could be used to read an email message from a file on disk and pass it to the system ``sendmail`` program on a Unix system:
sv: Exempelvis kan följande kod användas för att läsa ett e-postmeddelande från en fil på disken och skicka det till systemets ``endmail``-program på ett Unix-system:

source: Here we are telling :class:`~email.generator.BytesGenerator` to use the RFC correct line separator characters when creating the binary string to feed into ``sendmail's`` ``stdin``, where the default policy would use ``\n`` line separators.
sv: Här säger vi till :class:`~email.generator.BytesGenerator` att använda de RFC-korrekta radavskiljartecknen när vi skapar den binära strängen som ska matas in i ``sendmails`` ``stdin``, där standardpolicyn skulle använda ``n`` radavskiljare.

source: Some email package methods accept a *policy* keyword argument, allowing the policy to be overridden for that method. For example, the following code uses the :meth:`~email.message.Message.as_bytes` method of the *msg* object from the previous example and writes the message to a file using the native line separators for the platform on which it is running::
sv: Vissa metoder i e-postpaketet accepterar ett *policy*-nyckelordsargument, vilket gör att policyn kan åsidosättas för den metoden. Följande kod använder t.ex. metoden :meth:`~email.message.Message.as_bytes` för objektet *msg* från föregående exempel och skriver meddelandet till en fil med de inbyggda radavgränsarna för den plattform som koden körs på::

source: Policy objects can also be combined using the addition operator, producing a policy object whose settings are a combination of the non-default values of the summed objects::
sv: Policyobjekt kan också kombineras med hjälp av additionsoperatorn, vilket ger ett policyobjekt vars inställningar är en kombination av icke-standardvärdena för de summerade objekten::

source: This operation is not commutative; that is, the order in which the objects are added matters. To illustrate::
sv: Denna operation är inte kommutativ, det vill säga att ordningen i vilken objekten läggs till spelar roll. För att illustrera::

source: This is the :term:`abstract base class` for all policy classes. It provides default implementations for a couple of trivial methods, as well as the implementation of the immutability property, the :meth:`clone` method, and the constructor semantics.
sv: Detta är :term:`abstrakt basklass` för alla policyklasser. Den tillhandahåller standardimplementeringar för ett par triviala metoder, samt implementeringen av egenskapen oföränderlighet, metoden :meth:`clone` och konstruktörsemantik.

source: The constructor of a policy class can be passed various keyword arguments. The arguments that may be specified are any non-method properties on this class, plus any additional non-method properties on the concrete class. A value specified in the constructor will override the default value for the corresponding attribute.
sv: Konstruktören för en policyklass kan ges olika nyckelordsargument. De argument som kan anges är alla icke-metodegenskaper för denna klass, plus eventuella ytterligare icke-metodegenskaper för den konkreta klassen. Ett värde som anges i konstruktören åsidosätter standardvärdet för motsvarande attribut.

source: This class defines the following properties, and thus values for the following may be passed in the constructor of any policy class:
sv: Denna klass definierar följande egenskaper, och värden för följande kan därför anges i konstruktorn för vilken policyklass som helst:

source: The maximum length of any line in the serialized output, not counting the end of line character(s). Default is 78, per :rfc:`5322`. A value of ``0`` or :const:`None` indicates that no line wrapping should be done at all.
sv: Den maximala längden på en rad i den serialiserade utdata, utan att räkna med radslutstecken. Standardvärdet är 78, enligt :rfc:`5322`. Ett värde på ``0`` eller :const:`None` anger att ingen radbrytning skall göras alls.

source: The string to be used to terminate lines in serialized output. The default is ``\n`` because that's the internal end-of-line discipline used by Python, though ``\r\n`` is required by the RFCs.
sv: Den sträng som ska användas för att avsluta rader i serialiserad utdata. Standardvärdet är ``\n`` eftersom det är den interna radavslutningsdisciplinen som används av Python, men ``\r\n`` krävs enligt RFC.

source: Controls the type of Content Transfer Encodings that may be or are required to be used. The possible values are:
sv: Styr vilken typ av innehållsöverföringskodningar som kan användas eller måste användas. De möjliga värdena är:

source: all data must be "7 bit clean" (ASCII-only). This means that where necessary data will be encoded using either quoted-printable or base64 encoding.
sv: all data måste vara "7 bit clean" (endast ASCII). Detta innebär att data vid behov kommer att kodas med antingen quoted-printable eller base64-kodning.

source: data is not constrained to be 7 bit clean. Data in headers is still required to be ASCII-only and so will be encoded (see :meth:`fold_binary` and :attr:`~EmailPolicy.utf8` below for exceptions), but body parts may use the ``8bit`` CTE.
sv: data är inte begränsad till att vara 7 bitars ren. Data i rubriker måste fortfarande vara ASCII-only och kommer därför att kodas (se :meth:`fold_binary` och :attr:`~EmailPolicy.utf8` nedan för undantag), men kroppsdelar kan använda ``8bit`` CTE.

source: A ``cte_type`` value of ``8bit`` only works with ``BytesGenerator``, not ``Generator``, because strings cannot contain binary data. If a ``Generator`` is operating under a policy that specifies ``cte_type=8bit``, it will act as if ``cte_type`` is ``7bit``.
sv: Ett ``cte_type``-värde på ``8bit`` fungerar bara med ``BytesGenerator``, inte med ``Generator``, eftersom strängar inte kan innehålla binära data. Om en ``Generator`` arbetar under en policy som anger ``cte_type=8bit``, kommer den att fungera som om ``cte_type`` är ``7bit``.

source: If :const:`True`, any defects encountered will be raised as errors. If :const:`False` (the default), defects will be passed to the :meth:`register_defect` method.
sv: Om :const:`True`, kommer alla defekter som påträffas att tas upp som fel. Om :const:`False` (standard), kommer defekter att skickas till metoden :meth:`register_defect`.

source: If :const:`True`, lines starting with *"From "* in the body are escaped by putting a ``>`` in front of them. This parameter is used when the message is being serialized by a generator. Default: :const:`False`.
sv: Om :const:`True`, undviks rader som börjar med *"From"* i brödtexten genom att sätta en ``>`` framför dem. Denna parameter används när meddelandet serialiseras av en generator. Standard: :const:`False`.

source: A factory function for constructing a new empty message object. Used by the parser when building messages. Defaults to ``None``, in which case :class:`~email.message.Message` is used.
sv: En fabriksfunktion för att konstruera ett nytt tomt meddelandeobjekt. Används av parsern när meddelanden byggs. Standardvärdet är ``None``, i vilket fall :class:`~email.message.Message` används.

source: If ``True`` (the default), the generator will raise :exc:`~email.errors.HeaderWriteError` instead of writing a header that is improperly folded or delimited, such that it would be parsed as multiple headers or joined with adjacent data. Such headers can be generated by custom header classes or bugs in the ``email`` module.
sv: Om ``True`` (standard), genererar generatorn :exc:`~email.errors.HeaderWriteError` istället för att skriva en header som är felaktigt vikt eller avgränsad, så att den skulle analyseras som flera headers eller sammanfogas med angränsande data. Sådana rubriker kan genereras av anpassade rubrikklasser eller buggar i modulen ``email``.

source: As it's a security feature, this defaults to ``True`` even in the :class:`~email.policy.Compat32` policy. For backwards compatible, but unsafe, behavior, it must be set to ``False`` explicitly.
sv: Eftersom det är en säkerhetsfunktion är standardvärdet ``True`` även i policyn :class:`~email.policy.Compat32`. För bakåtkompatibelt, men osäkert, beteende måste det uttryckligen sättas till ``False``.

source: The following :class:`Policy` method is intended to be called by code using the email library to create policy instances with custom settings:
sv: Följande :class:`Policy`-metod är avsedd att anropas av kod som använder e-postbiblioteket för att skapa policyinstanser med anpassade inställningar:

source: Return a new :class:`Policy` instance whose attributes have the same values as the current instance, except where those attributes are given new values by the keyword arguments.
sv: Returnerar en ny :class:`Policy`-instans vars attribut har samma värden som den aktuella instansen, utom när dessa attribut ges nya värden av nyckelordsargumenten.

source: The remaining :class:`Policy` methods are called by the email package code, and are not intended to be called by an application using the email package. A custom policy must implement all of these methods.
sv: De återstående :class:`Policy`-metoderna anropas av koden för e-postpaketet och är inte avsedda att anropas av ett program som använder e-postpaketet. En anpassad policy måste implementera alla dessa metoder.

source: Handle a *defect* found on *obj*. When the email package calls this method, *defect* will always be a subclass of :class:`~email.errors.MessageDefect`.
sv: Hantera en *defekt* som hittats på *obj*. När e-postpaketet anropar den här metoden kommer *defect* alltid att vara en underklass till :class:`~email.errors.MessageDefect`.

source: The default implementation checks the :attr:`raise_on_defect` flag. If it is ``True``, *defect* is raised as an exception. If it is ``False`` (the default), *obj* and *defect* are passed to :meth:`register_defect`.
sv: Standardimplementeringen kontrollerar flaggan :attr:`raise_on_defect`. Om den är ``True``, tas *defect* upp som ett undantag. Om den är ``False`` (standard), skickas *obj* och *defect* till :meth:`register_defect`.

source: Register a *defect* on *obj*. In the email package, *defect* will always be a subclass of :class:`~email.errors.MessageDefect`.
sv: Registrera en *defekt* på *obj*. I e-postpaketet kommer *defect* alltid att vara en underklass till :class:`~email.errors.MessageDefect`.

source: The default implementation calls the ``append`` method of the ``defects`` attribute of *obj*. When the email package calls :attr:`handle_defect`, *obj* will normally have a ``defects`` attribute that has an ``append`` method. Custom object types used with the email package (for example, custom ``Message`` objects) should also provide such an attribute, otherwise defects in parsed messages will raise unexpected errors.
sv: Standardimplementeringen anropar metoden ``append`` i attributet ``defects`` i *obj*. När e-postpaketet anropar :attr:`handle_defect` kommer *obj* normalt att ha ett ``defects``-attribut som har en ``append``-metod. Anpassade objekttyper som används med e-postpaketet (t.ex. anpassade ``Message``-objekt) bör också ha ett sådant attribut, annars kommer defekter i analyserade meddelanden att ge upphov till oväntade fel.

source: Return the maximum allowed number of headers named *name*.
sv: Returnera det högsta tillåtna antalet rubriker med namnet *namn*.

source: Called when a header is added to an :class:`~email.message.EmailMessage` or :class:`~email.message.Message` object. If the returned value is not ``0`` or ``None``, and there are already a number of headers with the name *name* greater than or equal to the value returned, a :exc:`ValueError` is raised.
sv: Anropas när en header läggs till i ett :class:`~email.message.EmailMessage`- eller :class:`~email.message.Message`-objekt. Om det returnerade värdet inte är ``0`` eller ``None``, och det redan finns ett antal headers med namnet *name* som är större än eller lika med det returnerade värdet, skapas ett :exc:`ValueError`.

source: Because the default behavior of ``Message.__setitem__`` is to append the value to the list of headers, it is easy to create duplicate headers without realizing it. This method allows certain headers to be limited in the number of instances of that header that may be added to a ``Message`` programmatically. (The limit is not observed by the parser, which will faithfully produce as many headers as exist in the message being parsed.)
sv: Eftersom standardbeteendet för ``Message.__setitem__`` är att lägga till värdet i listan över headers är det lätt att skapa duplicerade headers utan att inse det. Med den här metoden kan vissa rubriker begränsas i antalet instanser av rubriken som kan läggas till i ett ``Message`` programmatiskt. (Begränsningen observeras inte av parsern, som troget kommer att producera så många rubriker som finns i meddelandet som parsas)

source: The default implementation returns ``None`` for all header names.
sv: Standardimplementeringen returnerar ``None`` för alla header-namn.

source: The email package calls this method with a list of strings, each string ending with the line separation characters found in the source being parsed. The first line includes the field header name and separator. All whitespace in the source is preserved. The method should return the ``(name, value)`` tuple that is to be stored in the ``Message`` to represent the parsed header.
sv: E-postpaketet anropar den här metoden med en lista över strängar, där varje sträng slutar med de radavgränsningstecken som finns i källan som analyseras. Den första raden innehåller namnet på fälthuvudet och separatorn. Alla blanksteg i källan bevaras. Metoden ska returnera tupeln ``(namn, värde)`` som ska lagras i ``Message`` för att representera det analyserade sidhuvudet.

source: If an implementation wishes to retain compatibility with the existing email package policies, *name* should be the case preserved name (all characters up to the '``:``' separator), while *value* should be the unfolded value (all line separator characters removed, but whitespace kept intact), stripped of leading whitespace.
sv: Om en implementering vill behålla kompatibiliteten med de befintliga policyerna för e-postpaket, ska *name* vara namnet med bevarad skiftlägesanalys (alla tecken fram till separatorn "``:``"), medan *value* ska vara det utvikta värdet (alla radavgränsningstecken borttagna, men blanksteg intakta), utan inledande blanksteg.

source: *sourcelines* may contain surrogateescaped binary data.
sv: *sourcelines* kan innehålla surrogatkapslade binära data.

source: There is no default implementation
sv: Det finns ingen standardimplementering

source: The email package calls this method with the name and value provided by the application program when the application program is modifying a ``Message`` programmatically (as opposed to a ``Message`` created by a parser). The method should return the ``(name, value)`` tuple that is to be stored in the ``Message`` to represent the header.
sv: E-postpaketet anropar den här metoden med det namn och värde som tillhandahålls av tillämpningsprogrammet när tillämpningsprogrammet ändrar ett ``Message`` programmatiskt (i motsats till ett ``Message`` som skapats av en parser). Metoden bör returnera den tupel ``(namn, värde)`` som skall lagras i ``Message`` för att representera rubriken.

source: If an implementation wishes to retain compatibility with the existing email package policies, the *name* and *value* should be strings or string subclasses that do not change the content of the passed in arguments.
sv: Om en implementering vill behålla kompatibiliteten med de befintliga policyerna för e-postpaket bör *name* och *value* vara strängar eller subklasser av strängar som inte ändrar innehållet i de argument som skickas in.
