Repository: yeager/python-docs-sv
Catalog: library/email.message.po
Languages: sv

source: :mod:`!email.message`: Representing an email message
sv: :mod:`!email.message`: Representerar ett e-postmeddelande

source: **Source code:** :source:`Lib/email/message.py`
sv: **Källkod:** :source:`Lib/email/message.py`

source: The central class in the :mod:`email` package is the :class:`EmailMessage` class, imported from the :mod:`email.message` module. It is the base class for the :mod:`email` object model. :class:`EmailMessage` provides the core functionality for setting and querying header fields, for accessing message bodies, and for creating or modifying structured messages.
sv: Den centrala klassen i paketet :mod:`email` är klassen :class:`EmailMessage`, som importeras från modulen :mod:`email.message`. Det är basklassen för objektmodellen :mod:`email`. :class:`EmailMessage` tillhandahåller kärnfunktionaliteten för att ställa in och fråga efter rubrikfält, för att komma åt meddelandekroppar och för att skapa eller ändra strukturerade meddelanden.

source: An email message consists of *headers* and a *payload* (which is also referred to as the *content*). Headers are :rfc:`5322` or :rfc:`6532` style field names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
sv: Ett e-postmeddelande består av *headers* och en *payload* (som också kallas för *content*). Headers är fältnamn och värden i stil med :rfc:`5322` eller :rfc:`6532`, där fältnamnet och värdet separeras med ett kolon. Kolonet är inte en del av vare sig fältnamnet eller fältvärdet. Nyttolasten kan vara ett enkelt textmeddelande, ett binärt objekt eller en strukturerad sekvens av undermeddelanden, vart och ett med sin egen uppsättning rubriker och sin egen nyttolast. Den senare typen av nyttolast indikeras av att meddelandet har en MIME-typ som :mimetype:`multipart/\*` eller :mimetype:`message/rfc822`.

source: The conceptual model provided by an :class:`EmailMessage` object is that of an ordered dictionary of headers coupled with a *payload* that represents the :rfc:`5322` body of the message, which might be a list of sub-``EmailMessage`` objects. In addition to the normal dictionary methods for accessing the header names and values, there are methods for accessing specialized information from the headers (for example the MIME content type), for operating on the payload, for generating a serialized version of the message, and for recursively walking over the object tree.
sv: Den konceptuella modell som tillhandahålls av ett :class:`EmailMessage`-objekt är en ordnad ordbok med rubriker kopplad till en *payload* som representerar :rfc:`5322`-meddelandets kropp, som kan vara en lista över under-`EmailMessage``-objekt. Förutom de vanliga ordboksmetoderna för att komma åt namn och värden på rubrikerna finns det metoder för att komma åt specialiserad information från rubrikerna (t.ex. MIME-innehållstypen), för att arbeta med nyttolasten, för att generera en serialiserad version av meddelandet och för att rekursivt gå igenom objektträdet.

source: The :class:`EmailMessage` dictionary-like interface is indexed by the header names, which must be ASCII values. The values of the dictionary are strings with some extra methods. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. The keys are ordered, but unlike a real dict, there can be duplicates. Additional methods are provided for working with headers that have duplicate keys.
sv: Det ordboksliknande gränssnittet :class:`EmailMessage` indexeras av headernamnen, som måste vara ASCII-värden. Värdena i ordboken är strängar med några extra metoder. Headers lagras och returneras i skiftlägesbevarande form, men fältnamn matchas skiftlägesokänsligt. Nycklarna är ordnade, men till skillnad från en riktig dict kan det finnas dubbletter. Ytterligare metoder tillhandahålls för att arbeta med rubriker som har dubbla nycklar.

source: The *payload* is either a string or bytes object, in the case of simple message objects, or a list of :class:`EmailMessage` objects, for MIME container documents such as :mimetype:`multipart/\*` and :mimetype:`message/rfc822` message objects.
sv: *payload* är antingen en sträng eller ett bytesobjekt, när det gäller enkla meddelandeobjekt, eller en lista med :class:`EmailMessage`-objekt, för MIME-containerdokument som :mimetype:`multipart/\*` och :mimetype:`message/rfc822`-meddelandeobjekt.

source: If *policy* is specified use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`~email.policy.default` policy, which follows the rules of the email RFCs except for line endings (instead of the RFC mandated ``\r\n``, it uses the Python standard ``\n`` line endings). For more information see the :mod:`~email.policy` documentation.
sv: Om *policy* anges används de regler som anges i policyn för att uppdatera och serialisera representationen av meddelandet. Om *policy* inte anges används :class:`~email.policy.default`-policyn, som följer reglerna i RFC för e-post utom för radavslutningar (istället för RFC-mandatet ``\r\n`` används Python-standarden ``\n`` för radavslutningar). För mer information se :mod:`~email.policy`-dokumentationen.

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility with the base :class:`~email.message.Message` class *maxheaderlen* is accepted, but defaults to ``None``, which means that by default the line length is controlled by the :attr:`~email.policy.Policy.max_line_length` of the policy. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.Generator`.
sv: Returnerar hela meddelandet plattat som en sträng. När det valfria *unixfrom* är true inkluderas kuvertrubriken i den returnerade strängen. *unixfrom* är som standard ``False``. För bakåtkompatibilitet med basklassen :class:`~email.message.Message` accepteras *maxheaderlen*, men standardvärdet är ``None``, vilket innebär att radlängden som standard styrs av policyns :attr:`~email.policy.Policy.max_line_length`. Argumentet *policy* kan användas för att åsidosätta den standardpolicy som hämtas från meddelandeinstansen. Detta kan användas för att styra en del av den formatering som produceras av metoden, eftersom den angivna *policy* kommer att skickas till :class:`~email.generator.Generator`.

source: Flattening the message may trigger changes to the :class:`EmailMessage` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
sv: Att göra meddelandet plattare kan leda till ändringar i :class:`EmailMessage` om standardvärden måste fyllas i för att slutföra omvandlingen till en sträng (till exempel kan MIME-gränser genereras eller ändras).

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.Generator` for a more flexible API for serializing messages. Note also that this method is restricted to producing messages serialized as "7 bit clean" when :attr:`~email.policy.EmailPolicy.utf8` is ``False``, which is the default.
sv: Observera att den här metoden tillhandahålls som en bekvämlighet och kanske inte är det mest användbara sättet att serialisera meddelanden i din applikation, särskilt om du hanterar flera meddelanden. Se :class:`email.generator.Generator` för ett mer flexibelt API för serialisering av meddelanden. Observera också att denna metod är begränsad till att producera meddelanden serialiserade som "7 bit clean" när :attr:`~email.policy.EmailPolicy.utf8` är ``False``, vilket är standard.

source: the default behavior when *maxheaderlen* is not specified was changed from defaulting to 0 to defaulting to the value of *max_line_length* from the policy.
sv: standardbeteendet när *maxheaderlen* inte anges ändrades från standardvärdet 0 till standardvärdet *max_line_length* från policyn.

source: Equivalent to ``as_string(policy=self.policy.clone(utf8=True))``. Allows ``str(msg)`` to produce a string containing the serialized message in a readable format.
sv: Motsvarar ``as_string(policy=self.policy.clone(utf8=True))``. Tillåter ``str(msg)`` att producera en sträng som innehåller det serialiserade meddelandet i ett läsbart format.

source: the method was changed to use ``utf8=True``, thus producing an :rfc:`6531`-like message representation, instead of being a direct alias for :meth:`as_string`.
sv: metoden ändrades så att den använder ``utf8=True``, vilket ger en :rfc:`6531`-liknande meddelanderepresentation, istället för att vara ett direkt alias för :meth:`as_string`.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.BytesGenerator`.
sv: Returnerar hela meddelandet plattat som ett bytesobjekt. När det valfria *unixfrom* är true inkluderas kuvertrubriken i den returnerade strängen. *unixfrom* är som standard ``False``. Argumentet *policy* kan användas för att åsidosätta den standardpolicy som hämtas från meddelandeinstansen. Detta kan användas för att kontrollera en del av formateringen som produceras av metoden, eftersom den angivna *policyn* kommer att skickas till :class:`~email.generator.BytesGenerator`.

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.BytesGenerator` for a more flexible API for serializing messages.
sv: Observera att denna metod tillhandahålls som en bekvämlighet och kanske inte är det mest användbara sättet att serialisera meddelanden i din applikation, särskilt om du hanterar flera meddelanden. Se :class:`email.generator.BytesGenerator` för ett mer flexibelt API för serialisering av meddelanden.

source: Equivalent to :meth:`.as_bytes`. Allows ``bytes(msg)`` to produce a bytes object containing the serialized message.
sv: Motsvarar :meth:`.as_bytes`. Tillåter ``bytes(msg)`` att producera ett bytes-objekt som innehåller det serialiserade meddelandet.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`EmailMessage` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`EmailMessage` is of type ``message/rfc822``.
sv: Returnerar ``True`` om meddelandets nyttolast är en lista med sub-objekt av :class:`EmailMessage`, annars returneras ``False``. När :meth:`is_multipart` returnerar ``False``, bör nyttolasten vara ett strängobjekt (som kan vara en CTE-kodad binär nyttolast). Observera att om :meth:`is_multipart` returnerar ``True`` betyder det inte nödvändigtvis att "msg.get_content_maintype() == 'multipart'" kommer att returnera ``True``. Till exempel kommer ``is_multipart`` att returnera ``True`` när :class:`EmailMessage` är av typen ``message/rfc822``.

source: Set the message's envelope header to *unixfrom*, which should be a string. (See :class:`~mailbox.mboxMessage` for a brief description of this header.)
sv: Ställer in meddelandets kuverthuvud till *unixfrom*, som ska vara en sträng. (Se :class:`~mailbox.mboxMessage` för en kort beskrivning av detta huvud)

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
sv: Returnerar meddelandets kuverthuvud. Standardvärdet är ``None`` om kuverthuvudet aldrig har angetts.

source: The following methods implement the mapping-like interface for accessing the message's headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in an :class:`EmailMessage` object, headers are always returned in the order they appeared in the original message, or in which they were added to the message later. Any header deleted and then re-added is always appended to the end of the header list.
sv: Följande metoder implementerar det mappningsliknande gränssnittet för åtkomst till meddelandets rubriker. Observera att det finns vissa semantiska skillnader mellan dessa metoder och ett normalt mappningsgränssnitt (dvs. ett dictionary-gränssnitt). I en dictionary finns det t.ex. inga duplicerade nycklar, men här kan det finnas duplicerade meddelandehuvuden. I ordböcker finns det inte heller någon garanterad ordning på de nycklar som returneras av :meth:`keys`, men i ett :class:`EmailMessage`-objekt returneras alltid rubrikerna i den ordning de förekom i det ursprungliga meddelandet eller i den ordning de senare lades till i meddelandet. En header som tagits bort och sedan lagts till igen läggs alltid till i slutet av headerlistan.

source: These semantic differences are intentional and are biased toward convenience in the most common use cases.
sv: Dessa semantiska skillnader är avsiktliga och syftar till att underlätta i de vanligaste användningsfallen.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
sv: Observera att i samtliga fall ingår inte eventuella kuvertrubriker som finns i meddelandet i mappningsgränssnittet.

source: Return the total number of headers, including duplicates.
sv: Returnerar det totala antalet headers, inklusive dubbletter.

source: Return ``True`` if the message object has a field named *name*. Matching is done without regard to case and *name* does not include the trailing colon. Used for the ``in`` operator. For example::
sv: Returnerar ``True`` om meddelandeobjektet har ett fält med namnet *name*. Matchning sker utan hänsyn till skiftlägesskillnader och *namn* innehåller inte efterföljande kolon. Används för operatorn ``in``. Till exempel::

source: Return the value of the named header field. *name* does not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
sv: Returnerar värdet för det namngivna rubrikfältet. *name* inkluderar inte fältseparatorn kolon. Om rubrikfältet saknas returneras ``None``; ett :exc:`KeyError` genereras aldrig.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant headers named *name*.
sv: Observera att om det namngivna fältet förekommer mer än en gång i meddelandets rubriker, är det odefinierat exakt vilket av dessa fältvärden som kommer att returneras. Använd metoden :meth:`get_all` för att hämta värdena för alla befintliga rubriker med namnet *namn*.

source: Using the standard (non-``compat32``) policies, the returned value is an instance of a subclass of :class:`email.headerregistry.BaseHeader`.
sv: Med standardprinciperna (icke-``compat32``) är det returnerade värdet en instans av en underklass till :class:`email.headerregistry.BaseHeader`.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing headers.
sv: Lägg till en rubrik i meddelandet med fältnamnet *name* och värdet *val*. Fältet läggs till i slutet av meddelandets befintliga rubriker.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
sv: Observera att detta *inte* skriver över eller raderar någon befintlig header med samma namn. Om du vill vara säker på att det nya sidhuvudet är det enda som finns i meddelandet med fältnamnet *namn*, raderar du fältet först, t.ex.::

source: If the :mod:`policy <email.policy>` defines certain headers to be unique (as the standard policies do), this method may raise a :exc:`ValueError` when an attempt is made to assign a value to such a header when one already exists. This behavior is intentional for consistency's sake, but do not depend on it as we may choose to make such assignments do an automatic deletion of the existing header in the future.
sv: Om :mod:`policy <email.policy>` definierar att vissa rubriker ska vara unika (som standardpolicyerna gör), kan den här metoden ge upphov till ett :exc:`ValueError` när ett försök görs att tilldela ett värde till en sådan rubrik när det redan finns ett. Detta beteende är avsiktligt för konsekvensens skull, men var inte beroende av det eftersom vi kan välja att göra sådana tilldelningar till en automatisk radering av den befintliga rubriken i framtiden.

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
sv: Ta bort alla förekomster av fältet med namnet *namn* från meddelandets rubriker. Inget undantag görs om det namngivna fältet inte finns med i sidhuvudet.

source: Return a list of all the message's header field names.
sv: Returnerar en lista med alla namn på fält i meddelandets header.

source: Return a list of all the message's field values.
sv: Returnerar en lista med alla fältvärden i meddelandet.

source: Return a list of 2-tuples containing all the message's field headers and values.
sv: Returnerar en lista med 2-tuples som innehåller alla meddelandets fältrubriker och värden.

source: Return the value of the named header field. This is identical to :meth:`~object.__getitem__` except that optional *failobj* is returned if the named header is missing (*failobj* defaults to ``None``).
sv: Returnerar värdet för det namngivna rubrikfältet. Detta är identiskt med :meth:`~object.__getitem__` förutom att den valfria *failobj* returneras om det namngivna huvudfältet saknas (*failobj* är som standard ``None``).

source: Here are some additional useful header related methods:
sv: Här är några ytterligare användbara metoder för header:

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
sv: Returnerar en lista med alla värden för fältet med namnet *name*. Om det inte finns några sådana namngivna rubriker i meddelandet returneras *failobj* (standardvärde är ``None``).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
sv: Utökad inställning av sidhuvud. Den här metoden liknar :meth:`__setitem__` förutom att ytterligare rubrikparametrar kan anges som nyckelordsargument. *_name* är rubrikfältet som ska läggas till och *_value* är det *primära* värdet för rubriken.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added.
sv: För varje objekt i nyckelordets argumentordbok *_params* tas nyckeln som parameternamn, med understrykningar konverterade till bindestreck (eftersom bindestreck är olagliga i Python-identifierare). Normalt kommer parametern att läggas till som ``key="value"`` om inte värdet är ``None``, i vilket fall endast nyckeln kommer att läggas till.

source: If the value contains non-ASCII characters, the charset and language may be explicitly controlled by specifying the value as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
sv: Om värdet innehåller icke-ASCII-tecken kan teckenuppsättningen och språket styras explicit genom att ange värdet som en tredelad tupel i formatet ``(CHARSET, LANGUAGE, VALUE)``, där ``CHARSET`` är en sträng som namnger den teckenuppsättning som ska användas för att koda värdet, ``LANGUAGE`` kan vanligtvis sättas till ``None`` eller den tomma strängen (se :rfc:`2231` för andra möjligheter), och ``VALUE`` är strängvärdet som innehåller icke-ASCII-kodpunkter. Om en tupel med tre inte skickas och värdet innehåller icke-ASCII-tecken, kodas det automatiskt i :rfc:`2231`-format med ``CHARSET`` ``utf-8`` och ``LANGUAGE`` ``None``.

source: Here is an example::
sv: Här är ett exempel::

source: This will add a header that looks like ::
sv: Detta kommer att lägga till en rubrik som ser ut som ::

source: An example of the extended interface with non-ASCII characters::
sv: Ett exempel på det utökade gränssnittet med icke-ASCII-tecken::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case of the original header. If no matching header is found, raise a :exc:`KeyError`.
sv: Ersätt ett huvud. Ersätt den första headern som hittas i meddelandet som matchar *_namn*, med bibehållen headerordning och fältnamn i originalheaderns versaler. Om inget matchande huvud hittas, uppstår ett :exc:`KeyError`.

source: Return the message's content type, coerced to lower case of the form :mimetype:`maintype/subtype`. If there is no :mailheader:`Content-Type` header in the message return the value returned by :meth:`get_default_type`. If the :mailheader:`Content-Type` header is invalid, return ``text/plain``.
sv: Returnerar meddelandets innehållstyp, tvingad till gemener av formen :mimetype:`maintype/subtype`. Om det inte finns något :mailheader:`Content-Type`-huvud i meddelandet returneras det värde som returneras av :meth:`get_default_type`. Om rubriken :mailheader:`Content-Type` är ogiltig, returneras ``text/plain``.
