Repository: yeager/python-docs-sv
Catalog: library/email.headerregistry.po
Languages: sv

source: :mod:`!email.headerregistry`: Custom Header Objects
sv: :mod:`!email.headerregistry`: Anpassade rubrikobjekt

source: **Source code:** :source:`Lib/email/headerregistry.py`
sv: **Källkod:** :source:`Lib/email/headerregistry.py`

source: Headers are represented by customized subclasses of :class:`str`. The particular class used to represent a given header is determined by the :attr:`~email.policy.EmailPolicy.header_factory` of the :mod:`~email.policy` in effect when the headers are created. This section documents the particular ``header_factory`` implemented by the email package for handling :RFC:`5322` compliant email messages, which not only provides customized header objects for various header types, but also provides an extension mechanism for applications to add their own custom header types.
sv: Headers representeras av anpassade subklasser av :class:`str`. Den särskilda klass som används för att representera ett visst huvud bestäms av :attr:`~email.policy.EmailPolicy.header_factory` i :mod:`~email.policy` som gäller när huvudena skapas. Det här avsnittet dokumenterar den särskilda ``header_factory`` som implementerats av e-postpaketet för hantering av e-postmeddelanden som uppfyller kraven i :RFC:`5322`, som inte bara tillhandahåller anpassade rubrikobjekt för olika rubriktyper, utan också tillhandahåller en tilläggsmekanism för program att lägga till sina egna anpassade rubriktyper.

source: When using any of the policy objects derived from :data:`~email.policy.EmailPolicy`, all headers are produced by :class:`.HeaderRegistry` and have :class:`.BaseHeader` as their last base class. Each header class has an additional base class that is determined by the type of the header. For example, many headers have the class :class:`.UnstructuredHeader` as their other base class. The specialized second class for a header is determined by the name of the header, using a lookup table stored in the :class:`.HeaderRegistry`. All of this is managed transparently for the typical application program, but interfaces are provided for modifying the default behavior for use by more complex applications.
sv: När du använder något av de policyobjekt som härrör från :data:`~email.policy.EmailPolicy`, produceras alla rubriker av :class:`.HeaderRegistry` och har :class:`.BaseHeader` som sista basklass. Varje header-klass har ytterligare en basklass som bestäms av typen av header. Många headers har t.ex. klassen :class:`.UnstructuredHeader` som sin andra basklass. Den specialiserade andra klassen för en header bestäms av namnet på headern med hjälp av en uppslagstabell som lagras i :class:`.HeaderRegistry`. Allt detta hanteras transparent för det typiska applikationsprogrammet, men gränssnitt tillhandahålls för att ändra standardbeteendet för användning av mer komplexa applikationer.

source: The sections below first document the header base classes and their attributes, followed by the API for modifying the behavior of :class:`.HeaderRegistry`, and finally the support classes used to represent the data parsed from structured headers.
sv: I avsnitten nedan dokumenteras först headerbasklasserna och deras attribut, därefter API:et för att ändra beteendet hos :class:`.HeaderRegistry` och slutligen de stödklasser som används för att representera data som analyseras från strukturerade headers.

source: *name* and *value* are passed to ``BaseHeader`` from the :attr:`~email.policy.EmailPolicy.header_factory` call. The string value of any header object is the *value* fully decoded to unicode.
sv: *name* och *value* skickas till ``BaseHeader`` från anropet :attr:`~email.policy.EmailPolicy.header_factory`. Strängvärdet för ett header-objekt är *värdet* fullt avkodat till unicode.

source: This base class defines the following read-only properties:
sv: Denna basklass definierar följande skrivskyddade egenskaper:

source: The name of the header (the portion of the field before the ':'). This is exactly the value passed in the :attr:`~email.policy.EmailPolicy.header_factory` call for *name*; that is, case is preserved.
sv: Namnet på rubriken (den del av fältet som ligger före ':'). Detta är exakt det värde som skickades i :attr:`~email.policy.EmailPolicy.header_factory`-anropet för *name*; dvs. skiftlägesskillnaden bevaras.

source: A tuple of :exc:`~email.errors.HeaderDefect` instances reporting any RFC compliance problems found during parsing. The email package tries to be complete about detecting compliance issues. See the :mod:`~email.errors` module for a discussion of the types of defects that may be reported.
sv: En tupel av :exc:`~email.errors.HeaderDefect`-instanser som rapporterar eventuella RFC-överensstämmelseproblem som upptäckts under parsningen. E-postpaketet försöker vara komplett när det gäller att upptäcka problem med efterlevnad. Se modulen :mod:`~email.errors` för en diskussion om vilka typer av defekter som kan rapporteras.

source: The maximum number of headers of this type that can have the same ``name``. A value of ``None`` means unlimited. The ``BaseHeader`` value for this attribute is ``None``; it is expected that specialized header classes will override this value as needed.
sv: Det maximala antalet rubriker av denna typ som kan ha samma ``namn``. Ett värde av ``None`` betyder obegränsat. Värdet för ``BaseHeader`` för detta attribut är ``None``; det förväntas att specialiserade header-klasser åsidosätter detta värde efter behov.

source: ``BaseHeader`` also provides the following method, which is called by the email library code and should not in general be called by application programs:
sv: ``BaseHeader`` tillhandahåller också följande metod, som anropas av e-postbibliotekskoden och i allmänhet inte bör anropas av applikationsprogram:

source: Return a string containing :attr:`~email.policy.Policy.linesep` characters as required to correctly fold the header according to *policy*. A :attr:`~email.policy.Policy.cte_type` of ``8bit`` will be treated as if it were ``7bit``, since headers may not contain arbitrary binary data. If :attr:`~email.policy.EmailPolicy.utf8` is ``False``, non-ASCII data will be :rfc:`2047` encoded.
sv: Returnerar en sträng som innehåller :attr:`~email.policy.Policy.linesep` tecken som krävs för att vika headern korrekt enligt *policy*. En :attr:`~email.policy.Policy.cte_type` på ``8bit`` kommer att behandlas som om den vore ``7bit``, eftersom rubriker inte får innehålla godtyckliga binära data. Om :attr:`~email.policy.EmailPolicy.utf8` är ``False``, kommer icke-ASCII-data att kodas enligt :rfc:`2047`.

source: ``BaseHeader`` by itself cannot be used to create a header object. It defines a protocol that each specialized header cooperates with in order to produce the header object. Specifically, ``BaseHeader`` requires that the specialized class provide a :func:`classmethod` named ``parse``. This method is called as follows::
sv: ``BaseHeader`` kan i sig inte användas för att skapa ett rubrikobjekt. Den definierar ett protokoll som varje specialiserad header samarbetar med för att producera header-objektet. Specifikt kräver ``BaseHeader`` att den specialiserade klassen tillhandahåller en :func:`classmethod`` med namnet ``parse``. Denna metod anropas på följande sätt::

source: ``kwds`` is a dictionary containing one pre-initialized key, ``defects``. ``defects`` is an empty list. The parse method should append any detected defects to this list. On return, the ``kwds`` dictionary *must* contain values for at least the keys ``decoded`` and ``defects``. ``decoded`` should be the string value for the header (that is, the header value fully decoded to unicode). The parse method should assume that *string* may contain content-transfer-encoded parts, but should correctly handle all valid unicode characters as well so that it can parse un-encoded header values.
sv: ``kwds`` är en ordbok som innehåller en förinitialiserad nyckel, ``defects``. ``defects`` är en tom lista. Parse-metoden bör lägga till alla upptäckta defekter till denna lista. Vid återlämnandet måste ordlistan ``kwds`` innehålla värden för åtminstone nycklarna ``decoded`` och ``defects``. ``decoded`` bör vara strängvärdet för rubriken (det vill säga rubrikvärdet helt avkodat till unicode). Parse-metoden bör anta att *sträng* kan innehålla innehållsöverföringskodade delar, men bör korrekt hantera alla giltiga Unicode-tecken också så att den kan parsa okodade rubrikvärden.

source: ``BaseHeader``'s ``__new__`` then creates the header instance, and calls its ``init`` method. The specialized class only needs to provide an ``init`` method if it wishes to set additional attributes beyond those provided by ``BaseHeader`` itself. Such an ``init`` method should look like this::
sv: ``BaseHeader``'s ``__new__`` skapar sedan header-instansen och anropar dess ``init`` metod. Den specialiserade klassen behöver bara tillhandahålla en ``init``-metod om den vill ställa in ytterligare attribut utöver de som tillhandahålls av ``BaseHeader`` själv. En sådan ``init``-metod bör se ut så här::

source: That is, anything extra that the specialized class puts in to the ``kwds`` dictionary should be removed and handled, and the remaining contents of ``kw`` (and ``args``) passed to the ``BaseHeader`` ``init`` method.
sv: Det vill säga, allt extra som den specialiserade klassen lägger till i ``kwds``-ordlistan ska tas bort och hanteras, och det återstående innehållet i ``kw`` (och ``args``) skickas till ``BaseHeader`` ``init``-metoden.

source: An "unstructured" header is the default type of header in :rfc:`5322`. Any header that does not have a specified syntax is treated as unstructured. The classic example of an unstructured header is the :mailheader:`Subject` header.
sv: En "ostrukturerad" header är standardtypen av header i :rfc:`5322`. Alla rubriker som inte har en specificerad syntax behandlas som ostrukturerade. Det klassiska exemplet på ett ostrukturerat huvud är :mailheader:`Subject`-huvudet.

source: In :rfc:`5322`, an unstructured header is a run of arbitrary text in the ASCII character set. :rfc:`2047`, however, has an :rfc:`5322` compatible mechanism for encoding non-ASCII text as ASCII characters within a header value. When a *value* containing encoded words is passed to the constructor, the ``UnstructuredHeader`` parser converts such encoded words into unicode, following the :rfc:`2047` rules for unstructured text. The parser uses heuristics to attempt to decode certain non-compliant encoded words. Defects are registered in such cases, as well as defects for issues such as invalid characters within the encoded words or the non-encoded text.
sv: I :rfc:`5322`, är en ostrukturerad header en körning av godtycklig text i ASCII teckenuppsättning. :rfc:`2047`, har dock en :rfc:`5322` kompatibel mekanism för kodning av icke-ASCII text som ASCII tecken inom en header värde. När ett *värde* som innehåller kodade ord skickas till konstruktören, konverterar ``UnstructuredHeader`` parser sådana kodade ord till unicode, enligt :rfc:`2047` regler för ostrukturerad text. Parsern använder heuristik för att försöka avkoda vissa icke-kompatibla kodade ord. Defekter registreras i sådana fall, liksom defekter för problem som ogiltiga tecken inom de kodade orden eller den icke-kodade texten.

source: This header type provides no additional attributes.
sv: Denna rubriktyp innehåller inga ytterligare attribut.

source: :rfc:`5322` specifies a very specific format for dates within email headers. The ``DateHeader`` parser recognizes that date format, as well as recognizing a number of variant forms that are sometimes found "in the wild".
sv: :rfc:`5322` specificerar ett mycket specifikt format för datum i e-postrubriker. Parsern ``DateHeader`` känner igen det datumformatet, samt känner igen ett antal varianter som ibland finns "i naturen".

source: This header type provides the following additional attributes:
sv: Denna rubriktyp innehåller följande ytterligare attribut:

source: If the header value can be recognized as a valid date of one form or another, this attribute will contain a :class:`~datetime.datetime` instance representing that date. If the timezone of the input date is specified as ``-0000`` (indicating it is in UTC but contains no information about the source timezone), then :attr:`.datetime` will be a naive :class:`~datetime.datetime`. If a specific timezone offset is found (including ``+0000``), then :attr:`.datetime` will contain an aware ``datetime`` that uses :class:`datetime.timezone` to record the timezone offset.
sv: Om rubrikvärdet kan identifieras som ett giltigt datum i en eller annan form, kommer detta attribut att innehålla en :class:`~datetime.datetime`-instans som representerar detta datum. Om tidszonen för indatadatumet anges som ``-0000`` (vilket indikerar att det är i UTC men inte innehåller någon information om källans tidszon), kommer :attr:`.datetime` att vara en naiv :class:`~datetime.datetime`. Om en specifik tidszonförskjutning hittas (inklusive ``+0000``), kommer :attr:`.datetime` att innehålla en medveten ``datetime`` som använder :class:`datetime.timezone` för att registrera tidszonförskjutningen.

source: The ``decoded`` value of the header is determined by formatting the ``datetime`` according to the :rfc:`5322` rules; that is, it is set to::
sv: Det ``avkodade`` värdet på rubriken bestäms genom att formatera ``datatiden`` enligt reglerna i :rfc:`5322`, dvs. det sätts till::

source: When creating a ``DateHeader``, *value* may be :class:`~datetime.datetime` instance. This means, for example, that the following code is valid and does what one would expect::
sv: När du skapar en ``DateHeader``, kan *värde* vara :class:`~datetime.datetime` instans. Detta innebär t.ex. att följande kod är giltig och gör vad man förväntar sig::

source: Because this is a naive ``datetime`` it will be interpreted as a UTC timestamp, and the resulting value will have a timezone of ``-0000``. Much more useful is to use the :func:`~email.utils.localtime` function from the :mod:`~email.utils` module::
sv: Eftersom detta är en naiv ``datetime`` kommer den att tolkas som en UTC-tidsstämpel, och det resulterande värdet kommer att ha tidszonen ``-0000``. Mycket mer användbart är att använda funktionen :func:`~email.utils.localtime` från modulen :mod:`~email.utils`::

source: This example sets the date header to the current time and date using the current timezone offset.
sv: I det här exemplet ställs datumrubriken in på aktuell tid och aktuellt datum med aktuell tidszonsförskjutning.

source: Address headers are one of the most complex structured header types. The ``AddressHeader`` class provides a generic interface to any address header.
sv: Adressrubriker är en av de mest komplexa strukturerade rubriktyperna. Klassen ``AddressHeader`` tillhandahåller ett generiskt gränssnitt för alla adressrubriker.

source: A tuple of :class:`.Group` objects encoding the addresses and groups found in the header value. Addresses that are not part of a group are represented in this list as single-address ``Groups`` whose :attr:`~.Group.display_name` is ``None``.
sv: En tupel av :class:`.Group`-objekt som kodar de adresser och grupper som finns i rubrikvärdet. Adresser som inte är en del av en grupp representeras i denna lista som enstaka adresser ``Groups`` vars :attr:`~.Group.display_name` är ``None``.

source: A tuple of :class:`.Address` objects encoding all of the individual addresses from the header value. If the header value contains any groups, the individual addresses from the group are included in the list at the point where the group occurs in the value (that is, the list of addresses is "flattened" into a one dimensional list).
sv: En tupel av :class:`.Address`-objekt som kodar alla individuella adresser från rubrikvärdet. Om rubrikvärdet innehåller några grupper, inkluderas de enskilda adresserna från gruppen i listan vid den punkt där gruppen förekommer i värdet (dvs. adresslistan "plattas till" till en endimensionell lista).

source: The ``decoded`` value of the header will have all encoded words decoded to unicode. :class:`~encodings.idna` encoded domain names are also decoded to unicode. The ``decoded`` value is set by :ref:`joining <meth-str-join>` the :class:`str` value of the elements of the ``groups`` attribute with ``', '``.
sv: Värdet ``decoded`` i rubriken kommer att ha alla kodade ord avkodade till unicode. :class:`~encodings.idna` kodade domännamn är också avkodade till unicode. Det ``avkodade`` värdet sätts genom att :ref:``joining <meth-str-join>`` :class:`str` värdet av elementen i attributet ``groups`` med ``', '``.

source: A list of :class:`.Address` and :class:`.Group` objects in any combination may be used to set the value of an address header. ``Group`` objects whose ``display_name`` is ``None`` will be interpreted as single addresses, which allows an address list to be copied with groups intact by using the list obtained from the ``groups`` attribute of the source header.
sv: En lista med objekten :class:`.Address` och :class:`.Group` i valfri kombination kan användas för att ange värdet på ett adresshuvud. ``Group``-objekt vars ``display_name`` är ``None`` tolkas som enskilda adresser, vilket gör att en adresslista kan kopieras med grupperna intakta genom att använda den lista som erhålls från ``groups``-attributet i källhuvudet.

source: A subclass of :class:`.AddressHeader` that adds one additional attribute:
sv: En subklass av :class:`.AddressHeader` som lägger till ytterligare ett attribut:

source: The single address encoded by the header value. If the header value actually contains more than one address (which would be a violation of the RFC under the default :mod:`~email.policy`), accessing this attribute will result in a :exc:`ValueError`.
sv: Den enskilda adress som kodas av rubrikvärdet. Om rubrikvärdet faktiskt innehåller mer än en adress (vilket skulle vara ett brott mot RFC enligt standard :mod:`~email.policy`), kommer åtkomst till detta attribut att resultera i ett :exc:`ValueError`.

source: Many of the above classes also have a ``Unique`` variant (for example, ``UniqueUnstructuredHeader``). The only difference is that in the ``Unique`` variant, :attr:`~.BaseHeader.max_count` is set to 1.
sv: Många av ovanstående klasser har också en ``Unique`` variant (t.ex. ``UniqueUnstructuredHeader``). Den enda skillnaden är att i ``Unique``-varianten är :attr:`~.BaseHeader.max_count` satt till 1.

source: There is really only one valid value for the :mailheader:`MIME-Version` header, and that is ``1.0``. For future proofing, this header class supports other valid version numbers. If a version number has a valid value per :rfc:`2045`, then the header object will have non-``None`` values for the following attributes:
sv: Det finns egentligen bara ett giltigt värde för rubriken :mailheader:`MIME-Version`, och det är ``1.0``. För att vara framtidssäker stöder denna rubrikklass andra giltiga versionsnummer. Om ett versionsnummer har ett giltigt värde enligt :rfc:`2045`, så kommer rubrikobjektet att ha värden som inte är ``None`` för följande attribut:

source: The version number as a string, with any whitespace and/or comments removed.
sv: Versionsnumret som en sträng, med eventuella blanksteg och/eller kommentarer borttagna.

source: The major version number as an integer
sv: Huvudversionsnumret som ett heltal

source: The minor version number as an integer
sv: Det mindre versionsnumret som ett heltal

source: MIME headers all start with the prefix 'Content-'. Each specific header has a certain value, described under the class for that header. Some can also take a list of supplemental parameters, which have a common format. This class serves as a base for all the MIME headers that take parameters.
sv: MIME-rubriker börjar alla med prefixet "Content-". Varje specifik header har ett visst värde, som beskrivs under klassen för den headern. Vissa kan också ta en lista med kompletterande parametrar, som har ett gemensamt format. Denna klass fungerar som en bas för alla MIME-rubriker som tar parametrar.

source: A dictionary mapping parameter names to parameter values.
sv: En ordlista som mappar parameternamn till parametervärden.

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Type` header.
sv: En :class:`ParameterizedMIMEHeader`-klass som hanterar :mailheader:`Content-Type`-huvudet.

source: The content type string, in the form ``maintype/subtype``.
sv: Strängen för innehållstypen, i formatet ``maintype/subtype``.

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Disposition` header.
sv: En :class:`ParameterizedMIMEHeader`-klass som hanterar :mailheader:`Content-Disposition`-huvudet.

source: ``inline`` and ``attachment`` are the only valid values in common use.
sv: ``inline`` och ``attachment`` är de enda giltiga värdena som används i allmänhet.

source: Handles the :mailheader:`Content-Transfer-Encoding` header.
sv: Hanterar rubriken :mailheader:`Content-Transfer-Encoding`.

source: Valid values are ``7bit``, ``8bit``, ``base64``, and ``quoted-printable``. See :rfc:`2045` for more information.
sv: Giltiga värden är ``7bit``, ``8bit``, ``base64`` och ``quoted-printable``. Se :rfc:`2045` för mer information.

source: This is the factory used by :class:`~email.policy.EmailPolicy` by default. ``HeaderRegistry`` builds the class used to create a header instance dynamically, using *base_class* and a specialized class retrieved from a registry that it holds. When a given header name does not appear in the registry, the class specified by *default_class* is used as the specialized class. When *use_default_map* is ``True`` (the default), the standard mapping of header names to classes is copied in to the registry during initialization. *base_class* is always the last class in the generated class's :class:`~type.__bases__` list.
sv: Detta är den fabrik som används av :class:`~email.policy.EmailPolicy` som standard. ``HeaderRegistry`` bygger den klass som används för att skapa en header-instans dynamiskt, med hjälp av *base_class* och en specialiserad klass som hämtas från ett register som den innehar. När ett visst headernamn inte finns i registret används den klass som anges av *default_class* som specialiserad klass. När *use_default_map* är ``True`` (standard) kopieras standardmappningen av headernamn till klasser in i registret under initialiseringen. *base_class* är alltid den sista klassen i den genererade klassens :class:`~type.__bases__`-lista.

source: The default mappings are:
sv: Standardmappningarna är:

source: ``HeaderRegistry`` has the following methods:
sv: ``HeaderRegistry`` har följande metoder:

source: *name* is the name of the header to be mapped. It will be converted to lower case in the registry. *cls* is the specialized class to be used, along with *base_class*, to create the class used to instantiate headers that match *name*.
sv: *name* är namnet på den header som ska mappas. Det kommer att konverteras till gemener i registret. *cls* är den specialiserade klass som ska användas tillsammans med *base_class* för att skapa den klass som används för att instansiera rubriker som matchar *name*.

source: Construct and return a class to handle creating a *name* header.
sv: Konstruera och returnera en klass som hanterar skapandet av en header med *namn*.
