Repository: yeager/python-docs-sv
Catalog: library/email.compat32-message.po
Languages: sv

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
sv: Returnerar parametern ``charset`` för rubriken :mailheader:`Content-Type`, omgjord till gemener. Om det inte finns någon :mailheader:`Content-Type` header, eller om den headern inte har någon ``charset`` parameter, returneras *failobj*.

source: Note that this method differs from :meth:`get_charset` which returns the :class:`~email.charset.Charset` instance for the default encoding of the message body.
sv: Observera att den här metoden skiljer sig från :meth:`get_charset` som returnerar :class:`~email.charset.Charset`-instansen för standardkodningen av meddelandetexten.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
sv: Returnerar en lista som innehåller teckenuppsättningsnamnen i meddelandet. Om meddelandet är en :mimetype:`multipart`, kommer listan att innehålla ett element för varje underdel i nyttolasten, annars kommer det att vara en lista med längden 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. However, if the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
sv: Varje post i listan kommer att vara en sträng som är värdet på parametern ``charset`` i :mailheader:`Content-Type`-huvudet för den representerade underdelen. Men om underdelen inte har något :mailheader:`Content-Type`-huvud, ingen ``charset``-parameter eller inte är av huvud-MIME-typen :mimetype:`text`, kommer den posten i den returnerade listan att vara *failobj*.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
sv: Returnerar det gemena värdet (utan parametrar) av meddelandets :mailheader:`Content-Disposition`-huvud om det har ett sådant, eller ``None``. De möjliga värdena för denna metod är *inline*, *attachment* eller ``None`` om meddelandet följer :rfc:`2183`.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
sv: Metoden :meth:`walk` är en allroundgenerator som kan användas för att iterera över alla delar och underdelar i ett meddelandeobjektträd, i djupförsta traversalordning. Du kommer vanligtvis att använda :meth:`walk` som iterator i en ``for``-loop; varje iteration returnerar nästa underdel.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
sv: Här är ett exempel som skriver ut MIME-typen för varje del i en flerdelad meddelandestruktur:

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
sv: ``walk`` itererar över underdelarna av alla delar där :meth:`is_multipart`` returnerar ``True``, även om ``msg.get_content_maintype() == 'multipart'`` kan returnera ``False``. Vi kan se detta i vårt exempel genom att använda hjälpfunktionen ``_structure`` debug:

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
sv: Här är ``message`` delarna inte ``multiparts``, men de innehåller subparts. ``is_multipart()`` returnerar ``True`` och ``walk`` går ner i underdelarna.

source: :class:`Message` objects can also optionally contain two instance attributes, which can be used when generating the plain text of a MIME message.
sv: :class:`Message`-objekt kan också innehålla två instansattribut, som kan användas när man genererar klartexten i ett MIME-meddelande.

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
sv: Formatet för ett MIME-dokument tillåter viss text mellan blankraden efter rubrikerna och den första multipart boundary-strängen. Normalt är denna text aldrig synlig i en MIME-medveten e-postläsare eftersom den faller utanför MIME-standarden. Men när man tittar på råtexten i meddelandet, eller när man tittar på meddelandet i en läsare som inte är MIME-medveten, kan denna text bli synlig.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
sv: Attributet *preamble* innehåller denna ledande extra pansartext för MIME-dokument. När :class:`~email.parser.Parser` upptäcker text efter rubrikerna men före den första gränssträngen, tilldelar den denna text till meddelandets *preamble*-attribut. När :class:`~email.generator.Generator` skriver ut klartextrepresentationen av ett MIME-meddelande och upptäcker att meddelandet har ett *preamble*-attribut, skriver den denna text i området mellan rubrikerna och den första gränssträngen. Se :mod:`email.parser` och :mod:`email.generator` för mer information.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
sv: Observera att om meddelandeobjektet inte har någon preamble, kommer attributet *preamble* att vara ``None``.

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message.
sv: Attributet *epilogue* fungerar på samma sätt som attributet *preamble*, förutom att det innehåller text som visas mellan den sista boundary och slutet av meddelandet.

source: You do not need to set the epilogue to the empty string in order for the :class:`~email.generator.Generator` to print a newline at the end of the file.
sv: Du behöver inte sätta epilogen till den tomma strängen för att :class:`~email.generator.Generator` ska skriva ut en ny rad i slutet av filen.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
sv: Attributet *defects* innehåller en lista över alla problem som upptäcktes när meddelandet analyserades. Se :mod:`email.errors` för en detaljerad beskrivning av de möjliga defekterna vid tolkningen.
