Repository: yeager/python-docs-sv
Catalog: library/email.compat32-message.po
Languages: sv

source: :mod:`email.message.Message`: Representing an email message using the :data:`~email.policy.compat32` API
sv: :mod:`email.message.Message`: Representerar ett e-postmeddelande med hjälp av :data:`~email.policy.compat32` API

source: The :class:`Message` class is very similar to the :class:`~email.message.EmailMessage` class, without the methods added by that class, and with the default behavior of certain other methods being slightly different. We also document here some methods that, while supported by the :class:`~email.message.EmailMessage` class, are not recommended unless you are dealing with legacy code.
sv: Klassen :class:`Message` är mycket lik klassen :class:`~email.message.EmailMessage`, utan de metoder som lagts till av den klassen, och med standardbeteendet för vissa andra metoder som är något annorlunda. Vi dokumenterar också här några metoder som, även om de stöds av klassen :class:`~email.message.EmailMessage`, inte rekommenderas om du inte har att göra med äldre kod.

source: The philosophy and structure of the two classes is otherwise the same.
sv: Filosofin och strukturen för de två klasserna är i övrigt densamma.

source: This document describes the behavior under the default (for :class:`Message`) policy :attr:`~email.policy.Compat32`. If you are going to use another policy, you should be using the :class:`~email.message.EmailMessage` class instead.
sv: Detta dokument beskriver beteendet under standardpolicyn (för :class:`Message`) :attr:`~email.policy.Compat32`. Om du tänker använda en annan policy bör du använda klassen :class:`~email.message.EmailMessage` istället.

source: An email message consists of *headers* and a *payload*. Headers must be :rfc:`5322` style names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
sv: Ett e-postmeddelande består av *headers* och en *payload*. Headers måste vara namn och värden i stil med :rfc:`5322`, där fältnamnet och värdet separeras med ett kolon. Kolonet är inte en del av vare sig fältnamnet eller fältvärdet. Nyttolasten kan vara ett enkelt textmeddelande, ett binärt objekt eller en strukturerad sekvens av undermeddelanden, vart och ett med sin egen uppsättning rubriker och sin egen nyttolast. Den senare typen av nyttolast indikeras av att meddelandet har en MIME-typ som :mimetype:`multipart/\*` eller :mimetype:`message/rfc822`.

source: The conceptual model provided by a :class:`Message` object is that of an ordered dictionary of headers with additional methods for accessing both specialized information from the headers, for accessing the payload, for generating a serialized version of the message, and for recursively walking over the object tree. Note that duplicate headers are supported but special methods must be used to access them.
sv: Den konceptuella modell som tillhandahålls av ett :class:`Message`-objekt är en ordnad ordbok med rubriker med ytterligare metoder för åtkomst till både specialiserad information från rubrikerna, för åtkomst till nyttolasten, för generering av en serialiserad version av meddelandet och för rekursiv vandring över objektträdet. Observera att duplicerade headers stöds men att särskilda metoder måste användas för att komma åt dem.

source: The :class:`Message` pseudo-dictionary is indexed by the header names, which must be ASCII values. The values of the dictionary are strings that are supposed to contain only ASCII characters; there is some special handling for non-ASCII input, but it doesn't always produce the correct results. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. There may also be a single envelope header, also known as the *Unix-From* header or the ``From_`` header. The *payload* is either a string or bytes, in the case of simple message objects, or a list of :class:`Message` objects, for MIME container documents (e.g. :mimetype:`multipart/\*` and :mimetype:`message/rfc822`).
sv: Pseudoordboken :class:`Message` indexeras av rubriknamnen, som måste vara ASCII-värden. Värdena i ordlistan är strängar som endast ska innehålla ASCII-tecken; det finns viss specialhantering för icke-ASCII-data, men den ger inte alltid rätt resultat. Rubrikerna lagras och returneras med bibehållen skiftlägespresentation, men fältnamnen matchas utan hänsyn till skiftlägespresentation. Det kan också finnas ett enda kuverthuvud, även känt som *Unix-From*-huvudet eller ``From_``-huvudet. *payload* är antingen en sträng eller bytes, när det gäller enkla meddelandeobjekt, eller en lista med :class:`Message`-objekt, för MIME-containerdokument (t.ex. :mimetype:`multipart/\*` och :mimetype:`message/rfc822`).

source: Here are the methods of the :class:`Message` class:
sv: Här är metoderna i klassen :class:`Message`:

source: If *policy* is specified (it must be an instance of a :mod:`~email.policy` class) use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`compat32 <email.policy.Compat32>` policy, which maintains backward compatibility with the Python 3.2 version of the email package. For more information see the :mod:`~email.policy` documentation.
sv: Om *policy* anges (den måste vara en instans av en :mod:`~email.policy`-klass) används de regler som anges för att uppdatera och serialisera representationen av meddelandet. Om *policy* inte anges används :class:`compat32 <email.policy.Compat32>`-policyn, som upprätthåller bakåtkompatibilitet med Python 3.2-versionen av e-postpaketet. För mer information se :mod:`~email.policy`-dokumentationen.

source: The *policy* keyword argument was added.
sv: Nyckelordsargumentet *policy* har lagts till.

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility reasons, *maxheaderlen* defaults to ``0``, so if you want a different value you must override it explicitly (the value specified for *max_line_length* in the policy will be ignored by this method). The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``Generator``.
sv: Returnerar hela meddelandet plattat som en sträng. När det valfria *unixfrom* är true inkluderas kuvertrubriken i den returnerade strängen. *unixfrom* har ``False`` som standard. Av bakåtkompatibilitetsskäl är *maxheaderlen* standardvärdet ``0``, så om du vill ha ett annat värde måste du uttryckligen åsidosätta det (det värde som anges för *max_line_length* i policyn ignoreras av den här metoden). Argumentet *policy* kan användas för att åsidosätta den standardpolicy som hämtas från meddelandeinstansen. Detta kan användas för att kontrollera en del av formateringen som produceras av metoden, eftersom den angivna *policyn* kommer att skickas till ``Generator``.

source: Flattening the message may trigger changes to the :class:`Message` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
sv: Att göra meddelandet plattare kan leda till ändringar i :class:`Message` om standardvärden måste fyllas i för att slutföra omvandlingen till en sträng (till exempel kan MIME-gränser genereras eller ändras).

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.Generator` instance and use its :meth:`~email.generator.Generator.flatten` method directly. For example::
sv: Observera att den här metoden är en bekvämlighetsåtgärd och att den kanske inte alltid formaterar meddelandet på det sätt du vill. Som standard görs t.ex. inte den mangling av rader som börjar med ``From`` som krävs av Unix mbox-format. För mer flexibilitet kan du instansiera en :class:`~email.generator.Generator`-instans och använda dess :meth:`~email.generator.Generator.flatten`-metod direkt. Till exempel::

source: If the message object contains binary data that is not encoded according to RFC standards, the non-compliant data will be replaced by unicode "unknown character" code points. (See also :meth:`.as_bytes` and :class:`~email.generator.BytesGenerator`.)
sv: Om meddelandeobjektet innehåller binära data som inte är kodade enligt RFC-standarder, kommer de data som inte uppfyller kraven att ersättas av kodpunkter för "okända tecken" i Unicode. (Se även :meth:`.as_bytes` och :class:`~email.generator.BytesGenerator`.)

source: the *policy* keyword argument was added.
sv: nyckelordsargumentet *policy* har lagts till.

source: Equivalent to :meth:`.as_string`. Allows ``str(msg)`` to produce a string containing the formatted message.
sv: Motsvarar :meth:`.as_string`. Tillåter ``str(msg)`` att producera en sträng som innehåller det formaterade meddelandet.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``BytesGenerator``.
sv: Returnerar hela meddelandet plattat som ett bytesobjekt. När det valfria *unixfrom* är true inkluderas kuvertrubriken i den returnerade strängen. *unixfrom* är som standard ``False``. Argumentet *policy* kan användas för att åsidosätta den standardpolicy som hämtas från meddelandeinstansen. Detta kan användas för att styra en del av formateringen som produceras av metoden, eftersom den angivna *policyn* kommer att skickas till ``BytesGenerator``.

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.BytesGenerator` instance and use its :meth:`~email.generator.BytesGenerator.flatten` method directly. For example::
sv: Observera att den här metoden är en bekvämlighetsåtgärd och att den kanske inte alltid formaterar meddelandet på det sätt du vill. Som standard görs t.ex. inte den mangling av rader som börjar med ``From`` som krävs av Unix mbox-format. För mer flexibilitet kan du instansiera en :class:`~email.generator.BytesGenerator`-instans och använda dess :meth:`~email.generator.BytesGenerator.flatten`-metod direkt. Till exempel::

source: Equivalent to :meth:`.as_bytes`. Allows ``bytes(msg)`` to produce a bytes object containing the formatted message.
sv: Motsvarar :meth:`.as_bytes`. Tillåter ``bytes(msg)`` att producera ett bytesobjekt som innehåller det formaterade meddelandet.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`Message` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). (Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`Message` is of type ``message/rfc822``.)
sv: Returnerar ``True`` om meddelandets nyttolast är en lista med sub-objekt av :class:`Message`, annars returneras ``False``. När :meth:`is_multipart` returnerar ``False``, bör nyttolasten vara ett strängobjekt (som kan vara en CTE-kodad binär nyttolast). (Observera att om :meth:`is_multipart` returnerar ``True`` betyder det inte nödvändigtvis att "msg.get_content_maintype() == 'multipart'" kommer att returnera ``True``. Till exempel kommer ``is_multipart`` att returnera ``True`` när :class:`Message` är av typen ``message/rfc822``)

source: Set the message's envelope header to *unixfrom*, which should be a string.
sv: Ställ in meddelandets kuverthuvud på *unixfrom*, som ska vara en sträng.

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
sv: Returnerar meddelandets kuverthuvud. Standardvärdet är ``None`` om kuverthuvudet aldrig har angetts.

source: Add the given *payload* to the current payload, which must be ``None`` or a list of :class:`Message` objects before the call. After the call, the payload will always be a list of :class:`Message` objects. If you want to set the payload to a scalar object (e.g. a string), use :meth:`set_payload` instead.
sv: Lägger till den angivna *payload* till den aktuella payloaden, som måste vara ``None`` eller en lista med :class:`Message`-objekt före anropet. Efter anropet kommer nyttolasten alltid att vara en lista med :class:`Message`-objekt. Om du vill ställa in nyttolasten till ett skalärt objekt (t.ex. en sträng), använd :meth:`set_payload` istället.

source: This is a legacy method. On the :class:`~email.message.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.set_content` and the related ``make`` and ``add`` methods.
sv: Detta är en äldre metod. I klassen :class:`~email.message.EmailMessage` ersätts dess funktionalitet av :meth:`~email.message.EmailMessage.set_content` och de relaterade metoderna ``make`` och ``add``.

source: Return the current payload, which will be a list of :class:`Message` objects when :meth:`is_multipart` is ``True``, or a string when :meth:`is_multipart` is ``False``. If the payload is a list and you mutate the list object, you modify the message's payload in place.
sv: Returnerar den aktuella nyttolasten, som kommer att vara en lista av :class:`Message`-objekt när :meth:`is_multipart` är ``True``, eller en sträng när :meth:`is_multipart` är ``False``. Om nyttolasten är en lista och du muterar listobjektet, ändrar du meddelandets nyttolast på plats.

source: With optional argument *i*, :meth:`get_payload` will return the *i*-th element of the payload, counting from zero, if :meth:`is_multipart` is ``True``. An :exc:`IndexError` will be raised if *i* is less than 0 or greater than or equal to the number of items in the payload. If the payload is a string (i.e. :meth:`is_multipart` is ``False``) and *i* is given, a :exc:`TypeError` is raised.
sv: Med det valfria argumentet *i* returnerar :meth:`get_payload` det *i*-tredje elementet i payloaden, räknat från noll, om :meth:`is_multipart` är ``True``. Ett :exc:`IndexError` kommer att uppstå om *i* är mindre än 0 eller större än eller lika med antalet element i payloaden. Om nyttolasten är en sträng (d.v.s. :meth:`is_multipart` är ``False``) och *i* anges, kommer ett :exc:`TypeError` att uppstå.

source: Optional *decode* is a flag indicating whether the payload should be decoded or not, according to the :mailheader:`Content-Transfer-Encoding` header. When ``True`` and the message is not a multipart, the payload will be decoded if this header's value is ``quoted-printable`` or ``base64``. If some other encoding is used, or :mailheader:`Content-Transfer-Encoding` header is missing, the payload is returned as-is (undecoded). In all cases the returned value is binary data. If the message is a multipart and the *decode* flag is ``True``, then ``None`` is returned. If the payload is base64 and it was not perfectly formed (missing padding, characters outside the base64 alphabet), then an appropriate defect will be added to the message's defect property (:class:`~email.errors.InvalidBase64PaddingDefect` or :class:`~email.errors.InvalidBase64CharactersDefect`, respectively).
sv: Valfritt *decode* är en flagga som anger om nyttolasten skall avkodas eller inte, enligt :mailheader:`Content-Transfer-Encoding`-rubriken. När ``True`` och meddelandet inte är en multipart, kommer nyttolasten att avkodas om värdet på denna header är ``quoted-printable`` eller ``base64``. Om någon annan kodning används, eller om :mailheader:`Content-Transfer-Encoding`-headern saknas, returneras nyttolasten som den är (odekodad). I samtliga fall är det returnerade värdet binära data. Om meddelandet är ett multipart och flaggan *decode* är ``True``, returneras ``None``. Om nyttolasten är base64 och den inte var perfekt formad (saknar utfyllnad, tecken utanför base64-alfabetet), kommer en lämplig defekt att läggas till meddelandets defektegenskap (:class:`~email.errors.InvalidBase64PaddingDefect` eller :class:`~email.errors.InvalidBase64CharactersDefect`, respektive).

source: When *decode* is ``False`` (the default) the body is returned as a string without decoding the :mailheader:`Content-Transfer-Encoding`. However, for a :mailheader:`Content-Transfer-Encoding` of 8bit, an attempt is made to decode the original bytes using the ``charset`` specified by the :mailheader:`Content-Type` header, using the ``replace`` error handler. If no ``charset`` is specified, or if the ``charset`` given is not recognized by the email package, the body is decoded using the default ASCII charset.
sv: När *decode* är ``False`` (standard) returneras meddelandet som en sträng utan avkodning av :mailheader:`Content-Transfer-Encoding`. För en :mailheader:`Content-Transfer-Encoding` på 8bit görs dock ett försök att avkoda de ursprungliga bytena med hjälp av det ``charset`` som anges i :mailheader:`Content-Type`-huvudet, med hjälp av felhanteraren ``replace``. Om ingen ``charset`` anges, eller om den ``charset`` som anges inte känns igen av e-postpaketet, avkodas texten med standard ASCII-charset.

source: This is a legacy method. On the :class:`~email.message.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.get_content` and :meth:`~email.message.EmailMessage.iter_parts`.
sv: Detta är en äldre metod. I klassen :class:`~email.message.EmailMessage` ersätts dess funktionalitet av :meth:`~email.message.EmailMessage.get_content` och :meth:`~email.message.EmailMessage.iter_parts`.

source: Set the entire message object's payload to *payload*. It is the client's responsibility to ensure the payload invariants. Optional *charset* sets the message's default character set; see :meth:`set_charset` for details.
sv: Ställ in hela meddelandeobjektets payload till *payload*. Det är klientens ansvar att se till att nyttolasten är invariant. Valfri *charset* anger meddelandets standardteckensats; se :meth:`set_charset` för detaljer.

source: This is a legacy method. On the :class:`~email.message.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.set_content`.
sv: Detta är en äldre metod. I klassen :class:`~email.message.EmailMessage` ersätts dess funktionalitet av :meth:`~email.message.EmailMessage.set_content`.

source: Set the character set of the payload to *charset*, which can either be a :class:`~email.charset.Charset` instance (see :mod:`email.charset`), a string naming a character set, or ``None``. If it is a string, it will be converted to a :class:`~email.charset.Charset` instance. If *charset* is ``None``, the ``charset`` parameter will be removed from the :mailheader:`Content-Type` header (the message will not be otherwise modified). Anything else will generate a :exc:`TypeError`.
sv: Ställer in teckenuppsättningen för nyttolasten till *charset*, som antingen kan vara en :class:`~email.charset.Charset`-instans (se :mod:`email.charset`), en sträng som namnger en teckenuppsättning eller ``None``. Om det är en sträng kommer den att konverteras till en :class:`~email.charset.Charset`-instans. Om *charset* är ``None`` kommer parametern ``charset`` att tas bort från :mailheader:`Content-Type`-rubriken (meddelandet kommer inte att ändras på något annat sätt). Allt annat kommer att generera ett :exc:`TypeError`.

source: If there is no existing :mailheader:`MIME-Version` header one will be added. If there is no existing :mailheader:`Content-Type` header, one will be added with a value of :mimetype:`text/plain`. Whether the :mailheader:`Content-Type` header already exists or not, its ``charset`` parameter will be set to *charset.output_charset*. If *charset.input_charset* and *charset.output_charset* differ, the payload will be re-encoded to the *output_charset*. If there is no existing :mailheader:`Content-Transfer-Encoding` header, then the payload will be transfer-encoded, if needed, using the specified :class:`~email.charset.Charset`, and a header with the appropriate value will be added. If a :mailheader:`Content-Transfer-Encoding` header already exists, the payload is assumed to already be correctly encoded using that :mailheader:`Content-Transfer-Encoding` and is not modified.
sv: Om det inte finns någon befintlig :mailheader:`MIME-Version` header kommer en sådan att läggas till. Om det inte finns någon befintlig :mailheader:`Content-Type` header, kommer en sådan att läggas till med värdet :mimetype:`text/plain`. Oavsett om rubriken :mailheader:`Content-Type` redan finns eller inte, kommer dess parameter ``charset`` att sättas till *charset.output_charset*. Om *charset.input_charset* och *charset.output_charset* skiljer sig åt kommer nyttolasten att kodas om till *output_charset*. Om det inte finns något befintligt :mailheader:`Content-Transfer-Encoding`-huvud, kommer nyttolasten att överföringskodas, om det behövs, med hjälp av den angivna :class:`~email.charset.Charset`, och ett huvud med lämpligt värde kommer att läggas till. Om en :mailheader:`Content-Transfer-Encoding` header redan finns, antas nyttolasten redan vara korrekt kodad med hjälp av den :mailheader:`Content-Transfer-Encoding` och ändras inte.

source: This is a legacy method. On the :class:`~email.message.EmailMessage` class its functionality is replaced by the *charset* parameter of the :meth:`email.message.EmailMessage.set_content` method.
sv: Detta är en äldre metod. I klassen :class:`~email.message.EmailMessage` ersätts dess funktionalitet av parametern *charset* i metoden :meth:`email.message.EmailMessage.set_content`.

source: Return the :class:`~email.charset.Charset` instance associated with the message's payload.
sv: Returnerar :class:`~email.charset.Charset`-instansen som är associerad med meddelandets nyttolast.

source: This is a legacy method. On the :class:`~email.message.EmailMessage` class it always returns ``None``.
sv: Detta är en äldre metod. I klassen :class:`~email.message.EmailMessage` returnerar den alltid ``None``.
