Repository: yeager/python-docs-sv
Catalog: library/email.policy.po
Languages: sv

source: The email package calls this method with the *name* and *value* currently stored in the ``Message`` when that header is requested by the application program, and whatever the method returns is what is passed back to the application as the value of the header being retrieved. Note that there may be more than one header with the same name stored in the ``Message``; the method is passed the specific name and value of the header destined to be returned to the application.
sv: E-postpaketet anropar den här metoden med *namn* och *värde* som för närvarande lagras i ``Message`` när den rubriken begärs av tillämpningsprogrammet, och det som metoden returnerar är det som skickas tillbaka till tillämpningsprogrammet som värdet på den rubrik som hämtas. Observera att det kan finnas mer än en header med samma namn lagrad i ``Message``; metoden får det specifika namnet och värdet på den header som ska returneras till applikationen.

source: *value* may contain surrogateescaped binary data. There should be no surrogateescaped binary data in the value returned by the method.
sv: *value* kan innehålla surrogatinställda binära data. Det får inte finnas några surrogatkapslade binära data i det värde som returneras av metoden.

source: The email package calls this method with the *name* and *value* currently stored in the ``Message`` for a given header. The method should return a string that represents that header "folded" correctly (according to the policy settings) by composing the *name* with the *value* and inserting :attr:`linesep` characters at the appropriate places. See :rfc:`5322` for a discussion of the rules for folding email headers.
sv: E-postpaketet anropar den här metoden med *namn* och *värde* som för närvarande finns lagrade i ``Message`` för en viss rubrik. Metoden bör returnera en sträng som representerar den rubriken "vikt" korrekt (enligt policyinställningarna) genom att komponera *namn* med *värde* och infoga :attr:`linesep`-tecken på lämpliga ställen. Se :rfc:`5322` för en diskussion om reglerna för vikning av e-postrubriker.

source: *value* may contain surrogateescaped binary data. There should be no surrogateescaped binary data in the string returned by the method.
sv: *value* kan innehålla surrogatinställda binära data. Det får inte finnas några surrogatkapslade binära data i den sträng som returneras av metoden.

source: The same as :meth:`fold`, except that the returned value should be a bytes object rather than a string.
sv: Samma sak som :meth:`fold`, förutom att det returnerade värdet ska vara ett bytesobjekt i stället för en sträng.

source: *value* may contain surrogateescaped binary data. These could be converted back into binary data in the returned bytes object.
sv: *value* kan innehålla binära data med surrogatförkortning. Dessa kan konverteras tillbaka till binära data i det returnerade bytes-objektet.

source: This concrete :class:`Policy` provides behavior that is intended to be fully compliant with the current email RFCs. These include (but are not limited to) :rfc:`5322`, :rfc:`2047`, and the current MIME RFCs.
sv: Denna konkreta :class:`Policy` ger ett beteende som är avsett att vara helt förenligt med de aktuella RFC:erna för e-post. Dessa inkluderar (men är inte begränsade till) :rfc:`5322`, :rfc:`2047` och de aktuella MIME RFC:erna.

source: This policy adds new header parsing and folding algorithms. Instead of simple strings, headers are ``str`` subclasses with attributes that depend on the type of the field. The parsing and folding algorithm fully implement :rfc:`2047` and :rfc:`5322`.
sv: Denna policy lägger till nya algoritmer för parsning och vikning av headers. Istället för enkla strängar är headers subklasser av ``str`` med attribut som beror på fältets typ. Algoritmerna för parsning och vikning implementerar fullt ut :rfc:`2047` och :rfc:`5322`.

source: The default value for the :attr:`~email.policy.Policy.message_factory` attribute is :class:`~email.message.EmailMessage`.
sv: Standardvärdet för attributet :attr:`~email.policy.Policy.message_factory` är :class:`~email.message.EmailMessage`.

source: In addition to the settable attributes listed above that apply to all policies, this policy adds the following additional attributes:
sv: Utöver de inställbara attribut som anges ovan och som gäller för alla policyer, lägger den här policyn till följande ytterligare attribut:

source: If ``False``, follow :rfc:`5322`, supporting non-ASCII characters in headers by encoding them as "encoded words". If ``True``, follow :rfc:`6532` and use ``utf-8`` encoding for headers. Messages formatted in this way may be passed to SMTP servers that support the ``SMTPUTF8`` extension (:rfc:`6531`).
sv: Om ``False``, följ :rfc:`5322`, stöd för icke-ASCII-tecken i rubriker genom att koda dem som "kodade ord". If ``True``, follow :rfc:`6532` and use ``utf-8`` encoding for headers. Meddelanden som formaterats på detta sätt kan skickas till SMTP-servrar som har stöd för tillägget ``SMTPUTF8`` (:rfc:`6531``).

source: If the value for a header in the ``Message`` object originated from a :mod:`~email.parser` (as opposed to being set by a program), this attribute indicates whether or not a generator should refold that value when transforming the message back into serialized form. The possible values are:
sv: Om värdet för en rubrik i objektet ``Message`` härrör från en :mod:`~email.parser`` (i motsats till att ha ställts in av ett program), anger detta attribut om en generator skall återanvända värdet när meddelandet transformeras tillbaka till serialiserad form. De möjliga värdena är:

source: all source values use original folding
sv: alla källvärden använder originalvikning

source: source values that have any line that is longer than ``max_line_length`` will be refolded
sv: källvärden som har någon rad som är längre än ``max_line_length`` kommer att vikas om

source: all values are refolded.
sv: alla värden omformuleras.

source: The default is ``long``.
sv: Standardvärdet är ``long``.

source: A callable that takes two arguments, ``name`` and ``value``, where ``name`` is a header field name and ``value`` is an unfolded header field value, and returns a string subclass that represents that header. A default ``header_factory`` (see :mod:`~email.headerregistry`) is provided that supports custom parsing for the various address and date :RFC:`5322` header field types, and the major MIME header field stypes. Support for additional custom parsing will be added in the future.
sv: En anropsbar funktion som tar två argument, ``name`` och ``value``, där ``name`` är ett namn på ett rubrikfält och ``value`` är ett värde på ett ovikt rubrikfält, och returnerar en strängunderklass som representerar rubriken. En standard ``header_factory`` (se :mod:`~email.headerregistry`) tillhandahålls som stöder anpassad analys av de olika adress- och datumfälttyperna :RFC:`5322` och de viktigaste MIME-fälttyperna. Stöd för ytterligare anpassad parsning kommer att läggas till i framtiden.

source: An object with at least two methods: get_content and set_content. When the :meth:`~email.message.EmailMessage.get_content` or :meth:`~email.message.EmailMessage.set_content` method of an :class:`~email.message.EmailMessage` object is called, it calls the corresponding method of this object, passing it the message object as its first argument, and any arguments or keywords that were passed to it as additional arguments. By default ``content_manager`` is set to :data:`~email.contentmanager.raw_data_manager`.
sv: Ett objekt med minst två metoder: get_content och set_content. När metoden :meth:`~email.message.EmailMessage.get_content` eller :meth:`~email.message.EmailMessage.set_content` i ett :class:`~email.message.EmailMessage`-objekt anropas, anropas motsvarande metod i detta objekt, varvid meddelandeobjektet skickas som första argument och eventuella argument eller nyckelord som skickats till det som ytterligare argument. Som standard är ``content_manager`` inställd på :data:`~email.contentmanager.raw_data_manager`.

source: The class provides the following concrete implementations of the abstract methods of :class:`Policy`:
sv: Klassen tillhandahåller följande konkreta implementationer av de abstrakta metoderna i :class:`Policy`:

source: Returns the value of the :attr:`~email.headerregistry.BaseHeader.max_count` attribute of the specialized class used to represent the header with the given name.
sv: Returnerar värdet på attributet :attr:`~email.headerregistry.BaseHeader.max_count` i den specialiserade klass som används för att representera sidhuvudet med det angivna namnet.

source: The name is parsed as everything up to the '``:``' and returned unmodified. The value is determined by stripping leading whitespace off the remainder of the first line, joining all subsequent lines together, and stripping any trailing carriage return or linefeed characters.
sv: Namnet parsas som allt upp till '``:``' och returneras oförändrat. Värdet bestäms genom att ta bort ledande blanksteg från återstoden av den första raden, sammanfoga alla efterföljande rader och ta bort eventuella efterföljande tecken för vagnsretur eller radmatning.

source: The name is returned unchanged. If the input value has a ``name`` attribute and it matches *name* ignoring case, the value is returned unchanged. Otherwise the *name* and *value* are passed to ``header_factory``, and the resulting header object is returned as the value. In this case a ``ValueError`` is raised if the input value contains CR or LF characters.
sv: Namnet returneras oförändrat. Om indatavärdet har ett ``name``-attribut och det matchar *name* ignorerande fall, returneras värdet oförändrat. Annars skickas *name* och *value* till ``header_factory`` och det resulterande header-objektet returneras som värde. I detta fall uppstår ett ``ValueError`` om indatavärdet innehåller CR- eller LF-tecken.

source: If the value has a ``name`` attribute, it is returned to unmodified. Otherwise the *name*, and the *value* with any CR or LF characters removed, are passed to the ``header_factory``, and the resulting header object is returned. Any surrogateescaped bytes get turned into the unicode unknown-character glyph.
sv: Om värdet har ett ``name``-attribut returneras det oförändrat. Annars skickas *name* och *value* med alla CR- eller LF-tecken borttagna till ``header_factory`` och det resulterande header-objektet returneras. Alla byte med surrogatförkortning omvandlas till glyfen för okända tecken i Unicode.

source: Header folding is controlled by the :attr:`refold_source` policy setting. A value is considered to be a 'source value' if and only if it does not have a ``name`` attribute (having a ``name`` attribute means it is a header object of some sort). If a source value needs to be refolded according to the policy, it is converted into a header object by passing the *name* and the *value* with any CR and LF characters removed to the ``header_factory``. Folding of a header object is done by calling its ``fold`` method with the current policy.
sv: Header-folding styrs av policyinställningen :attr:`refold_source`. Ett värde anses vara ett "källvärde" om och endast om det inte har attributet ``name`` (om det har attributet ``name`` betyder det att det är ett rubrikobjekt av något slag). Om ett källvärde behöver vikas om enligt policyn konverteras det till ett rubrikobjekt genom att *name* och *value* med eventuella CR- och LF-tecken borttagna skickas till ``header_factory``. Fällning av ett header-objekt görs genom att anropa dess ``fold``-metod med den aktuella policyn.

source: Source values are split into lines using :meth:`~str.splitlines`. If the value is not to be refolded, the lines are rejoined using the ``linesep`` from the policy and returned. The exception is lines containing non-ascii binary data. In that case the value is refolded regardless of the ``refold_source`` setting, which causes the binary data to be CTE encoded using the ``unknown-8bit`` charset.
sv: Källvärden delas upp i rader med hjälp av :meth:`~str.splitlines`. Om värdet inte ska vikas om, sätts raderna ihop igen med hjälp av ``linesep`` från policyn och returneras. Undantaget är rader som innehåller binärdata som inte är ascii. I så fall viks värdet om oavsett inställningen för ``refold_source``, vilket gör att binärdata CTE-kodas med teckenuppsättningen ``unknown-8bit``.

source: The same as :meth:`fold` if :attr:`~Policy.cte_type` is ``7bit``, except that the returned value is bytes.
sv: Samma sak som :meth:`fold` om :attr:`~Policy.cte_type` är ``7bit``, förutom att det returnerade värdet är bytes.

source: If :attr:`~Policy.cte_type` is ``8bit``, non-ASCII binary data is converted back into bytes. Headers with binary data are not refolded, regardless of the ``refold_header`` setting, since there is no way to know whether the binary data consists of single byte characters or multibyte characters.
sv: Om :attr:`~Policy.cte_type` är ``8bit`` konverteras binärdata som inte är ASCII tillbaka till bytes. Rubriker med binära data viks inte om, oavsett inställningen ``refold_header``, eftersom det inte finns något sätt att veta om de binära data består av tecken med en byte eller tecken med flera bytes.

source: The following instances of :class:`EmailPolicy` provide defaults suitable for specific application domains. Note that in the future the behavior of these instances (in particular the ``HTTP`` instance) may be adjusted to conform even more closely to the RFCs relevant to their domains.
sv: Följande instanser av :class:`EmailPolicy` ger standardvärden som är lämpliga för specifika applikationsdomäner. Observera att i framtiden kan beteendet hos dessa instanser (i synnerhet ``HTTP``-instansen) komma att justeras så att de i ännu högre grad överensstämmer med de RFC som är relevanta för deras domäner.

source: An instance of ``EmailPolicy`` with all defaults unchanged. This policy uses the standard Python ``\n`` line endings rather than the RFC-correct ``\r\n``.
sv: En instans av ``EmailPolicy`` med alla standardvärden oförändrade. Denna policy använder Pythons standardradavslut ``\n`` istället för det RFC-korrekta ``\r\n``.

source: Suitable for serializing messages in conformance with the email RFCs. Like ``default``, but with ``linesep`` set to ``\r\n``, which is RFC compliant.
sv: Lämplig för serialisering av meddelanden i enlighet med RFC:erna för e-post. Som ``default``, men med ``linesep`` satt till ``r\n``, vilket är RFC-kompatibelt.

source: The same as ``SMTP`` except that :attr:`~EmailPolicy.utf8` is ``True``. Useful for serializing messages to a message store without using encoded words in the headers. Should only be used for SMTP transmission if the sender or recipient addresses have non-ASCII characters (the :meth:`smtplib.SMTP.send_message` method handles this automatically).
sv: Samma som ``SMTP`` förutom att :attr:`~EmailPolicy.utf8` är ``True``. Användbar för serialisering av meddelanden till en meddelandelagring utan att använda kodade ord i rubrikerna. Bör endast användas för SMTP-överföring om avsändar- eller mottagaradresserna har icke-ASCII-tecken (metoden :meth:`smtplib.SMTP.send_message` hanterar detta automatiskt).

source: Suitable for serializing headers with for use in HTTP traffic. Like ``SMTP`` except that ``max_line_length`` is set to ``None`` (unlimited).
sv: Lämplig för serialisering av headers för användning i HTTP-trafik. Som ``SMTP`` förutom att ``max_line_length`` är satt till ``None`` (obegränsad).

source: Convenience instance. The same as ``default`` except that ``raise_on_defect`` is set to ``True``. This allows any policy to be made strict by writing::
sv: Bekvämlighetsinstans. Samma som ``default`` förutom att ``raise_on_defect`` är satt till ``True``. Detta gör att alla policyer kan göras strikta genom att skriva::

source: With all of these :class:`EmailPolicies <.EmailPolicy>`, the effective API of the email package is changed from the Python 3.2 API in the following ways:
sv: Med alla dessa :class:`EmailPolicies <.EmailPolicy>` ändras det effektiva API:et för e-postpaketet från Python 3.2 API på följande sätt:

source: Setting a header on a :class:`~email.message.Message` results in that header being parsed and a header object created.
sv: Om du anger en header för en :class:`~email.message.Message` analyseras headern och ett header-objekt skapas.

source: Fetching a header value from a :class:`~email.message.Message` results in that header being parsed and a header object created and returned.
sv: Att hämta ett rubrikvärde från en :class:`~email.message.Message` resulterar i att rubriken analyseras och att ett rubrikobjekt skapas och returneras.

source: Any header object, or any header that is refolded due to the policy settings, is folded using an algorithm that fully implements the RFC folding algorithms, including knowing where encoded words are required and allowed.
sv: Varje rubrikobjekt, eller varje rubrik som viks om på grund av policyinställningarna, viks med hjälp av en algoritm som fullt ut implementerar RFC-vikningsalgoritmerna, inklusive att veta var kodade ord krävs och tillåts.

source: From the application view, this means that any header obtained through the :class:`~email.message.EmailMessage` is a header object with extra attributes, whose string value is the fully decoded unicode value of the header. Likewise, a header may be assigned a new value, or a new header created, using a unicode string, and the policy will take care of converting the unicode string into the correct RFC encoded form.
sv: Ur programmets synvinkel innebär detta att varje header som erhålls genom :class:`~email.message.EmailMessage` är ett headerobjekt med extra attribut, vars strängvärde är headerns fullständigt avkodade unicode-värde. På samma sätt kan ett huvud tilldelas ett nytt värde, eller ett nytt huvud skapas, med hjälp av en unicode-sträng, och policyn tar hand om att konvertera unicode-strängen till rätt RFC-kodad form.

source: The header objects and their attributes are described in :mod:`~email.headerregistry`.
sv: Header-objekten och deras attribut beskrivs i :mod:`~email.headerregistry`.

source: This concrete :class:`Policy` is the backward compatibility policy. It replicates the behavior of the email package in Python 3.2. The :mod:`~email.policy` module also defines an instance of this class, :const:`compat32`, that is used as the default policy. Thus the default behavior of the email package is to maintain compatibility with Python 3.2.
sv: Denna konkreta :class:`Policy` är policyn för bakåtkompatibilitet. Den replikerar beteendet hos email-paketet i Python 3.2. Modulen :mod:`~email.policy` definierar också en instans av denna klass, :const:`compat32`, som används som standardpolicy. Standardbeteendet för e-postpaketet är alltså att upprätthålla kompatibilitet med Python 3.2.

source: The following attributes have values that are different from the :class:`Policy` default:
sv: Följande attribut har värden som skiljer sig från standardvärdet för :class:`Policy`:

source: The default is ``True``.
sv: Standardvärdet är ``True``.

source: The name and value are returned unmodified.
sv: Namn och värde returneras oförändrade.

source: If the value contains binary data, it is converted into a :class:`~email.header.Header` object using the ``unknown-8bit`` charset. Otherwise it is returned unmodified.
sv: Om värdet innehåller binära data konverteras det till ett :class:`~email.header.Header`-objekt med teckenuppsättningen ``unknown-8bit``. Annars returneras det oförändrat.

source: Headers are folded using the :class:`~email.header.Header` folding algorithm, which preserves existing line breaks in the value, and wraps each resulting line to the ``max_line_length``. Non-ASCII binary data are CTE encoded using the ``unknown-8bit`` charset.
sv: Rubrikerna viks med hjälp av :class:`~email.header.Header`-vikningsalgoritmen, som bevarar befintliga radbrytningar i värdet och viker varje resulterande rad till ``max_line_length``. Icke-ASCII binärdata CTE-kodas med hjälp av teckenuppsättningen ``unknown-8bit``.

source: Headers are folded using the :class:`~email.header.Header` folding algorithm, which preserves existing line breaks in the value, and wraps each resulting line to the ``max_line_length``. If ``cte_type`` is ``7bit``, non-ascii binary data is CTE encoded using the ``unknown-8bit`` charset. Otherwise the original source header is used, with its existing line breaks and any (RFC invalid) binary data it may contain.
sv: Rubriker viks med hjälp av :class:`~email.header.Header`-vikningsalgoritmen, som bevarar befintliga radbrytningar i värdet och viker varje resulterande rad till ``max_line_length``. Om ``cte_type`` är ``7bit``, CTE-kodas binära data som inte är ascii med hjälp av teckenuppsättningen ``unknown-8bit``. I annat fall används det ursprungliga källhuvudet, med befintliga radbrytningar och eventuella (RFC ogiltiga) binära data som det kan innehålla.

source: An instance of :class:`Compat32`, providing backward compatibility with the behavior of the email package in Python 3.2.
sv: En instans av :class:`Compat32`, som ger bakåtkompatibilitet med beteendet hos e-postpaketet i Python 3.2.

source: Footnotes
sv: Fotnoter

source: Originally added in 3.3 as a :term:`provisional feature <provisional package>`.
sv: Ursprungligen tillagd i 3.3 som en :term:``provisional feature <provisional package>`.
