Repository: yeager/python-docs-sv
Catalog: library/email.headerregistry.po
Languages: sv

source: Retrieves the specialized header associated with *name* from the registry (using *default_class* if *name* does not appear in the registry) and composes it with *base_class* to produce a class, calls the constructed class's constructor, passing it the same argument list, and finally returns the class instance created thereby.
sv: Hämtar den specialiserade header som associeras med *namn* från registret (med hjälp av *default_class* om *namn* inte finns i registret) och sätter ihop den med *base_class* för att skapa en klass, anropar den konstruerade klassens konstruktor med samma argumentlista och returnerar slutligen den klassinstans som skapats på detta sätt.

source: The following classes are the classes used to represent data parsed from structured headers and can, in general, be used by an application program to construct structured values to assign to specific headers.
sv: Följande klasser är de klasser som används för att representera data som analyseras från strukturerade rubriker och kan i allmänhet användas av ett applikationsprogram för att konstruera strukturerade värden som ska tilldelas specifika rubriker.

source: The class used to represent an email address. The general form of an address is::
sv: Den klass som används för att representera en e-postadress. Den allmänna formen av en adress är::

source: [display_name] <username@domain>
sv: [display_name] <användarnamn@domän>

source: or::
sv: eller::

source: username@domain
sv: användarnamn@domän

source: where each part must conform to specific syntax rules spelled out in :rfc:`5322`.
sv: där varje del måste överensstämma med specifika syntaxregler som anges i :rfc:`5322`.

source: As a convenience *addr_spec* can be specified instead of *username* and *domain*, in which case *username* and *domain* will be parsed from the *addr_spec*. An *addr_spec* must be a properly RFC quoted string; if it is not ``Address`` will raise an error. Unicode characters are allowed and will be property encoded when serialized. However, per the RFCs, unicode is *not* allowed in the username portion of the address.
sv: Som en bekvämlighet kan *addr_spec* anges i stället för *användarnamn* och *domän*, i vilket fall *användarnamn* och *domän* kommer att tolkas från *addr_spec*. En *addr_spec* måste vara en korrekt RFC-citerad sträng; om den inte är det kommer ``Address`` att ge upphov till ett fel. Unicode-tecken är tillåtna och kommer att vara egenskapskodade när de serialiseras. Enligt RFC är dock unicode *inte* tillåtet i användarnamnsdelen av adressen.

source: The display name portion of the address, if any, with all quoting removed. If the address does not have a display name, this attribute will be an empty string.
sv: Eventuellt visningsnamn för adressen, med alla citattecken borttagna. Om adressen inte har något visningsnamn kommer detta attribut att vara en tom sträng.

source: The ``username`` portion of the address, with all quoting removed.
sv: "Användarnamn"-delen av adressen, med alla citattecken borttagna.

source: The ``domain`` portion of the address.
sv: Den del av adressen som kallas "domän".

source: The ``username@domain`` portion of the address, correctly quoted for use as a bare address (the second form shown above). This attribute is not mutable.
sv: Delen ``användarnamn@domän`` i adressen, korrekt citerad för användning som en ren adress (den andra formen visas ovan). Detta attribut är inte muterbart.

source: The ``str`` value of the object is the address quoted according to :rfc:`5322` rules, but with no Content Transfer Encoding of any non-ASCII characters.
sv: Objektets ``str``-värde är adressen citerad enligt :rfc:`5322`-reglerna, men utan Content Transfer Encoding av några icke-ASCII-tecken.

source: To support SMTP (:rfc:`5321`), ``Address`` handles one special case: if ``username`` and ``domain`` are both the empty string (or ``None``), then the string value of the ``Address`` is ``<>``.
sv: För att stödja SMTP (:rfc:`5321`) hanterar ``Address`` ett specialfall: om ``username`` och ``domain`` båda är den tomma strängen (eller ``None``), så är strängvärdet för ``Address`` ``<>``.

source: The class used to represent an address group. The general form of an address group is::
sv: Den klass som används för att representera en adressgrupp. Den allmänna formen för en adressgrupp är::

source: As a convenience for processing lists of addresses that consist of a mixture of groups and single addresses, a ``Group`` may also be used to represent single addresses that are not part of a group by setting *display_name* to ``None`` and providing a list of the single address as *addresses*.
sv: För att underlätta bearbetningen av adresslistor som består av en blandning av grupper och enskilda adresser kan en ``Group`` också användas för att representera enskilda adresser som inte ingår i en grupp genom att sätta *display_name* till ``None`` och tillhandahålla en lista över de enskilda adresserna som *addresses*.

source: The ``display_name`` of the group. If it is ``None`` and there is exactly one ``Address`` in ``addresses``, then the ``Group`` represents a single address that is not in a group.
sv: Gruppens ``display_name``. Om det är ``None`` och det finns exakt en ``Address`` i ``addresses``, representerar ``Group`` en enskild adress som inte ingår i någon grupp.

source: A possibly empty tuple of :class:`.Address` objects representing the addresses in the group.
sv: En eventuellt tom tupel av :class:`.Address`-objekt som representerar adresserna i gruppen.

source: The ``str`` value of a ``Group`` is formatted according to :rfc:`5322`, but with no Content Transfer Encoding of any non-ASCII characters. If ``display_name`` is none and there is a single ``Address`` in the ``addresses`` list, the ``str`` value will be the same as the ``str`` of that single ``Address``.
sv: Värdet ``str`` för en ``Group`` formateras enligt :rfc:`5322`, men utan Content Transfer Encoding av icke-ASCII-tecken. Om ``display_name`` är none och det finns en enda ``Address`` i listan ``addresses``, kommer värdet ``str`` att vara detsamma som ``str`` för den enda ``Address``.

source: Footnotes
sv: Fotnoter

source: Originally added in 3.3 as a :term:`provisional module <provisional package>`
sv: Ursprungligen tillagd i 3.3 som en :term:``provisorisk modul <provisional package>`
