Repository: yeager/python-docs-sv
Catalog: library/email.message.po
Languages: sv

source: If the message is a ``multipart/alternative``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart`` or ``multipart/related``, call :meth:`make_alternative` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
sv: Om meddelandet är ett ``multipart/alternative``, skapa ett nytt meddelandeobjekt, skicka alla argument till dess :meth:`set_content`-metod och :meth:`~email.message.Message.attach` det till ``multipart``. Om meddelandet inte är en ``multipart`` eller ``multipart/related``, anropa :meth:`make_alternative` och fortsätt sedan enligt ovan. Om meddelandet är någon annan typ av ``multipart``, utlöses ett :exc:`TypeError`. Om *content_manager* inte anges, används den ``content_manager`` som anges av den aktuella :mod:`~email.policy`.

source: If the message is a ``multipart/mixed``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, ``multipart/related``, or ``multipart/alternative``, call :meth:`make_mixed` and then proceed as above. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``attachment``. This method can be used both for explicit attachments (:mailheader:`Content-Disposition: attachment`) and ``inline`` attachments (:mailheader:`Content-Disposition: inline`), by passing appropriate options to the ``content_manager``.
sv: Om meddelandet är ett ``multipart/mixed``, skapa ett nytt meddelandeobjekt, skicka alla argument till dess :meth:`set_content`-metod och :meth:`~email.message.Message.attach` det till ``multipart``. Om meddelandet inte är en ``multipart``, ``multipart/related``, eller ``multipart/alternative``, anropa :meth:`make_mixed` och fortsätt sedan enligt ovan. Om *content_manager* inte anges, används den ``content_manager`` som anges av den aktuella :mod:`~email.policy`. Om den tillagda delen inte har någon :mailheader:`Content-Disposition` header, lägg till en med värdet ``attachment``. Denna metod kan användas både för explicita bilagor (:mailheader:`Content-Disposition: attachment`) och ``inline`` bilagor (:mailheader:`Content-Disposition: inline`), genom att passera lämpliga alternativ till ``content_manager``.

source: Remove the payload and all of the headers.
sv: Ta bort nyttolasten och alla rubriker.

source: Remove the payload and all of the :mailheader:`!Content-` headers, leaving all other headers intact and in their original order.
sv: Ta bort nyttolasten och alla :mailheader:`!Content-`-rubriker, och lämna alla andra rubriker intakta och i sin ursprungliga ordning.

source: :class:`EmailMessage` objects have the following instance attributes:
sv: :class:`EmailMessage`-objekt har följande instansattribut:

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
sv: Formatet för ett MIME-dokument tillåter viss text mellan blankraden efter rubrikerna och den första multipart boundary-strängen. Normalt är denna text aldrig synlig i en MIME-medveten e-postläsare eftersom den faller utanför MIME-standarden. Men när man tittar på råtexten i meddelandet, eller när man tittar på meddelandet i en läsare som inte är MIME-medveten, kan denna text bli synlig.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
sv: Attributet *preamble* innehåller denna ledande extra pansartext för MIME-dokument. När :class:`~email.parser.Parser` upptäcker text efter rubrikerna men före den första gränssträngen, tilldelar den denna text till meddelandets *preamble*-attribut. När :class:`~email.generator.Generator` skriver ut klartextrepresentationen av ett MIME-meddelande och upptäcker att meddelandet har ett *preamble*-attribut, skriver den denna text i området mellan rubrikerna och den första gränssträngen. Se :mod:`email.parser` och :mod:`email.generator` för mer information.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
sv: Observera att om meddelandeobjektet inte har någon preamble, kommer attributet *preamble* att vara ``None``.

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message. As with the :attr:`~EmailMessage.preamble`, if there is no epilog text this attribute will be ``None``.
sv: Attributet *epilogue* fungerar på samma sätt som attributet *preamble*, förutom att det innehåller text som visas mellan den sista avgränsningen och slutet av meddelandet. Precis som med :attr:`~EmailMessage.preamble`, om det inte finns någon epilogtext kommer detta attribut att vara ``None``.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
sv: Attributet *defects* innehåller en lista över alla problem som upptäcktes när meddelandet analyserades. Se :mod:`email.errors` för en detaljerad beskrivning av de möjliga defekterna vid tolkningen.

source: This class represents a subpart of a MIME message. It is identical to :class:`EmailMessage`, except that no :mailheader:`MIME-Version` headers are added when :meth:`~EmailMessage.set_content` is called, since sub-parts do not need their own :mailheader:`MIME-Version` headers.
sv: Denna klass representerar en underdel av ett MIME-meddelande. Den är identisk med :class:`EmailMessage`, förutom att inga :mailheader:`MIME-Version`-rubriker läggs till när :meth:`~EmailMessage.set_content` anropas, eftersom underdelar inte behöver sina egna :mailheader:`MIME-Version`-rubriker.

source: Footnotes
sv: Fotnoter

source: Originally added in 3.4 as a :term:`provisional module <provisional package>`. Docs for legacy message class moved to :ref:`compat32_message`.
sv: Ursprungligen tillagd i 3.4 som en :term:``provisorisk modul <provisional package>``. Dokumentationen för den äldre meddelandeklassen flyttades till :ref:`compat32_message`.
