Repository: yeager/python-docs-sv
Catalog: library/email.errors.po
Languages: sv

source: :mod:`!email.errors`: Exception and Defect classes
sv: :mod:`!email.errors`: Klasser för undantag och defekter

source: **Source code:** :source:`Lib/email/errors.py`
sv: **Källkod:** :source:`Lib/email/errors.py`

source: The following exception classes are defined in the :mod:`email.errors` module:
sv: Följande undantagsklasser definieras i modulen :mod:`email.errors`:

source: This is the base class for all exceptions that the :mod:`email` package can raise. It is derived from the standard :exc:`Exception` class and defines no additional methods.
sv: Detta är basklassen för alla undantag som paketet :mod:`email` kan ge upphov till. Den härstammar från standardklassen :exc:`Exception` och definierar inga ytterligare metoder.

source: This is the base class for exceptions raised by the :class:`~email.parser.Parser` class. It is derived from :exc:`MessageError`. This class is also used internally by the parser used by :mod:`~email.headerregistry`.
sv: Detta är basklassen för undantag som skapas av klassen :class:`~email.parser.Parser`. Den är härledd från :exc:`MessageError`. Denna klass används också internt av den parser som används av :mod:`~email.headerregistry`.

source: Raised under some error conditions when parsing the :rfc:`5322` headers of a message, this class is derived from :exc:`MessageParseError`. The :meth:`~email.message.EmailMessage.set_boundary` method will raise this error if the content type is unknown when the method is called. :class:`~email.header.Header` may raise this error for certain base64 decoding errors, and when an attempt is made to create a header that appears to contain an embedded header (that is, there is what is supposed to be a continuation line that has no leading whitespace and looks like a header).
sv: Uppstår under vissa felförhållanden vid analys av :rfc:`5322`-rubrikerna i ett meddelande, denna klass härrör från :exc:`MessageParseError`. Metoden :meth:`~email.message.EmailMessage.set_boundary` kommer att ge upphov till detta fel om innehållstypen är okänd när metoden anropas. :class:`~email.header.Header` kan ge upphov till detta fel för vissa base64-avkodningsfel och när ett försök görs att skapa en rubrik som verkar innehålla en inbäddad rubrik (det vill säga, det finns vad som ska vara en fortsättningsrad som inte har några ledande blanksteg och ser ut som en rubrik).

source: Deprecated and no longer used.
sv: Avskrivna och används inte längre.

source: Raised if the :meth:`~email.message.Message.attach` method is called on an instance of a class derived from :class:`~email.mime.nonmultipart.MIMENonMultipart` (e.g. :class:`~email.mime.image.MIMEImage`). :exc:`MultipartConversionError` multiply inherits from :exc:`MessageError` and the built-in :exc:`TypeError`.
sv: Uppstår om metoden :meth:`~email.message.Message.attach` anropas på en instans av en klass som härrör från :class:`~email.mime.nonmultipart.MIMENonMultipart` (t.ex. :class:`~email.mime.image.MIMEImage`). :exc:`MultipartConversionError` ärver multipelt från :exc:`MessageError` och den inbyggda :exc:`TypeError`.

source: Raised when an error occurs when the :mod:`~email.generator` outputs headers.
sv: Utlöses när ett fel uppstår när :mod:`~email.generator` matar ut rubriker.

source: This is the base class for all defects found when parsing email messages. It is derived from :exc:`ValueError`.
sv: Detta är basklassen för alla defekter som upptäcks när e-postmeddelanden analyseras. Den är härledd från :exc:`ValueError`.

source: This is the base class for all defects found when parsing email headers. It is derived from :exc:`MessageDefect`.
sv: Detta är basklassen för alla defekter som upptäcks vid analys av e-postrubriker. Den är härledd från :exc:`MessageDefect`.

source: Here is the list of the defects that the :class:`~email.parser.FeedParser` can find while parsing messages. Note that the defects are added to the message where the problem was found, so for example, if a message nested inside a :mimetype:`multipart/alternative` had a malformed header, that nested message object would have a defect, but the containing messages would not.
sv: Här är listan över de defekter som :class:`~email.parser.FeedParser` kan hitta när den analyserar meddelanden. Observera att defekterna läggs till i det meddelande där problemet hittades, så till exempel om ett meddelande som är kapslat inuti en :mimetype:`multipart/alternative` hade ett felaktigt huvud, skulle det kapslade meddelandeobjektet ha en defekt, men de innehållande meddelandena skulle inte ha det.

source: All defect classes are subclassed from :class:`email.errors.MessageDefect`.
sv: Alla defektklasser är underklassade från :class:`email.errors.MessageDefect`.

source: A message claimed to be a multipart, but had no :mimetype:`boundary` parameter.
sv: Ett meddelande påstod sig vara en multipart, men hade ingen parameter :mimetype:`boundary`.

source: The start boundary claimed in the :mailheader:`Content-Type` header was never found.
sv: Startgränsen som angavs i :mailheader:`Content-Type` -rubriken hittades aldrig.

source: A start boundary was found, but no corresponding close boundary was ever found.
sv: En startgräns hittades, men ingen motsvarande slutgräns hittades någonsin.

source: The message had a continuation line as its first header line.
sv: Meddelandet hade en fortsättningsrad som första rubrikrad.

source: A "Unix From" header was found in the middle of a header block.
sv: Ett "Unix From"-huvud hittades i mitten av ett huvudblock.

source: A line was found while parsing headers that had no leading white space but contained no ':'. Parsing continues assuming that the line represents the first line of the body.
sv: Vid parsning av rubriker hittades en rad som inte hade något inledande vitt utrymme men som inte innehöll något ':'. Parsningen fortsätter med antagandet att raden representerar den första raden i brödtexten.

source: A header was found that was missing a colon, or was otherwise malformed.
sv: En header saknade ett kolon eller var på annat sätt felformad.

source: This defect has not been used for several Python versions.
sv: Denna defekt har inte använts på flera Python-versioner.

source: A message claimed to be a :mimetype:`multipart`, but no subparts were found. Note that when a message has this defect, its :meth:`~email.message.Message.is_multipart` method may return ``False`` even though its content type claims to be :mimetype:`multipart`.
sv: Ett meddelande påstod sig vara en :mimetype:`multipart`, men inga underdelar hittades. Observera att när ett meddelande har denna defekt kan dess metod :meth:`~email.message.Message.is_multipart` returnera ``False`` även om dess innehållstyp påstår sig vara :mimetype:`multipart`.

source: When decoding a block of base64 encoded bytes, the padding was not correct. Enough padding is added to perform the decode, but the resulting decoded bytes may be invalid.
sv: Vid avkodning av ett block med base64-kodade byte var utfyllnaden inte korrekt. Tillräcklig utfyllnad läggs till för att utföra avkodningen, men de avkodade byte som blir resultatet kan vara ogiltiga.

source: When decoding a block of base64 encoded bytes, characters outside the base64 alphabet were encountered. The characters are ignored, but the resulting decoded bytes may be invalid.
sv: Vid avkodning av ett block med base64-kodade bytes påträffades tecken utanför base64-alfabetet. Tecknen ignoreras, men de avkodade byte som blir resultatet kan vara ogiltiga.

source: When decoding a block of base64 encoded bytes, the number of non-padding base64 characters was invalid (1 more than a multiple of 4). The encoded block was kept as-is.
sv: Vid avkodning av ett block med base64-kodade bytes var antalet icke-padding base64-tecken ogiltigt (1 mer än en multipel av 4). Det kodade blocket behölls i befintligt skick.

source: When decoding an invalid or unparsable date field. The original value is kept as-is.
sv: Vid avkodning av ett ogiltigt eller icke analyserbart datumfält. Det ursprungliga värdet behålls som det är.
