Repository: yeager/python-docs-sv
Catalog: library/email.encoders.po
Languages: sv

source: :mod:`!email.encoders`: Encoders
sv: :mod:`!email.encoders`: Kodare

source: **Source code:** :source:`Lib/email/encoders.py`
sv: **Källkod:** :source:`Lib/email/encoders.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API the functionality is provided by the *cte* parameter of the :meth:`~email.message.EmailMessage.set_content` method.
sv: Denna modul är en del av det äldre (``Compat32``) e-post-API:et. I det nya API:et tillhandahålls funktionaliteten av parametern *cte* i metoden :meth:`~email.message.EmailMessage.set_content`.

source: This module is deprecated in Python 3. The functions provided here should not be called explicitly since the :class:`~email.mime.text.MIMEText` class sets the content type and CTE header using the *_subtype* and *_charset* values passed during the instantiation of that class.
sv: Denna modul är föråldrad i Python 3. De funktioner som tillhandahålls här bör inte anropas explicit eftersom :class:`~email.mime.text.MIMEText`-klassen ställer in innehållstypen och CTE-huvudet med hjälp av värdena *_subtype* och *_charset* som skickas under instantiering av den klassen.

source: The remaining text in this section is the original documentation of the module.
sv: Resterande text i detta avsnitt är modulens originaldokumentation.

source: When creating :class:`~email.message.Message` objects from scratch, you often need to encode the payloads for transport through compliant mail servers. This is especially true for :mimetype:`image/\*` and :mimetype:`text/\*` type messages containing binary data.
sv: När du skapar :class:`~email.message.Message`-objekt från grunden behöver du ofta koda nyttolasten för transport genom kompatibla e-postservrar. Detta gäller särskilt för meddelanden av typen :mimetype:`image/\*` och :mimetype:`text/\*` som innehåller binära data.

source: The :mod:`email` package provides some convenient encoders in its :mod:`~email.encoders` module. These encoders are actually used by the :class:`~email.mime.audio.MIMEAudio` and :class:`~email.mime.image.MIMEImage` class constructors to provide default encodings. All encoder functions take exactly one argument, the message object to encode. They usually extract the payload, encode it, and reset the payload to this newly encoded value. They should also set the :mailheader:`Content-Transfer-Encoding` header as appropriate.
sv: Paketet :mod:`email` tillhandahåller några praktiska kodare i modulen :mod:`~email.encoders`. Dessa kodare används faktiskt av klasskonstruktörerna :class:`~email.mime.audio.MIMEAudio` och :class:`~email.mime.image.MIMEImage` för att tillhandahålla standardkodningar. Alla kodarfunktioner tar exakt ett argument, meddelandeobjektet som ska kodas. De extraherar vanligtvis nyttolasten, kodar den och återställer nyttolasten till det nya kodade värdet. De bör också ställa in :mailheader:`Content-Transfer-Encoding`-huvudet på lämpligt sätt.

source: Note that these functions are not meaningful for a multipart message. They must be applied to individual subparts instead, and will raise a :exc:`TypeError` if passed a message whose type is multipart.
sv: Observera att dessa funktioner inte är meningsfulla för ett flerpartsmeddelande. De måste tillämpas på enskilda underdelar istället, och kommer att ge upphov till ett :exc:`TypeError` om de skickas till ett meddelande vars typ är multipart.

source: Here are the encoding functions provided:
sv: Här är de kodningsfunktioner som tillhandahålls:

source: Encodes the payload into quoted-printable form and sets the :mailheader:`Content-Transfer-Encoding` header to ``quoted-printable`` [#]_. This is a good encoding to use when most of your payload is normal printable data, but contains a few unprintable characters.
sv: Kodar nyttolasten i formatet "quoted-printable" och sätter rubriken :mailheader:`Content-Transfer-Encoding` till ``quoted-printable`` [#]_. Det här är en bra kodning att använda när det mesta av innehållet är normala utskrivbara data, men innehåller några få tecken som inte kan skrivas ut.

source: Encodes the payload into base64 form and sets the :mailheader:`Content-Transfer-Encoding` header to ``base64``. This is a good encoding to use when most of your payload is unprintable data since it is a more compact form than quoted-printable. The drawback of base64 encoding is that it renders the text non-human readable.
sv: Kodar nyttolasten till base64-form och sätter rubriken :mailheader:`Content-Transfer-Encoding` till ``base64``. Detta är en bra kodning att använda när det mesta av din nyttolast är data som inte kan skrivas ut eftersom det är en mer kompakt form än quoted-printable. Nackdelen med base64-kodning är att den gör texten icke-mänskligt läsbar.

source: This doesn't actually modify the message's payload, but it does set the :mailheader:`Content-Transfer-Encoding` header to either ``7bit`` or ``8bit`` as appropriate, based on the payload data.
sv: Detta ändrar faktiskt inte meddelandets nyttolast, men det ställer in :mailheader:`Content-Transfer-Encoding`-rubriken till antingen ``7bit`` eller ``8bit`` som lämpligt, baserat på nyttolastdata.

source: This does nothing; it doesn't even set the :mailheader:`Content-Transfer-Encoding` header.
sv: Detta gör ingenting; det ställer inte ens in :mailheader:`Content-Transfer-Encoding`-rubriken.

source: Footnotes
sv: Fotnoter

source: Note that encoding with :meth:`encode_quopri` also encodes all tabs and space characters in the data.
sv: Observera att kodning med :meth:`encode_quopri` även kodar alla tabbar och mellanslagstecken i data.
