Repository: yeager/python-docs-sv
Catalog: library/email.compat32-message.po
Languages: sv

source: The following methods implement a mapping-like interface for accessing the message's :rfc:`2822` headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in a :class:`Message` object, headers are always returned in the order they appeared in the original message, or were added to the message later. Any header deleted and then re-added are always appended to the end of the header list.
sv: Följande metoder implementerar ett mappningsliknande gränssnitt för åtkomst till meddelandets :rfc:`2822`-rubriker. Observera att det finns vissa semantiska skillnader mellan dessa metoder och ett normalt mappningsgränssnitt (dvs. ett dictionary-gränssnitt). I en dictionary finns det t.ex. inga duplicerade nycklar, men här kan det finnas duplicerade meddelandehuvuden. I ordböcker finns det inte heller någon garanterad ordning på de nycklar som returneras av :meth:`keys`, men i ett :class:`Message`-objekt returneras alltid rubrikerna i den ordning de förekom i det ursprungliga meddelandet eller lades till i meddelandet senare. Eventuella rubriker som raderats och sedan lagts till igen läggs alltid till i slutet av rubriklistan.

source: These semantic differences are intentional and are biased toward maximal convenience.
sv: Dessa semantiska skillnader är avsiktliga och syftar till maximal bekvämlighet.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
sv: Observera att i samtliga fall ingår inte eventuella kuvertrubriker som finns i meddelandet i mappningsgränssnittet.

source: In a model generated from bytes, any header values that (in contravention of the RFCs) contain non-ASCII bytes will, when retrieved through this interface, be represented as :class:`~email.header.Header` objects with a charset of ``unknown-8bit``.
sv: I en modell som genereras från byte kommer alla rubrikvärden som (i strid med RFC) innehåller icke-ASCII-byte, när de hämtas via detta gränssnitt, att representeras som :class:`~email.header.Header`-objekt med en teckenuppsättning på ``unknown-8bit``.

source: Return the total number of headers, including duplicates.
sv: Returnerar det totala antalet headers, inklusive dubbletter.

source: Return ``True`` if the message object has a field named *name*. Matching is done case-insensitively and *name* should not include the trailing colon. Used for the ``in`` operator, e.g.::
sv: Returnerar ``True`` om meddelandeobjektet har ett fält med namnet *name*. Matchning sker utan hänsyn till skiftlägesskillnader och *namn* bör inte innehålla kolon. Används för operatorn ``in``, t.ex.::

source: Return the value of the named header field. *name* should not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
sv: Returnerar värdet för det namngivna rubrikfältet. *name* bör inte innehålla fältavgränsaren kolon. Om rubriken saknas returneras ``None``; ett :exc:`KeyError` uppstår aldrig.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant named headers.
sv: Observera att om det namngivna fältet förekommer mer än en gång i meddelandets rubriker är det odefinierat exakt vilket av dessa fältvärden som kommer att returneras. Använd metoden :meth:`get_all` för att få värdena för alla befintliga namngivna rubriker.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing fields.
sv: Lägg till en rubrik i meddelandet med fältnamnet *name* och värdet *val*. Fältet läggs till i slutet av meddelandets befintliga fält.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
sv: Observera att detta *inte* skriver över eller raderar någon befintlig header med samma namn. Om du vill vara säker på att det nya sidhuvudet är det enda som finns i meddelandet med fältnamnet *namn*, raderar du fältet först, t.ex.::

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
sv: Ta bort alla förekomster av fältet med namnet *namn* från meddelandets rubriker. Inget undantag görs om det namngivna fältet inte finns med i sidhuvudet.

source: Return a list of all the message's header field names.
sv: Returnerar en lista med alla namn på fält i meddelandets header.

source: Return a list of all the message's field values.
sv: Returnerar en lista med alla fältvärden i meddelandet.

source: Return a list of 2-tuples containing all the message's field headers and values.
sv: Returnerar en lista med 2-tuples som innehåller alla meddelandets fältrubriker och värden.

source: Return the value of the named header field. This is identical to :meth:`~object.__getitem__` except that optional *failobj* is returned if the named header is missing (defaults to ``None``).
sv: Returnerar värdet för det namngivna rubrikfältet. Detta är identiskt med :meth:`~object.__getitem__` förutom att den valfria *failobj* returneras om det angivna sidhuvudet saknas (standard är ``None``).

source: Here are some additional useful methods:
sv: Här är några ytterligare användbara metoder:

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
sv: Returnerar en lista med alla värden för fältet med namnet *name*. Om det inte finns några sådana namngivna rubriker i meddelandet returneras *failobj* (standardvärde är ``None``).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
sv: Utökad inställning av sidhuvud. Den här metoden liknar :meth:`__setitem__` förutom att ytterligare rubrikparametrar kan anges som nyckelordsargument. *_name* är rubrikfältet som ska läggas till och *_value* är det *primära* värdet för rubriken.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added. If the value contains non-ASCII characters, it can be specified as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
sv: För varje objekt i nyckelordets argumentordbok *_params* tas nyckeln som parameternamn, med understrykningar konverterade till bindestreck (eftersom bindestreck är olagliga i Python-identifierare). Normalt kommer parametern att läggas till som ``key="value"`` om inte värdet är ``None``, i vilket fall endast nyckeln kommer att läggas till. Om värdet innehåller icke-ASCII-tecken kan det specificeras som en tupel med tre tecken i formatet ``(CHARSET, LANGUAGE, VALUE)``, där ``CHARSET`` är en sträng som namnger det teckenuppsättning som skall användas för att koda värdet, ``LANGUAGE`` kan vanligtvis sättas till ``None`` eller tomsträngen (se :rfc:`2231` för andra möjligheter), och ``VALUE`` är strängvärdet som innehåller icke-ASCII-kodpunkter. Om en tupel med tre inte skickas och värdet innehåller icke-ASCII-tecken, kodas det automatiskt i :rfc:`2231`-format med ``CHARSET`` ``utf-8`` och ``LANGUAGE`` ``None``.

source: Here's an example::
sv: Här är ett exempel::

source: This will add a header that looks like ::
sv: Detta kommer att lägga till en rubrik som ser ut som ::

source: An example with non-ASCII characters::
sv: Ett exempel med icke-ASCII-tecken::

source: Which produces ::
sv: Som producerar ::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case. If no matching header was found, a :exc:`KeyError` is raised.
sv: Ersätt ett huvud. Ersätt den första headern som hittas i meddelandet som matchar *_namn*, med bibehållen headerordning och skiftlägesordning för fältnamn. Om inget matchande huvud hittades, uppstår ett :exc:`KeyError`.

source: Return the message's content type. The returned string is coerced to lower case of the form :mimetype:`maintype/subtype`. If there was no :mailheader:`Content-Type` header in the message the default type as given by :meth:`get_default_type` will be returned. Since according to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value.
sv: Returnerar meddelandets innehållstyp. Den returnerade strängen är tvingad till gemener av formen :mimetype:`maintype/subtype`. Om det inte fanns någon :mailheader:`Content-Type` header i meddelandet returneras standardtypen som anges av :meth:`get_default_type`. Eftersom meddelanden enligt :rfc:`2045` alltid har en standardtyp, kommer :meth:`get_content_type` alltid att returnera ett värde.

source: :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.
sv: Enligt :rfc:`2045` är standardtypen för ett meddelande :mimetype:`text/plain`, såvida det inte finns i en :mimetype:`multipart/digest`-behållare, i vilket fall det skulle vara :mimetype:`message/rfc822`. Om rubriken :mailheader:`Content-Type` har en ogiltig typspecifikation, föreskriver :rfc:`2045` att standardtypen skall vara :mimetype:`text/plain`.

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
sv: Returnerar meddelandets huvudsakliga innehållstyp. Detta är :mimetype:`maintype`-delen av strängen som returneras av :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
sv: Returnerar meddelandets typ av underinnehåll. Detta är :mimetype:`subtype`-delen av strängen som returneras av :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
sv: Returnerar den förvalda innehållstypen. De flesta meddelanden har standardinnehållstypen :mimetype:`text/plain`, utom meddelanden som är underdelar av behållare av typen :mimetype:`multipart/digest`. Sådana underdelar har en standardinnehållstyp av typen :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header.
sv: Ställer in standardinnehållstypen. *ctype* bör antingen vara :mimetype:`text/plain` eller :mimetype:`message/rfc822`, även om detta inte är obligatoriskt. Standardinnehållstypen lagras inte i rubriken :mailheader:`Content-Type`.

source: Return the message's :mailheader:`Content-Type` parameters, as a list. The elements of the returned list are 2-tuples of key/value pairs, as split on the ``'='`` sign. The left hand side of the ``'='`` is the key, while the right hand side is the value. If there is no ``'='`` sign in the parameter the value is the empty string, otherwise the value is as described in :meth:`get_param` and is unquoted if optional *unquote* is ``True`` (the default).
sv: Returnerar meddelandets :mailheader:`Content-Type`-parametrar som en lista. Elementen i den returnerade listan är 2-tuples av nyckel/värde-par, som delas upp med tecknet ``'='``. Den vänstra sidan av ``'='`` är nyckeln, medan den högra sidan är värdet. Om det inte finns något ``'='``-tecken i parametern är värdet den tomma strängen, annars är värdet enligt beskrivningen i :meth:`get_param` och är ociterat om den valfria *unquote* är ``True`` (standard).

source: Optional *failobj* is the object to return if there is no :mailheader:`Content-Type` header. Optional *header* is the header to search instead of :mailheader:`Content-Type`.
sv: Valfritt *failobj* är det objekt som skall returneras om det inte finns något :mailheader:`Content-Type`-huvud. Valfritt *header* är rubriken som ska sökas i stället för :mailheader:`Content-Type`.

source: This is a legacy method. On the :class:`~email.message.EmailMessage` class its functionality is replaced by the *params* property of the individual header objects returned by the header access methods.
sv: Detta är en äldre metod. I klassen :class:`~email.message.EmailMessage` ersätts dess funktionalitet av egenskapen *params* i de enskilda rubrikobjekt som returneras av metoderna för rubrikåtkomst.

source: Return the value of the :mailheader:`Content-Type` header's parameter *param* as a string. If the message has no :mailheader:`Content-Type` header or if there is no such parameter, then *failobj* is returned (defaults to ``None``).
sv: Returnerar värdet av :mailheader:`Content-Type`-headerns parameter *param* som en sträng. Om meddelandet inte har någon :mailheader:`Content-Type`-rubrik eller om det inte finns någon sådan parameter returneras *failobj* (standardvärde är ``None``).

source: Optional *header* if given, specifies the message header to use instead of :mailheader:`Content-Type`.
sv: Valfritt *header* om det anges, anger meddelandehuvudet som ska användas i stället för :mailheader:`Content-Type`.

source: Parameter keys are always compared case insensitively. The return value can either be a string, or a 3-tuple if the parameter was :rfc:`2231` encoded. When it's a 3-tuple, the elements of the value are of the form ``(CHARSET, LANGUAGE, VALUE)``. Note that both ``CHARSET`` and ``LANGUAGE`` can be ``None``, in which case you should consider ``VALUE`` to be encoded in the ``us-ascii`` charset. You can usually ignore ``LANGUAGE``.
sv: Parameternycklar jämförs alltid utan hänsyn till skift. Returvärdet kan antingen vara en sträng eller en 3-tupel om parametern var :rfc:`2231`-kodad. När det är en 3-tupel är elementen i värdet av formen ``(CHARSET, LANGUAGE, VALUE)``. Observera att både ``CHARSET`` och ``LANGUAGE`` kan vara ``None``, i vilket fall du bör betrakta ``VALUE`` som kodat i ``us-ascii`` charset. Du kan vanligtvis ignorera ``LANGUAGE``.

source: If your application doesn't care whether the parameter was encoded as in :rfc:`2231`, you can collapse the parameter value by calling :func:`email.utils.collapse_rfc2231_value`, passing in the return value from :meth:`get_param`. This will return a suitably decoded Unicode string when the value is a tuple, or the original string unquoted if it isn't. For example::
sv: Om din applikation inte bryr sig om huruvida parametern kodades enligt :rfc:`2231`, kan du kollapsa parametervärdet genom att anropa :func:`email.utils.collapse_rfc2231_value` och skicka in returvärdet från :meth:`get_param`. Detta kommer att returnera en lämpligt avkodad Unicode-sträng när värdet är en tupel, eller originalsträngen utan citat om den inte är det. Till exempel::

source: In any case, the parameter value (either the returned string, or the ``VALUE`` item in the 3-tuple) is always unquoted, unless *unquote* is set to ``False``.
sv: I vilket fall som helst är parametervärdet (antingen den returnerade strängen eller ``VALUE``-objektet i 3-tupeln) alltid ociterat, såvida inte *unquote* är satt till ``False``.

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, its value will be replaced with *value*. If the :mailheader:`Content-Type` header as not yet been defined for this message, it will be set to :mimetype:`text/plain` and the new parameter value will be appended as per :rfc:`2045`.
sv: Ange en parameter i :mailheader:s `Content-Type`-rubrik. Om parametern redan finns i rubriken kommer dess värde att ersättas med *värde*. Om rubriken :mailheader:`Content-Type` ännu inte har definierats för detta meddelande, kommer den att sättas till :mimetype:`text/plain` och det nya parametervärdet kommer att läggas till enligt :rfc:`2045`.

source: Optional *header* specifies an alternative header to :mailheader:`Content-Type`, and all parameters will be quoted as necessary unless optional *requote* is ``False`` (the default is ``True``).
sv: Det valfria *header* anger ett alternativt huvud till :mailheader:`Content-Type`, och alla parametrar kommer att citeras vid behov om inte det valfria *requote* är ``False`` (standard är ``True``).

source: If optional *charset* is specified, the parameter will be encoded according to :rfc:`2231`. Optional *language* specifies the RFC 2231 language, defaulting to the empty string. Both *charset* and *language* should be strings.
sv: Om *charset* anges som tillval kommer parametern att kodas enligt :rfc:`2231`. Det valfria *language* anger RFC 2231-språket, med den tomma strängen som standard. Både *charset* och *language* bör vara strängar.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
sv: Om *replace* är ``False`` (standard) flyttas rubriken till slutet av listan med rubriker. Om *replace* är ``True`` kommer rubriken att uppdateras på plats.

source: ``replace`` keyword was added.
sv: nyckelordet ``replace`` har lagts till.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. All values will be quoted as necessary unless *requote* is ``False`` (the default is ``True``). Optional *header* specifies an alternative to :mailheader:`Content-Type`.
sv: Tar bort den angivna parametern helt från :mailheader:`Content-Type`-huvudet. Rubriken kommer att skrivas om på plats utan parametern eller dess värde. Alla värden kommer att citeras vid behov om inte *requote* är ``False`` (standard är ``True``). Valfria *header* anger ett alternativ till :mailheader:`Content-Type`.

source: Set the main type and subtype for the :mailheader:`Content-Type` header. *type* must be a string in the form :mimetype:`maintype/subtype`, otherwise a :exc:`ValueError` is raised.
sv: Anger huvudtyp och undertyp för rubriken :mailheader:`Content-Type`. *type* måste vara en sträng i formen :mimetype:`maintype/subtype`, annars uppstår ett :exc:`ValueError`.

source: This method replaces the :mailheader:`Content-Type` header, keeping all the parameters in place. If *requote* is ``False``, this leaves the existing header's quoting as is, otherwise the parameters will be quoted (the default).
sv: Denna metod ersätter :mailheader:`Content-Type`-headern och behåller alla parametrar på plats. Om *requote* är ``False``, lämnas den befintliga headerns citering som den är, annars kommer parametrarna att citeras (standard).

source: An alternative header can be specified in the *header* argument. When the :mailheader:`Content-Type` header is set a :mailheader:`MIME-Version` header is also added.
sv: Ett alternativt huvud kan anges i argumentet *header*. När rubriken :mailheader:`Content-Type` anges läggs även rubriken :mailheader:`MIME-Version` till.

source: This is a legacy method. On the :class:`~email.message.EmailMessage` class its functionality is replaced by the ``make_`` and ``add_`` methods.
sv: Detta är en äldre metod. I klassen :class:`~email.message.EmailMessage` ersätts dess funktionalitet av metoderna ``make_`` och ``add_``.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
sv: Returnerar värdet på parametern ``filename`` i :mailheader:`Content-Disposition`-rubriken i meddelandet. Om rubriken inte har någon parameter för ``filename``, går denna metod tillbaka till att leta efter parametern ``name`` i rubriken :mailheader:`Content-Type`. Om ingen av dessa hittas, eller om rubriken saknas, returneras *failobj*. Den returnerade strängen kommer alltid att vara ociterad enligt :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
sv: Returnerar värdet på parametern ``boundary`` i :mailheader:`Content-Type`-rubriken i meddelandet, eller *failobj* om rubriken saknas eller inte har någon parameter för ``boundary``. Den returnerade strängen kommer alltid att vara ociterad enligt :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
sv: Ställ in parametern ``boundary`` i rubriken :mailheader:`Content-Type` till *boundary*. :meth:`set_boundary` kommer alltid att citera *boundary* om det behövs. Ett :exc:`~email.errors.HeaderParseError` uppstår om meddelandeobjektet inte har något :mailheader:`Content-Type`-huvud.

source: Note that using this method is subtly different than deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers. However, it does *not* preserve any continuation lines which may have been present in the original :mailheader:`Content-Type` header.
sv: Observera att den här metoden är något annorlunda än att ta bort den gamla :mailheader:`Content-Type`-rubriken och lägga till en ny med den nya gränsen via :meth:`add_header`, eftersom :meth:`set_boundary` bevarar ordningen på :mailheader:`Content-Type`-rubriken i listan över rubriker. Den bevarar dock *inte* några fortsättningsrader som kan ha funnits i den ursprungliga :mailheader:`Content-Type`-rubriken.
