Repository: yeager/python-docs-sv
Catalog: library/exceptions.po
Languages: sv

source: Built-in Exceptions
sv: Inbyggda undantag

source: In Python, all exceptions must be instances of a class that derives from :class:`BaseException`. In a :keyword:`try` statement with an :keyword:`except` clause that mentions a particular class, that clause also handles any exception classes derived from that class (but not exception classes from which *it* is derived). Two exception classes that are not related via subclassing are never equivalent, even if they have the same name.
sv: I Python måste alla undantag vara instanser av en klass som härstammar från :class:`BaseException`. I en :keyword:`try`-sats med en :keyword:`except`-klausul som nämner en viss klass, hanterar den klausulen också alla undantagsklasser som härrör från den klassen (men inte undantagsklasser som *den* härrör från). Två undantagsklasser som inte är relaterade via subklassning är aldrig likvärdiga, även om de har samma namn.

source: The built-in exceptions listed in this chapter can be generated by the interpreter or built-in functions. Except where mentioned, they have an "associated value" indicating the detailed cause of the error. This may be a string or a tuple of several items of information (e.g., an error code and a string explaining the code). The associated value is usually passed as arguments to the exception class's constructor.
sv: De inbyggda undantagen som listas i detta kapitel kan genereras av tolken eller inbyggda funktioner. Förutom där det nämns har de ett "associerat värde" som anger den detaljerade orsaken till felet. Detta kan vara en sträng eller en tupel av flera informationsobjekt (t.ex. en felkod och en sträng som förklarar koden). Det associerade värdet skickas vanligtvis som argument till undantagsklassens konstruktor.

source: User code can raise built-in exceptions. This can be used to test an exception handler or to report an error condition "just like" the situation in which the interpreter raises the same exception; but beware that there is nothing to prevent user code from raising an inappropriate error.
sv: Användarkod kan skapa inbyggda undantag. Detta kan användas för att testa en undantagshanterare eller för att rapportera ett feltillstånd "precis som" den situation där tolken skapar samma undantag; men tänk på att det inte finns något som hindrar användarkoden från att skapa ett olämpligt fel.

source: The built-in exception classes can be subclassed to define new exceptions; programmers are encouraged to derive new exceptions from the :exc:`Exception` class or one of its subclasses, and not from :exc:`BaseException`. More information on defining exceptions is available in the Python Tutorial under :ref:`tut-userexceptions`.
sv: De inbyggda undantagsklasserna kan subklassas för att definiera nya undantag; programmerare uppmuntras att härleda nya undantag från klassen :exc:`Exception` eller någon av dess subklasser, och inte från :exc:`BaseException`. Mer information om hur man definierar undantag finns i Python Tutorial under :ref:`tut-userexceptions`.

source: Exception context
sv: Kontext för undantag

source: Three attributes on exception objects provide information about the context in which the exception was raised:
sv: Tre attribut på undantagsobjekt ger information om i vilket sammanhang undantaget uppstod:

source: When raising a new exception while another exception is already being handled, the new exception's :attr:`!__context__` attribute is automatically set to the handled exception. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used.
sv: När ett nytt undantag skapas medan ett annat undantag redan hanteras, sätts det nya undantagets :attr:`!__context__`-attribut automatiskt till det hanterade undantaget. Ett undantag kan hanteras när en :keyword:`except`- eller :keyword:`finally`-sats, eller en :keyword:`with`-sats, används.

source: This implicit exception context can be supplemented with an explicit cause by using :keyword:`!from` with :keyword:`raise`::
sv: Denna implicita undantagskontext kan kompletteras med en explicit orsak genom att använda :keyword:`!from` med :keyword:`raise`::

source: raise new_exc from original_exc
sv: höja new_exc från original_exc

source: The expression following :keyword:`from<raise>` must be an exception or ``None``. It will be set as :attr:`!__cause__` on the raised exception. Setting :attr:`!__cause__` also implicitly sets the :attr:`!__suppress_context__` attribute to ``True``, so that using ``raise new_exc from None`` effectively replaces the old exception with the new one for display purposes (e.g. converting :exc:`KeyError` to :exc:`AttributeError`), while leaving the old exception available in :attr:`!__context__` for introspection when debugging.
sv: Uttrycket som följer efter :keyword:`from<raise>` måste vara ett undantag eller ``None``. Det kommer att ställas in som :attr:`!__cause__` på det uppkomna undantaget. Att ställa in :attr:`!__cause__` ställer också implicit in :attr:`!__suppress_context__` attributet till ``True``, så att genom att använda ``raise new_exc from None`` ersätts effektivt det gamla undantaget med det nya för visningsändamål (t.ex. konvertera :exc:`KeyError` till :exc:`AttributeError`), medan det gamla undantaget lämnas tillgängligt i :attr:`!__context__` för introspektion vid felsökning.

source: The default traceback display code shows these chained exceptions in addition to the traceback for the exception itself. An explicitly chained exception in :attr:`!__cause__` is always shown when present. An implicitly chained exception in :attr:`!__context__` is shown only if :attr:`!__cause__` is :const:`None` and :attr:`!__suppress_context__` is false.
sv: Standardkoden för visning av spårning visar dessa kedjade undantag utöver spårningen av själva undantaget. Ett explicit kedjat undantag i :attr:`!__cause__` visas alltid när det finns. Ett implicit kedjat undantag i :attr:`!__context__` visas endast om :attr:`!__cause__` är :const:`None` och :attr:`!__suppress_context__` är false.

source: In either case, the exception itself is always shown after any chained exceptions so that the final line of the traceback always shows the last exception that was raised.
sv: I båda fallen visas alltid själva undantaget efter eventuella kedjade undantag, så att den sista raden i traceback alltid visar det sista undantaget som uppstod.

source: Inheriting from built-in exceptions
sv: Ärver från inbyggda undantag

source: User code can create subclasses that inherit from an exception type. It's recommended to only subclass one exception type at a time to avoid any possible conflicts between how the bases handle the ``args`` attribute, as well as due to possible memory layout incompatibilities.
sv: Användarkod kan skapa subklasser som ärver från en undantagstyp. Det rekommenderas att endast subklassa en undantagstyp åt gången för att undvika eventuella konflikter mellan hur baserna hanterar attributet ``args``, samt på grund av eventuella inkompatibiliteter i minneslayouten.

source: Most built-in exceptions are implemented in C for efficiency, see: :source:`Objects/exceptions.c`. Some have custom memory layouts which makes it impossible to create a subclass that inherits from multiple exception types. The memory layout of a type is an implementation detail and might change between Python versions, leading to new conflicts in the future. Therefore, it's recommended to avoid subclassing multiple exception types altogether.
sv: De flesta inbyggda undantag är implementerade i C för effektivitetens skull, se: :source:`Objects/exceptions.c`. Vissa har anpassade minneslayouter vilket gör det omöjligt att skapa en subklass som ärver från flera undantagstyper. Minneslayouten för en typ är en implementationsdetalj och kan ändras mellan Python-versioner, vilket leder till nya konflikter i framtiden. Därför rekommenderas det att undvika att underklassa flera undantagstyper helt och hållet.

source: Base classes
sv: Basklasser

source: The following exceptions are used mostly as base classes for other exceptions.
sv: Följande undantag används mest som basklasser för andra undantag.

source: The base class for all built-in exceptions. It is not meant to be directly inherited by user-defined classes (for that, use :exc:`Exception`). If :func:`str` is called on an instance of this class, the representation of the argument(s) to the instance are returned, or the empty string when there were no arguments.
sv: Basklassen för alla inbyggda undantag. Den är inte avsedd att ärvas direkt av användardefinierade klasser (för det, använd :exc:`Exception`). Om :func:`str` anropas på en instans av den här klassen returneras representationen av argumentet/argumenten till instansen, eller den tomma strängen om det inte fanns några argument.

source: The tuple of arguments given to the exception constructor. Some built-in exceptions (like :exc:`OSError`) expect a certain number of arguments and assign a special meaning to the elements of this tuple, while others are usually called only with a single string giving an error message.
sv: Den tupel av argument som ges till undantagskonstruktören. Vissa inbyggda undantag (som :exc:`OSError`) förväntar sig ett visst antal argument och tilldelar en speciell betydelse till elementen i denna tupel, medan andra vanligtvis bara anropas med en enda sträng som ger ett felmeddelande.

source: This method sets *tb* as the new traceback for the exception and returns the exception object. It was more commonly used before the exception chaining features of :pep:`3134` became available. The following example shows how we can convert an instance of ``SomeException`` into an instance of ``OtherException`` while preserving the traceback. Once raised, the current frame is pushed onto the traceback of the ``OtherException``, as would have happened to the traceback of the original ``SomeException`` had we allowed it to propagate to the caller. ::
sv: Den här metoden anger *tb* som ny traceback för undantaget och returnerar undantagsobjektet. Den användes oftare innan exception chaining-funktionerna i :pep:`3134` blev tillgängliga. Följande exempel visar hur vi kan konvertera en instans av ``SomeException`` till en instans av ``OtherException`` samtidigt som vi bevarar spårningen. När den väl har uppstått, skjuts den aktuella ramen till spårningen av ``OtherException``, vilket skulle ha hänt med spårningen av den ursprungliga ``SomeException`` om vi hade tillåtit den att fortplanta sig till den som anropar. ::

source: try: ... except SomeException: tb = sys.exception().__traceback__ raise OtherException(...).with_traceback(tb)
sv: försök: ... except SomeException: tb = sys.exception().__traceback__ raise AnnanAttent(...).med_traceback(tb)

source: A writable field that holds the :ref:`traceback object <traceback-objects>` associated with this exception. See also: :ref:`raise`.
sv: Ett skrivbart fält som innehåller :ref:`traceback-objektet <traceback-objects>` som är associerat med detta undantag. Se även: :ref:`raise`.

source: Add the string ``note`` to the exception's notes which appear in the standard traceback after the exception string. A :exc:`TypeError` is raised if ``note`` is not a string.
sv: Lägg till strängen ``note`` i undantagets anteckningar som visas i standardåterrapporteringen efter undantagssträngen. Ett :exc:`TypeError` uppstår om ``note`` inte är en sträng.

source: A list of the notes of this exception, which were added with :meth:`add_note`. This attribute is created when :meth:`add_note` is called.
sv: En lista över anteckningarna för detta undantag, som lades till med :meth:`add_note`. Detta attribut skapas när :meth:`add_note` anropas.

source: All built-in, non-system-exiting exceptions are derived from this class. All user-defined exceptions should also be derived from this class.
sv: Alla inbyggda undantag som inte är systemundantag härrör från denna klass. Alla användardefinierade undantag bör också härledas från denna klass.

source: The base class for those built-in exceptions that are raised for various arithmetic errors: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.
sv: Basklass för de inbyggda undantag som uppstår vid olika aritmetiska fel: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.

source: Raised when a :ref:`buffer <bufferobjects>` related operation cannot be performed.
sv: Uppstår när en :ref:`buffer <bufferobjects>`-relaterad åtgärd inte kan utföras.

source: The base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid: :exc:`IndexError`, :exc:`KeyError`. This can be raised directly by :func:`codecs.lookup`.
sv: Basklassen för de undantag som uppstår när en nyckel eller ett index som används i en mappning eller sekvens är ogiltigt: :exc:`IndexError`, :exc:`KeyError`. Detta kan tas upp direkt av :func:`codecs.lookup`.

source: Concrete exceptions
sv: Betongundantag

source: The following exceptions are the exceptions that are usually raised.
sv: Följande undantag är de undantag som vanligtvis tas upp.

source: Raised when an :keyword:`assert` statement fails.
sv: Uppstår när en :keyword:`assert`-sats misslyckas.

source: Raised when an attribute reference (see :ref:`attribute-references`) or assignment fails. (When an object does not support attribute references or attribute assignments at all, :exc:`TypeError` is raised.)
sv: Utlöses när en attributreferens (se :ref:`attribut-referenser`) eller attributtilldelning misslyckas. (När ett objekt inte stöder attributreferenser eller attributtilldelningar alls, genereras :exc:`TypeError`)

source: The optional *name* and *obj* keyword-only arguments set the corresponding attributes:
sv: De valfria argumenten *name* och *obj*, som endast innehåller nyckelord, anger motsvarande attribut:

source: The name of the attribute that was attempted to be accessed.
sv: Namnet på det attribut som man försökte få åtkomst till.

source: The object that was accessed for the named attribute.
sv: Det objekt som användes för det namngivna attributet.

source: Added the :attr:`name` and :attr:`obj` attributes.
sv: Lagt till attributen :attr:`name` och :attr:`obj`.

source: Raised when the :func:`input` function hits an end-of-file condition (EOF) without reading any data. (Note: the :meth:`!io.IOBase.read` and :meth:`io.IOBase.readline` methods return an empty string when they hit EOF.)
sv: Utlöses när funktionen :func:`input` träffar ett filändsvillkor (EOF) utan att läsa några data. (Obs: metoderna :meth:`!io.IOBase.read` och :meth:`io.IOBase.readline` returnerar en tom sträng när de träffar EOF)

source: Not currently used.
sv: Används inte för närvarande.

source: Raised when a :term:`generator` or :term:`coroutine` is closed; see :meth:`generator.close` and :meth:`coroutine.close`. It directly inherits from :exc:`BaseException` instead of :exc:`Exception` since it is technically not an error.
sv: Uppstår när en :term:`generator` eller :term:`coroutine` stängs; se :meth:`generator.close` och :meth:`coroutine.close`. Den ärver direkt från :exc:`BaseException` istället för :exc:`Exception` eftersom det tekniskt sett inte är ett fel.

source: Raised when the :keyword:`import` statement has troubles trying to load a module. Also raised when the "from list" in ``from ... import`` has a name that cannot be found.
sv: Utlöses när :keyword:`import`-satsen har problem med att ladda en modul. Uppstår också när "from-listan" i ``from ... import`` har ett namn som inte kan hittas.

source: The optional *name* and *path* keyword-only arguments set the corresponding attributes:
sv: De valfria argumenten *name* och *path*, som endast innehåller nyckelord, anger motsvarande attribut:

source: The name of the module that was attempted to be imported.
sv: Namnet på den modul som man försökte importera.

source: The path to any file which triggered the exception.
sv: Sökvägen till den fil som utlöste undantaget.

source: Added the :attr:`name` and :attr:`path` attributes.
sv: Lagt till attributen :attr:`name` och :attr:`path`.

source: A subclass of :exc:`ImportError` which is raised by :keyword:`import` when a module could not be located. It is also raised when ``None`` is found in :data:`sys.modules`.
sv: En underklass till :exc:`ImportError` som skapas av :keyword:`import` när en modul inte kunde hittas. Det visas också när ``None`` hittas i :data:`sys.modules`.

source: Raised when a sequence subscript is out of range. (Slice indices are silently truncated to fall in the allowed range; if an index is not an integer, :exc:`TypeError` is raised.)
sv: Uppstår när ett sekvenssubskript är utanför intervallet. (Slice-index trunkeras i tysthet för att hamna inom det tillåtna intervallet; om ett index inte är ett heltal väcks :exc:`TypeError`)

source: Raised when a mapping (dictionary) key is not found in the set of existing keys.
sv: Utlöses när en mappningsnyckel (ordbok) inte finns i uppsättningen av befintliga nycklar.

source: Raised when the user hits the interrupt key (normally :kbd:`Control-C` or :kbd:`Delete`). During execution, a check for interrupts is made regularly. The exception inherits from :exc:`BaseException` so as to not be accidentally caught by code that catches :exc:`Exception` and thus prevent the interpreter from exiting.
sv: Uppstår när användaren trycker på avbrottstangenten (normalt :kbd:`Control-C` eller :kbd:`Delete`). Under exekveringen görs regelbundet en kontroll av avbrott. Undantaget ärver från :exc:`BaseException` så att det inte av misstag fångas upp av kod som fångar upp :exc:`Exception` och därmed hindrar tolken från att avsluta.

source: Catching a :exc:`KeyboardInterrupt` requires special consideration. Because it can be raised at unpredictable points, it may, in some circumstances, leave the running program in an inconsistent state. It is generally best to allow :exc:`KeyboardInterrupt` to end the program as quickly as possible or avoid raising it entirely. (See :ref:`handlers-and-exceptions`.)
sv: Att fånga ett :exc:`KeyboardInterrupt` kräver särskild hänsyn. Eftersom den kan utlösas vid oförutsägbara tidpunkter kan den under vissa omständigheter lämna det pågående programmet i ett inkonsekvent tillstånd. Det är i allmänhet bäst att låta :exc:`KeyboardInterrupt` avsluta programmet så snabbt som möjligt eller helt undvika att utlösa det. (Se :ref:`handlers-and-exceptions`.)

source: Raised when an operation runs out of memory but the situation may still be rescued (by deleting some objects). The associated value is a string indicating what kind of (internal) operation ran out of memory. Note that because of the underlying memory management architecture (C's :c:func:`malloc` function), the interpreter may not always be able to completely recover from this situation; it nevertheless raises an exception so that a stack traceback can be printed, in case a run-away program was the cause.
sv: Utlöses när en operation får slut på minne men situationen fortfarande kan räddas (genom att radera vissa objekt). Det associerade värdet är en sträng som anger vilken typ av (intern) operation som fick slut på minne. Observera att på grund av den underliggande minneshanteringsarkitekturen (C:s :c:func:`malloc`-funktion) kan tolken kanske inte alltid helt återhämta sig från denna situation; den väcker ändå ett undantag så att en stackspårning kan skrivas ut, ifall ett skenande program var orsaken.

source: Raised when a local or global name is not found. This applies only to unqualified names. The associated value is an error message that includes the name that could not be found.
sv: Utlöses när ett lokalt eller globalt namn inte hittas. Detta gäller endast okvalificerade namn. Det associerade värdet är ett felmeddelande som innehåller det namn som inte kunde hittas.

source: The optional *name* keyword-only argument sets the attribute:
sv: Det valfria argumentet *name* keyword-only anger attributet:

source: The name of the variable that was attempted to be accessed.
sv: Namnet på den variabel som man försökte få åtkomst till.

source: Added the :attr:`name` attribute.
sv: Lagt till attributet :attr:`name`.

source: This exception is derived from :exc:`RuntimeError`. In user defined base classes, abstract methods should raise this exception when they require derived classes to override the method, or while the class is being developed to indicate that the real implementation still needs to be added.
sv: Detta undantag härrör från :exc:`RuntimeError`. I användardefinierade basklasser bör abstrakta metoder ge upphov till detta undantag när de kräver att härledda klasser åsidosätter metoden, eller medan klassen utvecklas för att indikera att den verkliga implementationen fortfarande behöver läggas till.

source: It should not be used to indicate that an operator or method is not meant to be supported at all -- in that case either leave the operator / method undefined or, if a subclass, set it to :data:`None`.
sv: Det ska inte användas för att ange att en operator eller metod inte ska stödjas alls - i så fall ska operatorn/metoden antingen lämnas odefinierad eller, om det är en subklass, anges till :data:`None`.

source: :exc:`!NotImplementedError` and :data:`!NotImplemented` are not interchangeable. This exception should only be used as described above; see :data:`NotImplemented` for details on correct usage of the built-in constant.
sv: :exc:`!NotImplementedError` och :data:`!NotImplemented` är inte utbytbara. Detta undantag bör endast användas enligt beskrivningen ovan; se :data:`NotImplemented` för detaljer om korrekt användning av den inbyggda konstanten.

source: This exception is raised when a system function returns a system-related error, including I/O failures such as "file not found" or "disk full" (not for illegal argument types or other incidental errors).
sv: Detta undantag uppstår när en systemfunktion returnerar ett systemrelaterat fel, inklusive I/O-fel som "file not found" eller "disk full" (inte för olagliga argumenttyper eller andra tillfälliga fel).

source: The second form of the constructor sets the corresponding attributes, described below. The attributes default to :const:`None` if not specified. For backwards compatibility, if three arguments are passed, the :attr:`~BaseException.args` attribute contains only a 2-tuple of the first two constructor arguments.
sv: Den andra formen av konstruktorn ställer in motsvarande attribut, som beskrivs nedan. Attributen har som standard :const:`None` om de inte specificeras. För bakåtkompatibilitet, om tre argument skickas, innehåller attributet :attr:`~BaseException.args` endast en 2-tupel av de två första konstruktörsargumenten.

source: The constructor often actually returns a subclass of :exc:`OSError`, as described in `OS exceptions`_ below. The particular subclass depends on the final :attr:`.errno` value. This behaviour only occurs when constructing :exc:`OSError` directly or via an alias, and is not inherited when subclassing.
sv: Konstruktorn returnerar ofta faktiskt en underklass av :exc:`OSError`, som beskrivs i `OS-undantag`_ nedan. Den specifika underklassen beror på det slutliga :attr:`.errno`-värdet. Detta beteende uppstår endast när man konstruerar :exc:`OSError` direkt eller via ett alias, och ärvs inte vid subklassning.

source: A numeric error code from the C variable :c:data:`errno`.
sv: En numerisk felkod från C-variabeln :c:data:`errno`.

source: Under Windows, this gives you the native Windows error code. The :attr:`.errno` attribute is then an approximate translation, in POSIX terms, of that native error code.
sv: Under Windows ger detta dig den ursprungliga Windows-felkoden. Attributet :attr:`.errno` är då en ungefärlig översättning, i POSIX-termer, av den ursprungliga felkoden.
