Repository: yeager/python-docs-sv
Catalog: library/exceptions.po
Languages: sv

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is refused by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.
sv: En underklass till :exc:`ConnectionError`, som uppstår när ett anslutningsförsök nekas av motparten. Motsvarar :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection is reset by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNRESET`.
sv: En underklass till :exc:`ConnectionError`, som uppstår när en anslutning återställs av motparten. Motsvarar :c:data:`errno` :py:const:`~errno.ECONNRESET`.

source: Raised when trying to create a file or directory which already exists. Corresponds to :c:data:`errno` :py:const:`~errno.EEXIST`.
sv: Utlöses när man försöker skapa en fil eller katalog som redan finns. Motsvarar :c:data:`errno` :py:const:`~errno.EEXIST`.

source: Raised when a file or directory is requested but doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ENOENT`.
sv: Utlöses när en fil eller katalog begärs men inte finns. Motsvarar :c:data:`errno` :py:const:`~errno.ENOENT`.

source: Raised when a system call is interrupted by an incoming signal. Corresponds to :c:data:`errno` :py:const:`~errno.EINTR`.
sv: Utlöses när ett systemanrop avbryts av en inkommande signal. Motsvarar :c:data:`errno` :py:const:`~errno.EINTR`.

source: Python now retries system calls when a syscall is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
sv: Python gör nu om systemanrop när ett syscall avbryts av en signal, utom om signalhanteraren gör ett undantag (se :pep:`475` för motivering), istället för att göra :exc:`InterruptedError`.

source: Raised when a file operation (such as :func:`os.remove`) is requested on a directory. Corresponds to :c:data:`errno` :py:const:`~errno.EISDIR`.
sv: Utlöses när en filoperation (t.ex. :func:`os.remove`) begärs på en katalog. Motsvarar :c:data:`errno` :py:const:`~errno.EISDIR`.

source: Raised when a directory operation (such as :func:`os.listdir`) is requested on something which is not a directory. On most POSIX platforms, it may also be raised if an operation attempts to open or traverse a non-directory file as if it were a directory. Corresponds to :c:data:`errno` :py:const:`~errno.ENOTDIR`.
sv: Utlöses när en katalogoperation (t.ex. :func:`os.listdir`) begärs på något som inte är en katalog. På de flesta POSIX-plattformar kan det också uppstå om en åtgärd försöker öppna eller gå igenom en fil som inte är en katalog som om den vore en katalog. Motsvarar :c:data:`errno` :py:const:`~errno.ENOTDIR`.

source: Raised when trying to run an operation without the adequate access rights - for example filesystem permissions. Corresponds to :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM`, and :py:const:`~errno.ENOTCAPABLE`.
sv: Utlöses när man försöker köra en operation utan tillräckliga rättigheter - till exempel filsystembehörighet. Motsvarar :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM`, och :py:const:`~errno.ENOTCAPABLE`.

source: WASI's :py:const:`~errno.ENOTCAPABLE` is now mapped to :exc:`PermissionError`.
sv: WASI:s :py:const:`~errno.ENOTCAPABLE` mappas nu till :exc:`PermissionError`.

source: Raised when a given process doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ESRCH`.
sv: Utlöses när en viss process inte existerar. Motsvarar :c:data:`errno` :py:const:`~errno.ESRCH`.

source: Raised when a system function timed out at the system level. Corresponds to :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.
sv: Utlöses när en systemfunktion timade ut på systemnivå. Motsvarar :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.

source: All the above :exc:`OSError` subclasses were added.
sv: Alla ovanstående :exc:`OSError`-subklasser lades till.

source: :pep:`3151` - Reworking the OS and IO exception hierarchy
sv: :pep:`3151` - Omarbetning av undantagshierarkin för OS och IO

source: Warnings
sv: Varningar

source: The following exceptions are used as warning categories; see the :ref:`warning-categories` documentation for more details.
sv: Följande undantag används som varningskategorier; se :ref:`warning-categories`-dokumentationen för mer information.

source: Base class for warning categories.
sv: Basklass för varningskategorier.

source: Base class for warnings generated by user code.
sv: Basklass för varningar som genereras av användarkod.

source: Base class for warnings about deprecated features when those warnings are intended for other Python developers.
sv: Basklass för varningar om föråldrade funktioner när dessa varningar är avsedda för andra Python-utvecklare.

source: Ignored by the default warning filters, except in the ``__main__`` module (:pep:`565`). Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
sv: Ignoreras av standardvarningsfiltren, utom i modulen ``__main__`` (:pep:`565``). Om du aktiverar :ref:``Python Development Mode <devmode>`` visas denna varning.

source: The deprecation policy is described in :pep:`387`.
sv: Policyn för utfasning beskrivs i :pep:`387`.

source: Base class for warnings about features which are obsolete and expected to be deprecated in the future, but are not deprecated at the moment.
sv: Basklass för varningar om funktioner som är föråldrade och förväntas bli utdaterade i framtiden, men som inte är utdaterade för tillfället.

source: This class is rarely used as emitting a warning about a possible upcoming deprecation is unusual, and :exc:`DeprecationWarning` is preferred for already active deprecations.
sv: Denna klass används sällan eftersom det är ovanligt att skicka ut en varning om en eventuell kommande deprecation, och :exc:`DeprecationWarning` föredras för redan aktiva deprecations.

source: Ignored by the default warning filters. Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
sv: Ignoreras av standardvarningsfiltren. Om du aktiverar :ref:`Python Development Mode <devmode>` visas den här varningen.

source: Base class for warnings about dubious syntax.
sv: Basklass för varningar om tvivelaktig syntax.

source: Base class for warnings about dubious runtime behavior.
sv: Basklass för varningar om tvivelaktigt beteende under körtid.

source: Base class for warnings about deprecated features when those warnings are intended for end users of applications that are written in Python.
sv: Basklass för varningar om föråldrade funktioner när dessa varningar är avsedda för slutanvändare av program som är skrivna i Python.

source: Base class for warnings about probable mistakes in module imports.
sv: Basklass för varningar om troliga misstag i modulimporten.

source: Base class for warnings related to Unicode.
sv: Basklass för varningar relaterade till Unicode.

source: Base class for warnings related to encodings.
sv: Basklass för varningar relaterade till kodning.

source: See :ref:`io-encoding-warning` for details.
sv: Se :ref:`io-encoding-warning` för mer information.

source: Base class for warnings related to :class:`bytes` and :class:`bytearray`.
sv: Basklass för varningar relaterade till :class:`bytes` och :class:`bytearray`.

source: Base class for warnings related to resource usage.
sv: Basklass för varningar relaterade till resursanvändning.

source: Exception groups
sv: Undantagsgrupper

source: The following are used when it is necessary to raise multiple unrelated exceptions. They are part of the exception hierarchy so they can be handled with :keyword:`except` like all other exceptions. In addition, they are recognised by :keyword:`except*<except_star>`, which matches their subgroups based on the types of the contained exceptions.
sv: Följande används när det är nödvändigt att skapa flera orelaterade undantag. De är en del av undantagshierarkin så de kan hanteras med :keyword:`except` som alla andra undantag. Dessutom känns de igen av :keyword:`except*<except_star>`, som matchar deras undergrupper baserat på typerna av de undantag som ingår.

source: Both of these exception types wrap the exceptions in the sequence ``excs``. The ``msg`` parameter must be a string. The difference between the two classes is that :exc:`BaseExceptionGroup` extends :exc:`BaseException` and it can wrap any exception, while :exc:`ExceptionGroup` extends :exc:`Exception` and it can only wrap subclasses of :exc:`Exception`. This design is so that ``except Exception`` catches an :exc:`ExceptionGroup` but not :exc:`BaseExceptionGroup`.
sv: Båda dessa undantagstyper packar in undantagen i sekvensen ``excs``. Parametern ``msg`` måste vara en sträng. Skillnaden mellan de två klasserna är att :exc:`BaseExceptionGroup` extenderar :exc:`BaseException` och kan fånga alla undantag, medan :exc:`ExceptionGroup` extenderar :exc:`Exception` och bara kan fånga subklasser av :exc:`Exception`. Denna design är så att ``except Exception`` fångar en :exc:`ExceptionGroup` men inte :exc:`BaseExceptionGroup`.

source: The :exc:`BaseExceptionGroup` constructor returns an :exc:`ExceptionGroup` rather than a :exc:`BaseExceptionGroup` if all contained exceptions are :exc:`Exception` instances, so it can be used to make the selection automatic. The :exc:`ExceptionGroup` constructor, on the other hand, raises a :exc:`TypeError` if any contained exception is not an :exc:`Exception` subclass.
sv: Konstruktören :exc:`BaseExceptionGroup` returnerar en :exc:`ExceptionGroup` i stället för en :exc:`BaseExceptionGroup` om alla undantag som ingår är :exc:`Exception`-instanser, så den kan användas för att göra urvalet automatiskt. Konstruktören för :exc:`ExceptionGroup`, å andra sidan, ger upphov till ett :exc:`TypeError` om något undantag som ingår inte är en underklass till :exc:`Exception`.

source: The ``msg`` argument to the constructor. This is a read-only attribute.
sv: Argumentet ``msg`` till konstruktören. Detta är ett skrivskyddat attribut.

source: A tuple of the exceptions in the ``excs`` sequence given to the constructor. This is a read-only attribute.
sv: En tupel av undantagen i sekvensen ``excs`` som ges till konstruktören. Detta är ett skrivskyddat attribut.

source: Returns an exception group that contains only the exceptions from the current group that match *condition*, or ``None`` if the result is empty.
sv: Returnerar en undantagsgrupp som bara innehåller de undantag från den aktuella gruppen som matchar *villkor*, eller ``None`` om resultatet är tomt.

source: The condition can be an exception type or tuple of exception types, in which case each exception is checked for a match using the same check that is used in an ``except`` clause. The condition can also be a callable (other than a type object) that accepts an exception as its single argument and returns true for the exceptions that should be in the subgroup.
sv: Villkoret kan vara en undantagstyp eller en tupel av undantagstyper, i vilket fall varje undantag kontrolleras för matchning med samma kontroll som används i en ``except``-klausul. Villkoret kan också vara en callable (annat än ett typobjekt) som accepterar ett undantag som enda argument och returnerar true för de undantag som bör ingå i undergruppen.

source: The nesting structure of the current exception is preserved in the result, as are the values of its :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields. Empty nested groups are omitted from the result.
sv: Det aktuella undantagets nestningsstruktur bevaras i resultatet, liksom värdena i fälten :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` och :attr:`~BaseException.__notes__`. Tomma nästlade grupper utelämnas från resultatet.

source: The condition is checked for all exceptions in the nested exception group, including the top-level and any nested exception groups. If the condition is true for such an exception group, it is included in the result in full.
sv: Villkoret kontrolleras för alla undantag i den nästlade undantagsgruppen, inklusive den översta nivån och alla nästlade undantagsgrupper. Om villkoret är sant för en sådan undantagsgrupp ingår den i resultatet i sin helhet.

source: ``condition`` can be any callable which is not a type object.
sv: ``condition`` kan vara vilken callable som helst som inte är ett typobjekt.

source: Like :meth:`subgroup`, but returns the pair ``(match, rest)`` where ``match`` is ``subgroup(condition)`` and ``rest`` is the remaining non-matching part.
sv: Som :meth:`subgroup`, men returnerar paret ``(match, rest)`` där ``match`` är ``subgroup(condition)`` och ``rest`` är den återstående icke-matchande delen.

source: Returns an exception group with the same :attr:`message`, but which wraps the exceptions in ``excs``.
sv: Returnerar en undantagsgrupp med samma :attr:`message`, men som omsluter undantagen i ``excs``.

source: This method is used by :meth:`subgroup` and :meth:`split`, which are used in various contexts to break up an exception group. A subclass needs to override it in order to make :meth:`subgroup` and :meth:`split` return instances of the subclass rather than :exc:`ExceptionGroup`.
sv: Den här metoden används av :meth:`subgroup` och :meth:`split`, som används i olika sammanhang för att bryta upp en undantagsgrupp. En subklass måste åsidosätta den för att få :meth:`subgroup` och :meth:`split` att returnera instanser av subklassen istället för :exc:`ExceptionGroup`.

source: :meth:`subgroup` and :meth:`split` copy the :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields from the original exception group to the one returned by :meth:`derive`, so these fields do not need to be updated by :meth:`derive`.
sv: :meth:`subgroup` och :meth:`split` kopierar fälten :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` och :attr:`~BaseException.__notes__` från den ursprungliga undantagsgruppen till den som returneras av :meth:`derive`, så dessa fält behöver inte uppdateras av :meth:`derive`.

source: >>> class MyGroup(ExceptionGroup): ... def derive(self, excs): ... return MyGroup(self.message, excs) ... >>> e = MyGroup("eg", [ValueError(1), TypeError(2)]) >>> e.add_note("a note") >>> e.__context__ = Exception("context") >>> e.__cause__ = Exception("cause") >>> try: ... raise e ... except Exception as e: ... exc = e ... >>> match, rest = exc.split(ValueError) >>> exc, exc.__context__, exc.__cause__, exc.__notes__ (MyGroup('eg', [ValueError(1), TypeError(2)]), Exception('context'), Exception('cause'), ['a note']) >>> match, match.__context__, match.__cause__, match.__notes__ (MyGroup('eg', [ValueError(1)]), Exception('context'), Exception('cause'), ['a note']) >>> rest, rest.__context__, rest.__cause__, rest.__notes__ (MyGroup('eg', [TypeError(2)]), Exception('context'), Exception('cause'), ['a note']) >>> exc.__traceback__ is match.__traceback__ is rest.__traceback__ True
sv: >>> klass MyGroup(ExceptionGroup): ... def derive(self, excs): ... return MyGroup(self.message, excs) ... >>> e = MyGroup("eg", [ValueError(1), TypeError(2)]) >>> e.add_note("en anteckning") >>> e.__kontext__ = Undantag("kontext") >>> e.__cause__ = Undantag("orsak") >>> försök: ... raise e ... except Exception as e: ... exc = e ... >>> match, rest = exc.split(ValueError) >>> exc, exc.__kontext__, exc.__orsak__, exc.__noter__ (MyGroup('eg', [ValueError(1), TypeError(2)]), Exception('context'), Exception('cause'), ['a note']) >>> match, match.__kontext__, match.__orsak__, match.__noter__ (MyGroup('eg', [ValueError(1)]), Exception('context'), Exception('cause'), ['a note']) >>> rest, rest.__kontext__, rest.__orsak__, rest.__noter__ (MyGroup('eg', [TypeError(2)]), Exception('context'), Exception('cause'), ['a note']) >>> exc.__traceback__ är match.__traceback__ är rest.__traceback__ Sant

source: Note that :exc:`BaseExceptionGroup` defines :meth:`~object.__new__`, so subclasses that need a different constructor signature need to override that rather than :meth:`~object.__init__`. For example, the following defines an exception group subclass which accepts an exit_code and constructs the group's message from it. ::
sv: Observera att :exc:`BaseExceptionGroup` definierar :meth:`~object.__new__`, så underklasser som behöver en annan konstruktörsignatur måste åsidosätta den i stället för :meth:`~object.__init__`. Följande definierar till exempel en exception group-underklass som tar emot en exit_code och konstruerar gruppens meddelande utifrån den. ::

source: class Errors(ExceptionGroup): def __new__(cls, errors, exit_code): self = super().__new__(Errors, f"exit code: {exit_code}", errors) self.exit_code = exit_code return self def derive(self, excs): return Errors(excs, self.exit_code)
sv: class Errors(ExceptionGroup): def __new__(cls, errors, exit_code): self = super().__new__(Errors, f"utgångskod: {exit_code}", errors) self.exit_code = exit_code return self def derive(self, excs): return Errors(excs, self.exit_code)

source: Like :exc:`ExceptionGroup`, any subclass of :exc:`BaseExceptionGroup` which is also a subclass of :exc:`Exception` can only wrap instances of :exc:`Exception`.
sv: Liksom :exc:`ExceptionGroup` kan en subklass av :exc:`BaseExceptionGroup` som också är en subklass av :exc:`Exception` bara omsluta instanser av :exc:`Exception`.

source: Exception hierarchy
sv: Undantagshierarki

source: The class hierarchy for built-in exceptions is:
sv: Klasshierarkin för inbyggda undantag är:

source: BaseException ├── BaseExceptionGroup ├── GeneratorExit ├── KeyboardInterrupt ├── SystemExit └── Exception ├── ArithmeticError │ ├── FloatingPointError │ ├── OverflowError │ └── ZeroDivisionError ├── AssertionError ├── AttributeError ├── BufferError ├── EOFError ├── ExceptionGroup [BaseExceptionGroup] ├── ImportError │ └── ModuleNotFoundError ├── LookupError │ ├── IndexError │ └── KeyError ├── MemoryError ├── NameError │ └── UnboundLocalError ├── OSError │ ├── BlockingIOError │ ├── ChildProcessError │ ├── ConnectionError │ │ ├── BrokenPipeError │ │ ├── ConnectionAbortedError │ │ ├── ConnectionRefusedError │ │ └── ConnectionResetError │ ├── FileExistsError │ ├── FileNotFoundError │ ├── InterruptedError │ ├── IsADirectoryError │ ├── NotADirectoryError │ ├── PermissionError │ ├── ProcessLookupError │ └── TimeoutError ├── ReferenceError ├── RuntimeError │ ├── NotImplementedError │ ├── PythonFinalizationError │ └── RecursionError ├── StopAsyncIteration ├── StopIteration ├── SyntaxError │ └── IndentationError │ └── TabError ├── SystemError ├── TypeError ├── ValueError │ └── UnicodeError │ ├── UnicodeDecodeError │ ├── UnicodeEncodeError │ └── UnicodeTranslateError └── Warning ├── BytesWarning ├── DeprecationWarning ├── EncodingWarning ├── FutureWarning ├── ImportWarning ├── PendingDeprecationWarning ├── ResourceWarning ├── RuntimeWarning ├── SyntaxWarning ├── UnicodeWarning └── UserWarning
sv: BaseException ├── BaseExceptionGroup ├─── GeneratorExit keyboardInterrupt ├── SystemExit └── Undantag aritmetiskt fel (ArithmeticError) │ ├── FloatingPointError │ ├── Överflödesfel │ └── NollDivisionsFel ├── AssertionError ├── AttributFel ├── Buffertfel ├── EOFError ├── ExceptionGroup [BaseExceptionGroup] ├── ImportFel │ └── ModulFinnsInteFel ├── LookupError │ ├── IndexError │ └── KeyError ├─── MemoryError ├── NamnFel │ └── ObundetLokaltFel ├── OSError │ ├── BlockerandeIOFel │ ├── ChildProcessError │ ├── AnslutningFel │ │ ├── BrokenPipeError │ │ ├── ConnectionAbortedError │ │ ├── ConnectionRefusedError │ │ └── ConnectionResetError │ ├── FileExistsError │ ├── FileNotFoundError │ ├── AvbrutetFel │ ├── IsADirectoryError │ ├── InteADirectoryError │ ├── PermissionError │ ├── ProcessLookupError │ └── TimeoutError ├── ReferensFel ├── RuntimeError │ ├── InteImplementeratFel │ ├── PythonFinalizationError │ └── Rekursionsfel ├── StopAsyncIteration ├── StopIteration ├── SyntaxFel │ └── Indragningsfel │ └── TabError ├─── Systemfel ├── TypeError ├── VärdeFel │ └── UnicodeFel │ ├── UnicodeDecodeError │ ├── UnicodeEncodeError │ └── UnicodeTranslateError └── Varning bytesvarning ├── Avvecklingsvarning kodningsvarning ├── Framtida varning ├── Importvarning ├── VäntarPåAvvecklingVarning ├── Resursvarning runtimeWarning syntaxvarning unicodeWarning └── Användarvarning

source: statement
sv: uttalande

source: try
sv: försök

source: except
sv: utom

source: raise
sv: höja

source: exception
sv: undantag

source: chaining
sv: kedja

source: __cause__ (exception attribute)
sv: __cause__ (attribut för undantag)

source: __context__ (exception attribute)
sv: __kontext__ (undantagsattribut)

source: __suppress_context__ (exception attribute)
sv: __suppress_context__ (undantagsattribut)

source: module
sv: modul
