Repository: yeager/python-docs-sv
Catalog: library/exceptions.po
Languages: sv

source: Under Windows, if the *winerror* constructor argument is an integer, the :attr:`.errno` attribute is determined from the Windows error code, and the *errno* argument is ignored. On other platforms, the *winerror* argument is ignored, and the :attr:`winerror` attribute does not exist.
sv: Under Windows, om konstruktörsargumentet *winerror* är ett heltal, bestäms attributet :attr:`.errno` från Windows felkod och argumentet *errno* ignoreras. På andra plattformar ignoreras *winerror*-argumentet och attributet :attr:`winerror` existerar inte.

source: The corresponding error message, as provided by the operating system. It is formatted by the C functions :c:func:`!perror` under POSIX, and :c:func:`!FormatMessage` under Windows.
sv: Det motsvarande felmeddelandet, som tillhandahålls av operativsystemet. Det formateras av C-funktionerna :c:func:`!perror` under POSIX och :c:func:`!FormatMessage` under Windows.

source: For exceptions that involve a file system path (such as :func:`open` or :func:`os.unlink`), :attr:`filename` is the file name passed to the function. For functions that involve two file system paths (such as :func:`os.rename`), :attr:`filename2` corresponds to the second file name passed to the function.
sv: För undantag som involverar en filsystemssökväg (t.ex. :func:`open` eller :func:`os.unlink`) är :attr:`filename` det filnamn som skickas till funktionen. För funktioner som involverar två filsystemssökvägar (t.ex. :func:`os.rename`) motsvarar :attr:`filename2` det andra filnamnet som skickas till funktionen.

source: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` and :exc:`!mmap.error` have been merged into :exc:`OSError`, and the constructor may return a subclass.
sv: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` och :exc:`!mmap.error` har slagits samman till :exc:`OSError`, och konstruktören kan returnera en underklass.

source: The :attr:`filename` attribute is now the original file name passed to the function, instead of the name encoded to or decoded from the :term:`filesystem encoding and error handler`. Also, the *filename2* constructor argument and attribute was added.
sv: Attributet :attr:`filename` är nu det ursprungliga filnamnet som skickas till funktionen, istället för det namn som kodats till eller avkodats från :term:`filsystem encoding and error handler`. Dessutom har konstruktörsargumentet och attributet *filename2* lagts till.

source: Raised when the result of an arithmetic operation is too large to be represented. This cannot occur for integers (which would rather raise :exc:`MemoryError` than give up). However, for historical reasons, OverflowError is sometimes raised for integers that are outside a required range. Because of the lack of standardization of floating-point exception handling in C, most floating-point operations are not checked.
sv: Utlöses när resultatet av en aritmetisk operation är för stort för att kunna representeras. Detta kan inte inträffa för heltal (som hellre ger upphov till :exc:`MemoryError` än ger upp). Av historiska skäl visas dock ibland OverflowError för heltal som ligger utanför ett önskat intervall. På grund av bristen på standardisering av undantagshantering för flyttal i C kontrolleras inte de flesta flyttalsoperationer.

source: This exception is derived from :exc:`RuntimeError`. It is raised when an operation is blocked during interpreter shutdown also known as :term:`Python finalization <interpreter shutdown>`.
sv: Detta undantag härstammar från :exc:`RuntimeError`. Det uppstår när en operation blockeras under nedstängning av tolken, även känt som :term:`Python finalization <interpreter shutdown>`.

source: Examples of operations which can be blocked with a :exc:`PythonFinalizationError` during the Python finalization:
sv: Exempel på operationer som kan blockeras med ett :exc:`PythonFinalizationError` under Python-finaliseringen:

source: Creating a new Python thread.
sv: Skapar en ny Python-tråd.

source: :meth:`Joining <threading.Thread.join>` a running daemon thread.
sv: :meth:`Joining <threading.Thread.join>` en pågående daemon-tråd.

source: See also the :func:`sys.is_finalizing` function.
sv: Se även funktionen :func:`sys.is_finalizing`.

source: Previously, a plain :exc:`RuntimeError` was raised.
sv: Tidigare gavs ett vanligt :exc:`RuntimeError`.

source: :meth:`threading.Thread.join` can now raise this exception.
sv: :meth:`threading.Thread.join` kan nu ge upphov till detta undantag.

source: This exception is derived from :exc:`RuntimeError`. It is raised when the interpreter detects that the maximum recursion depth (see :func:`sys.getrecursionlimit`) is exceeded.
sv: Detta undantag härstammar från :exc:`RuntimeError`. Det uppstår när tolken upptäcker att det maximala rekursionsdjupet (se :func:`sys.getrecursionlimit`) har överskridits.

source: This exception is raised when a weak reference proxy, created by the :func:`weakref.proxy` function, is used to access an attribute of the referent after it has been garbage collected. For more information on weak references, see the :mod:`weakref` module.
sv: Detta undantag uppstår när en proxy för svaga referenser, skapad av funktionen :func:`weakref.proxy`, används för att komma åt ett attribut hos referenten efter att den har samlats in. För mer information om svaga referenser, se modulen :mod:`weakref`.

source: Raised when an error is detected that doesn't fall in any of the other categories. The associated value is a string indicating what precisely went wrong.
sv: Utlöses när ett fel upptäcks som inte faller inom någon av de andra kategorierna. Det associerade värdet är en sträng som anger exakt vad som gick fel.

source: Raised by built-in function :func:`next` and an :term:`iterator`\'s :meth:`~iterator.__next__` method to signal that there are no further items produced by the iterator.
sv: Utlöses av den inbyggda funktionen :func:`next` och en :term:`iterator`:s :meth:`~iterator.__next__`-metod för att signalera att det inte finns några fler objekt som produceras av iteratorn.

source: The exception object has a single attribute :attr:`!value`, which is given as an argument when constructing the exception, and defaults to :const:`None`.
sv: Undantagsobjektet har ett enda attribut :attr:`!value`, som anges som ett argument när undantaget konstrueras och som standard är :const:`None`.

source: When a :term:`generator` or :term:`coroutine` function returns, a new :exc:`StopIteration` instance is raised, and the value returned by the function is used as the :attr:`value` parameter to the constructor of the exception.
sv: När en :term:`generator` eller :term:`coroutine`-funktion returneras, skapas en ny :exc:`StopIteration`-instans och det värde som returneras av funktionen används som :attr:`value`-parameter i konstruktören för undantaget.

source: If a generator code directly or indirectly raises :exc:`StopIteration`, it is converted into a :exc:`RuntimeError` (retaining the :exc:`StopIteration` as the new exception's cause).
sv: Om en generatorkod direkt eller indirekt ger upphov till :exc:`StopIteration`, konverteras den till en :exc:`RuntimeError` (med :exc:`StopIteration` som orsak till det nya undantaget).

source: Added ``value`` attribute and the ability for generator functions to use it to return a value.
sv: Lagt till attributet ``value`` och möjligheten för generatorfunktioner att använda det för att returnera ett värde.

source: Introduced the RuntimeError transformation via ``from __future__ import generator_stop``, see :pep:`479`.
sv: Införde transformationen RuntimeError via ``from __future__ import generator_stop``, se :pep:`479``.

source: Enable :pep:`479` for all code by default: a :exc:`StopIteration` error raised in a generator is transformed into a :exc:`RuntimeError`.
sv: Aktivera :pep:`479` för all kod som standard: ett :exc:`StopIteration`-fel som uppstår i en generator omvandlas till ett :exc:`RuntimeError`.

source: Must be raised by :meth:`~object.__anext__` method of an :term:`asynchronous iterator` object to stop the iteration.
sv: Måste tas fram av :meth:`~object.__anext__`-metoden för ett :term:`asynkron iterator`-objekt för att stoppa iterationen.

source: Raised when the parser encounters a syntax error. This may occur in an :keyword:`import` statement, in a call to the built-in functions :func:`compile`, :func:`exec`, or :func:`eval`, or when reading the initial script or standard input (also interactively).
sv: Utlöses när parsern stöter på ett syntaxfel. Detta kan inträffa i en :keyword:`import`-sats, i ett anrop till de inbyggda funktionerna :func:`compile`, :func:`exec` eller :func:`eval`, eller vid läsning av det inledande skriptet eller standardinmatningen (även interaktivt).

source: The :func:`str` of the exception instance returns only the error message. Details is a tuple whose members are also available as separate attributes.
sv: Undantagsinstansens :func:`str` returnerar endast felmeddelandet. Details är en tupel vars medlemmar också är tillgängliga som separata attribut.

source: The name of the file the syntax error occurred in.
sv: Namnet på den fil där syntaxfelet inträffade.

source: Which line number in the file the error occurred in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
sv: Vilket radnummer i filen som felet uppstod i. Detta är 1-indexerat: den första raden i filen har en ``lineno`` på 1.

source: The column in the line where the error occurred. This is 1-indexed: the first character in the line has an ``offset`` of 1.
sv: Kolumnen i raden där felet inträffade. Detta är 1-indexerat: det första tecknet på raden har en ``offset`` på 1.

source: The source code text involved in the error.
sv: Den källkodstext som är inblandad i felet.

source: Which line number in the file the error occurred ends in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
sv: Vilket radnummer i filen som felet inträffade slutar på. Detta är 1-indexerat: den första raden i filen har en ``lineno`` på 1.

source: The column in the end line where the error occurred finishes. This is 1-indexed: the first character in the line has an ``offset`` of 1.
sv: Kolumnen i slutraden där felet uppstod avslutas. Detta är 1-indexerat: det första tecknet på raden har en ``offset`` på 1.

source: For errors in f-string fields, the message is prefixed by "f-string: " and the offsets are offsets in a text constructed from the replacement expression. For example, compiling f'Bad {a b} field' results in this args attribute: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).
sv: För fel i fält med f-strängar inleds meddelandet med "f-sträng: " och offseten är offseten i en text som konstruerats utifrån ersättningsuttrycket. Exempelvis resulterar kompilering av f'Bad {a b} field' i detta args-attribut: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).

source: Added the :attr:`end_lineno` and :attr:`end_offset` attributes.
sv: Lagt till attributen :attr:`end_lineno` och :attr:`end_offset`.

source: Base class for syntax errors related to incorrect indentation. This is a subclass of :exc:`SyntaxError`.
sv: Basklass för syntaxfel relaterade till felaktig indragning. Detta är en underklass till :exc:`SyntaxError`.

source: Raised when indentation contains an inconsistent use of tabs and spaces. This is a subclass of :exc:`IndentationError`.
sv: Utlöses när indentation innehåller en inkonsekvent användning av tabbar och mellanslag. Detta är en underklass till :exc:`IndentationError`.

source: Raised when the interpreter finds an internal error, but the situation does not look so serious to cause it to abandon all hope. The associated value is a string indicating what went wrong (in low-level terms). In :term:`CPython`, this could be raised by incorrectly using Python's C API, such as returning a ``NULL`` value without an exception set.
sv: Utlöses när tolken hittar ett internt fel, men situationen inte ser så allvarlig ut att den får den att ge upp allt hopp. Det associerade värdet är en sträng som anger vad som gick fel (i lågnivåtermer). I :term:`CPython` kan detta uppstå genom felaktig användning av Pythons C API, t.ex. att returnera ett ``NULL``-värde utan en undantagsuppsättning.

source: If you're confident that this exception wasn't your fault, or the fault of a package you're using, you should report this to the author or maintainer of your Python interpreter. Be sure to report the version of the Python interpreter (``sys.version``; it is also printed at the start of an interactive Python session), the exact error message (the exception's associated value) and if possible the source of the program that triggered the error.
sv: Om du är säker på att detta undantag inte var ditt fel, eller felet i ett paket som du använder, bör du rapportera detta till författaren eller underhållaren av din Python-tolk. Var noga med att rapportera versionen av Python-tolken (``sys.version``; den skrivs också ut i början av en interaktiv Python-session), det exakta felmeddelandet (undantagets associerade värde) och om möjligt källan till det program som utlöste felet.

source: This exception is raised by the :func:`sys.exit` function. It inherits from :exc:`BaseException` instead of :exc:`Exception` so that it is not accidentally caught by code that catches :exc:`Exception`. This allows the exception to properly propagate up and cause the interpreter to exit. When it is not handled, the Python interpreter exits; no stack traceback is printed. The constructor accepts the same optional argument passed to :func:`sys.exit`. If the value is an integer, it specifies the system exit status (passed to C's :c:func:`!exit` function); if it is ``None``, the exit status is zero; if it has another type (such as a string), the object's value is printed and the exit status is one.
sv: Detta undantag skapas av funktionen :func:`sys.exit`. Det ärver från :exc:`BaseException` istället för :exc:`Exception` så att det inte av misstag fångas upp av kod som fångar upp :exc:`Exception`. Detta gör att undantaget kan spridas ordentligt uppåt och få tolken att avsluta. När det inte hanteras avslutas Python-tolken; ingen stack traceback skrivs ut. Konstruktören accepterar samma valfria argument som skickas till :func:`sys.exit`. Om värdet är ett heltal anger det systemets exitstatus (skickas till C:s funktion :c:func:`!exit`); om det är ``None`` är exitstatusen noll; om det har en annan typ (t.ex. en sträng) skrivs objektets värde ut och exitstatusen är ett.

source: A call to :func:`sys.exit` is translated into an exception so that clean-up handlers (:keyword:`finally` clauses of :keyword:`try` statements) can be executed, and so that a debugger can execute a script without running the risk of losing control. The :func:`os._exit` function can be used if it is absolutely positively necessary to exit immediately (for example, in the child process after a call to :func:`os.fork`).
sv: Ett anrop till :func:`sys.exit` översätts till ett undantag så att rensningshanterare (:keyword:`finally`-klausuler i :keyword:`try`-satser) kan köras och så att en debugger kan köra ett skript utan att riskera att förlora kontrollen. Funktionen :func:`os._exit` kan användas om det är absolut nödvändigt att avsluta omedelbart (t.ex. i barnprocessen efter ett anrop till :func:`os.fork`).

source: The exit status or error message that is passed to the constructor. (Defaults to ``None``.)
sv: Utgångsstatus eller felmeddelande som skickas till konstruktören. (Standardvärdet är ``None``.)

source: Raised when an operation or function is applied to an object of inappropriate type. The associated value is a string giving details about the type mismatch.
sv: Utlöses när en operation eller funktion tillämpas på ett objekt av olämplig typ. Det associerade värdet är en sträng som ger information om felaktig typmatchning.

source: This exception may be raised by user code to indicate that an attempted operation on an object is not supported, and is not meant to be. If an object is meant to support a given operation but has not yet provided an implementation, :exc:`NotImplementedError` is the proper exception to raise.
sv: Detta undantag kan skapas av användarkod för att indikera att ett försök att utföra en operation på ett objekt inte stöds och inte heller är avsett att stödjas. Om ett objekt är avsett att stödja en viss operation men ännu inte har tillhandahållit en implementering, är :exc:`NotImplementedError` det korrekta undantaget.

source: Passing arguments of the wrong type (e.g. passing a :class:`list` when an :class:`int` is expected) should result in a :exc:`TypeError`, but passing arguments with the wrong value (e.g. a number outside expected boundaries) should result in a :exc:`ValueError`.
sv: Att skicka argument av fel typ (t.ex. att skicka en :class:`list` när en :class:`int` förväntas) bör resultera i ett :exc:`TypeError`, men att skicka argument med fel värde (t.ex. ett tal utanför förväntade gränser) bör resultera i ett :exc:`ValueError`.

source: Raised when a reference is made to a local variable in a function or method, but no value has been bound to that variable. This is a subclass of :exc:`NameError`.
sv: Utlöses när en referens görs till en lokal variabel i en funktion eller metod, men inget värde har bundits till variabeln. Detta är en underklass till :exc:`NameError`.

source: Raised when a Unicode-related encoding or decoding error occurs. It is a subclass of :exc:`ValueError`.
sv: Utlöses när ett Unicode-relaterat kodnings- eller avkodningsfel inträffar. Det är en underklass till :exc:`ValueError`.

source: :exc:`UnicodeError` has attributes that describe the encoding or decoding error. For example, ``err.object[err.start:err.end]`` gives the particular invalid input that the codec failed on.
sv: :exc:`UnicodeError` har attribut som beskriver kodnings- eller avkodningsfelet. Till exempel ger ``err.object[err.start:err.end]`` den specifika ogiltiga indata som codec misslyckades med.

source: The name of the encoding that raised the error.
sv: Namnet på den kodning som orsakade felet.

source: A string describing the specific codec error.
sv: En sträng som beskriver det specifika codec-felet.

source: The object the codec was attempting to encode or decode.
sv: Det objekt som codec försökte koda eller avkoda.

source: The first index of invalid data in :attr:`object`.
sv: Det första indexet för ogiltiga data i :attr:`object`.

source: This value should not be negative as it is interpreted as an absolute offset but this constraint is not enforced at runtime.
sv: Detta värde bör inte vara negativt eftersom det tolkas som en absolut förskjutning, men denna begränsning tillämpas inte under körning.

source: The index after the last invalid data in :attr:`object`.
sv: Indexet efter den sista ogiltiga uppgiften i :attr:`object`.

source: Raised when a Unicode-related error occurs during encoding. It is a subclass of :exc:`UnicodeError`.
sv: Uppstår när ett Unicode-relaterat fel inträffar under kodningen. Det är en underklass till :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during decoding. It is a subclass of :exc:`UnicodeError`.
sv: Uppstår när ett Unicode-relaterat fel inträffar under avkodningen. Det är en underklass till :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during translating. It is a subclass of :exc:`UnicodeError`.
sv: Uppstår när ett Unicode-relaterat fel inträffar under översättningen. Det är en underklass till :exc:`UnicodeError`.

source: Raised when an operation or function receives an argument that has the right type but an inappropriate value, and the situation is not described by a more precise exception such as :exc:`IndexError`.
sv: Utlöses när en operation eller funktion får ett argument som har rätt typ men ett olämpligt värde, och situationen inte beskrivs av ett mer precist undantag som :exc:`IndexError`.

source: Raised when the second argument of a division or modulo operation is zero. The associated value is a string indicating the type of the operands and the operation.
sv: Uppstår när det andra argumentet i en divisions- eller modulooperation är noll. Det associerade värdet är en sträng som anger typen av operander och operation.

source: The following exceptions are kept for compatibility with previous versions; starting from Python 3.3, they are aliases of :exc:`OSError`.
sv: Följande undantag finns kvar för kompatibilitet med tidigare versioner; från och med Python 3.3 är de alias för :exc:`OSError`.

source: Only available on Windows.
sv: Endast tillgängligt på Windows.

source: OS exceptions
sv: OS-undantag

source: The following exceptions are subclasses of :exc:`OSError`, they get raised depending on the system error code.
sv: Följande undantag är underklasser till :exc:`OSError`, de aktiveras beroende på systemets felkod.

source: Raised when an operation would block on an object (e.g. socket) set for non-blocking operation. Corresponds to :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` and :py:const:`~errno.EINPROGRESS`.
sv: Uppstår när en operation skulle blockera ett objekt (t.ex. socket) som är inställt för icke-blockerande operationer. Motsvarar :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` och :py:const:`~errno.EINPROGRESS`.

source: In addition to those of :exc:`OSError`, :exc:`BlockingIOError` can have one more attribute:
sv: Utöver de attribut som finns för :exc:`OSError` kan :exc:`BlockingIOError` ha ytterligare ett attribut:

source: An integer containing the number of characters written to the stream before it blocked. This attribute is available when using the buffered I/O classes from the :mod:`io` module.
sv: Ett heltal som innehåller antalet tecken som skrevs till strömmen innan den blockerades. Detta attribut är tillgängligt när du använder de buffrade I/O-klasserna från modulen :mod:`io`.

source: Raised when an operation on a child process failed. Corresponds to :c:data:`errno` :py:const:`~errno.ECHILD`.
sv: Utlöses när en åtgärd på en underordnad process misslyckades. Motsvarar :c:data:`errno` :py:const:`~errno.ECHILD`.

source: A base class for connection-related issues.
sv: En basklass för anslutningsrelaterade frågor.

source: Subclasses are :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` and :exc:`ConnectionResetError`.
sv: Underklasser är :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` och :exc:`ConnectionResetError`.

source: A subclass of :exc:`ConnectionError`, raised when trying to write on a pipe while the other end has been closed, or trying to write on a socket which has been shutdown for writing. Corresponds to :c:data:`errno` :py:const:`~errno.EPIPE` and :py:const:`~errno.ESHUTDOWN`.
sv: En underklass till :exc:`ConnectionError`, som uppstår när man försöker skriva på en pipe medan den andra änden har stängts, eller när man försöker skriva på en socket som har stängts för skrivning. Motsvarar :c:data:`errno` :py:const:`~errno.EPIPE` och :py:const:`~errno.ESHUTDOWN`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is aborted by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNABORTED`.
sv: En underklass till :exc:`ConnectionError`, som uppstår när ett anslutningsförsök avbryts av motparten. Motsvarar :c:data:`errno` :py:const:`~errno.ECONNABORTED`.
