Repository: yeager/python-docs-sv
Catalog: library/faulthandler.po
Languages: sv

source: :mod:`!faulthandler` --- Dump the Python traceback
sv: :mod:`!faulthandler` --- Dumpa Python-spårningen

source: This module contains functions to dump Python tracebacks explicitly, on a fault, after a timeout, or on a user signal. Call :func:`faulthandler.enable` to install fault handlers for the :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS`, and :const:`~signal.SIGILL` signals. You can also enable them at startup by setting the :envvar:`PYTHONFAULTHANDLER` environment variable or by using the :option:`-X` ``faulthandler`` command line option.
sv: Denna modul innehåller funktioner för att dumpa Python-spårningar explicit, på ett fel, efter en timeout eller på en användarsignal. Anropa :func:`faulthandler.enable` för att installera felhanterare för signalerna :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` och :const:`~signal.SIGILL`. Du kan också aktivera dem vid start genom att ställa in miljövariabeln :envvar:`PYTHONFAULTHANDLER` eller genom att använda kommandoradsalternativet :option:`-X` ``faulthandler``.

source: The fault handler is compatible with system fault handlers like Apport or the Windows fault handler. The module uses an alternative stack for signal handlers if the :c:func:`!sigaltstack` function is available. This allows it to dump the traceback even on a stack overflow.
sv: Felhanteraren är kompatibel med systemfelhanterare som Apport eller Windows felhanterare. Modulen använder en alternativ stack för signalhanterare om funktionen :c:func:`!sigaltstack` är tillgänglig. Detta gör att den kan dumpa traceback även vid stacköverflöd.

source: The fault handler is called on catastrophic cases and therefore can only use signal-safe functions (e.g. it cannot allocate memory on the heap). Because of this limitation traceback dumping is minimal compared to normal Python tracebacks:
sv: Felhanteraren anropas i katastroffall och kan därför bara använda signalsäkra funktioner (den kan t.ex. inte allokera minne i heapen). På grund av denna begränsning är spårningsdumpningen minimal jämfört med normala Python-spårningar:

source: Only ASCII is supported. The ``backslashreplace`` error handler is used on encoding.
sv: Endast ASCII stöds. Felhanteraren ``backslashreplace`` används vid kodning.

source: Each string is limited to 500 characters.
sv: Varje sträng är begränsad till 500 tecken.

source: Only the filename, the function name and the line number are displayed. (no source code)
sv: Endast filnamnet, funktionsnamnet och radnumret visas. (ingen källkod)

source: It is limited to 100 frames and 100 threads.
sv: Den är begränsad till 100 ramar och 100 trådar.

source: The order is reversed: the most recent call is shown first.
sv: Ordningen är omvänd: det senaste anropet visas först.

source: By default, the Python traceback is written to :data:`sys.stderr`. To see tracebacks, applications must be run in the terminal. A log file can alternatively be passed to :func:`faulthandler.enable`.
sv: Som standard skrivs Python-spårningen till :data:`sys.stderr`. För att se spårningar måste program köras i terminalen. En loggfil kan alternativt skickas till :func:`faulthandler.enable`.

source: The module is implemented in C, so tracebacks can be dumped on a crash or when Python is deadlocked.
sv: Modulen är implementerad i C, så att spårningar kan dumpas vid en krasch eller när Python är blockerat.

source: The :ref:`Python Development Mode <devmode>` calls :func:`faulthandler.enable` at Python startup.
sv: I :ref:`Python Development Mode <devmode>` anropas :func:`faulthandler.enable` vid Python-start.

source: Module :mod:`pdb`
sv: Modul :mod:`pdb`

source: Interactive source code debugger for Python programs.
sv: Interaktiv källkodsfelsökare för Python-program.

source: Module :mod:`traceback`
sv: Modul :mod:`traceback`

source: Standard interface to extract, format and print stack traces of Python programs.
sv: Standardgränssnitt för att extrahera, formatera och skriva ut stackspår från Python-program.

source: Dumping the traceback
sv: Dumpning av spårningen

source: Dump the tracebacks of all threads into *file*. If *all_threads* is ``False``, dump only the current thread.
sv: Dumpar spårningarna av alla trådar till *fil*. Om *all_threads* är ``False``, dumpas endast den aktuella tråden.

source: :func:`traceback.print_tb`, which can be used to print a traceback object.
sv: :func:`traceback.print_tb`, som kan användas för att skriva ut ett traceback-objekt.

source: Added support for passing file descriptor to this function.
sv: Lagt till stöd för att skicka filbeskrivare till denna funktion.

source: Dumping the C stack
sv: Dumpa C-stacken

source: Dump the C stack trace of the current thread into *file*.
sv: Dumpa C-stackspårningen för den aktuella tråden till *fil*.

source: If the Python build does not support it or the operating system does not provide a stack trace, then this prints an error in place of a dumped C stack.
sv: Om Python-versionen inte stöder detta eller om operativsystemet inte tillhandahåller en stackspårning, skrivs ett fel ut i stället för en dumpad C-stack.

source: C Stack Compatibility
sv: Kompatibilitet med C-stack

source: If the system does not support the C-level :manpage:`backtrace(3)` or :manpage:`dladdr1(3)`, then C stack dumps will not work. An error will be printed instead of the stack.
sv: Om systemet inte stöder C-nivå :manpage:`backtrace(3)` eller :manpage:`dladdr1(3)` fungerar inte C-stackdumpar. Ett felmeddelande kommer att skrivas ut istället för stacken.

source: Additionally, some compilers do not support :term:`CPython's <CPython>` implementation of C stack dumps. As a result, a different error may be printed instead of the stack, even if the operating system supports dumping stacks.
sv: Dessutom stöder vissa kompilatorer inte :term:`CPythons <CPython>` implementering av C-stackdumpar. Detta kan leda till att ett annat fel skrivs ut i stället för stacken, även om operativsystemet stöder dumpning av stackar.

source: Dumping C stacks can be arbitrarily slow, depending on the DWARF level of the binaries in the call stack.
sv: Dumpning av C-stackar kan vara godtyckligt långsam, beroende på DWARF-nivån för binärprogrammen i anropsstacken.

source: Fault handler state
sv: Felhanterarens status

source: Enable the fault handler: install handlers for the :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` and :const:`~signal.SIGILL` signals to dump the Python traceback. If *all_threads* is ``True``, produce tracebacks for every running thread. Otherwise, dump only the current thread.
sv: Aktivera felhanteraren: installera hanterare för signalerna :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` och :const:`~signal.SIGILL` för att dumpa Python-spårningen. Om *all_threads* är ``True``, producera spårningar för varje tråd som körs. Annars dumpas endast den aktuella tråden.

source: The *file* must be kept open until the fault handler is disabled: see :ref:`issue with file descriptors <faulthandler-fd>`.
sv: Filen måste hållas öppen tills felhanteraren inaktiveras: se :ref:`problem med filbeskrivare <faulthandler-fd>`.

source: If *c_stack* is ``True``, then the C stack trace is printed after the Python traceback, unless the system does not support it. See :func:`dump_c_stack` for more information on compatibility.
sv: Om *c_stack* är ``True``, skrivs C-stackspåret ut efter Python-spårningen, såvida inte systemet inte stöder det. Se :func:`dump_c_stack` för mer information om kompatibilitet.

source: On Windows, a handler for Windows exception is also installed.
sv: I Windows installeras även en hanterare för Windows-undantag.

source: The dump now mentions if a garbage collector collection is running if *all_threads* is true.
sv: Dumpen nämner nu om en skräpsamlare körs om *all_threads* är true.

source: Only the current thread is dumped if the :term:`GIL` is disabled to prevent the risk of data races.
sv: Endast den aktuella tråden dumpas om :term:`GIL` är inaktiverad för att förhindra risken för datarace.

source: The dump now displays the C stack trace if *c_stack* is true.
sv: Dumpen visar nu C-stackspårningen om *c_stack* är sant.

source: Disable the fault handler: uninstall the signal handlers installed by :func:`enable`.
sv: Inaktivera felhanteraren: avinstallera de signalhanterare som installerats av :func:`enable`.

source: Check if the fault handler is enabled.
sv: Kontrollera om felhanteraren är aktiverad.

source: Dumping the tracebacks after a timeout
sv: Dumpning av spårningar efter en timeout

source: Dump the tracebacks of all threads, after a timeout of *timeout* seconds, or every *timeout* seconds if *repeat* is ``True``. If *exit* is ``True``, call :c:func:`!_exit` with status=1 after dumping the tracebacks. (Note :c:func:`!_exit` exits the process immediately, which means it doesn't do any cleanup like flushing file buffers.) If the function is called twice, the new call replaces previous parameters and resets the timeout. The timer has a sub-second resolution.
sv: Dumpar spårningarna av alla trådar efter en tidsgräns på *timeout* sekunder, eller varje *timeout* sekund om *repeat* är ``True``. Om *exit* är ``True``, anropa :c:func:`!_exit` med status=1 efter att ha dumpat spårningarna. (Observera att :c:func:`!_exit` avslutar processen omedelbart, vilket innebär att den inte gör någon upprensning som att tömma filbuffertar) Om funktionen anropas två gånger ersätter det nya anropet tidigare parametrar och återställer timeouten. Timern har en upplösning på subsekunder.

source: The *file* must be kept open until the traceback is dumped or :func:`cancel_dump_traceback_later` is called: see :ref:`issue with file descriptors <faulthandler-fd>`.
sv: Filen måste hållas öppen tills spårningen dumpas eller :func:`cancel_dump_traceback_later` anropas: se :ref:`problem med filbeskrivare <faulthandler-fd>`.

source: This function is implemented using a watchdog thread.
sv: Denna funktion implementeras med hjälp av en watchdog-tråd.

source: This function is now always available.
sv: Denna funktion är nu alltid tillgänglig.

source: Cancel the last call to :func:`dump_traceback_later`.
sv: Avbryt det senaste anropet till :func:`dump_traceback_later`.

source: Dumping the traceback on a user signal
sv: Dumpning av spårningen av en användarsignal

source: Register a user signal: install a handler for the *signum* signal to dump the traceback of all threads, or of the current thread if *all_threads* is ``False``, into *file*. Call the previous handler if chain is ``True``.
sv: Registrera en användarsignal: installera en hanterare för *signum*-signalen för att dumpa spårningen av alla trådar, eller av den aktuella tråden om *all_threads* är ``False``, i *file*. Anropa den föregående hanteraren om chain är ``True``.

source: The *file* must be kept open until the signal is unregistered by :func:`unregister`: see :ref:`issue with file descriptors <faulthandler-fd>`.
sv: *Filen* måste hållas öppen tills signalen avregistreras med :func:`unregister`: se :ref:`problem med filbeskrivare <faulthandler-fd>`.

source: Not available on Windows.
sv: Ej tillgängligt på Windows.

source: Unregister a user signal: uninstall the handler of the *signum* signal installed by :func:`register`. Return ``True`` if the signal was registered, ``False`` otherwise.
sv: Avregistrera en användarsignal: avinstallera hanteraren av *signum*-signalen som installerats av :func:`register`. Returnerar ``True`` om signalen var registrerad, ``False`` annars.

source: Issue with file descriptors
sv: Problem med filbeskrivare

source: :func:`enable`, :func:`dump_traceback_later` and :func:`register` keep the file descriptor of their *file* argument. If the file is closed and its file descriptor is reused by a new file, or if :func:`os.dup2` is used to replace the file descriptor, the traceback will be written into a different file. Call these functions again each time that the file is replaced.
sv: :func:`enable`, :func:`dump_traceback_later` och :func:`register` behåller filbeskrivaren för sitt *file*-argument. Om filen stängs och dess filbeskrivare återanvänds av en ny fil, eller om :func:`os.dup2` används för att ersätta filbeskrivaren, kommer spårningen att skrivas till en annan fil. Anropa dessa funktioner igen varje gång filen ersätts.

source: Example
sv: Exempel

source: Example of a segmentation fault on Linux with and without enabling the fault handler:
sv: Exempel på ett segmenteringsfel på Linux med och utan aktivering av felhanteraren:
