Repository: yeager/python-docs-sv
Catalog: library/filecmp.po
Languages: sv

source: :mod:`!filecmp` --- File and Directory Comparisons
sv: :mod:`!filecmp` --- Jämförelser av filer och kataloger

source: **Source code:** :source:`Lib/filecmp.py`
sv: **Källkod:** :source:`Lib/filecmp.py`

source: The :mod:`filecmp` module defines functions to compare files and directories, with various optional time/correctness trade-offs. For comparing files, see also the :mod:`difflib` module.
sv: Modulen :mod:`filecmp` definierar funktioner för att jämföra filer och kataloger, med olika valfria avvägningar mellan tid och korrekthet. För jämförelse av filer, se även modulen :mod:`difflib`.

source: The :mod:`filecmp` module defines the following functions:
sv: Modulen :mod:`filecmp` definierar följande funktioner:

source: Compare the files named *f1* and *f2*, returning ``True`` if they seem equal, ``False`` otherwise.
sv: Jämför filerna med namnen *f1* och *f2* och returnerar ``True`` om de verkar vara lika, annars ``False``.

source: If *shallow* is true and the :func:`os.stat` signatures (file type, size, and modification time) of both files are identical, the files are taken to be equal.
sv: Om *shallow* är sant och :func:`os.stat`-signaturerna (filtyp, storlek och ändringstid) för båda filerna är identiska, anses filerna vara lika.

source: Otherwise, the files are treated as different if their sizes or contents differ.
sv: I annat fall behandlas filerna som olika om deras storlek eller innehåll skiljer sig åt.

source: Note that no external programs are called from this function, giving it portability and efficiency.
sv: Observera att inga externa program anropas från denna funktion, vilket gör den portabel och effektiv.

source: This function uses a cache for past comparisons and the results, with cache entries invalidated if the :func:`os.stat` information for the file changes. The entire cache may be cleared using :func:`clear_cache`.
sv: Den här funktionen använder en cache för tidigare jämförelser och resultat, med cacheposter som ogiltigförklaras om :func:`os.stat`-informationen för filen ändras. Hela cacheminnet kan rensas med :func:`clear_cache`.

source: Compare the files in the two directories *dir1* and *dir2* whose names are given by *common*.
sv: Jämför filerna i de två katalogerna *dir1* och *dir2* vars namn anges av *common*.

source: Returns three lists of file names: *match*, *mismatch*, *errors*. *match* contains the list of files that match, *mismatch* contains the names of those that don't, and *errors* lists the names of files which could not be compared. Files are listed in *errors* if they don't exist in one of the directories, the user lacks permission to read them or if the comparison could not be done for some other reason.
sv: Returnerar tre listor med filnamn: *match*, *mismatch*, *errors*. *match* innehåller listan över filer som matchar, *mismatch* innehåller namnen på de filer som inte matchar och *errors* innehåller namnen på de filer som inte kunde jämföras. Filer listas i *errors* om de inte finns i någon av katalogerna, om användaren saknar behörighet att läsa dem eller om jämförelsen inte kunde göras av någon annan anledning.

source: The *shallow* parameter has the same meaning and default value as for :func:`filecmp.cmp`.
sv: Parametern *shallow* har samma betydelse och standardvärde som för :func:`filecmp.cmp`.

source: For example, ``cmpfiles('a', 'b', ['c', 'd/e'])`` will compare ``a/c`` with ``b/c`` and ``a/d/e`` with ``b/d/e``. ``'c'`` and ``'d/e'`` will each be in one of the three returned lists.
sv: Till exempel kommer ``cmpfiles('a', 'b', ['c', 'd/e'])`` att jämföra ``a/c`` med ``b/c`` och ``a/d/e`` med ``b/d/e``. ``'c'`` och ``'d/e'`` kommer var och en att finnas i en av de tre returnerade listorna.

source: Clear the filecmp cache. This may be useful if a file is compared so quickly after it is modified that it is within the mtime resolution of the underlying filesystem.
sv: Rensa filecmp-cachen. Detta kan vara användbart om en fil jämförs så snabbt efter att den har ändrats att det ligger inom det underliggande filsystemets mtime-upplösning.

source: The :class:`dircmp` class
sv: Klassen :class:`dircmp`

source: Construct a new directory comparison object, to compare the directories *a* and *b*. *ignore* is a list of names to ignore, and defaults to :const:`filecmp.DEFAULT_IGNORES`. *hide* is a list of names to hide, and defaults to ``[os.curdir, os.pardir]``.
sv: Konstruerar ett nytt katalogjämförelseobjekt för att jämföra katalogerna *a* och *b*. *ignore* är en lista med namn som ska ignoreras, och standardvärdet är :const:`filecmp.DEFAULT_IGNORES`. *hide* är en lista med namn som ska döljas, och standardvärdet är ``[os.curdir, os.pardir]``.

source: The :class:`dircmp` class compares files by doing *shallow* comparisons as described for :func:`filecmp.cmp` by default using the *shallow* parameter.
sv: Klassen :class:`dircmp` jämför filer genom att göra *grunda* jämförelser enligt beskrivningen för :func:`filecmp.cmp` som standard med parametern *grunda*.

source: Added the *shallow* parameter.
sv: Parametern *shallow* har lagts till.

source: The :class:`dircmp` class provides the following methods:
sv: Klassen :class:`dircmp` tillhandahåller följande metoder:

source: Print (to :data:`sys.stdout`) a comparison between *a* and *b*.
sv: Skriv ut (till :data:`sys.stdout`) en jämförelse mellan *a* och *b*.

source: Print a comparison between *a* and *b* and common immediate subdirectories.
sv: Skriv ut en jämförelse mellan *a* och *b* och gemensamma omedelbara underkataloger.

source: Print a comparison between *a* and *b* and common subdirectories (recursively).
sv: Skriv ut en jämförelse mellan *a* och *b* och gemensamma underkataloger (rekursivt).

source: The :class:`dircmp` class offers a number of interesting attributes that may be used to get various bits of information about the directory trees being compared.
sv: Klassen :class:`dircmp` erbjuder ett antal intressanta attribut som kan användas för att få olika typer av information om de katalogträd som jämförs.

source: Note that via :meth:`~object.__getattr__` hooks, all attributes are computed lazily, so there is no speed penalty if only those attributes which are lightweight to compute are used.
sv: Observera att via :meth:`~object.__getattr__`-krokar beräknas alla attribut lazilt, så det finns ingen hastighetsnedsättning om endast de attribut som är lätta att beräkna används.

source: The directory *a*.
sv: Katalogen *a*.

source: The directory *b*.
sv: Katalogen *b*.

source: Files and subdirectories in *a*, filtered by *hide* and *ignore*.
sv: Filer och underkataloger i *a*, filtrerade med *hide* och *ignore*.

source: Files and subdirectories in *b*, filtered by *hide* and *ignore*.
sv: Filer och underkataloger i *b*, filtrerade med *hide* och *ignore*.

source: Files and subdirectories in both *a* and *b*.
sv: Filer och underkataloger i både *a* och *b*.

source: Files and subdirectories only in *a*.
sv: Filer och underkataloger endast i *a*.

source: Files and subdirectories only in *b*.
sv: Filer och underkataloger endast i *b*.

source: Subdirectories in both *a* and *b*.
sv: Underkataloger i både *a* och *b*.

source: Files in both *a* and *b*.
sv: Filer i både *a* och *b*.

source: Names in both *a* and *b*, such that the type differs between the directories, or names for which :func:`os.stat` reports an error.
sv: Namn i både *a* och *b*, så att typen skiljer sig åt mellan katalogerna, eller namn för vilka :func:`os.stat` rapporterar ett fel.

source: Files which are identical in both *a* and *b*, using the class's file comparison operator.
sv: Filer som är identiska i både *a* och *b*, med hjälp av klassens filjämförelseoperator.

source: Files which are in both *a* and *b*, whose contents differ according to the class's file comparison operator.
sv: Filer som finns i både *a* och *b*, vars innehåll skiljer sig åt enligt klassens filjämförelseoperator.

source: Files which are in both *a* and *b*, but could not be compared.
sv: Filer som finns i både *a* och *b*, men som inte kunde jämföras.

source: A dictionary mapping names in :attr:`common_dirs` to :class:`dircmp` instances (or MyDirCmp instances if this instance is of type MyDirCmp, a subclass of :class:`dircmp`).
sv: En ordbok som mappar namn i :attr:`common_dirs` till :class:`dircmp`-instanser (eller MyDirCmp-instanser om denna instans är av typen MyDirCmp, en underklass till :class:`dircmp`).

source: Previously entries were always :class:`dircmp` instances. Now entries are the same type as *self*, if *self* is a subclass of :class:`dircmp`.
sv: Tidigare var poster alltid instanser av :class:`dircmp`. Nu är posterna av samma typ som *self*, om *self* är en underklass till :class:`dircmp`.

source: List of directories ignored by :class:`dircmp` by default.
sv: Lista över kataloger som ignoreras av :class:`dircmp` som standard.

source: Here is a simplified example of using the ``subdirs`` attribute to search recursively through two directories to show common different files::
sv: Här följer ett förenklat exempel på hur attributet ``subdirs`` används för att söka rekursivt genom två kataloger för att visa vanliga olika filer::
