Repository: yeager/python-docs-sv
Catalog: library/fileinput.po
Languages: sv

source: :mod:`!fileinput` --- Iterate over lines from multiple input streams
sv: :mod:`!fileinput` --- Iterera över rader från flera inmatningsströmmar

source: **Source code:** :source:`Lib/fileinput.py`
sv: **Källkod:** :source:`Lib/fileinput.py`

source: This module implements a helper class and functions to quickly write a loop over standard input or a list of files. If you just want to read or write one file see :func:`open`.
sv: Denna modul implementerar en hjälpklass och funktioner för att snabbt skriva en loop över standardinmatning eller en lista med filer. Om du bara vill läsa eller skriva en fil, se :func:`open`.

source: The typical use is::
sv: Den typiska användningen är::

source: This iterates over the lines of all files listed in ``sys.argv[1:]``, defaulting to ``sys.stdin`` if the list is empty. If a filename is ``'-'``, it is also replaced by ``sys.stdin`` and the optional arguments *mode* and *openhook* are ignored. To specify an alternative list of filenames, pass it as the first argument to :func:`.input`. A single file name is also allowed.
sv: Detta itererar över raderna i alla filer som listas i ``sys.argv[1:]``, med ``sys.stdin`` som standard om listan är tom. Om ett filnamn är ``'-'`` ersätts det också av ``sys.stdin`` och de valfria argumenten *mode* och *openhook* ignoreras. För att ange en alternativ lista med filnamn, skicka den som första argument till :func:`.input`. Ett enda filnamn är också tillåtet.

source: All files are opened in text mode by default, but you can override this by specifying the *mode* parameter in the call to :func:`.input` or :class:`FileInput`. If an I/O error occurs during opening or reading a file, :exc:`OSError` is raised.
sv: Alla filer öppnas i textläge som standard, men du kan åsidosätta detta genom att ange parametern *mode* i anropet till :func:`.input` eller :class:`FileInput`. Om ett I/O-fel inträffar under öppning eller läsning av en fil genereras :exc:`OSError`.

source: :exc:`IOError` used to be raised; it is now an alias of :exc:`OSError`.
sv: :exc:`IOError` användes tidigare; det är nu ett alias för :exc:`OSError`.

source: If ``sys.stdin`` is used more than once, the second and further use will return no lines, except perhaps for interactive use, or if it has been explicitly reset (e.g. using ``sys.stdin.seek(0)``).
sv: Om ``sys.stdin`` används mer än en gång, kommer den andra och ytterligare användningen inte att returnera några rader, utom kanske för interaktiv användning, eller om den uttryckligen har återställts (t.ex. med ``sys.stdin.seek(0)``).

source: Empty files are opened and immediately closed; the only time their presence in the list of filenames is noticeable at all is when the last file opened is empty.
sv: Tomma filer öppnas och stängs omedelbart; den enda gången deras närvaro i listan över filnamn märks är när den senast öppnade filen är tom.

source: Lines are returned with any newlines intact, which means that the last line in a file may not have one.
sv: Raderna returneras med eventuella nya rader intakta, vilket innebär att den sista raden i en fil kanske inte har någon ny rad.

source: You can control how files are opened by providing an opening hook via the *openhook* parameter to :func:`fileinput.input` or :func:`FileInput`. The hook must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. If *encoding* and/or *errors* are specified, they will be passed to the hook as additional keyword arguments. This module provides a :func:`hook_compressed` to support compressed files.
sv: Du kan styra hur filer öppnas genom att tillhandahålla en öppningskrok via parametern *openhook* till :func:`fileinput.input` eller :func:`FileInput`. Kroken måste vara en funktion som tar två argument, *filnamn* och *mode*, och returnerar ett filliknande objekt som öppnats på motsvarande sätt. Om *encoding* och/eller *errors* anges kommer de att skickas till kroken som ytterligare nyckelordsargument. Denna modul tillhandahåller en :func:`hook_compressed` för att stödja komprimerade filer.

source: The following function is the primary interface of this module:
sv: Följande funktion är det primära gränssnittet för denna modul:

source: Create an instance of the :class:`FileInput` class. The instance will be used as global state for the functions of this module, and is also returned to use during iteration. The parameters to this function will be passed along to the constructor of the :class:`FileInput` class.
sv: Skapa en instans av :class:`FileInput`-klassen. Instansen kommer att användas som globalt tillstånd för funktionerna i denna modul och returneras också för att användas under iteration. Parametrarna till denna funktion kommer att skickas vidare till konstruktören för klassen :class:`FileInput`.

source: The :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
sv: Instansen :class:`FileInput` kan användas som kontexthanterare i :keyword:`with`-satsen. I det här exemplet stängs *input* efter att :keyword:`!with`-satsen har avslutats, även om ett undantag inträffar::

source: Can be used as a context manager.
sv: Kan användas som en kontexthanterare.

source: The keyword parameters *mode* and *openhook* are now keyword-only.
sv: Nyckelordsparametrarna *mode* och *openhook* är nu endast nyckelord.

source: The keyword-only parameter *encoding* and *errors* are added.
sv: Parametrarna *encoding* och *errors*, som endast är nyckelord, har lagts till.

source: The following functions use the global state created by :func:`fileinput.input`; if there is no active state, :exc:`RuntimeError` is raised.
sv: Följande funktioner använder det globala tillstånd som skapats av :func:`fileinput.input`; om det inte finns något aktivt tillstånd, uppstår :exc:`RuntimeError`.

source: Return the name of the file currently being read. Before the first line has been read, returns ``None``.
sv: Returnerar namnet på den fil som läses för närvarande. Returnerar ``None`` innan den första raden har lästs.

source: Return the integer "file descriptor" for the current file. When no file is opened (before the first line and between files), returns ``-1``.
sv: Returnerar heltalet "file descriptor" för den aktuella filen. När ingen fil öppnas (före första raden och mellan filer) returneras ``-1``.

source: Return the cumulative line number of the line that has just been read. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line.
sv: Returnerar det kumulativa radnumret för den rad som just har lästs. Innan den första raden har lästs, returnerar ``0``. Efter att den sista raden i den sista filen har lästs, returneras radnumret för den raden.

source: Return the line number in the current file. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line within the file.
sv: Returnerar radnumret i den aktuella filen. Innan den första raden har lästs, returneras ``0``. Efter att den sista raden i den sista filen har lästs, returneras radnumret för den raden i filen.

source: Return ``True`` if the line just read is the first line of its file, otherwise return ``False``.
sv: Returnerar ``True`` om den just lästa raden är den första raden i filen, annars returneras ``False``.

source: Return ``True`` if the last line was read from ``sys.stdin``, otherwise return ``False``.
sv: Returnerar ``True`` om den sista raden lästes från ``sys.stdin``, annars returneras ``False``.

source: Close the current file so that the next iteration will read the first line from the next file (if any); lines not read from the file will not count towards the cumulative line count. The filename is not changed until after the first line of the next file has been read. Before the first line has been read, this function has no effect; it cannot be used to skip the first file. After the last line of the last file has been read, this function has no effect.
sv: Stäng den aktuella filen så att nästa iteration läser den första raden från nästa fil (om någon); rader som inte läses från filen räknas inte in i det kumulativa radantalet. Filnamnet ändras inte förrän efter att första raden i nästa fil har lästs. Innan den första raden har lästs har denna funktion ingen effekt; den kan inte användas för att hoppa över den första filen. När den sista raden i den sista filen har lästs har denna funktion ingen effekt.

source: Close the sequence.
sv: Stäng sekvensen.

source: The class which implements the sequence behavior provided by the module is available for subclassing as well:
sv: Klassen som implementerar det sekvensbeteende som tillhandahålls av modulen är också tillgänglig för underklassning:

source: Class :class:`FileInput` is the implementation; its methods :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` and :meth:`close` correspond to the functions of the same name in the module. In addition it is :term:`iterable` and has a :meth:`~io.TextIOBase.readline` method which returns the next input line. The sequence must be accessed in strictly sequential order; random access and :meth:`~io.TextIOBase.readline` cannot be mixed.
sv: Klassen :class:`FileInput` är implementationen; dess metoder :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` och :meth:`close` motsvarar funktionerna med samma namn i modulen. Dessutom är den :term:`iterable` och har en :meth:`~io.TextIOBase.readline`-metod som returnerar nästa inmatningsrad. Tillgången till sekvensen måste ske i strikt sekventiell ordning; slumpmässig tillgång och :meth:`~io.TextIOBase.readline` kan inte blandas.

source: With *mode* you can specify which file mode will be passed to :func:`open`. It must be one of ``'r'`` and ``'rb'``.
sv: Med *mode* kan du ange vilket filläge som ska skickas till :func:`open`. Det måste vara ett av ``'r'`` och ``'rb'``.

source: The *openhook*, when given, must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. You cannot use *inplace* and *openhook* together.
sv: När *openhook* ges måste det vara en funktion som tar två argument, *filnamn* och *mode*, och returnerar ett filliknande objekt som öppnats på motsvarande sätt. Du kan inte använda *inplace* och *openhook* tillsammans.

source: You can specify *encoding* and *errors* that is passed to :func:`open` or *openhook*.
sv: Du kan ange *kodning* och *fel* som skickas till :func:`open` eller *openhook*.

source: A :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
sv: En instans av :class:`FileInput` kan användas som kontexthanterare i :keyword:`with`-satsen. I det här exemplet stängs *input* efter att :keyword:`!with`-satsen har avslutats, även om ett undantag inträffar::

source: with FileInput(files=('spam.txt', 'eggs.txt')) as input: process(input)
sv: med FileInput(files=('spam.txt', 'eggs.txt')) som input: process(input)

source: The keyword parameter *mode* and *openhook* are now keyword-only.
sv: Nyckelordsparametrarna *mode* och *openhook* är nu endast nyckelord.

source: The ``'rU'`` and ``'U'`` modes and the :meth:`!__getitem__` method have been removed.
sv: Lägena ``'rU'`` och ``'U'`` samt metoden :meth:`!__getitem__` har tagits bort.

source: **Optional in-place filtering:** if the keyword argument ``inplace=True`` is passed to :func:`fileinput.input` or to the :class:`FileInput` constructor, the file is moved to a backup file and standard output is directed to the input file (if a file of the same name as the backup file already exists, it will be replaced silently). This makes it possible to write a filter that rewrites its input file in place. If the *backup* parameter is given (typically as ``backup='.<some extension>'``), it specifies the extension for the backup file, and the backup file remains around; by default, the extension is ``'.bak'`` and it is deleted when the output file is closed. In-place filtering is disabled when standard input is read.
sv: **Optionell in-place-filtrering:** Om nyckelordsargumentet ``inplace=True`` skickas till :func:`fileinput.input` eller till :class:`FileInput`-konstruktören, flyttas filen till en backup-fil och standardutdata riktas till inmatningsfilen (om en fil med samma namn som backup-filen redan finns, kommer den att ersättas tyst). Detta gör det möjligt att skriva ett filter som skriver om sin indatafil på plats. Om parametern *backup* anges (vanligtvis som ``backup='.<some extension>'``), anger den förlängningen för backupfilen och backupfilen finns kvar; som standard är förlängningen ``'.bak'`` och den raderas när utdatafilen stängs. Filtrering på plats inaktiveras när standardinmatning läses.

source: The two following opening hooks are provided by this module:
sv: De två följande öppningskrokarna tillhandahålls av denna modul:

source: Transparently opens files compressed with gzip and bzip2 (recognized by the extensions ``'.gz'`` and ``'.bz2'``) using the :mod:`gzip` and :mod:`bz2` modules. If the filename extension is not ``'.gz'`` or ``'.bz2'``, the file is opened normally (ie, using :func:`open` without any decompression).
sv: Öppnar filer som komprimerats med gzip och bzip2 (känns igen på tillägget ``'.gz'`` och ``'.bz2'``) med hjälp av modulerna :mod:`gzip` och :mod:`bz2`. Om filnamnstillägget inte är ``'.gz'`` eller ``'.bz2'`` öppnas filen normalt (dvs. med :func:`open` utan någon dekomprimering).

source: The *encoding* and *errors* values are passed to :class:`io.TextIOWrapper` for compressed files and open for normal files.
sv: Värdena *encoding* och *errors* skickas till :class:`io.TextIOWrapper` för komprimerade filer och open för vanliga filer.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``
sv: Användningsexempel: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``

source: Returns a hook which opens each file with :func:`open`, using the given *encoding* and *errors* to read the file.
sv: Returnerar en krok som öppnar varje fil med :func:`open`, och använder den angivna *kodningen* och *fel* för att läsa filen.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``
sv: Användningsexempel: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``

source: Added the optional *errors* parameter.
sv: Lagt till den valfria parametern *errors*.

source: This function is deprecated since :func:`fileinput.input` and :class:`FileInput` now have *encoding* and *errors* parameters.
sv: Denna funktion är borttagen eftersom :func:`fileinput.input` och :class:`FileInput` nu har parametrarna *encoding* och *errors*.
