Repository: yeager/python-docs-sv
Catalog: library/fractions.po
Languages: sv

source: :mod:`!fractions` --- Rational numbers
sv: :mod:`!fraktioner` --- Rationella tal

source: **Source code:** :source:`Lib/fractions.py`
sv: **Källkod:** :source:`Lib/fractions.py`

source: The :mod:`fractions` module provides support for rational number arithmetic.
sv: Modulen :mod:`fractions` ger stöd för aritmetik med rationella tal.

source: A Fraction instance can be constructed from a pair of integers, from another rational number, or from a string.
sv: En Fraction-instans kan konstrueras från ett par heltal, från ett annat rationellt tal eller från en sträng.

source: The first version requires that *numerator* and *denominator* are instances of :class:`numbers.Rational` and returns a new :class:`Fraction` instance with value ``numerator/denominator``. If *denominator* is ``0``, it raises a :exc:`ZeroDivisionError`.
sv: Den första versionen kräver att *numerator* och *denominator* är instanser av :class:`numbers.Rational` och returnerar en ny :class:`Fraction`-instans med värdet ``numerator/denominator``. Om *denominator* är ``0``, ger den upphov till ett :exc:`ZeroDivisionError`.

source: The second version requires that *number* is an instance of :class:`numbers.Rational` or has the :meth:`!as_integer_ratio` method (this includes :class:`float` and :class:`decimal.Decimal`). It returns a :class:`Fraction` instance with exactly the same value. Assumed, that the :meth:`!as_integer_ratio` method returns a pair of coprime integers and last one is positive. Note that due to the usual issues with binary point (see :ref:`tut-fp-issues`), the argument to ``Fraction(1.1)`` is not exactly equal to 11/10, and so ``Fraction(1.1)`` does *not* return ``Fraction(11, 10)`` as one might expect. (But see the documentation for the :meth:`limit_denominator` method below.)
sv: Den andra versionen kräver att *number* är en instans av :class:`numbers.Rational` eller har metoden :meth:`!as_integer_ratio` (detta inkluderar :class:`float` och :class:`decimal.Decimal`). Den returnerar en :class:`Fraction`-instans med exakt samma värde. Antag att metoden :meth:`!as_integer_ratio` returnerar ett par coprime heltal och att det sista är positivt. Observera att på grund av de vanliga problemen med binär punkt (se :ref:`tut-fp-issues`) är argumentet till ``Fraction(1.1)`` inte exakt lika med 11/10, och därför returnerar ``Fraction(1.1)`` *inte* ``Fraction(11, 10)`` som man skulle kunna förvänta sig. (Men se dokumentationen för metoden :meth:`limit_denominator` nedan)

source: The last version of the constructor expects a string. The usual form for this instance is::
sv: Den sista versionen av konstruktören förväntar sig en sträng. Den vanliga formen för denna instans är::

source: [sign] numerator ['/' denominator]
sv: [tecken] täljare ['/' nämnare]

source: where the optional ``sign`` may be either '+' or '-' and ``numerator`` and ``denominator`` (if present) are strings of decimal digits (underscores may be used to delimit digits as with integral literals in code). In addition, any string that represents a finite value and is accepted by the :class:`float` constructor is also accepted by the :class:`Fraction` constructor. In either form the input string may also have leading and/or trailing whitespace. Here are some examples::
sv: där det valfria ``tecknet`` kan vara antingen '+' eller '-' och ``numerator`` och ``denominator`` (om de finns) är strängar av decimala siffror (understrykningar kan användas för att avgränsa siffror som med integrerade literaler i kod). Dessutom kan alla strängar som representerar ett ändligt värde och som accepteras av :class:`float`-konstruktören också accepteras av :class:`Fraction`-konstruktören. I båda formerna kan indatasträngen också ha inledande och/eller avslutande blanksteg. Här är några exempel::

source: >>> from fractions import Fraction >>> Fraction(16, -10) Fraction(-8, 5) >>> Fraction(123) Fraction(123, 1) >>> Fraction() Fraction(0, 1) >>> Fraction('3/7') Fraction(3, 7) >>> Fraction(' -3/7 ') Fraction(-3, 7) >>> Fraction('1.414213 \t\n') Fraction(1414213, 1000000) >>> Fraction('-.125') Fraction(-1, 8) >>> Fraction('7e-6') Fraction(7, 1000000) >>> Fraction(2.25) Fraction(9, 4) >>> Fraction(1.1) Fraction(2476979795053773, 2251799813685248) >>> from decimal import Decimal >>> Fraction(Decimal('1.1')) Fraction(11, 10)
sv: >>> from fractions import Fraktion >>> Fraktion(16, -10) Fraktion(-8, 5) >>> Fraktion(123) Fraktion(123, 1) >>> Fraktion() Fraktion(0, 1) >>> Fraktion('3/7') Fraktion(3, 7) >>> Fraktion('-3/7') Fraktion(-3, 7) >>> Fraktion('1,414213 \t\n') Fraktion(1414213, 1000000) >>> Fraktion('-.125') Fraktion(-1, 8) >>> Fraktion('7e-6') Fraktion(7, 1000000) >>> Fraktion(2,25) Fraktion(9, 4) >>> Fraktion(1,1) Fraction(2476979795053773, 2251799813685248) >>> from decimal import Decimal >>> Fraktion(Decimal('1.1')) Fraktion(11, 10)

source: The :class:`Fraction` class inherits from the abstract base class :class:`numbers.Rational`, and implements all of the methods and operations from that class. :class:`Fraction` instances are :term:`hashable`, and should be treated as immutable. In addition, :class:`Fraction` has the following properties and methods:
sv: Klassen :class:`Fraction` ärver från den abstrakta basklassen :class:`numbers.Rational`, och implementerar alla metoder och operationer från den klassen. :class:`Fraction`-instanser är :term:`hashable`, och bör behandlas som oföränderliga. Dessutom har :class:`Fraction` följande egenskaper och metoder:

source: The :class:`Fraction` constructor now accepts :class:`float` and :class:`decimal.Decimal` instances.
sv: Konstruktorn :class:`Fraction` accepterar nu instanser av :class:`float` och :class:`decimal.Decimal`.

source: The :func:`math.gcd` function is now used to normalize the *numerator* and *denominator*. :func:`math.gcd` always returns an :class:`int` type. Previously, the GCD type depended on *numerator* and *denominator*.
sv: Funktionen :func:`math.gcd` används nu för att normalisera *numerator* och *denominator*. :func:`math.gcd` returnerar alltid en :class:`int`-typ. Tidigare berodde GCD-typen på *numerator* och *denominator*.

source: Underscores are now permitted when creating a :class:`Fraction` instance from a string, following :PEP:`515` rules.
sv: Underscores är nu tillåtna när man skapar en :class:`Fraction`-instans från en sträng, enligt :PEP:`515`-reglerna.

source: :class:`Fraction` implements ``__int__`` now to satisfy ``typing.SupportsInt`` instance checks.
sv: :class:`Fraction` implementerar ``__int__`` nu för att uppfylla ``typing.SupportsInt`` instans kontroller.

source: Space is allowed around the slash for string inputs: ``Fraction('2 / 3')``.
sv: Mellanslag tillåts runt snedstrecket för stränginmatningar: ``Fraktion('2 / 3')``.

source: :class:`Fraction` instances now support float-style formatting, with presentation types ``"e"``, ``"E"``, ``"f"``, ``"F"``, ``"g"``, ``"G"`` and ``"%""``.
sv: :class:`Fraction`-instanser stöder nu formatering i float-stil, med presentationstyperna ``"e"``, ``"E"``, ``"f"``, ``"F"``, ``"g"``, ``"G"`` och ``"%""``.

source: Formatting of :class:`Fraction` instances without a presentation type now supports fill, alignment, sign handling, minimum width and grouping.
sv: Formatering av :class:`Fraction`-instanser utan presentationstyp har nu stöd för fyllning, justering, teckenhantering, minsta bredd och gruppering.

source: The :class:`Fraction` constructor now accepts any objects with the :meth:`!as_integer_ratio` method.
sv: Konstruktorn för :class:`Fraction` accepterar nu alla objekt med metoden :meth:`!as_integer_ratio`.

source: Numerator of the Fraction in lowest term.
sv: Täljaren i fraktionen i den lägsta termen.

source: Denominator of the Fraction in lowest term.
sv: Nämnaren i bråket i lägsta termen.

source: Return a tuple of two integers, whose ratio is equal to the original Fraction. The ratio is in lowest terms and has a positive denominator.
sv: Returnerar en tupel av två heltal, vars förhållande är lika med den ursprungliga Fraction. Förhållandet är i lägsta termer och har en positiv nämnare.

source: Return ``True`` if the Fraction is an integer.
sv: Returnerar ``True`` om Fraction är ett heltal.

source: Alternative constructor which only accepts instances of :class:`float` or :class:`numbers.Integral`. Beware that ``Fraction.from_float(0.3)`` is not the same value as ``Fraction(3, 10)``.
sv: Alternativ konstruktör som endast accepterar instanser av :class:`float` eller :class:`numbers.Integral`. Tänk på att ``Fraction.from_float(0.3)`` inte är samma värde som ``Fraction(3, 10)``.

source: From Python 3.2 onwards, you can also construct a :class:`Fraction` instance directly from a :class:`float`.
sv: Från Python 3.2 och framåt kan du också konstruera en :class:`Fraction`-instans direkt från en :class:`float`.

source: Alternative constructor which only accepts instances of :class:`decimal.Decimal` or :class:`numbers.Integral`.
sv: Alternativ konstruktor som endast accepterar instanser av :class:`decimal.Decimal` eller :class:`numbers.Integral`.

source: From Python 3.2 onwards, you can also construct a :class:`Fraction` instance directly from a :class:`decimal.Decimal` instance.
sv: Från Python 3.2 och framåt kan du också konstruera en :class:`Fraction`-instans direkt från en :class:`decimal.Decimal`-instans.

source: Alternative constructor which only accepts instances of :class:`numbers.Integral`, :class:`numbers.Rational`, :class:`float` or :class:`decimal.Decimal`, and objects with the :meth:`!as_integer_ratio` method, but not strings.
sv: Alternativ konstruktör som endast accepterar instanser av :class:`numbers.Integral`, :class:`numbers.Rational`, :class:`float` eller :class:`decimal.Decimal`, och objekt med metoden :meth:`!as_integer_ratio`, men inte strängar.

source: Finds and returns the closest :class:`Fraction` to ``self`` that has denominator at most max_denominator. This method is useful for finding rational approximations to a given floating-point number:
sv: Hittar och returnerar den närmaste :class:`Fraction` till ``self`` som har högst max_denominator som nämnare. Denna metod är användbar för att hitta rationella approximationer till ett givet flyttal:

source: or for recovering a rational number that's represented as a float:
sv: eller för att återskapa ett rationellt tal som representeras som en float:

source: Returns the greatest :class:`int` ``<= self``. This method can also be accessed through the :func:`math.floor` function:
sv: Returnerar det största :class:`int` ``<= self``. Denna metod kan också nås via funktionen :func:`math.floor`:

source: Returns the least :class:`int` ``>= self``. This method can also be accessed through the :func:`math.ceil` function.
sv: Returnerar det minsta :class:`int` ``>= self``. Denna metod kan också nås via funktionen :func:`math.ceil`.

source: The first version returns the nearest :class:`int` to ``self``, rounding half to even. The second version rounds ``self`` to the nearest multiple of ``Fraction(1, 10**ndigits)`` (logically, if ``ndigits`` is negative), again rounding half toward even. This method can also be accessed through the :func:`round` function.
sv: Den första versionen returnerar närmaste :class:`int` till ``self`` och avrundar hälften till jämnt. Den andra versionen avrundar ``self`` till närmaste multipel av ``Fraction(1, 10**ndigits)`` (logiskt, om ``ndigits`` är negativt), och avrundar återigen hälften mot jämnt. Denna metod kan också nås genom funktionen :func:`round`.

source: Provides support for formatting of :class:`Fraction` instances via the :meth:`str.format` method, the :func:`format` built-in function, or :ref:`Formatted string literals <f-strings>`.
sv: Ger stöd för formatering av :class:`Fraction`-instanser via metoden :meth:`str.format`, den inbyggda funktionen :func:`format` eller :ref:`Formaterade stränglitteraler <f-strings>`.

source: If the ``format_spec`` format specification string does not end with one of the presentation types ``'e'``, ``'E'``, ``'f'``, ``'F'``, ``'g'``, ``'G'`` or ``'%'`` then formatting follows the general rules for fill, alignment, sign handling, minimum width, and grouping as described in the :ref:`format specification mini-language <formatspec>`. The "alternate form" flag ``'#'`` is supported: if present, it forces the output string to always include an explicit denominator, even when the value being formatted is an exact integer. The zero-fill flag ``'0'`` is not supported.
sv: Om formatspecifikationssträngen ``format_spec`` inte slutar med någon av presentationstyperna ``'e'``, ``'E'``, ``'f'``, ``'F'``, ``'g'``, ``'G'`` eller ``'%'`` följer formateringen de allmänna reglerna för fyllning, justering, teckenhantering, minsta bredd och gruppering som beskrivs i :ref:``format specification mini-language <formatspec>``. Flaggan "alternate form" ``'#'`` stöds: om den finns tvingar den utdatasträngen att alltid innehålla en explicit nämnare, även när värdet som formateras är ett exakt heltal. Nollfyllnadsflaggan ``'0'`` stöds inte.

source: If the ``format_spec`` format specification string ends with one of the presentation types ``'e'``, ``'E'``, ``'f'``, ``'F'``, ``'g'``, ``'G'`` or ``'%'`` then formatting follows the rules outlined for the :class:`float` type in the :ref:`formatspec` section.
sv: Om formatspecifikationssträngen ``format_spec`` slutar med en av presentationstyperna ``'e'``, ``'E'``, ``'f'``, ``'F'``, ``'g'``, ``'G'`` eller ``'%'`` så följer formateringen de regler som beskrivs för typen :class:`float` i avsnittet :ref:`formatspec`.

source: Here are some examples::
sv: Här är några exempel::

source: Module :mod:`numbers`
sv: Modul :mod:`numbers`

source: The abstract base classes making up the numeric tower.
sv: De abstrakta basklasserna som utgör det numeriska tornet.
