Repository: yeager/python-docs-sv
Catalog: library/ftplib.po
Languages: sv

source: >>> ftps = FTP_TLS('ftp.pureftpd.org') >>> ftps.login() '230 Anonymous user logged in' >>> ftps.prot_p() '200 Data protection level set to "private"' >>> ftps.nlst() ['6jack', 'OpenBSD', 'antilink', 'blogbench', 'bsdcam', 'clockspeed', 'djbdns-jedi', 'docs', 'eaccelerator-jedi', 'favicon.ico', 'francotone', 'fugu', 'ignore', 'libpuzzle', 'metalog', 'minidentd', 'misc', 'mysql-udf-global-user-variables', 'php-jenkins-hash', 'php-skein-hash', 'php-webdav', 'phpaudit', 'phpbench', 'pincaster', 'ping', 'posto', 'pub', 'public', 'public_keys', 'pure-ftpd', 'qscan', 'qtc', 'sharedance', 'skycache', 'sound', 'tmp', 'ucarp']
sv: >>> ftps = FTP_TLS('ftp.pureftpd.org') >>> ftps.login() '230 Anonym användare loggade in' >>> ftps.prot_p() '200 Dataskyddsnivå inställd på "privat"' >>> ftps.nlst() ['6jack', 'OpenBSD', 'antilink', 'blogbench', 'bsdcam', 'clockspeed', 'djbdns-jedi', 'docs', 'eaccelerator-jedi', 'favicon.ico', 'francotone', 'fugu', 'ignore', 'libpuzzle', 'metalog', 'minidentd', 'misc', 'mysql-udf-global-user-variables', 'php-jenkins-hash', 'php-skein-hash', 'php-webdav', 'phpaudit', 'phpbench', 'pincaster', 'ping', 'posto', 'pub', 'public', 'public_keys', 'pure-ftpd', 'qscan', 'qtc', 'sharedance', 'skycache', 'sound', 'tmp', 'ucarp']

source: :class:`!FTP_TLS` class inherits from :class:`FTP`, defining these additional methods and attributes:
sv: klassen :class:`!FTP_TLS` ärver från klassen :class:`FTP` och definierar dessa ytterligare metoder och attribut:

source: The SSL version to use (defaults to :data:`ssl.PROTOCOL_SSLv23`).
sv: Den SSL-version som ska användas (standard är :data:`ssl.PROTOCOL_SSLv23`).

source: Set up a secure control connection by using TLS or SSL, depending on what is specified in the :attr:`ssl_version` attribute.
sv: Skapa en säker kontrollanslutning med hjälp av TLS eller SSL, beroende på vad som anges i attributet :attr:`ssl_version`.

source: The method now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
sv: Metoden stöder nu kontroll av värdnamn med :attr:`ssl.SSLContext.check_hostname` och *Server Name Indication* (se :const:`ssl.HAS_SNI`).

source: Revert control channel back to plaintext. This can be useful to take advantage of firewalls that know how to handle NAT with non-secure FTP without opening fixed ports.
sv: Återställer kontrollkanalen till klartext. Detta kan vara användbart för att dra nytta av brandväggar som vet hur man hanterar NAT med icke-säker FTP utan att öppna fasta portar.

source: Set up secure data connection.
sv: Upprätta en säker dataanslutning.

source: Set up clear text data connection.
sv: Upprätta dataanslutning i klartext.

source: Module variables
sv: Modulvariabler

source: Exception raised when an unexpected reply is received from the server.
sv: Undantag som uppstår när ett oväntat svar tas emot från servern.

source: Exception raised when an error code signifying a temporary error (response codes in the range 400--499) is received.
sv: Undantag som uppstår när en felkod som innebär ett temporärt fel (svarskoder i intervallet 400--499) tas emot.

source: Exception raised when an error code signifying a permanent error (response codes in the range 500--599) is received.
sv: Undantag som uppstår när en felkod som innebär ett permanent fel (svarskoder i intervallet 500--599) tas emot.

source: Exception raised when a reply is received from the server that does not fit the response specifications of the File Transfer Protocol, i.e. begin with a digit in the range 1--5.
sv: Undantag som uppstår när ett svar tas emot från servern som inte uppfyller svarsspecifikationerna för File Transfer Protocol, dvs. börjar med en siffra i intervallet 1--5.

source: The set of all exceptions (as a tuple) that methods of :class:`FTP` instances may raise as a result of problems with the FTP connection (as opposed to programming errors made by the caller). This set includes the four exceptions listed above as well as :exc:`OSError` and :exc:`EOFError`.
sv: Uppsättningen av alla undantag (som en tupel) som metoder i :class:`FTP`-instanser kan ge upphov till på grund av problem med FTP-anslutningen (i motsats till programmeringsfel som gjorts av den som anropar). Denna uppsättning innehåller de fyra undantagen som listas ovan samt :exc:`OSError` och :exc:`EOFError`.

source: Module :mod:`netrc`
sv: Modul :mod:`netrc`

source: Parser for the :file:`.netrc` file format. The file :file:`.netrc` is typically used by FTP clients to load user authentication information before prompting the user.
sv: Parser för filformatet :file:`.netrc`. Filen :file:`.netrc` används vanligtvis av FTP-klienter för att läsa in information om användarautentisering innan användaren tillfrågas.

source: protocol
sv: protokoll

source: ftplib (standard module)
sv: ftplib (standardmodul)
