Repository: yeager/python-docs-sv
Catalog: library/ftplib.po
Languages: sv

source: :mod:`!ftplib` --- FTP protocol client
sv: :mod:`!ftplib` --- FTP-protokollklient

source: **Source code:** :source:`Lib/ftplib.py`
sv: **Källkod:** :source:`Lib/ftplib.py`

source: This module defines the class :class:`FTP` and a few related items. The :class:`FTP` class implements the client side of the FTP protocol. You can use this to write Python programs that perform a variety of automated FTP jobs, such as mirroring other FTP servers. It is also used by the module :mod:`urllib.request` to handle URLs that use FTP. For more information on FTP (File Transfer Protocol), see internet :rfc:`959`.
sv: Denna modul definierar klassen :class:`FTP` och några relaterade objekt. Klassen :class:`FTP` implementerar klientsidan av FTP-protokollet. Du kan använda den för att skriva Python-program som utför en mängd olika automatiserade FTP-jobb, till exempel spegling av andra FTP-servrar. Den används också av modulen :mod:`urllib.request` för att hantera webbadresser som använder FTP. För mer information om FTP (File Transfer Protocol), se internet :rfc:`959`.

source: The default encoding is UTF-8, following :rfc:`2640`.
sv: Standardkodningen är UTF-8, i enlighet med :rfc:`2640`.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: Here's a sample session using the :mod:`ftplib` module::
sv: Här är ett exempel på en session med :mod:`ftplib`-modulen::

source: Reference
sv: Referens

source: FTP objects
sv: FTP-objekt

source: Return a new instance of the :class:`FTP` class.
sv: Returnerar en ny instans av :class:`FTP`-klassen.

source: Parameters
sv: Parametrar

source: The hostname to connect to. If given, :code:`connect(host)` is implicitly called by the constructor.
sv: Värdnamnet att ansluta till. Om det anges anropas :code:`connect(host)` implicit av konstruktören.

source: |param_doc_user| If given, :code:`login(host, passwd, acct)` is implicitly called by the constructor.
sv: |param_doc_user| Om den anges anropas :code:`login(host, passwd, acct)` implicit av konstruktören.

source: A timeout in seconds for blocking operations like :meth:`connect` (default: the global default timeout setting).
sv: En timeout i sekunder för blockerande operationer som :meth:`connect` (standard: den globala standardinställningen för timeout).

source: The :class:`FTP` class supports the :keyword:`with` statement, e.g.:
sv: Klassen :class:`FTP` har stöd för :keyword:`with`, t.ex:

source: Support for the :keyword:`with` statement was added.
sv: Stöd för :keyword:`with` statement har lagts till.

source: *source_address* parameter was added.
sv: *parametern source_address* har lagts till.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket. The *encoding* parameter was added, and the default was changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
sv: Om parametern *timeout* är noll kommer den att skapa ett :class:`ValueError` för att förhindra att en icke-blockerande socket skapas. Parametern *encoding* har lagts till och standardvärdet har ändrats från Latin-1 till UTF-8 för att följa :rfc:`2640`.

source: Several :class:`!FTP` methods are available in two flavors: one for handling text files and another for binary files. The methods are named for the command which is used followed by ``lines`` for the text version or ``binary`` for the binary version.
sv: Flera :class:`!FTP`-metoder finns i två varianter: en för hantering av textfiler och en för binära filer. Metoderna namnges efter det kommando som används följt av ``lines`` för textversionen eller ``binary`` för den binära versionen.

source: :class:`FTP` instances have the following methods:
sv: :class:`FTP`-instanser har följande metoder:

source: Set the instance's debugging level as an :class:`int`. This controls the amount of debugging output printed. The debug levels are:
sv: Ställ in instansens felsökningsnivå som en :class:`int`. Detta styr hur mycket felsökningsutdata som skrivs ut. Felsökningsnivåerna är:

source: ``0`` (default): No debug output.
sv: ``0`` (standard): Ingen felsökning.

source: ``1``: Produce a moderate amount of debug output, generally a single line per request.
sv: ``1``: Producerar en måttlig mängd felsökningsutdata, i allmänhet en enda rad per begäran.

source: ``2`` or higher: Produce the maximum amount of debugging output, logging each line sent and received on the control connection.
sv: ``2`` eller högre: Producerar den maximala mängden felsökningsutdata och loggar varje rad som skickas och tas emot på kontrollanslutningen.

source: Connect to the given host and port. This function should be called only once for each instance; it should not be called if a *host* argument was given when the :class:`FTP` instance was created. All other :class:`!FTP` methods can only be called after a connection has successfully been made.
sv: Anslut till den angivna värden och porten. Den här funktionen ska bara anropas en gång för varje instans; den ska inte anropas om ett *host*-argument angavs när :class:`FTP`-instansen skapades. Alla andra :class:`!FTP`-metoder kan endast anropas efter att en anslutning har upprättats.

source: The host to connect to.
sv: Värd att ansluta till.

source: The TCP port to connect to (default: ``21``, as specified by the FTP protocol specification). It is rarely needed to specify a different port number.
sv: TCP-porten att ansluta till (standard: ``21``, enligt specifikationen för FTP-protokollet). Det är sällan nödvändigt att ange ett annat portnummer.

source: A timeout in seconds for the connection attempt (default: the global default timeout setting).
sv: En timeout i sekunder för anslutningsförsöket (standard: den globala standardinställningen för timeout).

source: Raises an :ref:`auditing event <auditing>` ``ftplib.connect`` with arguments ``self``, ``host``, ``port``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ftplib.connect`` med argumenten ``self``, ``host``, ``port``.

source: Return the welcome message sent by the server in reply to the initial connection. (This message sometimes contains disclaimers or help information that may be relevant to the user.)
sv: Returnerar välkomstmeddelandet som skickas av servern som svar på den första anslutningen. (Meddelandet innehåller ibland friskrivningsklausuler eller hjälpinformation som kan vara relevant för användaren)

source: Log on to the connected FTP server. This function should be called only once for each instance, after a connection has been established; it should not be called if the *host* and *user* arguments were given when the :class:`FTP` instance was created. Most FTP commands are only allowed after the client has logged in.
sv: Logga in på den anslutna FTP-servern. Den här funktionen ska bara anropas en gång för varje instans, efter att en anslutning har upprättats; den ska inte anropas om argumenten *host* och *user* gavs när :class:`FTP`-instansen skapades. De flesta FTP-kommandon är endast tillåtna efter att klienten har loggat in.

source: Abort a file transfer that is in progress. Using this does not always work, but it's worth a try.
sv: Avbryter en filöverföring som pågår. Det är inte alltid det fungerar, men det är värt ett försök.

source: Send a simple command string to the server and return the response string.
sv: Skicka en enkel kommandosträng till servern och returnera svarssträngen.

source: Raises an :ref:`auditing event <auditing>` ``ftplib.sendcmd`` with arguments ``self``, ``cmd``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ftplib.sendcmd`` med argumenten ``self``, ``cmd``.

source: Send a simple command string to the server and handle the response. Return the response string if the response code corresponds to success (codes in the range 200--299). Raise :exc:`error_reply` otherwise.
sv: Skicka en enkel kommandosträng till servern och hantera svaret. Returnera svarssträngen om svarskoden motsvarar framgång (koder i intervallet 200--299). Annars visas :exc:`error_reply`.

source: Retrieve a file in binary transfer mode.
sv: Hämtar en fil i binärt överföringsläge.

source: An appropriate ``RETR`` command: :samp:`"RETR {filename}"`.
sv: Ett lämpligt ``RETR``-kommando: :samp:`"RETR {filename}"`.

source: A single parameter callable that is called for each block of data received, with its single argument being the data as :class:`bytes`.
sv: En anropsbar parameter med en enda parameter som anropas för varje block med data som tas emot, där det enda argumentet är data i form av :class:`bytes`.

source: The maximum chunk size to read on the low-level :class:`~socket.socket` object created to do the actual transfer. This also corresponds to the largest size of data that will be passed to *callback*. Defaults to ``8192``.
sv: Den maximala bitstorleken som ska läsas på lågnivåobjektet :class:`~socket.socket` som skapats för att göra den faktiska överföringen. Detta motsvarar också den största storleken på data som kommer att skickas till *callback*. Standardvärde är ``8192``.

source: A ``REST`` command to be sent to the server. See the documentation for the *rest* parameter of the :meth:`transfercmd` method.
sv: Ett ``REST``-kommando som ska skickas till servern. Se dokumentationen för parametern *rest* i metoden :meth:`transfercmd`.

source: Retrieve a file or directory listing in the encoding specified by the *encoding* parameter at initialization. *cmd* should be an appropriate ``RETR`` command (see :meth:`retrbinary`) or a command such as ``LIST`` or ``NLST`` (usually just the string ``'LIST'``). ``LIST`` retrieves a list of files and information about those files. ``NLST`` retrieves a list of file names. The *callback* function is called for each line with a string argument containing the line with the trailing CRLF stripped. The default *callback* prints the line to :data:`sys.stdout`.
sv: Hämtar en fil- eller kataloglista i den kodning som anges av parametern *encoding* vid initieringen. *cmd* bör vara ett lämpligt ``RETR``-kommando (se :meth:`retrbinary`) eller ett kommando som ``LIST`` eller ``NLST`` (vanligtvis bara strängen ``'LIST'``). ``LIST`` hämtar en lista med filer och information om dessa filer. ``NLST`` hämtar en lista med filnamn. Funktionen *callback* anropas för varje rad med ett strängargument som innehåller raden utan efterföljande CRLF. Standardvärdet för *callback* skriver ut raden till :data:`sys.stdout`.

source: Enable "passive" mode if *val* is true, otherwise disable passive mode. Passive mode is on by default.
sv: Aktivera "passivt" läge om *val* är true, annars inaktivera passivt läge. Passivt läge är aktiverat som standard.

source: Store a file in binary transfer mode.
sv: Lagra en fil i binärt överföringsläge.

source: An appropriate ``STOR`` command: :samp:`"STOR {filename}"`.
sv: Ett lämpligt ``STOR``-kommando: :samp:`"STOR {filename}"`.

source: A file object (opened in binary mode) which is read until EOF, using its :meth:`~io.RawIOBase.read` method in blocks of size *blocksize* to provide the data to be stored.
sv: Ett filobjekt (öppnat i binärt läge) som läses till EOF med hjälp av metoden :meth:`~io.RawIOBase.read` i block av storleken *blocksize* för att tillhandahålla de data som ska lagras.

source: The read block size. Defaults to ``8192``.
sv: Storleken på läsblocket. Standardvärdet är ``8192``.

source: A single parameter callable that is called for each block of data sent, with its single argument being the data as :class:`bytes`.
sv: En anropsbar parameter med en enda parameter som anropas för varje block med data som skickas, där det enda argumentet är data i form av :class:`bytes`.

source: The *rest* parameter was added.
sv: Parametern *rest* har lagts till.

source: Store a file in line mode. *cmd* should be an appropriate ``STOR`` command (see :meth:`storbinary`). Lines are read until EOF from the :term:`file object` *fp* (opened in binary mode) using its :meth:`~io.IOBase.readline` method to provide the data to be stored. *callback* is an optional single parameter callable that is called on each line after it is sent.
sv: Lagra en fil i linjeläge. *cmd* bör vara ett lämpligt ``STOR``-kommando (se :meth:`storbinary`). Rader läses till EOF från :term:`filobjektet` *fp* (öppnat i binärt läge) med hjälp av dess :meth:`~io.IOBase.readline`-metod för att tillhandahålla de data som ska lagras. *callback* är en valfri enparameters callable som anropas på varje rad efter att den har skickats.

source: Initiate a transfer over the data connection. If the transfer is active, send an ``EPRT`` or ``PORT`` command and the transfer command specified by *cmd*, and accept the connection. If the server is passive, send an ``EPSV`` or ``PASV`` command, connect to it, and start the transfer command. Either way, return the socket for the connection.
sv: Starta en överföring via dataanslutningen. Om överföringen är aktiv, skicka ett ``EPRT``- eller ``PORT``-kommando och det överföringskommando som anges av *cmd*, och acceptera anslutningen. Om servern är passiv, skicka ett ``EPSV`` eller ``PASV``-kommando, anslut till den och starta överföringskommandot. Returnera i vilket fall som helst socket för anslutningen.

source: If optional *rest* is given, a ``REST`` command is sent to the server, passing *rest* as an argument. *rest* is usually a byte offset into the requested file, telling the server to restart sending the file's bytes at the requested offset, skipping over the initial bytes. Note however that the :meth:`transfercmd` method converts *rest* to a string with the *encoding* parameter specified at initialization, but no check is performed on the string's contents. If the server does not recognize the ``REST`` command, an :exc:`error_reply` exception will be raised. If this happens, simply call :meth:`transfercmd` without a *rest* argument.
sv: Om *rest* anges som tillval skickas ett ``REST``-kommando till servern med *rest* som argument. *rest* är vanligtvis en byte-offset i den begärda filen, som talar om för servern att börja om med att skicka filens byte vid den begärda offseten, och hoppa över de första bytena. Observera dock att metoden :meth:`transfercmd` konverterar *rest* till en sträng med parametern *encoding* som anges vid initialiseringen, men att ingen kontroll görs av strängens innehåll. Om servern inte känner igen kommandot ``REST``, kommer ett :exc:`error_reply` undantag att uppstå. Om detta händer, anropa helt enkelt :meth:`transfercmd` utan ett *rest*-argument.

source: Like :meth:`transfercmd`, but returns a tuple of the data connection and the expected size of the data. If the expected size could not be computed, ``None`` will be returned as the expected size. *cmd* and *rest* means the same thing as in :meth:`transfercmd`.
sv: Som :meth:`transfercmd`, men returnerar en tupel av dataanslutningen och den förväntade storleken på data. Om den förväntade storleken inte kunde beräknas returneras ``None`` som den förväntade storleken. *cmd* och *rest* betyder samma sak som i :meth:`transfercmd`.

source: List a directory in a standardized format by using ``MLSD`` command (:rfc:`3659`). If *path* is omitted the current directory is assumed. *facts* is a list of strings representing the type of information desired (e.g. ``["type", "size", "perm"]``). Return a generator object yielding a tuple of two elements for every file found in path. First element is the file name, the second one is a dictionary containing facts about the file name. Content of this dictionary might be limited by the *facts* argument but server is not guaranteed to return all requested facts.
sv: Lista en katalog i ett standardiserat format med hjälp av kommandot ``MLSD`` (:rfc:`3659``). Om *path* utelämnas antas den aktuella katalogen. *facts* är en lista med strängar som representerar den typ av information som önskas (t.ex. ``["type", "size", "perm"]``). Returnerar ett generatorobjekt som ger en tupel med två element för varje fil som hittas i sökvägen. Det första elementet är filnamnet, det andra är en ordbok som innehåller fakta om filnamnet. Innehållet i denna ordbok kan begränsas av argumentet *facts*, men det är inte säkert att servern returnerar alla begärda fakta.

source: Return a list of file names as returned by the ``NLST`` command. The optional *argument* is a directory to list (default is the current server directory). Multiple arguments can be used to pass non-standard options to the ``NLST`` command.
sv: Returnerar en lista med filnamn som returneras av kommandot ``NLST``. Det valfria *argument* är en katalog som ska listas (standard är den aktuella serverkatalogen). Flera argument kan användas för att skicka icke-standardiserade alternativ till kommandot ``NLST``.

source: If your server supports the command, :meth:`mlsd` offers a better API.
sv: Om din server har stöd för kommandot erbjuder :meth:`mlsd` ett bättre API.

source: Produce a directory listing as returned by the ``LIST`` command, printing it to standard output. The optional *argument* is a directory to list (default is the current server directory). Multiple arguments can be used to pass non-standard options to the ``LIST`` command. If the last argument is a function, it is used as a *callback* function as for :meth:`retrlines`; the default prints to :data:`sys.stdout`. This method returns ``None``.
sv: Skapar en kataloglista som returneras av kommandot ``LIST`` och skriver ut den till standardutdata. Det valfria *argument* är en katalog som ska listas (standard är den aktuella serverkatalogen). Flera argument kan användas för att skicka icke-standardiserade alternativ till kommandot ``LIST``. Om det sista argumentet är en funktion används den som en *callback*-funktion som för :meth:`retrlines`; standardutskriften är till :data:`sys.stdout`. Denna metod returnerar ``None``.

source: Rename file *fromname* on the server to *toname*.
sv: Byt namn på filen *fromname* på servern till *toname*.

source: Remove the file named *filename* from the server. If successful, returns the text of the response, otherwise raises :exc:`error_perm` on permission errors or :exc:`error_reply` on other errors.
sv: Tar bort filen med namnet *filnamn* från servern. Om det lyckas returneras texten i svaret, annars visas :exc:`error_perm` vid behörighetsfel eller :exc:`error_reply` vid andra fel.

source: Set the current directory on the server.
sv: Ange den aktuella katalogen på servern.

source: Create a new directory on the server.
sv: Skapa en ny katalog på servern.

source: Return the pathname of the current directory on the server.
sv: Returnerar sökvägen till den aktuella katalogen på servern.

source: Remove the directory named *dirname* on the server.
sv: Ta bort katalogen med namnet *dirname* på servern.

source: Request the size of the file named *filename* on the server. On success, the size of the file is returned as an integer, otherwise ``None`` is returned. Note that the ``SIZE`` command is not standardized, but is supported by many common server implementations.
sv: Begär storleken på filen med namnet *filnamn* på servern. Vid framgång returneras filens storlek som ett heltal, annars returneras ``None``. Observera att kommandot ``SIZE`` inte är standardiserat, men stöds av många vanliga serverimplementationer.

source: Send a ``QUIT`` command to the server and close the connection. This is the "polite" way to close a connection, but it may raise an exception if the server responds with an error to the ``QUIT`` command. This implies a call to the :meth:`close` method which renders the :class:`FTP` instance useless for subsequent calls (see below).
sv: Skicka ett ``QUIT``-kommando till servern och stäng anslutningen. Detta är det "artiga" sättet att stänga en anslutning, men det kan ge upphov till ett undantag om servern svarar med ett fel på kommandot ``QUIT``. Detta innebär ett anrop till :meth:`close`-metoden som gör :class:`FTP`-instansen värdelös för efterföljande anrop (se nedan).

source: Close the connection unilaterally. This should not be applied to an already closed connection such as after a successful call to :meth:`~FTP.quit`. After this call the :class:`FTP` instance should not be used any more (after a call to :meth:`close` or :meth:`~FTP.quit` you cannot reopen the connection by issuing another :meth:`login` method).
sv: Stäng anslutningen ensidigt. Detta bör inte tillämpas på en redan stängd anslutning, t.ex. efter ett lyckat anrop till :meth:`~FTP.quit`. Efter detta anrop ska instansen :class:`FTP` inte användas mer (efter ett anrop till :meth:`close` eller :meth:`~FTP.quit` kan du inte öppna anslutningen igen genom att utfärda en annan :meth:`login`-metod).

source: FTP_TLS objects
sv: FTP_TLS-objekt

source: An :class:`FTP` subclass which adds TLS support to FTP as described in :rfc:`4217`. Connect to port 21 implicitly securing the FTP control connection before authenticating.
sv: En :class:`FTP`-underklass som lägger till TLS-stöd för FTP enligt beskrivningen i :rfc:`4217`. Anslut till port 21, vilket implicit säkrar FTP-kontrollanslutningen innan autentisering.

source: The user must explicitly secure the data connection by calling the :meth:`prot_p` method.
sv: Användaren måste uttryckligen säkra dataanslutningen genom att anropa metoden :meth:`prot_p`.

source: An SSL context object which allows bundling SSL configuration options, certificates and private keys into a single, potentially long-lived, structure. Please read :ref:`ssl-security` for best practices.
sv: Ett SSL-kontextobjekt som gör det möjligt att samla SSL-konfigurationsalternativ, certifikat och privata nycklar i en enda, potentiellt långlivad, struktur. Läs :ref:`ssl-security` för bästa praxis.

source: A timeout in seconds for blocking operations like :meth:`~FTP.connect` (default: the global default timeout setting).
sv: En tidsgräns i sekunder för blockering av åtgärder som :meth:`~FTP.connect` (standard: den globala standardinställningen för tidsgräns).

source: Added the *source_address* parameter.
sv: Parametern *source_address* har lagts till.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
sv: Klassen stöder nu kontroll av värdnamn med :attr:`ssl.SSLContext.check_hostname` och *Server Name Indication* (se :const:`ssl.HAS_SNI`).

source: The deprecated *keyfile* and *certfile* parameters have been removed.
sv: De föråldrade parametrarna *keyfile* och *certfile* har tagits bort.

source: Here's a sample session using the :class:`FTP_TLS` class::
sv: Här är ett exempel på en session som använder :class:`FTP_TLS` class::
