Repository: yeager/python-docs-sv
Catalog: library/functools.po
Languages: sv

source: Update a *wrapper* function to look like the *wrapped* function. The optional arguments are tuples to specify which attributes of the original function are assigned directly to the matching attributes on the wrapper function and which attributes of the wrapper function are updated with the corresponding attributes from the original function. The default values for these arguments are the module level constants ``WRAPPER_ASSIGNMENTS`` (which assigns to the wrapper function's :attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__annotations__`, :attr:`~function.__type_params__`, and :attr:`~function.__doc__`, the documentation string) and ``WRAPPER_UPDATES`` (which updates the wrapper function's :attr:`~function.__dict__`, i.e. the instance dictionary).
sv: Uppdaterar en *omslagsfunktion* så att den ser ut som den *omhöljda* funktionen. De valfria argumenten är tupler som anger vilka attribut i originalfunktionen som tilldelas direkt till de matchande attributen i omslagsfunktionen och vilka attribut i omslagsfunktionen som uppdateras med motsvarande attribut från originalfunktionen. Standardvärdena för dessa argument är modulnivåkonstanterna ``WRAPPER_ASSIGNMENTS`` (som tilldelar omslagsfunktionens :attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__annotations__`, :attr:`~function.__type_params__`, och :attr:`~function.__doc__`, dokumentationssträngen) och ``WRAPPER_UPDATES`` (som uppdaterar omslagsfunktionens :attr:`~function.__dict__`, dvs. instansordboken).

source: To allow access to the original function for introspection and other purposes (e.g. bypassing a caching decorator such as :func:`lru_cache`), this function automatically adds a ``__wrapped__`` attribute to the wrapper that refers to the function being wrapped.
sv: För att tillåta åtkomst till originalfunktionen för introspektion och andra ändamål (t.ex. kringgå en cachningsdekorator som :func:`lru_cache`), lägger denna funktion automatiskt till ett ``__wrapped__``-attribut till omslaget som refererar till den funktion som omslaget avser.

source: The main intended use for this function is in :term:`decorator` functions which wrap the decorated function and return the wrapper. If the wrapper function is not updated, the metadata of the returned function will reflect the wrapper definition rather than the original function definition, which is typically less than helpful.
sv: Den här funktionen är främst avsedd att användas i :term:`decorator`-funktioner som omsluter den dekorerade funktionen och returnerar omslaget. Om omslutningsfunktionen inte uppdateras kommer metadata för den returnerade funktionen att återspegla omslutningsdefinitionen snarare än den ursprungliga funktionsdefinitionen, vilket vanligtvis inte är till någon större hjälp.

source: :func:`update_wrapper` may be used with callables other than functions. Any attributes named in *assigned* or *updated* that are missing from the object being wrapped are ignored (i.e. this function will not attempt to set them on the wrapper function). :exc:`AttributeError` is still raised if the wrapper function itself is missing any attributes named in *updated*.
sv: :func:`update_wrapper` kan användas med andra anropbara objekt än funktioner. Alla attribut som namnges i *assigned* eller *updated* som saknas från objektet som omsluts ignoreras (dvs. denna funktion kommer inte att försöka ställa in dem på omslutningsfunktionen). :exc:`AttributeError` utlöses fortfarande om omslutningsfunktionen själv saknar några attribut som namnges i *updated*.

source: The ``__wrapped__`` attribute is now automatically added. The :attr:`~function.__annotations__` attribute is now copied by default. Missing attributes no longer trigger an :exc:`AttributeError`.
sv: Attributet ``__wrapped__`` läggs nu till automatiskt. Attributet :attr:`~function.__annotations__` kopieras nu som standard. Saknade attribut utlöser inte längre ett :exc:`AttributeError`.

source: The ``__wrapped__`` attribute now always refers to the wrapped function, even if that function defined a ``__wrapped__`` attribute. (see :issue:`17482`)
sv: Attributet ``__wrapped__`` hänvisar nu alltid till den inkapslade funktionen, även om den funktionen definierade attributet ``__wrapped__``. (se :issue:`17482`)

source: The :attr:`~function.__type_params__` attribute is now copied by default.
sv: Attributet :attr:`~function.__type_params__` kopieras nu som standard.

source: This is a convenience function for invoking :func:`update_wrapper` as a function decorator when defining a wrapper function. It is equivalent to ``partial(update_wrapper, wrapped=wrapped, assigned=assigned, updated=updated)``. For example::
sv: Detta är en bekvämlighetsfunktion för att anropa :func:`update_wrapper` som en funktionsdekorator när man definierar en omslagsfunktion. Den är likvärdig med ``partial(update_wrapper, wrapped=wrapped, assigned=assigned, updated=updated)``. Till exempel::

source: Without the use of this decorator factory, the name of the example function would have been ``'wrapper'``, and the docstring of the original :func:`!example` would have been lost.
sv: Utan denna dekoratorfabrik skulle namnet på exempelfunktionen ha varit ``'wrapper'``, och dokumentsträngen för den ursprungliga :func:`!example` skulle ha gått förlorad.

source: :class:`partial` Objects
sv: :class:`partial` Objekt

source: :class:`partial` objects are callable objects created by :func:`partial`. They have three read-only attributes:
sv: :class:`partial`-objekt är anropsbara objekt som skapas av :func:`partial`. De har tre skrivskyddade attribut:

source: A callable object or function. Calls to the :class:`partial` object will be forwarded to :attr:`func` with new arguments and keywords.
sv: Ett anropsbart objekt eller en funktion. Anrop till objektet :class:`partial` kommer att vidarebefordras till :attr:`func` med nya argument och nyckelord.

source: The leftmost positional arguments that will be prepended to the positional arguments provided to a :class:`partial` object call.
sv: De positionella argument längst till vänster som kommer att läggas till de positionella argument som anges i ett :class:`partial`-objektanrop.

source: The keyword arguments that will be supplied when the :class:`partial` object is called.
sv: De nyckelordsargument som kommer att anges när objektet :class:`partial` anropas.

source: :class:`partial` objects are like :ref:`function objects <user-defined-funcs>` in that they are callable, weak referenceable, and can have attributes. There are some important differences. For instance, the :attr:`~definition.__name__` and :attr:`~definition.__doc__` attributes are not created automatically.
sv: :class:`partial`-objekt är som :ref:`funktionsobjekt <user-defined-funcs>` i det att de är anropsbara, svagt refererbara och kan ha attribut. Det finns några viktiga skillnader. Exempelvis skapas inte attributen :attr:`~definition.__name__` och :attr:`~definition.__doc__` automatiskt.
