Repository: yeager/python-docs-sv
Catalog: library/functools.po
Languages: sv

source: Return a new :ref:`partial object<partial-objects>` which when called will behave like *func* called with the positional arguments *args* and keyword arguments *keywords*. If more arguments are supplied to the call, they are appended to *args*. If additional keyword arguments are supplied, they extend and override *keywords*. Roughly equivalent to::
sv: Returnerar ett nytt :ref:`partial object<partial-objects>` som när det anropas kommer att bete sig som *func* anropat med de positionella argumenten *args* och nyckelordsargumenten *keywords*. Om fler argument anges vid anropet läggs de till *args*. Om ytterligare nyckelordsargument anges utökar och åsidosätter de *keywords*. Ungefär likvärdig med::

source: def partial(func, /, *args, **keywords): def newfunc(*more_args, **more_keywords): return func(*args, *more_args, **(keywords | more_keywords)) newfunc.func = func newfunc.args = args newfunc.keywords = keywords return newfunc
sv: def partial(func, /, *args, **nyckelord): def newfunc(*fler_args, **fler_nyckelord): return func(*args, *mer_args, **(nyckelord | mer_nyckelord)) newfunc.func = func newfunc.args = args newfunc.nyckelord = nyckelord returnera newfunc

source: The :func:`!partial` function is used for partial function application which "freezes" some portion of a function's arguments and/or keywords resulting in a new object with a simplified signature. For example, :func:`partial` can be used to create a callable that behaves like the :func:`int` function where the *base* argument defaults to ``2``:
sv: Funktionen :func:`!partial` används för partiell funktionstillämpning som "fryser" en del av en funktions argument och/eller nyckelord, vilket resulterar i ett nytt objekt med en förenklad signatur. Till exempel kan :func:`partial` användas för att skapa en anropsbar funktion som beter sig som :func:`int`-funktionen där *base*-argumentet som standard är ``2``:

source: >>> basetwo = partial(int, base=2) >>> basetwo.__doc__ = 'Convert base 2 string to an int.' >>> basetwo('10010') 18
sv: >>> basetwo = partial(int, base=2) >>> basetwo.__doc__ = 'Konvertera bas 2-sträng till en int.' >>> basetwo('10010') 18

source: If :data:`Placeholder` sentinels are present in *args*, they will be filled first when :func:`!partial` is called. This makes it possible to pre-fill any positional argument with a call to :func:`!partial`; without :data:`!Placeholder`, only the chosen number of leading positional arguments can be pre-filled.
sv: Om :data:`Placeholder` sentinels finns i *args*, kommer de att fyllas först när :func:`!partial` anropas. Detta gör det möjligt att förfylla vilket positionsargument som helst med ett anrop till :func:`!partial`; utan :data:`!Placeholder` kan endast det valda antalet ledande positionsargument förfyllas.

source: If any :data:`!Placeholder` sentinels are present, all must be filled at call time:
sv: Om det finns några :data:`!Placeholder` sentineller måste alla fyllas vid anropstillfället:

source: >>> say_to_world = partial(print, Placeholder, Placeholder, "world!") >>> say_to_world('Hello', 'dear') Hello dear world!
sv: >>> say_to_world = partial(print, platshållare, platshållare, "värld!") >>> say_to_world('Hello', 'dear') Hej kära värld!

source: Calling ``say_to_world('Hello')`` raises a :exc:`TypeError`, because only one positional argument is provided, but there are two placeholders that must be filled in.
sv: Anropet av ``say_to_world('Hello')`` ger upphov till ett :exc:`TypeError`, eftersom endast ett positionellt argument anges, men det finns två platshållare som måste fyllas i.

source: If :func:`!partial` is applied to an existing :func:`!partial` object, :data:`!Placeholder` sentinels of the input object are filled in with new positional arguments. A placeholder can be retained by inserting a new :data:`!Placeholder` sentinel to the place held by a previous :data:`!Placeholder`:
sv: Om :func:`!partial` tillämpas på ett befintligt :func:`!partial`-objekt, fylls :data:`!Placeholder` sentinels i input-objektet med nya positionsargument. En platshållare kan behållas genom att infoga en ny :data:`!Placeholder` sentinel till den plats som innehas av en tidigare :data:`!Placeholder`:

source: >>> from functools import partial, Placeholder as _ >>> remove = partial(str.replace, _, _, '') >>> message = 'Hello, dear dear world!' >>> remove(message, ' dear') 'Hello, world!' >>> remove_dear = partial(remove, _, ' dear') >>> remove_dear(message) 'Hello, world!' >>> remove_first_dear = partial(remove_dear, _, 1) >>> remove_first_dear(message) 'Hello, dear world!'
sv: >>> from functools import partial, Platshållare som _ >>> remove = partial(str.replace, _, _, '') >>> meddelande = "Hej, kära kära värld! >>> remove(meddelande, ' kära') "Hej, världen! >>> remove_dear = partial(remove, _, ' kära') >>> remove_dear(meddelande) "Hej, världen! >>> remove_first_dear = partial(remove_dear, _, 1) >>> remove_first_dear(meddelande) "Hej, kära värld!

source: :data:`!Placeholder` cannot be passed to :func:`!partial` as a keyword argument.
sv: :data:`!Placeholder` kan inte skickas till :func:`!partial` som ett nyckelordsargument.

source: Added support for :data:`Placeholder` in positional arguments.
sv: Lagt till stöd för :data:`Placeholder` i positionella argument.

source: Return a new :class:`partialmethod` descriptor which behaves like :class:`partial` except that it is designed to be used as a method definition rather than being directly callable.
sv: Returnerar en ny :class:`partialmethod` deskriptor som beter sig som :class:`partial` förutom att den är utformad för att användas som en metoddefinition snarare än att vara direkt anropsbar.

source: *func* must be a :term:`descriptor` or a callable (objects which are both, like normal functions, are handled as descriptors).
sv: *func* måste vara en :term:`descriptor` eller en callable (objekt som är både och, som vanliga funktioner, hanteras som descriptors).

source: When *func* is a descriptor (such as a normal Python function, :func:`classmethod`, :func:`staticmethod`, :func:`~abc.abstractmethod` or another instance of :class:`partialmethod`), calls to ``__get__`` are delegated to the underlying descriptor, and an appropriate :ref:`partial object<partial-objects>` returned as the result.
sv: När *func* är en deskriptor (t.ex. en vanlig Python-funktion, :func:`classmethod`, :func:`staticmethod`, :func:`~abc.abstractmethod` eller en annan instans av :class:`partialmethod`), delegeras anrop till ``__get__`` till den underliggande deskriptorn och ett lämpligt :ref:`partialobjekt<partial-objects>` returneras som resultat.

source: When *func* is a non-descriptor callable, an appropriate bound method is created dynamically. This behaves like a normal Python function when used as a method: the *self* argument will be inserted as the first positional argument, even before the *args* and *keywords* supplied to the :class:`partialmethod` constructor.
sv: När *func* är en non-descriptor callable, skapas en lämplig bunden metod dynamiskt. Detta beter sig som en vanlig Python-funktion när den används som en metod: argumentet *self* kommer att infogas som det första positionella argumentet, till och med före de *args* och *keywords* som anges i :class:`partialmethod`-konstruktören.

source: >>> class Cell: ... def __init__(self): ... self._alive = False ... @property ... def alive(self): ... return self._alive ... def set_state(self, state): ... self._alive = bool(state) ... set_alive = partialmethod(set_state, True) ... set_dead = partialmethod(set_state, False) ... >>> c = Cell() >>> c.alive False >>> c.set_alive() >>> c.alive True
sv: >>> klass Cell: ... def __init__(self): ... self._alive = False ... @egenskap ... def alive(self): ... return self._alive ... def set_state(self, state): ... self._alive = bool(state) ... set_alive = partialmethod(set_state, True) ... set_dead = partialmethod(set_state, False) ... >>> c = Cell() >>> c.alive Falsk >>> c.set_alive() >>> c.alive Sant

source: Apply *function* of two arguments cumulatively to the items of *iterable*, from left to right, so as to reduce the iterable to a single value. For example, ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` calculates ``((((1+2)+3)+4)+5)``. The left argument, *x*, is the accumulated value and the right argument, *y*, is the update value from the *iterable*. If the optional *initial* is present, it is placed before the items of the iterable in the calculation, and serves as a default when the iterable is empty. If *initial* is not given and *iterable* contains only one item, the first item is returned.
sv: Tillämpa *funktion* med två argument kumulativt på objekten i *iterabel*, från vänster till höger, så att iterabeln reduceras till ett enda värde. Till exempel beräknar ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` ``((((1+2)+3)+4)+5)``. Det vänstra argumentet, *x*, är det ackumulerade värdet och det högra argumentet, *y*, är uppdateringsvärdet från *iterable*. Om det valfria *initial* finns med placeras det före iterabelns objekt i beräkningen och fungerar som standard när iterabeln är tom. Om *initial* inte anges och *iterable* bara innehåller ett objekt, returneras det första objektet.

source: Roughly equivalent to::
sv: Ungefär motsvarande::

source: initial_missing = object() def reduce(function, iterable, /, initial=initial_missing): it = iter(iterable) if initial is initial_missing: value = next(it) else: value = initial for element in it: value = function(value, element) return value
sv: initial_missing = objekt() def reduce(function, iterable, /, initial=initial_missing): det = iter(iterabel) om initial är initial_missing: värde = nästa(det) i annat fall värde = initial för element i it: värde = funktion(värde, element) returnerar värde

source: See :func:`itertools.accumulate` for an iterator that yields all intermediate values.
sv: Se :func:`itertools.accumulate` för en iterator som ger alla mellanliggande värden.

source: *initial* is now supported as a keyword argument.
sv: *initial* stöds nu som ett nyckelordsargument.

source: Transform a function into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
sv: Omvandla en funktion till en :term:`single-dispatch <single dispatch>` :term:`generisk funktion`.

source: To define a generic function, decorate it with the ``@singledispatch`` decorator. When defining a function using ``@singledispatch``, note that the dispatch happens on the type of the first argument::
sv: För att definiera en generisk funktion, dekorera den med dekoratorn ``@singledispatch``. När du definierar en funktion med hjälp av ``@singledispatch``, observera att dispatch sker på typen av det första argumentet::

source: To add overloaded implementations to the function, use the :func:`!register` attribute of the generic function, which can be used as a decorator. For functions annotated with types, the decorator will infer the type of the first argument automatically::
sv: För att lägga till överladdade implementationer till funktionen, använd :func:`!register`-attributet för den generiska funktionen, som kan användas som en dekorator. För funktioner som är annoterade med typer kommer dekoratorn automatiskt att härleda typen av det första argumentet::

source: >>> @fun.register ... def _(arg: int, verbose=False): ... if verbose: ... print("Strength in numbers, eh?", end=" ") ... print(arg) ... >>> @fun.register ... def _(arg: list, verbose=False): ... if verbose: ... print("Enumerate this:") ... for i, elem in enumerate(arg): ... print(i, elem)
sv: >>> @fun.register ... def _(arg: int, verbose=False): ... om verbose: ... print("Styrka i siffror, va?", end=" ") ... print(arg) ... >>> @fun.register ... def _(arg: lista, verbose=False): ... om verbose: ... print("Räkna upp detta:") ... för i, elem i enumerate(arg): ... print(i, elem)

source: :class:`typing.Union` can also be used::
sv: :class:`typing.Union` kan också användas::

source: >>> @fun.register ... def _(arg: int | float, verbose=False): ... if verbose: ... print("Strength in numbers, eh?", end=" ") ... print(arg) ... >>> from typing import Union >>> @fun.register ... def _(arg: Union[list, set], verbose=False): ... if verbose: ... print("Enumerate this:") ... for i, elem in enumerate(arg): ... print(i, elem) ...
sv: >>> @fun.register ... def _(arg: int | float, verbose=False): ... om verbose: ... print("Styrka i siffror, va?", end=" ") ... print(arg) ... >>> från typing import Union >>> @fun.register ... def _(arg: Union[list, set], verbose=False): ... om verbose: ... print("Räkna upp detta:") ... for i, elem in enumerate(arg): ... print(i, elem) ...

source: For code which doesn't use type annotations, the appropriate type argument can be passed explicitly to the decorator itself::
sv: För kod som inte använder typannoteringar kan det lämpliga typargumentet skickas explicit till själva dekoratorn::

source: >>> @fun.register(complex) ... def _(arg, verbose=False): ... if verbose: ... print("Better than complicated.", end=" ") ... print(arg.real, arg.imag) ...
sv: >>> @fun.register(komplex) ... def _(arg, verbose=False): ... om verbose: ... print("Bättre än komplicerat.", end=" ") ... print(arg.real, arg.imag) ...

source: For code that dispatches on a collections type (e.g., ``list``), but wants to typehint the items of the collection (e.g., ``list[int]``), the dispatch type should be passed explicitly to the decorator itself with the typehint going into the function definition::
sv: För kod som skickar på en samlingstyp (t.ex. ``list``), men som vill typmarkera objekten i samlingen (t.ex. ``list[int]``), bör sändningstypen skickas uttryckligen till dekoratorn själv med typmarkeringen som går in i funktionsdefinitionen::

source: >>> @fun.register(list) ... def _(arg: list[int], verbose=False): ... if verbose: ... print("Enumerate this:") ... for i, elem in enumerate(arg): ... print(i, elem)
sv: >>> @fun.register(lista) ... def _(arg: list[int], verbose=False): ... om verbose: ... print("Räkna upp detta:") ... for i, elem in enumerate(arg): ... print(i, elem)

source: At runtime the function will dispatch on an instance of a list regardless of the type contained within the list i.e. ``[1,2,3]`` will be dispatched the same as ``["foo", "bar", "baz"]``. The annotation provided in this example is for static type checkers only and has no runtime impact.
sv: Vid körning kommer funktionen att skickas till en instans av en lista oavsett vilken typ som finns i listan, dvs. ``[1,2,3]`` kommer att skickas på samma sätt som ``["foo", "bar", "baz"]``. Annoteringen i det här exemplet är endast avsedd för statiska typkontrollanter och har ingen inverkan på körtiden.

source: To enable registering :term:`lambdas<lambda>` and pre-existing functions, the :func:`~singledispatch.register` attribute can also be used in a functional form::
sv: För att möjliggöra registrering av :term:`lambdas<lambda>` och redan existerande funktioner kan attributet :func:`~singledispatch.register` också användas i en funktionell form::

source: >>> def nothing(arg, verbose=False): ... print("Nothing.") ... >>> fun.register(type(None), nothing)
sv: >>> def nothing(arg, verbose=False): ... print("Ingenting.") ... >>> fun.register(typ(None), ingenting)

source: The :func:`~singledispatch.register` attribute returns the undecorated function. This enables decorator stacking, :mod:`pickling<pickle>`, and the creation of unit tests for each variant independently::
sv: Attributet :func:`~singledispatch.register` returnerar den odekorerade funktionen. Detta möjliggör stapling av dekoratorer, :mod:``pickling<pickle>``, och skapandet av enhetstester för varje variant oberoende av varandra::

source: >>> @fun.register(float) ... @fun.register(Decimal) ... def fun_num(arg, verbose=False): ... if verbose: ... print("Half of your number:", end=" ") ... print(arg / 2) ... >>> fun_num is fun False
sv: >>> @fun.register(float) ... @fun.register(decimal) ... def fun_num(arg, verbose=False): ... om verbose: ... print("Hälften av ditt tal:", end=" ") ... print(arg / 2) ... >>> fun_num är fun Falskt

source: When called, the generic function dispatches on the type of the first argument::
sv: När den generiska funktionen anropas dispatchas den utifrån typen av det första argumentet::

source: >>> fun("Hello, world.") Hello, world. >>> fun("test.", verbose=True) Let me just say, test. >>> fun(42, verbose=True) Strength in numbers, eh? 42 >>> fun(['spam', 'spam', 'eggs', 'spam'], verbose=True) Enumerate this: 0 spam 1 spam 2 eggs 3 spam >>> fun(None) Nothing. >>> fun(1.23) 0.615
sv: >>> fun("Hej, världen.") Hallå där i världen. >>> fun("test.", verbose=True) Låt mig bara säga, test. >>> fun(42, verbose=True) Styrka i siffror, eller hur? 42 >>> fun(['spam', 'spam', 'ägg', 'spam'], verbose=True) Räkna upp detta: 0 skräppost 1 skräppost 2 ägg 3 skräppost >>> fun(Ingen) Ingenting. >>> fun(1.23) 0.615

source: Where there is no registered implementation for a specific type, its method resolution order is used to find a more generic implementation. The original function decorated with ``@singledispatch`` is registered for the base :class:`object` type, which means it is used if no better implementation is found.
sv: Om det inte finns någon registrerad implementation för en viss typ används dess metodupplösningsordning för att hitta en mer generisk implementation. Den ursprungliga funktionen dekorerad med ``@singledispatch`` är registrerad för bastypen :class:`object`, vilket innebär att den används om ingen bättre implementation hittas.

source: If an implementation is registered to an :term:`abstract base class`, virtual subclasses of the base class will be dispatched to that implementation::
sv: Om en implementation är registrerad för en :term:`abstrakt basklass`, kommer virtuella subklasser av basklassen att skickas till denna implementation::

source: >>> from collections.abc import Mapping >>> @fun.register ... def _(arg: Mapping, verbose=False): ... if verbose: ... print("Keys & Values") ... for key, value in arg.items(): ... print(key, "=>", value) ... >>> fun({"a": "b"}) a => b
sv: >>> från collections.abc import Mapping >>> @fun.register ... def _(arg: Mapping, verbose=False): ... om verbose: ... print("Nycklar och värden") ... för nyckel, värde i arg.items(): ... print(nyckel, "=>", värde) ... >>> fun({"a": "b"}) a => b

source: To check which implementation the generic function will choose for a given type, use the ``dispatch()`` attribute::
sv: För att kontrollera vilken implementering den generiska funktionen kommer att välja för en viss typ, använd attributet ``dispatch()``::

source: >>> fun.dispatch(float) <function fun_num at 0x1035a2840> >>> fun.dispatch(dict) # note: default implementation <function fun at 0x103fe0000>
sv: &gt;&gt;&gt; fun.dispatch(float) <function fun_num at 0x1035a2840> &gt;&gt;&gt; fun.dispatch(dict) # notera: standardimplementering <function fun at 0x103fe0000>

source: To access all registered implementations, use the read-only ``registry`` attribute::
sv: För att få tillgång till alla registrerade implementationer, använd det skrivskyddade attributet ``registry``::

source: >>> fun.registry.keys() dict_keys([<class 'NoneType'>, <class 'int'>, <class 'object'>, <class 'decimal.Decimal'>, <class 'list'>, <class 'float'>]) >>> fun.registry[float] <function fun_num at 0x1035a2840> >>> fun.registry[object] <function fun at 0x103fe0000>
sv: &gt;&gt;&gt; fun.registry.keys() dict_keys([<class 'NoneType'>, <class 'int'>, <class 'object'>, <class 'decimal.Decimal'>, <class 'list'>, <class 'float'>]) &gt;&gt;&gt; fun.registry[float] <function fun_num at 0x1035a2840> &gt;&gt;&gt; fun.registry[objekt] <function fun at 0x103fe0000>

source: The :func:`~singledispatch.register` attribute now supports using type annotations.
sv: Attributet :func:`~singledispatch.register` stöder nu användning av typannoteringar.

source: The :func:`~singledispatch.register` attribute now supports :class:`typing.Union` as a type annotation.
sv: Attributet :func:`~singledispatch.register` stöder nu :class:`typing.Union` som typannotering.

source: Transform a method into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
sv: Omvandla en metod till en :term:`single-dispatch <single dispatch>` :term:`generic function`.

source: To define a generic method, decorate it with the ``@singledispatchmethod`` decorator. When defining a function using ``@singledispatchmethod``, note that the dispatch happens on the type of the first non-*self* or non-*cls* argument::
sv: För att definiera en generisk metod, dekorera den med dekoratorn ``@singledispatchmethod``. När du definierar en funktion med hjälp av ``@singledispatchmethod``, observera att dispatch sker på typen av det första argumentet som inte är *self* eller *cls*::

source: class Negator: @singledispatchmethod def neg(self, arg): raise NotImplementedError("Cannot negate a") @neg.register def _(self, arg: int): return -arg @neg.register def _(self, arg: bool): return not arg
sv: klass Negator: @singledispatchmetod def neg(self, arg): raise NotImplementedError("Kan inte negera a") @neg.register def _(self, arg: int): return -arg @neg.register def _(self, arg: bool): returnerar inte arg

source: ``@singledispatchmethod`` supports nesting with other decorators such as :func:`@classmethod<classmethod>`. Note that to allow for ``dispatcher.register``, ``singledispatchmethod`` must be the *outer most* decorator. Here is the ``Negator`` class with the ``neg`` methods bound to the class, rather than an instance of the class::
sv: ``@singledispatchmethod`` stöder nestning med andra dekoratorer som :func:`@classmethod<classmethod>`. Notera att för att tillåta ``dispatcher.register`` måste ``singledispatchmethod`` vara den *yttersta* dekoratorn. Här är ``Negator`` klassen med ``neg`` metoderna bundna till klassen, snarare än en instans av klassen::

source: class Negator: @singledispatchmethod @classmethod def neg(cls, arg): raise NotImplementedError("Cannot negate a") @neg.register @classmethod def _(cls, arg: int): return -arg @neg.register @classmethod def _(cls, arg: bool): return not arg
sv: klass Negator: @singledispatchmetod @klassmetod def neg(cls, arg): raise NotImplementedError("Kan inte negera a") @neg.register @klassmetod def _(cls, arg: int): returnerar -arg @neg.register @klassmetod def _(cls, arg: bool): returnerar inte arg

source: The same pattern can be used for other similar decorators: :func:`@staticmethod<staticmethod>`, :func:`@abstractmethod<abc.abstractmethod>`, and others.
sv: Samma mönster kan användas för andra liknande dekoratorer: :func:`@staticmethod<staticmethod>`, :func:`@abstractmethod<abc.abstractmethod>`, och andra.
