Repository: yeager/python-docs-sv
Catalog: library/functools.po
Languages: sv

source: :mod:`!functools` --- Higher-order functions and operations on callable objects
sv: :mod:`!functools` --- Funktioner av högre ordning och operationer på anropsbara objekt

source: **Source code:** :source:`Lib/functools.py`
sv: **Källkod:** :source:`Lib/functools.py`

source: The :mod:`functools` module is for higher-order functions: functions that act on or return other functions. In general, any callable object can be treated as a function for the purposes of this module.
sv: Modulen :mod:`functools` är avsedd för funktioner av högre ordning: funktioner som agerar på eller returnerar andra funktioner. I allmänhet kan alla anropsbara objekt behandlas som en funktion i den här modulen.

source: The :mod:`functools` module defines the following functions:
sv: Modulen :mod:`functools` definierar följande funktioner:

source: Simple lightweight unbounded function cache. Sometimes called `"memoize" <https://en.wikipedia.org/wiki/Memoization>`_.
sv: Enkel lättviktig obegränsad funktionscache. Kallas ibland för "memoize" <https://en.wikipedia.org/wiki/Memoization>`_.

source: Returns the same as ``lru_cache(maxsize=None)``, creating a thin wrapper around a dictionary lookup for the function arguments. Because it never needs to evict old values, this is smaller and faster than :func:`lru_cache` with a size limit.
sv: Returnerar samma sak som ``lru_cache(maxsize=None)``, vilket skapar ett tunt hölje runt en ordboksuppslagning för funktionsargumenten. Eftersom den aldrig behöver evakuera gamla värden är den här mindre och snabbare än :func:`lru_cache` med en storleksbegränsning.

source: For example::
sv: Till exempel::

source: @cache def factorial(n): return n * factorial(n-1) if n else 1 >>> factorial(10) # no previously cached result, makes 11 recursive calls 3628800 >>> factorial(5) # just looks up cached value result 120 >>> factorial(12) # makes two new recursive calls, the other 10 are cached 479001600
sv: @cache def faktoriell(n): return n * faktoriell(n-1) if n else 1 >>> factorial(10) # inget tidigare cachat resultat, gör 11 rekursiva anrop 3628800 >>> factorial(5) # letar bara upp cachelagrat värde resultat 120 >>> factorial(12) # gör två nya rekursiva anrop, de andra 10 är cachade 479001600

source: The cache is threadsafe so that the wrapped function can be used in multiple threads. This means that the underlying data structure will remain coherent during concurrent updates.
sv: Cachen är trådsäker så att den omslutna funktionen kan användas i flera trådar. Detta innebär att den underliggande datastrukturen förblir sammanhängande under samtidiga uppdateringar.

source: It is possible for the wrapped function to be called more than once if another thread makes an additional call before the initial call has been completed and cached.
sv: Det är möjligt att den inkapslade funktionen anropas mer än en gång om en annan tråd gör ett ytterligare anrop innan det första anropet har slutförts och cachats.

source: Transform a method of a class into a property whose value is computed once and then cached as a normal attribute for the life of the instance. Similar to :func:`property`, with the addition of caching. Useful for expensive computed properties of instances that are otherwise effectively immutable.
sv: Omvandlar en metod i en klass till en egenskap vars värde beräknas en gång och sedan cachelagras som ett normalt attribut under instansens livstid. Liknar :func:`property`, med tillägg av cachelagring. Användbar för dyra beräknade egenskaper hos instanser som annars är effektivt oföränderliga.

source: Example::
sv: Exempel::

source: class DataSet: def __init__(self, sequence_of_numbers): self._data = tuple(sequence_of_numbers) @cached_property def stdev(self): return statistics.stdev(self._data)
sv: klass DataSet: def __init__(self, sequence_of_numbers): self._data = tuple(sequence_of_numbers) @cachad_egenskap def stdev(self): return statistik.stdev(self._data)

source: The mechanics of :func:`cached_property` are somewhat different from :func:`property`. A regular property blocks attribute writes unless a setter is defined. In contrast, a *cached_property* allows writes.
sv: Mekaniken i :func:`cached_property` är något annorlunda än i :func:`property`. En vanlig property blockerar skrivningar av attribut om inte en setter är definierad. Däremot tillåter en *cached_property* skrivningar.

source: The *cached_property* decorator only runs on lookups and only when an attribute of the same name doesn't exist. When it does run, the *cached_property* writes to the attribute with the same name. Subsequent attribute reads and writes take precedence over the *cached_property* method and it works like a normal attribute.
sv: Dekoratorn *cached_property* körs endast vid uppslagningar och endast när ett attribut med samma namn inte existerar. När den körs skriver *cached_property* till attributet med samma namn. Efterföljande läsningar och skrivningar av attribut har företräde framför metoden *cached_property* och den fungerar som ett vanligt attribut.

source: The cached value can be cleared by deleting the attribute. This allows the *cached_property* method to run again.
sv: Det cachade värdet kan rensas genom att attributet tas bort. Detta gör att metoden *cached_property* kan köras igen.

source: The *cached_property* does not prevent a possible race condition in multi-threaded usage. The getter function could run more than once on the same instance, with the latest run setting the cached value. If the cached property is idempotent or otherwise not harmful to run more than once on an instance, this is fine. If synchronization is needed, implement the necessary locking inside the decorated getter function or around the cached property access.
sv: Egenskapen *cached_property* förhindrar inte ett möjligt tävlingsförhållande vid användning med flera trådar. Getter-funktionen kan köras mer än en gång på samma instans, där den senaste körningen ställer in det cachade värdet. Om den cachade egenskapen är idempotent eller på annat sätt inte skadlig för att köras mer än en gång på en instans, är detta bra. Om synkronisering behövs, implementera den nödvändiga låsningen i den dekorerade getter-funktionen eller runt åtkomsten till den cachade egenskapen.

source: Note, this decorator interferes with the operation of :pep:`412` key-sharing dictionaries. This means that instance dictionaries can take more space than usual.
sv: Observera att denna dekorator stör funktionen hos :pep:`412` nyckeldelningsordböcker. Detta innebär att instansordböcker kan ta mer utrymme än vanligt.

source: Also, this decorator requires that the ``__dict__`` attribute on each instance be a mutable mapping. This means it will not work with some types, such as metaclasses (since the ``__dict__`` attributes on type instances are read-only proxies for the class namespace), and those that specify ``__slots__`` without including ``__dict__`` as one of the defined slots (as such classes don't provide a ``__dict__`` attribute at all).
sv: Den här dekoratorn kräver också att attributet ``__dict__`` på varje instans är en muterbar mappning. Detta innebär att den inte kommer att fungera med vissa typer, till exempel metaklasser (eftersom attributen ``__dict__`` på typinstanser är skrivskyddade proxyer för klassens namnrymd) och de som anger ``__slots__`` utan att inkludera ``__dict__`` som en av de definierade slottarna (eftersom sådana klasser inte tillhandahåller ett attribut ``__dict__`` alls).

source: If a mutable mapping is not available or if space-efficient key sharing is desired, an effect similar to :func:`cached_property` can also be achieved by stacking :func:`property` on top of :func:`lru_cache`. See :ref:`faq-cache-method-calls` for more details on how this differs from :func:`cached_property`.
sv: Om en mutabel mappning inte är tillgänglig eller om utrymmeseffektiv nyckeldelning önskas, kan en effekt som liknar :func:`cached_property` också uppnås genom att stapla :func:`property` ovanpå :func:`lru_cache`. Se :ref:`faq-cache-method-calls` för mer information om hur detta skiljer sig från :func:`cached_property`.

source: Prior to Python 3.12, ``cached_property`` included an undocumented lock to ensure that in multi-threaded usage the getter function was guaranteed to run only once per instance. However, the lock was per-property, not per-instance, which could result in unacceptably high lock contention. In Python 3.12+ this locking is removed.
sv: Före Python 3.12 inkluderade ``cached_property`` ett odokumenterat lås för att säkerställa att getter-funktionen garanterat bara kördes en gång per instans vid flertrådig användning. Låset var dock per egenskap, inte per instans, vilket kunde resultera i oacceptabelt hög låskonflikt. I Python 3.12+ är denna låsning borttagen.

source: Transform an old-style comparison function to a :term:`key function`. Used with tools that accept key functions (such as :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, :func:`itertools.groupby`). This function is primarily used as a transition tool for programs being converted from Python 2 which supported the use of comparison functions.
sv: Omvandlar en gammaldags jämförelsefunktion till en :term:`nyckelfunktion`. Används med verktyg som accepterar nyckelfunktioner (t.ex. :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, :func:`itertools.groupby`). Denna funktion används främst som ett övergångsverktyg för program som konverteras från Python 2 som stödde användningen av jämförelsefunktioner.

source: A comparison function is any callable that accepts two arguments, compares them, and returns a negative number for less-than, zero for equality, or a positive number for greater-than. A key function is a callable that accepts one argument and returns another value to be used as the sort key.
sv: En jämförelsefunktion är en anropsbar funktion som tar emot två argument, jämför dem och returnerar ett negativt tal för mindre än, noll för likhet eller ett positivt tal för större än. En nyckelfunktion är en anropsbar funktion som tar emot ett argument och returnerar ett annat värde som används som sorteringsnyckel.

source: sorted(iterable, key=cmp_to_key(locale.strcoll)) # locale-aware sort order
sv: sorterad(iterabel, nyckel=cmp_till_nyckel(locale.strcoll)) # lokalmedveten sorteringsordning

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
sv: För sorteringsexempel och en kort sorteringshandledning, se :ref:`sortinghowto`.

source: Decorator to wrap a function with a memoizing callable that saves up to the *maxsize* most recent calls. It can save time when an expensive or I/O bound function is periodically called with the same arguments.
sv: Dekorator för att omsluta en funktion med en memoizing callable som sparar upp till *maxsize* senaste anrop. Det kan spara tid när en dyr eller I/O-bunden funktion anropas med jämna mellanrum med samma argument.

source: Since a dictionary is used to cache results, the positional and keyword arguments to the function must be :term:`hashable`.
sv: Eftersom en ordbok används för att cacha resultat måste positionella argument och nyckelordsargument till funktionen vara :term:`hashable`.

source: Distinct argument patterns may be considered to be distinct calls with separate cache entries. For example, ``f(a=1, b=2)`` and ``f(b=2, a=1)`` differ in their keyword argument order and may have two separate cache entries.
sv: Olika argumentmönster kan betraktas som olika anrop med olika cacheposter. Till exempel skiljer sig ``f(a=1, b=2)`` och ``f(b=2, a=1)`` åt i ordningsföljden på nyckelordets argument och kan ha två separata cacheposter.

source: If *user_function* is specified, it must be a callable. This allows the *lru_cache* decorator to be applied directly to a user function, leaving the *maxsize* at its default value of 128::
sv: Om *user_function* specificeras måste den vara en callable. Detta gör att *lru_cache*-dekoratorn kan tillämpas direkt på en användarfunktion, och *maxsize* behåller sitt standardvärde på 128::

source: @lru_cache def count_vowels(sentence): return sum(sentence.count(vowel) for vowel in 'AEIOUaeiou')
sv: @lru_cache def count_vowels(mening): return sum(mening.count(vokal) för vokal i 'AEIOUaeiou')

source: If *maxsize* is set to ``None``, the LRU feature is disabled and the cache can grow without bound.
sv: Om *maxsize* är satt till ``None`` inaktiveras LRU-funktionen och cacheminnet kan växa obegränsat.

source: If *typed* is set to true, function arguments of different types will be cached separately. If *typed* is false, the implementation will usually regard them as equivalent calls and only cache a single result. (Some types such as *str* and *int* may be cached separately even when *typed* is false.)
sv: Om *typed* är satt till true kommer funktionsargument av olika typer att cachas separat. Om *typed* är false kommer implementationen vanligtvis att betrakta dem som likvärdiga anrop och bara cacha ett enda resultat. (Vissa typer som *str* och *int* kan cachelagras separat även när *typed* är false.)

source: Note, type specificity applies only to the function's immediate arguments rather than their contents. The scalar arguments, ``Decimal(42)`` and ``Fraction(42)`` are be treated as distinct calls with distinct results. In contrast, the tuple arguments ``('answer', Decimal(42))`` and ``('answer', Fraction(42))`` are treated as equivalent.
sv: Observera att typspecificitet endast gäller funktionens omedelbara argument och inte deras innehåll. De skalära argumenten ``Decimal(42))`` och ``Fraction(42))`` behandlas som distinkta anrop med distinkta resultat. Däremot behandlas tupelargumenten ``('answer', Decimal(42))`` och ``('answer', Fraction(42))`` som likvärdiga.

source: The wrapped function is instrumented with a :func:`!cache_parameters` function that returns a new :class:`dict` showing the values for *maxsize* and *typed*. This is for information purposes only. Mutating the values has no effect.
sv: Den omslutna funktionen är utrustad med en :func:`!cache_parameters`-funktion som returnerar en ny :class:`dict` som visar värdena för *maxsize* och *typed*. Detta är endast för informationsändamål. Mutation av värdena har ingen effekt.

source: To help measure the effectiveness of the cache and tune the *maxsize* parameter, the wrapped function is instrumented with a :func:`!cache_info` function that returns a :term:`named tuple` showing *hits*, *misses*, *maxsize* and *currsize*.
sv: För att hjälpa till att mäta effektiviteten i cacheminnet och justera parametern *maxsize* har den omslutna funktionen försetts med en :func:`!cache_info`-funktion som returnerar en :term:`named tuple` med *hits*, *misses*, *maxsize* och *currsize*.

source: The decorator also provides a :func:`!cache_clear` function for clearing or invalidating the cache.
sv: Dekoratorn innehåller också en :func:`!cache_clear`-funktion för att tömma eller inaktivera cachen.

source: The original underlying function is accessible through the :attr:`__wrapped__` attribute. This is useful for introspection, for bypassing the cache, or for rewrapping the function with a different cache.
sv: Den underliggande originalfunktionen är tillgänglig via attributet :attr:`__wrapped__`. Detta är användbart för introspektion, för att kringgå cacheminnet eller för att återpacka funktionen med ett annat cacheminne.

source: The cache keeps references to the arguments and return values until they age out of the cache or until the cache is cleared.
sv: Cachen behåller referenser till argumenten och returvärdena tills de åldras ut ur cachen eller tills cachen rensas.

source: If a method is cached, the ``self`` instance argument is included in the cache. See :ref:`faq-cache-method-calls`
sv: Om en metod cachelagras inkluderas instansargumentet ``self`` i cacheminnet. Se :ref:`faq-cache-metod-anrop`

source: An `LRU (least recently used) cache <https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_Recently_Used_(LRU)>`_ works best when the most recent calls are the best predictors of upcoming calls (for example, the most popular articles on a news server tend to change each day). The cache's size limit assures that the cache does not grow without bound on long-running processes such as web servers.
sv: En `LRU-cache (least recently used) <https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_Recently_Used_(LRU)>`_ fungerar bäst när de senaste anropen är de bästa indikatorerna på kommande anrop (t.ex. de mest populära artiklarna på en nyhetsserver tenderar att ändras varje dag). Cachens storleksbegränsning säkerställer att cacheminnet inte växer obegränsat i långvariga processer, t.ex. webbservrar.

source: In general, the LRU cache should only be used when you want to reuse previously computed values. Accordingly, it doesn't make sense to cache functions with side-effects, functions that need to create distinct mutable objects on each call (such as generators and async functions), or impure functions such as time() or random().
sv: I allmänhet bör LRU-cachen endast användas när du vill återanvända tidigare beräknade värden. Följaktligen är det inte meningsfullt att cachelagra funktioner med bieffekter, funktioner som måste skapa distinkta föränderliga objekt vid varje anrop (t.ex. generatorer och asynkrona funktioner) eller orena funktioner som time() eller random().

source: Example of an LRU cache for static web content::
sv: Exempel på en LRU-cache för statiskt webbinnehåll::

source: @lru_cache(maxsize=32) def get_pep(num): 'Retrieve text of a Python Enhancement Proposal' resource = f'https://peps.python.org/pep-{num:04d}' try: with urllib.request.urlopen(resource) as s: return s.read() except urllib.error.HTTPError: return 'Not Found' >>> for n in 8, 290, 308, 320, 8, 218, 320, 279, 289, 320, 9991: ... pep = get_pep(n) ... print(n, len(pep)) >>> get_pep.cache_info() CacheInfo(hits=3, misses=8, maxsize=32, currsize=8)
sv: @lru_cache(maxstorlek=32) def get_pep(num): "Hämta texten i ett förslag till Python-förbättring resurs = f'https://peps.python.org/pep-{num:04d}' försök: med urllib.request.urlopen(resource) som s: return s.read() except urllib.error.HTTPError: return 'Hittades inte' >>> för n i 8, 290, 308, 320, 8, 218, 320, 279, 289, 320, 9991: ... pep = get_pep(n) ... print(n, len(pep)) >>> get_pep.cache_info() CacheInfo(hits=3, misses=8, maxsize=32, currsize=8)

source: Example of efficiently computing `Fibonacci numbers <https://en.wikipedia.org/wiki/Fibonacci_number>`_ using a cache to implement a `dynamic programming <https://en.wikipedia.org/wiki/Dynamic_programming>`_ technique::
sv: Exempel på effektiv beräkning av Fibonacci-tal <https://en.wikipedia.org/wiki/Fibonacci_number>`_ med hjälp av en cache för att implementera en teknik för dynamisk programmering <https://en.wikipedia.org/wiki/Dynamic_programming>`_::

source: @lru_cache(maxsize=None) def fib(n): if n < 2: return n return fib(n-1) + fib(n-2) >>> [fib(n) for n in range(16)] [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610] >>> fib.cache_info() CacheInfo(hits=28, misses=16, maxsize=None, currsize=16)
sv: @lru_cache(maxstorlek=None) def fib(n): om n < 2: returnera n returnera fib(n-1) + fib(n-2) >>> [fib(n) för n i intervall(16)] [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610] >>> fib.cache_info() CacheInfo(träffar=28, missar=16, maxstorlek=None, aktuell storlek=16)

source: Added the *typed* option.
sv: Alternativet *typed* har lagts till.

source: Added the *user_function* option.
sv: Lagt till alternativet *user_function*.

source: Added the function :func:`!cache_parameters`
sv: Lagt till funktionen :func:`!cache_parameters`

source: Given a class defining one or more rich comparison ordering methods, this class decorator supplies the rest. This simplifies the effort involved in specifying all of the possible rich comparison operations:
sv: Om en klass definierar en eller flera ordningsmetoder för rik jämförelse, tillhandahåller denna klassdekorator resten. Detta förenklar arbetet med att specificera alla möjliga operationer för rik jämförelse:

source: The class must define one of :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, or :meth:`~object.__ge__`. In addition, the class should supply an :meth:`~object.__eq__` method.
sv: Klassen måste definiera en av :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__` eller :meth:`~object.__ge__`. Dessutom bör klassen tillhandahålla en :meth:`~object.__eq__`-metod.

source: @total_ordering class Student: def _is_valid_operand(self, other): return (hasattr(other, "lastname") and hasattr(other, "firstname")) def __eq__(self, other): if not self._is_valid_operand(other): return NotImplemented return ((self.lastname.lower(), self.firstname.lower()) == (other.lastname.lower(), other.firstname.lower())) def __lt__(self, other): if not self._is_valid_operand(other): return NotImplemented return ((self.lastname.lower(), self.firstname.lower()) < (other.lastname.lower(), other.firstname.lower()))
sv: @total_beställning klass Student: def _is_valid_operand(self, other): return (hasattr(other, "efternamn") och hasattr(annan, "förnamn")) def __eq__(self, annan): if not self._is_valid_operand(other): return Ej implementerad return ((self.efternamn.lower(), self.förnamn.lower()) == (other.efternamn.lower()) (other.lastname.lower(), other.firstname.lower())) def __lt__(self, annan): if not self._is_valid_operand(other): return Ej implementerad return ((self.efternamn.lower(), self.förnamn.lower()) < (other.efternamn.lower(), other.förnamn.lower())))

source: While this decorator makes it easy to create well behaved totally ordered types, it *does* come at the cost of slower execution and more complex stack traces for the derived comparison methods. If performance benchmarking indicates this is a bottleneck for a given application, implementing all six rich comparison methods instead is likely to provide an easy speed boost.
sv: Den här dekoratorn gör det enkelt att skapa välfungerande, helt ordnade typer, men det sker på bekostnad av långsammare exekvering och mer komplexa stackspår för de härledda jämförelsemetoderna. Om prestandajämförelser visar att detta är en flaskhals för en viss applikation, är det troligt att det är enkelt att öka hastigheten genom att implementera alla sex rika jämförelsemetoderna istället.

source: This decorator makes no attempt to override methods that have been declared in the class *or its superclasses*. Meaning that if a superclass defines a comparison operator, *total_ordering* will not implement it again, even if the original method is abstract.
sv: Denna dekorator gör inga försök att åsidosätta metoder som har deklarerats i klassen *eller dess superklasser*. Det betyder att om en superklass definierar en jämförelseoperator, kommer *total_ordering* inte att implementera den igen, även om den ursprungliga metoden är abstrakt.

source: Returning ``NotImplemented`` from the underlying comparison function for unrecognised types is now supported.
sv: Det finns nu stöd för att returnera ``NotImplemented`` från den underliggande jämförelsefunktionen för okända typer.

source: A singleton object used as a sentinel to reserve a place for positional arguments when calling :func:`partial` and :func:`partialmethod`.
sv: Ett singleton-objekt som används som en sentinel för att reservera en plats för positionella argument vid anrop av :func:`partial` och :func:`partialmethod`.
