Repository: yeager/python-docs-sv
Catalog: library/getpass.po
Languages: sv

source: :mod:`!getpass` --- Portable password input
sv: :mod:`!getpass` --- Portabel inmatning av lösenord

source: **Source code:** :source:`Lib/getpass.py`
sv: **Källkod:** :source:`Lib/getpass.py`

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: The :mod:`getpass` module provides two functions:
sv: Modulen :mod:`getpass` innehåller två funktioner:

source: Prompt the user for a password without echoing. The user is prompted using the string *prompt*, which defaults to ``'Password: '``. On Unix, the prompt is written to the file-like object *stream* using the replace error handler if needed. *stream* defaults to the controlling terminal (:file:`/dev/tty`) or if that is unavailable to ``sys.stderr`` (this argument is ignored on Windows).
sv: Uppmanar användaren att ange ett lösenord utan eko. Användaren uppmanas att använda strängen *prompt*, som som standard är ``'Lösenord: '``. På Unix skrivs uppmaningen till det filliknande objektet *stream* med hjälp av felhanteraren replace om det behövs. *stream* används som standard till den kontrollerande terminalen (:file:`/dev/tty`) eller om den inte är tillgänglig till ``sys.stderr`` (detta argument ignoreras i Windows).

source: The *echo_char* argument controls how user input is displayed while typing. If *echo_char* is ``None`` (default), input remains hidden. Otherwise, *echo_char* must be a printable ASCII string and each typed character is replaced by it. For example, ``echo_char='*'`` will display asterisks instead of the actual input.
sv: Argumentet *echo_char* styr hur användarens inmatning visas när han eller hon skriver. Om *echo_char* är ``None`` (standard) förblir inmatningen dold. Annars måste *echo_char* vara en skrivbar ASCII-sträng och varje skrivet tecken ersätts av den. Till exempel kommer ``echo_char='*'`` att visa asterisker i stället för det faktiska inmatningstecknet.

source: If echo free input is unavailable getpass() falls back to printing a warning message to *stream* and reading from ``sys.stdin`` and issuing a :exc:`GetPassWarning`.
sv: Om echo free input inte är tillgänglig faller getpass() tillbaka till att skriva ut ett varningsmeddelande till *stream* och läsa från ``sys.stdin`` och utfärda en :exc:`GetPassWarning`.

source: If you call getpass from within IDLE, the input may be done in the terminal you launched IDLE from rather than the idle window itself.
sv: Om du anropar getpass från IDLE kan inmatningen ske i den terminal som du startade IDLE från i stället för i själva IDLE-fönstret.

source: Added the *echo_char* parameter for keyboard feedback.
sv: Lagt till parametern *echo_char* för feedback från tangentbordet.

source: A :exc:`UserWarning` subclass issued when password input may be echoed.
sv: En :exc:`UserWarning`-underklass som utfärdas när lösenordsinmatning kan ekas.

source: Return the "login name" of the user.
sv: Returnerar användarens "inloggningsnamn".

source: This function checks the environment variables :envvar:`LOGNAME`, :envvar:`USER`, :envvar:`!LNAME` and :envvar:`USERNAME`, in order, and returns the value of the first one which is set to a non-empty string. If none are set, the login name from the password database is returned on systems which support the :mod:`pwd` module, otherwise, an :exc:`OSError` is raised.
sv: Denna funktion kontrollerar miljövariablerna :envvar:`LOGNAME`, :envvar:`USER`, :envvar:`!LNAME` och :envvar:`USERNAME`, i tur och ordning, och returnerar värdet på den första som är satt till en icke-tom sträng. Om ingen är angiven returneras inloggningsnamnet från lösenordsdatabasen på system som stöder modulen :mod:`pwd`, annars genereras en :exc:`OSError`.

source: In general, this function should be preferred over :func:`os.getlogin`.
sv: I allmänhet bör denna funktion föredras framför :func:`os.getlogin`.

source: Previously, various exceptions beyond just :exc:`OSError` were raised.
sv: Tidigare skapades olika undantag utöver :exc:`OSError`.
