Repository: yeager/python-docs-sv
Catalog: library/gettext.po
Languages: sv

source: :mod:`!gettext` --- Multilingual internationalization services
sv: :mod:`!gettext` --- Flerspråkiga internationaliseringstjänster

source: **Source code:** :source:`Lib/gettext.py`
sv: **Källkod:** :source:`Lib/gettext.py`

source: The :mod:`gettext` module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. It supports both the GNU :program:`gettext` message catalog API and a higher level, class-based API that may be more appropriate for Python files. The interface described below allows you to write your module and application messages in one natural language, and provide a catalog of translated messages for running under different natural languages.
sv: Modulen :mod:`gettext` tillhandahåller tjänster för internationalisering (I18N) och lokalisering (L10N) för dina Python-moduler och -applikationer. Den stöder både GNU:s :program:`gettext` API för meddelandekatalog och ett klassbaserat API på högre nivå som kan vara mer lämpligt för Python-filer. Gränssnittet som beskrivs nedan gör att du kan skriva dina modul- och applikationsmeddelanden på ett naturligt språk och tillhandahålla en katalog med översatta meddelanden för körning på olika naturliga språk.

source: Some hints on localizing your Python modules and applications are also given.
sv: Några tips om hur du lokaliserar dina Python-moduler och applikationer ges också.

source: The :mod:`gettext` module defines the following API, which is very similar to the GNU :program:`gettext` API. If you use this API you will affect the translation of your entire application globally. Often this is what you want if your application is monolingual, with the choice of language dependent on the locale of your user. If you are localizing a Python module, or if your application needs to switch languages on the fly, you probably want to use the class-based API instead.
sv: Modulen :mod:`gettext` definierar följande API, som är mycket likt GNU:s API :program:`gettext`. Om du använder detta API kommer du att påverka översättningen av hela din applikation globalt. Ofta är detta vad du vill ha om din applikation är enspråkig, med valet av språk beroende på användarens lokala. Om du lokaliserar en Python-modul, eller om din applikation behöver byta språk i farten, vill du förmodligen använda det klassbaserade API:et istället.

source: Bind the *domain* to the locale directory *localedir*. More concretely, :mod:`gettext` will look for binary :file:`.mo` files for the given domain using the path (on Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, where *language* is searched for in the environment variables :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG` respectively.
sv: Bind *domän* till locale-katalogen *localedir*. Mer konkret kommer :mod:`gettext` att leta efter binära :file:`.mo`-filer för den angivna domänen med hjälp av sökvägen (på Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, där *språk* söks i miljövariablerna :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` respektive :envvar:`LANG`.

source: If *localedir* is omitted or ``None``, then the current binding for *domain* is returned. [#]_
sv: Om *localedir* utelämnas eller ``None``, returneras den aktuella bindningen för *domain*. [#]_

source: Change or query the current global domain. If *domain* is ``None``, then the current global domain is returned, otherwise the global domain is set to *domain*, which is returned.
sv: Ändrar eller frågar efter den aktuella globala domänen. Om *domain* är ``None`` returneras den aktuella globala domänen, annars sätts den globala domänen till *domain*, som returneras.

source: Return the localized translation of *message*, based on the current global domain, language, and locale directory. This function is usually aliased as :func:`!_` in the local namespace (see examples below).
sv: Returnerar den lokaliserade översättningen av *message*, baserat på den aktuella globala domänen, språket och locale-katalogen. Denna funktion är vanligtvis alias som :func:`!_` i den lokala namnrymden (se exempel nedan).

source: Like :func:`.gettext`, but look the message up in the specified *domain*.
sv: Som :func:`.gettext`, men letar upp meddelandet i den angivna *domänen*.

source: Like :func:`.gettext`, but consider plural forms. If a translation is found, apply the plural formula to *n*, and return the resulting message (some languages have more than two plural forms). If no translation is found, return *singular* if *n* is 1; return *plural* otherwise.
sv: Som :func:`.gettext`, men tar hänsyn till pluralformer. Om en översättning hittas, tillämpa pluralformeln på *n* och returnera det resulterande meddelandet (vissa språk har fler än två pluralformer). Om ingen översättning hittas returneras *singular* om *n* är 1; annars returneras *plural*.

source: The Plural formula is taken from the catalog header. It is a C or Python expression that has a free variable *n*; the expression evaluates to the index of the plural in the catalog. See `the GNU gettext documentation <https://www.gnu.org/software/gettext/manual/gettext.html>`__ for the precise syntax to be used in :file:`.po` files and the formulas for a variety of languages.
sv: Pluralformeln hämtas från kataloghuvudet. Det är ett C- eller Python-uttryck som har en fri variabel *n*; uttrycket utvärderas till indexet för plural i katalogen. Se "GNU gettext-dokumentationen" <https://www.gnu.org/software/gettext/manual/gettext.html>`__ för den exakta syntaxen som ska användas i :file:`.po`-filer och formlerna för en mängd olika språk.

source: Like :func:`ngettext`, but look the message up in the specified *domain*.
sv: Som :func:`ngettext`, men sök upp meddelandet i den angivna *domänen*.

source: Similar to the corresponding functions without the ``p`` in the prefix (that is, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), but the translation is restricted to the given message *context*.
sv: Liknar motsvarande funktioner utan ``p`` i prefixet (det vill säga :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), men översättningen är begränsad till det givna meddelandet *kontext*.

source: Note that GNU :program:`gettext` also defines a :func:`!dcgettext` method, but this was deemed not useful and so it is currently unimplemented.
sv: Observera att GNU :program:`gettext` också definierar en :func:`!dcgettext`-metod, men denna ansågs inte användbar och är därför för närvarande inte implementerad.

source: Here's an example of typical usage for this API::
sv: Här är ett exempel på typisk användning av detta API::

source: Class-based API
sv: Klassbaserat API

source: The class-based API of the :mod:`gettext` module gives you more flexibility and greater convenience than the GNU :program:`gettext` API. It is the recommended way of localizing your Python applications and modules. :mod:`!gettext` defines a :class:`GNUTranslations` class which implements the parsing of GNU :file:`.mo` format files, and has methods for returning strings. Instances of this class can also install themselves in the built-in namespace as the function :func:`!_`.
sv: Det klassbaserade API:et i modulen :mod:`gettext` ger dig mer flexibilitet och större bekvämlighet än GNU :program:`gettext` API:et. Det är det rekommenderade sättet att lokalisera dina Python-program och moduler. :mod:`!gettext` definierar en :class:`GNUTranslations`-klass som implementerar parsning av GNU :file:`.mo`-formatfiler och har metoder för att returnera strängar. Instanser av denna klass kan också installera sig själva i det inbyggda namnområdet som funktionen :func:`!_`.

source: This function implements the standard :file:`.mo` file search algorithm. It takes a *domain*, identical to what :func:`textdomain` takes. Optional *localedir* is as in :func:`bindtextdomain`. Optional *languages* is a list of strings, where each string is a language code.
sv: Denna funktion implementerar standardalgoritmen för filsökning i :file:`.mo`. Den tar en *domän*, identisk med vad :func:`textdomain` tar. Valfri *localedir* är som i :func:`bindtextdomain`. Valfritt *languages* är en lista med strängar, där varje sträng är en språkkod.

source: If *localedir* is not given, then the default system locale directory is used. [#]_ If *languages* is not given, then the following environment variables are searched: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG`. The first one returning a non-empty value is used for the *languages* variable. The environment variables should contain a colon separated list of languages, which will be split on the colon to produce the expected list of language code strings.
sv: Om *localedir* inte anges används standardkatalogen för systemspråk. [#]_ Om *languages* inte anges, söks följande miljövariabler: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` och :envvar:`LANG`. Den första som returnerar ett icke-tomt värde används för variabeln *languages*. Miljövariablerna bör innehålla en kolonseparerad lista över språk, som kommer att delas upp efter kolon för att ge den förväntade listan över språkkodsträngar.

source: :func:`find` then expands and normalizes the languages, and then iterates through them, searching for an existing file built of these components:
sv: :func:`find` expanderar och normaliserar språken och itererar sedan genom dem och söker efter en befintlig fil som är uppbyggd av dessa komponenter:

source: The first such file name that exists is returned by :func:`find`. If no such file is found, then ``None`` is returned. If *all* is given, it returns a list of all file names, in the order in which they appear in the languages list or the environment variables.
sv: Det första sådana filnamnet som finns returneras av :func:`find`. Om ingen sådan fil hittas returneras ``None``. Om *all* anges returneras en lista med alla filnamn i den ordning de förekommer i språklistan eller miljövariablerna.

source: Return a ``*Translations`` instance based on the *domain*, *localedir*, and *languages*, which are first passed to :func:`find` to get a list of the associated :file:`.mo` file paths. Instances with identical :file:`.mo` file names are cached. The actual class instantiated is *class_* if provided, otherwise :class:`GNUTranslations`. The class's constructor must take a single :term:`file object` argument.
sv: Returnerar en ``*Translations``-instans baserad på *domain*, *localedir* och *languages*, som först skickas till :func:`find` för att få en lista över de associerade :file:`.mo`-filsökvägarna. Instanser med identiska :file:`.mo`-filnamn cachelagras. Den faktiska klassen som instansieras är *class_* om den anges, annars :class:`GNUTranslations`. Klassens konstruktor måste ta ett enda :term:`filobjekt`-argument.

source: If multiple files are found, later files are used as fallbacks for earlier ones. To allow setting the fallback, :func:`copy.copy` is used to clone each translation object from the cache; the actual instance data is still shared with the cache.
sv: Om flera filer hittas används de senare filerna som fallback för de tidigare. För att göra det möjligt att ställa in fallback används :func:`copy.copy` för att klona varje översättningsobjekt från cacheminnet; de faktiska instansdata delas fortfarande med cacheminnet.

source: If no :file:`.mo` file is found, this function raises :exc:`OSError` if *fallback* is false (which is the default), and returns a :class:`NullTranslations` instance if *fallback* is true.
sv: Om ingen :file:`.mo`-fil hittas, ger denna funktion upphov till :exc:`OSError` om *fallback* är false (vilket är standard), och returnerar en :class:`NullTranslations`-instans om *fallback* är true.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
sv: :exc:`IOError` användes tidigare, nu är det ett alias för :exc:`OSError`.

source: *codeset* parameter is removed.
sv: *parametern codeset* har tagits bort.

source: This installs the function :func:`!_` in Python's builtins namespace, based on *domain* and *localedir* which are passed to the function :func:`translation`.
sv: Detta installerar funktionen :func:`!_` i Pythons namnrymd för inbyggda program, baserat på *domain* och *localedir* som skickas till funktionen :func:`translation`.

source: For the *names* parameter, please see the description of the translation object's :meth:`~NullTranslations.install` method.
sv: För parametern *names*, se beskrivningen av översättningsobjektets :meth:`~NullTranslations.install`-metod.

source: As seen below, you usually mark the strings in your application that are candidates for translation, by wrapping them in a call to the :func:`!_` function, like this::
sv: Som du ser nedan markerar du vanligtvis de strängar i din applikation som är kandidater för översättning genom att linda in dem i ett anrop till :func:`!_`-funktionen, så här::

source: print(_('This string will be translated.'))
sv: print(_('Den här strängen kommer att översättas.'))

source: For convenience, you want the :func:`!_` function to be installed in Python's builtins namespace, so it is easily accessible in all modules of your application.
sv: För enkelhetens skull vill du att funktionen :func:`!_` installeras i Pythons namnrymd för inbyggda funktioner, så att den är lättillgänglig i alla moduler i din applikation.

source: *names* is now a keyword-only parameter.
sv: *names* är nu en parameter som endast innehåller nyckelord.

source: The :class:`NullTranslations` class
sv: Klassen :class:`NullTranslations`

source: Translation classes are what actually implement the translation of original source file message strings to translated message strings. The base class used by all translation classes is :class:`NullTranslations`; this provides the basic interface you can use to write your own specialized translation classes. Here are the methods of :class:`!NullTranslations`:
sv: Översättningsklasser är det som faktiskt implementerar översättningen av originalfilens meddelandesträngar till översatta meddelandesträngar. Basklassen som används av alla översättningsklasser är :class:`NullTranslations`; detta ger det grundläggande gränssnittet som du kan använda för att skriva dina egna specialiserade översättningsklasser. Här är metoderna i :class:`!NullTranslations`:

source: Takes an optional :term:`file object` *fp*, which is ignored by the base class. Initializes "protected" instance variables *_info* and *_charset* which are set by derived classes, as well as *_fallback*, which is set through :meth:`add_fallback`. It then calls ``self._parse(fp)`` if *fp* is not ``None``.
sv: Tar emot ett valfritt :term:`file object` *fp*, som ignoreras av basklassen. Initialiserar "skyddade" instansvariabler *_info* och *_charset* som anges av härledda klasser, samt *_fallback*, som anges genom :meth:`add_fallback`. Den anropar sedan ``self._parse(fp)`` om *fp* inte är ``None``.

source: No-op in the base class, this method takes file object *fp*, and reads the data from the file, initializing its message catalog. If you have an unsupported message catalog file format, you should override this method to parse your format.
sv: Denna metod, som inte finns i basklassen, tar filobjektet *fp* och läser data från filen och initierar dess meddelandekatalog. Om du har ett filformat för meddelandekatalogen som inte stöds bör du åsidosätta den här metoden för att tolka ditt format.

source: Add *fallback* as the fallback object for the current translation object. A translation object should consult the fallback if it cannot provide a translation for a given message.
sv: Lägg till *fallback* som fallback-objekt för det aktuella översättningsobjektet. Ett översättningsobjekt bör konsultera fallbacken om det inte kan tillhandahålla en översättning för ett visst meddelande.

source: If a fallback has been set, forward :meth:`!gettext` to the fallback. Otherwise, return *message*. Overridden in derived classes.
sv: Om en fallback har angetts, vidarebefordra :meth:`!gettext` till fallbacken. Annars returneras *message*. Åsidosatt i härledda klasser.

source: If a fallback has been set, forward :meth:`!ngettext` to the fallback. Otherwise, return *singular* if *n* is 1; return *plural* otherwise. Overridden in derived classes.
sv: Om en fallback har angetts, vidarebefordra :meth:`!ngettext` till fallbacken. Annars returneras *singular* om *n* är 1; annars returneras *plural*. Åsidosatt i härledda klasser.

source: If a fallback has been set, forward :meth:`pgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
sv: Om en fallback har angetts, vidarebefordra :meth:`pgettext` till fallbacken. Annars returneras det översatta meddelandet. Åsidosatt i härledda klasser.

source: If a fallback has been set, forward :meth:`npgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
sv: Om en fallback har angetts, vidarebefordra :meth:`npgettext` till fallbacken. Annars returneras det översatta meddelandet. Överskriven i härledda klasser.

source: Return a dictionary containing the metadata found in the message catalog file.
sv: Returnerar en ordbok som innehåller de metadata som finns i meddelandekatalogfilen.

source: Return the encoding of the message catalog file.
sv: Returnera kodningen för filen med meddelandekatalogen.

source: This method installs :meth:`.gettext` into the built-in namespace, binding it to ``_``.
sv: Denna metod installerar :meth:`.gettext` i den inbyggda namnrymden och binder den till ``_``.

source: If the *names* parameter is given, it must be a sequence containing the names of functions you want to install in the builtins namespace in addition to :func:`!_`. Supported names are ``'gettext'``, ``'ngettext'``, ``'pgettext'``, and ``'npgettext'``.
sv: Om parametern *names* anges måste den vara en sekvens som innehåller namnen på de funktioner som du vill installera i namnrymden för builtins utöver :func:`!_`. Namn som stöds är ``'gettext'``, ``'ngettext'``, ``'pgettext'`` och ``'npgettext'``.

source: Note that this is only one way, albeit the most convenient way, to make the :func:`!_` function available to your application. Because it affects the entire application globally, and specifically the built-in namespace, localized modules should never install :func:`!_`. Instead, they should use this code to make :func:`!_` available to their module::
sv: Observera att det här bara är ett sätt, om än det mest praktiska, att göra funktionen :func:`!_` tillgänglig för ditt program. Eftersom den påverkar hela applikationen globalt, och särskilt det inbyggda namnområdet, bör lokaliserade moduler aldrig installera :func:`!_`. Istället bör de använda den här koden för att göra :func:`!_` tillgänglig för sin modul:

source: This puts :func:`!_` only in the module's global namespace and so only affects calls within this module.
sv: Detta placerar :func:`!_` endast i modulens globala namnrymd och påverkar därför endast anrop inom denna modul.

source: Added ``'pgettext'`` and ``'npgettext'``.
sv: Lagt till ``'pgettext'`` och ``'npgettext'``.

source: The :class:`GNUTranslations` class
sv: Klassen :class:`GNUTranslations`

source: The :mod:`!gettext` module provides one additional class derived from :class:`NullTranslations`: :class:`GNUTranslations`. This class overrides :meth:`!_parse` to enable reading GNU :program:`gettext` format :file:`.mo` files in both big-endian and little-endian format.
sv: Modulen :mod:`!gettext` tillhandahåller ytterligare en klass härledd från :class:`NullTranslations`: :class:`GNUTranslations`. Denna klass åsidosätter :meth:`!_parse` för att möjliggöra läsning av GNU :program:`gettext` format :file:`.mo` filer i både big-endian och little-endian format.

source: :class:`GNUTranslations` parses optional metadata out of the translation catalog. It is convention with GNU :program:`gettext` to include metadata as the translation for the empty string. This metadata is in :rfc:`822`\ -style ``key: value`` pairs, and should contain the ``Project-Id-Version`` key. If the key ``Content-Type`` is found, then the ``charset`` property is used to initialize the "protected" :attr:`!_charset` instance variable, defaulting to ``None`` if not found. If the charset encoding is specified, then all message ids and message strings read from the catalog are converted to Unicode using this encoding, else ASCII is assumed.
sv: :class:`GNUTranslations` analyserar valfria metadata från översättningskatalogen. Det är konvention med GNU :program:`gettext` att inkludera metadata som översättning för den tomma strängen. Dessa metadata är i :rfc:`822`` -stil ``nyckel: värde``-par, och bör innehålla nyckeln ``Project-Id-Version``. Om nyckeln ``Content-Type`` hittas, används egenskapen ``charset`` för att initiera den "skyddade" :attr:`!_charset`-instansvariabeln, som standard till ``None`` om den inte hittas. Om kodningen charset anges konverteras alla meddelande-id och meddelandesträngar som läses från katalogen till Unicode med hjälp av denna kodning, annars antas ASCII.

source: Since message ids are read as Unicode strings too, all ``*gettext()`` methods will assume message ids as Unicode strings, not byte strings.
sv: Eftersom meddelande-id:n också läses som Unicode-strängar kommer alla ``*gettext()``-metoder att anta att meddelande-id:n är Unicode-strängar, inte byte-strängar.

source: The entire set of key/value pairs are placed into a dictionary and set as the "protected" :attr:`!_info` instance variable.
sv: Hela uppsättningen nyckel-/värdepar placeras i en ordbok och anges som den "skyddade" instansvariabeln :attr:`!_info`.

source: If the :file:`.mo` file's magic number is invalid, the major version number is unexpected, or if other problems occur while reading the file, instantiating a :class:`GNUTranslations` class can raise :exc:`OSError`.
sv: Om :file:`.mo`-filens magiska nummer är ogiltigt, det stora versionsnumret är oväntat, eller om andra problem uppstår när filen läses, kan instansiering av en :class:`GNUTranslations`-klass ge upphov till :exc:`OSError`.

source: The following methods are overridden from the base class implementation:
sv: Följande metoder åsidosätts från basklassens implementation:

source: Look up the *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id, and a fallback has been set, the look up is forwarded to the fallback's :meth:`~NullTranslations.gettext` method. Otherwise, the *message* id is returned.
sv: Letar upp *message*-id i katalogen och returnerar motsvarande meddelandesträng som en Unicode-sträng. Om det inte finns någon post i katalogen för *message*-id och en reserv har angetts, vidarebefordras sökningen till reservens :meth:`~NullTranslations.gettext`-metod. I annat fall returneras id:t för *message*.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use. The returned message string is a Unicode string.
sv: Gör en pluralformsuppslagning av ett meddelande-id. *singular* används som meddelandets id vid uppslagning i katalogen, medan *n* används för att avgöra vilken pluralform som ska användas. Den returnerade meddelandesträngen är en Unicode-sträng.
