Repository: yeager/python-docs-sv
Catalog: library/gettext.po
Languages: sv

source: If the message id is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`~NullTranslations.ngettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
sv: Om meddelandets id inte finns i katalogen och en reserv anges, vidarebefordras begäran till reservens :meth:`~NullTranslations.ngettext`-metod. Annars returneras *singular* när *n* är 1, och *plural* returneras i alla andra fall.

source: Here is an example::
sv: Här är ett exempel::

source: Look up the *context* and *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id and *context*, and a fallback has been set, the look up is forwarded to the fallback's :meth:`pgettext` method. Otherwise, the *message* id is returned.
sv: Letar upp *context* och *message* id i katalogen och returnerar motsvarande meddelandesträng som en Unicode-sträng. Om det inte finns någon post i katalogen för *message* id och *context*, och en fallback har angetts, vidarebefordras sökningen till fallbackens :meth:`pgettext`-metod. Annars returneras *message* id.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use.
sv: Gör en pluralformsuppslagning av ett meddelande-id. *singular* används som meddelandets id vid uppslagning i katalogen, medan *n* används för att avgöra vilken pluralform som ska användas.

source: If the message id for *context* is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`npgettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
sv: Om meddelande-id för *kontext* inte finns i katalogen och en reserv anges, vidarebefordras begäran till reservens :meth:`npgettext`-metod. Annars returneras *singular* när *n* är 1, och *plural* returneras i alla andra fall.

source: Solaris message catalog support
sv: Stöd för Solaris meddelandekatalog

source: The Solaris operating system defines its own binary :file:`.mo` file format, but since no documentation can be found on this format, it is not supported at this time.
sv: Operativsystemet Solaris definierar sitt eget binära filformat :file:`.mo`, men eftersom det inte finns någon dokumentation om detta format stöds det inte för närvarande.

source: The Catalog constructor
sv: Katalogens konstruktör

source: GNOME uses a version of the :mod:`gettext` module by James Henstridge, but this version has a slightly different API. Its documented usage was::
sv: GNOME använder en version av modulen :mod:`gettext` av James Henstridge, men denna version har ett något annorlunda API. Dess dokumenterade användning var::

source: For compatibility with this older module, the function :func:`!Catalog` is an alias for the :func:`translation` function described above.
sv: För kompatibilitet med denna äldre modul är funktionen :func:`!Catalog` ett alias för funktionen :func:`translation` som beskrivs ovan.

source: One difference between this module and Henstridge's: his catalog objects supported access through a mapping API, but this appears to be unused and so is not currently supported.
sv: En skillnad mellan denna modul och Henstridges: hans katalogobjekt stödde åtkomst via ett mappnings-API, men detta verkar vara oanvänt och stöds därför inte för närvarande.

source: Internationalizing your programs and modules
sv: Internationalisera dina program och moduler

source: Internationalization (I18N) refers to the operation by which a program is made aware of multiple languages. Localization (L10N) refers to the adaptation of your program, once internationalized, to the local language and cultural habits. In order to provide multilingual messages for your Python programs, you need to take the following steps:
sv: Internationalisering (I18N) avser den process genom vilken ett program görs medvetet om att det kan användas på flera språk. Lokalisering (L10N) avser anpassningen av ditt program, när det väl har internationaliserats, till det lokala språket och kulturella vanor. För att kunna tillhandahålla flerspråkiga meddelanden för dina Python-program måste du vidta följande åtgärder:

source: prepare your program or module by specially marking translatable strings
sv: förbereda ditt program eller din modul genom att särskilt markera översättningsbara strängar

source: run a suite of tools over your marked files to generate raw messages catalogs
sv: köra en uppsättning verktyg över dina markerade filer för att generera kataloger över råmeddelanden

source: create language-specific translations of the message catalogs
sv: skapa språkspecifika översättningar av meddelandekatalogerna

source: use the :mod:`gettext` module so that message strings are properly translated
sv: använda modulen :mod:`gettext` så att meddelandesträngar översätts korrekt

source: In order to prepare your code for I18N, you need to look at all the strings in your files. Any string that needs to be translated should be marked by wrapping it in ``_('...')`` --- that is, a call to the function :func:`_ <gettext>`. For example::
sv: För att förbereda din kod för I18N måste du titta på alla strängar i dina filer. Varje sträng som behöver översättas bör markeras genom att den omsluts av ``_('...')`` --- det vill säga ett anrop till funktionen :func:`_ <gettext>`. Till exempel::

source: In this example, the string ``'writing a log message'`` is marked as a candidate for translation, while the strings ``'mylog.txt'`` and ``'w'`` are not.
sv: I det här exemplet markeras strängen ``'writing a log message'`` som en kandidat för översättning, medan strängarna ``'mylog.txt'`` och ``'w'`` inte gör det.

source: There are a few tools to extract the strings meant for translation. The original GNU :program:`gettext` only supported C or C++ source code but its extended version :program:`xgettext` scans code written in a number of languages, including Python, to find strings marked as translatable. `Babel <https://babel.pocoo.org/>`__ is a Python internationalization library that includes a :file:`pybabel` script to extract and compile message catalogs. François Pinard's program called :program:`xpot` does a similar job and is available as part of his `po-utils package <https://github.com/pinard/po-utils>`__.
sv: Det finns ett par verktyg för att extrahera de strängar som är avsedda för översättning. GNU:s ursprungliga :program:`gettext` stödde endast C- eller C++-källkod, men dess utökade version :program:`xgettext` skannar kod skriven i ett antal språk, inklusive Python, för att hitta strängar som markerats som översättningsbara. `Babel <https://babel.pocoo.org/>`__ är ett internationaliseringsbibliotek för Python som innehåller ett :file:`pybabel`-skript för att extrahera och sammanställa meddelandekataloger. François Pinards program som heter :program:`xpot` gör ett liknande jobb och finns tillgängligt som en del av hans `po-utils-paket <https://github.com/pinard/po-utils>`__.

source: (Python also includes pure-Python versions of these programs, called :program:`pygettext.py` and :program:`msgfmt.py`; some Python distributions will install them for you. :program:`pygettext.py` is similar to :program:`xgettext`, but only understands Python source code and cannot handle other programming languages such as C or C++. :program:`pygettext.py` supports a command-line interface similar to :program:`xgettext`; for details on its use, run ``pygettext.py --help``. :program:`msgfmt.py` is binary compatible with GNU :program:`msgfmt`. With these two programs, you may not need the GNU :program:`gettext` package to internationalize your Python applications.)
sv: (Python innehåller också rena Python-versioner av dessa program, kallade :program:`pygettext.py` och :program:`msgfmt.py`; vissa Python-distributioner installerar dem åt dig. :program:`pygettext.py` liknar :program:`xgettext`, men förstår bara Python-källkod och kan inte hantera andra programmeringsspråk som C eller C++. :program:`pygettext.py` stöder ett kommandoradsgränssnitt som liknar :program:`xgettext`; för detaljer om hur det används, kör ``pygettext.py --help``. :program:`msgfmt.py` är binärt kompatibelt med GNU :program:`msgfmt`. Med dessa två program behöver du kanske inte GNU :program:`gettext`-paketet för att internationalisera dina Python-program)

source: :program:`xgettext`, :program:`pygettext`, and similar tools generate :file:`.po` files that are message catalogs. They are structured human-readable files that contain every marked string in the source code, along with a placeholder for the translated versions of these strings.
sv: :program:`xgettext`, :program:`pygettext` och liknande verktyg genererar :file:`.po`-filer som är meddelandekataloger. De är strukturerade, läsbara filer som innehåller alla markerade strängar i källkoden, tillsammans med en platshållare för de översatta versionerna av dessa strängar.

source: Copies of these :file:`.po` files are then handed over to the individual human translators who write translations for every supported natural language. They send back the completed language-specific versions as a :file:`<language-name>.po` file that's compiled into a machine-readable :file:`.mo` binary catalog file using the :program:`msgfmt` program. The :file:`.mo` files are used by the :mod:`gettext` module for the actual translation processing at run-time.
sv: Kopior av dessa :file:`.po`-filer överlämnas sedan till de enskilda mänskliga översättarna som skriver översättningar för varje naturligt språk som stöds. De skickar tillbaka de färdiga språkspecifika versionerna som en :file:`<language-name>.po`-fil som sammanställs till en maskinläsbar :file:`.mo` binär katalogfil med hjälp av programmet :program:`msgfmt`. Filerna :file:`.mo` används av modulen :mod:`gettext` för den faktiska översättningsbearbetningen vid körning.

source: How you use the :mod:`gettext` module in your code depends on whether you are internationalizing a single module or your entire application. The next two sections will discuss each case.
sv: Hur du använder modulen :mod:`gettext` i din kod beror på om du internationaliserar en enskild modul eller hela programmet. De kommande två avsnitten kommer att diskutera varje fall.

source: Localizing your module
sv: Lokalisera din modul

source: If you are localizing your module, you must take care not to make global changes, e.g. to the built-in namespace. You should not use the GNU :program:`gettext` API but instead the class-based API.
sv: Om du lokaliserar din modul måste du se till att inte göra globala ändringar, t.ex. i det inbyggda namnområdet. Du bör inte använda GNU :program:`gettext` API utan istället det klassbaserade API:et.

source: Let's say your module is called "spam" and the module's various natural language translation :file:`.mo` files reside in :file:`/usr/share/locale` in GNU :program:`gettext` format. Here's what you would put at the top of your module::
sv: Låt oss säga att din modul heter "spam" och modulens olika översättningar av naturligt språk :file:`.mo`-filer finns i :file:`/usr/share/locale` i GNU :program:`gettext`-format. Så här skulle du skriva högst upp i din modul::

source: Localizing your application
sv: Lokalisera din applikation

source: If you are localizing your application, you can install the :func:`!_` function globally into the built-in namespace, usually in the main driver file of your application. This will let all your application-specific files just use ``_('...')`` without having to explicitly install it in each file.
sv: Om du lokaliserar ditt program kan du installera :func:`!_`-funktionen globalt i det inbyggda namnområdet, vanligtvis i programmets huvuddrivrutinsfil. Detta gör att alla dina applikationsspecifika filer bara använder ``_('...') `` utan att du uttryckligen behöver installera den i varje fil.

source: In the simple case then, you need only add the following bit of code to the main driver file of your application::
sv: I det enkla fallet behöver du bara lägga till följande kod i huvuddrivrutinsfilen för din applikation::

source: If you need to set the locale directory, you can pass it into the :func:`install` function::
sv: Om du behöver ange locale-katalogen kan du skicka den till funktionen :func:`install`::

source: Changing languages on the fly
sv: Byta språk i farten

source: If your program needs to support many languages at the same time, you may want to create multiple translation instances and then switch between them explicitly, like so::
sv: Om ditt program behöver stödja många språk samtidigt kanske du vill skapa flera översättningsinstanser och sedan växla mellan dem uttryckligen, så här::

source: Deferred translations
sv: Uppskjutna omräkningar

source: In most coding situations, strings are translated where they are coded. Occasionally however, you need to mark strings for translation, but defer actual translation until later. A classic example is::
sv: I de flesta kodningssituationer översätts strängar där de kodas. Ibland behöver du dock markera strängar för översättning, men skjuta upp den faktiska översättningen till senare. Ett klassiskt exempel är::

source: Here, you want to mark the strings in the ``animals`` list as being translatable, but you don't actually want to translate them until they are printed.
sv: Här vill du markera strängarna i listan ``djur`` som översättningsbara, men du vill faktiskt inte översätta dem förrän de skrivs ut.

source: Here is one way you can handle this situation::
sv: Här är ett sätt du kan hantera denna situation::

source: This works because the dummy definition of :func:`!_` simply returns the string unchanged. And this dummy definition will temporarily override any definition of :func:`!_` in the built-in namespace (until the :keyword:`del` command). Take care, though if you have a previous definition of :func:`!_` in the local namespace.
sv: Detta fungerar eftersom dummydefinitionen av :func:`!_` helt enkelt returnerar strängen oförändrad. Och denna dummydefinition kommer tillfälligt att åsidosätta alla definitioner av :func:`!_` i den inbyggda namnrymden (fram till kommandot :keyword:`del`). Var dock försiktig om du har en tidigare definition av :func:`!_` i den lokala namnrymden.

source: Note that the second use of :func:`!_` will not identify "a" as being translatable to the :program:`gettext` program, because the parameter is not a string literal.
sv: Observera att den andra användningen av :func:`!_` inte identifierar "a" som översättningsbart till programmet :program:`gettext`, eftersom parametern inte är en bokstavlig sträng.

source: Another way to handle this is with the following example::
sv: Ett annat sätt att hantera detta är med följande exempel::

source: In this case, you are marking translatable strings with the function :func:`!N_`, which won't conflict with any definition of :func:`!_`. However, you will need to teach your message extraction program to look for translatable strings marked with :func:`!N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract``, and :program:`xpot` all support this through the use of the :option:`!-k` command-line switch. The choice of :func:`!N_` here is totally arbitrary; it could have just as easily been :func:`!MarkThisStringForTranslation`.
sv: I det här fallet markerar du översättningsbara strängar med funktionen :func:`!N_`, vilket inte står i konflikt med någon definition av :func:`!_`. Du måste dock lära ditt program för extrahering av meddelanden att leta efter översättningsbara strängar markerade med :func:`!N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract`` och :program:`xpot` stöder alla detta genom att använda kommandoradsalternativet :option:`!-k`. Valet av :func:`!N_` här är helt godtyckligt; det kunde lika gärna ha varit :func:`!MarkThisStringForTranslation`.

source: Acknowledgements
sv: Tack till

source: The following people contributed code, feedback, design suggestions, previous implementations, and valuable experience to the creation of this module:
sv: Följande personer har bidragit med kod, feedback, designförslag, tidigare implementeringar och värdefull erfarenhet för att skapa denna modul:

source: Footnotes
sv: Fotnoter

source: The default locale directory is system dependent; for example, on Red Hat Linux it is :file:`/usr/share/locale`, but on Solaris it is :file:`/usr/lib/locale`. The :mod:`!gettext` module does not try to support these system dependent defaults; instead its default is :file:`{sys.base_prefix}/share/locale` (see :data:`sys.base_prefix`). For this reason, it is always best to call :func:`bindtextdomain` with an explicit absolute path at the start of your application.
sv: Standardkatalogen för locale är systemberoende; till exempel är den på Red Hat Linux :file:`/usr/share/locale`, men på Solaris är den :file:`/usr/lib/locale`. Modulen :mod:`!gettext` försöker inte stödja dessa systemberoende standardinställningar, utan dess standardinställning är :file:`{sys.base_prefix}/share/locale` (se :data:`sys.base_prefix`). Av denna anledning är det alltid bäst att anropa :func:`bindtextdomain` med en explicit absolut sökväg i början av din applikation.

source: See the footnote for :func:`bindtextdomain` above.
sv: Se fotnoten för :func:`bindtextdomain` ovan.

source: _ (underscore)
sv: _ (understreck)
