Repository: yeager/python-docs-sv
Catalog: library/glob.po
Languages: sv

source: :mod:`!glob` --- Unix style pathname pattern expansion
sv: :mod:`!glob` --- Utvidgning av söknamnsmönster i Unix-stil

source: **Source code:** :source:`Lib/glob.py`
sv: **Källkod:** :source:`Lib/glob.py`

source: The :mod:`glob` module finds all the pathnames matching a specified pattern according to the rules used by the Unix shell, although results are returned in arbitrary order. No tilde expansion is done, but ``*``, ``?``, and character ranges expressed with ``[]`` will be correctly matched. This is done by using the :func:`os.scandir` and :func:`fnmatch.fnmatch` functions in concert, and not by actually invoking a subshell.
sv: Modulen :mod:`glob` hittar alla sökvägar som matchar ett angivet mönster enligt de regler som används av Unix-skalet, även om resultaten returneras i godtycklig ordning. Ingen tilde-expansion görs, men ``*``, ``?`` och teckenintervall uttryckta med ``[]`` kommer att matchas korrekt. Detta görs genom att använda funktionerna :func:`os.scandir` och :func:`fnmatch.fnmatch` tillsammans, och inte genom att faktiskt anropa ett subshell.

source: Note that files beginning with a dot (``.``) can only be matched by patterns that also start with a dot, unlike :func:`fnmatch.fnmatch` or :func:`pathlib.Path.glob`. (For tilde and shell variable expansion, use :func:`os.path.expanduser` and :func:`os.path.expandvars`.)
sv: Observera att filer som börjar med en punkt (``.``) bara kan matchas av mönster som också börjar med en punkt, till skillnad från :func:`fnmatch.fnmatch` eller :func:`pathlib.Path.glob`. (För tilde och expansion av skalvariabler, använd :func:`os.path.expanduser` och :func:`os.path.expandvars`)

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
sv: För en bokstavlig matchning omsluter du metatecknen inom parentes. Till exempel matchar ``'[?]'`` tecknet ``'?'``.

source: The :mod:`glob` module defines the following functions:
sv: Modulen :mod:`glob` definierar följande funktioner:

source: Return a possibly empty list of path names that match *pathname*, which must be a string containing a path specification. *pathname* can be either absolute (like :file:`/usr/src/Python-1.5/Makefile`) or relative (like :file:`../../Tools/\*/\*.gif`), and can contain shell-style wildcards. Broken symlinks are included in the results (as in the shell). Whether or not the results are sorted depends on the file system. If a file that satisfies conditions is removed or added during the call of this function, whether a path name for that file will be included is unspecified.
sv: Returnerar en eventuellt tom lista med sökvägsnamn som matchar *sökvägsnamn*, som måste vara en sträng som innehåller en sökvägsspecifikation. *pathname* kan vara antingen absolut (som :file:`/usr/src/Python-1.5/Makefile`) eller relativt (som :file:`../../Tools/\*/\*.gif`) och kan innehålla jokertecken i shell-stil. Trasiga symlänkar inkluderas i resultaten (som i skalet). Huruvida resultaten sorteras eller inte beror på filsystemet. Om en fil som uppfyller villkoren tas bort eller läggs till under anropet av denna funktion, är det ospecificerat om ett sökvägsnamn för den filen kommer att inkluderas.

source: If *root_dir* is not ``None``, it should be a :term:`path-like object` specifying the root directory for searching. It has the same effect on :func:`glob` as changing the current directory before calling it. If *pathname* is relative, the result will contain paths relative to *root_dir*.
sv: Om *root_dir* inte är ``None``, bör det vara ett :term:`path-liknande objekt` som anger rotkatalogen för sökning. Det har samma effekt på :func:`glob` som att ändra den aktuella katalogen innan den anropas. Om *sökvägsnamn* är relativt kommer resultatet att innehålla sökvägar som är relativa till *root_dir*.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
sv: Denna funktion kan stödja :ref:`sökvägar i förhållande till katalogbeskrivare <dir_fd>` med parametern *dir_fd*.

source: If *recursive* is true, the pattern "``**``" will match any files and zero or more directories, subdirectories and symbolic links to directories. If the pattern is followed by an :data:`os.sep` or :data:`os.altsep` then files will not match.
sv: Om *recursive* är sant kommer mönstret "``**``" att matcha alla filer och noll eller fler kataloger, underkataloger och symboliska länkar till kataloger. Om mönstret följs av en :data:`os.sep` eller :data:`os.altsep` kommer filerna inte att matchas.

source: If *include_hidden* is true, "``**``" pattern will match hidden directories.
sv: Om *include_hidden* är sant kommer mönstret "``**``" att matcha dolda kataloger.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob`` with arguments ``pathname``, ``recursive``.
sv: Utlöser en :ref:`auditing event <auditing>` ``glob.glob`` med argumenten ``pathname``, ``recursive``.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob/2`` with arguments ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``glob.glob/2`` med argumenten ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
sv: Att använda mönstret "``**``" i stora katalogträd kan ta orimligt mycket tid i anspråk.

source: This function may return duplicate path names if *pathname* contains multiple "``**``" patterns and *recursive* is true.
sv: Denna funktion kan returnera duplicerade sökvägsnamn om *sökvägsnamn* innehåller flera "``**``"-mönster och *recursive* är true.

source: Support for recursive globs using "``**``".
sv: Stöd för rekursiva globs med hjälp av "``**``".

source: Added the *root_dir* and *dir_fd* parameters.
sv: Parametrarna *root_dir* och *dir_fd* har lagts till.

source: Added the *include_hidden* parameter.
sv: Parametern *include_hidden* har lagts till.

source: Return an :term:`iterator` which yields the same values as :func:`glob` without actually storing them all simultaneously.
sv: Returnerar en :term:`iterator` som ger samma värden som :func:`glob` utan att faktiskt lagra dem alla samtidigt.

source: Escape all special characters (``'?'``, ``'*'`` and ``'['``). This is useful if you want to match an arbitrary literal string that may have special characters in it. Special characters in drive/UNC sharepoints are not escaped, e.g. on Windows ``escape('//?/c:/Quo vadis?.txt')`` returns ``'//?/c:/Quo vadis[?].txt'``.
sv: Escape alla specialtecken (``'?'``, ``'*'`` och ``'['``). Detta är användbart om du vill matcha en godtycklig bokstavlig sträng som kan innehålla specialtecken. Specialtecken i drive/UNC sharepoints escapes inte, t.ex. på Windows ger ``escape('//?/c:/Quo vadis?.txt')`` ``'//?/c:/Quo vadis[?].txt'``.

source: Convert the given path specification to a regular expression for use with :func:`re.match`. The path specification can contain shell-style wildcards.
sv: Konverterar den angivna sökvägsspecifikationen till ett reguljärt uttryck för användning med :func:`re.match`. Sökvägsspecifikationen kan innehålla jokertecken i shell-stil.

source: For example:
sv: Till exempel:

source: Path separators and segments are meaningful to this function, unlike :func:`fnmatch.translate`. By default wildcards do not match path separators, and ``*`` pattern segments match precisely one path segment.
sv: Sökvägsseparatorer och segment är meningsfulla för den här funktionen, till skillnad från :func:`fnmatch.translate`. Som standard matchar inte jokertecken sökvägsseparatorer och ``*`` mönstersegment matchar exakt ett sökvägssegment.

source: If *recursive* is true, the pattern segment "``**``" will match any number of path segments.
sv: Om *recursive* är sant kommer mönstersegmentet "``**``" att matcha valfritt antal sökvägssegment.

source: If *include_hidden* is true, wildcards can match path segments that start with a dot (``.``).
sv: Om *include_hidden* är sant kan jokertecken matcha sökvägssegment som börjar med en punkt (``.``).

source: A sequence of path separators may be supplied to the *seps* argument. If not given, :data:`os.sep` and :data:`~os.altsep` (if available) are used.
sv: En sekvens av sökvägsseparatorer kan anges i argumentet *seps*. Om det inte anges används :data:`os.sep` och :data:`~os.altsep` (om tillgängliga).

source: :meth:`pathlib.PurePath.full_match` and :meth:`pathlib.Path.glob` methods, which call this function to implement pattern matching and globbing.
sv: :meth:`pathlib.PurePath.full_match` och :meth:`pathlib.Path.glob`, som anropar denna funktion för att implementera mönstermatchning och globbing.

source: Examples
sv: Exempel

source: Consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
sv: Betrakta en katalog som innehåller följande filer: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` och en underkatalog :file:`sub` som bara innehåller filen :file:`3.txt`. :func:`glob` ger följande resultat. Lägg märke till hur alla ledande komponenter i sökvägen bevaras. ::

source: >>> import glob >>> glob.glob('./[0-9].*') ['./1.gif', './2.txt'] >>> glob.glob('*.gif') ['1.gif', 'card.gif'] >>> glob.glob('?.gif') ['1.gif'] >>> glob.glob('**/*.txt', recursive=True) ['2.txt', 'sub/3.txt'] >>> glob.glob('./**/', recursive=True) ['./', './sub/']
sv: >>> import glob >>> glob.glob('./[0-9].*') ['./1.gif', './2.txt'] >>> glob.glob('*.gif') ['1.gif', 'card.gif'] >>> glob.glob('?.gif') ['1.gif'] >>> glob.glob('**.gif') >>> glob.glob('**/*.txt', rekursiv=True) ['2.txt', 'sub/3.txt'] >>> glob.glob(''**/*.txt'') >>> glob.glob('./**/', rekursiv=True) ['./', './sub/']

source: If the directory contains files starting with ``.`` they won't be matched by default. For example, consider a directory containing :file:`card.gif` and :file:`.card.gif`::
sv: Om katalogen innehåller filer som börjar med ``.`` kommer de inte att matchas som standard. Tänk till exempel på en katalog som innehåller :file:`card.gif` och :file:`.card.gif`::

source: The :mod:`fnmatch` module offers shell-style filename (not path) expansion.
sv: Modulen :mod:`fnmatch` erbjuder filnamnsexpansion (inte sökväg) i shell-stil.

source: The :mod:`pathlib` module offers high-level path objects.
sv: Modulen :mod:`pathlib` erbjuder sökvägsobjekt på hög nivå.

source: filenames
sv: filnamn

source: pathname expansion
sv: utökning av sökvägsnamn

source: in glob-style wildcards
sv: i glob-stil jokertecken

source: ? (question mark)
sv: ? (frågetecken)

source: [] (square brackets)
sv: [] (hakparenteser)

source: ! (exclamation)
sv: ! (utrop)

source: . (dot)
sv: . (punkt)
