Repository: yeager/python-docs-sv
Catalog: library/hashlib.po
Languages: sv

source: *leaf_size*: maximal byte length of leaf (0 to ``2**32-1``, 0 if unlimited or in sequential mode).
sv: *leaf_size*: maximal byte-längd för bladet (0 till ``2**32-1``, 0 om obegränsat eller i sekventiellt läge).

source: *node_offset*: node offset (0 to ``2**64-1`` for BLAKE2b, 0 to ``2**48-1`` for BLAKE2s, 0 for the first, leftmost, leaf, or in sequential mode).
sv: *node_offset*: nodoffset (0 till ``2**64-1`` för BLAKE2b, 0 till ``2**48-1`` för BLAKE2s, 0 för den första, längst till vänster, blad eller i sekventiellt läge).

source: *node_depth*: node depth (0 to 255, 0 for leaves, or in sequential mode).
sv: *node_depth*: noddjup (0 till 255, 0 för blad eller i sekventiellt läge).

source: *inner_size*: inner digest size (0 to 64 for BLAKE2b, 0 to 32 for BLAKE2s, 0 in sequential mode).
sv: *inner_size*: inner digest size (0 till 64 för BLAKE2b, 0 till 32 för BLAKE2s, 0 i sekventiellt läge).

source: *last_node*: boolean indicating whether the processed node is the last one (``False`` for sequential mode).
sv: *last_node*: boolean som anger om den bearbetade noden är den sista (``False`` för sekventiellt läge).

source: Explanation of tree mode parameters.
sv: Förklaring av parametrar för trädläge.

source: See section 2.10 in `BLAKE2 specification <https://www.blake2.net/blake2_20130129.pdf>`_ for comprehensive review of tree hashing.
sv: Se avsnitt 2.10 i `BLAKE2-specifikationen <https://www.blake2.net/blake2_20130129.pdf>`_ för en omfattande genomgång av trädhashing.

source: Constants
sv: Konstanter

source: Salt length (maximum length accepted by constructors).
sv: Saltlängd (maximal längd som accepteras av konstruktörer).

source: Personalization string length (maximum length accepted by constructors).
sv: Längd på personaliseringssträngen (maximal längd som accepteras av konstruktörerna).

source: Maximum key size.
sv: Maximal nyckelstorlek.

source: Maximum digest size that the hash function can output.
sv: Maximal digest-storlek som hashfunktionen kan mata ut.

source: Examples
sv: Exempel

source: Simple hashing
sv: Enkel hashing

source: To calculate hash of some data, you should first construct a hash object by calling the appropriate constructor function (:func:`blake2b` or :func:`blake2s`), then update it with the data by calling :meth:`~hash.update` on the object, and, finally, get the digest out of the object by calling :meth:`~hash.digest` (or :meth:`~hash.hexdigest` for hex-encoded string).
sv: För att beräkna hash för vissa data bör du först konstruera ett hashobjekt genom att anropa lämplig konstruktörsfunktion (:func:`blake2b` eller :func:`blake2s`), sedan uppdatera det med data genom att anropa :meth:`~hash.update` på objektet och slutligen få ut digest från objektet genom att anropa :meth:`~hash.digest` (eller :meth:`~hash.hexdigest` för hex-kodad sträng).

source: As a shortcut, you can pass the first chunk of data to update directly to the constructor as the positional argument:
sv: Som en genväg kan du skicka den första delen av data som ska uppdateras direkt till konstruktören som positionsargument:

source: You can call :meth:`hash.update` as many times as you need to iteratively update the hash:
sv: Du kan anropa :meth:`hash.update` så många gånger som du behöver för att iterativt uppdatera hashen:

source: Using different digest sizes
sv: Använda olika digest-storlekar

source: BLAKE2 has configurable size of digests up to 64 bytes for BLAKE2b and up to 32 bytes for BLAKE2s. For example, to replace SHA-1 with BLAKE2b without changing the size of output, we can tell BLAKE2b to produce 20-byte digests:
sv: BLAKE2 har konfigurerbar storlek på sammanställningar upp till 64 byte för BLAKE2b och upp till 32 byte för BLAKE2s. Om vi till exempel vill ersätta SHA-1 med BLAKE2b utan att ändra storleken på utdata kan vi säga till BLAKE2b att producera 20-byte-sammanställningar:

source: Hash objects with different digest sizes have completely different outputs (shorter hashes are *not* prefixes of longer hashes); BLAKE2b and BLAKE2s produce different outputs even if the output length is the same:
sv: Hashobjekt med olika digeststorlekar har helt olika utdata (kortare hash är *inte* prefix av längre hash); BLAKE2b och BLAKE2s ger olika utdata även om utdatalängden är densamma:

source: Keyed hashing
sv: Hashtagning med nyckel

source: Keyed hashing can be used for authentication as a faster and simpler replacement for `Hash-based message authentication code <https://en.wikipedia.org/wiki/HMAC>`_ (HMAC). BLAKE2 can be securely used in prefix-MAC mode thanks to the indifferentiability property inherited from BLAKE.
sv: Keyed hashing kan användas för autentisering som en snabbare och enklare ersättning för `Hash-based message authentication code <https://en.wikipedia.org/wiki/HMAC>`_ (HMAC). BLAKE2 kan användas på ett säkert sätt i prefix-MAC-läge tack vare egenskapen indifferentiability som ärvs från BLAKE.

source: This example shows how to get a (hex-encoded) 128-bit authentication code for message ``b'message data'`` with key ``b'pseudorandom key'``::
sv: Detta exempel visar hur man får en (hex-kodad) 128-bitars autentiseringskod för meddelande ``b'meddelandedata'`` med nyckel ``b'pseudorandomnyckel'``::

source: As a practical example, a web application can symmetrically sign cookies sent to users and later verify them to make sure they weren't tampered with::
sv: Som ett praktiskt exempel kan en webbapplikation symmetriskt signera cookies som skickas till användare och senare verifiera dem för att säkerställa att de inte har manipulerats:

source: Even though there's a native keyed hashing mode, BLAKE2 can, of course, be used in HMAC construction with :mod:`hmac` module::
sv: Även om det finns ett inbyggt hashningsläge med nyckel kan BLAKE2 naturligtvis användas i HMAC-konstruktion med :mod:`hmac` module::

source: Randomized hashing
sv: Slumpmässig hashing

source: By setting *salt* parameter users can introduce randomization to the hash function. Randomized hashing is useful for protecting against collision attacks on the hash function used in digital signatures.
sv: Genom att ställa in parametern *salt* kan användare införa randomisering i hashfunktionen. Randomiserad hashfunktion är användbar för att skydda mot kollisionsattacker på den hashfunktion som används i digitala signaturer.

source: Randomized hashing is designed for situations where one party, the message preparer, generates all or part of a message to be signed by a second party, the message signer. If the message preparer is able to find cryptographic hash function collisions (i.e., two messages producing the same hash value), then they might prepare meaningful versions of the message that would produce the same hash value and digital signature, but with different results (e.g., transferring $1,000,000 to an account, rather than $10). Cryptographic hash functions have been designed with collision resistance as a major goal, but the current concentration on attacking cryptographic hash functions may result in a given cryptographic hash function providing less collision resistance than expected. Randomized hashing offers the signer additional protection by reducing the likelihood that a preparer can generate two or more messages that ultimately yield the same hash value during the digital signature generation process --- even if it is practical to find collisions for the hash function. However, the use of randomized hashing may reduce the amount of security provided by a digital signature when all portions of the message are prepared by the signer.
sv: Slumpmässig hashfunktion är avsedd för situationer där en part, den som förbereder meddelandet, genererar hela eller delar av ett meddelande som ska signeras av en annan part, den som signerar meddelandet. Om den som förbereder meddelandet kan hitta kollisioner mellan kryptografiska hashfunktioner (dvs. två meddelanden som ger samma hashvärde) kan han eller hon förbereda meningsfulla versioner av meddelandet som ger samma hashvärde och digitala signatur, men med olika resultat (t.ex. överföring av 1 000 000 USD till ett konto i stället för 10 USD). Kryptografiska hashfunktioner har utformats med kollisionsmotstånd som ett huvudmål, men den nuvarande koncentrationen på att attackera kryptografiska hashfunktioner kan leda till att en viss kryptografisk hashfunktion ger mindre kollisionsmotstånd än förväntat. Slumpmässig hashning ger undertecknaren ytterligare skydd genom att minska sannolikheten för att en förberedare kan generera två eller flera meddelanden som i slutändan ger samma hashvärde under processen för generering av digitala signaturer --- även om det är praktiskt att hitta kollisioner för hashfunktionen. Användningen av randomiserad hashning kan dock minska den säkerhet som en digital signatur ger när alla delar av meddelandet förbereds av undertecknaren.

source: In BLAKE2 the salt is processed as a one-time input to the hash function during initialization, rather than as an input to each compression function.
sv: I BLAKE2 behandlas saltet som en engångsingång till hashfunktionen under initialiseringen, i stället för som en ingång till varje komprimeringsfunktion.

source: *Salted hashing* (or just hashing) with BLAKE2 or any other general-purpose cryptographic hash function, such as SHA-256, is not suitable for hashing passwords. See `BLAKE2 FAQ <https://www.blake2.net/#qa>`_ for more information.
sv: *Salted hashing* (eller bara hashing) med BLAKE2 eller någon annan kryptografisk hashfunktion för allmänt bruk, t.ex. SHA-256, är inte lämplig för hashing av lösenord. Se `BLAKE2 FAQ <https://www.blake2.net/#qa>`_ för mer information.

source: Personalization
sv: Anpassning

source: Sometimes it is useful to force hash function to produce different digests for the same input for different purposes. Quoting the authors of the Skein hash function:
sv: Ibland är det användbart att tvinga hashfunktionen att producera olika sammanställningar för samma indata för olika ändamål. Citerar författarna till Skein-hashfunktionen:

source: We recommend that all application designers seriously consider doing this; we have seen many protocols where a hash that is computed in one part of the protocol can be used in an entirely different part because two hash computations were done on similar or related data, and the attacker can force the application to make the hash inputs the same. Personalizing each hash function used in the protocol summarily stops this type of attack.
sv: Vi rekommenderar att alla applikationsdesigners allvarligt överväger att göra detta; vi har sett många protokoll där en hash som beräknas i en del av protokollet kan användas i en helt annan del eftersom två hashberäkningar gjordes på liknande eller relaterade data, och angriparen kan tvinga applikationen att göra hashingångarna desamma. Genom att anpassa varje hashfunktion som används i protokollet stoppas den här typen av angrepp.

source: BLAKE2 can be personalized by passing bytes to the *person* argument::
sv: BLAKE2 kan anpassas genom att skicka bytes till *person*-argumentet::

source: Personalization together with the keyed mode can also be used to derive different keys from a single one.
sv: Personalisering tillsammans med keyed mode kan också användas för att härleda olika nycklar från en enda.

source: Tree mode
sv: Trädläge

source: Here's an example of hashing a minimal tree with two leaf nodes::
sv: Här är ett exempel på hashing av ett minimalt träd med två bladnoder::

source: This example uses 64-byte internal digests, and returns the 32-byte final digest::
sv: I det här exemplet används 64-bytes interna sammanställningar och den slutliga sammanställningen på 32 byte returneras::

source: Credits
sv: Tack till

source: BLAKE2_ was designed by *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn*, and *Christian Winnerlein* based on SHA-3_ finalist BLAKE_ created by *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier*, and *Raphael C.-W. Phan*.
sv: BLAKE2_ designades av *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn* och *Christian Winnerlein* baserat på SHA-3_-finalisten BLAKE_ skapad av *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier* och *Raphael C.-W. Phan*.

source: It uses core algorithm from ChaCha_ cipher designed by *Daniel J. Bernstein*.
sv: Den använder kärnalgoritmen från ChaCha_-chiffer som designats av *Daniel J. Bernstein*.

source: The stdlib implementation is based on pyblake2_ module. It was written by *Dmitry Chestnykh* based on C implementation written by *Samuel Neves*. The documentation was copied from pyblake2_ and written by *Dmitry Chestnykh*.
sv: Stdlib-implementeringen är baserad på modulen pyblake2_. Den skrevs av *Dmitry Chestnykh* baserat på C-implementering skriven av *Samuel Neves*. Dokumentationen kopierades från pyblake2_ och skrevs av *Dmitry Chestnykh*.

source: The C code was partly rewritten for Python by *Christian Heimes*.
sv: C-koden har delvis skrivits om för Python av *Christian Heimes*.

source: The following public domain dedication applies for both C hash function implementation, extension code, and this documentation:
sv: Följande public domain-dedikation gäller för både implementeringen av C-hashfunktionen, tilläggskoden och denna dokumentation:

source: To the extent possible under law, the author(s) have dedicated all copyright and related and neighboring rights to this software to the public domain worldwide. This software is distributed without any warranty.
sv: I den utsträckning det är möjligt enligt lag har författaren/författarna tillägnat all upphovsrätt och alla närstående rättigheter till denna programvara till den offentliga domänen över hela världen. Denna programvara distribueras utan någon garanti.

source: You should have received a copy of the CC0 Public Domain Dedication along with this software. If not, see https://creativecommons.org/publicdomain/zero/1.0/.
sv: Du bör ha fått en kopia av CC0 Public Domain Dedication tillsammans med den här programvaran. Om inte, se https://creativecommons.org/publicdomain/zero/1.0/.

source: The following people have helped with development or contributed their changes to the project and the public domain according to the Creative Commons Public Domain Dedication 1.0 Universal:
sv: Följande personer har hjälpt till med utvecklingen eller bidragit med sina ändringar till projektet och den offentliga domänen enligt Creative Commons Public Domain Dedication 1.0 Universal:

source: Module :mod:`hmac`
sv: Modul :mod:`hmac`

source: A module to generate message authentication codes using hashes.
sv: En modul för att generera autentiseringskoder för meddelanden med hjälp av hash.

source: Module :mod:`base64`
sv: Modul :mod:`base64`

source: Another way to encode binary hashes for non-binary environments.
sv: Ett annat sätt att koda binära hashar för icke-binära miljöer.

source: The FIPS 180-4 publication on Secure Hash Algorithms.
sv: FIPS 180-4-publikationen om säkra hashalgoritmer.

source: The FIPS 202 publication on the SHA-3 Standard.
sv: FIPS 202-publikationen om SHA-3-standarden.

source: Official BLAKE2 website.
sv: Officiell webbplats för BLAKE2.

source: Wikipedia article with information on which algorithms have known issues and what that means regarding their use.
sv: Wikipedia-artikel med information om vilka algoritmer som har kända problem och vad det innebär för användningen av dem.

source: PKCS #5: Password-Based Cryptography Specification Version 2.1
sv: PKCS #5: Specifikation för lösenordsbaserad kryptografi version 2.1

source: NIST Recommendation for Password-Based Key Derivation.
sv: NIST:s rekommendation för lösenordsbaserad nyckelavledning.

source: message digest, MD5
sv: sammandragning av meddelanden, MD5

source: secure hash algorithm, SHA1, SHA2, SHA224, SHA256, SHA384, SHA512, SHA3, Shake, Blake2
sv: säker hashalgoritm, SHA1, SHA2, SHA224, SHA256, SHA384, SHA512, SHA3, Shake, Blake2

source: (use in module hashlib)
sv: (användning i modulen hashlib)
