Repository: yeager/python-docs-sv
Catalog: library/hashlib.po
Languages: sv

source: :mod:`!hashlib` --- Secure hashes and message digests
sv: :mod:`!hashlib` --- Säkra hashar och meddelandesammanställningar

source: **Source code:** :source:`Lib/hashlib.py`
sv: **Källkod:** :source:`Lib/hashlib.py`

source: This module implements a common interface to many different hash algorithms. Included are the FIPS secure hash algorithms SHA224, SHA256, SHA384, SHA512, (defined in `the FIPS 180-4 standard`_), the SHA-3 series (defined in `the FIPS 202 standard`_) as well as the legacy algorithms SHA1 (`formerly part of FIPS`_) and the MD5 algorithm (defined in internet :rfc:`1321`).
sv: Denna modul implementerar ett gemensamt gränssnitt för många olika hashalgoritmer. Här ingår de säkra FIPS-hashalgoritmerna SHA224, SHA256, SHA384, SHA512, (definierade i `the FIPS 180-4 standard`_), SHA-3-serien (definierad i `the FIPS 202 standard`_) samt de äldre algoritmerna SHA1 (`formerly part of FIPS`_) och MD5-algoritmen (definierad i internet :rfc:`1321`).

source: If you want the adler32 or crc32 hash functions, they are available in the :mod:`zlib` module.
sv: Om du vill ha hashfunktionerna adler32 eller crc32 finns de tillgängliga i modulen :mod:`zlib`.

source: Hash algorithms
sv: Hash-algoritmer

source: There is one constructor method named for each type of :dfn:`hash`. All return a hash object with the same simple interface. For example: use :func:`sha256` to create a SHA-256 hash object. You can now feed this object with :term:`bytes-like objects <bytes-like object>` (normally :class:`bytes`) using the :meth:`update<hash.update>` method. At any point you can ask it for the :dfn:`digest` of the concatenation of the data fed to it so far using the :meth:`digest()<hash.digest>` or :meth:`hexdigest()<hash.hexdigest>` methods.
sv: Det finns en konstruktörsmetod för varje typ av :dfn:`hash`. Alla returnerar ett hash-objekt med samma enkla gränssnitt. Till exempel: använd :func:`sha256` för att skapa ett SHA-256 hash-objekt. Du kan nu mata detta objekt med :term:`bytes-liknande objekt <bytes-like object>` (normalt :class:`bytes`) med hjälp av metoden :meth:`update<hash.update>`. När som helst kan du be den om :dfn:`digest` av sammankopplingen av de data som hittills matats till den med hjälp av metoderna :meth:`digest()<hash.digest>` eller :meth:`hexdigest()<hash.hexdigest>`.

source: To allow multithreading, the Python :term:`GIL` is released while computing a hash supplied more than 2047 bytes of data at once in its constructor or :meth:`.update<hash.update>` method.
sv: För att möjliggöra multithreading släpps Python :term:`GIL` när en hash beräknas som levererar mer än 2047 byte data samtidigt i sin konstruktor eller :meth:`.update<hash.update>`-metod.

source: Constructors for hash algorithms that are always present in this module are :func:`sha1`, :func:`sha224`, :func:`sha256`, :func:`sha384`, :func:`sha512`, :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`, :func:`blake2b`, and :func:`blake2s`. :func:`md5` is normally available as well, though it may be missing or blocked if you are using a rare "FIPS compliant" build of Python. These correspond to :data:`algorithms_guaranteed`.
sv: Konstruktörer för hashalgoritmer som alltid finns i denna modul är :func:`sha1`, :func:`sha224`, :func:`sha256`, :func:`sha384`, :func:`sha512`, :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`, :func:`blake2b`, och :func:`blake2s`. :func:`md5` är normalt också tillgänglig, men den kan saknas eller vara blockerad om du använder en sällsynt "FIPS-kompatibel" version av Python. Dessa motsvarar :data:`algorithms_guaranteed`.

source: Additional algorithms may also be available if your Python distribution's :mod:`hashlib` was linked against a build of OpenSSL that provides others. Others *are not guaranteed available* on all installations and will only be accessible by name via :func:`new`. See :data:`algorithms_available`.
sv: Ytterligare algoritmer kan också vara tillgängliga om din Python-distributions :mod:`hashlib` länkades mot en version av OpenSSL som tillhandahåller andra. Andra *är inte garanterat tillgängliga* på alla installationer och kommer endast att vara tillgängliga med namn via :func:`new`. Se :data:`algorithms_available`.

source: Some algorithms have known hash collision weaknesses (including MD5 and SHA1). Refer to `Attacks on cryptographic hash algorithms`_ and the `hashlib-seealso`_ section at the end of this document.
sv: Vissa algoritmer har kända svagheter när det gäller hashkollisioner (bland annat MD5 och SHA1). Se `Attacker mot kryptografiska hashalgoritmer`_ och avsnittet `hashlib-seealso`_ i slutet av det här dokumentet.

source: SHA3 (Keccak) and SHAKE constructors :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256` were added. :func:`blake2b` and :func:`blake2s` were added.
sv: SHA3 (Keccak) och SHAKE-konstruktörerna :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256` lades till. :func:`blake2b` och :func:`blake2s` lades till.

source: All hashlib constructors take a keyword-only argument *usedforsecurity* with default value ``True``. A false value allows the use of insecure and blocked hashing algorithms in restricted environments. ``False`` indicates that the hashing algorithm is not used in a security context, e.g. as a non-cryptographic one-way compression function.
sv: Alla hashlib-konstruktörer tar ett nyckelordsargument *usedforsecurity* med standardvärdet ``True``. Ett falskt värde gör det möjligt att använda osäkra och blockerade hashalgoritmer i begränsade miljöer. ``False`` anger att hashingalgoritmen inte används i säkerhetssammanhang, t.ex. som en icke-kryptografisk envägskomprimeringsfunktion.

source: Hashlib now uses SHA3 and SHAKE from OpenSSL if it provides it.
sv: Hashlib använder nu SHA3 och SHAKE från OpenSSL om det finns tillgängligt.

source: For any of the MD5, SHA1, SHA2, or SHA3 algorithms that the linked OpenSSL does not provide we fall back to a verified implementation from the `HACL\* project`_.
sv: För någon av algoritmerna MD5, SHA1, SHA2 eller SHA3 som den länkade OpenSSL inte tillhandahåller faller vi tillbaka på en verifierad implementering från `HACL\*-projektet`_.

source: Usage
sv: Användning

source: To obtain the digest of the byte string ``b"Nobody inspects the spammish repetition"``::
sv: För att erhålla digest av bytesträngen ``b"Ingen inspekterar den spammiga upprepningen"``::

source: More condensed:
sv: Mer komprimerad:

source: Constructors
sv: Konstruktörer

source: Is a generic constructor that takes the string *name* of the desired algorithm as its first parameter. It also exists to allow access to the above listed hashes as well as any other algorithms that your OpenSSL library may offer.
sv: Är en generisk konstruktör som tar strängen *namn* för den önskade algoritmen som sin första parameter. Den finns också för att ge tillgång till de ovan listade hasharna samt alla andra algoritmer som ditt OpenSSL-bibliotek kan erbjuda.

source: Using :func:`new` with an algorithm name:
sv: Använda :func:`new` med ett algoritmnamn:

source: Named constructors such as these are faster than passing an algorithm name to :func:`new`.
sv: Namngivna konstruktörer som dessa är snabbare än att skicka ett algoritmnamn till :func:`new`.

source: Attributes
sv: Attribut

source: Hashlib provides the following constant module attributes:
sv: Hashlib tillhandahåller följande attribut för konstanta moduler:

source: A set containing the names of the hash algorithms guaranteed to be supported by this module on all platforms. Note that 'md5' is in this list despite some upstream vendors offering an odd "FIPS compliant" Python build that excludes it.
sv: En uppsättning som innehåller namnen på de hashalgoritmer som garanterat stöds av denna modul på alla plattformar. Observera att 'md5' finns med i denna lista trots att vissa uppströmsleverantörer erbjuder en udda "FIPS-kompatibel" Python-byggnad som utesluter den.

source: A set containing the names of the hash algorithms that are available in the running Python interpreter. These names will be recognized when passed to :func:`new`. :attr:`algorithms_guaranteed` will always be a subset. The same algorithm may appear multiple times in this set under different names (thanks to OpenSSL).
sv: En uppsättning som innehåller namnen på de hashalgoritmer som är tillgängliga i den Python-tolk som körs. Dessa namn kommer att kännas igen när de skickas till :func:`new`. :attr:`algorithms_guaranteed` kommer alltid att vara en delmängd. Samma algoritm kan förekomma flera gånger i denna uppsättning under olika namn (tack vare OpenSSL).

source: Hash Objects
sv: Hash-objekt

source: The following values are provided as constant attributes of the hash objects returned by the constructors:
sv: Följande värden tillhandahålls som konstanta attribut för de hash-objekt som returneras av konstruktörerna:

source: The size of the resulting hash in bytes.
sv: Storleken på den resulterande hashen i bytes.

source: The internal block size of the hash algorithm in bytes.
sv: Den interna blockstorleken för hashalgoritmen i bytes.

source: A hash object has the following attributes:
sv: Ett hash-objekt har följande attribut:

source: The canonical name of this hash, always lowercase and always suitable as a parameter to :func:`new` to create another hash of this type.
sv: Det kanoniska namnet på denna hash, alltid gemener och alltid lämpligt som parameter till :func:`new` för att skapa en annan hash av denna typ.

source: The name attribute has been present in CPython since its inception, but until Python 3.4 was not formally specified, so may not exist on some platforms.
sv: Namnattributet har funnits i CPython sedan starten, men fram till Python 3.4 var det inte formellt specificerat, så det kanske inte finns på vissa plattformar.

source: A hash object has the following methods:
sv: Ett hash-objekt har följande metoder:

source: Update the hash object with the :term:`bytes-like object`. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a+b)``.
sv: Uppdaterar hash-objektet med :term:`bytesliknande objekt`. Upprepade anrop är likvärdiga med ett enda anrop med en sammankoppling av alla argument: ``m.update(a); m.update(b)`` är likvärdigt med ``m.update(a+b)``.

source: Return the digest of the data passed to the :meth:`update` method so far. This is a bytes object of size :attr:`digest_size` which may contain bytes in the whole range from 0 to 255.
sv: Returnerar sammanfattningen av de data som hittills skickats till :meth:`update`-metoden. Detta är ett bytesobjekt av storleken :attr:`digest_size` som kan innehålla bytes i hela intervallet 0 till 255.

source: Like :meth:`digest` except the digest is returned as a string object of double length, containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
sv: Som :meth:`digest` förutom att digestet returneras som ett strängobjekt med dubbel längd, som endast innehåller hexadecimala siffror. Detta kan användas för att utbyta värdet på ett säkert sätt i e-post eller andra icke-binära miljöer.

source: Return a copy ("clone") of the hash object. This can be used to efficiently compute the digests of data sharing a common initial substring.
sv: Returnerar en kopia ("klon") av hash-objektet. Detta kan användas för att effektivt beräkna digests av data som delar en gemensam initial substring.

source: SHAKE variable length digests
sv: SHAKE-digitaliseringar med variabel längd

source: The :func:`shake_128` and :func:`shake_256` algorithms provide variable length digests with length_in_bits//2 up to 128 or 256 bits of security. As such, their digest methods require a length. Maximum length is not limited by the SHAKE algorithm.
sv: Algoritmerna :func:`shake_128` och :func:`shake_256` ger digests av varierande längd med length_in_bits//2 upp till 128 eller 256 bitars säkerhet. Därför kräver deras digest-metoder en längd. Den maximala längden begränsas inte av SHAKE-algoritmen.

source: Return the digest of the data passed to the :meth:`~hash.update` method so far. This is a bytes object of size *length* which may contain bytes in the whole range from 0 to 255.
sv: Returnerar sammanfattningen av de data som hittills skickats till metoden :meth:`~hash.update`. Detta är ett bytesobjekt av storleken *length* som kan innehålla bytes i hela intervallet från 0 till 255.

source: Like :meth:`digest` except the digest is returned as a string object of double length, containing only hexadecimal digits. This may be used to exchange the value in email or other non-binary environments.
sv: Som :meth:`digest` förutom att digestet returneras som ett strängobjekt med dubbel längd, som endast innehåller hexadecimala siffror. Detta kan användas för att utbyta värdet i e-post eller andra icke-binära miljöer.

source: Example use:
sv: Exempel på användning:

source: File hashing
sv: Hashning av filer

source: The hashlib module provides a helper function for efficient hashing of a file or file-like object.
sv: Modulen hashlib tillhandahåller en hjälpfunktion för effektiv hashing av en fil eller ett filliknande objekt.

source: Return a digest object that has been updated with contents of file object.
sv: Returnerar ett digest-objekt som har uppdaterats med innehållet i filobjektet.

source: *fileobj* must be a file-like object opened for reading in binary mode. It accepts file objects from builtin :func:`open`, :class:`~io.BytesIO` instances, SocketIO objects from :meth:`socket.socket.makefile`, and similar. *fileobj* must be opened in blocking mode, otherwise a :exc:`BlockingIOError` may be raised.
sv: *fileobj* måste vara ett filliknande objekt som öppnas för läsning i binärt läge. Den accepterar filobjekt från inbyggda :func:`open`, :class:`~io.BytesIO`-instanser, SocketIO-objekt från :meth:`socket.socket.makefile` och liknande. *fileobj* måste öppnas i blockeringsläge, annars kan ett :exc:`BlockingIOError` uppstå.

source: The function may bypass Python's I/O and use the file descriptor from :meth:`~io.IOBase.fileno` directly. *fileobj* must be assumed to be in an unknown state after this function returns or raises. It is up to the caller to close *fileobj*.
sv: Funktionen kan förbigå Pythons I/O och använda filbeskrivaren från :meth:`~io.IOBase.fileno` direkt. *fileobj* måste antas vara i ett okänt tillstånd efter att denna funktion returneras eller höjs. Det är upp till den som anropar att stänga *fileobj*.

source: *digest* must either be a hash algorithm name as a *str*, a hash constructor, or a callable that returns a hash object.
sv: *digest* måste antingen vara ett namn på en hashalgoritm som en *str*, en hashkonstruktör eller en callable som returnerar ett hashobjekt.

source: Example:
sv: Exempel:

source: Now raises a :exc:`BlockingIOError` if the file is opened in blocking mode. Previously, spurious null bytes were added to the digest.
sv: Ger nu upphov till ett :exc:`BlockingIOError` om filen öppnas i blockeringsläge. Tidigare lades falska nollbytes till i sammanfattningen.

source: Key derivation
sv: Härledning av nycklar

source: Key derivation and key stretching algorithms are designed for secure password hashing. Naive algorithms such as ``sha1(password)`` are not resistant against brute-force attacks. A good password hashing function must be tunable, slow, and include a `salt <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_.
sv: Algoritmer för nyckelderivation och nyckelsträckning är utformade för säker hashing av lösenord. Naiva algoritmer som ``sha1(lösenord)`` är inte motståndskraftiga mot brute-force-attacker. En bra hashfunktion för lösenord måste vara inställbar, långsam och innehålla en `salt <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_.

source: The function provides PKCS#5 password-based key derivation function 2. It uses HMAC as pseudorandom function.
sv: Funktionen tillhandahåller PKCS#5 lösenordsbaserad nyckelavledningsfunktion 2. Den använder HMAC som pseudorandomfunktion.

source: The string *hash_name* is the desired name of the hash digest algorithm for HMAC, e.g. 'sha1' or 'sha256'. *password* and *salt* are interpreted as buffers of bytes. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
sv: Strängen *hash_name* är det önskade namnet på hashdigestalgoritmen för HMAC, t.ex. "sha1" eller "sha256". *password* och *salt* tolkas som buffertar av bytes. Program och bibliotek bör begränsa *password* till en vettig längd (t.ex. 1024). *salt* bör vara cirka 16 eller fler byte från en lämplig källa, t.ex. :func:`os.urandom`.

source: The number of *iterations* should be chosen based on the hash algorithm and computing power. As of 2022, hundreds of thousands of iterations of SHA-256 are suggested. For rationale as to why and how to choose what is best for your application, read *Appendix A.2.2* of NIST-SP-800-132_. The answers on the `stackexchange pbkdf2 iterations question`_ explain in detail.
sv: Antalet *iterationer* bör väljas baserat på hashalgoritmen och datorkraften. Från och med 2022 föreslås hundratusentals iterationer av SHA-256. För motivering till varför och hur man väljer vad som är bäst för din applikation, läs *Appendix A.2.2* i NIST-SP-800-132_. Svaren på `stackexchange pbkdf2 iterations question`_ förklarar i detalj.

source: *dklen* is the length of the derived key in bytes. If *dklen* is ``None`` then the digest size of the hash algorithm *hash_name* is used, e.g. 64 for SHA-512.
sv: *dklen* är längden på den härledda nyckeln i byte. Om *dklen* är ``None`` används digeststorleken för hashalgoritmen *hash_name*, t.ex. 64 för SHA-512.

source: Function only available when Python is compiled with OpenSSL.
sv: Funktionen är endast tillgänglig när Python är kompilerad med OpenSSL.

source: Function now only available when Python is built with OpenSSL. The slow pure Python implementation has been removed.
sv: Funktionen är nu endast tillgänglig när Python är byggt med OpenSSL. Den långsamma rena Python-implementationen har tagits bort.

source: The function provides scrypt password-based key derivation function as defined in :rfc:`7914`.
sv: Funktionen tillhandahåller en lösenordsbaserad nyckelavledningsfunktion för scrypt enligt definitionen i :rfc:`7914`.

source: *password* and *salt* must be :term:`bytes-like objects <bytes-like object>`. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
sv: *password* och *salt* måste vara :term:`bytesliknande objekt <bytes-like object>`. Program och bibliotek bör begränsa *password* till en rimlig längd (t.ex. 1024). *salt* bör vara cirka 16 eller fler byte från en lämplig källa, t.ex. :func:`os.urandom`.

source: *n* is the CPU/Memory cost factor, *r* the block size, *p* parallelization factor and *maxmem* limits memory (OpenSSL 1.1.0 defaults to 32 MiB). *dklen* is the length of the derived key in bytes.
sv: *n* är kostnadsfaktorn för CPU/minne, *r* blockstorleken, *p* parallelliseringsfaktorn och *maxmem* begränsar minnet (OpenSSL 1.1.0 är 32 MiB som standard). *dklen* är längden på den härledda nyckeln i byte.

source: BLAKE2_ is a cryptographic hash function defined in :rfc:`7693` that comes in two flavors:
sv: BLAKE2_ är en kryptografisk hashfunktion som definieras i :rfc:`7693` och finns i två varianter:

source: **BLAKE2b**, optimized for 64-bit platforms and produces digests of any size between 1 and 64 bytes,
sv: **BLAKE2b**, optimerad för 64-bitars plattformar och producerar digests i alla storlekar mellan 1 och 64 byte,

source: **BLAKE2s**, optimized for 8- to 32-bit platforms and produces digests of any size between 1 and 32 bytes.
sv: **BLAKE2s**, optimerad för 8- till 32-bitars plattformar och producerar digests i alla storlekar mellan 1 och 32 byte.

source: BLAKE2 supports **keyed mode** (a faster and simpler replacement for HMAC_), **salted hashing**, **personalization**, and **tree hashing**.
sv: BLAKE2 stöder **keyed mode** (en snabbare och enklare ersättning för HMAC_), **salted hashing**, **personalization** och **tree hashing**.

source: Hash objects from this module follow the API of standard library's :mod:`hashlib` objects.
sv: Hash-objekt från den här modulen följer API:et för standardbibliotekets :mod:`hashlib`-objekt.

source: Creating hash objects
sv: Skapa hash-objekt

source: New hash objects are created by calling constructor functions:
sv: Nya hash-objekt skapas genom att anropa konstruktörsfunktioner:

source: These functions return the corresponding hash objects for calculating BLAKE2b or BLAKE2s. They optionally take these general parameters:
sv: Dessa funktioner returnerar motsvarande hash-objekt för beräkning av BLAKE2b eller BLAKE2s. De tar valfritt dessa allmänna parametrar:

source: *data*: initial chunk of data to hash, which must be :term:`bytes-like object`. It can be passed only as positional argument.
sv: *data*: den första delen av data som ska hashas, som måste vara :term:`bytesliknande objekt`. Det kan endast skickas som ett positionellt argument.

source: *digest_size*: size of output digest in bytes.
sv: *digest_size*: storlek på utmatad digest i byte.

source: *key*: key for keyed hashing (up to 64 bytes for BLAKE2b, up to 32 bytes for BLAKE2s).
sv: *key*: nyckel för hashing med nyckel (upp till 64 byte för BLAKE2b, upp till 32 byte för BLAKE2s).

source: *salt*: salt for randomized hashing (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
sv: *salt*: salt för randomiserad hashing (upp till 16 byte för BLAKE2b, upp till 8 byte för BLAKE2s).

source: *person*: personalization string (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
sv: *person*: personaliseringssträng (upp till 16 byte för BLAKE2b, upp till 8 byte för BLAKE2s).

source: The following table shows limits for general parameters (in bytes):
sv: I följande tabell visas gränser för allmänna parametrar (i byte):

source: BLAKE2 specification defines constant lengths for salt and personalization parameters, however, for convenience, this implementation accepts byte strings of any size up to the specified length. If the length of the parameter is less than specified, it is padded with zeros, thus, for example, ``b'salt'`` and ``b'salt\x00'`` is the same value. (This is not the case for *key*.)
sv: BLAKE2-specifikationen definierar konstanta längder för salt- och personaliseringsparametrar, men för enkelhetens skull accepterar den här implementationen bytesträngar av valfri storlek upp till den angivna längden. Om parameterns längd är mindre än den angivna fylls den på med nollor, vilket innebär att till exempel ``b'salt'`` och ``b'salt\x00'`` är samma värde. (Detta är inte fallet för *key*.)

source: These sizes are available as module `constants`_ described below.
sv: Dessa storlekar finns tillgängliga som modul `konstanter`_ som beskrivs nedan.

source: Constructor functions also accept the following tree hashing parameters:
sv: Konstruktörsfunktionerna accepterar även följande parametrar för trädhashning:

source: *fanout*: fanout (0 to 255, 0 if unlimited, 1 in sequential mode).
sv: *fanout*: fanout (0 till 255, 0 om obegränsad, 1 i sekventiellt läge).

source: *depth*: maximal depth of tree (1 to 255, 255 if unlimited, 1 in sequential mode).
sv: *depth*: trädets maximala djup (1 till 255, 255 om det är obegränsat, 1 i sekventiellt läge).
