Repository: yeager/python-docs-sv
Catalog: library/heapq.po
Languages: sv

source: Heaps are also very useful in big disk sorts. You most probably all know that a big sort implies producing "runs" (which are pre-sorted sequences, whose size is usually related to the amount of CPU memory), followed by a merging passes for these runs, which merging is often very cleverly organised [#]_. It is very important that the initial sort produces the longest runs possible. Tournaments are a good way to achieve that. If, using all the memory available to hold a tournament, you replace and percolate items that happen to fit the current run, you'll produce runs which are twice the size of the memory for random input, and much better for input fuzzily ordered.
sv: Heaps är också mycket användbara i stora disksorteringar. Du vet säkert alla att en stor sortering innebär att man producerar "körningar" (som är försorterade sekvenser, vars storlek vanligtvis är relaterad till mängden CPU-minne), följt av ett sammanslagningspass för dessa körningar, vilken sammanslagning ofta är mycket smart organiserad [#]_. Det är mycket viktigt att den inledande sorteringen ger så långa körningar som möjligt. Turneringar är ett bra sätt att uppnå detta. Om du använder allt minne som finns tillgängligt för att hålla en turnering, ersätter och perkolerar objekt som råkar passa den aktuella körningen, kommer du att producera körningar som är dubbelt så stora som minnet för slumpmässig inmatning, och mycket bättre för inmatning som är luddigt ordnad.

source: Moreover, if you output the 0'th item on disk and get an input which may not fit in the current tournament (because the value "wins" over the last output value), it cannot fit in the heap, so the size of the heap decreases. The freed memory could be cleverly reused immediately for progressively building a second heap, which grows at exactly the same rate the first heap is melting. When the first heap completely vanishes, you switch heaps and start a new run. Clever and quite effective!
sv: Dessutom, om du matar ut det 0:e objektet på disken och får en inmatning som inte får plats i den aktuella turneringen (eftersom värdet "vinner" över det senaste utmatningsvärdet), kan det inte få plats i högen, så storleken på högen minskar. Det frigjorda minnet kan på ett smart sätt omedelbart återanvändas för att successivt bygga upp en andra hög, som växer i exakt samma takt som den första högen smälter. När den första högen helt försvinner byter man hög och startar en ny körning. Smart och ganska effektivt!

source: In a word, heaps are useful memory structures to know. I use them in a few applications, and I think it is good to keep a 'heap' module around. :-)
sv: Kort sagt, heaps är användbara minnesstrukturer att känna till. Jag använder dem i några program, och jag tror att det är bra att ha en "heap"-modul :-)

source: Footnotes
sv: Fotnoter

source: The disk balancing algorithms which are current, nowadays, are more annoying than clever, and this is a consequence of the seeking capabilities of the disks. On devices which cannot seek, like big tape drives, the story was quite different, and one had to be very clever to ensure (far in advance) that each tape movement will be the most effective possible (that is, will best participate at "progressing" the merge). Some tapes were even able to read backwards, and this was also used to avoid the rewinding time. Believe me, real good tape sorts were quite spectacular to watch! From all times, sorting has always been a Great Art! :-)
sv: De algoritmer för diskbalansering som används nuförtiden är mer irriterande än smarta, och detta är en följd av diskarnas sökfunktioner. På enheter som inte kan söka, som stora bandstationer, var historien en helt annan, och man var tvungen att vara mycket smart för att säkerställa (långt i förväg) att varje bandrörelse skulle vara så effektiv som möjligt (det vill säga bäst bidra till att "föra fram" sammanfogningen). Vissa band kunde till och med läsas baklänges, och detta användes också för att undvika omspolningstiden. Tro mig, riktigt bra bandsorteringar var ganska spektakulära att se! Från alla tider har sortering alltid varit en stor konst! :-)
