Repository: yeager/python-docs-sv
Catalog: library/hmac.po
Languages: sv

source: :mod:`!hmac` --- Keyed-Hashing for Message Authentication
sv: :mod:`!hmac` --- Keyed-Hashing för autentisering av meddelanden

source: **Source code:** :source:`Lib/hmac.py`
sv: **Källkod:** :source:`Lib/hmac.py`

source: This module implements the HMAC algorithm as described by :rfc:`2104`. The interface allows to use any hash function with a *fixed* digest size. In particular, extendable output functions such as SHAKE-128 or SHAKE-256 cannot be used with HMAC.
sv: Denna modul implementerar HMAC-algoritmen enligt beskrivningen i :rfc:`2104`. Gränssnittet gör det möjligt att använda alla hashfunktioner med en *fixerad* digeststorlek. I synnerhet kan utdragbara utdatafunktioner som SHAKE-128 eller SHAKE-256 inte användas med HMAC.

source: Return a new hmac object. *key* is a bytes or bytearray object giving the secret key. If *msg* is present, the method call ``update(msg)`` is made. *digestmod* is the digest name, digest constructor or module for the HMAC object to use. It may be any name suitable to :func:`hashlib.new`. Despite its argument position, it is required.
sv: Returnerar ett nytt hmac-objekt. *key* är ett bytes- eller bytearray-objekt som anger den hemliga nyckeln. Om *msg* är närvarande görs metodanropet ``update(msg)``. *digestmod* är digest-namnet, digest-konstruktören eller modulen för HMAC-objektet som ska användas. Det kan vara vilket namn som helst som är lämpligt för :func:`hashlib.new`. Trots argumentets position är det obligatoriskt.

source: Parameter *key* can be a bytes or bytearray object. Parameter *msg* can be of any type supported by :mod:`hashlib`. Parameter *digestmod* can be the name of a hash algorithm.
sv: Parameter *key* kan vara ett bytes- eller bytearray-objekt. Parametern *msg* kan vara av vilken typ som helst som stöds av :mod:`hashlib`. Parametern *digestmod* kan vara namnet på en hashalgoritm.

source: The *digestmod* argument is now required. Pass it as a keyword argument to avoid awkwardness when you do not have an initial *msg*.
sv: Argumentet *digestmod* är nu obligatoriskt. Skicka det som ett nyckelordsargument för att undvika besvärligheter när du inte har en inledande *msg*.

source: Return digest of *msg* for given secret *key* and *digest*. The function is equivalent to ``HMAC(key, msg, digest).digest()``, but uses an optimized C or inline implementation, which is faster for messages that fit into memory. The parameters *key*, *msg*, and *digest* have the same meaning as in :func:`~hmac.new`.
sv: Returnerar digest av *msg* för given hemlighet *key* och *digest*. Funktionen är likvärdig med ``HMAC(key, msg, digest).digest()``, men använder en optimerad C- eller inline-implementering, som är snabbare för meddelanden som ryms i minnet. Parametrarna *key*, *msg* och *digest* har samma betydelse som i :func:`~hmac.new`.

source: CPython implementation detail, the optimized C implementation is only used when *digest* is a string and name of a digest algorithm, which is supported by OpenSSL.
sv: CPython-implementeringsdetalj, den optimerade C-implementeringen används endast när *digest* är en sträng och namnet på en digest-algoritm, som stöds av OpenSSL.

source: An HMAC object has the following methods:
sv: Ett HMAC-objekt har följande metoder:

source: Update the hmac object with *msg*. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a + b)``.
sv: Uppdatera hmac-objektet med *msg*. Upprepade anrop är likvärdiga med ett enda anrop med sammankoppling av alla argument: ``m.update(a); m.update(b)`` är likvärdigt med ``m.update(a + b)``.

source: Parameter *msg* can be of any type supported by :mod:`hashlib`.
sv: Parametern *msg* kan vara av vilken typ som helst som stöds av :mod:`hashlib`.

source: Return the digest of the bytes passed to the :meth:`update` method so far. This bytes object will be the same length as the *digest_size* of the digest given to the constructor. It may contain non-ASCII bytes, including NUL bytes.
sv: Returnerar sammanfattningen av de bytes som hittills skickats till :meth:`update`-metoden. Detta bytes-objekt kommer att vara lika långt som *digest_size* för den digest som ges till konstruktören. Det kan innehålla icke-ASCII-bytes, inklusive NUL-bytes.

source: When comparing the output of :meth:`digest` to an externally supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
sv: När utdata från :meth:`digest` jämförs med en externt levererad digest under en verifieringsrutin, rekommenderas att funktionen :func:`compare_digest` används i stället för operatorn ``==`` för att minska sårbarheten för tidsattacker.

source: Like :meth:`digest` except the digest is returned as a string twice the length containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
sv: Som :meth:`digest` förutom att digestet returneras som en dubbelt så lång sträng som endast innehåller hexadecimala siffror. Detta kan användas för att utbyta värdet på ett säkert sätt i e-post eller andra icke-binära miljöer.

source: When comparing the output of :meth:`hexdigest` to an externally supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
sv: När utdata från :meth:`hexdigest` jämförs med en externt levererad sammanställning under en verifieringsrutin, rekommenderas det att använda funktionen :func:`compare_digest` istället för operatorn ``==`` för att minska sårbarheten för tidsattacker.

source: Return a copy ("clone") of the hmac object. This can be used to efficiently compute the digests of strings that share a common initial substring.
sv: Returnerar en kopia ("klon") av hmac-objektet. Detta kan användas för att effektivt beräkna digests av strängar som delar en gemensam initial delsträng.

source: A hash object has the following attributes:
sv: Ett hash-objekt har följande attribut:

source: The size of the resulting HMAC digest in bytes.
sv: Storleken på den resulterande HMAC-digesten i byte.

source: The internal block size of the hash algorithm in bytes.
sv: Den interna blockstorleken för hashalgoritmen i bytes.

source: The canonical name of this HMAC, always lowercase, e.g. ``hmac-md5``.
sv: Det kanoniska namnet på denna HMAC, alltid med små bokstäver, t.ex. ``hmac-md5``.

source: Removed the undocumented attributes ``HMAC.digest_cons``, ``HMAC.inner``, and ``HMAC.outer``.
sv: Tog bort de odokumenterade attributen ``HMAC.digest_cons``, ``HMAC.inner`` och ``HMAC.outer``.

source: This module also provides the following helper function:
sv: Denna modul innehåller också följande hjälpfunktion:

source: Return ``a == b``. This function uses an approach designed to prevent timing analysis by avoiding content-based short circuiting behaviour, making it appropriate for cryptography. *a* and *b* must both be of the same type: either :class:`str` (ASCII only, as e.g. returned by :meth:`HMAC.hexdigest`), or a :term:`bytes-like object`.
sv: Returnerar ``a == b``. Denna funktion använder ett tillvägagångssätt som är utformat för att förhindra tidsanalys genom att undvika innehållsbaserat kortslutningsbeteende, vilket gör den lämplig för kryptografi. *a* och *b* måste båda vara av samma typ: antingen :class:`str` (endast ASCII, som t.ex. returneras av :meth:`HMAC.hexdigest`), eller en :term:`bytesliknande objekt`.

source: If *a* and *b* are of different lengths, or if an error occurs, a timing attack could theoretically reveal information about the types and lengths of *a* and *b*—but not their values.
sv: Om *a* och *b* är olika långa, eller om ett fel inträffar, kan en tidsattack teoretiskt sett avslöja information om typerna och längderna på *a* och *b* - men inte deras värden.

source: The function uses OpenSSL's ``CRYPTO_memcmp()`` internally when available.
sv: Funktionen använder OpenSSL:s ``CRYPTO_memcmp()`` internt när den är tillgänglig.

source: Module :mod:`hashlib`
sv: Modul :mod:`hashlib`

source: The Python module providing secure hash functions.
sv: Python-modul som tillhandahåller säkra hashfunktioner.
