Repository: yeager/python-docs-sv
Catalog: library/http.cookiejar.po
Languages: sv

source: :mod:`!http.cookiejar` --- Cookie handling for HTTP clients
sv: :mod:`!http.cookiejar` --- Cookiehantering för HTTP-klienter

source: **Source code:** :source:`Lib/http/cookiejar.py`
sv: **Källkod:** :source:`Lib/http/cookiejar.py`

source: The :mod:`http.cookiejar` module defines classes for automatic handling of HTTP cookies. It is useful for accessing web sites that require small pieces of data -- :dfn:`cookies` -- to be set on the client machine by an HTTP response from a web server, and then returned to the server in later HTTP requests.
sv: Modulen :mod:`http.cookiejar` definierar klasser för automatisk hantering av HTTP-cookies. Den är användbar för att komma åt webbplatser som kräver att små bitar av data -- :dfn:`cookies` -- sätts på klientmaskinen av ett HTTP-svar från en webbserver och sedan returneras till servern i senare HTTP-förfrågningar.

source: Both the regular Netscape cookie protocol and the protocol defined by :rfc:`2965` are handled. RFC 2965 handling is switched off by default. :rfc:`2109` cookies are parsed as Netscape cookies and subsequently treated either as Netscape or RFC 2965 cookies according to the 'policy' in effect. Note that the great majority of cookies on the internet are Netscape cookies. :mod:`http.cookiejar` attempts to follow the de-facto Netscape cookie protocol (which differs substantially from that set out in the original Netscape specification), including taking note of the ``max-age`` and ``port`` cookie-attributes introduced with RFC 2965.
sv: Både det vanliga Netscape-cookieprotokollet och det protokoll som definieras av :rfc:`2965` hanteras. RFC 2965-hanteringen är avstängd som standard. :rfc:`2109`-cookies analyseras som Netscape-cookies och behandlas därefter antingen som Netscape- eller RFC 2965-cookies enligt gällande "policy". Observera att de allra flesta cookies på Internet är Netscape-cookies. :mod:`http.cookiejar` försöker följa Netscapes de facto cookieprotokoll (som skiljer sig väsentligt från det som anges i den ursprungliga Netscape-specifikationen), inklusive att notera cookieattributen ``max-age`` och ``port`` som introducerades med RFC 2965.

source: The various named parameters found in :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers (eg. ``domain`` and ``expires``) are conventionally referred to as :dfn:`attributes`. To distinguish them from Python attributes, the documentation for this module uses the term :dfn:`cookie-attribute` instead.
sv: De olika namngivna parametrarna som finns i :mailheader:`Set-Cookie` och :mailheader:`Set-Cookie2` (t.ex. ``domain`` och ``expires``) kallas konventionellt för :dfn:`attributes`. För att skilja dem från Python-attribut använder dokumentationen för den här modulen termen :dfn:`cookie-attribut` istället.

source: The module defines the following exception:
sv: Modulen definierar följande undantag:

source: Instances of :class:`FileCookieJar` raise this exception on failure to load cookies from a file. :exc:`LoadError` is a subclass of :exc:`OSError`.
sv: Instanser av :class:`FileCookieJar` ger upphov till detta undantag om det inte går att ladda cookies från en fil. :exc:`LoadError` är en underklass till :exc:`OSError`.

source: :exc:`LoadError` used to be a subtype of :exc:`IOError`, which is now an alias of :exc:`OSError`.
sv: :exc:`LoadError` var tidigare en subtyp av :exc:`IOError`, som nu är ett alias av :exc:`OSError`.

source: The following classes are provided:
sv: Följande klasser erbjuds:

source: *policy* is an object implementing the :class:`CookiePolicy` interface.
sv: *policy* är ett objekt som implementerar gränssnittet :class:`CookiePolicy`.

source: The :class:`CookieJar` class stores HTTP cookies. It extracts cookies from HTTP requests, and returns them in HTTP responses. :class:`CookieJar` instances automatically expire contained cookies when necessary. Subclasses are also responsible for storing and retrieving cookies from a file or database.
sv: Klassen :class:`CookieJar` lagrar HTTP-cookies. Den extraherar cookies från HTTP-förfrågningar och returnerar dem i HTTP-svar. Instanser av :class:`CookieJar` förfaller automatiskt när det behövs. Underklasser är också ansvariga för att lagra och hämta cookies från en fil eller databas.

source: *policy* is an object implementing the :class:`CookiePolicy` interface. For the other arguments, see the documentation for the corresponding attributes.
sv: *policy* är ett objekt som implementerar gränssnittet :class:`CookiePolicy`. För övriga argument, se dokumentationen för motsvarande attribut.

source: A :class:`CookieJar` which can load cookies from, and perhaps save cookies to, a file on disk. Cookies are **NOT** loaded from the named file until either the :meth:`load` or :meth:`revert` method is called. Subclasses of this class are documented in section :ref:`file-cookie-jar-classes`.
sv: En :class:`CookieJar` som kan ladda cookies från, och kanske spara cookies till, en fil på disken. Kakor laddas **INTE** från den angivna filen förrän antingen metoden :meth:`load` eller :meth:`revert` anropas. Underklasser till denna klass finns dokumenterade i avsnitt :ref:`file-cookie-jar-classes`.

source: This should not be initialized directly – use its subclasses below instead.
sv: Denna ska inte initieras direkt - använd istället dess underklasser nedan.

source: The filename parameter supports a :term:`path-like object`.
sv: Filnamnsparametern stöder en :term:`path-liknande objekt`.

source: This class is responsible for deciding whether each cookie should be accepted from / returned to the server.
sv: Denna klass ansvarar för att avgöra om varje cookie ska accepteras från/returneras till servern.

source: Constructor arguments should be passed as keyword arguments only. *blocked_domains* is a sequence of domain names that we never accept cookies from, nor return cookies to. *allowed_domains* if not :const:`None`, this is a sequence of the only domains for which we accept and return cookies. *secure_protocols* is a sequence of protocols for which secure cookies can be added to. By default *https* and *wss* (secure websocket) are considered secure protocols. For all other arguments, see the documentation for :class:`CookiePolicy` and :class:`DefaultCookiePolicy` objects.
sv: Konstruktörsargument ska endast skickas som nyckelordsargument. *blocked_domains* är en sekvens av domännamn som vi aldrig accepterar cookies från eller returnerar cookies till. *allowed_domains* om inte :const:`None`, är detta en sekvens av de enda domäner som vi accepterar och returnerar cookies för. *secure_protocols* är en sekvens av protokoll för vilka säkra cookies kan läggas till. Som standard anses *https* och *wss* (secure websocket) vara säkra protokoll. För alla andra argument, se dokumentationen för objekten :class:`CookiePolicy` och :class:`DefaultCookiePolicy`.

source: :class:`DefaultCookiePolicy` implements the standard accept / reject rules for Netscape and :rfc:`2965` cookies. By default, :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) are treated according to the RFC 2965 rules. However, if RFC 2965 handling is turned off or :attr:`rfc2109_as_netscape` is ``True``, RFC 2109 cookies are 'downgraded' by the :class:`CookieJar` instance to Netscape cookies, by setting the :attr:`version` attribute of the :class:`Cookie` instance to 0. :class:`DefaultCookiePolicy` also provides some parameters to allow some fine-tuning of policy.
sv: :class:`DefaultCookiePolicy` implementerar standardreglerna för att acceptera och avvisa cookies från Netscape och :rfc:`2965`. Som standard behandlas :rfc:`2109` cookies (dvs. cookies som tas emot i en :mailheader:`Set-Cookie` header med en version cookie-attribut på 1) enligt RFC 2965-reglerna. Men om RFC 2965-hanteringen är avstängd eller om :attr:`rfc2109_as_netscape` är ``True``, "nedgraderas" RFC 2109-cookies av :class:`CookieJar`-instansen till Netscape-cookies, genom att attributet :attr:`version` i :class:`Cookie`-instansen sätts till 0. :class:`DefaultCookiePolicy` innehåller också några parametrar som gör det möjligt att finjustera policyn.

source: This class represents Netscape, :rfc:`2109` and :rfc:`2965` cookies. It is not expected that users of :mod:`http.cookiejar` construct their own :class:`Cookie` instances. Instead, if necessary, call :meth:`make_cookies` on a :class:`CookieJar` instance.
sv: Denna klass representerar Netscape, :rfc:`2109` och :rfc:`2965` cookies. Det förväntas inte att användare av :mod:`http.cookiejar` konstruerar sina egna :class:`Cookie`-instanser. Anropa istället, om nödvändigt, :meth:`make_cookies` på en :class:`CookieJar`-instans.

source: Module :mod:`urllib.request`
sv: Modul :mod:`urllib.request`

source: URL opening with automatic cookie handling.
sv: URL-öppning med automatisk cookiehantering.

source: Module :mod:`http.cookies`
sv: Modul :mod:`http.cookies`

source: HTTP cookie classes, principally useful for server-side code. The :mod:`http.cookiejar` and :mod:`http.cookies` modules do not depend on each other.
sv: HTTP-cookieklasser, främst användbara för kod på serversidan. Modulerna :mod:`http.cookiejar` och :mod:`http.cookies` är inte beroende av varandra.

source: The specification of the original Netscape cookie protocol. Though this is still the dominant protocol, the 'Netscape cookie protocol' implemented by all the major browsers (and :mod:`http.cookiejar`) only bears a passing resemblance to the one sketched out in ``cookie_spec.html``.
sv: Specifikationen av det ursprungliga Netscape cookie-protokollet. Även om detta fortfarande är det dominerande protokollet, har "Netscape cookie protocol" som implementeras av alla större webbläsare (och :mod:`http.cookiejar`) bara en flyktig likhet med det som skisseras i ``cookie_spec.html``.

source: :rfc:`2109` - HTTP State Management Mechanism
sv: :rfc:`2109` - HTTP:s mekanism för tillståndshantering

source: Obsoleted by :rfc:`2965`. Uses :mailheader:`Set-Cookie` with version=1.
sv: Föråldrad av :rfc:`2965`. Använder :mailheader:`Set-Cookie` med version=1.

source: :rfc:`2965` - HTTP State Management Mechanism
sv: :rfc:`2965` - HTTP:s mekanism för tillståndshantering

source: The Netscape protocol with the bugs fixed. Uses :mailheader:`Set-Cookie2` in place of :mailheader:`Set-Cookie`. Not widely used.
sv: Netscape-protokollet med rättade buggar. Använder :mailheader:`Set-Cookie2` i stället för :mailheader:`Set-Cookie`. Används inte i någon större utsträckning.

source: Unfinished errata to :rfc:`2965`.
sv: Oavslutad errata till :rfc:`2965`.

source: :rfc:`2964` - Use of HTTP State Management
sv: :rfc:`2964` - Användning av HTTP State Management

source: CookieJar and FileCookieJar Objects
sv: CookieJar- och FileCookieJar-objekten

source: :class:`CookieJar` objects support the :term:`iterator` protocol for iterating over contained :class:`Cookie` objects.
sv: :class:`CookieJar`-objekt stöder :term:`iterator`-protokollet för iterering över ingående :class:`Cookie`-objekt.

source: :class:`CookieJar` has the following methods:
sv: :class:`CookieJar` har följande metoder:

source: Add correct :mailheader:`Cookie` header to *request*.
sv: Lägg till korrekt :mailheader:`Cookie` header i *request*.

source: If policy allows (ie. the :attr:`rfc2965` and :attr:`hide_cookie2` attributes of the :class:`CookieJar`'s :class:`CookiePolicy` instance are true and false respectively), the :mailheader:`Cookie2` header is also added when appropriate.
sv: Om policyn tillåter det (dvs. attributen :attr:`rfc2965` och :attr:`hide_cookie2` i :class:`CookieJar`:s :class:`CookiePolicy`-instans är true respektive false), läggs även rubriken :mailheader:`Cookie2` till när så är lämpligt.

source: The *request* object (usually a :class:`urllib.request.Request` instance) must support the methods :meth:`get_full_url`, :meth:`has_header`, :meth:`get_header`, :meth:`header_items`, :meth:`add_unredirected_header` and the attributes :attr:`host`, :attr:`!type`, :attr:`unverifiable` and :attr:`origin_req_host` as documented by :mod:`urllib.request`.
sv: Objektet *request* (vanligtvis en instans av :class:`urllib.request.Request`) måste stödja metoderna :meth:`get_full_url`, :meth:`has_header`, :meth:`get_header`, :meth:`header_items`, :meth:`add_unredirected_header` och attributen :attr:`host`, :attr:`!type`, :attr:`unverifiable` och :attr:`origin_req_host` som dokumenteras av :mod:`urllib.request`.

source: *request* object needs :attr:`origin_req_host` attribute. Dependency on a deprecated method :meth:`get_origin_req_host` has been removed.
sv: *request*-objektet behöver attributet :attr:`origin_req_host`. Beroendet av en föråldrad metod :meth:`get_origin_req_host` har tagits bort.

source: Extract cookies from HTTP *response* and store them in the :class:`CookieJar`, where allowed by policy.
sv: Extrahera cookies från HTTP *svar* och lagra dem i :class:`CookieJar`, där det är tillåtet enligt policy.

source: The :class:`CookieJar` will look for allowable :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers in the *response* argument, and store cookies as appropriate (subject to the :meth:`CookiePolicy.set_ok` method's approval).
sv: :class:`CookieJar` letar efter tillåtna :mailheader:`Set-Cookie` och :mailheader:`Set-Cookie2`-rubriker i argumentet *response* och lagrar cookies på lämpligt sätt (med förbehåll för godkännande av metoden :meth:`CookiePolicy.set_ok`).

source: The *response* object (usually the result of a call to :meth:`urllib.request.urlopen`, or similar) should support an :meth:`info` method, which returns an :class:`email.message.Message` instance.
sv: Objektet *response* (vanligtvis resultatet av ett anrop till :meth:`urllib.request.urlopen`, eller liknande) bör stödja en :meth:`info`-metod, som returnerar en :class:`email.message.Message`-instans.

source: The *request* object (usually a :class:`urllib.request.Request` instance) must support the method :meth:`get_full_url` and the attributes :attr:`host`, :attr:`unverifiable` and :attr:`origin_req_host`, as documented by :mod:`urllib.request`. The request is used to set default values for cookie-attributes as well as for checking that the cookie is allowed to be set.
sv: Objektet *request* (vanligtvis en instans av :class:`urllib.request.Request`) måste stödja metoden :meth:`get_full_url` och attributen :attr:`host`, :attr:`unverifiable` och :attr:`origin_req_host`, enligt dokumentationen i :mod:`urllib.request`. Begäran används för att ange standardvärden för cookie-attribut samt för att kontrollera att cookien får sättas.

source: Set the :class:`CookiePolicy` instance to be used.
sv: Ange vilken instans av :class:`CookiePolicy` som ska användas.

source: Return sequence of :class:`Cookie` objects extracted from *response* object.
sv: Returnerar sekvens av :class:`Cookie`-objekt extraherade från *response*-objektet.

source: See the documentation for :meth:`extract_cookies` for the interfaces required of the *response* and *request* arguments.
sv: Se dokumentationen för :meth:`extract_cookies` för de gränssnitt som krävs av argumenten *response* och *request*.

source: Set a :class:`Cookie` if policy says it's OK to do so.
sv: Ange en :class:`Cookie` om policyn säger att det är OK att göra det.

source: Set a :class:`Cookie`, without checking with policy to see whether or not it should be set.
sv: Ställ in en :class:`Cookie`, utan att kontrollera med policyn om den ska ställas in eller inte.

source: Clear some cookies.
sv: Rensa några cookies.

source: If invoked without arguments, clear all cookies. If given a single argument, only cookies belonging to that *domain* will be removed. If given two arguments, cookies belonging to the specified *domain* and URL *path* are removed. If given three arguments, then the cookie with the specified *domain*, *path* and *name* is removed.
sv: Om den anropas utan argument rensas alla cookies. Om ett enda argument anges kommer endast cookies som tillhör den *domänen* att tas bort. Om två argument anges tas cookies som hör till den angivna *domänen* och URL-adressen *sökväg* bort. Om tre argument anges tas cookien med de angivna *domän*, *sökväg* och *namn* bort.

source: Raises :exc:`KeyError` if no matching cookie exists.
sv: Utlöser :exc:`KeyError` om ingen matchande cookie finns.

source: Discard all session cookies.
sv: Kassera alla sessionscookies.

source: Discards all contained cookies that have a true :attr:`discard` attribute (usually because they had either no ``max-age`` or ``expires`` cookie-attribute, or an explicit ``discard`` cookie-attribute). For interactive browsers, the end of a session usually corresponds to closing the browser window.
sv: Slänger alla cookies som har attributet true :attr:`discard` (vanligtvis för att de antingen inte hade något cookie-attribut ``max-age`` eller ``expires``, eller ett explicit cookie-attribut ``discard``). För interaktiva webbläsare motsvarar slutet på en session vanligtvis att webbläsarfönstret stängs.

source: Note that the :meth:`save` method won't save session cookies anyway, unless you ask otherwise by passing a true *ignore_discard* argument.
sv: Observera att metoden :meth:`save` ändå inte sparar sessionskakor, såvida du inte begär något annat genom att ange ett sant *ignore_discard*-argument.

source: :class:`FileCookieJar` implements the following additional methods:
sv: :class:`FileCookieJar` implementerar följande ytterligare metoder:

source: Save cookies to a file.
sv: Spara cookies till en fil.

source: This base class raises :exc:`NotImplementedError`. Subclasses may leave this method unimplemented.
sv: Denna basklass ger upphov till :exc:`NotImplementedError`. Subklasser kan lämna denna metod oimplementerad.

source: *filename* is the name of file in which to save cookies. If *filename* is not specified, :attr:`self.filename` is used (whose default is the value passed to the constructor, if any); if :attr:`self.filename` is :const:`None`, :exc:`ValueError` is raised.
sv: *filename* är namnet på den fil där cookies ska sparas. Om *filename* inte anges används :attr:`self.filename` (vars standard är det värde som skickas till konstruktören, om det finns något); om :attr:`self.filename` är :const:`None`, uppstår :exc:`ValueError`.

source: *ignore_discard*: save even cookies set to be discarded. *ignore_expires*: save even cookies that have expired
sv: *ignore_discard*: sparar även cookies som är inställda på att kastas. *ignore_expires*: spara även cookies som har löpt ut

source: The file is overwritten if it already exists, thus wiping all the cookies it contains. Saved cookies can be restored later using the :meth:`load` or :meth:`revert` methods.
sv: Filen skrivs över om den redan finns, vilket innebär att alla cookies som den innehåller raderas. Sparade cookies kan återställas senare med hjälp av metoderna :meth:`load` eller :meth:`revert`.

source: Load cookies from a file.
sv: Ladda cookies från en fil.

source: Old cookies are kept unless overwritten by newly loaded ones.
sv: Gamla cookies sparas om de inte skrivs över av nya cookies.

source: Arguments are as for :meth:`save`.
sv: Argumenten är desamma som för :meth:`save`.

source: The named file must be in the format understood by the class, or :exc:`LoadError` will be raised. Also, :exc:`OSError` may be raised, for example if the file does not exist.
sv: Den namngivna filen måste vara i det format som klassen förstår, annars kommer :exc:`LoadError` att visas. Även :exc:`OSError` kan visas, t.ex. om filen inte finns.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
sv: :exc:`IOError` användes tidigare, nu är det ett alias för :exc:`OSError`.

source: Clear all cookies and reload cookies from a saved file.
sv: Rensa alla cookies och ladda om cookies från en sparad fil.

source: :meth:`revert` can raise the same exceptions as :meth:`load`. If there is a failure, the object's state will not be altered.
sv: :meth:`revert` kan ge upphov till samma undantag som :meth:`load`. Om det blir ett misslyckande kommer objektets tillstånd inte att ändras.

source: :class:`FileCookieJar` instances have the following public attributes:
sv: :class:`FileCookieJar`-instanser har följande publika attribut:

source: Filename of default file in which to keep cookies. This attribute may be assigned to.
sv: Filnamn för standardfilen där cookies ska sparas. Detta attribut kan tilldelas till.

source: If true, load cookies lazily from disk. This attribute should not be assigned to. This is only a hint, since this only affects performance, not behaviour (unless the cookies on disk are changing). A :class:`CookieJar` object may ignore it. None of the :class:`FileCookieJar` classes included in the standard library lazily loads cookies.
sv: Om true, ladda cookies från disken. Detta attribut bör inte tilldelas till. Det är bara en antydan, eftersom det bara påverkar prestanda, inte beteende (såvida inte kakorna på disken ändras). Ett :class:`CookieJar`-objekt kan ignorera det. Ingen av klasserna :class:`FileCookieJar` som ingår i standardbiblioteket laddar cookies på ett lättsinnigt sätt.

source: FileCookieJar subclasses and co-operation with web browsers
sv: FileCookieJar-underklasser och samarbete med webbläsare

source: The following :class:`CookieJar` subclasses are provided for reading and writing.
sv: Följande :class:`CookieJar`-subklasser finns för läsning och skrivning.

source: A :class:`FileCookieJar` that can load from and save cookies to disk in the Mozilla ``cookies.txt`` file format (which is also used by curl and the Lynx and Netscape browsers).
sv: En :class:`FileCookieJar` som kan ladda från och spara cookies till disk i Mozillas filformat ``cookies.txt`` (som också används av curl och webbläsarna Lynx och Netscape).

source: This loses information about :rfc:`2965` cookies, and also about newer or non-standard cookie-attributes such as ``port``.
sv: Detta gör att information om :rfc:`2965`-cookies försvinner, och även om nyare eller icke-standardiserade cookie-attribut som ``port``.

source: Back up your cookies before saving if you have cookies whose loss / corruption would be inconvenient (there are some subtleties which may lead to slight changes in the file over a load / save round-trip).
sv: Säkerhetskopiera dina cookies innan du sparar om du har cookies vars förlust / korruption skulle vara obekvämt (det finns vissa subtiliteter som kan leda till små förändringar i filen under en laddning / spara tur och retur).

source: Also note that cookies saved while Mozilla is running will get clobbered by Mozilla.
sv: Observera också att cookies som sparas medan Mozilla körs kommer att bli överkörda av Mozilla.

source: A :class:`FileCookieJar` that can load from and save cookies to disk in format compatible with the libwww-perl library's ``Set-Cookie3`` file format. This is convenient if you want to store cookies in a human-readable file.
sv: En :class:`FileCookieJar` som kan ladda från och spara cookies till disk i ett format som är kompatibelt med libwww-perl-bibliotekets ``Set-Cookie3`` filformat. Detta är praktiskt om du vill lagra cookies i en fil som är läsbar för människor.

source: CookiePolicy Objects
sv: CookiePolicy-objekt

source: Objects implementing the :class:`CookiePolicy` interface have the following methods:
sv: Objekt som implementerar gränssnittet :class:`CookiePolicy` har följande metoder:

source: Return boolean value indicating whether cookie should be accepted from server.
sv: Returnerar ett booleskt värde som anger om cookien ska accepteras från servern.
