Repository: yeager/python-docs-sv
Catalog: library/http.server.po
Languages: sv

source: :mod:`!http.server` --- HTTP servers
sv: :mod:`!http.server` --- HTTP-servrar

source: **Source code:** :source:`Lib/http/server.py`
sv: **Källkod:** :source:`Lib/http/server.py`

source: This module defines classes for implementing HTTP servers.
sv: Denna modul definierar klasser för implementering av HTTP-servrar.

source: :mod:`http.server` is not recommended for production. It only implements :ref:`basic security checks <http.server-security>`.
sv: :mod:`http.server` rekommenderas inte för produktion. Den implementerar endast :ref:`grundläggande säkerhetskontroller <http.server-security>`.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: One class, :class:`HTTPServer`, is a :class:`socketserver.TCPServer` subclass. It creates and listens at the HTTP socket, dispatching the requests to a handler. Code to create and run the server looks like this::
sv: En klass, :class:`HTTPServer`, är en :class:`socketserver.TCPServer`-underklass. Den skapar och lyssnar på HTTP-sockeln och skickar förfrågningarna till en hanterare. Koden för att skapa och köra servern ser ut så här::

source: This class builds on the :class:`~socketserver.TCPServer` class by storing the server address as instance variables named :attr:`server_name` and :attr:`server_port`. The server is accessible by the handler, typically through the handler's :attr:`server` instance variable.
sv: Den här klassen bygger på klassen :class:`~socketserver.TCPServer` genom att lagra serveradressen som instansvariabler med namnen :attr:`server_name` och :attr:`server_port`. Servern är åtkomlig för hanteraren, vanligtvis genom hanterarens :attr:`server`-instansvariabel.

source: This class is identical to HTTPServer but uses threads to handle requests by using the :class:`~socketserver.ThreadingMixIn`. This is useful to handle web browsers pre-opening sockets, on which :class:`HTTPServer` would wait indefinitely.
sv: Den här klassen är identisk med HTTPServer men använder trådar för att hantera förfrågningar genom att använda :class:`~socketserver.ThreadingMixIn`. Detta är användbart för att hantera webbläsare som föröppnar socklar, på vilka :class:`HTTPServer` skulle vänta på obestämd tid.

source: Subclass of :class:`HTTPServer` with a wrapped socket using the :mod:`ssl` module. If the :mod:`ssl` module is not available, instantiating a :class:`!HTTPSServer` object fails with a :exc:`RuntimeError`.
sv: Underklass till :class:`HTTPServer` med en omsluten socket som använder modulen :mod:`ssl`. Om modulen :mod:`ssl` inte är tillgänglig, misslyckas instantiering av ett :class:`!HTTPSServer`-objekt med ett :exc:`RuntimeError`.

source: The *certfile* argument is the path to the SSL certificate chain file, and the *keyfile* is the path to file containing the private key.
sv: Argumentet *certfile* är sökvägen till filen med SSL-certifikatkedjan och *keyfile* är sökvägen till filen med den privata nyckeln.

source: A *password* can be specified for files protected and wrapped with PKCS#8, but beware that this could possibly expose hardcoded passwords in clear.
sv: Ett *lösenord* kan anges för filer som skyddas och omsluts av PKCS#8, men tänk på att detta eventuellt kan exponera hårdkodade lösenord i klartext.

source: See :meth:`ssl.SSLContext.load_cert_chain` for additional information on the accepted values for *certfile*, *keyfile* and *password*.
sv: Se :meth:`ssl.SSLContext.load_cert_chain` för ytterligare information om de accepterade värdena för *certfile*, *keyfile* och *password*.

source: When specified, the *alpn_protocols* argument must be a sequence of strings specifying the "Application-Layer Protocol Negotiation" (ALPN) protocols supported by the server. ALPN allows the server and the client to negotiate the application protocol during the TLS handshake.
sv: När det anges måste argumentet *alpn_protocols* vara en sekvens av strängar som anger de ALPN-protokoll (Application-Layer Protocol Negotiation) som stöds av servern. ALPN gör det möjligt för servern och klienten att förhandla om applikationsprotokollet under TLS-handskakningen.

source: By default, it is set to ``["http/1.1"]``, meaning the server supports HTTP/1.1.
sv: Som standard är den inställd på ``["http/1.1"]``, vilket innebär att servern stöder HTTP/1.1.

source: This class is identical to :class:`HTTPSServer` but uses threads to handle requests by inheriting from :class:`~socketserver.ThreadingMixIn`. This is analogous to :class:`ThreadingHTTPServer` only using :class:`HTTPSServer`.
sv: Denna klass är identisk med :class:`HTTPSServer` men använder trådar för att hantera förfrågningar genom att ärva från :class:`~socketserver.ThreadingMixIn`. Detta är analogt med :class:`ThreadingHTTPServer` men använder :class:`HTTPSServer`.

source: The :class:`HTTPServer`, :class:`ThreadingHTTPServer`, :class:`HTTPSServer` and :class:`ThreadingHTTPSServer` must be given a *RequestHandlerClass* on instantiation, of which this module provides three different variants:
sv: :class:`HTTPServer`, :class:`ThreadingHTTPServer`, :class:`HTTPSServer` och :class:`ThreadingHTTPSServer` måste ges en *RequestHandlerClass* vid instantiering, som denna modul tillhandahåller tre olika varianter av:

source: This class is used to handle the HTTP requests that arrive at the server. By itself, it cannot respond to any actual HTTP requests; it must be subclassed to handle each request method (e.g. GET or POST). :class:`BaseHTTPRequestHandler` provides a number of class and instance variables, and methods for use by subclasses.
sv: Den här klassen används för att hantera HTTP-förfrågningar som kommer till servern. I sig själv kan den inte svara på några faktiska HTTP-förfrågningar; den måste underklassas för att hantera varje förfrågningsmetod (t.ex. GET eller POST). :class:`BaseHTTPRequestHandler` tillhandahåller ett antal klass- och instansvariabler och metoder för användning av underklasser.

source: The handler will parse the request and the headers, then call a method specific to the request type. The method name is constructed from the request. For example, for the request method ``SPAM``, the :meth:`!do_SPAM` method will be called with no arguments. All of the relevant information is stored in instance variables of the handler. Subclasses should not need to override or extend the :meth:`!__init__` method.
sv: Hanteraren analyserar begäran och sidhuvudet och anropar sedan en metod som är specifik för begärandetypen. Metodnamnet konstrueras utifrån begäran. Till exempel, för begärandemetoden ``SPAM`` kommer metoden :meth:`!do_SPAM`` att anropas utan argument. All relevant information lagras i hanterarens instansvariabler. Underklasser ska inte behöva åsidosätta eller utöka metoden :meth:`!__init__`.

source: :class:`BaseHTTPRequestHandler` has the following instance variables:
sv: :class:`BaseHTTPRequestHandler` har följande instansvariabler:

source: Contains a tuple of the form ``(host, port)`` referring to the client's address.
sv: Innehåller en tupel av formen ``(host, port)`` som hänvisar till klientens adress.

source: Contains the server instance.
sv: Innehåller serverinstansen.

source: Boolean that should be set before :meth:`handle_one_request` returns, indicating if another request may be expected, or if the connection should be shut down.
sv: Boolean som ska anges innan :meth:`handle_one_request` returneras, vilket indikerar om en annan begäran kan väntas eller om anslutningen ska stängas av.

source: Contains the string representation of the HTTP request line. The terminating CRLF is stripped. This attribute should be set by :meth:`handle_one_request`. If no valid request line was processed, it should be set to the empty string.
sv: Innehåller en strängrepresentation av HTTP-begärans rad. Det avslutande CRLF är borttaget. Detta attribut bör sättas av :meth:`handle_one_request`. Om ingen giltig request-rad behandlades, bör det sättas till den tomma strängen.

source: Contains the command (request type). For example, ``'GET'``.
sv: Innehåller kommandot (typ av begäran). Till exempel ``'GET'``.

source: Contains the request path. If query component of the URL is present, then ``path`` includes the query. Using the terminology of :rfc:`3986`, ``path`` here includes ``hier-part`` and the ``query``.
sv: Innehåller sökvägen till begäran. Om query-komponenten i URL:en finns med, innehåller ``path`` även query. Med terminologin i :rfc:`3986` inkluderar ``path`` här ``hier-part`` och ``query``.

source: Contains the version string from the request. For example, ``'HTTP/1.0'``.
sv: Innehåller versionssträngen från begäran. Till exempel, ``'HTTP/1.0'``.

source: Holds an instance of the class specified by the :attr:`MessageClass` class variable. This instance parses and manages the headers in the HTTP request. The :func:`~http.client.parse_headers` function from :mod:`http.client` is used to parse the headers and it requires that the HTTP request provide a valid :rfc:`2822` style header.
sv: Innehåller en instans av den klass som anges av klassvariabeln :attr:`MessageClass`. Denna instans analyserar och hanterar rubrikerna i HTTP-begäran. Funktionen :func:`~http.client.parse_headers` från :mod:`http.client` används för att analysera rubrikerna och den kräver att HTTP-begäran innehåller en giltig rubrik av typen :rfc:`2822`.

source: An :class:`io.BufferedIOBase` input stream, ready to read from the start of the optional input data.
sv: En :class:`io.BufferedIOBase` inmatningsström, redo att läsas från början av de valfria inmatningsdata.

source: Contains the output stream for writing a response back to the client. Proper adherence to the HTTP protocol must be used when writing to this stream in order to achieve successful interoperation with HTTP clients.
sv: Innehåller utdataströmmen för att skriva ett svar tillbaka till klienten. HTTP-protokollet måste följas när du skriver till den här strömmen för att du ska få ett bra samspel med HTTP-klienter.

source: This is an :class:`io.BufferedIOBase` stream.
sv: Detta är en :class:`io.BufferedIOBase`-ström.

source: :class:`BaseHTTPRequestHandler` has the following attributes:
sv: :class:`BaseHTTPRequestHandler` har följande attribut:

source: Specifies the server software version. You may want to override this. The format is multiple whitespace-separated strings, where each string is of the form name[/version]. For example, ``'BaseHTTP/0.2'``.
sv: Anger serverns programvaruversion. Du kanske vill åsidosätta detta. Formatet är flera strängar separerade med blanksteg, där varje sträng är av formen name[/version]. Till exempel ``'BaseHTTP/0.2'``.

source: Contains the Python system version, in a form usable by the :attr:`version_string` method and the :attr:`server_version` class variable. For example, ``'Python/1.4'``.
sv: Innehåller Python-systemets version, i en form som kan användas med metoden :attr:`version_string` och klassvariabeln :attr:`server_version`. Till exempel ``'Python/1.4'``.

source: Specifies a format string that should be used by :meth:`send_error` method for building an error response to the client. The string is filled by default with variables from :attr:`responses` based on the status code that passed to :meth:`send_error`.
sv: Anger en formatsträng som ska användas av metoden :meth:`send_error` för att bygga upp ett felsvar till klienten. Strängen fylls som standard med variabler från :attr:`responses` baserat på den statuskod som skickades till :meth:`send_error`.

source: Specifies the Content-Type HTTP header of error responses sent to the client. The default value is ``'text/html'``.
sv: Anger HTTP-huvudet Content-Type för felsvar som skickas till klienten. Standardvärdet är ``'text/html'``.

source: Specifies the HTTP version to which the server is conformant. It is sent in responses to let the client know the server's communication capabilities for future requests. If set to ``'HTTP/1.1'``, the server will permit HTTP persistent connections; however, your server *must* then include an accurate ``Content-Length`` header (using :meth:`send_header`) in all of its responses to clients. For backwards compatibility, the setting defaults to ``'HTTP/1.0'``.
sv: Anger vilken HTTP-version som servern är kompatibel med. Den skickas i svar för att klienten ska få veta serverns kommunikationsmöjligheter för framtida förfrågningar. Om inställningen är ``'HTTP/1.1'`` tillåter servern permanenta HTTP-anslutningar, men din server *måste* då inkludera en korrekt ``Content-Length``-rubrik (med :meth:`send_header`) i alla sina svar till klienter. För bakåtkompatibilitet är standardinställningen ``'HTTP/1.0'``.

source: Specifies an :class:`email.message.Message`\ -like class to parse HTTP headers. Typically, this is not overridden, and it defaults to :class:`http.client.HTTPMessage`.
sv: Anger en :class:`email.message.Message` -liknande klass för att analysera HTTP-rubriker. Vanligtvis åsidosätts inte detta, och standardvärdet är :class:`http.client.HTTPMessage`.

source: This attribute contains a mapping of error code integers to two-element tuples containing a short and long message. For example, ``{code: (shortmessage, longmessage)}``. The *shortmessage* is usually used as the *message* key in an error response, and *longmessage* as the *explain* key. It is used by :meth:`send_response_only` and :meth:`send_error` methods.
sv: Detta attribut innehåller en mappning av heltal för felkoder till tupler med två element som innehåller ett kort och ett långt meddelande. Till exempel ``{kod: (kortmeddelande, långtmeddelande)}``. *shortmessage* används vanligtvis som *message*-nyckel i ett felsvar, och *longmessage* som *explain*-nyckel. Den används av metoderna :meth:`send_response_only` och :meth:`send_error`.

source: A :class:`BaseHTTPRequestHandler` instance has the following methods:
sv: En :class:`BaseHTTPRequestHandler`-instans har följande metoder:

source: Calls :meth:`handle_one_request` once (or, if persistent connections are enabled, multiple times) to handle incoming HTTP requests. You should never need to override it; instead, implement appropriate :meth:`!do_\*` methods.
sv: Anropar :meth:`handle_one_request` en gång (eller, om ihållande anslutningar är aktiverade, flera gånger) för att hantera inkommande HTTP-förfrågningar. Du bör aldrig behöva åsidosätta den; implementera istället lämpliga :meth:`!do_\*`-metoder.

source: This method will parse and dispatch the request to the appropriate :meth:`!do_\*` method. You should never need to override it.
sv: Den här metoden analyserar och skickar begäran till lämplig :meth:`!do_\*`-metod. Du bör aldrig behöva åsidosätta den.

source: When an HTTP/1.1 conformant server receives an ``Expect: 100-continue`` request header it responds back with a ``100 Continue`` followed by ``200 OK`` headers. This method can be overridden to raise an error if the server does not want the client to continue. For e.g. server can choose to send ``417 Expectation Failed`` as a response header and ``return False``.
sv: När en HTTP/1.1-konform server tar emot en ``Expect: 100-continue`` request header svarar den tillbaka med en ``100 Continue`` följt av ``200 OK`` headers. Denna metod kan åsidosättas så att den ger upphov till ett fel om servern inte vill att klienten ska fortsätta. Servern kan t.ex. välja att skicka ``417 Expectation Failed`` som svarshuvud och ``return False``.

source: Sends and logs a complete error reply to the client. The numeric *code* specifies the HTTP error code, with *message* as an optional, short, human readable description of the error. The *explain* argument can be used to provide more detailed information about the error; it will be formatted using the :attr:`error_message_format` attribute and emitted, after a complete set of headers, as the response body. The :attr:`responses` attribute holds the default values for *message* and *explain* that will be used if no value is provided; for unknown codes the default value for both is the string ``???``. The body will be empty if the method is HEAD or the response code is one of the following: :samp:`1{xx}`, ``204 No Content``, ``205 Reset Content``, ``304 Not Modified``.
sv: Skickar och loggar ett fullständigt felsvar till klienten. Den numeriska *code* anger HTTP-felkoden, med *message* som en valfri, kort, mänskligt läsbar beskrivning av felet. Argumentet *explain* kan användas för att ge mer detaljerad information om felet; det kommer att formateras med attributet :attr:`error_message_format` och skickas ut, efter en komplett uppsättning rubriker, som svarskropp. Attributet :attr:`responses` innehåller standardvärdena för *message* och *explain* som kommer att användas om inget värde anges; för okända koder är standardvärdet för båda strängen ``???``. Body kommer att vara tom om metoden är HEAD eller om svarskoden är någon av följande: :samp:`1{xx}`, ``204 No Content``, ``205 Reset Content``, ``304 Not Modified``.

source: The error response includes a Content-Length header. Added the *explain* argument.
sv: Felmeddelandet innehåller en Content-Length-rubrik. Argumentet *explain* har lagts till.

source: Adds a response header to the headers buffer and logs the accepted request. The HTTP response line is written to the internal buffer, followed by *Server* and *Date* headers. The values for these two headers are picked up from the :meth:`version_string` and :meth:`date_time_string` methods, respectively. If the server does not intend to send any other headers using the :meth:`send_header` method, then :meth:`send_response` should be followed by an :meth:`end_headers` call.
sv: Lägger till en svarsrubrik i bufferten för rubriker och loggar den accepterade begäran. HTTP-svarsraden skrivs till den interna bufferten, följt av rubrikerna *Server* och *Date*. Värdena för dessa två rubriker hämtas från metoderna :meth:`version_string` respektive :meth:`date_time_string`. Om servern inte avser att skicka några andra rubriker med metoden :meth:`send_header`, bör :meth:`send_response` följas av ett anrop till :meth:`end_headers`.

source: Headers are stored to an internal buffer and :meth:`end_headers` needs to be called explicitly.
sv: Headers lagras i en intern buffert och :meth:`end_headers` måste anropas explicit.

source: Adds the HTTP header to an internal buffer which will be written to the output stream when either :meth:`end_headers` or :meth:`flush_headers` is invoked. *keyword* should specify the header keyword, with *value* specifying its value. Note that, after the send_header calls are done, :meth:`end_headers` MUST BE called in order to complete the operation.
sv: Lägger till HTTP-headern i en intern buffert som skrivs till utdataströmmen när antingen :meth:`end_headers` eller :meth:`flush_headers` aktiveras. *keyword* bör ange nyckelordet för rubriken, med *value* som anger dess värde. Observera att efter att send_header-anropen har gjorts MÅSTE :meth:`end_headers` anropas för att slutföra operationen.

source: Headers are stored in an internal buffer.
sv: Huvudrubrikerna lagras i en intern buffert.

source: Sends the response header only, used for the purposes when ``100 Continue`` response is sent by the server to the client. The headers not buffered and sent directly the output stream.If the *message* is not specified, the HTTP message corresponding the response *code* is sent.
sv: Skickar endast svarshuvudet, som används när svaret ``100 Continue`` skickas från servern till klienten. Rubrikerna buffras inte utan skickas direkt till utdataströmmen. Om *message* inte anges skickas det HTTP-meddelande som motsvarar svarets *code*.

source: Adds a blank line (indicating the end of the HTTP headers in the response) to the headers buffer and calls :meth:`flush_headers`.
sv: Lägger till en tom rad (som anger slutet på HTTP-rubrikerna i svaret) i rubrikbufferten och anropar :meth:`flush_headers`.

source: The buffered headers are written to the output stream.
sv: De buffrade sidhuvudena skrivs till utdataströmmen.

source: Finally send the headers to the output stream and flush the internal headers buffer.
sv: Slutligen skickas rubrikerna till utdataströmmen och den interna bufferten för rubriker töms.

source: Logs an accepted (successful) request. *code* should specify the numeric HTTP code associated with the response. If a size of the response is available, then it should be passed as the *size* parameter.
sv: Loggar en accepterad (lyckad) begäran. *code* bör ange den numeriska HTTP-kod som är associerad med svaret. Om en storlek på svaret är tillgänglig, ska den skickas som parametern *size*.

source: Logs an error when a request cannot be fulfilled. By default, it passes the message to :meth:`log_message`, so it takes the same arguments (*format* and additional values).
sv: Loggar ett felmeddelande när en begäran inte kan uppfyllas. Som standard skickas meddelandet till :meth:`log_message`, så det tar samma argument (*format* och ytterligare värden).

source: Logs an arbitrary message to ``sys.stderr``. This is typically overridden to create custom error logging mechanisms. The *format* argument is a standard printf-style format string, where the additional arguments to :meth:`log_message` are applied as inputs to the formatting. The client ip address and current date and time are prefixed to every message logged.
sv: Loggar ett godtyckligt meddelande till ``sys.stderr``. Detta åsidosätts vanligen för att skapa egna mekanismer för felloggning. Argumentet *format* är en standardformatsträng i printf-stil, där de ytterligare argumenten till :meth:`log_message` används som input till formateringen. Klientens ip-adress och aktuellt datum och tid prefixeras till varje loggat meddelande.

source: Returns the server software's version string. This is a combination of the :attr:`server_version` and :attr:`sys_version` attributes.
sv: Returnerar serverprogramvarans versionssträng. Detta är en kombination av attributen :attr:`server_version` och :attr:`sys_version`.

source: Returns the date and time given by *timestamp* (which must be ``None`` or in the format returned by :func:`time.time`), formatted for a message header. If *timestamp* is omitted, it uses the current date and time.
sv: Returnerar datum och tid som anges av *timestamp* (som måste vara ``None`` eller i det format som returneras av :func:`time.time`), formaterat för ett meddelandehuvud. Om *timestamp* utelämnas används aktuellt datum och aktuell tid.

source: The result looks like ``'Sun, 06 Nov 1994 08:49:37 GMT'``.
sv: Resultatet ser ut som ``'Sun, 06 Nov 1994 08:49:37 GMT'``.

source: Returns the current date and time, formatted for logging.
sv: Returnerar aktuellt datum och tid, formaterat för loggning.

source: Returns the client address.
sv: Returnerar klientadressen.

source: Previously, a name lookup was performed. To avoid name resolution delays, it now always returns the IP address.
sv: Tidigare gjordes en namnuppslagning. För att undvika fördröjningar i namnupplösningen returneras nu alltid IP-adressen.

source: This class serves files from the directory *directory* and below, or the current directory if *directory* is not provided, directly mapping the directory structure to HTTP requests.
sv: Den här klassen serverar filer från katalogen *directory* och nedåt, eller den aktuella katalogen om *directory* inte anges, och mappar katalogstrukturen direkt till HTTP-begäranden.

source: Added the *directory* parameter.
sv: Parametern *directory* har lagts till.

source: The *directory* parameter accepts a :term:`path-like object`.
sv: Parametern *directory* accepterar en :term:`path-like object`.
