Repository: yeager/python-docs-sv
Catalog: library/http.cookiejar.po
Languages: sv

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.extract_cookies`.
sv: *cookie* är en instans av :class:`Cookie`. *request* är ett objekt som implementerar det gränssnitt som definieras av dokumentationen för :meth:`CookieJar.extract_cookies`.

source: Return boolean value indicating whether cookie should be returned to server.
sv: Returnerar ett booleskt värde som anger om cookien ska returneras till servern.

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.add_cookie_header`.
sv: *cookie* är en instans av :class:`Cookie`. *request* är ett objekt som implementerar det gränssnitt som definieras av dokumentationen för :meth:`CookieJar.add_cookie_header`.

source: Return ``False`` if cookies should not be returned, given cookie domain.
sv: Returnerar ``False`` om cookies inte ska returneras, givet cookie-domän.

source: This method is an optimization. It removes the need for checking every cookie with a particular domain (which might involve reading many files). Returning true from :meth:`domain_return_ok` and :meth:`path_return_ok` leaves all the work to :meth:`return_ok`.
sv: Den här metoden är en optimering. Den tar bort behovet av att kontrollera varje cookie med en viss domän (vilket kan innebära att många filer måste läsas). Att returnera true från :meth:`domain_return_ok` och :meth:`path_return_ok` lämnar allt arbete till :meth:`return_ok`.

source: If :meth:`domain_return_ok` returns true for the cookie domain, :meth:`path_return_ok` is called for the cookie path. Otherwise, :meth:`path_return_ok` and :meth:`return_ok` are never called for that cookie domain. If :meth:`path_return_ok` returns true, :meth:`return_ok` is called with the :class:`Cookie` object itself for a full check. Otherwise, :meth:`return_ok` is never called for that cookie path.
sv: Om :meth:`domain_return_ok` returnerar true för cookiedomänen anropas :meth:`path_return_ok` för cookie-sökvägen. Annars anropas aldrig :meth:`path_return_ok` och :meth:`return_ok` för den cookiedomänen. Om :meth:`path_return_ok` returnerar true, anropas :meth:`return_ok` med själva :class:`Cookie`-objektet för en fullständig kontroll. Annars anropas aldrig :meth:`return_ok` för den cookie-sökvägen.

source: Note that :meth:`domain_return_ok` is called for every *cookie* domain, not just for the *request* domain. For example, the function might be called with both ``".example.com"`` and ``"www.example.com"`` if the request domain is ``"www.example.com"``. The same goes for :meth:`path_return_ok`.
sv: Observera att :meth:`domain_return_ok` anropas för varje *cookie*-domän, inte bara för *request*-domänen. Funktionen kan till exempel anropas med både ``".example.com"`` och ``"www.example.com"`` om domänen för begäran är ``"www.example.com"``. Detsamma gäller för :meth:`path_return_ok`.

source: The *request* argument is as documented for :meth:`return_ok`.
sv: Argumentet *request* är som dokumenterat för :meth:`return_ok`.

source: Return ``False`` if cookies should not be returned, given cookie path.
sv: Returnerar ``False`` om cookies inte ska returneras, givet cookie-sökväg.

source: See the documentation for :meth:`domain_return_ok`.
sv: Se dokumentationen för :meth:`domain_return_ok`.

source: In addition to implementing the methods above, implementations of the :class:`CookiePolicy` interface must also supply the following attributes, indicating which protocols should be used, and how. All of these attributes may be assigned to.
sv: Förutom att implementera metoderna ovan måste implementationer av :class:`CookiePolicy`-gränssnittet också tillhandahålla följande attribut, som anger vilka protokoll som skall användas och hur. Alla dessa attribut kan tilldelas till.

source: Implement Netscape protocol.
sv: Implementera Netscape-protokollet.

source: Implement :rfc:`2965` protocol.
sv: Implementera :rfc:`2965` protokoll.

source: Don't add :mailheader:`Cookie2` header to requests (the presence of this header indicates to the server that we understand :rfc:`2965` cookies).
sv: Lägg inte till :mailheader:`Cookie2` header till förfrågningar (närvaron av denna header indikerar för servern att vi förstår :rfc:`2965` cookies).

source: The most useful way to define a :class:`CookiePolicy` class is by subclassing from :class:`DefaultCookiePolicy` and overriding some or all of the methods above. :class:`CookiePolicy` itself may be used as a 'null policy' to allow setting and receiving any and all cookies (this is unlikely to be useful).
sv: Det mest användbara sättet att definiera en :class:`CookiePolicy`-klass är genom att subklassa från :class:`DefaultCookiePolicy` och åsidosätta några eller alla metoder ovan. :class:`CookiePolicy` i sig kan användas som en "nollpolicy" för att tillåta inställning och mottagning av alla cookies (detta är troligen inte användbart).

source: DefaultCookiePolicy Objects
sv: DefaultCookiePolicy-objekt

source: Implements the standard rules for accepting and returning cookies.
sv: Implementerar standardreglerna för att acceptera och returnera cookies.

source: Both :rfc:`2965` and Netscape cookies are covered. RFC 2965 handling is switched off by default.
sv: Både :rfc:`2965` och Netscape cookies omfattas. RFC 2965-hantering är avstängd som standard.

source: The easiest way to provide your own policy is to override this class and call its methods in your overridden implementations before adding your own additional checks::
sv: Det enklaste sättet att skapa en egen policy är att överskriva denna klass och anropa dess metoder i dina överskrivna implementationer innan du lägger till dina egna ytterligare kontroller::

source: In addition to the features required to implement the :class:`CookiePolicy` interface, this class allows you to block and allow domains from setting and receiving cookies. There are also some strictness switches that allow you to tighten up the rather loose Netscape protocol rules a little bit (at the cost of blocking some benign cookies).
sv: Förutom de funktioner som krävs för att implementera :class:`CookiePolicy`-gränssnittet, kan du med den här klassen blockera och tillåta domäner från att sätta och ta emot cookies. Det finns också några strikthetsomkopplare som gör att du kan skärpa de ganska lösa Netscape-protokollreglerna lite grann (på bekostnad av att blockera vissa godartade cookies).

source: A domain blocklist and allowlist is provided (both off by default). Only domains not in the blocklist and present in the allowlist (if the allowlist is active) participate in cookie setting and returning. Use the *blocked_domains* constructor argument, and :meth:`blocked_domains` and :meth:`set_blocked_domains` methods (and the corresponding argument and methods for *allowed_domains*). If you set an allowlist, you can turn it off again by setting it to :const:`None`.
sv: En blockeringslista och en tillåtelselista för domäner tillhandahålls (båda är avstängda som standard). Endast domäner som inte finns i blockeringslistan och som finns i tillåtelselistan (om tillåtelselistan är aktiv) deltar i inställning och returnering av cookies. Använd konstruktörsargumentet *blocked_domains* och metoderna :meth:`blocked_domains` och :meth:`set_blocked_domains` (och motsvarande argument och metoder för *allowed_domains*). Om du ställer in en tillåtelselista kan du stänga av den igen genom att ställa in den till :const:`None`.

source: Domains in block or allow lists that do not start with a dot must equal the cookie domain to be matched. For example, ``"example.com"`` matches a blocklist entry of ``"example.com"``, but ``"www.example.com"`` does not. Domains that do start with a dot are matched by more specific domains too. For example, both ``"www.example.com"`` and ``"www.coyote.example.com"`` match ``".example.com"`` (but ``"example.com"`` itself does not). IP addresses are an exception, and must match exactly. For example, if blocked_domains contains ``"192.168.1.2"`` and ``".168.1.2"``, 192.168.1.2 is blocked, but 193.168.1.2 is not.
sv: Domäner i block- eller tillåt-listor som inte börjar med en punkt måste vara lika med cookiedomänen för att matchas. Till exempel matchar ``"example.com"`` en post i blocklistan för ``"example.com"``, men ``"www.example.com"`` gör det inte. Domäner som börjar med en punkt matchas också av mer specifika domäner. Till exempel matchar både ``"www.example.com"`` och ``"www.coyote.example.com"`` ``".example.com"`` (men ``"example.com"`` gör det inte). IP-adresser är ett undantag och måste matcha exakt. Om blocked_domains till exempel innehåller ``"192.168.1.2"`` och ``".168.1.2"`` blockeras 192.168.1.2, men inte 193.168.1.2.

source: :class:`DefaultCookiePolicy` implements the following additional methods:
sv: :class:`DefaultCookiePolicy` implementerar följande ytterligare metoder:

source: Return the sequence of blocked domains (as a tuple).
sv: Returnerar sekvensen av blockerade domäner (som en tupel).

source: Set the sequence of blocked domains.
sv: Ange ordningsföljden för blockerade domäner.

source: Return ``True`` if *domain* is on the blocklist for setting or receiving cookies.
sv: Returnerar ``True`` om *domain* finns på blocklistan för att ställa in eller ta emot cookies.

source: Return :const:`None`, or the sequence of allowed domains (as a tuple).
sv: Returnerar :const:`None`, eller sekvensen av tillåtna domäner (som en tupel).

source: Set the sequence of allowed domains, or :const:`None`.
sv: Ange sekvensen av tillåtna domäner, eller :const:`None`.

source: Return ``True`` if *domain* is not on the allowlist for setting or receiving cookies.
sv: Returnerar ``True`` om *domän* inte finns med på listan över tillåtna cookies för inställning eller mottagning.

source: :class:`DefaultCookiePolicy` instances have the following attributes, which are all initialised from the constructor arguments of the same name, and which may all be assigned to.
sv: :class:`DefaultCookiePolicy`-instanser har följande attribut, som alla initialiseras från konstruktorargumenten med samma namn, och som alla kan tilldelas.

source: If true, request that the :class:`CookieJar` instance downgrade :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) to Netscape cookies by setting the version attribute of the :class:`Cookie` instance to 0. The default value is :const:`None`, in which case RFC 2109 cookies are downgraded if and only if :rfc:`2965` handling is turned off. Therefore, RFC 2109 cookies are downgraded by default.
sv: Om true, begär att :class:`CookieJar`-instansen nedgraderar :rfc:`2109`-cookies (dvs. cookies som tas emot i en :mailheader:`Set-Cookie`-header med ett version cookie-attribut på 1) till Netscape-cookies genom att sätta version-attributet för :class:`Cookie`-instansen till 0. Standardvärdet är :const:`None`, i vilket fall RFC 2109-cookies nedgraderas om och endast om :rfc:`2965`-hanteringen är avstängd. Därför är RFC 2109-cookies nedgraderade som standard.

source: General strictness switches:
sv: Allmänna strikthetsbrytare:

source: Don't allow sites to set two-component domains with country-code top-level domains like ``.co.uk``, ``.gov.uk``, ``.co.nz``.etc. This is far from perfect and isn't guaranteed to work!
sv: Tillåt inte webbplatser att ställa in tvåkomponentsdomäner med toppdomäner med landskod som ``.co.uk``, ``.gov.uk``, ``.co.nz``.etc. Detta är långt ifrån perfekt och det är inte garanterat att det fungerar!

source: :rfc:`2965` protocol strictness switches:
sv: :rfc:`2965` växlar för strikthet i protokoll:

source: Follow :rfc:`2965` rules on unverifiable transactions (usually, an unverifiable transaction is one resulting from a redirect or a request for an image hosted on another site). If this is false, cookies are *never* blocked on the basis of verifiability
sv: Följ :rfc:`2965` regler för transaktioner som inte kan verifieras (vanligtvis är en transaktion som inte kan verifieras en transaktion som beror på en omdirigering eller en begäran om en bild som finns på en annan webbplats). Om detta är felaktigt blockeras cookies *aldrig* på grundval av verifierbarhet

source: Netscape protocol strictness switches:
sv: Omkopplare för strikthet i Netscape-protokollet:

source: Apply :rfc:`2965` rules on unverifiable transactions even to Netscape cookies.
sv: Tillämpa :rfc:`2965` regler om overifierbara transaktioner även på Netscape cookies.

source: Flags indicating how strict to be with domain-matching rules for Netscape cookies. See below for acceptable values.
sv: Flaggor som anger hur strikt man ska vara med reglerna för domänmatchning för Netscape-cookies. Se nedan för acceptabla värden.

source: Ignore cookies in Set-Cookie: headers that have names starting with ``'$'``.
sv: Ignorera cookies i Set-Cookie: rubriker som har namn som börjar med ``'$'``.

source: Don't allow setting cookies whose path doesn't path-match request URI.
sv: Tillåt inte inställning av cookies vars sökväg inte matchar sökvägen för begäran URI.

source: :attr:`~DefaultCookiePolicy.strict_ns_domain` is a collection of flags. Its value is constructed by or-ing together (for example, ``DomainStrictNoDots|DomainStrictNonDomain`` means both flags are set).
sv: :attr:`~DefaultCookiePolicy.strict_ns_domain` är en samling flaggor. Dess värde konstrueras genom att sätta ihop eller (t.ex. ``DomainStrictNoDots|DomainStrictNonDomain`` betyder att båda flaggorna är inställda).

source: When setting cookies, the 'host prefix' must not contain a dot (eg. ``www.foo.bar.com`` can't set a cookie for ``.bar.com``, because ``www.foo`` contains a dot).
sv: När du ställer in cookies får "värdprefixet" inte innehålla en punkt (t.ex. ``www.foo.bar.com`` kan inte ställa in en cookie för ``.bar.com``, eftersom ``www.foo`` innehåller en punkt).

source: Cookies that did not explicitly specify a ``domain`` cookie-attribute can only be returned to a domain equal to the domain that set the cookie (eg. ``spam.example.com`` won't be returned cookies from ``example.com`` that had no ``domain`` cookie-attribute).
sv: Cookies som inte uttryckligen angav ett cookie-attribut ``domän`` kan endast returneras till en domän som är lika med den domän som satte cookien (t.ex. kommer ``spam.example.com`` inte att returneras cookies från ``example.com`` som inte hade något cookie-attribut ``domän``).

source: When setting cookies, require a full :rfc:`2965` domain-match.
sv: Vid inställning av cookies krävs en fullständig :rfc:`2965` domänmatchning.

source: The following attributes are provided for convenience, and are the most useful combinations of the above flags:
sv: Följande attribut tillhandahålls för enkelhetens skull och är de mest användbara kombinationerna av ovanstående flaggor:

source: Equivalent to 0 (ie. all of the above Netscape domain strictness flags switched off).
sv: Motsvarar 0 (dvs. alla ovanstående flaggor för Netscape-domänens strikthet är avstängda).

source: Equivalent to ``DomainStrictNoDots|DomainStrictNonDomain``.
sv: Motsvarar ``DomainStrictNoDots|DomainStrictNonDomain``.

source: Cookie Objects
sv: Objekt för kakor

source: :class:`Cookie` instances have Python attributes roughly corresponding to the standard cookie-attributes specified in the various cookie standards. The correspondence is not one-to-one, because there are complicated rules for assigning default values, because the ``max-age`` and ``expires`` cookie-attributes contain equivalent information, and because :rfc:`2109` cookies may be 'downgraded' by :mod:`http.cookiejar` from version 1 to version 0 (Netscape) cookies.
sv: :class:`Cookie`-instanser har Python-attribut som i stort sett motsvarar de standardiserade cookie-attribut som anges i de olika cookie-standarderna. Korrespondensen är inte en-till-en, eftersom det finns komplicerade regler för tilldelning av standardvärden, eftersom cookie-attributen ``max-age`` och ``expires`` innehåller likvärdig information, och eftersom :rfc:`2109` cookies kan "nedgraderas" av :mod:`http.cookiejar` från version 1 till version 0 (Netscape) cookies.

source: Assignment to these attributes should not be necessary other than in rare circumstances in a :class:`CookiePolicy` method. The class does not enforce internal consistency, so you should know what you're doing if you do that.
sv: Tilldelning till dessa attribut bör inte vara nödvändig annat än i sällsynta fall i en :class:`CookiePolicy`-metod. Klassen upprätthåller inte intern konsistens, så du bör veta vad du gör om du gör det.

source: Integer or :const:`None`. Netscape cookies have :attr:`version` 0. :rfc:`2965` and :rfc:`2109` cookies have a ``version`` cookie-attribute of 1. However, note that :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
sv: Heltal eller :const:`None`. Netscape-cookies har :attr:`version` 0. :rfc:`2965` och :rfc:`2109` cookies har cookie-attributet ``version`` 1. Observera dock att :mod:`http.cookiejar` kan 'nedgradera' RFC 2109 cookies till Netscape-cookies, i vilket fall :attr:`version` är 0.

source: Cookie name (a string).
sv: Namnet på cookien (en sträng).

source: Cookie value (a string), or :const:`None`.
sv: Cookie-värde (en sträng), eller :const:`None`.

source: String representing a port or a set of ports (eg. '80', or '80,8080'), or :const:`None`.
sv: Sträng som representerar en port eller en uppsättning portar (t.ex. '80', eller '80,8080'), eller :const:`None`.

source: Cookie domain (a string).
sv: Domän för cookie (en sträng).

source: Cookie path (a string, eg. ``'/acme/rocket_launchers'``).
sv: Sökväg till cookie (en sträng, t.ex. ``'/acme/rocket_launchers'``).

source: ``True`` if cookie should only be returned over a secure connection.
sv: ``True`` om cookien endast ska returneras via en säker anslutning.

source: Integer expiry date in seconds since epoch, or :const:`None`. See also the :meth:`is_expired` method.
sv: Heltals utgångsdatum i sekunder sedan epoch, eller :const:`None`. Se även metoden :meth:`is_expired`.

source: ``True`` if this is a session cookie.
sv: ``True`` om detta är en sessionscookie.

source: String comment from the server explaining the function of this cookie, or :const:`None`.
sv: Strängkommentar från servern som förklarar funktionen för denna cookie, eller :const:`None`.

source: URL linking to a comment from the server explaining the function of this cookie, or :const:`None`.
sv: URL som länkar till en kommentar från servern som förklarar funktionen hos denna cookie, eller :const:`None`.

source: ``True`` if this cookie was received as an :rfc:`2109` cookie (ie. the cookie arrived in a :mailheader:`Set-Cookie` header, and the value of the Version cookie-attribute in that header was 1). This attribute is provided because :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
sv: ``True`` om denna cookie mottogs som en :rfc:`2109` cookie (dvs. cookien kom i en :mailheader:`Set-Cookie` header, och värdet på cookie-attributet Version i den headern var 1). Detta attribut tillhandahålls eftersom :mod:`http.cookiejar` kan 'nedgradera' RFC 2109-cookies till Netscape-cookies, i vilket fall :attr:`version` är 0.

source: ``True`` if a port or set of ports was explicitly specified by the server (in the :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2` header).
sv: ``True`` om en port eller en uppsättning portar uttryckligen har angetts av servern (i rubriken :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2`).

source: ``True`` if a domain was explicitly specified by the server.
sv: ``True`` om en domän uttryckligen har angetts av servern.

source: ``True`` if the domain explicitly specified by the server began with a dot (``'.'``).
sv: ``True`` om den domän som uttryckligen anges av servern började med en punkt (``'.'``).

source: Cookies may have additional non-standard cookie-attributes. These may be accessed using the following methods:
sv: Cookies kan ha ytterligare icke-standardiserade cookie-attribut. Dessa kan nås med hjälp av följande metoder:

source: Return ``True`` if cookie has the named cookie-attribute.
sv: Returnerar ``True`` om cookien har det angivna cookie-attributet.

source: If cookie has the named cookie-attribute, return its value. Otherwise, return *default*.
sv: Om cookien har det angivna cookie-attributet, returneras dess värde. Annars returneras *default*.

source: Set the value of the named cookie-attribute.
sv: Ställ in värdet på det namngivna cookie-attributet.

source: The :class:`Cookie` class also defines the following method:
sv: Klassen :class:`Cookie` definierar också följande metod:

source: ``True`` if cookie has passed the time at which the server requested it should expire. If *now* is given (in seconds since the epoch), return whether the cookie has expired at the specified time.
sv: ``True`` om cookien har passerat den tidpunkt då servern begärde att den skulle upphöra att gälla. Om *now* anges (i sekunder sedan epoken), returneras om cookien har löpt ut vid den angivna tidpunkten.

source: Examples
sv: Exempel

source: The first example shows the most common usage of :mod:`http.cookiejar`::
sv: Det första exemplet visar den vanligaste användningen av :mod:`http.cookiejar`::

source: This example illustrates how to open a URL using your Netscape, Mozilla, or Lynx cookies (assumes Unix/Netscape convention for location of the cookies file)::
sv: Detta exempel visar hur du öppnar en URL med hjälp av dina Netscape-, Mozilla- eller Lynx-cookies (förutsätter Unix/Netscape-konvention för placering av cookie-filen)::

source: The next example illustrates the use of :class:`DefaultCookiePolicy`. Turn on :rfc:`2965` cookies, be more strict about domains when setting and returning Netscape cookies, and block some domains from setting cookies or having them returned::
sv: Nästa exempel illustrerar användningen av :class:`DefaultCookiePolicy`. Aktivera :rfc:`2965`-cookies, var mer strikt mot domäner när du ställer in och returnerar Netscape-cookies och blockera vissa domäner från att ställa in cookies eller få dem returnerade::
