Repository: yeager/python-docs-sv
Catalog: library/http.client.po
Languages: sv

source: :mod:`!http.client` --- HTTP protocol client
sv: :mod:`!http.client` --- Klient för HTTP-protokoll

source: **Source code:** :source:`Lib/http/client.py`
sv: **Källkod:** :source:`Lib/http/client.py`

source: This module defines classes that implement the client side of the HTTP and HTTPS protocols. It is normally not used directly --- the module :mod:`urllib.request` uses it to handle URLs that use HTTP and HTTPS.
sv: Den här modulen definierar klasser som implementerar klientsidan av HTTP- och HTTPS-protokollen. Den används normalt inte direkt --- modulen :mod:`urllib.request` använder den för att hantera webbadresser som använder HTTP och HTTPS.

source: The `Requests package <https://requests.readthedocs.io/en/latest/>`_ is recommended for a higher-level HTTP client interface.
sv: Paketet `Requests <https://requests.readthedocs.io/en/latest/>`_ rekommenderas för ett HTTP-klientgränssnitt på högre nivå.

source: HTTPS support is only available if Python was compiled with SSL support (through the :mod:`ssl` module).
sv: HTTPS-stöd är endast tillgängligt om Python kompilerades med SSL-stöd (genom modulen :mod:`ssl`).

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: The module provides the following classes:
sv: Modulen innehåller följande klasser:

source: An :class:`HTTPConnection` instance represents one transaction with an HTTP server. It should be instantiated by passing it a host and optional port number. If no port number is passed, the port is extracted from the host string if it has the form ``host:port``, else the default HTTP port (80) is used. If the optional *timeout* parameter is given, blocking operations (like connection attempts) will timeout after that many seconds (if it is not given, the global default timeout setting is used). The optional *source_address* parameter may be a tuple of a (host, port) to use as the source address the HTTP connection is made from. The optional *blocksize* parameter sets the buffer size in bytes for sending a file-like message body.
sv: En :class:`HTTPConnection`-instans representerar en transaktion med en HTTP-server. Den bör instansieras genom att den får en värd och ett valfritt portnummer. Om inget portnummer anges extraheras porten från värdsträngen om den har formen ``host:port``, annars används HTTP-standardporten (80). Om den valfria parametern *timeout* anges kommer blockerande operationer (som anslutningsförsök) att timeoutas efter det antalet sekunder (om den inte anges används den globala standardinställningen för timeout). Den valfria parametern *source_address* kan vara en tupel av en (host, port) som ska användas som källadress för HTTP-anslutningen. Den valfria parametern *blocksize* anger buffertstorleken i byte för att skicka en filliknande meddelandekropp.

source: For example, the following calls all create instances that connect to the server at the same host and port::
sv: Följande anrop skapar t.ex. alla instanser som ansluter till servern på samma värd och port::

source: *source_address* was added.
sv: *source_address* har lagts till.

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
sv: Parametern *strict* har tagits bort. HTTP 0.9-stil "Simple Responses" stöds inte längre.

source: *blocksize* parameter was added.
sv: *blocksize*-parametern har lagts till.

source: A subclass of :class:`HTTPConnection` that uses SSL for communication with secure servers. Default port is ``443``. If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options.
sv: En underklass till :class:`HTTPConnection` som använder SSL för kommunikation med säkra servrar. Standardporten är ``443``. Om *context* anges måste det vara en instans av :class:`ssl.SSLContext` som beskriver de olika SSL-alternativen.

source: Please read :ref:`ssl-security` for more information on best practices.
sv: Läs :ref:`ssl-security` för mer information om bästa praxis.

source: *source_address*, *context* and *check_hostname* were added.
sv: *source_address*, *context* och *check_hostname* har lagts till.

source: This class now supports HTTPS virtual hosts if possible (that is, if :const:`ssl.HAS_SNI` is true).
sv: Den här klassen stöder nu virtuella HTTPS-värdar om möjligt (dvs. om :const:`ssl.HAS_SNI` är true).

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
sv: Parametern *strict* har tagits bort. HTTP 0.9-stil "Simple Responses" stöds inte längre.

source: This class now performs all the necessary certificate and hostname checks by default. To revert to the previous, unverified, behavior :func:`!ssl._create_unverified_context` can be passed to the *context* parameter.
sv: Den här klassen utför nu alla nödvändiga certifikat- och värdnamnskontroller som standard. För att återgå till det tidigare, overifierade, beteendet kan :func:`!ssl._create_unverified_context` skickas till parametern *context*.

source: This class now enables TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` for the default *context* or when *cert_file* is passed with a custom *context*.
sv: Den här klassen aktiverar nu TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` för standard *kontext* eller när *cert_file* skickas med en anpassad *kontext*.

source: This class now sends an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocols`.
sv: Denna klass skickar nu ett ALPN-tillägg med protokollindikatorn ``http/1.1`` när ingen *kontext* ges. Anpassad *kontext* bör ställa in ALPN-protokoll med :meth:`~ssl.SSLContext.set_alpn_protocols`.

source: The deprecated *key_file*, *cert_file* and *check_hostname* parameters have been removed.
sv: De föråldrade parametrarna *key_file*, *cert_file* och *check_hostname* har tagits bort.

source: Class whose instances are returned upon successful connection. Not instantiated directly by user.
sv: Klass vars instanser returneras vid lyckad anslutning. Instansieras inte direkt av användaren.

source: The *strict* parameter was removed. HTTP 0.9 style "Simple Responses" are no longer supported.
sv: Parametern *strict* har tagits bort. HTTP 0.9-stil "Simple Responses" stöds inte längre.

source: This module provides the following function:
sv: Denna modul har följande funktioner:

source: Parse the headers from a file pointer *fp* representing a HTTP request/response. The file has to be a :class:`~io.BufferedIOBase` reader (i.e. not text) and must provide a valid :rfc:`2822` style header.
sv: Analysera rubrikerna från en filpekare *fp* som representerar en HTTP-begäran/-svar. Filen måste vara en :class:`~io.BufferedIOBase`-läsare (dvs. inte text) och måste tillhandahålla en giltig :rfc:`2822`-stilrubrik.

source: This function returns an instance of :class:`http.client.HTTPMessage` that holds the header fields, but no payload (the same as :attr:`HTTPResponse.msg` and :attr:`http.server.BaseHTTPRequestHandler.headers`). After returning, the file pointer *fp* is ready to read the HTTP body.
sv: Denna funktion returnerar en instans av :class:`http.client.HTTPMessage` som innehåller rubrikfälten, men ingen nyttolast (samma som :attr:`HTTPResponse.msg` och :attr:`http.server.BaseHTTPRequestHandler.headers`). Efter att ha återvänt är filpekaren *fp* redo att läsa HTTP-kroppen.

source: :meth:`parse_headers` does not parse the start-line of a HTTP message; it only parses the ``Name: value`` lines. The file has to be ready to read these field lines, so the first line should already be consumed before calling the function.
sv: :meth:`parse_headers` analyserar inte startraden i ett HTTP-meddelande; den analyserar endast raderna ``Name: value``. Filen måste vara redo att läsa dessa fältrader, så den första raden bör redan ha använts innan funktionen anropas.

source: The following exceptions are raised as appropriate:
sv: Följande undantag tas upp i tillämpliga fall:

source: The base class of the other exceptions in this module. It is a subclass of :exc:`Exception`.
sv: Basklassen för de andra undantagen i denna modul. Den är en underklass till :exc:`Exception`.

source: A subclass of :exc:`HTTPException`.
sv: En underklass till :exc:`HTTPException`.

source: A subclass of :exc:`HTTPException`, raised if a port is given and is either non-numeric or empty.
sv: En underklass till :exc:`HTTPException`, som uppstår om en port anges och den antingen är icke-numerisk eller tom.

source: A subclass of :exc:`ImproperConnectionState`.
sv: En underklass av :exc:`ImproperConnectionState`.

source: A subclass of :exc:`HTTPException`. Raised if a server responds with a HTTP status code that we don't understand.
sv: En underklass till :exc:`HTTPException`. Uppstår om en server svarar med en HTTP-statuskod som vi inte förstår.

source: A subclass of :exc:`HTTPException`. Raised if an excessively long line is received in the HTTP protocol from the server.
sv: En underklass till :exc:`HTTPException`. Utlöses om en alltför lång rad tas emot i HTTP-protokollet från servern.

source: A subclass of :exc:`ConnectionResetError` and :exc:`BadStatusLine`. Raised by :meth:`HTTPConnection.getresponse` when the attempt to read the response results in no data read from the connection, indicating that the remote end has closed the connection.
sv: En underklass till :exc:`ConnectionResetError` och :exc:`BadStatusLine`. Utlöses av :meth:`HTTPConnection.getresponse` när försöket att läsa svaret resulterar i att inga data läses från anslutningen, vilket indikerar att fjärranslutningen har stängt anslutningen.

source: Previously, :exc:`BadStatusLine`\ ``('')`` was raised.
sv: Tidigare skapades :exc:`BadStatusLine````('')``.

source: The constants defined in this module are:
sv: De konstanter som definieras i denna modul är:

source: The default port for the HTTP protocol (always ``80``).
sv: Standardporten för HTTP-protokollet (alltid ``80``).

source: The default port for the HTTPS protocol (always ``443``).
sv: Standardporten för HTTPS-protokollet (alltid ``443``).

source: This dictionary maps the HTTP 1.1 status codes to the W3C names.
sv: Denna ordbok mappar HTTP 1.1-statuskoderna till W3C-namnen.

source: Example: ``http.client.responses[http.client.NOT_FOUND]`` is ``'Not Found'``.
sv: Exempel: ``http.client.responses[http.client.NOT_FOUND]`` är ``"Not Found"``.

source: See :ref:`http-status-codes` for a list of HTTP status codes that are available in this module as constants.
sv: Se :ref:`http-status-codes` för en lista över HTTP-statuskoder som finns tillgängliga i den här modulen som konstanter.

source: HTTPConnection Objects
sv: HTTPC-anslutningsobjekt

source: :class:`HTTPConnection` instances have the following methods:
sv: :class:`HTTPConnection`-instanser har följande metoder:

source: This will send a request to the server using the HTTP request method *method* and the request URI *url*. The provided *url* must be an absolute path to conform with :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (unless connecting to an HTTP proxy server or using the ``OPTIONS`` or ``CONNECT`` methods).
sv: Detta skickar en begäran till servern med HTTP-begärandemetoden *method* och begärans URI *url*. Den angivna *url* måste vara en absolut sökväg för att överensstämma med :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (om du inte ansluter till en HTTP-proxyserver eller använder metoderna ``OPTIONS`` eller ``CONNECT``).

source: If *body* is specified, the specified data is sent after the headers are finished. It may be a :class:`str`, a :term:`bytes-like object`, an open :term:`file object`, or an iterable of :class:`bytes`. If *body* is a string, it is encoded as ISO-8859-1, the default for HTTP. If it is a bytes-like object, the bytes are sent as is. If it is a :term:`file object`, the contents of the file is sent; this file object should support at least the ``read()`` method. If the file object is an instance of :class:`io.TextIOBase`, the data returned by the ``read()`` method will be encoded as ISO-8859-1, otherwise the data returned by ``read()`` is sent as is. If *body* is an iterable, the elements of the iterable are sent as is until the iterable is exhausted.
sv: Om *body* anges skickas den angivna datan efter att rubrikerna är klara. Det kan vara en :class:`str`, ett :term:`bytes-liknande objekt`, ett öppet :term:`file-objekt` eller en iterabel av :class:`bytes`. Om *body* är en sträng kodas den som ISO-8859-1, vilket är standard för HTTP. Om det är ett bytesliknande objekt skickas bytena som de är. Om det är ett :term:`filobjekt`, skickas innehållet i filen; detta filobjekt bör åtminstone stödja metoden ``read()``. Om filobjektet är en instans av :class:`io.TextIOBase`, kommer de data som returneras av metoden ``read()`` att kodas som ISO-8859-1, annars skickas de data som returneras av ``read()`` som de är. Om *body* är en iterabel skickas elementen i iterabeln som de är tills iterabeln är uttömd.

source: The *headers* argument should be a mapping of extra HTTP headers to send with the request. A :rfc:`Host header <2616#section-14.23>` must be provided to conform with :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (unless connecting to an HTTP proxy server or using the ``OPTIONS`` or ``CONNECT`` methods).
sv: Argumentet *headers* bör vara en mappning av extra HTTP-rubriker som ska skickas med begäran. En :rfc:`Host header <2616#section-14.23>` måste tillhandahållas för att överensstämma med :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (såvida man inte ansluter till en HTTP-proxyserver eller använder metoderna ``OPTIONS`` eller ``CONNECT``).

source: If *headers* contains neither Content-Length nor Transfer-Encoding, but there is a request body, one of those header fields will be added automatically. If *body* is ``None``, the Content-Length header is set to ``0`` for methods that expect a body (``PUT``, ``POST``, and ``PATCH``). If *body* is a string or a bytes-like object that is not also a :term:`file <file object>`, the Content-Length header is set to its length. Any other type of *body* (files and iterables in general) will be chunk-encoded, and the Transfer-Encoding header will automatically be set instead of Content-Length.
sv: Om *headers* varken innehåller Content-Length eller Transfer-Encoding, men det finns en request body, kommer ett av dessa header-fält att läggas till automatiskt. Om *body* är ``None``, sätts Content-Length-huvudet till ``0`` för metoder som förväntar sig en body (``PUT``, ``POST`` och ``PATCH``). Om *body* är en sträng eller ett bytesliknande objekt som inte också är en :term:`file <file object>`, sätts Content-Length-huvudet till dess längd. Alla andra typer av *body* (filer och iterabler i allmänhet) kommer att chunk-kodas, och Transfer-Encoding-huvudet kommer automatiskt att anges istället för Content-Length.

source: The *encode_chunked* argument is only relevant if Transfer-Encoding is specified in *headers*. If *encode_chunked* is ``False``, the HTTPConnection object assumes that all encoding is handled by the calling code. If it is ``True``, the body will be chunk-encoded.
sv: Argumentet *encode_chunked* är endast relevant om Transfer-Encoding anges i *headers*. Om *encode_chunked* är ``False``, antar HTTPConnection-objektet att all kodning hanteras av den anropande koden. Om det är ``True`` kommer kroppen att vara chunk-kodad.

source: For example, to perform a ``GET`` request to ``https://docs.python.org/3/``::
sv: Till exempel, för att utföra en ``GET`` begäran till ``https://docs.python.org/3/``::

source: Chunked transfer encoding has been added to the HTTP protocol version 1.1. Unless the HTTP server is known to handle HTTP 1.1, the caller must either specify the Content-Length, or must pass a :class:`str` or bytes-like object that is not also a file as the body representation.
sv: Chunked transfer encoding har lagts till i HTTP-protokollet version 1.1. Om inte HTTP-servern är känd för att hantera HTTP 1.1, måste anroparen antingen ange Content-Length eller skicka ett :class:`str` eller bytes-liknande objekt som inte också är en fil som body-representation.

source: *body* can now be an iterable.
sv: *body* kan nu vara en iterabel.

source: If neither Content-Length nor Transfer-Encoding are set in *headers*, file and iterable *body* objects are now chunk-encoded. The *encode_chunked* argument was added. No attempt is made to determine the Content-Length for file objects.
sv: Om varken Content-Length eller Transfer-Encoding anges i *headers* är fil- och iterable-objekten *body* nu chunk-kodade. Argumentet *encode_chunked* har lagts till. Det görs inga försök att fastställa Content-Length för filobjekt.

source: Should be called after a request is sent to get the response from the server. Returns an :class:`HTTPResponse` instance.
sv: Bör anropas efter att en begäran har skickats för att få svaret från servern. Returnerar en instans av :class:`HTTPResponse`.

source: Note that you must have read the whole response before you can send a new request to the server.
sv: Observera att du måste ha läst hela svaret innan du kan skicka en ny begäran till servern.

source: If a :exc:`ConnectionError` or subclass is raised, the :class:`HTTPConnection` object will be ready to reconnect when a new request is sent.
sv: Om ett :exc:`ConnectionError` eller underklass uppstår, kommer :class:`HTTPConnection`-objektet att vara redo att återansluta när en ny begäran skickas.

source: Set the debugging level. The default debug level is ``0``, meaning no debugging output is printed. Any value greater than ``0`` will cause all currently defined debug output to be printed to stdout. The ``debuglevel`` is passed to any new :class:`HTTPResponse` objects that are created.
sv: Ställer in felsökningsnivån. Standardnivån för felsökning är ``0``, vilket innebär att inga felsökningsresultat skrivs ut. Alla värden som är större än ``0`` gör att all debug-utdata som för närvarande är definierad skrivs ut till stdout. Debuggnivån skickas till alla nya :class:`HTTPResponse`-objekt som skapas.

source: Set the host and the port for HTTP Connect Tunnelling. This allows running the connection through a proxy server.
sv: Ange värd och port för HTTP Connect Tunnelling. Detta gör det möjligt att köra anslutningen via en proxyserver.

source: The *host* and *port* arguments specify the endpoint of the tunneled connection (i.e. the address included in the CONNECT request, *not* the address of the proxy server).
sv: Argumenten *host* och *port* anger slutpunkten för den tunnlade anslutningen (dvs. den adress som ingår i CONNECT-begäran, *inte* proxyserverns adress).

source: The *headers* argument should be a mapping of extra HTTP headers to send with the CONNECT request.
sv: Argumentet *headers* bör vara en mappning av extra HTTP-rubriker som ska skickas med CONNECT-begäran.

source: As HTTP/1.1 is used for HTTP CONNECT tunnelling request, `as per the RFC <https://datatracker.ietf.org/doc/html/rfc7231#section-4.3.6>`_, a HTTP ``Host:`` header must be provided, matching the authority-form of the request target provided as the destination for the CONNECT request. If a HTTP ``Host:`` header is not provided via the headers argument, one is generated and transmitted automatically.
sv: Eftersom HTTP/1.1 används för HTTP CONNECT-tunnelförfrågningar, `enligt RFC <https://datatracker.ietf.org/doc/html/rfc7231#section-4.3.6>`_, måste en HTTP ``Host:``-rubrik tillhandahållas, som matchar auktoritetsformen för det förfrågningsmål som anges som destination för CONNECT-förfrågan. Om en HTTP ``Host:`` header inte tillhandahålls via argumentet headers, genereras och överförs en header automatiskt.

source: For example, to tunnel through a HTTPS proxy server running locally on port 8080, we would pass the address of the proxy to the :class:`HTTPSConnection` constructor, and the address of the host that we eventually want to reach to the :meth:`~HTTPConnection.set_tunnel` method::
sv: Om vi till exempel vill skapa en tunnel genom en HTTPS-proxyserver som körs lokalt på port 8080, skickar vi adressen till proxyn till :class:`HTTPSConnection`-konstruktören och adressen till den värd som vi så småningom vill nå till :meth:`~HTTPConnection.set_tunnel`-metoden::

source: HTTP CONNECT tunnelling requests use protocol HTTP/1.1, upgraded from protocol HTTP/1.0. ``Host:`` HTTP headers are mandatory for HTTP/1.1, so one will be automatically generated and transmitted if not provided in the headers argument.
sv: HTTP CONNECT-tunnelförfrågningar använder protokoll HTTP/1.1, uppgraderat från protokoll HTTP/1.0. ``Host:`` HTTP-rubriker är obligatoriska för HTTP/1.1, så en kommer automatiskt att genereras och överföras om den inte anges i argumentet headers.

source: Returns a dictionary with the headers of the response received from the proxy server to the CONNECT request.
sv: Returnerar en ordbok med rubrikerna i svaret från proxyservern på CONNECT-begäran.

source: If the CONNECT request was not sent, the method returns ``None``.
sv: Om CONNECT-begäran inte skickades returnerar metoden ``None``.

source: Connect to the server specified when the object was created. By default, this is called automatically when making a request if the client does not already have a connection.
sv: Anslut till den server som angavs när objektet skapades. Som standard anropas detta automatiskt när en begäran görs om klienten inte redan har en anslutning.

source: Raises an :ref:`auditing event <auditing>` ``http.client.connect`` with arguments ``self``, ``host``, ``port``.
sv: Utlöser en :ref:`auditing event <auditing>` ``http.client.connect`` med argumenten ``self``, ``host``, ``port``.

source: Close the connection to the server.
sv: Stäng anslutningen till servern.

source: Buffer size in bytes for sending a file-like message body.
sv: Buffertstorlek i bytes för att skicka en filliknande meddelandekropp.

source: As an alternative to using the :meth:`~HTTPConnection.request` method described above, you can also send your request step by step, by using the four functions below.
sv: Som ett alternativ till att använda metoden :meth:`~HTTPConnection.request` som beskrivs ovan kan du också skicka din begäran steg för steg genom att använda de fyra funktionerna nedan.

source: This should be the first call after the connection to the server has been made. It sends a line to the server consisting of the *method* string, the *url* string, and the HTTP version (``HTTP/1.1``). To disable automatic sending of ``Host:`` or ``Accept-Encoding:`` headers (for example to accept additional content encodings), specify *skip_host* or *skip_accept_encoding* with non-False values.
sv: Detta bör vara det första anropet efter att anslutningen till servern har upprättats. Det skickar en rad till servern som består av *method*-strängen, *url*-strängen och HTTP-versionen (``HTTP/1.1``). För att inaktivera automatisk sändning av ``Host:`` eller ``Accept-Encoding:``-rubriker (till exempel för att acceptera ytterligare innehållskodningar), ange *skip_host* eller *skip_accept_encoding* med icke-falska värden.
