Repository: yeager/python-docs-sv
Catalog: library/http.server.po
Languages: sv

source: A lot of the work, such as parsing the request, is done by the base class :class:`BaseHTTPRequestHandler`. This class implements the :func:`do_GET` and :func:`do_HEAD` functions.
sv: En stor del av arbetet, t.ex. parsning av begäran, görs av basklassen :class:`BaseHTTPRequestHandler`. Denna klass implementerar funktionerna :func:`do_GET` och :func:`do_HEAD`.

source: The following are defined as class-level attributes of :class:`SimpleHTTPRequestHandler`:
sv: Följande är definierade som attribut på klassnivå för :class:`SimpleHTTPRequestHandler`:

source: This will be ``"SimpleHTTP/" + __version__``, where ``__version__`` is defined at the module level.
sv: Detta kommer att vara ``"SimpleHTTP/" + __version__``, där ``__version__`` definieras på modulnivå.

source: A dictionary mapping suffixes into MIME types, contains custom overrides for the default system mappings. The mapping is used case-insensitively, and so should contain only lower-cased keys.
sv: En ordbok som mappar suffix till MIME-typer, innehåller anpassade åsidosättningar för systemets standardmappningar. Mappningen används utan hänsyn till skiftlägesskillnader och bör därför endast innehålla nycklar med gemener.

source: This dictionary is no longer filled with the default system mappings, but only contains overrides.
sv: Denna ordbok är inte längre fylld med systemets standardmappningar, utan innehåller endast åsidosättningar.

source: The :class:`SimpleHTTPRequestHandler` class defines the following methods:
sv: Klassen :class:`SimpleHTTPRequestHandler` definierar följande metoder:

source: This method serves the ``'HEAD'`` request type: it sends the headers it would send for the equivalent ``GET`` request. See the :meth:`do_GET` method for a more complete explanation of the possible headers.
sv: Denna metod betjänar ``'HEAD'``-begärandetypen: den skickar de rubriker som den skulle skicka för motsvarande ``GET``-begärande. Se :meth:`do_GET`-metoden för en mer fullständig förklaring av de möjliga rubrikerna.

source: The request is mapped to a local file by interpreting the request as a path relative to the current working directory.
sv: Begäran mappas till en lokal fil genom att tolka begäran som en sökväg i förhållande till den aktuella arbetskatalogen.

source: If the request was mapped to a directory, the directory is checked for a file named ``index.html`` or ``index.htm`` (in that order). If found, the file's contents are returned; otherwise a directory listing is generated by calling the :meth:`list_directory` method. This method uses :func:`os.listdir` to scan the directory, and returns a ``404`` error response if the :func:`~os.listdir` fails.
sv: Om begäran mappades till en katalog, kontrolleras om katalogen innehåller en fil med namnet ``index.html`` eller ``index.htm`` (i den ordningen). Om den hittas returneras filens innehåll, annars genereras en kataloglista genom att anropa metoden :meth:`list_directory`. Denna metod använder :func:`os.listdir` för att skanna katalogen och returnerar ett ``404``-felsvar om :func:`~os.listdir` misslyckas.

source: If the request was mapped to a file, it is opened. Any :exc:`OSError` exception in opening the requested file is mapped to a ``404``, ``'File not found'`` error. If there was an ``'If-Modified-Since'`` header in the request, and the file was not modified after this time, a ``304``, ``'Not Modified'`` response is sent. Otherwise, the content type is guessed by calling the :meth:`guess_type` method, which in turn uses the *extensions_map* variable, and the file contents are returned.
sv: Om begäran mappades till en fil öppnas den. Alla :exc:`OSError`-undantag vid öppnandet av den begärda filen mappas till ett ``404``, ``'Filen hittades inte'``-fel. Om det fanns en ``'If-Modified-Since'`` header i begäran, och filen inte modifierades efter denna tid, skickas ett ``304``, ``Not Modified'`` svar. I annat fall gissas innehållstypen genom anrop av metoden :meth:`guess_type`, som i sin tur använder variabeln *extensions_map*, och filinnehållet returneras.

source: A ``'Content-type:'`` header with the guessed content type is output, followed by a ``'Content-Length:'`` header with the file's size and a ``'Last-Modified:'`` header with the file's modification time.
sv: En ``'Content-type:'`` header med den gissade innehållstypen matas ut, följt av en ``'Content-Length:'`` header med filens storlek och en ``'Last-Modified:'`` header med filens ändringstid.

source: Then follows a blank line signifying the end of the headers, and then the contents of the file are output.
sv: Därefter följer en tom rad som markerar slutet på sidhuvudet och sedan matas innehållet i filen ut.

source: For example usage, see the implementation of the ``test`` function in :source:`Lib/http/server.py`.
sv: För exempel på användning, se implementeringen av funktionen ``test`` i :source:`Lib/http/server.py`.

source: Support of the ``'If-Modified-Since'`` header.
sv: Stöd för rubriken ``'If-Modified-Since'``.

source: The :class:`SimpleHTTPRequestHandler` class can be used in the following manner in order to create a very basic webserver serving files relative to the current directory::
sv: Klassen :class:`SimpleHTTPRequestHandler` kan användas på följande sätt för att skapa en mycket enkel webbserver som serverar filer i förhållande till den aktuella katalogen::

source: :class:`SimpleHTTPRequestHandler` can also be subclassed to enhance behavior, such as using different index file names by overriding the class attribute :attr:`index_pages`.
sv: :class:`SimpleHTTPRequestHandler` kan också underklassificeras för att förbättra beteendet, t.ex. genom att använda olika indexfilnamn genom att åsidosätta klassattributet :attr:`index_pages`.

source: This class is used to serve either files or output of CGI scripts from the current directory and below. Note that mapping HTTP hierarchic structure to local directory structure is exactly as in :class:`SimpleHTTPRequestHandler`.
sv: Denna klass används för att servera antingen filer eller utdata från CGI-skript från den aktuella katalogen och nedåt. Observera att mappning av HTTP-hierarkisk struktur till lokal katalogstruktur är exakt som i :class:`SimpleHTTPRequestHandler`.

source: CGI scripts run by the :class:`CGIHTTPRequestHandler` class cannot execute redirects (HTTP code 302), because code 200 (script output follows) is sent prior to execution of the CGI script. This pre-empts the status code.
sv: CGI-skript som körs av :class:`CGIHTTPRequestHandler`-klassen kan inte utföra omdirigeringar (HTTP-kod 302), eftersom kod 200 (skriptutdata följer) skickas innan CGI-skriptet körs. Detta föregår statuskoden.

source: The class will however, run the CGI script, instead of serving it as a file, if it guesses it to be a CGI script. Only directory-based CGI are used --- the other common server configuration is to treat special extensions as denoting CGI scripts.
sv: Klassen kommer dock att köra CGI-skriptet, istället för att servera det som en fil, om den gissar att det är ett CGI-skript. Endast katalogbaserade CGI används --- den andra vanliga serverkonfigurationen är att behandla speciella tillägg som betecknar CGI-skript.

source: The :func:`do_GET` and :func:`do_HEAD` functions are modified to run CGI scripts and serve the output, instead of serving files, if the request leads to somewhere below the ``cgi_directories`` path.
sv: Funktionerna :func:`do_GET` och :func:`do_HEAD` är modifierade så att de kör CGI-skript och serverar utdata i stället för att servera filer om begäran leder till en plats under sökvägen ``cgi_directories``.

source: The :class:`CGIHTTPRequestHandler` defines the following data member:
sv: Klassen :class:`CGIHTTPRequestHandler` definierar följande datamedlem:

source: This defaults to ``['/cgi-bin', '/htbin']`` and describes directories to treat as containing CGI scripts.
sv: Standardvärdet är ``['/cgi-bin', '/htbin']`` och beskriver kataloger som ska behandlas som innehållande CGI-skript.

source: The :class:`CGIHTTPRequestHandler` defines the following method:
sv: :class:`CGIHTTPRequestHandler` definierar följande metod:

source: This method serves the ``'POST'`` request type, only allowed for CGI scripts. Error 501, "Can only POST to CGI scripts", is output when trying to POST to a non-CGI url.
sv: Denna metod serverar begärandetypen ``'POST``, som endast är tillåten för CGI-skript. Fel 501, "Can only POST to CGI scripts", visas när man försöker POSTa till en url som inte är CGI.

source: Note that CGI scripts will be run with UID of user nobody, for security reasons. Problems with the CGI script will be translated to error 403.
sv: Observera att CGI-skript kommer att köras med UID för användaren nobody, av säkerhetsskäl. Problem med CGI-skriptet kommer att översättas till fel 403.

source: :class:`CGIHTTPRequestHandler` is being removed in 3.15. CGI has not been considered a good way to do things for well over a decade. This code has been unmaintained for a while now and sees very little practical use. Retaining it could lead to further :ref:`security considerations <http.server-security>`.
sv: :class:`CGIHTTPRequestHandler` kommer att tas bort i 3.15. CGI har inte ansetts vara ett bra sätt att göra saker på över ett decennium. Den här koden har inte underhållits på ett tag nu och har mycket liten praktisk användning. Att behålla den kan leda till ytterligare :ref:`säkerhetsöverväganden <http.server-security>`.

source: Command-line interface
sv: Kommandoradsgränssnitt

source: :mod:`http.server` can also be invoked directly using the :option:`-m` switch of the interpreter. The following example illustrates how to serve files relative to the current directory::
sv: :mod:`http.server` kan också anropas direkt med hjälp av :option:`-m` i tolken. Följande exempel illustrerar hur man serverar filer i förhållande till den aktuella katalogen::

source: The following options are accepted:
sv: Följande alternativ accepteras:

source: The server listens to port 8000 by default. The default can be overridden by passing the desired port number as an argument::
sv: Servern lyssnar på port 8000 som standard. Standardinställningen kan åsidosättas genom att ange önskat portnummer som ett argument::

source: Specifies a specific address to which it should bind. Both IPv4 and IPv6 addresses are supported. By default, the server binds itself to all interfaces. For example, the following command causes the server to bind to localhost only::
sv: Anger en specifik adress som den ska binda till. Både IPv4- och IPv6-adresser stöds. Som standard binder servern sig till alla gränssnitt. Följande kommando gör t.ex. att servern endast binder till localhost::

source: Support IPv6 in the ``--bind`` option.
sv: Stöd för IPv6 i alternativet ``--bind``.

source: Specifies a directory to which it should serve the files. By default, the server uses the current directory. For example, the following command uses a specific directory::
sv: Anger en katalog till vilken filerna ska skickas. Som standard använder servern den aktuella katalogen. Följande kommando använder t.ex. en viss katalog::

source: Specifies the HTTP version to which the server is conformant. By default, the server is conformant to HTTP/1.0. For example, the following command runs an HTTP/1.1 conformant server::
sv: Anger den HTTP-version som servern är kompatibel med. Som standard är servern kompatibel med HTTP/1.0. Följande kommando kör t.ex. en HTTP/1.1-konform server::

source: :class:`CGIHTTPRequestHandler` can be enabled in the command line by passing the ``--cgi`` option::
sv: :class:`CGIHTTPRequestHandler` kan aktiveras på kommandoraden genom att ange alternativet ``--cgi``::

source: :mod:`http.server` command line ``--cgi`` support is being removed because :class:`CGIHTTPRequestHandler` is being removed.
sv: :mod:`http.server` command line ``--cgi`` support tas bort eftersom :class:`CGIHTTPRequestHandler` tas bort.

source: :class:`CGIHTTPRequestHandler` and the ``--cgi`` command-line option are not intended for use by untrusted clients and may be vulnerable to exploitation. Always use within a secure environment.
sv: :class:`CGIHTTPRequestHandler` och kommandoradsalternativet ``--cgi`` är inte avsedda att användas av icke betrodda klienter och kan vara sårbara för exploatering. Använd alltid inom en säker miljö.

source: Specifies a TLS certificate chain for HTTPS connections::
sv: Anger en TLS-certifikatkedja för HTTPS-anslutningar::

source: Specifies a private key file for HTTPS connections.
sv: Anger en privat nyckelfil för HTTPS-anslutningar.

source: This option requires ``--tls-cert`` to be specified.
sv: Detta alternativ kräver att ``--tls-cert`` anges.

source: Specifies the password file for password-protected private keys::
sv: Anger lösenordsfilen för lösenordsskyddade privata nycklar::

source: This option requires `--tls-cert`` to be specified.
sv: Detta alternativ kräver att `--tls-cert`` anges.

source: Security considerations
sv: Överväganden om säkerhet

source: :class:`SimpleHTTPRequestHandler` will follow symbolic links when handling requests, this makes it possible for files outside of the specified directory to be served.
sv: :class:`SimpleHTTPRequestHandler` kommer att följa symboliska länkar vid hantering av förfrågningar, vilket gör det möjligt för filer utanför den angivna katalogen att serveras.

source: Earlier versions of Python did not scrub control characters from the log messages emitted to stderr from ``python -m http.server`` or the default :class:`BaseHTTPRequestHandler` ``.log_message`` implementation. This could allow remote clients connecting to your server to send nefarious control codes to your terminal.
sv: Tidigare versioner av Python rensade inte bort kontrolltecken från loggmeddelanden som sändes till stderr från ``python -m http.server`` eller standardimplementationen :class:`BaseHTTPRequestHandler` ``.log_message``. Detta kan göra det möjligt för fjärrklienter som ansluter till din server att skicka skumma kontrollkoder till din terminal.

source: Control characters are scrubbed in stderr logs.
sv: Kontrolltecken rensas bort i stderr-loggar.

source: protocol
sv: protokoll

source: security
sv: säkerhet
