Repository: yeager/python-docs-sv
Catalog: library/http.client.po
Languages: sv

source: Send an :rfc:`822`\ -style header to the server. It sends a line to the server consisting of the header, a colon and a space, and the first argument. If more arguments are given, continuation lines are sent, each consisting of a tab and an argument.
sv: Skicka en header i stil med :rfc:`822` till servern. Det skickar en rad till servern som består av rubriken, ett kolon och ett mellanslag samt det första argumentet. Om fler argument anges skickas fortsättningsrader, var och en bestående av en tabb och ett argument.

source: Send a blank line to the server, signalling the end of the headers. The optional *message_body* argument can be used to pass a message body associated with the request.
sv: Skicka en tom rad till servern för att markera slutet på sidhuvudet. Det valfria argumentet *message_body* kan användas för att skicka en meddelandekod som är kopplad till begäran.

source: If *encode_chunked* is ``True``, the result of each iteration of *message_body* will be chunk-encoded as specified in :rfc:`7230`, Section 3.3.1. How the data is encoded is dependent on the type of *message_body*. If *message_body* implements the :ref:`buffer interface <bufferobjects>` the encoding will result in a single chunk. If *message_body* is a :class:`collections.abc.Iterable`, each iteration of *message_body* will result in a chunk. If *message_body* is a :term:`file object`, each call to ``.read()`` will result in a chunk. The method automatically signals the end of the chunk-encoded data immediately after *message_body*.
sv: Om *encode_chunked* är ``True`` kommer resultatet av varje iteration av *message_body* att chunk-kodas enligt specifikationen i :rfc:`7230`, avsnitt 3.3.1. Hur data kodas beror på vilken typ av *message_body* som används. Om *message_body* implementerar :ref:`buffer interface <bufferobjects>` kommer kodningen att resultera i en enda chunk. Om *message_body* är en :class:`collections.abc.Iterable` kommer varje iteration av *message_body* att resultera i en chunk. Om *message_body* är en :term:`file object`, kommer varje anrop till ``.read()`` att resultera i en chunk. Metoden signalerar automatiskt slutet på de chunk-kodade data omedelbart efter *message_body*.

source: Due to the chunked encoding specification, empty chunks yielded by an iterator body will be ignored by the chunk-encoder. This is to avoid premature termination of the read of the request by the target server due to malformed encoding.
sv: På grund av specifikationen för chunked-kodning ignoreras tomma chunks som genereras av en iteratorkropp av chunk-kodaren. Detta för att undvika att målservern avslutar läsningen av begäran i förtid på grund av felaktig kodning.

source: Added chunked encoding support and the *encode_chunked* parameter.
sv: Stöd för chunked-kodning och parametern *encode_chunked* har lagts till.

source: Send data to the server. This should be used directly only after the :meth:`endheaders` method has been called and before :meth:`getresponse` is called.
sv: Skicka data till servern. Detta bör användas direkt först efter att metoden :meth:`endheaders` har anropats och innan :meth:`getresponse` anropas.

source: Raises an :ref:`auditing event <auditing>` ``http.client.send`` with arguments ``self``, ``data``.
sv: Utlöser en :ref:`auditing event <auditing>` ``http.client.send`` med argumenten ``self``, ``data``.

source: HTTPResponse Objects
sv: HTTPResponse Objekt

source: An :class:`HTTPResponse` instance wraps the HTTP response from the server. It provides access to the request headers and the entity body. The response is an iterable object and can be used in a with statement.
sv: En :class:`HTTPResponse`-instans omsluter HTTP-svaret från servern. Den ger tillgång till begärans rubriker och entitetens kropp. Svaret är ett itererbart objekt och kan användas i en with-sats.

source: The :class:`io.BufferedIOBase` interface is now implemented and all of its reader operations are supported.
sv: Gränssnittet :class:`io.BufferedIOBase` är nu implementerat och alla dess läsoperationer stöds.

source: Reads and returns the response body, or up to the next *amt* bytes.
sv: Läser och returnerar svarstexten, eller upp till nästa *amt* byte.

source: Reads up to the next len(b) bytes of the response body into the buffer *b*. Returns the number of bytes read.
sv: Läser upp till nästa len(b) byte av svarstexten i bufferten *b*. Returnerar antalet lästa byte.

source: Return the value of the header *name*, or *default* if there is no header matching *name*. If there is more than one header with the name *name*, return all of the values joined by ', '. If *default* is any iterable other than a single string, its elements are similarly returned joined by commas.
sv: Returnerar värdet för rubriken *name*, eller *default* om det inte finns någon rubrik som matchar *name*. Om det finns mer än en header med namnet *name*, returneras alla värden sammanfogade med ', '. Om *default* är någon annan iterabel än en enda sträng returneras dess element på samma sätt med kommatecken.

source: Return a list of (header, value) tuples.
sv: Returnerar en lista med (header, value)-tupler.

source: Return the ``fileno`` of the underlying socket.
sv: Returnerar ``fileno`` för det underliggande uttaget.

source: A :class:`http.client.HTTPMessage` instance containing the response headers. :class:`http.client.HTTPMessage` is a subclass of :class:`email.message.Message`.
sv: En instans av :class:`http.client.HTTPMessage` som innehåller svarshuvudena. :class:`http.client.HTTPMessage` är en underklass av :class:`email.message.Message`.

source: HTTP protocol version used by server. 10 for HTTP/1.0, 11 for HTTP/1.1.
sv: HTTP-protokollversion som används av servern. 10 för HTTP/1.0, 11 för HTTP/1.1.

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
sv: URL för den hämtade resursen, används vanligen för att avgöra om en omdirigering följdes.

source: Headers of the response in the form of an :class:`email.message.EmailMessage` instance.
sv: Svarets rubriker i form av en instans av :class:`email.message.EmailMessage`.

source: Status code returned by server.
sv: Statuskod som returneras av servern.

source: Reason phrase returned by server.
sv: Orsaksfras som returneras av servern.

source: A debugging hook. If :attr:`debuglevel` is greater than zero, messages will be printed to stdout as the response is read and parsed.
sv: En felsökningskrok. Om :attr:`debuglevel` är större än noll kommer meddelanden att skrivas ut till stdout när svaret läses och analyseras.

source: Is ``True`` if the stream is closed.
sv: Är ``True`` om strömmen är stängd.

source: Deprecated in favor of :attr:`~HTTPResponse.url`.
sv: Föråldrad till förmån för :attr:`~HTTPResponse.url`.

source: Deprecated in favor of :attr:`~HTTPResponse.headers`.
sv: Föråldrad till förmån för :attr:`~HTTPResponse.headers`.

source: Deprecated in favor of :attr:`~HTTPResponse.status`.
sv: Föråldrad till förmån för :attr:`~HTTPResponse.status`.

source: Examples
sv: Exempel

source: Here is an example session that uses the ``GET`` method::
sv: Här är ett exempel på en session som använder metoden ``GET``::

source: Here is an example session that uses the ``HEAD`` method. Note that the ``HEAD`` method never returns any data. ::
sv: Här är ett exempel på en session som använder metoden ``HEAD``. Observera att metoden ``HEAD`` aldrig returnerar några data. ::

source: Here is an example session that uses the ``POST`` method::
sv: Här är ett exempel på en session som använder metoden ``POST``::

source: Client side HTTP ``PUT`` requests are very similar to ``POST`` requests. The difference lies only on the server side where HTTP servers will allow resources to be created via ``PUT`` requests. It should be noted that custom HTTP methods are also handled in :class:`urllib.request.Request` by setting the appropriate method attribute. Here is an example session that uses the ``PUT`` method::
sv: HTTP ``PUT``-förfrågningar på klientsidan är mycket lika ``POST``-förfrågningar. Skillnaden ligger endast på serversidan där HTTP-servrar tillåter att resurser skapas via ``PUT``-förfrågningar. Det bör noteras att anpassade HTTP-metoder också hanteras i :class:`urllib.request.Request` genom att ställa in lämpligt metodattribut. Här är ett exempel på en session som använder metoden ``PUT``::

source: HTTPMessage Objects
sv: HTTPMessage-objekt

source: An :class:`http.client.HTTPMessage` instance holds the headers from an HTTP response. It is implemented using the :class:`email.message.Message` class.
sv: En :class:`http.client.HTTPMessage`-instans innehåller rubrikerna från ett HTTP-svar. Den implementeras med hjälp av :class:`email.message.Message`-klassen.

source: protocol
sv: protokoll

source: http.client (standard module)
sv: http.client (standardmodul)

source: module
sv: modul

source: urllib.request
sv: urllib.begäran
