Repository: yeager/python-docs-sv
Catalog: library/importlib.po
Languages: sv

source: :mod:`!importlib` --- The implementation of :keyword:`!import`
sv: :mod:`!importlib` --- Implementeringen av :keyword:`!import`

source: **Source code:** :source:`Lib/importlib/__init__.py`
sv: **Källkod:** :källa:`Lib/importlib/__init__.py`

source: Introduction
sv: Introduktion

source: The purpose of the :mod:`importlib` package is three-fold.
sv: Syftet med :mod:`importlib`-paketet är trefaldigt.

source: One is to provide the implementation of the :keyword:`import` statement (and thus, by extension, the :func:`__import__` function) in Python source code. This provides an implementation of :keyword:`!import` which is portable to any Python interpreter. This also provides an implementation which is easier to comprehend than one implemented in a programming language other than Python.
sv: En är att tillhandahålla implementeringen av :keyword:`import`-satsen (och därmed, i förlängningen, :func:`__import__`-funktionen) i Python-källkod. Detta ger en implementering av :keyword:`!import` som är portabel till alla Python-tolkar. Detta ger också en implementering som är lättare att förstå än en implementering i ett annat programmeringsspråk än Python.

source: Two, the components to implement :keyword:`import` are exposed in this package, making it easier for users to create their own custom objects (known generically as an :term:`importer`) to participate in the import process.
sv: För det andra exponeras komponenterna för att implementera :keyword:`import` i detta paket, vilket gör det lättare för användare att skapa sina egna anpassade objekt (allmänt kända som en :term:`importer`) för att delta i importprocessen.

source: Three, the package contains modules exposing additional functionality for managing aspects of Python packages:
sv: Tre, paketet innehåller moduler som exponerar ytterligare funktionalitet för att hantera aspekter av Python-paket:

source: :mod:`importlib.metadata` presents access to metadata from third-party distributions.
sv: :mod:`importlib.metadata` ger tillgång till metadata från tredjepartsdistributioner.

source: :mod:`importlib.resources` provides routines for accessing non-code "resources" from Python packages.
sv: :mod:`importlib.resources` tillhandahåller rutiner för att komma åt icke-kodade "resurser" från Python-paket.

source: The language reference for the :keyword:`import` statement.
sv: Språkreferensen för :keyword:`import`-satsen.

source: `Packages specification <https://www.python.org/doc/essays/packages/>`__
sv: `Paketspecifikation <https://www.python.org/doc/essays/packages/>`__

source: Original specification of packages. Some semantics have changed since the writing of this document (e.g. redirecting based on ``None`` in :data:`sys.modules`).
sv: Ursprunglig specifikation av paket. Viss semantik har ändrats sedan detta dokument skrevs (t.ex. omdirigering baserad på ``None`` i :data:`sys.modules`).

source: The :func:`.__import__` function
sv: Funktionen :func:`.__import__`

source: The :keyword:`import` statement is syntactic sugar for this function.
sv: Satsen :keyword:`import` är ett syntaktiskt socker för denna funktion.

source: The initialization of :data:`sys.path`.
sv: Initialisering av :data:`sys.path`.

source: Import on Case-Insensitive Platforms
sv: Import på plattformar som är okänsliga för skiftlägeslägeskoder

source: Defining Python Source Code Encodings
sv: Definiera kodning av Python-källkod

source: New Import Hooks
sv: Hooks för ny import

source: Imports: Multi-Line and Absolute/Relative
sv: Import: Multi-Line och Absolut/Relativ

source: Main module explicit relative imports
sv: Huvudmodulens explicita relativa import

source: Implicit namespace packages
sv: Implicita namnområdespaket

source: A ModuleSpec Type for the Import System
sv: En ModuleSpec-typ för importsystemet

source: Elimination of PYO files
sv: Eliminering av PYO-filer

source: Multi-phase extension module initialization
sv: Initialisering av förlängningsmodul i flera faser

source: Deterministic pycs
sv: Deterministisk pycs

source: Using UTF-8 as the Default Source Encoding
sv: Använda UTF-8 som standardkodning för källkod

source: PYC Repository Directories
sv: Kataloger för PYC-förvar

source: Functions
sv: Funktioner

source: An implementation of the built-in :func:`__import__` function.
sv: En implementation av den inbyggda funktionen :func:`__import__`.

source: Programmatic importing of modules should use :func:`import_module` instead of this function.
sv: Programmatisk import av moduler bör använda :func:`import_module` istället för denna funktion.

source: Import a module. The *name* argument specifies what module to import in absolute or relative terms (e.g. either ``pkg.mod`` or ``..mod``). If the name is specified in relative terms, then the *package* argument must be set to the name of the package which is to act as the anchor for resolving the package name (e.g. ``import_module('..mod', 'pkg.subpkg')`` will import ``pkg.mod``).
sv: Importera en modul. Argumentet *name* anger vilken modul som ska importeras i absoluta eller relativa termer (t.ex. antingen ``pkg.mod`` eller ``..mod``). Om namnet anges i relativa termer måste argumentet *package* sättas till namnet på det paket som ska fungera som ankare för att lösa upp paketnamnet (t.ex. ``import_module('..mod', 'pkg.subpkg')`` importerar ``pkg.mod``).

source: The :func:`import_module` function acts as a simplifying wrapper around :func:`importlib.__import__`. This means all semantics of the function are derived from :func:`importlib.__import__`. The most important difference between these two functions is that :func:`import_module` returns the specified package or module (e.g. ``pkg.mod``), while :func:`__import__` returns the top-level package or module (e.g. ``pkg``).
sv: Funktionen :func:`import_module` fungerar som ett förenklande hölje runt :func:`importlib.__import__`. Detta innebär att all semantik i funktionen härleds från :func:`importlib.__import__`. Den viktigaste skillnaden mellan dessa två funktioner är att :func:`import_module` returnerar det angivna paketet eller modulen (t.ex. ``pkg.mod``), medan :func:`__import__` returnerar paketet eller modulen på högsta nivån (t.ex. ``pkg``).

source: If you are dynamically importing a module that was created since the interpreter began execution (e.g., created a Python source file), you may need to call :func:`invalidate_caches` in order for the new module to be noticed by the import system.
sv: Om du dynamiskt importerar en modul som skapats sedan tolken började exekvera (t.ex. skapade en Python-källfil), kan du behöva anropa :func:`invalidate_caches` för att den nya modulen ska uppmärksammas av importsystemet.

source: Parent packages are automatically imported.
sv: Föräldrapaket importeras automatiskt.

source: Invalidate the internal caches of finders stored at :data:`sys.meta_path`. If a finder implements ``invalidate_caches()`` then it will be called to perform the invalidation. This function should be called if any modules are created/installed while your program is running to guarantee all finders will notice the new module's existence.
sv: Invalidera de interna cacherna för sökare som lagras på :data:`sys.meta_path`. Om en sökare implementerar ``invalidate_caches()`` kommer den att anropas för att utföra invalideringen. Den här funktionen bör anropas om moduler skapas/installeras medan ditt program körs för att garantera att alla sökare märker att den nya modulen finns.

source: Namespace packages created/installed in a different :data:`sys.path` location after the same namespace was already imported are noticed.
sv: Namnrymdspaket som skapats/installerats på en annan :data:`sys.path`-plats efter att samma namnrymd redan importerats uppmärksammas.

source: Reload a previously imported *module*. The argument must be a module object, so it must have been successfully imported before. This is useful if you have edited the module source file using an external editor and want to try out the new version without leaving the Python interpreter. The return value is the module object (which can be different if re-importing causes a different object to be placed in :data:`sys.modules`).
sv: Laddar om en tidigare importerad *modul*. Argumentet måste vara ett modulobjekt, så det måste ha importerats tidigare. Detta är användbart om du har redigerat modulens källfil med en extern editor och vill prova den nya versionen utan att lämna Python-tolken. Returvärdet är modulobjektet (som kan vara annorlunda om en ny import gör att ett annat objekt placeras i :data:`sys.modules`).

source: When :func:`reload` is executed:
sv: När :func:`reload` utförs:

source: Python module's code is recompiled and the module-level code re-executed, defining a new set of objects which are bound to names in the module's dictionary by reusing the :term:`loader` which originally loaded the module. The ``init`` function of extension modules is not called a second time.
sv: Python-modulens kod kompileras om och koden på modulnivå exekveras på nytt, vilket definierar en ny uppsättning objekt som är bundna till namn i modulens ordbok genom att återanvända :term:`loader` som ursprungligen laddade modulen. Funktionen ``init`` för tilläggsmoduler anropas inte en andra gång.

source: As with all other objects in Python the old objects are only reclaimed after their reference counts drop to zero.
sv: Som med alla andra objekt i Python återkrävs de gamla objekten först när deras referensantal sjunkit till noll.

source: The names in the module namespace are updated to point to any new or changed objects.
sv: Namnen i modulens namnrymd uppdateras för att peka på alla nya eller ändrade objekt.

source: Other references to the old objects (such as names external to the module) are not rebound to refer to the new objects and must be updated in each namespace where they occur if that is desired.
sv: Andra referenser till de gamla objekten (t.ex. namn utanför modulen) är inte rebound för att referera till de nya objekten och måste uppdateras i varje namnrymd där de förekommer om så önskas.

source: There are a number of other caveats:
sv: Det finns ett antal andra förbehåll:

source: When a module is reloaded, its dictionary (containing the module's global variables) is retained. Redefinitions of names will override the old definitions, so this is generally not a problem. If the new version of a module does not define a name that was defined by the old version, the old definition remains. This feature can be used to the module's advantage if it maintains a global table or cache of objects --- with a :keyword:`try` statement it can test for the table's presence and skip its initialization if desired::
sv: När en modul laddas om behålls dess dictionary (som innehåller modulens globala variabler). Omdefinitioner av namn kommer att åsidosätta de gamla definitionerna, så detta är i allmänhet inget problem. Om den nya versionen av en modul inte definierar ett namn som definierades i den gamla versionen, kvarstår den gamla definitionen. Denna funktion kan användas till modulens fördel om den upprätthåller en global tabell eller cache av objekt --- med en :keyword:`try`-sats kan den testa om tabellen finns och hoppa över dess initialisering om så önskas::

source: try: cache except NameError: cache = {}
sv: försök: cache except NamnFel: cache = {}

source: It is generally not very useful to reload built-in or dynamically loaded modules. Reloading :mod:`sys`, :mod:`__main__`, :mod:`builtins` and other key modules is not recommended. In many cases extension modules are not designed to be initialized more than once, and may fail in arbitrary ways when reloaded.
sv: Det är i allmänhet inte särskilt användbart att ladda om inbyggda eller dynamiskt laddade moduler. Att ladda om :mod:`sys`, :mod:`__main__`, :mod:`builtins` och andra nyckelmoduler rekommenderas inte. I många fall är tilläggsmoduler inte utformade för att initieras mer än en gång, och kan misslyckas på godtyckliga sätt när de laddas om.

source: If a module imports objects from another module using :keyword:`from` ... :keyword:`import` ..., calling :func:`reload` for the other module does not redefine the objects imported from it --- one way around this is to re-execute the :keyword:`!from` statement, another is to use :keyword:`!import` and qualified names (*module.name*) instead.
sv: Om en modul importerar objekt från en annan modul med hjälp av :keyword:`from` ... :keyword:`import` ..., omdefinieras inte de objekt som importerats från den andra modulen genom att anropa :func:`reload` för den andra modulen --- ett sätt att komma runt detta är att utföra :keyword:`!from`-satsen igen, ett annat är att använda :keyword:`!import` och kvalificerade namn (*module.name*) istället.

source: If a module instantiates instances of a class, reloading the module that defines the class does not affect the method definitions of the instances --- they continue to use the old class definition. The same is true for derived classes.
sv: Om en modul instansierar instanser av en klass påverkas inte metoddefinitionerna för instanserna av att modulen som definierar klassen laddas om - de fortsätter att använda den gamla klassdefinitionen. Samma sak gäller för härledda klasser.

source: :exc:`ModuleNotFoundError` is raised when the module being reloaded lacks a :class:`~importlib.machinery.ModuleSpec`.
sv: :exc:`ModuleNotFoundError` uppstår när den modul som laddas om saknar en :class:`~importlib.machinery.ModuleSpec`.

source: This function is not thread-safe. Calling it from multiple threads can result in unexpected behavior. It's recommended to use the :class:`threading.Lock` or other synchronization primitives for thread-safe module reloading.
sv: Denna funktion är inte trådsäker. Om den anropas från flera trådar kan det leda till oväntat beteende. Vi rekommenderar att du använder :class:`threading.Lock` eller andra synkroniseringsprimitiver för trådsäker omladdning av moduler.

source: :mod:`importlib.abc` -- Abstract base classes related to import
sv: :mod:`importlib.abc` -- Abstrakta basklasser relaterade till import

source: **Source code:** :source:`Lib/importlib/abc.py`
sv: **Källkod:** :source:`Lib/importlib/abc.py`

source: The :mod:`importlib.abc` module contains all of the core abstract base classes used by :keyword:`import`. Some subclasses of the core abstract base classes are also provided to help in implementing the core ABCs.
sv: Modulen :mod:`importlib.abc` innehåller alla de centrala abstrakta basklasser som används av :keyword:`import`. Vissa subklasser av de centrala abstrakta basklasserna tillhandahålls också för att hjälpa till att implementera de centrala ABC.

source: ABC hierarchy::
sv: ABC-hierarkin::

source: object +-- MetaPathFinder +-- PathEntryFinder +-- Loader +-- ResourceLoader --------+ +-- InspectLoader | +-- ExecutionLoader --+ +-- FileLoader +-- SourceLoader
sv: objekt +-- MetaPathFinder +-- PathEntryFinder +-- Laddare +-- ResourceLoader --------+ +-- InspectLoader --+ InspectLoader +-- ExecutionLoader --+ +-- FileLoader +-- SourceLoader

source: An abstract base class representing a :term:`meta path finder`.
sv: En abstrakt basklass som representerar en :term:`meta path finder`.

source: No longer a subclass of :class:`!Finder`.
sv: Inte längre en underklass till :class:`!Finder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. If this is a top-level import, *path* will be ``None``. Otherwise, this is a search for a subpackage or module and *path* will be the value of :attr:`~module.__path__` from the parent package. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``MetaPathFinders``.
sv: En abstrakt metod för att hitta en :term:`spec <module spec>` för den angivna modulen. Om detta är en import på toppnivå kommer *path* att vara ``None``. Annars är detta en sökning efter ett underpaket eller en modul och *path* kommer att vara värdet på :attr:`~module.__path__` från det överordnade paketet. Om en specifikation inte kan hittas returneras ``None``. När ``target`` skickas in är det ett modulobjekt som sökaren kan använda för att göra en mer kvalificerad gissning om vilken specifikation som ska returneras. :func:`importlib.util.spec_from_loader` kan vara användbart för att implementera konkreta ``MetaPathFinders``.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :func:`importlib.invalidate_caches` when invalidating the caches of all finders on :data:`sys.meta_path`.
sv: En valfri metod som, när den anropas, ska ogiltigförklara alla interna cacheminnen som används av sökaren. Används av :func:`importlib.invalidate_caches` när cachen för alla sökare på :data:`sys.meta_path` ogiltigförklaras.

source: Returns ``None`` when called instead of :data:`NotImplemented`.
sv: Returnerar ``None`` när den anropas istället för :data:`NotImplemented`.

source: An abstract base class representing a :term:`path entry finder`. Though it bears some similarities to :class:`MetaPathFinder`, ``PathEntryFinder`` is meant for use only within the path-based import subsystem provided by :class:`importlib.machinery.PathFinder`.
sv: En abstrakt basklass som representerar en :term:`path entry finder`. Även om den har vissa likheter med :class:`MetaPathFinder`, är ``PathEntryFinder`` endast avsedd att användas inom det sökvägsbaserade importundersystem som tillhandahålls av :class:`importlib.machinery.PathFinder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. The finder will search for the module only within the :term:`path entry` to which it is assigned. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``PathEntryFinders``.
sv: En abstrakt metod för att hitta en :term:`spec <module spec>` för den angivna modulen. Sökaren kommer att söka efter modulen endast inom :term:`path entry` som den är tilldelad. Om en specifikation inte kan hittas returneras ``None``. När ``target`` skickas in är det ett modulobjekt som sökaren kan använda för att göra en mer kvalificerad gissning om vilken spec som ska returneras. :func:`importlib.util.spec_from_loader` kan vara användbar för att implementera konkreta ``PathEntryFinders``.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :meth:`importlib.machinery.PathFinder.invalidate_caches` when invalidating the caches of all cached finders.
sv: En valfri metod som, när den anropas, ska ogiltigförklara alla interna cacheminnen som används av sökaren. Används av :meth:`importlib.machinery.PathFinder.invalidate_caches` när cacheminnet för alla cachade sökare ogiltigförklaras.

source: An abstract base class for a :term:`loader`. See :pep:`302` for the exact definition for a loader.
sv: En abstrakt basklass för en :term:`laddare`. Se :pep:`302` för den exakta definitionen av en laddare.

source: Loaders that wish to support resource reading should implement a :meth:`get_resource_reader` method as specified by :class:`importlib.resources.abc.ResourceReader`.
sv: Laddare som vill stödja resursläsning bör implementera en :meth:`get_resource_reader`-metod som specificeras av :class:`importlib.resources.abc.ResourceReader`.

source: Introduced the optional :meth:`get_resource_reader` method.
sv: Införde den valfria metoden :meth:`get_resource_reader`.

source: A method that returns the module object to use when importing a module. This method may return ``None``, indicating that default module creation semantics should take place.
sv: En metod som returnerar det modulobjekt som ska användas vid import av en modul. Denna metod kan returnera ``None``, vilket indikerar att standard semantik för modulskapande ska användas.

source: This method is no longer optional when :meth:`exec_module` is defined.
sv: Denna metod är inte längre valfri när :meth:`exec_module` är definierad.

source: An abstract method that executes the module in its own namespace when a module is imported or reloaded. The module should already be initialized when :meth:`exec_module` is called. When this method exists, :meth:`create_module` must be defined.
sv: En abstrakt metod som exekverar modulen i dess eget namnområde när en modul importeras eller laddas om. Modulen bör redan vara initialiserad när :meth:`exec_module` anropas. När den här metoden finns måste :meth:`create_module` definieras.

source: :meth:`create_module` must also be defined.
sv: :meth:`create_module` måste också definieras.

source: A legacy method for loading a module. If the module cannot be loaded, :exc:`ImportError` is raised, otherwise the loaded module is returned.
sv: En äldre metod för att ladda en modul. Om modulen inte kan läsas in visas :exc:`ImportError`, annars returneras den inlästa modulen.

source: If the requested module already exists in :data:`sys.modules`, that module should be used and reloaded. Otherwise the loader should create a new module and insert it into :data:`sys.modules` before any loading begins, to prevent recursion from the import. If the loader inserted a module and the load fails, it must be removed by the loader from :data:`sys.modules`; modules already in :data:`sys.modules` before the loader began execution should be left alone.
sv: Om den begärda modulen redan finns i :data:`sys.modules`, bör den modulen användas och laddas om. I annat fall bör laddaren skapa en ny modul och infoga den i :data:`sys.modules` innan någon laddning påbörjas, för att förhindra rekursion från importen. Om laddaren har infogat en modul och laddningen misslyckas, måste laddaren ta bort den från :data:`sys.modules`; moduler som redan fanns i :data:`sys.modules` innan laddaren började exekvera bör lämnas ifred.

source: The loader should set several attributes on the module (note that some of these attributes can change when a module is reloaded):
sv: Laddaren ska ange flera attribut för modulen (observera att vissa av dessa attribut kan ändras när en modul laddas om):

source: :attr:`module.__name__`
sv: :attr:`modul.__name__`

source: :attr:`module.__file__`
sv: :attr:`modul.__fil__`` :attr:`modul.__fil__`

source: :attr:`module.__cached__` *(deprecated)*
sv: :attr:`modul.__cached__` *(föråldrad)*

source: :attr:`module.__path__`
sv: :attr:`modul.__path__`

source: :attr:`module.__package__` *(deprecated)*
sv: :attr:`modul.__package__` *(föråldrad)*

source: :attr:`module.__loader__` *(deprecated)*
sv: :attr:`modul.__loader__` *(föråldrad)*

source: When :meth:`exec_module` is available then backwards-compatible functionality is provided.
sv: När :meth:`exec_module` är tillgänglig tillhandahålls bakåtkompatibel funktionalitet.

source: Raise :exc:`ImportError` when called instead of :exc:`NotImplementedError`. Functionality provided when :meth:`exec_module` is available.
sv: Utlöser :exc:`ImportError` när den anropas istället för :exc:`NotImplementedError`. Funktionalitet som tillhandahålls när :meth:`exec_module` är tillgänglig.
