Repository: yeager/python-docs-sv
Catalog: library/importlib.po
Languages: sv

source: The recommended API for loading a module is :meth:`exec_module` (and :meth:`create_module`). Loaders should implement it instead of :meth:`load_module`. The import machinery takes care of all the other responsibilities of :meth:`load_module` when :meth:`exec_module` is implemented.
sv: Det rekommenderade API:et för att ladda en modul är :meth:`exec_module` (och :meth:`create_module`). Laddare bör implementera det istället för :meth:`load_module`. Importmaskineriet tar hand om alla andra ansvarsområden för :meth:`load_module` när :meth:`exec_module` är implementerat.

source: *Superseded by TraversableResources*
sv: *Ersatt av TraversableResources*

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loading arbitrary resources from the storage back-end.
sv: En abstrakt basklass för en :term:`loader` som implementerar det valfria :pep:`302`-protokollet för laddning av godtyckliga resurser från lagringsbackenden.

source: This ABC is deprecated in favour of supporting resource loading through :class:`importlib.resources.abc.TraversableResources`. This class exists for backwards compatibility only with other ABCs in this module.
sv: Denna ABC är föråldrad och ersätts av stöd för resursladdning via :class:`importlib.resources.abc.TraversableResources`. Denna klass finns endast för bakåtkompatibilitet med andra ABC:er i detta modul.

source: An abstract method to return the bytes for the data located at *path*. Loaders that have a file-like storage back-end that allows storing arbitrary data can implement this abstract method to give direct access to the data stored. :exc:`OSError` is to be raised if the *path* cannot be found. The *path* is expected to be constructed using a module's :attr:`~module.__file__` attribute or an item from a package's :attr:`~module.__path__`.
sv: En abstrakt metod för att returnera byte för data som finns på *path*. Laddare som har en filliknande lagringsbackend som tillåter lagring av godtyckliga data kan implementera denna abstrakta metod för att ge direkt tillgång till de data som lagras. :exc:`OSError` ska tas upp om *path* inte kan hittas. *Sökvägen* förväntas vara konstruerad med hjälp av en moduls attribut :attr:`~module.__file__` eller ett objekt från ett pakets :attr:`~module.__path__`.

source: Raises :exc:`OSError` instead of :exc:`NotImplementedError`.
sv: Utlöser :exc:`OSError` istället för :exc:`NotImplementedError`.

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loaders that inspect modules.
sv: En abstrakt basklass för en :term:`laddare` som implementerar det valfria :pep:`302`-protokollet för laddare som inspekterar moduler.

source: Return the code object for a module, or ``None`` if the module does not have a code object (as would be the case, for example, for a built-in module). Raise an :exc:`ImportError` if loader cannot find the requested module.
sv: Returnerar kodobjektet för en modul, eller ``None`` om modulen inte har något kodobjekt (vilket t.ex. skulle vara fallet för en inbyggd modul). Ger ett :exc:`ImportError` om laddaren inte kan hitta den begärda modulen.

source: While the method has a default implementation, it is suggested that it be overridden if possible for performance.
sv: Metoden har en standardimplementering, men det rekommenderas att den åsidosätts om det är möjligt av prestandaskäl.

source: No longer abstract and a concrete implementation is provided.
sv: Inte längre abstrakt och en konkret implementering tillhandahålls.

source: An abstract method to return the source of a module. It is returned as a text string using :term:`universal newlines`, translating all recognized line separators into ``'\n'`` characters. Returns ``None`` if no source is available (e.g. a built-in module). Raises :exc:`ImportError` if the loader cannot find the module specified.
sv: En abstrakt metod för att returnera källan till en modul. Den returneras som en textsträng med :term:`universal newlines`, som översätter alla erkända radavgränsare till ``'\n'``-tecken. Returnerar ``None`` om ingen källa är tillgänglig (t.ex. en inbyggd modul). Utlöser :exc:`ImportError` om laddaren inte kan hitta den angivna modulen.

source: Raises :exc:`ImportError` instead of :exc:`NotImplementedError`.
sv: Utlöser :exc:`ImportError` istället för :exc:`NotImplementedError`.

source: An optional method to return a true value if the module is a package, a false value otherwise. :exc:`ImportError` is raised if the :term:`loader` cannot find the module.
sv: En valfri metod som returnerar ett sant värde om modulen är ett paket, annars ett falskt värde. :exc:`ImportError` uppstår om :term:`loader` inte kan hitta modulen.

source: Create a code object from Python source.
sv: Skapa ett kodobjekt från Python-källan.

source: The *data* argument can be whatever the :func:`compile` function supports (i.e. string or bytes). The *path* argument should be the "path" to where the source code originated from, which can be an abstract concept (e.g. location in a zip file).
sv: Argumentet *data* kan vara vad som helst som :func:`compile`-funktionen stöder (t.ex. sträng eller byte). Argumentet *path* bör vara "sökvägen" till den plats där källkoden kommer ifrån, vilket kan vara ett abstrakt koncept (t.ex. plats i en zip-fil).

source: With the subsequent code object one can execute it in a module by running ``exec(code, module.__dict__)``.
sv: Med det efterföljande kodobjektet kan man exekvera det i en modul genom att köra ``exec(code, module.__dict__)``.

source: Made the method static.
sv: Gjorde metoden statisk.

source: Implementation of :meth:`Loader.exec_module`.
sv: Implementering av :meth:`Loader.exec_module`.

source: Implementation of :meth:`Loader.load_module`.
sv: Implementering av :meth:`Loader.load_module`.

source: use :meth:`exec_module` instead.
sv: använd :meth:`exec_module` istället.

source: An abstract base class which inherits from :class:`InspectLoader` that, when implemented, helps a module to be executed as a script. The ABC represents an optional :pep:`302` protocol.
sv: En abstrakt basklass som ärver från :class:`InspectLoader` som, när den implementeras, hjälper en modul att exekveras som ett skript. ABC representerar ett valfritt :pep:`302` protokoll.

source: An abstract method that is to return the value of :attr:`~module.__file__` for the specified module. If no path is available, :exc:`ImportError` is raised.
sv: En abstrakt metod som returnerar värdet av :attr:`~module.__file__` för den angivna modulen. Om ingen sökväg är tillgänglig, :exc:`ImportError`.

source: If source code is available, then the method should return the path to the source file, regardless of whether a bytecode was used to load the module.
sv: Om källkod finns tillgänglig ska metoden returnera sökvägen till källfilen, oavsett om en bytecode användes för att ladda modulen.

source: An abstract base class which inherits from :class:`ResourceLoader` and :class:`ExecutionLoader`, providing concrete implementations of :meth:`ResourceLoader.get_data` and :meth:`ExecutionLoader.get_filename`.
sv: En abstrakt basklass som ärver från :class:`ResourceLoader` och :class:`ExecutionLoader` och ger konkreta implementationer av :meth:`ResourceLoader.get_data` och :meth:`ExecutionLoader.get_filename`.

source: The *fullname* argument is a fully resolved name of the module the loader is to handle. The *path* argument is the path to the file for the module.
sv: Argumentet *fullname* är ett fullständigt upplöst namn på den modul som laddaren ska hantera. Argumentet *path* är sökvägen till filen för modulen.

source: The name of the module the loader can handle.
sv: Namnet på den modul som laddaren kan hantera.

source: Path to the file of the module.
sv: Sökväg till filen för modulen.

source: Calls super's ``load_module()``.
sv: Anropar super's ``load_module()``.

source: Use :meth:`Loader.exec_module` instead.
sv: Använd :meth:`Loader.exec_module` istället.

source: Returns :attr:`path`.
sv: Returnerar :attr:`path`.

source: Reads *path* as a binary file and returns the bytes from it.
sv: Läser *sökväg* som en binär fil och returnerar byte från den.

source: An abstract base class for implementing source (and optionally bytecode) file loading. The class inherits from both :class:`ResourceLoader` and :class:`ExecutionLoader`, requiring the implementation of:
sv: En abstrakt basklass för att implementera laddning av källfiler (och eventuellt bytekoder). Klassen ärver från både :class:`ResourceLoader` och :class:`ExecutionLoader`, och kräver implementering av:

source: Should only return the path to the source file; sourceless loading is not supported.
sv: Ska endast returnera sökvägen till källfilen; laddning utan källa stöds inte.

source: The abstract methods defined by this class are to add optional bytecode file support. Not implementing these optional methods (or causing them to raise :exc:`NotImplementedError`) causes the loader to only work with source code. Implementing the methods allows the loader to work with source *and* bytecode files; it does not allow for *sourceless* loading where only bytecode is provided. Bytecode files are an optimization to speed up loading by removing the parsing step of Python's compiler, and so no bytecode-specific API is exposed.
sv: De abstrakta metoder som definieras av denna klass är till för att lägga till valfritt stöd för bytecode-filer. Om dessa valfria metoder inte implementeras (eller om de ger upphov till :exc:`NotImplementedError`) fungerar laddaren endast med källkod. Genom att implementera metoderna kan laddaren arbeta med källkods- *och* bytecode-filer; det tillåter inte *källkodslös* laddning där endast bytecode tillhandahålls. Bytecode-filer är en optimering för att påskynda laddningen genom att ta bort parsningssteget i Pythons kompilator, och därför exponeras inget bytecode-specifikt API.

source: Optional abstract method which returns a :class:`dict` containing metadata about the specified path. Supported dictionary keys are:
sv: Valfri abstrakt metod som returnerar en :class:`dict` som innehåller metadata om den angivna sökvägen. Nycklar i ordlistan som stöds är:

source: ``'mtime'`` (mandatory): an integer or floating-point number representing the modification time of the source code;
sv: ``'mtime'`` (mandatory): ett heltal eller flyttal som anger modifieringstiden för källkoden;

source: ``'size'`` (optional): the size in bytes of the source code.
sv: ``'size'`` (valfritt): storleken i bytes på källkoden.

source: Any other keys in the dictionary are ignored, to allow for future extensions. If the path cannot be handled, :exc:`OSError` is raised.
sv: Alla andra nycklar i ordlistan ignoreras för att möjliggöra framtida tillägg. Om sökvägen inte kan hanteras genereras :exc:`OSError`.

source: Raise :exc:`OSError` instead of :exc:`NotImplementedError`.
sv: Utlös :exc:`OSError` istället för :exc:`NotImplementedError`.

source: Optional abstract method which returns the modification time for the specified path.
sv: Valfri abstrakt metod som returnerar modifieringstiden för den angivna sökvägen.

source: This method is deprecated in favour of :meth:`path_stats`. You don't have to implement it, but it is still available for compatibility purposes. Raise :exc:`OSError` if the path cannot be handled.
sv: Den här metoden är utfasad till förmån för :meth:`path_stats`. Du behöver inte implementera den, men den är fortfarande tillgänglig för kompatibilitetsändamål. Utlöser :exc:`OSError` om sökvägen inte kan hanteras.

source: Optional abstract method which writes the specified bytes to a file path. Any intermediate directories which do not exist are to be created automatically.
sv: Valfri abstrakt metod som skriver de angivna bytena till en filsökväg. Eventuella mellanliggande kataloger som inte finns ska skapas automatiskt.

source: When writing to the path fails because the path is read-only (:const:`errno.EACCES`/:exc:`PermissionError`), do not propagate the exception.
sv: Om det inte går att skriva till sökvägen eftersom sökvägen är skrivskyddad (:const:`errno.EACCES`/:exc:`PermissionError`), ska undantaget inte spridas.

source: No longer raises :exc:`NotImplementedError` when called.
sv: Ger inte längre upphov till :exc:`NotImplementedError` när den anropas.

source: Concrete implementation of :meth:`InspectLoader.get_code`.
sv: Konkret implementation av :meth:`InspectLoader.get_code`.

source: Concrete implementation of :meth:`Loader.exec_module`.
sv: Konkret implementering av :meth:`Loader.exec_module`.

source: Concrete implementation of :meth:`Loader.load_module`.
sv: Konkret implementation av :meth:`Loader.load_module`.

source: Use :meth:`exec_module` instead.
sv: Använd :meth:`exec_module` istället.

source: Concrete implementation of :meth:`InspectLoader.get_source`.
sv: Konkret implementation av :meth:`InspectLoader.get_source`.

source: Concrete implementation of :meth:`InspectLoader.is_package`. A module is determined to be a package if its file path (as provided by :meth:`ExecutionLoader.get_filename`) is a file named ``__init__`` when the file extension is removed **and** the module name itself does not end in ``__init__``.
sv: Konkret implementation av :meth:`InspectLoader.is_package`. En modul anses vara ett paket om dess filsökväg (som tillhandahålls av :meth:`ExecutionLoader.get_filename`) är en fil med namnet ``__init__`` när filtillägget är borttaget **och** modulnamnet i sig inte slutar på ``__init__``.

source: An :term:`abstract base class` to provide the ability to read *resources*.
sv: En :term:`abstrakt basklass` för att ge möjlighet att läsa *resurser*.

source: From the perspective of this ABC, a *resource* is a binary artifact that is shipped within a package. Typically this is something like a data file that lives next to the ``__init__.py`` file of the package. The purpose of this class is to help abstract out the accessing of such data files so that it does not matter if the package and its data file(s) are stored e.g. in a zip file versus on the file system.
sv: I det här ABC:s perspektiv är en *resurs* en binär artefakt som levereras i ett paket. Vanligtvis är detta något som en datafil som lever bredvid paketets ``__init__.py``-fil. Syftet med den här klassen är att hjälpa till att abstrahera åtkomsten till sådana datafiler så att det inte spelar någon roll om paketet och dess datafil(er) lagras t.ex. i en zip-fil eller i filsystemet.

source: For any of methods of this class, a *resource* argument is expected to be a :term:`path-like object` which represents conceptually just a file name. This means that no subdirectory paths should be included in the *resource* argument. This is because the location of the package the reader is for, acts as the "directory". Hence the metaphor for directories and file names is packages and resources, respectively. This is also why instances of this class are expected to directly correlate to a specific package (instead of potentially representing multiple packages or a module).
sv: För alla metoder i denna klass förväntas ett *resource*-argument vara ett :term:`sökvägsliknande objekt` som konceptuellt bara representerar ett filnamn. Detta innebär att inga sökvägar till underkataloger bör inkluderas i *resource*-argumentet. Detta beror på att platsen för det paket som läsaren är avsedd för fungerar som "katalog". Därför är metaforen för kataloger och filnamn paket respektive resurser. Det är också därför som instanser av denna klass förväntas vara direkt korrelerade till ett specifikt paket (i stället för att potentiellt representera flera paket eller en modul).

source: Loaders that wish to support resource reading are expected to provide a method called ``get_resource_reader(fullname)`` which returns an object implementing this ABC's interface. If the module specified by fullname is not a package, this method should return :const:`None`. An object compatible with this ABC should only be returned when the specified module is a package.
sv: Laddare som vill stödja resursläsning förväntas tillhandahålla en metod som heter ``get_resource_reader(fullname)`` som returnerar ett objekt som implementerar detta ABC-gränssnitt. Om den modul som anges av fullname inte är ett paket, bör denna metod returnera :const:`None`. Ett objekt som är kompatibelt med denna ABC bör endast returneras när den angivna modulen är ett paket.

source: Use :class:`importlib.resources.abc.TraversableResources` instead.
sv: Använd :class:`importlib.resources.abc.TraversableResources` istället.

source: Returns an opened, :term:`file-like object` for binary reading of the *resource*.
sv: Returnerar ett öppnat, :term:`filliknande objekt` för binär läsning av *resursen*.

source: If the resource cannot be found, :exc:`FileNotFoundError` is raised.
sv: Om resursen inte kan hittas genereras :exc:`FileNotFoundError`.

source: Returns the file system path to the *resource*.
sv: Returnerar filsystemets sökväg till *resursen*.

source: If the resource does not concretely exist on the file system, raise :exc:`FileNotFoundError`.
sv: Om resursen inte finns i filsystemet, uppstår :exc:`FileNotFoundError`.

source: Returns ``True`` if the named *name* is considered a resource. :exc:`FileNotFoundError` is raised if *name* does not exist.
sv: Returnerar ``True`` om namnet *name* anses vara en resurs. :exc:`FileNotFoundError` uppstår om *name* inte finns.

source: Returns an :term:`iterable` of strings over the contents of the package. Do note that it is not required that all names returned by the iterator be actual resources, e.g. it is acceptable to return names for which :meth:`is_resource` would be false.
sv: Returnerar en :term:`iterable` av strängar över innehållet i paketet. Observera att det inte är nödvändigt att alla namn som returneras av iteratorn är faktiska resurser, t.ex. är det acceptabelt att returnera namn för vilka :meth:`is_resource` skulle vara false.

source: Allowing non-resource names to be returned is to allow for situations where how a package and its resources are stored are known a priori and the non-resource names would be useful. For instance, returning subdirectory names is allowed so that when it is known that the package and resources are stored on the file system then those subdirectory names can be used directly.
sv: Att tillåta att icke-resursnamn returneras är för att möjliggöra situationer där det på förhand är känt hur ett paket och dess resurser lagras och icke-resursnamnen skulle vara användbara. Det är t.ex. tillåtet att returnera namn på underkataloger så att dessa namn på underkataloger kan användas direkt när det är känt att paketet och resurserna lagras i filsystemet.

source: The abstract method returns an iterable of no items.
sv: Den abstrakta metoden returnerar en iterabel utan objekt.

source: An object with a subset of :class:`pathlib.Path` methods suitable for traversing directories and opening files.
sv: Ett objekt med en delmängd av :class:`pathlib.Path`-metoder som lämpar sig för genomgång av kataloger och öppning av filer.

source: For a representation of the object on the file-system, use :meth:`importlib.resources.as_file`.
sv: För en representation av objektet i filsystemet, använd :meth:`importlib.resources.as_file`.

source: Use :class:`importlib.resources.abc.Traversable` instead.
sv: Använd :class:`importlib.resources.abc.Traversable` istället.

source: Abstract. The base name of this object without any parent references.
sv: Abstrakt. Basnamnet för detta objekt utan några överordnade referenser.

source: Yield ``Traversable`` objects in ``self``.
sv: Avkastar ``Traversable``-objekt i ``self``.

source: Return ``True`` if ``self`` is a directory.
sv: Returnerar ``True`` om ``self`` är en katalog.

source: Return ``True`` if ``self`` is a file.
sv: Returnerar ``True`` om ``self`` är en fil.

source: Return Traversable child in ``self``.
sv: Returnera Traversibelt barn i ``self``.

source: Return ``Traversable`` child in ``self``.
sv: Returnera ``Traversable`` barn i ``self``.

source: *mode* may be 'r' or 'rb' to open as text or binary. Return a handle suitable for reading (same as :attr:`pathlib.Path.open`).
sv: *mode* kan vara 'r' eller 'rb' för att öppna som text eller binär. Returnerar ett handtag som är lämpligt för läsning (samma som :attr:`pathlib.Path.open`).

source: When opening as text, accepts encoding parameters such as those accepted by :class:`io.TextIOWrapper`.
sv: När den öppnas som text accepteras kodningsparametrar som de som accepteras av :class:`io.TextIOWrapper`.

source: Read contents of ``self`` as bytes.
sv: Läs innehållet i ``själv`` som bytes.

source: Read contents of ``self`` as text.
sv: Läs innehållet i ``själv`` som text.

source: An abstract base class for resource readers capable of serving the :meth:`importlib.resources.files` interface. Subclasses :class:`importlib.resources.abc.ResourceReader` and provides concrete implementations of the :class:`importlib.resources.abc.ResourceReader`'s abstract methods. Therefore, any loader supplying :class:`importlib.abc.TraversableResources` also supplies ResourceReader.
sv: En abstrakt basklass för resursläsare som kan hantera :meth:`importlib.resources.files`-gränssnittet. Underklassar :class:`importlib.resources.abc.ResourceReader` och tillhandahåller konkreta implementationer av :class:`importlib.resources.abc.ResourceReader`s abstrakta metoder. Därför tillhandahåller alla laddare som tillhandahåller :class:`importlib.abc.TraversableResources` också ResourceReader.

source: Loaders that wish to support resource reading are expected to implement this interface.
sv: Laddare som vill stödja resursläsning förväntas implementera detta gränssnitt.

source: Returns a :class:`importlib.resources.abc.Traversable` object for the loaded package.
sv: Returnerar ett :class:`importlib.resources.abc.Traversable`-objekt för det laddade paketet.

source: :mod:`importlib.machinery` -- Importers and path hooks
sv: :mod:`importlib.machinery` -- Importörer och sökvägs-hooks

source: **Source code:** :source:`Lib/importlib/machinery.py`
sv: **Källkod:** :source:`Lib/importlib/machinery.py`

source: This module contains the various objects that help :keyword:`import` find and load modules.
sv: Denna modul innehåller de olika objekt som hjälper :keyword:`import` att hitta och ladda moduler.

source: A list of strings representing the recognized file suffixes for source modules.
sv: En lista med strängar som representerar de identifierade filsuffixen för källmoduler.

source: A list of strings representing the file suffixes for non-optimized bytecode modules.
sv: En lista med strängar som representerar filsuffixen för icke-optimerade bytekodsmoduler.

source: Use :const:`BYTECODE_SUFFIXES` instead.
sv: Använd :const:`BYTECODE_SUFFIXES` istället.

source: A list of strings representing the file suffixes for optimized bytecode modules.
sv: En lista med strängar som representerar filsuffixen för optimerade bytecode-moduler.

source: A list of strings representing the recognized file suffixes for bytecode modules (including the leading dot).
sv: En lista med strängar som representerar de erkända filsuffixen för bytecode-moduler (inklusive den inledande punkten).

source: The value is no longer dependent on ``__debug__``.
sv: Värdet är inte längre beroende av ``__debug__``.

source: A list of strings representing the recognized file suffixes for extension modules.
sv: En lista med strängar som representerar de identifierade filsuffixen för tilläggsmoduler.
