Repository: yeager/python-docs-sv
Catalog: library/importlib.po
Languages: sv

source: Returns a combined list of strings representing all file suffixes for modules recognized by the standard import machinery. This is a helper for code which simply needs to know if a filesystem path potentially refers to a module without needing any details on the kind of module (for example, :func:`inspect.getmodulename`).
sv: Returnerar en kombinerad lista med strängar som representerar alla filsuffix för moduler som känns igen av standardimportmaskineriet. Detta är ett hjälpmedel för kod som helt enkelt behöver veta om en filsystemssökväg potentiellt hänvisar till en modul utan att behöva några detaljer om typen av modul (till exempel :func:`inspect.getmodulename`).

source: An :term:`importer` for built-in modules. All known built-in modules are listed in :data:`sys.builtin_module_names`. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
sv: En :term:`importör` för inbyggda moduler. Alla kända inbyggda moduler finns listade i :data:`sys.builtin_module_names`. Den här klassen implementerar ABC:erna :class:`importlib.abc.MetaPathFinder` och :class:`importlib.abc.InspectLoader`.

source: Only class methods are defined by this class to alleviate the need for instantiation.
sv: Endast klassens metoder definieras av denna klass för att minska behovet av instansiering.

source: As part of :pep:`489`, the builtin importer now implements :meth:`Loader.create_module` and :meth:`Loader.exec_module`
sv: Som en del av :pep:`489` implementerar den inbyggda importören nu :meth:`Loader.create_module` och :meth:`Loader.exec_module`

source: An :term:`importer` for frozen modules. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
sv: En :term:`importör` för frysta moduler. Denna klass implementerar ABC:erna :class:`importlib.abc.MetaPathFinder` och :class:`importlib.abc.InspectLoader`.

source: Gained :meth:`~Loader.create_module` and :meth:`~Loader.exec_module` methods.
sv: Fått metoderna :meth:`~Loader.create_module` och :meth:`~Loader.exec_module`.

source: :term:`Finder <finder>` for modules declared in the Windows registry. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
sv: :term:`Finder <finder>` för moduler som deklareras i Windows-registret. Den här klassen implementerar :class:`importlib.abc.MetaPathFinder` ABC.

source: Use :mod:`site` configuration instead. Future versions of Python may not enable this finder by default.
sv: Använd :mod:`site`-konfigurationen istället. Framtida versioner av Python kanske inte aktiverar den här sökaren som standard.

source: A :term:`Finder <finder>` for :data:`sys.path` and package ``__path__`` attributes. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
sv: En :term:`Finder <finder>` för :data:`sys.path` och paketets ``__path__`` attribut. Den här klassen implementerar :class:`importlib.abc.MetaPathFinder` ABC.

source: Class method that attempts to find a :term:`spec <module spec>` for the module specified by *fullname* on :data:`sys.path` or, if defined, on *path*. For each path entry that is searched, :data:`sys.path_importer_cache` is checked. If a non-false object is found then it is used as the :term:`path entry finder` to look for the module being searched for. If no entry is found in :data:`sys.path_importer_cache`, then :data:`sys.path_hooks` is searched for a finder for the path entry and, if found, is stored in :data:`sys.path_importer_cache` along with being queried about the module. If no finder is ever found then ``None`` is both stored in the cache and returned.
sv: Klassmetod som försöker hitta en :term:`spec <module spec>` för den modul som anges av *fullname* på :data:`sys.path` eller, om definierad, på *path*. För varje sökvägspost som genomsöks kontrolleras :data:`sys.path_importer_cache`. Om ett icke-falskt objekt hittas används det som :term:`path entry finder` för att leta efter den modul som söks. Om ingen post hittas i :data:`sys.path_importer_cache`, söks i :data:`sys.path_hooks` efter en sökare för sökvägsposten och, om den hittas, lagras den i :data:`sys.path_importer_cache` tillsammans med en fråga om modulen. Om ingen sökare någonsin hittas lagras ``None`` i cachen och returneras.

source: If the current working directory -- represented by an empty string -- is no longer valid then ``None`` is returned but no value is cached in :data:`sys.path_importer_cache`.
sv: Om den aktuella arbetskatalogen - representerad av en tom sträng - inte längre är giltig returneras ``None`` men inget värde cachas i :data:`sys.path_importer_cache`.

source: Calls :meth:`importlib.abc.PathEntryFinder.invalidate_caches` on all finders stored in :data:`sys.path_importer_cache` that define the method. Otherwise entries in :data:`sys.path_importer_cache` set to ``None`` are deleted.
sv: Anropar :meth:`importlib.abc.PathEntryFinder.invalidate_caches` på alla sökare som lagras i :data:`sys.path_importer_cache` som definierar metoden. Annars raderas poster i :data:`sys.path_importer_cache` som är inställda på ``None``.

source: Entries of ``None`` in :data:`sys.path_importer_cache` are deleted.
sv: Poster med ``None`` i :data:`sys.path_importer_cache` tas bort.

source: Calls objects in :data:`sys.path_hooks` with the current working directory for ``''`` (i.e. the empty string).
sv: Anropar objekt i :data:`sys.path_hooks` med den aktuella arbetskatalogen för ``''`` (d.v.s. den tomma strängen).

source: A concrete implementation of :class:`importlib.abc.PathEntryFinder` which caches results from the file system.
sv: En konkret implementation av :class:`importlib.abc.PathEntryFinder` som cachar resultat från filsystemet.

source: The *path* argument is the directory for which the finder is in charge of searching.
sv: Argumentet *path* är den katalog som sökaren ska söka i.

source: The *loader_details* argument is a variable number of 2-item tuples each containing a loader and a sequence of file suffixes the loader recognizes. The loaders are expected to be callables which accept two arguments of the module's name and the path to the file found.
sv: Argumentet *loader_details* är ett variabelt antal tuples med två objekt som var och en innehåller en laddare och en sekvens av filsuffix som laddaren känner igen. Laddarna förväntas vara callables som accepterar två argument, modulens namn och sökvägen till den fil som hittas.

source: The finder will cache the directory contents as necessary, making stat calls for each module search to verify the cache is not outdated. Because cache staleness relies upon the granularity of the operating system's state information of the file system, there is a potential race condition of searching for a module, creating a new file, and then searching for the module the new file represents. If the operations happen fast enough to fit within the granularity of stat calls, then the module search will fail. To prevent this from happening, when you create a module dynamically, make sure to call :func:`importlib.invalidate_caches`.
sv: Sökaren cachelagrar kataloginnehållet efter behov och gör stat-anrop för varje modulsökning för att kontrollera att cacheminnet inte är föråldrat. Eftersom cache-stalkeness är beroende av granulariteten i operativsystemets statusinformation om filsystemet, finns det ett potentiellt tävlingsförhållande där man söker efter en modul, skapar en ny fil och sedan söker efter den modul som den nya filen representerar. Om operationerna sker tillräckligt snabbt för att rymmas inom granulariteten för stat-anrop, kommer modulsökningen att misslyckas. För att förhindra att detta händer, när du skapar en modul dynamiskt, se till att anropa :func:`importlib.invalidate_caches`.

source: The path the finder will search in.
sv: Den väg som sökaren kommer att söka i.

source: Attempt to find the spec to handle *fullname* within :attr:`path`.
sv: Försök att hitta specifikationen för att hantera *fullname* inom :attr:`path`.

source: Clear out the internal cache.
sv: Rensa ut den interna cachen.

source: A class method which returns a closure for use on :data:`sys.path_hooks`. An instance of :class:`FileFinder` is returned by the closure using the path argument given to the closure directly and *loader_details* indirectly.
sv: En klassmetod som returnerar en closure för användning på :data:`sys.path_hooks`. En instans av :class:`FileFinder` returneras av stängningen med hjälp av sökvägsargumentet som ges till stängningen direkt och *loader_details* indirekt.

source: If the argument to the closure is not an existing directory, :exc:`ImportError` is raised.
sv: Om argumentet till stängningen inte är en befintlig katalog kommer :exc:`ImportError` att tas upp.

source: A concrete implementation of :class:`importlib.abc.SourceLoader` by subclassing :class:`importlib.abc.FileLoader` and providing some concrete implementations of other methods.
sv: En konkret implementation av :class:`importlib.abc.SourceLoader` genom att underklassa :class:`importlib.abc.FileLoader` och tillhandahålla några konkreta implementationer av andra metoder.

source: The name of the module that this loader will handle.
sv: Namnet på den modul som den här laddaren ska hantera.

source: The path to the source file.
sv: Sökvägen till källfilen.

source: Return ``True`` if :attr:`path` appears to be for a package.
sv: Returnerar ``True`` om :attr:`path` verkar vara för ett paket.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.path_stats`.
sv: Konkret implementering av :meth:`importlib.abc.SourceLoader.path_stats`.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.set_data`.
sv: Konkret implementation av :meth:`importlib.abc.SourceLoader.set_data`.

source: Concrete implementation of :meth:`importlib.abc.Loader.load_module` where specifying the name of the module to load is optional.
sv: Konkret implementation av :meth:`importlib.abc.Loader.load_module` där det är valfritt att ange namnet på den modul som ska laddas.

source: Use :meth:`importlib.abc.Loader.exec_module` instead.
sv: Använd :meth:`importlib.abc.Loader.exec_module` istället.

source: A concrete implementation of :class:`importlib.abc.FileLoader` which can import bytecode files (i.e. no source code files exist).
sv: En konkret implementation av :class:`importlib.abc.FileLoader` som kan importera bytecode-filer (dvs. inga källkodsfiler existerar).

source: Please note that direct use of bytecode files (and thus not source code files) inhibits your modules from being usable by all Python implementations or new versions of Python which change the bytecode format.
sv: Observera att direkt användning av bytecode-filer (och därmed inte källkodsfiler) hindrar dina moduler från att kunna användas av alla Python-implementationer eller nya versioner av Python som ändrar bytecode-formatet.

source: The name of the module the loader will handle.
sv: Namnet på den modul som laddaren ska hantera.

source: The path to the bytecode file.
sv: Sökvägen till bytekodfilen.

source: Determines if the module is a package based on :attr:`path`.
sv: Avgör om modulen är ett paket baserat på :attr:`path`.

source: Returns the code object for :attr:`name` created from :attr:`path`.
sv: Returnerar kodobjektet för :attr:`name` som skapats från :attr:`path`.

source: Returns ``None`` as bytecode files have no source when this loader is used.
sv: Returnerar ``None`` eftersom bytecode-filer inte har någon källa när denna laddare används.

source: A concrete implementation of :class:`importlib.abc.ExecutionLoader` for extension modules.
sv: En konkret implementation av :class:`importlib.abc.ExecutionLoader` för tilläggsmoduler.

source: The *fullname* argument specifies the name of the module the loader is to support. The *path* argument is the path to the extension module's file.
sv: Argumentet *fullname* anger namnet på den modul som laddaren ska stödja. Argumentet *path* är sökvägen till filen för tilläggsmodulen.

source: Note that, by default, importing an extension module will fail in subinterpreters if it doesn't implement multi-phase init (see :pep:`489`), even if it would otherwise import successfully.
sv: Observera att import av en tilläggsmodul som standard kommer att misslyckas i undertolkar om den inte implementerar flerfasig init (se :pep:`489`), även om den annars skulle importeras framgångsrikt.

source: Multi-phase init is now required for use in subinterpreters.
sv: Flerfasig init krävs nu för användning i undertolkar.

source: Name of the module the loader supports.
sv: Namnet på den modul som laddaren stöder.

source: Path to the extension module.
sv: Sökväg till tilläggsmodulen.

source: Creates the module object from the given specification in accordance with :pep:`489`.
sv: Skapar modulobjektet från den givna specifikationen i enlighet med :pep:`489`.

source: Initializes the given module object in accordance with :pep:`489`.
sv: Initialiserar det givna modulobjektet i enlighet med :pep:`489`.

source: Returns ``True`` if the file path points to a package's ``__init__`` module based on :const:`EXTENSION_SUFFIXES`.
sv: Returnerar ``True`` om filsökvägen pekar på ett pakets ``__init__``-modul baserat på :const:`EXTENSION_SUFFIXES`.

source: Returns ``None`` as extension modules lack a code object.
sv: Returnerar ``None`` eftersom tilläggsmoduler saknar ett kodobjekt.

source: Returns ``None`` as extension modules do not have source code.
sv: Returnerar ``None`` eftersom tilläggsmoduler inte har någon källkod.

source: A concrete implementation of :class:`importlib.abc.InspectLoader` for namespace packages. This is an alias for a private class and is only made public for introspecting the ``__loader__`` attribute on namespace packages::
sv: En konkret implementation av :class:`importlib.abc.InspectLoader` för namespace-paket. Detta är ett alias för en privat klass och görs endast offentlig för introspektion av ``__loader__``-attributet på namespace-paket::

source: A specification for a module's import-system-related state. This is typically exposed as the module's :attr:`~module.__spec__` attribute. Many of these attributes are also available directly on a module: for example, ``module.__spec__.origin == module.__file__``. Note, however, that while the *values* are usually equivalent, they can differ since there is no synchronization between the two objects. For example, it is possible to update the module's :attr:`~module.__file__` at runtime and this will not be automatically reflected in the module's :attr:`__spec__.origin <ModuleSpec.origin>`, and vice versa.
sv: En specifikation för en moduls importsystemrelaterade tillstånd. Detta exponeras vanligtvis som modulens attribut :attr:`~module.__spec__`. Många av dessa attribut är också tillgängliga direkt på en modul: till exempel, ``module.__spec__.origin == module.__file__``. Observera dock att även om *värdena* vanligtvis är likvärdiga kan de skilja sig åt eftersom det inte finns någon synkronisering mellan de två objekten. Det är t.ex. möjligt att uppdatera modulens :attr:`~module.__file__` vid körning, men detta återspeglas inte automatiskt i modulens :attr:`__spec__.origin <ModuleSpec.origin>`, och vice versa.

source: The module's fully qualified name (see :attr:`module.__name__`). The :term:`finder` should always set this attribute to a non-empty string.
sv: Modulens fullständigt kvalificerade namn (se :attr:`module.__name__`). Termen :term:`finder` bör alltid sätta detta attribut till en icke-tom sträng.

source: The :term:`loader` used to load the module (see :attr:`module.__loader__`). The :term:`finder` should always set this attribute.
sv: Den :term:`loader` som används för att ladda modulen (se :attr:`module.__loader__`). Attributet bör alltid anges av :term:`finder`.

source: The location the :term:`loader` should use to load the module (see :attr:`module.__file__`). For example, for modules loaded from a ``.py`` file this is the filename. The :term:`finder` should always set this attribute to a meaningful value for the :term:`loader` to use. In the uncommon case that there is not one (like for namespace packages), it should be set to ``None``.
sv: Den plats som :term:`loader` ska använda för att ladda modulen (se :attr:`module.__file__`). För moduler som laddas från en ``.py``-fil är detta till exempel filnamnet. :term:`finder` bör alltid sätta detta attribut till ett meningsfullt värde som :term:`loader` kan använda. I det ovanliga fallet att det inte finns något sådant (som för namnrymdspaket), bör det sättas till ``None``.

source: A (possibly empty) :term:`sequence` of strings enumerating the locations in which a package's submodules will be found (see :attr:`module.__path__`). Most of the time there will only be a single directory in this list.
sv: En (eventuellt tom) :term:`sekvens` av strängar som räknar upp de platser där ett pakets undermoduler kommer att hittas (se :attr:`module.__path__`). För det mesta kommer det bara att finnas en enda katalog i den här listan.

source: The :term:`finder` should set this attribute to a sequence, even an empty one, to indicate to the import system that the module is a package. It should be set to ``None`` for non-package modules. It is set automatically later to a special object for namespace packages.
sv: :term:`finder` bör sätta detta attribut till en sekvens, även en tom sådan, för att ange för importsystemet att modulen är ett paket. Det bör sättas till ``None`` för icke-paketmoduler. Det sätts automatiskt senare till ett speciellt objekt för namnrymdspaket.

source: The :term:`finder` may set this attribute to an object containing additional, module-specific data to use when loading the module. Otherwise it should be set to ``None``.
sv: :term:`finder` kan sätta detta attribut till ett objekt som innehåller ytterligare modulspecifika data att använda vid laddning av modulen. Annars bör det sättas till ``None``.

source: The filename of a compiled version of the module's code (see :attr:`module.__cached__`). The :term:`finder` should always set this attribute but it may be ``None`` for modules that do not need compiled code stored.
sv: Filnamnet för en kompilerad version av modulens kod (se :attr:`module.__cached__`). Attributet bör alltid anges av :term:`finder` men kan vara ``None`` för moduler som inte behöver lagra kompilerad kod.

source: (Read-only) The fully qualified name of the package the module is in (or the empty string for a top-level module). See :attr:`module.__package__`. If the module is a package then this is the same as :attr:`name`.
sv: (Skrivskyddad) Det fullständigt kvalificerade namnet på det paket som modulen finns i (eller den tomma strängen för en modul på högsta nivån). Se :attr:`module.__package__`. Om modulen är ett paket är detta samma sak som :attr:`name`.

source: ``True`` if the spec's :attr:`origin` refers to a loadable location, ``False`` otherwise. This value impacts how :attr:`!origin` is interpreted and how the module's :attr:`~module.__file__` is populated.
sv: ``True`` om specifikationens :attr:`origin`` hänvisar till en laddningsbar plats, ``False`` annars. Detta värde påverkar hur :attr:`!origin` tolkas och hur modulens :attr:`~module.__file__` fylls i.

source: A specialization of :class:`importlib.machinery.ExtensionFileLoader` that is able to load extension modules in Framework format.
sv: En specialisering av :class:`importlib.machinery.ExtensionFileLoader` som kan ladda tilläggsmoduler i Framework-format.

source: For compatibility with the iOS App Store, *all* binary modules in an iOS app must be dynamic libraries, contained in a framework with appropriate metadata, stored in the ``Frameworks`` folder of the packaged app. There can be only a single binary per framework, and there can be no executable binary material outside the Frameworks folder.
sv: För kompatibilitet med iOS App Store måste *alla* binära moduler i en iOS-app vara dynamiska bibliotek som ingår i ett ramverk med lämpliga metadata som lagras i mappen ``Frameworks`` i den paketerade appen. Det får bara finnas ett enda binärt program per ramverk och det får inte finnas något körbart binärt material utanför Frameworks-mappen.

source: To accommodate this requirement, when running on iOS, extension module binaries are *not* packaged as ``.so`` files on ``sys.path``, but as individual standalone frameworks. To discover those frameworks, this loader is be registered against the ``.fwork`` file extension, with a ``.fwork`` file acting as a placeholder in the original location of the binary on ``sys.path``. The ``.fwork`` file contains the path of the actual binary in the ``Frameworks`` folder, relative to the app bundle. To allow for resolving a framework-packaged binary back to the original location, the framework is expected to contain a ``.origin`` file that contains the location of the ``.fwork`` file, relative to the app bundle.
sv: För att tillgodose detta krav, när de körs på iOS, är tilläggsmodulens binärer *inte* paketerade som ``.so``-filer på ``sys.path``, utan som enskilda fristående ramverk. För att upptäcka dessa ramverk registreras den här laddaren mot filtillägget ``.fwork``, med en ``.fwork``-fil som fungerar som en platshållare på den ursprungliga platsen för binärfilen på ``sys.path``. Filen ``.fwork`` innehåller sökvägen till den faktiska binärfilen i mappen ``Frameworks``, i förhållande till appbunten. För att göra det möjligt att återställa en ramverkspackad binär fil till den ursprungliga platsen förväntas ramverket innehålla en fil med namnet ``.origin`` som innehåller platsen för filen ``.fwork`` i förhållande till appbunten.

source: For example, consider the case of an import ``from foo.bar import _whiz``, where ``_whiz`` is implemented with the binary module ``sources/foo/bar/_whiz.abi3.so``, with ``sources`` being the location registered on ``sys.path``, relative to the application bundle. This module *must* be distributed as ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (creating the framework name from the full import path of the module), with an ``Info.plist`` file in the ``.framework`` directory identifying the binary as a framework. The ``foo.bar._whiz`` module would be represented in the original location with a ``sources/foo/bar/_whiz.abi3.fwork`` marker file, containing the path ``Frameworks/foo.bar._whiz/foo.bar._whiz``. The framework would also contain ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, containing the path to the ``.fwork`` file.
sv: Tänk till exempel på fallet med en import ``from foo.bar import _whiz``, där ``_whiz`` implementeras med den binära modulen ``sources/foo/bar/_whiz.abi3.so``, där ``sources`` är den plats som registrerats på ``sys.path``, relativt programpaketet. Den här modulen *måste* distribueras som ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (ramverkets namn skapas från modulens fullständiga importsökväg), med en ``Info.plist``-fil i katalogen ``.framework`` som identifierar binärfilen som ett ramverk. Modulen ``foo.bar._whiz`` skulle representeras på den ursprungliga platsen med en ``källor/foo/bar/_whiz.abi3.fwork`` markörfil, som innehåller sökvägen ``Frameworks/foo.bar._whiz/foo.bar._whiz``. Ramverket skulle också innehålla ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, som innehåller sökvägen till filen ``.fwork``.
