Repository: yeager/python-docs-sv
Catalog: library/importlib.po
Languages: sv

source: When a module is loaded with this loader, the ``__file__`` for the module will report as the location of the ``.fwork`` file. This allows code to use the ``__file__`` of a module as an anchor for file system traversal. However, the spec origin will reference the location of the *actual* binary in the ``.framework`` folder.
sv: När en modul laddas med den här laddaren kommer ``__file__`` för modulen att rapporteras som platsen för filen ``.fwork``. Detta gör att kod kan använda ``__file__`` för en modul som ett ankare för filsystemtraversering. Spec-ursprunget kommer dock att referera till platsen för den *verkliga* binära filen i mappen ``.framework``.

source: The Xcode project building the app is responsible for converting any ``.so`` files from wherever they exist in the ``PYTHONPATH`` into frameworks in the ``Frameworks`` folder (including stripping extensions from the module file, the addition of framework metadata, and signing the resulting framework), and creating the ``.fwork`` and ``.origin`` files. This will usually be done with a build step in the Xcode project; see the iOS documentation for details on how to construct this build step.
sv: Xcode-projektet som bygger appen ansvarar för att konvertera alla ``.so``-filer från var de än finns i ``PYTHONPATH`` till ramverk i mappen ``Frameworks`` (inklusive att ta bort tillägg från modulfilen, lägga till metadata för ramverket och signera det resulterande ramverket) och skapa filerna ``.fwork`` och ``.origin``. Detta görs vanligtvis med ett byggsteg i Xcode-projektet; se iOS-dokumentationen för detaljer om hur man konstruerar detta byggsteg.

source: Availability
sv: Tillgänglighet

source: Path to the ``.fwork`` file for the extension module.
sv: Sökväg till filen ``.fwork`` för tilläggsmodulen.

source: :mod:`importlib.util` -- Utility code for importers
sv: :mod:`importlib.util` -- Verktygskod för importörer

source: **Source code:** :source:`Lib/importlib/util.py`
sv: **Källkod:** :källa:`Lib/importlib/util.py`

source: This module contains the various objects that help in the construction of an :term:`importer`.
sv: Denna modul innehåller de olika objekt som hjälper till vid konstruktionen av en :term:`importör`.

source: The bytes which represent the bytecode version number. If you need help with loading/writing bytecode then consider :class:`importlib.abc.SourceLoader`.
sv: Byte som representerar bytekodens versionsnummer. Om du behöver hjälp med att ladda/skriva bytecode kan du överväga :class:`importlib.abc.SourceLoader`.

source: Return the :pep:`3147`/:pep:`488` path to the byte-compiled file associated with the source *path*. For example, if *path* is ``/foo/bar/baz.py`` the return value would be ``/foo/bar/__pycache__/baz.cpython-32.pyc`` for Python 3.2. The ``cpython-32`` string comes from the current magic tag (see :func:`get_tag`; if :attr:`sys.implementation.cache_tag` is not defined then :exc:`NotImplementedError` will be raised).
sv: Returnerar :pep:`3147`/:pep:`488` sökvägen till den bytekompilerade filen som är associerad med källan *path*. Till exempel, om *väg* är ``/foo/bar/baz.py`` skulle returvärdet vara ``/foo/bar/__pycache__/baz.cpython-32.pyc`` för Python 3.2. Strängen ``cpython-32`` kommer från den aktuella magiska taggen (se :func:`get_tag`; om :attr:`sys.implementation.cache_tag` inte är definierad kommer :exc:`NotImplementedError`` att anges).

source: The *optimization* parameter is used to specify the optimization level of the bytecode file. An empty string represents no optimization, so ``/foo/bar/baz.py`` with an *optimization* of ``''`` will result in a bytecode path of ``/foo/bar/__pycache__/baz.cpython-32.pyc``. ``None`` causes the interpreter's optimization level to be used. Any other value's string representation is used, so ``/foo/bar/baz.py`` with an *optimization* of ``2`` will lead to the bytecode path of ``/foo/bar/__pycache__/baz.cpython-32.opt-2.pyc``. The string representation of *optimization* can only be alphanumeric, else :exc:`ValueError` is raised.
sv: Parametern *optimization* används för att ange optimeringsnivån för bytecode-filen. En tom sträng representerar ingen optimering, så ``/foo/bar/baz.py`` med en *optimering* på ``''`` kommer att resultera i en bytekodssökväg på ``/foo/bar/__pycache__/baz.cpython-32.pyc``. ``None`` gör att tolkens optimeringsnivå används. Alla andra värdens strängrepresentation används, så ``/foo/bar/baz.py`` med en *optimering* på ``2`` kommer att leda till bytekodssökvägen ``/foo/bar/__pycache__/baz.cpython-32.opt-2.pyc``. Strängrepresentationen av *optimering* kan endast vara alfanumerisk, annars uppstår :exc:`ValueError`.

source: The *debug_override* parameter is deprecated and can be used to override the system's value for ``__debug__``. A ``True`` value is the equivalent of setting *optimization* to the empty string. A ``False`` value is the same as setting *optimization* to ``1``. If both *debug_override* an *optimization* are not ``None`` then :exc:`TypeError` is raised.
sv: Parametern *debug_override* är föråldrad och kan användas för att åsidosätta systemets värde för ``__debug__``. Värdet ``True`` motsvarar inställningen av *optimization* till den tomma strängen. Ett värde på ``False`` är detsamma som att sätta *optimization* till ``1``. Om både *debug_override* och *optimization* inte är ``None`` så genereras :exc:`TypeError`.

source: The *optimization* parameter was added and the *debug_override* parameter was deprecated.
sv: Parametern *optimization* har lagts till och parametern *debug_override* har tagits bort.

source: Accepts a :term:`path-like object`.
sv: Accepterar en :term:`path-liknande objekt`.

source: Given the *path* to a :pep:`3147` file name, return the associated source code file path. For example, if *path* is ``/foo/bar/__pycache__/baz.cpython-32.pyc`` the returned path would be ``/foo/bar/baz.py``. *path* need not exist, however if it does not conform to :pep:`3147` or :pep:`488` format, a :exc:`ValueError` is raised. If :attr:`sys.implementation.cache_tag` is not defined, :exc:`NotImplementedError` is raised.
sv: Givet *sökvägen* till ett :pep:`3147`-filnamn, returnera den associerade källkodsfilsökvägen. Till exempel, om *sökväg* är ``/foo/bar/__pycache__/baz.cpython-32.pyc`` skulle den returnerade sökvägen vara ``/foo/bar/baz.py``. *path* behöver inte existera, men om den inte överensstämmer med :pep:`3147` eller :pep:`488` format, kommer ett :exc:`ValueError` att uppstå. Om :attr:`sys.implementation.cache_tag` inte är definierad, genereras :exc:`NotImplementedError`.

source: Decode the given bytes representing source code and return it as a string with universal newlines (as required by :meth:`importlib.abc.InspectLoader.get_source`).
sv: Avkodar de angivna byte som representerar källkod och returnerar den som en sträng med universella nya linjer (enligt :meth:`importlib.abc.InspectLoader.get_source`).

source: Resolve a relative module name to an absolute one.
sv: Omvandlar ett relativt modulnamn till ett absolut.

source: If **name** has no leading dots, then **name** is simply returned. This allows for usage such as ``importlib.util.resolve_name('sys', __spec__.parent)`` without doing a check to see if the **package** argument is needed.
sv: Om **name** inte har några inledande punkter returneras helt enkelt **name**. Detta gör det möjligt att använda ``importlib.util.resolve_name('sys', __spec__.parent)`` utan att kontrollera om argumentet **package** behövs.

source: :exc:`ImportError` is raised if **name** is a relative module name but **package** is a false value (e.g. ``None`` or the empty string). :exc:`ImportError` is also raised if a relative name would escape its containing package (e.g. requesting ``..bacon`` from within the ``spam`` package).
sv: :exc:`ImportError` tas upp om **name** är ett relativt modulnamn men **package** är ett falskt värde (t.ex. ``None`` eller den tomma strängen). :exc:`ImportError` tas också upp om ett relativt namn skulle undkomma det innehållande paketet (t.ex. begära ``..bacon`` inom paketet ``spam``).

source: To improve consistency with import statements, raise :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts.
sv: För att förbättra konsistensen med importdeklarationer, skicka :exc:`ImportError` istället för :exc:`ValueError` för ogiltiga relativa importförsök.

source: Find the :term:`spec <module spec>` for a module, optionally relative to the specified **package** name. If the module is in :data:`sys.modules`, then ``sys.modules[name].__spec__`` is returned (unless the spec would be ``None`` or is not set, in which case :exc:`ValueError` is raised). Otherwise a search using :data:`sys.meta_path` is done. ``None`` is returned if no spec is found.
sv: Hitta :term:`spec <module spec>` för en modul, eventuellt i förhållande till det angivna **package**-namnet. Om modulen finns i :data:`sys.modules`, returneras ``sys.modules[name].__spec__`` (såvida inte specifikationen skulle vara ``None`` eller inte är inställd, i vilket fall :exc:`ValueError`` tas upp). Annars görs en sökning med hjälp av :data:`sys.meta_path`. ``None`` returneras om ingen specifikation hittas.

source: If **name** is for a submodule (contains a dot), the parent module is automatically imported.
sv: Om **namn** är för en undermodul (innehåller en punkt) importeras den överordnade modulen automatiskt.

source: **name** and **package** work the same as for :func:`import_module`.
sv: **name** och **package** fungerar på samma sätt som för :func:`import_module`.

source: Raises :exc:`ModuleNotFoundError` instead of :exc:`AttributeError` if **package** is in fact not a package (i.e. lacks a :attr:`~module.__path__` attribute).
sv: Utlöser :exc:`ModuleNotFoundError` istället för :exc:`AttributeError` om **package** i själva verket inte är ett paket (dvs. saknar attributet :attr:`~module.__path__`).

source: Create a new module based on **spec** and :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>`.
sv: Skapa en ny modul baserad på **spec** och :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>`.

source: If :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>` does not return ``None``, then any pre-existing attributes will not be reset. Also, no :exc:`AttributeError` will be raised if triggered while accessing **spec** or setting an attribute on the module.
sv: Om :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>` inte returnerar ``None``, kommer inga befintliga attribut att återställas. Inte heller kommer något :exc:`AttributeError` att uppstå om det utlöses under åtkomst till **spec** eller inställning av ett attribut på modulen.

source: This function is preferred over using :class:`types.ModuleType` to create a new module as **spec** is used to set as many import-controlled attributes on the module as possible.
sv: Denna funktion är att föredra framför att använda :class:`types.ModuleType` för att skapa en ny modul eftersom **spec** används för att ange så många importkontrollerade attribut för modulen som möjligt.

source: A factory function for creating a :class:`~importlib.machinery.ModuleSpec` instance based on a loader. The parameters have the same meaning as they do for ModuleSpec. The function uses available :term:`loader` APIs, such as :meth:`InspectLoader.is_package`, to fill in any missing information on the spec.
sv: En fabriksfunktion för att skapa en :class:`~importlib.machinery.ModuleSpec`-instans baserad på en laddare. Parametrarna har samma betydelse som de har för ModuleSpec. Funktionen använder tillgängliga :term:`loader` API:er, såsom :meth:`InspectLoader.is_package`, för att fylla i eventuell saknad information om specifikationen.

source: A factory function for creating a :class:`~importlib.machinery.ModuleSpec` instance based on the path to a file. Missing information will be filled in on the spec by making use of loader APIs and by the implication that the module will be file-based.
sv: En fabriksfunktion för att skapa en :class:`~importlib.machinery.ModuleSpec`-instans baserat på sökvägen till en fil. Saknad information kommer att fyllas i i specifikationen genom att använda API:er för laddare och genom att antyda att modulen kommer att vara filbaserad.

source: Return the hash of *source_bytes* as bytes. A hash-based ``.pyc`` file embeds the :func:`source_hash` of the corresponding source file's contents in its header.
sv: Returnerar hashen av *source_bytes* som bytes. En hashbaserad ``.pyc``-fil bäddar in :func:`source_hash` av motsvarande källfils innehåll i sitt huvud.

source: A context manager that can temporarily skip the compatibility check for extension modules. By default the check is enabled and will fail when a single-phase init module is imported in a subinterpreter. It will also fail for a multi-phase init module that doesn't explicitly support a per-interpreter GIL, when imported in an interpreter with its own GIL.
sv: En kontexthanterare som tillfälligt kan hoppa över kompatibilitetskontrollen för tilläggsmoduler. Som standard är kontrollen aktiverad och kommer att misslyckas när en enfasig init-modul importeras i en undertolk. Den kommer också att misslyckas för en flerfasig init-modul som inte uttryckligen stöder en GIL per tolk, när den importeras i en tolk med sin egen GIL.

source: Note that this function is meant to accommodate an unusual case; one which is likely to eventually go away. There's is a pretty good chance this is not what you were looking for.
sv: Observera att den här funktionen är avsedd för ett ovanligt fall, ett fall som sannolikt kommer att försvinna så småningom. Det finns en ganska stor chans att det här inte är vad du letade efter.

source: You can get the same effect as this function by implementing the basic interface of multi-phase init (:pep:`489`) and lying about support for multiple interpreters (or per-interpreter GIL).
sv: Du kan få samma effekt som den här funktionen genom att implementera det grundläggande gränssnittet för flerfasig init (:pep:`489`) och ljuga om stöd för flera tolkar (eller GIL per tolk).

source: Using this function to disable the check can lead to unexpected behavior and even crashes. It should only be used during extension module development.
sv: Om du använder den här funktionen för att inaktivera kontrollen kan det leda till oväntat beteende och till och med krascher. Den bör endast användas under utveckling av tilläggsmoduler.

source: A class which postpones the execution of the loader of a module until the module has an attribute accessed.
sv: En klass som skjuter upp exekveringen av laddaren för en modul tills dess att modulen har ett attribut åtkomligt.

source: This class **only** works with loaders that define :meth:`~importlib.abc.Loader.exec_module` as control over what module type is used for the module is required. For those same reasons, the loader's :meth:`~importlib.abc.Loader.create_module` method must return ``None`` or a type for which its ``__class__`` attribute can be mutated along with not using :term:`slots <__slots__>`. Finally, modules which substitute the object placed into :data:`sys.modules` will not work as there is no way to properly replace the module references throughout the interpreter safely; :exc:`ValueError` is raised if such a substitution is detected.
sv: Denna klass fungerar **endast** med laddare som definierar :meth:`~importlib.abc.Loader.exec_module` eftersom kontroll över vilken modultyp som används för modulen krävs. Av samma skäl måste laddarens metod :meth:`~importlib.abc.Loader.create_module` returnera ``None`` eller en typ för vilken attributet ``__class__`` kan ändras, och inte heller använda :term:`slots <__slots__>`. Slutligen kommer moduler som ersätter objektet som placerats i :data:`sys.modules` inte att fungera eftersom det inte finns något sätt att på ett säkert sätt ersätta modulreferenserna i hela tolken; :exc:`ValueError` tas upp om en sådan ersättning upptäcks.

source: For projects where startup time is critical, this class allows for potentially minimizing the cost of loading a module if it is never used. For projects where startup time is not essential then use of this class is **heavily** discouraged due to error messages created during loading being postponed and thus occurring out of context.
sv: För projekt där uppstartstiden är kritisk gör den här klassen det möjligt att potentiellt minimera kostnaden för att ladda en modul om den aldrig används. För projekt där starttiden inte är avgörande är det **starkt** avrått från att använda denna klass eftersom felmeddelanden som skapas under laddningen skjuts upp och därmed uppträder utanför sitt sammanhang.

source: Began calling :meth:`~importlib.abc.Loader.create_module`, removing the compatibility warning for :class:`importlib.machinery.BuiltinImporter` and :class:`importlib.machinery.ExtensionFileLoader`.
sv: Började anropa :meth:`~importlib.abc.Loader.create_module`, vilket tog bort kompatibilitetsvarningen för :class:`importlib.machinery.BuiltinImporter` och :class:`importlib.machinery.ExtensionFileLoader`.

source: A class method which returns a callable that creates a lazy loader. This is meant to be used in situations where the loader is passed by class instead of by instance. ::
sv: En klassmetod som returnerar en callable som skapar en lazy loader. Detta är tänkt att användas i situationer där laddaren skickas av klassen istället för av instansen:

source: suffixes = importlib.machinery.SOURCE_SUFFIXES loader = importlib.machinery.SourceFileLoader lazy_loader = importlib.util.LazyLoader.factory(loader) finder = importlib.machinery.FileFinder(path, (lazy_loader, suffixes))
sv: suffix = importlib.machinery.SOURCE_SUFFIXES loader = importlib.machinery.SourceFileLoader lazy_loader = importlib.util.LazyLoader.factory(loader) finder = importlib.machinery.FileFinder(sökväg, (lazy_loader, suffixes))

source: Examples
sv: Exempel

source: Importing programmatically
sv: Importera programmatiskt

source: To programmatically import a module, use :func:`importlib.import_module`. ::
sv: För att programmatiskt importera en modul, använd :func:`importlib.import_module`. ::

source: Checking if a module can be imported
sv: Kontroll av om en modul kan importeras

source: If you need to find out if a module can be imported without actually doing the import, then you should use :func:`importlib.util.find_spec`.
sv: Om du behöver ta reda på om en modul kan importeras utan att faktiskt göra importen, bör du använda :func:`importlib.util.find_spec`.

source: Note that if ``name`` is a submodule (contains a dot), :func:`importlib.util.find_spec` will import the parent module. ::
sv: Observera att om ``name`` är en undermodul (innehåller en punkt) kommer :func:`importlib.util.find_spec` att importera föräldramodulen. ::

source: Importing a source file directly
sv: Importera en källfil direkt

source: This recipe should be used with caution: it is an approximation of an import statement where the file path is specified directly, rather than :data:`sys.path` being searched. Alternatives should first be considered first, such as modifying :data:`sys.path` when a proper module is required, or using :func:`runpy.run_path` when the global namespace resulting from running a Python file is appropriate.
sv: Det här receptet bör användas med försiktighet: det är en approximation av en importsats där filsökvägen anges direkt, i stället för att :data:`sys.path` söks. Alternativ bör först övervägas, till exempel att ändra :data:`sys.path` när en riktig modul krävs, eller att använda :func:`runpy.run_path` när det globala namnrymden som uppstår när en Python-fil körs är lämplig.

source: To import a Python source file directly from a path, use the following recipe::
sv: Om du vill importera en Python-källfil direkt från en sökväg använder du följande recept::

source: Implementing lazy imports
sv: Implementering av lat import

source: The example below shows how to implement lazy imports::
sv: Exemplet nedan visar hur man implementerar lazy imports::

source: Setting up an importer
sv: Konfigurera en importer

source: For deep customizations of import, you typically want to implement an :term:`importer`. This means managing both the :term:`finder` and :term:`loader` side of things. For finders there are two flavours to choose from depending on your needs: a :term:`meta path finder` or a :term:`path entry finder`. The former is what you would put on :data:`sys.meta_path` while the latter is what you create using a :term:`path entry hook` on :data:`sys.path_hooks` which works with :data:`sys.path` entries to potentially create a finder. This example will show you how to register your own importers so that import will use them (for creating an importer for yourself, read the documentation for the appropriate classes defined within this package)::
sv: För djupa anpassningar av import vill du vanligtvis implementera en :term:`importer`. Detta innebär att hantera både :term:`finder` och :term:`loader` sidan av saker och ting. För sökare finns det två varianter att välja mellan beroende på dina behov: en :term:`meta path finder` eller en :term:`path entry finder`. Den förra är vad du skulle sätta på :data:`sys.meta_path` medan den senare är vad du skapar med hjälp av en :term:`path entry hook` på :data:`sys.path_hooks` som fungerar med :data:`sys.path`-poster för att potentiellt skapa en sökare. Det här exemplet visar hur du registrerar dina egna importörer så att import använder dem (för att skapa en egen importör, läs dokumentationen för lämpliga klasser som definieras i det här paketet)::

source: Approximating :func:`importlib.import_module`
sv: Närmar sig :func:`importlib.import_module`

source: Import itself is implemented in Python code, making it possible to expose most of the import machinery through importlib. The following helps illustrate the various APIs that importlib exposes by providing an approximate implementation of :func:`importlib.import_module`::
sv: Import i sig är implementerat i Python-kod, vilket gör det möjligt att exponera det mesta av importmaskineriet genom importlib. Följande hjälper till att illustrera de olika API:erna som importlib exponerar genom att tillhandahålla en ungefärlig implementering av :func:`importlib.import_module`::

source: universal newlines
sv: universella nya rader

source: importlib.abc.InspectLoader.get_source method
sv: importlib.abc.InspectLoader.get_source-metoden
