Repository: yeager/python-docs-sv
Catalog: library/intro.po
Languages: sv

source: Introduction
sv: Introduktion

source: The "Python library" contains several different kinds of components.
sv: "Python-biblioteket" innehåller flera olika typer av komponenter.

source: It contains data types that would normally be considered part of the "core" of a language, such as numbers and lists. For these types, the Python language core defines the form of literals and places some constraints on their semantics, but does not fully define the semantics. (On the other hand, the language core does define syntactic properties like the spelling and priorities of operators.)
sv: Den innehåller datatyper som normalt skulle betraktas som en del av "kärnan" i ett språk, till exempel tal och listor. För dessa typer definierar Pythons språkkärna formen av literaler och lägger vissa begränsningar på deras semantik, men definierar inte semantiken fullt ut. (Å andra sidan definierar språkkärnan syntaktiska egenskaper som stavning och prioriteringar av operatorer)

source: The library also contains built-in functions and exceptions --- objects that can be used by all Python code without the need of an :keyword:`import` statement. Some of these are defined by the core language, but many are not essential for the core semantics and are only described here.
sv: Biblioteket innehåller också inbyggda funktioner och undantag --- objekt som kan användas av all Python-kod utan att det behövs en :keyword:`import`-sats. Vissa av dessa definieras av kärnspråket, men många är inte väsentliga för kärnans semantik och beskrivs bara här.

source: The bulk of the library, however, consists of a collection of modules. There are many ways to dissect this collection. Some modules are written in C and built in to the Python interpreter; others are written in Python and imported in source form. Some modules provide interfaces that are highly specific to Python, like printing a stack trace; some provide interfaces that are specific to particular operating systems, such as access to specific hardware; others provide interfaces that are specific to a particular application domain, like the World Wide Web. Some modules are available in all versions and ports of Python; others are only available when the underlying system supports or requires them; yet others are available only when a particular configuration option was chosen at the time when Python was compiled and installed.
sv: Huvuddelen av biblioteket består dock av en samling moduler. Det finns många sätt att dissekera denna samling. Vissa moduler är skrivna i C och inbyggda i Python-tolken; andra är skrivna i Python och importerade i källform. Vissa moduler tillhandahåller gränssnitt som är mycket specifika för Python, som att skriva ut en stack trace; vissa tillhandahåller gränssnitt som är specifika för vissa operativsystem, som tillgång till viss maskinvara; andra tillhandahåller gränssnitt som är specifika för en viss applikationsdomän, som World Wide Web. Vissa moduler är tillgängliga i alla versioner och portar av Python, andra är endast tillgängliga när det underliggande systemet stöder eller kräver dem, och ytterligare andra är endast tillgängliga när ett visst konfigurationsalternativ valdes vid den tidpunkt då Python kompilerades och installerades.

source: This manual is organized "from the inside out:" it first describes the built-in functions, data types and exceptions, and finally the modules, grouped in chapters of related modules.
sv: Den här handboken är organiserad "inifrån och ut": först beskrivs de inbyggda funktionerna, datatyperna och undantagen, och slutligen modulerna, grupperade i kapitel med relaterade moduler.

source: This means that if you start reading this manual from the start, and skip to the next chapter when you get bored, you will get a reasonable overview of the available modules and application areas that are supported by the Python library. Of course, you don't *have* to read it like a novel --- you can also browse the table of contents (in front of the manual), or look for a specific function, module or term in the index (in the back). And finally, if you enjoy learning about random subjects, you choose a random page number (see module :mod:`random`) and read a section or two. Regardless of the order in which you read the sections of this manual, it helps to start with chapter :ref:`built-in-funcs`, as the remainder of the manual assumes familiarity with this material.
sv: Det betyder att om du börjar läsa den här manualen från början och hoppar till nästa kapitel när du blir uttråkad, kommer du att få en rimlig översikt över de tillgängliga moduler och applikationsområden som stöds av Python-biblioteket. Naturligtvis behöver du inte *läsa* den som en roman --- du kan också bläddra i innehållsförteckningen (längst fram i handboken) eller leta efter en specifik funktion, modul eller term i indexet (längst bak). Och slutligen, om du tycker om att lära dig om slumpmässiga ämnen, kan du välja ett slumpmässigt sidnummer (se modulen :mod:`random`) och läsa ett avsnitt eller två. Oavsett i vilken ordning du läser avsnitten i den här handboken är det bra att börja med kapitel :ref:`built-in-funcs`, eftersom resten av handboken förutsätter att du är bekant med detta material.

source: Let the show begin!
sv: Låt showen börja!

source: Notes on availability
sv: Anmärkningar om tillgänglighet

source: An "Availability: Unix" note means that this function is commonly found on Unix systems. It does not make any claims about its existence on a specific operating system.
sv: En "Tillgänglighet: Unix" betyder att den här funktionen är vanligt förekommande på Unix-system. Den gör inga påståenden om att den finns på ett visst operativsystem.

source: If not separately noted, all functions that claim "Availability: Unix" are supported on macOS, iOS and Android, all of which build on a Unix core.
sv: Om inte annat anges särskilt, stöds alla funktioner som anger "Availability: Unix" stöds av macOS, iOS och Android, som alla bygger på en Unix-kärna.

source: If an availability note contains both a minimum Kernel version and a minimum libc version, then both conditions must hold. For example a feature with note *Availability: Linux >= 3.17 with glibc >= 2.27* requires both Linux 3.17 or newer and glibc 2.27 or newer.
sv: Om en tillgänglighetsinformation innehåller både en minsta kärnversion och en minsta libc-version, måste båda villkoren uppfyllas. Till exempel en funktion med anmärkningen *Availability: Linux >= 3.17 med glibc >= 2.27* kräver både Linux 3.17 eller nyare och glibc 2.27 eller nyare.

source: WebAssembly platforms
sv: WebAssembly-plattformar

source: The `WebAssembly`_ platforms ``wasm32-emscripten`` (`Emscripten`_) and ``wasm32-wasi`` (`WASI`_) provide a subset of POSIX APIs. WebAssembly runtimes and browsers are sandboxed and have limited access to the host and external resources. Any Python standard library module that uses processes, threading, networking, signals, or other forms of inter-process communication (IPC), is either not available or may not work as on other Unix-like systems. File I/O, file system, and Unix permission-related functions are restricted, too. Emscripten does not permit blocking I/O. Other blocking operations like :func:`~time.sleep` block the browser event loop.
sv: WebAssembly-plattformarna ``wasm32-emscripten`` (`Emscripten`_) och ``wasm32-wasi`` (`WASI`_) tillhandahåller en delmängd av POSIX API:er. WebAssembly-körningar och webbläsare är sandboxade och har begränsad åtkomst till värden och externa resurser. Alla moduler i Pythons standardbibliotek som använder processer, trådning, nätverk, signaler eller andra former av kommunikation mellan processer (IPC) är antingen inte tillgängliga eller fungerar kanske inte som på andra Unix-liknande system. Fil-I/O, filsystem och Unix-behörighetsrelaterade funktioner är också begränsade. Emscripten tillåter inte blockerande I/O. Andra blockeringsoperationer som :func:`~time.sleep` blockerar webbläsarens händelseslinga.

source: The properties and behavior of Python on WebAssembly platforms depend on the `Emscripten`_-SDK or `WASI`_-SDK version, WASM runtimes (browser, NodeJS, `wasmtime`_), and Python build time flags. WebAssembly, Emscripten, and WASI are evolving standards; some features like networking may be supported in the future.
sv: Pythons egenskaper och beteende på WebAssembly-plattformar beror på `Emscripten`_-SDK- eller `WASI`_-SDK-versionen, WASM-runtimes (webbläsare, NodeJS, `wasmtime`_) och Pythons byggtidsflaggor. WebAssembly, Emscripten och WASI är standarder under utveckling; vissa funktioner, t.ex. nätverk, kan komma att stödjas i framtiden.

source: For Python in the browser, users should consider `Pyodide`_ or `PyScript`_. PyScript is built on top of Pyodide, which itself is built on top of CPython and Emscripten. Pyodide provides access to browsers' JavaScript and DOM APIs as well as limited networking capabilities with JavaScript's ``XMLHttpRequest`` and ``Fetch`` APIs.
sv: För Python i webbläsaren bör användarna överväga `Pyodide`_ eller `PyScript`_. PyScript är byggt ovanpå Pyodide, som i sin tur är byggt ovanpå CPython och Emscripten. Pyodide ger tillgång till webbläsarnas JavaScript och DOM API:er samt begränsade nätverksfunktioner med JavaScript:s ``XMLHttpRequest`` och ``Fetch`` API:er.

source: Process-related APIs are not available or always fail with an error. That includes APIs that spawn new processes (:func:`~os.fork`, :func:`~os.execve`), wait for processes (:func:`~os.waitpid`), send signals (:func:`~os.kill`), or otherwise interact with processes. The :mod:`subprocess` is importable but does not work.
sv: Processrelaterade API:er är inte tillgängliga eller misslyckas alltid med ett fel. Det inkluderar API:er som skapar nya processer (:func:`~os.fork`, :func:`~os.execve`), väntar på processer (:func:`~os.waitpid`), skickar signaler (:func:`~os.kill`) eller på annat sätt interagerar med processer. Modulen :mod:`subprocess` är importerbar men fungerar inte.

source: The :mod:`socket` module is available, but is limited and behaves differently from other platforms. On Emscripten, sockets are always non-blocking and require additional JavaScript code and helpers on the server to proxy TCP through WebSockets; see `Emscripten Networking`_ for more information. WASI snapshot preview 1 only permits sockets from an existing file descriptor.
sv: Modulen :mod:`socket` finns tillgänglig, men den är begränsad och beter sig annorlunda än på andra plattformar. På Emscripten är sockets alltid icke-blockerande och kräver ytterligare JavaScript-kod och hjälpare på servern för att proxy TCP genom WebSockets; se `Emscripten Networking`_ för mer information. WASI snapshot preview 1 tillåter endast sockets från en befintlig filbeskrivare.

source: Some functions are stubs that either don't do anything and always return hardcoded values.
sv: Vissa funktioner är stubbar som antingen inte gör någonting och alltid returnerar hårdkodade värden.

source: Functions related to file descriptors, file permissions, file ownership, and links are limited and don't support some operations. For example, WASI does not permit symlinks with absolute file names.
sv: Funktioner relaterade till filbeskrivningar, filbehörigheter, filägande och länkar är begränsade och stöder inte vissa operationer. WASI tillåter t.ex. inte symlinks med absoluta filnamn.

source: Mobile platforms
sv: Mobila plattformar

source: Android and iOS are, in most respects, POSIX operating systems. File I/O, socket handling, and threading all behave as they would on any POSIX operating system. However, there are several major differences:
sv: Android och iOS är i de flesta avseenden POSIX-operativsystem. Fil-I/O, socket-hantering och trådning fungerar på samma sätt som i alla POSIX-operativsystem. Det finns dock flera stora skillnader:

source: Mobile platforms can only use Python in "embedded" mode. There is no Python REPL, and no ability to use separate executables such as :program:`python` or :program:`pip`. To add Python code to your mobile app, you must use the :ref:`Python embedding API <embedding>`. For more details, see :ref:`using-android` and :ref:`using-ios`.
sv: Mobila plattformar kan bara använda Python i "inbäddat" läge. Det finns ingen Python REPL och ingen möjlighet att använda separata körbara filer som :program:`python` eller :program:`pip`. Om du vill lägga till Python-kod i din mobilapp måste du använda :ref:`Python embedding API <embedding>`. För mer information, se :ref:`using-android` och :ref:`using-ios`.

source: Subprocesses:
sv: Underprocesser:

source: On Android, creating subprocesses is possible but `officially unsupported <https://issuetracker.google.com/issues/128554619#comment4>`__. In particular, Android does not support any part of the System V IPC API, so :mod:`multiprocessing` is not available.
sv: På Android är det möjligt att skapa underprocesser, men det stöds inte officiellt <https://issuetracker.google.com/issues/128554619#comment4>`__. I synnerhet stöder Android inte någon del av System V IPC API, så :mod:`multiprocessing` är inte tillgängligt.

source: An iOS app cannot use any form of subprocessing, multiprocessing, or inter-process communication. If an iOS app attempts to create a subprocess, the process creating the subprocess will either lock up, or crash. An iOS app has no visibility of other applications that are running, nor any ability to communicate with other running applications, outside of the iOS-specific APIs that exist for this purpose.
sv: En iOS-app kan inte använda någon form av subprocessing, multiprocessing eller kommunikation mellan processer. Om en iOS-app försöker skapa en subprocess kommer den process som skapar subprocessen antingen att låsas eller krascha. En iOS-app har ingen insyn i andra applikationer som körs eller någon möjlighet att kommunicera med andra applikationer som körs, utöver de iOS-specifika API:er som finns för detta ändamål.

source: Mobile apps have limited access to modify system resources (such as the system clock). These resources will often be *readable*, but attempts to modify those resources will usually fail.
sv: Mobilappar har begränsad tillgång till att modifiera systemresurser (t.ex. systemklockan). Dessa resurser är ofta *läsbara*, men försök att ändra dessa resurser misslyckas vanligtvis.

source: Console input and output:
sv: Konsolens in- och utmatning:

source: On Android, the native ``stdout`` and ``stderr`` are not connected to anything, so Python installs its own streams which redirect messages to the system log. These can be seen under the tags ``python.stdout`` and ``python.stderr`` respectively.
sv: På Android är de inbyggda ``stdout`` och ``stderr`` inte kopplade till någonting, så Python installerar sina egna strömmar som omdirigerar meddelanden till systemloggen. Dessa kan ses under taggarna ``python.stdout`` respektive ``python.stderr``.

source: iOS apps have a limited concept of console output. ``stdout`` and ``stderr`` *exist*, and content written to ``stdout`` and ``stderr`` will be visible in logs when running in Xcode, but this content *won't* be recorded in the system log. If a user who has installed your app provides their app logs as a diagnostic aid, they will not include any detail written to ``stdout`` or ``stderr``.
sv: iOS-appar har ett begränsat koncept för konsolutmatning. ``stdout`` och ``stderr`` *existerar*, och innehåll som skrivs till ``stdout`` och ``stderr`` kommer att synas i loggar när de körs i Xcode, men detta innehåll *kommer* inte att registreras i systemloggen. Om en användare som har installerat din app tillhandahåller sina apploggar som ett diagnostiskt hjälpmedel kommer de inte att innehålla några detaljer som skrivits till ``stdout`` eller ``stderr``.

source: Mobile apps have no usable ``stdin`` at all. While apps can display an on-screen keyboard, this is a software feature, not something that is attached to ``stdin``.
sv: Mobilappar har ingen användbar ``stdin`` överhuvudtaget. Även om appar kan visa ett tangentbord på skärmen är detta en programvarufunktion, inte något som är kopplat till ``stdin``.

source: As a result, Python modules that involve console manipulation (such as :mod:`curses` and :mod:`readline`) are not available on mobile platforms.
sv: Därför är Python-moduler som innebär konsolmanipulation (t.ex. :mod:`curses` och :mod:`readline`) inte tillgängliga på mobila plattformar.
