Repository: yeager/python-docs-sv
Catalog: library/io.po
Languages: sv

source: ``seek(0, SEEK_END)``: Fast-forward to the end of the stream.
sv: ``seek(0, SEEK_END)``: Snabbspola till slutet av strömmen.

source: ``seek(0, SEEK_CUR)``: Leave the current stream position unchanged.
sv: ``seek(0, SEEK_CUR)``: Lämna den aktuella stream-positionen oförändrad.

source: Any other argument combinations are invalid, and may raise exceptions.
sv: Alla andra argumentkombinationer är ogiltiga och kan leda till undantag.

source: :data:`os.SEEK_SET`, :data:`os.SEEK_CUR`, and :data:`os.SEEK_END`.
sv: :data:`os.SEEK_SET`, :data:`os.SEEK_CUR`, och :data:`os.SEEK_END`.

source: Return the stream position as an opaque number. The return value of :meth:`!tell` can be given as input to :meth:`seek`, to restore a previous stream position.
sv: Returnerar strömpositionen som ett opakt tal. Returvärdet för :meth:`!tell` kan ges som indata till :meth:`seek`, för att återställa en tidigare strömposition.

source: A text stream using an in-memory text buffer. It inherits from :class:`TextIOBase`.
sv: En textström som använder en textbuffert i minnet. Den ärver från :class:`TextIOBase`.

source: The text buffer is discarded when the :meth:`~IOBase.close` method is called.
sv: Textbufferten kasseras när metoden :meth:`~IOBase.close` anropas.

source: The initial value of the buffer can be set by providing *initial_value*. If newline translation is enabled, newlines will be encoded as if by :meth:`~TextIOBase.write`. The stream is positioned at the start of the buffer which emulates opening an existing file in a ``w+`` mode, making it ready for an immediate write from the beginning or for a write that would overwrite the initial value. To emulate opening a file in an ``a+`` mode ready for appending, use ``f.seek(0, io.SEEK_END)`` to reposition the stream at the end of the buffer.
sv: Det initiala värdet för bufferten kan ställas in genom att ange *initial_value*. Om översättning av nya rader är aktiverad kommer nya rader att kodas som om de vore :meth:`~TextIOBase.write`. Strömmen placeras i början av bufferten, vilket emulerar öppnandet av en befintlig fil i ett ``w+``-läge, vilket gör den redo för en omedelbar skrivning från början eller för en skrivning som skulle skriva över det initiala värdet. För att emulera öppnandet av en fil i ett ``a+``-läge som är redo att läggas till, använd ``f.seek(0, io.SEEK_END)`` för att flytta strömmen till slutet av bufferten.

source: The *newline* argument works like that of :class:`TextIOWrapper`, except that when writing output to the stream, if *newline* is ``None``, newlines are written as ``\n`` on all platforms.
sv: Argumentet *newline* fungerar som i :class:`TextIOWrapper`, förutom att när utdata skrivs till strömmen, om *newline* är ``None``, skrivs nya linjer som ``\n`` på alla plattformar.

source: :class:`StringIO` provides this method in addition to those from :class:`TextIOBase` and :class:`IOBase`:
sv: :class:`StringIO` tillhandahåller denna metod utöver de som finns i :class:`TextIOBase` och :class:`IOBase`:

source: Return a :class:`str` containing the entire contents of the buffer. Newlines are decoded as if by :meth:`~TextIOBase.read`, although the stream position is not changed.
sv: Returnerar en :class:`str` som innehåller hela innehållet i bufferten. Nya rader avkodas som om de vore :meth:`~TextIOBase.read`, även om flödespositionen inte ändras.

source: Example usage::
sv: Exempel på användning::

source: import io output = io.StringIO() output.write('First line.\n') print('Second line.', file=output) # Retrieve file contents -- this will be # 'First line.\nSecond line.\n' contents = output.getvalue() # Close object and discard memory buffer -- # .getvalue() will now raise an exception. output.close()
sv: import io output = io.StringIO() output.write('Första raden.\n') print('Andra raden.', file=output) # Hämta filinnehållet -- detta kommer att vara # 'Första raden.\nSekundära raden.\n' innehåll = output.getvalue() # Stäng objektet och kasta minnesbufferten -- # .getvalue() kommer nu att ge upphov till ett undantag. output.close()

source: A helper codec that decodes newlines for :term:`universal newlines` mode. It inherits from :class:`codecs.IncrementalDecoder`.
sv: En hjälpcodec som avkodar newlines för :term:`universal newlines`-läget. Den ärver från :class:`codecs.IncrementalDecoder`.

source: Static Typing
sv: Statisk typning

source: The following protocols can be used for annotating function and method arguments for simple stream reading or writing operations. They are decorated with :deco:`typing.runtime_checkable`.
sv: Följande protokoll kan användas för att annotera funktions- och metodargument för enkla läs- eller skrivoperationer i strömmar. De är dekorerade med :deco:`typing.runtime_checkable`.

source: Generic protocol for reading from a file or other input stream. ``T`` will usually be :class:`str` or :class:`bytes`, but can be any type that is read from the stream.
sv: Generiskt protokoll för att läsa från en fil eller annan inmatningsström. ``T`` kommer vanligtvis att vara :class:`str` eller :class:`bytes`, men kan vara vilken typ som helst som läses från strömmen.

source: Read data from the input stream and return it. If *size* is specified, it should be an integer, and at most *size* items (bytes/characters) will be read.
sv: Läser data från inmatningsströmmen och returnerar den. Om *size* anges ska det vara ett heltal, och högst *size* objekt (byte/tecken) kommer att läsas.

source: For example::
sv: Till exempel::

source: def read_it(reader: Reader[str]): data = reader.read(11) assert isinstance(data, str)
sv: def read_it(reader: Läsare[str]): data = läsare.läs(11) assert isinstance(data, str)

source: Generic protocol for writing to a file or other output stream. ``T`` will usually be :class:`str` or :class:`bytes`, but can be any type that can be written to the stream.
sv: Generiskt protokoll för att skriva till en fil eller annan utdataström. ``T`` kommer vanligtvis att vara :class:`str` eller :class:`bytes`, men kan vara vilken typ som helst som kan skrivas till strömmen.

source: Write *data* to the output stream and return the number of items (bytes/characters) written.
sv: Skriv *data* till utdataströmmen och returnera antalet objekt (bytes/tecken) som skrivits.

source: def write_binary(writer: Writer[bytes]): writer.write(b"Hello world!\n")
sv: def write_binary(writer: Writer[bytes]): writer.write(b"Hej världen!\n")

source: See :ref:`typing-io` for other I/O related protocols and classes that can be used for static type checking.
sv: Se :ref:`typing-io` för andra I/O-relaterade protokoll och klasser som kan användas för statisk typkontroll.

source: Performance
sv: Prestanda

source: This section discusses the performance of the provided concrete I/O implementations.
sv: I det här avsnittet diskuteras prestandan för de konkreta I/O-implementeringarna.

source: By reading and writing only large chunks of data even when the user asks for a single byte, buffered I/O hides any inefficiency in calling and executing the operating system's unbuffered I/O routines. The gain depends on the OS and the kind of I/O which is performed. For example, on some modern OSes such as Linux, unbuffered disk I/O can be as fast as buffered I/O. The bottom line, however, is that buffered I/O offers predictable performance regardless of the platform and the backing device. Therefore, it is almost always preferable to use buffered I/O rather than unbuffered I/O for binary data.
sv: Genom att bara läsa och skriva stora bitar data även när användaren ber om en enda byte döljer buffrad I/O ineffektiviteten i anrop och exekvering av operativsystemets obuffrade I/O-rutiner. Vinsten beror på operativsystemet och vilken typ av I/O som utförs. På vissa moderna operativsystem som Linux kan till exempel obuffrad disk-I/O vara lika snabb som buffrad I/O. Slutsatsen är dock att buffrad I/O ger förutsägbar prestanda oavsett plattform och backingenhet. Därför är det nästan alltid att föredra att använda buffrad I/O i stället för obuffrad I/O för binära data.

source: Text I/O over a binary storage (such as a file) is significantly slower than binary I/O over the same storage, because it requires conversions between unicode and binary data using a character codec. This can become noticeable handling huge amounts of text data like large log files. Also, :meth:`~TextIOBase.tell` and :meth:`~TextIOBase.seek` are both quite slow due to the reconstruction algorithm used.
sv: Text-I/O över en binär lagring (t.ex. en fil) är betydligt långsammare än binär I/O över samma lagring, eftersom det krävs konverteringar mellan unicode och binär data med hjälp av en teckenkodek. Detta kan bli märkbart vid hantering av stora mängder textdata, t.ex. stora loggfiler. Dessutom är både :meth:`~TextIOBase.tell` och :meth:`~TextIOBase.seek` ganska långsamma på grund av den rekonstruktionsalgoritm som används.

source: :class:`StringIO`, however, is a native in-memory unicode container and will exhibit similar speed to :class:`BytesIO`.
sv: :class:`StringIO` är dock en inbyggd unicode-behållare i minnet och kommer att uppvisa liknande hastighet som :class:`BytesIO`.

source: :class:`FileIO` objects are thread-safe to the extent that the operating system calls (such as :manpage:`read(2)` under Unix) they wrap are thread-safe too.
sv: :class:`FileIO`-objekt är trådsäkra i den utsträckning som de anrop från operativsystemet (t.ex. :manpage:`read(2)` under Unix) som de omsluter också är trådsäkra.

source: Binary buffered objects (instances of :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` and :class:`BufferedRWPair`) protect their internal structures using a lock; it is therefore safe to call them from multiple threads at once.
sv: Binära buffrade objekt (instanser av :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` och :class:`BufferedRWPair`) skyddar sina interna strukturer med hjälp av ett lås; det är därför säkert att anropa dem från flera trådar samtidigt.

source: :class:`TextIOWrapper` objects are not thread-safe.
sv: :class:`TextIOWrapper`-objekt är inte tråd-säkra.

source: Binary buffered objects (instances of :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` and :class:`BufferedRWPair`) are not reentrant. While reentrant calls will not happen in normal situations, they can arise from doing I/O in a :mod:`signal` handler. If a thread tries to re-enter a buffered object which it is already accessing, a :exc:`RuntimeError` is raised. Note this doesn't prohibit a different thread from entering the buffered object.
sv: Binära buffrade objekt (instanser av :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` och :class:`BufferedRWPair`) är inte reentranta. Även om reentranta anrop inte kommer att ske i normala situationer kan de uppstå när I/O görs i en :mod:`signal`-hanterare. Om en tråd försöker återgå till ett buffrat objekt som den redan har tillgång till, uppstår ett :exc:`RuntimeError`. Observera att detta inte hindrar en annan tråd från att komma in i det buffrade objektet.

source: The above implicitly extends to text files, since the :func:`open` function will wrap a buffered object inside a :class:`TextIOWrapper`. This includes standard streams and therefore affects the built-in :func:`print` function as well.
sv: Ovanstående gäller implicit även textfiler, eftersom funktionen :func:`open` kommer att packa in ett buffrat objekt i en :class:`TextIOWrapper`. Detta inkluderar standardströmmar och påverkar därför även den inbyggda funktionen :func:`print`.

source: file object
sv: filobjekt

source: io module
sv: io-modul

source: universal newlines
sv: universella nya rader

source: io.TextIOWrapper class
sv: io.TextIOWrapper-klass

source: io.IncrementalNewlineDecoder class
sv: io.IncrementalNewlineDecoder-klass
