Repository: yeager/python-docs-sv
Catalog: library/io.po
Languages: sv

source: with open('spam.txt', 'w') as file: file.write('Spam and eggs!')
sv: med open('spam.txt', 'w') som fil: file.write("Skräppost och ägg!")

source: :class:`IOBase` provides these data attributes and methods:
sv: :class:`IOBase` tillhandahåller dessa dataattribut och metoder:

source: Flush and close this stream. This method has no effect if the file is already closed. Once the file is closed, any operation on the file (e.g. reading or writing) will raise a :exc:`ValueError`.
sv: Spola och stäng denna ström. Denna metod har ingen effekt om filen redan är stängd. När filen är stängd kommer alla operationer på filen (t.ex. läsning eller skrivning) att ge upphov till ett :exc:`ValueError`.

source: As a convenience, it is allowed to call this method more than once; only the first call, however, will have an effect.
sv: Som en bekvämlighet är det tillåtet att anropa denna metod mer än en gång; endast det första anropet kommer dock att ha en effekt.

source: ``True`` if the stream is closed.
sv: ``True`` om strömmen är stängd.

source: Return the underlying file descriptor (an integer) of the stream if it exists. An :exc:`OSError` is raised if the IO object does not use a file descriptor.
sv: Returnerar den underliggande filbeskrivaren (ett heltal) för strömmen om den finns. Ett :exc:`OSError` uppstår om IO-objektet inte använder en fildeskriptor.

source: Flush the write buffers of the stream if applicable. This does nothing for read-only and non-blocking streams.
sv: Töm skrivbuffertarna i strömmen om tillämpligt. Detta gör ingenting för skrivskyddade och icke-blockerande strömmar.

source: Return ``True`` if the stream is interactive (i.e., connected to a terminal/tty device).
sv: Returnerar ``True`` om strömmen är interaktiv (d.v.s. ansluten till en terminal/tty-enhet).

source: Return ``True`` if the stream can be read from. If ``False``, :meth:`!read` will raise :exc:`OSError`.
sv: Returnerar ``True`` om strömmen kan läsas från. Om ``False``, kommer :meth:`!read` att ge upphov till :exc:`OSError`.

source: Read and return one line from the stream. If *size* is specified, at most *size* bytes will be read.
sv: Läser och returnerar en rad från strömmen. Om *size* anges kommer högst *size* byte att läsas.

source: The line terminator is always ``b'\n'`` for binary files; for text files, the *newline* argument to :func:`open` can be used to select the line terminator(s) recognized.
sv: Radavslutaren är alltid ``b'\n'`` för binära filer; för textfiler kan argumentet *newline* till :func:`open` användas för att välja den eller de radavslutare som ska identifieras.

source: Read and return a list of lines from the stream. *hint* can be specified to control the number of lines read: no more lines will be read if the total size (in bytes/characters) of all lines so far exceeds *hint*.
sv: Läser och returnerar en lista med rader från strömmen. *hint* kan anges för att styra antalet rader som läses: inga fler rader läses om den totala storleken (i byte/tecken) på alla rader hittills överstiger *hint*.

source: *hint* values of ``0`` or less, as well as ``None``, are treated as no hint.
sv: *hint*-värden på ``0`` eller mindre, liksom ``None``, behandlas som ingen hint.

source: Note that it's already possible to iterate on file objects using ``for line in file: ...`` without calling :meth:`!file.readlines`.
sv: Observera att det redan är möjligt att iterera på filobjekt med ``for line in file: ...`` utan att anropa :meth:`!file.readlines`.

source: Change the stream position to the given byte *offset*, interpreted relative to the position indicated by *whence*, and return the new absolute position. Values for *whence* are:
sv: Ändra strömpositionen till den angivna byten *offset*, tolkad relativt den position som anges av *whence*, och returnera den nya absoluta positionen. Värden för *whence* är:

source: :data:`os.SEEK_SET` or ``0`` -- start of the stream (the default); *offset* should be zero or positive
sv: :data:`os.SEEK_SET` eller ``0`` -- början på strömmen (standard); *offset* ska vara noll eller positiv

source: :data:`os.SEEK_CUR` or ``1`` -- current stream position; *offset* may be negative
sv: :data:`os.SEEK_CUR` eller ``1`` -- aktuell strömposition; *offset* kan vara negativ

source: :data:`os.SEEK_END` or ``2`` -- end of the stream; *offset* is usually negative
sv: :data:`os.SEEK_END` eller ``2`` -- slutet på strömmen; *offset* är vanligtvis negativ

source: The :data:`!SEEK_*` constants.
sv: Konstanterna :data:`!SEEK_*`.

source: Some operating systems could support additional values, like :const:`os.SEEK_HOLE` or :const:`os.SEEK_DATA`. The valid values for a file could depend on it being open in text or binary mode.
sv: Vissa operativsystem kan stödja ytterligare värden, t.ex. :const:`os.SEEK_HOLE` eller :const:`os.SEEK_DATA`. Vilka värden som är giltiga för en fil kan bero på om den öppnas i text- eller binärläge.

source: Return ``True`` if the stream supports random access. If ``False``, :meth:`seek`, :meth:`tell` and :meth:`truncate` will raise :exc:`OSError`.
sv: Returnerar ``True`` om strömmen stöder slumpmässig åtkomst. Om ``False``, kommer :meth:`seek`, :meth:`tell` och :meth:`truncate` att ge upphov till :exc:`OSError`.

source: Return the current stream position.
sv: Returnerar den aktuella positionen för strömmen.

source: Resize the stream to the given *size* in bytes (or the current position if *size* is not specified). The current stream position isn't changed. This resizing can extend or reduce the current file size. In case of extension, the contents of the new file area depend on the platform (on most systems, additional bytes are zero-filled). The new file size is returned.
sv: Ändra storlek på strömmen till den angivna *storleken* i byte (eller den aktuella positionen om *storleken* inte anges). Den aktuella strömpositionen ändras inte. Denna storleksändring kan utöka eller minska den aktuella filstorleken. Vid utökning beror innehållet i det nya filområdet på plattformen (på de flesta system är ytterligare byte nollfyllda). Den nya filstorleken returneras.

source: Windows will now zero-fill files when extending.
sv: Windows nollfyller nu filer vid förlängning.

source: Return ``True`` if the stream supports writing. If ``False``, :meth:`!write` and :meth:`truncate` will raise :exc:`OSError`.
sv: Returnerar ``True`` om strömmen stöder skrivning. Om ``False``, kommer :meth:`!write` och :meth:`truncate` att ge upphov till :exc:`OSError`.

source: Write a list of lines to the stream. Line separators are not added, so it is usual for each of the lines provided to have a line separator at the end.
sv: Skriv en lista med rader till strömmen. Radavgränsare läggs inte till, så det är vanligt att varje rad som tillhandahålls har en radavgränsare i slutet.

source: Prepare for object destruction. :class:`IOBase` provides a default implementation of this method that calls the instance's :meth:`~IOBase.close` method.
sv: Förbered för destruktion av objektet. :class:`IOBase` tillhandahåller en standardimplementering av denna metod som anropar instansens :meth:`~IOBase.close`-metod.

source: Base class for raw binary streams. It inherits from :class:`IOBase`.
sv: Basklass för råa binära strömmar. Den ärver från :class:`IOBase`.

source: Raw binary streams typically provide low-level access to an underlying OS device or API, and do not try to encapsulate it in high-level primitives (this functionality is done at a higher-level in buffered binary streams and text streams, described later in this page).
sv: Råa binära strömmar ger vanligtvis åtkomst på låg nivå till en underliggande OS-enhet eller API och försöker inte kapsla in den i primitiver på hög nivå (denna funktionalitet görs på en högre nivå i buffrade binära strömmar och textströmmar, som beskrivs senare på den här sidan).

source: :class:`RawIOBase` provides these methods in addition to those from :class:`IOBase`:
sv: :class:`RawIOBase` tillhandahåller dessa metoder utöver dem från :class:`IOBase`:

source: Read up to *size* bytes from the object and return them. As a convenience, if *size* is unspecified or -1, all bytes until EOF are returned. Otherwise, only one system call is ever made. Fewer than *size* bytes may be returned if the operating system call returns fewer than *size* bytes.
sv: Läser upp till *size* bytes från objektet och returnerar dem. Om *size* är ospecificerad eller -1 returneras alla byte fram till EOF, som en bekvämlighetsåtgärd. I annat fall görs bara ett enda systemanrop. Färre än *size* byte kan returneras om operativsystemets anrop returnerar färre än *size* byte.

source: If 0 bytes are returned, and *size* was not 0, this indicates end of file. If the object is in non-blocking mode and no bytes are available, ``None`` is returned.
sv: Om 0 byte returneras och *size* inte var 0, indikerar detta slutet på filen. Om objektet är i icke-blockerande läge och inga byte är tillgängliga returneras ``None``.

source: The default implementation defers to :meth:`readall` and :meth:`readinto`.
sv: Standardimplementeringen hänvisar till :meth:`readall` och :meth:`readinto`.

source: Read and return all the bytes from the stream until EOF, using multiple calls to the stream if necessary.
sv: Läs och returnera alla bytes från strömmen till EOF, med flera anrop till strömmen om det behövs.

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b*, and return the number of bytes read. For example, *b* might be a :class:`bytearray`. If the object is in non-blocking mode and no bytes are available, ``None`` is returned.
sv: Läser in byte i ett förallokerat, skrivbart :term:`bytesliknande objekt` *b*, och returnerar antalet lästa byte. Till exempel kan *b* vara en :class:`bytearray`. Om objektet är i icke-blockerande läge och inga bytes är tillgängliga returneras ``None``.

source: Write the given :term:`bytes-like object`, *b*, to the underlying raw stream, and return the number of bytes written. This can be less than the length of *b* in bytes, depending on specifics of the underlying raw stream, and especially if it is in non-blocking mode. ``None`` is returned if the raw stream is set not to block and no single byte could be readily written to it. The caller may release or mutate *b* after this method returns, so the implementation should only access *b* during the method call.
sv: Skriver det angivna :term:`bytesliknande objektet`, *b*, till den underliggande råströmmen och returnerar antalet bytes som skrivits. Detta kan vara mindre än längden på *b* i byte, beroende på detaljerna i den underliggande råströmmen, och särskilt om den är i icke-blockerande läge. ``None`` returneras om råströmmen är inställd på att inte blockera och ingen enskild byte lätt kan skrivas till den. Den som anropar kan frigöra eller mutera *b* efter att denna metod returnerats, så implementationen bör endast komma åt *b* under metodanropet.

source: Base class for binary streams that support some kind of buffering. It inherits from :class:`IOBase`.
sv: Basklass för binära strömmar som stöder någon form av buffring. Den ärver från :class:`IOBase`.

source: The main difference with :class:`RawIOBase` is that methods :meth:`read`, :meth:`readinto` and :meth:`write` will try (respectively) to read as much input as requested or to emit all provided data.
sv: Den största skillnaden med :class:`RawIOBase` är att metoderna :meth:`read`, :meth:`readinto` och :meth:`write` försöker (respektive) läsa så mycket indata som begärs eller att skicka ut all data som tillhandahålls.

source: In addition, if the underlying raw stream is in non-blocking mode, when the system returns would block :meth:`write` will raise :exc:`BlockingIOError` with :attr:`BlockingIOError.characters_written` and :meth:`read` will return data read so far or ``None`` if no data is available.
sv: Dessutom, om den underliggande råströmmen är i icke-blockerande läge, när systemet återgår skulle blockera :meth:`write` kommer att ge upphov till :exc:`BlockingIOError` med :attr:`BlockingIOError.characters_written` och :meth:`read` kommer att returnera data som lästs hittills eller ``None`` om inga data finns tillgängliga.

source: Besides, the :meth:`read` method does not have a default implementation that defers to :meth:`readinto`.
sv: Dessutom har metoden :meth:`read` inte någon standardimplementering som hänvisar till :meth:`readinto`.

source: A typical :class:`BufferedIOBase` implementation should not inherit from a :class:`RawIOBase` implementation, but wrap one, like :class:`BufferedWriter` and :class:`BufferedReader` do.
sv: En typisk :class:`BufferedIOBase`-implementation bör inte ärva från en :class:`RawIOBase`-implementation, utan omsluta en sådan, som :class:`BufferedWriter` och :class:`BufferedReader` gör.

source: :class:`BufferedIOBase` provides or overrides these data attributes and methods in addition to those from :class:`IOBase`:
sv: :class:`BufferedIOBase` tillhandahåller eller åsidosätter dessa dataattribut och metoder utöver dem från :class:`IOBase`:

source: The underlying raw stream (a :class:`RawIOBase` instance) that :class:`BufferedIOBase` deals with. This is not part of the :class:`BufferedIOBase` API and may not exist on some implementations.
sv: Den underliggande råströmmen (en :class:`RawIOBase`-instans) som :class:`BufferedIOBase` hanterar. Detta är inte en del av :class:`BufferedIOBase` API och kanske inte existerar i vissa implementationer.

source: Separate the underlying raw stream from the buffer and return it.
sv: Separera den underliggande råströmmen från bufferten och returnera den.

source: After the raw stream has been detached, the buffer is in an unusable state.
sv: Efter att råströmmen har kopplats bort är bufferten i ett oanvändbart tillstånd.

source: Some buffers, like :class:`BytesIO`, do not have the concept of a single raw stream to return from this method. They raise :exc:`UnsupportedOperation`.
sv: Vissa buffertar, som :class:`BytesIO`, har inte konceptet med en enda rå ström att returnera från den här metoden. De ger upphov till :exc:`UnsupportedOperation`.

source: Read and return up to *size* bytes. If the argument is omitted, ``None``, or negative read as much as possible.
sv: Läser och returnerar upp till *size* bytes. Om argumentet utelämnas, ``None``, eller negativ läs så mycket som möjligt.

source: Fewer bytes may be returned than requested. An empty :class:`bytes` object is returned if the stream is already at EOF. More than one read may be made and calls may be retried if specific errors are encountered, see :meth:`os.read` and :pep:`475` for more details. Less than size bytes being returned does not imply that EOF is imminent.
sv: Färre bytes kan returneras än vad som begärts. Ett tomt :class:`bytes`-objekt returneras om strömmen redan är vid EOF. Mer än en läsning kan göras och anrop kan göras om om specifika fel påträffas, se :meth:`os.read` och :pep:`475` för mer information. Att mindre än en byte returneras betyder inte att EOF är nära förestående.

source: When reading as much as possible the default implementation will use ``raw.readall`` if available (which should implement :meth:`RawIOBase.readall`), otherwise will read in a loop until read returns ``None``, an empty :class:`bytes`, or a non-retryable error. For most streams this is to EOF, but for non-blocking streams more data may become available.
sv: När man läser så mycket som möjligt kommer standardimplementationen att använda ``raw.readall`` om det finns tillgängligt (vilket bör implementera :meth:`RawIOBase.readall``), annars kommer den att läsa i en loop tills read returnerar ``None``, en tom :class:`bytes`, eller ett fel som inte kan retireras. För de flesta flöden är detta till EOF, men för icke-blockerande flöden kan mer data bli tillgänglig.

source: When the underlying raw stream is non-blocking, implementations may either raise :exc:`BlockingIOError` or return ``None`` if no data is available. :mod:`io` implementations return ``None``.
sv: När den underliggande råströmmen är icke-blockerande kan implementationer antingen ge upphov till :exc:`BlockingIOError` eller returnera ``None`` om inga data finns tillgängliga. :mod:`io`-implementationer returnerar ``None``.

source: Read and return up to *size* bytes, calling :meth:`~RawIOBase.readinto` which may retry if :py:const:`~errno.EINTR` is encountered per :pep:`475`. If *size* is ``-1`` or not provided, the implementation will choose an arbitrary value for *size*.
sv: Läser och returnerar upp till *size* bytes, anropar :meth:`~RawIOBase.readinto` som kan försöka igen om :py:const:`~errno.EINTR` påträffas enligt :pep:`475`. Om *size* är ``-1`` eller inte tillhandahålls, kommer implementationen att välja ett godtyckligt värde för *size*.

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b* and return the number of bytes read. For example, *b* might be a :class:`bytearray`.
sv: Läser in bytes i ett förallokerat, skrivbart :term:`bytesliknande objekt` *b* och returnerar antalet lästa bytes. Till exempel kan *b* vara en :class:`bytearray`.

source: Like :meth:`read`, multiple reads may be issued to the underlying raw stream, unless the latter is interactive.
sv: Liksom :meth:`read` kan flera läsningar göras av den underliggande råströmmen, såvida inte den senare är interaktiv.

source: A :exc:`BlockingIOError` is raised if the underlying raw stream is in non blocking-mode, and has no data available at the moment.
sv: Ett :exc:`BlockingIOError` uppstår om den underliggande råströmmen är i icke-blockerande läge och inte har några data tillgängliga för tillfället.

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b*, using at most one call to the underlying raw stream's :meth:`~RawIOBase.read` (or :meth:`~RawIOBase.readinto`) method. Return the number of bytes read.
sv: Läser in bytes i ett förallokerat, skrivbart :term:`bytesliknande objekt` *b*, med högst ett anrop till den underliggande råströmmens :meth:`~RawIOBase.read` (eller :meth:`~RawIOBase.readinto`) metod. Returnerar antalet lästa byte.

source: Write the given :term:`bytes-like object`, *b*, and return the number of bytes written (always equal to the length of *b* in bytes, since if the write fails an :exc:`OSError` will be raised). Depending on the actual implementation, these bytes may be readily written to the underlying stream, or held in a buffer for performance and latency reasons.
sv: Skriv det angivna :term:`bytesliknande objektet`, *b*, och returnera antalet skrivna bytes (alltid lika med längden på *b* i bytes, eftersom om skrivningen misslyckas kommer ett :exc:`OSError` att uppstå). Beroende på den faktiska implementationen kan dessa byte skrivas direkt till den underliggande strömmen eller hållas i en buffert av prestanda- och latensskäl.

source: When in non-blocking mode, a :exc:`BlockingIOError` is raised if the data needed to be written to the raw stream but it couldn't accept all the data without blocking.
sv: I icke-blockerande läge uppstår ett :exc:`BlockingIOError` om data behöver skrivas till råströmmen men den inte kan ta emot all data utan att blockera.

source: The caller may release or mutate *b* after this method returns, so the implementation should only access *b* during the method call.
sv: Anroparen kan frigöra eller mutera *b* efter att denna metod har returnerats, så implementationen bör endast komma åt *b* under metodanropet.

source: Raw File I/O
sv: I/O för rå fil

source: A raw binary stream representing an OS-level file containing bytes data. It inherits from :class:`RawIOBase`.
sv: En rå binär ström som representerar en fil på OS-nivå som innehåller bytesdata. Den ärver från :class:`RawIOBase`.

source: The *name* can be one of two things:
sv: *Namnet* kan vara en av två saker:

source: a character string or :class:`bytes` object representing the path to the file which will be opened. In this case closefd must be ``True`` (the default) otherwise an error will be raised.
sv: en teckensträng eller ett :class:`bytes`-objekt som representerar sökvägen till den fil som ska öppnas. I detta fall måste closefd vara ``True`` (standard) annars kommer ett fel att uppstå.

source: an integer representing the number of an existing OS-level file descriptor to which the resulting :class:`FileIO` object will give access. When the FileIO object is closed this fd will be closed as well, unless *closefd* is set to ``False``.
sv: ett heltal som representerar numret på en befintlig filbeskrivare på OS-nivå som det resulterande :class:`FileIO`-objektet kommer att ge tillgång till. När FileIO-objektet stängs kommer även denna fd att stängas, såvida inte *closefd* är satt till ``False``.

source: The *mode* can be ``'r'``, ``'w'``, ``'x'`` or ``'a'`` for reading (default), writing, exclusive creation or appending. The file will be created if it doesn't exist when opened for writing or appending; it will be truncated when opened for writing. :exc:`FileExistsError` will be raised if it already exists when opened for creating. Opening a file for creating implies writing, so this mode behaves in a similar way to ``'w'``. Add a ``'+'`` to the mode to allow simultaneous reading and writing.
sv: *mode* kan vara ``'r'``, ``'w'``, ``'x'`` eller ``'a'`` för läsning (standard), skrivning, exklusivt skapande eller appending. Filen kommer att skapas om den inte existerar när den öppnas för att skrivas eller läggas till; den kommer att avkortas när den öppnas för att skrivas. :exc:`FileExistsError` kommer att uppstå om den redan existerar när den öppnas för att skapas. Att öppna en fil för skapande innebär skrivning, så detta läge beter sig på ett liknande sätt som ``'w'``. Lägg till ett ``'+'`` till läget för att tillåta samtidig läsning och skrivning.

source: The :meth:`~RawIOBase.read` (when called with a positive argument), :meth:`~RawIOBase.readinto` and :meth:`~RawIOBase.write` methods on this class will only make one system call.
sv: Metoderna :meth:`~RawIOBase.read` (när de anropas med ett positivt argument), :meth:`~RawIOBase.readinto` och :meth:`~RawIOBase.write` för denna klass kommer endast att göra ett systemanrop.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*name*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
sv: En anpassad öppnare kan användas genom att skicka en callable som *opener*. Den underliggande filbeskrivaren för filobjektet erhålls sedan genom att anropa *opener* med (*name*, *flags*). *opener* måste returnera en öppen filbeskrivare (att skicka :mod:`os.open` som *opener* resulterar i funktionalitet som liknar att skicka ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
sv: Den nyskapade filen är :ref:`icke-ärftlig <fd_inheritance>`.

source: See the :func:`open` built-in function for examples on using the *opener* parameter.
sv: Se den inbyggda funktionen :func:`open` för exempel på hur parametern *opener* kan användas.

source: The *opener* parameter was added. The ``'x'`` mode was added.
sv: Parametern *opener* lades till. Läget ``'x'`` lades till.

source: The file is now non-inheritable.
sv: Filen är nu inte ärftlig.

source: :class:`FileIO` provides these data attributes in addition to those from :class:`RawIOBase` and :class:`IOBase`:
sv: :class:`FileIO` tillhandahåller dessa dataattribut i tillägg till dem från :class:`RawIOBase` och :class:`IOBase`:

source: The mode as given in the constructor.
sv: Det läge som anges i konstruktören.

source: The file name. This is the file descriptor of the file when no name is given in the constructor.
sv: Filens namn. Detta är filbeskrivningen för filen om inget namn anges i konstruktorn.
