Repository: yeager/python-docs-sv
Catalog: library/io.po
Languages: sv

source: :mod:`!io` --- Core tools for working with streams
sv: :mod:`!io` --- Kärnverktyg för att arbeta med strömmar

source: **Source code:** :source:`Lib/io.py`
sv: **Källkod:** :source:`Lib/io.py`

source: Overview
sv: Översikt

source: The :mod:`io` module provides Python's main facilities for dealing with various types of I/O. There are three main types of I/O: *text I/O*, *binary I/O* and *raw I/O*. These are generic categories, and various backing stores can be used for each of them. A concrete object belonging to any of these categories is called a :term:`file object`. Other common terms are *stream* and *file-like object*.
sv: Modulen :mod:`io` tillhandahåller Pythons viktigaste funktioner för att hantera olika typer av I/O. Det finns tre huvudtyper av I/O: *text-I/O*, *binär-I/O* och *raw-I/O*. Dessa är generiska kategorier, och olika backing stores kan användas för var och en av dem. Ett konkret objekt som tillhör någon av dessa kategorier kallas för ett :term:`filobjekt`. Andra vanliga termer är *stream* och *filliknande objekt*.

source: Independent of its category, each concrete stream object will also have various capabilities: it can be read-only, write-only, or read-write. It can also allow arbitrary random access (seeking forwards or backwards to any location), or only sequential access (for example in the case of a socket or pipe).
sv: Oberoende av sin kategori kommer varje konkret strömobjekt också att ha olika funktioner: det kan vara skrivskyddat, skrivskyddat eller skrivskyddat. Det kan också tillåta godtycklig slumpmässig åtkomst (sökning framåt eller bakåt till valfri plats), eller endast sekventiell åtkomst (till exempel i fallet med en socket eller pipe).

source: All streams are careful about the type of data you give to them. For example giving a :class:`str` object to the :meth:`!write` method of a binary stream will raise a :exc:`TypeError`. So will giving a :class:`bytes` object to the :meth:`!write` method of a text stream.
sv: Alla strömmar är försiktiga med vilken typ av data du ger till dem. Om du till exempel ger ett :class:`str`-objekt till :meth:`!write`-metoden för en binär ström kommer ett :exc:`TypeError` att uppstå. Detsamma gäller om man ger ett :class:`bytes`-objekt till :meth:`!write`-metoden för en textström.

source: Operations that used to raise :exc:`IOError` now raise :exc:`OSError`, since :exc:`IOError` is now an alias of :exc:`OSError`.
sv: Operationer som tidigare gav upphov till :exc:`IOError` ger nu upphov till :exc:`OSError`, eftersom :exc:`IOError` nu är ett alias för :exc:`OSError`.

source: Text I/O expects and produces :class:`str` objects. This means that whenever the backing store is natively made of bytes (such as in the case of a file), encoding and decoding of data is made transparently as well as optional translation of platform-specific newline characters.
sv: Text-I/O förväntar sig och producerar :class:`str`-objekt. Detta innebär att när backing-lagret är uppbyggt av bytes (som i fallet med en fil), sker kodning och avkodning av data på ett transparent sätt, liksom valfri översättning av plattformsspecifika newline-tecken.

source: The easiest way to create a text stream is with :meth:`open`, optionally specifying an encoding::
sv: Det enklaste sättet att skapa en textström är med :meth:`open`, med möjlighet att ange en kodning::

source: In-memory text streams are also available as :class:`StringIO` objects::
sv: Textflöden i minnet finns också tillgängliga som :class:`StringIO`-objekt::

source: f = io.StringIO("some initial text data")
sv: f = io.StringIO("några inledande textdata")

source: When working with a non-blocking stream, be aware that read operations on text I/O objects might raise a :exc:`BlockingIOError` if the stream cannot perform the operation immediately.
sv: När du arbetar med en icke-blockerande ström bör du vara medveten om att läsoperationer på text-I/O-objekt kan ge upphov till ett :exc:`BlockingIOError` om strömmen inte kan utföra operationen omedelbart.

source: The text stream API is described in detail in the documentation of :class:`TextIOBase`.
sv: API:et för textströmmar beskrivs i detalj i dokumentationen för :class:`TextIOBase`.

source: Binary I/O
sv: Binär I/O

source: Binary I/O (also called *buffered I/O*) expects :term:`bytes-like objects <bytes-like object>` and produces :class:`bytes` objects. No encoding, decoding, or newline translation is performed. This category of streams can be used for all kinds of non-text data, and also when manual control over the handling of text data is desired.
sv: Binär I/O (även kallad *buffrad I/O*) förväntar sig :term:`bytesliknande objekt <bytes-like object>` och producerar :class:`bytes`-objekt. Ingen kodning, avkodning eller översättning av nya rader utförs. Denna kategori av strömmar kan användas för alla typer av data som inte är textdata och även när manuell kontroll över hanteringen av textdata önskas.

source: The easiest way to create a binary stream is with :meth:`open` with ``'b'`` in the mode string::
sv: Det enklaste sättet att skapa en binär ström är med :meth:`open` med ``'b'`` i läget string::

source: f = open("myfile.jpg", "rb")
sv: f = open("minfil.jpg", "rb")

source: In-memory binary streams are also available as :class:`BytesIO` objects::
sv: Binära strömmar i minnet finns också tillgängliga som :class:`BytesIO`-objekt::

source: f = io.BytesIO(b"some initial binary data: \x00\x01")
sv: f = io.BytesIO(b"några inledande binära data: \x00\x01")

source: The binary stream API is described in detail in the docs of :class:`BufferedIOBase`.
sv: API:et för binära strömmar beskrivs i detalj i dokumentationen för :class:`BufferedIOBase`.

source: Other library modules may provide additional ways to create text or binary streams. See :meth:`socket.socket.makefile` for example.
sv: Andra biblioteksmoduler kan tillhandahålla ytterligare sätt att skapa text- eller binärströmmar. Se :meth:`socket.socket.makefile` för exempel.

source: Raw I/O
sv: Rå I/O

source: Raw I/O (also called *unbuffered I/O*) is generally used as a low-level building-block for binary and text streams; it is rarely useful to directly manipulate a raw stream from user code. Nevertheless, you can create a raw stream by opening a file in binary mode with buffering disabled::
sv: Raw I/O (även kallat *obuffrad I/O*) används i allmänhet som en lågnivåbyggsten för binära strömmar och textströmmar; det är sällan användbart att direkt manipulera en raw stream från användarkod. Du kan dock skapa en rå ström genom att öppna en fil i binärt läge med buffring inaktiverad::

source: f = open("myfile.jpg", "rb", buffering=0)
sv: f = open("myfile.jpg", "rb", buffring=0)

source: The raw stream API is described in detail in the docs of :class:`RawIOBase`.
sv: API:et för råa strömmar beskrivs i detalj i dokumentationen för :class:`RawIOBase`.

source: Text Encoding
sv: Teckenuppsättning

source: The default encoding of :class:`TextIOWrapper` and :func:`open` is locale-specific (:func:`locale.getencoding`).
sv: Standardkodningen för :class:`TextIOWrapper` och :func:`open` är lokalspecifik (:func:`locale.getencoding`).

source: However, many developers forget to specify the encoding when opening text files encoded in UTF-8 (e.g. JSON, TOML, Markdown, etc...) since most Unix platforms use UTF-8 locale by default. This causes bugs because the locale encoding is not UTF-8 for most Windows users. For example::
sv: Många utvecklare glömmer dock att ange kodningen när de öppnar textfiler som är kodade i UTF-8 (t.ex. JSON, TOML, Markdown, etc...) eftersom de flesta Unix-plattformar använder UTF-8 locale som standard. Detta orsakar buggar eftersom lokalkodningen inte är UTF-8 för de flesta Windows-användare. Till exempel::

source: # May not work on Windows when non-ASCII characters in the file. with open("README.md") as f: long_description = f.read()
sv: # Fungerar kanske inte på Windows om det finns icke-ASCII-tecken i filen. med open("README.md") som f: long_description = f.read()

source: Accordingly, it is highly recommended that you specify the encoding explicitly when opening text files. If you want to use UTF-8, pass ``encoding="utf-8"``. To use the current locale encoding, ``encoding="locale"`` is supported since Python 3.10.
sv: Därför rekommenderar vi starkt att du anger kodningen explicit när du öppnar textfiler. Om du vill använda UTF-8, skicka ``encoding="utf-8"``. För att använda den aktuella locale-kodningen stöds ``encoding="locale"`` sedan Python 3.10.

source: Python UTF-8 Mode can be used to change the default encoding to UTF-8 from locale-specific encoding.
sv: Python UTF-8 Mode kan användas för att ändra standardkodningen till UTF-8 från lokalspecifik kodning.

source: Python 3.15 will make :ref:`utf8-mode` default.
sv: Python 3.15 kommer att göra :ref:`utf8-mode` till standard.

source: Opt-in EncodingWarning
sv: Opt-in-kodningVarning

source: See :pep:`597` for more details.
sv: Se :pep:`597` för mer information.

source: To find where the default locale encoding is used, you can enable the :option:`-X warn_default_encoding <-X>` command line option or set the :envvar:`PYTHONWARNDEFAULTENCODING` environment variable, which will emit an :exc:`EncodingWarning` when the default encoding is used.
sv: Om du vill veta var standardkodningen för lokala används kan du aktivera kommandoradsalternativet :option:`-X warn_default_encoding <-X>` eller ange miljövariabeln :envvar:`PYTHONWARNDEFAULTENCODING`, som skickar ut en :exc:`EncodingWarning` när standardkodningen används.

source: If you are providing an API that uses :func:`open` or :class:`TextIOWrapper` and passes ``encoding=None`` as a parameter, you can use :func:`text_encoding` so that callers of the API will emit an :exc:`EncodingWarning` if they don't pass an ``encoding``. However, please consider using UTF-8 by default (i.e. ``encoding="utf-8"``) for new APIs.
sv: Om du tillhandahåller ett API som använder :func:`open` eller :class:`TextIOWrapper` och skickar ``encoding=None`` som en parameter, kan du använda :func:`text_encoding` så att anropare av API:et skickar en :exc:`EncodingWarning` om de inte skickar en ``encoding``. Överväg dock att använda UTF-8 som standard (d.v.s. ``encoding="utf-8"``) för nya API:er.

source: High-level Module Interface
sv: Modulgränssnitt på hög nivå

source: An int containing the default buffer size used by the module's buffered I/O classes. :func:`open` uses the file's blksize (as obtained by :func:`os.stat`) if possible.
sv: Ett int som innehåller den standardbuffertstorlek som används av modulens buffrade I/O-klasser. :func:`open` använder filens blksize (som erhålls av :func:`os.stat`) om möjligt.

source: This is an alias for the builtin :func:`open` function.
sv: Detta är ett alias för den inbyggda funktionen :func:`open`.

source: This function raises an :ref:`auditing event <auditing>` ``open`` with arguments *path*, *mode* and *flags*. The *mode* and *flags* arguments may have been modified or inferred from the original call.
sv: Den här funktionen startar en :ref:`auditing event <auditing>``open`` med argumenten *path*, *mode* och *flags*. Argumenten *mode* och *flags* kan ha ändrats eller härletts från det ursprungliga anropet.

source: Opens the provided file with mode ``'rb'``. This function should be used when the intent is to treat the contents as executable code.
sv: Öppnar den angivna filen med läget ``'rb'``. Denna funktion bör användas när avsikten är att behandla innehållet som körbar kod.

source: *path* should be a :class:`str` and an absolute path.
sv: *path* ska vara en :class:`str` och en absolut sökväg.

source: The behavior of this function may be overridden by an earlier call to the :c:func:`PyFile_SetOpenCodeHook`. However, assuming that *path* is a :class:`str` and an absolute path, ``open_code(path)`` should always behave the same as ``open(path, 'rb')``. Overriding the behavior is intended for additional validation or preprocessing of the file.
sv: Den här funktionens beteende kan åsidosättas av ett tidigare anrop till :c:func:`PyFile_SetOpenCodeHook`. Men om man antar att *path* är en :class:`str` och en absolut sökväg, bör ``open_code(path)`` alltid bete sig på samma sätt som ``open(path, 'rb')``. Åsidosättande av beteendet är avsett för ytterligare validering eller förbehandling av filen.

source: This is a helper function for callables that use :func:`open` or :class:`TextIOWrapper` and have an ``encoding=None`` parameter.
sv: Detta är en hjälpfunktion för anropsbara filer som använder :func:`open` eller :class:`TextIOWrapper` och som har en ``encoding=None`` parameter.

source: This function returns *encoding* if it is not ``None``. Otherwise, it returns ``"locale"`` or ``"utf-8"`` depending on :ref:`UTF-8 Mode <utf8-mode>`.
sv: Denna funktion returnerar *encoding* om den inte är ``None``. Annars returnerar den ``"locale"`` eller ``"utf-8"`` beroende på :ref:`UTF-8 Mode <utf8-mode>``.

source: This function emits an :class:`EncodingWarning` if :data:`sys.flags.warn_default_encoding <sys.flags>` is true and *encoding* is ``None``. *stacklevel* specifies where the warning is emitted. For example::
sv: Denna funktion skickar ut en :class:`EncodingWarning` om :data:`sys.flags.warn_default_encoding <sys.flags>` är true och *encoding* är ``None``. *stacklevel* anger varifrån varningen skickas. Till exempel::

source: def read_text(path, encoding=None): encoding = io.text_encoding(encoding) # stacklevel=2 with open(path, encoding) as f: return f.read()
sv: def läs_text(sökväg, kodning=None): encoding = io.text_encoding(encoding) # stacklevel=2 med open(sökväg, kodning) som f: return f.read()

source: In this example, an :class:`EncodingWarning` is emitted for the caller of ``read_text()``.
sv: I det här exemplet skickas en :class:`EncodingWarning` ut till den som anropar ``read_text()``.

source: See :ref:`io-text-encoding` for more information.
sv: Se :ref:`io-text-encoding` för mer information.

source: :func:`text_encoding` returns "utf-8" when UTF-8 mode is enabled and *encoding* is ``None``.
sv: :func:`text_encoding` returnerar "utf-8" när UTF-8-läget är aktiverat och *encoding* är ``None``.

source: This is a compatibility alias for the builtin :exc:`BlockingIOError` exception.
sv: Detta är ett kompatibilitetsalias för det inbyggda undantaget :exc:`BlockingIOError`.

source: An exception inheriting :exc:`OSError` and :exc:`ValueError` that is raised when an unsupported operation is called on a stream.
sv: Ett undantag som ärver :exc:`OSError` och :exc:`ValueError` och som uppstår när en operation som inte stöds anropas på en stream.

source: contains the standard IO streams: :data:`sys.stdin`, :data:`sys.stdout`, and :data:`sys.stderr`.
sv: innehåller de vanliga IO-strömmarna: :data:`sys.stdin`, :data:`sys.stdout` och :data:`sys.stderr`.

source: Class hierarchy
sv: Klasshierarki

source: The implementation of I/O streams is organized as a hierarchy of classes. First :term:`abstract base classes <abstract base class>` (ABCs), which are used to specify the various categories of streams, then concrete classes providing the standard stream implementations.
sv: Implementeringen av I/O-strömmar är organiserad som en hierarki av klasser. Först :term:``abstrakta basklasser <abstract base class>` (ABC), som används för att specificera de olika kategorierna av strömmar, sedan konkreta klasser som tillhandahåller standardimplementeringarna av strömmar.

source: The abstract base classes also provide default implementations of some methods in order to help implementation of concrete stream classes. For example, :class:`BufferedIOBase` provides unoptimized implementations of :meth:`!readinto` and :meth:`!readline`.
sv: De abstrakta basklasserna tillhandahåller också standardimplementeringar av vissa metoder för att underlätta implementeringen av konkreta strömklasser. Till exempel ger :class:`BufferedIOBase` ooptimerade implementationer av :meth:`!readinto` och :meth:`!readline`.

source: At the top of the I/O hierarchy is the abstract base class :class:`IOBase`. It defines the basic interface to a stream. Note, however, that there is no separation between reading and writing to streams; implementations are allowed to raise :exc:`UnsupportedOperation` if they do not support a given operation.
sv: Överst i I/O-hierarkin finns den abstrakta basklassen :class:`IOBase`. Den definierar det grundläggande gränssnittet till en stream. Observera dock att det inte finns någon åtskillnad mellan att läsa och skriva till strömmar; implementationer får höja :exc:`UnsupportedOperation` om de inte stöder en viss operation.

source: The :class:`RawIOBase` ABC extends :class:`IOBase`. It deals with the reading and writing of bytes to a stream. :class:`FileIO` subclasses :class:`RawIOBase` to provide an interface to files in the machine's file system.
sv: ABC:n :class:`RawIOBase` utökar :class:`IOBase`. Den hanterar läsning och skrivning av bytes till en ström. :class:`FileIO` subklassar :class:`RawIOBase` för att tillhandahålla ett gränssnitt till filer i maskinens filsystem.

source: The :class:`BufferedIOBase` ABC extends :class:`IOBase`. It deals with buffering on a raw binary stream (:class:`RawIOBase`). Its subclasses, :class:`BufferedWriter`, :class:`BufferedReader`, and :class:`BufferedRWPair` buffer raw binary streams that are writable, readable, and both readable and writable, respectively. :class:`BufferedRandom` provides a buffered interface to seekable streams. Another :class:`BufferedIOBase` subclass, :class:`BytesIO`, is a stream of in-memory bytes.
sv: ABC för :class:`BufferedIOBase` utökar :class:`IOBase`. Den hanterar buffring på en rå binär ström (:class:`RawIOBase`). Dess underklasser :class:`BufferedWriter`, :class:`BufferedReader` och :class:`BufferedRWPair` buffrar råa binära strömmar som är skrivbara, läsbara respektive både läsbara och skrivbara. :class:`BufferedRandom` ger ett buffrat gränssnitt till sökbara strömmar. En annan underklass till :class:`BufferedIOBase`, :class:`BytesIO`, är en ström av bytes i minnet.

source: The :class:`TextIOBase` ABC extends :class:`IOBase`. It deals with streams whose bytes represent text, and handles encoding and decoding to and from strings. :class:`TextIOWrapper`, which extends :class:`TextIOBase`, is a buffered text interface to a buffered raw stream (:class:`BufferedIOBase`). Finally, :class:`StringIO` is an in-memory stream for text.
sv: ABC:s :class:`TextIOBase` utökar :class:`IOBase`. Den hanterar strömmar vars bytes representerar text och hanterar kodning och avkodning till och från strängar. :class:`TextIOWrapper`, som utökar :class:`TextIOBase`, är ett buffrat textgränssnitt till en buffrad råström (:class:`BufferedIOBase`). Slutligen är :class:`StringIO` en minnesbaserad ström för text.

source: Argument names are not part of the specification, and only the arguments of :func:`open` are intended to be used as keyword arguments.
sv: Argumentnamn är inte en del av specifikationen, och endast argumenten i :func:`open` är avsedda att användas som nyckelordsargument.

source: The following table summarizes the ABCs provided by the :mod:`io` module:
sv: I följande tabell sammanfattas de ABC-kunskaper som tillhandahålls av modulen :mod:`io`:

source: Inherits
sv: Ärver

source: Stub Methods
sv: Stubbmetoder

source: Mixin Methods and Properties
sv: Mixin-metoder och -egenskaper

source: ``fileno``, ``seek``, and ``truncate``
sv: ``fileno``, ``seek`` och ``truncate``

source: ``close``, ``closed``, ``__enter__``, ``__exit__``, ``flush``, ``isatty``, ``__iter__``, ``__next__``, ``readable``, ``readline``, ``readlines``, ``seekable``, ``tell``, ``writable``, and ``writelines``
sv: ``close``, ``closed``, ``__enter__``, ``__exit__``, ``flush``, ``isatty``, ``__iter__``, ``__next__``, ``readable``, ``readline``, ``readlines``, ``seekable``, ``tell``, ``writable`` och ``writelines``

source: ``readinto`` and ``write``
sv: "läsa in i" och "skriva in i

source: Inherited :class:`IOBase` methods, ``read``, and ``readall``
sv: Ärvde :class:`IOBase`-metoder, ``read`` och ``readall``

source: ``detach``, ``read``, ``read1``, and ``write``
sv: ``detach``, ``read``, ``read1`` och ``write``

source: Inherited :class:`IOBase` methods, ``readinto``, and ``readinto1``
sv: Ärvda :class:`IOBase`-metoder, ``readinto`` och ``readinto1``

source: ``detach``, ``read``, ``readline``, and ``write``
sv: ``detach``, ``read``, ``readline`` och ``write``

source: Inherited :class:`IOBase` methods, ``encoding``, ``errors``, and ``newlines``
sv: Ärvde :class:`IOBase` metoder, ``encoding``, ``errors`` och ``newlines``

source: I/O Base Classes
sv: I/O-basklasser

source: The abstract base class for all I/O classes.
sv: Den abstrakta basklassen för alla I/O-klasser.

source: This class provides empty abstract implementations for many methods that derived classes can override selectively; the default implementations represent a file that cannot be read, written or seeked.
sv: Denna klass tillhandahåller tomma abstrakta implementeringar för många metoder som härledda klasser kan åsidosätta selektivt; standardimplementeringarna representerar en fil som inte kan läsas, skrivas eller sökas.

source: Even though :class:`IOBase` does not declare :meth:`!read` or :meth:`!write` because their signatures will vary, implementations and clients should consider those methods part of the interface. Also, implementations may raise a :exc:`ValueError` (or :exc:`UnsupportedOperation`) when operations they do not support are called.
sv: Även om :class:`IOBase` inte deklarerar :meth:`!read` eller :meth:`!write` eftersom deras signaturer kommer att variera, bör implementationer och klienter betrakta dessa metoder som en del av gränssnittet. Implementationer kan också ge upphov till ett :exc:`ValueError` (eller :exc:`UnsupportedOperation`) när operationer som de inte stöder anropas.

source: The basic type used for binary data read from or written to a file is :class:`bytes`. Other :term:`bytes-like objects <bytes-like object>` are accepted as method arguments too. Text I/O classes work with :class:`str` data.
sv: Den grundläggande typen som används för binära data som läses från eller skrivs till en fil är :class:`bytes`. Andra :term:`bytes-liknande objekt <bytes-like object>` accepteras också som metodargument. Text-I/O-klasser arbetar med :class:`str`-data.

source: Note that calling any method (even inquiries) on a closed stream is undefined. Implementations may raise :exc:`ValueError` in this case.
sv: Observera att anrop av någon metod (även förfrågningar) på en stängd ström är odefinierat. Implementationer kan ge upphov till :exc:`ValueError` i detta fall.

source: :class:`IOBase` (and its subclasses) supports the iterator protocol, meaning that an :class:`IOBase` object can be iterated over yielding the lines in a stream. Lines are defined slightly differently depending on whether the stream is a binary stream (yielding bytes), or a text stream (yielding character strings). See :meth:`~IOBase.readline` below.
sv: :class:`IOBase` (och dess underklasser) stöder iteratorprotokollet, vilket innebär att ett :class:`IOBase`-objekt kan itereras över, vilket ger raderna i en ström. Rader definieras något olika beroende på om strömmen är en binär ström (ger bytes) eller en textström (ger teckensträngar). Se :meth:`~IOBase.readline` nedan.

source: :class:`IOBase` is also a context manager and therefore supports the :keyword:`with` statement. In this example, *file* is closed after the :keyword:`!with` statement's suite is finished---even if an exception occurs::
sv: :class:`IOBase` är också en kontexthanterare och stöder därför :keyword:`with`-satsen. I det här exemplet stängs *fil* efter att :keyword:`!with`-satsens svit är klar - även om ett undantag inträffar::
