Repository: yeager/python-docs-sv
Catalog: library/io.po
Languages: sv

source: Buffered Streams
sv: Buffrade vattendrag

source: Buffered I/O streams provide a higher-level interface to an I/O device than raw I/O does.
sv: Buffrade I/O-strömmar ger ett gränssnitt på högre nivå till en I/O-enhet än vad rå I/O gör.

source: A binary stream using an in-memory bytes buffer. It inherits from :class:`BufferedIOBase`. The buffer is discarded when the :meth:`~IOBase.close` method is called.
sv: En binär ström som använder en bytesbuffert i minnet. Den ärver från :class:`BufferedIOBase`. Bufferten kasseras när metoden :meth:`~IOBase.close` anropas.

source: The optional argument *initial_bytes* is a :term:`bytes-like object` that contains initial data.
sv: Det valfria argumentet *initial_bytes* är ett :term:`bytesliknande objekt` som innehåller initialdata.

source: :class:`BytesIO` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
sv: :class:`BytesIO` tillhandahåller eller åsidosätter dessa metoder utöver dem från :class:`BufferedIOBase` och :class:`IOBase`:

source: Return a readable and writable view over the contents of the buffer without copying them. Also, mutating the view will transparently update the contents of the buffer::
sv: Returnerar en läsbar och skrivbar vy över innehållet i bufferten utan att kopiera det. Om du ändrar vyn kommer du också att uppdatera innehållet i bufferten på ett transparent sätt::

source: >>> b = io.BytesIO(b"abcdef") >>> view = b.getbuffer() >>> view[2:4] = b"56" >>> b.getvalue() b'ab56ef'
sv: >>> b = io.BytesIO(b"abcdef") >>> vy = b.hämta buffert() >>> vy[2:4] = b"56" >>> b.getvalue() b'ab56ef'

source: As long as the view exists, the :class:`BytesIO` object cannot be resized or closed.
sv: Så länge vyn finns kan objektet :class:`BytesIO` inte ändras i storlek eller stängas.

source: Return :class:`bytes` containing the entire contents of the buffer.
sv: Returnerar :class:`bytes` som innehåller hela innehållet i bufferten.

source: In :class:`BytesIO`, this is the same as :meth:`~BufferedIOBase.read`.
sv: I :class:`BytesIO` är detta samma sak som :meth:`~BufferedIOBase.read`.

source: The *size* argument is now optional.
sv: Argumentet *size* är nu valfritt.

source: In :class:`BytesIO`, this is the same as :meth:`~BufferedIOBase.readinto`.
sv: I :class:`BytesIO` är detta samma sak som :meth:`~BufferedIOBase.readinto`.

source: A buffered binary stream providing higher-level access to a readable, non seekable :class:`RawIOBase` raw binary stream. It inherits from :class:`BufferedIOBase`.
sv: En buffrad binär ström som ger tillgång på högre nivå till en läsbar, icke sökbar :class:`RawIOBase` rå binär ström. Den ärver från :class:`BufferedIOBase`.

source: When reading data from this object, a larger amount of data may be requested from the underlying raw stream, and kept in an internal buffer. The buffered data can then be returned directly on subsequent reads.
sv: När data läses från detta objekt kan en större mängd data begäras från den underliggande råströmmen och förvaras i en intern buffert. Den buffrade datan kan sedan returneras direkt vid efterföljande läsningar.

source: The constructor creates a :class:`BufferedReader` for the given readable *raw* stream and *buffer_size*. If *buffer_size* is omitted, :data:`DEFAULT_BUFFER_SIZE` is used.
sv: Konstruktorn skapar en :class:`BufferedReader` för den givna läsbara *raw*-strömmen och *buffer_size*. Om *buffer_size* utelämnas används :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedReader` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
sv: :class:`BufferedReader` tillhandahåller eller åsidosätter dessa metoder utöver dem från :class:`BufferedIOBase` och :class:`IOBase`:

source: Return bytes from the stream without advancing the position. The number of bytes returned may be less or more than requested. If the underlying raw stream is non-blocking and the operation would block, returns empty bytes.
sv: Returnerar byte från strömmen utan att flytta fram positionen. Antalet bytes som returneras kan vara färre eller fler än vad som begärts. Om den underliggande råströmmen är icke-blockerande och operationen skulle blockera, returneras tomma bytes.

source: In :class:`BufferedReader` this is the same as :meth:`io.BufferedIOBase.read`
sv: I :class:`BufferedReader` är detta samma sak som :meth:`io.BufferedIOBase.read`

source: In :class:`BufferedReader` this is the same as :meth:`io.BufferedIOBase.read1`
sv: I :class:`BufferedReader` är detta samma sak som :meth:`io.BufferedIOBase.read1`

source: A buffered binary stream providing higher-level access to a writeable, non seekable :class:`RawIOBase` raw binary stream. It inherits from :class:`BufferedIOBase`.
sv: En buffrad binär ström som ger tillgång på högre nivå till en skrivbar, icke sökbar :class:`RawIOBase` rå binär ström. Den ärver från :class:`BufferedIOBase`.

source: When writing to this object, data is normally placed into an internal buffer. The buffer will be written out to the underlying :class:`RawIOBase` object under various conditions, including:
sv: När man skriver till detta objekt placeras data normalt i en intern buffert. Bufferten kommer att skrivas ut till det underliggande :class:`RawIOBase`-objektet under olika förhållanden, inklusive:

source: when the buffer gets too small for all pending data;
sv: när bufferten blir för liten för alla väntande data;

source: when :meth:`flush` is called;
sv: när :meth:`flush` anropas;

source: when a :meth:`~IOBase.seek` is requested (for :class:`BufferedRandom` objects);
sv: när en :meth:`~IOBase.seek` begärs (för :class:`BufferedRandom`-objekt);

source: when the :class:`BufferedWriter` object is closed or destroyed.
sv: när :class:`BufferedWriter`-objektet stängs eller förstörs.

source: The constructor creates a :class:`BufferedWriter` for the given writeable *raw* stream. If the *buffer_size* is not given, it defaults to :data:`DEFAULT_BUFFER_SIZE`.
sv: Konstruktorn skapar en :class:`BufferedWriter` för den givna skrivbara *raw*-strömmen. Om *buffer_size* inte anges är standardvärdet :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedWriter` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
sv: :class:`BufferedWriter` tillhandahåller eller åsidosätter dessa metoder utöver dem från :class:`BufferedIOBase` och :class:`IOBase`:

source: Force bytes held in the buffer into the raw stream. A :exc:`BlockingIOError` should be raised if the raw stream blocks.
sv: Tvingar byte som finns i bufferten in i råströmmen. Ett :exc:`BlockingIOError` bör uppstå om den råa strömmen blockeras.

source: Write the :term:`bytes-like object`, *b*, and return the number of bytes written. When in non-blocking mode, a :exc:`BlockingIOError` with :attr:`BlockingIOError.characters_written` set is raised if the buffer needs to be written out but the raw stream blocks.
sv: Skriv det :term:`bytesliknande objektet`, *b*, och returnera antalet skrivna byte. I icke-blockerande läge uppstår ett :exc:`BlockingIOError` med :attr:`BlockingIOError.characters_written` inställt om bufferten behöver skrivas ut men råströmmen blockerar.

source: A buffered binary stream providing higher-level access to a seekable :class:`RawIOBase` raw binary stream. It inherits from :class:`BufferedReader` and :class:`BufferedWriter`.
sv: En buffrad binär ström som ger tillgång på högre nivå till en sökbar :class:`RawIOBase` rå binär ström. Den ärver från :class:`BufferedReader` och :class:`BufferedWriter`.

source: The constructor creates a reader and writer for a seekable raw stream, given in the first argument. If the *buffer_size* is omitted it defaults to :data:`DEFAULT_BUFFER_SIZE`.
sv: Konstruktorn skapar en läsare och skrivare för en sökbar råström, som anges i det första argumentet. Om *buffer_size* utelämnas är standardvärdet :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedRandom` is capable of anything :class:`BufferedReader` or :class:`BufferedWriter` can do. In addition, :meth:`~IOBase.seek` and :meth:`~IOBase.tell` are guaranteed to be implemented.
sv: :class:`BufferedRandom` kan göra allt som :class:`BufferedReader` eller :class:`BufferedWriter` kan göra. Dessutom är :meth:`~IOBase.seek` och :meth:`~IOBase.tell` garanterat implementerade.

source: A buffered binary stream providing higher-level access to two non seekable :class:`RawIOBase` raw binary streams---one readable, the other writeable. It inherits from :class:`BufferedIOBase`.
sv: En buffrad binär ström som ger tillgång på högre nivå till två icke sökbara :class:`RawIOBase` råa binära strömmar---den ena läsbar, den andra skrivbar. Den ärver från :class:`BufferedIOBase`.

source: *reader* and *writer* are :class:`RawIOBase` objects that are readable and writeable respectively. If the *buffer_size* is omitted it defaults to :data:`DEFAULT_BUFFER_SIZE`.
sv: *reader* och *writer* är :class:`RawIOBase`-objekt som är läsbara respektive skrivbara. Om *buffer_size* utelämnas är standardvärdet :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedRWPair` implements all of :class:`BufferedIOBase`\'s methods except for :meth:`~BufferedIOBase.detach`, which raises :exc:`UnsupportedOperation`.
sv: :class:`BufferedRWPair` implementerar alla :class:`BufferedIOBase`:s metoder utom :meth:`~BufferedIOBase.detach`, som ger upphov till :exc:`UnsupportedOperation`.

source: :class:`BufferedRWPair` does not attempt to synchronize accesses to its underlying raw streams. You should not pass it the same object as reader and writer; use :class:`BufferedRandom` instead.
sv: :class:`BufferedRWPair` försöker inte synkronisera åtkomst till sina underliggande råströmmar. Du bör inte skicka samma objekt till den som läsare och skrivare; använd :class:`BufferedRandom` istället.

source: Base class for text streams. This class provides a character and line based interface to stream I/O. It inherits from :class:`IOBase`.
sv: Basklass för textströmmar. Denna klass ger ett tecken- och radbaserat gränssnitt för strömmens I/O. Den ärver från :class:`IOBase`.

source: :class:`TextIOBase` provides or overrides these data attributes and methods in addition to those from :class:`IOBase`:
sv: :class:`TextIOBase` tillhandahåller eller åsidosätter dessa dataattribut och metoder utöver dem från :class:`IOBase`:

source: The name of the encoding used to decode the stream's bytes into strings, and to encode strings into bytes.
sv: Namnet på den kodning som används för att avkoda strömmens bytes till strängar och för att koda strängar till bytes.

source: The error setting of the decoder or encoder.
sv: Felinställningen för avkodaren eller kodaren.

source: A string, a tuple of strings, or ``None``, indicating the newlines translated so far. Depending on the implementation and the initial constructor flags, this may not be available.
sv: En sträng, en tupel av strängar eller ``None``, som anger de nya linjer som hittills översatts. Beroende på implementationen och de initiala konstruktörsflaggorna kanske detta inte är tillgängligt.

source: The underlying binary buffer (a :class:`BufferedIOBase` or :class:`RawIOBase` instance) that :class:`TextIOBase` deals with. This is not part of the :class:`TextIOBase` API and may not exist in some implementations.
sv: Den underliggande binära bufferten (en :class:`BufferedIOBase` eller :class:`RawIOBase` instans) som :class:`TextIOBase` hanterar. Detta är inte en del av :class:`TextIOBase` API och kanske inte finns i vissa implementationer.

source: Separate the underlying binary buffer from the :class:`TextIOBase` and return it.
sv: Separera den underliggande binära bufferten från :class:`TextIOBase` och returnera den.

source: After the underlying buffer has been detached, the :class:`TextIOBase` is in an unusable state.
sv: Efter att den underliggande bufferten har tagits bort är :class:`TextIOBase` i ett oanvändbart tillstånd.

source: Some :class:`TextIOBase` implementations, like :class:`StringIO`, may not have the concept of an underlying buffer and calling this method will raise :exc:`UnsupportedOperation`.
sv: Vissa :class:`TextIOBase` implementationer, som :class:`StringIO`, kanske inte har konceptet med en underliggande buffert och att anropa denna metod kommer att ge upphov till :exc:`UnsupportedOperation`.

source: Read and return at most *size* characters from the stream as a single :class:`str`. If *size* is negative or ``None``, reads until EOF.
sv: Läser och returnerar högst *storlek* tecken från strömmen som en enda :class:`str`. Om *storlek* är negativ eller ``None``, läses till EOF.

source: Read until newline or EOF and return a single :class:`str`. If the stream is already at EOF, an empty string is returned.
sv: Läser till newline eller EOF och returnerar en enda :class:`str`. Om strömmen redan är vid EOF returneras en tom sträng.

source: If *size* is specified, at most *size* characters will be read.
sv: Om *size* anges kommer högst *size* tecken att läsas.

source: Change the stream position to the given *offset*. Behaviour depends on the *whence* parameter. The default value for *whence* is :data:`!SEEK_SET`.
sv: Ändra strömpositionen till den angivna *offset*. Beteendet beror på parametern *whence*. Standardvärdet för *whence* är :data:`!SEEK_SET`.

source: :data:`!SEEK_SET` or ``0``: seek from the start of the stream (the default); *offset* must either be a number returned by :meth:`TextIOBase.tell`, or zero. Any other *offset* value produces undefined behaviour.
sv: :data:`!SEEK_SET` eller ``0``: söker från början av strömmen (standard); *offset* måste antingen vara ett tal som returneras av :meth:`TextIOBase.tell`, eller noll. Alla andra *offset*-värden ger ett odefinierat beteende.

source: :data:`!SEEK_CUR` or ``1``: "seek" to the current position; *offset* must be zero, which is a no-operation (all other values are unsupported).
sv: :data:`!SEEK_CUR` eller ``1``: "Sök" till den aktuella positionen; *offset* måste vara noll, vilket är en no-operation (alla andra värden stöds inte).

source: :data:`!SEEK_END` or ``2``: seek to the end of the stream; *offset* must be zero (all other values are unsupported).
sv: :data:`!SEEK_END` eller ``2``: sök till slutet av strömmen; *offset* måste vara noll (alla andra värden stöds inte).

source: Return the new absolute position as an opaque number.
sv: Returnerar den nya absoluta positionen som ett opakt tal.

source: Return the current stream position as an opaque number. The number does not usually represent a number of bytes in the underlying binary storage.
sv: Returnerar den aktuella strömpositionen som ett ogenomskinligt tal. Numret representerar vanligtvis inte ett antal byte i den underliggande binära lagringen.

source: Write the string *s* to the stream and return the number of characters written.
sv: Skriv strängen *s* till strömmen och returnera antalet tecken som skrivits.

source: A buffered text stream providing higher-level access to a :class:`BufferedIOBase` buffered binary stream. It inherits from :class:`TextIOBase`.
sv: En buffrad textström som ger tillgång på högre nivå till en buffrad binär ström av typen :class:`BufferedIOBase`. Den ärver från :class:`TextIOBase`.

source: *encoding* gives the name of the encoding that the stream will be decoded or encoded with. In :ref:`UTF-8 Mode <utf8-mode>`, this defaults to UTF-8. Otherwise, it defaults to :func:`locale.getencoding`. ``encoding="locale"`` can be used to specify the current locale's encoding explicitly. See :ref:`io-text-encoding` for more information.
sv: *encoding* anger namnet på den kodning som strömmen ska avkodas eller kodas med. I :ref:`UTF-8 Mode <utf8-mode>` är standardvärdet UTF-8. Annars är standardvärdet :func:`locale.getencoding`. ``encoding="locale"`` kan användas för att ange den aktuella lokalens kodning explicit. Se :ref:`io-text-encoding` för mer information.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled. Pass ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error (the default of ``None`` has the same effect), or pass ``'ignore'`` to ignore errors. (Note that ignoring encoding errors can lead to data loss.) ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data. ``'backslashreplace'`` causes malformed data to be replaced by a backslashed escape sequence. When writing, ``'xmlcharrefreplace'`` (replace with the appropriate XML character reference) or ``'namereplace'`` (replace with ``\N{...}`` escape sequences) can be used. Any other error handling name that has been registered with :func:`codecs.register_error` is also valid.
sv: *errors* är en valfri sträng som anger hur kodnings- och avkodningsfel ska hanteras. Ange ``'strict'`` för att skapa ett :exc:`ValueError` undantag om det finns ett kodningsfel (standardvärdet ``None`` har samma effekt), eller ange ``'ignore'`` för att ignorera fel. (Observera att ignorering av kodningsfel kan leda till dataförlust.) ``'replace'`` gör att en ersättningsmarkör (t.ex. ``'?'``) infogas där det finns felaktiga data. ``'backslashreplace'`` gör att felaktiga data ersätts med en bakåtstreckad escape-sekvens. Vid skrivning kan ``'xmlcharrefreplace'`` (ersätter med lämplig XML-teckenreferens) eller ``'namereplace'`` (ersätter med ``N{...}`` escape-sekvenser) användas. Alla andra felhanteringsnamn som har registrerats med :func:`codecs.register_error` är också giltiga.

source: *newline* controls how line endings are handled. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
sv: *newline* styr hur radavslut ska hanteras. Den kan vara ``None``, ``''``, ``'\n'``, ``'\r'`` och ``'\r\n'``. Det fungerar på följande sätt:

source: When reading input from the stream, if *newline* is ``None``, :term:`universal newlines` mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If *newline* is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If *newline* has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
sv: Om *newline* är ``None`` aktiveras :term:`universal newlines`-läget när indata läses från strömmen. Rader i inmatningen kan sluta på ``'\n'``, ``'\r'`` eller ``'\r\n'``, och dessa översätts till ``'\n'`` innan de returneras till den som anropar. Om *newline* är ``''`` aktiveras universal newlines mode, men radavslut returneras till uppringaren oöversatta. Om *newline* har något av de andra lagliga värdena avslutas inmatningsraderna endast med den angivna strängen, och radavslutningen returneras till den som ringer upp utan att översättas.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
sv: Om *newline* är ``None`` när utdata skrivs till strömmen, översätts alla ``'\n'``-tecken som skrivs till systemets standardradavgränsare, :data:`os.linesep`. Om *newline* är ``''`` eller ``'\n'`` sker ingen översättning. Om *newline* är något av de andra lagliga värdena översätts alla ``'\n'``-tecken som skrivs till den angivna strängen.

source: If *line_buffering* is ``True``, :meth:`~IOBase.flush` is implied when a call to write contains a newline character or a carriage return.
sv: Om *line_buffering* är ``True``, är :meth:`~IOBase.flush` implicit när ett anrop till write innehåller ett tecken för ny rad eller en vagnsretur.

source: If *write_through* is ``True``, calls to :meth:`~BufferedIOBase.write` are guaranteed not to be buffered: any data written on the :class:`TextIOWrapper` object is immediately handled to its underlying binary *buffer*.
sv: Om *write_through* är ``True`` garanteras att anrop till :meth:`~BufferedIOBase.write` inte buffras: all data som skrivs på :class:`TextIOWrapper`-objektet hanteras omedelbart till dess underliggande binära *buffer*.

source: The *write_through* argument has been added.
sv: Argumentet *write_through* har lagts till.

source: The default *encoding* is now ``locale.getpreferredencoding(False)`` instead of ``locale.getpreferredencoding()``. Don't change temporary the locale encoding using :func:`locale.setlocale`, use the current locale encoding instead of the user preferred encoding.
sv: Standard *kodning* är nu ``locale.getpreferredencoding(False)`` istället för ``locale.getpreferredencoding()``. Ändra inte tillfälligt den lokala kodningen med :func:`locale.setlocale`, använd den aktuella lokala kodningen istället för den kodning som användaren föredrar.

source: The *encoding* argument now supports the ``"locale"`` dummy encoding name.
sv: Argumentet *encoding* stöder nu det fiktiva kodningsnamnet ``"locale"``.

source: When the underlying raw stream is non-blocking, a :exc:`BlockingIOError` may be raised if a read operation cannot be completed immediately.
sv: När den underliggande råströmmen är icke-blockerande kan ett :exc:`BlockingIOError` uppstå om en läsoperation inte kan slutföras omedelbart.

source: :class:`TextIOWrapper` provides these data attributes and methods in addition to those from :class:`TextIOBase` and :class:`IOBase`:
sv: :class:`TextIOWrapper` tillhandahåller dessa dataattribut och metoder utöver dem från :class:`TextIOBase` och :class:`IOBase`:

source: Whether line buffering is enabled.
sv: Om linjebuffring är aktiverad.

source: Whether writes are passed immediately to the underlying binary buffer.
sv: Om skrivningar skickas omedelbart till den underliggande binära bufferten.

source: Reconfigure this text stream using new settings for *encoding*, *errors*, *newline*, *line_buffering* and *write_through*.
sv: Omkonfigurera denna textström med nya inställningar för *kodning*, *fel*, *ny rad*, *linje_buffring* och *skrivgenomgång*.

source: Parameters not specified keep current settings, except ``errors='strict'`` is used when *encoding* is specified but *errors* is not specified.
sv: Parametrar som inte anges behåller aktuella inställningar, förutom ``errors='strict'`` som används när *encoding* anges men *errors* inte anges.

source: It is not possible to change the encoding or newline if some data has already been read from the stream. On the other hand, changing encoding after write is possible.
sv: Det är inte möjligt att ändra kodning eller newline om data redan har lästs från flödet. Å andra sidan är det möjligt att ändra kodning efter skrivning.

source: This method does an implicit stream flush before setting the new parameters.
sv: Denna metod gör en implicit strömspolning innan de nya parametrarna ställs in.

source: The method supports ``encoding="locale"`` option.
sv: Metoden stöder alternativet ``encoding="locale"``.

source: Set the stream position. Return the new stream position as an :class:`int`.
sv: Ställ in strömpositionen. Returnera den nya strömpositionen som en :class:`int`.

source: Four operations are supported, given by the following argument combinations:
sv: Det finns stöd för fyra operationer, som beskrivs med följande argumentkombinationer:

source: ``seek(0, SEEK_SET)``: Rewind to the start of the stream.
sv: ``seek(0, SEEK_SET)``: Spola tillbaka till början av strömmen.

source: ``seek(cookie, SEEK_SET)``: Restore a previous position; *cookie* **must be** a number returned by :meth:`tell`.
sv: ``seek(cookie, SEEK_SET)``: Återställer en tidigare position; *cookie* **måste vara** ett nummer som returnerats av :meth:`tell`.
