Repository: yeager/python-docs-sv
Catalog: library/logging.config.po
Languages: sv

source: ``filters`` can take filter instances in addition to ids.
sv: ``filters`` kan ta filterinstanser i tillägg till id:n.

source: All *other* keys are passed through as keyword arguments to the handler's constructor. For example, given the snippet:
sv: Alla *andra* nycklar skickas som nyckelordsargument till hanterarens konstruktör. Till exempel, med tanke på utdraget:

source: handlers: console: class : logging.StreamHandler formatter: brief level : INFO filters: [allow_foo] stream : ext://sys.stdout file: class : logging.handlers.RotatingFileHandler formatter: precise filename: logconfig.log maxBytes: 1024 backupCount: 3
sv: handläggare: konsol: klass : loggning.StreamHandler formaterare: kort nivå: INFO filter: [allow_foo] ström : ext://sys.stdout fil : stdout klass : logging.handlers.RotatingFileHandler formaterare: exakt filnamn: logconfig.log maxBytes: 1024 backupCount: 3

source: the handler with id ``console`` is instantiated as a :class:`logging.StreamHandler`, using ``sys.stdout`` as the underlying stream. The handler with id ``file`` is instantiated as a :class:`logging.handlers.RotatingFileHandler` with the keyword arguments ``filename='logconfig.log', maxBytes=1024, backupCount=3``.
sv: hanteraren med id ``console`` instansieras som en :class:`logging.StreamHandler`, med ``sys.stdout`` som underliggande ström. Hanteraren med id ``file`` instansieras som en :class:`logging.handlers.RotatingFileHandler`` med nyckelordsargumenten ``filnamn='logconfig.log', maxBytes=1024, backupCount=3``.

source: *loggers* - the corresponding value will be a dict in which each key is a logger name and each value is a dict describing how to configure the corresponding Logger instance.
sv: *loggers* - motsvarande värde kommer att vara ett dict där varje nyckel är ett loggernamn och varje värde är ett dict som beskriver hur man konfigurerar motsvarande Logger-instans.

source: ``level`` (optional). The level of the logger.
sv: ``level`` (valfritt). Loggarens nivå.

source: ``propagate`` (optional). The propagation setting of the logger.
sv: ``propagate`` (valfritt). Loggerns inställning för spridning.

source: ``filters`` (optional). A list of ids of the filters for this logger.
sv: ``filters`` (valfritt). En lista med id:n för filtren för den här loggern.

source: ``handlers`` (optional). A list of ids of the handlers for this logger.
sv: ``handlers`` (valfritt). En lista med id:n för handläggarna för denna logger.

source: The specified loggers will be configured according to the level, propagation, filters and handlers specified.
sv: De angivna loggarna kommer att konfigureras enligt den nivå, spridning, de filter och de hanterare som anges.

source: *root* - this will be the configuration for the root logger. Processing of the configuration will be as for any logger, except that the ``propagate`` setting will not be applicable.
sv: *root* - detta är konfigurationen för rotloggaren. Konfigurationen bearbetas på samma sätt som för alla loggar, förutom att inställningen ``propagate`` inte är tillämplig.

source: *incremental* - whether the configuration is to be interpreted as incremental to the existing configuration. This value defaults to ``False``, which means that the specified configuration replaces the existing configuration with the same semantics as used by the existing :func:`fileConfig` API.
sv: *incremental* - om konfigurationen ska tolkas som inkrementell till den befintliga konfigurationen. Standardvärdet är ``False``, vilket innebär att den angivna konfigurationen ersätter den befintliga konfigurationen med samma semantik som används av det befintliga API:et :func:`fileConfig`.

source: If the specified value is ``True``, the configuration is processed as described in the section on :ref:`logging-config-dict-incremental`.
sv: Om det angivna värdet är ``True`` bearbetas konfigurationen enligt beskrivningen i avsnittet om :ref:`logging-config-dict-incremental`.

source: *disable_existing_loggers* - whether any existing non-root loggers are to be disabled. This setting mirrors the parameter of the same name in :func:`fileConfig`. If absent, this parameter defaults to ``True``. This value is ignored if *incremental* is ``True``.
sv: *disable_existing_loggers* - om alla befintliga loggar som inte är rotloggar ska inaktiveras. Denna inställning speglar parametern med samma namn i :func:`fileConfig`. Om parametern saknas är standardvärdet ``True``. Detta värde ignoreras om *incremental* är ``True``.

source: Incremental Configuration
sv: Inkrementell konfiguration

source: It is difficult to provide complete flexibility for incremental configuration. For example, because objects such as filters and formatters are anonymous, once a configuration is set up, it is not possible to refer to such anonymous objects when augmenting a configuration.
sv: Det är svårt att ge fullständig flexibilitet för inkrementell konfiguration. Eftersom objekt som filter och formatterare är anonyma är det till exempel inte möjligt att hänvisa till sådana anonyma objekt när en konfiguration har konfigurerats.

source: Furthermore, there is not a compelling case for arbitrarily altering the object graph of loggers, handlers, filters, formatters at run-time, once a configuration is set up; the verbosity of loggers and handlers can be controlled just by setting levels (and, in the case of loggers, propagation flags). Changing the object graph arbitrarily in a safe way is problematic in a multi-threaded environment; while not impossible, the benefits are not worth the complexity it adds to the implementation.
sv: Det finns inte heller några övertygande skäl för att godtyckligt ändra objektgrafen för loggrar, hanterare, filter och formaterare under körning, när en konfiguration väl har skapats; ordrikedomen hos loggrar och hanterare kan styras genom att bara ange nivåer (och, när det gäller loggrar, spridningsflaggor). Att ändra objektgrafen godtyckligt på ett säkert sätt är problematiskt i en flertrådad miljö; även om det inte är omöjligt är fördelarna inte värda den komplexitet som det tillför implementeringen.

source: Thus, when the ``incremental`` key of a configuration dict is present and is ``True``, the system will completely ignore any ``formatters`` and ``filters`` entries, and process only the ``level`` settings in the ``handlers`` entries, and the ``level`` and ``propagate`` settings in the ``loggers`` and ``root`` entries.
sv: När nyckeln ``incremental`` i en konfigurationsdikt är närvarande och är ``True``, kommer systemet att helt ignorera alla ``formatters`` och ``filters`` poster och endast bearbeta ``level`` inställningarna i ``handlers`` posterna, och ``level`` och ``propagate`` inställningarna i ``loggers`` och ``root`` posterna.

source: Using a value in the configuration dict lets configurations to be sent over the wire as pickled dicts to a socket listener. Thus, the logging verbosity of a long-running application can be altered over time with no need to stop and restart the application.
sv: Genom att använda ett värde i konfigurationsdictet kan konfigurationer skickas över kabeln som pickled dicts till en socketlyssnare. På så sätt kan loggningsstyrkan i en applikation som körs under lång tid ändras över tid utan att applikationen behöver stoppas och startas om.

source: Object connections
sv: Objektanslutningar

source: The schema describes a set of logging objects - loggers, handlers, formatters, filters - which are connected to each other in an object graph. Thus, the schema needs to represent connections between the objects. For example, say that, once configured, a particular logger has attached to it a particular handler. For the purposes of this discussion, we can say that the logger represents the source, and the handler the destination, of a connection between the two. Of course in the configured objects this is represented by the logger holding a reference to the handler. In the configuration dict, this is done by giving each destination object an id which identifies it unambiguously, and then using the id in the source object's configuration to indicate that a connection exists between the source and the destination object with that id.
sv: Schemat beskriver en uppsättning loggningsobjekt - loggers, handlers, formatters, filters - som är kopplade till varandra i en objektgraf. Schemat måste alltså representera kopplingar mellan objekten. Låt oss till exempel säga att en viss logger har en viss hanterare kopplad till sig när den väl har konfigurerats. I den här diskussionen kan vi säga att loggern representerar källan och hanteraren destinationen för en koppling mellan de två. I de konfigurerade objekten representeras detta naturligtvis av att loggern har en referens till hanteraren. I konfigurationsdikten görs detta genom att ge varje destinationsobjekt ett id som identifierar det på ett otvetydigt sätt och sedan använda id:t i källobjektets konfiguration för att ange att det finns en koppling mellan källan och destinationsobjektet med det id:t.

source: So, for example, consider the following YAML snippet:
sv: Tänk till exempel på följande YAML-utdrag:

source: formatters: brief: # configuration for formatter with id 'brief' goes here precise: # configuration for formatter with id 'precise' goes here handlers: h1: #This is an id # configuration of handler with id 'h1' goes here formatter: brief h2: #This is another id # configuration of handler with id 'h2' goes here formatter: precise loggers: foo.bar.baz: # other configuration for logger 'foo.bar.baz' handlers: [h1, h2]
sv: formatterare: kort: # konfigurationen för formatterare med id 'brief' hamnar här exakt: # konfiguration för formatterare med id 'precise' går här hanterare: h1: #Detta är ett id # konfiguration av hanterare med id 'h1' går här formatterare: kort h2: #Detta är ett annat id # konfiguration av hanterare med id 'h2' går här formattering: exakt loggers: foo.bar.baz: # annan konfiguration för logger 'foo.bar.baz' handläggare: [h1, h2]

source: (Note: YAML used here because it's a little more readable than the equivalent Python source form for the dictionary.)
sv: (Observera: YAML används här eftersom det är lite mer läsbart än motsvarande Python-källform för ordlistan)

source: The ids for loggers are the logger names which would be used programmatically to obtain a reference to those loggers, e.g. ``foo.bar.baz``. The ids for Formatters and Filters can be any string value (such as ``brief``, ``precise`` above) and they are transient, in that they are only meaningful for processing the configuration dictionary and used to determine connections between objects, and are not persisted anywhere when the configuration call is complete.
sv: Ids för loggers är de loggernamn som skulle användas programmatiskt för att få en referens till dessa loggers, t.ex. ``foo.bar.baz``. ID:n för Formatters och Filters kan vara vilket strängvärde som helst (t.ex. ``brief``, ``precise`` ovan) och de är transienta, dvs. de är endast meningsfulla för bearbetning av konfigurationsordlistan och används för att fastställa kopplingar mellan objekt, och sparas inte någonstans när konfigurationsanropet är klart.

source: The above snippet indicates that logger named ``foo.bar.baz`` should have two handlers attached to it, which are described by the handler ids ``h1`` and ``h2``. The formatter for ``h1`` is that described by id ``brief``, and the formatter for ``h2`` is that described by id ``precise``.
sv: Ovanstående utdrag visar att loggern med namnet ``foo.bar.baz`` ska ha två hanterare kopplade till sig, vilka beskrivs av hanterar-ID ``h1`` och ``h2``. Formateringen för ``h1`` är den som beskrivs av id ``brief``, och formateringen för ``h2`` är den som beskrivs av id ``precise``.

source: User-defined objects
sv: Användardefinierade objekt

source: The schema supports user-defined objects for handlers, filters and formatters. (Loggers do not need to have different types for different instances, so there is no support in this configuration schema for user-defined logger classes.)
sv: Schemat stöder användardefinierade objekt för hanterare, filter och formaterare. (Loggrar behöver inte ha olika typer för olika instanser, så det finns inget stöd i detta konfigurationsschema för användardefinierade loggerklasser)

source: Objects to be configured are described by dictionaries which detail their configuration. In some places, the logging system will be able to infer from the context how an object is to be instantiated, but when a user-defined object is to be instantiated, the system will not know how to do this. In order to provide complete flexibility for user-defined object instantiation, the user needs to provide a 'factory' - a callable which is called with a configuration dictionary and which returns the instantiated object. This is signalled by an absolute import path to the factory being made available under the special key ``'()'``. Here's a concrete example:
sv: Objekt som ska konfigureras beskrivs av ordböcker som beskriver deras konfiguration. På vissa ställen kan loggningssystemet dra slutsatser från sammanhanget om hur ett objekt ska instansieras, men när ett användardefinierat objekt ska instansieras vet systemet inte hur det ska göras. För att ge fullständig flexibilitet för instansiering av användardefinierade objekt måste användaren tillhandahålla en "fabrik" - en anropsbar funktion som anropas med en konfigurationsordbok och som returnerar det instansierade objektet. Detta signaleras genom att en absolut importsökväg till fabriken görs tillgänglig under den speciella nyckeln ``'()'``. Här är ett konkret exempel:

source: formatters: brief: format: '%(message)s' default: format: '%(asctime)s %(levelname)-8s %(name)-15s %(message)s' datefmt: '%Y-%m-%d %H:%M:%S' custom: (): my.package.customFormatterFactory bar: baz spam: 99.9 answer: 42
sv: formatterare: kort: format: '%(message)s' standard: format: '%(asctime)s %(levelname)-8s %(name)-15s %(message)s' datefmt: '%Y-%m-%d %H:%M:%S' custom: (): my.package.customFormatterFactory bar: baz spam: 99.9 svar: 42

source: The above YAML snippet defines three formatters. The first, with id ``brief``, is a standard :class:`logging.Formatter` instance with the specified format string. The second, with id ``default``, has a longer format and also defines the time format explicitly, and will result in a :class:`logging.Formatter` initialized with those two format strings. Shown in Python source form, the ``brief`` and ``default`` formatters have configuration sub-dictionaries::
sv: YAML-utdraget ovan definierar tre formaterare. Den första, med id ``brief``, är en standard :class:`logging.Formatter`-instans med den angivna formatsträngen. Den andra, med id ``default``, har ett längre format och definierar även tidsformatet explicit, och kommer att resultera i en :class:`logging.Formatter` som initieras med dessa två formatsträngar. Visas i Python-källform, ``brief`` och ``default`` formatterarna har konfigurationsunderordnade ordböcker::

source: and::
sv: och::

source: respectively, and as these dictionaries do not contain the special key ``'()'``, the instantiation is inferred from the context: as a result, standard :class:`logging.Formatter` instances are created. The configuration sub-dictionary for the third formatter, with id ``custom``, is::
sv: respektive, och eftersom dessa ordböcker inte innehåller specialnyckeln ``'()'``, härleds instansen från sammanhanget: som ett resultat skapas standard :class:`logging.Formatter`-instanser. Konfigurationsunderordlistan för den tredje formatteraren, med id ``custom``, är::

source: { '()' : 'my.package.customFormatterFactory', 'bar' : 'baz', 'spam' : 99.9, 'answer' : 42 }
sv: { '()' : 'my.package.customFormatterFactory', 'bar' : 'baz', 'spam' : 99.9, 'svar' : 42 }

source: and this contains the special key ``'()'``, which means that user-defined instantiation is wanted. In this case, the specified factory callable will be used. If it is an actual callable it will be used directly - otherwise, if you specify a string (as in the example) the actual callable will be located using normal import mechanisms. The callable will be called with the **remaining** items in the configuration sub-dictionary as keyword arguments. In the above example, the formatter with id ``custom`` will be assumed to be returned by the call::
sv: och denna innehåller specialnyckeln ``'()'``, vilket innebär att en användardefinierad instansiering önskas. I detta fall kommer den angivna fabriksinställningen att användas. Om det är en faktisk callable kommer den att användas direkt - i annat fall, om du anger en sträng (som i exemplet) kommer den faktiska callable att lokaliseras med hjälp av normala importmekanismer. Den anropbara funktionen anropas med de **återstående** objekten i konfigurationsunderordlistan som nyckelordsargument. I exemplet ovan kommer formatteraren med id ``custom`` att antas returneras av anropet::

source: The values for keys such as ``bar``, ``spam`` and ``answer`` in the above example should not be configuration dictionaries or references such as ``cfg://foo`` or ``ext://bar``, because they will not be processed by the configuration machinery, but passed to the callable as-is.
sv: Värdena för nycklar som ``bar``, ``spam`` och ``answer`` i exemplet ovan bör inte vara konfigurationsordböcker eller referenser som ``cfg://foo`` eller ``ext://bar``, eftersom de inte kommer att bearbetas av konfigurationsmaskineriet, utan skickas till den anropsbara som de är.

source: The key ``'()'`` has been used as the special key because it is not a valid keyword parameter name, and so will not clash with the names of the keyword arguments used in the call. The ``'()'`` also serves as a mnemonic that the corresponding value is a callable.
sv: Nyckeln ``'()'`` har använts som specialnyckel eftersom den inte är ett giltigt nyckelordsparameternamn och därför inte krockar med namnen på de nyckelordsargument som används i anropet. ``'()'`` fungerar också som en mnemonik för att motsvarande värde är en callable.

source: The ``filters`` member of ``handlers`` and ``loggers`` can take filter instances in addition to ids.
sv: Medlemmen ``filters`` i ``handlers`` och ``loggers`` kan ta filterinstanser utöver id:n.

source: You can also specify a special key ``'.'`` whose value is a mapping of attribute names to values. If found, the specified attributes will be set on the user-defined object before it is returned. Thus, with the following configuration::
sv: Du kan också ange en specialnyckel ``'.'`` vars värde är en mappning av attributnamn till värden. Om den hittas kommer de angivna attributen att ställas in på det användardefinierade objektet innan det returneras. Således, med följande konfiguration::

source: the returned formatter will have attribute ``foo`` set to ``'bar'`` and attribute ``baz`` set to ``'bozz'``.
sv: kommer den returnerade formateraren att ha attributet ``foo`` satt till ``'bar'`` och attributet ``baz`` satt till ``'bozz'``.

source: The values for attributes such as ``foo`` and ``baz`` in the above example should not be configuration dictionaries or references such as ``cfg://foo`` or ``ext://bar``, because they will not be processed by the configuration machinery, but set as attribute values as-is.
sv: Värdena för attribut som ``foo`` och ``baz`` i exemplet ovan bör inte vara konfigurationsordböcker eller referenser som ``cfg://foo`` eller ``ext://bar``, eftersom de inte kommer att bearbetas av konfigurationsmaskineriet, utan anges som attributvärden som de är.

source: Handler configuration order
sv: Konfigurationsordning för handläggare

source: Handlers are configured in alphabetical order of their keys, and a configured handler replaces the configuration dictionary in (a working copy of) the ``handlers`` dictionary in the schema. If you use a construct such as ``cfg://handlers.foo``, then initially ``handlers['foo']`` points to the configuration dictionary for the handler named ``foo``, and later (once that handler has been configured) it points to the configured handler instance. Thus, ``cfg://handlers.foo`` could resolve to either a dictionary or a handler instance. In general, it is wise to name handlers in a way such that dependent handlers are configured *after* any handlers they depend on; that allows something like ``cfg://handlers.foo`` to be used in configuring a handler that depends on handler ``foo``. If that dependent handler were named ``bar``, problems would result, because the configuration of ``bar`` would be attempted before that of ``foo``, and ``foo`` would not yet have been configured. However, if the dependent handler were named ``foobar``, it would be configured after ``foo``, with the result that ``cfg://handlers.foo`` would resolve to configured handler ``foo``, and not its configuration dictionary.
sv: Hanterare konfigureras i alfabetisk ordning efter sina nycklar, och en konfigurerad hanterare ersätter konfigurationsordlistan i (en arbetskopia av) ordlistan ``handlers`` i schemat. Om du använder en konstruktion som ``cfg://handlers.foo``, pekar ``handlers['foo']`` först på konfigurationsordlistan för hanteraren med namnet ``foo``, och senare (när den hanteraren har konfigurerats) pekar den på den konfigurerade hanterarinstansen. Således kan ``cfg://handlers.foo`` peka på antingen en ordbok eller en hanterarinstans. I allmänhet är det klokt att namnge hanterare på ett sådant sätt att beroende hanterare konfigureras *efter* alla hanterare som de är beroende av. Det gör att något som ``cfg://handlers.foo`` kan användas för att konfigurera en hanterare som är beroende av hanteraren ``foo``. Om den beroende hanteraren hette ``bar`` skulle det uppstå problem, eftersom konfigurationen av ``bar`` skulle försöka göras före konfigurationen av ``foo``, och ``foo`` skulle ännu inte ha konfigurerats. Om den beroende hanteraren däremot hette ``foobar`` skulle den konfigureras efter ``foo``, vilket skulle leda till att ``cfg://handlers.foo`` skulle lösa upp till den konfigurerade hanteraren ``foo``, och inte till dess konfigurationsordbok.

source: Access to external objects
sv: Tillgång till externa objekt

source: There are times where a configuration needs to refer to objects external to the configuration, for example ``sys.stderr``. If the configuration dict is constructed using Python code, this is straightforward, but a problem arises when the configuration is provided via a text file (e.g. JSON, YAML). In a text file, there is no standard way to distinguish ``sys.stderr`` from the literal string ``'sys.stderr'``. To facilitate this distinction, the configuration system looks for certain special prefixes in string values and treat them specially. For example, if the literal string ``'ext://sys.stderr'`` is provided as a value in the configuration, then the ``ext://`` will be stripped off and the remainder of the value processed using normal import mechanisms.
sv: Det finns tillfällen då en konfiguration behöver hänvisa till objekt utanför konfigurationen, till exempel ``sys.stderr``. Om konfigurationsdikten är konstruerad med Python-kod är detta enkelt, men ett problem uppstår när konfigurationen tillhandahålls via en textfil (t.ex. JSON, YAML). I en textfil finns det inget standardiserat sätt att skilja ``sys.stderr`` från den bokstavliga strängen ``'sys.stderr``. För att underlätta denna distinktion letar konfigurationssystemet efter vissa speciella prefix i strängvärden och behandlar dem på ett speciellt sätt. Om till exempel den bokstavliga strängen ``'ext://sys.stderr'`` anges som ett värde i konfigurationen, kommer ``ext://`` att tas bort och resten av värdet behandlas med normala importmekanismer.
