Repository: yeager/python-docs-sv
Catalog: library/logging.po
Languages: sv

source: Can be one of ``'%'``, ``'{'`` or ``'$'`` and determines how the format string will be merged with its data: using one of :ref:`old-string-formatting` (``%``), :meth:`str.format` (``{``) or :class:`string.Template` (``$``). This only applies to *fmt* and *datefmt* (e.g. ``'%(message)s'`` versus ``'{message}'``), not to the actual log messages passed to the logging methods. However, there are :ref:`other ways <formatting-styles>` to use ``{``- and ``$``-formatting for log messages.
sv: Kan vara en av ``'%'``, ``'{'`` eller ``'$'`` och bestämmer hur formatsträngen ska slås samman med dess data: med hjälp av en av :ref:`old-string-formatting` (``%``), :meth:`str.format` (``{``) eller :class:`string.Template` (``$``). Detta gäller endast för *fmt* och *datefmt* (t.ex. ``'%(message)s'`` jämfört med ``'{message}'``), inte för de faktiska loggmeddelanden som skickas till loggmetoderna. Det finns dock :ref:`andra sätt <formatting-styles>` att använda ``{``- och ``$``-formatering för loggmeddelanden.

source: If ``True`` (the default), incorrect or mismatched *fmt* and *style* will raise a :exc:`ValueError`; for example, ``logging.Formatter('%(asctime)s - %(message)s', style='{')``.
sv: Om ``True`` (standard) kommer felaktig eller ej matchande *fmt* och *style* att ge upphov till ett :exc:`ValueError`; till exempel ``logging.Formatter('%(asctime)s - %(message)s', style='{')``.

source: A dictionary with default values to use in custom fields. For example, ``logging.Formatter('%(ip)s %(message)s', defaults={"ip": None})``
sv: En ordbok med standardvärden som ska användas i anpassade fält. Till exempel ``logging.Formatter('%(ip)s %(message)s', defaults={"ip": None})``

source: Added the *style* parameter.
sv: Lagt till parametern *style*.

source: Added the *validate* parameter.
sv: Lagt till parametern *validate*.

source: Added the *defaults* parameter.
sv: Parametern *defaults* har lagts till.

source: The record's attribute dictionary is used as the operand to a string formatting operation. Returns the resulting string. Before formatting the dictionary, a couple of preparatory steps are carried out. The *message* attribute of the record is computed using *msg* % *args*. If the formatting string contains ``'(asctime)'``, :meth:`formatTime` is called to format the event time. If there is exception information, it is formatted using :meth:`formatException` and appended to the message. Note that the formatted exception information is cached in attribute *exc_text*. This is useful because the exception information can be pickled and sent across the wire, but you should be careful if you have more than one :class:`Formatter` subclass which customizes the formatting of exception information. In this case, you will have to clear the cached value (by setting the *exc_text* attribute to ``None``) after a formatter has done its formatting, so that the next formatter to handle the event doesn't use the cached value, but recalculates it afresh.
sv: Postens attributordbok används som operand i en strängformateringsoperation. Returnerar den resulterande strängen. Innan ordlistan formateras utförs ett par förberedande steg. Attributet *message* för posten beräknas med hjälp av *msg* % *args*. Om formateringssträngen innehåller ``'(asctime)'``, anropas :meth:`formatTime` för att formatera händelsetiden. Om det finns undantagsinformation formateras den med :meth:`formatException` och läggs till i meddelandet. Observera att den formaterade undantagsinformationen cachelagras i attributet *exc_text*. Detta är användbart eftersom undantagsinformationen kan plockas ut och skickas över kabeln, men du bör vara försiktig om du har mer än en :class:`Formatter`-underklass som anpassar formateringen av undantagsinformation. I så fall måste du rensa det cachade värdet (genom att sätta attributet *exc_text* till ``None``) efter att en formaterare har gjort sin formatering, så att nästa formaterare som hanterar händelsen inte använder det cachade värdet, utan räknar om det på nytt.

source: If stack information is available, it's appended after the exception information, using :meth:`formatStack` to transform it if necessary.
sv: Om stackinformation finns tillgänglig läggs den till efter undantagsinformationen, med hjälp av :meth:`formatStack` för att omvandla den vid behov.

source: This method should be called from :meth:`format` by a formatter which wants to make use of a formatted time. This method can be overridden in formatters to provide for any specific requirement, but the basic behavior is as follows: if *datefmt* (a string) is specified, it is used with :func:`time.strftime` to format the creation time of the record. Otherwise, the format '%Y-%m-%d %H:%M:%S,uuu' is used, where the uuu part is a millisecond value and the other letters are as per the :func:`time.strftime` documentation. An example time in this format is ``2003-01-23 00:29:50,411``. The resulting string is returned.
sv: Denna metod bör anropas från :meth:`format` av en formaterare som vill använda en formaterad tid. Denna metod kan åsidosättas i formaterare för att tillgodose specifika krav, men det grundläggande beteendet är följande: om *datefmt* (en sträng) anges, används den med :func:`time.strftime` för att formatera skapelsetiden för posten. Annars används formatet '%Y-%m-%d %H:%M:%S,uuu', där uuu-delen är ett millisekundvärde och de andra bokstäverna är enligt dokumentationen för :func:`time.strftime`. Ett exempel på tid i detta format är ``2003-01-23 00:29:50,411``. Den resulterande strängen returneras.

source: This function uses a user-configurable function to convert the creation time to a tuple. By default, :func:`time.localtime` is used; to change this for a particular formatter instance, set the ``converter`` attribute to a function with the same signature as :func:`time.localtime` or :func:`time.gmtime`. To change it for all formatters, for example if you want all logging times to be shown in GMT, set the ``converter`` attribute in the ``Formatter`` class.
sv: Denna funktion använder en användarkonfigurerbar funktion för att konvertera skapelsetiden till en tupel. Som standard används :func:`time.localtime`; för att ändra detta för en viss formateringsinstans, ställ in attributet ``converter`` till en funktion med samma signatur som :func:`time.localtime` eller :func:`time.gmtime`. Om du vill ändra detta för alla formaterare, t.ex. om du vill att alla loggningstider ska visas i GMT, anger du attributet ``converter`` i klassen ``Formatter``.

source: Previously, the default format was hard-coded as in this example: ``2010-09-06 22:38:15,292`` where the part before the comma is handled by a strptime format string (``'%Y-%m-%d %H:%M:%S'``), and the part after the comma is a millisecond value. Because strptime does not have a format placeholder for milliseconds, the millisecond value is appended using another format string, ``'%s,%03d'`` --- and both of these format strings have been hardcoded into this method. With the change, these strings are defined as class-level attributes which can be overridden at the instance level when desired. The names of the attributes are ``default_time_format`` (for the strptime format string) and ``default_msec_format`` (for appending the millisecond value).
sv: Tidigare var standardformatet hårdkodat som i det här exemplet: ``2010-09-06 22:38:15,292`` där delen före kommatecknet hanteras av en strptime-formatsträng (``'%Y-%m-%d %H:%M:%S'``) och delen efter kommatecknet är ett millisekundvärde. Eftersom strptime inte har någon formatplatshållare för millisekunder läggs millisekundvärdet till med hjälp av en annan formatsträng, ``'%s,%03d'`` --- och båda dessa formatsträngar har varit hårdkodade i den här metoden. I och med ändringen definieras dessa strängar som attribut på klassnivå som kan åsidosättas på instansnivå när så önskas. Namnen på attributen är ``default_time_format`` (för strptime-formatsträngen) och ``default_msec_format`` (för att lägga till millisekundvärdet).

source: The ``default_msec_format`` can be ``None``.
sv: Standard_msec_format kan vara "ingen".

source: Formats the specified exception information (a standard exception tuple as returned by :func:`sys.exc_info`) as a string. This default implementation just uses :func:`traceback.print_exception`. The resulting string is returned.
sv: Formaterar den angivna undantagsinformationen (en standardtupel för undantag som returneras av :func:`sys.exc_info`) som en sträng. Denna standardimplementering använder bara :func:`traceback.print_exception`. Den resulterande strängen returneras.

source: Formats the specified stack information (a string as returned by :func:`traceback.print_stack`, but with the last newline removed) as a string. This default implementation just returns the input value.
sv: Formaterar den angivna stackinformationen (en sträng som returneras av :func:`traceback.print_stack`, men med den sista nya raden borttagen) som en sträng. Denna standardimplementering returnerar bara inmatningsvärdet.

source: A base formatter class suitable for subclassing when you want to format a number of records. You can pass a :class:`Formatter` instance which you want to use to format each line (that corresponds to a single record). If not specified, the default formatter (which just outputs the event message) is used as the line formatter.
sv: En basformateringsklass som lämpar sig för underklassning när du vill formatera ett antal poster. Du kan skicka en :class:`Formatter`-instans som du vill använda för att formatera varje rad (som motsvarar en enda post). Om inget anges används standardformateraren (som bara matar ut händelsemeddelandet) som radformaterare.

source: Return a header for a list of *records*. The base implementation just returns the empty string. You will need to override this method if you want specific behaviour, e.g. to show the count of records, a title or a separator line.
sv: Returnerar ett sidhuvud för en lista med *poster*. Basimplementeringen returnerar bara den tomma strängen. Du måste åsidosätta den här metoden om du vill ha ett specifikt beteende, t.ex. om du vill visa antalet poster, en titel eller en separationsrad.

source: Return a footer for a list of *records*. The base implementation just returns the empty string. You will need to override this method if you want specific behaviour, e.g. to show the count of records or a separator line.
sv: Returnerar en sidfot för en lista med *poster*. Basimplementeringen returnerar bara den tomma strängen. Du måste åsidosätta den här metoden om du vill ha ett specifikt beteende, t.ex. om du vill visa antalet poster eller en separationsrad.

source: Return formatted text for a list of *records*. The base implementation just returns the empty string if there are no records; otherwise, it returns the concatenation of the header, each record formatted with the line formatter, and the footer.
sv: Returnerar formaterad text för en lista med *poster*. Basimplementeringen returnerar bara den tomma strängen om det inte finns några poster; annars returneras konkateneringen av rubriken, varje post som formaterats med radformateraren och sidfoten.

source: Filter Objects
sv: Filtrera objekt

source: ``Filters`` can be used by ``Handlers`` and ``Loggers`` for more sophisticated filtering than is provided by levels. The base filter class only allows events which are below a certain point in the logger hierarchy. For example, a filter initialized with 'A.B' will allow events logged by loggers 'A.B', 'A.B.C', 'A.B.C.D', 'A.B.D' etc. but not 'A.BB', 'B.A.B' etc. If initialized with the empty string, all events are passed.
sv: ``Filters`` kan användas av ``Handlers`` och ``Loggers`` för mer sofistikerad filtrering än vad som tillhandahålls av levels. Basfilterklassen tillåter endast händelser som ligger under en viss punkt i loggerhierarkin. Exempelvis kommer ett filter som initieras med "A.B" att tillåta händelser som loggas av loggrarna "A.B", "A.B.C", "A.B.C.D", "A.B.D" etc. men inte "A.BB", "B.A.B" etc. Om den initieras med en tom sträng skickas alla händelser vidare.

source: Returns an instance of the :class:`Filter` class. If *name* is specified, it names a logger which, together with its children, will have its events allowed through the filter. If *name* is the empty string, allows every event.
sv: Returnerar en instans av klassen :class:`Filter`. Om *name* anges, namnges en logger som, tillsammans med sina underordnade loggar, kommer att få sina händelser tillåtna genom filtret. Om *name* är en tom sträng tillåts alla händelser.

source: Is the specified record to be logged? Returns false for no, true for yes. Filters can either modify log records in-place or return a completely different record instance which will replace the original log record in any future processing of the event.
sv: Ska den angivna posten loggas? Returnerar false för nej, true för ja. Filter kan antingen ändra loggposter på plats eller returnera en helt annan postinstans som kommer att ersätta den ursprungliga loggposten vid framtida behandling av händelsen.

source: Note that filters attached to handlers are consulted before an event is emitted by the handler, whereas filters attached to loggers are consulted whenever an event is logged (using :meth:`debug`, :meth:`info`, etc.), before sending an event to handlers. This means that events which have been generated by descendant loggers will not be filtered by a logger's filter setting, unless the filter has also been applied to those descendant loggers.
sv: Observera att filter som är kopplade till hanterare konsulteras innan en händelse sänds ut av hanteraren, medan filter som är kopplade till loggrar konsulteras när en händelse loggas (med :meth:`debug`, :meth:`info`, etc.), innan en händelse skickas till hanterare. Detta innebär att händelser som har genererats av loggar i nedstigande led inte filtreras av en loggers filterinställning, såvida inte filtret också har tillämpats på dessa loggar i nedstigande led.

source: You don't actually need to subclass ``Filter``: you can pass any instance which has a ``filter`` method with the same semantics.
sv: Du behöver faktiskt inte underklassa ``Filter``: du kan skicka vilken instans som helst som har en ``filter``-metod med samma semantik.

source: You don't need to create specialized ``Filter`` classes, or use other classes with a ``filter`` method: you can use a function (or other callable) as a filter. The filtering logic will check to see if the filter object has a ``filter`` attribute: if it does, it's assumed to be a ``Filter`` and its :meth:`~Filter.filter` method is called. Otherwise, it's assumed to be a callable and called with the record as the single parameter. The returned value should conform to that returned by :meth:`~Filter.filter`.
sv: Du behöver inte skapa specialiserade ``Filter``-klasser eller använda andra klasser med en ``filter``-metod: du kan använda en funktion (eller annan anropsbar) som ett filter. Filtreringslogiken kommer att kontrollera om filterobjektet har ett ``filter``-attribut: om det gör det, antas det vara ett ``Filter`` och dess :meth:`~Filter.filter`-metod anropas. Annars antas den vara en callable och anropas med posten som enda parameter. Det returnerade värdet bör överensstämma med det som returneras av :meth:`~Filter.filter`.

source: You can now return a :class:`LogRecord` instance from filters to replace the log record rather than modifying it in place. This allows filters attached to a :class:`Handler` to modify the log record before it is emitted, without having side effects on other handlers.
sv: Du kan nu returnera en :class:`LogRecord`-instans från filter för att ersätta loggposten i stället för att modifiera den på plats. Detta gör att filter som är kopplade till en :class:`Handler` kan modifiera loggposten innan den sänds ut, utan att det får bieffekter på andra handlers.

source: Although filters are used primarily to filter records based on more sophisticated criteria than levels, they get to see every record which is processed by the handler or logger they're attached to: this can be useful if you want to do things like counting how many records were processed by a particular logger or handler, or adding, changing or removing attributes in the :class:`LogRecord` being processed. Obviously changing the LogRecord needs to be done with some care, but it does allow the injection of contextual information into logs (see :ref:`filters-contextual`).
sv: Även om filter främst används för att filtrera poster baserat på mer sofistikerade kriterier än nivåer, får de se varje post som bearbetas av den hanterare eller logger de är kopplade till: detta kan vara användbart om du vill göra saker som att räkna hur många poster som bearbetades av en viss logger eller hanterare, eller lägga till, ändra eller ta bort attribut i :class:`LogRecord` som bearbetas. Självklart måste ändring av LogRecord göras med viss försiktighet, men det gör det möjligt att injicera kontextuell information i loggar (se :ref:`filters-contextual`).

source: LogRecord Objects
sv: LogRecord-objekt

source: :class:`LogRecord` instances are created automatically by the :class:`Logger` every time something is logged, and can be created manually via :func:`makeLogRecord` (for example, from a pickled event received over the wire).
sv: :class:`LogRecord`-instanser skapas automatiskt av :class:`Logger` varje gång något loggas, och kan skapas manuellt via :func:`makeLogRecord` (t.ex. från en inlagd händelse som tas emot över kabeln).

source: Contains all the information pertinent to the event being logged.
sv: Innehåller all information som är relevant för den händelse som loggas.

source: The primary information is passed in *msg* and *args*, which are combined using ``msg % args`` to create the :attr:`!message` attribute of the record.
sv: Den primära informationen skickas i *msg* och *args*, som kombineras med hjälp av ``msg % args`` för att skapa attributet :attr:`!message` för posten.

source: The name of the logger used to log the event represented by this :class:`!LogRecord`. Note that the logger name in the :class:`!LogRecord` will always have this value, even though it may be emitted by a handler attached to a different (ancestor) logger.
sv: Namnet på den logger som används för att logga den händelse som representeras av denna :class:`!LogRecord`. Observera att loggarens namn i :class:`!LogRecord` alltid kommer att ha detta värde, även om det kan sändas ut av en hanterare som är kopplad till en annan (förfaderlig) logger.

source: The :ref:`numeric level <levels>` of the logging event (such as ``10`` for ``DEBUG``, ``20`` for ``INFO``, etc). Note that this is converted to *two* attributes of the LogRecord: :attr:`!levelno` for the numeric value and :attr:`!levelname` for the corresponding level name.
sv: :ref:``numerisk nivå <levels>`` för loggningshändelsen (t.ex. ``10`` för ``DEBUG``, ``20`` för ``INFO``, etc.). Observera att detta konverteras till *två* attribut i LogRecord: :attr:`!levelno` för det numeriska värdet och :attr:`!levelname` för motsvarande nivånamn.

source: The full string path of the source file where the logging call was made.
sv: Den fullständiga sökvägen till källfilen där loggningsanropet gjordes.

source: The line number in the source file where the logging call was made.
sv: Radnumret i källfilen där loggningsanropet gjordes.

source: The event description message, which can be a %-format string with placeholders for variable data, or an arbitrary object (see :ref:`arbitrary-object-messages`).
sv: Händelsebeskrivningsmeddelandet, som kan vara en %-format sträng med platshållare för variabeldata, eller ett godtyckligt objekt (se :ref:`arbitrary-object-messages`).

source: Variable data to merge into the *msg* argument to obtain the event description.
sv: Variabel data som ska sammanfogas med *msg*-argumentet för att få en beskrivning av händelsen.

source: An exception tuple with the current exception information, as returned by :func:`sys.exc_info`, or ``None`` if no exception information is available.
sv: En exception-tupel med aktuell exceptioninformation, som returneras av :func:`sys.exc_info`, eller ``None`` om ingen exceptioninformation finns tillgänglig.

source: The name of the function or method from which the logging call was invoked.
sv: Namnet på den funktion eller metod från vilken anropet för loggning gjordes.

source: A text string representing stack information from the base of the stack in the current thread, up to the logging call.
sv: En textsträng som representerar stackinformation från stackens bas i den aktuella tråden, fram till loggningsanropet.

source: Returns the message for this :class:`LogRecord` instance after merging any user-supplied arguments with the message. If the user-supplied message argument to the logging call is not a string, :func:`str` is called on it to convert it to a string. This allows use of user-defined classes as messages, whose ``__str__`` method can return the actual format string to be used.
sv: Returnerar meddelandet för denna :class:`LogRecord`-instans efter att ha slagit samman eventuella användartillhandahållna argument med meddelandet. Om det användartillhandahållna meddelandeargumentet till loggningsanropet inte är en sträng, anropas :func:`str` för att konvertera det till en sträng. Detta gör det möjligt att använda användardefinierade klasser som meddelanden, vars metod ``__str__`` kan returnera den faktiska formatsträng som ska användas.

source: The creation of a :class:`LogRecord` has been made more configurable by providing a factory which is used to create the record. The factory can be set using :func:`getLogRecordFactory` and :func:`setLogRecordFactory` (see this for the factory's signature).
sv: Skapandet av en :class:`LogRecord` har gjorts mer konfigurerbar genom att tillhandahålla en fabrik som används för att skapa posten. Fabriken kan ställas in med hjälp av :func:`getLogRecordFactory` och :func:`setLogRecordFactory` (se detta för fabrikens signatur).

source: This functionality can be used to inject your own values into a :class:`LogRecord` at creation time. You can use the following pattern::
sv: Denna funktionalitet kan användas för att injicera dina egna värden i en :class:`LogRecord` vid skapandet. Du kan använda följande mönster::

source: old_factory = logging.getLogRecordFactory() def record_factory(*args, **kwargs): record = old_factory(*args, **kwargs) record.custom_attribute = 0xdecafbad return record logging.setLogRecordFactory(record_factory)
sv: old_factory = loggning.getLogRecordFactory() def record_factory(*args, **kwargs): record = old_factory(*args, **kwargs) record.custom_attribute = 0xdecafbad returnera record logging.setLogRecordFactory(record_factory)

source: With this pattern, multiple factories could be chained, and as long as they don't overwrite each other's attributes or unintentionally overwrite the standard attributes listed above, there should be no surprises.
sv: Med detta mönster kan flera fabriker kedjas, och så länge de inte skriver över varandras attribut eller oavsiktligt skriver över standardattributen som anges ovan, bör det inte finnas några överraskningar.

source: LogRecord attributes
sv: LogRecord-attribut
