Repository: yeager/python-docs-sv
Catalog: library/logging.po
Languages: sv

source: The fourth keyword argument is *extra* which can be used to pass a dictionary which is used to populate the :attr:`~object.__dict__` of the :class:`LogRecord` created for the logging event with user-defined attributes. These custom attributes can then be used as you like. For example, they could be incorporated into logged messages. For example::
sv: Det fjärde nyckelordsargumentet är *extra* som kan användas för att skicka en ordbok som används för att fylla i :attr:`~object.__dict__` i :class:`LogRecord` som skapats för loggningshändelsen med användardefinierade attribut. Dessa anpassade attribut kan sedan användas som du vill. De kan t.ex. införlivas i loggade meddelanden. Till exempel::

source: FORMAT = '%(asctime)s %(clientip)-15s %(user)-8s %(message)s' logging.basicConfig(format=FORMAT) d = {'clientip': '192.168.0.1', 'user': 'fbloggs'} logger = logging.getLogger('tcpserver') logger.warning('Protocol problem: %s', 'connection reset', extra=d)
sv: FORMAT = '%(asctime)s %(clientip)-15s %(user)-8s %(message)s' loggning.basicConfig(format=FORMAT) d = {'clientip': '192.168.0.1', 'user': 'fbloggs'} logger = logging.getLogger('tcpserver') logger.warning('Protokollproblem: %s', 'anslutning återställd', extra=d)

source: would print something like
sv: skulle skriva ut något i stil med

source: 2006-02-08 22:20:02,165 192.168.0.1 fbloggs Protocol problem: connection reset
sv: 2006-02-08 22:20:02,165 192.168.0.1 fbloggs Protokollproblem: återställning av anslutning

source: The keys in the dictionary passed in *extra* should not clash with the keys used by the logging system. (See the section on :ref:`logrecord-attributes` for more information on which keys are used by the logging system.)
sv: Nycklarna i den ordbok som skickas till *extra* får inte krocka med de nycklar som används av loggningssystemet. (Se avsnittet om :ref:`logrecord-attributes` för mer information om vilka nycklar som används av loggningssystemet)

source: If you choose to use these attributes in logged messages, you need to exercise some care. In the above example, for instance, the :class:`Formatter` has been set up with a format string which expects 'clientip' and 'user' in the attribute dictionary of the :class:`LogRecord`. If these are missing, the message will not be logged because a string formatting exception will occur. So in this case, you always need to pass the *extra* dictionary with these keys.
sv: Om du väljer att använda dessa attribut i loggade meddelanden måste du vara lite försiktig. I exemplet ovan har t.ex. :class:`Formatter` konfigurerats med en formatsträng som förväntar sig att 'clientip' och 'user' finns i attributordlistan för :class:`LogRecord`. Om dessa saknas kommer meddelandet inte att loggas eftersom ett undantag för strängformatering inträffar. Så i det här fallet måste du alltid skicka den *extra* ordlistan med dessa nycklar.

source: While this might be annoying, this feature is intended for use in specialized circumstances, such as multi-threaded servers where the same code executes in many contexts, and interesting conditions which arise are dependent on this context (such as remote client IP address and authenticated user name, in the above example). In such circumstances, it is likely that specialized :class:`Formatter`\ s would be used with particular :class:`Handler`\ s.
sv: Även om detta kan vara irriterande är den här funktionen avsedd att användas under speciella omständigheter, t.ex. flertrådade servrar där samma kod körs i många sammanhang och intressanta villkor som uppstår är beroende av detta sammanhang (t.ex. fjärrklientens IP-adress och autentiserat användarnamn i exemplet ovan). Under sådana omständigheter är det troligt att specialiserade :class:`Formatter` s skulle användas med särskilda :class:`Handler` s.

source: If no handler is attached to this logger (or any of its ancestors, taking into account the relevant :attr:`Logger.propagate` attributes), the message will be sent to the handler set on :data:`lastResort`.
sv: Om ingen hanterare är kopplad till denna logger (eller någon av dess förfäder, med hänsyn till relevanta :attr:`Logger.propagate`-attribut), kommer meddelandet att skickas till den hanterare som är inställd på :data:`lastResort`.

source: The *stack_info* parameter was added.
sv: Parametern *stack_info* har lagts till.

source: The *exc_info* parameter can now accept exception instances.
sv: Parametern *exc_info* kan nu acceptera undantagsinstanser.

source: The *stacklevel* parameter was added.
sv: Parametern *stacklevel* har lagts till.

source: Logs a message with level :const:`INFO` on this logger. The arguments are interpreted as for :meth:`debug`.
sv: Loggar ett meddelande med nivå :const:`INFO` på denna logger. Argumenten tolkas som för :meth:`debug`.

source: Logs a message with level :const:`WARNING` on this logger. The arguments are interpreted as for :meth:`debug`.
sv: Loggar ett meddelande med nivå :const:`WARNING` på denna logger. Argumenten tolkas som för :meth:`debug`.

source: There is an obsolete method ``warn`` which is functionally identical to ``warning``. As ``warn`` is deprecated, please do not use it - use ``warning`` instead.
sv: Det finns en föråldrad metod ``warn`` som är funktionellt identisk med ``warning``. Eftersom ``warn`` är föråldrad, vänligen använd den inte - använd ``warning`` istället.

source: Logs a message with level :const:`ERROR` on this logger. The arguments are interpreted as for :meth:`debug`.
sv: Loggar ett meddelande med nivån :const:`ERROR` på denna logger. Argumenten tolkas som för :meth:`debug`.

source: Logs a message with level :const:`CRITICAL` on this logger. The arguments are interpreted as for :meth:`debug`.
sv: Loggar ett meddelande med nivå :const:`CRITICAL` på denna logger. Argumenten tolkas som för :meth:`debug`.

source: Logs a message with integer level *level* on this logger. The other arguments are interpreted as for :meth:`debug`.
sv: Loggar ett meddelande med heltalsnivån *level* på denna logger. De andra argumenten tolkas som för :meth:`debug`.

source: Logs a message with level :const:`ERROR` on this logger. The arguments are interpreted as for :meth:`debug`. Exception info is added to the logging message. This method should only be called from an exception handler.
sv: Loggar ett meddelande med nivån :const:`ERROR` på denna logger. Argumenten tolkas som för :meth:`debug`. Undantagsinformation läggs till i logningsmeddelandet. Denna metod bör endast anropas från en undantagshanterare.

source: Adds the specified filter *filter* to this logger.
sv: Lägger till det angivna filtret *filter* till denna logger.

source: Removes the specified filter *filter* from this logger.
sv: Tar bort det angivna filtret *filter* från den här loggern.

source: Apply this logger's filters to the record and return ``True`` if the record is to be processed. The filters are consulted in turn, until one of them returns a false value. If none of them return a false value, the record will be processed (passed to handlers). If one returns a false value, no further processing of the record occurs.
sv: Tillämpa denna loggers filter på posten och returnera ``True`` om posten ska behandlas. Filtren konsulteras i tur och ordning tills ett av dem returnerar ett falskt värde. Om inget av dem returnerar ett falskt värde kommer posten att behandlas (skickas till handläggare). Om ett filter returnerar ett falskt värde sker ingen ytterligare behandling av posten.

source: Adds the specified handler *hdlr* to this logger.
sv: Lägger till den angivna hanteraren *hdlr* till denna logger.

source: Removes the specified handler *hdlr* from this logger.
sv: Tar bort den angivna hanteraren *hdlr* från denna logger.

source: Finds the caller's source filename and line number. Returns the filename, line number, function name and stack information as a 4-element tuple. The stack information is returned as ``None`` unless *stack_info* is ``True``.
sv: Hittar anroparens källfilnamn och radnummer. Returnerar filnamn, radnummer, funktionsnamn och stackinformation som en tupel med 4 element. Stackinformationen returneras som ``None`` om inte *stack_info* är ``True``.

source: The *stacklevel* parameter is passed from code calling the :meth:`debug` and other APIs. If greater than 1, the excess is used to skip stack frames before determining the values to be returned. This will generally be useful when calling logging APIs from helper/wrapper code, so that the information in the event log refers not to the helper/wrapper code, but to the code that calls it.
sv: Parametern *stacklevel* skickas från kod som anropar :meth:`debug` och andra API:er. Om den är större än 1 används överskottet för att hoppa över stackrutor innan man bestämmer vilka värden som ska returneras. Detta är i allmänhet användbart när loggnings-API:er anropas från hjälp-/omslagskod, så att informationen i händelseloggen inte hänvisar till hjälp-/omslagskoden utan till den kod som anropar den.

source: Handles a record by passing it to all handlers associated with this logger and its ancestors (until a false value of *propagate* is found). This method is used for unpickled records received from a socket, as well as those created locally. Logger-level filtering is applied using :meth:`~Logger.filter`.
sv: Hanterar en post genom att skicka den till alla hanterare som är associerade med denna logger och dess förfäder (tills ett falskt värde för *propagate* hittas). Den här metoden används för obehandlade poster som tas emot från ett uttag, samt för poster som skapas lokalt. Filtrering på loggarnivå görs med :meth:`~Logger.filter`.

source: This is a factory method which can be overridden in subclasses to create specialized :class:`LogRecord` instances.
sv: Detta är en fabriksmetod som kan åsidosättas i underklasser för att skapa specialiserade :class:`LogRecord`-instanser.

source: Checks to see if this logger has any handlers configured. This is done by looking for handlers in this logger and its parents in the logger hierarchy. Returns ``True`` if a handler was found, else ``False``. The method stops searching up the hierarchy whenever a logger with the 'propagate' attribute set to false is found - that will be the last logger which is checked for the existence of handlers.
sv: Kontrollerar om denna logger har några hanterare konfigurerade. Detta görs genom att leta efter hanterare i den här loggern och dess föräldrar i loggerhierarkin. Returnerar ``True`` om en hanterare hittades, annars ``False``. Metoden slutar att söka uppåt i hierarkin när en logger med attributet 'propagate' inställt på false hittas - det blir den sista loggern som kontrolleras för förekomsten av hanterare.

source: Loggers can now be pickled and unpickled.
sv: Skogshuggare kan nu bli inlagda och oinlagda.

source: Logging Levels
sv: Loggningsnivåer

source: The numeric values of logging levels are given in the following table. These are primarily of interest if you want to define your own levels, and need them to have specific values relative to the predefined levels. If you define a level with the same numeric value, it overwrites the predefined value; the predefined name is lost.
sv: De numeriska värdena för loggningsnivåerna anges i följande tabell. Dessa är främst intressanta om du vill definiera dina egna nivåer och vill att de ska ha specifika värden i förhållande till de fördefinierade nivåerna. Om du definierar en nivå med samma numeriska värde, skriver den över det fördefinierade värdet; det fördefinierade namnet försvinner.

source: Level
sv: Nivå

source: Numeric value
sv: Numeriskt värde

source: What it means / When to use it
sv: Vad det betyder / När det ska användas

source: When set on a logger, indicates that ancestor loggers are to be consulted to determine the effective level. If that still resolves to :const:`!NOTSET`, then all events are logged. When set on a handler, all events are handled.
sv: När den är inställd på en logger indikerar den att föregående loggar ska konsulteras för att bestämma den effektiva nivån. Om detta fortfarande resulterar i :const:`!NOTSET`, loggas alla händelser. När den är inställd på en hanterare hanteras alla händelser.

source: Detailed information, typically only of interest to a developer trying to diagnose a problem.
sv: Detaljerad information som vanligtvis bara är av intresse för en utvecklare som försöker diagnostisera ett problem.

source: Confirmation that things are working as expected.
sv: Bekräftelse på att saker och ting fungerar som förväntat.

source: An indication that something unexpected happened, or that a problem might occur in the near future (e.g. 'disk space low'). The software is still working as expected.
sv: En indikation på att något oväntat har hänt eller att ett problem kan uppstå inom en snar framtid (t.ex. "lågt diskutrymme"). Programvaran fungerar fortfarande som förväntat.

source: Due to a more serious problem, the software has not been able to perform some function.
sv: På grund av ett mer allvarligt problem har programvaran inte kunnat utföra någon funktion.

source: A serious error, indicating that the program itself may be unable to continue running.
sv: Ett allvarligt fel som indikerar att själva programmet kanske inte kan fortsätta att köras.

source: Handler Objects
sv: Handläggarobjekt

source: Handlers have the following attributes and methods. Note that :class:`Handler` is never instantiated directly; this class acts as a base for more useful subclasses. However, the :meth:`!__init__` method in subclasses needs to call :meth:`Handler.__init__`.
sv: Hanterare har följande attribut och metoder. Observera att :class:`Handler` aldrig instansieras direkt; denna klass fungerar som en bas för mer användbara subklasser. Metoden :meth:`!__init__` i underklasser måste dock anropa :meth:`Handler.__init__`.

source: Initializes the :class:`Handler` instance by setting its level, setting the list of filters to the empty list and creating a lock (using :meth:`createLock`) for serializing access to an I/O mechanism.
sv: Initialiserar :class:`Handler`-instansen genom att ange dess nivå, ange listan med filter till den tomma listan och skapa ett lås (med :meth:`createLock`) för serialisering av åtkomst till en I/O-mekanism.

source: Initializes a thread lock which can be used to serialize access to underlying I/O functionality which may not be threadsafe.
sv: Initialiserar ett trådlås som kan användas för att serialisera åtkomst till underliggande I/O-funktionalitet som kanske inte är trådsäker.

source: Acquires the thread lock created with :meth:`createLock`.
sv: Förvärvar det trådlås som skapats med :meth:`createLock`.

source: Releases the thread lock acquired with :meth:`acquire`.
sv: Frigör trådlåset som förvärvats med :meth:`acquire`.

source: Sets the threshold for this handler to *level*. Logging messages which are less severe than *level* will be ignored. When a handler is created, the level is set to :const:`NOTSET` (which causes all messages to be processed).
sv: Sätter tröskelvärdet för denna hanterare till *level*. Loggmeddelanden som är mindre allvarliga än *level* ignoreras. När en hanterare skapas sätts nivån till :const:`NOTSET` (vilket gör att alla meddelanden behandlas).

source: The *level* parameter now accepts a string representation of the level such as 'INFO' as an alternative to the integer constants such as :const:`INFO`.
sv: Parametern *level* accepterar nu en strängrepresentation av nivån, t.ex. 'INFO', som ett alternativ till heltalskonstanter, t.ex. :const:`INFO`.

source: Sets the formatter for this handler to *fmt*. The *fmt* argument must be a :class:`Formatter` instance or ``None``.
sv: Ställer in formateraren för denna hanterare till *fmt*. Argumentet *fmt* måste vara en instans av :class:`Formatter` eller ``None``.

source: Adds the specified filter *filter* to this handler.
sv: Lägger till det angivna filtret *filter* till denna hanterare.

source: Removes the specified filter *filter* from this handler.
sv: Tar bort det angivna filtret *filter* från den här hanteraren.

source: Apply this handler's filters to the record and return ``True`` if the record is to be processed. The filters are consulted in turn, until one of them returns a false value. If none of them return a false value, the record will be emitted. If one returns a false value, the handler will not emit the record.
sv: Tillämpa den här hanterarens filter på posten och returnera ``True`` om posten ska behandlas. Filtren konsulteras i tur och ordning tills ett av dem returnerar ett falskt värde. Om inget av dem returnerar ett falskt värde kommer posten att sändas ut. Om ett av filtren returnerar ett falskt värde, kommer hanteraren inte att skicka ut posten.

source: Ensure all logging output has been flushed. This version does nothing and is intended to be implemented by subclasses.
sv: Säkerställ att all loggningsutdata har rensats. Den här versionen gör ingenting och är avsedd att implementeras av underklasser.

source: Tidy up any resources used by the handler. This version does no output but removes the handler from an internal map of handlers, which is used for handler lookup by name.
sv: Städa upp alla resurser som används av hanteraren. Den här versionen gör ingen utmatning men tar bort hanteraren från en intern karta över hanterare, som används för att söka efter hanterare med namn.

source: Subclasses should ensure that this gets called from overridden :meth:`close` methods.
sv: Subklasser bör se till att detta anropas från åsidosatta :meth:`close`-metoder.

source: Conditionally emits the specified logging record, depending on filters which may have been added to the handler. Wraps the actual emission of the record with acquisition/release of the I/O thread lock.
sv: Sänder villkorligt ut den angivna loggningsposten, beroende på filter som kan ha lagts till i hanteraren. Omsluter den faktiska utsändningen av posten med förvärv/lösen av I/O-trådens lås.

source: This method should be called from handlers when an exception is encountered during an :meth:`emit` call. If the module-level attribute :data:`raiseExceptions` is ``False``, exceptions get silently ignored. This is what is mostly wanted for a logging system - most users will not care about errors in the logging system, they are more interested in application errors. You could, however, replace this with a custom handler if you wish. The specified record is the one which was being processed when the exception occurred. (The default value of :data:`raiseExceptions` is ``True``, as that is more useful during development).
sv: Denna metod bör anropas från hanterare när ett undantag inträffar under ett anrop av :meth:`emit`. Om modulnivåattributet :data:`raiseExceptions` är ``False``, ignoreras undantag i tysthet. Detta är vad som oftast önskas för ett loggningssystem - de flesta användare kommer inte att bry sig om fel i loggningssystemet, de är mer intresserade av applikationsfel. Du kan dock ersätta detta med en anpassad hanterare om du vill. Den angivna posten är den som höll på att bearbetas när undantaget inträffade. (Standardvärdet för :data:`raiseExceptions` är ``True``, eftersom det är mer användbart under utveckling).

source: Do formatting for a record - if a formatter is set, use it. Otherwise, use the default formatter for the module.
sv: Gör formatering för en post - om en formaterare är inställd, använd den. Annars används standardformateringen för modulen.

source: Do whatever it takes to actually log the specified logging record. This version is intended to be implemented by subclasses and so raises a :exc:`NotImplementedError`.
sv: Gör vad som krävs för att faktiskt logga den angivna loggningsposten. Denna version är avsedd att implementeras av underklasser och ger därför upphov till ett :exc:`NotImplementedError`.

source: This method is called after a handler-level lock is acquired, which is released after this method returns. When you override this method, note that you should be careful when calling anything that invokes other parts of the logging API which might do locking, because that might result in a deadlock. Specifically:
sv: Denna metod anropas efter att ett lås på hanterarnivå har förvärvats, vilket frigörs efter att denna metod returneras. När du åsidosätter den här metoden, observera att du bör vara försiktig när du anropar något som anropar andra delar av loggnings-API:t som kan göra låsning, eftersom det kan leda till ett dödläge. Specifikt för detta:

source: Logging configuration APIs acquire the module-level lock, and then individual handler-level locks as those handlers are configured.
sv: API:er för loggningskonfiguration förvärvar låset på modulnivå och sedan lås på individuell hanterarnivå när dessa hanterare konfigureras.

source: Many logging APIs lock the module-level lock. If such an API is called from this method, it could cause a deadlock if a configuration call is made on another thread, because that thread will try to acquire the module-level lock *before* the handler-level lock, whereas this thread tries to acquire the module-level lock *after* the handler-level lock (because in this method, the handler-level lock has already been acquired).
sv: Många API:er för loggning låser låset på modulnivå. Om ett sådant API anropas från den här metoden kan det orsaka ett dödläge om ett konfigurationsanrop görs i en annan tråd, eftersom den tråden kommer att försöka förvärva låset på modulnivå *före* låset på hanterarnivå, medan den här tråden försöker förvärva låset på modulnivå *efter* låset på hanterarnivå (eftersom låset på hanterarnivå redan har förvärvats i den här metoden).

source: For a list of handlers included as standard, see :mod:`logging.handlers`.
sv: För en lista över de handlers som ingår som standard, se :mod:`logging.handlers`.

source: Formatter Objects
sv: Formateringsobjekt

source: Responsible for converting a :class:`LogRecord` to an output string to be interpreted by a human or external system.
sv: Ansvarig för att omvandla en :class:`LogRecord` till en utdatasträng som kan tolkas av en människa eller ett externt system.

source: Parameters
sv: Parametrar

source: A format string in the given *style* for the logged output as a whole. The possible mapping keys are drawn from the :class:`LogRecord` object's :ref:`logrecord-attributes`. If not specified, ``'%(message)s'`` is used, which is just the logged message.
sv: En formatsträng i den angivna *stilen* för den loggade utdata som helhet. De möjliga mappningsnycklarna hämtas från :class:`LogRecord`-objektets :ref:`logrecord-attributes`. Om inget anges används ``'%(message)s'``, vilket bara är det loggade meddelandet.

source: A format string in the given *style* for the date/time portion of the logged output. If not specified, the default described in :meth:`formatTime` is used.
sv: En formatsträng i den angivna *stilen* för datum/tid-delen av den loggade utdata. Om inget anges används standardvärdet som beskrivs i :meth:`formatTime`.
