Repository: yeager/python-docs-sv
Catalog: library/logging.po
Languages: sv

source: :mod:`!logging` --- Logging facility for Python
sv: :mod:`!logging` --- Loggningsfunktion för Python

source: **Source code:** :source:`Lib/logging/__init__.py`
sv: **Källkod:** :source:`Lib/logging/__init__.py`

source: This page contains the API reference information. For tutorial information and discussion of more advanced topics, see
sv: Den här sidan innehåller API-referensinformation. För information om handledning och diskussion om mer avancerade ämnen, se

source: :ref:`Advanced Tutorial <logging-advanced-tutorial>`
sv: :ref:`Avancerad handledning <logging-advanced-tutorial>`

source: :ref:`Logging Cookbook <logging-cookbook>`
sv: :ref:`Loggning av kokbok <logging-cookbook>`

source: This module defines functions and classes which implement a flexible event logging system for applications and libraries.
sv: Denna modul definierar funktioner och klasser som implementerar ett flexibelt händelseloggningssystem för applikationer och bibliotek.

source: The key benefit of having the logging API provided by a standard library module is that all Python modules can participate in logging, so your application log can include your own messages integrated with messages from third-party modules.
sv: Den största fördelen med att API:et för loggning tillhandahålls av en standardbiblioteksmodul är att alla Python-moduler kan delta i loggning, så att din applikationslogg kan innehålla dina egna meddelanden integrerade med meddelanden från tredjepartsmoduler.

source: Here's a simple example of idiomatic usage: ::
sv: Här är ett enkelt exempel på idiomatisk användning: ::

source: If you run *myapp.py*, you should see this in *myapp.log*:
sv: Om du kör *myapp.py* bör du se detta i *myapp.log*:

source: INFO:__main__:Started INFO:mylib:Doing something INFO:__main__:Finished
sv: INFO:__main__:Startade INFO:mylib:Gör något INFO:__main__:Avslutad

source: The key feature of this idiomatic usage is that the majority of code is simply creating a module level logger with ``getLogger(__name__)``, and using that logger to do any needed logging. This is concise, while allowing downstream code fine-grained control if needed. Logged messages to the module-level logger get forwarded to handlers of loggers in higher-level modules, all the way up to the highest-level logger known as the root logger; this approach is known as hierarchical logging.
sv: Den viktigaste egenskapen hos denna idiomatiska användning är att majoriteten av koden helt enkelt skapar en logger på modulnivå med ``getLogger(__name__)`` och använder den loggern för att göra all nödvändig loggning. Detta är kortfattat, samtidigt som det tillåter nedströmskod finkornig kontroll om det behövs. Loggade meddelanden till loggern på modulnivå vidarebefordras till hanterare av loggrar i moduler på högre nivåer, hela vägen upp till loggern på högsta nivå, känd som rotloggern; detta tillvägagångssätt kallas hierarkisk loggning.

source: For logging to be useful, it needs to be configured: setting the levels and destinations for each logger, potentially changing how specific modules log, often based on command-line arguments or application configuration. In most cases, like the one above, only the root logger needs to be so configured, since all the lower level loggers at module level eventually forward their messages to its handlers. :func:`~logging.basicConfig` provides a quick way to configure the root logger that handles many use cases.
sv: För att loggning ska vara användbar måste den konfigureras: ange nivåer och destinationer för varje logger, eventuellt ändra hur specifika moduler loggar, ofta baserat på kommandoradsargument eller programkonfiguration. I de flesta fall, som i fallet ovan, är det bara rotloggaren som behöver konfigureras på detta sätt, eftersom alla loggar på lägre nivåer på modulnivå i slutändan vidarebefordrar sina meddelanden till dess hanterare. :func:`~logging.basicConfig` ger ett snabbt sätt att konfigurera rotloggaren som hanterar många användningsfall.

source: The module provides a lot of functionality and flexibility. If you are unfamiliar with logging, the best way to get to grips with it is to view the tutorials (**see the links above and on the right**).
sv: Modulen ger mycket funktionalitet och flexibilitet. Om du inte är bekant med loggning är det bästa sättet att komma igång att titta på handledningarna (**se länkarna ovan och till höger**).

source: The basic classes defined by the module, together with their attributes and methods, are listed in the sections below.
sv: De grundläggande klasser som definieras av modulen, tillsammans med deras attribut och metoder, listas i avsnitten nedan.

source: Loggers expose the interface that application code directly uses.
sv: Loggar exponerar det gränssnitt som applikationskoden använder direkt.

source: Handlers send the log records (created by loggers) to the appropriate destination.
sv: Hanterare skickar loggposter (som skapats av loggar) till lämplig destination.

source: Filters provide a finer grained facility for determining which log records to output.
sv: Filter ger en mer finfördelad möjlighet att bestämma vilka loggposter som ska matas ut.

source: Formatters specify the layout of log records in the final output.
sv: Formatterare specificerar layouten för loggposter i den slutliga utskriften.

source: Logger Objects
sv: Logger-objekt

source: Loggers have the following attributes and methods. Note that Loggers should *NEVER* be instantiated directly, but always through the module-level function ``logging.getLogger(name)``. Multiple calls to :func:`getLogger` with the same name will always return a reference to the same Logger object.
sv: Loggrar har följande attribut och metoder. Observera att loggar *ALDRIG* ska instansieras direkt, utan alltid genom funktionen ``logging.getLogger(name)`` på modulnivå. Flera anrop till :func:`getLogger` med samma namn kommer alltid att returnera en referens till samma Logger-objekt.

source: The ``name`` is potentially a period-separated hierarchical value, like ``foo.bar.baz`` (though it could also be just plain ``foo``, for example). Loggers that are further down in the hierarchical list are children of loggers higher up in the list. For example, given a logger with a name of ``foo``, loggers with names of ``foo.bar``, ``foo.bar.baz``, and ``foo.bam`` are all descendants of ``foo``. In addition, all loggers are descendants of the root logger. The logger name hierarchy is analogous to the Python package hierarchy, and identical to it if you organise your loggers on a per-module basis using the recommended construction ``logging.getLogger(__name__)``. That's because in a module, ``__name__`` is the module's name in the Python package namespace.
sv: Namnet kan vara ett periodseparerat hierarkiskt värde, t.ex. "foo.bar.baz" (men det kan också vara bara "foo", till exempel). Loggar som ligger längre ner i den hierarkiska listan är barn till loggar högre upp i listan. Om du till exempel har en logger med namnet ``foo``, är loggrar med namnen ``foo.bar``, ``foo.bar.baz`` och ``foo.bam`` alla ättlingar till ``foo``. Dessutom är alla loggrar ättlingar till rotloggaren. Loggarnas namnhierarki är analog med Pythons pakethierarki, och identisk med den om du organiserar dina loggar per modul med hjälp av den rekommenderade konstruktionen ``logging.getLogger(__name__)``. Det beror på att i en modul är ``__name__`` modulens namn i Python-paketets namnrymd.

source: This is the logger's name, and is the value that was passed to :func:`getLogger` to obtain the logger.
sv: Detta är loggarens namn och är det värde som skickades till :func:`getLogger` för att hämta loggern.

source: This attribute should be treated as read-only.
sv: Detta attribut bör behandlas som skrivskyddat.

source: The threshold of this logger, as set by the :meth:`setLevel` method.
sv: Tröskelvärdet för denna logger, som anges med metoden :meth:`setLevel`.

source: Do not set this attribute directly - always use :meth:`setLevel`, which has checks for the level passed to it.
sv: Ställ inte in detta attribut direkt - använd alltid :meth:`setLevel`, som kontrollerar den nivå som skickas till den.

source: The parent logger of this logger. It may change based on later instantiation of loggers which are higher up in the namespace hierarchy.
sv: Den här loggarens överordnade logger. Den kan ändras beroende på senare instansiering av loggrar som ligger högre upp i namnrymdshierarkin.

source: This value should be treated as read-only.
sv: Detta värde bör behandlas som skrivskyddat.

source: If this attribute evaluates to true, events logged to this logger will be passed to the handlers of higher level (ancestor) loggers, in addition to any handlers attached to this logger. Messages are passed directly to the ancestor loggers' handlers - neither the level nor filters of the ancestor loggers in question are considered.
sv: Om detta attribut utvärderas till true, kommer händelser som loggas i denna logger att skickas till hanterare av loggrar på högre nivå (förfäder), utöver eventuella hanterare som är kopplade till denna logger. Meddelanden skickas direkt till de överordnade loggarnas hanterare - varken nivån eller filtren för de överordnade loggarna i fråga beaktas.

source: If this evaluates to false, logging messages are not passed to the handlers of ancestor loggers.
sv: Om detta utvärderas till false, skickas inte loggarnas meddelanden till hanterarna av förfädernas loggar.

source: Spelling it out with an example: If the propagate attribute of the logger named ``A.B.C`` evaluates to true, any event logged to ``A.B.C`` via a method call such as ``logging.getLogger('A.B.C').error(...)`` will [subject to passing that logger's level and filter settings] be passed in turn to any handlers attached to loggers named ``A.B``, ``A`` and the root logger, after first being passed to any handlers attached to ``A.B.C``. If any logger in the chain ``A.B.C``, ``A.B``, ``A`` has its ``propagate`` attribute set to false, then that is the last logger whose handlers are offered the event to handle, and propagation stops at that point.
sv: Stava ut det med ett exempel: Om propagate-attributet för loggern med namnet ``A.B.C`` utvärderas till true, kommer alla händelser som loggas till ``A.B.C`` via ett metodanrop som ``logging.getLogger('A.B.C').error(...)`` [med förbehåll för att loggarens nivå- och filterinställningar passerar] att i sin tur passera till alla hanterare som är kopplade till loggar med namnen ``A.B``, ``A`` och rotloggern, efter att först ha passerat till alla hanterare som är kopplade till ``A.B.C``. Om någon logger i kedjan ``A.B.C``, ``A.B``, ``A`` har sitt ``propagate``-attribut satt till false, så är det den sista loggern vars hanterare erbjuds händelsen att hantera, och spridningen stoppas vid den punkten.

source: The constructor sets this attribute to ``True``.
sv: Konstruktören sätter detta attribut till ``True``.

source: If you attach a handler to a logger *and* one or more of its ancestors, it may emit the same record multiple times. In general, you should not need to attach a handler to more than one logger - if you just attach it to the appropriate logger which is highest in the logger hierarchy, then it will see all events logged by all descendant loggers, provided that their propagate setting is left set to ``True``. A common scenario is to attach handlers only to the root logger, and to let propagation take care of the rest.
sv: Om du kopplar en hanterare till en logger *och* en eller flera av dess förfäder kan det hända att den skickar ut samma post flera gånger. I allmänhet behöver du inte koppla en hanterare till mer än en logger - om du bara kopplar den till den lämpliga logger som är högst upp i loggerhierarkin kommer den att se alla händelser som loggas av alla loggrar i nedstigande led, förutsatt att deras propagate-inställning är inställd på ``True``. Ett vanligt scenario är att bifoga hanterare endast till rotloggaren och låta spridningen ta hand om resten.

source: The list of handlers directly attached to this logger instance.
sv: Listan över handläggare som är direkt kopplade till denna loggerinstans.

source: This attribute should be treated as read-only; it is normally changed via the :meth:`addHandler` and :meth:`removeHandler` methods, which use locks to ensure thread-safe operation.
sv: Detta attribut bör behandlas som skrivskyddat; det ändras normalt via metoderna :meth:`addHandler` och :meth:`removeHandler`, som använder lås för att säkerställa trådsäker drift.

source: This attribute disables handling of any events. It is set to ``False`` in the initializer, and only changed by logging configuration code.
sv: Detta attribut inaktiverar hantering av alla händelser. Det sätts till ``False`` i initialiseraren och ändras endast genom konfigurationskod för loggning.

source: Sets the threshold for this logger to *level*. Logging messages which are less severe than *level* will be ignored; logging messages which have severity *level* or higher will be emitted by whichever handler or handlers service this logger, unless a handler's level has been set to a higher severity level than *level*.
sv: Sätter tröskelvärdet för denna logger till *level*. Loggmeddelanden som är mindre allvarliga än *level* ignoreras; loggmeddelanden som har allvarlighetsgrad *level* eller högre kommer att skickas ut av den eller de hanterare som betjänar denna logger, såvida inte hanterarens nivå har ställts in på en högre allvarlighetsgrad än *level*.

source: When a logger is created, the level is set to :const:`NOTSET` (which causes all messages to be processed when the logger is the root logger, or delegation to the parent when the logger is a non-root logger). Note that the root logger is created with level :const:`WARNING`.
sv: När en logger skapas sätts nivån till :const:`NOTSET` (vilket gör att alla meddelanden behandlas när loggern är rotlogger, eller delegeras till föräldern när loggern är en icke-rotlogger). Observera att rotloggaren skapas med nivån :const:`WARNING`.

source: The term 'delegation to the parent' means that if a logger has a level of NOTSET, its chain of ancestor loggers is traversed until either an ancestor with a level other than NOTSET is found, or the root is reached.
sv: Termen "delegering till överordnad" innebär att om en logger har nivån NOTSET, genomkorsas dess kedja av överordnade loggrar tills antingen en överordnad med en annan nivå än NOTSET hittas eller roten nås.

source: If an ancestor is found with a level other than NOTSET, then that ancestor's level is treated as the effective level of the logger where the ancestor search began, and is used to determine how a logging event is handled.
sv: Om en förfader hittas med en annan nivå än NOTSET, behandlas den förfaderns nivå som den effektiva nivån för den logger där förfaderssökningen började och används för att avgöra hur en logghändelse ska hanteras.

source: If the root is reached, and it has a level of NOTSET, then all messages will be processed. Otherwise, the root's level will be used as the effective level.
sv: Om roten nås och den har en nivå på NOTSET kommer alla meddelanden att behandlas. I annat fall kommer rotens nivå att användas som effektiv nivå.

source: See :ref:`levels` for a list of levels.
sv: Se :ref:`levels` för en lista över nivåer.

source: The *level* parameter now accepts a string representation of the level such as 'INFO' as an alternative to the integer constants such as :const:`INFO`. Note, however, that levels are internally stored as integers, and methods such as e.g. :meth:`getEffectiveLevel` and :meth:`isEnabledFor` will return/expect to be passed integers.
sv: Parametern *level* accepterar nu en strängrepresentation av nivån, t.ex. 'INFO', som ett alternativ till heltalskonstanter som :const:`INFO`. Observera dock att nivåer lagras internt som heltal, och metoder som t.ex. :meth:`getEffectiveLevel` och :meth:`isEnabledFor` returnerar/förväntar sig att få heltal skickade till sig.

source: Indicates if a message of severity *level* would be processed by this logger. This method checks first the module-level level set by ``logging.disable(level)`` and then the logger's effective level as determined by :meth:`getEffectiveLevel`.
sv: Anger om ett meddelande med allvarlighetsgrad *level* skulle behandlas av denna logger. Den här metoden kontrollerar först nivån på modulnivå som anges av ``logging.disable(level)`` och sedan loggarens effektiva nivå som bestäms av :meth:`getEffectiveLevel`.

source: Indicates the effective level for this logger. If a value other than :const:`NOTSET` has been set using :meth:`setLevel`, it is returned. Otherwise, the hierarchy is traversed towards the root until a value other than :const:`NOTSET` is found, and that value is returned. The value returned is an integer, typically one of :const:`logging.DEBUG`, :const:`logging.INFO` etc.
sv: Anger den effektiva nivån för denna logger. Om ett annat värde än :const:`NOTSET` har angetts med :meth:`setLevel`, returneras det. I annat fall genomkorsas hierarkin mot roten tills ett annat värde än :const:`NOTSET` hittas, och det värdet returneras. Värdet som returneras är ett heltal, vanligtvis ett av :const:`logging.DEBUG`, :const:`logging.INFO` etc.

source: Returns a logger which is a descendant to this logger, as determined by the suffix. Thus, ``logging.getLogger('abc').getChild('def.ghi')`` would return the same logger as would be returned by ``logging.getLogger('abc.def.ghi')``. This is a convenience method, useful when the parent logger is named using e.g. ``__name__`` rather than a literal string.
sv: Returnerar en logger som är en ättling till denna logger, vilket bestäms av suffixet. Således skulle ``logging.getLogger('abc').getChild('def.ghi')`` returnera samma logger som skulle returneras av ``logging.getLogger('abc.def.ghi')``. Detta är en bekvämlighetsmetod som är användbar när den överordnade loggern namnges med t.ex. ``__name__`` i stället för en bokstavlig sträng.

source: Returns a set of loggers which are immediate children of this logger. So for example ``logging.getLogger().getChildren()`` might return a set containing loggers named ``foo`` and ``bar``, but a logger named ``foo.bar`` wouldn't be included in the set. Likewise, ``logging.getLogger('foo').getChildren()`` might return a set including a logger named ``foo.bar``, but it wouldn't include one named ``foo.bar.baz``.
sv: Returnerar en uppsättning loggrar som är omedelbara barn till denna logger. Så till exempel kan ``logging.getLogger().getChildren()`` returnera en uppsättning som innehåller loggrar med namnen ``foo`` och ``bar``, men en logger med namnet ``foo.bar`` skulle inte ingå i uppsättningen. På samma sätt kan ``logging.getLogger('foo').getChildren()`` returnera en uppsättning som innehåller en logger med namnet ``foo.bar``, men den skulle inte innehålla en med namnet ``foo.bar.baz``.

source: Logs a message with level :const:`DEBUG` on this logger. The *msg* is the message format string, and the *args* are the arguments which are merged into *msg* using the string formatting operator. (Note that this means that you can use keywords in the format string, together with a single dictionary argument.) No % formatting operation is performed on *msg* when no *args* are supplied.
sv: Loggar ett meddelande med nivån :const:`DEBUG` på den här loggern. *msg* är meddelandets formatsträng och *args* är de argument som slås samman till *msg* med hjälp av strängformateringsoperatorn. (Observera att detta innebär att du kan använda nyckelord i formatsträngen tillsammans med ett enda ordboksargument) Ingen % formatering utförs på *msg* när inga *args* anges.

source: There are four keyword arguments in *kwargs* which are inspected: *exc_info*, *stack_info*, *stacklevel* and *extra*.
sv: Det finns fyra nyckelordsargument i *kwargs* som inspekteras: *exc_info*, *stack_info*, *stacklevel* och *extra*.

source: If *exc_info* does not evaluate as false, it causes exception information to be added to the logging message. If an exception tuple (in the format returned by :func:`sys.exc_info`) or an exception instance is provided, it is used; otherwise, :func:`sys.exc_info` is called to get the exception information.
sv: Om *exc_info* inte utvärderas som false, läggs information om undantaget till i loggmeddelandet. Om en undantagstupel (i det format som returneras av :func:`sys.exc_info`) eller en undantagsinstans tillhandahålls, används den; annars anropas :func:`sys.exc_info` för att hämta undantagsinformationen.

source: The second optional keyword argument is *stack_info*, which defaults to ``False``. If true, stack information is added to the logging message, including the actual logging call. Note that this is not the same stack information as that displayed through specifying *exc_info*: The former is stack frames from the bottom of the stack up to the logging call in the current thread, whereas the latter is information about stack frames which have been unwound, following an exception, while searching for exception handlers.
sv: Det andra valfria nyckelordsargumentet är *stack_info*, som har standardvärdet ``False``. Om det är sant läggs stackinformation till i loggmeddelandet, inklusive det faktiska loggningsanropet. Observera att detta inte är samma stackinformation som den som visas om du anger *exc_info*: Den förstnämnda är stapelramar från botten av stacken fram till loggningsanropet i den aktuella tråden, medan den sistnämnda är information om stapelramar som har rullats upp efter ett undantag när man söker efter undantagshanterare.

source: You can specify *stack_info* independently of *exc_info*, e.g. to just show how you got to a certain point in your code, even when no exceptions were raised. The stack frames are printed following a header line which says:
sv: Du kan ange *stack_info* oberoende av *exc_info*, t.ex. om du bara vill visa hur du kom till en viss punkt i din kod, även om inga undantag uppstod. Stackramarna skrivs ut efter en rubrikrad som säger:

source: Stack (most recent call last):
sv: Stack (senaste anropet senast):

source: This mimics the ``Traceback (most recent call last):`` which is used when displaying exception frames.
sv: Detta efterliknar ``Traceback (most recent call last):`` som används vid visning av undantagsramar.

source: The third optional keyword argument is *stacklevel*, which defaults to ``1``. If greater than 1, the corresponding number of stack frames are skipped when computing the line number and function name set in the :class:`LogRecord` created for the logging event. This can be used in logging helpers so that the function name, filename and line number recorded are not the information for the helper function/method, but rather its caller. The name of this parameter mirrors the equivalent one in the :mod:`warnings` module.
sv: Det tredje valfria nyckelordsargumentet är *stacklevel*, som har standardvärdet ``1``. Om det är större än 1 hoppas motsvarande antal stack frames över vid beräkning av radnummer och funktionsnamn som anges i :class:`LogRecord` som skapats för loggningshändelsen. Detta kan användas i hjälpfunktioner för loggning så att det funktionsnamn, filnamn och radnummer som registreras inte är information för hjälpfunktionen/metoden, utan för den som anropar den. Namnet på denna parameter speglar motsvarande parameter i modulen :mod:`warnings`.
