Repository: yeager/python-docs-sv
Catalog: library/logging.config.po
Languages: sv

source: :mod:`!logging.config` --- Logging configuration
sv: :mod:`!logging.config` --- Konfiguration av loggning

source: **Source code:** :source:`Lib/logging/config.py`
sv: **Källkod:** :source:`Lib/logging/config.py`

source: This page contains only reference information. For tutorials, please see
sv: Denna sida innehåller endast referensinformation. För handledning, vänligen se

source: :ref:`Basic Tutorial <logging-basic-tutorial>`
sv: :ref:``Grundläggande handledning <logging-basic-tutorial>``

source: :ref:`Advanced Tutorial <logging-advanced-tutorial>`
sv: :ref:`Avancerad handledning <logging-advanced-tutorial>`

source: :ref:`Logging Cookbook <logging-cookbook>`
sv: :ref:`Loggningskokbok <logging-cookbook>`

source: This section describes the API for configuring the logging module.
sv: I det här avsnittet beskrivs API:et för konfiguration av loggmodulen.

source: Configuration functions
sv: Funktioner för konfiguration

source: The following functions configure the logging module. They are located in the :mod:`logging.config` module. Their use is optional --- you can configure the logging module using these functions or by making calls to the main API (defined in :mod:`logging` itself) and defining handlers which are declared either in :mod:`logging` or :mod:`logging.handlers`.
sv: Följande funktioner konfigurerar loggningsmodulen. De finns i modulen :mod:`logging.config`. Användningen av dem är valfri --- du kan konfigurera loggmodulen med hjälp av dessa funktioner eller genom att göra anrop till huvud-API:t (definierat i :mod:`logging` själv) och definiera hanterare som deklareras antingen i :mod:`logging` eller :mod:`logging.handlers`.

source: Takes the logging configuration from a dictionary. The contents of this dictionary are described in :ref:`logging-config-dictschema` below.
sv: Hämtar loggningskonfigurationen från en ordbok. Innehållet i denna ordbok beskrivs i :ref:`logging-config-dictschema` nedan.

source: If an error is encountered during configuration, this function will raise a :exc:`ValueError`, :exc:`TypeError`, :exc:`AttributeError` or :exc:`ImportError` with a suitably descriptive message. The following is a (possibly incomplete) list of conditions which will raise an error:
sv: Om ett fel uppstår under konfigurationen kommer denna funktion att ge upphov till :exc:`ValueError`, :exc:`TypeError`, :exc:`AttributeError` eller :exc:`ImportError` med ett lämpligt beskrivande meddelande. Följande är en (eventuellt ofullständig) lista över villkor som ger upphov till ett fel:

source: A ``level`` which is not a string or which is a string not corresponding to an actual logging level.
sv: En ``level`` som inte är en sträng eller som är en sträng som inte motsvarar en faktisk loggningsnivå.

source: A ``propagate`` value which is not a boolean.
sv: Ett ``propagate``-värde som inte är en boolean.

source: An id which does not have a corresponding destination.
sv: Ett id som inte har någon motsvarande destination.

source: A non-existent handler id found during an incremental call.
sv: Ett icke-existerande hanterar-id hittades under ett inkrementellt anrop.

source: An invalid logger name.
sv: Ett ogiltigt loggarnamn.

source: Inability to resolve to an internal or external object.
sv: Oförmåga att bestämma sig för ett inre eller yttre objekt.

source: Parsing is performed by the :class:`DictConfigurator` class, whose constructor is passed the dictionary used for configuration, and has a :meth:`configure` method. The :mod:`logging.config` module has a callable attribute :attr:`dictConfigClass` which is initially set to :class:`DictConfigurator`. You can replace the value of :attr:`dictConfigClass` with a suitable implementation of your own.
sv: Parsningen utförs av klassen :class:`DictConfigurator`, vars konstruktör får den ordbok som används för konfigurationen och har en metod :meth:`configure`. Modulen :mod:`logging.config` har ett anropbart attribut :attr:`dictConfigClass` som initialt är inställt på :class:`DictConfigurator`. Du kan ersätta värdet på :attr:`dictConfigClass` med en egen lämplig implementation.

source: :func:`dictConfig` calls :attr:`dictConfigClass` passing the specified dictionary, and then calls the :meth:`configure` method on the returned object to put the configuration into effect::
sv: :func:`dictConfig` anropar :attr:`dictConfigClass` som skickar den angivna ordlistan, och anropar sedan :meth:`configure`-metoden på det returnerade objektet för att sätta konfigurationen i kraft::

source: For example, a subclass of :class:`DictConfigurator` could call ``DictConfigurator.__init__()`` in its own :meth:`__init__`, then set up custom prefixes which would be usable in the subsequent :meth:`configure` call. :attr:`dictConfigClass` would be bound to this new subclass, and then :func:`dictConfig` could be called exactly as in the default, uncustomized state.
sv: Till exempel skulle en underklass till :class:`DictConfigurator` kunna anropa ``DictConfigurator.__init__()`` i sin egen :meth:`__init__`, och sedan ställa in anpassade prefix som skulle kunna användas i det efterföljande :meth:`configure`-anropet. :attr:`dictConfigClass` skulle bindas till denna nya underklass, och sedan skulle :func:`dictConfig` kunna anropas exakt som i standardtillståndet, utan anpassning.

source: Reads the logging configuration from a :mod:`configparser`\-format file. The format of the file should be as described in :ref:`logging-config-fileformat`. This function can be called several times from an application, allowing an end user to select from various pre-canned configurations (if the developer provides a mechanism to present the choices and load the chosen configuration).
sv: Läser in loggningskonfigurationen från en fil i formatet :mod:`configparser`. Filens format bör vara det som beskrivs i :ref:`logging-config-fileformat`. Den här funktionen kan anropas flera gånger från en applikation, så att slutanvändaren kan välja mellan olika förinställda konfigurationer (om utvecklaren tillhandahåller en mekanism för att presentera alternativen och ladda den valda konfigurationen).

source: It will raise :exc:`FileNotFoundError` if the file doesn't exist and :exc:`RuntimeError` if the file is invalid or empty.
sv: Den ger upphov till :exc:`FileNotFoundError` om filen inte finns och :exc:`RuntimeError` om filen är ogiltig eller tom.

source: Parameters
sv: Parametrar

source: A filename, or a file-like object, or an instance derived from :class:`~configparser.RawConfigParser`. If a :class:`!RawConfigParser`-derived instance is passed, it is used as is. Otherwise, a :class:`~configparser.ConfigParser` is instantiated, and the configuration read by it from the object passed in ``fname``. If that has a :meth:`readline` method, it is assumed to be a file-like object and read using :meth:`~configparser.ConfigParser.read_file`; otherwise, it is assumed to be a filename and passed to :meth:`~configparser.ConfigParser.read`.
sv: Ett filnamn, eller ett filliknande objekt, eller en instans härledd från :class:`~configparser.RawConfigParser`. Om en :class:`!RawConfigParser`-deriverad instans skickas, används den som den är. Annars instansieras en :class:`~configparser.ConfigParser` och konfigurationen läses av den från objektet som passeras i ``fname``. Om det har en :meth:`readline`-metod, antas det vara ett filliknande objekt och läses med :meth:`~configparser.ConfigParser.read_file`; annars antas det vara ett filnamn och skickas till :meth:`~configparser.ConfigParser.read`.

source: Defaults to be passed to the :class:`!ConfigParser` can be specified in this argument.
sv: Standardvärden som ska skickas till :class:`!ConfigParser` kan anges i detta argument.

source: If specified as ``False``, loggers which exist when this call is made are left enabled. The default is ``True`` because this enables old behaviour in a backward-compatible way. This behaviour is to disable any existing non-root loggers unless they or their ancestors are explicitly named in the logging configuration.
sv: Om det anges som "False" kommer loggar som finns när anropet görs att vara aktiverade. Standardvärdet är ``True`` eftersom detta aktiverar gammalt beteende på ett bakåtkompatibelt sätt. Detta beteende är att inaktivera alla befintliga loggar som inte är rotloggar om inte de eller deras förfäder uttryckligen namnges i loggningskonfigurationen.

source: The encoding used to open file when *fname* is filename.
sv: Den kodning som används för att öppna filen när *fname* är filnamnet.

source: An instance of a subclass of :class:`~configparser.RawConfigParser` is now accepted as a value for ``fname``. This facilitates:
sv: En instans av en underklass till :class:`~configparser.RawConfigParser` accepteras nu som ett värde för ``fname``. Detta underlättar:

source: Use of a configuration file where logging configuration is just part of the overall application configuration.
sv: Användning av en konfigurationsfil där loggningskonfigurationen bara är en del av den övergripande applikationskonfigurationen.

source: Use of a configuration read from a file, and then modified by the using application (e.g. based on command-line parameters or other aspects of the runtime environment) before being passed to ``fileConfig``.
sv: Användning av en konfiguration som läses från en fil och sedan ändras av det användande programmet (t.ex. baserat på kommandoradsparametrar eller andra aspekter av körtidsmiljön) innan den skickas till ``fileConfig``.

source: Added the *encoding* parameter.
sv: Parametern *encoding* har lagts till.

source: An exception will be thrown if the provided file doesn't exist or is invalid or empty.
sv: Ett undantag kommer att kastas om den angivna filen inte finns eller är ogiltig eller tom.

source: Starts up a socket server on the specified port, and listens for new configurations. If no port is specified, the module's default :const:`DEFAULT_LOGGING_CONFIG_PORT` is used. Logging configurations will be sent as a file suitable for processing by :func:`dictConfig` or :func:`fileConfig`. Returns a :class:`~threading.Thread` instance on which you can call :meth:`~threading.Thread.start` to start the server, and which you can :meth:`~threading.Thread.join` when appropriate. To stop the server, call :func:`stopListening`.
sv: Startar upp en socket-server på den angivna porten och lyssnar efter nya konfigurationer. Om ingen port anges används modulens standard :const:`DEFAULT_LOGGING_CONFIG_PORT`. Loggningskonfigurationer kommer att skickas som en fil som kan bearbetas av :func:`dictConfig` eller :func:`fileConfig`. Returnerar en :class:`~threading.Thread`-instans på vilken du kan anropa :meth:`~threading.Thread.start` för att starta servern, och som du kan :meth:`~threading.Thread.join` när det är lämpligt. För att stoppa servern, anropa :func:`stopListening`.

source: The ``verify`` argument, if specified, should be a callable which should verify whether bytes received across the socket are valid and should be processed. This could be done by encrypting and/or signing what is sent across the socket, such that the ``verify`` callable can perform signature verification and/or decryption. The ``verify`` callable is called with a single argument - the bytes received across the socket - and should return the bytes to be processed, or ``None`` to indicate that the bytes should be discarded. The returned bytes could be the same as the passed in bytes (e.g. when only verification is done), or they could be completely different (perhaps if decryption were performed).
sv: Argumentet ``verify``, om det specificeras, bör vara en anropbar funktion som verifierar om byte som tas emot via sockeln är giltiga och bör behandlas. Detta kan göras genom att kryptera och/eller signera det som skickas över sockeln, så att anropsbarnet ``verify`` kan utföra signaturverifiering och/eller dekryptering. Anropsbarheten ``verify`` anropas med ett enda argument - de byte som mottagits över sockeln - och bör returnera de byte som skall behandlas, eller ``None`` för att ange att byte skall kasseras. De returnerade bytena kan vara desamma som de överförda bytena (t.ex. när endast verifiering görs), eller så kan de vara helt annorlunda (kanske om dekryptering utförts).

source: To send a configuration to the socket, read in the configuration file and send it to the socket as a sequence of bytes preceded by a four-byte length string packed in binary using ``struct.pack('>L', n)``.
sv: För att skicka en konfiguration till uttaget läser du in konfigurationsfilen och skickar den till uttaget som en sekvens av byte som föregås av en fyra byte lång sträng som packas binärt med hjälp av ``struct.pack('>L', n)``.

source: Because portions of the configuration are passed through :func:`eval`, use of this function may open its users to a security risk. While the function only binds to a socket on ``localhost``, and so does not accept connections from remote machines, there are scenarios where untrusted code could be run under the account of the process which calls :func:`listen`. Specifically, if the process calling :func:`listen` runs on a multi-user machine where users cannot trust each other, then a malicious user could arrange to run essentially arbitrary code in a victim user's process, simply by connecting to the victim's :func:`listen` socket and sending a configuration which runs whatever code the attacker wants to have executed in the victim's process. This is especially easy to do if the default port is used, but not hard even if a different port is used. To avoid the risk of this happening, use the ``verify`` argument to :func:`listen` to prevent unrecognised configurations from being applied.
sv: Eftersom delar av konfigurationen skickas genom :func:`eval` kan användning av denna funktion innebära en säkerhetsrisk för användaren. Även om funktionen endast binder till ett uttag på ``localhost``, och därför inte accepterar anslutningar från fjärranslutna maskiner, finns det scenarier där opålitlig kod kan köras under kontot för den process som anropar :func:`listen`. Om processen som anropar :func:`listen` körs på en fleranvändarmaskin där användarna inte kan lita på varandra, kan en illvillig användare ordna så att i princip godtycklig kod körs i en utsatt användares process, helt enkelt genom att ansluta till den utsatta användarens :func:`listen`-socket och skicka en konfiguration som kör den kod som angriparen vill ha körd i den utsatta användarens process. Detta är särskilt lätt att göra om standardporten används, men inte svårt även om en annan port används. För att undvika risken att detta händer, använd argumentet ``verify`` till :func:`listen` för att förhindra att konfigurationer som inte känns igen används.

source: The ``verify`` argument was added.
sv: Argumentet ``verify`` har lagts till.

source: If you want to send configurations to the listener which don't disable existing loggers, you will need to use a JSON format for the configuration, which will use :func:`dictConfig` for configuration. This method allows you to specify ``disable_existing_loggers`` as ``False`` in the configuration you send.
sv: Om du vill skicka konfigurationer till lyssnaren som inte inaktiverar befintliga loggar, måste du använda ett JSON-format för konfigurationen, som använder :func:`dictConfig` för konfigurationen. Med den här metoden kan du ange ``disable_existing_loggers`` som ``False`` i den konfiguration du skickar.

source: Stops the listening server which was created with a call to :func:`listen`. This is typically called before calling :meth:`join` on the return value from :func:`listen`.
sv: Stoppar den lyssnande server som skapades med ett anrop till :func:`listen`. Detta anropas vanligtvis innan :meth:`join` anropas på returvärdet från :func:`listen`.

source: Security considerations
sv: Överväganden om säkerhet

source: The logging configuration functionality tries to offer convenience, and in part this is done by offering the ability to convert text in configuration files into Python objects used in logging configuration - for example, as described in :ref:`logging-config-dict-userdef`. However, these same mechanisms (importing callables from user-defined modules and calling them with parameters from the configuration) could be used to invoke any code you like, and for this reason you should treat configuration files from untrusted sources with *extreme caution* and satisfy yourself that nothing bad can happen if you load them, before actually loading them.
sv: Loggningskonfigurationsfunktionaliteten försöker erbjuda bekvämlighet, och delvis görs detta genom att erbjuda möjligheten att konvertera text i konfigurationsfiler till Python-objekt som används i loggningskonfigurationen - till exempel enligt beskrivningen i :ref:`logging-config-dict-userdef`. Samma mekanismer (importera anropbara objekt från användardefinierade moduler och anropa dem med parametrar från konfigurationen) kan dock användas för att anropa vilken kod som helst, och därför bör du behandla konfigurationsfiler från opålitliga källor med *extrema försiktighet* och försäkra dig om att inget dåligt kan hända om du läser in dem innan du faktiskt läser in dem.

source: Configuration dictionary schema
sv: Schema för konfigurationsordbok

source: Describing a logging configuration requires listing the various objects to create and the connections between them; for example, you may create a handler named 'console' and then say that the logger named 'startup' will send its messages to the 'console' handler. These objects aren't limited to those provided by the :mod:`logging` module because you might write your own formatter or handler class. The parameters to these classes may also need to include external objects such as ``sys.stderr``. The syntax for describing these objects and connections is defined in :ref:`logging-config-dict-connections` below.
sv: För att beskriva en loggningskonfiguration måste du lista de olika objekt som ska skapas och kopplingarna mellan dem; du kan till exempel skapa en hanterare med namnet "console" och sedan säga att loggern med namnet "startup" ska skicka sina meddelanden till hanteraren "console". Dessa objekt är inte begränsade till dem som tillhandahålls av modulen :mod:`logging` eftersom du kan skriva din egen formaterare eller hanterarklass. Parametrarna till dessa klasser kan också behöva inkludera externa objekt som ``sys.stderr``. Syntaxen för att beskriva dessa objekt och anslutningar definieras i :ref:`logging-config-dict-connections` nedan.

source: Dictionary Schema Details
sv: Dictionary Schema Detaljer

source: The dictionary passed to :func:`dictConfig` must contain the following keys:
sv: Den ordbok som skickas till :func:`dictConfig` måste innehålla följande nycklar:

source: *version* - to be set to an integer value representing the schema version. The only valid value at present is 1, but having this key allows the schema to evolve while still preserving backwards compatibility.
sv: *version* - ska sättas till ett heltalsvärde som representerar schemaversionen. Det enda giltiga värdet för närvarande är 1, men genom att ha denna nyckel kan schemat utvecklas samtidigt som bakåtkompatibiliteten bevaras.

source: All other keys are optional, but if present they will be interpreted as described below. In all cases below where a 'configuring dict' is mentioned, it will be checked for the special ``'()'`` key to see if a custom instantiation is required. If so, the mechanism described in :ref:`logging-config-dict-userdef` below is used to create an instance; otherwise, the context is used to determine what to instantiate.
sv: Alla andra nycklar är valfria, men om de finns med tolkas de enligt beskrivningen nedan. I alla fall nedan där en "configuring dict" nämns, kommer den att kontrolleras för den speciella nyckeln ``'()'`` för att se om en anpassad instansiering krävs. Om så är fallet används den mekanism som beskrivs i :ref:`logging-config-dict-userdef` nedan för att skapa en instans; annars används sammanhanget för att avgöra vad som ska instansieras.

source: *formatters* - the corresponding value will be a dict in which each key is a formatter id and each value is a dict describing how to configure the corresponding :class:`~logging.Formatter` instance.
sv: *formatters* - motsvarande värde kommer att vara en dict där varje nyckel är ett formatter-id och varje värde är en dict som beskriver hur man konfigurerar motsvarande :class:`~logging.Formatter`-instans.

source: The configuring dict is searched for the following optional keys which correspond to the arguments passed to create a :class:`~logging.Formatter` object:
sv: Konfigurationsdikten genomsöks efter följande valfria nycklar som motsvarar de argument som skickas för att skapa ett :class:`~logging.Formatter`-objekt:

source: ``validate`` (since version >=3.8)
sv: ``validate`` (sedan version >=3.8)

source: ``defaults`` (since version >=3.12)
sv: ``defaults`` (sedan version >=3.12)

source: An optional ``class`` key indicates the name of the formatter's class (as a dotted module and class name). The instantiation arguments are as for :class:`~logging.Formatter`, thus this key is most useful for instantiating a customised subclass of :class:`~logging.Formatter`. For example, the alternative class might present exception tracebacks in an expanded or condensed format. If your formatter requires different or extra configuration keys, you should use :ref:`logging-config-dict-userdef`.
sv: En valfri ``class``-nyckel anger namnet på formaterarens klass (som en prickad modul och klassnamn). Instantieringsargumenten är desamma som för :class:`~logging.Formatter`, så den här nyckeln är mest användbar för instansiering av en anpassad underklass till :class:`~logging.Formatter`. Den alternativa klassen kan t.ex. presentera spårningar av undantag i ett utökat eller förkortat format. Om din formatterare kräver andra eller extra konfigurationsnycklar bör du använda :ref:`logging-config-dict-userdef`.

source: *filters* - the corresponding value will be a dict in which each key is a filter id and each value is a dict describing how to configure the corresponding Filter instance.
sv: *filters* - motsvarande värde kommer att vara en dikt där varje nyckel är ett filter-ID och varje värde är en dikt som beskriver hur man konfigurerar motsvarande filterinstans.

source: The configuring dict is searched for the key ``name`` (defaulting to the empty string) and this is used to construct a :class:`logging.Filter` instance.
sv: Konfigurationsdikten genomsöks efter nyckeln ``name`` (standard är den tomma strängen) och denna används för att konstruera en :class:`logging.Filter`-instans.

source: *handlers* - the corresponding value will be a dict in which each key is a handler id and each value is a dict describing how to configure the corresponding Handler instance.
sv: *handlers* - motsvarande värde kommer att vara ett dict där varje nyckel är ett handläggar-ID och varje värde är ett dict som beskriver hur man konfigurerar motsvarande handläggarinstans.

source: The configuring dict is searched for the following keys:
sv: Konfigurationsdikten genomsöks efter följande nycklar:

source: ``class`` (mandatory). This is the fully qualified name of the handler class.
sv: ``class`` (obligatorisk). Detta är det fullständigt kvalificerade namnet på hanterarklassen.

source: ``level`` (optional). The level of the handler.
sv: ``level`` (valfritt). Behandlarens nivå.

source: ``formatter`` (optional). The id of the formatter for this handler.
sv: ``formatter`` (valfritt). ID för formateraren för den här hanteraren.

source: ``filters`` (optional). A list of ids of the filters for this handler.
sv: ``filters`` (valfritt). En lista med id:n för filtren för den här hanteraren.
