Repository: yeager/python-docs-sv
Catalog: library/logging.config.po
Languages: sv

source: The handling of such prefixes is done in a way analogous to protocol handling: there is a generic mechanism to look for prefixes which match the regular expression ``^(?P<prefix>[a-z]+)://(?P<suffix>.*)$`` whereby, if the ``prefix`` is recognised, the ``suffix`` is processed in a prefix-dependent manner and the result of the processing replaces the string value. If the prefix is not recognised, then the string value will be left as-is.
sv: Hanteringen av sådana prefix sker på ett sätt som är analogt med protokollhantering: det finns en generisk mekanism för att leta efter prefix som matchar det reguljära uttrycket ``^(?P<prefix>[a-z]+)://(?P<suffix>.*)$`` varvid, om ``prefixet`` känns igen, ``uffixet`` bearbetas på ett prefixberoende sätt och resultatet av bearbetningen ersätter strängvärdet. Om prefixet inte känns igen kommer strängvärdet att lämnas som det är.

source: Access to internal objects
sv: Tillgång till interna objekt

source: As well as external objects, there is sometimes also a need to refer to objects in the configuration. This will be done implicitly by the configuration system for things that it knows about. For example, the string value ``'DEBUG'`` for a ``level`` in a logger or handler will automatically be converted to the value ``logging.DEBUG``, and the ``handlers``, ``filters`` and ``formatter`` entries will take an object id and resolve to the appropriate destination object.
sv: Förutom externa objekt finns det ibland också behov av att hänvisa till objekt i konfigurationen. Detta görs implicit av konfigurationssystemet för saker som det känner till. Till exempel konverteras strängvärdet ``'DEBUG`` för en ``nivå`` i en logger eller hanterare automatiskt till värdet ``logging.DEBUG``, och posterna ``handlers``, ``filters`` och ``formatter`` tar ett objekt-ID och löser upp till lämpligt destinationsobjekt.

source: However, a more generic mechanism is needed for user-defined objects which are not known to the :mod:`logging` module. For example, consider :class:`logging.handlers.MemoryHandler`, which takes a ``target`` argument which is another handler to delegate to. Since the system already knows about this class, then in the configuration, the given ``target`` just needs to be the object id of the relevant target handler, and the system will resolve to the handler from the id. If, however, a user defines a ``my.package.MyHandler`` which has an ``alternate`` handler, the configuration system would not know that the ``alternate`` referred to a handler. To cater for this, a generic resolution system allows the user to specify:
sv: Det behövs dock en mer generisk mekanism för användardefinierade objekt som inte är kända av modulen :mod:`logging`. Tänk till exempel på :class:`logging.handlers.MemoryHandler`, som tar ett ``target``-argument som är en annan hanterare att delegera till. Eftersom systemet redan känner till den här klassen behöver det angivna ``target`` i konfigurationen bara vara objekt-id för den relevanta målhanteraren, och systemet kommer att lösa upp till hanteraren från id. Om en användare däremot definierar en ``my.package.MyHandler`` som har en ``alternativ`` hanterare, skulle konfigurationssystemet inte veta att ``alternativ`` refererar till en hanterare. För att tillgodose detta tillåter ett generiskt upplösningssystem användaren att ange:

source: The literal string ``'cfg://handlers.file'`` will be resolved in an analogous way to strings with the ``ext://`` prefix, but looking in the configuration itself rather than the import namespace. The mechanism allows access by dot or by index, in a similar way to that provided by ``str.format``. Thus, given the following snippet:
sv: Den bokstavliga strängen ``'cfg://handlers.file'`` kommer att lösas på ett analogt sätt som strängar med prefixet ``ext://``, men letar i själva konfigurationen snarare än i importnamnrymden. Mekanismen tillåter åtkomst via punkt eller index, på ett liknande sätt som det som tillhandahålls av ``str.format``. Således, givet följande utdrag:

source: in the configuration, the string ``'cfg://handlers'`` would resolve to the dict with key ``handlers``, the string ``'cfg://handlers.email`` would resolve to the dict with key ``email`` in the ``handlers`` dict, and so on. The string ``'cfg://handlers.email.toaddrs[1]`` would resolve to ``'dev_team@domain.tld'`` and the string ``'cfg://handlers.email.toaddrs[0]'`` would resolve to the value ``'support_team@domain.tld'``. The ``subject`` value could be accessed using either ``'cfg://handlers.email.subject'`` or, equivalently, ``'cfg://handlers.email[subject]'``. The latter form only needs to be used if the key contains spaces or non-alphanumeric characters. Please note that the characters ``[`` and ``]`` are not allowed in the keys. If an index value consists only of decimal digits, access will be attempted using the corresponding integer value, falling back to the string value if needed.
sv: i konfigurationen, skulle strängen ``'cfg://handlers`` lösas upp mot diktatet med nyckeln ``handlers``, strängen ``'cfg://handlers.email`` skulle lösas upp mot diktatet med nyckeln ``email`` i diktatet ``handlers``, och så vidare. Strängen ``'cfg://handlers.email.toaddrs[1]`` skulle upplösas till ``'dev_team@domain.tld'`` och strängen ``'cfg://handlers.email.toaddrs[0]'`` skulle upplösas till värdet ``'support_team@domain.tld'``. Värdet ``subject`` kan nås med antingen ``'cfg://handlers.email.subject'`` eller, på motsvarande sätt, ``'cfg://handlers.email[subject]'``. Den senare formen behöver endast användas om nyckeln innehåller mellanslag eller icke-alfanumeriska tecken. Observera att tecknen ``[`` och ``]`` inte är tillåtna i nycklarna. Om ett indexvärde endast består av decimala siffror kommer åtkomstförsök att göras med hjälp av motsvarande heltalsvärde, med återgång till strängvärdet vid behov.

source: Given a string ``cfg://handlers.myhandler.mykey.123``, this will resolve to ``config_dict['handlers']['myhandler']['mykey']['123']``. If the string is specified as ``cfg://handlers.myhandler.mykey[123]``, the system will attempt to retrieve the value from ``config_dict['handlers']['myhandler']['mykey'][123]``, and fall back to ``config_dict['handlers']['myhandler']['mykey']['123']`` if that fails.
sv: Med en sträng ``cfg://handlers.myhandler.mykey.123`` kommer detta att lösas upp till ``config_dict['handlers']['myhandler']['mykey']['123']``. Om strängen anges som ``cfg://handlers.myhandler.mykey[123]`` kommer systemet att försöka hämta värdet från ``config_dict['handlers']['myhandler']['mykey'][123]``, och återgå till ``config_dict['handlers']['myhandler']['mykey']['123']`` om det misslyckas.

source: Import resolution and custom importers
sv: Importupplösning och anpassade importörer

source: Import resolution, by default, uses the builtin :func:`__import__` function to do its importing. You may want to replace this with your own importing mechanism: if so, you can replace the :attr:`importer` attribute of the :class:`DictConfigurator` or its superclass, the :class:`BaseConfigurator` class. However, you need to be careful because of the way functions are accessed from classes via descriptors. If you are using a Python callable to do your imports, and you want to define it at class level rather than instance level, you need to wrap it with :func:`staticmethod`. For example::
sv: Importresolution använder som standard den inbyggda funktionen :func:`__import__` för att göra sin import. Du kanske vill ersätta detta med din egen importmekanism: i så fall kan du ersätta attributet :attr:`importer` i :class:`DictConfigurator` eller dess superklass, :class:`BaseConfigurator`. Du måste dock vara försiktig på grund av hur funktioner nås från klasser via deskriptorer. Om du använder en Python callable för att göra din import, och du vill definiera den på klassnivå snarare än instansnivå, måste du linda in den med :func:`staticmethod`. Till exempel::

source: You don't need to wrap with :func:`staticmethod` if you're setting the import callable on a configurator *instance*.
sv: Du behöver inte omsluta med :func:`staticmethod` om du ställer in importkallelsen på en konfigurator *instans*.

source: Configuring QueueHandler and QueueListener
sv: Konfigurera QueueHandler och QueueListener

source: If you want to configure a :class:`~logging.handlers.QueueHandler`, noting that this is normally used in conjunction with a :class:`~logging.handlers.QueueListener`, you can configure both together. After the configuration, the ``QueueListener`` instance will be available as the :attr:`~logging.handlers.QueueHandler.listener` attribute of the created handler, and that in turn will be available to you using :func:`~logging.getHandlerByName` and passing the name you have used for the ``QueueHandler`` in your configuration. The dictionary schema for configuring the pair is shown in the example YAML snippet below.
sv: Om du vill konfigurera en :class:`~logging.handlers.QueueHandler`, och observera att denna normalt används tillsammans med en :class:`~logging.handlers.QueueListener`, kan du konfigurera båda tillsammans. Efter konfigurationen kommer ``QueueListener``-instansen att vara tillgänglig som attributet :attr:`~logging.handlers.QueueHandler.listener`` för den skapade hanteraren, och den kommer i sin tur att vara tillgänglig för dig genom att använda :func:`~logging.getHandlerByName` och skicka det namn du har använt för ``QueueHandler`` i din konfiguration. Ordboksschemat för konfigurering av paret visas i YAML-exemplet nedan.

source: The ``queue`` and ``listener`` keys are optional.
sv: Nycklarna ``queue`` och ``listener`` är valfria.

source: If the ``queue`` key is present, the corresponding value can be one of the following:
sv: Om nyckeln ``queue`` finns, kan motsvarande värde vara något av följande:

source: An object implementing the :meth:`Queue.put_nowait <queue.Queue.put_nowait>` and :meth:`Queue.get <queue.Queue.get>` public API. For instance, this may be an actual instance of :class:`queue.Queue` or a subclass thereof, or a proxy obtained by :meth:`multiprocessing.managers.SyncManager.Queue`.
sv: Ett objekt som implementerar de publika API:erna :meth:`Queue.put_nowait <queue.Queue.put_nowait>` och :meth:`Queue.get <queue.Queue.get>`. Det kan t.ex. vara en faktisk instans av :class:`queue.Queue` eller en underklass av denna, eller en proxy som erhålls av :meth:`multiprocessing.managers.SyncManager.Queue`.

source: This is of course only possible if you are constructing or modifying the configuration dictionary in code.
sv: Detta är naturligtvis bara möjligt om du konstruerar eller ändrar konfigurationsordlistan i kod.

source: A string that resolves to a callable which, when called with no arguments, returns the queue instance to use. That callable could be a :class:`queue.Queue` subclass or a function which returns a suitable queue instance, such as ``my.module.queue_factory()``.
sv: En sträng som löser upp till en anropsbar som, när den anropas utan argument, returnerar den köinstans som ska användas. Denna anropsbarhet kan vara en :class:`queue.Queue`-underklass eller en funktion som returnerar en lämplig köinstans, till exempel ``my.module.queue_factory()``.

source: A dict with a ``'()'`` key which is constructed in the usual way as discussed in :ref:`logging-config-dict-userdef`. The result of this construction should be a :class:`queue.Queue` instance.
sv: En dict med en ``'()'`` nyckel som är konstruerad på vanligt sätt som beskrivs i :ref:`logging-config-dict-userdef`. Resultatet av denna konstruktion bör vara en instans av :class:`queue.Queue`.

source: If the ``queue`` key is absent, a standard unbounded :class:`queue.Queue` instance is created and used.
sv: Om nyckeln ``queue`` saknas skapas och används en standardiserad obegränsad :class:`queue.Queue`-instans.

source: If the ``listener`` key is present, the corresponding value can be one of the following:
sv: Om nyckeln ``listener`` finns, kan motsvarande värde vara något av följande:

source: A subclass of :class:`logging.handlers.QueueListener`. This is of course only possible if you are constructing or modifying the configuration dictionary in code.
sv: En underklass till :class:`logging.handlers.QueueListener`. Detta är naturligtvis bara möjligt om du konstruerar eller ändrar konfigurationsordlistan i kod.

source: A string which resolves to a class which is a subclass of ``QueueListener``, such as ``'my.package.CustomListener'``.
sv: En sträng som motsvarar en klass som är en underklass till ``QueueListener``, t.ex. ``'my.package.CustomListener'``.

source: A dict with a ``'()'`` key which is constructed in the usual way as discussed in :ref:`logging-config-dict-userdef`. The result of this construction should be a callable with the same signature as the ``QueueListener`` initializer.
sv: En dict med en ``'()'`` nyckel som är konstruerad på det vanliga sättet som diskuteras i :ref:`logging-config-dict-userdef`. Resultatet av denna konstruktion bör vara en callable med samma signatur som initialiseraren för ``QueueListener``.

source: If the ``listener`` key is absent, :class:`logging.handlers.QueueListener` is used.
sv: Om nyckeln ``listener`` saknas används :class:`logging.handlers.QueueListener`.

source: The values under the ``handlers`` key are the names of other handlers in the configuration (not shown in the above snippet) which will be passed to the queue listener.
sv: Värdena under nyckeln ``handlers`` är namnen på andra handlers i konfigurationen (visas inte i utdraget ovan) som kommer att skickas till kölyssnaren.

source: Any custom queue handler and listener classes will need to be defined with the same initialization signatures as :class:`~logging.handlers.QueueHandler` and :class:`~logging.handlers.QueueListener`.
sv: Alla anpassade köhanterings- och lyssnarklasser måste definieras med samma initialiseringssignaturer som :class:`~logging.handlers.QueueHandler` och :class:`~logging.handlers.QueueListener`.

source: Configuration file format
sv: Format för konfigurationsfil

source: The configuration file format understood by :func:`fileConfig` is based on :mod:`configparser` functionality. The file must contain sections called ``[loggers]``, ``[handlers]`` and ``[formatters]`` which identify by name the entities of each type which are defined in the file. For each such entity, there is a separate section which identifies how that entity is configured. Thus, for a logger named ``log01`` in the ``[loggers]`` section, the relevant configuration details are held in a section ``[logger_log01]``. Similarly, a handler called ``hand01`` in the ``[handlers]`` section will have its configuration held in a section called ``[handler_hand01]``, while a formatter called ``form01`` in the ``[formatters]`` section will have its configuration specified in a section called ``[formatter_form01]``. The root logger configuration must be specified in a section called ``[logger_root]``.
sv: Konfigurationsfilens format som förstås av :func:`fileConfig` är baserat på :mod:`configparser` funktionalitet. Filen måste innehålla avsnitt kallade ``[loggers]``, ``[handlers]`` och ``[formatters]`` som identifierar de entiteter av varje typ som definieras i filen. För varje sådan entitet finns ett separat avsnitt som anger hur den entiteten konfigureras. För en logger med namnet ``log01`` i avsnittet ``[loggers]`` finns alltså relevanta konfigurationsdetaljer i avsnittet ``[logger_log01]``. På samma sätt kommer en hanterare som heter ``hand01`` i avsnittet ``[handlers]`` att ha sin konfiguration i ett avsnitt som heter ``[handler_hand01]``, medan en formaterare som heter ``form01`` i avsnittet ``[formaterare]`` kommer att ha sin konfiguration angiven i ett avsnitt som heter ``[formaterare_form01]``. Konfigurationen för rotloggaren måste anges i ett avsnitt som heter ``[logger_root]``.

source: The :func:`fileConfig` API is older than the :func:`dictConfig` API and does not provide functionality to cover certain aspects of logging. For example, you cannot configure :class:`~logging.Filter` objects, which provide for filtering of messages beyond simple integer levels, using :func:`fileConfig`. If you need to have instances of :class:`~logging.Filter` in your logging configuration, you will need to use :func:`dictConfig`. Note that future enhancements to configuration functionality will be added to :func:`dictConfig`, so it's worth considering transitioning to this newer API when it's convenient to do so.
sv: API:et :func:`fileConfig` är äldre än API:et :func:`dictConfig` och innehåller inte funktioner som täcker vissa aspekter av loggning. Du kan t.ex. inte konfigurera :class:`~logging.Filter`-objekt, som möjliggör filtrering av meddelanden utöver enkla heltalsnivåer, med hjälp av :func:`fileConfig`. Om du behöver ha instanser av :class:`~logging.Filter` i din loggningskonfiguration måste du använda :func:`dictConfig`. Observera att framtida förbättringar av konfigurationsfunktionaliteten kommer att läggas till i :func:`dictConfig`, så det är värt att överväga att övergå till detta nyare API när det är lämpligt att göra det.

source: Examples of these sections in the file are given below.
sv: Exempel på dessa avsnitt i filen ges nedan.

source: The root logger must specify a level and a list of handlers. An example of a root logger section is given below.
sv: Rotloggaren måste ange en nivå och en lista över hanterare. Ett exempel på ett root logger-avsnitt ges nedan.

source: The ``level`` entry can be one of ``DEBUG, INFO, WARNING, ERROR, CRITICAL`` or ``NOTSET``. For the root logger only, ``NOTSET`` means that all messages will be logged. Level values are :ref:`evaluated <func-eval>` in the context of the ``logging`` package's namespace.
sv: Posten ``level`` kan vara en av ``DEBUG, INFO, WARNING, ERROR, CRITICAL`` eller ``NOTSET``. Endast för rotloggaren innebär ``NOTSET`` att alla meddelanden loggas. Nivåvärden :ref:``utvärderas <func-eval>`` i kontexten av ``logging``-paketets namnrymd.

source: The ``handlers`` entry is a comma-separated list of handler names, which must appear in the ``[handlers]`` section. These names must appear in the ``[handlers]`` section and have corresponding sections in the configuration file.
sv: Posten ``handlers`` är en kommaseparerad lista med namn på hanterare som måste finnas i avsnittet ``[handlers]``. Dessa namn måste finnas i avsnittet ``[handlers]`` och ha motsvarande avsnitt i konfigurationsfilen.

source: For loggers other than the root logger, some additional information is required. This is illustrated by the following example.
sv: För andra loggrar än rotloggaren krävs viss ytterligare information. Detta illustreras av följande exempel.

source: The ``level`` and ``handlers`` entries are interpreted as for the root logger, except that if a non-root logger's level is specified as ``NOTSET``, the system consults loggers higher up the hierarchy to determine the effective level of the logger. The ``propagate`` entry is set to 1 to indicate that messages must propagate to handlers higher up the logger hierarchy from this logger, or 0 to indicate that messages are **not** propagated to handlers up the hierarchy. The ``qualname`` entry is the hierarchical channel name of the logger, that is to say the name used by the application to get the logger.
sv: Posterna ``level`` och ``handlers`` tolkas som för rotloggaren, förutom att om nivån för en logger som inte är rotloggare anges som ``NOTSET``, konsulterar systemet loggar högre upp i hierarkin för att fastställa loggarens faktiska nivå. Posten ``propagate`` är satt till 1 för att ange att meddelanden måste spridas till handläggare högre upp i loggerhierarkin från denna logger, eller 0 för att ange att meddelanden **inte** sprids till handläggare högre upp i hierarkin. Posten ``qualname`` är loggarens hierarkiska kanalnamn, det vill säga det namn som används av programmet för att hämta loggern.

source: Sections which specify handler configuration are exemplified by the following.
sv: Avsnitt som specificerar konfigurationen av handläggaren exemplifieras av följande.

source: The ``class`` entry indicates the handler's class (as determined by :func:`eval` in the ``logging`` package's namespace). The ``level`` is interpreted as for loggers, and ``NOTSET`` is taken to mean 'log everything'.
sv: Objektet ``class`` anger hanterarens klass (som bestäms av :func:`eval` i ``logging``-paketets namnrymd). ``level`` tolkas som för loggare och ``NOTSET`` tolkas som "logga allt".

source: The ``formatter`` entry indicates the key name of the formatter for this handler. If blank, a default formatter (``logging._defaultFormatter``) is used. If a name is specified, it must appear in the ``[formatters]`` section and have a corresponding section in the configuration file.
sv: Posten ``formatter`` anger nyckelnamnet på formateraren för denna hanterare. Om den är tom används en standardformattering (``logging._defaultFormatter``). Om ett namn anges måste det finnas i avsnittet ``[formatters]`` och ha ett motsvarande avsnitt i konfigurationsfilen.

source: The ``args`` entry, when :ref:`evaluated <func-eval>` in the context of the ``logging`` package's namespace, is the list of arguments to the constructor for the handler class. Refer to the constructors for the relevant handlers, or to the examples below, to see how typical entries are constructed. If not provided, it defaults to ``()``.
sv: Posten ``args``, när :ref:``evaluated <func-eval>`` i samband med ``logging``-paketets namnrymd, är listan över argument till konstruktören för klassen handler. Se konstruktörerna för de relevanta hanterarna, eller exemplen nedan, för att se hur typiska poster konstrueras. Om den inte anges är standardvärdet ``()``.

source: The optional ``kwargs`` entry, when :ref:`evaluated <func-eval>` in the context of the ``logging`` package's namespace, is the keyword argument dict to the constructor for the handler class. If not provided, it defaults to ``{}``.
sv: Den valfria ``kwargs`` posten, när :ref:``evaluated <func-eval>`` i kontexten av ``logging`` paketets namnrymd, är nyckelordsargumentet dict till konstruktören för hanterarklassen. Om det inte anges, är standardvärdet ``{}``.

source: Sections which specify formatter configuration are typified by the following.
sv: Avsnitt som anger formatteringskonfiguration kännetecknas av följande.

source: The arguments for the formatter configuration are the same as the keys in the dictionary schema :ref:`formatters section <logging-config-dictschema-formatters>`.
sv: Argumenten för formatteringskonfigurationen är desamma som nycklarna i ordboksschemat :ref:`formatters section <logging-config-dictschema-formatters>`.

source: The ``defaults`` entry, when :ref:`evaluated <func-eval>` in the context of the ``logging`` package's namespace, is a dictionary of default values for custom formatting fields. If not provided, it defaults to ``None``.
sv: Posten ``defaults``, när :ref:``evaluated <func-eval>`` i kontexten av ``logging``-paketets namnrymd, är en ordbok med standardvärden för anpassade formateringsfält. Om den inte tillhandahålls är standardvärdet ``None``.

source: Due to the use of :func:`eval` as described above, there are potential security risks which result from using the :func:`listen` to send and receive configurations via sockets. The risks are limited to where multiple users with no mutual trust run code on the same machine; see the :func:`listen` documentation for more information.
sv: På grund av användningen av :func:`eval` enligt beskrivningen ovan finns det potentiella säkerhetsrisker som uppstår när :func:`listen` används för att skicka och ta emot konfigurationer via sockets. Riskerna är begränsade till när flera användare utan ömsesidigt förtroende kör kod på samma maskin; se dokumentationen för :func:`listen` för mer information.
