Repository: yeager/python-docs-sv
Catalog: library/logging.po
Languages: sv

source: If *level* is one of the predefined levels :const:`CRITICAL`, :const:`ERROR`, :const:`WARNING`, :const:`INFO` or :const:`DEBUG` then you get the corresponding string. If you have associated levels with names using :func:`addLevelName` then the name you have associated with *level* is returned. If a numeric value corresponding to one of the defined levels is passed in, the corresponding string representation is returned.
sv: Om *level* är en av de fördefinierade nivåerna :const:`CRITICAL`, :const:`ERROR`, :const:`WARNING`, :const:`INFO` eller :const:`DEBUG` så får du motsvarande sträng. Om du har associerat nivåer med namn med hjälp av :func:`addLevelName` så returneras det namn du har associerat med *level*. Om ett numeriskt värde som motsvarar en av de definierade nivåerna skickas in, returneras motsvarande strängrepresentation.

source: The *level* parameter also accepts a string representation of the level such as 'INFO'. In such cases, this functions returns the corresponding numeric value of the level.
sv: Parametern *level* accepterar också en strängrepresentation av nivån, t.ex. "INFO". I sådana fall returnerar denna funktion motsvarande numeriska värde för nivån.

source: If no matching numeric or string value is passed in, the string 'Level %s' % level is returned.
sv: Om inget matchande numeriskt värde eller strängvärde skickas in returneras strängen "Level %s" % level".

source: Levels are internally integers (as they need to be compared in the logging logic). This function is used to convert between an integer level and the level name displayed in the formatted log output by means of the ``%(levelname)s`` format specifier (see :ref:`logrecord-attributes`), and vice versa.
sv: Nivåerna är internt heltal (eftersom de måste jämföras i loggningslogiken). Den här funktionen används för att konvertera mellan en heltalsnivå och det nivånamn som visas i den formaterade loggutmatningen med hjälp av formatspecificeraren ``%(levelname)s`` (se :ref:`logrecord-attributes``), och vice versa.

source: In Python versions earlier than 3.4, this function could also be passed a text level, and would return the corresponding numeric value of the level. This undocumented behaviour was considered a mistake, and was removed in Python 3.4, but reinstated in 3.4.2 due to retain backward compatibility.
sv: I Python-versioner tidigare än 3.4 kunde den här funktionen också ges en textnivå och returnera det motsvarande numeriska värdet för nivån. Detta odokumenterade beteende ansågs vara ett misstag och togs bort i Python 3.4, men återinfördes i 3.4.2 för att bibehålla bakåtkompatibilitet.

source: Returns a handler with the specified *name*, or ``None`` if there is no handler with that name.
sv: Returnerar en hanterare med det angivna *namnet*, eller ``None`` om det inte finns någon hanterare med det namnet.

source: Returns an immutable set of all known handler names.
sv: Returnerar en oföränderlig uppsättning av alla kända hanterarnamn.

source: Creates and returns a new :class:`LogRecord` instance whose attributes are defined by *attrdict*. This function is useful for taking a pickled :class:`LogRecord` attribute dictionary, sent over a socket, and reconstituting it as a :class:`LogRecord` instance at the receiving end.
sv: Skapar och returnerar en ny :class:`LogRecord`-instans vars attribut definieras av *attrdict*. Denna funktion är användbar för att ta en inlagd :class:`LogRecord` attributordbok, skickad över en socket, och återskapa den som en :class:`LogRecord` instans på mottagarsidan.

source: Does basic configuration for the logging system by creating a :class:`StreamHandler` with a default :class:`Formatter` and adding it to the root logger. The functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical` will call :func:`basicConfig` automatically if no handlers are defined for the root logger.
sv: Gör grundläggande konfiguration för loggningssystemet genom att skapa en :class:`StreamHandler` med en standard :class:`Formatter` och lägga till den i rotloggaren. Funktionerna :func:`debug`, :func:`info`, :func:`warning`, :func:`error` och :func:`critical` anropar :func:`basicConfig` automatiskt om inga hanterare har definierats för rotloggaren.

source: This function does nothing if the root logger already has handlers configured, unless the keyword argument *force* is set to ``True``.
sv: Denna funktion gör ingenting om rotloggaren redan har konfigurerade hanterare, såvida inte nyckelordsargumentet *force* är inställt på ``True``.

source: This function should be called from the main thread before other threads are started. In versions of Python prior to 2.7.1 and 3.2, if this function is called from multiple threads, it is possible (in rare circumstances) that a handler will be added to the root logger more than once, leading to unexpected results such as messages being duplicated in the log.
sv: Denna funktion bör anropas från huvudtråden innan andra trådar startas. I versioner av Python före 2.7.1 och 3.2, om denna funktion anropas från flera trådar, är det möjligt (i sällsynta fall) att en hanterare läggs till root-loggern mer än en gång, vilket leder till oväntade resultat som att meddelanden dupliceras i loggen.

source: The following keyword arguments are supported.
sv: Följande nyckelordsargument stöds.

source: *filename*
sv: *filnamn*

source: Specifies that a :class:`FileHandler` be created, using the specified filename, rather than a :class:`StreamHandler`.
sv: Anger att en :class:`FileHandler` ska skapas med det angivna filnamnet, i stället för en :class:`StreamHandler`.

source: If *filename* is specified, open the file in this :ref:`mode <filemodes>`. Defaults to ``'a'``.
sv: Om *filnamn* anges, öppnas filen i detta :ref:`mode <filemodes>`. Standard är ``'a'``.

source: Use the specified format string for the handler. Defaults to attributes ``levelname``, ``name`` and ``message`` separated by colons.
sv: Använd den angivna formatsträngen för hanteraren. Standard är attributen ``levelname``, ``name`` och ``message`` åtskilda med kolon.

source: Use the specified date/time format, as accepted by :func:`time.strftime`.
sv: Använd det angivna datum-/tidsformatet, som accepteras av :func:`time.strftime`.

source: *style*
sv: *stil*

source: If *format* is specified, use this style for the format string. One of ``'%'``, ``'{'`` or ``'$'`` for :ref:`printf-style <old-string-formatting>`, :meth:`str.format` or :class:`string.Template` respectively. Defaults to ``'%'``.
sv: Om *format* anges, används denna stil för formatsträngen. En av ``'%'``, ``'{'`` eller ``'$'`` för :ref:`printf-style <old-string-formatting>`, :meth:`str.format` respektive :class:`string.Template`. Standardvärdet är ``'%'``.

source: *level*
sv: *nivå*

source: Set the root logger level to the specified :ref:`level <levels>`.
sv: Ställ in root-loggernivån till den angivna :ref:`level <levels>`.

source: *stream*
sv: *strömma*

source: Use the specified stream to initialize the :class:`StreamHandler`. Note that this argument is incompatible with *filename* - if both are present, a ``ValueError`` is raised.
sv: Använd den angivna strömmen för att initiera :class:`StreamHandler`. Observera att detta argument är inkompatibelt med *filnamn* - om båda är närvarande kommer ett ``ValueError`` att uppstå.

source: *handlers*
sv: *handläggare*

source: If specified, this should be an iterable of already created handlers to add to the root logger. Any handlers which don't already have a formatter set will be assigned the default formatter created in this function. Note that this argument is incompatible with *filename* or *stream* - if both are present, a ``ValueError`` is raised.
sv: Om detta anges ska det vara en iterabel av redan skapade hanterare som ska läggas till rotloggaren. Alla hanterare som inte redan har en formateringsinställning kommer att tilldelas standardformateringen som skapas i den här funktionen. Observera att detta argument är inkompatibelt med *filnamn* eller *ström* - om båda är närvarande kommer ett ``ValueError`` att uppstå.

source: *force*
sv: *kraft*

source: If this keyword argument is specified as true, any existing handlers attached to the root logger are removed and closed, before carrying out the configuration as specified by the other arguments.
sv: Om detta nyckelordsargument anges som true, tas alla befintliga hanterare som är kopplade till rotloggaren bort och stängs, innan konfigurationen utförs enligt de andra argumenten.

source: *encoding*
sv: *kodning*

source: If this keyword argument is specified along with *filename*, its value is used when the :class:`FileHandler` is created, and thus used when opening the output file.
sv: Om detta nyckelordsargument anges tillsammans med *filnamn*, används dess värde när :class:`FileHandler` skapas, och används således när utdatafilen öppnas.

source: *errors*
sv: *fel*

source: If this keyword argument is specified along with *filename*, its value is used when the :class:`FileHandler` is created, and thus used when opening the output file. If not specified, the value 'backslashreplace' is used. Note that if ``None`` is specified, it will be passed as such to :func:`open`, which means that it will be treated the same as passing 'errors'.
sv: Om detta nyckelordsargument anges tillsammans med *filnamn*, används dess värde när :class:`FileHandler` skapas, och används därmed när utdatafilen öppnas. Om det inte anges används värdet 'backslashreplace'. Observera att om ``None`` anges kommer det att skickas som sådant till :func:`open`, vilket innebär att det kommer att behandlas på samma sätt som att skicka 'errors'.

source: The *style* argument was added.
sv: Argumentet *style* har lagts till.

source: The *handlers* argument was added. Additional checks were added to catch situations where incompatible arguments are specified (e.g. *handlers* together with *stream* or *filename*, or *stream* together with *filename*).
sv: Argumentet *handlers* har lagts till. Ytterligare kontroller har lagts till för att fånga upp situationer där inkompatibla argument anges (t.ex. *handlers* tillsammans med *stream* eller *filnamn*, eller *stream* tillsammans med *filnamn*).

source: The *force* argument was added.
sv: Argumentet *force* har lagts till.

source: The *encoding* and *errors* arguments were added.
sv: Argumenten *encoding* och *errors* har lagts till.

source: Informs the logging system to perform an orderly shutdown by flushing and closing all handlers. This should be called at application exit and no further use of the logging system should be made after this call.
sv: Informerar loggningssystemet om att utföra en ordnad avstängning genom att spola och stänga alla hanterare. Detta anrop bör göras när programmet avslutas och ingen ytterligare användning av loggningssystemet bör göras efter detta anrop.

source: When the logging module is imported, it registers this function as an exit handler (see :mod:`atexit`), so normally there's no need to do that manually.
sv: När loggningsmodulen importeras registreras den här funktionen som en exit-hanterare (se :mod:`atexit`), så normalt sett behöver du inte göra det manuellt.

source: Tells the logging system to use the class *klass* when instantiating a logger. The class should define :meth:`!__init__` such that only a name argument is required, and the :meth:`!__init__` should call :meth:`!Logger.__init__`. This function is typically called before any loggers are instantiated by applications which need to use custom logger behavior. After this call, as at any other time, do not instantiate loggers directly using the subclass: continue to use the :func:`logging.getLogger` API to get your loggers.
sv: Anger att loggningssystemet ska använda klassen *klass* vid instansiering av en logger. Klassen bör definiera :meth:`!__init__` så att endast ett namnargument krävs, och :meth:`!__init__` bör anropa :meth:`!Logger.__init__`. Den här funktionen anropas vanligtvis innan någon logger instansieras av program som behöver använda ett anpassat loggerbeteende. Efter detta anrop, liksom vid alla andra tillfällen, ska du inte instansiera loggrar direkt med hjälp av underklassen: fortsätt att använda :func:`logging.getLogger` API för att hämta dina loggrar.

source: Set a callable which is used to create a :class:`LogRecord`.
sv: Ställ in en callable som används för att skapa en :class:`LogRecord`.

source: The factory callable to be used to instantiate a log record.
sv: Den factory callable som ska användas för att instansiera en loggpost.

source: This function has been provided, along with :func:`getLogRecordFactory`, to allow developers more control over how the :class:`LogRecord` representing a logging event is constructed.
sv: Denna funktion har tillkommit tillsammans med :func:`getLogRecordFactory` för att ge utvecklare mer kontroll över hur :class:`LogRecord` som representerar en loggningshändelse konstrueras.

source: The factory has the following signature:
sv: Fabriken har följande signatur:

source: ``factory(name, level, fn, lno, msg, args, exc_info, func=None, sinfo=None, **kwargs)``
sv: ``factory(namn, nivå, fn, lno, msg, args, exc_info, func=None, sinfo=None, **kwargs)``

source: The logger name.
sv: Loggarens namn.

source: level
sv: nivå

source: The logging level (numeric).
sv: Loggningsnivå (numerisk).

source: The full pathname of the file where the logging call was made.
sv: Det fullständiga sökvägsnamnet för den fil där loggningsanropet gjordes.

source: The line number in the file where the logging call was made.
sv: Radnumret i filen där loggningsanropet gjordes.

source: The logging message.
sv: Loggningens meddelande.

source: The arguments for the logging message.
sv: Argumenten för loggningsmeddelandet.

source: An exception tuple, or ``None``.
sv: En undantags-tupel, eller ``None``.

source: The name of the function or method which invoked the logging call.
sv: Namnet på den funktion eller metod som anropade loggningsanropet.

source: A stack traceback such as is provided by :func:`traceback.print_stack`, showing the call hierarchy.
sv: En stack traceback som den som tillhandahålls av :func:`traceback.print_stack`, visar anropshierarkin.

source: Additional keyword arguments.
sv: Ytterligare nyckelordsargument.

source: Module-Level Attributes
sv: Attribut på modulnivå

source: A "handler of last resort" is available through this attribute. This is a :class:`StreamHandler` writing to ``sys.stderr`` with a level of ``WARNING``, and is used to handle logging events in the absence of any logging configuration. The end result is to just print the message to ``sys.stderr``. This replaces the earlier error message saying that "no handlers could be found for logger XYZ". If you need the earlier behaviour for some reason, ``lastResort`` can be set to ``None``.
sv: En "hanterare av sista utväg" är tillgänglig via detta attribut. Detta är en :class:`StreamHandler` som skriver till ``sys.stderr`` med en nivå av ``WARNING``, och används för att hantera loggningshändelser i avsaknad av någon loggningskonfiguration. Slutresultatet är att bara skriva ut meddelandet till ``sys.stderr``. Detta ersätter det tidigare felmeddelandet som sa att "inga hanterare kunde hittas för logger XYZ". Om du av någon anledning behöver det tidigare beteendet kan ``lastResort`` sättas till ``None``.

source: Used to see if exceptions during handling should be propagated.
sv: Används för att se om undantag under hanteringen ska spridas.

source: Default: ``True``.
sv: Standard: ``True``.

source: If :data:`raiseExceptions` is ``False``, exceptions get silently ignored. This is what is mostly wanted for a logging system - most users will not care about errors in the logging system, they are more interested in application errors.
sv: Om :data:`raiseExceptions` är ``False``, ignoreras undantag i tysthet. Detta är vad som oftast önskas för ett loggningssystem - de flesta användare bryr sig inte om fel i loggningssystemet, de är mer intresserade av applikationsfel.

source: Integration with the warnings module
sv: Integration med varningsmodulen

source: The :func:`captureWarnings` function can be used to integrate :mod:`logging` with the :mod:`warnings` module.
sv: Funktionen :func:`captureWarnings` kan användas för att integrera :mod:`logging` med modulen :mod:`warnings`.

source: This function is used to turn the capture of warnings by logging on and off.
sv: Denna funktion används för att aktivera och inaktivera loggning av varningar.

source: If *capture* is ``True``, warnings issued by the :mod:`warnings` module will be redirected to the logging system. Specifically, a warning will be formatted using :func:`warnings.formatwarning` and the resulting string logged to a logger named ``'py.warnings'`` with a severity of :const:`WARNING`.
sv: Om *capture* är ``True`` kommer varningar som utfärdas av modulen :mod:`warnings` att omdirigeras till loggningssystemet. Specifikt kommer en varning att formateras med :func:`warnings.formatwarning` och den resulterande strängen loggas till en logger med namnet ``'py.warnings'`` med allvarlighetsgraden :const:`WARNING`.

source: If *capture* is ``False``, the redirection of warnings to the logging system will stop, and warnings will be redirected to their original destinations (i.e. those in effect before ``captureWarnings(True)`` was called).
sv: Om *capture* är ``False`` kommer omdirigeringen av varningar till loggsystemet att upphöra och varningarna kommer att omdirigeras till sina ursprungliga destinationer (dvs. de som gällde innan ``captureWarnings(True)`` anropades).

source: Module :mod:`logging.config`
sv: Modul :mod:`logging.config`

source: Configuration API for the logging module.
sv: Konfigurations-API för loggningsmodulen.

source: Module :mod:`logging.handlers`
sv: Modul :mod:`logging.handlers`

source: Useful handlers included with the logging module.
sv: Användbara hanterare som ingår i loggningsmodulen.

source: :pep:`282` - A Logging System
sv: :pep:`282` - Ett loggningssystem

source: The proposal which described this feature for inclusion in the Python standard library.
sv: Förslaget som beskrev denna funktion för inkludering i Pythons standardbibliotek.

source: `Original Python logging package <https://old.red-dove.com/python_logging.html>`_
sv: "Ursprungligt Python-loggningspaket <https://old.red-dove.com/python_logging.html>

source: This is the original source for the :mod:`logging` package. The version of the package available from this site is suitable for use with Python 1.5.2, 2.1.x and 2.2.x, which do not include the :mod:`logging` package in the standard library.
sv: Detta är den ursprungliga källan för paketet :mod:`logging`. Den version av paketet som är tillgänglig från den här webbplatsen är lämplig för användning med Python 1.5.2, 2.1.x och 2.2.x, som inte innehåller paketet :mod:`logging` i standardbiblioteket.

source: Errors
sv: Fel

source: logging
sv: loggning
