Repository: yeager/python-docs-sv
Catalog: library/logging.config.po
Languages: sv

source: Module :mod:`logging`
sv: Modul :mod:`logging`

source: API reference for the logging module.
sv: API-referens för loggningsmodulen.

source: Module :mod:`logging.handlers`
sv: Modul :mod:`logging.handlers`

source: Useful handlers included with the logging module.
sv: Användbara hanterare som ingår i loggningsmodulen.
