Repository: yeager/python-docs-sv
Catalog: library/logging.po
Languages: sv

source: The LogRecord has a number of attributes, most of which are derived from the parameters to the constructor. (Note that the names do not always correspond exactly between the LogRecord constructor parameters and the LogRecord attributes.) These attributes can be used to merge data from the record into the format string. The following table lists (in alphabetical order) the attribute names, their meanings and the corresponding placeholder in a %-style format string.
sv: LogRecord har ett antal attribut, varav de flesta härleds från parametrarna till konstruktören. (Observera att namnen inte alltid överensstämmer exakt mellan parametrarna i LogRecord-konstruktören och LogRecord-attributen) Dessa attribut kan användas för att sammanfoga data från posten till formatsträngen. I följande tabell listas (i alfabetisk ordning) attributnamnen, deras betydelser och motsvarande platshållare i en %-style-formatsträng.

source: If you are using {}-formatting (:func:`str.format`), you can use ``{attrname}`` as the placeholder in the format string. If you are using $-formatting (:class:`string.Template`), use the form ``${attrname}``. In both cases, of course, replace ``attrname`` with the actual attribute name you want to use.
sv: Om du använder {}-formatering (:func:`str.format`) kan du använda ``{attrname}`` som platshållare i formatsträngen. Om du använder $-formatering (:class:`string.Template`), använd formen ``${attrname}``. I båda fallen ska du naturligtvis ersätta ``attrname`` med det faktiska attributnamn som du vill använda.

source: In the case of {}-formatting, you can specify formatting flags by placing them after the attribute name, separated from it with a colon. For example: a placeholder of ``{msecs:03.0f}`` would format a millisecond value of ``4`` as ``004``. Refer to the :meth:`str.format` documentation for full details on the options available to you.
sv: När det gäller {}-formatering kan du ange formateringsflaggor genom att placera dem efter attributnamnet, åtskilda från det med ett kolon. Till exempel: en platshållare på ``{msecs:03.0f}`` skulle formatera ett millisekundvärde på ``4`` som ``004``. Se :meth:`str.format`-dokumentationen för fullständig information om de alternativ som finns tillgängliga för dig.

source: Attribute name
sv: Attribut namn

source: Description
sv: Beskrivning

source: You shouldn't need to format this yourself.
sv: Du ska inte behöva formatera detta själv.

source: The tuple of arguments merged into ``msg`` to produce ``message``, or a dict whose values are used for the merge (when there is only one argument, and it is a dictionary).
sv: Den tupel av argument som sammanfogas i ``msg`` för att producera ``message``, eller en dict vars värden används för sammanfogningen (när det bara finns ett argument och det är en dictionary).

source: Human-readable time when the :class:`LogRecord` was created. By default this is of the form '2003-07-08 16:49:45,896' (the numbers after the comma are millisecond portion of the time).
sv: Humanläsbar tid när :class:`LogRecord` skapades. Som standard är den av formen '2003-07-08 16:49:45,896' (siffrorna efter kommatecknet är millisekunddelar av tiden).

source: created
sv: skapad

source: Time when the :class:`LogRecord` was created (as returned by :func:`time.time_ns` / 1e9).
sv: Tidpunkt då :class:`LogRecord` skapades (returneras av :func:`time.time_ns` / 1e9).

source: Exception tuple (à la ``sys.exc_info``) or, if no exception has occurred, ``None``.
sv: Exception tuple (à la ``sys.exc_info``) eller, om inget undantag har inträffat, ``None``.

source: filename
sv: filnamn

source: Filename portion of ``pathname``.
sv: Filnamnsdelen av ``pathname``.

source: funcName
sv: funcNamn

source: Name of function containing the logging call.
sv: Namn på den funktion som innehåller loggningsanropet.

source: levelname
sv: nivånamn

source: Text logging level for the message (``'DEBUG'``, ``'INFO'``, ``'WARNING'``, ``'ERROR'``, ``'CRITICAL'``).
sv: Textloggningsnivå för meddelandet (``'DEBUG'``, ``'INFO'``, ``'WARNING'``, ``'ERROR'``, ``'CRITICAL'``).

source: levelno
sv: nivåno

source: Numeric logging level for the message (:const:`DEBUG`, :const:`INFO`, :const:`WARNING`, :const:`ERROR`, :const:`CRITICAL`).
sv: Numerisk loggningsnivå för meddelandet (:const:`DEBUG`, :const:`INFO`, :const:`WARNING`, :const:`ERROR`, :const:`CRITICAL`).

source: Source line number where the logging call was issued (if available).
sv: Källans radnummer där loggningsanropet utfärdades (om tillgängligt).

source: message
sv: Typ av meddelande

source: The logged message, computed as ``msg % args``. This is set when :meth:`Formatter.format` is invoked.
sv: Det loggade meddelandet, beräknat som ``msg % args``. Detta ställs in när :meth:`Formatter.format` anropas.

source: module
sv: modul

source: Module (name portion of ``filename``).
sv: Modul (namndelen av ``filnamn``).

source: Millisecond portion of the time when the :class:`LogRecord` was created.
sv: Millisekund-del av tiden när :class:`LogRecord` skapades.

source: The format string passed in the original logging call. Merged with ``args`` to produce ``message``, or an arbitrary object (see :ref:`arbitrary-object-messages`).
sv: Den formatsträng som skickades i det ursprungliga loggningsanropet. Sammanslagen med ``args`` för att producera ``message``, eller ett godtyckligt objekt (se :ref:`arbitrary-object-messages`).

source: name
sv: namn

source: Name of the logger used to log the call.
sv: Namn på den logger som används för att logga samtalet.

source: pathname
sv: sökvägsnamn

source: Full pathname of the source file where the logging call was issued (if available).
sv: Fullständigt sökvägsnamn för källfilen där loggningsanropet gjordes (om tillgängligt).

source: Process ID (if available).
sv: Process-ID (om tillgängligt).

source: processName
sv: processnamn

source: Process name (if available).
sv: Processnamn (om tillgängligt).

source: relativeCreated
sv: relativt skapad

source: Time in milliseconds when the LogRecord was created, relative to the time the logging module was loaded.
sv: Tid i millisekunder när LogRecord skapades, i förhållande till den tidpunkt då loggmodulen laddades.

source: Stack frame information (where available) from the bottom of the stack in the current thread, up to and including the stack frame of the logging call which resulted in the creation of this record.
sv: Stack frame-information (om sådan finns) från botten av stacken i den aktuella tråden, till och med stack frame för det logganrop som resulterade i att denna post skapades.

source: thread
sv: tråd

source: Thread ID (if available).
sv: Tråd-ID (om tillgängligt).

source: threadName
sv: trådnamn

source: Thread name (if available).
sv: Trådnamn (om tillgängligt).

source: taskName
sv: uppgiftsnamn

source: :class:`asyncio.Task` name (if available).
sv: :class:`asyncio.Task` namn (om tillgängligt).

source: *processName* was added.
sv: *processName* har lagts till.

source: *taskName* was added.
sv: *taskName* lades till.

source: LoggerAdapter Objects
sv: LoggerAdapter-objekt

source: :class:`LoggerAdapter` instances are used to conveniently pass contextual information into logging calls. For a usage example, see the section on :ref:`adding contextual information to your logging output <context-info>`.
sv: :class:`LoggerAdapter`-instanser används för att enkelt skicka kontextuell information till loggningsanrop. Ett exempel på användning finns i avsnittet om :ref:`Lägga till kontextuell information i loggningsutdata <context-info>`.

source: Returns an instance of :class:`LoggerAdapter` initialized with an underlying :class:`Logger` instance, a dict-like object (*extra*), and a boolean (*merge_extra*) indicating whether or not the *extra* argument of individual log calls should be merged with the :class:`LoggerAdapter` extra. The default behavior is to ignore the *extra* argument of individual log calls and only use the one of the :class:`LoggerAdapter` instance
sv: Returnerar en instans av :class:`LoggerAdapter` som initierats med en underliggande instans av :class:`Logger`, ett diktliknande objekt (*extra*) och ett boolean (*merge_extra*) som anger om *extra*-argumentet för enskilda logganrop ska slås samman med :class:`LoggerAdapter` extra eller inte. Standardbeteendet är att ignorera *extra*-argumentet för enskilda logganrop och endast använda det som finns i :class:`LoggerAdapter`-instansen

source: Modifies the message and/or keyword arguments passed to a logging call in order to insert contextual information. This implementation takes the object passed as *extra* to the constructor and adds it to *kwargs* using key 'extra'. The return value is a (*msg*, *kwargs*) tuple which has the (possibly modified) versions of the arguments passed in.
sv: Ändrar argumenten för meddelande och/eller nyckelord som skickas till ett loggningsanrop för att infoga kontextuell information. Denna implementation tar det objekt som skickas som *extra* till konstruktören och lägger till det i *kwargs* med nyckeln 'extra'. Returvärdet är en (*msg*, *kwargs*) tupel som innehåller (eventuellt modifierade) versioner av de argument som skickats in.

source: Delegates to the underlying :attr:`!manager` on *logger*.
sv: Delegerar till den underliggande :attr:`!manager` på *logger*.

source: Delegates to the underlying :meth:`!_log` method on *logger*.
sv: Delegerar till den underliggande :meth:`!_log`-metoden på *logger*.

source: In addition to the above, :class:`LoggerAdapter` supports the following methods of :class:`Logger`: :meth:`~Logger.debug`, :meth:`~Logger.info`, :meth:`~Logger.warning`, :meth:`~Logger.error`, :meth:`~Logger.exception`, :meth:`~Logger.critical`, :meth:`~Logger.log`, :meth:`~Logger.isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` and :meth:`~Logger.hasHandlers`. These methods have the same signatures as their counterparts in :class:`Logger`, so you can use the two types of instances interchangeably.
sv: Utöver ovanstående stöder :class:`LoggerAdapter` följande metoder i :class:`Logger`: :meth:`~Logger.debug`, :meth:`~Logger.info`, :meth:`~Logger.warning`, :meth:`~Logger.error`, :meth:`~Logger.exception`, :meth:`~Logger.critical`, :meth:`~Logger.log`, :meth:`~Logger.isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` och :meth:`~Logger.hasHandlers`. Dessa metoder har samma signaturer som sina motsvarigheter i :class:`Logger`, så du kan använda de två typerna av instanser omväxlande.

source: The :meth:`~Logger.isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` and :meth:`~Logger.hasHandlers` methods were added to :class:`LoggerAdapter`. These methods delegate to the underlying logger.
sv: Metoderna :meth:`~Logger.isEnabledFor`, :meth:`~Logger.getEffectiveLevel`, :meth:`~Logger.setLevel` och :meth:`~Logger.hasHandlers` lades till i :class:`LoggerAdapter`. Dessa metoder delegerar till den underliggande loggern.

source: Attribute :attr:`!manager` and method :meth:`!_log` were added, which delegate to the underlying logger and allow adapters to be nested.
sv: Attributet :attr:`!manager` och metoden :meth:`!_log` har lagts till, vilka delegerar till den underliggande loggern och tillåter att adaptrar nästlas.

source: The *merge_extra* argument was added.
sv: Argumentet *merge_extra* har lagts till.

source: Thread Safety
sv: Säkerhet för trådar

source: The logging module is intended to be thread-safe without any special work needing to be done by its clients. It achieves this though using threading locks; there is one lock to serialize access to the module's shared data, and each handler also creates a lock to serialize access to its underlying I/O.
sv: Loggningsmodulen är avsedd att vara trådsäker utan att något särskilt arbete behöver utföras av dess klienter. Den uppnår detta genom att använda trådlås; det finns ett lås för att serialisera åtkomst till modulens delade data, och varje hanterare skapar också ett lås för att serialisera åtkomst till dess underliggande I/O.

source: If you are implementing asynchronous signal handlers using the :mod:`signal` module, you may not be able to use logging from within such handlers. This is because lock implementations in the :mod:`threading` module are not always re-entrant, and so cannot be invoked from such signal handlers.
sv: Om du implementerar asynkrona signalhanterare med modulen :mod:`signal` kan det hända att du inte kan använda loggning från sådana hanterare. Detta beror på att låsimplementeringar i modulen :mod:`threading` inte alltid är re-entrant och därför inte kan anropas från sådana signalhanterare.

source: Module-Level Functions
sv: Funktioner på modulnivå

source: In addition to the classes described above, there are a number of module-level functions.
sv: Förutom de klasser som beskrivs ovan finns det ett antal funktioner på modulnivå.

source: Return a logger with the specified name or, if name is ``None``, return the root logger of the hierarchy. If specified, the name is typically a dot-separated hierarchical name like *'a'*, *'a.b'* or *'a.b.c.d'*. Choice of these names is entirely up to the developer who is using logging, though it is recommended that ``__name__`` be used unless you have a specific reason for not doing that, as mentioned in :ref:`logger`.
sv: Returnerar en logger med det angivna namnet eller, om namnet är ``None``, hierarkins rotlogger. Om namnet anges är det vanligtvis ett punktseparerat hierarkiskt namn som *'a'*, *'a.b'* eller *'a.b.c.d'*. Valet av dessa namn är helt upp till utvecklaren som använder loggning, men det rekommenderas att ``__name__`` används om du inte har en särskild anledning att inte göra det, som nämns i :ref:`logger`.

source: All calls to this function with a given name return the same logger instance. This means that logger instances never need to be passed between different parts of an application.
sv: Alla anrop till denna funktion med ett givet namn returnerar samma loggerinstans. Detta innebär att loggerinstanser aldrig behöver skickas mellan olika delar av en applikation.

source: Return either the standard :class:`Logger` class, or the last class passed to :func:`setLoggerClass`. This function may be called from within a new class definition, to ensure that installing a customized :class:`Logger` class will not undo customizations already applied by other code. For example::
sv: Returnerar antingen standardklassen :class:`Logger`, eller den sista klassen som skickades till :func:`setLoggerClass`. Denna funktion kan anropas från en ny klassdefinition för att säkerställa att installationen av en anpassad :class:`Logger`-klass inte upphäver anpassningar som redan gjorts av annan kod. Till exempel::

source: class MyLogger(logging.getLoggerClass()): # ... override behaviour here
sv: klass MyLogger(logging.getLoggerClass()): # ... åsidosätt beteende här

source: Return a callable which is used to create a :class:`LogRecord`.
sv: Returnerar en callable som används för att skapa en :class:`LogRecord`.

source: This function has been provided, along with :func:`setLogRecordFactory`, to allow developers more control over how the :class:`LogRecord` representing a logging event is constructed.
sv: Denna funktion har tillkommit, tillsammans med :func:`setLogRecordFactory`, för att ge utvecklare mer kontroll över hur :class:`LogRecord` som representerar en loggningshändelse konstrueras.

source: See :func:`setLogRecordFactory` for more information about the how the factory is called.
sv: Se :func:`setLogRecordFactory` för mer information om hur fabriken anropas.

source: This is a convenience function that calls :meth:`Logger.debug`, on the root logger. The handling of the arguments is in every way identical to what is described in that method.
sv: Detta är en bekvämlighetsfunktion som anropar :meth:`Logger.debug`, på rotloggaren. Hanteringen av argumenten är på alla sätt identisk med vad som beskrivs i den metoden.

source: The only difference is that if the root logger has no handlers, then :func:`basicConfig` is called, prior to calling ``debug`` on the root logger.
sv: Den enda skillnaden är att om rotloggaren inte har några hanterare anropas :func:`basicConfig` innan ``debug`` anropas på rotloggaren.

source: For very short scripts or quick demonstrations of ``logging`` facilities, ``debug`` and the other module-level functions may be convenient. However, most programs will want to carefully and explicitly control the logging configuration, and should therefore prefer creating a module-level logger and calling :meth:`Logger.debug` (or other level-specific methods) on it, as described at the beginning of this documentation.
sv: För mycket korta skript eller snabba demonstrationer av ``loggning`` kan ``debug`` och de andra modulnivåfunktionerna vara praktiska. De flesta program vill dock noggrant och uttryckligen kontrollera loggningskonfigurationen och bör därför föredra att skapa en logger på modulnivå och anropa :meth:`Logger.debug` (eller andra nivåspecifika metoder) på den, enligt beskrivningen i början av den här dokumentationen.

source: Logs a message with level :const:`INFO` on the root logger. The arguments and behavior are otherwise the same as for :func:`debug`.
sv: Loggar ett meddelande med nivån :const:`INFO` på rotloggaren. Argumenten och beteendet är i övrigt detsamma som för :func:`debug`.

source: Logs a message with level :const:`WARNING` on the root logger. The arguments and behavior are otherwise the same as for :func:`debug`.
sv: Loggar ett meddelande med nivå :const:`WARNING` på rotloggaren. Argumenten och beteendet är i övrigt samma som för :func:`debug`.

source: There is an obsolete function ``warn`` which is functionally identical to ``warning``. As ``warn`` is deprecated, please do not use it - use ``warning`` instead.
sv: Det finns en föråldrad funktion ``warn`` som är funktionellt identisk med ``warning``. Eftersom ``warn`` är föråldrad, vänligen använd den inte - använd ``warning`` istället.

source: Logs a message with level :const:`ERROR` on the root logger. The arguments and behavior are otherwise the same as for :func:`debug`.
sv: Loggar ett meddelande med nivå :const:`ERROR` på rotloggaren. Argumenten och beteendet är i övrigt detsamma som för :func:`debug`.

source: Logs a message with level :const:`CRITICAL` on the root logger. The arguments and behavior are otherwise the same as for :func:`debug`.
sv: Loggar ett meddelande med nivå :const:`CRITICAL` på rotloggaren. Argumenten och beteendet är i övrigt samma som för :func:`debug`.

source: Logs a message with level :const:`ERROR` on the root logger. The arguments and behavior are otherwise the same as for :func:`debug`. Exception info is added to the logging message. This function should only be called from an exception handler.
sv: Loggar ett meddelande med nivå :const:`ERROR` på rotloggaren. Argumenten och beteendet är i övrigt samma som för :func:`debug`. Undantagsinformation läggs till i loggmeddelandet. Denna funktion bör endast anropas från en undantagshanterare.

source: Logs a message with level *level* on the root logger. The arguments and behavior are otherwise the same as for :func:`debug`.
sv: Loggar ett meddelande med nivån *level* på rotloggern. Argumenten och beteendet är i övrigt samma som för :func:`debug`.

source: Provides an overriding level *level* for all loggers which takes precedence over the logger's own level. When the need arises to temporarily throttle logging output down across the whole application, this function can be useful. Its effect is to disable all logging calls of severity *level* and below, so that if you call it with a value of INFO, then all INFO and DEBUG events would be discarded, whereas those of severity WARNING and above would be processed according to the logger's effective level. If ``logging.disable(logging.NOTSET)`` is called, it effectively removes this overriding level, so that logging output again depends on the effective levels of individual loggers.
sv: Ger en överordnad nivå *level* för alla loggrar som har företräde framför loggarens egen nivå. Denna funktion kan vara användbar när det uppstår ett behov av att tillfälligt strypa loggningsutmatningen i hela programmet. Dess effekt är att inaktivera alla loggningsanrop med allvarlighetsgrad *nivå* och lägre, så att om du anropar den med ett värde på INFO, kommer alla INFO- och DEBUG-händelser att kasseras, medan de med allvarlighetsgrad WARNING och högre kommer att behandlas enligt loggarens effektiva nivå. Om ``logging.disable(logging.NOTSET)`` anropas, tas denna överordnade nivå bort, så att loggningsutdata återigen beror på de enskilda loggarnas effektiva nivåer.

source: Note that if you have defined any custom logging level higher than ``CRITICAL`` (this is not recommended), you won't be able to rely on the default value for the *level* parameter, but will have to explicitly supply a suitable value.
sv: Observera att om du har definierat någon anpassad loggningsnivå som är högre än ``CRITICAL`` (detta rekommenderas inte), kan du inte förlita dig på standardvärdet för parametern *level*, utan måste uttryckligen ange ett lämpligt värde.

source: The *level* parameter was defaulted to level ``CRITICAL``. See :issue:`28524` for more information about this change.
sv: Parametern *level* var förvald till nivån ``CRITICAL``. Se :issue:`28524` för mer information om denna ändring.

source: Associates level *level* with text *levelName* in an internal dictionary, which is used to map numeric levels to a textual representation, for example when a :class:`Formatter` formats a message. This function can also be used to define your own levels. The only constraints are that all levels used must be registered using this function, levels should be positive integers and they should increase in increasing order of severity.
sv: Associerar nivån *level* med texten *levelName* i en intern ordbok, som används för att mappa numeriska nivåer till en textuell representation, t.ex. när en :class:`Formatter` formaterar ett meddelande. Denna funktion kan också användas för att definiera egna nivåer. De enda begränsningarna är att alla nivåer som används måste registreras med hjälp av denna funktion, att nivåerna ska vara positiva heltal och att de ska öka i allvarlighetsgrad.

source: If you are thinking of defining your own levels, please see the section on :ref:`custom-levels`.
sv: Om du funderar på att definiera dina egna nivåer, se avsnittet om :ref:`custom-levels`.

source: Returns a mapping from level names to their corresponding logging levels. For example, the string "CRITICAL" maps to :const:`CRITICAL`. The returned mapping is copied from an internal mapping on each call to this function.
sv: Returnerar en mappning från nivånamn till motsvarande loggningsnivåer. Strängen "CRITICAL" mappas till exempel till :const:`CRITICAL`. Den returnerade mappningen kopieras från en intern mappning vid varje anrop till denna funktion.

source: Returns the textual or numeric representation of logging level *level*.
sv: Returnerar den textuella eller numeriska representationen av loggningsnivån *level*.
