Repository: yeager/python-docs-sv
Catalog: library/marshal.po
Languages: sv

source: :mod:`!marshal` --- Internal Python object serialization
sv: :mod:`!marshal` --- Intern serialisering av Python-objekt

source: This module contains functions that can read and write Python values in a binary format. The format is specific to Python, but independent of machine architecture issues (e.g., you can write a Python value to a file on a PC, transport the file to a Mac, and read it back there). Details of the format are undocumented on purpose; it may change between Python versions (although it rarely does). [#]_
sv: Denna modul innehåller funktioner som kan läsa och skriva Python-värden i ett binärt format. Formatet är specifikt för Python, men oberoende av maskinarkitekturfrågor (t.ex. kan du skriva ett Python-värde till en fil på en PC, transportera filen till en Mac och läsa tillbaka den där). Detaljer om formatet är avsiktligt odokumenterade; det kan ändras mellan Python-versioner (även om det sällan gör det). [#]_

source: This is not a general "persistence" module. For general persistence and transfer of Python objects through RPC calls, see the modules :mod:`pickle` and :mod:`shelve`. The :mod:`marshal` module exists mainly to support reading and writing the "pseudo-compiled" code for Python modules of :file:`.pyc` files. Therefore, the Python maintainers reserve the right to modify the marshal format in backward incompatible ways should the need arise. The format of code objects is not compatible between Python versions, even if the version of the format is the same. De-serializing a code object in the incorrect Python version has undefined behavior. If you're serializing and de-serializing Python objects, use the :mod:`pickle` module instead -- the performance is comparable, version independence is guaranteed, and pickle supports a substantially wider range of objects than marshal.
sv: Detta är inte en allmän "persistens"-modul. För allmän persistens och överföring av Python-objekt genom RPC-anrop, se modulerna :mod:`pickle` och :mod:`shelve`. Modulen :mod:`marshal` existerar huvudsakligen för att stödja läsning och skrivning av den "pseudokompilerade" koden för Python-moduler i :file:`.pyc`-filer. Därför förbehåller sig Python-underhållarna rätten att modifiera marshal-formatet på bakåtkompatibla sätt om behov skulle uppstå. Formatet för kodobjekt är inte kompatibelt mellan Python-versioner, även om versionen av formatet är densamma. Att avserialisera ett kodobjekt i den felaktiga Python-versionen har ett odefinierat beteende. Om du ska serialisera och de-serialisera Python-objekt, använd :mod:`pickle`-modulen istället -- prestandan är jämförbar, versionsoberoende garanteras och pickle stöder ett betydligt bredare utbud av objekt än marshal.

source: The :mod:`marshal` module is not intended to be secure against erroneous or maliciously constructed data. Never unmarshal data received from an untrusted or unauthenticated source.
sv: Modulen :mod:`marshal` är inte avsedd att vara säker mot felaktiga eller illvilligt konstruerade data. Unmarshala aldrig data som mottagits från en icke betrodd eller oautentiserad källa.

source: There are functions that read/write files as well as functions operating on bytes-like objects.
sv: Det finns funktioner som läser/skriver filer samt funktioner som arbetar med bytesliknande objekt.

source: Not all Python object types are supported; in general, only objects whose value is independent from a particular invocation of Python can be written and read by this module. The following types are supported:
sv: Inte alla Python-objekttyper stöds; i allmänhet kan endast objekt vars värde är oberoende av en viss anropning av Python skrivas och läsas av denna modul. Följande typer stöds:

source: Numeric types: :class:`int`, :class:`bool`, :class:`float`, :class:`complex`.
sv: Numeriska typer: :class:`int`, :class:`bool`, :class:`float`, :class:`complex`.

source: Strings (:class:`str`) and :class:`bytes`. :term:`Bytes-like objects <bytes-like object>` like :class:`bytearray` are marshalled as :class:`!bytes`.
sv: Strängar (:class:`str`) och :class:`bytes`. :term:`Bytesliknande objekt <bytes-like object>` som :class:`bytearray` marshallas som :class:`!bytes`.

source: Containers: :class:`tuple`, :class:`list`, :class:`set`, :class:`frozenset`, and (since :data:`version` 5), :class:`slice`. It should be understood that these are supported only if the values contained therein are themselves supported. Recursive containers are supported since :data:`version` 3.
sv: Innehåller: :class:`tuple`, :class:`list`, :class:`set`, :class:`frozenset`, och (sedan :data:`version` 5), :class:`slice`. Det bör förstås att dessa endast stöds om de värden som ingår i dem själva stöds. Rekursiva behållare stöds sedan :data:`version` 3.

source: The singletons :const:`None`, :const:`Ellipsis` and :exc:`StopIteration`.
sv: Singletonerna :const:`None`, :const:`Ellipsis` och :exc:`StopIteration`.

source: :class:`code` objects, if *allow_code* is true. See note above about version dependence.
sv: :class:`code`-objekt, om *allow_code* är sant. Se anmärkning ovan om versionsberoende.

source: Added format version 3, which supports marshalling recursive lists, sets and dictionaries.
sv: Lagt till formatversion 3, som stöder marshalling av rekursiva listor, set och dictionaries.

source: Added format version 4, which supports efficient representations of short strings.
sv: Lagt till formatversion 4, som stöder effektiva representationer av korta strängar.

source: Added format version 5, which allows marshalling slices.
sv: Lagt till formatversion 5, som tillåter marshalling av slices.

source: The module defines these functions:
sv: Modulen definierar dessa funktioner:

source: Write the value on the open file. The value must be a supported type. The file must be a writeable :term:`binary file`.
sv: Skriv värdet på den öppna filen. Värdet måste vara av en typ som stöds. Filen måste vara en skrivbar :term:`binärfil`.

source: If the value has (or contains an object that has) an unsupported type, a :exc:`ValueError` exception is raised --- but garbage data will also be written to the file. The object will not be properly read back by :func:`load`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true.
sv: Om värdet har (eller innehåller ett objekt som har) en typ som inte stöds, kommer ett :exc:`ValueError` undantag att uppstå --- men skräpdata kommer också att skrivas till filen. Objektet kommer inte att kunna läsas tillbaka korrekt av :func:`load`. :ref:`Code objects <code-objects>` stöds endast om *allow_code* är true.

source: The *version* argument indicates the data format that ``dump`` should use (see below).
sv: Argumentet *version* anger det dataformat som ``dump`` ska använda (se nedan).

source: Raises an :ref:`auditing event <auditing>` ``marshal.dumps`` with arguments ``value``, ``version``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``marshal.dumps`` med argumenten ``value``, ``version``.

source: Added the *allow_code* parameter.
sv: Parametern *allow_code* har lagts till.

source: Read one value from the open file and return it. If no valid value is read (e.g. because the data has a different Python version's incompatible marshal format), raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true. The file must be a readable :term:`binary file`.
sv: Läser ett värde från den öppna filen och returnerar det. Om inget giltigt värde läses (t.ex. för att data har ett inkompatibelt marshal-format i en annan Python-version), anges :exc:`EOFError`, :exc:`ValueError` eller :exc:`TypeError`. :ref:`Code objects <code-objects>` stöds endast om *allow_code* är true. Filen måste vara en läsbar :term:`binärfil`.

source: Raises an :ref:`auditing event <auditing>` ``marshal.load`` with no arguments.
sv: Utlöser en :ref:`auditing event <auditing>` ``marshal.load`` utan argument.

source: If an object containing an unsupported type was marshalled with :func:`dump`, :func:`load` will substitute ``None`` for the unmarshallable type.
sv: Om ett objekt som innehåller en typ som inte stöds marshallades med :func:`dump`, kommer :func:`load` att ersätta den icke marshallbara typen med ``None``.

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.load`` event for the entire load operation.
sv: Detta anrop skapade tidigare en granskningshändelse ``code.__new__`` för varje kodobjekt. Nu utlöser det en enda ``marshal.load``-händelse för hela laddningsoperationen.

source: Return the bytes object that would be written to a file by ``dump(value, file)``. The value must be a supported type. Raise a :exc:`ValueError` exception if value has (or contains an object that has) an unsupported type. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true.
sv: Returnerar bytesobjektet som skulle skrivas till en fil med ``dump(värde, fil)``. Värdet måste vara en typ som stöds. Utlös ett :exc:`ValueError` undantag om värdet har (eller innehåller ett objekt som har) en typ som inte stöds. :ref:`Kodobjekt <code-objects>` stöds endast om *allow_code* är true.

source: The *version* argument indicates the data format that ``dumps`` should use (see below).
sv: Argumentet *version* anger det dataformat som ``dumps`` ska använda (se nedan).

source: Convert the :term:`bytes-like object` to a value. If no valid value is found, raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true. Extra bytes in the input are ignored.
sv: Konverterar :term:`bytesliknande objekt` till ett värde. Om inget giltigt värde hittas, skapa :exc:`EOFError`, :exc:`ValueError` eller :exc:`TypeError`. :ref:`Code objects <code-objects>` stöds endast om *allow_code* är true. Extra bytes i indata ignoreras.

source: Raises an :ref:`auditing event <auditing>` ``marshal.loads`` with argument ``bytes``.
sv: Utlöser en :ref:`auditing event <auditing>` ``marshal.loads`` med argumentet ``bytes``.

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.loads`` event for the entire load operation.
sv: Detta anrop skapade tidigare en granskningshändelse ``code.__new__`` för varje kodobjekt. Nu utlöser det en enda ``marshal.loads``-händelse för hela laddningsoperationen.

source: In addition, the following constants are defined:
sv: Dessutom definieras följande konstanter:

source: Indicates the format that the module uses. Version 0 is the historical first version; subsequent versions add new features. Generally, a new version becomes the default when it is introduced.
sv: Anger det format som modulen använder. Version 0 är den historiskt första versionen; efterföljande versioner lägger till nya funktioner. Generellt gäller att en ny version blir standard när den introduceras.

source: Available since
sv: Tillgänglig sedan

source: New features
sv: Nya funktioner

source: Sharing interned strings
sv: Delning av internerade strängar

source: Binary representation of floats
sv: Binär representation av flyttal

source: Support for object instancing and recursion
sv: Stöd för objektinstansiering och rekursion

source: Efficient representation of short strings
sv: Effektiv representation av korta strängar

source: Support for :class:`slice` objects
sv: Stöd för :class:`slice`-objekt

source: Footnotes
sv: Fotnoter

source: The name of this module stems from a bit of terminology used by the designers of Modula-3 (amongst others), who use the term "marshalling" for shipping of data around in a self-contained form. Strictly speaking, "to marshal" means to convert some data from internal to external form (in an RPC buffer for instance) and "unmarshalling" for the reverse process.
sv: Namnet på den här modulen kommer från en terminologi som används av konstruktörerna av Modula-3 (bland andra), som använder termen "marshalling" för att skicka runt data i en fristående form. Strängt taget innebär "to marshalling" att konvertera data från intern till extern form (t.ex. i en RPC-buffert) och "unmarshalling" innebär den omvända processen.
