Repository: yeager/python-docs-sv
Catalog: library/math.po
Languages: sv

source: *abs_tol* is the absolute tolerance; it defaults to ``0.0`` and it must be nonnegative. When comparing ``x`` to ``0.0``, ``isclose(x, 0)`` is computed as ``abs(x) <= rel_tol * abs(x)``, which is ``False`` for any nonzero ``x`` and *rel_tol* less than ``1.0``. So add an appropriate positive *abs_tol* argument to the call.
sv: *abs_tol* är den absoluta toleransen; standardvärdet är ``0,0`` och det måste vara icke-negativt. Vid jämförelse av ``x`` med ``0,0`` beräknas ``isclose(x, 0)`` som ``abs(x) <= rel_tol * abs(x)``, vilket är ``falskt`` för alla ``x`` som inte är noll och *rel_tol* mindre än ``1,0``. Lägg därför till ett lämpligt positivt *abs_tol*-argument i anropet.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
sv: IEEE 754 specialvärdena ``NaN``, ``inf`` och ``-inf`` kommer att hanteras enligt IEEE:s regler. Specifikt anses inte ``NaN`` ligga nära något annat värde, inklusive ``NaN``. ``inf`` och ``-inf`` betraktas endast som nära sig själva.

source: :pep:`485` -- A function for testing approximate equality
sv: :pep:`485` -- En funktion för att testa ungefärlig likhet

source: Return ``True`` if *x* is neither an infinity nor a NaN, and ``False`` otherwise. (Note that ``0.0`` *is* considered finite.)
sv: Returnerar ``True`` om *x* varken är en oändlighet eller en NaN, och ``False`` annars. (Observera att ``0.0`` *anses* som ändligt.)

source: Return ``True`` if *x* is a positive or negative infinity, and ``False`` otherwise.
sv: Returnerar ``True`` om *x* är en positiv eller negativ oändlighet, och ``False`` annars.

source: Return ``True`` if *x* is a NaN (not a number), and ``False`` otherwise.
sv: Returnerar ``True`` om *x* är en NaN (inte ett tal), och ``False`` annars.

source: Return ``x * (2**i)``. This is essentially the inverse of function :func:`frexp`.
sv: Returnerar ``x * (2**i)``. Detta är i princip inversen av funktionen :func:`frexp`.

source: Return the floating-point value *steps* steps after *x* towards *y*.
sv: Returnerar flyttalsvärdet *steps* steg efter *x* mot *y*.

source: If *x* is equal to *y*, return *y*, unless *steps* is zero.
sv: Om *x* är lika med *y* returneras *y*, såvida inte *steps* är noll.

source: Examples:
sv: Exempel:

source: ``math.nextafter(x, math.inf)`` goes up: towards positive infinity.
sv: ``math.nextafter(x, math.inf)`` går upp: mot positiv oändlighet.

source: ``math.nextafter(x, -math.inf)`` goes down: towards minus infinity.
sv: ``math.nextafter(x, -math.inf)`` går ner: mot minus oändligheten.

source: ``math.nextafter(x, 0.0)`` goes towards zero.
sv: ``math.nextafter(x, 0.0)`` går mot noll.

source: ``math.nextafter(x, math.copysign(math.inf, x))`` goes away from zero.
sv: ``math.nextafter(x, math.copysign(math.inf, x))`` går bort från noll.

source: See also :func:`math.ulp`.
sv: Se även :func:`math.ulp`.

source: Added the *steps* argument.
sv: Lagt till argumentet *steps*.

source: Return the value of the least significant bit of the float *x*:
sv: Returnera värdet på den minst signifikanta biten i floaten *x*:

source: If *x* is a NaN (not a number), return *x*.
sv: Om *x* är ett NaN (inte ett tal), returneras *x*.

source: If *x* is negative, return ``ulp(-x)``.
sv: Om *x* är negativ, returneras ``ulp(-x)``.

source: If *x* is a positive infinity, return *x*.
sv: Om *x* är en positiv oändlighet, returneras *x*.

source: If *x* is equal to zero, return the smallest positive *denormalized* representable float (smaller than the minimum positive *normalized* float, :data:`sys.float_info.min <sys.float_info>`).
sv: Om *x* är lika med noll, returneras den minsta positiva *denormaliserade* representativa floaten (mindre än den minsta positiva *normaliserade* floaten, :data:`sys.float_info.min <sys.float_info>`).

source: If *x* is equal to the largest positive representable float, return the value of the least significant bit of *x*, such that the first float smaller than *x* is ``x - ulp(x)``.
sv: Om *x* är lika med den största positiva representativa floaten, returneras värdet av den minst signifikanta biten i *x*, så att den första floaten som är mindre än *x* är ``x - ulp(x)``.

source: Otherwise (*x* is a positive finite number), return the value of the least significant bit of *x*, such that the first float bigger than *x* is ``x + ulp(x)``.
sv: Annars (*x* är ett positivt ändligt tal), returnera värdet på den minst signifikanta biten i *x*, så att det första flyttalet som är större än *x* är ``x + ulp(x)``.

source: ULP stands for "Unit in the Last Place".
sv: ULP står för "Unit in the Last Place".

source: See also :func:`math.nextafter` and :data:`sys.float_info.epsilon <sys.float_info>`.
sv: Se även :func:`math.nextafter` och :data:`sys.float_info.epsilon <sys.float_info>`.

source: Power, exponential and logarithmic functions
sv: Potens-, exponential- och logaritmfunktioner

source: Return the cube root of *x*.
sv: Returnerar kubikroten av *x*.

source: Return *e* raised to the power *x*, where *e* = 2.718281... is the base of natural logarithms. This is usually more accurate than ``math.e ** x`` or ``pow(math.e, x)``.
sv: Returnerar *e* upphöjt till potensen *x*, där *e* = 2,718281... är basen för naturliga logaritmer. Detta är vanligtvis mer exakt än ``math.e ** x`` eller ``pow(math.e, x)``.

source: Return *2* raised to the power *x*.
sv: Returnera *2* upphöjt till potensen *x*.

source: Return *e* raised to the power *x*, minus 1. Here *e* is the base of natural logarithms. For small floats *x*, the subtraction in ``exp(x) - 1`` can result in a `significant loss of precision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; the :func:`expm1` function provides a way to compute this quantity to full precision:
sv: Returnerar *e* upphöjt till potensen *x*, minus 1. Här är *e* basen för naturliga logaritmer. För små flyttal *x* kan subtraktionen i ``exp(x) - 1`` resultera i en `betydande förlust av precision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; funktionen :func:`expm1` ger ett sätt att beräkna denna kvantitet med full precision:

source: With one argument, return the natural logarithm of *x* (to base *e*).
sv: Med ett argument, returnerar den naturliga logaritmen av *x* (till basen *e*).

source: With two arguments, return the logarithm of *x* to the given *base*, calculated as ``log(x)/log(base)``.
sv: Med två argument, returnerar logaritmen för *x* till den angivna *basen*, beräknad som ``log(x)/log(bas)``.

source: Return the natural logarithm of *1+x* (base *e*). The result is calculated in a way which is accurate for *x* near zero.
sv: Returnerar den naturliga logaritmen av *1+x* (bas *e*). Resultatet beräknas på ett sätt som är korrekt för *x* nära noll.

source: Return the base-2 logarithm of *x*. This is usually more accurate than ``log(x, 2)``.
sv: Returnerar bas-2 logaritmen av *x*. Detta är vanligtvis mer exakt än ``log(x, 2)``.

source: :meth:`int.bit_length` returns the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros.
sv: :meth:`int.bit_length` returnerar det antal bitar som krävs för att representera ett heltal i binär form, exklusive tecken och inledande nollor.

source: Return the base-10 logarithm of *x*. This is usually more accurate than ``log(x, 10)``.
sv: Returnerar bas-10 logaritmen av *x*. Detta är vanligtvis mer exakt än ``log(x, 10)``.

source: Return *x* raised to the power *y*. Exceptional cases follow the IEEE 754 standard as far as possible. In particular, ``pow(1.0, x)`` and ``pow(x, 0.0)`` always return ``1.0``, even when *x* is a zero or a NaN. If both *x* and *y* are finite, *x* is negative, and *y* is not an integer then ``pow(x, y)`` is undefined, and raises :exc:`ValueError`.
sv: Returnera *x* upphöjt till potensen *y*. Undantagsfall följer IEEE 754-standarden så långt som möjligt. I synnerhet returnerar ``pow(1.0, x)`` och ``pow(x, 0.0)`` alltid ``1.0``, även när *x* är en nolla eller ett NaN. Om både *x* och *y* är ändliga, *x* är negativ och *y* inte är ett heltal är ``pow(x, y)`` odefinierad och ger upphov till :exc:`ValueError`.

source: Unlike the built-in ``**`` operator, :func:`math.pow` converts both its arguments to type :class:`float`. Use ``**`` or the built-in :func:`pow` function for computing exact integer powers.
sv: Till skillnad från den inbyggda operatorn ``**`` konverterar :func:`math.pow`` båda sina argument till typen :class:`float`. Använd ``**`` eller den inbyggda funktionen :func:`pow` för att beräkna exakta heltalspotenser.

source: The special cases ``pow(0.0, -inf)`` and ``pow(-0.0, -inf)`` were changed to return ``inf`` instead of raising :exc:`ValueError`, for consistency with IEEE 754.
sv: Specialfallen ``pow(0.0, -inf)`` och ``pow(-0.0, -inf)`` ändrades till att returnera ``inf`` istället för att ge :exc:`ValueError`, för att överensstämma med IEEE 754.

source: Return the square root of *x*.
sv: Returnerar kvadratroten av *x*.

source: Summation and product functions
sv: Summations- och produktfunktioner

source: Return the Euclidean distance between two points *p* and *q*, each given as a sequence (or iterable) of coordinates. The two points must have the same dimension.
sv: Returnerar det euklidiska avståndet mellan två punkter *p* och *q*, var och en angiven som en sekvens (eller iterabel) av koordinater. De två punkterna måste ha samma dimension.

source: Roughly equivalent to::
sv: Ungefär motsvarande::

source: Return an accurate floating-point sum of values in the iterable. Avoids loss of precision by tracking multiple intermediate partial sums.
sv: Returnerar en exakt summa i flyttal av värdena i iterabeln. Undviker förlust av precision genom att spåra flera mellanliggande partiella summor.

source: The algorithm's accuracy depends on IEEE-754 arithmetic guarantees and the typical case where the rounding mode is half-even. On some non-Windows builds, the underlying C library uses extended precision addition and may occasionally double-round an intermediate sum causing it to be off in its least significant bit.
sv: Algoritmens noggrannhet beror på aritmetiska garantier enligt IEEE-754 och det typiska fallet där avrundningsläget är halvjämnt. På vissa icke-Windows-versioner använder det underliggande C-biblioteket addition med utökad precision och kan ibland dubbelrunda en mellansumma, vilket gör att den minst signifikanta biten inte stämmer.

source: For further discussion and two alternative approaches, see the `ASPN cookbook recipes for accurate floating-point summation <https://code.activestate.com/recipes/393090-binary-floating-point-summation-accurate-to-full-p/>`_\.
sv: För ytterligare diskussion och två alternativa metoder, se "ASPN cookbook recipes for accurate floating-point summation" <https://code.activestate.com/recipes/393090-binary-floating-point-summation-accurate-to-full-p/>`_\.

source: Return the Euclidean norm, ``sqrt(sum(x**2 for x in coordinates))``. This is the length of the vector from the origin to the point given by the coordinates.
sv: Returnerar den euklidiska normen, ``sqrt(sum(x**2 for x in coordinates))``. Detta är längden på vektorn från origo till den punkt som anges av koordinaterna.

source: For a two dimensional point ``(x, y)``, this is equivalent to computing the hypotenuse of a right triangle using the Pythagorean theorem, ``sqrt(x*x + y*y)``.
sv: För en tvådimensionell punkt ``(x, y)`` är detta likvärdigt med att beräkna hypotenusan i en rätvinklig triangel med hjälp av Pythagoras sats, ``sqrt(x*x + y*y)``.

source: Added support for n-dimensional points. Formerly, only the two dimensional case was supported.
sv: Stöd för n-dimensionella punkter har lagts till. Tidigare stöddes endast det tvådimensionella fallet.

source: Improved the algorithm's accuracy so that the maximum error is under 1 ulp (unit in the last place). More typically, the result is almost always correctly rounded to within 1/2 ulp.
sv: Förbättrat algoritmens noggrannhet så att det maximala felet är under 1 ulp (enhet på sista plats). Mer typiskt är att resultatet nästan alltid är korrekt avrundat till inom 1/2 ulp.

source: Calculate the product of all the elements in the input *iterable*. The default *start* value for the product is ``1``.
sv: Beräkna produkten av alla element i indata *iterable*. Standardvärdet *start* för produkten är ``1``.

source: When the iterable is empty, return the start value. This function is intended specifically for use with numeric values and may reject non-numeric types.
sv: När iterabeln är tom returneras startvärdet. Denna funktion är särskilt avsedd för användning med numeriska värden och kan avvisa icke-numeriska typer.

source: Return the sum of products of values from two iterables *p* and *q*.
sv: Returnerar summan av produkter av värden från två iterabler *p* och *q*.

source: Raises :exc:`ValueError` if the inputs do not have the same length.
sv: Utlöser :exc:`ValueError` om inmatningarna inte har samma längd.

source: For float and mixed int/float inputs, the intermediate products and sums are computed with extended precision.
sv: För float- och mixed int/float-ingångar beräknas mellanprodukter och summor med utökad precision.

source: Angular conversion
sv: Angulär konvertering

source: Convert angle *x* from radians to degrees.
sv: Konvertera vinkel *x* från radianer till grader.

source: Convert angle *x* from degrees to radians.
sv: Konvertera vinkel *x* från grader till radianer.

source: Trigonometric functions
sv: Trigonometriska funktioner

source: Return the arc cosine of *x*, in radians. The result is between ``0`` and ``pi``.
sv: Returnerar bågkosinus för *x*, i radianer. Resultatet ligger mellan ``0`` och ``pi``.

source: Return the arc sine of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
sv: Returnerar bågsinus för *x*, i radianer. Resultatet ligger mellan ``-pi/2`` och ``pi/2``.

source: Return the arc tangent of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
sv: Returnerar bågtangenten för *x*, i radianer. Resultatet ligger mellan ``-pi/2`` och ``pi/2``.

source: Return ``atan(y / x)``, in radians. The result is between ``-pi`` and ``pi``. The vector in the plane from the origin to point ``(x, y)`` makes this angle with the positive X axis. The point of :func:`atan2` is that the signs of both inputs are known to it, so it can compute the correct quadrant for the angle. For example, ``atan(1)`` and ``atan2(1, 1)`` are both ``pi/4``, but ``atan2(-1, -1)`` is ``-3*pi/4``.
sv: Returnerar ``atan(y / x)``, i radianer. Resultatet ligger mellan ``-pi`` och ``pi``. Vektorn i planet från origo till punkten ``(x, y)`` bildar denna vinkel med den positiva X-axeln. Poängen med :func:`atan2` är att tecknen på båda indata är kända för den, så att den kan beräkna rätt kvadrant för vinkeln. Till exempel är ``atan(1)`` och ``atan2(1, 1)`` båda ``pi/4``, men ``atan2(-1, -1)`` är ``-3*pi/4``.

source: Return the cosine of *x* radians.
sv: Returnerar cosinus av *x* radianer.

source: Return the sine of *x* radians.
sv: Returnerar sinus av *x* radianer.

source: Return the tangent of *x* radians.
sv: Returnerar tangenten av *x* radianer.

source: Hyperbolic functions
sv: Hyperboliska funktioner

source: `Hyperbolic functions <https://en.wikipedia.org/wiki/Hyperbolic_functions>`_ are analogs of trigonometric functions that are based on hyperbolas instead of circles.
sv: hyperboliska funktioner <https://en.wikipedia.org/wiki/Hyperbolic_functions>`_ är motsvarigheter till trigonometriska funktioner som baseras på hyperbler i stället för cirklar.

source: Return the inverse hyperbolic cosine of *x*.
sv: Returnerar den inversa hyperboliska cosinus av *x*.

source: Return the inverse hyperbolic sine of *x*.
sv: Returnerar den inverterade hyperboliska sinus av *x*.

source: Return the inverse hyperbolic tangent of *x*.
sv: Returnerar den omvända hyperboliska tangenten för *x*.

source: Return the hyperbolic cosine of *x*.
sv: Returnerar hyperbolisk cosinus av *x*.

source: Return the hyperbolic sine of *x*.
sv: Returnerar den hyperboliska sinusformen av *x*.

source: Return the hyperbolic tangent of *x*.
sv: Returnerar den hyperboliska tangenten för *x*.

source: Special functions
sv: Särskilda funktioner

source: Return the `error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*.
sv: Returnera `felsfunktionen <https://en.wikipedia.org/wiki/Error_function>`_ vid *x*.

source: The :func:`erf` function can be used to compute traditional statistical functions such as the `cumulative standard normal distribution <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_::
sv: Funktionen :func:`erf` kan användas för att beräkna traditionella statistiska funktioner som t.ex. den kumulativa standardnormalfördelningen <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_::

source: def phi(x): 'Cumulative distribution function for the standard normal distribution' return (1.0 + erf(x / sqrt(2.0))) / 2.0
sv: def phi(x): "Kumulativ fördelningsfunktion för standardnormalfördelningen returnera (1,0 + erf(x / sqrt(2,0)))) / 2.0

source: Return the complementary error function at *x*. The `complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ is defined as ``1.0 - erf(x)``. It is used for large values of *x* where a subtraction from one would cause a `loss of significance <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.
sv: Returnerar den komplementära felfunktionen vid *x*. Den komplementära felfunktionen <https://en.wikipedia.org/wiki/Error_function>`_ definieras som ``1,0 - erf(x)``. Den används för stora värden på *x* där en subtraktion från ett skulle orsaka en "förlust av signifikans" <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.

source: Return the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*.
sv: Returnera `Gamma-funktionen <https://en.wikipedia.org/wiki/Gamma_function>`_ vid *x*.

source: Return the natural logarithm of the absolute value of the Gamma function at *x*.
sv: Returnerar den naturliga logaritmen av absolutvärdet av Gamma-funktionen vid *x*.

source: Constants
sv: Konstanter

source: The mathematical constant *π* = 3.141592..., to available precision.
sv: Den matematiska konstanten *π* = 3,141592..., med tillgänglig precision.

source: The mathematical constant *e* = 2.718281..., to available precision.
sv: Den matematiska konstanten *e* = 2,718281..., med tillgänglig precision.

source: The mathematical constant *τ* = 6.283185..., to available precision. Tau is a circle constant equal to 2\ *π*, the ratio of a circle's circumference to its radius. To learn more about Tau, check out Vi Hart's video `Pi is (still) Wrong <https://vimeo.com/147792667>`_, and start celebrating `Tau day <https://tauday.com/>`_ by eating twice as much pie!
sv: Den matematiska konstanten *τ* = 6,283185..., med tillgänglig precision. Tau är en cirkelkonstant som är lika med 2\ *π*, förhållandet mellan en cirkels omkrets och dess radie. För att lära dig mer om Tau, kolla in Vi Harts video `Pi is (still) Wrong <https://vimeo.com/147792667>`_, och börja fira `Tau day <https://tauday.com/>`_ genom att äta dubbelt så mycket paj!

source: A floating-point positive infinity. (For negative infinity, use ``-math.inf``.) Equivalent to the output of ``float('inf')``.
sv: En positiv oändlighet med flyttal. (För negativ oändlighet, använd ``-math.inf``.) Motsvarar resultatet av ``float('inf')``.

source: A floating-point "not a number" (NaN) value. Equivalent to the output of ``float('nan')``. Due to the requirements of the `IEEE-754 standard <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` and ``float('nan')`` are not considered to equal to any other numeric value, including themselves. To check whether a number is a NaN, use the :func:`isnan` function to test for NaNs instead of ``is`` or ``==``. Example:
sv: Ett flyttalsvärde som "inte är ett tal" (NaN). Motsvarar utmatningen från ``float('nan')``. På grund av kraven i standarden `IEEE-754 <https://en.wikipedia.org/wiki/IEEE_754>`_ anses ``math.nan`` och ``float('nan')`` inte vara lika med något annat numeriskt värde, inklusive sig själva. För att kontrollera om ett tal är ett NaN, använd funktionen :func:`isnan` för att testa för NaN istället för ``is`` eller ``==``. Ett exempel:

source: It is now always available.
sv: Den är nu alltid tillgänglig.

source: The :mod:`math` module consists mostly of thin wrappers around the platform C math library functions. Behavior in exceptional cases follows Annex F of the C99 standard where appropriate. The current implementation will raise :exc:`ValueError` for invalid operations like ``sqrt(-1.0)`` or ``log(0.0)`` (where C99 Annex F recommends signaling invalid operation or divide-by-zero), and :exc:`OverflowError` for results that overflow (for example, ``exp(1000.0)``). A NaN will not be returned from any of the functions above unless one or more of the input arguments was a NaN; in that case, most functions will return a NaN, but (again following C99 Annex F) there are some exceptions to this rule, for example ``pow(float('nan'), 0.0)`` or ``hypot(float('nan'), float('inf'))``.
sv: Modulen :mod:`math` består mestadels av tunna omslag runt plattformens C-matematiska biblioteksfunktioner. Beteendet i undantagsfall följer Annex F i C99-standarden där så är lämpligt. Den nuvarande implementationen kommer att ge :exc:`ValueError` för ogiltiga operationer som ``sqrt(-1,0)`` eller ``log(0,0)`` (där C99 Annex F rekommenderar att man signalerar ogiltig operation eller dividerar med noll), och :exc:`OverflowError` för resultat som överflödar (till exempel ``exp(1000,0)``). Ett NaN kommer inte att returneras från någon av funktionerna ovan om inte ett eller flera av inmatningsargumenten var ett NaN; i så fall kommer de flesta funktioner att returnera ett NaN, men (återigen enligt C99 Annex F) finns det några undantag från denna regel, till exempel ``pow(float('nan'), 0.0)`` eller ``hypot(float('nan'), float('inf'))``.

source: Note that Python makes no effort to distinguish signaling NaNs from quiet NaNs, and behavior for signaling NaNs remains unspecified. Typical behavior is to treat all NaNs as though they were quiet.
sv: Observera att Python inte gör något försök att skilja signalerande NaNs från tysta NaNs, och beteendet för signalerande NaNs förblir ospecificerat. Typiskt beteende är att behandla alla NaN som om de vore tysta.

source: Module :mod:`cmath`
sv: Modul :mod:`cmath`

source: Complex number versions of many of these functions.
sv: Komplexa talversioner av många av dessa funktioner.
