Repository: yeager/python-docs-sv
Catalog: library/math.po
Languages: sv

source: :mod:`!math` --- Mathematical functions
sv: :mod:`!math` --- Matematiska funktioner

source: This module provides access to common mathematical functions and constants, including those defined by the C standard.
sv: Denna modul ger tillgång till vanliga matematiska funktioner och konstanter, inklusive de som definieras av C-standarden.

source: These functions cannot be used with complex numbers; use the functions of the same name from the :mod:`cmath` module if you require support for complex numbers. The distinction between functions which support complex numbers and those which don't is made since most users do not want to learn quite as much mathematics as required to understand complex numbers. Receiving an exception instead of a complex result allows earlier detection of the unexpected complex number used as a parameter, so that the programmer can determine how and why it was generated in the first place.
sv: Dessa funktioner kan inte användas med komplexa tal; använd funktionerna med samma namn från modulen :mod:`cmath` om du behöver stöd för komplexa tal. Distinktionen mellan funktioner som stöder komplexa tal och de som inte gör det görs eftersom de flesta användare inte vill lära sig så mycket matematik som krävs för att förstå komplexa tal. Om man får ett undantag i stället för ett komplext resultat kan man tidigare upptäcka det oväntade komplexa talet som används som parameter, så att programmeraren kan avgöra hur och varför det genererades från första början.

source: The following functions are provided by this module. Except when explicitly noted otherwise, all return values are floats.
sv: Följande funktioner tillhandahålls av denna modul. Om inte annat uttryckligen anges är alla returvärden flyttal.

source: **Number-theoretic functions**
sv: **Numerteoretiska funktioner**

source: Number of ways to choose *k* items from *n* items without repetition and without order
sv: Antal sätt att välja *k* artiklar från *n* artiklar utan upprepning och utan ordning

source: *n* factorial
sv: *n* faktoriell

source: Greatest common divisor of the integer arguments
sv: Största gemensamma divisor av heltalsargumenten

source: Integer square root of a nonnegative integer *n*
sv: Integer kvadratrot av ett icke-negativt heltal *n*

source: Least common multiple of the integer arguments
sv: Minsta gemensamma multipel av heltalsargumenten

source: Number of ways to choose *k* items from *n* items without repetition and with order
sv: Antal sätt att välja *k* artiklar från *n* artiklar utan upprepning och med ordning

source: **Floating point arithmetic**
sv: **Aritmetik med flyttal**

source: Ceiling of *x*, the smallest integer greater than or equal to *x*
sv: Tak för *x*, det minsta heltal som är större än eller lika med *x*

source: Absolute value of *x*
sv: Absolut värde av *x*

source: Floor of *x*, the largest integer less than or equal to *x*
sv: Golv av *x*, det största heltalet mindre än eller lika med *x*

source: Fused multiply-add operation: ``(x * y) + z``
sv: Kombinerad multiplicera-add-operation: ``(x * y) + z``

source: Remainder of division ``x / y``
sv: Resterande del av divisionen ``x / y``

source: Fractional and integer parts of *x*
sv: Bråkdelar och heltalsdelar av *x*

source: Remainder of *x* with respect to *y*
sv: Resterande del av *x* i förhållande till *y*

source: Integer part of *x*
sv: Heltalsdel av *x*

source: **Floating point manipulation functions**
sv: **Funktioner för manipulation av flyttal**

source: Magnitude (absolute value) of *x* with the sign of *y*
sv: Magnituden (absolutvärdet) av *x* med tecknet för *y*

source: Mantissa and exponent of *x*
sv: Mantissa och exponent för *x*

source: Check if the values *a* and *b* are close to each other
sv: Kontrollera om värdena *a* och *b* ligger nära varandra

source: Check if *x* is neither an infinity nor a NaN
sv: Kontrollera om *x* varken är oändligt eller NaN

source: Check if *x* is a positive or negative infinity
sv: Kontrollera om *x* är en positiv eller negativ oändlighet

source: Check if *x* is a NaN (not a number)
sv: Kontrollera om *x* är ett NaN (inte ett tal)

source: ``x * (2**i)``, inverse of function :func:`frexp`
sv: ``x * (2**i)``, invers av funktionen :func:`frexp`

source: Floating-point value *steps* steps after *x* towards *y*
sv: Flyttalsvärde *steps* stegar efter *x* mot *y*

source: Value of the least significant bit of *x*
sv: Värdet av den minst signifikanta biten i *x*

source: **Power, exponential and logarithmic functions**
sv: **Potens-, exponential- och logaritmfunktioner**

source: Cube root of *x*
sv: Kubrot av *x*

source: *e* raised to the power *x*
sv: *e* upphöjd till makten *x*

source: *2* raised to the power *x*
sv: *2* upphöjd till kraft *x*

source: *e* raised to the power *x*, minus 1
sv: *e* upphöjt till potensen *x*, minus 1

source: Logarithm of *x* to the given base (*e* by default)
sv: Logaritmen av *x* till den angivna basen (*e* som standard)

source: Natural logarithm of *1+x* (base *e*)
sv: Naturlig logaritm av *1+x* (bas *e*)

source: Base-2 logarithm of *x*
sv: Bas-2 logaritm av *x*

source: Base-10 logarithm of *x*
sv: Bas-10 logaritmen av *x*

source: *x* raised to the power *y*
sv: *x* upphöjd till makten *y*

source: Square root of *x*
sv: Kvadratrot av *x*

source: **Summation and product functions**
sv: **Summa och produktfunktioner**

source: Euclidean distance between two points *p* and *q* given as an iterable of coordinates
sv: Euklidiskt avstånd mellan två punkter *p* och *q* givet som en iterabel av koordinater

source: Sum of values in the input *iterable*
sv: Summan av värdena i indata *iterable*

source: Euclidean norm of an iterable of coordinates
sv: Euklidisk norm för en iterabel med koordinater

source: Product of elements in the input *iterable* with a *start* value
sv: Produkt av element i indata *iterable* med ett *start* värde

source: Sum of products from two iterables *p* and *q*
sv: Summan av produkterna från två iterabler *p* och *q*

source: **Angular conversion**
sv: **Vinkelomvandling**

source: Convert angle *x* from radians to degrees
sv: Konvertera vinkel *x* från radianer till grader

source: :func:`radians(x) <radians>`
sv: :func:`radianer(x) <radians>`

source: Convert angle *x* from degrees to radians
sv: Konvertera vinkel *x* från grader till radianer

source: **Trigonometric functions**
sv: **Trigonometriska funktioner**

source: Arc cosine of *x*
sv: Arc cosinus av *x*

source: Arc sine of *x*
sv: Arc sinus av *x*

source: Arc tangent of *x*
sv: Arc tangent av *x*

source: Cosine of *x*
sv: Cosinus av *x*

source: Sine of *x*
sv: Sinus av *x*

source: Tangent of *x*
sv: Tangent av *x*

source: **Hyperbolic functions**
sv: **Hyperboliska funktioner**

source: Inverse hyperbolic cosine of *x*
sv: Invers hyperbolisk cosinus av *x*

source: Inverse hyperbolic sine of *x*
sv: Omvänd hyperbolisk sinus av *x*

source: Inverse hyperbolic tangent of *x*
sv: Omvänd hyperbolisk tangent till *x*

source: Hyperbolic cosine of *x*
sv: Hyperbolisk cosinus av *x*

source: Hyperbolic sine of *x*
sv: Hyperbolisk sinus av *x*

source: Hyperbolic tangent of *x*
sv: Hyperbolisk tangent till *x*

source: **Special functions**
sv: **Särskilda funktioner**

source: `Error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*
sv: `Felfunktion <https://en.wikipedia.org/wiki/Error_function>`_ vid *x*

source: `Complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*
sv: `Kompletterande felfunktion <https://en.wikipedia.org/wiki/Error_function>`_ vid *x*

source: `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*
sv: `Gammafunktion <https://en.wikipedia.org/wiki/Gamma_function>`_ vid *x*

source: Natural logarithm of the absolute value of the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*
sv: Naturlig logaritm av absolutvärdet av `Gamma-funktionen <https://en.wikipedia.org/wiki/Gamma_function>`_ vid *x*

source: **Constants**
sv: **Konstanter**

source: Positive infinity
sv: Positiv oändlighet

source: "Not a number" (NaN)
sv: "Inte ett tal" (NaN)

source: Number-theoretic functions
sv: Nummerteoretiska funktioner

source: Return the number of ways to choose *k* items from *n* items without repetition and without order.
sv: Returnera antalet sätt att välja *k* objekt från *n* objekt utan upprepning och utan ordning.

source: Evaluates to ``n! / (k! * (n - k)!)`` when ``k <= n`` and evaluates to zero when ``k > n``.
sv: Utvärderas till ``n! / (k! * (n - k)!)`` när ``k <= n`` och utvärderas till noll när ``k > n``.

source: Also called the binomial coefficient because it is equivalent to the coefficient of k-th term in polynomial expansion of ``(1 + x)ⁿ``.
sv: Kallas även binomialkoefficienten eftersom den motsvarar koefficienten för den k:e termen i polynomutvecklingen av ``(1 + x)ⁿ``.

source: Raises :exc:`TypeError` if either of the arguments are not integers. Raises :exc:`ValueError` if either of the arguments are negative.
sv: Utlöser :exc:`TypeError` om något av argumenten inte är heltal. Utlöser :exc:`ValueError` om något av argumenten är negativa.

source: Return factorial of the nonnegative integer *n*.
sv: Returnerar faktoriellt av det icke-negativa heltalet *n*.

source: Floats with integral values (like ``5.0``) are no longer accepted.
sv: Floater med heltalsvärden (som ``5.0``) accepteras inte längre.

source: Return the greatest common divisor of the specified integer arguments. If any of the arguments is nonzero, then the returned value is the largest positive integer that is a divisor of all arguments. If all arguments are zero, then the returned value is ``0``. ``gcd()`` without arguments returns ``0``.
sv: Returnerar den största gemensamma divisorn av de angivna heltalsargumenten. Om något av argumenten inte är noll, är det returnerade värdet det största positiva heltal som är divisor till alla argument. Om alla argument är noll, är det returnerade värdet ``0``. ``gcd()`` utan argument returnerar ``0``.

source: Added support for an arbitrary number of arguments. Formerly, only two arguments were supported.
sv: Stöd för ett godtyckligt antal argument har lagts till. Tidigare stöddes endast två argument.

source: Return the integer square root of the nonnegative integer *n*. This is the floor of the exact square root of *n*, or equivalently the greatest integer *a* such that *a*\ ² |nbsp| ≤ |nbsp| *n*.
sv: Returnerar heltalets kvadratrot av det icke-negativa heltalet *n*. Detta är golvet i den exakta kvadratroten av *n*, eller motsvarande det största heltalet *a* som är sådant att *a*\ ² |nbsp| ≤ |nbsp| *n*.

source: For some applications, it may be more convenient to have the least integer *a* such that *n* |nbsp| ≤ |nbsp| *a*\ ², or in other words the ceiling of the exact square root of *n*. For positive *n*, this can be computed using ``a = 1 + isqrt(n - 1)``.
sv: För vissa tillämpningar kan det vara mer praktiskt att ha det minsta heltalet *a* så att *n* |nbsp| ≤ |nbsp| *a*\ ², eller med andra ord taket för den exakta kvadratroten av *n*. För positiva *n* kan detta beräknas med hjälp av ``a = 1 + isqrt(n - 1)``.

source: Return the least common multiple of the specified integer arguments. If all arguments are nonzero, then the returned value is the smallest positive integer that is a multiple of all arguments. If any of the arguments is zero, then the returned value is ``0``. ``lcm()`` without arguments returns ``1``.
sv: Returnerar den minsta gemensamma multipeln av de angivna heltalsargumenten. Om alla argument är olika noll är det returnerade värdet det minsta positiva heltalet som är en multipel av alla argument. Om något av argumenten är noll, är det returnerade värdet ``0``. ``lcm()`` utan argument returnerar ``1``.

source: Return the number of ways to choose *k* items from *n* items without repetition and with order.
sv: Returnera antalet sätt att välja *k* objekt från *n* objekt utan upprepning och med ordning.

source: Evaluates to ``n! / (n - k)!`` when ``k <= n`` and evaluates to zero when ``k > n``.
sv: Utvärderas till ``n! / (n - k)!`` när ``k <= n`` och utvärderas till noll när ``k > n``.

source: If *k* is not specified or is ``None``, then *k* defaults to *n* and the function returns ``n!``.
sv: Om *k* inte anges eller är ``None``, är *k* standardvärdet för *n* och funktionen returnerar ``n!``.

source: Floating point arithmetic
sv: Aritmetik med flyttal

source: Return the ceiling of *x*, the smallest integer greater than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__ceil__ <object.__ceil__>`, which should return an :class:`~numbers.Integral` value.
sv: Returnerar taket för *x*, det minsta heltalet som är större än eller lika med *x*. Om *x* inte är en float, delegeras till :meth:`x.__ceil__ <object.__ceil__>`, som bör returnera ett :class:`~numbers.Integral`-värde.

source: Return the absolute value of *x*.
sv: Returnerar det absoluta värdet av *x*.

source: Return the floor of *x*, the largest integer less than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__floor__ <object.__floor__>`, which should return an :class:`~numbers.Integral` value.
sv: Returnerar golvet av *x*, det största heltalet mindre än eller lika med *x*. Om *x* inte är en float, delegeras till :meth:`x.__floor__ <object.__floor__>`, som bör returnera ett :class:`~numbers.Integral`-värde.

source: Fused multiply-add operation. Return ``(x * y) + z``, computed as though with infinite precision and range followed by a single round to the ``float`` format. This operation often provides better accuracy than the direct expression ``(x * y) + z``.
sv: Fusionerad multiplicera-add-operation. Returnerar ``(x * y) + z``, beräknat som om det vore med oändlig precision och intervall följt av en enda avrundning till ``float``-formatet. Denna operation ger ofta bättre noggrannhet än det direkta uttrycket ``(x * y) + z``.

source: This function follows the specification of the fusedMultiplyAdd operation described in the IEEE 754 standard. The standard leaves one case implementation-defined, namely the result of ``fma(0, inf, nan)`` and ``fma(inf, 0, nan)``. In these cases, ``math.fma`` returns a NaN, and does not raise any exception.
sv: Denna funktion följer specifikationen för fusedMultiplyAdd-operationen som beskrivs i IEEE 754-standarden. Standarden lämnar ett fall implementationsdefinierat, nämligen resultatet av ``fma(0, inf, nan)`` och ``fma(inf, 0, nan)``. I dessa fall returnerar ``math.fma`` ett NaN och ger inte upphov till något undantag.

source: Return the floating-point remainder of ``x / y``, as defined by the platform C library function ``fmod(x, y)``. Note that the Python expression ``x % y`` may not return the same result. The intent of the C standard is that ``fmod(x, y)`` be exactly (mathematically; to infinite precision) equal to ``x - n*y`` for some integer *n* such that the result has the same sign as *x* and magnitude less than ``abs(y)``. Python's ``x % y`` returns a result with the sign of *y* instead, and may not be exactly computable for float arguments. For example, ``fmod(-1e-100, 1e100)`` is ``-1e-100``, but the result of Python's ``-1e-100 % 1e100`` is ``1e100-1e-100``, which cannot be represented exactly as a float, and rounds to the surprising ``1e100``. For this reason, function :func:`fmod` is generally preferred when working with floats, while Python's ``x % y`` is preferred when working with integers.
sv: Returnerar restvärdet i flyttal av ``x / y``, enligt definitionen av plattformens C-biblioteksfunktion ``fmod(x, y)``. Observera att Python-uttrycket ``x % y`` kanske inte returnerar samma resultat. Avsikten med C-standarden är att ``fmod(x, y)`` ska vara exakt (matematiskt; till oändlig precision) lika med ``x - n*y`` för något heltal *n* så att resultatet har samma tecken som *x* och storlek mindre än ``abs(y)``. Pythons ``x % y`` returnerar ett resultat med tecknet *y* istället, och kanske inte är exakt beräkningsbart för float-argument. Till exempel är ``fmod(-1e-100, 1e100)`` ``-1e-100``, men resultatet av Pythons ``-1e-100 % 1e100`` är ``1e100-1e-100``, som inte kan representeras exakt som en float, och avrundas till den överraskande ``1e100``. Av denna anledning är funktionen :func:`fmod` i allmänhet att föredra när man arbetar med flyttal, medan Pythons ``x % y`` är att föredra när man arbetar med heltal.

source: Return the fractional and integer parts of *x*. Both results carry the sign of *x* and are floats.
sv: Returnerar bråktals- och heltalsdelarna av *x*. Båda resultaten har tecknet för *x* och är flyttal.

source: Note that :func:`modf` has a different call/return pattern than its C equivalents: it takes a single argument and return a pair of values, rather than returning its second return value through an 'output parameter' (there is no such thing in Python).
sv: Observera att :func:`modf` har ett annat anrops-/returmönster än sina motsvarigheter i C: den tar ett enda argument och returnerar ett par värden, i stället för att returnera sitt andra returvärde via en "utgångsparameter" (det finns inget sådant i Python).

source: Return the IEEE 754-style remainder of *x* with respect to *y*. For finite *x* and finite nonzero *y*, this is the difference ``x - n*y``, where ``n`` is the closest integer to the exact value of the quotient ``x / y``. If ``x / y`` is exactly halfway between two consecutive integers, the nearest *even* integer is used for ``n``. The remainder ``r = remainder(x, y)`` thus always satisfies ``abs(r) <= 0.5 * abs(y)``.
sv: Returnerar restvärdet i IEEE 754-stil av *x* med avseende på *y*. För ändliga *x* och ändliga *y* som inte är noll är detta skillnaden ``x - n*y``, där ``n`` är det närmaste heltalet till det exakta värdet av kvoten ``x / y``. Om ``x / y`` ligger exakt mitt emellan två på varandra följande heltal, används det närmaste *jämna* heltalet för ``n``. Resten ``r = rest(x, y)`` uppfyller således alltid ``abs(r) <= 0,5 * abs(y)``.

source: Special cases follow IEEE 754: in particular, ``remainder(x, math.inf)`` is *x* for any finite *x*, and ``remainder(x, 0)`` and ``remainder(math.inf, x)`` raise :exc:`ValueError` for any non-NaN *x*. If the result of the remainder operation is zero, that zero will have the same sign as *x*.
sv: Specialfall följer IEEE 754: i synnerhet är ``remainder(x, math.inf)`` *x* för alla ändliga *x*, och ``remainder(x, 0)`` och ``remainder(math.inf, x)`` ger upphov till :exc:`ValueError` för alla icke-NaN *x*. Om resultatet av remainder-operationen är noll, kommer nollan att ha samma tecken som *x*.

source: On platforms using IEEE 754 binary floating point, the result of this operation is always exactly representable: no rounding error is introduced.
sv: På plattformar som använder IEEE 754 binär flyttal är resultatet av denna operation alltid exakt representativt: inget avrundningsfel införs.

source: Return *x* with the fractional part removed, leaving the integer part. This rounds toward 0: ``trunc()`` is equivalent to :func:`floor` for positive *x*, and equivalent to :func:`ceil` for negative *x*. If *x* is not a float, delegates to :meth:`x.__trunc__ <object.__trunc__>`, which should return an :class:`~numbers.Integral` value.
sv: Returnerar *x* med bråkdelen borttagen, så att heltalsdelen återstår. Detta avrundas mot 0: ``trunc()`` är likvärdigt med :func:`floor` för positiva *x*, och likvärdigt med :func:`ceil` för negativa *x*. Om *x* inte är en float, delegeras till :meth:`x.__trunc__ <object.__trunc__>`, som bör returnera ett :class:`~numbers.Integral`-värde.

source: For the :func:`ceil`, :func:`floor`, and :func:`modf` functions, note that *all* floating-point numbers of sufficiently large magnitude are exact integers. Python floats typically carry no more than 53 bits of precision (the same as the platform C double type), in which case any float *x* with ``abs(x) >= 2**52`` necessarily has no fractional bits.
sv: För funktionerna :func:`ceil`, :func:`floor`, och :func:`modf`, notera att *alla* flyttal av tillräckligt stor storlek är exakta heltal. Pythons flyttal har vanligtvis inte mer än 53 bitars precision (samma som plattform C:s dubbeltyp), i vilket fall alla flyttal *x* med ``abs(x) >= 2**52`` nödvändigtvis inte har några bråkdelar.

source: Floating point manipulation functions
sv: Funktioner för manipulation av flyttal

source: Return a float with the magnitude (absolute value) of *x* but the sign of *y*. On platforms that support signed zeros, ``copysign(1.0, -0.0)`` returns *-1.0*.
sv: Returnerar en float med magnituden (absolutvärdet) *x* men tecknet *y*. På plattformar som stöder signerade nollor returnerar ``copysign(1,0, -0,0)`` *-1,0*.

source: Return the mantissa and exponent of *x* as the pair ``(m, e)``. *m* is a float and *e* is an integer such that ``x == m * 2**e`` exactly. If *x* is zero, returns ``(0.0, 0)``, otherwise ``0.5 <= abs(m) < 1``. This is used to "pick apart" the internal representation of a float in a portable way.
sv: Returnerar mantissa och exponent för *x* som paret ``(m, e)``. *m* är ett flyttal och *e* är ett heltal så att ``x == m * 2**e`` exakt. Om *x* är noll returneras ``(0,0, 0)``, annars ``0,5 <= abs(m) < 1``. Detta används för att "plocka isär" den interna representationen av en float på ett portabelt sätt.

source: Note that :func:`frexp` has a different call/return pattern than its C equivalents: it takes a single argument and return a pair of values, rather than returning its second return value through an 'output parameter' (there is no such thing in Python).
sv: Observera att :func:`frexp` har ett annat anrops-/returmönster än sina motsvarigheter i C: den tar ett enda argument och returnerar ett par värden, i stället för att returnera sitt andra returvärde via en "utgångsparameter" (det finns inget sådant i Python).

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
sv: Returnerar ``True`` om värdena *a* och *b* ligger nära varandra och ``False`` i annat fall.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances. If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
sv: Huruvida två värden anses ligga nära varandra eller inte avgörs enligt givna absoluta och relativa toleranser. Om inga fel inträffar blir resultatet: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be nonnegative and less than ``1.0``.
sv: *rel_tol* är den relativa toleransen - det är den maximalt tillåtna skillnaden mellan *a* och *b*, i förhållande till det större absoluta värdet av *a* eller *b*. Om du t.ex. vill ange en tolerans på 5 % anger du ``rel_tol=0,05``. Standardtoleransen är ``1e-09``, vilket garanterar att de två värdena är lika inom cirka 9 decimaler. *rel_tol* måste vara icke-negativt och mindre än ``1,0``.
