Repository: yeager/python-docs-sv
Catalog: library/multiprocessing.shared_memory.po
Languages: sv

source: The following example depicts how one, two, or many processes may access the same :class:`ShareableList` by supplying the name of the shared memory block behind it:
sv: Följande exempel visar hur en, två eller många processer kan komma åt samma :class:`ShareableList` genom att ange namnet på det bakomliggande delade minnesblocket:

source: The following examples demonstrates that :class:`ShareableList` (and underlying :class:`SharedMemory`) objects can be pickled and unpickled if needed. Note, that it will still be the same shared object. This happens, because the deserialized object has the same unique name and is just attached to an existing object with the same name (if the object is still alive):
sv: Följande exempel visar att :class:`ShareableList` (och underliggande :class:`SharedMemory`) objekt kan picklas och unpicklas vid behov. Notera, att det fortfarande kommer att vara samma delade objekt. Detta händer eftersom det deserialiserade objektet har samma unika namn och bara är kopplat till ett befintligt objekt med samma namn (om objektet fortfarande är vid liv):

source: Shared Memory
sv: Delat minne

source: POSIX Shared Memory
sv: POSIX delat minne

source: Named Shared Memory
sv: Namngivet delat minne
