Repository: yeager/python-docs-sv
Catalog: library/netrc.po
Languages: sv

source: :mod:`!netrc` --- netrc file processing
sv: :mod:`!netrc` --- Bearbetning av netrc-fil

source: **Source code:** :source:`Lib/netrc.py`
sv: **Källkod:** :source:`Lib/netrc.py`

source: The :class:`~netrc.netrc` class parses and encapsulates the netrc file format used by the Unix :program:`ftp` program and other FTP clients.
sv: Klassen :class:`~netrc.netrc` analyserar och kapslar in filformatet netrc som används av Unix-programmet :program:`ftp` och andra FTP-klienter.

source: A :class:`~netrc.netrc` instance or subclass instance encapsulates data from a netrc file. The initialization argument, if present, specifies the file to parse. If no argument is given, the file :file:`.netrc` in the user's home directory -- as determined by :func:`os.path.expanduser` -- will be read. Otherwise, a :exc:`FileNotFoundError` exception will be raised. Parse errors will raise :exc:`NetrcParseError` with diagnostic information including the file name, line number, and terminating token.
sv: En :class:`~netrc.netrc`-instans eller underklass-instans kapslar in data från en netrc-fil. Initialiseringsargumentet, om det finns, anger vilken fil som skall analyseras. Om inget argument anges kommer filen :file:`.netrc` i användarens hemkatalog -- som bestäms av :func:`os.path.expanduser` -- att läsas. Annars kommer ett :exc:`FileNotFoundError` undantag att uppstå. Parse-fel kommer att ge upphov till :exc:`NetrcParseError` med diagnostisk information inklusive filnamn, radnummer och avslutande token.

source: If no argument is specified on a POSIX system, the presence of passwords in the :file:`.netrc` file will raise a :exc:`NetrcParseError` if the file ownership or permissions are insecure (owned by a user other than the user running the process, or accessible for read or write by any other user). This implements security behavior equivalent to that of ftp and other programs that use :file:`.netrc`. Such security checks are not available on platforms that do not support :func:`os.getuid`.
sv: Om inget argument anges på ett POSIX-system kommer förekomsten av lösenord i filen :file:`.netrc` att ge upphov till ett :exc:`NetrcParseError` om filägandet eller behörigheterna är osäkra (ägs av en annan användare än den som kör processen, eller är tillgängliga för läsning eller skrivning av någon annan användare). Detta implementerar ett säkerhetsbeteende som är likvärdigt med det i ftp och andra program som använder :file:`.netrc`. Sådana säkerhetskontroller är inte tillgängliga på plattformar som inte stöder :func:`os.getuid`.

source: Added the POSIX permission check.
sv: Lagt till kontroll av POSIX-behörighet.

source: :func:`os.path.expanduser` is used to find the location of the :file:`.netrc` file when *file* is not passed as argument.
sv: :func:`os.path.expanduser` används för att hitta platsen för :file:`.netrc`-filen när *file* inte anges som argument.

source: :class:`netrc` try UTF-8 encoding before using locale specific encoding. The entry in the netrc file no longer needs to contain all tokens. The missing tokens' value default to an empty string. All the tokens and their values now can contain arbitrary characters, like whitespace and non-ASCII characters. If the login name is anonymous, it won't trigger the security check.
sv: :class:`netrc` försöker UTF-8-kodning innan lokalspecifik kodning används. Posten i netrc-filen behöver inte längre innehålla alla tokens. Värdet för de tokens som saknas är som standard en tom sträng. Alla tokens och deras värden kan nu innehålla godtyckliga tecken, t.ex. blanksteg och icke-ASCII-tecken. Om inloggningsnamnet är anonymt kommer det inte att utlösa säkerhetskontrollen.

source: Exception raised by the :class:`~netrc.netrc` class when syntactical errors are encountered in source text. Instances of this exception provide three interesting attributes:
sv: Undantag som skapas av :class:`~netrc.netrc`-klassen när syntaktiska fel påträffas i källtexten. Instanser av detta undantag ger tre intressanta attribut:

source: Textual explanation of the error.
sv: Textuell förklaring av felet.

source: The name of the source file.
sv: Namnet på källfilen.

source: The line number on which the error was found.
sv: Radnumret där felet upptäcktes.

source: netrc Objects
sv: netrc-objekt

source: A :class:`~netrc.netrc` instance has the following methods:
sv: En instans av :class:`~netrc.netrc` har följande metoder:

source: Return a 3-tuple ``(login, account, password)`` of authenticators for *host*. If the netrc file did not contain an entry for the given host, return the tuple associated with the 'default' entry. If neither matching host nor default entry is available, return ``None``.
sv: Returnerar en 3-tupel ``(inloggning, konto, lösenord)`` av autentiserare för *host*. Om netrc-filen inte innehöll någon post för den angivna värden, returneras den tupel som är associerad med "default"-posten. Om varken matchande värd eller standardpost finns tillgänglig, returneras ``None``.

source: Dump the class data as a string in the format of a netrc file. (This discards comments and may reorder the entries.)
sv: Dumpar klassdata som en sträng i samma format som en netrc-fil. (Detta tar bort kommentarer och kan ändra ordningen på posterna)

source: Instances of :class:`~netrc.netrc` have public instance variables:
sv: Instanser av :class:`~netrc.netrc` har offentliga instansvariabler:

source: Dictionary mapping host names to ``(login, account, password)`` tuples. The 'default' entry, if any, is represented as a pseudo-host by that name.
sv: Ordbok som mappar värdnamn till ``(login, account, password)``-tupler. Den eventuella "default"-posten representeras som en pseudovärd med det namnet.

source: Dictionary mapping macro names to string lists.
sv: Ordbok som mappar makronamn till stränglistor.
