Repository: yeager/python-docs-sv
Catalog: library/numbers.po
Languages: sv

source: :mod:`!numbers` --- Numeric abstract base classes
sv: :mod:`!numbers` --- Numeriska abstrakta basklasser

source: **Source code:** :source:`Lib/numbers.py`
sv: **Källkod:** :source:`Lib/numbers.py`

source: The :mod:`!numbers` module (:pep:`3141`) defines a hierarchy of numeric :term:`abstract base classes <abstract base class>` which progressively define more operations. None of the types defined in this module are intended to be instantiated.
sv: Modulen :mod:`!numbers` (:pep:`3141`) definierar en hierarki av numeriska :term:`abstrakta basklasser <abstract base class>` som successivt definierar fler operationer. Ingen av de typer som definieras i denna modul är avsedda att instansieras.

source: The root of the numeric hierarchy. If you just want to check if an argument *x* is a number, without caring what kind, use ``isinstance(x, Number)``.
sv: Roten i den numeriska hierarkin. Om du bara vill kontrollera om ett argument *x* är ett tal, utan att bry dig om vilken typ, använd ``isinstance(x, Number)``.

source: The numeric tower
sv: Det numeriska tornet

source: Subclasses of this type describe complex numbers and include the operations that work on the built-in :class:`complex` type. These are: conversions to :class:`complex` and :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``*``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==``, and ``!=``. All except ``-`` and ``!=`` are abstract.
sv: Subklasser av denna typ beskriver komplexa tal och innehåller de operationer som fungerar på den inbyggda typen :class:`complex`. Dessa är: konverteringar till :class:`complex` och :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``*``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==`` och ``!=``. Alla utom ``-`` och ``!=`` är abstrakta.

source: Abstract. Retrieves the real component of this number.
sv: Sammanfattning. Hämtar den reella komponenten i detta tal.

source: Abstract. Retrieves the imaginary component of this number.
sv: Sammanfattning. Hämtar den imaginära komponenten i detta tal.

source: Abstract. Returns the complex conjugate. For example, ``(1+3j).conjugate() == (1-3j)``.
sv: Sammanfattning. Returnerar den komplexa konjugaten. Till exempel, ``(1+3j).conjugate() == (1-3j)``.

source: To :class:`Complex`, :class:`!Real` adds the operations that work on real numbers.
sv: Till :class:`Complex` lägger :class:`!Real` till de operationer som fungerar på reella tal.

source: In short, those are: a conversion to :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>``, and ``>=``.
sv: I korthet är dessa: en konvertering till :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>`` och ``>=``.

source: Real also provides defaults for :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag`, and :meth:`~Complex.conjugate`.
sv: Real innehåller också standardvärden för :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag` och :meth:`~Complex.conjugate`.

source: Subtypes :class:`Real` and adds :attr:`~Rational.numerator` and :attr:`~Rational.denominator` properties. It also provides a default for :func:`float`.
sv: Subtyp av :class:`Real` och lägger till egenskaperna :attr:`~Rational.numerator` och :attr:`~Rational.denominator`. Det ger också en standard för :func:`float`.

source: The :attr:`~Rational.numerator` and :attr:`~Rational.denominator` values should be instances of :class:`Integral` and should be in lowest terms with :attr:`~Rational.denominator` positive.
sv: Värdena :attr:`~Rational.numerator` och :attr:`~Rational.denominator` ska vara instanser av :class:`Integral` och ska vara i lägsta termer med :attr:`~Rational.denominator` positiv.

source: Abstract.
sv: Sammanfattning.

source: Subtypes :class:`Rational` and adds a conversion to :class:`int`. Provides defaults for :func:`float`, :attr:`~Rational.numerator`, and :attr:`~Rational.denominator`. Adds abstract methods for :func:`pow` with modulus and bit-string operations: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.
sv: Subtyp av :class:`Rational` och lägger till en konvertering till :class:`int`. Tillhandahåller standardvärden för :func:`float`, :attr:`~Rational.numerator` och :attr:`~Rational.denominator`. Lägger till abstrakta metoder för :func:`pow` med modulus- och bitsträngsoperationer: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.

source: Notes for type implementers
sv: Anmärkningar för typimplementerare

source: Implementers should be careful to make equal numbers equal and hash them to the same values. This may be subtle if there are two different extensions of the real numbers. For example, :class:`fractions.Fraction` implements :func:`hash` as follows::
sv: Implementatörer bör vara noga med att göra lika tal lika och hasha dem till samma värden. Detta kan vara subtilt om det finns två olika utvidgningar av de reella talen. Till exempel :class:`fractions.Fraction` implementerar :func:`hash` enligt följande::

source: def __hash__(self): if self.denominator == 1: # Get integers right. return hash(self.numerator) # Expensive check, but definitely correct. if self == float(self): return hash(float(self)) else: # Use tuple's hash to avoid a high collision rate on # simple fractions. return hash((self.numerator, self.denominator))
sv: def __hash__(self): if self.denominator == 1: # Gör heltal rätt. return hash(self.numerator) # Dyr kontroll, men definitivt korrekt. om self == float(self): returnera hash(float(self)) else: # Använd tupels hash för att undvika en hög kollisionsfrekvens på # enkla fraktioner. return hash((self.numerator, self.denominator))

source: Adding More Numeric ABCs
sv: Lägga till fler numeriska ABC

source: There are, of course, more possible ABCs for numbers, and this would be a poor hierarchy if it precluded the possibility of adding those. You can add ``MyFoo`` between :class:`Complex` and :class:`Real` with::
sv: Det finns naturligtvis fler möjliga ABC för tal, och detta skulle vara en dålig hierarki om den uteslöt möjligheten att lägga till dessa. Du kan lägga till ``MyFoo`` mellan :class:`Complex` och :class:`Real` med::

source: class MyFoo(Complex): ... MyFoo.register(Real)
sv: klass MyFoo(Komplex): ... MyFoo.register(Real)

source: Implementing the arithmetic operations
sv: Implementering av aritmetiska operationer

source: We want to implement the arithmetic operations so that mixed-mode operations either call an implementation whose author knew about the types of both arguments, or convert both to the nearest built in type and do the operation there. For subtypes of :class:`Integral`, this means that :meth:`~object.__add__` and :meth:`~object.__radd__` should be defined as::
sv: Vi vill implementera de aritmetiska operationerna så att operationer i blandade lägen antingen anropar en implementation vars författare kände till typerna för båda argumenten, eller konverterar båda till närmaste inbyggda typ och utför operationen där. För subtyper av :class:`Integral` innebär detta att :meth:`~object.__add__` och :meth:`~object.__radd__` bör definieras som::

source: class MyIntegral(Integral): def __add__(self, other): if isinstance(other, MyIntegral): return do_my_adding_stuff(self, other) elif isinstance(other, OtherTypeIKnowAbout): return do_my_other_adding_stuff(self, other) else: return NotImplemented def __radd__(self, other): if isinstance(other, MyIntegral): return do_my_adding_stuff(other, self) elif isinstance(other, OtherTypeIKnowAbout): return do_my_other_adding_stuff(other, self) elif isinstance(other, Integral): return int(other) + int(self) elif isinstance(other, Real): return float(other) + float(self) elif isinstance(other, Complex): return complex(other) + complex(self) else: return NotImplemented
sv: klass MyIntegral(Integral): def __add__(self, other): if isinstance(other, MyIntegral): return do_my_adding_stuff(self, other) elif isinstance(other, OtherTypeIKnowAbout): return do_my_other_adding_stuff(self, other) else: return Inte implementerad def __radd__(self, other): if isinstance(other, MyIntegral): return do_my_adding_stuff(other, self) elif isinstance(other, OtherTypeIKnowAbout): return do_my_other_adding_stuff(other, self) elif isinstance(other, Integral): return int(other) + int(self) elif isinstance(other, Real): return float(other) + float(self) elif isinstance(other, Complex): return komplex(annan) + komplex(själv) else: return Ej implementerad

source: There are 5 different cases for a mixed-type operation on subclasses of :class:`Complex`. I'll refer to all of the above code that doesn't refer to ``MyIntegral`` and ``OtherTypeIKnowAbout`` as "boilerplate". ``a`` will be an instance of ``A``, which is a subtype of :class:`Complex` (``a : A <: Complex``), and ``b : B <: Complex``. I'll consider ``a + b``:
sv: Det finns 5 olika fall för en mixed-type operation på subklasser av :class:`Complex`. Jag kommer att referera till all ovanstående kod som inte refererar till ``MyIntegral`` och ``OtherTypeIKnowAbout`` som "boilerplate". ``a`` kommer att vara en instans av ``A``, som är en subtyp av :class:`Complex` (``a : A <: Complex``), och ``b : B <: Complex``. Jag kommer att överväga ``a + b``:

source: If ``A`` defines an :meth:`~object.__add__` which accepts ``b``, all is well.
sv: Om ``A`` definierar en :meth:`~object.__add__` som accepterar ``b``, är allt väl.

source: If ``A`` falls back to the boilerplate code, and it were to return a value from :meth:`~object.__add__`, we'd miss the possibility that ``B`` defines a more intelligent :meth:`~object.__radd__`, so the boilerplate should return :data:`NotImplemented` from :meth:`!__add__`. (Or ``A`` may not implement :meth:`!__add__` at all.)
sv: Om ``A`` faller tillbaka till boilerplate koden, och det skulle returnera ett värde från :meth:`~object.__add__`, skulle vi missa möjligheten att ``B`` definierar en mer intelligent :meth:`~object.__radd__`, så boilerplate bör returnera :data:`NotImplemented` från :meth:`!__add__`. (Eller så kanske ``A`` inte implementerar :meth:`!__add__`` alls.)

source: Then ``B``'s :meth:`~object.__radd__` gets a chance. If it accepts ``a``, all is well.
sv: Då får ``B``:s :meth:`~object.__radd__` en chans. Om den accepterar ``a`` är allt bra.

source: If it falls back to the boilerplate, there are no more possible methods to try, so this is where the default implementation should live.
sv: Om den faller tillbaka på standardutformningen finns det inga fler möjliga metoder att prova, så det är här standardimplementeringen ska finnas.

source: If ``B <: A``, Python tries ``B.__radd__`` before ``A.__add__``. This is ok, because it was implemented with knowledge of ``A``, so it can handle those instances before delegating to :class:`Complex`.
sv: Om ``B <: A``, försöker Python ``B.__radd__`` före ``A.__add__``. Detta är ok, eftersom det implementerades med kunskap om ``A``, så det kan hantera dessa instanser innan det delegeras till :class:`Complex``.

source: If ``A <: Complex`` and ``B <: Real`` without sharing any other knowledge, then the appropriate shared operation is the one involving the built in :class:`complex`, and both :meth:`~object.__radd__` s land there, so ``a+b == b+a``.
sv: Om ``A <: Complex`` och ``B <: Real`` utan att dela någon annan kunskap, så är den lämpliga delade operationen den som involverar den inbyggda :class:`complex``, och båda :meth:`~object.__radd__`` landar där, så ``a+b == b+a``.

source: Because most of the operations on any given type will be very similar, it can be useful to define a helper function which generates the forward and reverse instances of any given operator. For example, :class:`fractions.Fraction` uses::
sv: Eftersom de flesta operationer på en viss typ kommer att vara mycket lika kan det vara användbart att definiera en hjälpfunktion som genererar de framåtriktade och bakåtriktade instanserna av en viss operator. Till exempel använder :class:`fractions.Fraction`::

source: def _operator_fallbacks(monomorphic_operator, fallback_operator): def forward(a, b): if isinstance(b, (int, Fraction)): return monomorphic_operator(a, b) elif isinstance(b, float): return fallback_operator(float(a), b) elif isinstance(b, complex): return fallback_operator(complex(a), b) else: return NotImplemented forward.__name__ = '__' + fallback_operator.__name__ + '__' forward.__doc__ = monomorphic_operator.__doc__ def reverse(b, a): if isinstance(a, Rational): # Includes ints. return monomorphic_operator(a, b) elif isinstance(a, Real): return fallback_operator(float(a), float(b)) elif isinstance(a, Complex): return fallback_operator(complex(a), complex(b)) else: return NotImplemented reverse.__name__ = '__r' + fallback_operator.__name__ + '__' reverse.__doc__ = monomorphic_operator.__doc__ return forward, reverse def _add(a, b): """a + b""" return Fraction(a.numerator * b.denominator + b.numerator * a.denominator, a.denominator * b.denominator) __add__, __radd__ = _operator_fallbacks(_add, operator.add) # ...
sv: def _operator_fallbacks(monomorf_operator, fallback_operator): def forward(a, b): if isinstance(b, (int, Fraktion)): return monomorfisk_operator(a, b) elif isinstance(b, float): return fallback_operator(float(a), b) elif isinstance(b, komplex): return fallback_operator(komplex(a), b) else: return Ej implementerad forward.__name__ = '__' + fallback_operator.__name__ + '__' forward.__doc__ = monomorphic_operator.__doc__ def reverse(b, a): if isinstance(a, Rational): # Inkluderar ints. return monomorfisk_operator(a, b) elif isinstance(a, Real): return fallback_operator(float(a), float(b)) elif isinstance(a, Komplex): return fallback_operator(komplex(a), komplex(b)) else: return Inte implementerad reverse.__name__ = '__r' + fallback_operator.__name__ + '__' reverse.__doc__ = monomorphic_operator.__doc__ returnera framåt, bakåt def _add(a, b): """a + b""" return Fraktion(a.täljare * b.nämnare + b.täljare * a.nämnare b.täljare * a.nämnare, a.nämnare * b.nämnare) __add__, __radd__ = _operator_fallbacks(_add, operator.add) # ...
