Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: :mod:`!os` --- Miscellaneous operating system interfaces
sv: :mod:`!os` --- Diverse gränssnitt för operativsystem

source: **Source code:** :source:`Lib/os.py`
sv: **Källkod:** :source:`Lib/os.py`

source: This module provides a portable way of using operating system dependent functionality. If you just want to read or write a file see :func:`open`, if you want to manipulate paths, see the :mod:`os.path` module, and if you want to read all the lines in all the files on the command line see the :mod:`fileinput` module. For creating temporary files and directories see the :mod:`tempfile` module, and for high-level file and directory handling see the :mod:`shutil` module.
sv: Denna modul ger ett portabelt sätt att använda operativsystemberoende funktionalitet. Om du bara vill läsa eller skriva en fil, se :func:`open`, om du vill manipulera sökvägar, se :mod:`os.path`-modulen, och om du vill läsa alla rader i alla filer på kommandoraden, se :mod:`fileinput`-modulen. För att skapa temporära filer och kataloger, se modulen :mod:`tempfile`, och för fil- och kataloghantering på hög nivå, se modulen :mod:`shutil`.

source: Notes on the availability of these functions:
sv: Anteckningar om tillgängligheten för dessa funktioner:

source: The design of all built-in operating system dependent modules of Python is such that as long as the same functionality is available, it uses the same interface; for example, the function ``os.stat(path)`` returns stat information about *path* in the same format (which happens to have originated with the POSIX interface).
sv: Utformningen av alla inbyggda operativsystemberoende moduler i Python är sådan att så länge samma funktionalitet finns tillgänglig använder den samma gränssnitt; till exempel returnerar funktionen ``os.stat(path)`` statinformation om *path* i samma format (som råkar ha sitt ursprung i POSIX-gränssnittet).

source: Extensions peculiar to a particular operating system are also available through the :mod:`os` module, but using them is of course a threat to portability.
sv: Tillägg som är specifika för ett visst operativsystem är också tillgängliga via modulen :mod:`os`, men att använda dem är naturligtvis ett hot mot portabiliteten.

source: All functions accepting path or file names accept both bytes and string objects, and result in an object of the same type, if a path or file name is returned.
sv: Alla funktioner som accepterar sökvägar eller filnamn accepterar både bytes och strängobjekt, och resulterar i ett objekt av samma typ om en sökväg eller ett filnamn returneras.

source: On VxWorks, os.popen, os.fork, os.execv and os.spawn*p* are not supported.
sv: På VxWorks stöds inte os.popen, os.fork, os.execv och os.spawn*p*.

source: On WebAssembly platforms, Android and iOS, large parts of the :mod:`os` module are not available or behave differently. APIs related to processes (e.g. :func:`~os.fork`, :func:`~os.execve`) and resources (e.g. :func:`~os.nice`) are not available. Others like :func:`~os.getuid` and :func:`~os.getpid` are emulated or stubs. WebAssembly platforms also lack support for signals (e.g. :func:`~os.kill`, :func:`~os.wait`).
sv: På WebAssembly-plattformar, Android och iOS, är stora delar av modulen :mod:`os` inte tillgängliga eller beter sig annorlunda. API:er relaterade till processer (t.ex. :func:`~os.fork`, :func:`~os.execve`) och resurser (t.ex. :func:`~os.nice`) är inte tillgängliga. Andra som :func:`~os.getuid` och :func:`~os.getpid` är emulerade eller stubbar. WebAssembly-plattformar saknar också stöd för signaler (t.ex. :func:`~os.kill`, :func:`~os.wait`).

source: All functions in this module raise :exc:`OSError` (or subclasses thereof) in the case of invalid or inaccessible file names and paths, or other arguments that have the correct type, but are not accepted by the operating system.
sv: Alla funktioner i den här modulen ger upphov till :exc:`OSError` (eller underklasser till dessa) om filnamn och sökvägar är ogiltiga eller otillgängliga, eller om andra argument av rätt typ inte accepteras av operativsystemet.

source: An alias for the built-in :exc:`OSError` exception.
sv: Ett alias för det inbyggda undantaget :exc:`OSError`.

source: The name of the operating system dependent module imported. The following names have currently been registered: ``'posix'``, ``'nt'``, ``'java'``.
sv: Namnet på den operativsystemberoende modul som importeras. Följande namn har för närvarande registrerats: ``'posix'``, ``'nt'``, ``'java'``.

source: :data:`sys.platform` has a finer granularity. :func:`os.uname` gives system-dependent version information.
sv: :data:`sys.platform` har en finare granularitet. :func:`os.uname` ger systemberoende versionsinformation.

source: The :mod:`platform` module provides detailed checks for the system's identity.
sv: Modulen :mod:`platform` ger detaljerade kontroller av systemets identitet.

source: File Names, Command Line Arguments, and Environment Variables
sv: Filnamn, kommandoradsargument och miljövariabler

source: In Python, file names, command line arguments, and environment variables are represented using the string type. On some systems, decoding these strings to and from bytes is necessary before passing them to the operating system. Python uses the :term:`filesystem encoding and error handler` to perform this conversion (see :func:`sys.getfilesystemencoding`).
sv: I Python representeras filnamn, kommandoradsargument och miljövariabler med hjälp av strängtypen. På vissa system är det nödvändigt att avkoda dessa strängar till och från bytes innan de skickas till operativsystemet. Python använder :term:`filsystem encoding and error handler` för att utföra denna konvertering (se :func:`sys.getfilesystemencoding`).

source: The :term:`filesystem encoding and error handler` are configured at Python startup by the :c:func:`PyConfig_Read` function: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
sv: :term:`filsystemets kodning och felhantering` konfigureras vid Python-start av funktionen :c:func:`PyConfig_Read`: se :c:member:`~PyConfig.filesystem_encoding` och :c:member:`~PyConfig.filesystem_errors` i :c:type:`PyConfig`.

source: On some systems, conversion using the file system encoding may fail. In this case, Python uses the :ref:`surrogateescape encoding error handler <surrogateescape>`, which means that undecodable bytes are replaced by a Unicode character U+DC\ *xx* on decoding, and these are again translated to the original byte on encoding.
sv: På vissa system kan konvertering med hjälp av filsystemets kodning misslyckas. I detta fall använder Python :ref:`surrogateescape encoding error handler <surrogateescape>`, vilket innebär att oavkodbara byte ersätts med ett Unicode-tecken U+DC\ *xx* vid avkodning, och dessa översätts igen till den ursprungliga byten vid kodning.

source: The :term:`file system encoding <filesystem encoding and error handler>` must guarantee to successfully decode all bytes below 128. If the file system encoding fails to provide this guarantee, API functions can raise :exc:`UnicodeError`.
sv: Den :term:``filsystemkodning <filesystem encoding and error handler>`` måste garantera att alla byte under 128 avkodas framgångsrikt. Om filsystemets kodning inte kan ge denna garanti kan API-funktioner ge upphov till :exc:`UnicodeError`.

source: See also the :term:`locale encoding`.
sv: Se även :term:`locale encoding`.

source: Python UTF-8 Mode
sv: Python UTF-8-läge

source: See :pep:`540` for more details.
sv: Se :pep:`540` för mer information.

source: The Python UTF-8 Mode ignores the :term:`locale encoding` and forces the usage of the UTF-8 encoding:
sv: Pythons UTF-8-läge ignorerar :term:`locale encoding` och tvingar fram användning av UTF-8-kodning:

source: Use UTF-8 as the :term:`filesystem encoding <filesystem encoding and error handler>`.
sv: Använd UTF-8 som :term:`filsystemkodning <filesystem encoding and error handler>`.

source: :func:`sys.getfilesystemencoding` returns ``'utf-8'``.
sv: :func:`sys.getfilesystemencoding` returnerar ``'utf-8'``.

source: :func:`locale.getpreferredencoding` returns ``'utf-8'`` (the *do_setlocale* argument has no effect).
sv: :func:`locale.getpreferredencoding` returnerar ``'utf-8'`` (argumentet *do_setlocale* har ingen effekt).

source: :data:`sys.stdin`, :data:`sys.stdout`, and :data:`sys.stderr` all use UTF-8 as their text encoding, with the ``surrogateescape`` :ref:`error handler <error-handlers>` being enabled for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in the default locale-aware mode)
sv: :data:`sys.stdin`, :data:`sys.stdout` och :data:`sys.stderr` använder alla UTF-8 som textkodning, med ``surrogateescape`` :ref:`error handler <error-handlers>` aktiverat för :data:`sys.stdin` och :data:`sys.stdout` (:data:`sys.stderr` fortsätter att använda ``backslashreplace`` som det gör i standardläget för locale-aware)

source: On Unix, :func:`os.device_encoding` returns ``'utf-8'`` rather than the device encoding.
sv: På Unix returnerar :func:`os.device_encoding` ``'utf-8'`` i stället för enhetens kodning.

source: Note that the standard stream settings in UTF-8 mode can be overridden by :envvar:`PYTHONIOENCODING` (just as they can be in the default locale-aware mode).
sv: Observera att standardinställningarna för strömmar i UTF-8-läge kan åsidosättas med :envvar:`PYTHONIOENCODING` (precis som de kan i standardläget för lokalmedvetenhet).

source: As a consequence of the changes in those lower level APIs, other higher level APIs also exhibit different default behaviours:
sv: Som en följd av förändringarna i dessa API:er på lägre nivå uppvisar även andra API:er på högre nivå olika standardbeteenden:

source: Command line arguments, environment variables and filenames are decoded to text using the UTF-8 encoding.
sv: Argument på kommandoraden, miljövariabler och filnamn avkodas till text med UTF-8-kodning.

source: :func:`os.fsdecode` and :func:`os.fsencode` use the UTF-8 encoding.
sv: :func:`os.fsdecode` och :func:`os.fsencode` använder UTF-8-kodning.

source: :func:`open`, :func:`io.open`, and :func:`codecs.open` use the UTF-8 encoding by default. However, they still use the strict error handler by default so that attempting to open a binary file in text mode is likely to raise an exception rather than producing nonsense data.
sv: :func:`open`, :func:`io.open` och :func:`codecs.open` använder UTF-8-kodning som standard. De använder dock fortfarande den strikta felhanteringen som standard så att försök att öppna en binär fil i textläge sannolikt kommer att leda till ett undantag snarare än att producera nonsensdata.

source: The :ref:`Python UTF-8 Mode <utf8-mode>` is enabled if the LC_CTYPE locale is ``C`` or ``POSIX`` at Python startup (see the :c:func:`PyConfig_Read` function).
sv: Funktionen :ref:`Python UTF-8 Mode <utf8-mode>` aktiveras om LC_CTYPE locale är ``C`` eller ``POSIX`` vid Python-start (se funktionen :c:func:`PyConfig_Read`).

source: It can be enabled or disabled using the :option:`-X utf8 <-X>` command line option and the :envvar:`PYTHONUTF8` environment variable.
sv: Det kan aktiveras eller inaktiveras med hjälp av kommandoradsoptionen :option:`-X utf8 <-X>` och miljövariabeln :envvar:`PYTHONUTF8`.

source: If the :envvar:`PYTHONUTF8` environment variable is not set at all, then the interpreter defaults to using the current locale settings, *unless* the current locale is identified as a legacy ASCII-based locale (as described for :envvar:`PYTHONCOERCECLOCALE`), and locale coercion is either disabled or fails. In such legacy locales, the interpreter will default to enabling UTF-8 mode unless explicitly instructed not to do so.
sv: Om miljövariabeln :envvar:`PYTHONUTF8` inte anges alls, använder tolken som standard de aktuella locale-inställningarna, *såvida inte* den aktuella locale identifieras som en äldre ASCII-baserad locale (enligt beskrivningen för :envvar:`PYTHONCOERCECLOCALE`), och locale-coercion antingen är inaktiverat eller misslyckas. I sådana äldre lokalspråk kommer tolken att aktivera UTF-8-läge som standard, om den inte uttryckligen instrueras att inte göra det.

source: The Python UTF-8 Mode can only be enabled at the Python startup. Its value can be read from :data:`sys.flags.utf8_mode <sys.flags>`.
sv: Pythons UTF-8-läge kan endast aktiveras vid Python-start. Dess värde kan läsas från :data:`sys.flags.utf8_mode <sys.flags>`.

source: See also the :ref:`UTF-8 mode on Windows <win-utf8-mode>` and the :term:`filesystem encoding and error handler`.
sv: Se även :ref:`UTF-8-läge på Windows <win-utf8-mode>` och :term:`filsystemkodning och felhantering`.

source: Python 3.15 will make :ref:`utf8-mode` default.
sv: Python 3.15 kommer att göra :ref:`utf8-mode` till standard.

source: Process Parameters
sv: Processparametrar

source: These functions and data items provide information and operate on the current process and user.
sv: Dessa funktioner och dataelement ger information och fungerar på den aktuella processen och användaren.

source: Return the filename corresponding to the controlling terminal of the process.
sv: Returnerar filnamnet som motsvarar processens kontrollterminal.

source: Availability
sv: Tillgänglighet

source: A :term:`mapping` object where keys and values are strings that represent the process environment. For example, ``environ['HOME']`` is the pathname of your home directory (on some platforms), and is equivalent to ``getenv("HOME")`` in C.
sv: Ett :term:`mapping`-objekt där nycklar och värden är strängar som representerar processmiljön. Exempelvis är ``environ['HOME']`` sökvägen till din hemkatalog (på vissa plattformar) och motsvarar ``getenv("HOME")`` i C.

source: This mapping is captured the first time the :mod:`os` module is imported, typically during Python startup as part of processing :file:`site.py`. Changes to the environment made after this time are not reflected in :data:`os.environ`, except for changes made by modifying :data:`os.environ` directly.
sv: Denna mappning registreras första gången modulen :mod:`os` importeras, vanligtvis under Python-start som en del av bearbetningen av :file:`site.py`. Ändringar i miljön som görs efter denna tidpunkt återspeglas inte i :data:`os.environ`, med undantag för ändringar som görs genom att ändra :data:`os.environ` direkt.

source: This mapping may be used to modify the environment as well as query the environment. :func:`putenv` will be called automatically when the mapping is modified.
sv: Denna mappning kan användas för att ändra miljön samt för att fråga om miljön. :func:`putenv` anropas automatiskt när mappningen ändras.

source: On Unix, keys and values use :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :data:`environb` if you would like to use a different encoding.
sv: På Unix använder nycklar och värden :func:`sys.getfilesystemencoding` och felhanteraren ``'surrogateescape'``. Använd :data:`environb` om du vill använda en annan kodning.

source: On Windows, the keys are converted to uppercase. This also applies when getting, setting, or deleting an item. For example, ``environ['monty'] = 'python'`` maps the key ``'MONTY'`` to the value ``'python'``.
sv: I Windows konverteras tangenterna till versaler. Detta gäller även när du hämtar, ställer in eller tar bort ett objekt. Exempelvis mappar ``environ['monty'] = 'python'`` nyckeln ``'MONTY'`` till värdet ``'python'``.

source: Calling :func:`putenv` directly does not change :data:`os.environ`, so it's better to modify :data:`os.environ`.
sv: Att anropa :func:`putenv` direkt ändrar inte :data:`os.environ`, så det är bättre att ändra :data:`os.environ`.

source: On some platforms, including FreeBSD and macOS, setting ``environ`` may cause memory leaks. Refer to the system documentation for :c:func:`!putenv`.
sv: På vissa plattformar, inklusive FreeBSD och macOS, kan inställningen ``environ`` orsaka minnesläckage. Se systemdokumentationen för :c:func:`!putenv`.

source: You can delete items in this mapping to unset environment variables. :func:`unsetenv` will be called automatically when an item is deleted from :data:`os.environ`, and when one of the :meth:`pop` or :meth:`clear` methods is called.
sv: Du kan ta bort objekt i den här mappningen för att återställa miljövariabler. :func:`unsetenv` anropas automatiskt när ett objekt tas bort från :data:`os.environ` och när någon av metoderna :meth:`pop` eller :meth:`clear` anropas.

source: The :func:`os.reload_environ` function.
sv: Funktionen :func:`os.reload_environ`.

source: Updated to support :pep:`584`'s merge (``|``) and update (``|=``) operators.
sv: Uppdaterad för att stödja :pep:`584`:s operatorer för sammanslagning (``|``) och uppdatering (``|=``).

source: Bytes version of :data:`environ`: a :term:`mapping` object where both keys and values are :class:`bytes` objects representing the process environment. :data:`environ` and :data:`environb` are synchronized (modifying :data:`environb` updates :data:`environ`, and vice versa).
sv: Bytesversion av :data:`environ`: ett :term:`mapping`-objekt där både nycklar och värden är :class:`bytes`-objekt som representerar processmiljön. :data:`environ` och :data:`environb` är synkroniserade (om du ändrar :data:`environb` uppdateras :data:`environ` och vice versa).

source: :data:`environb` is only available if :const:`supports_bytes_environ` is ``True``.
sv: :data:`environb` är endast tillgängligt om :const:`supports_bytes_environ` är ``True``.

source: The :data:`os.environ` and :data:`os.environb` mappings are a cache of environment variables at the time that Python started. As such, changes to the current process environment are not reflected if made outside Python, or by :func:`os.putenv` or :func:`os.unsetenv`. Use :func:`!os.reload_environ` to update :data:`os.environ` and :data:`os.environb` with any such changes to the current process environment.
sv: Mappningarna :data:`os.environ` och :data:`os.environb` är en cache av miljövariabler vid den tidpunkt då Python startade. Därför återspeglas inte ändringar i den aktuella processmiljön om de görs utanför Python, eller av :func:`os.putenv` eller :func:`os.unsetenv`. Använd :func:`!os.reload_environ` för att uppdatera :data:`os.environ` och :data:`os.environb` med alla sådana ändringar i den aktuella processmiljön.

source: This function is not thread-safe. Calling it while the environment is being modified in an other thread is an undefined behavior. Reading from :data:`os.environ` or :data:`os.environb`, or calling :func:`os.getenv` while reloading, may return an empty result.
sv: Denna funktion är inte trådsäker. Att anropa den medan miljön modifieras i en annan tråd är ett odefinierat beteende. Läsning från :data:`os.environ` eller :data:`os.environb`, eller anrop av :func:`os.getenv` under omladdning, kan ge ett tomt resultat.

source: These functions are described in :ref:`os-file-dir`.
sv: Dessa funktioner beskrivs i :ref:`os-file-dir`.

source: Encode :term:`path-like <path-like object>` *filename* to the :term:`filesystem encoding and error handler`; return :class:`bytes` unchanged.
sv: Kodar :term:`path-liknande <path-like object>` *filnamn* till :term:`filsystemets kodning och felhantering`; returnerar :class:`bytes` oförändrad.

source: :func:`fsdecode` is the reverse function.
sv: :func:`fsdecode` är den omvända funktionen.

source: Support added to accept objects implementing the :class:`os.PathLike` interface.
sv: Stöd har lagts till för att acceptera objekt som implementerar gränssnittet :class:`os.PathLike`.

source: Decode the :term:`path-like <path-like object>` *filename* from the :term:`filesystem encoding and error handler`; return :class:`str` unchanged.
sv: Avkodar :term:`path-liknande <path-like object>` *filnamn* från :term:`filsystemets kodning och felhantering`; returnerar :class:`str` oförändrad.

source: :func:`fsencode` is the reverse function.
sv: :func:`fsencode` är den omvända funktionen.

source: Return the file system representation of the path.
sv: Returnerar filsystemets representation av sökvägen.

source: If :class:`str` or :class:`bytes` is passed in, it is returned unchanged. Otherwise :meth:`~os.PathLike.__fspath__` is called and its value is returned as long as it is a :class:`str` or :class:`bytes` object. In all other cases, :exc:`TypeError` is raised.
sv: Om :class:`str` eller :class:`bytes` skickas in returneras det oförändrat. Annars anropas :meth:`~os.PathLike.__fspath__` och dess värde returneras så länge det är ett :class:`str`- eller :class:`bytes`-objekt. I alla andra fall genereras :exc:`TypeError`.

source: An :term:`abstract base class` for objects representing a file system path, e.g. :class:`pathlib.PurePath`.
sv: En :term:`abstrakt basklass` för objekt som representerar en filsystemssökväg, t.ex. :class:`pathlib.PurePath`.

source: Return the file system path representation of the object.
sv: Returnerar filsystemets sökvägsrepresentation av objektet.

source: The method should only return a :class:`str` or :class:`bytes` object, with the preference being for :class:`str`.
sv: Metoden bör endast returnera ett :class:`str`- eller :class:`bytes`-objekt, med företräde för :class:`str`.

source: Return the value of the environment variable *key* as a string if it exists, or *default* if it doesn't. *key* is a string. Note that since :func:`getenv` uses :data:`os.environ`, the mapping of :func:`getenv` is similarly also captured on import, and the function may not reflect future environment changes.
sv: Returnerar värdet på miljövariabeln *key* som en sträng om den finns, eller *default* om den inte finns. *key* är en sträng. Observera att eftersom :func:`getenv` använder :data:`os.environ`, fångas mappningen av :func:`getenv` på samma sätt vid import, och funktionen kanske inte återspeglar framtida miljöförändringar.

source: On Unix, keys and values are decoded with :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :func:`os.getenvb` if you would like to use a different encoding.
sv: På Unix avkodas nycklar och värden med :func:`sys.getfilesystemencoding` och felhanteraren ``'surrogateescape'``. Använd :func:`os.getenvb` om du vill använda en annan kodning.

source: Return the value of the environment variable *key* as bytes if it exists, or *default* if it doesn't. *key* must be bytes. Note that since :func:`getenvb` uses :data:`os.environb`, the mapping of :func:`getenvb` is similarly also captured on import, and the function may not reflect future environment changes.
sv: Returnerar värdet på miljövariabeln *key* som bytes om den finns, eller *default* om den inte finns. *key* måste vara bytes. Observera att eftersom :func:`getenvb` använder :data:`os.environb`, fångas mappningen av :func:`getenvb` på samma sätt vid import, och funktionen kanske inte återspeglar framtida miljöförändringar.

source: :func:`getenvb` is only available if :const:`supports_bytes_environ` is ``True``.
sv: :func:`getenvb` är endast tillgängligt om :const:`supports_bytes_environ` är ``True``.

source: Returns the list of directories that will be searched for a named executable, similar to a shell, when launching a process. *env*, when specified, should be an environment variable dictionary to lookup the PATH in. By default, when *env* is ``None``, :data:`environ` is used.
sv: Returnerar listan över kataloger som kommer att sökas efter en namngiven körbar fil, liknande ett skal, när en process startas. *env*, när det anges, ska vara en miljövariabelordbok som PATH ska sökas i. Som standard, när *env* är ``None``, används :data:`environ`.
