Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: If *mode* is :const:`P_NOWAIT`, this function returns the process id of the new process; if *mode* is :const:`P_WAIT`, returns the process's exit code if it exits normally, or ``-signal``, where *signal* is the signal that killed the process. On Windows, the process id will actually be the process handle, so can be used with the :func:`waitpid` function.
sv: Om *mode* är :const:`P_NOWAIT`, returnerar denna funktion process-ID för den nya processen; om *mode* är :const:`P_WAIT`, returneras processens exitkod om den avslutas normalt, eller ``-signal``, där *signal* är den signal som dödade processen. I Windows är processens id faktiskt processens handtag, så det kan användas med funktionen :func:`waitpid`.

source: Note on VxWorks, this function doesn't return ``-signal`` when the new process is killed. Instead it raises OSError exception.
sv: Obs på VxWorks, denna funktion returnerar inte ``-signal`` när den nya processen dödas. Istället ger den upphov till ett OSError-undantag.

source: The "l" and "v" variants of the :func:`spawn\* <spawnl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`!spawnl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process must start with the name of the command being run.
sv: "l"- och "v"-varianterna av :func:`spawn\* <spawnl>`-funktionerna skiljer sig åt i hur kommandoradsargument skickas. "l"-varianterna är kanske lättast att arbeta med om antalet parametrar är fast när koden skrivs; de enskilda parametrarna blir helt enkelt ytterligare parametrar till :func:`!spawnl\*`-funktionerna. "v"-varianterna är bra när antalet parametrar är variabelt och argumenten skickas i en lista eller tupel som parametern *args*. I båda fallen måste argumenten till barnprocessen börja med namnet på det kommando som körs.

source: The variants which include a second "p" near the end (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, and :func:`spawnvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`spawn\*e <spawnl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`spawnl`, :func:`spawnle`, :func:`spawnv`, and :func:`spawnve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path.
sv: De varianter som innehåller ett andra "p" i slutet (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` och :func:`spawnvpe`) använder miljövariabeln :envvar:`PATH` för att hitta programmet *fil*. När miljön ersätts (med någon av :func:`spawn\*e <spawnl>`-varianterna, som diskuteras i nästa stycke), används den nya miljön som källa för variabeln :envvar:`PATH`. De andra varianterna, :func:`spawnl`, :func:`spawnle`, :func:`spawnv` och :func:`spawnve`, kommer inte att använda variabeln :envvar:`PATH` för att hitta den körbara filen; *path* måste innehålla en lämplig absolut eller relativ sökväg.

source: For :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve`, and :func:`spawnvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (they are used instead of the current process' environment); the functions :func:`spawnl`, :func:`spawnlp`, :func:`spawnv`, and :func:`spawnvp` all cause the new process to inherit the environment of the current process. Note that keys and values in the *env* dictionary must be strings; invalid keys or values will cause the function to fail, with a return value of ``127``.
sv: För :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve` och :func:`spawnvpe` (notera att alla dessa slutar på "e") måste parametern *env* vara en mappning som används för att definiera miljövariablerna för den nya processen (de används istället för den aktuella processens miljö); funktionerna :func:`spawnl`, :func:`spawnlp`, :func:`spawnv` och :func:`spawnvp` gör alla att den nya processen ärver den aktuella processens miljö. Observera att nycklar och värden i *env*-ordlistan måste vara strängar; ogiltiga nycklar eller värden leder till att funktionen misslyckas med ett returvärde på ``127``.

source: As an example, the following calls to :func:`spawnlp` and :func:`spawnvpe` are equivalent::
sv: Som exempel är följande anrop till :func:`spawnlp` och :func:`spawnvpe` likvärdiga::

source: Raises an :ref:`auditing event <auditing>` ``os.spawn`` with arguments ``mode``, ``path``, ``args``, ``env``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.spawn`` med argumenten ``mode``, ``path``, ``args``, ``env``.

source: :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` and :func:`spawnvpe` are not available on Windows. :func:`spawnle` and :func:`spawnve` are not thread-safe on Windows; we advise you to use the :mod:`subprocess` module instead.
sv: :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` och :func:`spawnvpe` är inte tillgängliga i Windows. :func:`spawnle` och :func:`spawnve` är inte tråd-säkra i Windows; vi rekommenderar att du använder modulen :mod:`subprocess` istället.

source: These functions are :term:`soft deprecated` and should no longer be used to write new code. The :mod:`subprocess` module is recommended instead.
sv: Dessa funktioner är :term:`soft deprecated` och bör inte längre användas för att skriva ny kod. Modulen :mod:`subprocess` rekommenderas istället.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If either of these values is given, the :func:`spawn\* <spawnl>` functions will return as soon as the new process has been created, with the process id as the return value.
sv: Möjliga värden för parametern *mode* för funktionerna i :func:`spawn\* <spawnl>`-familjen. Om något av dessa värden anges kommer funktionerna :func:`spawn\* <spawnl>` att returneras så snart den nya processen har skapats, med processens id som returvärde.

source: Possible value for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If this is given as *mode*, the :func:`spawn\* <spawnl>` functions will not return until the new process has run to completion and will return the exit code of the process the run is successful, or ``-signal`` if a signal kills the process.
sv: Möjligt värde för parametern *mode* till :func:`spawn\* <spawnl>`-familjen av funktioner. Om detta anges som *mode*, kommer funktionerna :func:`spawn\* <spawnl>` inte att återvända förrän den nya processen har körts färdigt och kommer att returnera processens utgångskod om körningen är lyckad, eller ``-signal`` om en signal dödar processen.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. These are less portable than those listed above. :const:`P_DETACH` is similar to :const:`P_NOWAIT`, but the new process is detached from the console of the calling process. If :const:`P_OVERLAY` is used, the current process will be replaced; the :func:`spawn\* <spawnl>` function will not return.
sv: Möjliga värden för parametern *mode* till :func:`spawn\* <spawnl>`-familjen av funktioner. Dessa är mindre portabla än de som listas ovan. :const:`P_DETACH` liknar :const:`P_NOWAIT`, men den nya processen kopplas loss från den anropande processens konsol. Om :const:`P_OVERLAY` används kommer den aktuella processen att ersättas; funktionen :func:`spawn\* <spawnl>` kommer inte att returneras.

source: Start a file with its associated application.
sv: Starta en fil med tillhörande applikation.

source: When *operation* is not specified, this acts like double-clicking the file in Windows Explorer, or giving the file name as an argument to the :program:`start` command from the interactive command shell: the file is opened with whatever application (if any) its extension is associated.
sv: Om *operation* inte anges fungerar detta som att dubbelklicka på filen i Utforskaren eller att ange filnamnet som argument till kommandot :program:`start` i det interaktiva kommandohöljet: filen öppnas med det program (om något) som är kopplat till filtillägget.

source: When another *operation* is given, it must be a "command verb" that specifies what should be done with the file. Common verbs documented by Microsoft are ``'open'``, ``'print'`` and ``'edit'`` (to be used on files) as well as ``'explore'`` and ``'find'`` (to be used on directories).
sv: När en annan *operation* anges måste det vara ett "kommandoverb" som anger vad som ska göras med filen. Vanliga verb som dokumenterats av Microsoft är ``'open'``, ``'print'`` och ``'edit'`` (som används för filer) samt ``'explore'`` och ``'find'`` (som används för kataloger).

source: When launching an application, specify *arguments* to be passed as a single string. This argument may have no effect when using this function to launch a document.
sv: När du startar en applikation ska du ange *argument* som ska skickas som en enda sträng. Detta argument kanske inte har någon effekt när funktionen används för att starta ett dokument.

source: The default working directory is inherited, but may be overridden by the *cwd* argument. This should be an absolute path. A relative *path* will be resolved against this argument.
sv: Standardarbetskatalogen ärvs, men kan åsidosättas med argumentet *cwd*. Detta bör vara en absolut sökväg. En relativ *sökväg* kommer att lösas mot detta argument.

source: Use *show_cmd* to override the default window style. Whether this has any effect will depend on the application being launched. Values are integers as supported by the Win32 :c:func:`!ShellExecute` function.
sv: Använd *show_cmd* för att åsidosätta standardfönsterstilen. Om detta har någon effekt beror på vilken applikation som startas. Värdena är heltal som stöds av Win32 :c:func:`!ShellExecute`-funktionen.

source: :func:`startfile` returns as soon as the associated application is launched. There is no option to wait for the application to close, and no way to retrieve the application's exit status. The *path* parameter is relative to the current directory or *cwd*. If you want to use an absolute path, make sure the first character is not a slash (``'/'``) Use :mod:`pathlib` or the :func:`os.path.normpath` function to ensure that paths are properly encoded for Win32.
sv: :func:`startfile` returneras så snart den associerade applikationen har startats. Det finns inget alternativ för att vänta på att programmet ska stängas och inget sätt att hämta programmets exitstatus. Parametern *path* är relativ i förhållande till den aktuella katalogen eller *cwd*. Om du vill använda en absolut sökväg måste du se till att det första tecknet inte är ett snedstreck (``'/'``) Använd :mod:`pathlib` eller funktionen :func:`os.path.normpath` för att säkerställa att sökvägarna är korrekt kodade för Win32.

source: To reduce interpreter startup overhead, the Win32 :c:func:`!ShellExecute` function is not resolved until this function is first called. If the function cannot be resolved, :exc:`NotImplementedError` will be raised.
sv: För att minska tolkens startkostnader löses inte Win32 :c:func:`!ShellExecute`-funktionen förrän denna funktion anropas första gången. Om funktionen inte kan lösas kommer :exc:`NotImplementedError` att anges.

source: Raises an :ref:`auditing event <auditing>` ``os.startfile`` with arguments ``path``, ``operation``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.startfile`` med argumenten ``path``, ``operation``.

source: Raises an :ref:`auditing event <auditing>` ``os.startfile/2`` with arguments ``path``, ``operation``, ``arguments``, ``cwd``, ``show_cmd``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.startfile/2`` med argumenten ``path``, ``operation``, ``arguments``, ``cwd``, ``show_cmd``.

source: Added the *arguments*, *cwd* and *show_cmd* arguments, and the ``os.startfile/2`` audit event.
sv: Lagt till argumenten *arguments*, *cwd* och *show_cmd* samt granskningshändelsen ``os.startfile/2``.

source: Execute the command (a string) in a subshell. This is implemented by calling the Standard C function :c:func:`system`, and has the same limitations. Changes to :data:`sys.stdin`, etc. are not reflected in the environment of the executed command. If *command* generates any output, it will be sent to the interpreter standard output stream. The C standard does not specify the meaning of the return value of the C function, so the return value of the Python function is system-dependent.
sv: Utför kommandot (en sträng) i ett underskal. Detta implementeras genom att anropa Standard C-funktionen :c:func:`system`, och har samma begränsningar. Ändringar i :data:`sys.stdin` etc. återspeglas inte i miljön för det exekverade kommandot. Om *command* genererar någon utdata kommer den att skickas till tolkens standardutdataflöde. C-standarden specificerar inte innebörden av returvärdet för C-funktionen, så returvärdet för Python-funktionen är systemberoende.

source: On Unix, the return value is the exit status of the process encoded in the format specified for :func:`wait`.
sv: På Unix är returvärdet processens utgångsstatus kodad i det format som anges för :func:`wait`.

source: On Windows, the return value is that returned by the system shell after running *command*. The shell is given by the Windows environment variable :envvar:`COMSPEC`: it is usually :program:`cmd.exe`, which returns the exit status of the command run; on systems using a non-native shell, consult your shell documentation.
sv: I Windows är returvärdet det som returneras av systemets skal efter att *kommando* har körts. Skalet anges av Windows-miljövariabeln :envvar:`COMSPEC`: det är vanligtvis :program:`cmd.exe`, som returnerar utgångsstatus för kommandot som körs; på system som använder ett icke inbyggt skal, se dokumentationen för ditt skal.

source: The :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is recommended to using this function. See the :ref:`subprocess-replacements` section in the :mod:`subprocess` documentation for some helpful recipes.
sv: Modulen :mod:`subprocess` ger mer kraftfulla möjligheter att starta nya processer och hämta deras resultat; det rekommenderas att använda den modulen innan du använder den här funktionen. Se avsnittet :ref:`subprocess-replacements` i :mod:`subprocess`-dokumentationen för några användbara recept.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the result (exit status) into an exit code. On Windows, the result is directly the exit code.
sv: På Unix kan :func:`waitstatus_to_exitcode` användas för att konvertera resultatet (exitstatus) till en exitkod. På Windows är resultatet direkt utgångskoden.

source: Raises an :ref:`auditing event <auditing>` ``os.system`` with argument ``command``.
sv: Utlöser en :ref:``auditing event <auditing>` ``os.system`` med argumentet ``command``.

source: Returns the current global process times. The return value is an object with five attributes:
sv: Returnerar de aktuella globala processtiderna. Returvärdet är ett objekt med fem attribut:

source: :attr:`!user` - user time
sv: :attr:`!user` - användarens tid

source: :attr:`!system` - system time
sv: :attr:`!system` - systemtid

source: :attr:`!children_user` - user time of all child processes
sv: :attr:`!children_user` - användartid för alla underordnade processer

source: :attr:`!children_system` - system time of all child processes
sv: :attr:`!children_system` - systemtid för alla underordnade processer

source: :attr:`!elapsed` - elapsed real time since a fixed point in the past
sv: :attr:`!elapsed` - förfluten realtid sedan en bestämd tidpunkt i det förflutna

source: For backwards compatibility, this object also behaves like a five-tuple containing :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system`, and :attr:`!elapsed` in that order.
sv: För bakåtkompatibilitet fungerar detta objekt också som en femtupel som innehåller :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system` och :attr:`!elapsed` i den ordningen.

source: See the Unix manual page :manpage:`times(2)` and `times(3) <https://man.freebsd.org/cgi/man.cgi?time(3)>`_ manual page on Unix or `the GetProcessTimes MSDN <https://docs.microsoft.com/windows/win32/api/processthreadsapi/nf-processthreadsapi-getprocesstimes>`_ on Windows. On Windows, only :attr:`!user` and :attr:`!system` are known; the other attributes are zero.
sv: Se manualsidan för Unix :manpage:`times(2)` och `times(3) <https://man.freebsd.org/cgi/man.cgi?time(3)>`_ på Unix eller `the GetProcessTimes MSDN <https://docs.microsoft.com/windows/win32/api/processthreadsapi/nf-processthreadsapi-getprocesstimes>`_ på Windows. På Windows är endast :attr:`!user` och :attr:`!system` kända; de andra attributen är noll.

source: Wait for completion of a child process, and return a tuple containing its pid and exit status indication: a 16-bit number, whose low byte is the signal number that killed the process, and whose high byte is the exit status (if the signal number is zero); the high bit of the low byte is set if a core file was produced.
sv: Vänta på att en underordnad process ska avslutas och returnera en tupel som innehåller dess pid- och utgångsstatusindikation: ett 16-bitars tal, vars låga byte är signalnumret som dödade processen och vars höga byte är utgångsstatusen (om signalnumret är noll); den höga biten i den låga byten sätts om en kärnfil producerades.

source: If there are no children that could be waited for, :exc:`ChildProcessError` is raised.
sv: Om det inte finns några barn som kan väntas på, uppstår :exc:`ChildProcessError`.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
sv: :func:`waitstatus_to_exitcode` kan användas för att konvertera utgångsstatus till en utgångskod.

source: The other :func:`!wait*` functions documented below can be used to wait for the completion of a specific child process and have more options. :func:`waitpid` is the only one also available on Windows.
sv: De andra :func:`!wait*`-funktionerna som dokumenteras nedan kan användas för att vänta på att en specifik underordnad process ska slutföras och har fler alternativ. :func:`waitpid` är den enda som också finns tillgänglig i Windows.

source: Wait for the completion of a child process.
sv: Vänta på att en underordnad process ska slutföras.

source: *idtype* can be :data:`P_PID`, :data:`P_PGID`, :data:`P_ALL`, or (on Linux) :data:`P_PIDFD`. The interpretation of *id* depends on it; see their individual descriptions.
sv: *idtype* kan vara :data:`P_PID`, :data:`P_PGID`, :data:`P_ALL` eller (på Linux) :data:`P_PIDFD`. Tolkningen av *id* beror på detta; se deras individuella beskrivningar.

source: *options* is an OR combination of flags. At least one of :data:`WEXITED`, :data:`WSTOPPED` or :data:`WCONTINUED` is required; :data:`WNOHANG` and :data:`WNOWAIT` are additional optional flags.
sv: *options* är en ELLER-kombination av flaggor. Minst en av :data:`WEXITED`, :data:`WSTOPPED` eller :data:`WCONTINUED` krävs; :data:`WNOHANG` och :data:`WNOWAIT` är ytterligare valfria flaggor.

source: The return value is an object representing the data contained in the :c:type:`siginfo_t` structure with the following attributes:
sv: Returvärdet är ett objekt som representerar de data som finns i strukturen :c:type:`siginfo_t` med följande attribut:

source: :attr:`!si_uid` (real user ID of the child)
sv: :attr:`!si_uid` (barnets verkliga användar-ID)

source: :attr:`!si_signo` (always :const:`~signal.SIGCHLD`)
sv: :attr:`!si_signo` (alltid :const:`~signal.SIGCHLD`)

source: :attr:`!si_status` (the exit status or signal number, depending on :attr:`!si_code`)
sv: :attr:`!si_status` (utgångsstatus eller signalnummer, beroende på :attr:`!si_code`)

source: :attr:`!si_code` (see :data:`CLD_EXITED` for possible values)
sv: :attr:`!si_code` (se :data:`CLD_EXITED` för möjliga värden)

source: If :data:`WNOHANG` is specified and there are no matching children in the requested state, ``None`` is returned. Otherwise, if there are no matching children that could be waited for, :exc:`ChildProcessError` is raised.
sv: Om :data:`WNOHANG` anges och det inte finns några matchande barn i det begärda tillståndet, returneras ``None``. Annars, om det inte finns några matchande barn som kan väntas på, :exc:`ChildProcessError`.

source: This function is now available on macOS as well.
sv: Den här funktionen är nu tillgänglig även på macOS.

source: The details of this function differ on Unix and Windows.
sv: Detaljerna för denna funktion skiljer sig åt mellan Unix och Windows.

source: On Unix: Wait for completion of a child process given by process id *pid*, and return a tuple containing its process id and exit status indication (encoded as for :func:`wait`). The semantics of the call are affected by the value of the integer *options*, which should be ``0`` for normal operation.
sv: På Unix: Vänta på att en underordnad process som anges med process-ID *pid* ska avslutas och returnera en tupel som innehåller dess process-ID och uppgift om avslutningsstatus (kodad som för :func:`wait`). Semantiken i anropet påverkas av värdet på heltalet *options*, som bör vara ``0`` för normal drift.

source: If *pid* is greater than ``0``, :func:`waitpid` requests status information for that specific process. If *pid* is ``0``, the request is for the status of any child in the process group of the current process. If *pid* is ``-1``, the request pertains to any child of the current process. If *pid* is less than ``-1``, status is requested for any process in the process group ``-pid`` (the absolute value of *pid*).
sv: Om *pid* är större än ``0``, begär :func:`waitpid` statusinformation för den specifika processen. Om *pid* är ``0``, begärs status för alla underordnade i processgruppen för den aktuella processen. Om *pid* är ``-1`` gäller begäran alla barn till den aktuella processen. Om *pid* är mindre än ``-1`` begärs status för alla processer i processgruppen ``-pid`` (det absoluta värdet av *pid*).

source: *options* is an OR combination of flags. If it contains :data:`WNOHANG` and there are no matching children in the requested state, ``(0, 0)`` is returned. Otherwise, if there are no matching children that could be waited for, :exc:`ChildProcessError` is raised. Other options that can be used are :data:`WUNTRACED` and :data:`WCONTINUED`.
sv: *options* är en ELLER-kombination av flaggor. Om den innehåller :data:`WNOHANG` och det inte finns några matchande barn i det begärda tillståndet returneras ``(0, 0)``. Annars, om det inte finns några matchande barn som kan väntas på, :exc:`ChildProcessError`. Andra alternativ som kan användas är :data:`WUNTRACED` och :data:`WCONTINUED`.
