Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: :func:`shutil.get_terminal_size` is the high-level function which should normally be used, ``os.get_terminal_size`` is the low-level implementation.
sv: :func:`shutil.get_terminal_size` är den högnivåfunktion som normalt bör användas, `os.get_terminal_size` är lågnivåimplementeringen.

source: A subclass of tuple, holding ``(columns, lines)`` of the terminal window size.
sv: En subklass av tuple, som innehåller ``(kolumner, rader)`` av terminalfönstrets storlek.

source: Width of the terminal window in characters.
sv: Terminalfönstrets bredd i tecken.

source: Height of the terminal window in characters.
sv: Terminalfönstrets höjd i tecken.

source: Inheritance of File Descriptors
sv: Arv av filbeskrivare

source: A file descriptor has an "inheritable" flag which indicates if the file descriptor can be inherited by child processes. Since Python 3.4, file descriptors created by Python are non-inheritable by default.
sv: En filbeskrivning har en flagga "inheritable" som anger om filbeskrivningen kan ärvas av underordnade processer. Sedan Python 3.4 är filbeskrivare som skapats av Python inte ärftliga som standard.

source: On UNIX, non-inheritable file descriptors are closed in child processes at the execution of a new program, other file descriptors are inherited.
sv: På UNIX stängs icke-ärftliga fildeskriptorer i barnprocesser när ett nytt program körs, andra fildeskriptorer ärvs.

source: On Windows, non-inheritable handles and file descriptors are closed in child processes, except for standard streams (file descriptors 0, 1 and 2: stdin, stdout and stderr), which are always inherited. Using :func:`spawn\* <spawnl>` functions, all inheritable handles and all inheritable file descriptors are inherited. Using the :mod:`subprocess` module, all file descriptors except standard streams are closed, and inheritable handles are only inherited if the *close_fds* parameter is ``False``.
sv: I Windows stängs icke-ärftliga handtag och filbeskrivare i underordnade processer, med undantag för standardströmmar (filbeskrivare 0, 1 och 2: stdin, stdout och stderr), som alltid ärvs. Om du använder funktionerna :func:`spawn\* <spawnl>` ärvs alla ärftliga handtag och alla ärftliga filbeskrivare. Med modulen :mod:`subprocess` stängs alla filbeskrivare utom standardströmmar, och ärftliga handtag ärvs endast om parametern *close_fds* är ``False``.

source: On WebAssembly platforms, the file descriptor cannot be modified.
sv: På WebAssembly-plattformar kan fildeskriptorn inte ändras.

source: Get the "inheritable" flag of the specified file descriptor (a boolean).
sv: Hämta flaggan "inheritable" för den angivna filbeskrivaren (en boolean).

source: Set the "inheritable" flag of the specified file descriptor.
sv: Ställ in flaggan "inheritable" för den angivna filbeskrivaren.

source: Get the "inheritable" flag of the specified handle (a boolean).
sv: Hämta flaggan "inheritable" för det angivna handtaget (en boolean).

source: Set the "inheritable" flag of the specified handle.
sv: Ställ in flaggan "inheritable" för det angivna handtaget.

source: Files and Directories
sv: Filer och kataloger

source: On some Unix platforms, many of these functions support one or more of these features:
sv: På vissa Unix-plattformar har många av dessa funktioner stöd för en eller flera av dessa funktioner:

source: **specifying a file descriptor:** Normally the *path* argument provided to functions in the :mod:`os` module must be a string specifying a file path. However, some functions now alternatively accept an open file descriptor for their *path* argument. The function will then operate on the file referred to by the descriptor. (For POSIX systems, Python will call the variant of the function prefixed with ``f`` (e.g. call ``fchdir`` instead of ``chdir``).)
sv: **specificering av en filbeskrivning:** Normalt måste argumentet *path* för funktioner i modulen :mod:`os` vara en sträng som anger en filsökväg. Vissa funktioner accepterar dock nu alternativt en öppen filbeskrivning för sitt *path*-argument. Funktionen kommer då att arbeta med den fil som deskriptorn hänvisar till. (För POSIX-system kommer Python att anropa den variant av funktionen som har prefixet ``f`` (t.ex. anropa ``fchdir`` istället för ``chdir``))

source: You can check whether or not *path* can be specified as a file descriptor for a particular function on your platform using :data:`os.supports_fd`. If this functionality is unavailable, using it will raise a :exc:`NotImplementedError`.
sv: Du kan kontrollera om *path* kan anges som en filbeskrivare för en viss funktion på din plattform med hjälp av :data:`os.supports_fd`. Om den här funktionen inte är tillgänglig kommer den att ge upphov till ett :exc:`NotImplementedError`.

source: If the function also supports *dir_fd* or *follow_symlinks* arguments, it's an error to specify one of those when supplying *path* as a file descriptor.
sv: Om funktionen även stöder argumenten *dir_fd* eller *follow_symlinks* är det fel att ange något av dessa när *path* anges som filbeskrivare.

source: **paths relative to directory descriptors:** If *dir_fd* is not ``None``, it should be a file descriptor referring to a directory, and the path to operate on should be relative; path will then be relative to that directory. If the path is absolute, *dir_fd* is ignored. (For POSIX systems, Python will call the variant of the function with an ``at`` suffix and possibly prefixed with ``f`` (e.g. call ``faccessat`` instead of ``access``).
sv: **Sökvägar relativt katalogbeskrivare:** Om *dir_fd* inte är ``None`` ska det vara en filbeskrivning som hänvisar till en katalog och sökvägen ska vara relativ; sökvägen kommer då att vara relativ till den katalogen. Om sökvägen är absolut ignoreras *dir_fd*. (För POSIX-system kommer Python att anropa varianten av funktionen med suffixet ``at`` och eventuellt med prefixet ``f`` (t.ex. anropa ``faccessat`` istället för ``access``).

source: You can check whether or not *dir_fd* is supported for a particular function on your platform using :data:`os.supports_dir_fd`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
sv: Du kan kontrollera om *dir_fd* stöds för en viss funktion på din plattform med hjälp av :data:`os.supports_dir_fd`. Om den inte är tillgänglig, kommer användningen av den att ge upphov till ett :exc:`NotImplementedError`.

source: **not following symlinks:** If *follow_symlinks* is ``False``, and the last element of the path to operate on is a symbolic link, the function will operate on the symbolic link itself rather than the file pointed to by the link. (For POSIX systems, Python will call the ``l...`` variant of the function.)
sv: **följer inte symboliska länkar:** Om *follow_symlinks* är ``False``, och det sista elementet i sökvägen som ska bearbetas är en symbolisk länk, kommer funktionen att bearbeta själva den symboliska länken i stället för den fil som länken pekar på. (För POSIX-system kommer Python att anropa ``l...``-varianten av funktionen)

source: You can check whether or not *follow_symlinks* is supported for a particular function on your platform using :data:`os.supports_follow_symlinks`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
sv: Du kan kontrollera om *follow_symlinks* stöds för en viss funktion på din plattform med hjälp av :data:`os.supports_follow_symlinks`. Om den inte är tillgänglig kommer den att ge upphov till ett :exc:`NotImplementedError`.

source: Use the real uid/gid to test for access to *path*. Note that most operations will use the effective uid/gid, therefore this routine can be used in a suid/sgid environment to test if the invoking user has the specified access to *path*. *mode* should be :const:`F_OK` to test the existence of *path*, or it can be the inclusive OR of one or more of :const:`R_OK`, :const:`W_OK`, and :const:`X_OK` to test permissions. Return :const:`True` if access is allowed, :const:`False` if not. See the Unix man page :manpage:`access(2)` for more information.
sv: Använd den verkliga uid/gid för att testa åtkomst till *path*. Observera att de flesta operationer kommer att använda det effektiva uid/gid, därför kan denna rutin användas i en suid/sgid-miljö för att testa om den anropande användaren har den angivna åtkomsten till *path*. *mode* bör vara :const:`F_OK` för att testa existensen av *sökväg*, eller så kan det vara det inkluderande ELLER av en eller flera av :const:`R_OK`, :const:`W_OK` och :const:`X_OK` för att testa behörigheter. Returnerar :const:`True` om åtkomst är tillåten, :const:`False` om inte. Se Unix man page :manpage:`access(2)` för mer information.

source: This function can support specifying :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
sv: Den här funktionen kan stödja angivande av :ref:`sökvägar relativt katalogbeskrivare <dir_fd>` och :ref:`inte följa symlänkar <follow_symlinks>`.

source: If *effective_ids* is ``True``, :func:`access` will perform its access checks using the effective uid/gid instead of the real uid/gid. *effective_ids* may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_effective_ids`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
sv: Om *effective_ids* är ``True`` kommer :func:`access` att utföra sina åtkomstkontroller med hjälp av det effektiva uid/gid istället för det riktiga uid/gid. *effective_ids* kanske inte stöds på din plattform; du kan kontrollera om det är tillgängligt eller inte med :data:`os.supports_effective_ids`. Om den inte är tillgänglig kommer den att ge upphov till ett :exc:`NotImplementedError`.

source: Using :func:`access` to check if a user is authorized to e.g. open a file before actually doing so using :func:`open` creates a security hole, because the user might exploit the short time interval between checking and opening the file to manipulate it. It's preferable to use :term:`EAFP` techniques. For example::
sv: Om du använder :func:`access` för att kontrollera om en användare har behörighet att t.ex. öppna en fil innan han eller hon faktiskt gör det med :func:`open` skapas ett säkerhetshål, eftersom användaren kan utnyttja det korta tidsintervallet mellan kontrollen och öppnandet av filen för att manipulera den. Det är att föredra att använda :term:`EAFP`-tekniker. Till exempel::

source: if os.access("myfile", os.R_OK): with open("myfile") as fp: return fp.read() return "some default data"
sv: if os.access("minfil", os.R_OK): med open("myfile") som fp: return fp.read() return "några standarddata"

source: is better written as::
sv: är bättre skrivet som::

source: try: fp = open("myfile") except PermissionError: return "some default data" else: with fp: return fp.read()
sv: försök: fp = open("myfile") except PermissionError: return "några standarddata" else: med fp: return fp.read()

source: I/O operations may fail even when :func:`access` indicates that they would succeed, particularly for operations on network filesystems which may have permissions semantics beyond the usual POSIX permission-bit model.
sv: I/O-operationer kan misslyckas även om :func:`access` indikerar att de skulle lyckas, särskilt för operationer på nätverksfilsystem som kan ha en behörighetssemantik som går utöver den vanliga POSIX-modellen för behörighetsbitar.

source: Added the *dir_fd*, *effective_ids*, and *follow_symlinks* parameters.
sv: Parametrarna *dir_fd*, *effective_ids* och *follow_symlinks* har lagts till.

source: Values to pass as the *mode* parameter of :func:`access` to test the existence, readability, writability and executability of *path*, respectively.
sv: Värden att skicka som *mode*-parameter i :func:`access` för att testa existensen, läsbarheten, skrivbarheten respektive körbarheten för *path*.

source: Change the current working directory to *path*.
sv: Ändra den aktuella arbetskatalogen till *path*.

source: This function can support :ref:`specifying a file descriptor <path_fd>`. The descriptor must refer to an opened directory, not an open file.
sv: Denna funktion kan stödja :ref:`angivelse av en filbeskrivare <path_fd>`. Deskriptorn måste referera till en öppnad katalog, inte en öppen fil.

source: This function can raise :exc:`OSError` and subclasses such as :exc:`FileNotFoundError`, :exc:`PermissionError`, and :exc:`NotADirectoryError`.
sv: Denna funktion kan ge upphov till :exc:`OSError` och underklasser som :exc:`FileNotFoundError`, :exc:`PermissionError` och :exc:`NotADirectoryError`.

source: Raises an :ref:`auditing event <auditing>` ``os.chdir`` with argument ``path``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.chdir`` med argumentet ``path``.

source: Added support for specifying *path* as a file descriptor on some platforms.
sv: Lagt till stöd för att ange *path* som filbeskrivare på vissa plattformar.

source: Set the flags of *path* to the numeric *flags*. *flags* may take a combination (bitwise OR) of the following values (as defined in the :mod:`stat` module):
sv: Ställ in flaggorna för *sökväg* till det numeriska värdet *flags*. *flags* kan vara en kombination (bitvis ELLER) av följande värden (enligt definitionen i modulen :mod:`stat`):

source: This function can support :ref:`not following symlinks <follow_symlinks>`.
sv: Denna funktion kan stödja :ref:``inte följa symbollänkar <follow_symlinks>`.

source: Raises an :ref:`auditing event <auditing>` ``os.chflags`` with arguments ``path``, ``flags``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.chflags`` med argumenten ``path``, ``flags``.

source: Added the *follow_symlinks* parameter.
sv: Parametern *follow_symlinks* har lagts till.

source: Change the mode of *path* to the numeric *mode*. *mode* may take one of the following values (as defined in the :mod:`stat` module) or bitwise ORed combinations of them:
sv: Ändrar läget för *sökväg* till det numeriska *läge*. *mode* kan anta något av följande värden (enligt definitionerna i modulen :mod:`stat`) eller bitvisa kombinationer av dem:

source: This function can support :ref:`specifying a file descriptor <path_fd>`, :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
sv: Den här funktionen kan stödja :ref:`specificera en filbeskrivare <path_fd>`, :ref:`sökvägar relativt katalogbeskrivare <dir_fd>` och :ref:`inte följa symlänkar <follow_symlinks>`.

source: Although Windows supports :func:`chmod`, you can only set the file's read-only flag with it (via the ``stat.S_IWRITE`` and ``stat.S_IREAD`` constants or a corresponding integer value). All other bits are ignored. The default value of *follow_symlinks* is ``False`` on Windows.
sv: Även om Windows stöder :func:`chmod`, kan du bara ställa in filens skrivskyddade flagga med den (via konstanterna ``stat.S_IWRITE`` och ``stat.S_IREAD`` eller ett motsvarande heltalsvärde). Alla andra bitar ignoreras. Standardvärdet för *follow_symlinks* är ``False`` i Windows.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd* and *follow_symlinks* arguments.
sv: Lagt till stöd för att ange *path* som en öppen filbeskrivare, och argumenten *dir_fd* och *follow_symlinks*.

source: Added support for a file descriptor and the *follow_symlinks* argument on Windows.
sv: Lagt till stöd för filbeskrivare och argumentet *follow_symlinks* i Windows.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1.
sv: Ändra ägar- och grupp-id för *sökväg* till de numeriska värdena *uid* och *gid*. Om du vill lämna ett av id:en oförändrat anger du -1.

source: See :func:`shutil.chown` for a higher-level function that accepts names in addition to numeric ids.
sv: Se :func:`shutil.chown` för en funktion på högre nivå som accepterar namn i tillägg till numeriska id:n.

source: Supports a :term:`path-like object`.
sv: Stöder en :term:`path-liknande objekt`.

source: Change the root directory of the current process to *path*.
sv: Ändra rotkatalogen för den aktuella processen till *path*.

source: Change the current working directory to the directory represented by the file descriptor *fd*. The descriptor must refer to an opened directory, not an open file. As of Python 3.3, this is equivalent to ``os.chdir(fd)``.
sv: Ändra den aktuella arbetskatalogen till den katalog som representeras av fildeskriptorn *fd*. Deskriptorn måste referera till en öppnad katalog, inte en öppen fil. Från och med Python 3.3 är detta likvärdigt med ``os.chdir(fd)``.

source: Return a string representing the current working directory.
sv: Returnerar en sträng som representerar den aktuella arbetskatalogen.

source: Return a bytestring representing the current working directory.
sv: Returnerar en bytestring som representerar den aktuella arbetskatalogen.

source: The function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows.
sv: Funktionen använder nu UTF-8-kodning i Windows, snarare än ANSI-kodsidan: se :pep:`529` för motivering. Funktionen är inte längre föråldrad i Windows.

source: Set the flags of *path* to the numeric *flags*, like :func:`chflags`, but do not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chflags(path, flags, follow_symlinks=False)``.
sv: Ställ in flaggorna för *sökväg* till de numeriska *flaggorna*, som :func:`chflags`, men följ inte symboliska länkar. Från och med Python 3.3 är detta likvärdigt med ``os.chflags(path, flags, follow_symlinks=False)``.

source: Change the mode of *path* to the numeric *mode*. If path is a symlink, this affects the symlink rather than the target. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(path, mode, follow_symlinks=False)``.
sv: Ändra läget för *sökväg* till det numeriska *läget*. Om sökvägen är en symbolisk länk påverkar detta den symboliska länken snarare än målet. Se dokumentationen för :func:`chmod` för möjliga värden för *mode*. Från och med Python 3.3 är detta likvärdigt med ``os.chmod(path, mode, follow_symlinks=False)``.

source: ``lchmod()`` is not part of POSIX, but Unix implementations may have it if changing the mode of symbolic links is supported.
sv: ``lchmod()`` är inte en del av POSIX, men Unix-implementationer kan ha det om det finns stöd för att ändra läget för symboliska länkar.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. This function will not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chown(path, uid, gid, follow_symlinks=False)``.
sv: Ändra ägar- och grupp-ID för *sökväg* till de numeriska värdena *uid* och *gid*. Denna funktion följer inte symboliska länkar. Från och med Python 3.3 är detta likvärdigt med ``os.chown(path, uid, gid, follow_symlinks=False)``.

source: Create a hard link pointing to *src* named *dst*.
sv: Skapa en hård länk som pekar på *src* och heter *dst*.

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`, and :ref:`not following symlinks <follow_symlinks>`. The default value of *follow_symlinks* is ``False`` on Windows.
sv: Denna funktion kan stödja angivande av *src_dir_fd* och/eller *dst_dir_fd* för att tillhandahålla :ref:`sökvägar relativt katalogbeskrivare <dir_fd>`, och :ref:`inte följa symlinks <follow_symlinks>`. Standardvärdet för *follow_symlinks* är ``False`` i Windows.

source: Raises an :ref:`auditing event <auditing>` ``os.link`` with arguments ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.link`` med argumenten ``src``, ``dst``, ```src_dir_fd``, ``dst_dir_fd``.

source: Added Windows support.
sv: Stöd för Windows har lagts till.

source: Added the *src_dir_fd*, *dst_dir_fd*, and *follow_symlinks* parameters.
sv: Parametrarna *src_dir_fd*, *dst_dir_fd* och *follow_symlinks* har lagts till.

source: Accepts a :term:`path-like object` for *src* and *dst*.
sv: Accepterar en :term:`path-like object` för *src* och *dst*.

source: Return a list containing the names of the entries in the directory given by *path*. The list is in arbitrary order, and does not include the special entries ``'.'`` and ``'..'`` even if they are present in the directory. If a file is removed from or added to the directory during the call of this function, whether a name for that file be included is unspecified.
sv: Returnerar en lista som innehåller namnen på posterna i katalogen som anges av *path*. Listan är i godtycklig ordning och inkluderar inte specialposterna ``'.'`` och ``'..'`` även om de finns i katalogen. Om en fil tas bort från eller läggs till i katalogen under anropet av denna funktion, är det ospecificerat om ett namn för den filen ska inkluderas.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the filenames returned will also be of type ``bytes``; in all other circumstances, they will be of type ``str``.
sv: *path* kan vara en :term:`path-like object`. Om *sökväg* är av typen ``bytes`` (direkt eller indirekt genom gränssnittet :class:`PathLike`), kommer filnamnen som returneras också att vara av typen ``bytes``; under alla andra omständigheter kommer de att vara av typen ``str``.

source: This function can also support :ref:`specifying a file descriptor <path_fd>`; the file descriptor must refer to a directory.
sv: Denna funktion kan också stödja :ref:`specificera en filbeskrivning <path_fd>`; filbeskrivningen måste referera till en katalog.

source: Raises an :ref:`auditing event <auditing>` ``os.listdir`` with argument ``path``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.listdir`` med argumentet ``path``.

source: To encode ``str`` filenames to ``bytes``, use :func:`~os.fsencode`.
sv: För att koda ``str`` filnamn till ``bytes``, använd :func:`~os.fsencode`.

source: The :func:`scandir` function returns directory entries along with file attribute information, giving better performance for many common use cases.
sv: Funktionen :func:`scandir` returnerar katalogposter tillsammans med information om filattribut, vilket ger bättre prestanda för många vanliga användningsfall.

source: The *path* parameter became optional.
sv: Parametern *path* blev valfri.

source: Added support for specifying *path* as an open file descriptor.
sv: Lagt till stöd för att ange *path* som en öppen filbeskrivare.

source: Return a list containing the names of drives on a Windows system.
sv: Returnerar en lista som innehåller namnen på enheterna i ett Windows-system.

source: A drive name typically looks like ``'C:\\'``. Not every drive name will be associated with a volume, and some may be inaccessible for a variety of reasons, including permissions, network connectivity or missing media. This function does not test for access.
sv: Ett enhetsnamn ser vanligtvis ut som "C:\". Alla enhetsnamn är inte associerade med en volym, och vissa kan vara otillgängliga av olika skäl, t.ex. behörigheter, nätverksanslutning eller saknad media. Den här funktionen testar inte åtkomst.

source: May raise :exc:`OSError` if an error occurs collecting the drive names.
sv: Kan ge upphov till :exc:`OSError` om ett fel uppstår vid insamling av enhetsnamn.

source: Raises an :ref:`auditing event <auditing>` ``os.listdrives`` with no arguments.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.listdrives`` utan argument.

source: Return a list containing the mount points for a volume on a Windows system.
sv: Returnerar en lista som innehåller monteringspunkterna för en volym på ett Windows-system.
