Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: Create a pipe with *flags* set atomically. *flags* can be constructed by ORing together one or more of these values: :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively.
sv: Skapa en pipe med *flags* atomiskt inställda. *flags* kan konstrueras genom att ORa ihop ett eller flera av dessa värden: :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Returnerar ett par filbeskrivare ``(r, w)`` som kan användas för läsning respektive skrivning.

source: Ensures that enough disk space is allocated for the file specified by *fd* starting from *offset* and continuing for *len* bytes.
sv: Säkerställer att tillräckligt med diskutrymme allokeras för den fil som anges av *fd* från *offset* och *len* bytes framåt.

source: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations. The advice applies to the region of the file specified by *fd* starting at *offset* and continuing for *len* bytes. *advice* is one of :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` or :data:`POSIX_FADV_DONTNEED`.
sv: Tillkännager en avsikt att komma åt data i ett specifikt mönster, vilket gör att kärnan kan göra optimeringar. Rådet gäller för den del av filen som specificeras av *fd* och börjar vid *offset* och fortsätter i *len* byte. *advice* är en av :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` eller :data:`POSIX_FADV_DONTNEED`.

source: Flags that can be used in *advice* in :func:`posix_fadvise` that specify the access pattern that is likely to be used.
sv: Flaggor som kan användas i *råd* i :func:`posix_fadvise` som anger det åtkomstmönster som sannolikt kommer att användas.

source: Read at most *n* bytes from file descriptor *fd* at a position of *offset*, leaving the file offset unchanged.
sv: Läser högst *n* byte från filbeskrivaren *fd* vid en position på *offset*, vilket lämnar filoffseten oförändrad.

source: Return a bytestring containing the bytes read. If the end of the file referred to by *fd* has been reached, an empty bytes object is returned.
sv: Returnerar en bytestring som innehåller de lästa bytena. Om slutet på filen som refereras till av *fd* har nåtts, returneras ett tomt bytesobjekt.

source: Open and return a file descriptor for a master pseudo-terminal device.
sv: Öppna och returnera en filbeskrivare för en master-pseudoterminalenhet.

source: Calls the C standard library function :c:func:`posix_openpt`. The *oflag* argument is used to set file status flags and file access modes as specified in the manual page of :c:func:`posix_openpt` of your system.
sv: Anropar C-standardbiblioteksfunktionen :c:func:`posix_openpt`. Argumentet *oflag* används för att ställa in filstatusflaggor och filåtkomstlägen enligt vad som anges på manualsidan för :c:func:`posix_openpt` i ditt system.

source: The returned file descriptor is :ref:`non-inheritable <fd_inheritance>`. If the value :data:`O_CLOEXEC` is available on the system, it is added to *oflag*.
sv: Filbeskrivaren som returneras är :ref:`non-inherititable <fd_inheritance>`. Om värdet :data:`O_CLOEXEC` finns tillgängligt i systemet läggs det till i *oflag*.

source: Read from a file descriptor *fd* at a position of *offset* into mutable :term:`bytes-like objects <bytes-like object>` *buffers*, leaving the file offset unchanged. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
sv: Läser från en filbeskrivare *fd* vid en position på *offset* till föränderliga :term:`bytesliknande objekt <bytes-like object>` *buffertar*, med oförändrad filoffset. Överför data till varje buffert tills den är full och gå sedan vidare till nästa buffert i sekvensen för att lagra resten av data.

source: The flags argument contains a bitwise OR of zero or more of the following flags:
sv: Argumentet flags innehåller ett bitvis OR av noll eller flera av följande flaggor:

source: Return the total number of bytes actually read which can be less than the total capacity of all the objects.
sv: Returnerar det totala antalet bytes som faktiskt lästs, vilket kan vara mindre än den totala kapaciteten för alla objekt.

source: The operating system may set a limit (:func:`sysconf` value ``'SC_IOV_MAX'``) on the number of buffers that can be used.
sv: Operativsystemet kan sätta en gräns (:func:`sysconf` värde ``'SC_IOV_MAX'``) för antalet buffertar som kan användas.

source: Combine the functionality of :func:`os.readv` and :func:`os.pread`.
sv: Kombinerar funktionerna i :func:`os.readv` och :func:`os.pread`.

source: Using flags requires Linux >= 4.6.
sv: Användning av flaggor kräver Linux >= 4.6.

source: Do not wait for data which is not immediately available. If this flag is specified, the system call will return instantly if it would have to read data from the backing storage or wait for a lock.
sv: Vänta inte på data som inte är omedelbart tillgängliga. Om den här flaggan anges kommer systemanropet att returneras direkt om det måste läsa data från backinglagret eller vänta på ett lås.

source: If some data was successfully read, it will return the number of bytes read. If no bytes were read, it will return ``-1`` and set errno to :const:`errno.EAGAIN`.
sv: Om data lästes framgångsrikt returneras antalet lästa byte. Om inga byte lästes, returneras ``-1`` och errno sätts till :const:`errno.EAGAIN`.

source: High priority read/write. Allows block-based filesystems to use polling of the device, which provides lower latency, but may use additional resources.
sv: Läsning/skrivning med hög prioritet. Gör det möjligt för blockbaserade filsystem att använda pollning av enheten, vilket ger lägre latens, men kan kräva ytterligare resurser.

source: Currently, on Linux, this feature is usable only on a file descriptor opened using the :data:`O_DIRECT` flag.
sv: För närvarande är den här funktionen endast användbar i Linux på en filbeskrivare som öppnats med flaggan :data:`O_DIRECT`.

source: Return the name of the slave pseudo-terminal device associated with the master pseudo-terminal device to which the file descriptor *fd* refers. The file descriptor *fd* is not closed upon failure.
sv: Returnerar namnet på den pseudoterminalenhet för slavar som är associerad med den pseudoterminalenhet för master som fildeskriptorn *fd* hänvisar till. Filbeskrivaren *fd* stängs inte om den misslyckas.

source: Calls the reentrant C standard library function :c:func:`ptsname_r` if it is available; otherwise, the C standard library function :c:func:`ptsname`, which is not guaranteed to be thread-safe, is called.
sv: Anropar den reentranta C-standardbiblioteksfunktionen :c:func:`ptsname_r` om den är tillgänglig; annars anropas C-standardbiblioteksfunktionen :c:func:`ptsname`, som inte garanterat är trådsäker.

source: Write the bytestring in *str* to file descriptor *fd* at position of *offset*, leaving the file offset unchanged.
sv: Skriv bytesträngen i *str* till filbeskrivaren *fd* vid positionen *offset*, vilket lämnar filoffseten oförändrad.

source: Return the number of bytes actually written.
sv: Returnera antalet bytes som faktiskt skrivits.

source: Write the *buffers* contents to file descriptor *fd* at an offset *offset*, leaving the file offset unchanged. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
sv: Skriv *buffertarnas* innehåll till filbeskrivaren *fd* vid en offset *offset*, vilket lämnar filoffseten oförändrad. *buffertar* måste vara en sekvens av :term:`bytesliknande objekt <bytes-like object>`. Buffertarna behandlas i array-ordning. Hela innehållet i den första bufferten skrivs innan man går vidare till den andra, och så vidare.

source: Return the total number of bytes actually written.
sv: Returnera det totala antalet bytes som faktiskt skrivits.

source: Combine the functionality of :func:`os.writev` and :func:`os.pwrite`.
sv: Kombinerar funktionerna i :func:`os.writev` och :func:`os.pwrite`.

source: Provide a per-write equivalent of the :data:`O_DSYNC` :func:`os.open` flag. This flag effect applies only to the data range written by the system call.
sv: Tillhandahåller en skrivmotsvarighet till flaggan :data:`O_DSYNC` :func:`os.open`. Denna flagga gäller endast för det dataintervall som skrivs av systemanropet.

source: Provide a per-write equivalent of the :data:`O_SYNC` :func:`os.open` flag. This flag effect applies only to the data range written by the system call.
sv: Tillhandahåller en skrivmotsvarighet till flaggan :data:`O_SYNC` :func:`os.open`. Denna flagga gäller endast för det dataintervall som skrivs av systemanropet.

source: Provide a per-write equivalent of the :data:`O_APPEND` :func:`os.open` flag. This flag is meaningful only for :func:`os.pwritev`, and its effect applies only to the data range written by the system call. The *offset* argument does not affect the write operation; the data is always appended to the end of the file. However, if the *offset* argument is ``-1``, the current file *offset* is updated.
sv: Tillhandahåller en skrivmotsvarighet till :data:`O_APPEND` :func:`os.open`-flaggan. Denna flagga är endast meningsfull för :func:`os.pwritev`, och dess effekt gäller endast för det dataområde som skrivs av systemanropet. Argumentet *offset* påverkar inte skrivoperationen; data läggs alltid till i slutet av filen. Om *offset*-argumentet är ``-1`` uppdateras dock den aktuella filens *offset*.

source: Read at most *n* bytes from file descriptor *fd*.
sv: Läs högst *n* byte från filbeskrivaren *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To read a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdin`, use its :meth:`~file.read` or :meth:`~file.readline` methods.
sv: Denna funktion är avsedd för lågnivå-I/O och måste tillämpas på en filbeskrivare som returneras av :func:`os.open` eller :func:`pipe`. För att läsa ett "filobjekt" som returneras av den inbyggda funktionen :func:`open` eller av :func:`popen` eller :func:`fdopen`, eller :data:`sys.stdin`, använd dess metoder :meth:`~file.read` eller :meth:`~file.readline`.

source: Read from a file descriptor *fd* into a mutable :ref:`buffer object <bufferobjects>` *buffer*.
sv: Läs från en filbeskrivare *fd* till ett föränderligt :ref:`buffer-objekt <bufferobjects>` *buffer*.

source: The *buffer* should be mutable and :term:`bytes-like <bytes-like object>`. On success, returns the number of bytes read. Less bytes may be read than the size of the buffer. The underlying system call will be retried when interrupted by a signal, unless the signal handler raises an exception. Other errors will not be retried and an error will be raised.
sv: *Bufferten* ska vara mutabel och :term:`bytesliknande <bytes-like object>`. Vid framgång returneras antalet lästa byte. Färre byte kan läsas än buffertens storlek. Det underliggande systemanropet kommer att återupptas när det avbryts av en signal, såvida inte signalhanteraren gör ett undantag. Andra fel kommer inte att återupptas och ett fel kommer att uppstå.

source: Returns 0 if *fd* is at end of file or if the provided *buffer* has length 0 (which can be used to check for errors without reading data). Never returns negative.
sv: Returnerar 0 om *fd* är i slutet av filen eller om den medföljande *buffer* har längd 0 (vilket kan användas för att kontrollera fel utan att läsa data). Returnerar aldrig negativt.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`os.pipe`. To read a "file object" returned by the built-in function :func:`open`, or :data:`sys.stdin`, use its member functions, for example :meth:`io.BufferedIOBase.readinto`, :meth:`io.BufferedIOBase.read`, or :meth:`io.TextIOBase.read`
sv: Den här funktionen är avsedd för I/O på låg nivå och måste tillämpas på en filbeskrivare som returneras av :func:`os.open` eller :func:`os.pipe`. För att läsa ett "filobjekt" som returneras av den inbyggda funktionen :func:`open`, eller :data:`sys.stdin`, använd dess medlemsfunktioner, till exempel :meth:`io.BufferedIOBase.readinto`, :meth:`io.BufferedIOBase.read`, eller :meth:`io.TextIOBase.read`

source: Copy *count* bytes from file descriptor *in_fd* to file descriptor *out_fd* starting at *offset*. Return the number of bytes sent. When EOF is reached return ``0``.
sv: Kopiera *antal* byte från filbeskrivaren *in_fd* till filbeskrivaren *out_fd* med start vid *offset*. Returnera antalet byte som skickats. När EOF nås returneras ``0``.

source: The first function notation is supported by all platforms that define :func:`sendfile`.
sv: Den första funktionsnotationen stöds av alla plattformar som definierar :func:`sendfile`.

source: On Linux, if *offset* is given as ``None``, the bytes are read from the current position of *in_fd* and the position of *in_fd* is updated.
sv: Under Linux, om *offset* anges som ``None``, läses bytena från den aktuella positionen för *in_fd* och positionen för *in_fd* uppdateras.

source: The second case may be used on macOS and FreeBSD where *headers* and *trailers* are arbitrary sequences of buffers that are written before and after the data from *in_fd* is written. It returns the same as the first case.
sv: Det andra fallet kan användas på macOS och FreeBSD där *headers* och *trailers* är godtyckliga sekvenser av buffertar som skrivs före och efter att data från *in_fd* skrivs. Det returnerar samma sak som det första fallet.

source: On macOS and FreeBSD, a value of ``0`` for *count* specifies to send until the end of *in_fd* is reached.
sv: På macOS och FreeBSD anger ett värde på ``0`` för *count* att sändning ska ske tills slutet av *in_fd* nås.

source: All platforms support sockets as *out_fd* file descriptor, and some platforms allow other types (e.g. regular file, pipe) as well.
sv: Alla plattformar stöder sockets som *out_fd* filbeskrivare, och vissa plattformar tillåter även andra typer (t.ex. vanlig fil, pipe).

source: Cross-platform applications should not use *headers*, *trailers* and *flags* arguments.
sv: Plattformsoberoende program bör inte använda argumenten *headers*, *trailers* och *flags*.

source: For a higher-level wrapper of :func:`sendfile`, see :meth:`socket.socket.sendfile`.
sv: För en högre nivå av :func:`sendfile`, se :meth:`socket.socket.sendfile`.

source: Parameters *out* and *in* was renamed to *out_fd* and *in_fd*.
sv: Parametrarna *out* och *in* döptes om till *out_fd* och *in_fd*.

source: Parameters to the :func:`sendfile` function, if the implementation supports them.
sv: Parametrar till funktionen :func:`sendfile`, om implementationen stöder dem.

source: Parameter to the :func:`sendfile` function, if the implementation supports it. The data won't be cached in the virtual memory and will be freed afterwards.
sv: Parameter till funktionen :func:`sendfile`, om implementationen stöder det. Data kommer inte att cachas i det virtuella minnet och kommer att frigöras efteråt.

source: Set the blocking mode of the specified file descriptor. Set the :data:`O_NONBLOCK` flag if blocking is ``False``, clear the flag otherwise.
sv: Ställer in blockeringsläget för den angivna filbeskrivaren. Ställ in flaggan :data:`O_NONBLOCK` om blockering är ``False``, rensa flaggan annars.

source: See also :func:`get_blocking` and :meth:`socket.socket.setblocking`.
sv: Se även :func:`get_blocking` och :meth:`socket.socket.setblocking`.

source: Transfer *count* bytes from file descriptor *src*, starting from offset *offset_src*, to file descriptor *dst*, starting from offset *offset_dst*.
sv: Överför *count* bytes från filbeskrivaren *src*, med start från offset *offset_src*, till filbeskrivaren *dst*, med start från offset *offset_dst*.

source: The splicing behaviour can be modified by specifying a *flags* value. Any of the following variables may used, combined using bitwise OR (the ``|`` operator):
sv: Splicing-beteendet kan ändras genom att ange ett *flags*-värde. Någon av följande variabler kan användas och kombineras med bitvis OR (operatorn ``|``):

source: If :const:`SPLICE_F_MOVE` is specified, the kernel is asked to move pages instead of copying, but pages may still be copied if the kernel cannot move the pages from the pipe.
sv: Om :const:`SPLICE_F_MOVE` anges ombeds kärnan att flytta sidor i stället för att kopiera, men sidor kan ändå kopieras om kärnan inte kan flytta sidorna från pipen.

source: If :const:`SPLICE_F_NONBLOCK` is specified, the kernel is asked to not block on I/O. This makes the splice pipe operations nonblocking, but splice may nevertheless block because the spliced file descriptors may block.
sv: Om :const:`SPLICE_F_NONBLOCK` anges ombeds kärnan att inte blockera vid I/O. Detta gör att splice pipe-operationerna inte blockerar, men splice kan ändå blockera eftersom de splicade filbeskrivarna kan blockera.

source: If :const:`SPLICE_F_MORE` is specified, it hints to the kernel that more data will be coming in a subsequent splice.
sv: Om :const:`SPLICE_F_MORE` anges, antyder det för kärnan att mer data kommer att komma i en efterföljande splice.

source: At least one of the file descriptors must refer to a pipe. If *offset_src* is ``None``, then *src* is read from the current position; respectively for *offset_dst*. The offset associated to the file descriptor that refers to a pipe must be ``None``. The files pointed to by *src* and *dst* must reside in the same filesystem, otherwise an :exc:`OSError` is raised with :attr:`~OSError.errno` set to :const:`errno.EXDEV`.
sv: Minst en av filbeskrivarna måste referera till en pipe. Om *offset_src* är ``None`` läses *src* från den aktuella positionen; motsvarande gäller för *offset_dst*. Den offset som är kopplad till filbeskrivaren som refererar till en pipe måste vara ``None``. Filerna som pekas ut av *src* och *dst* måste finnas i samma filsystem, annars uppstår ett :exc:`OSError` med :attr:`~OSError.errno` satt till :const:`errno.EXDEV`.

source: This copy is done without the additional cost of transferring data from the kernel to user space and then back into the kernel. Additionally, some filesystems could implement extra optimizations. The copy is done as if both files are opened as binary.
sv: Denna kopiering görs utan den extra kostnaden för att överföra data från kärnan till användarutrymmet och sedan tillbaka till kärnan. Dessutom kan vissa filsystem implementera extra optimeringar. Kopian görs som om båda filerna öppnades som binära.

source: Upon successful completion, returns the number of bytes spliced to or from the pipe. A return value of 0 means end of input. If *src* refers to a pipe, then this means that there was no data to transfer, and it would not make sense to block because there are no writers connected to the write end of the pipe.
sv: Vid lyckad slutförande returneras antalet bytes som har skarvats till eller från röret. Ett returvärde på 0 betyder att inmatningen är avslutad. Om *src* hänvisar till en pipe betyder det att det inte fanns några data att överföra och att det inte skulle vara meningsfullt att blockera eftersom det inte finns några skrivare anslutna till skrivänden av pipen.

source: The :manpage:`splice(2)` man page.
sv: Manualsidan :manpage:`splice(2)`.

source: Read from a file descriptor *fd* into a number of mutable :term:`bytes-like objects <bytes-like object>` *buffers*. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
sv: Läser från en filbeskrivare *fd* till ett antal föränderliga :term:`bytesliknande objekt <bytes-like object>` *buffertar*. Överför data till varje buffert tills den är full och gå sedan vidare till nästa buffert i sekvensen för att lagra resten av data.

source: Return the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`).
sv: Returnerar processgruppen som är associerad med terminalen som anges av *fd* (en öppen filbeskrivare som returneras av :func:`os.open`).

source: Set the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`) to *pg*.
sv: Ställ in processgruppen som är associerad med terminalen som anges av *fd* (en öppen filbeskrivare som returneras av :func:`os.open`) till *pg*.

source: Return a string which specifies the terminal device associated with file descriptor *fd*. If *fd* is not associated with a terminal device, an exception is raised.
sv: Returnerar en sträng som anger den terminalenhet som är associerad med filbeskrivaren *fd*. Om *fd* inte är associerad med en terminalenhet, kommer ett undantag att uppstå.

source: Unlock the slave pseudo-terminal device associated with the master pseudo-terminal device to which the file descriptor *fd* refers. The file descriptor *fd* is not closed upon failure.
sv: Lås upp pseudoterminalenheten för slavar som är associerad med pseudoterminalenheten för master som filbeskrivaren *fd* hänvisar till. Filbeskrivaren *fd* stängs inte om den misslyckas.

source: Calls the C standard library function :c:func:`unlockpt`.
sv: Anropar C-standardbiblioteksfunktionen :c:func:`unlockpt`.

source: Write the bytestring in *str* to file descriptor *fd*.
sv: Skriv bytesträngen i *str* till filbeskrivaren *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To write a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdout` or :data:`sys.stderr`, use its :meth:`~file.write` method.
sv: Den här funktionen är avsedd för I/O på låg nivå och måste tillämpas på en filbeskrivare som returneras av :func:`os.open` eller :func:`pipe`. För att skriva ett "filobjekt" som returneras av den inbyggda funktionen :func:`open` eller av :func:`popen` eller :func:`fdopen`, eller :data:`sys.stdout` eller :data:`sys.stderr`, använd dess metod :meth:`~file.write`.

source: Write the contents of *buffers* to file descriptor *fd*. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
sv: Skriv innehållet i *buffertar* till filbeskrivaren *fd*. *buffertar* måste vara en sekvens av :term:`bytesliknande objekt <bytes-like object>`. Buffertarna bearbetas i array-ordning. Hela innehållet i den första bufferten skrivs innan man går vidare till den andra, och så vidare.

source: Returns the total number of bytes actually written.
sv: Returnerar det totala antalet bytes som faktiskt skrivits.

source: Querying the size of a terminal
sv: Fråga om storleken på en terminal

source: Return the size of the terminal window as ``(columns, lines)``, tuple of type :class:`terminal_size`.
sv: Returnerar storleken på terminalfönstret som ``(kolumner, rader)``, tupel av typen :class:`terminal_size`.

source: The optional argument ``fd`` (default ``STDOUT_FILENO``, or standard output) specifies which file descriptor should be queried.
sv: Det valfria argumentet ``fd`` (standard ``STDOUT_FILENO``, eller standardutdata) anger vilken filbeskrivare som ska tillfrågas.

source: If the file descriptor is not connected to a terminal, an :exc:`OSError` is raised.
sv: Om filbeskrivaren inte är ansluten till en terminal, uppstår ett :exc:`OSError`.
