Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: On Windows: Wait for completion of a process given by process handle *pid*, and return a tuple containing *pid*, and its exit status shifted left by 8 bits (shifting makes cross-platform use of the function easier). A *pid* less than or equal to ``0`` has no special meaning on Windows, and raises an exception. The value of integer *options* has no effect. *pid* can refer to any process whose id is known, not necessarily a child process. The :func:`spawn\* <spawnl>` functions called with :const:`P_NOWAIT` return suitable process handles.
sv: I Windows: Väntar på att en process som anges med processhandtaget *pid* ska avslutas och returnerar en tupel som innehåller *pid* och dess utgångsstatus, förskjuten 8 bitar åt vänster (förskjutningen gör det lättare att använda funktionen på flera plattformar). En *pid* som är mindre än eller lika med ``0`` har ingen speciell betydelse i Windows, och ger upphov till ett undantag. Värdet på heltalet *options* har ingen effekt. *pid* kan referera till vilken process som helst vars id är känt, inte nödvändigtvis en barnprocess. Funktionerna :func:`spawn\* <spawnl>` som anropas med :const:`P_NOWAIT` returnerar lämpliga processhandtag.

source: Similar to :func:`waitpid`, except no process id argument is given and a 3-element tuple containing the child's process id, exit status indication, and resource usage information is returned. Refer to :func:`resource.getrusage` for details on resource usage information. The *options* argument is the same as that provided to :func:`waitpid` and :func:`wait4`.
sv: Liknar :func:`waitpid`, förutom att inget process-ID-argument anges och en tupel med tre element som innehåller barnets process-ID, avslutningsstatus och information om resursanvändning returneras. Se :func:`resource.getrusage` för detaljer om information om resursanvändning. Argumentet *options* är detsamma som det som anges i :func:`waitpid` och :func:`wait4`.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exitcode.
sv: :func:`waitstatus_to_exitcode` kan användas för att konvertera utgångsstatus till en utgångskod.

source: Similar to :func:`waitpid`, except a 3-element tuple, containing the child's process id, exit status indication, and resource usage information is returned. Refer to :func:`resource.getrusage` for details on resource usage information. The arguments to :func:`wait4` are the same as those provided to :func:`waitpid`.
sv: Liknar :func:`waitpid`, förutom att en tupel med tre element returneras, som innehåller barnets process-ID, avslutningsstatusindikation och information om resursanvändning. Se :func:`resource.getrusage` för detaljer om information om resursanvändning. Argumenten till :func:`wait4` är desamma som de som anges till :func:`waitpid`.

source: These are the possible values for *idtype* in :func:`waitid`. They affect how *id* is interpreted:
sv: Detta är de möjliga värdena för *idtype* i :func:`waitid`. De påverkar hur *id* tolkas:

source: :data:`!P_PID` - wait for the child whose PID is *id*.
sv: :data:`!P_PID` - vänta på det barn vars PID är *id*.

source: :data:`!P_PGID` - wait for any child whose progress group ID is *id*.
sv: :data:`!P_PGID` - vänta på alla barn vars progressgrupp-ID är *id*.

source: :data:`!P_ALL` - wait for any child; *id* is ignored.
sv: :data:`!P_ALL` - vänta på valfritt barn; *id* ignoreras.

source: :data:`!P_PIDFD` - wait for the child identified by the file descriptor *id* (a process file descriptor created with :func:`pidfd_open`).
sv: :data:`!P_PIDFD` - vänta på det barn som identifieras av filbeskrivaren *id* (en processfilbeskrivare som skapats med :func:`pidfd_open`).

source: :data:`!P_PIDFD` is only available on Linux >= 5.4.
sv: :data:`!P_PIDFD` är endast tillgängligt på Linux >= 5.4.

source: The :data:`!P_PIDFD` constant.
sv: Konstanten :data:`!P_PIDFD`.

source: This *options* flag for :func:`waitpid`, :func:`wait3`, :func:`wait4`, and :func:`waitid` causes child processes to be reported if they have been continued from a job control stop since they were last reported.
sv: Denna *options*-flagga för :func:`waitpid`, :func:`wait3`, :func:`wait4` och :func:`waitd` gör att underordnade processer rapporteras om de har fortsatt från ett jobbkontrollstopp sedan de senast rapporterades.

source: This *options* flag for :func:`waitid` causes child processes that have terminated to be reported.
sv: Denna *options*-flagga för :func:`waitid` gör att barnprocesser som har avslutats rapporteras.

source: The other ``wait*`` functions always report children that have terminated, so this option is not available for them.
sv: De andra ``wait*``-funktionerna rapporterar alltid barn som har avslutats, så det här alternativet är inte tillgängligt för dem.

source: This *options* flag for :func:`waitid` causes child processes that have been stopped by the delivery of a signal to be reported.
sv: Denna *options*-flagga för :func:`waitid` gör att barnprocesser som har stoppats genom att en signal har levererats rapporteras.

source: This option is not available for the other ``wait*`` functions.
sv: Detta alternativ är inte tillgängligt för de andra funktionerna i ``wait*``.

source: This *options* flag for :func:`waitpid`, :func:`wait3`, and :func:`wait4` causes child processes to also be reported if they have been stopped but their current state has not been reported since they were stopped.
sv: Denna *options*-flagga för :func:`waitpid`, :func:`wait3` och :func:`wait4` gör att barnprocesser också rapporteras om de har stoppats men deras aktuella tillstånd inte har rapporterats sedan de stoppades.

source: This option is not available for :func:`waitid`.
sv: Detta alternativ är inte tillgängligt för :func:`waitid`.

source: This *options* flag causes :func:`waitpid`, :func:`wait3`, :func:`wait4`, and :func:`waitid` to return right away if no child process status is available immediately.
sv: Denna *options*-flagga gör att :func:`waitpid`, :func:`wait3`, :func:`wait4` och :func:`waitd` returneras direkt om ingen status för barnprocesser är tillgänglig omedelbart.

source: This *options* flag causes :func:`waitid` to leave the child in a waitable state, so that a later :func:`!wait*` call can be used to retrieve the child status information again.
sv: Denna *options*-flagga gör att :func:`waitid` lämnar barnet i ett vänteläge, så att ett senare :func:`!wait*`-anrop kan användas för att hämta barnets statusinformation igen.

source: These are the possible values for :attr:`!si_code` in the result returned by :func:`waitid`.
sv: Det här är de möjliga värdena för :attr:`!si_code` i resultatet som returneras av :func:`waitid`.

source: Added :data:`CLD_KILLED` and :data:`CLD_STOPPED` values.
sv: Lagt till värdena :data:`CLD_KILLED` och :data:`CLD_STOPPED`.

source: Convert a wait status to an exit code.
sv: Konvertera en väntestatus till en exitkod.

source: On Unix:
sv: På Unix:

source: If the process exited normally (if ``WIFEXITED(status)`` is true), return the process exit status (return ``WEXITSTATUS(status)``): result greater than or equal to 0.
sv: Om processen avslutades på normalt sätt (om ``WIFEXITED(status)`` är sant), returneras processens avslutningsstatus (return ``WEXITSTATUS(status)``): resultat större än eller lika med 0.

source: If the process was terminated by a signal (if ``WIFSIGNALED(status)`` is true), return ``-signum`` where *signum* is the number of the signal that caused the process to terminate (return ``-WTERMSIG(status)``): result less than 0.
sv: Om processen avslutades av en signal (om ``WIFSIGNALED(status)`` är true), returnera ``-signum`` där *signum* är numret på den signal som orsakade att processen avslutades (returnera ``-WTERMSIG(status)``): resultat mindre än 0.

source: Otherwise, raise a :exc:`ValueError`.
sv: I annat fall, skapa ett :exc:`ValueError`.

source: On Windows, return *status* shifted right by 8 bits.
sv: I Windows returneras *status* högerförskjutet med 8 bitar.

source: On Unix, if the process is being traced or if :func:`waitpid` was called with :data:`WUNTRACED` option, the caller must first check if ``WIFSTOPPED(status)`` is true. This function must not be called if ``WIFSTOPPED(status)`` is true.
sv: Under Unix, om processen spåras eller om :func:`waitpid` anropades med :data:`WUNTRACED` som alternativ, måste anroparen först kontrollera om ``WIFSTOPPED(status)`` är sant. Denna funktion får inte anropas om ``WIFSTOPPED(status)`` är sant.

source: :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG` functions.
sv: :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG` funktioner.

source: The following functions take a process status code as returned by :func:`system`, :func:`wait`, or :func:`waitpid` as a parameter. They may be used to determine the disposition of a process.
sv: Följande funktioner tar en processstatuskod som returneras av :func:`system`, :func:`wait` eller :func:`waitpid` som parameter. De kan användas för att avgöra vad som händer med en process.

source: Return ``True`` if a core dump was generated for the process, otherwise return ``False``.
sv: Returnerar ``True`` om en kärndump genererades för processen, annars returneras ``False``.

source: This function should be employed only if :func:`WIFSIGNALED` is true.
sv: Denna funktion bör endast användas om :func:`WIFSIGNALED` är true.

source: Return ``True`` if a stopped child has been resumed by delivery of :const:`~signal.SIGCONT` (if the process has been continued from a job control stop), otherwise return ``False``.
sv: Returnerar ``True`` om ett stoppat barn har återupptagits genom leverans av :const:`~signal.SIGCONT` (om processen har fortsatt från ett jobbkontrollstopp), annars returneras ``False``.

source: See :data:`WCONTINUED` option.
sv: Se alternativet :data:`WCONTINUED`.

source: Return ``True`` if the process was stopped by delivery of a signal, otherwise return ``False``.
sv: Returnerar ``True`` om processen stoppades genom att en signal levererades, annars returneras ``False``.

source: :func:`WIFSTOPPED` only returns ``True`` if the :func:`waitpid` call was done using :data:`WUNTRACED` option or when the process is being traced (see :manpage:`ptrace(2)`).
sv: :func:`WIFSTOPPED` returnerar endast ``True`` om :func:`waitpid`-anropet gjordes med :data:`WUNTRACED`-alternativet eller när processen spåras (se :manpage:`ptrace(2)`).

source: Return ``True`` if the process was terminated by a signal, otherwise return ``False``.
sv: Returnerar ``True`` om processen avslutades av en signal, annars returneras ``False``.

source: Return ``True`` if the process exited terminated normally, that is, by calling ``exit()`` or ``_exit()``, or by returning from ``main()``; otherwise return ``False``.
sv: Returnerar ``True`` om processen avslutades normalt, det vill säga genom att anropa ``exit()`` eller ``_exit()``, eller genom att återvända från ``main()``; annars returneras ``False``.

source: Return the process exit status.
sv: Returnerar processens exitstatus.

source: This function should be employed only if :func:`WIFEXITED` is true.
sv: Denna funktion bör endast användas om :func:`WIFEXITED` är true.

source: Return the signal which caused the process to stop.
sv: Returnera den signal som fick processen att stanna.

source: This function should be employed only if :func:`WIFSTOPPED` is true.
sv: Denna funktion bör endast användas om :func:`WIFSTOPPED` är true.

source: Return the number of the signal that caused the process to terminate.
sv: Returnerar numret på den signal som fick processen att avslutas.

source: Interface to the scheduler
sv: Gränssnitt till schemaläggaren

source: These functions control how a process is allocated CPU time by the operating system. They are only available on some Unix platforms. For more detailed information, consult your Unix manpages.
sv: Dessa funktioner styr hur en process tilldelas CPU-tid av operativsystemet. De är endast tillgängliga på vissa Unix-plattformar. För mer detaljerad information, se Unix manpages.

source: The following scheduling policies are exposed if they are supported by the operating system.
sv: Följande schemaläggningsprinciper exponeras om de stöds av operativsystemet.

source: The default scheduling policy.
sv: Standardpolicy för schemaläggning.

source: Scheduling policy for CPU-intensive processes that tries to preserve interactivity on the rest of the computer.
sv: Schemaläggningspolicy för CPU-intensiva processer som försöker bevara interaktiviteten på resten av datorn.

source: Scheduling policy for tasks with deadline constraints.
sv: Schemaläggningspolicy för uppgifter med tidsbegränsningar.

source: Scheduling policy for extremely low priority background tasks.
sv: Schemaläggningspolicy för bakgrundsuppgifter med extremt låg prioritet.

source: Alias for :data:`SCHED_OTHER`.
sv: Alias för :data:`SCHED_OTHER`.

source: Scheduling policy for sporadic server programs.
sv: Schemaläggningspolicy för sporadiska serverprogram.

source: A First In First Out scheduling policy.
sv: Först in, först ut är principen för schemaläggning.

source: A round-robin scheduling policy.
sv: En policy för schemaläggning enligt round-robin-principen.

source: This flag can be OR'ed with any other scheduling policy. When a process with this flag set forks, its child's scheduling policy and priority are reset to the default.
sv: Denna flagga kan OR:as med vilken annan schemaläggningspolicy som helst. När en process med den här flaggan aktiverad förgrenar sig, återställs dess barns schemaläggningspolicy och prioritet till standardvärdet.

source: This class represents tunable scheduling parameters used in :func:`sched_setparam`, :func:`sched_setscheduler`, and :func:`sched_getparam`. It is immutable.
sv: Denna klass representerar inställbara schemaläggningsparametrar som används i :func:`sched_setparam`, :func:`sched_setscheduler` och :func:`sched_getparam`. Den är oföränderlig.

source: At the moment, there is only one possible parameter:
sv: För närvarande finns det bara en möjlig parameter:

source: The scheduling priority for a scheduling policy.
sv: Schemaläggningsprioritet för en schemaläggningspolicy.

source: Get the minimum priority value for *policy*. *policy* is one of the scheduling policy constants above.
sv: Hämta det lägsta prioritetsvärdet för *policy*. *policy* är en av policykonstanterna för schemaläggning ovan.

source: Get the maximum priority value for *policy*. *policy* is one of the scheduling policy constants above.
sv: Hämta det högsta prioritetsvärdet för *policy*. *policy* är en av policykonstanterna för schemaläggning ovan.

source: Set the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. *policy* is one of the scheduling policy constants above. *param* is a :class:`sched_param` instance.
sv: Ställ in schemaläggningspolicyn för processen med PID *pid*. En *pid* på 0 betyder att det är den anropande processen. *policy* är en av policykonstanterna för schemaläggning ovan. *param* är en instans av :class:`sched_param`.

source: Return the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. The result is one of the scheduling policy constants above.
sv: Returnerar schemaläggningspolicyn för processen med PID *pid*. En *pid* på 0 betyder att det är den anropande processen. Resultatet är en av schemaläggningspolicykonstanterna ovan.

source: Set the scheduling parameters for the process with PID *pid*. A *pid* of 0 means the calling process. *param* is a :class:`sched_param` instance.
sv: Ställ in schemaläggningsparametrarna för processen med PID *pid*. En *pid* på 0 betyder att det är den anropande processen. *param* är en instans av :class:`sched_param`.

source: Return the scheduling parameters as a :class:`sched_param` instance for the process with PID *pid*. A *pid* of 0 means the calling process.
sv: Returnerar schemaläggningsparametrarna som en :class:`sched_param`-instans för processen med PID *pid*. En *pid* på 0 betyder att det är den anropande processen.

source: Return the round-robin quantum in seconds for the process with PID *pid*. A *pid* of 0 means the calling process.
sv: Returnerar round-robin-kvantumet i sekunder för processen med PID *pid*. En *pid* på 0 betyder att det är den anropande processen.

source: Voluntarily relinquish the CPU. See :manpage:`sched_yield(2)` for details.
sv: Överlämnar frivilligt processorn. Se :manpage:`sched_yield(2)` för mer information.

source: Restrict the process with PID *pid* (or the current process if zero) to a set of CPUs. *mask* is an iterable of integers representing the set of CPUs to which the process should be restricted.
sv: Begränsa processen med PID *pid* (eller den aktuella processen om den är noll) till en uppsättning processorer. *mask* är en iterabel av heltal som representerar den uppsättning processorer som processen ska begränsas till.

source: Return the set of CPUs the process with PID *pid* is restricted to.
sv: Returnera uppsättningen CPU:er som processen med PID *pid* är begränsad till.

source: If *pid* is zero, return the set of CPUs the calling thread of the current process is restricted to.
sv: Om *pid* är noll, returneras den uppsättning CPU:er som den anropande tråden i den aktuella processen är begränsad till.

source: See also the :func:`process_cpu_count` function.
sv: Se även funktionen :func:`process_cpu_count`.

source: Miscellaneous System Information
sv: Diverse systeminformation

source: Return string-valued system configuration values. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given as the keys of the ``confstr_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
sv: Returnerar strängvärderade systemkonfigurationsvärden. *name* anger det konfigurationsvärde som ska hämtas; det kan vara en sträng som är namnet på ett definierat systemvärde; dessa namn anges i ett antal standarder (POSIX, Unix 95, Unix 98 m.fl.). Vissa plattformar definierar även ytterligare namn. De namn som är kända av värdoperativsystemet anges som nycklar i ordlistan ``confstr_names``. För konfigurationsvariabler som inte ingår i denna mappning accepteras också att *name* ersätts med ett heltal.

source: If the configuration value specified by *name* isn't defined, ``None`` is returned.
sv: Om konfigurationsvärdet som anges av *name* inte är definierat returneras ``None``.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``confstr_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
sv: Om *name* är en sträng och inte är känd, genereras :exc:`ValueError`. Om ett specifikt värde för *name* inte stöds av värdsystemet, även om det ingår i ``confstr_names``, genereras ett :exc:`OSError` med :const:`errno.EINVAL` som felnummer.

source: Dictionary mapping names accepted by :func:`confstr` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
sv: Ordbok som mappar namn som accepteras av :func:`confstr` till de heltalsvärden som definieras för dessa namn av värdoperativsystemet. Detta kan användas för att bestämma den uppsättning namn som är kända av systemet.

source: Return the number of logical CPUs in the **system**. Returns ``None`` if undetermined.
sv: Returnerar antalet logiska processorer i **systemet**. Returnerar ``None`` om det inte är fastställt.

source: The :func:`process_cpu_count` function can be used to get the number of logical CPUs usable by the calling thread of the **current process**.
sv: Funktionen :func:`process_cpu_count` kan användas för att få fram antalet logiska processorer som kan användas av den anropande tråden i den **aktuella processen**.

source: If :option:`-X cpu_count <-X>` is given or :envvar:`PYTHON_CPU_COUNT` is set, :func:`cpu_count` returns the overridden value *n*.
sv: Om :option:`-X cpu_count <-X>` anges eller om :envvar:`PYTHON_CPU_COUNT` anges, returnerar :func:`cpu_count` det åsidosatta värdet *n*.

source: Return the number of processes in the system run queue averaged over the last 1, 5, and 15 minutes or raises :exc:`OSError` if the load average was unobtainable.
sv: Returnerar antalet processer i systemets körkö i genomsnitt under de senaste 1, 5 och 15 minuterna eller ger :exc:`OSError` om belastningsgenomsnittet inte kunde erhållas.

source: Get the number of logical CPUs usable by the calling thread of the **current process**. Returns ``None`` if undetermined. It can be less than :func:`cpu_count` depending on the CPU affinity.
sv: Hämta antalet logiska processorer som kan användas av den anropande tråden i den **aktuella processen**. Returnerar ``None`` om det inte är fastställt. Det kan vara mindre än :func:`cpu_count` beroende på CPU-affinitet.

source: The :func:`cpu_count` function can be used to get the number of logical CPUs in the **system**.
sv: Funktionen :func:`cpu_count` kan användas för att få fram antalet logiska processorer i **systemet**.

source: If :option:`-X cpu_count <-X>` is given or :envvar:`PYTHON_CPU_COUNT` is set, :func:`process_cpu_count` returns the overridden value *n*.
sv: Om :option:`-X cpu_count <-X>` anges eller om :envvar:`PYTHON_CPU_COUNT` anges, returnerar :func:`process_cpu_count` det åsidosatta värdet *n*.

source: See also the :func:`sched_getaffinity` function.
sv: Se även funktionen :func:`sched_getaffinity`.

source: Return integer-valued system configuration values. If the configuration value specified by *name* isn't defined, ``-1`` is returned. The comments regarding the *name* parameter for :func:`confstr` apply here as well; the dictionary that provides information on the known names is given by ``sysconf_names``.
sv: Returnerar heltalsvärderade systemkonfigurationsvärden. Om konfigurationsvärdet som anges av *name* inte är definierat, returneras ``-1``. Kommentarerna om parametern *name* för :func:`confstr` gäller även här; ordlistan som ger information om de kända namnen finns i ``sysconf_names``.

source: Dictionary mapping names accepted by :func:`sysconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
sv: Ordbok som mappar namn som accepteras av :func:`sysconf` till de heltalsvärden som värdoperativsystemet definierar för dessa namn. Detta kan användas för att bestämma den uppsättning namn som är kända av systemet.

source: Add ``'SC_MINSIGSTKSZ'`` name.
sv: Lägg till namnet ``'SC_MINSIGSTKSZ'``.

source: The following data values are used to support path manipulation operations. These are defined for all platforms.
sv: Följande datavärden används för att stödja operationer för manipulering av sökvägen. Dessa är definierade för alla plattformar.

source: Higher-level operations on pathnames are defined in the :mod:`os.path` module.
sv: Operationer på högre nivå för sökvägar definieras i modulen :mod:`os.path`.

source: The constant string used by the operating system to refer to the current directory. This is ``'.'`` for Windows and POSIX. Also available via :mod:`os.path`.
sv: Den konstanta sträng som används av operativsystemet för att hänvisa till den aktuella katalogen. Detta är ``'.'`` för Windows och POSIX. Finns även tillgänglig via :mod:`os.path`.
