Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: However, if the :const:`TFD_TIMER_ABSTIME` flag is set, the timer will fire when the timer's clock (set by *clockid* in :func:`timerfd_create`) reaches *initial* seconds.
sv: Men om flaggan :const:`TFD_TIMER_ABSTIME` är inställd kommer timern att starta när timerns klocka (inställd av *clockid* i :func:`timerfd_create`) når *initial* sekunder.

source: The timer's interval is set by the *interval* :py:class:`float`. If *interval* is zero, the timer only fires once, on the initial expiration. If *interval* is greater than zero, the timer fires every time *interval* seconds have elapsed since the previous expiration. If *interval* is less than zero, it raises :class:`OSError` with ``errno`` set to :const:`errno.EINVAL`
sv: Timerns intervall ställs in av *interval* :py:class:`float`. Om *interval* är noll utlöses timern bara en gång, vid det första utgångstillfället. Om *interval* är större än noll avfyras timern varje gång *interval* sekunder har förflutit sedan föregående expiration. Om *interval* är mindre än noll, utlöses :class:`OSError` med ``errno`` satt till :const:`errno.EINVAL`

source: If the :const:`TFD_TIMER_CANCEL_ON_SET` flag is set along with :const:`TFD_TIMER_ABSTIME` and the clock for this timer is :const:`time.CLOCK_REALTIME`, the timer is marked as cancelable if the real-time clock is changed discontinuously. Reading the descriptor is aborted with the error ECANCELED.
sv: Om flaggan :const:`TFD_TIMER_CANCEL_ON_SET` är inställd tillsammans med :const:`TFD_TIMER_ABSTIME` och klockan för denna timer är :const:`time.CLOCK_REALTIME`, markeras timern som avbrytbar om realtidsklockan ändras diskontinuerligt. Läsningen av deskriptorn avbryts med felmeddelandet ECANCELED.

source: Linux manages system clock as UTC. A daylight-savings time transition is done by changing time offset only and doesn't cause discontinuous system clock change.
sv: Linux hanterar systemklockan som UTC. En övergång till sommartid görs endast genom att ändra tidsförskjutningen och orsakar inte en diskontinuerlig ändring av systemklockan.

source: Discontinuous system clock change will be caused by the following events:
sv: Diskontinuerlig systemklockändring kommer att orsakas av följande händelser:

source: ``clock_settime``
sv: ``klocka_inställningstid``

source: set the system date and time by ``date`` command
sv: ställa in systemets datum och tid med kommandot ``date``

source: Return a two-item tuple of (``next_expiration``, ``interval``) from the previous timer state, before this function executed.
sv: Returnerar en tupel med två punkter (``next_expiration``, ``interval``) från föregående timerstatus, innan denna funktion utfördes.

source: :manpage:`timerfd_create(2)`, :manpage:`timerfd_settime(2)`, :manpage:`settimeofday(2)`, :manpage:`clock_settime(2)`, and :manpage:`date(1)`.
sv: :manpage:`timerfd_create(2)`, :manpage:`timerfd_settime(2)`, :manpage:`settimeofday(2)`, :manpage:`clock_settime(2)` och :manpage:`date(1)`.

source: Similar to :func:`timerfd_settime`, but use time as nanoseconds. This function operates the same interval timer as :func:`timerfd_settime`.
sv: Liknar :func:`timerfd_settime`, men använder tiden som nanosekunder. Denna funktion styr samma intervalltimer som :func:`timerfd_settime`.

source: Return a two-item tuple of floats (``next_expiration``, ``interval``).
sv: Returnerar en tupel av floats med två objekt (``next_expiration``, ``interval``).

source: ``next_expiration`` denotes the relative time until next the timer next fires, regardless of if the :const:`TFD_TIMER_ABSTIME` flag is set.
sv: ``next_expiration`` anger den relativa tiden tills nästa gång timern startar, oavsett om flaggan :const:`TFD_TIMER_ABSTIME` är inställd.

source: ``interval`` denotes the timer's interval. If zero, the timer will only fire once, after ``next_expiration`` seconds have elapsed.
sv: ``interval`` anger timerns intervall. Om noll, kommer timern bara att starta en gång, efter att ``next_expiration`` sekunder har gått.

source: Similar to :func:`timerfd_gettime`, but return time as nanoseconds.
sv: Liknar :func:`timerfd_gettime`, men returnerar tiden som nanosekunder.

source: A flag for the :func:`timerfd_create` function, which sets the :const:`O_NONBLOCK` status flag for the new timer file descriptor. If :const:`TFD_NONBLOCK` is not set as a flag, :func:`read` blocks.
sv: En flagga för funktionen :func:`timerfd_create`, som sätter statusflaggan :const:`O_NONBLOCK` för den nya timer-filbeskrivaren. Om :const:`TFD_NONBLOCK` inte sätts som en flagga, blockeras :func:`read`.

source: A flag for the :func:`timerfd_create` function, If :const:`TFD_CLOEXEC` is set as a flag, set close-on-exec flag for new file descriptor.
sv: En flagga för funktionen :func:`timerfd_create`, Om :const:`TFD_CLOEXEC` anges som en flagga, anges flaggan close-on-exec för den nya filbeskrivaren.

source: A flag for the :func:`timerfd_settime` and :func:`timerfd_settime_ns` functions. If this flag is set, *initial* is interpreted as an absolute value on the timer's clock (in UTC seconds or nanoseconds since the Unix Epoch).
sv: En flagga för funktionerna :func:`timerfd_settime` och :func:`timerfd_settime_ns`. Om denna flagga är inställd tolkas *initial* som ett absolut värde på timerns klocka (i UTC-sekunder eller nanosekunder sedan Unix-epoken).

source: A flag for the :func:`timerfd_settime` and :func:`timerfd_settime_ns` functions along with :const:`TFD_TIMER_ABSTIME`. The timer is cancelled when the time of the underlying clock changes discontinuously.
sv: En flagga för funktionerna :func:`timerfd_settime` och :func:`timerfd_settime_ns` tillsammans med :const:`TFD_TIMER_ABSTIME`. Timern avbryts när tiden för den underliggande klockan ändras diskontinuerligt.

source: Linux extended attributes
sv: Linux utökade attribut

source: These functions are all available on Linux only.
sv: Alla dessa funktioner är endast tillgängliga under Linux.

source: Return the value of the extended filesystem attribute *attribute* for *path*. *attribute* can be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is str, it is encoded with the filesystem encoding.
sv: Returnerar värdet på det utökade filsystemattributet *attribute* för *path*. *attribute* kan vara bytes eller str (direkt eller indirekt genom :class:`PathLike`-gränssnittet). Om det är str kodas det med filsystemets kodning.

source: Raises an :ref:`auditing event <auditing>` ``os.getxattr`` with arguments ``path``, ``attribute``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.getxattr`` med argumenten ``path``, ``attribute``.

source: Accepts a :term:`path-like object` for *path* and *attribute*.
sv: Accepterar en :term:`sökvägsliknande objekt` för *sökväg* och *attribut*.

source: Return a list of the extended filesystem attributes on *path*. The attributes in the list are represented as strings decoded with the filesystem encoding. If *path* is ``None``, :func:`listxattr` will examine the current directory.
sv: Returnerar en lista över de utökade filsystemattributen på *path*. Attributen i listan representeras som strängar avkodade med filsystemets kodning. Om *sökväg* är ``None`` kommer :func:`listxattr` att undersöka den aktuella katalogen.

source: Raises an :ref:`auditing event <auditing>` ``os.listxattr`` with argument ``path``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.listxattr`` med argumentet ``path``.

source: Removes the extended filesystem attribute *attribute* from *path*. *attribute* should be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is a string, it is encoded with the :term:`filesystem encoding and error handler`.
sv: Tar bort det utökade filsystemattributet *attribute* från *path*. *attribute* bör vara bytes eller str (direkt eller indirekt genom :class:`PathLike`-gränssnittet). Om det är en sträng, kodas den med :term:`filsystemkodning och felhantering`.

source: Raises an :ref:`auditing event <auditing>` ``os.removexattr`` with arguments ``path``, ``attribute``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.removexattr`` med argumenten ``path``, ``attribute``.

source: Set the extended filesystem attribute *attribute* on *path* to *value*. *attribute* must be a bytes or str with no embedded NULs (directly or indirectly through the :class:`PathLike` interface). If it is a str, it is encoded with the :term:`filesystem encoding and error handler`. *flags* may be :data:`XATTR_REPLACE` or :data:`XATTR_CREATE`. If :data:`XATTR_REPLACE` is given and the attribute does not exist, ``ENODATA`` will be raised. If :data:`XATTR_CREATE` is given and the attribute already exists, the attribute will not be created and ``EEXISTS`` will be raised.
sv: Ställ in det utökade filsystemattributet *attribute* på *path* till *value*. *attribute* måste vara en bytes eller str utan inbäddade NUL (direkt eller indirekt genom :class:`PathLike`-gränssnittet). Om det är en str kodas den med :term:`filsystemets kodning och felhantering`. *flags* kan vara :data:`XATTR_REPLACE` eller :data:`XATTR_CREATE`. Om :data:`XATTR_REPLACE` anges och attributet inte finns, kommer ``ENODATA`` att uppstå. Om :data:`XATTR_CREATE` anges och attributet redan existerar, kommer attributet inte att skapas och ``EEXISTS`` kommer att visas.

source: A bug in Linux kernel versions less than 2.6.39 caused the flags argument to be ignored on some filesystems.
sv: En bugg i Linux-kärnversioner mindre än 2.6.39 gjorde att flags-argumentet ignorerades på vissa filsystem.

source: Raises an :ref:`auditing event <auditing>` ``os.setxattr`` with arguments ``path``, ``attribute``, ``value``, ``flags``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.setxattr`` med argumenten ``path``, ``attribute``, ``value``, ``flags``.

source: The maximum size the value of an extended attribute can be. Currently, this is 64 KiB on Linux.
sv: Den maximala storlek som värdet för ett utökat attribut kan ha. För närvarande är detta 64 KiB under Linux.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must create an attribute.
sv: Detta är ett möjligt värde för flags-argumentet i :func:`setxattr`. Det indikerar att operationen måste skapa ett attribut.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must replace an existing attribute.
sv: Detta är ett möjligt värde för flags-argumentet i :func:`setxattr`. Det indikerar att operationen måste ersätta ett befintligt attribut.

source: Process Management
sv: Processhantering

source: These functions may be used to create and manage processes.
sv: Dessa funktioner kan användas för att skapa och hantera processer.

source: The various :func:`exec\* <execl>` functions take a list of arguments for the new program loaded into the process. In each case, the first of these arguments is passed to the new program as its own name rather than as an argument a user may have typed on a command line. For the C programmer, this is the ``argv[0]`` passed to a program's :c:func:`main`. For example, ``os.execv('/bin/echo', ['foo', 'bar'])`` will only print ``bar`` on standard output; ``foo`` will seem to be ignored.
sv: De olika funktionerna :func:`exec\* <execl>` tar en lista med argument för det nya program som laddas in i processen. I varje fall skickas det första av dessa argument till det nya programmet som dess eget namn snarare än som ett argument som en användare kan ha skrivit in på en kommandorad. För C-programmeraren är detta ``argv[0]`` som skickas till ett programs :c:func:`main`. Till exempel kommer ``os.execv('/bin/echo', ['foo', 'bar'])`` bara att skriva ut ``bar`` på standardutdata; ``foo`` verkar ignoreras.

source: Generate a :const:`SIGABRT` signal to the current process. On Unix, the default behavior is to produce a core dump; on Windows, the process immediately returns an exit code of ``3``. Be aware that calling this function will not call the Python signal handler registered for :const:`SIGABRT` with :func:`signal.signal`.
sv: Genererar en :const:`SIGABRT`-signal till den aktuella processen. På Unix är standardbeteendet att producera en kärndump; på Windows returnerar processen omedelbart en utgångskod på ``3``. Tänk på att anrop av denna funktion inte kommer att anropa Python-signalhanteraren som registrerats för :const:`SIGABRT` med :func:`signal.signal`.

source: Add a path to the DLL search path.
sv: Lägg till en sökväg till DLL-sökvägen.

source: This search path is used when resolving dependencies for imported extension modules (the module itself is resolved through :data:`sys.path`), and also by :mod:`ctypes`.
sv: Den här sökvägen används när man fastställer beroenden för importerade tilläggsmoduler (själva modulen fastställs med hjälp av :data:`sys.path`), och även av :mod:`ctypes`.

source: Remove the directory by calling **close()** on the returned object or using it in a :keyword:`with` statement.
sv: Ta bort katalogen genom att anropa **close()** på det returnerade objektet eller genom att använda det i en :keyword:`with`-sats.

source: See the `Microsoft documentation <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ for more information about how DLLs are loaded.
sv: Se Microsofts dokumentation <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ för mer information om hur DLL:er laddas.

source: Raises an :ref:`auditing event <auditing>` ``os.add_dll_directory`` with argument ``path``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.add_dll_directory`` med argumentet ``path``.

source: Previous versions of CPython would resolve DLLs using the default behavior for the current process. This led to inconsistencies, such as only sometimes searching :envvar:`PATH` or the current working directory, and OS functions such as ``AddDllDirectory`` having no effect.
sv: Tidigare versioner av CPython löste DLL:er med hjälp av standardbeteendet för den aktuella processen. Detta ledde till inkonsekvenser, som att bara ibland söka i :envvar:`PATH` eller den aktuella arbetskatalogen, och OS-funktioner som ``AddDllDirectory`` hade ingen effekt.

source: In 3.8, the two primary ways DLLs are loaded now explicitly override the process-wide behavior to ensure consistency. See the :ref:`porting notes <bpo-36085-whatsnew>` for information on updating libraries.
sv: I 3.8 åsidosätter de två primära sätten som DLL:er laddas på nu uttryckligen det processomfattande beteendet för att säkerställa konsekvens. Se :ref:``porting notes <bpo-36085-whatsnew>` för information om uppdatering av bibliotek.

source: These functions all execute a new program, replacing the current process; they do not return. On Unix, the new executable is loaded into the current process, and will have the same process id as the caller. Errors will be reported as :exc:`OSError` exceptions.
sv: Alla dessa funktioner exekverar ett nytt program som ersätter den aktuella processen; de returnerar inte. På Unix laddas den nya körbara filen in i den aktuella processen och får samma process-ID som den som anropar. Fel kommer att rapporteras som :exc:`OSError`-undantag.

source: The current process is replaced immediately. Open file objects and descriptors are not flushed, so if there may be data buffered on these open files, you should flush them using :func:`sys.stdout.flush` or :func:`os.fsync` before calling an :func:`exec\* <execl>` function.
sv: Den aktuella processen ersätts omedelbart. Öppna filobjekt och deskriptorer spolas inte, så om det kan finnas data buffrade på dessa öppna filer bör du spola dem med hjälp av :func:`sys.stdout.flush` eller :func:`os.fsync` innan du anropar en :func:`exec\* <execl>`-funktion.

source: The "l" and "v" variants of the :func:`exec\* <execl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`!execl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process should start with the name of the command being run, but this is not enforced.
sv: "l"- och "v"-varianterna av :func:`exec\* <execl>`-funktionerna skiljer sig åt i hur kommandoradsargument skickas. "l"-varianterna är kanske enklast att arbeta med om antalet parametrar är fast när koden skrivs; de enskilda parametrarna blir helt enkelt ytterligare parametrar till :func:`!execl\*`-funktionerna. "v"-varianterna är bra när antalet parametrar är variabelt, där argumenten skickas i en lista eller tupel som parametern *args*. I båda fallen bör argumenten till barnprocessen börja med namnet på det kommando som körs, men detta är inte tvingande.

source: The variants which include a "p" near the end (:func:`execlp`, :func:`execlpe`, :func:`execvp`, and :func:`execvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`exec\*e <execl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`execl`, :func:`execle`, :func:`execv`, and :func:`execve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path. Relative paths must include at least one slash, even on Windows, as plain names will not be resolved.
sv: De varianter som innehåller ett "p" i slutet (:func:`execlp`, :func:`execlpe`, :func:`execvp` och :func:`execvpe`) använder miljövariabeln :envvar:`PATH` för att hitta programmet *fil*. När miljön ersätts (med någon av :func:`exec\*e <execl>`-varianterna, som beskrivs i nästa stycke), används den nya miljön som källa för variabeln :envvar:`PATH`. De andra varianterna, :func:`execl`, :func:`execle`, :func:`execv` och :func:`execve`, använder inte variabeln :envvar:`PATH` för att hitta den körbara filen; *path* måste innehålla en lämplig absolut eller relativ sökväg. Relativa sökvägar måste innehålla minst ett snedstreck, även under Windows, eftersom vanliga namn inte kommer att lösas upp.

source: For :func:`execle`, :func:`execlpe`, :func:`execve`, and :func:`execvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (these are used instead of the current process' environment); the functions :func:`execl`, :func:`execlp`, :func:`execv`, and :func:`execvp` all cause the new process to inherit the environment of the current process.
sv: För :func:`execle`, :func:`execlpe`, :func:`execve` och :func:`execvpe` (notera att alla dessa slutar på "e") måste parametern *env* vara en mappning som används för att definiera miljövariablerna för den nya processen (dessa används istället för den aktuella processens miljö); funktionerna :func:`execl`, :func:`execlp`, :func:`execv` och :func:`execvp` gör alla att den nya processen ärver den aktuella processens miljö.

source: For :func:`execve` on some platforms, *path* may also be specified as an open file descriptor. This functionality may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_fd`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
sv: För :func:`execve` på vissa plattformar kan *path* också anges som en öppen filbeskrivare. Denna funktionalitet kanske inte stöds på din plattform; du kan kontrollera om den är tillgänglig eller inte med hjälp av :data:`os.supports_fd`. Om den inte är tillgänglig kommer användningen av den att ge upphov till ett :exc:`NotImplementedError`.

source: Raises an :ref:`auditing event <auditing>` ``os.exec`` with arguments ``path``, ``args``, ``env``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.exec`` med argumenten ``path``, ``args``, ``env``.

source: Added support for specifying *path* as an open file descriptor for :func:`execve`.
sv: Lagt till stöd för att ange *path* som en öppen filbeskrivare för :func:`execve`.

source: Exit the process with status *n*, without calling cleanup handlers, flushing stdio buffers, etc.
sv: Avsluta processen med status *n*, utan att anropa rensningshanterare, rensa stdio-buffertar etc.

source: The standard way to exit is :func:`sys.exit(n) <sys.exit>`. :func:`!_exit` should normally only be used in the child process after a :func:`fork`.
sv: Det vanliga sättet att avsluta är :func:`sys.exit(n) <sys.exit>`. :func:`!_exit` bör normalt bara användas i barnprocessen efter en :func:`fork`.

source: The following exit codes are defined and can be used with :func:`_exit`, although they are not required. These are typically used for system programs written in Python, such as a mail server's external command delivery program.
sv: Följande utgångskoder är definierade och kan användas med :func:`_exit`, även om de inte är obligatoriska. Dessa används vanligtvis för systemprogram som är skrivna i Python, t.ex. en e-postservers program för leverans av externa kommandon.

source: Some of these may not be available on all Unix platforms, since there is some variation. These constants are defined where they are defined by the underlying platform.
sv: Vissa av dessa kanske inte är tillgängliga på alla Unix-plattformar, eftersom det finns en viss variation. Dessa konstanter definieras där de definieras av den underliggande plattformen.

source: Exit code that means no error occurred. May be taken from the defined value of ``EXIT_SUCCESS`` on some platforms. Generally has a value of zero.
sv: Exit-kod som betyder att inget fel inträffade. Kan hämtas från det definierade värdet för ``EXIT_SUCCESS`` på vissa plattformar. Har i allmänhet värdet noll.

source: Exit code that means the command was used incorrectly, such as when the wrong number of arguments are given.
sv: Exit-kod som betyder att kommandot användes felaktigt, t.ex. när fel antal argument anges.

source: Exit code that means the input data was incorrect.
sv: Exit-kod som betyder att indata var felaktiga.

source: Exit code that means an input file did not exist or was not readable.
sv: Exit-kod som betyder att en inmatningsfil inte fanns eller inte var läsbar.

source: Exit code that means a specified user did not exist.
sv: Exitkod som innebär att en angiven användare inte fanns.

source: Exit code that means a specified host did not exist.
sv: Exitkod som betyder att en angiven värd inte fanns.

source: Exit code that means that a required service is unavailable.
sv: Exitkod som innebär att en önskad tjänst inte är tillgänglig.

source: Exit code that means an internal software error was detected.
sv: Exitkod som betyder att ett internt programvarufel har upptäckts.

source: Exit code that means an operating system error was detected, such as the inability to fork or create a pipe.
sv: Exitkod som betyder att ett operativsystemfel har upptäckts, t.ex. att det inte går att förgrena eller skapa en pipe.

source: Exit code that means some system file did not exist, could not be opened, or had some other kind of error.
sv: Exit-kod som betyder att en systemfil inte fanns, inte kunde öppnas eller hade något annat fel.

source: Exit code that means a user specified output file could not be created.
sv: Exitkod som innebär att en användarspecificerad utdatafil inte kunde skapas.

source: Exit code that means that an error occurred while doing I/O on some file.
sv: Exit-kod som betyder att ett fel inträffade när I/O gjordes på en fil.
