Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: :func:`utime` takes two optional parameters, *times* and *ns*. These specify the times set on *path* and are used as follows:
sv: :func:`utime` tar två valfria parametrar, *times* och *ns*. Dessa anger de tider som ställs in på *path* och används på följande sätt:

source: If *ns* is specified, it must be a 2-tuple of the form ``(atime_ns, mtime_ns)`` where each member is an int expressing nanoseconds.
sv: Om *ns* anges måste det vara en 2-tupel av formen ``(atime_ns, mtime_ns)`` där varje medlem är en int som uttrycker nanosekunder.

source: If *times* is not ``None``, it must be a 2-tuple of the form ``(atime, mtime)`` where each member is an int or float expressing seconds.
sv: Om *times* inte är ``None`` måste det vara en 2-tupel av formen ``(atime, mtime)`` där varje medlem är en int eller float som uttrycker sekunder.

source: If *times* is ``None`` and *ns* is unspecified, this is equivalent to specifying ``ns=(atime_ns, mtime_ns)`` where both times are the current time.
sv: Om *times* är ``None`` och *ns* är ospecificerad, är detta likvärdigt med att ange ``ns=(atime_ns, mtime_ns)`` där båda tiderna är aktuell tid.

source: It is an error to specify tuples for both *times* and *ns*.
sv: Det är fel att ange tupler för både *times* och *ns*.

source: Note that the exact times you set here may not be returned by a subsequent :func:`~os.stat` call, depending on the resolution with which your operating system records access and modification times; see :func:`~os.stat`. The best way to preserve exact times is to use the *st_atime_ns* and *st_mtime_ns* fields from the :func:`os.stat` result object with the *ns* parameter to :func:`utime`.
sv: Observera att de exakta tider som du anger här kanske inte returneras av ett efterföljande anrop av :func:`~os.stat`, beroende på med vilken upplösning operativsystemet registrerar åtkomst- och ändringstider; se :func:`~os.stat`. Det bästa sättet att bevara exakta tider är att använda fälten *st_atime_ns* och *st_mtime_ns* från resultatobjektet :func:`os.stat` med parametern *ns* till :func:`utime`.

source: Raises an :ref:`auditing event <auditing>` ``os.utime`` with arguments ``path``, ``times``, ``ns``, ``dir_fd``.
sv: Startar en :ref:`auditing-händelse <auditing>` ``os.utime`` med argumenten ``path``, ``times``, ``ns``, ``dir_fd``.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd*, *follow_symlinks*, and *ns* parameters.
sv: Stöd har lagts till för att ange *path* som en öppen filbeskrivare och parametrarna *dir_fd*, *follow_symlinks* och *ns*.

source: Generate the file names in a directory tree by walking the tree either top-down or bottom-up. For each directory in the tree rooted at directory *top* (including *top* itself), it yields a 3-tuple ``(dirpath, dirnames, filenames)``.
sv: Genererar filnamnen i ett katalogträd genom att gå igenom trädet antingen uppifrån och ned eller nerifrån och upp. För varje katalog i trädet som har sin rot i katalogen *top* (inklusive *top* själv) ger det en 3-tupel ``(dirpath, dirnames, filenames)``.

source: *dirpath* is a string, the path to the directory. *dirnames* is a list of the names of the subdirectories in *dirpath* (including symlinks to directories, and excluding ``'.'`` and ``'..'``). *filenames* is a list of the names of the non-directory files in *dirpath*. Note that the names in the lists contain no path components. To get a full path (which begins with *top*) to a file or directory in *dirpath*, do ``os.path.join(dirpath, name)``. Whether or not the lists are sorted depends on the file system. If a file is removed from or added to the *dirpath* directory during generating the lists, whether a name for that file be included is unspecified.
sv: *dirpath* är en sträng som anger sökvägen till katalogen. *dirnames* är en lista med namnen på underkatalogerna i *dirpath* (inklusive sym-länkar till kataloger och exklusive ``'.'`` och ``'..'``). *filenames* är en lista med namnen på de filer som inte finns i kataloger i *dirpath*. Observera att namnen i listorna inte innehåller några sökvägskomponenter. För att få en fullständig sökväg (som börjar med *top*) till en fil eller katalog i *dirpath*, gör ``os.path.join(dirpath, name)``. Huruvida listorna sorteras eller inte beror på filsystemet. Om en fil tas bort från eller läggs till i katalogen *dirpath* när listorna genereras, är det ospecificerat om ett namn för den filen ska inkluderas.

source: If optional argument *topdown* is ``True`` or not specified, the triple for a directory is generated before the triples for any of its subdirectories (directories are generated top-down). If *topdown* is ``False``, the triple for a directory is generated after the triples for all of its subdirectories (directories are generated bottom-up). No matter the value of *topdown*, the list of subdirectories is retrieved before the tuples for the directory and its subdirectories are generated.
sv: Om det valfria argumentet *topdown* är ``True`` eller inte anges, genereras trippeln för en katalog före tripplarna för någon av dess underkataloger (kataloger genereras uppifrån och ned). Om *topdown* är ``False`` genereras trippeln för en katalog efter tripplarna för alla dess underkataloger (kataloger genereras nedifrån och upp). Oavsett värdet på *topdown* hämtas listan med underkataloger innan tripplarna för katalogen och dess underkataloger genereras.

source: When *topdown* is ``True``, the caller can modify the *dirnames* list in-place (perhaps using :keyword:`del` or slice assignment), and :func:`walk` will only recurse into the subdirectories whose names remain in *dirnames*; this can be used to prune the search, impose a specific order of visiting, or even to inform :func:`walk` about directories the caller creates or renames before it resumes :func:`walk` again. Modifying *dirnames* when *topdown* is ``False`` has no effect on the behavior of the walk, because in bottom-up mode the directories in *dirnames* are generated before *dirpath* itself is generated.
sv: När *topdown* är ``True`` kan den som anropar ändra *dirnames*-listan på plats (kanske med hjälp av :keyword:`del` eller slice assignment), och :func:`walk` kommer bara att söka i de underkataloger vars namn finns kvar i *dirnames*; detta kan användas för att begränsa sökningen, införa en specifik besöksordning eller till och med för att informera :func:`walk` om kataloger som den som anropar skapar eller byter namn på innan den återupptar :func:`walk` igen. Att ändra *dirnames* när *topdown* är ``False`` har ingen effekt på hur vandringen går till, eftersom katalogerna i *dirnames* i bottom-up-läge genereras innan *dirpath* själv genereras.

source: By default, errors from the :func:`scandir` call are ignored. If optional argument *onerror* is specified, it should be a function; it will be called with one argument, an :exc:`OSError` instance. It can report the error to continue with the walk, or raise the exception to abort the walk. Note that the filename is available as the ``filename`` attribute of the exception object.
sv: Som standard ignoreras fel från anropet av :func:`scandir`. Om det valfria argumentet *onerror* anges bör det vara en funktion; den kommer att anropas med ett argument, en :exc:`OSError`-instans. Den kan rapportera felet för att fortsätta med vandringen, eller lyfta upp undantaget för att avbryta vandringen. Observera att filnamnet är tillgängligt som attributet ``filename`` för undantagsobjektet.

source: By default, :func:`walk` will not walk down into symbolic links that resolve to directories. Set *followlinks* to ``True`` to visit directories pointed to by symlinks, on systems that support them.
sv: Som standard kommer :func:`walk` inte att gå ner i symboliska länkar som leder till kataloger. Sätt *followlinks* till ``True`` för att besöka kataloger som symboliska länkar pekar på, på system som stöder dem.

source: Be aware that setting *followlinks* to ``True`` can lead to infinite recursion if a link points to a parent directory of itself. :func:`walk` does not keep track of the directories it visited already.
sv: Tänk på att om *followlinks* sätts till ``True`` kan det leda till oändlig rekursion om en länk pekar på en överordnad katalog till sig själv. :func:`walk` håller inte reda på de kataloger som den redan har besökt.

source: If you pass a relative pathname, don't change the current working directory between resumptions of :func:`walk`. :func:`walk` never changes the current directory, and assumes that its caller doesn't either.
sv: Om du skickar ett relativt söknamn, ändra inte den aktuella arbetskatalogen mellan upprepningar av :func:`walk`. :func:`walk` ändrar aldrig den aktuella katalogen och antar att dess anropare inte gör det heller.

source: This example displays the number of bytes taken by non-directory files in each directory under the starting directory, except that it doesn't look under any ``__pycache__`` subdirectory::
sv: I det här exemplet visas antalet byte som tas upp av filer som inte är katalogfiler i varje katalog under startkatalogen, förutom att det inte tittar under någon underkatalog ``__pycache__``::

source: In the next example (simple implementation of :func:`shutil.rmtree`), walking the tree bottom-up is essential, :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
sv: I nästa exempel (enkel implementation av :func:`shutil.rmtree`) är det viktigt att gå igenom trädet nedifrån och upp, :func:`rmdir` tillåter inte att en katalog tas bort innan den är tom::

source: Raises an :ref:`auditing event <auditing>` ``os.walk`` with arguments ``top``, ``topdown``, ``onerror``, ``followlinks``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.walk`` med argumenten ``top``, ``topdown``, ``onerror``, ``followlinks``.

source: This function now calls :func:`os.scandir` instead of :func:`os.listdir`, making it faster by reducing the number of calls to :func:`os.stat`.
sv: Den här funktionen anropar nu :func:`os.scandir` istället för :func:`os.listdir`, vilket gör den snabbare genom att minska antalet anrop till :func:`os.stat`.

source: This behaves exactly like :func:`walk`, except that it yields a 4-tuple ``(dirpath, dirnames, filenames, dirfd)``, and it supports ``dir_fd``.
sv: Detta beter sig precis som :func:`walk`, förutom att det ger en 4-tupel ``(dirpath, dirnames, filenames, dirfd)``, och det stöder ``dir_fd``.

source: *dirpath*, *dirnames* and *filenames* are identical to :func:`walk` output, and *dirfd* is a file descriptor referring to the directory *dirpath*.
sv: *dirpath*, *dirnames* och *filenames* är identiska med :func:`walk`-utdata, och *dirfd* är en filbeskrivare som hänvisar till katalogen *dirpath*.

source: This function always supports :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`. Note however that, unlike other functions, the :func:`fwalk` default value for *follow_symlinks* is ``False``.
sv: Den här funktionen stöder alltid :ref:`sökvägar som är relativa till katalogbeskrivare <dir_fd>` och :ref:`inte följa symlinks <follow_symlinks>`. Observera dock att, till skillnad från andra funktioner, är :func:`fwalk` standardvärde för *follow_symlinks* ``False``.

source: Since :func:`fwalk` yields file descriptors, those are only valid until the next iteration step, so you should duplicate them (e.g. with :func:`dup`) if you want to keep them longer.
sv: Eftersom :func:`fwalk` ger filbeskrivningar är dessa endast giltiga till nästa iterationssteg, så du bör duplicera dem (t.ex. med :func:`dup`) om du vill behålla dem längre.

source: In the next example, walking the tree bottom-up is essential: :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
sv: I nästa exempel är det viktigt att gå igenom trädet nedifrån och upp: :func:`rmdir` tillåter inte att en katalog tas bort innan katalogen är tom::

source: Raises an :ref:`auditing event <auditing>` ``os.fwalk`` with arguments ``top``, ``topdown``, ``onerror``, ``follow_symlinks``, ``dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.fwalk`` med argumenten ``top``, ``topdown``, ``onerror``, ``follow_symlinks``, ``dir_fd``.

source: Added support for :class:`bytes` paths.
sv: Lagt till stöd för :class:`bytes`-sökvägar.

source: Create an anonymous file and return a file descriptor that refers to it. *flags* must be one of the ``os.MFD_*`` constants available on the system (or a bitwise ORed combination of them). By default, the new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
sv: Skapa en anonym fil och returnera en filbeskrivning som hänvisar till den. *flags* måste vara en av de ``os.MFD_*``-konstanter som finns tillgängliga i systemet (eller en bitvis OR-kombination av dem). Som standard är den nya filbeskrivaren :ref:`non-inherititable <fd_inheritance>`.

source: The name supplied in *name* is used as a filename and will be displayed as the target of the corresponding symbolic link in the directory ``/proc/self/fd/``. The displayed name is always prefixed with ``memfd:`` and serves only for debugging purposes. Names do not affect the behavior of the file descriptor, and as such multiple files can have the same name without any side effects.
sv: Namnet som anges i *name* används som filnamn och kommer att visas som mål för motsvarande symboliska länk i katalogen ``/proc/self/fd/``. Det visade namnet inleds alltid med ``memfd:`` och används endast i felsökningssyfte. Namnen påverkar inte filbeskrivarens beteende och därför kan flera filer ha samma namn utan några sidoeffekter.

source: These flags can be passed to :func:`memfd_create`.
sv: Dessa flaggor kan skickas till :func:`memfd_create`.

source: The ``MFD_HUGE*`` flags are only available since Linux 4.14.
sv: Flaggorna ``MFD_HUGE*`` är endast tillgängliga sedan Linux 4.14.

source: Create and return an event file descriptor. The file descriptors supports raw :func:`read` and :func:`write` with a buffer size of 8, :func:`~select.select`, :func:`~select.poll` and similar. See man page :manpage:`eventfd(2)` for more information. By default, the new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
sv: Skapa och returnera en händelsefilsbeskrivare. Filbeskrivarna stöder råa :func:`read` och :func:`write` med en buffertstorlek på 8, :func:`~select.select`, :func:`~select.poll` och liknande. Se man-sidan :manpage:`eventfd(2)` för mer information. Som standard är den nya filbeskrivaren :ref:`non-inheritable <fd_inheritance>`.

source: *initval* is the initial value of the event counter. The initial value must be a 32 bit unsigned integer. Please note that the initial value is limited to a 32 bit unsigned int although the event counter is an unsigned 64 bit integer with a maximum value of 2\ :sup:`64`\ -\ 2.
sv: *initval* är det initiala värdet för händelseräknaren. Det initiala värdet måste vara ett 32-bitars osignerat heltal. Observera att det initiala värdet är begränsat till ett 32 bitars osignerat int trots att händelseräknaren är ett 64 bitars osignerat heltal med ett maximalt värde på 2\ :sup:`64`\ -\\ 2.

source: *flags* can be constructed from :const:`EFD_CLOEXEC`, :const:`EFD_NONBLOCK`, and :const:`EFD_SEMAPHORE`.
sv: *flags* kan konstrueras från :const:`EFD_CLOEXEC`, :const:`EFD_NONBLOCK`, och :const:`EFD_SEMAPHORE`.

source: If :const:`EFD_SEMAPHORE` is specified and the event counter is non-zero, :func:`eventfd_read` returns 1 and decrements the counter by one.
sv: Om :const:`EFD_SEMAPHORE` anges och eventräknaren inte är noll, returnerar :func:`eventfd_read` 1 och minskar räknaren med ett.

source: If :const:`EFD_SEMAPHORE` is not specified and the event counter is non-zero, :func:`eventfd_read` returns the current event counter value and resets the counter to zero.
sv: Om :const:`EFD_SEMAPHORE` inte specificeras och händelseräknaren inte är noll, returnerar :func:`eventfd_read` det aktuella värdet för händelseräknaren och nollställer räknaren.

source: If the event counter is zero and :const:`EFD_NONBLOCK` is not specified, :func:`eventfd_read` blocks.
sv: Om händelseräknaren är noll och :const:`EFD_NONBLOCK` inte anges, blockeras :func:`eventfd_read`.

source: :func:`eventfd_write` increments the event counter. Write blocks if the write operation would increment the counter to a value larger than 2\ :sup:`64`\ -\ 2.
sv: :func:`eventfd_write` ökar räknaren för händelser. Write blockerar om skrivoperationen skulle öka räknaren till ett värde större än 2. :sup:`64`\ -\ 2.

source: Read value from an :func:`eventfd` file descriptor and return a 64 bit unsigned int. The function does not verify that *fd* is an :func:`eventfd`.
sv: Läser värde från en :func:`eventfd` filbeskrivare och returnerar ett 64 bitars osignerat int. Funktionen verifierar inte att *fd* är en :func:`eventfd`.

source: Add value to an :func:`eventfd` file descriptor. *value* must be a 64 bit unsigned int. The function does not verify that *fd* is an :func:`eventfd`.
sv: Lägger till ett värde till en :func:`eventfd` filbeskrivare. *value* måste vara ett 64-bitars osignerat int. Funktionen verifierar inte att *fd* är en :func:`eventfd`.

source: Set close-on-exec flag for new :func:`eventfd` file descriptor.
sv: Sätt flaggan close-on-exec för den nya filbeskrivaren :func:`eventfd`.

source: Set :const:`O_NONBLOCK` status flag for new :func:`eventfd` file descriptor.
sv: Sätt statusflaggan :const:`O_NONBLOCK` för den nya filbeskrivaren :func:`eventfd`.

source: Provide semaphore-like semantics for reads from an :func:`eventfd` file descriptor. On read the internal counter is decremented by one.
sv: Tillhandahåller semaforliknande semantik för läsningar från en :func:`eventfd`-filbeskrivning. Vid läsning decimeras den interna räknaren med ett.

source: Timer File Descriptors
sv: Deskriptorer för timerfil

source: These functions provide support for Linux's *timer file descriptor* API. Naturally, they are all only available on Linux.
sv: Dessa funktioner ger stöd för Linux *timer file descriptor* API. Naturligtvis är de alla endast tillgängliga på Linux.

source: Create and return a timer file descriptor (*timerfd*).
sv: Skapa och returnera en timerfilbeskrivning (*timerfd*).

source: The file descriptor returned by :func:`timerfd_create` supports:
sv: Den filbeskrivare som returneras av :func:`timerfd_create` stöder:

source: :func:`read`
sv: :func:`läsa`

source: The file descriptor's :func:`read` method can be called with a buffer size of 8. If the timer has already expired one or more times, :func:`read` returns the number of expirations with the host's endianness, which may be converted to an :class:`int` by ``int.from_bytes(x, byteorder=sys.byteorder)``.
sv: Filbeskrivarens metod :func:`read` kan anropas med en buffertstorlek på 8. Om timern redan har gått ut en eller flera gånger returnerar :func:`read` antalet utgångar med värdens endianness, som kan konverteras till en :class:`int` genom ``int.from_bytes(x, byteorder=sys.byteorder)``.

source: :func:`~select.select` and :func:`~select.poll` can be used to wait until timer expires and the file descriptor is readable.
sv: :func:`~select.select` och :func:`~select.poll` kan användas för att vänta tills timern löper ut och filbeskrivaren är läsbar.

source: *clockid* must be a valid :ref:`clock ID <time-clock-id-constants>`, as defined in the :py:mod:`time` module:
sv: *clockid* måste vara ett giltigt :ref:`clock ID <time-clock-id-constants>`, enligt definitionen i modulen :py:mod:`time`:

source: :const:`time.CLOCK_BOOTTIME` (Since Linux 3.15 for timerfd_create)
sv: :const:`time.CLOCK_BOOTTIME` (Sedan Linux 3.15 för timerfd_create)

source: If *clockid* is :const:`time.CLOCK_REALTIME`, a settable system-wide real-time clock is used. If system clock is changed, timer setting need to be updated. To cancel timer when system clock is changed, see :const:`TFD_TIMER_CANCEL_ON_SET`.
sv: Om *clockid* är :const:`time.CLOCK_REALTIME`, används en inställbar systemomfattande realtidsklocka. Om systemklockan ändras måste timerinställningen uppdateras. För att avbryta timern när systemklockan ändras, se :const:`TFD_TIMER_CANCEL_ON_SET`.

source: If *clockid* is :const:`time.CLOCK_MONOTONIC`, a non-settable monotonically increasing clock is used. Even if the system clock is changed, the timer setting will not be affected.
sv: Om *clockid* är :const:`time.CLOCK_MONOTONIC` används en monotont ökande klocka som inte kan ställas in. Även om systemklockan ändras kommer timerinställningen inte att påverkas.

source: If *clockid* is :const:`time.CLOCK_BOOTTIME`, same as :const:`time.CLOCK_MONOTONIC` except it includes any time that the system is suspended.
sv: Om *clockid* är :const:`time.CLOCK_BOOTTIME`, samma som :const:`time.CLOCK_MONOTONIC` förutom att det inkluderar all tid då systemet är avstängt.

source: The file descriptor's behaviour can be modified by specifying a *flags* value. Any of the following variables may used, combined using bitwise OR (the ``|`` operator):
sv: Filbeskrivarens beteende kan ändras genom att ange ett *flags*-värde. Någon av följande variabler kan användas, kombinerade med bitvis OR (operatorn ``|``):

source: If :const:`TFD_NONBLOCK` is not set as a flag, :func:`read` blocks until the timer expires. If it is set as a flag, :func:`read` doesn't block, but If there hasn't been an expiration since the last call to read, :func:`read` raises :class:`OSError` with ``errno`` is set to :const:`errno.EAGAIN`.
sv: Om :const:`TFD_NONBLOCK` inte är satt som flagga blockerar :func:`read` tills timern går ut. Om det är satt som en flagga blockerar inte :func:`read`, men om det inte har skett någon expiration sedan det senaste anropet till read, ger :func:`read` upphov till :class:`OSError` med ``errno`` satt till :const:`errno.EAGAIN`.

source: :const:`TFD_CLOEXEC` is always set by Python automatically.
sv: :const:`TFD_CLOEXEC` ställs alltid in automatiskt av Python.

source: The file descriptor must be closed with :func:`os.close` when it is no longer needed, or else the file descriptor will be leaked.
sv: Filbeskrivaren måste stängas med :func:`os.close` när den inte längre behövs, annars kommer filbeskrivaren att läcka ut.

source: The :manpage:`timerfd_create(2)` man page.
sv: Manuell sida för :manpage:`timerfd_create(2)`.

source: Alter a timer file descriptor's internal timer. This function operates the same interval timer as :func:`timerfd_settime_ns`.
sv: Ändrar en timerfilsbeskrivares interna timer. Denna funktion använder samma intervalltimer som :func:`timerfd_settime_ns`.

source: *fd* must be a valid timer file descriptor.
sv: *fd* måste vara en giltig timerfilsbeskrivare.

source: The timer's behaviour can be modified by specifying a *flags* value. Any of the following variables may used, combined using bitwise OR (the ``|`` operator):
sv: Timerns beteende kan ändras genom att ange ett *flags*-värde. Någon av följande variabler kan användas, kombinerade med bitvis OR (operatorn ``|``):

source: The timer is disabled by setting *initial* to zero (``0``). If *initial* is equal to or greater than zero, the timer is enabled. If *initial* is less than zero, it raises an :class:`OSError` exception with ``errno`` set to :const:`errno.EINVAL`
sv: Timern inaktiveras genom att *initial* sätts till noll (``0``). Om *initial* är lika med eller större än noll aktiveras timern. Om *initial* är mindre än noll, uppstår ett :class:`OSError` undantag med ``errno`` satt till :const:`errno.EINVAL`

source: By default the timer will fire when *initial* seconds have elapsed. (If *initial* is zero, timer will fire immediately.)
sv: Som standard startar timern när *initial* sekunder har passerat. (Om *initial* är noll startar timern omedelbart)
