Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: Close file descriptor *fd*.
sv: Stäng filbeskrivaren *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To close a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, use its :meth:`~io.IOBase.close` method.
sv: Denna funktion är avsedd för I/O på låg nivå och måste tillämpas på en filbeskrivare som returneras av :func:`os.open` eller :func:`pipe`. För att stänga ett "filobjekt" som returneras av den inbyggda funktionen :func:`open` eller av :func:`popen` eller :func:`fdopen`, använd dess :meth:`~io.IOBase.close` metod.

source: Close all file descriptors from *fd_low* (inclusive) to *fd_high* (exclusive), ignoring errors. Equivalent to (but much faster than)::
sv: Stänger alla filbeskrivare från *fd_low* (inklusive) till *fd_high* (exklusive), ignorerar fel. Motsvarar (men är mycket snabbare än)::

source: for fd in range(fd_low, fd_high): try: os.close(fd) except OSError: pass
sv: för fd i intervallet(fd_low, fd_high): försök: os.close(fd) utom OSError: passera

source: Copy *count* bytes from file descriptor *src*, starting from offset *offset_src*, to file descriptor *dst*, starting from offset *offset_dst*. If *offset_src* is ``None``, then *src* is read from the current position; respectively for *offset_dst*.
sv: Kopiera *count* bytes från filbeskrivaren *src*, med start från offset *offset_src*, till filbeskrivaren *dst*, med start från offset *offset_dst*. Om *offset_src* är ``None`` läses *src* från den aktuella positionen; motsvarande gäller för *offset_dst*.

source: In Linux kernel older than 5.3, the files pointed to by *src* and *dst* must reside in the same filesystem, otherwise an :exc:`OSError` is raised with :attr:`~OSError.errno` set to :const:`errno.EXDEV`.
sv: I Linuxkärnan äldre än 5.3 måste filerna som *src* och *dst* pekar på finnas i samma filsystem, annars uppstår ett :exc:`OSError` med :attr:`~OSError.errno` satt till :const:`errno.EXDEV`.

source: This copy is done without the additional cost of transferring data from the kernel to user space and then back into the kernel. Additionally, some filesystems could implement extra optimizations, such as the use of reflinks (i.e., two or more inodes that share pointers to the same copy-on-write disk blocks; supported file systems include btrfs and XFS) and server-side copy (in the case of NFS).
sv: Denna kopiering görs utan den extra kostnad som det innebär att överföra data från kärnan till användarutrymmet och sedan tillbaka till kärnan. Dessutom kan vissa filsystem implementera extra optimeringar, t.ex. användning av reflinks (dvs. två eller flera inoder som delar pekare till samma copy-on-write-diskblock; filsystem som stöds är bl.a. btrfs och XFS) och kopiering på serversidan (i fallet NFS).

source: The function copies bytes between two file descriptors. Text options, like the encoding and the line ending, are ignored.
sv: Funktionen kopierar bytes mellan två filbeskrivare. Textalternativ, som kodning och radavslut, ignoreras.

source: The return value is the amount of bytes copied. This could be less than the amount requested.
sv: Returvärdet är det antal byte som kopierats. Detta kan vara mindre än det begärda antalet.

source: On Linux, :func:`os.copy_file_range` should not be used for copying a range of a pseudo file from a special filesystem like procfs and sysfs. It will always copy no bytes and return 0 as if the file was empty because of a known Linux kernel issue.
sv: Under Linux bör :func:`os.copy_file_range` inte användas för att kopiera ett intervall av en pseudofil från ett speciellt filsystem som procfs och sysfs. Den kopierar alltid inga byte och returnerar 0 som om filen vore tom på grund av ett känt problem i Linux-kärnan.

source: Return a string describing the encoding of the device associated with *fd* if it is connected to a terminal; else return :const:`None`.
sv: Returnerar en sträng som beskriver kodningen för den enhet som är associerad med *fd* om den är ansluten till en terminal; annars returneras :const:`None`.

source: On Unix, if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, return ``'UTF-8'`` rather than the device encoding.
sv: På Unix, om :ref:`Python UTF-8 Mode <utf8-mode>` är aktiverat, returneras ``'UTF-8'`` istället för enhetens kodning.

source: On Unix, the function now implements the Python UTF-8 Mode.
sv: På Unix implementerar funktionen nu Pythons UTF-8-läge.

source: Return a duplicate of file descriptor *fd*. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
sv: Returnerar en duplikat av filbeskrivaren *fd*. Den nya filbeskrivaren är :ref:`icke-ärftlig <fd_ärftlighet>`.

source: On Windows, when duplicating a standard stream (0: stdin, 1: stdout, 2: stderr), the new file descriptor is :ref:`inheritable <fd_inheritance>`.
sv: I Windows, vid duplicering av en standardström (0: stdin, 1: stdout, 2: stderr), är den nya filbeskrivaren :ref:`inheritable <fd_inheritance>`.

source: The new file descriptor is now non-inheritable.
sv: Den nya filbeskrivaren är nu inte ärftlig.

source: Duplicate file descriptor *fd* to *fd2*, closing the latter first if necessary. Return *fd2*. The new file descriptor is :ref:`inheritable <fd_inheritance>` by default or non-inheritable if *inheritable* is ``False``.
sv: Duplicera filbeskrivaren *fd* till *fd2*, och stäng den senare först om det behövs. Returnera *fd2*. Den nya filbeskrivaren är :ref:`inheritable <fd_inheritance>` som standard eller icke-heritable om *inheritable* är ``False``.

source: Add the optional *inheritable* parameter.
sv: Lägg till den valfria parametern *inheritable*.

source: Return *fd2* on success. Previously, ``None`` was always returned.
sv: Returnerar *fd2* vid framgång. Tidigare returnerades alltid ``None``.

source: Change the mode of the file given by *fd* to the numeric *mode*. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(fd, mode)``.
sv: Ändra läget för filen som ges av *fd* till det numeriska *mode*. Se dokumentationen för :func:`chmod` för möjliga värden för *mode*. Från och med Python 3.3 är detta likvärdigt med ``os.chmod(fd, mode)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chmod`` with arguments ``path``, ``mode``, ``dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.chmod`` med argumenten ``path``, ``mode``, ``dir_fd``.

source: The function is limited on WASI, see :ref:`wasm-availability` for more information.
sv: Funktionen är begränsad på WASI, se :ref:`wasm-availability` för mer information.

source: Added support on Windows.
sv: Stöd för Windows har lagts till.

source: Change the owner and group id of the file given by *fd* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1. See :func:`chown`. As of Python 3.3, this is equivalent to ``os.chown(fd, uid, gid)``.
sv: Ändra ägar- och grupp-ID för filen som anges av *fd* till de numeriska värdena *uid* och *gid*. För att lämna ett av id:en oförändrat, sätt det till -1. Se :func:`chown`. Från och med Python 3.3 är detta likvärdigt med ``os.chown(fd, uid, gid)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chown`` with arguments ``path``, ``uid``, ``gid``, ``dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.chown`` med argumenten ``path``, ``uid``, ``gid``, ``dir_fd``.

source: Force write of file with filedescriptor *fd* to disk. Does not force update of metadata.
sv: Tvingar fram skrivning av fil med fildeskriptor *fd* till disk. Tvingar inte till uppdatering av metadata.

source: This function is not available on MacOS.
sv: Denna funktion är inte tillgänglig på MacOS.

source: Return system configuration information relevant to an open file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
sv: Returnerar information om systemkonfiguration som är relevant för en öppen fil. *name* anger det konfigurationsvärde som ska hämtas; det kan vara en sträng som är namnet på ett definierat systemvärde; dessa namn anges i ett antal standarder (POSIX.1, Unix 95, Unix 98 m.fl.). Vissa plattformar definierar även ytterligare namn. De namn som är kända av värdoperativsystemet anges i ordlistan ``pathconf_names``. För konfigurationsvariabler som inte ingår i denna mappning accepteras också att *name* ersätts med ett heltal.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``pathconf_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
sv: Om *name* är en sträng och inte är känd, genereras :exc:`ValueError`. Om ett specifikt värde för *name* inte stöds av värdsystemet, även om det ingår i ``pathconf_names``, genereras ett :exc:`OSError` med :const:`errno.EINVAL` som felnummer.

source: As of Python 3.3, this is equivalent to ``os.pathconf(fd, name)``.
sv: Från och med Python 3.3 är detta likvärdigt med ``os.pathconf(fd, name)``.

source: Get the status of the file descriptor *fd*. Return a :class:`stat_result` object.
sv: Hämta status för filbeskrivaren *fd*. Returnerar ett :class:`stat_result`-objekt.

source: As of Python 3.3, this is equivalent to ``os.stat(fd)``.
sv: Från och med Python 3.3 är detta likvärdigt med ``os.stat(fd)``.

source: The :func:`.stat` function.
sv: Funktionen :func:`.stat`.

source: Return information about the filesystem containing the file associated with file descriptor *fd*, like :func:`statvfs`. As of Python 3.3, this is equivalent to ``os.statvfs(fd)``.
sv: Returnerar information om filsystemet som innehåller filen som är associerad med filbeskrivaren *fd*, som :func:`statvfs`. Från och med Python 3.3 är detta ekvivalent med ``os.statvfs(fd)``.

source: Force write of file with filedescriptor *fd* to disk. On Unix, this calls the native :c:func:`!fsync` function; on Windows, the MS :c:func:`!_commit` function.
sv: Tvingar fram skrivning av fil med fildeskriptor *fd* till disk. På Unix anropar detta den inbyggda :c:func:`!fsync`-funktionen; på Windows anropar MS :c:func:`!_commit`-funktionen.

source: If you're starting with a buffered Python :term:`file object` *f*, first do ``f.flush()``, and then do ``os.fsync(f.fileno())``, to ensure that all internal buffers associated with *f* are written to disk.
sv: Om du börjar med ett buffrat Python :term:`filobjekt` *f*, gör först ``f.flush()``, och sedan ``os.fsync(f.fileno())``, för att säkerställa att alla interna buffertar som är associerade med *f* skrivs till disken.

source: Truncate the file corresponding to file descriptor *fd*, so that it is at most *length* bytes in size. As of Python 3.3, this is equivalent to ``os.truncate(fd, length)``.
sv: Trunkerar filen som motsvarar filbeskrivaren *fd*, så att den är högst *längd* byte stor. Från och med Python 3.3 är detta likvärdigt med ``os.truncate(fd, length)``.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``fd``, ``length``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.truncate`` med argumenten ``fd``, ``length``.

source: Added support for Windows
sv: Nytt stöd för Windows

source: Get the blocking mode of the file descriptor: ``False`` if the :data:`O_NONBLOCK` flag is set, ``True`` if the flag is cleared.
sv: Hämta blockeringsläget för filbeskrivaren: ``False`` om flaggan :data:`O_NONBLOCK`` är inställd, ``True`` om flaggan är avmarkerad.

source: See also :func:`set_blocking` and :meth:`socket.socket.setblocking`.
sv: Se även :func:`set_blocking` och :meth:`socket.socket.setblocking`.

source: On Windows, this function is limited to pipes.
sv: I Windows är den här funktionen begränsad till pipes.

source: Added support for pipes on Windows.
sv: Stöd för pipes i Windows har lagts till.

source: Grant access to the slave pseudo-terminal device associated with the master pseudo-terminal device to which the file descriptor *fd* refers. The file descriptor *fd* is not closed upon failure.
sv: Beviljar åtkomst till den pseudoterminalenhet för slavar som är associerad med den pseudoterminalenhet för master som fildeskriptorn *fd* hänvisar till. Filbeskrivaren *fd* stängs inte om den misslyckas.

source: Calls the C standard library function :c:func:`grantpt`.
sv: Anropar funktionen i C:s standardbibliotek :c:func:`grantpt`.

source: Return ``True`` if the file descriptor *fd* is open and connected to a tty(-like) device, else ``False``.
sv: Returnerar ``True`` om filbeskrivaren *fd* är öppen och ansluten till en tty(-liknande) enhet, annars ``False``.

source: Apply, test or remove a POSIX lock on an open file descriptor. *fd* is an open file descriptor. *cmd* specifies the command to use - one of :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` or :data:`F_TEST`. *len* specifies the section of the file to lock.
sv: Tillämpa, testa eller ta bort ett POSIX-lås på en öppen filbeskrivare. *fd* är en öppen filbeskrivare. *cmd* anger vilket kommando som ska användas - ett av :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` eller :data:`F_TEST`. *len* anger den del av filen som ska låsas.

source: Raises an :ref:`auditing event <auditing>` ``os.lockf`` with arguments ``fd``, ``cmd``, ``len``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.lockf`` med argumenten ``fd``, ``cmd``, ``len``.

source: Flags that specify what action :func:`lockf` will take.
sv: Flaggor som anger vilken åtgärd :func:`lockf` ska vidta.

source: Prepare the tty of which fd is a file descriptor for a new login session. Make the calling process a session leader; make the tty the controlling tty, the stdin, the stdout, and the stderr of the calling process; close fd.
sv: Förbered tty, där fd är en filbeskrivare, för en ny inloggningssession. Gör den anropande processen till en sessionsledare; gör tty till den kontrollerande tty, stdin, stdout och stderr för den anropande processen; stäng fd.

source: Set the current position of file descriptor *fd* to position *pos*, modified by *whence*, and return the new position in bytes relative to the start of the file. Valid values for *whence* are:
sv: Ställ in den aktuella positionen för filbeskrivaren *fd* till position *pos*, modifierad av *whence*, och returnera den nya positionen i byte i förhållande till filens början. Giltiga värden för *whence* är:

source: :const:`SEEK_SET` or ``0`` -- set *pos* relative to the beginning of the file
sv: :const:`SEEK_SET` eller ``0`` -- ställer in *pos* relativt början av filen

source: :const:`SEEK_CUR` or ``1`` -- set *pos* relative to the current file position
sv: :const:`SEEK_CUR` eller ``1`` -- ställa in *pos* relativt den aktuella filpositionen

source: :const:`SEEK_END` or ``2`` -- set *pos* relative to the end of the file
sv: :const:`SEEK_END` eller ``2`` -- ställer in *pos* relativt slutet av filen

source: :const:`SEEK_HOLE` -- set *pos* to the next data location, relative to *pos*
sv: :const:`SEEK_HOLE` -- sätter *pos* till nästa dataplats, relativt *pos*

source: :const:`SEEK_DATA` -- set *pos* to the next data hole, relative to *pos*
sv: :const:`SEEK_DATA` -- sätter *pos* till nästa datahål, relativt till *pos*

source: Add support for :const:`!SEEK_HOLE` and :const:`!SEEK_DATA`.
sv: Lägg till stöd för :const:`!SEEK_HOLE` och :const:`!SEEK_DATA`.

source: Parameters to the :func:`lseek` function and the :meth:`~io.IOBase.seek` method on :term:`file-like objects <file object>`, for whence to adjust the file position indicator.
sv: Parametrar till funktionen :func:`lseek` och metoden :meth:`~io.IOBase.seek` på :term:`filliknande objekt <file object>`, för att justera filpositionsindikatorn.

source: Adjust the file position relative to the beginning of the file.
sv: Justera filens position i förhållande till början av filen.

source: Adjust the file position relative to the current file position.
sv: Justera filens position i förhållande till den aktuella filpositionen.

source: Adjust the file position relative to the end of the file.
sv: Justera filens position i förhållande till slutet av filen.

source: Their values are 0, 1, and 2, respectively.
sv: Deras värden är 0, 1 respektive 2.

source: Parameters to the :func:`lseek` function and the :meth:`~io.IOBase.seek` method on :term:`file-like objects <file object>`, for seeking file data and holes on sparsely allocated files.
sv: Parametrar till :func:`lseek`-funktionen och :meth:`~io.IOBase.seek`-metoden på :term:`filliknande objekt <file object>`, för sökning av fildata och hål i glest allokerade filer.

source: Adjust the file offset to the next location containing data, relative to the seek position.
sv: Justera filoffset till nästa plats som innehåller data, relativt sökpositionen.

source: Adjust the file offset to the next location containing a hole, relative to the seek position. A hole is defined as a sequence of zeros.
sv: Justera filens offset till nästa plats som innehåller ett hål, i förhållande till sökpositionen. Ett hål definieras som en sekvens av nollor.

source: These operations only make sense for filesystems that support them.
sv: Dessa operationer är bara meningsfulla för filsystem som stöder dem.

source: Open the file *path* and set various flags according to *flags* and possibly its mode according to *mode*. When computing *mode*, the current umask value is first masked out. Return the file descriptor for the newly opened file. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
sv: Öppna filen *path* och sätt olika flaggor enligt *flags* och eventuellt dess mode enligt *mode*. Vid beräkning av *mode* maskeras först det aktuella umask-värdet bort. Returnera filbeskrivaren för den nyöppnade filen. Den nya filbeskrivaren är :ref:`non-inherititable <fd_inheritance>`.

source: For a description of the flag and mode values, see the C run-time documentation; flag constants (like :const:`O_RDONLY` and :const:`O_WRONLY`) are defined in the :mod:`os` module. In particular, on Windows adding :const:`O_BINARY` is needed to open files in binary mode.
sv: För en beskrivning av flagg- och lägesvärdena, se C-dokumentationen för körtid; flaggkonstanter (som :const:`O_RDONLY` och :const:`O_WRONLY`) definieras i modulen :mod:`os`. I Windows behövs i synnerhet tillägget :const:`O_BINARY` för att öppna filer i binärt läge.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
sv: Denna funktion kan stödja :ref:`sökvägar i förhållande till katalogbeskrivare <dir_fd>` med parametern *dir_fd*.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
sv: Utlöser en :ref:`auditing-händelse <auditing>``open`` med argumenten ``path``, ``mode``, ``flags``.

source: This function is intended for low-level I/O. For normal usage, use the built-in function :func:`open`, which returns a :term:`file object` with :meth:`~file.read` and :meth:`~file.write` methods (and many more). To wrap a file descriptor in a file object, use :func:`fdopen`.
sv: Denna funktion är avsedd för I/O på låg nivå. För normal användning, använd den inbyggda funktionen :func:`open`, som returnerar ett :term:`file-objekt` med metoderna :meth:`~file.read` och :meth:`~file.write` (och många fler). För att paketera en filbeskrivning i ett filobjekt, använd :func:`fdopen`.

source: Added the *dir_fd* parameter.
sv: Parametern *dir_fd* har lagts till.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
sv: Om systemanropet avbryts och signalhanteraren inte ger upphov till ett undantag, försöker funktionen nu göra om systemanropet istället för att ge upphov till ett :exc:`InterruptedError`-undantag (se :pep:`475` för förklaringen).

source: Accepts a :term:`path-like object`.
sv: Accepterar en :term:`path-liknande objekt`.

source: The following constants are options for the *flags* parameter to the :func:`~os.open` function. They can be combined using the bitwise OR operator ``|``. Some of them are not available on all platforms. For descriptions of their availability and use, consult the :manpage:`open(2)` manual page on Unix or `the MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ on Windows.
sv: Följande konstanter är alternativ för parametern *flags* till funktionen :func:`~os.open`. De kan kombineras med hjälp av den bitvisa OR-operatorn ``|``. Vissa av dem är inte tillgängliga på alla plattformar. För beskrivningar av deras tillgänglighet och användning, se manualsidan :manpage:`open(2)` på Unix eller `the MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ på Windows.

source: The above constants are available on Unix and Windows.
sv: Ovanstående konstanter är tillgängliga under Unix och Windows.

source: The above constants are only available on Unix.
sv: Ovanstående konstanter är endast tillgängliga under Unix.

source: Add :data:`O_CLOEXEC` constant.
sv: Lägg till :data:`O_CLOEXEC` konstant.

source: The above constants are only available on Windows.
sv: Ovanstående konstanter är endast tillgängliga under Windows.

source: The above constants are only available on macOS.
sv: Ovanstående konstanter är endast tillgängliga på macOS.

source: Add :data:`O_EVTONLY`, :data:`O_FSYNC`, :data:`O_SYMLINK` and :data:`O_NOFOLLOW_ANY` constants.
sv: Lägg till konstanterna :data:`O_EVTONLY`, :data:`O_FSYNC`, :data:`O_SYMLINK` och :data:`O_NOFOLLOW_ANY`.

source: The above constants are extensions and not present if they are not defined by the C library.
sv: Ovanstående konstanter är tillägg och finns inte med om de inte definieras av C-biblioteket.

source: Add :data:`O_PATH` on systems that support it. Add :data:`O_TMPFILE`, only available on Linux Kernel 3.11 or newer.
sv: Lägg till :data:`O_PATH` på system som stöder det. Lägg till :data:`O_TMPFILE`, endast tillgängligt på Linux Kernel 3.11 eller nyare.

source: Open a new pseudo-terminal pair. Return a pair of file descriptors ``(master, slave)`` for the pty and the tty, respectively. The new file descriptors are :ref:`non-inheritable <fd_inheritance>`. For a (slightly) more portable approach, use the :mod:`pty` module.
sv: Öppna ett nytt pseudoterminalpar. Returnera ett par filbeskrivare ``(master, slave)`` för pty respektive tty. De nya filbeskrivarna är :ref:``inte ärftliga <fd_arv>`. För ett (något) mer portabelt tillvägagångssätt, använd modulen :mod:`pty`.

source: The new file descriptors are now non-inheritable.
sv: De nya filbeskrivningarna är nu icke-ärftliga.

source: Create a pipe. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
sv: Skapa en pipe. Returnerar ett par filbeskrivare ``(r, w)`` som kan användas för läsning respektive skrivning. Den nya filbeskrivaren är :ref:``icke-ärftlig <fd_arvbarhet>`.
