Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: The constant string used by the operating system to refer to the parent directory. This is ``'..'`` for Windows and POSIX. Also available via :mod:`os.path`.
sv: Den konstanta sträng som används av operativsystemet för att hänvisa till den överordnade katalogen. Detta är ``'...'`` för Windows och POSIX. Finns även tillgänglig via :mod:`os.path`.

source: The character used by the operating system to separate pathname components. This is ``'/'`` for POSIX and ``'\\'`` for Windows. Note that knowing this is not sufficient to be able to parse or concatenate pathnames --- use :func:`os.path.split` and :func:`os.path.join` --- but it is occasionally useful. Also available via :mod:`os.path`.
sv: Tecknet som används av operativsystemet för att separera sökvägskomponenter. Detta är ``'/'`` för POSIX och ``'\\'`` för Windows. Observera att det inte är tillräckligt att känna till detta för att kunna analysera eller sammanfoga sökvägar --- använd :func:`os.path.split` och :func:`os.path.join` --- men det är ibland användbart. Finns även tillgängligt via :mod:`os.path`.

source: An alternative character used by the operating system to separate pathname components, or ``None`` if only one separator character exists. This is set to ``'/'`` on Windows systems where ``sep`` is a backslash. Also available via :mod:`os.path`.
sv: Ett alternativt tecken som används av operativsystemet för att separera sökvägsnamnets komponenter, eller ``None`` om det bara finns ett separatortecken. Detta är inställt på ``'/'`` på Windows-system där ``sep`` är en backslash. Finns även tillgängligt via :mod:`os.path`.

source: The character which separates the base filename from the extension; for example, the ``'.'`` in :file:`os.py`. Also available via :mod:`os.path`.
sv: Det tecken som skiljer basfilnamnet från tillägget, t.ex. ``'.'`` i :file:`os.py`. Finns även tillgängligt via :mod:`os.path`.

source: The character conventionally used by the operating system to separate search path components (as in :envvar:`PATH`), such as ``':'`` for POSIX or ``';'`` for Windows. Also available via :mod:`os.path`.
sv: Det tecken som används av operativsystemet för att separera sökvägskomponenter (som i :envvar:`PATH`), t.ex. ``':'`` för POSIX eller ``';'`` för Windows. Finns även tillgängligt via :mod:`os.path`.

source: The default search path used by :func:`exec\*p\* <execl>` and :func:`spawn\*p\* <spawnl>` if the environment doesn't have a ``'PATH'`` key. Also available via :mod:`os.path`.
sv: Den standardsökväg som används av :func:`exec\*p\* <execl>` och :func:`spawn\*p\* <spawnl>` om miljön inte har en ``'PATH'``-nyckel. Finns även tillgänglig via :mod:`os.path`.

source: The string used to separate (or, rather, terminate) lines on the current platform. This may be a single character, such as ``'\n'`` for POSIX, or multiple characters, for example, ``'\r\n'`` for Windows. Do not use *os.linesep* as a line terminator when writing files opened in text mode (the default); use a single ``'\n'`` instead, on all platforms.
sv: Den sträng som används för att separera (eller snarare avsluta) rader på den aktuella plattformen. Det kan vara ett enda tecken, t.ex. ``'\n'`` för POSIX, eller flera tecken, t.ex. ``'\r\n'`` för Windows. Använd inte *os.linesep* som radavslutare när du skriver filer som öppnas i textläge (standard); använd istället ett enda ``'\n'`` på alla plattformar.

source: The file path of the null device. For example: ``'/dev/null'`` for POSIX, ``'nul'`` for Windows. Also available via :mod:`os.path`.
sv: Filsökvägen till null-enheten. Till exempel: ``'/dev/null'`` för POSIX, ``'nul'`` för Windows. Finns även tillgänglig via :mod:`os.path`.

source: Flags for use with the :func:`~sys.setdlopenflags` and :func:`~sys.getdlopenflags` functions. See the Unix manual page :manpage:`dlopen(3)` for what the different flags mean.
sv: Flaggor för användning med funktionerna :func:`~sys.setdlopenflags` och :func:`~sys.getdlopenflags`. Se Unix manualsida :manpage:`dlopen(3)` för vad de olika flaggorna betyder.

source: Random numbers
sv: Slumptal

source: Get up to *size* random bytes. The function can return less bytes than requested.
sv: Hämta upp till *storlek* slumpmässiga byte. Funktionen kan returnera färre byte än vad som begärts.

source: These bytes can be used to seed user-space random number generators or for cryptographic purposes.
sv: Dessa byte kan användas för att starta slumptalsgeneratorer i användarutrymmet eller för kryptografiska ändamål.

source: ``getrandom()`` relies on entropy gathered from device drivers and other sources of environmental noise. Unnecessarily reading large quantities of data will have a negative impact on other users of the ``/dev/random`` and ``/dev/urandom`` devices.
sv: ``getrandom()`` förlitar sig på entropi som samlas in från enhetsdrivrutiner och andra källor till miljöbrus. Onödig läsning av stora mängder data kommer att ha en negativ inverkan på andra användare av enheterna ``/dev/random`` och ``/dev/urandom``.

source: The flags argument is a bit mask that can contain zero or more of the following values ORed together: :py:const:`os.GRND_RANDOM` and :py:data:`GRND_NONBLOCK`.
sv: Argumentet flags är en bitmask som kan innehålla noll eller flera av följande värden i OR-kombination: :py:const:`os.GRND_RANDOM` och :py:data:`GRND_NONBLOCK`.

source: See also the `Linux getrandom() manual page <https://man7.org/linux/man-pages/man2/getrandom.2.html>`_.
sv: Se även `Linux getrandom() manual page <https://man7.org/linux/man-pages/man2/getrandom.2.html>`_.

source: Return a bytestring of *size* random bytes suitable for cryptographic use.
sv: Returnerar en bytestring med *storlek* slumpmässiga bytes som lämpar sig för kryptografisk användning.

source: This function returns random bytes from an OS-specific randomness source. The returned data should be unpredictable enough for cryptographic applications, though its exact quality depends on the OS implementation.
sv: Denna funktion returnerar slumpmässiga bytes från en OS-specifik slumpkälla. Den returnerade datan bör vara tillräckligt oförutsägbar för kryptografiska tillämpningar, även om dess exakta kvalitet beror på OS-implementeringen.

source: On Linux, if the ``getrandom()`` syscall is available, it is used in blocking mode: block until the system urandom entropy pool is initialized (128 bits of entropy are collected by the kernel). See the :pep:`524` for the rationale. On Linux, the :func:`getrandom` function can be used to get random bytes in non-blocking mode (using the :data:`GRND_NONBLOCK` flag) or to poll until the system urandom entropy pool is initialized.
sv: På Linux, om syscall ``getrandom()`` är tillgängligt, används det i blockeringsläge: blockera tills systemets urandom-entropipool är initialiserad (128 bitar entropi samlas in av kärnan). Se :pep:`524` för förklaringen. På Linux kan funktionen :func:`getrandom` användas för att hämta slumpmässiga byte i icke-blockerande läge (med flaggan :data:`GRND_NONBLOCK`) eller för att polla tills systemets urandom-entropipool har initialiserats.

source: On a Unix-like system, random bytes are read from the ``/dev/urandom`` device. If the ``/dev/urandom`` device is not available or not readable, the :exc:`NotImplementedError` exception is raised.
sv: På ett Unix-liknande system läses slumpmässiga byte från enheten ``/dev/urandom``. Om enheten ``/dev/urandom`` inte är tillgänglig eller inte kan läsas, uppstår undantaget :exc:`NotImplementedError`.

source: On Windows, it will use ``BCryptGenRandom()``.
sv: I Windows används ``BCryptGenRandom()``.

source: The :mod:`secrets` module provides higher level functions. For an easy-to-use interface to the random number generator provided by your platform, please see :class:`random.SystemRandom`.
sv: Modulen :mod:`secrets` tillhandahåller funktioner på högre nivå. För ett lättanvänt gränssnitt till den slumptalsgenerator som tillhandahålls av din plattform, se :class:`random.SystemRandom`.

source: On Linux 3.17 and newer, the ``getrandom()`` syscall is now used when available. On OpenBSD 5.6 and newer, the C ``getentropy()`` function is now used. These functions avoid the usage of an internal file descriptor.
sv: På Linux 3.17 och nyare används nu syscallen ``getrandom()`` när den är tillgänglig. På OpenBSD 5.6 och nyare används nu C-funktionen ``getentropy()``. Dessa funktioner undviker användning av en intern filbeskrivare.

source: On Linux, if the ``getrandom()`` syscall blocks (the urandom entropy pool is not initialized yet), fall back on reading ``/dev/urandom``.
sv: På Linux, om ``getrandom()`` syscall blockerar (urandom entropi pool är inte initialiserad ännu), fall tillbaka på att läsa ``/dev/urandom``.

source: On Linux, ``getrandom()`` is now used in blocking mode to increase the security.
sv: På Linux används nu ``getrandom()`` i blockeringsläge för att öka säkerheten.

source: On Windows, ``BCryptGenRandom()`` is used instead of ``CryptGenRandom()`` which is deprecated.
sv: På Windows används ``BCryptGenRandom()`` istället för ``CryptGenRandom()`` som är föråldrad.

source: By default, when reading from ``/dev/random``, :func:`getrandom` blocks if no random bytes are available, and when reading from ``/dev/urandom``, it blocks if the entropy pool has not yet been initialized.
sv: Som standard blockeras :func:`getrandom` vid läsning från ``/dev/random`` om inga slumpmässiga byte finns tillgängliga, och vid läsning från ``/dev/urandom`` blockeras den om entropipoolen ännu inte har initialiserats.

source: If the :py:data:`GRND_NONBLOCK` flag is set, then :func:`getrandom` does not block in these cases, but instead immediately raises :exc:`BlockingIOError`.
sv: Om flaggan :py:data:`GRND_NONBLOCK` är inställd blockerar inte :func:`getrandom` i dessa fall, utan ger istället omedelbart upphov till :exc:`BlockingIOError`.

source: If this bit is set, then random bytes are drawn from the ``/dev/random`` pool instead of the ``/dev/urandom`` pool.
sv: Om denna bit är inställd dras slumpmässiga byte från ``/dev/random``-poolen istället för ``/dev/urandom``-poolen.

source: user
sv: användare

source: effective id
sv: effektiv id

source: group
sv: grupp

source: id of parent
sv: id för förälder

source: scheduling priority
sv: prioritet för schemaläggning

source: environment variables
sv: miljövariabler

source: setting
sv: inställningen

source: id, setting
sv: id, inställning

source: gethostname() (in module socket)
sv: gethostname() (i modul socket)

source: gethostbyaddr() (in module socket)
sv: gethostbyaddr() (i modul socket)

source: deleting
sv: radering

source: module
sv: modul

source: directory
sv: katalog

source: changing
sv: förändring

source: creating
sv: skapa

source: UNC paths
sv: UNC-sökvägar

source: and os.makedirs()
sv: och os.makedirs()

source: walking
sv: promenader

source: traversal
sv: genomgång

source: killing
sv: dödande

source: signalling
sv: signalering

source: . (dot)
sv: . (punkt)

source: in pathnames
sv: i sökvägsnamn

source: / (slash)
sv: / (snedstreck)

source: in pathnames (Windows)
sv: i sökvägsnamn (Windows)

source: : (colon)
sv: : (kolon)

source: path separator (POSIX)
sv: sökvägsseparator (POSIX)

source: ; (semicolon)
sv: ; (semikolon)
