Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: Exit code that means a temporary failure occurred. This indicates something that may not really be an error, such as a network connection that couldn't be made during a retryable operation.
sv: Exitkod som betyder att ett tillfälligt fel inträffade. Detta indikerar något som kanske inte egentligen är ett fel, t.ex. en nätverksanslutning som inte kunde upprättas under en operation som kan omprövas.

source: Exit code that means that a protocol exchange was illegal, invalid, or not understood.
sv: Exitkod som innebär att ett protokollutbyte var olagligt, ogiltigt eller inte förstods.

source: Exit code that means that there were insufficient permissions to perform the operation (but not intended for file system problems).
sv: Avslutningskod som innebär att det inte fanns tillräckliga behörigheter för att utföra åtgärden (men inte avsedd för filsystemsproblem).

source: Exit code that means that some kind of configuration error occurred.
sv: Exitkod som innebär att något slags konfigurationsfel har inträffat.

source: Exit code that means something like "an entry was not found".
sv: Utgångskod som betyder något i stil med "en post hittades inte".

source: Fork a child process. Return ``0`` in the child and the child's process id in the parent. If an error occurs :exc:`OSError` is raised.
sv: Fork en underordnad process. Returnerar ``0`` i barnet och barnets process-id i föräldern. Om ett fel uppstår :exc:`OSError` tas upp.

source: Note that some platforms including FreeBSD <= 6.3 and Cygwin have known issues when using ``fork()`` from a thread.
sv: Observera att vissa plattformar, inklusive FreeBSD <= 6.3 och Cygwin, har kända problem när ``fork()`` används från en tråd.

source: Raises an :ref:`auditing event <auditing>` ``os.fork`` with no arguments.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.fork`` utan argument.

source: If you use TLS sockets in an application calling ``fork()``, see the warning in the :mod:`ssl` documentation.
sv: Om du använder TLS-uttag i ett program som anropar ``fork()``, se varningen i :mod:`ssl`-dokumentationen.

source: On macOS the use of this function is unsafe when mixed with using higher-level system APIs, and that includes using :mod:`urllib.request`.
sv: På macOS är användningen av denna funktion osäker när den blandas med användning av system-API:er på högre nivå, och det inkluderar användning av :mod:`urllib.request`.

source: Calling ``fork()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
sv: Anrop av ``fork()`` i en subinterpreter stöds inte längre (:exc:`RuntimeError` uppstår).

source: If Python is able to detect that your process has multiple threads, :func:`os.fork` now raises a :exc:`DeprecationWarning`.
sv: Om Python kan upptäcka att din process har flera trådar, ger :func:`os.fork` nu upphov till en :exc:`DeprecationWarning`.

source: We chose to surface this as a warning, when detectable, to better inform developers of a design problem that the POSIX platform specifically notes as not supported. Even in code that *appears* to work, it has never been safe to mix threading with :func:`os.fork` on POSIX platforms. The CPython runtime itself has always made API calls that are not safe for use in the child process when threads existed in the parent (such as ``malloc`` and ``free``).
sv: Vi valde att ta upp detta som en varning, när det upptäcks, för att bättre informera utvecklare om ett designproblem som POSIX-plattformen specifikt noterar att det inte stöds. Även i kod som * verkar* fungera har det aldrig varit säkert att blanda trådning med :func:`os.fork` på POSIX-plattformar. Själva CPython-körtiden har alltid gjort API-anrop som inte är säkra att använda i barnprocessen när trådar fanns i föräldern (t.ex. ``malloc`` och ``free``).

source: Users of macOS or users of libc or malloc implementations other than those typically found in glibc to date are among those already more likely to experience deadlocks running such code.
sv: Användare av macOS eller användare av andra libc- eller malloc-implementationer än de som vanligtvis finns i glibc hittills är bland dem som redan är mer benägna att uppleva dödlägen när de kör sådan kod.

source: See `this discussion on fork being incompatible with threads <https://discuss.python.org/t/33555>`_ for technical details of why we're surfacing this longstanding platform compatibility problem to developers.
sv: Se `den här diskussionen om att fork är inkompatibel med trådar <https://discuss.python.org/t/33555>`_ för tekniska detaljer om varför vi tar upp detta långvariga problem med plattformskompatibilitet för utvecklare.

source: Fork a child process, using a new pseudo-terminal as the child's controlling terminal. Return a pair of ``(pid, fd)``, where *pid* is ``0`` in the child, the new child's process id in the parent, and *fd* is the file descriptor of the master end of the pseudo-terminal. For a more portable approach, use the :mod:`pty` module. If an error occurs :exc:`OSError` is raised.
sv: Fork en underordnad process, med en ny pseudoterminal som barnets kontrollterminal. Returnerar ett par ``(pid, fd)``, där *pid* är ``0`` i barnet, det nya barnets process-id i föräldern, och *fd* är filbeskrivaren för masteränden av pseudoterminalen. För en mer portabel metod, använd modulen :mod:`pty`. Om ett fel inträffar genereras :exc:`OSError`.

source: Raises an :ref:`auditing event <auditing>` ``os.forkpty`` with no arguments.
sv: Utlöser en :ref:``auditing event <auditing>` ``os.forkpty`` utan argument.

source: Calling ``forkpty()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
sv: Att anropa ``forkpty()`` i en subinterpreter stöds inte längre (:exc:`RuntimeError` utlöses).

source: If Python is able to detect that your process has multiple threads, this now raises a :exc:`DeprecationWarning`. See the longer explanation on :func:`os.fork`.
sv: Om Python kan upptäcka att din process har flera trådar, ger detta nu upphov till en :exc:`DeprecationWarning`. Se den längre förklaringen på :func:`os.fork`.

source: Send signal *sig* to the process *pid*. Constants for the specific signals available on the host platform are defined in the :mod:`signal` module.
sv: Skicka signal *sig* till processen *pid*. Konstanter för de specifika signaler som är tillgängliga på värdplattformen definieras i modulen :mod:`signal`.

source: Windows: The :const:`signal.CTRL_C_EVENT` and :const:`signal.CTRL_BREAK_EVENT` signals are special signals which can only be sent to console processes which share a common console window, e.g., some subprocesses. Any other value for *sig* will cause the process to be unconditionally killed by the TerminateProcess API, and the exit code will be set to *sig*.
sv: Windows: Signalerna :const:`signal.CTRL_C_EVENT` och :const:`signal.CTRL_BREAK_EVENT` är speciella signaler som endast kan skickas till konsolprocesser som delar ett gemensamt konsolfönster, t.ex. vissa subprocesser. Alla andra värden för *sig* leder till att processen ovillkorligen dödas av TerminateProcess API och utgångskoden sätts till *sig*.

source: See also :func:`signal.pthread_kill`.
sv: Se även :func:`signal.pthread_kill`.

source: Raises an :ref:`auditing event <auditing>` ``os.kill`` with arguments ``pid``, ``sig``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.kill`` med argumenten ``pid``, ``sig``.

source: Send the signal *sig* to the process group *pgid*.
sv: Skicka signalen *sig* till processgruppen *pgid*.

source: Raises an :ref:`auditing event <auditing>` ``os.killpg`` with arguments ``pgid``, ``sig``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.killpg`` med argumenten ``pgid``, ``sig``.

source: Add *increment* to the process's "niceness". Return the new niceness.
sv: Lägg till *ökning* till processens "niceness". Returnera den nya niceness.

source: Return a file descriptor referring to the process *pid* with *flags* set. This descriptor can be used to perform process management without races and signals.
sv: Returnerar en fildeskriptor som hänvisar till processen *pid* med *flags* inställt. Denna deskriptor kan användas för att utföra processhantering utan tävlingar och signaler.

source: See the :manpage:`pidfd_open(2)` man page for more details.
sv: Se :manpage:`pidfd_open(2)` man page för mer information.

source: This flag indicates that the file descriptor will be non-blocking. If the process referred to by the file descriptor has not yet terminated, then an attempt to wait on the file descriptor using :manpage:`waitid(2)` will immediately return the error :const:`~errno.EAGAIN` rather than blocking.
sv: Denna flagga indikerar att filbeskrivaren kommer att vara icke-blockerande. Om den process som filbeskrivaren refererar till ännu inte har avslutats, kommer ett försök att vänta på filbeskrivaren med :manpage:`waitid(2)` omedelbart att returnera felet :const:`~errno.EAGAIN` istället för att blockera.

source: Lock program segments into memory. The value of *op* (defined in ``<sys/lock.h>``) determines which segments are locked.
sv: Låser in programsegment i minnet. Värdet på *op* (definierat i ``<sys/lock.h>``) bestämmer vilka segment som ska låsas.

source: Open a pipe to or from command *cmd*. The return value is an open file object connected to the pipe, which can be read or written depending on whether *mode* is ``'r'`` (default) or ``'w'``. The *buffering* argument have the same meaning as the corresponding argument to the built-in :func:`open` function. The returned file object reads or writes text strings rather than bytes.
sv: Öppnar en pipe till eller från kommandot *cmd*. Returvärdet är ett öppet filobjekt anslutet till pipen, som kan läsas eller skrivas beroende på om *mode* är ``'r'`` (standard) eller ``'w'``. Argumentet *buffering* har samma betydelse som motsvarande argument i den inbyggda funktionen :func:`open`. Det returnerade filobjektet läser eller skriver textsträngar istället för bytes.

source: The ``close`` method returns :const:`None` if the subprocess exited successfully, or the subprocess's return code if there was an error. On POSIX systems, if the return code is positive it represents the return value of the process left-shifted by one byte. If the return code is negative, the process was terminated by the signal given by the negated value of the return code. (For example, the return value might be ``- signal.SIGKILL`` if the subprocess was killed.) On Windows systems, the return value contains the signed integer return code from the child process.
sv: Metoden ``close`` returnerar :const:`None`` om subprocessen avslutades framgångsrikt, eller subprocessens returkod om det uppstod ett fel. På POSIX-system representerar returkoden, om den är positiv, processens returvärde vänsterförskjutet med en byte. Om returkoden är negativ har processen avslutats med den signal som ges av returkodens negerade värde. (Returvärdet kan t.ex. vara ``- signal.SIGKILL`` om subprocessen dödades) På Windows-system innehåller returvärdet den signerade heltalsreturkoden från barnprocessen.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the ``close`` method result (exit status) into an exit code if it is not ``None``. On Windows, the ``close`` method result is directly the exit code (or ``None``).
sv: På Unix kan :func:`waitstatus_to_exitcode` användas för att konvertera resultatet av ``close``-metoden (exitstatus) till en exitkod om den inte är ``None``. I Windows är resultatet av ``close``-metoden direkt utgångskoden (eller ``None``).

source: This is implemented using :class:`subprocess.Popen`; see that class's documentation for more powerful ways to manage and communicate with subprocesses.
sv: Detta implementeras med hjälp av :class:`subprocess.Popen`; se den klassens dokumentation för mer kraftfulla sätt att hantera och kommunicera med subprocesser.

source: The :ref:`Python UTF-8 Mode <utf8-mode>` affects encodings used for *cmd* and pipe contents.
sv: :ref:`Python UTF-8 Mode <utf8-mode>` påverkar kodningar som används för *cmd* och pipe-innehåll.

source: :func:`popen` is a simple wrapper around :class:`subprocess.Popen`. Use :class:`subprocess.Popen` or :func:`subprocess.run` to control options like encodings.
sv: :func:`popen` är ett enkelt omslag runt :class:`subprocess.Popen`. Använd :class:`subprocess.Popen` eller :func:`subprocess.run` för att kontrollera alternativ som kodning.

source: The function is :term:`soft deprecated` and should no longer be used to write new code. The :mod:`subprocess` module is recommended instead.
sv: Funktionen är :term:`soft deprecated` och bör inte längre användas för att skriva ny kod. Modulen :mod:`subprocess` rekommenderas istället.

source: Wraps the :c:func:`!posix_spawn` C library API for use from Python.
sv: Omfattar C-bibliotekets :c:func:`!posix_spawn` API för användning från Python.

source: Most users should use :func:`subprocess.run` instead of :func:`posix_spawn`.
sv: De flesta användare bör använda :func:`subprocess.run` istället för :func:`posix_spawn`.

source: The positional-only arguments *path*, *args*, and *env* are similar to :func:`execve`. *env* is allowed to be ``None``, in which case current process' environment is used.
sv: Argumenten *path*, *args* och *env*, som endast är positionella, liknar :func:`execve`. *env* får vara ``None``, i vilket fall den aktuella processens miljö används.

source: The *path* parameter is the path to the executable file. The *path* should contain a directory. Use :func:`posix_spawnp` to pass an executable file without directory.
sv: Parametern *path* är sökvägen till den körbara filen. *Sökväg* bör innehålla en katalog. Använd :func:`posix_spawnp` för att skicka en körbar fil utan katalog.

source: The *file_actions* argument may be a sequence of tuples describing actions to take on specific file descriptors in the child process between the C library implementation's :c:func:`fork` and :c:func:`exec` steps. The first item in each tuple must be one of the three type indicator listed below describing the remaining tuple elements:
sv: Argumentet *file_actions* kan vara en sekvens av tupler som beskriver åtgärder som ska vidtas för specifika filbeskrivare i underordnad process mellan C-biblioteksimplementeringens steg :c:func:`fork` och :c:func:`exec`. Det första elementet i varje tupel måste vara en av de tre typindikatorer som anges nedan och som beskriver de återstående tupelelementen:

source: Performs ``os.dup2(os.open(path, flags, mode), fd)``.
sv: Utför ``os.dup2(os.open(path, flags, mode), fd)``.

source: Performs ``os.close(fd)``.
sv: Utför ``os.close(fd)``.

source: Performs ``os.dup2(fd, new_fd)``.
sv: Utför ``os.dup2(fd, new_fd)``.

source: Performs ``os.closerange(fd, INF)``.
sv: Utför ``os.closerange(fd, INF)``.

source: These tuples correspond to the C library :c:func:`!posix_spawn_file_actions_addopen`, :c:func:`!posix_spawn_file_actions_addclose`, :c:func:`!posix_spawn_file_actions_adddup2`, and :c:func:`!posix_spawn_file_actions_addclosefrom_np` API calls used to prepare for the :c:func:`!posix_spawn` call itself.
sv: Dessa tuples motsvarar C-bibliotekets :c:func:`!posix_spawn_file_actions_addopen`, :c:func:`!posix_spawn_file_actions_addclose`, :c:func:`!posix_spawn_file_actions_adddup2`, och :c:func:`!posix_spawn_file_actions_addclosefrom_np` API-anrop som används för att förbereda för själva :c:func:`!posix_spawn`-anropet.

source: The *setpgroup* argument will set the process group of the child to the value specified. If the value specified is 0, the child's process group ID will be made the same as its process ID. If the value of *setpgroup* is not set, the child will inherit the parent's process group ID. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_SETPGROUP` flag.
sv: Argumentet *setpgroup* ställer in barnets processgrupp till det angivna värdet. Om det angivna värdet är 0 blir barnets processgrupps-ID detsamma som dess process-ID. Om värdet för *setpgroup* inte anges kommer barnet att ärva förälderns processgrupps-ID. Detta argument motsvarar C-bibliotekets :c:macro:`!POSIX_SPAWN_SETPGROUP`-flagga.

source: If the *resetids* argument is ``True`` it will reset the effective UID and GID of the child to the real UID and GID of the parent process. If the argument is ``False``, then the child retains the effective UID and GID of the parent. In either case, if the set-user-ID and set-group-ID permission bits are enabled on the executable file, their effect will override the setting of the effective UID and GID. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_RESETIDS` flag.
sv: Om argumentet *resetids* är ``True`` återställs det effektiva UID:t och GID:t för barnet till det verkliga UID:t och GID:t för den överordnade processen. Om argumentet är ``False`` behåller barnet förälderns effektiva UID och GID. I båda fallen gäller att om behörighetsbitarna set-user-ID och set-group-ID är aktiverade i den körbara filen, kommer deras effekt att åsidosätta inställningen av det effektiva UID och GID. Detta argument motsvarar C-bibliotekets :c:macro:`!POSIX_SPAWN_RESETIDS`-flagga.

source: If the *setsid* argument is ``True``, it will create a new session ID for ``posix_spawn``. *setsid* requires :c:macro:`!POSIX_SPAWN_SETSID` or :c:macro:`!POSIX_SPAWN_SETSID_NP` flag. Otherwise, :exc:`NotImplementedError` is raised.
sv: Om argumentet *setsid* är ``True`` kommer det att skapa ett nytt sessions-ID för ``posix_spawn``. *setsid* kräver :c:macro:`!POSIX_SPAWN_SETSID` eller :c:macro:`!POSIX_SPAWN_SETSID_NP` flagga. Annars kommer :exc:`NotImplementedError` att tas upp.

source: The *setsigmask* argument will set the signal mask to the signal set specified. If the parameter is not used, then the child inherits the parent's signal mask. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_SETSIGMASK` flag.
sv: Argumentet *setsigmask* ställer in signalmasken till den angivna signaluppsättningen. Om parametern inte används ärver barnet förälderns signalmask. Detta argument motsvarar C-bibliotekets :c:macro:`!POSIX_SPAWN_SETSIGMASK`-flagga.

source: The *sigdef* argument will reset the disposition of all signals in the set specified. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_SETSIGDEF` flag.
sv: Argumentet *sigdef* kommer att återställa inställningen för alla signaler i den angivna uppsättningen. Detta argument motsvarar C-bibliotekets :c:macro:`!POSIX_SPAWN_SETSIGDEF`-flagga.

source: The *scheduler* argument must be a tuple containing the (optional) scheduler policy and an instance of :class:`sched_param` with the scheduler parameters. A value of ``None`` in the place of the scheduler policy indicates that is not being provided. This argument is a combination of the C library :c:macro:`!POSIX_SPAWN_SETSCHEDPARAM` and :c:macro:`!POSIX_SPAWN_SETSCHEDULER` flags.
sv: Argumentet *scheduler* måste vara en tupel som innehåller den (valfria) schemaläggningspolicyn och en instans av :class:`sched_param` med schemaläggningsparametrarna. Ett värde av ``None`` i stället för schemaläggningspolicyn anger att den inte tillhandahålls. Detta argument är en kombination av C-bibliotekets :c:macro:`!POSIX_SPAWN_SETSCHEDPARAM` och :c:macro:`!POSIX_SPAWN_SETSCHEDULER` flaggor.

source: Raises an :ref:`auditing event <auditing>` ``os.posix_spawn`` with arguments ``path``, ``argv``, ``env``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.posix_spawn`` med argumenten ``path``, ``argv``, ``env``.

source: *env* parameter accepts ``None``. ``os.POSIX_SPAWN_CLOSEFROM`` is available on platforms where :c:func:`!posix_spawn_file_actions_addclosefrom_np` exists.
sv: *env*-parametern accepterar ``None``. ``os.POSIX_SPAWN_CLOSEFROM`` finns tillgängligt på plattformar där :c:func:`!posix_spawn_file_actions_addclosefrom_np` finns.

source: Wraps the :c:func:`!posix_spawnp` C library API for use from Python.
sv: Omfattar C-bibliotekets :c:func:`!posix_spawnp` API för användning från Python.

source: Similar to :func:`posix_spawn` except that the system searches for the *executable* file in the list of directories specified by the :envvar:`PATH` environment variable (in the same way as for ``execvp(3)``).
sv: Liknar :func:`posix_spawn` förutom att systemet söker efter den *exekverbara* filen i listan över kataloger som anges av miljövariabeln :envvar:`PATH` (på samma sätt som för ``execvp(3)``).

source: See :func:`posix_spawn` documentation.
sv: Se :func:`posix_spawn` dokumentation.

source: Register callables to be executed when a new child process is forked using :func:`os.fork` or similar process cloning APIs. The parameters are optional and keyword-only. Each specifies a different call point.
sv: Registrera anropbara filer som ska köras när en ny underordnad process förgrenas med hjälp av :func:`os.fork` eller liknande API:er för kloning av processer. Parametrarna är valfria och endast nyckelord. Var och en specificerar en annan anropspunkt.

source: *before* is a function called before forking a child process.
sv: *before* är en funktion som anropas innan en barnprocess forkas.

source: *after_in_parent* is a function called from the parent process after forking a child process.
sv: *after_in_parent* är en funktion som anropas från den överordnade processen efter att ha forkat en underordnad process.

source: *after_in_child* is a function called from the child process.
sv: *after_in_child* är en funktion som anropas från den underordnade processen.

source: These calls are only made if control is expected to return to the Python interpreter. A typical :mod:`subprocess` launch will not trigger them as the child is not going to re-enter the interpreter.
sv: Dessa anrop görs endast om kontrollen förväntas återvända till Python-tolken. En typisk :mod:`subprocess`-start kommer inte att utlösa dem eftersom barnet inte kommer att återgå till tolken.

source: Functions registered for execution before forking are called in reverse registration order. Functions registered for execution after forking (either in the parent or in the child) are called in registration order.
sv: Funktioner som registrerats för utförande före förgrening anropas i omvänd registreringsordning. Funktioner som registrerats för utförande efter förgrening (antingen i föräldern eller i barnet) anropas i registreringsordning.

source: Note that :c:func:`fork` calls made by third-party C code may not call those functions, unless it explicitly calls :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
sv: Observera att :c:func:`fork`-anrop som görs av C-kod från tredje part inte får anropa dessa funktioner, såvida den inte uttryckligen anropar :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` och :c:func:`PyOS_AfterFork_Child`.

source: There is no way to unregister a function.
sv: Det finns inget sätt att avregistrera en funktion.

source: Execute the program *path* in a new process.
sv: Exekvera programmet *sökväg* i en ny process.

source: (Note that the :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using these functions. Check especially the :ref:`subprocess-replacements` section.)
sv: (Observera att modulen :mod:`subprocess` ger kraftfullare möjligheter att starta nya processer och hämta deras resultat; att använda den modulen är att föredra framför att använda dessa funktioner. Se särskilt avsnittet :ref:`subprocess-replacements`)
