Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: Using :func:`scandir` instead of :func:`listdir` can significantly increase the performance of code that also needs file type or file attribute information, because :class:`os.DirEntry` objects expose this information if the operating system provides it when scanning a directory. All :class:`os.DirEntry` methods may perform a system call, but :func:`~os.DirEntry.is_dir` and :func:`~os.DirEntry.is_file` usually only require a system call for symbolic links; :func:`os.DirEntry.stat` always requires a system call on Unix but only requires one for symbolic links on Windows.
sv: Att använda :func:`scandir` istället för :func:`listdir` kan avsevärt öka prestandan för kod som också behöver information om filtyp eller filattribut, eftersom :class:`os.DirEntry`-objekt exponerar denna information om operativsystemet tillhandahåller den när en katalog skannas. Alla :class:`os.DirEntry`-metoder kan utföra ett systemanrop, men :func:`~os.DirEntry.is_dir` och :func:`~os.DirEntry.is_file` kräver vanligtvis bara ett systemanrop för symboliska länkar; :func:`os.DirEntry.stat` kräver alltid ett systemanrop på Unix men bara ett för symboliska länkar på Windows.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the type of the :attr:`~os.DirEntry.name` and :attr:`~os.DirEntry.path` attributes of each :class:`os.DirEntry` will be ``bytes``; in all other circumstances, they will be of type ``str``.
sv: *path* kan vara en :term:`path-like object`. Om *sökväg* är av typen ``bytes`` (direkt eller indirekt genom :class:`PathLike`-gränssnittet), kommer typen av attributen :attr:`~os.DirEntry.name` och :attr:`~os.DirEntry.path` för varje :class:`os.DirEntry` att vara ``bytes``; under alla andra omständigheter kommer de att vara av typen ``str``.

source: Raises an :ref:`auditing event <auditing>` ``os.scandir`` with argument ``path``.
sv: Utlöser en :ref:``auditing event <auditing>` ``os.scandir`` med argumentet ``path``.

source: The :func:`scandir` iterator supports the :term:`context manager` protocol and has the following method:
sv: Iteratorn :func:`scandir` stöder protokollet :term:`context manager` och har följande metod:

source: Close the iterator and free acquired resources.
sv: Stäng iteratorn och frigör förvärvade resurser.

source: This is called automatically when the iterator is exhausted or garbage collected, or when an error happens during iterating. However it is advisable to call it explicitly or use the :keyword:`with` statement.
sv: Detta anropas automatiskt när iteratorn är uttömd eller garbage collected, eller när ett fel inträffar under iterationen. Det är dock tillrådligt att anropa det explicit eller använda :keyword:`with`-satsen.

source: The following example shows a simple use of :func:`scandir` to display all the files (excluding directories) in the given *path* that don't start with ``'.'``. The ``entry.is_file()`` call will generally not make an additional system call::
sv: Följande exempel visar en enkel användning av :func:`scandir` för att visa alla filer (exklusive kataloger) i den angivna *path* som inte börjar med ``'.'``. Anropet ``entry.is_file()`` kommer i allmänhet inte att göra ett ytterligare systemanrop::

source: with os.scandir(path) as it: for entry in it: if not entry.name.startswith('.') and entry.is_file(): print(entry.name)
sv: med os.scandir(sökväg) som den: för post i den: if not entry.name.startswith('.') and entry.is_file(): print(post.namn)

source: On Unix-based systems, :func:`scandir` uses the system's `opendir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ and `readdir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_ functions. On Windows, it uses the Win32 `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ and `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_ functions.
sv: På Unix-baserade system använder :func:`scandir` systemets funktioner `opendir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ och `readdir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_. På Windows används Win32-funktionerna `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ och `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_.

source: Added support for the :term:`context manager` protocol and the :func:`~scandir.close` method. If a :func:`scandir` iterator is neither exhausted nor explicitly closed a :exc:`ResourceWarning` will be emitted in its destructor.
sv: Lagt till stöd för protokollet :term:`context manager` och metoden :func:`~scandir.close`. Om en :func:`scandir` iterator varken är uttömd eller explicit stängd kommer en :exc:`ResourceWarning` att skickas ut i dess destruktor.

source: The function accepts a :term:`path-like object`.
sv: Funktionen accepterar en :term:`path-liknande objekt`.

source: Added support for :ref:`file descriptors <path_fd>` on Unix.
sv: Lagt till stöd för :ref:`file descriptors <path_fd>` på Unix.

source: Object yielded by :func:`scandir` to expose the file path and other file attributes of a directory entry.
sv: Objekt som genereras av :func:`scandir` för att visa filsökvägen och andra filattribut för en katalogpost.

source: :func:`scandir` will provide as much of this information as possible without making additional system calls. When a ``stat()`` or ``lstat()`` system call is made, the ``os.DirEntry`` object will cache the result.
sv: :func:`scandir` kommer att tillhandahålla så mycket av denna information som möjligt utan att göra ytterligare systemanrop. När ett ``stat()`` eller ``lstat()`` systemanrop görs, kommer objektet ``os.DirEntry`` att cacha resultatet.

source: ``os.DirEntry`` instances are not intended to be stored in long-lived data structures; if you know the file metadata has changed or if a long time has elapsed since calling :func:`scandir`, call ``os.stat(entry.path)`` to fetch up-to-date information.
sv: instanser av ``os.DirEntry`` är inte avsedda att lagras i långlivade datastrukturer; om du vet att filens metadata har ändrats eller om det har gått lång tid sedan du anropade :func:`scandir`, anropa ``os.stat(entry.path)`` för att hämta aktuell information.

source: Because the ``os.DirEntry`` methods can make operating system calls, they may also raise :exc:`OSError`. If you need very fine-grained control over errors, you can catch :exc:`OSError` when calling one of the ``os.DirEntry`` methods and handle as appropriate.
sv: Eftersom metoderna i ``os.DirEntry`` kan göra anrop till operativsystemet kan de också ge upphov till :exc:`OSError`. Om du behöver mycket finkornig kontroll över fel kan du fånga :exc:`OSError` när du anropar en av metoderna i ``os.DirEntry`` och hantera dem på lämpligt sätt.

source: To be directly usable as a :term:`path-like object`, ``os.DirEntry`` implements the :class:`PathLike` interface.
sv: För att vara direkt användbar som ett :term:`path-like object`, implementerar ``os.DirEntry`` :class:`PathLike` gränssnittet.

source: Attributes and methods on a ``os.DirEntry`` instance are as follows:
sv: Attribut och metoder för en ``os.DirEntry``-instans är följande:

source: The entry's base filename, relative to the :func:`scandir` *path* argument.
sv: Postens basfilnamn, i förhållande till argumentet :func:`scandir` *path*.

source: The :attr:`name` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
sv: Attributet :attr:`name` kommer att vara ``bytes`` om argumentet :func:`scandir` *path* är av typen ``bytes`` och ``str`` annars. Använd :func:`~os.fsdecode` för att avkoda bytefilnamn.

source: The entry's full path name: equivalent to ``os.path.join(scandir_path, entry.name)`` where *scandir_path* is the :func:`scandir` *path* argument. The path is only absolute if the :func:`scandir` *path* argument was absolute. If the :func:`scandir` *path* argument was a :ref:`file descriptor <path_fd>`, the :attr:`path` attribute is the same as the :attr:`name` attribute.
sv: Postens fullständiga sökvägsnamn: motsvarar ```os.path.join(scandir_path, entry.name)`` där *scandir_path* är :func:`scandir` *path*-argumentet. Sökvägen är bara absolut om argumentet :func:`scandir` *path* var absolut. Om :func:`scandir` *path*-argumentet var en :ref:`file descriptor <path_fd>`, är attributet :attr:`path` detsamma som attributet :attr:`name`.

source: The :attr:`path` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
sv: Attributet :attr:`path` kommer att vara ``bytes`` om argumentet :func:`scandir` *path* är av typen ``bytes`` och ``str`` annars. Använd :func:`~os.fsdecode` för att avkoda bytefilnamn.

source: Return the inode number of the entry.
sv: Returnerar inodnumret för posten.

source: The result is cached on the ``os.DirEntry`` object. Use ``os.stat(entry.path, follow_symlinks=False).st_ino`` to fetch up-to-date information.
sv: Resultatet cachelagras på objektet ``os.DirEntry``. Använd ``os.stat(entry.path, follow_symlinks=False).st_ino`` för att hämta aktuell information.

source: On the first, uncached call, a system call is required on Windows but not on Unix.
sv: Vid det första anropet, som inte är cachat, krävs ett systemanrop i Windows men inte i Unix.

source: Return ``True`` if this entry is a directory or a symbolic link pointing to a directory; return ``False`` if the entry is or points to any other kind of file, or if it doesn't exist anymore.
sv: Returnerar ``True`` om denna post är en katalog eller en symbolisk länk som pekar på en katalog; returnerar ``False`` om posten är eller pekar på någon annan typ av fil, eller om den inte längre existerar.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a directory (without following symlinks); return ``False`` if the entry is any other kind of file or if it doesn't exist anymore.
sv: Om *follow_symlinks* är ``False``, returneras ``True`` endast om denna post är en katalog (utan att följa symlinks); returneras ``False`` om posten är någon annan typ av fil eller om den inte längre existerar.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` along with :func:`stat.S_ISDIR` to fetch up-to-date information.
sv: Resultatet cachelagras på objektet ``os.DirEntry``, med en separat cache för *follow_symlinks* ``True`` och ``False``. Anropa :func:`os.stat` tillsammans med :func:`stat.S_ISDIR` för att hämta aktuell information.

source: On the first, uncached call, no system call is required in most cases. Specifically, for non-symlinks, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``. If the entry is a symlink, a system call will be required to follow the symlink unless *follow_symlinks* is ``False``.
sv: Vid det första, ocachade anropet krävs i de flesta fall inget systemanrop. För icke-symlänkar kräver varken Windows eller Unix ett systemanrop, utom för vissa Unix-filsystem, t.ex. nätverksfilsystem, som returnerar ``dirent.d_type == DT_UNKNOWN``. Om posten är en symlänk krävs ett systemanrop för att följa symlänken om inte *follow_symlinks* är ``False``.

source: This method can raise :exc:`OSError`, such as :exc:`PermissionError`, but :exc:`FileNotFoundError` is caught and not raised.
sv: Denna metod kan ge upphov till :exc:`OSError`, t.ex. :exc:`PermissionError`, men :exc:`FileNotFoundError` fångas upp och ges inte upphov till.

source: Return ``True`` if this entry is a file or a symbolic link pointing to a file; return ``False`` if the entry is or points to a directory or other non-file entry, or if it doesn't exist anymore.
sv: Returnerar ``True`` om denna post är en fil eller en symbolisk länk som pekar på en fil; returnerar ``False`` om posten är eller pekar på en katalog eller annan post som inte är en fil, eller om den inte längre existerar.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a file (without following symlinks); return ``False`` if the entry is a directory or other non-file entry, or if it doesn't exist anymore.
sv: Om *follow_symlinks* är ``False``, returneras ``True`` endast om denna post är en fil (utan att följa symlinks); returneras ``False`` om posten är en katalog eller annan icke-filpost, eller om den inte längre existerar.

source: The result is cached on the ``os.DirEntry`` object. Caching, system calls made, and exceptions raised are as per :func:`~os.DirEntry.is_dir`.
sv: Resultatet cachelagras på objektet ``os.DirEntry``. Cachelagring, systemanrop som görs och undantag som tas upp är enligt :func:`~os.DirEntry.is_dir`.

source: Return ``True`` if this entry is a symbolic link (even if broken); return ``False`` if the entry points to a directory or any kind of file, or if it doesn't exist anymore.
sv: Returnerar ``True`` om denna post är en symbolisk länk (även om den är bruten); returnerar ``False`` om posten pekar på en katalog eller någon form av fil, eller om den inte längre existerar.

source: The result is cached on the ``os.DirEntry`` object. Call :func:`os.path.islink` to fetch up-to-date information.
sv: Resultatet cachelagras på objektet ``os.DirEntry``. Anropa :func:`os.path.islink` för att hämta aktuell information.

source: On the first, uncached call, no system call is required in most cases. Specifically, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``.
sv: Vid det första, ocachade anropet krävs i de flesta fall inget systemanrop. Varken Windows eller Unix kräver ett systemanrop, förutom i vissa Unix-filsystem, t.ex. nätverksfilsystem, som returnerar ``dirent.d_type == DT_UNKNOWN``.

source: Return ``True`` if this entry is a junction (even if broken); return ``False`` if the entry points to a regular directory, any kind of file, a symlink, or if it doesn't exist anymore.
sv: Returnerar ``True`` om denna post är en korsning (även om den är bruten); returnerar ``False`` om posten pekar på en vanlig katalog, någon form av fil, en symlänk eller om den inte längre finns.

source: The result is cached on the ``os.DirEntry`` object. Call :func:`os.path.isjunction` to fetch up-to-date information.
sv: Resultatet cachelagras på objektet ``os.DirEntry``. Anropa :func:`os.path.isjunction` för att hämta aktuell information.

source: Return a :class:`stat_result` object for this entry. This method follows symbolic links by default; to stat a symbolic link add the ``follow_symlinks=False`` argument.
sv: Returnerar ett :class:`stat_result`-objekt för den här posten. Denna metod följer symboliska länkar som standard; för att stata en symbolisk länk lägg till argumentet ``follow_symlinks=False``.

source: On Unix, this method always requires a system call. On Windows, it only requires a system call if *follow_symlinks* is ``True`` and the entry is a reparse point (for example, a symbolic link or directory junction).
sv: På Unix kräver den här metoden alltid ett systemanrop. I Windows krävs det bara ett systemanrop om *follow_symlinks* är ``True`` och posten är en reparse-punkt (t.ex. en symbolisk länk eller katalogkorsning).

source: On Windows, the ``st_ino``, ``st_dev`` and ``st_nlink`` attributes of the :class:`stat_result` are always set to zero. Call :func:`os.stat` to get these attributes.
sv: I Windows är attributen ``st_ino``, ``st_dev`` och ``st_nlink`` i :class:`stat_result` alltid nollställda. Anropa :func:`os.stat` för att få dessa attribut.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` to fetch up-to-date information.
sv: Resultatet cachelagras på objektet ``os.DirEntry``, med en separat cache för *follow_symlinks* ``True`` och ``False``. Anropa :func:`os.stat` för att hämta aktuell information.

source: Note that there is a nice correspondence between several attributes and methods of ``os.DirEntry`` and of :class:`pathlib.Path`. In particular, the ``name`` attribute has the same meaning, as do the ``is_dir()``, ``is_file()``, ``is_symlink()``, ``is_junction()``, and ``stat()`` methods.
sv: Observera att det finns en fin korrespondens mellan flera attribut och metoder i ``os.DirEntry`` och i :class:`pathlib.Path`. I synnerhet har attributet ``name`` samma betydelse, liksom metoderna ``is_dir()``, ``is_file()``, ``is_symlink()``, ``is_junction()`` och ``stat()``.

source: Added support for the :class:`~os.PathLike` interface. Added support for :class:`bytes` paths on Windows.
sv: Lagt till stöd för gränssnittet :class:`~os.PathLike`. Lagt till stöd för :class:`bytes`-sökvägar på Windows.

source: The ``st_ctime`` attribute of a stat result is deprecated on Windows. The file creation time is properly available as ``st_birthtime``, and in the future ``st_ctime`` may be changed to return zero or the metadata change time, if available.
sv: Attributet ``st_ctime`` för ett stat-resultat är föråldrat i Windows. Filens skapelsetid är korrekt tillgänglig som ``st_birthtime``, och i framtiden kan ``st_ctime`` ändras för att returnera noll eller metadatas ändringstid, om den är tillgänglig.

source: Get the status of a file or a file descriptor. Perform the equivalent of a :c:func:`stat` system call on the given path. *path* may be specified as either a string or bytes -- directly or indirectly through the :class:`PathLike` interface -- or as an open file descriptor. Return a :class:`stat_result` object.
sv: Hämta status för en fil eller en filbeskrivare. Utför motsvarande ett :c:func:`stat` systemanrop på den angivna sökvägen. *path* kan anges som antingen en sträng eller bytes -- direkt eller indirekt genom :class:`PathLike`-gränssnittet -- eller som en öppen filbeskrivare. Returnerar ett :class:`stat_result`-objekt.

source: This function normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :func:`lstat`.
sv: Denna funktion följer normalt symlinks; för att stata en symlink lägg till argumentet ``follow_symlinks=False``, eller använd :func:`lstat`.

source: This function can support :ref:`specifying a file descriptor <path_fd>` and :ref:`not following symlinks <follow_symlinks>`.
sv: Denna funktion kan stödja :ref:`specificera en filbeskrivare <path_fd>` och :ref:`inte följa symlänkar <follow_symlinks>`.

source: On Windows, passing ``follow_symlinks=False`` will disable following all name-surrogate reparse points, which includes symlinks and directory junctions. Other types of reparse points that do not resemble links or that the operating system is unable to follow will be opened directly. When following a chain of multiple links, this may result in the original link being returned instead of the non-link that prevented full traversal. To obtain stat results for the final path in this case, use the :func:`os.path.realpath` function to resolve the path name as far as possible and call :func:`lstat` on the result. This does not apply to dangling symlinks or junction points, which will raise the usual exceptions.
sv: Om du anger ``follow_symlinks=False`` i Windows kan du inte följa alla reparse-punkter som liknar namn, vilket inkluderar symlinks och directory junctions. Andra typer av reparse-punkter som inte liknar länkar eller som operativsystemet inte kan följa öppnas direkt. När du följer en kedja med flera länkar kan detta resultera i att den ursprungliga länken returneras i stället för den icke-länk som förhindrade fullständig traversering. För att få statistikresultat för den slutliga sökvägen i det här fallet, använd funktionen :func:`os.path.realpath` för att lösa upp sökvägsnamnet så långt som möjligt och anropa :func:`lstat` på resultatet. Detta gäller inte för dangling symlinks eller junction points, som kommer att ge upphov till de vanliga undantagen.

source: Example::
sv: Exempel::

source: :func:`fstat` and :func:`lstat` functions.
sv: funktionerna :func:`fstat` och :func:`lstat`.

source: Added the *dir_fd* and *follow_symlinks* parameters, specifying a file descriptor instead of a path.
sv: Parametrarna *dir_fd* och *follow_symlinks* har lagts till och anger en filbeskrivare i stället för en sökväg.

source: On Windows, all reparse points that can be resolved by the operating system are now followed, and passing ``follow_symlinks=False`` disables following all name surrogate reparse points. If the operating system reaches a reparse point that it is not able to follow, *stat* now returns the information for the original path as if ``follow_symlinks=False`` had been specified instead of raising an error.
sv: I Windows följs nu alla reparse-punkter som kan lösas av operativsystemet, och om du anger ``follow_symlinks=False`` följer du inte alla reparse-punkter för namnsurrogat. Om operativsystemet når en reparse-punkt som det inte kan följa, returnerar *stat* nu informationen för den ursprungliga sökvägen som om ``follow_symlinks=False`` hade angetts i stället för att ge upphov till ett fel.

source: Object whose attributes correspond roughly to the members of the :c:struct:`stat` structure. It is used for the result of :func:`os.stat`, :func:`os.fstat` and :func:`os.lstat`.
sv: Objekt vars attribut ungefär motsvarar medlemmarna i :c:struct:`stat`-strukturen. Det används för resultatet av :func:`os.stat`, :func:`os.fstat` och :func:`os.lstat`.

source: Attributes:
sv: Attribut:

source: File mode: file type and file mode bits (permissions).
sv: File mode: filtyp och bits för filläge (behörigheter).

source: Platform dependent, but if non-zero, uniquely identifies the file for a given value of ``st_dev``. Typically:
sv: Beroende på plattform, men om den inte är noll identifierar den filen unikt för ett visst värde på ``st_dev``. Typiskt för detta:

source: the inode number on Unix,
sv: inode-numret på Unix,

source: the `file index <https://msdn.microsoft.com/en-us/library/aa363788>`_ on Windows
sv: filindex <https://msdn.microsoft.com/en-us/library/aa363788>`_ på Windows

source: Identifier of the device on which this file resides.
sv: Identifierare för den enhet som filen finns på.

source: Number of hard links.
sv: Antal hårda länkar.

source: User identifier of the file owner.
sv: Användaridentifierare för filägaren.

source: Group identifier of the file owner.
sv: Gruppidentifierare för filägaren.

source: Size of the file in bytes, if it is a regular file or a symbolic link. The size of a symbolic link is the length of the pathname it contains, without a terminating null byte.
sv: Filens storlek i byte, om det är en vanlig fil eller en symbolisk länk. Storleken på en symbolisk länk är längden på det sökvägsnamn den innehåller, utan en avslutande null-byte.

source: Timestamps:
sv: Tidsstämplar:

source: Time of most recent access expressed in seconds.
sv: Tidpunkt för senaste åtkomst uttryckt i sekunder.

source: Time of most recent content modification expressed in seconds.
sv: Tidpunkt för senaste ändring av innehåll uttryckt i sekunder.

source: Time of most recent metadata change expressed in seconds.
sv: Tidpunkt för den senaste ändringen av metadata uttryckt i sekunder.
