Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: *volume* must be represented as a GUID path, like those returned by :func:`os.listvolumes`. Volumes may be mounted in multiple locations or not at all. In the latter case, the list will be empty. Mount points that are not associated with a volume will not be returned by this function.
sv: *volume* måste representeras som en GUID-sökväg, som de som returneras av :func:`os.listvolumes`. Volymer kan vara monterade på flera platser eller inte alls. I det senare fallet kommer listan att vara tom. Monteringspunkter som inte är associerade med en volym kommer inte att returneras av denna funktion.

source: The mount points return by this function will be absolute paths, and may be longer than the drive name.
sv: De monteringspunkter som returneras av denna funktion kommer att vara absoluta sökvägar och kan vara längre än enhetsnamnet.

source: Raises :exc:`OSError` if the volume is not recognized or if an error occurs collecting the paths.
sv: Utlöser :exc:`OSError` om volymen inte känns igen eller om ett fel uppstår när sökvägarna samlas in.

source: Raises an :ref:`auditing event <auditing>` ``os.listmounts`` with argument ``volume``.
sv: Utlöser en :ref:``auditing event <auditing>` ``os.listmounts`` med argumentet ``volume``.

source: Return a list containing the volumes in the system.
sv: Returnerar en lista som innehåller volymerna i systemet.

source: Volumes are typically represented as a GUID path that looks like ``\\?\Volume{xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}\``. Files can usually be accessed through a GUID path, permissions allowing. However, users are generally not familiar with them, and so the recommended use of this function is to retrieve mount points using :func:`os.listmounts`.
sv: Volymer representeras vanligtvis som en GUID-sökväg som ser ut som "Volym{xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}". Filer kan vanligtvis nås via en GUID-sökväg, om behörigheterna tillåter det. Användare är dock i allmänhet inte bekanta med dem, och därför är den rekommenderade användningen av denna funktion att hämta monteringspunkter med :func:`os.listmounts`.

source: May raise :exc:`OSError` if an error occurs collecting the volumes.
sv: Kan ge upphov till :exc:`OSError` om ett fel inträffar när volymerna samlas in.

source: Raises an :ref:`auditing event <auditing>` ``os.listvolumes`` with no arguments.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.listvolumes`` utan argument.

source: Perform the equivalent of an :c:func:`!lstat` system call on the given path. Similar to :func:`~os.stat`, but does not follow symbolic links. Return a :class:`stat_result` object.
sv: Utför motsvarande ett :c:func:`!lstat`-systemanrop på den angivna sökvägen. Liknar :func:`~os.stat`, men följer inte symboliska länkar. Returnerar ett :class:`stat_result`-objekt.

source: On platforms that do not support symbolic links, this is an alias for :func:`~os.stat`.
sv: På plattformar som inte har stöd för symboliska länkar är detta ett alias för :func:`~os.stat`.

source: As of Python 3.3, this is equivalent to ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.
sv: Från och med Python 3.3 motsvarar detta ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.

source: This function can also support :ref:`paths relative to directory descriptors <dir_fd>`.
sv: Denna funktion kan också stödja :ref:`sökvägar i förhållande till katalogbeskrivare <dir_fd>`.

source: Added support for Windows 6.0 (Vista) symbolic links.
sv: Stöd för symboliska länkar i Windows 6.0 (Vista) har lagts till.

source: On Windows, now opens reparse points that represent another path (name surrogates), including symbolic links and directory junctions. Other kinds of reparse points are resolved by the operating system as for :func:`~os.stat`.
sv: I Windows öppnas nu reparse-punkter som representerar en annan sökväg (namnsurrogat), inklusive symboliska länkar och katalogövergångar. Andra typer av reparse-punkter löses av operativsystemet på samma sätt som för :func:`~os.stat`.

source: Create a directory named *path* with numeric mode *mode*.
sv: Skapa en katalog med namnet *path* med numeriskt läge *mode*.

source: If the directory already exists, :exc:`FileExistsError` is raised. If a parent directory in the path does not exist, :exc:`FileNotFoundError` is raised.
sv: Om katalogen redan finns, uppstår :exc:`FileExistsError`. Om en överordnad katalog i sökvägen inte existerar, genereras :exc:`FileNotFoundError`.

source: On some systems, *mode* is ignored. Where it is used, the current umask value is first masked out. If bits other than the last 9 (i.e. the last 3 digits of the octal representation of the *mode*) are set, their meaning is platform-dependent. On some platforms, they are ignored and you should call :func:`chmod` explicitly to set them.
sv: På vissa system ignoreras *mode*. Där den används maskeras först det aktuella umask-värdet. Om andra bitar än de sista 9 (dvs. de sista 3 siffrorna i oktalrepresentationen av *mode*) är inställda, är deras betydelse plattformsberoende. På vissa plattformar ignoreras de och du bör anropa :func:`chmod` explicit för att ställa in dem.

source: On Windows, a *mode* of ``0o700`` is specifically handled to apply access control to the new directory such that only the current user and administrators have access. Other values of *mode* are ignored.
sv: I Windows hanteras ett *mode* på ``0o700`` specifikt för att tillämpa åtkomstkontroll på den nya katalogen så att endast den aktuella användaren och administratörer har åtkomst. Andra värden på *mode* ignoreras.

source: It is also possible to create temporary directories; see the :mod:`tempfile` module's :func:`tempfile.mkdtemp` function.
sv: Det är också möjligt att skapa temporära kataloger; se modulen :mod:`tempfile` :func:`tempfile.mkdtemp`.

source: Raises an :ref:`auditing event <auditing>` ``os.mkdir`` with arguments ``path``, ``mode``, ``dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.mkdir`` med argumenten ``path``, ``mode``, ``dir_fd``.

source: Windows now handles a *mode* of ``0o700``.
sv: Windows hanterar nu ett *mode* av ``0o700``.

source: Recursive directory creation function. Like :func:`mkdir`, but makes all intermediate-level directories needed to contain the leaf directory.
sv: Funktion för rekursivt skapande av kataloger. Som :func:`mkdir`, men skapar alla kataloger på mellannivå som behövs för att innehålla bladkatalogen.

source: The *mode* parameter is passed to :func:`mkdir` for creating the leaf directory; see :ref:`the mkdir() description <mkdir_modebits>` for how it is interpreted. To set the file permission bits of any newly created parent directories you can set the umask before invoking :func:`makedirs`. The file permission bits of existing parent directories are not changed.
sv: Parametern *mode* skickas till :func:`mkdir` för att skapa bladkatalogen; se :ref:``beskrivningen av mkdir() <mkdir_modebits>` för hur den tolkas. För att ställa in filbehörighetsbitarna för alla nyskapade överordnade kataloger kan du ställa in umask innan du anropar :func:`makedirs`. Filbehörighetsbitarna för befintliga överordnade kataloger ändras inte.

source: If *exist_ok* is ``False`` (the default), a :exc:`FileExistsError` is raised if the target directory already exists.
sv: Om *exist_ok* är ``False`` (standard), uppstår ett :exc:`FileExistsError` om målkatalogen redan existerar.

source: :func:`makedirs` will become confused if the path elements to create include :data:`pardir` (eg. ".." on UNIX systems).
sv: :func:`makedirs` blir förvirrad om sökvägselementen som ska skapas innehåller :data:`pardir` (t.ex. ".." på UNIX-system).

source: This function handles UNC paths correctly.
sv: Denna funktion hanterar UNC-sökvägar korrekt.

source: Added the *exist_ok* parameter.
sv: Parametern *exist_ok* har lagts till.

source: Before Python 3.4.1, if *exist_ok* was ``True`` and the directory existed, :func:`makedirs` would still raise an error if *mode* did not match the mode of the existing directory. Since this behavior was impossible to implement safely, it was removed in Python 3.4.1. See :issue:`21082`.
sv: Före Python 3.4.1, om *exist_ok* var ``True`` och katalogen existerade, skulle :func:`makedirs` fortfarande ge upphov till ett fel om *mode* inte matchade läget för den befintliga katalogen. Eftersom detta beteende var omöjligt att implementera på ett säkert sätt togs det bort i Python 3.4.1. Se :issue:`21082`.

source: The *mode* argument no longer affects the file permission bits of newly created intermediate-level directories.
sv: Argumentet *mode* påverkar inte längre filbehörighetsbitarna för nyskapade kataloger på mellannivå.

source: Create a FIFO (a named pipe) named *path* with numeric mode *mode*. The current umask value is first masked out from the mode.
sv: Skapa en FIFO (en namngiven pipe) med namnet *path* och det numeriska läget *mode*. Det aktuella umask-värdet maskeras först bort från läget.

source: FIFOs are pipes that can be accessed like regular files. FIFOs exist until they are deleted (for example with :func:`os.unlink`). Generally, FIFOs are used as rendezvous between "client" and "server" type processes: the server opens the FIFO for reading, and the client opens it for writing. Note that :func:`mkfifo` doesn't open the FIFO --- it just creates the rendezvous point.
sv: FIFO:er är pipes som kan nås som vanliga filer. FIFO:er existerar tills de raderas (t.ex. med :func:`os.unlink`). I allmänhet används FIFO:er som mötesplatser mellan processer av typen "klient" och "server": servern öppnar FIFO:n för läsning och klienten öppnar den för skrivning. Observera att :func:`mkfifo` inte öppnar FIFO:n --- den skapar bara en mötesplats.

source: Create a filesystem node (file, device special file or named pipe) named *path*. *mode* specifies both the permissions to use and the type of node to be created, being combined (bitwise OR) with one of ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK``, and ``stat.S_IFIFO`` (those constants are available in :mod:`stat`). For ``stat.S_IFCHR`` and ``stat.S_IFBLK``, *device* defines the newly created device special file (probably using :func:`os.makedev`), otherwise it is ignored.
sv: Skapa en filsystemnod (fil, enhetsspecialfil eller named pipe) med namnet *path*. *mode* anger både vilka behörigheter som ska användas och vilken typ av nod som ska skapas, genom att kombineras (bitvis OR) med en av ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK`` och ``stat.S_IFIFIFO`` (dessa konstanter finns i :mod:`stat`). För ``stat.S_IFCHR`` och ``stat.S_IFBLK`` definierar *device* den nyskapade enhetens specialfil (troligen med hjälp av :func:`os.makedev`), annars ignoreras den.

source: Extract the device major number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:struct:`stat`).
sv: Extrahera enhetens huvudnummer från ett obearbetat enhetsnummer (vanligtvis fältet :attr:`st_dev` eller :attr:`st_rdev` från :c:struct:`stat`).

source: Extract the device minor number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:struct:`stat`).
sv: Extrahera enhetens mindre nummer från ett obearbetat enhetsnummer (vanligtvis fältet :attr:`st_dev` eller :attr:`st_rdev` från :c:struct:`stat`).

source: Compose a raw device number from the major and minor device numbers.
sv: Sammanställ ett obearbetat enhetsnummer från de större och mindre enhetsnumren.

source: Return system configuration information relevant to a named file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
sv: Returnerar information om systemkonfiguration som är relevant för en namngiven fil. *name* anger det konfigurationsvärde som ska hämtas; det kan vara en sträng som är namnet på ett definierat systemvärde; dessa namn anges i ett antal standarder (POSIX.1, Unix 95, Unix 98 m.fl.). Vissa plattformar definierar även ytterligare namn. De namn som är kända av värdoperativsystemet anges i ordlistan ``pathconf_names``. För konfigurationsvariabler som inte ingår i denna mappning accepteras också att *name* ersätts med ett heltal.

source: This function can support :ref:`specifying a file descriptor <path_fd>`.
sv: Den här funktionen kan stödja :ref:`angivelse av en filbeskrivare <path_fd>`.

source: Dictionary mapping names accepted by :func:`pathconf` and :func:`fpathconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
sv: Ordbok som mappar namn som accepteras av :func:`pathconf` och :func:`fpathconf` till de heltalsvärden som värdoperativsystemet har definierat för dessa namn. Detta kan användas för att bestämma den uppsättning namn som är kända av systemet.

source: Return a string representing the path to which the symbolic link points. The result may be either an absolute or relative pathname; if it is relative, it may be converted to an absolute pathname using ``os.path.join(os.path.dirname(path), result)``.
sv: Returnerar en sträng som representerar den sökväg som den symboliska länken pekar på. Resultatet kan vara antingen ett absolut eller relativt sökvägsnamn; om det är relativt kan det konverteras till ett absolut sökvägsnamn med ``os.path.join(os.path.dirname(path), result)``.

source: If the *path* is a string object (directly or indirectly through a :class:`PathLike` interface), the result will also be a string object, and the call may raise a UnicodeDecodeError. If the *path* is a bytes object (direct or indirectly), the result will be a bytes object.
sv: Om *path* är ett strängobjekt (direkt eller indirekt via ett :class:`PathLike`-gränssnitt), blir resultatet också ett strängobjekt och anropet kan ge upphov till ett UnicodeDecodeError. Om *sökvägen* är ett bytesobjekt (direkt eller indirekt), kommer resultatet att vara ett bytesobjekt.

source: When trying to resolve a path that may contain links, use :func:`~os.path.realpath` to properly handle recursion and platform differences.
sv: När du försöker lösa en sökväg som kan innehålla länkar, använd :func:`~os.path.realpath` för att hantera rekursion och plattformsskillnader på rätt sätt.

source: Accepts a :term:`path-like object` on Unix.
sv: Accepterar en :term:`path-like object` på Unix.

source: Accepts a :term:`path-like object` and a bytes object on Windows.
sv: Accepterar en :term:`path-like object` och ett bytes-objekt på Windows.

source: Added support for directory junctions, and changed to return the substitution path (which typically includes ``\\?\`` prefix) rather than the optional "print name" field that was previously returned.
sv: Lagt till stöd för katalogförgreningar och ändrat så att substitutionssökvägen returneras (vilket vanligtvis inkluderar prefixet "``\?\``) i stället för det valfria fältet "print name" som tidigare returnerades.

source: Remove (delete) the file *path*. If *path* is a directory, an :exc:`OSError` is raised. Use :func:`rmdir` to remove directories. If the file does not exist, a :exc:`FileNotFoundError` is raised.
sv: Ta bort (delete) filen *path*. Om *sökväg* är en katalog genereras ett :exc:`OSError`. Använd :func:`rmdir` för att ta bort kataloger. Om filen inte finns genereras ett :exc:`FileNotFoundError`.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>`.
sv: Den här funktionen kan stödja :ref:`sökvägar som är relativa till katalogbeskrivare <dir_fd>`.

source: On Windows, attempting to remove a file that is in use causes an exception to be raised; on Unix, the directory entry is removed but the storage allocated to the file is not made available until the original file is no longer in use.
sv: I Windows uppstår ett undantag när man försöker ta bort en fil som används. I Unix tas katalogposten bort, men det lagringsutrymme som tilldelats filen görs inte tillgängligt förrän den ursprungliga filen inte längre används.

source: This function is semantically identical to :func:`unlink`.
sv: Denna funktion är semantiskt identisk med :func:`unlink`.

source: Raises an :ref:`auditing event <auditing>` ``os.remove`` with arguments ``path``, ``dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.remove`` med argumenten ``path``, ``dir_fd``.

source: Remove directories recursively. Works like :func:`rmdir` except that, if the leaf directory is successfully removed, :func:`removedirs` tries to successively remove every parent directory mentioned in *path* until an error is raised (which is ignored, because it generally means that a parent directory is not empty). For example, ``os.removedirs('foo/bar/baz')`` will first remove the directory ``'foo/bar/baz'``, and then remove ``'foo/bar'`` and ``'foo'`` if they are empty. Raises :exc:`OSError` if the leaf directory could not be successfully removed.
sv: Ta bort kataloger rekursivt. Fungerar som :func:`rmdir` förutom att, om bladkatalogen tas bort framgångsrikt, försöker :func:`removedirs` successivt ta bort varje överordnad katalog som nämns i *path* tills ett fel uppstår (vilket ignoreras, eftersom det i allmänhet betyder att en överordnad katalog inte är tom). Till exempel kommer ``os.removedirs('foo/bar/baz')`` först att ta bort katalogen ``'foo/bar/baz'``, och sedan ta bort ``'foo/bar'`` och ``'foo'`` om de är tomma. Utlöser :exc:`OSError` om bladkatalogen inte kunde tas bort på ett framgångsrikt sätt.

source: Rename the file or directory *src* to *dst*. If *dst* exists, the operation will fail with an :exc:`OSError` subclass in a number of cases:
sv: Byt namn på filen eller katalogen *src* till *dst*. Om *dst* finns kommer åtgärden att misslyckas med en :exc:`OSError`-underklass i ett antal fall:

source: On Windows, if *dst* exists a :exc:`FileExistsError` is always raised. The operation may fail if *src* and *dst* are on different filesystems. Use :func:`shutil.move` to support moves to a different filesystem.
sv: I Windows, om *dst* existerar, genereras alltid ett :exc:`FileExistsError`. Operationen kan misslyckas om *src* och *dst* finns på olika filsystem. Använd :func:`shutil.move` för att stödja flytt till ett annat filsystem.

source: On Unix, if *src* is a file and *dst* is a directory or vice-versa, an :exc:`IsADirectoryError` or a :exc:`NotADirectoryError` will be raised respectively. If both are directories and *dst* is empty, *dst* will be silently replaced. If *dst* is a non-empty directory, an :exc:`OSError` is raised. If both are files, *dst* will be replaced silently if the user has permission. The operation may fail on some Unix flavors if *src* and *dst* are on different filesystems. If successful, the renaming will be an atomic operation (this is a POSIX requirement).
sv: På Unix, om *src* är en fil och *dst* är en katalog eller vice versa, kommer ett :exc:`IsADirectoryError` eller ett :exc:`NotADirectoryError` att uppstå. Om båda är kataloger och *dst* är tom, kommer *dst* att ersättas i tysthet. Om *dst* är en katalog som inte är tom genereras ett :exc:`OSError`. Om båda är filer kommer *dst* att ersättas i tysthet om användaren har behörighet. Operationen kan misslyckas på vissa Unix-versioner om *src* och *dst* finns på olika filsystem. Om namnbytet lyckas kommer det att vara en atomisk operation (detta är ett POSIX-krav).

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`.
sv: Denna funktion kan stödja angivande av *src_dir_fd* och/eller *dst_dir_fd* för att tillhandahålla :ref:`sökvägar relativt katalogbeskrivare <dir_fd>`.

source: If you want cross-platform overwriting of the destination, use :func:`replace`.
sv: Om du vill att destinationen ska skrivas över på flera plattformar använder du :func:`replace`.

source: Raises an :ref:`auditing event <auditing>` ``os.rename`` with arguments ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.rename`` med argumenten ``src``, ``dst``, ```src_dir_fd``, ``dst_dir_fd``.

source: Added the *src_dir_fd* and *dst_dir_fd* parameters.
sv: Parametrarna *src_dir_fd* och *dst_dir_fd* har lagts till.

source: Recursive directory or file renaming function. Works like :func:`rename`, except creation of any intermediate directories needed to make the new pathname good is attempted first. After the rename, directories corresponding to rightmost path segments of the old name will be pruned away using :func:`removedirs`.
sv: Rekursiv funktion för att byta namn på kataloger eller filer. Fungerar som :func:`rename`, förutom att skapandet av eventuella mellanliggande kataloger som behövs för att göra det nya sökvägsnamnet bra först försöker. Efter namnbytet kommer kataloger som motsvarar det gamla namnet längst till höger i sökvägen att rensas bort med :func:`removedirs`.

source: This function can fail with the new directory structure made if you lack permissions needed to remove the leaf directory or file.
sv: Denna funktion kan misslyckas med den nya katalogstrukturen som skapats om du saknar de behörigheter som krävs för att ta bort bladkatalogen eller filen.

source: Accepts a :term:`path-like object` for *old* and *new*.
sv: Accepterar en :term:`path-liknande objekt` för *gammal* och *ny*.

source: Rename the file or directory *src* to *dst*. If *dst* is a non-empty directory, :exc:`OSError` will be raised. If *dst* exists and is a file, it will be replaced silently if the user has permission. The operation may fail if *src* and *dst* are on different filesystems. If successful, the renaming will be an atomic operation (this is a POSIX requirement).
sv: Byt namn på filen eller katalogen *src* till *dst*. Om *dst* är en katalog som inte är tom kommer :exc:`OSError` att aktiveras. Om *dst* finns och är en fil, kommer den att ersättas tyst om användaren har behörighet. Operationen kan misslyckas om *src* och *dst* finns på olika filsystem. Om namnbytet lyckas kommer det att vara en atomisk operation (detta är ett POSIX-krav).

source: Remove (delete) the directory *path*. If the directory does not exist or is not empty, a :exc:`FileNotFoundError` or an :exc:`OSError` is raised respectively. In order to remove whole directory trees, :func:`shutil.rmtree` can be used.
sv: Ta bort (delete) katalogen *path*. Om katalogen inte finns eller inte är tom, visas ett :exc:`FileNotFoundError` eller ett :exc:`OSError`. För att ta bort hela katalogträd kan :func:`shutil.rmtree` användas.

source: Raises an :ref:`auditing event <auditing>` ``os.rmdir`` with arguments ``path``, ``dir_fd``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``os.rmdir`` med argumenten ``path``, ``dir_fd``.

source: Return an iterator of :class:`os.DirEntry` objects corresponding to the entries in the directory given by *path*. The entries are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included. If a file is removed from or added to the directory after creating the iterator, whether an entry for that file be included is unspecified.
sv: Returnerar en iterator av :class:`os.DirEntry`-objekt som motsvarar posterna i den katalog som anges av *path*. Posterna returneras i godtycklig ordning, och specialposterna ``'.'`` och ``'..'`` inkluderas inte. Om en fil tas bort från eller läggs till i katalogen efter att iteratorn skapats, är det ospecificerat om en post för den filen ska inkluderas.
