Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: Return the effective group id of the current process. This corresponds to the "set id" bit on the file being executed in the current process.
sv: Returnerar det effektiva grupp-ID:t för den aktuella processen. Detta motsvarar "set id"-biten i den fil som körs i den aktuella processen.

source: Return the current process's effective user id.
sv: Returnerar den aktuella processens effektiva användar-ID.

source: Return the real group id of the current process.
sv: Returnerar det verkliga grupp-ID:t för den aktuella processen.

source: The function is a stub on WASI, see :ref:`wasm-availability` for more information.
sv: Funktionen är en stub på WASI, se :ref:`wasm-availability` för mer information.

source: Return list of group ids that *user* belongs to. If *group* is not in the list, it is included; typically, *group* is specified as the group ID field from the password record for *user*, because that group ID will otherwise be potentially omitted.
sv: Returnerar listan med grupp-ID:n som *användare* tillhör. Om *group* inte finns i listan inkluderas den; vanligtvis anges *group* som grupp-ID-fältet från lösenordsposten för *user*, eftersom det grupp-ID:t annars potentiellt kan utelämnas.

source: Return list of supplemental group ids associated with the current process.
sv: Returnera listan med kompletterande grupp-ID:n som är associerade med den aktuella processen.

source: On macOS, :func:`getgroups` behavior differs somewhat from other Unix platforms. If the Python interpreter was built with a deployment target of ``10.5`` or earlier, :func:`getgroups` returns the list of effective group ids associated with the current user process; this list is limited to a system-defined number of entries, typically 16, and may be modified by calls to :func:`setgroups` if suitably privileged. If built with a deployment target greater than ``10.5``, :func:`getgroups` returns the current group access list for the user associated with the effective user id of the process; the group access list may change over the lifetime of the process, it is not affected by calls to :func:`setgroups`, and its length is not limited to 16. The deployment target value, :const:`MACOSX_DEPLOYMENT_TARGET`, can be obtained with :func:`sysconfig.get_config_var`.
sv: På macOS skiljer sig :func:`getgroups` beteende något från andra Unix-plattformar. Om Python-tolken byggdes med ett implementeringsmål på ``10.5`` eller tidigare, returnerar :func:`getgroups` listan över effektiva grupp-id:n som är associerade med den aktuella användarprocessen; denna lista är begränsad till ett systemdefinierat antal poster, vanligtvis 16, och kan ändras genom anrop till :func:`setgroups` om det finns lämpliga privilegier. Om den byggs med ett distributionsmål som är större än ``10.5`` returnerar :func:`getgroups` den aktuella gruppåtkomstlistan för den användare som är associerad med processens effektiva användar-ID; gruppåtkomstlistan kan ändras under processens livstid, den påverkas inte av anrop till :func:`setgroups` och dess längd är inte begränsad till 16. Deployment target-värdet, :const:`MACOSX_DEPLOYMENT_TARGET`, kan erhållas med :func:`sysconfig.get_config_var`.

source: Return the name of the user logged in on the controlling terminal of the process. For most purposes, it is more useful to use :func:`getpass.getuser` since the latter checks the environment variables :envvar:`LOGNAME` or :envvar:`USERNAME` to find out who the user is, and falls back to ``pwd.getpwuid(os.getuid())[0]`` to get the login name of the current real user id.
sv: Returnerar namnet på den användare som är inloggad på processens kontrollterminal. För de flesta ändamål är det mer användbart att använda :func:`getpass.getuser` eftersom den senare kontrollerar miljövariablerna :envvar:`LOGNAME` eller :envvar:`USERNAME` för att ta reda på vem användaren är, och faller tillbaka på ``pwd.getpwuid(os.getuid())[0]`` för att få inloggningsnamnet för det aktuella verkliga användar-id:et.

source: Return the process group id of the process with process id *pid*. If *pid* is 0, the process group id of the current process is returned.
sv: Returnerar processgrupps-id för processen med process-id *pid*. Om *pid* är 0 returneras processgrupps-id för den aktuella processen.

source: Return the id of the current process group.
sv: Returnerar id för den aktuella processgruppen.

source: Return the current process id.
sv: Returnerar det aktuella process-ID:t.

source: Return the parent's process id. When the parent process has exited, on Unix the id returned is the one of the init process (1), on Windows it is still the same id, which may be already reused by another process.
sv: Returnerar den överordnade processens id. När den överordnade processen har avslutats är det id som returneras på Unix init-processens id (1), på Windows är det fortfarande samma id, som kanske redan återanvänds av en annan process.

source: Added support for Windows.
sv: Stöd för Windows har lagts till.

source: Get program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process.
sv: Hämta prioritet för programschemaläggning. Värdet *which* är ett av :const:`PRIO_PROCESS`, :const:`PRIO_PGRP` eller :const:`PRIO_USER`, och *who* tolkas i förhållande till *which* (en processidentifierare för :const:`PRIO_PROCESS`, en processgruppsidentifierare för :const:`PRIO_PGRP` och ett användar-ID för :const:`PRIO_USER`). Ett nollvärde för *who* betecknar (respektive) den anropande processen, den anropande processens processgrupp eller den anropande processens verkliga användar-ID.

source: Parameters for the :func:`getpriority` and :func:`setpriority` functions.
sv: Parametrar för funktionerna :func:`getpriority` och :func:`setpriority`.

source: Return a tuple (ruid, euid, suid) denoting the current process's real, effective, and saved user ids.
sv: Returnerar en tupel (ruid, euid, suid) som anger den aktuella processens verkliga, effektiva och sparade användar-id.

source: Return a tuple (rgid, egid, sgid) denoting the current process's real, effective, and saved group ids.
sv: Returnerar en tupel (rgid, egid, sgid) som anger den aktuella processens verkliga, effektiva och sparade grupp-id.

source: Return the current process's real user id.
sv: Returnerar den aktuella processens riktiga användar-ID.

source: Call the system initgroups() to initialize the group access list with all of the groups of which the specified username is a member, plus the specified group id.
sv: Anropa systemet initgroups() för att initiera gruppåtkomstlistan med alla de grupper som det angivna användarnamnet är medlem i, plus det angivna grupp-ID:t.

source: Set the environment variable named *key* to the string *value*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
sv: Ställ in miljövariabeln med namnet *key* till strängen *value*. Sådana ändringar i miljön påverkar underprocesser som startas med :func:`os.system`, :func:`popen` eller :func:`fork` och :func:`execv`.

source: Assignments to items in :data:`os.environ` are automatically translated into corresponding calls to :func:`putenv`; however, calls to :func:`putenv` don't update :data:`os.environ`, so it is actually preferable to assign to items of :data:`os.environ`. This also applies to :func:`getenv` and :func:`getenvb`, which respectively use :data:`os.environ` and :data:`os.environb` in their implementations.
sv: Tilldelningar till objekt i :data:`os.environ` översätts automatiskt till motsvarande anrop till :func:`putenv`; anrop till :func:`putenv` uppdaterar dock inte :data:`os.environ`, så det är faktiskt att föredra att tilldela till objekt i :data:`os.environ`. Detta gäller även :func:`getenv` och :func:`getenvb`, som använder :data:`os.environ` respektive :data:`os.environb` i sina implementationer.

source: See also the :func:`os.reload_environ` function.
sv: Se även funktionen :func:`os.reload_environ`.

source: On some platforms, including FreeBSD and macOS, setting ``environ`` may cause memory leaks. Refer to the system documentation for :c:func:`!putenv`.
sv: På vissa plattformar, inklusive FreeBSD och macOS, kan inställningen ``environ`` orsaka minnesläckage. Se systemdokumentationen för :c:func:`!putenv`.

source: Raises an :ref:`auditing event <auditing>` ``os.putenv`` with arguments ``key``, ``value``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.putenv`` med argumenten ``key``, ``value``.

source: The function is now always available.
sv: Funktionen är nu alltid tillgänglig.

source: Set the current process's effective group id.
sv: Ange den aktuella processens effektiva grupp-ID.

source: Set the current process's effective user id.
sv: Ange den aktuella processens effektiva användar-ID.

source: Set the current process' group id.
sv: Ange grupp-ID för den aktuella processen.

source: Set the list of supplemental group ids associated with the current process to *groups*. *groups* must be a sequence, and each element must be an integer identifying a group. This operation is typically available only to the superuser.
sv: Ställ in listan över kompletterande grupp-id:n som associeras med den aktuella processen till *groups*. *groups* måste vara en sekvens och varje element måste vara ett heltal som identifierar en grupp. Denna åtgärd är vanligtvis endast tillgänglig för superanvändaren.

source: On macOS, the length of *groups* may not exceed the system-defined maximum number of effective group ids, typically 16. See the documentation for :func:`getgroups` for cases where it may not return the same group list set by calling setgroups().
sv: På macOS får längden på *groups* inte överstiga det systemdefinierade maximala antalet effektiva grupp-id:n, vanligtvis 16. Se dokumentationen för :func:`getgroups` för fall där den kanske inte returnerar samma grupplista som ställts in genom anrop av setgroups().

source: Reassociate the current thread with a Linux namespace. See the :manpage:`setns(2)` and :manpage:`namespaces(7)` man pages for more details.
sv: Kopplar om den aktuella tråden till ett Linux-namnområde. Se manualerna :manpage:`setns(2)` och :manpage:`namespaces(7)` för mer information.

source: If *fd* refers to a :file:`/proc/{pid}/ns/` link, ``setns()`` reassociates the calling thread with the namespace associated with that link, and *nstype* may be set to one of the :ref:`CLONE_NEW* constants <os-unshare-clone-flags>` to impose constraints on the operation (``0`` means no constraints).
sv: Om *fd* refererar till en :file:`/proc/{pid}/ns/` länk, ``setns()`` återassocierar den anropande tråden med namnrymden som associeras med länken, och *nstype* kan sättas till en av :ref:`CLONE_NEW* konstanterna <os-unshare-clone-flags>` för att införa begränsningar för operationen (``0`` betyder inga begränsningar).

source: Since Linux 5.8, *fd* may refer to a PID file descriptor obtained from :func:`~os.pidfd_open`. In this case, ``setns()`` reassociates the calling thread into one or more of the same namespaces as the thread referred to by *fd*. This is subject to any constraints imposed by *nstype*, which is a bit mask combining one or more of the :ref:`CLONE_NEW* constants <os-unshare-clone-flags>`, e.g. ``setns(fd, os.CLONE_NEWUTS | os.CLONE_NEWPID)``. The caller's memberships in unspecified namespaces are left unchanged.
sv: Sedan Linux 5.8 kan *fd* referera till en PID-filbeskrivare som erhållits från :func:`~os.pidfd_open`. I detta fall återassocierar ``setns()`` den anropande tråden till ett eller flera av samma namnrymder som den tråd som *fd* refererar till. Detta är föremål för eventuella begränsningar som åläggs av *nstype*, som är en bitmask som kombinerar en eller flera av :ref:`CLONE_NEW*-konstanterna <os-unshare-clone-flags>`, t.ex. ``setns(fd, os.CLONE_NEWUTS | os.CLONE_NEWPID)``. Anroparens medlemskap i ospecificerade namnrymder lämnas oförändrade.

source: *fd* can be any object with a :meth:`~io.IOBase.fileno` method, or a raw file descriptor.
sv: *fd* kan vara vilket objekt som helst med en :meth:`~io.IOBase.fileno`-metod eller en rå filbeskrivare.

source: This example reassociates the thread with the ``init`` process's network namespace::
sv: I detta exempel kopplas tråden om till ``init``-processens nätverksnamnrymd::

source: The :func:`~os.unshare` function.
sv: Funktionen :func:`~os.unshare`.

source: Call the system call :c:func:`!setpgrp` or ``setpgrp(0, 0)`` depending on which version is implemented (if any). See the Unix manual for the semantics.
sv: Anropa systemanropet :c:func:`!setpgrp` eller ``setpgrp(0, 0)`` beroende på vilken version som är implementerad (om någon). Se Unix-manualen för semantiken.

source: Call the system call :c:func:`!setpgid` to set the process group id of the process with id *pid* to the process group with id *pgrp*. See the Unix manual for the semantics.
sv: Anropa systemanropet :c:func:`!setpgid` för att ange processgrupps-id för processen med id *pid* till processgruppen med id *pgrp*. Se Unix-manualen för semantiken.

source: Set program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process. *priority* is a value in the range -20 to 19. The default priority is 0; lower priorities cause more favorable scheduling.
sv: Ställer in prioritet för programschemaläggning. Värdet *which* är ett av :const:`PRIO_PROCESS`, :const:`PRIO_PGRP` eller :const:`PRIO_USER`, och *who* tolkas i förhållande till *which* (en processidentifierare för :const:`PRIO_PROCESS`, en processgruppsidentifierare för :const:`PRIO_PGRP` och ett användar-ID för :const:`PRIO_USER`). Ett nollvärde för *who* betecknar (respektive) den anropande processen, den anropande processens processgrupp eller den anropande processens verkliga användar-ID. *priority* är ett värde i intervallet -20 till 19. Standardprioriteten är 0; lägre prioriteringar ger en mer gynnsam schemaläggning.

source: Set the current process's real and effective group ids.
sv: Ange den aktuella processens verkliga och effektiva grupp-ID:n.

source: Set the current process's real, effective, and saved group ids.
sv: Ange den aktuella processens verkliga, effektiva och sparade grupp-id:n.

source: Set the current process's real, effective, and saved user ids.
sv: Ange den aktuella processens verkliga, effektiva och sparade användar-ID:n.

source: Set the current process's real and effective user ids.
sv: Ange den aktuella processens verkliga och effektiva användar-id.

source: Call the system call :c:func:`!getsid`. See the Unix manual for the semantics.
sv: Anropa systemanropet :c:func:`!getsid`. Se Unix-manualen för semantiken.

source: Call the system call :c:func:`!setsid`. See the Unix manual for the semantics.
sv: Anropa systemanropet :c:func:`!setsid`. Se Unix-manualen för semantiken.

source: Set the current process's user id.
sv: Ange användar-ID för den aktuella processen.

source: Return the error message corresponding to the error code in *code*. On platforms where :c:func:`!strerror` returns ``NULL`` when given an unknown error number, :exc:`ValueError` is raised.
sv: Returnerar felmeddelandet som motsvarar felkoden i *code*. På plattformar där :c:func:`!strerror` returnerar ``NULL`` när det ges ett okänt felnummer, uppstår :exc:`ValueError`.

source: ``True`` if the native OS type of the environment is bytes (eg. ``False`` on Windows).
sv: ``True`` om den ursprungliga OS-typen för miljön är bytes (t.ex. ``False`` på Windows).

source: Set the current numeric umask and return the previous umask.
sv: Ställ in den aktuella numeriska umasken och returnera den föregående umasken.

source: Returns information identifying the current operating system. The return value is an object with five attributes:
sv: Returnerar information som identifierar det aktuella operativsystemet. Returvärdet är ett objekt med fem attribut:

source: :attr:`sysname` - operating system name
sv: :attr:`sysname` - namn på operativsystemet

source: :attr:`nodename` - name of machine on network (implementation-defined)
sv: :attr:`nodename` - namn på maskin i nätverk (implementationsdefinierat)

source: :attr:`release` - operating system release
sv: :attr:`release` - version av operativsystemet

source: :attr:`version` - operating system version
sv: :attr:`version` - version av operativsystemet

source: :attr:`machine` - hardware identifier
sv: :attr:`machine` - identifierare för maskinvara

source: For backwards compatibility, this object is also iterable, behaving like a five-tuple containing :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version`, and :attr:`machine` in that order.
sv: För bakåtkompatibilitet är detta objekt också itererbart och beter sig som en femtupel som innehåller :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version` och :attr:`machine` i den ordningen.

source: Some systems truncate :attr:`nodename` to 8 characters or to the leading component; a better way to get the hostname is :func:`socket.gethostname` or even ``socket.gethostbyaddr(socket.gethostname())``.
sv: Vissa system trunkerar :attr:`nodename` till 8 tecken eller till den inledande komponenten; ett bättre sätt att få fram värdnamnet är :func:`socket.gethostname` eller till och med ``socket.gethostbyaddr(socket.gethostname())``.

source: On macOS, iOS and Android, this returns the *kernel* name and version (i.e., ``'Darwin'`` on macOS and iOS; ``'Linux'`` on Android). :func:`platform.uname` can be used to get the user-facing operating system name and version on iOS and Android.
sv: På macOS, iOS och Android returnerar detta *kärnans* namn och version (dvs. ``'Darwin'`` på macOS och iOS; ``'Linux'`` på Android). :func:`platform.uname` kan användas för att få namnet och versionen på det operativsystem som vänder sig till användaren på iOS och Android.

source: Return type changed from a tuple to a tuple-like object with named attributes.
sv: Returtypen ändrades från en tupel till ett tupelliknande objekt med namngivna attribut.

source: Unset (delete) the environment variable named *key*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
sv: Ta bort (unset) miljövariabeln med namnet *key*. Sådana ändringar i miljön påverkar underprocesser som startas med :func:`os.system`, :func:`popen` eller :func:`fork` och :func:`execv`.

source: Deletion of items in :data:`os.environ` is automatically translated into a corresponding call to :func:`unsetenv`; however, calls to :func:`unsetenv` don't update :data:`os.environ`, so it is actually preferable to delete items of :data:`os.environ`.
sv: Radering av objekt i :data:`os.environ` översätts automatiskt till ett motsvarande anrop till :func:`unsetenv`; anrop till :func:`unsetenv` uppdaterar dock inte :data:`os.environ`, så det är faktiskt att föredra att radera objekt i :data:`os.environ`.

source: Raises an :ref:`auditing event <auditing>` ``os.unsetenv`` with argument ``key``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.unsetenv`` med argumentet ``key``.

source: The function is now always available and is also available on Windows.
sv: Funktionen är nu alltid tillgänglig och finns även i Windows.

source: Disassociate parts of the process execution context, and move them into a newly created namespace. See the :manpage:`unshare(2)` man page for more details. The *flags* argument is a bit mask, combining zero or more of the :ref:`CLONE_* constants <os-unshare-clone-flags>`, that specifies which parts of the execution context should be unshared from their existing associations and moved to a new namespace. If the *flags* argument is ``0``, no changes are made to the calling process's execution context.
sv: Avskiljer delar av processens exekveringskontext och flyttar dem till ett nyskapat namnområde. Se :manpage:`unshare(2)` man page för mer information. Argumentet *flags* är en bitmask som kombinerar noll eller flera av :ref:`CLONE_*-konstanterna <os-unshare-clone-flags>`, som anger vilka delar av exekveringskontexten som ska skiljas från sina befintliga associationer och flyttas till ett nytt namnområde. Om argumentet *flags* är ``0`` görs inga ändringar i den anropande processens exekveringskontext.

source: The :func:`~os.setns` function.
sv: Funktionen :func:`~os.setns`.

source: Flags to the :func:`unshare` function, if the implementation supports them. See :manpage:`unshare(2)` in the Linux manual for their exact effect and availability.
sv: Flaggor till funktionen :func:`unshare`, om implementationen stödjer dem. Se :manpage:`unshare(2)` i Linux-manualen för deras exakta effekt och tillgänglighet.

source: File Object Creation
sv: Skapande av filobjekt

source: These functions create new :term:`file objects <file object>`. (See also :func:`~os.open` for opening file descriptors.)
sv: Dessa funktioner skapar nya :term:`filobjekt <file object>`. (Se även :func:`~os.open` för att öppna filbeskrivare)

source: Return an open file object connected to the file descriptor *fd*. This is an alias of the :func:`open` built-in function and accepts the same arguments. The only difference is that the first argument of :func:`fdopen` must always be an integer.
sv: Returnerar ett öppet filobjekt som är anslutet till filbeskrivaren *fd*. Detta är ett alias för den inbyggda funktionen :func:`open` och accepterar samma argument. Den enda skillnaden är att det första argumentet i :func:`fdopen` alltid måste vara ett heltal.

source: File Descriptor Operations
sv: Operationer för filbeskrivare

source: These functions operate on I/O streams referenced using file descriptors.
sv: Dessa funktioner arbetar med I/O-strömmar som refereras med hjälp av filbeskrivare.

source: File descriptors are small integers corresponding to a file that has been opened by the current process. For example, standard input is usually file descriptor 0, standard output is 1, and standard error is 2. Further files opened by a process will then be assigned 3, 4, 5, and so forth. The name "file descriptor" is slightly deceptive; on Unix platforms, sockets and pipes are also referenced by file descriptors.
sv: File descriptors är små heltal som motsvarar en fil som har öppnats av den aktuella processen. Till exempel är standardinmatning vanligtvis fildeskriptor 0, standardutmatning är 1 och standardfel är 2. Ytterligare filer som öppnas av en process tilldelas sedan 3, 4, 5 och så vidare. Namnet "file descriptor" är något missvisande; på Unix-plattformar refereras även sockets och pipes till file descriptors.

source: The :meth:`~io.IOBase.fileno` method can be used to obtain the file descriptor associated with a :term:`file object` when required. Note that using the file descriptor directly will bypass the file object methods, ignoring aspects such as internal buffering of data.
sv: Metoden :meth:`~io.IOBase.fileno` kan användas för att erhålla den filbeskrivning som är associerad med ett :term:`file-objekt` när så krävs. Observera att om du använder filbeskrivaren direkt kommer du att kringgå filobjektets metoder och ignorera aspekter som intern buffring av data.
