Repository: yeager/python-docs-sv
Catalog: library/os.po
Languages: sv

source: ``st_ctime`` is deprecated on Windows. Use ``st_birthtime`` for the file creation time. In the future, ``st_ctime`` will contain the time of the most recent metadata change, as for other platforms.
sv: ``st_ctime`` är föråldrad i Windows. Använd ``st_birthtime`` för tiden då filen skapades. I framtiden kommer ``st_ctime`` att innehålla tiden för den senaste metadataändringen, som för andra plattformar.

source: Time of most recent access expressed in nanoseconds as an integer.
sv: Tidpunkt för senaste åtkomst uttryckt i nanosekunder som ett heltal.

source: Time of most recent content modification expressed in nanoseconds as an integer.
sv: Tidpunkt för den senaste innehållsändringen uttryckt i nanosekunder som ett heltal.

source: Time of most recent metadata change expressed in nanoseconds as an integer.
sv: Tidpunkt för den senaste ändringen av metadata uttryckt i nanosekunder som ett heltal.

source: ``st_ctime_ns`` is deprecated on Windows. Use ``st_birthtime_ns`` for the file creation time. In the future, ``st_ctime`` will contain the time of the most recent metadata change, as for other platforms.
sv: ``st_ctime_ns`` är föråldrad i Windows. Använd ``st_birthtime_ns`` för tiden då filen skapades. I framtiden kommer ``st_ctime`` att innehålla tiden för den senaste metadataändringen, som för andra plattformar.

source: Time of file creation expressed in seconds. This attribute is not always available, and may raise :exc:`AttributeError`.
sv: Tidpunkt för filskapande uttryckt i sekunder. Detta attribut är inte alltid tillgängligt och kan ge upphov till :exc:`AttributeError`.

source: ``st_birthtime`` is now available on Windows.
sv: ``st_birthtime`` är nu tillgängligt på Windows.

source: Time of file creation expressed in nanoseconds as an integer. This attribute is not always available, and may raise :exc:`AttributeError`.
sv: Tidpunkt för filskapande uttryckt i nanosekunder som ett heltal. Detta attribut är inte alltid tillgängligt och kan ge upphov till :exc:`AttributeError`.

source: The exact meaning and resolution of the :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` and :attr:`st_birthtime` attributes depend on the operating system and the file system. For example, on Windows systems using the FAT32 file systems, :attr:`st_mtime` has 2-second resolution, and :attr:`st_atime` has only 1-day resolution. See your operating system documentation for details.
sv: Den exakta betydelsen och upplösningen av attributen :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` och :attr:`st_birthtime` beror på operativsystemet och filsystemet. På Windows-system med filsystemet FAT32 har t.ex. :attr:`st_mtime` upplösning på 2 sekunder och :attr:`st_atime` har endast upplösning på 1 dag. Se dokumentationen för ditt operativsystem för mer information.

source: Similarly, although :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` and :attr:`st_birthtime_ns` are always expressed in nanoseconds, many systems do not provide nanosecond precision. On systems that do provide nanosecond precision, the floating-point object used to store :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` and :attr:`st_birthtime` cannot preserve all of it, and as such will be slightly inexact. If you need the exact timestamps you should always use :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` and :attr:`st_birthtime_ns`.
sv: Även om :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` och :attr:`st_birthtime_ns` alltid uttrycks i nanosekunder är det många system som inte har nanosekundsprecision. På system som har nanosekundsprecision kan det flyttalsobjekt som används för att lagra :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` och :attr:`st_birthtime` inte bevara allt, och därför kommer det att vara något inexakt. Om du behöver de exakta tidsstämplarna bör du alltid använda :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` och :attr:`st_birthtime_ns`.

source: On some Unix systems (such as Linux), the following attributes may also be available:
sv: På vissa Unix-system (t.ex. Linux) kan följande attribut också vara tillgängliga:

source: Number of 512-byte blocks allocated for file. This may be smaller than :attr:`st_size`/512 when the file has holes.
sv: Antal 512-byte-block som allokerats för filen. Detta kan vara mindre än :attr:`st_size`/512 om filen har hål.

source: "Preferred" blocksize for efficient file system I/O. Writing to a file in smaller chunks may cause an inefficient read-modify-rewrite.
sv: "Rekommenderad" blockstorlek för effektiv I/O i filsystemet. Om du skriver till en fil i mindre bitar kan det leda till en ineffektiv read-modify-rewrite.

source: Type of device if an inode device.
sv: Typ av enhet om det är en inode-enhet.

source: User defined flags for file.
sv: Användardefinierade flaggor för filen.

source: On other Unix systems (such as FreeBSD), the following attributes may be available (but may be only filled out if root tries to use them):
sv: På andra Unix-system (t.ex. FreeBSD) kan följande attribut vara tillgängliga (men kanske bara fylls i om root försöker använda dem):

source: File generation number.
sv: Filens generationsnummer.

source: On Solaris and derivatives, the following attributes may also be available:
sv: På Solaris och derivat kan följande attribut också vara tillgängliga:

source: String that uniquely identifies the type of the filesystem that contains the file.
sv: Sträng som unikt identifierar typen av det filsystem som innehåller filen.

source: On macOS systems, the following attributes may also be available:
sv: På macOS-system kan följande attribut också vara tillgängliga:

source: Real size of the file.
sv: Filens verkliga storlek.

source: Creator of the file.
sv: Skapare av filen.

source: File type.
sv: Filtyp.

source: On Windows systems, the following attributes are also available:
sv: På Windows-system är följande attribut också tillgängliga:

source: Windows file attributes: ``dwFileAttributes`` member of the ``BY_HANDLE_FILE_INFORMATION`` structure returned by :c:func:`!GetFileInformationByHandle`. See the :const:`!FILE_ATTRIBUTE_* <stat.FILE_ATTRIBUTE_ARCHIVE>` constants in the :mod:`stat` module.
sv: Windows filattribut: ``dwFileAttributes``-medlem i ``BY_HANDLE_FILE_INFORMATION``-strukturen som returneras av :c:func:`!GetFileInformationByHandle``. Se konstanterna :const:`!FILE_ATTRIBUTE_* <stat.FILE_ATTRIBUTE_ARCHIVE>` i modulen :mod:`stat`.

source: When :attr:`st_file_attributes` has the :const:`~stat.FILE_ATTRIBUTE_REPARSE_POINT` set, this field contains the tag identifying the type of reparse point. See the :const:`IO_REPARSE_TAG_* <stat.IO_REPARSE_TAG_SYMLINK>` constants in the :mod:`stat` module.
sv: När :attr:`st_file_attributes` har inställningen :const:`~stat.FILE_ATTRIBUTE_REPARSE_POINT`, innehåller detta fält taggen som identifierar typen av reparse-punkt. Se konstanterna :const:`IO_REPARSE_TAG_* <stat.IO_REPARSE_TAG_SYMLINK>` i modulen :mod:`stat`.

source: The standard module :mod:`stat` defines functions and constants that are useful for extracting information from a :c:struct:`stat` structure. (On Windows, some items are filled with dummy values.)
sv: Standardmodulen :mod:`stat` definierar funktioner och konstanter som är användbara för att extrahera information från en :c:struct:`stat`-struktur. (I Windows är vissa objekt fyllda med dummyvärden)

source: For backward compatibility, a :class:`stat_result` instance is also accessible as a tuple of at least 10 integers giving the most important (and portable) members of the :c:struct:`stat` structure, in the order :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. More items may be added at the end by some implementations. For compatibility with older Python versions, accessing :class:`stat_result` as a tuple always returns integers.
sv: För bakåtkompatibilitet är en :class:`stat_result`-instans också tillgänglig som en tupel av minst 10 heltal som ger de viktigaste (och portabla) medlemmarna i :c:struct:`stat`-strukturen, i ordningen :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. Fler objekt kan läggas till i slutet av vissa implementationer. För kompatibilitet med äldre Python-versioner returnerar åtkomst till :class:`stat_result` som en tupel alltid heltal.

source: Windows now returns the file index as :attr:`st_ino` when available.
sv: Windows returnerar nu filindexet som :attr:`st_ino` när det är tillgängligt.

source: Added the :attr:`st_fstype` member to Solaris/derivatives.
sv: Lagt till medlemmen :attr:`st_fstype` i Solaris/derivatives.

source: Added the :attr:`st_reparse_tag` member on Windows.
sv: Lagt till :attr:`st_reparse_tag`-medlemmen på Windows.

source: On Windows, the :attr:`st_mode` member now identifies special files as :const:`S_IFCHR`, :const:`S_IFIFO` or :const:`S_IFBLK` as appropriate.
sv: I Windows identifierar nu medlemmen :attr:`st_mode` specialfiler som :const:`S_IFCHR`, :const:`S_IFIFIFO` eller :const:`S_IFBLK` beroende på vad som är lämpligt.

source: On Windows, :attr:`st_ctime` is deprecated. Eventually, it will contain the last metadata change time, for consistency with other platforms, but for now still contains creation time. Use :attr:`st_birthtime` for the creation time.
sv: På Windows är :attr:`st_ctime` föråldrad. Så småningom kommer den att innehålla den senaste metadataändringstiden för att vara konsekvent med andra plattformar, men för närvarande innehåller den fortfarande skapelsetiden. Använd :attr:`st_birthtime` för skapelsetiden.

source: On Windows, :attr:`st_ino` may now be up to 128 bits, depending on the file system. Previously it would not be above 64 bits, and larger file identifiers would be arbitrarily packed.
sv: I Windows kan :attr:`st_ino` nu vara upp till 128 bitar, beroende på filsystem. Tidigare kunde den inte vara mer än 64 bitar, och större filidentifierare kunde packas godtyckligt.

source: On Windows, :attr:`st_rdev` no longer returns a value. Previously it would contain the same as :attr:`st_dev`, which was incorrect.
sv: I Windows returnerar :attr:`st_rdev` inte längre något värde. Tidigare innehöll den samma värde som :attr:`st_dev`, vilket var felaktigt.

source: Added the :attr:`st_birthtime` member on Windows.
sv: Lagt till medlemmen :attr:`st_birthtime` på Windows.

source: Perform a :c:func:`!statvfs` system call on the given path. The return value is an object whose attributes describe the filesystem on the given path, and correspond to the members of the :c:struct:`statvfs` structure, namely: :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.
sv: Utför ett :c:func:`!statvfs` systemanrop på den angivna sökvägen. Returvärdet är ett objekt vars attribut beskriver filsystemet på den givna sökvägen och motsvarar medlemmarna i :c:struct:`statvfs`-strukturen, nämligen: :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.

source: Two module-level constants are defined for the :attr:`f_flag` attribute's bit-flags: if :const:`ST_RDONLY` is set, the filesystem is mounted read-only, and if :const:`ST_NOSUID` is set, the semantics of setuid/setgid bits are disabled or not supported.
sv: Två konstanter på modulnivå definieras för attributet :attr:`f_flag` bit-flags: om :const:`ST_RDONLY` anges monteras filsystemet skrivskyddat, och om :const:`ST_NOSUID` anges inaktiveras eller stöds inte semantiken för setuid/setgid-bitar.

source: Additional module-level constants are defined for GNU/glibc based systems. These are :const:`ST_NODEV` (disallow access to device special files), :const:`ST_NOEXEC` (disallow program execution), :const:`ST_SYNCHRONOUS` (writes are synced at once), :const:`ST_MANDLOCK` (allow mandatory locks on an FS), :const:`ST_WRITE` (write on file/directory/symlink), :const:`ST_APPEND` (append-only file), :const:`ST_IMMUTABLE` (immutable file), :const:`ST_NOATIME` (do not update access times), :const:`ST_NODIRATIME` (do not update directory access times), :const:`ST_RELATIME` (update atime relative to mtime/ctime).
sv: Ytterligare konstanter på modulnivå har definierats för GNU/glibc-baserade system. Dessa är :const:`ST_NODEV` (förbjuder åtkomst till enhetsspecifika filer), :const:`ST_NOEXEC` (förbjuder programkörning), :const:`ST_SYNCHRONOUS` (skrivningar synkroniseras på en gång), :const:`ST_MANDLOCK` (tillåter obligatoriska lås på en FS), :const:`ST_WRITE` (skriv på fil/katalog/symlänk), :const:`ST_APPEND` (endast append-fil), :const:`ST_IMMUTABLE` (oföränderlig fil), :const:`ST_NOATIME` (uppdatera inte åtkomsttider), :const:`ST_NODIRATIME` (uppdatera inte åtkomsttider för kataloger), :const:`ST_RELATIME` (uppdatera atime i förhållande till mtime/ctime).

source: The :const:`ST_RDONLY` and :const:`ST_NOSUID` constants were added.
sv: Konstanterna :const:`ST_RDONLY` och :const:`ST_NOSUID` har lagts till.

source: The :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, and :const:`ST_RELATIME` constants were added.
sv: Parametrarna :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, och :const:`ST_RELATIME` lades till.

source: Added the :attr:`f_fsid` attribute.
sv: Lagt till attributet :attr:`f_fsid`.

source: A :class:`set` object indicating which functions in the :mod:`os` module accept an open file descriptor for their *dir_fd* parameter. Different platforms provide different features, and the underlying functionality Python uses to implement the *dir_fd* parameter is not available on all platforms Python supports. For consistency's sake, functions that may support *dir_fd* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``None`` for *dir_fd* is always supported on all platforms.)
sv: Ett :class:`set`-objekt som anger vilka funktioner i :mod:`os`-modulen som accepterar en öppen filbeskrivare för sin *dir_fd*-parameter. Olika plattformar har olika funktioner och den underliggande funktionaliteten som Python använder för att implementera parametern *dir_fd* är inte tillgänglig på alla plattformar som Python stöder. För konsekvensens skull tillåter funktioner som kan stödja *dir_fd* alltid att parametern anges, men kommer att kasta ett undantag om funktionaliteten används när den inte är lokalt tillgänglig. (Att ange ``None`` för *dir_fd* stöds alltid på alla plattformar)

source: To check whether a particular function accepts an open file descriptor for its *dir_fd* parameter, use the ``in`` operator on ``supports_dir_fd``. As an example, this expression evaluates to ``True`` if :func:`os.stat` accepts open file descriptors for *dir_fd* on the local platform::
sv: För att kontrollera om en viss funktion accepterar en öppen filbeskrivare för sin parameter *dir_fd*, använd operatorn ``in`` på ``upports_dir_fd``. Som ett exempel utvärderas detta uttryck till ``True`` om :func:`os.stat` accepterar öppna filbeskrivare för *dir_fd* på den lokala plattformen::

source: os.stat in os.supports_dir_fd
sv: os.stat i os.supports_dir_fd

source: Currently *dir_fd* parameters only work on Unix platforms; none of them work on Windows.
sv: För närvarande fungerar *dir_fd*-parametrarna bara på Unix-plattformar; ingen av dem fungerar på Windows.

source: A :class:`set` object indicating whether :func:`os.access` permits specifying ``True`` for its *effective_ids* parameter on the local platform. (Specifying ``False`` for *effective_ids* is always supported on all platforms.) If the local platform supports it, the collection will contain :func:`os.access`; otherwise it will be empty.
sv: Ett :class:`set`-objekt som anger om :func:`os.access` tillåter att man anger ``True`` för parametern *effective_ids* på den lokala plattformen. (Att ange ``False`` för *effective_ids* stöds alltid på alla plattformar) Om den lokala plattformen stöder det, kommer samlingen att innehålla :func:`os.access`; annars kommer den att vara tom.

source: This expression evaluates to ``True`` if :func:`os.access` supports ``effective_ids=True`` on the local platform::
sv: Detta uttryck utvärderas till ``True`` om :func:`os.access` stöder ``effective_ids=True`` på den lokala plattformen::

source: os.access in os.supports_effective_ids
sv: os.access i os.supports_effective_ids

source: Currently *effective_ids* is only supported on Unix platforms; it does not work on Windows.
sv: För närvarande stöds *effective_ids* endast på Unix-plattformar; det fungerar inte på Windows.

source: A :class:`set` object indicating which functions in the :mod:`os` module permit specifying their *path* parameter as an open file descriptor on the local platform. Different platforms provide different features, and the underlying functionality Python uses to accept open file descriptors as *path* arguments is not available on all platforms Python supports.
sv: Ett :class:`set`-objekt som anger vilka funktioner i :mod:`os`-modulen som tillåter att deras *path*-parameter anges som en öppen filbeskrivare på den lokala plattformen. Olika plattformar har olika funktioner och den underliggande funktionalitet som Python använder för att acceptera öppna filbeskrivare som *path*-argument är inte tillgänglig på alla plattformar som Python stöder.

source: To determine whether a particular function permits specifying an open file descriptor for its *path* parameter, use the ``in`` operator on ``supports_fd``. As an example, this expression evaluates to ``True`` if :func:`os.chdir` accepts open file descriptors for *path* on your local platform::
sv: Om du vill avgöra om en viss funktion tillåter att en öppen filbeskrivare anges för parametern *path*, använder du operatorn ``in`` på ``supports_fd``. Som ett exempel utvärderas detta uttryck till ``True`` om :func:`os.chdir` accepterar öppna filbeskrivare för *path* på din lokala plattform::

source: os.chdir in os.supports_fd
sv: os.chdir i os.supports_fd

source: A :class:`set` object indicating which functions in the :mod:`os` module accept ``False`` for their *follow_symlinks* parameter on the local platform. Different platforms provide different features, and the underlying functionality Python uses to implement *follow_symlinks* is not available on all platforms Python supports. For consistency's sake, functions that may support *follow_symlinks* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``True`` for *follow_symlinks* is always supported on all platforms.)
sv: Ett :class:`set`-objekt som anger vilka funktioner i :mod:`os`-modulen som accepterar ``False`` för sin *follow_symlinks*-parameter på den lokala plattformen. Olika plattformar har olika funktioner, och den underliggande funktionaliteten som Python använder för att implementera *follow_symlinks* är inte tillgänglig på alla plattformar som Python stöder. För konsekvensens skull tillåter funktioner som kan stödja *follow_symlinks* alltid att parametern anges, men kommer att göra ett undantag om funktionaliteten används när den inte är lokalt tillgänglig. (Att ange ``True`` för *follow_symlinks* stöds alltid på alla plattformar)

source: To check whether a particular function accepts ``False`` for its *follow_symlinks* parameter, use the ``in`` operator on ``supports_follow_symlinks``. As an example, this expression evaluates to ``True`` if you may specify ``follow_symlinks=False`` when calling :func:`os.stat` on the local platform::
sv: För att kontrollera om en viss funktion accepterar ``False`` för sin parameter *follow_symlinks*, använd operatorn ``in`` på ``supports_follow_symlinks``. Som ett exempel utvärderas detta uttryck till ``True`` om du kan ange ``follow_symlinks=False`` när du anropar :func:`os.stat` på den lokala plattformen::

source: os.stat in os.supports_follow_symlinks
sv: os.stat i os.supports_follow_symlinks

source: Create a symbolic link pointing to *src* named *dst*.
sv: Skapa en symbolisk länk som pekar på *src* och heter *dst*.

source: On Windows, a symlink represents either a file or a directory, and does not morph to the target dynamically. If the target is present, the type of the symlink will be created to match. Otherwise, the symlink will be created as a directory if *target_is_directory* is ``True`` or a file symlink (the default) otherwise. On non-Windows platforms, *target_is_directory* is ignored.
sv: I Windows representerar en symlänk antingen en fil eller en katalog, och den flyttas inte dynamiskt till målet. Om målet finns kommer typen av symlänk att skapas så att den matchar. I annat fall skapas symbollänken som en katalog om *target_is_directory* är ``True`` eller som en filsymlänk (standard) i annat fall. På icke-Windows-plattformar ignoreras *target_is_directory*.

source: On newer versions of Windows 10, unprivileged accounts can create symlinks if Developer Mode is enabled. When Developer Mode is not available/enabled, the *SeCreateSymbolicLinkPrivilege* privilege is required, or the process must be run as an administrator.
sv: I nyare versioner av Windows 10 kan icke-privilegierade konton skapa symboliska länkar om utvecklarläget är aktiverat. När Developer Mode inte är tillgängligt/aktiverat krävs behörigheten *SeCreateSymbolicLinkPrivilege*, eller så måste processen köras som administratör.

source: :exc:`OSError` is raised when the function is called by an unprivileged user.
sv: :exc:`OSError` uppstår när funktionen anropas av en användare utan behörighet.

source: Raises an :ref:`auditing event <auditing>` ``os.symlink`` with arguments ``src``, ``dst``, ``dir_fd``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.symlink`` med argumenten ``src``, ``dst``, ``dir_fd``.

source: Added the *dir_fd* parameter, and now allow *target_is_directory* on non-Windows platforms.
sv: Lagt till parametern *dir_fd* och tillåter nu *target_is_directory* på icke-Windows-plattformar.

source: Added support for unelevated symlinks on Windows with Developer Mode.
sv: Lagt till stöd för symlänkar som inte är upphöjda i Windows med Developer Mode.

source: Force write of everything to disk.
sv: Tvinga fram skrivning av allt till disk.

source: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
sv: Trunkera filen som motsvarar *sökväg*, så att den är högst *längd* byte stor.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``path``, ``length``.
sv: Utlöser en :ref:`auditing event <auditing>` ``os.truncate`` med argumenten ``path``, ``length``.

source: Remove (delete) the file *path*. This function is semantically identical to :func:`remove`; the ``unlink`` name is its traditional Unix name. Please see the documentation for :func:`remove` for further information.
sv: Ta bort (delete) filen *path*. Denna funktion är semantiskt identisk med :func:`remove`; namnet ``unlink`` är dess traditionella Unix-namn. Se dokumentationen för :func:`remove` för ytterligare information.

source: Set the access and modified times of the file specified by *path*.
sv: Ställ in åtkomst- och ändringstider för den fil som anges av *path*.
