Repository: yeager/python-docs-sv
Catalog: library/pickle.po
Languages: sv

source: For a class that has :attr:`~object.__slots__` and no instance :attr:`~object.__dict__`, the default state is a tuple whose first item is ``None`` and whose second item is a dictionary mapping slot names to slot values described in the previous bullet.
sv: För en klass som har :attr:`~object.__slots__` och ingen instans :attr:`~object.__dict__`, är standardtillståndet en tupel vars första post är ``None`` och vars andra post är en ordbok som mappar slotnamn till slotvärden som beskrivs i föregående punkt.

source: Added the default implementation of the ``__getstate__()`` method in the :class:`object` class.
sv: Lade till standardimplementeringen av metoden ``__getstate__()`` i klassen :class:`object`.

source: Upon unpickling, if the class defines :meth:`__setstate__`, it is called with the unpickled state. In that case, there is no requirement for the state object to be a dictionary. Otherwise, the pickled state must be a dictionary and its items are assigned to the new instance's dictionary.
sv: Vid unpickling, om klassen definierar :meth:`__setstate__`, anropas den med det unpicklade tillståndet. I det fallet finns det inget krav på att state-objektet ska vara en dictionary. Annars måste det inlagda tillståndet vara en ordbok och dess objekt tilldelas den nya instansens ordbok.

source: If :meth:`__reduce__` returns a state with value ``None`` at pickling, the :meth:`__setstate__` method will not be called upon unpickling.
sv: Om :meth:`__reduce__` returnerar ett tillstånd med värdet ``None`` vid pickling, kommer metoden :meth:`__setstate__` inte att anropas vid unpickling.

source: Refer to the section :ref:`pickle-state` for more information about how to use the methods :meth:`~object.__getstate__` and :meth:`~object.__setstate__`.
sv: Se avsnittet :ref:`pickle-state` för mer information om hur du använder metoderna :meth:`~object.__getstate__` och :meth:`~object.__setstate__`.

source: At unpickling time, some methods like :meth:`~object.__getattr__`, :meth:`~object.__getattribute__`, or :meth:`~object.__setattr__` may be called upon the instance. In case those methods rely on some internal invariant being true, the type should implement :meth:`~object.__new__` to establish such an invariant, as :meth:`~object.__init__` is not called when unpickling an instance.
sv: Vid unpickling-tiden kan vissa metoder som :meth:`~object.__getattr__`, :meth:`~object.__getattribute__` eller :meth:`~object.__setattr__` anropas på instansen. Om dessa metoder är beroende av att någon intern invariant är sann, bör typen implementera :meth:`~object.__new__` för att etablera en sådan invariant, eftersom :meth:`~object.__init__` inte anropas när en instans plockas upp.

source: As we shall see, pickle does not use directly the methods described above. In fact, these methods are part of the copy protocol which implements the :meth:`~object.__reduce__` special method. The copy protocol provides a unified interface for retrieving the data necessary for pickling and copying objects. [#]_
sv: Som vi kommer att se använder pickle inte direkt de metoder som beskrivs ovan. I själva verket är dessa metoder en del av kopieringsprotokollet som implementerar specialmetoden :meth:`~object.__reduce__`. Kopieringsprotokollet ger ett enhetligt gränssnitt för att hämta de data som behövs för att plocka och kopiera objekt. [#]_

source: Although powerful, implementing :meth:`~object.__reduce__` directly in your classes is error prone. For this reason, class designers should use the high-level interface (i.e., :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` and :meth:`~object.__setstate__`) whenever possible. We will show, however, cases where using :meth:`!__reduce__` is the only option or leads to more efficient pickling or both.
sv: Även om :meth:`~object.__reduce__` är kraftfull är det felbenäget att implementera den direkt i dina klasser. Av denna anledning bör klassutvecklare använda högnivågränssnittet (dvs. :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` och :meth:`~object.__setstate__`) när det är möjligt. Vi kommer dock att visa fall där användning av :meth:`!__reduce__` är det enda alternativet eller leder till effektivare betning eller bådadera.

source: The interface is currently defined as follows. The :meth:`__reduce__` method takes no argument and shall return either a string or preferably a tuple (the returned object is often referred to as the "reduce value").
sv: Gränssnittet är för närvarande definierat enligt följande. Metoden :meth:`__reduce__` tar inget argument och skall returnera antingen en sträng eller helst en tupel (det returnerade objektet kallas ofta för "reduktionsvärdet").

source: If a string is returned, the string should be interpreted as the name of a global variable. It should be the object's local name relative to its module; the pickle module searches the module namespace to determine the object's module. This behaviour is typically useful for singletons.
sv: Om en sträng returneras ska strängen tolkas som namnet på en global variabel. Det bör vara objektets lokala namn i förhållande till dess modul; pickle-modulen söker i modulnamnrymden för att fastställa objektets modul. Detta beteende är typiskt användbart för singletons.

source: When a tuple is returned, it must be between two and six items long. Optional items can either be omitted, or ``None`` can be provided as their value. The semantics of each item are in order:
sv: När en tupel returneras måste den vara mellan två och sex poster lång. Valfria objekt kan antingen utelämnas, eller så kan ``None`` anges som värde. Semantiken för varje objekt är i ordning:

source: A callable object that will be called to create the initial version of the object.
sv: Ett anropsbart objekt som kommer att anropas för att skapa den första versionen av objektet.

source: A tuple of arguments for the callable object. An empty tuple must be given if the callable does not accept any argument.
sv: En tupel av argument för det anropbara objektet. En tom tupel måste anges om det anropbara objektet inte accepterar något argument.

source: Optionally, the object's state, which will be passed to the object's :meth:`__setstate__` method as previously described. If the object has no such method then, the value must be a dictionary and it will be added to the object's :attr:`~object.__dict__` attribute.
sv: Eventuellt objektets tillstånd, som kommer att skickas till objektets :meth:`__setstate__`-metod enligt tidigare beskrivning. Om objektet inte har någon sådan metod måste värdet vara en dictionary och det kommer att läggas till i objektets attribut :attr:`~object.__dict__`.

source: Optionally, an iterator (and not a sequence) yielding successive items. These items will be appended to the object either using ``obj.append(item)`` or, in batch, using ``obj.extend(list_of_items)``. This is primarily used for list subclasses, but may be used by other classes as long as they have :ref:`append and extend methods <typesseq-common>` with the appropriate signature. (Whether :meth:`!append` or :meth:`!extend` is used depends on which pickle protocol version is used as well as the number of items to append, so both must be supported.)
sv: Eventuellt en iterator (och inte en sekvens) som ger successiva objekt. Dessa objekt kommer att läggas till objektet antingen med hjälp av ``obj.append(item)`` eller, i batch, med hjälp av ``obj.extend(list_of_items)``. Detta används främst för list-subklasser, men kan användas av andra klasser så länge de har :ref:`append och extend metoder <typesseq-common>` med lämplig signatur. (Om :meth:`!append` eller :meth:`!extend` används beror på vilken version av pickle-protokollet som används samt antalet objekt som ska läggas till, så båda måste stödjas)

source: Optionally, an iterator (not a sequence) yielding successive key-value pairs. These items will be stored to the object using ``obj[key] = value``. This is primarily used for dictionary subclasses, but may be used by other classes as long as they implement :meth:`__setitem__`.
sv: Eventuellt en iterator (inte en sekvens) som ger successiva nyckel-värde-par. Dessa objekt kommer att lagras i objektet med ``obj[key] = value``. Detta används främst för dictionary-subklasser, men kan användas av andra klasser så länge de implementerar :meth:`__setitem__`.

source: Optionally, a callable with a ``(obj, state)`` signature. This callable allows the user to programmatically control the state-updating behavior of a specific object, instead of using ``obj``'s static :meth:`__setstate__` method. If not ``None``, this callable will have priority over ``obj``'s :meth:`__setstate__`.
sv: Eventuellt en anropbar funktion med signaturen ``(obj, state)``. Denna anropsbarhet tillåter användaren att programmatiskt kontrollera tillståndsuppdateringsbeteendet för ett specifikt objekt, istället för att använda ``obj`` statiska :meth:`__setstate__` metod. Om inte ``None``, kommer denna anropsbarhet att ha prioritet över ``obj`` :meth:`__setstate__`.

source: The optional sixth tuple item, ``(obj, state)``, was added.
sv: Det valfria sjätte tuple-objektet, ``(obj, state)``, lades till.

source: Alternatively, a :meth:`__reduce_ex__` method may be defined. The only difference is this method should take a single integer argument, the protocol version. When defined, pickle will prefer it over the :meth:`__reduce__` method. In addition, :meth:`__reduce__` automatically becomes a synonym for the extended version. The main use for this method is to provide backwards-compatible reduce values for older Python releases.
sv: Alternativt kan en :meth:`__reduce_ex__`-metod definieras. Den enda skillnaden är att denna metod ska ta ett enda heltalsargument, protokollversionen. När den definieras kommer pickle att föredra den framför :meth:`__reduce__`-metoden. Dessutom blir :meth:`__reduce__` automatiskt en synonym för den utökade versionen. Huvudanvändningen för denna metod är att tillhandahålla bakåtkompatibla reduce-värden för äldre Python-versioner.

source: Persistence of External Objects
sv: Persistens för externa objekt

source: For the benefit of object persistence, the :mod:`pickle` module supports the notion of a reference to an object outside the pickled data stream. Such objects are referenced by a persistent ID, which should be either a string of alphanumeric characters (for protocol 0) [#]_ or just an arbitrary object (for any newer protocol).
sv: För att underlätta objektets beständighet stöder modulen :mod:`pickle` begreppet referens till ett objekt utanför den betade dataströmmen. Sådana objekt refereras till med ett beständigt ID, som antingen bör vara en sträng med alfanumeriska tecken (för protokoll 0) [#]_ eller bara ett godtyckligt objekt (för alla nyare protokoll).

source: The resolution of such persistent IDs is not defined by the :mod:`pickle` module; it will delegate this resolution to the user-defined methods on the pickler and unpickler, :meth:`~Pickler.persistent_id` and :meth:`~Unpickler.persistent_load` respectively.
sv: Upplösningen av sådana persistenta ID:n definieras inte av modulen :mod:`pickle`; den delegerar denna upplösning till de användardefinierade metoderna på picklern och unpickllern, :meth:`~Pickler.persistent_id` respektive :meth:`~Unpickler.persistent_load`.

source: To pickle objects that have an external persistent ID, the pickler must have a custom :meth:`~Pickler.persistent_id` method that takes an object as an argument and returns either ``None`` or the persistent ID for that object. When ``None`` is returned, the pickler simply pickles the object as normal. When a persistent ID string is returned, the pickler will pickle that object, along with a marker so that the unpickler will recognize it as a persistent ID.
sv: För att plocka objekt som har ett externt beständigt ID måste plockaren ha en egen :meth:`~Pickler.persistent_id`-metod som tar ett objekt som argument och returnerar antingen ``None`` eller det beständiga ID:t för objektet. När ``None`` returneras betar betaren helt enkelt objektet som normalt. När en persistent ID-sträng returneras kommer picklern att pickla det objektet, tillsammans med en markör så att unpickllern känner igen det som ett persistent ID.

source: To unpickle external objects, the unpickler must have a custom :meth:`~Unpickler.persistent_load` method that takes a persistent ID object and returns the referenced object.
sv: För att unpickla externa objekt måste unpicklern ha en anpassad :meth:`~Unpickler.persistent_load`-metod som tar ett persistent ID-objekt och returnerar det refererade objektet.

source: Here is a comprehensive example presenting how persistent ID can be used to pickle external objects by reference.
sv: Här följer ett omfattande exempel som visar hur persistent ID kan användas för att plocka externa objekt genom referens.

source: # Simple example presenting how persistent ID can be used to pickle # external objects by reference. import pickle import sqlite3 from collections import namedtuple # Simple class representing a record in our database. MemoRecord = namedtuple("MemoRecord", "key, task") class DBPickler(pickle.Pickler): def persistent_id(self, obj): # Instead of pickling MemoRecord as a regular class instance, we emit a # persistent ID. if isinstance(obj, MemoRecord): # Here, our persistent ID is simply a tuple, containing a tag and a # key, which refers to a specific record in the database. return ("MemoRecord", obj.key) else: # If obj does not have a persistent ID, return None. This means obj # needs to be pickled as usual. return None class DBUnpickler(pickle.Unpickler): def __init__(self, file, connection): super().__init__(file) self.connection = connection def persistent_load(self, pid): # This method is invoked whenever a persistent ID is encountered. # Here, pid is the tuple returned by DBPickler. cursor = self.connection.cursor() type_tag, key_id = pid if type_tag == "MemoRecord": # Fetch the referenced record from the database and return it. cursor.execute("SELECT * FROM memos WHERE key=?", (str(key_id),)) key, task = cursor.fetchone() return MemoRecord(key, task) else: # Always raises an error if you cannot return the correct object. # Otherwise, the unpickler will think None is the object referenced # by the persistent ID. raise pickle.UnpicklingError("unsupported persistent object") def main(): import io import pprint # Initialize and populate our database. conn = sqlite3.connect(":memory:") cursor = conn.cursor() cursor.execute("CREATE TABLE memos(key INTEGER PRIMARY KEY, task TEXT)") tasks = ( 'give food to fish', 'prepare group meeting', 'fight with a zebra', ) for task in tasks: cursor.execute("INSERT INTO memos VALUES(NULL, ?)", (task,)) # Fetch the records to be pickled. cursor.execute("SELECT * FROM memos") memos = [MemoRecord(key, task) for key, task in cursor] # Save the records using our custom DBPickler. file = io.BytesIO() DBPickler(file).dump(memos) print("Pickled records:") pprint.pprint(memos) # Update a record, just for good measure. cursor.execute("UPDATE memos SET task='learn italian' WHERE key=1") # Load the records from the pickle data stream. file.seek(0) memos = DBUnpickler(file, conn).load() print("Unpickled records:") pprint.pprint(memos) if __name__ == '__main__': main()
sv: # Enkelt exempel som visar hur persistent ID kan användas för att plocka # externa objekt genom referens. import pickle import sqlite3 from collections import namedtuple # Simple class representing a record in our database. MemoRecord = namedtuple("MemoRecord", "key, task") class DBPickler(pickle.Pickler): def persistent_id(self, obj): # Instead of pickling MemoRecord as a regular class instance, we emit a # persistent ID. if isinstance(obj, MemoRecord): # Here, our persistent ID is simply a tuple, containing a tag and a # key, which refers to a specific record in the database. return ("MemoRecord", obj.key) else: # If obj does not have a persistent ID, return None. This means obj # needs to be pickled as usual. return None class DBUnpickler(pickle.Unpickler): def __init__(self, file, connection): super().__init__(file) self.connection = connection def persistent_load(self, pid): # This method is invoked whenever a persistent ID is encountered. # Here, pid is the tuple returned by DBPickler. cursor = self.connection.cursor() type_tag, key_id = pid if type_tag == "MemoRecord": # Fetch the referenced record from the database and return it. cursor.execute("SELECT * FROM memos WHERE key=?", (str(key_id),)) key, task = cursor.fetchone() return MemoRecord(key, task) else: # Always raises an error if you cannot return the correct object. # Otherwise, the unpickler will think None is the object referenced # by the persistent ID. raise pickle.UnpicklingError("unsupported persistent object") def main(): import io import pprint # Initialize and populate our database. conn = sqlite3.connect(":memory:") cursor = conn.cursor() cursor.execute("CREATE TABLE memos(key INTEGER PRIMARY KEY, task TEXT)") tasks = ( 'give food to fish', 'prepare group meeting', 'fight with a zebra', ) for task in tasks: cursor.execute("INSERT INTO memos VALUES(NULL, ?)", (task,)) # Fetch the records to be pickled. cursor.execute("SELECT * FROM memos") memos = [MemoRecord(key, task) for key, task in cursor] # Save the records using our custom DBPickler. file = io.BytesIO() DBPickler(file).dump(memos) print("Pickled records:") pprint.pprint(memos) # Update a record, just for good measure. cursor.execute("UPDATE memos SET task='learn italian' WHERE key=1") # Load the records from the pickle data stream. file.seek(0) memos = DBUnpickler(file, conn).load() print("Unpickled records:") pprint.pprint(memos) if __name__ == '__main__': main()

source: Dispatch Tables
sv: Expeditionsbord

source: If one wants to customize pickling of some classes without disturbing any other code which depends on pickling, then one can create a pickler with a private dispatch table.
sv: Om man vill anpassa betningen av vissa klasser utan att störa någon annan kod som är beroende av betningen, kan man skapa en betare med en privat dispatch-tabell.

source: The global dispatch table managed by the :mod:`copyreg` module is available as :data:`!copyreg.dispatch_table`. Therefore, one may choose to use a modified copy of :data:`!copyreg.dispatch_table` as a private dispatch table.
sv: Den globala dispatch-tabellen som hanteras av modulen :mod:`copyreg` är tillgänglig som :data:`!copyreg.dispatch_table`. Därför kan man välja att använda en modifierad kopia av :data:`!copyreg.dispatch_table` som en privat dispatch-tabell.

source: For example ::
sv: Till exempel ::

source: creates an instance of :class:`pickle.Pickler` with a private dispatch table which handles the ``SomeClass`` class specially. Alternatively, the code ::
sv: skapar en instans av :class:`pickle.Pickler` med en privat dispatch-tabell som hanterar klassen ``SomeClass`` speciellt. Alternativt kan koden ::

source: does the same but all instances of ``MyPickler`` will by default share the private dispatch table. On the other hand, the code ::
sv: gör samma sak men alla instanser av ``MyPickler`` kommer som standard att dela den privata dispatch-tabellen. Å andra sidan, koden ::

source: modifies the global dispatch table shared by all users of the :mod:`copyreg` module.
sv: ändrar den globala fördelningstabellen som delas av alla användare av modulen :mod:`copyreg`.

source: Handling Stateful Objects
sv: Hantering av Stateful-objekt

source: Here's an example that shows how to modify pickling behavior for a class. The :class:`!TextReader` class below opens a text file, and returns the line number and line contents each time its :meth:`!readline` method is called. If a :class:`!TextReader` instance is pickled, all attributes *except* the file object member are saved. When the instance is unpickled, the file is reopened, and reading resumes from the last location. The :meth:`!__setstate__` and :meth:`!__getstate__` methods are used to implement this behavior. ::
sv: Här är ett exempel som visar hur man ändrar pickling-beteendet för en klass. Klassen :class:`!TextReader` nedan öppnar en textfil och returnerar radnummer och radinnehåll varje gång dess metod :meth:`!readline` anropas. Om en :class:`!TextReader`-instans är picklad sparas alla attribut *utom* objektmedlemmen file. När instansen avpicklas öppnas filen igen och läsningen återupptas från den senaste platsen. Metoderna :meth:`!__setstate__` och :meth:`!__getstate__` används för att implementera detta beteende. ::

source: A sample usage might be something like this::
sv: Ett exempel på användning kan vara ungefär så här::

source: Custom Reduction for Types, Functions, and Other Objects
sv: Anpassad reduktion för typer, funktioner och andra objekt

source: Sometimes, :attr:`~Pickler.dispatch_table` may not be flexible enough. In particular we may want to customize pickling based on another criterion than the object's type, or we may want to customize the pickling of functions and classes.
sv: Ibland kanske :attr:`~Pickler.dispatch_table` inte är tillräckligt flexibel. I synnerhet kanske vi vill anpassa betningen baserat på ett annat kriterium än objektets typ, eller så kanske vi vill anpassa betningen av funktioner och klasser.

source: For those cases, it is possible to subclass from the :class:`Pickler` class and implement a :meth:`~Pickler.reducer_override` method. This method can return an arbitrary reduction tuple (see :meth:`~object.__reduce__`). It can alternatively return :data:`NotImplemented` to fallback to the traditional behavior.
sv: För dessa fall är det möjligt att subklassa från :class:`Pickler`-klassen och implementera en :meth:`~Pickler.reducer_override`-metod. Denna metod kan returnera en godtycklig reduktionstupel (se :meth:`~object.__reduce__`). Den kan alternativt returnera :data:`NotImplemented` för att återgå till det traditionella beteendet.

source: If both the :attr:`~Pickler.dispatch_table` and :meth:`~Pickler.reducer_override` are defined, then :meth:`~Pickler.reducer_override` method takes priority.
sv: Om både :attr:`~Pickler.dispatch_table` och :meth:`~Pickler.reducer_override` är definierade, så har metoden :meth:`~Pickler.reducer_override` prioritet.

source: For performance reasons, :meth:`~Pickler.reducer_override` may not be called for the following objects: ``None``, ``True``, ``False``, and exact instances of :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` and :class:`tuple`.
sv: Av prestandaskäl får :meth:`~Pickler.reducer_override` inte anropas för följande objekt: ``None``, ``True``, ``False`` och exakta instanser av :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` och :class:`tuple`.

source: Here is a simple example where we allow pickling and reconstructing a given class::
sv: Här är ett enkelt exempel där vi tillåter betning och rekonstruktion av en given klass::

source: Out-of-band Buffers
sv: Buffertar utanför bandet
