Repository: yeager/python-docs-sv
Catalog: library/pickle.po
Languages: sv

source: :mod:`!pickle` --- Python object serialization
sv: :mod:`!pickle` --- Python-objektserialisering

source: **Source code:** :source:`Lib/pickle.py`
sv: **Källkod:** :source:`Lib/pickle.py`

source: The :mod:`pickle` module implements binary protocols for serializing and de-serializing a Python object structure. *"Pickling"* is the process whereby a Python object hierarchy is converted into a byte stream, and *"unpickling"* is the inverse operation, whereby a byte stream (from a :term:`binary file` or :term:`bytes-like object`) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as "serialization", "marshalling," [#]_ or "flattening"; however, to avoid confusion, the terms used here are "pickling" and "unpickling".
sv: Modulen :mod:`pickle` implementerar binära protokoll för serialisering och de-serialisering av en Python-objektstruktur. *"Pickling"* är processen där en Python-objekthierarki konverteras till en byte-ström, och *"unpickling"* är den omvända operationen, där en byte-ström (från en :term:`binär fil` eller :term:`bytesliknande objekt`) konverteras tillbaka till en objekthierarki. Pickling (och unpickling) kallas även "serialization", "marshalling", [#]_ eller "flattening", men för att undvika förvirring används här termerna "pickling" och "unpickling".

source: The ``pickle`` module **is not secure**. Only unpickle data you trust.
sv: Modulen ``pickle`` är **inte säker**. Plocka endast upp data som du litar på.

source: It is possible to construct malicious pickle data which will **execute arbitrary code during unpickling**. Never unpickle data that could have come from an untrusted source, or that could have been tampered with.
sv: Det är möjligt att konstruera skadlig pickle-data som **exekverar godtycklig kod under uppackning**. Plocka aldrig upp data som kan ha kommit från en icke betrodd källa eller som kan ha manipulerats.

source: Consider signing data with :mod:`hmac` if you need to ensure that it has not been tampered with.
sv: Överväg att signera data med :mod:`hmac` om du behöver försäkra dig om att de inte har manipulerats.

source: Safer serialization formats such as :mod:`json` may be more appropriate if you are processing untrusted data. See :ref:`comparison-with-json`.
sv: Säkrare serialiseringsformat som :mod:`json` kan vara lämpligare om du bearbetar otillförlitliga data. Se :ref:`jämförelse-med-json`.

source: Relationship to other Python modules
sv: Förhållande till andra Python-moduler

source: Comparison with ``marshal``
sv: Jämförelse med ``marshal``

source: Python has a more primitive serialization module called :mod:`marshal`, but in general :mod:`pickle` should always be the preferred way to serialize Python objects. :mod:`marshal` exists primarily to support Python's :file:`.pyc` files.
sv: Python har en mer primitiv serialiseringsmodul som heter :mod:`marshal`, men i allmänhet bör :mod:`pickle` alltid vara det föredragna sättet att serialisera Python-objekt. :mod:`marshal` finns främst för att stödja Pythons :file:`.pyc`-filer.

source: The :mod:`pickle` module differs from :mod:`marshal` in several significant ways:
sv: Modulen :mod:`pickle` skiljer sig från :mod:`marshal` på flera viktiga sätt:

source: The :mod:`pickle` module keeps track of the objects it has already serialized, so that later references to the same object won't be serialized again. :mod:`marshal` doesn't do this.
sv: Modulen :mod:`pickle` håller reda på de objekt som den redan har serialiserat, så att senare referenser till samma objekt inte behöver serialiseras igen. :mod:`marshal` gör inte detta.

source: This has implications both for recursive objects and object sharing. Recursive objects are objects that contain references to themselves. These are not handled by marshal, and in fact, attempting to marshal recursive objects will crash your Python interpreter. Object sharing happens when there are multiple references to the same object in different places in the object hierarchy being serialized. :mod:`pickle` stores such objects only once, and ensures that all other references point to the master copy. Shared objects remain shared, which can be very important for mutable objects.
sv: Detta har konsekvenser för både rekursiva objekt och objektdelning. Rekursiva objekt är objekt som innehåller referenser till sig själva. Dessa hanteras inte av marshal, och i själva verket kommer försök att marshalera rekursiva objekt att krascha din Python-tolk. Objektdelning sker när det finns flera referenser till samma objekt på olika platser i objekthierarkin som serialiseras. :mod:`pickle` lagrar sådana objekt endast en gång och ser till att alla andra referenser pekar på huvudkopian. Delade objekt förblir delade, vilket kan vara mycket viktigt för föränderliga objekt.

source: :mod:`marshal` cannot be used to serialize user-defined classes and their instances. :mod:`pickle` can save and restore class instances transparently, however the class definition must be importable and live in the same module as when the object was stored.
sv: :mod:`marshal` kan inte användas för att serialisera användardefinierade klasser och deras instanser. :mod:`pickle` kan spara och återställa klassinstanser på ett transparent sätt, men klassdefinitionen måste vara importerbar och finnas i samma modul som när objektet lagrades.

source: The :mod:`marshal` serialization format is not guaranteed to be portable across Python versions. Because its primary job in life is to support :file:`.pyc` files, the Python implementers reserve the right to change the serialization format in non-backwards compatible ways should the need arise. The :mod:`pickle` serialization format is guaranteed to be backwards compatible across Python releases provided a compatible pickle protocol is chosen and pickling and unpickling code deals with Python 2 to Python 3 type differences if your data is crossing that unique breaking change language boundary.
sv: Serialiseringsformatet :mod:`marshal` garanteras inte att vara portabelt mellan olika Python-versioner. Eftersom dess primära uppgift är att stödja :file:`.pyc`-filer, förbehåller sig Python-implementatörerna rätten att ändra serialiseringsformatet på icke-bakåtkompatibla sätt om behov skulle uppstå. Serialiseringsformatet :mod:`pickle` är garanterat bakåtkompatibelt mellan Python-versioner förutsatt att ett kompatibelt pickle-protokoll väljs och att pickling- och unpickling-koden hanterar typskillnader mellan Python 2 och Python 3 om dina data passerar den unika språkgränsen.

source: Comparison with ``json``
sv: Jämförelse med ``json``

source: There are fundamental differences between the pickle protocols and `JSON (JavaScript Object Notation) <https://json.org>`_:
sv: Det finns grundläggande skillnader mellan pickle-protokollen och `JSON (JavaScript Object Notation) <https://json.org>`_:

source: JSON is a text serialization format (it outputs unicode text, although most of the time it is then encoded to ``utf-8``), while pickle is a binary serialization format;
sv: JSON är ett serialiseringsformat för text (det matar ut unicode-text, även om det för det mesta sedan kodas till ``utf-8``), medan pickle är ett binärt serialiseringsformat;

source: JSON is human-readable, while pickle is not;
sv: JSON är läsbart för människor, medan pickle inte är det;

source: JSON is interoperable and widely used outside of the Python ecosystem, while pickle is Python-specific;
sv: JSON är interoperabelt och används ofta utanför Python-ekosystemet, medan pickle är Python-specifikt;

source: JSON, by default, can only represent a subset of the Python built-in types, and no custom classes; pickle can represent an extremely large number of Python types (many of them automatically, by clever usage of Python's introspection facilities; complex cases can be tackled by implementing :ref:`specific object APIs <pickle-inst>`);
sv: JSON kan som standard bara representera en delmängd av Pythons inbyggda typer, och inga anpassade klasser; pickle kan representera ett extremt stort antal Python-typer (många av dem automatiskt, genom smart användning av Pythons introspektionsmöjligheter; komplexa fall kan hanteras genom att implementera :ref:`specifika objekt-API:er <pickle-inst>`);

source: Unlike pickle, deserializing untrusted JSON does not in itself create an arbitrary code execution vulnerability.
sv: Till skillnad från pickle skapar deserialisering av icke betrodda JSON inte i sig en sårbarhet för godtycklig kodkörning.

source: The :mod:`json` module: a standard library module allowing JSON serialization and deserialization.
sv: Modulen :mod:`json`: en standardbiblioteksmodul som möjliggör serialisering och deserialisering av JSON.

source: Data stream format
sv: Format för dataström

source: The data format used by :mod:`pickle` is Python-specific. This has the advantage that there are no restrictions imposed by external standards such as JSON (which can't represent pointer sharing); however it means that non-Python programs may not be able to reconstruct pickled Python objects.
sv: Dataformatet som används av :mod:`pickle` är Python-specifikt. Fördelen med detta är att det inte finns några begränsningar från externa standarder som JSON (som inte kan representera delning av pekare), men det innebär att program som inte är Python-program kanske inte kan rekonstruera Python-objekt med pickles.

source: By default, the :mod:`pickle` data format uses a relatively compact binary representation. If you need optimal size characteristics, you can efficiently :doc:`compress <archiving>` pickled data.
sv: Som standard använder :mod:`pickle` dataformatet en relativt kompakt binär representation. Om du behöver optimala storleksegenskaper kan du på ett effektivt sätt :doc:`komprimera <archiving>` pickled data.

source: The module :mod:`pickletools` contains tools for analyzing data streams generated by :mod:`pickle`. :mod:`pickletools` source code has extensive comments about opcodes used by pickle protocols.
sv: Modulen :mod:`pickletools` innehåller verktyg för att analysera dataströmmar som genereras av :mod:`pickle`. Källkoden till :mod:`pickletools` har omfattande kommentarer om opkoder som används av pickle-protokoll.

source: There are currently 6 different protocols which can be used for pickling. The higher the protocol used, the more recent the version of Python needed to read the pickle produced.
sv: Det finns för närvarande 6 olika protokoll som kan användas för betning. Ju högre protokoll som används, desto nyare version av Python behövs för att läsa den pickle som produceras.

source: Protocol version 0 is the original "human-readable" protocol and is backwards compatible with earlier versions of Python.
sv: Protokollversion 0 är det ursprungliga "mänskligt läsbara" protokollet och är bakåtkompatibelt med tidigare versioner av Python.

source: Protocol version 1 is an old binary format which is also compatible with earlier versions of Python.
sv: Protokollversion 1 är ett gammalt binärt format som också är kompatibelt med tidigare versioner av Python.

source: Protocol version 2 was introduced in Python 2.3. It provides much more efficient pickling of :term:`new-style classes <new-style class>`. Refer to :pep:`307` for information about improvements brought by protocol 2.
sv: Protokollversion 2 introducerades i Python 2.3. Det ger mycket effektivare betning av :term:`nya stilklasser <new-style class>`. Se :pep:`307` för information om förbättringar som protokoll 2 medför.

source: Protocol version 3 was added in Python 3.0. It has explicit support for :class:`bytes` objects and cannot be unpickled by Python 2.x. This was the default protocol in Python 3.0--3.7.
sv: Protokollversion 3 lades till i Python 3.0. Det har uttryckligt stöd för :class:`bytes`-objekt och kan inte avplockas av Python 2.x. Detta var standardprotokollet i Python 3.0--3.7.

source: Protocol version 4 was added in Python 3.4. It adds support for very large objects, pickling more kinds of objects, and some data format optimizations. This was the default protocol in Python 3.8--3.13. Refer to :pep:`3154` for information about improvements brought by protocol 4.
sv: Protokollversion 4 lades till i Python 3.4. Det lägger till stöd för mycket stora objekt, pickling av fler typer av objekt och vissa dataformatoptimeringar. Detta var standardprotokollet i Python 3.8--3.13. Se :pep:`3154` för information om förbättringar som protokoll 4 medför.

source: Protocol version 5 was added in Python 3.8. It adds support for out-of-band data and speedup for in-band data. It is the default protocol starting with Python 3.14. Refer to :pep:`574` for information about improvements brought by protocol 5.
sv: Protokollversion 5 lades till i Python 3.8. Det ger stöd för data utanför bandet och ökad hastighet för data inom bandet. Det är standardprotokollet från och med Python 3.14. Se :pep:`574` för information om förbättringar som protokoll 5 medför.

source: Serialization is a more primitive notion than persistence; although :mod:`pickle` reads and writes file objects, it does not handle the issue of naming persistent objects, nor the (even more complicated) issue of concurrent access to persistent objects. The :mod:`pickle` module can transform a complex object into a byte stream and it can transform the byte stream into an object with the same internal structure. Perhaps the most obvious thing to do with these byte streams is to write them onto a file, but it is also conceivable to send them across a network or store them in a database. The :mod:`shelve` module provides a simple interface to pickle and unpickle objects on DBM-style database files.
sv: Serialisering är ett mer primitivt begrepp än persistens; även om :mod:`pickle` läser och skriver filobjekt, hanterar den inte frågan om namngivning av persistenta objekt eller den (ännu mer komplicerade) frågan om samtidig åtkomst till persistenta objekt. Modulen :mod:`pickle` kan omvandla ett komplext objekt till en byte-ström och den kan omvandla byte-strömmen till ett objekt med samma interna struktur. Det kanske mest uppenbara att göra med dessa byteflöden är att skriva dem till en fil, men det är också tänkbart att skicka dem över ett nätverk eller lagra dem i en databas. Modulen :mod:`shelve` ger ett enkelt gränssnitt för att plocka och plocka upp objekt på DBM-liknande databasfiler.

source: Module Interface
sv: Modulgränssnitt

source: To serialize an object hierarchy, you simply call the :func:`dumps` function. Similarly, to de-serialize a data stream, you call the :func:`loads` function. However, if you want more control over serialization and de-serialization, you can create a :class:`Pickler` or an :class:`Unpickler` object, respectively.
sv: För att serialisera en objekthierarki anropar du helt enkelt funktionen :func:`dumps`. På samma sätt anropar du funktionen :func:`loads` för att avserialisera en dataström. Men om du vill ha mer kontroll över serialisering och de-serialisering kan du skapa ett :class:`Pickler`- respektive ett :class:`Unpickler`-objekt.

source: The :mod:`pickle` module provides the following constants:
sv: Modulen :mod:`pickle` tillhandahåller följande konstanter:

source: An integer, the highest :ref:`protocol version <pickle-protocols>` available. This value can be passed as a *protocol* value to functions :func:`dump` and :func:`dumps` as well as the :class:`Pickler` constructor.
sv: Ett heltal, den högsta :ref:`protocol version <pickle-protocols>` som finns tillgänglig. Detta värde kan skickas som ett *protocol*-värde till funktionerna :func:`dump` och :func:`dumps` samt till :class:`Pickler`-konstruktören.

source: An integer, the default :ref:`protocol version <pickle-protocols>` used for pickling. May be less than :data:`HIGHEST_PROTOCOL`. Currently the default protocol is 5, introduced in Python 3.8 and incompatible with previous versions. This version introduces support for out-of-band buffers, where :pep:`3118`-compatible data can be transmitted separately from the main pickle stream.
sv: Ett heltal, standard :ref:``protokollversion <pickle-protocols>` som används för betning. Kan vara mindre än :data:`HIGHEST_PROTOCOL`. För närvarande är standardprotokollet 5, introducerat i Python 3.8 och inkompatibelt med tidigare versioner. Denna version introducerar stöd för out-of-band-buffertar, där :pep:`3118`-kompatibla data kan överföras separat från huvudflödet i pickle.

source: The default protocol is 3.
sv: Standardprotokollet är 3.

source: The default protocol is 4.
sv: Standardprotokollet är 4.

source: The default protocol is 5.
sv: Standardprotokollet är 5.

source: The :mod:`pickle` module provides the following functions to make the pickling process more convenient:
sv: Modulen :mod:`pickle` tillhandahåller följande funktioner för att göra betningsprocessen mer bekväm:

source: Write the pickled representation of the object *obj* to the open :term:`file object` *file*. This is equivalent to ``Pickler(file, protocol).dump(obj)``.
sv: Skriver den picklade representationen av objektet *obj* till det öppna :term:`filobjektet` *fil*. Detta är likvärdigt med ``Pickler(file, protocol).dump(obj)``.

source: Arguments *file*, *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
sv: Argumenten *file*, *protocol*, *fix_imports* och *buffer_callback* har samma betydelse som i :class:`Pickler`-konstruktorn.

source: The *buffer_callback* argument was added.
sv: Argumentet *buffer_callback* har lagts till.

source: Return the pickled representation of the object *obj* as a :class:`bytes` object, instead of writing it to a file.
sv: Returnerar den betade representationen av objektet *obj* som ett :class:`bytes`-objekt, istället för att skriva det till en fil.

source: Arguments *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
sv: Argumenten *protocol*, *fix_imports* och *buffer_callback* har samma betydelse som i :class:`Pickler`-konstruktorn.

source: Read the pickled representation of an object from the open :term:`file object` *file* and return the reconstituted object hierarchy specified therein. This is equivalent to ``Unpickler(file).load()``.
sv: Läser in den inlagda representationen av ett objekt från den öppna :term:`file object` *file* och returnerar den rekonstruerade objekthierarkin som anges där. Detta är ekvivalent med ``Unpickler(file).load()``.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed. Bytes past the pickled representation of the object are ignored.
sv: Protokollversionen av pickle upptäcks automatiskt, så inget protokollargument behövs. Bytes som ligger efter objektets picklade representation ignoreras.

source: Arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
sv: Argumenten *file*, *fix_imports*, *encoding*, *errors*, *strict* och *buffers* har samma betydelse som i konstruktören :class:`Unpickler`.

source: The *buffers* argument was added.
sv: Argumentet *buffertar* har lagts till.

source: Return the reconstituted object hierarchy of the pickled representation *data* of an object. *data* must be a :term:`bytes-like object`.
sv: Returnerar den rekonstituerade objekthierarkin för den betade representationen *data* av ett objekt. *data* måste vara en :term:`bytesliknande objekt`.

source: Arguments *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
sv: Argumenten *fix_imports*, *encoding*, *errors*, *strict* och *buffers* har samma betydelse som i konstruktören :class:`Unpickler`.

source: The :mod:`pickle` module defines three exceptions:
sv: Modulen :mod:`pickle` definierar tre undantag:

source: Common base class for the other pickling exceptions. It inherits from :exc:`Exception`.
sv: Gemensam basklass för de andra betningsundantagen. Den ärver från :exc:`Exception`.

source: Error raised when an unpicklable object is encountered by :class:`Pickler`. It inherits from :exc:`PickleError`.
sv: Fel som uppstår när ett objekt som inte går att plocka upp påträffas av :class:`Pickler`. Det ärver från :exc:`PickleError`.

source: Refer to :ref:`pickle-picklable` to learn what kinds of objects can be pickled.
sv: Se :ref:`pickle-picklable` för att lära dig vilka typer av objekt som kan picklas.

source: Error raised when there is a problem unpickling an object, such as a data corruption or a security violation. It inherits from :exc:`PickleError`.
sv: Fel som uppstår när det finns ett problem med att plocka upp ett objekt, t.ex. datakorruption eller säkerhetsöverträdelse. Det ärver från :exc:`PickleError`.

source: Note that other exceptions may also be raised during unpickling, including (but not necessarily limited to) AttributeError, EOFError, ImportError, and IndexError.
sv: Observera att andra undantag också kan uppstå under unpickling, inklusive (men inte nödvändigtvis begränsat till) AttributeError, EOFError, ImportError och IndexError.

source: The :mod:`pickle` module exports three classes, :class:`Pickler`, :class:`Unpickler` and :class:`PickleBuffer`:
sv: Modulen :mod:`pickle` exporterar tre klasser, :class:`Pickler`, :class:`Unpickler` och :class:`PickleBuffer`:

source: This takes a binary file for writing a pickle data stream.
sv: Detta tar en binär fil för att skriva en pickle-dataström.

source: The optional *protocol* argument, an integer, tells the pickler to use the given protocol; supported protocols are 0 to :data:`HIGHEST_PROTOCOL`. If not specified, the default is :data:`DEFAULT_PROTOCOL`. If a negative number is specified, :data:`HIGHEST_PROTOCOL` is selected.
sv: Det valfria argumentet *protocol*, ett heltal, talar om för betningsmaskinen att den ska använda det angivna protokollet; protokoll som stöds är 0 till :data:`HIGHEST_PROTOCOL`. Om det inte anges är standardvärdet :data:`DEFAULT_PROTOCOL`. Om ett negativt tal anges väljs :data:`HIGHEST_PROTOCOL`.

source: The *file* argument must have a write() method that accepts a single bytes argument. It can thus be an on-disk file opened for binary writing, an :class:`io.BytesIO` instance, or any other custom object that meets this interface.
sv: Argumentet *file* måste ha en write()-metod som accepterar ett enda bytes-argument. Det kan alltså vara en fil på disken som är öppen för binär skrivning, en :class:`io.BytesIO`-instans eller något annat anpassat objekt som uppfyller detta gränssnitt.

source: If *fix_imports* is true and *protocol* is less than 3, pickle will try to map the new Python 3 names to the old module names used in Python 2, so that the pickle data stream is readable with Python 2.
sv: Om *fix_imports* är true och *protocol* är mindre än 3, kommer pickle att försöka mappa de nya Python 3-namnen till de gamla modulnamnen som används i Python 2, så att pickle-dataflödet kan läsas med Python 2.

source: If *buffer_callback* is ``None`` (the default), buffer views are serialized into *file* as part of the pickle stream.
sv: Om *buffer_callback* är ``None`` (standard), serialiseras buffertvyer till *file* som en del av pickle-strömmen.

source: If *buffer_callback* is not ``None``, then it can be called any number of times with a buffer view. If the callback returns a false value (such as ``None``), the given buffer is :ref:`out-of-band <pickle-oob>`; otherwise the buffer is serialized in-band, i.e. inside the pickle stream.
sv: Om *buffer_callback* inte är ``None`` kan den anropas hur många gånger som helst med en buffertvy. Om callbacken returnerar ett falskt värde (t.ex. ``None``), är den givna bufferten :ref:``out-of-band <pickle-oob>``; annars serialiseras bufferten in-band, dvs. inuti pickle-strömmen.
