Repository: yeager/python-docs-sv
Catalog: library/pickle.po
Languages: sv

source: It is an error if *buffer_callback* is not ``None`` and *protocol* is ``None`` or smaller than 5.
sv: Det är ett fel om *buffer_callback* inte är ``None`` och *protocol* är ``None`` eller mindre än 5.

source: Write the pickled representation of *obj* to the open file object given in the constructor.
sv: Skriv den betade representationen av *obj* till open file-objektet som anges i konstruktören.

source: Do nothing by default. This exists so a subclass can override it.
sv: Gör ingenting som standard. Detta finns så att en underklass kan åsidosätta det.

source: If :meth:`persistent_id` returns ``None``, *obj* is pickled as usual. Any other value causes :class:`Pickler` to emit the returned value as a persistent ID for *obj*. The meaning of this persistent ID should be defined by :meth:`Unpickler.persistent_load`. Note that the value returned by :meth:`persistent_id` cannot itself have a persistent ID.
sv: Om :meth:`persistent_id` returnerar ``None`` betas *obj* som vanligt. Alla andra värden gör att :class:`Pickler` skickar ut det returnerade värdet som ett persistent ID för *obj*. Betydelsen av detta persistenta ID bör definieras av :meth:`Unpickler.persistent_load`. Observera att det värde som returneras av :meth:`persistent_id` inte själv kan ha ett persistent ID.

source: See :ref:`pickle-persistent` for details and examples of uses.
sv: Se :ref:`pickle-persistent` för detaljer och exempel på användningsområden.

source: Add the default implementation of this method in the C implementation of :class:`!Pickler`.
sv: Lägg till standardimplementationen av den här metoden i C-implementationen av :class:`!Pickler`.

source: A pickler object's dispatch table is a registry of *reduction functions* of the kind which can be declared using :func:`copyreg.pickle`. It is a mapping whose keys are classes and whose values are reduction functions. A reduction function takes a single argument of the associated class and should conform to the same interface as a :meth:`~object.__reduce__` method.
sv: Ett picklerobjekts dispatch table är ett register över *reduktionsfunktioner* av den typ som kan deklareras med :func:`copyreg.pickle`. Det är en mappning vars nycklar är klasser och vars värden är reduktionsfunktioner. En reduktionsfunktion tar ett enda argument från den associerade klassen och bör överensstämma med samma gränssnitt som en :meth:`~object.__reduce__`-metod.

source: By default, a pickler object will not have a :attr:`dispatch_table` attribute, and it will instead use the global dispatch table managed by the :mod:`copyreg` module. However, to customize the pickling for a specific pickler object one can set the :attr:`dispatch_table` attribute to a dict-like object. Alternatively, if a subclass of :class:`Pickler` has a :attr:`dispatch_table` attribute then this will be used as the default dispatch table for instances of that class.
sv: Som standard kommer ett pickler-objekt inte att ha ett :attr:`dispatch_table`-attribut, och det kommer istället att använda den globala dispatch-tabellen som hanteras av :mod:`copyreg`-modulen. För att anpassa betningen för ett specifikt betningsobjekt kan man dock ställa in attributet :attr:`dispatch_table` till ett diktliknande objekt. Alternativt, om en underklass av :class:`Pickler` har ett :attr:`dispatch_table` attribut så kommer detta att användas som standard dispatch table för instanser av den klassen.

source: See :ref:`pickle-dispatch` for usage examples.
sv: Se :ref:`pickle-dispatch` för användningsexempel.

source: Special reducer that can be defined in :class:`Pickler` subclasses. This method has priority over any reducer in the :attr:`dispatch_table`. It should conform to the same interface as a :meth:`~object.__reduce__` method, and can optionally return :data:`NotImplemented` to fallback on :attr:`dispatch_table`-registered reducers to pickle ``obj``.
sv: Speciell reducerare som kan definieras i :class:`Pickler` subklasser. Denna metod har prioritet över alla reducerare i :attr:`dispatch_table`. Den bör överensstämma med samma gränssnitt som en :meth:`~object.__reduce__`-metod, och kan eventuellt returnera :data:`NotImplemented` för att fallbacka på :attr:`dispatch_table`-registrerade reducerare för att plocka ``obj``.

source: For a detailed example, see :ref:`reducer_override`.
sv: För ett detaljerat exempel, se :ref:`reducer_override`.

source: Deprecated. Enable fast mode if set to a true value. The fast mode disables the usage of memo, therefore speeding the pickling process by not generating superfluous PUT opcodes. It should not be used with self-referential objects, doing otherwise will cause :class:`Pickler` to recurse infinitely.
sv: Föråldrad. Aktiverar snabbläge om det sätts till ett sant värde. Det snabba läget inaktiverar användningen av memo, vilket påskyndar betningsprocessen genom att inte generera överflödiga PUT-opkoder. Det bör inte användas med självrefererande objekt, annars kommer :class:`Pickler` att rekursera oändligt.

source: Use :func:`pickletools.optimize` if you need more compact pickles.
sv: Använd :func:`pickletools.optimize` om du behöver mer kompakta pickles.

source: Clears the pickler's "memo".
sv: Rensar picklerns "memo".

source: The memo is the data structure that remembers which objects the pickler has already seen, so that shared or recursive objects are pickled by reference and not by value. This method is useful when re-using picklers.
sv: Memot är den datastruktur som kommer ihåg vilka objekt som picklern redan har sett, så att delade eller rekursiva objekt picklas per referens och inte per värde. Denna metod är användbar vid återanvändning av picklers.

source: This takes a binary file for reading a pickle data stream.
sv: Detta tar en binär fil för att läsa en pickle-dataström.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed.
sv: Protokollversionen av pickle identifieras automatiskt, så inget protokollargument behövs.

source: The argument *file* must have three methods, a read() method that takes an integer argument, a readinto() method that takes a buffer argument and a readline() method that requires no arguments, as in the :class:`io.BufferedIOBase` interface. Thus *file* can be an on-disk file opened for binary reading, an :class:`io.BytesIO` object, or any other custom object that meets this interface.
sv: Argumentet *file* måste ha tre metoder, en read()-metod som tar ett heltalsargument, en readinto()-metod som tar ett buffertargument och en readline()-metod som inte kräver några argument, som i gränssnittet :class:`io.BufferedIOBase`. Således kan *file* vara en diskfil som öppnas för binär läsning, ett :class:`io.BytesIO`-objekt eller något annat anpassat objekt som uppfyller detta gränssnitt.

source: The optional arguments *fix_imports*, *encoding* and *errors* are used to control compatibility support for pickle stream generated by Python 2. If *fix_imports* is true, pickle will try to map the old Python 2 names to the new names used in Python 3. The *encoding* and *errors* tell pickle how to decode 8-bit string instances pickled by Python 2; these default to 'ASCII' and 'strict', respectively. The *encoding* can be 'bytes' to read these 8-bit string instances as bytes objects. Using ``encoding='latin1'`` is required for unpickling NumPy arrays and instances of :class:`~datetime.datetime`, :class:`~datetime.date` and :class:`~datetime.time` pickled by Python 2.
sv: De valfria argumenten *fix_imports*, *encoding* och *errors* används för att styra kompatibilitetsstödet för pickle-strömmar som genererats av Python 2. Om *fix_imports* är true kommer pickle att försöka mappa de gamla Python 2-namnen till de nya namn som används i Python 3. *encoding* och *errors* talar om för pickle hur man avkodar 8-bitars stränginstanser som plockats upp av Python 2; dessa är standardiserade till 'ASCII' respektive 'strict'. *encoding* kan vara 'bytes' för att läsa dessa 8-bitars stränginstanser som bytes-objekt. Användning av ``encoding='latin1'`` krävs för att avplocka NumPy-arrayer och instanser av :class:`~datetime.datetime`, :class:`~datetime.date` och :class:`~datetime.time` som avplockats av Python 2.

source: If *buffers* is ``None`` (the default), then all data necessary for deserialization must be contained in the pickle stream. This means that the *buffer_callback* argument was ``None`` when a :class:`Pickler` was instantiated (or when :func:`dump` or :func:`dumps` was called).
sv: Om *buffers* är ``None`` (standard) måste all data som behövs för deserialisering finnas i pickle-strömmen. Detta innebär att argumentet *buffer_callback* var ``None`` när en :class:`Pickler` instantierades (eller när :func:`dump` eller :func:`dumps` anropades).

source: If *buffers* is not ``None``, it should be an iterable of buffer-enabled objects that is consumed each time the pickle stream references an :ref:`out-of-band <pickle-oob>` buffer view. Such buffers have been given in order to the *buffer_callback* of a Pickler object.
sv: Om *buffers* inte är ``None``, bör det vara en iterabel av buffertaktiverade objekt som konsumeras varje gång pickle-strömmen refererar till en :ref:``out-of-band <pickle-oob>` buffertvy. Sådana buffertar har givits i ordning till *buffer_callback* för ett Pickler-objekt.

source: Read the pickled representation of an object from the open file object given in the constructor, and return the reconstituted object hierarchy specified therein. Bytes past the pickled representation of the object are ignored.
sv: Läser den betade representationen av ett objekt från det öppna filobjektet som anges i konstruktören och returnerar den rekonstruerade objekthierarkin som anges däri. Byte efter den betade representationen av objektet ignoreras.

source: Raise an :exc:`UnpicklingError` by default.
sv: Ger som standard upphov till ett :exc:`UnpicklingError`.

source: If defined, :meth:`persistent_load` should return the object specified by the persistent ID *pid*. If an invalid persistent ID is encountered, an :exc:`UnpicklingError` should be raised.
sv: Om definierat bör :meth:`persistent_load` returnera det objekt som anges av det beständiga ID:t *pid*. Om ett ogiltigt beständigt ID påträffas bör ett :exc:`UnpicklingError` uppstå.

source: Add the default implementation of this method in the C implementation of :class:`!Unpickler`.
sv: Lägg till standardimplementationen av denna metod i C-implementationen av :class:`!Unpickler`.

source: Import *module* if necessary and return the object called *name* from it, where the *module* and *name* arguments are :class:`str` objects. Note, unlike its name suggests, :meth:`find_class` is also used for finding functions.
sv: Importera *modul* om det behövs och returnera objektet som heter *namn* från den, där argumenten *modul* och *namn* är :class:`str`-objekt. Observera att, till skillnad från vad namnet antyder, används :meth:`find_class` också för att hitta funktioner.

source: Subclasses may override this to gain control over what type of objects and how they can be loaded, potentially reducing security risks. Refer to :ref:`pickle-restrict` for details.
sv: Underklasser kan åsidosätta detta för att få kontroll över vilken typ av objekt och hur de kan laddas, vilket potentiellt kan minska säkerhetsriskerna. Se :ref:`pickle-restrict` för mer information.

source: Raises an :ref:`auditing event <auditing>` ``pickle.find_class`` with arguments ``module``, ``name``.
sv: Utlöser en :ref:`auditing event <auditing>` ``pickle.find_class`` med argumenten ``module``, ``name``.

source: A wrapper for a buffer representing picklable data. *buffer* must be a :ref:`buffer-providing <bufferobjects>` object, such as a :term:`bytes-like object` or a N-dimensional array.
sv: Ett omslag för en buffert som representerar betningsbar data. *buffer* måste vara ett :ref:``buffer-providing <bufferobjects>`-objekt, t.ex. ett :term:`bytesliknande objekt` eller en N-dimensionell array.

source: :class:`PickleBuffer` is itself a buffer provider, therefore it is possible to pass it to other APIs expecting a buffer-providing object, such as :class:`memoryview`.
sv: :class:`PickleBuffer` är i sig en buffertleverantör, därför är det möjligt att skicka den till andra API:er som förväntar sig ett buffertlevererande objekt, t.ex. :class:`memoryview`.

source: :class:`PickleBuffer` objects can only be serialized using pickle protocol 5 or higher. They are eligible for :ref:`out-of-band serialization <pickle-oob>`.
sv: :class:`PickleBuffer`-objekt kan endast serialiseras med pickle protokoll 5 eller högre. De är kvalificerade för :ref:``out-of-band serialization <pickle-oob>`.

source: Return a :class:`memoryview` of the memory area underlying this buffer. The returned object is a one-dimensional, C-contiguous memoryview with format ``B`` (unsigned bytes). :exc:`BufferError` is raised if the buffer is neither C- nor Fortran-contiguous.
sv: Returnerar en :class:`memoryview` av minnesområdet som ligger bakom denna buffert. Det returnerade objektet är en endimensionell, C-sluten minnesvy med format ``B`` (osignerade byte). :exc:`BufferError` uppstår om bufferten varken är C- eller Fortran-sluten.

source: Release the underlying buffer exposed by the PickleBuffer object.
sv: Frigör den underliggande bufferten som exponeras av PickleBuffer-objektet.

source: What can be pickled and unpickled?
sv: Vad kan vara inlagt och oinlagt?

source: The following types can be pickled:
sv: Följande typer kan picklas:

source: built-in constants (``None``, ``True``, ``False``, ``Ellipsis``, and :data:`NotImplemented`);
sv: inbyggda konstanter (``None``, ``True``, ``False``, ``Ellipsis`` och :data:`NotImplemented`);

source: integers, floating-point numbers, complex numbers;
sv: heltal, flyttal, komplexa tal;

source: strings, bytes, bytearrays;
sv: strängar, byte, bytearrayer;

source: tuples, lists, sets, and dictionaries containing only picklable objects;
sv: tupler, listor, mängder och lexikon som endast innehåller plockbara objekt;

source: functions (built-in and user-defined) accessible from the top level of a module (using :keyword:`def`, not :keyword:`lambda`);
sv: funktioner (inbyggda och användardefinierade) som är tillgängliga från den översta nivån i en modul (med :keyword:`def`, inte :keyword:`lambda`);

source: classes accessible from the top level of a module;
sv: klasser som är tillgängliga från den översta nivån i en modul;

source: instances of such classes whose the result of calling :meth:`~object.__getstate__` is picklable (see section :ref:`pickle-inst` for details).
sv: instanser av sådana klasser vars resultat av anropet :meth:`~object.__getstate__` är picklable (se avsnitt :ref:`pickle-inst` för detaljer).

source: Attempts to pickle unpicklable objects will raise the :exc:`PicklingError` exception; when this happens, an unspecified number of bytes may have already been written to the underlying file. Trying to pickle a highly recursive data structure may exceed the maximum recursion depth, a :exc:`RecursionError` will be raised in this case. You can carefully raise this limit with :func:`sys.setrecursionlimit`.
sv: Försök att plocka ut icke-plockbara objekt kommer att ge upphov till undantaget :exc:`PicklingError`; när detta händer kan ett ospecificerat antal byte redan ha skrivits till den underliggande filen. Att försöka plocka en mycket rekursiv datastruktur kan överskrida det maximala rekursionsdjupet, ett :exc:`RecursionError` kommer att uppstå i detta fall. Du kan försiktigt höja denna gräns med :func:`sys.setrecursionlimit`.

source: Note that functions (built-in and user-defined) are pickled by fully :term:`qualified name`, not by value. [#]_ This means that only the function name is pickled, along with the name of the containing module and classes. Neither the function's code, nor any of its function attributes are pickled. Thus the defining module must be importable in the unpickling environment, and the module must contain the named object, otherwise an exception will be raised. [#]_
sv: Observera att funktioner (inbyggda och användardefinierade) betas med fullt :term:`kvalificerat namn`, inte med värde. [#]_ Detta innebär att endast funktionsnamnet betas, tillsammans med namnet på den modul och de klasser som innehåller funktionen. Varken funktionens kod eller några av dess funktionsattribut betas. Den definierande modulen måste alltså vara importerbar i unpickling-miljön, och modulen måste innehålla det namngivna objektet, annars kommer ett undantag att uppstå. [#]_

source: Similarly, classes are pickled by fully qualified name, so the same restrictions in the unpickling environment apply. Note that none of the class's code or data is pickled, so in the following example the class attribute ``attr`` is not restored in the unpickling environment::
sv: På samma sätt betas klasser med fullt kvalificerat namn, så samma restriktioner i betningsmiljön gäller. Observera att ingen av klassens kod eller data betas in, så i följande exempel återställs inte klassattributet ``attr`` i unpickling-miljön::

source: These restrictions are why picklable functions and classes must be defined at the top level of a module.
sv: Dessa begränsningar är skälet till att picklbara funktioner och klasser måste definieras på den översta nivån i en modul.

source: Similarly, when class instances are pickled, their class's code and data are not pickled along with them. Only the instance data are pickled. This is done on purpose, so you can fix bugs in a class or add methods to the class and still load objects that were created with an earlier version of the class. If you plan to have long-lived objects that will see many versions of a class, it may be worthwhile to put a version number in the objects so that suitable conversions can be made by the class's :meth:`~object.__setstate__` method.
sv: På samma sätt, när klassinstanser betas, betas inte deras klass kod och data tillsammans med dem. Det är bara instansens data som syltas. Detta görs med avsikt, så att du kan åtgärda buggar i en klass eller lägga till metoder i klassen och fortfarande ladda objekt som skapades med en tidigare version av klassen. Om du planerar att ha långlivade objekt som kommer att se många versioner av en klass kan det vara värt att lägga in ett versionsnummer i objekten så att lämpliga konverteringar kan göras av klassens :meth:`~object.__setstate__`-metod.

source: Pickling Class Instances
sv: Beizning av klassinstanser

source: In this section, we describe the general mechanisms available to you to define, customize, and control how class instances are pickled and unpickled.
sv: I det här avsnittet beskriver vi de allmänna mekanismer som finns tillgängliga för att definiera, anpassa och styra hur klassinstanser ska picklas och unpicklas.

source: In most cases, no additional code is needed to make instances picklable. By default, pickle will retrieve the class and the attributes of an instance via introspection. When a class instance is unpickled, its :meth:`~object.__init__` method is usually *not* invoked. The default behaviour first creates an uninitialized instance and then restores the saved attributes. The following code shows an implementation of this behaviour::
sv: I de flesta fall behövs ingen ytterligare kod för att göra instanser plockbara. Som standard kommer pickle att hämta klassen och attributen för en instans via introspektion. När en klassinstans avplockas anropas dess :meth:`~object.__init__`-metod vanligtvis *inte*. Standardbeteendet skapar först en oinitialiserad instans och återställer sedan de sparade attributen. Följande kod visar en implementering av detta beteende::

source: Classes can alter the default behaviour by providing one or several special methods:
sv: Klasser kan ändra standardbeteendet genom att tillhandahålla en eller flera specialmetoder:

source: In protocols 2 and newer, classes that implements the :meth:`__getnewargs_ex__` method can dictate the values passed to the :meth:`__new__` method upon unpickling. The method must return a pair ``(args, kwargs)`` where *args* is a tuple of positional arguments and *kwargs* a dictionary of named arguments for constructing the object. Those will be passed to the :meth:`__new__` method upon unpickling.
sv: I protokoll 2 och nyare kan klasser som implementerar metoden :meth:`__getnewargs_ex__` diktera de värden som skickas till metoden :meth:`__new__` vid unpickling. Metoden måste returnera ett par ``(args, kwargs)`` där *args* är en tupel av positionella argument och *kwargs* en dictionary av namngivna argument för att konstruera objektet. Dessa kommer att skickas till :meth:`__new__`-metoden vid uppplockning.

source: You should implement this method if the :meth:`__new__` method of your class requires keyword-only arguments. Otherwise, it is recommended for compatibility to implement :meth:`__getnewargs__`.
sv: Du bör implementera denna metod om metoden :meth:`__new__` i din klass kräver argument som endast innehåller nyckelord. I annat fall rekommenderas det av kompatibilitetsskäl att implementera :meth:`__getnewargs__`.

source: :meth:`__getnewargs_ex__` is now used in protocols 2 and 3.
sv: :meth:`__getnewargs_ex__` används nu i protokoll 2 och 3.

source: This method serves a similar purpose as :meth:`__getnewargs_ex__`, but supports only positional arguments. It must return a tuple of arguments ``args`` which will be passed to the :meth:`__new__` method upon unpickling.
sv: Denna metod tjänar ett liknande syfte som :meth:`__getnewargs_ex__`, men stöder endast positionella argument. Den måste returnera en tupel av argument ``args`` som kommer att skickas till :meth:`__new__`` metoden vid uppplockning.

source: :meth:`__getnewargs__` will not be called if :meth:`__getnewargs_ex__` is defined.
sv: :meth:`__getnewargs__` kommer inte att anropas om :meth:`__getnewargs_ex__` är definierad.

source: Before Python 3.6, :meth:`__getnewargs__` was called instead of :meth:`__getnewargs_ex__` in protocols 2 and 3.
sv: Före Python 3.6 anropades :meth:`__getnewargs__` i stället för :meth:`__getnewargs_ex__` i protokoll 2 och 3.

source: Classes can further influence how their instances are pickled by overriding the method :meth:`__getstate__`. It is called and the returned object is pickled as the contents for the instance, instead of a default state. There are several cases:
sv: Klasser kan ytterligare påverka hur deras instanser picklas genom att åsidosätta metoden :meth:`__getstate__`. Den anropas och det returnerade objektet picklas som innehåll för instansen, istället för ett standardtillstånd. Det finns flera fall:

source: For a class that has no instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``None``.
sv: För en klass som inte har någon instans :attr:`~object.__dict__` och ingen :attr:`~object.__slots__` är standardtillståndet ``None``.

source: For a class that has an instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``self.__dict__``.
sv: För en klass som har en instans :attr:`~object.__dict__` och ingen :attr:`~object.__slots__`, är standardtillståndet ``self.__dict__``.

source: For a class that has an instance :attr:`~object.__dict__` and :attr:`~object.__slots__`, the default state is a tuple consisting of two dictionaries: ``self.__dict__``, and a dictionary mapping slot names to slot values. Only slots that have a value are included in the latter.
sv: För en klass som har en instans :attr:`~object.__dict__` och :attr:`~object.__slots__` är standardtillståndet en tupel som består av två lexikon: ``self.__dict__`` och en ordbok som mappar slotnamn till slotvärden. Endast slots som har ett värde ingår i den senare.
