Repository: yeager/python-docs-sv
Catalog: library/pickle.po
Languages: sv

source: In some contexts, the :mod:`pickle` module is used to transfer massive amounts of data. Therefore, it can be important to minimize the number of memory copies, to preserve performance and resource consumption. However, normal operation of the :mod:`pickle` module, as it transforms a graph-like structure of objects into a sequential stream of bytes, intrinsically involves copying data to and from the pickle stream.
sv: I vissa sammanhang används modulen :mod:`pickle` för att överföra stora mängder data. Därför kan det vara viktigt att minimera antalet minneskopior för att bevara prestanda och resursförbrukning. Normal användning av modulen :mod:`pickle`, som omvandlar en grafliknande struktur av objekt till en sekventiell ström av bytes, innebär dock i sig att data kopieras till och från pickle-strömmen.

source: This constraint can be eschewed if both the *provider* (the implementation of the object types to be transferred) and the *consumer* (the implementation of the communications system) support the out-of-band transfer facilities provided by pickle protocol 5 and higher.
sv: Denna begränsning kan undvikas om både *provider* (implementationen av de objekttyper som ska överföras) och *consumer* (implementationen av kommunikationssystemet) stöder de överföringsmöjligheter utanför bandet som tillhandahålls av pickle protocol 5 och högre.

source: Provider API
sv: Leverantörs-API

source: The large data objects to be pickled must implement a :meth:`~object.__reduce_ex__` method specialized for protocol 5 and higher, which returns a :class:`PickleBuffer` instance (instead of e.g. a :class:`bytes` object) for any large data.
sv: De stora dataobjekt som ska betas måste implementera en :meth:`~object.__reduce_ex__`-metod som är specialiserad för protokoll 5 och högre, som returnerar en :class:`PickleBuffer`-instans (i stället för t.ex. ett :class:`bytes`-objekt) för alla stora data.

source: A :class:`PickleBuffer` object *signals* that the underlying buffer is eligible for out-of-band data transfer. Those objects remain compatible with normal usage of the :mod:`pickle` module. However, consumers can also opt-in to tell :mod:`pickle` that they will handle those buffers by themselves.
sv: Ett :class:`PickleBuffer`-objekt *signalerar* att den underliggande bufferten är kvalificerad för dataöverföring utanför bandet. Dessa objekt förblir kompatibla med normal användning av modulen :mod:`pickle`. Men konsumenter kan också välja att tala om för :mod:`pickle` att de kommer att hantera dessa buffertar själva.

source: Consumer API
sv: API för konsumenter

source: A communications system can enable custom handling of the :class:`PickleBuffer` objects generated when serializing an object graph.
sv: Ett kommunikationssystem kan möjliggöra anpassad hantering av :class:`PickleBuffer`-objekt som genereras vid serialisering av en objektgraf.

source: On the sending side, it needs to pass a *buffer_callback* argument to :class:`Pickler` (or to the :func:`dump` or :func:`dumps` function), which will be called with each :class:`PickleBuffer` generated while pickling the object graph. Buffers accumulated by the *buffer_callback* will not see their data copied into the pickle stream, only a cheap marker will be inserted.
sv: På sändningssidan måste den skicka ett *buffer_callback*-argument till :class:`Pickler` (eller till :func:`dump` eller :func:`dumps`-funktionen), som kommer att anropas med varje :class:`PickleBuffer` som genereras när objektgrafen plockas. Buffertar som ackumuleras av *buffer_callback* kommer inte att få sina data kopierade till pickle-strömmen, endast en billig markör kommer att infogas.

source: On the receiving side, it needs to pass a *buffers* argument to :class:`Unpickler` (or to the :func:`load` or :func:`loads` function), which is an iterable of the buffers which were passed to *buffer_callback*. That iterable should produce buffers in the same order as they were passed to *buffer_callback*. Those buffers will provide the data expected by the reconstructors of the objects whose pickling produced the original :class:`PickleBuffer` objects.
sv: På mottagarsidan måste den skicka ett *buffers*-argument till :class:`Unpickler` (eller till funktionen :func:`load` eller :func:`loads`), som är en iterabel av de buffertar som skickades till *buffer_callback*. Denna iterabel bör producera buffertar i samma ordning som de skickades till *buffer_callback*. Dessa buffertar kommer att tillhandahålla de data som förväntas av rekonstruktörerna av de objekt vars betning producerade de ursprungliga :class:`PickleBuffer`-objekten.

source: Between the sending side and the receiving side, the communications system is free to implement its own transfer mechanism for out-of-band buffers. Potential optimizations include the use of shared memory or datatype-dependent compression.
sv: Mellan sändar- och mottagarsidan är kommunikationssystemet fritt att implementera sin egen överföringsmekanism för buffertar utanför bandet. Potentiella optimeringar inkluderar användning av delat minne eller datatypberoende komprimering.

source: Example
sv: Exempel

source: Here is a trivial example where we implement a :class:`bytearray` subclass able to participate in out-of-band buffer pickling::
sv: Här är ett trivialt exempel där vi implementerar en :class:`bytearray`-underklass som kan delta i buffer pickling utanför bandet::

source: The reconstructor (the ``_reconstruct`` class method) returns the buffer's providing object if it has the right type. This is an easy way to simulate zero-copy behaviour on this toy example.
sv: Rekonstruktören (klassmetoden ``_reconstruct``) returnerar buffertens tillhandahållande objekt om det har rätt typ. Detta är ett enkelt sätt att simulera nollkopieringsbeteende i detta leksaksexempel.

source: On the consumer side, we can pickle those objects the usual way, which when unserialized will give us a copy of the original object::
sv: På konsumentsidan kan vi plocka upp dessa objekt på vanligt sätt, vilket när det är oserialiserat ger oss en kopia av det ursprungliga objektet::

source: But if we pass a *buffer_callback* and then give back the accumulated buffers when unserializing, we are able to get back the original object::
sv: Men om vi skickar en *buffer_callback* och sedan ger tillbaka de ackumulerade buffertarna när vi unserialiserar, kan vi få tillbaka det ursprungliga objektet::

source: This example is limited by the fact that :class:`bytearray` allocates its own memory: you cannot create a :class:`bytearray` instance that is backed by another object's memory. However, third-party datatypes such as NumPy arrays do not have this limitation, and allow use of zero-copy pickling (or making as few copies as possible) when transferring between distinct processes or systems.
sv: Detta exempel begränsas av det faktum att :class:`bytearray` allokerar sitt eget minne: du kan inte skapa en :class:`bytearray`-instans som backas upp av ett annat objekts minne. Tredjepartsdatatyper som NumPy-arrays har dock inte denna begränsning och tillåter användning av zero-copy pickling (eller att göra så få kopior som möjligt) vid överföring mellan olika processer eller system.

source: :pep:`574` -- Pickle protocol 5 with out-of-band data
sv: :pep:`574` -- Pickle protokoll 5 med data utanför bandet

source: Restricting Globals
sv: Begränsning av globaler

source: By default, unpickling will import any class or function that it finds in the pickle data. For many applications, this behaviour is unacceptable as it permits the unpickler to import and invoke arbitrary code. Just consider what this hand-crafted pickle data stream does when loaded::
sv: Som standard importerar unpickling alla klasser eller funktioner som den hittar i pickle-data. För många applikationer är detta beteende oacceptabelt eftersom det tillåter unpickling att importera och anropa godtycklig kod. Tänk bara på vad den här handgjorda pickle-dataströmmen gör när den laddas::

source: In this example, the unpickler imports the :func:`os.system` function and then apply the string argument "echo hello world". Although this example is inoffensive, it is not difficult to imagine one that could damage your system.
sv: I det här exemplet importerar unpickler funktionen :func:`os.system` och använder sedan strängargumentet "echo hello world". Även om detta exempel är ofarligt är det inte svårt att föreställa sig ett exempel som kan skada ditt system.

source: For this reason, you may want to control what gets unpickled by customizing :meth:`Unpickler.find_class`. Unlike its name suggests, :meth:`Unpickler.find_class` is called whenever a global (i.e., a class or a function) is requested. Thus it is possible to either completely forbid globals or restrict them to a safe subset.
sv: Av denna anledning kanske du vill kontrollera vad som blir unpickled genom att anpassa :meth:`Unpickler.find_class`. Till skillnad från vad namnet antyder anropas :meth:`Unpickler.find_class` när en global (dvs. en klass eller en funktion) begärs. Det är alltså möjligt att antingen helt förbjuda globaler eller begränsa dem till en säker delmängd.

source: Here is an example of an unpickler allowing only few safe classes from the :mod:`builtins` module to be loaded::
sv: Här är ett exempel på en unpickler som tillåter att endast ett fåtal säkra klasser från modulen :mod:`builtins` laddas::

source: A sample usage of our unpickler working as intended::
sv: Ett exempel på användning av vår unpickler som fungerar som avsett::

source: As our examples shows, you have to be careful with what you allow to be unpickled. Therefore if security is a concern, you may want to consider alternatives such as the marshalling API in :mod:`xmlrpc.client` or third-party solutions.
sv: Som våra exempel visar måste du vara försiktig med vad du tillåter att bli unpickled. Om säkerhet är ett problem kan du därför överväga alternativ som marshalling API i :mod:`xmlrpc.client` eller tredjepartslösningar.

source: Performance
sv: Prestanda

source: Recent versions of the pickle protocol (from protocol 2 and upwards) feature efficient binary encodings for several common features and built-in types. Also, the :mod:`pickle` module has a transparent optimizer written in C.
sv: De senaste versionerna av pickle-protokollet (från protokoll 2 och uppåt) har effektiva binära kodningar för flera vanliga funktioner och inbyggda typer. Dessutom har modulen :mod:`pickle` en transparent optimerare skriven i C.

source: Examples
sv: Exempel

source: For the simplest code, use the :func:`dump` and :func:`load` functions. ::
sv: För den enklaste koden, använd funktionerna :func:`dump` och :func:`load`. ::

source: The following example reads the resulting pickled data. ::
sv: I följande exempel läses den resulterande picklade datan. ::

source: Command-line interface
sv: Kommandoradsgränssnitt

source: The :mod:`pickle` module can be invoked as a script from the command line, it will display contents of the pickle files. However, when the pickle file that you want to examine comes from an untrusted source, ``-m pickletools`` is a safer option because it does not execute pickle bytecode, see :ref:`pickletools CLI usage <pickletools-cli>`.
sv: Modulen :mod:`pickle` kan anropas som ett skript från kommandoraden och visar innehållet i pickle-filerna. Men när pickle-filen som du vill undersöka kommer från en opålitlig källa är ``-m pickletools`` ett säkrare alternativ eftersom den inte exekverar pickle-bytekod, se :ref:`pickletools CLI usage <pickletools-cli>``.

source: The following option is accepted:
sv: Följande alternativ accepteras:

source: A pickle file to read, or ``-`` to indicate reading from standard input.
sv: En pickle-fil som ska läsas, eller ``-`` för att ange läsning från standardinmatning.

source: Module :mod:`copyreg`
sv: Modul :mod:`copyreg`

source: Pickle interface constructor registration for extension types.
sv: Registrering av Pickle-gränssnittskonstruktörer för tilläggstyper.

source: Module :mod:`pickletools`
sv: Modul :mod:`pickletools`

source: Tools for working with and analyzing pickled data.
sv: Verktyg för att arbeta med och analysera betade data.

source: Module :mod:`shelve`
sv: Modul :mod:`shelve`

source: Indexed databases of objects; uses :mod:`pickle`.
sv: Indexerade databaser med objekt; använder :mod:`pickle`.

source: Module :mod:`copy`
sv: Modul :mod:`copy`

source: Shallow and deep object copying.
sv: Kopiering av grunda och djupa objekt.

source: Module :mod:`marshal`
sv: Modul :mod:`marshal`

source: High-performance serialization of built-in types.
sv: Högpresterande serialisering av inbyggda typer.

source: Footnotes
sv: Fotnoter

source: Don't confuse this with the :mod:`marshal` module
sv: Förväxla inte detta med modulen :mod:`marshal`

source: This is why :keyword:`lambda` functions cannot be pickled: all :keyword:`!lambda` functions share the same name: ``<lambda>``.
sv: Det är därför som :keyword:`lambda` funktioner inte kan picklas: alla :keyword:`!lambda` funktioner har samma namn: ``<lambda>``.

source: The exception raised will likely be an :exc:`ImportError` or an :exc:`AttributeError` but it could be something else.
sv: Det undantag som tas upp kommer troligen att vara ett :exc:`ImportError` eller ett :exc:`AttributeError`, men det kan vara något annat.

source: The :mod:`copy` module uses this protocol for shallow and deep copying operations.
sv: Modulen :mod:`copy` använder detta protokoll för ytliga och djupa kopieringsoperationer.

source: The limitation on alphanumeric characters is due to the fact that persistent IDs in protocol 0 are delimited by the newline character. Therefore if any kind of newline characters occurs in persistent IDs, the resulting pickled data will become unreadable.
sv: Begränsningen av alfanumeriska tecken beror på att beständiga ID i protokoll 0 avgränsas av tecknet newline. Om det förekommer någon form av tecken för nya rader i beständiga ID:n blir därför de betade data som blir resultatet oläsliga.

source: persistence
sv: bestående

source: persistent
sv: ihållande

source: objects
sv: objekt

source: serializing
sv: serialisering

source: flattening
sv: tillplattning

source: pickling
sv: inläggning

source: External Data Representation
sv: Extern datarepresentation

source: copy
sv: kopiera

source: protocol
sv: protokoll

source: persistent_id (pickle protocol)
sv: persistent_id (pickle-protokoll)

source: persistent_load (pickle protocol)
sv: persistent_load (pickle-protokoll)

source: __getstate__() (copy protocol)
sv: __getstate__() (kopiera protokoll)

source: __setstate__() (copy protocol)
sv: __setstate__() (kopiera protokoll)

source: find_class() (pickle protocol)
sv: find_class() (pickle-protokoll)
