Repository: yeager/python-docs-sv
Catalog: library/posix.po
Languages: sv

source: :mod:`!posix` --- The most common POSIX system calls
sv: :mod:`!posix` --- De vanligaste POSIX-systemanropen

source: This module provides access to operating system functionality that is standardized by the C Standard and the POSIX standard (a thinly disguised Unix interface).
sv: Den här modulen ger tillgång till operativsystemets funktioner som standardiseras av C-standarden och POSIX-standarden (ett tunnt förklätt Unix-gränssnitt).

source: Availability
sv: Tillgänglighet

source: **Do not import this module directly.** Instead, import the module :mod:`os`, which provides a *portable* version of this interface. On Unix, the :mod:`os` module provides a superset of the :mod:`posix` interface. On non-Unix operating systems the :mod:`posix` module is not available, but a subset is always available through the :mod:`os` interface. Once :mod:`os` is imported, there is *no* performance penalty in using it instead of :mod:`posix`. In addition, :mod:`os` provides some additional functionality, such as automatically calling :func:`~os.putenv` when an entry in ``os.environ`` is changed.
sv: **Importera inte den här modulen direkt,** utan istället modulen :mod:`os`, som tillhandahåller en *portabel* version av det här gränssnittet. På Unix ger modulen :mod:`os` en överuppsättning av gränssnittet :mod:`posix`. På operativsystem som inte är Unix är modulen :mod:`posix` inte tillgänglig, men en delmängd är alltid tillgänglig via gränssnittet :mod:`os`. När :mod:`os` väl är importerad finns det *ingen* prestandaförlust med att använda den istället för :mod:`posix`. Dessutom ger :mod:`os` några ytterligare funktioner, som att automatiskt anropa :func:`~os.putenv` när en post i ``os.environ`` ändras.

source: Errors are reported as exceptions; the usual exceptions are given for type errors, while errors reported by the system calls raise :exc:`OSError`.
sv: Fel rapporteras som undantag; de vanliga undantagen ges för typfel, medan fel som rapporteras av systemanropen ger upphov till :exc:`OSError`.

source: Large File Support
sv: Stöd för stora filer

source: Several operating systems (including AIX and Solaris) provide support for files that are larger than 2 GiB from a C programming model where :c:expr:`int` and :c:expr:`long` are 32-bit values. This is typically accomplished by defining the relevant size and offset types as 64-bit values. Such files are sometimes referred to as :dfn:`large files`.
sv: Flera operativsystem (bland annat AIX och Solaris) ger stöd för filer som är större än 2 GiB från en C-programmeringsmodell där :c:expr:`int` och :c:expr:`long` är 32-bitarsvärden. Detta åstadkoms vanligen genom att definiera de relevanta storleks- och offset-typerna som 64-bitarsvärden. Sådana filer kallas ibland :dfn:`large files`.

source: Large file support is enabled in Python when the size of an :c:type:`off_t` is larger than a :c:expr:`long` and the :c:expr:`long long` is at least as large as an :c:type:`off_t`. It may be necessary to configure and compile Python with certain compiler flags to enable this mode. For example, with Solaris 2.6 and 2.7 you need to do something like::
sv: Stöd för stora filer aktiveras i Python när storleken på en :c:type:`off_t` är större än en :c:expr:`long` och :c:expr:`long long` är minst lika stor som en :c:type:`off_t`. Det kan vara nödvändigt att konfigurera och kompilera Python med vissa kompilatorflaggor för att aktivera det här läget. Med Solaris 2.6 och 2.7 måste du till exempel göra något i stil med::

source: CFLAGS="`getconf LFS_CFLAGS`" OPT="-g -O2 $CFLAGS" \ ./configure
sv: CFLAGS="`getconf LFS_CFLAGS`" OPT="-g -O2 $CFLAGS" \ ./konfigurera

source: On large-file-capable Linux systems, this might work::
sv: På Linux-system med stor filkapacitet kan detta fungera::

source: CFLAGS='-D_LARGEFILE64_SOURCE -D_FILE_OFFSET_BITS=64' OPT="-g -O2 $CFLAGS" \ ./configure
sv: CFLAGS='-D_LARGEFILE64_SOURCE -D_FILE_OFFSET_BITS=64' OPT="-g -O2 $CFLAGS" \ ./konfigurera

source: Notable Module Contents
sv: Anmärkningsvärt modulinnehåll

source: In addition to many functions described in the :mod:`os` module documentation, :mod:`posix` defines the following data item:
sv: Förutom de många funktioner som beskrivs i moduldokumentationen :mod:`os`, definierar :mod:`posix` följande dataelement:

source: A dictionary representing the string environment at the time the interpreter was started. Keys and values are bytes on Unix and str on Windows. For example, ``environ[b'HOME']`` (``environ['HOME']`` on Windows) is the pathname of your home directory, equivalent to ``getenv("HOME")`` in C.
sv: En ordbok som representerar strängmiljön vid den tidpunkt då tolken startades. Nycklar och värden är bytes på Unix och str på Windows. Till exempel är ``environ[b'HOME']`` (``environ['HOME']`` i Windows) sökvägen till din hemkatalog, motsvarande ``getenv("HOME")`` i C.

source: Modifying this dictionary does not affect the string environment passed on by :func:`~os.execv`, :func:`~os.popen` or :func:`~os.system`; if you need to change the environment, pass ``environ`` to :func:`~os.execve` or add variable assignments and export statements to the command string for :func:`~os.system` or :func:`~os.popen`.
sv: Om du ändrar den här ordlistan påverkar det inte den strängmiljö som skickas vidare av :func:`~os.execv`, :func:`~os.popen` eller :func:`~os.system`; om du behöver ändra miljön skickar du ``environ`` till :func:`~os.execve` eller lägger till variabeltilldelningar och exportsatser i kommandosträngen för :func:`~os.system` eller :func:`~os.popen`.

source: On Unix, keys and values are bytes.
sv: På Unix är nycklar och värden bytes.

source: The :mod:`os` module provides an alternate implementation of ``environ`` which updates the environment on modification. Note also that updating :data:`os.environ` will render this dictionary obsolete. Use of the :mod:`os` module version of this is recommended over direct access to the :mod:`posix` module.
sv: Modulen :mod:`os` tillhandahåller en alternativ implementation av ``environ`` som uppdaterar miljön vid modifiering. Observera också att uppdatering av :data:`os.environ` kommer att göra denna ordbok föråldrad. Användning av :mod:`os`-modulens version av denna rekommenderas framför direkt åtkomst till :mod:`posix`-modulen.

source: module
sv: modul

source: large files
sv: stora filer

source: file
sv: fil
