Repository: yeager/python-docs-sv
Catalog: library/profile.po
Languages: sv

source: This method for the :class:`Stats` class removes all leading path information from file names. It is very useful in reducing the size of the printout to fit within (close to) 80 columns. This method modifies the object, and the stripped information is lost. After performing a strip operation, the object is considered to have its entries in a "random" order, as it was just after object initialization and loading. If :meth:`~pstats.Stats.strip_dirs` causes two function names to be indistinguishable (they are on the same line of the same filename, and have the same function name), then the statistics for these two entries are accumulated into a single entry.
sv: Den här metoden för klassen :class:`Stats` tar bort all inledande sökvägsinformation från filnamn. Det är mycket användbart för att minska storleken på utskriften så att den ryms inom (nära) 80 kolumner. Den här metoden ändrar objektet och den borttagna informationen går förlorad. Efter att ha utfört en strippning anses objektet ha sina poster i en "slumpmässig" ordning, som den var precis efter initialisering och laddning av objektet. Om :meth:`~pstats.Stats.strip_dirs` gör att två funktionsnamn inte går att skilja åt (de står på samma rad i samma filnamn och har samma funktionsnamn), ackumuleras statistiken för dessa två poster till en enda post.

source: This method of the :class:`Stats` class accumulates additional profiling information into the current profiling object. Its arguments should refer to filenames created by the corresponding version of :func:`profile.run` or :func:`cProfile.run`. Statistics for identically named (re: file, line, name) functions are automatically accumulated into single function statistics.
sv: Denna metod i klassen :class:`Stats` ackumulerar ytterligare profileringsinformation i det aktuella profileringsobjektet. Dess argument bör referera till filnamn som skapats av motsvarande version av :func:`profile.run` eller :func:`cProfile.run`. Statistik för identiskt namngivna (re: fil, rad, namn) funktioner ackumuleras automatiskt till statistik för en enda funktion.

source: Save the data loaded into the :class:`Stats` object to a file named *filename*. The file is created if it does not exist, and is overwritten if it already exists. This is equivalent to the method of the same name on the :class:`profile.Profile` and :class:`cProfile.Profile` classes.
sv: Spara data som laddats i objektet :class:`Stats` till en fil med namnet *filnamn*. Filen skapas om den inte finns, och skrivs över om den redan finns. Detta är likvärdigt med metoden med samma namn i klasserna :class:`profile.Profile` och :class:`cProfile.Profile`.

source: This method modifies the :class:`Stats` object by sorting it according to the supplied criteria. The argument can be either a string or a SortKey enum identifying the basis of a sort (example: ``'time'``, ``'name'``, ``SortKey.TIME`` or ``SortKey.NAME``). The SortKey enums argument have advantage over the string argument in that it is more robust and less error prone.
sv: Denna metod modifierar :class:`Stats`-objektet genom att sortera det enligt de angivna kriterierna. Argumentet kan vara antingen en sträng eller ett SortKey-enum som identifierar grunden för en sortering (exempel: ``'time'``, ``'name'``, ``SortKey.TIME`` eller ``SortKey.NAME``). Argumentet SortKey enums har en fördel jämfört med strängargumentet genom att det är mer robust och mindre felbenäget.

source: When more than one key is provided, then additional keys are used as secondary criteria when there is equality in all keys selected before them. For example, ``sort_stats(SortKey.NAME, SortKey.FILE)`` will sort all the entries according to their function name, and resolve all ties (identical function names) by sorting by file name.
sv: När mer än en nyckel anges används ytterligare nycklar som sekundära kriterier när det råder likhet mellan alla nycklar som valts före dem. Exempelvis sorterar ``sort_stats(SortKey.NAME, SortKey.FILE)`` alla poster efter deras funktionsnamn och löser alla oavgjorda frågor (identiska funktionsnamn) genom att sortera efter filnamn.

source: For the string argument, abbreviations can be used for any key names, as long as the abbreviation is unambiguous.
sv: För strängargumentet kan förkortningar användas för alla nyckelnamn, så länge förkortningen är entydig.

source: The following are the valid string and SortKey:
sv: Följande är giltiga strängar och SortKey:

source: Valid String Arg
sv: Giltig sträng Arg

source: Valid enum Arg
sv: Giltig enum Arg

source: Meaning
sv: Betydelse

source: ``'calls'``
sv: ```samtal```

source: call count
sv: antal samtal

source: ``'cumulative'``
sv: ``'kumulativ'```

source: SortKey.CUMULATIVE
sv: SortKey.KUMULATIV

source: cumulative time
sv: kumulativ tid

source: ``'file'``
sv: ``'fil'```

source: file name
sv: filnamn

source: ``'filename'``
sv: ``'filnamn'```

source: ``'module'``
sv: ``'modul'```

source: SortKey.PCALLS
sv: Sorteringsnyckel.PCALLS

source: primitive call count
sv: antal primitiva samtal

source: ``'line'``
sv: ``'linje'```

source: SortKey.LINE
sv: Sorteringsnyckel.LINJE

source: line number
sv: radnummer

source: ``'name'``
sv: ``'namn'```

source: SortKey.NAME
sv: Sorteringsnyckel.namn

source: function name
sv: funktionsnamn

source: SortKey.NFL
sv: Sorteringsnyckel.NFL

source: name/file/line
sv: namn/fil/rad

source: standard name
sv: standardnamn

source: ``'time'``
sv: ``'tid'```

source: SortKey.TIME
sv: Sorteringsnyckel.TIME

source: internal time
sv: intern tid

source: Note that all sorts on statistics are in descending order (placing most time consuming items first), where as name, file, and line number searches are in ascending order (alphabetical). The subtle distinction between ``SortKey.NFL`` and ``SortKey.STDNAME`` is that the standard name is a sort of the name as printed, which means that the embedded line numbers get compared in an odd way. For example, lines 3, 20, and 40 would (if the file names were the same) appear in the string order 20, 3 and 40. In contrast, ``SortKey.NFL`` does a numeric compare of the line numbers. In fact, ``sort_stats(SortKey.NFL)`` is the same as ``sort_stats(SortKey.NAME, SortKey.FILENAME, SortKey.LINE)``.
sv: Observera att alla sorteringar av statistik är i fallande ordning (de mest tidskrävande först), medan sökningar efter namn, filer och radnummer är i stigande ordning (alfabetisk). Den subtila skillnaden mellan ``SortKey.NFL`` och ``SortKey.STDNAME`` är att standardnamnet är en sortering av namnet som det skrivs ut, vilket innebär att de inbäddade radnumren jämförs på ett udda sätt. Till exempel skulle raderna 3, 20 och 40 (om filnamnen var desamma) visas i strängordningen 20, 3 och 40. Däremot gör ``SortKey.NFL`` en numerisk jämförelse av radnumren. I själva verket är ``Sort_stats(SortKey.NFL)`` samma sak som ``Sort_stats(SortKey.NAME, SortKey.FILENAME, SortKey.LINE)``.

source: For backward-compatibility reasons, the numeric arguments ``-1``, ``0``, ``1``, and ``2`` are permitted. They are interpreted as ``'stdname'``, ``'calls'``, ``'time'``, and ``'cumulative'`` respectively. If this old style format (numeric) is used, only one sort key (the numeric key) will be used, and additional arguments will be silently ignored.
sv: Av bakåtkompatibilitetsskäl är de numeriska argumenten ``-1``, ``0``, ``1`` och ``2`` tillåtna. De tolkas som ``'stdname'``, ``'calls'``, ``'time'`` respektive ``'cumulative'``. Om detta gamla format (numeriskt) används, kommer endast en sorteringsnyckel (den numeriska nyckeln) att användas, och ytterligare argument kommer att ignoreras.

source: Added the SortKey enum.
sv: Enumret SortKey har lagts till.

source: This method for the :class:`Stats` class reverses the ordering of the basic list within the object. Note that by default ascending vs descending order is properly selected based on the sort key of choice.
sv: Denna metod för klassen :class:`Stats` reverserar ordningen på grundlistan i objektet. Observera att som standard väljs stigande eller fallande ordning korrekt baserat på den valda sorteringsnyckeln.

source: This method for the :class:`Stats` class prints out a report as described in the :func:`profile.run` definition.
sv: Denna metod för klassen :class:`Stats` skriver ut en rapport enligt beskrivningen i definitionen :func:`profile.run`.

source: The order of the printing is based on the last :meth:`~pstats.Stats.sort_stats` operation done on the object (subject to caveats in :meth:`~pstats.Stats.add` and :meth:`~pstats.Stats.strip_dirs`).
sv: Ordningen på utskriften baseras på den senaste :meth:`~pstats.Stats.sort_stats`-operationen som gjordes på objektet (med förbehåll för förbehåll i :meth:`~pstats.Stats.add` och :meth:`~pstats.Stats.strip_dirs`).

source: The arguments provided (if any) can be used to limit the list down to the significant entries. Initially, the list is taken to be the complete set of profiled functions. Each restriction is either an integer (to select a count of lines), or a decimal fraction between 0.0 and 1.0 inclusive (to select a percentage of lines), or a string that will interpreted as a regular expression (to pattern match the standard name that is printed). If several restrictions are provided, then they are applied sequentially. For example::
sv: De argument som anges (om sådana finns) kan användas för att begränsa listan till de viktigaste posterna. Inledningsvis antas listan vara den fullständiga uppsättningen profilerade funktioner. Varje begränsning är antingen ett heltal (för att välja ett antal rader), ett decimaltal mellan 0,0 och 1,0 (för att välja en procentandel av raderna) eller en sträng som tolkas som ett reguljärt uttryck (för att mönstermatcha det standardnamn som skrivs ut). Om flera begränsningar anges tillämpas de sekventiellt. Till exempel::

source: would first limit the printing to first 10% of list, and then only print functions that were part of filename :file:`.\*foo:`. In contrast, the command::
sv: skulle först begränsa utskriften till den första 10% of-listan och sedan bara skriva ut funktioner som ingick i filnamnet :file:`.\*foo:`. I motsats till detta skulle kommandot::

source: would limit the list to all functions having file names :file:`.\*foo:`, and then proceed to only print the first 10% of them.
sv: skulle begränsa listan till alla funktioner som har filnamnen :file:`.\*foo:`, och sedan bara skriva ut de första 10% of dem.

source: This method for the :class:`Stats` class prints a list of all functions that called each function in the profiled database. The ordering is identical to that provided by :meth:`~pstats.Stats.print_stats`, and the definition of the restricting argument is also identical. Each caller is reported on its own line. The format differs slightly depending on the profiler that produced the stats:
sv: Denna metod för klassen :class:`Stats` skriver ut en lista över alla funktioner som anropade varje funktion i den profilerade databasen. Ordningen är identisk med den som tillhandahålls av :meth:`~pstats.Stats.print_stats`, och definitionen av det begränsande argumentet är också identisk. Varje uppringare rapporteras på en egen rad. Formatet skiljer sig något beroende på vilken profilerare som producerade statistiken:

source: With :mod:`profile`, a number is shown in parentheses after each caller to show how many times this specific call was made. For convenience, a second non-parenthesized number repeats the cumulative time spent in the function at the right.
sv: Med :mod:`profile` visas ett tal inom parentes efter varje uppringare för att visa hur många gånger just detta uppringande gjordes. För enkelhetens skull upprepar en andra siffra utan parentes den sammanlagda tid som tillbringats i funktionen till höger.

source: With :mod:`cProfile`, each caller is preceded by three numbers: the number of times this specific call was made, and the total and cumulative times spent in the current function while it was invoked by this specific caller.
sv: Med :mod:`cProfile` föregås varje anrop av tre siffror: antalet gånger som det specifika anropet gjordes och den totala och kumulativa tid som spenderades i den aktuella funktionen när den anropades av den specifika anroparen.

source: This method for the :class:`Stats` class prints a list of all function that were called by the indicated function. Aside from this reversal of direction of calls (re: called vs was called by), the arguments and ordering are identical to the :meth:`~pstats.Stats.print_callers` method.
sv: Denna metod för klassen :class:`Stats` skriver ut en lista över alla funktioner som anropades av den angivna funktionen. Bortsett från denna omkastning av anropens riktning (re: called vs was called by) är argumenten och ordningen identiska med metoden :meth:`~pstats.Stats.print_callers`.

source: This method returns an instance of StatsProfile, which contains a mapping of function names to instances of FunctionProfile. Each FunctionProfile instance holds information related to the function's profile such as how long the function took to run, how many times it was called, etc...
sv: Denna metod returnerar en instans av StatsProfile, som innehåller en mappning av funktionsnamn till instanser av FunctionProfile. Varje FunctionProfile-instans innehåller information som är relaterad till funktionens profil, t.ex. hur lång tid det tog för funktionen att köras, hur många gånger den anropades osv.

source: Added the following dataclasses: StatsProfile, FunctionProfile. Added the following function: get_stats_profile.
sv: Lade till följande dataklasser: StatsProfile, FunctionProfile. Följande funktion lades till: get_stats_profile.

source: What Is Deterministic Profiling?
sv: Vad är deterministisk profilering?

source: :dfn:`Deterministic profiling` is meant to reflect the fact that all *function call*, *function return*, and *exception* events are monitored, and precise timings are made for the intervals between these events (during which time the user's code is executing). In contrast, :dfn:`statistical profiling` (which is not done by this module) randomly samples the effective instruction pointer, and deduces where time is being spent. The latter technique traditionally involves less overhead (as the code does not need to be instrumented), but provides only relative indications of where time is being spent.
sv: :dfn:`Deterministic profiling` är tänkt att återspegla det faktum att alla händelser av typen *funktionsanrop*, *funktionsretur* och *undantag* övervakas och att exakta tidsangivelser görs för intervallen mellan dessa händelser (under vilken tid användarens kod exekveras). Vid :dfn:`statistical profiling` (som inte görs av den här modulen) görs däremot slumpmässiga stickprov på den effektiva instruktionspekaren och man drar slutsatser om var tiden spenderas. Den senare tekniken innebär traditionellt mindre overhead (eftersom koden inte behöver instrumenteras), men ger bara relativa indikationer på var tiden spenderas.

source: In Python, since there is an interpreter active during execution, the presence of instrumented code is not required in order to do deterministic profiling. Python automatically provides a :dfn:`hook` (optional callback) for each event. In addition, the interpreted nature of Python tends to add so much overhead to execution, that deterministic profiling tends to only add small processing overhead in typical applications. The result is that deterministic profiling is not that expensive, yet provides extensive run time statistics about the execution of a Python program.
sv: I Python, eftersom det finns en tolk som är aktiv under exekveringen, krävs det inte att det finns instrumenterad kod för att göra en deterministisk profilering. Python tillhandahåller automatiskt en :dfn:`hook` (valfri callback) för varje händelse. Dessutom tenderar Pythons tolkade natur att lägga till så mycket overhead till exekveringen att deterministisk profilering tenderar att bara lägga till liten bearbetningsoverhead i typiska applikationer. Resultatet är att deterministisk profilering inte är särskilt dyr, men ändå ger omfattande körtidsstatistik om körningen av ett Python-program.

source: Call count statistics can be used to identify bugs in code (surprising counts), and to identify possible inline-expansion points (high call counts). Internal time statistics can be used to identify "hot loops" that should be carefully optimized. Cumulative time statistics should be used to identify high level errors in the selection of algorithms. Note that the unusual handling of cumulative times in this profiler allows statistics for recursive implementations of algorithms to be directly compared to iterative implementations.
sv: Statistik över antal anrop kan användas för att identifiera buggar i koden (överraskande antal anrop) och för att identifiera möjliga punkter för inline-expansion (högt antal anrop). Intern tidsstatistik kan användas för att identifiera "heta loopar" som bör optimeras noggrant. Kumulativ tidsstatistik bör användas för att identifiera högnivåfel i valet av algoritmer. Observera att den ovanliga hanteringen av kumulativa tider i den här profileraren gör att statistik för rekursiva implementeringar av algoritmer kan jämföras direkt med iterativa implementeringar.

source: Limitations
sv: Begränsningar

source: One limitation has to do with accuracy of timing information. There is a fundamental problem with deterministic profilers involving accuracy. The most obvious restriction is that the underlying "clock" is only ticking at a rate (typically) of about .001 seconds. Hence no measurements will be more accurate than the underlying clock. If enough measurements are taken, then the "error" will tend to average out. Unfortunately, removing this first error induces a second source of error.
sv: En begränsning har att göra med noggrannheten i tidsinformationen. Det finns ett grundläggande problem med deterministiska profilerare som rör noggrannhet. Den mest uppenbara begränsningen är att den underliggande "klockan" bara tickar med en hastighet (typiskt) på cirka 0,001 sekunder. Därför kommer inga mätningar att vara mer exakta än den underliggande klockan. Om tillräckligt många mätningar görs tenderar "felet" att jämna ut sig. Om man tar bort detta första fel uppstår tyvärr en andra felkälla.

source: The second problem is that it "takes a while" from when an event is dispatched until the profiler's call to get the time actually *gets* the state of the clock. Similarly, there is a certain lag when exiting the profiler event handler from the time that the clock's value was obtained (and then squirreled away), until the user's code is once again executing. As a result, functions that are called many times, or call many functions, will typically accumulate this error. The error that accumulates in this fashion is typically less than the accuracy of the clock (less than one clock tick), but it *can* accumulate and become very significant.
sv: Det andra problemet är att det "tar ett tag" från det att en händelse skickas till dess att profilerarens anrop för att få tiden faktiskt *får* klockans tillstånd. På samma sätt finns det en viss fördröjning när man lämnar profileringshändelsehanteraren från det att klockans värde erhölls (och sedan gömdes undan) tills användarens kod återigen körs. Därför kommer funktioner som anropas många gånger, eller som anropar många funktioner, vanligtvis att ackumulera detta fel. Felet som ackumuleras på detta sätt är vanligtvis mindre än klockans noggrannhet (mindre än ett klockslag), men det *kan* ackumuleras och bli mycket betydande.

source: The problem is more important with :mod:`profile` than with the lower-overhead :mod:`cProfile`. For this reason, :mod:`profile` provides a means of calibrating itself for a given platform so that this error can be probabilistically (on the average) removed. After the profiler is calibrated, it will be more accurate (in a least square sense), but it will sometimes produce negative numbers (when call counts are exceptionally low, and the gods of probability work against you :-). ) Do *not* be alarmed by negative numbers in the profile. They should *only* appear if you have calibrated your profiler, and the results are actually better than without calibration.
sv: Problemet är större med :mod:`profile` än med den mindre avancerade :mod:`cProfile`. Av denna anledning tillhandahåller :mod:`profile` ett sätt att kalibrera sig själv för en given plattform så att detta fel kan tas bort på ett probabilistiskt sätt (i genomsnitt). När profileraren har kalibrerats kommer den att vara mer exakt (i minsta kvadrat-led), men den kommer ibland att producera negativa siffror (när antalet anrop är exceptionellt lågt och sannolikhetens gudar arbetar emot dig :-). ) Låt dig *inte* skrämmas av negativa siffror i profilen. De ska *endast* visas om du har kalibrerat din profilerare och resultaten faktiskt är bättre än utan kalibrering.

source: Calibration
sv: Kalibrering

source: The profiler of the :mod:`profile` module subtracts a constant from each event handling time to compensate for the overhead of calling the time function, and socking away the results. By default, the constant is 0. The following procedure can be used to obtain a better constant for a given platform (see :ref:`profile-limitations`). ::
sv: Profileraren i modulen :mod:`profile` subtraherar en konstant från varje händelsehanteringstid för att kompensera för omkostnaderna för att anropa tidsfunktionen och lagra resultaten. Som standard är konstanten 0. Följande procedur kan användas för att få en bättre konstant för en viss plattform (se :ref:`profile-limitations`). ::

source: The method executes the number of Python calls given by the argument, directly and again under the profiler, measuring the time for both. It then computes the hidden overhead per profiler event, and returns that as a float. For example, on a 1.8Ghz Intel Core i5 running macOS, and using Python's time.process_time() as the timer, the magical number is about 4.04e-6.
sv: Metoden kör det antal Python-anrop som anges i argumentet, direkt och igen under profileraren, och mäter tiden för båda. Den beräknar sedan den dolda overhead per profileringshändelse och returnerar den som en float. Till exempel, på en 1,8 GHz Intel Core i5 som kör macOS och använder Pythons time.process_time() som timer, är det magiska talet cirka 4,04e-6.

source: The object of this exercise is to get a fairly consistent result. If your computer is *very* fast, or your timer function has poor resolution, you might have to pass 100000, or even 1000000, to get consistent results.
sv: Syftet med den här övningen är att få ett någorlunda konsekvent resultat. Om din dator är *mycket* snabb, eller om din timerfunktion har dålig upplösning, kan du behöva passera 100000, eller till och med 1000000, för att få konsekventa resultat.

source: When you have a consistent answer, there are three ways you can use it::
sv: När du har ett konsekvent svar kan du använda det på tre sätt::

source: import profile # 1. Apply computed bias to all Profile instances created hereafter. profile.Profile.bias = your_computed_bias # 2. Apply computed bias to a specific Profile instance. pr = profile.Profile() pr.bias = your_computed_bias # 3. Specify computed bias in instance constructor. pr = profile.Profile(bias=your_computed_bias)
sv: importprofil # 1. Tillämpa beräknad bias på alla profilinstanser som skapas hädanefter. profile.Profile.bias = din_beräknade_bias # 2. Tillämpa beräknad förspänning på en specifik profilinstans. pr = profile.Profile() pr.bias = din_beräknade_bias # 3. Ange beräknad förspänning i instansens konstruktör. pr = profile.Profile(bias=din_beräknade_bias)
