Repository: yeager/python-docs-sv
Catalog: library/profile.po
Languages: sv

source: If you have a choice, you are better off choosing a smaller constant, and then your results will "less often" show up as negative in profile statistics.
sv: Om du har ett val är det bättre att du väljer en mindre konstant, och då kommer dina resultat "mindre ofta" att visa sig vara negativa i profilstatistiken.

source: Using a custom timer
sv: Använda en anpassad timer

source: If you want to change how current time is determined (for example, to force use of wall-clock time or elapsed process time), pass the timing function you want to the :class:`Profile` class constructor::
sv: Om du vill ändra hur aktuell tid bestäms (t.ex. för att tvinga fram användning av väggklockans tid eller förfluten processtid), skickar du den tidsfunktion du vill ha till :class:`Profile`-klassens konstruktör::

source: pr = profile.Profile(your_time_func)
sv: pr = profil.Profil(din_tid_func)

source: The resulting profiler will then call ``your_time_func``. Depending on whether you are using :class:`profile.Profile` or :class:`cProfile.Profile`, ``your_time_func``'s return value will be interpreted differently:
sv: Den resulterande profileraren kommer sedan att anropa ``your_time_func``. Beroende på om du använder :class:`profile.Profile` eller :class:`cProfile.Profile`, kommer ``your_time_func``'s returvärde att tolkas på olika sätt:

source: ``your_time_func`` should return a single number, or a list of numbers whose sum is the current time (like what :func:`os.times` returns). If the function returns a single time number, or the list of returned numbers has length 2, then you will get an especially fast version of the dispatch routine.
sv: ``your_time_func`` bör returnera ett enda tal, eller en lista med tal vars summa är den aktuella tiden (som vad :func:`os.times` returnerar). Om funktionen returnerar ett enda tidsnummer, eller om listan med returnerade nummer har längden 2, får du en särskilt snabb version av sändningsrutinen.

source: Be warned that you should calibrate the profiler class for the timer function that you choose (see :ref:`profile-calibration`). For most machines, a timer that returns a lone integer value will provide the best results in terms of low overhead during profiling. (:func:`os.times` is *pretty* bad, as it returns a tuple of floating-point values). If you want to substitute a better timer in the cleanest fashion, derive a class and hardwire a replacement dispatch method that best handles your timer call, along with the appropriate calibration constant.
sv: Tänk på att du bör kalibrera profileringsklassen för den timerfunktion du väljer (se :ref:`profile-calibration`). För de flesta maskiner kommer en timer som returnerar ett ensamt heltalsvärde att ge de bästa resultaten när det gäller låg overhead under profileringen. (:func:`os.times` är *ganska* dålig, eftersom den returnerar en tupel av flyttalsvärden). Om du vill byta ut en bättre timer på det renaste sättet, härled en klass och hårdkoppla en ersättande dispatch-metod som bäst hanterar ditt timeranrop, tillsammans med lämplig kalibreringskonstant.

source: ``your_time_func`` should return a single number. If it returns integers, you can also invoke the class constructor with a second argument specifying the real duration of one unit of time. For example, if ``your_integer_time_func`` returns times measured in thousands of seconds, you would construct the :class:`Profile` instance as follows::
sv: ``your_time_func`` bör returnera ett enda tal. Om den returnerar heltal kan du också anropa klasskonstruktören med ett andra argument som anger den verkliga varaktigheten för en tidsenhet. Om till exempel ``your_integer_time_func`` returnerar tider som mäts i tusentals sekunder, skulle du konstruera :class:`Profile`-instansen på följande sätt::

source: pr = cProfile.Profile(your_integer_time_func, 0.001)
sv: pr = cProfile.Profile(din_integer_tid_func, 0,001)

source: As the :class:`cProfile.Profile` class cannot be calibrated, custom timer functions should be used with care and should be as fast as possible. For the best results with a custom timer, it might be necessary to hard-code it in the C source of the internal :mod:`!_lsprof` module.
sv: Eftersom klassen :class:`cProfile.Profile` inte kan kalibreras, bör anpassade timerfunktioner användas med försiktighet och vara så snabba som möjligt. För bästa resultat med en egen timer kan det vara nödvändigt att hårdkoda den i C-källan för den interna :mod:`!_lsprof`-modulen.

source: Python 3.3 adds several new functions in :mod:`time` that can be used to make precise measurements of process or wall-clock time. For example, see :func:`time.perf_counter`.
sv: Python 3.3 lägger till flera nya funktioner i :mod:`time` som kan användas för att göra exakta mätningar av process- eller väggklocktid. Se till exempel :func:`time.perf_counter`.

source: deterministic profiling
sv: deterministisk profilering

source: profiling, deterministic
sv: profilering, deterministisk
