Repository: yeager/python-docs-sv
Catalog: library/profile.po
Languages: sv

source: The Python Profilers
sv: Python-profiler

source: **Source code:** :source:`Lib/profile.py` and :source:`Lib/pstats.py`
sv: **Källkod:** :source:`Lib/profile.py` och :source:`Lib/pstats.py`

source: Introduction to the profilers
sv: Introduktion till profileringsverktygen

source: :mod:`cProfile` and :mod:`profile` provide :dfn:`deterministic profiling` of Python programs. A :dfn:`profile` is a set of statistics that describes how often and for how long various parts of the program executed. These statistics can be formatted into reports via the :mod:`pstats` module.
sv: :mod:`cProfile` och :mod:`profile` ger :dfn:`deterministisk profilering` av Python-program. En :dfn:`profile` är en uppsättning statistik som beskriver hur ofta och hur länge olika delar av programmet kördes. Denna statistik kan formateras till rapporter via modulen :mod:`pstats`.

source: The Python standard library provides two different implementations of the same profiling interface:
sv: Pythons standardbibliotek tillhandahåller två olika implementeringar av samma profileringsgränssnitt:

source: :mod:`cProfile` is recommended for most users; it's a C extension with reasonable overhead that makes it suitable for profiling long-running programs. Based on :mod:`lsprof`, contributed by Brett Rosen and Ted Czotter.
sv: :mod:`cProfile` rekommenderas för de flesta användare; det är ett C-tillägg med rimlig overhead som gör det lämpligt för profilering av långkörande program. Baserat på :mod:`lsprof`, med bidrag från Brett Rosen och Ted Czotter.

source: :mod:`profile`, a pure Python module whose interface is imitated by :mod:`cProfile`, but which adds significant overhead to profiled programs. If you're trying to extend the profiler in some way, the task might be easier with this module. Originally designed and written by Jim Roskind.
sv: :mod:`profile`, en ren Python-modul vars gränssnitt imiteras av :mod:`cProfile`, men som lägger till betydande overhead till profilerade program. Om du försöker utöka profileraren på något sätt kan uppgiften vara enklare med den här modulen. Ursprungligen designad och skriven av Jim Roskind.

source: The profiler modules are designed to provide an execution profile for a given program, not for benchmarking purposes (for that, there is :mod:`timeit` for reasonably accurate results). This particularly applies to benchmarking Python code against C code: the profilers introduce overhead for Python code, but not for C-level functions, and so the C code would seem faster than any Python one.
sv: Profilermodulerna är utformade för att ge en exekveringsprofil för ett visst program, inte för benchmarking (för det finns :mod:`timeit` för rimligt exakta resultat). Detta gäller särskilt för benchmarking av Python-kod mot C-kod: profilerarna introducerar overhead för Python-kod, men inte för funktioner på C-nivå, och därför skulle C-koden verka snabbare än någon Python-kod.

source: Instant User's Manual
sv: Användarmanual för Instant

source: This section is provided for users that "don't want to read the manual." It provides a very brief overview, and allows a user to rapidly perform profiling on an existing application.
sv: Det här avsnittet är avsett för användare som "inte vill läsa manualen" Det ger en mycket kort översikt och gör det möjligt för en användare att snabbt utföra profilering på en befintlig applikation.

source: To profile a function that takes a single argument, you can do::
sv: För att profilera en funktion som tar ett enda argument kan du göra så här::

source: (Use :mod:`profile` instead of :mod:`cProfile` if the latter is not available on your system.)
sv: (Använd :mod:`profile` i stället för :mod:`cProfile` om den senare inte finns tillgänglig i ditt system)

source: The above action would run :func:`re.compile` and print profile results like the following::
sv: Ovanstående åtgärd skulle köra :func:`re.compile` och skriva ut profilresultat som följande::

source: 214 function calls (207 primitive calls) in 0.002 seconds Ordered by: cumulative time ncalls tottime percall cumtime percall filename:lineno(function) 1 0.000 0.000 0.002 0.002 {built-in method builtins.exec} 1 0.000 0.000 0.001 0.001 <string>:1(<module>) 1 0.000 0.000 0.001 0.001 __init__.py:250(compile) 1 0.000 0.000 0.001 0.001 __init__.py:289(_compile) 1 0.000 0.000 0.000 0.000 _compiler.py:759(compile) 1 0.000 0.000 0.000 0.000 _parser.py:937(parse) 1 0.000 0.000 0.000 0.000 _compiler.py:598(_code) 1 0.000 0.000 0.000 0.000 _parser.py:435(_parse_sub)
sv: 214 funktionsanrop (207 primitiva anrop) på 0,002 sekunder Ordnad efter: kumulativ tid ncalls tottime percall cumtime percall filnamn:lineno(funktion) 1 0,000 0,000 0,002 0,002 {inbyggd metod builtins.exec} 1 0,000 0,000 0,001 0,001 <string>:1(<module>) 1 0,000 0,000 0,001 0,001 __init__.py:250(kompilera) 1 0,000 0,000 0,001 0,001 __init__.py:289(_kompilering) 1 0,000 0,000 0,000 0,000 _compiler.py:759(kompilera) 1 0,000 0,000 0,000 0,000 _parser.py:937(parse) 1 0,000 0,000 0,000 0,000 _compiler.py:598(_code) 1 0,000 0,000 0,000 0,000 0,000 _parser.py:435(_parse_sub)

source: The first line indicates that 214 calls were monitored. Of those calls, 207 were :dfn:`primitive`, meaning that the call was not induced via recursion. The next line: ``Ordered by: cumulative time`` indicates the output is sorted by the ``cumtime`` values. The column headings include:
sv: Den första raden visar att 214 anrop övervakades. Av dessa anrop var 207 :dfn:`primitive`, vilket betyder att anropet inte inducerades via rekursion. Nästa rad: ``Ordered by: cumulative time`` anger att utdata är sorterade efter ``cumtime``-värdena. Kolumnrubrikerna inkluderar:

source: for the number of calls.
sv: för antalet samtal.

source: tottime
sv: tottid

source: for the total time spent in the given function (and excluding time made in calls to sub-functions)
sv: för den totala tid som tillbringats i den givna funktionen (och exklusive tid för anrop till underfunktioner)

source: percall
sv: per telefon

source: is the quotient of ``tottime`` divided by ``ncalls``
sv: är kvoten av ``tottime`` dividerat med ``ncalls``

source: is the cumulative time spent in this and all subfunctions (from invocation till exit). This figure is accurate *even* for recursive functions.
sv: är den ackumulerade tid som använts i denna och alla underfunktioner (från anrop till avslut). Denna siffra är korrekt *även* för rekursiva funktioner.

source: is the quotient of ``cumtime`` divided by primitive calls
sv: är kvoten av ``cumtime`` dividerat med primitiva anrop

source: filename:lineno(function)
sv: filnamn:lineno(funktion)

source: provides the respective data of each function
sv: tillhandahåller respektive data för varje funktion

source: When there are two numbers in the first column (for example ``3/1``), it means that the function recursed. The second value is the number of primitive calls and the former is the total number of calls. Note that when the function does not recurse, these two values are the same, and only the single figure is printed.
sv: När det finns två siffror i den första kolumnen (t.ex. ``3/1``) betyder det att funktionen recursade. Det andra värdet är antalet primitiva anrop och det första är det totala antalet anrop. Observera att när funktionen inte recurserar är dessa två värden desamma och endast den enda siffran skrivs ut.

source: Instead of printing the output at the end of the profile run, you can save the results to a file by specifying a filename to the :func:`run` function::
sv: I stället för att skriva ut resultatet i slutet av profilkörningen kan du spara resultatet i en fil genom att ange ett filnamn i funktionen :func:`run`::

source: The :class:`pstats.Stats` class reads profile results from a file and formats them in various ways.
sv: Klassen :class:`pstats.Stats` läser in profilresultat från en fil och formaterar dem på olika sätt.

source: The files :mod:`cProfile` and :mod:`profile` can also be invoked as a script to profile another script. For example::
sv: Filerna :mod:`cProfile` och :mod:`profile` kan också användas som ett skript för att profilera ett annat skript. Till exempel::

source: python -m cProfile [-o output_file] [-s sort_order] (-m module | myscript.py)
sv: python -m cProfile [-o output_file] [-s sort_order] (-m modul | myscript.py)

source: Writes the profile results to a file instead of to stdout.
sv: Skriver profilresultaten till en fil i stället för till stdout.

source: Specifies one of the :func:`~pstats.Stats.sort_stats` sort values to sort the output by. This only applies when :option:`-o <cProfile -o>` is not supplied.
sv: Anger ett av sorteringsvärdena i :func:`~pstats.Stats.sort_stats` för att sortera utdata efter. Detta gäller endast när :option:`-o <cProfile -o>` inte anges.

source: Specifies that a module is being profiled instead of a script.
sv: Anger att det är en modul som profileras i stället för ett skript.

source: Added the ``-m`` option to :mod:`cProfile`.
sv: Alternativet ``-m`` lades till i :mod:`cProfile`.

source: Added the ``-m`` option to :mod:`profile`.
sv: Alternativet ``-m`` lades till i :mod:`profile`.

source: The :mod:`pstats` module's :class:`~pstats.Stats` class has a variety of methods for manipulating and printing the data saved into a profile results file::
sv: Modulen :mod:`pstats` klass :class:`~pstats.Stats` har en mängd olika metoder för att manipulera och skriva ut data som sparats i en profilresultatfil::

source: The :meth:`~pstats.Stats.strip_dirs` method removed the extraneous path from all the module names. The :meth:`~pstats.Stats.sort_stats` method sorted all the entries according to the standard module/line/name string that is printed. The :meth:`~pstats.Stats.print_stats` method printed out all the statistics. You might try the following sort calls::
sv: Metoden :meth:`~pstats.Stats.strip_dirs` tog bort den främmande sökvägen från alla modulnamn. Metoden :meth:`~pstats.Stats.sort_stats` sorterade alla poster enligt den standardsträng för modul/rad/namn som skrivs ut. Metoden :meth:`~pstats.Stats.print_stats` skrev ut all statistik. Du kan prova följande sorteringsanrop::

source: The first call will actually sort the list by function name, and the second call will print out the statistics. The following are some interesting calls to experiment with::
sv: Det första anropet sorterar faktiskt listan efter funktionsnamn och det andra anropet skriver ut statistiken. Följande är några intressanta anrop att experimentera med::

source: This sorts the profile by cumulative time in a function, and then only prints the ten most significant lines. If you want to understand what algorithms are taking time, the above line is what you would use.
sv: Detta sorterar profilen efter kumulativ tid i en funktion och skriver sedan bara ut de tio mest betydelsefulla raderna. Om du vill förstå vilka algoritmer som tar tid är det raden ovan som du ska använda.

source: If you were looking to see what functions were looping a lot, and taking a lot of time, you would do::
sv: Om du ville se vilka funktioner som loopade mycket och tog mycket tid, skulle du göra::

source: to sort according to time spent within each function, and then print the statistics for the top ten functions.
sv: för att sortera efter tidsåtgång inom varje funktion och sedan skriva ut statistiken för de tio bästa funktionerna.

source: You might also try::
sv: Du kan också prova::

source: This will sort all the statistics by file name, and then print out statistics for only the class init methods (since they are spelled with ``__init__`` in them). As one final example, you could try::
sv: Detta sorterar all statistik efter filnamn och skriver sedan ut statistik för endast klassens init-metoder (eftersom de stavas med ``__init__`` i sig). Som ett sista exempel kan du prova::

source: This line sorts statistics with a primary key of time, and a secondary key of cumulative time, and then prints out some of the statistics. To be specific, the list is first culled down to 50% (re: ``.5``) of its original size, then only lines containing ``init`` are maintained, and that sub-sub-list is printed.
sv: Denna rad sorterar statistik med en primär nyckel för tid och en sekundär nyckel för kumulativ tid, och skriver sedan ut en del av statistiken. För att vara specifik, gallras listan först ner till 50% (re: ``.5``) av sin ursprungliga storlek, sedan behålls endast rader som innehåller ``init``, och den under-sub-listan skrivs ut.

source: If you wondered what functions called the above functions, you could now (``p`` is still sorted according to the last criteria) do::
sv: Om du undrade vilka funktioner som kallade ovanstående funktioner, kan du nu (``p`` är fortfarande sorterad enligt det sista kriteriet) göra::

source: and you would get a list of callers for each of the listed functions.
sv: och du får en lista över personer som ringer för var och en av de listade funktionerna.

source: If you want more functionality, you're going to have to read the manual, or guess what the following functions do::
sv: Om du vill ha fler funktioner måste du läsa manualen eller gissa vad följande funktioner gör::

source: Invoked as a script, the :mod:`pstats` module is a statistics browser for reading and examining profile dumps. It has a simple line-oriented interface (implemented using :mod:`cmd`) and interactive help.
sv: Modulen :mod:`pstats` anropas som ett skript och är en statistikbläddrare för läsning och granskning av profildumpar. Den har ett enkelt linjeorienterat gränssnitt (implementerat med hjälp av :mod:`cmd`) och interaktiv hjälp.

source: :mod:`profile` and :mod:`cProfile` Module Reference
sv: :mod:`profile` och :mod:`cProfile` Modulreferens

source: Both the :mod:`profile` and :mod:`cProfile` modules provide the following functions:
sv: Både modulerna :mod:`profile` och :mod:`cProfile` innehåller följande funktioner:

source: This function takes a single argument that can be passed to the :func:`exec` function, and an optional file name. In all cases this routine executes::
sv: Denna funktion tar ett enda argument som kan skickas till :func:`exec`-funktionen, och ett valfritt filnamn. I samtliga fall exekveras denna rutin::

source: exec(command, __main__.__dict__, __main__.__dict__)
sv: exec(kommando, __main__.__dict__, __main__.__dict__)

source: and gathers profiling statistics from the execution. If no file name is present, then this function automatically creates a :class:`~pstats.Stats` instance and prints a simple profiling report. If the sort value is specified, it is passed to this :class:`~pstats.Stats` instance to control how the results are sorted.
sv: och samlar in profileringsstatistik från körningen. Om det inte finns något filnamn skapar funktionen automatiskt en :class:`~pstats.Stats`-instans och skriver ut en enkel profileringsrapport. Om sorteringsvärdet anges skickas det till denna :class:`~pstats.Stats`-instans för att styra hur resultaten ska sorteras.

source: This function is similar to :func:`run`, with added arguments to supply the globals and locals mappings for the *command* string. This routine executes::
sv: Den här funktionen liknar :func:`run`, med extra argument för att ange mappningarna för globals och locals för *command*-strängen. Den här rutinen exekverar::

source: exec(command, globals, locals)
sv: exec(kommando, globals, locals)

source: and gathers profiling statistics as in the :func:`run` function above.
sv: och samlar in profileringsstatistik som i funktionen :func:`run` ovan.

source: This class is normally only used if more precise control over profiling is needed than what the :func:`cProfile.run` function provides.
sv: Den här klassen används normalt bara om det behövs mer exakt kontroll över profileringen än vad funktionen :func:`cProfile.run` ger.

source: A custom timer can be supplied for measuring how long code takes to run via the *timer* argument. This must be a function that returns a single number representing the current time. If the number is an integer, the *timeunit* specifies a multiplier that specifies the duration of each unit of time. For example, if the timer returns times measured in thousands of seconds, the time unit would be ``.001``.
sv: En egen timer kan tillhandahållas för att mäta hur lång tid det tar för koden att köras via argumentet *timer*. Detta måste vara en funktion som returnerar ett enda tal som representerar den aktuella tiden. Om talet är ett heltal anger *timeunit* en multiplikator som anger varaktigheten för varje tidsenhet. Om timern t.ex. returnerar tider som mäts i tusendelar av sekunder, är tidsenheten ``.001``.

source: Directly using the :class:`Profile` class allows formatting profile results without writing the profile data to a file::
sv: Genom att direkt använda klassen :class:`Profile` kan du formatera profilresultat utan att skriva profildata till en fil::

source: import cProfile, pstats, io from pstats import SortKey pr = cProfile.Profile() pr.enable() # ... do something ... pr.disable() s = io.StringIO() sortby = SortKey.CUMULATIVE ps = pstats.Stats(pr, stream=s).sort_stats(sortby) ps.print_stats() print(s.getvalue())
sv: import cProfile, pstats, io från pstats import SortKey pr = cProfile.profil() pr.enable() # ... gör något ... pr.disable() s = io.StringIO() sortby = SortKey.CUMULATIVE ps = pstats.Stats(pr, stream=s).sort_stats(sortby) ps.print_stats() print(s.getvalue())

source: The :class:`Profile` class can also be used as a context manager (supported only in :mod:`cProfile` module. see :ref:`typecontextmanager`)::
sv: Klassen :class:`Profile` kan också användas som en kontexthanterare (stöds endast i modulen :mod:`cProfile`. se :ref:`typecontextmanager`)::

source: import cProfile with cProfile.Profile() as pr: # ... do something ... pr.print_stats()
sv: import cProfile med cProfile.Profile() som pr: # ... gör något ... pr.print_stats()

source: Added context manager support.
sv: Stöd för kontexthanterare har lagts till.

source: Start collecting profiling data. Only in :mod:`cProfile`.
sv: Börja samla in profileringsdata. Endast i :mod:`cProfile`.

source: Stop collecting profiling data. Only in :mod:`cProfile`.
sv: Sluta samla in profileringsdata. Endast i :mod:`cProfile`.

source: Stop collecting profiling data and record the results internally as the current profile.
sv: Sluta samla in profileringsdata och registrera resultaten internt som den aktuella profilen.

source: Create a :class:`~pstats.Stats` object based on the current profile and print the results to stdout.
sv: Skapa ett :class:`~pstats.Stats`-objekt baserat på den aktuella profilen och skriv ut resultaten till stdout.

source: The *sort* parameter specifies the sorting order of the displayed statistics. It accepts a single key or a tuple of keys to enable multi-level sorting, as in :func:`Stats.sort_stats <pstats.Stats.sort_stats>`.
sv: Parametern *sort* anger sorteringsordningen för den statistik som visas. Den accepterar en enda nyckel eller en tupel av nycklar för att möjliggöra sortering på flera nivåer, som i :func:`Stats.sort_stats <pstats.Stats.sort_stats>`.

source: :meth:`~Profile.print_stats` now accepts a tuple of keys.
sv: :meth:`~Profile.print_stats` accepterar nu en tupel av nycklar.

source: Write the results of the current profile to *filename*.
sv: Skriv resultatet av den aktuella profilen till *filnamn*.

source: Profile the cmd via :func:`exec`.
sv: Profilera cmd:n via :func:`exec`.

source: Profile the cmd via :func:`exec` with the specified global and local environment.
sv: Profilera cmd via :func:`exec` med den angivna globala och lokala miljön.

source: Profile ``func(*args, **kwargs)``
sv: Profil ``func(*args, **kwargs)``

source: Note that profiling will only work if the called command/function actually returns. If the interpreter is terminated (e.g. via a :func:`sys.exit` call during the called command/function execution) no profiling results will be printed.
sv: Observera att profileringen endast fungerar om det anropade kommandot/funktionen faktiskt returneras. Om tolken avslutas (t.ex. via ett :func:`sys.exit`-anrop under exekveringen av det anropade kommandot/funktionen) kommer inga profileringsresultat att skrivas ut.

source: The :class:`Stats` Class
sv: Klassen :class:`Stats

source: Analysis of the profiler data is done using the :class:`~pstats.Stats` class.
sv: Analys av profileringsdata görs med hjälp av klassen :class:`~pstats.Stats`.

source: This class constructor creates an instance of a "statistics object" from a *filename* (or list of filenames) or from a :class:`Profile` instance. Output will be printed to the stream specified by *stream*.
sv: Denna klasskonstruktor skapar en instans av ett "statistikobjekt" från ett *filnamn* (eller en lista med filnamn) eller från en :class:`Profile`-instans. Utdata kommer att skrivas ut till den ström som anges av *stream*.

source: The file selected by the above constructor must have been created by the corresponding version of :mod:`profile` or :mod:`cProfile`. To be specific, there is *no* file compatibility guaranteed with future versions of this profiler, and there is no compatibility with files produced by other profilers, or the same profiler run on a different operating system. If several files are provided, all the statistics for identical functions will be coalesced, so that an overall view of several processes can be considered in a single report. If additional files need to be combined with data in an existing :class:`~pstats.Stats` object, the :meth:`~pstats.Stats.add` method can be used.
sv: Den fil som väljs av ovanstående konstruktör måste ha skapats av motsvarande version av :mod:`profile` eller :mod:`cProfile`. För att vara specifik, det finns *ingen* garanterad filkompatibilitet med framtida versioner av denna profilerare, och det finns ingen kompatibilitet med filer som producerats av andra profilerare, eller samma profilerare som körs på ett annat operativsystem. Om flera filer tillhandahålls kommer all statistik för identiska funktioner att sammanställas, så att en övergripande bild av flera processer kan beaktas i en enda rapport. Om ytterligare filer behöver kombineras med data i ett befintligt :class:`~pstats.Stats`-objekt, kan metoden :meth:`~pstats.Stats.add` användas.

source: Instead of reading the profile data from a file, a :class:`cProfile.Profile` or :class:`profile.Profile` object can be used as the profile data source.
sv: I stället för att läsa profildata från en fil kan ett :class:`cProfile.Profile`- eller :class:`profile.Profile`-objekt användas som profildatakälla.

source: :class:`Stats` objects have the following methods:
sv: :class:`Stats`-objekt har följande metoder:
