Repository: yeager/python-docs-sv
Catalog: library/pty.po
Languages: sv

source: :mod:`!pty` --- Pseudo-terminal utilities
sv: :mod:`!pty` --- Verktyg för pseudoterminal

source: **Source code:** :source:`Lib/pty.py`
sv: **Källkod:** :source:`Lib/pty.py`

source: The :mod:`pty` module defines operations for handling the pseudo-terminal concept: starting another process and being able to write to and read from its controlling terminal programmatically.
sv: Modulen :mod:`pty` definierar operationer för hantering av pseudoterminalbegreppet: att starta en annan process och kunna skriva till och läsa från dess kontrollterminal programmatiskt.

source: Availability
sv: Tillgänglighet

source: Pseudo-terminal handling is highly platform dependent. This code is mainly tested on Linux, FreeBSD, and macOS (it is supposed to work on other POSIX platforms but it's not been thoroughly tested).
sv: Hanteringen av pseudoterminaler är i hög grad plattformsberoende. Den här koden är huvudsakligen testad på Linux, FreeBSD och macOS (den ska fungera på andra POSIX-plattformar men har inte testats grundligt).

source: The :mod:`pty` module defines the following functions:
sv: Modulen :mod:`pty` definierar följande funktioner:

source: Fork. Connect the child's controlling terminal to a pseudo-terminal. Return value is ``(pid, fd)``. Note that the child gets *pid* 0, and the *fd* is *invalid*. The parent's return value is the *pid* of the child, and *fd* is a file descriptor connected to the child's controlling terminal (and also to the child's standard input and output).
sv: Fork. Anslut underliggande kontrollterminal till en pseudoterminal. Returvärdet är ``(pid, fd)``. Observera att barnet får *pid* 0 och att *fd* är *invalid*. Förälderns returvärde är barnets *pid* och *fd* är en filbeskrivare som är ansluten till barnets kontrollterminal (och även till barnets standardinmatning och -utmatning).

source: On macOS the use of this function is unsafe when mixed with using higher-level system APIs, and that includes using :mod:`urllib.request`.
sv: På macOS är användningen av denna funktion osäker när den blandas med användning av system-API:er på högre nivå, och det inkluderar användning av :mod:`urllib.request`.

source: Open a new pseudo-terminal pair, using :func:`os.openpty` if possible, or emulation code for generic Unix systems. Return a pair of file descriptors ``(master, slave)``, for the master and the slave end, respectively.
sv: Öppna ett nytt pseudoterminalpar, med :func:`os.openpty` om möjligt, eller emuleringskod för generiska Unix-system. Returnera ett par filbeskrivare ``(master, slave)``, för master- respektive slave-änden.

source: Spawn a process, and connect its controlling terminal with the current process's standard io. This is often used to baffle programs which insist on reading from the controlling terminal. It is expected that the process spawned behind the pty will eventually terminate, and when it does *spawn* will return.
sv: Starta en process och anslut dess kontrollterminal till den aktuella processens standard io. Detta används ofta för att förvirra program som insisterar på att läsa från den kontrollerande terminalen. Det förväntas att processen som startas bakom pty så småningom kommer att avslutas, och när den gör det kommer *spawn* att returneras.

source: A loop copies STDIN of the current process to the child and data received from the child to STDOUT of the current process. It is not signaled to the child if STDIN of the current process closes down.
sv: En loop kopierar STDIN i den aktuella processen till barnet och data som tas emot från barnet till STDOUT i den aktuella processen. Det signaleras inte till barnet om STDIN i den aktuella processen stängs ned.

source: The functions *master_read* and *stdin_read* are passed a file descriptor which they should read from, and they should always return a byte string. In order to force spawn to return before the child process exits an empty byte array should be returned to signal end of file.
sv: Funktionerna *master_read* och *stdin_read* får en filbeskrivare som de ska läsa från och de ska alltid returnera en byte-sträng. För att tvinga spawn att returnera innan barnprocessen avslutas bör en tom bytearray returneras för att signalera slutet på filen.

source: The default implementation for both functions will read and return up to 1024 bytes each time the function is called. The *master_read* callback is passed the pseudoterminal’s master file descriptor to read output from the child process, and *stdin_read* is passed file descriptor 0, to read from the parent process's standard input.
sv: Standardimplementeringen för båda funktionerna läser och returnerar upp till 1024 byte varje gång funktionen anropas. Återuppringningen *master_read* får pseudoterminalens master file descriptor för att läsa utdata från barnprocessen, och *stdin_read* får file descriptor 0 för att läsa från den överordnade processens standardinmatning.

source: Returning an empty byte string from either callback is interpreted as an end-of-file (EOF) condition, and that callback will not be called after that. If *stdin_read* signals EOF the controlling terminal can no longer communicate with the parent process OR the child process. Unless the child process will quit without any input, *spawn* will then loop forever. If *master_read* signals EOF the same behavior results (on linux at least).
sv: Om en tom bytesträng returneras från något av återuppringningsprogrammen tolkas det som ett EOF-villkor (end-of-file) och det återuppringningsprogrammet kommer inte att anropas efter det. Om *stdin_read* signalerar EOF kan den kontrollerande terminalen inte längre kommunicera med moderprocessen eller barnprocessen. Om inte barnprocessen kommer att avslutas utan någon indata kommer *spawn* att loopa för evigt. Om *master_read* signalerar EOF blir resultatet detsamma (åtminstone på Linux).

source: Return the exit status value from :func:`os.waitpid` on the child process.
sv: Returnerar utgångsstatusvärdet från :func:`os.waitpid` på underordnad process.

source: :func:`os.waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
sv: :func:`os.waitstatus_to_exitcode` kan användas för att konvertera utgångsstatus till en utgångskod.

source: Raises an :ref:`auditing event <auditing>` ``pty.spawn`` with argument ``argv``.
sv: Utlöser en :ref:`auditing event <auditing>` ``pty.spawn`` med argumentet ``argv``.

source: :func:`spawn` now returns the status value from :func:`os.waitpid` on the child process.
sv: :func:`spawn` returnerar nu statusvärdet från :func:`os.waitpid` på barnprocessen.

source: Example
sv: Exempel

source: The following program acts like the Unix command :manpage:`script(1)`, using a pseudo-terminal to record all input and output of a terminal session in a "typescript". ::
sv: Följande program fungerar som Unix-kommandot :manpage:`script(1)` och använder en pseudoterminal för att registrera alla in- och utdata i en terminalsession i ett "typescript". ::
