Repository: yeager/python-docs-sv
Catalog: library/pwd.po
Languages: sv

source: :mod:`!pwd` --- The password database
sv: :mod:`!pwd` --- Lösenordsdatabasen

source: This module provides access to the Unix user account and password database. It is available on all Unix versions.
sv: Den här modulen ger tillgång till Unix databas för användarkonton och lösenord. Den är tillgänglig på alla Unix-versioner.

source: Availability
sv: Tillgänglighet

source: Password database entries are reported as a tuple-like object, whose attributes correspond to the members of the ``passwd`` structure (Attribute field below, see ``<pwd.h>``):
sv: Lösenordsdatabasposter rapporteras som ett tupelliknande objekt, vars attribut motsvarar medlemmarna i strukturen ``passwd`` (Attributfält nedan, se ``<pwd.h>``):

source: Attribute
sv: Attribut

source: Meaning
sv: Betydelse

source: ``pw_name``
sv: ``pw_namn``

source: Login name
sv: Inloggningsnamn

source: Optional encrypted password
sv: Valfritt krypterat lösenord

source: Numerical user ID
sv: Numeriskt användar-ID

source: Numerical group ID
sv: Numeriskt grupp-ID

source: User name or comment field
sv: Användarnamn eller kommentarsfält

source: User home directory
sv: Användarens hemkatalog

source: User command interpreter
sv: Tolk för användarkommandon

source: The uid and gid items are integers, all others are strings. :exc:`KeyError` is raised if the entry asked for cannot be found.
sv: Posterna uid och gid är heltal, alla andra är strängar. :exc:`KeyError` uppstår om den post som efterfrågas inte kan hittas.

source: In traditional Unix the field ``pw_passwd`` usually contains a password encrypted with a DES derived algorithm. However most modern unices use a so-called *shadow password* system. On those unices the *pw_passwd* field only contains an asterisk (``'*'``) or the letter ``'x'`` where the encrypted password is stored in a file :file:`/etc/shadow` which is not world readable. Whether the *pw_passwd* field contains anything useful is system-dependent.
sv: I traditionella Unix innehåller fältet ``pw_passwd`` vanligtvis ett lösenord som krypterats med en DES-algoritm. De flesta moderna Unix använder dock ett så kallat *shadow password*-system. På dessa enheter innehåller fältet *pw_passwd* endast en asterisk (``'*'``) eller bokstaven ``'x'`` där det krypterade lösenordet lagras i en fil :file:`/etc/shadow` som inte är läsbar för världen. Huruvida fältet *pw_passwd* innehåller något användbart är systemberoende.

source: It defines the following items:
sv: Den definierar följande punkter:

source: Return the password database entry for the given numeric user ID.
sv: Returnerar lösenordsdatabasen för det angivna numeriska användar-ID:t.

source: Return the password database entry for the given user name.
sv: Returnerar lösenordsdatabasen för det angivna användarnamnet.

source: Return a list of all available password database entries, in arbitrary order.
sv: Returnerar en lista med alla tillgängliga poster i lösenordsdatabasen, i godtycklig ordning.

source: Module :mod:`grp`
sv: Modul :mod:`grp`

source: An interface to the group database, similar to this.
sv: Ett gränssnitt till gruppdatabasen, liknande detta.
