Repository: yeager/python-docs-sv
Catalog: library/py_compile.po
Languages: sv

source: :mod:`!py_compile` --- Compile Python source files
sv: :mod:`!py_compile` --- Kompilera Python-källfiler

source: **Source code:** :source:`Lib/py_compile.py`
sv: **Källkod:** :source:`Lib/py_compile.py`

source: The :mod:`py_compile` module provides a function to generate a byte-code file from a source file, and another function used when the module source file is invoked as a script.
sv: Modulen :mod:`py_compile` innehåller en funktion för att generera en bytekodfil från en källfil och en annan funktion som används när modulens källfil anropas som ett skript.

source: Though not often needed, this function can be useful when installing modules for shared use, especially if some of the users may not have permission to write the byte-code cache files in the directory containing the source code.
sv: Även om den här funktionen inte behövs ofta kan den vara användbar när du installerar moduler för gemensamt bruk, särskilt om vissa av användarna kanske inte har behörighet att skriva bytekodcachefilerna i katalogen som innehåller källkoden.

source: Exception raised when an error occurs while attempting to compile the file.
sv: Undantag som uppstår när ett fel inträffar vid försök att kompilera filen.

source: Compile a source file to byte-code and write out the byte-code cache file. The source code is loaded from the file named *file*. The byte-code is written to *cfile*, which defaults to the :pep:`3147`/:pep:`488` path, ending in ``.pyc``. For example, if *file* is ``/foo/bar/baz.py`` *cfile* will default to ``/foo/bar/__pycache__/baz.cpython-32.pyc`` for Python 3.2. If *dfile* is specified, it is used instead of *file* as the name of the source file from which source lines are obtained for display in exception tracebacks. If *doraise* is true, a :exc:`PyCompileError` is raised when an error is encountered while compiling *file*. If *doraise* is false (the default), an error string is written to ``sys.stderr``, but no exception is raised. This function returns the path to byte-compiled file, i.e. whatever *cfile* value was used.
sv: Kompilera en källfil till byte-code och skriv ut cache-filen för byte-code. Källkoden laddas från filen med namnet *file*. Bytekoden skrivs till *cfile*, som som standard är sökvägen :pep:`3147`/:pep:`488`, som slutar på ``.pyc``. Om *file* till exempel är ``/foo/bar/baz.py`` kommer *cfile* som standard att vara ``/foo/bar/__pycache__/baz.cpython-32.pyc`` för Python 3.2. Om *dfile* anges används det i stället för *file* som namn på källfilen från vilken källrader hämtas för visning i spårningar av undantag. Om *doraise* är true, skapas ett :exc:`PyCompileError` när ett fel uppstår under kompileringen av *file*. Om *doraise* är false (standard) skrivs en felsträng till ``sys.stderr``, men inget undantag görs. Denna funktion returnerar sökvägen till den bytekompilerade filen, dvs. det värde för *cfile* som användes.

source: The *doraise* and *quiet* arguments determine how errors are handled while compiling file. If *quiet* is 0 or 1, and *doraise* is false, the default behaviour is enabled: an error string is written to ``sys.stderr``, and the function returns ``None`` instead of a path. If *doraise* is true, a :exc:`PyCompileError` is raised instead. However if *quiet* is 2, no message is written, and *doraise* has no effect.
sv: Argumenten *doraise* och *quiet* bestämmer hur fel ska hanteras vid kompilering av filen. Om *quiet* är 0 eller 1, och *doraise* är false, aktiveras standardbeteendet: en felsträng skrivs till ``sys.stderr``, och funktionen returnerar ``None`` istället för en sökväg. Om *doraise* är true skapas istället ett :exc:`PyCompileError`. Men om *quiet* är 2 skrivs inget meddelande och *doraise* har ingen effekt.

source: If the path that *cfile* becomes (either explicitly specified or computed) is a symlink or non-regular file, :exc:`FileExistsError` will be raised. This is to act as a warning that import will turn those paths into regular files if it is allowed to write byte-compiled files to those paths. This is a side-effect of import using file renaming to place the final byte-compiled file into place to prevent concurrent file writing issues.
sv: Om den sökväg som *cfile* blir (antingen explicit angiven eller beräknad) är en symlänk eller en icke-vanlig fil, kommer :exc:`FileExistsError` att tas upp. Detta är för att fungera som en varning om att import kommer att göra dessa sökvägar till vanliga filer om det är tillåtet att skriva bytekompilerade filer till dessa sökvägar. Detta är en bieffekt av att import använder filomdöpning för att placera den slutliga bytekompilerade filen på plats för att förhindra problem med samtidig filskrivning.

source: *optimize* controls the optimization level and is passed to the built-in :func:`compile` function. The default of ``-1`` selects the optimization level of the current interpreter.
sv: *optimize* styr optimeringsnivån och skickas till den inbyggda funktionen :func:`compile`. Standardvärdet ``-1`` väljer optimeringsnivån för den aktuella tolken.

source: *invalidation_mode* should be a member of the :class:`PycInvalidationMode` enum and controls how the generated bytecode cache is invalidated at runtime. The default is :attr:`PycInvalidationMode.CHECKED_HASH` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is set, otherwise the default is :attr:`PycInvalidationMode.TIMESTAMP`.
sv: *invalidation_mode* bör vara en medlem av enum :class:`PycInvalidationMode` och styr hur den genererade bytecode-cachen ogiltigförklaras vid körning. Standardvärdet är :attr:`PycInvalidationMode.CHECKED_HASH` om miljövariabeln :envvar:`SOURCE_DATE_EPOCH` är inställd, annars är standardvärdet :attr:`PycInvalidationMode.TIMESTAMP`.

source: Changed default value of *cfile* to be :PEP:`3147`-compliant. Previous default was *file* + ``'c'`` (``'o'`` if optimization was enabled). Also added the *optimize* parameter.
sv: Ändrat standardvärde för *cfile* för att vara :PEP:`3147`-kompatibelt. Tidigare standard var *file* + ``'c'`` (``'o'`` om optimering var aktiverad). Parametern *optimize* har också lagts till.

source: Changed code to use :mod:`importlib` for the byte-code cache file writing. This means file creation/writing semantics now match what :mod:`importlib` does, e.g. permissions, write-and-move semantics, etc. Also added the caveat that :exc:`FileExistsError` is raised if *cfile* is a symlink or non-regular file.
sv: Ändrade koden så att den använder :mod:`importlib` för skrivning av bytekodcache-filer. Detta innebär att semantiken för att skapa/skriva filer nu matchar vad :mod:`importlib` gör, t.ex. behörigheter, skriv-och-flytta-semantik, etc. Jag har också lagt till en varning om att :exc:`FileExistsError` uppstår om *cfile* är en symlänk eller en icke vanlig fil.

source: The *invalidation_mode* parameter was added as specified in :pep:`552`. If the :envvar:`SOURCE_DATE_EPOCH` environment variable is set, *invalidation_mode* will be forced to :attr:`PycInvalidationMode.CHECKED_HASH`.
sv: Parametern *invalidation_mode* lades till enligt specifikationen i :pep:`552`. Om miljövariabeln :envvar:`SOURCE_DATE_EPOCH` är inställd, kommer *invalidation_mode* att tvingas till :attr:`PycInvalidationMode.CHECKED_HASH`.

source: The :envvar:`SOURCE_DATE_EPOCH` environment variable no longer overrides the value of the *invalidation_mode* argument, and determines its default value instead.
sv: Miljövariabeln :envvar:`SOURCE_DATE_EPOCH` åsidosätter inte längre värdet på argumentet *invalidation_mode*, utan fastställer istället dess standardvärde.

source: The *quiet* parameter was added.
sv: Parametern *quiet* har lagts till.

source: An enumeration of possible methods the interpreter can use to determine whether a bytecode file is up to date with a source file. The ``.pyc`` file indicates the desired invalidation mode in its header. See :ref:`pyc-invalidation` for more information on how Python invalidates ``.pyc`` files at runtime.
sv: En uppräkning av möjliga metoder som tolken kan använda för att avgöra om en bytecode-fil är uppdaterad med en källfil. Filen ``.pyc`` anger önskat invalidiseringsläge i sitt huvud. Se :ref:`pyc-invalidation` för mer information om hur Python ogiltigförklarar ``.pyc``-filer vid körning.

source: The ``.pyc`` file includes the timestamp and size of the source file, which Python will compare against the metadata of the source file at runtime to determine if the ``.pyc`` file needs to be regenerated.
sv: Filen ``.pyc`` innehåller tidsstämpel och storlek på källfilen, som Python kommer att jämföra med metadata för källfilen vid körning för att avgöra om filen ``.pyc`` behöver återskapas.

source: The ``.pyc`` file includes a hash of the source file content, which Python will compare against the source at runtime to determine if the ``.pyc`` file needs to be regenerated.
sv: Filen ``.pyc`` innehåller en hash av källfilens innehåll, som Python kommer att jämföra med källan vid körning för att avgöra om filen ``.pyc`` behöver återskapas.

source: Like :attr:`CHECKED_HASH`, the ``.pyc`` file includes a hash of the source file content. However, Python will at runtime assume the ``.pyc`` file is up to date and not validate the ``.pyc`` against the source file at all.
sv: Precis som :attr:`CHECKED_HASH` innehåller filen ``.pyc`` en hash av källfilens innehåll. Python kommer dock vid körning att anta att filen ``.pyc`` är uppdaterad och inte validera ``.pyc`` mot källfilen alls.

source: This option is useful when the ``.pycs`` are kept up to date by some system external to Python like a build system.
sv: Detta alternativ är användbart när ``.pycs`` hålls uppdaterade av något system utanför Python, t.ex. ett byggsystem.

source: Command-Line Interface
sv: Kommandoradsgränssnitt

source: This module can be invoked as a script to compile several source files. The files named in *filenames* are compiled and the resulting bytecode is cached in the normal manner. This program does not search a directory structure to locate source files; it only compiles files named explicitly. The exit status is nonzero if one of the files could not be compiled.
sv: Denna modul kan anropas som ett skript för att kompilera flera källfiler. Filerna som anges i *filnamn* kompileras och den resulterande bytekoden cachelagras på vanligt sätt. Programmet söker inte igenom en katalogstruktur för att hitta källfiler, utan kompilerar endast filer som uttryckligen namnges. Exit-statusen är ung om en av filerna inte kunde kompileras.

source: Positional arguments are files to compile. If ``-`` is the only parameter, the list of files is taken from standard input.
sv: Positionella argument är filer som ska kompileras. Om ``-`` är den enda parametern hämtas listan med filer från standardinmatningen.

source: Suppress errors output.
sv: Undertrycka fel i utmatningen.

source: Added support for ``-``.
sv: Lagt till stöd för ``-``.

source: Added support for :option:`-q`.
sv: Lagt till stöd för :option:`-q`.

source: Module :mod:`compileall`
sv: Modul :mod:`compileall`

source: Utilities to compile all Python source files in a directory tree.
sv: Verktyg för att kompilera alla Python-källfiler i ett katalogträd.

source: file
sv: fil
