Repository: yeager/python-docs-sv
Catalog: library/pyexpat.po
Languages: sv

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
sv: Kodningssträngen som ingår i XML-utdata bör överensstämma med lämpliga standarder. Till exempel är "UTF-8" giltig, men "UTF8" är det inte. Se https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl och https://www.iana.org/assignments/character-sets/character-sets.xhtml.

source: module
sv: modul
