Repository: yeager/python-docs-sv
Catalog: library/quopri.po
Languages: sv

source: :mod:`!quopri` --- Encode and decode MIME quoted-printable data
sv: :mod:`!quopri` --- Kodning och avkodning av MIME quoted-printable data

source: **Source code:** :source:`Lib/quopri.py`
sv: **Källkod:** :source:`Lib/quopri.py`

source: This module performs quoted-printable transport encoding and decoding, as defined in :rfc:`1521`: "MIME (Multipurpose Internet Mail Extensions) Part One: Mechanisms for Specifying and Describing the Format of Internet Message Bodies". The quoted-printable encoding is designed for data where there are relatively few nonprintable characters; the base64 encoding scheme available via the :mod:`base64` module is more compact if there are many such characters, as when sending a graphics file.
sv: Den här modulen utför kodning och avkodning av transportformat för citattryckbara meddelanden, enligt definitionen i :rfc:`1521`: "MIME (Multipurpose Internet Mail Extensions) Part One: Mechanisms for Specifying and Describing the Format of Internet Message Bodies". Kodningen quoted-printable är avsedd för data där det finns relativt få icke-utskrivbara tecken; kodningsschemat base64, som är tillgängligt via modulen :mod:`base64`, är mer kompakt om det finns många sådana tecken, som när man skickar en grafikfil.

source: Decode the contents of the *input* file and write the resulting decoded binary data to the *output* file. *input* and *output* must be :term:`binary file objects <file object>`. If the optional argument *header* is present and true, underscore will be decoded as space. This is used to decode "Q"-encoded headers as described in :rfc:`1522`: "MIME (Multipurpose Internet Mail Extensions) Part Two: Message Header Extensions for Non-ASCII Text".
sv: Avkodar innehållet i filen *input* och skriver de avkodade binära data som blir resultatet till filen *output*. *input* och *output* måste vara :term:`binära filobjekt <file object>`. Om det valfria argumentet *header* är närvarande och sant, kommer understreck att avkodas som mellanslag. Detta används för att avkoda "Q"-kodade headers enligt beskrivningen i :rfc:`1522`: "MIME (Multipurpose Internet Mail Extensions) Part Two: Message Header Extensions for Non-ASCII Text".

source: Encode the contents of the *input* file and write the resulting quoted-printable data to the *output* file. *input* and *output* must be :term:`binary file objects <file object>`. *quotetabs*, a non-optional flag which controls whether to encode embedded spaces and tabs; when true it encodes such embedded whitespace, and when false it leaves them unencoded. Note that spaces and tabs appearing at the end of lines are always encoded, as per :rfc:`1521`. *header* is a flag which controls if spaces are encoded as underscores as per :rfc:`1522`.
sv: Kodar innehållet i *input*-filen och skriver den resulterande data som kan skrivas ut med citationstecken till *output*-filen. *input* och *output* måste vara :term:`binary file objects <file object>`. *quotetabs*, en icke valfri flagga som styr om inbäddade mellanslag och tabbar ska kodas; när true kodas sådana inbäddade blanksteg och när false lämnas de okodade. Observera att mellanslag och tabbar som visas i slutet av rader alltid kodas, enligt :rfc:`1521`. *header* är en flagga som kontrollerar om mellanslag kodas som understrykningstecken enligt :rfc:`1522`.

source: Like :func:`decode`, except that it accepts a source :class:`bytes` and returns the corresponding decoded :class:`bytes`.
sv: Som :func:`decode`, förutom att den accepterar en källa :class:`bytes` och returnerar motsvarande avkodade :class:`bytes`.

source: Like :func:`encode`, except that it accepts a source :class:`bytes` and returns the corresponding encoded :class:`bytes`. By default, it sends a ``False`` value to *quotetabs* parameter of the :func:`encode` function.
sv: Som :func:`encode`, förutom att den accepterar en källa :class:`bytes` och returnerar motsvarande kodade :class:`bytes`. Som standard skickar den ett ``False``-värde till *quotetabs*-parametern i funktionen :func:`encode`.

source: Module :mod:`base64`
sv: Modul :mod:`base64`

source: Encode and decode MIME base64 data
sv: Kodning och avkodning av MIME base64-data

source: encoding
sv: kodning

source: quoted-printable encoding
sv: quoted-printable-kodning
