Repository: yeager/python-docs-sv
Catalog: library/re.po
Languages: sv

source: Matches characters considered alphanumeric in the ASCII character set; this is equivalent to ``[a-zA-Z0-9_]``. If the :py:const:`~re.LOCALE` flag is used, matches characters considered alphanumeric in the current locale and the underscore.
sv: Matchar tecken som anses vara alfanumeriska i ASCII-teckenuppsättningen; detta motsvarar ``[a-zA-Z0-9_]``. Om flaggan :py:const:`~re.LOCALE` används, matchas tecken som anses vara alfanumeriska i den aktuella språkdräkten och understreck.

source: Matches any character which is not a word character. This is the opposite of ``\w``. By default, matches non-underscore (``_``) characters for which :py:meth:`str.isalnum` returns ``False``.
sv: Matchar alla tecken som inte är ordtecken. Detta är motsatsen till ``\w``. Som standard matchas icke-underscore (``_``) tecken för vilka :py:meth:`str.isalnum` returnerar ``False``.

source: Matches ``[^a-zA-Z0-9_]`` if the :py:const:`~re.ASCII` flag is used.
sv: Matchar ``[^a-zA-Z0-9_]`` om flaggan :py:const:`~re.ASCII` används.

source: If the :py:const:`~re.LOCALE` flag is used, matches characters which are neither alphanumeric in the current locale nor the underscore.
sv: Om flaggan :py:const:`~re.LOCALE` används, matchar den tecken som varken är alfanumeriska i den aktuella språkdräkten eller underscore.

source: Matches only at the end of the string.
sv: Matchar endast i slutet av strängen.

source: The same as ``\z``. For compatibility with old Python versions.
sv: Samma som ``z``. För kompatibilitet med gamla Python-versioner.

source: Most of the :ref:`escape sequences <escape-sequences>` supported by Python string literals are also accepted by the regular expression parser::
sv: De flesta av de :ref:`escape-sekvenser <escape-sequences>` som stöds av Pythons stränglitteraler accepteras också av parsern för reguljära uttryck::

source: (Note that ``\b`` is used to represent word boundaries, and means "backspace" only inside character classes.)
sv: (Observera att ``b`` används för att representera ordgränser och betyder "backspace" endast inom teckenklasser)

source: ``'\u'``, ``'\U'``, and ``'\N'`` escape sequences are only recognized in Unicode (str) patterns. In bytes patterns they are errors. Unknown escapes of ASCII letters are reserved for future use and treated as errors.
sv: escape-sekvenserna ``'\u'``, ``'\U'`` och ``'\N'`` känns bara igen i Unicode-mönster (str). I bytesmönster är de fel. Okända escapes av ASCII-bokstäver reserveras för framtida användning och behandlas som fel.

source: Octal escapes are included in a limited form. If the first digit is a 0, or if there are three octal digits, it is considered an octal escape. Otherwise, it is a group reference. As for string literals, octal escapes are always at most three digits in length.
sv: Oktala escapes ingår i en begränsad form. Om den första siffran är en 0, eller om det finns tre oktalsiffror, betraktas det som en oktal escape. Annars är det en gruppreferens. När det gäller stränglitteraler är oktala escapes alltid högst tre siffror långa.

source: The ``'\u'`` and ``'\U'`` escape sequences have been added.
sv: Escape-sekvenserna ``'\u'`` och ``'\U'`` har lagts till.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter now are errors.
sv: Okända escapes som består av ``'\'`` och en ASCII-bokstav är nu fel.

source: The :samp:`'\\N\\{{name}\\}'` escape sequence has been added. As in string literals, it expands to the named Unicode character (e.g. ``'\N{EM DASH}'``).
sv: Escape-sekvensen :samp:`'\\N\\{{name}\\}'` har lagts till. Precis som i stränglitteraler expanderar den till det namngivna Unicode-tecknet (t.ex. ``'\N{EM DASH}'``).

source: Module Contents
sv: Modulens innehåll

source: The module defines several functions, constants, and an exception. Some of the functions are simplified versions of the full featured methods for compiled regular expressions. Most non-trivial applications always use the compiled form.
sv: Modulen definierar flera funktioner, konstanter och ett undantag. Vissa av funktionerna är förenklade versioner av de fullständiga metoderna för kompilerade reguljära uttryck. De flesta icke-triviala applikationer använder alltid den kompilerade formen.

source: Flags
sv: Flaggor

source: Flag constants are now instances of :class:`RegexFlag`, which is a subclass of :class:`enum.IntFlag`.
sv: Flaggkonstanter är nu instanser av :class:`RegexFlag`, som är en underklass av :class:`enum.IntFlag`.

source: An :class:`enum.IntFlag` class containing the regex options listed below.
sv: En :class:`enum.IntFlag`-klass som innehåller de regex-alternativ som anges nedan.

source: - added to ``__all__``
sv: - tillagd till ``__all__``

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\d``, ``\D``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode (str) patterns, and is ignored for bytes patterns.
sv: Gör så att ``w``, ``W``, ``b``, ``B``, ``d``, ``D``, ``s`` och ``S`` endast utför ASCII-matchning istället för fullständig Unicode-matchning. Detta är endast meningsfullt för Unicode-mönster (str) och ignoreras för bytes-mönster.

source: Corresponds to the inline flag ``(?a)``.
sv: Motsvarar inline-flaggan ``(?a)``.

source: The :py:const:`~re.U` flag still exists for backward compatibility, but is redundant in Python 3 since matches are Unicode by default for ``str`` patterns, and Unicode matching isn't allowed for bytes patterns. :py:const:`~re.UNICODE` and the inline flag ``(?u)`` are similarly redundant.
sv: Flaggan :py:const:`~re.U` finns fortfarande kvar för bakåtkompatibilitet, men är överflödig i Python 3 eftersom matchningar är Unicode som standard för ``str``-mönster och Unicode-matchning inte är tillåten för bytesmönster. Flaggan :py:const:`~re.UNICODE` och inline-flaggan ``(?u)`` är på samma sätt överflödiga.

source: Display debug information about compiled expression.
sv: Visa felsökningsinformation om kompilerade uttryck.

source: No corresponding inline flag.
sv: Ingen motsvarande inline-flagga.

source: Perform case-insensitive matching; expressions like ``[A-Z]`` will also match lowercase letters. Full Unicode matching (such as ``Ü`` matching ``ü``) also works unless the :py:const:`~re.ASCII` flag is used to disable non-ASCII matches. The current locale does not change the effect of this flag unless the :py:const:`~re.LOCALE` flag is also used.
sv: Utför matchning utan hänsyn till skiftlägesskillnader; uttryck som ``[A-Z]`` matchar även små bokstäver. Fullständig Unicode-matchning (t.ex. ``Ü`` som matchar ``ü``) fungerar också om inte flaggan :py:const:`~re.ASCII` används för att inaktivera icke-ASCII-matchningar. Den aktuella språkdräkten ändrar inte effekten av denna flagga om inte flaggan :py:const:`~re.LOCALE` också används.

source: Corresponds to the inline flag ``(?i)``.
sv: Motsvarar inline-flaggan ``(?i)``.

source: Note that when the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). If the :py:const:`~re.ASCII` flag is used, only letters 'a' to 'z' and 'A' to 'Z' are matched.
sv: Observera att när Unicode-mönstren ``[a-z]`` eller ``[A-Z]`` används i kombination med flaggan :const:`IGNORECASE`, matchar de de 52 ASCII-bokstäverna och 4 ytterligare icke-ASCII-bokstäver: 'İ' (U+0130, latinsk versal I med punkt ovanför), ’ı’ (U+0131, latinsk gemen i utan punkt), ’ſ’ (U+017F, latinsk gemen lång s) och ’K’ (U+212A, Kelvin-tecken). Om flaggan :const:`~re.ASCII` används matchas endast bokstäverna ’a’ till ’z’ och ’A’ till ’Z’.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale. This flag can be used only with bytes patterns.
sv: Gör ``w``, ``W``, ``b``, ``B`` och skiftlägesokänslig matchning beroende av aktuell lokal. Denna flagga kan endast användas med bytesmönster.

source: Corresponds to the inline flag ``(?L)``.
sv: Motsvarar inline-flaggan ``(?L)``.

source: This flag is discouraged; consider Unicode matching instead. The locale mechanism is very unreliable as it only handles one "culture" at a time and only works with 8-bit locales. Unicode matching is enabled by default for Unicode (str) patterns and it is able to handle different locales and languages.
sv: Denna flagga avrådes; överväg Unicode-matchning istället. Lokalmekanismen är mycket opålitlig eftersom den bara hanterar en "kultur" åt gången och bara fungerar med 8-bitars lokalspråk. Unicode-matchning är aktiverad som standard för Unicode (str)-mönster och kan hantera olika lokala språk och språk.

source: :py:const:`~re.LOCALE` can be used only with bytes patterns and is not compatible with :py:const:`~re.ASCII`.
sv: :py:const:`~re.LOCALE` kan endast användas med bytesmönster och är inte kompatibel med :py:const:`~re.ASCII`.

source: Compiled regular expression objects with the :py:const:`~re.LOCALE` flag no longer depend on the locale at compile time. Only the locale at matching time affects the result of matching.
sv: Kompilerade objekt för reguljära uttryck med :py:const:`~re.LOCALE`-flaggan är inte längre beroende av locale vid kompileringstillfället. Endast locale vid matchningstillfället påverkar resultatet av matchningen.

source: When specified, the pattern character ``'^'`` matches at the beginning of the string and at the beginning of each line (immediately following each newline); and the pattern character ``'$'`` matches at the end of the string and at the end of each line (immediately preceding each newline). By default, ``'^'`` matches only at the beginning of the string, and ``'$'`` only at the end of the string and immediately before the newline (if any) at the end of the string.
sv: När det anges matchar mönsterstecknet ``'^'`` i början av strängen och i början av varje rad (omedelbart efter varje ny rad); och mönsterstecknet ``'$'`` matchar i slutet av strängen och i slutet av varje rad (omedelbart före varje ny rad). Som standard matchar ``'^'`` endast i början av strängen och ``'$'`` endast i slutet av strängen och omedelbart före den nya raden (om någon) i slutet av strängen.

source: Corresponds to the inline flag ``(?m)``.
sv: Motsvarar inline-flaggan ``(?m)``.

source: Indicates no flag being applied, the value is ``0``. This flag may be used as a default value for a function keyword argument or as a base value that will be conditionally ORed with other flags. Example of use as a default value::
sv: Indikerar att ingen flagga tillämpas, värdet är ``0``. Denna flagga kan användas som ett standardvärde för ett funktionsnyckelordsargument eller som ett basvärde som villkorligt OR:as med andra flaggor. Exempel på användning som standardvärde::

source: Make the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline.
sv: Låt specialtecknet ``'.'`` matcha vilket tecken som helst, inklusive en ny rad; utan denna flagga kommer ``'.'`` att matcha allt *utom* en ny rad.

source: Corresponds to the inline flag ``(?s)``.
sv: Motsvarar den inline-flaggan ``(?s)``.

source: In Python 3, Unicode characters are matched by default for ``str`` patterns. This flag is therefore redundant with **no effect** and is only kept for backward compatibility.
sv: I Python 3 matchas Unicode-tecken som standard för ``str``-mönster. Denna flagga är därför överflödig med **ingen effekt** och behålls endast för bakåtkompatibilitet.

source: See :py:const:`~re.ASCII` to restrict matching to ASCII characters instead.
sv: Se :py:const:`~re.ASCII` för att begränsa matchningen till ASCII-tecken istället.

source: This flag allows you to write regular expressions that look nicer and are more readable by allowing you to visually separate logical sections of the pattern and add comments. Whitespace within the pattern is ignored, except when in a character class, or when preceded by an unescaped backslash, or within tokens like ``*?``, ``(?:`` or ``(?P<...>``. For example, ``(? :`` and ``* ?`` are not allowed. When a line contains a ``#`` that is not in a character class and is not preceded by an unescaped backslash, all characters from the leftmost such ``#`` through the end of the line are ignored.
sv: Med den här flaggan kan du skriva reguljära uttryck som ser snyggare ut och är mer läsbara genom att du visuellt kan separera logiska delar av mönstret och lägga till kommentarer. Whitespace inom mönstret ignoreras, utom när det är i en teckenklass, eller när det föregås av ett oavkortat backslash, eller inom tokens som ``*?``, ``(?:`` eller ``(?P<...>``. Till exempel är ``(? :`` och ``* ?`` inte tillåtna. När en rad innehåller en ``#`` som inte ingår i en teckenklass och som inte föregås av en obegränsad backslash, ignoreras alla tecken från den längst till vänster liggande sådana ``#`` till slutet av raden.

source: This means that the two following regular expression objects that match a decimal number are functionally equal::
sv: Detta innebär att de två följande objekten för reguljära uttryck som matchar ett decimaltal är funktionellt lika::

source: a = re.compile(r"""\d + # the integral part \. # the decimal point \d * # some fractional digits""", re.X) b = re.compile(r"\d+\.\d*")
sv: a = re.compile(r"""\d + # den integrerade delen \. # decimalpunkten \d * # några fraktionssiffror""", re.X) b = re.compile(r"\d+\.\d*")

source: Corresponds to the inline flag ``(?x)``.
sv: Motsvarar inline-flaggan ``(?x)``.

source: Functions
sv: Funktioner

source: Compile a regular expression pattern into a :ref:`regular expression object <re-objects>`, which can be used for matching using its :func:`~Pattern.match`, :func:`~Pattern.search` and other methods, described below.
sv: Kompilera ett mönster för reguljära uttryck till ett :ref:``regular expression object <re-objects>``, som kan användas för matchning med hjälp av dess :func:`~Pattern.match`, :func:`~Pattern.search` och andra metoder, som beskrivs nedan.

source: The expression's behaviour can be modified by specifying a *flags* value. Values can be any of the `flags`_ variables, combined using bitwise OR (the ``|`` operator).
sv: Uttryckets beteende kan ändras genom att ange ett *flags*-värde. Värdena kan vara vilken som helst av variablerna `flags`_, kombinerade med bitvis OR (operatorn ``|``).

source: The sequence ::
sv: Sekvensen ::

source: prog = re.compile(pattern) result = prog.match(string)
sv: prog = re.compile(mönster) resultat = prog.match(sträng)

source: is equivalent to ::
sv: är likvärdig med ::

source: result = re.match(pattern, string)
sv: resultat = re.match(mönster, sträng)

source: but using :func:`re.compile` and saving the resulting regular expression object for reuse is more efficient when the expression will be used several times in a single program.
sv: men att använda :func:`re.compile` och spara det resulterande objektet för reguljära uttryck för återanvändning är effektivare när uttrycket kommer att användas flera gånger i ett och samma program.

source: The compiled versions of the most recent patterns passed to :func:`re.compile` and the module-level matching functions are cached, so programs that use only a few regular expressions at a time needn't worry about compiling regular expressions.
sv: De kompilerade versionerna av de senaste mönstren som skickas till :func:`re.compile` och matchningsfunktionerna på modulnivå cachas, så program som bara använder ett fåtal reguljära uttryck åt gången behöver inte oroa sig för att kompilera reguljära uttryck.

source: Scan through *string* looking for the first location where the regular expression *pattern* produces a match, and return a corresponding :class:`~re.Match`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
sv: Skanna igenom *sträng* och leta efter den första platsen där det reguljära uttrycket *mönster* ger en träff, och returnera en motsvarande :class:`~re.Match`. Returnerar ``None`` om ingen position i strängen matchar mönstret; observera att detta skiljer sig från att hitta en noll-längdsmatchning någonstans i strängen.

source: If zero or more characters at the beginning of *string* match the regular expression *pattern*, return a corresponding :class:`~re.Match`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
sv: Om noll eller fler tecken i början av *sträng* matchar det reguljära uttrycket *mönster*, returneras en motsvarande :class:`~re.Match`. Returnerar ``None`` om strängen inte matchar mönstret; notera att detta skiljer sig från en noll-längds matchning.

source: Note that even in :const:`MULTILINE` mode, :func:`re.match` will only match at the beginning of the string and not at the beginning of each line.
sv: Observera att även i :const:`MULTILINE`-läget kommer :func:`re.match` bara att matcha i början av strängen och inte i början av varje rad.

source: If you want to locate a match anywhere in *string*, use :func:`search` instead (see also :ref:`search-vs-match`).
sv: Om du vill hitta en träff var som helst i *sträng*, använd :func:`search` istället (se även :ref:`search-vs-match`).

source: If the whole *string* matches the regular expression *pattern*, return a corresponding :class:`~re.Match`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
sv: Om hela *strängen* matchar det reguljära uttrycket *mönstret*, returneras en motsvarande :class:`~re.Match`. Returnerar ``None`` om strängen inte matchar mönstret; notera att detta skiljer sig från en matchning med noll längd.

source: Split *string* by the occurrences of *pattern*. If capturing parentheses are used in *pattern*, then the text of all groups in the pattern are also returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits occur, and the remainder of the string is returned as the final element of the list. ::
sv: Dela upp *sträng* efter förekomsterna av *mönster*. Om fångande parenteser används i *mönster* returneras även texten för alla grupper i mönstret som en del av den resulterande listan. Om *maxsplit* inte är noll, sker högst *maxsplit* uppdelningar och resten av strängen returneras som det sista elementet i listan. ::

source: >>> re.split(r'\W+', 'Words, words, words.') ['Words', 'words', 'words', ''] >>> re.split(r'(\W+)', 'Words, words, words.') ['Words', ', ', 'words', ', ', 'words', '.', ''] >>> re.split(r'\W+', 'Words, words, words.', maxsplit=1) ['Words', 'words, words.'] >>> re.split('[a-f]+', '0a3B9', flags=re.IGNORECASE) ['0', '3', '9']
sv: >>> re.split(r'\W+', 'Ord, ord, ord, ord.') ['Ord', 'ord', 'ord', 'ord', ''] >>> re.split(r'(\W+)', 'Ord, ord, ord.') ['Ord', ', ', 'ord', ', ', 'ord', '.', ''] >>> re.split(r'\W+', 'Ord, ord, ord.', maxsplit=1) ['Ord', 'ord, ord, ord.'] >>> re.split('[a-f]+', '0a3B9', flags=re.IGNORECASE) ['0', '3', '9']

source: If there are capturing groups in the separator and it matches at the start of the string, the result will start with an empty string. The same holds for the end of the string::
sv: Om det finns fångstgrupper i separatorn och den matchar i början av strängen, kommer resultatet att börja med en tom sträng. Detsamma gäller för slutet av strängen::

source: >>> re.split(r'(\W+)', '...words, words...') ['', '...', 'words', ', ', 'words', '...', '']
sv: >>> re.split(r'(\W+)', '...ord, ord...') ['', '...', 'ord', ', ', 'ord', '...', '']

source: That way, separator components are always found at the same relative indices within the result list.
sv: På så sätt hittas separatorkomponenterna alltid på samma relativa index i resultatlistan.

source: Adjacent empty matches are not possible, but an empty match can occur immediately after a non-empty match.
sv: Intilliggande tomma matchningar är inte möjliga, men en tom matchning kan inträffa omedelbart efter en icke-tom matchning.

source: >>> re.split(r'\b', 'Words, words, words.') ['', 'Words', ', ', 'words', ', ', 'words', '.'] >>> re.split(r'\W*', '...words...') ['', '', 'w', 'o', 'r', 'd', 's', '', ''] >>> re.split(r'(\W*)', '...words...') ['', '...', '', '', 'w', '', 'o', '', 'r', '', 'd', '', 's', '...', '', '', '']
sv: >>> re.split(r'\b', 'Ord, ord, ord.') ['', 'Ord', ', ', 'ord', ', ', 'ord', '.'] >>> re.split(r'\W*', '...ord...') ['', '', 'w', 'o', 'r', 'd', 's', '', ''] >>> re.split(r'(\W*)', '...ord...') ['', '...', '', '', '', 'w', '', 'o', '', 'r', '', 'd', '', 's', '...', '', '', '']

source: Added the optional flags argument.
sv: Lagt till det valfria flaggargumentet.

source: Added support of splitting on a pattern that could match an empty string.
sv: Stöd för uppdelning av ett mönster som kan matcha en tom sträng har lagts till.

source: Passing *maxsplit* and *flags* as positional arguments is deprecated. In future Python versions they will be :ref:`keyword-only parameters <keyword-only_parameter>`.
sv: Att skicka *maxsplit* och *flags* som positionella argument är föråldrat. I framtida Python-versioner kommer de att vara :ref:`keyword-only parameters <keyword-only_parameter>`.

source: Return all non-overlapping matches of *pattern* in *string*, as a list of strings or tuples. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
sv: Returnerar alla icke-överlappande matchningar av *mönster* i *sträng*, som en lista med strängar eller tupler. *sträng* skannas från vänster till höger och matchningarna returneras i den ordning de hittas. Tomma matchningar inkluderas i resultatet.

source: The result depends on the number of capturing groups in the pattern. If there are no groups, return a list of strings matching the whole pattern. If there is exactly one group, return a list of strings matching that group. If multiple groups are present, return a list of tuples of strings matching the groups. Non-capturing groups do not affect the form of the result.
sv: Resultatet beror på antalet fångstgrupper i mönstret. Om det inte finns några grupper returneras en lista med strängar som matchar hela mönstret. Om det finns exakt en grupp returneras en lista med strängar som matchar den gruppen. Om det finns flera grupper returneras en lista med tupler av strängar som matchar grupperna. Grupper som inte fångas upp påverkar inte resultatets form.

source: Non-empty matches can now start just after a previous empty match.
sv: Matcher som inte är tomma kan nu starta precis efter en tidigare tom match.

source: Return an :term:`iterator` yielding :class:`~re.Match` objects over all non-overlapping matches for the RE *pattern* in *string*. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
sv: Returnerar en :term:`iterator` som ger :class:`~re.Match`-objekt över alla icke-överlappande matchningar för RE *mönster* i *sträng*. *strängen* skannas från vänster till höger och matchningarna returneras i den ordning de hittas. Tomma matchningar inkluderas i resultatet.
