Repository: yeager/python-docs-sv
Catalog: library/re.po
Languages: sv

source: If a group matches multiple times, only the last match is accessible::
sv: Om en grupp matchar flera gånger är det bara den sista matchningen som är tillgänglig::

source: >>> m = re.match(r"(..)+", "a1b2c3") # Matches 3 times. >>> m.group(1) # Returns only the last match. 'c3'
sv: >>> m = re.match(r"(..)+", "a1b2c3") # Matchar 3 gånger. >>> m.group(1) # Returnerar endast den sista matchningen. 'c3'

source: This is identical to ``m.group(g)``. This allows easier access to an individual group from a match::
sv: Detta är identiskt med ``m.group(g)``. Detta gör det lättare att få tillgång till en enskild grupp från en matchning:

source: >>> m = re.match(r"(\w+) (\w+)", "Isaac Newton, physicist") >>> m[0] # The entire match 'Isaac Newton' >>> m[1] # The first parenthesized subgroup. 'Isaac' >>> m[2] # The second parenthesized subgroup. 'Newton'
sv: >>> m = re.match(r"(\w+) (\w+)","Isaac Newton, fysiker") >>> m[0] # Hela matchningen "Isaac Newton >>> m[1] # Den första parentesförsedda undergruppen. 'Isaac' >>> m[2] # Den andra parentesförsedda undergruppen. 'Newton'

source: Named groups are supported as well::
sv: Namngivna grupper stöds också::

source: >>> m = re.match(r"(?P<first_name>\w+) (?P<last_name>\w+)", "Isaac Newton") >>> m['first_name'] 'Isaac' >>> m['last_name'] 'Newton'
sv: >>> m = re.match(r"(?P<förnamn>\w+) (?P<efternamn>\w+)","Isaac Newton") >>> m['förnamn'] "Isaac >>> m['efternamn'] 'Newton'

source: Return a tuple containing all the subgroups of the match, from 1 up to however many groups are in the pattern. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``.
sv: Returnerar en tupel som innehåller alla undergrupper i matchningen, från 1 upp till hur många grupper som helst i mönstret. Argumentet *default* används för grupper som inte deltog i matchningen; standardvärdet är ``None``.

source: For example::
sv: Till exempel::

source: >>> m = re.match(r"(\d+)\.(\d+)", "24.1632") >>> m.groups() ('24', '1632')
sv: >>> m = re.match(r"(\d+)\.(\d+)","24.1632") >>> m.grupper() ('24', '1632')

source: If we make the decimal place and everything after it optional, not all groups might participate in the match. These groups will default to ``None`` unless the *default* argument is given::
sv: Om vi gör decimaltecknet och allt efter det valfritt kan det hända att inte alla grupper deltar i matchningen. Dessa grupper kommer som standard att vara ``None`` om inte *default*-argumentet anges::

source: >>> m = re.match(r"(\d+)\.?(\d+)?", "24") >>> m.groups() # Second group defaults to None. ('24', None) >>> m.groups('0') # Now, the second group defaults to '0'. ('24', '0')
sv: >>> m = re.match(r"(\d+)\.?(\d+)?", "24") >>> m.groups() # Andra gruppen är som standard ingen. ('24', Ingen) >>> m.groups('0') # Nu är standardvärdet för den andra gruppen '0'. ('24', '0')

source: Return a dictionary containing all the *named* subgroups of the match, keyed by the subgroup name. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``. For example::
sv: Returnerar en ordbok som innehåller alla *namngivna* undergrupper i matchningen, med undergruppsnamnet som nyckel. Argumentet *default* används för grupper som inte deltog i matchningen; standardvärdet är ``None``. Till exempel::

source: >>> m = re.match(r"(?P<first_name>\w+) (?P<last_name>\w+)", "Malcolm Reynolds") >>> m.groupdict() {'first_name': 'Malcolm', 'last_name': 'Reynolds'}
sv: >>> m = re.match(r"(?P<förnamn>\w+) (?P<efternamn>\w+)","Malcolm Reynolds") >>> m.groupdict() {'förnamn': 'Malcolm', 'efternamn': 'Reynolds'}

source: Return the indices of the start and end of the substring matched by *group*; *group* defaults to zero (meaning the whole matched substring). Return ``-1`` if *group* exists but did not contribute to the match. For a match object *m*, and a group *g* that did contribute to the match, the substring matched by group *g* (equivalent to ``m.group(g)``) is ::
sv: Returnerar indexen för början och slutet av den delsträng som matchas av *group*; *group* är som standard noll (vilket betyder hela den matchade delsträngen). Returnerar ``-1`` om *group* finns men inte bidrog till matchningen. För ett matchningsobjekt *m* och en grupp *g* som bidrog till matchningen är den delsträng som matchas av gruppen *g* (motsvarande ``m.group(g)``) ::

source: m.string[m.start(g):m.end(g)]
sv: m.string[m.start(g):m.slut(g)]

source: Note that ``m.start(group)`` will equal ``m.end(group)`` if *group* matched a null string. For example, after ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` is 1, ``m.end(0)`` is 2, ``m.start(1)`` and ``m.end(1)`` are both 2, and ``m.start(2)`` raises an :exc:`IndexError` exception.
sv: Observera att ``m.start(group)`` kommer att vara lika med ``m.end(group)`` om *group* matchade en nollsträng. Till exempel, efter ``m = re.search('b(c?)', 'cba')``, är ``m.start(0)`` 1, ``m.end(0)`` är 2, ``m.start(1)`` och ``m.end(1)`` är båda 2, och ``m.start(2)`` ger upphov till ett :exc:`IndexError` undantag.

source: An example that will remove *remove_this* from email addresses::
sv: Ett exempel som tar bort *remove_this* från e-postadresser::

source: >>> email = "tony@tiremove_thisger.net" >>> m = re.search("remove_this", email) >>> email[:m.start()] + email[m.end():] 'tony@tiger.net'
sv: >>> e-post = "tony@tiremove_thisger.net" >>> m = re.search("remove_this", email) >>> email[:m.start()] + email[m.end():] 'tony@tiger.net'

source: For a match *m*, return the 2-tuple ``(m.start(group), m.end(group))``. Note that if *group* did not contribute to the match, this is ``(-1, -1)``. *group* defaults to zero, the entire match.
sv: För en matchning *m* returneras 2-tupeln ``(m.start(group), m.end(group))``. Observera att om *grupp* inte bidrog till matchen är detta ``(-1, -1)``. *group* är standardvärdet noll, hela matchningen.

source: The value of *pos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string at which the RE engine started looking for a match.
sv: Värdet på *pos* som skickades till metoden :meth:`~Pattern.search` eller :meth:`~Pattern.match` i ett :ref:`regexobjekt <re-objects>`. Detta är det index i strängen där RE-motorn började leta efter en matchning.

source: The value of *endpos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string beyond which the RE engine will not go.
sv: Värdet på *endpos* som skickades till metoden :meth:`~Pattern.search` eller :meth:`~Pattern.match` i en :ref:`regexobjekt <re-objects>`. Detta är det index i strängen som RE-motorn inte kommer längre än så.

source: The integer index of the last matched capturing group, or ``None`` if no group was matched at all. For example, the expressions ``(a)b``, ``((a)(b))``, and ``((ab))`` will have ``lastindex == 1`` if applied to the string ``'ab'``, while the expression ``(a)(b)`` will have ``lastindex == 2``, if applied to the same string.
sv: Heltalsindexet för den senast matchade fångstgruppen, eller ``None`` om ingen grupp matchades alls. Till exempel kommer uttrycken ``(a)b``, ``((a)(b))`` och ``((ab))`` att ha ``lastindex == 1`` om de tillämpas på strängen ``'ab'``, medan uttrycket ``(a)(b)`` kommer att ha ``lastindex == 2`` om det tillämpas på samma sträng.

source: The name of the last matched capturing group, or ``None`` if the group didn't have a name, or if no group was matched at all.
sv: Namnet på den senast matchade fångstgruppen, eller ``None`` om gruppen inte hade något namn, eller om ingen grupp matchades alls.

source: The :ref:`regular expression object <re-objects>` whose :meth:`~Pattern.match` or :meth:`~Pattern.search` method produced this match instance.
sv: Den :ref:`objekt för reguljära uttryck <re-objects>` vars :meth:`~Pattern.match` eller :meth:`~Pattern.search` metod producerade denna matchningsinstans.

source: The string passed to :meth:`~Pattern.match` or :meth:`~Pattern.search`.
sv: Den sträng som skickas till :meth:`~Pattern.match` eller :meth:`~Pattern.search`.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Match objects are considered atomic.
sv: Lagt till stöd för :func:`copy.copy` och :func:`copy.deepcopy`. Matchningsobjekt betraktas som atomära.

source: Regular Expression Examples
sv: Exempel på reguljära uttryck

source: Checking for a Pair
sv: Kontrollerar för ett par

source: In this example, we'll use the following helper function to display match objects a little more gracefully::
sv: I det här exemplet använder vi följande hjälpfunktion för att visa matchningsobjekt på ett lite mer elegant sätt::

source: def displaymatch(match): if match is None: return None return '<Match: %r, groups=%r>' % (match.group(), match.groups())
sv: def displaymatch(match): om match är None: returnera Ingen return '<Match: %r, groups=%r>' % (match.group(), match.groups())

source: Suppose you are writing a poker program where a player's hand is represented as a 5-character string with each character representing a card, "a" for ace, "k" for king, "q" for queen, "j" for jack, "t" for 10, and "2" through "9" representing the card with that value.
sv: Anta att du skriver ett pokerprogram där en spelares hand representeras av en sträng med 5 tecken där varje tecken representerar ett kort, "a" för ess, "k" för kung, "q" för dam, "j" för knekt, "t" för 10 och "2" till "9" representerar kortet med det värdet.

source: To see if a given string is a valid hand, one could do the following::
sv: För att se om en given sträng är en giltig hand kan man göra följande::

source: >>> valid = re.compile(r"^[a2-9tjqk]{5}$") >>> displaymatch(valid.match("akt5q")) # Valid. "<Match: 'akt5q', groups=()>" >>> displaymatch(valid.match("akt5e")) # Invalid. >>> displaymatch(valid.match("akt")) # Invalid. >>> displaymatch(valid.match("727ak")) # Valid. "<Match: '727ak', groups=()>"
sv: >>> valid = re.compile(r"^[a2-9tjqk]{5}$") >>> displaymatch(valid.match("akt5q")) # Giltig. "<Matchning: 'akt5q', grupper=()>" >>> displaymatch(valid.match("akt5e")) # Ogiltig. >>> displaymatch(valid.match("akt")) # Invalid. >>> displaymatch(valid.match("727ak")) # Giltig. "<Matchning: '727ak', grupper=()>"

source: That last hand, ``"727ak"``, contained a pair, or two of the same valued cards. To match this with a regular expression, one could use backreferences as such::
sv: Den sista handen, ``"727ak"``, innehöll ett par eller två kort med samma värde. För att matcha detta med ett reguljärt uttryck kan man använda backreferenser som t.ex:

source: >>> pair = re.compile(r".*(.).*\1") >>> displaymatch(pair.match("717ak")) # Pair of 7s. "<Match: '717', groups=('7',)>" >>> displaymatch(pair.match("718ak")) # No pairs. >>> displaymatch(pair.match("354aa")) # Pair of aces. "<Match: '354aa', groups=('a',)>"
sv: >>> pair = re.compile(r".*(.).*\1") >>> displaymatch(par.match("717ak")) # Par av 7-tal. "<Matchning: '717', grupper=('7',)>" >>> displaymatch(par.match("718ak")) # Inga par. >>> displaymatch(par.match("354aa")) # Par med ess. "<Matchning: '354aa', grupper=('a',)>"

source: To find out what card the pair consists of, one could use the :meth:`~Match.group` method of the match object in the following manner::
sv: För att ta reda på vilket kort paret består av kan man använda :meth:`~Match.group`-metoden för match-objektet på följande sätt::

source: >>> pair = re.compile(r".*(.).*\1") >>> pair.match("717ak").group(1) '7' # Error because re.match() returns None, which doesn't have a group() method: >>> pair.match("718ak").group(1) Traceback (most recent call last): File "<pyshell#23>", line 1, in <module> re.match(r".*(.).*\1", "718ak").group(1) AttributeError: 'NoneType' object has no attribute 'group' >>> pair.match("354aa").group(1) 'a'
sv: &gt;&gt;&gt; pair = re.compile(r".*(.).*\1") &gt;&gt;&gt; par.match("717ak").group(1) '7' # Fel eftersom re.match() returnerar None, som inte har någon group()-metod: &gt;&gt;&gt; par.match("718ak").group(1) Traceback (senaste anropet senast): Fil "<pyshell#23>", rad 1, i <module> re.match(r".*(.).*\1", "718ak").group(1) AttributeError: Objektet 'NoneType' har inget attribut 'group' &gt;&gt;&gt; pair.match("354aa").group(1) 'a'

source: Simulating scanf()
sv: Simulering av scanf()

source: Python does not currently have an equivalent to :c:func:`!scanf`. Regular expressions are generally more powerful, though also more verbose, than :c:func:`!scanf` format strings. The table below offers some more-or-less equivalent mappings between :c:func:`!scanf` format tokens and regular expressions.
sv: Python har för närvarande ingen motsvarighet till :c:func:`!scanf`. Reguljära uttryck är i allmänhet mer kraftfulla, men också mer verbala, än :c:func:`!scanf` formatsträngar. Tabellen nedan visar några mer eller mindre likvärdiga mappningar mellan :c:func:`!scanf`-formattokens och reguljära uttryck.

source: Regular Expression
sv: Reguljärt uttryck

source: To extract the filename and numbers from a string like ::
sv: Så här extraherar du filnamn och siffror från en sträng som ::

source: /usr/sbin/sendmail - 0 errors, 4 warnings
sv: /usr/sbin/sendmail - 0 fel, 4 varningar

source: you would use a :c:func:`!scanf` format like ::
sv: skulle du använda ett :c:func:`!scanf`-format som ::

source: %s - %d errors, %d warnings
sv: %s - %d fel, %d varningar

source: The equivalent regular expression would be ::
sv: Motsvarande reguljära uttryck skulle vara ::

source: (\S+) - (\d+) errors, (\d+) warnings
sv: (\S+) - (\d+) fel, (\d+) varningar

source: search() vs. match()
sv: sök() vs. match()

source: Python offers different primitive operations based on regular expressions:
sv: Python erbjuder olika primitiva operationer baserade på reguljära uttryck:

source: :func:`re.match` checks for a match only at the beginning of the string
sv: :func:`re.match` söker efter en matchning endast i början av strängen

source: :func:`re.search` checks for a match anywhere in the string (this is what Perl does by default)
sv: :func:`re.search` söker efter en träff var som helst i strängen (detta är vad Perl gör som standard)

source: :func:`re.fullmatch` checks for entire string to be a match
sv: :func:`re.fullmatch` kontrollerar att hela strängen är en matchning

source: >>> re.match("c", "abcdef") # No match >>> re.search("c", "abcdef") # Match <re.Match object; span=(2, 3), match='c'> >>> re.fullmatch("p.*n", "python") # Match <re.Match object; span=(0, 6), match='python'> >>> re.fullmatch("r.*n", "python") # No match
sv: >>> re.match("c", "abcdef") # Ingen matchning >>> re.search("c", "abcdef") # Matchning <re.match-objekt; span=(2, 3), match='c'> >>> re.fullmatch >>> re.fullmatch("p.*n", "python") # Matchning <re.match-objekt; span=(0, 6), match='python'> >>> re.fullmatch("r.*n", "python") # Ingen matchning

source: Regular expressions beginning with ``'^'`` can be used with :func:`search` to restrict the match at the beginning of the string::
sv: Reguljära uttryck som börjar med ``'^'`` kan användas med :func:`search` för att begränsa matchningen till början av strängen::

source: >>> re.match("c", "abcdef") # No match >>> re.search("^c", "abcdef") # No match >>> re.search("^a", "abcdef") # Match <re.Match object; span=(0, 1), match='a'>
sv: >>> re.match("c", "abcdef") # Ingen matchning >>> re.search("^c", "abcdef") # Ingen matchning >>> re.search("^a", "abcdef") # Matchning <re.Match-objekt; span=(0, 1), match='a'>

source: Note however that in :const:`MULTILINE` mode :func:`match` only matches at the beginning of the string, whereas using :func:`search` with a regular expression beginning with ``'^'`` will match at the beginning of each line. ::
sv: Observera dock att i :const:`MULTILINE`-läget matchar :func:`match` bara i början av strängen, medan :func:`search` med ett reguljärt uttryck som börjar med ``'^'`` matchar i början av varje rad:

source: >>> re.match("X", "A\nB\nX", re.MULTILINE) # No match >>> re.search("^X", "A\nB\nX", re.MULTILINE) # Match <re.Match object; span=(4, 5), match='X'>
sv: >>> re.match("X", "A\nB\nX", re.MULTILINE) # Ingen matchning >>> re.search("^X", "A\nB\nX", re.MULTILINE) # Matchning <re.Match-objekt; span=(4, 5), match='X'>

source: Making a Phonebook
sv: Skapa en telefonbok

source: :func:`split` splits a string into a list delimited by the passed pattern. The method is invaluable for converting textual data into data structures that can be easily read and modified by Python as demonstrated in the following example that creates a phonebook.
sv: :func:`split` delar upp en sträng i en lista som avgränsas av det passerade mönstret. Metoden är ovärderlig för att konvertera textdata till datastrukturer som lätt kan läsas och modifieras av Python, vilket visas i följande exempel som skapar en telefonbok.

source: First, here is the input. Normally it may come from a file, here we are using triple-quoted string syntax
sv: Först, här är indata. Normalt kan den komma från en fil, här använder vi trippelciterad strängsyntax

source: The entries are separated by one or more newlines. Now we convert the string into a list with each nonempty line having its own entry:
sv: Posterna är åtskilda av en eller flera nya linjer. Nu omvandlar vi strängen till en lista där varje icke-tom rad har en egen post:

source: >>> entries = re.split("\n+", text) >>> entries ['Ross McFluff: 834.345.1254 155 Elm Street', 'Ronald Heathmore: 892.345.3428 436 Finley Avenue', 'Frank Burger: 925.541.7625 662 South Dogwood Way', 'Heather Albrecht: 548.326.4584 919 Park Place']
sv: >>> poster = re.split("\n+", text) >>> poster ['Ross McFluff: 834.345.1254 155 Elm Street', "Ronald Heathmore: 892.345.3428 436 Finley Avenue', "Frank Burger: 925.541.7625 662 South Dogwood Way", "Heather Albrecht: 548.326.4584 919 Park Place"]

source: Finally, split each entry into a list with first name, last name, telephone number, and address. We use the ``maxsplit`` parameter of :func:`split` because the address has spaces, our splitting pattern, in it:
sv: Slutligen delar vi upp varje post i en lista med förnamn, efternamn, telefonnummer och adress. Vi använder parametern ``maxsplit`` i :func:`split` eftersom adressen innehåller mellanslag, vårt uppdelningsmönster:

source: >>> [re.split(":? ", entry, maxsplit=3) for entry in entries] [['Ross', 'McFluff', '834.345.1254', '155 Elm Street'], ['Ronald', 'Heathmore', '892.345.3428', '436 Finley Avenue'], ['Frank', 'Burger', '925.541.7625', '662 South Dogwood Way'], ['Heather', 'Albrecht', '548.326.4584', '919 Park Place']]
sv: >>> [re.split(":? ", post, maxsplit=3) för post i poster] [['Ross', 'McFluff', '834.345.1254', '155 Elm Street'], ['Ronald', 'Heathmore', '892.345.3428', '436 Finley Avenue'], ['Frank', 'Burger', '925.541.7625', '662 South Dogwood Way'], ['Heather', 'Albrecht', '548.326.4584', '919 Park Place']]

source: The ``:?`` pattern matches the colon after the last name, so that it does not occur in the result list. With a ``maxsplit`` of ``4``, we could separate the house number from the street name:
sv: Mönstret ``:?`` matchar kolon efter efternamnet, så att det inte förekommer i resultatlistan. Med en ``maxsplit`` på ``4`` kan vi separera husnumret från gatunamnet:

source: >>> [re.split(":? ", entry, maxsplit=4) for entry in entries] [['Ross', 'McFluff', '834.345.1254', '155', 'Elm Street'], ['Ronald', 'Heathmore', '892.345.3428', '436', 'Finley Avenue'], ['Frank', 'Burger', '925.541.7625', '662', 'South Dogwood Way'], ['Heather', 'Albrecht', '548.326.4584', '919', 'Park Place']]
sv: >>> [re.split(":? ", post, maxsplit=4) för post i poster] [['Ross', 'McFluff', '834.345.1254', '155', 'Elm Street'], ['Ronald', 'Heathmore', '892.345.3428', '436', 'Finley Avenue'], ['Frank', 'Burger', '925.541.7625', '662', 'South Dogwood Way'], ['Heather', 'Albrecht', '548.326.4584', '919', 'Park Place']]

source: :func:`sub` replaces every occurrence of a pattern with a string or the result of a function. This example demonstrates using :func:`sub` with a function to "munge" text, or randomize the order of all the characters in each word of a sentence except for the first and last characters::
sv: :func:`sub` ersätter varje förekomst av ett mönster med en sträng eller resultatet av en funktion. I det här exemplet används :func:`sub` tillsammans med en funktion för att "mjuka upp" text, dvs. slumpa fram ordningen på alla tecken i varje ord i en mening utom det första och sista tecknet::

source: >>> def repl(m): ... inner_word = list(m.group(2)) ... random.shuffle(inner_word) ... return m.group(1) + "".join(inner_word) + m.group(3) ... >>> text = "Professor Abdolmalek, please report your absences promptly." >>> re.sub(r"(\w)(\w+)(\w)", repl, text) 'Poefsrosr Aealmlobdk, pslaee reorpt your abnseces plmrptoy.' >>> re.sub(r"(\w)(\w+)(\w)", repl, text) 'Pofsroser Aodlambelk, plasee reoprt yuor asnebces potlmrpy.'
sv: >>> def repl(m): ... inner_word = list(m.group(2)) ... slumpmässig.blanda(inre_ord) ... return m.group(1) + "".join(inner_word) + m.group(3) ... >>> text = "Professor Abdolmalek, vänligen rapportera din frånvaro omgående." >>> re.sub(r"(\w)(\w+)(\w)", repl, text) "Poefsrosr Aealmlobdk, pslaee rapportera din frånvaro plmrptoy >>> re.sub(r"(\w)(\w+)(\w)", repl, text) 'Pofsroser Aodlambelk, plasee reoprt yuor asnebces potlmrpy.'

source: Finding all Adverbs
sv: Hitta alla adverb

source: :func:`findall` matches *all* occurrences of a pattern, not just the first one as :func:`search` does. For example, if a writer wanted to find all of the adverbs in some text, they might use :func:`findall` in the following manner::
sv: :func:`findall` matchar *alla* förekomster av ett mönster, inte bara den första som :func:`search` gör. Om en skribent till exempel vill hitta alla adverb i en text, kan han använda :func:`findall` på följande sätt::

source: >>> text = "He was carefully disguised but captured quickly by police." >>> re.findall(r"\w+ly\b", text) ['carefully', 'quickly']
sv: >>> text = "Han var omsorgsfullt förklädd men fångades snabbt av polisen." >>> re.findall(r"\w+ly\b", text) ['försiktigt', 'snabbt']

source: Finding all Adverbs and their Positions
sv: Hitta alla adverb och deras positioner

source: If one wants more information about all matches of a pattern than the matched text, :func:`finditer` is useful as it provides :class:`~re.Match` objects instead of strings. Continuing with the previous example, if a writer wanted to find all of the adverbs *and their positions* in some text, they would use :func:`finditer` in the following manner::
sv: Om man vill ha mer information om alla matchningar av ett mönster än den matchade texten, är :func:`finditer` användbar eftersom den tillhandahåller :class:`~re.Match`-objekt istället för strängar. Om vi fortsätter med det tidigare exemplet och en skribent vill hitta alla adverb *och deras positioner* i en text, skulle han använda :func:`finditer` på följande sätt::

source: >>> text = "He was carefully disguised but captured quickly by police." >>> for m in re.finditer(r"\w+ly\b", text): ... print('%02d-%02d: %s' % (m.start(), m.end(), m.group(0))) 07-16: carefully 40-47: quickly
sv: >>> text = "Han var omsorgsfullt förklädd men fångades snabbt av polisen." >>> for m in re.finditer(r"\w+ly\b", text): ... print('%02d-%02d: %s' % (m.start(), m.end(), m.group(0))) 07-16: försiktigt 40-47: snabbt

source: Raw String Notation
sv: Notation av råa strängar
