Repository: yeager/python-docs-sv
Catalog: library/re.po
Languages: sv

source: Raw string notation (``r"text"``) keeps regular expressions sane. Without it, every backslash (``'\'``) in a regular expression would have to be prefixed with another one to escape it. For example, the two following lines of code are functionally identical::
sv: Rå strängnotation (``r"text"``) håller reguljära uttryck sunda. Utan den skulle varje backslash (``'\'``) i ett reguljärt uttryck behöva föregås av en annan för att undkomma den. Till exempel är de två följande raderna med kod funktionellt identiska::

source: >>> re.match(r"\W(.)\1\W", " ff ") <re.Match object; span=(0, 4), match=' ff '> >>> re.match("\\W(.)\\1\\W", " ff ") <re.Match object; span=(0, 4), match=' ff '>
sv: >>> re.match(r"\W(.)\1\W", " ff ") <re.Match-objekt; span=(0, 4), match=' ff '> >>> re.match("\\W(.)\\1\\W", " ff ") <re.match-objekt; span=(0, 4), match=' ff '>

source: When one wants to match a literal backslash, it must be escaped in the regular expression. With raw string notation, this means ``r"\\"``. Without raw string notation, one must use ``"\\\\"``, making the following lines of code functionally identical::
sv: När man vill matcha en bokstavlig backslash måste den escapas i det reguljära uttrycket. Med rå strängnotation betyder detta ``r"\\"``. Utan rå strängnotation måste man använda ``"\\\\"``, vilket gör följande kodrader funktionellt identiska::

source: >>> re.match(r"\\", r"\\") <re.Match object; span=(0, 1), match='\\'> >>> re.match("\\\\", r"\\") <re.Match object; span=(0, 1), match='\\'>
sv: >>> re.match(r"\\", r"\\") <re.match-objekt; span=(0, 1), match='\\'> >>> re.match(", r"\\") >>> re.match("\\\\", r"\\") <re.match-objekt; span=(0, 1), match='\\'> >>> re.match(", r"\\")

source: Writing a Tokenizer
sv: Skriva en Tokenizer

source: A `tokenizer or scanner <https://en.wikipedia.org/wiki/Lexical_analysis>`_ analyzes a string to categorize groups of characters. This is a useful first step in writing a compiler or interpreter.
sv: En `tokenizer eller scanner <https://en.wikipedia.org/wiki/Lexical_analysis>`_ analyserar en sträng för att kategorisera grupper av tecken. Detta är ett användbart första steg i att skriva en kompilator eller tolk.

source: The text categories are specified with regular expressions. The technique is to combine those into a single master regular expression and to loop over successive matches::
sv: Textkategorierna specificeras med reguljära uttryck. Tekniken är att kombinera dessa till ett enda övergripande reguljärt uttryck och att loopa över successiva matchningar::

source: The tokenizer produces the following output::
sv: Tokenizer producerar följande utdata::

source: Token(type='IF', value='IF', line=2, column=4) Token(type='ID', value='quantity', line=2, column=7) Token(type='THEN', value='THEN', line=2, column=16) Token(type='ID', value='total', line=3, column=8) Token(type='ASSIGN', value=':=', line=3, column=14) Token(type='ID', value='total', line=3, column=17) Token(type='OP', value='+', line=3, column=23) Token(type='ID', value='price', line=3, column=25) Token(type='OP', value='*', line=3, column=31) Token(type='ID', value='quantity', line=3, column=33) Token(type='END', value=';', line=3, column=41) Token(type='ID', value='tax', line=4, column=8) Token(type='ASSIGN', value=':=', line=4, column=12) Token(type='ID', value='price', line=4, column=15) Token(type='OP', value='*', line=4, column=21) Token(type='NUMBER', value=0.05, line=4, column=23) Token(type='END', value=';', line=4, column=27) Token(type='ENDIF', value='ENDIF', line=5, column=4) Token(type='END', value=';', line=5, column=9)
sv: Token(type='IF', value='IF', rad=2, kolumn=4) Token(type='ID', value='quantity', rad=2, kolumn=7) Token(type='THEN', value='THEN', line=2, column=16) Token(typ='ID', värde='total', rad=3, kolumn=8) Token(type='ASSIGN', value=':=', line=3, column=14) Token(typ='ID', värde='total', rad=3, kolumn=17) Token(type='OP', value='+', line=3, column=23) Token(typ='ID', värde='pris', rad=3, kolumn=25) Token(typ="OP", värde="*", rad=3, kolumn=31) Token(type='ID', value='quantity', rad=3, kolumn=33) Token(type='END', value=';', line=3, column=41) Token(type='ID', value='tax', rad=4, kolumn=8) Token(type='ASSIGN', value=':=', line=4, column=12) Token(typ='ID', värde='pris', rad=4, kolumn=15) Token(type='OP', value='*', line=4, column=21) Token(typ='NUMBER', värde=0,05, rad=4, kolumn=23) Token(type='END', value=';', line=4, column=27) Token(type='ENDIF', value='ENDIF', line=5, column=4) Token(typ='END', värde=';', rad=5, kolumn=9)

source: Friedl, Jeffrey. Mastering Regular Expressions. 3rd ed., O'Reilly Media, 2009. The third edition of the book no longer covers Python at all, but the first edition covered writing good regular expression patterns in great detail.
sv: Friedl, Jeffrey. Mastering Regular Expressions. 3:e upplagan, O'Reilly Media, 2009. Den tredje upplagan av boken täcker inte längre Python alls, men den första upplagan täckte att skriva bra reguljära uttrycksmönster i stor detalj.

source: . (dot)
sv: . (punkt)

source: in regular expressions
sv: i reguljära uttryck

source: ? (question mark)
sv: ? (frågetecken)

source: {} (curly brackets)
sv: {} (inom hakparentes)

source: [] (square brackets)
sv: [] (hakparenteser)

source: | (vertical bar)
sv: | (vertikal stapel)

source: () (parentheses)
sv: () (inom parentes)

source: scanf (C function)
sv: scanf (C-funktion)
