Repository: yeager/python-docs-sv
Catalog: library/re.po
Languages: sv

source: :mod:`!re` --- Regular expression operations
sv: :mod:`!re` --- Operationer med reguljära uttryck

source: **Source code:** :source:`Lib/re/`
sv: **Källkod:** :källa:`Lib/re/`

source: This module provides regular expression matching operations similar to those found in Perl.
sv: Den här modulen innehåller funktioner för matchning med reguljära uttryck som liknar dem som finns i Perl.

source: Both patterns and strings to be searched can be Unicode strings (:class:`str`) as well as 8-bit strings (:class:`bytes`). However, Unicode strings and 8-bit strings cannot be mixed: that is, you cannot match a Unicode string with a bytes pattern or vice-versa; similarly, when asking for a substitution, the replacement string must be of the same type as both the pattern and the search string.
sv: Både mönster och strängar som ska sökas kan vara Unicode-strängar (:class:`str`) såväl som 8-bitarssträngar (:class:`bytes`). Unicode-strängar och 8-bitarssträngar kan dock inte blandas: det vill säga, du kan inte matcha en Unicode-sträng med ett bytesmönster eller vice versa; på samma sätt måste ersättningssträngen vara av samma typ som både mönstret och söksträngen när du ber om en substitution.

source: Regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This collides with Python's usage of the same character for the same purpose in string literals; for example, to match a literal backslash, one might have to write ``'\\\\'`` as the pattern string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. Also, please note that any invalid escape sequences in Python's usage of the backslash in string literals now generate a :exc:`SyntaxWarning` and in the future this will become a :exc:`SyntaxError`. This behaviour will happen even if it is a valid escape sequence for a regular expression.
sv: Reguljära uttryck använder tecknet backslash (``'\'``) för att ange speciella former eller för att tillåta att specialtecken används utan att deras speciella betydelse åberopas. Detta kolliderar med Pythons användning av samma tecken för samma ändamål i stränglitteraler; till exempel, för att matcha en bokstavlig backslash kan man behöva skriva ``'\\\\'`` som mönstersträng, eftersom det reguljära uttrycket måste vara ``\``, och varje backslash måste uttryckas som ``\\`` inuti en reguljär Python-stränglitteral. Observera också att alla ogiltiga escape-sekvenser i Pythons användning av backslash i stränglitteraler nu genererar en :exc:`SyntaxWarning` och i framtiden kommer detta att bli en :exc:`SyntaxError`. Detta beteende kommer att ske även om det är en giltig escape-sekvens för ett reguljärt uttryck.

source: The solution is to use Python's raw string notation for regular expression patterns; backslashes are not handled in any special way in a string literal prefixed with ``'r'``. So ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Usually patterns will be expressed in Python code using this raw string notation.
sv: Lösningen är att använda Pythons råa strängnotation för reguljära uttrycksmönster; backslash hanteras inte på något speciellt sätt i en stränglitual med prefixet ``'r'``. Så ``r"\n"`` är en tvåteckenssträng som innehåller ``'\'`` och ``'n'``, medan ``"\n"`` är en enteckenssträng som innehåller en ny rad. Vanligtvis kommer mönster att uttryckas i Python-kod med hjälp av denna råa strängnotation.

source: It is important to note that most regular expression operations are available as module-level functions and methods on :ref:`compiled regular expressions <re-objects>`. The functions are shortcuts that don't require you to compile a regex object first, but miss some fine-tuning parameters.
sv: Det är viktigt att notera att de flesta operationer med reguljära uttryck finns tillgängliga som funktioner och metoder på modulnivå på :ref:``compiled regular expressions <re-objects>``. Funktionerna är genvägar som inte kräver att du först kompilerar ett regex-objekt, men saknar vissa finjusteringsparametrar.

source: The third-party :pypi:`regex` module, which has an API compatible with the standard library :mod:`re` module, but offers additional functionality and a more thorough Unicode support.
sv: Tredjepartsmodulen :pypi:`regex`, som har ett API som är kompatibelt med standardbibliotekets modul :mod:`re`, men som erbjuder ytterligare funktionalitet och ett mer omfattande Unicode-stöd.

source: Regular Expression Syntax
sv: Syntax för reguljära uttryck

source: A regular expression (or RE) specifies a set of strings that matches it; the functions in this module let you check if a particular string matches a given regular expression (or if a given regular expression matches a particular string, which comes down to the same thing).
sv: Ett reguljärt uttryck (eller RE) anger en uppsättning strängar som matchar det; med funktionerna i den här modulen kan du kontrollera om en viss sträng matchar ett visst reguljärt uttryck (eller om ett visst reguljärt uttryck matchar en viss sträng, vilket är samma sak).

source: Regular expressions can be concatenated to form new regular expressions; if *A* and *B* are both regular expressions, then *AB* is also a regular expression. In general, if a string *p* matches *A* and another string *q* matches *B*, the string *pq* will match AB. This holds unless *A* or *B* contain low precedence operations; boundary conditions between *A* and *B*; or have numbered group references. Thus, complex expressions can easily be constructed from simpler primitive expressions like the ones described here. For details of the theory and implementation of regular expressions, consult the Friedl book [Frie09]_, or almost any textbook about compiler construction.
sv: Reguljära uttryck kan sammankopplas för att bilda nya reguljära uttryck; om *A* och *B* båda är reguljära uttryck, är *AB* också ett reguljärt uttryck. I allmänhet gäller att om en sträng *p* matchar *A* och en annan sträng *q* matchar *B*, kommer strängen *pq* att matcha AB. Detta gäller om inte *A* eller *B* innehåller operationer med låg prioritet, gränsvillkor mellan *A* och *B* eller har numrerade gruppreferenser. Komplexa uttryck kan alltså lätt konstrueras från enklare primitiva uttryck som de som beskrivs här. För detaljer om teorin och implementeringen av reguljära uttryck, se Friedls bok [Frie09]_, eller nästan vilken lärobok som helst om kompilatorkonstruktion.

source: A brief explanation of the format of regular expressions follows. For further information and a gentler presentation, consult the :ref:`regex-howto`.
sv: Här följer en kort förklaring av formatet för reguljära uttryck. För ytterligare information och en mildare presentation, se :ref:`regex-howto`.

source: Regular expressions can contain both special and ordinary characters. Most ordinary characters, like ``'A'``, ``'a'``, or ``'0'``, are the simplest regular expressions; they simply match themselves. You can concatenate ordinary characters, so ``last`` matches the string ``'last'``. (In the rest of this section, we'll write RE's in ``this special style``, usually without quotes, and strings to be matched ``'in single quotes'``.)
sv: Reguljära uttryck kan innehålla både specialtecken och vanliga tecken. De flesta vanliga tecken, som ``'A'``, ``'a'`` eller ``'0'``, är de enklaste reguljära uttrycken; de matchar helt enkelt sig själva. Du kan konkatenera vanliga tecken, så att ``last`` matchar strängen ``'last'``. (I resten av det här avsnittet skriver vi RE:s med ``den här speciella stilen``, vanligtvis utan citationstecken, och strängar som ska matchas ``'med enkla citationstecken``)

source: Some characters, like ``'|'`` or ``'('``, are special. Special characters either stand for classes of ordinary characters, or affect how the regular expressions around them are interpreted.
sv: Vissa tecken, som ``'|'`` eller ``'('``, är specialtecken. Specialtecken står antingen för klasser av vanliga tecken eller påverkar hur de reguljära uttryck som omger dem tolkas.

source: Repetition operators or quantifiers (``*``, ``+``, ``?``, ``{m,n}``, etc) cannot be directly nested. This avoids ambiguity with the non-greedy modifier suffix ``?``, and with other modifiers in other implementations. To apply a second repetition to an inner repetition, parentheses may be used. For example, the expression ``(?:a{6})*`` matches any multiple of six ``'a'`` characters.
sv: Repetitionsoperatorer eller kvantifierare (``*``, ``+``, ``?``, ``{m,n}``, etc) kan inte direkt nästlas. Detta undviker tvetydighet med det icke-greedy modifieringssuffixet ``?``, och med andra modifierare i andra implementeringar. För att tillämpa en andra upprepning på en inre upprepning kan parenteser användas. Till exempel matchar uttrycket ``(?:a{6})*`` alla multiplar av sex ``'a'``-tecken.

source: The special characters are:
sv: Specialtecknen är följande:

source: (Dot.) In the default mode, this matches any character except a newline. If the :const:`DOTALL` flag has been specified, this matches any character including a newline. ``(?s:.)`` matches any character regardless of flags.
sv: (Punkt.) I standardläget matchar detta alla tecken utom en ny rad. Om flaggan :const:`DOTALL` har angetts, matchar detta alla tecken inklusive en ny rad. ``(?s:.)`` matchar alla tecken oavsett flaggor.

source: (Caret.) Matches the start of the string, and in :const:`MULTILINE` mode also matches immediately after each newline.
sv: (Caret.) Matchar början av strängen, och i :const:`MULTILINE`-läget även omedelbart efter varje ny rad.

source: Matches the end of the string or just before the newline at the end of the string, and in :const:`MULTILINE` mode also matches before a newline. ``foo`` matches both 'foo' and 'foobar', while the regular expression ``foo$`` matches only 'foo'. More interestingly, searching for ``foo.$`` in ``'foo1\nfoo2\n'`` matches 'foo2' normally, but 'foo1' in :const:`MULTILINE` mode; searching for a single ``$`` in ``'foo\n'`` will find two (empty) matches: one just before the newline, and one at the end of the string.
sv: Matchar slutet av strängen eller precis före den nya raden i slutet av strängen, och i :const:`MULTILINE`-läget även före en ny rad. ``foo`` matchar både 'foo' och 'foobar', medan det reguljära uttrycket ``foo$`` endast matchar 'foo'. Mer intressant är att en sökning efter ``foo.$`` i ``'foo1\nfoo2\n'`` normalt matchar 'foo2', men 'foo1' i :const:`MULTILINE`-läget; en sökning efter en enda ``$`` i ``'foo\n'`` kommer att hitta två (tomma) träffar: en precis före det nya strecket och en i slutet av strängen.

source: Causes the resulting RE to match 0 or more repetitions of the preceding RE, as many repetitions as are possible. ``ab*`` will match 'a', 'ab', or 'a' followed by any number of 'b's.
sv: Gör att den resulterande RE:n matchar 0 eller flera upprepningar av den föregående RE:n, så många upprepningar som möjligt. ``ab*`` matchar 'a', 'ab' eller 'a' följt av ett valfritt antal 'b'.

source: Causes the resulting RE to match 1 or more repetitions of the preceding RE. ``ab+`` will match 'a' followed by any non-zero number of 'b's; it will not match just 'a'.
sv: Gör att den resulterande RE:n matchar 1 eller flera upprepningar av den föregående RE:n. ``ab+`` kommer att matcha 'a' följt av ett valfritt antal 'b' som inte är noll; det kommer inte att matcha bara 'a'.

source: Causes the resulting RE to match 0 or 1 repetitions of the preceding RE. ``ab?`` will match either 'a' or 'ab'.
sv: Gör att den resulterande RE:n matchar 0 eller 1 upprepningar av den föregående RE:n. ``ab?`` kommer att matcha antingen 'a' eller 'ab'.

source: The ``'*'``, ``'+'``, and ``'?'`` quantifiers are all :dfn:`greedy`; they match as much text as possible. Sometimes this behaviour isn't desired; if the RE ``<.*>`` is matched against ``'<a> b <c>'``, it will match the entire string, and not just ``'<a>'``. Adding ``?`` after the quantifier makes it perform the match in :dfn:`non-greedy` or :dfn:`minimal` fashion; as *few* characters as possible will be matched. Using the RE ``<.*?>`` will match only ``'<a>'``.
sv: Kvantifierarna ``'*'``, ``'+'`` och ``'?'`` är alla :dfn:`greedy`; de matchar så mycket text som möjligt. Ibland är detta beteende inte önskvärt; om RE ``<.*>`` matchas mot ``'<a> b <c>'``, kommer den att matcha hela strängen, och inte bara ``'<a>'``. Om du lägger till ``?`` efter kvantifieraren kommer den att utföra matchningen på :dfn:`non-greedy` eller :dfn:`minimal` sätt; så *få* tecken som möjligt kommer att matchas. Om RE ``<.*?>`` används kommer endast ``'<a>'`` att matchas.

source: Like the ``'*'``, ``'+'``, and ``'?'`` quantifiers, those where ``'+'`` is appended also match as many times as possible. However, unlike the true greedy quantifiers, these do not allow back-tracking when the expression following it fails to match. These are known as :dfn:`possessive` quantifiers. For example, ``a*a`` will match ``'aaaa'`` because the ``a*`` will match all 4 ``'a'``\ s, but, when the final ``'a'`` is encountered, the expression is backtracked so that in the end the ``a*`` ends up matching 3 ``'a'``\ s total, and the fourth ``'a'`` is matched by the final ``'a'``. However, when ``a*+a`` is used to match ``'aaaa'``, the ``a*+`` will match all 4 ``'a'``, but when the final ``'a'`` fails to find any more characters to match, the expression cannot be backtracked and will thus fail to match. ``x*+``, ``x++`` and ``x?+`` are equivalent to ``(?>x*)``, ``(?>x+)`` and ``(?>x?)`` correspondingly.
sv: Liksom kvantifierarna ``'*'``, ``'+'`` och ``'?'`` matchar de där ``'+'`` är tillagt också så många gånger som möjligt. Men till skillnad från de riktiga greedy-kvantifierarna tillåter dessa inte backspårning när uttrycket efter det inte matchar. Dessa är kända som :dfn:`possessiva` kvantifierare. Till exempel kommer ``a*a`` att matcha ``'aaaa'`` eftersom ``a*`` kommer att matcha alla 4 ``'a'`` s, men när den sista ``'a'`` påträffas, spåras uttrycket tillbaka så att ``a*`` i slutändan matchar 3 ``'a'`` s totalt, och den fjärde ``'a'`` matchas av den sista ``'a'``. Men när ``a*+a`` används för att matcha ``'aaaa'`` kommer ``a*+`` att matcha alla fyra ``'a'``, men när den sista ``'a'`` inte hittar några fler tecken att matcha kan uttrycket inte spåras tillbaka och kommer därför inte att matcha. ``x*+``, ``x++`` och ``x?+`` är likvärdiga med ``(?>x*)``, ``(?>x+)`` och ``(?>x?)`` på motsvarande sätt.

source: Specifies that exactly *m* copies of the previous RE should be matched; fewer matches cause the entire RE not to match. For example, ``a{6}`` will match exactly six ``'a'`` characters, but not five.
sv: Anger att exakt *m* kopior av föregående RE ska matchas; färre matchningar gör att hela RE inte matchas. Till exempel kommer ``a{6}`` att matcha exakt sex ``'a'``-tecken, men inte fem.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as many repetitions as possible. For example, ``a{3,5}`` will match from 3 to 5 ``'a'`` characters. Omitting *m* specifies a lower bound of zero, and omitting *n* specifies an infinite upper bound. As an example, ``a{4,}b`` will match ``'aaaab'`` or a thousand ``'a'`` characters followed by a ``'b'``, but not ``'aaab'``. The comma may not be omitted or the modifier would be confused with the previously described form.
sv: Gör att den resulterande RE:n matchar från *m* till *n* upprepningar av den föregående RE:n, med försök att matcha så många upprepningar som möjligt. Exempelvis kommer ``a{3,5}`` att matcha mellan 3 och 5 ``'a'``-tecken. Om *m* utelämnas anges en nedre gräns på noll, och om *n* utelämnas anges en oändlig övre gräns. Som ett exempel kommer ``a{4,}b`` att matcha ``'aaaab'`` eller tusen ``'a'``-tecken följt av ett ``'b'``, men inte ``'aaab'``. Kommatecknet får inte utelämnas, eftersom modifieraren då skulle förväxlas med den tidigare beskrivna formen.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as *few* repetitions as possible. This is the non-greedy version of the previous quantifier. For example, on the 6-character string ``'aaaaaa'``, ``a{3,5}`` will match 5 ``'a'`` characters, while ``a{3,5}?`` will only match 3 characters.
sv: Gör att den resulterande RE:n matchar från *m* till *n* repetitioner av föregående RE, med försök att matcha så *få* repetitioner som möjligt. Detta är den icke-grådiga versionen av den föregående kvantifieraren. Till exempel, på strängen ``'aaaaaa'`` med 6 tecken kommer ``a{3,5}`` att matcha 5 ``'a'``-tecken, medan ``a{3,5}?`` endast kommer att matcha 3 tecken.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as many repetitions as possible *without* establishing any backtracking points. This is the possessive version of the quantifier above. For example, on the 6-character string ``'aaaaaa'``, ``a{3,5}+aa`` attempt to match 5 ``'a'`` characters, then, requiring 2 more ``'a'``\ s, will need more characters than available and thus fail, while ``a{3,5}aa`` will match with ``a{3,5}`` capturing 5, then 4 ``'a'``\ s by backtracking and then the final 2 ``'a'``\ s are matched by the final ``aa`` in the pattern. ``x{m,n}+`` is equivalent to ``(?>x{m,n})``.
sv: Gör att den resulterande RE:n matchar från *m* till *n* upprepningar av föregående RE, med försök att matcha så många upprepningar som möjligt *utan* att skapa några backtracking-punkter. Detta är den possessiva versionen av kvantifieraren ovan. Till exempel, på strängen ``'aaaaaa'`` med 6 tecken, försöker ``a{3,5}+aa`` matcha 5 ``'a'``-tecken, sedan, när ytterligare 2 ``'a'``-tecken krävs, behöver fler tecken än tillgängliga och misslyckas därför, medan ``a{3,5}aa`` kommer att matcha med ``a{3,5}`` som fångar 5, sedan 4 ``'a'``-tecken genom backtracking och sedan matchas de sista 2 ``'a'``-tecken av den sista ``aa`` i mönstret. ``x{m,n}+`` är likvärdigt med ``(?>x{m,n})``.

source: Either escapes special characters (permitting you to match characters like ``'*'``, ``'?'``, and so forth), or signals a special sequence; special sequences are discussed below.
sv: Antingen undviker du specialtecken (så att du kan matcha tecken som ``'*'``, ``'?'`` osv.) eller så signalerar du en specialsekvens; specialsekvenser diskuteras nedan.

source: If you're not using a raw string to express the pattern, remember that Python also uses the backslash as an escape sequence in string literals; if the escape sequence isn't recognized by Python's parser, the backslash and subsequent character are included in the resulting string. However, if Python would recognize the resulting sequence, the backslash should be repeated twice. This is complicated and hard to understand, so it's highly recommended that you use raw strings for all but the simplest expressions.
sv: Om du inte använder en rå sträng för att uttrycka mönstret, kom ihåg att Python också använder backslash som en escape-sekvens i stränglitteraler; om escape-sekvensen inte känns igen av Pythons parser, inkluderas backslash och efterföljande tecken i den resulterande strängen. Men om Python skulle känna igen den resulterande sekvensen, bör backslash upprepas två gånger. Det här är komplicerat och svårt att förstå, så det rekommenderas starkt att du använder råa strängar för alla utom de enklaste uttrycken.

source: Used to indicate a set of characters. In a set:
sv: Används för att ange en uppsättning tecken. I en uppsättning:

source: Characters can be listed individually, e.g. ``[amk]`` will match ``'a'``, ``'m'``, or ``'k'``.
sv: Tecken kan listas individuellt, t.ex. kommer ``[amk]`` att matcha ``'a'``, ``'m'`` eller ``'k'``.

source: Ranges of characters can be indicated by giving two characters and separating them by a ``'-'``, for example ``[a-z]`` will match any lowercase ASCII letter, ``[0-5][0-9]`` will match all the two-digits numbers from ``00`` to ``59``, and ``[0-9A-Fa-f]`` will match any hexadecimal digit. If ``-`` is escaped (e.g. ``[a\-z]``) or if it's placed as the first or last character (e.g. ``[-a]`` or ``[a-]``), it will match a literal ``'-'``.
sv: Teckenintervall kan anges genom att ange två tecken och separera dem med ``'-'``, t.ex. ``[a-z]`` matchar alla gemena ASCII-bokstäver, ``[0-5][0-9]`` matchar alla tvåsiffriga tal från ``00`` till ``59`` och ``[0-9A-Fa-f]`` matchar alla hexadecimala siffror. Om ``-`` är escapat (t.ex. ``[a\-z]``) eller om det placeras som första eller sista tecken (t.ex. ``[-a]`` eller ``[a-]``), kommer det att matcha ett bokstavligt ``'-'``.

source: Special characters except backslash lose their special meaning inside sets. For example, ``[(+*)]`` will match any of the literal characters ``'('``, ``'+'``, ``'*'``, or ``')'``.
sv: Specialtecken utom backslash förlorar sin speciella betydelse i uppsättningar. Till exempel kommer ``[(+*)]`` att matcha vilket som helst av de bokstavliga tecknen ``'('``, ``'+'``, ``'*'`` eller ``')'``.

source: Backslash either escapes characters which have special meaning in a set such as ``'-'``, ``']'``, ``'^'`` and ``'\\'`` itself or signals a special sequence which represents a single character such as ``\xa0`` or ``\n`` or a character class such as ``\w`` or ``\S`` (defined below). Note that ``\b`` represents a single "backspace" character, not a word boundary as outside a set, and numeric escapes such as ``\1`` are always octal escapes, not group references. Special sequences which do not match a single character such as ``\A`` and ``\z`` are not allowed.
sv: Backslash escapar antingen tecken som har en speciell betydelse i en uppsättning, t.ex. ``'-'``, ``']'``, ``'^'`` och ``'\\'``, eller signalerar en speciell sekvens som representerar ett enskilt tecken, t.ex. ``xa0`` eller ``n``, eller en teckenklass, t.ex. ``w`` eller ``S`` (definieras nedan). Observera att ``b`` representerar ett enskilt "backspace"-tecken, inte en ordgräns utanför en uppsättning, och numeriska escapes som ``1`` är alltid oktala escapes, inte gruppreferenser. Specialsekvenser som inte matchar ett enda tecken, t.ex. ``A`` och ``z``, är inte tillåtna.

source: Characters that are not within a range can be matched by :dfn:`complementing` the set. If the first character of the set is ``'^'``, all the characters that are *not* in the set will be matched. For example, ``[^5]`` will match any character except ``'5'``, and ``[^^]`` will match any character except ``'^'``. ``^`` has no special meaning if it's not the first character in the set.
sv: Tecken som inte finns inom ett intervall kan matchas genom att :dfn:`komplettera` uppsättningen. Om det första tecknet i uppsättningen är ``'^'`` kommer alla tecken som *inte* finns i uppsättningen att matchas. Till exempel kommer ``[^5]`` att matcha alla tecken utom ``'5'``, och ``[^^]`` kommer att matcha alla tecken utom ``'^'``. ``^`` har ingen speciell betydelse om det inte är det första tecknet i uppsättningen.

source: To match a literal ``']'`` inside a set, precede it with a backslash, or place it at the beginning of the set. For example, both ``[()[\]{}]`` and ``[]()[{}]`` will match a right bracket, as well as left bracket, braces, and parentheses.
sv: För att matcha en bokstavlig ``']'`` inuti en uppsättning, föregå den med ett backslash eller placera den i början av uppsättningen. Till exempel kommer både ``[()[\]{}]`` och ``[]()[{}]`` att matcha en högerparentes såväl som vänsterparenteser, hakparenteser och parenteser.
