Repository: yeager/python-docs-sv
Catalog: library/re.po
Languages: sv

source: Return the string obtained by replacing the leftmost non-overlapping occurrences of *pattern* in *string* by the replacement *repl*. If the pattern isn't found, *string* is returned unchanged. *repl* can be a string or a function; if it is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes of ASCII letters are reserved for future use and treated as errors. Other unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by group 6 in the pattern. For example::
sv: Returnerar strängen som erhålls genom att ersätta de längst till vänster liggande icke överlappande förekomsterna av *mönster* i *sträng* med ersättningen *repl*. Om mönstret inte hittas returneras *sträng* oförändrad. *repl* kan vara en sträng eller en funktion; om det är en sträng behandlas alla backslash-escapes i den. Det innebär att ``\n`` konverteras till ett enda ny rad-tecken, ``r`` konverteras till en vagnsretur och så vidare. Okända escapes av ASCII-bokstäver reserveras för framtida användning och behandlas som fel. Andra okända escapetecken som ``&`` lämnas därhän. Bakreferenser, t.ex. ``\6``, ersätts med den delsträng som matchas av grupp 6 i mönstret. Till exempel::

source: >>> re.sub(r'def\s+([a-zA-Z_][a-zA-Z_0-9]*)\s*\(\s*\):', ... r'static PyObject*\npy_\1(void)\n{', ... 'def myfunc():') 'static PyObject*\npy_myfunc(void)\n{'
sv: >>> re.sub(r'def\s+([a-zA-Z_][a-zA-Z_0-9]*)\s*\(\s*\):', ... r'statiskt PyObject*\npy_\1(void)\n{', ... 'def myfunc():') 'statisk PyObject*\npy_myfunc(void)\n{'

source: If *repl* is a function, it is called for every non-overlapping occurrence of *pattern*. The function takes a single :class:`~re.Match` argument, and returns the replacement string. For example::
sv: Om *repl* är en funktion anropas den för varje icke-överlappande förekomst av *pattern*. Funktionen tar ett enda :class:`~re.Match`-argument och returnerar ersättningssträngen. Till exempel::

source: >>> def dashrepl(matchobj): ... if matchobj.group(0) == '-': return ' ' ... else: return '-' ... >>> re.sub('-{1,2}', dashrepl, 'pro----gram-files') 'pro--gram files' >>> re.sub(r'\sAND\s', ' & ', 'Baked Beans And Spam', flags=re.IGNORECASE) 'Baked Beans & Spam'
sv: >>> def dashrepl(matchobj): ... if matchobj.group(0) == '-': return ' ' ... annars: returnera '-' ... >>> re.sub('-{1,2}', dashrepl, 'pro----gram-filer') 'pro--programfiler' >>> re.sub(r'\sAND\s', ' & ', 'Bakade bönor och skräppost', flags=re.IGNORECASE) 'Bakade bönor och skräp'

source: The pattern may be a string or a :class:`~re.Pattern`.
sv: Mönstret kan vara en sträng eller en :class:`~re.Pattern`.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. If omitted or zero, all occurrences will be replaced.
sv: Det valfria argumentet *count* är det maximala antalet mönsterförekomster som ska ersättas; *count* måste vara ett icke-negativt heltal. Om det utelämnas eller är noll kommer alla förekomster att ersättas.

source: Adjacent empty matches are not possible, but an empty match can occur immediately after a non-empty match. As a result, ``sub('x*', '-', 'abxd')`` returns ``'-a-b--d-'`` instead of ``'-a-b-d-'``.
sv: Intilliggande tomma matchningar är inte möjliga, men en tom matchning kan inträffa omedelbart efter en icke-tom matchning. Därför returnerar ``sub('x*', '-', 'abxd')`` ``'-a-b--d-'`` i stället för ``'-a-b-d-'``.

source: In string-type *repl* arguments, in addition to the character escapes and backreferences described above, ``\g<name>`` will use the substring matched by the group named ``name``, as defined by the ``(?P<name>...)`` syntax. ``\g<number>`` uses the corresponding group number; ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement such as ``\g<2>0``. ``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``. The backreference ``\g<0>`` substitutes in the entire substring matched by the RE.
sv: I *repl*-argument av strängtyp, utöver de teckenundantag och bakåtreferenser som beskrivs ovan, kommer ``g<name>`` att använda den delsträng som matchas av gruppen med namnet ``namn``, enligt definitionen i syntaxen ``(?P<name>...)``. ``\g<number>`` använder motsvarande gruppnummer; ``g<2>`` är därför likvärdigt med ``2``, men är inte tvetydigt i en ersättning som ``g<2>0``. ``20`` skulle tolkas som en referens till grupp 20, inte en referens till grupp 2 följt av det bokstavliga tecknet ``'0'``. Bakreferensen ``\g<0>`` ersätter hela den delsträng som matchas av RE.

source: Unmatched groups are replaced with an empty string.
sv: Omatchade grupper ersätts med en tom sträng.

source: Unknown escapes in *pattern* consisting of ``'\'`` and an ASCII letter now are errors.
sv: Okända escapes i *mönster* som består av ``'\'``` och en ASCII-bokstav är nu fel.

source: Unknown escapes in *repl* consisting of ``'\'`` and an ASCII letter now are errors. An empty match can occur immediately after a non-empty match.
sv: Okända escapes i *repl* som består av ``'\'`` och en ASCII-bokstav är nu fel. En tom matchning kan inträffa omedelbart efter en icke-tom matchning.

source: Group *id* can only contain ASCII digits. In :class:`bytes` replacement strings, group *name* can only contain bytes in the ASCII range (``b'\x00'``-``b'\x7f'``).
sv: Grupp *id* kan bara innehålla ASCII-siffror. I :class:`bytes` ersättningssträngar kan grupp *name* endast innehålla bytes i ASCII-intervallet (``b'\x00'``-``b'\x7f'``).

source: Passing *count* and *flags* as positional arguments is deprecated. In future Python versions they will be :ref:`keyword-only parameters <keyword-only_parameter>`.
sv: Att skicka *count* och *flags* som positionella argument är föråldrat. I framtida Python-versioner kommer de att vara :ref:`keyword-only parameters <keyword-only_parameter>`.

source: Perform the same operation as :func:`sub`, but return a tuple ``(new_string, number_of_subs_made)``.
sv: Utför samma operation som :func:`sub`, men returnerar en tupel ``(new_string, number_of_subs_made)``.

source: Escape special characters in *pattern*. This is useful if you want to match an arbitrary literal string that may have regular expression metacharacters in it. For example::
sv: Undvik specialtecken i *mönster*. Detta är användbart om du vill matcha en godtycklig bokstavlig sträng som kan innehålla metatecken för reguljära uttryck. Till exempel::

source: >>> print(re.escape('https://www.python.org')) https://www\.python\.org >>> legal_chars = string.ascii_lowercase + string.digits + "!#$%&'*+-.^_`|~:" >>> print('[%s]+' % re.escape(legal_chars)) [abcdefghijklmnopqrstuvwxyz0123456789!\#\$%\&'\*\+\-\.\^_`\|\~:]+ >>> operators = ['+', '-', '*', '/', '**'] >>> print('|'.join(map(re.escape, sorted(operators, reverse=True)))) /|\-|\+|\*\*|\*
sv: >>> print(re.escape('https://www.python.org')) https://www\.python\.org >>> legal_chars = sträng.ascii_lågbokstav + sträng.siffror + "!#$%&'*+-.^_`|~:" >>> print('[%s]+' % re.escape(legal_chars)) [abcdefghijklmnopqrstuvwxyz0123456789!\#\$%\&'\*\+\-\.\^_`\|\~:]+ >>> operatorer = ['+', '-', '*', '/', '**'] >>> print('|'.join(map(re.escape, sorted(operators, reverse=True)))) /|\-|\+|\*\*|\*

source: This function must not be used for the replacement string in :func:`sub` and :func:`subn`, only backslashes should be escaped. For example::
sv: Denna funktion får inte användas för ersättningssträngen i :func:`sub` och :func:`subn`, endast backslashes ska escapas. Till exempel::

source: >>> digits_re = r'\d+' >>> sample = '/usr/sbin/sendmail - 0 errors, 12 warnings' >>> print(re.sub(digits_re, digits_re.replace('\\', r'\\'), sample)) /usr/sbin/sendmail - \d+ errors, \d+ warnings
sv: >>> siffror_re = r'\d+' >>> exempel = '/usr/sbin/sendmail - 0 fel, 12 varningar' >>> print(re.sub(digits_re, digits_re.replace('\\', r'\\'), sample)) /usr/sbin/sendmail - \d+ fel, \d+ varningar

source: The ``'_'`` character is no longer escaped.
sv: Tecknet ``'_'`` är inte längre escapat.

source: Only characters that can have special meaning in a regular expression are escaped. As a result, ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'``, and ``"`"`` are no longer escaped.
sv: Endast tecken som kan ha en speciell betydelse i ett reguljärt uttryck escapas. Därför undviks inte längre ``'!'``, ``'"'``, ``'%'``, ``"''``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'`` och ``"`"``.

source: Clear the regular expression cache.
sv: Rensa cacheminnet för reguljära uttryck.

source: Exceptions
sv: Undantag

source: Exception raised when a string passed to one of the functions here is not a valid regular expression (for example, it might contain unmatched parentheses) or when some other error occurs during compilation or matching. It is never an error if a string contains no match for a pattern. The ``PatternError`` instance has the following additional attributes:
sv: Undantag som uppstår när en sträng som skickas till en av funktionerna här inte är ett giltigt reguljärt uttryck (det kan t.ex. innehålla parenteser som inte matchar) eller när något annat fel uppstår under kompilering eller matchning. Det är aldrig ett fel om en sträng inte innehåller någon matchning för ett mönster. Instansen ``PatternError`` har följande ytterligare attribut:

source: The unformatted error message.
sv: Det oformaterade felmeddelandet.

source: The regular expression pattern.
sv: Det reguljära uttrycksmönstret.

source: The index in *pattern* where compilation failed (may be ``None``).
sv: Indexet i *mönster* där kompileringen misslyckades (kan vara ``None``).

source: The line corresponding to *pos* (may be ``None``).
sv: Den rad som motsvarar *pos* (kan vara ``None``).

source: The column corresponding to *pos* (may be ``None``).
sv: Den kolumn som motsvarar *pos* (kan vara ``None``).

source: Added additional attributes.
sv: Lagt till ytterligare attribut.

source: ``PatternError`` was originally named ``error``; the latter is kept as an alias for backward compatibility.
sv: ``PatternError`` hette ursprungligen ``error``; det senare behålls som ett alias för bakåtkompatibilitet.

source: Regular Expression Objects
sv: Objekt för reguljära uttryck

source: Compiled regular expression object returned by :func:`re.compile`.
sv: Kompilerat objekt för reguljära uttryck som returneras av :func:`re.compile`.

source: :py:class:`re.Pattern` supports ``[]`` to indicate a Unicode (str) or bytes pattern. See :ref:`types-genericalias`.
sv: :py:class:`re.Pattern` stöder ``[]`` för att ange ett Unicode- (str) eller bytesmönster. Se :ref:`types-genericalias`.

source: Scan through *string* looking for the first location where this regular expression produces a match, and return a corresponding :class:`~re.Match`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
sv: Skanna igenom *sträng* och leta efter den första platsen där detta reguljära uttryck ger en träff, och returnera en motsvarande :class:`~re.Match`. Returnerar ``None`` om ingen position i strängen matchar mönstret; observera att detta skiljer sig från att hitta en noll-längdsmatchning någonstans i strängen.

source: The optional second parameter *pos* gives an index in the string where the search is to start; it defaults to ``0``. This is not completely equivalent to slicing the string; the ``'^'`` pattern character matches at the real beginning of the string and at positions just after a newline, but not necessarily at the index where the search is to start.
sv: Den valfria andra parametern *pos* anger ett index i strängen där sökningen ska börja; standardvärdet är ``0``. Detta är inte helt likvärdigt med att skära upp strängen; mönsterstecknet ``'^'`` matchar i strängens verkliga början och vid positioner strax efter en ny rad, men inte nödvändigtvis vid det index där sökningen ska börja.

source: The optional parameter *endpos* limits how far the string will be searched; it will be as if the string is *endpos* characters long, so only the characters from *pos* to ``endpos - 1`` will be searched for a match. If *endpos* is less than *pos*, no match will be found; otherwise, if *rx* is a compiled regular expression object, ``rx.search(string, 0, 50)`` is equivalent to ``rx.search(string[:50], 0)``. ::
sv: Den valfria parametern *endpos* begränsar hur långt strängen kommer att sökas; det kommer att vara som om strängen är *endpos* tecken lång, så endast tecknen från *pos* till ``endpos - 1`` kommer att sökas efter en matchning. Om *endpos* är mindre än *pos* kommer ingen matchning att hittas; annars, om *rx* är ett kompilerat objekt för reguljära uttryck, är ``rx.search(string, 0, 50)`` likvärdigt med ``rx.search(string[:50], 0)``. ::

source: >>> pattern = re.compile("d") >>> pattern.search("dog") # Match at index 0 <re.Match object; span=(0, 1), match='d'> >>> pattern.search("dog", 1) # No match; search doesn't include the "d"
sv: >>> mönster = re.compile("d") >>> pattern.search("hund") # Matchning vid index 0 <re.Match-objekt; span=(0, 1), match='d'> >>> pattern.search("dog", 1) # Ingen matchning; sökningen inkluderar inte "d"

source: If zero or more characters at the *beginning* of *string* match this regular expression, return a corresponding :class:`~re.Match`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
sv: Om noll eller fler tecken i *början* av *sträng* matchar detta reguljära uttryck, returneras en motsvarande :class:`~re.Match`. Returnerar ``None`` om strängen inte matchar mönstret; observera att detta skiljer sig från en noll-längdsmatchning.

source: The optional *pos* and *endpos* parameters have the same meaning as for the :meth:`~Pattern.search` method. ::
sv: De valfria parametrarna *pos* och *endpos* har samma betydelse som för metoden :meth:`~Pattern.search`. ::

source: >>> pattern = re.compile("o") >>> pattern.match("dog") # No match as "o" is not at the start of "dog". >>> pattern.match("dog", 1) # Match as "o" is the 2nd character of "dog". <re.Match object; span=(1, 2), match='o'>
sv: >>> mönster = re.compile("o") >>> pattern.match("dog") # Ingen matchning eftersom "o" inte är i början av "dog". >>> pattern.match("dog", 1) # Matchning eftersom "o" är det 2:a tecknet i "dog". <re.Match-objekt; span=(1, 2), match='o'>

source: If you want to locate a match anywhere in *string*, use :meth:`~Pattern.search` instead (see also :ref:`search-vs-match`).
sv: Om du vill hitta en matchning var som helst i *sträng*, använd :meth:`~Pattern.search` istället (se även :ref:`search-vs-match`).

source: If the whole *string* matches this regular expression, return a corresponding :class:`~re.Match`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
sv: Om hela *strängen* matchar detta reguljära uttryck, returneras en motsvarande :class:`~re.Match`. Returnerar ``None`` om strängen inte matchar mönstret; notera att detta skiljer sig från en noll-längdsmatchning.

source: >>> pattern = re.compile("o[gh]") >>> pattern.fullmatch("dog") # No match as "o" is not at the start of "dog". >>> pattern.fullmatch("ogre") # No match as not the full string matches. >>> pattern.fullmatch("doggie", 1, 3) # Matches within given limits. <re.Match object; span=(1, 3), match='og'>
sv: >>> mönster = re.compile("o[gh]") >>> pattern.fullmatch("dog") # Ingen matchning eftersom "o" inte är i början av "dog". >>> pattern.fullmatch("ogre") # Ingen matchning eftersom inte hela strängen matchar. >>> pattern.fullmatch("doggie", 1, 3) # Träffar inom givna gränser. <re.Match-objekt; span=(1, 3), match='og'>

source: Identical to the :func:`split` function, using the compiled pattern.
sv: Identisk med funktionen :func:`split`, men med det kompilerade mönstret.

source: Similar to the :func:`findall` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
sv: Liknar funktionen :func:`findall`, använder det kompilerade mönstret, men accepterar också valfria parametrar *pos* och *endpos* som begränsar sökregionen som för :meth:`search`.

source: Similar to the :func:`finditer` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
sv: Liknar funktionen :func:`finditer`, använder det kompilerade mönstret, men accepterar också valfria parametrar *pos* och *endpos* som begränsar sökregionen som för :meth:`search`.

source: Identical to the :func:`sub` function, using the compiled pattern.
sv: Identisk med funktionen :func:`sub`, men använder det kompilerade mönstret.

source: Identical to the :func:`subn` function, using the compiled pattern.
sv: Identisk med funktionen :func:`subn`, men med det kompilerade mönstret.

source: The regex matching flags. This is a combination of the flags given to :func:`.compile`, any ``(?...)`` inline flags in the pattern, and implicit flags such as :py:const:`~re.UNICODE` if the pattern is a Unicode string.
sv: Flaggorna för regex-matchning. Detta är en kombination av de flaggor som ges till :func:`.compile`, eventuella ``(?...)`` inline-flaggor i mönstret och implicita flaggor som :py:const:`~re.UNICODE` om mönstret är en Unicode-sträng.

source: The number of capturing groups in the pattern.
sv: Antalet fångstgrupper i mönstret.

source: A dictionary mapping any symbolic group names defined by ``(?P<id>)`` to group numbers. The dictionary is empty if no symbolic groups were used in the pattern.
sv: En ordbok som mappar alla symboliska gruppnamn som definieras av ``(?P<id>)`` till gruppnummer. Ordlistan är tom om inga symboliska grupper har använts i mönstret.

source: The pattern string from which the pattern object was compiled.
sv: Den mönstersträng från vilken mönsterobjektet sammanställdes.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Compiled regular expression objects are considered atomic.
sv: Lagt till stöd för :func:`copy.copy` och :func:`copy.deepcopy`. Kompilerade objekt för reguljära uttryck betraktas som atomära.

source: Match Objects
sv: Matchningsobjekt

source: Match objects always have a boolean value of ``True``. Since :meth:`~Pattern.match` and :meth:`~Pattern.search` return ``None`` when there is no match, you can test whether there was a match with a simple ``if`` statement::
sv: Match-objekt har alltid det booleska värdet ``True``. Eftersom :meth:`~Pattern.match` och :meth:`~Pattern.search` returnerar ``None`` när det inte finns någon matchning, kan du testa om det fanns en matchning med en enkel ``if``-sats::

source: match = re.search(pattern, string) if match: process(match)
sv: match = re.search(mönster, sträng) om match: process(match)

source: Match object returned by successful ``match``\ es and ``search``\ es.
sv: Matchningsobjekt som returneras av framgångsrika "matchningar" och "sökningar".

source: :py:class:`re.Match` supports ``[]`` to indicate a Unicode (str) or bytes match. See :ref:`types-genericalias`.
sv: :py:class:`re.Match` stöder ``[]`` för att ange en matchning med Unicode (str) eller bytes. Se :ref:`types-genericalias`.

source: Return the string obtained by doing backslash substitution on the template string *template*, as done by the :meth:`~Pattern.sub` method. Escapes such as ``\n`` are converted to the appropriate characters, and numeric backreferences (``\1``, ``\2``) and named backreferences (``\g<1>``, ``\g<name>``) are replaced by the contents of the corresponding group. The backreference ``\g<0>`` will be replaced by the entire match.
sv: Returnerar strängen som erhålls genom att göra backslash-substitution på mallsträngen *template*, vilket görs av metoden :meth:`~Pattern.sub`. Escapes som ``\n`` konverteras till lämpliga tecken, och numeriska backreferenser (``1``, ``2``) och namngivna backreferenser (``\g<1>``, ``g<name>``) ersätts av innehållet i motsvarande grupp. Bakreferensen ``\g<0>`` kommer att ersättas av hela matchningen.

source: Returns one or more subgroups of the match. If there is a single argument, the result is a single string; if there are multiple arguments, the result is a tuple with one item per argument. Without arguments, *group1* defaults to zero (the whole match is returned). If a *groupN* argument is zero, the corresponding return value is the entire matching string; if it is in the inclusive range [1..99], it is the string matching the corresponding parenthesized group. If a group number is negative or larger than the number of groups defined in the pattern, an :exc:`IndexError` exception is raised. If a group is contained in a part of the pattern that did not match, the corresponding result is ``None``. If a group is contained in a part of the pattern that matched multiple times, the last match is returned. ::
sv: Returnerar en eller flera undergrupper av matchningen. Om det finns ett enda argument är resultatet en enda sträng; om det finns flera argument är resultatet en tupel med ett objekt per argument. Utan argument är *group1* standardvärdet noll (hela matchningen returneras). Om ett *groupN*-argument är noll är motsvarande returvärde hela den matchande strängen; om det är i det inkluderande intervallet [1..99] är det den sträng som matchar motsvarande grupp inom parentes. Om ett gruppnummer är negativt eller större än det antal grupper som definieras i mönstret, uppstår ett :exc:`IndexError` undantag. Om en grupp ingår i en del av mönstret som inte matchade, är motsvarande resultat ``None``. Om en grupp ingår i en del av mönstret som matchade flera gånger, returneras den sista matchningen. ::

source: >>> m = re.match(r"(\w+) (\w+)", "Isaac Newton, physicist") >>> m.group(0) # The entire match 'Isaac Newton' >>> m.group(1) # The first parenthesized subgroup. 'Isaac' >>> m.group(2) # The second parenthesized subgroup. 'Newton' >>> m.group(1, 2) # Multiple arguments give us a tuple. ('Isaac', 'Newton')
sv: >>> m = re.match(r"(\w+) (\w+)","Isaac Newton, fysiker") >>> m.group(0) # Hela matchningen "Isaac Newton >>> m.group(1) # Den första parentesförsedda undergruppen. 'Isaac' >>> m.group(2) # Den andra parentesförsedda undergruppen. 'Newton' >>> m.group(1, 2) # Flera argument ger oss en tupel. ('Isaac', 'Newton')

source: If the regular expression uses the ``(?P<name>...)`` syntax, the *groupN* arguments may also be strings identifying groups by their group name. If a string argument is not used as a group name in the pattern, an :exc:`IndexError` exception is raised.
sv: Om det reguljära uttrycket använder syntaxen ``(?P<name>...)`` kan *groupN*-argumenten också vara strängar som identifierar grupper med deras gruppnamn. Om ett strängargument inte används som ett gruppnamn i mönstret, uppstår ett :exc:`IndexError` undantag.

source: A moderately complicated example::
sv: Ett måttligt komplicerat exempel::

source: >>> m = re.match(r"(?P<first_name>\w+) (?P<last_name>\w+)", "Malcolm Reynolds") >>> m.group('first_name') 'Malcolm' >>> m.group('last_name') 'Reynolds'
sv: >>> m = re.match(r"(?P<förnamn>\w+) (?P<efternamn>\w+)","Malcolm Reynolds") >>> m.group('förnamn') 'Malcolm' >>> m.group('efternamn') "Reynolds

source: Named groups can also be referred to by their index::
sv: Namngivna grupper kan också hänvisas till genom sitt index::

source: >>> m.group(1) 'Malcolm' >>> m.group(2) 'Reynolds'
sv: >>> m.grupp(1) 'Malcolm' >>> m.grupp(2) 'Reynolds'
