Repository: yeager/python-docs-sv
Catalog: library/re.po
Languages: sv

source: Support of nested sets and set operations as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax, so to facilitate this change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That includes sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning escape them with a backslash.
sv: Stöd för nästlade mängder och mängdoperationer som i `Unicode Technical Standard #18`_ kan komma att läggas till i framtiden. Detta skulle ändra syntaxen, så för att underlätta denna förändring kommer en :exc:`FutureWarning` att visas i tvetydiga fall för tillfället. Detta inkluderar uppsättningar som börjar med en bokstavlig ``'['`` eller innehåller bokstavliga teckensekvenser ``'--'``, ``'&&'``, ``'~~'`` och ``'||'``. För att undvika en varning, undvik dem med ett backslash.

source: :exc:`FutureWarning` is raised if a character set contains constructs that will change semantically in the future.
sv: :exc:`FutureWarning` utlöses om en teckenuppsättning innehåller konstruktioner som kommer att förändras semantiskt i framtiden.

source: ``A|B``, where *A* and *B* can be arbitrary REs, creates a regular expression that will match either *A* or *B*. An arbitrary number of REs can be separated by the ``'|'`` in this way. This can be used inside groups (see below) as well. As the target string is scanned, REs separated by ``'|'`` are tried from left to right. When one pattern completely matches, that branch is accepted. This means that once *A* matches, *B* will not be tested further, even if it would produce a longer overall match. In other words, the ``'|'`` operator is never greedy. To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
sv: ``A|B``, där *A* och *B* kan vara godtyckliga RE:s, skapar ett reguljärt uttryck som matchar antingen *A* eller *B*. Ett godtyckligt antal RE:s kan separeras med ``'|'`` på detta sätt. Detta kan även användas inom grupper (se nedan). När målsträngen skannas testas RE:s som separerats med ``'|'`` från vänster till höger. När ett mönster matchar fullständigt accepteras den grenen. Detta innebär att när *A* matchar kommer *B* inte att testas ytterligare, även om det skulle ge en längre total matchning. Med andra ord är operatorn ``'|'`` aldrig girig. Om du vill matcha en bokstavlig ``'|'`` använder du ``\|` eller omsluter den i en teckenklass, som i ``[|]``.

source: Matches whatever regular expression is inside the parentheses, and indicates the start and end of a group; the contents of a group can be retrieved after a match has been performed, and can be matched later in the string with the ``\number`` special sequence, described below. To match the literals ``'('`` or ``')'``, use ``\(`` or ``\)``, or enclose them inside a character class: ``[(]``, ``[)]``.
sv: Matchar det reguljära uttryck som finns inom parentesen och anger början och slutet på en grupp; innehållet i en grupp kan hämtas efter att en matchning har utförts och kan matchas senare i strängen med specialsekvensen ``\number``, som beskrivs nedan. För att matcha bokstavstecken ``'('`` eller ``')'``, använd ``(`` eller ``\)``, eller omslut dem i en teckenklass: ``[(]``, ``[)]``.

source: This is an extension notation (a ``'?'`` following a ``'('`` is not meaningful otherwise). The first character after the ``'?'`` determines what the meaning and further syntax of the construct is. Extensions usually do not create a new group; ``(?P<name>...)`` is the only exception to this rule. Following are the currently supported extensions.
sv: Detta är en utvidgad notation (en ``'?'`` efter en ``'('`` är inte meningsfull i övrigt). Det första tecknet efter ``'?'`` avgör vad konstruktionen har för betydelse och vidare syntax. Tillägg skapar vanligtvis inte en ny grupp; ``(?P<name>...)`` är det enda undantaget från denna regel. Följande är de tillägg som för närvarande stöds.

source: (One or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) The group matches the empty string; the letters set the corresponding flags for the entire regular expression:
sv: (En eller flera bokstäver från uppsättningen ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) Gruppen matchar den tomma strängen; bokstäverna anger motsvarande flaggor för hela det reguljära uttrycket:

source: :const:`re.A` (ASCII-only matching)
sv: :const:`re.A` (endast ASCII-matchning)

source: :const:`re.I` (ignore case)
sv: :const:`re.I` (ignorera fall)

source: :const:`re.L` (locale dependent)
sv: :const:`re.L` (lokalberoende)

source: :const:`re.M` (multi-line)
sv: :const:`re.M` (flerradig)

source: :const:`re.S` (dot matches all)
sv: :const:`re.S` (prick matchar alla)

source: :const:`re.U` (Unicode matching)
sv: :const:`re.U` (Unicode-matchning)

source: :const:`re.X` (verbose)
sv: :const:`re.X` (långsam)

source: (The flags are described in :ref:`contents-of-module-re`.) This is useful if you wish to include the flags as part of the regular expression, instead of passing a *flag* argument to the :func:`re.compile` function. Flags should be used first in the expression string.
sv: (Flaggorna beskrivs i :ref:`contents-of-module-re`.) Detta är användbart om du vill inkludera flaggorna som en del av det reguljära uttrycket, istället för att skicka ett *flag*-argument till :func:`re.compile`-funktionen. Flaggorna bör användas först i uttryckssträngen.

source: This construction can only be used at the start of the expression.
sv: Denna konstruktion kan endast användas i början av uttrycket.

source: A non-capturing version of regular parentheses. Matches whatever regular expression is inside the parentheses, but the substring matched by the group *cannot* be retrieved after performing a match or referenced later in the pattern.
sv: En icke-fångande version av reguljära parenteser. Matchar det reguljära uttryck som finns inom parentesen, men den delsträng som matchas av gruppen *kan* inte hämtas efter en matchning eller refereras till senare i mönstret.

source: (Zero or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, optionally followed by ``'-'`` followed by one or more letters from the ``'i'``, ``'m'``, ``'s'``, ``'x'``.) The letters set or remove the corresponding flags for the part of the expression:
sv: (Noll eller flera bokstäver från uppsättningen ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, eventuellt följt av ``'-'`` följt av en eller flera bokstäver från ``'i'``, ``'m'``, ``'s'``, ``'x'``.) Bokstäverna sätter eller tar bort motsvarande flaggor för den del av uttrycket:

source: (The flags are described in :ref:`contents-of-module-re`.)
sv: (Flaggorna beskrivs i :ref:`contents-of-module-re`.)

source: The letters ``'a'``, ``'L'`` and ``'u'`` are mutually exclusive when used as inline flags, so they can't be combined or follow ``'-'``. Instead, when one of them appears in an inline group, it overrides the matching mode in the enclosing group. In Unicode patterns ``(?a:...)`` switches to ASCII-only matching, and ``(?u:...)`` switches to Unicode matching (default). In bytes patterns ``(?L:...)`` switches to locale dependent matching, and ``(?a:...)`` switches to ASCII-only matching (default). This override is only in effect for the narrow inline group, and the original matching mode is restored outside of the group.
sv: Bokstäverna ``'a'``, ``'L'`` och ``'u'`` är ömsesidigt uteslutande när de används som inline-flaggor, så de kan inte kombineras eller följa ``'-'``. Istället, när en av dem visas i en inline-grupp, åsidosätter den matchningsläget i den omslutande gruppen. I Unicode-mönster växlar ``(?a:...)`` till enbart ASCII-matchning och ``(?u:...)`` växlar till Unicode-matchning (standard). I bytesmönster växlar ``(?L:...)`` till lokalberoende matchning och ``(?a:...)`` växlar till enbart ASCII-matchning (standard). Detta åsidosättande gäller endast för gruppen narrow inline, och det ursprungliga matchningsläget återställs utanför gruppen.

source: The letters ``'a'``, ``'L'`` and ``'u'`` also can be used in a group.
sv: Bokstäverna ``'a'``, ``'L'`` och ``'u'`` kan också användas i en grupp.

source: Attempts to match ``...`` as if it was a separate regular expression, and if successful, continues to match the rest of the pattern following it. If the subsequent pattern fails to match, the stack can only be unwound to a point *before* the ``(?>...)`` because once exited, the expression, known as an :dfn:`atomic group`, has thrown away all stack points within itself. Thus, ``(?>.*).`` would never match anything because first the ``.*`` would match all characters possible, then, having nothing left to match, the final ``.`` would fail to match. Since there are no stack points saved in the Atomic Group, and there is no stack point before it, the entire expression would thus fail to match.
sv: Försöker matcha ``...`` som om det vore ett separat reguljärt uttryck, och om det lyckas fortsätter det att matcha resten av det efterföljande mönstret. Om det efterföljande mönstret inte matchar kan stacken bara rullas tillbaka till en punkt *före* ``(?>...)`` eftersom uttrycket, som kallas en :dfn:`atomisk grupp`, har kastat bort alla stackpunkter inom sig när det väl har avslutats. Således skulle ``(?>.*).`` aldrig matcha någonting eftersom först ``.*`` skulle matcha alla möjliga tecken, sedan, när det inte fanns något kvar att matcha, skulle den sista ``.`` misslyckas med att matcha. Eftersom det inte finns några stackpunkter sparade i Atomic Group, och det inte finns någon stackpunkt före den, skulle hela uttrycket alltså inte matcha.

source: Similar to regular parentheses, but the substring matched by the group is accessible via the symbolic group name *name*. Group names must be valid Python identifiers, and in :class:`bytes` patterns they can only contain bytes in the ASCII range. Each group name must be defined only once within a regular expression. A symbolic group is also a numbered group, just as if the group were not named.
sv: Liknar vanliga parenteser, men den delsträng som matchas av gruppen är tillgänglig via det symboliska gruppnamnet *namn*. Gruppnamn måste vara giltiga Python-identifierare och i :class:`bytes`-mönster kan de endast innehålla byte i ASCII-intervallet. Varje gruppnamn får bara definieras en gång inom ett reguljärt uttryck. En symbolisk grupp är också en numrerad grupp, precis som om gruppen inte hade något namn.

source: Named groups can be referenced in three contexts. If the pattern is ``(?P<quote>['"]).*?(?P=quote)`` (i.e. matching a string quoted with either single or double quotes):
sv: Namngivna grupper kan refereras till i tre sammanhang. Om mönstret är ``(?P<quote>['"]).*?(?P=quote)`` (d.v.s. matchning av en sträng som citeras med antingen enkla eller dubbla citattecken):

source: Context of reference to group "quote"
sv: Sammanhang med hänvisning till gruppen "offert"

source: Ways to reference it
sv: Sätt att hänvisa till den

source: in the same pattern itself
sv: i samma mönster själv

source: ``(?P=quote)`` (as shown)
sv: ``(?P=quote)`` (som visas)

source: when processing match object *m*
sv: vid bearbetning av matchningsobjekt *m*

source: in a string passed to the *repl* argument of ``re.sub()``
sv: i en sträng som skickas till *repl*-argumentet i ``re.sub()``

source: ``\g<quote>``
sv: <quote>

source: In :class:`bytes` patterns, group *name* can only contain bytes in the ASCII range (``b'\x00'``-``b'\x7f'``).
sv: I :class:`bytes`-mönster kan gruppen *name* bara innehålla byte i ASCII-intervallet (``b'\x00'``-``b'\x7f'``).

source: ``(?P=name)``
sv: ``(?P=namn)``

source: A backreference to a named group; it matches whatever text was matched by the earlier group named *name*.
sv: En återreferens till en namngiven grupp; den matchar den text som matchades av den tidigare gruppen med namnet *namn*.

source: A comment; the contents of the parentheses are simply ignored.
sv: En kommentar; innehållet i parentesen ignoreras helt enkelt.

source: Matches if ``...`` matches next, but doesn't consume any of the string. This is called a :dfn:`lookahead assertion`. For example, ``Isaac (?=Asimov)`` will match ``'Isaac '`` only if it's followed by ``'Asimov'``.
sv: Matchar om ``...`` matchar nästa, men inte förbrukar någon del av strängen. Detta kallas för ett :dfn:`lookahead-assertion`. Till exempel kommer ``Isaac (?=Asimov)`` att matcha ``'Isaac'`` endast om det följs av ``'Asimov'``.

source: Matches if ``...`` doesn't match next. This is a :dfn:`negative lookahead assertion`. For example, ``Isaac (?!Asimov)`` will match ``'Isaac '`` only if it's *not* followed by ``'Asimov'``.
sv: Matchar om ``...`` inte matchar nästa. Detta är ett :dfn:`negativt lookahead-antagande`. Till exempel kommer ``Isaac (?!Asimov)`` att matcha ``'Isaac'`` endast om det *inte* följs av ``'Asimov'``.

source: Matches if the current position in the string is preceded by a match for ``...`` that ends at the current position. This is called a :dfn:`positive lookbehind assertion`. ``(?<=abc)def`` will find a match in ``'abcdef'``, since the lookbehind will back up 3 characters and check if the contained pattern matches. The contained pattern must only match strings of some fixed length, meaning that ``abc`` or ``a|b`` are allowed, but ``a*`` and ``a{3,4}`` are not. Note that patterns which start with positive lookbehind assertions will not match at the beginning of the string being searched; you will most likely want to use the :func:`search` function rather than the :func:`match` function:
sv: Matchar om den aktuella positionen i strängen föregås av en matchning för ``...`` som slutar vid den aktuella positionen. Detta kallas ett :dfn:`positivt lookbehind-antagande`. ``(?<=abc)def`` kommer att hitta en matchning i ``'abcdef'``, eftersom lookbehind kommer att backa 3 tecken och kontrollera om det ingående mönstret matchar. Det ingående mönstret får bara matcha strängar av en viss bestämd längd, vilket innebär att ``abc`` eller ``a|b`` är tillåtna, men inte ``a*`` och ``a{3,4}``. Observera att mönster som börjar med positiva lookbehind-assertions inte kommer att matcha i början av den sträng som söks; du kommer troligen att vilja använda funktionen :func:`search` snarare än funktionen :func:`match`:

source: This example looks for a word following a hyphen:
sv: I det här exemplet söker du efter ett ord efter ett bindestreck:

source: Added support for group references of fixed length.
sv: Stöd för gruppreferenser med fast längd har lagts till.

source: Matches if the current position in the string is not preceded by a match for ``...``. This is called a :dfn:`negative lookbehind assertion`. Similar to positive lookbehind assertions, the contained pattern must only match strings of some fixed length. Patterns which start with negative lookbehind assertions may match at the beginning of the string being searched.
sv: Träffar om den aktuella positionen i strängen inte föregås av en träff för ``...``. Detta kallas ett :dfn:`negativt lookbehind-antagande`. I likhet med positiva lookbehind-assertions måste det ingående mönstret endast matcha strängar av en viss bestämd längd. Mönster som börjar med negativa lookbehind-assertions kan matcha i början av den sträng som söks.

source: ``(?(id/name)yes-pattern|no-pattern)``
sv: ``(?(id/namn)ja-mönster|nej-mönster)```

source: Will try to match with ``yes-pattern`` if the group with given *id* or *name* exists, and with ``no-pattern`` if it doesn't. ``no-pattern`` is optional and can be omitted. For example, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` is a poor email matching pattern, which will match with ``'<user@host.com>'`` as well as ``'user@host.com'``, but not with ``'<user@host.com'`` nor ``'user@host.com>'``.
sv: Försöker matcha med ``yes-pattern`` om gruppen med angivet *id* eller *namn* finns, och med ``no-pattern`` om den inte gör det. ``no-pattern`` är valfritt och kan utelämnas. Till exempel är ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` ett dåligt mönster för e-postmatchning, som kommer att matcha med ``'<user@host.com>'`` såväl som ``'user@host.com'``, men inte med ``'<user@host.com'`` eller ``'user@host.com>'``.

source: Group *id* can only contain ASCII digits. In :class:`bytes` patterns, group *name* can only contain bytes in the ASCII range (``b'\x00'``-``b'\x7f'``).
sv: Grupp *id* kan endast innehålla ASCII-siffror. I :class:`bytes`-mönster kan grupp *name* endast innehålla bytes i ASCII-intervallet (``b'\x00'``-``b'\x7f'``).

source: The special sequences consist of ``'\'`` and a character from the list below. If the ordinary character is not an ASCII digit or an ASCII letter, then the resulting RE will match the second character. For example, ``\$`` matches the character ``'$'``.
sv: De speciella sekvenserna består av ``'\'`` och ett tecken från listan nedan. Om det vanliga tecknet inte är en ASCII-siffra eller en ASCII-bokstav, kommer den resulterande RE att matcha det andra tecknet. Till exempel matchar ``\$`` tecknet ``'$'``.

source: ``\number``
sv: "Nummer

source: Matches the contents of the group of the same number. Groups are numbered starting from 1. For example, ``(.+) \1`` matches ``'the the'`` or ``'55 55'``, but not ``'thethe'`` (note the space after the group). This special sequence can only be used to match one of the first 99 groups. If the first digit of *number* is 0, or *number* is 3 octal digits long, it will not be interpreted as a group match, but as the character with octal value *number*. Inside the ``'['`` and ``']'`` of a character class, all numeric escapes are treated as characters.
sv: Matchar innehållet i gruppen med samma nummer. Grupperna är numrerade från 1. Till exempel matchar ``(.+) \1`` ``'the the'`` eller ``'55 55'``, men inte ``'thethe'`` (notera mellanslaget efter gruppen). Denna speciella sekvens kan endast användas för att matcha en av de första 99 grupperna. Om den första siffran i *number* är 0, eller *number* är 3 oktalsiffror långt, tolkas det inte som en gruppmatchning, utan som tecknet med oktalvärdet *number*. Inom ``'['`` och ``']'`` i en teckenklass behandlas alla numeriska eskapader som tecken.

source: Matches only at the start of the string.
sv: Matchar endast i början av strängen.

source: Matches the empty string, but only at the beginning or end of a word. A word is defined as a sequence of word characters. Note that formally, ``\b`` is defined as the boundary between a ``\w`` and a ``\W`` character (or vice versa), or between ``\w`` and the beginning or end of the string. This means that ``r'\bat\b'`` matches ``'at'``, ``'at.'``, ``'(at)'``, and ``'as at ay'`` but not ``'attempt'`` or ``'atlas'``.
sv: Matchar den tomma strängen, men bara i början eller slutet av ett ord. Ett ord definieras som en sekvens av ordtecken. Observera att "b" formellt definieras som gränsen mellan ett "w"- och ett "w"-tecken (eller vice versa), eller mellan "w" och början eller slutet av strängen. Detta innebär att ``r'\bat\b'`` matchar ``'at'``, ``'at.'``, ``'(at)'`` och ``'as at ay'`` men inte ``'attempt'`` eller ``'atlas'``.

source: The default word characters in Unicode (str) patterns are Unicode alphanumerics and the underscore, but this can be changed by using the :py:const:`~re.ASCII` flag. Word boundaries are determined by the current locale if the :py:const:`~re.LOCALE` flag is used.
sv: Standardordtecknen i Unicode (str)-mönster är Unicode-alfanumeriska tecken och understreck, men detta kan ändras med hjälp av flaggan :py:const:`~re.ASCII`. Ordgränser bestäms av den aktuella språkdräkten om flaggan :py:const:`~re.LOCALE` används.

source: Inside a character range, ``\b`` represents the backspace character, for compatibility with Python's string literals.
sv: Inom ett teckenintervall representerar ``b`` backspace-tecknet, för kompatibilitet med Pythons stränglitteraler.

source: Matches the empty string, but only when it is *not* at the beginning or end of a word. This means that ``r'at\B'`` matches ``'athens'``, ``'atom'``, ``'attorney'``, but not ``'at'``, ``'at.'``, or ``'at!'``. ``\B`` is the opposite of ``\b``, so word characters in Unicode (str) patterns are Unicode alphanumerics or the underscore, although this can be changed by using the :py:const:`~re.ASCII` flag. Word boundaries are determined by the current locale if the :py:const:`~re.LOCALE` flag is used.
sv: Matchar den tomma strängen, men bara när den *inte* står i början eller slutet av ett ord. Detta innebär att ``r'at\B'`` matchar ``'athens'``, ``'atom'``, ``'attorney'``, men inte ``'at'``, ``'at.'``, eller ``'at!'``. ``B`` är motsatsen till ``b``, så ordtecken i Unicode (str)-mönster är Unicodes alfanumeriska tecken eller understreck, även om detta kan ändras med hjälp av :py:const:`~re.ASCII`-flaggan. Ordgränser bestäms av den aktuella språkdräkten om flaggan :py:const:`~re.LOCALE` används.

source: ``\B`` now matches empty input string.
sv: ``B`` matchar nu tom indatasträng.

source: For Unicode (str) patterns:
sv: För Unicode (str)-mönster:

source: Matches any Unicode decimal digit (that is, any character in Unicode character category `[Nd]`__). This includes ``[0-9]``, and also many other digit characters.
sv: Matchar alla Unicodes decimalsiffror (dvs. alla tecken i Unicodes teckenkategori `[Nd]`__). Detta inkluderar ``[0-9]`` och även många andra siffertecken.

source: Matches ``[0-9]`` if the :py:const:`~re.ASCII` flag is used.
sv: Matchar ``[0-9]`` om flaggan :py:const:`~re.ASCII` används.

source: For 8-bit (bytes) patterns:
sv: För 8-bitars (bytes) mönster:

source: Matches any decimal digit in the ASCII character set; this is equivalent to ``[0-9]``.
sv: Matchar alla decimala siffror i ASCII-teckenuppsättningen; detta motsvarar ``[0-9]``.

source: Matches any character which is not a decimal digit. This is the opposite of ``\d``.
sv: Matchar alla tecken som inte är en decimalsiffra. Detta är motsatsen till ``d``.

source: Matches ``[^0-9]`` if the :py:const:`~re.ASCII` flag is used.
sv: Matchar ``[^0-9]`` om flaggan :py:const:`~re.ASCII` används.

source: Matches Unicode whitespace characters (as defined by :py:meth:`str.isspace`). This includes ``[ \t\n\r\f\v]``, and also many other characters, for example the non-breaking spaces mandated by typography rules in many languages.
sv: Matchar Unicode-tecken för blanksteg (enligt definitionen i :py:meth:`str.isspace`). Detta inkluderar ``[ \t\n\r\f\v]``, och även många andra tecken, till exempel de icke-brytande mellanslag som krävs enligt typografiska regler i många språk.

source: Matches ``[ \t\n\r\f\v]`` if the :py:const:`~re.ASCII` flag is used.
sv: Matchar ``[ \t\n\r\f\v]`` om flaggan :py:const:`~re.ASCII` används.

source: Matches characters considered whitespace in the ASCII character set; this is equivalent to ``[ \t\n\r\f\v]``.
sv: Matchar tecken som betraktas som blanksteg i ASCII-teckensatsen; detta motsvarar ``[ \t\n\r\f\v]``.

source: Matches any character which is not a whitespace character. This is the opposite of ``\s``.
sv: Matchar alla tecken som inte är blankstegstecken. Detta är motsatsen till "s".

source: Matches ``[^ \t\n\r\f\v]`` if the :py:const:`~re.ASCII` flag is used.
sv: Matchar ``[^ \t\n\r\f\v]`` om flaggan :py:const:`~re.ASCII` används.

source: Matches Unicode word characters; this includes all Unicode alphanumeric characters (as defined by :py:meth:`str.isalnum`), as well as the underscore (``_``).
sv: Matchar Unicode-ordtecken; detta inkluderar alla alfanumeriska Unicode-tecken (enligt definitionen i :py:meth:`str.isalnum`), samt understreck (``_``).

source: Matches ``[a-zA-Z0-9_]`` if the :py:const:`~re.ASCII` flag is used.
sv: Matchar ``[a-zA-Z0-9_]`` om flaggan :py:const:`~re.ASCII` används.
