Repository: yeager/python-docs-sv
Catalog: library/reprlib.po
Languages: sv

source: :mod:`!reprlib` --- Alternate :func:`repr` implementation
sv: :mod:`!reprlib` --- Alternativ :func:`repr` implementation

source: **Source code:** :source:`Lib/reprlib.py`
sv: **Källkod:** :source:`Lib/reprlib.py`

source: The :mod:`!reprlib` module provides a means for producing object representations with limits on the size of the resulting strings. This is used in the Python debugger and may be useful in other contexts as well.
sv: Modulen :mod:`!reprlib` ger möjlighet att producera objektrepresentationer med begränsningar av storleken på de strängar som blir resultatet. Detta används i Pythons felsökare och kan vara användbart även i andra sammanhang.

source: This module provides a class, an instance, and a function:
sv: Denna modul tillhandahåller en klass, en instans och en funktion:

source: Class which provides formatting services useful in implementing functions similar to the built-in :func:`repr`; size limits for different object types are added to avoid the generation of representations which are excessively long.
sv: Klass som tillhandahåller formateringstjänster som är användbara vid implementering av funktioner som liknar den inbyggda :func:`repr`; storleksgränser för olika objekttyper har lagts till för att undvika att representationer genereras som är alltför långa.

source: The keyword arguments of the constructor can be used as a shortcut to set the attributes of the :class:`Repr` instance. Which means that the following initialization::
sv: Nyckelordsargumenten i konstruktorn kan användas som en genväg för att ställa in attributen för :class:`Repr`-instansen. Vilket innebär att följande initialisering::

source: Is equivalent to::
sv: Är likvärdig med::

source: See section `Repr Objects`_ for more information about :class:`Repr` attributes.
sv: Se avsnittet `Repr Objects`_ för mer information om :class:`Repr`-attribut.

source: Allow attributes to be set via keyword arguments.
sv: Tillåt att attribut ställs in via nyckelordsargument.

source: This is an instance of :class:`Repr` which is used to provide the :func:`.repr` function described below. Changing the attributes of this object will affect the size limits used by :func:`.repr` and the Python debugger.
sv: Detta är en instans av :class:`Repr` som används för att tillhandahålla funktionen :func:`.repr` som beskrivs nedan. Om du ändrar attributen för detta objekt påverkas de storleksgränser som används av :func:`.repr` och Pythons debugger.

source: This is the :meth:`~Repr.repr` method of ``aRepr``. It returns a string similar to that returned by the built-in function of the same name, but with limits on most sizes.
sv: Detta är :meth:`~Repr.repr`-metoden för ``aRepr``. Den returnerar en sträng som liknar den som returneras av den inbyggda funktionen med samma namn, men med begränsningar för de flesta storlekar.

source: In addition to size-limiting tools, the module also provides a decorator for detecting recursive calls to :meth:`~object.__repr__` and substituting a placeholder string instead.
sv: Förutom verktyg för storleksbegränsning innehåller modulen också en dekorator för att upptäcka rekursiva anrop till :meth:`~object.__repr__` och ersätta dem med en platshållarsträng.

source: Decorator for :meth:`~object.__repr__` methods to detect recursive calls within the same thread. If a recursive call is made, the *fillvalue* is returned, otherwise, the usual :meth:`!__repr__` call is made. For example:
sv: Dekorator för :meth:`~object.__repr__` metoder för att upptäcka rekursiva anrop inom samma tråd. Om ett rekursivt anrop görs returneras *fillvärdet*, annars görs det vanliga :meth:`!__repr__`-anropet. Ett exempel:

source: Repr Objects
sv: Repr-objekt

source: :class:`Repr` instances provide several attributes which can be used to provide size limits for the representations of different object types, and methods which format specific object types.
sv: :class:`Repr`-instanser innehåller flera attribut som kan användas för att ange storleksgränser för representationer av olika objekttyper och metoder som formaterar specifika objekttyper.

source: This string is displayed for recursive references. It defaults to ``...``.
sv: Denna sträng visas för rekursiva referenser. Standardvärdet är ``...``.

source: Depth limit on the creation of recursive representations. The default is ``6``.
sv: Djupgräns för skapandet av rekursiva representationer. Standardvärdet är ``6``.

source: Limits on the number of entries represented for the named object type. The default is ``4`` for :attr:`maxdict`, ``5`` for :attr:`maxarray`, and ``6`` for the others.
sv: Begränsar antalet poster som representeras för den angivna objekttypen. Standardvärdet är ``4`` för :attr:`maxdict`, ``5`` för :attr:`maxarray` och ``6`` för de övriga.

source: Maximum number of characters in the representation for an integer. Digits are dropped from the middle. The default is ``40``.
sv: Maximalt antal tecken i representationen för ett heltal. Siffrorna tas bort från mitten. Standardvärdet är ``40``.

source: Limit on the number of characters in the representation of the string. Note that the "normal" representation of the string is used as the character source: if escape sequences are needed in the representation, these may be mangled when the representation is shortened. The default is ``30``.
sv: Begränsning av antalet tecken i representationen av strängen. Observera att den "normala" representationen av strängen används som teckenkälla: om escape-sekvenser behövs i representationen kan dessa manglas när representationen förkortas. Standardvärdet är ``30``.

source: This limit is used to control the size of object types for which no specific formatting method is available on the :class:`Repr` object. It is applied in a similar manner as :attr:`maxstring`. The default is ``20``.
sv: Denna gräns används för att kontrollera storleken på objekttyper för vilka ingen specifik formateringsmetod är tillgänglig på :class:`Repr`-objektet. Den tillämpas på liknande sätt som :attr:`maxstring`. Standardvärdet är ``20``.

source: If this attribute is set to ``None`` (the default), the output is formatted with no line breaks or indentation, like the standard :func:`repr`. For example:
sv: Om detta attribut är inställt på ``None`` (standard) formateras utdata utan radbrytning eller indragning, som standard :func:`repr`. Ett exempel:

source: If :attr:`~Repr.indent` is set to a string, each recursion level is placed on its own line, indented by that string:
sv: Om :attr:`~Repr.indent` är satt till en sträng placeras varje rekursionsnivå på en egen rad, indragen med strängen:

source: Setting :attr:`~Repr.indent` to a positive integer value behaves as if it was set to a string with that number of spaces:
sv: Om du anger ett positivt heltalsvärde för :attr:`~Repr.indent` fungerar det som om det hade angetts för en sträng med det antalet mellanslag:

source: The equivalent to the built-in :func:`repr` that uses the formatting imposed by the instance.
sv: Motsvarigheten till den inbyggda :func:`repr` som använder den formatering som instansen föreskriver.

source: Recursive implementation used by :meth:`.repr`. This uses the type of *obj* to determine which formatting method to call, passing it *obj* and *level*. The type-specific methods should call :meth:`repr1` to perform recursive formatting, with ``level - 1`` for the value of *level* in the recursive call.
sv: Rekursiv implementering som används av :meth:`.repr`. Den använder typen av *obj* för att avgöra vilken formateringsmetod som ska anropas, och skickar *obj* och *level* till den. De typspecifika metoderna bör anropa :meth:`repr1` för att utföra rekursiv formatering, med ``level - 1`` för värdet på *level* i det rekursiva anropet.

source: Formatting methods for specific types are implemented as methods with a name based on the type name. In the method name, **TYPE** is replaced by ``'_'.join(type(obj).__name__.split())``. Dispatch to these methods is handled by :meth:`repr1`. Type-specific methods which need to recursively format a value should call ``self.repr1(subobj, level - 1)``.
sv: Formateringsmetoder för specifika typer implementeras som metoder med ett namn som baseras på typnamnet. I metodnamnet ersätts **TYPE** med ``'_'.join(type(obj).__name__.split())``. Dispatch till dessa metoder hanteras av :meth:`repr1`. Typspecifika metoder som behöver formatera ett värde rekursivt bör anropa ``self.repr1(subobj, level - 1)``.

source: Subclassing Repr Objects
sv: Underklassificering av Repr-objekt

source: The use of dynamic dispatching by :meth:`Repr.repr1` allows subclasses of :class:`Repr` to add support for additional built-in object types or to modify the handling of types already supported. This example shows how special support for file objects could be added:
sv: Användningen av dynamisk dispatching av :meth:`Repr.repr1` gör det möjligt för subklasser av :class:`Repr` att lägga till stöd för ytterligare inbyggda objekttyper eller att modifiera hanteringen av typer som redan stöds. Detta exempel visar hur specialstöd för filobjekt kan läggas till:

source: placeholder
sv: platshållare
