Repository: yeager/python-docs-sv
Catalog: library/resource.po
Languages: sv

source: :mod:`!resource` --- Resource usage information
sv: :mod:`!resource` --- Information om resursanvändning

source: This module provides basic mechanisms for measuring and controlling system resources utilized by a program.
sv: Denna modul ger grundläggande mekanismer för att mäta och kontrollera systemresurser som används av ett program.

source: Availability
sv: Tillgänglighet

source: Symbolic constants are used to specify particular system resources and to request usage information about either the current process or its children.
sv: Symboliska konstanter används för att ange särskilda systemresurser och för att begära användningsinformation om antingen den aktuella processen eller dess barn.

source: An :exc:`OSError` is raised on syscall failure.
sv: Ett :exc:`OSError` utlöses när syscall misslyckas.

source: A deprecated alias of :exc:`OSError`.
sv: Ett föråldrat alias för :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
sv: Efter :pep:`3151` gjordes denna klass till ett alias för :exc:`OSError`.

source: Resource Limits
sv: Begränsningar av resurser

source: Resources usage can be limited using the :func:`setrlimit` function described below. Each resource is controlled by a pair of limits: a soft limit and a hard limit. The soft limit is the current limit, and may be lowered or raised by a process over time. The soft limit can never exceed the hard limit. The hard limit can be lowered to any value greater than the soft limit, but not raised. (Only processes with the effective UID of the super-user can raise a hard limit.)
sv: Resursanvändningen kan begränsas med hjälp av funktionen :func:`setrlimit` som beskrivs nedan. Varje resurs styrs av ett par gränser: en mjuk gräns och en hård gräns. Den mjuka gränsen är den aktuella gränsen och kan sänkas eller höjas av en process över tiden. Den mjuka gränsen kan aldrig överskrida den hårda gränsen. Den hårda gränsen kan sänkas till ett värde som är större än den mjuka gränsen, men inte höjas. (Endast processer med superanvändarens effektiva UID kan höja en hård gräns)

source: The specific resources that can be limited are system dependent. They are described in the :manpage:`getrlimit(2)` man page. The resources listed below are supported when the underlying operating system supports them; resources which cannot be checked or controlled by the operating system are not defined in this module for those platforms.
sv: De specifika resurser som kan begränsas är systemberoende. De beskrivs i :manpage:`getrlimit(2)` man page. De resurser som anges nedan stöds när det underliggande operativsystemet stöder dem; resurser som inte kan kontrolleras eller styras av operativsystemet definieras inte i den här modulen för dessa plattformar.

source: Constant used to represent the limit for an unlimited resource.
sv: Konstnär som används för att representera gränsen för en obegränsad resurs.

source: Returns a tuple ``(soft, hard)`` with the current soft and hard limits of *resource*. Raises :exc:`ValueError` if an invalid resource is specified, or :exc:`error` if the underlying system call fails unexpectedly.
sv: Returnerar en tupel ``(soft, hard)`` med de aktuella soft- och hard-gränserna för *resource*. Utlöser :exc:`ValueError` om en ogiltig resurs anges, eller :exc:`error` om det underliggande systemanropet misslyckas oväntat.

source: Sets new limits of consumption of *resource*. The *limits* argument must be a tuple ``(soft, hard)`` of two integers describing the new limits. A value of :data:`~resource.RLIM_INFINITY` can be used to request a limit that is unlimited.
sv: Sätter nya gränser för förbrukning av *resurs*. Argumentet *limits* måste vara en tupel ``(soft, hard)`` av två heltal som beskriver de nya gränserna. Ett värde av :data:`~resource.RLIM_INFINITY` kan användas för att begära en obegränsad gräns.

source: Raises :exc:`ValueError` if an invalid resource is specified, if the new soft limit exceeds the hard limit, or if a process tries to raise its hard limit. Specifying a limit of :data:`~resource.RLIM_INFINITY` when the hard or system limit for that resource is not unlimited will result in a :exc:`ValueError`. A process with the effective UID of super-user can request any valid limit value, including unlimited, but :exc:`ValueError` will still be raised if the requested limit exceeds the system imposed limit.
sv: Utlöser :exc:`ValueError` om en ogiltig resurs anges, om den nya mjuka gränsen överskrider den hårda gränsen eller om en process försöker höja sin hårda gräns. Om du anger en gräns på :data:`~resource.RLIM_INFINITY` när den hårda gränsen eller systemgränsen för den resursen inte är obegränsad, resulterar det i :exc:`ValueError`. En process med det effektiva UID:et super-user kan begära vilket giltigt gränsvärde som helst, inklusive obegränsat, men :exc:`ValueError` kommer ändå att visas om den begärda gränsen överskrider systemets gräns.

source: ``setrlimit`` may also raise :exc:`error` if the underlying system call fails.
sv: ``setrlimit`` kan också ge upphov till :exc:`error` om det underliggande systemanropet misslyckas.

source: VxWorks only supports setting :data:`RLIMIT_NOFILE`.
sv: VxWorks stöder endast inställningen :data:`RLIMIT_NOFILE`.

source: Raises an :ref:`auditing event <auditing>` ``resource.setrlimit`` with arguments ``resource``, ``limits``.
sv: Utlöser en :ref:`auditing event <auditing>` ``resource.setrlimit`` med argumenten ``resource``, ``limits``.

source: Combines :func:`setrlimit` and :func:`getrlimit` in one function and supports to get and set the resources limits of an arbitrary process. If *pid* is 0, then the call applies to the current process. *resource* and *limits* have the same meaning as in :func:`setrlimit`, except that *limits* is optional.
sv: Kombinerar :func:`setrlimit` och :func:`getrlimit` i en funktion och stöder hämtning och inställning av resursgränserna för en godtycklig process. Om *pid* är 0 gäller anropet för den aktuella processen. *resource* och *limits* har samma betydelse som i :func:`setrlimit`, förutom att *limits* är valfritt.

source: When *limits* is not given the function returns the *resource* limit of the process *pid*. When *limits* is given the *resource* limit of the process is set and the former resource limit is returned.
sv: När *limits* inte anges returnerar funktionen *resurs*gränsen för processen *pid*. När *limits* anges sätts processens *resurs*-gräns och den tidigare resursgränsen returneras.

source: Raises :exc:`ProcessLookupError` when *pid* can't be found and :exc:`PermissionError` when the user doesn't have ``CAP_SYS_RESOURCE`` for the process.
sv: Utlöser :exc:`ProcessLookupError` när *pid* inte kan hittas och :exc:`PermissionError` när användaren inte har ``CAP_SYS_RESOURCE`` för processen.

source: Raises an :ref:`auditing event <auditing>` ``resource.prlimit`` with arguments ``pid``, ``resource``, ``limits``.
sv: Utlöser en :ref:`auditing event <auditing>` ``resource.prlimit`` med argumenten ``pid``, ``resource``, ``limits``.

source: These symbols define resources whose consumption can be controlled using the :func:`setrlimit` and :func:`getrlimit` functions described below. The values of these symbols are exactly the constants used by C programs.
sv: Dessa symboler definierar resurser vars förbrukning kan kontrolleras med hjälp av funktionerna :func:`setrlimit` och :func:`getrlimit` som beskrivs nedan. Värdena på dessa symboler är exakt de konstanter som används av C-program.

source: The Unix man page for :manpage:`getrlimit(2)` lists the available resources. Note that not all systems use the same symbol or same value to denote the same resource. This module does not attempt to mask platform differences --- symbols not defined for a platform will not be available from this module on that platform.
sv: Unix man page för :manpage:`getrlimit(2)` listar de tillgängliga resurserna. Observera att inte alla system använder samma symbol eller samma värde för att beteckna samma resurs. Den här modulen försöker inte maskera plattformsskillnader --- symboler som inte är definierade för en plattform kommer inte att vara tillgängliga från den här modulen på den plattformen.

source: The maximum size (in bytes) of a core file that the current process can create. This may result in the creation of a partial core file if a larger core would be required to contain the entire process image.
sv: Den maximala storleken (i byte) på en core-fil som den aktuella processen kan skapa. Detta kan resultera i att en partiell core-fil skapas om en större core skulle krävas för att innehålla hela processbilden.

source: The maximum amount of processor time (in seconds) that a process can use. If this limit is exceeded, a :const:`SIGXCPU` signal is sent to the process. (See the :mod:`signal` module documentation for information about how to catch this signal and do something useful, e.g. flush open files to disk.)
sv: Den maximala mängden processortid (i sekunder) som en process kan använda. Om denna gräns överskrids skickas en :const:`SIGXCPU`-signal till processen. (Se dokumentationen för modulen :mod:`signal` för information om hur du kan fånga upp denna signal och göra något användbart, t.ex. spola öppna filer till disken)

source: The maximum size of a file which the process may create.
sv: Den maximala storleken på en fil som processen kan skapa.

source: The maximum size (in bytes) of the process's heap.
sv: Den maximala storleken (i byte) på processens heap.

source: The maximum size (in bytes) of the call stack for the current process. This only affects the stack of the main thread in a multi-threaded process.
sv: Den maximala storleken (i byte) på anropsstacken för den aktuella processen. Detta påverkar endast stacken för huvudtråden i en flertrådad process.

source: The maximum resident set size that should be made available to the process.
sv: Den maximala storleken på invånaruppsättningen som ska göras tillgänglig för processen.

source: The maximum number of processes the current process may create.
sv: Det maximala antalet processer som den aktuella processen får skapa.

source: The maximum number of open file descriptors for the current process.
sv: Det maximala antalet öppna filbeskrivare för den aktuella processen.

source: The BSD name for :const:`RLIMIT_NOFILE`.
sv: BSD-namnet för :const:`RLIMIT_NOFILE`.

source: The maximum address space which may be locked in memory.
sv: Den maximala adressrymd som kan låsas i minnet.

source: The largest area of mapped memory which the process may occupy.
sv: Det största området i det mappade minnet som processen kan uppta.

source: The maximum area (in bytes) of address space which may be taken by the process.
sv: Den maximala ytan (i byte) av adressutrymmet som kan tas i anspråk av processen.

source: The number of bytes that can be allocated for POSIX message queues.
sv: Det antal byte som kan allokeras till POSIX-meddelandeköer.

source: The ceiling for the process's nice level (calculated as 20 - rlim_cur).
sv: Taket för processens fina nivå (beräknas som 20 - rlim_cur).

source: The ceiling of the real-time priority.
sv: Taket för realtidsprioriteringen.

source: The time limit (in microseconds) on CPU time that a process can spend under real-time scheduling without making a blocking syscall.
sv: Tidsgränsen (i mikrosekunder) för CPU-tid som en process kan spendera under realtidsschemaläggning utan att göra ett blockerande syscall.

source: The number of signals which the process may queue.
sv: Antalet signaler som processen kan ställa i kö.

source: The maximum size (in bytes) of socket buffer usage for this user. This limits the amount of network memory, and hence the amount of mbufs, that this user may hold at any time.
sv: Den maximala storleken (i byte) på socketbuffertanvändningen för den här användaren. Detta begränsar mängden nätverksminne, och därmed mängden mbufs, som den här användaren kan ha vid varje tidpunkt.

source: The maximum size (in bytes) of the swap space that may be reserved or used by all of this user id's processes. This limit is enforced only if bit 1 of the vm.overcommit sysctl is set. Please see `tuning(7) <https://man.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ for a complete description of this sysctl.
sv: Den maximala storleken (i byte) på det swaputrymme som kan reserveras eller användas av alla processer i detta användar-id. Denna gräns tillämpas endast om bit 1 i sysctl vm.overcommit är inställd. Se `tuning(7) <https://man.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ för en fullständig beskrivning av denna sysctl.

source: The maximum number of pseudo-terminals created by this user id.
sv: Det maximala antalet pseudoterminaler som skapats av detta användar-ID.

source: The maximum number of kqueues this user id is allowed to create.
sv: Det maximala antalet kqueues som detta användar-ID får skapa.

source: Resource Usage
sv: Användning av resurser

source: These functions are used to retrieve resource usage information:
sv: Dessa funktioner används för att hämta information om resursanvändning:

source: This function returns an object that describes the resources consumed by either the current process or its children, as specified by the *who* parameter. The *who* parameter should be specified using one of the :const:`!RUSAGE_\*` constants described below.
sv: Denna funktion returnerar ett objekt som beskriver de resurser som förbrukas av antingen den aktuella processen eller dess barn, enligt parametern *who*. Parametern *who* bör specificeras med hjälp av en av :const:`!RUSAGE_\*`-konstanterna som beskrivs nedan.

source: A simple example::
sv: Ett enkelt exempel::

source: The fields of the return value each describe how a particular system resource has been used, e.g. amount of time spent running is user mode or number of times the process was swapped out of main memory. Some values are dependent on the clock tick internal, e.g. the amount of memory the process is using.
sv: Fälten i returvärdet beskriver var och en hur en viss systemresurs har använts, t.ex. hur lång tid som körts i användarläge eller hur många gånger processen swappats ut ur huvudminnet. Vissa värden är beroende av den interna klockans tick, t.ex. hur mycket minne som processen använder.

source: For backward compatibility, the return value is also accessible as a tuple of 16 elements.
sv: För bakåtkompatibilitet är returvärdet också tillgängligt som en tupel med 16 element.

source: The fields :attr:`ru_utime` and :attr:`ru_stime` of the return value are floating-point values representing the amount of time spent executing in user mode and the amount of time spent executing in system mode, respectively. The remaining values are integers. Consult the :manpage:`getrusage(2)` man page for detailed information about these values. A brief summary is presented here:
sv: Fälten :attr:`ru_utime` och :attr:`ru_stime` i returvärdet är flyttalsvärden som representerar den tid som spenderats i användarläge respektive systemläge. De återstående värdena är heltal. Mer information om dessa värden finns i :manpage:`getrusage(2)` man page. En kort sammanfattning presenteras här:

source: Field
sv: Fält

source: Resource
sv: Resurs

source: time in user mode (float seconds)
sv: tid i användarläge (float-sekunder)

source: time in system mode (float seconds)
sv: tid i systemläge (float-sekunder)

source: maximum resident set size
sv: maximal storlek på invånaruppsättning

source: shared memory size
sv: storlek på delat minne

source: unshared memory size
sv: storlek på odelat minne

source: unshared stack size
sv: odelad stackstorlek

source: page faults not requiring I/O
sv: sidfel som inte kräver I/O

source: page faults requiring I/O
sv: sidfel som kräver I/O

source: number of swap outs
sv: antal utbyten

source: block input operations
sv: operationer för blockinmatning

source: block output operations
sv: blockutmatningsoperationer

source: messages sent
sv: skickade meddelanden

source: messages received
sv: mottagna meddelanden

source: signals received
sv: mottagna signaler

source: voluntary context switches
sv: frivilliga byten av sammanhang

source: involuntary context switches
sv: ofrivilliga kontextbyten

source: This function will raise a :exc:`ValueError` if an invalid *who* parameter is specified. It may also raise :exc:`error` exception in unusual circumstances.
sv: Denna funktion ger upphov till ett :exc:`ValueError` om en ogiltig *who*-parameter anges. Den kan också ge upphov till :exc:`error` undantag under ovanliga omständigheter.

source: Returns the number of bytes in a system page. (This need not be the same as the hardware page size.)
sv: Returnerar antalet byte i en systemsida. (Detta behöver inte vara samma som sidstorleken i maskinvaran)

source: The following :const:`!RUSAGE_\*` symbols are passed to the :func:`getrusage` function to specify which processes information should be provided for.
sv: Följande :const:`!RUSAGE_\*`-symboler skickas till :func:`getrusage`-funktionen för att ange vilka processer som ska få information.

source: Pass to :func:`getrusage` to request resources consumed by the calling process, which is the sum of resources used by all threads in the process.
sv: Passa till :func:`getrusage` för att begära resurser som förbrukas av den anropande processen, vilket är summan av resurser som används av alla trådar i processen.

source: Pass to :func:`getrusage` to request resources consumed by child processes of the calling process which have been terminated and waited for.
sv: Skicka till :func:`getrusage` för att begära resurser som förbrukas av barnprocesser till den anropande processen som har avslutats och väntats på.

source: Pass to :func:`getrusage` to request resources consumed by both the current process and child processes. May not be available on all systems.
sv: Passera till :func:`getrusage` för att begära resurser som förbrukas av både den aktuella processen och underordnade processer. Kanske inte tillgänglig på alla system.

source: Pass to :func:`getrusage` to request resources consumed by the current thread. May not be available on all systems.
sv: Överlämnas till :func:`getrusage` för att begära resurser som förbrukas av den aktuella tråden. Kanske inte tillgänglig på alla system.
