Repository: yeager/python-docs-sv
Catalog: library/rlcompleter.po
Languages: sv

source: :mod:`!rlcompleter` --- Completion function for GNU readline
sv: :mod:`!rlcompleter` --- Kompletteringsfunktion för GNU readline

source: **Source code:** :source:`Lib/rlcompleter.py`
sv: **Källkod:** :source:`Lib/rlcompleter.py`

source: The :mod:`!rlcompleter` module defines a completion function suitable to be passed to :func:`~readline.set_completer` in the :mod:`readline` module.
sv: Modulen :mod:`!rlcompleter` definierar en kompletteringsfunktion som är lämplig att skicka till :func:`~readline.set_completer` i modulen :mod:`readline`.

source: When this module is imported on a Unix platform with the :mod:`readline` module available, an instance of the :class:`Completer` class is automatically created and its :meth:`~Completer.complete` method is set as the :ref:`readline completer <readline-completion>`. The method provides completion of valid Python :ref:`identifiers and keywords <identifiers>`.
sv: När denna modul importeras på en Unix-plattform med modulen :mod:`readline` tillgänglig, skapas automatiskt en instans av klassen :class:`Completer` och dess metod :meth:`~Completer.complete` anges som :ref:`readline completer <readline-completion>`. Metoden ger komplettering av giltiga Python :ref:`identifierare och nyckelord <identifiers>`.

source: Example::
sv: Exempel::

source: The :mod:`!rlcompleter` module is designed for use with Python's :ref:`interactive mode <tut-interactive>`. Unless Python is run with the :option:`-S` option, the module is automatically imported and configured (see :ref:`rlcompleter-config`).
sv: Modulen :mod:`!rlcompleter` är utformad för att användas med Pythons :ref:`interaktiva läge <tut-interactive>`. Om inte Python körs med alternativet :option:`-S` importeras och konfigureras modulen automatiskt (se :ref:`rlcompleter-config`).

source: On platforms without :mod:`readline`, the :class:`Completer` class defined by this module can still be used for custom purposes.
sv: På plattformar utan :mod:`readline` kan klassen :class:`Completer` som definieras av denna modul fortfarande användas för anpassade ändamål.

source: Completer objects have the following method:
sv: Completer-objekt har följande metod:

source: Return the next possible completion for *text*.
sv: Returnerar nästa möjliga komplettering för *text*.

source: When called by the :mod:`readline` module, this method is called successively with ``state == 0, 1, 2, ...`` until the method returns ``None``.
sv: När den här metoden anropas av modulen :mod:`readline`, anropas den successivt med ``state == 0, 1, 2, ...`` tills metoden returnerar ``None``.

source: If called for *text* that doesn't include a period character (``'.'``), it will complete from names currently defined in :mod:`__main__`, :mod:`builtins` and keywords (as defined by the :mod:`keyword` module).
sv: Om den anropas för *text* som inte innehåller ett punkttecken (``'.'``), kommer den att komplettera från namn som för närvarande definieras i :mod:`__main__`, :mod:`builtins` och nyckelord (som definieras av modulen :mod:`keyword`).

source: If called for a dotted name, it will try to evaluate anything without obvious side-effects (functions will not be evaluated, but it can generate calls to :meth:`~object.__getattr__`) up to the last part, and find matches for the rest via the :func:`dir` function. Any exception raised during the evaluation of the expression is caught, silenced and :const:`None` is returned.
sv: Om den anropas för ett punktat namn försöker den utvärdera allt utan uppenbara bieffekter (funktioner utvärderas inte, men den kan generera anrop till :meth:`~object.__getattr__`) fram till den sista delen, och hittar matchningar för resten via funktionen :func:`dir`. Alla undantag som uppstår under utvärderingen av uttrycket fångas upp, tystas och :const:`None` returneras.
