Repository: yeager/python-docs-sv
Catalog: library/sched.po
Languages: sv

source: :mod:`!sched` --- Event scheduler
sv: :mod:`!sched` --- Schemaläggare för händelser

source: **Source code:** :source:`Lib/sched.py`
sv: **Källkod:** :source:`Lib/sched.py`

source: The :mod:`sched` module defines a class which implements a general purpose event scheduler:
sv: Modulen :mod:`sched` definierar en klass som implementerar en schemaläggare för händelser för allmänt bruk:

source: The :class:`scheduler` class defines a generic interface to scheduling events. It needs two functions to actually deal with the "outside world" --- *timefunc* should be callable without arguments, and return a number (the "time", in any units whatsoever). The *delayfunc* function should be callable with one argument, compatible with the output of *timefunc*, and should delay that many time units. *delayfunc* will also be called with the argument ``0`` after each event is run to allow other threads an opportunity to run in multi-threaded applications.
sv: Klassen :class:`scheduler` definierar ett generiskt gränssnitt för schemaläggning av händelser. Den behöver två funktioner för att faktiskt hantera "omvärlden" --- *timefunc* skall kunna anropas utan argument och returnera ett tal ("tiden", i valfri enhet). Funktionen *delayfunc* skall kunna anropas med ett argument, kompatibelt med resultatet från *timefunc*, och skall fördröja så många tidsenheter. *delayfunc* kommer också att anropas med argumentet ``0`` efter att varje händelse har körts för att ge andra trådar en möjlighet att köra i flertrådade applikationer.

source: *timefunc* and *delayfunc* parameters are optional.
sv: parametrarna *timefunc* och *delayfunc* är valfria.

source: :class:`scheduler` class can be safely used in multi-threaded environments.
sv: :class:`scheduler`-klassen kan användas säkert i flertrådade miljöer.

source: Example::
sv: Exempel::

source: Scheduler Objects
sv: Schemaläggningsobjekt

source: :class:`scheduler` instances have the following methods and attributes:
sv: :class:`scheduler`-instanser har följande metoder och attribut:

source: Schedule a new event. The *time* argument should be a numeric type compatible with the return value of the *timefunc* function passed to the constructor. Events scheduled for the same *time* will be executed in the order of their *priority*. A lower number represents a higher priority.
sv: Schemalägg en ny händelse. Argumentet *time* bör vara en numerisk typ som är kompatibel med returvärdet för funktionen *timefunc* som skickas till konstruktören. Händelser som schemalagts för samma *tid* kommer att utföras i den ordning som deras *prioritet* anger. En lägre siffra representerar en högre prioritet.

source: Executing the event means executing ``action(*argument, **kwargs)``. *argument* is a sequence holding the positional arguments for *action*. *kwargs* is a dictionary holding the keyword arguments for *action*.
sv: Att utföra händelsen innebär att utföra ``action(*argument, **kwargs)``. *argument* är en sekvens som innehåller de positionella argumenten för *action*. *kwargs* är en ordbok som innehåller nyckelordsargumenten för *action*.

source: Return value is an event which may be used for later cancellation of the event (see :meth:`cancel`).
sv: Returvärdet är en händelse som kan användas för senare annullering av händelsen (se :meth:`cancel`).

source: *argument* parameter is optional.
sv: *argument*-parametern är valfri.

source: *kwargs* parameter was added.
sv: *parametern kwargs* har lagts till.

source: Schedule an event for *delay* more time units. Other than the relative time, the other arguments, the effect and the return value are the same as those for :meth:`enterabs`.
sv: Schemalägg en händelse för *fördröjning* fler tidsenheter. Förutom den relativa tiden är de andra argumenten, effekten och returvärdet desamma som för :meth:`enterabs`.

source: Remove the event from the queue. If *event* is not an event currently in the queue, this method will raise a :exc:`ValueError`.
sv: Tar bort händelsen från kön. Om *event* inte är en händelse som för närvarande finns i kön, kommer denna metod att ge upphov till ett :exc:`ValueError`.

source: Return ``True`` if the event queue is empty.
sv: Returnerar ``True`` om händelsekön är tom.

source: Run all scheduled events. This method will wait (using the *delayfunc* function passed to the constructor) for the next event, then execute it and so on until there are no more scheduled events.
sv: Kör alla schemalagda händelser. Den här metoden väntar (med hjälp av funktionen *delayfunc* som skickas till konstruktören) på nästa händelse och kör den sedan och så vidare tills det inte finns några fler schemalagda händelser.

source: If *blocking* is false executes the scheduled events due to expire soonest (if any) and then return the deadline of the next scheduled call in the scheduler (if any).
sv: Om *blocking* är false körs de schemalagda händelser som löper ut tidigast (om sådana finns) och returnerar sedan tidsfristen för nästa schemalagda anrop i schemaläggaren (om sådan finns).

source: Either *action* or *delayfunc* can raise an exception. In either case, the scheduler will maintain a consistent state and propagate the exception. If an exception is raised by *action*, the event will not be attempted in future calls to :meth:`run`.
sv: Antingen *action* eller *delayfunc* kan ge upphov till ett undantag. I båda fallen kommer schemaläggaren att upprätthålla ett konsekvent tillstånd och sprida undantaget. Om ett undantag utlöses av *action* kommer händelsen inte att prövas i framtida anrop till :meth:`run`.

source: If a sequence of events takes longer to run than the time available before the next event, the scheduler will simply fall behind. No events will be dropped; the calling code is responsible for canceling events which are no longer pertinent.
sv: Om en sekvens av händelser tar längre tid att köra än den tid som finns tillgänglig före nästa händelse, kommer schemaläggaren helt enkelt att hamna på efterkälken. Inga händelser kommer att avbrytas; den anropande koden är ansvarig för att avbryta händelser som inte längre är relevanta.

source: *blocking* parameter was added.
sv: *parametern blocking* har lagts till.

source: Read-only attribute returning a list of upcoming events in the order they will be run. Each event is shown as a :term:`named tuple` with the following fields: time, priority, action, argument, kwargs.
sv: Skrivskyddat attribut som returnerar en lista över kommande händelser i den ordning de kommer att köras. Varje händelse visas som en :term:`named tuple` med följande fält: tid, prioritet, åtgärd, argument, kwargs.

source: event scheduling
sv: schemaläggning av evenemang
