Repository: yeager/python-docs-sv
Catalog: library/secrets.po
Languages: sv

source: :mod:`!secrets` --- Generate secure random numbers for managing secrets
sv: :mod:`!secrets` --- Generera säkra slumptal för hantering av hemligheter

source: **Source code:** :source:`Lib/secrets.py`
sv: **Källkod:** :source:`Lib/secrets.py`

source: The :mod:`secrets` module is used for generating cryptographically strong random numbers suitable for managing data such as passwords, account authentication, security tokens, and related secrets.
sv: Modulen :mod:`secrets` används för att generera kryptografiskt starka slumptal som är lämpliga för hantering av data som lösenord, kontoautentisering, säkerhetstoken och relaterade hemligheter.

source: In particular, :mod:`secrets` should be used in preference to the default pseudo-random number generator in the :mod:`random` module, which is designed for modelling and simulation, not security or cryptography.
sv: I synnerhet bör :mod:`secrets` användas i stället för standardgeneratorn för pseudoslumpmässiga tal i modulen :mod:`random`, som är avsedd för modellering och simulering, inte för säkerhet eller kryptografi.

source: Random numbers
sv: Slumptal

source: The :mod:`secrets` module provides access to the most secure source of randomness that your operating system provides.
sv: Modulen :mod:`secrets` ger tillgång till den säkraste slumpmässiga källan som ditt operativsystem tillhandahåller.

source: A class for generating random numbers using the highest-quality sources provided by the operating system. See :class:`random.SystemRandom` for additional details.
sv: En klass för att generera slumptal med hjälp av de källor av högsta kvalitet som operativsystemet tillhandahåller. Se :class:`random.SystemRandom` för ytterligare detaljer.

source: Return a randomly chosen element from a non-empty sequence.
sv: Returnerar ett slumpmässigt valt element från en icke-tom sekvens.

source: Return a random int in the range [0, *exclusive_upper_bound*).
sv: Returnerar ett slumpmässigt int i intervallet [0, *exklusiv_övre_gräns*).

source: Return a non-negative int with *k* random bits.
sv: Returnerar ett icke-negativt int med *k* slumpmässiga bitar.

source: Generating tokens
sv: Generering av polletter

source: The :mod:`secrets` module provides functions for generating secure tokens, suitable for applications such as password resets, hard-to-guess URLs, and similar.
sv: Modulen :mod:`secrets` innehåller funktioner för att generera säkra tokens, lämpliga för tillämpningar som återställning av lösenord, svårbedömda webbadresser och liknande.

source: Return a random byte string containing *nbytes* number of bytes. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
sv: Returnerar en slumpmässig bytesträng som innehåller *nbytes* antal byte. Om *nbytes* är ``None`` eller inte anges, används en rimlig standard.

source: Return a random text string, in hexadecimal. The string has *nbytes* random bytes, each byte converted to two hex digits. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
sv: Returnerar en slumpmässig textsträng i hexadecimal. Strängen har *nbytes* slumpmässiga byte, varje byte konverteras till två hexadecimala siffror. Om *nbytes* är ``None`` eller inte anges, används ett rimligt standardvärde.

source: Return a random URL-safe text string, containing *nbytes* random bytes. The text is Base64 encoded, so on average each byte results in approximately 1.3 characters. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
sv: Returnerar en slumpmässig URL-säker textsträng som innehåller *nbytes* slumpmässiga byte. Texten är Base64-kodad, så i genomsnitt resulterar varje byte i cirka 1,3 tecken. Om *nbytes* är ``None`` eller inte anges, används en rimlig standard.

source: How many bytes should tokens use?
sv: Hur många byte ska tokens använda?

source: To be secure against `brute-force attacks <https://en.wikipedia.org/wiki/Brute-force_attack>`_, tokens need to have sufficient randomness. Unfortunately, what is considered sufficient will necessarily increase as computers get more powerful and able to make more guesses in a shorter period. As of 2015, it is believed that 32 bytes (256 bits) of randomness is sufficient for the typical use-case expected for the :mod:`secrets` module.
sv: För att vara säkra mot "brute-force"-attacker <https://en.wikipedia.org/wiki/Brute-force_attack>`_ måste tokens vara tillräckligt slumpmässiga. Tyvärr kommer det som anses tillräckligt nödvändigtvis att öka i takt med att datorer blir kraftfullare och kan göra fler gissningar på kortare tid. Från och med 2015 tror man att 32 byte (256 bitar) slumpmässighet är tillräckligt för det typiska användningsfall som förväntas för modulen :mod:`secrets`.

source: For those who want to manage their own token length, you can explicitly specify how much randomness is used for tokens by giving an :class:`int` argument to the various ``token_*`` functions. That argument is taken as the number of bytes of randomness to use.
sv: För dem som vill hantera sin egen tokenlängd kan du uttryckligen ange hur mycket slumpmässighet som ska användas för tokens genom att ge ett :class:`int`-argument till de olika ``token_*``-funktionerna. Det argumentet tas som antalet bytes slumpmässighet som ska användas.

source: Otherwise, if no argument is provided, or if the argument is ``None``, the ``token_*`` functions will use a reasonable default instead.
sv: I annat fall, om inget argument anges eller om argumentet är ``None``, kommer ``token_*``-funktionerna att använda en rimlig standard istället.

source: That default is subject to change at any time, including during maintenance releases.
sv: Denna standard kan ändras när som helst, även under underhållsversioner.

source: Other functions
sv: Övriga funktioner

source: Return ``True`` if strings or :term:`bytes-like objects <bytes-like object>` *a* and *b* are equal, otherwise ``False``, using a "constant-time compare" to reduce the risk of `timing attacks <https://codahale.com/a-lesson-in-timing-attacks/>`_. See :func:`hmac.compare_digest` for additional details.
sv: Returnerar ``True`` om strängar eller :term:`bytesliknande objekt <bytes-like object>` *a* och *b* är lika, annars ``False``, använder en "constant-time compare" för att minska risken för `timing attacker &lt;https://codahale.com/a-lesson-in-timing-attacks/&gt;`_. Se :func:`hmac.compare_digest` för ytterligare detaljer.

source: Recipes and best practices
sv: Recept och bästa praxis

source: This section shows recipes and best practices for using :mod:`secrets` to manage a basic level of security.
sv: I det här avsnittet visas recept och bästa praxis för hur du använder :mod:`secrets` för att hantera en grundläggande säkerhetsnivå.

source: Generate an eight-character alphanumeric password:
sv: Skapa ett alfanumeriskt lösenord med åtta tecken:

source: Applications should not :cwe:`store passwords in a recoverable format <257>`, whether plain text or encrypted. They should be salted and hashed using a cryptographically strong one-way (irreversible) hash function.
sv: Program bör inte :cwe:`lagra lösenord i ett återställbart format <257>`, vare sig i klartext eller krypterat. De bör saltas och hashas med hjälp av en kryptografiskt stark envägs (irreversibel) hashfunktion.

source: Generate a ten-character alphanumeric password with at least one lowercase character, at least one uppercase character, and at least three digits:
sv: Skapa ett alfanumeriskt lösenord på tio tecken med minst en gemen bokstav, minst en versal bokstav och minst tre siffror:

source: Generate an `XKCD-style passphrase <https://xkcd.com/936/>`_:
sv: Generera en `XKCD-liknande lösenfras <https://xkcd.com/936/>`_:

source: Generate a hard-to-guess temporary URL containing a security token suitable for password recovery applications:
sv: Generera en tillfällig URL som är svår att gissa sig till och som innehåller en säkerhetstoken som är lämplig för applikationer för återställning av lösenord:
