Repository: yeager/python-docs-sv
Catalog: library/site.po
Languages: sv

source: :mod:`!site` --- Site-specific configuration hook
sv: :mod:`!site` --- Platsspecifik konfigurations-hook

source: **Source code:** :source:`Lib/site.py`
sv: **Källkod:** :source:`Lib/site.py`

source: **This module is automatically imported during initialization.** The automatic import can be suppressed using the interpreter's :option:`-S` option.
sv: **Denna modul importeras automatiskt under initieringen.** Den automatiska importen kan undertryckas med hjälp av tolkens alternativ :option:`-S`.

source: Importing this module normally appends site-specific paths to the module search path and adds :ref:`callables <site-consts>`, including :func:`help` to the built-in namespace. However, Python startup option :option:`-S` blocks this and this module can be safely imported with no automatic modifications to the module search path or additions to the builtins. To explicitly trigger the usual site-specific additions, call the :func:`main` function.
sv: Import av denna modul lägger normalt till platsspecifika sökvägar till modulens sökväg och lägger till :ref:`callables <site-consts>`, inklusive :func:`help` till det inbyggda namnområdet. Pythons startalternativ :option:`-S` blockerar dock detta och den här modulen kan importeras på ett säkert sätt utan automatiska ändringar av modulens sökväg eller tillägg till de inbyggda namnrymderna. För att uttryckligen utlösa de vanliga platsspecifika tilläggen, anropa funktionen :func:`main`.

source: Importing the module used to trigger paths manipulation even when using :option:`-S`.
sv: Import av modulen utlöste tidigare manipulering av sökvägar även när :option:`-S` användes.

source: It starts by constructing up to four directories from a head and a tail part. For the head part, it uses ``sys.prefix`` and ``sys.exec_prefix``; empty heads are skipped. For the tail part, it uses the empty string and then :file:`lib/site-packages` (on Windows) or :file:`lib/python{X.Y[t]}/site-packages` (on Unix and macOS). (The optional suffix "t" indicates the :term:`free threading` build, and is appended if ``"t"`` is present in the :data:`sys.abiflags` constant.) For each of the distinct head-tail combinations, it sees if it refers to an existing directory, and if so, adds it to ``sys.path`` and also inspects the newly added path for configuration files.
sv: Den börjar med att konstruera upp till fyra kataloger från en huvud- och en svansdel. För huvuddelen används ```sys.prefix`` och ```sys.exec_prefix``; tomma huvuden hoppas över. För tail-delen används den tomma strängen och sedan :file:`lib/site-packages` (på Windows) eller :file:`lib/python{X.Y[t]}/site-packages` (på Unix och macOS). (Det valfria suffixet "t" anger :term:`free threading` build, och läggs till om ``"t"`` finns i konstanten :data:`sys.abiflags`) För var och en av de olika huvud-svans-kombinationerna undersöks om den hänvisar till en befintlig katalog, och om så är fallet läggs den till i ``sys.path`` och den nyligen tillagda sökvägen inspekteras även med avseende på konfigurationsfiler.

source: Support for the "site-python" directory has been removed.
sv: Stöd för katalogen "site-python" har tagits bort.

source: On Unix, :term:`Free threading <free threading>` Python installations are identified by the "t" suffix in the version-specific directory name, such as :file:`lib/python3.13t/`.
sv: På Unix identifieras :term:`Free threading <free threading>` Python-installationer med suffixet "t" i det versionsspecifika katalognamnet, till exempel :file:`lib/python3.13t/`.

source: :mod:`site` is no longer responsible for updating :data:`sys.prefix` and :data:`sys.exec_prefix` on :ref:`sys-path-init-virtual-environments`. This is now done during the :ref:`path initialization <sys-path-init>`. As a result, under :ref:`sys-path-init-virtual-environments`, :data:`sys.prefix` and :data:`sys.exec_prefix` no longer depend on the :mod:`site` initialization, and are therefore unaffected by :option:`-S`.
sv: :mod:`site` är inte längre ansvarig för uppdatering av :data:`sys.prefix` och :data:`sys.exec_prefix` på :ref:`sys-path-init-virtual-environments`. Detta görs nu under :ref:``path initialization <sys-path-init>`. Som ett resultat, under :ref:`sys-path-init-virtual-environments`, är :data:`sys.prefix` och :data:`sys.exec_prefix` inte längre beroende av initieringen av :mod:`site`, och påverkas därför inte av :option:`-S`.

source: When running under a :ref:`virtual environment <sys-path-init-virtual-environments>`, the ``pyvenv.cfg`` file in :data:`sys.prefix` is checked for site-specific configurations. If the ``include-system-site-packages`` key exists and is set to ``true`` (case-insensitive), the system-level prefixes will be searched for site-packages, otherwise they won't.
sv: När du kör under en :ref:`virtuell miljö <sys-path-init-virtual-environments>`, kontrolleras filen ``pyvenv.cfg`` i :data:`sys.prefix` för platsspecifika konfigurationer. Om nyckeln ``include-system-site-packages`` finns och är satt till ``true`` (skiftlägesokänslig), kommer prefixen på systemnivå att sökas efter site-packages, annars inte.

source: A path configuration file is a file whose name has the form :file:`{name}.pth` and exists in one of the four directories mentioned above; its contents are additional items (one per line) to be added to ``sys.path``. Non-existing items are never added to ``sys.path``, and no check is made that the item refers to a directory rather than a file. No item is added to ``sys.path`` more than once. Blank lines and lines beginning with ``#`` are skipped. Lines starting with ``import`` (followed by space or tab) are executed.
sv: En sökvägskonfigurationsfil är en fil vars namn har formen :file:`{name}.pth` och som finns i en av de fyra kataloger som nämns ovan; dess innehåll är ytterligare objekt (ett per rad) som ska läggas till i ``sys.path``. Icke-existerande objekt läggs aldrig till i ``sys.path``, och ingen kontroll görs av att objektet hänvisar till en katalog snarare än en fil. Inget objekt läggs till i ``sys.path`` mer än en gång. Tomma rader och rader som börjar med ``#`` hoppas över. Rader som börjar med ``import`` (följt av mellanslag eller tabb) exekveras.

source: An executable line in a :file:`.pth` file is run at every Python startup, regardless of whether a particular module is actually going to be used. Its impact should thus be kept to a minimum. The primary intended purpose of executable lines is to make the corresponding module(s) importable (load 3rd-party import hooks, adjust :envvar:`PATH` etc). Any other initialization is supposed to be done upon a module's actual import, if and when it happens. Limiting a code chunk to a single line is a deliberate measure to discourage putting anything more complex here.
sv: En exekverbar rad i en :file:`.pth`-fil körs vid varje Python-start, oavsett om en viss modul faktiskt kommer att användas. Dess inverkan bör därför hållas till ett minimum. Det primära syftet med körbara rader är att göra motsvarande modul(er) importerbar (ladda importkrokar från tredje part, justera :envvar:`PATH` etc). Alla andra initialiseringar ska göras när en modul faktiskt importeras, om och när det sker. Att begränsa en koddel till en enda rad är en avsiktlig åtgärd för att avskräcka från att lägga in något mer komplext här.

source: The :file:`.pth` files are now decoded by UTF-8 at first and then by the :term:`locale encoding` if it fails.
sv: Filerna :file:`.pth` avkodas nu först med UTF-8 och sedan med :term:`locale encoding` om det misslyckas.

source: For example, suppose ``sys.prefix`` and ``sys.exec_prefix`` are set to :file:`/usr/local`. The Python X.Y library is then installed in :file:`/usr/local/lib/python{X.Y}`. Suppose this has a subdirectory :file:`/usr/local/lib/python{X.Y}/site-packages` with three subsubdirectories, :file:`foo`, :file:`bar` and :file:`spam`, and two path configuration files, :file:`foo.pth` and :file:`bar.pth`. Assume :file:`foo.pth` contains the following::
sv: Anta till exempel att ``sys.prefix`` och ``sys.exec_prefix`` är inställda på :file:`/usr/local`. Python X.Y-biblioteket installeras sedan i :file:`/usr/local/lib/python{X.Y}`. Antag att detta har en underkatalog :file:`/usr/local/lib/python{X.Y}/site-packages` med tre underkataloger, :file:`foo`, :file:`bar` och :file:`spam`, och två sökvägskonfigurationsfiler, :file:`foo.pth` och :file:`bar.pth`. Antag att :file:`foo.pth` innehåller följande::

source: and :file:`bar.pth` contains::
sv: och :file:`bar.pth` innehåller::

source: Then the following version-specific directories are added to ``sys.path``, in this order::
sv: Sedan läggs följande versionsspecifika kataloger till i ``sys.path``, i denna ordning::

source: Note that :file:`bletch` is omitted because it doesn't exist; the :file:`bar` directory precedes the :file:`foo` directory because :file:`bar.pth` comes alphabetically before :file:`foo.pth`; and :file:`spam` is omitted because it is not mentioned in either path configuration file.
sv: Observera att :file:`bletch` utelämnas eftersom den inte finns; katalogen :file:`bar` föregår katalogen :file:`foo` eftersom :file:`bar.pth` kommer i alfabetisk ordning före :file:`foo.pth`; och :file:`spam` utelämnas eftersom den inte nämns i någon av sökvägskonfigurationsfilerna.

source: After these path manipulations, an attempt is made to import a module named :mod:`sitecustomize`, which can perform arbitrary site-specific customizations. It is typically created by a system administrator in the site-packages directory. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'sitecustomize'``, it is silently ignored. If Python is started without output streams available, as with :file:`pythonw.exe` on Windows (which is used by default to start IDLE), attempted output from :mod:`sitecustomize` is ignored. Any other exception causes a silent and perhaps mysterious failure of the process.
sv: Efter dessa sökvägsmanipulationer görs ett försök att importera en modul med namnet :mod:`sitecustomize`, som kan utföra godtyckliga platsspecifika anpassningar. Den skapas vanligtvis av en systemadministratör i katalogen site-packages. Om denna import misslyckas med ett :exc:`ImportError` eller dess underklassundantag, och undantagets :attr:`~ImportError.name`-attribut är lika med ``'sitecustomize'``, ignoreras det tyst. Om Python startas utan tillgängliga utdataströmmar, som med :file:`pythonw.exe` på Windows (som används som standard för att starta IDLE), ignoreras försök till utdata från :mod:`sitecustomize`. Alla andra undantag orsakar ett tyst och kanske mystiskt misslyckande av processen.

source: After this, an attempt is made to import a module named :mod:`usercustomize`, which can perform arbitrary user-specific customizations, if :data:`~site.ENABLE_USER_SITE` is true. This file is intended to be created in the user site-packages directory (see below), which is part of ``sys.path`` unless disabled by :option:`-s`. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'usercustomize'``, it is silently ignored.
sv: Efter detta görs ett försök att importera en modul med namnet :mod:`usercustomize`, som kan utföra godtyckliga användarspecifika anpassningar, om :data:`~site.ENABLE_USER_SITE` är true. Den här filen är avsedd att skapas i användarens site-packages-katalog (se nedan), som är en del av ``sys.path`` om den inte inaktiveras av :option:`-s`. Om denna import misslyckas med ett :exc:`ImportError` eller dess underklass undantag, och undantagets :attr:`~ImportError.name` attribut är lika med ``'usercustomize'``, ignoreras det i tysthet.

source: Note that for some non-Unix systems, ``sys.prefix`` and ``sys.exec_prefix`` are empty, and the path manipulations are skipped; however the import of :mod:`sitecustomize` and :mod:`usercustomize` is still attempted.
sv: Observera att för vissa icke-Unix-system är ``sys.prefix`` och ``sys.exec_prefix`` tomma och sökvägsmanipulationerna hoppas över; dock försöker man fortfarande importera :mod:`sitecustomize` och :mod:`usercustomize`.

source: Readline configuration
sv: Konfiguration av läslinje

source: On systems that support :mod:`readline`, this module will also import and configure the :mod:`rlcompleter` module, if Python is started in :ref:`interactive mode <tut-interactive>` and without the :option:`-S` option. The default behavior is enable tab-completion and to use :file:`~/.python_history` as the history save file. To disable it, delete (or override) the :data:`sys.__interactivehook__` attribute in your :mod:`sitecustomize` or :mod:`usercustomize` module or your :envvar:`PYTHONSTARTUP` file.
sv: På system som stöder :mod:`readline` kommer denna modul även att importera och konfigurera modulen :mod:`rlcompleter`, om Python startas i :ref:`interaktivt läge <tut-interactive>` och utan alternativet :option:`-S`. Standardinställningen är att aktivera tabkomplettering och att använda :file:`~/.python_history` som historikfil. För att inaktivera det, ta bort (eller åsidosätt) attributet :data:`sys.__interactivehook__` i din modul :mod:`sitecustomize` eller :mod:`usercustomize` eller din fil :envvar:`PYTHONSTARTUP`.

source: Activation of rlcompleter and history was made automatic.
sv: Aktivering av rlcompleter och historik gjordes automatiskt.

source: Module contents
sv: Modulens innehåll

source: A list of prefixes for site-packages directories.
sv: En lista med prefix för kataloger för site-packages.

source: Flag showing the status of the user site-packages directory. ``True`` means that it is enabled and was added to ``sys.path``. ``False`` means that it was disabled by user request (with :option:`-s` or :envvar:`PYTHONNOUSERSITE`). ``None`` means it was disabled for security reasons (mismatch between user or group id and effective id) or by an administrator.
sv: Flagga som visar status för användarkatalogen site-packages. ``True`` betyder att den är aktiverad och har lagts till i ``sys.path``. ``False`` betyder att den inaktiverades på begäran av användaren (med :option:`-s` eller :envvar:`PYTHONNOUSERSITE`). ``None`` betyder att den inaktiverades av säkerhetsskäl (felmatchning mellan användar- eller grupp-id och effektivt id) eller av en administratör.

source: Path to the user site-packages for the running Python. Can be ``None`` if :func:`getusersitepackages` hasn't been called yet. Default value is :file:`~/.local/lib/python{X.Y}[t]/site-packages` for UNIX and non-framework macOS builds, :file:`~/Library/Python/{X.Y}/lib/python/site-packages` for macOS framework builds, and :file:`{%APPDATA%}\\Python\\Python{XY}\\site-packages` on Windows. The optional "t" indicates the free-threaded build. This directory is a site directory, which means that :file:`.pth` files in it will be processed.
sv: Sökväg till användarens site-paket för den Python som körs. Kan vara ``None`` om :func:`getusersitepackages` inte har anropats ännu. Standardvärdet är :file:`~/.local/lib/python{X.Y}[t]/site-packages` för UNIX och macOS-byggnader utan ramverk, :file:`~/Library/Python/{X.Y}/lib/python/site-packages` för macOS-ramverk och :file:`{%APPDATA%}\\Python\Python{XY}\\site-packages` på Windows. Det valfria "t" indikerar fritt trådad byggnation. Den här katalogen är en site-katalog, vilket innebär att :file:`.pth'-filer i den kommer att bearbetas.

source: Path to the base directory for the user site-packages. Can be ``None`` if :func:`getuserbase` hasn't been called yet. Default value is :file:`~/.local` for UNIX and macOS non-framework builds, :file:`~/Library/Python/{X.Y}` for macOS framework builds, and :file:`{%APPDATA%}\\Python` for Windows. This value is used to compute the installation directories for scripts, data files, Python modules, etc. for the :ref:`user installation scheme <sysconfig-user-scheme>`. See also :envvar:`PYTHONUSERBASE`.
sv: Sökväg till baskatalogen för användarens site-paket. Kan vara ``None`` om :func:`getuserbase` inte har anropats ännu. Standardvärdet är :file:`~/.local` för UNIX och macOS utan ramverk, :file:`~/Library/Python/{X.Y}` för macOS med ramverk och :file:`{%APPDATA%}\\Python` för Windows. Detta värde används för att beräkna installationskatalogerna för skript, datafiler, Python-moduler etc. för :ref:`användarens installationsschema <sysconfig-user-scheme>`. Se även :envvar:`PYTHONUSERBASE`.

source: Adds all the standard site-specific directories to the module search path. This function is called automatically when this module is imported, unless the Python interpreter was started with the :option:`-S` flag.
sv: Lägger till alla standardkataloger som är specifika för webbplatsen till modulens sökväg. Denna funktion anropas automatiskt när denna modul importeras, såvida inte Python-tolken startades med flaggan :option:`-S`.

source: This function used to be called unconditionally.
sv: Denna funktion brukade tidigare anropas villkorslöst.

source: Add a directory to sys.path and process its :file:`.pth` files. Typically used in :mod:`sitecustomize` or :mod:`usercustomize` (see above).
sv: Lägg till en katalog i sys.path och bearbeta dess :file:`.pth`-filer. Används vanligen i :mod:`sitecustomize` eller :mod:`usercustomize` (se ovan).

source: Return a list containing all global site-packages directories.
sv: Returnerar en lista som innehåller alla globala site-packages-kataloger.

source: Return the path of the user base directory, :data:`USER_BASE`. If it is not initialized yet, this function will also set it, respecting :envvar:`PYTHONUSERBASE`.
sv: Returnerar sökvägen till användarens baskatalog, :data:`USER_BASE`. Om den inte är initialiserad ännu kommer den här funktionen också att ställa in den, med respekt för :envvar:`PYTHONUSERBASE`.

source: Return the path of the user-specific site-packages directory, :data:`USER_SITE`. If it is not initialized yet, this function will also set it, respecting :data:`USER_BASE`. To determine if the user-specific site-packages was added to ``sys.path`` :data:`ENABLE_USER_SITE` should be used.
sv: Returnerar sökvägen till den användarspecifika katalogen för webbplats-paket, :data:`USER_SITE`. Om den inte är initialiserad ännu kommer den här funktionen också att ställa in den, med respekt för :data:`USER_BASE`. För att avgöra om det användarspecifika webbplatspaketet har lagts till i ``sys.path`` bör :data:`ENABLE_USER_SITE` användas.

source: Command Line Interface
sv: Kommandoradsgränssnitt

source: The :mod:`site` module also provides a way to get the user directories from the command line:
sv: Modulen :mod:`site` ger också möjlighet att hämta användarkataloger från kommandoraden:

source: If it is called without arguments, it will print the contents of :data:`sys.path` on the standard output, followed by the value of :data:`USER_BASE` and whether the directory exists, then the same thing for :data:`USER_SITE`, and finally the value of :data:`ENABLE_USER_SITE`.
sv: Om den anropas utan argument skrivs innehållet i :data:`sys.path` ut på standardutmatningen, följt av värdet på :data:`USER_BASE` och om katalogen finns, sedan samma sak för :data:`USER_SITE` och slutligen värdet på :data:`ENABLE_USER_SITE`.

source: Print the path to the user base directory.
sv: Skriv ut sökvägen till användarens baskatalog.

source: Print the path to the user site-packages directory.
sv: Skriv ut sökvägen till användarens katalog för site-packages.

source: If both options are given, user base and user site will be printed (always in this order), separated by :data:`os.pathsep`.
sv: Om båda alternativen anges skrivs användarbas och användarwebbplats ut (alltid i denna ordning), åtskilda av :data:`os.pathsep`.

source: If any option is given, the script will exit with one of these values: ``0`` if the user site-packages directory is enabled, ``1`` if it was disabled by the user, ``2`` if it is disabled for security reasons or by an administrator, and a value greater than 2 if there is an error.
sv: Om något alternativ anges kommer skriptet att avslutas med ett av följande värden: ``0`` om användarkatalogen site-packages är aktiverad, ``1`` om den har inaktiverats av användaren, ``2`` om den har inaktiverats av säkerhetsskäl eller av en administratör, och ett värde större än 2 om ett fel har inträffat.

source: :pep:`370` -- Per user site-packages directory
sv: :pep:`370` -- Katalog för webbplats-paket för varje användare

source: :ref:`sys-path-init` -- The initialization of :data:`sys.path`.
sv: :ref:`sys-path-init` -- Initialisering av :data:`sys.path`.
