Repository: yeager/python-docs-sv
Catalog: library/smtplib.po
Languages: sv

source: :mod:`!smtplib` --- SMTP protocol client
sv: :mod:`!smtplib` --- Klient för SMTP-protokoll

source: **Source code:** :source:`Lib/smtplib.py`
sv: **Källkod:** :source:`Lib/smtplib.py`

source: The :mod:`smtplib` module defines an SMTP client session object that can be used to send mail to any internet machine with an SMTP or ESMTP listener daemon. For details of SMTP and ESMTP operation, consult :rfc:`821` (Simple Mail Transfer Protocol) and :rfc:`1869` (SMTP Service Extensions).
sv: Modulen :mod:`smtplib` definierar ett SMTP-klientsessionsobjekt som kan användas för att skicka e-post till en Internetmaskin med en SMTP- eller ESMTP-lyssnardemon. För detaljer om SMTP- och ESMTP-funktioner, se :rfc:`821` (Simple Mail Transfer Protocol) och :rfc:`1869` (SMTP Service Extensions).

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: An :class:`SMTP` instance encapsulates an SMTP connection. It has methods that support a full repertoire of SMTP and ESMTP operations. If the optional *host* and *port* parameters are given, the SMTP :meth:`connect` method is called with those parameters during initialization. If specified, *local_hostname* is used as the FQDN of the local host in the HELO/EHLO command. Otherwise, the local hostname is found using :func:`socket.getfqdn`. If the :meth:`connect` call returns anything other than a success code, an :exc:`SMTPConnectError` is raised. The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). If the timeout expires, :exc:`TimeoutError` is raised. The optional *source_address* parameter allows binding to some specific source address in a machine with multiple network interfaces, and/or to some specific source TCP port. It takes a 2-tuple ``(host, port)``, for the socket to bind to as its source address before connecting. If omitted (or if *host* or *port* are ``''`` and/or ``0`` respectively) the OS default behavior will be used.
sv: En :class:`SMTP`-instans kapslar in en SMTP-anslutning. Den har metoder som stöder en fullständig repertoar av SMTP- och ESMTP-operationer. Om de valfria parametrarna *host* och *port* anges, anropas SMTP :meth:`connect`-metoden med dessa parametrar under initialiseringen. Om *local_hostname* anges används det som FQDN för den lokala värden i HELO/EHLO-kommandot. Annars hittas det lokala värdnamnet med hjälp av :func:`socket.getfqdn`. Om anropet :meth:`connect` returnerar något annat än en framgångskod, genereras ett :exc:`SMTPConnectError`. Den valfria parametern *timeout* anger en timeout i sekunder för blockerande operationer som anslutningsförsöket (om den inte anges kommer den globala standardinställningen för timeout att användas). Om tidsgränsen överskrids utlöses :exc:`TimeoutError`. Den valfria parametern *source_address* gör det möjligt att binda till en specifik källadress i en maskin med flera nätverksgränssnitt och/eller till en specifik TCP-källport. Den tar en 2-tupel ``(host, port)``, för uttaget att binda till som sin källadress innan anslutning. Om detta utelämnas (eller om *host* eller *port* är ``''`` och/eller ``0``) kommer operativsystemets standardbeteende att användas.

source: For normal use, you should only require the initialization/connect, :meth:`sendmail`, and :meth:`SMTP.quit` methods. An example is included below.
sv: För normal användning bör du bara behöva metoderna initialisering/anslutning, :meth:`sendmail` och :meth:`SMTP.quit`. Ett exempel finns nedan.

source: The :class:`SMTP` class supports the :keyword:`with` statement. When used like this, the SMTP ``QUIT`` command is issued automatically when the :keyword:`!with` statement exits. E.g.::
sv: Klassen :class:`SMTP` har stöd för :keyword:`with`-satsen. När det används på det här sättet utfärdas SMTP-kommandot ``QUIT`` automatiskt när :keyword:`!with`-satsen avslutas. T.ex.::

source: All commands will raise an :ref:`auditing event <auditing>` ``smtplib.SMTP.send`` with arguments ``self`` and ``data``, where ``data`` is the bytes about to be sent to the remote host.
sv: Alla kommandon ger upphov till en :ref:`auditing event <auditing>` ``smtplib.SMTP.send`` med argumenten ``self`` och ``data``, där ``data`` är de bytes som ska skickas till fjärrvärden.

source: Support for the :keyword:`with` statement was added.
sv: Stöd för :keyword:`with` statement har lagts till.

source: *source_address* argument was added.
sv: *argumentet source_address* har lagts till.

source: The SMTPUTF8 extension (:rfc:`6531`) is now supported.
sv: SMTPUTF8-tillägget (:rfc:`6531`) stöds nu.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket.
sv: Om parametern *timeout* är noll kommer den att skapa ett :class:`ValueError` för att förhindra att en icke-blockerande socket skapas.

source: An :class:`SMTP_SSL` instance behaves exactly the same as instances of :class:`SMTP`. :class:`SMTP_SSL` should be used for situations where SSL is required from the beginning of the connection and using :meth:`starttls` is not appropriate. If *host* is not specified, the local host is used. If *port* is zero, the standard SMTP-over-SSL port (465) is used. The optional arguments *local_hostname*, *timeout* and *source_address* have the same meaning as they do in the :class:`SMTP` class. *context*, also optional, can contain a :class:`~ssl.SSLContext` and allows configuring various aspects of the secure connection. Please read :ref:`ssl-security` for best practices.
sv: En instans av :class:`SMTP_SSL` beter sig exakt likadant som instanser av :class:`SMTP`. :class:`SMTP_SSL` bör användas i situationer där SSL krävs från början av anslutningen och det inte är lämpligt att använda :meth:`starttls`. Om *host* inte specificeras används den lokala värden. Om *port* är noll används standardporten för SMTP-over-SSL (465). De valfria argumenten *local_hostname*, *timeout* och *source_address* har samma betydelse som de har i klassen :class:`SMTP`. *context*, som också är valfritt, kan innehålla en :class:`~ssl.SSLContext` och gör det möjligt att konfigurera olika aspekter av den säkra anslutningen. Läs :ref:`ssl-security` för bästa praxis.

source: *context* was added.
sv: *sammanhang* lades till.

source: The *source_address* argument was added.
sv: Argumentet *source_address* har lagts till.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
sv: Klassen stöder nu kontroll av värdnamn med :attr:`ssl.SSLContext.check_hostname` och *Server Name Indication* (se :const:`ssl.HAS_SNI`).

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket
sv: Om parametern *timeout* är noll kommer den att skapa ett :class:`ValueError` för att förhindra att ett icke-blockerande uttag skapas

source: The deprecated *keyfile* and *certfile* parameters have been removed.
sv: De föråldrade parametrarna *keyfile* och *certfile* har tagits bort.

source: The LMTP protocol, which is very similar to ESMTP, is heavily based on the standard SMTP client. It's common to use Unix sockets for LMTP, so our :meth:`connect` method must support that as well as a regular host:port server. The optional arguments *local_hostname* and *source_address* have the same meaning as they do in the :class:`SMTP` class. To specify a Unix socket, you must use an absolute path for *host*, starting with a '/'.
sv: LMTP-protokollet, som är mycket likt ESMTP, är starkt baserat på standard SMTP-klienten. Det är vanligt att använda Unix-sockets för LMTP, så vår :meth:`connect`-metod måste stödja detta såväl som en vanlig host:port-server. De valfria argumenten *local_hostname* och *source_address* har samma betydelse som de har i klassen :class:`SMTP`. För att ange en Unix-socket måste du använda en absolut sökväg för *host*, som börjar med '/'.

source: Authentication is supported, using the regular SMTP mechanism. When using a Unix socket, LMTP generally don't support or require any authentication, but your mileage might vary.
sv: Autentisering stöds med hjälp av den vanliga SMTP-mekanismen. När du använder ett Unix-uttag stöder eller kräver LMTP i allmänhet inte någon autentisering, men det kan variera.

source: The optional *timeout* parameter was added.
sv: Den valfria parametern *timeout* har lagts till.

source: A nice selection of exceptions is defined as well:
sv: Ett bra urval av undantag definieras också:

source: Subclass of :exc:`OSError` that is the base exception class for all the other exceptions provided by this module.
sv: Underklass till :exc:`OSError` som är basundantagsklassen för alla andra undantag som tillhandahålls av denna modul.

source: SMTPException became subclass of :exc:`OSError`
sv: SMTPException blev underklass till :exc:`OSError`

source: This exception is raised when the server unexpectedly disconnects, or when an attempt is made to use the :class:`SMTP` instance before connecting it to a server.
sv: Detta undantag uppstår när servern oväntat kopplas från, eller när man försöker använda :class:`SMTP`-instansen innan den ansluts till en server.

source: Base class for all exceptions that include an SMTP error code. These exceptions are generated in some instances when the SMTP server returns an error code. The error code is stored in the :attr:`smtp_code` attribute of the error, and the :attr:`smtp_error` attribute is set to the error message.
sv: Basklass för alla undantag som innehåller en SMTP-felkod. Dessa undantag genereras i vissa fall när SMTP-servern returnerar en felkod. Felkoden lagras i attributet :attr:`smtp_code` för felet, och attributet :attr:`smtp_error` sätts till felmeddelandet.

source: Sender address refused. In addition to the attributes set by on all :exc:`SMTPResponseException` exceptions, this sets 'sender' to the string that the SMTP server refused.
sv: Avsändaradressen nekades. Förutom de attribut som anges för alla :exc:`SMTPResponseException`-undantag, anger detta 'sender' till den sträng som SMTP-servern nekade.

source: All recipient addresses refused. The errors for each recipient are accessible through the attribute :attr:`recipients`, which is a dictionary of exactly the same sort as :meth:`SMTP.sendmail` returns.
sv: Alla mottagaradresser nekades. Felen för varje mottagare är tillgängliga via attributet :attr:`recipients`, som är en ordbok av exakt samma typ som :meth:`SMTP.sendmail` returnerar.

source: The SMTP server refused to accept the message data.
sv: SMTP-servern vägrade att acceptera meddelandedata.

source: Error occurred during establishment of a connection with the server.
sv: Ett fel inträffade när en anslutning till servern upprättades.

source: The server refused our ``HELO`` message.
sv: Servern avvisade vårt ``HELO``-meddelande.

source: The command or option attempted is not supported by the server.
sv: Kommandot eller alternativet stöds inte av servern.

source: SMTP authentication went wrong. Most probably the server didn't accept the username/password combination provided.
sv: SMTP-autentiseringen gick fel. Troligen accepterade inte servern den kombination av användarnamn och lösenord som angavs.

source: :rfc:`821` - Simple Mail Transfer Protocol
sv: :rfc:`821` - Protokoll för överföring av enkel e-post

source: Protocol definition for SMTP. This document covers the model, operating procedure, and protocol details for SMTP.
sv: Protokolldefinition för SMTP. Detta dokument beskriver modell, arbetssätt och protokolldetaljer för SMTP.

source: :rfc:`1869` - SMTP Service Extensions
sv: :rfc:`1869` - SMTP-tjänsttillägg

source: Definition of the ESMTP extensions for SMTP. This describes a framework for extending SMTP with new commands, supporting dynamic discovery of the commands provided by the server, and defines a few additional commands.
sv: Definition av ESMTP-tillägg för SMTP. Här beskrivs ett ramverk för att utöka SMTP med nya kommandon, med stöd för dynamisk identifiering av de kommandon som tillhandahålls av servern, och några ytterligare kommandon definieras.

source: SMTP Objects
sv: SMTP-objekt

source: An :class:`SMTP` instance has the following methods:
sv: En instans av :class:`SMTP` har följande metoder:

source: Set the debug output level. A value of 1 or ``True`` for *level* results in debug messages for connection and for all messages sent to and received from the server. A value of 2 for *level* results in these messages being timestamped.
sv: Ställer in nivån för felsökningsutmatning. Ett värde på 1 eller ``True`` för *level* resulterar i felsökningsmeddelanden för anslutning och för alla meddelanden som skickas till och tas emot från servern. Ett värde på 2 för *level* resulterar i att dessa meddelanden tidsstämplas.

source: Added debuglevel 2.
sv: Lagt till felsökningsnivå 2.

source: Send a command *cmd* to the server. The optional argument *args* is simply concatenated to the command, separated by a space.
sv: Skicka ett kommando *cmd* till servern. Det valfria argumentet *args* är helt enkelt sammanlänkat med kommandot, separerat med ett mellanslag.

source: This returns a 2-tuple composed of a numeric response code and the actual response line (multiline responses are joined into one long line.)
sv: Detta returnerar en 2-tupel som består av en numerisk svarskod och den faktiska svarsraden (svar med flera rader sammanfogas till en lång rad)

source: In normal operation it should not be necessary to call this method explicitly. It is used to implement other methods and may be useful for testing private extensions.
sv: I normal drift ska det inte vara nödvändigt att anropa denna metod explicit. Den används för att implementera andra metoder och kan vara användbar för att testa privata tillägg.

source: If the connection to the server is lost while waiting for the reply, :exc:`SMTPServerDisconnected` will be raised.
sv: Om anslutningen till servern bryts medan du väntar på svaret kommer :exc:`SMTPServerDisconnected` att aktiveras.

source: Connect to a host on a given port. The defaults are to connect to the local host at the standard SMTP port (25). If the hostname ends with a colon (``':'``) followed by a number, that suffix will be stripped off and the number interpreted as the port number to use. This method is automatically invoked by the constructor if a host is specified during instantiation. Returns a 2-tuple of the response code and message sent by the server in its connection response.
sv: Anslut till en värd på en given port. Standardinställningen är att ansluta till den lokala värden på standard SMTP-porten (25). Om värdnamnet slutar med ett kolon (``':'``) följt av ett nummer, kommer detta suffix att tas bort och numret tolkas som det portnummer som ska användas. Denna metod anropas automatiskt av konstruktören om en värd anges under instantiering. Returnerar en 2-tupel av svarskoden och meddelandet som skickas av servern i dess anslutningssvar.

source: Raises an :ref:`auditing event <auditing>` ``smtplib.connect`` with arguments ``self``, ``host``, ``port``.
sv: Utlöser en :ref:`auditing event <auditing>` ``smtplib.connect`` med argumenten ``self``, ``host``, ``port``.

source: Identify yourself to the SMTP server using ``HELO``. The hostname argument defaults to the fully qualified domain name of the local host. The message returned by the server is stored as the :attr:`helo_resp` attribute of the object.
sv: Identifiera dig för SMTP-servern med hjälp av ``HELO``. Argumentet hostname är som standard det fullständigt kvalificerade domännamnet för den lokala värden. Det meddelande som returneras av servern lagras som attributet :attr:`helo_resp` för objektet.

source: In normal operation it should not be necessary to call this method explicitly. It will be implicitly called by the :meth:`sendmail` when necessary.
sv: I normal drift bör det inte vara nödvändigt att anropa denna metod explicit. Den kommer att anropas implicit av :meth:`sendmail` när det behövs.

source: Identify yourself to an ESMTP server using ``EHLO``. The hostname argument defaults to the fully qualified domain name of the local host. Examine the response for ESMTP option and store them for use by :meth:`has_extn`. Also sets several informational attributes: the message returned by the server is stored as the :attr:`ehlo_resp` attribute, :attr:`does_esmtp` is set to ``True`` or ``False`` depending on whether the server supports ESMTP, and :attr:`esmtp_features` will be a dictionary containing the names of the SMTP service extensions this server supports, and their parameters (if any).
sv: Identifiera dig för en ESMTP-server med hjälp av ``EHLO``. Argumentet hostname är som standard det fullständigt kvalificerade domännamnet för den lokala värden. Undersöker svaret för ESMTP-alternativ och lagrar dem för användning av :meth:`has_extn`. Ställer också in flera informationsattribut: meddelandet som returneras av servern lagras som attributet :attr:`ehlo_resp`, :attr:`does_esmtp` sätts till ``True`` eller ``False`` beroende på om servern stöder ESMTP, och :attr:`esmtp_features` kommer att vara en ordbok som innehåller namnen på de SMTP-tjänsttillägg som denna server stöder och deras parametrar (om några).

source: Unless you wish to use :meth:`has_extn` before sending mail, it should not be necessary to call this method explicitly. It will be implicitly called by :meth:`sendmail` when necessary.
sv: Om du inte vill använda :meth:`has_extn` innan du skickar e-post, bör det inte vara nödvändigt att anropa denna metod explicit. Den kommer att anropas implicit av :meth:`sendmail` när det behövs.

source: This method calls :meth:`ehlo` and/or :meth:`helo` if there has been no previous ``EHLO`` or ``HELO`` command this session. It tries ESMTP ``EHLO`` first.
sv: Den här metoden anropar :meth:`ehlo` och/eller :meth:`helo` om det inte har funnits något tidigare ``EHLO``- eller ``HELO``-kommando i den här sessionen. Den försöker först med ESMTP ``EHLO``.

source: The server didn't reply properly to the ``HELO`` greeting.
sv: Servern svarade inte korrekt på hälsningsfrasen ``HELO``.

source: Return :const:`True` if *name* is in the set of SMTP service extensions returned by the server, :const:`False` otherwise. Case is ignored.
sv: Returnerar :const:`True` om *namn* finns med i uppsättningen SMTP-tjänsttillägg som returneras av servern, annars :const:`False`. Case ignoreras.

source: Check the validity of an address on this server using SMTP ``VRFY``. Returns a tuple consisting of code 250 and a full :rfc:`822` address (including human name) if the user address is valid. Otherwise returns an SMTP error code of 400 or greater and an error string.
sv: Kontrollerar giltigheten för en adress på denna server med hjälp av SMTP ``VRFY``. Returnerar en tupel bestående av kod 250 och en fullständig :rfc:`822`-adress (inklusive mänskligt namn) om användaradressen är giltig. I annat fall returneras en SMTP-felkod på 400 eller högre och en felsträng.

source: Many sites disable SMTP ``VRFY`` in order to foil spammers.
sv: Många webbplatser inaktiverar SMTP ``VRFY`` för att motverka spammare.

source: Log in on an SMTP server that requires authentication. The arguments are the username and the password to authenticate with. If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. This method will return normally if the authentication was successful, or may raise the following exceptions:
sv: Logga in på en SMTP-server som kräver autentisering. Argumenten är användarnamnet och lösenordet som ska användas för autentisering. Om det inte har förekommit något tidigare ``EHLO``- eller ``HELO``-kommando i den här sessionen, försöker den här metoden först med ESMTP ``EHLO``. Denna metod returnerar normalt om autentiseringen lyckades, eller kan ge upphov till följande undantag:

source: The server didn't accept the username/password combination.
sv: Servern accepterade inte kombinationen av användarnamn/lösenord.

source: The ``AUTH`` command is not supported by the server.
sv: Kommandot ``AUTH`` stöds inte av servern.

source: No suitable authentication method was found.
sv: Ingen lämplig autentiseringsmetod hittades.

source: Each of the authentication methods supported by :mod:`smtplib` are tried in turn if they are advertised as supported by the server. See :meth:`auth` for a list of supported authentication methods. *initial_response_ok* is passed through to :meth:`auth`.
sv: Alla autentiseringsmetoder som stöds av :mod:`smtplib` prövas i tur och ordning om de annonseras som stödda av servern. Se :meth:`auth` för en lista över autentiseringsmetoder som stöds. *initial_response_ok* skickas vidare till :meth:`auth`.

source: Optional keyword argument *initial_response_ok* specifies whether, for authentication methods that support it, an "initial response" as specified in :rfc:`4954` can be sent along with the ``AUTH`` command, rather than requiring a challenge/response.
sv: Det valfria nyckelordsargumentet *initial_response_ok* anger om, för autentiseringsmetoder som stöder detta, ett "initialt svar" enligt :rfc:`4954` kan skickas tillsammans med kommandot ``AUTH``, i stället för att kräva en utmaning/svar.

source: :exc:`SMTPNotSupportedError` may be raised, and the *initial_response_ok* parameter was added.
sv: :exc:`SMTPNotSupportedError` kan uppstå, och parametern *initial_response_ok* har lagts till.

source: Issue an ``SMTP`` ``AUTH`` command for the specified authentication *mechanism*, and handle the challenge response via *authobject*.
sv: Utfärda ett ``SMTP`` ``AUTH``-kommando för den angivna autentiseringsmekanismen och hantera utmaningsvaret via *authobject*.

source: *mechanism* specifies which authentication mechanism is to be used as argument to the ``AUTH`` command; the valid values are those listed in the ``auth`` element of :attr:`esmtp_features`.
sv: *mechanism* anger vilken autentiseringsmekanism som skall användas som argument till kommandot ``AUTH``; de giltiga värdena är de som anges i elementet ``auth`` i :attr:`esmtp_features`.

source: *authobject* must be a callable object taking an optional single argument::
sv: *authobject* måste vara ett anropbart objekt som tar ett valfritt enda argument::

source: data = authobject(challenge=None)
sv: data = authobject(utmaning=None)

source: If optional keyword argument *initial_response_ok* is true, ``authobject()`` will be called first with no argument. It can return the :rfc:`4954` "initial response" ASCII ``str`` which will be encoded and sent with the ``AUTH`` command as below. If the ``authobject()`` does not support an initial response (e.g. because it requires a challenge), it should return ``None`` when called with ``challenge=None``. If *initial_response_ok* is false, then ``authobject()`` will not be called first with ``None``.
sv: Om det valfria nyckelordsargumentet *initial_response_ok* är sant, kommer ``authobject()`` att anropas först utan något argument. Den kan returnera :rfc:`4954` "initial response" ASCII ``str`` som kommer att kodas och skickas med ``AUTH`` kommandot enligt nedan. Om ``authobject()`` inte stöder ett initialt svar (t.ex. för att det kräver en utmaning), bör det returnera ``None`` när det anropas med ``challenge=None``. Om *initial_response_ok* är false, så kommer inte ``authobject()`` att anropas först med ``None``.
