Repository: yeager/python-docs-sv
Catalog: library/smtplib.po
Languages: sv

source: If the initial response check returns ``None``, or if *initial_response_ok* is false, ``authobject()`` will be called to process the server's challenge response; the *challenge* argument it is passed will be a ``bytes``. It should return ASCII ``str`` *data* that will be base64 encoded and sent to the server.
sv: Om den initiala svarskontrollen returnerar ``None``, eller om *initial_response_ok* är false, kommer ``authobject()`` att anropas för att bearbeta serverns utmaningssvar; argumentet *challenge* som den skickas till kommer att vara en ``bytes``. Den bör returnera ASCII ``str`` *data* som kommer att base64-kodas och skickas till servern.

source: The ``SMTP`` class provides ``authobjects`` for the ``CRAM-MD5``, ``PLAIN``, and ``LOGIN`` mechanisms; they are named ``SMTP.auth_cram_md5``, ``SMTP.auth_plain``, and ``SMTP.auth_login`` respectively. They all require that the ``user`` and ``password`` properties of the ``SMTP`` instance are set to appropriate values.
sv: Klassen ``SMTP`` tillhandahåller ``authobjects`` för mekanismerna ``CRAM-MD5``, ``PLAIN`` och ``LOGIN``; de heter ``SMTP.auth_cram_md5``, ``SMTP.auth_plain`` respektive ``SMTP.auth_login``. De kräver alla att egenskaperna ``user`` och ``password`` i ``SMTP``-instansen är inställda på lämpliga värden.

source: User code does not normally need to call ``auth`` directly, but can instead call the :meth:`login` method, which will try each of the above mechanisms in turn, in the order listed. ``auth`` is exposed to facilitate the implementation of authentication methods not (or not yet) supported directly by :mod:`smtplib`.
sv: Användarkoden behöver normalt inte anropa ``auth`` direkt, utan kan istället anropa metoden :meth:`login``, som kommer att prova var och en av ovanstående mekanismer i tur och ordning, i den ordning som anges. ``auth`` är exponerad för att underlätta implementeringen av autentiseringsmetoder som inte (eller ännu inte) stöds direkt av :mod:`smtplib`.

source: Put the SMTP connection in TLS (Transport Layer Security) mode. All SMTP commands that follow will be encrypted. You should then call :meth:`ehlo` again.
sv: Sätt SMTP-anslutningen i TLS-läge (Transport Layer Security). Alla SMTP-kommandon som följer kommer att krypteras. Du bör sedan anropa :meth:`ehlo` igen.

source: If *keyfile* and *certfile* are provided, they are used to create an :class:`ssl.SSLContext`.
sv: Om *keyfile* och *certfile* anges används de för att skapa en :class:`ssl.SSLContext`.

source: Optional *context* parameter is an :class:`ssl.SSLContext` object; This is an alternative to using a keyfile and a certfile and if specified both *keyfile* and *certfile* should be ``None``.
sv: Den valfria parametern *context* är ett :class:`ssl.SSLContext`-objekt; Detta är ett alternativ till att använda en keyfile och en certfile och om både *keyfile* och *certfile* anges bör de vara ``None``.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first.
sv: Om det inte har funnits något tidigare ``EHLO``- eller ``HELO``-kommando i den här sessionen, försöker den här metoden ESMTP ``EHLO`` först.

source: The server does not support the STARTTLS extension.
sv: Servern har inte stöd för tillägget STARTTLS.

source: SSL/TLS support is not available to your Python interpreter.
sv: SSL/TLS-stöd är inte tillgängligt för din Python-tolk.

source: The method now supports hostname check with :attr:`SSLContext.check_hostname` and *Server Name Indicator* (see :const:`~ssl.HAS_SNI`).
sv: Metoden stöder nu kontroll av värdnamn med :attr:`SSLContext.check_hostname` och *Server Name Indicator* (se :const:`~ssl.HAS_SNI`).

source: The error raised for lack of STARTTLS support is now the :exc:`SMTPNotSupportedError` subclass instead of the base :exc:`SMTPException`.
sv: Felet som uppstår på grund av avsaknad av STARTTLS-stöd är nu underklassen :exc:`SMTPNotSupportedError` istället för basen :exc:`SMTPException`.

source: Send mail. The required arguments are an :rfc:`822` from-address string, a list of :rfc:`822` to-address strings (a bare string will be treated as a list with 1 address), and a message string. The caller may pass a list of ESMTP options (such as ``8bitmime``) to be used in ``MAIL FROM`` commands as *mail_options*. ESMTP options (such as ``DSN`` commands) that should be used with all ``RCPT`` commands can be passed as *rcpt_options*. (If you need to use different ESMTP options to different recipients you have to use the low-level methods such as :meth:`mail`, :meth:`rcpt` and :meth:`data` to send the message.)
sv: Skicka e-post. De nödvändiga argumenten är en :rfc:`822` från-adresssträng, en lista med :rfc:`822` till-adresssträngar (en naken sträng kommer att behandlas som en lista med 1 adress) och en meddelandesträng. Den som anropar kan skicka en lista med ESMTP-alternativ (t.ex. ``8bitmime``) som ska användas i ``MAIL FROM``-kommandon som *mail_options*. ESMTP-alternativ (t.ex. ``DSN``-kommandon) som ska användas med alla ``RCPT``-kommandon kan skickas som *rcpt_options*. (Om du behöver använda olika ESMTP-alternativ till olika mottagare måste du använda lågnivåmetoder som :meth:`mail`, :meth:`rcpt` och :meth:`data` för att skicka meddelandet)

source: The *from_addr* and *to_addrs* parameters are used to construct the message envelope used by the transport agents. ``sendmail`` does not modify the message headers in any way.
sv: Parametrarna *from_addr* och *to_addrs* används för att konstruera det meddelandekuvert som används av transportagenterna. ``sendmail`` ändrar inte meddelandehuvudena på något sätt.

source: *msg* may be a string containing characters in the ASCII range, or a byte string. A string is encoded to bytes using the ascii codec, and lone ``\r`` and ``\n`` characters are converted to ``\r\n`` characters. A byte string is not modified.
sv: *msg* kan vara en sträng som innehåller tecken i ASCII-intervallet eller en bytesträng. En sträng kodas till byte med hjälp av ascii-kodeken, och ensamma "r"- och "n"-tecken konverteras till "r"-tecken. En byte-sträng modifieras inte.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. If the server does ESMTP, message size and each of the specified options will be passed to it (if the option is in the feature set the server advertises). If ``EHLO`` fails, ``HELO`` will be tried and ESMTP options suppressed.
sv: Om det inte har förekommit något tidigare ``EHLO``- eller ``HELO``-kommando i den här sessionen, försöker den här metoden först med ESMTP ``EHLO``. Om servern använder ESMTP skickas meddelandestorlek och alla angivna alternativ till den (om alternativet finns i den funktionsuppsättning som servern annonserar). Om ``EHLO`` misslyckas, kommer ``HELO`` att provas och ESMTP-alternativen undertrycks.

source: This method will return normally if the mail is accepted for at least one recipient. Otherwise it will raise an exception. That is, if this method does not raise an exception, then someone should get your mail. If this method does not raise an exception, it returns a dictionary, with one entry for each recipient that was refused. Each entry contains a tuple of the SMTP error code and the accompanying error message sent by the server.
sv: Denna metod returnerar normalt om posten accepteras för minst en mottagare. Annars kommer den att ge upphov till ett undantag. Det vill säga, om den här metoden inte ger upphov till ett undantag bör någon få din e-post. Om den här metoden inte ger upphov till ett undantag returneras en ordbok med en post för varje mottagare som nekades. Varje post innehåller en tupel av SMTP-felkoden och det tillhörande felmeddelandet som skickas av servern.

source: If ``SMTPUTF8`` is included in *mail_options*, and the server supports it, *from_addr* and *to_addrs* may contain non-ASCII characters.
sv: Om ``SMTPUTF8`` ingår i *mail_options* och servern stöder det, kan *from_addr* och *to_addrs* innehålla icke-ASCII-tecken.

source: This method may raise the following exceptions:
sv: Denna metod kan ge upphov till följande undantag:

source: All recipients were refused. Nobody got the mail. The :attr:`recipients` attribute of the exception object is a dictionary with information about the refused recipients (like the one returned when at least one recipient was accepted).
sv: Alla mottagare nekades. Ingen fick mailet. Attributet :attr:`recipients` i exception-objektet är en ordbok med information om de avvisade mottagarna (som den som returneras när minst en mottagare accepterades).

source: The server didn't accept the *from_addr*.
sv: Servern accepterade inte *from_addr*.

source: The server replied with an unexpected error code (other than a refusal of a recipient).
sv: Servern svarade med en oväntad felkod (annat än att en mottagare nekades).

source: ``SMTPUTF8`` was given in the *mail_options* but is not supported by the server.
sv: ``SMTPUTF8`` angavs i *mail_options* men stöds inte av servern.

source: Unless otherwise noted, the connection will be open even after an exception is raised.
sv: Om inget annat anges kommer anslutningen att vara öppen även efter att ett undantag har uppstått.

source: *msg* may be a byte string.
sv: *msg* kan vara en byte-sträng.

source: ``SMTPUTF8`` support added, and :exc:`SMTPNotSupportedError` may be raised if ``SMTPUTF8`` is specified but the server does not support it.
sv: stöd för ``SMTPUTF8`` har lagts till, och :exc:`SMTPNotSupportedError`` kan uppstå om ``SMTPUTF8`` anges men servern inte stöder det.

source: This is a convenience method for calling :meth:`sendmail` with the message represented by an :class:`email.message.Message` object. The arguments have the same meaning as for :meth:`sendmail`, except that *msg* is a ``Message`` object.
sv: Detta är en bekvämlighetsmetod för att anropa :meth:`sendmail` med ett meddelande som representeras av ett :class:`email.message.Message`-objekt. Argumenten har samma betydelse som för :meth:`sendmail`, förutom att *msg* är ett ``Message``-objekt.

source: If *from_addr* is ``None`` or *to_addrs* is ``None``, ``send_message`` fills those arguments with addresses extracted from the headers of *msg* as specified in :rfc:`5322`\: *from_addr* is set to the :mailheader:`Sender` field if it is present, and otherwise to the :mailheader:`From` field. *to_addrs* combines the values (if any) of the :mailheader:`To`, :mailheader:`Cc`, and :mailheader:`Bcc` fields from *msg*. If exactly one set of :mailheader:`Resent-*` headers appear in the message, the regular headers are ignored and the :mailheader:`Resent-*` headers are used instead. If the message contains more than one set of :mailheader:`Resent-*` headers, a :exc:`ValueError` is raised, since there is no way to unambiguously detect the most recent set of :mailheader:`Resent-` headers.
sv: Om *from_addr* är ``None`` eller *to_addrs* är ``None``, fyller ``send_message`` dessa argument med adresser som hämtats från rubrikerna i *msg* enligt :rfc:`5322``: *from_addr* sätts till fältet :mailheader:`Sender` om det finns, och annars till fältet :mailheader:`From`. *to_addrs* kombinerar värdena (om sådana finns) i fälten :mailheader:`To`, :mailheader:`Cc` och :mailheader:`Bcc` från *msg*. Om det finns exakt en uppsättning :mailheader:`Resent-*`-rubriker i meddelandet ignoreras de vanliga rubrikerna och :mailheader:`Resent-*`-rubrikerna används i stället. Om meddelandet innehåller mer än en uppsättning :mailheader:`Resent-*`-rubriker, uppstår ett :exc:`ValueError`, eftersom det inte finns något sätt att entydigt upptäcka den senaste uppsättningen :mailheader:`Resent-`-rubriker.

source: ``send_message`` serializes *msg* using :class:`~email.generator.BytesGenerator` with ``\r\n`` as the *linesep*, and calls :meth:`sendmail` to transmit the resulting message. Regardless of the values of *from_addr* and *to_addrs*, ``send_message`` does not transmit any :mailheader:`Bcc` or :mailheader:`Resent-Bcc` headers that may appear in *msg*. If any of the addresses in *from_addr* and *to_addrs* contain non-ASCII characters and the server does not advertise ``SMTPUTF8`` support, an :exc:`SMTPNotSupportedError` is raised. Otherwise the ``Message`` is serialized with a clone of its :mod:`~email.policy` with the :attr:`~email.policy.EmailPolicy.utf8` attribute set to ``True``, and ``SMTPUTF8`` and ``BODY=8BITMIME`` are added to *mail_options*.
sv: ``send_message`` serialiserar *msg* med hjälp av :class:`~email.generator.BytesGenerator` med ``\r\n`` som *linjesep*, och anropar :meth:`sendmail` för att skicka det resulterande meddelandet. Oavsett värdena på *from_addr* och *to_addrs* överför inte ``send_message`` några :mailheader:`Bcc`- eller :mailheader:`Resent-Bcc`-rubriker som kan förekomma i *msg*. Om någon av adresserna i *from_addr* och *to_addrs* innehåller icke-ASCII tecken och servern inte annonserar ``SMTPUTF8`` stöd, kommer ett :exc:`SMTPNotSupportedError`` att uppstå. Annars serialiseras ``Message`` med en klon av dess :mod:`~email.policy` med attributet :attr:`~email.policy.EmailPolicy.utf8`` satt till ``True``, och ``SMTPUTF8`` och ``BODY=8BITMIME`` läggs till i *mail_options*.

source: Support for internationalized addresses (``SMTPUTF8``).
sv: Stöd för internationaliserade adresser (``SMTPUTF8``).

source: Terminate the SMTP session and close the connection. Return the result of the SMTP ``QUIT`` command.
sv: Avslutar SMTP-sessionen och stänger anslutningen. Returnerar resultatet av SMTP-kommandot ``QUIT``.

source: Low-level methods corresponding to the standard SMTP/ESMTP commands ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT``, and ``DATA`` are also supported. Normally these do not need to be called directly, so they are not documented here. For details, consult the module code.
sv: Lågnivåmetoder som motsvarar standard SMTP/ESMTP-kommandona ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT`` och ``DATA`` stöds också. Normalt behöver dessa inte anropas direkt, så de är inte dokumenterade här. För mer information, se modulens kod.

source: SMTP Example
sv: SMTP Exempel

source: This example prompts the user for addresses needed in the message envelope ('To' and 'From' addresses), and the message to be delivered. Note that the headers to be included with the message must be included in the message as entered; this example doesn't do any processing of the :rfc:`822` headers. In particular, the 'To' and 'From' addresses must be included in the message headers explicitly::
sv: I detta exempel uppmanas användaren att ange de adresser som behövs i meddelandekuvertet ("Till"- och "Från"-adresser) och det meddelande som ska levereras. Observera att de rubriker som ska ingå i meddelandet måste ingå i meddelandet som det anges; i detta exempel görs ingen bearbetning av :rfc:`822`-rubrikerna. I synnerhet måste adresserna "To" och "From" uttryckligen ingå i meddelanderubrikerna::

source: In general, you will want to use the :mod:`email` package's features to construct an email message, which you can then send via :meth:`~smtplib.SMTP.send_message`; see :ref:`email-examples`.
sv: I allmänhet vill du använda :mod:`email`-paketets funktioner för att konstruera ett e-postmeddelande, som du sedan kan skicka via :meth:`~smtplib.SMTP.send_message`; se :ref:`email-examples`.

source: protocol
sv: protokoll

source: Simple Mail Transfer Protocol
sv: Protokoll för överföring av enkel e-post
