Repository: yeager/python-docs-sv
Catalog: library/socketserver.po
Languages: sv

source: This function is called when the :attr:`timeout` attribute has been set to a value other than :const:`None` and the timeout period has passed with no requests being received. The default action for forking servers is to collect the status of any child processes that have exited, while in threading servers this method does nothing.
sv: Denna funktion anropas när attributet :attr:`timeout` har angetts till ett annat värde än :const:`None` och timeout-perioden har löpt ut utan att några begäranden har tagits emot. Standardåtgärden för forking-servrar är att samla in status för alla underordnade processer som har avslutats, medan den här metoden inte gör någonting i threading-servrar.

source: Calls :meth:`finish_request` to create an instance of the :attr:`RequestHandlerClass`. If desired, this function can create a new process or thread to handle the request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` classes do this.
sv: Anropar :meth:`finish_request` för att skapa en instans av :attr:`RequestHandlerClass`. Om så önskas kan denna funktion skapa en ny process eller tråd för att hantera begäran; klasserna :class:`ForkingMixIn` och :class:`ThreadingMixIn` gör detta.

source: Called by the server's constructor to activate the server. The default behavior for a TCP server just invokes :meth:`~socket.socket.listen` on the server's socket. May be overridden.
sv: Anropas av serverkonstruktören för att aktivera servern. Standardbeteendet för en TCP-server anropar bara :meth:`~socket.socket.listen` på serverns socket. Kan åsidosättas.

source: Called by the server's constructor to bind the socket to the desired address. May be overridden.
sv: Anropas av serverkonstruktören för att binda sockeln till önskad adress. Kan åsidosättas.

source: Must return a Boolean value; if the value is :const:`True`, the request will be processed, and if it's :const:`False`, the request will be denied. This function can be overridden to implement access controls for a server. The default implementation always returns :const:`True`.
sv: Måste returnera ett booleskt värde; om värdet är :const:`True` kommer begäran att behandlas, och om det är :const:`False` kommer begäran att nekas. Denna funktion kan åsidosättas för att implementera åtkomstkontroller för en server. Standardimplementeringen returnerar alltid :const:`True`.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`server_close`.
sv: Stöd för protokollet :term:`context manager` har lagts till. Att avsluta kontexthanteraren är likvärdigt med att anropa :meth:`server_close`.

source: Request Handler Objects
sv: Objekt för hantering av begäran

source: This is the superclass of all request handler objects. It defines the interface, given below. A concrete request handler subclass must define a new :meth:`handle` method, and can override any of the other methods. A new instance of the subclass is created for each request.
sv: Detta är superklassen för alla request handler-objekt. Den definierar det gränssnitt som anges nedan. En konkret subklass av request handler måste definiera en ny :meth:`handle`-metod och kan åsidosätta alla andra metoder. En ny instans av subklassen skapas för varje begäran.

source: Called before the :meth:`handle` method to perform any initialization actions required. The default implementation does nothing.
sv: Anropas före :meth:`handle`-metoden för att utföra eventuella initialiseringsåtgärder som krävs. Standardimplementationen gör ingenting.

source: This function must do all the work required to service a request. The default implementation does nothing. Several instance attributes are available to it; the request is available as :attr:`request`; the client address as :attr:`client_address`; and the server instance as :attr:`server`, in case it needs access to per-server information.
sv: Denna funktion måste göra allt arbete som krävs för att hantera en begäran. Standardimplementationen gör ingenting. Flera instansattribut är tillgängliga för den; begäran är tillgänglig som :attr:`request`; klientadressen som :attr:`client_address`; och serverinstansen som :attr:`server`, om den behöver tillgång till information per server.

source: The type of :attr:`request` is different for datagram or stream services. For stream services, :attr:`request` is a socket object; for datagram services, :attr:`request` is a pair of string and socket.
sv: Typen av :attr:`request` är olika för datagram- och strömtjänster. För strömtjänster är :attr:`request` ett socket-objekt; för datagramtjänster är :attr:`request` ett par av string och socket.

source: Called after the :meth:`handle` method to perform any clean-up actions required. The default implementation does nothing. If :meth:`setup` raises an exception, this function will not be called.
sv: Anropas efter :meth:`handle`-metoden för att utföra eventuella rengöringsåtgärder som krävs. Standardimplementationen gör ingenting. Om :meth:`setup` ger upphov till ett undantag, kommer denna funktion inte att anropas.

source: The *new* :class:`socket.socket` object to be used to communicate with the client.
sv: Det *nya* :class:`socket.socket`-objektet som ska användas för att kommunicera med klienten.

source: Client address returned by :meth:`BaseServer.get_request`.
sv: Klientadress som returneras av :meth:`BaseServer.get_request`.

source: :class:`BaseServer` object used for handling the request.
sv: :class:`BaseServer`-objekt som används för att hantera begäran.

source: These :class:`BaseRequestHandler` subclasses override the :meth:`~BaseRequestHandler.setup` and :meth:`~BaseRequestHandler.finish` methods, and provide :attr:`rfile` and :attr:`wfile` attributes.
sv: Dessa :class:`BaseRequestHandler` subklasser åsidosätter metoderna :meth:`~BaseRequestHandler.setup` och :meth:`~BaseRequestHandler.finish`, och tillhandahåller attributen :attr:`rfile` och :attr:`wfile`.

source: A file object from which receives the request is read. Support the :class:`io.BufferedIOBase` readable interface.
sv: Ett filobjekt som tar emot begäran läses från. Stöder det läsbara gränssnittet :class:`io.BufferedIOBase`.

source: A file object to which the reply is written. Support the :class:`io.BufferedIOBase` writable interface
sv: Ett filobjekt som svaret skrivs till. Stöder det skrivbara gränssnittet :class:`io.BufferedIOBase`

source: :attr:`wfile` also supports the :class:`io.BufferedIOBase` writable interface.
sv: :attr:`wfile` stöder också det skrivbara gränssnittet :class:`io.BufferedIOBase`.

source: Examples
sv: Exempel

source: :class:`socketserver.TCPServer` Example
sv: :class:`socketserver.TCPServer` Exempel

source: This is the server side::
sv: Detta är serversidan::

source: An alternative request handler class that makes use of streams (file-like objects that simplify communication by providing the standard file interface)::
sv: En alternativ klass för hantering av förfrågningar som använder sig av strömmar (filliknande objekt som förenklar kommunikation genom att tillhandahålla standardgränssnittet för filer)::

source: The difference is that the ``readline()`` call in the second handler will call ``recv()`` multiple times until it encounters a newline character, while the first handler had to use a ``recv()`` loop to accumulate data until a newline itself. If it had just used a single ``recv()`` without the loop it would just have returned what has been received so far from the client. TCP is stream based: data arrives in the order it was sent, but there no correlation between client ``send()`` or ``sendall()`` calls and the number of ``recv()`` calls on the server required to receive it.
sv: Skillnaden är att ``readline()``-anropet i den andra hanteraren kommer att anropa ``recv()`` flera gånger tills den stöter på ett tecken för ny rad, medan den första hanteraren måste använda en ``recv()``-loop för att ackumulera data tills den själv stöter på en ny rad. Om den bara hade använt en enda ``recv()`` utan slingan skulle den bara ha returnerat det som hittills har tagits emot från klienten. TCP är strömbaserat: data anländer i den ordning de skickades, men det finns ingen korrelation mellan klientens ```end()`` eller ```endall()``-anrop och antalet ``recv()``-anrop på servern som krävs för att ta emot dem.

source: This is the client side::
sv: Detta är klientsidan::

source: The output of the example should look something like this:
sv: Utdata från exemplet bör se ut ungefär så här:

source: Client:
sv: Klient:

source: :class:`socketserver.UDPServer` Example
sv: :class:`socketserver.UDPServer` Exempel

source: The output of the example should look exactly like for the TCP server example.
sv: Utdata från exemplet ska se ut precis som i exemplet med TCP-servern.

source: Asynchronous Mixins
sv: Asynkrona mixins

source: To build asynchronous handlers, use the :class:`ThreadingMixIn` and :class:`ForkingMixIn` classes.
sv: Om du vill bygga asynkrona hanterare använder du klasserna :class:`ThreadingMixIn` och :class:`ForkingMixIn`.

source: An example for the :class:`ThreadingMixIn` class::
sv: Ett exempel för klassen :class:`ThreadingMixIn`::

source: The :class:`ForkingMixIn` class is used in the same way, except that the server will spawn a new process for each request. Available only on POSIX platforms that support :func:`~os.fork`.
sv: Klassen :class:`ForkingMixIn` används på samma sätt, med skillnaden att servern skapar en ny process för varje förfrågan. Endast tillgänglig på POSIX-plattformar som stöder :func:`~os.fork`.
