Repository: yeager/python-docs-sv
Catalog: library/socket.po
Languages: sv

source: Set the :ref:`inheritable flag <fd_inheritance>` of the socket's file descriptor or socket's handle.
sv: Ställ in :ref:`ärvbarhetsflaggan <fd_inheritance>` för socketens filbeskrivare eller socketens handtag.

source: Set blocking or non-blocking mode of the socket: if *flag* is false, the socket is set to non-blocking, else to blocking mode.
sv: Ställ in blockerande eller icke-blockerande läge för uttaget: om *flag* är false ställs uttaget in på icke-blockerande, annars på blockerande läge.

source: This method is a shorthand for certain :meth:`~socket.settimeout` calls:
sv: Denna metod är en kortform för vissa :meth:`~socket.settimeout`-anrop:

source: ``sock.setblocking(True)`` is equivalent to ``sock.settimeout(None)``
sv: ```sock.setblocking(True)`` är likvärdigt med ```sock.settimeout(None)``

source: ``sock.setblocking(False)`` is equivalent to ``sock.settimeout(0.0)``
sv: ```sock.setblocking(False)`` är likvärdigt med ```sock.settimeout(0.0)``

source: The method no longer applies :const:`SOCK_NONBLOCK` flag on :attr:`socket.type`.
sv: Metoden tillämpar inte längre :const:`SOCK_NONBLOCK`-flaggan på :attr:`socket.type`.

source: Set a timeout on blocking socket operations. The *value* argument can be a nonnegative floating-point number expressing seconds, or ``None``. If a non-zero value is given, subsequent socket operations will raise a :exc:`timeout` exception if the timeout period *value* has elapsed before the operation has completed. If zero is given, the socket is put in non-blocking mode. If ``None`` is given, the socket is put in blocking mode.
sv: Ställer in en timeout för blockering av socket-operationer. Argumentet *value* kan vara ett icke-negativt flyttal som uttrycker sekunder, eller ``None``. Om ett värde som inte är noll anges kommer efterföljande socket-operationer att ge upphov till ett :exc:`timeout`-undantag om timeout-perioden *value* har löpt ut innan operationen har slutförts. Om noll anges sätts uttaget i icke-blockerande läge. Om ``None`` anges sätts uttaget i blockeringsläge.

source: For further information, please consult the :ref:`notes on socket timeouts <socket-timeouts>`.
sv: För mer information, se :ref:`notes on socket timeouts <socket-timeouts>`.

source: The method no longer toggles :const:`SOCK_NONBLOCK` flag on :attr:`socket.type`.
sv: Metoden växlar inte längre :const:`SOCK_NONBLOCK`-flaggan på :attr:`socket.type`.

source: Set the value of the given socket option (see the Unix manual page :manpage:`setsockopt(2)`). The needed symbolic constants are defined in this module (:ref:`!SO_\* etc. <socket-unix-constants>`). The value can be an integer, ``None`` or a :term:`bytes-like object` representing a buffer. In the later case it is up to the caller to ensure that the bytestring contains the proper bits (see the optional built-in module :mod:`struct` for a way to encode C structures as bytestrings). When *value* is set to ``None``, *optlen* argument is required. It's equivalent to call :c:func:`setsockopt` C function with ``optval=NULL`` and ``optlen=optlen``.
sv: Ställ in värdet för det angivna socket-alternativet (se Unix-manualsidan :manpage:`setsockopt(2)`). De symboliska konstanter som behövs definieras i den här modulen (:ref:`!SO_\* etc. <socket-unix-constants>`). Värdet kan vara ett heltal, ``None`` eller ett :term:`bytesliknande objekt` som representerar en buffert. I det senare fallet är det upp till den som anropar att se till att bytestringen innehåller rätt bitar (se den valfria inbyggda modulen :mod:`struct` för ett sätt att koda C-strukturer som bytestringar). När *value* är satt till ``None`` krävs argumentet *optlen*. Det är likvärdigt med att anropa C-funktionen :c:func:`setsockopt` med ``optval=NULL`` och ``optlen=optlen``.

source: setsockopt(level, optname, None, optlen: int) form added.
sv: setsockopt(level, optname, None, optlen: int) formuläret har lagts till.

source: Shut down one or both halves of the connection. If *how* is :const:`SHUT_RD`, further receives are disallowed. If *how* is :const:`SHUT_WR`, further sends are disallowed. If *how* is :const:`SHUT_RDWR`, further sends and receives are disallowed.
sv: Stänger av en eller båda halvorna av anslutningen. Om *how* är :const:`SHUT_RD`, tillåts inte ytterligare mottagningar. Om *how* är :const:`SHUT_WR`, är ytterligare sändningar inte tillåtna. Om *how* är :const:`SHUT_RDWR`, är ytterligare sändningar och mottagningar inte tillåtna.

source: Duplicate a socket and prepare it for sharing with a target process. The target process must be provided with *process_id*. The resulting bytes object can then be passed to the target process using some form of interprocess communication and the socket can be recreated there using :func:`fromshare`. Once this method has been called, it is safe to close the socket since the operating system has already duplicated it for the target process.
sv: Duplicera ett uttag och förbered det för delning med en målprocess. Målprocessen måste förses med *process_id*. Det resulterande bytesobjektet kan sedan skickas till målprocessen med hjälp av någon form av interprocesskommunikation och sockeln kan återskapas där med :func:`fromshare`. När den här metoden har anropats är det säkert att stänga sockeln eftersom operativsystemet redan har duplicerat den för målprocessen.

source: Note that there are no methods :meth:`read` or :meth:`write`; use :meth:`~socket.recv` and :meth:`~socket.send` without *flags* argument instead.
sv: Observera att det inte finns några metoder :meth:`read` eller :meth:`write`; använd istället :meth:`~socket.recv` och :meth:`~socket.send` utan *flags*-argument.

source: Socket objects also have these (read-only) attributes that correspond to the values given to the :class:`~socket.socket` constructor.
sv: Socket-objekt har också dessa (skrivskyddade) attribut som motsvarar de värden som ges till :class:`~socket.socket`-konstruktören.

source: The socket family.
sv: Socket-familjen.

source: The socket type.
sv: Typ av socket.

source: The socket protocol.
sv: Socketprotokollet.

source: Notes on socket timeouts
sv: Anmärkningar om timeout för socket

source: A socket object can be in one of three modes: blocking, non-blocking, or timeout. Sockets are by default always created in blocking mode, but this can be changed by calling :func:`setdefaulttimeout`.
sv: Ett socket-objekt kan vara i ett av tre lägen: blockerande, icke-blockerande eller timeout. Sockets skapas som standard alltid i blockeringsläge, men detta kan ändras genom att anropa :func:`setdefaulttimeout`.

source: In *blocking mode*, operations block until complete or the system returns an error (such as connection timed out).
sv: I *blockeringsläge* blockeras operationer tills de är slutförda eller tills systemet returnerar ett fel (t.ex. att anslutningen har tidsavgränsats).

source: In *non-blocking mode*, operations fail (with an error that is unfortunately system-dependent) if they cannot be completed immediately: functions from the :mod:`select` module can be used to know when and whether a socket is available for reading or writing.
sv: I *non-blocking mode* misslyckas operationer (med ett fel som tyvärr är systemberoende) om de inte kan slutföras omedelbart: funktioner från modulen :mod:`select` kan användas för att veta när och om en socket är tillgänglig för läsning eller skrivning.

source: In *timeout mode*, operations fail if they cannot be completed within the timeout specified for the socket (they raise a :exc:`timeout` exception) or if the system returns an error.
sv: I *timeout-läge* misslyckas operationer om de inte kan slutföras inom den timeout som anges för uttaget (de ger upphov till ett :exc:`timeout`-undantag) eller om systemet returnerar ett fel.

source: At the operating system level, sockets in *timeout mode* are internally set in non-blocking mode. Also, the blocking and timeout modes are shared between file descriptors and socket objects that refer to the same network endpoint. This implementation detail can have visible consequences if e.g. you decide to use the :meth:`~socket.fileno` of a socket.
sv: På operativsystemsnivå är sockets i *timeout-läge* internt inställda på icke-blockerande läge. Dessutom delas blockerings- och timeout-lägena mellan filbeskrivare och socket-objekt som refererar till samma nätverksändpunkt. Denna implementationsdetalj kan få synliga konsekvenser om du t.ex. bestämmer dig för att använda :meth:`~socket.fileno` för ett uttag.

source: Timeouts and the ``connect`` method
sv: Timeout och metoden "Connect

source: The :meth:`~socket.connect` operation is also subject to the timeout setting, and in general it is recommended to call :meth:`~socket.settimeout` before calling :meth:`~socket.connect` or pass a timeout parameter to :meth:`create_connection`. However, the system network stack may also return a connection timeout error of its own regardless of any Python socket timeout setting.
sv: Operationen :meth:`~socket.connect` är också föremål för timeout-inställningen, och i allmänhet rekommenderas att anropa :meth:`~socket.settimeout` innan anrop av :meth:`~socket.connect` eller skicka en timeout-parameter till :meth:`create_connection`. Systemets nätverksstack kan dock också returnera ett eget timeout-fel för anslutningen oavsett Python-socketens timeout-inställning.

source: Timeouts and the ``accept`` method
sv: Tidsgränser och ``accept``-metoden

source: If :func:`getdefaulttimeout` is not :const:`None`, sockets returned by the :meth:`~socket.accept` method inherit that timeout. Otherwise, the behaviour depends on settings of the listening socket:
sv: Om :func:`getdefaulttimeout` inte är :const:`None`, ärver de uttag som returneras av metoden :meth:`~socket.accept` denna timeout. Annars beror beteendet på inställningarna för det lyssnande uttaget:

source: if the listening socket is in *blocking mode* or in *timeout mode*, the socket returned by :meth:`~socket.accept` is in *blocking mode*;
sv: om det lyssnande uttaget är i *blockeringsläge* eller i *timeout-läge*, är uttaget som returneras av :meth:`~socket.accept` i *blockeringsläge*;

source: if the listening socket is in *non-blocking mode*, whether the socket returned by :meth:`~socket.accept` is in blocking or non-blocking mode is operating system-dependent. If you want to ensure cross-platform behaviour, it is recommended you manually override this setting.
sv: om det lyssnande uttaget är i *icke-blockerande läge*, om det uttag som returneras av :meth:`~socket.accept` är i blockerande eller icke-blockerande läge är beroende av operativsystemet. Om du vill säkerställa ett plattformsoberoende beteende rekommenderas att du manuellt åsidosätter den här inställningen.

source: Example
sv: Exempel

source: Here are four minimal example programs using the TCP/IP protocol: a server that echoes all data that it receives back (servicing only one client), and a client using it. Note that a server must perform the sequence :func:`~socket.socket`, :meth:`~socket.bind`, :meth:`~socket.listen`, :meth:`~socket.accept` (possibly repeating the :meth:`~socket.accept` to service more than one client), while a client only needs the sequence :func:`~socket.socket`, :meth:`~socket.connect`. Also note that the server does not :meth:`~socket.sendall`/:meth:`~socket.recv` on the socket it is listening on but on the new socket returned by :meth:`~socket.accept`.
sv: Här följer fyra minimala exempel på program som använder TCP/IP-protokollet: en server som ekar alla data som den får tillbaka (och som bara betjänar en klient) och en klient som använder det. Observera att en server måste utföra sekvensen :func:`~socket.socket`, :meth:`~socket.bind`, :meth:`~socket.listen`, :meth:`~socket.accept` (eventuellt upprepa :meth:`~socket.accept` för att betjäna mer än en klient), medan en klient bara behöver sekvensen :func:`~socket.socket`, :meth:`~socket.connect`. Observera också att servern inte gör :meth:`~socket.sendall`/:meth:`~socket.recv` på den socket den lyssnar på utan på den nya socket som returneras av :meth:`~socket.accept`.

source: The first two examples support IPv4 only. ::
sv: De två första exemplen stöder endast IPv4. ::

source: The next two examples are identical to the above two, but support both IPv4 and IPv6. The server side will listen to the first address family available (it should listen to both instead). On most of IPv6-ready systems, IPv6 will take precedence and the server may not accept IPv4 traffic. The client side will try to connect to all the addresses returned as a result of the name resolution, and sends traffic to the first one connected successfully. ::
sv: De två följande exemplen är identiska med de två föregående, men stöder både IPv4 och IPv6. Serversidan lyssnar på den första tillgängliga adressfamiljen (den borde lyssna på båda i stället). På de flesta IPv6-klara system kommer IPv6 att ha företräde och servern kanske inte accepterar IPv4-trafik. Klientsidan försöker ansluta till alla de adresser som returneras som ett resultat av namnupplösningen och skickar trafik till den första som ansluts framgångsrikt:

source: The next example shows how to write a very simple network sniffer with raw sockets on Windows. The example requires administrator privileges to modify the interface::
sv: Nästa exempel visar hur man skriver en mycket enkel nätverkssniffer med raw sockets i Windows. Exemplet kräver administratörsbehörighet för att ändra gränssnittet::

source: The next example shows how to use the socket interface to communicate to a CAN network using the raw socket protocol. To use CAN with the broadcast manager protocol instead, open a socket with::
sv: I nästa exempel visas hur du använder socket-gränssnittet för att kommunicera med ett CAN-nätverk med hjälp av raw socket-protokollet. Om du istället vill använda CAN med broadcast manager-protokollet öppnar du en socket med::

source: After binding (:const:`CAN_RAW`) or connecting (:const:`CAN_BCM`) the socket, you can use the :meth:`socket.send` and :meth:`socket.recv` operations (and their counterparts) on the socket object as usual.
sv: När du har bundit (:const:`CAN_RAW`) eller anslutit (:const:`CAN_BCM`) sockeln kan du använda operationerna :meth:`socket.send` och :meth:`socket.recv` (och deras motsvarigheter) på socketobjektet som vanligt.

source: This last example might require special privileges::
sv: Detta sista exempel kan kräva särskilda privilegier::

source: Running an example several times with too small delay between executions, could lead to this error::
sv: Om du kör ett exempel flera gånger med för kort fördröjning mellan körningarna kan det leda till följande fel::

source: OSError: [Errno 98] Address already in use
sv: OSError: [Errno 98] Adressen är redan i bruk

source: This is because the previous execution has left the socket in a ``TIME_WAIT`` state, and can't be immediately reused.
sv: Detta beror på att den tidigare exekveringen har lämnat uttaget i ett ``TIME_WAIT``-tillstånd och inte kan återanvändas omedelbart.

source: There is a :mod:`socket` flag to set, in order to prevent this, :const:`socket.SO_REUSEADDR`::
sv: Det finns en :mod:`socket` flagga att ställa in, för att förhindra detta, :const:`socket.SO_REUSEADDR`::

source: the :data:`SO_REUSEADDR` flag tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire.
sv: flaggan :data:`SO_REUSEADDR` talar om för kärnan att återanvända en lokal socket i ``TIME_WAIT``-tillstånd, utan att vänta på att dess naturliga timeout ska löpa ut.

source: For an introduction to socket programming (in C), see the following papers:
sv: För en introduktion till socketprogrammering (i C), se följande artiklar:

source: *An Introductory 4.3BSD Interprocess Communication Tutorial*, by Stuart Sechrest
sv: *En inledande handledning i 4.3BSD Interprocess Communication*, av Stuart Sechrest

source: *An Advanced 4.3BSD Interprocess Communication Tutorial*, by Samuel J. Leffler et al,
sv: *An Advanced 4.3BSD Interprocess Communication Tutorial*, av Samuel J. Leffler et al,

source: both in the UNIX Programmer's Manual, Supplementary Documents 1 (sections PS1:7 and PS1:8). The platform-specific reference material for the various socket-related system calls are also a valuable source of information on the details of socket semantics. For Unix, refer to the manual pages; for Windows, see the WinSock (or Winsock 2) specification. For IPv6-ready APIs, readers may want to refer to :rfc:`3493` titled Basic Socket Interface Extensions for IPv6.
sv: både i UNIX Programmer's Manual, Supplementary Documents 1 (avsnitt PS1:7 och PS1:8). Det plattformsspecifika referensmaterialet för de olika socket-relaterade systemanropen är också en värdefull källa till information om detaljerna i socket-semantik. För Unix hänvisas till manualsidorna; för Windows hänvisas till WinSock (eller Winsock 2) specifikationen. För IPv6-klara API:er kan läsare vilja hänvisa till :rfc:`3493` med titeln Basic Socket Interface Extensions for IPv6.

source: I/O control
sv: I/O-kontroll

source: buffering
sv: buffring

source: module
sv: modul

source: struct
sv: struktur
