Repository: yeager/python-docs-sv
Catalog: library/socket.po
Languages: sv

source: Return the value of the given socket option (see the Unix man page :manpage:`getsockopt(2)`). The needed symbolic constants (:ref:`SO_\* etc. <socket-unix-constants>`) are defined in this module. If *buflen* is absent, an integer option is assumed and its integer value is returned by the function. If *buflen* is present, it specifies the maximum length of the buffer used to receive the option in, and this buffer is returned as a bytes object. It is up to the caller to decode the contents of the buffer (see the optional built-in module :mod:`struct` for a way to decode C structures encoded as byte strings).
sv: Returnerar värdet för det angivna socket-alternativet (se Unix man-sida :manpage:`getsockopt(2)`). De symboliska konstanter som behövs (:ref:`SO_\* etc. <socket-unix-constants>`) definieras i den här modulen. Om *buflen* saknas antas ett heltalsalternativ och dess heltalsvärde returneras av funktionen. Om *buflen* finns anger den den maximala längden på den buffert som används för att ta emot alternativet, och denna buffert returneras som ett bytesobjekt. Det är upp till den som anropar att avkoda innehållet i bufferten (se den valfria inbyggda modulen :mod:`struct` för ett sätt att avkoda C-strukturer som kodats som bytesträngar).

source: Return ``True`` if socket is in blocking mode, ``False`` if in non-blocking.
sv: Returnerar ``True`` om uttaget är i blockeringsläge, ``False`` om det är i icke-blockeringsläge.

source: This is equivalent to checking ``socket.gettimeout() != 0``.
sv: Detta är likvärdigt med att kontrollera ``socket.gettimeout() != 0``.

source: Return the timeout in seconds (float) associated with socket operations, or ``None`` if no timeout is set. This reflects the last call to :meth:`setblocking` or :meth:`settimeout`.
sv: Returnerar timeout i sekunder (float) associerad med socket-operationer, eller ``None`` om ingen timeout är inställd. Detta återspeglar det senaste anropet till :meth:`setblocking` eller :meth:`settimeout`.

source: The :meth:`ioctl` method is a limited interface to the WSAIoctl system interface. Please refer to the `Win32 documentation <https://msdn.microsoft.com/en-us/library/ms741621%28VS.85%29.aspx>`_ for more information.
sv: Metoden :meth:`ioctl` är ett begränsat gränssnitt till systemgränssnittet WSAIoctl. Mer information finns i `Win32-dokumentationen <https://msdn.microsoft.com/en-us/library/ms741621%28VS.85%29.aspx>`_.

source: On other platforms, the generic :func:`fcntl.fcntl` and :func:`fcntl.ioctl` functions may be used; they accept a socket object as their first argument.
sv: På andra plattformar kan de generiska funktionerna :func:`fcntl.fcntl` och :func:`fcntl.ioctl` användas; de accepterar ett socket-objekt som sitt första argument.

source: Currently only the following control codes are supported: ``SIO_RCVALL``, ``SIO_KEEPALIVE_VALS``, and ``SIO_LOOPBACK_FAST_PATH``.
sv: För närvarande stöds endast följande kontrollkoder: ``SIO_RCVALL``, ``SIO_KEEPALIVE_VALS`` och ``SIO_LOOPBACK_FAST_PATH``.

source: Enable a server to accept connections. If *backlog* is specified, it must be at least 0 (if it is lower, it is set to 0); it specifies the number of unaccepted connections that the system will allow before refusing new connections. If not specified, a default reasonable value is chosen.
sv: Gör det möjligt för en server att acceptera anslutningar. Om *backlog* anges måste det vara minst 0 (om det är lägre sätts det till 0); det anger antalet oaccepterade anslutningar som systemet tillåter innan nya anslutningar nekas. Om det inte specificeras väljs ett rimligt standardvärde.

source: The *backlog* parameter is now optional.
sv: Parametern *backlog* är nu valfri.

source: Return a :term:`file object` associated with the socket. The exact returned type depends on the arguments given to :meth:`makefile`. These arguments are interpreted the same way as by the built-in :func:`open` function, except the only supported *mode* values are ``'r'`` (default), ``'w'``, ``'b'``, or a combination of those.
sv: Returnerar ett :term:`filobjekt` associerat med uttaget. Den exakta typen som returneras beror på de argument som ges till :meth:`makefile`. Dessa argument tolkas på samma sätt som av den inbyggda funktionen :func:`open`, förutom att de enda *mode*-värden som stöds är ``'r'`` (standard), ``'w'``, ``'b'`` eller en kombination av dessa.

source: The socket must be in blocking mode; it can have a timeout, but the file object's internal buffer may end up in an inconsistent state if a timeout occurs.
sv: Sockeln måste vara i blockeringsläge; den kan ha en timeout, men filobjektets interna buffert kan hamna i ett inkonsekvent tillstånd om en timeout inträffar.

source: Closing the file object returned by :meth:`makefile` won't close the original socket unless all other file objects have been closed and :meth:`socket.close` has been called on the socket object.
sv: Om du stänger filobjektet som returneras av :meth:`makefile` stängs inte den ursprungliga sockeln om inte alla andra filobjekt har stängts och :meth:`socket.close` har anropats på socketobjektet.

source: On Windows, the file-like object created by :meth:`makefile` cannot be used where a file object with a file descriptor is expected, such as the stream arguments of :meth:`subprocess.Popen`.
sv: I Windows kan det filliknande objekt som skapas av :meth:`makefile` inte användas där ett filobjekt med en filbeskrivare förväntas, t.ex. strömargumenten i :meth:`subprocess.Popen`.

source: Receive data from the socket. The return value is a bytes object representing the data received. The maximum amount of data to be received at once is specified by *bufsize*. A returned empty bytes object indicates that the client has disconnected. See the Unix manual page :manpage:`recv(2)` for the meaning of the optional argument *flags*; it defaults to zero.
sv: Ta emot data från uttaget. Returvärdet är ett bytes-objekt som representerar den mottagna datan. Den maximala mängden data som kan tas emot på en gång anges av *bufsize*. Ett returnerat tomt bytes-objekt indikerar att klienten har kopplat från. Se Unix-manualsidan :manpage:`recv(2)` för betydelsen av det valfria argumentet *flags*; det är noll som standard.

source: Receive data from the socket. The return value is a pair ``(bytes, address)`` where *bytes* is a bytes object representing the data received and *address* is the address of the socket sending the data. See the Unix manual page :manpage:`recv(2)` for the meaning of the optional argument *flags*; it defaults to zero. (The format of *address* depends on the address family --- see above.)
sv: Tar emot data från uttaget. Returvärdet är ett par ``(bytes, address)`` där *bytes* är ett bytesobjekt som representerar de mottagna data och *address* är adressen till det uttag som skickar data. Se Unix-manualsidan :manpage:`recv(2)` för betydelsen av det valfria argumentet *flags*; det är noll som standard. (Formatet på *address* beror på adressfamiljen --- se ovan)

source: For multicast IPv6 address, first item of *address* does not contain ``%scope_id`` part anymore. In order to get full IPv6 address use :func:`getnameinfo`.
sv: För IPv6-adresser för multicast innehåller den första posten i *address* inte längre delen ``%scope_id``. För att få en fullständig IPv6-adress, använd :func:`getnameinfo`.

source: Receive normal data (up to *bufsize* bytes) and ancillary data from the socket. The *ancbufsize* argument sets the size in bytes of the internal buffer used to receive the ancillary data; it defaults to 0, meaning that no ancillary data will be received. Appropriate buffer sizes for ancillary data can be calculated using :func:`CMSG_SPACE` or :func:`CMSG_LEN`, and items which do not fit into the buffer might be truncated or discarded. The *flags* argument defaults to 0 and has the same meaning as for :meth:`recv`.
sv: Tar emot normal data (upp till *bufsize* bytes) och tilläggsdata från sockeln. Argumentet *ancbufsize* anger storleken i byte på den interna buffert som används för att ta emot tilläggsdata; standardvärdet är 0, vilket innebär att inga tilläggsdata tas emot. Lämpliga buffertstorlekar för tilläggsdata kan beräknas med hjälp av :func:`CMSG_SPACE` eller :func:`CMSG_LEN`, och objekt som inte ryms i bufferten kan avkortas eller kasseras. Argumentet *flags* är 0 som standard och har samma betydelse som för :meth:`recv`.

source: The return value is a 4-tuple: ``(data, ancdata, msg_flags, address)``. The *data* item is a :class:`bytes` object holding the non-ancillary data received. The *ancdata* item is a list of zero or more tuples ``(cmsg_level, cmsg_type, cmsg_data)`` representing the ancillary data (control messages) received: *cmsg_level* and *cmsg_type* are integers specifying the protocol level and protocol-specific type respectively, and *cmsg_data* is a :class:`bytes` object holding the associated data. The *msg_flags* item is the bitwise OR of various flags indicating conditions on the received message; see your system documentation for details. If the receiving socket is unconnected, *address* is the address of the sending socket, if available; otherwise, its value is unspecified.
sv: Returvärdet är en 4-tupel: ``(data, ancdata, msg_flags, address)``. Objektet *data* är ett :class:`bytes`-objekt som innehåller de icke-ancillära data som mottagits. Objektet *ancdata* är en lista med noll eller flera tupler ``(cmsg_level, cmsg_type, cmsg_data)`` som representerar de mottagna tilläggsdata (kontrollmeddelanden): *cmsg_level* och *cmsg_type* är heltal som anger protokollnivån respektive den protokollspecifika typen, och *cmsg_data* är ett :class:`bytes`-objekt som innehåller tillhörande data. Objektet *msg_flags* är det bitvisa ELLER av olika flaggor som anger villkor för det mottagna meddelandet; se systemdokumentationen för mer information. Om det mottagande uttaget inte är anslutet är *address* adressen till det sändande uttaget, om sådan finns; annars är dess värde ospecificerat.

source: On some systems, :meth:`sendmsg` and :meth:`recvmsg` can be used to pass file descriptors between processes over an :const:`AF_UNIX` socket. When this facility is used (it is often restricted to :const:`SOCK_STREAM` sockets), :meth:`recvmsg` will return, in its ancillary data, items of the form ``(socket.SOL_SOCKET, socket.SCM_RIGHTS, fds)``, where *fds* is a :class:`bytes` object representing the new file descriptors as a binary array of the native C :c:expr:`int` type. If :meth:`recvmsg` raises an exception after the system call returns, it will first attempt to close any file descriptors received via this mechanism.
sv: På vissa system kan :meth:`sendmsg` och :meth:`recvmsg` användas för att skicka filbeskrivare mellan processer över en :const:`AF_UNIX`-socket. När denna funktion används (den är ofta begränsad till :const:`SOCK_STREAM`-socklar), kommer :meth:`recvmsg` att returnera, i sina tilläggsdata, objekt av formen ``(socket.SOL_SOCKET, socket.SCM_RIGHTS, fds)``, där *fds* är ett :class:`bytes`-objekt som representerar de nya filbeskrivarna som en binär array av den ursprungliga C-typen :c:expr:`int`. Om :meth:`recvmsg` ger upphov till ett undantag efter att systemanropet har returnerats, kommer det först att försöka stänga alla filbeskrivare som har tagits emot via denna mekanism.

source: Some systems do not indicate the truncated length of ancillary data items which have been only partially received. If an item appears to extend beyond the end of the buffer, :meth:`recvmsg` will issue a :exc:`RuntimeWarning`, and will return the part of it which is inside the buffer provided it has not been truncated before the start of its associated data.
sv: Vissa system anger inte den avkortade längden på tilläggsdata som bara delvis har tagits emot. Om ett objekt verkar sträcka sig längre än slutet av bufferten, kommer :meth:`recvmsg` att utfärda en :exc:`RuntimeWarning`, och kommer att returnera den del av det som finns i bufferten förutsatt att det inte har avkortats före början av dess tillhörande data.

source: On systems which support the :const:`SCM_RIGHTS` mechanism, the following function will receive up to *maxfds* file descriptors, returning the message data and a list containing the descriptors (while ignoring unexpected conditions such as unrelated control messages being received). See also :meth:`sendmsg`. ::
sv: På system som stöder :const:`SCM_RIGHTS`-mekanismen tar följande funktion emot upp till *maxfds* filbeskrivare och returnerar meddelandedata och en lista som innehåller beskrivarna (samtidigt som oväntade förhållanden ignoreras, t.ex. att orelaterade kontrollmeddelanden tas emot). Se även :meth:`sendmsg`. ::

source: Receive normal data and ancillary data from the socket, behaving as :meth:`recvmsg` would, but scatter the non-ancillary data into a series of buffers instead of returning a new bytes object. The *buffers* argument must be an iterable of objects that export writable buffers (e.g. :class:`bytearray` objects); these will be filled with successive chunks of the non-ancillary data until it has all been written or there are no more buffers. The operating system may set a limit (:func:`~os.sysconf` value ``SC_IOV_MAX``) on the number of buffers that can be used. The *ancbufsize* and *flags* arguments have the same meaning as for :meth:`recvmsg`.
sv: Tar emot normala data och tilläggsdata från sockeln och beter sig som :meth:`recvmsg` skulle göra, men sprider ut de data som inte tillhörancillary i en serie buffertar istället för att returnera ett nytt bytes-objekt. Argumentet *buffers* måste vara en iterabel av objekt som exporterar skrivbara buffertar (t.ex. :class:`bytearray`-objekt); dessa kommer att fyllas med successiva bitar av de icke-ancillära data tills allt har skrivits eller det inte finns några fler buffertar. Operativsystemet kan sätta en gräns (:func:`~os.sysconf` värde ``SC_IOV_MAX``) på antalet buffertar som kan användas. Argumenten *ancbufsize* och *flags* har samma betydelse som för :meth:`recvmsg`.

source: The return value is a 4-tuple: ``(nbytes, ancdata, msg_flags, address)``, where *nbytes* is the total number of bytes of non-ancillary data written into the buffers, and *ancdata*, *msg_flags* and *address* are the same as for :meth:`recvmsg`.
sv: Returvärdet är en 4-tupel: ``(nbytes, ancdata, msg_flags, address)``, där *nbytes* är det totala antalet byte av icke-ancillär data som skrivs in i buffertarna, och *ancdata*, *msg_flags* och *address* är desamma som för :meth:`recvmsg`.

source: Example::
sv: Exempel::

source: Receive data from the socket, writing it into *buffer* instead of creating a new bytestring. The return value is a pair ``(nbytes, address)`` where *nbytes* is the number of bytes received and *address* is the address of the socket sending the data. See the Unix manual page :manpage:`recv(2)` for the meaning of the optional argument *flags*; it defaults to zero. (The format of *address* depends on the address family --- see above.)
sv: Tar emot data från sockeln och skriver in dem i *buffer* istället för att skapa en ny bytestring. Returvärdet är ett par ``(nbytes, address)`` där *nbytes* är antalet mottagna byte och *address* är adressen till den socket som skickar data. Se Unix-manualsidan :manpage:`recv(2)` för betydelsen av det valfria argumentet *flags*; det är noll som standard. (Formatet på *address* beror på adressfamiljen --- se ovan)

source: Receive up to *nbytes* bytes from the socket, storing the data into a buffer rather than creating a new bytestring. If *nbytes* is not specified (or 0), receive up to the size available in the given buffer. Returns the number of bytes received. See the Unix manual page :manpage:`recv(2)` for the meaning of the optional argument *flags*; it defaults to zero.
sv: Tar emot upp till *nbytes* byte från sockeln och lagrar data i en buffert i stället för att skapa en ny bytestring. Om *nbytes* inte anges (eller 0), tas upp till den storlek som finns tillgänglig i den angivna bufferten. Returnerar antalet mottagna byte. Se Unix-manualsidan :manpage:`recv(2)` för betydelsen av det valfria argumentet *flags*; det är noll som standard.

source: Send data to the socket. The socket must be connected to a remote socket. The optional *flags* argument has the same meaning as for :meth:`recv` above. Returns the number of bytes sent. Applications are responsible for checking that all data has been sent; if only some of the data was transmitted, the application needs to attempt delivery of the remaining data. For further information on this topic, consult the :ref:`socket-howto`.
sv: Skicka data till uttaget. Uttaget måste vara anslutet till ett fjärruttag. Det valfria argumentet *flags* har samma betydelse som för :meth:`recv` ovan. Returnerar antalet bytes som skickats. Applikationer är ansvariga för att kontrollera att alla data har skickats; om endast en del av data har skickats måste applikationen försöka leverera resterande data. För ytterligare information om detta ämne, se :ref:`socket-howto`.

source: Send data to the socket. The socket must be connected to a remote socket. The optional *flags* argument has the same meaning as for :meth:`recv` above. Unlike :meth:`send`, this method continues to send data from *bytes* until either all data has been sent or an error occurs. ``None`` is returned on success. On error, an exception is raised, and there is no way to determine how much data, if any, was successfully sent.
sv: Skicka data till uttaget. Uttaget måste vara anslutet till ett fjärruttag. Det valfria argumentet *flags* har samma betydelse som för :meth:`recv` ovan. Till skillnad från :meth:`send` fortsätter den här metoden att skicka data från *bytes* tills antingen all data har skickats eller ett fel inträffar. ``None`` returneras vid framgång. Vid fel uppstår ett undantag och det finns inget sätt att avgöra hur mycket data, om någon, som skickades framgångsrikt.

source: The socket timeout is no longer reset each time data is sent successfully. The socket timeout is now the maximum total duration to send all data.
sv: Socket timeout återställs inte längre varje gång data har skickats framgångsrikt. Socket timeout är nu den maximala totala tiden det tar att skicka all data.

source: Send data to the socket. The socket should not be connected to a remote socket, since the destination socket is specified by *address*. The optional *flags* argument has the same meaning as for :meth:`recv` above. Return the number of bytes sent. (The format of *address* depends on the address family --- see above.)
sv: Skicka data till uttaget. Sockeln ska inte vara ansluten till en fjärrsocket, eftersom destinationssockeln anges av *address*. Det valfria argumentet *flags* har samma betydelse som för :meth:`recv` ovan. Returnerar antalet bytes som skickats. (Formatet på *address* beror på adressfamiljen --- se ovan)

source: Raises an :ref:`auditing event <auditing>` ``socket.sendto`` with arguments ``self``, ``address``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.sendto`` med argumenten ``self``, ``address``.

source: Send normal and ancillary data to the socket, gathering the non-ancillary data from a series of buffers and concatenating it into a single message. The *buffers* argument specifies the non-ancillary data as an iterable of :term:`bytes-like objects <bytes-like object>` (e.g. :class:`bytes` objects); the operating system may set a limit (:func:`~os.sysconf` value ``SC_IOV_MAX``) on the number of buffers that can be used. The *ancdata* argument specifies the ancillary data (control messages) as an iterable of zero or more tuples ``(cmsg_level, cmsg_type, cmsg_data)``, where *cmsg_level* and *cmsg_type* are integers specifying the protocol level and protocol-specific type respectively, and *cmsg_data* is a bytes-like object holding the associated data. Note that some systems (in particular, systems without :func:`CMSG_SPACE`) might support sending only one control message per call. The *flags* argument defaults to 0 and has the same meaning as for :meth:`send`. If *address* is supplied and not ``None``, it sets a destination address for the message. The return value is the number of bytes of non-ancillary data sent.
sv: Skicka normala data och tilläggsdata till sockeln genom att samla in icke-anknutna data från en serie buffertar och sammanfoga dem till ett enda meddelande. Argumentet *buffers* anger de icke-anknutna data som en iterabel av :term:`bytesliknande objekt <bytes-like object>` (t.ex. :class:`bytes`-objekt); operativsystemet kan sätta en gräns (:func:`~os.sysconf`-värdet ``SC_IOV_MAX``) för antalet buffertar som kan användas. Argumentet *ancdata* anger tilläggsdata (kontrollmeddelanden) som en iterabel med noll eller flera tupler ``(cmsg_level, cmsg_type, cmsg_data)``, där *cmsg_level* och *cmsg_type* är heltal som anger protokollnivån respektive den protokollspecifika typen, och *cmsg_data* är ett bytesliknande objekt som innehåller tillhörande data. Observera att vissa system (i synnerhet system utan :func:`CMSG_SPACE`) kan stödja sändning av endast ett kontrollmeddelande per anrop. Argumentet *flags* är 0 som standard och har samma betydelse som för :meth:`send`. Om *address* anges och inte ``None``, anges en destinationsadress för meddelandet. Returvärdet är antalet bytes av icke-ancillär data som skickats.

source: The following function sends the list of file descriptors *fds* over an :const:`AF_UNIX` socket, on systems which support the :const:`SCM_RIGHTS` mechanism. See also :meth:`recvmsg`. ::
sv: Följande funktion skickar listan över filbeskrivare *fds* över en :const:`AF_UNIX`-socket, på system som stöder :const:`SCM_RIGHTS`-mekanismen. Se även :meth:`recvmsg`. ::

source: Raises an :ref:`auditing event <auditing>` ``socket.sendmsg`` with arguments ``self``, ``address``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.sendmsg`` med argumenten ``self``, ``address``.

source: Specialized version of :meth:`~socket.sendmsg` for :const:`AF_ALG` socket. Set mode, IV, AEAD associated data length and flags for :const:`AF_ALG` socket.
sv: Specialiserad version av :meth:`~socket.sendmsg` för :const:`AF_ALG` socket. Ställ in läge, IV, AEAD-associerad datalängd och flaggor för :const:`AF_ALG`-uttag.

source: Send a file until EOF is reached by using high-performance :mod:`os.sendfile` and return the total number of bytes which were sent. *file* must be a regular file object opened in binary mode. If :mod:`os.sendfile` is not available (e.g. Windows) or *file* is not a regular file :meth:`send` will be used instead. *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is updated on return or also in case of error in which case :meth:`file.tell() <io.IOBase.tell>` can be used to figure out the number of bytes which were sent. The socket must be of :const:`SOCK_STREAM` type. Non-blocking sockets are not supported.
sv: Skicka en fil tills EOF nås med hjälp av högpresterande :mod:`os.sendfile` och returnera det totala antalet bytes som skickades. *file* måste vara ett vanligt filobjekt som öppnas i binärt läge. Om :mod:`os.sendfile` inte är tillgänglig (t.ex. Windows) eller om *fil* inte är en vanlig fil används istället :meth:`send`. *offset* anger varifrån filen ska börja läsas. Om det anges är *count* det totala antalet byte som ska överföras i stället för att skicka filen tills EOF nås. Filens position uppdateras vid retur eller också vid fel, i vilket fall :meth:`file.tell() <io.IOBase.tell>` kan användas för att räkna ut antalet bytes som skickades. Uttaget måste vara av typen :const:`SOCK_STREAM`. Icke-blockerande socklar stöds inte.
