Repository: yeager/python-docs-sv
Catalog: library/socket.po
Languages: sv

source: Convert 16-bit positive integers from network to host byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 2-byte swap operation.
sv: Konvertera 16-bitars positiva heltal från nätverkets byteordning till värddatorns byteordning. På maskiner där värdbyteordningen är densamma som nätverksbyteordningen är detta ett no-op; annars utförs en 2 byte swap-operation.

source: Raises :exc:`OverflowError` if *x* does not fit in a 16-bit unsigned integer.
sv: Utlöser :exc:`OverflowError` om *x* inte ryms i ett 16-bitars osignerat heltal.

source: Convert 32-bit positive integers from host to network byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 4-byte swap operation.
sv: Konverterar 32-bitars positiva heltal från värd- till nätverksbyteordning. På maskiner där värdbyteordningen är densamma som nätverksbyteordningen är detta en no-op; annars utförs en swapoperation på 4 byte.

source: Convert 16-bit positive integers from host to network byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 2-byte swap operation.
sv: Konverterar 16-bitars positiva heltal från värd- till nätverksbyteordning. På maskiner där värdbyteordningen är densamma som nätverksbyteordningen är detta en no-op; annars utförs en 2 byte swap-operation.

source: Convert an IPv4 address from dotted-quad string format (for example, '123.45.67.89') to 32-bit packed binary format, as a bytes object four characters in length. This is useful when conversing with a program that uses the standard C library and needs objects of type :c:struct:`in_addr`, which is the C type for the 32-bit packed binary this function returns.
sv: Konverterar en IPv4-adress från strängformat med prickade kvadrater (t.ex. '123.45.67.89') till 32-bitars packat binärt format, som ett bytesobjekt med fyra tecken i längd. Detta är användbart när du pratar med ett program som använder standard C-biblioteket och behöver objekt av typen :c:struct:`in_addr`, vilket är C-typen för det 32-bitars packade binära format som denna funktion returnerar.

source: :func:`inet_aton` also accepts strings with less than three dots; see the Unix manual page :manpage:`inet(3)` for details.
sv: :func:`inet_aton` accepterar även strängar med mindre än tre punkter; se Unix manualsida :manpage:`inet(3)` för detaljer.

source: If the IPv4 address string passed to this function is invalid, :exc:`OSError` will be raised. Note that exactly what is valid depends on the underlying C implementation of :c:func:`inet_aton`.
sv: Om IPv4-adresssträngen som skickas till denna funktion är ogiltig, kommer :exc:`OSError` att uppstå. Observera att exakt vad som är giltigt beror på den underliggande C-implementeringen av :c:func:`inet_aton`.

source: :func:`inet_aton` does not support IPv6, and :func:`inet_pton` should be used instead for IPv4/v6 dual stack support.
sv: :func:`inet_aton` har inte stöd för IPv6 och :func:`inet_pton` bör användas istället för stöd för IPv4/v6 dual stack.

source: Convert a 32-bit packed IPv4 address (a :term:`bytes-like object` four bytes in length) to its standard dotted-quad string representation (for example, '123.45.67.89'). This is useful when conversing with a program that uses the standard C library and needs objects of type :c:struct:`in_addr`, which is the C type for the 32-bit packed binary data this function takes as an argument.
sv: Konverterar en 32-bitars packad IPv4-adress (ett fyra byte långt :term:`bytes-liknande objekt`) till dess standardrepresentation i form av en sträng med prickade kvadrater (t.ex. '123.45.67.89'). Detta är användbart när du pratar med ett program som använder standard C-biblioteket och behöver objekt av typen :c:struct:`in_addr`, vilket är C-typen för 32-bitars packade binära data som den här funktionen tar som argument.

source: If the byte sequence passed to this function is not exactly 4 bytes in length, :exc:`OSError` will be raised. :func:`inet_ntoa` does not support IPv6, and :func:`inet_ntop` should be used instead for IPv4/v6 dual stack support.
sv: Om byte-sekvensen som skickas till den här funktionen inte är exakt 4 byte lång, kommer :exc:`OSError` att visas. :func:`inet_ntoa` stöder inte IPv6, och :func:`inet_ntop` bör användas istället för IPv4/v6 dual stack-stöd.

source: Convert an IP address from its family-specific string format to a packed, binary format. :func:`inet_pton` is useful when a library or network protocol calls for an object of type :c:struct:`in_addr` (similar to :func:`inet_aton`) or :c:struct:`in6_addr`.
sv: Konvertera en IP-adress från dess familjespecifika strängformat till ett packat, binärt format. :func:`inet_pton` är användbart när ett bibliotek eller nätverksprotokoll kräver ett objekt av typen :c:struct:`in_addr` (liknande :func:`inet_aton`) eller :c:struct:`in6_addr`.

source: Supported values for *address_family* are currently :const:`AF_INET` and :const:`AF_INET6`. If the IP address string *ip_string* is invalid, :exc:`OSError` will be raised. Note that exactly what is valid depends on both the value of *address_family* and the underlying implementation of :c:func:`inet_pton`.
sv: Värden som stöds för *address_family* är för närvarande :const:`AF_INET` och :const:`AF_INET6`. Om IP-adresssträngen *ip_string* är ogiltig kommer :exc:`OSError` att visas. Observera att exakt vad som är giltigt beror på både värdet på *address_family* och den underliggande implementationen av :c:func:`inet_pton`.

source: Windows support added
sv: Windows-stöd har lagts till

source: Convert a packed IP address (a :term:`bytes-like object` of some number of bytes) to its standard, family-specific string representation (for example, ``'7.10.0.5'`` or ``'5aef:2b::8'``). :func:`inet_ntop` is useful when a library or network protocol returns an object of type :c:struct:`in_addr` (similar to :func:`inet_ntoa`) or :c:struct:`in6_addr`.
sv: Konverterar en packad IP-adress (ett :term:`bytesliknande objekt` med ett visst antal byte) till dess standardiserade, familjespecifika strängrepresentation (t.ex. ``'7.10.0.5'`` eller ``'5aef:2b::8'``). :func:`inet_ntop` är användbart när ett bibliotek eller nätverksprotokoll returnerar ett objekt av typen :c:struct:`in_addr` (liknande :func:`inet_ntoa`) eller :c:struct:`in6_addr`.

source: Supported values for *address_family* are currently :const:`AF_INET` and :const:`AF_INET6`. If the bytes object *packed_ip* is not the correct length for the specified address family, :exc:`ValueError` will be raised. :exc:`OSError` is raised for errors from the call to :func:`inet_ntop`.
sv: Värden som stöds för *address_family* är för närvarande :const:`AF_INET` och :const:`AF_INET6`. Om bytesobjektet *packed_ip* inte har rätt längd för den angivna adressfamiljen, kommer :exc:`ValueError` att uppstå. :exc:`OSError` uppstår för fel från anropet till :func:`inet_ntop`.

source: Return the total length, without trailing padding, of an ancillary data item with associated data of the given *length*. This value can often be used as the buffer size for :meth:`~socket.recvmsg` to receive a single item of ancillary data, but :rfc:`3542` requires portable applications to use :func:`CMSG_SPACE` and thus include space for padding, even when the item will be the last in the buffer. Raises :exc:`OverflowError` if *length* is outside the permissible range of values.
sv: Returnerar den totala längden, utan efterföljande utfyllnad, av ett tilläggsdataobjekt med tillhörande data av den angivna *längden*. Detta värde kan ofta användas som buffertstorlek för :meth:`~socket.recvmsg` för att ta emot ett enda objekt med tillhörande data, men :rfc:`3542` kräver att portabla applikationer använder :func:`CMSG_SPACE` och därmed inkluderar utrymme för utfyllnad, även när objektet kommer att vara det sista i bufferten. Utlöser :exc:`OverflowError` om *length* ligger utanför det tillåtna värdeintervallet.

source: Most Unix platforms.
sv: De flesta Unix-plattformar.

source: Return the buffer size needed for :meth:`~socket.recvmsg` to receive an ancillary data item with associated data of the given *length*, along with any trailing padding. The buffer space needed to receive multiple items is the sum of the :func:`CMSG_SPACE` values for their associated data lengths. Raises :exc:`OverflowError` if *length* is outside the permissible range of values.
sv: Returnerar den buffertstorlek som behövs för att :meth:`~socket.recvmsg` ska kunna ta emot ett tilläggsdataobjekt med tillhörande data av den angivna *längden*, tillsammans med eventuell efterföljande utfyllnad. Det buffertutrymme som behövs för att ta emot flera objekt är summan av :func:`CMSG_SPACE`-värdena för deras associerade datalängder. Utlöser :exc:`OverflowError` om *length* ligger utanför det tillåtna värdeintervallet.

source: Note that some systems might support ancillary data without providing this function. Also note that setting the buffer size using the results of this function may not precisely limit the amount of ancillary data that can be received, since additional data may be able to fit into the padding area.
sv: Observera att vissa system kan stödja tilläggsdata utan att tillhandahålla denna funktion. Observera också att en inställning av buffertstorleken med hjälp av resultaten från denna funktion kanske inte exakt begränsar den mängd tilläggsdata som kan tas emot, eftersom ytterligare data kan rymmas i utfyllnadsområdet.

source: most Unix platforms.
sv: de flesta Unix-plattformar.

source: Return the default timeout in seconds (float) for new socket objects. A value of ``None`` indicates that new socket objects have no timeout. When the socket module is first imported, the default is ``None``.
sv: Returnerar standardtimeout i sekunder (float) för nya socket-objekt. Ett värde på ``None`` anger att nya socket-objekt inte har någon timeout. När socket-modulen importeras första gången är standardvärdet ``None``.

source: Set the default timeout in seconds (float) for new socket objects. When the socket module is first imported, the default is ``None``. See :meth:`~socket.settimeout` for possible values and their respective meanings.
sv: Ställ in standardtimeout i sekunder (float) för nya socket-objekt. När socket-modulen importeras första gången är standardvärdet ``None``. Se :meth:`~socket.settimeout` för möjliga värden och deras respektive betydelser.

source: Set the machine's hostname to *name*. This will raise an :exc:`OSError` if you don't have enough rights.
sv: Ställ in maskinens värdnamn till *namn*. Detta kommer att ge upphov till ett :exc:`OSError` om du inte har tillräckliga rättigheter.

source: Raises an :ref:`auditing event <auditing>` ``socket.sethostname`` with argument ``name``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.sethostname`` med argumentet ``name``.

source: Return a list of network interface information (index int, name string) tuples. :exc:`OSError` if the system call fails.
sv: Returnerar en lista med information om nätverksgränssnitt (index int, namnsträng). :exc:`OSError` om systemanropet misslyckas.

source: Windows support was added.
sv: Stöd för Windows har lagts till.

source: On Windows network interfaces have different names in different contexts (all names are examples):
sv: I Windows har nätverksgränssnitten olika namn i olika sammanhang (alla namn är exempel):

source: This function returns names of the second form from the list, ``ethernet_32770`` in this example case.
sv: Denna funktion returnerar namn av den andra formen från listan, ``ethernet_32770`` i detta exempel.

source: Return a network interface index number corresponding to an interface name. :exc:`OSError` if no interface with the given name exists.
sv: Returnerar ett indexnummer för ett nätverksgränssnitt som motsvarar ett gränssnittsnamn. :exc:`OSError` om det inte finns något gränssnitt med det angivna namnet.

source: "Interface name" is a name as documented in :func:`if_nameindex`.
sv: "Interface name" är ett namn som dokumenterats i :func:`if_nameindex`.

source: Return a network interface name corresponding to an interface index number. :exc:`OSError` if no interface with the given index exists.
sv: Returnerar ett nätverksgränssnittsnamn som motsvarar ett gränssnittsindexnummer. :exc:`OSError` om det inte finns något gränssnitt med angivet index.

source: Send the list of file descriptors *fds* over an :const:`AF_UNIX` socket *sock*. The *fds* parameter is a sequence of file descriptors. Consult :meth:`~socket.sendmsg` for the documentation of these parameters.
sv: Skicka listan med filbeskrivare *fds* över ett :const:`AF_UNIX`-socket *sock*. Parametern *fds* är en sekvens av filbeskrivare. Se :meth:`~socket.sendmsg` för dokumentation av dessa parametrar.

source: Unix platforms supporting :meth:`~socket.sendmsg` and :const:`SCM_RIGHTS` mechanism.
sv: Unix-plattformar som stöder :meth:`~socket.sendmsg` och :const:`SCM_RIGHTS` mekanism.

source: Receive up to *maxfds* file descriptors from an :const:`AF_UNIX` socket *sock*. Return ``(msg, list(fds), flags, addr)``. Consult :meth:`~socket.recvmsg` for the documentation of these parameters.
sv: Tar emot upp till *maxfds* filbeskrivare från en :const:`AF_UNIX` socket *sock*. Returnerar ``(msg, list(fds), flags, addr)``. Se :meth:`~socket.recvmsg` för dokumentation av dessa parametrar.

source: Unix platforms supporting :meth:`~socket.recvmsg` and :const:`SCM_RIGHTS` mechanism.
sv: Unix-plattformar som stöder :meth:`~socket.recvmsg` och :const:`SCM_RIGHTS` mekanism.

source: Any truncated integers at the end of the list of file descriptors.
sv: Eventuella avkortade heltal i slutet av listan över filbeskrivare.

source: Socket Objects
sv: Socket-objekt

source: Socket objects have the following methods. Except for :meth:`~socket.makefile`, these correspond to Unix system calls applicable to sockets.
sv: Socket-objekt har följande metoder. Med undantag för :meth:`~socket.makefile` motsvarar dessa Unix systemanrop som är tillämpliga på sockets.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`~socket.close`.
sv: Stöd för protokollet :term:`context manager` har lagts till. Att avsluta kontexthanteraren är likvärdigt med att anropa :meth:`~socket.close`.

source: Accept a connection. The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
sv: Acceptera en anslutning. Sockeln måste vara bunden till en adress och lyssna efter anslutningar. Returvärdet är ett par ``(conn, address)`` där *conn* är ett *nytt* socketobjekt som kan användas för att skicka och ta emot data på anslutningen, och *address* är adressen som är bunden till sockeln i andra änden av anslutningen.

source: The socket is now non-inheritable.
sv: Uttaget är nu icke-ärftligt.

source: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
sv: Om systemanropet avbryts och signalhanteraren inte ger upphov till ett undantag, försöker metoden nu göra om systemanropet istället för att ge upphov till ett :exc:`InterruptedError`-undantag (se :pep:`475` för förklaringen).

source: Bind the socket to *address*. The socket must not already be bound. (The format of *address* depends on the address family --- see above.)
sv: Binda uttaget till *adress*. Uttaget får inte redan vara bundet. (Formatet på *adress* beror på adressfamiljen --- se ovan)

source: Raises an :ref:`auditing event <auditing>` ``socket.bind`` with arguments ``self``, ``address``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.bind`` med argumenten ``self``, ``address``.

source: Mark the socket closed. The underlying system resource (e.g. a file descriptor) is also closed when all file objects from :meth:`makefile` are closed. Once that happens, all future operations on the socket object will fail. The remote end will receive no more data (after queued data is flushed).
sv: Markera uttaget som stängt. Den underliggande systemresursen (t.ex. en filbeskrivare) stängs också när alla filobjekt från :meth:`makefile` stängs. När det händer kommer alla framtida operationer på socket-objektet att misslyckas. Fjärränden kommer inte att ta emot några fler data (efter att köade data har spolats).

source: Sockets are automatically closed when they are garbage-collected, but it is recommended to :meth:`close` them explicitly, or to use a :keyword:`with` statement around them.
sv: Socklar stängs automatiskt när de samlas in, men det rekommenderas att :meth:`close` dem explicit, eller att använda ett :keyword:`with`-slutord runt dem.

source: :exc:`OSError` is now raised if an error occurs when the underlying :c:func:`close` call is made.
sv: :exc:`OSError` tas nu upp om ett fel uppstår när det underliggande :c:func:`close`-anropet görs.

source: :meth:`close` releases the resource associated with a connection but does not necessarily close the connection immediately. If you want to close the connection in a timely fashion, call :meth:`shutdown` before :meth:`close`.
sv: :meth:`close` frigör den resurs som är kopplad till en anslutning men stänger inte nödvändigtvis anslutningen omedelbart. Om du vill stänga anslutningen i rätt tid, anropa :meth:`shutdown` före :meth:`close`.

source: Connect to a remote socket at *address*. (The format of *address* depends on the address family --- see above.)
sv: Anslut till en fjärransluten socket på *adress*. (Formatet på *adress* beror på adressfamiljen --- se ovan)

source: If the connection is interrupted by a signal, the method waits until the connection completes, or raise a :exc:`TimeoutError` on timeout, if the signal handler doesn't raise an exception and the socket is blocking or has a timeout. For non-blocking sockets, the method raises an :exc:`InterruptedError` exception if the connection is interrupted by a signal (or the exception raised by the signal handler).
sv: Om anslutningen avbryts av en signal väntar metoden tills anslutningen är klar, eller ger upphov till ett :exc:`TimeoutError` vid timeout, om signalhanteraren inte ger upphov till ett undantag och uttaget är blockerande eller har en timeout. För icke-blockerande uttag ger metoden upphov till ett :exc:`InterruptedError`-undantag om anslutningen avbryts av en signal (eller det undantag som signalhanteraren ger upphov till).

source: Raises an :ref:`auditing event <auditing>` ``socket.connect`` with arguments ``self``, ``address``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.connect`` med argumenten ``self``, ``address``.

source: The method now waits until the connection completes instead of raising an :exc:`InterruptedError` exception if the connection is interrupted by a signal, the signal handler doesn't raise an exception and the socket is blocking or has a timeout (see the :pep:`475` for the rationale).
sv: Metoden väntar nu tills anslutningen är klar istället för att skapa ett :exc:`InterruptedError`-undantag om anslutningen avbryts av en signal, signalhanteraren inte skapar ett undantag och uttaget blockeras eller har en timeout (se :pep:`475` för motivering).

source: Like ``connect(address)``, but return an error indicator instead of raising an exception for errors returned by the C-level :c:func:`connect` call (other problems, such as "host not found," can still raise exceptions). The error indicator is ``0`` if the operation succeeded, otherwise the value of the :c:data:`errno` variable. This is useful to support, for example, asynchronous connects.
sv: Som ``connect(address)``, men returnerar en felindikator istället för att skapa ett undantag för fel som returneras av anropet :c:func:`connect` på C-nivå (andra problem, t.ex. "host not found", kan fortfarande skapa undantag). Felindikatorn är ``0`` om operationen lyckades, annars värdet på variabeln :c:data:`errno`. Detta är användbart för att stödja t.ex. asynkrona anslutningar.

source: Put the socket object into closed state without actually closing the underlying file descriptor. The file descriptor is returned, and can be reused for other purposes.
sv: Sätter socket-objektet i stängt tillstånd utan att faktiskt stänga den underliggande filbeskrivaren. Fildeskriptorn returneras och kan återanvändas för andra ändamål.

source: Duplicate the socket.
sv: Duplicera uttaget.

source: Return the socket's file descriptor (a small integer), or -1 on failure. This is useful with :func:`select.select`.
sv: Returnerar socketens filbeskrivare (ett litet heltal), eller -1 om den misslyckas. Detta är användbart med :func:`select.select`.

source: Under Windows the small integer returned by this method cannot be used where a file descriptor can be used (such as :func:`os.fdopen`). Unix does not have this limitation.
sv: Under Windows kan det lilla heltal som returneras av denna metod inte användas där en filbeskrivare kan användas (t.ex. :func:`os.fdopen`). Unix har inte denna begränsning.

source: Get the :ref:`inheritable flag <fd_inheritance>` of the socket's file descriptor or socket's handle: ``True`` if the socket can be inherited in child processes, ``False`` if it cannot.
sv: Hämta :ref:`inheritable flag <fd_inheritance>` för socketens filbeskrivare eller socketens handtag: ``True`` om sockeln kan ärvas i underordnade processer, ``False`` om den inte kan det.

source: Return the remote address to which the socket is connected. This is useful to find out the port number of a remote IPv4/v6 socket, for instance. (The format of the address returned depends on the address family --- see above.) On some systems this function is not supported.
sv: Returnerar den fjärradress som uttaget är anslutet till. Detta är till exempel användbart för att ta reda på portnumret för en fjärransluten IPv4/v6-socket. (Formatet på den adress som returneras beror på adressfamiljen --- se ovan) På vissa system stöds inte denna funktion.

source: Return the socket's own address. This is useful to find out the port number of an IPv4/v6 socket, for instance. (The format of the address returned depends on the address family --- see above.)
sv: Returnerar socketens egen adress. Detta är till exempel användbart för att ta reda på portnumret för ett IPv4/v6-uttag. (Formatet på den adress som returneras beror på adressfamiljen --- se ovan)
