Repository: yeager/python-docs-sv
Catalog: library/socket.po
Languages: sv

source: :mod:`!socket` --- Low-level networking interface
sv: :mod:`!socket` --- Gränssnitt för nätverk på låg nivå

source: **Source code:** :source:`Lib/socket.py`
sv: **Källkod:** :source:`Lib/socket.py`

source: This module provides access to the BSD *socket* interface. It is available on all modern Unix systems, Windows, MacOS, and probably additional platforms.
sv: Denna modul ger tillgång till BSD *socket*-gränssnittet. Den är tillgänglig på alla moderna Unix-system, Windows, MacOS och förmodligen ytterligare plattformar.

source: Some behavior may be platform dependent, since calls are made to the operating system socket APIs.
sv: Vissa beteenden kan vara plattformsberoende, eftersom anrop görs till operativsystemets socket-API:er.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: The Python interface is a straightforward transliteration of the Unix system call and library interface for sockets to Python's object-oriented style: the :func:`~socket.socket` function returns a :dfn:`socket object` whose methods implement the various socket system calls. Parameter types are somewhat higher-level than in the C interface: as with :meth:`read` and :meth:`write` operations on Python files, buffer allocation on receive operations is automatic, and buffer length is implicit on send operations.
sv: Python-gränssnittet är en enkel translitterering av Unix systemanrop och biblioteksgränssnitt för sockets till Pythons objektorienterade stil: funktionen :func:`~socket.socket` returnerar ett :dfn:`socket-objekt` vars metoder implementerar de olika systemanropen för sockets. Parametertyperna är på en något högre nivå än i C-gränssnittet: precis som med :meth:`read` och :meth:`write` operationer på Python-filer är buffertallokeringen vid mottagning automatisk och buffertlängden är implicit vid sändning.

source: Module :mod:`socketserver`
sv: Modul :mod:`socketserver`

source: Classes that simplify writing network servers.
sv: Klasser som förenklar skrivandet av nätverksservrar.

source: Module :mod:`ssl`
sv: Modul :mod:`ssl`

source: A TLS/SSL wrapper for socket objects.
sv: En TLS/SSL-wrapper för socket-objekt.

source: Socket families
sv: Uttagsfamiljer

source: Depending on the system and the build options, various socket families are supported by this module.
sv: Beroende på system och byggalternativ stöds olika sockelfamiljer av denna modul.

source: The address format required by a particular socket object is automatically selected based on the address family specified when the socket object was created. Socket addresses are represented as follows:
sv: Det adressformat som krävs av ett visst socket-objekt väljs automatiskt utifrån den adressfamilj som angavs när socket-objektet skapades. Socketadresser representeras på följande sätt:

source: The address of an :const:`AF_UNIX` socket bound to a file system node is represented as a string, using the file system encoding and the ``'surrogateescape'`` error handler (see :pep:`383`). An address in Linux's abstract namespace is returned as a :term:`bytes-like object` with an initial null byte; note that sockets in this namespace can communicate with normal file system sockets, so programs intended to run on Linux may need to deal with both types of address. A string or bytes-like object can be used for either type of address when passing it as an argument.
sv: Adressen till en :const:`AF_UNIX`-socket som är bunden till en filsystemnod representeras som en sträng med hjälp av filsystemets kodning och felhanteraren ``'surrogateescape'`` (se :pep:`383`). En adress i Linux abstrakta namnrymd returneras som ett :term:`bytesliknande objekt` med en inledande nollbyte; notera att uttag i denna namnrymd kan kommunicera med vanliga filsystemuttag, så program som är avsedda att köras på Linux kan behöva hantera båda typerna av adresser. En sträng eller ett bytesliknande objekt kan användas för båda typerna av adresser när det skickas som ett argument.

source: Previously, :const:`AF_UNIX` socket paths were assumed to use UTF-8 encoding.
sv: Tidigare antogs :const:`AF_UNIX` socket-sökvägar använda UTF-8-kodning.

source: Writable :term:`bytes-like object` is now accepted.
sv: Skrivbar :term:`bytesliknande objekt` är nu accepterad.

source: A pair ``(host, port)`` is used for the :const:`AF_INET` address family, where *host* is a string representing either a hostname in internet domain notation like ``'daring.cwi.nl'`` or an IPv4 address like ``'100.50.200.5'``, and *port* is an integer.
sv: Ett par ``(host, port)`` används för adressfamiljen :const:`AF_INET`, där *host* är en sträng som representerar antingen ett värdnamn i internetdomännotation som ``'daring.cwi.nl'`` eller en IPv4-adress som ``'100.50.200.5'``, och *port* är ett heltal.

source: For IPv4 addresses, two special forms are accepted instead of a host address: ``''`` represents :const:`INADDR_ANY`, which is used to bind to all interfaces, and the string ``'<broadcast>'`` represents :const:`INADDR_BROADCAST`. This behavior is not compatible with IPv6, therefore, you may want to avoid these if you intend to support IPv6 with your Python programs.
sv: För IPv4-adresser accepteras två specialformer i stället för en värdadress: ``''`` representerar :const:`INADDR_ANY`, som används för att binda till alla gränssnitt, och strängen ``'<broadcast>'`` representerar :const:`INADDR_BROADCAST`. Detta beteende är inte kompatibelt med IPv6, därför bör du undvika dessa om du avser att stödja IPv6 med dina Python-program.

source: For :const:`AF_INET6` address family, a four-tuple ``(host, port, flowinfo, scope_id)`` is used, where *flowinfo* and *scope_id* represent the ``sin6_flowinfo`` and ``sin6_scope_id`` members in :const:`struct sockaddr_in6` in C. For :mod:`socket` module methods, *flowinfo* and *scope_id* can be omitted just for backward compatibility. Note, however, omission of *scope_id* can cause problems in manipulating scoped IPv6 addresses.
sv: För adressfamiljen :const:`AF_INET6` används en fyrdubbling ``(host, port, flowinfo, scope_id)``, där *flowinfo* och *scope_id* representerar medlemmarna ``sin6_flowinfo`` och ``sin6_scope_id`` i :const:`struct sockaddr_in6` i C. För modulmetoderna :mod:`socket` kan *flowinfo* och *scope_id* utelämnas bara för bakåtkompatibilitet. Observera dock att utelämnande av *scope_id* kan orsaka problem vid manipulering av scoped IPv6-adresser.

source: For multicast addresses (with *scope_id* meaningful) *address* may not contain ``%scope_id`` (or ``zone id``) part. This information is superfluous and may be safely omitted (recommended).
sv: För multicast-adresser (med *scope_id* meningsfullt) får *address* inte innehålla delen ``%scope_id`` (eller ``zone id``). Denna information är överflödig och kan med fördel utelämnas (rekommenderas).

source: :const:`AF_NETLINK` sockets are represented as pairs ``(pid, groups)``.
sv: :const:`AF_NETLINK` sockets representeras som par ``(pid, groups)``.

source: Linux-only support for TIPC is available using the :const:`AF_TIPC` address family. TIPC is an open, non-IP based networked protocol designed for use in clustered computer environments. Addresses are represented by a tuple, and the fields depend on the address type. The general tuple form is ``(addr_type, v1, v2, v3 [, scope])``, where:
sv: Stöd för TIPC endast för Linux finns tillgängligt med hjälp av adressfamiljen :const:`AF_TIPC`. TIPC är ett öppet, icke-IP-baserat nätverksprotokoll som är utformat för användning i klustrade datormiljöer. Adresser representeras av en tupel och fälten beror på adresstypen. Den allmänna tupelformen är ``(addr_type, v1, v2, v3 [, scope])``, där:

source: *addr_type* is one of :const:`TIPC_ADDR_NAMESEQ`, :const:`TIPC_ADDR_NAME`, or :const:`TIPC_ADDR_ID`.
sv: *addr_type* är en av :const:`TIPC_ADDR_NAMESEQ`, :const:`TIPC_ADDR_NAME`, eller :const:`TIPC_ADDR_ID`.

source: *scope* is one of :const:`TIPC_ZONE_SCOPE`, :const:`TIPC_CLUSTER_SCOPE`, and :const:`TIPC_NODE_SCOPE`.
sv: *scope* är en av :const:`TIPC_ZONE_SCOPE`, :const:`TIPC_CLUSTER_SCOPE`, och :const:`TIPC_NODE_SCOPE`.

source: If *addr_type* is :const:`TIPC_ADDR_NAME`, then *v1* is the server type, *v2* is the port identifier, and *v3* should be 0.
sv: Om *addr_type* är :const:`TIPC_ADDR_NAME`, så är *v1* servertypen, *v2* portidentifieraren och *v3* bör vara 0.

source: If *addr_type* is :const:`TIPC_ADDR_NAMESEQ`, then *v1* is the server type, *v2* is the lower port number, and *v3* is the upper port number.
sv: Om *addr_type* är :const:`TIPC_ADDR_NAMESEQ`, så är *v1* servertypen, *v2* det lägre portnumret och *v3* det övre portnumret.

source: If *addr_type* is :const:`TIPC_ADDR_ID`, then *v1* is the node, *v2* is the reference, and *v3* should be set to 0.
sv: Om *addr_type* är :const:`TIPC_ADDR_ID`, så är *v1* noden, *v2* referensen och *v3* ska sättas till 0.

source: A tuple ``(interface, )`` is used for the :const:`AF_CAN` address family, where *interface* is a string representing a network interface name like ``'can0'``. The network interface name ``''`` can be used to receive packets from all network interfaces of this family.
sv: En tupel ``(interface, )`` används för adressfamiljen :const:`AF_CAN`, där *interface* är en sträng som representerar ett nätverksgränssnittsnamn som ``'can0'``. Nätverksgränssnittsnamnet ``''`` kan användas för att ta emot paket från alla nätverksgränssnitt i denna familj.

source: :const:`CAN_ISOTP` protocol require a tuple ``(interface, rx_addr, tx_addr)`` where both additional parameters are unsigned long integer that represent a CAN identifier (standard or extended).
sv: :const:`CAN_ISOTP`-protokollet kräver en tupel ``(interface, rx_addr, tx_addr)`` där båda tilläggsparametrarna är osignerade långa heltal som representerar en CAN-identifierare (standard eller utökad).

source: :const:`CAN_J1939` protocol require a tuple ``(interface, name, pgn, addr)`` where additional parameters are 64-bit unsigned integer representing the ECU name, a 32-bit unsigned integer representing the Parameter Group Number (PGN), and an 8-bit integer representing the address.
sv: :const:`CAN_J1939`-protokollet kräver en tupel ``(interface, name, pgn, addr)`` där ytterligare parametrar är ett 64-bitars osignerat heltal som representerar ECU-namnet, ett 32-bitars osignerat heltal som representerar parametergruppnumret (PGN) och ett 8-bitars heltal som representerar adressen.

source: A string or a tuple ``(id, unit)`` is used for the :const:`SYSPROTO_CONTROL` protocol of the :const:`PF_SYSTEM` family. The string is the name of a kernel control using a dynamically assigned ID. The tuple can be used if ID and unit number of the kernel control are known or if a registered ID is used.
sv: En sträng eller en tupel ``(id, unit)`` används för protokollet :const:`SYSPROTO_CONTROL` i familjen :const:`PF_SYSTEM`. Strängen är namnet på en kärnkontroll som använder ett dynamiskt tilldelat ID. Tupeln kan användas om ID och enhetsnummer för kärnkontrollen är kända eller om ett registrerat ID används.

source: :const:`AF_BLUETOOTH` supports the following protocols and address formats:
sv: :const:`AF_BLUETOOTH` stöder följande protokoll och adressformat:

source: :const:`BTPROTO_L2CAP` accepts a tuple ``(bdaddr, psm[, cid[, bdaddr_type]])`` where:
sv: :const:`BTPROTO_L2CAP` accepterar en tupel ``(bdaddr, psm[, cid[, bdaddr_type]])`` där:

source: ``bdaddr`` is a string specifying the Bluetooth address.
sv: ``bdaddr`` är en sträng som anger Bluetooth-adressen.

source: ``psm`` is an integer specifying the Protocol/Service Multiplexer.
sv: ``psm`` är ett heltal som anger Protocol/Service Multiplexer.

source: ``cid`` is an optional integer specifying the Channel Identifier. If not given, defaults to zero.
sv: ``cid`` är ett valfritt heltal som anger kanalidentifieraren. Om den inte anges är standardvärdet noll.

source: ``bdaddr_type`` is an optional integer specifying the address type; one of :const:`BDADDR_BREDR` (default), :const:`BDADDR_LE_PUBLIC`, :const:`BDADDR_LE_RANDOM`.
sv: ``bdaddr_type`` är ett valfritt heltal som anger adresstypen; en av :const:`BDADDR_BREDR` (standard), :const:`BDADDR_LE_PUBLIC`, :const:`BDADDR_LE_RANDOM`.

source: Added ``cid`` and ``bdaddr_type`` fields.
sv: Fälten ``cid`` och ``bdaddr_type`` tillagda.

source: :const:`BTPROTO_RFCOMM` accepts ``(bdaddr, channel)`` where ``bdaddr`` is the Bluetooth address as a string and ``channel`` is an integer.
sv: :const:`BTPROTO_RFCOMM` accepterar ``(bdaddr, channel)`` där ``bdaddr`` är Bluetooth-adressen som en sträng och ``channel`` är ett heltal.

source: :const:`BTPROTO_HCI` accepts a format that depends on your OS.
sv: :const:`BTPROTO_HCI` accepterar ett format som beror på ditt operativsystem.

source: On Linux it accepts an integer ``device_id`` or a tuple ``(device_id, [channel])`` where ``device_id`` specifies the number of the Bluetooth device, and ``channel`` is an optional integer specifying the HCI channel (:const:`HCI_CHANNEL_RAW` by default).
sv: På Linux accepterar den ett heltal ``device_id`` eller en tupel ``(device_id, [channel])`` där ``device_id`` anger numret på Bluetooth-enheten och ``channel`` är ett valfritt heltal som anger HCI-kanalen (:const:`HCI_CHANNEL_RAW`` som standard).

source: On FreeBSD, NetBSD and DragonFly BSD it accepts ``bdaddr`` where ``bdaddr`` is the Bluetooth address as a string.
sv: På FreeBSD, NetBSD och DragonFly BSD accepterar den ``bdaddr`` där ``bdaddr`` är Bluetooth-adressen som en sträng.

source: NetBSD and DragonFlyBSD support added.
sv: Stöd för NetBSD och DragonFlyBSD har lagts till.

source: FreeBSD support added.
sv: Stöd för FreeBSD har lagts till.

source: Added ``channel`` field. ``device_id`` not packed in a tuple is now accepted.
sv: Lagt till fältet ``channel``. ``device_id`` som inte är packat i en tupel accepteras nu.

source: :const:`BTPROTO_SCO` accepts ``bdaddr`` where ``bdaddr`` is the Bluetooth address as a string or a :class:`bytes` object. (ex. ``'12:23:34:45:56:67'`` or ``b'12:23:34:45:56:67'``)
sv: :const:`BTPROTO_SCO` accepterar ``bdaddr`` där ``bdaddr`` är Bluetooth-adressen som en sträng eller ett :class:`bytes`-objekt. (t.ex. ``'12:23:34:45:56:67'`` eller ``b'12:23:34:45:56:67'``)

source: :const:`AF_ALG` is a Linux-only socket based interface to Kernel cryptography. An algorithm socket is configured with a tuple of two to four elements ``(type, name [, feat [, mask]])``, where:
sv: :const:`AF_ALG` är ett socketbaserat gränssnitt för kärnkryptografi som endast används i Linux. En algoritmsockel konfigureras med en tuple av två till fyra element ``(typ, namn [, feat [, mask]])``, där:

source: *type* is the algorithm type as string, e.g. ``aead``, ``hash``, ``skcipher`` or ``rng``.
sv: *type* är algoritmtypen som en sträng, t.ex. ``aead``, ``hash``, ``skcipher`` eller ``rng``.

source: *name* is the algorithm name and operation mode as string, e.g. ``sha256``, ``hmac(sha256)``, ``cbc(aes)`` or ``drbg_nopr_ctr_aes256``.
sv: *name* är algoritmens namn och driftläge som en sträng, t.ex. ``sha256``, ``hmac(sha256)``, ``cbc(aes)`` eller ``drbg_nopr_ctr_aes256``.

source: *feat* and *mask* are unsigned 32bit integers.
sv: *feat* och *mask* är osignerade 32-bitars heltal.

source: Some algorithm types require more recent Kernels.
sv: Vissa algoritmtyper kräver nyare kärnor.

source: :const:`AF_VSOCK` allows communication between virtual machines and their hosts. The sockets are represented as a ``(CID, port)`` tuple where the context ID or CID and port are integers.
sv: :const:`AF_VSOCK` tillåter kommunikation mellan virtuella maskiner och deras värdar. Socklarna representeras som en ``(CID, port)``-tupel där kontext-ID eller CID och port är heltal.

source: See :manpage:`vsock(7)`
sv: Se :manpage:`vsock(7)`

source: :const:`AF_PACKET` is a low-level interface directly to network devices. The addresses are represented by the tuple ``(ifname, proto[, pkttype[, hatype[, addr]]])`` where:
sv: :const:`AF_PACKET` är ett lågnivågränssnitt direkt till nätverksenheter. Adresserna representeras av tupeln ``(ifname, proto[, pkttype[, hatype[, addr]]])`` där:

source: *ifname* - String specifying the device name.
sv: *ifname* - Sträng som anger enhetens namn.

source: *proto* - The Ethernet protocol number. May be :data:`ETH_P_ALL` to capture all protocols, one of the :ref:`ETHERTYPE_* constants <socket-ethernet-types>` or any other Ethernet protocol number.
sv: *proto* - Ethernetprotokollets nummer. Kan vara :data:`ETH_P_ALL` för att fånga alla protokoll, en av :ref:`ETHERTYPE_*-konstanterna <socket-ethernet-types>` eller något annat Ethernet-protokollnummer.

source: *pkttype* - Optional integer specifying the packet type:
sv: *pkttype* - Valfritt heltal som anger pakettyp:

source: ``PACKET_HOST`` (the default) - Packet addressed to the local host.
sv: ``PACKET_HOST`` (standard) - Paketet adresseras till den lokala värden.

source: ``PACKET_BROADCAST`` - Physical-layer broadcast packet.
sv: ``PACKET_BROADCAST`` - Broadcast-paket i det fysiska lagret.

source: ``PACKET_MULTICAST`` - Packet sent to a physical-layer multicast address.
sv: ``PACKET_MULTICAST`` - Paket som skickas till en multicastadress i det fysiska lagret.

source: ``PACKET_OTHERHOST`` - Packet to some other host that has been caught by a device driver in promiscuous mode.
sv: ``PACKET_OTHERHOST`` - Paket till en annan värd som har fångats upp av en enhetsdrivrutin i promiscuous-läge.

source: ``PACKET_OUTGOING`` - Packet originating from the local host that is looped back to a packet socket.
sv: ``PACKET_OUTGOING`` - Paket från den lokala värden som loopas tillbaka till ett paketuttag.

source: *hatype* - Optional integer specifying the ARP hardware address type.
sv: *hatype* - Valfritt heltal som anger typen av ARP-hårdvaruadress.

source: *addr* - Optional bytes-like object specifying the hardware physical address, whose interpretation depends on the device.
sv: *addr* - Valfritt bytesliknande objekt som anger den fysiska hårdvaruadressen, vars tolkning beror på enheten.

source: :const:`AF_QIPCRTR` is a Linux-only socket based interface for communicating with services running on co-processors in Qualcomm platforms. The address family is represented as a ``(node, port)`` tuple where the *node* and *port* are non-negative integers.
sv: :const:`AF_QIPCRTR` är ett socketbaserat gränssnitt för Linux för kommunikation med tjänster som körs på samprocessorer i Qualcomm-plattformar. Adressfamiljen representeras som en ``(nod, port)``-tupel där *nod* och *port* är icke-negativa heltal.

source: :const:`IPPROTO_UDPLITE` is a variant of UDP which allows you to specify what portion of a packet is covered with the checksum. It adds two socket options that you can change. ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_SEND_CSCOV, length)`` will change what portion of outgoing packets are covered by the checksum and ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_RECV_CSCOV, length)`` will filter out packets which cover too little of their data. In both cases ``length`` should be in ``range(8, 2**16, 8)``.
sv: :const:`IPPROTO_UDPLITE` är en variant av UDP som låter dig ange vilken del av ett paket som täcks av kontrollsumman. Den lägger till två socket-alternativ som du kan ändra. ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_SEND_CSCOV, length)`` ändrar hur stor del av utgående paket som täcks av kontrollsumman och ``self.setsockopt(IPPROTO_UDPLITE, UDPLITE_RECV_CSCOV, length)`` filtrerar bort paket som täcker för lite av sina data. I båda fallen bör ``length`` ligga i ``range(8, 2**16, 8)``.

source: Such a socket should be constructed with ``socket(AF_INET, SOCK_DGRAM, IPPROTO_UDPLITE)`` for IPv4 or ``socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDPLITE)`` for IPv6.
sv: En sådan socket bör konstrueras med ``socket(AF_INET, SOCK_DGRAM, IPPROTO_UDPLITE)`` för IPv4 eller ``socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDPLITE)`` för IPv6.

source: :const:`AF_HYPERV` is a Windows-only socket based interface for communicating with Hyper-V hosts and guests. The address family is represented as a ``(vm_id, service_id)`` tuple where the ``vm_id`` and ``service_id`` are UUID strings.
sv: :const:`AF_HYPERV` är ett socketbaserat gränssnitt för Windows för kommunikation med Hyper-V-värdar och -gäster. Adressfamiljen representeras som en ``(vm_id, service_id)``-tupel där ``vm_id`` och ``service_id`` är UUID-strängar.

source: The ``vm_id`` is the virtual machine identifier or a set of known VMID values if the target is not a specific virtual machine. Known VMID constants defined on ``socket`` are:
sv: ``vm_id`` är den virtuella maskinens identifierare eller en uppsättning kända VMID-värden om målet inte är en specifik virtuell maskin. Kända VMID-konstanter som definieras på ``socket`` är:

source: ``HV_GUID_WILDCARD`` - Used to bind on itself and accept connections from all partitions.
sv: ``HV_GUID_WILDCARD`` - Används för att binda på sig själv och acceptera anslutningar från alla partitioner.

source: ``HV_GUID_CHILDREN`` - Used to bind on itself and accept connection from child partitions.
sv: ``HV_GUID_CHILDREN`` - Används för att binda på sig själv och acceptera anslutning från underordnade partitioner.

source: ``HV_GUID_LOOPBACK`` - Used as a target to itself.
sv: ``HV_GUID_LOOPBACK`` - Används som mål för sig själv.

source: ``HV_GUID_PARENT`` - When used as a bind accepts connection from the parent partition. When used as an address target it will connect to the parent partition.
sv: ``HV_GUID_PARENT`` - När den används som bindning accepteras anslutning från den överordnade partitionen. När den används som adressmål kommer den att ansluta till den överordnade partitionen.

source: The ``service_id`` is the service identifier of the registered service.
sv: ``service_id`` är tjänsteidentifieraren för den registrerade tjänsten.

source: If you use a hostname in the *host* portion of IPv4/v6 socket address, the program may show a nondeterministic behavior, as Python uses the first address returned from the DNS resolution. The socket address will be resolved differently into an actual IPv4/v6 address, depending on the results from DNS resolution and/or the host configuration. For deterministic behavior use a numeric address in *host* portion.
sv: Om du använder ett värdnamn i *host*-delen av IPv4/v6-socketadressen kan programmet uppvisa ett icke-bestämbart beteende, eftersom Python använder den första adressen som returneras från DNS-upplösningen. Socketadressen kommer att lösas upp på olika sätt till en faktisk IPv4/v6-adress, beroende på resultaten från DNS-upplösningen och/eller värdkonfigurationen. För deterministiskt beteende använd en numerisk adress i *host*-delen.

source: All errors raise exceptions. The normal exceptions for invalid argument types and out-of-memory conditions can be raised. Errors related to socket or address semantics raise :exc:`OSError` or one of its subclasses.
sv: Alla fel ger upphov till undantag. De normala undantagen för ogiltiga argumenttyper och när minnet är slut kan användas. Fel relaterade till socket- eller adresssemantik ger upphov till :exc:`OSError` eller en av dess underklasser.

source: Non-blocking mode is supported through :meth:`~socket.setblocking`. A generalization of this based on timeouts is supported through :meth:`~socket.settimeout`.
sv: Icke-blockerande läge stöds genom :meth:`~socket.setblocking`. En generalisering av detta baserat på timeouts stöds genom :meth:`~socket.settimeout`.

source: Module contents
sv: Modulens innehåll

source: The module :mod:`socket` exports the following elements.
sv: Modulen :mod:`socket` exporterar följande element.

source: Exceptions
sv: Undantag
