Repository: yeager/python-docs-sv
Catalog: library/socketserver.po
Languages: sv

source: :mod:`!socketserver` --- A framework for network servers
sv: :mod:`!socketserver` --- Ett ramverk för nätverksservrar

source: **Source code:** :source:`Lib/socketserver.py`
sv: **Källkod:** :source:`Lib/socketserver.py`

source: The :mod:`socketserver` module simplifies the task of writing network servers.
sv: Modulen :mod:`socketserver` förenklar arbetet med att skriva nätverksservrar.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: There are four basic concrete server classes:
sv: Det finns fyra grundläggande konkreta serverklasser:

source: This uses the internet TCP protocol, which provides for continuous streams of data between the client and server. If *bind_and_activate* is true, the constructor automatically attempts to invoke :meth:`~BaseServer.server_bind` and :meth:`~BaseServer.server_activate`. The other parameters are passed to the :class:`BaseServer` base class.
sv: Detta använder TCP-protokollet för internet, vilket möjliggör kontinuerliga dataströmmar mellan klienten och servern. Om *bind_and_activate* är true försöker konstruktören automatiskt att anropa :meth:`~BaseServer.server_bind` och :meth:`~BaseServer.server_activate`. De andra parametrarna skickas till basklassen :class:`BaseServer`.

source: This uses datagrams, which are discrete packets of information that may arrive out of order or be lost while in transit. The parameters are the same as for :class:`TCPServer`.
sv: Detta använder datagram, som är diskreta paket med information som kan anlända i fel ordning eller förloras under transporten. Parametrarna är desamma som för :class:`TCPServer`.

source: These more infrequently used classes are similar to the TCP and UDP classes, but use Unix domain sockets; they're not available on non-Unix platforms. The parameters are the same as for :class:`TCPServer`.
sv: Dessa mer sällan använda klasser liknar TCP- och UDP-klasserna, men använder Unix-domänuttag; de är inte tillgängliga på plattformar som inte är Unix. Parametrarna är desamma som för :class:`TCPServer`.

source: These four classes process requests :dfn:`synchronously`; each request must be completed before the next request can be started. This isn't suitable if each request takes a long time to complete, because it requires a lot of computation, or because it returns a lot of data which the client is slow to process. The solution is to create a separate process or thread to handle each request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` mix-in classes can be used to support asynchronous behaviour.
sv: Dessa fyra klasser behandlar förfrågningar :dfn:`synkront`; varje förfrågan måste slutföras innan nästa förfrågan kan startas. Detta är inte lämpligt om varje begäran tar lång tid att slutföra, eftersom den kräver mycket beräkningar eller eftersom den returnerar mycket data som klienten är långsam att bearbeta. Lösningen är att skapa en separat process eller tråd för att hantera varje begäran; mix-in-klasserna :class:`ForkingMixIn` och :class:`ThreadingMixIn` kan användas för att stödja asynkront beteende.

source: Creating a server requires several steps. First, you must create a request handler class by subclassing the :class:`BaseRequestHandler` class and overriding its :meth:`~BaseRequestHandler.handle` method; this method will process incoming requests. Second, you must instantiate one of the server classes, passing it the server's address and the request handler class. It is recommended to use the server in a :keyword:`with` statement. Then call the :meth:`~BaseServer.handle_request` or :meth:`~BaseServer.serve_forever` method of the server object to process one or many requests. Finally, call :meth:`~BaseServer.server_close` to close the socket (unless you used a :keyword:`!with` statement).
sv: Att skapa en server kräver flera steg. Först måste du skapa en klass för hantering av begäranden genom att subklassa klassen :class:`BaseRequestHandler` och åsidosätta dess metod :meth:`~BaseRequestHandler.handle`; denna metod kommer att behandla inkommande begäranden. För det andra måste du instansiera en av serverklasserna och skicka serverns adress och request handler-klassen till den. Det rekommenderas att använda servern i en :keyword:`with`-sats. Anropa sedan metoden :meth:`~BaseServer.handle_request` eller :meth:`~BaseServer.serve_forever` i serverobjektet för att behandla en eller flera förfrågningar. Slutligen anropa :meth:`~BaseServer.server_close` för att stänga socket (om du inte använde en :keyword:`!with`-sats).

source: When inheriting from :class:`ThreadingMixIn` for threaded connection behavior, you should explicitly declare how you want your threads to behave on an abrupt shutdown. The :class:`ThreadingMixIn` class defines an attribute *daemon_threads*, which indicates whether or not the server should wait for thread termination. You should set the flag explicitly if you would like threads to behave autonomously; the default is :const:`False`, meaning that Python will not exit until all threads created by :class:`ThreadingMixIn` have exited.
sv: När du ärver från :class:`ThreadingMixIn` för trådat anslutningsbeteende bör du uttryckligen deklarera hur du vill att dina trådar ska bete sig vid en plötslig avstängning. Klassen :class:`ThreadingMixIn` definierar ett attribut *daemon_threads*, som anger om servern ska vänta på att tråden avslutas eller inte. Du bör sätta flaggan explicit om du vill att trådarna ska bete sig självständigt; standardvärdet är :const:`False`, vilket innebär att Python inte kommer att avslutas förrän alla trådar som skapats av :class:`ThreadingMixIn` har avslutats.

source: Server classes have the same external methods and attributes, no matter what network protocol they use.
sv: Serverklasser har samma externa metoder och attribut, oavsett vilket nätverksprotokoll de använder.

source: Server Creation Notes
sv: Anteckningar om skapande av server

source: There are five classes in an inheritance diagram, four of which represent synchronous servers of four types::
sv: Det finns fem klasser i ett arvsdiagram, varav fyra representerar synkrona servrar av fyra typer::

source: Note that :class:`UnixDatagramServer` derives from :class:`UDPServer`, not from :class:`UnixStreamServer` --- the only difference between an IP and a Unix server is the address family.
sv: Observera att :class:`UnixDatagramServer` härstammar från :class:`UDPServer`, inte från :class:`UnixStreamServer` --- den enda skillnaden mellan en IP- och en Unix-server är adressfamiljen.

source: Forking and threading versions of each type of server can be created using these mix-in classes. For instance, :class:`ThreadingUDPServer` is created as follows::
sv: Forking- och threading-versioner av varje typ av server kan skapas med hjälp av dessa mix-in-klasser. Till exempel skapas :class:`ThreadingUDPServer` på följande sätt::

source: class ThreadingUDPServer(ThreadingMixIn, UDPServer): pass
sv: klass ThreadingUDPServer(ThreadingMixIn, UDPServer): pass

source: The mix-in class comes first, since it overrides a method defined in :class:`UDPServer`. Setting the various attributes also changes the behavior of the underlying server mechanism.
sv: Mix-in-klassen kommer först, eftersom den åsidosätter en metod som definieras i :class:`UDPServer`. Genom att ställa in de olika attributen ändras också beteendet hos den underliggande servermekanismen.

source: :class:`ForkingMixIn` and the Forking classes mentioned below are only available on POSIX platforms that support :func:`~os.fork`.
sv: :class:`ForkingMixIn` och de Forking-klasser som nämns nedan är endast tillgängliga på POSIX-plattformar som stöder :func:`~os.fork`.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` waits until all child processes complete, except if :attr:`block_on_close` attribute is ``False``.
sv: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` väntar tills alla underordnade processer har slutförts, förutom om attributet :attr:`block_on_close` är ``False``.

source: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` waits until all non-daemon threads complete, except if :attr:`block_on_close` attribute is ``False``.
sv: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` väntar tills alla icke-daemon-trådar har avslutats, förutom om attributet :attr:`block_on_close` är ``False``.

source: Specify how many child processes will exist to handle requests at a time for :class:`ForkingMixIn`. If the limit is reached, new requests will wait until one child process has finished.
sv: Ange hur många underordnade processer som ska finnas för att hantera begäranden åt gången för :class:`ForkingMixIn`. Om gränsen nås kommer nya förfrågningar att vänta tills en underordnad process har avslutats.

source: For :class:`ThreadingMixIn` use daemonic threads by setting :data:`ThreadingMixIn.daemon_threads <daemon_threads>` to ``True`` to not wait until threads complete.
sv: För :class:`ThreadingMixIn` använd daemoniska trådar genom att ställa in :data:`ThreadingMixIn.daemon_threads <daemon_threads>` till ``True`` för att inte vänta tills trådarna är klara.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` and :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` now waits until all child processes and non-daemonic threads complete. Add a new :attr:`ForkingMixIn.block_on_close <block_on_close>` class attribute to opt-in for the pre-3.7 behaviour.
sv: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` och :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` väntar nu tills alla underordnade processer och icke-daemoniska trådar har slutförts. Lägg till ett nytt klassattribut :attr:`ForkingMixIn.block_on_close <block_on_close>` för att välja beteendet från före 3.7.

source: These classes are pre-defined using the mix-in classes.
sv: Dessa klasser är fördefinierade med hjälp av mix-in-klasserna.

source: The ``ForkingUnixStreamServer`` and ``ForkingUnixDatagramServer`` classes were added.
sv: Klasserna ``ForkingUnixStreamServer`` och ``ForkingUnixDatagramServer`` lades till.

source: To implement a service, you must derive a class from :class:`BaseRequestHandler` and redefine its :meth:`~BaseRequestHandler.handle` method. You can then run various versions of the service by combining one of the server classes with your request handler class. The request handler class must be different for datagram or stream services. This can be hidden by using the handler subclasses :class:`StreamRequestHandler` or :class:`DatagramRequestHandler`.
sv: För att implementera en tjänst måste du härleda en klass från :class:`BaseRequestHandler` och omdefiniera dess :meth:`~BaseRequestHandler.handle`-metod. Du kan sedan köra olika versioner av tjänsten genom att kombinera en av serverklasserna med din request handler-klass. Klassen för hantering av begäran måste vara olika för datagram- och strömtjänster. Detta kan döljas genom att använda hanterarsubklasserna :class:`StreamRequestHandler` eller :class:`DatagramRequestHandler`.

source: Of course, you still have to use your head! For instance, it makes no sense to use a forking server if the service contains state in memory that can be modified by different requests, since the modifications in the child process would never reach the initial state kept in the parent process and passed to each child. In this case, you can use a threading server, but you will probably have to use locks to protect the integrity of the shared data.
sv: Naturligtvis måste du fortfarande använda ditt huvud! Det är till exempel inte meningsfullt att använda en forking-server om tjänsten innehåller tillstånd i minnet som kan ändras av olika förfrågningar, eftersom ändringarna i barnprocessen aldrig skulle nå det ursprungliga tillståndet som förvaras i moderprocessen och skickas till varje barn. I det här fallet kan du använda en threading-server, men du måste förmodligen använda lås för att skydda integriteten hos de delade data.

source: On the other hand, if you are building an HTTP server where all data is stored externally (for instance, in the file system), a synchronous class will essentially render the service "deaf" while one request is being handled -- which may be for a very long time if a client is slow to receive all the data it has requested. Here a threading or forking server is appropriate.
sv: Om du å andra sidan bygger en HTTP-server där all data lagras externt (t.ex. i filsystemet), kommer en synkron klass i princip att göra tjänsten "döv" medan en förfrågan hanteras - vilket kan ta mycket lång tid om en klient är långsam med att få all data som den har begärt. Här är en threading- eller forking-server lämplig.

source: In some cases, it may be appropriate to process part of a request synchronously, but to finish processing in a forked child depending on the request data. This can be implemented by using a synchronous server and doing an explicit fork in the request handler class :meth:`~BaseRequestHandler.handle` method.
sv: I vissa fall kan det vara lämpligt att behandla en del av en begäran synkront, men att avsluta behandlingen i en förgrenad underordnad del beroende på begärandedata. Detta kan implementeras genom att använda en synkron server och göra en explicit förgrening i klassen för hantering av begäran :meth:`~BaseRequestHandler.handle` method.

source: Another approach to handling multiple simultaneous requests in an environment that supports neither threads nor :func:`~os.fork` (or where these are too expensive or inappropriate for the service) is to maintain an explicit table of partially finished requests and to use :mod:`selectors` to decide which request to work on next (or whether to handle a new incoming request). This is particularly important for stream services where each client can potentially be connected for a long time (if threads or subprocesses cannot be used).
sv: En annan metod för att hantera flera samtidiga förfrågningar i en miljö som varken stöder trådar eller :func:`~os.fork` (eller där dessa är för dyra eller olämpliga för tjänsten) är att upprätthålla en explicit tabell över delvis avslutade förfrågningar och att använda :mod:`selectors` för att bestämma vilken förfrågan som ska bearbetas härnäst (eller om en ny inkommande förfrågan ska hanteras). Detta är särskilt viktigt för strömtjänster där varje klient potentiellt kan vara ansluten under lång tid (om trådar eller underprocesser inte kan användas).

source: Server Objects
sv: Serverobjekt

source: This is the superclass of all Server objects in the module. It defines the interface, given below, but does not implement most of the methods, which is done in subclasses. The two parameters are stored in the respective :attr:`server_address` and :attr:`RequestHandlerClass` attributes.
sv: Detta är superklassen för alla Server-objekt i modulen. Den definierar det gränssnitt som anges nedan, men implementerar inte de flesta metoderna, vilket görs i underklasser. De två parametrarna lagras i respektive attribut :attr:`server_address` och :attr:`RequestHandlerClass`.

source: Return an integer file descriptor for the socket on which the server is listening. This function is most commonly passed to :mod:`selectors`, to allow monitoring multiple servers in the same process.
sv: Returnerar en heltalsfilbeskrivning för det uttag som servern lyssnar på. Denna funktion skickas oftast till :mod:`selectors`, för att möjliggöra övervakning av flera servrar i samma process.

source: Process a single request. This function calls the following methods in order: :meth:`get_request`, :meth:`verify_request`, and :meth:`process_request`. If the user-provided :meth:`~BaseRequestHandler.handle` method of the handler class raises an exception, the server's :meth:`handle_error` method will be called. If no request is received within :attr:`timeout` seconds, :meth:`handle_timeout` will be called and :meth:`handle_request` will return.
sv: Behandla en enskild begäran. Denna funktion anropar följande metoder i ordning: :meth:`get_request`, :meth:`verify_request`, och :meth:`process_request`. Om den användartillhandahållna metoden :meth:`~BaseRequestHandler.handle` i klassen handler ger upphov till ett undantag, anropas serverns metod :meth:`handle_error`. Om ingen begäran tas emot inom :attr:`timeout` sekunder, anropas :meth:`handle_timeout` och :meth:`handle_request` returneras.

source: Handle requests until an explicit :meth:`shutdown` request. Poll for shutdown every *poll_interval* seconds. Ignores the :attr:`timeout` attribute. It also calls :meth:`service_actions`, which may be used by a subclass or mixin to provide actions specific to a given service. For example, the :class:`ForkingMixIn` class uses :meth:`service_actions` to clean up zombie child processes.
sv: Hantera förfrågningar fram till en explicit :meth:`shutdown`-förfrågan. Pollar för avstängning varje *poll_interval* sekund. Ignorerar attributet :attr:`timeout`. Den anropar också :meth:`service_actions`, som kan användas av en subklass eller mixin för att tillhandahålla åtgärder som är specifika för en viss tjänst. Till exempel använder klassen :class:`ForkingMixIn` :meth:`service_actions` för att rensa upp zombiebarnprocesser.

source: Added ``service_actions`` call to the ``serve_forever`` method.
sv: Lagt till anropet ``service_actions`` till metoden ``serve_forever``.

source: This is called in the :meth:`serve_forever` loop. This method can be overridden by subclasses or mixin classes to perform actions specific to a given service, such as cleanup actions.
sv: Detta anropas i :meth:`serve_forever'-loopen. Denna metod kan åsidosättas av subklasser eller mixin-klasser för att utföra åtgärder som är specifika för en viss tjänst, t.ex. rensningsåtgärder.

source: Tell the :meth:`serve_forever` loop to stop and wait until it does. :meth:`shutdown` must be called while :meth:`serve_forever` is running in a different thread otherwise it will deadlock.
sv: Be :meth:`serve_forever`-loopen att sluta och vänta tills den gör det. :meth:`shutdown` måste anropas medan :meth:`serve_forever` körs i en annan tråd annars kommer den att låsa sig.

source: Clean up the server. May be overridden.
sv: Städa upp på servern. Kan åsidosättas.

source: The family of protocols to which the server's socket belongs. Common examples are :const:`socket.AF_INET`, :const:`socket.AF_INET6`, and :const:`socket.AF_UNIX`. Subclass the TCP or UDP server classes in this module with class attribute ``address_family = AF_INET6`` set if you want IPv6 server classes.
sv: Den familj av protokoll som serverns socket tillhör. Vanliga exempel är :const:`socket.AF_INET`, :const:`socket.AF_INET6` och :const:`socket.AF_UNIX`. Underordna TCP- eller UDP-serverklasserna i den här modulen med klassattributet ``address_family = AF_INET6`` inställt om du vill ha IPv6-serverklasser.

source: The user-provided request handler class; an instance of this class is created for each request.
sv: Den användartillhandahållna klassen för hantering av begäran; en instans av denna klass skapas för varje begäran.

source: The address on which the server is listening. The format of addresses varies depending on the protocol family; see the documentation for the :mod:`socket` module for details. For internet protocols, this is a tuple containing a string giving the address, and an integer port number: ``('127.0.0.1', 80)``, for example.
sv: Den adress som servern lyssnar på. Adressernas format varierar beroende på protokollfamilj; se dokumentationen för modulen :mod:`socket` för mer information. För internetprotokoll är detta en tupel som innehåller en sträng som anger adressen och ett heltals portnummer: ``('127.0.0.1', 80)``, till exempel.

source: The socket object on which the server will listen for incoming requests.
sv: Det socket-objekt som servern ska lyssna på för inkommande förfrågningar.

source: The server classes support the following class variables:
sv: Serverklasserna har stöd för följande klassvariabler:

source: Whether the server will allow the reuse of an address. This defaults to :const:`False`, and can be set in subclasses to change the policy.
sv: Om servern tillåter återanvändning av en adress. Standardvärdet är :const:`False`, och kan ställas in i underklasser för att ändra policyn.

source: The size of the request queue. If it takes a long time to process a single request, any requests that arrive while the server is busy are placed into a queue, up to :attr:`request_queue_size` requests. Once the queue is full, further requests from clients will get a "Connection denied" error. The default value is usually 5, but this can be overridden by subclasses.
sv: Storleken på förfrågningskön. Om det tar lång tid att behandla en enskild begäran placeras alla begäranden som kommer in medan servern är upptagen i en kö, upp till :attr:`request_queue_size` begäranden. När kön är full kommer ytterligare förfrågningar från klienter att få felmeddelandet "Connection denied". Standardvärdet är vanligtvis 5, men detta kan åsidosättas av underklasser.

source: The type of socket used by the server; :const:`socket.SOCK_STREAM` and :const:`socket.SOCK_DGRAM` are two common values.
sv: Den typ av socket som används av servern; :const:`socket.SOCK_STREAM` och :const:`socket.SOCK_DGRAM` är två vanliga värden.

source: Timeout duration, measured in seconds, or :const:`None` if no timeout is desired. If :meth:`handle_request` receives no incoming requests within the timeout period, the :meth:`handle_timeout` method is called.
sv: Timeout-tid, mätt i sekunder, eller :const:`None` om ingen timeout önskas. Om :meth:`handle_request` inte får några inkommande förfrågningar inom timeout-perioden anropas metoden :meth:`handle_timeout`.

source: There are various server methods that can be overridden by subclasses of base server classes like :class:`TCPServer`; these methods aren't useful to external users of the server object.
sv: Det finns olika servermetoder som kan åsidosättas av underklasser av basserverklasser som :class:`TCPServer`; dessa metoder är inte användbara för externa användare av serverobjektet.

source: Actually processes the request by instantiating :attr:`RequestHandlerClass` and calling its :meth:`~BaseRequestHandler.handle` method.
sv: Behandlar faktiskt begäran genom att instansiera :attr:`RequestHandlerClass` och anropa dess :meth:`~BaseRequestHandler.handle`-metod.

source: Must accept a request from the socket, and return a 2-tuple containing the *new* socket object to be used to communicate with the client, and the client's address.
sv: Måste acceptera en begäran från sockeln och returnera en 2-tupel som innehåller det *nya* socketobjektet som ska användas för att kommunicera med klienten och klientens adress.

source: This function is called if the :meth:`~BaseRequestHandler.handle` method of a :attr:`RequestHandlerClass` instance raises an exception. The default action is to print the traceback to standard error and continue handling further requests.
sv: Denna funktion anropas om metoden :meth:`~BaseRequestHandler.handle` i en instans av :attr:`RequestHandlerClass` ger upphov till ett undantag. Standardåtgärden är att skriva ut spårningen till standardfelet och fortsätta att hantera ytterligare förfrågningar.

source: Now only called for exceptions derived from the :exc:`Exception` class.
sv: Anropas nu endast för undantag som härrör från klassen :exc:`Exception`.
