Repository: yeager/python-docs-sv
Catalog: library/socket.po
Languages: sv

source: The newly created sockets are :ref:`non-inheritable <fd_inheritance>`.
sv: De nyskapade uttagen är :ref:`icke-ärftliga <fd_inheritance>`.

source: The returned socket objects now support the whole socket API, rather than a subset.
sv: De returnerade socket-objekten stöder nu hela socket-API:et, snarare än en delmängd.

source: The returned sockets are now non-inheritable.
sv: De återlämnade uttagen är nu icke-ärftliga.

source: Windows support added.
sv: Stöd för Windows har lagts till.

source: Connect to a TCP service listening on the internet *address* (a 2-tuple ``(host, port)``), and return the socket object. This is a higher-level function than :meth:`socket.connect`: if *host* is a non-numeric hostname, it will try to resolve it for both :data:`AF_INET` and :data:`AF_INET6`, and then try to connect to all possible addresses in turn until a connection succeeds. This makes it easy to write clients that are compatible to both IPv4 and IPv6.
sv: Anslut till en TCP-tjänst som lyssnar på internetadressen *address* (en 2-tupel ``(host, port)``) och returnera socket-objektet. Detta är en funktion på högre nivå än :meth:`socket.connect`: om *host* är ett icke-numeriskt värdnamn kommer den att försöka lösa det för både :data:`AF_INET` och :data:`AF_INET6`, och sedan försöka ansluta till alla möjliga adresser i tur och ordning tills en anslutning lyckas. Detta gör det enkelt att skriva klienter som är kompatibla med både IPv4 och IPv6.

source: Passing the optional *timeout* parameter will set the timeout on the socket instance before attempting to connect. If no *timeout* is supplied, the global default timeout setting returned by :func:`getdefaulttimeout` is used.
sv: Om den valfria parametern *timeout* anges kommer timeouten att ställas in på socket-instansen innan anslutningsförsök görs. Om ingen *timeout* anges används den globala standardinställningen för timeout som returneras av :func:`getdefaulttimeout`.

source: If supplied, *source_address* must be a 2-tuple ``(host, port)`` for the socket to bind to as its source address before connecting. If host or port are '' or 0 respectively the OS default behavior will be used.
sv: Om *source_address* anges måste det vara en 2-tupel ``(host, port)`` som sockeln ska binda till som sin källadress innan den ansluter. Om host eller port är '' respektive 0 kommer OS standardbeteende att användas.

source: When a connection cannot be created, an exception is raised. By default, it is the exception from the last address in the list. If *all_errors* is ``True``, it is an :exc:`ExceptionGroup` containing the errors of all attempts.
sv: Om det inte går att skapa en anslutning uppstår ett undantag. Som standard är det undantaget från den sista adressen i listan. Om *all_errors* är ``True``, är det en :exc:`ExceptionGroup` som innehåller felen i alla försök.

source: *source_address* was added.
sv: *source_address* har lagts till.

source: *all_errors* was added.
sv: *all_errors* har lagts till.

source: Convenience function which creates a TCP socket bound to *address* (a 2-tuple ``(host, port)``) and returns the socket object.
sv: Bekvämlighetsfunktion som skapar ett TCP-socket bundet till *adress* (en 2-tupel ``(host, port)``) och returnerar socket-objektet.

source: *family* should be either :data:`AF_INET` or :data:`AF_INET6`. *backlog* is the queue size passed to :meth:`socket.listen`; if not specified , a default reasonable value is chosen. *reuse_port* dictates whether to set the :data:`SO_REUSEPORT` socket option.
sv: *family* bör vara antingen :data:`AF_INET` eller :data:`AF_INET6`. *backlog* är den köstorlek som skickas till :meth:`socket.listen`; om inget anges väljs ett rimligt standardvärde. *reuse_port* avgör om socket-alternativet :data:`SO_REUSEPORT` ska ställas in.

source: If *dualstack_ipv6* is true, *family* is :data:`AF_INET6` and the platform supports it the socket will be able to accept both IPv4 and IPv6 connections, else it will raise :exc:`ValueError`. Most POSIX platforms and Windows are supposed to support this functionality. When this functionality is enabled the address returned by :meth:`socket.getpeername` when an IPv4 connection occurs will be an IPv6 address represented as an IPv4-mapped IPv6 address. If *dualstack_ipv6* is false it will explicitly disable this functionality on platforms that enable it by default (e.g. Linux). This parameter can be used in conjunction with :func:`has_dualstack_ipv6`:
sv: Om *dualstack_ipv6* är true, *family* är :data:`AF_INET6` och plattformen stöder det kommer uttaget att kunna acceptera både IPv4- och IPv6-anslutningar, annars kommer det att ge upphov till :exc:`ValueError`. De flesta POSIX-plattformar och Windows ska ha stöd för denna funktionalitet. När den här funktionen är aktiverad kommer den adress som returneras av :meth:`socket.getpeername` när en IPv4-anslutning sker att vara en IPv6-adress som representeras av en IPv4-mappad IPv6-adress. Om *dualstack_ipv6* är false kommer denna funktionalitet att uttryckligen inaktiveras på plattformar som aktiverar den som standard (t.ex. Linux). Denna parameter kan användas tillsammans med :func:`has_dualstack_ipv6`:

source: On POSIX platforms the :data:`SO_REUSEADDR` socket option is set in order to immediately reuse previous sockets which were bound on the same *address* and remained in TIME_WAIT state.
sv: På POSIX-plattformar är socket-alternativet :data:`SO_REUSEADDR` inställt för att omedelbart återanvända tidigare sockets som var bundna till samma *adress* och förblev i TIME_WAIT-tillstånd.

source: Return ``True`` if the platform supports creating a TCP socket which can handle both IPv4 and IPv6 connections.
sv: Returnerar ``True`` om plattformen stöder skapandet av ett TCP-uttag som kan hantera både IPv4- och IPv6-anslutningar.

source: Duplicate the file descriptor *fd* (an integer as returned by a file object's :meth:`~io.IOBase.fileno` method) and build a socket object from the result. Address family, socket type and protocol number are as for the :func:`~socket.socket` function above. The file descriptor should refer to a socket, but this is not checked --- subsequent operations on the object may fail if the file descriptor is invalid. This function is rarely needed, but can be used to get or set socket options on a socket passed to a program as standard input or output (such as a server started by the Unix inet daemon). The socket is assumed to be in blocking mode.
sv: Duplicera filbeskrivaren *fd* (ett heltal som returneras av ett filobjekts :meth:`~io.IOBase.fileno`-metod) och bygg ett socket-objekt från resultatet. Adressfamilj, socket-typ och protokollnummer är samma som för funktionen :func:`~socket.socket` ovan. Filens deskriptor bör referera till en socket, men detta kontrolleras inte --- efterföljande operationer på objektet kan misslyckas om filens deskriptor är ogiltig. Denna funktion behövs sällan, men kan användas för att hämta eller ställa in socket-alternativ på en socket som skickas till ett program som standardinmatning eller -utmatning (t.ex. en server som startas av Unix inet daemon). Sockeln antas vara i blockeringsläge.

source: Instantiate a socket from data obtained from the :meth:`socket.share` method. The socket is assumed to be in blocking mode.
sv: Instansiera ett uttag från data som erhållits från metoden :meth:`socket.share`. Uttaget antas vara i blockeringsläge.

source: This is a Python type object that represents the socket object type. It is the same as ``type(socket(...))``.
sv: Detta är ett Python-typobjekt som representerar objekttypen socket. Det är samma sak som ``type(socket(...))``.

source: Other functions
sv: Övriga funktioner

source: The :mod:`socket` module also offers various network-related services:
sv: Modulen :mod:`socket` erbjuder också olika nätverksrelaterade tjänster:

source: Close a socket file descriptor. This is like :func:`os.close`, but for sockets. On some platforms (most noticeable Windows) :func:`os.close` does not work for socket file descriptors.
sv: Stäng en filbeskrivare för en socket. Detta är som :func:`os.close`, men för sockets. På vissa plattformar (mest märkbart Windows) fungerar inte :func:`os.close` för socket-filbeskrivare.

source: This function wraps the C function ``getaddrinfo`` of the underlying system.
sv: Denna funktion omsluter C-funktionen ``getaddrinfo`` i det underliggande systemet.

source: Translate the *host*/*port* argument into a sequence of 5-tuples that contain all the necessary arguments for creating a socket connected to that service. *host* is a domain name, a string representation of an IPv4/v6 address or ``None``. *port* is a string service name such as ``'http'``, a numeric port number or ``None``. By passing ``None`` as the value of *host* and *port*, you can pass ``NULL`` to the underlying C API.
sv: Översätter *host*/*port*-argumentet till en sekvens av 5-tuples som innehåller alla nödvändiga argument för att skapa en socket som är ansluten till den tjänsten. *host* är ett domännamn, en strängrepresentation av en IPv4/v6-adress eller ``None``. *port* är ett strängnamn för en tjänst, t.ex. ``'http'``, ett numeriskt portnummer eller ``None``. Genom att ange ``None`` som värde för *host* och *port* kan du ange ``NULL`` till det underliggande C API:et.

source: The *family*, *type* and *proto* arguments can be optionally specified in order to provide options and limit the list of addresses returned. Pass their default values (:data:`AF_UNSPEC`, 0, and 0, respectively) to not limit the results. See the note below for details.
sv: Argumenten *family*, *type* och *proto* kan anges som tillval för att ge alternativ och begränsa listan med adresser som returneras. Använd deras standardvärden (:data:`AF_UNSPEC`, 0 respektive 0) för att inte begränsa resultaten. Se anmärkningen nedan för mer information.

source: The *flags* argument can be one or several of the ``AI_*`` constants, and will influence how results are computed and returned. For example, :const:`AI_NUMERICHOST` will disable domain name resolution and will raise an error if *host* is a domain name.
sv: Argumentet *flags* kan vara en eller flera av ``AI_*``-konstanterna och påverkar hur resultaten beräknas och returneras. Exempelvis kommer :const:`AI_NUMERICHOST` att inaktivera domännamnsupplösning och ge upphov till ett fel om *host* är ett domännamn.

source: The function returns a list of 5-tuples with the following structure:
sv: Funktionen returnerar en lista med 5-tuples med följande struktur:

source: In these tuples, *family*, *type*, *proto* are all integers and are meant to be passed to the :func:`~socket.socket` function. *canonname* will be a string representing the canonical name of the *host* if :const:`AI_CANONNAME` is part of the *flags* argument; else *canonname* will be empty. *sockaddr* is a tuple describing a socket address, whose format depends on the returned *family* (a ``(address, port)`` 2-tuple for :const:`AF_INET`, a ``(address, port, flowinfo, scope_id)`` 4-tuple for :const:`AF_INET6`), and is meant to be passed to the :meth:`socket.connect` method.
sv: I dessa tupler är *family*, *type*, *proto* alla heltal och är avsedda att skickas till funktionen :func:`~socket.socket`. *canonname* kommer att vara en sträng som representerar det kanoniska namnet på *host* om :const:`AI_CANONNAME` är en del av *flags*-argumentet; annars kommer *canonname* att vara tomt. *sockaddr* är en tupel som beskriver en socketadress, vars format beror på den returnerade *familjen* (en ``(adress, port)`` 2-tupel för :const:`AF_INET`, en ``(adress, port, flowinfo, scope_id)`` 4-tupel för :const:`AF_INET6`), och är avsedd att skickas till metoden :meth:`socket.connect`.

source: If you intend to use results from :func:`!getaddrinfo` to create a socket (rather than, for example, retrieve *canonname*), consider limiting the results by *type* (e.g. :data:`SOCK_STREAM` or :data:`SOCK_DGRAM`) and/or *proto* (e.g. :data:`IPPROTO_TCP` or :data:`IPPROTO_UDP`) that your application can handle.
sv: Om du tänker använda resultaten från :func:`!getaddrinfo` för att skapa ett uttag (i stället för att t.ex. hämta *canonname*) bör du överväga att begränsa resultaten efter *typ* (t.ex. :data:`SOCK_STREAM` eller :data:`SOCK_DGRAM`) och/eller *proto* (t.ex. :data:`IPPROTO_TCP` eller :data:`IPPROTO_UDP`) som ditt program kan hantera.

source: The behavior with default values of *family*, *type*, *proto* and *flags* is system-specific.
sv: Beteendet med standardvärden för *family*, *type*, *proto* och *flags* är systemspecifikt.

source: Many systems (for example, most Linux configurations) will return a sorted list of all matching addresses. These addresses should generally be tried in order until a connection succeeds (possibly tried in parallel, for example, using a `Happy Eyeballs`_ algorithm). In these cases, limiting the *type* and/or *proto* can help eliminate unsuccessful or unusable connection attempts.
sv: Många system (t.ex. de flesta Linux-konfigurationer) returnerar en sorterad lista över alla matchande adresser. Dessa adresser bör i allmänhet provas i tur och ordning tills en anslutning lyckas (eventuellt parallellt, t.ex. med hjälp av en `Happy Eyeballs`_-algoritm). I dessa fall kan en begränsning av *typ* och/eller *proto* bidra till att eliminera misslyckade eller oanvändbara anslutningsförsök.

source: Some systems will, however, only return a single address. (For example, this was reported on Solaris and AIX configurations.) On these systems, limiting the *type* and/or *proto* helps ensure that this address is usable.
sv: Vissa system returnerar dock bara en enda adress. (Detta har t.ex. rapporterats för Solaris- och AIX-konfigurationer.) På dessa system kan man genom att begränsa *type* och/eller *proto* säkerställa att adressen är användbar.

source: Raises an :ref:`auditing event <auditing>` ``socket.getaddrinfo`` with arguments ``host``, ``port``, ``family``, ``type``, ``protocol``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.getaddrinfo`` med argumenten ``host``, ``port``, ``family``, ``type``, ``protocol``.

source: The following example fetches address information for a hypothetical TCP connection to ``example.org`` on port 80 (results may differ on your system if IPv6 isn't enabled)::
sv: Följande exempel hämtar adressinformation för en hypotetisk TCP-anslutning till ``example.org`` på port 80 (resultaten kan skilja sig åt i ditt system om IPv6 inte är aktiverat)::

source: parameters can now be passed using keyword arguments.
sv: parametrar kan nu skickas med hjälp av nyckelordsargument.

source: for IPv6 multicast addresses, string representing an address will not contain ``%scope_id`` part.
sv: för IPv6 multicast-adresser kommer strängen som representerar en adress inte att innehålla delen ``%scope_id``.

source: Return a fully qualified domain name for *name*. If *name* is omitted or empty, it is interpreted as the local host. To find the fully qualified name, the hostname returned by :func:`gethostbyaddr` is checked, followed by aliases for the host, if available. The first name which includes a period is selected. In case no fully qualified domain name is available and *name* was provided, it is returned unchanged. If *name* was empty or equal to ``'0.0.0.0'``, the hostname from :func:`gethostname` is returned.
sv: Returnerar ett fullständigt kvalificerat domännamn för *namn*. Om *name* utelämnas eller är tomt tolkas det som den lokala värden. För att hitta det fullständigt kvalificerade namnet kontrolleras det värdnamn som returneras av :func:`gethostbyaddr`, följt av alias för värden, om sådana finns. Det första namnet som innehåller en punkt väljs. Om inget fullständigt kvalificerat domännamn finns tillgängligt och *name* angavs returneras det oförändrat. Om *name* var tomt eller lika med ``'0.0.0.0'`` returneras värdnamnet från :func:`gethostname`.

source: Translate a host name to IPv4 address format. The IPv4 address is returned as a string, such as ``'100.50.200.5'``. If the host name is an IPv4 address itself it is returned unchanged. See :func:`gethostbyname_ex` for a more complete interface. :func:`gethostbyname` does not support IPv6 name resolution, and :func:`getaddrinfo` should be used instead for IPv4/v6 dual stack support.
sv: Översätter ett värdnamn till IPv4-adressformat. IPv4-adressen returneras som en sträng, t.ex. ``'100.50.200.5'``. Om värdnamnet i sig är en IPv4-adress returneras den oförändrad. Se :func:`gethostbyname_ex` för ett mer komplett gränssnitt. :func:`gethostbyname` stöder inte IPv6-namnupplösning, och :func:`getaddrinfo` bör användas istället för IPv4/v6 dual stack-stöd.

source: Raises an :ref:`auditing event <auditing>` ``socket.gethostbyname`` with argument ``hostname``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.gethostbyname`` med argumentet ``hostname``.

source: Translate a host name to IPv4 address format, extended interface. Return a 3-tuple ``(hostname, aliaslist, ipaddrlist)`` where *hostname* is the host's primary host name, *aliaslist* is a (possibly empty) list of alternative host names for the same address, and *ipaddrlist* is a list of IPv4 addresses for the same interface on the same host (often but not always a single address). :func:`gethostbyname_ex` does not support IPv6 name resolution, and :func:`getaddrinfo` should be used instead for IPv4/v6 dual stack support.
sv: Översätter ett värdnamn till IPv4-adressformat, utökat gränssnitt. Returnerar en 3-tupel ``(hostname, aliaslist, ipaddrlist)`` där *hostname* är värdens primära värdnamn, *aliaslist* är en (eventuellt tom) lista med alternativa värdnamn för samma adress och *ipaddrlist* är en lista med IPv4-adresser för samma gränssnitt på samma värd (ofta men inte alltid en enda adress). :func:`gethostbyname_ex` har inte stöd för IPv6-namnupplösning och :func:`getaddrinfo` bör användas istället för IPv4/v6 dual stack-stöd.

source: Return a string containing the hostname of the machine where the Python interpreter is currently executing.
sv: Returnerar en sträng som innehåller värdnamnet på den maskin där Python-tolken körs för närvarande.

source: Raises an :ref:`auditing event <auditing>` ``socket.gethostname`` with no arguments.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.gethostname`` utan argument.

source: Note: :func:`gethostname` doesn't always return the fully qualified domain name; use :func:`getfqdn` for that.
sv: Observera: :func:`gethostname` returnerar inte alltid det fullständigt kvalificerade domännamnet; använd :func:`getfqdn` för det.

source: Return a 3-tuple ``(hostname, aliaslist, ipaddrlist)`` where *hostname* is the primary host name responding to the given *ip_address*, *aliaslist* is a (possibly empty) list of alternative host names for the same address, and *ipaddrlist* is a list of IPv4/v6 addresses for the same interface on the same host (most likely containing only a single address). To find the fully qualified domain name, use the function :func:`getfqdn`. :func:`gethostbyaddr` supports both IPv4 and IPv6.
sv: Returnerar en 3-tupel ``(hostname, aliaslist, ipaddrlist)`` där *hostname* är det primära värdnamnet som svarar på den angivna *ip_address*, *aliaslist* är en (eventuellt tom) lista över alternativa värdnamn för samma adress och *ipaddrlist* är en lista över IPv4/v6-adresser för samma gränssnitt på samma värd (innehåller troligen bara en enda adress). För att hitta det fullständigt kvalificerade domännamnet, använd funktionen :func:`getfqdn`. :func:`gethostbyaddr` stöder både IPv4 och IPv6.

source: Raises an :ref:`auditing event <auditing>` ``socket.gethostbyaddr`` with argument ``ip_address``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.gethostbyaddr`` med argumentet ``ip_address``.

source: Translate a socket address *sockaddr* into a 2-tuple ``(host, port)``. Depending on the settings of *flags*, the result can contain a fully qualified domain name or numeric address representation in *host*. Similarly, *port* can contain a string port name or a numeric port number.
sv: Översätter en socketadress *sockaddr* till en 2-tupel ``(host, port)``. Beroende på inställningarna i *flags* kan resultatet innehålla ett fullständigt kvalificerat domännamn eller en numerisk adressrepresentation i *host*. På samma sätt kan *port* innehålla en sträng med ett portnamn eller ett numeriskt portnummer.

source: For IPv6 addresses, ``%scope_id`` is appended to the host part if *sockaddr* contains meaningful *scope_id*. Usually this happens for multicast addresses.
sv: För IPv6-adresser läggs ``%scope_id`` till värddelen om *sockaddr* innehåller meningsfulla *scope_id*. Vanligtvis händer detta för multicast-adresser.

source: For more information about *flags* you can consult :manpage:`getnameinfo(3)`.
sv: För mer information om *flags* kan du läsa :manpage:`getnameinfo(3)`.

source: Raises an :ref:`auditing event <auditing>` ``socket.getnameinfo`` with argument ``sockaddr``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.getnameinfo`` med argumentet ``sockaddr``.

source: Translate an internet protocol name (for example, ``'icmp'``) to a constant suitable for passing as the (optional) third argument to the :func:`~socket.socket` function. This is usually only needed for sockets opened in "raw" mode (:const:`SOCK_RAW`); for the normal socket modes, the correct protocol is chosen automatically if the protocol is omitted or zero.
sv: Översätt ett internetprotokollnamn (t.ex. ``'icmp'``) till en konstant som kan användas som det (valfria) tredje argumentet till funktionen :func:`~socket.socket`. Detta behövs vanligtvis bara för socklar som öppnas i "raw"-läge (:const:`SOCK_RAW`); för de normala socketlägena väljs rätt protokoll automatiskt om protokollet utelämnas eller är noll.

source: Translate an internet service name and protocol name to a port number for that service. The optional protocol name, if given, should be ``'tcp'`` or ``'udp'``, otherwise any protocol will match.
sv: Översätter ett namn på en internettjänst och ett protokollnamn till ett portnummer för den tjänsten. Det valfria protokollnamnet, om det anges, bör vara ``'tcp'`` eller ``'udp'``, annars kommer alla protokoll att matcha.

source: Raises an :ref:`auditing event <auditing>` ``socket.getservbyname`` with arguments ``servicename``, ``protocolname``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.getservbyname`` med argumenten ``servicename``, ``protocolname``.

source: Translate an internet port number and protocol name to a service name for that service. The optional protocol name, if given, should be ``'tcp'`` or ``'udp'``, otherwise any protocol will match.
sv: Översätter ett internetportnummer och ett protokollnamn till ett servicenamn för den tjänsten. Det valfria protokollnamnet, om det anges, bör vara ``'tcp'`` eller ``'udp'``, annars kommer alla protokoll att matcha.

source: Raises an :ref:`auditing event <auditing>` ``socket.getservbyport`` with arguments ``port``, ``protocolname``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.getservbyport`` med argumenten ``port``, ``protocolname``.

source: Convert 32-bit positive integers from network to host byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 4-byte swap operation.
sv: Konverterar 32-bitars positiva heltal från nätverkets till värddatorns byteordning. På maskiner där värdbyteordningen är densamma som nätverksbyteordningen är detta ett no-op; annars utförs en swapoperation på 4 byte.
