Repository: yeager/python-docs-sv
Catalog: library/socket.po
Languages: sv

source: A deprecated alias of :exc:`OSError`.
sv: Ett föråldrat alias för :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
sv: Efter :pep:`3151` gjordes denna klass till ett alias för :exc:`OSError`.

source: A subclass of :exc:`OSError`, this exception is raised for address-related errors, i.e. for functions that use *h_errno* in the POSIX C API, including :func:`gethostbyname_ex` and :func:`gethostbyaddr`. The accompanying value is a pair ``(h_errno, string)`` representing an error returned by a library call. *h_errno* is a numeric value, while *string* represents the description of *h_errno*, as returned by the :c:func:`hstrerror` C function.
sv: Detta undantag är en underklass till :exc:`OSError` och uppstår vid adressrelaterade fel, dvs. för funktioner som använder *h_errno* i POSIX C API, inklusive :func:`gethostbyname_ex` och :func:`gethostbyaddr`. Det medföljande värdet är ett par ``(h_errno, string)`` som representerar ett fel som returneras av ett biblioteksanrop. *h_errno* är ett numeriskt värde, medan *sträng* representerar beskrivningen av *h_errno*, som returneras av C-funktionen :c:func:`hstrerror`.

source: This class was made a subclass of :exc:`OSError`.
sv: Denna klass gjordes till en underklass av :exc:`OSError`.

source: A subclass of :exc:`OSError`, this exception is raised for address-related errors by :func:`getaddrinfo` and :func:`getnameinfo`. The accompanying value is a pair ``(error, string)`` representing an error returned by a library call. *string* represents the description of *error*, as returned by the :c:func:`gai_strerror` C function. The numeric *error* value will match one of the :const:`!EAI_\*` constants defined in this module.
sv: Detta undantag, som är en underklass till :exc:`OSError`, uppstår vid adressrelaterade fel som orsakas av :func:`getaddrinfo` och :func:`getnameinfo`. Det medföljande värdet är ett par ``(error, string)`` som representerar ett fel som returneras av ett biblioteksanrop. *string* representerar beskrivningen av *error*, som returneras av C-funktionen :c:func:`gai_strerror`. Det numeriska *error*-värdet kommer att matcha en av :const:`!EAI_\*`-konstanterna som definieras i den här modulen.

source: A deprecated alias of :exc:`TimeoutError`.
sv: Ett föråldrat alias för :exc:`TimeoutError`.

source: A subclass of :exc:`OSError`, this exception is raised when a timeout occurs on a socket which has had timeouts enabled via a prior call to :meth:`~socket.settimeout` (or implicitly through :func:`~socket.setdefaulttimeout`). The accompanying value is a string whose value is currently always "timed out".
sv: Detta undantag är en underklass till :exc:`OSError` och uppstår när en timeout inträffar på ett uttag som har timeouts aktiverade via ett tidigare anrop till :meth:`~socket.settimeout` (eller implicit via :func:`~socket.setdefaulttimeout`). Det medföljande värdet är en sträng vars värde för närvarande alltid är "timed out".

source: This class was made an alias of :exc:`TimeoutError`.
sv: Denna klass gjordes till ett alias för :exc:`TimeoutError`.

source: Constants
sv: Konstanter

source: The AF_* and SOCK_* constants are now :class:`AddressFamily` and :class:`SocketKind` :class:`.IntEnum` collections.
sv: Konstanterna AF_* och SOCK_* är nu :class:`AddressFamily` och :class:`SocketKind` :class:`.IntEnum` samlingar.

source: These constants represent the address (and protocol) families, used for the first argument to :func:`~socket.socket`. If the :const:`AF_UNIX` constant is not defined then this protocol is unsupported. More constants may be available depending on the system.
sv: Dessa konstanter representerar de adress- (och protokoll-) familjer som används för det första argumentet till :func:`~socket.socket`. Om konstanten :const:`AF_UNIX` inte är definierad stöds inte det här protokollet. Fler konstanter kan vara tillgängliga beroende på systemet.

source: :const:`AF_UNSPEC` means that :func:`getaddrinfo` should return socket addresses for any address family (either IPv4, IPv6, or any other) that can be used.
sv: :const:`AF_UNSPEC` betyder att :func:`getaddrinfo` ska returnera socketadresser för alla adressfamiljer (antingen IPv4, IPv6 eller någon annan) som kan användas.

source: These constants represent the socket types, used for the second argument to :func:`~socket.socket`. More constants may be available depending on the system. (Only :const:`SOCK_STREAM` and :const:`SOCK_DGRAM` appear to be generally useful.)
sv: Dessa konstanter representerar de socket-typer som används för det andra argumentet till :func:`~socket.socket`. Fler konstanter kan vara tillgängliga beroende på systemet. (Endast :const:`SOCK_STREAM` och :const:`SOCK_DGRAM` verkar vara allmänt användbara)

source: These two constants, if defined, can be combined with the socket types and allow you to set some flags atomically (thus avoiding possible race conditions and the need for separate calls).
sv: Dessa två konstanter, om de definieras, kan kombineras med socket-typerna och gör att du kan ställa in vissa flaggor atomiskt (och därmed undvika eventuella tävlingsförhållanden och behovet av separata anrop).

source: `Secure File Descriptor Handling <https://udrepper.livejournal.com/20407.html>`_ for a more thorough explanation.
sv: säker hantering av File Descriptor <https://udrepper.livejournal.com/20407.html>`_ för en mer ingående förklaring.

source: Many constants of these forms, documented in the Unix documentation on sockets and/or the IP protocol, are also defined in the socket module. They are generally used in arguments to the :meth:`~socket.setsockopt` and :meth:`~socket.getsockopt` methods of socket objects. In most cases, only those symbols that are defined in the Unix header files are defined; for a few symbols, default values are provided.
sv: Många konstanter av dessa former, som finns dokumenterade i Unix-dokumentationen om sockets och/eller IP-protokollet, är också definierade i socket-modulen. De används i allmänhet som argument till metoderna :meth:`~socket.setsockopt` och :meth:`~socket.getsockopt` för socket-objekt. I de flesta fall definieras endast de symboler som finns definierade i Unix header-filer; för några få symboler anges standardvärden.

source: ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC``, ``SO_PASSSEC``, ``TCP_USER_TIMEOUT``, ``TCP_CONGESTION`` were added.
sv: ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC``, ``SO_PASSSEC``, ``TCP_USER_TIMEOUT``, ``TCP_CONGESTION`` lades till.

source: Added support for ``TCP_FASTOPEN``, ``TCP_KEEPCNT`` on Windows platforms when available.
sv: Lagt till stöd för ``TCP_FASTOPEN``, ``TCP_KEEPCNT`` på Windows-plattformar när det finns tillgängligt.

source: ``TCP_NOTSENT_LOWAT`` was added.
sv: ``TCP_NOTSENT_LOWAT`` lades till.

source: Added support for ``TCP_KEEPIDLE``, ``TCP_KEEPINTVL`` on Windows platforms when available.
sv: Lagt till stöd för ``TCP_KEEPIDLE``, ``TCP_KEEPINTVL`` på Windows-plattformar när det finns tillgängligt.

source: ``IP_RECVTOS`` was added. Added ``TCP_KEEPALIVE``. On MacOS this constant can be used in the same way that ``TCP_KEEPIDLE`` is used on Linux.
sv: ``IP_RECVTOS`` lades till. ``TCP_KEEPALIVE`` lades till. På MacOS kan denna konstant användas på samma sätt som ``TCP_KEEPIDLE`` används på Linux.

source: Added ``TCP_CONNECTION_INFO``. On MacOS this constant can be used in the same way that ``TCP_INFO`` is used on Linux and BSD.
sv: Lagt till ``TCP_CONNECTION_INFO``. På MacOS kan denna konstant användas på samma sätt som ``TCP_INFO`` används på Linux och BSD.

source: Added ``SO_RTABLE`` and ``SO_USER_COOKIE``. On OpenBSD and FreeBSD respectively those constants can be used in the same way that ``SO_MARK`` is used on Linux. Also added missing TCP socket options from Linux: ``TCP_MD5SIG``, ``TCP_THIN_LINEAR_TIMEOUTS``, ``TCP_THIN_DUPACK``, ``TCP_REPAIR``, ``TCP_REPAIR_QUEUE``, ``TCP_QUEUE_SEQ``, ``TCP_REPAIR_OPTIONS``, ``TCP_TIMESTAMP``, ``TCP_CC_INFO``, ``TCP_SAVE_SYN``, ``TCP_SAVED_SYN``, ``TCP_REPAIR_WINDOW``, ``TCP_FASTOPEN_CONNECT``, ``TCP_ULP``, ``TCP_MD5SIG_EXT``, ``TCP_FASTOPEN_KEY``, ``TCP_FASTOPEN_NO_COOKIE``, ``TCP_ZEROCOPY_RECEIVE``, ``TCP_INQ``, ``TCP_TX_DELAY``. Added ``IP_PKTINFO``, ``IP_UNBLOCK_SOURCE``, ``IP_BLOCK_SOURCE``, ``IP_ADD_SOURCE_MEMBERSHIP``, ``IP_DROP_SOURCE_MEMBERSHIP``.
sv: Lagt till ``SO_RTABLE`` och ``SO_USER_COOKIE``. På OpenBSD respektive FreeBSD kan dessa konstanter användas på samma sätt som ``SO_MARK`` används på Linux. Har även lagt till saknade TCP-socketalternativ från Linux: ``TCP_MD5SIG``, ``TCP_THIN_LINEAR_TIMEOUTS``, ``TCP_THIN_DUPACK``, ``TCP_REPAIR``, ``TCP_REPAIR_QUEUE``, ``TCP_QUEUE_SEQ``, ``TCP_REPAIR_OPTIONS``, ``TCP_TIMESTAMP``, ``TCP_CC_INFO``, ``TCP_SAVE_SYN``, ``TCP_SAVED_SYN``, ``TCP_REPAIR_WINDOW``, ``TCP_FASTOPEN_CONNECT``, ``TCP_ULP``, ``TCP_MD5SIG_EXT``, ``TCP_FASTOPEN_KEY``, ``TCP_FASTOPEN_NO_COOKIE``, ``TCP_ZEROCOPY_RECEIVE``, ``TCP_INQ``, ``TCP_TX_DELAY``. Lagt till ``IP_PKTINFO``, ``IP_UNBLOCK_SOURCE``, ``IP_BLOCK_SOURCE``, ``IP_ADD_SOURCE_MEMBERSHIP``, ``IP_DROP_SOURCE_MEMBERSHIP``.

source: Added ``SO_BINDTOIFINDEX``. On Linux this constant can be used in the same way that ``SO_BINDTODEVICE`` is used, but with the index of a network interface instead of its name.
sv: Lagt till ``SO_BINDTOIFINDEX``. På Linux kan denna konstant användas på samma sätt som ``SO_BINDTODEVICE``, men med indexet för ett nätverksgränssnitt i stället för dess namn.

source: Added missing ``IP_FREEBIND``, ``IP_RECVERR``, ``IPV6_RECVERR``, ``IP_RECVTTL``, and ``IP_RECVORIGDSTADDR`` on Linux.
sv: Lagt till saknade ``IP_FREEBIND``, ``IP_RECVERR``, ``IPV6_RECVERR``, ``IP_RECVTTL`` och ``IP_RECVORIGDSTADDR`` på Linux.

source: Added support for ``TCP_QUICKACK`` on Windows platforms when available.
sv: Lagt till stöd för ``TCP_QUICKACK`` på Windows-plattformar när det finns tillgängligt.

source: Many constants of these forms, documented in the Linux documentation, are also defined in the socket module.
sv: Många konstanter av dessa former, som finns dokumenterade i Linux-dokumentationen, definieras också i socket-modulen.

source: NetBSD support was added.
sv: Stöd för NetBSD har lagts till.

source: Restored missing ``CAN_RAW_ERR_FILTER`` on Linux.
sv: Återställde saknade ``CAN_RAW_ERR_FILTER`` på Linux.

source: CAN_BCM, in the CAN protocol family, is the broadcast manager (BCM) protocol. Broadcast manager constants, documented in the Linux documentation, are also defined in the socket module.
sv: CAN_BCM, i CAN-protokollfamiljen, är broadcast manager (BCM)-protokollet. Broadcast Manager-konstanter, som finns dokumenterade i Linux-dokumentationen, definieras också i socket-modulen.

source: The :data:`CAN_BCM_CAN_FD_FRAME` flag is only available on Linux >= 4.8.
sv: Flaggan :data:`CAN_BCM_CAN_FD_FRAME` är endast tillgänglig på Linux >= 4.8.

source: Enables CAN FD support in a CAN_RAW socket. This is disabled by default. This allows your application to send both CAN and CAN FD frames; however, you must accept both CAN and CAN FD frames when reading from the socket.
sv: Aktiverar stöd för CAN FD i ett CAN_RAW-uttag. Detta är avaktiverat som standard. Detta gör att din applikation kan skicka både CAN- och CAN FD-ramar, men du måste acceptera både CAN- och CAN FD-ramar när du läser från sockeln.

source: This constant is documented in the Linux documentation.
sv: Denna konstant finns dokumenterad i Linux-dokumentationen.

source: Joins the applied CAN filters such that only CAN frames that match all given CAN filters are passed to user space.
sv: Sammanfogar de tillämpade CAN-filtren så att endast CAN-ramar som matchar alla givna CAN-filter skickas till användarutrymmet.

source: CAN_ISOTP, in the CAN protocol family, is the ISO-TP (ISO 15765-2) protocol. ISO-TP constants, documented in the Linux documentation.
sv: CAN_ISOTP, i CAN-protokollfamiljen, är ISO-TP-protokollet (ISO 15765-2). ISO-TP-konstanter, dokumenterade i Linux-dokumentationen.

source: CAN_J1939, in the CAN protocol family, is the SAE J1939 protocol. J1939 constants, documented in the Linux documentation.
sv: CAN_J1939, i CAN-protokollfamiljen, är SAE J1939-protokollet. J1939-konstanter, dokumenterade i Linux-dokumentationen.

source: These two constants, documented in the FreeBSD divert(4) manual page, are also defined in the socket module.
sv: Dessa två konstanter, som finns dokumenterade i FreeBSD divert(4)-manualsidan, definieras också i socket-modulen.

source: :data:`!ETH_P_ALL` can be used in the :class:`~socket.socket` constructor as *proto* for the :const:`AF_PACKET` family in order to capture every packet, regardless of protocol.
sv: :data:`!ETH_P_ALL` kan användas i :class:`~socket.socket`-konstruktören som *proto* för :const:`AF_PACKET`-familjen för att fånga alla paket, oavsett protokoll.

source: For more information, see the :manpage:`packet(7)` manpage.
sv: För mer information, se :manpage:`packet(7)` manpage.

source: Constants for Windows' WSAIoctl(). The constants are used as arguments to the :meth:`~socket.socket.ioctl` method of socket objects.
sv: Konstanter för Windows WSAIoctl(). Konstanterna används som argument till :meth:`~socket.socket.ioctl`-metoden för socket-objekt.

source: ``SIO_LOOPBACK_FAST_PATH`` was added.
sv: ``SIO_LOOPBACK_FAST_PATH`` lades till.

source: TIPC related constants, matching the ones exported by the C socket API. See the TIPC documentation for more information.
sv: TIPC-relaterade konstanter, som matchar de som exporteras av C socket API. Se TIPC-dokumentationen för mer information.

source: Constants for Linux Kernel cryptography.
sv: Konstanter för Linux Kernel-kryptografi.

source: Constants for Linux host/guest communication.
sv: Konstanter för Linux host/guest-kommunikation.

source: This constant contains a boolean value which indicates if IPv6 is supported on this platform.
sv: Denna konstant innehåller ett booleskt värde som anger om IPv6 stöds på denna plattform.

source: Integer constants for use with Bluetooth addresses.
sv: Heltalskonstanter för användning med Bluetooth-adresser.

source: These are string constants containing Bluetooth addresses with special meanings. For example, :const:`BDADDR_ANY` can be used to indicate any address when specifying the binding socket with :const:`BTPROTO_RFCOMM`.
sv: Dessa är strängkonstanter som innehåller Bluetooth-adresser med speciella betydelser. Till exempel kan :const:`BDADDR_ANY` användas för att ange vilken adress som helst när du anger bindningsuttaget med :const:`BTPROTO_RFCOMM`.

source: These constants describe the Bluetooth address type when binding or connecting a :const:`BTPROTO_L2CAP` socket.
sv: Dessa konstanter beskriver Bluetooth-adresstypen när du binder eller ansluter ett :const:`BTPROTO_L2CAP`-uttag.

source: Used in the level argument to the :meth:`~socket.setsockopt` and :meth:`~socket.getsockopt` methods of Bluetooth socket objects.
sv: Används i level-argumentet till metoderna :meth:`~socket.setsockopt` och :meth:`~socket.getsockopt` för Bluetooth-socketobjekt.

source: :const:`SOL_BLUETOOTH` is only available on Linux. Other constants are available if the corresponding protocol is supported.
sv: :const:`SOL_BLUETOOTH` är endast tillgängligt på Linux. Andra konstanter är tillgängliga om det finns stöd för motsvarande protokoll.

source: Used in the option name and value argument to the :meth:`~socket.setsockopt` and :meth:`~socket.getsockopt` methods of Bluetooth socket objects.
sv: Används som argument för alternativnamn och värde i metoderna :meth:`~socket.setsockopt` och :meth:`~socket.getsockopt` för Bluetooth-socketobjekt.

source: :const:`!BT_*` and :const:`L2CAP_LM` are only available on Linux. :const:`!SO_BTH_*` are only available on Windows. Other constants may be available on Linux and various BSD platforms.
sv: :const:`!BT_*` och :const:`L2CAP_LM` är endast tillgängliga på Linux. :const:`!SO_BTH_*` är endast tillgängliga på Windows. Andra konstanter kan finnas tillgängliga på Linux och olika BSD-plattformar.

source: Option names for use with :const:`BTPROTO_HCI`. Availability and format of the option values depend on platform.
sv: Alternativnamn för användning med :const:`BTPROTO_HCI`. Tillgänglighet och format för alternativvärdena beror på plattform.

source: Added :const:`!SO_HCI_EVT_FILTER` and :const:`!SO_HCI_PKT_FILTER` on NetBSD and DragonFly BSD. Added :const:`!HCI_DATA_DIR` on FreeBSD, NetBSD and DragonFly BSD.
sv: Lagt till :const:`!SO_HCI_EVT_FILTER` och :const:`!SO_HCI_PKT_FILTER` på NetBSD och DragonFly BSD. Lagt till :const:`!HCI_DATA_DIR` på FreeBSD, NetBSD och DragonFly BSD.

source: The ``device_id`` value used to create an HCI socket that isn't specific to a single Bluetooth adapter.
sv: Värdet ``device_id`` som används för att skapa ett HCI-uttag som inte är specifikt för en enda Bluetooth-adapter.

source: Possible values for ``channel`` field in the :const:`BTPROTO_HCI` address.
sv: Möjliga värden för fältet ``channel`` i adressen :const:`BTPROTO_HCI`.

source: Constant for Qualcomm's IPC router protocol, used to communicate with service providing remote processors.
sv: Konstant för Qualcomms IPC-routerprotokoll, som används för att kommunicera med fjärrprocessorer som tillhandahåller tjänster.

source: LOCAL_CREDS and LOCAL_CREDS_PERSISTENT can be used with SOCK_DGRAM, SOCK_STREAM sockets, equivalent to Linux/DragonFlyBSD SO_PASSCRED, while LOCAL_CREDS sends the credentials at first read, LOCAL_CREDS_PERSISTENT sends for each read, SCM_CREDS2 must be then used for the latter for the message type.
sv: LOCAL_CREDS och LOCAL_CREDS_PERSISTENT kan användas med SOCK_DGRAM, SOCK_STREAM uttag, motsvarande Linux/DragonFlyBSD SO_PASSCRED, medan LOCAL_CREDS skickar inloggningsuppgifterna vid första läsningen, LOCAL_CREDS_PERSISTENT skickar för varje läsning, SCM_CREDS2 måste då användas för den senare för meddelandetypen.

source: Constant to optimize CPU locality, to be used in conjunction with :data:`SO_REUSEPORT`.
sv: Konstant för att optimera CPU-lokalisering, ska användas tillsammans med :data:`SO_REUSEPORT`.

source: Constant to enable duplicate address and port bindings with load balancing.
sv: Konstant för att aktivera duplicerade adress- och portbindningar med lastbalansering.

source: Constants for Windows Hyper-V sockets for host/guest communications.
sv: Konstanter för Windows Hyper-V-sockets för värd/gäst-kommunikation.

source: `IEEE 802.3 protocol number <https://www.iana.org/assignments/ieee-802-numbers/ieee-802-numbers.txt>`_. constants.
sv: `IEEE 802.3 protokollnummer <https://www.iana.org/assignments/ieee-802-numbers/ieee-802-numbers.txt>`_. konstanter.

source: These constants are used by the :meth:`~socket.socket.shutdown` method of socket objects.
sv: Dessa konstanter används av :meth:`~socket.socket.shutdown`-metoden för socket-objekt.

source: Functions
sv: Funktioner

source: Creating sockets
sv: Skapa uttag

source: The following functions all create :ref:`socket objects <socket-objects>`.
sv: Följande funktioner skapar alla :ref:`socket-objekt <socket-objects>`.

source: Create a new socket using the given address family, socket type and protocol number. The address family should be :const:`AF_INET` (the default), :const:`AF_INET6`, :const:`AF_UNIX`, :const:`AF_CAN`, :const:`AF_PACKET`, or :const:`AF_RDS`. The socket type should be :const:`SOCK_STREAM` (the default), :const:`SOCK_DGRAM`, :const:`SOCK_RAW` or perhaps one of the other ``SOCK_`` constants. The protocol number is usually zero and may be omitted or in the case where the address family is :const:`AF_CAN` the protocol should be one of :const:`CAN_RAW`, :const:`CAN_BCM`, :const:`CAN_ISOTP` or :const:`CAN_J1939`.
sv: Skapa en ny socket med hjälp av den angivna adressfamiljen, socket-typen och protokollnumret. Adressfamiljen bör vara :const:`AF_INET` (standard), :const:`AF_INET6`, :const:`AF_UNIX`, :const:`AF_CAN`, :const:`AF_PACKET` eller :const:`AF_RDS`. Socket-typen bör vara :const:`SOCK_STREAM` (standard), :const:`SOCK_DGRAM`, :const:`SOCK_RAW` eller kanske någon av de andra ``SOCK_``-konstanterna. Protokollnumret är vanligtvis noll och kan utelämnas eller i det fall adressfamiljen är :const:`AF_CAN` bör protokollet vara ett av :const:`CAN_RAW`, :const:`CAN_BCM`, :const:`CAN_ISOTP` eller :const:`CAN_J1939`.

source: If *fileno* is specified, the values for *family*, *type*, and *proto* are auto-detected from the specified file descriptor. Auto-detection can be overruled by calling the function with explicit *family*, *type*, or *proto* arguments. This only affects how Python represents e.g. the return value of :meth:`socket.getpeername` but not the actual OS resource. Unlike :func:`socket.fromfd`, *fileno* will return the same socket and not a duplicate. This may help close a detached socket using :meth:`socket.close`.
sv: Om *fileno* anges, hämtas värdena för *family*, *type* och *proto* automatiskt från den angivna filbeskrivaren. Automatisk detektering kan åsidosättas genom att anropa funktionen med uttryckliga *family*-, *type*- eller *proto*-argument. Detta påverkar endast hur Python representerar t.ex. returvärdet av :meth:`socket.getpeername` men inte den faktiska OS-resursen. Till skillnad från :func:`socket.fromfd` kommer *fileno* att returnera samma socket och inte en dubblett. Detta kan hjälpa till att stänga ett fristående uttag med hjälp av :meth:`socket.close`.

source: The newly created socket is :ref:`non-inheritable <fd_inheritance>`.
sv: Det nyskapade uttaget är :ref:`non-inherititable <fd_inheritance>`.

source: Raises an :ref:`auditing event <auditing>` ``socket.__new__`` with arguments ``self``, ``family``, ``type``, ``protocol``.
sv: Utlöser en :ref:`auditing event <auditing>` ``socket.__new__`` med argumenten ``self``, ``family``, ``type``, ``protocol``.

source: The AF_CAN family was added. The AF_RDS family was added.
sv: Familjen AF_CAN lades till. Familjen AF_RDS lades till.

source: The CAN_BCM protocol was added.
sv: Protokollet CAN_BCM har lagts till.

source: The returned socket is now non-inheritable.
sv: Den returnerade sockeln är nu inte ärftlig.

source: The CAN_ISOTP protocol was added.
sv: Protokollet CAN_ISOTP har lagts till.

source: When :const:`SOCK_NONBLOCK` or :const:`SOCK_CLOEXEC` bit flags are applied to *type* they are cleared, and :attr:`socket.type` will not reflect them. They are still passed to the underlying system ``socket()`` call. Therefore,
sv: När bitflaggorna :const:`SOCK_NONBLOCK` eller :const:`SOCK_CLOEXEC` tillämpas på *type* rensas de och :attr:`socket.type` kommer inte att återspegla dem. De skickas fortfarande till det underliggande systemets ``socket()``-anrop. Därför är

source: will still create a non-blocking socket on OSes that support ``SOCK_NONBLOCK``, but ``sock.type`` will be set to ``socket.SOCK_STREAM``.
sv: kommer fortfarande att skapa ett icke-blockerande uttag på operativsystem som stöder ``SOCK_NONBLOCK``, men ``sock.type`` kommer att sättas till ``socket.SOCK_STREAM``.

source: The CAN_J1939 protocol was added.
sv: Protokollet CAN_J1939 har lagts till.

source: The IPPROTO_MPTCP protocol was added.
sv: Protokollet IPPROTO_MPTCP har lagts till.

source: Build a pair of connected socket objects using the given address family, socket type, and protocol number. Address family, socket type, and protocol number are as for the :func:`~socket.socket` function above. The default family is :const:`AF_UNIX` if defined on the platform; otherwise, the default is :const:`AF_INET`.
sv: Bygger ett par anslutna socket-objekt med hjälp av den angivna adressfamiljen, socket-typen och protokollnumret. Adressfamilj, sockeltyp och protokollnummer är som för funktionen :func:`~socket.socket` ovan. Standardfamiljen är :const:`AF_UNIX` om den definieras på plattformen; annars är standard :const:`AF_INET`.
