Repository: yeager/python-docs-sv
Catalog: library/sqlite3.po
Languages: sv

source: # Example taken from https://www.sqlite.org/windowfunctions.html#udfwinfunc class WindowSumInt: def __init__(self): self.count = 0 def step(self, value): """Add a row to the current window.""" self.count += value def value(self): """Return the current value of the aggregate.""" return self.count def inverse(self, value): """Remove a row from the current window.""" self.count -= value def finalize(self): """Return the final value of the aggregate. Any clean-up actions should be placed here. """ return self.count con = sqlite3.connect(":memory:") cur = con.execute("CREATE TABLE test(x, y)") values = [ ("a", 4), ("b", 5), ("c", 3), ("d", 8), ("e", 1), ] cur.executemany("INSERT INTO test VALUES(?, ?)", values) con.create_window_function("sumint", 1, WindowSumInt) cur.execute(""" SELECT x, sumint(y) OVER ( ORDER BY x ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING ) AS sum_y FROM test ORDER BY x """) print(cur.fetchall()) con.close()
sv: # Exempel hämtat från https://www.sqlite.org/windowfunctions.html#udfwinfunc klass WindowSumInt: def __init__(self): self.count = 0 def step(self, värde): """Lägg till en rad i det aktuella fönstret.""" self.count += värde def value(self): """Returnera det aktuella värdet för aggregatet.""" return self.count def inverse(self, värde): """Ta bort en rad från det aktuella fönstret.""" self.count -= värde def finalize(self): """Returnera det slutliga värdet för aggregatet. Eventuella rensningsåtgärder bör placeras här. """ returnera self.count con = sqlite3.connect(":minne:") cur = con.execute("CREATE TABLE test(x, y)") värden = [ ("a", 4), ("b", 5), ("c", 3), ("d", 8), ("e", 1), ] cur.executemany("INSERT INTO test VALUES(?, ?)", värden) con.create_window_function("sumint", 1, WindowSumInt) cur.execute("""" SELECT x, sumint(y) OVER ( ORDER BY x RADAR MELLAN 1 FÖREGÅENDE OCH 1 EFTERFÖLJANDE ) AS sum_y FROM test ORDER BY x """) print(cur.fetchall()) con.close()

source: Create a collation named *name* using the collating function *callable*. *callable* is passed two :class:`string <str>` arguments, and it should return an :class:`integer <int>`:
sv: Skapa en kollationering med namnet *namn* med hjälp av kollationsfunktionen *callable*. *callable* får två :class:`sträng <str>`-argument, och den ska returnera en :class:`integer <int>`:

source: ``1`` if the first is ordered higher than the second
sv: ``1`` om den första är högre beställd än den andra

source: ``-1`` if the first is ordered lower than the second
sv: ``-1`` om den första är lägre ordnad än den andra

source: ``0`` if they are ordered equal
sv: ``0`` om de är ordnade lika

source: The following example shows a reverse sorting collation:
sv: Följande exempel visar en omvänd sorteringskollation:

source: def collate_reverse(string1, string2): if string1 == string2: return 0 elif string1 < string2: return 1 else: return -1 con = sqlite3.connect(":memory:") con.create_collation("reverse", collate_reverse) cur = con.execute("CREATE TABLE test(x)") cur.executemany("INSERT INTO test(x) VALUES(?)", [("a",), ("b",)]) cur.execute("SELECT x FROM test ORDER BY x COLLATE reverse") for row in cur: print(row) con.close()
sv: def collate_reverse(sträng1, sträng2): om sträng1 == sträng2: returnera 0 elif sträng1 < sträng2: returnera 1 annat: returnera -1 con = sqlite3.connect(":minne:") con.create_collation("reverse", kollationering_reverse) cur = con.execute("CREATE TABLE test(x)") cur.executemany("INSERT INTO test(x) VALUES(?)", [("a",), ("b",)]) cur.execute("SELECT x FROM test ORDER BY x COLLATE reverse") för rad i cur: print(rad) con.close()

source: Remove a collation function by setting *callable* to ``None``.
sv: Ta bort en sorteringsfunktion genom att sätta *callable* till ``None``.

source: The collation name can contain any Unicode character. Earlier, only ASCII characters were allowed.
sv: Sorteringsnamnet kan innehålla vilket Unicode-tecken som helst. Tidigare var endast ASCII-tecken tillåtna.

source: Call this method from a different thread to abort any queries that might be executing on the connection. Aborted queries will raise an :exc:`OperationalError`.
sv: Anropa den här metoden från en annan tråd för att avbryta eventuella frågor som körs på anslutningen. Avbrutna förfrågningar kommer att ge upphov till ett :exc:`OperationalError`.

source: Register :term:`callable` *authorizer_callback* to be invoked for each attempt to access a column of a table in the database. The callback should return one of :const:`SQLITE_OK`, :const:`SQLITE_DENY`, or :const:`SQLITE_IGNORE` to signal how access to the column should be handled by the underlying SQLite library.
sv: Registrera :term:`callable` *authorizer_callback* som ska anropas för varje försök att komma åt en kolumn i en tabell i databasen. Återkallelsen bör returnera en av :const:`SQLITE_OK`, :const:`SQLITE_DENY`, eller :const:`SQLITE_IGNORE` för att signalera hur åtkomst till kolumnen ska hanteras av det underliggande SQLite-biblioteket.

source: The first argument to the callback signifies what kind of operation is to be authorized. The second and third argument will be arguments or ``None`` depending on the first argument. The 4th argument is the name of the database ("main", "temp", etc.) if applicable. The 5th argument is the name of the inner-most trigger or view that is responsible for the access attempt or ``None`` if this access attempt is directly from input SQL code.
sv: Det första argumentet till callbacken anger vilken typ av operation som ska auktoriseras. Det andra och tredje argumentet kommer att vara argument eller ``None`` beroende på det första argumentet. Det fjärde argumentet är namnet på databasen ("main", "temp", etc.) om tillämpligt. Det femte argumentet är namnet på den innersta trigger eller vy som är ansvarig för åtkomstförsöket eller ``None`` om åtkomstförsöket kommer direkt från SQL-kod.

source: Please consult the SQLite documentation about the possible values for the first argument and the meaning of the second and third argument depending on the first one. All necessary constants are available in the :mod:`!sqlite3` module.
sv: Se SQLite-dokumentationen för information om möjliga värden för det första argumentet och betydelsen av det andra och tredje argumentet beroende på det första. Alla nödvändiga konstanter finns tillgängliga i modulen :mod:`!sqlite3`.

source: Passing ``None`` as *authorizer_callback* will disable the authorizer.
sv: Om du anger ``None`` som *authorizer_callback* inaktiveras authorizer.

source: Added support for disabling the authorizer using ``None``.
sv: Lagt till stöd för att inaktivera authorizer med hjälp av ``None``.

source: Passing *authorizer_callback* as a keyword argument is deprecated. The parameter will become positional-only in Python 3.15.
sv: Att skicka *authorizer_callback* som ett nyckelordsargument är föråldrat. Parametern blir endast positionell i Python 3.15.

source: Register :term:`callable` *progress_handler* to be invoked for every *n* instructions of the SQLite virtual machine. This is useful if you want to get called from SQLite during long-running operations, for example to update a GUI.
sv: Registrera :term:`callable` *progress_handler* som ska anropas för varje *n* instruktioner i den virtuella SQLite-maskinen. Detta är användbart om du vill bli anropad från SQLite under långvariga operationer, t.ex. för att uppdatera ett GUI.

source: If you want to clear any previously installed progress handler, call the method with ``None`` for *progress_handler*.
sv: Om du vill ta bort alla tidigare installerade progress-handläggare anropar du metoden med ``None`` för *progress_handler*.

source: Returning a non-zero value from the handler function will terminate the currently executing query and cause it to raise a :exc:`DatabaseError` exception.
sv: Om ett värde som inte är noll returneras från hanterarfunktionen kommer den aktuella frågan att avslutas och ett :exc:`DatabaseError`-undantag att skapas.

source: Passing *progress_handler* as a keyword argument is deprecated. The parameter will become positional-only in Python 3.15.
sv: Att skicka *progress_handler* som ett nyckelordsargument är föråldrat. Parametern blir endast positionell i Python 3.15.

source: Register :term:`callable` *trace_callback* to be invoked for each SQL statement that is actually executed by the SQLite backend.
sv: Registrera :term:`callable` *trace_callback* som ska anropas för varje SQL-sats som faktiskt körs av SQLite-backend.

source: The only argument passed to the callback is the statement (as :class:`str`) that is being executed. The return value of the callback is ignored. Note that the backend does not only run statements passed to the :meth:`Cursor.execute` methods. Other sources include the :ref:`transaction management <sqlite3-controlling-transactions>` of the :mod:`!sqlite3` module and the execution of triggers defined in the current database.
sv: Det enda argument som skickas till callbacken är det uttalande (som :class:`str`) som körs. Returvärdet för återuppringningen ignoreras. Observera att backend inte bara kör satser som skickas till :meth:`Cursor.execute`-metoderna. Andra källor inkluderar :ref:`transaction management <sqlite3-controlling-transactions>` i :mod:`!sqlite3`-modulen och exekveringen av triggers som definieras i den aktuella databasen.

source: Passing ``None`` as *trace_callback* will disable the trace callback.
sv: Om du anger ``None`` som *trace_callback* inaktiveras spårningsuppringningen.

source: Exceptions raised in the trace callback are not propagated. As a development and debugging aid, use :meth:`~sqlite3.enable_callback_tracebacks` to enable printing tracebacks from exceptions raised in the trace callback.
sv: Undantag som uppstår i trace callback sprids inte. Som ett hjälpmedel för utveckling och felsökning kan du använda :meth:`~sqlite3.enable_callback_tracebacks` för att aktivera utskrift av spårningar från undantag som tas upp i trace callback.

source: Passing *trace_callback* as a keyword argument is deprecated. The parameter will become positional-only in Python 3.15.
sv: Att skicka *trace_callback* som ett nyckelordsargument är föråldrat. Parametern blir endast positionell i Python 3.15.

source: Enable the SQLite engine to load SQLite extensions from shared libraries if *enabled* is ``True``; else, disallow loading SQLite extensions. SQLite extensions can define new functions, aggregates or whole new virtual table implementations. One well-known extension is the fulltext-search extension distributed with SQLite.
sv: Aktivera SQLite-motorn att ladda SQLite-tillägg från delade bibliotek om *enabled* är ``True``; annars, avaktivera laddning av SQLite-tillägg. SQLite-tillägg kan definiera nya funktioner, aggregat eller helt nya implementeringar av virtuella tabeller. Ett välkänt tillägg är fulltext-söktillägget som distribueras med SQLite.

source: The :mod:`!sqlite3` module is not built with loadable extension support by default, because some platforms (notably macOS) have SQLite libraries which are compiled without this feature. To get loadable extension support, you must pass the :option:`--enable-loadable-sqlite-extensions` option to :program:`configure`.
sv: Modulen :mod:`!sqlite3` är inte byggd med stöd för laddningsbara tillägg som standard, eftersom vissa plattformar (särskilt macOS) har SQLite-bibliotek som är kompilerade utan denna funktion. För att få stöd för laddningsbara tillägg måste du skicka alternativet :option:`--enable-loadable-sqlite-extensions` till :program:`configure`.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.enable_load_extension`` with arguments ``connection``, ``enabled``.
sv: Utlöser en :ref:`auditing event <auditing>` ``sqlite3.enable_load_extension`` med argumenten ``connection``, ``enabled``.

source: Added the ``sqlite3.enable_load_extension`` auditing event.
sv: Lagt till granskningshändelsen ``sqlite3.enable_load_extension``.

source: con.enable_load_extension(True) # Load the fulltext search extension con.execute("select load_extension('./fts3.so')") # alternatively you can load the extension using an API call: # con.load_extension("./fts3.so") # disable extension loading again con.enable_load_extension(False) # example from SQLite wiki con.execute("CREATE VIRTUAL TABLE recipe USING fts3(name, ingredients)") con.executescript(""" INSERT INTO recipe (name, ingredients) VALUES('broccoli stew', 'broccoli peppers cheese tomatoes'); INSERT INTO recipe (name, ingredients) VALUES('pumpkin stew', 'pumpkin onions garlic celery'); INSERT INTO recipe (name, ingredients) VALUES('broccoli pie', 'broccoli cheese onions flour'); INSERT INTO recipe (name, ingredients) VALUES('pumpkin pie', 'pumpkin sugar flour butter'); """) for row in con.execute("SELECT rowid, name, ingredients FROM recipe WHERE name MATCH 'pie'"): print(row)
sv: con.enable_load_extension(True) # Ladda tillägget för fulltextsökning con.execute("select load_extension('./fts3.so')") # alternativt kan du ladda tillägget med hjälp av ett API-anrop: # con.load_extension("./fts3.so") # inaktivera laddning av tillägg igen con.enable_load_extension(False) # exempel från SQLite wiki con.execute("CREATE VIRTUAL TABLE recipe USING fts3(namn, ingredienser)") con.executescript("""" INSERT INTO recipe (namn, ingredienser) VALUES('broccoligryta', 'broccoli paprika ost tomater'); INSERT INTO recept (namn, ingredienser) VALUES('pumpagryta', 'pumpa lök vitlök selleri'); INSERT INTO recept (namn, ingredienser) VALUES('broccolipaj', 'broccoli ost lök mjöl'); INSERT INTO recept (namn, ingredienser) VALUES('pumpapaj', 'pumpa socker mjöl smör'); """) for row in con.execute("SELECT rowid, name, ingredients FROM recipe WHERE name MATCH 'pie'"): print(rad)

source: Load an SQLite extension from a shared library. Enable extension loading with :meth:`enable_load_extension` before calling this method.
sv: Laddar ett SQLite-tillägg från ett delat bibliotek. Aktivera laddning av tillägg med :meth:`enable_load_extension` innan du anropar den här metoden.

source: The path to the SQLite extension.
sv: Sökvägen till SQLite-tillägget.

source: Entry point name. If ``None`` (the default), SQLite will come up with an entry point name of its own; see the SQLite docs `Loading an Extension`_ for details.
sv: Namn på ingångspunkten. Om ``None`` (standard) kommer SQLite att hitta på ett eget namn på ingångspunkten; se SQLite-dokumenten `Loading an Extension`_ för mer information.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.load_extension`` with arguments ``connection``, ``path``.
sv: Utlöser en :ref:`auditing event <auditing>` ``sqlite3.load_extension`` med argumenten ``connection``, ``path``.

source: Added the ``sqlite3.load_extension`` auditing event.
sv: Lagt till granskningshändelsen ``sqlite3.load_extension``.

source: Added the *entrypoint* parameter.
sv: Parametern *entrypoint* har lagts till.

source: Return an :term:`iterator` to dump the database as SQL source code. Useful when saving an in-memory database for later restoration. Similar to the ``.dump`` command in the :program:`sqlite3` shell.
sv: Returnerar en :term:`iterator` för att dumpa databasen som SQL-källkod. Användbart när du sparar en databas i minnet för senare återställning. Liknar kommandot ``.dump`` i skalet :program:`sqlite3`.

source: An optional ``LIKE`` pattern for database objects to dump, e.g. ``prefix_%``. If ``None`` (the default), all database objects will be included.
sv: Ett valfritt ``LIKE``-mönster för databasobjekt som ska dumpas, t.ex. ``prefix_%``. Om ``None`` (standard) kommer alla databasobjekt att inkluderas.

source: # Convert file example.db to SQL dump file dump.sql con = sqlite3.connect('example.db') with open('dump.sql', 'w') as f: for line in con.iterdump(): f.write('%s\n' % line) con.close()
sv: # Konvertera filen example.db till SQL-dumpfilen dump.sql con = sqlite3.connect('exempel.db') med open('dump.sql', 'w') som f: för rad i con.iterdump(): f.write('%s\n' % line) con.close()

source: :ref:`sqlite3-howto-encoding`
sv: :ref:`sqlite3-hur-man-kodar`

source: Added the *filter* parameter.
sv: Parametern *filter* har lagts till.

source: Create a backup of an SQLite database.
sv: Skapa en säkerhetskopia av en SQLite-databas.

source: Works even if the database is being accessed by other clients or concurrently by the same connection.
sv: Fungerar även om databasen nås av andra klienter eller samtidigt med samma anslutning.

source: The database connection to save the backup to.
sv: Den databasanslutning som säkerhetskopian ska sparas i.

source: The number of pages to copy at a time. If equal to or less than ``0``, the entire database is copied in a single step. Defaults to ``-1``.
sv: Antalet sidor som ska kopieras åt gången. Om det är lika med eller mindre än ``0`` kopieras hela databasen i ett enda steg. Standardvärdet är ``-1``.

source: If set to a :term:`callable`, it is invoked with three integer arguments for every backup iteration: the *status* of the last iteration, the *remaining* number of pages still to be copied, and the *total* number of pages. Defaults to ``None``.
sv: Om den är inställd på en :term:`callable`, anropas den med tre heltalsargument för varje backup-iteration: *status* för den senaste iterationen, det *återstående* antalet sidor som fortfarande ska kopieras och det *totala* antalet sidor. Standardvärdet är ``None``.

source: The name of the database to back up. Either ``"main"`` (the default) for the main database, ``"temp"`` for the temporary database, or the name of a custom database as attached using the ``ATTACH DATABASE`` SQL statement.
sv: Namnet på den databas som ska säkerhetskopieras. Antingen ``"main"`` (standard) för huvuddatabasen, ``"temp"`` för den tillfälliga databasen eller namnet på en anpassad databas som bifogats med SQL-satsen ``ATTACH DATABASE``.

source: The number of seconds to sleep between successive attempts to back up remaining pages.
sv: Antalet sekunder som ska gå mellan två på varandra följande försök att säkerhetskopiera återstående sidor.

source: Example 1, copy an existing database into another:
sv: Exempel 1, kopiera en befintlig databas till en annan:

source: def progress(status, remaining, total): print(f'Copied {total-remaining} of {total} pages...') src = sqlite3.connect('example.db') dst = sqlite3.connect('backup.db') with dst: src.backup(dst, pages=1, progress=progress) dst.close() src.close()
sv: def progress(status, återstående, totalt): print(f'Kopierade {total-remaining} av {total} sidor...') src = sqlite3.connect('exempel.db') dst = sqlite3.connect('backup.db') med dst: src.backup(dst, sidor=1, framsteg=framsteg) dst.close() src.close()

source: Example 2, copy an existing database into a transient copy:
sv: Exempel 2, kopiera en befintlig databas till en tillfällig kopia:

source: src = sqlite3.connect('example.db') dst = sqlite3.connect(':memory:') src.backup(dst) dst.close() src.close()
sv: src = sqlite3.connect('exempel.db') dst = sqlite3.connect(':minne:') src.backup(dst) dst.close() src.close()

source: Get a connection runtime limit.
sv: Få en gräns för anslutningens körtid.

source: The `SQLite limit category`_ to be queried.
sv: Den `SQLite-gränskategori`_ som ska frågas.

source: If *category* is not recognised by the underlying SQLite library.
sv: Om *category* inte känns igen av det underliggande SQLite-biblioteket.

source: Example, query the maximum length of an SQL statement for :class:`Connection` ``con`` (the default is 1000000000):
sv: Exempel, fråga om den maximala längden på en SQL-sats för :class:`Connection`` ``con`` (standardvärdet är 1000000000):

source: Set a connection runtime limit. Attempts to increase a limit above its hard upper bound are silently truncated to the hard upper bound. Regardless of whether or not the limit was changed, the prior value of the limit is returned.
sv: Ställ in en gräns för anslutningens körtid. Försök att öka en gräns över dess hårda övre gräns avkortas tyst till den hårda övre gränsen. Oavsett om gränsen har ändrats eller inte, returneras det tidigare värdet för gränsen.

source: The `SQLite limit category`_ to be set.
sv: Den `SQLite-gränskategori`_ som ska ställas in.

source: The value of the new limit. If negative, the current limit is unchanged.
sv: Värdet på den nya gränsen. Om värdet är negativt är den aktuella gränsen oförändrad.

source: Example, limit the number of attached databases to 1 for :class:`Connection` ``con`` (the default limit is 10):
sv: Exempel: begränsa antalet anslutna databaser till 1 för :class:`Connection` ``con`` (standardgränsen är 10):

source: Query a boolean connection configuration option.
sv: Fråga efter ett booleskt alternativ för konfiguration av anslutningen.

source: A :ref:`SQLITE_DBCONFIG code <sqlite3-dbconfig-constants>`.
sv: En :ref:`SQLITE_DBCONFIG-kod <sqlite3-dbconfig-constants>`.

source: Set a boolean connection configuration option.
sv: Ange ett booleskt alternativ för konfiguration av anslutningen.

source: ``True`` if the configuration option should be enabled (default); ``False`` if it should be disabled.
sv: ``True`` om konfigurationsalternativet ska vara aktiverat (standard); ``False`` om det ska vara inaktiverat.

source: Serialize a database into a :class:`bytes` object. For an ordinary on-disk database file, the serialization is just a copy of the disk file. For an in-memory database or a "temp" database, the serialization is the same sequence of bytes which would be written to disk if that database were backed up to disk.
sv: Serialisera en databas till ett :class:`bytes`-objekt. För en vanlig databasfil på disken är serialiseringen bara en kopia av diskfilen. För en databas i minnet eller en "temp"-databas är serialiseringen samma sekvens av bytes som skulle skrivas till disken om databasen säkerhetskopierades till disk.

source: The database name to be serialized. Defaults to ``"main"``.
sv: Namnet på den databas som ska serialiseras. Standardvärdet är ``"main"``.

source: This method is only available if the underlying SQLite library has the serialize API.
sv: Denna metod är endast tillgänglig om det underliggande SQLite-biblioteket har API:et serialize.

source: Deserialize a :meth:`serialized <serialize>` database into a :class:`Connection`. This method causes the database connection to disconnect from database *name*, and reopen *name* as an in-memory database based on the serialization contained in *data*.
sv: Deserialiserar en :meth:`serialized <serialize>` databas till en :class:`Connection`. Den här metoden gör att databasanslutningen kopplar från databasen *namn* och öppnar *namn* igen som en databas i minnet baserat på serialiseringen i *data*.

source: A serialized database.
sv: En serialiserad databas.

source: The database name to deserialize into. Defaults to ``"main"``.
sv: Databasnamnet som deserialiseringen ska göras till. Standardvärdet är ``"main"``.

source: If the database connection is currently involved in a read transaction or a backup operation.
sv: Om databasanslutningen för närvarande är involverad i en lästransaktion eller en säkerhetskopiering.

source: If *data* does not contain a valid SQLite database.
sv: Om *data* inte innehåller en giltig SQLite-databas.

source: If :func:`len(data) <len>` is larger than ``2**63 - 1``.
sv: Om :func:`len(data) <len>` är större än ``2**63 - 1``.

source: This method is only available if the underlying SQLite library has the deserialize API.
sv: Denna metod är endast tillgänglig om det underliggande SQLite-biblioteket har API:et deserialize.

source: This attribute controls :pep:`249`-compliant transaction behaviour. :attr:`!autocommit` has three allowed values:
sv: Detta attribut styr transaktionsbeteendet i enlighet med :pep:`249`. :attr:`!autocommit` har tre tillåtna värden:
