Repository: yeager/python-docs-sv
Catalog: library/sqlite3.po
Languages: sv

source: Set *autocommit* to :data:`LEGACY_TRANSACTION_CONTROL` to leave transaction control behaviour to the :attr:`Connection.isolation_level` attribute. See :ref:`sqlite3-transaction-control-isolation-level` for more information.
sv: Sätt *autocommit* till :data:`LEGACY_TRANSACTION_CONTROL` för att överlåta transaktionskontrollbeteendet till attributet :attr:`Connection.isolation_level`. Se :ref:`sqlite3-transaction-control-isolation-level` för mer information.

source: Transaction control via the ``isolation_level`` attribute
sv: Transaktionskontroll via attributet ``isolation_level`` (isoleringsnivå)

source: The recommended way of controlling transactions is via the :attr:`~Connection.autocommit` attribute. See :ref:`sqlite3-transaction-control-autocommit`.
sv: Det rekommenderade sättet att kontrollera transaktioner är via attributet :attr:`~Connection.autocommit`. Se :ref:`sqlite3-transaction-control-autocommit`.

source: If :attr:`Connection.autocommit` is set to :data:`LEGACY_TRANSACTION_CONTROL` (the default), transaction behaviour is controlled using the :attr:`Connection.isolation_level` attribute. Otherwise, :attr:`!isolation_level` has no effect.
sv: Om :attr:`Connection.autocommit` är satt till :data:`LEGACY_TRANSACTION_CONTROL` (standard), styrs transaktionsbeteendet med attributet :attr:`Connection.isolation_level`. I annat fall har :attr:`!isolation_level` ingen effekt.

source: If the connection attribute :attr:`~Connection.isolation_level` is not ``None``, new transactions are implicitly opened before :meth:`~Cursor.execute` and :meth:`~Cursor.executemany` executes ``INSERT``, ``UPDATE``, ``DELETE``, or ``REPLACE`` statements; for other statements, no implicit transaction handling is performed. Use the :meth:`~Connection.commit` and :meth:`~Connection.rollback` methods to respectively commit and roll back pending transactions. You can choose the underlying `SQLite transaction behaviour`_ — that is, whether and what type of ``BEGIN`` statements :mod:`!sqlite3` implicitly executes – via the :attr:`~Connection.isolation_level` attribute.
sv: Om anslutningsattributet :attr:`~Connection.isolation_level` inte är ``None`` öppnas nya transaktioner implicit innan :meth:`~Cursor.execute` och :meth:`~Cursor.executemany` utför ``INSERT``, ``UPDATE``, ``DELETE`` eller ``REPLACE``-satser; för andra satser utförs ingen implicit transaktionshantering. Använd metoderna :meth:`~Connection.commit` och :meth:`~Connection.rollback` för att binda respektive rulla tillbaka pågående transaktioner. Du kan välja det underliggande `SQLite-transaktionsbeteendet`_ - det vill säga om och vilken typ av ``BEGIN``-satser som :mod:`!sqlite3` implicit utför - via attributet :attr:`~Connection.isolation_level`.

source: If :attr:`~Connection.isolation_level` is set to ``None``, no transactions are implicitly opened at all. This leaves the underlying SQLite library in `autocommit mode`_, but also allows the user to perform their own transaction handling using explicit SQL statements. The underlying SQLite library autocommit mode can be queried using the :attr:`~Connection.in_transaction` attribute.
sv: Om :attr:`~Connection.isolation_level` är satt till ``None``, öppnas inga transaktioner alls implicit. Detta lämnar det underliggande SQLite-biblioteket i `autocommit mode`_, men gör det också möjligt för användaren att utföra sin egen transaktionshantering med hjälp av explicita SQL-satser. Det underliggande SQLite-bibliotekets autocommit-läge kan efterfrågas med hjälp av attributet :attr:`~Connection.in_transaction`.

source: The :meth:`~Cursor.executescript` method implicitly commits any pending transaction before execution of the given SQL script, regardless of the value of :attr:`~Connection.isolation_level`.
sv: Metoden :meth:`~Cursor.executescript` binder implicit alla väntande transaktioner innan det angivna SQL-skriptet körs, oavsett värdet på :attr:`~Connection.isolation_level`.

source: :mod:`!sqlite3` used to implicitly commit an open transaction before DDL statements. This is no longer the case.
sv: :mod:`!sqlite3` brukade implicit binda en öppen transaktion före DDL-satser. Detta är inte längre fallet.

source: The recommended way of controlling transactions is now via the :attr:`~Connection.autocommit` attribute.
sv: Det rekommenderade sättet att kontrollera transaktioner är nu via attributet :attr:`~Connection.autocommit`.

source: ? (question mark)
sv: ? (frågetecken)

source: in SQL statements
sv: i SQL-satser

source: : (colon)
sv: : (kolon)
