Repository: yeager/python-docs-sv
Catalog: library/sqlite3.po
Languages: sv

source: Register an *adapter* :term:`callable` to adapt the Python type *type* into an SQLite type. The adapter is called with a Python object of type *type* as its sole argument, and must return a value of a :ref:`type that SQLite natively understands <sqlite3-types>`.
sv: Registrera en *adapter* :term:`callable` för att anpassa Python-typen *type* till en SQLite-typ. Adaptern anropas med ett Python-objekt av typen *type* som enda argument, och måste returnera ett värde av en :ref:`typ som SQLite naturligt förstår <sqlite3-types>`.

source: Register the *converter* :term:`callable` to convert SQLite objects of type *typename* into a Python object of a specific type. The converter is invoked for all SQLite values of type *typename*; it is passed a :class:`bytes` object and should return an object of the desired Python type. Consult the parameter *detect_types* of :func:`connect` for information regarding how type detection works.
sv: Registrera *konverteraren* :term:`callable` för att konvertera SQLite-objekt av typen *typename* till ett Python-objekt av en viss typ. Omvandlaren anropas för alla SQLite-värden av typen *typename*; den får ett :class:`bytes`-objekt och ska returnera ett objekt av önskad Python-typ. Se parametern *detect_types* i :func:`connect` för information om hur typdetektering fungerar.

source: Note: *typename* and the name of the type in your query are matched case-insensitively.
sv: Obs: *typename* och namnet på typen i din fråga matchas case-insensitivt.

source: Module constants
sv: Modul konstanter

source: Set :attr:`~Connection.autocommit` to this constant to select old style (pre-Python 3.12) transaction control behaviour. See :ref:`sqlite3-transaction-control-isolation-level` for more information.
sv: Sätt :attr:`~Connection.autocommit` till denna konstant för att välja gammaldags (före Python 3.12) transaktionskontrollbeteende. Se :ref:`sqlite3-transaction-control-isolation-level` för mer information.

source: Pass this flag value to the *detect_types* parameter of :func:`connect` to look up a converter function using the declared types for each column. The types are declared when the database table is created. :mod:`!sqlite3` will look up a converter function using the first word of the declared type as the converter dictionary key. For example:
sv: Skicka detta flaggvärde till parametern *detect_types* i :func:`connect` för att söka upp en konverteringsfunktion med hjälp av de deklarerade typerna för varje kolumn. Typerna deklareras när databastabellen skapas. :mod:`!sqlite3` söker upp en konverteringsfunktion med det första ordet i den deklarerade typen som nyckel i konverteringsordlistan. Till exempel

source: CREATE TABLE test( i integer primary key, ! will look up a converter named "integer" p point, ! will look up a converter named "point" n number(10) ! will look up a converter named "number" )
sv: CREATE TABLE test( i heltal primärnyckel, ! kommer att leta upp en omvandlare med namnet "heltal" p punkt, ! kommer att leta upp en omvandlare med namnet "punkt" n nummer(10) ! kommer att leta upp en omvandlare som heter "nummer" )

source: This flag may be combined with :const:`PARSE_COLNAMES` using the ``|`` (bitwise or) operator.
sv: Denna flagga kan kombineras med :const:`PARSE_COLNAMES` med hjälp av operatorn ``|`` (bitvis eller).

source: Generated fields (for example ``MAX(p)``) are returned as :class:`str`. Use :const:`!PARSE_COLNAMES` to enforce types for such queries.
sv: Genererade fält (t.ex. ``MAX(p)``) returneras som :class:`str`. Använd :const:`!PARSE_COLNAMES` för att tvinga fram typer för sådana frågor.

source: Pass this flag value to the *detect_types* parameter of :func:`connect` to look up a converter function by using the type name, parsed from the query column name, as the converter dictionary key. The query column name must be wrapped in double quotes (``"``) and the type name must be wrapped in square brackets (``[]``).
sv: Skicka detta flaggvärde till parametern *detect_types* i :func:`connect` för att söka efter en konverteringsfunktion genom att använda typnamnet, som tolkats från frågekolumnens namn, som nyckel i konverteringsordboken. Frågekolumnnamnet måste vara omslutet av dubbla citattecken (``"``) och typnamnet måste vara omslutet av hakparenteser (``[]``).

source: SELECT MAX(p) as "p [point]" FROM test; ! will look up converter "point"
sv: SELECT MAX(p) som "p [punkt]" FROM test; ! kommer att leta upp omvandlare "punkt"

source: This flag may be combined with :const:`PARSE_DECLTYPES` using the ``|`` (bitwise or) operator.
sv: Denna flagga kan kombineras med :const:`PARSE_DECLTYPES` med hjälp av operatorn ``|`` (bitvis eller).

source: Flags that should be returned by the *authorizer_callback* :term:`callable` passed to :meth:`Connection.set_authorizer`, to indicate whether:
sv: Flaggor som ska returneras av *authorizer_callback* :term:`callable` som skickas till :meth:`Connection.set_authorizer`, för att ange om:

source: Access is allowed (:const:`!SQLITE_OK`),
sv: Åtkomst är tillåten (:const:`!SQLITE_OK`),

source: The SQL statement should be aborted with an error (:const:`!SQLITE_DENY`)
sv: SQL-satsen bör avbrytas med ett fel (:const:`!SQLITE_DENY`)

source: The column should be treated as a ``NULL`` value (:const:`!SQLITE_IGNORE`)
sv: Kolumnen ska behandlas som ett ``NULL``-värde (:const:`!SQLITE_IGNORE`)

source: String constant stating the supported DB-API level. Required by the DB-API. Hard-coded to ``"2.0"``.
sv: Strängkonstant som anger den DB-API-nivå som stöds. Krävs av DB-API. Hårdkodad till ``"2.0"``.

source: String constant stating the type of parameter marker formatting expected by the :mod:`!sqlite3` module. Required by the DB-API. Hard-coded to ``"qmark"``.
sv: Strängkonstant som anger vilken typ av parametermarkörsformatering som förväntas av modulen :mod:`!sqlite3`. Krävs av DB-API. Hårdkodad till ``"qmark"``.

source: The ``named`` DB-API parameter style is also supported.
sv: DB-API-parameterstilen ``named`` stöds också.

source: Version number of the runtime SQLite library as a :class:`string <str>`.
sv: Versionsnummer för SQLite-biblioteket för körning som en :class:`string <str>`.

source: Version number of the runtime SQLite library as a :class:`tuple` of :class:`integers <int>`.
sv: Versionsnummer för SQLite-biblioteket under körning som en :class:`tuple` av :class:`integers <int>`.

source: Integer constant required by the DB-API 2.0, stating the level of thread safety the :mod:`!sqlite3` module supports. This attribute is set based on the default `threading mode <https://sqlite.org/threadsafe.html>`_ the underlying SQLite library is compiled with. The SQLite threading modes are:
sv: Heltalskonstant som krävs av DB-API 2.0 och som anger vilken nivå av trådsäkerhet som :mod:`!sqlite3`-modulen stöder. Detta attribut ställs in baserat på standard `threading mode <https://sqlite.org/threadsafe.html>`_ som det underliggande SQLite-biblioteket är kompilerat med. SQLites trådningslägen är:

source: **Single-thread**: In this mode, all mutexes are disabled and SQLite is unsafe to use in more than a single thread at once.
sv: **En enda tråd**: I detta läge är alla mutexar inaktiverade och SQLite är osäkert att använda i mer än en enda tråd samtidigt.

source: **Multi-thread**: In this mode, SQLite can be safely used by multiple threads provided that no single database connection is used simultaneously in two or more threads.
sv: **Multi-tråd**: I det här läget kan SQLite användas säkert av flera trådar, förutsatt att ingen enskild databasanslutning används samtidigt i två eller flera trådar.

source: **Serialized**: In serialized mode, SQLite can be safely used by multiple threads with no restriction.
sv: **Serialiserad**: I serialiserat läge kan SQLite användas av flera trådar utan några begränsningar.

source: The mappings from SQLite threading modes to DB-API 2.0 threadsafety levels are as follows:
sv: Mappningarna från SQLites trådningslägen till DB-API 2.0:s trådningsnivåer är följande:

source: SQLite threading mode
sv: SQLite-läge för trådning

source: DB-API 2.0 meaning
sv: DB-API 2.0 betydelse

source: single-thread
sv: enkel tråd

source: Threads may not share the module
sv: Trådarna får inte dela modul

source: multi-thread
sv: flertrådig

source: Threads may share the module, but not connections
sv: Trådar kan dela modul, men inte anslutningar

source: serialized
sv: serialiserad

source: Threads may share the module, connections and cursors
sv: Trådar kan dela modul, anslutningar och markörer

source: Set *threadsafety* dynamically instead of hard-coding it to ``1``.
sv: Ställ in *threadsafety* dynamiskt istället för att hårdkoda det till ``1``.

source: These constants are used for the :meth:`Connection.setconfig` and :meth:`~Connection.getconfig` methods.
sv: Dessa konstanter används för metoderna :meth:`Connection.setconfig` och :meth:`~Connection.getconfig`.

source: The availability of these constants varies depending on the version of SQLite Python was compiled with.
sv: Tillgängligheten för dessa konstanter varierar beroende på vilken version av SQLite Python kompilerades med.

source: SQLite docs: Database Connection Configuration Options
sv: Dokument om SQLite: Alternativ för konfiguration av databasanslutning

source: The :data:`!version` and :data:`!version_info` constants.
sv: Konstanterna :data:`!version` och :data:`!version_info`.

source: Connection objects
sv: Anslutningsobjekt

source: Each open SQLite database is represented by a ``Connection`` object, which is created using :func:`sqlite3.connect`. Their main purpose is creating :class:`Cursor` objects, and :ref:`sqlite3-controlling-transactions`.
sv: Varje öppen SQLite-databas representeras av ett ``Connection``-objekt, som skapas med :func:`sqlite3.connect`. Deras huvudsakliga syfte är att skapa :class:`Cursor`-objekt och :ref:`sqlite3-controlling-transactions`.

source: :ref:`sqlite3-connection-shortcuts`
sv: :ref:`sqlite3-anslutning-kortkommandon`

source: A :exc:`ResourceWarning` is emitted if :meth:`close` is not called before a :class:`!Connection` object is deleted.
sv: En :exc:`ResourceWarning` skickas ut om :meth:`close` inte anropas innan ett :class:`!Connection`-objekt tas bort.

source: An SQLite database connection has the following attributes and methods:
sv: En SQLite-databasanslutning har följande attribut och metoder:

source: Create and return a :class:`Cursor` object. The cursor method accepts a single optional parameter *factory*. If supplied, this must be a :term:`callable` returning an instance of :class:`Cursor` or its subclasses.
sv: Skapa och returnera ett :class:`Cursor`-objekt. Metoden cursor accepterar en enda valfri parameter *factory*. Om den anges måste den vara en :term:`callable` som returnerar en instans av :class:`Cursor` eller dess subklasser.

source: Open a :class:`Blob` handle to an existing :abbr:`BLOB (Binary Large OBject)`.
sv: Öppna ett :class:`Blob`-handtag till en befintlig :abbr:`BLOB (Binary Large OBject)`.

source: The name of the table where the blob is located.
sv: Namnet på den tabell där blobben finns.

source: The name of the column where the blob is located.
sv: Namnet på den kolumn där blobben är placerad.

source: The name of the row where the blob is located.
sv: Namnet på den rad där blobben finns.

source: Set to ``True`` if the blob should be opened without write permissions. Defaults to ``False``.
sv: Sätts till ``True`` om blobben ska öppnas utan skrivbehörighet. Standardvärdet är ``False``.

source: The name of the database where the blob is located. Defaults to ``"main"``.
sv: Namnet på den databas där blobben finns. Standardvärdet är ``"main"``.

source: Raises
sv: Höjer

source: When trying to open a blob in a ``WITHOUT ROWID`` table.
sv: När man försöker öppna en blob i en tabell "UTAN ROWID".

source: The blob size cannot be changed using the :class:`Blob` class. Use the SQL function ``zeroblob`` to create a blob with a fixed size.
sv: Blobbstorleken kan inte ändras med hjälp av klassen :class:`Blob`. Använd SQL-funktionen ``zeroblob`` för att skapa en blob med en fast storlek.

source: Commit any pending transaction to the database. If :attr:`autocommit` is ``True``, or there is no open transaction, this method does nothing. If :attr:`!autocommit` is ``False``, a new transaction is implicitly opened if a pending transaction was committed by this method.
sv: Överför alla pågående transaktioner till databasen. Om :attr:`autocommit` är ``True``, eller om det inte finns någon öppen transaktion, gör denna metod ingenting. Om :attr:`!autocommit` är ``False``, öppnas en ny transaktion implicit om en pågående transaktion bekräftades med denna metod.

source: Roll back to the start of any pending transaction. If :attr:`autocommit` is ``True``, or there is no open transaction, this method does nothing. If :attr:`!autocommit` is ``False``, a new transaction is implicitly opened if a pending transaction was rolled back by this method.
sv: Rullar tillbaka till början av en väntande transaktion. Om :attr:`autocommit` är ``True``, eller om det inte finns någon öppen transaktion, gör denna metod ingenting. Om :attr:`!autocommit` är ``False``, öppnas en ny transaktion implicit om en pågående transaktion rullades tillbaka med denna metod.

source: Close the database connection. If :attr:`autocommit` is ``False``, any pending transaction is implicitly rolled back. If :attr:`!autocommit` is ``True`` or :data:`LEGACY_TRANSACTION_CONTROL`, no implicit transaction control is executed. Make sure to :meth:`commit` before closing to avoid losing pending changes.
sv: Stänger databasanslutningen. Om :attr:`autocommit` är ``False``, kommer alla väntande transaktioner att implicit rullas tillbaka. Om :attr:`!autocommit` är ``True`` eller :data:`LEGACY_TRANSACTION_CONTROL`, utförs ingen implicit transaktionskontroll. Var noga med att :meth:`commit` innan du stänger för att undvika att förlora väntande ändringar.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.execute` on it with the given *sql* and *parameters*. Return the new cursor object.
sv: Skapa ett nytt :class:`Cursor`-objekt och anropa :meth:`~Cursor.execute` på det med de angivna *sql* och *parametrarna*. Returnera det nya cursor-objektet.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executemany` on it with the given *sql* and *parameters*. Return the new cursor object.
sv: Skapa ett nytt :class:`Cursor`-objekt och anropa :meth:`~Cursor.executemany` på det med de angivna *sql* och *parametrarna*. Returnera det nya cursor-objektet.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executescript` on it with the given *sql_script*. Return the new cursor object.
sv: Skapa ett nytt :class:`Cursor`-objekt och anropa :meth:`~Cursor.executescript` på det med det angivna *sql_script*. Returnera det nya cursor-objektet.

source: Create or remove a user-defined SQL function.
sv: Skapa eller ta bort en användardefinierad SQL-funktion.

source: The name of the SQL function.
sv: Namnet på SQL-funktionen.

source: The number of arguments the SQL function can accept. If ``-1``, it may take any number of arguments.
sv: Antalet argument som SQL-funktionen kan acceptera. Om ``-1``, kan den ta emot valfritt antal argument.

source: A :term:`callable` that is called when the SQL function is invoked. The callable must return :ref:`a type natively supported by SQLite <sqlite3-types>`. Set to ``None`` to remove an existing SQL function.
sv: En :term:`callable` som anropas när SQL-funktionen anropas. Den anropbara funktionen måste returnera :ref:``en typ som stöds av SQLite <sqlite3-types>`. Ställ in till ``None`` för att ta bort en befintlig SQL-funktion.

source: If ``True``, the created SQL function is marked as `deterministic <https://sqlite.org/deterministic.html>`_, which allows SQLite to perform additional optimizations.
sv: Om ``True``, markeras den skapade SQL-funktionen som `deterministisk <https://sqlite.org/deterministic.html>`_, vilket gör att SQLite kan utföra ytterligare optimeringar.

source: Added the *deterministic* parameter.
sv: Parametern *deterministic* har lagts till.

source: Example:
sv: Exempel:

source: Passing *name*, *narg*, and *func* as keyword arguments is deprecated. These parameters will become positional-only in Python 3.15.
sv: Att skicka *name*, *narg* och *func* som nyckelordsargument är föråldrat. Dessa parametrar blir endast positionella i Python 3.15.

source: Create or remove a user-defined SQL aggregate function.
sv: Skapa eller ta bort en användardefinierad SQL-aggregatfunktion.

source: The name of the SQL aggregate function.
sv: Namnet på SQL-aggregatfunktionen.

source: The number of arguments the SQL aggregate function can accept. If ``-1``, it may take any number of arguments.
sv: Det antal argument som SQL-aggregatfunktionen kan acceptera. Om ``-1``, kan den ta emot valfritt antal argument.

source: A class must implement the following methods: * ``step()``: Add a row to the aggregate. * ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`. The number of arguments that the ``step()`` method must accept is controlled by *n_arg*. Set to ``None`` to remove an existing SQL aggregate function.
sv: En klass måste implementera följande metoder: * ``step()``: Lägger till en rad i aggregatet. * ``finalize()``: Returnerar aggregatets slutresultat som :ref:``en typ som stöds av SQLite <sqlite3-types>``. Antalet argument som metoden ``step()`` måste acceptera styrs av *n_arg*. Ställ in till ``None`` för att ta bort en befintlig SQL-aggregatfunktion.

source: A class must implement the following methods:
sv: En klass måste implementera följande metoder:

source: ``step()``: Add a row to the aggregate.
sv: ``step()``: Lägg till en rad i aggregatet.

source: ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`.
sv: ``finalize()``: Returnerar det slutliga resultatet av sammanställningen som :ref:``en typ som stöds av SQLite <sqlite3-types>`.

source: The number of arguments that the ``step()`` method must accept is controlled by *n_arg*.
sv: Antalet argument som metoden ``step()`` måste acceptera styrs av *n_arg*.

source: Set to ``None`` to remove an existing SQL aggregate function.
sv: Sätt till ``None`` för att ta bort en befintlig SQL-aggregatfunktion.

source: class MySum: def __init__(self): self.count = 0 def step(self, value): self.count += value def finalize(self): return self.count con = sqlite3.connect(":memory:") con.create_aggregate("mysum", 1, MySum) cur = con.execute("CREATE TABLE test(i)") cur.execute("INSERT INTO test(i) VALUES(1)") cur.execute("INSERT INTO test(i) VALUES(2)") cur.execute("SELECT mysum(i) FROM test") print(cur.fetchone()[0]) con.close()
sv: klass MySum: def __init__(self): self.count = 0 def step(self, värde): self.count += värde def finalize(self): return self.count con = sqlite3.connect(":minne:") con.create_aggregate("mysum", 1, MySum) cur = con.execute("CREATE TABLE test(i)") cur.execute("INSERT INTO test(i) VALUES(1)") cur.execute("INSERT INTO test(i) VALUES(2)") cur.execute("VÄLJ mysum(i) FRÅN test") print(cur.fetchone()[0]) con.close()

source: Passing *name*, *n_arg*, and *aggregate_class* as keyword arguments is deprecated. These parameters will become positional-only in Python 3.15.
sv: Att skicka *name*, *n_arg* och *aggregate_class* som nyckelordsargument är föråldrat. Dessa parametrar blir endast positionella i Python 3.15.

source: Create or remove a user-defined aggregate window function.
sv: Skapa eller ta bort en användardefinierad aggregatfönsterfunktion.

source: The name of the SQL aggregate window function to create or remove.
sv: Namnet på den SQL-aggregatfönsterfunktion som ska skapas eller tas bort.

source: The number of arguments the SQL aggregate window function can accept. If ``-1``, it may take any number of arguments.
sv: Antalet argument som funktionen SQL aggregate window kan acceptera. Om ``-1``, kan den ta emot valfritt antal argument.

source: A class that must implement the following methods: * ``step()``: Add a row to the current window. * ``value()``: Return the current value of the aggregate. * ``inverse()``: Remove a row from the current window. * ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`. The number of arguments that the ``step()`` and ``value()`` methods must accept is controlled by *num_params*. Set to ``None`` to remove an existing SQL aggregate window function.
sv: En klass som måste implementera följande metoder: * ``step()``: Lägg till en rad i det aktuella fönstret. * ``value()``: Returnerar det aktuella värdet för aggregatet. * ``inverse()``: Tar bort en rad från det aktuella fönstret. * ``finalize()``: Returnerar slutresultatet av aggregatet som :ref:``en typ som stöds av SQLite <sqlite3-types>`. Antalet argument som metoderna ``step()`` och ``value()`` måste acceptera styrs av *num_params*. Sätts till ``None`` för att ta bort en befintlig SQL aggregate window-funktion.

source: A class that must implement the following methods:
sv: En klass som måste implementera följande metoder:

source: ``step()``: Add a row to the current window.
sv: ``step()``: Lägg till en rad i det aktuella fönstret.

source: ``value()``: Return the current value of the aggregate.
sv: ``värde()``: Returnerar det aktuella värdet för aggregatet.

source: ``inverse()``: Remove a row from the current window.
sv: ``inverse()``: Ta bort en rad från det aktuella fönstret.

source: The number of arguments that the ``step()`` and ``value()`` methods must accept is controlled by *num_params*.
sv: Antalet argument som metoderna ``step()`` och ``value()`` måste acceptera styrs av *num_params*.

source: Set to ``None`` to remove an existing SQL aggregate window function.
sv: Sätt till ``None`` för att ta bort en befintlig SQL aggregatfönsterfunktion.

source: If used with a version of SQLite older than 3.25.0, which does not support aggregate window functions.
sv: Om den används med en version av SQLite som är äldre än 3.25.0, som inte har stöd för aggregate window-funktioner.
