Repository: yeager/python-docs-sv
Catalog: library/sqlite3.po
Languages: sv

source: class Point: def __init__(self, x, y): self.x, self.y = x, y def __repr__(self): return f"Point({self.x}, {self.y})" def adapt_point(point): return f"{point.x};{point.y}" def convert_point(s): x, y = list(map(float, s.split(b";"))) return Point(x, y) # Register the adapter and converter sqlite3.register_adapter(Point, adapt_point) sqlite3.register_converter("point", convert_point) # 1) Parse using declared types p = Point(4.0, -3.2) con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_DECLTYPES) cur = con.execute("CREATE TABLE test(p point)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute("SELECT p FROM test") print("with declared types:", cur.fetchone()[0]) cur.close() con.close() # 2) Parse using column names con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_COLNAMES) cur = con.execute("CREATE TABLE test(p)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute('SELECT p AS "p [point]" FROM test') print("with column names:", cur.fetchone()[0]) cur.close() con.close()
sv: klass Punkt: def __init__(self, x, y): self.x, self.y = x, y def __repr__(self): return f"Punkt({self.x}, {self.y})" def adapt_point(point): return f"{point.x};{point.y}" def convert_point(s): x, y = list(map(float, s.split(b";")))) return Punkt(x, y) # Registrera adapter och omvandlare sqlite3.register_adapter(Punkt, adapt_point) sqlite3.register_converter("point", convert_point) # 1) Parsa med hjälp av deklarerade typer p = Punkt(4,0, -3,2) con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_DECLTYPES) cur = con.execute("CREATE TABLE test(p punkt)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute("VÄLJ p FRÅN test") print("med deklarerade typer:", cur.fetchone()[0]) cur.close() con.close() # 2) Parsa med hjälp av kolumnnamn con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_COLNAMES) cur = con.execute("CREATE TABLE test(p)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute('SELECT p AS "p [punkt]" FROM test') print("med kolumnnamn:", cur.fetchone()[0]) cur.close() con.close()

source: Adapter and converter recipes
sv: Adapter- och konverterrecept

source: This section shows recipes for common adapters and converters.
sv: I detta avsnitt visas recept för vanliga adaptrar och konvertrar.

source: import datetime import sqlite3 def adapt_date_iso(val): """Adapt datetime.date to ISO 8601 date.""" return val.isoformat() def adapt_datetime_iso(val): """Adapt datetime.datetime to timezone-naive ISO 8601 date.""" return val.replace(tzinfo=None).isoformat() def adapt_datetime_epoch(val): """Adapt datetime.datetime to Unix timestamp.""" return int(val.timestamp()) sqlite3.register_adapter(datetime.date, adapt_date_iso) sqlite3.register_adapter(datetime.datetime, adapt_datetime_iso) sqlite3.register_adapter(datetime.datetime, adapt_datetime_epoch) def convert_date(val): """Convert ISO 8601 date to datetime.date object.""" return datetime.date.fromisoformat(val.decode()) def convert_datetime(val): """Convert ISO 8601 datetime to datetime.datetime object.""" return datetime.datetime.fromisoformat(val.decode()) def convert_timestamp(val): """Convert Unix epoch timestamp to datetime.datetime object.""" return datetime.datetime.fromtimestamp(int(val)) sqlite3.register_converter("date", convert_date) sqlite3.register_converter("datetime", convert_datetime) sqlite3.register_converter("timestamp", convert_timestamp)
sv: import datetime import sqlite3 def adapt_date_iso(val): """Anpassa datetime.date till ISO 8601-datum.""" return val.isoformat() def adapt_datetime_iso(val): """Anpassa datetime.datetime till tidszon-naivt ISO 8601-datum.""" return val.replace(tzinfo=None).isoformat() def adapt_datetime_epoch(val): """Anpassa datetime.datetime till Unix-tidsstämpel.""" return int(val.timestamp()) sqlite3.register_adapter(datetime.date, adapt_date_iso) sqlite3.register_adapter(datetime.datetime, adapt_datetime_iso) sqlite3.register_adapter(datetime.datetime, adapt_datetime_epoch) def convert_date(val): """Konvertera ISO 8601-datum till datetime.date-objekt.""" return datetime.date.fromisoformat(val.decode()) def convert_datetime(val): """Konvertera ISO 8601 datetime till datetime.datetime-objekt.""" return datetime.datetime.fromisoformat(val.decode()) def convert_timestamp(val): """Konvertera Unix epoch-tidsstämpel till datetime.datetime-objekt.""" return datetime.datetime.fromtimestamp(int(val)) sqlite3.register_converter("date", convert_date) sqlite3.register_converter("datetime", convert_datetime) sqlite3.register_converter("timestamp", konvertera_timestamp)

source: How to use connection shortcut methods
sv: Så här använder du genvägsmetoder för anslutning

source: Using the :meth:`~Connection.execute`, :meth:`~Connection.executemany`, and :meth:`~Connection.executescript` methods of the :class:`Connection` class, your code can be written more concisely because you don't have to create the (often superfluous) :class:`Cursor` objects explicitly. Instead, the :class:`Cursor` objects are created implicitly and these shortcut methods return the cursor objects. This way, you can execute a ``SELECT`` statement and iterate over it directly using only a single call on the :class:`Connection` object.
sv: Med hjälp av metoderna :meth:`~Connection.execute`, :meth:`~Connection.executemany` och :meth:`~Connection.executescript` i klassen :class:`Connection` kan din kod skrivas mer koncist eftersom du inte behöver skapa de (ofta överflödiga) :class:`Cursor`-objekten explicit. Istället skapas :class:`Cursor`-objekten implicit och dessa genvägsmetoder returnerar cursor-objekten. På så sätt kan du köra en ``SELECT``-sats och iterera över den direkt med bara ett enda anrop på :class:`Connection`-objektet.

source: # Create and fill the table. con = sqlite3.connect(":memory:") con.execute("CREATE TABLE lang(name, first_appeared)") data = [ ("C++", 1985), ("Objective-C", 1984), ] con.executemany("INSERT INTO lang(name, first_appeared) VALUES(?, ?)", data) # Print the table contents for row in con.execute("SELECT name, first_appeared FROM lang"): print(row) print("I just deleted", con.execute("DELETE FROM lang").rowcount, "rows") # close() is not a shortcut method and it's not called automatically; # the connection object should be closed manually con.close()
sv: # Skapa och fyll i tabellen. con = sqlite3.connect(":minne:") con.execute("CREATE TABLE lang(name, first_appeared)") data = [ ("C++", 1985), ("Objective-C", 1984), ] con.executemany("INSERT INTO lang(name, first_appeared) VALUES(?, ?)", data) # Skriv ut tabellinnehållet for row in con.execute("SELECT name, first_appeared FROM lang"): print(rad) print("Jag raderade just", con.execute("DELETE FROM lang").rowcount, "rows") # close() är inte en genvägsmetod och den anropas inte automatiskt; # anslutningsobjektet bör stängas manuellt con.close()

source: How to use the connection context manager
sv: Så här använder du kontexthanteraren för anslutningar

source: A :class:`Connection` object can be used as a context manager that automatically commits or rolls back open transactions when leaving the body of the context manager. If the body of the :keyword:`with` statement finishes without exceptions, the transaction is committed. If this commit fails, or if the body of the ``with`` statement raises an uncaught exception, the transaction is rolled back. If :attr:`~Connection.autocommit` is ``False``, a new transaction is implicitly opened after committing or rolling back.
sv: Ett :class:`Connection`-objekt kan användas som en kontexthanterare som automatiskt commitar eller rullar tillbaka öppna transaktioner när kontexthanterarens kropp lämnas. Om :keyword:`with`-satsens kropp avslutas utan undantag görs en commit av transaktionen. Om denna commit misslyckas, eller om ``with``-satsen ger upphov till ett undantag som inte fångats upp, rullas transaktionen tillbaka. Om :attr:`~Connection.autocommit` är ``False``, öppnas en ny transaktion implicit efter commit eller rollback.

source: If there is no open transaction upon leaving the body of the ``with`` statement, or if :attr:`~Connection.autocommit` is ``True``, the context manager does nothing.
sv: Om det inte finns någon öppen transaktion när man lämnar ``with``-satsen, eller om :attr:`~Connection.autocommit` är ``True``, gör kontexthanteraren ingenting.

source: The context manager neither implicitly opens a new transaction nor closes the connection. If you need a closing context manager, consider using :meth:`contextlib.closing`.
sv: Kontexthanteraren varken öppnar implicit en ny transaktion eller stänger anslutningen. Om du behöver en stängande kontexthanterare, överväg att använda :meth:`contextlib.closing`.

source: con = sqlite3.connect(":memory:") con.execute("CREATE TABLE lang(id INTEGER PRIMARY KEY, name VARCHAR UNIQUE)") # Successful, con.commit() is called automatically afterwards with con: con.execute("INSERT INTO lang(name) VALUES(?)", ("Python",)) # con.rollback() is called after the with block finishes with an exception, # the exception is still raised and must be caught try: with con: con.execute("INSERT INTO lang(name) VALUES(?)", ("Python",)) except sqlite3.IntegrityError: print("couldn't add Python twice") # Connection object used as context manager only commits or rollbacks transactions, # so the connection object should be closed manually con.close()
sv: con = sqlite3.connect(":minne:") con.execute("CREATE TABLE lang(id INTEGER PRIMARY KEY, name VARCHAR UNIQUE)") # Lyckas, con.commit() anropas automatiskt efteråt med con: con.execute("INSERT INTO lang(name) VALUES(?)", ("Python",)) # con.rollback() anropas efter att with-blocket avslutats med ett undantag, # undantaget tas fortfarande upp och måste fångas upp försök: med con: con.execute("INSERT INTO lang(namn) VALUES(?)", ("Python",)) except sqlite3.IntegrityError: print("kunde inte lägga till Python två gånger") # Anslutningsobjektet som används som kontexthanterare överför eller återställer endast transaktioner, # så anslutningsobjektet bör stängas manuellt con.close()

source: How to work with SQLite URIs
sv: Så här arbetar du med SQLite URI:er

source: Some useful URI tricks include:
sv: Några användbara URI-trick inkluderar:

source: Open a database in read-only mode:
sv: Öppna en databas i skrivskyddat läge:

source: >>> con = sqlite3.connect("file:tutorial.db?mode=ro", uri=True) >>> con.execute("CREATE TABLE readonly(data)") Traceback (most recent call last): OperationalError: attempt to write a readonly database >>> con.close()
sv: >>> con = sqlite3.connect("file:tutorial.db?mode=ro", uri=True) >>> con.execute("CREATE TABLE readonly(data)") Återkoppling (senaste anropet senast): OperationalError: försök att skriva en skrivskyddad databas >>> con.close()

source: Do not implicitly create a new database file if it does not already exist; will raise :exc:`~sqlite3.OperationalError` if unable to create a new file:
sv: Skapa inte implicit en ny databasfil om den inte redan finns; kommer att ge upphov till :exc:`~sqlite3.OperationalError` om det inte går att skapa en ny fil:

source: >>> con = sqlite3.connect("file:nosuchdb.db?mode=rw", uri=True) Traceback (most recent call last): OperationalError: unable to open database file
sv: >>> con = sqlite3.connect("file:nosuchdb.db?mode=rw", uri=True) Återkoppling (senaste anropet senast): OperationalError: det går inte att öppna databasfilen

source: Create a shared named in-memory database:
sv: Skapa en delad namngiven databas i minnet:

source: db = "file:mem1?mode=memory&cache=shared" con1 = sqlite3.connect(db, uri=True) con2 = sqlite3.connect(db, uri=True) with con1: con1.execute("CREATE TABLE shared(data)") con1.execute("INSERT INTO shared VALUES(28)") res = con2.execute("SELECT data FROM shared") assert res.fetchone() == (28,) con1.close() con2.close()
sv: db = "file:mem1?mode=memory&cache=shared" con1 = sqlite3.connect(db, uri=True) con2 = sqlite3.connect(db, uri=True) med con1: con1.execute("CREATE TABLE shared(data)") con1.execute("INSERT INTO delad VALUES(28)") res = con2.execute("VÄLJ data FRÅN delad") assert res.fetchone() == (28,) con1.stäng() con2.close()

source: More information about this feature, including a list of parameters, can be found in the `SQLite URI documentation`_.
sv: Mer information om den här funktionen, inklusive en lista med parametrar, finns i `SQLite URI-dokumentation`_.

source: How to create and use row factories
sv: Så här skapar och använder du radfabriker

source: By default, :mod:`!sqlite3` represents each row as a :class:`tuple`. If a :class:`!tuple` does not suit your needs, you can use the :class:`sqlite3.Row` class or a custom :attr:`~Cursor.row_factory`.
sv: Som standard representerar :mod:`!sqlite3` varje rad som en :class:`tuple`. Om en :class:`!tuple` inte passar dina behov kan du använda :class:`sqlite3.Row`-klassen eller en anpassad :attr:`~Cursor.row_factory`.

source: While :attr:`!row_factory` exists as an attribute both on the :class:`Cursor` and the :class:`Connection`, it is recommended to set :class:`Connection.row_factory`, so all cursors created from the connection will use the same row factory.
sv: Även om :attr:`!row_factory` finns som attribut både för :class:`Cursor` och :class:`Connection`, rekommenderas att man anger :class:`Connection.row_factory`, så att alla markörer som skapas från anslutningen använder samma radfabrik.

source: :class:`!Row` provides indexed and case-insensitive named access to columns, with minimal memory overhead and performance impact over a :class:`!tuple`. To use :class:`!Row` as a row factory, assign it to the :attr:`!row_factory` attribute:
sv: :class:`!Row` ger indexerad och skiftlägesokänslig namngiven åtkomst till kolumner, med minimal minnesbelastning och prestandapåverkan jämfört med en :class:`!tuple`. För att använda :class:`!Row` som en radfabrik, tilldela den till attributet :attr:`!row_factory`:

source: >>> con = sqlite3.connect(":memory:") >>> con.row_factory = sqlite3.Row
sv: >>> con = sqlite3.connect(":minne:") >>> con.row_factory = sqlite3.row

source: Queries now return :class:`!Row` objects:
sv: Frågor returnerar nu :class:`!Row`-objekt:

source: >>> res = con.execute("SELECT 'Earth' AS name, 6378 AS radius") >>> row = res.fetchone() >>> row.keys() ['name', 'radius'] >>> row[0] # Access by index. 'Earth' >>> row["name"] # Access by name. 'Earth' >>> row["RADIUS"] # Column names are case-insensitive. 6378 >>> con.close()
sv: >>> res = con.execute("SELECT 'Earth' AS name, 6378 AS radius") >>> rad = res.fetchone() >>> rad.nycklar() ['namn', 'radie'] >>> rad[0] # Åtkomst via index. 'Jord' >>> row["name"] # Åtkomst efter namn. 'Earth' >>> row["RADIUS"] # Kolumnnamnen är skiftlägesokänsliga. 6378 >>> con.close()

source: The ``FROM`` clause can be omitted in the ``SELECT`` statement, as in the above example. In such cases, SQLite returns a single row with columns defined by expressions, e.g. literals, with the given aliases ``expr AS alias``.
sv: Klausulen ``FROM`` kan utelämnas i ``SELECT``-satsen, som i exemplet ovan. I sådana fall returnerar SQLite en enda rad med kolumner som definieras av uttryck, t.ex. literaler, med de angivna alias ``expr AS alias``.

source: You can create a custom :attr:`~Cursor.row_factory` that returns each row as a :class:`dict`, with column names mapped to values:
sv: Du kan skapa en egen :attr:`~Cursor.row_factory` som returnerar varje rad som en :class:`dict`, med kolumnnamn mappade till värden:

source: def dict_factory(cursor, row): fields = [column[0] for column in cursor.description] return {key: value for key, value in zip(fields, row)}
sv: def dict_factory(markör, rad): fields = [kolumn[0] för kolumn i cursor.description] return {nyckel: värde för nyckel, värde i zip(fält, rad)}

source: Using it, queries now return a :class:`!dict` instead of a :class:`!tuple`:
sv: Med hjälp av den returnerar frågor nu en :class:`!dict` i stället för en :class:`!tuple`:

source: >>> con = sqlite3.connect(":memory:") >>> con.row_factory = dict_factory >>> for row in con.execute("SELECT 1 AS a, 2 AS b"): ... print(row) {'a': 1, 'b': 2} >>> con.close()
sv: >>> con = sqlite3.connect(":minne:") >>> con.row_factory = dict_factory >>> för rad i con.execute("SELECT 1 AS a, 2 AS b"): ... print(rad) {'a': 1, 'b': 2} >>> con.close()

source: The following row factory returns a :term:`named tuple`:
sv: Följande radfabrik returnerar en :term:`named tuple`:

source: from collections import namedtuple def namedtuple_factory(cursor, row): fields = [column[0] for column in cursor.description] cls = namedtuple("Row", fields) return cls._make(row)
sv: from collections import namedtuple def namedtuple_factory(markör, rad): fields = [column[0] for column in cursor.description] (kolumn[0] för kolumn i cursor.description) cls = namedtuple("Rad", fält) return cls._make(rad)

source: :func:`!namedtuple_factory` can be used as follows:
sv: :func:`!namedtuple_factory` kan användas på följande sätt:

source: >>> con = sqlite3.connect(":memory:") >>> con.row_factory = namedtuple_factory >>> cur = con.execute("SELECT 1 AS a, 2 AS b") >>> row = cur.fetchone() >>> row Row(a=1, b=2) >>> row[0] # Indexed access. 1 >>> row.b # Attribute access. 2 >>> con.close()
sv: >>> con = sqlite3.connect(":minne:") >>> con.row_factory = namedtuple_factory >>> cur = con.execute("SELECT 1 AS a, 2 AS b") >>> rad = cur.fetchone() >>> rad Rad(a=1, b=2) >>> rad[0] # Indexerad åtkomst. 1 >>> row.b # Attributåtkomst. 2 >>> con.close()

source: With some adjustments, the above recipe can be adapted to use a :class:`~dataclasses.dataclass`, or any other custom class, instead of a :class:`~collections.namedtuple`.
sv: Med några justeringar kan ovanstående recept anpassas så att man använder en :class:`~dataclasses.dataclass`, eller någon annan anpassad klass, i stället för en :class:`~collections.namedtuple`.

source: How to handle non-UTF-8 text encodings
sv: Hur man hanterar textkodningar som inte är UTF-8

source: By default, :mod:`!sqlite3` uses :class:`str` to adapt SQLite values with the ``TEXT`` data type. This works well for UTF-8 encoded text, but it might fail for other encodings and invalid UTF-8. You can use a custom :attr:`~Connection.text_factory` to handle such cases.
sv: Som standard använder :mod:`!sqlite3` :class:`str` för att anpassa SQLite-värden med datatypen ``TEXT``. Detta fungerar bra för UTF-8-kodad text, men det kan misslyckas för andra kodningar och ogiltig UTF-8. Du kan använda en anpassad :attr:`~Connection.text_factory` för att hantera sådana fall.

source: Because of SQLite's `flexible typing`_, it is not uncommon to encounter table columns with the ``TEXT`` data type containing non-UTF-8 encodings, or even arbitrary data. To demonstrate, let's assume we have a database with ISO-8859-2 (Latin-2) encoded text, for example a table of Czech-English dictionary entries. Assuming we now have a :class:`Connection` instance :py:data:`!con` connected to this database, we can decode the Latin-2 encoded text using this :attr:`~Connection.text_factory`:
sv: På grund av SQLites `flexibla typning`_ är det inte ovanligt att tabellkolumner med datatypen ``TEXT`` innehåller icke-UTF-8-kodningar eller till och med godtyckliga data. För att demonstrera, låt oss anta att vi har en databas med ISO-8859-2 (Latin-2) kodad text, till exempel en tabell med tjeckisk-engelska ordboksinlägg. Om vi antar att vi nu har en :class:`Connection`-instans :py:data:`!con` ansluten till denna databas, kan vi avkoda den Latin-2-kodade texten med hjälp av denna :attr:`~Connection.text_factory`:

source: con.text_factory = lambda data: str(data, encoding="latin2")
sv: con.text_factory = lambda data: str(data, kodning="latin2")

source: For invalid UTF-8 or arbitrary data in stored in ``TEXT`` table columns, you can use the following technique, borrowed from the :ref:`unicode-howto`:
sv: För ogiltiga UTF-8 eller godtyckliga data som lagras i tabellkolumnerna ``TEXT`` kan du använda följande teknik, lånad från :ref:`unicode-howto``:

source: con.text_factory = lambda data: str(data, errors="surrogateescape")
sv: con.text_factory = lambda data: str(data, fel="surrogateescape")

source: The :mod:`!sqlite3` module API does not support strings containing surrogates.
sv: Modulen :mod:`!sqlite3` har inte stöd för strängar som innehåller surrogat.

source: Explanation
sv: Förklaring

source: Transaction control
sv: Kontroll av transaktioner

source: :mod:`!sqlite3` offers multiple methods of controlling whether, when and how database transactions are opened and closed. :ref:`sqlite3-transaction-control-autocommit` is recommended, while :ref:`sqlite3-transaction-control-isolation-level` retains the pre-Python 3.12 behaviour.
sv: :mod:`!sqlite3` erbjuder flera metoder för att kontrollera om, när och hur databastransaktioner öppnas och stängs. :ref:`sqlite3-transaction-control-autocommit` rekommenderas, medan :ref:`sqlite3-transaction-control-isolation-level` behåller beteendet från före Python 3.12.

source: Transaction control via the ``autocommit`` attribute
sv: Transaktionsstyrning via attributet ``autocommit``

source: The recommended way of controlling transaction behaviour is through the :attr:`Connection.autocommit` attribute, which should preferably be set using the *autocommit* parameter of :func:`connect`.
sv: Det rekommenderade sättet att styra transaktionsbeteendet är genom attributet :attr:`Connection.autocommit`, som helst bör ställas in med hjälp av parametern *autocommit* i :func:`connect`.

source: It is suggested to set *autocommit* to ``False``, which implies :pep:`249`-compliant transaction control. This means:
sv: Det är rekommenderat att sätta *autocommit* till ``False``, vilket innebär :pep:`249`-kompatibel transaktionskontroll. Detta innebär att:

source: :mod:`!sqlite3` ensures that a transaction is always open, so :func:`connect`, :meth:`Connection.commit`, and :meth:`Connection.rollback` will implicitly open a new transaction (immediately after closing the pending one, for the latter two). :mod:`!sqlite3` uses ``BEGIN DEFERRED`` statements when opening transactions.
sv: :mod:`!sqlite3` säkerställer att en transaktion alltid är öppen, så :func:`connect`, :meth:`Connection.commit` och :meth:`Connection.rollback` kommer implicit att öppna en ny transaktion (omedelbart efter att den väntande har stängts, för de två senare). :mod:`!sqlite3` använder ``BEGIN DEFERRED``-satser när transaktioner öppnas.

source: Transactions should be committed explicitly using :meth:`!commit`.
sv: Transaktioner bör bekräftas uttryckligen med :meth:`!commit`.

source: Transactions should be rolled back explicitly using :meth:`!rollback`.
sv: Transaktioner bör rullas tillbaka uttryckligen med :meth:`!rollback`.

source: An implicit rollback is performed if the database is :meth:`~Connection.close`-ed with pending changes.
sv: En implicit rollback utförs om databasen :meth:`~Connection.close`-ed med pågående ändringar.

source: Set *autocommit* to ``True`` to enable SQLite's `autocommit mode`_. In this mode, :meth:`Connection.commit` and :meth:`Connection.rollback` have no effect. Note that SQLite's autocommit mode is distinct from the :pep:`249`-compliant :attr:`Connection.autocommit` attribute; use :attr:`Connection.in_transaction` to query the low-level SQLite autocommit mode.
sv: Sätt *autocommit* till ``True`` för att aktivera SQLites `autocommit-läge`_. I detta läge har :meth:`Connection.commit` och :meth:`Connection.rollback` ingen effekt. Observera att SQLites autocommit-läge skiljer sig från det :pep:`249`-kompatibla attributet :attr:`Connection.autocommit`; använd :attr:`Connection.in_transaction` för att fråga om SQLites autocommit-läge på låg nivå.
