Repository: yeager/python-docs-sv
Catalog: library/sqlite3.po
Languages: sv

source: :mod:`!sqlite3` --- DB-API 2.0 interface for SQLite databases
sv: :mod:`!sqlite3` --- DB-API 2.0-gränssnitt för SQLite-databaser

source: **Source code:** :source:`Lib/sqlite3/`
sv: **Källkod:** :source:`Lib/sqlite3/`

source: SQLite is a C library that provides a lightweight disk-based database that doesn't require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It's also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.
sv: SQLite är ett C-bibliotek som tillhandahåller en lättviktig diskbaserad databas som inte kräver en separat serverprocess och som gör det möjligt att komma åt databasen med en icke-standardvariant av frågespråket SQL. Vissa applikationer kan använda SQLite för intern datalagring. Det är också möjligt att prototypa en applikation med SQLite och sedan porta koden till en större databas som PostgreSQL eller Oracle.

source: The :mod:`!sqlite3` module was written by Gerhard Häring. It provides an SQL interface compliant with the DB-API 2.0 specification described by :pep:`249`, and requires SQLite 3.15.2 or newer.
sv: Modulen :mod:`!sqlite3` är skriven av Gerhard Häring. Den tillhandahåller ett SQL-gränssnitt som överensstämmer med DB-API 2.0-specifikationen som beskrivs av :pep:`249` och kräver SQLite 3.15.2 eller nyare.

source: This document includes four main sections:
sv: Detta dokument innehåller fyra huvudavsnitt:

source: :ref:`sqlite3-tutorial` teaches how to use the :mod:`!sqlite3` module.
sv: :ref:`sqlite3-tutorial` lär ut hur man använder modulen :mod:`!sqlite3`.

source: :ref:`sqlite3-reference` describes the classes and functions this module defines.
sv: :ref:`sqlite3-reference` beskriver de klasser och funktioner som denna modul definierar.

source: :ref:`sqlite3-howtos` details how to handle specific tasks.
sv: :ref:`sqlite3-howtos` beskriver hur man hanterar specifika uppgifter.

source: :ref:`sqlite3-explanation` provides in-depth background on transaction control.
sv: :ref:`sqlite3-explanation` ger en djupgående bakgrund till transaktionskontroll.

source: The SQLite web page; the documentation describes the syntax and the available data types for the supported SQL dialect.
sv: SQLite-webbsidan; dokumentationen beskriver syntaxen och de tillgängliga datatyperna för den SQL-dialekt som stöds.

source: Tutorial, reference and examples for learning SQL syntax.
sv: Handledning, referens och exempel för att lära sig SQL-syntax.

source: :pep:`249` - Database API Specification 2.0
sv: :pep:`249` - API-specifikation för databaser 2.0

source: PEP written by Marc-André Lemburg.
sv: PEP skriven av Marc-André Lemburg.

source: Tutorial
sv: Handledning

source: In this tutorial, you will create a database of Monty Python movies using basic :mod:`!sqlite3` functionality. It assumes a fundamental understanding of database concepts, including `cursors`_ and `transactions`_.
sv: I den här handledningen skapar du en databas med Monty Python-filmer med hjälp av grundläggande :mod:`!sqlite3`-funktionalitet. Den förutsätter en grundläggande förståelse för databaskoncept, inklusive `cursors`_ och `transactions`_.

source: First, we need to create a new database and open a database connection to allow :mod:`!sqlite3` to work with it. Call :func:`sqlite3.connect` to create a connection to the database :file:`tutorial.db` in the current working directory, implicitly creating it if it does not exist:
sv: Först måste vi skapa en ny databas och öppna en databasanslutning så att :mod:`!sqlite3` kan arbeta med den. Anropa :func:`sqlite3.connect` för att skapa en anslutning till databasen :file:`tutorial.db` i den aktuella arbetskatalogen, och skapa den implicit om den inte finns:

source: The returned :class:`Connection` object ``con`` represents the connection to the on-disk database.
sv: Det returnerade :class:`Connection`-objektet ``con`` representerar anslutningen till databasen på disken.

source: In order to execute SQL statements and fetch results from SQL queries, we will need to use a database cursor. Call :meth:`con.cursor() <Connection.cursor>` to create the :class:`Cursor`:
sv: För att kunna utföra SQL-satser och hämta resultat från SQL-frågor måste vi använda en databascursor. Anropa :meth:`con.cursor() <Connection.cursor>` för att skapa :class:`Cursor`:

source: Now that we've got a database connection and a cursor, we can create a database table ``movie`` with columns for title, release year, and review score. For simplicity, we can just use column names in the table declaration -- thanks to the `flexible typing`_ feature of SQLite, specifying the data types is optional. Execute the ``CREATE TABLE`` statement by calling :meth:`cur.execute(...) <Cursor.execute>`:
sv: Nu när vi har en databasanslutning och en markör kan vi skapa en databastabell ``movie`` med kolumner för titel, utgivningsår och recensionspoäng. För enkelhetens skull kan vi bara använda kolumnnamn i tabelldeklarationen - tack vare SQLites `flexible typing`_-funktion är det valfritt att ange datatyperna. Kör ``CREATE TABLE``-satsen genom att anropa :meth:`cur.execute(...) <Cursor.execute>`:

source: cur.execute("CREATE TABLE movie(title, year, score)")
sv: cur.execute("CREATE TABLE film(titel, år, poäng)")

source: We can verify that the new table has been created by querying the ``sqlite_master`` table built-in to SQLite, which should now contain an entry for the ``movie`` table definition (see `The Schema Table`_ for details). Execute that query by calling :meth:`cur.execute(...) <Cursor.execute>`, assign the result to ``res``, and call :meth:`res.fetchone() <Cursor.fetchone>` to fetch the resulting row:
sv: Vi kan verifiera att den nya tabellen har skapats genom att fråga tabellen ``qlite_master`` som är inbyggd i SQLite, som nu bör innehålla en post för tabelldefinitionen ``movie`` (se `The Schema Table`_ för detaljer). Exekvera frågan genom att anropa :meth:`cur.execute(...) <Cursor.execute>`, tilldela resultatet till ``res`` och anropa :meth:`res.fetchone() <Cursor.fetchone>` för att hämta den resulterande raden:

source: >>> res = cur.execute("SELECT name FROM sqlite_master") >>> res.fetchone() ('movie',)
sv: >>> res = cur.execute("VÄLJ namn FRÅN sqlite_master") >>> res.fetchone() ('film',)

source: We can see that the table has been created, as the query returns a :class:`tuple` containing the table's name. If we query ``sqlite_master`` for a non-existent table ``spam``, :meth:`!res.fetchone` will return ``None``:
sv: Vi kan se att tabellen har skapats, eftersom frågan returnerar en :class:`tuple` som innehåller tabellens namn. Om vi frågar ``sqlite_master`` efter en icke-existerande tabell ``spam``, kommer :meth:`!res.fetchone`` att returnera ``None``:

source: >>> res = cur.execute("SELECT name FROM sqlite_master WHERE name='spam'") >>> res.fetchone() is None True
sv: >>> res = cur.execute("SELECT namn FRÅN sqlite_master WHERE name='spam'") >>> res.fetchone() är None Sant

source: Now, add two rows of data supplied as SQL literals by executing an ``INSERT`` statement, once again by calling :meth:`cur.execute(...) <Cursor.execute>`:
sv: Lägg nu till två rader med data som tillhandahålls som SQL-litteraler genom att köra en ``INSERT``-sats, återigen genom att anropa :meth:`cur.execute(...) <Cursor.execute>`:

source: cur.execute(""" INSERT INTO movie VALUES ('Monty Python and the Holy Grail', 1975, 8.2), ('And Now for Something Completely Different', 1971, 7.5) """)
sv: cur.execute("""") INSERT INTO film VALUES ('Monty Python och den heliga graalen', 1975, 8,2), ('Och nu till något helt annat', 1971, 7,5) """)

source: The ``INSERT`` statement implicitly opens a transaction, which needs to be committed before changes are saved in the database (see :ref:`sqlite3-controlling-transactions` for details). Call :meth:`con.commit() <Connection.commit>` on the connection object to commit the transaction:
sv: Satsen ``INSERT`` öppnar implicit en transaktion, som måste bekräftas innan ändringarna sparas i databasen (se :ref:`sqlite3-controlling-transactions` för mer information). Anropa :meth:`con.commit() <Connection.commit>` på anslutningsobjektet för att bekräfta transaktionen:

source: We can verify that the data was inserted correctly by executing a ``SELECT`` query. Use the now-familiar :meth:`cur.execute(...) <Cursor.execute>` to assign the result to ``res``, and call :meth:`res.fetchall() <Cursor.fetchall>` to return all resulting rows:
sv: Vi kan verifiera att data infogades korrekt genom att köra en ``SELECT``-fråga. Använd den numera välkända :meth:`cur.execute(...) <Cursor.execute>` för att tilldela resultatet till ``res``, och anropa :meth:`res.fetchall() <Cursor.fetchall>` för att returnera alla resulterande rader:

source: >>> res = cur.execute("SELECT score FROM movie") >>> res.fetchall() [(8.2,), (7.5,)]
sv: >>> res = cur.execute("VÄLJ poäng FRÅN film") >>> res.fetchall() [(8.2,), (7.5,)]

source: The result is a :class:`list` of two :class:`!tuple`\s, one per row, each containing that row's ``score`` value.
sv: Resultatet är en :class:`list` med två :class:`!tuple`, en per rad, som var och en innehåller den radens ``score``-värde.

source: Now, insert three more rows by calling :meth:`cur.executemany(...) <Cursor.executemany>`:
sv: Nu ska du infoga ytterligare tre rader genom att anropa :meth:`cur.executemany(...) <Cursor.executemany>`:

source: data = [ ("Monty Python Live at the Hollywood Bowl", 1982, 7.9), ("Monty Python's The Meaning of Life", 1983, 7.5), ("Monty Python's Life of Brian", 1979, 8.0), ] cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data) con.commit() # Remember to commit the transaction after executing INSERT.
sv: data = [ ("Monty Python Live at the Hollywood Bowl", 1982, 7,9), ("Monty Python's The Meaning of Life", 1983, 7,5), ("Monty Python's Life of Brian", 1979, 8,0), ] cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data) con.commit() # Kom ihåg att genomföra transaktionen efter att du har kört INSERT.

source: Notice that ``?`` placeholders are used to bind ``data`` to the query. Always use placeholders instead of :ref:`string formatting <tut-formatting>` to bind Python values to SQL statements, to avoid `SQL injection attacks`_ (see :ref:`sqlite3-placeholders` for more details).
sv: Observera att ``?`` platshållare används för att binda ``data`` till frågan. Använd alltid platshållare istället för :ref:``strängformatering <tut-formatting>`` för att binda Python-värden till SQL-satser, för att undvika `SQL-injektionsattacker`_ (se :ref:`sqlite3-placeholders` för mer information).

source: We can verify that the new rows were inserted by executing a ``SELECT`` query, this time iterating over the results of the query:
sv: Vi kan verifiera att de nya raderna infogades genom att köra en ``SELECT``-fråga och den här gången iterera över resultaten av frågan:

source: >>> for row in cur.execute("SELECT year, title FROM movie ORDER BY year"): ... print(row) (1971, 'And Now for Something Completely Different') (1975, 'Monty Python and the Holy Grail') (1979, "Monty Python's Life of Brian") (1982, 'Monty Python Live at the Hollywood Bowl') (1983, "Monty Python's The Meaning of Life")
sv: >>> for row in cur.execute("SELECT år, titel FROM film ORDER BY år"): ... print(rad) (1971, 'Och nu till något helt annat') (1975, "Monty Python och den heliga graalen") (1979, "Monty Python's Life of Brian") (1982, "Monty Python Live at the Hollywood Bowl") (1983, "Monty Python's The Meaning of Life")

source: Each row is a two-item :class:`tuple` of ``(year, title)``, matching the columns selected in the query.
sv: Varje rad är en :class:`tuple` av ``(year, title)`` med två objekt som matchar de kolumner som valts i frågan.

source: Finally, verify that the database has been written to disk by calling :meth:`con.close() <Connection.close>` to close the existing connection, opening a new one, creating a new cursor, then querying the database:
sv: Slutligen kontrollerar du att databasen har skrivits till disken genom att anropa :meth:`con.close() <Connection.close>` för att stänga den befintliga anslutningen, öppna en ny, skapa en ny markör och sedan fråga databasen:

source: >>> con.close() >>> new_con = sqlite3.connect("tutorial.db") >>> new_cur = new_con.cursor() >>> res = new_cur.execute("SELECT title, year FROM movie ORDER BY score DESC") >>> title, year = res.fetchone() >>> print(f'The highest scoring Monty Python movie is {title!r}, released in {year}') The highest scoring Monty Python movie is 'Monty Python and the Holy Grail', released in 1975 >>> new_con.close()
sv: >>> con.close() >>> new_con = sqlite3.connect("tutorial.db") >>> new_cur = new_con.cursor() >>> res = new_cur.execute("VÄLJ titel, år FRÅN film ORDER BY poäng DESC") >>> titel, år = res.fetchone() >>> print(f'Den Monty Python-film som har högst poäng är {title!r}, släppt i {year}') Monty Python-filmen med högst poäng är 'Monty Python and the Holy Grail', släppt 1975 >>> new_con.close()

source: You've now created an SQLite database using the :mod:`!sqlite3` module, inserted data and retrieved values from it in multiple ways.
sv: Du har nu skapat en SQLite-databas med modulen :mod:`!sqlite3`, lagt in data och hämtat värden från den på flera olika sätt.

source: :ref:`sqlite3-howtos` for further reading:
sv: :ref:`sqlite3-howtos` för ytterligare läsning:

source: :ref:`sqlite3-placeholders`
sv: :ref:`sqlite3-platshållare`

source: :ref:`sqlite3-adapters`
sv: :ref:`sqlite3-anpassare`

source: :ref:`sqlite3-converters`
sv: :ref:`sqlite3-omvandlare`

source: :ref:`sqlite3-connection-context-manager`
sv: :ref:`sqlite3-anslutningskontexthanterare`

source: :ref:`sqlite3-explanation` for in-depth background on transaction control.
sv: :ref:`sqlite3-explanation` för djupgående bakgrund om transaktionskontroll.

source: Reference
sv: Referens

source: Module functions
sv: Modulens funktioner

source: Open a connection to an SQLite database.
sv: Öppna en anslutning till en SQLite-databas.

source: Parameters
sv: Parametrar

source: The path to the database file to be opened. You can pass ``":memory:"`` to create an `SQLite database existing only in memory <https://sqlite.org/inmemorydb.html>`_, and open a connection to it.
sv: Sökvägen till den databasfil som ska öppnas. Du kan skicka ``":memory:"`` för att skapa en `SQLite-databas som bara finns i minnet <https://sqlite.org/inmemorydb.html>`_ och öppna en anslutning till den.

source: How many seconds the connection should wait before raising an :exc:`OperationalError` when a table is locked. If another connection opens a transaction to modify a table, that table will be locked until the transaction is committed. Default five seconds.
sv: Hur många sekunder anslutningen ska vänta innan den skickar ett :exc:`OperationalError` när en tabell är låst. Om en annan anslutning öppnar en transaktion för att ändra en tabell, kommer tabellen att vara låst tills transaktionen är genomförd. Standard fem sekunder.

source: Control whether and how data types not :ref:`natively supported by SQLite <sqlite3-types>` are looked up to be converted to Python types, using the converters registered with :func:`register_converter`. Set it to any combination (using ``|``, bitwise or) of :const:`PARSE_DECLTYPES` and :const:`PARSE_COLNAMES` to enable this. Column names takes precedence over declared types if both flags are set. By default (``0``), type detection is disabled.
sv: Kontrollera om och hur datatyper som inte :ref:``nativt stöds av SQLite <sqlite3-types>`` ska sökas upp för att konverteras till Python-typer, med hjälp av de konverterare som registrerats med :func:`register_converter`. Ställ in den på valfri kombination (med ``|``, bitvis eller) av :const:`PARSE_DECLTYPES` och :const:`PARSE_COLNAMES` för att aktivera detta. Kolumnnamn har företräde framför deklarerade typer om båda flaggorna är inställda. Som standard (``0``) är typdetektering avaktiverad.

source: Control legacy transaction handling behaviour. See :attr:`Connection.isolation_level` and :ref:`sqlite3-transaction-control-isolation-level` for more information. Can be ``"DEFERRED"`` (default), ``"EXCLUSIVE"`` or ``"IMMEDIATE"``; or ``None`` to disable opening transactions implicitly. Has no effect unless :attr:`Connection.autocommit` is set to :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL` (the default).
sv: Styr beteendet för hantering av äldre transaktioner. Se :attr:`Connection.isolation_level` och :ref:`sqlite3-transaction-control-isolation-level` för mer information. Kan vara ``"DEFERRED"`` (standard), ``"EXCLUSIVE"`` eller ``"IMMEDIATE"``; eller ``None`` för att inaktivera implicit öppning av transaktioner. Har ingen effekt om inte :attr:`Connection.autocommit` är satt till :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL` (standard).

source: If ``True`` (default), :exc:`ProgrammingError` will be raised if the database connection is used by a thread other than the one that created it. If ``False``, the connection may be accessed in multiple threads; write operations may need to be serialized by the user to avoid data corruption. See :attr:`threadsafety` for more information.
sv: Om ``True`` (standard), kommer :exc:`ProgrammingError` att uppstå om databasanslutningen används av en annan tråd än den som skapade den. Om ``False``, kan anslutningen användas av flera trådar; skrivoperationer kan behöva serialiseras av användaren för att undvika datakorruption. Se :attr:`threadsafety` för mer information.

source: A custom subclass of :class:`Connection` to create the connection with, if not the default :class:`Connection` class.
sv: En anpassad underklass av :class:`Connection` för att skapa anslutningen med, om inte standardklassen :class:`Connection` används.

source: The number of statements that :mod:`!sqlite3` should internally cache for this connection, to avoid parsing overhead. By default, 128 statements.
sv: Antalet satser som :mod:`!sqlite3` ska cacha internt för den här anslutningen för att undvika överbelastning vid parsning. Som standard 128 uttalanden.

source: If set to ``True``, *database* is interpreted as a :abbr:`URI (Uniform Resource Identifier)` with a file path and an optional query string. The scheme part *must* be ``"file:"``, and the path can be relative or absolute. The query string allows passing parameters to SQLite, enabling various :ref:`sqlite3-uri-tricks`.
sv: Om värdet är ``True`` tolkas *database* som en :abbr:`URI (Uniform Resource Identifier)` med en filsökväg och en valfri frågesträng. Schemadelen *måste* vara ``"file:"``, och sökvägen kan vara relativ eller absolut. Frågesträngen gör det möjligt att skicka parametrar till SQLite, vilket möjliggör olika :ref:`sqlite3-uri-tricks`.

source: Control :pep:`249` transaction handling behaviour. See :attr:`Connection.autocommit` and :ref:`sqlite3-transaction-control-autocommit` for more information. *autocommit* currently defaults to :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL`. The default will change to ``False`` in a future Python release.
sv: Kontrollerar :pep:`249` transaktionshanteringsbeteende. Se :attr:`Connection.autocommit` och :ref:`sqlite3-transaction-control-autocommit` för mer information. *autocommit* är för närvarande standardvärdet för :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL`. Standardvärdet kommer att ändras till ``False`` i en framtida Python-version.

source: Return type
sv: Typ av retur

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect`` with argument ``database``.
sv: Utlöser en :ref:`auditing event <auditing>` ``sqlite3.connect`` med argumentet ``database``.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect/handle`` with argument ``connection_handle``.
sv: Utlöser en :ref:`auditing event <auditing>` ``sqlite3.connect/handle`` med argumentet ``connection_handle``.

source: Added the *uri* parameter.
sv: Parametern *uri* har lagts till.

source: *database* can now also be a :term:`path-like object`, not only a string.
sv: *databas* kan nu också vara en :term:`path-like object`, inte bara en sträng.

source: Added the ``sqlite3.connect/handle`` auditing event.
sv: Lagt till granskningshändelsen ``sqlite3.connect/handle``.

source: Added the *autocommit* parameter.
sv: Lagt till parametern *autocommit*.

source: Positional use of the parameters *timeout*, *detect_types*, *isolation_level*, *check_same_thread*, *factory*, *cached_statements*, and *uri* is deprecated. They will become keyword-only parameters in Python 3.15.
sv: Positionell användning av parametrarna *timeout*, *detect_types*, *isolation_level*, *check_same_thread*, *factory*, *cached_statements* och *uri* är föråldrad. De kommer att bli parametrar som endast innehåller nyckelord i Python 3.15.

source: Return ``True`` if the string *statement* appears to contain one or more complete SQL statements. No syntactic verification or parsing of any kind is performed, other than checking that there are no unclosed string literals and the statement is terminated by a semicolon.
sv: Returnerar ``True`` om strängen *statement* verkar innehålla en eller flera kompletta SQL-satser. Ingen syntaktisk verifiering eller parsning av något slag utförs, annat än att kontrollera att det inte finns några oavslutade stränglitteraler och att satsen avslutas med ett semikolon.

source: For example:
sv: Till exempel:

source: >>> sqlite3.complete_statement("SELECT foo FROM bar;") True >>> sqlite3.complete_statement("SELECT foo") False
sv: >>> sqlite3.complete_statement("SELECT foo FROM bar;") Sant >>> sqlite3.complete_statement("VÄLJ foo") Falsk

source: This function may be useful during command-line input to determine if the entered text seems to form a complete SQL statement, or if additional input is needed before calling :meth:`~Cursor.execute`.
sv: Denna funktion kan vara användbar vid kommandoradsinmatning för att avgöra om den inmatade texten verkar utgöra en komplett SQL-sats, eller om ytterligare inmatning behövs innan :meth:`~Cursor.execute` anropas.

source: See :func:`!runsource` in :source:`Lib/sqlite3/__main__.py` for real-world use.
sv: Se :func:`!runsource` i :source:`Lib/sqlite3/__main__.py` för verklig användning.

source: Enable or disable callback tracebacks. By default you will not get any tracebacks in user-defined functions, aggregates, converters, authorizer callbacks etc. If you want to debug them, you can call this function with *flag* set to ``True``. Afterwards, you will get tracebacks from callbacks on :data:`sys.stderr`. Use ``False`` to disable the feature again.
sv: Aktivera eller inaktivera spårningar av callbacks. Som standard får du inga spårningar i användardefinierade funktioner, aggregat, omvandlare, auktoriseringsanrop etc. Om du vill felsöka dem kan du anropa den här funktionen med *flag* inställd på ``True``. Efteråt kommer du att få spårningar från återkallelser på :data:`sys.stderr`. Använd ``False`` för att inaktivera funktionen igen.

source: Errors in user-defined function callbacks are logged as unraisable exceptions. Use an :func:`unraisable hook handler <sys.unraisablehook>` for introspection of the failed callback.
sv: Fel i användardefinierade funktionsåterkallelser loggas som ovärderliga undantag. Använd en :func:`unraisable hook handler <sys.unraisablehook>` för introspektion av den misslyckade anropet.
