Repository: yeager/python-docs-sv
Catalog: library/sqlite3.po
Languages: sv

source: Write *data* to the blob at the current offset. This function cannot change the blob length. Writing beyond the end of the blob will raise :exc:`ValueError`.
sv: Skriv *data* till blobben vid aktuell offset. Denna funktion kan inte ändra blobbens längd. Skrivning bortom slutet av blobben kommer att ge upphov till :exc:`ValueError`.

source: Return the current access position of the blob.
sv: Returnerar den aktuella accesspositionen för blobben.

source: Set the current access position of the blob to *offset*. The *origin* argument defaults to :const:`os.SEEK_SET` (absolute blob positioning). Other values for *origin* are :const:`os.SEEK_CUR` (seek relative to the current position) and :const:`os.SEEK_END` (seek relative to the blob’s end).
sv: Ställ in blobbens aktuella accessposition till *offset*. Argumentet *origin* är som standard :const:`os.SEEK_SET` (absolut positionering av blobben). Andra värden för *origin* är :const:`os.SEEK_CUR` (sökning relativt den aktuella positionen) och :const:`os.SEEK_END` (sökning relativt blobbens slut).

source: PrepareProtocol objects
sv: PrepareProtocol-objekt

source: The PrepareProtocol type's single purpose is to act as a :pep:`246` style adaption protocol for objects that can :ref:`adapt themselves <sqlite3-conform>` to :ref:`native SQLite types <sqlite3-types>`.
sv: PrepareProtocol-typens enda syfte är att fungera som ett :pep:`246`-stilanpassningsprotokoll för objekt som kan :ref:``anpassa sig <sqlite3-conform>` till :ref:``nativa SQLite-typer <sqlite3-types>`.

source: Exceptions
sv: Undantag

source: The exception hierarchy is defined by the DB-API 2.0 (:pep:`249`).
sv: Undantagshierarkin definieras av DB-API 2.0 (:pep:`249`).

source: This exception is not currently raised by the :mod:`!sqlite3` module, but may be raised by applications using :mod:`!sqlite3`, for example if a user-defined function truncates data while inserting. ``Warning`` is a subclass of :exc:`Exception`.
sv: Detta undantag görs för närvarande inte av modulen :mod:`!sqlite3`, men kan göras av program som använder :mod:`!sqlite3`, t.ex. om en användardefinierad funktion trunkerar data vid inmatning. ``Warning`` är en underklass till :exc:`Exception`.

source: The base class of the other exceptions in this module. Use this to catch all errors with one single :keyword:`except` statement. ``Error`` is a subclass of :exc:`Exception`.
sv: Basklassen för de andra undantagen i den här modulen. Använd denna för att fånga upp alla fel med en enda :keyword:`except`-sats. ``Error`` är en underklass till :exc:`Exception`.

source: If the exception originated from within the SQLite library, the following two attributes are added to the exception:
sv: Om undantaget uppstod inom SQLite-biblioteket läggs följande två attribut till undantaget:

source: The numeric error code from the `SQLite API <https://sqlite.org/rescode.html>`_
sv: Den numeriska felkoden från `SQLite API <https://sqlite.org/rescode.html>`_

source: The symbolic name of the numeric error code from the `SQLite API <https://sqlite.org/rescode.html>`_
sv: Det symboliska namnet på den numeriska felkoden från `SQLite API <https://sqlite.org/rescode.html>`_

source: Exception raised for misuse of the low-level SQLite C API. In other words, if this exception is raised, it probably indicates a bug in the :mod:`!sqlite3` module. ``InterfaceError`` is a subclass of :exc:`Error`.
sv: Undantag för missbruk av SQLite C API på låg nivå. Med andra ord, om detta undantag tas upp, indikerar det förmodligen en bugg i modulen :mod:`!sqlite3`. ``InterfaceError`` är en underklass till :exc:`Error`.

source: Exception raised for errors that are related to the database. This serves as the base exception for several types of database errors. It is only raised implicitly through the specialised subclasses. ``DatabaseError`` is a subclass of :exc:`Error`.
sv: Undantag för fel som är relaterade till databasen. Detta fungerar som basundantag för flera typer av databasfel. Det kan bara skapas implicit genom de specialiserade underklasserna. ``DatabaseError`` är en underklass till :exc:`Error`.

source: Exception raised for errors caused by problems with the processed data, like numeric values out of range, and strings which are too long. ``DataError`` is a subclass of :exc:`DatabaseError`.
sv: Undantag för fel som orsakas av problem med bearbetade data, t.ex. numeriska värden utanför intervallet och för långa strängar. ``DataError`` är en underklass till :exc:`DatabaseError`.

source: Exception raised for errors that are related to the database's operation, and not necessarily under the control of the programmer. For example, the database path is not found, or a transaction could not be processed. ``OperationalError`` is a subclass of :exc:`DatabaseError`.
sv: Undantag för fel som är relaterade till databasens funktion och inte nödvändigtvis under programmerarens kontroll. Till exempel, databassökvägen hittades inte, eller en transaktion kunde inte behandlas. ``OperationalError`` är en underklass till :exc:`DatabaseError`.

source: Exception raised when the relational integrity of the database is affected, e.g. a foreign key check fails. It is a subclass of :exc:`DatabaseError`.
sv: Undantag som uppstår när databasens relationsintegritet påverkas, t.ex. när en kontroll av en främmande nyckel misslyckas. Det är en underklass till :exc:`DatabaseError`.

source: Exception raised when SQLite encounters an internal error. If this is raised, it may indicate that there is a problem with the runtime SQLite library. ``InternalError`` is a subclass of :exc:`DatabaseError`.
sv: Undantag som uppstår när SQLite stöter på ett internt fel. Om det uppstår kan det tyda på att det finns ett problem med SQLite-biblioteket under körning. ``InternalError`` är en underklass till :exc:`DatabaseError`.

source: Exception raised for :mod:`!sqlite3` API programming errors, for example supplying the wrong number of bindings to a query, or trying to operate on a closed :class:`Connection`. ``ProgrammingError`` is a subclass of :exc:`DatabaseError`.
sv: Undantag för programmeringsfel i :mod:`!sqlite3` API, t.ex. fel antal bindningar till en fråga eller försök att använda en stängd :class:`Connection`. ``ProgrammingError`` är en underklass till :exc:`DatabaseError`.

source: Exception raised in case a method or database API is not supported by the underlying SQLite library. For example, setting *deterministic* to ``True`` in :meth:`~Connection.create_function`, if the underlying SQLite library does not support deterministic functions. ``NotSupportedError`` is a subclass of :exc:`DatabaseError`.
sv: Undantag som uppstår om en metod eller databas-API inte stöds av det underliggande SQLite-biblioteket. Till exempel kan *deterministic* sättas till ``True`` i :meth:`~Connection.create_function`, om det underliggande SQLite-biblioteket inte stöder deterministiska funktioner. ``NotSupportedError`` är en underklass till :exc:`DatabaseError`.

source: SQLite and Python types
sv: SQLite- och Python-typer

source: SQLite natively supports the following types: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.
sv: SQLite har inbyggt stöd för följande typer: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.

source: The following Python types can thus be sent to SQLite without any problem:
sv: Följande Python-typer kan alltså skickas till SQLite utan problem:

source: Python type
sv: Python-typ

source: SQLite type
sv: SQLite-typ

source: ``None``
sv: ``Ingen``

source: This is how SQLite types are converted to Python types by default:
sv: Detta är hur SQLite-typer konverteras till Python-typer som standard:

source: depends on :attr:`~Connection.text_factory`, :class:`str` by default
sv: beror på :attr:`~Connection.text_factory`, :class:`str` som standard

source: The type system of the :mod:`!sqlite3` module is extensible in two ways: you can store additional Python types in an SQLite database via :ref:`object adapters <sqlite3-adapters>`, and you can let the :mod:`!sqlite3` module convert SQLite types to Python types via :ref:`converters <sqlite3-converters>`.
sv: Typsystemet i modulen :mod:`!sqlite3` är utbyggbart på två sätt: du kan lagra ytterligare Python-typer i en SQLite-databas via :ref:``object adapters <sqlite3-adapters>`, och du kan låta modulen :mod:`!sqlite3` konvertera SQLite-typer till Python-typer via :ref:``converters <sqlite3-converters>`.

source: Default adapters and converters (deprecated)
sv: Standardadaptrar och -omvandlare (föråldrad)

source: The default adapters and converters are deprecated as of Python 3.12. Instead, use the :ref:`sqlite3-adapter-converter-recipes` and tailor them to your needs.
sv: Standardadaptrarna och -omvandlarna är föråldrade från och med Python 3.12. Använd istället :ref:`sqlite3-adapter-converter-recipes` och skräddarsy dem efter dina behov.

source: The deprecated default adapters and converters consist of:
sv: De föråldrade standardadaptrarna och -konverterarna består av:

source: An adapter for :class:`datetime.date` objects to :class:`strings <str>` in `ISO 8601`_ format.
sv: En adapter för :class:`datetime.date`-objekt till :class:`strings <str>` i `ISO 8601`_-format.

source: An adapter for :class:`datetime.datetime` objects to strings in ISO 8601 format.
sv: En adapter för :class:`datetime.datetime`-objekt till strängar i ISO 8601-format.

source: A converter for :ref:`declared <sqlite3-converters>` "date" types to :class:`datetime.date` objects.
sv: En omvandlare för :ref:`declared <sqlite3-converters>` "date"-typer till :class:`datetime.date`-objekt.

source: A converter for declared "timestamp" types to :class:`datetime.datetime` objects. Fractional parts will be truncated to 6 digits (microsecond precision).
sv: En omvandlare för deklarerade "timestamp"-typer till :class:`datetime.datetime`-objekt. Bråkdelar kommer att trunkeras till 6 siffror (mikrosekundsprecision).

source: The default "timestamp" converter ignores UTC offsets in the database and always returns a naive :class:`datetime.datetime` object. To preserve UTC offsets in timestamps, either leave converters disabled, or register an offset-aware converter with :func:`register_converter`.
sv: Standardomvandlaren "timestamp" ignorerar UTC-offset i databasen och returnerar alltid ett naivt :class:`datetime.datetime`-objekt. Om du vill bevara UTC-offset i tidsstämplar ska du antingen låta omvandlare vara inaktiverade eller registrera en offsetmedveten omvandlare med :func:`register_converter`.

source: Command-line interface
sv: Kommandoradsgränssnitt

source: The :mod:`!sqlite3` module can be invoked as a script, using the interpreter's :option:`-m` switch, in order to provide a simple SQLite shell. The argument signature is as follows::
sv: Modulen :mod:`!sqlite3` kan anropas som ett skript, med hjälp av tolkens switch :option:`-m`, för att tillhandahålla ett enkelt SQLite-skal. Argumentsignaturen är som följer::

source: python -m sqlite3 [-h] [-v] [filename] [sql]
sv: python -m sqlite3 [-h] [-v] [filnamn] [sql]

source: Type ``.quit`` or CTRL-D to exit the shell.
sv: Skriv ``.quit`` eller CTRL-D för att avsluta skalet.

source: Print CLI help.
sv: Skriv ut CLI-hjälp.

source: Print underlying SQLite library version.
sv: Skriv ut underliggande SQLite-biblioteksversion.

source: How-to guides
sv: Hur man gör-guider

source: How to use placeholders to bind values in SQL queries
sv: Så här använder du platshållare för att binda värden i SQL-frågor

source: SQL operations usually need to use values from Python variables. However, beware of using Python's string operations to assemble queries, as they are vulnerable to `SQL injection attacks`_. For example, an attacker can simply close the single quote and inject ``OR TRUE`` to select all rows::
sv: SQL-operationer behöver vanligtvis använda värden från Python-variabler. Var dock försiktig med att använda Pythons strängoperationer för att sätta ihop frågor, eftersom de är sårbara för `SQL-injektionsattacker`_. Till exempel kan en angripare helt enkelt stänga det enkla citatet och injicera ``OR TRUE`` för att välja alla rader::

source: >>> # Never do this -- insecure! >>> symbol = input() ' OR TRUE; -- >>> sql = "SELECT * FROM stocks WHERE symbol = '%s'" % symbol >>> print(sql) SELECT * FROM stocks WHERE symbol = '' OR TRUE; --' >>> cur.execute(sql)
sv: >>> # Gör aldrig detta -- osäkert! >>> symbol = inmatning() ' OR TRUE; -- >>> sql = "SELECT * FROM aktier WHERE symbol = '%s'" % symbol >>> print(sql) SELECT * FROM stocks WHERE symbol = '' OR TRUE; --' >>> cur.execute(sql)

source: Instead, use the DB-API's parameter substitution. To insert a variable into a query string, use a placeholder in the string, and substitute the actual values into the query by providing them as a :class:`tuple` of values to the second argument of the cursor's :meth:`~Cursor.execute` method.
sv: Använd istället DB-API:s parametersubstitution. Om du vill infoga en variabel i en frågesträng använder du en platshållare i strängen och ersätter de faktiska värdena i frågan genom att tillhandahålla dem som en :class:`tuple` av värden till det andra argumentet i markörens :meth:`~Cursor.execute`-metod.

source: An SQL statement may use one of two kinds of placeholders: question marks (qmark style) or named placeholders (named style). For the qmark style, *parameters* must be a :term:`sequence` whose length must match the number of placeholders, or a :exc:`ProgrammingError` is raised. For the named style, *parameters* must be an instance of a :class:`dict` (or a subclass), which must contain keys for all named parameters; any extra items are ignored. Here's an example of both styles:
sv: En SQL-sats kan använda en av två typer av platshållare: frågetecken (qmark-stil) eller namngivna platshållare (named-stil). För qmark-stilen måste *parameters* vara en :term:`sequence` vars längd måste motsvara antalet platshållare, annars uppstår ett :exc:`ProgrammingError`. För den namngivna stilen måste *parameters* vara en instans av en :class:`dict` (eller en underklass), som måste innehålla nycklar för alla namngivna parametrar; eventuella extra objekt ignoreras. Här är ett exempel på båda stilarna:

source: con = sqlite3.connect(":memory:") cur = con.execute("CREATE TABLE lang(name, first_appeared)") # This is the named style used with executemany(): data = ( {"name": "C", "year": 1972}, {"name": "Fortran", "year": 1957}, {"name": "Python", "year": 1991}, {"name": "Go", "year": 2009}, ) cur.executemany("INSERT INTO lang VALUES(:name, :year)", data) # This is the qmark style used in a SELECT query: params = (1972,) cur.execute("SELECT * FROM lang WHERE first_appeared = ?", params) print(cur.fetchall()) con.close()
sv: con = sqlite3.connect(":minne:") cur = con.execute("CREATE TABLE lang(namn, första_uppträdde)") # Detta är den namngivna stil som används med executemany(): data = ( {"namn": "C", "year": 1972}, {"name": "Fortran", "år": 1957}, {"name": "Python", "år": 1991}, {"name": "Go", "år": 2009}, ) cur.executemany("INSERT INTO lang VALUES(:namn, :år)", data) # Detta är den qmark-stil som används i en SELECT-fråga: params = (1972,) cur.execute("SELECT * FROM lang WHERE first_appeared = ?", params) print(cur.fetchall()) con.close()

source: :pep:`249` numeric placeholders are *not* supported. If used, they will be interpreted as named placeholders.
sv: :pep:`249` numeriska platshållare stöds *inte*. Om de används kommer de att tolkas som namngivna platshållare.

source: How to adapt custom Python types to SQLite values
sv: Så här anpassar du anpassade Python-typer till SQLite-värden

source: SQLite supports only a limited set of data types natively. To store custom Python types in SQLite databases, *adapt* them to one of the :ref:`Python types SQLite natively understands <sqlite3-types>`.
sv: SQLite stöder endast en begränsad uppsättning datatyper. För att lagra anpassade Python-typer i SQLite-databaser, *anpassa* dem till en av :ref:`Python-typer som SQLite förstår inbyggt <sqlite3-types>`.

source: There are two ways to adapt Python objects to SQLite types: letting your object adapt itself, or using an *adapter callable*. The latter will take precedence above the former. For a library that exports a custom type, it may make sense to enable that type to adapt itself. As an application developer, it may make more sense to take direct control by registering custom adapter functions.
sv: Det finns två sätt att anpassa Python-objekt till SQLite-typer: att låta ditt objekt anpassa sig självt eller att använda en *adapter callable*. Det senare kommer att ha företräde framför det förra. För ett bibliotek som exporterar en anpassad typ kan det vara vettigt att låta den typen anpassa sig själv. Som applikationsutvecklare kan det vara mer meningsfullt att ta direkt kontroll genom att registrera anpassade adapterfunktioner.

source: How to write adaptable objects
sv: Hur man skriver anpassningsbara objekt

source: Suppose we have a :class:`!Point` class that represents a pair of coordinates, ``x`` and ``y``, in a Cartesian coordinate system. The coordinate pair will be stored as a text string in the database, using a semicolon to separate the coordinates. This can be implemented by adding a ``__conform__(self, protocol)`` method which returns the adapted value. The object passed to *protocol* will be of type :class:`PrepareProtocol`.
sv: Antag att vi har en :class:`!Point`-klass som representerar ett par koordinater, ``x`` och ``y``, i ett kartesiskt koordinatsystem. Koordinatparet kommer att lagras som en textsträng i databasen, med ett semikolon för att separera koordinaterna. Detta kan implementeras genom att lägga till en metod ``__conform__(self, protocol)`` som returnerar det anpassade värdet. Objektet som skickas till *protocol* kommer att vara av typen :class:`PrepareProtocol`.

source: class Point: def __init__(self, x, y): self.x, self.y = x, y def __conform__(self, protocol): if protocol is sqlite3.PrepareProtocol: return f"{self.x};{self.y}" con = sqlite3.connect(":memory:") cur = con.cursor() cur.execute("SELECT ?", (Point(4.0, -3.2),)) print(cur.fetchone()[0]) con.close()
sv: klass Punkt: def __init__(self, x, y): self.x, self.y = x, y def __conform__(self, protokoll): om protokollet är sqlite3.PrepareProtocol: return f"{self.x};{self.y}" con = sqlite3.connect(":minne:") cur = con.cursor() cur.execute("SELECT ?",(Point(4.0, -3.2),)) print(cur.fetchone()[0]) con.stäng()

source: How to register adapter callables
sv: Så här registrerar du adapterkallelser

source: The other possibility is to create a function that converts the Python object to an SQLite-compatible type. This function can then be registered using :func:`register_adapter`.
sv: Den andra möjligheten är att skapa en funktion som konverterar Python-objektet till en SQLite-kompatibel typ. Denna funktion kan sedan registreras med hjälp av :func:`register_adapter`.

source: class Point: def __init__(self, x, y): self.x, self.y = x, y def adapt_point(point): return f"{point.x};{point.y}" sqlite3.register_adapter(Point, adapt_point) con = sqlite3.connect(":memory:") cur = con.cursor() cur.execute("SELECT ?", (Point(1.0, 2.5),)) print(cur.fetchone()[0]) con.close()
sv: klass Punkt: def __init__(self, x, y): self.x, self.y = x, y def adapt_point(punkt): return f"{point.x};{point.y}" sqlite3.register_adapter(Punkt, adapt_point) con = sqlite3.connect(":minne:") cur = con.cursor() cur.execute("SELECT ?", (Point(1.0, 2.5),)) print(cur.fetchone()[0]) con.stäng()

source: How to convert SQLite values to custom Python types
sv: Så här konverterar du SQLite-värden till anpassade Python-typer

source: Writing an adapter lets you convert *from* custom Python types *to* SQLite values. To be able to convert *from* SQLite values *to* custom Python types, we use *converters*.
sv: Genom att skriva en adapter kan du konvertera *från* anpassade Python-typer *till* SQLite-värden. För att kunna konvertera *från* SQLite-värden *till* anpassade Python-typer använder vi *konverterare*.

source: Let's go back to the :class:`!Point` class. We stored the x and y coordinates separated via semicolons as strings in SQLite.
sv: Låt oss gå tillbaka till :class:`!Point`-klassen. Vi lagrade x- och y-koordinaterna åtskilda med semikolon som strängar i SQLite.

source: First, we'll define a converter function that accepts the string as a parameter and constructs a :class:`!Point` object from it.
sv: Först definierar vi en konverteringsfunktion som tar emot en sträng som parameter och konstruerar ett :class:`!Point`-objekt från den.

source: Converter functions are **always** passed a :class:`bytes` object, no matter the underlying SQLite data type.
sv: Konverteringsfunktioner får **alltid** ett :class:`bytes`-objekt, oavsett den underliggande SQLite-datatypen.

source: def convert_point(s): x, y = map(float, s.split(b";")) return Point(x, y)
sv: def convert_point(s): x, y = map(float, s.split(b";")) return Punkt(x, y)

source: We now need to tell :mod:`!sqlite3` when it should convert a given SQLite value. This is done when connecting to a database, using the *detect_types* parameter of :func:`connect`. There are three options:
sv: Vi måste nu tala om för :mod:`!sqlite3` när den ska konvertera ett givet SQLite-värde. Detta görs när du ansluter till en databas, med hjälp av parametern *detect_types* i :func:`connect`. Det finns tre alternativ:

source: Implicit: set *detect_types* to :const:`PARSE_DECLTYPES`
sv: Implicit: sätt *detect_types* till :const:`PARSE_DECLTYPES`

source: Explicit: set *detect_types* to :const:`PARSE_COLNAMES`
sv: Explicit: sätt *detect_types* till :const:`PARSE_COLNAMES`

source: Both: set *detect_types* to ``sqlite3.PARSE_DECLTYPES | sqlite3.PARSE_COLNAMES``. Column names take precedence over declared types.
sv: Båda: sätt *detect_types* till ``sqlite3.PARSE_DECLTYPES | sqlite3.PARSE_COLNAMES``. Kolumnnamn har företräde framför deklarerade typer.

source: The following example illustrates the implicit and explicit approaches:
sv: Följande exempel illustrerar de implicita och explicita tillvägagångssätten:
