Repository: yeager/python-docs-sv
Catalog: library/sqlite3.po
Languages: sv

source: ``False``: Select :pep:`249`-compliant transaction behaviour, implying that :mod:`!sqlite3` ensures a transaction is always open. Use :meth:`commit` and :meth:`rollback` to close transactions.
sv: ``False``: Välj :pep:`249`-kompatibelt transaktionsbeteende, vilket innebär att :mod:`!sqlite3` säkerställer att en transaktion alltid är öppen. Använd :meth:`commit` och :meth:`rollback` för att stänga transaktioner.

source: This is the recommended value of :attr:`!autocommit`.
sv: Detta är det rekommenderade värdet för :attr:`!autocommit`.

source: ``True``: Use SQLite's `autocommit mode`_. :meth:`commit` and :meth:`rollback` have no effect in this mode.
sv: ``True``: Använd SQLites `autocommit-läge`_. :meth:`commit` och :meth:`rollback` har ingen effekt i detta läge.

source: :data:`LEGACY_TRANSACTION_CONTROL`: Pre-Python 3.12 (non-:pep:`249`-compliant) transaction control. See :attr:`isolation_level` for more details.
sv: :data:`LEGACY_TRANSACTION_CONTROL`: Pre-Python 3.12 (ej:pep:`249`-kompatibel) transaktionskontroll. Se :attr:`isolation_level` för mer information.

source: This is currently the default value of :attr:`!autocommit`.
sv: Detta är för närvarande standardvärdet för :attr:`!autocommit`.

source: Changing :attr:`!autocommit` to ``False`` will open a new transaction, and changing it to ``True`` will commit any pending transaction.
sv: Om du ändrar :attr:`!autocommit` till ``False`` öppnas en ny transaktion, och om du ändrar den till ``True`` bekräftas alla pågående transaktioner.

source: See :ref:`sqlite3-transaction-control-autocommit` for more details.
sv: Se :ref:`sqlite3-transaction-control-autocommit` för mer information.

source: The :attr:`isolation_level` attribute has no effect unless :attr:`autocommit` is :data:`LEGACY_TRANSACTION_CONTROL`.
sv: Attributet :attr:`isolation_level` har ingen effekt om inte :attr:`autocommit` är :data:`LEGACY_TRANSACTION_CONTROL`.

source: This read-only attribute corresponds to the low-level SQLite `autocommit mode`_.
sv: Detta skrivskyddade attribut motsvarar SQLites `autocommit mode`_ på låg nivå.

source: ``True`` if a transaction is active (there are uncommitted changes), ``False`` otherwise.
sv: ``True`` om en transaktion är aktiv (det finns ändringar som inte är bekräftade), ``False`` annars.

source: Controls the :ref:`legacy transaction handling mode <sqlite3-transaction-control-isolation-level>` of :mod:`!sqlite3`. If set to ``None``, transactions are never implicitly opened. If set to one of ``"DEFERRED"``, ``"IMMEDIATE"``, or ``"EXCLUSIVE"``, corresponding to the underlying `SQLite transaction behaviour`_, :ref:`implicit transaction management <sqlite3-transaction-control-isolation-level>` is performed.
sv: Styr :ref:``legacy transaktionshanteringsläge <sqlite3-transaction-control-isolation-level>`` för :mod:`!sqlite3`. Om inställningen är ``None`` öppnas aldrig transaktioner implicit. Om den är satt till en av ``"DEFERRED"``, ``"IMMEDIATE"``, eller ``"EXCLUSIVE"``, som motsvarar det underliggande `SQLite transaktionsbeteendet`_, utförs :ref:``implicit transaktionshantering <sqlite3-transaction-control-isolation-level>`.

source: If not overridden by the *isolation_level* parameter of :func:`connect`, the default is ``""``, which is an alias for ``"DEFERRED"``.
sv: Om den inte åsidosätts av parametern *isolation_level* i :func:`connect`, är standardvärdet ``""``, som är ett alias för ``"DEFERRED"``.

source: Using :attr:`autocommit` to control transaction handling is recommended over using :attr:`!isolation_level`. :attr:`!isolation_level` has no effect unless :attr:`autocommit` is set to :data:`LEGACY_TRANSACTION_CONTROL` (the default).
sv: Att använda :attr:`autocommit` för att styra transaktionshantering rekommenderas framför att använda :attr:`!isolation_level`. :attr:`!isolation_level` har ingen effekt om inte :attr:`autocommit` är inställd på :data:`LEGACY_TRANSACTION_CONTROL` (standard).

source: The initial :attr:`~Cursor.row_factory` for :class:`Cursor` objects created from this connection. Assigning to this attribute does not affect the :attr:`!row_factory` of existing cursors belonging to this connection, only new ones. Is ``None`` by default, meaning each row is returned as a :class:`tuple`.
sv: Det ursprungliga :attr:`~Cursor.row_factory` för :class:`Cursor`-objekt som skapas från den här anslutningen. Tilldelning av detta attribut påverkar inte :attr:`!row_factory` för befintliga markörer som tillhör denna anslutning, endast nya. Är ``None`` som standard, vilket innebär att varje rad returneras som en :class:`tuple`.

source: See :ref:`sqlite3-howto-row-factory` for more details.
sv: Se :ref:`sqlite3-howto-row-factory` för mer information.

source: A :term:`callable` that accepts a :class:`bytes` parameter and returns a text representation of it. The callable is invoked for SQLite values with the ``TEXT`` data type. By default, this attribute is set to :class:`str`.
sv: En :term:`callable` som accepterar en :class:`bytes` parameter och returnerar en textrepresentation av den. Den anropsbara funktionen anropas för SQLite-värden med datatypen ``TEXT``. Som standard är detta attribut inställt på :class:`str`.

source: See :ref:`sqlite3-howto-encoding` for more details.
sv: Se :ref:`sqlite3-howto-encoding` för mer information.

source: Return the total number of database rows that have been modified, inserted, or deleted since the database connection was opened.
sv: Returnerar det totala antalet databasrader som har ändrats, infogats eller tagits bort sedan databasanslutningen öppnades.

source: Cursor objects
sv: Cursor-objekt

source: A ``Cursor`` object represents a `database cursor`_ which is used to execute SQL statements, and manage the context of a fetch operation. Cursors are created using :meth:`Connection.cursor`, or by using any of the :ref:`connection shortcut methods <sqlite3-connection-shortcuts>`.
sv: Ett ``Cursor``-objekt representerar en ``databascursor`` som används för att exekvera SQL-satser och hantera kontexten för en hämtningsoperation. Cursors skapas med :meth:`Connection.cursor`, eller genom att använda någon av :ref:`connection shortcut methods <sqlite3-connection-shortcuts>`.

source: Cursor objects are :term:`iterators <iterator>`, meaning that if you :meth:`~Cursor.execute` a ``SELECT`` query, you can simply iterate over the cursor to fetch the resulting rows:
sv: Markörobjekt är :term:`iteratorer <iterator>`, vilket innebär att om du :meth:`~Cursor.execute` en ``SELECT``-fråga kan du helt enkelt iterera över markören för att hämta de resulterande raderna:

source: for row in cur.execute("SELECT t FROM data"): print(row)
sv: för rad i cur.execute("SELECT t FROM data"): print(rad)

source: A :class:`Cursor` instance has the following attributes and methods.
sv: En :class:`Cursor`-instans har följande attribut och metoder.

source: Execute a single SQL statement, optionally binding Python values using :ref:`placeholders <sqlite3-placeholders>`.
sv: Exekvera en enda SQL-sats och bind eventuellt Python-värden med hjälp av :ref:`placeholders <sqlite3-placeholders>`.

source: A single SQL statement.
sv: En enda SQL-sats.

source: Python values to bind to placeholders in *sql*. A :class:`!dict` if named placeholders are used. A :term:`!sequence` if unnamed placeholders are used. See :ref:`sqlite3-placeholders`.
sv: Python-värden att binda till platshållare i *sql*. En :class:`!dict` om namngivna platshållare används. En :term:`!sequence` om icke namngivna platshållare används. Se :ref:`sqlite3-platshållare`.

source: When *sql* contains more than one SQL statement. When :ref:`named placeholders <sqlite3-placeholders>` are used and *parameters* is a sequence instead of a :class:`dict`.
sv: När *sql* innehåller mer än en SQL-sats. När :ref:`named placeholders <sqlite3-placeholders>`` används och *parameters* är en sekvens istället för en :class:`dict`.

source: If :attr:`~Connection.autocommit` is :data:`LEGACY_TRANSACTION_CONTROL`, :attr:`~Connection.isolation_level` is not ``None``, *sql* is an ``INSERT``, ``UPDATE``, ``DELETE``, or ``REPLACE`` statement, and there is no open transaction, a transaction is implicitly opened before executing *sql*.
sv: Om :attr:`~Connection.autocommit` är :data:`LEGACY_TRANSACTION_CONTROL`, :attr:`~Connection.isolation_level` inte är ``None``, *sql* är en ``INSERT``, ``UPDATE``, ``DELETE`` eller ``REPLACE``-sats och det inte finns någon öppen transaktion, öppnas en transaktion implicit innan *sql* körs.

source: :exc:`ProgrammingError` is emitted if :ref:`named placeholders <sqlite3-placeholders>` are used and *parameters* is a sequence instead of a :class:`dict`.
sv: :exc:`ProgrammingError` sänds ut om :ref:``named placeholders <sqlite3-placeholders>`` används och *parameters* är en sekvens istället för en :class:`dict`.

source: Use :meth:`executescript` to execute multiple SQL statements.
sv: Använd :meth:`executescript` för att köra flera SQL-satser.

source: For every item in *parameters*, repeatedly execute the :ref:`parameterized <sqlite3-placeholders>` :abbr:`DML (Data Manipulation Language)` SQL statement *sql*.
sv: För varje objekt i *parameters*, kör upprepade gånger :ref:`parameterized <sqlite3-placeholders>` :abbr:`DML (Data Manipulation Language)` SQL-satsen *sql*.

source: Uses the same implicit transaction handling as :meth:`~Cursor.execute`.
sv: Använder samma implicita transaktionshantering som :meth:`~Cursor.execute`.

source: A single SQL DML statement.
sv: En enda SQL DML-sats.

source: An :term:`!iterable` of parameters to bind with the placeholders in *sql*. See :ref:`sqlite3-placeholders`.
sv: En :term:`!iterabel` av parametrar att binda med platshållarna i *sql*. Se :ref:`sqlite3-platshållare`.

source: When *sql* contains more than one SQL statement or is not a DML statement, When :ref:`named placeholders <sqlite3-placeholders>` are used and the items in *parameters* are sequences instead of :class:`dict`\s.
sv: När *sql* innehåller mer än en SQL-sats eller inte är en DML-sats, När :ref:`named placeholders <sqlite3-placeholders>` används och objekten i *parameters* är sekvenser istället för :class:`dict`.

source: rows = [ ("row1",), ("row2",), ] # cur is an sqlite3.Cursor object cur.executemany("INSERT INTO data VALUES(?)", rows)
sv: rader = [ ("rad1",), ("rad2",), ] # cur är ett sqlite3.cursor-objekt cur.executemany("INSERT INTO data VALUES(?)", rader)

source: Any resulting rows are discarded, including DML statements with `RETURNING clauses`_.
sv: Alla resulterande rader kasseras, inklusive DML-satser med `RETURNING-klausuler`_.

source: :exc:`ProgrammingError` is emitted if :ref:`named placeholders <sqlite3-placeholders>` are used and the items in *parameters* are sequences instead of :class:`dict`\s.
sv: :exc:`ProgrammingError` sänds ut om :ref:``namngivna platshållare <sqlite3-placeholders>`` används och objekten i *parameters* är sekvenser istället för :class:`dict`\s.

source: Execute the SQL statements in *sql_script*. If the :attr:`~Connection.autocommit` is :data:`LEGACY_TRANSACTION_CONTROL` and there is a pending transaction, an implicit ``COMMIT`` statement is executed first. No other implicit transaction control is performed; any transaction control must be added to *sql_script*.
sv: Exekvera SQL-satserna i *sql_script*. Om :attr:`~Connection.autocommit` är :data:`LEGACY_TRANSACTION_CONTROL` och det finns en väntande transaktion, körs en implicit ``COMMIT``-sats först. Ingen annan implicit transaktionskontroll utförs; eventuell transaktionskontroll måste läggas till i *sql_script*.

source: *sql_script* must be a :class:`string <str>`.
sv: *sql_script* måste vara en :class:`sträng <str>`.

source: # cur is an sqlite3.Cursor object cur.executescript(""" BEGIN; CREATE TABLE person(firstname, lastname, age); CREATE TABLE book(title, author, published); CREATE TABLE publisher(name, address); COMMIT; """)
sv: # cur är ett sqlite3.cursor-objekt cur.executescript(""" BEGIN; CREATE TABLE person(förnamn, efternamn, ålder); CREATE TABLE book(titel, författare, publicerad); CREATE TABLE publisher(namn, adress); COMMIT; """)

source: If :attr:`~Cursor.row_factory` is ``None``, return the next row query result set as a :class:`tuple`. Else, pass it to the row factory and return its result. Return ``None`` if no more data is available.
sv: Om :attr:`~Cursor.row_factory` är ``None``, returneras nästa resultatuppsättning för radfrågor som en :class:`tuple`. Annars skickas den till radfabriken och dess resultat returneras. Returnera ``None`` om inga fler data finns tillgängliga.

source: Return the next set of rows of a query result as a :class:`list`. Return an empty list if no more rows are available.
sv: Returnerar nästa uppsättning rader i ett frågeresultat som en :class:`list`. Returnerar en tom lista om inga fler rader är tillgängliga.

source: The number of rows to fetch per call is specified by the *size* parameter. If *size* is not given, :attr:`arraysize` determines the number of rows to be fetched. If fewer than *size* rows are available, as many rows as are available are returned.
sv: Antalet rader som ska hämtas per anrop specificeras av parametern *size*. Om *size* inte anges bestämmer :attr:`arraysize` antalet rader som ska hämtas. Om färre än *size* rader är tillgängliga returneras så många rader som är tillgängliga.

source: Note there are performance considerations involved with the *size* parameter. For optimal performance, it is usually best to use the arraysize attribute. If the *size* parameter is used, then it is best for it to retain the same value from one :meth:`fetchmany` call to the next.
sv: Observera att parametern *size* är förknippad med prestandafrågor. För optimal prestanda är det oftast bäst att använda arraysize-attributet. Om parametern *size* används är det bäst att den behåller samma värde från ett :meth:`fetchmany`-anrop till nästa.

source: Return all (remaining) rows of a query result as a :class:`list`. Return an empty list if no rows are available. Note that the :attr:`arraysize` attribute can affect the performance of this operation.
sv: Returnerar alla (återstående) rader i ett sökresultat som en :class:`list`. Returnerar en tom lista om inga rader är tillgängliga. Observera att attributet :attr:`arraysize` kan påverka prestandan för denna operation.

source: Close the cursor now (rather than whenever ``__del__`` is called).
sv: Stäng markören nu (i stället för när ``__del__`` anropas).

source: The cursor will be unusable from this point forward; a :exc:`ProgrammingError` exception will be raised if any operation is attempted with the cursor.
sv: Markören kommer att vara oanvändbar från och med nu; ett :exc:`ProgrammingError` undantag kommer att uppstå om någon operation försöker utföras med markören.

source: Required by the DB-API. Does nothing in :mod:`!sqlite3`.
sv: Krävs av DB-API. Gör ingenting i :mod:`!sqlite3`.

source: Read/write attribute that controls the number of rows returned by :meth:`fetchmany`. The default value is 1 which means a single row would be fetched per call.
sv: Läs-/skrivattribut som styr antalet rader som returneras av :meth:`fetchmany`. Standardvärdet är 1, vilket innebär att en enda rad hämtas per anrop.

source: Read-only attribute that provides the SQLite database :class:`Connection` belonging to the cursor. A :class:`Cursor` object created by calling :meth:`con.cursor() <Connection.cursor>` will have a :attr:`connection` attribute that refers to *con*:
sv: Skrivskyddat attribut som anger SQLite-databasen :class:`Connection` som hör till markören. Ett :class:`Cursor`-objekt som skapas genom anrop av :meth:`con.cursor() <Connection.cursor>` kommer att ha ett :attr:`connection`-attribut som hänvisar till *con*:

source: >>> con = sqlite3.connect(":memory:") >>> cur = con.cursor() >>> cur.connection == con True >>> con.close()
sv: >>> con = sqlite3.connect(":minne:") >>> cur = con.cursor() >>> cur.connection == con Sant >>> con.close()

source: Read-only attribute that provides the column names of the last query. To remain compatible with the Python DB API, it returns a 7-tuple for each column where the last six items of each tuple are ``None``.
sv: Skrivskyddat attribut som tillhandahåller kolumnnamnen för den senaste frågan. För att vara kompatibel med Python DB API returneras en 7-tupel för varje kolumn där de sex sista posterna i varje tupel är ``None``.

source: It is set for ``SELECT`` statements without any matching rows as well.
sv: Den är också inställd för ``SELECT``-satser utan några matchande rader.

source: Read-only attribute that provides the row id of the last inserted row. It is only updated after successful ``INSERT`` or ``REPLACE`` statements using the :meth:`execute` method. For other statements, after :meth:`executemany` or :meth:`executescript`, or if the insertion failed, the value of ``lastrowid`` is left unchanged. The initial value of ``lastrowid`` is ``None``.
sv: Skrivskyddat attribut som anger rad-id för den senast infogade raden. Det uppdateras endast efter lyckade ``INSERT`` eller ``REPLACE``-satser som använder metoden :meth:`execute`. För andra satser, efter :meth:`executemany` eller :meth:`executescript`, eller om infogningen misslyckades, lämnas värdet på ``lastrowid`` oförändrat. Det initiala värdet för ``lastrowid`` är ``None``.

source: Inserts into ``WITHOUT ROWID`` tables are not recorded.
sv: Insättningar i tabellerna ``WITHOUT ROWID`` registreras inte.

source: Added support for the ``REPLACE`` statement.
sv: Lagt till stöd för ``REPLACE``-satsen.

source: Read-only attribute that provides the number of modified rows for ``INSERT``, ``UPDATE``, ``DELETE``, and ``REPLACE`` statements; is ``-1`` for other statements, including :abbr:`CTE (Common Table Expression)` queries. It is only updated by the :meth:`execute` and :meth:`executemany` methods, after the statement has run to completion. This means that any resulting rows must be fetched in order for :attr:`!rowcount` to be updated.
sv: Skrivskyddat attribut som anger antalet ändrade rader för ``INSERT``, ``UPDATE``, ``DELETE`` och ``REPLACE``-satser; är ``-1`` för andra satser, inklusive :abbr:`CTE (Common Table Expression)`-frågor. Den uppdateras endast av metoderna :meth:`execute` och :meth:`executemany` efter att satsen har körts färdigt. Detta innebär att alla resulterande rader måste hämtas för att :attr:`!rowcount` ska kunna uppdateras.

source: Control how a row fetched from this :class:`!Cursor` is represented. If ``None``, a row is represented as a :class:`tuple`. Can be set to the included :class:`sqlite3.Row`; or a :term:`callable` that accepts two arguments, a :class:`Cursor` object and the :class:`!tuple` of row values, and returns a custom object representing an SQLite row.
sv: Styr hur en rad som hämtas från denna :class:`!Cursor` representeras. Om ``None`` representeras en rad som en :class:`tuple`. Kan sättas till den inkluderade :class:`sqlite3.Row`; eller en :term:`callable` som accepterar två argument, ett :class:`Cursor`-objekt och :class:`!tuple` av radvärden, och returnerar ett anpassat objekt som representerar en SQLite-rad.

source: Defaults to what :attr:`Connection.row_factory` was set to when the :class:`!Cursor` was created. Assigning to this attribute does not affect :attr:`Connection.row_factory` of the parent connection.
sv: Standardvärdet är det värde som :attr:`Connection.row_factory` angavs till när :class:`!Cursor` skapades. Tilldelning av detta attribut påverkar inte :attr:`Connection.row_factory` för den överordnade anslutningen.

source: Row objects
sv: Radobjekt

source: A :class:`!Row` instance serves as a highly optimized :attr:`~Connection.row_factory` for :class:`Connection` objects. It supports iteration, equality testing, :func:`len`, and :term:`mapping` access by column name and index.
sv: En :class:`!Row`-instans fungerar som en mycket optimerad :attr:`~Connection.row_factory` för :class:`Connection`-objekt. Den stöder iteration, jämlikhetstestning, :func:`len` och :term:`mapping`-åtkomst via kolumnnamn och index.

source: Two :class:`!Row` objects compare equal if they have identical column names and values.
sv: Två :class:`!Row`-objekt jämförs lika om de har identiska kolumnnamn och värden.

source: Return a :class:`list` of column names as :class:`strings <str>`. Immediately after a query, it is the first member of each tuple in :attr:`Cursor.description`.
sv: Returnerar en :class:`lista` med kolumnnamn som :class:`strängar <str>`. Omedelbart efter en fråga är det den första medlemmen i varje tupel i :attr:`Cursor.description`.

source: Added support of slicing.
sv: Lagt till stöd för skivning.

source: Blob objects
sv: Blob-objekt

source: A :class:`Blob` instance is a :term:`file-like object` that can read and write data in an SQLite :abbr:`BLOB (Binary Large OBject)`. Call :func:`len(blob) <len>` to get the size (number of bytes) of the blob. Use indices and :term:`slices <slice>` for direct access to the blob data.
sv: En instans av :class:`Blob` är ett :term:`filliknande objekt` som kan läsa och skriva data i en SQLite :abbr:`BLOB (Binary Large OBject)`. Anropa :func:`len(blob) <len>` för att få storleken (antal byte) på blobben. Använd index och :term:`slices <slice>` för direktåtkomst till blob-data.

source: Use the :class:`Blob` as a :term:`context manager` to ensure that the blob handle is closed after use.
sv: Använd :class:`Blob` som en :term:`context manager` för att säkerställa att blob-handtaget stängs efter användning.

source: con = sqlite3.connect(":memory:") con.execute("CREATE TABLE test(blob_col blob)") con.execute("INSERT INTO test(blob_col) VALUES(zeroblob(13))") # Write to our blob, using two write operations: with con.blobopen("test", "blob_col", 1) as blob: blob.write(b"hello, ") blob.write(b"world.") # Modify the first and last bytes of our blob blob[0] = ord("H") blob[-1] = ord("!") # Read the contents of our blob with con.blobopen("test", "blob_col", 1) as blob: greeting = blob.read() print(greeting) # outputs "b'Hello, world!'" con.close()
sv: con = sqlite3.connect(":minne:") con.execute("CREATE TABLE test(blob_col blob)") con.execute("INSERT INTO test(blob_col) VALUES(zeroblob(13))") # Skriv till vår blob med hjälp av två skrivoperationer: med con.blobopen("test", "blob_col", 1) som blob: blob.write(b"hej, ") blob.write(b"värld.") # Ändra den första och sista byten i vår blob blob[0] = ord("H") blob[-1] = ord("!") # Läs innehållet i vår blob med con.blobopen("test", "blob_col", 1) som blob: hälsning = blob.read() print(hälsning) # utdata "b'Hello, world!'" con.close()

source: Close the blob.
sv: Stäng blobben.

source: The blob will be unusable from this point onward. An :class:`~sqlite3.Error` (or subclass) exception will be raised if any further operation is attempted with the blob.
sv: Blobben kommer att vara oanvändbar från denna punkt och framåt. Ett :class:`~sqlite3.Error` (eller underklass) undantag kommer att utlösas om någon ytterligare operation försöker utföras med blobben.

source: Read *length* bytes of data from the blob at the current offset position. If the end of the blob is reached, the data up to :abbr:`EOF (End of File)` will be returned. When *length* is not specified, or is negative, :meth:`~Blob.read` will read until the end of the blob.
sv: Läser *längd* byte data från blobben vid aktuell offsetposition. Om slutet av blobben nås, kommer data upp till :abbr:`EOF (End of File)` att returneras. Om *längd* inte specificeras eller är negativ, kommer :meth:`~Blob.read` att läsa till slutet av blobben.
