Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: The SSL context created above will only allow TLSv1.3 and later (if supported by your system) connections to a server. :const:`PROTOCOL_TLS_CLIENT` implies certificate validation and hostname checks by default. You have to load certificates into the context.
sv: SSL-kontexten som skapades ovan tillåter endast TLSv1.3 och senare (om det stöds av ditt system) anslutningar till en server. :const:`PROTOCOL_TLS_CLIENT` innebär certifikatvalidering och värdnamnskontroller som standard. Du måste ladda certifikat i kontexten.

source: Cipher selection
sv: Val av chiffer

source: If you have advanced security requirements, fine-tuning of the ciphers enabled when negotiating a SSL session is possible through the :meth:`SSLContext.set_ciphers` method. Starting from Python 3.2.3, the ssl module disables certain weak ciphers by default, but you may want to further restrict the cipher choice. Be sure to read OpenSSL's documentation about the `cipher list format <https://docs.openssl.org/1.1.1/man1/ciphers/#cipher-list-format>`_. If you want to check which ciphers are enabled by a given cipher list, use :meth:`SSLContext.get_ciphers` or the ``openssl ciphers`` command on your system.
sv: Om du har avancerade säkerhetskrav är det möjligt att finjustera de chiffer som aktiveras när du förhandlar om en SSL-session genom metoden :meth:`SSLContext.set_ciphers`. Från och med Python 3.2.3 inaktiverar ssl-modulen vissa svaga chiffer som standard, men du kanske vill begränsa valet av chiffer ytterligare. Se till att läsa OpenSSL:s dokumentation om formatet för `cipher list <https://docs.openssl.org/1.1.1/man1/ciphers/#cipher-list-format>`_. Om du vill kontrollera vilka chiffer som aktiveras av en viss chifferlista, använd :meth:`SSLContext.get_ciphers` eller kommandot ``openssl ciphers`` på ditt system.

source: If using this module as part of a multi-processed application (using, for example the :mod:`multiprocessing` or :mod:`concurrent.futures` modules), be aware that OpenSSL's internal random number generator does not properly handle forked processes. Applications must change the PRNG state of the parent process if they use any SSL feature with :func:`os.fork`. Any successful call of :func:`~ssl.RAND_add` or :func:`~ssl.RAND_bytes` is sufficient.
sv: Om du använder den här modulen som en del av ett program med flera processer (t.ex. med modulerna :mod:`multiprocessing` eller :mod:`concurrent.futures`), bör du vara medveten om att OpenSSL:s interna slumptalsgenerator inte hanterar förgrenade processer på rätt sätt. Program måste ändra PRNG-tillståndet för den överordnade processen om de använder någon SSL-funktion med :func:`os.fork`. Varje lyckat anrop av :func:`~ssl.RAND_add` eller :func:`~ssl.RAND_bytes` är tillräckligt.

source: The TLS 1.3 protocol behaves slightly differently than previous version of TLS/SSL. Some new TLS 1.3 features are not yet available.
sv: Protokollet TLS 1.3 beter sig något annorlunda än tidigare versioner av TLS/SSL. Vissa nya funktioner i TLS 1.3 är ännu inte tillgängliga.

source: TLS 1.3 uses a disjunct set of cipher suites. All AES-GCM and ChaCha20 cipher suites are enabled by default. The method :meth:`SSLContext.set_ciphers` cannot enable or disable any TLS 1.3 ciphers yet, but :meth:`SSLContext.get_ciphers` returns them.
sv: TLS 1.3 använder en disjunkt uppsättning chiffersviter. Alla AES-GCM- och ChaCha20-chiffersviter är aktiverade som standard. Metoden :meth:`SSLContext.set_ciphers` kan inte aktivera eller inaktivera några TLS 1.3-chiffer ännu, men :meth:`SSLContext.get_ciphers` returnerar dem.

source: Session tickets are no longer sent as part of the initial handshake and are handled differently. :attr:`SSLSocket.session` and :class:`SSLSession` are not compatible with TLS 1.3.
sv: Sessionsbiljetter skickas inte längre som en del av den inledande handskakningen och hanteras annorlunda. :attr:`SSLSocket.session` och :class:`SSLSession` är inte kompatibla med TLS 1.3.

source: Client-side certificates are also no longer verified during the initial handshake. A server can request a certificate at any time. Clients process certificate requests while they send or receive application data from the server.
sv: Certifikat på klientsidan verifieras inte heller längre under den första handskakningen. En server kan begära ett certifikat när som helst. Klienter behandlar certifikatbegäran medan de skickar eller tar emot programdata från servern.

source: TLS 1.3 features like early data, deferred TLS client cert request, signature algorithm configuration, and rekeying are not supported yet.
sv: TLS 1.3-funktioner som tidig data, uppskjuten begäran om TLS-klientcertifikat, konfiguration av signaturalgoritm och omkodning stöds inte ännu.

source: Class :class:`socket.socket`
sv: Klass :class:`socket.socket`

source: Documentation of underlying :mod:`socket` class
sv: Dokumentation av den underliggande :mod:`socket`-klassen

source: `SSL/TLS Strong Encryption: An Introduction <https://httpd.apache.org/docs/trunk/en/ssl/ssl_intro.html>`_
sv: `SSL/TLS Stark Kryptering: En introduktion <https://httpd.apache.org/docs/trunk/en/ssl/ssl_intro.html>`_

source: Intro from the Apache HTTP Server documentation
sv: Intro från dokumentationen för Apache HTTP Server

source: :rfc:`RFC 1422: Privacy Enhancement for Internet Electronic Mail: Part II: Certificate-Based Key Management <1422>`
sv: :rfc:`RFC 1422: Förbättrad sekretess för elektronisk post på Internet: Part II: Certificate-Based Key Management <1422>`

source: :rfc:`RFC 4086: Randomness Requirements for Security <4086>`
sv: :rfc:`RFC 4086: Slumpmässighetskrav för säkerhet <4086>`

source: :rfc:`RFC 5280: Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile <5280>`
sv: :rfc:`RFC 5280: Profil för Internet X.509 Public Key Infrastructure-certifikat och lista över återkallade certifikat (CRL) <5280>`

source: :rfc:`RFC 5246: The Transport Layer Security (TLS) Protocol Version 1.2 <5246>`
sv: :rfc:`RFC 5246: TLS-protokollet (Transport Layer Security) version 1.2 <5246>`

source: :rfc:`RFC 6066: Transport Layer Security (TLS) Extensions <6066>`
sv: :rfc:`RFC 6066: TLS-tillägg (Transport Layer Security) <6066>`

source: `IANA TLS: Transport Layer Security (TLS) Parameters <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml>`_
sv: `IANA TLS: Parametrar för TLS (Transport Layer Security) <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml>`_

source: :rfc:`RFC 7525: Recommendations for Secure Use of Transport Layer Security (TLS) and Datagram Transport Layer Security (DTLS) <7525>`
sv: :rfc:``RFC 7525: Rekommendationer för säker användning av TLS (Transport Layer Security) och DTLS (Datagram Transport Layer Security) <7525>`

source: `Mozilla's Server Side TLS recommendations <https://wiki.mozilla.org/Security/Server_Side_TLS>`_
sv: mozillas TLS-rekommendationer för serversidan <https://wiki.mozilla.org/Security/Server_Side_TLS>`_

source: (use in module ssl)
sv: (används i modul ssl)

source: certificates
sv: certifikat

source: X509 certificate
sv: X509-certifikat
