Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: The parameter ``callback`` is a callable object with the signature: ``def callback(hint: str | None) -> tuple[str | None, bytes]``. The ``hint`` parameter is an optional identity hint sent by the server. The return value is a tuple in the form (client-identity, psk). Client-identity is an optional string which may be used by the server to select a corresponding PSK for the client. The string must be less than or equal to ``256`` octets when UTF-8 encoded. PSK is a :term:`bytes-like object` representing the pre-shared key. Return a zero length PSK to reject the connection.
sv: Parametern ``callback`` är ett anropbart objekt med signaturen: ``def callback(hint: str | None) -> tuple[str | None, bytes]``. Parametern ``hint`` är en valfri identitetshint som skickas av servern. Returvärdet är en tupel i formen (client-identity, psk). Client-identity är en valfri sträng som kan användas av servern för att välja en motsvarande PSK för klienten. Strängen måste vara mindre än eller lika med ``256`` oktetter när den är UTF-8-kodad. PSK är ett :term:`bytesliknande objekt` som representerar den fördelade nyckeln. Returnera en PSK med längden noll för att avvisa anslutningen.

source: Setting ``callback`` to :const:`None` removes any existing callback.
sv: Om ``callback`` sätts till :const:`None` tas alla befintliga callbacks bort.

source: When using TLS 1.3:
sv: När du använder TLS 1.3:

source: the ``hint`` parameter is always :const:`None`.
sv: parametern ``hint`` är alltid :const:`None`.

source: client-identity must be a non-empty string.
sv: client-identity måste vara en icke-tom sträng.

source: Example usage::
sv: Exempel på användning::

source: context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.check_hostname = False context.verify_mode = ssl.CERT_NONE context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # A simple lambda: psk = bytes.fromhex('c0ffee') context.set_psk_client_callback(lambda hint: (None, psk)) # A table using the hint from the server: psk_table = { 'ServerId_1': bytes.fromhex('c0ffee'), 'ServerId_2': bytes.fromhex('facade') } def callback(hint): return 'ClientId_1', psk_table.get(hint, b'') context.set_psk_client_callback(callback)
sv: context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.check_hostname = False context.verify_mode = ssl.CERT_NONE context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # En enkel lambda: psk = bytes.fromhex('c0ffee') context.set_psk_client_callback(lambda hint: (None, psk)) # En tabell med hjälp av ledtråden från servern: psk_table = { 'ServerId_1': bytes.fromhex('c0ffee'), 'ServerId_2': bytes.fromhex('fasad') } def återuppringning(hint): return 'ClientId_1', psk_table.get(hint, b'') context.set_psk_client_callback(callback)

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_PSK` is ``False``.
sv: Denna metod ger upphov till :exc:`NotImplementedError` om :data:`HAS_PSK` är ``False``.

source: Enables TLS-PSK (pre-shared key) authentication on a server-side connection.
sv: Aktiverar TLS-PSK-autentisering (pre-shared key) för en anslutning på serversidan.

source: The parameter ``callback`` is a callable object with the signature: ``def callback(identity: str | None) -> bytes``. The ``identity`` parameter is an optional identity sent by the client which can be used to select a corresponding PSK. The return value is a :term:`bytes-like object` representing the pre-shared key. Return a zero length PSK to reject the connection.
sv: Parametern ``callback`` är ett anropbart objekt med signaturen: ``def callback(identity: str | None) -> bytes``. Parametern ``identity`` är en valfri identitet som skickas av klienten och som kan användas för att välja en motsvarande PSK. Returvärdet är ett :term:`bytesliknande objekt` som representerar den fördelade nyckeln. Returnera en PSK med noll längd för att avvisa anslutningen.

source: The parameter ``identity_hint`` is an optional identity hint string sent to the client. The string must be less than or equal to ``256`` octets when UTF-8 encoded.
sv: Parametern ``identity_hint`` är en valfri identitetshintsträng som skickas till klienten. Strängen måste vara mindre än eller lika med ``256`` oktetter när den är UTF-8-kodad.

source: When using TLS 1.3 the ``identity_hint`` parameter is not sent to the client.
sv: Vid användning av TLS 1.3 skickas inte parametern ``identity_hint`` till klienten.

source: context = ssl.SSLContext(ssl.PROTOCOL_TLS_SERVER) context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # A simple lambda: psk = bytes.fromhex('c0ffee') context.set_psk_server_callback(lambda identity: psk) # A table using the identity of the client: psk_table = { 'ClientId_1': bytes.fromhex('c0ffee'), 'ClientId_2': bytes.fromhex('facade') } def callback(identity): return psk_table.get(identity, b'') context.set_psk_server_callback(callback, 'ServerId_1')
sv: context = ssl.SSLContext(ssl.PROTOCOL_TLS_SERVER) context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # En enkel lambda: psk = bytes.fromhex('c0ffee') context.set_psk_server_callback(lambda identitet: psk) # En tabell som använder klientens identitet: psk_table = { 'ClientId_1': bytes.fromhex('c0ffee'), 'ClientId_2': bytes.fromhex('facade') } def callback(identitet): return psk_table.get(identitet, b'') context.set_psk_server_callback(callback, 'ServerId_1')

source: Certificates
sv: Diplom

source: Certificates in general are part of a public-key / private-key system. In this system, each *principal*, (which may be a machine, or a person, or an organization) is assigned a unique two-part encryption key. One part of the key is public, and is called the *public key*; the other part is kept secret, and is called the *private key*. The two parts are related, in that if you encrypt a message with one of the parts, you can decrypt it with the other part, and **only** with the other part.
sv: Certifikat är i allmänhet en del av ett system med offentliga nycklar och privata nycklar. I detta system tilldelas varje *principal* (som kan vara en maskin, en person eller en organisation) en unik krypteringsnyckel i två delar. Den ena delen av nyckeln är offentlig och kallas *public key*; den andra delen hålls hemlig och kallas *private key*. De två delarna är relaterade på så sätt att om man krypterar ett meddelande med den ena delen kan man dekryptera det med den andra delen, och **endast** med den andra delen.

source: A certificate contains information about two principals. It contains the name of a *subject*, and the subject's public key. It also contains a statement by a second principal, the *issuer*, that the subject is who they claim to be, and that this is indeed the subject's public key. The issuer's statement is signed with the issuer's private key, which only the issuer knows. However, anyone can verify the issuer's statement by finding the issuer's public key, decrypting the statement with it, and comparing it to the other information in the certificate. The certificate also contains information about the time period over which it is valid. This is expressed as two fields, called "notBefore" and "notAfter".
sv: Ett certifikat innehåller information om två huvudmän. Det innehåller namnet på en *subjekt* och subjektets publika nyckel. Det innehåller också ett uttalande från en andra huvudman, *utfärdaren*, om att subjektet är den hen utger sig för att vara och att detta verkligen är subjektets publika nyckel. Utfärdarens uttalande är signerat med utfärdarens privata nyckel, som endast utfärdaren känner till. Vem som helst kan dock verifiera utfärdarens uttalande genom att hitta utfärdarens publika nyckel, dekryptera uttalandet med den och jämföra det med den övriga informationen i certifikatet. Certifikatet innehåller också information om den tidsperiod under vilken det är giltigt. Detta uttrycks som två fält, kallade "notBefore" och "notAfter".

source: In the Python use of certificates, a client or server can use a certificate to prove who they are. The other side of a network connection can also be required to produce a certificate, and that certificate can be validated to the satisfaction of the client or server that requires such validation. The connection attempt can be set to raise an exception if the validation fails. Validation is done automatically, by the underlying OpenSSL framework; the application need not concern itself with its mechanics. But the application does usually need to provide sets of certificates to allow this process to take place.
sv: I Python-användningen av certifikat kan en klient eller server använda ett certifikat för att bevisa vem de är. Den andra sidan av en nätverksanslutning kan också krävas på ett certifikat, och det certifikatet kan valideras på ett sätt som tillfredsställer den klient eller server som kräver sådan validering. Anslutningsförsöket kan ställas in så att ett undantag utlöses om valideringen misslyckas. Valideringen görs automatiskt av det underliggande OpenSSL-ramverket och applikationen behöver inte bekymra sig om hur det fungerar. Men applikationen behöver vanligtvis tillhandahålla uppsättningar av certifikat för att denna process ska kunna äga rum.

source: Python uses files to contain certificates. They should be formatted as "PEM" (see :rfc:`1422`), which is a base-64 encoded form wrapped with a header line and a footer line::
sv: Python använder filer för att innehålla certifikat. De bör formateras som "PEM" (se :rfc:`1422`), vilket är en bas-64-kodad form omsluten av en rubrikrad och en sidfot:

source: -----BEGIN CERTIFICATE----- ... (certificate in base64 PEM encoding) ... -----END CERTIFICATE-----
sv: -----BEGIN CERTIFIKAT----- ... (certifikat i base64 PEM-kodning) ... -----SLUTA CERTIFIKAT-----

source: Certificate chains
sv: Certifikatkedjor

source: The Python files which contain certificates can contain a sequence of certificates, sometimes called a *certificate chain*. This chain should start with the specific certificate for the principal who "is" the client or server, and then the certificate for the issuer of that certificate, and then the certificate for the issuer of *that* certificate, and so on up the chain till you get to a certificate which is *self-signed*, that is, a certificate which has the same subject and issuer, sometimes called a *root certificate*. The certificates should just be concatenated together in the certificate file. For example, suppose we had a three certificate chain, from our server certificate to the certificate of the certification authority that signed our server certificate, to the root certificate of the agency which issued the certification authority's certificate::
sv: De Python-filer som innehåller certifikat kan innehålla en sekvens av certifikat, ibland kallad en *certifikatkedja*. Denna kedja bör börja med det specifika certifikatet för den principal som "är" klienten eller servern, och sedan certifikatet för utfärdaren av det certifikatet, och sedan certifikatet för utfärdaren av *det* certifikatet, och så vidare upp i kedjan tills man kommer till ett certifikat som är *självsignerat*, det vill säga ett certifikat som har samma subject och utfärdare, ibland kallat ett *rotcertifikat*. Certifikaten ska bara sammankopplas i certifikatfilen. Anta till exempel att vi har en kedja med tre certifikat, från vårt servercertifikat till certifikatet för den certifikatutfärdare som signerade vårt servercertifikat, till rotcertifikatet för den myndighet som utfärdade certifikatutfärdarens certifikat::

source: -----BEGIN CERTIFICATE----- ... (certificate for your server)... -----END CERTIFICATE----- -----BEGIN CERTIFICATE----- ... (the certificate for the CA)... -----END CERTIFICATE----- -----BEGIN CERTIFICATE----- ... (the root certificate for the CA's issuer)... -----END CERTIFICATE-----
sv: -----BÖRJA CERTIFIKAT----- ... (certifikat för din server) ... -----AVSLUTA CERTIFIKAT----- -----BÖRJAR CERTIFIKAT----- ... (certifikatet för CA) ... -----AVSLUTA CERTIFIKAT----- -----BÖRJAR CERTIFIKAT----- ... (rotcertifikatet för CA:s utfärdare)... -----AVSLUTA CERTIFIKAT-----

source: CA certificates
sv: CA-certifikat

source: If you are going to require validation of the other side of the connection's certificate, you need to provide a "CA certs" file, filled with the certificate chains for each issuer you are willing to trust. Again, this file just contains these chains concatenated together. For validation, Python will use the first chain it finds in the file which matches. The platform's certificates file can be used by calling :meth:`SSLContext.load_default_certs`, this is done automatically with :func:`.create_default_context`.
sv: Om du ska kräva validering av den andra sidan av anslutningens certifikat måste du tillhandahålla en "CA certs"-fil, fylld med certifikatkedjorna för varje utfärdare som du är villig att lita på. Återigen innehåller den här filen bara dessa kedjor sammankopplade tillsammans. För validering kommer Python att använda den första kedjan som den hittar i filen som matchar. Plattformens certifikatfil kan användas genom att anropa :meth:`SSLContext.load_default_certs`, detta görs automatiskt med :func:`.create_default_context`.

source: Combined key and certificate
sv: Kombinerad nyckel och certifikat

source: Often the private key is stored in the same file as the certificate; in this case, only the ``certfile`` parameter to :meth:`SSLContext.load_cert_chain` needs to be passed. If the private key is stored with the certificate, it should come before the first certificate in the certificate chain::
sv: Ofta lagras den privata nyckeln i samma fil som certifikatet; i detta fall behöver endast parametern ``certfile`` till :meth:`SSLContext.load_cert_chain` skickas. Om den privata nyckeln lagras med certifikatet bör den komma före det första certifikatet i certifikatkedjan::

source: -----BEGIN RSA PRIVATE KEY----- ... (private key in base64 encoding) ... -----END RSA PRIVATE KEY----- -----BEGIN CERTIFICATE----- ... (certificate in base64 PEM encoding) ... -----END CERTIFICATE-----
sv: -----BEGIN RSA PRIVAT NYCKEL----- ... (privat nyckel i base64-kodning) ... -----AVSLUTA RSA PRIVAT NYCKEL----- -----BEGIN CERTIFIKAT----- ... (certifikat i base64 PEM-kodning) ... -----AVSLUTA CERTIFIKAT-----

source: Self-signed certificates
sv: Självsignerade certifikat

source: If you are going to create a server that provides SSL-encrypted connection services, you will need to acquire a certificate for that service. There are many ways of acquiring appropriate certificates, such as buying one from a certification authority. Another common practice is to generate a self-signed certificate. The simplest way to do this is with the OpenSSL package, using something like the following::
sv: Om du ska skapa en server som tillhandahåller SSL-krypterade anslutningstjänster måste du skaffa ett certifikat för den tjänsten. Det finns många sätt att skaffa lämpliga certifikat, t.ex. genom att köpa ett från en certifikatutfärdare. Ett annat vanligt sätt är att skapa ett självsignerat certifikat. Det enklaste sättet att göra detta är med OpenSSL-paketet, genom att använda något i stil med följande::

source: % openssl req -new -x509 -days 365 -nodes -out cert.pem -keyout cert.pem Generating a 1024 bit RSA private key .......++++++ .............................++++++ writing new private key to 'cert.pem' ----- You are about to be asked to enter information that will be incorporated into your certificate request. What you are about to enter is what is called a Distinguished Name or a DN. There are quite a few fields but you can leave some blank For some fields there will be a default value, If you enter '.', the field will be left blank. ----- Country Name (2 letter code) [AU]:US State or Province Name (full name) [Some-State]:MyState Locality Name (eg, city) []:Some City Organization Name (eg, company) [Internet Widgits Pty Ltd]:My Organization, Inc. Organizational Unit Name (eg, section) []:My Group Common Name (eg, YOUR name) []:myserver.mygroup.myorganization.com Email Address []:ops@myserver.mygroup.myorganization.com %
sv: % openssl req -new -x509 -days 365 -nodes -out cert.pem -keyout cert.pem Generera en 1024 bitars RSA privat nyckel .......++++++ .............................++++++ skriver ny privat nyckel till 'cert.pem' ----- Du kommer nu att bli ombedd att ange information som kommer att ingå i din certifikatbegäran. Det du ska ange är vad som kallas ett Distinguished Name eller en DN. Det finns ganska många fält, men du kan lämna vissa tomma För vissa fält finns det ett standardvärde, Om du anger '.' lämnas fältet tomt. ----- Landsnamn (2-bokstavskod) [AU]:US Delstatens eller provinsens namn (fullständigt namn) [Some-State]:MyState Namn på lokalitet (t.ex. stad) []:Some City Organisationsnamn (t.ex. företag) [Internet Widgits Pty Ltd]:My Organization, Inc. Namn på organisatorisk enhet (t.ex. sektion) []:My Group Gemensamt namn (t.ex. ditt namn) []:myserver.mygroup.myorganization.com E-postadress []:ops@myserver.mygroup.myorganization.com %

source: The disadvantage of a self-signed certificate is that it is its own root certificate, and no one else will have it in their cache of known (and trusted) root certificates.
sv: Nackdelen med ett självsignerat certifikat är att det är ett eget rotcertifikat, och ingen annan kommer att ha det i sin cache av kända (och betrodda) rotcertifikat.

source: Examples
sv: Exempel

source: Testing for SSL support
sv: Testning för SSL-stöd

source: To test for the presence of SSL support in a Python installation, user code should use the following idiom::
sv: För att testa om det finns SSL-stöd i en Python-installation bör användarkoden använda följande idiom::

source: Client-side operation
sv: Operation på klientsidan

source: This example creates a SSL context with the recommended security settings for client sockets, including automatic certificate verification::
sv: I detta exempel skapas en SSL-kontext med rekommenderade säkerhetsinställningar för klientsocklar, inklusive automatisk certifikatverifiering::

source: >>> context = ssl.create_default_context()
sv: >>> kontext = ssl.create_default_context()

source: If you prefer to tune security settings yourself, you might create a context from scratch (but beware that you might not get the settings right)::
sv: Om du föredrar att göra säkerhetsinställningarna själv kan du skapa ett sammanhang från början (men tänk på att du kanske inte får rätt inställningar)::

source: (this snippet assumes your operating system places a bundle of all CA certificates in ``/etc/ssl/certs/ca-bundle.crt``; if not, you'll get an error and have to adjust the location)
sv: (detta utdrag förutsätter att ditt operativsystem placerar ett paket med alla CA-certifikat i ``/etc/ssl/certs/ca-bundle.crt``; om inte, får du ett fel och måste justera platsen)

source: The :data:`PROTOCOL_TLS_CLIENT` protocol configures the context for cert validation and hostname verification. :attr:`~SSLContext.verify_mode` is set to :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` is set to ``True``. All other protocols create SSL contexts with insecure defaults.
sv: Protokollet :data:`PROTOCOL_TLS_CLIENT` konfigurerar kontexten för validering av certifikat och verifiering av värdnamn. :attr:`~SSLContext.verify_mode` är inställd på :data:`CERT_REQUIRED` och :attr:`~SSLContext.check_hostname` är inställd på ``True``. Alla andra protokoll skapar SSL-kontexter med osäkra standardvärden.

source: When you use the context to connect to a server, :const:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` validate the server certificate: it ensures that the server certificate was signed with one of the CA certificates, checks the signature for correctness, and verifies other properties like validity and identity of the hostname::
sv: När du använder kontexten för att ansluta till en server validerar :const:`CERT_REQUIRED` och :attr:`~SSLContext.check_hostname` servercertifikatet: det säkerställer att servercertifikatet har signerats med ett av CA-certifikaten, kontrollerar att signaturen är korrekt och verifierar andra egenskaper som giltighet och identitet för värdnamnet::

source: You may then fetch the certificate::
sv: Du kan då hämta ut certifikatet::

source: Visual inspection shows that the certificate does identify the desired service (that is, the HTTPS host ``www.python.org``)::
sv: En visuell kontroll visar att certifikatet identifierar den önskade tjänsten (dvs. HTTPS-värden ``www.python.org``)::

source: >>> pprint.pprint(cert) {'OCSP': ('http://ocsp.digicert.com',), 'caIssuers': ('http://cacerts.digicert.com/DigiCertSHA2ExtendedValidationServerCA.crt',), 'crlDistributionPoints': ('http://crl3.digicert.com/sha2-ev-server-g1.crl', 'http://crl4.digicert.com/sha2-ev-server-g1.crl'), 'issuer': ((('countryName', 'US'),), (('organizationName', 'DigiCert Inc'),), (('organizationalUnitName', 'www.digicert.com'),), (('commonName', 'DigiCert SHA2 Extended Validation Server CA'),)), 'notAfter': 'Sep 9 12:00:00 2016 GMT', 'notBefore': 'Sep 5 00:00:00 2014 GMT', 'serialNumber': '01BB6F00122B177F36CAB49CEA8B6B26', 'subject': ((('businessCategory', 'Private Organization'),), (('1.3.6.1.4.1.311.60.2.1.3', 'US'),), (('1.3.6.1.4.1.311.60.2.1.2', 'Delaware'),), (('serialNumber', '3359300'),), (('streetAddress', '16 Allen Rd'),), (('postalCode', '03894-4801'),), (('countryName', 'US'),), (('stateOrProvinceName', 'NH'),), (('localityName', 'Wolfeboro'),), (('organizationName', 'Python Software Foundation'),), (('commonName', 'www.python.org'),)), 'subjectAltName': (('DNS', 'www.python.org'), ('DNS', 'python.org'), ('DNS', 'pypi.org'), ('DNS', 'docs.python.org'), ('DNS', 'testpypi.org'), ('DNS', 'bugs.python.org'), ('DNS', 'wiki.python.org'), ('DNS', 'hg.python.org'), ('DNS', 'mail.python.org'), ('DNS', 'packaging.python.org'), ('DNS', 'pythonhosted.org'), ('DNS', 'www.pythonhosted.org'), ('DNS', 'test.pythonhosted.org'), ('DNS', 'us.pycon.org'), ('DNS', 'id.python.org')), 'version': 3}
sv: >>> pprint.pprint(cert) {'OCSP': ('http://ocsp.digicert.com',), 'caIssuers': ('http://cacerts.digicert.com/DigiCertSHA2ExtendedValidationServerCA.crt',), 'crlDistributionPoints': ('http://crl3.digicert.com/sha2-ev-server-g1.crl', 'http://crl4.digicert.com/sha2-ev-server-g1.crl'), "issuer": ((('countryName', 'US'),), (('organizationName', 'DigiCert Inc'),), (('organizationalUnitName', 'www.digicert.com'),), (('commonName','DigiCert SHA2 Extended Validation Server CA'),)), "notAfter": "9 september 12:00:00 2016 GMT", 'notBefore': '5 september 00:00:00 2014 GMT', 'serialNumber': '01BB6F00122B177F36CAB49CEA8B6B26', 'subject': ((('businessCategory', 'Privat organisation'),), (('1.3.6.1.4.1.311.60.2.1.3', 'US'),), (('1.3.6.1.4.1.311.60.2.1.2', 'Delaware'),), (('serialNumber', '3359300'),), (('streetAddress', '16 Allen Rd'),), (('postalCode', '03894-4801'),), (('countryName', 'US'),), (('stateOrProvinceName', 'NH'),), (('localityName', 'Wolfeboro'),), (('organizationName','Python Software Foundation'),), (('commonName', 'www.python.org')),)), "subjectAltName": (("DNS", "www.python.org"), ('DNS', 'python.org'), ('DNS', 'pypi.org'), ('DNS', 'docs.python.org'), ('DNS', 'testpypi.org'), ('DNS', 'bugs.python.org'), ('DNS', 'wiki.python.org'), ('DNS', 'hg.python.org'), ('DNS', 'mail.python.org'), ('DNS', 'packaging.python.org'), ('DNS', 'pythonhosted.org'), ('DNS', 'www.pythonhosted.org'), ('DNS', 'test.pythonhosted.org'), ('DNS', 'us.pycon.org'), ('DNS', 'id.python.org')), 'version': 3}

source: Now the SSL channel is established and the certificate verified, you can proceed to talk with the server::
sv: Nu när SSL-kanalen har upprättats och certifikatet har verifierats kan du fortsätta att prata med servern::
