Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: Whether the OpenSSL library has built-in support for the SSL 2.0 protocol.
sv: Om OpenSSL-biblioteket har inbyggt stöd för SSL 2.0-protokollet.

source: Whether the OpenSSL library has built-in support for the SSL 3.0 protocol.
sv: Om OpenSSL-biblioteket har inbyggt stöd för SSL 3.0-protokollet.

source: Whether the OpenSSL library has built-in support for the TLS 1.0 protocol.
sv: Om OpenSSL-biblioteket har inbyggt stöd för TLS 1.0-protokollet.

source: Whether the OpenSSL library has built-in support for the TLS 1.1 protocol.
sv: Om OpenSSL-biblioteket har inbyggt stöd för TLS 1.1-protokollet.

source: Whether the OpenSSL library has built-in support for the TLS 1.2 protocol.
sv: Om OpenSSL-biblioteket har inbyggt stöd för TLS 1.2-protokollet.

source: Whether the OpenSSL library has built-in support for the TLS 1.3 protocol.
sv: Om OpenSSL-biblioteket har inbyggt stöd för TLS 1.3-protokollet.

source: Whether the OpenSSL library has built-in support for TLS-PSK.
sv: Om OpenSSL-biblioteket har inbyggt stöd för TLS-PSK.

source: Whether the OpenSSL library has built-in support for TLS-PHA.
sv: Om OpenSSL-biblioteket har inbyggt stöd för TLS-PHA.

source: List of supported TLS channel binding types. Strings in this list can be used as arguments to :meth:`SSLSocket.get_channel_binding`.
sv: Lista över TLS-kanalbindningstyper som stöds. Strängar i den här listan kan användas som argument för :meth:`SSLSocket.get_channel_binding`.

source: The version string of the OpenSSL library loaded by the interpreter::
sv: Versionssträngen för OpenSSL-biblioteket som läses in av tolken::

source: >>> ssl.OPENSSL_VERSION 'OpenSSL 1.0.2k 26 Jan 2017'
sv: >>> ssl.OPENSSL_VERSION "OpenSSL 1.0.2k 26 januari 2017

source: A tuple of five integers representing version information about the OpenSSL library::
sv: En tupel med fem heltal som representerar versionsinformation om OpenSSL-biblioteket::

source: The raw version number of the OpenSSL library, as a single integer::
sv: Det råa versionsnumret för OpenSSL-biblioteket, som ett enda heltal::

source: Alert Descriptions from :rfc:`5246` and others. The `IANA TLS Alert Registry <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ contains this list and references to the RFCs where their meaning is defined.
sv: Varningsbeskrivningar från :rfc:`5246` och andra. Registret `IANA TLS Alert Registry <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ innehåller denna lista och referenser till de RFC:er där deras betydelse definieras.

source: Used as the return value of the callback function in :meth:`SSLContext.set_servername_callback`.
sv: Används som returvärde för callback-funktionen i :meth:`SSLContext.set_servername_callback`.

source: :class:`enum.IntEnum` collection of ALERT_DESCRIPTION_* constants.
sv: :class:`enum.IntEnum` samling av ALERT_DESCRIPTION_*-konstanter.

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web servers (therefore, it will be used to create client-side sockets).
sv: Alternativ för :func:`create_default_context` och :meth:`SSLContext.load_default_certs`. Detta värde anger att kontexten kan användas för att autentisera webbservrar (därför kommer den att användas för att skapa sockets på klientsidan).

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web clients (therefore, it will be used to create server-side sockets).
sv: Alternativ för :func:`create_default_context` och :meth:`SSLContext.load_default_certs`. Detta värde indikerar att kontexten kan användas för att autentisera webbklienter (därför kommer den att användas för att skapa sockets på serversidan).

source: :class:`enum.IntEnum` collection of SSL_ERROR_* constants.
sv: :class:`enum.IntEnum` samling av SSL_ERROR_*-konstanter.

source: :class:`enum.IntEnum` collection of SSL and TLS versions for :attr:`SSLContext.maximum_version` and :attr:`SSLContext.minimum_version`.
sv: :class:`enum.IntEnum` samling av SSL- och TLS-versioner för :attr:`SSLContext.maximum_version` och :attr:`SSLContext.minimum_version`.

source: The minimum or maximum supported SSL or TLS version. These are magic constants. Their values don't reflect the lowest and highest available TLS/SSL versions.
sv: Den lägsta eller högsta SSL- eller TLS-versionen som stöds. Dessa är magiska konstanter. Deras värden återspeglar inte de lägsta och högsta tillgängliga TLS/SSL-versionerna.

source: SSL 3.0 to TLS 1.3.
sv: SSL 3.0 till TLS 1.3.

source: All :class:`TLSVersion` members except :attr:`TLSVersion.TLSv1_2` and :attr:`TLSVersion.TLSv1_3` are deprecated.
sv: Alla :class:`TLSVersion`-medlemmar utom :attr:`TLSVersion.TLSv1_2` och :attr:`TLSVersion.TLSv1_3` är föråldrade.

source: SSL Sockets
sv: SSL-uttag

source: SSL sockets provide the following methods of :ref:`socket-objects`:
sv: SSL-uttag tillhandahåller följande metoder för :ref:`socket-objects`:

source: :meth:`~socket.socket.recv`, :meth:`~socket.socket.recv_into` (but passing a non-zero ``flags`` argument is not allowed)
sv: :meth:`~socket.socket.recv`, :meth:`~socket.socket.recv_into` (men att skicka ett ``flags``-argument som inte är noll är inte tillåtet)

source: :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall` (with the same limitation)
sv: :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall` (med samma begränsning)

source: :meth:`~socket.socket.sendfile` (but :mod:`os.sendfile` will be used for plain-text sockets only, else :meth:`~socket.socket.send` will be used)
sv: :meth:`~socket.socket.sendfile` (men :mod:`os.sendfile` kommer endast att användas för uttag med vanlig text, annars kommer :meth:`~socket.socket.send` att användas)

source: However, since the SSL (and TLS) protocol has its own framing atop of TCP, the SSL sockets abstraction can, in certain respects, diverge from the specification of normal, OS-level sockets. See especially the :ref:`notes on non-blocking sockets <ssl-nonblocking>`.
sv: Men eftersom SSL- (och TLS-) protokollet har sin egen inramning ovanpå TCP, kan abstraktionen för SSL-uttag i vissa avseenden avvika från specifikationen för normala uttag på OS-nivå. Se särskilt :ref:`anmärkningar om icke-blockerande uttag <ssl-nonblocking>`.

source: Instances of :class:`SSLSocket` must be created using the :meth:`SSLContext.wrap_socket` method.
sv: Instanser av :class:`SSLSocket` måste skapas med hjälp av :meth:`SSLContext.wrap_socket`-metoden.

source: The :meth:`sendfile` method was added.
sv: Metoden :meth:`sendfile` lades till.

source: The :meth:`shutdown` does not reset the socket timeout each time bytes are received or sent. The socket timeout is now the maximum total duration of the shutdown.
sv: :meth:`shutdown` nollställer inte socket timeout varje gång bytes tas emot eller skickas. Socket timeout är nu den maximala totala varaktigheten för avstängningen.

source: It is deprecated to create a :class:`SSLSocket` instance directly, use :meth:`SSLContext.wrap_socket` to wrap a socket.
sv: Det är inte längre aktuellt att skapa en :class:`SSLSocket`-instans direkt, använd :meth:`SSLContext.wrap_socket` för att omsluta en socket.

source: :class:`SSLSocket` instances must to created with :meth:`~SSLContext.wrap_socket`. In earlier versions, it was possible to create instances directly. This was never documented or officially supported.
sv: :class:`SSLSocket`-instanser måste skapas med :meth:`~SSLContext.wrap_socket`. I tidigare versioner var det möjligt att skapa instanser direkt. Detta var aldrig dokumenterat eller officiellt stöttat.

source: Python now uses ``SSL_read_ex`` and ``SSL_write_ex`` internally. The functions support reading and writing of data larger than 2 GB. Writing zero-length data no longer fails with a protocol violation error.
sv: Python använder nu ``SSL_read_ex`` och ``SSL_write_ex`` internt. Funktionerna stöder läsning och skrivning av data som är större än 2 GB. Skrivning av noll-längdsdata misslyckas inte längre med ett protokollöverträdelsefel.

source: SSL sockets also have the following additional methods and attributes:
sv: SSL-uttag har också följande ytterligare metoder och attribut:

source: Read up to *len* bytes of data from the SSL socket and return the result as a ``bytes`` instance. If *buffer* is specified, then read into the buffer instead, and return the number of bytes read.
sv: Läser upp till *len* byte data från SSL-socket och returnerar resultatet som en ``bytes``-instans. Om *buffer* anges läses data in i bufferten i stället och antalet lästa byte returneras.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the read would block.
sv: Utlös :exc:`SSLWantReadError` eller :exc:`SSLWantWriteError` om uttaget är :ref:`icke-blockerande <ssl-nonblocking>` och läsningen skulle blockera.

source: As at any time a re-negotiation is possible, a call to :meth:`read` can also cause write operations.
sv: Eftersom en omförhandling kan ske när som helst kan ett anrop till :meth:`read` också orsaka skrivoperationer.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration to read up to *len* bytes.
sv: Timeouten för uttaget återställs inte längre varje gång byte tas emot eller skickas. Socket timeout är nu den maximala totala tiden det tar att läsa upp till *len* bytes.

source: Use :meth:`~SSLSocket.recv` instead of :meth:`~SSLSocket.read`.
sv: Använd :meth:`~SSLSocket.recv` istället för :meth:`~SSLSocket.read`.

source: Write *buf* to the SSL socket and return the number of bytes written. The *buf* argument must be an object supporting the buffer interface.
sv: Skriv *buf* till SSL-socket och returnera antalet byte som skrivits. Argumentet *buf* måste vara ett objekt som stöder buffertgränssnittet.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the write would block.
sv: Utlös :exc:`SSLWantReadError` eller :exc:`SSLWantWriteError` om uttaget är :ref:`non-blocking <ssl-nonblocking>` och skrivningen skulle blockera.

source: As at any time a re-negotiation is possible, a call to :meth:`write` can also cause read operations.
sv: Eftersom en omförhandling kan ske när som helst kan ett anrop till :meth:`write` också orsaka läsoperationer.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration to write *buf*.
sv: Timeout för socket nollställs inte längre varje gång byte tas emot eller skickas. Timeouten för uttaget är nu den maximala totala tiden det tar att skriva *buf*.

source: Use :meth:`~SSLSocket.send` instead of :meth:`~SSLSocket.write`.
sv: Använd :meth:`~SSLSocket.send` istället för :meth:`~SSLSocket.write`.

source: The :meth:`~SSLSocket.read` and :meth:`~SSLSocket.write` methods are the low-level methods that read and write unencrypted, application-level data and decrypt/encrypt it to encrypted, wire-level data. These methods require an active SSL connection, i.e. the handshake was completed and :meth:`SSLSocket.unwrap` was not called.
sv: Metoderna :meth:`~SSLSocket.read` och :meth:`~SSLSocket.write` är lågnivåmetoder som läser och skriver okrypterade data på applikationsnivå och dekrypterar/krypterar dem till krypterade data på trådnivå. Dessa metoder kräver en aktiv SSL-anslutning, dvs. handskakningen har slutförts och :meth:`SSLSocket.unwrap` har inte anropats.

source: Normally you should use the socket API methods like :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` instead of these methods.
sv: Normalt bör du använda Socket API-metoder som :meth:`~socket.socket.recv` och :meth:`~socket.socket.send` istället för dessa metoder.

source: Perform the SSL setup handshake.
sv: Utför handskakningen för SSL-installationen.

source: The handshake method also performs :func:`match_hostname` when the :attr:`~SSLContext.check_hostname` attribute of the socket's :attr:`~SSLSocket.context` is true.
sv: Handskakningsmetoden utför också :func:`match_hostname` när attributet :attr:`~SSLContext.check_hostname` i socketens :attr:`~SSLSocket.context` är true.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration of the handshake.
sv: Timeout för socket återställs inte längre varje gång byte tas emot eller skickas. Timeouten för uttaget är nu den maximala totala varaktigheten för handskakningen.

source: Hostname or IP address is matched by OpenSSL during handshake. The function :func:`match_hostname` is no longer used. In case OpenSSL refuses a hostname or IP address, the handshake is aborted early and a TLS alert message is sent to the peer.
sv: Värdnamn eller IP-adress matchas av OpenSSL under handskakning. Funktionen :func:`match_hostname` används inte längre. Om OpenSSL vägrar ett värdnamn eller en IP-adress avbryts handskakningen i förtid och ett TLS-varningsmeddelande skickas till motparten.

source: If there is no certificate for the peer on the other end of the connection, return ``None``. If the SSL handshake hasn't been done yet, raise :exc:`ValueError`.
sv: Om det inte finns något certifikat för motparten i den andra änden av anslutningen returneras ``None``. Om SSL-handskakningen inte har gjorts ännu, returneras :exc:`ValueError`.

source: If the ``binary_form`` parameter is :const:`False`, and a certificate was received from the peer, this method returns a :class:`dict` instance. If the certificate was not validated, the dict is empty. If the certificate was validated, it returns a dict with several keys, amongst them ``subject`` (the principal for which the certificate was issued) and ``issuer`` (the principal issuing the certificate). If a certificate contains an instance of the *Subject Alternative Name* extension (see :rfc:`3280`), there will also be a ``subjectAltName`` key in the dictionary.
sv: Om parametern ``binary_form`` är :const:`False`, och ett certifikat har mottagits från motparten, returnerar denna metod en :class:`dict`-instans. Om certifikatet inte validerades är dict tomt. Om certifikatet validerades returneras en dict med flera nycklar, bland annat ``subject`` (den huvudman för vilken certifikatet utfärdades) och ``issuer`` (den huvudman som utfärdar certifikatet). Om ett certifikat innehåller en instans av tillägget *Subject Alternative Name* (se :rfc:`3280`), kommer det också att finnas en nyckel ``subjectAltName`` i ordlistan.

source: The ``subject`` and ``issuer`` fields are tuples containing the sequence of relative distinguished names (RDNs) given in the certificate's data structure for the respective fields, and each RDN is a sequence of name-value pairs. Here is a real-world example::
sv: Fälten ``subject`` och ``issuer`` är tupler som innehåller den sekvens av RDN (relative distinguished names) som anges i certifikatets datastruktur för respektive fält, och varje RDN är en sekvens av namn-värdepar. Här är ett exempel från den verkliga världen::

source: {'issuer': ((('countryName', 'IL'),), (('organizationName', 'StartCom Ltd.'),), (('organizationalUnitName', 'Secure Digital Certificate Signing'),), (('commonName', 'StartCom Class 2 Primary Intermediate Server CA'),)), 'notAfter': 'Nov 22 08:15:19 2013 GMT', 'notBefore': 'Nov 21 03:09:52 2011 GMT', 'serialNumber': '95F0', 'subject': ((('description', '571208-SLe257oHY9fVQ07Z'),), (('countryName', 'US'),), (('stateOrProvinceName', 'California'),), (('localityName', 'San Francisco'),), (('organizationName', 'Electronic Frontier Foundation, Inc.'),), (('commonName', '*.eff.org'),), (('emailAddress', 'hostmaster@eff.org'),)), 'subjectAltName': (('DNS', '*.eff.org'), ('DNS', 'eff.org')), 'version': 3}
sv: {'issuer': ((('countryName', 'IL'),), (('organizationName', 'StartCom Ltd.'),), (('organizationalUnitName', 'Säker digital certifikatsignering'),), (('commonName', 'StartCom Class 2 Primary Intermediate Server CA'),)), 'notAfter': 'Nov 22 08:15:19 2013 GMT', 'notBefore': 'Nov 21 03:09:52 2011 GMT', 'serialNumber': '95F0', 'subject': ((('description', '571208-SLe257oHY9fVQ07Z'),), (('countryName', 'US'),), (('stateOrProvinceName', 'Kalifornien'),), (('localityName', 'San Francisco'),), (('organizationName', 'Electronic Frontier Foundation, Inc.'),), (('commonName', '*.eff.org'),), (('emailAddress', 'hostmaster@eff.org')),)), 'subjectAltName': (('DNS', '*.eff.org'), ('DNS', 'eff.org')), 'version': 3}

source: If the ``binary_form`` parameter is :const:`True`, and a certificate was provided, this method returns the DER-encoded form of the entire certificate as a sequence of bytes, or :const:`None` if the peer did not provide a certificate. Whether the peer provides a certificate depends on the SSL socket's role:
sv: Om parametern ``binary_form`` är :const:`True`` och ett certifikat har tillhandahållits, returnerar denna metod den DER-kodade formen av hela certifikatet som en sekvens av bytes, eller :const:`None` om motparten inte har tillhandahållit något certifikat. Om motparten tillhandahåller ett certifikat beror på SSL-uttagets roll:

source: for a client SSL socket, the server will always provide a certificate, regardless of whether validation was required;
sv: för ett SSL-uttag från en klient kommer servern alltid att tillhandahålla ett certifikat, oavsett om validering krävdes eller inte;

source: for a server SSL socket, the client will only provide a certificate when requested by the server; therefore :meth:`getpeercert` will return :const:`None` if you used :const:`CERT_NONE` (rather than :const:`CERT_OPTIONAL` or :const:`CERT_REQUIRED`).
sv: för ett SSL-uttag på en server kommer klienten endast att tillhandahålla ett certifikat när servern begär det; därför kommer :meth:`getpeercert` att returnera :const:`None` om du använde :const:`CERT_NONE` (i stället för :const:`CERT_OPTIONAL` eller :const:`CERT_REQUIRED`).

source: See also :attr:`SSLContext.check_hostname`.
sv: Se även :attr:`SSLContext.check_hostname`.

source: The returned dictionary includes additional items such as ``issuer`` and ``notBefore``.
sv: Den returnerade ordlistan innehåller ytterligare objekt som ``issuer`` och ``notBefore``.

source: :exc:`ValueError` is raised when the handshake isn't done. The returned dictionary includes additional X509v3 extension items such as ``crlDistributionPoints``, ``caIssuers`` and ``OCSP`` URIs.
sv: :exc:`ValueError` utlöses när handskakningen inte är klar. Den returnerade ordlistan innehåller ytterligare X509v3-tilläggsobjekt såsom ``crlDistributionPoints``, ``caIssuers`` och ``OCSP`` URI:er.

source: IPv6 address strings no longer have a trailing new line.
sv: IPv6-adresssträngar har inte längre någon efterföljande ny rad.

source: Returns verified certificate chain provided by the other end of the SSL channel as a list of DER-encoded bytes. If certificate verification was disabled method acts the same as :meth:`~SSLSocket.get_unverified_chain`.
sv: Returnerar verifierad certifikatkedja som tillhandahålls av den andra änden av SSL-kanalen som en lista med DER-kodade byte. Om certifikatverifiering var inaktiverad fungerar metoden på samma sätt som :meth:`~SSLSocket.get_unverified_chain`.

source: Returns raw certificate chain provided by the other end of the SSL channel as a list of DER-encoded bytes.
sv: Returnerar den råa certifikatkedjan som tillhandahålls av den andra änden av SSL-kanalen som en lista med DER-kodade byte.

source: Returns a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used. If no connection has been established, returns ``None``.
sv: Returnerar en tupel med tre värden som innehåller namnet på det chiffer som används, den version av SSL-protokollet som definierar dess användning och antalet hemliga bitar som används. Om ingen anslutning har upprättats, returneras ``None``.

source: Return the list of ciphers available in both the client and server. Each entry of the returned list is a three-value tuple containing the name of the cipher, the version of the SSL protocol that defines its use, and the number of secret bits the cipher uses. :meth:`~SSLSocket.shared_ciphers` returns ``None`` if no connection has been established or the socket is a client socket.
sv: Returnerar listan över chiffer som är tillgängliga i både klienten och servern. Varje post i den returnerade listan är en tupel med tre värden som innehåller namnet på chiffret, den version av SSL-protokollet som definierar dess användning och antalet hemliga bitar som chiffret använder. :meth:`~SSLSocket.shared_ciphers` returnerar ``None`` om ingen anslutning har upprättats eller om uttaget är ett klientuttag.

source: Return the compression algorithm being used as a string, or ``None`` if the connection isn't compressed.
sv: Returnerar den komprimeringsalgoritm som används som en sträng, eller ``None`` om anslutningen inte komprimeras.

source: If the higher-level protocol supports its own compression mechanism, you can use :data:`OP_NO_COMPRESSION` to disable SSL-level compression.
sv: Om protokollet på högre nivå stöder sin egen komprimeringsmekanism kan du använda :data:`OP_NO_COMPRESSION` för att inaktivera komprimering på SSL-nivå.

source: Get channel binding data for current connection, as a bytes object. Returns ``None`` if not connected or the handshake has not been completed.
sv: Hämta kanalbindningsdata för aktuell anslutning, som ett bytesobjekt. Returnerar ``None`` om ingen anslutning finns eller om handskakningen inte har slutförts.

source: The *cb_type* parameter allow selection of the desired channel binding type. Valid channel binding types are listed in the :data:`CHANNEL_BINDING_TYPES` list. Currently only the 'tls-unique' channel binding, defined by :rfc:`5929`, is supported. :exc:`ValueError` will be raised if an unsupported channel binding type is requested.
sv: Parametern *cb_type* gör det möjligt att välja önskad kanalbindningstyp. Giltiga kanalbindningstyper listas i listan :data:`CHANNEL_BINDING_TYPES`. För närvarande stöds endast kanalbindningen 'tls-unique', definierad av :rfc:`5929`. :exc:`ValueError` kommer att uppstå om en kanalbindningstyp som inte stöds begärs.

source: Return the protocol that was selected during the TLS handshake. If :meth:`SSLContext.set_alpn_protocols` was not called, if the other party does not support ALPN, if this socket does not support any of the client's proposed protocols, or if the handshake has not happened yet, ``None`` is returned.
sv: Returnerar det protokoll som valdes under TLS-handskakningen. Om :meth:`SSLContext.set_alpn_protocols` inte anropades, om den andra parten inte stöder ALPN, om detta uttag inte stöder något av klientens föreslagna protokoll, eller om handskakningen inte har skett ännu, returneras ``None``.

source: Return the higher-level protocol that was selected during the TLS/SSL handshake. If :meth:`SSLContext.set_npn_protocols` was not called, or if the other party does not support NPN, or if the handshake has not yet happened, this will return ``None``.
sv: Returnerar det protokoll på högre nivå som valdes under TLS/SSL-handskakningen. Om :meth:`SSLContext.set_npn_protocols` inte anropades, eller om den andra parten inte stöder NPN, eller om handskakningen ännu inte har skett, kommer detta att returnera ``None``.

source: NPN has been superseded by ALPN
sv: NPN har ersatts av ALPN
