Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: Given a certificate as an ASCII PEM string, returns a DER-encoded sequence of bytes for that same certificate.
sv: Om ett certifikat anges som en ASCII PEM-sträng returneras en DER-kodad sekvens av bytes för samma certifikat.

source: Returns a named tuple with paths to OpenSSL's default cafile and capath. The paths are the same as used by :meth:`SSLContext.set_default_verify_paths`. The return value is a :term:`named tuple` ``DefaultVerifyPaths``:
sv: Returnerar en namngiven tupel med sökvägar till OpenSSL:s standardcafile och -capath. Sökvägarna är samma som används av :meth:`SSLContext.set_default_verify_paths`. Returvärdet är en :term:`named tuple` ``DefaultVerifyPaths``:

source: :attr:`cafile` - resolved path to cafile or ``None`` if the file doesn't exist,
sv: :attr:`cafile` - upplöst sökväg till cafile eller ``None`` om filen inte finns,

source: :attr:`capath` - resolved path to capath or ``None`` if the directory doesn't exist,
sv: :attr:`capath` - upplöst sökväg till capath eller ``None`` om katalogen inte finns,

source: :attr:`openssl_cafile_env` - OpenSSL's environment key that points to a cafile,
sv: :attr:`openssl_cafile_env` - OpenSSL:s miljönyckel som pekar på en cafile,

source: :attr:`openssl_cafile` - hard coded path to a cafile,
sv: :attr:`openssl_cafile` - hårdkodad sökväg till en cafile,

source: :attr:`openssl_capath_env` - OpenSSL's environment key that points to a capath,
sv: :attr:`openssl_capath_env` - OpenSSL:s miljönyckel som pekar på en capath,

source: :attr:`openssl_capath` - hard coded path to a capath directory
sv: :attr:`openssl_capath` - hårdkodad sökväg till en capath-katalog

source: Retrieve certificates from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
sv: Hämtar certifikat från Windows system cert store. *store_name* kan vara en av ``CA``, ``ROOT`` eller ``MY``. Windows kan också tillhandahålla ytterligare certifikatlager.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data. Trust specifies the purpose of the certificate as a set of OIDS or exactly ``True`` if the certificate is trustworthy for all purposes.
sv: Funktionen returnerar en lista med (cert_bytes, encoding_type, trust)-tupler. Encoding_type anger kodningen av cert_bytes. Den är antingen :const:`x509_asn` för X.509 ASN.1-data eller :const:`pkcs_7_asn` för PKCS#7 ASN.1-data. Trust anger syftet med certifikatet som en uppsättning OIDS eller exakt ``True`` om certifikatet är pålitligt för alla ändamål.

source: Example::
sv: Exempel::

source: Retrieve CRLs from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
sv: Hämtar CRL:er från Windows systemets cert-arkiv. *store_name* kan vara en av ``CA``, ``ROOT`` eller ``MY``. Windows kan också tillhandahålla ytterligare cert-arkiv.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data.
sv: Funktionen returnerar en lista med (cert_bytes, encoding_type, trust)-tupler. Encoding_type anger kodningen av cert_bytes. Den är antingen :const:`x509_asn` för X.509 ASN.1-data eller :const:`pkcs_7_asn` för PKCS#7 ASN.1-data.

source: Constants
sv: Konstanter

source: All constants are now :class:`enum.IntEnum` or :class:`enum.IntFlag` collections.
sv: Alla konstanter är nu :class:`enum.IntEnum` eller :class:`enum.IntFlag` samlingar.

source: Possible value for :attr:`SSLContext.verify_mode`. Except for :const:`PROTOCOL_TLS_CLIENT`, it is the default mode. With client-side sockets, just about any cert is accepted. Validation errors, such as untrusted or expired cert, are ignored and do not abort the TLS/SSL handshake.
sv: Möjligt värde för :attr:`SSLContext.verify_mode`. Med undantag för :const:`PROTOCOL_TLS_CLIENT` är detta standardläget. Med sockets på klientsidan accepteras i stort sett alla certifikat. Valideringsfel, t.ex. icke betrodda eller utgångna certifikat, ignoreras och avbryter inte TLS/SSL-handskakningen.

source: In server mode, no certificate is requested from the client, so the client does not send any for client cert authentication.
sv: I serverläge begärs inget certifikat från klienten, så klienten skickar inte något för autentisering med klientcertifikat.

source: See the discussion of :ref:`ssl-security` below.
sv: Se diskussionen om :ref:`ssl-security` nedan.

source: Possible value for :attr:`SSLContext.verify_mode`. In client mode, :const:`CERT_OPTIONAL` has the same meaning as :const:`CERT_REQUIRED`. It is recommended to use :const:`CERT_REQUIRED` for client-side sockets instead.
sv: Möjligt värde för :attr:`SSLContext.verify_mode`. I klientläge har :const:`CERT_OPTIONAL` samma betydelse som :const:`CERT_REQUIRED`. Vi rekommenderar att du använder :const:`CERT_REQUIRED` för sockets på klientsidan i stället.

source: In server mode, a client certificate request is sent to the client. The client may either ignore the request or send a certificate in order perform TLS client cert authentication. If the client chooses to send a certificate, it is verified. Any verification error immediately aborts the TLS handshake.
sv: I serverläge skickas en begäran om klientcertifikat till klienten. Klienten kan antingen ignorera begäran eller skicka ett certifikat för att utföra TLS-klientcertifikatsautentisering. Om klienten väljer att skicka ett certifikat verifieras det. Om ett verifieringsfel uppstår avbryts TLS-handskakningen omedelbart.

source: Use of this setting requires a valid set of CA certificates to be passed to :meth:`SSLContext.load_verify_locations`.
sv: Om denna inställning används krävs att en giltig uppsättning CA-certifikat skickas till :meth:`SSLContext.load_verify_locations`.

source: Possible value for :attr:`SSLContext.verify_mode`. In this mode, certificates are required from the other side of the socket connection; an :class:`SSLError` will be raised if no certificate is provided, or if its validation fails. This mode is **not** sufficient to verify a certificate in client mode as it does not match hostnames. :attr:`~SSLContext.check_hostname` must be enabled as well to verify the authenticity of a cert. :const:`PROTOCOL_TLS_CLIENT` uses :const:`CERT_REQUIRED` and enables :attr:`~SSLContext.check_hostname` by default.
sv: Möjligt värde för :attr:`SSLContext.verify_mode`. I detta läge krävs certifikat från den andra sidan av socket-anslutningen; ett :class:`SSLError` kommer att uppstå om inget certifikat tillhandahålls, eller om dess validering misslyckas. Detta läge är **inte** tillräckligt för att verifiera ett certifikat i klientläge eftersom det inte matchar värdnamn. :attr:`~SSLContext.check_hostname` måste också aktiveras för att verifiera äktheten hos ett certifikat. :const:`PROTOCOL_TLS_CLIENT` använder :const:`CERT_REQUIRED` och aktiverar :attr:`~SSLContext.check_hostname` som standard.

source: With server socket, this mode provides mandatory TLS client cert authentication. A client certificate request is sent to the client and the client must provide a valid and trusted certificate.
sv: Med serveruttag ger detta läge obligatorisk TLS-klientcertifikatsautentisering. En begäran om klientcertifikat skickas till klienten och klienten måste tillhandahålla ett giltigt och betrott certifikat.

source: :class:`enum.IntEnum` collection of CERT_* constants.
sv: :class:`enum.IntEnum` samling av CERT_*-konstanter.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, certificate revocation lists (CRLs) are not checked. By default OpenSSL does neither require nor verify CRLs.
sv: Möjligt värde för :attr:`SSLContext.verify_flags`. I det här läget kontrolleras inte CRL:er (Certificate Revocation List). Som standard varken kräver eller verifierar OpenSSL CRL:er.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, only the peer cert is checked but none of the intermediate CA certificates. The mode requires a valid CRL that is signed by the peer cert's issuer (its direct ancestor CA). If no proper CRL has been loaded with :attr:`SSLContext.load_verify_locations`, validation will fail.
sv: Möjligt värde för :attr:`SSLContext.verify_flags`. I det här läget kontrolleras endast peer-certifikatet, men inga mellanliggande CA-certifikat. Läget kräver en giltig CRL som är signerad av peer-certifikatets utfärdare (dess direkta förfader CA). Om ingen korrekt CRL har laddats med :attr:`SSLContext.load_verify_locations`, kommer valideringen att misslyckas.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, CRLs of all certificates in the peer cert chain are checked.
sv: Möjligt värde för :attr:`SSLContext.verify_flags`. I det här läget kontrolleras CRL för alla certifikat i peer-certifikatkedjan.

source: Possible value for :attr:`SSLContext.verify_flags` to disable workarounds for broken X.509 certificates.
sv: Möjligt värde för :attr:`SSLContext.verify_flags` för att inaktivera lösningar för trasiga X.509-certifikat.

source: Possible value for :attr:`SSLContext.verify_flags` to enables proxy certificate verification.
sv: Möjligt värde för :attr:`SSLContext.verify_flags` för att aktivera verifiering av proxycertifikat.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to prefer trusted certificates when building the trust chain to validate a certificate. This flag is enabled by default.
sv: Möjligt värde för :attr:`SSLContext.verify_flags`. Instruerar OpenSSL att föredra betrodda certifikat när förtroendekedjan byggs upp för att validera ett certifikat. Denna flagga är aktiverad som standard.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to accept intermediate CAs in the trust store to be treated as trust-anchors, in the same way as the self-signed root CA certificates. This makes it possible to trust certificates issued by an intermediate CA without having to trust its ancestor root CA.
sv: Möjligt värde för :attr:`SSLContext.verify_flags`. Instruerar OpenSSL att acceptera att mellanliggande CA:er i trust store behandlas som trust-anchors, på samma sätt som självsignerade root CA-certifikat. Detta gör det möjligt att lita på certifikat som utfärdats av en mellanliggande CA utan att behöva lita på dess förfader rot-CA.

source: :class:`enum.IntFlag` collection of VERIFY_* constants.
sv: :class:`enum.IntFlag` samling av VERIFY_*-konstanter.

source: Selects the highest protocol version that both the client and server support. Despite the name, this option can select both "SSL" and "TLS" protocols.
sv: Väljer den högsta protokollversionen som både klienten och servern stöder. Trots namnet kan det här alternativet välja både "SSL"- och "TLS"-protokoll.

source: TLS clients and servers require different default settings for secure communication. The generic TLS protocol constant is deprecated in favor of :data:`PROTOCOL_TLS_CLIENT` and :data:`PROTOCOL_TLS_SERVER`.
sv: TLS-klienter och -servrar kräver olika standardinställningar för säker kommunikation. Den generiska TLS-protokollkonstanten är föråldrad till förmån för :data:`PROTOCOL_TLS_CLIENT` och :data:`PROTOCOL_TLS_SERVER`.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context client-side connections. The protocol enables :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` by default.
sv: Förhandla automatiskt om den högsta protokollversionen som både klienten och servern stöder och konfigurera kontextanslutningarna på klientsidan. Protokollet aktiverar :data:`CERT_REQUIRED` och :attr:`~SSLContext.check_hostname` som standard.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context server-side connections.
sv: Autoförhandla den högsta protokollversionen som både klienten och servern stöder och konfigurera kontexten för anslutningar på serversidan.

source: Alias for :data:`PROTOCOL_TLS`.
sv: Alias för :data:`PROTOCOL_TLS`.

source: Use :data:`PROTOCOL_TLS` instead.
sv: Använd :data:`PROTOCOL_TLS` istället.

source: Selects SSL version 3 as the channel encryption protocol.
sv: Väljer SSL version 3 som protokoll för kryptering av kanalen.

source: This protocol is not available if OpenSSL is compiled with the ``no-ssl3`` option.
sv: Detta protokoll är inte tillgängligt om OpenSSL kompileras med alternativet ``no-ssl3``.

source: SSL version 3 is insecure. Its use is highly discouraged.
sv: SSL version 3 är osäkert. Dess användning är starkt avrådd.

source: OpenSSL has deprecated all version specific protocols. Use the default protocol :data:`PROTOCOL_TLS_SERVER` or :data:`PROTOCOL_TLS_CLIENT` with :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
sv: OpenSSL har utgått från alla versionsspecifika protokoll. Använd standardprotokollet :data:`PROTOCOL_TLS_SERVER` eller :data:`PROTOCOL_TLS_CLIENT` med :attr:`SSLContext.minimum_version` och :attr:`SSLContext.maximum_version` istället.

source: Selects TLS version 1.0 as the channel encryption protocol.
sv: Väljer TLS version 1.0 som krypteringsprotokoll för kanalen.

source: OpenSSL has deprecated all version specific protocols.
sv: OpenSSL har avskaffat alla versionsspecifika protokoll.

source: Selects TLS version 1.1 as the channel encryption protocol. Available only with openssl version 1.0.1+.
sv: Väljer TLS version 1.1 som krypteringsprotokoll för kanalen. Endast tillgängligt med openssl version 1.0.1+.

source: Selects TLS version 1.2 as the channel encryption protocol. Available only with openssl version 1.0.1+.
sv: Väljer TLS version 1.2 som krypteringsprotokoll för kanalen. Endast tillgängligt med openssl version 1.0.1+.

source: Enables workarounds for various bugs present in other SSL implementations. This option is set by default. It does not necessarily set the same flags as OpenSSL's ``SSL_OP_ALL`` constant.
sv: Möjliggör lösningar för olika buggar som finns i andra SSL-implementeringar. Detta alternativ är inställt som standard. Det sätter inte nödvändigtvis samma flaggor som OpenSSL:s konstant ``SSL_OP_ALL``.

source: Prevents an SSLv2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv2 as the protocol version.
sv: Förhindrar en SSLv2-anslutning. Detta alternativ är endast tillämpligt i kombination med :const:`PROTOCOL_TLS`. Det hindrar motparterna från att välja SSLv2 som protokollversion.

source: SSLv2 is deprecated
sv: SSLv2 är föråldrat

source: Prevents an SSLv3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv3 as the protocol version.
sv: Förhindrar en SSLv3-anslutning. Detta alternativ är endast tillämpligt i kombination med :const:`PROTOCOL_TLS`. Det hindrar motparterna från att välja SSLv3 som protokollversion.

source: SSLv3 is deprecated
sv: SSLv3 är föråldrad

source: Prevents a TLSv1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1 as the protocol version.
sv: Förhindrar en TLSv1-anslutning. Detta alternativ är endast tillämpligt i kombination med :const:`PROTOCOL_TLS`. Det hindrar peers från att välja TLSv1 som protokollversion.

source: The option is deprecated since OpenSSL 1.1.0, use the new :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
sv: Alternativet är föråldrat sedan OpenSSL 1.1.0, använd de nya :attr:`SSLContext.minimum_version` och :attr:`SSLContext.maximum_version` istället.

source: Prevents a TLSv1.1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.1 as the protocol version. Available only with openssl version 1.0.1+.
sv: Förhindrar en TLSv1.1-anslutning. Detta alternativ är endast tillämpligt i kombination med :const:`PROTOCOL_TLS`. Det hindrar motparterna från att välja TLSv1.1 som protokollversion. Endast tillgängligt med openssl version 1.0.1+.

source: The option is deprecated since OpenSSL 1.1.0.
sv: Alternativet är föråldrat sedan OpenSSL 1.1.0.

source: Prevents a TLSv1.2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.2 as the protocol version. Available only with openssl version 1.0.1+.
sv: Förhindrar en TLSv1.2-anslutning. Detta alternativ är endast tillämpligt i kombination med :const:`PROTOCOL_TLS`. Det hindrar motparterna från att välja TLSv1.2 som protokollversion. Endast tillgängligt med openssl version 1.0.1+.

source: Prevents a TLSv1.3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.3 as the protocol version. TLS 1.3 is available with OpenSSL 1.1.1 or later. When Python has been compiled against an older version of OpenSSL, the flag defaults to *0*.
sv: Förhindrar en TLSv1.3-anslutning. Detta alternativ är endast tillämpligt i kombination med :const:`PROTOCOL_TLS`. Det hindrar motparterna från att välja TLSv1.3 som protokollversion. TLS 1.3 är tillgängligt med OpenSSL 1.1.1 eller senare. När Python har kompilerats mot en äldre version av OpenSSL, är flaggan som standard *0*.

source: The option is deprecated since OpenSSL 1.1.0. It was added to 2.7.15 and 3.6.3 for backwards compatibility with OpenSSL 1.0.2.
sv: Alternativet är föråldrat sedan OpenSSL 1.1.0. Det lades till i 2.7.15 och 3.6.3 för bakåtkompatibilitet med OpenSSL 1.0.2.

source: Disable all renegotiation in TLSv1.2 and earlier. Do not send HelloRequest messages, and ignore renegotiation requests via ClientHello.
sv: Inaktivera all omförhandling i TLSv1.2 och tidigare. Skicka inte HelloRequest-meddelanden och ignorera begäran om omförhandling via ClientHello.

source: This option is only available with OpenSSL 1.1.0h and later.
sv: Detta alternativ är endast tillgängligt med OpenSSL 1.1.0h och senare.

source: Use the server's cipher ordering preference, rather than the client's. This option has no effect on client sockets and SSLv2 server sockets.
sv: Använd serverns preferens för chifferordning i stället för klientens. Det här alternativet har ingen effekt på klientsocklar och SSLv2-serversocklar.

source: Prevents reuse of the same DH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
sv: Förhindrar återanvändning av samma DH-nyckel för olika SSL-sessioner. Detta förbättrar forward secrecy men kräver mer beräkningsresurser. Det här alternativet gäller endast för serveruttag.

source: Prevents reuse of the same ECDH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
sv: Förhindrar återanvändning av samma ECDH-nyckel för olika SSL-sessioner. Detta förbättrar forward secrecy men kräver mer beräkningsresurser. Det här alternativet gäller endast för serveruttag.

source: Send dummy Change Cipher Spec (CCS) messages in TLS 1.3 handshake to make a TLS 1.3 connection look more like a TLS 1.2 connection.
sv: Skicka falska CCS-meddelanden (Change Cipher Spec) i TLS 1.3-handskakningen för att få en TLS 1.3-anslutning att mer likna en TLS 1.2-anslutning.

source: This option is only available with OpenSSL 1.1.1 and later.
sv: Detta alternativ är endast tillgängligt med OpenSSL 1.1.1 och senare.

source: Disable compression on the SSL channel. This is useful if the application protocol supports its own compression scheme.
sv: Inaktivera komprimering på SSL-kanalen. Detta är användbart om applikationsprotokollet stöder sitt eget komprimeringsschema.

source: :class:`enum.IntFlag` collection of OP_* constants.
sv: :class:`enum.IntFlag` samling av OP_*-konstanter.

source: Prevent client side from requesting a session ticket.
sv: Förhindra klientsidan från att begära en sessionsbiljett.

source: Ignore unexpected shutdown of TLS connections.
sv: Ignorera oväntad avstängning av TLS-anslutningar.

source: This option is only available with OpenSSL 3.0.0 and later.
sv: Detta alternativ är endast tillgängligt med OpenSSL 3.0.0 och senare.

source: Enable the use of the kernel TLS. To benefit from the feature, OpenSSL must have been compiled with support for it, and the negotiated cipher suites and extensions must be supported by it (a list of supported ones may vary by platform and kernel version).
sv: Aktivera användning av TLS i kärnan. För att dra nytta av funktionen måste OpenSSL ha kompilerats med stöd för den, och de förhandlade chiffersviterna och tilläggen måste stödjas av den (en lista över de som stöds kan variera beroende på plattform och kärnversion).

source: Note that with enabled kernel TLS some cryptographic operations are performed by the kernel directly and not via any available OpenSSL Providers. This might be undesirable if, for example, the application requires all cryptographic operations to be performed by the FIPS provider.
sv: Observera att med aktiverad TLS i kärnan utförs vissa kryptografiska operationer direkt av kärnan och inte via någon tillgänglig OpenSSL-provider. Detta kan vara oönskat om t.ex. applikationen kräver att alla kryptografiska operationer utförs av FIPS-providern.

source: Allow legacy insecure renegotiation between OpenSSL and unpatched servers only.
sv: Tillåt endast äldre, osäkra omförhandlingar mellan OpenSSL och servrar som inte är patchade.

source: Whether the OpenSSL library has built-in support for the *Application-Layer Protocol Negotiation* TLS extension as described in :rfc:`7301`.
sv: Om OpenSSL-biblioteket har inbyggt stöd för TLS-tillägget *Application-Layer Protocol Negotiation* enligt beskrivningen i :rfc:`7301`.

source: Whether the OpenSSL library has built-in support not checking subject common name and :attr:`SSLContext.hostname_checks_common_name` is writeable.
sv: Om OpenSSL-biblioteket har inbyggt stöd för att inte kontrollera ämnets gemensamma namn och :attr:`SSLContext.hostname_checks_common_name` är skrivbart.

source: Whether the OpenSSL library has built-in support for the Elliptic Curve-based Diffie-Hellman key exchange. This should be true unless the feature was explicitly disabled by the distributor.
sv: Om OpenSSL-biblioteket har inbyggt stöd för Diffie-Hellman-nyckelutbyte baserat på elliptiska kurvor. Detta bör vara sant om inte funktionen uttryckligen har inaktiverats av distributören.

source: Whether the OpenSSL library has built-in support for the *Server Name Indication* extension (as defined in :rfc:`6066`).
sv: Om OpenSSL-biblioteket har inbyggt stöd för tillägget *Server Name Indication* (enligt definitionen i :rfc:`6066`).

source: Whether the OpenSSL library has built-in support for the *Next Protocol Negotiation* as described in the `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. When true, you can use the :meth:`SSLContext.set_npn_protocols` method to advertise which protocols you want to support.
sv: Om OpenSSL-biblioteket har inbyggt stöd för *Next Protocol Negotiation* enligt beskrivningen i `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. När det är sant kan du använda metoden :meth:`SSLContext.set_npn_protocols` för att annonsera vilka protokoll du vill stödja.
