Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: >>> conn.sendall(b"HEAD / HTTP/1.0\r\nHost: linuxfr.org\r\n\r\n") >>> pprint.pprint(conn.recv(1024).split(b"\r\n")) [b'HTTP/1.1 200 OK', b'Date: Sat, 18 Oct 2014 18:27:20 GMT', b'Server: nginx', b'Content-Type: text/html; charset=utf-8', b'X-Frame-Options: SAMEORIGIN', b'Content-Length: 45679', b'Accept-Ranges: bytes', b'Via: 1.1 varnish', b'Age: 2188', b'X-Served-By: cache-lcy1134-LCY', b'X-Cache: HIT', b'X-Cache-Hits: 11', b'Vary: Cookie', b'Strict-Transport-Security: max-age=63072000; includeSubDomains', b'Connection: close', b'', b'']
sv: >>> conn.sendall(b"HEAD / HTTP/1.0\r\nHost: linuxfr.org\r\n\r\n") >>> pprint.pprint(conn.recv(1024).split(b"\r\n")) [b'HTTP/1.1 200 OK', b'Datum: Sat, 18 Oct 2014 18:27:20 GMT', b'Server: nginx', b'Content-Type: text/html; charset=utf-8', b'X-Frame-Options: SAMEORIGIN', b'Content-Length: 45679', b'Accept-Ranges: bytes', b'Via: 1.1 varnish', b'Ålder: 2188', b'X-Served-By: cache-lcy1134-LCY', b'X-Cache: HIT', b'X-Cache-Hits: 11', b'Vary: Cookie', b'Strict-Transport-Security: max-age=63072000; includeSubDomains', b'Connection: close', b'', b'']

source: Server-side operation
sv: Drift på serversidan

source: For server operation, typically you'll need to have a server certificate, and private key, each in a file. You'll first create a context holding the key and the certificate, so that clients can check your authenticity. Then you'll open a socket, bind it to a port, call :meth:`listen` on it, and start waiting for clients to connect::
sv: För serverdrift behöver du vanligtvis ha ett servercertifikat och en privat nyckel i varsin fil. Du skapar först en kontext som innehåller nyckeln och certifikatet, så att klienterna kan kontrollera din äkthet. Sedan öppnar du en socket, binder den till en port, anropar :meth:`listen` på den och börjar vänta på att klienter ska ansluta::

source: When a client connects, you'll call :meth:`accept` on the socket to get the new socket from the other end, and use the context's :meth:`SSLContext.wrap_socket` method to create a server-side SSL socket for the connection::
sv: När en klient ansluter anropar du :meth:`accept` på sockeln för att hämta den nya sockeln från andra änden och använder kontextens :meth:`SSLContext.wrap_socket`-metod för att skapa en SSL-socket på serversidan för anslutningen:

source: while True: newsocket, fromaddr = bindsocket.accept() connstream = context.wrap_socket(newsocket, server_side=True) try: deal_with_client(connstream) finally: connstream.shutdown(socket.SHUT_RDWR) connstream.close()
sv: medan True: newsocket, fromaddr = bindsocket.accept() connstream = context.wrap_socket(newsocket, server_side=True) försök: deal_with_client(connstream) slutligen: deal_with_client connstream.shutdown(socket.SHUT_RDWR) connstream.close()

source: Then you'll read data from the ``connstream`` and do something with it till you are finished with the client (or the client is finished with you)::
sv: Sedan läser du data från ``connstream`` och gör något med den tills du är klar med klienten (eller klienten är klar med dig)::

source: def deal_with_client(connstream): data = connstream.recv(1024) # empty data means the client is finished with us while data: if not do_something(connstream, data): # we'll assume do_something returns False # when we're finished with client break data = connstream.recv(1024) # finished with client
sv: def deal_with_client(connstream): data = connstream.recv(1024) # tomma data betyder att klienten är klar med oss while data: if not do_something(connstream, data): # vi antar att do_something returnerar False # när vi är färdiga med klienten paus data = connstream.recv(1024) # färdig med klienten

source: And go back to listening for new client connections (of course, a real server would probably handle each client connection in a separate thread, or put the sockets in :ref:`non-blocking mode <ssl-nonblocking>` and use an event loop).
sv: Och gå tillbaka till att lyssna efter nya klientanslutningar (naturligtvis skulle en riktig server förmodligen hantera varje klientanslutning i en separat tråd, eller sätta socklarna i :ref:`icke-blockerande läge <ssl-nonblocking>` och använda en händelseslinga).

source: Notes on non-blocking sockets
sv: Anteckningar om icke-blockerande sockets

source: SSL sockets behave slightly different than regular sockets in non-blocking mode. When working with non-blocking sockets, there are thus several things you need to be aware of:
sv: SSL-uttag beter sig något annorlunda än vanliga uttag i icke-blockerande läge. När du arbetar med icke-blockerande sockets finns det därför flera saker du måste vara medveten om:

source: Most :class:`SSLSocket` methods will raise either :exc:`SSLWantWriteError` or :exc:`SSLWantReadError` instead of :exc:`BlockingIOError` if an I/O operation would block. :exc:`SSLWantReadError` will be raised if a read operation on the underlying socket is necessary, and :exc:`SSLWantWriteError` for a write operation on the underlying socket. Note that attempts to *write* to an SSL socket may require *reading* from the underlying socket first, and attempts to *read* from the SSL socket may require a prior *write* to the underlying socket.
sv: De flesta :class:`SSLSocket`-metoder kommer att ge upphov till antingen :exc:`SSLWantWriteError` eller :exc:`SSLWantReadError` istället för :exc:`BlockingIOError` om en I/O-operation skulle blockeras. :exc:`SSLWantReadError` kommer att ges upphov till om en läsoperation på den underliggande sockeln är nödvändig, och :exc:`SSLWantWriteError` för en skrivoperation på den underliggande sockeln. Observera att försök att *skriva* till ett SSL-uttag kan kräva att man först *läser* från det underliggande uttaget, och försök att *läsa* från SSL-uttaget kan kräva att man först *skriver* till det underliggande uttaget.

source: In earlier Python versions, the :meth:`!SSLSocket.send` method returned zero instead of raising :exc:`SSLWantWriteError` or :exc:`SSLWantReadError`.
sv: I tidigare Python-versioner returnerade metoden :meth:`!SSLSocket.send` noll istället för att ge upphov till :exc:`SSLWantWriteError` eller :exc:`SSLWantReadError`.

source: Calling :func:`~select.select` tells you that the OS-level socket can be read from (or written to), but it does not imply that there is sufficient data at the upper SSL layer. For example, only part of an SSL frame might have arrived. Therefore, you must be ready to handle :meth:`SSLSocket.recv` and :meth:`SSLSocket.send` failures, and retry after another call to :func:`~select.select`.
sv: Om du anropar :func:`~select.select` får du veta att det går att läsa från (eller skriva till) sockeln på OS-nivå, men det innebär inte att det finns tillräckligt med data i det övre SSL-lagret. Det kan t.ex. hända att bara en del av en SSL-ram har kommit fram. Därför måste du vara redo att hantera misslyckanden med :meth:`SSLSocket.recv` och :meth:`SSLSocket.send`, och försöka igen efter ett nytt anrop till :func:`~select.select`.

source: Conversely, since the SSL layer has its own framing, a SSL socket may still have data available for reading without :func:`~select.select` being aware of it. Therefore, you should first call :meth:`SSLSocket.recv` to drain any potentially available data, and then only block on a :func:`~select.select` call if still necessary.
sv: Omvänt, eftersom SSL-lagret har sin egen inramning, kan ett SSL-uttag fortfarande ha data tillgängliga för läsning utan att :func:`~select.select` är medveten om det. Därför bör du först anropa :meth:`SSLSocket.recv` för att tömma alla potentiellt tillgängliga data, och sedan bara blockera på ett :func:`~select.select`-anrop om det fortfarande är nödvändigt.

source: (of course, similar provisions apply when using other primitives such as :func:`~select.poll`, or those in the :mod:`selectors` module)
sv: (Naturligtvis gäller liknande bestämmelser när du använder andra primitiver som :func:`~select.poll`, eller de i :mod:`selectors`-modulen)

source: The SSL handshake itself will be non-blocking: the :meth:`SSLSocket.do_handshake` method has to be retried until it returns successfully. Here is a synopsis using :func:`~select.select` to wait for the socket's readiness::
sv: Själva SSL-handskakningen kommer att vara icke-blockerande: metoden :meth:`SSLSocket.do_handshake` måste prövas igen tills den returneras framgångsrikt. Här är en sammanfattning som använder :func:`~select.select` för att vänta på att uttaget är redo::

source: while True: try: sock.do_handshake() break except ssl.SSLWantReadError: select.select([sock], [], []) except ssl.SSLWantWriteError: select.select([], [sock], [])
sv: medan True: try: sock.do_handshake() bryt except ssl.SSLWantReadError: select.select([sock], [], []) except ssl.SSLWantWriteError: select.select([], [sock], [])

source: The :mod:`asyncio` module supports :ref:`non-blocking SSL sockets <ssl-nonblocking>` and provides a higher level :ref:`Streams API <asyncio-streams>`. It polls for events using the :mod:`selectors` module and handles :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` and :exc:`BlockingIOError` exceptions. It runs the SSL handshake asynchronously as well.
sv: Modulen :mod:`asyncio` stöder :ref:`non-blocking SSL sockets <ssl-nonblocking>` och tillhandahåller en högre nivå :ref:`Streams API <asyncio-streams>`. Den pollar efter händelser med hjälp av modulen :mod:`selectors` och hanterar undantagen :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` och :exc:`BlockingIOError`. Den kör även SSL-handskakningen asynkront.

source: Memory BIO Support
sv: Stöd för BIO-minne

source: Ever since the SSL module was introduced in Python 2.6, the :class:`SSLSocket` class has provided two related but distinct areas of functionality:
sv: Ända sedan SSL-modulen introducerades i Python 2.6 har :class:`SSLSocket`-klassen tillhandahållit två relaterade men distinkta områden av funktionalitet:

source: SSL protocol handling
sv: Hantering av SSL-protokoll

source: Network IO
sv: Nätverk IO

source: The network IO API is identical to that provided by :class:`socket.socket`, from which :class:`SSLSocket` also inherits. This allows an SSL socket to be used as a drop-in replacement for a regular socket, making it very easy to add SSL support to an existing application.
sv: API:et för nätverks-IO är identiskt med det som tillhandahålls av :class:`socket.socket`, som :class:`SSLSocket` också ärver från. Detta gör att en SSL-socket kan användas som en drop-in-ersättning för en vanlig socket, vilket gör det mycket enkelt att lägga till SSL-stöd i en befintlig applikation.

source: Combining SSL protocol handling and network IO usually works well, but there are some cases where it doesn't. An example is async IO frameworks that want to use a different IO multiplexing model than the "select/poll on a file descriptor" (readiness based) model that is assumed by :class:`socket.socket` and by the internal OpenSSL socket IO routines. This is mostly relevant for platforms like Windows where this model is not efficient. For this purpose, a reduced scope variant of :class:`SSLSocket` called :class:`SSLObject` is provided.
sv: Att kombinera SSL-protokollhantering och nätverks-IO fungerar vanligtvis bra, men det finns vissa fall där det inte gör det. Ett exempel är asynkrona IO-ramverk som vill använda en annan IO-multiplexeringsmodell än "select/poll on a file descriptor"-modellen (beredskapsbaserad) som antas av :class:`socket.socket` och av de interna OpenSSL-socket IO-rutinerna. Detta är mest relevant för plattformar som Windows där denna modell inte är effektiv. För detta ändamål tillhandahålls en variant med reducerat scope av :class:`SSLSocket` som kallas :class:`SSLObject`.

source: A reduced-scope variant of :class:`SSLSocket` representing an SSL protocol instance that does not contain any network IO methods. This class is typically used by framework authors that want to implement asynchronous IO for SSL through memory buffers.
sv: En reducerad variant av :class:`SSLSocket` som representerar en SSL-protokollinstans som inte innehåller några IO-metoder för nätverk. Den här klassen används vanligtvis av ramverksförfattare som vill implementera asynkron IO för SSL via minnesbuffertar.

source: This class implements an interface on top of a low-level SSL object as implemented by OpenSSL. This object captures the state of an SSL connection but does not provide any network IO itself. IO needs to be performed through separate "BIO" objects which are OpenSSL's IO abstraction layer.
sv: Den här klassen implementerar ett gränssnitt ovanpå ett SSL-objekt på låg nivå som implementeras av OpenSSL. Detta objekt fångar upp tillståndet för en SSL-anslutning men tillhandahåller inte någon egen nätverks-IO. IO måste utföras genom separata "BIO"-objekt som är OpenSSL:s abstraktionslager för IO.

source: This class has no public constructor. An :class:`SSLObject` instance must be created using the :meth:`~SSLContext.wrap_bio` method. This method will create the :class:`SSLObject` instance and bind it to a pair of BIOs. The *incoming* BIO is used to pass data from Python to the SSL protocol instance, while the *outgoing* BIO is used to pass data the other way around.
sv: Denna klass har ingen offentlig konstruktör. En instans av :class:`SSLObject` måste skapas med hjälp av metoden :meth:`~SSLContext.wrap_bio`. Denna metod skapar :class:`SSLObject`-instansen och binder den till ett par BIO:er. Den *inkommande* BIO används för att skicka data från Python till SSL-protokollinstansen, medan den *utgående* BIO används för att skicka data åt andra hållet.

source: The following methods are available:
sv: Följande metoder finns tillgängliga:

source: When compared to :class:`SSLSocket`, this object lacks the following features:
sv: Jämfört med :class:`SSLSocket` saknar detta objekt följande egenskaper:

source: Any form of network IO; ``recv()`` and ``send()`` read and write only to the underlying :class:`MemoryBIO` buffers.
sv: Alla former av nätverks-IO; ``recv()`` och ``send()`` läser och skriver endast till de underliggande :class:`MemoryBIO`-buffertarna.

source: There is no *do_handshake_on_connect* machinery. You must always manually call :meth:`~SSLSocket.do_handshake` to start the handshake.
sv: Det finns ingen *do_handshake_on_connect*-mekanism. Du måste alltid manuellt anropa :meth:`~SSLSocket.do_handshake` för att starta handskakningen.

source: There is no handling of *suppress_ragged_eofs*. All end-of-file conditions that are in violation of the protocol are reported via the :exc:`SSLEOFError` exception.
sv: Det finns ingen hantering av *suppress_ragged_eofs*. Alla villkor för filändar som bryter mot protokollet rapporteras via undantaget :exc:`SSLEOFError`.

source: The method :meth:`~SSLSocket.unwrap` call does not return anything, unlike for an SSL socket where it returns the underlying socket.
sv: Anropet till metoden :meth:`~SSLSocket.unwrap` returnerar ingenting, till skillnad från en SSL-socket där den underliggande sockeln returneras.

source: The *server_name_callback* callback passed to :meth:`SSLContext.set_servername_callback` will get an :class:`SSLObject` instance instead of a :class:`SSLSocket` instance as its first parameter.
sv: Den *server_name_callback* callback som skickas till :meth:`SSLContext.set_servername_callback` kommer att få en :class:`SSLObject`-instans istället för en :class:`SSLSocket`-instans som sin första parameter.

source: Some notes related to the use of :class:`SSLObject`:
sv: Några anteckningar relaterade till användningen av :class:`SSLObject`:

source: All IO on an :class:`SSLObject` is :ref:`non-blocking <ssl-nonblocking>`. This means that for example :meth:`~SSLSocket.read` will raise an :exc:`SSLWantReadError` if it needs more data than the incoming BIO has available.
sv: All IO på ett :class:`SSLObject` är :ref:``icke-blockerande <ssl-nonblocking>`. Detta innebär att till exempel :meth:`~SSLSocket.read` kommer att ge upphov till ett :exc:`SSLWantReadError` om det behöver mer data än vad det inkommande IO:t har tillgängligt.

source: :class:`SSLObject` instances must be created with :meth:`~SSLContext.wrap_bio`. In earlier versions, it was possible to create instances directly. This was never documented or officially supported.
sv: :class:`SSLObject`-instanser måste skapas med :meth:`~SSLContext.wrap_bio`. I tidigare versioner var det möjligt att skapa instanser direkt. Detta har aldrig dokumenterats eller fått officiellt stöd.

source: An SSLObject communicates with the outside world using memory buffers. The class :class:`MemoryBIO` provides a memory buffer that can be used for this purpose. It wraps an OpenSSL memory BIO (Basic IO) object:
sv: Ett SSLObject kommunicerar med omvärlden med hjälp av minnesbuffertar. Klassen :class:`MemoryBIO` tillhandahåller en minnesbuffert som kan användas för detta ändamål. Den omsluter ett OpenSSL-minne BIO-objekt (Basic IO):

source: A memory buffer that can be used to pass data between Python and an SSL protocol instance.
sv: En minnesbuffert som kan användas för att skicka data mellan Python och en SSL-protokollinstans.

source: Return the number of bytes currently in the memory buffer.
sv: Returnerar antalet bytes som för närvarande finns i minnesbufferten.

source: A boolean indicating whether the memory BIO is current at the end-of-file position.
sv: En boolean som anger om minnet BIO är aktuellt vid filens slutposition.

source: Read up to *n* bytes from the memory buffer. If *n* is not specified or negative, all bytes are returned.
sv: Läser upp till *n* bytes från minnesbufferten. Om *n* inte anges eller är negativ returneras alla byte.

source: Write the bytes from *buf* to the memory BIO. The *buf* argument must be an object supporting the buffer protocol.
sv: Skriv bytena från *buf* till minnet BIO. Argumentet *buf* måste vara ett objekt som stöder buffertprotokollet.

source: The return value is the number of bytes written, which is always equal to the length of *buf*.
sv: Returvärdet är antalet byte som skrivits, vilket alltid är lika med längden på *buf*.

source: Write an EOF marker to the memory BIO. After this method has been called, it is illegal to call :meth:`~MemoryBIO.write`. The attribute :attr:`eof` will become true after all data currently in the buffer has been read.
sv: Skriver en EOF-markör till minnet BIO. Efter att denna metod har anropats är det olagligt att anropa :meth:`~MemoryBIO.write`. Attributet :attr:`eof` kommer att bli sant efter att all data som för närvarande finns i bufferten har lästs.

source: Session object used by :attr:`~SSLSocket.session`.
sv: Sessionsobjekt som används av :attr:`~SSLSocket.session`.

source: Security considerations
sv: Överväganden om säkerhet

source: Best defaults
sv: Bästa standardvärden

source: For **client use**, if you don't have any special requirements for your security policy, it is highly recommended that you use the :func:`create_default_context` function to create your SSL context. It will load the system's trusted CA certificates, enable certificate validation and hostname checking, and try to choose reasonably secure protocol and cipher settings.
sv: För **klientanvändning**, om du inte har några särskilda krav på din säkerhetspolicy, rekommenderas starkt att du använder funktionen :func:`create_default_context` för att skapa din SSL-kontext. Den kommer att ladda systemets betrodda CA-certifikat, aktivera certifikatvalidering och värdnamnskontroll och försöka välja rimligt säkra protokoll- och chifferinställningar.

source: For example, here is how you would use the :class:`smtplib.SMTP` class to create a trusted, secure connection to a SMTP server::
sv: Så här kan du till exempel använda klassen :class:`smtplib.SMTP` för att skapa en betrodd, säker anslutning till en SMTP-server::

source: >>> import ssl, smtplib >>> smtp = smtplib.SMTP("mail.python.org", port=587) >>> context = ssl.create_default_context() >>> smtp.starttls(context=context) (220, b'2.0.0 Ready to start TLS')
sv: >>> import ssl, smtplib >>> smtp = smtplib.SMTP("mail.python.org", port=587) >>> context = ssl.create_default_context() >>> smtp.starttls(context=kontext) (220, b'2.0.0 Redo att starta TLS')

source: If a client certificate is needed for the connection, it can be added with :meth:`SSLContext.load_cert_chain`.
sv: Om det behövs ett klientcertifikat för anslutningen kan det läggas till med :meth:`SSLContext.load_cert_chain`.

source: By contrast, if you create the SSL context by calling the :class:`SSLContext` constructor yourself, it will not have certificate validation nor hostname checking enabled by default. If you do so, please read the paragraphs below to achieve a good security level.
sv: Om du däremot skapar SSL-kontexten genom att anropa :class:`SSLContext`-konstruktören själv, kommer den inte att ha certifikatvalidering eller kontroll av värdnamn aktiverat som standard. Om du gör det bör du läsa nedanstående stycken för att uppnå en bra säkerhetsnivå.

source: Manual settings
sv: Manuella inställningar

source: Verifying certificates
sv: Verifiering av certifikat

source: When calling the :class:`SSLContext` constructor directly, :const:`CERT_NONE` is the default. Since it does not authenticate the other peer, it can be insecure, especially in client mode where most of the time you would like to ensure the authenticity of the server you're talking to. Therefore, when in client mode, it is highly recommended to use :const:`CERT_REQUIRED`. However, it is in itself not sufficient; you also have to check that the server certificate, which can be obtained by calling :meth:`SSLSocket.getpeercert`, matches the desired service. For many protocols and applications, the service can be identified by the hostname. This common check is automatically performed when :attr:`SSLContext.check_hostname` is enabled.
sv: Vid direkt anrop av :class:`SSLContext`-konstruktören är :const:`CERT_NONE` standard. Eftersom den inte autentiserar den andra motparten kan det vara osäkert, särskilt i klientläge där du för det mesta vill säkerställa att servern du pratar med är äkta. I klientläge rekommenderas därför starkt att använda :const:`CERT_REQUIRED`. Det är dock inte tillräckligt i sig. Du måste också kontrollera att servercertifikatet, som kan erhållas genom att anropa :meth:`SSLSocket.getpeercert`, matchar den önskade tjänsten. För många protokoll och applikationer kan tjänsten identifieras med hjälp av värdnamnet. Denna vanliga kontroll utförs automatiskt när :attr:`SSLContext.check_hostname` är aktiverad.

source: Hostname matchings is now performed by OpenSSL. Python no longer uses :func:`match_hostname`.
sv: Matchning av värdnamn utförs nu av OpenSSL. Python använder inte längre :func:`match_hostname`.

source: In server mode, if you want to authenticate your clients using the SSL layer (rather than using a higher-level authentication mechanism), you'll also have to specify :const:`CERT_REQUIRED` and similarly check the client certificate.
sv: Om du i serverläget vill autentisera dina klienter med hjälp av SSL-lagret (i stället för att använda en autentiseringsmekanism på högre nivå) måste du också ange :const:`CERT_REQUIRED` och kontrollera klientcertifikatet på samma sätt.

source: Protocol versions
sv: Protokollversioner

source: SSL versions 2 and 3 are considered insecure and are therefore dangerous to use. If you want maximum compatibility between clients and servers, it is recommended to use :const:`PROTOCOL_TLS_CLIENT` or :const:`PROTOCOL_TLS_SERVER` as the protocol version. SSLv2 and SSLv3 are disabled by default.
sv: SSL version 2 och 3 anses vara osäkra och är därför farliga att använda. Om du vill ha maximal kompatibilitet mellan klienter och servrar rekommenderas det att du använder :const:`PROTOCOL_TLS_CLIENT` eller :const:`PROTOCOL_TLS_SERVER` som protokollversion. SSLv2 och SSLv3 är inaktiverade som standard.
