Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: The callback function will be called with three arguments; the first being the :class:`ssl.SSLSocket`, the second is a string that represents the server name that the client is intending to communicate (or :const:`None` if the TLS Client Hello does not contain a server name) and the third argument is the original :class:`SSLContext`. The server name argument is text. For internationalized domain name, the server name is an IDN A-label (``"xn--pythn-mua.org"``).
sv: Callback-funktionen anropas med tre argument; det första är :class:`ssl.SSLSocket`, det andra är en sträng som representerar det servernamn som klienten avser att kommunicera med (eller :const:`None` om TLS Client Hello inte innehåller något servernamn) och det tredje argumentet är det ursprungliga :class:`SSLContext`. Argumentet för servernamnet är text. För internationaliserade domännamn är servernamnet en IDN A-label (``"xn--pythn-mua.org"``).

source: A typical use of this callback is to change the :class:`ssl.SSLSocket`'s :attr:`SSLSocket.context` attribute to a new object of type :class:`SSLContext` representing a certificate chain that matches the server name.
sv: En typisk användning av denna callback är att ändra :class:`ssl.SSLSocket`:attr:`SSLSocket.context`-attributet till ett nytt objekt av typen :class:`SSLContext` som representerar en certifikatkedja som matchar servernamnet.

source: Due to the early negotiation phase of the TLS connection, only limited methods and attributes are usable like :meth:`SSLSocket.selected_alpn_protocol` and :attr:`SSLSocket.context`. The :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.get_verified_chain`, :meth:`SSLSocket.get_unverified_chain` :meth:`SSLSocket.cipher` and :meth:`SSLSocket.compression` methods require that the TLS connection has progressed beyond the TLS Client Hello and therefore will not return meaningful values nor can they be called safely.
sv: På grund av den tidiga förhandlingsfasen i TLS-anslutningen är endast begränsade metoder och attribut användbara, t.ex. :meth:`SSLSocket.selected_alpn_protocol` och :attr:`SSLSocket.context`. Metoderna :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.get_verified_chain`, :meth:`SSLSocket.get_unverified_chain` :meth:`SSLSocket.cipher` och :meth:`SSLSocket.compression` kräver att TLS-anslutningen har kommit längre än TLS Client Hello och returnerar därför inte meningsfulla värden och kan inte anropas på ett säkert sätt.

source: The *sni_callback* function must return ``None`` to allow the TLS negotiation to continue. If a TLS failure is required, a constant :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>` can be returned. Other return values will result in a TLS fatal error with :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.
sv: Funktionen *sni_callback* måste returnera ``None`` för att TLS-förhandlingen ska kunna fortsätta. Om ett TLS-fel krävs kan en konstant :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>` returneras. Andra returvärden kommer att resultera i ett TLS-fatal error med :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.

source: If an exception is raised from the *sni_callback* function the TLS connection will terminate with a fatal TLS alert message :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.
sv: Om ett undantag uppstår från funktionen *sni_callback* kommer TLS-anslutningen att avslutas med ett TLS-varningsmeddelande :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.

source: This method will raise :exc:`NotImplementedError` if the OpenSSL library had OPENSSL_NO_TLSEXT defined when it was built.
sv: Denna metod kommer att ge upphov till :exc:`NotImplementedError` om OpenSSL-biblioteket hade OPENSSL_NO_TLSEXT definierat när det byggdes.

source: This is a legacy API retained for backwards compatibility. When possible, you should use :attr:`sni_callback` instead. The given *server_name_callback* is similar to *sni_callback*, except that when the server hostname is an IDN-encoded internationalized domain name, the *server_name_callback* receives a decoded U-label (``"pythön.org"``).
sv: Detta är ett äldre API som behålls för bakåtkompatibilitet. När det är möjligt bör du använda :attr:`sni_callback` istället. Den givna *server_name_callback* liknar *sni_callback*, förutom att när serverns värdnamn är ett IDN-kodat internationaliserat domännamn, får *server_name_callback* en avkodad U-etikett (``"pythön.org"``).

source: If there is a decoding error on the server name, the TLS connection will terminate with an :const:`ALERT_DESCRIPTION_INTERNAL_ERROR` fatal TLS alert message to the client.
sv: Om det finns ett avkodningsfel på servernamnet kommer TLS-anslutningen att avslutas med ett :const:`ALERT_DESCRIPTION_INTERNAL_ERROR` fatalt TLS-varningsmeddelande till klienten.

source: Load the key generation parameters for Diffie-Hellman (DH) key exchange. Using DH key exchange improves forward secrecy at the expense of computational resources (both on the server and on the client). The *dhfile* parameter should be the path to a file containing DH parameters in PEM format.
sv: Ladda parametrarna för nyckelgenerering för Diffie-Hellman (DH)-nyckelutbyte. Genom att använda DH-nyckelutbyte förbättras forward secrecy på bekostnad av beräkningsresurser (både på servern och på klienten). Parametern *dhfile* ska vara sökvägen till en fil som innehåller DH-parametrar i PEM-format.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_DH_USE` option to further improve security.
sv: Den här inställningen gäller inte för klientsocklar. Du kan också använda alternativet :data:`OP_SINGLE_DH_USE` för att ytterligare förbättra säkerheten.

source: Set the curve name for Elliptic Curve-based Diffie-Hellman (ECDH) key exchange. ECDH is significantly faster than regular DH while arguably as secure. The *curve_name* parameter should be a string describing a well-known elliptic curve, for example ``prime256v1`` for a widely supported curve.
sv: Ange kurvans namn för ECDH-nyckelutbyte (Elliptic Curve-based Diffie-Hellman). ECDH är betydligt snabbare än vanlig DH, men förmodligen lika säkert. Parametern *curve_name* ska vara en sträng som beskriver en välkänd elliptisk kurva, t.ex. ``prime256v1`` för en kurva med brett stöd.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_ECDH_USE` option to further improve security.
sv: Den här inställningen gäller inte för klientsocklar. Du kan också använda alternativet :data:`OP_SINGLE_ECDH_USE` för att ytterligare förbättra säkerheten.

source: This method is not available if :data:`HAS_ECDH` is ``False``.
sv: Denna metod är inte tillgänglig om :data:`HAS_ECDH` är ``False``.

source: Wrap an existing Python socket *sock* and return an instance of :attr:`SSLContext.sslsocket_class` (default :class:`SSLSocket`). The returned SSL socket is tied to the context, its settings and certificates. *sock* must be a :const:`~socket.SOCK_STREAM` socket; other socket types are unsupported.
sv: Omfattar en befintlig Python-socket *sock* och returnerar en instans av :attr:`SSLContext.sslsocket_class` (standard :class:`SSLSocket`). Det returnerade SSL-uttaget är knutet till kontexten, dess inställningar och certifikat. *sock* måste vara ett :const:`~socket.SOCK_STREAM`-uttag; andra uttagstyper stöds inte.

source: The parameter ``server_side`` is a boolean which identifies whether server-side or client-side behavior is desired from this socket.
sv: Parametern ``server_side`` är en boolean som anger om det är server- eller klientsidans beteende som önskas från detta uttag.

source: For client-side sockets, the context construction is lazy; if the underlying socket isn't connected yet, the context construction will be performed after :meth:`connect` is called on the socket. For server-side sockets, if the socket has no remote peer, it is assumed to be a listening socket, and the server-side SSL wrapping is automatically performed on client connections accepted via the :meth:`accept` method. The method may raise :exc:`SSLError`.
sv: För uttag på klientsidan är kontextkonstruktionen lat; om det underliggande uttaget inte är anslutet ännu kommer kontextkonstruktionen att utföras efter att :meth:`connect` anropas på uttaget. För uttag på serversidan, om uttaget inte har någon fjärrpeer, antas det vara ett lyssnande uttag, och SSL-omslaget på serversidan utförs automatiskt på klientanslutningar som accepteras via metoden :meth:`accept`. Metoden kan ge upphov till :exc:`SSLError`.

source: On client connections, the optional parameter *server_hostname* specifies the hostname of the service which we are connecting to. This allows a single server to host multiple SSL-based services with distinct certificates, quite similarly to HTTP virtual hosts. Specifying *server_hostname* will raise a :exc:`ValueError` if *server_side* is true.
sv: Vid klientanslutningar anger den valfria parametern *server_hostname* värdnamnet på den tjänst som vi ansluter till. Detta gör att en enda server kan vara värd för flera SSL-baserade tjänster med olika certifikat, på liknande sätt som virtuella HTTP-värdar. Om *server_hostname* anges kommer ett :exc:`ValueError` att uppstå om *server_side* är true.

source: The parameter ``do_handshake_on_connect`` specifies whether to do the SSL handshake automatically after doing a :meth:`socket.connect`, or whether the application program will call it explicitly, by invoking the :meth:`SSLSocket.do_handshake` method. Calling :meth:`SSLSocket.do_handshake` explicitly gives the program control over the blocking behavior of the socket I/O involved in the handshake.
sv: Parametern ``do_handshake_on_connect`` anger om SSL-handskakningen ska göras automatiskt efter en :meth:`socket.connect`, eller om applikationsprogrammet ska göra det explicit genom att anropa metoden :meth:`SSLSocket.do_handshake`. Genom att anropa :meth:`SSLSocket.do_handshake` explicit får programmet kontroll över blockeringsbeteendet för socket I/O som är involverat i handskakningen.

source: The parameter ``suppress_ragged_eofs`` specifies how the :meth:`SSLSocket.recv` method should signal unexpected EOF from the other end of the connection. If specified as :const:`True` (the default), it returns a normal EOF (an empty bytes object) in response to unexpected EOF errors raised from the underlying socket; if :const:`False`, it will raise the exceptions back to the caller.
sv: Parametern ``suppress_ragged_eofs`` anger hur metoden :meth:`SSLSocket.recv` ska signalera oväntade EOF från den andra änden av anslutningen. Om den anges som :const:`True` (standard) returnerar den en normal EOF (ett tomt bytesobjekt) som svar på oväntade EOF-fel från den underliggande sockeln; om den anges som :const:`False` returneras undantagen tillbaka till anroparen.

source: *session*, see :attr:`~SSLSocket.session`.
sv: *session*, se :attr:`~SSLSocket.session`.

source: To wrap an :class:`SSLSocket` in another :class:`SSLSocket`, use :meth:`SSLContext.wrap_bio`.
sv: För att linda in en :class:`SSLSocket` i en annan :class:`SSLSocket`, använd :meth:`SSLContext.wrap_bio`.

source: Always allow a server_hostname to be passed, even if OpenSSL does not have SNI.
sv: Tillåt alltid att ett server_hostname skickas med, även om OpenSSL inte har SNI.

source: *session* argument was added.
sv: *session*-argumentet har lagts till.

source: The method returns an instance of :attr:`SSLContext.sslsocket_class` instead of hard-coded :class:`SSLSocket`.
sv: Metoden returnerar en instans av :attr:`SSLContext.sslsocket_class` istället för hårdkodad :class:`SSLSocket`.

source: The return type of :meth:`SSLContext.wrap_socket`, defaults to :class:`SSLSocket`. The attribute can be overridden on instance of class in order to return a custom subclass of :class:`SSLSocket`.
sv: Returtyp för :meth:`SSLContext.wrap_socket`, standard är :class:`SSLSocket`. Attributet kan åsidosättas på en instans av class för att returnera en anpassad underklass av :class:`SSLSocket`.

source: Wrap the BIO objects *incoming* and *outgoing* and return an instance of :attr:`SSLContext.sslobject_class` (default :class:`SSLObject`). The SSL routines will read input data from the incoming BIO and write data to the outgoing BIO.
sv: Packa in BIO-objekten *incoming* och *outgoing* och returnera en instans av :attr:`SSLContext.sslobject_class` (standard :class:`SSLObject`). SSL-rutinerna läser inmatningsdata från det inkommande BIO-objektet och skriver data till det utgående BIO-objektet.

source: The *server_side*, *server_hostname* and *session* parameters have the same meaning as in :meth:`SSLContext.wrap_socket`.
sv: Parametrarna *server_side*, *server_hostname* och *session* har samma betydelse som i :meth:`SSLContext.wrap_socket`.

source: The method returns an instance of :attr:`SSLContext.sslobject_class` instead of hard-coded :class:`SSLObject`.
sv: Metoden returnerar en instans av :attr:`SSLContext.sslobject_class` istället för hårdkodad :class:`SSLObject`.

source: The return type of :meth:`SSLContext.wrap_bio`, defaults to :class:`SSLObject`. The attribute can be overridden on instance of class in order to return a custom subclass of :class:`SSLObject`.
sv: Returtyp för :meth:`SSLContext.wrap_bio`, standard är :class:`SSLObject`. Attributet kan åsidosättas på en instans av class för att returnera en anpassad underklass av :class:`SSLObject`.

source: Get statistics about the SSL sessions created or managed by this context. A dictionary is returned which maps the names of each `piece of information <https://docs.openssl.org/1.1.1/man3/SSL_CTX_sess_number/>`_ to their numeric values. For example, here is the total number of hits and misses in the session cache since the context was created::
sv: Hämta statistik om de SSL-sessioner som skapats eller hanterats av detta sammanhang. En ordbok returneras som mappar namnen på varje "informationsdel" <https://docs.openssl.org/1.1.1/man3/SSL_CTX_sess_number/>`_ till deras numeriska värden. Här visas t.ex. det totala antalet träffar och missar i sessionscachen sedan kontexten skapades::

source: >>> stats = context.session_stats() >>> stats['hits'], stats['misses'] (0, 0)
sv: >>> statistik = context.session_stats() >>> stats['träffar'], stats['missar'] (0, 0)

source: Whether to match the peer cert's hostname in :meth:`SSLSocket.do_handshake`. The context's :attr:`~SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, and you must pass *server_hostname* to :meth:`~SSLContext.wrap_socket` in order to match the hostname. Enabling hostname checking automatically sets :attr:`~SSLContext.verify_mode` from :data:`CERT_NONE` to :data:`CERT_REQUIRED`. It cannot be set back to :data:`CERT_NONE` as long as hostname checking is enabled. The :data:`PROTOCOL_TLS_CLIENT` protocol enables hostname checking by default. With other protocols, hostname checking must be enabled explicitly.
sv: Huruvida peer-certifikatets värdnamn ska matchas i :meth:`SSLSocket.do_handshake`. Kontextens :attr:`~SSLContext.verify_mode` måste vara inställd på :data:`CERT_OPTIONAL` eller :data:`CERT_REQUIRED`, och du måste skicka *server_hostname* till :meth:`~SSLContext.wrap_socket` för att matcha värdnamnet. Om du aktiverar kontroll av värdnamn ställs :attr:`~SSLContext.verify_mode` automatiskt in från :data:`CERT_NONE` till :data:`CERT_REQUIRED`. Det kan inte sättas tillbaka till :data:`CERT_NONE` så länge värdnamnskontrollen är aktiverad. Protokollet :data:`PROTOCOL_TLS_CLIENT` aktiverar värdnamnskontroll som standard. Med andra protokoll måste värdnamnskontroll aktiveras uttryckligen.

source: :attr:`~SSLContext.verify_mode` is now automatically changed to :data:`CERT_REQUIRED` when hostname checking is enabled and :attr:`~SSLContext.verify_mode` is :data:`CERT_NONE`. Previously the same operation would have failed with a :exc:`ValueError`.
sv: :attr:`~SSLContext.verify_mode` ändras nu automatiskt till :data:`CERT_REQUIRED` när kontroll av värdnamn är aktiverat och :attr:`~SSLContext.verify_mode` är :data:`CERT_NONE`. Tidigare skulle samma operation ha misslyckats med ett :exc:`ValueError`.

source: Write TLS keys to a keylog file, whenever key material is generated or received. The keylog file is designed for debugging purposes only. The file format is specified by NSS and used by many traffic analyzers such as Wireshark. The log file is opened in append-only mode. Writes are synchronized between threads, but not between processes.
sv: Skriv TLS-nycklar till en keylog-fil när nyckelmaterial genereras eller tas emot. Keylog-filen är endast avsedd för felsökningsändamål. Filformatet specificeras av NSS och används av många trafikanalysatorer, t.ex. Wireshark. Loggfilen öppnas i append-only-läge. Skrivningar synkroniseras mellan trådar, men inte mellan processer.

source: A :class:`TLSVersion` enum member representing the highest supported TLS version. The value defaults to :attr:`TLSVersion.MAXIMUM_SUPPORTED`. The attribute is read-only for protocols other than :const:`PROTOCOL_TLS`, :const:`PROTOCOL_TLS_CLIENT`, and :const:`PROTOCOL_TLS_SERVER`.
sv: En :class:`TLSVersion` enum-medlem som representerar den högsta TLS-versionen som stöds. Standardvärdet är :attr:`TLSVersion.MAXIMUM_SUPPORTED`. Attributet är skrivskyddat för andra protokoll än :const:`PROTOCOL_TLS`, :const:`PROTOCOL_TLS_CLIENT` och :const:`PROTOCOL_TLS_SERVER`.

source: The attributes :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` and :attr:`SSLContext.options` all affect the supported SSL and TLS versions of the context. The implementation does not prevent invalid combination. For example a context with :attr:`OP_NO_TLSv1_2` in :attr:`~SSLContext.options` and :attr:`~SSLContext.maximum_version` set to :attr:`TLSVersion.TLSv1_2` will not be able to establish a TLS 1.2 connection.
sv: Attributen :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` och :attr:`SSLContext.options` påverkar alla de SSL- och TLS-versioner som stöds av kontexten. Implementationen förhindrar inte ogiltiga kombinationer. Till exempel kommer en kontext med :attr:`OP_NO_TLSv1_2` i :attr:`~SSLContext.options` och :attr:`~SSLContext.maximum_version` satt till :attr:`TLSVersion.TLSv1_2` inte att kunna upprätta en TLS 1.2-anslutning.

source: Like :attr:`SSLContext.maximum_version` except it is the lowest supported version or :attr:`TLSVersion.MINIMUM_SUPPORTED`.
sv: Som :attr:`SSLContext.maximum_version` förutom att det är den lägsta versionen som stöds eller :attr:`TLSVersion.MINIMUM_SUPPORTED`.

source: Control the number of TLS 1.3 session tickets of a :const:`PROTOCOL_TLS_SERVER` context. The setting has no impact on TLS 1.0 to 1.2 connections.
sv: Styr antalet TLS 1.3-sessionsbiljetter för en :const:`PROTOCOL_TLS_SERVER`-kontext. Inställningen har ingen inverkan på TLS 1.0 till 1.2-anslutningar.

source: An integer representing the set of SSL options enabled on this context. The default value is :data:`OP_ALL`, but you can specify other options such as :data:`OP_NO_SSLv2` by ORing them together.
sv: Ett heltal som representerar den uppsättning SSL-alternativ som är aktiverade i detta sammanhang. Standardvärdet är :data:`OP_ALL`, men du kan ange andra alternativ som t.ex. :data:`OP_NO_SSLv2` genom att sätta ihop dem med OR.

source: :attr:`SSLContext.options` returns :class:`Options` flags:
sv: :attr:`SSLContext.options` returnerar :class:`Options` flaggor:

source: All ``OP_NO_SSL*`` and ``OP_NO_TLS*`` options have been deprecated since Python 3.7. Use :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
sv: Alla ``OP_NO_SSL*`` och ``OP_NO_TLS*`` alternativ har blivit föråldrade sedan Python 3.7. Använd :attr:`SSLContext.minimum_version` och :attr:`SSLContext.maximum_version` istället.

source: Enable TLS 1.3 post-handshake client authentication. Post-handshake auth is disabled by default and a server can only request a TLS client certificate during the initial handshake. When enabled, a server may request a TLS client certificate at any time after the handshake.
sv: Aktivera TLS 1.3-klientautentisering efter handskakning. Autentisering efter handskakning är inaktiverad som standard och en server kan bara begära ett TLS-klientcertifikat under den inledande handskakningen. När den är aktiverad kan en server begära ett TLS-klientcertifikat när som helst efter handskakningen.

source: When enabled on client-side sockets, the client signals the server that it supports post-handshake authentication.
sv: När den är aktiverad på sockets på klientsidan signalerar klienten till servern att den stöder autentisering efter handskakning.

source: When enabled on server-side sockets, :attr:`SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, too. The actual client cert exchange is delayed until :meth:`SSLSocket.verify_client_post_handshake` is called and some I/O is performed.
sv: När det är aktiverat på server-sidans socklar måste :attr:`SSLContext.verify_mode` också vara inställt på :data:`CERT_OPTIONAL` eller :data:`CERT_REQUIRED`. Det faktiska utbytet av klientcertifikat fördröjs tills :meth:`SSLSocket.verify_client_post_handshake` anropas och vissa I/O utförs.

source: The protocol version chosen when constructing the context. This attribute is read-only.
sv: Den protokollversion som valdes när kontexten konstruerades. Detta attribut är skrivskyddat.

source: Whether :attr:`~SSLContext.check_hostname` falls back to verify the cert's subject common name in the absence of a subject alternative name extension (default: true).
sv: Om :attr:`~SSLContext.check_hostname` faller tillbaka för att verifiera certets gemensamma ämnesnamn i avsaknad av ett alternativt ämnesnamnstillägg (standard: true).

source: The flag had no effect with OpenSSL before version 1.1.1l. Python 3.8.9, 3.9.3, and 3.10 include workarounds for previous versions.
sv: Flaggan hade ingen effekt med OpenSSL före version 1.1.1l. Python 3.8.9, 3.9.3 och 3.10 innehåller lösningar för tidigare versioner.

source: An integer representing the `security level <https://docs.openssl.org/master/man3/SSL_CTX_get_security_level/>`_ for the context. This attribute is read-only.
sv: Ett heltal som representerar `säkerhetsnivån <https://docs.openssl.org/master/man3/SSL_CTX_get_security_level/>`_ för kontexten. Detta attribut är skrivskyddat.

source: The flags for certificate verification operations. You can set flags like :data:`VERIFY_CRL_CHECK_LEAF` by ORing them together. By default OpenSSL does neither require nor verify certificate revocation lists (CRLs).
sv: Flaggorna för verifiering av certifikat. Du kan ange flaggor som :data:`VERIFY_CRL_CHECK_LEAF` genom att sätta ihop dem med OR. Som standard varken kräver eller verifierar OpenSSL återkallningslistor för certifikat (CRL).

source: :attr:`SSLContext.verify_flags` returns :class:`VerifyFlags` flags:
sv: :attr:`SSLContext.verify_flags` returnerar :class:`VerifyFlags` flaggor:

source: Whether to try to verify other peers' certificates and how to behave if verification fails. This attribute must be one of :data:`CERT_NONE`, :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`.
sv: Om man ska försöka verifiera andra peers certifikat och hur man ska agera om verifieringen misslyckas. Detta attribut måste vara ett av :data:`CERT_NONE`, :data:`CERT_OPTIONAL` eller :data:`CERT_REQUIRED`.

source: :attr:`SSLContext.verify_mode` returns :class:`VerifyMode` enum:
sv: :attr:`SSLContext.verify_mode` returnerar :class:`VerifyMode` enum:

source: Enables TLS-PSK (pre-shared key) authentication on a client-side connection.
sv: Aktiverar TLS-PSK-autentisering (pre-shared key) på en anslutning på klientsidan.

source: In general, certificate based authentication should be preferred over this method.
sv: I allmänhet bör certifikatbaserad autentisering föredras framför denna metod.
