Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: Performs the SSL shutdown handshake, which removes the TLS layer from the underlying socket, and returns the underlying socket object. This can be used to go from encrypted operation over a connection to unencrypted. The returned socket should always be used for further communication with the other side of the connection, rather than the original socket.
sv: Utför SSL-avstängningshandskakningen, som tar bort TLS-lagret från det underliggande uttaget, och returnerar det underliggande uttagsobjektet. Detta kan användas för att gå från krypterad drift över en anslutning till okrypterad. Det returnerade uttaget bör alltid användas för vidare kommunikation med den andra sidan av anslutningen, snarare än det ursprungliga uttaget.

source: Requests post-handshake authentication (PHA) from a TLS 1.3 client. PHA can only be initiated for a TLS 1.3 connection from a server-side socket, after the initial TLS handshake and with PHA enabled on both sides, see :attr:`SSLContext.post_handshake_auth`.
sv: Begär PHA (post-handshake authentication) från en TLS 1.3-klient. PHA kan endast initieras för en TLS 1.3-anslutning från ett server-sidesockel, efter den inledande TLS-handskakningen och med PHA aktiverat på båda sidor, se :attr:`SSLContext.post_handshake_auth`.

source: The method does not perform a cert exchange immediately. The server-side sends a CertificateRequest during the next write event and expects the client to respond with a certificate on the next read event.
sv: Metoden utför inte ett cert-utbyte omedelbart. Serversidan skickar en CertificateRequest vid nästa skrivhändelse och förväntar sig att klienten svarar med ett certifikat vid nästa läshändelse.

source: If any precondition isn't met (e.g. not TLS 1.3, PHA not enabled), an :exc:`SSLError` is raised.
sv: Om något förhandsvillkor inte uppfylls (t.ex. inte TLS 1.3, PHA inte aktiverat), utlöses ett :exc:`SSLError`.

source: Only available with OpenSSL 1.1.1 and TLS 1.3 enabled. Without TLS 1.3 support, the method raises :exc:`NotImplementedError`.
sv: Endast tillgänglig med OpenSSL 1.1.1 och TLS 1.3 aktiverat. Utan stöd för TLS 1.3 ger metoden upphov till :exc:`NotImplementedError`.

source: Return the actual SSL protocol version negotiated by the connection as a string, or ``None`` if no secure connection is established. As of this writing, possible return values include ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` and ``"TLSv1.2"``. Recent OpenSSL versions may define more return values.
sv: Returnerar den faktiska SSL-protokollversionen som förhandlats fram av anslutningen som en sträng, eller ``None`` om ingen säker anslutning upprättas. I skrivande stund inkluderar möjliga returvärden ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` och ``"TLSv1.2"``. Nyare OpenSSL-versioner kan definiera fler returvärden.

source: Returns the number of already decrypted bytes available for read, pending on the connection.
sv: Returnerar antalet redan dekrypterade bytes som är tillgängliga för läsning, i väntan på anslutningen.

source: The :class:`SSLContext` object this SSL socket is tied to.
sv: Det :class:`SSLContext`-objekt som detta SSL-uttag är knutet till.

source: A boolean which is ``True`` for server-side sockets and ``False`` for client-side sockets.
sv: En boolean som är ``True`` för server-sidans uttag och ``False`` för klient-sidans uttag.

source: Hostname of the server: :class:`str` type, or ``None`` for server-side socket or if the hostname was not specified in the constructor.
sv: Värdnamn för servern: :class:`str`-typ, eller ``None`` för server-side socket eller om värdnamnet inte angavs i konstruktören.

source: The attribute is now always ASCII text. When ``server_hostname`` is an internationalized domain name (IDN), this attribute now stores the A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``).
sv: Attributet är nu alltid ASCII-text. När ``server_hostname`` är ett internationaliserat domännamn (IDN) lagrar detta attribut nu A-märkningsformen (``"xn--pythn-mua.org"``) i stället för U-märkningsformen (``"pythön.org"``).

source: The :class:`SSLSession` for this SSL connection. The session is available for client and server side sockets after the TLS handshake has been performed. For client sockets the session can be set before :meth:`~SSLSocket.do_handshake` has been called to reuse a session.
sv: :class:`SSLSession` för denna SSL-anslutning. Sessionen är tillgänglig för uttag på klient- och serversidan efter att TLS-handskakningen har utförts. För klientuttag kan sessionen ställas in innan :meth:`~SSLSocket.do_handshake` har anropats för att återanvända en session.

source: SSL Contexts
sv: SSL-kontexter

source: An SSL context holds various data longer-lived than single SSL connections, such as SSL configuration options, certificate(s) and private key(s). It also manages a cache of SSL sessions for server-side sockets, in order to speed up repeated connections from the same clients.
sv: En SSL-kontext innehåller olika data som är mer långlivade än enskilda SSL-anslutningar, t.ex. SSL-konfigurationsalternativ, certifikat och privata nycklar. Den hanterar också en cache för SSL-sessioner för uttag på serversidan, för att snabba upp upprepade anslutningar från samma klienter.

source: Create a new SSL context. You may pass *protocol* which must be one of the ``PROTOCOL_*`` constants defined in this module. The parameter specifies which version of the SSL protocol to use. Typically, the server chooses a particular protocol version, and the client must adapt to the server's choice. Most of the versions are not interoperable with the other versions. If not specified, the default is :data:`PROTOCOL_TLS`; it provides the most compatibility with other versions.
sv: Skapa en ny SSL-kontext. Du kan skicka *protocol* som måste vara en av ``PROTOCOL_*``-konstanterna som definieras i den här modulen. Parametern anger vilken version av SSL-protokollet som ska användas. Vanligtvis väljer servern en viss protokollversion och klienten måste anpassa sig till serverns val. De flesta av versionerna är inte kompatibla med andra versioner. Om inget anges är standardvärdet :data:`PROTOCOL_TLS`; det ger störst kompatibilitet med andra versioner.

source: Here's a table showing which versions in a client (down the side) can connect to which versions in a server (along the top):
sv: Här är en tabell som visar vilka versioner i en klient (längst ned på sidan) som kan ansluta till vilka versioner i en server (längst upp):

source: *client* / **server**
sv: *klient* / **server**

source: **TLS** [3]_
sv: **TLS** [3]_ _TLS

source: yes
sv: ja

source: no
sv: nej

source: Footnotes
sv: Fotnoter

source: :class:`SSLContext` disables SSLv2 with :data:`OP_NO_SSLv2` by default.
sv: :class:`SSLContext` inaktiverar SSLv2 med :data:`OP_NO_SSLv2` som standard.

source: :class:`SSLContext` disables SSLv3 with :data:`OP_NO_SSLv3` by default.
sv: :class:`SSLContext` inaktiverar SSLv3 med :data:`OP_NO_SSLv3` som standard.

source: TLS 1.3 protocol will be available with :data:`PROTOCOL_TLS` in OpenSSL >= 1.1.1. There is no dedicated PROTOCOL constant for just TLS 1.3.
sv: TLS 1.3-protokollet kommer att vara tillgängligt med :data:`PROTOCOL_TLS` i OpenSSL >= 1.1.1. Det finns ingen dedikerad PROTOCOL-konstant för just TLS 1.3.

source: :func:`create_default_context` lets the :mod:`ssl` module choose security settings for a given purpose.
sv: :func:`create_default_context` låter :mod:`ssl`-modulen välja säkerhetsinställningar för ett visst syfte.

source: The context is created with secure default values. The options :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2`, and :data:`OP_NO_SSLv3` (except for :data:`PROTOCOL_SSLv3`) are set by default. The initial cipher suite list contains only ``HIGH`` ciphers, no ``NULL`` ciphers and no ``MD5`` ciphers.
sv: Kontexten skapas med säkra standardvärden. Alternativen :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2` och :data:`OP_NO_SSLv3` (utom för :data:`PROTOCOL_SSLv3`) anges som standard. Den ursprungliga listan över chiffersviter innehåller endast chiffer av typen ``HIGH``, inga chiffer av typen ``NULL`` och inga chiffer av typen ``MD5``.

source: :class:`SSLContext` without protocol argument is deprecated. The context class will either require :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol in the future.
sv: :class:`SSLContext` utan protokollargument är föråldrad. Kontextklassen kommer antingen att kräva :data:`PROTOCOL_TLS_CLIENT` eller :data:`PROTOCOL_TLS_SERVER` protokoll i framtiden.

source: The default cipher suites now include only secure AES and ChaCha20 ciphers with forward secrecy and security level 2. RSA and DH keys with less than 2048 bits and ECC keys with less than 224 bits are prohibited. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT`, and :data:`PROTOCOL_TLS_SERVER` use TLS 1.2 as minimum TLS version.
sv: Standardchiffersviterna innehåller nu endast säkra AES- och ChaCha20-chiffer med forward secrecy och säkerhetsnivå 2. RSA- och DH-nycklar med mindre än 2048 bitar och ECC-nycklar med mindre än 224 bitar är förbjudna. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT`, och :data:`PROTOCOL_TLS_SERVER` använder TLS 1.2 som minsta TLS-version.

source: :class:`SSLContext` only supports limited mutation once it has been used by a connection. Adding new certificates to the internal trust store is allowed, but changing ciphers, verification settings, or mTLS certificates may result in surprising behavior.
sv: :class:`SSLContext` stöder endast begränsad mutation när den har använts av en anslutning. Det är tillåtet att lägga till nya certifikat i det interna förtroendearkivet, men att ändra chiffer, verifieringsinställningar eller mTLS-certifikat kan resultera i överraskande beteende.

source: :class:`SSLContext` is designed to be shared and used by multiple connections. Thus, it is thread-safe as long as it is not reconfigured after being used by a connection.
sv: :class:`SSLContext` är utformad för att delas och användas av flera anslutningar. Den är alltså trådsäker så länge den inte konfigureras om efter att ha använts av en anslutning.

source: :class:`SSLContext` objects have the following methods and attributes:
sv: :class:`SSLContext`-objekt har följande metoder och attribut:

source: Get statistics about quantities of loaded X.509 certificates, count of X.509 certificates flagged as CA certificates and certificate revocation lists as dictionary.
sv: Hämta statistik över antal laddade X.509-certifikat, antal X.509-certifikat som markerats som CA-certifikat och spärrlistor som ordlista.

source: Example for a context with one CA cert and one other cert::
sv: Exempel för en kontext med ett CA-cert och ett annat cert::

source: Load a private key and the corresponding certificate. The *certfile* string must be the path to a single file in PEM format containing the certificate as well as any number of CA certificates needed to establish the certificate's authenticity. The *keyfile* string, if present, must point to a file containing the private key. Otherwise the private key will be taken from *certfile* as well. See the discussion of :ref:`ssl-certificates` for more information on how the certificate is stored in the *certfile*.
sv: Läser in en privat nyckel och motsvarande certifikat. Strängen *certfile* måste vara sökvägen till en enda fil i PEM-format som innehåller certifikatet samt valfritt antal CA-certifikat som behövs för att fastställa certifikatets äkthet. Strängen *keyfile* måste, om den finns, peka på en fil som innehåller den privata nyckeln. I annat fall hämtas den privata nyckeln även från *certfile*. Se diskussionen i :ref:`ssl-certificates` för mer information om hur certifikatet lagras i *certfile*.

source: The *password* argument may be a function to call to get the password for decrypting the private key. It will only be called if the private key is encrypted and a password is necessary. It will be called with no arguments, and it should return a string, bytes, or bytearray. If the return value is a string it will be encoded as UTF-8 before using it to decrypt the key. Alternatively a string, bytes, or bytearray value may be supplied directly as the *password* argument. It will be ignored if the private key is not encrypted and no password is needed.
sv: Argumentet *password* kan vara en funktion som ska anropas för att få lösenordet för dekryptering av den privata nyckeln. Funktionen anropas endast om den privata nyckeln är krypterad och ett lösenord är nödvändigt. Den anropas utan argument och ska returnera en sträng, bytes eller bytearray. Om returvärdet är en sträng kommer den att kodas som UTF-8 innan den används för att dekryptera nyckeln. Alternativt kan ett värde i form av en sträng, bytes eller bytearray anges direkt som argument för *password*. Det ignoreras om den privata nyckeln inte är krypterad och inget lösenord behövs.

source: If the *password* argument is not specified and a password is required, OpenSSL's built-in password prompting mechanism will be used to interactively prompt the user for a password.
sv: Om argumentet *password* inte anges och ett lösenord krävs, kommer OpenSSL:s inbyggda mekanism för lösenordsuppmaning att användas för att interaktivt uppmana användaren att ange ett lösenord.

source: An :class:`SSLError` is raised if the private key doesn't match with the certificate.
sv: Ett :class:`SSLError` uppstår om den privata nyckeln inte stämmer överens med certifikatet.

source: New optional argument *password*.
sv: Nytt valfritt argument *password*.

source: Load a set of default "certification authority" (CA) certificates from default locations. On Windows it loads CA certs from the ``CA`` and ``ROOT`` system stores. On all systems it calls :meth:`SSLContext.set_default_verify_paths`. In the future the method may load CA certificates from other locations, too.
sv: Ladda en uppsättning standardcertifikat för "certifikatutfärdare" (CA) från standardplatser. I Windows laddas CA-certifikat från systemlagren ``CA`` och ``ROOT``. På alla system anropar den :meth:`SSLContext.set_default_verify_paths`. I framtiden kan metoden komma att ladda CA-certifikat från andra platser också.

source: The *purpose* flag specifies what kind of CA certificates are loaded. The default settings :const:`Purpose.SERVER_AUTH` loads certificates, that are flagged and trusted for TLS web server authentication (client side sockets). :const:`Purpose.CLIENT_AUTH` loads CA certificates for client certificate verification on the server side.
sv: Flaggan *purpose* anger vilken typ av CA-certifikat som läses in. Standardinställningarna :const:`Purpose.SERVER_AUTH` laddar certifikat som är flaggade och betrodda för TLS-autentisering av webbservern (sockets på klientsidan). :const:`Purpose.CLIENT_AUTH` laddar CA-certifikat för verifiering av klientcertifikat på serversidan.

source: Load a set of "certification authority" (CA) certificates used to validate other peers' certificates when :data:`verify_mode` is other than :data:`CERT_NONE`. At least one of *cafile* or *capath* must be specified.
sv: Läser in en uppsättning certifikat från "Certification Authority" (CA) som används för att validera andra peers certifikat när :data:`verify_mode` är något annat än :data:`CERT_NONE`. Åtminstone en av *cafile* eller *capath* måste anges.

source: This method can also load certification revocation lists (CRLs) in PEM or DER format. In order to make use of CRLs, :attr:`SSLContext.verify_flags` must be configured properly.
sv: Den här metoden kan också läsa in CRL:er (Certification Revocation List) i PEM- eller DER-format. För att kunna använda CRL:er måste :attr:`SSLContext.verify_flags` vara korrekt konfigurerad.

source: The *cafile* string, if present, is the path to a file of concatenated CA certificates in PEM format. See the discussion of :ref:`ssl-certificates` for more information about how to arrange the certificates in this file.
sv: Strängen *cafile*, om den finns, är sökvägen till en fil med sammanlänkade certifikat från certifikatutfärdare i PEM-format. Se diskussionen om :ref:`ssl-certificates` för mer information om hur du ordnar certifikaten i den här filen.

source: The *capath* string, if present, is the path to a directory containing several CA certificates in PEM format, following an `OpenSSL specific layout <https://docs.openssl.org/master/man3/SSL_CTX_load_verify_locations/>`_.
sv: Strängen *capath*, om den finns, är sökvägen till en katalog som innehåller flera CA-certifikat i PEM-format, enligt en `OpenSSL-specifik layout <https://docs.openssl.org/master/man3/SSL_CTX_load_verify_locations/>`_.

source: The *cadata* object, if present, is either an ASCII string of one or more PEM-encoded certificates or a :term:`bytes-like object` of DER-encoded certificates. Like with *capath* extra lines around PEM-encoded certificates are ignored but at least one certificate must be present.
sv: Objektet *cadata*, om det finns, är antingen en ASCII-sträng med ett eller flera PEM-kodade certifikat eller ett :term:`bytesliknande objekt` med DER-kodade certifikat. Precis som med *capath* ignoreras extra rader runt PEM-kodade certifikat, men minst ett certifikat måste finnas med.

source: New optional argument *cadata*
sv: Nytt valfritt argument *cadata*

source: Get a list of loaded "certification authority" (CA) certificates. If the ``binary_form`` parameter is :const:`False` each list entry is a dict like the output of :meth:`SSLSocket.getpeercert`. Otherwise the method returns a list of DER-encoded certificates. The returned list does not contain certificates from *capath* unless a certificate was requested and loaded by a SSL connection.
sv: Hämta en lista med laddade certifikat från certifikatutfärdare (CA). Om parametern ``binary_form`` är :const:`False`` är varje post i listan en dikt som utdata från :meth:`SSLSocket.getpeercert`. Annars returnerar metoden en lista med DER-kodade certifikat. Den returnerade listan innehåller inte certifikat från *capath* om inte ett certifikat begärdes och laddades av en SSL-anslutning.

source: Certificates in a capath directory aren't loaded unless they have been used at least once.
sv: Certifikat i en capath-katalog läses inte in om de inte har använts minst en gång.

source: Get a list of enabled ciphers. The list is in order of cipher priority. See :meth:`SSLContext.set_ciphers`.
sv: Hämta en lista över aktiverade chiffer. Listan är i ordning efter chifferprioritet. Se :meth:`SSLContext.set_ciphers`.

source: Load a set of default "certification authority" (CA) certificates from a filesystem path defined when building the OpenSSL library. Unfortunately, there's no easy way to know whether this method succeeds: no error is returned if no certificates are to be found. When the OpenSSL library is provided as part of the operating system, though, it is likely to be configured properly.
sv: Ladda en uppsättning standardcertifikat från en certifikatutfärdare (CA) från en filsystemssökväg som definieras när OpenSSL-biblioteket byggs. Tyvärr finns det inget enkelt sätt att veta om den här metoden lyckas: inget fel returneras om inga certifikat hittas. När OpenSSL-biblioteket tillhandahålls som en del av operativsystemet är det dock troligt att det är korrekt konfigurerat.

source: Set the available ciphers for sockets created with this context. It should be a string in the `OpenSSL cipher list format <https://docs.openssl.org/master/man1/ciphers/>`_. If no cipher can be selected (because compile-time options or other configuration forbids use of all the specified ciphers), an :class:`SSLError` will be raised.
sv: Ange tillgängliga chiffer för uttag som skapats med detta sammanhang. Det bör vara en sträng i formatet `OpenSSL cipher list <https://docs.openssl.org/master/man1/ciphers/>`_. Om inget chiffer kan väljas (eftersom kompileringstidsalternativ eller annan konfiguration förbjuder användning av alla angivna chiffer), kommer ett :class:`SSLError` att uppstå.

source: when connected, the :meth:`SSLSocket.cipher` method of SSL sockets will give the currently selected cipher.
sv: när du är ansluten kommer :meth:`SSLSocket.cipher`-metoden för SSL-uttag att ge det aktuella valda chiffret.

source: TLS 1.3 cipher suites cannot be disabled with :meth:`~SSLContext.set_ciphers`.
sv: TLS 1.3-chiffersviter kan inte inaktiveras med :meth:`~SSLContext.set_ciphers`.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of ASCII strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to :rfc:`7301`. After a successful handshake, the :meth:`SSLSocket.selected_alpn_protocol` method will return the agreed-upon protocol.
sv: Ange vilka protokoll som uttaget ska annonsera under SSL/TLS-handskakningen. Det bör vara en lista med ASCII-strängar, som ``['http/1.1', 'spdy/2']``, ordnade efter preferens. Valet av protokoll kommer att ske under handskakningen, och kommer att ske enligt :rfc:`7301`. Efter en lyckad handskakning kommer metoden :meth:`SSLSocket.selected_alpn_protocol` att returnera det överenskomna protokollet.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_ALPN` is ``False``.
sv: Denna metod ger upphov till :exc:`NotImplementedError` om :data:`HAS_ALPN` är ``False``.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to the `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. After a successful handshake, the :meth:`SSLSocket.selected_npn_protocol` method will return the agreed-upon protocol.
sv: Ange vilka protokoll som uttaget ska annonsera under SSL/TLS-handskakningen. Det bör vara en lista med strängar, till exempel ``['http/1.1', 'spdy/2']``, ordnade efter preferens. Valet av protokoll kommer att ske under handskakningen och kommer att ske i enlighet med `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. Efter en lyckad handskakning kommer metoden :meth:`SSLSocket.selected_npn_protocol` att returnera det överenskomna protokollet.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_NPN` is ``False``.
sv: Denna metod ger upphov till :exc:`NotImplementedError` om :data:`HAS_NPN` är ``False``.

source: Register a callback function that will be called after the TLS Client Hello handshake message has been received by the SSL/TLS server when the TLS client specifies a server name indication. The server name indication mechanism is specified in :rfc:`6066` section 3 - Server Name Indication.
sv: Registrera en återuppringningsfunktion som kommer att anropas efter att handskakningsmeddelandet TLS Client Hello har mottagits av SSL/TLS-servern när TLS-klienten anger en servernamnindikation. Mekanismen för indikering av servernamn specificeras i :rfc:`6066` avsnitt 3 - Server Name Indication.

source: Only one callback can be set per ``SSLContext``. If *sni_callback* is set to ``None`` then the callback is disabled. Calling this function a subsequent time will disable the previously registered callback.
sv: Endast en återuppringning kan ställas in per ``SSLContext``. Om *sni_callback* är inställd på ``None`` inaktiveras återuppringningen. Anrop av denna funktion en senare gång inaktiverar den tidigare registrerade återuppringningen.
