Repository: yeager/python-docs-sv
Catalog: library/ssl.po
Languages: sv

source: :mod:`!ssl` --- TLS/SSL wrapper for socket objects
sv: :mod:`!ssl` --- TLS/SSL-omslag för socket-objekt

source: **Source code:** :source:`Lib/ssl.py`
sv: **Källkod:** :source:`Lib/ssl.py`

source: This module provides access to Transport Layer Security (often known as "Secure Sockets Layer") encryption and peer authentication facilities for network sockets, both client-side and server-side. This module uses the OpenSSL library. It is available on all modern Unix systems, Windows, macOS, and probably additional platforms, as long as OpenSSL is installed on that platform.
sv: Den här modulen ger tillgång till Transport Layer Security (ofta kallat "Secure Sockets Layer") kryptering och peer authentication för nätverksuttag, både på klient- och serversidan. Den här modulen använder OpenSSL-biblioteket. Det är tillgängligt på alla moderna Unix-system, Windows, macOS och förmodligen ytterligare plattformar, så länge OpenSSL är installerat på den plattformen.

source: Some behavior may be platform dependent, since calls are made to the operating system socket APIs. The installed version of OpenSSL may also cause variations in behavior. For example, TLSv1.3 comes with OpenSSL version 1.1.1.
sv: Vissa beteenden kan vara plattformsberoende, eftersom anrop görs till operativsystemets socket-API:er. Den installerade versionen av OpenSSL kan också orsaka variationer i beteendet. TLSv1.3 levereras till exempel med OpenSSL version 1.1.1.

source: Don't use this module without reading the :ref:`ssl-security`. Doing so may lead to a false sense of security, as the default settings of the ssl module are not necessarily appropriate for your application.
sv: Använd inte den här modulen utan att läsa :ref:`ssl-security`. Detta kan leda till en falsk känsla av säkerhet, eftersom standardinställningarna för ssl-modulen inte nödvändigtvis är lämpliga för din applikation.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: This section documents the objects and functions in the ``ssl`` module; for more general information about TLS, SSL, and certificates, the reader is referred to the documents in the "See Also" section at the bottom.
sv: Detta avsnitt dokumenterar objekten och funktionerna i modulen ``ssl``; för mer allmän information om TLS, SSL och certifikat hänvisas läsaren till dokumenten i avsnittet "Se även" längst ned.

source: This module provides a class, :class:`ssl.SSLSocket`, which is derived from the :class:`socket.socket` type, and provides a socket-like wrapper that also encrypts and decrypts the data going over the socket with SSL. It supports additional methods such as :meth:`getpeercert`, which retrieves the certificate of the other side of the connection, :meth:`cipher`, which retrieves the cipher being used for the secure connection or :meth:`get_verified_chain`, :meth:`get_unverified_chain` which retrieves certificate chain.
sv: Den här modulen tillhandahåller en klass, :class:`ssl.SSLSocket`, som härrör från typen :class:`socket.socket` och ger en socket-liknande omslag som också krypterar och dekrypterar data som går över sockeln med SSL. Den stöder ytterligare metoder som :meth:`getpeercert`, som hämtar certifikatet för den andra sidan av anslutningen, :meth:`cipher`, som hämtar det chiffer som används för den säkra anslutningen eller :meth:`get_verified_chain`, :meth:`get_unverified_chain` som hämtar certifikatkedjan.

source: For more sophisticated applications, the :class:`ssl.SSLContext` class helps manage settings and certificates, which can then be inherited by SSL sockets created through the :meth:`SSLContext.wrap_socket` method.
sv: För mer sofistikerade applikationer hjälper klassen :class:`ssl.SSLContext` till att hantera inställningar och certifikat, som sedan kan ärvas av SSL-uttag som skapas genom metoden :meth:`SSLContext.wrap_socket`.

source: Updated to support linking with OpenSSL 1.1.0
sv: Uppdaterad för att stödja länkning med OpenSSL 1.1.0

source: OpenSSL 0.9.8, 1.0.0 and 1.0.1 are deprecated and no longer supported. In the future the ssl module will require at least OpenSSL 1.0.2 or 1.1.0.
sv: OpenSSL 0.9.8, 1.0.0 och 1.0.1 är föråldrade och stöds inte längre. I framtiden kommer ssl-modulen att kräva minst OpenSSL 1.0.2 eller 1.1.0.

source: :pep:`644` has been implemented. The ssl module requires OpenSSL 1.1.1 or newer.
sv: :pep:`644` har implementerats. Modulen ssl kräver OpenSSL 1.1.1 eller nyare.

source: Use of deprecated constants and functions result in deprecation warnings.
sv: Användning av föråldrade konstanter och funktioner resulterar i varningar om föråldring.

source: Functions, Constants, and Exceptions
sv: Funktioner, konstanter och undantag

source: Socket creation
sv: Skapande av uttag

source: Instances of :class:`SSLSocket` must be created using the :meth:`SSLContext.wrap_socket` method. The helper function :func:`create_default_context` returns a new context with secure default settings.
sv: Instanser av :class:`SSLSocket` måste skapas med hjälp av metoden :meth:`SSLContext.wrap_socket`. Hjälpfunktionen :func:`create_default_context` returnerar en ny kontext med säkra standardinställningar.

source: Client socket example with default context and IPv4/IPv6 dual stack::
sv: Exempel på klientuttag med standardkontext och IPv4/IPv6 dual stack::

source: Client socket example with custom context and IPv4::
sv: Exempel på klientuttag med anpassad kontext och IPv4::

source: hostname = 'www.python.org' # PROTOCOL_TLS_CLIENT requires valid cert chain and hostname context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.load_verify_locations('path/to/cabundle.pem') with socket.socket(socket.AF_INET, socket.SOCK_STREAM, 0) as sock: with context.wrap_socket(sock, server_hostname=hostname) as ssock: print(ssock.version())
sv: värdnamn = 'www.python.org' # PROTOCOL_TLS_CLIENT kräver giltig certkedja och värdnamn context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.load_verify_locations('path/to/cabundle.pem') med socket.socket(socket.AF_INET, socket.SOCK_STREAM, 0) som sock: with context.wrap_socket(sock, server_hostname=hostname) as ssock: print(ssock.version())

source: Server socket example listening on localhost IPv4::
sv: Serveruttag exempel lyssnar på localhost IPv4::

source: context = ssl.SSLContext(ssl.PROTOCOL_TLS_SERVER) context.load_cert_chain('/path/to/certchain.pem', '/path/to/private.key') with socket.socket(socket.AF_INET, socket.SOCK_STREAM, 0) as sock: sock.bind(('127.0.0.1', 8443)) sock.listen(5) with context.wrap_socket(sock, server_side=True) as ssock: conn, addr = ssock.accept() ...
sv: context = ssl.SSLContext(ssl.PROTOCOL_TLS_SERVER) context.load_cert_chain('/path/to/certchain.pem', '/path/to/private.key') med socket.socket(socket.AF_INET, socket.SOCK_STREAM, 0) som sock: sock.bind(('127.0.0.1', 8443)) sock.lyssna(5) med context.wrap_socket(sock, server_side=True) som ssock: conn, addr = ssock.accept() ...

source: Context creation
sv: Skapande av kontext

source: A convenience function helps create :class:`SSLContext` objects for common purposes.
sv: En bekvämlighetsfunktion som hjälper till att skapa :class:`SSLContext`-objekt för vanliga ändamål.

source: Return a new :class:`SSLContext` object with default settings for the given *purpose*. The settings are chosen by the :mod:`ssl` module, and usually represent a higher security level than when calling the :class:`SSLContext` constructor directly.
sv: Returnerar ett nytt :class:`SSLContext`-objekt med standardinställningar för det angivna *syftet*. Inställningarna väljs av modulen :mod:`ssl` och representerar vanligtvis en högre säkerhetsnivå än när man anropar konstruktören :class:`SSLContext` direkt.

source: *cafile*, *capath*, *cadata* represent optional CA certificates to trust for certificate verification, as in :meth:`SSLContext.load_verify_locations`. If all three are :const:`None`, this function can choose to trust the system's default CA certificates instead.
sv: *cafile*, *capath*, *cadata* representerar valfria CA-certifikat att lita på för certifikatverifiering, som i :meth:`SSLContext.load_verify_locations`. Om alla tre är :const:`None` kan den här funktionen välja att lita på systemets standardcertifikat från CA i stället.

source: The settings are: :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2`, and :data:`OP_NO_SSLv3` with high encryption cipher suites without RC4 and without unauthenticated cipher suites. Passing :const:`~Purpose.SERVER_AUTH` as *purpose* sets :data:`~SSLContext.verify_mode` to :data:`CERT_REQUIRED` and either loads CA certificates (when at least one of *cafile*, *capath* or *cadata* is given) or uses :meth:`SSLContext.load_default_certs` to load default CA certificates.
sv: Inställningarna är: :data:`PROTOCOL_TLS_CLIENT` eller :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2` och :data:`OP_NO_SSLv3` med chiffersviter med hög kryptering utan RC4 och utan oautentiserade chiffersviter. Genom att ange :const:`~Purpose.SERVER_AUTH` som *purpose* sätts :data:`~SSLContext.verify_mode` till :data:`CERT_REQUIRED` och antingen laddas CA-certifikat (när minst en av *cafile*, *capath* eller *cadata* anges) eller så används :meth:`SSLContext.load_default_certs` för att ladda standard CA-certifikat.

source: When :attr:`~SSLContext.keylog_filename` is supported and the environment variable :envvar:`SSLKEYLOGFILE` is set, :func:`create_default_context` enables key logging.
sv: När :attr:`~SSLContext.keylog_filename` stöds och miljövariabeln :envvar:`SSLKEYLOGFILE` är inställd, aktiverar :func:`create_default_context` nyckelloggning.

source: The default settings for this context include :data:`VERIFY_X509_PARTIAL_CHAIN` and :data:`VERIFY_X509_STRICT`. These make the underlying OpenSSL implementation behave more like a conforming implementation of :rfc:`5280`, in exchange for a small amount of incompatibility with older X.509 certificates.
sv: Standardinställningarna för detta sammanhang inkluderar :data:`VERIFY_X509_PARTIAL_CHAIN` och :data:`VERIFY_X509_STRICT`. Dessa gör att den underliggande OpenSSL-implementeringen beter sig mer som en överensstämmande implementering av :rfc:`5280`, i utbyte mot en liten mängd inkompatibilitet med äldre X.509-certifikat.

source: The protocol, options, cipher and other settings may change to more restrictive values anytime without prior deprecation. The values represent a fair balance between compatibility and security.
sv: Protokoll, alternativ, chiffer och andra inställningar kan ändras till mer restriktiva värden när som helst utan föregående avskrivning. Värdena representerar en rättvis balans mellan kompatibilitet och säkerhet.

source: If your application needs specific settings, you should create a :class:`SSLContext` and apply the settings yourself.
sv: Om din applikation behöver specifika inställningar bör du skapa en :class:`SSLContext` och tillämpa inställningarna själv.

source: If you find that when certain older clients or servers attempt to connect with a :class:`SSLContext` created by this function that they get an error stating "Protocol or cipher suite mismatch", it may be that they only support SSL3.0 which this function excludes using the :data:`OP_NO_SSLv3`. SSL3.0 is widely considered to be `completely broken <https://en.wikipedia.org/wiki/POODLE>`_. If you still wish to continue to use this function but still allow SSL 3.0 connections you can re-enable them using::
sv: Om du upptäcker att när vissa äldre klienter eller servrar försöker ansluta med en :class:`SSLContext` som skapats av den här funktionen får de felmeddelandet "Protocol or cipher suite mismatch", kan det bero på att de endast stöder SSL3.0 som den här funktionen utesluter med :data:`OP_NO_SSLv3`. SSL3.0 anses allmänt vara "helt trasigt" <https://en.wikipedia.org/wiki/POODLE>`_. Om du fortfarande vill fortsätta att använda den här funktionen men ändå tillåta SSL 3.0-anslutningar kan du återaktivera dem med hjälp av::

source: This context enables :data:`VERIFY_X509_STRICT` by default, which may reject pre-:rfc:`5280` or malformed certificates that the underlying OpenSSL implementation otherwise would accept. While disabling this is not recommended, you can do so using::
sv: Detta sammanhang aktiverar :data:`VERIFY_X509_STRICT` som standard, vilket kan avvisa pre-:rfc:`5280` eller missbildade certifikat som den underliggande OpenSSL-implementationen annars skulle acceptera. Det är inte rekommenderat att inaktivera detta, men du kan göra det med hjälp av::

source: RC4 was dropped from the default cipher string.
sv: RC4 togs bort från standardchiffersträngen.

source: ChaCha20/Poly1305 was added to the default cipher string.
sv: ChaCha20/Poly1305 har lagts till i standardchiffersträngen.

source: 3DES was dropped from the default cipher string.
sv: 3DES togs bort från standardchiffersträngen.

source: Support for key logging to :envvar:`SSLKEYLOGFILE` was added.
sv: Stöd för nyckelloggning till :envvar:`SSLKEYLOGFILE` har lagts till.

source: The context now uses :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol instead of generic :data:`PROTOCOL_TLS`.
sv: Kontexten använder nu protokollet :data:`PROTOCOL_TLS_CLIENT` eller :data:`PROTOCOL_TLS_SERVER` i stället för det generiska protokollet :data:`PROTOCOL_TLS`.

source: The context now uses :data:`VERIFY_X509_PARTIAL_CHAIN` and :data:`VERIFY_X509_STRICT` in its default verify flags.
sv: Kontexten använder nu :data:`VERIFY_X509_PARTIAL_CHAIN` och :data:`VERIFY_X509_STRICT` i sina standardverifieringsflaggor.

source: Exceptions
sv: Undantag

source: Raised to signal an error from the underlying SSL implementation (currently provided by the OpenSSL library). This signifies some problem in the higher-level encryption and authentication layer that's superimposed on the underlying network connection. This error is a subtype of :exc:`OSError`. The error code and message of :exc:`SSLError` instances are provided by the OpenSSL library.
sv: Utlöses för att signalera ett fel från den underliggande SSL-implementeringen (som för närvarande tillhandahålls av OpenSSL-biblioteket). Detta innebär något problem i krypterings- och autentiseringslagret på högre nivå som läggs ovanpå den underliggande nätverksanslutningen. Det här felet är en subtyp av :exc:`OSError`. Felkoden och meddelandet för :exc:`SSLError`-instanser tillhandahålls av OpenSSL-biblioteket.

source: :exc:`SSLError` used to be a subtype of :exc:`socket.error`.
sv: :exc:`SSLError` brukade vara en subtyp av :exc:`socket.error`.

source: A string mnemonic designating the OpenSSL submodule in which the error occurred, such as ``SSL``, ``PEM`` or ``X509``. The range of possible values depends on the OpenSSL version.
sv: En sträng som betecknar den OpenSSL-submodul där felet inträffade, t.ex. ``SSL``, ``PEM`` eller ``X509``. Mängden möjliga värden beror på OpenSSL-versionen.

source: A string mnemonic designating the reason this error occurred, for example ``CERTIFICATE_VERIFY_FAILED``. The range of possible values depends on the OpenSSL version.
sv: En sträng som anger orsaken till att felet uppstod, till exempel ``CERTIFICATE_VERIFY_FAILED``. Mängden möjliga värden beror på OpenSSL-versionen.

source: A subclass of :exc:`SSLError` raised when trying to read or write and the SSL connection has been closed cleanly. Note that this doesn't mean that the underlying transport (read TCP) has been closed.
sv: En underklass av :exc:`SSLError` som uppstår när man försöker läsa eller skriva och SSL-anslutningen har stängts på ett korrekt sätt. Observera att detta inte betyder att den underliggande transporten (läs TCP) har stängts.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be received on the underlying TCP transport before the request can be fulfilled.
sv: En underklass till :exc:`SSLError` som orsakas av en :ref:`icke-blockerande SSL-socket <ssl-nonblocking>` när den försöker läsa eller skriva data, men mer data måste tas emot på den underliggande TCP-transporten innan begäran kan uppfyllas.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be sent on the underlying TCP transport before the request can be fulfilled.
sv: En underklass till :exc:`SSLError` som uppstår när ett :ref:`icke-blockerande SSL-uttag <ssl-nonblocking>` försöker läsa eller skriva data, men mer data måste skickas på den underliggande TCP-transporten innan begäran kan uppfyllas.

source: A subclass of :exc:`SSLError` raised when a system error was encountered while trying to fulfill an operation on a SSL socket. Unfortunately, there is no easy way to inspect the original errno number.
sv: En underklass till :exc:`SSLError` som uppstår när ett systemfel uppstår när man försöker utföra en åtgärd på ett SSL-uttag. Tyvärr finns det inget enkelt sätt att inspektera det ursprungliga errno-numret.

source: A subclass of :exc:`SSLError` raised when the SSL connection has been terminated abruptly. Generally, you shouldn't try to reuse the underlying transport when this error is encountered.
sv: En underklass till :exc:`SSLError` som uppstår när SSL-anslutningen har avslutats abrupt. Generellt sett bör du inte försöka återanvända den underliggande transporten när detta fel uppstår.

source: A subclass of :exc:`SSLError` raised when certificate validation has failed.
sv: En underklass av :exc:`SSLError` som uppstår när certifikatvalideringen misslyckats.

source: A numeric error number that denotes the verification error.
sv: Ett numeriskt felnummer som anger verifieringsfelet.

source: A human readable string of the verification error.
sv: En mänskligt läsbar sträng av verifieringsfelet.

source: An alias for :exc:`SSLCertVerificationError`.
sv: Ett alias för :exc:`SSLCertVerificationError`.

source: The exception is now an alias for :exc:`SSLCertVerificationError`.
sv: Undantaget är nu ett alias för :exc:`SSLCertVerificationError`.

source: Random generation
sv: Slumpmässig generering

source: Return *num* cryptographically strong pseudo-random bytes. Raises an :class:`SSLError` if the PRNG has not been seeded with enough data or if the operation is not supported by the current RAND method. :func:`RAND_status` can be used to check the status of the PRNG and :func:`RAND_add` can be used to seed the PRNG.
sv: Returnerar *num* kryptografiskt starka pseudoslumpmässiga bytes. Utlöser ett :class:`SSLError` om PRNG inte har laddats med tillräckligt med data eller om operationen inte stöds av den aktuella RAND-metoden. :func:`RAND_status` kan användas för att kontrollera statusen för PRNG och :func:`RAND_add` kan användas för att ladda PRNG.

source: For almost all applications :func:`os.urandom` is preferable.
sv: För nästan alla tillämpningar är :func:`os.urandom` att föredra.

source: Read the Wikipedia article, `Cryptographically secure pseudorandom number generator (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>`_, to get the requirements of a cryptographically strong generator.
sv: Läs Wikipedia-artikeln "Cryptographically secure pseudorandom number generator (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>`_" för att få information om kraven på en kryptografiskt stark generator.

source: Return ``True`` if the SSL pseudo-random number generator has been seeded with 'enough' randomness, and ``False`` otherwise. You can use :func:`ssl.RAND_egd` and :func:`ssl.RAND_add` to increase the randomness of the pseudo-random number generator.
sv: Returnerar ``True`` om SSL:s pseudoslumptalsgenerator har försetts med "tillräckligt" med slumpmässighet, och ``False`` annars. Du kan använda :func:`ssl.RAND_egd` och :func:`ssl.RAND_add` för att öka slumpmässigheten i pseudoslumptalsgeneratorn.

source: Mix the given *bytes* into the SSL pseudo-random number generator. The parameter *entropy* (a float) is a lower bound on the entropy contained in string (so you can always use ``0.0``). See :rfc:`1750` for more information on sources of entropy.
sv: Blanda de angivna *bytes* i SSL:s pseudoslumpmässiga nummergenerator. Parametern *entropy* (en float) är en nedre gräns för entropin i strängen (så du kan alltid använda ``0.0``). Se :rfc:`1750` för mer information om källor till entropi.

source: Writable :term:`bytes-like object` is now accepted.
sv: Skrivbar :term:`bytesliknande objekt` är nu accepterad.

source: Certificate handling
sv: Hantering av certifikat

source: Return the time in seconds since the Epoch, given the ``cert_time`` string representing the "notBefore" or "notAfter" date from a certificate in ``"%b %d %H:%M:%S %Y %Z"`` strptime format (C locale).
sv: Returnerar tiden i sekunder sedan epoken, givet strängen ``cert_time`` som representerar "notBefore"- eller "notAfter"-datumet från ett certifikat i ``"%b %d %H:%M:%S %Y %Z"`` strptime-format (C-läge).

source: Here's an example:
sv: Här är ett exempel:

source: "notBefore" or "notAfter" dates must use GMT (:rfc:`5280`).
sv: "notBefore"- eller "notAfter"-datum måste använda GMT (:rfc:`5280`).

source: Interpret the input time as a time in UTC as specified by 'GMT' timezone in the input string. Local timezone was used previously. Return an integer (no fractions of a second in the input format)
sv: Tolkar inmatningstiden som en tid i UTC enligt tidszonen "GMT" i inmatningssträngen. Lokal tidszon användes tidigare. Returnera ett heltal (inga bråkdelar av en sekund i inmatningsformatet)

source: Given the address ``addr`` of an SSL-protected server, as a (*hostname*, *port-number*) pair, fetches the server's certificate, and returns it as a PEM-encoded string. If ``ssl_version`` is specified, uses that version of the SSL protocol to attempt to connect to the server. If *ca_certs* is specified, it should be a file containing a list of root certificates, the same format as used for the *cafile* parameter in :meth:`SSLContext.load_verify_locations`. The call will attempt to validate the server certificate against that set of root certificates, and will fail if the validation attempt fails. A timeout can be specified with the ``timeout`` parameter.
sv: Givet adressen ``addr`` till en SSL-skyddad server, som ett (*hostname*, *port-number*)-par, hämtar serverns certifikat och returnerar det som en PEM-kodad sträng. Om ``ssl_version`` anges, används den versionen av SSL-protokollet för att försöka ansluta till servern. Om *ca_certs* anges bör det vara en fil som innehåller en lista över rotcertifikat, i samma format som används för parametern *cafile* i :meth:`SSLContext.load_verify_locations`. Anropet kommer att försöka validera servercertifikatet mot denna uppsättning rotcertifikat, och misslyckas om valideringsförsöket misslyckas. En timeout kan anges med parametern ``timeout``.

source: This function is now IPv6-compatible.
sv: Denna funktion är nu IPv6-kompatibel.

source: The default *ssl_version* is changed from :data:`PROTOCOL_SSLv3` to :data:`PROTOCOL_TLS` for maximum compatibility with modern servers.
sv: Standard *ssl_version* ändras från :data:`PROTOCOL_SSLv3` till :data:`PROTOCOL_TLS` för maximal kompatibilitet med moderna servrar.

source: The *timeout* parameter was added.
sv: Parametern *timeout* har lagts till.

source: Given a certificate as a DER-encoded blob of bytes, returns a PEM-encoded string version of the same certificate.
sv: Om ett certifikat ges som en DER-kodad blob med bytes, returneras en PEM-kodad strängversion av samma certifikat.
