Repository: yeager/python-docs-sv
Catalog: library/stringprep.po
Languages: sv

source: :mod:`!stringprep` --- Internet String Preparation
sv: :mod:`!stringprep` --- Preparering av internetsträng

source: **Source code:** :source:`Lib/stringprep.py`
sv: **Källkod:** :source:`Lib/stringprep.py`

source: When identifying things (such as host names) in the internet, it is often necessary to compare such identifications for "equality". Exactly how this comparison is executed may depend on the application domain, e.g. whether it should be case-insensitive or not. It may be also necessary to restrict the possible identifications, to allow only identifications consisting of "printable" characters.
sv: Vid identifiering av saker (t.ex. värdnamn) på internet är det ofta nödvändigt att jämföra sådana identifikationer för "jämlikhet". Exakt hur denna jämförelse utförs kan bero på applikationsdomänen, t.ex. om den ska vara skiftlägesokänslig eller inte. Det kan också vara nödvändigt att begränsa de möjliga identifikationerna så att endast identifikationer som består av "skrivbara" tecken tillåts.

source: :rfc:`3454` defines a procedure for "preparing" Unicode strings in internet protocols. Before passing strings onto the wire, they are processed with the preparation procedure, after which they have a certain normalized form. The RFC defines a set of tables, which can be combined into profiles. Each profile must define which tables it uses, and what other optional parts of the ``stringprep`` procedure are part of the profile. One example of a ``stringprep`` profile is ``nameprep``, which is used for internationalized domain names.
sv: :rfc:`3454` definierar en procedur för att "förbereda" Unicode-strängar i Internetprotokoll. Innan strängar skickas ut på kabeln behandlas de med förberedelseproceduren, varefter de har en viss normaliserad form. RFC definierar en uppsättning tabeller som kan kombineras till profiler. Varje profil måste definiera vilka tabeller den använder och vilka andra valfria delar av ``stringprep``-proceduren som ingår i profilen. Ett exempel på en ``stringprep``-profil är ``nameprep``, som används för internationaliserade domännamn.

source: The module :mod:`stringprep` only exposes the tables from :rfc:`3454`. As these tables would be very large to represent as dictionaries or lists, the module uses the Unicode character database internally. The module source code itself was generated using the ``mkstringprep.py`` utility.
sv: Modulen :mod:`stringprep` exponerar endast tabellerna från :rfc:`3454`. Eftersom dessa tabeller skulle vara mycket stora att representera som lexikon eller listor, använder modulen Unicodes teckendatabas internt. Själva modulens källkod genererades med hjälp av verktyget ``mkstringprep.py``.

source: As a result, these tables are exposed as functions, not as data structures. There are two kinds of tables in the RFC: sets and mappings. For a set, :mod:`stringprep` provides the "characteristic function", i.e. a function that returns ``True`` if the parameter is part of the set. For mappings, it provides the mapping function: given the key, it returns the associated value. Below is a list of all functions available in the module.
sv: Därför exponeras dessa tabeller som funktioner, inte som datastrukturer. Det finns två typer av tabeller i RFC: uppsättningar och mappningar. För en uppsättning tillhandahåller :mod:`stringprep` den "karakteristiska funktionen", dvs. en funktion som returnerar ``True`` om parametern är en del av uppsättningen. För mappningar tillhandahåller den mappningsfunktionen: givet nyckeln returnerar den det associerade värdet. Nedan finns en lista över alla funktioner som är tillgängliga i modulen.

source: Determine whether *code* is in tableA.1 (Unassigned code points in Unicode 3.2).
sv: Bestäm om *code* finns i tabellA.1 (Icke tilldelade kodpunkter i Unicode 3.2).

source: Determine whether *code* is in tableB.1 (Commonly mapped to nothing).
sv: Bestäm om *code* finns i tabellB.1 (Vanligtvis mappad till ingenting).

source: Return the mapped value for *code* according to tableB.2 (Mapping for case-folding used with NFKC).
sv: Returnera det mappade värdet för *code* enligt tabellB.2 (Mappning för case-folding som används med NFKC).

source: Return the mapped value for *code* according to tableB.3 (Mapping for case-folding used with no normalization).
sv: Returnera det mappade värdet för *code* enligt tabellB.3 (Mappning för case-folding som används utan normalisering).

source: Determine whether *code* is in tableC.1.1 (ASCII space characters).
sv: Bestäm om *code* finns i tabellC.1.1 (ASCII mellanslagstecken).

source: Determine whether *code* is in tableC.1.2 (Non-ASCII space characters).
sv: Bestäm om *code* finns i tabellC.1.2 (Icke-ASCII rymdtecken).

source: Determine whether *code* is in tableC.1 (Space characters, union of C.1.1 and C.1.2).
sv: Bestäm om *code* finns i tabellC.1 (Mellanslagstecken, sammanslagning av C.1.1 och C.1.2).

source: Determine whether *code* is in tableC.2.1 (ASCII control characters).
sv: Bestäm om *code* finns i tabellC.2.1 (ASCII-kontrolltecken).

source: Determine whether *code* is in tableC.2.2 (Non-ASCII control characters).
sv: Bestäm om *code* finns i tabellC.2.2 (Icke-ASCII-kontrolltecken).

source: Determine whether *code* is in tableC.2 (Control characters, union of C.2.1 and C.2.2).
sv: Bestäm om *code* finns i tabellC.2 (Kontrolltecken, sammanslagning av C.2.1 och C.2.2).

source: Determine whether *code* is in tableC.3 (Private use).
sv: Bestäm om *code* finns i tabellC.3 (Privat bruk).

source: Determine whether *code* is in tableC.4 (Non-character code points).
sv: Bestäm om *code* finns i tabellC.4 (Kodpunkter som inte är tecken).

source: Determine whether *code* is in tableC.5 (Surrogate codes).
sv: Bestäm om *code* finns i tabellC.5 (Surrogatkoder).

source: Determine whether *code* is in tableC.6 (Inappropriate for plain text).
sv: Bestäm om *code* finns i tabellC.6 (Olämpligt för vanlig text).

source: Determine whether *code* is in tableC.7 (Inappropriate for canonical representation).
sv: Bestäm om *code* finns i tabellC.7 (Olämplig för kanonisk representation).

source: Determine whether *code* is in tableC.8 (Change display properties or are deprecated).
sv: Bestäm om *code* finns i tabellC.8 (Ändra visningsegenskaper eller är föråldrad).

source: Determine whether *code* is in tableC.9 (Tagging characters).
sv: Bestäm om *code* finns i tabellC.9 (Taggning av tecken).

source: Determine whether *code* is in tableD.1 (Characters with bidirectional property "R" or "AL").
sv: Bestäm om *code* finns i tabellD.1 (Tecken med dubbelriktad egenskap "R" eller "AL").

source: Determine whether *code* is in tableD.2 (Characters with bidirectional property "L").
sv: Bestäm om *code* finns i tabellD.2 (Tecken med dubbelriktad egenskap "L").
