Repository: yeager/python-docs-sv
Catalog: library/struct.po
Languages: sv

source: For the ``'?'`` format character, the return value is either :const:`True` or :const:`False`. When packing, the truth value of the argument object is used. Either 0 or 1 in the native or standard bool representation will be packed, and any non-zero value will be ``True`` when unpacking.
sv: För formattecknet ``'?'`` är returvärdet antingen :const:`True` eller :const:`False`. Vid packning används argumentobjektets sanningsvärde. Antingen 0 eller 1 i den ursprungliga eller standard bool-representationen kommer att packas, och alla värden som inte är noll kommer att vara ``True`` vid uppackning.

source: Examples
sv: Exempel

source: Native byte order examples (designated by the ``'@'`` format prefix or lack of any prefix character) may not match what the reader's machine produces as that depends on the platform and compiler.
sv: Exempel på inbyggd byteordning (som betecknas med formatprefixet ``'@'`` eller avsaknad av prefixtecken) kanske inte stämmer överens med vad läsarens maskin producerar eftersom det beror på plattform och kompilator.

source: Pack and unpack integers of three different sizes, using big endian ordering::
sv: Packa och packa upp heltal av tre olika storlekar, med big endian-ordning::

source: Attempt to pack an integer which is too large for the defined field::
sv: Försök att packa ett heltal som är för stort för det definierade fältet::

source: >>> pack(">h", 99999) Traceback (most recent call last): File "<stdin>", line 1, in <module> struct.error: 'h' format requires -32768 <= number <= 32767
sv: &gt;&gt;&gt; pack("&gt;h", 99999) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> struct.error: 'h'-formatet kräver -32768 &lt;= tal &lt;= 32767

source: Demonstrate the difference between ``'s'`` and ``'c'`` format characters::
sv: Demonstrera skillnaden mellan formattecknen ``'s'`` och ``'c'``::

source: Unpacked fields can be named by assigning them to variables or by wrapping the result in a named tuple::
sv: Ouppackade fält kan namnges genom att de tilldelas variabler eller genom att resultatet förpackas i en namngiven tupel::

source: >>> record = b'raymond \x32\x12\x08\x01\x08' >>> name, serialnum, school, gradelevel = unpack('<10sHHb', record) >>> from collections import namedtuple >>> Student = namedtuple('Student', 'name serialnum school gradelevel') >>> Student._make(unpack('<10sHHb', record)) Student(name=b'raymond ', serialnum=4658, school=264, gradelevel=8)
sv: >>> record = b'raymond \x32\x12\x08\x01\x08' >>> namn, serienummer, skola, betygsnivå = unpack('<10sHHb', record) >>> from collections import namedtuple >>> Student = namedtuple('Student', 'namn serienummer skola gradnivå') >>> Student._make(unpack('<10sHHb', record)) Student(name=b'raymond ', serialnum=4658, school=264, gradelevel=8)

source: The ordering of format characters may have an impact on size in native mode since padding is implicit. In standard mode, the user is responsible for inserting any desired padding. Note in the first ``pack`` call below that three NUL bytes were added after the packed ``'#'`` to align the following integer on a four-byte boundary. In this example, the output was produced on a little endian machine::
sv: Ordningsföljden på formattecknen kan påverka storleken i native-läge eftersom utfyllnaden är implicit. I standardläge är användaren ansvarig för att infoga önskad utfyllnad. Notera i det första ``pack``-anropet nedan att tre NUL-bytes lades till efter den packade ``'#'`` för att anpassa följande heltal till en gräns på fyra byte. I det här exemplet producerades utdata på en little endian-maskin::

source: >>> pack('@ci', b'#', 0x12131415) b'#\x00\x00\x00\x15\x14\x13\x12' >>> pack('@ic', 0x12131415, b'#') b'\x15\x14\x13\x12#' >>> calcsize('@ci') 8 >>> calcsize('@ic') 5
sv: >>> pack('@ci', b'#', 0x12131415) b'#\x00\x00\x00\x15\x14\x13\x12' >>> pack('@ic', 0x12131415, b'#') b'\x15\x14\x13\x12#' >>> calcsize('@ci') 8 >>> beräkna storlek('@ic') 5

source: The following format ``'llh0l'`` results in two pad bytes being added at the end, assuming the platform's longs are aligned on 4-byte boundaries::
sv: Följande format ``'llh0l'`` resulterar i att två padbytes läggs till i slutet, förutsatt att plattformens longs är inriktade på 4-bytegränser::

source: Module :mod:`array`
sv: Modul :mod:`array`

source: Packed binary storage of homogeneous data.
sv: Packad binär lagring av homogena data.

source: Module :mod:`json`
sv: Modul :mod:`json`

source: JSON encoder and decoder.
sv: JSON-kodare och -avkodare.

source: Module :mod:`pickle`
sv: Modul :mod:`pickle`

source: Python object serialization.
sv: Serialisering av Python-objekt.

source: Applications
sv: Ansökningar

source: Two main applications for the :mod:`struct` module exist, data interchange between Python and C code within an application or another application compiled using the same compiler (:ref:`native formats<struct-native-formats>`), and data interchange between applications using agreed upon data layout (:ref:`standard formats<struct-standard-formats>`). Generally speaking, the format strings constructed for these two domains are distinct.
sv: Det finns två huvudsakliga användningsområden för modulen :mod:`struct`, datautbyte mellan Python- och C-kod inom ett program eller ett annat program som kompilerats med samma kompilator (:ref:`native formats<struct-native-formats>`), och datautbyte mellan program som använder en överenskommen datalayout (:ref:`standard formats<struct-standard-formats>`). Generellt sett är formatsträngarna som konstrueras för dessa två domäner olika.

source: Native Formats
sv: Ursprungliga format

source: When constructing format strings which mimic native layouts, the compiler and machine architecture determine byte ordering and padding. In such cases, the ``@`` format character should be used to specify native byte ordering and data sizes. Internal pad bytes are normally inserted automatically. It is possible that a zero-repeat format code will be needed at the end of a format string to round up to the correct byte boundary for proper alignment of consecutive chunks of data.
sv: Vid konstruktion av formatsträngar som efterliknar inbyggda layouter bestämmer kompilatorn och maskinarkitekturen byteordning och utfyllnad. I sådana fall bör formattecknet ``@`` användas för att ange byteordning och datastorlek. Interna padbytes infogas normalt automatiskt. Det är möjligt att en formatkod med noll upprepningar behövs i slutet av en formatsträng för att avrunda till rätt bytegräns för korrekt justering av på varandra följande datapaket.

source: Consider these two simple examples (on a 64-bit, little-endian machine)::
sv: Tänk på dessa två enkla exempel (på en 64-bitars, little-endian-maskin)::

source: >>> calcsize('@lhl') 24 >>> calcsize('@llh') 18
sv: >>> calcsize('@lhl') 24 >>> kalkylstorlek('@llh') 18

source: Data is not padded to an 8-byte boundary at the end of the second format string without the use of extra padding. A zero-repeat format code solves that problem::
sv: Data fylls inte ut till en 8-bytesgräns i slutet av den andra formatsträngen utan att extra utfyllnad används. En formatkod med noll upprepningar löser det problemet::

source: The ``'x'`` format code can be used to specify the repeat, but for native formats it is better to use a zero-repeat format like ``'0l'``.
sv: Formatkoden ``'x'`` kan användas för att ange upprepningen, men för inbyggda format är det bättre att använda ett format med noll upprepning som ``'0l'``.

source: By default, native byte ordering and alignment is used, but it is better to be explicit and use the ``'@'`` prefix character.
sv: Som standard används inbyggd byteordning och justering, men det är bättre att vara tydlig och använda prefixtecknet ``'@'``.

source: Standard Formats
sv: Standardformat

source: When exchanging data beyond your process such as networking or storage, be precise. Specify the exact byte order, size, and alignment. Do not assume they match the native order of a particular machine. For example, network byte order is big-endian, while many popular CPUs are little-endian. By defining this explicitly, the user need not care about the specifics of the platform their code is running on. The first character should typically be ``<`` or ``>`` (or ``!``). Padding is the responsibility of the programmer. The zero-repeat format character won't work. Instead, the user must explicitly add ``'x'`` pad bytes where needed. Revisiting the examples from the previous section, we have::
sv: När du utbyter data utanför din process, t.ex. nätverk eller lagring, ska du vara exakt. Ange den exakta byteordningen, storleken och inriktningen. Anta inte att de matchar den ursprungliga ordningen för en viss maskin. Till exempel är byteordningen i nätverk big-endian, medan många populära processorer är little-endian. Genom att definiera detta explicit behöver användaren inte bry sig om detaljerna i den plattform som deras kod körs på. Det första tecknet bör normalt vara ``<`` eller ``>`` (eller ``!``). Utfyllnad är programmerarens ansvar. Formattecknet med noll upprepningar fungerar inte. Istället måste användaren uttryckligen lägga till ``'x'`` padbytes där det behövs. Om vi återgår till exemplen från föregående avsnitt har vi::

source: >>> calcsize('<qh6xq') 24 >>> pack('<qh6xq', 1, 2, 3) == pack('@lhl', 1, 2, 3) True >>> calcsize('@llh') 18 >>> pack('@llh', 1, 2, 3) == pack('<qqh', 1, 2, 3) True >>> calcsize('<qqh6x') 24 >>> calcsize('@llh0l') 24 >>> pack('@llh0l', 1, 2, 3) == pack('<qqh6x', 1, 2, 3) True
sv: >>> calcsize('<qh6xq') 24 >>> pack('<qh6xq', 1, 2, 3) == pack('@lhl', 1, 2, 3) Sant >>> beräkna storlek('@llh') 18 >>> pack('@llh', 1, 2, 3) == pack('<qqh', 1, 2, 3) Sant >>> beräkna storlek('<qqh6x') 24 >>> beräkna storlek('@llh0l') 24 >>> pack('@llh0l', 1, 2, 3) == pack('<qqh6x', 1, 2, 3) Sant

source: The above results (executed on a 64-bit machine) aren't guaranteed to match when executed on different machines. For example, the examples below were executed on a 32-bit machine::
sv: Det är inte säkert att resultaten ovan (som kördes på en 64-bitars maskin) stämmer överens när de körs på andra maskiner. Exemplen nedan kördes till exempel på en 32-bitars maskin::

source: >>> calcsize('<qqh6x') 24 >>> calcsize('@llh0l') 12 >>> pack('@llh0l', 1, 2, 3) == pack('<qqh6x', 1, 2, 3) False
sv: >>> calcsize('<qqh6x') 24 >>> calcsize('@llh0l') 12 >>> pack('@llh0l', 1, 2, 3) == pack('<qqh6x', 1, 2, 3) Falsk

source: Classes
sv: Klasser

source: The :mod:`struct` module also defines the following type:
sv: Modulen :mod:`struct` definierar också följande typ:

source: Return a new Struct object which writes and reads binary data according to the format string *format*. Creating a ``Struct`` object once and calling its methods is more efficient than calling module-level functions with the same format since the format string is only compiled once.
sv: Returnerar ett nytt Struct-objekt som skriver och läser binära data enligt formatsträngen *format*. Att skapa ett ``Struct``-objekt en gång och anropa dess metoder är mer effektivt än att anropa funktioner på modulnivå med samma format eftersom formatsträngen bara kompileras en gång.

source: The compiled versions of the most recent format strings passed to the module-level functions are cached, so programs that use only a few format strings needn't worry about reusing a single :class:`Struct` instance.
sv: De kompilerade versionerna av de senaste formatsträngarna som skickas till modulnivåfunktionerna cachas, så program som bara använder ett fåtal formatsträngar behöver inte oroa sig för att återanvända en enda :class:`Struct`-instans.

source: Compiled Struct objects support the following methods and attributes:
sv: Kompilerade Struct-objekt har stöd för följande metoder och attribut:

source: Identical to the :func:`pack` function, using the compiled format. (``len(result)`` will equal :attr:`size`.)
sv: Identisk med funktionen :func:`pack`, med det kompilerade formatet. (``len(result)`` kommer att motsvara :attr:`size`.)

source: Identical to the :func:`pack_into` function, using the compiled format.
sv: Identisk med funktionen :func:`pack_into`, med det kompilerade formatet.

source: Identical to the :func:`unpack` function, using the compiled format. The buffer's size in bytes must equal :attr:`size`.
sv: Identisk med funktionen :func:`unpack`, men använder det kompilerade formatet. Buffertens storlek i bytes måste vara lika med :attr:`size`.

source: Identical to the :func:`unpack_from` function, using the compiled format. The buffer's size in bytes, starting at position *offset*, must be at least :attr:`size`.
sv: Identisk med funktionen :func:`unpack_from`, men använder det kompilerade formatet. Buffertens storlek i byte, med start vid position *offset*, måste vara minst :attr:`size`.

source: Identical to the :func:`iter_unpack` function, using the compiled format. The buffer's size in bytes must be a multiple of :attr:`size`.
sv: Identisk med funktionen :func:`iter_unpack`, men använder det kompilerade formatet. Buffertens storlek i bytes måste vara en multipel av :attr:`size`.

source: The format string used to construct this Struct object.
sv: Den formatsträng som användes för att konstruera detta Struct-objekt.

source: The format string type is now :class:`str` instead of :class:`bytes`.
sv: Formatsträngstypen är nu :class:`str` istället för :class:`bytes`.

source: The calculated size of the struct (and hence of the bytes object produced by the :meth:`pack` method) corresponding to :attr:`format`.
sv: Den beräknade storleken på struct (och därmed på bytesobjektet som produceras av metoden :meth:`pack`) som motsvarar :attr:`format`.

source: The *repr()* of structs has changed. It is now:
sv: *repr()* för structs har ändrats. Det är det nu:

source: structures
sv: strukturer

source: packing
sv: packning

source: binary
sv: binär

source: @ (at)
sv: @ (vid)

source: in struct format strings
sv: i struct-format strängar

source: = (equals)
sv: = (lika med)

source: < (less)
sv: < (mindre)

source: > (greater)
sv: > (större)

source: ! (exclamation)
sv: ! (utrop)

source: ? (question mark)
sv: ? (frågetecken)
