Repository: yeager/python-docs-sv
Catalog: library/struct.po
Languages: sv

source: :mod:`!struct` --- Interpret bytes as packed binary data
sv: :mod:`!struct` --- Tolka byte som packad binärdata

source: **Source code:** :source:`Lib/struct.py`
sv: **Källkod:** :source:`Lib/struct.py`

source: This module converts between Python values and C structs represented as Python :class:`bytes` objects. Compact :ref:`format strings <struct-format-strings>` describe the intended conversions to/from Python values. The module's functions and objects can be used for two largely distinct applications, data exchange with external sources (files or network connections), or data transfer between the Python application and the C layer.
sv: Denna modul konverterar mellan Python-värden och C-strukturer representerade som Python :class:`bytes`-objekt. Kompakta :ref:`formatsträngar <struct-format-strings>` beskriver de avsedda konverteringarna till/från Python-värden. Modulens funktioner och objekt kan användas för två vitt skilda tillämpningar, datautbyte med externa källor (filer eller nätverksanslutningar) eller dataöverföring mellan Python-applikationen och C-lagret.

source: When no prefix character is given, native mode is the default. It packs or unpacks data based on the platform and compiler on which the Python interpreter was built. The result of packing a given C struct includes pad bytes which maintain proper alignment for the C types involved; similarly, alignment is taken into account when unpacking. In contrast, when communicating data between external sources, the programmer is responsible for defining byte ordering and padding between elements. See :ref:`struct-alignment` for details.
sv: När inget prefixtecken anges är native-läge standard. Det packar eller packar upp data baserat på den plattform och kompilator som Python-tolken byggdes på. Resultatet av att packa en given C-struktur inkluderar padbytes som upprätthåller korrekt inriktning för de involverade C-typerna; på samma sätt beaktas inriktningen vid uppackning. När data kommuniceras mellan externa källor är det däremot programmeraren som ansvarar för att definiera byteordning och utfyllnad mellan element. Se :ref:`struct-alignment` för mer information.

source: Several :mod:`struct` functions (and methods of :class:`Struct`) take a *buffer* argument. This refers to objects that implement the :ref:`bufferobjects` and provide either a readable or read-writable buffer. The most common types used for that purpose are :class:`bytes` and :class:`bytearray`, but many other types that can be viewed as an array of bytes implement the buffer protocol, so that they can be read/filled without additional copying from a :class:`bytes` object.
sv: Flera :mod:`struct`-funktioner (och metoder i :class:`Struct`) tar ett *buffer*-argument. Detta hänvisar till objekt som implementerar :ref:`bufferobjects` och tillhandahåller antingen en läsbar eller en skrivbar buffert. De vanligaste typerna som används för detta ändamål är :class:`bytes` och :class:`bytearray`, men många andra typer som kan ses som en array av bytes implementerar buffertprotokollet, så att de kan läsas/fyllas utan ytterligare kopiering från ett :class:`bytes`-objekt.

source: Functions and Exceptions
sv: Funktioner och undantag

source: The module defines the following exception and functions:
sv: Modulen definierar följande undantag och funktioner:

source: Exception raised on various occasions; argument is a string describing what is wrong.
sv: Undantag som tas upp vid olika tillfällen; argumentet är en sträng som beskriver vad som är fel.

source: Return a bytes object containing the values *v1*, *v2*, ... packed according to the format string *format*. The arguments must match the values required by the format exactly.
sv: Returnerar ett bytesobjekt som innehåller värdena *v1*, *v2*, ... packade enligt formatsträngen *format*. Argumenten måste exakt matcha de värden som krävs av formatet.

source: Pack the values *v1*, *v2*, ... according to the format string *format* and write the packed bytes into the writable buffer *buffer* starting at position *offset*. Note that *offset* is a required argument.
sv: Packa värdena *v1*, *v2*, ... enligt formatsträngen *format* och skriv de packade bytena till den skrivbara bufferten *buffer* med start vid position *offset*. Observera att *offset* är ett obligatoriskt argument.

source: Unpack from the buffer *buffer* (presumably packed by ``pack(format, ...)``) according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes must match the size required by the format, as reflected by :func:`calcsize`.
sv: Packar upp från bufferten *buffer* (förmodligen packad med ``pack(format, ...)``) enligt formatsträngen *format*. Resultatet är en tupel även om den innehåller exakt ett objekt. Buffertens storlek i bytes måste matcha den storlek som krävs av formatet, vilket återspeglas av :func:`calcsize`.

source: Unpack from *buffer* starting at position *offset*, according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes, starting at position *offset*, must be at least the size required by the format, as reflected by :func:`calcsize`.
sv: Packar upp från *buffer* med start vid position *offset*, enligt formatsträngen *format*. Resultatet är en tupel även om den innehåller exakt ett objekt. Buffertens storlek i byte, med start vid position *offset*, måste vara minst den storlek som krävs av formatet, vilket återspeglas av :func:`calcsize`.

source: Iteratively unpack from the buffer *buffer* according to the format string *format*. This function returns an iterator which will read equally sized chunks from the buffer until all its contents have been consumed. The buffer's size in bytes must be a multiple of the size required by the format, as reflected by :func:`calcsize`.
sv: Iterativ uppackning från bufferten *buffer* enligt formatsträngen *format*. Denna funktion returnerar en iterator som läser lika stora bitar från bufferten tills allt dess innehåll har förbrukats. Buffertens storlek i bytes måste vara en multipel av den storlek som krävs av formatet, vilket återspeglas av :func:`calcsize`.

source: Each iteration yields a tuple as specified by the format string.
sv: Varje iteration ger en tupel som specificeras av formatsträngen.

source: Return the size of the struct (and hence of the bytes object produced by ``pack(format, ...)``) corresponding to the format string *format*.
sv: Returnerar storleken på struct (och därmed bytesobjektet som produceras av ``pack(format, ...)``) som motsvarar formatsträngen *format*.

source: Format Strings
sv: Format Strängar

source: Format strings describe the data layout when packing and unpacking data. They are built up from :ref:`format characters<format-characters>`, which specify the type of data being packed/unpacked. In addition, special characters control the :ref:`byte order, size and alignment<struct-alignment>`. Each format string consists of an optional prefix character which describes the overall properties of the data and one or more format characters which describe the actual data values and padding.
sv: Formatsträngar beskriver datalayouten vid packning och uppackning av data. De är uppbyggda av :ref:`formattecken<format-characters>`, som anger vilken typ av data som ska packas/packas upp. Dessutom styr specialtecken :ref:`byteordning, storlek och inriktning<struct-alignment>`. Varje formatsträng består av ett valfritt prefixtecken som beskriver de övergripande egenskaperna hos data och ett eller flera formattecken som beskriver de faktiska datavärdena och utfyllnaden.

source: Byte Order, Size, and Alignment
sv: Byteordning, storlek och inriktning

source: By default, C types are represented in the machine's native format and byte order, and properly aligned by skipping pad bytes if necessary (according to the rules used by the C compiler). This behavior is chosen so that the bytes of a packed struct correspond exactly to the memory layout of the corresponding C struct. Whether to use native byte ordering and padding or standard formats depends on the application.
sv: Som standard representeras C-typer i maskinens ursprungliga format och byteordning, och justeras korrekt genom att hoppa över padbytes om det behövs (enligt de regler som används av C-kompilatorn). Detta beteende är valt så att bytena i en packad struktur exakt motsvarar minneslayouten för motsvarande C-struktur. Huruvida man ska använda inbyggd byteordning och padding eller standardformat beror på applikationen.

source: Alternatively, the first character of the format string can be used to indicate the byte order, size and alignment of the packed data, according to the following table:
sv: Alternativt kan det första tecknet i formatsträngen användas för att ange byteordning, storlek och justering av de paketerade data, enligt följande tabell:

source: Character
sv: Tecken

source: Byte order
sv: Byte-ordning

source: Size
sv: Storlek

source: Alignment
sv: Justering

source: native
sv: infödd

source: none
sv: ingen

source: little-endian
sv: liten-endian

source: big-endian
sv: stor-endian

source: network (= big-endian)
sv: nätverk (= big-endian)

source: If the first character is not one of these, ``'@'`` is assumed.
sv: Om det första tecknet inte är något av dessa, antas ``'@'``.

source: The number 1023 (``0x3ff`` in hexadecimal) has the following byte representations:
sv: Siffran 1023 (``0x3ff`` i hexadecimal) har följande byte representationer:

source: ``03 ff`` in big-endian (``>``)
sv: ``03 ff`` i big-endian (``>``)

source: ``ff 03`` in little-endian (``<``)
sv: ``ff 03`` i little-endian (``<``)

source: Python example:
sv: Python exempel:

source: Native byte order is big-endian or little-endian, depending on the host system. For example, Intel x86, AMD64 (x86-64), and Apple M1 are little-endian; IBM z and many legacy architectures are big-endian. Use :data:`sys.byteorder` to check the endianness of your system.
sv: Den inbyggda byteordningen är big-endian eller little-endian, beroende på värdsystemet. Till exempel är Intel x86, AMD64 (x86-64) och Apple M1 little-endian, medan IBM z och många äldre arkitekturer är big-endian. Använd :data:`sys.byteorder` för att kontrollera om ditt system är endianskt.

source: Native size and alignment are determined using the C compiler's ``sizeof`` expression. This is always combined with native byte order.
sv: Ursprunglig storlek och inriktning bestäms med hjälp av C-kompilatorns ``sizeof``-uttryck. Detta kombineras alltid med inbyggd byteordning.

source: Standard size depends only on the format character; see the table in the :ref:`format-characters` section.
sv: Standardstorleken beror endast på formattecknet; se tabellen i avsnittet :ref:`format-characters`.

source: Note the difference between ``'@'`` and ``'='``: both use native byte order, but the size and alignment of the latter is standardized.
sv: Observera skillnaden mellan ``'@'`` och ``'='``: båda använder inbyggd byteordning, men storleken och inriktningen för den senare är standardiserad.

source: The form ``'!'`` represents the network byte order which is always big-endian as defined in `IETF RFC 1700 <IETF RFC 1700_>`_.
sv: Formen ``'!'`` representerar nätverkets byteordning som alltid är big-endian enligt definitionen i `IETF RFC 1700 <IETF RFC 1700_>`_.

source: There is no way to indicate non-native byte order (force byte-swapping); use the appropriate choice of ``'<'`` or ``'>'``.
sv: Det finns inget sätt att ange en icke inhemsk byteordning (tvinga fram bytebyte); använd det lämpliga valet av ``'<'`` eller ``'>'``.

source: Notes:
sv: Anteckningar:

source: Padding is only automatically added between successive structure members. No padding is added at the beginning or the end of the encoded struct.
sv: Padding läggs bara automatiskt till mellan på varandra följande strukturmedlemmar. Ingen utfyllnad läggs till i början eller slutet av den kodade strukturen.

source: No padding is added when using non-native size and alignment, e.g. with '<', '>', '=', and '!'.
sv: Ingen utfyllnad läggs till när man använder icke-nativ storlek och justering, t.ex. med "<", ">", "=" och "!".

source: To align the end of a structure to the alignment requirement of a particular type, end the format with the code for that type with a repeat count of zero. See :ref:`struct-examples`.
sv: För att anpassa slutet av en struktur till anpassningskravet för en viss typ, avsluta formatet med koden för den typen med ett upprepningsantal på noll. Se :ref:`strukturexempel`.

source: Format Characters
sv: Format tecken

source: Format characters have the following meaning; the conversion between C and Python values should be obvious given their types. The 'Standard size' column refers to the size of the packed value in bytes when using standard size; that is, when the format string starts with one of ``'<'``, ``'>'``, ``'!'`` or ``'='``. When using native size, the size of the packed value is platform-dependent.
sv: Formattecken har följande betydelse; konverteringen mellan C- och Python-värden bör vara uppenbar med tanke på deras typer. Kolumnen "Standardstorlek" avser storleken på det packade värdet i byte vid användning av standardstorlek, det vill säga när formatsträngen börjar med något av ``'<'``, ``'>'``, ``'!'`` eller ``'='``. Vid användning av native-storlek är storleken på det packade värdet plattformsberoende.

source: C Type
sv: C Typ

source: Python type
sv: Python-typ

source: Standard size
sv: Standardstorlek

source: Notes
sv: Anteckningar

source: no value
sv: inget värde

source: bytes of length 1
sv: byte med längd 1

source: integer
sv: heltal

source: :c:expr:`short`
sv: :c:expr:`kort`

source: :c:expr:`long`
sv: :c:expr:`lång`

source: :c:expr:`long long`
sv: :c:expr:`lång lång`

source: :c:type:`ssize_t`
sv: :c:typ:`ssize_t`

source: :c:type:`size_t`
sv: :c:typ:`storlek_t`

source: float
sv: flyt

source: :c:expr:`float complex`
sv: :c:expr:`flöde komplex`

source: complex
sv: komplex

source: :c:expr:`double complex`
sv: :c:expr:`dubbel komplex`

source: bytes
sv: byte

source: Added support for the ``'n'`` and ``'N'`` formats.
sv: Lagt till stöd för formaten ``'n`` och ``'N``.

source: Added support for the ``'e'`` format.
sv: Stöd för formatet ``'e'`` har lagts till.

source: Added support for the ``'F'`` and ``'D'`` formats.
sv: Stöd för formaten ``'F`` och ``'D`` har lagts till.

source: The ``'?'`` conversion code corresponds to the :c:expr:`_Bool` type defined by C standards since C99. In standard mode, it is represented by one byte.
sv: Konverteringskoden ``'?'`` motsvarar typen :c:expr:`_Bool` som definieras av C-standarder sedan C99. I standardläge representeras den av en byte.

source: When attempting to pack a non-integer using any of the integer conversion codes, if the non-integer has a :meth:`~object.__index__` method then that method is called to convert the argument to an integer before packing.
sv: När du försöker packa ett icke-integertal med någon av koderna för heltalskonvertering, om icke-integertalet har en :meth:`~object.__index__`-metod, anropas den metoden för att konvertera argumentet till ett heltal före packning.

source: Added use of the :meth:`~object.__index__` method for non-integers.
sv: Lagt till användning av metoden :meth:`~object.__index__` för icke-integraler.

source: The ``'n'`` and ``'N'`` conversion codes are only available for the native size (selected as the default or with the ``'@'`` byte order character). For the standard size, you can use whichever of the other integer formats fits your application.
sv: Konverteringskoderna ``'n'`` och ``'N'`` är endast tillgängliga för den ursprungliga storleken (vald som standard eller med byteordningstecknet ``'@'``). För standardstorleken kan du använda vilket som helst av de andra heltalsformaten som passar din applikation.

source: For the ``'f'``, ``'d'`` and ``'e'`` conversion codes, the packed representation uses the IEEE 754 binary32, binary64 or binary16 format (for ``'f'``, ``'d'`` or ``'e'`` respectively), regardless of the floating-point format used by the platform.
sv: För konverteringskoderna ``'f'``, ``'d'`` och ``'e'`` använder den packade representationen IEEE 754-formatet binary32, binary64 eller binary16 (för ``'f'``, ``'d'`` respektive ``'e'``), oavsett vilket flyttalsformat som används av plattformen.

source: The ``'P'`` format character is only available for the native byte ordering (selected as the default or with the ``'@'`` byte order character). The byte order character ``'='`` chooses to use little- or big-endian ordering based on the host system. The struct module does not interpret this as native ordering, so the ``'P'`` format is not available.
sv: Formattecknet ``'P'`` är endast tillgängligt för den ursprungliga byteordningen (vald som standard eller med byteordningstecknet ``'@'``). Byteordningstecknet ``'='`` väljer att använda little- eller big-endian-ordning baserat på värdsystemet. Struct-modulen tolkar inte detta som inbyggd ordning, så formatet ``'P'`` är inte tillgängligt.

source: The IEEE 754 binary16 "half precision" type was introduced in the 2008 revision of the `IEEE 754 standard <ieee 754 standard_>`_. It has a sign bit, a 5-bit exponent and 11-bit precision (with 10 bits explicitly stored), and can represent numbers between approximately ``6.1e-05`` and ``6.5e+04`` at full precision. This type is not widely supported by C compilers: on a typical machine, an unsigned short can be used for storage, but not for math operations. See the Wikipedia page on the `half-precision floating-point format <half precision format_>`_ for more information.
sv: Typen IEEE 754 binary16 "half precision" introducerades i 2008 års revision av `IEEE 754-standarden <ieee 754 standard_>`_. Den har en teckenbit, en 5-bitars exponent och 11-bitars precision (med 10 bitar explicit lagrade) och kan representera tal mellan cirka ``6,1e-05`` och ``6,5e+04`` med full precision. Denna typ stöds inte allmänt av C-kompilatorer: på en typisk maskin kan en osignerad kort användas för lagring, men inte för matematiska operationer. Se Wikipedia-sidan om `half-precision floating-point format <half precision format_>`_ för mer information.

source: When packing, ``'x'`` inserts one NUL byte.
sv: Vid packning infogar ``'x'`` en NUL-byte.

source: The ``'p'`` format character encodes a "Pascal string", meaning a short variable-length string stored in a *fixed number of bytes*, given by the count. The first byte stored is the length of the string, or 255, whichever is smaller. The bytes of the string follow. If the string passed in to :func:`pack` is too long (longer than the count minus 1), only the leading ``count-1`` bytes of the string are stored. If the string is shorter than ``count-1``, it is padded with null bytes so that exactly count bytes in all are used. Note that for :func:`unpack`, the ``'p'`` format character consumes ``count`` bytes, but that the string returned can never contain more than 255 bytes.
sv: Formattecknet ``'p'`` kodar en "Pascal-sträng", dvs. en kort sträng med variabel längd som lagras i ett *fixerat antal byte*, som anges av count. Den första byten som lagras är strängens längd eller 255, beroende på vilket som är minst. Därefter följer strängens byte. Om strängen som skickas till :func:`pack` är för lång (längre än count minus 1), lagras endast de första ``count-1`` bytena i strängen. Om strängen är kortare än ``count-1`` fylls den på med nollbytes så att exakt count-bytes används. Observera att för :func:`unpack` förbrukar formattecknet ``'p'`` ``count`` bytes, men att strängen som returneras aldrig kan innehålla mer än 255 bytes.

source: For the ``'s'`` format character, the count is interpreted as the length of the bytes, not a repeat count like for the other format characters; for example, ``'10s'`` means a single 10-byte string mapping to or from a single Python byte string, while ``'10c'`` means 10 separate one byte character elements (e.g., ``cccccccccc``) mapping to or from ten different Python byte objects. (See :ref:`struct-examples` for a concrete demonstration of the difference.) If a count is not given, it defaults to 1. For packing, the string is truncated or padded with null bytes as appropriate to make it fit. For unpacking, the resulting bytes object always has exactly the specified number of bytes. As a special case, ``'0s'`` means a single, empty string (while ``'0c'`` means 0 characters).
sv: För formattecknet ``'s'`` tolkas antalet som längden på bytena, inte som ett upprepningsantal som för de andra formattecknen; till exempel betyder ``'10s'`` en enda 10-bytessträng som mappar till eller från en enda Python-bytesträng, medan ``'10c'`` betyder 10 separata en-bytes teckenelement (t.ex. ``cccccccccccc``) som mappar till eller från tio olika Python-byteobjekt. (Se :ref:`struct-examples` för en konkret demonstration av skillnaden.) Om ett antal inte anges är standardvärdet 1. Vid packning trunkeras strängen eller fylls på med nollbytes på lämpligt sätt för att den ska få plats. Vid uppackning har det resulterande bytes-objektet alltid exakt det angivna antalet bytes. Som ett specialfall betyder ``'0s'`` en enda, tom sträng (medan ``'0c'`` betyder 0 tecken).

source: For the ``'F'`` and ``'D'`` format characters, the packed representation uses the IEEE 754 binary32 and binary64 format for components of the complex number, regardless of the floating-point format used by the platform. Note that complex types (``F`` and ``D``) are available unconditionally, despite complex types being an optional feature in C. As specified in the C11 standard, each complex type is represented by a two-element C array containing, respectively, the real and imaginary parts.
sv: För formattecknen ``'F`` och ``'D`` använder den packade representationen IEEE 754 binary32- och binary64-formatet för komponenter i det komplexa talet, oavsett vilket flyttalsformat som används av plattformen. Observera att komplexa typer (``F`` och ``D``) är tillgängliga villkorslöst, trots att komplexa typer är en valfri funktion i C. Enligt specifikationen i C11-standarden representeras varje komplex typ av en C-array med två element som innehåller den reella respektive imaginära delen.

source: A format character may be preceded by an integral repeat count. For example, the format string ``'4h'`` means exactly the same as ``'hhhh'``.
sv: Ett formattecken kan föregås av ett helt upprepningsantal. Till exempel betyder formatsträngen ``'4h'`` exakt samma sak som ``'hhhh'``.

source: Whitespace characters between formats are ignored; a count and its format must not contain whitespace though.
sv: Whitespace-tecken mellan format ignoreras; ett count och dess format får dock inte innehålla whitespace.

source: When packing a value ``x`` using one of the integer formats (``'b'``, ``'B'``, ``'h'``, ``'H'``, ``'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), if ``x`` is outside the valid range for that format then :exc:`struct.error` is raised.
sv: När du packar ett värde ``x`` med ett av heltalsformaten (``'b'``, ``'B'``, ``'h'``, ``'H'``, ``'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), om ``x`` är utanför det giltiga intervallet för det formatet, kommer :exc:`struct.error` att visas.

source: Previously, some of the integer formats wrapped out-of-range values and raised :exc:`DeprecationWarning` instead of :exc:`struct.error`.
sv: Tidigare har vissa av heltalsformaten paketerat värden utanför intervallet och gett upphov till :exc:`DeprecationWarning` istället för :exc:`struct.error`.
