Repository: yeager/python-docs-sv
Catalog: library/subprocess.po
Languages: sv

source: If *encoding* or *errors* are specified, or *text* is true, the file objects *stdin*, *stdout* and *stderr* are opened in text mode with the specified *encoding* and *errors*, as described above in :ref:`frequently-used-arguments`. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
sv: Om *encoding* eller *errors* anges, eller *text* är true, öppnas filobjekten *stdin*, *stdout* och *stderr* i textläge med angiven *encoding* och *errors*, enligt beskrivningen ovan i :ref:`frequently-used-arguments`. Argumentet *universal_newlines* är likvärdigt med *text* och tillhandahålls för bakåtkompatibilitet. Som standard öppnas filobjekt i binärt läge.

source: *encoding* and *errors* were added.
sv: *kodning* och *fel* har lagts till.

source: *text* was added as a more readable alias for *universal_newlines*.
sv: *text* lades till som ett mer läsbart alias för *universal_newlines*.

source: If given, *startupinfo* will be a :class:`STARTUPINFO` object, which is passed to the underlying ``CreateProcess`` function.
sv: Om *startupinfo* anges kommer det att vara ett :class:`STARTUPINFO`-objekt som skickas till den underliggande funktionen ``CreateProcess``.

source: If given, *creationflags*, can be one or more of the following flags:
sv: Om *creationflags* anges kan det vara en eller flera av följande flaggor:

source: *pipesize* can be used to change the size of the pipe when :data:`PIPE` is used for *stdin*, *stdout* or *stderr*. The size of the pipe is only changed on platforms that support this (only Linux at this time of writing). Other platforms will ignore this parameter.
sv: *pipesize* kan användas för att ändra storleken på pipen när :data:`PIPE` används för *stdin*, *stdout* eller *stderr*. Storleken på röret ändras endast på plattformar som stöder detta (endast Linux i skrivande stund). Andra plattformar ignorerar denna parameter.

source: Added the *pipesize* parameter.
sv: Parametern *pipesize* har lagts till.

source: Popen objects are supported as context managers via the :keyword:`with` statement: on exit, standard file descriptors are closed, and the process is waited for. ::
sv: Popen-objekt stöds som kontexthanterare via :keyword:`with`-satsen: vid avslutning stängs standardfilbeskrivare och processen inväntas. ::

source: with Popen(["ifconfig"], stdout=PIPE) as proc: log.write(proc.stdout.read())
sv: med Popen(["ifconfig"], stdout=PIPE) som proc: log.write(proc.stdout.read())

source: Popen and the other functions in this module that use it raise an :ref:`auditing event <auditing>` ``subprocess.Popen`` with arguments ``executable``, ``args``, ``cwd``, and ``env``. The value for ``args`` may be a single string or a list of strings, depending on platform.
sv: Popen och de andra funktionerna i denna modul som använder den skapar en :ref:`auditing event <auditing>` ``subprocess.Popen`` med argumenten ``executable``, ``args``, ``cwd`` och ``env``. Värdet för ``args`` kan vara en enda sträng eller en lista med strängar, beroende på plattform.

source: Added context manager support.
sv: Stöd för kontexthanterare har lagts till.

source: Popen destructor now emits a :exc:`ResourceWarning` warning if the child process is still running.
sv: Popen-destruktorn avger nu en :exc:`ResourceWarning`-varning om barnprocessen fortfarande körs.

source: Popen can use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, Popen constructor using :func:`os.posix_spawn` no longer raise an exception on errors like missing program, but the child process fails with a non-zero :attr:`~Popen.returncode`.
sv: Popen kan använda :func:`os.posix_spawn` i vissa fall för bättre prestanda. I Windows Subsystem for Linux och QEMU User Emulation ger Popen-konstruktören som använder :func:`os.posix_spawn` inte längre upphov till ett undantag vid fel som att programmet saknas, men barnprocessen misslyckas med en :attr:`~Popen.returncode` som inte är noll.

source: Exceptions
sv: Undantag

source: Exceptions raised in the child process, before the new program has started to execute, will be re-raised in the parent.
sv: Undantag som uppstår i den underordnade processen innan det nya programmet har börjat exekveras kommer att uppstå på nytt i den överordnade processen.

source: The most common exception raised is :exc:`OSError`. This occurs, for example, when trying to execute a non-existent file. Applications should prepare for :exc:`OSError` exceptions. Note that, when ``shell=True``, :exc:`OSError` will be raised by the child only if the selected shell itself was not found. To determine if the shell failed to find the requested application, it is necessary to check the return code or output from the subprocess.
sv: Det vanligaste undantaget är :exc:`OSError`. Detta inträffar t.ex. när man försöker exekvera en icke-existerande fil. Program bör förbereda sig för :exc:`OSError`-undantag. Observera att när ``shell=True``, kommer :exc:`OSError` att utlösas av det underordnade programmet endast om det valda skalet inte hittades. För att avgöra om skalet misslyckades med att hitta den begärda applikationen är det nödvändigt att kontrollera returkoden eller utdata från subprocessen.

source: A :exc:`ValueError` will be raised if :class:`Popen` is called with invalid arguments.
sv: Ett :exc:`ValueError` kommer att uppstå om :class:`Popen` anropas med ogiltiga argument.

source: :func:`check_call` and :func:`check_output` will raise :exc:`CalledProcessError` if the called process returns a non-zero return code.
sv: :func:`check_call` och :func:`check_output` ger upphov till :exc:`CalledProcessError` om den anropade processen returnerar en returkod som inte är noll.

source: All of the functions and methods that accept a *timeout* parameter, such as :func:`run` and :meth:`Popen.communicate` will raise :exc:`TimeoutExpired` if the timeout expires before the process exits.
sv: Alla funktioner och metoder som accepterar en *timeout*-parameter, t.ex. :func:`run` och :meth:`Popen.communicate`, ger upphov till :exc:`TimeoutExpired` om timeouten löper ut innan processen avslutas.

source: Exceptions defined in this module all inherit from :exc:`SubprocessError`.
sv: Undantag som definieras i denna modul ärver alla från :exc:`SubprocessError`.

source: The :exc:`SubprocessError` base class was added.
sv: Basklassen :exc:`SubprocessError` lades till.

source: Security Considerations
sv: Säkerhetsöverväganden

source: Unlike some other popen functions, this library will not implicitly choose to call a system shell. This means that all characters, including shell metacharacters, can safely be passed to child processes. If the shell is invoked explicitly, via ``shell=True``, it is the application's responsibility to ensure that all whitespace and metacharacters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. On :ref:`some platforms <shlex-quote-warning>`, it is possible to use :func:`shlex.quote` for this escaping.
sv: Till skillnad från vissa andra popen-funktioner kommer detta bibliotek inte att implicit välja att anropa ett systemskal. Detta innebär att alla tecken, inklusive metatecken i skalet, kan skickas vidare till underordnade processer på ett säkert sätt. Om skalet anropas explicit, via ``shell=True``, är det applikationens ansvar att se till att alla blanksteg och metatecken citeras på rätt sätt för att undvika `shell injection &lt;https://en.wikipedia.org/wiki/Shell_injection#Shell_injection&gt;`_ sårbarheter. På :ref:``vissa plattformar <shlex-quote-warning>`` är det möjligt att använda :func:`shlex.quote` för denna escaping.

source: On Windows, batch files (:file:`*.bat` or :file:`*.cmd`) may be launched by the operating system in a system shell regardless of the arguments passed to this library. This could result in arguments being parsed according to shell rules, but without any escaping added by Python. If you are intentionally launching a batch file with arguments from untrusted sources, consider passing ``shell=True`` to allow Python to escape special characters. See :gh:`114539` for additional discussion.
sv: På Windows kan batchfiler (:file:`*.bat` eller :file:`*.cmd`) startas av operativsystemet i ett systemskal oavsett vilka argument som skickas till detta bibliotek. Detta kan resultera i att argumenten tolkas enligt skalets regler, men utan någon escaping som Python lägger till. Om du avsiktligt startar en batchfil med argument från opålitliga källor, överväg att skicka ``shell=True`` för att tillåta Python att undkomma specialtecken. Se :gh:`114539` för ytterligare diskussion.

source: Popen Objects
sv: Popen Objekt

source: Instances of the :class:`Popen` class have the following methods:
sv: Instanser av klassen :class:`Popen` har följande metoder:

source: Check if child process has terminated. Set and return :attr:`~Popen.returncode` attribute. Otherwise, returns ``None``.
sv: Kontrollera om underordnad process har avslutats. Ställ in och returnera :attr:`~Popen.returncode` attribut. Annars returneras ``None``.

source: Wait for child process to terminate. Set and return :attr:`~Popen.returncode` attribute.
sv: Vänta på att underordnad process avslutas. Ställ in och returnera :attr:`~Popen.returncode` attribut.

source: If the process does not terminate after *timeout* seconds, raise a :exc:`TimeoutExpired` exception. It is safe to catch this exception and retry the wait.
sv: Om processen inte har avslutats efter *timeout* sekunder, uppstår ett :exc:`TimeoutExpired`-undantag. Det är säkert att fånga upp detta undantag och försöka vänta igen.

source: This will deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates enough output to a pipe such that it blocks waiting for the OS pipe buffer to accept more data. Use :meth:`Popen.communicate` when using pipes to avoid that.
sv: Detta leder till dödläge när man använder ``stdout=PIPE`` eller ``stderr=PIPE`` och barnprocessen genererar tillräckligt med utdata till en pipe så att den blockeras i väntan på att OS-pipe-bufferten ska ta emot mer data. Använd :meth:`Popen.communicate` när du använder pipes för att undvika detta.

source: When the ``timeout`` parameter is not ``None``, then (on POSIX) the function is implemented using a busy loop (non-blocking call and short sleeps). Use the :mod:`asyncio` module for an asynchronous wait: see :class:`asyncio.create_subprocess_exec`.
sv: När parametern ``timeout`` inte är ``None``, implementeras funktionen (på POSIX) med hjälp av en busy loop (icke-blockerande anrop och korta viloperioder). Använd modulen :mod:`asyncio` för en asynkron väntan: se :class:`asyncio.create_subprocess_exec`.

source: *timeout* was added.
sv: *timeout* har lagts till.

source: Interact with process: Send data to stdin. Read data from stdout and stderr, until end-of-file is reached. Wait for process to terminate and set the :attr:`~Popen.returncode` attribute. The optional *input* argument should be data to be sent to the child process, or ``None``, if no data should be sent to the child. If streams were opened in text mode, *input* must be a string. Otherwise, it must be bytes.
sv: Interagera med processen: Skicka data till stdin. Läs data från stdout och stderr, tills slutet av filen nås. Vänta på att processen avslutas och ställ in attributet :attr:`~Popen.returncode`. Det valfria argumentet *input* ska vara data som ska skickas till den underordnade processen, eller ``None``, om inga data ska skickas till den underordnade processen. Om strömmarna öppnades i textläge måste *input* vara en sträng. Annars måste det vara bytes.

source: :meth:`communicate` returns a tuple ``(stdout_data, stderr_data)``. The data will be strings if streams were opened in text mode; otherwise, bytes.
sv: :meth:`communicate` returnerar en tupel ``(stdout_data, stderr_data)``. Data kommer att vara strängar om strömmarna öppnades i textläge; annars bytes.

source: Note that if you want to send data to the process's stdin, you need to create the Popen object with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, you need to give ``stdout=PIPE`` and/or ``stderr=PIPE`` too.
sv: Observera att om du vill skicka data till processens stdin måste du skapa Popen-objektet med ``stdin=PIPE``. På samma sätt måste du också ange ``stdout=PIPE`` och/eller ``stderr=PIPE`` för att få något annat än ``None`` i resultattupeln.

source: If the process does not terminate after *timeout* seconds, a :exc:`TimeoutExpired` exception will be raised. Catching this exception and retrying communication will not lose any output.
sv: Om processen inte avslutas efter *timeout* sekunder, kommer ett :exc:`TimeoutExpired` undantag att uppstå. Om detta undantag fångas upp och kommunikationen försöker på nytt förloras inte någon utdata.

source: The child process is not killed if the timeout expires, so in order to cleanup properly a well-behaved application should kill the child process and finish communication::
sv: Barnprocessen dödas inte om timeouten går ut, så för att rensa upp ordentligt bör en väluppfostrad applikation döda barnprocessen och avsluta kommunikationen::

source: proc = subprocess.Popen(...) try: outs, errs = proc.communicate(timeout=15) except TimeoutExpired: proc.kill() outs, errs = proc.communicate()
sv: proc = underprocess.Popen(...) försök: outs, errs = proc.communicate(timeout=15) except TimeoutExpired: proc.kill() outs, errs = proc.communicate()

source: The data read is buffered in memory, so do not use this method if the data size is large or unlimited.
sv: De data som läses buffras i minnet, så använd inte den här metoden om datastorleken är stor eller obegränsad.

source: Sends the signal *signal* to the child.
sv: Sänder signalen *signal* till barnet.

source: Do nothing if the process completed.
sv: Gör ingenting om processen är klar.

source: On Windows, SIGTERM is an alias for :meth:`terminate`. CTRL_C_EVENT and CTRL_BREAK_EVENT can be sent to processes started with a *creationflags* parameter which includes ``CREATE_NEW_PROCESS_GROUP``.
sv: I Windows är SIGTERM ett alias för :meth:`terminate`. CTRL_C_EVENT och CTRL_BREAK_EVENT kan skickas till processer som startats med en *creationflags*-parameter som inkluderar ``CREATE_NEW_PROCESS_GROUP``.

source: Stop the child. On POSIX OSs the method sends :py:const:`~signal.SIGTERM` to the child. On Windows the Win32 API function :c:func:`!TerminateProcess` is called to stop the child.
sv: Stoppar det underordnade programmet. På POSIX-operativsystem skickar metoden :py:const:`~signal.SIGTERM` till den underordnade enheten. På Windows anropas Win32 API-funktionen :c:func:`!TerminateProcess` för att stoppa den underordnade.

source: Kills the child. On POSIX OSs the function sends SIGKILL to the child. On Windows :meth:`kill` is an alias for :meth:`terminate`.
sv: Dödar barnet. På POSIX-operativsystem skickar funktionen SIGKILL till barnet. På Windows är :meth:`kill` ett alias för :meth:`terminate`.

source: The following attributes are also set by the class for you to access. Reassigning them to new values is unsupported:
sv: Följande attribut ställs också in av klassen så att du kan komma åt dem. Att tilldela dem nya värden stöds inte:

source: The *args* argument as it was passed to :class:`Popen` -- a sequence of program arguments or else a single string.
sv: Argumentet *args* som det skickades till :class:`Popen` -- en sekvens av programargument eller en enda sträng.

source: If the *stdin* argument was :data:`PIPE`, this attribute is a writeable stream object as returned by :func:`open`. If the *encoding* or *errors* arguments were specified or the *text* or *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stdin* argument was not :data:`PIPE`, this attribute is ``None``.
sv: Om *stdin*-argumentet var :data:`PIPE`, är detta attribut ett skrivbart strömobjekt som returneras av :func:`open`. Om argumenten *encoding* eller *errors* specificerades eller om argumentet *text* eller *universal_newlines* var ``True``, är strömmen en textström, annars är den en byte-ström. Om argumentet *stdin* inte var :data:`PIPE`, är detta attribut ``None``.

source: If the *stdout* argument was :data:`PIPE`, this attribute is a readable stream object as returned by :func:`open`. Reading from the stream provides output from the child process. If the *encoding* or *errors* arguments were specified or the *text* or *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stdout* argument was not :data:`PIPE`, this attribute is ``None``.
sv: Om argumentet *stdout* var :data:`PIPE`, är detta attribut ett läsbart strömobjekt som returneras av :func:`open`. Läsning från strömmen ger utdata från barnprocessen. Om argumenten *encoding* eller *errors* specificerades eller om argumentet *text* eller *universal_newlines* var ``True``, är strömmen en textström, annars är den en byte-ström. Om argumentet *stdout* inte var :data:`PIPE`, är detta attribut ``None``.

source: If the *stderr* argument was :data:`PIPE`, this attribute is a readable stream object as returned by :func:`open`. Reading from the stream provides error output from the child process. If the *encoding* or *errors* arguments were specified or the *text* or *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stderr* argument was not :data:`PIPE`, this attribute is ``None``.
sv: Om argumentet *stderr* var :data:`PIPE`, är detta attribut ett läsbart strömobjekt som returneras av :func:`open`. Läsning från strömmen ger felutmatning från underordnad process. Om argumenten *encoding* eller *errors* specificerades eller om argumentet *text* eller *universal_newlines* var ``True``, är strömmen en textström, annars är den en byte-ström. Om argumentet *stderr* inte var :data:`PIPE`, är detta attribut ``None``.

source: Use :meth:`~Popen.communicate` rather than :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` or :attr:`.stderr.read <Popen.stderr>` to avoid deadlocks due to any of the other OS pipe buffers filling up and blocking the child process.
sv: Använd :meth:`~Popen.communicate` i stället för :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` eller :attr:`.stderr.read <Popen.stderr>` för att undvika dödlägen på grund av att någon av de andra OS-pipebuffertarna fylls och blockerar barnprocessen.

source: The process ID of the child process.
sv: Process-ID för den underordnade processen.

source: Note that if you set the *shell* argument to ``True``, this is the process ID of the spawned shell.
sv: Observera att om du anger argumentet *shell* till ``True``, är detta process-ID för det skapade skalet.

source: The child return code. Initially ``None``, :attr:`returncode` is set by a call to the :meth:`poll`, :meth:`wait`, or :meth:`communicate` methods if they detect that the process has terminated.
sv: Barnets returkod. Ursprungligen ``None``, :attr:`returncode`` sätts av ett anrop till metoderna :meth:`poll`, :meth:`wait`, eller :meth:`communicate` om de upptäcker att processen har avslutats.

source: A ``None`` value indicates that the process hadn't yet terminated at the time of the last method call.
sv: Ett värde på ``None`` anger att processen ännu inte hade avslutats vid tidpunkten för det senaste metodanropet.

source: Windows Popen Helpers
sv: Windows Popen Hjälpmedel

source: The :class:`STARTUPINFO` class and following constants are only available on Windows.
sv: Klassen :class:`STARTUPINFO` och följande konstanter är endast tillgängliga i Windows.

source: Partial support of the Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ structure is used for :class:`Popen` creation. The following attributes can be set by passing them as keyword-only arguments.
sv: Delvis stöd för Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__-struktur används för skapande av :class:`Popen`. Följande attribut kan ställas in genom att skicka dem som argument med endast nyckelord.

source: Keyword-only argument support was added.
sv: Stöd för argument med enbart nyckelord har lagts till.

source: A bit field that determines whether certain :class:`STARTUPINFO` attributes are used when the process creates a window. ::
sv: Ett bitfält som avgör om vissa :class:`STARTUPINFO`-attribut ska användas när processen skapar ett fönster. ::

source: si = subprocess.STARTUPINFO() si.dwFlags = subprocess.STARTF_USESTDHANDLES | subprocess.STARTF_USESHOWWINDOW
sv: si = underprocess.STARTUPINFO() si.dwFlags = subprocess.STARTF_USESTDHANDLES | subprocess.STARTF_USESHOWWINDOW

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard input handle for the process. If :data:`STARTF_USESTDHANDLES` is not specified, the default for standard input is the keyboard buffer.
sv: Om :attr:`dwFlags` anger :data:`STARTF_USESTDHANDLES`, är detta attribut processens standardinmatningshandtag. Om :data:`STARTF_USESTDHANDLES` inte anges, är standardinmatningen tangentbordsbufferten.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard output handle for the process. Otherwise, this attribute is ignored and the default for standard output is the console window's buffer.
sv: Om :attr:`dwFlags` anger :data:`STARTF_USESTDHANDLES`, är detta attribut processens standardutdatahandtag. I annat fall ignoreras attributet och standardvärdet för standardutdata är konsolfönstrets buffert.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard error handle for the process. Otherwise, this attribute is ignored and the default for standard error is the console window's buffer.
sv: Om :attr:`dwFlags` specificerar :data:`STARTF_USESTDHANDLES`, är detta attribut processens standardfelhandtag. Annars ignoreras detta attribut och standardvärdet för standardfel är konsolfönstrets buffert.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESHOWWINDOW`, this attribute can be any of the values that can be specified in the ``nCmdShow`` parameter for the `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__ function, except for ``SW_SHOWDEFAULT``. Otherwise, this attribute is ignored.
sv: Om :attr:`dwFlags` anger :data:`STARTF_USESHOWWINDOW`, kan detta attribut vara vilket som helst av de värden som kan anges i parametern ``nCmdShow`` för funktionen `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__, utom ``SW_SHOWDEFAULT``. I annat fall ignoreras detta attribut.

source: :data:`SW_HIDE` is provided for this attribute. It is used when :class:`Popen` is called with ``shell=True``.
sv: :data:`SW_HIDE` tillhandahålls för detta attribut. Det används när :class:`Popen` anropas med ``shell=True``.

source: A dictionary of additional attributes for process creation as given in ``STARTUPINFOEX``, see `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.
sv: En ordlista med ytterligare attribut för skapande av processer som anges i ``STARTUPINFOEX``, se `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.

source: Supported attributes:
sv: Attribut som stöds:

source: **handle_list**
sv: **handtag_lista**

source: Sequence of handles that will be inherited. *close_fds* must be true if non-empty.
sv: Sekvens av handtag som kommer att ärvas. *close_fds* måste vara true om den inte är tom.
