Repository: yeager/python-docs-sv
Catalog: library/subprocess.po
Languages: sv

source: Execute a child program in a new process. On POSIX, the class uses :meth:`os.execvpe`-like behavior to execute the child program. On Windows, the class uses the Windows ``CreateProcess()`` function. The arguments to :class:`Popen` are as follows.
sv: Exekverar ett underordnat program i en ny process. På POSIX använder klassen :meth:`os.execvpe`-liknande beteende för att exekvera det underordnade programmet. På Windows använder klassen Windows-funktionen ``CreateProcess()``. Argumenten till :class:`Popen` är följande.

source: *args* should be a sequence of program arguments or else a single string or :term:`path-like object`. By default, the program to execute is the first item in *args* if *args* is a sequence. If *args* is a string, the interpretation is platform-dependent and described below. See the *shell* and *executable* arguments for additional differences from the default behavior. Unless otherwise stated, it is recommended to pass *args* as a sequence.
sv: *args* bör vara en sekvens av programargument eller en enskild sträng eller :term:`path-like object`. Som standard är det program som ska köras det första objektet i *args* om *args* är en sekvens. Om *args* är en sträng är tolkningen plattformsberoende och beskrivs nedan. Se argumenten *shell* och *executable* för ytterligare skillnader från standardbeteendet. Om inget annat anges rekommenderas det att *args* skickas som en sekvens.

source: For maximum reliability, use a fully qualified path for the executable. To search for an unqualified name on :envvar:`PATH`, use :meth:`shutil.which`. On all platforms, passing :data:`sys.executable` is the recommended way to launch the current Python interpreter again, and use the ``-m`` command-line format to launch an installed module.
sv: För maximal tillförlitlighet bör du använda en fullständigt kvalificerad sökväg för den körbara filen. För att söka efter ett okvalificerat namn på :envvar:`PATH`, använd :meth:`shutil.which`. På alla plattformar är det rekommenderade sättet att skicka :data:`sys.executable` för att starta den aktuella Python-tolken igen och använda kommandoradsformatet ``-m`` för att starta en installerad modul.

source: Resolving the path of *executable* (or the first item of *args*) is platform dependent. For POSIX, see :meth:`os.execvpe`, and note that when resolving or searching for the executable path, *cwd* overrides the current working directory and *env* can override the ``PATH`` environment variable. For Windows, see the documentation of the ``lpApplicationName`` and ``lpCommandLine`` parameters of WinAPI ``CreateProcess``, and note that when resolving or searching for the executable path with ``shell=False``, *cwd* does not override the current working directory and *env* cannot override the ``PATH`` environment variable. Using a full path avoids all of these variations.
sv: Upplösning av sökvägen till *executable* (eller det första objektet i *args*) är plattformsberoende. För POSIX, se :meth:`os.execvpe`, och notera att när sökvägen till den körbara filen ska lösas eller sökas, åsidosätter *cwd* den aktuella arbetskatalogen och *env* kan åsidosätta miljövariabeln ``PATH``. För Windows, se dokumentationen för parametrarna ``lpApplicationName`` och ``lpCommandLine`` i WinAPI ``CreateProcess``, och notera att när sökvägen till den körbara filen upplöses eller söks med ``shell=False``, åsidosätter inte *cwd* den aktuella arbetskatalogen och *env* kan inte åsidosätta miljövariabeln ``PATH``. Genom att använda en fullständig sökväg undviks alla dessa variationer.

source: An example of passing some arguments to an external program as a sequence is::
sv: Ett exempel på att skicka några argument till ett externt program som en sekvens är::

source: Popen(["/usr/bin/git", "commit", "-m", "Fixes a bug."])
sv: Popen(["/usr/bin/git","commit","-m","Fixar en bugg."])

source: On POSIX, if *args* is a string, the string is interpreted as the name or path of the program to execute. However, this can only be done if not passing arguments to the program.
sv: Om *args* är en sträng på POSIX tolkas strängen som namnet på eller sökvägen till det program som ska köras. Detta kan dock bara göras om man inte skickar argument till programmet.

source: It may not be obvious how to break a shell command into a sequence of arguments, especially in complex cases. :meth:`shlex.split` can illustrate how to determine the correct tokenization for *args*::
sv: Det kanske inte är självklart hur ett skalkommando ska delas upp i en sekvens av argument, särskilt i komplexa fall. :meth:`shlex.split` kan illustrera hur man bestämmer rätt tokenisering för *args*::

source: >>> import shlex, subprocess >>> command_line = input() /bin/vikings -input eggs.txt -output "spam spam.txt" -cmd "echo '$MONEY'" >>> args = shlex.split(command_line) >>> print(args) ['/bin/vikings', '-input', 'eggs.txt', '-output', 'spam spam.txt', '-cmd', "echo '$MONEY'"] >>> p = subprocess.Popen(args) # Success!
sv: >>> import shlex, underprocess >>> command_line = input() /bin/vikings -input eggs.txt -output "spam spam.txt" -cmd "echo '$MONEY'" >>> args = shlex.split(kommandorad) >>> print(args) ['/bin/vikings', '-input', 'eggs.txt', '-output', 'spam spam.txt', '-cmd', "echo '$MONEY'"] >>> p = subprocess.Popen(args) # Framgång!

source: Note in particular that options (such as *-input*) and arguments (such as *eggs.txt*) that are separated by whitespace in the shell go in separate list elements, while arguments that need quoting or backslash escaping when used in the shell (such as filenames containing spaces or the *echo* command shown above) are single list elements.
sv: Observera särskilt att alternativ (t.ex. *-input*) och argument (t.ex. *eggs.txt*) som separeras med blanksteg i skalet hamnar i separata listelement, medan argument som kräver citering eller backslash-escaping när de används i skalet (t.ex. filnamn som innehåller blanksteg eller kommandot *echo* som visas ovan) är enskilda listelement.

source: On Windows, if *args* is a sequence, it will be converted to a string in a manner described in :ref:`converting-argument-sequence`. This is because the underlying ``CreateProcess()`` operates on strings.
sv: I Windows, om *args* är en sekvens, kommer den att konverteras till en sträng på ett sätt som beskrivs i :ref:`converting-argument-sequence`. Detta beror på att den underliggande ``CreateProcess()`` arbetar med strängar.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing path-like objects on POSIX.
sv: *args* parametern accepterar en :term:`sökvägsliknande objekt` om *shell* är ``False`` och en sekvens som innehåller sökvägsliknande objekt på POSIX.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing bytes and path-like objects on Windows.
sv: *args* parameter accepterar en :term:`sökvägsliknande objekt` om *shell* är ``False`` och en sekvens som innehåller byte och sökvägsliknande objekt på Windows.

source: The *shell* argument (which defaults to ``False``) specifies whether to use the shell as the program to execute. If *shell* is ``True``, it is recommended to pass *args* as a string rather than as a sequence.
sv: Argumentet *shell* (som har ``False`` som standard) anger om skalet ska användas som det program som ska köras. Om *shell* är ``True`` rekommenderas att *args* skickas som en sträng i stället för som en sekvens.

source: On POSIX with ``shell=True``, the shell defaults to :file:`/bin/sh`. If *args* is a string, the string specifies the command to execute through the shell. This means that the string must be formatted exactly as it would be when typed at the shell prompt. This includes, for example, quoting or backslash escaping filenames with spaces in them. If *args* is a sequence, the first item specifies the command string, and any additional items will be treated as additional arguments to the shell itself. That is to say, :class:`Popen` does the equivalent of::
sv: På POSIX med ``shell=True`` är standardvärdet för skalet :file:`/bin/sh`. Om *args* är en sträng anger strängen det kommando som ska köras via skalet. Detta innebär att strängen måste formateras exakt som den skulle ha formaterats när den skrivs in vid skalets prompt. Detta inkluderar t.ex. citering eller backslash-escaping av filnamn med mellanslag. Om *args* är en sekvens anger det första elementet kommandosträngen, och alla ytterligare element behandlas som ytterligare argument till själva skalet. Det vill säga, :class:`Popen` gör motsvarande som::

source: On Windows with ``shell=True``, the :envvar:`COMSPEC` environment variable specifies the default shell. The only time you need to specify ``shell=True`` on Windows is when the command you wish to execute is built into the shell (e.g. :command:`dir` or :command:`copy`). You do not need ``shell=True`` to run a batch file or console-based executable.
sv: I Windows med ``shell=True`` anger miljövariabeln :envvar:`COMSPEC` standardskalet. Den enda gången du behöver ange ``shell=True`` i Windows är när kommandot du vill köra är inbyggt i skalet (t.ex. :command:`dir` eller :command:`copy`). Du behöver inte ``shell=True`` för att köra en batchfil eller en konsolbaserad körbar fil.

source: *bufsize* will be supplied as the corresponding argument to the :func:`open` function when creating the stdin/stdout/stderr pipe file objects:
sv: *bufsize* kommer att anges som motsvarande argument till funktionen :func:`open` när du skapar pipe-filobjekten stdin/stdout/stderr:

source: ``0`` means unbuffered (read and write are one system call and can return short)
sv: ``0`` betyder obuffrad (läsning och skrivning är ett systemanrop och kan returnera kort)

source: ``1`` means line buffered (only usable if ``text=True`` or ``universal_newlines=True``)
sv: ``1`` betyder radbuffrad (endast användbar om ``text=True`` eller ``universal_newlines=True``)

source: any other positive value means use a buffer of approximately that size
sv: alla andra positiva värden innebär att en buffert av ungefär den storleken används

source: negative bufsize (the default) means the system default of io.DEFAULT_BUFFER_SIZE will be used.
sv: negativ bufsize (standard) innebär att systemets standard io.DEFAULT_BUFFER_SIZE kommer att användas.

source: *bufsize* now defaults to -1 to enable buffering by default to match the behavior that most code expects. In versions prior to Python 3.2.4 and 3.3.1 it incorrectly defaulted to ``0`` which was unbuffered and allowed short reads. This was unintentional and did not match the behavior of Python 2 as most code expected.
sv: *bufsize* har nu standardvärdet -1 för att aktivera buffring som standard för att matcha det beteende som den mesta koden förväntar sig. I versioner före Python 3.2.4 och 3.3.1 var standardvärdet felaktigt ``0``, vilket var obuffrat och tillät korta läsningar. Detta var oavsiktligt och matchade inte beteendet i Python 2 som de flesta koder förväntade sig.

source: The *executable* argument specifies a replacement program to execute. It is very seldom needed. When ``shell=False``, *executable* replaces the program to execute specified by *args*. However, the original *args* is still passed to the program. Most programs treat the program specified by *args* as the command name, which can then be different from the program actually executed. On POSIX, the *args* name becomes the display name for the executable in utilities such as :program:`ps`. If ``shell=True``, on POSIX the *executable* argument specifies a replacement shell for the default :file:`/bin/sh`.
sv: Argumentet *executable* anger ett ersättningsprogram som ska köras. Det behövs mycket sällan. När ``shell=False`` ersätter *executable* det program som ska köras och som anges av *args*. Den ursprungliga *args* skickas dock fortfarande till programmet. De flesta program behandlar det program som anges av *args* som kommandonamnet, vilket kan skilja sig från det program som faktiskt körs. På POSIX blir *args*-namnet visningsnamnet för den körbara filen i verktyg som :program:`ps`. Om ``shell=True``, på POSIX, anger argumentet *executable* ett ersättningsskal för standard :file:`/bin/sh`.

source: *executable* parameter accepts a :term:`path-like object` on POSIX.
sv: *exekverbar* parameter accepterar en :term:`path-liknande objekt` på POSIX.

source: *executable* parameter accepts a bytes and :term:`path-like object` on Windows.
sv: *exekverbar* parameter accepterar en bytes och :term:`path-liknande objekt` på Windows.

source: *stdin*, *stdout* and *stderr* specify the executed program's standard input, standard output and standard error file handles, respectively. Valid values are ``None``, :data:`PIPE`, :data:`DEVNULL`, an existing file descriptor (a positive integer), and an existing :term:`file object` with a valid file descriptor. With the default settings of ``None``, no redirection will occur. :data:`PIPE` indicates that a new pipe to the child should be created. :data:`DEVNULL` indicates that the special file :data:`os.devnull` will be used. Additionally, *stderr* can be :data:`STDOUT`, which indicates that the stderr data from the applications should be captured into the same file handle as for *stdout*.
sv: *stdin*, *stdout* och *stderr* anger det exekverade programmets standardinmatnings-, standardutmatnings- respektive standardfelsfilhandtag. Giltiga värden är ``None``, :data:`PIPE`, :data:`DEVNULL`, en befintlig filbeskrivare (ett positivt heltal) och ett befintligt :term:`file object` med en giltig filbeskrivare. Med standardinställningarna ``None`` sker ingen omdirigering. :data:`PIPE` anger att en ny pipe till underordnade filer ska skapas. :data:`DEVNULL` anger att specialfilen :data:`os.devnull` ska användas. Dessutom kan *stderr* vara :data:`STDOUT`, vilket indikerar att stderr-data från applikationerna ska samlas in i samma filhandtag som för *stdout*.

source: If *preexec_fn* is set to a callable object, this object will be called in the child process just before the child is executed. (POSIX only)
sv: Om *preexec_fn* är inställt på ett anropbart objekt kommer detta objekt att anropas i barnprocessen strax innan barnprocessen körs. (Endast POSIX)

source: The *preexec_fn* parameter is NOT SAFE to use in the presence of threads in your application. The child process could deadlock before exec is called.
sv: Parametern *preexec_fn* är INTE SÄKER att använda om det finns trådar i programmet. Barnprocessen kan fastna i ett dödläge innan exec anropas.

source: If you need to modify the environment for the child use the *env* parameter rather than doing it in a *preexec_fn*. The *start_new_session* and *process_group* parameters should take the place of code using *preexec_fn* to call :func:`os.setsid` or :func:`os.setpgid` in the child.
sv: Om du behöver ändra miljön för barnet använder du parametern *env* i stället för att göra det i en *preexec_fn*. Parametrarna *start_new_session* och *process_group* bör ersätta kod som använder *preexec_fn* för att anropa :func:`os.setsid` eller :func:`os.setpgid` i det underordnade programmet.

source: The *preexec_fn* parameter is no longer supported in subinterpreters. The use of the parameter in a subinterpreter raises :exc:`RuntimeError`. The new restriction may affect applications that are deployed in mod_wsgi, uWSGI, and other embedded environments.
sv: Parametern *preexec_fn* stöds inte längre i undertolkar. Användningen av parametern i en undertolk ger upphov till :exc:`RuntimeError`. Den nya begränsningen kan påverka program som distribueras i mod_wsgi, uWSGI och andra inbäddade miljöer.

source: If *close_fds* is true, all file descriptors except ``0``, ``1`` and ``2`` will be closed before the child process is executed. Otherwise when *close_fds* is false, file descriptors obey their inheritable flag as described in :ref:`fd_inheritance`.
sv: Om *close_fds* är true kommer alla filbeskrivare utom ``0``, ``1`` och ``2`` att stängas innan barnprocessen körs. Annars, när *close_fds* är false, följer filbeskrivare sin ärftliga flagga enligt beskrivningen i :ref:`fd_inheritance`.

source: On Windows, if *close_fds* is true then no handles will be inherited by the child process unless explicitly passed in the ``handle_list`` element of :attr:`STARTUPINFO.lpAttributeList`, or by standard handle redirection.
sv: Om *close_fds* är true i Windows kommer inga handtag att ärvas av barnprocessen om de inte uttryckligen skickas i elementet ``handle_list`` i :attr:`STARTUPINFO.lpAttributeList`, eller genom standardomdirigering av handtag.

source: The default for *close_fds* was changed from :const:`False` to what is described above.
sv: Standardvärdet för *close_fds* ändrades från :const:`False` till det som beskrivs ovan.

source: On Windows the default for *close_fds* was changed from :const:`False` to :const:`True` when redirecting the standard handles. It's now possible to set *close_fds* to :const:`True` when redirecting the standard handles.
sv: I Windows ändrades standardvärdet för *close_fds* från :const:`False` till :const:`True` när standardhandtagen omdirigerades. Det är nu möjligt att ställa in *close_fds* till :const:`True` när standardhandtagen omdirigeras.

source: *pass_fds* is an optional sequence of file descriptors to keep open between the parent and child. Providing any *pass_fds* forces *close_fds* to be :const:`True`. (POSIX only)
sv: *pass_fds* är en valfri sekvens av filbeskrivare som ska hållas öppna mellan förälder och barn. Om du tillhandahåller någon *pass_fds* tvingas *close_fds* att vara :const:`True`. (Endast POSIX)

source: The *pass_fds* parameter was added.
sv: Parametern *pass_fds* har lagts till.

source: If *cwd* is not ``None``, the function changes the working directory to *cwd* before executing the child. *cwd* can be a string, bytes or :term:`path-like <path-like object>` object. On POSIX, the function looks for *executable* (or for the first item in *args*) relative to *cwd* if the executable path is a relative path.
sv: Om *cwd* inte är ``None`` ändrar funktionen arbetskatalogen till *cwd* innan den exekverar underobjektet. *cwd* kan vara en sträng, byte eller :term:``path-like <path-like object>`` objekt. På POSIX letar funktionen efter *executable* (eller efter det första objektet i *args*) i förhållande till *cwd* om sökvägen till den exekverbara filen är en relativ sökväg.

source: *cwd* parameter accepts a :term:`path-like object` on POSIX.
sv: *cwd* parametern accepterar en :term:`path-like object` på POSIX.

source: *cwd* parameter accepts a :term:`path-like object` on Windows.
sv: *cwd*-parametern accepterar en :term:`path-liknande objekt` på Windows.

source: *cwd* parameter accepts a bytes object on Windows.
sv: *cwd*-parametern accepterar ett bytes-objekt i Windows.

source: If *restore_signals* is true (the default) all signals that Python has set to SIG_IGN are restored to SIG_DFL in the child process before the exec. Currently this includes the SIGPIPE, SIGXFZ and SIGXFSZ signals. (POSIX only)
sv: Om *restore_signals* är true (standard) återställs alla signaler som Python har satt till SIG_IGN till SIG_DFL i barnprocessen före exekveringen. För närvarande inkluderar detta signalerna SIGPIPE, SIGXFZ och SIGXFSZ. (Endast POSIX)

source: *restore_signals* was added.
sv: *restore_signals* lades till.

source: If *start_new_session* is true the ``setsid()`` system call will be made in the child process prior to the execution of the subprocess.
sv: Om *start_new_session* är true kommer systemanropet ``setsid()`` att göras i barnprocessen innan subprocessen körs.

source: *start_new_session* was added.
sv: *start_new_session* lades till.

source: If *process_group* is a non-negative integer, the ``setpgid(0, value)`` system call will be made in the child process prior to the execution of the subprocess.
sv: Om *process_group* är ett icke-negativt heltal kommer systemanropet ``setpgid(0, value)`` att göras i barnprocessen innan subprocessen körs.

source: *process_group* was added.
sv: *process_group* har lagts till.

source: If *group* is not ``None``, the setregid() system call will be made in the child process prior to the execution of the subprocess. If the provided value is a string, it will be looked up via :func:`grp.getgrnam` and the value in ``gr_gid`` will be used. If the value is an integer, it will be passed verbatim. (POSIX only)
sv: Om *group* inte är ``None`` kommer systemanropet setregid() att göras i barnprocessen innan subprocessen körs. Om det angivna värdet är en sträng, kommer det att sökas upp via :func:`grp.getgrnam` och värdet i ``gr_gid`` kommer att användas. Om värdet är ett heltal kommer det att skickas ordagrant. (endast POSIX)

source: If *extra_groups* is not ``None``, the setgroups() system call will be made in the child process prior to the execution of the subprocess. Strings provided in *extra_groups* will be looked up via :func:`grp.getgrnam` and the values in ``gr_gid`` will be used. Integer values will be passed verbatim. (POSIX only)
sv: Om *extra_groups* inte är ``None``, kommer systemanropet setgroups() att göras i barnprocessen innan subprocessen körs. Strängar som anges i *extra_groups* kommer att sökas upp via :func:`grp.getgrnam` och värdena i ``gr_gid`` kommer att användas. Heltalsvärden kommer att skickas ordagrant. (Endast POSIX)

source: If *user* is not ``None``, the setreuid() system call will be made in the child process prior to the execution of the subprocess. If the provided value is a string, it will be looked up via :func:`pwd.getpwnam` and the value in ``pw_uid`` will be used. If the value is an integer, it will be passed verbatim. (POSIX only)
sv: Om *user* inte är ``None``, kommer systemanropet setreuid() att göras i barnprocessen innan subprocessen körs. Om det angivna värdet är en sträng, kommer det att sökas upp via :func:`pwd.getpwnam` och värdet i ``pw_uid`` kommer att användas. Om värdet är ett heltal kommer det att skickas ordagrant. (Endast POSIX)

source: If *umask* is not negative, the umask() system call will be made in the child process prior to the execution of the subprocess.
sv: Om *umask* inte är negativ, kommer systemanropet umask() att göras i barnprocessen innan subprocessen körs.

source: If *env* is not ``None``, it must be a mapping that defines the environment variables for the new process; these are used instead of the default behavior of inheriting the current process' environment. This mapping can be str to str on any platform or bytes to bytes on POSIX platforms much like :data:`os.environ` or :data:`os.environb`.
sv: Om *env* inte är ``None`` måste det vara en mappning som definierar miljövariablerna för den nya processen; dessa används i stället för standardbeteendet att ärva den aktuella processens miljö. Denna mappning kan vara str till str på alla plattformar eller bytes till bytes på POSIX-plattformar, ungefär som :data:`os.environ` eller :data:`os.environb`.

source: If specified, *env* must provide any variables required for the program to execute. On Windows, in order to run a `side-by-side assembly`_ the specified *env* **must** include a valid :envvar:`SystemRoot`.
sv: Om *env* anges måste den innehålla alla variabler som krävs för att programmet ska kunna köras. För att kunna köra en `side-by-side assembly`_ i Windows måste den angivna *env* **inkludera** en giltig :envvar:`SystemRoot`.
