Repository: yeager/python-docs-sv
Catalog: library/subprocess.po
Languages: sv

source: A double quotation mark preceded by a backslash is interpreted as a literal double quotation mark.
sv: Ett dubbelt citationstecken som föregås av ett backslash tolkas som ett bokstavligt dubbelt citationstecken.

source: Backslashes are interpreted literally, unless they immediately precede a double quotation mark.
sv: Bakåtstreck tolkas bokstavligt, såvida de inte omedelbart föregår ett dubbelt citattecken.

source: If backslashes immediately precede a double quotation mark, every pair of backslashes is interpreted as a literal backslash. If the number of backslashes is odd, the last backslash escapes the next double quotation mark as described in rule 3.
sv: Om bindestreck omedelbart föregår ett dubbelt citattecken tolkas varje par av bindestreck som ett bokstavligt bindestreck. Om antalet backslash är udda, undgår den sista backslashen nästa dubbla citattecken enligt regel 3.

source: Module which provides function to parse and escape command lines.
sv: Modul som tillhandahåller funktioner för att analysera och escapa kommandorader.

source: Disable use of ``posix_spawn()``
sv: Avaktivera användning av ``posix_spawn()``

source: On Linux, :mod:`subprocess` defaults to using the ``vfork()`` system call internally when it is safe to do so rather than ``fork()``. This greatly improves performance.
sv: På Linux använder :mod:`subprocess` som standard systemanropet ``vfork()`` internt när det är säkert att göra det istället för ``fork()``. Detta förbättrar prestandan avsevärt.

source: subprocess._USE_POSIX_SPAWN = False # See CPython issue gh-NNNNNN.
sv: subprocess._USE_POSIX_SPAWN = False # Se CPython-problem gh-NNNNNN.

source: It is safe to set this to false on any Python version. It will have no effect on older or newer versions where unsupported. Do not assume the attribute is available to read. Despite the name, a true value does not indicate the corresponding function will be used, only that it may be.
sv: Det är säkert att sätta detta till false på alla Python-versioner. Det kommer inte att ha någon effekt på äldre eller nyare versioner där det inte stöds. Anta inte att attributet är tillgängligt för läsning. Trots namnet innebär ett true-värde inte att motsvarande funktion kommer att användas, bara att den kan komma att användas.

source: Please file issues any time you have to use these private knobs with a way to reproduce the issue you were seeing. Link to that issue from a comment in your code.
sv: Vänligen skicka in frågor varje gång du måste använda dessa privata knoppar med ett sätt att reproducera problemet du såg. Länk till det problemet från en kommentar i din kod.

source: universal newlines
sv: universella nya rader

source: subprocess module
sv: underprocessmodul
