Repository: yeager/python-docs-sv
Catalog: library/subprocess.po
Languages: sv

source: :mod:`!subprocess` --- Subprocess management
sv: :mod:`!subprocess` --- Hantering av underprocesser

source: **Source code:** :source:`Lib/subprocess.py`
sv: **Källkod:** :source:`Lib/subprocess.py`

source: The :mod:`subprocess` module allows you to spawn new processes, connect to their input/output/error pipes, and obtain their return codes. This module intends to replace several older modules and functions::
sv: Med modulen :mod:`subprocess` kan du starta nya processer, ansluta till deras input/output/error pipes och få deras returkoder. Denna modul är tänkt att ersätta flera äldre moduler och funktioner::

source: Information about how the :mod:`subprocess` module can be used to replace these modules and functions can be found in the following sections.
sv: Information om hur modulen :mod:`subprocess` kan användas för att ersätta dessa moduler och funktioner finns i följande avsnitt.

source: :pep:`324` -- PEP proposing the subprocess module
sv: :pep:`324` -- PEP föreslår subprocessmodulen

source: Availability
sv: Tillgänglighet

source: This module is not supported on :ref:`mobile platforms <mobile-availability>` or :ref:`WebAssembly platforms <wasm-availability>`.
sv: Denna modul stöds inte på :ref:`mobile platforms <mobile-availability>` eller :ref:`WebAssembly platforms <wasm-availability>`.

source: Using the :mod:`subprocess` Module
sv: Använda modulen :mod:`subprocess

source: The recommended approach to invoking subprocesses is to use the :func:`run` function for all use cases it can handle. For more advanced use cases, the underlying :class:`Popen` interface can be used directly.
sv: Det rekommenderade tillvägagångssättet för att anropa underprocesser är att använda funktionen :func:`run` för alla användningsfall som den kan hantera. För mer avancerade användningsfall kan det underliggande :class:`Popen`-gränssnittet användas direkt.

source: Run the command described by *args*. Wait for command to complete, then return a :class:`CompletedProcess` instance.
sv: Kör kommandot som beskrivs av *args*. Vänta på att kommandot ska slutföras och returnera sedan en :class:`CompletedProcess`-instans.

source: The arguments shown above are merely the most common ones, described below in :ref:`frequently-used-arguments` (hence the use of keyword-only notation in the abbreviated signature). The full function signature is largely the same as that of the :class:`Popen` constructor - most of the arguments to this function are passed through to that interface. (*timeout*, *input*, *check*, and *capture_output* are not.)
sv: De argument som visas ovan är bara de vanligaste, som beskrivs nedan i :ref:`frequently-used-arguments` (därav användningen av notation med endast nyckelord i den förkortade signaturen). Den fullständiga funktionssignaturen är i stort sett densamma som för :class:`Popen`-konstruktören - de flesta av argumenten till denna funktion skickas vidare till det gränssnittet. (*timeout*, *input*, *check* och *capture_output* är inte det)

source: If *capture_output* is true, stdout and stderr will be captured. When used, the internal :class:`Popen` object is automatically created with *stdout* and *stderr* both set to :data:`~subprocess.PIPE`. The *stdout* and *stderr* arguments may not be supplied at the same time as *capture_output*. If you wish to capture and combine both streams into one, set *stdout* to :data:`~subprocess.PIPE` and *stderr* to :data:`~subprocess.STDOUT`, instead of using *capture_output*.
sv: Om *capture_output* är true, kommer stdout och stderr att fångas. När det används skapas det interna :class:`Popen`-objektet automatiskt med *stdout* och *stderr* båda inställda på :data:`~subprocess.PIPE`. Argumenten *stdout* och *stderr* får inte anges samtidigt som *capture_output*. Om du vill fånga och kombinera båda strömmarna till en, sätt *stdout* till :data:`~subprocess.PIPE` och *stderr* till :data:`~subprocess.STDOUT`, istället för att använda *capture_output*.

source: A *timeout* may be specified in seconds, it is internally passed on to :meth:`Popen.communicate`. If the timeout expires, the child process will be killed and waited for. The :exc:`TimeoutExpired` exception will be re-raised after the child process has terminated. The initial process creation itself cannot be interrupted on many platform APIs so you are not guaranteed to see a timeout exception until at least after however long process creation takes.
sv: En *timeout* kan anges i sekunder, den skickas internt vidare till :meth:`Popen.communicate`. Om tidsgränsen går ut kommer barnprocessen att dödas och vänta. Undantaget :exc:`TimeoutExpired` kommer att aktiveras igen efter att barnprocessen har avslutats. Själva skapandet av den initiala processen kan inte avbrytas på många plattforms-API:er, så det är inte säkert att du ser ett timeout-undantag förrän åtminstone efter den tid som skapandet av processen tar.

source: The *input* argument is passed to :meth:`Popen.communicate` and thus to the subprocess's stdin. If used it must be a byte sequence, or a string if *encoding* or *errors* is specified or *text* is true. When used, the internal :class:`Popen` object is automatically created with *stdin* set to :data:`~subprocess.PIPE`, and the *stdin* argument may not be used as well.
sv: Argumentet *input* skickas till :meth:`Popen.communicate` och därmed till underprocessens stdin. Om det används måste det vara en byte-sekvens, eller en sträng om *encoding* eller *errors* är specificerat eller *text* är true. När den används skapas automatiskt det interna :class:`Popen`-objektet med *stdin* satt till :data:`~subprocess.PIPE`, och argumentet *stdin* får inte heller användas.

source: If *check* is true, and the process exits with a non-zero exit code, a :exc:`CalledProcessError` exception will be raised. Attributes of that exception hold the arguments, the exit code, and stdout and stderr if they were captured.
sv: Om *check* är sant, och processen avslutas med en utgångskod som inte är noll, kommer ett :exc:`CalledProcessError` undantag att skapas. Attributen för det undantaget innehåller argumenten, utgångskoden och stdout och stderr om de fångades upp.

source: If *encoding* or *errors* are specified, or *text* is true, file objects for stdin, stdout and stderr are opened in text mode using the specified *encoding* and *errors* or the :class:`io.TextIOWrapper` default. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
sv: Om *encoding* eller *errors* anges, eller *text* är true, öppnas filobjekten för stdin, stdout och stderr i textläge med hjälp av angiven *encoding* och *errors* eller :class:`io.TextIOWrapper` standard. Argumentet *universal_newlines* är likvärdigt med *text* och tillhandahålls för bakåtkompatibilitet. Som standard öppnas filobjekt i binärt läge.

source: If *env* is not ``None``, it must be a mapping that defines the environment variables for the new process; these are used instead of the default behavior of inheriting the current process' environment. It is passed directly to :class:`Popen`. This mapping can be str to str on any platform or bytes to bytes on POSIX platforms much like :data:`os.environ` or :data:`os.environb`.
sv: Om *env* inte är ``None`` måste det vara en mappning som definierar miljövariablerna för den nya processen; dessa används i stället för standardbeteendet att ärva den aktuella processens miljö. Den skickas direkt till :class:`Popen`. Denna mappning kan vara str till str på alla plattformar eller bytes till bytes på POSIX-plattformar, ungefär som :data:`os.environ` eller :data:`os.environb`.

source: Examples::
sv: Exempel::

source: >>> subprocess.run(["ls", "-l"]) # doesn't capture output CompletedProcess(args=['ls', '-l'], returncode=0) >>> subprocess.run("exit 1", shell=True, check=True) Traceback (most recent call last): ... subprocess.CalledProcessError: Command 'exit 1' returned non-zero exit status 1 >>> subprocess.run(["ls", "-l", "/dev/null"], capture_output=True) CompletedProcess(args=['ls', '-l', '/dev/null'], returncode=0, stdout=b'crw-rw-rw- 1 root root 1, 3 Jan 23 16:23 /dev/null\n', stderr=b'')
sv: >>> subprocess.run(["ls", "-l"]) # fångar inte upp utdata CompletedProcess(args=['ls', '-l'], returncode=0) >>> subprocess.run("exit 1", shell=True, check=True) Traceback (senaste anropet senast): ... subprocess.CalledProcessError: Kommandot 'exit 1' returnerade utgångsstatus 1 som inte var noll >>> subprocess.run(["ls", "-l", "/dev/null"], capture_output=True) CompletedProcess(args=['ls', '-l', '/dev/null'], returncode=0, stdout=b'crw-rw-rw- 1 root root 1, 3 Jan 23 16:23 /dev/null\n', stderr=b'')

source: Added *encoding* and *errors* parameters
sv: Parametrarna *encoding* och *errors* har lagts till

source: Added the *text* parameter, as a more understandable alias of *universal_newlines*. Added the *capture_output* parameter.
sv: Parametern *text* har lagts till som ett mer begripligt alias för *universal_newlines*. Parametern *capture_output* har lagts till.

source: Changed Windows shell search order for ``shell=True``. The current directory and ``%PATH%`` are replaced with ``%COMSPEC%`` and ``%SystemRoot%\System32\cmd.exe``. As a result, dropping a malicious program named ``cmd.exe`` into a current directory no longer works.
sv: Ändrad sökordning för Windows shell för ``shell=True``. Den aktuella katalogen och ``%PATH%`` ersätts med ``%COMSPEC%`` och ``%SystemRoot%\System32\cmd.exe``. Som ett resultat fungerar det inte längre att släppa ett skadligt program med namnet ``cmd.exe`` i en aktuell katalog.

source: The return value from :func:`run`, representing a process that has finished.
sv: Returvärdet från :func:`run`, som representerar en process som har avslutats.

source: The arguments used to launch the process. This may be a list or a string.
sv: De argument som används för att starta processen. Detta kan vara en lista eller en sträng.

source: Exit status of the child process. Typically, an exit status of 0 indicates that it ran successfully.
sv: Avslutningsstatus för den underordnade processen. Vanligtvis innebär en exitstatus på 0 att den kördes framgångsrikt.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
sv: Ett negativt värde ``-N`` anger att barnet avslutades med signal ``N`` (endast POSIX).

source: Captured stdout from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stdout was not captured.
sv: Fångad stdout från den underordnade processen. En bytessekvens, eller en sträng om :func:`run` anropades med en kodning, fel, eller text=True. ``None`` om stdout inte fångades.

source: If you ran the process with ``stderr=subprocess.STDOUT``, stdout and stderr will be combined in this attribute, and :attr:`stderr` will be ``None``.
sv: Om du körde processen med ``stderr=subprocess.STDOUT``, kommer stdout och stderr att kombineras i detta attribut, och :attr:`stderr` kommer att vara ``None``.

source: Captured stderr from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stderr was not captured.
sv: Fångade stderr från barnprocessen. En bytessekvens, eller en sträng om :func:`run` anropades med en kodning, fel, eller text=True. ``None`` om stderr inte fångades.

source: If :attr:`returncode` is non-zero, raise a :exc:`CalledProcessError`.
sv: Om :attr:`returncode` inte är noll, skapa en :exc:`CalledProcessError`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that the special file :data:`os.devnull` will be used.
sv: Specialvärde som kan användas som argument *stdin*, *stdout* eller *stderr* till :class:`Popen` och som anger att specialfilen :data:`os.devnull` ska användas.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that a pipe to the standard stream should be opened. Most useful with :meth:`Popen.communicate`.
sv: Specialvärde som kan användas som *stdin*-, *stdout*- eller *stderr*-argument till :class:`Popen` och som anger att en pipe till standardströmmen ska öppnas. Mest användbart med :meth:`Popen.communicate`.

source: Special value that can be used as the *stderr* argument to :class:`Popen` and indicates that standard error should go into the same handle as standard output.
sv: Specialvärde som kan användas som *stderr*-argument till :class:`Popen` och som anger att standardfel ska gå till samma handtag som standardutdata.

source: Base class for all other exceptions from this module.
sv: Basklass för alla andra undantag från denna modul.

source: Subclass of :exc:`SubprocessError`, raised when a timeout expires while waiting for a child process.
sv: Underklass till :exc:`SubprocessError`, som uppstår när en timeout löper ut i väntan på en underordnad process.

source: Command that was used to spawn the child process.
sv: Kommando som användes för att starta barnprocessen.

source: Timeout in seconds.
sv: Timeout i sekunder.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``. This is always :class:`bytes` when any output was captured regardless of the ``text=True`` setting. It may remain ``None`` instead of ``b''`` when no output was observed.
sv: Utdata från barnprocessen om den fångades upp av :func:`run` eller :func:`check_output`. I annat fall, ``None``. Detta är alltid :class:`bytes` när någon utdata fångades oavsett inställningen ``text=True``. Det kan förbli ``None`` istället för ``b''`` när ingen utdata observerades.

source: Alias for output, for symmetry with :attr:`stderr`.
sv: Alias för utdata, för symmetri med :attr:`stderr`.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``. This is always :class:`bytes` when stderr output was captured regardless of the ``text=True`` setting. It may remain ``None`` instead of ``b''`` when no stderr output was observed.
sv: Stderr-utdata från barnprocessen om den fångades upp av :func:`run`. Annars, ``None``. Detta är alltid :class:`bytes` när stderr-utdata fångades upp oavsett inställningen ``text=True``. Det kan förbli ``None`` istället för ``b''`` när ingen stderr-utmatning observerades.

source: *stdout* and *stderr* attributes added
sv: *attributen stdout* och *stderr* har lagts till

source: Subclass of :exc:`SubprocessError`, raised when a process run by :func:`check_call`, :func:`check_output`, or :func:`run` (with ``check=True``) returns a non-zero exit status.
sv: Underklass till :exc:`SubprocessError`, som uppstår när en process som körs av :func:`check_call`, :func:`check_output` eller :func:`run` (med ``check=True``) returnerar en utgångsstatus som inte är noll.

source: Exit status of the child process. If the process exited due to a signal, this will be the negative signal number.
sv: Avslutningsstatus för den underordnade processen. Om processen avslutades på grund av en signal, kommer detta att vara det negativa signalnumret.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``.
sv: Utdata från barnprocessen om den fångades upp av :func:`run` eller :func:`check_output`. I annat fall, ``None``.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``.
sv: Stderr-utdata från barnprocessen om den fångades upp av :func:`run`. I annat fall, ``None``.

source: Frequently Used Arguments
sv: Ofta använda argument

source: To support a wide variety of use cases, the :class:`Popen` constructor (and the convenience functions) accept a large number of optional arguments. For most typical use cases, many of these arguments can be safely left at their default values. The arguments that are most commonly needed are:
sv: För att stödja en mängd olika användningsfall accepterar :class:`Popen`-konstruktören (och bekvämlighetsfunktionerna) ett stort antal valfria argument. För de flesta typiska användningsfall kan många av dessa argument lämnas med sina standardvärden. De argument som oftast behövs är:

source: *args* is required for all calls and should be a string, or a sequence of program arguments. Providing a sequence of arguments is generally preferred, as it allows the module to take care of any required escaping and quoting of arguments (e.g. to permit spaces in file names). If passing a single string, either *shell* must be :const:`True` (see below) or else the string must simply name the program to be executed without specifying any arguments.
sv: *args* krävs för alla anrop och ska vara en sträng eller en sekvens av programargument. Att ange en sekvens av argument är i allmänhet att föredra, eftersom det gör att modulen kan ta hand om eventuell escaping och citering av argument (t.ex. för att tillåta mellanslag i filnamn). Om du skickar en enda sträng måste antingen *shell* vara :const:`True` (se nedan) eller så måste strängen helt enkelt namnge det program som ska köras utan att ange några argument.

source: *stdin*, *stdout* and *stderr* specify the executed program's standard input, standard output and standard error file handles, respectively. Valid values are ``None``, :data:`PIPE`, :data:`DEVNULL`, an existing file descriptor (a positive integer), and an existing :term:`file object` with a valid file descriptor. With the default settings of ``None``, no redirection will occur. :data:`PIPE` indicates that a new pipe to the child should be created. :data:`DEVNULL` indicates that the special file :data:`os.devnull` will be used. Additionally, *stderr* can be :data:`STDOUT`, which indicates that the stderr data from the child process should be captured into the same file handle as for *stdout*.
sv: *stdin*, *stdout* och *stderr* anger det exekverade programmets standardinmatnings-, standardutmatnings- respektive standardfelsfilhandtag. Giltiga värden är ``None``, :data:`PIPE`, :data:`DEVNULL`, en befintlig filbeskrivare (ett positivt heltal) och ett befintligt :term:`file object` med en giltig filbeskrivare. Med standardinställningarna ``None`` sker ingen omdirigering. :data:`PIPE` anger att en ny pipe till underordnade filer ska skapas. :data:`DEVNULL` anger att specialfilen :data:`os.devnull` ska användas. Dessutom kan *stderr* vara :data:`STDOUT`, vilket indikerar att stderr-data från den underordnade processen ska samlas in i samma filhandtag som för *stdout*.

source: If *encoding* or *errors* are specified, or *text* (also known as *universal_newlines*) is true, the file objects *stdin*, *stdout* and *stderr* will be opened in text mode using the *encoding* and *errors* specified in the call or the defaults for :class:`io.TextIOWrapper`.
sv: Om *encoding* eller *errors* anges, eller *text* (även känd som *universal_newlines*) är true, öppnas filobjekten *stdin*, *stdout* och *stderr* i textläge med hjälp av de *encoding* och *errors* som anges i anropet eller standardvärdena för :class:`io.TextIOWrapper`.

source: For *stdin*, line ending characters ``'\n'`` in the input will be converted to the default line separator :data:`os.linesep`. For *stdout* and *stderr*, all line endings in the output will be converted to ``'\n'``. For more information see the documentation of the :class:`io.TextIOWrapper` class when the *newline* argument to its constructor is ``None``.
sv: För *stdin* konverteras radavslutningstecken ``'\n'`` i indata till standardradavskiljaren :data:`os.linesep`. För *stdout* och *stderr* kommer alla radavslut i utdata att konverteras till ``'\n'``. Mer information finns i dokumentationen för klassen :class:`io.TextIOWrapper` när argumentet *newline* till dess konstruktör är ``None``.

source: If text mode is not used, *stdin*, *stdout* and *stderr* will be opened as binary streams. No encoding or line ending conversion is performed.
sv: Om textläge inte används kommer *stdin*, *stdout* och *stderr* att öppnas som binära strömmar. Ingen kodning eller konvertering av radavslut utförs.

source: Added the *encoding* and *errors* parameters.
sv: Parametrarna *encoding* och *errors* har lagts till.

source: Added the *text* parameter as an alias for *universal_newlines*.
sv: Parametern *text* har lagts till som ett alias för *universal_newlines*.

source: The newlines attribute of the file objects :attr:`Popen.stdin`, :attr:`Popen.stdout` and :attr:`Popen.stderr` are not updated by the :meth:`Popen.communicate` method.
sv: Attributet newlines för filobjekten :attr:`Popen.stdin`, :attr:`Popen.stdout` och :attr:`Popen.stderr` uppdateras inte av metoden :meth:`Popen.communicate`.

source: If *shell* is ``True``, the specified command will be executed through the shell. This can be useful if you are using Python primarily for the enhanced control flow it offers over most system shells and still want convenient access to other shell features such as shell pipes, filename wildcards, environment variable expansion, and expansion of ``~`` to a user's home directory. However, note that Python itself offers implementations of many shell-like features (in particular, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser`, and :mod:`shutil`).
sv: Om *shell* är ``True`` kommer det angivna kommandot att utföras via skalet. Detta kan vara användbart om du använder Python främst för det förbättrade kontrollflöde det erbjuder jämfört med de flesta systemskal och fortfarande vill ha bekväm tillgång till andra skalfunktioner som shell pipes, filnamn wildcards, expansion av miljövariabler och expansion av ``~`` till en användares hemkatalog. Observera dock att Python själv erbjuder implementeringar av många shell-liknande funktioner (i synnerhet :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser` och :mod:`shutil`).

source: When *universal_newlines* is ``True``, the class uses the encoding :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` instead of ``locale.getpreferredencoding()``. See the :class:`io.TextIOWrapper` class for more information on this change.
sv: När *universal_newlines* är ``True`` använder klassen kodningen :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` istället för ``locale.getpreferredencoding()``. Se klassen :class:`io.TextIOWrapper` för mer information om denna ändring.

source: Read the `Security Considerations`_ section before using ``shell=True``.
sv: Läs avsnittet `Säkerhetsöverväganden`_ innan du använder ``shell=True``.

source: These options, along with all of the other options, are described in more detail in the :class:`Popen` constructor documentation.
sv: Dessa alternativ, tillsammans med alla andra alternativ, beskrivs mer i detalj i dokumentationen för :class:`Popen`-konstruktören.

source: Popen Constructor
sv: Popen Konstruktör

source: The underlying process creation and management in this module is handled by the :class:`Popen` class. It offers a lot of flexibility so that developers are able to handle the less common cases not covered by the convenience functions.
sv: Den underliggande skapandet och hanteringen av processer i den här modulen hanteras av klassen :class:`Popen`. Den erbjuder stor flexibilitet så att utvecklare kan hantera de mindre vanliga fall som inte täcks av bekvämlighetsfunktionerna.
