Repository: yeager/python-docs-sv
Catalog: library/subprocess.po
Languages: sv

source: The handles must be temporarily made inheritable by :func:`os.set_handle_inheritable` when passed to the :class:`Popen` constructor, else :class:`OSError` will be raised with Windows error ``ERROR_INVALID_PARAMETER`` (87).
sv: Handtagen måste tillfälligt göras ärftliga genom :func:`os.set_handle_inheritable` när de skickas till :class:`Popen`-konstruktören, annars kommer :class:`OSError` att uppstå med Windows-felet ``ERROR_INVALID_PARAMETER`` (87).

source: In a multithreaded process, use caution to avoid leaking handles that are marked inheritable when combining this feature with concurrent calls to other process creation functions that inherit all handles such as :func:`os.system`. This also applies to standard handle redirection, which temporarily creates inheritable handles.
sv: I en flertrådad process bör du vara försiktig så att du inte läcker handtag som är markerade som ärvbara när du kombinerar den här funktionen med samtidiga anrop till andra processskapande funktioner som ärver alla handtag, t.ex. :func:`os.system`. Detta gäller även för standardhandleomdirigering, som tillfälligt skapar ärftliga handtag.

source: Windows Constants
sv: Windows-konstanter

source: The :mod:`subprocess` module exposes the following constants.
sv: Modulen :mod:`subprocess` innehåller följande konstanter.

source: The standard input device. Initially, this is the console input buffer, ``CONIN$``.
sv: Standardinmatningsenheten. Ursprungligen är detta konsolens inmatningsbuffert, ``CONIN$``.

source: The standard output device. Initially, this is the active console screen buffer, ``CONOUT$``.
sv: Standardutmatningsenheten. Initialt är detta den aktiva konsolskärmsbufferten, ``CONOUT$``.

source: The standard error device. Initially, this is the active console screen buffer, ``CONOUT$``.
sv: Enheten för standardfel. Ursprungligen är detta den aktiva konsolskärmsbufferten, ``CONOUT$``.

source: Hides the window. Another window will be activated.
sv: Döljer fönstret. Ett annat fönster kommer att aktiveras.

source: Specifies that the :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput`, and :attr:`STARTUPINFO.hStdError` attributes contain additional information.
sv: Anger att attributen :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput` och :attr:`STARTUPINFO.hStdError` innehåller ytterligare information.

source: Specifies that the :attr:`STARTUPINFO.wShowWindow` attribute contains additional information.
sv: Anger att attributet :attr:`STARTUPINFO.wShowWindow` innehåller ytterligare information.

source: A :attr:`STARTUPINFO.dwFlags` parameter to specify that the *Working in Background* mouse cursor will be displayed while a process is launching. This is the default behavior for GUI processes.
sv: En parameter i :attr:`STARTUPINFO.dwFlags` som anger att muspekaren *Working in Background* ska visas när en process startas. Detta är standardbeteendet för GUI-processer.

source: A :attr:`STARTUPINFO.dwFlags` parameter to specify that the mouse cursor will not be changed when launching a process.
sv: En :attr:`STARTUPINFO.dwFlags`-parameter för att ange att muspekaren inte ska ändras när en process startas.

source: The new process has a new console, instead of inheriting its parent's console (the default).
sv: Den nya processen har en ny konsol, istället för att ärva sin förälders konsol (standard).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process group will be created. This flag is necessary for using :func:`os.kill` on the subprocess.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny processgrupp skall skapas. Denna flagga är nödvändig för att använda :func:`os.kill` på subprocessen.

source: This flag is ignored if :data:`CREATE_NEW_CONSOLE` is specified.
sv: Denna flagga ignoreras om :data:`CREATE_NEW_CONSOLE` anges.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an above average priority.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process skall ha en prioritet över genomsnittet.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a below average priority.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process kommer att ha en prioritet under genomsnittet.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a high priority.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process skall ha hög prioritet.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an idle (lowest) priority.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process skall ha en idle (lägsta) prioritet.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a normal priority. (default)
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process skall ha normal prioritet. (standard)

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have realtime priority. You should almost never use REALTIME_PRIORITY_CLASS, because this interrupts system threads that manage mouse input, keyboard input, and background disk flushing. This class can be appropriate for applications that "talk" directly to hardware or that perform brief tasks that should have limited interruptions.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process skall ha realtidsprioritet. Du bör nästan aldrig använda REALTIME_PRIORITY_CLASS, eftersom detta avbryter systemtrådar som hanterar musinmatning, tangentbordsinmatning och diskspolning i bakgrunden. Den här klassen kan vara lämplig för program som "pratar" direkt med maskinvara eller som utför korta uppgifter som bör ha begränsade avbrott.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not create a window.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process inte kommer att skapa ett fönster.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not inherit its parent's console. This value cannot be used with CREATE_NEW_CONSOLE.
sv: En :class:`Popen` ``creationflags``-parameter för att ange att en ny process inte ska ärva sin förälders konsol. Detta värde kan inte användas med CREATE_NEW_CONSOLE.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process does not inherit the error mode of the calling process. Instead, the new process gets the default error mode. This feature is particularly useful for multithreaded shell applications that run with hard errors disabled.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process inte ärver den anropande processens felläge. Istället får den nya processen standardfelsläget. Denna funktion är särskilt användbar för flertrådiga skalprogram som körs med hårda fel inaktiverade.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process is not associated with the job.
sv: En :class:`Popen` ``creationflags`` parameter för att ange att en ny process inte associeras med jobbet.

source: Older high-level API
sv: Äldre API på hög nivå

source: Prior to Python 3.5, these three functions comprised the high level API to subprocess. You can now use :func:`run` in many cases, but lots of existing code calls these functions.
sv: Före Python 3.5 utgjorde dessa tre funktioner API:et på hög nivå för subprocess. Du kan nu använda :func:`run` i många fall, men massor av befintlig kod anropar dessa funktioner.

source: Run the command described by *args*. Wait for command to complete, then return the :attr:`~Popen.returncode` attribute.
sv: Kör kommandot som beskrivs av *args*. Vänta tills kommandot är klart och returnera sedan attributet :attr:`~Popen.returncode`.

source: Code needing to capture stdout or stderr should use :func:`run` instead::
sv: Kod som behöver fånga stdout eller stderr bör använda :func:`run` istället::

source: To suppress stdout or stderr, supply a value of :data:`DEVNULL`.
sv: För att undertrycka stdout eller stderr, ange ett värde på :data:`DEVNULL`.

source: The arguments shown above are merely some common ones. The full function signature is the same as that of the :class:`Popen` constructor - this function passes all supplied arguments other than *timeout* directly through to that interface.
sv: De argument som visas ovan är bara några vanliga. Den fullständiga funktionssignaturen är densamma som för :class:`Popen`-konstruktören - den här funktionen skickar alla medföljande argument utom *timeout* direkt till gränssnittet.

source: Do not use ``stdout=PIPE`` or ``stderr=PIPE`` with this function. The child process will block if it generates enough output to a pipe to fill up the OS pipe buffer as the pipes are not being read from.
sv: Använd inte ``stdout=PIPE`` eller ``stderr=PIPE`` med denna funktion. Barnprocessen blockeras om den genererar tillräckligt med utdata till en pipe för att fylla OS-pipe-bufferten eftersom pipes inte läses från.

source: Run command with arguments. Wait for command to complete. If the return code was zero then return, otherwise raise :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute. If :func:`check_call` was unable to start the process it will propagate the exception that was raised.
sv: Kör kommandot med argument. Vänta på att kommandot ska slutföras. Om returkoden var noll så returnera, annars skapa :exc:`CalledProcessError`. Objektet :exc:`CalledProcessError` kommer att ha returkoden i attributet :attr:`~CalledProcessError.returncode`. Om :func:`check_call` inte kunde starta processen kommer det undantag som togs upp att spridas.

source: Run command with arguments and return its output.
sv: Kör kommandot med argument och returnera dess utdata.

source: If the return code was non-zero it raises a :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute and any output in the :attr:`~CalledProcessError.output` attribute.
sv: Om returkoden var en annan än noll genereras ett :exc:`CalledProcessError`. Objektet :exc:`CalledProcessError` kommer att ha returkoden i attributet :attr:`~CalledProcessError.returncode` och eventuell utdata i attributet :attr:`~CalledProcessError.output`.

source: This is equivalent to::
sv: Detta är likvärdigt med::

source: The arguments shown above are merely some common ones. The full function signature is largely the same as that of :func:`run` - most arguments are passed directly through to that interface. One API deviation from :func:`run` behavior exists: passing ``input=None`` will behave the same as ``input=b''`` (or ``input=''``, depending on other arguments) rather than using the parent's standard input file handle.
sv: De argument som visas ovan är bara några vanliga. Den fullständiga funktionssignaturen är i stort sett densamma som för :func:`run` - de flesta argument skickas direkt till det gränssnittet. En API-avvikelse från :func:`run`-beteendet finns: om man skickar ``input=None`` kommer det att bete sig på samma sätt som ``input=b''`` (eller ``input=''``, beroende på andra argument) i stället för att använda förälderns standardinmatningsfilhandtag.

source: By default, this function will return the data as encoded bytes. The actual encoding of the output data may depend on the command being invoked, so the decoding to text will often need to be handled at the application level.
sv: Som standard returnerar denna funktion data som kodade bytes. Den faktiska kodningen av utdata kan bero på vilket kommando som anropas, så avkodningen till text måste ofta hanteras på programnivå.

source: This behaviour may be overridden by setting *text*, *encoding*, *errors*, or *universal_newlines* to ``True`` as described in :ref:`frequently-used-arguments` and :func:`run`.
sv: Detta beteende kan åsidosättas genom att *text*, *encoding*, *errors* eller *universal_newlines* sätts till ``True`` enligt beskrivningen i :ref:`frequently-used-arguments` och :func:`run`.

source: To also capture standard error in the result, use ``stderr=subprocess.STDOUT``::
sv: För att även fånga upp standardfel i resultatet, använd ``stderr=subprocess.STDOUT``::

source: >>> subprocess.check_output( ... "ls non_existent_file; exit 0", ... stderr=subprocess.STDOUT, ... shell=True) 'ls: non_existent_file: No such file or directory\n'
sv: >>> subprocess.check_output( ... "ls icke_existerande_fil; avsluta 0", ... stderr=subprocess.STDOUT, ... shell=True) "ls: non_existent_file: Ingen sådan fil eller katalog\n'

source: Support for the *input* keyword argument was added.
sv: Stöd för nyckelordsargumentet *input* har lagts till.

source: *encoding* and *errors* were added. See :func:`run` for details.
sv: *encoding* och *errors* har lagts till. Se :func:`run` för detaljer.

source: Replacing Older Functions with the :mod:`subprocess` Module
sv: Ersätta äldre funktioner med modulen :mod:`subprocess

source: In this section, "a becomes b" means that b can be used as a replacement for a.
sv: I detta avsnitt betyder "a blir b" att b kan användas som ersättning för a.

source: All "a" functions in this section fail (more or less) silently if the executed program cannot be found; the "b" replacements raise :exc:`OSError` instead.
sv: Alla "a"-funktioner i detta avsnitt misslyckas (mer eller mindre) tyst om det exekverade programmet inte kan hittas; "b"-ersättningarna ger istället :exc:`OSError`.

source: In addition, the replacements using :func:`check_output` will fail with a :exc:`CalledProcessError` if the requested operation produces a non-zero return code. The output is still available as the :attr:`~CalledProcessError.output` attribute of the raised exception.
sv: Dessutom kommer de ersättningar som använder :func:`check_output` att misslyckas med en :exc:`CalledProcessError` om den begärda operationen ger en returkod som inte är noll. Utdata är fortfarande tillgänglig som attributet :attr:`~CalledProcessError.output` för det undantag som uppstått.

source: In the following examples, we assume that the relevant functions have already been imported from the :mod:`subprocess` module.
sv: I följande exempel antar vi att de relevanta funktionerna redan har importerats från modulen :mod:`subprocess`.

source: Replacing :program:`/bin/sh` shell command substitution
sv: Ersätter :program:`/bin/sh` substitution av skalkommando

source: becomes::
sv: blir::

source: Replacing shell pipeline
sv: Byte av skalpipeline

source: p1 = Popen(["dmesg"], stdout=PIPE) p2 = Popen(["grep", "hda"], stdin=p1.stdout, stdout=PIPE) p1.stdout.close() # Allow p1 to receive a SIGPIPE if p2 exits. output = p2.communicate()[0]
sv: p1 = Popen(["dmesg"], stdout=PIPE) p2 = Popen(["grep", "hda"], stdin=p1.stdout, stdout=PIPE) p1.stdout.close() # Tillåt p1 att ta emot ett SIGPIPE om p2 avslutas. output = p2.communicate()[0]

source: The ``p1.stdout.close()`` call after starting the p2 is important in order for p1 to receive a SIGPIPE if p2 exits before p1.
sv: Anropet ``p1.stdout.close()`` efter att p2 har startats är viktigt för att p1 ska få ett SIGPIPE om p2 avslutas före p1.

source: Alternatively, for trusted input, the shell's own pipeline support may still be used directly:
sv: Alternativt kan skalets eget pipeline-stöd fortfarande användas direkt för betrodd inmatning:

source: Replacing :func:`os.system`
sv: Ersätter :func:`os.system`

source: sts = os.system("mycmd" + " myarg") # becomes retcode = call("mycmd" + " myarg", shell=True)
sv: sts = os.system("mycmd" + " myarg") # blir retcode = call("mycmd" + " myarg", shell=True)

source: Notes:
sv: Anteckningar:

source: Calling the program through the shell is usually not required.
sv: Att anropa programmet via skalet är vanligtvis inte nödvändigt.

source: The :func:`call` return value is encoded differently to that of :func:`os.system`.
sv: Returvärdet för :func:`call` är kodat på ett annat sätt än för :func:`os.system`.

source: The :func:`os.system` function ignores SIGINT and SIGQUIT signals while the command is running, but the caller must do this separately when using the :mod:`subprocess` module.
sv: Funktionen :func:`os.system` ignorerar SIGINT- och SIGQUIT-signaler medan kommandot körs, men den som anropar måste göra detta separat när modulen :mod:`subprocess` används.

source: A more realistic example would look like this::
sv: Ett mer realistiskt exempel skulle kunna se ut så här::

source: try: retcode = call("mycmd" + " myarg", shell=True) if retcode < 0: print("Child was terminated by signal", -retcode, file=sys.stderr) else: print("Child returned", retcode, file=sys.stderr) except OSError as e: print("Execution failed:", e, file=sys.stderr)
sv: försök: retcode = call("mycmd" + " myarg", shell=True) om retcode < 0: print("Barnet avslutades av en signal", -retcode, file=sys.stderr) i annat fall print("Barnet återvände", retcode, file=sys.stderr) except OSError as e: print("Exekveringen misslyckades:", e, file=sys.stderr)

source: Replacing the :func:`os.spawn <os.spawnl>` family
sv: Ersätter :func:`os.spawn <os.spawnl>`-familjen

source: P_NOWAIT example::
sv: P_NOWAIT exempel::

source: P_WAIT example::
sv: P_WAIT exempel::

source: Vector example::
sv: Vektor exempel::

source: os.spawnvp(os.P_NOWAIT, path, args) ==> Popen([path] + args[1:])
sv: os.spawnvp(os.P_NOWAIT, sökväg, args) ==> Popen([sökväg] + args[1:])

source: Environment example::
sv: Exempel på miljö::

source: Replacing :func:`os.popen`
sv: Ersätter :func:`os.popen`

source: Return code handling translates as follows::
sv: Hanteringen av returkoden översätts på följande sätt::

source: pipe = os.popen(cmd, 'w') ... rc = pipe.close() if rc is not None and rc >> 8: print("There were some errors") ==> process = Popen(cmd, stdin=PIPE) ... process.stdin.close() if process.wait() != 0: print("There were some errors")
sv: pipe = os.popen(cmd, 'w') ... rc = pipe.close() om rc inte är None och rc >> 8: print("Det uppstod några fel") ==> process = Popen(cmd, stdin=PIPE) ... process.stdin.close() om process.wait() != 0: print("Det uppstod några fel")

source: Legacy Shell Invocation Functions
sv: Äldre funktioner för Shell-inkallning

source: This module also provides the following legacy functions from the 2.x ``commands`` module. These operations implicitly invoke the system shell and none of the guarantees described above regarding security and exception handling consistency are valid for these functions.
sv: Den här modulen innehåller också följande äldre funktioner från 2.x-modulen ``kommandon``. Dessa funktioner anropar implicit systemets skal och ingen av de garantier som beskrivs ovan beträffande säkerhet och konsekvens i undantagshanteringen gäller för dessa funktioner.

source: Return ``(exitcode, output)`` of executing *cmd* in a shell.
sv: Returnerar ``(exitcode, output)`` av att köra *cmd* i ett skal.

source: Execute the string *cmd* in a shell with :meth:`Popen.check_output` and return a 2-tuple ``(exitcode, output)``. *encoding* and *errors* are used to decode output; see the notes on :ref:`frequently-used-arguments` for more details.
sv: Exekvera strängen *cmd* i ett skal med :meth:`Popen.check_output` och returnera en 2-tupel ``(exitcode, output)``. *encoding* och *errors* används för att avkoda utdata; se noterna om :ref:`frequently-used-arguments` för mer information.

source: A trailing newline is stripped from the output. The exit code for the command can be interpreted as the return code of subprocess. Example::
sv: En efterföljande ny rad tas bort från utdata. Exitkoden för kommandot kan tolkas som returkoden för subprocessen. Exempel::

source: >>> subprocess.getstatusoutput('ls /bin/ls') (0, '/bin/ls') >>> subprocess.getstatusoutput('cat /bin/junk') (1, 'cat: /bin/junk: No such file or directory') >>> subprocess.getstatusoutput('/bin/junk') (127, 'sh: /bin/junk: not found') >>> subprocess.getstatusoutput('/bin/kill $$') (-15, '')
sv: >>> subprocess.getstatusoutput('ls /bin/ls') (0, '/bin/ls') >>> subprocess.getstatusoutput('cat /bin/junk') (1, 'cat: /bin/junk: Ingen sådan fil eller katalog') >>> underprocess.getstatusoutput('/bin/junk') (127, 'sh: /bin/junk: hittades inte') >>> subprocess.getstatusoutput('/bin/kill $$') (-15, '')

source: Windows support was added.
sv: Stöd för Windows har lagts till.

source: The function now returns (exitcode, output) instead of (status, output) as it did in Python 3.3.3 and earlier. exitcode has the same value as :attr:`~Popen.returncode`.
sv: Funktionen returnerar nu (exitcode, output) istället för (status, output) som den gjorde i Python 3.3.3 och tidigare. exitcode har samma värde som :attr:`~Popen.returncode`.

source: Return output (stdout and stderr) of executing *cmd* in a shell.
sv: Returnera utdata (stdout och stderr) från körning av *cmd* i ett skal.

source: Like :func:`getstatusoutput`, except the exit code is ignored and the return value is a string containing the command's output. Example::
sv: Som :func:`getstatusoutput`, förutom att utgångskoden ignoreras och returvärdet är en sträng som innehåller kommandots utdata. Exempel::

source: Windows support added
sv: Windows-stöd har lagts till

source: Notes
sv: Anteckningar

source: Timeout Behavior
sv: Timeout-beteende

source: When using the ``timeout`` parameter in functions like :func:`run`, :meth:`Popen.wait`, or :meth:`Popen.communicate`, users should be aware of the following behaviors:
sv: När parametern ``timeout`` används i funktioner som :func:`run`, :meth:`Popen.wait`, eller :meth:`Popen.communicate`, bör användare vara medvetna om följande beteenden:

source: **Process Creation Delay**: The initial process creation itself cannot be interrupted on many platform APIs. This means that even when specifying a timeout, you are not guaranteed to see a timeout exception until at least after however long process creation takes.
sv: **Fördröjning av processskapande**: Själva skapandet av den initiala processen kan inte avbrytas på många plattforms-API:er. Detta innebär att även om du anger en timeout är det inte säkert att du ser ett timeout-undantag förrän efter minst den tid som processskapandet tar.

source: **Extremely Small Timeout Values**: Setting very small timeout values (such as a few milliseconds) may result in almost immediate :exc:`TimeoutExpired` exceptions because process creation and system scheduling inherently require time.
sv: **Extremt små timeout-värden**: Om du anger mycket små timeout-värden (t.ex. några millisekunder) kan det leda till nästan omedelbara :exc:`TimeoutExpired`-undantag eftersom skapandet av processer och schemaläggning av system i sig kräver tid.

source: Converting an argument sequence to a string on Windows
sv: Konvertera en argumentsekvens till en sträng i Windows

source: On Windows, an *args* sequence is converted to a string that can be parsed using the following rules (which correspond to the rules used by the MS C runtime):
sv: I Windows konverteras en *args*-sekvens till en sträng som kan analyseras med hjälp av följande regler (som motsvarar de regler som används av MS C runtime):

source: Arguments are delimited by white space, which is either a space or a tab.
sv: Argumenten avgränsas av ett vitt utrymme, som antingen är ett mellanslag eller en tabb.

source: A string surrounded by double quotation marks is interpreted as a single argument, regardless of white space contained within. A quoted string can be embedded in an argument.
sv: En sträng som omges av dubbla citattecken tolkas som ett enda argument, oavsett om det finns blanksteg eller inte. En citerad sträng kan vara inbäddad i ett argument.
