Repository: yeager/python-docs-sv
Catalog: library/sys_path_init.po
Languages: sv

source: The initialization of the :data:`sys.path` module search path
sv: Initialisering av sökvägen för modulen :data:`sys.path`

source: A module search path is initialized when Python starts. This module search path may be accessed at :data:`sys.path`.
sv: En sökväg för moduler initialiseras när Python startar. Denna sökväg för moduler kan nås via :data:`sys.path`.

source: The first entry in the module search path is the directory that contains the input script, if there is one. Otherwise, the first entry is the current directory, which is the case when executing the interactive shell, a :option:`-c` command, or :option:`-m` module.
sv: Den första posten i sökvägen för modulen är den katalog som innehåller indataskriptet, om det finns ett sådant. Annars är den första posten den aktuella katalogen, vilket är fallet när du kör det interaktiva skalet, ett :option:`-c`-kommando eller en :option:`-m`-modul.

source: The :envvar:`PYTHONPATH` environment variable is often used to add directories to the search path. If this environment variable is found then the contents are added to the module search path.
sv: Miljövariabeln :envvar:`PYTHONPATH` används ofta för att lägga till kataloger i sökvägen. Om den här miljövariabeln hittas läggs innehållet till i modulens sökväg.

source: :envvar:`PYTHONPATH` will affect all installed Python versions/environments. Be wary of setting this in your shell profile or global environment variables. The :mod:`site` module offers more nuanced techniques as mentioned below.
sv: :envvar:`PYTHONPATH` kommer att påverka alla installerade Python-versioner/miljöer. Var försiktig med att ställa in detta i din skalprofil eller globala miljövariabler. Modulen :mod:`site` erbjuder mer nyanserade tekniker som nämns nedan.

source: The next items added are the directories containing standard Python modules as well as any :term:`extension module`\s that these modules depend on. Extension modules are ``.pyd`` files on Windows and ``.so`` files on other platforms. The directory with the platform-independent Python modules is called ``prefix``. The directory with the extension modules is called ``exec_prefix``.
sv: Nästa objekt som läggs till är de kataloger som innehåller Pythons standardmoduler samt alla :term:`extension module`-kataloger som dessa moduler är beroende av. Tilläggsmoduler är ``.pyd``-filer på Windows och ``.so``-filer på andra plattformar. Katalogen med de plattformsoberoende Python-modulerna kallas ``prefix``. Katalogen med tilläggsmodulerna kallas ``exec_prefix``.

source: The :envvar:`PYTHONHOME` environment variable may be used to set the ``prefix`` and ``exec_prefix`` locations. Otherwise these directories are found by using the Python executable as a starting point and then looking for various 'landmark' files and directories. Note that any symbolic links are followed so the real Python executable location is used as the search starting point. The Python executable location is called ``home``.
sv: Miljövariabeln :envvar:`PYTHONHOME` kan användas för att ange platserna ``prefix`` och ``exec_prefix``. Annars hittas dessa kataloger genom att använda den körbara Python-filen som utgångspunkt och sedan leta efter olika "landmärkes"-filer och -kataloger. Observera att alla symboliska länkar följs så att den verkliga platsen för den körbara Python-filen används som startpunkt för sökningen. Platsen för Pythons körbara fil kallas ``home``.

source: Once ``home`` is determined, the ``prefix`` directory is found by first looking for :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). On Windows the zip archive is searched for in ``home`` and on Unix the archive is expected to be in :file:`lib`. Note that the expected zip archive location is added to the module search path even if the archive does not exist. If no archive was found, Python on Windows will continue the search for ``prefix`` by looking for :file:`Lib\\os.py`. Python on Unix will look for :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). On Windows ``prefix`` and ``exec_prefix`` are the same, however on other platforms :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) is searched for and used as an anchor for ``exec_prefix``. On some platforms :file:`lib` may be :file:`lib64` or another value, see :data:`sys.platlibdir` and :envvar:`PYTHONPLATLIBDIR`.
sv: När ``home`` är bestämt hittas ``prefix``-katalogen genom att först leta efter :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). På Windows söks zip-arkivet i ``home`` och på Unix förväntas arkivet ligga i :file:`lib`. Observera att den förväntade platsen för zip-arkivet läggs till i modulens sökväg även om arkivet inte finns. Om inget arkiv hittades kommer Python på Windows att fortsätta sökningen efter ``prefix`` genom att leta efter :file:`Lib\\os.py`. Python på Unix kommer att leta efter :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). På Windows är ``prefix`` och ``exec_prefix`` samma, men på andra plattformar söks :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) och används som ankare för ``exec_prefix``. På vissa plattformar kan :file:`lib` vara :file:`lib64` eller ett annat värde, se :data:`sys.platlibdir` och :envvar:`PYTHONPLATLIBDIR`.

source: Once found, ``prefix`` and ``exec_prefix`` are available at :data:`sys.base_prefix` and :data:`sys.base_exec_prefix` respectively.
sv: När de har hittats finns ``prefix`` och ``exec_prefix`` tillgängliga på :data:`sys.base_prefix` respektive :data:`sys.base_exec_prefix`.

source: If :envvar:`PYTHONHOME` is not set, and a ``pyvenv.cfg`` file is found alongside the main executable, or in its parent directory, :data:`sys.prefix` and :data:`sys.exec_prefix` get set to the directory containing ``pyvenv.cfg``, otherwise they are set to the same value as :data:`sys.base_prefix` and :data:`sys.base_exec_prefix`, respectively. This is used by :ref:`sys-path-init-virtual-environments`.
sv: Om :envvar:`PYTHONHOME` inte är inställt och en fil med namnet ``pyvenv.cfg`` hittas bredvid den körbara huvudfilen eller i dess överordnade katalog, sätts :data:`sys.prefix` och :data:`sys.exec_prefix` till den katalog som innehåller ``pyvenv.cfg``, annars sätts de till samma värde som :data:`sys.base_prefix` respektive :data:`sys.base_exec_prefix`. Detta används av :ref:`sys-path-init-virtual-environments`.

source: Finally, the :mod:`site` module is processed and :file:`site-packages` directories are added to the module search path. A common way to customize the search path is to create :mod:`sitecustomize` or :mod:`usercustomize` modules as described in the :mod:`site` module documentation.
sv: Slutligen bearbetas modulen :mod:`site` och katalogerna :file:`site-packages` läggs till i modulens söksökväg. Ett vanligt sätt att anpassa sökvägen är att skapa modulerna :mod:`sitecustomize` eller :mod:`usercustomize` enligt beskrivningen i dokumentationen för modulen :mod:`site`.

source: Certain command line options may further affect path calculations. See :option:`-E`, :option:`-I`, :option:`-s` and :option:`-S` for further details.
sv: Vissa kommandoradsalternativ kan påverka sökvägsberäkningarna ytterligare. Se :option:`-E`, :option:`-I`, :option:`-s` och :option:`-S` för mer information.

source: :data:`sys.prefix` and :data:`sys.exec_prefix` are now set to the ``pyvenv.cfg`` directory during the path initialization. This was previously done by :mod:`site`, therefore affected by :option:`-S`.
sv: :data:`sys.prefix` och :data:`sys.exec_prefix` sätts nu till katalogen ``pyvenv.cfg`` under initieringen av sökvägen. Detta gjordes tidigare av :mod:`site`, och påverkas därför av :option:`-S`.

source: Virtual Environments
sv: Virtuella miljöer

source: Virtual environments place a ``pyvenv.cfg`` file in their prefix, which causes :data:`sys.prefix` and :data:`sys.exec_prefix` to point to them, instead of the base installation.
sv: Virtuella miljöer placerar filen ``pyvenv.cfg`` i sitt prefix, vilket gör att :data:`sys.prefix` och :data:`sys.exec_prefix` pekar på dem i stället för på basinstallationen.

source: The ``prefix`` and ``exec_prefix`` values of the base installation are available at :data:`sys.base_prefix` and :data:`sys.base_exec_prefix`.
sv: Värdena ``prefix`` och ``exec_prefix`` för basinstallationen finns tillgängliga i :data:`sys.base_prefix` och :data:`sys.base_exec_prefix`.

source: As well as being used as a marker to identify virtual environments, ``pyvenv.cfg`` may also be used to configure the :mod:`site` initialization. Please refer to :mod:`site`'s :ref:`virtual environments documentation <site-virtual-environments-configuration>`.
sv: Förutom att användas som en markör för att identifiera virtuella miljöer kan ``pyvenv.cfg`` också användas för att konfigurera initieringen av :mod:`site`. Se :mod:`site`:s :ref:`dokumentation om virtuella miljöer <site-virtual-environments-configuration>`.

source: :envvar:`PYTHONHOME` overrides the ``pyvenv.cfg`` detection.
sv: :envvar:`PYTHONHOME` åsidosätter identifieringen i ``pyvenv.cfg``.

source: There are other ways how "virtual environments" could be implemented, this documentation refers implementations based on the ``pyvenv.cfg`` mechanism, such as :mod:`venv`. Most virtual environment implementations follow the model set by :mod:`venv`, but there may be exotic implementations that diverge from it.
sv: Det finns andra sätt att implementera "virtuella miljöer", den här dokumentationen hänvisar till implementationer baserade på mekanismen ``pyvenv.cfg``, såsom :mod:`venv`. De flesta implementeringar av virtuella miljöer följer den modell som anges av :mod:`venv`, men det kan finnas exotiska implementeringar som avviker från den.

source: _pth files
sv: _pth-filer

source: To completely override :data:`sys.path` create a ``._pth`` file with the same name as the shared library or executable (``python._pth`` or ``python311._pth``). The shared library path is always known on Windows, however it may not be available on other platforms. In the ``._pth`` file specify one line for each path to add to :data:`sys.path`. The file based on the shared library name overrides the one based on the executable, which allows paths to be restricted for any program loading the runtime if desired.
sv: Om du vill åsidosätta :data:`sys.path` helt skapar du en ``._pth``-fil med samma namn som det delade biblioteket eller den körbara filen (``python._pth`` eller ``python311._pth``). Sökvägen till det delade biblioteket är alltid känd i Windows, men den kanske inte är tillgänglig på andra plattformar. I filen ``._pth`` anges en rad för varje sökväg som ska läggas till i :data:`sys.path`. Filen som baseras på namnet på det delade biblioteket åsidosätter den som baseras på den körbara filen, vilket gör att sökvägarna kan begränsas för alla program som laddar körtiden om så önskas.

source: When the file exists, all registry and environment variables are ignored, isolated mode is enabled, and :mod:`site` is not imported unless one line in the file specifies ``import site``. Blank paths and lines starting with ``#`` are ignored. Each path may be absolute or relative to the location of the file. Import statements other than to ``site`` are not permitted, and arbitrary code cannot be specified.
sv: När filen finns ignoreras alla register- och miljövariabler, isolerat läge aktiveras och :mod:`site` importeras inte om inte en rad i filen anger ``import site``. Tomma sökvägar och rader som börjar med ``#`` ignoreras. Varje sökväg kan vara absolut eller relativ till filens plats. Andra importmeddelanden än till ``site`` är inte tillåtna, och godtycklig kod kan inte anges.

source: Note that ``.pth`` files (without leading underscore) will be processed normally by the :mod:`site` module when ``import site`` has been specified.
sv: Observera att ``.pth``-filer (utan inledande understreck) kommer att behandlas normalt av modulen :mod:`site`` när ``import site`` har angetts.

source: Embedded Python
sv: Inbäddad Python

source: If Python is embedded within another application :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure can be used to initialize Python. The path specific details are described at :ref:`init-path-config`.
sv: Om Python är inbäddat i en annan applikation kan :c:func:`Py_InitializeFromConfig` och :c:type:`PyConfig`-strukturen användas för att initiera Python. De sökvägsspecifika detaljerna beskrivs i :ref:`init-path-config`.

source: :ref:`windows_finding_modules` for detailed Windows notes.
sv: :ref:`windows_finding_modules` för detaljerade Windows-kommentarer.

source: :ref:`using-on-unix` for Unix details.
sv: :ref:`using-on-unix` för detaljer om Unix.
