Repository: yeager/python-docs-sv
Catalog: library/tabnanny.po
Languages: sv

source: :mod:`!tabnanny` --- Detection of ambiguous indentation
sv: :mod:`!tabnanny` --- Upptäckt av tvetydig indragning

source: **Source code:** :source:`Lib/tabnanny.py`
sv: **Källkod:** :source:`Lib/tabnanny.py`

source: For the time being this module is intended to be called as a script. However it is possible to import it into an IDE and use the function :func:`check` described below.
sv: För närvarande är denna modul avsedd att anropas som ett skript. Det är dock möjligt att importera den till en IDE och använda funktionen :func:`check` som beskrivs nedan.

source: The API provided by this module is likely to change in future releases; such changes may not be backward compatible.
sv: Det API som tillhandahålls av denna modul kommer sannolikt att ändras i framtida utgåvor; sådana ändringar kanske inte är bakåtkompatibla.

source: If *file_or_dir* is a directory and not a symbolic link, then recursively descend the directory tree named by *file_or_dir*, checking all :file:`.py` files along the way. If *file_or_dir* is an ordinary Python source file, it is checked for whitespace related problems. The diagnostic messages are written to standard output using the :func:`print` function.
sv: Om *file_or_dir* är en katalog och inte en symbolisk länk, går den rekursivt ned i katalogträdet som namnges av *file_or_dir* och kontrollerar alla :file:`.py`-filer på vägen. Om *file_or_dir* är en vanlig Python-källfil kontrolleras den med avseende på problem med blanksteg. Diagnosmeddelandena skrivs till standardutdata med hjälp av funktionen :func:`print`.

source: Flag indicating whether to print verbose messages. This is incremented by the ``-v`` option if called as a script.
sv: Flagga som anger om verbose-meddelanden ska skrivas ut. Detta ökas med alternativet ``-v`` om det anropas som ett skript.

source: Flag indicating whether to print only the filenames of files containing whitespace related problems. This is set to true by the ``-q`` option if called as a script.
sv: Flagga som anger om endast filnamnen på filer som innehåller problem med blanksteg ska skrivas ut. Detta sätts till true av alternativet ``-q`` om det anropas som ett skript.

source: Raised by :func:`process_tokens` if detecting an ambiguous indent. Captured and handled in :func:`check`.
sv: Utlöses av :func:`process_tokens` om ett tvetydigt indrag upptäcks. Fångas upp och hanteras i :func:`check`.

source: This function is used by :func:`check` to process tokens generated by the :mod:`tokenize` module.
sv: Denna funktion används av :func:`check` för att bearbeta tokens som genererats av modulen :mod:`tokenize`.

source: Module :mod:`tokenize`
sv: Modul :mod:`tokenize`

source: Lexical scanner for Python source code.
sv: Lexikal scanner för Python-källkod.
