Repository: yeager/python-docs-sv
Catalog: library/test.po
Languages: sv

source: Skip tests if the :mod:`multiprocessing.synchronize` module is missing, if there is no available semaphore implementation, or if creating a lock raises an :exc:`OSError`.
sv: Hoppa över tester om modulen :mod:`multiprocessing.synchronize` saknas, om det inte finns någon tillgänglig semaforimplementering eller om skapandet av ett lås ger upphov till ett :exc:`OSError`.

source: Assert that type *tp* cannot be instantiated using *args* and *kwds*.
sv: Påstå att typen *tp* inte kan instansieras med hjälp av *args* och *kwds*.

source: This function returns a context manager that will change the global :func:`sys.set_int_max_str_digits` setting for the duration of the context to allow execution of test code that needs a different limit on the number of digits when converting between an integer and string.
sv: Denna funktion returnerar en kontexthanterare som ändrar den globala inställningen :func:`sys.set_int_max_str_digits` under kontextens varaktighet för att möjliggöra exekvering av testkod som behöver en annan gräns för antalet siffror vid konvertering mellan ett heltal och en sträng.

source: The :mod:`test.support` module defines the following classes:
sv: Modulen :mod:`test.support` definierar följande klasser:

source: A context manager used to try to prevent crash dialog popups on tests that are expected to crash a subprocess.
sv: En kontexthanterare som används för att försöka förhindra popup-fönster i kraschdialogen vid tester som förväntas krascha en underprocess.

source: On Windows, it disables Windows Error Reporting dialogs using `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.
sv: I Windows inaktiveras dialogrutorna för Windows Felrapportering med hjälp av `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.

source: On UNIX, :func:`resource.setrlimit` is used to set :const:`resource.RLIMIT_CORE`'s soft limit to 0 to prevent coredump file creation.
sv: På UNIX används :func:`resource.setrlimit` för att sätta :const:`resource.RLIMIT_CORE`:s mjuka gräns till 0 för att förhindra att coredump-filer skapas.

source: On both platforms, the old value is restored by :meth:`~object.__exit__`.
sv: På båda plattformarna återställs det gamla värdet av :meth:`~object.__exit__`.

source: Class to save and restore signal handlers registered by the Python signal handler.
sv: Klass för att spara och återställa signalhanterare som registrerats av Pythons signalhanterare.

source: Save the signal handlers to a dictionary mapping signal numbers to the current signal handler.
sv: Spara signalhanterarna till en ordbok som mappar signalnummer till den aktuella signalhanteraren.

source: Set the signal numbers from the :meth:`save` dictionary to the saved handler.
sv: Ställ in signalnumren från :meth:`save`-ordlistan till den sparade hanteraren.

source: Try to match a single dict with the supplied arguments.
sv: Försök att matcha en enda dict med de angivna argumenten.

source: Try to match a single stored value (*dv*) with a supplied value (*v*).
sv: Försök att matcha ett enskilt lagrat värde (*dv*) med ett medföljande värde (*v*).

source: :mod:`test.support.socket_helper` --- Utilities for socket tests
sv: :mod:`test.support.socket_helper` --- Hjälpmedel för socket-tester

source: The :mod:`test.support.socket_helper` module provides support for socket tests.
sv: Modulen :mod:`test.support.socket_helper` ger stöd för socket-tester.

source: Set to ``True`` if IPv6 is enabled on this host, ``False`` otherwise.
sv: Sätts till ``True`` om IPv6 är aktiverat på denna värd, annars ``False``.

source: Returns an unused port that should be suitable for binding. This is achieved by creating a temporary socket with the same family and type as the ``sock`` parameter (default is :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`), and binding it to the specified host address (defaults to ``0.0.0.0``) with the port set to 0, eliciting an unused ephemeral port from the OS. The temporary socket is then closed and deleted, and the ephemeral port is returned.
sv: Returnerar en oanvänd port som bör vara lämplig för bindning. Detta uppnås genom att skapa ett tillfälligt uttag med samma familj och typ som parametern ``sock`` (standard är :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`) och binda det till den angivna värdadressen (standard är ``0.0.0.0``) med porten inställd på 0, vilket framkallar en oanvänd efemär port från operativsystemet. Det tillfälliga uttaget stängs och raderas sedan och den tillfälliga porten returneras.

source: Either this method or :func:`bind_port` should be used for any tests where a server socket needs to be bound to a particular port for the duration of the test. Which one to use depends on whether the calling code is creating a Python socket, or if an unused port needs to be provided in a constructor or passed to an external program (i.e. the ``-accept`` argument to openssl's s_server mode). Always prefer :func:`bind_port` over :func:`find_unused_port` where possible. Using a hard coded port is discouraged since it can make multiple instances of the test impossible to run simultaneously, which is a problem for buildbots.
sv: Antingen denna metod eller :func:`bind_port` bör användas för alla tester där ett serveruttag måste bindas till en viss port under hela testet. Vilken som ska användas beror på om den anropande koden skapar ett Python-socket, eller om en oanvänd port måste tillhandahållas i en konstruktör eller skickas till ett externt program (t.ex. argumentet ``-accept`` till openssl:s s_server-läge). Föredra alltid :func:`bind_port` framför :func:`find_unused_port` när det är möjligt. Att använda en hårdkodad port avrådes eftersom det kan göra det omöjligt att köra flera instanser av testet samtidigt, vilket är ett problem för buildbots.

source: Bind the socket to a free port and return the port number. Relies on ephemeral ports in order to ensure we are using an unbound port. This is important as many tests may be running simultaneously, especially in a buildbot environment. This method raises an exception if the ``sock.family`` is :const:`~socket.AF_INET` and ``sock.type`` is :const:`~socket.SOCK_STREAM`, and the socket has :const:`~socket.SO_REUSEADDR` or :const:`~socket.SO_REUSEPORT` set on it. Tests should never set these socket options for TCP/IP sockets. The only case for setting these options is testing multicasting via multiple UDP sockets.
sv: Binder uttaget till en ledig port och returnerar portnumret. Förlitar sig på efemära portar för att säkerställa att vi använder en obunden port. Detta är viktigt eftersom många tester kan köras samtidigt, särskilt i en buildbot-miljö. Denna metod ger upphov till ett undantag om ``sock.family`` är :const:`~socket.AF_INET` och ``sock.type`` är :const:`~socket.SOCK_STREAM`, och uttaget har :const:`~socket.SO_REUSEADDR` eller :const:`~socket.SO_REUSEPORT` inställt på det. Tester bör aldrig ställa in dessa socket-alternativ för TCP/IP-sockets. Det enda fallet för att ställa in dessa alternativ är att testa multicasting via flera UDP-sockets.

source: Additionally, if the :const:`~socket.SO_EXCLUSIVEADDRUSE` socket option is available (i.e. on Windows), it will be set on the socket. This will prevent anyone else from binding to our host/port for the duration of the test.
sv: Om uttagsalternativet :const:`~socket.SO_EXCLUSIVEADDRUSE` är tillgängligt (t.ex. i Windows) kommer det dessutom att ställas in på uttaget. Detta kommer att förhindra att någon annan binder till vår värd/port under hela testet.

source: Bind a Unix socket, raising :exc:`unittest.SkipTest` if :exc:`PermissionError` is raised.
sv: Binder ett Unix-uttag och ger upphov till :exc:`unittest.SkipTest` om :exc:`PermissionError` ges upphov till.

source: A decorator for running tests that require a functional ``bind()`` for Unix sockets.
sv: En dekorator för att köra tester som kräver en funktionell ``bind()`` för Unix-sockets.

source: A context manager that raises :exc:`~test.support.ResourceDenied` when various issues with the internet connection manifest themselves as exceptions.
sv: En kontexthanterare som utlöser :exc:`~test.support.ResourceDenied` när olika problem med internetanslutningen manifesterar sig som undantag.

source: :mod:`test.support.script_helper` --- Utilities for the Python execution tests
sv: :mod:`test.support.script_helper` --- Hjälpmedel för Python-testkörning

source: The :mod:`test.support.script_helper` module provides support for Python's script execution tests.
sv: Modulen :mod:`test.support.script_helper` ger stöd för Pythons tester för exekvering av skript.

source: Return ``True`` if ``sys.executable interpreter`` requires environment variables in order to be able to run at all.
sv: Returnerar ``True`` om ```sys.executable interpreter`` kräver miljövariabler för att överhuvudtaget kunna köras.

source: This is designed to be used with ``@unittest.skipIf()`` to annotate tests that need to use an ``assert_python*()`` function to launch an isolated mode (``-I``) or no environment mode (``-E``) sub-interpreter process.
sv: Detta är utformat för att användas med ``@unittest.skipIf()`` för att kommentera tester som behöver använda en ``assert_python*()``-funktion för att starta en subinterpreterprocess i isolerat läge (``-I``) eller inget miljöläge (``-E``).

source: A normal build & test does not run into this situation but it can happen when trying to run the standard library test suite from an interpreter that doesn't have an obvious home with Python's current home finding logic.
sv: En normal build & test stöter inte på den här situationen, men det kan hända när man försöker köra standardbibliotekets testsvit från en tolk som inte har en uppenbar hemvist med Pythons nuvarande logik för att hitta hemvist.

source: Setting :envvar:`PYTHONHOME` is one way to get most of the testsuite to run in that situation. :envvar:`PYTHONPATH` or :envvar:`PYTHONUSERSITE` are other common environment variables that might impact whether or not the interpreter can start.
sv: Att ställa in :envvar:`PYTHONHOME` är ett sätt att få det mesta av testsuiten att köras i den situationen. :envvar:`PYTHONPATH` eller :envvar:`PYTHONUSERSITE` är andra vanliga miljövariabler som kan påverka om tolken kan starta eller inte.

source: Set up the environment based on *env_vars* for running the interpreter in a subprocess. The values can include ``__isolated``, ``__cleanenv``, ``__cwd``, and ``TERM``.
sv: Ställ in miljön baserat på *env_vars* för att köra tolken i en underprocess. Värdena kan inkludera ``__isolated``, ``__cleanenv``, ``__cwd`` och ``TERM``.

source: The function no longer strips whitespaces from *stderr*.
sv: Funktionen tar inte längre bort blanksteg från *stderr*.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* succeeds (``rc == 0``) and return a ``(return code, stdout, stderr)`` tuple.
sv: Försäkra att körningen av tolken med *args* och de valfria miljövariablerna *env_vars* lyckas (``rc == 0``) och returnera en ``(returkod, stdout, stderr)``-tupel.

source: If the *__cleanenv* keyword-only parameter is set, *env_vars* is used as a fresh environment.
sv: Om parametern *__cleanenv* (endast nyckelord) har angetts används *env_vars* som en ny miljö.

source: Python is started in isolated mode (command line option ``-I``), except if the *__isolated* keyword-only parameter is set to ``False``.
sv: Python startas i isolerat läge (kommandoradsalternativet ``-I``), utom om parametern *__isolated* keyword-only är inställd på ``False``.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* fails (``rc != 0``) and return a ``(return code, stdout, stderr)`` tuple.
sv: Försäkra att körning av tolken med *args* och valfria miljövariabler *env_vars* misslyckas (``rc != 0``) och returnera en ``(returkod, stdout, stderr)``-tupel.

source: See :func:`assert_python_ok` for more options.
sv: Se :func:`assert_python_ok` för fler alternativ.

source: Run a Python subprocess with the given arguments.
sv: Kör en Python-subprocess med de angivna argumenten.

source: *kw* is extra keyword args to pass to :func:`subprocess.Popen`. Returns a :class:`subprocess.Popen` object.
sv: *kw* är extra nyckelord att skicka till :func:`subprocess.Popen`. Returnerar ett :class:`subprocess.Popen`-objekt.

source: Run the given :class:`subprocess.Popen` process until completion and return stdout.
sv: Kör den angivna :class:`subprocess.Popen`-processen tills den är klar och returnera stdout.

source: Create script containing *source* in path *script_dir* and *script_basename*. If *omit_suffix* is ``False``, append ``.py`` to the name. Return the full script path.
sv: Skapa skript som innehåller *källa* i sökvägen *script_dir* och *script_basnamn*. Om *omit_suffix* är ``False``, lägg till ``.py`` till namnet. Returnerar den fullständiga sökvägen till skriptet.

source: Create zip file at *zip_dir* and *zip_basename* with extension ``zip`` which contains the files in *script_name*. *name_in_zip* is the archive name. Return a tuple containing ``(full path, full path of archive name)``.
sv: Skapa en zip-fil på *zip_dir* och *zip_basnamn* med tillägget ``zip`` som innehåller filerna i *script_name*. *name_in_zip* är arkivnamnet. Returnera en tupel som innehåller ``(fullständig sökväg, fullständig sökväg till arkivnamnet)``.

source: Create a directory named *pkg_dir* containing an ``__init__`` file with *init_source* as its contents.
sv: Skapa en katalog med namnet *pkg_dir* som innehåller en ``__init__``-fil med *init_source* som innehåll.

source: Create a zip package directory with a path of *zip_dir* and *zip_basename* containing an empty ``__init__`` file and a file *script_basename* containing the *source*. If *compiled* is ``True``, both source files will be compiled and added to the zip package. Return a tuple of the full zip path and the archive name for the zip file.
sv: Skapa en zip-paketkatalog med sökvägen *zip_dir* och *zip_basnamn* som innehåller en tom ``__init__``-fil och en fil *script_basnamn* som innehåller *källan*. Om *compiled* är ``True`` kommer båda källfilerna att kompileras och läggas till i zip-paketet. Returnerar en tupel av den fullständiga zip-sökvägen och arkivnamnet för zip-filen.

source: :mod:`test.support.bytecode_helper` --- Support tools for testing correct bytecode generation
sv: :mod:`test.support.bytecode_helper` --- Stödverktyg för att testa korrekt generering av bytekoder

source: The :mod:`test.support.bytecode_helper` module provides support for testing and inspecting bytecode generation.
sv: Modulen :mod:`test.support.bytecode_helper` ger stöd för att testa och inspektera generering av bytekoder.

source: The module defines the following class:
sv: Modulen definierar följande klass:

source: This class has custom assertion methods for inspecting bytecode.
sv: Denna klass har anpassade assertion-metoder för att inspektera bytecode.

source: Return the disassembly of *co* as string.
sv: Returnera demonteringen av *co* som en sträng.

source: Return instr if *opname* is found, otherwise throws :exc:`AssertionError`.
sv: Returnerar instr om *opname* hittas, annars kastar :exc:`AssertionError`.

source: Throws :exc:`AssertionError` if *opname* is found.
sv: Kastar :exc:`AssertionError` om *opname* hittas.

source: :mod:`test.support.threading_helper` --- Utilities for threading tests
sv: :mod:`test.support.threading_helper` --- Hjälpmedel för trådning av tester

source: The :mod:`test.support.threading_helper` module provides support for threading tests.
sv: Modulen :mod:`test.support.threading_helper` ger stöd för trådning av tester.

source: Join a *thread* within *timeout*. Raise an :exc:`AssertionError` if thread is still alive after *timeout* seconds.
sv: Gå med i en *tråd* inom *timeout*. Skapa ett :exc:`AssertionError` om tråden fortfarande är vid liv efter *timeout* sekunder.

source: Decorator to ensure the threads are cleaned up even if the test fails.
sv: Dekorator för att säkerställa att trådarna rensas upp även om testet misslyckas.

source: Context manager to start *threads*, which is a sequence of threads. *unlock* is a function called after the threads are started, even if an exception was raised; an example would be :meth:`threading.Event.set`. ``start_threads`` will attempt to join the started threads upon exit.
sv: Kontexthanterare för att starta *threads*, vilket är en sekvens av trådar. *unlock* är en funktion som anropas efter att trådarna har startats, även om ett undantag har uppstått; ett exempel skulle vara :meth:`threading.Event.set`. ``start_threads`` kommer att försöka ansluta de startade trådarna vid avslut.

source: Cleanup up threads not specified in *original_values*. Designed to emit a warning if a test leaves running threads in the background.
sv: Rensa upp trådar som inte specificerats i *original_values*. Utformad för att avge en varning om ett test lämnar pågående trådar i bakgrunden.

source: Return current thread count and copy of dangling threads.
sv: Returnerar aktuellt trådantal och kopia av hängande trådar.

source: Context manager to wait until all threads created in the ``with`` statement exit.
sv: Kontexthanterare som väntar tills alla trådar som skapats i ``with``-satsen avslutas.

source: Context manager catching :class:`threading.Thread` exception using :func:`threading.excepthook`.
sv: Kontexthanterare som fångar upp :class:`threading.Thread` undantag med :func:`threading.excepthook`.

source: Attributes set when an exception is caught:
sv: Attribut som anges när ett undantag fångas upp:

source: See :func:`threading.excepthook` documentation.
sv: Se :func:`threading.excepthook` dokumentation.

source: These attributes are deleted at the context manager exit.
sv: Dessa attribut raderas när kontexthanteraren avslutas.

source: with threading_helper.catch_threading_exception() as cm: # code spawning a thread which raises an exception ... # check the thread exception, use cm attributes: # exc_type, exc_value, exc_traceback, thread ... # exc_type, exc_value, exc_traceback, thread attributes of cm no longer # exists at this point # (to avoid reference cycles)
sv: med threading_helper.catch_threading_exception() som cm: # kod som skapar en tråd som ger upphov till ett undantag ... # kontrollera trådundantaget, använd cm-attribut: # exc_type, exc_value, exc_traceback, thread ... # exc_type, exc_value, exc_traceback, thread attribut för cm finns inte längre # existerar vid denna tidpunkt # (för att undvika referenscykler)

source: Run the worker function concurrently in multiple threads. Re-raises an exception if any thread raises one, after all threads have finished.
sv: Kör arbetsfunktionen samtidigt i flera trådar. Löser ut ett undantag igen om någon tråd löser ut ett, efter att alla trådar har avslutats.

source: :mod:`test.support.os_helper` --- Utilities for os tests
sv: :mod:`test.support.os_helper` --- Hjälpmedel för os-test

source: The :mod:`test.support.os_helper` module provides support for os tests.
sv: Modulen :mod:`test.support.os_helper` ger stöd för os-tester.

source: A non-ASCII character encodable by :func:`os.fsencode`.
sv: Ett icke-ASCII-tecken som kan kodas med :func:`os.fsencode`.

source: Set to :func:`os.getcwd`.
sv: Ställs in på :func:`os.getcwd`.

source: Set to a name that is safe to use as the name of a temporary file. Any temporary file that is created should be closed and unlinked (removed).
sv: Ange ett namn som är säkert att använda som namn på en tillfällig fil. Alla temporära filer som skapas ska stängas och avlänkas (tas bort).

source: Set to a filename containing the :data:`FS_NONASCII` character, if it exists. This guarantees that if the filename exists, it can be encoded and decoded with the default filesystem encoding. This allows tests that require a non-ASCII filename to be easily skipped on platforms where they can't work.
sv: Sätts till ett filnamn som innehåller tecknet :data:`FS_NONASCII`, om det finns. Detta garanterar att om filnamnet existerar kan det kodas och avkodas med filsystemets standardkodning. Detta gör att tester som kräver ett icke-ASCII-filnamn enkelt kan hoppas över på plattformar där de inte kan fungera.

source: Set to a filename (str type) that should not be able to be encoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
sv: Sätts till ett filnamn (str-typ) som inte bör kunna kodas av filsystemets kodning i strikt läge. Det kan vara ``None`` om det inte är möjligt att generera ett sådant filnamn.

source: Set to a filename (bytes type) that should not be able to be decoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
sv: Sätts till ett filnamn (bytes-typ) som inte bör kunna avkodas av filsystemets kodning i strikt läge. Det kan vara ``None`` om det inte är möjligt att generera ett sådant filnamn.

source: Set to a non-ASCII name for a temporary file.
sv: Ange ett icke-ASCII-namn för en temporär fil.

source: Class used to temporarily set or unset environment variables. Instances can be used as a context manager and have a complete dictionary interface for querying/modifying the underlying ``os.environ``. After exit from the context manager all changes to environment variables done through this instance will be rolled back.
sv: Klass som används för att temporärt ställa in eller ta bort miljövariabler. Instanser kan användas som en kontexthanterare och har ett komplett dictionary-gränssnitt för att fråga/ändra den underliggande ``os.environ``. Efter avslut från kontexthanteraren kommer alla ändringar av miljövariabler som gjorts genom denna instans att återställas.

source: Added dictionary interface.
sv: Lagt till gränssnitt för ordbok.

source: Simple :term:`path-like object`. It implements the :meth:`~os.PathLike.__fspath__` method which just returns the *path* argument. If *path* is an exception, it will be raised in :meth:`!__fspath__`.
sv: Enkelt :term:`path-liknande objekt`. Det implementerar metoden :meth:`~os.PathLike.__fspath__` som bara returnerar argumentet *path*. Om *path* är ett undantag kommer det att tas upp i :meth:`!__fspath__`.

source: Temporarily set the environment variable ``envvar`` to the value of ``value``.
sv: Tillfälligt ställa in miljövariabeln ``envvar`` till värdet ``value``.

source: Temporarily unset one or more environment variables.
sv: Tillfälligt avaktivera en eller flera miljövariabler.

source: More than one environment variable can be unset.
sv: Mer än en miljövariabel kan avaktiveras.

source: Return ``True`` if the OS supports symbolic links, ``False`` otherwise.
sv: Returnerar ``True`` om operativsystemet stöder symboliska länkar, annars ``False``.

source: Return ``True`` if the OS supports xattr, ``False`` otherwise.
sv: Returnerar ``True`` om operativsystemet stöder xattr, ``False`` annars.

source: A context manager that temporarily changes the current working directory to *path* and yields the directory.
sv: En kontexthanterare som temporärt ändrar den aktuella arbetskatalogen till *path* och lämnar ut katalogen.

source: If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, it issues only a warning and keeps the current working directory the same.
sv: Om *quiet* är ``False``, gör kontexthanteraren ett undantag vid fel. I annat fall utfärdas endast en varning och den aktuella arbetskatalogen förblir densamma.

source: Create an empty file with *filename*. If it already exists, truncate it.
sv: Skapa en tom fil med *filnamn*. Om den redan finns, avkorta den.

source: Count the number of open file descriptors.
sv: Räkna antalet öppna filbeskrivare.
