Repository: yeager/python-docs-sv
Catalog: library/test.po
Languages: sv

source: Run the loop body until ``break`` stops the loop. Sleep at each loop iteration, but not at the first iteration. The sleep delay is doubled at each iteration (up to *max_delay* seconds).
sv: Kör slingan tills ``break`` stoppar slingan. Sömn vid varje loop-iteration, men inte vid den första iterationen. Sömnfördröjningen fördubblas vid varje iteration (upp till *max_delay* sekunder).

source: See :func:`busy_retry` documentation for the parameters usage.
sv: Se :func:`busy_retry` dokumentation för parametrarnas användning.

source: Example raising an exception after SHORT_TIMEOUT seconds::
sv: Exempel på undantag efter SHORT_TIMEOUT sekunder::

source: Return ``True`` if *resource* is enabled and available. The list of available resources is only set when :mod:`test.regrtest` is executing the tests.
sv: Returnerar ``True`` om *resource* är aktiverad och tillgänglig. Listan över tillgängliga resurser anges endast när :mod:`test.regrtest` kör testerna.

source: Return ``True`` if Python was not built with ``-O0`` or ``-Og``.
sv: Returnerar ``True`` om Python inte byggdes med ``-O0`` eller ``-Og``.

source: Return :const:`_testcapi.WITH_PYMALLOC`.
sv: Returnerar :const:`_testcapi.WITH_PYMALLOC`.

source: Raise :exc:`ResourceDenied` if *resource* is not available. *msg* is the argument to :exc:`ResourceDenied` if it is raised. Always returns ``True`` if called by a function whose ``__name__`` is ``'__main__'``. Used when tests are executed by :mod:`test.regrtest`.
sv: Utlös :exc:`ResourceDenied` om *resurs* inte är tillgänglig. *msg* är argumentet till :exc:`ResourceDenied` om det aktiveras. Returnerar alltid ``True`` om den anropas av en funktion vars ``__name__`` är ``'__main__'``. Används när tester exekveras av :mod:`test.regrtest`.

source: Return a repr of *dict* with keys sorted.
sv: Returnerar en repr av *dict* med nycklar sorterade.

source: Return the path to the file named *filename*. If no match is found *filename* is returned. This does not equal a failure since it could be the path to the file.
sv: Returnerar sökvägen till filen med namnet *filnamn*. Om ingen matchning hittas returneras *filnamn*. Detta är inte detsamma som ett misslyckande eftersom det kan vara sökvägen till filen.

source: Setting *subdir* indicates a relative path to use to find the file rather than looking directly in the path directories.
sv: Om du anger *subdir* anges en relativ sökväg som ska användas för att hitta filen i stället för att leta direkt i sökvägskatalogerna.

source: Get size of a page in bytes.
sv: Hämta storleken på en sida i byte.

source: Set the :func:`sys.setswitchinterval` to the given *interval*. Defines a minimum interval for Android systems to prevent the system from hanging.
sv: Ställ in :func:`sys.setswitchinterval` till det angivna *intervallet*. Definierar ett minimiintervall för Android-system för att förhindra att systemet hänger sig.

source: Use this check to guard CPython's implementation-specific tests or to run them only on the implementations guarded by the arguments. This function returns ``True`` or ``False`` depending on the host platform. Example usage::
sv: Använd denna kontroll för att skydda CPythons implementationsspecifika tester eller för att endast köra dem på de implementationer som skyddas av argumenten. Denna funktion returnerar ``True`` eller ``False`` beroende på värdplattformen. Exempel på användning::

source: Set the values for :data:`max_memuse` and :data:`real_max_memuse` for big memory tests.
sv: Ställ in värdena för :data:`max_memuse` och :data:`real_max_memuse` för stora minnestester.

source: Store the value from *stdout*. It is meant to hold the stdout at the time the regrtest began.
sv: Lagra värdet från *stdout*. Det är tänkt att hålla stdout vid den tidpunkt då regrtestet började.

source: Return the original stdout set by :func:`record_original_stdout` or ``sys.stdout`` if it's not set.
sv: Returnerar den ursprungliga stdout som ställdes in av :func:`record_original_stdout` eller ``sys.stdout`` om den inte är inställd.

source: Return a list of command line arguments reproducing the current settings in ``sys.flags`` and ``sys.warnoptions``.
sv: Returnerar en lista med kommandoradsargument som återger de aktuella inställningarna i ``sys.flags`` och ``sys.warnoptions``.

source: Return a list of command line arguments reproducing the current optimization settings in ``sys.flags``.
sv: Returnerar en lista med kommandoradsargument som återger de aktuella optimeringsinställningarna i ``sys.flags``.

source: A context managers that temporarily replaces the named stream with :class:`io.StringIO` object.
sv: En kontexthanterare som tillfälligt ersätter den angivna strömmen med :class:`io.StringIO`-objekt.

source: Example use with output streams::
sv: Exempel på användning med utdataströmmar::

source: Example use with input stream::
sv: Exempel på användning med inmatningsström::

source: A context manager that temporary disables :mod:`faulthandler`.
sv: En kontexthanterare som tillfälligt inaktiverar :mod:`faulthandler`.

source: Force as many objects as possible to be collected. This is needed because timely deallocation is not guaranteed by the garbage collector. This means that ``__del__`` methods may be called later than expected and weakrefs may remain alive for longer than expected.
sv: Tvinga så många objekt som möjligt att samlas in. Detta behövs eftersom skräpsamlaren inte kan garantera att deallokering sker i rätt tid. Detta innebär att ``__del__``-metoder kan anropas senare än förväntat och att weakrefs kan leva kvar längre än förväntat.

source: A context manager that disables the garbage collector on entry. On exit, the garbage collector is restored to its prior state.
sv: En kontexthanterare som inaktiverar skräpsamlaren vid inmatning. Vid avslut återställs skräpsamlaren till sitt tidigare tillstånd.

source: Context manager to swap out an attribute with a new object.
sv: Kontexthanterare för att byta ut ett attribut mot ett nytt objekt.

source: Usage::
sv: Användning::

source: This will set ``obj.attr`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``attr`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
sv: Detta kommer att sätta ``obj.attr`` till 5 under hela ``with``-blocket och återställa det gamla värdet i slutet av blocket. Om ``attr`` inte finns på ``obj`` kommer den att skapas och sedan tas bort i slutet av blocket.

source: The old value (or ``None`` if it doesn't exist) will be assigned to the target of the "as" clause, if there is one.
sv: Det gamla värdet (eller ``None`` om det inte finns) kommer att tilldelas målet för "as"-klausulen, om det finns ett sådant.

source: Context manager to swap out an item with a new object.
sv: Context manager för att byta ut ett objekt mot ett nytt.

source: This will set ``obj["item"]`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``item`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
sv: Detta kommer att sätta ``obj["item"]`` till 5 under hela ``with``-blocket, och återställa det gamla värdet i slutet av blocket. Om ``item`` inte finns på ``obj``, kommer det att skapas och sedan raderas i slutet av blocket.

source: Call the ``flush()`` method on :data:`sys.stdout` and then on :data:`sys.stderr`. It can be used to make sure that the logs order is consistent before writing into stderr.
sv: Anropa metoden ``flush()`` på :data:`sys.stdout` och sedan på :data:`sys.stderr`. Den kan användas för att se till att loggarnas ordning är konsekvent innan de skrivs till stderr.

source: Print a warning into :data:`sys.__stderr__`. Format the message as: ``f"Warning -- {msg}"``. If *msg* is made of multiple lines, add ``"Warning -- "`` prefix to each line.
sv: Skriv ut en varning i :data:`sys.__stderr__`. Formatera meddelandet som: ``f"Varning -- {msg}"``. Om *msg* består av flera rader, lägg till prefixet ``"Warning --"`` på varje rad.

source: Wait until process *pid* completes and check that the process exit code is *exitcode*.
sv: Vänta tills process *pid* har avslutats och kontrollera att processens exitkod är *exitcode*.

source: Raise an :exc:`AssertionError` if the process exit code is not equal to *exitcode*.
sv: Utlöser ett :exc:`AssertionError` om processens utgångskod inte är lika med *exitcode*.

source: If the process runs longer than *timeout* seconds (:data:`SHORT_TIMEOUT` by default), kill the process and raise an :exc:`AssertionError`. The timeout feature is not available on Windows.
sv: Om processen pågår längre än *timeout* sekunder (:data:`SHORT_TIMEOUT` som standard), dödas processen och ett :exc:`AssertionError` visas. Timeout-funktionen är inte tillgänglig i Windows.

source: Return the size of the :c:type:`PyObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
sv: Returnerar storleken på :c:type:`PyObject` vars strukturmedlemmar definieras av *fmt*. Det returnerade värdet inkluderar storleken på Python-objektets rubrik och justering.

source: Return the size of the :c:type:`PyVarObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
sv: Returnerar storleken på :c:type:`PyVarObject` vars strukturmedlemmar definieras av *fmt*. Det returnerade värdet inkluderar storleken på Python-objektets rubrik och justering.

source: For testcase *test*, assert that the ``sys.getsizeof`` for *o* plus the GC header size equals *size*.
sv: För testfall *test*, hävda att ``sys.getsizeof`` för *o* plus GC-huvudstorleken är lika med *size*.

source: A decorator to conditionally mark tests with :func:`unittest.expectedFailure`. Any use of this decorator should have an associated comment identifying the relevant tracker issue.
sv: En dekorator för att villkorligt markera tester med :func:`unittest.expectedFailure`. Varje användning av denna dekorator bör ha en associerad kommentar som identifierar den relevanta spårningsfrågan.

source: A decorator that skips the decorated test on TLS certification validation failures.
sv: En dekorator som hoppar över det dekorerade testet vid fel i valideringen av TLS-certifieringen.

source: A decorator for running a function in a different locale, correctly resetting it after it has finished. *catstr* is the locale category as a string (for example ``"LC_ALL"``). The *locales* passed will be tried sequentially, and the first valid locale will be used.
sv: En dekorator för att köra en funktion i en annan locale och återställa den korrekt efter att den är klar. *catstr* är lokalkategorin som en sträng (t.ex. ``"LC_ALL"``). De *locales* som skickas kommer att prövas sekventiellt, och den första giltiga locale kommer att användas.

source: A decorator for running a function in a specific timezone, correctly resetting it after it has finished.
sv: En dekorator för att köra en funktion i en specifik tidszon och återställa den korrekt efter att den har avslutats.

source: Decorator for the minimum version when running test on FreeBSD. If the FreeBSD version is less than the minimum, the test is skipped.
sv: Dekorator för minimiversionen när test körs på FreeBSD. Om FreeBSD-versionen är mindre än minimiversionen hoppas testet över.

source: Decorator for the minimum version when running test on Linux. If the Linux version is less than the minimum, the test is skipped.
sv: Dekorator för minimiversionen när test körs på Linux. Om Linux-versionen är mindre än minimiversionen hoppas testet över.

source: Decorator for the minimum version when running test on macOS. If the macOS version is less than the minimum, the test is skipped.
sv: Dekorator för minimiversionen när du kör test på macOS. Om macOS-versionen är mindre än minimiversionen hoppas testet över.

source: Decorator for skipping tests on the free-threaded build. If the :term:`GIL` is disabled, the test is skipped.
sv: Dekorator för att hoppa över tester på den fri-trådade byggnaden. Om :term:`GIL` är avaktiverad, hoppas testet över.

source: Decorator for skipping tests on non-IEEE 754 platforms.
sv: Dekorator för att hoppa över tester på plattformar som inte är IEEE 754.

source: Decorator for skipping tests if :mod:`zlib` doesn't exist.
sv: Dekorator för att hoppa över tester om :mod:`zlib` inte finns.

source: Decorator for skipping tests if :mod:`gzip` doesn't exist.
sv: Dekorator för att hoppa över tester om :mod:`gzip` inte finns.

source: Decorator for skipping tests if :mod:`bz2` doesn't exist.
sv: Dekorator för att hoppa över tester om :mod:`bz2` inte finns.

source: Decorator for skipping tests if :mod:`lzma` doesn't exist.
sv: Dekorator för att hoppa över tester om :mod:`lzma` inte finns.

source: Decorator for skipping tests if *resource* is not available.
sv: Dekorator för att hoppa över tester om *resurs* inte är tillgänglig.

source: Decorator for only running the test if :data:`HAVE_DOCSTRINGS`.
sv: Dekorator för att bara köra testet om :data:`HAVE_DOCSTRINGS`.

source: Decorator for only running the test if :ref:`Limited C API <limited-c-api>` is available.
sv: Dekorator för att bara köra testet om :ref:`Limited C API <limited-c-api>` är tillgängligt.

source: Decorator for tests only applicable to CPython.
sv: Dekorator för tester som endast är tillämpliga på CPython.

source: Decorator for invoking :func:`check_impl_detail` on *guards*. If that returns ``False``, then uses *msg* as the reason for skipping the test.
sv: Dekorator för att anropa :func:`check_impl_detail` på *guards*. Om det returnerar ``False``, så används *msg* som anledning till att hoppa över testet.

source: Decorator for marking tests as thread-unsafe. This test always runs in one thread even when invoked with ``--parallel-threads``.
sv: Dekorator för att markera tester som tråd-osäkra. Detta test körs alltid i en tråd även när det anropas med ``--parallel-threads``.

source: Decorator to temporarily turn off tracing for the duration of the test.
sv: Dekoratör för att tillfälligt stänga av spårning under testets gång.

source: Decorator for tests which involve reference counting. The decorator does not run the test if it is not run by CPython. Any trace function is unset for the duration of the test to prevent unexpected refcounts caused by the trace function.
sv: Dekorator för tester som involverar referensräkning. Dekoratorn kör inte testet om det inte körs av CPython. Eventuella spårningsfunktioner avaktiveras under testets gång för att förhindra oväntade referensräkningar som orsakas av spårningsfunktionen.

source: Decorator for bigmem tests.
sv: Dekorator för bigmem-tester.

source: *size* is a requested size for the test (in arbitrary, test-interpreted units.) *memuse* is the number of bytes per unit for the test, or a good estimate of it. For example, a test that needs two byte buffers, of 4 GiB each, could be decorated with ``@bigmemtest(size=_4G, memuse=2)``.
sv: *size* är en begärd storlek för testet (i godtyckliga, testtolkade enheter.) *memuse* är antalet byte per enhet för testet, eller en bra uppskattning av det. Till exempel kan ett test som behöver två bytebuffertar på 4 GiB vardera dekoreras med ``@bigmemtest(size=_4G, memuse=2)``.

source: The *size* argument is normally passed to the decorated test method as an extra argument. If *dry_run* is ``True``, the value passed to the test method may be less than the requested value. If *dry_run* is ``False``, it means the test doesn't support dummy runs when ``-M`` is not specified.
sv: Argumentet *size* skickas normalt till den dekorerade testmetoden som ett extra argument. Om *dry_run* är ``True`` kan det värde som skickas till testmetoden vara mindre än det begärda värdet. Om *dry_run* är ``False`` betyder det att testet inte stöder dummykörningar när ``-M`` inte har angetts.

source: Decorator for tests that fill the address space.
sv: Dekorator för tester som fyller adressrymden.

source: Return ``False`` if there is no evidence the interpreter was compiled with ``musl``, otherwise return a version triple, either ``(0, 0, 0)`` if the version is unknown, or the actual version if it is known. Intended for use in ``skip`` decorators. ``emscripten`` and ``wasi`` are assumed to be compiled with ``musl``; otherwise ``platform.libc_ver`` is checked.
sv: Returnerar ``False`` om det inte finns några bevis för att tolken kompilerades med ``musl``, annars returneras en versionstrippel, antingen ``(0, 0, 0)`` om versionen är okänd, eller den faktiska versionen om den är känd. Avsedd för användning i ``skip`` dekoratorer. ``emscripten`` och ``wasi`` antas vara kompilerade med ``musl``; annars kontrolleras ``platform.libc_ver``.

source: Test for syntax errors in *statement* by attempting to compile *statement*. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the exception. If *offset* is not ``None``, compares to the offset of the exception.
sv: Testa för syntaxfel i *statement* genom att försöka kompilera *statement*. *testcase* är :mod:`unittest`-instansen för testet. *errtext* är det reguljära uttryck som ska matcha strängrepresentationen av det uppkomna :exc:`SyntaxError`. Om *lineno* inte är ``None``, jämförs med raden för undantaget. Om *offset* inte är ``None``, jämförs med undantagets offset.

source: Open *url*. If open fails, raises :exc:`TestFailed`.
sv: Öppna *url*. Om öppningen misslyckas, utlöses :exc:`TestFailed`.

source: Use this at the end of ``test_main`` whenever sub-processes are started. This will help ensure that no extra children (zombies) stick around to hog resources and create problems when looking for refleaks.
sv: Använd detta i slutet av ``test_main`` närhelst underprocesser startas. Detta hjälper till att säkerställa att inga extra barn (zombies) stannar kvar för att ta resurser och skapa problem när man letar efter refleaks.

source: Get an attribute, raising :exc:`unittest.SkipTest` if :exc:`AttributeError` is raised.
sv: Hämtar ett attribut och ger upphov till :exc:`unittest.SkipTest` om :exc:`AttributeError` ges upphov till.

source: Context manager catching unraisable exception using :func:`sys.unraisablehook`.
sv: Kontexthanteraren fångar upp ett undantag som inte kan bedömas med hjälp av :func:`sys.unraisablehook`.

source: Storing the exception value (``cm.unraisable.exc_value``) creates a reference cycle. The reference cycle is broken explicitly when the context manager exits.
sv: Genom att lagra undantagsvärdet (``cm.unraisable.exc_value``) skapas en referenscykel. Referenscykeln bryts explicit när kontexthanteraren avslutas.

source: Storing the object (``cm.unraisable.object``) can resurrect it if it is set to an object which is being finalized. Exiting the context manager clears the stored object.
sv: Om du lagrar objektet (``cm.unraisable.object``) kan det återuppstå om det är inställt på ett objekt som håller på att slutföras. Om du avslutar kontexthanteraren rensas det lagrade objektet.

source: Generic implementation of the :mod:`unittest` ``load_tests`` protocol for use in test packages. *pkg_dir* is the root directory of the package; *loader*, *standard_tests*, and *pattern* are the arguments expected by ``load_tests``. In simple cases, the test package's ``__init__.py`` can be the following::
sv: Generisk implementation av protokollet :mod:`unittest` ``load_tests`` för användning i testpaket. *pkg_dir* är rotkatalogen för paketet; *loader*, *standard_tests* och *pattern* är de argument som förväntas av ``load_tests``. I enkla fall kan testpaketets ``__init__.py`` se ut på följande sätt::

source: Returns the set of attributes, functions or methods of *ref_api* not found on *other_api*, except for a defined list of items to be ignored in this check specified in *ignore*.
sv: Returnerar den uppsättning attribut, funktioner eller metoder i *ref_api* som inte finns i *other_api*, med undantag för en definierad lista över objekt som ska ignoreras vid denna kontroll och som anges i *ignore*.

source: By default this skips private attributes beginning with '_' but includes all magic methods, i.e. those starting and ending in '__'.
sv: Som standard utelämnas privata attribut som börjar med "_", men alla magiska metoder inkluderas, dvs. de som börjar och slutar med "__".

source: Override *object_to_patch.attr_name* with *new_value*. Also add cleanup procedure to *test_instance* to restore *object_to_patch* for *attr_name*. The *attr_name* should be a valid attribute for *object_to_patch*.
sv: Åsidosätt *object_to_patch.attr_name* med *new_value*. Lägg också till en rensningsprocedur till *test_instance* för att återställa *object_to_patch* för *attr_name*. *attr_name* ska vara ett giltigt attribut för *object_to_patch*.

source: Run *code* in subinterpreter. Raise :exc:`unittest.SkipTest` if :mod:`tracemalloc` is enabled.
sv: Kör *kod* i undertolk. Utlös :exc:`unittest.SkipTest` om :mod:`tracemalloc` är aktiverat.

source: Assert instances of *cls* are deallocated after iterating.
sv: Försäkra att instanser av *cls* avallokeras efter iterering.

source: Check for the existence of the compiler executables whose names are listed in *cmd_names* or all the compiler executables when *cmd_names* is empty and return the first missing executable or ``None`` when none is found missing.
sv: Kontrollera om det finns körbara kompilatorer vars namn anges i *cmd_names* eller alla körbara kompilatorer om *cmd_names* är tom och returnera den första körbara filen som saknas eller ``None`` om ingen saknas.

source: Assert that the ``__all__`` variable of *module* contains all public names.
sv: Försäkra att variabeln ``__all__`` i *modul* innehåller alla offentliga namn.

source: The module's public names (its API) are detected automatically based on whether they match the public name convention and were defined in *module*.
sv: Modulens publika namn (dess API) identifieras automatiskt baserat på om de överensstämmer med konventionen för publika namn och om de definierades i *module*.

source: The *name_of_module* argument can specify (as a string or tuple thereof) what module(s) an API could be defined in order to be detected as a public API. One case for this is when *module* imports part of its public API from other modules, possibly a C backend (like ``csv`` and its ``_csv``).
sv: Argumentet *name_of_module* kan ange (som en sträng eller en tupel därav) vilken eller vilka moduler ett API kan definieras i för att upptäckas som ett offentligt API. Ett fall för detta är när *modul* importerar en del av sitt offentliga API från andra moduler, eventuellt en C-backend (som ``csv`` och dess ``_csv``).

source: The *extra* argument can be a set of names that wouldn't otherwise be automatically detected as "public", like objects without a proper :attr:`~definition.__module__` attribute. If provided, it will be added to the automatically detected ones.
sv: Argumentet *extra* kan vara en uppsättning namn som annars inte automatiskt skulle identifieras som "public", t.ex. objekt utan ett korrekt :attr:`~definition.__module__`-attribut. Om det anges kommer det att läggas till de automatiskt upptäckta.

source: The *not_exported* argument can be a set of names that must not be treated as part of the public API even though their names indicate otherwise.
sv: Argumentet *not_exported* kan vara en uppsättning namn som inte får behandlas som en del av det publika API:et även om deras namn anger något annat.

source: Example use::
sv: Exempel på användning::
