Repository: yeager/python-docs-sv
Catalog: library/test.po
Languages: sv

source: :mod:`!test` --- Regression tests package for Python
sv: :mod:`!test` --- Paket med regressionstester för Python

source: The :mod:`test` package is meant for internal use by Python only. It is documented for the benefit of the core developers of Python. Any use of this package outside of Python's standard library is discouraged as code mentioned here can change or be removed without notice between releases of Python.
sv: Paketet :mod:`test` är endast avsett för internt bruk av Python. Det är dokumenterat till förmån för Pythons kärnutvecklare. All användning av detta paket utanför Pythons standardbibliotek avråds eftersom koden som nämns här kan ändras eller tas bort utan förvarning mellan utgåvor av Python.

source: The :mod:`test` package contains all regression tests for Python as well as the modules :mod:`test.support` and :mod:`test.regrtest`. :mod:`test.support` is used to enhance your tests while :mod:`test.regrtest` drives the testing suite.
sv: Paketet :mod:`test` innehåller alla regressionstester för Python samt modulerna :mod:`test.support` och :mod:`test.regrtest`. :mod:`test.support` används för att förbättra dina tester medan :mod:`test.regrtest` driver testsviten.

source: Each module in the :mod:`test` package whose name starts with ``test_`` is a testing suite for a specific module or feature. All new tests should be written using the :mod:`unittest` or :mod:`doctest` module. Some older tests are written using a "traditional" testing style that compares output printed to ``sys.stdout``; this style of test is considered deprecated.
sv: Varje modul i paketet :mod:`test` vars namn börjar med ``test_`` är en testsvit för en specifik modul eller funktion. Alla nya tester bör skrivas med hjälp av modulen :mod:`unittest` eller :mod:`doctest`. Vissa äldre tester är skrivna med en "traditionell" teststil som jämför utdata som skrivs ut till ``sys.stdout``; denna teststil anses vara föråldrad.

source: Module :mod:`unittest`
sv: Modul :mod:`unittest`

source: Writing PyUnit regression tests.
sv: Skriva PyUnit regressionstester.

source: Module :mod:`doctest`
sv: Modul :mod:`doctest`

source: Tests embedded in documentation strings.
sv: Tester inbäddade i dokumentationssträngar.

source: Writing Unit Tests for the :mod:`test` package
sv: Skriva enhetstester för :mod:`test`-paketet

source: It is preferred that tests that use the :mod:`unittest` module follow a few guidelines. One is to name the test module by starting it with ``test_`` and end it with the name of the module being tested. The test methods in the test module should start with ``test_`` and end with a description of what the method is testing. This is needed so that the methods are recognized by the test driver as test methods. Also, no documentation string for the method should be included. A comment (such as ``# Tests function returns only True or False``) should be used to provide documentation for test methods. This is done because documentation strings get printed out if they exist and thus what test is being run is not stated.
sv: Det är önskvärt att tester som använder modulen :mod:`unittest` följer några riktlinjer. En är att namnge testmodulen genom att börja den med ``test_`` och avsluta den med namnet på den modul som testas. Testmetoderna i testmodulen bör börja med ``test_`` och sluta med en beskrivning av vad metoden testar. Detta behövs för att testdrivrutinen ska känna igen metoderna som testmetoder. Dessutom bör ingen dokumentationssträng för metoden inkluderas. En kommentar (t.ex. ``# Testfunktionen returnerar endast True eller False``) bör användas för att tillhandahålla dokumentation för testmetoder. Detta görs för att dokumentationssträngar skrivs ut om de finns och därmed anges inte vilket test som körs.

source: A basic boilerplate is often used::
sv: En grundläggande boilerplate används ofta::

source: This code pattern allows the testing suite to be run by :mod:`test.regrtest`, on its own as a script that supports the :mod:`unittest` CLI, or via the ``python -m unittest`` CLI.
sv: Detta kodmönster gör att testsviten kan köras av :mod:`test.regrtest`, på egen hand som ett skript som stöder :mod:`unittest` CLI, eller via ``python -m unittest`` CLI.

source: The goal for regression testing is to try to break code. This leads to a few guidelines to be followed:
sv: Målet med regressionstestning är att försöka knäcka koden. Detta leder till några riktlinjer som ska följas:

source: The testing suite should exercise all classes, functions, and constants. This includes not just the external API that is to be presented to the outside world but also "private" code.
sv: Testsviten bör omfatta alla klasser, funktioner och konstanter. Detta inkluderar inte bara det externa API som ska presenteras för omvärlden utan även "privat" kod.

source: Whitebox testing (examining the code being tested when the tests are being written) is preferred. Blackbox testing (testing only the published user interface) is not complete enough to make sure all boundary and edge cases are tested.
sv: Whitebox-testning (undersökning av den kod som testas när testerna skrivs) är att föredra. Blackbox-testning (testning av endast det publicerade användargränssnittet) är inte tillräckligt komplett för att säkerställa att alla gräns- och kantfall testas.

source: Make sure all possible values are tested including invalid ones. This makes sure that not only all valid values are acceptable but also that improper values are handled correctly.
sv: Se till att alla möjliga värden testas, inklusive ogiltiga värden. På så sätt säkerställs inte bara att alla giltiga värden accepteras utan också att felaktiga värden hanteras korrekt.

source: Exhaust as many code paths as possible. Test where branching occurs and thus tailor input to make sure as many different paths through the code are taken.
sv: Utnyttja så många kodvägar som möjligt. Testa var förgreningar förekommer och anpassa därmed indata för att se till att så många olika vägar genom koden som möjligt tas.

source: Add an explicit test for any bugs discovered for the tested code. This will make sure that the error does not crop up again if the code is changed in the future.
sv: Lägg till ett uttryckligt test för eventuella buggar som upptäcks i den testade koden. Detta kommer att säkerställa att felet inte dyker upp igen om koden ändras i framtiden.

source: Make sure to clean up after your tests (such as close and remove all temporary files).
sv: Se till att städa upp efter dina tester (t.ex. genom att stänga och ta bort alla temporära filer).

source: If a test is dependent on a specific condition of the operating system then verify the condition already exists before attempting the test.
sv: Om ett test är beroende av ett specifikt tillstånd i operativsystemet ska du kontrollera att tillståndet redan finns innan du utför testet.

source: Import as few modules as possible and do it as soon as possible. This minimizes external dependencies of tests and also minimizes possible anomalous behavior from side-effects of importing a module.
sv: Importera så få moduler som möjligt och gör det så snart som möjligt. Detta minimerar externa beroenden för tester och minimerar också eventuella avvikande beteenden från bieffekter av att importera en modul.

source: Try to maximize code reuse. On occasion, tests will vary by something as small as what type of input is used. Minimize code duplication by subclassing a basic test class with a class that specifies the input::
sv: Försök att maximera återanvändning av kod. Ibland kommer testerna att variera genom något så litet som vilken typ av indata som används. Minimera kodduplicering genom att underklassa en grundläggande testklass med en klass som specificerar indata::

source: When using this pattern, remember that all classes that inherit from :class:`unittest.TestCase` are run as tests. The :class:`!TestFuncAcceptsSequencesMixin` class in the example above does not have any data and so can't be run by itself, thus it does not inherit from :class:`unittest.TestCase`.
sv: När du använder det här mönstret ska du komma ihåg att alla klasser som ärver från :class:`unittest.TestCase` körs som tester. Klassen :class:`!TestFuncAcceptsSequencesMixin` i exemplet ovan har ingen data och kan därför inte köras själv, och den ärver därför inte från :class:`unittest.TestCase`.

source: Test Driven Development
sv: Testdriven utveckling

source: A book by Kent Beck on writing tests before code.
sv: En bok av Kent Beck om att skriva tester före kod.

source: Running tests using the command-line interface
sv: Utföra tester med hjälp av kommandoradsgränssnittet

source: The :mod:`test` package can be run as a script to drive Python's regression test suite, thanks to the :option:`-m` option: :program:`python -m test`. Under the hood, it uses :mod:`test.regrtest`; the call :program:`python -m test.regrtest` used in previous Python versions still works. Running the script by itself automatically starts running all regression tests in the :mod:`test` package. It does this by finding all modules in the package whose name starts with ``test_``, importing them, and executing the function :func:`test_main` if present or loading the tests via unittest.TestLoader.loadTestsFromModule if ``test_main`` does not exist. The names of tests to execute may also be passed to the script. Specifying a single regression test (:program:`python -m test test_spam`) will minimize output and only print whether the test passed or failed.
sv: Paketet :mod:`test` kan köras som ett skript för att driva Pythons regressionstestsvit, tack vare alternativet :option:`-m`: :program:`python -m test`. Under huven använder det :mod:`test.regrtest`; anropet :program:`python -m test.regrtest` som användes i tidigare Python-versioner fungerar fortfarande. Om du kör skriptet själv börjar du automatiskt köra alla regressionstester i paketet :mod:`test`. Detta görs genom att hitta alla moduler i paketet vars namn börjar med ``test_``, importera dem och köra funktionen :func:`test_main` om den finns eller ladda testerna via unittest.TestLoader.loadTestsFromModule om ``test_main`` inte finns. Namnen på de tester som ska köras kan också skickas till skriptet. Om du anger ett enda regressionstest (:program:`python -m test test_spam`) minimeras utdata och det skrivs bara ut om testet godkändes eller misslyckades.

source: Running :mod:`test` directly allows what resources are available for tests to use to be set. You do this by using the ``-u`` command-line option. Specifying ``all`` as the value for the ``-u`` option enables all possible resources: :program:`python -m test -uall`. If all but one resource is desired (a more common case), a comma-separated list of resources that are not desired may be listed after ``all``. The command :program:`python -m test -uall,-audio,-largefile` will run :mod:`test` with all resources except the ``audio`` and ``largefile`` resources. For a list of all resources and more command-line options, run :program:`python -m test -h`.
sv: Om du kör :mod:`test` direkt kan du ställa in vilka resurser som ska vara tillgängliga för tester. Detta görs genom att använda kommandoradsalternativet ``-u``. Om du anger ``all`` som värde för alternativet ``-u`` aktiveras alla möjliga resurser: :program:`python -m test -uall`. Om alla resurser utom en önskas (ett vanligare fall) kan en kommaseparerad lista med resurser som inte önskas anges efter ``all``. Kommandot :program:`python -m test -uall,-audio,-largefile` kommer att köra :mod:`test` med alla resurser utom resurserna ``audio`` och ``largefile``. För en lista över alla resurser och fler kommandoradsalternativ, kör :program:`python -m test -h`.

source: Some other ways to execute the regression tests depend on what platform the tests are being executed on. On Unix, you can run :program:`make test` at the top-level directory where Python was built. On Windows, executing :program:`rt.bat` from your :file:`PCbuild` directory will run all regression tests.
sv: Några andra sätt att köra regressionstesterna beror på vilken plattform testerna körs på. På Unix kan du köra :program:`make test` i den katalog på högsta nivån där Python byggdes. På Windows kan du köra alla regressionstester genom att köra :program:`rt.bat` från din :file:`PCbuild`-katalog.

source: Output is colorized by default and can be :ref:`controlled using environment variables <using-on-controlling-color>`.
sv: Utdata är färgade som standard och kan :ref:`kontrolleras med hjälp av miljövariabler <using-on-controlling-color>`.

source: :mod:`test.support` --- Utilities for the Python test suite
sv: :mod:`test.support` --- Verktyg för Python-testsviten

source: The :mod:`test.support` module provides support for Python's regression test suite.
sv: Modulen :mod:`test.support` ger stöd för Pythons regressionstestsvit.

source: :mod:`test.support` is not a public module. It is documented here to help Python developers write tests. The API of this module is subject to change without backwards compatibility concerns between releases.
sv: :mod:`test.support` är inte en publik modul. Den är dokumenterad här för att hjälpa Python-utvecklare att skriva tester. API:et för denna modul kan komma att ändras utan hänsyn till bakåtkompatibilitet mellan utgåvor.

source: This module defines the following exceptions:
sv: Denna modul definierar följande undantag:

source: Exception to be raised when a test fails. This is deprecated in favor of :mod:`unittest`\ -based tests and :class:`unittest.TestCase`'s assertion methods.
sv: Undantag som ska tas upp när ett test misslyckas. Detta är föråldrat till förmån för :mod:`unittest` -baserade tester och :class:`unittest.TestCase` s assertion-metoder.

source: Subclass of :exc:`unittest.SkipTest`. Raised when a resource (such as a network connection) is not available. Raised by the :func:`requires` function.
sv: Underklass till :exc:`unittest.SkipTest`. Utlöses när en resurs (t.ex. en nätverksanslutning) inte är tillgänglig. Utlöses av funktionen :func:`requires`.

source: The :mod:`test.support` module defines the following constants:
sv: Modulen :mod:`test.support` definierar följande konstanter:

source: ``True`` when verbose output is enabled. Should be checked when more detailed information is desired about a running test. *verbose* is set by :mod:`test.regrtest`.
sv: ``True`` när verbose-utdata är aktiverat. Bör markeras när mer detaljerad information önskas om ett test som körs. *verbose* ställs in av :mod:`test.regrtest`.

source: ``True`` if the running interpreter is Jython.
sv: ``True`` om den körande tolken är Jython.

source: ``True`` if ``sys.platform`` is ``android``.
sv: ``True`` om ```sys.platform`` är ``android``.

source: ``True`` if ``sys.platform`` is ``emscripten``.
sv: ``True`` om ```sys.platform`` är ``emscripten``.

source: ``True`` if ``sys.platform`` is ``wasi``.
sv: ``True`` om ```sys.platform`` är ``wasi``.

source: ``True`` if ``sys.platform`` is ``ios``, ``tvos``, or ``watchos``.
sv: ``True`` om ``sys.platform`` är ``ios``, ``tvos`` eller ``watchos``.

source: ``True`` if ``sys.platform`` is ``darwin`` or ``is_apple_mobile`` is ``True``.
sv: ``True`` om ```sys.platform`` är ``darwin`` eller ``is_apple_mobile`` är ``True``.

source: Path for shell if not on Windows; otherwise ``None``.
sv: Sökväg till skalet om det inte finns på Windows; annars ``None``.

source: Timeout in seconds for tests using a network server listening on the network local loopback interface like ``127.0.0.1``.
sv: Timeout i sekunder för tester som använder en nätverksserver som lyssnar på nätverkets lokala loopback-gränssnitt, t.ex. ``127.0.0.1``.

source: The timeout is long enough to prevent test failure: it takes into account that the client and the server can run in different threads or even different processes.
sv: Timeouten är tillräckligt lång för att förhindra att testet misslyckas: den tar hänsyn till att klienten och servern kan köras i olika trådar eller till och med olika processer.

source: The timeout should be long enough for :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` methods of :class:`socket.socket`.
sv: Timeouten ska vara tillräckligt lång för metoderna :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` och :meth:`~socket.socket.send` i :class:`socket.socket`.

source: Its default value is 5 seconds.
sv: Dess standardvärde är 5 sekunder.

source: See also :data:`INTERNET_TIMEOUT`.
sv: Se även :data:`INTERNET_TIMEOUT`.

source: Timeout in seconds for network requests going to the internet.
sv: Timeout i sekunder för nätverksförfrågningar som går till internet.

source: The timeout is short enough to prevent a test to wait for too long if the internet request is blocked for whatever reason.
sv: Timeouten är tillräckligt kort för att förhindra att ett test får vänta för länge om internetbegäran blockeras av någon anledning.

source: Usually, a timeout using :data:`INTERNET_TIMEOUT` should not mark a test as failed, but skip the test instead: see :func:`~test.support.socket_helper.transient_internet`.
sv: Vanligtvis bör en timeout som använder :data:`INTERNET_TIMEOUT` inte markera ett test som misslyckat, utan hoppa över testet istället: se :func:`~test.support.socket_helper.transient_internet`.

source: Its default value is 1 minute.
sv: Dess standardvärde är 1 minut.

source: See also :data:`LOOPBACK_TIMEOUT`.
sv: Se även :data:`LOOPBACK_TIMEOUT`.

source: Timeout in seconds to mark a test as failed if the test takes "too long".
sv: Timeout i sekunder för att markera ett test som misslyckat om testet tar "för lång tid".

source: The timeout value depends on the regrtest ``--timeout`` command line option.
sv: Timeout-värdet beror på regrtests kommandoradsalternativ ``--timeout``.

source: If a test using :data:`SHORT_TIMEOUT` starts to fail randomly on slow buildbots, use :data:`LONG_TIMEOUT` instead.
sv: Om ett test som använder :data:`SHORT_TIMEOUT` börjar misslyckas slumpmässigt på långsamma byggrobotar, använd :data:`LONG_TIMEOUT` istället.

source: Its default value is 30 seconds.
sv: Dess standardvärde är 30 sekunder.

source: Timeout in seconds to detect when a test hangs.
sv: Timeout i sekunder för att upptäcka när ett test hänger sig.

source: It is long enough to reduce the risk of test failure on the slowest Python buildbots. It should not be used to mark a test as failed if the test takes "too long". The timeout value depends on the regrtest ``--timeout`` command line option.
sv: Den är tillräckligt lång för att minska risken för att testet misslyckas på de långsammaste Python-byggrobotarna. Det ska inte användas för att markera ett test som misslyckat om testet tar "för lång tid". Timeout-värdet beror på regrtests kommandoradsalternativ ``--timeout``.

source: Its default value is 5 minutes.
sv: Dess standardvärde är 5 minuter.

source: See also :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` and :data:`SHORT_TIMEOUT`.
sv: Se även :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` och :data:`SHORT_TIMEOUT`.

source: Set when tests can be skipped when they are not useful for PGO.
sv: Ställ in när tester kan hoppas över när de inte är användbara för PGO.

source: A constant that is likely larger than the underlying OS pipe buffer size, to make writes blocking.
sv: En konstant som sannolikt är större än den underliggande OS-pipebuffertstorleken, för att göra skrivningar blockerande.

source: ``True`` if Python was built with the :c:macro:`Py_DEBUG` macro defined, that is, if Python was :ref:`built in debug mode <debug-build>`.
sv: ``True`` om Python byggdes med makrot :c:macro:`Py_DEBUG` definierat, det vill säga om Python :ref:`byggdes i felsökningsläge <debug-build>`.

source: A constant that is likely larger than the underlying OS socket buffer size, to make writes blocking.
sv: En konstant som sannolikt är större än den underliggande OS-socketbuffertstorleken, för att göra skrivningar blockerande.

source: Set to the top level directory that contains :mod:`test.support`.
sv: Ställs in till den katalog på högsta nivån som innehåller :mod:`test.support`.

source: Set to the top level directory for the test package.
sv: Ställs in till den översta katalogen för testpaketet.

source: Set to the ``data`` directory within the test package.
sv: Sätts till katalogen ``data`` inom testpaketet.

source: Set to :data:`sys.maxsize` for big memory tests.
sv: Sätts till :data:`sys.maxsize` för stora minnestester.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Limited by :data:`MAX_Py_ssize_t`.
sv: Ställs in av :func:`set_memlimit` som minnesgräns för stora minnestester. Begränsas av :data:`MAX_Py_ssize_t`.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Not limited by :data:`MAX_Py_ssize_t`.
sv: Ställs in av :func:`set_memlimit` som minnesgräns för stora minnestester. Begränsas inte av :data:`MAX_Py_ssize_t`.

source: Set to ``True`` if Python is built without docstrings (the :c:macro:`WITH_DOC_STRINGS` macro is not defined). See the :option:`configure --without-doc-strings <--without-doc-strings>` option.
sv: Ställs in till ``True`` om Python byggs utan docstrings (makrot :c:macro:`WITH_DOC_STRINGS` är inte definierat). Se alternativet :option:`configure --without-doc-strings <--without-doc-strings>`.

source: See also the :data:`HAVE_DOCSTRINGS` variable.
sv: Se även variabeln :data:`HAVE_DOCSTRINGS`.

source: Set to ``True`` if function docstrings are available. See the :option:`python -OO <-O>` option, which strips docstrings of functions implemented in Python.
sv: Ställs in till ``True`` om funktionsdokumentrar finns tillgängliga. Se alternativet :option:`python -OO <-O>`, som tar bort dokumentsträngar för funktioner som implementerats i Python.

source: See also the :data:`MISSING_C_DOCSTRINGS` variable.
sv: Se även variabeln :data:`MISSING_C_DOCSTRINGS`.

source: Define the URL of a dedicated HTTP server for the network tests.
sv: Definiera URL:en till en dedikerad HTTP-server för nätverkstesterna.

source: Object that is equal to anything. Used to test mixed type comparison.
sv: Objekt som är lika med vad som helst. Används för att testa jämförelse av blandad typ.

source: Object that is not equal to anything (even to :data:`ALWAYS_EQ`). Used to test mixed type comparison.
sv: Objekt som inte är lika med något (inte ens med :data:`ALWAYS_EQ`). Används för att testa jämförelse av blandade typer.

source: Object that is greater than anything (except itself). Used to test mixed type comparison.
sv: Objekt som är större än något annat (utom sig självt). Används för att testa jämförelse av blandade typer.

source: Object that is less than anything (except itself). Used to test mixed type comparison.
sv: Objekt som är mindre än något annat (utom sig självt). Används för att testa jämförelse av blandade typer.

source: The :mod:`test.support` module defines the following functions:
sv: Modulen :mod:`test.support` definierar följande funktioner:

source: Run the loop body until ``break`` stops the loop.
sv: Kör slingkroppen tills ``break`` stoppar slingan.

source: After *timeout* seconds, raise an :exc:`AssertionError` if *error* is true, or just stop the loop if *error* is false.
sv: Efter *timeout* sekunder, skapa ett :exc:`AssertionError` om *error* är sant, eller bara stoppa slingan om *error* är falskt.

source: Example::
sv: Exempel::

source: Example of error=False usage::
sv: Exempel på användning av error=False::

source: Wait strategy that applies exponential backoff.
sv: Vänta-strategi som tillämpar exponentiell backoff.
