Repository: yeager/python-docs-sv
Catalog: library/test.po
Languages: sv

source: Return ``True`` if the file system for *directory* is case-insensitive.
sv: Returnerar ``True`` om filsystemet för *katalog* är skiftlägesokänsligt.

source: Create an invalid file descriptor by opening and closing a temporary file, and returning its descriptor.
sv: Skapa en ogiltig filbeskrivare genom att öppna och stänga en temporär fil och returnera dess beskrivare.

source: Call :func:`os.rmdir` on *filename*. On Windows platforms, this is wrapped with a wait loop that checks for the existence of the file, which is needed due to antivirus programs that can hold files open and prevent deletion.
sv: Anropa :func:`os.rmdir` på *filnamn*. På Windows-plattformar är detta omslutet av en vänteslinga som kontrollerar att filen finns, vilket behövs på grund av antivirusprogram som kan hålla filer öppna och förhindra radering.

source: Call :func:`shutil.rmtree` on *path* or call :func:`os.lstat` and :func:`os.rmdir` to remove a path and its contents. As with :func:`rmdir`, on Windows platforms this is wrapped with a wait loop that checks for the existence of the files.
sv: Anropa :func:`shutil.rmtree` på *sökväg* eller anropa :func:`os.lstat` och :func:`os.rmdir` för att ta bort en sökväg och dess innehåll. Precis som med :func:`rmdir`, på Windows-plattformar är detta omslutet av en vänteslinga som kontrollerar att filerna finns.

source: A decorator for running tests that require support for symbolic links.
sv: En dekorator för att köra tester som kräver stöd för symboliska länkar.

source: A decorator for running tests that require support for xattr.
sv: En dekorator för att köra tester som kräver stöd för xattr.

source: A context manager that temporarily creates a new directory and changes the current working directory (CWD).
sv: En kontexthanterare som tillfälligt skapar en ny katalog och ändrar den aktuella arbetskatalogen (CWD).

source: The context manager creates a temporary directory in the current directory with name *name* before temporarily changing the current working directory. If *name* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`.
sv: Kontexthanteraren skapar en temporär katalog i den aktuella katalogen med namnet *name* innan den aktuella arbetskatalogen ändras temporärt. Om *namn* är ``None`` skapas den temporära katalogen med hjälp av :func:`tempfile.mkdtemp`.

source: If *quiet* is ``False`` and it is not possible to create or change the CWD, an error is raised. Otherwise, only a warning is raised and the original CWD is used.
sv: Om *quiet* är ``False`` och det inte är möjligt att skapa eller ändra CWD:n, utlöses ett fel. I annat fall utfärdas endast en varning och den ursprungliga CWD:n används.

source: A context manager that creates a temporary directory at *path* and yields the directory.
sv: En kontexthanterare som skapar en tillfällig katalog på *sökväg* och lämnar ut katalogen.

source: If *path* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`. If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, if *path* is specified and cannot be created, only a warning is issued.
sv: Om *path* är ``None`` skapas den temporära katalogen med :func:`tempfile.mkdtemp`. Om *quiet* är ``False``, gör kontexthanteraren ett undantag vid fel. I annat fall, om *path* anges och inte kan skapas, utfärdas endast en varning.

source: A context manager that temporarily sets the process umask.
sv: En kontexthanterare som temporärt ställer in processens umask.

source: Call :func:`os.unlink` on *filename*. As with :func:`rmdir`, on Windows platforms, this is wrapped with a wait loop that checks for the existence of the file.
sv: Anropa :func:`os.unlink` på *filename*. Precis som med :func:`rmdir`, på Windows-plattformar, är detta omslutet av en vänteslinga som kontrollerar om filen finns.

source: :mod:`test.support.import_helper` --- Utilities for import tests
sv: :mod:`test.support.import_helper` --- Hjälpmedel för importtester

source: The :mod:`test.support.import_helper` module provides support for import tests.
sv: Modulen :mod:`test.support.import_helper` ger stöd för importtester.

source: Remove the module named *module_name* from ``sys.modules`` and delete any byte-compiled files of the module.
sv: Ta bort modulen med namnet *modul_namn* från ``sys.modules`` och radera alla bytekompilerade filer i modulen.

source: This function imports and returns a fresh copy of the named Python module by removing the named module from ``sys.modules`` before doing the import. Note that unlike :func:`reload`, the original module is not affected by this operation.
sv: Denna funktion importerar och returnerar en ny kopia av den namngivna Python-modulen genom att ta bort den namngivna modulen från ``sys.modules`` innan importen görs. Observera att till skillnad från :func:`reload` påverkas inte den ursprungliga modulen av denna operation.

source: *fresh* is an iterable of additional module names that are also removed from the ``sys.modules`` cache before doing the import.
sv: *fresh* är en iterabel med ytterligare modulnamn som också tas bort från ``sys.modules`` cache innan importen görs.

source: *blocked* is an iterable of module names that are replaced with ``None`` in the module cache during the import to ensure that attempts to import them raise :exc:`ImportError`.
sv: *blocked* är en iterabel av modulnamn som ersätts med ``None`` i modulcachen under importen för att säkerställa att försök att importera dem ger upphov till :exc:`ImportError`.

source: The named module and any modules named in the *fresh* and *blocked* parameters are saved before starting the import and then reinserted into ``sys.modules`` when the fresh import is complete.
sv: Den namngivna modulen och alla moduler som namnges i parametrarna *fresh* och *blocked* sparas innan importen påbörjas och återinförs sedan i ``sys.modules`` när den nya importen är klar.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``.
sv: Meddelanden om modul- och paketdepreciering undertrycks under denna import om *deprecated* är ``True``.

source: This function will raise :exc:`ImportError` if the named module cannot be imported.
sv: Denna funktion ger :exc:`ImportError` om den namngivna modulen inte kan importeras.

source: # Get copies of the warnings module for testing without affecting the # version being used by the rest of the test suite. One copy uses the # C implementation, the other is forced to use the pure Python fallback # implementation py_warnings = import_fresh_module('warnings', blocked=['_warnings']) c_warnings = import_fresh_module('warnings', fresh=['_warnings'])
sv: # Hämta kopior av varningsmodulen för testning utan att påverka den # version som används av resten av testsviten. En kopia använder # C-implementeringen, den andra tvingas använda den rena Python-fallbacken # implementeringen py_warnings = import_fresh_module('warnings', blocked=['_warnings']) c_warnings = import_fresh_module('warnings', fresh=['_warnings'])

source: This function imports and returns the named module. Unlike a normal import, this function raises :exc:`unittest.SkipTest` if the module cannot be imported.
sv: Denna funktion importerar och returnerar den namngivna modulen. Till skillnad från en vanlig import ger den här funktionen upphov till :exc:`unittest.SkipTest` om modulen inte kan importeras.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``. If a module is required on a platform but optional for others, set *required_on* to an iterable of platform prefixes which will be compared against :data:`sys.platform`.
sv: Meddelanden om modul- och paketdepreciering undertrycks under denna import om *deprecated* är ``True``. Om en modul krävs på en plattform men är valfri för andra, ange *required_on* till en iterabel av plattformsprefix som kommer att jämföras med :data:`sys.platform`.

source: Return a copy of :data:`sys.modules`.
sv: Returnera en kopia av :data:`sys.modules`.

source: Remove modules except for *oldmodules* and ``encodings`` in order to preserve internal cache.
sv: Ta bort moduler med undantag för *oldmodules* och ``encodings`` för att bevara intern cache.

source: Delete *name* from ``sys.modules``.
sv: Ta bort *namn* från ``sys.modules``.

source: Move a :pep:`3147`/:pep:`488` pyc file to its legacy pyc location and return the file system path to the legacy pyc file. The *source* value is the file system path to the source file. It does not need to exist, however the PEP 3147/488 pyc file must exist.
sv: Flyttar en :pep:`3147`/:pep:`488` pyc-fil till dess äldre pyc-plats och returnerar filsystemets sökväg till den äldre pyc-filen. Värdet *source* är filsystemets sökväg till källfilen. Den behöver inte finnas, men PEP 3147/488 pyc-filen måste finnas.

source: A context manager to force import to return a new module reference. This is useful for testing module-level behaviors, such as the emission of a :exc:`DeprecationWarning` on import. Example usage::
sv: En kontexthanterare som tvingar import att returnera en ny modulreferens. Detta är användbart för att testa beteenden på modulnivå, t.ex. utfärdandet av en :exc:`DeprecationWarning` vid import. Exempel på användning::

source: A context manager to temporarily add directories to :data:`sys.path`.
sv: En kontexthanterare för att tillfälligt lägga till kataloger i :data:`sys.path`.

source: This makes a copy of :data:`sys.path`, appends any directories given as positional arguments, then reverts :data:`sys.path` to the copied settings when the context ends.
sv: Detta gör en kopia av :data:`sys.path`, lägger till alla kataloger som anges som positionsargument och återställer sedan :data:`sys.path` till de kopierade inställningarna när kontexten avslutas.

source: Note that *all* :data:`sys.path` modifications in the body of the context manager, including replacement of the object, will be reverted at the end of the block.
sv: Observera att *alla* :data:`sys.path`-ändringar i kontexthanterarens kropp, inklusive ersättning av objektet, kommer att återställas i slutet av blocket.

source: :mod:`test.support.warnings_helper` --- Utilities for warnings tests
sv: :mod:`test.support.warnings_helper` --- Hjälpmedel för test av varningar

source: The :mod:`test.support.warnings_helper` module provides support for warnings tests.
sv: Modulen :mod:`test.support.warnings_helper` ger stöd för varningstest.

source: Suppress warnings that are instances of *category*, which must be :exc:`Warning` or a subclass. Roughly equivalent to :func:`warnings.catch_warnings` with :meth:`warnings.simplefilter('ignore', category=category) <warnings.simplefilter>`. For example::
sv: Undertrycker varningar som är instanser av *category*, som måste vara :exc:`Warning` eller en underklass. Ungefär likvärdigt med :func:`warnings.catch_warnings` med :meth:`warnings.simplefilter('ignore', category=category) <warnings.simplefilter>`. Till exempel::

source: @warning_helper.ignore_warnings(category=DeprecationWarning) def test_suppress_warning(): # do something
sv: @warning_helper.ignore_warnings(category=DeprecationWarning) def test_suppress_warning(): # gör något

source: Context manager to check that no :exc:`ResourceWarning` was raised. You must remove the object which may emit :exc:`ResourceWarning` before the end of the context manager.
sv: Kontexthanterare för att kontrollera att ingen :exc:`ResourceWarning` har skapats. Du måste ta bort det objekt som kan ge upphov till :exc:`ResourceWarning` innan kontexthanteraren avslutas.

source: Test for syntax warning in *statement* by attempting to compile *statement*. Test also that the :exc:`SyntaxWarning` is emitted only once, and that it will be converted to a :exc:`SyntaxError` when turned into error. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the emitted :exc:`SyntaxWarning` and raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the warning and exception. If *offset* is not ``None``, compares to the offset of the exception.
sv: Testa för syntaxvarning i *statement* genom att försöka kompilera *statement*. Testa också att :exc:`SyntaxWarning` bara sänds ut en gång och att den konverteras till :exc:`SyntaxError` när den blir ett fel. *testcase* är :mod:`unittest`-instansen för testet. *errtext* är det reguljära uttryck som skall matcha strängrepresentationen av den utsända :exc:`SyntaxWarning` och den uppkomna :exc:`SyntaxError`. Om *lineno* inte är ``None``, jämförs med raden för varningen och undantaget. Om *offset* inte är ``None``, jämförs med undantagets offset.

source: A convenience wrapper for :func:`warnings.catch_warnings` that makes it easier to test that a warning was correctly raised. It is approximately equivalent to calling ``warnings.catch_warnings(record=True)`` with :meth:`warnings.simplefilter` set to ``always`` and with the option to automatically validate the results that are recorded.
sv: En bekväm omslutning för :func:`warnings.catch_warnings` som gör det enklare att testa att en varning har utlösts korrekt. Det motsvarar ungefär att anropa ``warnings.catch_warnings(record=True)`` med :meth:`warnings.simplefilter` satt till ``always`` och med alternativet att automatiskt validera de resultat som registreras.

source: ``check_warnings`` accepts 2-tuples of the form ``("message regexp", WarningCategory)`` as positional arguments. If one or more *filters* are provided, or if the optional keyword argument *quiet* is ``False``, it checks to make sure the warnings are as expected: each specified filter must match at least one of the warnings raised by the enclosed code or the test fails, and if any warnings are raised that do not match any of the specified filters the test fails. To disable the first of these checks, set *quiet* to ``True``.
sv: ``check_warnings`` accepterar 2-tuples av formen ``("message regexp", WarningCategory)`` som positionella argument. Om ett eller flera *filter* anges, eller om det valfria nyckelordsargumentet *quiet* är ``False``, kontrolleras att varningarna är som förväntat: varje angivet filter måste matcha minst en av de varningar som den bifogade koden ger upphov till, annars misslyckas testet, och om några varningar ges upphov till som inte matchar något av de angivna filtren misslyckas testet. För att inaktivera den första av dessa kontroller, sätt *quiet* till ``True``.

source: If no arguments are specified, it defaults to::
sv: Om inga argument anges är standardvärdet::

source: check_warnings(("", Warning), quiet=True)
sv: check_warnings(("", Varning), quiet=True)

source: In this case all warnings are caught and no errors are raised.
sv: I det här fallet fångas alla varningar upp och inga felmeddelanden skickas ut.

source: On entry to the context manager, a :class:`WarningRecorder` instance is returned. The underlying warnings list from :func:`~warnings.catch_warnings` is available via the recorder object's :attr:`warnings` attribute. As a convenience, the attributes of the object representing the most recent warning can also be accessed directly through the recorder object (see example below). If no warning has been raised, then any of the attributes that would otherwise be expected on an object representing a warning will return ``None``.
sv: Vid inmatning till kontexthanteraren returneras en :class:`WarningRecorder`-instans. Den underliggande varningslistan från :func:`~warnings.catch_warnings` är tillgänglig via recorder-objektets attribut :attr:`warnings`. Som en bekvämlighet kan attributen för det objekt som representerar den senaste varningen också nås direkt via recorder-objektet (se exemplet nedan). Om ingen varning har utlösts, kommer alla attribut som annars skulle förväntas på ett objekt som representerar en varning att returnera ``None``.

source: The recorder object also has a :meth:`reset` method, which clears the warnings list.
sv: Recorder-objektet har också en :meth:`reset`-metod, som rensar varningslistan.

source: The context manager is designed to be used like this::
sv: Kontexthanteraren är utformad för att användas på följande sätt::

source: In this case if either warning was not raised, or some other warning was raised, :func:`check_warnings` would raise an error.
sv: I det här fallet skulle :func:`check_warnings` ge upphov till ett fel om någon av varningarna inte gavs, eller om någon annan varning gavs.

source: When a test needs to look more deeply into the warnings, rather than just checking whether or not they occurred, code like this can be used::
sv: När ett test behöver titta djupare på varningarna, snarare än att bara kontrollera om de inträffade eller inte, kan kod som denna användas::

source: Here all warnings will be caught, and the test code tests the captured warnings directly.
sv: Här kommer alla varningar att fångas upp och testkoden testar de fångade varningarna direkt.

source: New optional arguments *filters* and *quiet*.
sv: Nya valfria argument *filters* och *quiet*.

source: Class used to record warnings for unit tests. See documentation of :func:`check_warnings` above for more details.
sv: Klass som används för att registrera varningar för enhetstester. Se dokumentation av :func:`check_warnings` ovan för mer information.
