Repository: yeager/python-docs-sv
Catalog: library/textwrap.po
Languages: sv

source: :mod:`!textwrap` --- Text wrapping and filling
sv: :mod:`!textwrap` --- Ombrytning och fyllning av text

source: **Source code:** :source:`Lib/textwrap.py`
sv: **Källkod:** :source:`Lib/textwrap.py`

source: The :mod:`textwrap` module provides some convenience functions, as well as :class:`TextWrapper`, the class that does all the work. If you're just wrapping or filling one or two text strings, the convenience functions should be good enough; otherwise, you should use an instance of :class:`TextWrapper` for efficiency.
sv: Modulen :mod:`textwrap` tillhandahåller några bekvämlighetsfunktioner samt :class:`TextWrapper`, den klass som gör allt arbete. Om du bara omsluter eller fyller en eller två textsträngar bör bekvämlighetsfunktionerna vara tillräckligt bra; annars bör du använda en instans av :class:`TextWrapper` för effektivitetens skull.

source: Wraps the single paragraph in *text* (a string) so every line is at most *width* characters long. Returns a list of output lines, without final newlines.
sv: Slår in det enskilda stycket i *text* (en sträng) så att varje rad är högst *bredd* tecken lång. Returnerar en lista med utdatarader, utan avslutande nya linjer.

source: Optional keyword arguments correspond to the instance attributes of :class:`TextWrapper`, documented below.
sv: Valfria nyckelordsargument motsvarar instansattributen för :class:`TextWrapper`, som dokumenteras nedan.

source: See the :meth:`TextWrapper.wrap` method for additional details on how :func:`wrap` behaves.
sv: Se metoden :meth:`TextWrapper.wrap` för mer information om hur :func:`wrap` fungerar.

source: Wraps the single paragraph in *text*, and returns a single string containing the wrapped paragraph. :func:`fill` is shorthand for ::
sv: Omsluter det enskilda stycket i *text* och returnerar en enskild sträng som innehåller det omslutna stycket. :func:`fill` är en förkortning för ::

source: In particular, :func:`fill` accepts exactly the same keyword arguments as :func:`wrap`.
sv: I synnerhet accepterar :func:`fill` exakt samma nyckelordsargument som :func:`wrap`.

source: Collapse and truncate the given *text* to fit in the given *width*.
sv: Kollapsa och trunkera den givna *texten* så att den passar in i den givna *bredden*.

source: First the whitespace in *text* is collapsed (all whitespace is replaced by single spaces). If the result fits in the *width*, it is returned. Otherwise, enough words are dropped from the end so that the remaining words plus the *placeholder* fit within *width*::
sv: Först kollapsas blankstegen i *text* (alla blanksteg ersätts med enkla mellanslag). Om resultatet ryms inom *bredden* returneras det. Annars tas tillräckligt många ord bort från slutet så att de återstående orden plus *platshållaren* ryms inom *bredd*::

source: Optional keyword arguments correspond to the instance attributes of :class:`TextWrapper`, documented below. Note that the whitespace is collapsed before the text is passed to the :class:`TextWrapper` :meth:`fill` function, so changing the value of :attr:`.tabsize`, :attr:`.expand_tabs`, :attr:`.drop_whitespace`, and :attr:`.replace_whitespace` will have no effect.
sv: Valfria nyckelordsargument motsvarar instansattributen för :class:`TextWrapper`, som dokumenteras nedan. Observera att blanksteg kollapsar innan texten skickas till :class:`TextWrapper` :meth:`fill`-funktionen, så att ändra värdet på :attr:`.tabsize`, :attr:`.expand_tabs`, :attr:`.drop_whitespace` och :attr:`.replace_whitespace` kommer inte att ha någon effekt.

source: Remove any common leading whitespace from every line in *text*.
sv: Ta bort alla vanliga inledande blanksteg från varje rad i *text*.

source: This can be used to make triple-quoted strings line up with the left edge of the display, while still presenting them in the source code in indented form.
sv: Detta kan användas för att få trippelciterade strängar att ligga i linje med vänsterkanten på skärmen, samtidigt som de fortfarande presenteras i källkoden i indragen form.

source: Note that tabs and spaces are both treated as whitespace, but they are not equal: the lines ``" hello"`` and ``"\thello"`` are considered to have no common leading whitespace.
sv: Observera att tabbar och mellanslag båda behandlas som blanksteg, men de är inte lika: raderna ``" hello"`` och ``"\thello"`` anses inte ha något gemensamt ledande blanksteg.

source: Lines containing only whitespace are ignored in the input and normalized to a single newline character in the output.
sv: Rader som bara innehåller blanksteg ignoreras i inmatningen och normaliseras till ett enda nytt radtecken i utmatningen.

source: For example::
sv: Till exempel::

source: Add *prefix* to the beginning of selected lines in *text*.
sv: Lägg till *prefix* i början av markerade rader i *text*.

source: Lines are separated by calling ``text.splitlines(True)``.
sv: Rader separeras genom att anropa ``text.splitlines(True)``.

source: By default, *prefix* is added to all lines that do not consist solely of whitespace (including any line endings).
sv: Som standard läggs *prefix* till på alla rader som inte enbart består av blanksteg (inklusive eventuella radavslut).

source: The optional *predicate* argument can be used to control which lines are indented. For example, it is easy to add *prefix* to even empty and whitespace-only lines::
sv: Det valfria argumentet *predicate* kan användas för att styra vilka rader som ska vara indragna. Det är t.ex. enkelt att lägga till *prefix* även till tomma rader och rader med enbart blanksteg::

source: :func:`wrap`, :func:`fill` and :func:`shorten` work by creating a :class:`TextWrapper` instance and calling a single method on it. That instance is not reused, so for applications that process many text strings using :func:`wrap` and/or :func:`fill`, it may be more efficient to create your own :class:`TextWrapper` object.
sv: :func:`wrap`, :func:`fill` och :func:`shorten` fungerar genom att skapa en :class:`TextWrapper`-instans och anropa en enda metod på den. Den instansen återanvänds inte, så för program som bearbetar många textsträngar med hjälp av :func:`wrap` och/eller :func:`fill` kan det vara effektivare att skapa ett eget :class:`TextWrapper`-objekt.

source: Text is preferably wrapped on whitespaces and right after the hyphens in hyphenated words; only then will long words be broken if necessary, unless :attr:`TextWrapper.break_long_words` is set to false.
sv: Texten bryts helst på blanksteg och direkt efter bindestrecken i ord med bindestreck; först därefter bryts långa ord vid behov, såvida inte :attr:`TextWrapper.break_long_words` är satt till false.

source: The :class:`TextWrapper` constructor accepts a number of optional keyword arguments. Each keyword argument corresponds to an instance attribute, so for example ::
sv: Konstruktorn för :class:`TextWrapper` accepterar ett antal valfria nyckelordsargument. Varje nyckelordsargument motsvarar ett instansattribut, så till exempel ::

source: is the same as ::
sv: är detsamma som ::

source: You can reuse the same :class:`TextWrapper` object many times, and you can change any of its options through direct assignment to instance attributes between uses.
sv: Du kan återanvända samma :class:`TextWrapper`-objekt många gånger, och du kan ändra alla dess alternativ genom direkt tilldelning till instansattribut mellan användningarna.

source: The :class:`TextWrapper` instance attributes (and keyword arguments to the constructor) are as follows:
sv: Instansattributen för :class:`TextWrapper` (och nyckelordsargument till konstruktören) är följande:

source: (default: ``70``) The maximum length of wrapped lines. As long as there are no individual words in the input text longer than :attr:`width`, :class:`TextWrapper` guarantees that no output line will be longer than :attr:`width` characters.
sv: (standard: ``70``) Den maximala längden på omslutna rader. Så länge det inte finns några enskilda ord i inmatningstexten som är längre än :attr:`width`, garanterar :class:`TextWrapper` att ingen utmatningsrad kommer att vara längre än :attr:`width` tecken.

source: (default: ``True``) If true, then all tab characters in *text* will be expanded to spaces using the :meth:`~str.expandtabs` method of *text*.
sv: (default: ``True``) Om true, kommer alla tabbtecken i *text* att expanderas till mellanslag med hjälp av :meth:`~str.expandtabs`-metoden i *text*.

source: (default: ``8``) If :attr:`expand_tabs` is true, then all tab characters in *text* will be expanded to zero or more spaces, depending on the current column and the given tab size.
sv: (default: ``8``) Om :attr:`expand_tabs` är true kommer alla tabbtecken i *text* att expanderas till noll eller fler mellanslag, beroende på aktuell kolumn och angiven tabbstorlek.

source: (default: ``True``) If true, after tab expansion but before wrapping, the :meth:`wrap` method will replace each whitespace character with a single space. The whitespace characters replaced are as follows: tab, newline, vertical tab, formfeed, and carriage return (``'\t\n\v\f\r'``).
sv: (default: ``True``) Om true används kommer metoden :meth:`wrap` att ersätta varje blankstegstecken med ett enda mellanslag efter tabbexpansion men före ombrytning. De blankstegstecken som ersätts är följande: tabb, ny rad, vertikal tabb, formfeed och vagnsretur (``'\t\n\v\f\r\``).

source: If :attr:`expand_tabs` is false and :attr:`replace_whitespace` is true, each tab character will be replaced by a single space, which is *not* the same as tab expansion.
sv: Om :attr:`expand_tabs` är false och :attr:`replace_whitespace` är true kommer varje tabbtecken att ersättas med ett mellanslag, vilket *inte* är samma sak som tabbexpansion.

source: If :attr:`replace_whitespace` is false, newlines may appear in the middle of a line and cause strange output. For this reason, text should be split into paragraphs (using :meth:`str.splitlines` or similar) which are wrapped separately.
sv: Om :attr:`replace_whitespace` är false kan nya linjer visas mitt på en rad och orsaka konstiga utdata. Av denna anledning bör text delas upp i stycken (med :meth:`str.splitlines` eller liknande) som paketeras separat.

source: (default: ``True``) If true, whitespace at the beginning and ending of every line (after wrapping but before indenting) is dropped. Whitespace at the beginning of the paragraph, however, is not dropped if non-whitespace follows it. If whitespace being dropped takes up an entire line, the whole line is dropped.
sv: (standard: ``True``) Om true används, tas blanksteg i början och slutet av varje rad (efter ombrytning men före indragning) bort. Whitespace i början av stycket tas dock inte bort om det följs av icke-whitespace. Om det blanksteg som ska tas bort upptar en hel rad, tas hela raden bort.

source: (default: ``''``) String that will be prepended to the first line of wrapped output. Counts towards the length of the first line. The empty string is not indented.
sv: (standard: ``''``) Sträng som läggs till på den första raden i den inplastade utdata. Räknas mot längden på den första raden. Den tomma strängen är inte indragen.

source: (default: ``''``) String that will be prepended to all lines of wrapped output except the first. Counts towards the length of each line except the first.
sv: (standard: ``''``) Sträng som kommer att läggas till alla rader i den inplastade utdata utom den första. Räknar mot längden på varje rad utom den första.

source: (default: ``False``) If true, :class:`TextWrapper` attempts to detect sentence endings and ensure that sentences are always separated by exactly two spaces. This is generally desired for text in a monospaced font. However, the sentence detection algorithm is imperfect: it assumes that a sentence ending consists of a lowercase letter followed by one of ``'.'``, ``'!'``, or ``'?'``, possibly followed by one of ``'"'`` or ``"'"``, followed by a space. One problem with this algorithm is that it is unable to detect the difference between "Dr." in ::
sv: (default: ``False``) Om true, försöker :class:`TextWrapper` upptäcka meningsavslutningar och se till att meningarna alltid är åtskilda av exakt två mellanslag. Detta är i allmänhet önskvärt för text i ett monospaced-teckensnitt. Meningsdetekteringsalgoritmen är dock ofullständig: den antar att en meningsslut består av en gemen bokstav följd av en av ``'.'``, ``'!'`` eller ``'?'``, eventuellt följd av en av ``'"'`` eller ``"'"``, följt av ett mellanslag. Ett problem med den här algoritmen är att den inte kan upptäcka skillnaden mellan "Dr." i ::

source: and "Spot." in ::
sv: och "Spot." i ::

source: [...] See Spot. See Spot run [...]
sv: [...] Se Spot. Se Spot springa [...]

source: :attr:`fix_sentence_endings` is false by default.
sv: :attr:`fix_sentence_endings` är false som standard.

source: Since the sentence detection algorithm relies on ``string.lowercase`` for the definition of "lowercase letter", and a convention of using two spaces after a period to separate sentences on the same line, it is specific to English-language texts.
sv: Eftersom algoritmen för meningsdetektering bygger på ``string.lowercase`` för definitionen av "gemen bokstav" och en konvention om att använda två mellanslag efter en punkt för att separera meningar på samma rad, är den specifik för engelskspråkiga texter.

source: (default: ``True``) If true, then words longer than :attr:`width` will be broken in order to ensure that no lines are longer than :attr:`width`. If it is false, long words will not be broken, and some lines may be longer than :attr:`width`. (Long words will be put on a line by themselves, in order to minimize the amount by which :attr:`width` is exceeded.)
sv: (default: ``True``) Om true, kommer ord som är längre än :attr:`width` att brytas för att säkerställa att inga rader är längre än :attr:`width`. Om den är false kommer långa ord inte att brytas, och vissa rader kan vara längre än :attr:`width`. (Långa ord kommer att placeras på en rad för sig för att minimera den mängd som :attr:`width` överskrids med)

source: (default: ``True``) If true, wrapping will occur preferably on whitespaces and right after hyphens in compound words, as it is customary in English. If false, only whitespaces will be considered as potentially good places for line breaks, but you need to set :attr:`break_long_words` to false if you want truly insecable words. Default behaviour in previous versions was to always allow breaking hyphenated words.
sv: (default: ``True``) Om true, kommer ombrytning att ske företrädesvis på blanksteg och direkt efter bindestreck i sammansatta ord, som det är brukligt på engelska. Om false, kommer endast blanksteg att betraktas som potentiellt bra platser för radbrytningar, men du måste ställa in :attr:`break_long_words` till false om du vill ha riktigt osäkra ord. Standardbeteendet i tidigare versioner var att alltid tillåta brytning av ord med bindestreck.

source: (default: ``None``) If not ``None``, then the output will contain at most *max_lines* lines, with *placeholder* appearing at the end of the output.
sv: (standard: ``None``) Om inte ``None``, kommer utdata att innehålla högst *max_lines* rader, med *placeholder* i slutet av utdata.

source: (default: ``' [...]'``) String that will appear at the end of the output text if it has been truncated.
sv: (standard: ``' [...]'``) Sträng som visas i slutet av utdatatexten om den har avkortats.

source: :class:`TextWrapper` also provides some public methods, analogous to the module-level convenience functions:
sv: :class:`TextWrapper` innehåller också några publika metoder, som motsvarar de praktiska funktionerna på modulnivå:

source: Wraps the single paragraph in *text* (a string) so every line is at most :attr:`width` characters long. All wrapping options are taken from instance attributes of the :class:`TextWrapper` instance. Returns a list of output lines, without final newlines. If the wrapped output has no content, the returned list is empty.
sv: Omsluter det enskilda stycket i *text* (en sträng) så att varje rad är högst :attr:`width` tecken lång. Alla ombrytningsalternativ hämtas från instansattributen i instansen :class:`TextWrapper`. Returnerar en lista med utdatarader, utan avslutande nya linjer. Om det omslutna utdatat inte har något innehåll är den returnerade listan tom.

source: Wraps the single paragraph in *text*, and returns a single string containing the wrapped paragraph.
sv: Omsluter ett stycke med *text* och returnerar en sträng som innehåller det omslutna stycket.

source: placeholder
sv: platshållare
