Repository: yeager/python-docs-sv
Catalog: library/timeit.po
Languages: sv

source: :mod:`!timeit` --- Measure execution time of small code snippets
sv: :mod:`!timeit` --- Mät exekveringstid för små kodsnuttar

source: **Source code:** :source:`Lib/timeit.py`
sv: **Källkod:** :source:`Lib/timeit.py`

source: This module provides a simple way to time small bits of Python code. It has both a :ref:`timeit-command-line-interface` as well as a :ref:`callable <python-interface>` one. It avoids a number of common traps for measuring execution times. See also Tim Peters' introduction to the "Algorithms" chapter in the second edition of *Python Cookbook*, published by O'Reilly.
sv: Denna modul ger ett enkelt sätt att tidsinställa små bitar av Python-kod. Den har både ett :ref:`timeit-command-line-interface` och ett :ref:`callable <python-interface>`. Det undviker ett antal vanliga fällor för att mäta exekveringstider. Se även Tim Peters introduktion till kapitlet "Algorithms" i den andra upplagan av *Python Cookbook*, utgiven av O'Reilly.

source: Basic Examples
sv: Grundläggande exempel

source: The following example shows how the :ref:`timeit-command-line-interface` can be used to compare three different expressions:
sv: Följande exempel visar hur :ref:`timeit-command-line-interface` kan användas för att jämföra tre olika uttryck:

source: This can be achieved from the :ref:`python-interface` with::
sv: Detta kan uppnås från :ref:`python-interface` med::

source: A callable can also be passed from the :ref:`python-interface`::
sv: En anropsbar kan också skickas från :ref:`python-interface`::

source: Note however that :func:`.timeit` will automatically determine the number of repetitions only when the command-line interface is used. In the :ref:`timeit-examples` section you can find more advanced examples.
sv: Observera dock att :func:`.timeit` automatiskt kommer att bestämma antalet repetitioner endast när kommandoradsgränssnittet används. I avsnittet :ref:`timeit-examples` kan du hitta mer avancerade exempel.

source: Python Interface
sv: Python-gränssnitt

source: The module defines three convenience functions and a public class:
sv: Modulen definierar tre bekvämlighetsfunktioner och en publik klass:

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.timeit` method with *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
sv: Skapa en instans av :class:`Timer` med den angivna satsen, *setup*-koden och *timer*-funktionen och kör dess :meth:`.timeit`-metod med *antal* exekveringar. Det valfria argumentet *globals* anger ett namnområde där koden ska exekveras.

source: The optional *globals* parameter was added.
sv: Den valfria parametern *globals* har lagts till.

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.repeat` method with the given *repeat* count and *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
sv: Skapa en instans av :class:`Timer` med den angivna satsen, *setup*-koden och *timer*-funktionen och kör dess :meth:`.repeat`-metod med det angivna *repeat*-antalet och *antalet* exekveringar. Det valfria argumentet *globals* anger ett namnområde där koden ska exekveras.

source: Default value of *repeat* changed from 3 to 5.
sv: Standardvärdet för *repeat* har ändrats från 3 till 5.

source: The default timer, which is always time.perf_counter(), returns float seconds. An alternative, time.perf_counter_ns, returns integer nanoseconds.
sv: Standardtimern, som alltid är time.perf_counter(), returnerar float-sekunder. Ett alternativ, time.perf_counter_ns, returnerar heltalet nanosekunder.

source: :func:`time.perf_counter` is now the default timer.
sv: :func:`time.perf_counter` är nu standardtimern.

source: Class for timing execution speed of small code snippets.
sv: Klass för att mäta exekveringshastigheten för små kodsnuttar.

source: The constructor takes a statement to be timed, an additional statement used for setup, and a timer function. Both statements default to ``'pass'``; the timer function is platform-dependent (see the module doc string). *stmt* and *setup* may also contain multiple statements separated by ``;`` or newlines, as long as they don't contain multi-line string literals. The statement will by default be executed within timeit's namespace; this behavior can be controlled by passing a namespace to *globals*.
sv: Konstruktören tar ett uttalande som ska tidsbestämmas, ett ytterligare uttalande som används för inställning och en timerfunktion. Båda satserna har ``'pass'`` som standard; timerfunktionen är plattformsberoende (se modulens dokumentsträng). *stmt* och *setup* kan också innehålla flera satser åtskilda av ``;`` eller nya rader, så länge de inte innehåller stränglitteraler på flera rader. Satsen kommer som standard att exekveras inom timeits namnrymd; detta beteende kan kontrolleras genom att skicka en namnrymd till *globals*.

source: To measure the execution time of the first statement, use the :meth:`.timeit` method. The :meth:`.repeat` and :meth:`.autorange` methods are convenience methods to call :meth:`.timeit` multiple times.
sv: För att mäta exekveringstiden för den första satsen använder du metoden :meth:`.timeit`. Metoderna :meth:`.repeat` och :meth:`.autorange` är bekvämlighetsmetoder för att anropa :meth:`.timeit` flera gånger.

source: The execution time of *setup* is excluded from the overall timed execution run.
sv: Exekveringstiden för *setup* är exkluderad från den totala tidsbestämda körningen.

source: The *stmt* and *setup* parameters can also take objects that are callable without arguments. This will embed calls to them in a timer function that will then be executed by :meth:`.timeit`. Note that the timing overhead is a little larger in this case because of the extra function calls.
sv: Parametrarna *stmt* och *setup* kan också ta objekt som är anropsbara utan argument. Detta kommer att bädda in anrop till dem i en timerfunktion som sedan kommer att utföras av :meth:`.timeit`. Observera att tidsöverskottet är lite större i det här fallet på grund av de extra funktionsanropen.

source: Time *number* executions of the main statement. This executes the setup statement once, and then returns the time it takes to execute the main statement a number of times. The default timer returns seconds as a float. The argument is the number of times through the loop, defaulting to one million. The main statement, the setup statement and the timer function to be used are passed to the constructor.
sv: Tid *antal* exekveringar av huvudsatsen. Detta exekverar setup-satsen en gång och returnerar sedan den tid det tar att exekvera huvudsatsen ett antal gånger. Standardtimern returnerar sekunder som en flottör. Argumentet är antalet gånger genom slingan, med standardvärdet en miljon. Main-satsen, setup-satsen och den timerfunktion som ska användas skickas till konstruktören.

source: By default, :meth:`.timeit` temporarily turns off :term:`garbage collection` during the timing. The advantage of this approach is that it makes independent timings more comparable. The disadvantage is that GC may be an important component of the performance of the function being measured. If so, GC can be re-enabled as the first statement in the *setup* string. For example::
sv: Som standard stänger :meth:`.timeit` tillfälligt av :term:`garbage collection` under tidtagningen. Fördelen med detta tillvägagångssätt är att det gör oberoende tidtagningar mer jämförbara. Nackdelen är att GC kan vara en viktig komponent i prestandan för den funktion som mäts. Om så är fallet kan GC återaktiveras som det första uttalandet i *setup*-strängen. Till exempel::

source: Automatically determine how many times to call :meth:`.timeit`.
sv: Bestäm automatiskt hur många gånger du ska anropa :meth:`.timeit`.

source: This is a convenience function that calls :meth:`.timeit` repeatedly so that the total time >= 0.2 second, returning the eventual (number of loops, time taken for that number of loops). It calls :meth:`.timeit` with increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the time taken is at least 0.2 seconds.
sv: Detta är en bekvämlighetsfunktion som anropar :meth:`.timeit` upprepade gånger så att den totala tiden >= 0,2 sekunder och returnerar resultatet (antal loopar, tidsåtgång för detta antal loopar). Den anropar :meth:`.timeit` med ökande nummer från sekvensen 1, 2, 5, 10, 20, 50, ... tills den totala tiden är minst 0,2 sekunder.

source: If *callback* is given and is not ``None``, it will be called after each trial with two arguments: ``callback(number, time_taken)``.
sv: Om *callback* anges och inte är ``None``, kommer den att anropas efter varje försök med två argument: ``callback(number, time_taken)``.

source: Call :meth:`.timeit` a few times.
sv: Anropa :meth:`.timeit` några gånger.

source: This is a convenience function that calls the :meth:`.timeit` repeatedly, returning a list of results. The first argument specifies how many times to call :meth:`.timeit`. The second argument specifies the *number* argument for :meth:`.timeit`.
sv: Detta är en bekvämlighetsfunktion som anropar :meth:`.timeit` upprepade gånger och returnerar en lista med resultat. Det första argumentet anger hur många gånger :meth:`.timeit` ska anropas. Det andra argumentet anger *number*-argumentet för :meth:`.timeit`.

source: It's tempting to calculate mean and standard deviation from the result vector and report these. However, this is not very useful. In a typical case, the lowest value gives a lower bound for how fast your machine can run the given code snippet; higher values in the result vector are typically not caused by variability in Python's speed, but by other processes interfering with your timing accuracy. So the :func:`min` of the result is probably the only number you should be interested in. After that, you should look at the entire vector and apply common sense rather than statistics.
sv: Det är frestande att beräkna medelvärde och standardavvikelse från resultatvektorn och rapportera dessa. Detta är dock inte särskilt användbart. I ett typiskt fall ger det lägsta värdet en nedre gräns för hur snabbt din maskin kan köra det givna kodavsnittet; högre värden i resultatvektorn orsakas vanligtvis inte av variabilitet i Pythons hastighet, utan av andra processer som stör din tidsnoggrannhet. Så :func:`min` av resultatet är förmodligen det enda talet du bör vara intresserad av. Efter det bör du titta på hela vektorn och tillämpa sunt förnuft snarare än statistik.

source: Helper to print a traceback from the timed code.
sv: Hjälpmedel för att skriva ut en traceback från den tidsinställda koden.

source: Typical use::
sv: Typisk användning::

source: The advantage over the standard traceback is that source lines in the compiled template will be displayed. The optional *file* argument directs where the traceback is sent; it defaults to :data:`sys.stderr`.
sv: Fördelen jämfört med standardtraceback är att källkodsrader i den kompilerade mallen visas. Det valfria argumentet *file* anger vart spårningen ska skickas; standardvärdet är :data:`sys.stderr`.

source: Command-Line Interface
sv: Kommandoradsgränssnitt

source: When called as a program from the command line, the following form is used::
sv: När ett program anropas från kommandoraden används följande form::

source: Where the following options are understood:
sv: Där följande alternativ förstås:

source: how many times to execute 'statement'
sv: hur många gånger ska "statement" utföras

source: how many times to repeat the timer (default 5)
sv: hur många gånger timern ska upprepas (standard 5)

source: statement to be executed once initially (default ``pass``)
sv: uttalande som ska köras en gång initialt (standard ``pass``)

source: measure process time, not wallclock time, using :func:`time.process_time` instead of :func:`time.perf_counter`, which is the default
sv: mäta processtid, inte väggklocktid, med :func:`time.process_time` istället för :func:`time.perf_counter`, som är standard

source: specify a time unit for timer output; can select ``nsec``, ``usec``, ``msec``, or ``sec``
sv: ange en tidsenhet för timerutmatning; kan välja ``nsec``, ``usec``, ``msec`` eller ``sec``

source: print raw timing results; repeat for more digits precision
sv: skriv ut råa tidsresultat; upprepa för fler siffror precision

source: print a short usage message and exit
sv: skriva ut ett kort användarmeddelande och avsluta

source: A multi-line statement may be given by specifying each line as a separate statement argument; indented lines are possible by enclosing an argument in quotes and using leading spaces. Multiple :option:`-s` options are treated similarly.
sv: Ett uttalande med flera rader kan anges genom att specificera varje rad som ett separat uttalandeargument; indragna rader är möjliga genom att omsluta ett argument med citattecken och använda inledande mellanslag. Flera :option:`-s`-alternativ behandlas på liknande sätt.

source: If :option:`-n` is not given, a suitable number of loops is calculated by trying increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the total time is at least 0.2 seconds.
sv: Om :option:`-n` inte anges, beräknas ett lämpligt antal loopar genom att prova ökande antal från sekvensen 1, 2, 5, 10, 20, 50, ... tills den totala tiden är minst 0,2 sekunder.

source: :func:`default_timer` measurements can be affected by other programs running on the same machine, so the best thing to do when accurate timing is necessary is to repeat the timing a few times and use the best time. The :option:`-r` option is good for this; the default of 5 repetitions is probably enough in most cases. You can use :func:`time.process_time` to measure CPU time.
sv: :func:`default_timer` mätningar kan påverkas av andra program som körs på samma maskin, så det bästa man kan göra när exakt tidtagning är nödvändig är att upprepa tidtagningen några gånger och använda den bästa tiden. Alternativet :option:`-r` är bra för detta; standardvärdet 5 repetitioner är förmodligen tillräckligt i de flesta fall. Du kan använda :func:`time.process_time` för att mäta CPU-tiden.

source: There is a certain baseline overhead associated with executing a pass statement. The code here doesn't try to hide it, but you should be aware of it. The baseline overhead can be measured by invoking the program without arguments, and it might differ between Python versions.
sv: Det finns en viss baseline overhead förknippad med att köra en pass-sats. Koden här försöker inte dölja det, men du bör vara medveten om det. Den grundläggande kostnaden kan mätas genom att anropa programmet utan argument, och den kan skilja sig mellan olika Python-versioner.

source: Examples
sv: Exempel

source: It is possible to provide a setup statement that is executed only once at the beginning:
sv: Det är möjligt att tillhandahålla en setup-sats som bara körs en gång i början:

source: In the output, there are three fields. The loop count, which tells you how many times the statement body was run per timing loop repetition. The repetition count ('best of 5') which tells you how many times the timing loop was repeated, and finally the time the statement body took on average within the best repetition of the timing loop. That is, the time the fastest repetition took divided by the loop count.
sv: I utdata finns det tre fält. Loopantalet, som visar hur många gånger satsen kördes per repetition av tidtagningsslingan. Upprepningsantalet ("bäst av 5"), som visar hur många gånger tidtagningsslingan upprepades, och slutligen den tid som satsen i genomsnitt tog i den bästa upprepningen av tidtagningsslingan. Det vill säga den tid som den snabbaste upprepningen tog dividerat med loopantalet.

source: The same can be done using the :class:`Timer` class and its methods::
sv: Detsamma kan göras med hjälp av klassen :class:`Timer` och dess metoder::

source: The following examples show how to time expressions that contain multiple lines. Here we compare the cost of using :func:`hasattr` vs. :keyword:`try`/:keyword:`except` to test for missing and present object attributes:
sv: Följande exempel visar hur man tidsbestämmer uttryck som innehåller flera rader. Här jämför vi kostnaden för att använda :func:`hasattr` jämfört med :keyword:`try`/:keyword:`except` för att testa om objektattribut saknas eller finns:

source: To give the :mod:`timeit` module access to functions you define, you can pass a *setup* parameter which contains an import statement::
sv: För att ge modulen :mod:`timeit` tillgång till funktioner som du definierar kan du skicka en *setup*-parameter som innehåller en importförklaring::

source: Another option is to pass :func:`globals` to the *globals* parameter, which will cause the code to be executed within your current global namespace. This can be more convenient than individually specifying imports::
sv: Ett annat alternativ är att skicka :func:`globals` till parametern *globals*, vilket gör att koden exekveras inom ditt aktuella globala namnområde. Detta kan vara mer praktiskt än att individuellt ange imports::

source: Performance
sv: Prestanda
