Repository: yeager/python-docs-sv
Catalog: library/time.po
Languages: sv

source: :mod:`!time` --- Time access and conversions
sv: :mod:`!time` --- Tidsåtkomst och konvertering

source: This module provides various time-related functions. For related functionality, see also the :mod:`datetime` and :mod:`calendar` modules.
sv: Denna modul tillhandahåller olika tidsrelaterade funktioner. För relaterade funktioner, se även modulerna :mod:`datetime` och :mod:`calendar`.

source: Although this module is always available, not all functions are available on all platforms. Most of the functions defined in this module call platform C library functions with the same name. It may sometimes be helpful to consult the platform documentation, because the semantics of these functions varies among platforms.
sv: Även om den här modulen alltid är tillgänglig, är inte alla funktioner tillgängliga på alla plattformar. De flesta av de funktioner som definieras i den här modulen anropar funktioner i plattformens C-bibliotek med samma namn. Ibland kan det vara bra att läsa i plattformsdokumentationen, eftersom semantiken för dessa funktioner varierar mellan olika plattformar.

source: An explanation of some terminology and conventions is in order.
sv: En förklaring av viss terminologi och vissa konventioner är på sin plats.

source: The :dfn:`epoch` is the point where the time starts, the return value of ``time.gmtime(0)``. It is January 1, 1970, 00:00:00 (UTC) on all platforms.
sv: :dfn:`epoch` är den punkt där tiden startar, returvärdet för ``time.gmtime(0)``. Det är den 1 januari 1970, 00:00:00 (UTC) på alla plattformar.

source: The term :dfn:`seconds since the epoch` refers to the total number of elapsed seconds since the epoch, typically excluding `leap seconds`_. Leap seconds are excluded from this total on all POSIX-compliant platforms.
sv: Termen :dfn:`sekunder sedan epoken` avser det totala antalet sekunder som förflutit sedan epoken, vanligtvis exklusive `skottsekunder`_. Skottsekunder är exkluderade från denna summa på alla POSIX-kompatibla plattformar.

source: The functions in this module may not handle dates and times before the epoch_ or far in the future. The cut-off point in the future is determined by the C library; for 32-bit systems, it is typically in 2038.
sv: Funktionerna i denna modul kan inte hantera datum och tider före epoch_ eller långt in i framtiden. Brytpunkten i framtiden bestäms av C-biblioteket; för 32-bitars system är den vanligtvis år 2038.

source: Function :func:`strptime` can parse 2-digit years when given ``%y`` format code. When 2-digit years are parsed, they are converted according to the POSIX and ISO C standards: values 69--99 are mapped to 1969--1999, and values 0--68 are mapped to 2000--2068.
sv: Funktionen :func:`strptime` kan tolka 2-siffriga årtal när den ges formatkoden ``%y``. När 2-siffriga årtal analyseras konverteras de enligt POSIX- och ISO C-standarderna: värdena 69--99 mappas till 1969--1999 och värdena 0--68 mappas till 2000--2068.

source: UTC is `Coordinated Universal Time`_ and superseded `Greenwich Mean Time`_ or GMT as the basis of international timekeeping. The acronym UTC is not a mistake but conforms to an earlier, language-agnostic naming scheme for time standards such as UT0, UT1, and UT2.
sv: UTC är "Coordinated Universal Time" och ersatte "Greenwich Mean Time" eller GMT som grund för internationell tidtagning. Akronymen UTC är inte ett misstag utan en följd av ett tidigare, språkagnostiskt namngivningssystem för tidsstandarder som UT0, UT1 och UT2.

source: DST is Daylight Saving Time, an adjustment of the timezone by (usually) one hour during part of the year. DST rules are magic (determined by local law) and can change from year to year. The C library has a table containing the local rules (often it is read from a system file for flexibility) and is the only source of True Wisdom in this respect.
sv: DST är Daylight Saving Time, en justering av tidszonen med (vanligtvis) en timme under en del av året. Reglerna för sommartid är magiska (bestäms av lokala lagar) och kan ändras från år till år. C-biblioteket har en tabell som innehåller de lokala reglerna (ofta läses den från en systemfil för flexibilitetens skull) och är den enda källan till sann visdom i detta avseende.

source: The precision of the various real-time functions may be less than suggested by the units in which their value or argument is expressed. E.g. on most Unix systems, the clock "ticks" only 50 or 100 times a second.
sv: Precisionen i de olika realtidsfunktionerna kan vara lägre än vad som framgår av de enheter som deras värde eller argument uttrycks i. På de flesta Unix-system "tickar" t.ex. klockan bara 50 eller 100 gånger per sekund.

source: On the other hand, the precision of :func:`.time` and :func:`sleep` is better than their Unix equivalents: times are expressed as floating-point numbers, :func:`.time` returns the most accurate time available (using Unix :c:func:`!gettimeofday` where available), and :func:`sleep` will accept a time with a nonzero fraction (Unix :c:func:`!select` is used to implement this, where available).
sv: Å andra sidan är precisionen i :func:`.time` och :func:`sleep` bättre än deras motsvarigheter i Unix: tider uttrycks som flyttal, :func:`.time` returnerar den mest exakta tillgängliga tiden (med hjälp av Unix :c:func:`!gettimeofday` där det är tillgängligt), och :func:`sleep` accepterar en tid med en fraktion som inte är noll (Unix :c:func:`!select` används för att implementera detta, där det är tillgängligt).

source: The time value as returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`, and accepted by :func:`asctime`, :func:`mktime` and :func:`strftime`, is a sequence of 9 integers. The return values of :func:`gmtime`, :func:`localtime`, and :func:`strptime` also offer attribute names for individual fields.
sv: Tidsvärdet som returneras av :func:`gmtime`, :func:`localtime`, och :func:`strptime`, och accepteras av :func:`asctime`, :func:`mktime` och :func:`strftime`, är en sekvens av 9 heltal. Returvärdena för :func:`gmtime`, :func:`localtime` och :func:`strptime` ger också attributnamn för enskilda fält.

source: See :class:`struct_time` for a description of these objects.
sv: Se :class:`struct_time` för en beskrivning av dessa objekt.

source: The :class:`struct_time` type was extended to provide the :attr:`~struct_time.tm_gmtoff` and :attr:`~struct_time.tm_zone` attributes when platform supports corresponding ``struct tm`` members.
sv: Typen :class:`struct_time` utökades för att tillhandahålla attributen :attr:`~struct_time.tm_gmtoff` och :attr:`~struct_time.tm_zone` när plattformen stöder motsvarande ``struct tm``-medlemmar.

source: The :class:`struct_time` attributes :attr:`~struct_time.tm_gmtoff` and :attr:`~struct_time.tm_zone` are now available on all platforms.
sv: Attributen :class:`struct_time` :attr:`~struct_time.tm_gmtoff` och :attr:`~struct_time.tm_zone` är nu tillgängliga på alla plattformar.

source: Use the following functions to convert between time representations:
sv: Använd följande funktioner för att konvertera mellan olika tidsangivelser:

source: From
sv: Från

source: To
sv: Till

source: Use
sv: Använd

source: seconds since the epoch
sv: sekunder sedan epoken

source: :class:`struct_time` in UTC
sv: :class:`struct_time` i UTC

source: :class:`struct_time` in local time
sv: :class:`struct_time` i lokal tid

source: :func:`localtime`
sv: :func:`lokaltid`

source: :func:`calendar.timegm`
sv: :func:`kalender.timegm`

source: Functions
sv: Funktioner

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string of the following form: ``'Sun Jun 20 23:21:05 1993'``. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
sv: Konverterar en tuple eller :class:`struct_time` som representerar en tid som returneras av :func:`gmtime` eller :func:`localtime` till en sträng av följande form: ``'Sun Jun 20 23:21:05 1993'``. Dagfältet är två tecken långt och fylls på med mellanslag om dagen är en ensiffrig siffra, t.ex: ``'Wed Jun 9 04:26:40 1993'``.

source: If *t* is not provided, the current time as returned by :func:`localtime` is used. Locale information is not used by :func:`asctime`.
sv: Om *t* inte anges används den aktuella tiden som returneras av :func:`localtime`. Information om lokal tid används inte av :func:`asctime`.

source: Unlike the C function of the same name, :func:`asctime` does not add a trailing newline.
sv: Till skillnad från C-funktionen med samma namn lägger :func:`asctime` inte till någon efterföljande ny rad.

source: Return the *clk_id* of the thread-specific CPU-time clock for the specified *thread_id*.
sv: Returnerar *clk_id* för den trådspecifika CPU-tidsklockan för den angivna *thread_id*.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
sv: Använd :func:`threading.get_ident` eller attributet :attr:`~threading.Thread.ident` i :class:`threading.Thread`-objekt för att få ett lämpligt värde för *thread_id*.

source: Passing an invalid or expired *thread_id* may result in undefined behavior, such as segmentation fault.
sv: Om du skickar ett ogiltigt eller föråldrat *thread_id* kan det leda till odefinierat beteende, t.ex. segmenteringsfel.

source: Availability
sv: Tillgänglighet

source: See the man page for :manpage:`pthread_getcpuclockid(3)` for further information.
sv: Se man-sidan för :manpage:`pthread_getcpuclockid(3)` för ytterligare information.

source: Return the resolution (precision) of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
sv: Returnerar upplösningen (precisionen) för den angivna klockan *clk_id*. Se :ref:`time-clock-id-constants` för en lista över accepterade värden för *clk_id*.

source: Return the time of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
sv: Returnerar tiden för den angivna klockan *clk_id*. Se :ref:`time-clock-id-constants` för en lista över accepterade värden för *clk_id*.

source: Use :func:`clock_gettime_ns` to avoid the precision loss caused by the :class:`float` type.
sv: Använd :func:`clock_gettime_ns` för att undvika den precisionsförlust som orsakas av typen :class:`float`.

source: Similar to :func:`clock_gettime` but return time as nanoseconds.
sv: Liknar :func:`clock_gettime` men returnerar tid som nanosekunder.

source: Set the time of the specified clock *clk_id*. Currently, :data:`CLOCK_REALTIME` is the only accepted value for *clk_id*.
sv: Ställer in tiden för den angivna klockan *clk_id*. För närvarande är :data:`CLOCK_REALTIME` det enda accepterade värdet för *clk_id*.

source: Use :func:`clock_settime_ns` to avoid the precision loss caused by the :class:`float` type.
sv: Använd :func:`clock_settime_ns` för att undvika den precisionsförlust som orsakas av typen :class:`float`.

source: Similar to :func:`clock_settime` but set time with nanoseconds.
sv: Liknar :func:`clock_settime` men ställer in tiden med nanosekunder.

source: Convert a time expressed in seconds since the epoch_ to a string of a form: ``'Sun Jun 20 23:21:05 1993'`` representing local time. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
sv: Konverterar en tid uttryckt i sekunder sedan epoch_ till en sträng av formen: ``'Sun Jun 20 23:21:05 1993'`` som representerar lokal tid. Dagfältet är två tecken långt och fylls på med mellanslag om dagen är en siffra, t.ex: ``'Wed Jun 9 04:26:40 1993'``.

source: If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. ``ctime(secs)`` is equivalent to ``asctime(localtime(secs))``. Locale information is not used by :func:`ctime`.
sv: Om *secs* inte anges eller om :const:`None`, används den aktuella tid som returneras av :func:`.time`. ``ctime(secs)`` är ekvivalent med ``asctime(localtime(secs))``. Information om lokal tid används inte av :func:`ctime`.

source: Get information on the specified clock as a namespace object. Supported clock names and the corresponding functions to read their value are:
sv: Hämta information om den angivna klockan som ett namnrymdsobjekt. Klocknamn som stöds och motsvarande funktioner för att läsa deras värde är:

source: ``'time'``: :func:`time.time`
sv: ``'tid'``: :func:`tid.tid`

source: The result has the following attributes:
sv: Resultatet har följande egenskaper:

source: *adjustable*: ``True`` if the clock can be changed automatically (e.g. by a NTP daemon) or manually by the system administrator, ``False`` otherwise
sv: *justerbar*: ``True`` om klockan kan ändras automatiskt (t.ex. av en NTP-daemon) eller manuellt av systemadministratören, ``False`` annars

source: *implementation*: The name of the underlying C function used to get the clock value. Refer to :ref:`time-clock-id-constants` for possible values.
sv: *implementation*: Namnet på den underliggande C-funktion som används för att hämta klockvärdet. Se :ref:`time-clock-id-constants` för möjliga värden.

source: *monotonic*: ``True`` if the clock cannot go backward, ``False`` otherwise
sv: *monotonisk*: ``True`` om klockan inte kan gå baklänges, ``False`` annars

source: *resolution*: The resolution of the clock in seconds (:class:`float`)
sv: *upplösning*: Klockans upplösning i sekunder (:class:`float`)

source: Convert a time expressed in seconds since the epoch_ to a :class:`struct_time` in UTC in which the dst flag is always zero. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. Fractions of a second are ignored. See above for a description of the :class:`struct_time` object. See :func:`calendar.timegm` for the inverse of this function.
sv: Konverterar en tid uttryckt i sekunder sedan epoch_ till en :class:`struct_time` i UTC där dst-flaggan alltid är noll. Om *secs* inte anges eller :const:`None`, används den aktuella tiden som returneras av :func:`.time`. Bråkdelar av en sekund ignoreras. Se ovan för en beskrivning av :class:`struct_time`-objektet. Se :func:`calendar.timegm` för inversen av denna funktion.

source: Like :func:`gmtime` but converts to local time. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. The dst flag is set to ``1`` when DST applies to the given time.
sv: Som :func:`gmtime` men konverterar till lokal tid. Om *secs* inte anges eller :const:`None`, används den aktuella tiden som returneras av :func:`.time`. Flaggan dst sätts till ``1`` när sommartid gäller för den angivna tiden.

source: :func:`localtime` may raise :exc:`OverflowError`, if the timestamp is outside the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years between 1970 and 2038.
sv: :func:`localtime` kan ge upphov till :exc:`OverflowError`, om tidsstämpeln ligger utanför det värdeintervall som stöds av plattform C :c:func:`localtime` eller :c:func:`gmtime` funktionerna, och :exc:`OSError` om :c:func:`localtime` eller :c:func:`gmtime` misslyckas. Det är vanligt att detta är begränsat till år mellan 1970 och 2038.

source: This is the inverse function of :func:`localtime`. Its argument is the :class:`struct_time` or full 9-tuple (since the dst flag is needed; use ``-1`` as the dst flag if it is unknown) which expresses the time in *local* time, not UTC. It returns a floating-point number, for compatibility with :func:`.time`. If the input value cannot be represented as a valid time, either :exc:`OverflowError` or :exc:`ValueError` will be raised (which depends on whether the invalid value is caught by Python or the underlying C libraries). The earliest date for which it can generate a time is platform-dependent.
sv: Detta är den omvända funktionen av :func:`localtime`. Dess argument är :class:`struct_time` eller en fullständig 9-tupel (eftersom dst-flaggan behövs; använd ``-1`` som dst-flagga om den är okänd) som uttrycker tiden i *lokal* tid, inte UTC. Den returnerar ett flyttal, för kompatibilitet med :func:`.time`. Om inmatningsvärdet inte kan representeras som en giltig tid, kommer antingen :exc:`OverflowError` eller :exc:`ValueError` att tas upp (vilket beror på om det ogiltiga värdet fångas upp av Python eller de underliggande C-biblioteken). Det tidigaste datumet för vilket den kan generera en tid är plattformsberoende.

source: Return the value (in fractional seconds) of a monotonic clock, i.e. a clock that cannot go backwards. The clock is not affected by system clock updates. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
sv: Returnerar värdet (i bråkdelar av sekunder) för en monoton klocka, dvs. en klocka som inte kan gå baklänges. Klockan påverkas inte av uppdateringar av systemklockan. Referenspunkten för det returnerade värdet är odefinierad, så att endast skillnaden mellan resultaten av två anrop är giltig.

source: Clock:
sv: Klockan:

source: On Windows, call ``QueryPerformanceCounter()`` and ``QueryPerformanceFrequency()``.
sv: I Windows anropar du ``QueryPerformanceCounter()`` och ``QueryPerformanceFrequency()``.

source: On macOS, call ``mach_absolute_time()`` and ``mach_timebase_info()``.
sv: På macOS, anropa ``mach_absolute_time()`` och ``mach_timebase_info()``.

source: On HP-UX, call ``gethrtime()``.
sv: På HP-UX anropar du ``gethrtime()``.

source: Call ``clock_gettime(CLOCK_HIGHRES)`` if available.
sv: Anropa ``clock_gettime(CLOCK_HIGHRES)`` om tillgängligt.

source: Otherwise, call ``clock_gettime(CLOCK_MONOTONIC)``.
sv: I annat fall anropa ``clock_gettime(CLOCK_MONOTONIC)``.

source: Use :func:`monotonic_ns` to avoid the precision loss caused by the :class:`float` type.
sv: Använd :func:`monotonic_ns` för att undvika den precisionsförlust som orsakas av typen :class:`float`.

source: The function is now always available and the clock is now the same for all processes.
sv: Funktionen är nu alltid tillgänglig och klockan är nu densamma för alla processer.

source: On macOS, the clock is now the same for all processes.
sv: På macOS är klockan nu densamma för alla processer.

source: Similar to :func:`monotonic`, but return time as nanoseconds.
sv: Liknar :func:`monotonic`, men returnerar tid som nanosekunder.

source: Return the value (in fractional seconds) of a performance counter, i.e. a clock with the highest available resolution to measure a short duration. It does include time elapsed during sleep. The clock is the same for all processes. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
sv: Returnerar värdet (i bråkdelar av sekunder) för en prestandaräknare, dvs. en klocka med högsta möjliga upplösning för att mäta en kort tid. Det inkluderar tid som förflutit under sömn. Klockan är densamma för alla processer. Referenspunkten för det returnerade värdet är odefinierad, vilket innebär att endast skillnaden mellan resultaten av två anrop är giltig.

source: On CPython, use the same clock as :func:`time.monotonic` and is a monotonic clock, i.e. a clock that cannot go backwards.
sv: I CPython används samma klocka som :func:`time.monotonic` och är en monoton klocka, dvs. en klocka som inte kan gå baklänges.

source: Use :func:`perf_counter_ns` to avoid the precision loss caused by the :class:`float` type.
sv: Använd :func:`perf_counter_ns` för att undvika den precisionsförlust som orsakas av typen :class:`float`.

source: On Windows, the clock is now the same for all processes.
sv: I Windows är klockan nu densamma för alla processer.

source: Use the same clock as :func:`time.monotonic`.
sv: Använd samma klocka som :func:`time.monotonic`.

source: Similar to :func:`perf_counter`, but return time as nanoseconds.
sv: Liknar :func:`perf_counter`, men returnerar tid som nanosekunder.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current process. It does not include time elapsed during sleep. It is process-wide by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
sv: Returnerar värdet (i bråkdelar av sekunder) av summan av systemets och användarens CPU-tid för den aktuella processen. Den inkluderar inte tid som förflutit under vila. Den är processomfattande per definition. Referenspunkten för det returnerade värdet är odefinierad, vilket innebär att endast skillnaden mellan resultaten av två anrop är giltig.

source: Use :func:`process_time_ns` to avoid the precision loss caused by the :class:`float` type.
sv: Använd :func:`process_time_ns` för att undvika den precisionsförlust som orsakas av typen :class:`float`.

source: Similar to :func:`process_time` but return time as nanoseconds.
sv: Liknar :func:`process_time` men returnerar tid som nanosekunder.

source: Suspend execution of the calling thread for the given number of seconds. The argument may be a floating-point number to indicate a more precise sleep time.
sv: Avbryter exekveringen av den anropande tråden under det angivna antalet sekunder. Argumentet kan vara ett flyttal för att ange en mer exakt sömntid.

source: If the sleep is interrupted by a signal and no exception is raised by the signal handler, the sleep is restarted with a recomputed timeout.
sv: Om viloläget avbryts av en signal och inget undantag utlöses av signalhanteraren, startas viloläget om med en nyberäknad timeout.

source: The suspension time may be longer than requested by an arbitrary amount, because of the scheduling of other activity in the system.
sv: Avstängningstiden kan vara längre än vad som begärts med ett godtyckligt belopp, på grund av schemaläggningen av annan aktivitet i systemet.

source: Windows implementation
sv: Implementering i Windows

source: On Windows, if *secs* is zero, the thread relinquishes the remainder of its time slice to any other thread that is ready to run. If there are no other threads ready to run, the function returns immediately, and the thread continues execution. On Windows 8.1 and newer the implementation uses a `high-resolution timer <https://learn.microsoft.com/windows-hardware/drivers/kernel/high-resolution-timers>`_ which provides resolution of 100 nanoseconds. If *secs* is zero, ``Sleep(0)`` is used.
sv: Om *secs* är noll i Windows överlåter tråden återstoden av sin tidsandel till någon annan tråd som är redo att köra. Om det inte finns några andra trådar som är redo att köras returneras funktionen omedelbart och tråden fortsätter att köras. På Windows 8.1 och senare använder implementeringen en "högupplöst timer" <https://learn.microsoft.com/windows-hardware/drivers/kernel/high-resolution-timers>`_ som ger en upplösning på 100 nanosekunder. Om *secs* är noll används ``Sleep(0)``.

source: Unix implementation
sv: Unix-implementering

source: Use ``clock_nanosleep()`` if available (resolution: 1 nanosecond);
sv: Använd ``clock_nanosleep()`` om det finns tillgängligt (upplösning: 1 nanosekund);

source: Or use ``nanosleep()`` if available (resolution: 1 nanosecond);
sv: Eller använd ``nanosleep()`` om det finns tillgängligt (upplösning: 1 nanosekund);

source: Or use ``select()`` (resolution: 1 microsecond).
sv: Eller använd ``select()`` (upplösning: 1 mikrosekund).

source: To emulate a "no-op", use :keyword:`pass` instead of ``time.sleep(0)``.
sv: För att efterlikna en "no-op", använd :keyword:`pass` istället för ``time.sleep(0)``.
