Repository: yeager/python-docs-sv
Catalog: library/time.po
Languages: sv

source: On many Unix systems (including \*BSD, Linux, Solaris, and Darwin), it is more convenient to use the system's zoneinfo (:manpage:`tzfile(5)`) database to specify the timezone rules. To do this, set the :envvar:`TZ` environment variable to the path of the required timezone datafile, relative to the root of the systems 'zoneinfo' timezone database, usually located at :file:`/usr/share/zoneinfo`. For example, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` or ``'Europe/Amsterdam'``. ::
sv: På många Unix-system (inklusive \*BSD, Linux, Solaris och Darwin) är det mer praktiskt att använda systemets zoninfo-databas (:manpage:`tzfile(5)`) för att ange tidszonsreglerna. Detta gör du genom att ställa in miljövariabeln :envvar:`TZ` till sökvägen för den önskade tidszonsdatafilen, i förhållande till roten för systemets tidszonsdatabas 'zoneinfo', som vanligtvis finns i :file:`/usr/share/zoneinfo`. Till exempel ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` eller ``'Europe/Amsterdam'``. ::

source: >>> os.environ['TZ'] = 'US/Eastern' >>> time.tzset() >>> time.tzname ('EST', 'EDT') >>> os.environ['TZ'] = 'Egypt' >>> time.tzset() >>> time.tzname ('EET', 'EEST')
sv: >>> os.environ['TZ'] = 'US/Eastern' >>> tid.tzset() >>> tid.tznamn ('EST', 'EDT') >>> os.environ['TZ'] = 'Egypten' >>> tid.tzset() >>> tid.tznamn ('EET', 'EEST')

source: Clock ID Constants
sv: Klock-ID-konstanter

source: These constants are used as parameters for :func:`clock_getres` and :func:`clock_gettime`.
sv: Dessa konstanter används som parametrar för :func:`clock_getres` och :func:`clock_gettime`.

source: Identical to :data:`CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
sv: Identisk med :data:`CLOCK_MONOTONIC`, förutom att den även inkluderar all tid då systemet är avstängt.

source: This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of :data:`CLOCK_REALTIME`, which may have discontinuities if the time is changed using ``settimeofday()`` or similar.
sv: Detta gör det möjligt för program att få en monoton klocka med suspensionsmedvetenhet utan att behöva hantera komplikationerna med :data:`CLOCK_REALTIME`, som kan ha diskontinuiteter om tiden ändras med ``settimeofday()`` eller liknande.

source: The Solaris OS has a ``CLOCK_HIGHRES`` timer that attempts to use an optimal hardware source, and may give close to nanosecond resolution. ``CLOCK_HIGHRES`` is the nonadjustable, high-resolution clock.
sv: Solaris OS har en ``CLOCK_HIGHRES``-timer som försöker använda en optimal maskinvarukälla och kan ge en upplösning som ligger nära nanosekunder. ``CLOCK_HIGHRES`` är den icke justerbara, högupplösta klockan.

source: Clock that cannot be set and represents monotonic time since some unspecified starting point.
sv: Klocka som inte kan ställas in och som representerar monoton tid sedan någon ospecificerad startpunkt.

source: Similar to :data:`CLOCK_MONOTONIC`, but provides access to a raw hardware-based time that is not subject to NTP adjustments.
sv: Liknar :data:`CLOCK_MONOTONIC`, men ger tillgång till en rå hårdvarubaserad tid som inte är föremål för NTP-justeringar.

source: Similar to :data:`CLOCK_MONOTONIC_RAW`, but reads a value cached by the system at context switch and hence has less accuracy.
sv: Liknar :data:`CLOCK_MONOTONIC_RAW`, men läser ett värde som cachas av systemet vid kontextbyte och har därför mindre noggrannhet.

source: High-resolution per-process timer from the CPU.
sv: Högupplösta timer per process från CPU.

source: `International Atomic Time <https://www.nist.gov/pml/time-and-frequency-division/how-utcnist-related-coordinated-universal-time-utc-international>`_
sv: `Internationell atomtid <https://www.nist.gov/pml/time-and-frequency-division/how-utcnist-related-coordinated-universal-time-utc-international>`_

source: The system must have a current leap second table in order for this to give the correct answer. PTP or NTP software can maintain a leap second table.
sv: Systemet måste ha en aktuell skottsekundstabell för att detta ska ge rätt svar. PTP- eller NTP-programvara kan upprätthålla en skottsekundstabell.

source: Thread-specific CPU-time clock.
sv: Trådspecifik CPU-tidsklocka.

source: Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement, both absolute and interval.
sv: Tid vars absoluta värde är den tid som systemet har varit igång och inte avbrutits, vilket ger en exakt mätning av drifttiden, både absolut och i intervall.

source: Clock that increments monotonically, tracking the time since an arbitrary point, unaffected by frequency or time adjustments and not incremented while the system is asleep.
sv: Klocka som ökar monotont och registrerar tiden sedan en godtycklig punkt, som inte påverkas av frekvens- eller tidsjusteringar och som inte ökar när systemet är i viloläge.

source: Like :data:`CLOCK_UPTIME_RAW`, but the value is cached by the system at context switches and therefore has less accuracy.
sv: Som :data:`CLOCK_UPTIME_RAW`, men värdet cachas av systemet vid kontextbyten och är därför mindre exakt.

source: The following constant is the only parameter that can be sent to :func:`clock_settime`.
sv: Följande konstant är den enda parameter som kan skickas till :func:`clock_settime`.

source: Real-time clock. Setting this clock requires appropriate privileges. The clock is the same for all processes.
sv: Klocka i realtid. För att ställa in denna klocka krävs lämpliga behörigheter. Klockan är densamma för alla processer.

source: Timezone Constants
sv: Konstanter för tidszon

source: The offset of the local DST timezone, in seconds west of UTC, if one is defined. This is negative if the local DST timezone is east of UTC (as in Western Europe, including the UK). Only use this if ``daylight`` is nonzero. See note below.
sv: Förskjutningen av den lokala DST-tidszonen, i sekunder väster om UTC, om en sådan har definierats. Detta är negativt om den lokala tidszonen för sommartid är öster om UTC (som i Västeuropa, inklusive Storbritannien). Använd endast detta om ``daylight`` är icke-noll. Se anmärkning nedan.

source: Nonzero if a DST timezone is defined. See note below.
sv: Nonzero om en DST-tidszon har definierats. Se anmärkning nedan.

source: The offset of the local (non-DST) timezone, in seconds west of UTC (negative in most of Western Europe, positive in the US, zero in the UK). See note below.
sv: Förskjutningen av den lokala (icke-DST) tidszonen, i sekunder väster om UTC (negativ i större delen av Västeuropa, positiv i USA, noll i Storbritannien). Se anmärkning nedan.

source: A tuple of two strings: the first is the name of the local non-DST timezone, the second is the name of the local DST timezone. If no DST timezone is defined, the second string should not be used. See note below.
sv: En tupel av två strängar: den första är namnet på den lokala tidszonen som inte är DST, den andra är namnet på den lokala tidszonen som är DST. Om ingen DST-tidszon är definierad ska den andra strängen inte användas. Se anmärkning nedan.

source: For the above Timezone constants (:data:`altzone`, :data:`daylight`, :data:`timezone`, and :data:`tzname`), the value is determined by the timezone rules in effect at module load time or the last time :func:`tzset` is called and may be incorrect for times in the past. It is recommended to use the :attr:`~struct_time.tm_gmtoff` and :attr:`~struct_time.tm_zone` results from :func:`localtime` to obtain timezone information.
sv: För ovanstående tidszonskonstanter (:data:`altzone`, :data:`daylight`, :data:`timezone` och :data:`tzname`) bestäms värdet av de tidszonsregler som gäller när modulen laddas eller när :func:`tzset` senast anropas och kan vara felaktiga för tidigare tidpunkter. Det rekommenderas att använda resultaten :attr:`~struct_time.tm_gmtoff` och :attr:`~struct_time.tm_zone` från :func:`localtime` för att få information om tidszon.

source: Module :mod:`datetime`
sv: Modul :mod:`datetime`

source: More object-oriented interface to dates and times.
sv: Mer objektorienterat gränssnitt för datum och klockslag.

source: Module :mod:`locale`
sv: Modul :mod:`locale`

source: Internationalization services. The locale setting affects the interpretation of many format specifiers in :func:`strftime` and :func:`strptime`.
sv: Tjänster för internationalisering. Lokalinställningen påverkar tolkningen av många formatspecifikatorer i :func:`strftime` och :func:`strptime`.

source: Module :mod:`calendar`
sv: Modul :mod:`kalender`

source: General calendar-related functions. :func:`~calendar.timegm` is the inverse of :func:`gmtime` from this module.
sv: Allmänna kalenderrelaterade funktioner. :func:`~calendar.timegm` är inversen av :func:`gmtime` från denna modul.

source: Footnotes
sv: Fotnoter

source: The use of ``%Z`` is now deprecated, but the ``%z`` escape that expands to the preferred hour/minute offset is not supported by all ANSI C libraries. Also, a strict reading of the original 1982 :rfc:`822` standard calls for a two-digit year (``%y`` rather than ``%Y``), but practice moved to 4-digit years long before the year 2000. After that, :rfc:`822` became obsolete and the 4-digit year has been first recommended by :rfc:`1123` and then mandated by :rfc:`2822`.
sv: Användningen av ``%Z`` är nu föråldrad, men ``%z`` escapen som expanderar till den önskade tim/minutförskjutningen stöds inte av alla ANSI C-bibliotek. En strikt läsning av den ursprungliga standarden :rfc:`822` från 1982 kräver också ett tvåsiffrigt år (``%y`` i stället för ``%Y``), men praxis övergick till fyrsiffriga år långt före år 2000. Efter det blev :rfc:`822` föråldrad och det fyrsiffriga året har först rekommenderats av :rfc:`1123` och sedan påbjudits av :rfc:`2822`.

source: epoch
sv: epok

source: Year 2038
sv: År 2038

source: 2-digit years
sv: 2-siffriga år

source: Coordinated Universal Time
sv: Koordinerad universell tid

source: Greenwich Mean Time
sv: Greenwich medeltid

source: Daylight Saving Time
sv: Sommartid

source: CPU time
sv: CPU-tid

source: processor time
sv: processortid

source: % (percent)
sv: % (procent)
