Repository: yeager/python-docs-sv
Catalog: library/time.po
Languages: sv

source: To voluntarily relinquish the CPU, specify a real-time :ref:`scheduling policy <os-scheduling-policy>` and use :func:`os.sched_yield` instead.
sv: För att frivilligt överlåta processorn, ange en realtids- :ref:`scheduling policy <os-scheduling-policy>` och använd :func:`os.sched_yield` istället.

source: Raises an :ref:`auditing event <auditing>` ``time.sleep`` with argument ``secs``.
sv: Utlöser en :ref:`auditing event <auditing>` ``time.sleep`` med argumentet ``secs``.

source: The function now sleeps at least *secs* even if the sleep is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale).
sv: Funktionen sover nu minst *sekunder* även om sömnen avbryts av en signal, förutom om signalhanteraren utlöser ett undantag (se :pep:`475` för motivering).

source: On Unix, the ``clock_nanosleep()`` and ``nanosleep()`` functions are now used if available. On Windows, a waitable timer is now used.
sv: På Unix används nu funktionerna ``clock_nanosleep()`` och ``nanosleep()`` om de är tillgängliga. På Windows används nu en väntande timer.

source: Raises an auditing event.
sv: Utlöser en granskningshändelse.

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string as specified by the *format* argument. If *t* is not provided, the current time as returned by :func:`localtime` is used. *format* must be a string. :exc:`ValueError` is raised if any field in *t* is outside of the allowed range.
sv: Konverterar en tupel eller :class:`struct_time` som representerar en tid som returneras av :func:`gmtime` eller :func:`localtime` till en sträng som anges av argumentet *format*. Om *t* inte anges används den aktuella tiden som returneras av :func:`localtime`. *format* måste vara en sträng. :exc:`ValueError` utlöses om något fält i *t* ligger utanför det tillåtna intervallet.

source: 0 is a legal argument for any position in the time tuple; if it is normally illegal the value is forced to a correct one.
sv: 0 är ett lagligt argument för vilken position som helst i tidstupeln; om det normalt är olagligt tvingas värdet till ett korrekt värde.

source: The following directives can be embedded in the *format* string. They are shown without the optional field width and precision specification, and are replaced by the indicated characters in the :func:`strftime` result:
sv: Följande direktiv kan bäddas in i *format*-strängen. De visas utan den valfria fältbredd- och precisionsspecifikationen, och ersätts av de angivna tecknen i :func:`strftime`-resultatet:

source: Directive
sv: Direktiv

source: Meaning
sv: Betydelse

source: Notes
sv: Anteckningar

source: Locale's abbreviated weekday name.
sv: Locale's förkortade veckodagsnamn.

source: Locale's full weekday name.
sv: Lokalens fullständiga veckodagsnamn.

source: Locale's abbreviated month name.
sv: Lokalens förkortade månadsnamn.

source: Locale's full month name.
sv: Lokalens fullständiga månadsnamn.

source: Locale's appropriate date and time representation.
sv: Locales lämpliga datum- och tidsrepresentation.

source: Day of the month as a decimal number [01,31].
sv: Månadens dag som ett decimaltal [01,31].

source: Microseconds as a decimal number
sv: Mikrosekunder som ett decimaltal

source: Hour (24-hour clock) as a decimal number [00,23].
sv: Timme (24-timmarsklocka) som decimaltal [00,23].

source: Hour (12-hour clock) as a decimal number [01,12].
sv: Timme (12-timmars klocka) som decimaltal [01,12].

source: Day of the year as a decimal number [001,366].
sv: Årets dag som ett decimaltal [001,366].

source: Month as a decimal number [01,12].
sv: Månad som ett decimaltal [01,12].

source: Minute as a decimal number [00,59].
sv: Minut som ett decimaltal [00,59].

source: Locale's equivalent of either AM or PM.
sv: Lokalens motsvarighet till antingen AM eller PM.

source: Second as a decimal number [00,61].
sv: Sekunder som decimaltal [00,61].

source: Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
sv: Årets veckonummer (söndag som första veckodag) som ett decimaltal [00,53]. Alla dagar i ett nytt år som föregår den första söndagen anses vara i vecka 0.

source: Day of the week (Monday is 1; Sunday is 7) as a decimal number [1, 7].
sv: Veckodag (måndag är 1; söndag är 7) som ett decimaltal [1, 7].

source: Weekday as a decimal number [0(Sunday),6].
sv: Veckodag som ett decimaltal [0(söndag),6].

source: Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0.
sv: Årets veckonummer (måndag som första dag i veckan) som decimaltal [00,53]. Alla dagar i ett nytt år som föregår den första måndagen anses vara i vecka 0.

source: Locale's appropriate date representation.
sv: Locales lämpliga datumrepresentation.

source: Locale's appropriate time representation.
sv: Locales lämpliga tidsrepresentation.

source: Year without century as a decimal number [00,99].
sv: Årtal utan århundrade som decimaltal [00,99].

source: Year with century as a decimal number.
sv: År med sekel som decimaltal.

source: Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59]. [1]_
sv: Tidszonsförskjutning som anger en positiv eller negativ tidsskillnad från UTC/GMT av formen +HHMM eller -HHMM, där H representerar decimala timsiffror och M representerar decimala minutsiffror [-23:59, +23:59]. [1]_

source: Time zone name (no characters if no time zone exists). Deprecated. [1]_
sv: Namn på tidszon (inga tecken om det inte finns någon tidszon). Föråldrad. [1]_

source: ISO 8601 year (similar to ``%Y`` but follows the rules for the ISO 8601 calendar year). The year starts with the week that contains the first Thursday of the calendar year.
sv: ISO 8601-år (liknar ``%Y`` men följer reglerna för ISO 8601-kalenderåret). Året börjar med den vecka som innehåller den första torsdagen i kalenderåret.

source: ISO 8601 week number (as a decimal number [01,53]). The first week of the year is the one that contains the first Thursday of the year. Weeks start on Monday.
sv: ISO 8601 veckonummer (som ett decimaltal [01,53]). Årets första vecka är den vecka som innehåller årets första torsdag. Veckorna börjar på måndagen.

source: A literal ``'%'`` character.
sv: Ett bokstavligt ``'%'``-tecken.

source: Notes:
sv: Anteckningar:

source: The ``%f`` format directive only applies to :func:`strptime`, not to :func:`strftime`. However, see also :meth:`datetime.datetime.strptime` and :meth:`datetime.datetime.strftime` where the ``%f`` format directive :ref:`applies to microseconds <format-codes>`.
sv: Formatdirektivet ``%f`` gäller bara för :func:`strptime`, inte för :func:`strftime`. Se dock även :meth:`datetime.datetime.strptime` och :meth:`datetime.datetime.strftime` där formatdirektivet ``%f`` :ref:``gäller för mikrosekunder <format-codes>`.

source: When used with the :func:`strptime` function, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
sv: När det används med funktionen :func:`strptime` påverkar direktivet ``%p`` endast fältet för utmatad timme om direktivet ``%I`` används för att tolka timmen.

source: The range really is ``0`` to ``61``; value ``60`` is valid in timestamps representing `leap seconds`_ and value ``61`` is supported for historical reasons.
sv: Intervallet är egentligen ``0`` till ``61``; värdet ``60`` är giltigt i tidsstämplar som representerar "skottsekunder" och värdet ``61`` stöds av historiska skäl.

source: When used with the :func:`strptime` function, ``%U`` and ``%W`` are only used in calculations when the day of the week and the year are specified.
sv: När de används med funktionen :func:`strptime` används ``%U`` och ``%W`` endast i beräkningar när veckodag och år anges.

source: Here is an example, a format for dates compatible with that specified in the :rfc:`2822` Internet email standard. [1]_ ::
sv: Här är ett exempel, ett format för datum som är kompatibelt med det som anges i :rfc:`2822` Internet email standard. [1]_ ::

source: Additional directives may be supported on certain platforms, but only the ones listed here have a meaning standardized by ANSI C. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation.
sv: Ytterligare direktiv kan stödjas på vissa plattformar, men endast de som listas här har en betydelse som standardiserats av ANSI C. För att se den fullständiga uppsättningen formatkoder som stöds på din plattform, se :manpage:`strftime(3)`-dokumentationen.

source: On some platforms, an optional field width and precision specification can immediately follow the initial ``'%'`` of a directive in the following order; this is also not portable. The field width is normally 2 except for ``%j`` where it is 3.
sv: På vissa plattformar kan en valfri specifikation av fältbredd och precision följa direkt efter den inledande ``'%'`` i ett direktiv i följande ordning; detta är inte heller portabelt. Fältbredden är normalt 2 utom för ``%j`` där den är 3.

source: Parse a string representing a time according to a format. The return value is a :class:`struct_time` as returned by :func:`gmtime` or :func:`localtime`.
sv: Analyserar en sträng som representerar en tid enligt ett format. Returvärdet är en :class:`struct_time` som returneras av :func:`gmtime` eller :func:`localtime`.

source: The *format* parameter uses the same directives as those used by :func:`strftime`; it defaults to ``"%a %b %d %H:%M:%S %Y"`` which matches the formatting returned by :func:`ctime`. If *string* cannot be parsed according to *format*, or if it has excess data after parsing, :exc:`ValueError` is raised. The default values used to fill in any missing data when more accurate values cannot be inferred are ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Both *string* and *format* must be strings.
sv: Parametern *format* använder samma direktiv som används av :func:`strftime`; standardvärdet är ``"%a %b %d %H:%M:%S %Y"`` vilket matchar formateringen som returneras av :func:`ctime`. Om *sträng* inte kan analyseras enligt *format*, eller om den har överflödig data efter analyseringen, kommer :exc:`ValueError` att visas. De standardvärden som används för att fylla i saknade data när mer exakta värden inte kan härledas är ``(1900, 1, 1, 0, 0, 0, 0, 0, 1, -1)``. Både *string* och *format* måste vara strängar.

source: For example:
sv: Till exempel:

source: Support for the ``%Z`` directive is based on the values contained in ``tzname`` and whether ``daylight`` is true. Because of this, it is platform-specific except for recognizing UTC and GMT which are always known (and are considered to be non-daylight savings timezones).
sv: Stöd för direktivet ``%Z`` baseras på värdena i ``tzname`` och om ``daylight`` är sant. På grund av detta är det plattformsspecifikt med undantag för att känna igen UTC och GMT som alltid är kända (och anses vara tidszoner utan sommartid).

source: Only the directives specified in the documentation are supported. Because ``strftime()`` is implemented per platform it can sometimes offer more directives than those listed. But ``strptime()`` is independent of any platform and thus does not necessarily support all directives available that are not documented as supported.
sv: Endast de direktiv som anges i dokumentationen stöds. Eftersom ``strftime()`` implementeras per plattform kan den ibland erbjuda fler direktiv än de som listas. Men ``strptime()`` är oberoende av plattform och stöder därför inte nödvändigtvis alla tillgängliga direktiv som inte är dokumenterade som stödda.

source: The type of the time value sequence returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`. It is an object with a :term:`named tuple` interface: values can be accessed by index and by attribute name. The following values are present:
sv: Typen av tidsvärdessekvens som returneras av :func:`gmtime`, :func:`localtime` och :func:`strptime`. Det är ett objekt med ett :term:`named tuple`-gränssnitt: värden kan nås via index och via attributnamn. Följande värden är närvarande:

source: Attribute
sv: Attribut

source: Values
sv: Värden

source: (for example, 1993)
sv: (t.ex. 1993)

source: range [1, 12]
sv: intervall [1, 12]

source: range [1, 31]
sv: intervall [1, 31]

source: range [0, 23]
sv: intervall [0, 23]

source: range [0, 59]
sv: intervall [0, 59]

source: range [0, 61]; see :ref:`Note (2) <leap-second>` in :func:`strftime`
sv: intervall [0, 61]; se :ref:`Anmärkning (2) <leap-second>` i :func:`strftime`

source: range [0, 6]; Monday is 0
sv: intervall [0, 6]; Måndag är 0

source: range [1, 366]
sv: intervall [1, 366]

source: 0, 1 or -1; see below
sv: 0, 1 eller -1; se nedan

source: abbreviation of timezone name
sv: förkortning av tidszonens namn

source: offset east of UTC in seconds
sv: offset öster om UTC i sekunder

source: Note that unlike the C structure, the month value is a range of [1, 12], not [0, 11].
sv: Observera att till skillnad från C-strukturen är månadsvärdet ett intervall på [1, 12], inte [0, 11].

source: In calls to :func:`mktime`, :attr:`tm_isdst` may be set to 1 when daylight savings time is in effect, and 0 when it is not. A value of -1 indicates that this is not known, and will usually result in the correct state being filled in.
sv: I anrop till :func:`mktime` kan :attr:`tm_isdst` sättas till 1 när sommartid gäller och till 0 när den inte gäller. Ett värde på -1 indikerar att detta inte är känt, och kommer vanligtvis att resultera i att rätt tillstånd fylls i.

source: When a tuple with an incorrect length is passed to a function expecting a :class:`struct_time`, or having elements of the wrong type, a :exc:`TypeError` is raised.
sv: När en tupel med fel längd skickas till en funktion som förväntar sig en :class:`struct_time`, eller som har element av fel typ, uppstår ett :exc:`TypeError`.

source: Return the time in seconds since the epoch_ as a floating-point number. The handling of `leap seconds`_ is platform dependent. On Windows and most Unix systems, the leap seconds are not counted towards the time in seconds since the epoch_. This is commonly referred to as `Unix time <https://en.wikipedia.org/wiki/Unix_time>`_.
sv: Returnerar tiden i sekunder sedan epoch_ som ett flyttal. Hanteringen av "skottsekunder" är plattformsberoende. På Windows och de flesta Unix-system räknas inte skottsekunderna in i tiden i sekunder sedan epok_. Detta kallas vanligen för "Unix-tid <https://en.wikipedia.org/wiki/Unix_time>`_".

source: Note that even though the time is always returned as a floating-point number, not all systems provide time with a better precision than 1 second. While this function normally returns non-decreasing values, it can return a lower value than a previous call if the system clock has been set back between the two calls.
sv: Observera att även om tiden alltid returneras som ett flyttal, är det inte alla system som ger tid med bättre precision än 1 sekund. Även om denna funktion normalt returnerar icke-dekalerande värden, kan den returnera ett lägre värde än ett tidigare anrop om systemklockan har ställts tillbaka mellan de två anropen.

source: The number returned by :func:`.time` may be converted into a more common time format (i.e. year, month, day, hour, etc...) in UTC by passing it to :func:`gmtime` function or in local time by passing it to the :func:`localtime` function. In both cases a :class:`struct_time` object is returned, from which the components of the calendar date may be accessed as attributes.
sv: Det tal som returneras av :func:`.time` kan konverteras till ett vanligare tidsformat (dvs. år, månad, dag, timme, etc...) i UTC genom att skicka det till funktionen :func:`gmtime` eller i lokal tid genom att skicka det till funktionen :func:`localtime`. I båda fallen returneras ett :class:`struct_time`-objekt, från vilket komponenterna i kalenderdatumet kan nås som attribut.

source: On Windows, call ``GetSystemTimePreciseAsFileTime()``.
sv: I Windows anropar du ``GetSystemTimePreciseAsFileTime()``.

source: Call ``clock_gettime(CLOCK_REALTIME)`` if available.
sv: Anropa ``clock_gettime(CLOCK_REALTIME)`` om tillgängligt.

source: Otherwise, call ``gettimeofday()``.
sv: Annars anropar du ``gettimeofday()``.

source: Use :func:`time_ns` to avoid the precision loss caused by the :class:`float` type.
sv: Använd :func:`time_ns` för att undvika den precisionsförlust som orsakas av typen :class:`float`.

source: On Windows, calls ``GetSystemTimePreciseAsFileTime()`` instead of ``GetSystemTimeAsFileTime()``.
sv: I Windows anropas ``GetSystemTimePreciseAsFileTime()`` istället för ``GetSystemTimeAsFileTime()``.

source: Similar to :func:`~time.time` but returns time as an integer number of nanoseconds since the epoch_.
sv: Liknar :func:`~time.time` men returnerar tiden som ett heltal av nanosekunder sedan epoch_.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current thread. It does not include time elapsed during sleep. It is thread-specific by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls in the same thread is valid.
sv: Returnerar värdet (i bråkdelar av sekunder) av summan av systemets och användarens CPU-tid för den aktuella tråden. Den inkluderar inte tid som förflutit under sömn. Det är trådspecifikt per definition. Referenspunkten för det returnerade värdet är odefinierad, vilket innebär att endast skillnaden mellan resultaten av två anrop i samma tråd är giltig.

source: Use :func:`thread_time_ns` to avoid the precision loss caused by the :class:`float` type.
sv: Använd :func:`thread_time_ns` för att undvika den precisionsförlust som orsakas av typen :class:`float`.

source: Unix systems supporting ``CLOCK_THREAD_CPUTIME_ID``.
sv: Unix-system som stöder ``CLOCK_THREAD_CPUTIME_ID``.

source: Similar to :func:`thread_time` but return time as nanoseconds.
sv: Liknar :func:`thread_time` men returnerar tid som nanosekunder.

source: Reset the time conversion rules used by the library routines. The environment variable :envvar:`TZ` specifies how this is done. It will also set the variables ``tzname`` (from the :envvar:`TZ` environment variable), ``timezone`` (non-DST seconds West of UTC), ``altzone`` (DST seconds west of UTC) and ``daylight`` (to 0 if this timezone does not have any daylight saving time rules, or to nonzero if there is a time, past, present or future when daylight saving time applies).
sv: Återställer tidsomvandlingsreglerna som används av biblioteksrutinerna. Miljövariabeln :envvar:`TZ` anger hur detta ska göras. Den kommer också att ställa in variablerna ``tzname`` (från miljövariabeln :envvar:`TZ`), ``timezone`` (icke-DST sekunder väster om UTC), ``altzone`` (DST sekunder väster om UTC) och ``daylight`` (till 0 om denna tidszon inte har några regler för sommartid, eller till icke-noll om det finns en tid, dåtid, nutid eller framtid då sommartid gäller).

source: Although in many cases, changing the :envvar:`TZ` environment variable may affect the output of functions like :func:`localtime` without calling :func:`tzset`, this behavior should not be relied on.
sv: Även om ändring av miljövariabeln :envvar:`TZ` i många fall kan påverka utdata från funktioner som :func:`localtime` utan att anropa :func:`tzset`, bör man inte förlita sig på detta beteende.

source: The :envvar:`TZ` environment variable should contain no whitespace.
sv: Miljövariabeln :envvar:`TZ` får inte innehålla några blanksteg.

source: The standard format of the :envvar:`TZ` environment variable is (whitespace added for clarity)::
sv: Standardformatet för miljövariabeln :envvar:`TZ` är (blanksteg har lagts till för tydlighetens skull)::

source: std offset [dst [offset [,start[/time], end[/time]]]]
sv: std offset [dst [offset [,start[/tid], slut[/tid]]]]

source: Where the components are:
sv: Var komponenterna finns:

source: ``std`` and ``dst``
sv: ``std`` och ``dst``

source: Three or more alphanumerics giving the timezone abbreviations. These will be propagated into time.tzname
sv: Tre eller fler alfanumeriska tecken som anger tidszonens förkortningar. Dessa kommer att överföras till time.tzname

source: The offset has the form: ``± hh[:mm[:ss]]``. This indicates the value added the local time to arrive at UTC. If preceded by a '-', the timezone is east of the Prime Meridian; otherwise, it is west. If no offset follows dst, summer time is assumed to be one hour ahead of standard time.
sv: Offset har följande form: ``± hh[:mm[:ss]]``. Detta anger värdet som läggs till den lokala tiden för att komma fram till UTC. Om det föregås av ett '-' är tidszonen öster om nollmeridianen, annars är den väster. Om ingen offset följer efter dst antas sommartiden vara en timme före standardtiden.

source: ``start[/time], end[/time]``
sv: ``start[/tid], slut[/tid]``

source: Indicates when to change to and back from DST. The format of the start and end dates are one of the following:
sv: Anger när man ska byta till och från sommartid. Formatet för start- och slutdatumen är något av följande:

source: The Julian day *n* (1 <= *n* <= 365). Leap days are not counted, so in all years February 28 is day 59 and March 1 is day 60.
sv: Den julianska dagen *n* (1 <= *n* <= 365). Skottdagar räknas inte, så under alla år är den 28 februari dag 59 och den 1 mars dag 60.

source: The zero-based Julian day (0 <= *n* <= 365). Leap days are counted, and it is possible to refer to February 29.
sv: Den nollbaserade julianska dagen (0 <= *n* <= 365). Skottdagar räknas och det är möjligt att hänvisa till den 29 februari.

source: The *d*'th day (0 <= *d* <= 6) of week *n* of month *m* of the year (1 <= *n* <= 5, 1 <= *m* <= 12, where week 5 means "the last *d* day in month *m*" which may occur in either the fourth or the fifth week). Week 1 is the first week in which the *d*'th day occurs. Day zero is a Sunday.
sv: Den *d*:e dagen (0 <= *d* <= 6) i vecka *n* i månad *m* under året (1 <= *n* <= 5, 1 <= *m* <= 12, där vecka 5 betyder "den sista *d*-dagen i månad *m*" som kan inträffa antingen under den fjärde eller den femte veckan). Vecka 1 är den första vecka under vilken den *d*:e dagen inträffar. Dag noll är en söndag.

source: ``time`` has the same format as ``offset`` except that no leading sign ('-' or '+') is allowed. The default, if time is not given, is 02:00:00.
sv: ``time`` har samma format som ``offset`` förutom att inget inledande tecken ('-' eller '+') tillåts. Standardvärdet, om tid inte anges, är 02:00:00.

source: >>> os.environ['TZ'] = 'EST+05EDT,M4.1.0,M10.5.0' >>> time.tzset() >>> time.strftime('%X %x %Z') '02:07:36 05/08/03 EDT' >>> os.environ['TZ'] = 'AEST-10AEDT-11,M10.5.0,M3.5.0' >>> time.tzset() >>> time.strftime('%X %x %Z') '16:08:12 05/08/03 AEST'
sv: >>> os.environ['TZ'] = 'EST+05EDT,M4.1.0,M10.5.0' >>> tid.tzset() >>> time.strftime('%X %x %Z') '02:07:36 05/08/03 EDT' >>> os.environ['TZ'] = 'AEST-10AEDT-11,M10.5.0,M3.5.0' >>> tid.tzset() >>> time.strftime('%X %x %Z') '16:08:12 05/08/03 AEST'
