Repository: yeager/python-docs-sv
Catalog: library/tkinter.messagebox.po
Languages: sv

source: :mod:`!tkinter.messagebox` --- Tkinter message prompts
sv: :mod:`!tkinter.messagebox` --- Tkinter-meddelanden

source: **Source code:** :source:`Lib/tkinter/messagebox.py`
sv: **Källkod:** :source:`Lib/tkinter/messagebox.py`

source: The :mod:`tkinter.messagebox` module provides a template base class as well as a variety of convenience methods for commonly used configurations. The message boxes are modal and will return a subset of (``True``, ``False``, ``None``, :data:`OK`, :data:`CANCEL`, :data:`YES`, :data:`NO`) based on the user's selection. Common message box styles and layouts include but are not limited to:
sv: Modulen :mod:`tkinter.messagebox` tillhandahåller en basklass för en mall samt en mängd olika bekvämlighetsmetoder för vanliga konfigurationer. Meddelanderutorna är modala och returnerar en delmängd av (``True``, ``False``, ``None``, :data:`OK`, :data:`CANCEL`, :data:`YES`, :data:`NO`) baserat på användarens val. Vanliga stilar och layouter för meddelanderutor inkluderar, men är inte begränsade till:

source: Create a message window with an application-specified message, an icon and a set of buttons. Each of the buttons in the message window is identified by a unique symbolic name (see the *type* options).
sv: Skapa ett meddelandefönster med ett programspecifikt meddelande, en ikon och en uppsättning knappar. Var och en av knapparna i meddelandefönstret identifieras med ett unikt symboliskt namn (se alternativen *type*).

source: The following options are supported:
sv: Följande alternativ stöds:

source: *command*
sv: *kommando*

source: Specifies the function to invoke when the user closes the dialog. The name of the button clicked by the user to close the dialog is passed as argument. This is only available on macOS.
sv: Anger vilken funktion som ska anropas när användaren stänger dialogen. Namnet på den knapp som användaren klickar på för att stänga dialogrutan skickas som argument. Detta är endast tillgängligt på macOS.

source: *default*
sv: *förvald

source: Gives the :ref:`symbolic name <messagebox-buttons>` of the default button for this message window (:data:`OK`, :data:`CANCEL`, and so on). If this option is not specified, the first button in the dialog will be made the default.
sv: Ger :ref:`symboliskt namn <messagebox-buttons>` för standardknappen för detta meddelandefönster (:data:`OK`, :data:`CANCEL`, och så vidare). Om detta alternativ inte anges kommer den första knappen i dialogrutan att användas som standardknapp.

source: *detail*
sv: *detalj*

source: Specifies an auxiliary message to the main message given by the *message* option. The message detail will be presented beneath the main message and, where supported by the OS, in a less emphasized font than the main message.
sv: Anger ett extrameddelande till huvudmeddelandet som anges med alternativet *message*. Meddelandet presenteras under huvudmeddelandet och, om operativsystemet stöder det, med ett mindre betonat teckensnitt än huvudmeddelandet.

source: *icon*
sv: *ikon*

source: Specifies an :ref:`icon <messagebox-icons>` to display. If this option is not specified, then the :data:`INFO` icon will be displayed.
sv: Anger en :ref:`icon <messagebox-icons>` som ska visas. Om det här alternativet inte anges visas ikonen :data:`INFO`.

source: *message*
sv: *meddelande*

source: Specifies the message to display in this message box. The default value is an empty string.
sv: Anger det meddelande som ska visas i denna meddelanderuta. Standardvärdet är en tom sträng.

source: *parent*
sv: *förälder*

source: Makes the specified window the logical parent of the message box. The message box is displayed on top of its parent window.
sv: Gör det angivna fönstret till logisk förälder till meddelandefältet. Meddelanderutan visas ovanpå det överordnade fönstret.

source: *title*
sv: *titel*

source: Specifies a string to display as the title of the message box. This option is ignored on macOS, where platform guidelines forbid the use of a title on this kind of dialog.
sv: Anger en sträng som ska visas som titel på meddelanderutan. Det här alternativet ignoreras på macOS, där plattformens riktlinjer förbjuder användning av en titel i den här typen av dialogrutor.

source: *type*
sv: *typ*

source: Arranges for a :ref:`predefined set of buttons <messagebox-types>` to be displayed.
sv: Ordnar så att en :ref:`fördefinierad uppsättning knappar <messagebox-types>` visas.

source: Display a message window and wait for the user to select one of the buttons. Then return the symbolic name of the selected button. Keyword arguments can override options specified in the constructor.
sv: Visa ett meddelandefönster och vänta på att användaren ska välja en av knapparna. Returnera sedan det symboliska namnet på den valda knappen. Nyckelord kan åsidosätta de alternativ som anges i konstruktören.

source: **Information message box**
sv: **Ruta för informationsmeddelanden**

source: Creates and displays an information message box with the specified title and message.
sv: Skapar och visar en meddelanderuta med information med angiven titel och meddelande.

source: **Warning message boxes**
sv: **Varningsmeddelanden**

source: Creates and displays a warning message box with the specified title and message.
sv: Skapar och visar en varningsmeddelanderuta med angiven titel och meddelande.

source: Creates and displays an error message box with the specified title and message.
sv: Skapar och visar en felmeddelanderuta med den angivna titeln och meddelandet.

source: **Question message boxes**
sv: **Frågeformulär för meddelanden**

source: Ask a question. By default shows buttons :data:`YES` and :data:`NO`. Returns the symbolic name of the selected button.
sv: Ställ en fråga till oss. Visar som standard knapparna :data:`YES` och :data:`NO`. Returnerar det symboliska namnet på den valda knappen.

source: Ask if operation should proceed. Shows buttons :data:`OK` and :data:`CANCEL`. Returns ``True`` if the answer is ok and ``False`` otherwise.
sv: Fråga om operationen ska fortsätta. Visar knapparna :data:`OK` och :data:`CANCEL`. Returnerar ``True`` om svaret är ok och ``False`` annars.

source: Ask if operation should be retried. Shows buttons :data:`RETRY` and :data:`CANCEL`. Return ``True`` if the answer is yes and ``False`` otherwise.
sv: Fråga om operationen ska göras om. Visar knapparna :data:`RETRY` och :data:`CANCEL`. Returnerar ``True`` om svaret är ja och ``False`` annars.

source: Ask a question. Shows buttons :data:`YES` and :data:`NO`. Returns ``True`` if the answer is yes and ``False`` otherwise.
sv: Ställ en fråga. Visar knapparna :data:`YES` och :data:`NO`. Returnerar ``True`` om svaret är ja och ``False`` annars.

source: Ask a question. Shows buttons :data:`YES`, :data:`NO` and :data:`CANCEL`. Return ``True`` if the answer is yes, ``None`` if cancelled, and ``False`` otherwise.
sv: Ställ en fråga. Visar knapparna :data:`YES`, :data:`NO` och :data:`CANCEL`. Returnerar ``True`` om svaret är ja, ``None`` om frågan är avbruten och ``False`` annars.

source: Symbolic names of buttons:
sv: Symboliska namn på knappar:

source: Predefined sets of buttons:
sv: Fördefinierade uppsättningar av knappar:

source: Displays three buttons whose symbolic names are :data:`ABORT`, :data:`RETRY` and :data:`IGNORE`.
sv: Visar tre knappar vars symboliska namn är :data:`ABORT`, :data:`RETRY` och :data:`IGNORE`.

source: Displays one button whose symbolic name is :data:`OK`.
sv: Visar en knapp vars symboliska namn är :data:`OK`.

source: Displays two buttons whose symbolic names are :data:`OK` and :data:`CANCEL`.
sv: Visar två knappar vars symboliska namn är :data:`OK` och :data:`CANCEL`.

source: Displays two buttons whose symbolic names are :data:`RETRY` and :data:`CANCEL`.
sv: Visar två knappar vars symboliska namn är :data:`RETRY` och :data:`CANCEL`.

source: Displays two buttons whose symbolic names are :data:`YES` and :data:`NO`.
sv: Visar två knappar vars symboliska namn är :data:`YES` och :data:`NO`.

source: Displays three buttons whose symbolic names are :data:`YES`, :data:`NO` and :data:`CANCEL`.
sv: Visar tre knappar vars symboliska namn är :data:`YES`, :data:`NO` och :data:`CANCEL`.

source: Icon images:
sv: Ikonbilder:
