Repository: yeager/python-docs-sv
Catalog: library/tkinter.font.po
Languages: sv

source: :mod:`!tkinter.font` --- Tkinter font wrapper
sv: :mod:`!tkinter.font` --- Tkinter-teckensnittsomslag

source: **Source code:** :source:`Lib/tkinter/font.py`
sv: **Källkod:** :source:`Lib/tkinter/font.py`

source: The :mod:`tkinter.font` module provides the :class:`Font` class for creating and using named fonts.
sv: Modulen :mod:`tkinter.font` tillhandahåller klassen :class:`Font` för att skapa och använda namngivna teckensnitt.

source: The different font weights and slants are:
sv: De olika typsnittens tyngd och lutning är:

source: The :class:`Font` class represents a named font. *Font* instances are given unique names and can be specified by their family, size, and style configuration. Named fonts are Tk's method of creating and identifying fonts as a single object, rather than specifying a font by its attributes with each occurrence.
sv: Klassen :class:`Font` representerar ett namngivet teckensnitt. *Font*-instanser ges unika namn och kan specificeras utifrån deras familj, storlek och stilkonfiguration. Namngivna teckensnitt är Tk:s metod för att skapa och identifiera teckensnitt som ett enda objekt, istället för att specificera ett teckensnitt utifrån dess attribut vid varje förekomst.

source: arguments:
sv: argument:

source: *font* - font specifier tuple (family, size, options)
sv: *font* - teckensnittsspecifikator (familj, storlek, alternativ)

source: *name* - unique font name
sv: *name* - unikt namn på teckensnittet

source: *exists* - self points to existing named font if true
sv: *exists* - self pekar på ett befintligt namngivet teckensnitt om true

source: additional keyword options (ignored if *font* is specified):
sv: ytterligare nyckelordsalternativ (ignoreras om *font* anges):

source: *family* - font family i.e. Courier, Times
sv: *family* - teckensnittsfamilj, t.ex. Courier, Times

source: *size* - font size
sv: *size* - teckenstorlek

source: If *size* is positive it is interpreted as size in points.
sv: Om *size* är positivt tolkas det som storlek i punkter.

source: If *size* is a negative number its absolute value is treated
sv: Om *size* är ett negativt tal behandlas dess absoluta värde som

source: as size in pixels.
sv: som storlek i pixlar.

source: *weight* - font emphasis (NORMAL, BOLD)
sv: *weight* - teckensnittets betoning (NORMAL, BOLD)

source: *slant* - ROMAN, ITALIC
sv: *slant* - ROMANSKA, ITALIENSKA

source: *underline* - font underlining (0 - none, 1 - underline)
sv: *underline* - understrykning av teckensnitt (0 - ingen, 1 - understrykning)

source: *overstrike* - font strikeout (0 - none, 1 - strikeout)
sv: *overstrike* - font strikeout (0 - ingen, 1 - strikeout)

source: Return the attributes of the font.
sv: Returnerar attributen för teckensnittet.

source: Retrieve an attribute of the font.
sv: Hämtar ett attribut för teckensnittet.

source: Modify attributes of the font.
sv: Ändra attribut för teckensnittet.

source: Return new instance of the current font.
sv: Returnerar en ny instans av det aktuella teckensnittet.

source: Return amount of space the text would occupy on the specified display when formatted in the current font. If no display is specified then the main application window is assumed.
sv: Returnerar hur mycket utrymme texten skulle ta upp på den angivna skärmen när den formateras med aktuellt typsnitt. Om ingen skärm anges antas programmets huvudfönster.

source: Return font-specific data. Options include:
sv: Returnera teckensnittsspecifika data. Alternativen inkluderar:

source: *ascent* - distance between baseline and highest point that a
sv: *ascent* - avståndet mellan baslinjen och den högsta punkten som en

source: character of the font can occupy
sv: tecken i teckensnittet kan uppta

source: *descent* - distance between baseline and lowest point that a
sv: *descent* - avståndet mellan baslinjen och den lägsta punkt som en

source: *linespace* - minimum vertical separation necessary between any two
sv: *linespace* - minsta vertikala avstånd som krävs mellan två

source: characters of the font that ensures no vertical overlap between lines.
sv: tecken i typsnittet som säkerställer att det inte finns någon vertikal överlappning mellan raderna.

source: *fixed* - 1 if font is fixed-width else 0
sv: *fixed* - 1 om teckensnittet har fast bredd, annars 0

source: Return the different font families.
sv: Returnera de olika teckensnittsfamiljerna.

source: Return the names of defined fonts.
sv: Returnera namnen på definierade teckensnitt.

source: Return a :class:`Font` representation of a tk named font.
sv: Returnerar en :class:`Font`-representation av ett tk-namngivet typsnitt.

source: The *root* parameter was added.
sv: Parametern *root* har lagts till.
