Repository: yeager/python-docs-sv
Catalog: library/tokenize.po
Languages: sv

source: :mod:`!tokenize` --- Tokenizer for Python source
sv: :mod:`!tokenize` --- Tokenizer för Python-källor

source: **Source code:** :source:`Lib/tokenize.py`
sv: **Källkod:** :source:`Lib/tokenize.py`

source: The :mod:`tokenize` module provides a lexical scanner for Python source code, implemented in Python. The scanner in this module returns comments as tokens as well, making it useful for implementing "pretty-printers", including colorizers for on-screen displays.
sv: Modulen :mod:`tokenize` tillhandahåller en lexikal skanner för Python-källkod, implementerad i Python. Skannern i den här modulen returnerar även kommentarer som tokens, vilket gör den användbar för att implementera "pretty-printers", inklusive färgläggare för skärmvisning.

source: To simplify token stream handling, all :ref:`operator <operators>` and :ref:`delimiter <delimiters>` tokens and :data:`Ellipsis` are returned using the generic :data:`~token.OP` token type. The exact type can be determined by checking the ``exact_type`` property on the :term:`named tuple` returned from :func:`tokenize.tokenize`.
sv: För att förenkla hanteringen av tokenflöden, returneras alla :ref:`operator <operators>` och :ref:`delimiter <delimiters>` tokens och :data:`Ellipsis` med den generiska :data:`~token.OP` token-typen. Den exakta typen kan bestämmas genom att kontrollera egenskapen ``exact_type`` på :term:`named tuple` som returneras från :func:`tokenize.tokenize`.

source: Note that the functions in this module are only designed to parse syntactically valid Python code (code that does not raise when parsed using :func:`ast.parse`). The behavior of the functions in this module is **undefined** when providing invalid Python code and it can change at any point.
sv: Observera att funktionerna i den här modulen endast är utformade för att analysera syntaktiskt giltig Python-kod (kod som inte ger utslag när den analyseras med :func:`ast.parse`). Beteendet hos funktionerna i den här modulen är **odefinierat** när de tillhandahåller ogiltig Python-kod och det kan ändras när som helst.

source: Tokenizing Input
sv: Tokenisering av inmatning

source: The primary entry point is a :term:`generator`:
sv: Den primära ingångspunkten är en :term:`generator`:

source: The :func:`.tokenize` generator requires one argument, *readline*, which must be a callable object which provides the same interface as the :meth:`io.IOBase.readline` method of file objects. Each call to the function should return one line of input as bytes.
sv: Generatorn :func:`.tokenize` kräver ett argument, *readline*, som måste vara ett anropbart objekt som ger samma gränssnitt som metoden :meth:`io.IOBase.readline` för filobjekt. Varje anrop till funktionen bör returnera en rad indata som bytes.

source: The generator produces 5-tuples with these members: the token type; the token string; a 2-tuple ``(srow, scol)`` of ints specifying the row and column where the token begins in the source; a 2-tuple ``(erow, ecol)`` of ints specifying the row and column where the token ends in the source; and the line on which the token was found. The line passed (the last tuple item) is the *physical* line. The 5 tuple is returned as a :term:`named tuple` with the field names: ``type string start end line``.
sv: Generatorn producerar 5-tupler med dessa medlemmar: token-typen; token-strängen; en 2-tupel ``(srow, scol)`` av ints som anger raden och kolumnen där token börjar i källan; en 2-tupel ``(erow, ecol)`` av ints som anger raden och kolumnen där token slutar i källan; och raden där token hittades. Den rad som skickas (den sista tupeln) är den *fysiska* raden. Tupeln 5 returneras som en :term:`named tuple` med fältnamnen: ``type string start end line``.

source: The returned :term:`named tuple` has an additional property named ``exact_type`` that contains the exact operator type for :data:`~token.OP` tokens. For all other token types ``exact_type`` equals the named tuple ``type`` field.
sv: Den returnerade :term:`named tuple` har en ytterligare egenskap med namnet ``exact_type`` som innehåller den exakta operatortypen för :data:`~token.OP`-tokens. För alla andra token-typer är ``exact_type`` lika med den namngivna tupelns fält ``type``.

source: Added support for named tuples.
sv: Lagt till stöd för namngivna tupler.

source: Added support for ``exact_type``.
sv: Lagt till stöd för ``exact_type``.

source: :func:`.tokenize` determines the source encoding of the file by looking for a UTF-8 BOM or encoding cookie, according to :pep:`263`.
sv: :func:`.tokenize` bestämmer källkodningen för filen genom att leta efter en UTF-8 BOM eller kodningskaka, enligt :pep:`263`.

source: Tokenize a source reading unicode strings instead of bytes.
sv: Tokenisera en källa som läser unicode-strängar istället för bytes.

source: Like :func:`.tokenize`, the *readline* argument is a callable returning a single line of input. However, :func:`generate_tokens` expects *readline* to return a str object rather than bytes.
sv: Precis som :func:`.tokenize` är argumentet *readline* en callable som returnerar en enda rad med indata. Men :func:`generate_tokens` förväntar sig att *readline* returnerar ett str-objekt istället för bytes.

source: The result is an iterator yielding named tuples, exactly like :func:`.tokenize`. It does not yield an :data:`~token.ENCODING` token.
sv: Resultatet är en iterator som ger namngivna tupler, precis som :func:`.tokenize`. Det ger inte en :data:`~token.ENCODING`-token.

source: All constants from the :mod:`token` module are also exported from :mod:`tokenize`.
sv: Alla konstanter från modulen :mod:`token` exporteras också från :mod:`tokenize`.

source: Another function is provided to reverse the tokenization process. This is useful for creating tools that tokenize a script, modify the token stream, and write back the modified script.
sv: En annan funktion finns för att vända tokeniseringsprocessen. Detta är användbart för att skapa verktyg som tokeniserar ett skript, modifierar tokenflödet och skriver tillbaka det modifierade skriptet.

source: Converts tokens back into Python source code. The *iterable* must return sequences with at least two elements, the token type and the token string. Any additional sequence elements are ignored.
sv: Konverterar tokens tillbaka till Python-källkod. *iterable* måste returnera sekvenser med minst två element, token-typen och token-strängen. Eventuella ytterligare sekvenselement ignoreras.

source: The result is guaranteed to tokenize back to match the input so that the conversion is lossless and round-trips are assured. The guarantee applies only to the token type and token string as the spacing between tokens (column positions) may change.
sv: Resultatet garanteras att tokeniseras tillbaka för att matcha indata så att konverteringen är förlustfri och rundresor garanteras. Garantin gäller endast för token-typen och token-strängen eftersom avståndet mellan tokens (kolumnpositioner) kan ändras.

source: It returns bytes, encoded using the :data:`~token.ENCODING` token, which is the first token sequence output by :func:`.tokenize`. If there is no encoding token in the input, it returns a str instead.
sv: Den returnerar bytes, kodade med :data:`~token.ENCODING`-token, som är den första tokensekvensen som matas ut av :func:`.tokenize`. Om det inte finns någon kodningstoken i indata returneras en str istället.

source: :func:`.tokenize` needs to detect the encoding of source files it tokenizes. The function it uses to do this is available:
sv: :func:`.tokenize` behöver upptäcka kodningen av källfiler som den tokeniserar. Funktionen som den använder för att göra detta är tillgänglig:

source: The :func:`detect_encoding` function is used to detect the encoding that should be used to decode a Python source file. It requires one argument, readline, in the same way as the :func:`.tokenize` generator.
sv: Funktionen :func:`detect_encoding` används för att upptäcka den kodning som ska användas för att avkoda en Python-källfil. Den kräver ett argument, readline, på samma sätt som generatorn :func:`.tokenize`.

source: It will call readline a maximum of twice, and return the encoding used (as a string) and a list of any lines (not decoded from bytes) it has read in.
sv: Den kommer att anropa readline högst två gånger och returnera den kodning som använts (som en sträng) och en lista över alla rader (som inte avkodats från bytes) som den har läst in.

source: It detects the encoding from the presence of a UTF-8 BOM or an encoding cookie as specified in :pep:`263`. If both a BOM and a cookie are present, but disagree, a :exc:`SyntaxError` will be raised. Note that if the BOM is found, ``'utf-8-sig'`` will be returned as an encoding.
sv: Den detekterar kodningen från närvaron av en UTF-8 BOM eller en kodningskaka enligt specifikationen i :pep:`263`. Om både en BOM och en cookie finns, men är oense, kommer ett :exc:`SyntaxError` att uppstå. Observera att om BOM hittas, kommer ``'utf-8-sig'`` att returneras som kodning.

source: If no encoding is specified, then the default of ``'utf-8'`` will be returned.
sv: Om ingen kodning anges kommer standardvärdet ``'utf-8'`` att returneras.

source: Use :func:`.open` to open Python source files: it uses :func:`detect_encoding` to detect the file encoding.
sv: Använd :func:`.open` för att öppna Python-källfiler: den använder :func:`detect_encoding` för att upptäcka filkodningen.

source: Open a file in read only mode using the encoding detected by :func:`detect_encoding`.
sv: Öppna en fil i skrivskyddat läge med hjälp av den kodning som upptäcktes av :func:`detect_encoding`.

source: Raised when either a docstring or expression that may be split over several lines is not completed anywhere in the file, for example::
sv: Utlöses när antingen en dokumentsträng eller ett uttryck som kan vara uppdelat på flera rader inte avslutas någonstans i filen, till exempel::

source: """Beginning of docstring
sv: """Början av dokumentsträng

source: or::
sv: eller::

source: Command-Line Usage
sv: Användning av kommandoraden

source: The :mod:`tokenize` module can be executed as a script from the command line. It is as simple as:
sv: Modulen :mod:`tokenize` kan köras som ett skript från kommandoraden. Det är så enkelt som att:

source: python -m tokenize [-e] [filename.py]
sv: python -m tokenize [-e] [filnamn.py]

source: The following options are accepted:
sv: Följande alternativ accepteras:

source: show this help message and exit
sv: visa detta hjälpmeddelande och avsluta

source: display token names using the exact type
sv: visa tokennamn med exakt typ

source: If :file:`filename.py` is specified its contents are tokenized to stdout. Otherwise, tokenization is performed on stdin.
sv: Om :file:`filnamn.py` anges tokeniseras dess innehåll till stdout. I annat fall utförs tokenisering på stdin.

source: Examples
sv: Exempel

source: Example of a script rewriter that transforms float literals into Decimal objects::
sv: Exempel på en script rewriter som omvandlar float-literaler till Decimal-objekt::

source: Example of tokenizing from the command line. The script::
sv: Exempel på tokenisering från kommandoraden. Skriptet::

source: will be tokenized to the following output where the first column is the range of the line/column coordinates where the token is found, the second column is the name of the token, and the final column is the value of the token (if any)
sv: kommer att tokeniseras till följande utdata där den första kolumnen är intervallet för rad- / kolumnkoordinaterna där token hittas, den andra kolumnen är namnet på token och den sista kolumnen är värdet på token (om någon)

source: The exact token type names can be displayed using the :option:`-e` option:
sv: De exakta namnen på token-typerna kan visas med hjälp av alternativet :option:`-e`:

source: Example of tokenizing a file programmatically, reading unicode strings instead of bytes with :func:`generate_tokens`::
sv: Exempel på tokenisering av en fil programmatiskt, läsning av unicode-strängar istället för bytes med :func:`generate_tokens`::

source: Or reading bytes directly with :func:`.tokenize`::
sv: Eller läsa bytes direkt med :func:`.tokenize`::
