Repository: yeager/python-docs-sv
Catalog: library/tracemalloc.po
Languages: sv

source: :mod:`!tracemalloc` --- Trace memory allocations
sv: :mod:`!tracemalloc` --- Spåra minnesallokeringar

source: **Source code:** :source:`Lib/tracemalloc.py`
sv: **Källkod:** :source:`Lib/tracemalloc.py`

source: The tracemalloc module is a debug tool to trace memory blocks allocated by Python. It provides the following information:
sv: Modulen tracemalloc är ett felsökningsverktyg för att spåra minnesblock som allokerats av Python. Den ger följande information:

source: Traceback where an object was allocated
sv: Traceback där ett objekt allokerades

source: Statistics on allocated memory blocks per filename and per line number: total size, number and average size of allocated memory blocks
sv: Statistik över allokerade minnesblock per filnamn och radnummer: total storlek, antal och genomsnittlig storlek på allokerade minnesblock

source: Compute the differences between two snapshots to detect memory leaks
sv: Beräkna skillnaderna mellan två ögonblicksbilder för att upptäcka minnesläckor

source: To trace most memory blocks allocated by Python, the module should be started as early as possible by setting the :envvar:`PYTHONTRACEMALLOC` environment variable to ``1``, or by using :option:`-X` ``tracemalloc`` command line option. The :func:`tracemalloc.start` function can be called at runtime to start tracing Python memory allocations.
sv: För att spåra de flesta minnesblock som allokeras av Python bör modulen startas så tidigt som möjligt genom att ställa in miljövariabeln :envvar:`PYTHONTRACEMALLOC` till ``1``, eller genom att använda kommandoradsalternativet :option:`-X` ``tracemalloc``. Funktionen :func:`tracemalloc.start` kan anropas vid körning för att börja spåra Python-minnesallokeringar.

source: By default, a trace of an allocated memory block only stores the most recent frame (1 frame). To store 25 frames at startup: set the :envvar:`PYTHONTRACEMALLOC` environment variable to ``25``, or use the :option:`-X` ``tracemalloc=25`` command line option.
sv: Som standard lagrar en spårning av ett allokerat minnesblock endast den senaste bilden (1 bild). För att lagra 25 bildrutor vid start: sätt miljövariabeln :envvar:`PYTHONTRACEMALLOC` till ``25``, eller använd kommandoradsalternativet :option:`-X` ``tracemalloc=25``.

source: Examples
sv: Exempel

source: Display the top 10
sv: Visa de 10 bästa

source: Display the 10 files allocating the most memory::
sv: Visa de 10 filer som allokerar mest minne::

source: Example of output of the Python test suite::
sv: Exempel på utdata från Python-testsviten::

source: We can see that Python loaded ``4855 KiB`` data (bytecode and constants) from modules and that the :mod:`collections` module allocated ``244 KiB`` to build :class:`~collections.namedtuple` types.
sv: Vi kan se att Python laddade ``4855 KiB`` data (bytekod och konstanter) från moduler och att modulen :mod:`collections` allokerade ``244 KiB`` för att bygga :class:`~collections.namedtuple`-typer.

source: See :meth:`Snapshot.statistics` for more options.
sv: Se :meth:`Snapshot.statistics` för fler alternativ.

source: Compute differences
sv: Beräkna skillnader

source: Take two snapshots and display the differences::
sv: Ta två ögonblicksbilder och visa skillnaderna::

source: Example of output before/after running some tests of the Python test suite::
sv: Exempel på utdata före/efter körning av några tester i Python-testsviten::

source: [ Top 10 differences ] <frozen importlib._bootstrap>:716: size=8173 KiB (+4428 KiB), count=71332 (+39369), average=117 B /usr/lib/python3.4/linecache.py:127: size=940 KiB (+940 KiB), count=8106 (+8106), average=119 B /usr/lib/python3.4/unittest/case.py:571: size=298 KiB (+298 KiB), count=589 (+589), average=519 B <frozen importlib._bootstrap>:284: size=1005 KiB (+166 KiB), count=7423 (+1526), average=139 B /usr/lib/python3.4/mimetypes.py:217: size=112 KiB (+112 KiB), count=1334 (+1334), average=86 B /usr/lib/python3.4/http/server.py:848: size=96.0 KiB (+96.0 KiB), count=1 (+1), average=96.0 KiB /usr/lib/python3.4/inspect.py:1465: size=83.5 KiB (+83.5 KiB), count=109 (+109), average=784 B /usr/lib/python3.4/unittest/mock.py:491: size=77.7 KiB (+77.7 KiB), count=143 (+143), average=557 B /usr/lib/python3.4/urllib/parse.py:476: size=71.8 KiB (+71.8 KiB), count=969 (+969), average=76 B /usr/lib/python3.4/contextlib.py:38: size=67.2 KiB (+67.2 KiB), count=126 (+126), average=546 B
sv: [ Topp 10 skillnader ] <frozen importlib._bootstrap>:716: storlek=8173 KiB (+4428 KiB), antal=71332 (+39369), genomsnitt=117 B /usr/lib/python3.4/linecache.py:127: storlek=940 KiB (+940 KiB), antal=8106 (+8106), genomsnitt=119 B /usr/lib/python3.4/unittest/case.py:571: storlek=298 KiB (+298 KiB), antal=589 (+589), genomsnitt=519 B <frozen importlib._bootstrap>:284: storlek=1005 KiB (+166 KiB), antal=7423 (+1526), genomsnitt=139 B /usr/lib/python3.4/mimetypes.py:217: storlek=112 KiB (+112 KiB), antal=1334 (+1334), genomsnitt=86 B /usr/lib/python3.4/http/server.py:848: storlek=96,0 KiB (+96,0 KiB), antal=1 (+1), genomsnitt=96,0 KiB /usr/lib/python3.4/inspect.py:1465: storlek=83,5 KiB (+83,5 KiB), antal=109 (+109), genomsnitt=784 B /usr/lib/python3.4/unittest/mock.py:491: storlek=77,7 KiB (+77,7 KiB), antal=143 (+143), genomsnitt=557 B /usr/lib/python3.4/urllib/parse.py:476: storlek=71,8 KiB (+71,8 KiB), antal=969 (+969), genomsnitt=76 B /usr/lib/python3.4/contextlib.py:38: storlek=67,2 KiB (+67,2 KiB), antal=126 (+126), genomsnitt=546 B

source: We can see that Python has loaded ``8173 KiB`` of module data (bytecode and constants), and that this is ``4428 KiB`` more than had been loaded before the tests, when the previous snapshot was taken. Similarly, the :mod:`linecache` module has cached ``940 KiB`` of Python source code to format tracebacks, all of it since the previous snapshot.
sv: Vi kan se att Python har laddat ``8173 KiB`` moduldata (bytekod och konstanter), och att detta är ``4428 KiB`` mer än vad som hade laddats före testerna, när den föregående ögonblicksbilden togs. På samma sätt har modulen :mod:`linecache` cachat ``940 KiB`` Python-källkod för att formatera spårningar, allt sedan den föregående ögonblicksbilden.

source: If the system has little free memory, snapshots can be written on disk using the :meth:`Snapshot.dump` method to analyze the snapshot offline. Then use the :meth:`Snapshot.load` method reload the snapshot.
sv: Om systemet har lite ledigt minne kan ögonblicksbilder skrivas på disk med hjälp av metoden :meth:`Snapshot.dump` för att analysera ögonblicksbilden offline. Använd sedan metoden :meth:`Snapshot.load` för att ladda om ögonblicksbilden.

source: Get the traceback of a memory block
sv: Hämta spårningen av ett minnesblock

source: Code to display the traceback of the biggest memory block::
sv: Kod för att visa spårningen av det största minnesblocket::

source: Example of output of the Python test suite (traceback limited to 25 frames)::
sv: Exempel på utdata från Python-testsviten (traceback begränsad till 25 ramar)::

source: We can see that the most memory was allocated in the :mod:`importlib` module to load data (bytecode and constants) from modules: ``870.1 KiB``. The traceback is where the :mod:`importlib` loaded data most recently: on the ``import pdb`` line of the :mod:`doctest` module. The traceback may change if a new module is loaded.
sv: Vi kan se att det mesta minnet allokerades i modulen :mod:`importlib` för att ladda data (bytecode och konstanter) från moduler: ``870,1 KiB``. Spårningen är där :mod:`importlib` laddade data senast: på ``import pdb``-raden i :mod:`doctest`-modulen. Spårningen kan ändras om en ny modul laddas.

source: Pretty top
sv: Snygg topp

source: Code to display the 10 lines allocating the most memory with a pretty output, ignoring ``<frozen importlib._bootstrap>`` and ``<unknown>`` files::
sv: Kod för att visa de 10 rader som allokerar mest minne med en vacker utdata, ignorerar filerna ``<frozen importlib._bootstrap>`` och ``<unknown>``::

source: Record the current and peak size of all traced memory blocks
sv: Registrera den aktuella och maximala storleken på alla spårade minnesblock

source: The following code computes two sums like ``0 + 1 + 2 + ...`` inefficiently, by creating a list of those numbers. This list consumes a lot of memory temporarily. We can use :func:`get_traced_memory` and :func:`reset_peak` to observe the small memory usage after the sum is computed as well as the peak memory usage during the computations::
sv: Följande kod beräknar två summor som ``0 + 1 + 2 + ...`` ineffektivt genom att skapa en lista med dessa tal. Denna lista förbrukar mycket minne temporärt. Vi kan använda :func:`get_traced_memory` och :func:`reset_peak` för att observera den lilla minnesanvändningen efter att summan har beräknats samt den maximala minnesanvändningen under beräkningarna::

source: Output::
sv: Utdata::

source: Using :func:`reset_peak` ensured we could accurately record the peak during the computation of ``small_sum``, even though it is much smaller than the overall peak size of memory blocks since the :func:`start` call. Without the call to :func:`reset_peak`, ``second_peak`` would still be the peak from the computation ``large_sum`` (that is, equal to ``first_peak``). In this case, both peaks are much higher than the final memory usage, and which suggests we could optimise (by removing the unnecessary call to :class:`list`, and writing ``sum(range(...))``).
sv: Genom att använda :func:`reset_peak` säkerställde vi att vi korrekt kunde registrera toppen under beräkningen av ``small_sum``, även om den är mycket mindre än den totala toppstorleken för minnesblock sedan anropet till :func:`start`. Utan anropet till :func:`reset_peak` skulle ``second_peak`` fortfarande vara toppen från beräkningen av ``large_sum`` (dvs. lika med ``first_peak``). I det här fallet är båda topparna mycket högre än den slutliga minnesanvändningen, vilket tyder på att vi kan optimera (genom att ta bort det onödiga anropet till :class:`list` och skriva ``sum(range(...))``).

source: Functions
sv: Funktioner

source: Clear traces of memory blocks allocated by Python.
sv: Tydliga spår av minnesblock som allokerats av Python.

source: See also :func:`stop`.
sv: Se även :func:`stop`.

source: Get the traceback where the Python object *obj* was allocated. Return a :class:`Traceback` instance, or ``None`` if the :mod:`tracemalloc` module is not tracing memory allocations or did not trace the allocation of the object.
sv: Hämta spårningen där Python-objektet *obj* allokerades. Returnerar en :class:`Traceback`-instans, eller ``None`` om :mod:`tracemalloc`-modulen inte spårar minnesallokeringar eller inte spårade allokeringen av objektet.

source: See also :func:`gc.get_referrers` and :func:`sys.getsizeof` functions.
sv: Se även funktionerna :func:`gc.get_referrers` och :func:`sys.getsizeof`.

source: Get the maximum number of frames stored in the traceback of a trace.
sv: Hämta det maximala antalet bildrutor som lagras i traceback för en trace.

source: The :mod:`tracemalloc` module must be tracing memory allocations to get the limit, otherwise an exception is raised.
sv: Modulen :mod:`tracemalloc` måste spåra minnesallokeringar för att få fram gränsen, annars uppstår ett undantag.

source: The limit is set by the :func:`start` function.
sv: Gränsen sätts av funktionen :func:`start`.

source: Get the current size and peak size of memory blocks traced by the :mod:`tracemalloc` module as a tuple: ``(current: int, peak: int)``.
sv: Hämta den aktuella storleken och toppstorleken på minnesblock som spåras av modulen :mod:`tracemalloc` som en tupel: ``(current: int, peak: int)``.

source: Set the peak size of memory blocks traced by the :mod:`tracemalloc` module to the current size.
sv: Ställ in den maximala storleken på minnesblock som spåras av modulen :mod:`tracemalloc` till den aktuella storleken.

source: Do nothing if the :mod:`tracemalloc` module is not tracing memory allocations.
sv: Gör ingenting om modulen :mod:`tracemalloc` inte spårar minnesallokeringar.

source: This function only modifies the recorded peak size, and does not modify or clear any traces, unlike :func:`clear_traces`. Snapshots taken with :func:`take_snapshot` before a call to :func:`reset_peak` can be meaningfully compared to snapshots taken after the call.
sv: Denna funktion ändrar bara den registrerade toppstorleken och ändrar eller rensar inte några spår, till skillnad från :func:`clear_traces`. Ögonblicksbilder som tagits med :func:`take_snapshot` före ett anrop till :func:`reset_peak` kan på ett meningsfullt sätt jämföras med ögonblicksbilder som tagits efter anropet.

source: See also :func:`get_traced_memory`.
sv: Se även :func:`get_traced_memory`.

source: Get the memory usage in bytes of the :mod:`tracemalloc` module used to store traces of memory blocks. Return an :class:`int`.
sv: Hämtar minnesanvändningen i byte för :mod:`tracemalloc`-modulen som används för att lagra spår av minnesblock. Returnerar en :class:`int`.

source: ``True`` if the :mod:`tracemalloc` module is tracing Python memory allocations, ``False`` otherwise.
sv: ``True`` om modulen :mod:`tracemalloc`` spårar Python-minnesallokeringar, ``False`` annars.

source: See also :func:`start` and :func:`stop` functions.
sv: Se även funktionerna :func:`start` och :func:`stop`.

source: Start tracing Python memory allocations: install hooks on Python memory allocators. Collected tracebacks of traces will be limited to *nframe* frames. By default, a trace of a memory block only stores the most recent frame: the limit is ``1``. *nframe* must be greater or equal to ``1``.
sv: Börja spåra Python-minnesallokeringar: installera krokar på Python-minnesallokatorer. Insamlade spårningar av spårningar kommer att begränsas till *nframe*-ramar. Som standard lagrar en spårning av ett minnesblock endast den senaste ramen: gränsen är ``1``. *nframe* måste vara större än eller lika med ``1``.

source: You can still read the original number of total frames that composed the traceback by looking at the :attr:`Traceback.total_nframe` attribute.
sv: Du kan fortfarande läsa det ursprungliga antalet totala bildrutor som utgjorde traceback genom att titta på attributet :attr:`Traceback.total_nframe`.

source: Storing more than ``1`` frame is only useful to compute statistics grouped by ``'traceback'`` or to compute cumulative statistics: see the :meth:`Snapshot.compare_to` and :meth:`Snapshot.statistics` methods.
sv: Att lagra mer än ``1`` ram är endast användbart för att beräkna statistik grupperad efter ``'traceback'`` eller för att beräkna kumulativ statistik: se metoderna :meth:`Snapshot.compare_to` och :meth:`Snapshot.statistics`.

source: Storing more frames increases the memory and CPU overhead of the :mod:`tracemalloc` module. Use the :func:`get_tracemalloc_memory` function to measure how much memory is used by the :mod:`tracemalloc` module.
sv: Om du lagrar fler ramar ökar minnes- och processorkostnaden för modulen :mod:`tracemalloc`. Använd funktionen :func:`get_tracemalloc_memory` för att mäta hur mycket minne som används av modulen :mod:`tracemalloc`.

source: The :envvar:`PYTHONTRACEMALLOC` environment variable (``PYTHONTRACEMALLOC=NFRAME``) and the :option:`-X` ``tracemalloc=NFRAME`` command line option can be used to start tracing at startup.
sv: Miljövariabeln :envvar:`PYTHONTRACEMALLOC` (``PYTHONTRACEMALLOC=NFRAME``) och kommandoradsalternativet :option:`-X` ``tracemalloc=NFRAME`` kan användas för att starta spårning vid uppstart.

source: See also :func:`stop`, :func:`is_tracing` and :func:`get_traceback_limit` functions.
sv: Se även funktionerna :func:`stop`, :func:`is_tracing` och :func:`get_traceback_limit`.

source: Stop tracing Python memory allocations: uninstall hooks on Python memory allocators. Also clears all previously collected traces of memory blocks allocated by Python.
sv: Sluta spåra Python-minnesallokeringar: avinstallera krokar på Python-minnesallokatorer. Rensar även alla tidigare insamlade spår av minnesblock som allokerats av Python.

source: Call :func:`take_snapshot` function to take a snapshot of traces before clearing them.
sv: Anropa funktionen :func:`take_snapshot` för att ta en ögonblicksbild av spåren innan de rensas.

source: See also :func:`start`, :func:`is_tracing` and :func:`clear_traces` functions.
sv: Se även funktionerna :func:`start`, :func:`is_tracing` och :func:`clear_traces`.

source: Take a snapshot of traces of memory blocks allocated by Python. Return a new :class:`Snapshot` instance.
sv: Ta en ögonblicksbild av spår av minnesblock som allokerats av Python. Returnerar en ny :class:`Snapshot`-instans.

source: The snapshot does not include memory blocks allocated before the :mod:`tracemalloc` module started to trace memory allocations.
sv: Ögonblicksbilden innehåller inte minnesblock som allokerats innan modulen :mod:`tracemalloc` började spåra minnesallokeringar.

source: Tracebacks of traces are limited to :func:`get_traceback_limit` frames. Use the *nframe* parameter of the :func:`start` function to store more frames.
sv: Spårningar av spårningar är begränsade till :func:`get_traceback_limit`-ramar. Använd parametern *nframe* i funktionen :func:`start` för att lagra fler ramar.

source: The :mod:`tracemalloc` module must be tracing memory allocations to take a snapshot, see the :func:`start` function.
sv: Modulen :mod:`tracemalloc` måste spåra minnesallokeringar för att ta en ögonblicksbild, se funktionen :func:`start`.

source: See also the :func:`get_object_traceback` function.
sv: Se även funktionen :func:`get_object_traceback`.

source: Filter traces of memory blocks by their address space (domain).
sv: Filtrera spår av minnesblock efter deras adressutrymme (domän).

source: If *inclusive* is ``True`` (include), match memory blocks allocated in the address space :attr:`domain`.
sv: Om *inclusive* är ``True`` (include), matcha minnesblock som allokerats i adressrymden :attr:`domain`.

source: If *inclusive* is ``False`` (exclude), match memory blocks not allocated in the address space :attr:`domain`.
sv: Om *inclusive* är ``False`` (exkludera), matchas minnesblock som inte allokerats i adressutrymmet :attr:`domain`.

source: Address space of a memory block (``int``). Read-only property.
sv: Adressrymd för ett minnesblock (``int``). Skrivskyddad egenskap.

source: Filter
sv: Filtrera

source: Filter on traces of memory blocks.
sv: Filtrera på spår av minnesblock.

source: See the :func:`fnmatch.fnmatch` function for the syntax of *filename_pattern*. The ``'.pyc'`` file extension is replaced with ``'.py'``.
sv: Se funktionen :func:`fnmatch.fnmatch` för syntaxen för *filename_pattern*. Filändelsen ``'.pyc'`` ersätts med ``'.py'``.

source: Examples:
sv: Exempel:

source: ``Filter(True, subprocess.__file__)`` only includes traces of the :mod:`subprocess` module
sv: ``Filter(True, subprocess.__file__)`` innehåller bara spår av modulen :mod:`subprocess

source: ``Filter(False, tracemalloc.__file__)`` excludes traces of the :mod:`tracemalloc` module
sv: ``Filter(False, tracemalloc.__file__)`` utesluter spår av modulen :mod:`tracemalloc`

source: ``Filter(False, "<unknown>")`` excludes empty tracebacks
sv: ``Filter(False, "<unknown>")``` utesluter tomma spårningar

source: The ``'.pyo'`` file extension is no longer replaced with ``'.py'``.
sv: Filändelsen ```.pyo`` ersätts inte längre med ```.py``.

source: Added the :attr:`domain` attribute.
sv: Lagt till attributet :attr:`domain`.

source: Address space of a memory block (``int`` or ``None``).
sv: Adressrymd för ett minnesblock (``int`` eller ``None``).

source: tracemalloc uses the domain ``0`` to trace memory allocations made by Python. C extensions can use other domains to trace other resources.
sv: tracemalloc använder domänen ``0`` för att spåra minnesallokeringar gjorda av Python. C-tillägg kan använda andra domäner för att spåra andra resurser.

source: If *inclusive* is ``True`` (include), only match memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
sv: Om *inclusive* är ``True`` (include), matchas endast minnesblock som allokerats i en fil med ett namn som matchar :attr:`filename_pattern` på radnummer :attr:`lineno`.

source: If *inclusive* is ``False`` (exclude), ignore memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
sv: Om *inclusive* är ``False`` (exkludera), ignorera minnesblock som allokerats i en fil med ett namn som matchar :attr:`filename_pattern` på radnummer :attr:`lineno`.

source: Line number (``int``) of the filter. If *lineno* is ``None``, the filter matches any line number.
sv: Radnummer (``int``) för filtret. Om *lineno* är ``None``, matchar filtret vilket radnummer som helst.

source: Filename pattern of the filter (``str``). Read-only property.
sv: Filnamnsmönster för filtret (``str``). Skrivskyddad egenskap.

source: If *all_frames* is ``True``, all frames of the traceback are checked. If *all_frames* is ``False``, only the most recent frame is checked.
sv: Om *all_frames* är ``True`` kontrolleras alla ramar i tracebacken. Om *all_frames* är ``False`` kontrolleras endast den senaste ramen.

source: This attribute has no effect if the traceback limit is ``1``. See the :func:`get_traceback_limit` function and :attr:`Snapshot.traceback_limit` attribute.
sv: Detta attribut har ingen effekt om traceback-gränsen är ``1``. Se funktionen :func:`get_traceback_limit` och attributet :attr:`Snapshot.traceback_limit`.

source: Frame
sv: Ram

source: Frame of a traceback.
sv: Ram för en spårning.

source: The :class:`Traceback` class is a sequence of :class:`Frame` instances.
sv: Klassen :class:`Traceback` är en sekvens av instanser av :class:`Frame`.

source: Filename (``str``).
sv: Filnamn (``str``).

source: Line number (``int``).
sv: Radnummer (``int``).

source: Snapshot of traces of memory blocks allocated by Python.
sv: Ögonblicksbild av spår av minnesblock som allokerats av Python.

source: The :func:`take_snapshot` function creates a snapshot instance.
sv: Funktionen :func:`take_snapshot` skapar en snapshot-instans.

source: Compute the differences with an old snapshot. Get statistics as a sorted list of :class:`StatisticDiff` instances grouped by *key_type*.
sv: Beräkna skillnaderna med en gammal ögonblicksbild. Hämta statistik som en sorterad lista över :class:`StatisticDiff`-instanser grupperade efter *key_type*.

source: See the :meth:`Snapshot.statistics` method for *key_type* and *cumulative* parameters.
sv: Se metoden :meth:`Snapshot.statistics` för parametrarna *key_type* och *cumulative*.

source: The result is sorted from the biggest to the smallest by: absolute value of :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, absolute value of :attr:`StatisticDiff.count_diff`, :attr:`Statistic.count` and then by :attr:`StatisticDiff.traceback`.
sv: Resultatet sorteras från det största till det minsta efter: absolut värde av :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, absolut värde av :attr:`StatisticDiff.count_diff`, :attr:`Statistic.count` och sedan efter :attr:`StatisticDiff.traceback`.

source: Write the snapshot into a file.
sv: Skriv in ögonblicksbilden i en fil.

source: Use :meth:`load` to reload the snapshot.
sv: Använd :meth:`load` för att ladda om ögonblicksbilden.

source: Create a new :class:`Snapshot` instance with a filtered :attr:`traces` sequence, *filters* is a list of :class:`DomainFilter` and :class:`Filter` instances. If *filters* is an empty list, return a new :class:`Snapshot` instance with a copy of the traces.
sv: Skapa en ny :class:`Snapshot`-instans med en filtrerad :attr:`traces`-sekvens, *filter* är en lista över :class:`DomainFilter`- och :class:`Filter`-instanser. Om *filters* är en tom lista, returneras en ny :class:`Snapshot`-instans med en kopia av spåren.
