Repository: yeager/python-docs-sv
Catalog: library/tracemalloc.po
Languages: sv

source: All inclusive filters are applied at once, a trace is ignored if no inclusive filters match it. A trace is ignored if at least one exclusive filter matches it.
sv: Alla inkluderande filter tillämpas på en gång, en spårning ignoreras om inga inkluderande filter matchar den. En spårning ignoreras om minst ett exklusivt filter matchar den.

source: :class:`DomainFilter` instances are now also accepted in *filters*.
sv: :class:`DomainFilter`-instanser accepteras nu även i *filters*.

source: Load a snapshot from a file.
sv: Ladda en ögonblicksbild från en fil.

source: See also :meth:`dump`.
sv: Se även :meth:`dump`.

source: Get statistics as a sorted list of :class:`Statistic` instances grouped by *key_type*:
sv: Hämta statistik som en sorterad lista över :class:`Statistic`-instanser grupperade efter *key_type*:

source: description
sv: beskrivning

source: filename and line number
sv: filnam och radnummer

source: traceback
sv: spårning

source: If *cumulative* is ``True``, cumulate size and count of memory blocks of all frames of the traceback of a trace, not only the most recent frame. The cumulative mode can only be used with *key_type* equals to ``'filename'`` and ``'lineno'``.
sv: Om *cumulative* är ``True``, kumuleras storlek och antal minnesblock för alla ramar i spårningen av en spårning, inte bara den senaste ramen. Det kumulativa läget kan endast användas med *key_type* lika med ``'filename'`` och ``'lineno'``.

source: The result is sorted from the biggest to the smallest by: :attr:`Statistic.size`, :attr:`Statistic.count` and then by :attr:`Statistic.traceback`.
sv: Resultatet sorteras från det största till det minsta efter: :attr:`Statistic.size`, :attr:`Statistic.count` och sedan efter :attr:`Statistic.traceback`.

source: Maximum number of frames stored in the traceback of :attr:`traces`: result of the :func:`get_traceback_limit` when the snapshot was taken.
sv: Maximalt antal bildrutor som lagras i spårningen av :attr:`traces`: resultatet av :func:`get_traceback_limit` när ögonblicksbilden togs.

source: Traces of all memory blocks allocated by Python: sequence of :class:`Trace` instances.
sv: Spårningar av alla minnesblock som allokerats av Python: sekvens av :class:`Trace`-instanser.

source: The sequence has an undefined order. Use the :meth:`Snapshot.statistics` method to get a sorted list of statistics.
sv: Sekvensen har en odefinierad ordning. Använd metoden :meth:`Snapshot.statistics` för att få en sorterad lista med statistik.

source: Statistic
sv: Statistik

source: Statistic on memory allocations.
sv: Statistik över minnesallokeringar.

source: :func:`Snapshot.statistics` returns a list of :class:`Statistic` instances.
sv: :func:`Snapshot.statistics` returnerar en lista med :class:`Statistic`-instanser.

source: See also the :class:`StatisticDiff` class.
sv: Se även klassen :class:`StatisticDiff`.

source: Number of memory blocks (``int``).
sv: Antal minnesblock (``int``).

source: Total size of memory blocks in bytes (``int``).
sv: Total storlek på minnesblock i byte (``int``).

source: Traceback where the memory block was allocated, :class:`Traceback` instance.
sv: Traceback där minnesblocket allokerades, :class:`Traceback` instans.

source: Statistic difference on memory allocations between an old and a new :class:`Snapshot` instance.
sv: Statistisk skillnad på minnesallokeringar mellan en gammal och en ny :class:`Snapshot`-instans.

source: :func:`Snapshot.compare_to` returns a list of :class:`StatisticDiff` instances. See also the :class:`Statistic` class.
sv: :func:`Snapshot.compare_to` returnerar en lista med :class:`StatisticDiff`-instanser. Se även klassen :class:`Statistic`.

source: Number of memory blocks in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
sv: Antal minnesblock i den nya ögonblicksbilden (``int``): ``0`` om minnesblocken har frigjorts i den nya ögonblicksbilden.

source: Difference of number of memory blocks between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
sv: Skillnad i antal minnesblock mellan den gamla och den nya ögonblicksbilden (``int``): ``0`` om minnesblocken har allokerats i den nya ögonblicksbilden.

source: Total size of memory blocks in bytes in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
sv: Total storlek på minnesblock i byte i den nya ögonblicksbilden (``int``): ``0`` om minnesblocken har frigjorts i den nya ögonblicksbilden.

source: Difference of total size of memory blocks in bytes between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
sv: Skillnad i total storlek på minnesblock i byte mellan den gamla och den nya ögonblicksbilden (``int``): ``0`` om minnesblocken har allokerats i den nya ögonblicksbilden.

source: Traceback where the memory blocks were allocated, :class:`Traceback` instance.
sv: Traceback där minnesblocken allokerades, :class:`Traceback` instans.

source: Trace
sv: Spåra

source: Trace of a memory block.
sv: Spårning av ett minnesblock.

source: The :attr:`Snapshot.traces` attribute is a sequence of :class:`Trace` instances.
sv: Attributet :attr:`Snapshot.traces` är en sekvens av instanser av :class:`Trace`.

source: Size of the memory block in bytes (``int``).
sv: Storleken på minnesblocket i byte (``int``).

source: Traceback
sv: Spårning

source: Sequence of :class:`Frame` instances sorted from the oldest frame to the most recent frame.
sv: Sekvens av :class:`Frame`-instanser sorterade från den äldsta ramen till den senaste ramen.

source: A traceback contains at least ``1`` frame. If the ``tracemalloc`` module failed to get a frame, the filename ``"<unknown>"`` at line number ``0`` is used.
sv: En traceback innehåller minst ``1`` ram. Om modulen ``tracemalloc`` misslyckades med att hämta en ram används filnamnet ``"<unknown>"`` på radnummer ``0``.

source: When a snapshot is taken, tracebacks of traces are limited to :func:`get_traceback_limit` frames. See the :func:`take_snapshot` function. The original number of frames of the traceback is stored in the :attr:`Traceback.total_nframe` attribute. That allows to know if a traceback has been truncated by the traceback limit.
sv: När en ögonblicksbild tas begränsas spårningar av spårningar till :func:`get_traceback_limit`-ramar. Se funktionen :func:`take_snapshot`. Det ursprungliga antalet bildrutor i traceback lagras i attributet :attr:`Traceback.total_nframe`. Det gör det möjligt att veta om en traceback har avkortats av traceback-gränsen.

source: The :attr:`Trace.traceback` attribute is an instance of :class:`Traceback` instance.
sv: Attributet :attr:`Trace.traceback` är en instans av instansen :class:`Traceback`.

source: Frames are now sorted from the oldest to the most recent, instead of most recent to oldest.
sv: Ramarna sorteras nu från de äldsta till de senaste, i stället för från de senaste till de äldsta.

source: Total number of frames that composed the traceback before truncation. This attribute can be set to ``None`` if the information is not available.
sv: Totalt antal bildrutor som utgjorde tracebacken före trunkering. Detta attribut kan sättas till ``None`` om informationen inte är tillgänglig.

source: The :attr:`Traceback.total_nframe` attribute was added.
sv: Attributet :attr:`Traceback.total_nframe` lades till.

source: Format the traceback as a list of lines. Use the :mod:`linecache` module to retrieve lines from the source code. If *limit* is set, format the *limit* most recent frames if *limit* is positive. Otherwise, format the ``abs(limit)`` oldest frames. If *most_recent_first* is ``True``, the order of the formatted frames is reversed, returning the most recent frame first instead of last.
sv: Formatera traceback som en lista med rader. Använd modulen :mod:`linecache` för att hämta rader från källkoden. Om *limit* är inställt, formatera de *limit* senaste ramarna om *limit* är positiv. I annat fall formateras de ``abs(limit)`` äldsta ramarna. Om *most_recent_first* är ``True``, vänds ordningen på de formaterade ramarna och den senaste ramen returneras först istället för sist.

source: Similar to the :func:`traceback.format_tb` function, except that :meth:`.format` does not include newlines.
sv: Liknar funktionen :func:`traceback.format_tb`, förutom att :meth:`.format` inte inkluderar nya rader.

source: Example::
sv: Exempel::
