Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. Usage::
sv: Som introducerades i :pep:`526`, anger en variabelannotation omsluten av ClassVar att ett visst attribut är avsett att användas som en klassvariabel och inte bör ställas in på instanser av den klassen. Användning::

source: class Starship: stats: ClassVar[dict[str, int]] = {} # class variable damage: int = 10 # instance variable
sv: klass Starship: stats: ClassVar[dict[str, int]] = {} # klassvariabel damage: int = 10 # instansvariabel

source: :data:`ClassVar` accepts only types and cannot be further subscribed.
sv: :data:`ClassVar` accepterar endast typer och kan inte tecknas ytterligare.

source: :data:`ClassVar` is not a class itself, and should not be used with :func:`isinstance` or :func:`issubclass`. :data:`ClassVar` does not change Python runtime behavior, but it can be used by third-party type checkers. For example, a type checker might flag the following code as an error::
sv: :data:`ClassVar` är inte en klass i sig, och bör inte användas med :func:`isinstance` eller :func:`issubclass`. :data:`ClassVar` ändrar inte Pythons körtidsbeteende, men kan användas av tredjeparts typkontrollanter. Till exempel kan en typkontrollant flagga följande kod som ett fel::

source: enterprise_d = Starship(3000) enterprise_d.stats = {} # Error, setting class variable on instance Starship.stats = {} # This is OK
sv: enterprise_d = Stjärnskepp(3000) enterprise_d.stats = {} # Fel, inställning av klassvariabel på instans Starship.stats = {} # Det här är OK

source: :data:`ClassVar` can now be nested in :data:`Final` and vice versa.
sv: :data:`ClassVar` kan nu nestas i :data:`Final` och vice versa.

source: Special typing construct to indicate final names to type checkers.
sv: Särskild typkonstruktion för att ange slutliga namn till typkontrollanter.

source: Final names cannot be reassigned in any scope. Final names declared in class scopes cannot be overridden in subclasses.
sv: Slutnamn kan inte omfördelas i något scope. Slutnamn som deklareras i klassens scope kan inte åsidosättas i underklasser.

source: MAX_SIZE: Final = 9000 MAX_SIZE += 1 # Error reported by type checker class Connection: TIMEOUT: Final[int] = 10 class FastConnector(Connection): TIMEOUT = 1 # Error reported by type checker
sv: MAX_SIZE: Slutlig = 9000 MAX_SIZE += 1 # Fel rapporterat av typkontroll klass Anslutning: TIMEOUT: Final[int] = 10 klass FastConnector(Anslutning): TIMEOUT = 1 # Fel rapporterat av typkontroll

source: There is no runtime checking of these properties. See :pep:`591` for more details.
sv: Det finns ingen körtidskontroll av dessa egenskaper. Se :pep:`591` för mer information.

source: :data:`Final` can now be nested in :data:`ClassVar` and vice versa.
sv: :data:`Final` kan nu nestas i :data:`ClassVar` och vice versa.

source: Special typing construct to mark a :class:`TypedDict` key as required.
sv: Speciell typningskonstruktion för att markera en :class:`TypedDict`-nyckel som nödvändig.

source: This is mainly useful for ``total=False`` TypedDicts. See :class:`TypedDict` and :pep:`655` for more details.
sv: Detta är främst användbart för ``total=False`` TypedDicts. Se :class:`TypedDict` och :pep:`655` för mer information.

source: Special typing construct to mark a :class:`TypedDict` key as potentially missing.
sv: Speciell typningskonstruktion för att markera en :class:`TypedDict`-nyckel som potentiellt saknad.

source: See :class:`TypedDict` and :pep:`655` for more details.
sv: Se :class:`TypedDict` och :pep:`655` för mer information.

source: A special typing construct to mark an item of a :class:`TypedDict` as read-only.
sv: En speciell typningskonstruktion för att markera ett objekt i en :class:`TypedDict` som skrivskyddat.

source: class Movie(TypedDict): title: ReadOnly[str] year: int def mutate_movie(m: Movie) -> None: m["year"] = 1999 # allowed m["title"] = "The Matrix" # typechecker error
sv: klass Film(TypedDict): titel: ReadOnly[str] year: int def mutate_movie(m: Movie) -> None: m["year"] = 1999 # tillåtet m["title"] = "The Matrix" # typkontrollfel

source: There is no runtime checking for this property.
sv: Det finns ingen runtime-kontroll för denna egenskap.

source: See :class:`TypedDict` and :pep:`705` for more details.
sv: Se :class:`TypedDict` och :pep:`705` för mer information.

source: Special typing form to add context-specific metadata to an annotation.
sv: Särskilt skrivformulär för att lägga till kontextspecifika metadata i en annotering.

source: Add metadata ``x`` to a given type ``T`` by using the annotation ``Annotated[T, x]``. Metadata added using ``Annotated`` can be used by static analysis tools or at runtime. At runtime, the metadata is stored in a :attr:`!__metadata__` attribute.
sv: Lägg till metadata ``x`` till en given typ ``T`` genom att använda annotationen ``Annotated[T, x]``. Metadata som läggs till med ``Annotated`` kan användas av statiska analysverktyg eller vid körning. Vid körning lagras metadata i ett :attr:`!__metadata__`-attribut.

source: If a library or tool encounters an annotation ``Annotated[T, x]`` and has no special logic for the metadata, it should ignore the metadata and simply treat the annotation as ``T``. As such, ``Annotated`` can be useful for code that wants to use annotations for purposes outside Python's static typing system.
sv: Om ett bibliotek eller verktyg stöter på en annotation ``Annotated[T, x]`` och inte har någon speciell logik för metadata, bör det ignorera metadata och helt enkelt behandla annotationen som ``T``. Som sådan kan ``Annotated`` vara användbar för kod som vill använda annotationer för ändamål utanför Pythons statiska typningssystem.

source: Using ``Annotated[T, x]`` as an annotation still allows for static typechecking of ``T``, as type checkers will simply ignore the metadata ``x``. In this way, ``Annotated`` differs from the :func:`@no_type_check <no_type_check>` decorator, which can also be used for adding annotations outside the scope of the typing system, but completely disables typechecking for a function or class.
sv: Att använda ``Annotated[T, x]`` som en annotation tillåter fortfarande statisk typkontroll av ``T``, eftersom typkontrollerna helt enkelt ignorerar metadata ``x``. På så sätt skiljer sig ``Annotated`` från dekoratorn :func:`@no_type_check <no_type_check>`, som också kan användas för att lägga till annotationer utanför typsystemets räckvidd, men som helt inaktiverar typkontroll för en funktion eller klass.

source: The responsibility of how to interpret the metadata lies with the tool or library encountering an ``Annotated`` annotation. A tool or library encountering an ``Annotated`` type can scan through the metadata elements to determine if they are of interest (e.g., using :func:`isinstance`).
sv: Ansvaret för hur metadata ska tolkas ligger hos det verktyg eller bibliotek som stöter på en ``Annotated``-annotation. Ett verktyg eller bibliotek som stöter på en ``Annotated``-typ kan söka igenom metadataelementen för att avgöra om de är av intresse (t.ex. med hjälp av :func:`isinstance`).

source: Here is an example of how you might use ``Annotated`` to add metadata to type annotations if you were doing range analysis:
sv: Här är ett exempel på hur du kan använda ``Annotated`` för att lägga till metadata till typannoteringar om du gör intervallanalys:

source: @dataclass class ValueRange: lo: int hi: int T1 = Annotated[int, ValueRange(-10, 5)] T2 = Annotated[T1, ValueRange(-20, 3)]
sv: @dataklass klass Värdeintervall: lo: int hi: int T1 = Annoterad[int, Värdeintervall(-10, 5)] T2 = Annoterad[T1, Värdeintervall(-20, 3)]

source: The first argument to ``Annotated`` must be a valid type. Multiple metadata elements can be supplied as ``Annotated`` supports variadic arguments. The order of the metadata elements is preserved and matters for equality checks::
sv: Det första argumentet till ``Annotated`` måste vara en giltig typ. Flera metadataelement kan anges eftersom ``Annotated`` stöder variadiska argument. Ordningen på metadataelementen bevaras och är viktig för jämlikhetskontroller::

source: @dataclass class ctype: kind: str a1 = Annotated[int, ValueRange(3, 10), ctype("char")] a2 = Annotated[int, ctype("char"), ValueRange(3, 10)] assert a1 != a2 # Order matters
sv: @dataklass klass ctyp: typ: str a1 = Annoterad[int, Värdeintervall(3, 10), ctype("char")] a2 = Annoterad[int, ctype("char"), Värdeintervall(3, 10)] assert a1 != a2 # Ordningen har betydelse

source: It is up to the tool consuming the annotations to decide whether the client is allowed to add multiple metadata elements to one annotation and how to merge those annotations.
sv: Det är upp till det verktyg som konsumerar annotationerna att avgöra om klienten får lägga till flera metadataelement i en annotation och hur dessa annotationer ska slås samman.

source: Nested ``Annotated`` types are flattened. The order of the metadata elements starts with the innermost annotation::
sv: Nästlade ``Annotated``-typer plattas ut. Ordningen på metadataelementen börjar med den innersta annotationen::

source: assert Annotated[Annotated[int, ValueRange(3, 10)], ctype("char")] == Annotated[ int, ValueRange(3, 10), ctype("char") ]
sv: assert Annoterad[Annoterad[int, ValueRange(3, 10)], ctype("char")] == Annoterad[ int, Värdeintervall(3, 10), ctype("char") ]

source: However, this does not apply to ``Annotated`` types referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
sv: Detta gäller dock inte för ``Annoterade`` typer som refereras till via ett typalias, för att undvika att tvinga fram en utvärdering av den underliggande :class:`TypeAliasType`::

source: type From3To10[T] = Annotated[T, ValueRange(3, 10)] assert Annotated[From3To10[int], ctype("char")] != Annotated[ int, ValueRange(3, 10), ctype("char") ]
sv: type From3To10[T] = Annoterad[T, ValueRange(3, 10)] assert Annoterad[From3To10[int], ctype("char")] != Annoterad[ int, Värdeintervall(3, 10), ctype("char") ]

source: Duplicated metadata elements are not removed::
sv: Duplicerade metadataelement tas inte bort:

source: assert Annotated[int, ValueRange(3, 10)] != Annotated[ int, ValueRange(3, 10), ValueRange(3, 10) ]
sv: assert Annoterad[int, Värdeintervall(3, 10)] != Annoterad[ int, Värdeintervall(3, 10), Värdeintervall(3, 10) ]

source: ``Annotated`` can be used with nested and generic aliases:
sv: ``Annotated`` kan användas med nästlade och generiska alias:

source: @dataclass class MaxLen: value: int type Vec[T] = Annotated[list[tuple[T, T]], MaxLen(10)] # When used in a type annotation, a type checker will treat "V" the same as # ``Annotated[list[tuple[int, int]], MaxLen(10)]``: type V = Vec[int]
sv: @dataklass klass MaxLen: värde: int type Vec[T] = Annoterad[list[tuple[T, T]], MaxLen(10)] # När det används i en typannotering kommer en typkontroll att behandla "V" på samma sätt som # ``Annoterad[lista[tupel[int, int]], MaxLen(10)]``: typ V = Vec[int]

source: ``Annotated`` cannot be used with an unpacked :class:`TypeVarTuple`::
sv: ``Annotated`` kan inte användas med en uppackad :class:`TypeVarTuple`::

source: type Variadic[*Ts] = Annotated[*Ts, Ann1] = Annotated[T1, T2, T3, ..., Ann1] # NOT valid
sv: type Variadic[*Ts] = Annoterad[*Ts, Ann1] = Annoterad[T1, T2, T3, ..., Ann1] # INTE giltig

source: where ``T1``, ``T2``, ... are :class:`TypeVars <TypeVar>`. This is invalid as only one type should be passed to Annotated.
sv: där ``T1``, ``T2``, ... är :class:`TypeVars <TypeVar>`. Detta är ogiltigt eftersom endast en typ ska skickas till Annotated.

source: By default, :func:`get_type_hints` strips the metadata from annotations. Pass ``include_extras=True`` to have the metadata preserved:
sv: Som standard tar :func:`get_type_hints` bort metadata från annoteringar. Passera ``include_extras=True`` för att få metadata bevarade:

source: >>> from typing import Annotated, get_type_hints >>> def func(x: Annotated[int, "metadata"]) -> None: pass ... >>> get_type_hints(func) {'x': <class 'int'>, 'return': <class 'NoneType'>} >>> get_type_hints(func, include_extras=True) {'x': typing.Annotated[int, 'metadata'], 'return': <class 'NoneType'>}
sv: >>> from typing import Annoterad, get_type_hints >>> def func(x: Annoterad[int, "metadata"]) -> Ingen: pass ... >>> get_type_hints(func) {'x': <klass 'int'>, 'return': <klass 'NoneType'>} >>> get_type_hints(func, include_extras=True) {'x': typing.Annotated[int, 'metadata'], 'return': <klass 'NoneType'>}

source: At runtime, the metadata associated with an ``Annotated`` type can be retrieved via the :attr:`!__metadata__` attribute:
sv: Vid körning kan de metadata som är associerade med en ``Annotated``-typ hämtas via attributet :attr:`!__metadata__`:

source: >>> from typing import Annotated >>> X = Annotated[int, "very", "important", "metadata"] >>> X typing.Annotated[int, 'very', 'important', 'metadata'] >>> X.__metadata__ ('very', 'important', 'metadata')
sv: >>> from typing import Annoterad >>> X = Annoterad[int, "mycket", "viktig", "metadata"] >>> X typing.Annoterad[int, 'mycket', 'viktig', 'metadata'] >>> X.__metadata__ ('mycket', 'viktigt', 'metadata')

source: If you want to retrieve the original type wrapped by ``Annotated``, use the :attr:`!__origin__` attribute:
sv: Om du vill hämta den ursprungliga typen som omsluts av ``Annotated``, använd attributet :attr:`!__origin__``:

source: >>> from typing import Annotated, get_origin >>> Password = Annotated[str, "secret"] >>> Password.__origin__ <class 'str'>
sv: >>> from typing import Annoterad, get_origin >>> Lösenord = Annoterad[str, "hemlig"] >>> Lösenord.__origin__ <klass 'str'>

source: Note that using :func:`get_origin` will return ``Annotated`` itself:
sv: Observera att om du använder :func:`get_origin` kommer ``Annotated`` själv att returneras:

source: >>> get_origin(Password) typing.Annotated
sv: >>> get_origin(Lösenord) typning.antecknad

source: :pep:`593` - Flexible function and variable annotations
sv: :pep:`593` - Flexibla funktions- och variabelannoteringar

source: The PEP introducing ``Annotated`` to the standard library.
sv: PEP som introducerar ``Annotated`` till standardbiblioteket.

source: Special typing construct for marking user-defined type predicate functions.
sv: Särskild typkonstruktion för att markera användardefinierade typpredikatsfunktioner.

source: ``TypeIs`` can be used to annotate the return type of a user-defined type predicate function. ``TypeIs`` only accepts a single type argument. At runtime, functions marked this way should return a boolean and take at least one positional argument.
sv: ``TypeIs`` kan användas för att kommentera returtypen för en användardefinierad typ predikatfunktion. ``TypeIs`` accepterar endast ett enda typargument. Vid körning ska funktioner som markeras på detta sätt returnera en boolean och ta minst ett positionellt argument.

source: ``TypeIs`` aims to benefit *type narrowing* -- a technique used by static type checkers to determine a more precise type of an expression within a program's code flow. Usually type narrowing is done by analyzing conditional code flow and applying the narrowing to a block of code. The conditional expression here is sometimes referred to as a "type predicate"::
sv: ``TypeIs`` syftar till att gynna *type narrowing* -- en teknik som används av statiska typkontroller för att bestämma en mer exakt typ av ett uttryck inom ett programs kodflöde. Vanligtvis görs typförminskning genom att analysera villkorligt kodflöde och tillämpa förminskningen på ett kodblock. Det villkorliga uttrycket här kallas ibland för ett "typ predikat"::

source: def is_str(val: str | float): # "isinstance" type predicate if isinstance(val, str): # Type of ``val`` is narrowed to ``str`` ... else: # Else, type of ``val`` is narrowed to ``float``. ...
sv: def is_str(val: str | float): # "isinstance" typ predikat if isinstance(val, str): # Typen av ``val`` är begränsad till ``str`` ... else: # Annars är typen av ``val`` begränsad till ``float``. ...

source: Sometimes it would be convenient to use a user-defined boolean function as a type predicate. Such a function should use ``TypeIs[...]`` or :data:`TypeGuard` as its return type to alert static type checkers to this intention. ``TypeIs`` usually has more intuitive behavior than ``TypeGuard``, but it cannot be used when the input and output types are incompatible (e.g., ``list[object]`` to ``list[int]``) or when the function does not return ``True`` for all instances of the narrowed type.
sv: Ibland kan det vara praktiskt att använda en användardefinierad boolesk funktion som ett typpredikat. En sådan funktion bör använda ``TypeIs[...]`` eller :data:`TypeGuard` som sin returtyp för att varna statiska typkontrollanter för denna avsikt. ``TypeIs`` har vanligtvis ett mer intuitivt beteende än ``TypeGuard``, men det kan inte användas när in- och utdatatyperna är inkompatibla (t.ex. ``list[object]`` till ``list[int]``) eller när funktionen inte returnerar ``True`` för alla instanser av den begränsade typen.

source: Using ``-> TypeIs[NarrowedType]`` tells the static type checker that for a given function:
sv: Att använda ``-> TypeIs[NarrowedType]`` säger till den statiska typkontrollen att för en given funktion:

source: The return value is a boolean.
sv: Returvärdet är en boolean.

source: If the return value is ``True``, the type of its argument is the intersection of the argument's original type and ``NarrowedType``.
sv: Om returvärdet är ``True`` är typen för dess argument skärningspunkten mellan argumentets ursprungliga typ och ``NarrowedType``.

source: If the return value is ``False``, the type of its argument is narrowed to exclude ``NarrowedType``.
sv: Om returvärdet är ``False``, begränsas typen av dess argument för att utesluta ``NarrowedType``.

source: from typing import assert_type, final, TypeIs class Parent: pass class Child(Parent): pass @final class Unrelated: pass def is_parent(val: object) -> TypeIs[Parent]: return isinstance(val, Parent) def run(arg: Child | Unrelated): if is_parent(arg): # Type of ``arg`` is narrowed to the intersection # of ``Parent`` and ``Child``, which is equivalent to # ``Child``. assert_type(arg, Child) else: # Type of ``arg`` is narrowed to exclude ``Parent``, # so only ``Unrelated`` is left. assert_type(arg, Unrelated)
sv: från typing import assert_type, final, TypeIs klass Förälder: pass class Barn(Förälder): pass @final klass Obesläktad: pass def is_parent(val: object) -> TypeIs[Parent]: return isinstance(val, Förälder) def run(arg: Barn | Obesläktad): if is_parent(arg): # Typen av ``arg`` är begränsad till skärningspunkten # av ``Parent`` och ``Child``, vilket är ekvivalent med # ``Child``. assert_type(arg, Barn) else: # Typen av ``arg`` är begränsad till att utesluta ``Parent``, # så att endast ``Unrelated`` återstår. assert_type(arg, Obesläktad)

source: The type inside ``TypeIs`` must be consistent with the type of the function's argument; if it is not, static type checkers will raise an error. An incorrectly written ``TypeIs`` function can lead to unsound behavior in the type system; it is the user's responsibility to write such functions in a type-safe manner.
sv: Typen i ``TypeIs`` måste stämma överens med typen i funktionens argument; om den inte gör det kommer statiska typkontroller att ge ett felmeddelande. En felaktigt skriven ``TypeIs``-funktion kan leda till osunt beteende i typsystemet; det är användarens ansvar att skriva sådana funktioner på ett typsäkert sätt.

source: If a ``TypeIs`` function is a class or instance method, then the type in ``TypeIs`` maps to the type of the second parameter (after ``cls`` or ``self``).
sv: Om en ``TypeIs``-funktion är en klass- eller instansmetod, så mappas typen i ``TypeIs`` till typen för den andra parametern (efter ``cls`` eller ``self``).

source: In short, the form ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...``, means that if ``foo(arg)`` returns ``True``, then ``arg`` is an instance of ``TypeB``, and if it returns ``False``, it is not an instance of ``TypeB``.
sv: Kort sagt, formen ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...``, betyder att om ``foo(arg)`` returnerar ``True``, så är ``arg`` en instans av ``TypeB``, och om den returnerar ``False``, så är den inte en instans av ``TypeB``.

source: ``TypeIs`` also works with type variables. For more information, see :pep:`742` (Narrowing types with ``TypeIs``).
sv: ``TypeIs`` fungerar också med typvariabler. För mer information, se :pep:`742` (Begränsa typer med ``TypeIs``).

source: Type predicate functions are user-defined functions that return whether their argument is an instance of a particular type. ``TypeGuard`` works similarly to :data:`TypeIs`, but has subtly different effects on type checking behavior (see below).
sv: Type predicate functions är användardefinierade funktioner som returnerar om deras argument är en instans av en viss typ. ``TypeGuard`` fungerar på liknande sätt som :data:`TypeIs`, men har subtilt olika effekter på typkontrollbeteendet (se nedan).

source: Using ``-> TypeGuard`` tells the static type checker that for a given function:
sv: Att använda ``-> TypeGuard`` säger till den statiska typkontrollen att för en given funktion:

source: If the return value is ``True``, the type of its argument is the type inside ``TypeGuard``.
sv: Om returvärdet är ``True``, är typen av dess argument den typ som finns i ``TypeGuard``.

source: ``TypeGuard`` also works with type variables. See :pep:`647` for more details.
sv: ``TypeGuard`` fungerar även med typvariabler. Se :pep:`647` för mer information.

source: def is_str_list(val: list[object]) -> TypeGuard[list[str]]: '''Determines whether all objects in the list are strings''' return all(isinstance(x, str) for x in val) def func1(val: list[object]): if is_str_list(val): # Type of ``val`` is narrowed to ``list[str]``. print(" ".join(val)) else: # Type of ``val`` remains as ``list[object]``. print("Not a list of strings!")
sv: def is_str_list(val: list[object]) -> TypeGuard[list[str]]: '''Bestämmer om alla objekt i listan är strängar''' return all(isinstance(x, str) för x i val) def func1(val: lista[objekt]): if is_str_list(val): # Typen av ``val`` begränsas till ``list[str]``. print(" ".join(val)) else: # Typen av ``val`` förblir ``list[object]``. print("Inte en lista med strängar!")

source: ``TypeIs`` and ``TypeGuard`` differ in the following ways:
sv: ``TypeIs`` och ``TypeGuard`` skiljer sig åt på följande sätt:

source: ``TypeIs`` requires the narrowed type to be a subtype of the input type, while ``TypeGuard`` does not. The main reason is to allow for things like narrowing ``list[object]`` to ``list[str]`` even though the latter is not a subtype of the former, since ``list`` is invariant.
sv: ``TypeIs`` kräver att den inskränkta typen är en subtyp av inmatningstypen, medan ``TypeGuard`` inte gör det. Huvudskälet är att tillåta saker som att begränsa ``list[object]`` till ``list[str]`` även om den senare inte är en subtyp av den förra, eftersom ``list`` är invariant.

source: When a ``TypeGuard`` function returns ``True``, type checkers narrow the type of the variable to exactly the ``TypeGuard`` type. When a ``TypeIs`` function returns ``True``, type checkers can infer a more precise type combining the previously known type of the variable with the ``TypeIs`` type. (Technically, this is known as an intersection type.)
sv: När en ``TypeGuard``-funktion returnerar ``True``, begränsar typkontrollerna variabelns typ till exakt ``TypeGuard``-typen. När en ``TypeIs``-funktion returnerar ``True`` kan typkontrollanter härleda en mer exakt typ genom att kombinera den tidigare kända typen av variabeln med ``TypeIs``-typen. (Tekniskt sett är detta känt som en intersektionstyp.)
