Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: Python 2 is no longer supported, and most type checkers also no longer support type checking Python 2 code. Removal of the alias is not currently planned, but users are encouraged to use :class:`str` instead of ``Text``.
sv: Python 2 stöds inte längre, och de flesta typkontrollprogram stöder inte heller längre typkontroll av Python 2-kod. Det är för närvarande inte planerat att ta bort aliaset, men användare uppmuntras att använda :class:`str` istället för ``Text``.

source: Aliases to container ABCs in :mod:`collections.abc`
sv: Alias till container ABC i :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Set`.
sv: Föråldrat alias till :class:`collections.abc.Set`.

source: :class:`collections.abc.Set` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Set` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Collection`.
sv: Föråldrat alias till :class:`collections.abc.Collection`.

source: :class:`collections.abc.Collection` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Collection` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Container`.
sv: Föråldrat alias till :class:`collections.abc.Container`.

source: :class:`collections.abc.Container` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Container` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ItemsView`.
sv: Föråldrat alias till :class:`collections.abc.ItemsView`.

source: :class:`collections.abc.ItemsView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.ItemsView` stöder nu subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.KeysView`.
sv: Föråldrat alias till :class:`collections.abc.KeysView`.

source: :class:`collections.abc.KeysView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.KeysView` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Mapping`.
sv: Föråldrat alias till :class:`collections.abc.Mapping`.

source: :class:`collections.abc.Mapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Mapping` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MappingView`.
sv: Föråldrat alias till :class:`collections.abc.MappingView`.

source: :class:`collections.abc.MappingView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.MappingView` stöder nu subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableMapping`.
sv: Föråldrat alias till :class:`collections.abc.MutableMapping`.

source: :class:`collections.abc.MutableMapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.MutableMapping` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSequence`.
sv: Föråldrat alias till :class:`collections.abc.MutableSequence`.

source: :class:`collections.abc.MutableSequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.MutableSequence` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSet`.
sv: Föråldrat alias till :class:`collections.abc.MutableSet`.

source: :class:`collections.abc.MutableSet` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.MutableSet` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sequence`.
sv: Föråldrat alias till :class:`collections.abc.Sequence`.

source: :class:`collections.abc.Sequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Sequence` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ValuesView`.
sv: Föråldrat alias till :class:`collections.abc.ValuesView`.

source: :class:`collections.abc.ValuesView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.ValuesView` stöder nu subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Aliases to asynchronous ABCs in :mod:`collections.abc`
sv: Aliaser till asynkrona ABC i :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Coroutine`.
sv: Föråldrat alias till :class:`collections.abc.Coroutine`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Coroutine` and ``typing.Coroutine`` in type annotations.
sv: Se :ref:`annotating-generators-and-coroutines` för detaljer om hur man använder :class:`collections.abc.Coroutine` och ``typing.Coroutine`` i typannoteringar.

source: :class:`collections.abc.Coroutine` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Coroutine` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncGenerator`.
sv: Föråldrat alias till :class:`collections.abc.AsyncGenerator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.AsyncGenerator` and ``typing.AsyncGenerator`` in type annotations.
sv: Se :ref:`annotating-generators-and-coroutines` för detaljer om hur du använder :class:`collections.abc.AsyncGenerator` och ``typing.AsyncGenerator`` i typannoteringar.

source: :class:`collections.abc.AsyncGenerator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.AsyncGenerator` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: The ``SendType`` parameter now has a default.
sv: Parametern ``SendType`` har nu en standard.

source: Deprecated alias to :class:`collections.abc.AsyncIterable`.
sv: Föråldrat alias till :class:`collections.abc.AsyncIterable`.

source: :class:`collections.abc.AsyncIterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.AsyncIterable` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncIterator`.
sv: Föråldrat alias till :class:`collections.abc.AsyncIterator`.

source: :class:`collections.abc.AsyncIterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.AsyncIterator` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Awaitable`.
sv: Föråldrat alias till :class:`collections.abc.Awaitable`.

source: :class:`collections.abc.Awaitable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Awaitable` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Aliases to other ABCs in :mod:`collections.abc`
sv: Alias till andra ABC i :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Iterable`.
sv: Föråldrat alias till :class:`collections.abc.Iterable`.

source: :class:`collections.abc.Iterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Iterable` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Iterator`.
sv: Föråldrat alias till :class:`collections.abc.Iterator`.

source: :class:`collections.abc.Iterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Iterator` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Callable`.
sv: Föråldrat alias till :class:`collections.abc.Callable`.

source: See :ref:`annotating-callables` for details on how to use :class:`collections.abc.Callable` and ``typing.Callable`` in type annotations.
sv: Se :ref:`annotating-callables` för detaljer om hur man använder :class:`collections.abc.Callable` och ``typing.Callable`` i typannoteringar.

source: :class:`collections.abc.Callable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Callable` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Generator`.
sv: Föråldrat alias till :class:`collections.abc.Generator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Generator` and ``typing.Generator`` in type annotations.
sv: Se :ref:`annotating-generators-and-coroutines` för detaljer om hur man använder :class:`collections.abc.Generator` och ``typing.Generator`` i typannoteringar.

source: :class:`collections.abc.Generator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Generator` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Default values for the send and return types were added.
sv: Standardvärden för send- och return-typerna har lagts till.

source: Deprecated alias to :class:`collections.abc.Hashable`.
sv: Föråldrat alias till :class:`collections.abc.Hashable`.

source: Use :class:`collections.abc.Hashable` directly instead.
sv: Använd :class:`collections.abc.Hashable` direkt istället.

source: Deprecated alias to :class:`collections.abc.Reversible`.
sv: Föråldrat alias till :class:`collections.abc.Reversible`.

source: :class:`collections.abc.Reversible` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.abc.Reversible` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sized`.
sv: Föråldrat alias till :class:`collections.abc.Sized`.

source: Use :class:`collections.abc.Sized` directly instead.
sv: Använd :class:`collections.abc.Sized` direkt istället.

source: Aliases to :mod:`contextlib` ABCs
sv: Aliaser till :mod:`contextlib` ABC

source: Deprecated alias to :class:`contextlib.AbstractContextManager`.
sv: Föråldrat alias till :class:`contextlib.AbstractContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__enter__` method. The optional second type parameter, ``ExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__exit__` method.
sv: Den första typparametern, ``T_co``, representerar den typ som returneras av metoden :meth:`~object.__enter__`. Den valfria andra typ-parametern, ``ExitT_co``, som som standard är ``bool | None``, representerar den typ som returneras av metoden :meth:`~object.__exit__`.

source: :class:`contextlib.AbstractContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`contextlib.AbstractContextManager` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Added the optional second type parameter, ``ExitT_co``.
sv: Lagt till den valfria andra typparametern, ``ExitT_co``.

source: Deprecated alias to :class:`contextlib.AbstractAsyncContextManager`.
sv: Föråldrat alias till :class:`contextlib.AbstractAsyncContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__aenter__` method. The optional second type parameter, ``AExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__aexit__` method.
sv: Den första typparametern, ``T_co``, representerar den typ som returneras av metoden :meth:`~object.__aenter__`. Den valfria andra typ-parametern, ``AExitT_co``, som som standard är ``bool | None``, representerar den typ som returneras av metoden :meth:`~object.__aexit__`.

source: :class:`contextlib.AbstractAsyncContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`contextlib.AbstractAsyncContextManager` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Added the optional second type parameter, ``AExitT_co``.
sv: Den valfria andra typparametern ``AExitT_co`` har lagts till.

source: Deprecation Timeline of Major Features
sv: Tidslinje för utfasning av viktiga funktioner

source: Certain features in ``typing`` are deprecated and may be removed in a future version of Python. The following table summarizes major deprecations for your convenience. This is subject to change, and not all deprecations are listed.
sv: Vissa funktioner i ``typing`` är föråldrade och kan tas bort i en framtida version av Python. Följande tabell sammanfattar större föråldringar för din bekvämlighet. Detta kan komma att ändras, och alla föråldringar är inte listade.

source: Feature
sv: Funktion

source: Deprecated in
sv: Avskrivna i

source: Projected removal
sv: Förväntat borttagande

source: PEP/issue
sv: PEP/fråga

source: ``typing`` versions of standard collections
sv: ``typning`` av versioner av standardsamlingar

source: Undecided (see :ref:`deprecated-aliases` for more information)
sv: Obestämd (se :ref:`deprecated-aliases` för mer information)

source: Undecided
sv: Väntande

source: :class:`typing.Hashable` and :class:`typing.Sized`
sv: :class:`typing.Hashable` och :class:`typing.Sized`

source: :data:`typing.AnyStr`
sv: :data:`typning.AnyStr`
