Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: This decorator is itself not available at runtime. It is mainly intended to mark classes that are defined in type stub files if an implementation returns an instance of a private class::
sv: Denna dekorator är i sig inte tillgänglig vid körning. Den är främst avsedd att markera klasser som definieras i typstub-filer om en implementation returnerar en instans av en privat klass::

source: @type_check_only class Response: # private or not available at runtime code: int def get_header(self, name: str) -> str: ... def fetch_response() -> Response: ...
sv: @typ_kontroll_endast klass Svar: # privat eller inte tillgänglig vid körning kod: int def get_header(self, name: str) -> str: ... def fetch_response() -> Svar: ...

source: Note that returning instances of private classes is not recommended. It is usually preferable to make such classes public.
sv: Observera att det inte är rekommenderat att returnera instanser av privata klasser. Det är oftast att föredra att göra sådana klasser publika.

source: Introspection helpers
sv: Hjälpmedel för introspektion

source: Return a dictionary containing type hints for a function, method, module or class object.
sv: Returnerar en dictionary som innehåller typtips för en funktion, metod, modul eller klassobjekt.

source: This is often the same as ``obj.__annotations__``, but this function makes the following changes to the annotations dictionary:
sv: Detta är ofta samma sak som ``obj.__annotations__``, men denna funktion gör följande ändringar i annotationsordlistan:

source: Forward references encoded as string literals or :class:`ForwardRef` objects are handled by evaluating them in *globalns*, *localns*, and (where applicable) *obj*'s :ref:`type parameter <type-params>` namespace. If *globalns* or *localns* is not given, appropriate namespace dictionaries are inferred from *obj*.
sv: Framåtriktade referenser som kodas som stränglitteraler eller :class:`ForwardRef`-objekt hanteras genom att de utvärderas i *globalns*, *localns* och (i förekommande fall) *obj*:s :ref:`typparameter <type-params>` namnrymd. Om *globalns* eller *localns* inte anges, härleds lämpliga namnrymdsordböcker från *obj*.

source: ``None`` is replaced with :class:`types.NoneType`.
sv: ``None`` ersätts med :class:`types.NoneType`.

source: If :func:`@no_type_check <no_type_check>` has been applied to *obj*, an empty dictionary is returned.
sv: Om :func:`@no_type_check <no_type_check>` har tillämpats på *obj* returneras en tom ordbok.

source: If *obj* is a class ``C``, the function returns a dictionary that merges annotations from ``C``'s base classes with those on ``C`` directly. This is done by traversing :attr:`C.__mro__ <type.__mro__>` and iteratively combining ``__annotations__`` dictionaries. Annotations on classes appearing earlier in the :term:`method resolution order` always take precedence over annotations on classes appearing later in the method resolution order.
sv: Om *obj* är en klass ``C`` returnerar funktionen en ordbok som sammanfogar anteckningar från ``C`` basklasser med dem på ``C`` direkt. Detta görs genom att traversera :attr:`C.__mro__ <type.__mro__>` och iterativt kombinera ``__annotations__`` dictionaries. Anteckningar om klasser som förekommer tidigare i :term:``method resolution order`` har alltid företräde framför anteckningar om klasser som förekommer senare i metodupplösningsordningen.

source: The function recursively replaces all occurrences of ``Annotated[T, ...]`` with ``T``, unless *include_extras* is set to ``True`` (see :class:`Annotated` for more information).
sv: Funktionen ersätter rekursivt alla förekomster av ``Annotated[T, ...]`` med ``T``, såvida inte *include_extras* är satt till ``True`` (se :class:`Annotated` för mer information).

source: See also :func:`annotationlib.get_annotations`, a lower-level function that returns annotations more directly.
sv: Se även :func:`annotationlib.get_annotations`, en funktion på lägre nivå som returnerar annoteringar mer direkt.

source: If any forward references in the annotations of *obj* are not resolvable or are not valid Python code, this function will raise an exception such as :exc:`NameError`. For example, this can happen with imported :ref:`type aliases <type-aliases>` that include forward references, or with names imported under :data:`if TYPE_CHECKING <TYPE_CHECKING>`.
sv: Om några framåtriktade referenser i annoteringarna för *obj* inte kan lösas eller inte är giltig Python-kod, kommer denna funktion att ge upphov till ett undantag som :exc:`NameError`. Detta kan till exempel hända med importerade :ref:`type aliases <type-aliases>` som innehåller framåtriktade referenser, eller med namn som importeras under :data:`if TYPE_CHECKING <TYPE_CHECKING>`.

source: Added ``include_extras`` parameter as part of :pep:`593`. See the documentation on :data:`Annotated` for more information.
sv: Lade till parametern ``include_extras`` som en del av :pep:`593`. Se dokumentationen för :data:`Annotated` för mer information.

source: Previously, ``Optional[t]`` was added for function and method annotations if a default value equal to ``None`` was set. Now the annotation is returned unchanged.
sv: Tidigare lades ``Optional[t]`` till för funktions- och metodannoteringar om ett standardvärde som var lika med ``None`` angavs. Nu returneras annoteringen oförändrad.

source: Get the unsubscripted version of a type: for a typing object of the form ``X[Y, Z, ...]`` return ``X``.
sv: Hämta den osubscripterade versionen av en typ: för ett typobjekt av formen ``X[Y, Z, ...]`` returneras ``X``.

source: If ``X`` is a typing-module alias for a builtin or :mod:`collections` class, it will be normalized to the original class. If ``X`` is an instance of :class:`ParamSpecArgs` or :class:`ParamSpecKwargs`, return the underlying :class:`ParamSpec`. Return ``None`` for unsupported objects.
sv: Om ``X`` är ett typing-module alias för en inbyggd klass eller :mod:`collections` klass, kommer den att normaliseras till den ursprungliga klassen. Om ``X`` är en instans av :class:`ParamSpecArgs` eller :class:`ParamSpecKwargs`, returneras den underliggande :class:`ParamSpec`. Returnerar ``None`` för objekt som inte stöds.

source: Examples:
sv: Exempel:

source: assert get_origin(str) is None assert get_origin(Dict[str, int]) is dict assert get_origin(Union[int, str]) is Union assert get_origin(Annotated[str, "metadata"]) is Annotated P = ParamSpec('P') assert get_origin(P.args) is P assert get_origin(P.kwargs) is P
sv: assert get_origin(str) är ingen assert get_origin(Dict[str, int]) är dict assert get_origin(Union[int, str]) är Union assert get_origin(Annotated[str, "metadata"]) is Annotated P = ParamSpec('P') assert get_origin(P.args) is P assert get_origin(P.kwargs) är P

source: Get type arguments with all substitutions performed: for a typing object of the form ``X[Y, Z, ...]`` return ``(Y, Z, ...)``.
sv: Hämta typargument med alla substitutioner utförda: för ett typobjekt av formen ``X[Y, Z, ...]`` returneras ``(Y, Z, ...)``.

source: If ``X`` is a union or :class:`Literal` contained in another generic type, the order of ``(Y, Z, ...)`` may be different from the order of the original arguments ``[Y, Z, ...]`` due to type caching. Return ``()`` for unsupported objects.
sv: Om ``X`` är en union eller :class:`Literal` som ingår i en annan generisk typ, kan ordningen på ``(Y, Z, ...)`` skilja sig från ordningen på de ursprungliga argumenten ``[Y, Z, ...]`` på grund av typcaching. Returnera ``()`` för objekt som inte stöds.

source: Return the set of members defined in a :class:`Protocol`.
sv: Returnerar den uppsättning medlemmar som definieras i en :class:`Protocol`.

source: >>> from typing import Protocol, get_protocol_members >>> class P(Protocol): ... def a(self) -> str: ... ... b: int >>> get_protocol_members(P) == frozenset({'a', 'b'}) True
sv: >>> from typing import Protokoll, get_protocol_members >>> klass P(Protokoll): ... def a(self) -> str: ... ... b: int >>> get_protocol_members(P) == frozenset({'a', 'b'}) True

source: Raise :exc:`TypeError` for arguments that are not Protocols.
sv: Utlös :exc:`TypeError` för argument som inte är protokoll.

source: Determine if a type is a :class:`Protocol`.
sv: Avgör om en typ är en :class:`Protocol`.

source: class P(Protocol): def a(self) -> str: ... b: int is_protocol(P) # => True is_protocol(int) # => False
sv: klass P(Protokoll): def a(self) -> str: ... b: int is_protocol(P) # => True is_protocol(int) # => Falsk

source: Check if a type is a :class:`TypedDict`.
sv: Kontrollera om en typ är en :class:`TypedDict`.

source: class Film(TypedDict): title: str year: int assert is_typeddict(Film) assert not is_typeddict(list | str) # TypedDict is a factory for creating typed dicts, # not a typed dict itself assert not is_typeddict(TypedDict)
sv: klass Film(TypedDict): titel: str år: int assert is_typeddict(Film) assert not is_typeddict(lista | str) # TypedDict är en fabrik för att skapa typade dikter, # inte en typad dikt i sig själv assert not is_typeddict(TypedDict)

source: Class used for internal typing representation of string forward references.
sv: Klass som används för intern typningsrepresentation av strängens framåtriktade referenser.

source: For example, ``List["SomeClass"]`` is implicitly transformed into ``List[ForwardRef("SomeClass")]``. :class:`!ForwardRef` should not be instantiated by a user, but may be used by introspection tools.
sv: Exempelvis omvandlas ``List["SomeClass"]`` implicit till ``List[ForwardRef("SomeClass")]``. :class:`!ForwardRef` bör inte instansieras av en användare, men kan användas av introspektionsverktyg.

source: :pep:`585` generic types such as ``list["SomeClass"]`` will not be implicitly transformed into ``list[ForwardRef("SomeClass")]`` and thus will not automatically resolve to ``list[SomeClass]``.
sv: :pep:`585` generiska typer som ``list["SomeClass"]`` kommer inte att implicit transformeras till ``list[ForwardRef("SomeClass")]`` och kommer därför inte automatiskt att lösas upp till ``list[SomeClass]``.

source: This is now an alias for :class:`annotationlib.ForwardRef`. Several undocumented behaviors of this class have been changed; for example, after a ``ForwardRef`` has been evaluated, the evaluated value is no longer cached.
sv: Detta är nu ett alias för :class:`annotationlib.ForwardRef`. Flera odokumenterade beteenden hos denna klass har ändrats; till exempel, efter att en ``ForwardRef`` har utvärderats, cachelagras inte längre det utvärderade värdet.

source: Evaluate an :class:`annotationlib.ForwardRef` as a :term:`type hint`.
sv: Utvärdera en :class:`annotationlib.ForwardRef` som en :term:`type hint`.

source: This is similar to calling :meth:`annotationlib.ForwardRef.evaluate`, but unlike that method, :func:`!evaluate_forward_ref` also recursively evaluates forward references nested within the type hint.
sv: Detta liknar anropet av :meth:`annotationlib.ForwardRef.evaluate`, men till skillnad från den metoden utvärderar :func:`!evaluate_forward_ref` även framåtriktade referenser som är kapslade i typtipset rekursivt.

source: See the documentation for :meth:`annotationlib.ForwardRef.evaluate` for the meaning of the *owner*, *globals*, *locals*, *type_params*, and *format* parameters.
sv: Se dokumentationen för :meth:`annotationlib.ForwardRef.evaluate` för betydelsen av parametrarna *owner*, *globals*, *locals*, *type_params* och *format*.

source: A sentinel object used to indicate that a type parameter has no default value. For example:
sv: Ett sentinel-objekt som används för att ange att en typ-parameter inte har något standardvärde. Ett exempel:

source: >>> T = TypeVar("T") >>> T.__default__ is typing.NoDefault True >>> S = TypeVar("S", default=None) >>> S.__default__ is None True
sv: >>> T = TypeVar("T") >>> T.__default__ är typing.NoDefault Sant >>> S = TypeVar("S", default=None) >>> S.__default__ är Ingen True

source: Constant
sv: Konstant

source: A special constant that is assumed to be ``True`` by 3rd party static type checkers. It's ``False`` at runtime.
sv: En speciell konstant som antas vara ``True`` av statiska typkontrollanter från tredje part. Den är ``False`` vid runtime.

source: A module which is expensive to import, and which only contain types used for typing annotations, can be safely imported inside an ``if TYPE_CHECKING:`` block. This prevents the module from actually being imported at runtime; annotations aren't eagerly evaluated (see :pep:`649`) so using undefined symbols in annotations is harmless--as long as you don't later examine them. Your static type analysis tool will set ``TYPE_CHECKING`` to ``True`` during static type analysis, which means the module will be imported and the types will be checked properly during such analysis.
sv: En modul som är dyr att importera, och som bara innehåller typer som används för att skriva annoteringar, kan säkert importeras inuti ett ``if TYPE_CHECKING:``-block. Detta förhindrar att modulen faktiskt importeras vid körning; anteckningar utvärderas inte ivrigt (se :pep:`649`) så att använda odefinierade symboler i anteckningar är ofarligt - så länge du inte senare undersöker dem. Ditt statiska typanalysverktyg kommer att sätta ``TYPE_CHECKING`` till ``True`` under statisk typanalys, vilket innebär att modulen kommer att importeras och typerna kommer att kontrolleras korrekt under en sådan analys.

source: if TYPE_CHECKING: import expensive_mod def fun(arg: expensive_mod.SomeType) -> None: local_var: expensive_mod.AnotherType = other_fun()
sv: om TYPE_CHECKING: import dyr_mod def fun(arg: expensive_mod.SomeType) -> None: local_var: expensive_mod.AnotherType = other_fun()

source: If you occasionally need to examine type annotations at runtime which may contain undefined symbols, use :meth:`annotationlib.get_annotations` with a ``format`` parameter of :attr:`annotationlib.Format.STRING` or :attr:`annotationlib.Format.FORWARDREF` to safely retrieve the annotations without raising :exc:`NameError`.
sv: Om du ibland behöver undersöka typannoteringar vid körning som kan innehålla odefinierade symboler, använd :meth:`annotationlib.get_annotations` med en ``format`` parameter av :attr:`annotationlib.Format.STRING` eller :attr:`annotationlib.Format.FORWARDREF` för att säkert hämta annoteringarna utan att ge upphov till :exc:`NameError`.

source: Deprecated aliases
sv: Föråldrade alias

source: This module defines several deprecated aliases to pre-existing standard library classes. These were originally included in the :mod:`!typing` module in order to support parameterizing these generic classes using ``[]``. However, the aliases became redundant in Python 3.9 when the corresponding pre-existing classes were enhanced to support ``[]`` (see :pep:`585`).
sv: Denna modul definierar flera föråldrade alias till redan existerande standardbiblioteksklasser. Dessa ingick ursprungligen i modulen :mod:`!typing` för att stödja parametrisering av dessa generiska klasser med hjälp av ``[]``. Aliasen blev dock överflödiga i Python 3.9 när de motsvarande befintliga klasserna förbättrades för att stödja ``[]`` (se :pep:`585`).

source: The redundant types are deprecated as of Python 3.9. However, while the aliases may be removed at some point, removal of these aliases is not currently planned. As such, no deprecation warnings are currently issued by the interpreter for these aliases.
sv: De överflödiga typerna är föråldrade från och med Python 3.9. Men även om alias kan tas bort vid någon tidpunkt, är det för närvarande inte planerat att ta bort dessa alias. Därför utfärdas för närvarande inga deprecation-varningar av tolken för dessa alias.

source: If at some point it is decided to remove these deprecated aliases, a deprecation warning will be issued by the interpreter for at least two releases prior to removal. The aliases are guaranteed to remain in the :mod:`!typing` module without deprecation warnings until at least Python 3.14.
sv: Om det vid någon tidpunkt beslutas att ta bort dessa föråldrade aliaser, kommer en varning om föråldring att utfärdas av tolken i minst två utgåvor innan borttagningen. Aliasen kommer garanterat att finnas kvar i :mod:`!typing`-modulen utan deprecation-varningar fram till åtminstone Python 3.14.

source: Type checkers are encouraged to flag uses of the deprecated types if the program they are checking targets a minimum Python version of 3.9 or newer.
sv: Typkontrollanter uppmanas att flagga användningar av de föråldrade typerna om programmet de kontrollerar riktar sig till en minsta Python-version av 3.9 eller nyare.

source: Aliases to built-in types
sv: Aliaser till inbyggda typer

source: Deprecated alias to :class:`dict`.
sv: Föråldrat alias till :class:`dict`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Mapping` rather than to use :class:`dict` or :class:`!typing.Dict`.
sv: Observera att för att annotera argument är det bättre att använda en abstrakt samlingstyp som :class:`~collections.abc.Mapping` än att använda :class:`dict` eller :class:`!typing.Dict`.

source: :class:`builtins.dict <dict>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: class:`builtins.dict <dict>` stöder nu subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`list`.
sv: Föråldrat alias till :class:`list`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Sequence` or :class:`~collections.abc.Iterable` rather than to use :class:`list` or :class:`!typing.List`.
sv: Observera att för att annotera argument är det bättre att använda en abstrakt samlingstyp som :class:`~collections.abc.Sequence` eller :class:`~collections.abc.Iterable` än att använda :class:`list` eller :class:`!typing.List`.

source: :class:`builtins.list <list>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`builtins.list <list>` stöder nu subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.set <set>`.
sv: Föråldrat alias till :class:`builtins.set <set>`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`collections.abc.Set` rather than to use :class:`set` or :class:`typing.Set`.
sv: Observera att för att annotera argument är det bättre att använda en abstrakt samlingstyp som :class:`collections.abc.Set` än att använda :class:`set` eller :class:`typing.Set`.

source: :class:`builtins.set <set>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`builtins.set <set>` stöder nu subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.frozenset <frozenset>`.
sv: Föråldrat alias till :class:`builtins.frozenset <frozenset>`.

source: :class:`builtins.frozenset <frozenset>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`builtins.frozenset <frozenset>` har nu stöd för subscripting (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias for :class:`tuple`.
sv: Föråldrat alias för :class:`tuple`.

source: :class:`tuple` and ``Tuple`` are special-cased in the type system; see :ref:`annotating-tuples` for more details.
sv: :class:`tuple` och ``Tuple`` är specialfall i typsystemet; se :ref:`annotating-tuples` för mer information.

source: :class:`builtins.tuple <tuple>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`builtins.tuple <tuple>` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`type`.
sv: Föråldrat alias till :class:`type`.

source: See :ref:`type-of-class-objects` for details on using :class:`type` or ``typing.Type`` in type annotations.
sv: Se :ref:`type-of-class-objects` för detaljer om hur man använder :class:`type` eller ``typing.Type`` i typannoteringar.

source: :class:`builtins.type <type>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`builtins.type <type>` stöder nu subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Aliases to types in :mod:`collections`
sv: Alias till typer i :mod:`samlingar`

source: Deprecated alias to :class:`collections.defaultdict`.
sv: Föråldrat alias till :class:`collections.defaultdict`.

source: :class:`collections.defaultdict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.defaultdict` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.OrderedDict`.
sv: Föråldrat alias till :class:`collections.OrderedDict`.

source: :class:`collections.OrderedDict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.OrderedDict` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.ChainMap`.
sv: Föråldrat alias till :class:`collections.ChainMap`.

source: :class:`collections.ChainMap` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.ChainMap` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.Counter`.
sv: Föråldrat alias till :class:`collections.Counter`.

source: :class:`collections.Counter` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.Counter` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.deque`.
sv: Föråldrat alias till :class:`collections.deque`.

source: :class:`collections.deque` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
sv: :class:`collections.deque` har nu stöd för subskription (``[]``). Se :pep:`585` och :ref:`types-genericalias`.

source: Aliases to other concrete types
sv: Alias till andra konkreta typer

source: Deprecated aliases corresponding to the return types from :func:`re.compile` and :func:`re.match`.
sv: Föråldrade alias som motsvarar returtyperna från :func:`re.compile` och :func:`re.match`.

source: These types (and the corresponding functions) are generic over :data:`AnyStr`. ``Pattern`` can be specialised as ``Pattern[str]`` or ``Pattern[bytes]``; ``Match`` can be specialised as ``Match[str]`` or ``Match[bytes]``.
sv: Dessa typer (och motsvarande funktioner) är generiska över :data:`AnyStr`. ``Pattern`` kan specialiseras som ``Pattern[str]`` eller ``Pattern[bytes]``; ``Match`` kan specialiseras som ``Match[str]`` eller ``Match[bytes]``.

source: Classes ``Pattern`` and ``Match`` from :mod:`re` now support ``[]``. See :pep:`585` and :ref:`types-genericalias`.
sv: Klasserna ``Pattern`` och ``Match`` från :mod:`re` har nu stöd för ``[]``. Se :pep:`585` och :ref:`types-genericalias`.

source: Deprecated alias for :class:`str`.
sv: Föråldrat alias för :class:`str`.

source: ``Text`` is provided to supply a forward compatible path for Python 2 code: in Python 2, ``Text`` is an alias for ``unicode``.
sv: ``Text`` tillhandahålls för att tillhandahålla en framåtkompatibel sökväg för Python 2-kod: i Python 2 är ``Text`` ett alias för ``unicode``.

source: Use ``Text`` to indicate that a value must contain a unicode string in a manner that is compatible with both Python 2 and Python 3::
sv: Använd ``Text`` för att ange att ett värde måste innehålla en unicode-sträng på ett sätt som är kompatibelt med både Python 2 och Python 3::
