Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: When a ``TypeGuard`` function returns ``False``, type checkers cannot narrow the type of the variable at all. When a ``TypeIs`` function returns ``False``, type checkers can narrow the type of the variable to exclude the ``TypeIs`` type.
sv: När en ``TypeGuard``-funktion returnerar ``False`` kan typkontrollanter inte begränsa variabelns typ alls. När en ``TypeIs``-funktion returnerar ``False`` kan typkontrollanter begränsa variabelns typ för att utesluta ``TypeIs``-typen.

source: Typing operator to conceptually mark an object as having been unpacked.
sv: Typoperator för att konceptuellt markera att ett objekt har packats upp.

source: For example, using the unpack operator ``*`` on a :ref:`type variable tuple <typevartuple>` is equivalent to using ``Unpack`` to mark the type variable tuple as having been unpacked::
sv: Om du till exempel använder uppackningsoperatorn ``*`` på en :ref:`typvariabel-tupel <typevartuple>` är det likvärdigt med att använda ``Unpack`` för att markera att typvariabel-tupeln har packats upp::

source: Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Effectively does: tup: tuple[Unpack[Ts]]
sv: Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Gör det effektivt: tup: tuple[Unpack[Ts]]

source: In fact, ``Unpack`` can be used interchangeably with ``*`` in the context of :class:`typing.TypeVarTuple <TypeVarTuple>` and :class:`builtins.tuple <tuple>` types. You might see ``Unpack`` being used explicitly in older versions of Python, where ``*`` couldn't be used in certain places::
sv: I själva verket kan ``Unpack`` användas omväxlande med ``*`` i samband med :class:`typing.TypeVarTuple <TypeVarTuple>` och :class:`builtins.tuple <tuple>` typer. Du kan se ``Unpack`` användas explicit i äldre versioner av Python, där ``*`` inte kunde användas på vissa ställen::

source: # In older versions of Python, TypeVarTuple and Unpack # are located in the `typing_extensions` backports package. from typing_extensions import TypeVarTuple, Unpack Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Syntax error on Python <= 3.10! tup: tuple[Unpack[Ts]] # Semantically equivalent, and backwards-compatible
sv: # I äldre versioner av Python finns TypeVarTuple och Unpack # finns i bakportspaketet `typing_extensions`. from typing_extensions import TypeVarTuple, Unpack Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Syntaxfel på Python <= 3.10! tup: tuple[Unpack[Ts]] # Semantiskt likvärdig och bakåtkompatibel

source: ``Unpack`` can also be used along with :class:`typing.TypedDict` for typing ``**kwargs`` in a function signature::
sv: ``Unpack`` kan också användas tillsammans med :class:`typing.TypedDict` för att skriva ``**kwargs`` i en funktionssignatur::

source: from typing import TypedDict, Unpack class Movie(TypedDict): name: str year: int # This function expects two keyword arguments - `name` of type `str` # and `year` of type `int`. def foo(**kwargs: Unpack[Movie]): ...
sv: från typing import TypedDict, Packa upp klass Movie(TypedDict): namn: str år: int # Denna funktion förväntar sig två nyckelordsargument - `name` av typen `str` # och `year` av typen `int`. def foo(**kwargs: Unpack[Movie]): ...

source: See :pep:`692` for more details on using ``Unpack`` for ``**kwargs`` typing.
sv: Se :pep:`692` för mer information om att använda ``Unpack`` för ``**kwargs`` typning.

source: Building generic types and type aliases
sv: Skapa generiska typer och typaliaser

source: The following classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating generic types and type aliases.
sv: Följande klasser bör inte användas direkt som annotationer. Deras avsedda syfte är att vara byggstenar för att skapa generiska typer och typaliaser.

source: These objects can be created through special syntax (:ref:`type parameter lists <type-params>` and the :keyword:`type` statement). For compatibility with Python 3.11 and earlier, they can also be created without the dedicated syntax, as documented below.
sv: Dessa objekt kan skapas genom speciell syntax (:ref:`typ parameterlistor <type-params>` och :keyword:`type`-satsen). För kompatibilitet med Python 3.11 och tidigare kan de också skapas utan den särskilda syntaxen, enligt vad som dokumenteras nedan.

source: Abstract base class for generic types.
sv: Abstrakt basklass för generiska typer.

source: A generic type is typically declared by adding a list of type parameters after the class name::
sv: En generisk typ deklareras vanligen genom att en lista med typparametrar läggs till efter klassnamnet::

source: class Mapping[KT, VT]: def __getitem__(self, key: KT) -> VT: ... # Etc.
sv: klass Mapping[KT, VT]: def __getitem__(self, key: KT) -> VT: ... # Etc.

source: Such a class implicitly inherits from ``Generic``. The runtime semantics of this syntax are discussed in the :ref:`Language Reference <generic-classes>`.
sv: En sådan klass ärver implicit från ``Generic``. Körtidssemantiken för denna syntax diskuteras i :ref:``Language Reference <generic-classes>``.

source: This class can then be used as follows::
sv: Denna klass kan sedan användas på följande sätt::

source: def lookup_name[X, Y](mapping: Mapping[X, Y], key: X, default: Y) -> Y: try: return mapping[key] except KeyError: return default
sv: def lookup_name[X, Y](mapping: Mapping[X, Y], key: X, default: Y) -> Y: try: return mappning[nyckel] utom KeyError: returnera standard

source: Here the brackets after the function name indicate a :ref:`generic function <generic-functions>`.
sv: Här anger parenteserna efter funktionsnamnet en :ref:`generisk funktion <generic-functions>`.

source: For backwards compatibility, generic classes can also be declared by explicitly inheriting from ``Generic``. In this case, the type parameters must be declared separately::
sv: För bakåtkompatibilitet kan generiska klasser också deklareras genom att uttryckligen ärva från ``Generic``. I detta fall måste typ-parametrarna deklareras separat::

source: KT = TypeVar('KT') VT = TypeVar('VT') class Mapping(Generic[KT, VT]): def __getitem__(self, key: KT) -> VT: ... # Etc.
sv: KT = TypeVar('KT') VT = TypVar('VT') klass Mapping(Generic[KT, VT]): def __getitem__(self, key: KT) -> VT: ... # Etc.

source: Type variable.
sv: Typ av variabel.

source: The preferred way to construct a type variable is via the dedicated syntax for :ref:`generic functions <generic-functions>`, :ref:`generic classes <generic-classes>`, and :ref:`generic type aliases <generic-type-aliases>`::
sv: Det föredragna sättet att konstruera en typvariabel är via den särskilda syntaxen för :ref:`generiska funktioner <generic-functions>`, :ref:`generiska klasser <generic-classes>` och :ref:`generiska typalias <generic-type-aliases>`::

source: class Sequence[T]: # T is a TypeVar ...
sv: klass Sekvens[T]: # T är en TypeVar ...

source: This syntax can also be used to create bounded and constrained type variables::
sv: Denna syntax kan också användas för att skapa avgränsade och begränsade typvariabler::

source: class StrSequence[S: str]: # S is a TypeVar with a `str` upper bound; ... # we can say that S is "bounded by `str`" class StrOrBytesSequence[A: (str, bytes)]: # A is a TypeVar constrained to str or bytes ...
sv: klass StrSequence[S: str]: # S är en TypeVar med en övre gräns för `str`; ... # vi kan säga att S är "avgränsad av `str`" class StrOrBytesSequence[A: (str, bytes)]: # A är en TypeVar som begränsas till str eller bytes ...

source: However, if desired, reusable type variables can also be constructed manually, like so::
sv: Om så önskas kan återanvändbara typvariabler dock också konstrueras manuellt, på följande sätt::

source: T = TypeVar('T') # Can be anything S = TypeVar('S', bound=str) # Can be any subtype of str A = TypeVar('A', str, bytes) # Must be exactly str or bytes
sv: T = TypeVar('T') # Kan vara vad som helst S = TypeVar('S', bound=str) # Kan vara vilken subtyp som helst av str A = TypeVar('A', str, bytes) # Måste vara exakt str eller bytes

source: Type variables exist primarily for the benefit of static type checkers. They serve as the parameters for generic types as well as for generic function and type alias definitions. See :class:`Generic` for more information on generic types. Generic functions work as follows::
sv: Typvariabler är främst till för att underlätta för statiska typkontrollanter. De fungerar som parametrar för generiska typer samt för generiska funktions- och typaliasdefinitioner. Se :class:`Generic` för mer information om generiska typer. Generiska funktioner fungerar på följande sätt::

source: def repeat[T](x: T, n: int) -> Sequence[T]: """Return a list containing n references to x.""" return [x]*n def print_capitalized[S: str](x: S) -> S: """Print x capitalized, and return x.""" print(x.capitalize()) return x def concatenate[A: (str, bytes)](x: A, y: A) -> A: """Add two strings or bytes objects together.""" return x + y
sv: def repeat[T](x: T, n: int) -> Sekvens[T]: """Returnera en lista som innehåller n referenser till x."""" returnerar [x]*n def print_capitalized[S: str](x: S) -> S: """Skriv ut x med stora bokstäver och returnera x.""" print(x.capitalize()) returnerar x def concatenate[A: (str, bytes)](x: A, y: A) -> A: """Lägg ihop två strängar eller bytes-objekt.""" returnerar x + y

source: Note that type variables can be *bounded*, *constrained*, or neither, but cannot be both bounded *and* constrained.
sv: Observera att typvariabler kan vara *begränsade*, *begränsade* eller ingetdera, men kan inte vara både begränsade *och*begränsade.

source: The variance of type variables is inferred by type checkers when they are created through the :ref:`type parameter syntax <type-params>` or when ``infer_variance=True`` is passed. Manually created type variables may be explicitly marked covariant or contravariant by passing ``covariant=True`` or ``contravariant=True``. By default, manually created type variables are invariant. See :pep:`484` and :pep:`695` for more details.
sv: Variansen hos typvariabler härleds av typkontrollanter när de skapas genom :ref:`type-parametersyntaxen <type-params>` eller när ``infer_variance=True`` anges. Manuellt skapade typvariabler kan uttryckligen markeras som covarianta eller contravarianta genom att ange ``covariant=True`` eller ``contravariant=True``. Som standard är manuellt skapade typvariabler invarianta. Se :pep:`484` och :pep:`695` för mer information.

source: Bounded type variables and constrained type variables have different semantics in several important ways. Using a *bounded* type variable means that the ``TypeVar`` will be solved using the most specific type possible::
sv: Variabler av typen Bounded och variabler av typen Constrained har olika semantik på flera viktiga sätt. Att använda en *begränsad* typvariabel innebär att ``TypeVar`` kommer att lösas med hjälp av den mest specifika typ som är möjlig::

source: x = print_capitalized('a string') reveal_type(x) # revealed type is str class StringSubclass(str): pass y = print_capitalized(StringSubclass('another string')) reveal_type(y) # revealed type is StringSubclass z = print_capitalized(45) # error: int is not a subtype of str
sv: x = print_capitalized('en sträng') reveal_type(x) # avslöjad typ är str klass StringSubclass(str): pass y = print_capitalized(StringSubclass('en annan sträng')) reveal_type(y) # avslöjad typ är StringSubclass z = print_capitalized(45) # fel: int är inte en subtyp av str

source: The upper bound of a type variable can be a concrete type, abstract type (ABC or Protocol), or even a union of types::
sv: Den övre gränsen för en typvariabel kan vara en konkret typ, en abstrakt typ (ABC eller Protocol) eller till och med en sammanslagning av typer::

source: # Can be anything with an __abs__ method def print_abs[T: SupportsAbs](arg: T) -> None: print("Absolute value:", abs(arg)) U = TypeVar('U', bound=str|bytes) # Can be any subtype of the union str|bytes V = TypeVar('V', bound=SupportsAbs) # Can be anything with an __abs__ method
sv: # Kan vara vad som helst med en __abs__-metod def print_abs[T: SupportsAbs](arg: T) -> None: print("Absolut värde:", abs(arg)) U = TypeVar('U', bound=str|bytes) # Kan vara vilken subtyp som helst av unionen str|bytes V = TypeVar('V', bound=SupportsAbs) # Kan vara vad som helst med en __abs__-metod

source: Using a *constrained* type variable, however, means that the ``TypeVar`` can only ever be solved as being exactly one of the constraints given::
sv: Att använda en *begränsad* typvariabel innebär dock att ``TypVar`` bara någonsin kan lösas som exakt en av de begränsningar som anges::

source: a = concatenate('one', 'two') reveal_type(a) # revealed type is str b = concatenate(StringSubclass('one'), StringSubclass('two')) reveal_type(b) # revealed type is str, despite StringSubclass being passed in c = concatenate('one', b'two') # error: type variable 'A' can be either str or bytes in a function call, but not both
sv: a = konkatenera('ett', 'två') reveal_type(a) # avslöjad typ är str b = konkatenera(StringSubclass('ett'), StringSubclass('två')) reveal_type(b) # avslöjad typ är str, trots att StringSubclass skickades in c = concatenate('one', b'two') # fel: typvariabeln 'A' kan vara antingen str eller bytes i ett funktionsanrop, men inte båda

source: At runtime, ``isinstance(x, T)`` will raise :exc:`TypeError`.
sv: Vid körning kommer ``isinstance(x, T)`` att ge upphov till :exc:`TypeError`.

source: The name of the type variable.
sv: Namnet på typvariabeln.

source: Whether the type var has been explicitly marked as covariant.
sv: Om typen var uttryckligen har markerats som kovariant.

source: Whether the type var has been explicitly marked as contravariant.
sv: Om typen var uttryckligen har markerats som kontravariant.

source: Whether the type variable's variance should be inferred by type checkers.
sv: Huruvida typvariabelns varians ska härledas av typkontrollanter.

source: The upper bound of the type variable, if any.
sv: Den övre gränsen för typvariabeln, om sådan finns.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the bound is evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
sv: För typvariabler som skapats genom :ref:`typ parametersyntax <type-params>` utvärderas bindningen endast när attributet används, inte när typvariabeln skapas (se :ref:`lazy-evaluation`).

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVar.__bound__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVar.__bound__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
sv: En :term:`evaluate-funktion` som motsvarar attributet :attr:`~TypeVar.__bound__`. Vid direkt anrop stöder denna metod endast formatet :attr:`~annotationlib.Format.VALUE`, vilket motsvarar direkt åtkomst till attributet :attr:`~TypeVar.__bound__`, men metodobjektet kan skickas till :func:`annotationlib.call_evaluate_function` för att utvärdera värdet i ett annat format.

source: A tuple containing the constraints of the type variable, if any.
sv: En tupel som innehåller begränsningarna för typvariabeln, om sådana finns.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the constraints are evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
sv: För typvariabler som skapats genom :ref:`type parameter syntax <type-params>` utvärderas begränsningarna endast när attributet används, inte när typvariabeln skapas (se :ref:`lazy-evaluation`).

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVar.__constraints__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVar.__constraints__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
sv: En :term:`evaluate-funktion` som motsvarar attributet :attr:`~TypeVar.__constraints__`. Vid direkt anrop stöder denna metod endast formatet :attr:`~annotationlib.Format.VALUE`, vilket motsvarar direkt åtkomst till attributet :attr:`~TypeVar.__constraints__`, men metodobjektet kan skickas till :func:`annotationlib.call_evaluate_function` för att utvärdera värdet i ett annat format.

source: The default value of the type variable, or :data:`typing.NoDefault` if it has no default.
sv: Typvariabelns standardvärde, eller :data:`typing.NoDefault` om den inte har något standardvärde.

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVar.__default__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVar.__default__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
sv: En :term:`evaluate-funktion` som motsvarar attributet :attr:`~TypeVar.__default__`. Vid direkt anrop stöder denna metod endast formatet :attr:`~annotationlib.Format.VALUE`, vilket motsvarar direkt åtkomst till attributet :attr:`~TypeVar.__default__`, men metodobjektet kan skickas till :func:`annotationlib.call_evaluate_function` för att utvärdera värdet i ett annat format.

source: Return whether or not the type variable has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
sv: Returnerar om typvariabeln har ett standardvärde eller inte. Detta är likvärdigt med att kontrollera om :attr:`__default__` inte är :data:`typing.NoDefault` singleton, förutom att det inte tvingar fram utvärdering av :ref:`lazily evaluated <lazy-evaluation>` standardvärde.

source: Type variables can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`. The ``infer_variance`` parameter was added.
sv: Typvariabler kan nu deklareras med hjälp av syntaxen :ref:`type parameter <type-params>` som introducerades av :pep:`695`. Parametern ``infer_variance`` har lagts till.

source: Support for default values was added.
sv: Stöd för standardvärden har lagts till.

source: Type variable tuple. A specialized form of :ref:`type variable <typevar>` that enables *variadic* generics.
sv: Typvariabel-tupel. En specialiserad form av :ref:`typvariabel <typevar>` som möjliggör *variadisk* generik.

source: Type variable tuples can be declared in :ref:`type parameter lists <type-params>` using a single asterisk (``*``) before the name::
sv: Typvariabeltuples kan deklareras i :ref:`typparameterlistor <type-params>` med en enda asterisk (``*``) före namnet::

source: Or by explicitly invoking the ``TypeVarTuple`` constructor::
sv: Eller genom att uttryckligen anropa ``TypeVarTuple``-konstruktören::

source: T = TypeVar("T") Ts = TypeVarTuple("Ts") def move_first_element_to_last(tup: tuple[T, *Ts]) -> tuple[*Ts, T]: return (*tup[1:], tup[0])
sv: T = TypVar("T") Ts = TypeVarTuple("Ts") def move_first_element_to_last(tup: tuple[T, *Ts]) -> tuple[*Ts, T]: return (*tup[1:], tup[0])

source: A normal type variable enables parameterization with a single type. A type variable tuple, in contrast, allows parameterization with an *arbitrary* number of types by acting like an *arbitrary* number of type variables wrapped in a tuple. For example::
sv: En normal typvariabel möjliggör parametrisering med en enda typ. En typvariabel-tupel, däremot, tillåter parameterisering med ett *viljilöst* antal typer genom att fungera som ett *viljilöst* antal typvariabler som är förpackade i en tupel. Till exempel::

source: # T is bound to int, Ts is bound to () # Return value is (1,), which has type tuple[int] move_first_element_to_last(tup=(1,)) # T is bound to int, Ts is bound to (str,) # Return value is ('spam', 1), which has type tuple[str, int] move_first_element_to_last(tup=(1, 'spam')) # T is bound to int, Ts is bound to (str, float) # Return value is ('spam', 3.0, 1), which has type tuple[str, float, int] move_first_element_to_last(tup=(1, 'spam', 3.0)) # This fails to type check (and fails at runtime) # because tuple[()] is not compatible with tuple[T, *Ts] # (at least one element is required) move_first_element_to_last(tup=())
sv: # T är bundet till int, Ts är bundet till () # Returvärdet är (1,), som har typen tuple[int] flytta_första_elementet_till_det_senaste(tup=(1,)) # T är bundet till int, Ts är bundet till (str,) # Returvärdet är ('spam', 1), som har typen tuple[str, int] move_first_element_to_last(tup=(1, 'spam')) # T är bundet till int, Ts är bundet till (str, float) # Returvärdet är ('spam', 3.0, 1), som har typen tuple[str, float, int] move_first_element_to_last(tup=(1, 'spam', 3.0)) # Detta misslyckas med typkontrollen (och misslyckas vid körning) # eftersom tuple[()] inte är kompatibel med tuple[T, *Ts] # (minst ett element krävs) move_first_element_to_last(tup=())

source: Note the use of the unpacking operator ``*`` in ``tuple[T, *Ts]``. Conceptually, you can think of ``Ts`` as a tuple of type variables ``(T1, T2, ...)``. ``tuple[T, *Ts]`` would then become ``tuple[T, *(T1, T2, ...)]``, which is equivalent to ``tuple[T, T1, T2, ...]``. (Note that in older versions of Python, you might see this written using :data:`Unpack <Unpack>` instead, as ``Unpack[Ts]``.)
sv: Notera användningen av uppackningsoperatorn ``*`` i ``tuple[T, *Ts]``. Konceptuellt kan du tänka på ``Ts`` som en tupel av typvariabler ``(T1, T2, ...)``. ``tuple[T, *Ts]`` skulle då bli ``tuple[T, *(T1, T2, ...)]``, vilket är likvärdigt med ``tuple[T, T1, T2, ...]``. (Observera att i äldre versioner av Python kan du se detta skrivet med :data:`Unpack <Unpack>` istället, som ``Unpack[Ts]``.)

source: Type variable tuples must *always* be unpacked. This helps distinguish type variable tuples from normal type variables::
sv: Typvariabeltuples måste *alltid* vara uppackade. Detta hjälper till att skilja typvariabeltuples från vanliga typvariabler::

source: x: Ts # Not valid x: tuple[Ts] # Not valid x: tuple[*Ts] # The correct way to do it
sv: x: Ts # Inte giltig x: tuple[Ts] # Inte giltig x: tuple[*Ts] # Det korrekta sättet att göra det

source: Type variable tuples can be used in the same contexts as normal type variables. For example, in class definitions, arguments, and return types::
sv: Typvariabeltuples kan användas i samma sammanhang som vanliga typvariabler. Till exempel i klassdefinitioner, argument och returtyper::

source: class Array[*Shape]: def __getitem__(self, key: tuple[*Shape]) -> float: ... def __abs__(self) -> "Array[*Shape]": ... def get_shape(self) -> tuple[*Shape]: ...
sv: klass Array[*Shape]: def __getitem__(self, key: tuple[*Shape]) -> float: ... def __abs__(self) -> "Array[*Shape]": ... def get_shape(self) -> tuple[*Shape]: ...

source: Type variable tuples can be happily combined with normal type variables:
sv: Typvariabeltuples kan kombineras med vanliga typvariabler:

source: class Array[DType, *Shape]: # This is fine pass class Array2[*Shape, DType]: # This would also be fine pass class Height: ... class Width: ... float_array_1d: Array[float, Height] = Array() # Totally fine int_array_2d: Array[int, Height, Width] = Array() # Yup, fine too
sv: klass Array[DType, *Shape]: # Det här är bra passera klassen Array2[*Shape, DType]: # Det här skulle också vara bra pass klass Höjd: ... class Bredd: ... float_array_1d: Array[float, Height] = Array() # Helt okej int_array_2d: Array[int, Height, Width] = Array() # Japp, det går också bra
