Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: :mod:`!typing` --- Support for type hints
sv: :mod:`!typing` --- Stöd för typtips

source: **Source code:** :source:`Lib/typing.py`
sv: **Källkod:** :source:`Lib/typing.py`

source: The Python runtime does not enforce function and variable type annotations. They can be used by third party tools such as :term:`type checkers <static type checker>`, IDEs, linters, etc.
sv: Pythons runtime tvingar inte fram funktions- och variabeltypsannoteringar. De kan användas av tredjepartsverktyg som :term:`typkontroll <static type checker>`, IDE:er, linters, etc.

source: This module provides runtime support for type hints.
sv: Denna modul ger runtime-stöd för typtips.

source: Consider the function below::
sv: Tänk på funktionen nedan::

source: def surface_area_of_cube(edge_length: float) -> str: return f"The surface area of the cube is {6 * edge_length ** 2}."
sv: def surface_area_of_cube(edge_length: float) -> str: return f"Kubens yta är {6 * kantlängd ** 2}."

source: The function ``surface_area_of_cube`` takes an argument expected to be an instance of :class:`float`, as indicated by the :term:`type hint` ``edge_length: float``. The function is expected to return an instance of :class:`str`, as indicated by the ``-> str`` hint.
sv: Funktionen ``surface_area_of_cube`` tar ett argument som förväntas vara en instans av :class:`float`, vilket indikeras av :term:`type hint` ``edge_length: float``. Funktionen förväntas returnera en instans av :class:`str`, vilket indikeras av ``-> str`` hintet.

source: While type hints can be simple classes like :class:`float` or :class:`str`, they can also be more complex. The :mod:`typing` module provides a vocabulary of more advanced type hints.
sv: Även om typhänvisningar kan vara enkla klasser som :class:`float` eller :class:`str`, kan de också vara mer komplexa. Modulen :mod:`typing` tillhandahåller en vokabulär med mer avancerade typhänvisningar.

source: New features are frequently added to the ``typing`` module. The :pypi:`typing_extensions` package provides backports of these new features to older versions of Python.
sv: Nya funktioner läggs ofta till i modulen ``typing``. Paketet :pypi:`typing_extensions` tillhandahåller bakåtporter av dessa nya funktioner till äldre versioner av Python.

source: A quick overview of type hints (hosted at the mypy docs)
sv: En snabb översikt över typtips (värd på mypy-dokumenten)

source: Type System Reference section of `the mypy docs <https://mypy.readthedocs.io/en/stable/index.html>`_
sv: Type System Reference-avsnittet av `the mypy docs <https://mypy.readthedocs.io/en/stable/index.html>`_

source: The Python typing system is standardised via PEPs, so this reference should broadly apply to most Python type checkers. (Some parts may still be specific to mypy.)
sv: Pythons typsystem är standardiserat via PEPs, så denna referens bör i stort sett gälla för de flesta Python-typkontrollörer. (Vissa delar kan fortfarande vara specifika för mypy.)

source: Type-checker-agnostic documentation written by the community detailing type system features, useful typing related tools and typing best practices.
sv: Typkontrollagnostisk dokumentation skriven av communityn som beskriver typsystemets funktioner, användbara typrelaterade verktyg och bästa praxis för typning.

source: Specification for the Python Type System
sv: Specifikation för Pythons typsystem

source: The canonical, up-to-date specification of the Python type system can be found at `Specification for the Python type system <https://typing.python.org/en/latest/spec/index.html>`_.
sv: Den kanoniska, uppdaterade specifikationen för Pythons typsystem finns på `Specification for the Python type system <https://typing.python.org/en/latest/spec/index.html>`_.

source: Type aliases
sv: Typ av alias

source: A type alias is defined using the :keyword:`type` statement, which creates an instance of :class:`TypeAliasType`. In this example, ``Vector`` and ``list[float]`` will be treated equivalently by static type checkers::
sv: Ett typalias definieras med hjälp av :keyword:`type`-satsen, som skapar en instans av :class:`TypeAliasType`. I det här exemplet kommer ``Vector`` och ``list[float]`` att behandlas likvärdigt av statiska typkontrollanter::

source: type Vector = list[float] def scale(scalar: float, vector: Vector) -> Vector: return [scalar * num for num in vector] # passes type checking; a list of floats qualifies as a Vector. new_vector = scale(2.0, [1.0, -4.2, 5.4])
sv: typ Vektor = lista[float] def scale(scalar: float, vector: Vector) -> Vector: return [skalär * num för num i vektor] # klarar typkontroll; en lista med flottörer kvalificerar sig som en vektor. ny_vektor = skala(2,0, [1,0, -4,2, 5,4])

source: Type aliases are useful for simplifying complex type signatures. For example::
sv: Typaliaser är användbara för att förenkla komplexa typsignaturer. Till exempel::

source: from collections.abc import Sequence type ConnectionOptions = dict[str, str] type Address = tuple[str, int] type Server = tuple[Address, ConnectionOptions] def broadcast_message(message: str, servers: Sequence[Server]) -> None: ... # The static type checker will treat the previous type signature as # being exactly equivalent to this one. def broadcast_message( message: str, servers: Sequence[tuple[tuple[str, int], dict[str, str]]] ) -> None: ...
sv: från collections.abc import Sequence type ConnectionOptions = dict[str, str] type Address = tuple[str, int] type Server = tuple[Adress, ConnectionOptions] def broadcast_message(message: str, servers: Sequence[Server]) -> None: ... # Den statiska typkontrollen kommer att behandla den föregående typsignaturen som # som exakt likvärdig med den här. def broadcast_message( meddelande: str, servrar: Sequence[tuple[tuple[str, int], dict[str, str]]]] ) -> Ingen: ...

source: The :keyword:`type` statement is new in Python 3.12. For backwards compatibility, type aliases can also be created through simple assignment::
sv: Satsen :keyword:`type` är ny i Python 3.12. För bakåtkompatibilitet kan typaliaser också skapas genom enkel tilldelning::

source: Vector = list[float]
sv: Vektor = lista[float]

source: Or marked with :data:`TypeAlias` to make it explicit that this is a type alias, not a normal variable assignment::
sv: Eller markerad med :data:`TypeAlias` för att göra det tydligt att detta är ett typalias, inte en normal variabeltilldelning::

source: from typing import TypeAlias Vector: TypeAlias = list[float]
sv: från typing import TypeAlias Vektor: TypeAlias = lista[float]

source: NewType
sv: NyTyp

source: Use the :class:`NewType` helper to create distinct types::
sv: Använd hjälpen :class:`NewType` för att skapa distinkta typer::

source: from typing import NewType UserId = NewType('UserId', int) some_id = UserId(524313)
sv: från typing import NewType UserId = NewType('UserId', int) some_id = UserId(524313)

source: The static type checker will treat the new type as if it were a subclass of the original type. This is useful in helping catch logical errors::
sv: Den statiska typkontrollen behandlar den nya typen som om den vore en subklass av den ursprungliga typen. Detta är användbart för att hjälpa till att fånga logiska fel::

source: def get_user_name(user_id: UserId) -> str: ... # passes type checking user_a = get_user_name(UserId(42351)) # fails type checking; an int is not a UserId user_b = get_user_name(-1)
sv: def get_user_name(user_id: UserId) -> str: ... # passerar typkontroll user_a = get_user_name(UserId(42351)) # misslyckas med typkontroll; en int är inte en UserId user_b = get_user_name(-1)

source: You may still perform all ``int`` operations on a variable of type ``UserId``, but the result will always be of type ``int``. This lets you pass in a ``UserId`` wherever an ``int`` might be expected, but will prevent you from accidentally creating a ``UserId`` in an invalid way::
sv: Du kan fortfarande utföra alla ``int``-operationer på en variabel av typen ``UserId``, men resultatet kommer alltid att vara av typen ``int``. Detta gör att du kan skicka in ett ``UserId`` överallt där ett ``int`` kan förväntas, men förhindrar att du av misstag skapar ett ``UserId`` på ett ogiltigt sätt::

source: # 'output' is of type 'int', not 'UserId' output = UserId(23413) + UserId(54341)
sv: # 'output' är av typen 'int', inte 'UserId' output = UserId(23413) + UserId(54341)

source: Note that these checks are enforced only by the static type checker. At runtime, the statement ``Derived = NewType('Derived', Base)`` will make ``Derived`` a callable that immediately returns whatever parameter you pass it. That means the expression ``Derived(some_value)`` does not create a new class or introduce much overhead beyond that of a regular function call.
sv: Observera att dessa kontroller endast verkställs av den statiska typkontrollen. Vid körning kommer uttalandet ``Derived = NewType('Derived', Base)`` att göra ``Derived`` till en callable som omedelbart returnerar vilken parameter du än ger den. Det betyder att uttrycket ``Derived(some_value)`` inte skapar en ny klass eller introducerar mycket overhead utöver det som ett vanligt funktionsanrop gör.

source: More precisely, the expression ``some_value is Derived(some_value)`` is always true at runtime.
sv: Mer exakt är uttrycket ``något_värde är Derived(något_värde)`` alltid sant vid körning.

source: It is invalid to create a subtype of ``Derived``::
sv: Det är ogiltigt att skapa en subtyp av ``Derived``::

source: from typing import NewType UserId = NewType('UserId', int) # Fails at runtime and does not pass type checking class AdminUserId(UserId): pass
sv: från typing import NewType UserId = NewType('UserId', int) # Misslyckas vid körning och klarar inte typkontroll class AdminUserId(UserId): pass

source: However, it is possible to create a :class:`NewType` based on a 'derived' ``NewType``::
sv: Det är dock möjligt att skapa en :class:`NewType` baserad på en 'härledd' ``NewType``::

source: from typing import NewType UserId = NewType('UserId', int) ProUserId = NewType('ProUserId', UserId)
sv: från typing import NewType UserId = NewType('UserId', int) ProUserId = NewType('ProUserId', UserId)

source: and typechecking for ``ProUserId`` will work as expected.
sv: och typkontroll för ``ProUserId`` kommer att fungera som förväntat.

source: See :pep:`484` for more details.
sv: Se :pep:`484` för mer information.

source: Recall that the use of a type alias declares two types to be *equivalent* to one another. Doing ``type Alias = Original`` will make the static type checker treat ``Alias`` as being *exactly equivalent* to ``Original`` in all cases. This is useful when you want to simplify complex type signatures.
sv: Kom ihåg att användningen av ett typalias förklarar att två typer är *ekvivalenta* med varandra. Genom att göra ``typ Alias = Original`` kommer den statiska typkontrollen att behandla ``Alias`` som *exakt likvärdig* med ``Original`` i alla fall. Detta är användbart när du vill förenkla komplexa typsignaturer.

source: In contrast, ``NewType`` declares one type to be a *subtype* of another. Doing ``Derived = NewType('Derived', Original)`` will make the static type checker treat ``Derived`` as a *subclass* of ``Original``, which means a value of type ``Original`` cannot be used in places where a value of type ``Derived`` is expected. This is useful when you want to prevent logic errors with minimal runtime cost.
sv: Däremot förklarar ``NewType`` att en typ är en *subtyp* av en annan. Om du gör ``Derived = NewType('Derived', Original)`` kommer den statiska typkontrollen att behandla ``Derived`` som en *subklass* av ``Original``, vilket innebär att ett värde av typen ``Original`` inte kan användas på platser där ett värde av typen ``Derived`` förväntas. Detta är användbart när du vill förhindra logiska fel med minimal körtidskostnad.

source: ``NewType`` is now a class rather than a function. As a result, there is some additional runtime cost when calling ``NewType`` over a regular function.
sv: ``NewType`` är nu en klass snarare än en funktion. Som ett resultat av detta finns det en viss extra körtidskostnad när man anropar ``NewType`` över en vanlig funktion.

source: The performance of calling ``NewType`` has been restored to its level in Python 3.9.
sv: Prestandan för att anropa ``NewType`` har återställts till samma nivå som i Python 3.9.

source: Annotating callable objects
sv: Annotering av anropsbara objekt

source: Functions -- or other :term:`callable` objects -- can be annotated using :class:`collections.abc.Callable` or deprecated :data:`typing.Callable`. ``Callable[[int], str]`` signifies a function that takes a single parameter of type :class:`int` and returns a :class:`str`.
sv: Funktioner -- eller andra :term:`callable`-objekt -- kan annoteras med :class:`collections.abc.Callable` eller den föråldrade :data:`typing.Callable`. ``Callable[[int], str]`` betecknar en funktion som tar en enda parameter av typen :class:`int` och returnerar en :class:`str`.

source: For example:
sv: Till exempel:

source: The subscription syntax must always be used with exactly two values: the argument list and the return type. The argument list must be a list of types, a :class:`ParamSpec`, :data:`Concatenate`, or an ellipsis. The return type must be a single type.
sv: Subscriptionsyntaxen måste alltid användas med exakt två värden: argumentlistan och returtypen. Argumentlistan måste vara en lista med typer, en :class:`ParamSpec`, :data:`Concatenate` eller en ellips. Returtypen måste vara en enda typ.

source: If a literal ellipsis ``...`` is given as the argument list, it indicates that a callable with any arbitrary parameter list would be acceptable:
sv: Om en bokstavlig ellips ``...`` anges som argumentlista, indikerar det att en callable med godtycklig parameterlista skulle vara acceptabel:

source: def concat(x: str, y: str) -> str: return x + y x: Callable[..., str] x = str # OK x = concat # Also OK
sv: def concat(x: str, y: str) -> str: returnerar x + y x: Kallbar[..., str] x = str # OK x = concat # Också OK

source: ``Callable`` cannot express complex signatures such as functions that take a variadic number of arguments, :ref:`overloaded functions <overload>`, or functions that have keyword-only parameters. However, these signatures can be expressed by defining a :class:`Protocol` class with a :meth:`~object.__call__` method:
sv: ``Callable`` kan inte uttrycka komplexa signaturer som funktioner som tar ett variabelt antal argument, :ref:``overloaded functions <overload>``, eller funktioner som har parametrar som endast innehåller nyckelord. Dessa signaturer kan dock uttryckas genom att definiera en :class:`Protocol`-klass med en :meth:`~object.__call__`-metod:

source: Callables which take other callables as arguments may indicate that their parameter types are dependent on each other using :class:`ParamSpec`. Additionally, if that callable adds or removes arguments from other callables, the :data:`Concatenate` operator may be used. They take the form ``Callable[ParamSpecVariable, ReturnType]`` and ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]`` respectively.
sv: Anropsbara filer som tar andra anropsbara filer som argument kan ange att deras parametertyper är beroende av varandra med hjälp av :class:`ParamSpec`. Dessutom, om denna anropsbarhet lägger till eller tar bort argument från andra anropsbara objekt, kan operatorn :data:`Concatenate` användas. De har formen ``Callable[ParamSpecVariable, ReturnType]`` respektive ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]``.

source: ``Callable`` now supports :class:`ParamSpec` and :data:`Concatenate`. See :pep:`612` for more details.
sv: ``Callable`` stöder nu :class:`ParamSpec` och :data:`Concatenate`. Se :pep:`612` för mer information.

source: The documentation for :class:`ParamSpec` and :class:`Concatenate` provides examples of usage in ``Callable``.
sv: Dokumentationen för :class:`ParamSpec` och :class:`Concatenate` ger exempel på användning i ``Callable``.

source: Generics
sv: Generiska läkemedel

source: Since type information about objects kept in containers cannot be statically inferred in a generic way, many container classes in the standard library support subscription to denote the expected types of container elements.
sv: Eftersom typinformation om objekt som förvaras i containrar inte kan härledas statiskt på ett generiskt sätt, stöder många containerklasser i standardbiblioteket subscription för att ange de förväntade typerna av containerelement.

source: Generic functions and classes can be parameterized by using :ref:`type parameter syntax <type-params>`::
sv: Generiska funktioner och klasser kan parametriseras med hjälp av :ref:`type parameter syntax <type-params>`::

source: from collections.abc import Sequence def first[T](l: Sequence[T]) -> T: # Function is generic over the TypeVar "T" return l[0]
sv: från collections.abc import Sequence def first[T](l: Sequence[T]) -> T: # Funktionen är generisk över TypeVar "T" return l[0]

source: Or by using the :class:`TypeVar` factory directly::
sv: Eller genom att använda :class:`TypeVar`-fabriken direkt::

source: Syntactic support for generics is new in Python 3.12.
sv: Syntaktiskt stöd för generics är nytt i Python 3.12.

source: Annotating tuples
sv: Annotering av tuples

source: For most containers in Python, the typing system assumes that all elements in the container will be of the same type. For example::
sv: För de flesta behållare i Python förutsätter typningssystemet att alla element i behållaren är av samma typ. Till exempel::

source: from collections.abc import Mapping # Type checker will infer that all elements in ``x`` are meant to be ints x: list[int] = [] # Type checker error: ``list`` only accepts a single type argument: y: list[int, str] = [1, 'foo'] # Type checker will infer that all keys in ``z`` are meant to be strings, # and that all values in ``z`` are meant to be either strings or ints z: Mapping[str, str | int] = {}
sv: från collections.abc import Mapping # Type checker kommer att dra slutsatsen att alla element i ``x`` är avsedda att vara ints x: lista[int] = [] # Fel i typkontrollen: ``list`` accepterar bara ett enda typargument: y: list[int, str] = [1, 'foo'] # Typkontrollen drar slutsatsen att alla nycklar i ``z`` är avsedda att vara strängar, # och att alla värden i ``z`` är tänkta att vara antingen strängar eller ints z: Mappning[str, str | int] = {}

source: :class:`list` only accepts one type argument, so a type checker would emit an error on the ``y`` assignment above. Similarly, :class:`~collections.abc.Mapping` only accepts two type arguments: the first indicates the type of the keys, and the second indicates the type of the values.
sv: :class:`list` accepterar bara ett typargument, så en typkontroll skulle ge ett felmeddelande om ``y``-tilldelningen ovan. På samma sätt accepterar :class:`~collections.abc.Mapping` bara två typargument: det första anger typen av nycklar och det andra anger typen av värden.

source: Unlike most other Python containers, however, it is common in idiomatic Python code for tuples to have elements which are not all of the same type. For this reason, tuples are special-cased in Python's typing system. :class:`tuple` accepts *any number* of type arguments::
sv: Till skillnad från de flesta andra Python-containrar är det dock vanligt i idiomatisk Python-kod att tupler har element som inte alla är av samma typ. Av denna anledning är tupler specialklassade i Pythons typsystem. :class:`tuple` accepterar *valfritt antal* typargument::

source: # OK: ``x`` is assigned to a tuple of length 1 where the sole element is an int x: tuple[int] = (5,) # OK: ``y`` is assigned to a tuple of length 2; # element 1 is an int, element 2 is a str y: tuple[int, str] = (5, "foo") # Error: the type annotation indicates a tuple of length 1, # but ``z`` has been assigned to a tuple of length 3 z: tuple[int] = (1, 2, 3)
sv: # OK: ``x`` tilldelas en tupel av längd 1 där det enda elementet är en int x: tuple[int] = (5,) # OK: ``y`` tilldelas en tupel av längd 2; # element 1 är en int, element 2 är en str y: tuple[int, str] = (5, "foo") # Fel: typannoteringen anger en tupel med längden 1, # men ``z`` har tilldelats en tupel med längden 3 z: tupel[int] = (1, 2, 3)

source: To denote a tuple which could be of *any* length, and in which all elements are of the same type ``T``, use ``tuple[T, ...]``. To denote an empty tuple, use ``tuple[()]``. Using plain ``tuple`` as an annotation is equivalent to using ``tuple[Any, ...]``::
sv: För att beteckna en tupel som kan vara av *valfri* längd och där alla element är av samma typ ``T``, använd ``tuple[T, ...]``. För att beteckna en tom tupel, använd ``tuple[()]``. Att använda vanlig ``tuple`` som en annotation är likvärdigt med att använda ``tuple[Any, ...]``::

source: x: tuple[int, ...] = (1, 2) # These reassignments are OK: ``tuple[int, ...]`` indicates x can be of any length x = (1, 2, 3) x = () # This reassignment is an error: all elements in ``x`` must be ints x = ("foo", "bar") # ``y`` can only ever be assigned to an empty tuple y: tuple[()] = () z: tuple = ("foo", "bar") # These reassignments are OK: plain ``tuple`` is equivalent to ``tuple[Any, ...]`` z = (1, 2, 3) z = ()
sv: x: tuple[int, ...] = (1, 2) # Dessa omfördelningar är OK: ``tuple[int, ...]`` indikerar att x kan vara av valfri längd x = (1, 2, 3) x = () # Denna omfördelning är ett fel: alla element i ``x`` måste vara ints x = ("foo", "bar") # ``y`` kan bara någonsin tilldelas en tom tupel y: tuple[()] = () z: tuple = ("foo", "bar") # Dessa omfördelningar är OK: vanlig ``tuple`` är likvärdig med ``tuple[Any, ...]``` z = (1, 2, 3) z = ()

source: The type of class objects
sv: Typ av klassobjekt

source: A variable annotated with ``C`` may accept a value of type ``C``. In contrast, a variable annotated with ``type[C]`` (or deprecated :class:`typing.Type[C] <Type>`) may accept values that are classes themselves -- specifically, it will accept the *class object* of ``C``. For example::
sv: En variabel annoterad med ``C`` kan acceptera ett värde av typen ``C``. Däremot kan en variabel annoterad med ``type[C]`` (eller föråldrade :class:`typing.Type[C] <Type>`) acceptera värden som är klasser i sig -- specifikt kommer den att acceptera *class object* av ``C``. Till exempel::

source: a = 3 # Has type ``int`` b = int # Has type ``type[int]`` c = type(a) # Also has type ``type[int]``
sv: a = 3 # Har typen ``int`` b = int # Har typen ``typ[int]`` c = type(a) # Har också typen ``type[int]``

source: Note that ``type[C]`` is covariant::
sv: Observera att ``type[C]`` är kovariant::

source: class User: ... class ProUser(User): ... class TeamUser(User): ... def make_new_user(user_class: type[User]) -> User: # ... return user_class() make_new_user(User) # OK make_new_user(ProUser) # Also OK: ``type[ProUser]`` is a subtype of ``type[User]`` make_new_user(TeamUser) # Still fine make_new_user(User()) # Error: expected ``type[User]`` but got ``User`` make_new_user(int) # Error: ``type[int]`` is not a subtype of ``type[User]``
sv: klass Användare: ... klassen ProUser(Användare): ... klassen TeamUser(Användare): ... def make_new_user(user_class: type[User]) -> Användare: # ... returnera user_class() make_new_user(Användare) # OK make_new_user(ProUser) # Också OK: ``typ[ProUser]`` är en subtyp av ``typ[User]`` make_new_user(TeamUser) # Fortfarande bra make_new_user(User()) # Fel: förväntade mig ``type[User]`` men fick ``User`` make_new_user(int) # Fel: ``type[int]`` är inte en subtyp av ``type[User]``
