Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: However, note that at most one type variable tuple may appear in a single list of type arguments or type parameters::
sv: Observera dock att högst en typvariabel-tupel kan förekomma i en enda lista med typargument eller typparametrar::

source: x: tuple[*Ts, *Ts] # Not valid class Array[*Shape, *Shape]: # Not valid pass
sv: x: tuple[*Ts, *Ts] # Inte giltig klass Array[*Shape, *Shape]: # Inte giltig pass

source: Finally, an unpacked type variable tuple can be used as the type annotation of ``*args``::
sv: Slutligen kan en uppackad typvariabel-tupel användas som typannotering för ``*args``::

source: def call_soon[*Ts]( callback: Callable[[*Ts], None], *args: *Ts ) -> None: ... callback(*args)
sv: def call_soon[*Ts]( återuppringning: Kallbar[[*Ts], Ingen], *args: *Ts ) -> Ingen: ... återuppringning(*args)

source: In contrast to non-unpacked annotations of ``*args`` - e.g. ``*args: int``, which would specify that *all* arguments are ``int`` - ``*args: *Ts`` enables reference to the types of the *individual* arguments in ``*args``. Here, this allows us to ensure the types of the ``*args`` passed to ``call_soon`` match the types of the (positional) arguments of ``callback``.
sv: I motsats till icke-uppackade annoteringar av ``*args`` - t.ex. ``*args: int``, som skulle ange att *alla* argument är ``int`` - ``*args: *Ts`` möjliggör referens till typerna av de *individuella* argumenten i ``*args``. Här tillåter detta oss att säkerställa att typerna av ``*args`` som skickas till ``call_soon`` matchar typerna av (positionella) argument i ``callback``.

source: See :pep:`646` for more details on type variable tuples.
sv: Se :pep:`646` för mer information om typvariabeltuples.

source: The name of the type variable tuple.
sv: Namnet på typvariabeln tuple.

source: The default value of the type variable tuple, or :data:`typing.NoDefault` if it has no default.
sv: Standardvärdet för typvariabeln tuple, eller :data:`typing.NoDefault` om den inte har något standardvärde.

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVarTuple.__default__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVarTuple.__default__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
sv: En :term:`evaluate-funktion` som motsvarar attributet :attr:`~TypeVarTuple.__default__`. Vid direkt anrop stöder denna metod endast formatet :attr:`~annotationlib.Format.VALUE`, vilket motsvarar direkt åtkomst till attributet :attr:`~TypeVarTuple.__default__`, men metodobjektet kan skickas till :func:`annotationlib.call_evaluate_function` för att utvärdera värdet i ett annat format.

source: Return whether or not the type variable tuple has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
sv: Returnerar om typvariabeln tuple har ett standardvärde eller inte. Detta är likvärdigt med att kontrollera om :attr:`__default__` inte är :data:`typing.NoDefault` singleton, förutom att det inte tvingar fram utvärdering av :ref:`lazily evaluated <lazy-evaluation>` standardvärde.

source: Type variable tuples can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
sv: Typvariabeltuples kan nu deklareras med hjälp av syntaxen :ref:`type parameter <type-params>` som introducerades av :pep:`695`.

source: Parameter specification variable. A specialized version of :ref:`type variables <typevar>`.
sv: Variabel för parameterspecifikation. En specialiserad version av :ref:`typvariabler <typevar>`.

source: In :ref:`type parameter lists <type-params>`, parameter specifications can be declared with two asterisks (``**``)::
sv: I :ref:``typ parameter lists <type-params>`` kan parameterspecifikationer deklareras med två asterisker (``**``)::

source: type IntFunc[**P] = Callable[P, int]
sv: typ IntFunc[**P] = Anropsbar[P, int]

source: For compatibility with Python 3.11 and earlier, ``ParamSpec`` objects can also be created as follows::
sv: För kompatibilitet med Python 3.11 och tidigare kan ``ParamSpec``-objekt också skapas på följande sätt::

source: Parameter specification variables exist primarily for the benefit of static type checkers. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. They are only valid when used in ``Concatenate``, or as the first argument to ``Callable``, or as parameters for user-defined Generics. See :class:`Generic` for more information on generic types.
sv: Parameterspecifikationsvariabler är främst till för att underlätta för statiska typkontrollanter. De används för att vidarebefordra parametertyperna för en anropbar till en annan anropbar -- ett mönster som är vanligt förekommande i högre ordningens funktioner och dekoratorer. De är endast giltiga när de används i ``Concatenate``, eller som det första argumentet till ``Callable``, eller som parametrar för användardefinierade Generics. Se :class:`Generic` för mer information om generiska typer.

source: For example, to add basic logging to a function, one can create a decorator ``add_logging`` to log function calls. The parameter specification variable tells the type checker that the callable passed into the decorator and the new callable returned by it have inter-dependent type parameters::
sv: Om man t.ex. vill lägga till grundläggande loggning i en funktion kan man skapa en dekorator ``add_logging`` för att logga funktionsanrop. Parameterspecifikationsvariabeln talar om för typkontrollen att den anropsbarhet som skickas till dekoratorn och den nya anropsbarhet som returneras av den har typparametrar som är beroende av varandra::

source: Without ``ParamSpec``, the simplest way to annotate this previously was to use a :class:`TypeVar` with upper bound ``Callable[..., Any]``. However this causes two problems:
sv: Utan ``ParamSpec`` var det enklaste sättet att annotera detta tidigare att använda en :class:`TypeVar` med övre gränsen ``Callable[..., Any]``. Detta orsakar dock två problem:

source: The type checker can't type check the ``inner`` function because ``*args`` and ``**kwargs`` have to be typed :data:`Any`.
sv: Typkontrollen kan inte typkontrollera funktionen ``inner`` eftersom ``*args`` och ``**kwargs`` måste vara typade :data:`Any`.

source: :func:`~cast` may be required in the body of the ``add_logging`` decorator when returning the ``inner`` function, or the static type checker must be told to ignore the ``return inner``.
sv: :func:`~cast` kan krävas i kroppen av ``add_logging`` dekoratorn när den returnerar ``inner`` funktionen, eller så måste den statiska typkontrollen sägas att ignorera ``return inner``.

source: Since ``ParamSpec`` captures both positional and keyword parameters, ``P.args`` and ``P.kwargs`` can be used to split a ``ParamSpec`` into its components. ``P.args`` represents the tuple of positional parameters in a given call and should only be used to annotate ``*args``. ``P.kwargs`` represents the mapping of keyword parameters to their values in a given call, and should be only be used to annotate ``**kwargs``. Both attributes require the annotated parameter to be in scope. At runtime, ``P.args`` and ``P.kwargs`` are instances respectively of :class:`ParamSpecArgs` and :class:`ParamSpecKwargs`.
sv: Eftersom ``ParamSpec`` fångar både positionella parametrar och nyckelordsparametrar kan ``P.args`` och ``P.kwargs`` användas för att dela upp en ``ParamSpec`` i dess komponenter. ``P.args`` representerar tupeln av positionella parametrar i ett givet anrop och bör endast användas för att annotera ``*args``. ``P.kwargs`` representerar mappningen av nyckelordsparametrar till deras värden i ett givet anrop och bör endast användas för att annotera ``**kwargs``. Båda attributen kräver att den annoterade parametern är i scope. Vid körning är ``P.args`` och ``P.kwargs`` instanser av :class:`ParamSpecArgs` respektive :class:`ParamSpecKwargs`.

source: The name of the parameter specification.
sv: Namnet på parameterspecifikationen.

source: The default value of the parameter specification, or :data:`typing.NoDefault` if it has no default.
sv: Standardvärdet för parameterspecifikationen, eller :data:`typing.NoDefault` om den inte har något standardvärde.

source: An :term:`evaluate function` corresponding to the :attr:`~ParamSpec.__default__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~ParamSpec.__default__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
sv: En :term:`evaluate-funktion` som motsvarar attributet :attr:`~ParamSpec.__default__`. Vid direkt anrop stöder denna metod endast formatet :attr:`~annotationlib.Format.VALUE`, vilket motsvarar direkt åtkomst till attributet :attr:`~ParamSpec.__default__`, men metodobjektet kan skickas till :func:`annotationlib.call_evaluate_function` för att utvärdera värdet i ett annat format.

source: Return whether or not the parameter specification has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
sv: Returnerar om parameterspecifikationen har ett standardvärde eller inte. Detta är likvärdigt med att kontrollera om :attr:`__default__` inte är :data:`typing.NoDefault` singleton, förutom att det inte tvingar fram utvärdering av :ref:`lazily evaluated <lazy-evaluation>` standardvärde.

source: Parameter specification variables created with ``covariant=True`` or ``contravariant=True`` can be used to declare covariant or contravariant generic types. The ``bound`` argument is also accepted, similar to :class:`TypeVar`. However the actual semantics of these keywords are yet to be decided.
sv: Parameterspecifikationsvariabler skapade med ``covariant=True`` eller ``contravariant=True`` kan användas för att deklarera kovarianta eller kontravarianta generiska typer. Argumentet ``bound`` accepteras också, på samma sätt som för :class:`TypeVar`. Den faktiska semantiken för dessa nyckelord är dock ännu inte fastställd.

source: Parameter specifications can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
sv: Parameterspecifikationer kan nu deklareras med hjälp av syntaxen :ref:`type parameter <type-params>` som introducerades av :pep:`695`.

source: Only parameter specification variables defined in global scope can be pickled.
sv: Endast parameterspecifika variabler som definieras i global omfattning kan picklas.

source: :data:`Concatenate`
sv: :data:`Koncatenate`

source: Arguments and keyword arguments attributes of a :class:`ParamSpec`. The ``P.args`` attribute of a ``ParamSpec`` is an instance of ``ParamSpecArgs``, and ``P.kwargs`` is an instance of ``ParamSpecKwargs``. They are intended for runtime introspection and have no special meaning to static type checkers.
sv: Attribut för argument och nyckelordsargument för en :class:`ParamSpec`. Attributet ``P.args`` för en ``ParamSpec`` är en instans av ``ParamSpecArgs``, och ``P.kwargs`` är en instans av ``ParamSpecKwargs``. De är avsedda för introspektion under körning och har ingen särskild betydelse för statiska typkontroller.

source: Calling :func:`get_origin` on either of these objects will return the original ``ParamSpec``:
sv: Anrop av :func:`get_origin` på något av dessa objekt kommer att returnera den ursprungliga ``ParamSpec``:

source: >>> from typing import ParamSpec, get_origin >>> P = ParamSpec("P") >>> get_origin(P.args) is P True >>> get_origin(P.kwargs) is P True
sv: >>> from typing import ParamSpec, get_origin >>> P = ParamSpec("P") >>> get_origin(P.args) är P Sant >>> get_origin(P.kwargs) är P Sann

source: The type of type aliases created through the :keyword:`type` statement.
sv: Typen av typalias som skapas genom :keyword:`type`-satsen.

source: >>> type Alias = int >>> type(Alias) <class 'typing.TypeAliasType'>
sv: >>> typ Alias = int >>> typ(Alias) <klass 'typing.TypeAliasType'>

source: The name of the type alias:
sv: Namnet på typaliaset:

source: >>> type Alias = int >>> Alias.__name__ 'Alias'
sv: >>> typ Alias = int >>> Alias.__name__ 'Alias'

source: The module in which the type alias was defined::
sv: Den modul där typaliaset definierades::

source: >>> type Alias = int >>> Alias.__module__ '__main__'
sv: >>> typ Alias = int >>> Alias.__module__ '__main__'

source: The type parameters of the type alias, or an empty tuple if the alias is not generic:
sv: Typparametrarna för typaliaset, eller en tom tupel om aliaset inte är generiskt:

source: >>> type ListOrSet[T] = list[T] | set[T] >>> ListOrSet.__type_params__ (T,) >>> type NotGeneric = int >>> NotGeneric.__type_params__ ()
sv: >>> typ ListOrSet[T] = list[T] | set[T] >>> ListOrSet.__type_params__ (T,) >>> typ NotGeneric = int >>> NotGeneric.__type_params__ (T,) ()

source: The type alias's value. This is :ref:`lazily evaluated <lazy-evaluation>`, so names used in the definition of the alias are not resolved until the ``__value__`` attribute is accessed:
sv: Typaliasets värde. Detta är :ref:``lazily evaluated <lazy-evaluation>``, så namn som används i definitionen av aliaset löses inte förrän attributet ``__value__`` nås:

source: >>> type Mutually = Recursive >>> type Recursive = Mutually >>> Mutually Mutually >>> Recursive Recursive >>> Mutually.__value__ Recursive >>> Recursive.__value__ Mutually
sv: >>> typ Ömsesidigt = Rekursiv >>> typ Rekursiv = Ömsesidigt >>> Mutuellt Ömsesidigt >>> Rekursiv Rekursiv >>> Ömsesidigt.__värde__ Rekursiv >>> Rekursiv.__värde__ Ömsesidigt

source: An :term:`evaluate function` corresponding to the :attr:`__value__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`__value__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format:
sv: En :term:`evaluate-funktion` som motsvarar attributet :attr:`__value__`. Vid direkt anrop stöder denna metod endast formatet :attr:`~annotationlib.Format.VALUE`, vilket motsvarar direkt åtkomst till attributet :attr:`__value__`, men metodobjektet kan skickas till :func:`annotationlib.call_evaluate_function` för att utvärdera värdet i ett annat format:

source: >>> type Alias = undefined >>> Alias.__value__ Traceback (most recent call last): ... NameError: name 'undefined' is not defined >>> from annotationlib import Format, call_evaluate_function >>> Alias.evaluate_value(Format.VALUE) Traceback (most recent call last): ... NameError: name 'undefined' is not defined >>> call_evaluate_function(Alias.evaluate_value, Format.FORWARDREF) ForwardRef('undefined')
sv: >>> typ Alias = odefinierad >>> Alias.__värde__ Traceback (senaste anropet senast): ... NameError: namnet 'undefined' är inte definierat >>> from annotationlib import Format, call_evaluate_function >>> Alias.evaluate_value(Format.VALUE) Traceback (senaste anropet senast): ... NameError: namnet 'undefined' är inte definierat >>> call_evaluate_function(Alias.evaluate_value, Format.FORWARDREF) ForwardRef('odefinierad')

source: Unpacking
sv: Uppackning

source: Type aliases support star unpacking using the ``*Alias`` syntax. This is equivalent to using ``Unpack[Alias]`` directly:
sv: Typalias stöder uppackning av stjärnor med hjälp av syntaxen ``*Alias``. Detta är likvärdigt med att använda ``Unpack[Alias]`` direkt:

source: >>> type Alias = tuple[int, str] >>> type Unpacked = tuple[bool, *Alias] >>> Unpacked.__value__ tuple[bool, typing.Unpack[Alias]]
sv: >>> typ Alias = tuple[int, str] >>> typ Unpacked = tuple[bool, *Alias] >>> Uppackad.__värde__ tuple[bool, typing.Unpack[Alias]]

source: Other special directives
sv: Andra särskilda direktiv

source: These functions and classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating and declaring types.
sv: Dessa funktioner och klasser ska inte användas direkt som annotationer. Deras avsedda syfte är att vara byggstenar för att skapa och deklarera typer.

source: Typed version of :func:`collections.namedtuple`.
sv: Typad version av :func:`collections.namedtuple`.

source: Usage::
sv: Användning::

source: class Employee(NamedTuple): name: str id: int
sv: class Anställd(NamedTuple): name: str id: int

source: This is equivalent to::
sv: Detta är likvärdigt med::

source: Employee = collections.namedtuple('Employee', ['name', 'id'])
sv: Anställd = collections.namedtuple('Anställd', ['namn', 'id'])

source: To give a field a default value, you can assign to it in the class body::
sv: För att ge ett fält ett standardvärde kan du tilldela det i klassen body::

source: class Employee(NamedTuple): name: str id: int = 3 employee = Employee('Guido') assert employee.id == 3
sv: class Anställd(NamedTuple): name: str id: int = 3 anställd = Anställd('Guido') assert anställd.id == 3

source: Fields with a default value must come after any fields without a default.
sv: Fält med ett standardvärde måste komma efter alla fält utan standardvärde.

source: The resulting class has an extra attribute ``__annotations__`` giving a dict that maps the field names to the field types. (The field names are in the ``_fields`` attribute and the default values are in the ``_field_defaults`` attribute, both of which are part of the :func:`~collections.namedtuple` API.)
sv: Den resulterande klassen har ett extra attribut ``__annotations__`` som ger en dict som mappar fältnamnen till fälttyperna. (Fältnamnen finns i attributet ``_fields`` och standardvärdena finns i attributet ``_field_defaults``, som båda är en del av :func:`~collections.namedtuple` API)

source: ``NamedTuple`` subclasses can also have docstrings and methods::
sv: ``NamedTuple`` subklasser kan också ha docstrings och metoder::

source: class Employee(NamedTuple): """Represents an employee.""" name: str id: int = 3 def __repr__(self) -> str: return f'<Employee {self.name}, id={self.id}>'
sv: class Anställd(NamedTuple): """Representerar en anställd.""" namn: str id: int = 3 def __repr__(self) -> str: return f'<Anställd {self.name}, id={self.id}>'

source: ``NamedTuple`` subclasses can be generic::
sv: ``NamedTuple`` subklasser kan vara generiska::

source: class Group[T](NamedTuple): key: T group: list[T]
sv: class Group[T](NamedTuple): nyckel: T group: lista[T]

source: Backward-compatible usage::
sv: Bakåtkompatibel användning::

source: # For creating a generic NamedTuple on Python 3.11 T = TypeVar("T") class Group(NamedTuple, Generic[T]): key: T group: list[T] # A functional syntax is also supported Employee = NamedTuple('Employee', [('name', str), ('id', int)])
sv: # För att skapa en generisk NamedTuple på Python 3.11 T = TypeVar("T") class Group(NamedTuple, Generisk[T]): nyckel: T group: lista[T] # Det finns också stöd för en funktionell syntax Employee = NamedTuple('Employee', [('name', str), ('id', int)])

source: Added support for :pep:`526` variable annotation syntax.
sv: Lagt till stöd för :pep:`526` variabelannotationssyntax.

source: Added support for default values, methods, and docstrings.
sv: Stöd för standardvärden, metoder och docstrings har lagts till.

source: The ``_field_types`` and ``__annotations__`` attributes are now regular dictionaries instead of instances of ``OrderedDict``.
sv: Attributen ``_field_types`` och ``__annotations__`` är nu vanliga ordböcker istället för instanser av ``OrderedDict``.

source: Removed the ``_field_types`` attribute in favor of the more standard ``__annotations__`` attribute which has the same information.
sv: Attributet ``_field_types`` har tagits bort till förmån för det mer standardiserade attributet ``__annotations__`` som innehåller samma information.

source: Added support for generic namedtuples.
sv: Lagt till stöd för generiska namntuples.

source: Using :func:`super` (and the ``__class__`` :term:`closure variable`) in methods of ``NamedTuple`` subclasses is unsupported and causes a :class:`TypeError`.
sv: Att använda :func:`super` (och ``__class__`` :term:`closure variable`) i metoder i underklasser till ``NamedTuple`` stöds inte och orsakar ett :class:`TypeError`.

source: The undocumented keyword argument syntax for creating NamedTuple classes (``NT = NamedTuple("NT", x=int)``) is deprecated, and will be disallowed in 3.15. Use the class-based syntax or the functional syntax instead.
sv: Den odokumenterade syntaxen med nyckelordsargument för att skapa NamedTuple-klasser (``NT = NamedTuple("NT", x=int)``) är föråldrad och kommer att förbjudas i 3.15. Använd den klassbaserade syntaxen eller den funktionella syntaxen istället.

source: When using the functional syntax to create a NamedTuple class, failing to pass a value to the 'fields' parameter (``NT = NamedTuple("NT")``) is deprecated. Passing ``None`` to the 'fields' parameter (``NT = NamedTuple("NT", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a NamedTuple class with 0 fields, use ``class NT(NamedTuple): pass`` or ``NT = NamedTuple("NT", [])``.
sv: När du använder den funktionella syntaxen för att skapa en NamedTuple-klass är det föråldrat att inte skicka ett värde till parametern 'fields' (``NT = NamedTuple("NT")``). Att skicka ``None`` till parametern 'fields' (``NT = NamedTuple("NT", None)``) är också föråldrat. Båda kommer att vara otillåtna i Python 3.15. För att skapa en NamedTuple-klass med 0 fält, använd ``class NT(NamedTuple): pass`` eller ``NT = NamedTuple("NT", [])``.

source: Helper class to create low-overhead :ref:`distinct types <distinct>`.
sv: Hjälpklass för att skapa låga kostnader :ref:`distinct types <distinct>`.

source: A ``NewType`` is considered a distinct type by a typechecker. At runtime, however, calling a ``NewType`` returns its argument unchanged.
sv: En ``NewType`` betraktas som en distinkt typ av en typkontrollör. Vid körning returnerar dock anrop av en ``NewType`` dess argument oförändrat.

source: UserId = NewType('UserId', int) # Declare the NewType "UserId" first_user = UserId(1) # "UserId" returns the argument unchanged at runtime
sv: UserId = NewType('UserId', int) # Deklarera NewType "UserId" first_user = UserId(1) # "UserId" returnerar argumentet oförändrat vid körning

source: The module in which the new type is defined.
sv: Den modul i vilken den nya typen definieras.

source: The name of the new type.
sv: Namnet på den nya typen.

source: The type that the new type is based on.
sv: Den typ som den nya typen är baserad på.

source: ``NewType`` is now a class rather than a function.
sv: ``NewType`` är nu en klass snarare än en funktion.

source: Base class for protocol classes.
sv: Basklass för protokollklasser.

source: Protocol classes are defined like this::
sv: Protokollklasserna definieras på följande sätt::

source: class Proto(Protocol): def meth(self) -> int: ...
sv: klass Proto(Protokoll): def meth(self) -> int: ...

source: Such classes are primarily used with static type checkers that recognize structural subtyping (static duck-typing), for example::
sv: Sådana klasser används främst med statiska typkontrollprogram som känner igen strukturell subtypning (statisk duck-typning), t.ex:
