Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: Every type is compatible with :data:`Any`.
sv: Varje typ är kompatibel med :data:`Any`.

source: :data:`Any` is compatible with every type.
sv: :data:`Any` är kompatibel med alla typer.

source: :data:`Any` can now be used as a base class. This can be useful for avoiding type checker errors with classes that can duck type anywhere or are highly dynamic.
sv: :data:`Any` kan nu användas som basklass. Detta kan vara användbart för att undvika fel i typkontrollerna för klasser som kan få typ var som helst eller som är mycket dynamiska.

source: A :ref:`constrained type variable <typing-constrained-typevar>`.
sv: En :ref:`begränsad typvariabel <typing-constrained-typevar>`.

source: ``AnyStr`` is meant to be used for functions that may accept :class:`str` or :class:`bytes` arguments but cannot allow the two to mix.
sv: ``AnyStr`` är avsedd att användas för funktioner som kan acceptera :class:`str` eller :class:`bytes` argument men som inte kan tillåta att de två blandas.

source: For example::
sv: Till exempel::

source: def concat(a: AnyStr, b: AnyStr) -> AnyStr: return a + b concat("foo", "bar") # OK, output has type 'str' concat(b"foo", b"bar") # OK, output has type 'bytes' concat("foo", b"bar") # Error, cannot mix str and bytes
sv: def concat(a: AnyStr, b: AnyStr) -> AnyStr: returnerar a + b concat("foo", "bar") # OK, utdata har typen 'str' concat(b"foo", b"bar") # OK, utdata har typen 'bytes' concat("foo", b"bar") # Fel, kan inte blanda str och bytes

source: Note that, despite its name, ``AnyStr`` has nothing to do with the :class:`Any` type, nor does it mean "any string". In particular, ``AnyStr`` and ``str | bytes`` are different from each other and have different use cases::
sv: Observera att trots sitt namn har ``AnyStr`` inget att göra med typen :class:`Any`` och betyder inte heller "vilken sträng som helst". I synnerhet skiljer sig ``AnyStr`` och ``str | bytes`` från varandra och har olika användningsområden::

source: # Invalid use of AnyStr: # The type variable is used only once in the function signature, # so cannot be "solved" by the type checker def greet_bad(cond: bool) -> AnyStr: return "hi there!" if cond else b"greetings!" # The better way of annotating this function: def greet_proper(cond: bool) -> str | bytes: return "hi there!" if cond else b"greetings!"
sv: # Ogiltig användning av AnyStr: # Typvariabeln används bara en gång i funktionssignaturen, # så den kan inte "lösas" av typkontrollen def greet_bad(cond: bool) -> AnyStr: return "hej där!" if cond else b"hälsningar!" # Det bättre sättet att kommentera den här funktionen: def greet_proper(cond: bool) -> str | bytes: return "hej där!" if cond else b"hälsningar!"

source: Deprecated in favor of the new :ref:`type parameter syntax <type-params>`. Use ``class A[T: (str, bytes)]: ...`` instead of importing ``AnyStr``. See :pep:`695` for more details.
sv: Föråldrad till förmån för den nya :ref:`typ parametersyntaxen <type-params>`. Använd ``class A[T: (str, bytes)]: ...`` istället för att importera ``AnyStr``. Se :pep:`695` för mer information.

source: In Python 3.16, ``AnyStr`` will be removed from ``typing.__all__``, and deprecation warnings will be emitted at runtime when it is accessed or imported from ``typing``. ``AnyStr`` will be removed from ``typing`` in Python 3.18.
sv: I Python 3.16 kommer ``AnyStr`` att tas bort från ``typing.__all__``, och deprecation-varningar kommer att utfärdas vid körning när den nås eller importeras från ``typing``. ``AnyStr`` kommer att tas bort från ``typing`` i Python 3.18.

source: Special type that includes only literal strings.
sv: Speciell typ som endast innehåller bokstavliga strängar.

source: Any string literal is compatible with ``LiteralString``, as is another ``LiteralString``. However, an object typed as just ``str`` is not. A string created by composing ``LiteralString``-typed objects is also acceptable as a ``LiteralString``.
sv: Alla bokstavliga strängar är kompatibla med ``LiteralString``, liksom en annan ``LiteralString``. Men ett objekt typat som bara ``str`` är inte det. En sträng som skapas genom att komponera ``LiteralString``-typade objekt är också acceptabel som en ``LiteralString``.

source: Example:
sv: Exempel:

source: def run_query(sql: LiteralString) -> None: ... def caller(arbitrary_string: str, literal_string: LiteralString) -> None: run_query("SELECT * FROM students") # OK run_query(literal_string) # OK run_query("SELECT * FROM " + literal_string) # OK run_query(arbitrary_string) # type checker error run_query( # type checker error f"SELECT * FROM students WHERE name = {arbitrary_string}" )
sv: def run_query(sql: LiteralString) -> Ingen: ... def caller(arbitrary_string: str, literal_string: LiteralString) -> None: run_query("SELECT * FROM studenter") # OK run_query(litteral_sträng) # OK run_query("SELECT * FROM " + literal_string) # OK run_query(godtycklig_sträng) # typkontrollfel run_query( # typkontrollfel f"SELECT * FROM studenter WHERE namn = {arbitrary_string}" )

source: ``LiteralString`` is useful for sensitive APIs where arbitrary user-generated strings could generate problems. For example, the two cases above that generate type checker errors could be vulnerable to an SQL injection attack.
sv: ``LiteralString`` är användbart för känsliga API:er där godtyckliga användargenererade strängar kan skapa problem. Till exempel kan de två fallen ovan som genererar typkontrollfel vara sårbara för en SQL-injektionsattack.

source: See :pep:`675` for more details.
sv: Se :pep:`675` för mer information.

source: :data:`!Never` and :data:`!NoReturn` represent the `bottom type <https://en.wikipedia.org/wiki/Bottom_type>`_, a type that has no members.
sv: :data:`!Never` och :data:`!NoReturn` representerar `bottentypen <https://en.wikipedia.org/wiki/Bottom_type>`_, en typ som inte har några medlemmar.

source: They can be used to indicate that a function never returns, such as :func:`sys.exit`::
sv: De kan användas för att ange att en funktion aldrig återkommer, t.ex. :func:`sys.exit`::

source: from typing import Never # or NoReturn def stop() -> Never: raise RuntimeError('no way')
sv: från typning import Aldrig # eller NoReturn def stop() -> Aldrig: raise RuntimeError('inget sätt')

source: Or to define a function that should never be called, as there are no valid arguments, such as :func:`assert_never`::
sv: Eller för att definiera en funktion som aldrig ska anropas, eftersom det inte finns några giltiga argument, t.ex. :func:`assert_never`::

source: from typing import Never # or NoReturn def never_call_me(arg: Never) -> None: pass def int_or_str(arg: int | str) -> None: never_call_me(arg) # type checker error match arg: case int(): print("It's an int") case str(): print("It's a str") case _: never_call_me(arg) # OK, arg is of type Never (or NoReturn)
sv: från typning import Aldrig # eller NoReturn def never_call_me(arg: Never) -> None: pass def int_or_str(arg: int | str) -> None: never_call_me(arg) # typkontrollfel matcha arg: fall int(): print("Det är en int") fall str(): print("Det är en str") fall _: never_call_me(arg) # OK, arg är av typen Never (eller NoReturn)

source: :data:`!Never` and :data:`!NoReturn` have the same meaning in the type system and static type checkers treat both equivalently.
sv: :data:`!Never` och :data:`!NoReturn` har samma betydelse i typsystemet och statiska typkontroller behandlar båda likvärdigt.

source: Added :data:`NoReturn`.
sv: Lagt till :data:`NoReturn`.

source: Added :data:`Never`.
sv: Lagt till :data:`Never`.

source: Special type to represent the current enclosed class.
sv: Speciell typ för att representera den aktuella inneslutna klassen.

source: from typing import Self, reveal_type class Foo: def return_self(self) -> Self: ... return self class SubclassOfFoo(Foo): pass reveal_type(Foo().return_self()) # Revealed type is "Foo" reveal_type(SubclassOfFoo().return_self()) # Revealed type is "SubclassOfFoo"
sv: från typing import Self, reveal_type klass Foo: def return_self(self) -> Self: ... returnera själv klass SubclassOfFoo(Foo): pass reveal_type(Foo().return_self()) # Avslöjad typ är "Foo" reveal_type(SubclassOfFoo().return_self()) # Avslöjad typ är "SubclassOfFoo"

source: This annotation is semantically equivalent to the following, albeit in a more succinct fashion::
sv: Denna annotation är semantiskt likvärdig med följande, om än på ett mer kortfattat sätt::

source: from typing import TypeVar Self = TypeVar("Self", bound="Foo") class Foo: def return_self(self: Self) -> Self: ... return self
sv: från typing import TypeVar Self = TypeVar("Self", bound="Foo") klass Foo: def return_self(self: Self) -> Self: ... returnera själv

source: In general, if something returns ``self``, as in the above examples, you should use ``Self`` as the return annotation. If ``Foo.return_self`` was annotated as returning ``"Foo"``, then the type checker would infer the object returned from ``SubclassOfFoo.return_self`` as being of type ``Foo`` rather than ``SubclassOfFoo``.
sv: I allmänhet, om något returnerar ``self``, som i exemplen ovan, bör du använda ``Self`` som returannotering. Om ``Foo.return_self`` annoterades som att returnera ``"Foo"``, skulle typkontrollen härleda objektet som returneras från ``SubclassOfFoo.return_self`` som att vara av typen ``Foo`` snarare än ``SubclassOfFoo``.

source: Other common use cases include:
sv: Andra vanliga användningsområden är t.ex:

source: :class:`classmethod`\s that are used as alternative constructors and return instances of the ``cls`` parameter.
sv: :class:`classmethod` som används som alternativa konstruktörer och returnerar instanser av parametern ``cls``.

source: Annotating an :meth:`~object.__enter__` method which returns self.
sv: Anteckna en :meth:`~object.__enter__`-metod som returnerar self.

source: You should not use ``Self`` as the return annotation if the method is not guaranteed to return an instance of a subclass when the class is subclassed::
sv: Du bör inte använda ``Self`` som returannotering om metoden inte garanterat returnerar en instans av en underklass när klassen är underklassad::

source: class Eggs: # Self would be an incorrect return annotation here, # as the object returned is always an instance of Eggs, # even in subclasses def returns_eggs(self) -> "Eggs": return Eggs()
sv: klass Ägg: # Själv skulle vara en felaktig returannotering här, # eftersom objektet som returneras alltid är en instans av Eggs, # även i underklasser def returns_eggs(self) -> "Ägg": returnerar Eggs()

source: See :pep:`673` for more details.
sv: Se :pep:`673` för mer information.

source: Special annotation for explicitly declaring a :ref:`type alias <type-aliases>`.
sv: Särskild annotering för att explicit deklarera en :ref:`typ alias <type-aliases>`.

source: from typing import TypeAlias Factors: TypeAlias = list[int]
sv: från typing import TypeAlias Faktorer: TypeAlias = lista[int]

source: ``TypeAlias`` is particularly useful on older Python versions for annotating aliases that make use of forward references, as it can be hard for type checkers to distinguish these from normal variable assignments:
sv: ``TypeAlias`` är särskilt användbart på äldre Python-versioner för att annotera alias som använder sig av framåtriktade referenser, eftersom det kan vara svårt för typkontrollanter att skilja dessa från normala variabeltilldelningar:

source: from typing import Generic, TypeAlias, TypeVar T = TypeVar("T") # "Box" does not exist yet, # so we have to use quotes for the forward reference on Python <3.12. # Using ``TypeAlias`` tells the type checker that this is a type alias declaration, # not a variable assignment to a string. BoxOfStrings: TypeAlias = "Box[str]" class Box(Generic[T]): @classmethod def make_box_of_strings(cls) -> BoxOfStrings: ...
sv: from typing import Generisk, TypeAlias, TypeVar T = TypeVar("T") # "Box" existerar inte ännu, # så vi måste använda citattecken för den framåtriktade referensen på Python <3.12. # Att använda ``TypeAlias`` talar om för typkontrollanten att detta är en aliasdeklaration, # inte en variabeltilldelning till en sträng. BoxOfStrings: TypeAlias = "Box[str]" klass Box(Generic[T]): @klassmetod def make_box_of_strings(cls) -> BoxOfStrings: ...

source: See :pep:`613` for more details.
sv: Se :pep:`613` för mer information.

source: :data:`TypeAlias` is deprecated in favor of the :keyword:`type` statement, which creates instances of :class:`TypeAliasType` and which natively supports forward references. Note that while :data:`TypeAlias` and :class:`TypeAliasType` serve similar purposes and have similar names, they are distinct and the latter is not the type of the former. Removal of :data:`TypeAlias` is not currently planned, but users are encouraged to migrate to :keyword:`type` statements.
sv: :data:`TypeAlias` är avfört till förmån för :keyword:`type`-satsen, som skapar instanser av :class:`TypeAliasType` och som stöder framåtriktade referenser. Observera att även om :data:`TypeAlias` och :class:`TypeAliasType` tjänar liknande syften och har liknande namn, är de distinkta och den senare är inte typen av den förra. Avlägsnande av :data:`TypeAlias` är för närvarande inte planerat, men användare uppmuntras att migrera till :keyword:`type`-satser.

source: Special forms
sv: Särskilda formulär

source: These can be used as types in annotations. They all support subscription using ``[]``, but each has a unique syntax.
sv: Dessa kan användas som typer i annoteringar. De stöder alla prenumeration med hjälp av ``[]``, men varje har en unik syntax.

source: Union type; ``Union[X, Y]`` is equivalent to ``X | Y`` and means either X or Y.
sv: Unionstyp; ``Union[X, Y]`` är ekvivalent med ``X | Y`` och betyder antingen X eller Y.

source: To define a union, use e.g. ``Union[int, str]`` or the shorthand ``int | str``. Using that shorthand is recommended. Details:
sv: För att definiera en union, använd t.ex. ``Union[int, str]`` eller kortformen ``int | str``. Det är rekommenderat att använda den kortformen. Mer information:

source: The arguments must be types and there must be at least one.
sv: Argumenten måste vara typer och det måste finnas minst ett.

source: Unions of unions are flattened, e.g.::
sv: Unioner av unioner är tillplattade, t.ex.::

source: However, this does not apply to unions referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
sv: Detta gäller dock inte för unioner som refereras till via ett typalias, för att undvika att tvinga fram en utvärdering av den underliggande :class:`TypeAliasType`::

source: type A = Union[int, str] Union[A, float] != Union[int, str, float]
sv: typ A = Union[int, str] Union[A, float] != Union[int, str, float]

source: Unions of a single argument vanish, e.g.::
sv: Sammanslutningar av ett enda argument försvinner, t.ex.::

source: Union[int] == int # The constructor actually returns int
sv: Union[int] == int # Konstruktören returnerar faktiskt int

source: Redundant arguments are skipped, e.g.::
sv: Överflödiga argument hoppas över, t.ex.::

source: When comparing unions, the argument order is ignored, e.g.::
sv: Vid jämförelse av unioner ignoreras argumentordningen, t.ex.::

source: You cannot subclass or instantiate a ``Union``.
sv: Du kan inte underklassa eller instansiera en ``Union``.

source: You cannot write ``Union[X][Y]``.
sv: Du kan inte skriva ``Union[X][Y]``.

source: Don't remove explicit subclasses from unions at runtime.
sv: Ta inte bort explicita underklasser från unioner vid körning.

source: Unions can now be written as ``X | Y``. See :ref:`union type expressions<types-union>`.
sv: Unioner kan nu skrivas som ``X | Y``. Se :ref:``unionstyputtryck<types-union>`.

source: :class:`types.UnionType` is now an alias for :class:`Union`, and both ``Union[int, str]`` and ``int | str`` create instances of the same class. To check whether an object is a ``Union`` at runtime, use ``isinstance(obj, Union)``. For compatibility with earlier versions of Python, use ``get_origin(obj) is typing.Union or get_origin(obj) is types.UnionType``.
sv: :class:`types.UnionType` är nu ett alias för :class:`Union`, och både ``Union[int, str]`` och ``int | str`` skapar instanser av samma klass. För att kontrollera om ett objekt är en ``Union`` vid runtime, använd ``isinstance(obj, Union)``. För kompatibilitet med tidigare versioner av Python, använd ``get_origin(obj) is typing.Union eller get_origin(obj) is types.UnionType``.

source: ``Optional[X]`` is equivalent to ``X | None`` (or ``Union[X, None]``).
sv: ``Optional[X]`` är ekvivalent med ``X | None`` (eller ``Union[X, None]``).

source: Note that this is not the same concept as an optional argument, which is one that has a default. An optional argument with a default does not require the ``Optional`` qualifier on its type annotation just because it is optional. For example::
sv: Observera att detta inte är samma koncept som ett optionellt argument, vilket är ett argument som har en default. Ett valfritt argument med en standard kräver inte ``Optional`` kvalifieraren på sin typannotering bara för att det är valfritt. Till exempel::

source: On the other hand, if an explicit value of ``None`` is allowed, the use of ``Optional`` is appropriate, whether the argument is optional or not. For example::
sv: Å andra sidan, om ett explicit värde av ``None`` är tillåtet, är användningen av ``Optional`` lämplig, oavsett om argumentet är valfritt eller inte. Till exempel::

source: def foo(arg: Optional[int] = None) -> None: ...
sv: def foo(arg: Valfritt[int] = Ingen) -> Ingen: ...

source: Optional can now be written as ``X | None``. See :ref:`union type expressions<types-union>`.
sv: Optional kan nu skrivas som ``X | None``. Se :ref:``unionstyputtryck<types-union>`.

source: Special form for annotating higher-order functions.
sv: Särskilt formulär för annotering av funktioner av högre ordning.

source: ``Concatenate`` can be used in conjunction with :ref:`Callable <annotating-callables>` and :class:`ParamSpec` to annotate a higher-order callable which adds, removes, or transforms parameters of another callable. Usage is in the form ``Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable]``. ``Concatenate`` is currently only valid when used as the first argument to a :ref:`Callable <annotating-callables>`. The last parameter to ``Concatenate`` must be a :class:`ParamSpec` or ellipsis (``...``).
sv: ``Concatenate`` kan användas tillsammans med :ref:``Callable <annotating-callables>`` och :class:`ParamSpec` för att annotera en högre ordningens callable som lägger till, tar bort eller transformerar parametrar för en annan callable. Användningen är i formen ``Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable]``. ``Concatenate`` är för närvarande endast giltig när den används som det första argumentet till en :ref:`Callable <annotating-callables>`. Den sista parametern till ``Concatenate`` måste vara en :class:`ParamSpec` eller ellips (``...``).

source: For example, to annotate a decorator ``with_lock`` which provides a :class:`threading.Lock` to the decorated function, ``Concatenate`` can be used to indicate that ``with_lock`` expects a callable which takes in a ``Lock`` as the first argument, and returns a callable with a different type signature. In this case, the :class:`ParamSpec` indicates that the returned callable's parameter types are dependent on the parameter types of the callable being passed in::
sv: Till exempel, för att annotera en dekorator ``with_lock`` som tillhandahåller en :class:`threading.Lock` till den dekorerade funktionen, kan ``Concatenate`` användas för att indikera att ``with_lock`` förväntar sig en anropbar som tar in en ``Lock`` som första argument, och returnerar en anropbar med en annan typsignatur. I detta fall indikerar :class:`ParamSpec` att parametertyperna för den returnerade anropbara är beroende av parametertyperna för den anropbara som skickas in::

source: :pep:`612` -- Parameter Specification Variables (the PEP which introduced ``ParamSpec`` and ``Concatenate``)
sv: :pep:`612` -- Variabler för parameterspecifikation (PEP:n som introducerade ``ParamSpec`` och ``Concatenate``)

source: :ref:`annotating-callables`
sv: :ref:`annoterande-kallelser`

source: Special typing form to define "literal types".
sv: Särskild typform för att definiera "bokstavstyper".

source: ``Literal`` can be used to indicate to type checkers that the annotated object has a value equivalent to one of the provided literals.
sv: ``Literal`` kan användas för att indikera för typkontrollanter att det annoterade objektet har ett värde som motsvarar en av de angivna litteralerna.

source: def validate_simple(data: Any) -> Literal[True]: # always returns True ... type Mode = Literal['r', 'rb', 'w', 'wb'] def open_helper(file: str, mode: Mode) -> str: ... open_helper('/some/path', 'r') # Passes type check open_helper('/other/path', 'typo') # Error in type checker
sv: def validate_simple(data: Any) -> Literal[True]: # returnerar alltid True ... type Mode = Literal['r', 'rb', 'w', 'wb'] def open_helper(file: str, mode: Mode) -> str: ... open_helper('/some/path', 'r') # Klarar typkontroll open_helper('/other/path', 'typo') # Fel i typkontrollen

source: ``Literal[...]`` cannot be subclassed. At runtime, an arbitrary value is allowed as type argument to ``Literal[...]``, but type checkers may impose restrictions. See :pep:`586` for more details about literal types.
sv: ``Literal[...]`` kan inte underklassas. Vid körning tillåts ett godtyckligt värde som typargument till ``Literal[...]``, men typkontrollanter kan införa restriktioner. Se :pep:`586` för mer information om litterala typer.

source: Additional details:
sv: Ytterligare detaljer:

source: The arguments must be literal values and there must be at least one.
sv: Argumenten måste vara bokstavliga värden och det måste finnas minst ett.

source: Nested ``Literal`` types are flattened, e.g.::
sv: Nästlade ``Literal``-typer plattas ut, t.ex.::

source: However, this does not apply to ``Literal`` types referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
sv: Detta gäller dock inte för ``Literal``-typer som refereras till via ett typalias, för att undvika att tvinga fram en utvärdering av den underliggande :class:`TypeAliasType`::

source: type A = Literal[1, 2] assert Literal[A, 3] != Literal[1, 2, 3]
sv: typ A = Litteral[1, 2] assert Litteral[A, 3] != Litteral[1, 2, 3]

source: When comparing literals, the argument order is ignored, e.g.::
sv: Vid jämförelse av literaler ignoreras argumentordningen, t.ex.::

source: You cannot subclass or instantiate a ``Literal``.
sv: Du kan inte underklassa eller instansiera en ``Literal``.

source: You cannot write ``Literal[X][Y]``.
sv: Du kan inte skriva ``Literal[X][Y]``.

source: ``Literal`` now de-duplicates parameters. Equality comparisons of ``Literal`` objects are no longer order dependent. ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if one of their parameters are not :term:`hashable`.
sv: ``Literal`` avduplicerar nu parametrar. Jämlikhetsjämförelser av ``Literal``-objekt är inte längre beroende av ordning. ``Literal`` objekt kommer nu att ge upphov till ett :exc:`TypeError` undantag under jämlikhetsjämförelser om en av deras parametrar inte är :term:`hashable`.

source: Special type construct to mark class variables.
sv: Särskild typkonstruktion för att markera klassvariabler.
