Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: def greet(name: str) -> None: assert_type(name, str) # OK, inferred type of `name` is `str` assert_type(name, int) # type checker error
sv: def greet(namn: str) -> None: assert_type(name, str) # OK, den härledda typen av `namn` är `str` assert_type(name, int) # fel i typkontrollen

source: This function is useful for ensuring the type checker's understanding of a script is in line with the developer's intentions::
sv: Denna funktion är användbar för att säkerställa att typkontrollantens förståelse av ett skript är i linje med utvecklarens avsikter::

source: def complex_function(arg: object): # Do some complex type-narrowing logic, # after which we hope the inferred type will be `int` ... # Test whether the type checker correctly understands our function assert_type(arg, int)
sv: def komplex_funktion(arg: objekt): # Gör en del komplex logik för typbegränsning, # varefter vi hoppas att den härledda typen kommer att vara `int` ... # Testa om typkontrollen förstår vår funktion korrekt assert_type(arg, int)

source: Ask a static type checker to confirm that a line of code is unreachable.
sv: Be en statisk typkontroll att bekräfta att en kodrad är oåtkomlig.

source: Example::
sv: Exempel::

source: def int_or_str(arg: int | str) -> None: match arg: case int(): print("It's an int") case str(): print("It's a str") case _ as unreachable: assert_never(unreachable)
sv: def int_or_str(arg: int | str) -> None: matcha arg: fall int(): print("Det är en int") fall str(): print("Det är en str") fall _ som oåtkomlig: assert_never(oåtkomlig)

source: Here, the annotations allow the type checker to infer that the last case can never execute, because ``arg`` is either an :class:`int` or a :class:`str`, and both options are covered by earlier cases.
sv: Här gör annotationerna det möjligt för typkontrollen att dra slutsatsen att det sista fallet aldrig kan utföras, eftersom ``arg`` antingen är en :class:`int` eller en :class:`str`, och båda alternativen täcks av tidigare fall.

source: If a type checker finds that a call to ``assert_never()`` is reachable, it will emit an error. For example, if the type annotation for ``arg`` was instead ``int | str | float``, the type checker would emit an error pointing out that ``unreachable`` is of type :class:`float`. For a call to ``assert_never`` to pass type checking, the inferred type of the argument passed in must be the bottom type, :data:`Never`, and nothing else.
sv: Om en typkontrollör upptäcker att ett anrop till ``assert_never()`` är nåbart, kommer den att avge ett felmeddelande. Till exempel, om typannoteringen för ``arg`` istället var ``int | str | float``, skulle typkontrollen avge ett felmeddelande som påpekar att ``unreachable`` är av typen :class:`float`. För att ett anrop till ``assert_never`` ska klara typkontrollen måste den härledda typen av argumentet som skickas in vara bottentypen, :data:`Never`, och inget annat.

source: At runtime, this throws an exception when called.
sv: Vid körning kastar detta ett undantag när det anropas.

source: `Unreachable Code and Exhaustiveness Checking <https://typing.python.org/en/latest/guides/unreachable.html>`__ has more information about exhaustiveness checking with static typing.
sv: i `Unreachable Code and Exhaustiveness Checking <https://typing.python.org/en/latest/guides/unreachable.html>`__ finns mer information om kontroll av fullständighet med statisk typning.

source: Ask a static type checker to reveal the inferred type of an expression.
sv: Be en statisk typkontrollör att avslöja den härledda typen för ett uttryck.

source: When a static type checker encounters a call to this function, it emits a diagnostic with the inferred type of the argument. For example::
sv: När en statisk typkontrollör stöter på ett anrop till denna funktion avger den en diagnostik med den härledda typen av argumentet. Till exempel::

source: x: int = 1 reveal_type(x) # Revealed type is "builtins.int"
sv: x: int = 1 reveal_type(x) # Avslöjad typ är "builtins.int"

source: This can be useful when you want to debug how your type checker handles a particular piece of code.
sv: Detta kan vara användbart när du vill felsöka hur din typkontroll hanterar en viss kod.

source: At runtime, this function prints the runtime type of its argument to :data:`sys.stderr` and returns the argument unchanged (allowing the call to be used within an expression)::
sv: Vid körning skriver denna funktion ut körtidstypen för sitt argument till :data:`sys.stderr` och returnerar argumentet oförändrat (vilket gör att anropet kan användas inom ett uttryck)::

source: x = reveal_type(1) # prints "Runtime type is int" print(x) # prints "1"
sv: x = reveal_type(1) # skriver ut "Körtidstypen är int" print(x) # skriver ut "1"

source: Note that the runtime type may be different from (more or less specific than) the type statically inferred by a type checker.
sv: Observera att körtidstypen kan skilja sig från (mer eller mindre specifik än) den typ som statiskt härleds av en typkontroll.

source: Most type checkers support ``reveal_type()`` anywhere, even if the name is not imported from ``typing``. Importing the name from ``typing``, however, allows your code to run without runtime errors and communicates intent more clearly.
sv: De flesta typkontrollprogram stöder ``reveal_type()`` var som helst, även om namnet inte importeras från ``typing``. Att importera namnet från ``typing`` gör dock att din kod kan köras utan körtidsfel och kommunicerar avsikten tydligare.

source: Decorator to mark an object as providing :func:`dataclass <dataclasses.dataclass>`-like behavior.
sv: Dekorator för att markera att ett objekt har ett :func:`dataklass <dataklasser.dataklass>`-liknande beteende.

source: ``dataclass_transform`` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class in a similar way to :func:`@dataclasses.dataclass <dataclasses.dataclass>`.
sv: ``dataclass_transform`` kan användas för att dekorera en klass, metaklass eller en funktion som i sig är en dekorator. Närvaron av ``@dataclass_transform()`` talar om för en statisk typkontrollant att det dekorerade objektet utför "magi" under körning som transformerar en klass på ett liknande sätt som :func:`@dataclasses.dataclass <dataclasses.dataclass>`.

source: Example usage with a decorator function:
sv: Exempel på användning med en dekoratorfunktion:

source: @dataclass_transform() def create_model[T](cls: type[T]) -> type[T]: ... return cls @create_model class CustomerModel: id: int name: str
sv: @dataklass_transform() def create_model[T](cls: type[T]) -> type[T]: ... returnera cls @skapa_modell klass CustomerModel: id: int namn: str

source: On a base class::
sv: På en basklass::

source: @dataclass_transform() class ModelBase: ... class CustomerModel(ModelBase): id: int name: str
sv: @dataklass_transform() klass ModelBase: ... klass CustomerModel(ModelBase): id: int name: str

source: On a metaclass::
sv: På en metaklass::

source: @dataclass_transform() class ModelMeta(type): ... class ModelBase(metaclass=ModelMeta): ... class CustomerModel(ModelBase): id: int name: str
sv: @dataklass_transform() klass ModelMeta(typ): ... klass ModelBase(metaklass=ModelMeta): ... klass CustomerModel(ModelBase): id: int name: str

source: The ``CustomerModel`` classes defined above will be treated by type checkers similarly to classes created with :func:`@dataclasses.dataclass <dataclasses.dataclass>`. For example, type checkers will assume these classes have ``__init__`` methods that accept ``id`` and ``name``.
sv: Klasserna ``CustomerModel`` som definieras ovan kommer att behandlas av typkontrollprogram på samma sätt som klasser som skapats med :func:`@dataclasses.dataclass <dataclasses.dataclass>`. Exempelvis kommer typkontrollerna att anta att dessa klasser har ``__init__``-metoder som accepterar ``id`` och ``name``.

source: The decorated class, metaclass, or function may accept the following bool arguments which type checkers will assume have the same effect as they would have on the :func:`@dataclasses.dataclass<dataclasses.dataclass>` decorator: ``init``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only``, and ``slots``. It must be possible for the value of these arguments (``True`` or ``False``) to be statically evaluated.
sv: Den dekorerade klassen, metaklassen eller funktionen kan acceptera följande bool-argument som typkontrollanter kommer att anta har samma effekt som de skulle ha på :func:`@dataclasses.dataclass<dataclasses.dataclass>`-dekoratorn: ``init``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only`` och ``slots``. Det måste vara möjligt att statiskt utvärdera värdet av dessa argument (``True`` eller ``False``).

source: The arguments to the ``dataclass_transform`` decorator can be used to customize the default behaviors of the decorated class, metaclass, or function:
sv: Argumenten till dekoratorn ``dataclass_transform`` kan användas för att anpassa standardbeteendena för den dekorerade klassen, metaklassen eller funktionen:

source: Parameters
sv: Parametrar

source: Indicates whether the ``eq`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``True``.
sv: Anger om parametern ``eq`` ska antas vara ``True`` eller ``False`` om den utelämnas av anroparen. Standardvärdet är ``True``.

source: Indicates whether the ``order`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
sv: Anger om parametern ``order`` ska antas vara ``True`` eller ``False`` om den utelämnas av den som anropar. Standardvärdet är ``False``.

source: Indicates whether the ``kw_only`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
sv: Anger om parametern ``kw_only`` ska antas vara ``True`` eller ``False`` om den utelämnas av den som anropar. Standardvärdet är ``False``.

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``. .. versionadded:: 3.12
sv: Anger om parametern ``frozen`` ska antas vara ``True`` eller ``False`` om den utelämnas av den som anropar. Standardvärdet är ``False``. .. versionadded:: 3.12

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
sv: Anger om parametern ``frozen`` ska antas vara ``True`` eller ``False`` om den utelämnas av den som anropar. Standardvärdet är ``False``.

source: Specifies a static list of supported classes or functions that describe fields, similar to :func:`dataclasses.field`. Defaults to ``()``.
sv: Anger en statisk lista över klasser eller funktioner som stöds och som beskriver fält, liknande :func:`dataclasses.field`. Standardvärdet är ``()``.

source: Arbitrary other keyword arguments are accepted in order to allow for possible future extensions.
sv: Godtyckliga andra nyckelordsargument accepteras för att möjliggöra eventuella framtida tillägg.

source: Type checkers recognize the following optional parameters on field specifiers:
sv: Typkontroller känner igen följande valfria parametrar på fältspecifikatorer:

source: **Recognised parameters for field specifiers**
sv: **Erkända parametrar för fältangivelser**

source: Parameter name
sv: Parameternamn

source: Description
sv: Beskrivning

source: Indicates whether the field should be included in the synthesized ``__init__`` method. If unspecified, ``init`` defaults to ``True``.
sv: Anger om fältet ska ingå i den syntetiserade metoden ``__init__``. Om inget anges är ``init`` standardvärdet ``True``.

source: ``default``
sv: ``standard``

source: Provides the default value for the field.
sv: Anger standardvärdet för fältet.

source: ``default_factory``
sv: ``standard_fabrik``

source: Provides a runtime callback that returns the default value for the field. If neither ``default`` nor ``default_factory`` are specified, the field is assumed to have no default value and must be provided a value when the class is instantiated.
sv: Tillhandahåller ett runtime callback som returnerar standardvärdet för fältet. Om varken ``default`` eller ``default_factory`` anges, antas fältet inte ha något standardvärde och måste förses med ett värde när klassen instansieras.

source: ``factory``
sv: "fabrik

source: An alias for the ``default_factory`` parameter on field specifiers.
sv: Ett alias för parametern ``default_factory`` på fältspecifikatorer.

source: Indicates whether the field should be marked as keyword-only. If ``True``, the field will be keyword-only. If ``False``, it will not be keyword-only. If unspecified, the value of the ``kw_only`` parameter on the object decorated with ``dataclass_transform`` will be used, or if that is unspecified, the value of ``kw_only_default`` on ``dataclass_transform`` will be used.
sv: Anger om fältet ska markeras som endast nyckelord. Om ``True``, kommer fältet att vara nyckelordsskyddat. Om ``False``, kommer det inte att vara nyckelordsskyddat. Om det är ospecificerat, kommer värdet på parametern ``kw_only`` på objektet som dekorerats med ``dataclass_transform`` att användas, eller om det är ospecificerat, kommer värdet på ``kw_only_default`` på ``dataclass_transform`` att användas.

source: Provides an alternative name for the field. This alternative name is used in the synthesized ``__init__`` method.
sv: Anger ett alternativt namn för fältet. Detta alternativa namn används i den syntetiserade metoden ``__init__``.

source: At runtime, this decorator records its arguments in the ``__dataclass_transform__`` attribute on the decorated object. It has no other runtime effect.
sv: Vid körning registrerar denna dekorator sina argument i attributet ``__dataclass_transform__`` på det dekorerade objektet. Den har ingen annan effekt under körning.

source: See :pep:`681` for more details.
sv: Se :pep:`681` för mer information.

source: Decorator for creating overloaded functions and methods.
sv: Dekorator för att skapa överladdade funktioner och metoder.

source: The ``@overload`` decorator allows describing functions and methods that support multiple different combinations of argument types. A series of ``@overload``-decorated definitions must be followed by exactly one non-``@overload``-decorated definition (for the same function/method).
sv: Dekoratorn ``@overload`` gör det möjligt att beskriva funktioner och metoder som stöder flera olika kombinationer av argumenttyper. En serie ``@overload``-dekorerade definitioner måste följas av exakt en icke ``@overload``-dekorerad definition (för samma funktion/metod).

source: ``@overload``-decorated definitions are for the benefit of the type checker only, since they will be overwritten by the non-``@overload``-decorated definition. The non-``@overload``-decorated definition, meanwhile, will be used at runtime but should be ignored by a type checker. At runtime, calling an ``@overload``-decorated function directly will raise :exc:`NotImplementedError`.
sv: ``@overload``-dekorerade definitioner är endast till fördel för typkontrollanten, eftersom de kommer att skrivas över av den icke``@overload``-dekorerade definitionen. Den icke ``@overload``-dekorerade definitionen kommer däremot att användas vid körning men bör ignoreras av en typkontrollant. Vid körning kommer anrop av en ``@overload``-dekorerad funktion direkt att ge upphov till :exc:`NotImplementedError`.

source: An example of overload that gives a more precise type than can be expressed using a union or a type variable:
sv: Ett exempel på överbelastning som ger en mer exakt typ än vad som kan uttryckas med hjälp av en union eller en typvariabel:

source: @overload def process(response: None) -> None: ... @overload def process(response: int) -> tuple[int, str]: ... @overload def process(response: bytes) -> str: ... def process(response): ... # actual implementation goes here
sv: @överbelastning def process(svar: None) -> None: ... @överbelastning def process(response: int) -> tuple[int, str]: ... @överbelastning def process(svar: bytes) -> str: ... def process(svar): ... # faktisk implementering går här

source: See :pep:`484` for more details and comparison with other typing semantics.
sv: Se :pep:`484` för mer information och jämförelse med annan typningssemantik.

source: Overloaded functions can now be introspected at runtime using :func:`get_overloads`.
sv: Överladdade funktioner kan nu introspekteras vid körning med :func:`get_overloads`.

source: Return a sequence of :func:`@overload <overload>`-decorated definitions for *func*.
sv: Returnerar en sekvens av :func:`@overload <overload>`-dekorerade definitioner för *func*.

source: *func* is the function object for the implementation of the overloaded function. For example, given the definition of ``process`` in the documentation for :func:`@overload <overload>`, ``get_overloads(process)`` will return a sequence of three function objects for the three defined overloads. If called on a function with no overloads, ``get_overloads()`` returns an empty sequence.
sv: *func* är funktionsobjektet för implementeringen av den överladdade funktionen. Till exempel, givet definitionen av ``process`` i dokumentationen för :func:`@overload <overload>`, kommer ``get_overloads(process)`` att returnera en sekvens av tre funktionsobjekt för de tre definierade överbelastningarna. Om den anropas på en funktion utan överbelastningar returnerar ``get_overloads()`` en tom sekvens.

source: ``get_overloads()`` can be used for introspecting an overloaded function at runtime.
sv: ``get_overloads()`` kan användas för att introspektera en överbelastad funktion under körning.

source: Clear all registered overloads in the internal registry.
sv: Rensa alla registrerade överbelastningar i det interna registret.

source: This can be used to reclaim the memory used by the registry.
sv: Detta kan användas för att återta det minne som används av registret.

source: Decorator to indicate final methods and final classes.
sv: Dekorator för att ange slutgiltiga metoder och slutgiltiga klasser.

source: Decorating a method with ``@final`` indicates to a type checker that the method cannot be overridden in a subclass. Decorating a class with ``@final`` indicates that it cannot be subclassed.
sv: Att dekorera en metod med ``@final`` indikerar för en typkontrollant att metoden inte kan åsidosättas i en underklass. Att dekorera en klass med ``@final`` indikerar att den inte kan subklassas.

source: class Base: @final def done(self) -> None: ... class Sub(Base): def done(self) -> None: # Error reported by type checker ... @final class Leaf: ... class Other(Leaf): # Error reported by type checker ...
sv: klass Bas: @slutlig def done(self) -> Ingen: ... klassen Sub(Base): def done(self) -> None: # Fel rapporterat av typkontroll ... @slutlig klass Leaf: ... klass Annan(Blad): # Fel rapporterat av typkontroll ...

source: The decorator will now attempt to set a ``__final__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__final__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as final. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
sv: Dekoratorn kommer nu att försöka sätta attributet ``__final__`` till ``True`` på det dekorerade objektet. Således kan en kontroll som ``if getattr(obj, "__final__", False)`` användas vid runtime för att avgöra om ett objekt ``obj`` har markerats som final. Om det dekorerade objektet inte har stöd för att sätta attribut, returnerar dekoratorn objektet oförändrat utan att skapa ett undantag.

source: Decorator to indicate that annotations are not type hints.
sv: Dekorator för att ange att annotationer inte är typtips.

source: This works as a class or function :term:`decorator`. With a class, it applies recursively to all methods and classes defined in that class (but not to methods defined in its superclasses or subclasses). Type checkers will ignore all annotations in a function or class with this decorator.
sv: Detta fungerar som en klass eller funktion :term:`decorator`. För en klass gäller den rekursivt för alla metoder och klasser som definieras i den klassen (men inte för metoder som definieras i dess superklasser eller subklasser). Typkontrollanter ignorerar alla annoteringar i en funktion eller klass med denna dekorator.

source: ``@no_type_check`` mutates the decorated object in place.
sv: ``@no_type_check`` muterar det dekorerade objektet på plats.

source: Decorator to give another decorator the :func:`no_type_check` effect.
sv: Dekorator för att ge en annan dekorator :func:`no_type_check`-effekten.

source: This wraps the decorator with something that wraps the decorated function in :func:`no_type_check`.
sv: Detta omsluter dekoratorn med något som omsluter den dekorerade funktionen i :func:`no_type_check`.

source: No type checker ever added support for ``@no_type_check_decorator``. It is therefore deprecated, and will be removed in Python 3.15.
sv: Ingen typkontroll har någonsin lagt till stöd för ``@no_type_check_decorator``. Det är därför föråldrat och kommer att tas bort i Python 3.15.

source: Decorator to indicate that a method in a subclass is intended to override a method or attribute in a superclass.
sv: Dekorator för att ange att en metod i en subklass är avsedd att åsidosätta en metod eller ett attribut i en superklass.

source: Type checkers should emit an error if a method decorated with ``@override`` does not, in fact, override anything. This helps prevent bugs that may occur when a base class is changed without an equivalent change to a child class.
sv: Typkontroller bör avge ett felmeddelande om en metod som dekorerats med ``@override`` i själva verket inte åsidosätter något. Detta hjälper till att förhindra buggar som kan uppstå när en basklass ändras utan att en underordnad klass ändras på motsvarande sätt.

source: class Base: def log_status(self) -> None: ... class Sub(Base): @override def log_status(self) -> None: # Okay: overrides Base.log_status ... @override def done(self) -> None: # Error reported by type checker ...
sv: klass Bas: def log_status(self) -> Ingen: ... klass Sub(Base): @override def log_status(self) -> Ingen: # Okej: åsidosätter Base.log_status ... @överstyrning def done(self) -> Ingen: # Fel rapporterat av typkontroll ...

source: There is no runtime checking of this property.
sv: Det finns ingen runtime-kontroll av denna egenskap.

source: The decorator will attempt to set an ``__override__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__override__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as an override. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
sv: Dekoratorn kommer att försöka sätta ett ``__override__`` attribut till ``True`` på det dekorerade objektet. Således kan en kontroll som ``if getattr(obj, "__override__", False)`` användas vid körning för att avgöra om ett objekt ``obj`` har markerats som en åsidosättning. Om det dekorerade objektet inte har stöd för att ställa in attribut, returnerar dekoratorn objektet oförändrat utan att skapa ett undantag.

source: See :pep:`698` for more details.
sv: Se :pep:`698` för mer information.

source: Decorator to mark a class or function as unavailable at runtime.
sv: Dekorator för att markera att en klass eller funktion inte är tillgänglig vid körning.
