Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: class C: def meth(self) -> int: return 0 def func(x: Proto) -> int: return x.meth() func(C()) # Passes static type check
sv: klass C: def meth(self) -> int: return 0 def func(x: Proto) -> int: return x.meth() func(C()) # Passerar statisk typkontroll

source: See :pep:`544` for more details. Protocol classes decorated with :func:`runtime_checkable` (described later) act as simple-minded runtime protocols that check only the presence of given attributes, ignoring their type signatures. Protocol classes without this decorator cannot be used as the second argument to :func:`isinstance` or :func:`issubclass`.
sv: Se :pep:`544` för mer information. Protokollklasser dekorerade med :func:`runtime_checkable` (beskrivs senare) fungerar som enkla körtidsprotokoll som endast kontrollerar förekomsten av givna attribut och ignorerar deras typsignaturer. Protokollklasser utan denna dekorator kan inte användas som det andra argumentet till :func:`isinstance` eller :func:`issubclass`.

source: Protocol classes can be generic, for example::
sv: Protokollklasserna kan vara generiska, till exempel::

source: class GenProto[T](Protocol): def meth(self) -> T: ...
sv: klass GenProto[T](Protokoll): def meth(self) -> T: ...

source: In code that needs to be compatible with Python 3.11 or older, generic Protocols can be written as follows::
sv: I kod som måste vara kompatibel med Python 3.11 eller äldre kan generiska protokoll skrivas på följande sätt::

source: T = TypeVar("T") class GenProto(Protocol[T]): def meth(self) -> T: ...
sv: T = TypVar("T") klass GenProto(Protokoll[T]): def meth(self) -> T: ...

source: Mark a protocol class as a runtime protocol.
sv: Markera en protokollklass som ett runtime-protokoll.

source: Such a protocol can be used with :func:`isinstance` and :func:`issubclass`. This allows a simple-minded structural check, very similar to "one trick ponies" in :mod:`collections.abc` such as :class:`~collections.abc.Iterable`. For example::
sv: Ett sådant protokoll kan användas med :func:`isinstance` och :func:`issubclass`. Detta möjliggör en enkel strukturell kontroll, mycket lik "one trick ponies" i :mod:`collections.abc` såsom :class:`~collections.abc.Iterable`. Till exempel::

source: This decorator raises :exc:`TypeError` when applied to a non-protocol class.
sv: Denna dekorator ger upphov till :exc:`TypeError` när den tillämpas på en icke-protokollklass.

source: :func:`!runtime_checkable` will check only the presence of the required methods or attributes, not their type signatures or types. For example, :class:`ssl.SSLObject` is a class, therefore it passes an :func:`issubclass` check against :ref:`Callable <annotating-callables>`. However, the ``ssl.SSLObject.__init__`` method exists only to raise a :exc:`TypeError` with a more informative message, therefore making it impossible to call (instantiate) :class:`ssl.SSLObject`.
sv: :func:`!runtime_checkable` kontrollerar endast förekomsten av de nödvändiga metoderna eller attributen, inte deras typsignaturer eller typer. Till exempel är :class:`ssl.SSLObject` en klass, därför klarar den en :func:`issubclass`-kontroll mot :ref:`Callable <annotating-callables>`. Men metoden ``ssl.SSLObject.__init__`` existerar bara för att ge upphov till ett :exc:`TypeError` med ett mer informativt meddelande, vilket gör det omöjligt att anropa (instansiera) :class:`ssl.SSLObject`.

source: An :func:`isinstance` check against a runtime-checkable protocol can be surprisingly slow compared to an ``isinstance()`` check against a non-protocol class. Consider using alternative idioms such as :func:`hasattr` calls for structural checks in performance-sensitive code.
sv: En :func:`isinstance`-kontroll mot ett protokoll som kan kontrolleras under körtiden kan vara förvånansvärt långsam jämfört med en ``isinstance()``-kontroll mot en icke-protokollklass. Överväg att använda alternativa idiom som :func:`hasattr`-anrop för strukturella kontroller i prestandakänslig kod.

source: The internal implementation of :func:`isinstance` checks against runtime-checkable protocols now uses :func:`inspect.getattr_static` to look up attributes (previously, :func:`hasattr` was used). As a result, some objects which used to be considered instances of a runtime-checkable protocol may no longer be considered instances of that protocol on Python 3.12+, and vice versa. Most users are unlikely to be affected by this change.
sv: Den interna implementationen av :func:`isinstance`-kontroller mot runtime-checkable-protokoll använder nu :func:`inspect.getattr_static` för att leta upp attribut (tidigare användes :func:`hasattr`). Som ett resultat kan vissa objekt som tidigare betraktades som instanser av ett runtime-checkable-protokoll inte längre betraktas som instanser av det protokollet på Python 3.12+, och vice versa. De flesta användare kommer troligen inte att påverkas av denna ändring.

source: The members of a runtime-checkable protocol are now considered "frozen" at runtime as soon as the class has been created. Monkey-patching attributes onto a runtime-checkable protocol will still work, but will have no impact on :func:`isinstance` checks comparing objects to the protocol. See :ref:`What's new in Python 3.12 <whatsnew-typing-py312>` for more details.
sv: Medlemmarna i ett protokoll som kan kontrolleras vid körning betraktas nu som ”frysta” vid körning så snart klassen har skapats. Att lägga till attribut till ett protokoll som kan kontrolleras vid körning fungerar fortfarande, men har ingen inverkan på :func:`isinstance`-kontroller som jämför objekt med protokollet. Se :ref:`Vad är nytt i Python 3.12 <whatsnew-typing-py312>` för mer information.

source: Special construct to add type hints to a dictionary. At runtime it is a plain :class:`dict`.
sv: Specialkonstruktion för att lägga till typtips i en ordbok. Vid körning är det en vanlig :class:`dict`.

source: ``TypedDict`` declares a dictionary type that expects all of its instances to have a certain set of keys, where each key is associated with a value of a consistent type. This expectation is not checked at runtime but is only enforced by type checkers. Usage::
sv: ``TypedDict`` deklarerar en ordbokstyp som förväntar sig att alla dess instanser ska ha en viss uppsättning nycklar, där varje nyckel är associerad med ett värde av en konsekvent typ. Denna förväntan kontrolleras inte vid körning utan verkställs endast av typkontrollanter. Användning::

source: class Point2D(TypedDict): x: int y: int label: str a: Point2D = {'x': 1, 'y': 2, 'label': 'good'} # OK b: Point2D = {'z': 3, 'label': 'bad'} # Fails type check assert Point2D(x=1, y=2, label='first') == dict(x=1, y=2, label='first')
sv: klass Point2D(TypedDict): x: int y: int etikett: str a: Point2D = {'x': 1, 'y': 2, 'label': 'good'} # OK b: Point2D = {'z': 3, 'label': 'bad'} # Misslyckas med typkontroll assert Point2D(x=1, y=2, label='first') == dict(x=1, y=2, label='first')

source: An alternative way to create a ``TypedDict`` is by using function-call syntax. The second argument must be a literal :class:`dict`::
sv: Ett alternativt sätt att skapa en ``TypedDict`` är att använda syntax för funktionsanrop. Det andra argumentet måste vara en bokstavlig :class:`dict`::

source: This functional syntax allows defining keys which are not valid :ref:`identifiers <identifiers>`, for example because they are keywords or contain hyphens, or when key names must not be :ref:`mangled <private-name-mangling>` like regular private names::
sv: Denna funktionella syntax gör det möjligt att definiera nycklar som inte är giltiga :ref:`identifierare <identifiers>`, till exempel för att de är nyckelord eller innehåller bindestreck, eller när nyckelnamn inte får :ref:`manglas <private-name-mangling>` som vanliga privata namn::

source: # raises SyntaxError class Point2D(TypedDict): in: int # 'in' is a keyword x-y: int # name with hyphens class Definition(TypedDict): __schema: str # mangled to `_Definition__schema` # OK, functional syntax Point2D = TypedDict('Point2D', {'in': int, 'x-y': int}) Definition = TypedDict('Definition', {'__schema': str}) # not mangled
sv: # raises SyntaxError klass Point2D(TypedDict): in: int # 'in' är ett nyckelord x-y: int # namn med bindestreck klass Definition(TypedDict): __schema: str # manglad till `_Definition__schema` # OK, funktionell syntax Point2D = TypedDict('Point2D', {'in': int, 'x-y': int}) Definition = TypedDict('Definition', {'__schema': str}) # inte manglad

source: By default, all keys must be present in a ``TypedDict``. It is possible to mark individual keys as non-required using :data:`NotRequired`::
sv: Som standard måste alla nycklar finnas i en ``TypedDict``. Det är möjligt att markera enskilda nycklar som icke-obligatoriska med :data:`NotRequired`::

source: class Point2D(TypedDict): x: int y: int label: NotRequired[str] # Alternative syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int, 'label': NotRequired[str]})
sv: klass Point2D(TypedDict): x: int y: int etikett: InteKrävs[str] # Alternativ syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int, 'label': NotRequired[str]})

source: This means that a ``Point2D`` ``TypedDict`` can have the ``label`` key omitted.
sv: Detta innebär att en ``Point2D`` ``TypedDict`` kan ha nyckeln ``label`` utelämnad.

source: It is also possible to mark all keys as non-required by default by specifying a totality of ``False``::
sv: Det är också möjligt att markera alla nycklar som icke nödvändiga som standard genom att ange ett antal ``False``::

source: class Point2D(TypedDict, total=False): x: int y: int # Alternative syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int}, total=False)
sv: class Point2D(TypedDict, total=False): x: int y: int # Alternativ syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int}, total=False)

source: This means that a ``Point2D`` ``TypedDict`` can have any of the keys omitted. A type checker is only expected to support a literal ``False`` or ``True`` as the value of the ``total`` argument. ``True`` is the default, and makes all items defined in the class body required.
sv: Detta innebär att en ``Point2D`` ``TypedDict`` kan ha någon av nycklarna utelämnad. En typkontroll förväntas endast stödja en bokstavlig ``False`` eller ``True`` som värdet av ``total`` argumentet. ``True`` är standard och gör att alla objekt som definieras i klassens kropp är obligatoriska.

source: Individual keys of a ``total=False`` ``TypedDict`` can be marked as required using :data:`Required`::
sv: Enskilda nycklar i en ``TypedDict`` med ``total=False`` kan markeras som obligatoriska med :data:`Required`::

source: class Point2D(TypedDict, total=False): x: Required[int] y: Required[int] label: str # Alternative syntax Point2D = TypedDict('Point2D', { 'x': Required[int], 'y': Required[int], 'label': str }, total=False)
sv: class Point2D(TypedDict, total=False): x: Krävs[int] y: Krävs[int] etikett: str # Alternativ syntax Point2D = TypedDict('Point2D', { 'x': Krävs[int], 'y': Krävs[int], 'label': str }, total=False)

source: It is possible for a ``TypedDict`` type to inherit from one or more other ``TypedDict`` types using the class-based syntax. Usage::
sv: Det är möjligt för en typ av ``TypedDict`` att ärva från en eller flera andra typer av ``TypedDict`` med hjälp av den klassbaserade syntaxen. Användning::

source: class Point3D(Point2D): z: int
sv: klass Point3D(Point2D): z: int

source: ``Point3D`` has three items: ``x``, ``y`` and ``z``. It is equivalent to this definition::
sv: ``Point3D`` har tre objekt: ``x``, ``y`` och ``z``. Den är ekvivalent med denna definition::

source: class Point3D(TypedDict): x: int y: int z: int
sv: klass Point3D(TypedDict): x: int y: int z: int

source: A ``TypedDict`` cannot inherit from a non-\ ``TypedDict`` class, except for :class:`Generic`. For example::
sv: En ``TypedDict`` kan inte ärva från en icke ``TypedDict``-klass, förutom :class:`Generic``. Till exempel::

source: class X(TypedDict): x: int class Y(TypedDict): y: int class Z(object): pass # A non-TypedDict class class XY(X, Y): pass # OK class XZ(X, Z): pass # raises TypeError
sv: klass X(TypedDict): x: int klass Y(TypedDict): y: int class Z(object): pass # En icke-TypedDict-klass class XY(X, Y): pass # OK class XZ(X, Z): pass # ger upphov till TypeError

source: A ``TypedDict`` can be generic::
sv: En ``TypedDict`` kan vara generisk::

source: class Group[T](TypedDict): key: T group: list[T]
sv: class Group[T](TypedDict): nyckel: T group: lista[T]

source: To create a generic ``TypedDict`` that is compatible with Python 3.11 or lower, inherit from :class:`Generic` explicitly:
sv: För att skapa en generisk ``TypedDict`` som är kompatibel med Python 3.11 eller lägre, ärva från :class:`Generic` explicit:

source: T = TypeVar("T") class Group(TypedDict, Generic[T]): key: T group: list[T]
sv: T = TypVar("T") class Group(TypedDict, Generisk[T]): nyckel: T group: lista[T]

source: A ``TypedDict`` can be introspected via annotations dicts (see :ref:`annotations-howto` for more information on annotations best practices), :attr:`__total__`, :attr:`__required_keys__`, and :attr:`__optional_keys__`.
sv: En ``TypedDict`` kan introspekteras via annotationsdict (se :ref:`annotations-howto` för mer information om bästa praxis för annotationer), :attr:`__total__`, :attr:`__required_keys__` och :attr:`__optional_keys__`.

source: ``Point2D.__total__`` gives the value of the ``total`` argument. Example:
sv: ``Point2D.__total__`` ger värdet av argumentet ``total``. Exempel:

source: >>> from typing import TypedDict >>> class Point2D(TypedDict): pass >>> Point2D.__total__ True >>> class Point2D(TypedDict, total=False): pass >>> Point2D.__total__ False >>> class Point3D(Point2D): pass >>> Point3D.__total__ True
sv: >>> from typing import TypedDict >>> class Point2D(TypedDict): pass >>> Point2D.__total__ Sann >>> class Point2D(TypedDict, total=False): pass >>> Point2D.__total__ False >>> klass Point3D(Point2D): pass >>> Point3D.__total__ True

source: This attribute reflects *only* the value of the ``total`` argument to the current ``TypedDict`` class, not whether the class is semantically total. For example, a ``TypedDict`` with ``__total__`` set to ``True`` may have keys marked with :data:`NotRequired`, or it may inherit from another ``TypedDict`` with ``total=False``. Therefore, it is generally better to use :attr:`__required_keys__` and :attr:`__optional_keys__` for introspection.
sv: Detta attribut återspeglar *endast* värdet av argumentet ``total`` till den aktuella ``TypedDict``-klassen, inte om klassen är semantiskt total. Till exempel kan en ``TypedDict`` med ``__total__`` satt till ``True`` ha nycklar markerade med :data:`NotRequired`, eller så kan den ärva från en annan ``TypedDict`` med ``total=False``. Därför är det i allmänhet bättre att använda :attr:`__required_keys__` och :attr:`__optional_keys__` för introspektion.

source: ``Point2D.__required_keys__`` and ``Point2D.__optional_keys__`` return :class:`frozenset` objects containing required and non-required keys, respectively.
sv: ``Point2D.__required_keys__`` och ``Point2D.__optional_keys__`` returnerar :class:`frozenset`-objekt som innehåller obligatoriska respektive icke-obligatoriska nycklar.

source: Keys marked with :data:`Required` will always appear in ``__required_keys__`` and keys marked with :data:`NotRequired` will always appear in ``__optional_keys__``.
sv: Nycklar som är markerade med :data:`Required` kommer alltid att visas i ``__required_keys__`` och nycklar som är markerade med :data:`NotRequired`` kommer alltid att visas i ``__optional_keys__``.

source: For backwards compatibility with Python 3.10 and below, it is also possible to use inheritance to declare both required and non-required keys in the same ``TypedDict`` . This is done by declaring a ``TypedDict`` with one value for the ``total`` argument and then inheriting from it in another ``TypedDict`` with a different value for ``total``:
sv: För bakåtkompatibilitet med Python 3.10 och lägre är det också möjligt att använda arv för att deklarera både obligatoriska och icke-obligatoriska nycklar i samma ``TypedDict``. Detta görs genom att deklarera en ``TypedDict`` med ett värde för argumentet ``total`` och sedan ärva från den i en annan ``TypedDict`` med ett annat värde för ``total``:

source: >>> class Point2D(TypedDict, total=False): ... x: int ... y: int ... >>> class Point3D(Point2D): ... z: int ... >>> Point3D.__required_keys__ == frozenset({'z'}) True >>> Point3D.__optional_keys__ == frozenset({'x', 'y'}) True
sv: >>> class Point2D(TypedDict, total=False): ... x: int ... y: int ... >>> klass Point3D(Point2D): ... z: int ... >>> Point3D.__required_keys__ == frozenset({'z'}) Sant >>> Point3D.__optional_keys__ == frozenset({'x', 'y'}) Sant

source: If ``from __future__ import annotations`` is used or if annotations are given as strings, annotations are not evaluated when the ``TypedDict`` is defined. Therefore, the runtime introspection that ``__required_keys__`` and ``__optional_keys__`` rely on may not work properly, and the values of the attributes may be incorrect.
sv: Om ``from __future__ import annotations`` används eller om annoteringar anges som strängar, utvärderas inte annoteringarna när ``TypedDict`` definieras. Därför kan det hända att den introspektion under körning som ``__required_keys__`` och ``__optional_keys__`` förlitar sig på inte fungerar korrekt, och attributens värden kan vara felaktiga.

source: Support for :data:`ReadOnly` is reflected in the following attributes:
sv: Stöd för :data:`ReadOnly` återspeglas i följande attribut:

source: A :class:`frozenset` containing the names of all read-only keys. Keys are read-only if they carry the :data:`ReadOnly` qualifier.
sv: En :class:`frozenset` som innehåller namnen på alla skrivskyddade nycklar. Nycklar är skrivskyddade om de har :data:`ReadOnly`-kvalificeraren.

source: A :class:`frozenset` containing the names of all mutable keys. Keys are mutable if they do not carry the :data:`ReadOnly` qualifier.
sv: En :class:`frozenset` som innehåller namnen på alla mutabla nycklar. Nycklar är mutabla om de inte har :data:`ReadOnly`-kvalificeraren.

source: See the `TypedDict <https://typing.python.org/en/latest/spec/typeddict.html#typeddict>`_ section in the typing documentation for more examples and detailed rules.
sv: Se avsnittet `TypedDict <https://typing.python.org/en/latest/spec/typeddict.html#typeddict>`_ i typningsdokumentationen för fler exempel och detaljerade regler.

source: Added support for marking individual keys as :data:`Required` or :data:`NotRequired`. See :pep:`655`.
sv: Lagt till stöd för att markera enskilda nycklar som :data:`Required` eller :data:`NotRequired`. Se :pep:`655`.

source: Added support for generic ``TypedDict``\ s.
sv: Lagt till stöd för generiska ``TypedDict``.

source: Removed support for the keyword-argument method of creating ``TypedDict``\ s.
sv: Borttaget stöd för nyckelord-argument-metoden för att skapa ``TypedDict``.

source: Support for the :data:`ReadOnly` qualifier was added.
sv: Stöd för kvalifikatorn :data:`ReadOnly` har lagts till.

source: When using the functional syntax to create a TypedDict class, failing to pass a value to the 'fields' parameter (``TD = TypedDict("TD")``) is deprecated. Passing ``None`` to the 'fields' parameter (``TD = TypedDict("TD", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a TypedDict class with 0 fields, use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})``.
sv: När du använder den funktionella syntaxen för att skapa en TypedDict-klass är det föråldrat att inte skicka ett värde till parametern 'fields' (``TDD = TypedDict("TD")``). Att skicka ``None`` till parametern 'fields' (``TD = TypedDict("TD", None)``) är också föråldrat. Båda kommer att vara otillåtna i Python 3.15. För att skapa en TypedDict-klass med 0 fält, använd ``class TD(TypedDict): pass`` eller ``TD = TypedDict("TD", {})``.

source: Protocols
sv: Protokoll

source: The following protocols are provided by the :mod:`!typing` module. All are decorated with :func:`@runtime_checkable <runtime_checkable>`.
sv: Följande protokoll tillhandahålls av modulen :mod:`!typing`. Alla är dekorerade med :func:`@runtime_checkable <runtime_checkable>`.

source: An ABC with one abstract method ``__abs__`` that is covariant in its return type.
sv: En ABC med en abstrakt metod ``__abs__`` som är kovariant i sin returtyp.

source: An ABC with one abstract method ``__bytes__``.
sv: En ABC med en abstrakt metod ``__bytes__``.

source: An ABC with one abstract method ``__complex__``.
sv: En ABC med en abstrakt metod ``__complex__``.

source: An ABC with one abstract method ``__float__``.
sv: En ABC med en abstrakt metod ``__float__``.

source: An ABC with one abstract method ``__index__``.
sv: En ABC med en abstrakt metod ``__index__``.

source: An ABC with one abstract method ``__int__``.
sv: En ABC med en abstrakt metod ``__int__``.

source: An ABC with one abstract method ``__round__`` that is covariant in its return type.
sv: En ABC med en abstrakt metod ``__round__`` som är kovariant i sin returtyp.

source: ABCs and Protocols for working with I/O
sv: ABC och protokoll för att arbeta med I/O

source: Generic class ``IO[AnyStr]`` and its subclasses ``TextIO(IO[str])`` and ``BinaryIO(IO[bytes])`` represent the types of I/O streams such as returned by :func:`open`. Please note that these classes are not protocols, and their interface is fairly broad.
sv: Den generiska klassen ``IO[AnyStr]`` och dess underklasser ``TextIO(IO[str])`` och ``BinaryIO(IO[bytes])`` representerar de typer av I/O-strömmar som returneras av :func:`open`. Observera att dessa klasser inte är protokoll och att deras gränssnitt är ganska brett.

source: The protocols :class:`io.Reader` and :class:`io.Writer` offer a simpler alternative for argument types, when only the ``read()`` or ``write()`` methods are accessed, respectively::
sv: Protokollen :class:`io.Reader` och :class:`io.Writer` erbjuder ett enklare alternativ för argumenttyper, när endast metoderna ``read()`` respektive ``write()`` används::

source: Also consider using :class:`collections.abc.Iterable` for iterating over the lines of an input stream::
sv: Överväg också att använda :class:`collections.abc.Iterable` för att iterera över raderna i en inmatningsström::

source: def read_config(stream: Iterable[str]): for line in stream: ...
sv: def read_config(stream: Iterable[str]): för rad i ström: ...

source: Functions and decorators
sv: Funktioner och dekoratorer

source: Cast a value to a type.
sv: Kasta ett värde till en typ.

source: This returns the value unchanged. To the type checker this signals that the return value has the designated type, but at runtime we intentionally don't check anything (we want this to be as fast as possible).
sv: Detta returnerar värdet oförändrat. För typkontrollanten signalerar detta att returvärdet har den angivna typen, men vid körning kontrollerar vi avsiktligt ingenting (vi vill att det ska gå så snabbt som möjligt).

source: Ask a static type checker to confirm that *val* has an inferred type of *typ*.
sv: Be en statisk typkontrollör att bekräfta att *val* har en härledd typ av *typ*.

source: At runtime this does nothing: it returns the first argument unchanged with no checks or side effects, no matter the actual type of the argument.
sv: Vid körning gör detta ingenting: det returnerar det första argumentet oförändrat utan kontroller eller sidoeffekter, oavsett argumentets faktiska typ.

source: When a static type checker encounters a call to ``assert_type()``, it emits an error if the value is not of the specified type::
sv: När en statisk typkontrollör stöter på ett anrop till ``assert_type()``, avger den ett fel om värdet inte är av den angivna typen::
