Repository: yeager/python-docs-sv
Catalog: library/typing.po
Languages: sv

source: The only legal parameters for :class:`type` are classes, :data:`Any`, :ref:`type variables <generics>`, and unions of any of these types. For example::
sv: De enda lagliga parametrarna för :class:`type` är klasser, :data:`Any`, :ref:`type variables <generics>` och unioner av någon av dessa typer. Till exempel::

source: def new_non_team_user(user_class: type[BasicUser | ProUser]): ... new_non_team_user(BasicUser) # OK new_non_team_user(ProUser) # OK new_non_team_user(TeamUser) # Error: ``type[TeamUser]`` is not a subtype # of ``type[BasicUser | ProUser]`` new_non_team_user(User) # Also an error
sv: def new_non_team_user(user_class: type[BasicUser | ProUser]): ... new_non_team_user(BasicUser) # OK new_non_team_user(ProUser) # OK new_non_team_user(TeamUser) # Fel: ``type[TeamUser]`` är inte en subtyp # av ``type[BasicUser | ProUser]`` new_non_team_user(User) # Också ett fel

source: ``type[Any]`` is equivalent to :class:`type`, which is the root of Python's :ref:`metaclass hierarchy <metaclasses>`.
sv: ``type[Any]`` är ekvivalent med :class:`type`, som är roten till Pythons :ref:`metaklasshierarki <metaclasses>`.

source: Annotating generators and coroutines
sv: Annotering av generatorer och coroutines

source: A generator can be annotated using the generic type :class:`Generator[YieldType, SendType, ReturnType] <collections.abc.Generator>`. For example::
sv: En generator kan annoteras med hjälp av den generiska typen :class:`Generator[YieldType, SendType, ReturnType] <collections.abc.Generator>`. Till exempel::

source: def echo_round() -> Generator[int, float, str]: sent = yield 0 while sent >= 0: sent = yield round(sent) return 'Done'
sv: def echo_round() -> Generator[int, float, str]: sent = avkastning 0 medan sent >= 0: sent = yield round(sent) return 'Klar'

source: Note that unlike many other generic classes in the standard library, the ``SendType`` of :class:`~collections.abc.Generator` behaves contravariantly, not covariantly or invariantly.
sv: Observera att till skillnad från många andra generiska klasser i standardbiblioteket beter sig ``SendType`` i :class:`~collections.abc.Generator` kontravariant, inte kovariant eller invariant.

source: The ``SendType`` and ``ReturnType`` parameters default to :const:`!None`::
sv: Parametrarna ``SendType`` och ``ReturnType`` är som standard :const:`!None`::

source: def infinite_stream(start: int) -> Generator[int]: while True: yield start start += 1
sv: def infinite_stream(start: int) -> Generator[int]: while True: avkastning start start += 1

source: It is also possible to set these types explicitly::
sv: Det är också möjligt att ange dessa typer explicit::

source: def infinite_stream(start: int) -> Generator[int, None, None]: while True: yield start start += 1
sv: def infinite_stream(start: int) -> Generator[int, None, None]: medan True: avkastning start start += 1

source: Simple generators that only ever yield values can also be annotated as having a return type of either :class:`Iterable[YieldType] <collections.abc.Iterable>` or :class:`Iterator[YieldType] <collections.abc.Iterator>`::
sv: Enkla generatorer som bara ger värden kan också annoteras som att de har en returtyp av antingen :class:`Iterable[YieldType] <collections.abc.Iterable>` eller :class:`Iterator[YieldType] <collections.abc.Iterator>`::

source: def infinite_stream(start: int) -> Iterator[int]: while True: yield start start += 1
sv: def infinite_stream(start: int) -> Iterator[int]: medan True: avkastning start start += 1

source: Async generators are handled in a similar fashion, but don't expect a ``ReturnType`` type argument (:class:`AsyncGenerator[YieldType, SendType] <collections.abc.AsyncGenerator>`). The ``SendType`` argument defaults to :const:`!None`, so the following definitions are equivalent::
sv: Asynkrona generatorer hanteras på ett liknande sätt, men förvänta dig inte ett argument av typen ``ReturnType`` (:class:`AsyncGenerator[YieldType, SendType] <collections.abc.AsyncGenerator>`). Argumentet ``SendType`` är som standard :const:`!None`, så följande definitioner är likvärdiga::

source: async def infinite_stream(start: int) -> AsyncGenerator[int]: while True: yield start start = await increment(start) async def infinite_stream(start: int) -> AsyncGenerator[int, None]: while True: yield start start = await increment(start)
sv: async def infinite_stream(start: int) -> AsyncGenerator[int]: while True: avkastning start start = vänta på inkrement(start) async def infinite_stream(start: int) -> AsyncGenerator[int, None]: while True: avkastning start start = await increment(start)

source: As in the synchronous case, :class:`AsyncIterable[YieldType] <collections.abc.AsyncIterable>` and :class:`AsyncIterator[YieldType] <collections.abc.AsyncIterator>` are available as well::
sv: Precis som i det synkrona fallet är :class:`AsyncIterable[YieldType] <collections.abc.AsyncIterable>` och :class:`AsyncIterator[YieldType] <collections.abc.AsyncIterator>` också tillgängliga::

source: async def infinite_stream(start: int) -> AsyncIterator[int]: while True: yield start start = await increment(start)
sv: async def infinite_stream(start: int) -> AsyncIterator[int]: medan True: avkastning start start = vänta på inkrement(start)

source: Coroutines can be annotated using :class:`Coroutine[YieldType, SendType, ReturnType] <collections.abc.Coroutine>`. Generic arguments correspond to those of :class:`~collections.abc.Generator`, for example::
sv: Coroutines kan annoteras med :class:`Coroutine[YieldType, SendType, ReturnType] <collections.abc.Coroutine>`. Generiska argument motsvarar de i :class:`~collections.abc.Generator`, till exempel::

source: User-defined generic types
sv: Användardefinierade generiska typer

source: A user-defined class can be defined as a generic class.
sv: En användardefinierad klass kan definieras som en generisk klass.

source: from logging import Logger class LoggedVar[T]: def __init__(self, value: T, name: str, logger: Logger) -> None: self.name = name self.logger = logger self.value = value def set(self, new: T) -> None: self.log('Set ' + repr(self.value)) self.value = new def get(self) -> T: self.log('Get ' + repr(self.value)) return self.value def log(self, message: str) -> None: self.logger.info('%s: %s', self.name, message)
sv: from logging import Logger klass LoggedVar[T]: def __init__(self, value: T, name: str, logger: Logger) -> None: self.name = namn self.logger = logger self.value = värde def set(self, new: T) -> None: self.log('Set ' + repr(self.value)) self.värde = nytt def get(self) -> T: self.log('Get ' + repr(self.value)) return self.värde def log(self, message: str) -> None: self.logger.info('%s: %s', self.name, message)

source: This syntax indicates that the class ``LoggedVar`` is parameterised around a single :ref:`type variable <typevar>` ``T`` . This also makes ``T`` valid as a type within the class body.
sv: Denna syntax anger att klassen ``LoggedVar`` är parameteriserad kring en enda :ref:`typvariabel <typevar>``T`` . Detta gör också ``T`` giltig som en typ inom klassens kropp.

source: Generic classes implicitly inherit from :class:`Generic`. For compatibility with Python 3.11 and lower, it is also possible to inherit explicitly from :class:`Generic` to indicate a generic class::
sv: Generiska klasser ärver implicit från :class:`Generic`. För kompatibilitet med Python 3.11 och lägre är det också möjligt att ärva explicit från :class:`Generic` för att ange en generisk klass::

source: from typing import TypeVar, Generic T = TypeVar('T') class LoggedVar(Generic[T]): ...
sv: från typing import TypeVar, Generisk T = TypeVar('T') klass LoggedVar(Generic[T]): ...

source: Generic classes have :meth:`~object.__class_getitem__` methods, meaning they can be parameterised at runtime (e.g. ``LoggedVar[int]`` below)::
sv: Generiska klasser har :meth:`~object.__class_getitem__`-metoder, vilket innebär att de kan parametriseras vid körning (t.ex. ``LoggedVar[int]`` nedan)::

source: from collections.abc import Iterable def zero_all_vars(vars: Iterable[LoggedVar[int]]) -> None: for var in vars: var.set(0)
sv: från collections.abc import Iterable def zero_all_vars(vars: Iterable[LoggedVar[int]]) -> None: för var i vars: var.set(0)

source: A generic type can have any number of type variables. All varieties of :class:`TypeVar` are permissible as parameters for a generic type::
sv: En generisk typ kan ha ett valfritt antal typvariabler. Alla varianter av :class:`TypeVar` är tillåtna som parametrar för en generisk typ::

source: Each type variable argument to :class:`Generic` must be distinct. This is thus invalid::
sv: Varje typvariabelargument till :class:`Generic` måste vara distinkt. Detta är alltså ogiltigt:

source: from typing import TypeVar, Generic ... class Pair[M, M]: # SyntaxError ... T = TypeVar('T') class Pair(Generic[T, T]): # INVALID ...
sv: from typing import TypeVar, Generisk ... klassen Par[M, M]: # Syntaxfel ... T = TypVar('T') klass Par(Generisk[T, T]): # INVALID ...

source: Generic classes can also inherit from other classes::
sv: Generiska klasser kan också ärva från andra klasser::

source: from collections.abc import Sized class LinkedList[T](Sized): ...
sv: från collections.abc import Sized class LinkedList[T](Sized): ...

source: When inheriting from generic classes, some type parameters could be fixed::
sv: När man ärvde från generiska klasser kunde vissa typparametrar fixas::

source: from collections.abc import Mapping class MyDict[T](Mapping[str, T]): ...
sv: från collections.abc import Mapping class MyDict[T](Mapping[str, T]): ...

source: In this case ``MyDict`` has a single parameter, ``T``.
sv: I det här fallet har ``MyDict`` en enda parameter, ``T``.

source: Using a generic class without specifying type parameters assumes :data:`Any` for each position. In the following example, ``MyIterable`` is not generic but implicitly inherits from ``Iterable[Any]``:
sv: Om man använder en generisk klass utan att ange typparametrar antas :data:`Any` för varje position. I följande exempel är ``MyIterable`` inte generisk utan ärver implicit från ``Iterable[Any]``:

source: from collections.abc import Iterable class MyIterable(Iterable): # Same as Iterable[Any] ...
sv: från collections.abc import Iterable klass MyIterable(Iterable): # Samma som Iterable[Any] ...

source: User-defined generic type aliases are also supported. Examples::
sv: Användardefinierade alias för generiska typer stöds också. Exempel::

source: from collections.abc import Iterable type Response[S] = Iterable[S] | int # Return type here is same as Iterable[str] | int def response(query: str) -> Response[str]: ... type Vec[T] = Iterable[tuple[T, T]] def inproduct[T: (int, float, complex)](v: Vec[T]) -> T: # Same as Iterable[tuple[T, T]] return sum(x*y for x, y in v)
sv: från collections.abc import Iterable type Response[S] = Iterable[S] | int # Returtypen här är samma som Iterable[str] | int def response(query: str) -> Response[str]: ... type Vec[T] = Iterabel[tuple[T, T]] def inproduct[T: (int, float, complex)](v: Vec[T]) -> T: # Samma som Iterable[tuple[T, T]] return sum(x*y för x, y i v)

source: For backward compatibility, generic type aliases can also be created through a simple assignment::
sv: För bakåtkompatibilitet kan generiska typaliaser också skapas genom en enkel tilldelning::

source: :class:`Generic` no longer has a custom metaclass.
sv: :class:`Generic` har inte längre någon egen metaklass.

source: Syntactic support for generics and type aliases is new in version 3.12. Previously, generic classes had to explicitly inherit from :class:`Generic` or contain a type variable in one of their bases.
sv: Syntaktiskt stöd för generiska klasser och typalias är nytt i version 3.12. Tidigare var generiska klasser tvungna att uttryckligen ärva från :class:`Generic` eller innehålla en typvariabel i en av sina baser.

source: User-defined generics for parameter expressions are also supported via parameter specification variables in the form ``[**P]``. The behavior is consistent with type variables' described above as parameter specification variables are treated by the :mod:`!typing` module as a specialized type variable. The one exception to this is that a list of types can be used to substitute a :class:`ParamSpec`::
sv: Användardefinierad generik för parameteruttryck stöds också via parameterspecifikationsvariabler i formen ``[**P]``. Beteendet överensstämmer med typvariabler som beskrivs ovan eftersom parameterspecifikationsvariabler behandlas av modulen :mod:`!typing` som en specialiserad typvariabel. Det enda undantaget från detta är att en lista med typer kan användas för att ersätta en :class:`ParamSpec`::

source: >>> class Z[T, **P]: ... # T is a TypeVar; P is a ParamSpec ... >>> Z[int, [dict, float]] __main__.Z[int, [dict, float]]
sv: >>> klass Z[T, **P]: ... # T är en TypeVar; P är en ParamSpec ... >>> Z[int, [dict, float]] __main__.Z[int, [dict, float]]

source: Classes generic over a :class:`ParamSpec` can also be created using explicit inheritance from :class:`Generic`. In this case, ``**`` is not used::
sv: Klasser som är generiska över en :class:`ParamSpec` kan också skapas med hjälp av explicit arv från :class:`Generic`. I detta fall används inte ``**``:

source: from typing import ParamSpec, Generic P = ParamSpec('P') class Z(Generic[P]): ...
sv: from typing import ParamSpec, Generisk P = ParamSpec('P') klass Z(Generisk[P]): ...

source: Another difference between :class:`TypeVar` and :class:`ParamSpec` is that a generic with only one parameter specification variable will accept parameter lists in the forms ``X[[Type1, Type2, ...]]`` and also ``X[Type1, Type2, ...]`` for aesthetic reasons. Internally, the latter is converted to the former, so the following are equivalent::
sv: En annan skillnad mellan :class:`TypeVar` och :class:`ParamSpec` är att en generik med endast en parameterspecifikationsvariabel kommer att acceptera parameterlistor i formerna ``X[[Type1, Type2, ...]]`` och även ``X[Type1, Type2, ...]`` av estetiska skäl. Internt konverteras den senare till den förra, så följande är likvärdiga::

source: >>> class X[**P]: ... ... >>> X[int, str] __main__.X[[int, str]] >>> X[[int, str]] __main__.X[[int, str]]
sv: >>> klass X[**P]: ... ... >>> X[int, str] __main__.X[[int, str]] >>> X[[int, str]] >>> X[[int, str]] __main__.X[[int, str]] >>> X[[int, str]]

source: Note that generics with :class:`ParamSpec` may not have correct ``__parameters__`` after substitution in some cases because they are intended primarily for static type checking.
sv: Observera att generiker med :class:`ParamSpec` kanske inte har korrekta ``__parametrar__`` efter substitution i vissa fall eftersom de främst är avsedda för statisk typkontroll.

source: :class:`Generic` can now be parameterized over parameter expressions. See :class:`ParamSpec` and :pep:`612` for more details.
sv: :class:`Generic` kan nu parametriseras över parameteruttryck. Se :class:`ParamSpec` och :pep:`612` för mer information.

source: A user-defined generic class can have ABCs as base classes without a metaclass conflict. Generic metaclasses are not supported. The outcome of parameterizing generics is cached, and most types in the :mod:`!typing` module are :term:`hashable` and comparable for equality.
sv: En användardefinierad generisk klass kan ha ABC som basklasser utan att det uppstår en metaklasskonflikt. Generiska metaklasser stöds inte. Resultatet av parametrisering av generiska klasser cachas och de flesta typer i modulen :mod:`!typing` är :term:`hashable` och jämförbara med avseende på likhet.

source: The :data:`Any` type
sv: :data:`Vilken typ som helst

source: A special kind of type is :data:`Any`. A static type checker will treat every type as being compatible with :data:`Any` and :data:`Any` as being compatible with every type.
sv: En speciell typ av typ är :data:`Any`. En statisk typkontroll kommer att behandla varje typ som kompatibel med :data:`Any` och :data:`Any` som kompatibel med varje typ.

source: This means that it is possible to perform any operation or method call on a value of type :data:`Any` and assign it to any variable::
sv: Detta innebär att det är möjligt att utföra valfri operation eller metodanrop på ett värde av typen :data:`Any` och tilldela det till valfri variabel::

source: from typing import Any a: Any = None a = [] # OK a = 2 # OK s: str = '' s = a # OK def foo(item: Any) -> int: # Passes type checking; 'item' could be any type, # and that type might have a 'bar' method item.bar() ...
sv: från typing import Any a: Vilken som helst = Ingen a = [] # OK a = 2 # OK s: str = '' s = a # OK def foo(objekt: valfritt) -> int: # Klarar typkontroll; 'item' kan vara vilken typ som helst, # och den typen kan ha en "bar"-metod item.bar() ...

source: Notice that no type checking is performed when assigning a value of type :data:`Any` to a more precise type. For example, the static type checker did not report an error when assigning ``a`` to ``s`` even though ``s`` was declared to be of type :class:`str` and receives an :class:`int` value at runtime!
sv: Observera att ingen typkontroll utförs när ett värde av typen :data:`Any` tilldelas till en mer exakt typ. Till exempel rapporterade den statiska typkontrollen inte ett fel när ``a`` tilldelades ``s`` trots att ``s`` deklarerades vara av typen :class:`str` och får ett värde av typen :class:`int` vid körning!

source: Furthermore, all functions without a return type or parameter types will implicitly default to using :data:`Any`::
sv: Dessutom kommer alla funktioner utan returtyp eller parametertyper att implicit använda :data:`Any`::

source: def legacy_parser(text): ... return data # A static type checker will treat the above # as having the same signature as: def legacy_parser(text: Any) -> Any: ... return data
sv: def legacy_parser(text): ... returnera data # En statisk typkontroll kommer att behandla ovanstående # som att den har samma signatur som: def legacy_parser(text: Any) -> Any: ... returnerar data

source: This behavior allows :data:`Any` to be used as an *escape hatch* when you need to mix dynamically and statically typed code.
sv: Detta beteende gör att :data:`Any` kan användas som en *escape-lucka* när du behöver blanda dynamiskt och statiskt typad kod.

source: Contrast the behavior of :data:`Any` with the behavior of :class:`object`. Similar to :data:`Any`, every type is a subtype of :class:`object`. However, unlike :data:`Any`, the reverse is not true: :class:`object` is *not* a subtype of every other type.
sv: Kontrastera beteendet hos :data:`Any` med beteendet hos :class:`object`. I likhet med :data:`Any` är varje typ en subtyp av :class:`object`. Men till skillnad från :data:`Any` är det omvända inte sant: :class:`object` är *inte* en subtyp av alla andra typer.

source: That means when the type of a value is :class:`object`, a type checker will reject almost all operations on it, and assigning it to a variable (or using it as a return value) of a more specialized type is a type error. For example::
sv: Det innebär att när typen av ett värde är :class:`object`, kommer en typkontroll att avvisa nästan alla operationer på det, och att tilldela det till en variabel (eller använda det som ett returvärde) av en mer specialiserad typ är ett typfel. Till exempel::

source: def hash_a(item: object) -> int: # Fails type checking; an object does not have a 'magic' method. item.magic() ... def hash_b(item: Any) -> int: # Passes type checking item.magic() ... # Passes type checking, since ints and strs are subclasses of object hash_a(42) hash_a("foo") # Passes type checking, since Any is compatible with all types hash_b(42) hash_b("foo")
sv: def hash_a(item: objekt) -> int: # Misslyckas med typkontroll; ett objekt har inte en "magic"-metod. objekt.magic() ... def hash_b(item: valfritt) -> int: # Klarar typkontroll item.magic() ... # Klarar typkontroll, eftersom ints och strs är subklasser av objekt hash_a(42) hash_a("foo") # Klarar typkontroll, eftersom Any är kompatibel med alla typer hash_b(42) hash_b("foo")

source: Use :class:`object` to indicate that a value could be any type in a typesafe manner. Use :data:`Any` to indicate that a value is dynamically typed.
sv: Använd :class:`object` för att ange att ett värde kan vara av vilken typ som helst på ett typsäkert sätt. Använd :data:`Any` för att ange att ett värde är dynamiskt typat.

source: Nominal vs structural subtyping
sv: Nominell kontra strukturell subtypning

source: Initially :pep:`484` defined the Python static type system as using *nominal subtyping*. This means that a class ``A`` is allowed where a class ``B`` is expected if and only if ``A`` is a subclass of ``B``.
sv: Ursprungligen definierade :pep:`484` Pythons statiska typsystem som att det använder *nominal subtyping*. Detta innebär att en klass ``A`` är tillåten där en klass ``B`` förväntas om och endast om ``A`` är en subklass av ``B``.

source: This requirement previously also applied to abstract base classes, such as :class:`~collections.abc.Iterable`. The problem with this approach is that a class had to be explicitly marked to support them, which is unpythonic and unlike what one would normally do in idiomatic dynamically typed Python code. For example, this conforms to :pep:`484`::
sv: Detta krav gällde tidigare även för abstrakta basklasser, såsom :class:`~collections.abc.Iterable`. Problemet med detta tillvägagångssätt är att en klass måste markeras explicit för att stödja dem, vilket är opytoniskt och olikt vad man normalt skulle göra i idiomatisk dynamiskt typad Python-kod. Till exempel överensstämmer detta med :pep:`484`::

source: :pep:`544` allows to solve this problem by allowing users to write the above code without explicit base classes in the class definition, allowing ``Bucket`` to be implicitly considered a subtype of both ``Sized`` and ``Iterable[int]`` by static type checkers. This is known as *structural subtyping* (or static duck-typing)::
sv: :pep:`544` löser detta problem genom att tillåta användare att skriva ovanstående kod utan explicita basklasser i klassdefinitionen, vilket gör att ``Bucket`` implicit kan betraktas som en subtyp av både ``Sized`` och ``Iterable[int]`` av statiska typkontroller. Detta är känt som *strukturell subtypning* (eller statisk duck-typning)::

source: from collections.abc import Iterator, Iterable class Bucket: # Note: no base classes ... def __len__(self) -> int: ... def __iter__(self) -> Iterator[int]: ... def collect(items: Iterable[int]) -> int: ... result = collect(Bucket()) # Passes type check
sv: från collections.abc import Iterator, Iterable klassen Bucket: # Obs: inga basklasser ... def __len__(self) -> int: ... def __iter__(self) -> Iterator[int]: ... def collect(items: Iterable[int]) -> int: ... result = collect(Bucket()) # Klarar typkontroll

source: Moreover, by subclassing a special class :class:`Protocol`, a user can define new custom protocols to fully enjoy structural subtyping (see examples below).
sv: Genom att subklassa en speciell klass :class:`Protocol` kan en användare dessutom definiera nya anpassade protokoll för att fullt ut utnyttja strukturell subtypning (se exempel nedan).

source: Module contents
sv: Modulens innehåll

source: The ``typing`` module defines the following classes, functions and decorators.
sv: Modulen ``typing`` definierar följande klasser, funktioner och dekoratorer.

source: Special typing primitives
sv: Särskilda typningsprimitiver

source: Special types
sv: Särskilda typer

source: These can be used as types in annotations. They do not support subscription using ``[]``.
sv: Dessa kan användas som typer i annoteringar. De stöder inte prenumeration med hjälp av ``[]``.

source: Special type indicating an unconstrained type.
sv: Särskild typ som anger en obegränsad typ.
