Repository: yeager/python-docs-sv
Catalog: library/unittest.mock.po
Languages: sv

source: MagicMock and magic method support
sv: Stöd för MagicMock och magiska metoder

source: Mocking Magic Methods
sv: Mocking av magiska metoder

source: :class:`Mock` supports mocking the Python protocol methods, also known as :term:`"magic methods" <magic method>`. This allows mock objects to replace containers or other objects that implement Python protocols.
sv: :class:`Mock` stöder mocking av Python-protokollets metoder, även kända som :term:`"magic methods" <magic method>`. Detta gör att mock-objekt kan ersätta containers eller andra objekt som implementerar Python-protokoll.

source: Because magic methods are looked up differently from normal methods [#]_, this support has been specially implemented. This means that only specific magic methods are supported. The supported list includes *almost* all of them. If there are any missing that you need please let us know.
sv: Eftersom magiska metoder slås upp på ett annat sätt än vanliga metoder [#]_ har detta stöd implementerats på ett speciellt sätt. Detta innebär att endast specifika magiska metoder stöds. Listan över metoder som stöds innehåller *nästan* alla. Om det är någon som saknas som du behöver, vänligen meddela oss.

source: You mock magic methods by setting the method you are interested in to a function or a mock instance. If you are using a function then it *must* take ``self`` as the first argument [#]_.
sv: Du mockar magiska metoder genom att ställa in den metod du är intresserad av till en funktion eller en mock-instans. Om du använder en funktion så *måste* den ta ``self`` som första argument [#]_.

source: One use case for this is for mocking objects used as context managers in a :keyword:`with` statement:
sv: Ett användningsfall för detta är för mocking-objekt som används som kontexthanterare i en :keyword:`with`-sats:

source: Calls to magic methods do not appear in :attr:`~Mock.method_calls`, but they are recorded in :attr:`~Mock.mock_calls`.
sv: Anrop till magiska metoder visas inte i :attr:`~Mock.method_calls`, men de registreras i :attr:`~Mock.mock_calls`.

source: If you use the *spec* keyword argument to create a mock then attempting to set a magic method that isn't in the spec will raise an :exc:`AttributeError`.
sv: Om du använder nyckelordsargumentet *spec* för att skapa en mock kommer försök att ställa in en magisk metod som inte finns i specifikationen att ge upphov till ett :exc:`AttributeError`.

source: The full list of supported magic methods is:
sv: Den fullständiga listan över magiska metoder som stöds är:

source: ``__hash__``, ``__sizeof__``, ``__repr__`` and ``__str__``
sv: ``__hash__``, ``__sizeof__``, ``__repr__`` och ``str__``

source: ``__dir__``, ``__format__`` and ``__subclasses__``
sv: ``__dir__``, ``__format__`` och ``__subklasser__``

source: ``__round__``, ``__floor__``, ``__trunc__`` and ``__ceil__``
sv: "rund", "golv", "trunk" och "tak

source: Comparisons: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` and ``__ne__``
sv: Jämförelser: ``__lt__``, ``__gt__``, ``__le__``, ``ge__``, ``eq__`` och ``ne__``

source: Container methods: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` and ``__missing__``
sv: Container-metoder: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` och ``__missing__``

source: Context manager: ``__enter__``, ``__exit__``, ``__aenter__`` and ``__aexit__``
sv: Kontexthanterare: ``__enter__``, ``__exit__``, ``__aenter__`` och ``__aexit__``

source: Unary numeric methods: ``__neg__``, ``__pos__`` and ``__invert__``
sv: Unära numeriska metoder: ``__neg__``, ``__pos__`` och ``__invert__``

source: The numeric methods (including right hand and in-place variants): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__``, and ``__pow__``
sv: De numeriska metoderna (inklusive högerhands- och in-place-varianter): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``or__`` och ``__pow__``

source: Numeric conversion methods: ``__complex__``, ``__int__``, ``__float__`` and ``__index__``
sv: Numeriska omvandlingsmetoder: ``__complex__``, ``__int__``, ``__float__`` och ``__index__``

source: Descriptor methods: ``__get__``, ``__set__`` and ``__delete__``
sv: Deskriptormetoder: ``__get__``, ``__set__`` och ``__delete__``

source: Pickling: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
sv: Betning: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``getnewargs__``, ``getstate__`` och ``setstate__``

source: File system path representation: ``__fspath__``
sv: Representation av filsystemets sökväg: ``__fspath__``

source: Asynchronous iteration methods: ``__aiter__`` and ``__anext__``
sv: Asynkrona iterationsmetoder: ``__aiter__`` och ``__anext__``

source: Added support for :func:`os.PathLike.__fspath__`.
sv: Lagt till stöd för :func:`os.PathLike.__fspath__`.

source: Added support for ``__aenter__``, ``__aexit__``, ``__aiter__`` and ``__anext__``.
sv: Lagt till stöd för ``__aenter__``, ``__aexit__``, ``__aiter__`` och ``__anext__``.

source: The following methods exist but are *not* supported as they are either in use by mock, can't be set dynamically, or can cause problems:
sv: Följande metoder finns men stöds *inte* eftersom de antingen används av mock, inte kan ställas in dynamiskt eller kan orsaka problem:

source: ``__getattr__``, ``__setattr__``, ``__init__`` and ``__new__``
sv: ``__getattr__``, ``__setattr__``, ``__init__`` och ``new__``

source: There are two ``MagicMock`` variants: :class:`MagicMock` and :class:`NonCallableMagicMock`.
sv: Det finns två varianter av ``MagicMock``: :class:`MagicMock` och :class:`NonCallableMagicMock`.

source: ``MagicMock`` is a subclass of :class:`Mock` with default implementations of most of the :term:`magic methods <magic method>`. You can use ``MagicMock`` without having to configure the magic methods yourself.
sv: ``MagicMock`` är en subklass av :class:`Mock` med standardimplementationer av de flesta av :term:`magiska metoder <magic method>`. Du kan använda ``MagicMock`` utan att behöva konfigurera de magiska metoderna själv.

source: The constructor parameters have the same meaning as for :class:`Mock`.
sv: Parametrarna för konstruktören har samma betydelse som för :class:`Mock`.

source: If you use the *spec* or *spec_set* arguments then *only* magic methods that exist in the spec will be created.
sv: Om du använder argumenten *spec* eller *spec_set* kommer *endast* magiska metoder som finns i specifikationen att skapas.

source: A non-callable version of :class:`MagicMock`.
sv: En icke anropsbar version av :class:`MagicMock`.

source: The constructor parameters have the same meaning as for :class:`MagicMock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
sv: Parametrarna i konstruktorn har samma betydelse som för :class:`MagicMock`, med undantag för *return_value* och *side_effect* som inte har någon betydelse för en icke anropsbar mock.

source: The magic methods are setup with :class:`MagicMock` objects, so you can configure them and use them in the usual way:
sv: De magiska metoderna konfigureras med :class:`MagicMock`-objekt, så att du kan konfigurera dem och använda dem på vanligt sätt:

source: By default many of the protocol methods are required to return objects of a specific type. These methods are preconfigured with a default return value, so that they can be used without you having to do anything if you aren't interested in the return value. You can still *set* the return value manually if you want to change the default.
sv: Som standard krävs att många av protokollets metoder returnerar objekt av en viss typ. Dessa metoder är förkonfigurerade med ett standardreturvärde, så att de kan användas utan att du behöver göra något om du inte är intresserad av returvärdet. Du kan fortfarande *ställa* in returvärdet manuellt om du vill ändra standardvärdet.

source: Methods and their defaults:
sv: Metoder och deras standardvärden:

source: ``__lt__``: :data:`NotImplemented`
sv: ``__lt__``: :data:`Inte genomförd`

source: ``__complex__``: ``1j``
sv: ``__komplex__``: ``1j``

source: ``__hash__``: default hash for the mock
sv: ``__hash__``: standardhash för mock

source: ``__str__``: default str for the mock
sv: ``__str__``: standardstr för mock

source: ``__sizeof__``: default sizeof for the mock
sv: ``__sizeof__``: standardstorlek för mock

source: For example:
sv: Till exempel:

source: The two equality methods, :meth:`!__eq__` and :meth:`!__ne__`, are special. They do the default equality comparison on identity, using the :attr:`~Mock.side_effect` attribute, unless you change their return value to return something else::
sv: De två metoderna för likhet, :meth:`!__eq__` och :meth:`!__ne__`, är speciella. De gör standardjämförelsen av likhet på identitet, med hjälp av attributet :attr:`~Mock.side_effect`, om du inte ändrar deras returvärde till att returnera något annat::

source: >>> MagicMock() == 3 False >>> MagicMock() != 3 True >>> mock = MagicMock() >>> mock.__eq__.return_value = True >>> mock == 3 True
sv: >>> MagicMock() == 3 Falsk >>> MagicMock() != 3 Sant >>> mock = MagicMock() >>> mock.__eq__.return_value = True >>> mock == 3 True

source: The return value of :meth:`MagicMock.__iter__` can be any iterable object and isn't required to be an iterator:
sv: Returvärdet för :meth:`MagicMock.__iter__` kan vara vilket iterabelt objekt som helst och behöver inte vara en iterator:

source: If the return value *is* an iterator, then iterating over it once will consume it and subsequent iterations will result in an empty list:
sv: Om returvärdet *är* en iterator kommer den att förbrukas om man itererar över den en gång, och efterföljande iterationer kommer att resultera i en tom lista:

source: ``MagicMock`` has all of the supported magic methods configured except for some of the obscure and obsolete ones. You can still set these up if you want.
sv: ``MagicMock`` har alla magiska metoder som stöds konfigurerade förutom några av de obskyra och föråldrade. Du kan fortfarande ställa in dessa om du vill.

source: Magic methods that are supported but not setup by default in ``MagicMock`` are:
sv: Magiska metoder som stöds men inte konfigureras som standard i ``MagicMock`` är:

source: ``__subclasses__``
sv: ``__underklasser__``

source: ``__get__``, ``__set__`` and ``__delete__``
sv: ``__get__``, ``__set__`` och ``__delete__``

source: ``__reversed__`` and ``__missing__``
sv: ``__omvända__`` och ``__ saknas__``

source: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
sv: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``getnewargs__``, ``getstate__`` och ``setstate__``

source: Magic methods *should* be looked up on the class rather than the instance. Different versions of Python are inconsistent about applying this rule. The supported protocol methods should work with all supported versions of Python.
sv: Magiska metoder *bör* slås upp på klassen snarare än på instansen. Olika versioner av Python är inkonsekventa när det gäller att tillämpa denna regel. De protokollmetoder som stöds bör fungera med alla versioner av Python som stöds.

source: The function is basically hooked up to the class, but each ``Mock`` instance is kept isolated from the others.
sv: Funktionen är i princip kopplad till klassen, men varje ``Mock``-instans hålls isolerad från de andra.

source: Helpers
sv: Hjälpmedel

source: sentinel
sv: vaktpost

source: The ``sentinel`` object provides a convenient way of providing unique objects for your tests.
sv: Objektet ``sentinel`` ger ett bekvämt sätt att tillhandahålla unika objekt för dina tester.

source: Attributes are created on demand when you access them by name. Accessing the same attribute will always return the same object. The objects returned have a sensible repr so that test failure messages are readable.
sv: Attribut skapas på begäran när du använder deras namn. Om man använder samma attribut returneras alltid samma objekt. De objekt som returneras har en vettig repr så att meddelanden om testfel är läsbara.

source: The ``sentinel`` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`.
sv: Attributen ``sentinel`` behåller nu sin identitet när de är :mod:`copied <copy>` eller :mod:`pickled <pickle>`.

source: Sometimes when testing you need to test that a specific object is passed as an argument to another method, or returned. It can be common to create named sentinel objects to test this. :data:`sentinel` provides a convenient way of creating and testing the identity of objects like this.
sv: Ibland när man testar behöver man testa att ett specifikt objekt skickas som ett argument till en annan metod, eller returneras. Det kan vara vanligt att skapa namngivna sentinel-objekt för att testa detta. :data:`sentinel` ger ett bekvämt sätt att skapa och testa identiteten hos objekt som detta.

source: In this example we monkey patch ``method`` to return ``sentinel.some_object``:
sv: I det här exemplet apar vi ``method`` så att den returnerar ```sentinel.some_object``:

source: DEFAULT
sv: STANDARD

source: The :data:`DEFAULT` object is a pre-created sentinel (actually ``sentinel.DEFAULT``). It can be used by :attr:`~Mock.side_effect` functions to indicate that the normal return value should be used.
sv: Objektet :data:`DEFAULT` är en förskapad sentinel (egentligen ``sentinel.DEFAULT``). Det kan användas av :attr:`~Mock.side_effect` funktioner för att indikera att det normala returvärdet skall användas.

source: call
sv: ring upp

source: :func:`call` is a helper object for making simpler assertions, for comparing with :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` and :attr:`~Mock.method_calls`. :func:`call` can also be used with :meth:`~Mock.assert_has_calls`.
sv: :func:`call` är ett hjälpobjekt för att göra enklare påståenden, för jämförelse med :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` och :attr:`~Mock.method_calls`. :func:`call` kan också användas med :meth:`~Mock.assert_has_calls`.

source: For a call object that represents multiple calls, :meth:`call_list` returns a list of all the intermediate calls as well as the final call.
sv: För ett anropsobjekt som representerar flera anrop returnerar :meth:`call_list` en lista över alla mellanliggande anrop samt det slutliga anropet.

source: ``call_list`` is particularly useful for making assertions on "chained calls". A chained call is multiple calls on a single line of code. This results in multiple entries in :attr:`~Mock.mock_calls` on a mock. Manually constructing the sequence of calls can be tedious.
sv: ``call_list`` är särskilt användbart för att göra påståenden om "kedjeanrop". Ett kedjeanrop är flera anrop på en enda kodrad. Detta resulterar i flera poster i :attr:`~Mock.mock_calls` på en mock. Att manuellt konstruera sekvensen av anrop kan vara tråkigt.

source: :meth:`~call.call_list` can construct the sequence of calls from the same chained call:
sv: :meth:`~call.call_list` kan konstruera en sekvens av anrop från samma kedjeanrop:

source: A ``call`` object is either a tuple of (positional args, keyword args) or (name, positional args, keyword args) depending on how it was constructed. When you construct them yourself this isn't particularly interesting, but the ``call`` objects that are in the :attr:`Mock.call_args`, :attr:`Mock.call_args_list` and :attr:`Mock.mock_calls` attributes can be introspected to get at the individual arguments they contain.
sv: Ett ``call``-objekt är antingen en tupel av (positional args, keyword args) eller (name, positional args, keyword args) beroende på hur det konstruerades. När du konstruerar dem själv är detta inte särskilt intressant, men de ``call``-objekt som finns i attributen :attr:`Mock.call_args`, :attr:`Mock.call_args_list` och :attr:`Mock.mock_calls` kan introspekteras för att komma åt de enskilda argument de innehåller.

source: The ``call`` objects in :attr:`Mock.call_args` and :attr:`Mock.call_args_list` are two-tuples of (positional args, keyword args) whereas the ``call`` objects in :attr:`Mock.mock_calls`, along with ones you construct yourself, are three-tuples of (name, positional args, keyword args).
sv: Objekten ``call`` i :attr:`Mock.call_args`` och :attr:`Mock.call_args_list`` är tvådubbletter av (positional args, keyword args) medan objekten ``call`` i :attr:`Mock.mock_calls``, tillsammans med dem du konstruerar själv, är tredubbletter av (name, positional args, keyword args).

source: You can use their "tupleness" to pull out the individual arguments for more complex introspection and assertions. The positional arguments are a tuple (an empty tuple if there are no positional arguments) and the keyword arguments are a dictionary:
sv: Du kan använda deras "tupleness" för att dra ut de enskilda argumenten för mer komplex introspektion och påståenden. De positionella argumenten är en tupel (en tom tupel om det inte finns några positionella argument) och nyckelordsargumenten är en ordbok:

source: create_autospec
sv: skapa_autospec

source: Create a mock object using another object as a spec. Attributes on the mock will use the corresponding attribute on the *spec* object as their spec.
sv: Skapa ett mock-objekt som använder ett annat objekt som spec. Attribut på mock-objektet kommer att använda motsvarande attribut på *spec*-objektet som sin spec.

source: Functions or methods being mocked will have their arguments checked to ensure that they are called with the correct signature.
sv: Funktioner eller metoder som hånas kommer att få sina argument kontrollerade för att säkerställa att de anropas med rätt signatur.

source: If *spec_set* is ``True`` then attempting to set attributes that don't exist on the spec object will raise an :exc:`AttributeError`.
sv: Om *spec_set* är ``True`` kommer försök att ange attribut som inte finns på spec-objektet att ge upphov till ett :exc:`AttributeError`.

source: If a class is used as a spec then the return value of the mock (the instance of the class) will have the same spec. You can use a class as the spec for an instance object by passing ``instance=True``. The returned mock will only be callable if instances of the mock are callable.
sv: Om en klass används som specifikation kommer returvärdet för mocken (instansen av klassen) att ha samma specifikation. Du kan använda en klass som specifikation för ett instansobjekt genom att ange ``instance=True``. Den returnerade mocken kommer endast att vara anropsbar om instanser av mocken är anropsbara.

source: :func:`create_autospec` also takes arbitrary keyword arguments that are passed to the constructor of the created mock.
sv: :func:`create_autospec` tar också godtyckliga nyckelordsargument som skickas till konstruktören för den skapade attrappen.

source: See :ref:`auto-speccing` for examples of how to use auto-speccing with :func:`create_autospec` and the *autospec* argument to :func:`patch`.
sv: Se :ref:`auto-speccing` för exempel på hur man använder auto-speccing med :func:`create_autospec` och *autospec*-argumentet till :func:`patch`.

source: :func:`create_autospec` now returns an :class:`AsyncMock` if the target is an async function.
sv: :func:`create_autospec` returnerar nu en :class:`AsyncMock` om målet är en asynkron funktion.

source: ANY
sv: ALLA

source: Sometimes you may need to make assertions about *some* of the arguments in a call to mock, but either not care about some of the arguments or want to pull them individually out of :attr:`~Mock.call_args` and make more complex assertions on them.
sv: Ibland kan du behöva göra påståenden om *några* av argumenten i ett anrop till mock, men antingen inte bry dig om några av argumenten eller vilja dra ut dem individuellt ur :attr:`~Mock.call_args` och göra mer komplexa påståenden om dem.

source: To ignore certain arguments you can pass in objects that compare equal to *everything*. Calls to :meth:`~Mock.assert_called_with` and :meth:`~Mock.assert_called_once_with` will then succeed no matter what was passed in.
sv: För att ignorera vissa argument kan du skicka in objekt som jämför lika med *allt*. Anrop till :meth:`~Mock.assert_called_with` och :meth:`~Mock.assert_called_once_with` kommer då att lyckas oavsett vad som skickades in.

source: :data:`ANY` can also be used in comparisons with call lists like :attr:`~Mock.mock_calls`:
sv: :data:`ANY` kan också användas i jämförelser med anropslistor som :attr:`~Mock.mock_calls`:

source: :data:`ANY` is not limited to comparisons with call objects and so can also be used in test assertions::
sv: :data:`ANY` är inte begränsad till jämförelser med anropsobjekt och kan därför också användas i testassertions::

source: class TestStringMethods(unittest.TestCase): def test_split(self): s = 'hello world' self.assertEqual(s.split(), ['hello', ANY])
sv: klass TestStringMethods(unittest.TestCase): def test_split(self): s = 'hej världen' self.assertEqual(s.split(), ['hello', ANY])

source: :data:`FILTER_DIR` is a module level variable that controls the way mock objects respond to :func:`dir`. The default is ``True``, which uses the filtering described below, to only show useful members. If you dislike this filtering, or need to switch it off for diagnostic purposes, then set ``mock.FILTER_DIR = False``.
sv: :data:`FILTER_DIR` är en variabel på modulnivå som styr hur låtsasobjekt svarar på :func:`dir`. Standardvärdet är ``True``, som använder filtreringen som beskrivs nedan, för att bara visa användbara medlemmar. Om du inte gillar denna filtrering, eller behöver stänga av den för diagnostiska ändamål, ställ då in ``mock.FILTER_DIR = False``.

source: With filtering on, ``dir(some_mock)`` shows only useful attributes and will include any dynamically created attributes that wouldn't normally be shown. If the mock was created with a *spec* (or *autospec* of course) then all the attributes from the original are shown, even if they haven't been accessed yet:
sv: Med filtrering aktiverad visar ``dir(some_mock)`` endast användbara attribut och inkluderar alla dynamiskt skapade attribut som normalt inte skulle visas. Om låtsasobjektet skapades med en *spec* (eller *autospec* förstås) visas alla attribut från originalet, även om de inte har använts ännu:

source: >>> dir(Mock()) ['assert_any_call', 'assert_called', 'assert_called_once', 'assert_called_once_with', 'assert_called_with', 'assert_has_calls', 'assert_not_called', 'attach_mock', ... >>> from urllib import request >>> dir(Mock(spec=request)) ['AbstractBasicAuthHandler', 'AbstractDigestAuthHandler', 'AbstractHTTPHandler', 'BaseHandler', ...
sv: >>> dir(Mock()) ['assert_any_call', 'assert_called', 'assert_called_once', 'assert_called_once' 'assert_called_once_with', 'assert_called_once_with' "assert_called_with", "assert_called_with "assert_has_calls", "assert_not_called", "assert_not_called", "attach_mock", ... >>> från urllib import request >>> dir(Mock(spec=request)) ['AbstractBasicAuthHandler', 'AbstractDigestAuthHandler', 'AbstractHTTPHandler', 'BaseHandler', ...
