Repository: yeager/python-docs-sv
Catalog: library/unittest.mock-examples.po
Languages: sv

source: As an alternative ``patch``, ``patch.object`` and ``patch.dict`` can be used as class decorators. When used in this way it is the same as applying the decorator individually to every method whose name starts with "test".
sv: Som ett alternativ kan ``patch``, ``patch.object`` och ``patch.dict`` användas som klassdekoratorer. När de används på det här sättet är det samma sak som att tillämpa dekoratorn individuellt på varje metod vars namn börjar med "test".

source: Further Examples
sv: Ytterligare exempel

source: Here are some more examples for some slightly more advanced scenarios.
sv: Här är några fler exempel på lite mer avancerade scenarier.

source: Mocking chained calls
sv: Mocking av kedjade anrop

source: Mocking chained calls is actually straightforward with mock once you understand the :attr:`~Mock.return_value` attribute. When a mock is called for the first time, or you fetch its ``return_value`` before it has been called, a new :class:`Mock` is created.
sv: Att mocka kedjeanrop är faktiskt enkelt med mock när man väl förstår attributet :attr:`~Mock.return_value`. När en mock anropas för första gången, eller om du hämtar dess ``return_value`` innan den har anropats, skapas en ny :class:`Mock`.

source: This means that you can see how the object returned from a call to a mocked object has been used by interrogating the ``return_value`` mock:
sv: Detta innebär att du kan se hur objektet som returneras från ett anrop till ett mockat objekt har använts genom att fråga ut mocken ``return_value``:

source: From here it is a simple step to configure and then make assertions about chained calls. Of course another alternative is writing your code in a more testable way in the first place...
sv: Härifrån är det ett enkelt steg att konfigurera och sedan göra påståenden om kedjeanrop. Ett annat alternativ är förstås att skriva sin kod på ett mer testbart sätt från början...

source: So, suppose we have some code that looks a little bit like this:
sv: Anta att vi har en kod som ser ut ungefär så här:

source: Assuming that ``BackendProvider`` is already well tested, how do we test ``method()``? Specifically, we want to test that the code section ``# more code`` uses the response object in the correct way.
sv: Om vi antar att ``BackendProvider`` redan är väl testad, hur testar vi då ``method()``? Specifikt vill vi testa att kodavsnittet ``# more code`` använder svarsobjektet på rätt sätt.

source: As this chain of calls is made from an instance attribute we can monkey patch the ``backend`` attribute on a ``Something`` instance. In this particular case we are only interested in the return value from the final call to ``start_call`` so we don't have much configuration to do. Let's assume the object it returns is 'file-like', so we'll ensure that our response object uses the builtin :func:`open` as its ``spec``.
sv: Eftersom denna kedja av anrop görs från ett instansattribut kan vi ap-patcha attributet ``backend`` på en ``Something``-instans. I detta speciella fall är vi bara intresserade av returvärdet från det sista anropet till ``start_call`` så vi har inte mycket konfiguration att göra. Låt oss anta att objektet som returneras är "filliknande", så vi kommer att se till att vårt svarsobjekt använder den inbyggda :func:`open` som dess ``spec``.

source: To do this we create a mock instance as our mock backend and create a mock response object for it. To set the response as the return value for that final ``start_call`` we could do this::
sv: För att göra detta skapar vi en mock-instans som vår mock-backend och skapar ett mock-svarsobjekt för det. För att ställa in svaret som returvärde för det slutliga ``start_call`` kan vi göra så här::

source: We can do that in a slightly nicer way using the :meth:`~Mock.configure_mock` method to directly set the return value for us::
sv: Vi kan göra det på ett lite trevligare sätt genom att använda metoden :meth:`~Mock.configure_mock` för att direkt ställa in returvärdet åt oss::

source: >>> something = Something() >>> mock_response = Mock(spec=open) >>> mock_backend = Mock() >>> config = {'get_endpoint.return_value.create_call.return_value.start_call.return_value': mock_response} >>> mock_backend.configure_mock(**config)
sv: >>> något = Något() >>> mock_response = Mock(spec=open) >>> mock_backend = Mock() >>> config = {'get_endpoint.return_value.create_call.return_value.start_call.return_value': mock_response} >>> mock_backend.configure_mock(**config)

source: With these we monkey patch the "mock backend" in place and can make the real call::
sv: Med dessa kan vi sätta upp "mock backend" på plats och göra det riktiga anropet::

source: >>> something.backend = mock_backend >>> something.method()
sv: >>> något.backend = mock_backend >>> något.metod()

source: Using :attr:`~Mock.mock_calls` we can check the chained call with a single assert. A chained call is several calls in one line of code, so there will be several entries in ``mock_calls``. We can use :meth:`call.call_list` to create this list of calls for us::
sv: Med hjälp av :attr:`~Mock.mock_calls` kan vi kontrollera det kedjade anropet med ett enda assert. Ett kedjeanrop är flera anrop i en kodrad, så det kommer att finnas flera poster i ``mock_calls``. Vi kan använda :meth:`call.call_list` för att skapa denna lista över anrop åt oss::

source: >>> chained = call.get_endpoint('foobar').create_call('spam', 'eggs').start_call() >>> call_list = chained.call_list() >>> assert mock_backend.mock_calls == call_list
sv: >>> chained = call.get_endpoint('foobar').create_call('spam', 'eggs').start_call() >>> anrop_lista = kedjad.anrop_lista() >>> assert mock_backend.mock_calls == call_list

source: Partial mocking
sv: Delvis mocking

source: In some tests I wanted to mock out a call to :meth:`datetime.date.today` to return a known date, but I didn't want to prevent the code under test from creating new date objects. Unfortunately :class:`datetime.date` is written in C, and so I couldn't just monkey-patch out the static :meth:`datetime.date.today` method.
sv: I vissa tester ville jag mocka ut ett anrop till :meth:`datetime.date.today` för att returnera ett känt datum, men jag ville inte hindra koden under test från att skapa nya datumobjekt. Tyvärr är :class:`datetime.date` skriven i C, och därför kunde jag inte bara monkey-patcha ut den statiska :meth:`datetime.date.today`-metoden.

source: I found a simple way of doing this that involved effectively wrapping the date class with a mock, but passing through calls to the constructor to the real class (and returning real instances).
sv: Jag hittade ett enkelt sätt att göra detta som innebar att effektivt linda in datumklassen med en mock, men passera genom anrop till konstruktören till den riktiga klassen (och returnera riktiga instanser).

source: The :func:`patch decorator <patch>` is used here to mock out the ``date`` class in the module under test. The :attr:`~Mock.side_effect` attribute on the mock date class is then set to a lambda function that returns a real date. When the mock date class is called a real date will be constructed and returned by ``side_effect``. ::
sv: Här används :func:`patch decorator <patch>` för att mocka ut klassen ``date`` i den modul som testas. Attributet :attr:`~Mock.side_effect` på mock date-klassen sätts sedan till en lambda-funktion som returnerar ett riktigt datum. När mock date-klassen anropas kommer ett verkligt datum att konstrueras och returneras av ``side_effect``. ::

source: Note that we don't patch :class:`datetime.date` globally, we patch ``date`` in the module that *uses* it. See :ref:`where to patch <where-to-patch>`.
sv: Observera att vi inte patchar :class:`datetime.date` globalt, vi patchar ``date`` i modulen som *använder* den. Se :ref:`var man patchar <where-to-patch>`.

source: When ``date.today()`` is called a known date is returned, but calls to the ``date(...)`` constructor still return normal dates. Without this you can find yourself having to calculate an expected result using exactly the same algorithm as the code under test, which is a classic testing anti-pattern.
sv: När ``date.today()`` anropas returneras ett känt datum, men anrop till ``date(...)``-konstruktorn returnerar fortfarande normala datum. Utan detta kan det hända att du måste beräkna ett förväntat resultat med exakt samma algoritm som den kod som testas, vilket är ett klassiskt anti-mönster för testning.

source: Calls to the date constructor are recorded in the ``mock_date`` attributes (``call_count`` and friends) which may also be useful for your tests.
sv: Anrop till datumkonstruktören registreras i ``mock_date``-attributen (``call_count`` och vänner), vilket också kan vara användbart för dina tester.

source: An alternative way of dealing with mocking dates, or other builtin classes, is discussed in `this blog entry <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking-and-patching/>`_.
sv: Ett alternativt sätt att hantera mocking dates, eller andra inbyggda klasser, diskuteras i `det här blogginlägget <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking-and-patching/>`_.

source: Mocking a Generator Method
sv: Mocka en generatormetod

source: A Python generator is a function or method that uses the :keyword:`yield` statement to return a series of values when iterated over [#]_.
sv: En Python-generator är en funktion eller metod som använder :keyword:`yield`-satsen för att returnera en serie värden när den itereras över [#]_.

source: A generator method / function is called to return the generator object. It is the generator object that is then iterated over. The protocol method for iteration is :meth:`~container.__iter__`, so we can mock this using a :class:`MagicMock`.
sv: En generatormetod/funktion anropas för att returnera generatorobjektet. Det är generatorobjektet som sedan itereras över. Protokollmetoden för iteration är :meth:`~container.__iter__`, så vi kan mocka detta med hjälp av en :class:`MagicMock`.

source: Here's an example class with an "iter" method implemented as a generator:
sv: Här är en exempelklass med en "iter"-metod som implementerats som en generator:

source: How would we mock this class, and in particular its "iter" method?
sv: Hur skulle vi mocka den här klassen, och i synnerhet dess "iter"-metod?

source: To configure the values returned from the iteration (implicit in the call to :class:`list`), we need to configure the object returned by the call to ``foo.iter()``.
sv: För att konfigurera de värden som returneras från iterationen (implicit i anropet till :class:`list`) måste vi konfigurera det objekt som returneras av anropet till ``foo.iter()``.

source: There are also generator expressions and more `advanced uses <http://www.dabeaz.com/coroutines/index.html>`_ of generators, but we aren't concerned about them here. A very good introduction to generators and how powerful they are is: `Generator Tricks for Systems Programmers <http://www.dabeaz.com/generators/>`_.
sv: Det finns också generatoruttryck och mer "avancerade användningar" <http://www.dabeaz.com/coroutines/index.html>`_ av generatorer, men det är inget vi ska ägna oss åt här. En mycket bra introduktion till generatorer och hur kraftfulla de är finns i: `Generator Tricks for Systems Programmers <http://www.dabeaz.com/generators/>`_.

source: Applying the same patch to every test method
sv: Tillämpa samma patch på alla testmetoder

source: If you want several patches in place for multiple test methods the obvious way is to apply the patch decorators to every method. This can feel like unnecessary repetition. Instead, you can use :func:`patch` (in all its various forms) as a class decorator. This applies the patches to all test methods on the class. A test method is identified by methods whose names start with ``test``::
sv: Om du vill ha flera patchar på plats för flera testmetoder är det uppenbara sättet att tillämpa patchdekoratorerna på varje metod. Detta kan kännas som en onödig upprepning. Istället kan du använda :func:`patch` (i alla dess olika former) som en klassdekorator. Detta applicerar patcharna på alla testmetoder i klassen. En testmetod identifieras av metoder vars namn börjar med ``test``::

source: >>> @patch('mymodule.SomeClass') ... class MyTest(unittest.TestCase): ... ... def test_one(self, MockSomeClass): ... self.assertIs(mymodule.SomeClass, MockSomeClass) ... ... def test_two(self, MockSomeClass): ... self.assertIs(mymodule.SomeClass, MockSomeClass) ... ... def not_a_test(self): ... return 'something' ... >>> MyTest('test_one').test_one() >>> MyTest('test_two').test_two() >>> MyTest('test_two').not_a_test() 'something'
sv: >>> @patch('mymodule.SomeClass') ... class MyTest(unittest.TestCase): ... ... def test_one(self, MockSomeClass): ... self.assertIs(mymodule.SomeClass, MockSomeClass) ... ... def test_two(self, MockSomeClass): ... self.assertIs(mymodule.SomeClass, MockSomeClass) ... ... def not_a_test(self): ... return 'något' ... >>> MyTest('test_one').test_one() >>> MyTest('test_two').test_two() >>> MyTest('test_two').not_a_test() 'något'

source: An alternative way of managing patches is to use the :ref:`start-and-stop`. These allow you to move the patching into your ``setUp`` and ``tearDown`` methods. ::
sv: Ett alternativt sätt att hantera patchar är att använda :ref:`start-and-stop`. Dessa gör att du kan flytta patchningen till dina metoder ``setUp`` och ``tearDown``. ::

source: >>> class MyTest(unittest.TestCase): ... def setUp(self): ... self.patcher = patch('mymodule.foo') ... self.mock_foo = self.patcher.start() ... ... def test_foo(self): ... self.assertIs(mymodule.foo, self.mock_foo) ... ... def tearDown(self): ... self.patcher.stop() ... >>> MyTest('test_foo').run()
sv: >>> klass MyTest(unittest.TestCase): ... def setUp(self): ... self.patcher = patch('mymodule.foo') ... self.mock_foo = self.patcher.start() ... ... def test_foo(self): ... self.assertIs(mymodule.foo, self.mock_foo) ... ... def tearDown(self): ... self.patcher.stop() ... >>> MyTest('test_foo').run()

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the setUp then tearDown is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
sv: Om du använder den här tekniken måste du se till att patchningen "ångras" genom att anropa ``stop``. Det här kan vara krångligare än man tror, för om ett undantag uppstår i setUp så anropas inte tearDown. :meth:`unittest.TestCase.addCleanup` gör det här enklare::

source: >>> class MyTest(unittest.TestCase): ... def setUp(self): ... patcher = patch('mymodule.foo') ... self.addCleanup(patcher.stop) ... self.mock_foo = patcher.start() ... ... def test_foo(self): ... self.assertIs(mymodule.foo, self.mock_foo) ... >>> MyTest('test_foo').run()
sv: >>> klass MyTest(unittest.TestCase): ... def setUp(self): ... patcher = patch('mymodule.foo') ... self.addCleanup(patcher.stop) ... self.mock_foo = patcher.start() ... ... def test_foo(self): ... self.assertIs(mymodule.foo, self.mock_foo) ... >>> MyTest('test_foo').run()

source: Mocking Unbound Methods
sv: Spottning av obundna metoder

source: Whilst writing tests today I needed to patch an *unbound method* (patching the method on the class rather than on the instance). I needed self to be passed in as the first argument because I want to make asserts about which objects were calling this particular method. The issue is that you can't patch with a mock for this, because if you replace an unbound method with a mock it doesn't become a bound method when fetched from the instance, and so it doesn't get self passed in. The workaround is to patch the unbound method with a real function instead. The :func:`patch` decorator makes it so simple to patch out methods with a mock that having to create a real function becomes a nuisance.
sv: När jag skrev tester idag behövde jag patcha en *obunden metod* (patcha metoden på klassen snarare än på instansen). Jag behövde self som första argument eftersom jag vill göra asserts om vilka objekt som anropar just den här metoden. Problemet är att du inte kan patcha med en mock för detta, för om du ersätter en obunden metod med en mock blir den inte en bunden metod när den hämtas från instansen, och därför får den inte self passerat in. Lösningen är att patcha den obundna metoden med en riktig funktion istället. Dekoratorn :func:`patch` gör det så enkelt att patcha ut metoder med en mock att det blir ett irritationsmoment att behöva skapa en riktig funktion.

source: If you pass ``autospec=True`` to patch then it does the patching with a *real* function object. This function object has the same signature as the one it is replacing, but delegates to a mock under the hood. You still get your mock auto-created in exactly the same way as before. What it means though, is that if you use it to patch out an unbound method on a class the mocked function will be turned into a bound method if it is fetched from an instance. It will have ``self`` passed in as the first argument, which is exactly what I wanted:
sv: Om du skickar ``autospec=True`` till patch så gör den patchningen med ett *verkligt* funktionsobjekt. Detta funktionsobjekt har samma signatur som det som det ersätter, men delegerar till en mock under huven. Du får fortfarande din mock automatiskt skapad på exakt samma sätt som tidigare. Vad det innebär är dock att om du använder den för att lappa ut en obunden metod på en klass kommer den mockade funktionen att förvandlas till en bunden metod om den hämtas från en instans. Det kommer att ha ``self`` passerat in som det första argumentet, vilket är precis vad jag ville ha:

source: If we don't use ``autospec=True`` then the unbound method is patched out with a Mock instance instead, and isn't called with ``self``.
sv: Om vi inte använder ``autospec=True`` så patchas den obundna metoden ut med en Mock-instans istället, och anropas inte med ``self``.

source: Checking multiple calls with mock
sv: Kontroll av flera anrop med mock

source: mock has a nice API for making assertions about how your mock objects are used.
sv: mock har ett bra API för att göra påståenden om hur dina mock-objekt används.

source: If your mock is only being called once you can use the :meth:`~Mock.assert_called_once_with` method that also asserts that the :attr:`~Mock.call_count` is one.
sv: Om din mock bara anropas en gång kan du använda metoden :meth:`~Mock.assert_called_once_with` som också försäkrar att :attr:`~Mock.call_count` är ett.

source: Both ``assert_called_with`` and ``assert_called_once_with`` make assertions about the *most recent* call. If your mock is going to be called several times, and you want to make assertions about *all* those calls you can use :attr:`~Mock.call_args_list`:
sv: Både ``assert_called_with`` och ``assert_called_once_with`` gör påståenden om det *senaste* anropet. Om din mock kommer att anropas flera gånger och du vill göra påståenden om *alla* dessa anrop kan du använda :attr:`~Mock.call_args_list`:

source: The :data:`call` helper makes it easy to make assertions about these calls. You can build up a list of expected calls and compare it to ``call_args_list``. This looks remarkably similar to the repr of the ``call_args_list``:
sv: Med hjälpmedlet :data:`call` är det enkelt att göra påståenden om dessa anrop. Du kan bygga upp en lista över förväntade anrop och jämföra den med ``call_args_list``. Detta ser anmärkningsvärt likt ut som repr av ``call_args_list``:

source: Coping with mutable arguments
sv: Att hantera föränderliga argument

source: Another situation is rare, but can bite you, is when your mock is called with mutable arguments. ``call_args`` and ``call_args_list`` store *references* to the arguments. If the arguments are mutated by the code under test then you can no longer make assertions about what the values were when the mock was called.
sv: En annan situation är sällsynt, men kan bita dig, är när din mock anropas med mutabla argument. ``call_args`` och ``call_args_list`` lagrar *referenser* till argumenten. Om argumenten muteras av koden som testas kan du inte längre göra påståenden om vad värdena var när mocken anropades.

source: Here's some example code that shows the problem. Imagine the following functions defined in 'mymodule'::
sv: Här är lite exempelkod som visar problemet. Föreställ dig följande funktioner definierade i 'mymodule'::

source: def frob(val): pass def grob(val): "First frob and then clear val" frob(val) val.clear()
sv: def frob(val): pass def grob(val): "Först frob och sedan clear val" frob(val) val.clear()

source: When we try to test that ``grob`` calls ``frob`` with the correct argument look what happens::
sv: När vi försöker testa att ``grob`` anropar ``frob`` med rätt argument, se vad som händer::

source: >>> with patch('mymodule.frob') as mock_frob: ... val = {6} ... mymodule.grob(val) ... >>> val set() >>> mock_frob.assert_called_with({6}) Traceback (most recent call last): ... AssertionError: Expected: (({6},), {}) Called with: ((set(),), {})
sv: >>> med patch('mymodule.frob') som mock_frob: ... val = {6} ... mymodule.grob(val) ... >>> val set() >>> mock_frob.assert_called_with({6}) Traceback (senaste anropet senast): ... AssertionError: Förväntat: (({6},)), {}) Anropades med: ((set(),), {})

source: One possibility would be for mock to copy the arguments you pass in. This could then cause problems if you do assertions that rely on object identity for equality.
sv: En möjlighet skulle kunna vara att mock kopierar de argument du skickar in. Detta skulle då kunna orsaka problem om du gör påståenden som förlitar sig på objektidentitet för jämlikhet.

source: Here's one solution that uses the :attr:`~Mock.side_effect` functionality. If you provide a ``side_effect`` function for a mock then ``side_effect`` will be called with the same args as the mock. This gives us an opportunity to copy the arguments and store them for later assertions. In this example I'm using *another* mock to store the arguments so that I can use the mock methods for doing the assertion. Again a helper function sets this up for me. ::
sv: Här är en lösning som använder :attr:`~Mock.side_effect`-funktionaliteten. Om du tillhandahåller en ``side_effect``-funktion för en mock så kommer ``side_effect`` att anropas med samma args som mocken. Detta ger oss en möjlighet att kopiera argumenten och lagra dem för senare påståenden. I det här exemplet använder jag *en annan* mock för att lagra argumenten så att jag kan använda mock-metoderna för att göra påståendet. Återigen ställer en hjälpfunktion in detta åt mig ::

source: ``copy_call_args`` is called with the mock that will be called. It returns a new mock that we do the assertion on. The ``side_effect`` function makes a copy of the args and calls our ``new_mock`` with the copy.
sv: ``copy_call_args`` anropas med den mock som kommer att anropas. Den returnerar en ny mock som vi gör assertionen på. Funktionen ``side_effect`` gör en kopia av args och anropar vår ``new_mock`` med kopian.

source: If your mock is only going to be used once there is an easier way of checking arguments at the point they are called. You can simply do the checking inside a ``side_effect`` function.
sv: Om din mock bara ska användas en gång finns det ett enklare sätt att kontrollera argumenten vid den punkt de anropas. Du kan helt enkelt göra kontrollen inuti en ``side_effect``-funktion.
