Repository: yeager/python-docs-sv
Catalog: library/unittest.mock-examples.po
Languages: sv

source: :mod:`!unittest.mock` --- getting started
sv: :mod:`!unittest.mock` --- komma igång

source: Using Mock
sv: Använda Mock

source: Mock Patching Methods
sv: Mock Patching-metoder

source: Common uses for :class:`Mock` objects include:
sv: Vanliga användningsområden för :class:`Mock`-objekt inkluderar:

source: Patching methods
sv: Patching-metoder

source: Recording method calls on objects
sv: Inspelning av metodanrop på objekt

source: You might want to replace a method on an object to check that it is called with the correct arguments by another part of the system:
sv: Du kanske vill ersätta en metod på ett objekt för att kontrollera att den anropas med rätt argument av en annan del av systemet:

source: Once our mock has been used (``real.method`` in this example) it has methods and attributes that allow you to make assertions about how it has been used.
sv: När vår mock har använts (``real.method`` i det här exemplet) har den metoder och attribut som gör att du kan göra påståenden om hur den har använts.

source: In most of these examples the :class:`Mock` and :class:`MagicMock` classes are interchangeable. As the ``MagicMock`` is the more capable class it makes a sensible one to use by default.
sv: I de flesta av dessa exempel är klasserna :class:`Mock` och :class:`MagicMock` utbytbara. Eftersom ``MagicMock`` är den mer kapabla klassen är det förnuftigt att använda den som standard.

source: Once the mock has been called its :attr:`~Mock.called` attribute is set to ``True``. More importantly we can use the :meth:`~Mock.assert_called_with` or :meth:`~Mock.assert_called_once_with` method to check that it was called with the correct arguments.
sv: När mocken har anropats sätts dess attribut :attr:`~Mock.called` till ``True``. Ännu viktigare är att vi kan använda metoden :meth:`~Mock.assert_called_with` eller :meth:`~Mock.assert_called_once_with` för att kontrollera att den anropades med rätt argument.

source: This example tests that calling ``ProductionClass().method`` results in a call to the ``something`` method:
sv: Detta exempel testar att ett anrop till ``ProductionClass().method`` resulterar i ett anrop till metoden ``something``:

source: Mock for Method Calls on an Object
sv: Mock för metodanrop på ett objekt

source: In the last example we patched a method directly on an object to check that it was called correctly. Another common use case is to pass an object into a method (or some part of the system under test) and then check that it is used in the correct way.
sv: I det förra exemplet patchade vi en metod direkt på ett objekt för att kontrollera att den anropades korrekt. Ett annat vanligt användningsfall är att skicka ett objekt till en metod (eller någon del av systemet som testas) och sedan kontrollera att det används på rätt sätt.

source: The simple ``ProductionClass`` below has a ``closer`` method. If it is called with an object then it calls ``close`` on it.
sv: Den enkla ``ProductionClass`` nedan har en ``closer`` metod. Om den anropas med ett objekt så anropar den ``close`` på det.

source: So to test it we need to pass in an object with a ``close`` method and check that it was called correctly.
sv: Så för att testa det måste vi skicka in ett objekt med en ``close``-metod och kontrollera att den anropades korrekt.

source: We don't have to do any work to provide the 'close' method on our mock. Accessing close creates it. So, if 'close' hasn't already been called then accessing it in the test will create it, but :meth:`~Mock.assert_called_with` will raise a failure exception.
sv: Vi behöver inte göra något arbete för att tillhandahålla metoden "close" på vår mock. Åtkomst till close skapar den. Så om 'close' inte redan har anropats kommer åtkomst till den i testet att skapa den, men :meth:`~Mock.assert_called_with` kommer att ge upphov till ett felaktigt undantag.

source: Mocking Classes
sv: Mocking av klasser

source: A common use case is to mock out classes instantiated by your code under test. When you patch a class, then that class is replaced with a mock. Instances are created by *calling the class*. This means you access the "mock instance" by looking at the return value of the mocked class.
sv: Ett vanligt användningsfall är att mocka ut klasser som instansieras av din kod som testas. När du patchar en klass ersätts den klassen med en mock. Instanser skapas genom att *anropa klassen*. Detta innebär att du kommer åt "mock-instansen" genom att titta på returvärdet för den mockade klassen.

source: In the example below we have a function ``some_function`` that instantiates ``Foo`` and calls a method on it. The call to :func:`patch` replaces the class ``Foo`` with a mock. The ``Foo`` instance is the result of calling the mock, so it is configured by modifying the mock :attr:`~Mock.return_value`. ::
sv: I exemplet nedan har vi en funktion ``some_function`` som instansierar ``Foo`` och anropar en metod på den. Anropet till :func:`patch` ersätter klassen ``Foo`` med en mock. Instansen ``Foo`` är resultatet av anropet av mocken, så den konfigureras genom att modifiera mock :attr:`~Mock.return_value`. ::

source: >>> def some_function(): ... instance = module.Foo() ... return instance.method() ... >>> with patch('module.Foo') as mock: ... instance = mock.return_value ... instance.method.return_value = 'the result' ... result = some_function() ... assert result == 'the result'
sv: >>> def någon_funktion(): ... instans = modul.Foo() ... return instans.metod() ... >>> med patch('module.Foo') som mock: ... instans = mock.return_value ... instance.method.return_value = 'resultatet' ... resultat = någon_funktion() ... assert resultat == 'resultatet'

source: Naming your mocks
sv: Namnge dina mockar

source: It can be useful to give your mocks a name. The name is shown in the repr of the mock and can be helpful when the mock appears in test failure messages. The name is also propagated to attributes or methods of the mock:
sv: Det kan vara bra att ge dina mockar ett namn. Namnet visas i mockens repr och kan vara till hjälp när mocken visas i felmeddelanden i tester. Namnet sprids också till attribut eller metoder i mocken:

source: Tracking all Calls
sv: Spåra alla samtal

source: Often you want to track more than a single call to a method. The :attr:`~Mock.mock_calls` attribute records all calls to child attributes of the mock - and also to their children.
sv: Ofta vill man spåra mer än ett enda anrop till en metod. Attributet :attr:`~Mock.mock_calls` registrerar alla anrop till barnattribut till mock - och även till deras barn.

source: If you make an assertion about ``mock_calls`` and any unexpected methods have been called, then the assertion will fail. This is useful because as well as asserting that the calls you expected have been made, you are also checking that they were made in the right order and with no additional calls:
sv: Om du gör ett påstående om ``mock_calls`` och några oväntade metoder har anropats, så kommer påståendet att misslyckas. Detta är användbart eftersom du inte bara hävdar att de anrop du förväntade dig har gjorts, du kontrollerar också att de gjordes i rätt ordning och utan ytterligare anrop:

source: You use the :data:`call` object to construct lists for comparing with ``mock_calls``:
sv: Du använder objektet :data:`call` för att konstruera listor som kan jämföras med ``mock_calls``:

source: However, parameters to calls that return mocks are not recorded, which means it is not possible to track nested calls where the parameters used to create ancestors are important:
sv: Parametrar till anrop som returnerar mocks registreras dock inte, vilket innebär att det inte är möjligt att spåra nästlade anrop där de parametrar som används för att skapa ancestors är viktiga:

source: Setting Return Values and Attributes
sv: Ange returvärden och attribut

source: Setting the return values on a mock object is trivially easy:
sv: Att ställa in returvärdena på ett mock-objekt är trivialt enkelt:

source: Of course you can do the same for methods on the mock:
sv: Naturligtvis kan du göra samma sak för metoder på mock:

source: The return value can also be set in the constructor:
sv: Returvärdet kan också ställas in i konstruktören:

source: If you need an attribute setting on your mock, just do it:
sv: Om du behöver en attributinställning på din mock är det bara att göra det:

source: Sometimes you want to mock up a more complex situation, like for example ``mock.connection.cursor().execute("SELECT 1")``. If we wanted this call to return a list, then we have to configure the result of the nested call.
sv: Ibland vill man simulera en mer komplex situation, som till exempel ``mock.connection.cursor().execute("SELECT 1")``. Om vi vill att det här anropet ska returnera en lista måste vi konfigurera resultatet av det nästlade anropet.

source: We can use :data:`call` to construct the set of calls in a "chained call" like this for easy assertion afterwards:
sv: Vi kan använda :data:`call` för att konstruera uppsättningen anrop i ett "kedjeanrop" som detta för att enkelt kunna hävda det i efterhand:

source: It is the call to ``.call_list()`` that turns our call object into a list of calls representing the chained calls.
sv: Det är anropet till ``.call_list()`` som förvandlar vårt anropsobjekt till en lista med anrop som representerar de kedjade anropen.

source: Raising exceptions with mocks
sv: Utlösande av undantag med mocks

source: A useful attribute is :attr:`~Mock.side_effect`. If you set this to an exception class or instance then the exception will be raised when the mock is called.
sv: Ett användbart attribut är :attr:`~Mock.side_effect`. Om du anger detta till en undantagsklass eller -instans kommer undantaget att uppstå när mocken anropas.

source: Side effect functions and iterables
sv: Bieffektsfunktioner och iterabler

source: ``side_effect`` can also be set to a function or an iterable. The use case for ``side_effect`` as an iterable is where your mock is going to be called several times, and you want each call to return a different value. When you set ``side_effect`` to an iterable every call to the mock returns the next value from the iterable:
sv: ``side_effect`` kan också ställas in på en funktion eller en iterabel. Användningsfallet för ``side_effect`` som en iterabel är när din mock kommer att anropas flera gånger och du vill att varje anrop ska returnera ett annat värde. När du ställer in ``side_effect`` till en iterabel returnerar varje anrop till mocken nästa värde från iterabeln:

source: For more advanced use cases, like dynamically varying the return values depending on what the mock is called with, ``side_effect`` can be a function. The function will be called with the same arguments as the mock. Whatever the function returns is what the call returns:
sv: För mer avancerade användningsfall, som att dynamiskt variera returvärdena beroende på vad mocken anropas med, kan ``side_effect`` vara en funktion. Funktionen kommer att anropas med samma argument som mock. Det som funktionen returnerar är det som anropet returnerar:

source: Mocking asynchronous iterators
sv: Mocka asynkrona iteratorer

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-iterators` through ``__aiter__``. The :attr:`~Mock.return_value` attribute of ``__aiter__`` can be used to set the return values to be used for iteration.
sv: Sedan Python 3.8 har ``AsyncMock`` och ``MagicMock`` stöd för att mocka :ref:`async-iterators` genom ``__aiter__``. Attributet :attr:`~Mock.return_value` för ``__aiter__`` kan användas för att ställa in de returvärden som ska användas för iteration.

source: Mocking asynchronous context manager
sv: Mocka asynkron kontexthanterare

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-context-managers` through ``__aenter__`` and ``__aexit__``. By default, ``__aenter__`` and ``__aexit__`` are ``AsyncMock`` instances that return an async function.
sv: Sedan Python 3.8 har ``AsyncMock`` och ``MagicMock`` stöd för att mocka :ref:`async-context-managers` genom ``__aenter__`` och ``__aexit__``. Som standard är ``__aenter__`` och ``__aexit__`` ``AsyncMock`` instanser som returnerar en asynkron funktion.

source: Creating a Mock from an Existing Object
sv: Skapa en mock från ett befintligt objekt

source: One problem with over use of mocking is that it couples your tests to the implementation of your mocks rather than your real code. Suppose you have a class that implements ``some_method``. In a test for another class, you provide a mock of this object that *also* provides ``some_method``. If later you refactor the first class, so that it no longer has ``some_method`` - then your tests will continue to pass even though your code is now broken!
sv: Ett problem med överdriven användning av mocking är att det kopplar dina tester till implementeringen av dina mocks snarare än din riktiga kod. Anta att du har en klass som implementerar ``en viss metod``. I ett test för en annan klass tillhandahåller du en mock av detta objekt som *också* tillhandahåller ``en_metod``. Om du senare refaktoriserar den första klassen, så att den inte längre har ``some_method`` - då kommer dina tester att fortsätta att godkännas trots att din kod nu är trasig!

source: :class:`Mock` allows you to provide an object as a specification for the mock, using the *spec* keyword argument. Accessing methods / attributes on the mock that don't exist on your specification object will immediately raise an attribute error. If you change the implementation of your specification, then tests that use that class will start failing immediately without you having to instantiate the class in those tests.
sv: :class:`Mock` låter dig tillhandahålla ett objekt som en specifikation för mocken, med hjälp av nyckelordsargumentet *spec*. Åtkomst till metoder/attribut på mock som inte finns på ditt specifikationsobjekt kommer omedelbart att ge upphov till ett attributfel. Om du ändrar implementeringen av din specifikation kommer tester som använder den klassen att börja misslyckas omedelbart utan att du behöver instansiera klassen i dessa tester.

source: Using a specification also enables a smarter matching of calls made to the mock, regardless of whether some parameters were passed as positional or named arguments::
sv: Att använda en specifikation möjliggör också en smartare matchning av anrop som görs till mock, oavsett om vissa parametrar skickades som positionella eller namngivna argument:

source: >>> def f(a, b, c): pass ... >>> mock = Mock(spec=f) >>> mock(1, 2, 3) <Mock name='mock()' id='140161580456576'> >>> mock.assert_called_with(a=1, b=2, c=3)
sv: &gt;&gt;&gt; def f(a, b, c): pass ... &gt;&gt;&gt; mock = Mock(spec=f) &gt;&gt;&gt; mock(1, 2, 3) <Mock name='mock()' id='140161580456576'> &gt;&gt;&gt; mock.assert_called_with(a=1, b=2, c=3)

source: If you want this smarter matching to also work with method calls on the mock, you can use :ref:`auto-speccing <auto-speccing>`.
sv: Om du vill att denna smartare matchning även ska fungera med metodanrop på mocken kan du använda :ref:`auto-speccing <auto-speccing>`.

source: If you want a stronger form of specification that prevents the setting of arbitrary attributes as well as the getting of them then you can use *spec_set* instead of *spec*.
sv: Om du vill ha en starkare form av specifikation som förhindrar att godtyckliga attribut ställs in och att de hämtas, kan du använda *spec_set* i stället för *spec*.

source: Using side_effect to return per file content
sv: Använda side_effect för att returnera innehåll per fil

source: :func:`mock_open` is used to patch :func:`open` method. :attr:`~Mock.side_effect` can be used to return a new Mock object per call. This can be used to return different contents per file stored in a dictionary::
sv: :func:`mock_open` används för att patcha :func:`open` metoden. :attr:`~Mock.side_effect` kan användas för att returnera ett nytt Mock-objekt per anrop. Detta kan användas för att returnera olika innehåll per fil som lagras i en ordbok::

source: DEFAULT = "default" data_dict = {"file1": "data1", "file2": "data2"} def open_side_effect(name): return mock_open(read_data=data_dict.get(name, DEFAULT))() with patch("builtins.open", side_effect=open_side_effect): with open("file1") as file1: assert file1.read() == "data1" with open("file2") as file2: assert file2.read() == "data2" with open("file3") as file2: assert file2.read() == "default"
sv: DEFAULT = "standard" data_dict = {"file1": "data1", "fil2": "data2"} def open_side_effect(namn): return mock_open(read_data=data_dict.get(name, DEFAULT))() med patch("builtins.open", side_effect=open_side_effect): med open("file1") som file1: assert file1.read() == "data1" med open("file2") som fil2: assert file2.read() == "data2" med open("file3") som fil2: assert file2.read() == "default"

source: Patch Decorators
sv: Patch Dekoratörer

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
sv: Med :func:`patch` är det viktigt att du patchar objekt i den namnrymd där de söks upp. Detta är normalt enkelt, men för en snabb guide läs :ref:``where to patch <where-to-patch>``.

source: A common need in tests is to patch a class attribute or a module attribute, for example patching a builtin or patching a class in a module to test that it is instantiated. Modules and classes are effectively global, so patching on them has to be undone after the test or the patch will persist into other tests and cause hard to diagnose problems.
sv: Ett vanligt behov i tester är att patcha ett klassattribut eller ett modulattribut, t.ex. att patcha en builtin eller att patcha en klass i en modul för att testa att den instansieras. Moduler och klasser är i praktiken globala, så patchning av dem måste göras ogjord efter testet, annars kommer patchen att finnas kvar i andra tester och orsaka problem som är svåra att diagnostisera.

source: mock provides three convenient decorators for this: :func:`patch`, :func:`patch.object` and :func:`patch.dict`. ``patch`` takes a single string, of the form ``package.module.Class.attribute`` to specify the attribute you are patching. It also optionally takes a value that you want the attribute (or class or whatever) to be replaced with. 'patch.object' takes an object and the name of the attribute you would like patched, plus optionally the value to patch it with.
sv: mock tillhandahåller tre praktiska dekoratorer för detta: :func:`patch`, :func:`patch.object` och :func:`patch.dict`. ``patch`` tar en enda sträng, av formen ``package.module.Class.attribute`` för att ange det attribut du patchar. Det tar också valfritt ett värde som du vill att attributet (eller klassen eller vad som helst) ska ersättas med. 'patch.object' tar ett objekt och namnet på det attribut som du vill patcha, plus eventuellt det värde som du vill patcha det med.

source: ``patch.object``::
sv: ``patch.objekt``::

source: >>> original = SomeClass.attribute >>> @patch.object(SomeClass, 'attribute', sentinel.attribute) ... def test(): ... assert SomeClass.attribute == sentinel.attribute ... >>> test() >>> assert SomeClass.attribute == original >>> @patch('package.module.attribute', sentinel.attribute) ... def test(): ... from package.module import attribute ... assert attribute is sentinel.attribute ... >>> test()
sv: >>> original = NågonKlass.attribut >>> @patch.object(SomeClass, 'attribut', sentinel.attribut) ... def test(): ... assert SomeClass.attribute == sentinel.attribute ... >>> test() >>> assert SomeClass.attribute == original >>> @patch('paket.modul.attribut', sentinel.attribut) ... def test(): ... från paket.modul import attribut ... assert attribut är sentinel.attribut ... >>> test()

source: If you are patching a module (including :mod:`builtins`) then use :func:`patch` instead of :func:`patch.object`:
sv: Om du patchar en modul (inklusive :mod:`builtins`), använd då :func:`patch` istället för :func:`patch.object`:

source: The module name can be 'dotted', in the form ``package.module`` if needed::
sv: Modulnamnet kan vara "prickat", i formen ``package.module`` om det behövs::

source: >>> @patch('package.module.ClassName.attribute', sentinel.attribute) ... def test(): ... from package.module import ClassName ... assert ClassName.attribute == sentinel.attribute ... >>> test()
sv: >>> @patch('paket.modul.Klassnamn.attribut', sentinel.attribut) ... def test(): ... from package.module import Klassnamn ... assert ClassName.attribute == sentinel.attribute ... >>> test()

source: A nice pattern is to actually decorate test methods themselves:
sv: Ett trevligt mönster är att faktiskt dekorera testmetoderna själva:

source: If you want to patch with a Mock, you can use :func:`patch` with only one argument (or :func:`patch.object` with two arguments). The mock will be created for you and passed into the test function / method:
sv: Om du vill patcha med en Mock kan du använda :func:`patch` med bara ett argument (eller :func:`patch.object` med två argument). Mocken kommer att skapas åt dig och skickas in i testfunktionen/metoden:

source: You can stack up multiple patch decorators using this pattern::
sv: Du kan stapla upp flera patchdekorationer med detta mönster::

source: >>> class MyTest(unittest.TestCase): ... @patch('package.module.ClassName1') ... @patch('package.module.ClassName2') ... def test_something(self, MockClass2, MockClass1): ... self.assertIs(package.module.ClassName1, MockClass1) ... self.assertIs(package.module.ClassName2, MockClass2) ... >>> MyTest('test_something').test_something()
sv: >>> klass MyTest(unittest.TestCase): ... @patch('paket.modul.Klassnamn1') ... @patch('paket.modul.Klassnamn2') ... def test_something(self, MockClass2, MockClass1): ... self.assertIs(paket.modul.Klassnamn1, MockClass1) ... self.assertIs(paket.modul.Klassnamn2, MockClass2) ... >>> MyTest('test_something').test_something()

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``test_module.ClassName2`` is passed in first.
sv: När du nestar patch-dekoratorer skickas mockarna in till den dekorerade funktionen i samma ordning som de tillämpas (den normala *Python*-ordningen som dekoratorer tillämpas). Detta innebär nerifrån och upp, så i exemplet ovan skickas mocken för ``test_module.ClassName2`` in först.

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
sv: Det finns också :func:`patch.dict` för att ställa in värden i en ordbok bara under ett scope och återställa ordboken till dess ursprungliga tillstånd när testet avslutas:

source: ``patch``, ``patch.object`` and ``patch.dict`` can all be used as context managers.
sv: ``patch``, ``patch.object`` och ``patch.dict`` kan alla användas som kontexthanterare.

source: Where you use :func:`patch` to create a mock for you, you can get a reference to the mock using the "as" form of the with statement:
sv: När du använder :func:`patch` för att skapa en mock åt dig kan du få en referens till mocken med hjälp av "as"-formen i with-satsen:
