Repository: yeager/python-docs-sv
Catalog: library/unittest.mock.po
Languages: sv

source: >>> @patch('sys.non_existing_attribute', 42) ... def test(): ... assert sys.non_existing_attribute == 42 ... >>> test() Traceback (most recent call last): ... AttributeError: <module 'sys' (built-in)> does not have the attribute 'non_existing_attribute'
sv: >>> @patch('sys.non_existing_attribute', 42) ... def test(): ... assert sys.icke_existerande_attribut == 42 ... >>> test() Traceback (senaste anropet senast): ... Attributfel: <modulen 'sys' (inbyggd)> har inte attributet 'non_existing_attribute'

source: but adding ``create=True`` in the call to :func:`patch` will make the previous example work as expected::
sv: men genom att lägga till ``create=True`` i anropet till :func:`patch` kommer det föregående exemplet att fungera som förväntat::

source: >>> @patch('sys.non_existing_attribute', 42, create=True) ... def test(mock_stdout): ... assert sys.non_existing_attribute == 42 ... >>> test()
sv: >>> @patch('sys.non_existing_attribute', 42, create=True) ... def test(mock_stdout): ... assert sys.icke_existerande_attribut == 42 ... >>> test()

source: :func:`patch` now returns an :class:`AsyncMock` if the target is an async function.
sv: :func:`patch` returnerar nu en :class:`AsyncMock` om målet är en asynkron funktion.

source: patch.object
sv: patch.objekt

source: patch the named member (*attribute*) on an object (*target*) with a mock object.
sv: patch den namngivna medlemmen (*attribut*) på ett objekt (*mål*) med ett låtsasobjekt.

source: :func:`patch.object` can be used as a decorator, class decorator or a context manager. Arguments *new*, *spec*, *create*, *spec_set*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. Like :func:`patch`, :func:`patch.object` takes arbitrary keyword arguments for configuring the mock object it creates.
sv: :func:`patch.object` kan användas som en dekorator, klassdekorator eller kontexthanterare. Argumenten *new*, *spec*, *create*, *spec_set*, *autospec* och *new_callable* har samma betydelse som för :func:`patch`. Precis som :func:`patch` tar :func:`patch.object` godtyckliga nyckelordsargument för att konfigurera det låtsasobjekt som skapas.

source: When used as a class decorator :func:`patch.object` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
sv: När det används som en klassdekorator :func:`patch.object` hedrar ``patch.TEST_PREFIX`` för att välja vilka metoder som ska omslutas.

source: You can either call :func:`patch.object` with three arguments or two arguments. The three argument form takes the object to be patched, the attribute name and the object to replace the attribute with.
sv: Du kan antingen anropa :func:`patch.object` med tre argument eller med två argument. Formen med tre argument tar objektet som ska patchas, attributnamnet och objektet som ska ersätta attributet med.

source: When calling with the two argument form you omit the replacement object, and a mock is created for you and passed in as an extra argument to the decorated function:
sv: När du anropar med tvåargumentformen utelämnar du ersättningsobjektet, och en mock skapas åt dig och skickas in som ett extra argument till den dekorerade funktionen:

source: *spec*, *create* and the other arguments to :func:`patch.object` have the same meaning as they do for :func:`patch`.
sv: *spec*, *create* och de andra argumenten till :func:`patch.object` har samma betydelse som de har för :func:`patch`.

source: Patch a dictionary, or dictionary like object, and restore the dictionary to its original state after the test, where the restored dictionary is a copy of the dictionary as it was before the test.
sv: Patch en ordbok, eller ett ordboksliknande objekt, och återställ ordboken till dess ursprungliga skick efter testet, där den återställda ordboken är en kopia av ordboken som den såg ut före testet.

source: *in_dict* can be a dictionary or a mapping like container. If it is a mapping then it must at least support getting, setting and deleting items plus iterating over keys.
sv: *in_dict* kan vara en ordbok eller en mappningsliknande behållare. Om det är en mappning måste den åtminstone stödja hämtning, inställning och borttagning av objekt samt iterering över nycklar.

source: *in_dict* can also be a string specifying the name of the dictionary, which will then be fetched by importing it.
sv: *in_dict* kan också vara en sträng som anger namnet på ordboken, som sedan hämtas genom att importera den.

source: *values* can be a dictionary of values to set in the dictionary. *values* can also be an iterable of ``(key, value)`` pairs.
sv: *values* kan vara en ordlista med värden som ska anges i ordlistan. *values* kan också vara en iterabel av paren ``(nyckel, värde)``.

source: If *clear* is true then the dictionary will be cleared before the new values are set.
sv: Om *clear* är true kommer ordlistan att tömmas innan de nya värdena sätts.

source: :func:`patch.dict` can also be called with arbitrary keyword arguments to set values in the dictionary.
sv: :func:`patch.dict` kan också anropas med godtyckliga nyckelordsargument för att ställa in värden i ordlistan.

source: :func:`patch.dict` now returns the patched dictionary when used as a context manager.
sv: :func:`patch.dict` returnerar nu den patchade ordlistan när den används som en kontexthanterare.

source: :func:`patch.dict` can be used as a context manager, decorator or class decorator:
sv: :func:`patch.dict` kan användas som en kontexthanterare, dekorator eller klassdekorator:

source: When used as a class decorator :func:`patch.dict` honours ``patch.TEST_PREFIX`` (default to ``'test'``) for choosing which methods to wrap:
sv: När det används som en klassdekorator :func:`patch.dict` hedrar ``patch.TEST_PREFIX`` (standard till ``'test'``) för att välja vilka metoder som ska omslutas:

source: If you want to use a different prefix for your test, you can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``. For more details about how to change the value of see :ref:`test-prefix`.
sv: Om du vill använda ett annat prefix för ditt test kan du informera patcharna om det genom att ställa in ``patch.TEST_PREFIX``. För mer information om hur du ändrar värdet på se :ref:`test-prefix`.

source: :func:`patch.dict` can be used to add members to a dictionary, or simply let a test change a dictionary, and ensure the dictionary is restored when the test ends.
sv: :func:`patch.dict` kan användas för att lägga till medlemmar i en ordbok, eller helt enkelt låta ett test ändra en ordbok och se till att ordboken återställs när testet avslutas.

source: Keywords can be used in the :func:`patch.dict` call to set values in the dictionary:
sv: Nyckelord kan användas i :func:`patch.dict`-anropet för att ange värden i ordlistan:

source: :func:`patch.dict` can be used with dictionary like objects that aren't actually dictionaries. At the very minimum they must support item getting, setting, deleting and either iteration or membership test. This corresponds to the magic methods :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` and either :meth:`~container.__iter__` or :meth:`~object.__contains__`.
sv: :func:`patch.dict` kan användas med ordboksliknande objekt som egentligen inte är ordböcker. De måste åtminstone stödja hämtning, inställning och borttagning av objekt samt antingen iteration eller medlemskapstest. Detta motsvarar de magiska metoderna :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` och antingen :meth:`~container.__iter__` eller :meth:`~object.__contains__`.

source: Perform multiple patches in a single call. It takes the object to be patched (either as an object or a string to fetch the object by importing) and keyword arguments for the patches::
sv: Utför flera patchar i ett enda anrop. Det tar objektet som ska patchas (antingen som ett objekt eller en sträng för att hämta objektet genom import) och nyckelordsargument för patcharna::

source: with patch.multiple(settings, FIRST_PATCH='one', SECOND_PATCH='two'): ...
sv: med patch.multiple(settings, FIRST_PATCH='one', SECOND_PATCH='two'): ...

source: Use :data:`DEFAULT` as the value if you want :func:`patch.multiple` to create mocks for you. In this case the created mocks are passed into a decorated function by keyword, and a dictionary is returned when :func:`patch.multiple` is used as a context manager.
sv: Använd :data:`DEFAULT` som värde om du vill att :func:`patch.multiple` ska skapa mocks åt dig. I detta fall skickas de skapade mockarna till en dekorerad funktion med nyckelord, och en dictionary returneras när :func:`patch.multiple` används som kontexthanterare.

source: :func:`patch.multiple` can be used as a decorator, class decorator or a context manager. The arguments *spec*, *spec_set*, *create*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. These arguments will be applied to *all* patches done by :func:`patch.multiple`.
sv: :func:`patch.multiple` kan användas som en dekorator, klassdekorator eller kontexthanterare. Argumenten *spec*, *spec_set*, *create*, *autospec* och *new_callable* har samma betydelse som för :func:`patch`. Dessa argument kommer att tillämpas på *alla* patchar som görs av :func:`patch.multiple`.

source: When used as a class decorator :func:`patch.multiple` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
sv: När det används som en klassdekorator :func:`patch.multiple` hedrar ``patch.TEST_PREFIX`` när det gäller att välja vilka metoder som ska omslutas.

source: If you want :func:`patch.multiple` to create mocks for you, then you can use :data:`DEFAULT` as the value. If you use :func:`patch.multiple` as a decorator then the created mocks are passed into the decorated function by keyword. ::
sv: Om du vill att :func:`patch.multiple` ska skapa mocks åt dig, kan du använda :data:`DEFAULT` som värde. Om du använder :func:`patch.multiple` som en dekorator så skickas de skapade mockarna in i den dekorerade funktionen med nyckelordet ::

source: >>> thing = object() >>> other = object() >>> @patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) ... def test_function(thing, other): ... assert isinstance(thing, MagicMock) ... assert isinstance(other, MagicMock) ... >>> test_function()
sv: >>> sak = objekt() >>> annan = objekt() >>> @patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) ... def test_function(sak, annan): ... assert isinstance(sak, MagicMock) ... assert isinstance(annan, MagicMock) ... >>> test_funktion()

source: :func:`patch.multiple` can be nested with other ``patch`` decorators, but put arguments passed by keyword *after* any of the standard arguments created by :func:`patch`::
sv: :func:`patch.multiple` kan nästlas med andra ``patch`` dekoratorer, men lägger argument som skickas med nyckelord *efter* något av de standardargument som skapas av :func:`patch`::

source: >>> @patch('sys.exit') ... @patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) ... def test_function(mock_exit, other, thing): ... assert 'other' in repr(other) ... assert 'thing' in repr(thing) ... assert 'exit' in repr(mock_exit) ... >>> test_function()
sv: >>> @patch('sys.exit') ... @patch.multiple('__main__', sak=DEFAULT, annan=DEFAULT) ... def test_function(mock_exit, other, thing): ... assert 'other' i repr(other) ... assert 'thing' i repr(thing) ... assert 'exit' i repr(mock_exit) ... >>> test_funktion()

source: If :func:`patch.multiple` is used as a context manager, the value returned by the context manager is a dictionary where created mocks are keyed by name::
sv: Om :func:`patch.multiple` används som kontexthanterare är det värde som returneras av kontexthanteraren en ordbok där skapade mockar har nyckelordet name::

source: >>> with patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) as values: ... assert 'other' in repr(values['other']) ... assert 'thing' in repr(values['thing']) ... assert values['thing'] is thing ... assert values['other'] is other ...
sv: >>> med patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) som värden: ... assert 'other' in repr(värden['other']) ... assert 'thing' i repr(värden['thing']) ... assert värden['sak'] är sak ... assert värden['annat'] är annat ...

source: patch methods: start and stop
sv: patchmetoder: start och stopp

source: All the patchers have :meth:`!start` and :meth:`!stop` methods. These make it simpler to do patching in ``setUp`` methods or where you want to do multiple patches without nesting decorators or with statements.
sv: Alla patchers har metoderna :meth:`!start` och :meth:`!stop`. Dessa gör det enklare att göra patchar i ``setUp`` metoder eller där man vill göra flera patchar utan att nesta dekoratorer eller med statements.

source: To use them call :func:`patch`, :func:`patch.object` or :func:`patch.dict` as normal and keep a reference to the returned ``patcher`` object. You can then call :meth:`!start` to put the patch in place and :meth:`!stop` to undo it.
sv: För att använda dem anropa :func:`patch`, :func:`patch.object` eller :func:`patch.dict` som vanligt och behåll en referens till det returnerade ``patcher``-objektet. Du kan sedan anropa :meth:`!start` för att sätta patchen på plats och :meth:`!stop` för att ångra den.

source: If you are using :func:`patch` to create a mock for you then it will be returned by the call to ``patcher.start``. ::
sv: Om du använder :func:`patch` för att skapa en mock åt dig så kommer den att returneras av anropet till ``patcher.start``. ::

source: >>> patcher = patch('package.module.ClassName') >>> from package import module >>> original = module.ClassName >>> new_mock = patcher.start() >>> assert module.ClassName is not original >>> assert module.ClassName is new_mock >>> patcher.stop() >>> assert module.ClassName is original >>> assert module.ClassName is not new_mock
sv: >>> patcher = patch('paket.modul.Klassnamn') >>> from package import modul >>> original = modul.klassnamn >>> new_mock = patcher.start() >>> assert modul.klassnamn är inte original >>> assert modul.klassnamn är new_mock >>> patcher.stop() >>> assert modul.klassnamn är original >>> assert modul.klassnamn är inte new_mock

source: A typical use case for this might be for doing multiple patches in the ``setUp`` method of a :class:`~unittest.TestCase`::
sv: Ett typiskt användningsfall för detta kan vara att göra flera korrigeringar i metoden ``setUp`` i en :class:`~unittest.TestCase`::

source: >>> class MyTest(unittest.TestCase): ... def setUp(self): ... self.patcher1 = patch('package.module.Class1') ... self.patcher2 = patch('package.module.Class2') ... self.MockClass1 = self.patcher1.start() ... self.MockClass2 = self.patcher2.start() ... ... def tearDown(self): ... self.patcher1.stop() ... self.patcher2.stop() ... ... def test_something(self): ... assert package.module.Class1 is self.MockClass1 ... assert package.module.Class2 is self.MockClass2 ... >>> MyTest('test_something').run()
sv: >>> klass MyTest(unittest.TestCase): ... def setUp(self): ... self.patcher1 = patch('package.module.Class1') ... self.patcher2 = patch('package.module.Class2') ... self.MockClass1 = self.patcher1.start() ... self.MockClass2 = self.patcher2.start() ... ... def tearDown(self): ... self.patcher1.stop() ... self.patcher2.stop() ... ... def test_something(self): ... assert paket.modul.Class1 är self.MockClass1 ... assert package.module.Class2 är self.MockClass2 ... >>> MyTest('test_something').run()

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the ``setUp`` then ``tearDown`` is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
sv: Om du använder den här tekniken måste du se till att patchningen "ångras" genom att anropa ``stop``. Detta kan vara krångligare än du kanske tror, för om ett undantag uppstår i ``setUp`` så anropas inte ``tearDown``. :meth:`unittest.TestCase.addCleanup` gör detta enklare::

source: >>> class MyTest(unittest.TestCase): ... def setUp(self): ... patcher = patch('package.module.Class') ... self.MockClass = patcher.start() ... self.addCleanup(patcher.stop) ... ... def test_something(self): ... assert package.module.Class is self.MockClass ...
sv: >>> klass MyTest(unittest.TestCase): ... def setUp(self): ... patcher = patch('paket.modul.Klass') ... self.MockClass = patcher.start() ... self.addCleanup(patcher.stop) ... ... def test_something(self): ... assert paket.modul.Klass är self.MockClass ...

source: As an added bonus you no longer need to keep a reference to the ``patcher`` object.
sv: Som en extra bonus behöver du inte längre behålla en referens till ``patcher``-objektet.

source: It is also possible to stop all patches which have been started by using :func:`patch.stopall`.
sv: Det är också möjligt att stoppa alla patchar som har startats genom att använda :func:`patch.stopall`.

source: Stop all active patches. Only stops patches started with ``start``.
sv: Stoppar alla aktiva patchar. Stoppar endast patchar som startats med ``start``.

source: patch builtins
sv: patch inbyggda komponenter

source: You can patch any builtins within a module. The following example patches builtin :func:`ord`::
sv: Du kan patcha alla builtins i en modul. Följande exempel patchar inbyggda :func:`ord`::

source: All of the patchers can be used as class decorators. When used in this way they wrap every test method on the class. The patchers recognise methods that start with ``'test'`` as being test methods. This is the same way that the :class:`unittest.TestLoader` finds test methods by default.
sv: Alla patchers kan användas som klassdekoratorer. När de används på detta sätt omsluter de varje testmetod i klassen. Patcherna känner igen metoder som börjar med ``'test'`` som testmetoder. Detta är på samma sätt som :class:`unittest.TestLoader` hittar testmetoder som standard.

source: It is possible that you want to use a different prefix for your tests. You can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``::
sv: Det är möjligt att du vill använda ett annat prefix för dina tester. Du kan informera patcharna om det olika prefixet genom att ställa in ``patch.TEST_PREFIX``::

source: >>> patch.TEST_PREFIX = 'foo' >>> value = 3 >>> >>> @patch('__main__.value', 'not three') ... class Thing: ... def foo_one(self): ... print(value) ... def foo_two(self): ... print(value) ... >>> >>> Thing().foo_one() not three >>> Thing().foo_two() not three >>> value 3
sv: >>> patch.TEST_PREFIX = 'foo' >>> värde = 3 >>> >>> @patch('__main__.value', 'inte tre') ... klass Thing: ... def foo_one(self): ... print(värde) ... def foo_two(self): ... print(värde) ... >>> >>> Thing().foo_one() inte tre >>> Thing().foo_two() inte tre >>> värde 3

source: Nesting Patch Decorators
sv: Nesting Patch Dekoratörer

source: If you want to perform multiple patches then you can simply stack up the decorators.
sv: Om du vill utföra flera patchar kan du helt enkelt stapla dekoratorerna på varandra.

source: You can stack up multiple patch decorators using this pattern:
sv: Du kan stapla upp flera patchdekorationer med hjälp av detta mönster:

source: Note that the decorators are applied from the bottom upwards. This is the standard way that Python applies decorators. The order of the created mocks passed into your test function matches this order.
sv: Observera att dekoratorerna appliceras nedifrån och upp. Detta är det vanliga sättet som Python tillämpar dekoratorer på. Ordningen på de skapade mockarna som skickas in i din testfunktion matchar denna ordning.

source: Where to patch
sv: Var ska man lappa

source: :func:`patch` works by (temporarily) changing the object that a *name* points to with another one. There can be many names pointing to any individual object, so for patching to work you must ensure that you patch the name used by the system under test.
sv: :func:`patch` fungerar genom att (tillfälligt) byta ut det objekt som ett *namn* pekar på mot ett annat. Det kan finnas många namn som pekar på ett enskilt objekt, så för att patching ska fungera måste du se till att du patchar det namn som används av det system som testas.

source: The basic principle is that you patch where an object is *looked up*, which is not necessarily the same place as where it is defined. A couple of examples will help to clarify this.
sv: Grundprincipen är att man patchar där ett objekt *söks upp*, vilket inte nödvändigtvis är samma plats som där det definieras. Ett par exempel kan hjälpa till att förtydliga detta.

source: Imagine we have a project that we want to test with the following structure::
sv: Tänk dig att vi har ett projekt som vi vill testa med följande struktur::

source: a.py -> Defines SomeClass b.py -> from a import SomeClass -> some_function instantiates SomeClass
sv: a.py -> Definierar SomeClass b.py -> från a import SomeClass -> some_function instansierar SomeClass

source: Now we want to test ``some_function`` but we want to mock out ``SomeClass`` using :func:`patch`. The problem is that when we import module b, which we will have to do when it imports ``SomeClass`` from module a. If we use :func:`patch` to mock out ``a.SomeClass`` then it will have no effect on our test; module b already has a reference to the *real* ``SomeClass`` and it looks like our patching had no effect.
sv: Nu vill vi testa ``some_function`` men vi vill mocka ut ``SomeClass`` med hjälp av :func:`patch`. Problemet är att när vi importerar modul b, vilket vi kommer att behöva göra när den importerar ``SomeClass`` från modul a. Om vi använder :func:`patch` för att mocka ut ``a.SomeClass`` så kommer det inte att ha någon effekt på vårt test; modul b har redan en referens till den *verkliga* ``SomeClass`` och det ser ut som om vår patchning inte hade någon effekt.

source: The key is to patch out ``SomeClass`` where it is used (or where it is looked up). In this case ``some_function`` will actually look up ``SomeClass`` in module b, where we have imported it. The patching should look like::
sv: Nyckeln är att patcha ut ``SomeClass`` där den används (eller där den slås upp). I det här fallet kommer ``some_function`` faktiskt att leta upp ``SomeClass`` i modul b, där vi har importerat den. Patchen bör se ut som::

source: However, consider the alternative scenario where instead of ``from a import SomeClass`` module b does ``import a`` and ``some_function`` uses ``a.SomeClass``. Both of these import forms are common. In this case the class we want to patch is being looked up in the module and so we have to patch ``a.SomeClass`` instead::
sv: Tänk dock på det alternativa scenariot där modul b istället för ``from a import SomeClass`` gör ``import a`` och ```som_funktion`` använder ``a.SomeClass``. Båda dessa importformer är vanliga. I det här fallet söks den klass vi vill patcha upp i modulen och därför måste vi patcha ``a.SomeClass`` istället::

source: Patching Descriptors and Proxy Objects
sv: Patchning av deskriptorer och proxyobjekt

source: Both patch_ and patch.object_ correctly patch and restore descriptors: class methods, static methods and properties. You should patch these on the *class* rather than an instance. They also work with *some* objects that proxy attribute access, like the `django settings object <https://web.archive.org/web/20200603181648/http://www.voidspace.org.uk/python/weblog/arch_d7_2010_12_04.shtml#e1198>`_.
sv: Både patch_ och patch.object_ patchar och återställer deskriptorer korrekt: klassmetoder, statiska metoder och egenskaper. Du bör patcha dessa på *klassen* snarare än på en instans. De fungerar också med *vissa* objekt som proxy-attributåtkomst, som `django settings object <https://web.archive.org/web/20200603181648/http://www.voidspace.org.uk/python/weblog/arch_d7_2010_12_04.shtml#e1198>`_.
