Repository: yeager/python-docs-sv
Catalog: library/unittest.mock.po
Languages: sv

source: Many of the not-very-useful (private to :class:`Mock` rather than the thing being mocked) underscore and double underscore prefixed attributes have been filtered from the result of calling :func:`dir` on a :class:`Mock`. If you dislike this behaviour you can switch it off by setting the module level switch :data:`FILTER_DIR`:
sv: Många av de inte särskilt användbara (privata för :class:`Mock` snarare än för det som mockas) understreckade och dubbelt understreckade prefixattributen har filtrerats bort från resultatet av anropet :func:`dir` på en :class:`Mock`. Om du inte gillar det här beteendet kan du stänga av det genom att ställa in modulnivåomkopplaren :data:`FILTER_DIR`:

source: Alternatively you can just use ``vars(my_mock)`` (instance members) and ``dir(type(my_mock))`` (type members) to bypass the filtering irrespective of :const:`FILTER_DIR`.
sv: Alternativt kan du bara använda ``vars(my_mock)`` (instansmedlemmar) och ``dir(type(my_mock))`` (typmedlemmar) för att kringgå filtreringen oavsett :const:`FILTER_DIR`.

source: A helper function to create a mock to replace the use of :func:`open`. It works for :func:`open` called directly or used as a context manager.
sv: En hjälpfunktion för att skapa en mock för att ersätta användningen av :func:`open`. Den fungerar för :func:`open` som anropas direkt eller används som en kontexthanterare.

source: The *mock* argument is the mock object to configure. If ``None`` (the default) then a :class:`MagicMock` will be created for you, with the API limited to methods or attributes available on standard file handles.
sv: Argumentet *mock* är det mock-objekt som ska konfigureras. Om ``None`` (standard) så kommer en :class:`MagicMock` att skapas åt dig, med API begränsat till metoder eller attribut som är tillgängliga på standard filhandtag.

source: *read_data* is a string for the :meth:`~io.RawIOBase.read`, :meth:`~io.IOBase.readline`, and :meth:`~io.IOBase.readlines` methods of the file handle to return. Calls to those methods will take data from *read_data* until it is depleted. The mock of these methods is pretty simplistic: every time the *mock* is called, the *read_data* is rewound to the start. If you need more control over the data that you are feeding to the tested code you will need to customize this mock for yourself. When that is insufficient, one of the in-memory filesystem packages on `PyPI <https://pypi.org>`_ can offer a realistic filesystem for testing.
sv: *read_data* är en sträng för metoderna :meth:`~io.RawIOBase.read`, :meth:`~io.IOBase.readline` och :meth:`~io.IOBase.readlines` i filhandtaget som ska returneras. Anrop till dessa metoder kommer att ta data från *read_data* tills den är tömd. Mockningen av dessa metoder är ganska enkel: varje gång *mock* anropas spolas *read_data* tillbaka till början. Om du behöver mer kontroll över de data som du matar in i den testade koden måste du anpassa den här mocken för dig själv. När det inte räcker kan ett av paketen med filsystem i minnet på `PyPI <https://pypi.org>`_ erbjuda ett realistiskt filsystem för testning.

source: Added :meth:`~io.IOBase.readline` and :meth:`~io.IOBase.readlines` support. The mock of :meth:`~io.RawIOBase.read` changed to consume *read_data* rather than returning it on each call.
sv: Lagt till stöd för :meth:`~io.IOBase.readline` och :meth:`~io.IOBase.readlines`. Mock av :meth:`~io.RawIOBase.read` ändrad till att konsumera *read_data* istället för att returnera den vid varje anrop.

source: *read_data* is now reset on each call to the *mock*.
sv: *read_data* nollställs nu vid varje anrop till *mock*.

source: Added :meth:`~container.__iter__` to implementation so that iteration (such as in for loops) correctly consumes *read_data*.
sv: Lade till :meth:`~container.__iter__` till implementationen så att iteration (t.ex. i for-loopar) korrekt förbrukar *read_data*.

source: Using :func:`open` as a context manager is a great way to ensure your file handles are closed properly and is becoming common::
sv: Att använda :func:`open` som en kontexthanterare är ett bra sätt att säkerställa att dina filhandtag stängs ordentligt och blir allt vanligare::

source: with open('/some/path', 'w') as f: f.write('something')
sv: med open('/some/sökväg', 'w') som f: f.write("något")

source: The issue is that even if you mock out the call to :func:`open` it is the *returned object* that is used as a context manager (and has :meth:`~object.__enter__` and :meth:`~object.__exit__` called).
sv: Problemet är att även om du mockar ut anropet till :func:`open` är det det *återlämnade objektet* som används som en kontexthanterare (och har :meth:`~object.__enter__` och :meth:`~object.__exit__` anropade).

source: Mocking context managers with a :class:`MagicMock` is common enough and fiddly enough that a helper function is useful. ::
sv: Att mocka kontexthanterare med en :class:`MagicMock` är tillräckligt vanligt och krångligt för att en hjälpfunktion är användbar. ::

source: >>> m = mock_open() >>> with patch('__main__.open', m): ... with open('foo', 'w') as h: ... h.write('some stuff') ... >>> m.mock_calls [call('foo', 'w'), call().__enter__(), call().write('some stuff'), call().__exit__(None, None, None)] >>> m.assert_called_once_with('foo', 'w') >>> handle = m() >>> handle.write.assert_called_once_with('some stuff')
sv: >>> m = mock_open() >>> med patch('__main__.open', m): ... med open('foo', 'w') som h: ... h.write("lite grejer") ... >>> m.mock_calls [call('foo', 'w'), call().__enter__(), call().write('lite grejer'), call().__exit__(None, None, None)] >>> m.assert_called_once_with('foo', 'w') >>> handtag = m() >>> handle.write.assert_called_once_with('lite grejer')

source: And for reading files::
sv: Och för att läsa filer::

source: >>> with patch('__main__.open', mock_open(read_data='bibble')) as m: ... with open('foo') as h: ... result = h.read() ... >>> m.assert_called_once_with('foo') >>> assert result == 'bibble'
sv: >>> med patch('__main__.open', mock_open(read_data='bibble')) som m: ... med open('foo') som h: ... resultat = h.read() ... >>> m.assert_called_once_with('foo') >>> assert resultat == 'bibble'

source: Autospeccing is based on the existing :attr:`!spec` feature of mock. It limits the api of mocks to the api of an original object (the spec), but it is recursive (implemented lazily) so that attributes of mocks only have the same api as the attributes of the spec. In addition mocked functions / methods have the same call signature as the original so they raise a :exc:`TypeError` if they are called incorrectly.
sv: Autospeccing baseras på den befintliga funktionen :attr:`!spec` i mock. Den begränsar api för mocks till api för ett originalobjekt (spec), men den är rekursiv (implementeras lättsinnigt) så att attribut för mocks endast har samma api som attributen för spec. Dessutom har mockade funktioner / metoder samma anropssignatur som originalet så att de ger upphov till ett :exc:`TypeError` om de anropas felaktigt.

source: Before I explain how auto-speccing works, here's why it is needed.
sv: Innan jag förklarar hur autospeccing fungerar ska du få veta varför det behövs.

source: :class:`Mock` is a very powerful and flexible object, but it suffers from a flaw which is general to mocking. If you refactor some of your code, rename members and so on, any tests for code that is still using the *old api* but uses mocks instead of the real objects will still pass. This means your tests can all pass even though your code is broken.
sv: :class:`Mock` är ett mycket kraftfullt och flexibelt objekt, men det lider av ett fel som är generellt för mocking. Om du refaktoriserar en del av din kod, byter namn på medlemmar och så vidare, kommer alla tester för kod som fortfarande använder det *gamla api* men använder mocks istället för de riktiga objekten fortfarande att godkännas. Detta innebär att alla dina tester kan godkännas även om din kod är trasig.

source: Before 3.5, tests with a typo in the word assert would silently pass when they should raise an error. You can still achieve this behavior by passing ``unsafe=True`` to Mock.
sv: Före 3.5 kunde tester med ett stavfel i ordet assert godkännas i tysthet när de borde ge upphov till ett fel. Du kan fortfarande uppnå detta beteende genom att skicka ``unsafe=True`` till Mock.

source: Note that this is another reason why you need integration tests as well as unit tests. Testing everything in isolation is all fine and dandy, but if you don't test how your units are "wired together" there is still lots of room for bugs that tests might have caught.
sv: Observera att detta är ytterligare ett skäl till varför du behöver integrationstester såväl som enhetstester. Det är bra att testa allting isolerat, men om du inte testar hur dina enheter är "ihopkopplade" finns det fortfarande gott om utrymme för buggar som testerna kanske hade fångat upp.

source: :mod:`unittest.mock` already provides a feature to help with this, called speccing. If you use a class or instance as the :attr:`!spec` for a mock then you can only access attributes on the mock that exist on the real class:
sv: :mod:`unittest.mock` tillhandahåller redan en funktion som hjälper till med detta, kallad speccing. Om du använder en klass eller instans som :attr:`!spec` för en mock så kan du bara komma åt attribut på mocken som finns på den riktiga klassen:

source: The spec only applies to the mock itself, so we still have the same issue with any methods on the mock:
sv: Specifikationen gäller bara för själva mocken, så vi har fortfarande samma problem med alla metoder på mocken:

source: >>> mock.header_items() <mock.Mock object at 0x...> >>> mock.header_items.assret_called_with() # Intentional typo!
sv: >>> mock.header_items() <mock.mock-objekt på 0x...> >>> mock.header_items.assret_called_with() >>> mock.header_items.assret_called_with() # Avsiktligt skrivfel!

source: Auto-speccing solves this problem. You can either pass ``autospec=True`` to :func:`patch` / :func:`patch.object` or use the :func:`create_autospec` function to create a mock with a spec. If you use the ``autospec=True`` argument to :func:`patch` then the object that is being replaced will be used as the spec object. Because the speccing is done "lazily" (the spec is created as attributes on the mock are accessed) you can use it with very complex or deeply nested objects (like modules that import modules that import modules) without a big performance hit.
sv: Auto-specificering löser detta problem. Du kan antingen skicka ``autospec=True`` till :func:`patch` / :func:`patch.object` eller använda funktionen :func:`create_autospec` för att skapa en mock med en spec. Om du använder argumentet ``autospec=True`` till :func:`patch` så kommer objektet som ersätts att användas som spec-objekt. Eftersom specifikationen görs "lazily" (specifikationen skapas när attribut på mocken nås) kan du använda den med mycket komplexa eller djupt nästlade objekt (som moduler som importerar moduler som importerar moduler) utan en stor prestandahit.

source: Here's an example of it in use::
sv: Här är ett exempel på hur det används::

source: You can see that :class:`!request.Request` has a spec. :class:`!request.Request` takes two arguments in the constructor (one of which is *self*). Here's what happens if we try to call it incorrectly::
sv: Du kan se att :class:`!request.Request` har en spec. :class:`!request.Request` tar två argument i konstruktorn (varav ett är *self*). Här är vad som händer om vi försöker anropa den felaktigt::

source: >>> req = request.Request() Traceback (most recent call last): ... TypeError: <lambda>() takes at least 2 arguments (1 given)
sv: &gt;&gt;&gt; req = begäran.begäran() Traceback (senaste anropet senast): ... TypeError: <lambda>() tar minst 2 argument (1 givet)

source: The spec also applies to instantiated classes (i.e. the return value of specced mocks)::
sv: Specifikationen gäller också för instansierade klasser (dvs. returvärdet för specificerade mocks)::

source: >>> req = request.Request('foo') >>> req <NonCallableMagicMock name='request.Request()' spec='Request' id='...'>
sv: &gt;&gt;&gt; req = begäran.begäran('foo') &gt;&gt;&gt; req <NonCallableMagicMock name='request.Request()' spec='Request' id='...'>

source: :class:`!Request` objects are not callable, so the return value of instantiating our mocked out :class:`!request.Request` is a non-callable mock. With the spec in place any typos in our asserts will raise the correct error::
sv: :class:`!Request`-objekt är inte anropsbara, så returvärdet för instantiering av vår mockade :class:`!request.Request` är en icke anropsbar mock. Med specifikationen på plats kommer eventuella typfel i våra asserts att ge upphov till rätt fel::

source: >>> req.add_header('spam', 'eggs') <MagicMock name='request.Request().add_header()' id='...'> >>> req.add_header.assret_called_with # Intentional typo! Traceback (most recent call last): ... AttributeError: Mock object has no attribute 'assret_called_with' >>> req.add_header.assert_called_with('spam', 'eggs')
sv: &gt;&gt;&gt; req.add_header('spam', 'eggs') <MagicMock name='request.Request().add_header()' id='...'> &gt;&gt;&gt; req.add_header.assret_called_with # Avsiktligt skrivfel! Traceback (senaste anropet senast): ... Attributfel (AttributeError): Låtsasobjektet har inget attribut 'assret_called_with' &gt;&gt;&gt; req.add_header.assert_called_with('spam', 'ägg')

source: In many cases you will just be able to add ``autospec=True`` to your existing :func:`patch` calls and then be protected against bugs due to typos and api changes.
sv: I många fall kommer du bara att kunna lägga till ``autospec=True`` till dina befintliga :func:`patch`-anrop och sedan vara skyddad mot buggar på grund av typfel och api-ändringar.

source: As well as using *autospec* through :func:`patch` there is a :func:`create_autospec` for creating autospecced mocks directly:
sv: Förutom att använda *autospec* genom :func:`patch` finns det en :func:`create_autospec` för att skapa autospecade mockar direkt:

source: This isn't without caveats and limitations however, which is why it is not the default behaviour. In order to know what attributes are available on the spec object, autospec has to introspect (access attributes) the spec. As you traverse attributes on the mock a corresponding traversal of the original object is happening under the hood. If any of your specced objects have properties or descriptors that can trigger code execution then you may not be able to use autospec. On the other hand it is much better to design your objects so that introspection is safe [#]_.
sv: Detta är dock inte utan förbehåll och begränsningar, vilket är anledningen till att det inte är standardbeteendet. För att veta vilka attribut som är tillgängliga på spec-objektet måste autospec introspektera (få tillgång till attribut) spec. När du traverserar attribut på mock sker en motsvarande traversering av det ursprungliga objektet under huven. Om något av dina specificerade objekt har egenskaper eller deskriptorer som kan utlösa kodkörning kanske du inte kan använda autospec. Å andra sidan är det mycket bättre att utforma dina objekt så att introspektion är säker [#]_.

source: A more serious problem is that it is common for instance attributes to be created in the :meth:`~object.__init__` method and not to exist on the class at all. *autospec* can't know about any dynamically created attributes and restricts the api to visible attributes. ::
sv: Ett allvarligare problem är att det är vanligt att instansattribut skapas i metoden :meth:`~object.__init__` och inte alls finns i klassen. *autospec* kan inte känna till några dynamiskt skapade attribut och begränsar api:et till synliga attribut. ::

source: >>> class Something: ... def __init__(self): ... self.a = 33 ... >>> with patch('__main__.Something', autospec=True): ... thing = Something() ... thing.a ... Traceback (most recent call last): ... AttributeError: Mock object has no attribute 'a'
sv: >>> klass Något: ... def __init__(self): ... self.a = 33 ... >>> med patch('__main__.Something', autospec=True): ... sak = Something() ... sak.a ... Traceback (senaste anropet senast): ... Attributfel: Låtsasobjektet har inget attribut 'a'

source: There are a few different ways of resolving this problem. The easiest, but not necessarily the least annoying, way is to simply set the required attributes on the mock after creation. Just because *autospec* doesn't allow you to fetch attributes that don't exist on the spec it doesn't prevent you setting them::
sv: Det finns några olika sätt att lösa detta problem. Det enklaste, men inte nödvändigtvis det minst irriterande, sättet är att helt enkelt ställa in de nödvändiga attributen på mock efter skapandet. Bara för att *autospec* inte tillåter dig att hämta attribut som inte finns i specifikationen hindrar det inte dig från att ställa in dem::

source: >>> with patch('__main__.Something', autospec=True): ... thing = Something() ... thing.a = 33 ...
sv: >>> med patch('__main__.Something', autospec=True): ... sak = Something() ... thing.a = 33 ...

source: There is a more aggressive version of both *spec* and *autospec* that *does* prevent you setting non-existent attributes. This is useful if you want to ensure your code only *sets* valid attributes too, but obviously it prevents this particular scenario:
sv: Det finns en mer aggressiv version av både *spec* och *autospec* som *förhindrar* att du anger icke-existerande attribut. Detta är användbart om du vill se till att din kod bara *ställer in* giltiga attribut också, men det förhindrar naturligtvis just detta scenario:

source: Probably the best way of solving the problem is to add class attributes as default values for instance members initialised in :meth:`~object.__init__`. Note that if you are only setting default attributes in :meth:`!__init__` then providing them via class attributes (shared between instances of course) is faster too. e.g.
sv: Förmodligen är det bästa sättet att lösa problemet att lägga till klassattribut som standardvärden för instansmedlemmar som initieras i :meth:`~object.__init__`. Observera att om du bara ställer in standardattribut i :meth:`!__init__` är det också snabbare att tillhandahålla dem via klassattribut (som naturligtvis delas mellan instanser). t.ex.

source: class Something: a = 33
sv: klass Något: a = 33

source: This brings up another issue. It is relatively common to provide a default value of ``None`` for members that will later be an object of a different type. ``None`` would be useless as a spec because it wouldn't let you access *any* attributes or methods on it. As ``None`` is *never* going to be useful as a spec, and probably indicates a member that will normally of some other type, autospec doesn't use a spec for members that are set to ``None``. These will just be ordinary mocks (well - MagicMocks):
sv: Detta ger upphov till en annan fråga. Det är relativt vanligt att tillhandahålla ett standardvärde av ``None`` för medlemmar som senare kommer att vara ett objekt av en annan typ. ``None`` skulle vara värdelös som en specifikation eftersom det inte skulle låta dig komma åt * några * attribut eller metoder på den. Eftersom ``None`` *aldrig* kommer att vara användbar som specifikation, och förmodligen indikerar en medlem som normalt kommer att vara av någon annan typ, använder autospec inte en specifikation för medlemmar som är inställda på ``None``. Dessa kommer bara att vara vanliga mocks (ja - MagicMocks):

source: If modifying your production classes to add defaults isn't to your liking then there are more options. One of these is simply to use an instance as the spec rather than the class. The other is to create a subclass of the production class and add the defaults to the subclass without affecting the production class. Both of these require you to use an alternative object as the spec. Thankfully :func:`patch` supports this - you can simply pass the alternative object as the *autospec* argument::
sv: Om du inte gillar att ändra dina produktionsklasser för att lägga till standardvärden finns det fler alternativ. Ett av dessa är att helt enkelt använda en instans som specifikation i stället för klassen. Det andra är att skapa en underklass av produktionsklassen och lägga till standardvärdena i underklassen utan att påverka produktionsklassen. Båda dessa kräver att du använder ett alternativt objekt som spec. Tack och lov stöder :func:`patch` detta - du kan helt enkelt skicka det alternativa objektet som *autospec*-argument::

source: >>> class Something: ... def __init__(self): ... self.a = 33 ... >>> class SomethingForTest(Something): ... a = 33 ... >>> p = patch('__main__.Something', autospec=SomethingForTest) >>> mock = p.start() >>> mock.a <NonCallableMagicMock name='Something.a' spec='int' id='...'>
sv: &gt;&gt;&gt; klass Något: ... def __init__(self): ... self.a = 33 ... &gt;&gt;&gt; klass SomethingForTest(Something): ... a = 33 ... &gt;&gt;&gt; p = patch('__main__.Something', autospec=SomethingForTest) &gt;&gt;&gt; mock = p.start() &gt;&gt;&gt; mock.a <NonCallableMagicMock name='Something.a' spec='int' id='...'>

source: This only applies to classes or already instantiated objects. Calling a mocked class to create a mock instance *does not* create a real instance. It is only attribute lookups - along with calls to :func:`dir` - that are done.
sv: Detta gäller endast klasser eller redan instantierade objekt. Att anropa en mockad klass för att skapa en mockad instans *skapar* inte en riktig instans. Det är bara attributuppslagningar - tillsammans med anrop till :func:`dir` - som görs.

source: Sealing mocks
sv: Försegling av mockar

source: Seal will disable the automatic creation of mocks when accessing an attribute of the mock being sealed or any of its attributes that are already mocks recursively.
sv: Seal inaktiverar det automatiska skapandet av mockar vid åtkomst till ett attribut för den mock som förseglas eller något av dess attribut som redan är mockar rekursivt.

source: If a mock instance with a name or a spec is assigned to an attribute it won't be considered in the sealing chain. This allows one to prevent seal from fixing part of the mock object. ::
sv: Om en låtsasinstans med ett namn eller en specifikation tilldelas ett attribut kommer den inte att beaktas i tätningskedjan. Detta gör att man kan förhindra att seal fixar en del av mock-objektet:

source: >>> mock = Mock() >>> mock.submock.attribute1 = 2 >>> mock.not_submock = mock.Mock(name="sample_name") >>> seal(mock) >>> mock.new_attribute # This will raise AttributeError. >>> mock.submock.attribute2 # This will raise AttributeError. >>> mock.not_submock.attribute2 # This won't raise.
sv: >>> mock = Mock() >>> mock.submock.attribut1 = 2 >>> mock.not_submock = mock.Mock(name="sample_name") >>> seal(mock) >>> mock.new_attribute # Detta kommer att ge upphov till AttributeError. >>> mock.submock.attribute2 # Detta kommer att ge upphov till AttributeError. >>> mock.not_submock.attribute2 # Detta kommer inte att ge upphov till.

source: Order of precedence of :attr:`!side_effect`, :attr:`!return_value` and *wraps*
sv: Prioritetsordning för :attr:`!side_effect`, :attr:`!return_value` och *wraps*

source: The order of their precedence is:
sv: Ordningen på deras företräde är:
