Repository: yeager/python-docs-sv
Catalog: library/unittest.mock.po
Languages: sv

source: If :attr:`~Mock.side_effect` is set then it will be called after the call has been recorded, so if :attr:`!side_effect` raises an exception the call is still recorded.
sv: Om :attr:`~Mock.side_effect` är inställd kommer den att anropas efter att anropet har spelats in, så om :attr:`!side_effect` ger upphov till ett undantag spelas anropet fortfarande in.

source: The simplest way to make a mock raise an exception when called is to make :attr:`~Mock.side_effect` an exception class or instance:
sv: Det enklaste sättet att få en mock att skapa ett undantag när den anropas är att göra :attr:`~Mock.side_effect` till en undantagsklass eller -instans:

source: If :attr:`~Mock.side_effect` is a function then whatever that function returns is what calls to the mock return. The :attr:`!side_effect` function is called with the same arguments as the mock. This allows you to vary the return value of the call dynamically, based on the input:
sv: Om :attr:`~Mock.side_effect` är en funktion så är det som funktionen returnerar det som anrop till mock returnerar. Funktionen :attr:`!side_effect` anropas med samma argument som mock. Detta gör att du kan variera anropets returvärde dynamiskt, baserat på indata:

source: If you want the mock to still return the default return value (a new mock), or any set return value, then there are two ways of doing this. Either return :attr:`~Mock.return_value` from inside :attr:`~Mock.side_effect`, or return :data:`DEFAULT`:
sv: Om du vill att mocken fortfarande ska returnera standardreturvärdet (en ny mock), eller något inställt returvärde, finns det två sätt att göra detta. Antingen returnera :attr:`~Mock.return_value` från insidan av :attr:`~Mock.side_effect`, eller returnera :data:`DEFAULT`:

source: To remove a :attr:`~Mock.side_effect`, and return to the default behaviour, set the :attr:`!side_effect` to ``None``:
sv: För att ta bort en :attr:`~Mock.side_effect` och återgå till standardbeteendet, sätt :attr:`!side_effect` till ``None``:

source: The :attr:`~Mock.side_effect` can also be any iterable object. Repeated calls to the mock will return values from the iterable (until the iterable is exhausted and a :exc:`StopIteration` is raised):
sv: :attr:`~Mock.side_effect` kan också vara ett valfritt iterabelt objekt. Upprepade anrop till mocken kommer att returnera värden från iterabeln (tills iterabeln är uttömd och en :exc:`StopIteration` utlöses):

source: If any members of the iterable are exceptions they will be raised instead of returned::
sv: Om några medlemmar i iterable är undantag kommer de att tas upp istället för returneras::

source: >>> iterable = (33, ValueError, 66) >>> m = MagicMock(side_effect=iterable) >>> m() 33 >>> m() Traceback (most recent call last): ... ValueError >>> m() 66
sv: >>> iterable = (33, ValueError, 66) >>> m = MagicMock(side_effect=iterable) >>> m() 33 >>> m() Traceback (senaste anropet senast): ... VärdeFel >>> m() 66

source: Deleting Attributes
sv: Radering av attribut

source: Mock objects create attributes on demand. This allows them to pretend to be objects of any type.
sv: Mock-objekt skapar attribut på begäran. Detta gör att de kan låtsas vara objekt av vilken typ som helst.

source: You may want a mock object to return ``False`` to a :func:`hasattr` call, or raise an :exc:`AttributeError` when an attribute is fetched. You can do this by providing an object as a :attr:`!spec` for a mock, but that isn't always convenient.
sv: Du kanske vill att ett mock-objekt ska returnera ``False`` till ett :func:`hasattr`-anrop, eller ge upphov till ett :exc:`AttributeError` när ett attribut hämtas. Du kan göra detta genom att tillhandahålla ett objekt som en :attr:`!spec` för en mock, men det är inte alltid bekvämt.

source: You "block" attributes by deleting them. Once deleted, accessing an attribute will raise an :exc:`AttributeError`.
sv: Du "blockerar" attribut genom att radera dem. När ett attribut har tagits bort kommer åtkomst till det att ge upphov till ett :exc:`AttributeError`.

source: Mock names and the name attribute
sv: Låtsasnamn och name-attributet

source: Since "name" is an argument to the :class:`Mock` constructor, if you want your mock object to have a "name" attribute you can't just pass it in at creation time. There are two alternatives. One option is to use :meth:`~Mock.configure_mock`::
sv: Eftersom "name" är ett argument till :class:`Mock`-konstruktören kan du inte bara skicka in det vid skapandet om du vill att ditt mock-objekt ska ha ett "name"-attribut. Det finns två alternativ. Ett alternativ är att använda :meth:`~Mock.configure_mock`::

source: >>> mock = MagicMock() >>> mock.configure_mock(name='my_name') >>> mock.name 'my_name'
sv: >>> mock = MagicMock() >>> mock.configure_mock(name='mitt_namn') >>> mock.namn 'mitt_namn'

source: A simpler option is to simply set the "name" attribute after mock creation::
sv: Ett enklare alternativ är att helt enkelt ställa in attributet "name" efter skapandet av mock::

source: Attaching Mocks as Attributes
sv: Bifoga mocks som attribut

source: When you attach a mock as an attribute of another mock (or as the return value) it becomes a "child" of that mock. Calls to the child are recorded in the :attr:`~Mock.method_calls` and :attr:`~Mock.mock_calls` attributes of the parent. This is useful for configuring child mocks and then attaching them to the parent, or for attaching mocks to a parent that records all calls to the children and allows you to make assertions about the order of calls between mocks:
sv: När du lägger till en mock som ett attribut till en annan mock (eller som returvärde) blir den ett "barn" till den mocken. Anrop till barnet registreras i attributen :attr:`~Mock.method_calls` och :attr:`~Mock.mock_calls` hos föräldern. Detta är användbart för att konfigurera barnsocklar och sedan koppla dem till föräldern, eller för att kopplaocklar till en förälder som registrerar alla anrop till barnen och låter dig göra påståenden om anropsordningen mellanocklar:

source: The exception to this is if the mock has a name. This allows you to prevent the "parenting" if for some reason you don't want it to happen.
sv: Undantaget till detta är om mock har ett namn. Detta gör att du kan förhindra "föräldraskapet" om du av någon anledning inte vill att det ska hända.

source: Mocks created for you by :func:`patch` are automatically given names. To attach mocks that have names to a parent you use the :meth:`~Mock.attach_mock` method::
sv: Mockar som skapas åt dig av :func:`patch` får automatiskt namn. För att koppla mockar som har namn till en förälder använder du metoden :meth:`~Mock.attach_mock`::

source: >>> thing1 = object() >>> thing2 = object() >>> parent = MagicMock() >>> with patch('__main__.thing1', return_value=None) as child1: ... with patch('__main__.thing2', return_value=None) as child2: ... parent.attach_mock(child1, 'child1') ... parent.attach_mock(child2, 'child2') ... child1('one') ... child2('two') ... >>> parent.mock_calls [call.child1('one'), call.child2('two')]
sv: >>> sak1 = objekt() >>> sak2 = objekt() >>> förälder = MagicMock() >>> med patch('__main__.thing1', return_value=None) som barn1: ... med patch('__main__.thing2', return_value=None) som barn2: ... parent.attach_mock(child1, 'child1') ... förälder.attach_mock(barn2, 'barn2') ... barn1('ett') ... barn2('två') ... >>> förälder.mock_calls [call.child1('ett'), call.child2('två')]

source: The only exceptions are magic methods and attributes (those that have leading and trailing double underscores). Mock doesn't create these but instead raises an :exc:`AttributeError`. This is because the interpreter will often implicitly request these methods, and gets *very* confused to get a new Mock object when it expects a magic method. If you need magic method support see :ref:`magic methods <magic-methods>`.
sv: De enda undantagen är magiska metoder och attribut (de som har inledande och avslutande dubbla understrykningar). Mock skapar inte dessa utan ger istället upphov till ett :exc:`AttributeError`. Detta beror på att tolken ofta implicit begär dessa metoder, och blir *mycket* förvirrad av att få ett nytt Mock-objekt när den förväntar sig en magisk metod. Om du behöver stöd för magiska metoder, se :ref:``magiska metoder <magic-methods>``.

source: The patchers
sv: Lapparna

source: The patch decorators are used for patching objects only within the scope of the function they decorate. They automatically handle the unpatching for you, even if exceptions are raised. All of these functions can also be used in with statements or as class decorators.
sv: Patch-dekoratorerna används för att patcha objekt endast inom ramen för den funktion som de dekorerar. De hanterar automatiskt avpatchningen åt dig, även om undantag uppstår. Alla dessa funktioner kan också användas i with-satser eller som klassdekoratorer.

source: patch
sv: lappa

source: The key is to do the patching in the right namespace. See the section `where to patch`_.
sv: Nyckeln är att göra patchningen i rätt namnrymd. Se avsnittet `Var ska man patcha`_.

source: :func:`patch` acts as a function decorator, class decorator or a context manager. Inside the body of the function or with statement, the *target* is patched with a *new* object. When the function/with statement exits the patch is undone.
sv: :func:`patch` fungerar som en funktionsdekorator, klassdekorator eller en kontexthanterare. Inuti funktionens kropp eller med-satsen patchas *målet* med ett *nytt* objekt. När funktionen/med-satsen avslutas ångras patchen.

source: If *new* is omitted, then the target is replaced with an :class:`AsyncMock` if the patched object is an async function or a :class:`MagicMock` otherwise. If :func:`patch` is used as a decorator and *new* is omitted, the created mock is passed in as an extra argument to the decorated function. If :func:`patch` is used as a context manager the created mock is returned by the context manager.
sv: Om *new* utelämnas, ersätts målet med en :class:`AsyncMock` om det patchade objektet är en asynkron funktion eller en :class:`MagicMock` annars. Om :func:`patch` används som en dekorator och *new* utelämnas, skickas den skapade mocken in som ett extra argument till den dekorerade funktionen. Om :func:`patch` används som en kontexthanterare returneras den skapade attrappen av kontexthanteraren.

source: *target* should be a string in the form ``'package.module.ClassName'``. The *target* is imported and the specified object replaced with the *new* object, so the *target* must be importable from the environment you are calling :func:`patch` from. The target is imported when the decorated function is executed, not at decoration time.
sv: *target* ska vara en sträng i formen ``'package.module.ClassName'``. *target* importeras och det angivna objektet ersätts med det *nya* objektet, så *target* måste vara importerbart från den miljö du anropar :func:`patch` från. Målet importeras när den dekorerade funktionen exekveras, inte vid dekorationstillfället.

source: The *spec* and *spec_set* keyword arguments are passed to the :class:`MagicMock` if patch is creating one for you.
sv: Nyckelordsargumenten *spec* och *spec_set* skickas till :class:`MagicMock` om patch skapar en åt dig.

source: In addition you can pass ``spec=True`` or ``spec_set=True``, which causes patch to pass in the object being mocked as the spec/spec_set object.
sv: Dessutom kan du skicka ``spec=True`` eller ``spec_set=True``, vilket gör att patch skickar in objektet som mockas som spec/spec_set-objektet.

source: *new_callable* allows you to specify a different class, or callable object, that will be called to create the *new* object. By default :class:`AsyncMock` is used for async functions and :class:`MagicMock` for the rest.
sv: *new_callable* låter dig ange en annan klass, eller ett anropbart objekt, som kommer att anropas för att skapa det *nya* objektet. Som standard används :class:`AsyncMock` för asynkrona funktioner och :class:`MagicMock` för resten.

source: A more powerful form of *spec* is *autospec*. If you set ``autospec=True`` then the mock will be created with a spec from the object being replaced. All attributes of the mock will also have the spec of the corresponding attribute of the object being replaced. Methods and functions being mocked will have their arguments checked and will raise a :exc:`TypeError` if they are called with the wrong signature. For mocks replacing a class, their return value (the 'instance') will have the same spec as the class. See the :func:`create_autospec` function and :ref:`auto-speccing`.
sv: En mer kraftfull form av *spec* är *autospec*. Om du anger ``autospec=True`` kommer mock att skapas med en specifikation från det objekt som ersätts. Alla attribut i mocken kommer också att ha specifikationen för motsvarande attribut i det objekt som ersätts. Metoder och funktioner som mockas kommer att få sina argument kontrollerade och kommer att ge upphov till ett :exc:`TypeError` om de anropas med fel signatur. För mockar som ersätter en klass kommer deras returvärde (instansen) att ha samma specifikation som klassen. Se funktionen :func:`create_autospec` och :ref:`auto-speccing`.

source: Instead of ``autospec=True`` you can pass ``autospec=some_object`` to use an arbitrary object as the spec instead of the one being replaced.
sv: Istället för ``autospec=True`` kan du skicka ``autospec=some_object`` för att använda ett godtyckligt objekt som specifikation istället för det som ersätts.

source: By default :func:`patch` will fail to replace attributes that don't exist. If you pass in ``create=True``, and the attribute doesn't exist, patch will create the attribute for you when the patched function is called, and delete it again after the patched function has exited. This is useful for writing tests against attributes that your production code creates at runtime. It is off by default because it can be dangerous. With it switched on you can write passing tests against APIs that don't actually exist!
sv: Som standard kommer :func:`patch` att misslyckas med att ersätta attribut som inte existerar. Om du skickar in ``create=True``, och attributet inte existerar, kommer patch att skapa attributet åt dig när den patchade funktionen anropas, och ta bort det igen efter att den patchade funktionen har avslutats. Detta är användbart för att skriva tester mot attribut som din produktionskod skapar vid körning. Det är avstängt som standard eftersom det kan vara farligt. Med den påslagen kan du skriva passande tester mot API:er som faktiskt inte existerar!

source: If you are patching builtins in a module then you don't need to pass ``create=True``, it will be added by default.
sv: Om du patchar inbyggda program i en modul behöver du inte ange ``create=True``, det läggs till som standard.

source: Patch can be used as a :class:`~unittest.TestCase` class decorator. It works by decorating each test method in the class. This reduces the boilerplate code when your test methods share a common patchings set. :func:`patch` finds tests by looking for method names that start with ``patch.TEST_PREFIX``. By default this is ``'test'``, which matches the way :mod:`unittest` finds tests. You can specify an alternative prefix by setting ``patch.TEST_PREFIX``.
sv: Patch kan användas som en :class:`~unittest.TestCase` klassdekorator. Den fungerar genom att dekorera varje testmetod i klassen. Detta minskar boilerplate-koden när dina testmetoder delar en gemensam patchningsuppsättning. :func:`patch` hittar tester genom att leta efter metodnamn som börjar med ``patch.TEST_PREFIX``. Som standard är detta ``'test'``, vilket matchar det sätt som :mod:`unittest` hittar tester på. Du kan ange ett alternativt prefix genom att ställa in ``patch.TEST_PREFIX``.

source: Patch can be used as a context manager, with the with statement. Here the patching applies to the indented block after the with statement. If you use "as" then the patched object will be bound to the name after the "as"; very useful if :func:`patch` is creating a mock object for you.
sv: Patch kan användas som en kontexthanterare, med with-satsen. Här gäller patchen det indragna blocket efter with-satsen. Om du använder "as" kommer det patchade objektet att bindas till namnet efter "as"; mycket användbart om :func:`patch` skapar ett mock-objekt åt dig.

source: :func:`patch` takes arbitrary keyword arguments. These will be passed to :class:`AsyncMock` if the patched object is asynchronous, to :class:`MagicMock` otherwise or to *new_callable* if specified.
sv: :func:`patch` tar godtyckliga nyckelordsargument. Dessa kommer att skickas till :class:`AsyncMock` om det patchade objektet är asynkront, till :class:`MagicMock` annars eller till *new_callable* om det anges.

source: ``patch.dict(...)``, ``patch.multiple(...)`` and ``patch.object(...)`` are available for alternate use-cases.
sv: ``patch.dict(...)``, ``patch.multiple(...)`` och ``patch.object(...)`` finns tillgängliga för alternativa användningsfall.

source: :func:`patch` as function decorator, creating the mock for you and passing it into the decorated function::
sv: :func:`patch` som funktionsdekorator, skapar mock åt dig och skickar den till den dekorerade funktionen::

source: >>> @patch('__main__.SomeClass') ... def function(normal_argument, mock_class): ... print(mock_class is SomeClass) ... >>> function(None) True
sv: >>> @patch('__main__.SomeClass') ... def function(normal_argument, mock_class): ... print(mock_class är SomeClass) ... >>> function(None) Sant

source: Patching a class replaces the class with a :class:`MagicMock` *instance*. If the class is instantiated in the code under test then it will be the :attr:`~Mock.return_value` of the mock that will be used.
sv: Patching av en klass ersätter klassen med en :class:`MagicMock` *instans*. Om klassen instansieras i koden som testas kommer det att vara :attr:`~Mock.return_value` i mocken som kommer att användas.

source: If the class is instantiated multiple times you could use :attr:`~Mock.side_effect` to return a new mock each time. Alternatively you can set the *return_value* to be anything you want.
sv: Om klassen instansieras flera gånger kan du använda :attr:`~Mock.side_effect` för att returnera en ny mock varje gång. Alternativt kan du ställa in *return_value* till att vara vad du vill.

source: To configure return values on methods of *instances* on the patched class you must do this on the :attr:`~Mock.return_value`. For example::
sv: För att konfigurera returvärden på metoder för *instances* på den patchade klassen måste du göra detta på :attr:`~Mock.return_value`. Till exempel::

source: >>> class Class: ... def method(self): ... pass ... >>> with patch('__main__.Class') as MockClass: ... instance = MockClass.return_value ... instance.method.return_value = 'foo' ... assert Class() is instance ... assert Class().method() == 'foo' ...
sv: >>> klass Klass Klass: ... def method(self): ... pass ... >>> med patch('__main__.Class') som MockClass: ... instance = MockClass.return_value ... instance.method.return_value = 'foo' ... assert Class() är instans ... assert Class().method() == 'foo' ...

source: If you use *spec* or *spec_set* and :func:`patch` is replacing a *class*, then the return value of the created mock will have the same spec. ::
sv: Om du använder *spec* eller *spec_set* och :func:`patch` ersätter en *class*, kommer returvärdet för den skapade mocken att ha samma spec. ::

source: >>> Original = Class >>> patcher = patch('__main__.Class', spec=True) >>> MockClass = patcher.start() >>> instance = MockClass() >>> assert isinstance(instance, Original) >>> patcher.stop()
sv: >>> Original = Klass >>> patcher = patch('__main__.Class', spec=True) >>> MockClass = patcher.start() >>> instans = MockClass() >>> assert isinstance(instans, Original) >>> patcher.stop()

source: The *new_callable* argument is useful where you want to use an alternative class to the default :class:`MagicMock` for the created mock. For example, if you wanted a :class:`NonCallableMock` to be used::
sv: Argumentet *new_callable* är användbart om du vill använda en alternativ klass till standardklassen :class:`MagicMock` för den skapade mocken. Till exempel, om du vill att en :class:`NonCallableMock` ska användas::

source: >>> thing = object() >>> with patch('__main__.thing', new_callable=NonCallableMock) as mock_thing: ... assert thing is mock_thing ... thing() ... Traceback (most recent call last): ... TypeError: 'NonCallableMock' object is not callable
sv: >>> sak = objekt() >>> med patch('__main__.thing', new_callable=NonCallableMock) som mock_thing: ... assert thing är mock_thing ... sak() ... Traceback (senaste anropet senast): ... TypeError: Objektet 'NonCallableMock' är inte anropsbart

source: Another use case might be to replace an object with an :class:`io.StringIO` instance::
sv: Ett annat användningsfall kan vara att ersätta ett objekt med en :class:`io.StringIO`-instans::

source: When :func:`patch` is creating a mock for you, it is common that the first thing you need to do is to configure the mock. Some of that configuration can be done in the call to patch. Any arbitrary keywords you pass into the call will be used to set attributes on the created mock::
sv: När :func:`patch` skapar en mock åt dig är det vanligt att det första du behöver göra är att konfigurera mocken. En del av den konfigurationen kan göras i anropet till patch. Alla godtyckliga nyckelord som du skickar in i anropet kommer att användas för att ställa in attribut på den skapade mock::

source: >>> patcher = patch('__main__.thing', first='one', second='two') >>> mock_thing = patcher.start() >>> mock_thing.first 'one' >>> mock_thing.second 'two'
sv: >>> patcher = patch('__main__.thing', första='ett', andra='två') >>> mock_thing = patcher.start() >>> mock_thing.first 'ett' >>> mock_thing.andra 'två'

source: As well as attributes on the created mock attributes, like the :attr:`~Mock.return_value` and :attr:`~Mock.side_effect`, of child mocks can also be configured. These aren't syntactically valid to pass in directly as keyword arguments, but a dictionary with these as keys can still be expanded into a :func:`patch` call using ``**``::
sv: Förutom attribut på den skapade mocken kan även attribut, som :attr:`~Mock.return_value` och :attr:`~Mock.side_effect`, för underliggande mockar konfigureras. Dessa är inte syntaktiskt giltiga att skicka in direkt som nyckelordsargument, men en dictionary med dessa som nycklar kan ändå expanderas till ett :func:`patch`-anrop med hjälp av ``**``::

source: >>> config = {'method.return_value': 3, 'other.side_effect': KeyError} >>> patcher = patch('__main__.thing', **config) >>> mock_thing = patcher.start() >>> mock_thing.method() 3 >>> mock_thing.other() Traceback (most recent call last): ... KeyError
sv: >>> config = {'method.return_value': 3, 'other.side_effect': KeyError} >>> patcher = patch('__main__.thing', **config) >>> mock_thing = patcher.start() >>> mock_thing.method() 3 >>> mock_thing.other() Traceback (senaste anropet senast): ... NyckelFel

source: By default, attempting to patch a function in a module (or a method or an attribute in a class) that does not exist will fail with :exc:`AttributeError`::
sv: Som standard kommer försök att patcha en funktion i en modul (eller en metod eller ett attribut i en klass) som inte finns att misslyckas med :exc:`AttributeError`::
