Repository: yeager/python-docs-sv
Catalog: library/unittest.mock-examples.po
Languages: sv

source: An alternative approach is to create a subclass of :class:`Mock` or :class:`MagicMock` that copies (using :func:`copy.deepcopy`) the arguments. Here's an example implementation:
sv: Ett alternativt tillvägagångssätt är att skapa en subklass av :class:`Mock` eller :class:`MagicMock` som kopierar (med :func:`copy.deepcopy`) argumenten. Här är ett exempel på en implementation:

source: When you subclass ``Mock`` or ``MagicMock`` all dynamically created attributes, and the ``return_value`` will use your subclass automatically. That means all children of a ``CopyingMock`` will also have the type ``CopyingMock``.
sv: När du subklassar ``Mock`` eller ``MagicMock`` kommer alla dynamiskt skapade attribut och ``return_value`` att använda din subklass automatiskt. Det betyder att alla barn till en ``CopyingMock`` också kommer att ha typen ``CopyingMock``.

source: Nesting Patches
sv: Nästande lappar

source: Using patch as a context manager is nice, but if you do multiple patches you can end up with nested with statements indenting further and further to the right::
sv: Att använda patch som en kontexthanterare är trevligt, men om du gör flera patchar kan du sluta med nästlade med uttalanden som indenteras längre och längre åt höger::

source: >>> class MyTest(unittest.TestCase): ... ... def test_foo(self): ... with patch('mymodule.Foo') as mock_foo: ... with patch('mymodule.Bar') as mock_bar: ... with patch('mymodule.Spam') as mock_spam: ... assert mymodule.Foo is mock_foo ... assert mymodule.Bar is mock_bar ... assert mymodule.Spam is mock_spam ... >>> original = mymodule.Foo >>> MyTest('test_foo').test_foo() >>> assert mymodule.Foo is original
sv: >>> klass MyTest(unittest.TestCase): ... ... def test_foo(self): ... med patch('mymodule.Foo') som mock_foo: ... med patch('mymodule.Bar') som mock_bar: ... med patch('mymodule.Spam') som mock_spam: ... assert mymodule.Foo är mock_foo ... assert mymodule.Bar är mock_bar ... assert mymodule.Spam är mock_spam ... >>> original = mymodule.Foo >>> MyTest('test_foo').test_foo() >>> assert mymodule.Foo är original

source: With unittest ``cleanup`` functions and the :ref:`start-and-stop` we can achieve the same effect without the nested indentation. A simple helper method, ``create_patch``, puts the patch in place and returns the created mock for us::
sv: Med unittest ``cleanup`` funktioner och :ref:``start-and-stop`` kan vi uppnå samma effekt utan den nästlade indragningen. En enkel hjälpmetod, ``create_patch``, sätter patchen på plats och returnerar den skapade mocken för oss::

source: >>> class MyTest(unittest.TestCase): ... ... def create_patch(self, name): ... patcher = patch(name) ... thing = patcher.start() ... self.addCleanup(patcher.stop) ... return thing ... ... def test_foo(self): ... mock_foo = self.create_patch('mymodule.Foo') ... mock_bar = self.create_patch('mymodule.Bar') ... mock_spam = self.create_patch('mymodule.Spam') ... ... assert mymodule.Foo is mock_foo ... assert mymodule.Bar is mock_bar ... assert mymodule.Spam is mock_spam ... >>> original = mymodule.Foo >>> MyTest('test_foo').run() >>> assert mymodule.Foo is original
sv: >>> klass MyTest(unittest.TestCase): ... ... def create_patch(self, name): ... patcher = patch(name) ... sak = patcher.start() ... self.addCleanup(patcher.stop) ... returnera sak ... ... def test_foo(self): ... mock_foo = self.create_patch('mymodule.Foo') ... mock_bar = self.create_patch('mymodule.Bar') ... mock_spam = self.create_patch('mymodule.Spam') ... ... assert mymodule.Foo är mock_foo ... assert mymodule.Bar är mock_bar ... assert mymodule.Spam är mock_spam ... >>> original = mymodule.Foo >>> MyTest('test_foo').run() >>> assert mymodule.Foo är original

source: Mocking a dictionary with MagicMock
sv: Mocka en ordbok med MagicMock

source: You may want to mock a dictionary, or other container object, recording all access to it whilst having it still behave like a dictionary.
sv: Du kanske vill låtsas vara en ordbok eller ett annat containerobjekt och registrera all åtkomst till det samtidigt som det fortfarande beter sig som en ordbok.

source: We can do this with :class:`MagicMock`, which will behave like a dictionary, and using :data:`~Mock.side_effect` to delegate dictionary access to a real underlying dictionary that is under our control.
sv: Vi kan göra detta med :class:`MagicMock`, som kommer att bete sig som en ordbok, och använda :data:`~Mock.side_effect` för att delegera ordboksåtkomst till en verklig underliggande ordbok som är under vår kontroll.

source: When the :meth:`~object.__getitem__` and :meth:`~object.__setitem__` methods of our ``MagicMock`` are called (normal dictionary access) then ``side_effect`` is called with the key (and in the case of ``__setitem__`` the value too). We can also control what is returned.
sv: När metoderna :meth:`~object.__getitem__` och :meth:`~object.__setitem__` i vår ``MagicMock`` anropas (normal dictionary access) så anropas ``side_effect`` med nyckeln (och i fallet ``__setitem__`` även värdet). Vi kan också kontrollera vad som returneras.

source: After the ``MagicMock`` has been used we can use attributes like :data:`~Mock.call_args_list` to assert about how the dictionary was used:
sv: Efter att ``MagicMock`` har använts kan vi använda attribut som :data:`~Mock.call_args_list` för att hävda hur ordlistan användes:

source: An alternative to using ``MagicMock`` is to use ``Mock`` and *only* provide the magic methods you specifically want:
sv: Ett alternativ till att använda ``MagicMock`` är att använda ``Mock`` och *endast* tillhandahålla de magiska metoder som du specifikt vill ha:

source: A *third* option is to use ``MagicMock`` but passing in ``dict`` as the *spec* (or *spec_set*) argument so that the ``MagicMock`` created only has dictionary magic methods available:
sv: Ett *tredje* alternativ är att använda ``MagicMock`` men skicka in ``dict`` som *spec* (eller *spec_set*) argument så att den ``MagicMock`` som skapas endast har magiska metoder för ordböcker tillgängliga:

source: With these side effect functions in place, the ``mock`` will behave like a normal dictionary but recording the access. It even raises a :exc:`KeyError` if you try to access a key that doesn't exist.
sv: Med dessa bieffektsfunktioner på plats kommer ``mock`` att bete sig som en vanlig ordbok men registrera åtkomsten. Den ger till och med upphov till ett :exc:`KeyError` om du försöker komma åt en nyckel som inte finns.

source: After it has been used you can make assertions about the access using the normal mock methods and attributes:
sv: När den har använts kan du göra påståenden om åtkomsten med hjälp av de vanliga mock-metoderna och -attributen:

source: Mock subclasses and their attributes
sv: Mock-subklasser och deras attribut

source: There are various reasons why you might want to subclass :class:`Mock`. One reason might be to add helper methods. Here's a silly example:
sv: Det finns olika anledningar till varför du kanske vill underklassa :class:`Mock`. En anledning kan vara att lägga till hjälpmetoder. Här är ett fånigt exempel:

source: The standard behaviour for ``Mock`` instances is that attributes and the return value mocks are of the same type as the mock they are accessed on. This ensures that ``Mock`` attributes are ``Mocks`` and ``MagicMock`` attributes are ``MagicMocks`` [#]_. So if you're subclassing to add helper methods then they'll also be available on the attributes and return value mock of instances of your subclass.
sv: Standardbeteendet för ``Mock``-instanser är att attribut och returvärden är av samma typ som den mock de är åtkomliga på. Detta säkerställer att ``Mock``-attribut är ``Mocks`` och ``MagicMock``-attribut är ``MagicMocks`` [#]_. Så om du subklassar för att lägga till hjälpmetoder så kommer de också att vara tillgängliga på attributen och returvärdet mock av instanser av din subklass.

source: Sometimes this is inconvenient. For example, `one user <https://code.google.com/archive/p/mock/issues/105>`_ is subclassing mock to created a `Twisted adaptor <https://twisted.org/documents/11.0.0/api/twisted.python.components.html>`_. Having this applied to attributes too actually causes errors.
sv: Ibland är detta obekvämt. Till exempel, `en användare <https://code.google.com/archive/p/mock/issues/105>`_ subklassar mock för att skapa en `Twisted adapter <https://twisted.org/documents/11.0.0/api/twisted.python.components.html>`_. Att ha detta tillämpat på attribut också orsakar faktiskt fel.

source: ``Mock`` (in all its flavours) uses a method called ``_get_child_mock`` to create these "sub-mocks" for attributes and return values. You can prevent your subclass being used for attributes by overriding this method. The signature is that it takes arbitrary keyword arguments (``**kwargs``) which are then passed onto the mock constructor:
sv: ``Mock`` (i alla dess varianter) använder en metod som heter ``_get_child_mock`` för att skapa dessa "sub-mocks" för attribut och returvärden. Du kan förhindra att din subklass används för attribut genom att åsidosätta den här metoden. Signaturen är att den tar godtyckliga nyckelordsargument (``**kwargs``) som sedan skickas till mock-konstruktören:

source: An exception to this rule are the non-callable mocks. Attributes use the callable variant because otherwise non-callable mocks couldn't have callable methods.
sv: Ett undantag från denna regel är de icke-kallbara mockarna. Attributen använder den anropsbara varianten eftersom icke anropsbara mocks annars inte skulle kunna ha anropsbara metoder.

source: Mocking imports with patch.dict
sv: Mocking-import med patch.dict

source: One situation where mocking can be hard is where you have a local import inside a function. These are harder to mock because they aren't using an object from the module namespace that we can patch out.
sv: En situation där mocking kan vara svårt är när du har en lokal import inuti en funktion. Dessa är svårare att mocka eftersom de inte använder ett objekt från modulens namnrymd som vi kan patcha ut.

source: Generally local imports are to be avoided. They are sometimes done to prevent circular dependencies, for which there is *usually* a much better way to solve the problem (refactor the code) or to prevent "up front costs" by delaying the import. This can also be solved in better ways than an unconditional local import (store the module as a class or module attribute and only do the import on first use).
sv: I allmänhet bör lokal import undvikas. De görs ibland för att förhindra cirkulära beroenden, för vilka det *vanligtvis* finns ett mycket bättre sätt att lösa problemet (refaktorisera koden) eller för att förhindra "up front-kostnader" genom att fördröja importen. Detta kan också lösas på bättre sätt än en ovillkorlig lokal import (lagra modulen som ett klass- eller modulattribut och gör bara importen vid första användningen).

source: That aside there is a way to use ``mock`` to affect the results of an import. Importing fetches an *object* from the :data:`sys.modules` dictionary. Note that it fetches an *object*, which need not be a module. Importing a module for the first time results in a module object being put in ``sys.modules``, so usually when you import something you get a module back. This need not be the case however.
sv: Bortsett från det finns det ett sätt att använda ``mock`` för att påverka resultatet av en import. Import hämtar ett *objekt* från ordlistan :data:`sys.modules`. Observera att det hämtar ett *objekt*, som inte behöver vara en modul. Om du importerar en modul för första gången resulterar det i att ett modulobjekt läggs in i ``sys.modules``, så när du importerar något får du vanligtvis en modul tillbaka. Detta behöver dock inte vara fallet.

source: This means you can use :func:`patch.dict` to *temporarily* put a mock in place in :data:`sys.modules`. Any imports whilst this patch is active will fetch the mock. When the patch is complete (the decorated function exits, the with statement body is complete or ``patcher.stop()`` is called) then whatever was there previously will be restored safely.
sv: Detta innebär att du kan använda :func:`patch.dict` för att *tillfälligt* sätta en mock på plats i :data:`sys.modules`. Alla importer medan den här patchen är aktiv kommer att hämta mocken. När patchen är klar (den dekorerade funktionen avslutas, with-satsens kropp är klar eller ``patcher.stop()`` anropas) kommer det som fanns där tidigare att återställas på ett säkert sätt.

source: Here's an example that mocks out the 'fooble' module.
sv: Här är ett exempel som låtsas vara modulen "fooble".

source: As you can see the ``import fooble`` succeeds, but on exit there is no 'fooble' left in :data:`sys.modules`.
sv: Som du kan se lyckas ``import fooble``, men vid avslut finns det ingen `fooble` kvar i :data:`sys.modules`.

source: This also works for the ``from module import name`` form:
sv: Detta fungerar också för formuläret ``från modulens importnamn``:

source: With slightly more work you can also mock package imports:
sv: Med lite mer arbete kan du också mocka paketimport:

source: Tracking order of calls and less verbose call assertions
sv: Spårning av anropsordning och mindre verbala anropsutlåtanden

source: The :class:`Mock` class allows you to track the *order* of method calls on your mock objects through the :attr:`~Mock.method_calls` attribute. This doesn't allow you to track the order of calls between separate mock objects, however we can use :attr:`~Mock.mock_calls` to achieve the same effect.
sv: Klassen :class:`Mock` låter dig spåra *ordningen* på metodanropen på dina mock-objekt genom attributet :attr:`~Mock.method_calls`. Detta tillåter dig inte att spåra ordningen på anrop mellan separata mock-objekt, men vi kan använda :attr:`~Mock.mock_calls` för att uppnå samma effekt.

source: Because mocks track calls to child mocks in ``mock_calls``, and accessing an arbitrary attribute of a mock creates a child mock, we can create our separate mocks from a parent one. Calls to those child mock will then all be recorded, in order, in the ``mock_calls`` of the parent:
sv: Eftersom attrapper spårar anrop till barnattrapper i ``mock_calls``, och åtkomst till ett godtyckligt attribut hos en attrapp skapar en barnattrapp, kan vi skapa våra separata attrapper från en förälder. Anrop till dessa barn mock kommer då alla att registreras, i ordning, i ``mock_calls`` av föräldern:

source: We can then assert about the calls, including the order, by comparing with the ``mock_calls`` attribute on the manager mock:
sv: Vi kan sedan hävda anropen, inklusive ordningen, genom att jämföra med attributet ``mock_calls`` på manager mock:

source: If ``patch`` is creating, and putting in place, your mocks then you can attach them to a manager mock using the :meth:`~Mock.attach_mock` method. After attaching calls will be recorded in ``mock_calls`` of the manager. ::
sv: Om ``patch`` skapar, och sätter på plats, dina mockar så kan du koppla dem till en manager mock med hjälp av :meth:`~Mock.attach_mock` metoden. Efter att ha bifogat anrop kommer att spelas in i ``mock_calls`` av chefen. ::

source: >>> manager = MagicMock() >>> with patch('mymodule.Class1') as MockClass1: ... with patch('mymodule.Class2') as MockClass2: ... manager.attach_mock(MockClass1, 'MockClass1') ... manager.attach_mock(MockClass2, 'MockClass2') ... MockClass1().foo() ... MockClass2().bar() <MagicMock name='mock.MockClass1().foo()' id='...'> <MagicMock name='mock.MockClass2().bar()' id='...'> >>> manager.mock_calls [call.MockClass1(), call.MockClass1().foo(), call.MockClass2(), call.MockClass2().bar()]
sv: &gt;&gt;&gt; manager = MagicMock() &gt;&gt;&gt; med patch('mymodule.Class1') som MockClass1: ... med patch('mymodule.Class2') som MockClass2: ... manager.attach_mock(MockClass1, 'MockClass1') ... manager.attach_mock(MockClass2, 'MockClass2') ... MockClass1().foo() ... MockClass2().bar() <MagicMock name='mock.MockClass1().foo()' id='...'> <MagicMock name='mock.MockClass2().bar()' id='...'> &gt;&gt;&gt; manager.mock_calls [anrop.MockClass1(), anrop.MockClass1().foo(), anrop.MockClass2(), call.MockClass2().bar()]

source: If many calls have been made, but you're only interested in a particular sequence of them then an alternative is to use the :meth:`~Mock.assert_has_calls` method. This takes a list of calls (constructed with the :data:`call` object). If that sequence of calls are in :attr:`~Mock.mock_calls` then the assert succeeds.
sv: Om många anrop har gjorts, men du bara är intresserad av en viss sekvens av dem, är ett alternativ att använda metoden :meth:`~Mock.assert_has_calls`. Denna tar en lista med anrop (konstruerad med :data:`call`-objektet). Om den sekvensen av anrop finns i :attr:`~Mock.mock_calls` så lyckas assert.

source: Even though the chained call ``m.one().two().three()`` aren't the only calls that have been made to the mock, the assert still succeeds.
sv: Trots att de kedjade anropen ``m.one().two().three()`` inte är de enda anrop som har gjorts till mock, lyckas ändå assert.

source: Sometimes a mock may have several calls made to it, and you are only interested in asserting about *some* of those calls. You may not even care about the order. In this case you can pass ``any_order=True`` to ``assert_has_calls``:
sv: Ibland kan en mock ha flera anrop till sig, och du är bara intresserad av att försäkra dig om *vissa* av dessa anrop. Du kanske inte ens bryr dig om ordningen. I det här fallet kan du skicka ``any_order=True`` till ``assert_has_calls``:

source: More complex argument matching
sv: Mer komplex argumentmatchning

source: Using the same basic concept as :data:`ANY` we can implement matchers to do more complex assertions on objects used as arguments to mocks.
sv: Genom att använda samma grundläggande koncept som :data:`ANY` kan vi implementera matchare för att göra mer komplexa påståenden om objekt som används som argument till mocks.

source: Suppose we expect some object to be passed to a mock that by default compares equal based on object identity (which is the Python default for user defined classes). To use :meth:`~Mock.assert_called_with` we would need to pass in the exact same object. If we are only interested in some of the attributes of this object then we can create a matcher that will check these attributes for us.
sv: Anta att vi förväntar oss att ett objekt ska skickas till en mock som som standard jämför lika baserat på objektidentitet (vilket är Python-standarden för användardefinierade klasser). För att använda :meth:`~Mock.assert_called_with` skulle vi behöva skicka in exakt samma objekt. Om vi bara är intresserade av några av attributen för detta objekt kan vi skapa en matchare som kontrollerar dessa attribut åt oss.

source: You can see in this example how a 'standard' call to ``assert_called_with`` isn't sufficient:
sv: I det här exemplet kan du se hur ett "vanligt" anrop till ``assert_called_with`` inte är tillräckligt:

source: A comparison function for our ``Foo`` class might look something like this:
sv: En jämförelsefunktion för vår klass ``Foo`` kan se ut ungefär så här:

source: And a matcher object that can use comparison functions like this for its equality operation would look something like this:
sv: Och ett matchningsobjekt som kan använda jämförelsefunktioner som denna för sin jämlikhetsoperation skulle se ut ungefär så här:

source: Putting all this together:
sv: Om vi lägger ihop allt detta:

source: The ``Matcher`` is instantiated with our compare function and the ``Foo`` object we want to compare against. In ``assert_called_with`` the ``Matcher`` equality method will be called, which compares the object the mock was called with against the one we created our matcher with. If they match then ``assert_called_with`` passes, and if they don't an :exc:`AssertionError` is raised:
sv: ``Matcher`` instansieras med vår jämförelsefunktion och ``Foo``-objektet som vi vill jämföra mot. I ``assert_called_with`` kommer ``Matcher`` equality-metoden att anropas, vilket jämför objektet som mocken anropades med mot det som vi skapade vår matcher med. Om de matchar så går ``assert_called_with`` igenom, och om de inte gör det så uppstår ett :exc:`AssertionError`:

source: With a bit of tweaking you could have the comparison function raise the :exc:`AssertionError` directly and provide a more useful failure message.
sv: Med lite finjusteringar kan du få jämförelsefunktionen att lyfta :exc:`AssertionError` direkt och ge ett mer användbart felmeddelande.

source: As of version 1.5, the Python testing library `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ provides similar functionality, that may be useful here, in the form of its equality matcher (`hamcrest.library.integration.match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
sv: Från och med version 1.5 tillhandahåller Python-testbiblioteket `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ liknande funktionalitet, som kan vara användbar här, i form av dess jämlikhetsmatchning (`hamcrest.library.integration.match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
