Repository: yeager/python-docs-sv
Catalog: library/unittest.mock.po
Languages: sv

source: :mod:`!unittest.mock` --- mock object library
sv: :mod:`!unittest.mock` --- mock-objektbibliotek

source: **Source code:** :source:`Lib/unittest/mock.py`
sv: **Källkod:** :source:`Lib/unittest/mock.py`

source: :mod:`unittest.mock` is a library for testing in Python. It allows you to replace parts of your system under test with mock objects and make assertions about how they have been used.
sv: :mod:`unittest.mock` är ett bibliotek för testning i Python. Det låter dig ersätta delar av ditt system under test med mock-objekt och göra påståenden om hur de har använts.

source: :mod:`unittest.mock` provides a core :class:`Mock` class removing the need to create a host of stubs throughout your test suite. After performing an action, you can make assertions about which methods / attributes were used and arguments they were called with. You can also specify return values and set needed attributes in the normal way.
sv: :mod:`unittest.mock` tillhandahåller en grundläggande :class:`Mock`-klass som tar bort behovet av att skapa en mängd stubbar i hela din testsvit. När du har utfört en åtgärd kan du göra påståenden om vilka metoder/attribut som användes och vilka argument de anropades med. Du kan också ange returvärden och ställa in nödvändiga attribut på vanligt sätt.

source: Additionally, mock provides a :func:`patch` decorator that handles patching module and class level attributes within the scope of a test, along with :const:`sentinel` for creating unique objects. See the `quick guide`_ for some examples of how to use :class:`Mock`, :class:`MagicMock` and :func:`patch`.
sv: Dessutom tillhandahåller mock en :func:`patch`-dekorator som hanterar patchning av attribut på modul- och klassnivå inom ramen för ett test, tillsammans med :const:`sentinel` för att skapa unika objekt. Se `quick guide`_ för några exempel på hur man använder :class:`Mock`, :class:`MagicMock` och :func:`patch`.

source: Mock is designed for use with :mod:`unittest` and is based on the 'action -> assertion' pattern instead of 'record -> replay' used by many mocking frameworks.
sv: Mock är utformat för att användas med :mod:`unittest` och baseras på mönstret "action -> assertion" istället för "record -> replay" som används av många mocking-ramverk.

source: There is a backport of :mod:`unittest.mock` for earlier versions of Python, available as :pypi:`mock` on PyPI.
sv: Det finns en bakåtport av :mod:`unittest.mock` för tidigare versioner av Python, tillgänglig som :pypi:`mock` på PyPI.

source: Quick Guide
sv: Snabbguide

source: :class:`Mock` and :class:`MagicMock` objects create all attributes and methods as you access them and store details of how they have been used. You can configure them, to specify return values or limit what attributes are available, and then make assertions about how they have been used:
sv: objekten :class:`Mock` och :class:`MagicMock` skapar alla attribut och metoder när du använder dem och lagrar information om hur de har använts. Du kan konfigurera dem för att ange returvärden eller begränsa vilka attribut som är tillgängliga, och sedan göra påståenden om hur de har använts:

source: :attr:`~Mock.side_effect` allows you to perform side effects, including raising an exception when a mock is called:
sv: :attr:`~Mock.side_effect` gör att du kan utföra sidoeffekter, inklusive att skapa ett undantag när en mock anropas:

source: Mock has many other ways you can configure it and control its behaviour. For example the *spec* argument configures the mock to take its specification from another object. Attempting to access attributes or methods on the mock that don't exist on the spec will fail with an :exc:`AttributeError`.
sv: Mock har många andra sätt som du kan konfigurera och styra dess beteende på. Till exempel konfigurerar argumentet *spec* mock så att den hämtar sin specifikation från ett annat objekt. Försök att komma åt attribut eller metoder på mocken som inte finns i specifikationen kommer att misslyckas med ett :exc:`AttributeError`.

source: The :func:`patch` decorator / context manager makes it easy to mock classes or objects in a module under test. The object you specify will be replaced with a mock (or other object) during the test and restored when the test ends::
sv: Dekoratorn/kontexthanteraren :func:`patch` gör det enkelt att mocka klasser eller objekt i en modul som testas. Det objekt du anger kommer att ersättas med en mock (eller annat objekt) under testet och återställas när testet avslutas:

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``module.ClassName1`` is passed in first.
sv: När du nestar patch-dekoratorer skickas mockarna in till den dekorerade funktionen i samma ordning som de tillämpas (den normala *Python*-ordningen som dekoratorer tillämpas). Detta betyder nerifrån och upp, så i exemplet ovan skickas mocken för ``module.ClassName1`` in först.

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
sv: Med :func:`patch` är det viktigt att du patchar objekt i den namnrymd där de söks upp. Detta är normalt enkelt, men för en snabb guide läs :ref:``where to patch <where-to-patch>``.

source: As well as a decorator :func:`patch` can be used as a context manager in a with statement:
sv: Liksom en dekorator kan :func:`patch` användas som en kontexthanterare i en with-sats:

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
sv: Det finns också :func:`patch.dict` för att ställa in värden i en ordbok bara under ett scope och återställa ordboken till dess ursprungliga tillstånd när testet avslutas:

source: Mock supports the mocking of Python :ref:`magic methods <magic-methods>`. The easiest way of using magic methods is with the :class:`MagicMock` class. It allows you to do things like:
sv: Mock stöder mockning av Python :ref:`magiska metoder <magic-methods>`. Det enklaste sättet att använda magiska metoder är med :class:`MagicMock`-klassen. Det gör att du kan göra saker som:

source: Mock allows you to assign functions (or other Mock instances) to magic methods and they will be called appropriately. The :class:`MagicMock` class is just a Mock variant that has all of the magic methods pre-created for you (well, all the useful ones anyway).
sv: Med Mock kan du tilldela funktioner (eller andra Mock-instanser) till magiska metoder och de kommer att anropas på lämpligt sätt. Klassen :class:`MagicMock` är bara en Mock-variant som har alla de magiska metoderna förskapade åt dig (i alla fall alla användbara).

source: The following is an example of using magic methods with the ordinary Mock class:
sv: Nedan följer ett exempel på hur man använder magiska metoder med den vanliga Mock-klassen:

source: For ensuring that the mock objects in your tests have the same api as the objects they are replacing, you can use :ref:`auto-speccing <auto-speccing>`. Auto-speccing can be done through the *autospec* argument to patch, or the :func:`create_autospec` function. Auto-speccing creates mock objects that have the same attributes and methods as the objects they are replacing, and any functions and methods (including constructors) have the same call signature as the real object.
sv: För att säkerställa att mock-objekten i dina tester har samma api som de objekt de ersätter kan du använda :ref:`auto-speccing <auto-speccing>`. Auto-speccing kan göras genom *autospec*-argumentet till patch, eller funktionen :func:`create_autospec`. Auto-speccing skapar låtsasobjekt som har samma attribut och metoder som de objekt de ersätter, och alla funktioner och metoder (inklusive konstruktörer) har samma anropssignatur som det riktiga objektet.

source: This ensures that your mocks will fail in the same way as your production code if they are used incorrectly:
sv: Detta säkerställer att dina mocks kommer att misslyckas på samma sätt som din produktionskod om de används felaktigt:

source: :func:`create_autospec` can also be used on classes, where it copies the signature of the ``__init__`` method, and on callable objects where it copies the signature of the ``__call__`` method.
sv: :func:`create_autospec` kan också användas på klasser, där den kopierar signaturen för metoden ``__init__``, och på anropsbara objekt där den kopierar signaturen för metoden ``__call__``.

source: The Mock Class
sv: Den låtsasklassen

source: :class:`Mock` is a flexible mock object intended to replace the use of stubs and test doubles throughout your code. Mocks are callable and create attributes as new mocks when you access them [#]_. Accessing the same attribute will always return the same mock. Mocks record how you use them, allowing you to make assertions about what your code has done to them.
sv: :class:`Mock` är ett flexibelt mock-objekt som är avsett att ersätta användningen av stubbar och testdubblar i hela din kod. Mockar är anropsbara och skapar attribut som nya mockar när du använder dem [#]_. Att komma åt samma attribut kommer alltid att returnera samma mock. Mocks registrerar hur du använder dem, så att du kan göra påståenden om vad din kod har gjort med dem.

source: :class:`MagicMock` is a subclass of :class:`Mock` with all the magic methods pre-created and ready to use. There are also non-callable variants, useful when you are mocking out objects that aren't callable: :class:`NonCallableMock` and :class:`NonCallableMagicMock`
sv: :class:`MagicMock` är en subklass av :class:`Mock` med alla magiska metoder förskapade och redo att användas. Det finns också icke anropsbara varianter, användbara när du mockar ut objekt som inte är anropsbara: :class:`NonCallableMock` och :class:`NonCallableMagicMock`

source: The :func:`patch` decorators makes it easy to temporarily replace classes in a particular module with a :class:`Mock` object. By default :func:`patch` will create a :class:`MagicMock` for you. You can specify an alternative class of :class:`Mock` using the *new_callable* argument to :func:`patch`.
sv: Dekoratorn :func:`patch` gör det enkelt att tillfälligt ersätta klasser i en viss modul med ett :class:`Mock`-objekt. Som standard kommer :func:`patch` att skapa en :class:`MagicMock` åt dig. Du kan ange en alternativ klass till :class:`Mock` med hjälp av argumentet *new_callable* till :func:`patch`.

source: Create a new :class:`Mock` object. :class:`Mock` takes several optional arguments that specify the behaviour of the Mock object:
sv: Skapa ett nytt :class:`Mock`-objekt. :class:`Mock` tar flera valfria argument som anger beteendet hos Mock-objektet:

source: *spec*: This can be either a list of strings or an existing object (a class or instance) that acts as the specification for the mock object. If you pass in an object then a list of strings is formed by calling dir on the object (excluding unsupported magic attributes and methods). Accessing any attribute not in this list will raise an :exc:`AttributeError`.
sv: *spec*: Detta kan vara antingen en lista med strängar eller ett befintligt objekt (en klass eller instans) som fungerar som specifikation för mock-objektet. Om du skickar in ett objekt bildas en lista med strängar genom att anropa dir på objektet (exklusive magiska attribut och metoder som inte stöds). Åtkomst till ett attribut som inte finns i listan kommer att ge upphov till ett :exc:`AttributeError`.

source: If *spec* is an object (rather than a list of strings) then :attr:`~object.__class__` returns the class of the spec object. This allows mocks to pass :func:`isinstance` tests.
sv: Om *spec* är ett objekt (snarare än en lista med strängar) returnerar :attr:`~object.__class__` klassen för spec-objektet. Detta gör att låtsasobjekt kan klara :func:`isinstance`-tester.

source: *spec_set*: A stricter variant of *spec*. If used, attempting to *set* or get an attribute on the mock that isn't on the object passed as *spec_set* will raise an :exc:`AttributeError`.
sv: *spec_set*: En striktare variant av *spec*. Om den används kommer försök att *set* eller hämta ett attribut på mock som inte finns på objektet som skickas som *spec_set* att ge upphov till ett :exc:`AttributeError`.

source: *side_effect*: A function to be called whenever the Mock is called. See the :attr:`~Mock.side_effect` attribute. Useful for raising exceptions or dynamically changing return values. The function is called with the same arguments as the mock, and unless it returns :data:`DEFAULT`, the return value of this function is used as the return value.
sv: *side_effect*: En funktion som ska anropas när Mock anropas. Se attributet :attr:`~Mock.side_effect`. Användbar för att skapa undantag eller dynamiskt ändra returvärden. Funktionen anropas med samma argument som mock, och om den inte returnerar :data:`DEFAULT`, används returvärdet för denna funktion som returvärde.

source: Alternatively *side_effect* can be an exception class or instance. In this case the exception will be raised when the mock is called.
sv: Alternativt kan *side_effect* vara en undantagsklass eller -instans. I detta fall kommer undantaget att uppstå när mocken anropas.

source: If *side_effect* is an iterable then each call to the mock will return the next value from the iterable.
sv: Om *side_effect* är en iterabel kommer varje anrop till mock att returnera nästa värde från iterabeln.

source: A *side_effect* can be cleared by setting it to ``None``.
sv: En *side_effect* kan raderas genom att den sätts till ``None``.

source: *return_value*: The value returned when the mock is called. By default this is a new Mock (created on first access). See the :attr:`return_value` attribute.
sv: *return_value*: Det värde som returneras när mocken anropas. Som standard är detta en ny Mock (skapas vid första åtkomst). Se attributet :attr:`return_value`.

source: *unsafe*: By default, accessing any attribute whose name starts with *assert*, *assret*, *asert*, *aseert* or *assrt* will raise an :exc:`AttributeError`. Passing ``unsafe=True`` will allow access to these attributes.
sv: *osäker*: Som standard kommer åtkomst till alla attribut vars namn börjar med *assert*, *assret*, *asert*, *aseert* eller *assrt* att ge upphov till ett :exc:`AttributeError`. Om du anger ``unsafe=True`` tillåts åtkomst till dessa attribut.

source: *wraps*: Item for the mock object to wrap. If *wraps* is not ``None`` then calling the Mock will pass the call through to the wrapped object (returning the real result). Attribute access on the mock will return a Mock object that wraps the corresponding attribute of the wrapped object (so attempting to access an attribute that doesn't exist will raise an :exc:`AttributeError`).
sv: *omsluter*: Objekt för det låtsasobjekt som ska omslutas. Om *wraps* inte är ``None`` kommer anropet till Mock att skicka anropet vidare till det omslutna objektet (och returnera det verkliga resultatet). Attributåtkomst på mocken kommer att returnera ett Mock-objekt som omsluter motsvarande attribut för det omslutna objektet (så försök att komma åt ett attribut som inte finns kommer att ge upphov till ett :exc:`AttributeError`).

source: If the mock has an explicit *return_value* set then calls are not passed to the wrapped object and the *return_value* is returned instead.
sv: Om mock har ett explicit *return_value* inställt skickas inte anrop till det inkapslade objektet och *return_value* returneras istället.

source: *name*: If the mock has a name then it will be used in the repr of the mock. This can be useful for debugging. The name is propagated to child mocks.
sv: *namn*: Om mocken har ett namn kommer det att användas i mockens repr. Detta kan vara användbart för felsökning. Namnet sprids till underordnade mockar.

source: Mocks can also be called with arbitrary keyword arguments. These will be used to set attributes on the mock after it is created. See the :meth:`configure_mock` method for details.
sv: Mocks kan också anropas med godtyckliga nyckelordsargument. Dessa kommer att användas för att ställa in attribut på mocken efter att den har skapats. Se metoden :meth:`configure_mock` för mer information.

source: Assert that the mock was called at least once.
sv: Försäkra dig om att mocken har anropats minst en gång.

source: Assert that the mock was called exactly once.
sv: Försäkra dig om att mock anropades exakt en gång.

source: This method is a convenient way of asserting that the last call has been made in a particular way:
sv: Denna metod är ett bekvämt sätt att försäkra sig om att det sista anropet har gjorts på ett visst sätt:

source: Assert that the mock was called exactly once and that call was with the specified arguments.
sv: Försäkra dig om att mock anropades exakt en gång och att anropet gjordes med de angivna argumenten.

source: assert the mock has been called with the specified arguments.
sv: bekräftar att mock har anropats med de angivna argumenten.

source: The assert passes if the mock has *ever* been called, unlike :meth:`assert_called_with` and :meth:`assert_called_once_with` that only pass if the call is the most recent one, and in the case of :meth:`assert_called_once_with` it must also be the only call.
sv: Assertet godkänns om mocken *alltid* har anropats, till skillnad från :meth:`assert_called_with` och :meth:`assert_called_once_with` som bara godkänns om anropet är det senaste, och i fallet med :meth:`assert_called_once_with` måste det också vara det enda anropet.

source: assert the mock has been called with the specified calls. The :attr:`mock_calls` list is checked for the calls.
sv: försäkrar att mocken har anropats med de angivna anropen. Listan :attr:`mock_calls` kontrolleras för anropen.

source: If *any_order* is false then the calls must be sequential. There can be extra calls before or after the specified calls.
sv: Om *any_order* är false måste anropen vara sekventiella. Det kan finnas extra anrop före eller efter de angivna anropen.

source: If *any_order* is true then the calls can be in any order, but they must all appear in :attr:`mock_calls`.
sv: Om *any_order* är true kan anropen vara i vilken ordning som helst, men de måste alla visas i :attr:`mock_calls`.

source: Assert the mock was never called.
sv: Påstå att mocken aldrig kallades.

source: The reset_mock method resets all the call attributes on a mock object:
sv: Metoden reset_mock återställer alla anropsattribut på ett mock-objekt:

source: >>> mock = Mock(return_value=None) >>> mock('hello') >>> mock.called True >>> mock.reset_mock() >>> mock.called False
sv: >>> mock = Mock(return_value=None) >>> mock('hallå') >>> mock.kallas Sant >>> mock.reset_mock() >>> mock.kallas Falskt

source: This can be useful where you want to make a series of assertions that reuse the same object.
sv: Detta kan vara användbart om du vill göra en serie påståenden som återanvänder samma objekt.

source: *return_value* parameter when set to ``True`` resets :attr:`return_value`:
sv: *return_value* parameter när den sätts till ``True`` återställer :attr:`return_value`:

source: >>> mock = Mock(return_value=5) >>> mock('hello') 5 >>> mock.reset_mock(return_value=True) >>> mock('hello') <Mock name='mock()' id='...'>
sv: &gt;&gt;&gt; mock = Mock(return_value=5) &gt;&gt;&gt; mock('hallå') 5 &gt;&gt;&gt; mock.reset_mock(return_value=True) &gt;&gt;&gt; mock('hallå') <Mock name='mock()' id='...'>

source: *side_effect* parameter when set to ``True`` resets :attr:`side_effect`:
sv: *side_effect* parameter när den sätts till ``True`` återställer :attr:`side_effect`:

source: >>> mock = Mock(side_effect=ValueError) >>> mock('hello') Traceback (most recent call last): ... ValueError >>> mock.reset_mock(side_effect=True) >>> mock('hello') <Mock name='mock()' id='...'>
sv: &gt;&gt;&gt; mock = Mock(side_effect=ValueError) &gt;&gt;&gt; mock('hello') Traceback (senaste anropet senast): ... VärdeFel &gt;&gt;&gt; mock.reset_mock(side_effect=True) &gt;&gt;&gt; mock('hallå') <Mock name='mock()' id='...'>

source: Note that :meth:`reset_mock` *doesn't* clear the :attr:`return_value`, :attr:`side_effect` or any child attributes you have set using normal assignment by default.
sv: Observera att :meth:`reset_mock` *inte* rensar :attr:`return_value`, :attr:`side_effect` eller några underordnade attribut som du har ställt in med normal tilldelning som standard.

source: Child mocks are reset as well.
sv: Child mocks återställs också.

source: Added two keyword-only arguments to the reset_mock function.
sv: Lagt till två argument som endast är nyckelord till reset_mock-funktionen.

source: Add a spec to a mock. *spec* can either be an object or a list of strings. Only attributes on the *spec* can be fetched as attributes from the mock.
sv: Lägg till en specifikation till en mock. *spec* kan antingen vara ett objekt eller en lista med strängar. Endast attribut på *spec* kan hämtas som attribut från mock.

source: If *spec_set* is true then only attributes on the spec can be set.
sv: Om *spec_set* är true kan endast attribut i specifikationen ställas in.

source: Attach a mock as an attribute of this one, replacing its name and parent. Calls to the attached mock will be recorded in the :attr:`method_calls` and :attr:`mock_calls` attributes of this one.
sv: Bifogar en mock som ett attribut till den här, och ersätter dess namn och förälder. Anrop till den bifogade mocken kommer att registreras i attributen :attr:`method_calls` och :attr:`mock_calls` för denna.

source: Set attributes on the mock through keyword arguments.
sv: Ställ in attribut på mock genom nyckelordsargument.

source: Attributes plus return values and side effects can be set on child mocks using standard dot notation and unpacking a dictionary in the method call:
sv: Attribut, returvärden och bieffekter kan ställas in på underordnade mocks med hjälp av standardpunktnotation och uppackning av en ordbok i metodanropet:

source: The same thing can be achieved in the constructor call to mocks:
sv: Samma sak kan uppnås i konstruktörsanropet till mocks:

source: :meth:`configure_mock` exists to make it easier to do configuration after the mock has been created.
sv: :meth:`configure_mock` finns för att göra det enklare att konfigurera efter att mocken har skapats.

source: :class:`Mock` objects limit the results of ``dir(some_mock)`` to useful results. For mocks with a *spec* this includes all the permitted attributes for the mock.
sv: :class:`Mock`-objekt begränsar resultaten av ``dir(some_mock)`` till användbara resultat. För låtsasobjekt med en *spec* inkluderar detta alla tillåtna attribut för låtsasobjektet.

source: See :data:`FILTER_DIR` for what this filtering does, and how to switch it off.
sv: Se :data:`FILTER_DIR` för vad denna filtrering gör och hur du stänger av den.

source: Create the child mocks for attributes and return value. By default child mocks will be the same type as the parent. Subclasses of Mock may want to override this to customize the way child mocks are made.
sv: Skapa de underordnade mockarna för attribut och returvärde. Som standard kommer underordnade mocks att vara av samma typ som den överordnade. Subklasser av Mock kan vilja åsidosätta detta för att anpassa hur underordnade mocks skapas.

source: For non-callable mocks the callable variant will be used (rather than any custom subclass).
sv: För icke anropsbara mocks kommer den anropsbara varianten att användas (snarare än någon anpassad subklass).

source: A boolean representing whether or not the mock object has been called:
sv: En boolean som anger om mock-objektet har anropats eller inte:
