Repository: yeager/python-docs-sv
Catalog: library/unittest.mock.po
Languages: sv

source: An integer telling you how many times the mock object has been called:
sv: Ett heltal som talar om hur många gånger mock-objektet har anropats:

source: Set this to configure the value returned by calling the mock:
sv: Ställ in detta för att konfigurera det värde som returneras när du anropar mock:

source: The default return value is a mock object and you can configure it in the normal way:
sv: Standardreturvärdet är ett mock-objekt och du kan konfigurera det på vanligt sätt:

source: :attr:`return_value` can also be set in the constructor:
sv: :attr:`return_value` kan också ställas in i konstruktorn:

source: This can either be a function to be called when the mock is called, an iterable or an exception (class or instance) to be raised.
sv: Detta kan antingen vara en funktion som ska anropas när mock anropas, en iterabel eller ett undantag (klass eller instans) som ska tas upp.

source: If you pass in a function it will be called with same arguments as the mock and unless the function returns the :data:`DEFAULT` singleton the call to the mock will then return whatever the function returns. If the function returns :data:`DEFAULT` then the mock will return its normal value (from the :attr:`return_value`).
sv: Om du skickar in en funktion kommer den att anropas med samma argument som mock och om inte funktionen returnerar :data:`DEFAULT` singleton kommer anropet till mock att returnera det som funktionen returnerar. Om funktionen returnerar :data:`DEFAULT` så kommer mock att returnera sitt normala värde (från :attr:`return_value`).

source: If you pass in an iterable, it is used to retrieve an iterator which must yield a value on every call. This value can either be an exception instance to be raised, or a value to be returned from the call to the mock (:data:`DEFAULT` handling is identical to the function case).
sv: Om du skickar in en iterable används den för att hämta en iterator som måste ge ett värde vid varje anrop. Detta värde kan antingen vara en undantagsinstans som ska aktiveras eller ett värde som ska returneras från anropet till mock (:data:`DEFAULT`-hanteringen är identisk med funktionsfallet).

source: An example of a mock that raises an exception (to test exception handling of an API):
sv: Ett exempel på en mock som ger upphov till ett undantag (för att testa undantagshanteringen i ett API):

source: Using :attr:`side_effect` to return a sequence of values:
sv: Använda :attr:`side_effect` för att returnera en sekvens av värden:

source: Using a callable:
sv: Använda en köpbar enhet:

source: :attr:`side_effect` can be set in the constructor. Here's an example that adds one to the value the mock is called with and returns it:
sv: :attr:`side_effect` kan ställas in i konstruktören. Här är ett exempel som lägger till en till det värde som mocken anropas med och returnerar det:

source: Setting :attr:`side_effect` to ``None`` clears it:
sv: Om du ställer in :attr:`side_effect` till ``None`` raderas den:

source: This is either ``None`` (if the mock hasn't been called), or the arguments that the mock was last called with. This will be in the form of a tuple: the first member, which can also be accessed through the ``args`` property, is any ordered arguments the mock was called with (or an empty tuple) and the second member, which can also be accessed through the ``kwargs`` property, is any keyword arguments (or an empty dictionary).
sv: Detta är antingen ``None`` (om mock inte har anropats), eller de argument som mock senast anropades med. Detta kommer att vara i form av en tupel: den första medlemmen, som också kan nås via egenskapen ``args``, är alla ordnade argument som mocken anropades med (eller en tom tupel) och den andra medlemmen, som också kan nås via egenskapen ``kwargs``, är alla nyckelordsargument (eller en tom ordbok).

source: :attr:`call_args`, along with members of the lists :attr:`call_args_list`, :attr:`method_calls` and :attr:`mock_calls` are :data:`call` objects. These are tuples, so they can be unpacked to get at the individual arguments and make more complex assertions. See :ref:`calls as tuples <calls-as-tuples>`.
sv: :attr:`call_args`, tillsammans med medlemmar av listorna :attr:`call_args_list`, :attr:`method_calls` och :attr:`mock_calls` är :data:`call`-objekt. Dessa är tupler, så de kan packas upp för att komma åt de enskilda argumenten och göra mer komplexa påståenden. Se :ref:`calls as tuples <calls-as-tuples>`.

source: Added ``args`` and ``kwargs`` properties.
sv: Lagt till egenskaperna ``args`` och ``kwargs``.

source: This is a list of all the calls made to the mock object in sequence (so the length of the list is the number of times it has been called). Before any calls have been made it is an empty list. The :data:`call` object can be used for conveniently constructing lists of calls to compare with :attr:`call_args_list`.
sv: Detta är en lista över alla anrop som gjorts till mock-objektet i sekvens (så längden på listan är antalet gånger det har anropats). Innan några anrop har gjorts är det en tom lista. Objektet :data:`call` kan användas för att på ett enkelt sätt konstruera listor över anrop som kan jämföras med :attr:`call_args_list`.

source: Members of :attr:`call_args_list` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
sv: Medlemmar i :attr:`call_args_list` är :data:`call`-objekt. Dessa kan packas upp som tupler för att komma åt de enskilda argumenten. Se :ref:``anrop som tuvor <calls-as-tuples>`.

source: As well as tracking calls to themselves, mocks also track calls to methods and attributes, and *their* methods and attributes:
sv: Förutom att spåra anrop till sig själva, spårar mocks också anrop till metoder och attribut, och *deras* metoder och attribut:

source: Members of :attr:`method_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
sv: Medlemmar i :attr:`method_calls` är :data:`call`-objekt. Dessa kan packas upp som tupler för att komma åt de enskilda argumenten. Se :ref:`calls som tuvor <calls-as-tuples>`.

source: :attr:`mock_calls` records *all* calls to the mock object, its methods, magic methods *and* return value mocks.
sv: :attr:`mock_calls` registrerar *alla* anrop till mock-objektet, dess metoder, magiska metoder *och* return value mocks.

source: Members of :attr:`mock_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
sv: Medlemmar i :attr:`mock_calls` är :data:`call`-objekt. Dessa kan packas upp som tupler för att komma åt de enskilda argumenten. Se :ref:`calls som tuvor <calls-as-tuples>`.

source: The way :attr:`mock_calls` are recorded means that where nested calls are made, the parameters of ancestor calls are not recorded and so will always compare equal:
sv: Sättet som :attr:`mock_calls` registreras på innebär att när nästlade anrop görs, registreras inte parametrarna för förfädernas anrop och de kommer därför alltid att jämföras lika:

source: Normally the :attr:`!__class__` attribute of an object will return its type. For a mock object with a :attr:`!spec`, :attr:`!__class__` returns the spec class instead. This allows mock objects to pass :func:`isinstance` tests for the object they are replacing / masquerading as:
sv: Normalt kommer attributet :attr:`!__class__` för ett objekt att returnera dess typ. För ett låtsasobjekt med :attr:`!spec` returnerar :attr:`!__class__` istället spec-klassen. Detta gör att låtsasobjekt kan klara :func:`isinstance`-tester för det objekt som de ersätter/maskerar sig som:

source: :attr:`!__class__` is assignable to, this allows a mock to pass an :func:`isinstance` check without forcing you to use a spec:
sv: :attr:`!__class__` är tilldelningsbar till, tillåter detta en mock att klara en :func:`isinstance` kontroll utan att tvinga dig att använda en spec:

source: A non-callable version of :class:`Mock`. The constructor parameters have the same meaning of :class:`Mock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
sv: En icke anropsbar version av :class:`Mock`. Parametrarna i konstruktören har samma betydelse som i :class:`Mock`, med undantag för *return_value* och *side_effect* som inte har någon betydelse för en icke anropsbar mock.

source: Mock objects that use a class or an instance as a :attr:`!spec` or :attr:`!spec_set` are able to pass :func:`isinstance` tests:
sv: Låtsasobjekt som använder en klass eller en instans som :attr:`!spec` eller :attr:`!spec_set` kan klara :func:`isinstance`-tester:

source: The :class:`Mock` classes have support for mocking magic methods. See :ref:`magic methods <magic-methods>` for the full details.
sv: Klasserna :class:`Mock` har stöd för mocking av magiska metoder. Se :ref:`magiska metoder <magic-methods>` för fullständiga detaljer.

source: The mock classes and the :func:`patch` decorators all take arbitrary keyword arguments for configuration. For the :func:`patch` decorators the keywords are passed to the constructor of the mock being created. The keyword arguments are for configuring attributes of the mock:
sv: Mock-klasserna och :func:`patch`-dekoratorerna tar alla godtyckliga nyckelordsargument för konfiguration. För :func:`patch`-dekoratorerna skickas nyckelorden till konstruktören för den mock som skapas. Nyckelordsargumenten är till för att konfigurera attribut hos låtsasobjektet:

source: The return value and side effect of child mocks can be set in the same way, using dotted notation. As you can't use dotted names directly in a call you have to create a dictionary and unpack it using ``**``:
sv: Returvärdet och bieffekten för underordnade mocks kan anges på samma sätt, med hjälp av prickad notation. Eftersom du inte kan använda punktnamn direkt i ett anrop måste du skapa en ordbok och packa upp den med ``**``:

source: A callable mock which was created with a *spec* (or a *spec_set*) will introspect the specification object's signature when matching calls to the mock. Therefore, it can match the actual call's arguments regardless of whether they were passed positionally or by name::
sv: En anropsbar mock som skapades med en *spec* (eller en *spec_set*) kommer att introspektera specifikationsobjektets signatur när den matchar anrop till mocken. Därför kan den matcha det faktiska anropets argument oavsett om de skickades positionellt eller med namn::

source: >>> def f(a, b, c): pass ... >>> mock = Mock(spec=f) >>> mock(1, 2, c=3) <Mock name='mock()' id='140161580456576'> >>> mock.assert_called_with(1, 2, 3) >>> mock.assert_called_with(a=1, b=2, c=3)
sv: &gt;&gt;&gt; def f(a, b, c): pass ... &gt;&gt;&gt; mock = Mock(spec=f) &gt;&gt;&gt; mock(1, 2, c=3) <Mock name='mock()' id='140161580456576'> &gt;&gt;&gt; mock.assert_called_with(1, 2, 3) &gt;&gt;&gt; mock.assert_called_with(a=1, b=2, c=3)

source: This applies to :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_called_once_with`, :meth:`~Mock.assert_has_calls` and :meth:`~Mock.assert_any_call`. When :ref:`auto-speccing`, it will also apply to method calls on the mock object.
sv: Detta gäller för :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_called_once_with`, :meth:`~Mock.assert_has_calls` och :meth:`~Mock.assert_any_call`. När :ref:`auto-speccing`, kommer det också att gälla för metodanrop på mock-objektet.

source: Added signature introspection on specced and autospecced mock objects.
sv: Lagt till signaturintrospektion på specificerade och autospecerade mock-objekt.

source: A mock intended to be used as a :class:`property`, or other :term:`descriptor`, on a class. :class:`PropertyMock` provides :meth:`~object.__get__` and :meth:`~object.__set__` methods so you can specify a return value when it is fetched.
sv: En mock avsedd att användas som en :class:`property`, eller annan :term:`descriptor`, på en klass. :class:`PropertyMock` tillhandahåller metoderna :meth:`~object.__get__` och :meth:`~object.__set__` så att du kan ange ett returvärde när den hämtas.

source: Fetching a :class:`PropertyMock` instance from an object calls the mock, with no args. Setting it calls the mock with the value being set. ::
sv: Att hämta en :class:`PropertyMock`-instans från ett objekt anropar mocken, utan args. Om den ställs in anropas mocken med det värde som ställs in. ::

source: >>> class Foo: ... @property ... def foo(self): ... return 'something' ... @foo.setter ... def foo(self, value): ... pass ... >>> with patch('__main__.Foo.foo', new_callable=PropertyMock) as mock_foo: ... mock_foo.return_value = 'mockity-mock' ... this_foo = Foo() ... print(this_foo.foo) ... this_foo.foo = 6 ... mockity-mock >>> mock_foo.mock_calls [call(), call(6)]
sv: >>> klass Foo: ... @egenskap ... def foo(self): ... return 'något' ... @foo.setter ... def foo(self, värde): ... pass ... >>> med patch('__main__.Foo.foo', new_callable=PropertyMock) som mock_foo: ... mock_foo.return_value = 'mockity-mock' ... detta_foo = Foo() ... print(this_foo.foo) ... this_foo.foo = 6 ... mockity-mock >>> mock_foo.mock_calls [call(), call(6)]

source: Because of the way mock attributes are stored you can't directly attach a :class:`PropertyMock` to a mock object. Instead you can attach it to the mock type object::
sv: På grund av det sätt som mock-attribut lagras kan du inte direkt koppla en :class:`PropertyMock` till ett mock-objekt. Istället kan du koppla det till mock-objektet::

source: >>> m = MagicMock() >>> p = PropertyMock(return_value=3) >>> type(m).foo = p >>> m.foo 3 >>> p.assert_called_once_with()
sv: >>> m = MagicMock() >>> p = PropertyMock(return_value=3) >>> typ(m).foo = p >>> m.foo 3 >>> p.assert_called_once_with()

source: If an :exc:`AttributeError` is raised by :class:`PropertyMock`, it will be interpreted as a missing descriptor and :meth:`~object.__getattr__` will be called on the parent mock::
sv: Om ett :exc:`AttributeError` uppstår i :class:`PropertyMock` tolkas det som att en deskriptor saknas och :meth:`~object.__getattr__` anropas på den överordnade mock::

source: >>> m = MagicMock() >>> no_attribute = PropertyMock(side_effect=AttributeError) >>> type(m).my_property = no_attribute >>> m.my_property <MagicMock name='mock.my_property' id='140165240345424'>
sv: &gt;&gt;&gt; m = MagicMock() &gt;&gt;&gt; no_attribute = PropertyMock(side_effect=AttributeError) &gt;&gt;&gt; typ(m).my_property = no_attribute &gt;&gt;&gt; m.my_property <MagicMock name='mock.my_property' id='140165240345424'>

source: See :meth:`~object.__getattr__` for details.
sv: Se :meth:`~object.__getattr__` för mer information.

source: An asynchronous version of :class:`MagicMock`. The :class:`AsyncMock` object will behave so the object is recognized as an async function, and the result of a call is an awaitable.
sv: En asynkron version av :class:`MagicMock`. Objektet :class:`AsyncMock` kommer att bete sig så att objektet känns igen som en asynkron funktion och resultatet av ett anrop är en awaitable.

source: The result of ``mock()`` is an async function which will have the outcome of ``side_effect`` or ``return_value`` after it has been awaited:
sv: Resultatet av ``mock()`` är en asynkron funktion som kommer att få resultatet ``side_effect`` eller ``return_value`` efter att den har väntat:

source: if ``side_effect`` is a function, the async function will return the result of that function,
sv: om ``side_effect`` är en funktion, kommer async-funktionen att returnera resultatet av den funktionen,

source: if ``side_effect`` is an exception, the async function will raise the exception,
sv: om ``side_effect`` är ett undantag, kommer async-funktionen att lyfta undantaget,

source: if ``side_effect`` is an iterable, the async function will return the next value of the iterable, however, if the sequence of result is exhausted, ``StopAsyncIteration`` is raised immediately,
sv: om ``side_effect`` är en iterabel, kommer async-funktionen att returnera nästa värde i iterabeln, men om resultatsekvensen är uttömd, kommer ``StopAsyncIteration`` att aktiveras omedelbart,

source: if ``side_effect`` is not defined, the async function will return the value defined by ``return_value``, hence, by default, the async function returns a new :class:`AsyncMock` object.
sv: om ``side_effect`` inte är definierad, kommer async-funktionen att returnera det värde som definieras av ``return_value``, därför returnerar async-funktionen som standard ett nytt :class:`AsyncMock`-objekt.

source: Setting the *spec* of a :class:`Mock` or :class:`MagicMock` to an async function will result in a coroutine object being returned after calling.
sv: Om du anger *spec* för en :class:`Mock` eller :class:`MagicMock` till en asynkron funktion kommer ett coroutine-objekt att returneras efter anropet.

source: Setting the *spec* of a :class:`Mock`, :class:`MagicMock`, or :class:`AsyncMock` to a class with asynchronous and synchronous functions will automatically detect the synchronous functions and set them as :class:`MagicMock` (if the parent mock is :class:`AsyncMock` or :class:`MagicMock`) or :class:`Mock` (if the parent mock is :class:`Mock`). All asynchronous functions will be :class:`AsyncMock`.
sv: Om du anger *spec* för en :class:`Mock`, :class:`MagicMock` eller :class:`AsyncMock` till en klass med asynkrona och synkrona funktioner kommer synkrona funktioner automatiskt att identifieras och anges som :class:`MagicMock` (om den överordnade mocken är :class:`AsyncMock` eller :class:`MagicMock`) eller :class:`Mock` (om den överordnade mocken är :class:`Mock`). Alla asynkrona funktioner kommer att vara :class:`AsyncMock`.

source: Assert that the mock was awaited at least once. Note that this is separate from the object having been called, the ``await`` keyword must be used:
sv: Bekräftar att mocken var väntad minst en gång. Observera att detta är separat från att objektet har anropats, nyckelordet ``await`` måste användas:

source: Assert that the mock was awaited exactly once.
sv: Påstå att mocken väntades exakt en gång.

source: Assert that the last await was with the specified arguments.
sv: Försäkra dig om att den senaste await var med de angivna argumenten.

source: Assert that the mock was awaited exactly once and with the specified arguments.
sv: Bekräftar att mocken väntades exakt en gång och med de angivna argumenten.

source: Assert the mock has ever been awaited with the specified arguments.
sv: Bekräfta att mock någonsin har väntats med de angivna argumenten.

source: Assert the mock has been awaited with the specified calls. The :attr:`await_args_list` list is checked for the awaits.
sv: Bekräftar att mock har blivit awaited med de angivna anropen. Listan :attr:`await_args_list` kontrolleras för awaits.

source: If *any_order* is false then the awaits must be sequential. There can be extra calls before or after the specified awaits.
sv: Om *any_order* är false måste väntetiderna vara sekventiella. Det kan finnas extra anrop före eller efter den angivna väntan.

source: If *any_order* is true then the awaits can be in any order, but they must all appear in :attr:`await_args_list`.
sv: Om *any_order* är true kan awaits vara i vilken ordning som helst, men de måste alla finnas med i :attr:`await_args_list`.

source: Assert that the mock was never awaited.
sv: Påstå att spottet aldrig var väntat.

source: See :func:`Mock.reset_mock`. Also sets :attr:`await_count` to 0, :attr:`await_args` to None, and clears the :attr:`await_args_list`.
sv: Se :func:`Mock.reset_mock`. Sätter även :attr:`await_count` till 0, :attr:`await_args` till None, och rensar :attr:`await_args_list`.

source: An integer keeping track of how many times the mock object has been awaited.
sv: Ett heltal som håller reda på hur många gånger mock-objektet har väntats på.

source: This is either ``None`` (if the mock hasn’t been awaited), or the arguments that the mock was last awaited with. Functions the same as :attr:`Mock.call_args`.
sv: Detta är antingen ``None`` (om mocken inte har väntats på), eller de argument som mocken senast väntades på med. Fungerar på samma sätt som :attr:`Mock.call_args`.

source: This is a list of all the awaits made to the mock object in sequence (so the length of the list is the number of times it has been awaited). Before any awaits have been made it is an empty list.
sv: Detta är en lista över alla väntan som gjorts på mock-objektet i sekvens (så längden på listan är antalet gånger det har väntat). Innan någon väntan har gjorts är det en tom lista.

source: A version of :class:`MagicMock` for multithreading tests. The :class:`ThreadingMock` object provides extra methods to wait for a call to be invoked, rather than assert on it immediately.
sv: En version av :class:`MagicMock` för multithreading-tester. Objektet :class:`ThreadingMock` tillhandahåller extra metoder för att vänta på att ett anrop ska anropas, i stället för att göra en assert på det omedelbart.

source: The default timeout is specified by the ``timeout`` argument, or if unset by the :attr:`ThreadingMock.DEFAULT_TIMEOUT` attribute, which defaults to blocking (``None``).
sv: Standardtimeouten anges av argumentet ``timeout``, eller om den inte anges av attributet :attr:`ThreadingMock.DEFAULT_TIMEOUT`, som har blockering (``None``) som standard.

source: You can configure the global default timeout by setting :attr:`ThreadingMock.DEFAULT_TIMEOUT`.
sv: Du kan konfigurera den globala standardtimeouten genom att ställa in :attr:`ThreadingMock.DEFAULT_TIMEOUT`.

source: Waits until the mock is called.
sv: Väntar tills mocken anropas.

source: If a timeout was passed at the creation of the mock or if a timeout argument is passed to this function, the function raises an :exc:`AssertionError` if the call is not performed in time.
sv: Om en timeout angavs när mock skapades eller om ett timeout-argument anges till denna funktion, ger funktionen upphov till ett :exc:`AssertionError` om anropet inte utförs i tid.

source: Waits until the mock is called with the specified arguments.
sv: Väntar tills mock anropas med de angivna argumenten.

source: If a timeout was passed at the creation of the mock the function raises an :exc:`AssertionError` if the call is not performed in time.
sv: Om en tidsgräns angavs vid skapandet av mocken ger funktionen upphov till ett :exc:`AssertionError` om anropet inte utförs i tid.

source: Global default timeout in seconds to create instances of :class:`ThreadingMock`.
sv: Global standardtimeout i sekunder för att skapa instanser av :class:`ThreadingMock`.

source: Calling
sv: Ringer

source: Mock objects are callable. The call will return the value set as the :attr:`~Mock.return_value` attribute. The default return value is a new Mock object; it is created the first time the return value is accessed (either explicitly or by calling the Mock) - but it is stored and the same one returned each time.
sv: Mock-objekt är anropsbara. Anropet kommer att returnera det värde som anges som attributet :attr:`~Mock.return_value`. Standardreturvärdet är ett nytt Mock-objekt; det skapas första gången returvärdet används (antingen explicit eller genom att anropa Mock) - men det lagras och samma värde returneras varje gång.

source: Calls made to the object will be recorded in the attributes like :attr:`~Mock.call_args` and :attr:`~Mock.call_args_list`.
sv: Anrop som görs till objektet registreras i attribut som :attr:`~Mock.call_args` och :attr:`~Mock.call_args_list`.
