Repository: yeager/python-docs-sv
Catalog: library/unittest.mock.po
Languages: sv

source: If all three are set, mock will return the value from :attr:`~Mock.side_effect`, ignoring :attr:`~Mock.return_value` and the wrapped object altogether. If any two are set, the one with the higher precedence will return the value. Regardless of the order of which was set first, the order of precedence remains unchanged.
sv: Om alla tre är inställda kommer mock att returnera värdet från :attr:`~Mock.side_effect` och ignorera :attr:`~Mock.return_value` och det omslutna objektet helt och hållet. Om två är inställda, kommer den med högst prioritet att returnera värdet. Oavsett vilken som angavs först förblir prioritetsordningen oförändrad.

source: As ``None`` is the default value of :attr:`~Mock.side_effect`, if you reassign its value back to ``None``, the order of precedence will be checked between :attr:`~Mock.return_value` and the wrapped object, ignoring :attr:`~Mock.side_effect`.
sv: Eftersom ``None`` är standardvärdet för :attr:`~Mock.side_effect`, om du tilldelar dess värde tillbaka till ``None``, kommer prioritetsordningen att kontrolleras mellan :attr:`~Mock.return_value` och det inlindade objektet, utan hänsyn till :attr:`~Mock.side_effect`.

source: If the value being returned by :attr:`~Mock.side_effect` is :data:`DEFAULT`, it is ignored and the order of precedence moves to the successor to obtain the value to return.
sv: Om det värde som returneras av :attr:`~Mock.side_effect` är :data:`DEFAULT` ignoreras det och prioritetsordningen flyttas till efterföljaren för att få det värde som ska returneras.

source: When :class:`Mock` wraps an object, the default value of :attr:`~Mock.return_value` will be :data:`DEFAULT`.
sv: När :class:`Mock` omsluter ett objekt kommer standardvärdet för :attr:`~Mock.return_value` att vara :data:`DEFAULT`.

source: The order of precedence will ignore this value and it will move to the last successor which is the wrapped object.
sv: Prioritetsordningen ignorerar detta värde och går vidare till den sista efterträdaren, vilket är det inplastade objektet.

source: As the real call is being made to the wrapped object, creating an instance of this mock will return the real instance of the class. The positional arguments, if any, required by the wrapped object must be passed.
sv: Eftersom det verkliga anropet görs till det inlindade objektet, kommer skapandet av en instans av denna mock att returnera den verkliga instansen av klassen. De eventuella positionella argument som krävs av det inkapslade objektet måste skickas.

source: But if you assign ``None`` to it, this will not be ignored as it is an explicit assignment. So, the order of precedence will not move to the wrapped object.
sv: Men om du tilldelar ``None`` till det, kommer detta inte att ignoreras eftersom det är en explicit tilldelning. Så prioritetsordningen kommer inte att flyttas till det inplastade objektet.

source: Even if you set all three at once when initializing the mock, the order of precedence remains the same:
sv: Även om du ställer in alla tre på en gång när du initierar mocken, förblir prioritetsordningen densamma:

source: If :attr:`~Mock.side_effect` is exhausted, the order of precedence will not cause a value to be obtained from the successors. Instead, ``StopIteration`` exception is raised.
sv: Om :attr:`~Mock.side_effect` är uttömd, kommer rangordningen inte att leda till att ett värde erhålls från efterföljarna. Istället utlöses undantaget ``StopIteration``.
