Repository: yeager/python-docs-sv
Catalog: library/urllib.request.po
Languages: sv

source: The order in which these methods are called within each stage is determined by sorting the handler instances.
sv: Den ordning i vilken dessa metoder anropas inom varje steg bestäms genom att sortera hanterarinstanserna.

source: Every handler with a method named like :meth:`!<protocol>_request` has that method called to pre-process the request.
sv: Varje hanterare med en metod som heter :meth:`!<protocol>_request` har den metoden som anropas för att förbehandla begäran.

source: Handlers with a method named like :meth:`!<protocol>_open` are called to handle the request. This stage ends when a handler either returns a non-\ :const:`None` value (ie. a response), or raises an exception (usually :exc:`~urllib.error.URLError`). Exceptions are allowed to propagate.
sv: Hanterare med en metod som heter :meth:`!<protocol>_open` anropas för att hantera begäran. Detta steg avslutas när en hanterare antingen returnerar ett icke-värde :const:`None` (dvs. ett svar), eller ger upphov till ett undantag (vanligtvis :exc:`~urllib.error.URLError`). Undantag tillåts att spridas.

source: In fact, the above algorithm is first tried for methods named :meth:`~BaseHandler.default_open`. If all such methods return :const:`None`, the algorithm is repeated for methods named like :meth:`!<protocol>_open`. If all such methods return :const:`None`, the algorithm is repeated for methods named :meth:`~BaseHandler.unknown_open`.
sv: Faktum är att ovanstående algoritm först prövas för metoder med namnet :meth:`~BaseHandler.default_open`. Om alla sådana metoder returnerar :const:`None`, upprepas algoritmen för metoder med namn som :meth:`!<protocol>_open`. Om alla sådana metoder returnerar :const:`None` upprepas algoritmen för metoder med namnet :meth:`~BaseHandler.unknown_open`.

source: Note that the implementation of these methods may involve calls of the parent :class:`OpenerDirector` instance's :meth:`~OpenerDirector.open` and :meth:`~OpenerDirector.error` methods.
sv: Observera att implementeringen av dessa metoder kan innebära anrop av den överordnade :class:`OpenerDirector`-instansens metoder :meth:`~OpenerDirector.open` och :meth:`~OpenerDirector.error`.

source: Every handler with a method named like :meth:`!<protocol>_response` has that method called to post-process the response.
sv: Varje hanterare med en metod som heter som :meth:`!<protocol>_response` har den metoden som anropas för att efterbehandla svaret.

source: BaseHandler Objects
sv: BaseHandler-objekt

source: :class:`BaseHandler` objects provide a couple of methods that are directly useful, and others that are meant to be used by derived classes. These are intended for direct use:
sv: :class:`BaseHandler`-objekt tillhandahåller ett par metoder som är direkt användbara och andra som är avsedda att användas av härledda klasser. Dessa är avsedda för direkt användning:

source: Add a director as parent.
sv: Lägg till en direktör som förälder.

source: Remove any parents.
sv: Ta bort eventuella föräldrar.

source: The following attribute and methods should only be used by classes derived from :class:`BaseHandler`.
sv: Följande attribut och metoder bör endast användas av klasser som härrör från :class:`BaseHandler`.

source: The convention has been adopted that subclasses defining :meth:`!<protocol>_request` or :meth:`!<protocol>_response` methods are named :class:`!\*Processor`; all others are named :class:`!\*Handler`.
sv: Konventionen har antagits att subklasser som definierar :meth:`!<protocol>_request` eller :meth:`!<protocol>_response` metoder heter :class:`!\*Processor`; alla andra heter :class:`!\*Handler`.

source: A valid :class:`OpenerDirector`, which can be used to open using a different protocol, or handle errors.
sv: En giltig :class:`OpenerDirector`, som kan användas för att öppna med ett annat protokoll eller hantera fel.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs.
sv: Denna metod är *inte* definierad i :class:`BaseHandler`, men underklasser bör definiera den om de vill fånga alla URL:er.

source: This method, if implemented, will be called by the parent :class:`OpenerDirector`. It should return a file-like object as described in the return value of the :meth:`~OpenerDirector.open` method of :class:`OpenerDirector`, or ``None``. It should raise :exc:`~urllib.error.URLError`, unless a truly exceptional thing happens (for example, :exc:`MemoryError` should not be mapped to :exc:`~urllib.error.URLError`).
sv: Denna metod, om den är implementerad, kommer att anropas av den överordnade :class:`OpenerDirector`. Den bör returnera ett filliknande objekt som beskrivs i returvärdet för metoden :meth:`~OpenerDirector.open` i :class:`OpenerDirector`, eller ``None``. Den bör ge upphov till :exc:`~urllib.error.URLError`, såvida inte något verkligt exceptionellt inträffar (till exempel bör :exc:`MemoryError` inte mappas till :exc:`~urllib.error.URLError`).

source: This method will be called before any protocol-specific open method.
sv: Denna metod kommer att anropas före någon protokollspecifik öppen metod.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to handle URLs with the given protocol.
sv: Denna metod är *inte* definierad i :class:`BaseHandler`, men underklasser bör definiera den om de vill hantera URL:er med det angivna protokollet.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. Return values should be the same as for :meth:`~BaseHandler.default_open`.
sv: Denna metod, om den är definierad, kommer att anropas av den överordnade :class:`OpenerDirector`. Returvärdena bör vara desamma som för :meth:`~BaseHandler.default_open`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs with no specific registered handler to open it.
sv: Denna metod är *inte* definierad i :class:`BaseHandler`, men underklasser bör definiera den om de vill fånga upp alla URL:er som inte har någon specifik registrerad hanterare för att öppna den.

source: This method, if implemented, will be called by the :attr:`parent` :class:`OpenerDirector`. Return values should be the same as for :meth:`default_open`.
sv: Denna metod, om den implementeras, kommer att anropas av :attr:`parent` :class:`OpenerDirector`. Returvärdena bör vara desamma som för :meth:`default_open`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should override it if they intend to provide a catch-all for otherwise unhandled HTTP errors. It will be called automatically by the :class:`OpenerDirector` getting the error, and should not normally be called in other circumstances.
sv: Denna metod är *inte* definierad i :class:`BaseHandler`, men subklasser bör åsidosätta den om de avser att tillhandahålla en catch-all för annars ohanterade HTTP-fel. Den kommer att anropas automatiskt av den :class:`OpenerDirector` som får felet, och bör normalt inte anropas under andra omständigheter.

source: :class:`OpenerDirector` will call this method with five positional arguments:
sv: :class:`OpenerDirector` kommer att anropa denna metod med fem positionella argument:

source: a :class:`Request` object,
sv: ett :class:`Request`-objekt,

source: a file-like object with the HTTP error body,
sv: ett filliknande objekt med HTTP-feltexten,

source: the three-digit code of the error, as a string,
sv: den tresiffriga koden för felet, som en sträng,

source: the user-visible explanation of the code, as a string, and
sv: den för användaren synliga förklaringen av koden, som en sträng, och

source: the headers of the error, as a mapping object.
sv: rubrikerna för felet, som ett mappningsobjekt.

source: Return values and exceptions raised should be the same as those of :func:`urlopen`.
sv: Returvärden och undantag som tas upp bör vara desamma som för :func:`urlopen`.

source: *nnn* should be a three-digit HTTP error code. This method is also not defined in :class:`BaseHandler`, but will be called, if it exists, on an instance of a subclass, when an HTTP error with code *nnn* occurs.
sv: *nnn* bör vara en tresiffrig HTTP-felkod. Denna metod är inte heller definierad i :class:`BaseHandler`, men kommer att anropas, om den finns, på en instans av en subklass, när ett HTTP-fel med koden *nnn* inträffar.

source: Subclasses should override this method to handle specific HTTP errors.
sv: Underklasser bör åsidosätta denna metod för att hantera specifika HTTP-fel.

source: Arguments, return values and exceptions raised should be the same as for :meth:`~BaseHandler.http_error_default`.
sv: Argument, returvärden och undantag som tas upp bör vara desamma som för :meth:`~BaseHandler.http_error_default`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to pre-process requests of the given protocol.
sv: Denna metod är *inte* definierad i :class:`BaseHandler`, men underklasser bör definiera den om de vill förbehandla förfrågningar av det angivna protokollet.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. The return value should be a :class:`Request` object.
sv: Denna metod, om den är definierad, kommer att anropas av den överordnade :class:`OpenerDirector`. *req* kommer att vara ett :class:`Request`-objekt. Returvärdet bör vara ett :class:`Request`-objekt.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to post-process responses of the given protocol.
sv: Denna metod är *inte* definierad i :class:`BaseHandler`, men underklasser bör definiera den om de vill efterbehandla svar från det angivna protokollet.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. *response* will be an object implementing the same interface as the return value of :func:`urlopen`. The return value should implement the same interface as the return value of :func:`urlopen`.
sv: Denna metod, om den är definierad, kommer att anropas av den överordnade :class:`OpenerDirector`. *req* kommer att vara ett :class:`Request`-objekt. *response* kommer att vara ett objekt som implementerar samma gränssnitt som returvärdet för :func:`urlopen`. Returvärdet bör implementera samma gränssnitt som returvärdet för :func:`urlopen`.

source: HTTPRedirectHandler Objects
sv: HTTPRedirectHandler-objekt

source: Some HTTP redirections require action from this module's client code. If this is the case, :exc:`~urllib.error.HTTPError` is raised. See :rfc:`2616` for details of the precise meanings of the various redirection codes.
sv: Vissa HTTP-omdirigeringar kräver åtgärder från den här modulens klientkod. Om så är fallet kommer :exc:`~urllib.error.HTTPError` att uppstå. Se :rfc:`2616` för detaljer om den exakta betydelsen av de olika omdirigeringskoderna.

source: An :exc:`~urllib.error.HTTPError` exception raised as a security consideration if the HTTPRedirectHandler is presented with a redirected URL which is not an HTTP, HTTPS or FTP URL.
sv: Ett :exc:`~urllib.error.HTTPError`-undantag som uppstår av säkerhetsskäl om HTTPRedirectHandler presenteras med en omdirigerad URL som inte är en HTTP-, HTTPS- eller FTP-URL.

source: Return a :class:`Request` or ``None`` in response to a redirect. This is called by the default implementations of the :meth:`!http_error_30\*` methods when a redirection is received from the server. If a redirection should take place, return a new :class:`Request` to allow :meth:`!http_error_30\*` to perform the redirect to *newurl*. Otherwise, raise :exc:`~urllib.error.HTTPError` if no other handler should try to handle this URL, or return ``None`` if you can't but another handler might.
sv: Returnerar en :class:`Request` eller ``None`` som svar på en omdirigering. Detta anropas av standardimplementeringarna av :meth:`!http_error_30\*`-metoderna när en omdirigering tas emot från servern. Om en omdirigering ska ske, returnera en ny :class:`Request` för att tillåta :meth:`!http_error_30\*` att utföra omdirigeringen till *newurl*. I annat fall, skapa :exc:`~urllib.error.HTTPError` om ingen annan hanterare bör försöka hantera denna URL, eller returnera ``None`` om du inte kan men en annan hanterare kanske kan.

source: The default implementation of this method does not strictly follow :rfc:`2616`, which says that 301 and 302 responses to ``POST`` requests must not be automatically redirected without confirmation by the user. In reality, browsers do allow automatic redirection of these responses, changing the POST to a ``GET``, and the default implementation reproduces this behavior.
sv: Standardemplementeringen av denna metod följer inte strikt :rfc:`2616`, som säger att 301- och 302-svar på ``POST``-förfrågningar inte får omdirigeras automatiskt utan bekräftelse från användaren. I verkligheten tillåter webbläsare automatisk omdirigering av dessa svar, genom att ändra POST till en ``GET``, och standardimplementeringen reproducerar detta beteende.

source: Redirect to the ``Location:`` or ``URI:`` URL. This method is called by the parent :class:`OpenerDirector` when getting an HTTP 'moved permanently' response.
sv: Omdirigera till URL:en ``Location:`` eller ``URI:``. Denna metod anropas av den överordnade :class:`OpenerDirector` när den får ett HTTP-svar 'moved permanently'.

source: The same as :meth:`http_error_301`, but called for the 'found' response.
sv: Samma sak som :meth:`http_error_301`, men anropas för svaret "found".

source: The same as :meth:`http_error_301`, but called for the 'see other' response.
sv: Samma sak som :meth:`http_error_301`, men kallas för svaret "see other".

source: The same as :meth:`http_error_301`, but called for the 'temporary redirect' response. It does not allow changing the request method from ``POST`` to ``GET``.
sv: Samma som :meth:`http_error_301`, men kallas för svaret 'temporary redirect'. Det tillåter inte att ändra förfrågningsmetoden från ``POST`` till ``GET``.

source: The same as :meth:`http_error_301`, but called for the 'permanent redirect' response. It does not allow changing the request method from ``POST`` to ``GET``.
sv: Samma som :meth:`http_error_301`, men kallas för svaret 'permanent redirect'. Det tillåter inte att ändra förfrågningsmetoden från ``POST`` till ``GET``.

source: HTTPCookieProcessor Objects
sv: HTTPCookieProcessor-objekt

source: :class:`HTTPCookieProcessor` instances have one attribute:
sv: :class:`HTTPCookieProcessor`-instanser har ett attribut:

source: The :class:`http.cookiejar.CookieJar` in which cookies are stored.
sv: Den :class:`http.cookiejar.CookieJar` i vilken cookies lagras.

source: ProxyHandler Objects
sv: ProxyHandler-objekt

source: The :class:`ProxyHandler` will have a method :meth:`!<protocol>_open` for every *protocol* which has a proxy in the *proxies* dictionary given in the constructor. The method will modify requests to go through the proxy, by calling ``request.set_proxy()``, and call the next handler in the chain to actually execute the protocol.
sv: Klassen:`ProxyHandler` kommer att ha en metod :meth:`!<protocol>_open` för varje *protokoll* som har en proxy i *proxies*-ordlistan som ges i konstruktören. Metoden kommer att ändra förfrågningar så att de går genom proxyn, genom att anropa ``request.set_proxy()``, och anropa nästa hanterare i kedjan för att faktiskt exekvera protokollet.

source: HTTPPasswordMgr Objects
sv: HTTPPasswordMgr-objekt

source: These methods are available on :class:`HTTPPasswordMgr` and :class:`HTTPPasswordMgrWithDefaultRealm` objects.
sv: Dessa metoder är tillgängliga för objekten :class:`HTTPPasswordMgr` och :class:`HTTPPasswordMgrWithDefaultRealm`.

source: *uri* can be either a single URI, or a sequence of URIs. *realm*, *user* and *passwd* must be strings. This causes ``(user, passwd)`` to be used as authentication tokens when authentication for *realm* and a super-URI of any of the given URIs is given.
sv: *uri* kan vara antingen en enskild URI eller en sekvens av URI:er. *realm*, *user* och *passwd* måste vara strängar. Detta gör att ``(user, passwd)`` används som autentiseringstoken när autentisering för *realm* och en super-URI för någon av de angivna URI:erna anges.

source: Get user/password for given realm and URI, if any. This method will return ``(None, None)`` if there is no matching user/password.
sv: Hämta användare/lösenord för given realm och URI, om någon. Denna metod returnerar ``(None, None)`` om det inte finns någon matchande användare/lösenord.

source: For :class:`HTTPPasswordMgrWithDefaultRealm` objects, the realm ``None`` will be searched if the given *realm* has no matching user/password.
sv: För :class:`HTTPPasswordMgrWithDefaultRealm`-objekt kommer sfären ``None`` att sökas om den angivna *sfären* inte har någon matchande användare/lösenord.

source: HTTPPasswordMgrWithPriorAuth Objects
sv: HTTPPasswordMgrWithPriorAuth Objekt

source: This password manager extends :class:`HTTPPasswordMgrWithDefaultRealm` to support tracking URIs for which authentication credentials should always be sent.
sv: Denna lösenordshanterare utökar :class:`HTTPPasswordMgrWithDefaultRealm` för att stödja spårning av URI:er för vilka autentiseringsuppgifter alltid ska skickas.

source: *realm*, *uri*, *user*, *passwd* are as for :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* sets the initial value of the ``is_authenticated`` flag for the given URI or list of URIs. If *is_authenticated* is specified as ``True``, *realm* is ignored.
sv: *realm*, *uri*, *user*, *passwd* är som för :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* anger det initiala värdet för flaggan ``is_authenticated`` för den angivna URI:n eller listan med URI:er. Om *is_authenticated* anges som ``True`` ignoreras *realm*.

source: Same as for :class:`HTTPPasswordMgrWithDefaultRealm` objects
sv: Samma som för :class:`HTTPPasswordMgrWithDefaultRealm`-objekt

source: Update the ``is_authenticated`` flag for the given *uri* or list of URIs.
sv: Uppdaterar flaggan ``is_authenticated`` för den angivna *uri* eller listan med URI:er.

source: Returns the current state of the ``is_authenticated`` flag for the given URI.
sv: Returnerar det aktuella läget för flaggan ``is_authenticated`` för den angivna URI:n.

source: AbstractBasicAuthHandler Objects
sv: AbstractBasicAuthHandler-objekt

source: Handle an authentication request by getting a user/password pair, and re-trying the request. *authreq* should be the name of the header where the information about the realm is included in the request, *host* specifies the URL and path to authenticate for, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
sv: Hantera en autentiseringsbegäran genom att hämta ett par av användare/lösenord och försöka igen. *authreq* ska vara namnet på rubriken där informationen om sfären ingår i begäran, *host* anger URL och sökväg för autentisering, *req* ska vara det (misslyckade) :class:`Request`-objektet och *headers* ska vara felrubrikerna.

source: *host* is either an authority (e.g. ``"python.org"``) or a URL containing an authority component (e.g. ``"http://python.org/"``). In either case, the authority must not contain a userinfo component (so, ``"python.org"`` and ``"python.org:80"`` are fine, ``"joe:password@python.org"`` is not).
sv: *host* är antingen en auktoritet (t.ex. ``"python.org"``) eller en URL som innehåller en auktoritetskomponent (t.ex. ``"http://python.org/"``). I båda fallen får auktoriteten inte innehålla en userinfo-komponent (så ``"python.org"`` och ``"python.org:80"`` är bra, ``"joe:password@python.org"`` är det inte).

source: HTTPBasicAuthHandler Objects
sv: HTTPBasicAuthHandler-objekt

source: Retry the request with authentication information, if available.
sv: Försök igen med autentiseringsinformation, om sådan finns tillgänglig.

source: ProxyBasicAuthHandler Objects
sv: ProxyBasicAuthHandler-objekt

source: AbstractDigestAuthHandler Objects
sv: AbstractDigestAuthHandler-objekt

source: *authreq* should be the name of the header where the information about the realm is included in the request, *host* should be the host to authenticate to, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
sv: *authreq* ska vara namnet på det huvud där informationen om sfären inkluderas i begäran, *host* ska vara värden att autentisera sig mot, *req* ska vara det (misslyckade) :class:`Request`-objektet och *headers* ska vara felhuvudena.

source: HTTPDigestAuthHandler Objects
sv: HTTPDigestAuthHandler-objekt

source: ProxyDigestAuthHandler Objects
sv: ProxyDigestAuthHandler-objekt

source: HTTPHandler Objects
sv: HTTPHandler-objekt

source: Send an HTTP request, which can be either GET or POST, depending on ``req.data``.
sv: Skicka en HTTP-begäran, som kan vara antingen GET eller POST, beroende på ``req.data``.

source: HTTPSHandler Objects
sv: HTTPSHandler-objekt

source: Send an HTTPS request, which can be either GET or POST, depending on ``req.data``.
sv: Skicka en HTTPS-förfrågan, som kan vara antingen GET eller POST, beroende på ``req.data``.

source: FileHandler Objects
sv: FileHandler-objekt

source: Open the file locally, if there is no host name, or the host name is ``'localhost'``.
sv: Öppna filen lokalt om det inte finns något värdnamn eller om värdnamnet är ``'localhost``.

source: This method is applicable only for local hostnames. When a remote hostname is given, a :exc:`~urllib.error.URLError` is raised.
sv: Denna metod är endast tillämplig för lokala värdnamn. När ett fjärrvärddatornamn anges, uppstår ett :exc:`~urllib.error.URLError`.

source: DataHandler Objects
sv: DataHandler-objekt

source: Read a data URL. This kind of URL contains the content encoded in the URL itself. The data URL syntax is specified in :rfc:`2397`. This implementation ignores white spaces in base64 encoded data URLs so the URL may be wrapped in whatever source file it comes from. But even though some browsers don't mind about a missing padding at the end of a base64 encoded data URL, this implementation will raise a :exc:`ValueError` in that case.
sv: Läs en data-URL. Denna typ av URL innehåller innehållet som är kodat i själva URL:en. Syntaxen för data-URL:er anges i :rfc:`2397`. Den här implementationen ignorerar blanksteg i base64-kodade data-URL:er så att URL:en kan förpackas i vilken källfil den än kommer ifrån. Men även om vissa webbläsare inte bryr sig om att det saknas mellanslag i slutet av en base64-kodad data-URL, kommer den här implementationen att ge upphov till ett :exc:`ValueError` i så fall.

source: FTPHandler Objects
sv: FTPHandler-objekt

source: Open the FTP file indicated by *req*. The login is always done with empty username and password.
sv: Öppna den FTP-fil som anges med *req*. Inloggningen sker alltid med tomt användarnamn och lösenord.

source: CacheFTPHandler Objects
sv: CacheFTPHandler-objekt

source: :class:`CacheFTPHandler` objects are :class:`FTPHandler` objects with the following additional methods:
sv: :class:`CacheFTPHandler`-objekt är :class:`FTPHandler`-objekt med följande ytterligare metoder:

source: Set timeout of connections to *t* seconds.
sv: Ställ in timeout för anslutningar till *t* sekunder.

source: Set maximum number of cached connections to *m*.
sv: Ställ in maximalt antal cachade anslutningar till *m*.

source: UnknownHandler Objects
sv: UnknownHandler-objekt

source: Raise a :exc:`~urllib.error.URLError` exception.
sv: Utlöser ett :exc:`~urllib.error.URLError` undantag.

source: HTTPErrorProcessor Objects
sv: HTTPErrorProcessor-objekt

source: For 200 error codes, the response object is returned immediately.
sv: För 200-felkoder returneras svarsobjektet omedelbart.
