Repository: yeager/python-docs-sv
Catalog: library/urllib.request.po
Languages: sv

source: For non-200 error codes, this simply passes the job on to the :meth:`!http_error_\<type\>` handler methods, via :meth:`OpenerDirector.error`. Eventually, :class:`HTTPDefaultErrorHandler` will raise an :exc:`~urllib.error.HTTPError` if no other handler handles the error.
sv: För felkoder som inte är 200 skickas jobbet helt enkelt vidare till hanteringsmetoderna :meth:`!http_error_\<type\>`, via :meth:`OpenerDirector.error`. I slutändan kommer :class:`HTTPDefaultErrorHandler` att skapa en :exc:`~urllib.error.HTTPError` om ingen annan hanterare hanterar felet.

source: Process HTTPS error responses.
sv: Behandla HTTPS-felsvar.

source: The behavior is same as :meth:`http_response`.
sv: Beteendet är detsamma som :meth:`http_response`.

source: Examples
sv: Exempel

source: In addition to the examples below, more examples are given in :ref:`urllib-howto`.
sv: Förutom exemplen nedan finns fler exempel i :ref:`urllib-howto`.

source: This example gets the python.org main page and displays the first 300 bytes of it::
sv: Detta exempel hämtar huvudsidan för python.org och visar de första 300 byte av den::

source: Note that urlopen returns a bytes object. This is because there is no way for urlopen to automatically determine the encoding of the byte stream it receives from the HTTP server. In general, a program will decode the returned bytes object to string once it determines or guesses the appropriate encoding.
sv: Observera att urlopen returnerar ett bytes-objekt. Detta beror på att det inte finns något sätt för urlopen att automatiskt bestämma kodningen av byteströmmen som den tar emot från HTTP-servern. I allmänhet kommer ett program att avkoda det returnerade bytes-objektet till en sträng när det har bestämt eller gissat sig för lämplig kodning.

source: The following HTML spec document, https://html.spec.whatwg.org/#charset, lists the various ways in which an HTML or an XML document could have specified its encoding information.
sv: I följande HTML-specifikationsdokument, https://html.spec.whatwg.org/#charset, listas de olika sätt på vilka ett HTML- eller XML-dokument kan ha specificerat sin kodningsinformation.

source: For additional information, see the W3C document: https://www.w3.org/International/questions/qa-html-encoding-declarations.
sv: För ytterligare information, se W3C-dokumentet: https://www.w3.org/International/questions/qa-html-encoding-declarations.

source: As the python.org website uses *utf-8* encoding as specified in its meta tag, we will use the same for decoding the bytes object::
sv: Eftersom webbplatsen python.org använder *utf-8* kodning enligt specifikationen i dess metatagg, kommer vi att använda samma för att avkoda bytesobjektet::

source: >>> with urllib.request.urlopen('http://www.python.org/') as f: ... print(f.read(100).decode('utf-8')) ... <!doctype html> <!--[if lt IE 7]> <html class="no-js ie6 lt-ie7 lt-ie8 lt-ie9"> <![endif]--> <!-
sv: &gt;&gt;&gt; med urllib.request.urlopen('http://www.python.org/') som f: ... print(f.read(100).decode('utf-8')) ... <!doctype html> <!--[if lt IE 7]> <html class="no-js ie6 lt-ie7 lt-ie8 lt-ie9"> <![endif]--> &lt;!-

source: It is also possible to achieve the same result without using the :term:`context manager` approach::
sv: Det är också möjligt att uppnå samma resultat utan att använda :term:`kontexthanteraren`::

source: >>> import urllib.request >>> f = urllib.request.urlopen('http://www.python.org/') >>> try: ... print(f.read(100).decode('utf-8')) ... finally: ... f.close() ... <!doctype html> <!--[if lt IE 7]> <html class="no-js ie6 lt-ie7 lt-ie8 lt-ie9"> <![endif]--> <!--
sv: &gt;&gt;&gt; import urllib.request &gt;&gt;&gt; f = urllib.request.urlopen('http://www.python.org/') &gt;&gt;&gt; försök: ... print(f.read(100).decode('utf-8')) ... slutligen: ... f.close() ... <!doctype html> <!--[if lt IE 7]> <html class="no-js ie6 lt-ie7 lt-ie8 lt-ie9"> <![endif]--> &lt;!--

source: In the following example, we are sending a data-stream to the stdin of a CGI and reading the data it returns to us. Note that this example will only work when the Python installation supports SSL. ::
sv: I följande exempel skickar vi en dataström till stdin på en CGI och läser de data som den returnerar till oss. Observera att det här exemplet bara fungerar om Python-installationen stöder SSL. ::

source: >>> import urllib.request >>> req = urllib.request.Request(url='https://localhost/cgi-bin/test.cgi', ... data=b'This data is passed to stdin of the CGI') >>> with urllib.request.urlopen(req) as f: ... print(f.read().decode('utf-8')) ... Got Data: "This data is passed to stdin of the CGI"
sv: >>> import urllib.request >>> req = urllib.request.Request(url='https://localhost/cgi-bin/test.cgi', ... data=b'Denna data skickas till stdin i CGI') >>> med urllib.request.urlopen(req) som f: ... print(f.read().decode('utf-8')) ... Fick data: "Dessa data skickas till CGI:s stdin"

source: The code for the sample CGI used in the above example is::
sv: Koden för den exempel-CGI som används i exemplet ovan är::

source: Here is an example of doing a ``PUT`` request using :class:`Request`::
sv: Här är ett exempel på hur man gör en ``PUT`` förfrågan med :class:`Request`::

source: import urllib.request DATA = b'some data' req = urllib.request.Request(url='http://localhost:8080', data=DATA, method='PUT') with urllib.request.urlopen(req) as f: pass print(f.status) print(f.reason)
sv: import urllib.request DATA = b'några data' req = urllib.request.Request(url='http://localhost:8080', data=DATA, method='PUT') med urllib.request.urlopen(req) som f: pass print(f.status) print(f.reason)

source: Use of Basic HTTP Authentication::
sv: Användning av grundläggande HTTP-autentisering::

source: :func:`build_opener` provides many handlers by default, including a :class:`ProxyHandler`. By default, :class:`ProxyHandler` uses the environment variables named ``<scheme>_proxy``, where ``<scheme>`` is the URL scheme involved. For example, the :envvar:`!http_proxy` environment variable is read to obtain the HTTP proxy's URL.
sv: :func:`build_opener` tillhandahåller många hanterare som standard, inklusive en :class:`ProxyHandler`. Som standard använder :class:`ProxyHandler` miljövariablerna med namnet ``<scheme>_proxy``, där ``<scheme>`` är det aktuella URL-schemat. Till exempel läses miljövariabeln :envvar:`!http_proxy` för att få HTTP-proxyns URL.

source: This example replaces the default :class:`ProxyHandler` with one that uses programmatically supplied proxy URLs, and adds proxy authorization support with :class:`ProxyBasicAuthHandler`. ::
sv: Detta exempel ersätter standard :class:`ProxyHandler` med en som använder programmatiskt angivna proxy-URL:er och lägger till stöd för proxyauktorisering med :class:`ProxyBasicAuthHandler`. ::

source: proxy_handler = urllib.request.ProxyHandler({'http': 'http://www.example.com:3128/'}) proxy_auth_handler = urllib.request.ProxyBasicAuthHandler() proxy_auth_handler.add_password('realm', 'host', 'username', 'password') opener = urllib.request.build_opener(proxy_handler, proxy_auth_handler) # This time, rather than install the OpenerDirector, we use it directly: with opener.open('http://www.example.com/login.html') as f: print(f.read().decode('utf-8'))
sv: proxy_handler = urllib.request.ProxyHandler({'http': 'http://www.example.com:3128/'}) proxy_auth_handler = urllib.request.ProxyBasicAuthHandler() proxy_auth_handler.add_password('realm', 'host', 'username', 'password') opener = urllib.request.build_opener(proxy_handler, proxy_auth_handler) # Den här gången använder vi OpenerDirector direkt i stället för att installera den: med opener.open('http://www.example.com/login.html') som f: print(f.read().decode('utf-8'))

source: Adding HTTP headers:
sv: Lägga till HTTP-rubriker:

source: Use the *headers* argument to the :class:`Request` constructor, or::
sv: Använd *headers*-argumentet till :class:`Request`-konstruktören, eller::

source: import urllib.request req = urllib.request.Request('http://www.example.com/') req.add_header('Referer', 'http://www.python.org/') # Customize the default User-Agent header value: req.add_header('User-Agent', 'urllib-example/0.1 (Contact: . . .)') with urllib.request.urlopen(req) as f: print(f.read().decode('utf-8'))
sv: import urllib.request req = urllib.request.Request('http://www.example.com/') req.add_header('Referer', 'http://www.python.org/') # Anpassa standardvärdet för User-Agent-huvudet: req.add_header('User-Agent', 'urllib-example/0.1 (Kontakt: . . .)') med urllib.request.urlopen(req) som f: print(f.read().decode('utf-8'))

source: :class:`OpenerDirector` automatically adds a :mailheader:`User-Agent` header to every :class:`Request`. To change this::
sv: :class:`OpenerDirector` lägger automatiskt till en :mailheader:`User-Agent` header till varje :class:`Request`. För att ändra detta::

source: import urllib.request opener = urllib.request.build_opener() opener.addheaders = [('User-agent', 'Mozilla/5.0')] with opener.open('http://www.example.com/') as f: print(f.read().decode('utf-8'))
sv: import urllib.request opener = urllib.request.build_opener() opener.addheaders = [('User-agent', 'Mozilla/5.0')] med opener.open('http://www.example.com/') som f: print(f.read().decode('utf-8'))

source: Also, remember that a few standard headers (:mailheader:`Content-Length`, :mailheader:`Content-Type` and :mailheader:`Host`) are added when the :class:`Request` is passed to :func:`urlopen` (or :meth:`OpenerDirector.open`).
sv: Kom också ihåg att några standardrubriker (:mailheader:`Content-Length`, :mailheader:`Content-Type` och :mailheader:`Host`) läggs till när :class:`Request` skickas till :func:`urlopen` (eller :meth:`OpenerDirector.open`).

source: Here is an example session that uses the ``GET`` method to retrieve a URL containing parameters::
sv: Här är ett exempel på en session som använder metoden ``GET`` för att hämta en URL som innehåller parametrar::

source: The following example uses the ``POST`` method instead. Note that params output from urlencode is encoded to bytes before it is sent to urlopen as data::
sv: I följande exempel används istället metoden ``POST``. Notera att params-utdata från urlencode kodas till bytes innan det skickas till urlopen som data::

source: The following example uses an explicitly specified HTTP proxy, overriding environment settings::
sv: I följande exempel används en explicit angiven HTTP-proxy som åsidosätter miljöinställningarna::

source: >>> import urllib.request >>> proxies = {'http': 'http://proxy.example.com:8080/'} >>> opener = urllib.request.build_opener(urllib.request.ProxyHandler(proxies)) >>> with opener.open("http://www.python.org") as f: ... f.read().decode('utf-8') ...
sv: >>> import urllib.request >>> proxies = {'http': 'http://proxy.example.com:8080/'} >>> opener = urllib.request.build_opener(urllib.request.ProxyHandler(proxies)) >>> med opener.open("http://www.python.org") som f: ... f.read().decode('utf-8') ...

source: The following example uses no proxies at all, overriding environment settings::
sv: I följande exempel används inga proxyservrar alls, utan miljöinställningarna åsidosätts::

source: >>> import urllib.request >>> opener = urllib.request.build_opener(urllib.request.ProxyHandler({}})) >>> with opener.open("http://www.python.org/") as f: ... f.read().decode('utf-8') ...
sv: >>> import urllib.request >>> opener = urllib.request.build_opener(urllib.request.ProxyHandler({}}))) >>> med opener.open("http://www.python.org/") som f: ... f.read().decode('utf-8') ...

source: Legacy interface
sv: Äldre gränssnitt

source: The following functions and classes are ported from the Python 2 module ``urllib`` (as opposed to ``urllib2``). They might become deprecated at some point in the future.
sv: Följande funktioner och klasser är portade från Python 2-modulen ``urllib`` (i motsats till ``urllib2``). De kan komma att bli föråldrade någon gång i framtiden.

source: Copy a network object denoted by a URL to a local file. If the URL points to a local file, the object will not be copied unless filename is supplied. Return a tuple ``(filename, headers)`` where *filename* is the local file name under which the object can be found, and *headers* is whatever the :meth:`!info` method of the object returned by :func:`urlopen` returned (for a remote object). Exceptions are the same as for :func:`urlopen`.
sv: Kopierar ett nätverksobjekt som anges med en URL till en lokal fil. Om URL:en pekar på en lokal fil kommer objektet inte att kopieras om inte filnamnet anges. Returnerar en tupel ``(filename, headers)`` där *filnamn* är det lokala filnamnet under vilket objektet kan hittas, och *headers* är vad :meth:`!info`-metoden för objektet som returnerades av :func:`urlopen` returnerade (för ett fjärrobjekt). Undantag är desamma som för :func:`urlopen`.

source: The second argument, if present, specifies the file location to copy to (if absent, the location will be a tempfile with a generated name). The third argument, if present, is a callable that will be called once on establishment of the network connection and once after each block read thereafter. The callable will be passed three arguments; a count of blocks transferred so far, a block size in bytes, and the total size of the file. The third argument may be ``-1`` on older FTP servers which do not return a file size in response to a retrieval request.
sv: Det andra argumentet, om det finns, anger den filplats som ska kopieras till (om det inte finns någon plats kommer platsen att vara en tempfil med ett genererat namn). Det tredje argumentet, om det finns, är en callable som kommer att anropas en gång när nätverksanslutningen upprättas och en gång efter varje block som läses därefter. Anropet får tre argument: ett antal block som hittills har överförts, blockstorleken i byte och filens totala storlek. Det tredje argumentet kan vara ``-1`` på äldre FTP-servrar som inte returnerar en filstorlek som svar på en hämtningsbegäran.

source: The following example illustrates the most common usage scenario::
sv: Följande exempel illustrerar det vanligaste användningsscenariot::

source: >>> import urllib.request >>> local_filename, headers = urllib.request.urlretrieve('http://python.org/') >>> html = open(local_filename) >>> html.close()
sv: >>> import urllib.request >>> local_filename, headers = urllib.request.urlretrieve('http://python.org/') >>> html = öppna(lokalt_filnamn) >>> html.close()

source: If the *url* uses the :file:`http:` scheme identifier, the optional *data* argument may be given to specify a ``POST`` request (normally the request type is ``GET``). The *data* argument must be a bytes object in standard :mimetype:`application/x-www-form-urlencoded` format; see the :func:`urllib.parse.urlencode` function.
sv: Om *url* använder schemaidentifieraren :file:`http:` kan det valfria *data*-argumentet anges för att specificera en ``POST``-begäran (normalt är begärandetypen ``GET``). Argumentet *data* måste vara ett bytesobjekt i standardformatet :mimetype:`application/x-www-form-urlencoded`; se funktionen :func:`urllib.parse.urlencode`.

source: :func:`urlretrieve` will raise :exc:`~urllib.error.ContentTooShortError` when it detects that the amount of data available was less than the expected amount (which is the size reported by a *Content-Length* header). This can occur, for example, when the download is interrupted.
sv: :func:`urlretrieve` ger upphov till :exc:`~urllib.error.ContentTooShortError` när den upptäcker att mängden tillgängliga data var mindre än den förväntade mängden (vilket är den storlek som rapporteras av en *Content-Length*-header). Detta kan t.ex. inträffa när nedladdningen avbryts.

source: The *Content-Length* is treated as a lower bound: if there's more data to read, urlretrieve reads more data, but if less data is available, it raises the exception.
sv: *Content-Length* behandlas som en nedre gräns: om det finns mer data att läsa, läser urlretrieve mer data, men om mindre data finns tillgängliga, uppstår ett undantag.

source: You can still retrieve the downloaded data in this case, it is stored in the :attr:`!content` attribute of the exception instance.
sv: Du kan fortfarande hämta de nedladdade uppgifterna i det här fallet, de lagras i attributet :attr:`!content` i undantagsinstansen.

source: If no *Content-Length* header was supplied, urlretrieve can not check the size of the data it has downloaded, and just returns it. In this case you just have to assume that the download was successful.
sv: Om ingen *Content-Length*-header har angetts kan urlretrieve inte kontrollera storleken på de data den har hämtat, utan returnerar dem bara. I det här fallet får man anta att nedladdningen lyckades.

source: Cleans up temporary files that may have been left behind by previous calls to :func:`urlretrieve`.
sv: Rensar bort temporära filer som kan ha lämnats kvar av tidigare anrop till :func:`urlretrieve`.

source: :mod:`urllib.request` Restrictions
sv: :mod:`urllib.request` Begränsningar

source: Currently, only the following protocols are supported: HTTP (versions 0.9 and 1.0), FTP, local files, and data URLs.
sv: För närvarande stöds endast följande protokoll: HTTP (version 0.9 och 1.0), FTP, lokala filer och data-URL:er.

source: Added support for data URLs.
sv: Stöd för data-URL:er har lagts till.

source: The caching feature of :func:`urlretrieve` has been disabled until someone finds the time to hack proper processing of Expiration time headers.
sv: Cachningsfunktionen i :func:`urlretrieve` har inaktiverats tills någon hittar tid att hacka korrekt bearbetning av Expiration time-rubriker.

source: There should be a function to query whether a particular URL is in the cache.
sv: Det bör finnas en funktion för att fråga om en viss URL finns i cacheminnet.

source: For backward compatibility, if a URL appears to point to a local file but the file can't be opened, the URL is re-interpreted using the FTP protocol. This can sometimes cause confusing error messages.
sv: Om en URL verkar peka på en lokal fil men filen inte kan öppnas tolkas URL:en på nytt med FTP-protokollet av bakåtkompatibilitetsskäl. Detta kan ibland orsaka förvirrande felmeddelanden.

source: The :func:`urlopen` and :func:`urlretrieve` functions can cause arbitrarily long delays while waiting for a network connection to be set up. This means that it is difficult to build an interactive web client using these functions without using threads.
sv: Funktionerna :func:`urlopen` och :func:`urlretrieve` kan orsaka godtyckligt långa fördröjningar i väntan på att en nätverksanslutning skall upprättas. Detta innebär att det är svårt att bygga en interaktiv webbklient med hjälp av dessa funktioner utan att använda trådar.

source: The data returned by :func:`urlopen` or :func:`urlretrieve` is the raw data returned by the server. This may be binary data (such as an image), plain text or (for example) HTML. The HTTP protocol provides type information in the reply header, which can be inspected by looking at the :mailheader:`Content-Type` header. If the returned data is HTML, you can use the module :mod:`html.parser` to parse it.
sv: De data som returneras av :func:`urlopen` eller :func:`urlretrieve` är de rådata som returneras av servern. Det kan vara binära data (t.ex. en bild), vanlig text eller (t.ex.) HTML. HTTP-protokollet tillhandahåller typinformation i svarshuvudet, som kan inspekteras genom att titta på :mailheader:`Content-Type` -huvudet. Om de returnerade uppgifterna är HTML kan du använda modulen :mod:`html.parser` för att analysera dem.

source: The code handling the FTP protocol cannot differentiate between a file and a directory. This can lead to unexpected behavior when attempting to read a URL that points to a file that is not accessible. If the URL ends in a ``/``, it is assumed to refer to a directory and will be handled accordingly. But if an attempt to read a file leads to a 550 error (meaning the URL cannot be found or is not accessible, often for permission reasons), then the path is treated as a directory in order to handle the case when a directory is specified by a URL but the trailing ``/`` has been left off. This can cause misleading results when you try to fetch a file whose read permissions make it inaccessible; the FTP code will try to read it, fail with a 550 error, and then perform a directory listing for the unreadable file. If fine-grained control is needed, consider using the :mod:`ftplib` module.
sv: Koden som hanterar FTP-protokollet kan inte skilja mellan en fil och en katalog. Detta kan leda till oväntat beteende när man försöker läsa en URL som pekar på en fil som inte är tillgänglig. Om URL:en slutar med ``/`` antas den hänvisa till en katalog och hanteras därefter. Men om ett försök att läsa en fil leder till ett 550-fel (vilket innebär att URL:en inte kan hittas eller inte är tillgänglig, ofta av behörighetsskäl), behandlas sökvägen som en katalog för att hantera fallet när en katalog anges av en URL men den efterföljande ``/`` har utelämnats. Detta kan leda till missvisande resultat när du försöker hämta en fil som inte kan läsas på grund av läsbehörigheter. FTP-koden försöker läsa den, misslyckas med ett 550-fel och utför sedan en kataloglistning för den oläsbara filen. Om du behöver mer detaljerad kontroll bör du överväga att använda modulen :mod:`ftplib`.

source: :mod:`urllib.response` --- Response classes used by urllib
sv: :mod:`urllib.response` --- Svarsklasser som används av urllib

source: The :mod:`urllib.response` module defines functions and classes which define a minimal file-like interface, including ``read()`` and ``readline()``. Functions defined by this module are used internally by the :mod:`urllib.request` module. The typical response object is a :class:`urllib.response.addinfourl` instance:
sv: Modulen :mod:`urllib.response` definierar funktioner och klasser som definierar ett minimalt filliknande gränssnitt, inklusive ``read()`` och ``readline()``. Funktioner som definieras av denna modul används internt av modulen :mod:`urllib.request`. Det typiska svarsobjektet är en :class:`urllib.response.addinfourl`-instans:

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
sv: URL för den hämtade resursen, används vanligen för att avgöra om en omdirigering följdes.

source: Returns the headers of the response in the form of an :class:`~email.message.EmailMessage` instance.
sv: Returnerar svarets rubriker i form av en :class:`~email.message.EmailMessage`-instans.

source: Status code returned by server.
sv: Statuskod som returneras av servern.

source: Deprecated in favor of :attr:`~addinfourl.url`.
sv: Föråldrad till förmån för :attr:`~addinfourl.url`.

source: Deprecated in favor of :attr:`~addinfourl.headers`.
sv: Föråldrad till förmån för :attr:`~addinfourl.headers`.

source: Deprecated in favor of :attr:`~addinfourl.status`.
sv: Föråldrad till förmån för :attr:`~addinfourl.status`.

source: protocol
sv: protokoll
