Repository: yeager/python-docs-sv
Catalog: library/urllib.request.po
Languages: sv

source: :mod:`!urllib.request` --- Extensible library for opening URLs
sv: :mod:`!urllib.request` --- Utökat bibliotek för att öppna webbadresser

source: **Source code:** :source:`Lib/urllib/request.py`
sv: **Källkod:** :source:`Lib/urllib/request.py`

source: The :mod:`urllib.request` module defines functions and classes which help in opening URLs (mostly HTTP) in a complex world --- basic and digest authentication, redirections, cookies and more.
sv: Modulen :mod:`urllib.request` definierar funktioner och klasser som hjälper till att öppna webbadresser (oftast HTTP) i en komplex värld --- grundläggande och samlad autentisering, omdirigeringar, cookies och mer.

source: The `Requests package <https://requests.readthedocs.io/en/master/>`_ is recommended for a higher-level HTTP client interface.
sv: Paketet `Requests <https://requests.readthedocs.io/en/master/>`_ rekommenderas för ett HTTP-klientgränssnitt på högre nivå.

source: On macOS it is unsafe to use this module in programs using :func:`os.fork` because the :func:`getproxies` implementation for macOS uses a higher-level system API. Set the environment variable ``no_proxy`` to ``*`` to avoid this problem (e.g. ``os.environ["no_proxy"] = "*"``).
sv: På macOS är det inte säkert att använda denna modul i program som använder :func:`os.fork` eftersom :func:`getproxies`-implementeringen för macOS använder ett system-API på högre nivå. Ställ in miljövariabeln ``no_proxy`` till ``*`` för att undvika detta problem (t.ex. ``os.environ["no_proxy"] = "*"``).

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: The :mod:`urllib.request` module defines the following functions:
sv: Modulen :mod:`urllib.request` definierar följande funktioner:

source: Open *url*, which can be either a string containing a valid, properly encoded URL, or a :class:`Request` object.
sv: Öppna *url*, som kan vara antingen en sträng som innehåller en giltig, korrekt kodad URL eller ett :class:`Request`-objekt.

source: *data* must be an object specifying additional data to be sent to the server, or ``None`` if no such data is needed. See :class:`Request` for details.
sv: *data* måste vara ett objekt som anger ytterligare data som ska skickas till servern, eller ``None`` om inga sådana data behövs. Se :class:`Request` för detaljer.

source: urllib.request module uses HTTP/1.1 and includes ``Connection:close`` header in its HTTP requests.
sv: urllib.request-modulen använder HTTP/1.1 och inkluderar rubriken ``Connection:close`` i sina HTTP-förfrågningar.

source: The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). This actually only works for HTTP, HTTPS and FTP connections.
sv: Den valfria parametern *timeout* anger en timeout i sekunder för blockering av åtgärder som anslutningsförsöket (om den inte anges kommer den globala standardinställningen för timeout att användas). Detta fungerar faktiskt bara för HTTP-, HTTPS- och FTP-anslutningar.

source: If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options. See :class:`~http.client.HTTPSConnection` for more details.
sv: Om *context* anges måste det vara en :class:`ssl.SSLContext`-instans som beskriver de olika SSL-alternativen. Se :class:`~http.client.HTTPSConnection` för mer information.

source: This function always returns an object which can work as a :term:`context manager` and has the properties *url*, *headers*, and *status*. See :class:`urllib.response.addinfourl` for more detail on these properties.
sv: Denna funktion returnerar alltid ett objekt som kan fungera som en :term:`context manager` och som har egenskaperna *url*, *headers* och *status*. Se :class:`urllib.response.addinfourl` för mer information om dessa egenskaper.

source: For HTTP and HTTPS URLs, this function returns a :class:`http.client.HTTPResponse` object slightly modified. In addition to the three new methods above, the msg attribute contains the same information as the :attr:`~http.client.HTTPResponse.reason` attribute --- the reason phrase returned by server --- instead of the response headers as it is specified in the documentation for :class:`~http.client.HTTPResponse`.
sv: För HTTP- och HTTPS-URL:er returnerar denna funktion ett :class:`http.client.HTTPResponse`-objekt något modifierat. Förutom de tre nya metoderna ovan innehåller msg-attributet samma information som :attr:`~http.client.HTTPResponse.reason`-attributet --- den reason-fras som returneras av servern --- istället för svarshuvudena som det specificeras i dokumentationen för :class:`~http.client.HTTPResponse`.

source: For FTP, file, and data URLs, this function returns a :class:`urllib.response.addinfourl` object.
sv: För FTP-, fil- och data-URL:er returnerar denna funktion ett :class:`urllib.response.addinfourl`-objekt.

source: Raises :exc:`~urllib.error.URLError` on protocol errors.
sv: Utlöser :exc:`~urllib.error.URLError` vid protokollfel.

source: Note that ``None`` may be returned if no handler handles the request (though the default installed global :class:`OpenerDirector` uses :class:`UnknownHandler` to ensure this never happens).
sv: Observera att ``None`` kan returneras om ingen hanterare hanterar begäran (även om den standardinstallerade globala :class:`OpenerDirector` använder :class:`UnknownHandler` för att säkerställa att detta aldrig händer).

source: In addition, if proxy settings are detected (for example, when a ``*_proxy`` environment variable like :envvar:`!http_proxy` is set), :class:`ProxyHandler` is default installed and makes sure the requests are handled through the proxy.
sv: Om proxyinställningar upptäcks (t.ex. när en miljövariabel ``*_proxy`` som :envvar:`!http_proxy`` är inställd) installeras dessutom :class:`ProxyHandler` som standard och ser till att förfrågningarna hanteras via proxyn.

source: The legacy ``urllib.urlopen`` function from Python 2.6 and earlier has been discontinued; :func:`urllib.request.urlopen` corresponds to the old ``urllib2.urlopen``. Proxy handling, which was done by passing a dictionary parameter to ``urllib.urlopen``, can be obtained by using :class:`ProxyHandler` objects.
sv: Den äldre funktionen ``urllib.urlopen`` från Python 2.6 och tidigare har utgått; :func:`urllib.request.urlopen`` motsvarar den gamla ``urllib2.urlopen``. Proxyhantering, som gjordes genom att skicka en dictionary-parameter till ``urllib.urlopen``, kan erhållas genom att använda :class:`ProxyHandler`-objekt.

source: The default opener raises an :ref:`auditing event <auditing>` ``urllib.Request`` with arguments ``fullurl``, ``data``, ``headers``, ``method`` taken from the request object.
sv: Standardöppnaren utlöser en :ref:`auditing event <auditing>``urllib.Request`` med argumenten ``fullurl``, ``data``, ``headers``, ``method`` hämtade från request-objektet.

source: *cafile* and *capath* were added.
sv: *cafile* och *capath* har lagts till.

source: HTTPS virtual hosts are now supported if possible (that is, if :const:`ssl.HAS_SNI` is true).
sv: Virtuella HTTPS-värdar stöds nu om det är möjligt (dvs. om :const:`ssl.HAS_SNI` är true).

source: *data* can be an iterable object.
sv: *data* kan vara ett itererbart objekt.

source: *cadefault* was added.
sv: *cadefault* lades till.

source: *context* was added.
sv: *sammanhang* lades till.

source: HTTPS connection now send an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocols`.
sv: HTTPS-anslutning skickar nu ett ALPN-tillägg med protokollindikatorn ``http/1.1`` när ingen *kontext* anges. Anpassad *kontext* bör ställa in ALPN-protokoll med :meth:`~ssl.SSLContext.set_alpn_protocols`.

source: Remove *cafile*, *capath* and *cadefault* parameters: use the *context* parameter instead.
sv: Ta bort parametrarna *cafile*, *capath* och *cadefault*: använd parametern *context* i stället.

source: Install an :class:`OpenerDirector` instance as the default global opener. Installing an opener is only necessary if you want urlopen to use that opener; otherwise, simply call :meth:`OpenerDirector.open` instead of :func:`~urllib.request.urlopen`. The code does not check for a real :class:`OpenerDirector`, and any class with the appropriate interface will work.
sv: Installera en instans av :class:`OpenerDirector` som global standardöppnare. Att installera en öppnare är bara nödvändigt om du vill att urlopen ska använda den öppnaren; annars anropar du helt enkelt :meth:`OpenerDirector.open` istället för :func:`~urllib.request.urlopen`. Koden kontrollerar inte om det finns en riktig :class:`OpenerDirector`, och vilken klass som helst med lämpligt gränssnitt kommer att fungera.

source: Return an :class:`OpenerDirector` instance, which chains the handlers in the order given. *handler*\s can be either instances of :class:`BaseHandler`, or subclasses of :class:`BaseHandler` (in which case it must be possible to call the constructor without any parameters). Instances of the following classes will be in front of the *handler*\s, unless the *handler*\s contain them, instances of them or subclasses of them: :class:`ProxyHandler` (if proxy settings are detected), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.
sv: Returnerar en :class:`OpenerDirector`-instans, som kedjar handlers i den ordning som anges. *handler*\s kan vara antingen instanser av :class:`BaseHandler`, eller subklasser av :class:`BaseHandler` (i vilket fall det måste vara möjligt att anropa konstruktören utan några parametrar). Instanser av följande klasser kommer att stå framför *handler*\s, såvida inte *handler*\s innehåller dem, instanser av dem eller subklasser av dem: :class:`ProxyHandler` (om proxyinställningar upptäcks), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.

source: If the Python installation has SSL support (i.e., if the :mod:`ssl` module can be imported), :class:`HTTPSHandler` will also be added.
sv: Om Python-installationen har SSL-stöd (dvs. om modulen :mod:`ssl` kan importeras) kommer även :class:`HTTPSHandler` att läggas till.

source: A :class:`BaseHandler` subclass may also change its :attr:`handler_order` attribute to modify its position in the handlers list.
sv: En :class:`BaseHandler` subklass kan också ändra sitt :attr:`handler_order` attribut för att ändra sin position i listan över handlers.

source: Convert the given local path to a ``file:`` URL. This function uses :func:`~urllib.parse.quote` function to encode the path.
sv: Konverterar den angivna lokala sökvägen till en ``file:`` URL. Denna funktion använder :func:`~urllib.parse.quote`-funktionen för att koda sökvägen.

source: If *add_scheme* is false (the default), the return value omits the ``file:`` scheme prefix. Set *add_scheme* to true to return a complete URL.
sv: Om *add_scheme* är false (standard) utelämnas prefixet ``file:`` för schemat i returvärdet. Sätt *add_scheme* till true för att returnera en komplett URL.

source: This example shows the function being used on Windows::
sv: Detta exempel visar hur funktionen används i Windows::

source: Windows drive letters are no longer converted to uppercase, and ``:`` characters not following a drive letter no longer cause an :exc:`OSError` exception to be raised on Windows.
sv: Windows-enhetsbokstäver konverteras inte längre till versaler, och ``:``-tecken som inte följer efter en enhetsbokstav orsakar inte längre ett :exc:`OSError`-undantag i Windows.

source: Paths beginning with a slash are converted to URLs with authority sections. For example, the path ``/etc/hosts`` is converted to the URL ``///etc/hosts``.
sv: Sökvägar som börjar med ett snedstreck konverteras till webbadresser med auktoritetsavsnitt. Till exempel konverteras sökvägen ``/etc/hosts`` till URL:en ``///etc/hosts``.

source: The *add_scheme* parameter was added.
sv: Parametern *add_scheme* har lagts till.

source: Convert the given ``file:`` URL to a local path. This function uses :func:`~urllib.parse.unquote` to decode the URL.
sv: Konverterar den angivna ``file:`` URL:en till en lokal sökväg. Denna funktion använder :func:`~urllib.parse.unquote` för att avkoda URL:en.

source: If *require_scheme* is false (the default), the given value should omit a ``file:`` scheme prefix. If *require_scheme* is set to true, the given value should include the prefix; a :exc:`~urllib.error.URLError` is raised if it doesn't.
sv: Om *require_scheme* är false (standard) ska det angivna värdet utelämna ett prefix för ``file:``-schema. Om *require_scheme* är satt till true, bör det angivna värdet innehålla prefixet; ett :exc:`~urllib.error.URLError` uppstår om det inte gör det.

source: The URL authority is discarded if it is empty, ``localhost``, or the local hostname. Otherwise, if *resolve_host* is set to true, the authority is resolved using :func:`socket.gethostbyname` and discarded if it matches a local IP address (as per :rfc:`RFC 8089 §3 <8089#section-3>`). If the authority is still unhandled, then on Windows a UNC path is returned, and on other platforms a :exc:`~urllib.error.URLError` is raised.
sv: URL-auktoriteten kasseras om den är tom, ``localhost`` eller det lokala värdnamnet. I annat fall, om *resolve_host* är satt till true, löses auktoriteten upp med :func:`socket.gethostbyname` och kasseras om den matchar en lokal IP-adress (enligt :rfc:`RFC 8089 §3 <8089#section-3>`). Om behörigheten fortfarande inte kan hanteras returneras en UNC-sökväg på Windows och ett :exc:`~urllib.error.URLError` på andra plattformar.

source: >>> from urllib.request import url2pathname >>> url = 'file:///C:/Program%20Files' >>> url2pathname(url, require_scheme=True) 'C:\\Program Files'
sv: >>> från urllib.request import url2pathname >>> url = 'file:///C:/Program%20Files' >>> url2pathname(url, require_scheme=True) 'C:\\Programfiler'

source: The URL authority is discarded if it matches the local hostname. Otherwise, if the authority isn't empty or ``localhost``, then on Windows a UNC path is returned (as before), and on other platforms a :exc:`~urllib.error.URLError` is raised.
sv: URL-auktoriteten kasseras om den matchar det lokala värdnamnet. I annat fall, om auktoriteten inte är tom eller ``localhost``, returneras en UNC-sökväg på Windows (som tidigare) och på andra plattformar genereras ett :exc:`~urllib.error.URLError`.

source: The URL query and fragment components are discarded if present.
sv: URL-frågan och fragmentkomponenterna kasseras om de finns med.

source: The *require_scheme* and *resolve_host* parameters were added.
sv: Parametrarna *require_scheme* och *resolve_host* har lagts till.

source: This helper function returns a dictionary of scheme to proxy server URL mappings. It scans the environment for variables named ``<scheme>_proxy``, in a case insensitive approach, for all operating systems first, and when it cannot find it, looks for proxy information from System Configuration for macOS and Windows Systems Registry for Windows. If both lowercase and uppercase environment variables exist (and disagree), lowercase is preferred.
sv: Denna hjälpfunktion returnerar en ordbok med URL-mappningar mellan schema och proxyserver. Den söker i miljön efter variabler med namnet ``<scheme>_proxy``, utan hänsyn till versaler, för alla operativsystem först, och när den inte hittar den söker den efter proxyinformation från System Configuration för macOS och Windows Systems Registry för Windows. Om det finns miljövariabler med både små och stora bokstäver (och de inte är överens) föredras små bokstäver.

source: If the environment variable ``REQUEST_METHOD`` is set, which usually indicates your script is running in a CGI environment, the environment variable ``HTTP_PROXY`` (uppercase ``_PROXY``) will be ignored. This is because that variable can be injected by a client using the "Proxy:" HTTP header. If you need to use an HTTP proxy in a CGI environment, either use ``ProxyHandler`` explicitly, or make sure the variable name is in lowercase (or at least the ``_proxy`` suffix).
sv: Om miljövariabeln ``REQUEST_METHOD`` är inställd, vilket vanligtvis indikerar att ditt skript körs i en CGI-miljö, kommer miljövariabeln ``HTTP_PROXY`` (versaler ``_PROXY``) att ignoreras. Detta beror på att den variabeln kan injiceras av en klient med hjälp av HTTP-rubriken "Proxy:". Om du behöver använda en HTTP-proxy i en CGI-miljö, använd antingen ``ProxyHandler`` explicit, eller se till att variabelnamnet är i gemener (eller åtminstone suffixet ``_proxy``).

source: The following classes are provided:
sv: Följande klasser erbjuds:

source: This class is an abstraction of a URL request.
sv: Denna klass är en abstraktion av en URL-begäran.

source: *url* should be a string containing a valid, properly encoded URL.
sv: *url* ska vara en sträng som innehåller en giltig, korrekt kodad URL.

source: *data* must be an object specifying additional data to send to the server, or ``None`` if no such data is needed. Currently HTTP requests are the only ones that use *data*. The supported object types include bytes, file-like objects, and iterables of bytes-like objects. If no ``Content-Length`` nor ``Transfer-Encoding`` header field has been provided, :class:`HTTPHandler` will set these headers according to the type of *data*. ``Content-Length`` will be used to send bytes objects, while ``Transfer-Encoding: chunked`` as specified in :rfc:`7230`, Section 3.3.1 will be used to send files and other iterables.
sv: *data* måste vara ett objekt som anger ytterligare data som ska skickas till servern, eller ``None`` om inga sådana data behövs. För närvarande är HTTP-förfrågningar de enda som använder *data*. De objekttyper som stöds är bytes, filliknande objekt och iterabler av bytesliknande objekt. Om inget ``Content-Length`` eller ``Transfer-Encoding`` rubrikfält har tillhandahållits, kommer :class:`HTTPHandler`` att ställa in dessa rubriker enligt typen av *data*. ``Content-Length`` kommer att användas för att skicka bytesobjekt, medan ``Transfer-Encoding: chunked`` enligt specifikationen i :rfc:`7230`, avsnitt 3.3.1 kommer att användas för att skicka filer och andra iterabler.

source: For an HTTP POST request method, *data* should be a buffer in the standard :mimetype:`application/x-www-form-urlencoded` format. The :func:`urllib.parse.urlencode` function takes a mapping or sequence of 2-tuples and returns an ASCII string in this format. It should be encoded to bytes before being used as the *data* parameter.
sv: För en HTTP POST-begäran bör *data* vara en buffert i standardformatet :mimetype:`application/x-www-form-urlencoded`. Funktionen :func:`urllib.parse.urlencode` tar en mappning eller en sekvens av 2-tupler och returnerar en ASCII-sträng i detta format. Den bör kodas till bytes innan den används som *data*-parameter.

source: *headers* should be a dictionary, and will be treated as if :meth:`add_header` was called with each key and value as arguments. This is often used to "spoof" the ``User-Agent`` header value, which is used by a browser to identify itself -- some HTTP servers only allow requests coming from common browsers as opposed to scripts. For example, Mozilla Firefox may identify itself as ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, while :mod:`urllib`'s default user agent string is ``"Python-urllib/2.6"`` (on Python 2.6). All header keys are sent in camel case.
sv: *headers* bör vara en ordbok och kommer att behandlas som om :meth:`add_header` hade anropats med varje nyckel och värde som argument. Detta används ofta för att "förfalska" ``User-Agent``-headervärdet, som används av en webbläsare för att identifiera sig själv - vissa HTTP-servrar tillåter bara förfrågningar som kommer från vanliga webbläsare i motsats till skript. Till exempel kan Mozilla Firefox identifiera sig som ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, medan :mod:`urllib`:s standardiserade användaragentsträng är ``"Python-urllib/2.6"`` (på Python 2.6). Alla rubriknycklar skickas i kamelbokstäver.

source: An appropriate ``Content-Type`` header should be included if the *data* argument is present. If this header has not been provided and *data* is not ``None``, ``Content-Type: application/x-www-form-urlencoded`` will be added as a default.
sv: Ett lämpligt ``Content-Type``-huvud bör inkluderas om *data*-argumentet finns. Om detta huvud inte har angetts och *data* inte är ``None``, kommer ``Content-Type: application/x-www-form-urlencoded`` att läggas till som standard.

source: The next two arguments are only of interest for correct handling of third-party HTTP cookies:
sv: De två följande argumenten är endast av intresse för korrekt hantering av HTTP-cookies från tredje part:

source: *origin_req_host* should be the request-host of the origin transaction, as defined by :rfc:`2965`. It defaults to ``http.cookiejar.request_host(self)``. This is the host name or IP address of the original request that was initiated by the user. For example, if the request is for an image in an HTML document, this should be the request-host of the request for the page containing the image.
sv: *origin_req_host* bör vara request-host för ursprungstransaktionen, enligt definitionen i :rfc:`2965`. Standardvärdet är ``http.cookiejar.request_host(self)``. Detta är värdnamnet eller IP-adressen för den ursprungliga begäran som initierades av användaren. Om begäran t.ex. gäller en bild i ett HTML-dokument bör detta vara request-host för begäran om den sida som innehåller bilden.

source: *unverifiable* should indicate whether the request is unverifiable, as defined by :rfc:`2965`. It defaults to ``False``. An unverifiable request is one whose URL the user did not have the option to approve. For example, if the request is for an image in an HTML document, and the user had no option to approve the automatic fetching of the image, this should be true.
sv: *unverifiable* bör ange om begäran är overifierbar, enligt definitionen i :rfc:`2965`. Standardvärdet är ``False``. En begäran som inte kan verifieras är en begäran vars URL användaren inte hade möjlighet att godkänna. Om begäran t.ex. gäller en bild i ett HTML-dokument och användaren inte hade någon möjlighet att godkänna automatisk hämtning av bilden, bör detta vara sant.

source: *method* should be a string that indicates the HTTP request method that will be used (e.g. ``'HEAD'``). If provided, its value is stored in the :attr:`~Request.method` attribute and is used by :meth:`get_method`. The default is ``'GET'`` if *data* is ``None`` or ``'POST'`` otherwise. Subclasses may indicate a different default method by setting the :attr:`~Request.method` attribute in the class itself.
sv: *method* bör vara en sträng som anger vilken HTTP-förfrågningsmetod som ska användas (t.ex. ``'HEAD'``). Om den tillhandahålls lagras dess värde i attributet :attr:`~Request.method` och används av :meth:`get_method`. Standardvärdet är ``'GET'`` om *data* är ``None`` eller ``'POST'`` annars. Subklasser kan ange en annan standardmetod genom att ställa in attributet :attr:`~Request.method` i själva klassen.
