Repository: yeager/python-docs-sv
Catalog: library/urllib.request.po
Languages: sv

source: The request will not work as expected if the data object is unable to deliver its content more than once (e.g. a file or an iterable that can produce the content only once) and the request is retried for HTTP redirects or authentication. The *data* is sent to the HTTP server right away after the headers. There is no support for a 100-continue expectation in the library.
sv: Begäran kommer inte att fungera som förväntat om dataobjektet inte kan leverera sitt innehåll mer än en gång (t.ex. en fil eller en iterabel som bara kan producera innehållet en gång) och begäran omprövas för HTTP-omdirigeringar eller autentisering. *Data* skickas till HTTP-servern direkt efter rubrikerna. Det finns inget stöd för en 100-continue-förväntan i biblioteket.

source: :attr:`Request.method` argument is added to the Request class.
sv: :attr:`Request.method`-argumentet läggs till i Request-klassen.

source: Default :attr:`Request.method` may be indicated at the class level.
sv: Standard :attr:`Request.method` kan anges på klassnivå.

source: Do not raise an error if the ``Content-Length`` has not been provided and *data* is neither ``None`` nor a bytes object. Fall back to use chunked transfer encoding instead.
sv: Ge inte felmeddelanden om ``Content-Length`` inte har angetts och *data* varken är ``None`` eller ett bytes-objekt. Fall tillbaka till att använda chunked transfer encoding istället.

source: The :class:`OpenerDirector` class opens URLs via :class:`BaseHandler`\ s chained together. It manages the chaining of handlers, and recovery from errors.
sv: Klassen :class:`OpenerDirector` öppnar URL:er via :class:`BaseHandler` som kedjats ihop. Den hanterar kedjandet av handlers och återställning efter fel.

source: This is the base class for all registered handlers --- and handles only the simple mechanics of registration.
sv: Detta är basklassen för alla registrerade handläggare --- och hanterar endast de enkla mekanikerna för registrering.

source: A class which defines a default handler for HTTP error responses; all responses are turned into :exc:`~urllib.error.HTTPError` exceptions.
sv: En klass som definierar en standardhanterare för HTTP-felsvar; alla svar förvandlas till :exc:`~urllib.error.HTTPError`-undantag.

source: A class to handle redirections.
sv: En klass för att hantera omdirigeringar.

source: A class to handle HTTP Cookies.
sv: En klass för att hantera HTTP-cookies.

source: Cause requests to go through a proxy. If *proxies* is given, it must be a dictionary mapping protocol names to URLs of proxies. The default is to read the list of proxies from the environment variables ``<protocol>_proxy``. If no proxy environment variables are set, then in a Windows environment proxy settings are obtained from the registry's Internet Settings section, and in a macOS environment proxy information is retrieved from the System Configuration Framework.
sv: Gör att förfrågningar går via en proxy. Om *proxies* anges måste det vara en ordbok som mappar protokollnamn till webbadresser för proxyer. Standardinställningen är att läsa listan över proxyer från miljövariablerna ``<protocol>_proxy``. Om inga miljövariabler för proxy anges hämtas proxyinställningar i en Windows-miljö från registrets avsnitt Internetinställningar och i en macOS-miljö hämtas proxyinformation från System Configuration Framework.

source: To disable autodetected proxy pass an empty dictionary.
sv: För att inaktivera autodetekterad proxy skicka en tom ordbok.

source: The :envvar:`no_proxy` environment variable can be used to specify hosts which shouldn't be reached via proxy; if set, it should be a comma-separated list of hostname suffixes, optionally with ``:port`` appended, for example ``cern.ch,ncsa.uiuc.edu,some.host:8080``.
sv: Miljövariabeln :envvar:`no_proxy` kan användas för att ange värdar som inte ska nås via proxy; om den är inställd ska den vara en kommaseparerad lista med värdnamnssuffix, eventuellt med ``:port`` tillagt, till exempel ``cern.ch,ncsa.uiuc.edu,some.host:8080``.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
sv: ``HTTP_PROXY`` ignoreras om en variabel ``REQUEST_METHOD`` är inställd; se dokumentationen för :func:`~urllib.request.getproxies`.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings.
sv: Förvara en databas med ``(realm, uri) -> (user, password)`` mappningar.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings. A realm of ``None`` is considered a catch-all realm, which is searched if no other realm fits.
sv: Förvara en databas med ``(realm, uri) -> (user, password)`` mappningar. En sfär med ``None`` anses vara en catch-all-sfär, som söks om ingen annan sfär passar.

source: A variant of :class:`HTTPPasswordMgrWithDefaultRealm` that also has a database of ``uri -> is_authenticated`` mappings. Can be used by a BasicAuth handler to determine when to send authentication credentials immediately instead of waiting for a ``401`` response first.
sv: En variant av :class:`HTTPPasswordMgrWithDefaultRealm` som också har en databas med ``uri -> is_authenticated`` mappningar. Kan användas av en BasicAuth-hanterare för att avgöra när autentiseringsuppgifter ska skickas omedelbart istället för att vänta på ett ``401``-svar först.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. If *passwd_mgr* also provides ``is_authenticated`` and ``update_authenticated`` methods (see :ref:`http-password-mgr-with-prior-auth`), then the handler will use the ``is_authenticated`` result for a given URI to determine whether or not to send authentication credentials with the request. If ``is_authenticated`` returns ``True`` for the URI, credentials are sent. If ``is_authenticated`` is ``False``, credentials are not sent, and then if a ``401`` response is received the request is re-sent with the authentication credentials. If authentication succeeds, ``update_authenticated`` is called to set ``is_authenticated`` ``True`` for the URI, so that subsequent requests to the URI or any of its super-URIs will automatically include the authentication credentials.
sv: Detta är en mixin-klass som hjälper till med HTTP-autentisering, både till fjärrvärden och till en proxy. *password_mgr*, om den ges, bör vara något som är kompatibelt med :class:`HTTPPasswordMgr`; se avsnitt :ref:`http-password-mgr` för information om gränssnittet som måste stödjas. Om *passwd_mgr* också tillhandahåller metoderna ``is_authenticated`` och ``update_authenticated`` (se :ref:`http-password-mgr-with-prior-auth`), kommer hanteraren att använda resultatet ``is_authenticated`` för en given URI för att avgöra om autentiseringsuppgifter ska skickas med begäran eller inte. Om ``is_authenticated`` returnerar ``True`` för URI:n skickas autentiseringsuppgifter. Om ``is_authenticated`` är ``False`` skickas inte autentiseringsuppgifterna och om ett ``401``-svar tas emot skickas begäran på nytt med autentiseringsuppgifterna. Om autentiseringen lyckas anropas ``update_authenticated`` för att sätta ``is_authenticated`` ``True`` för URI:n, så att efterföljande förfrågningar till URI:n eller någon av dess super-URI:er automatiskt kommer att innehålla autentiseringsuppgifterna.

source: Added ``is_authenticated`` support.
sv: Stöd för ``is_authenticated`` har lagts till.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. HTTPBasicAuthHandler will raise a :exc:`ValueError` when presented with a wrong Authentication scheme.
sv: Hantera autentisering med fjärrvärden. *password_mgr*, om det anges, bör vara något som är kompatibelt med :class:`HTTPPasswordMgr`; se avsnitt :ref:`http-password-mgr` för information om gränssnittet som måste stödjas. HTTPBasicAuthHandler kommer att ge upphov till ett :exc:`ValueError` när den presenteras med ett felaktigt autentiseringsschema.

source: Handle authentication with the proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
sv: Hantera autentisering med proxyn. *password_mgr*, om det anges, bör vara något som är kompatibelt med :class:`HTTPPasswordMgr`; se avsnitt :ref:`http-password-mgr` för information om det gränssnitt som måste stödjas.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
sv: Detta är en mixin-klass som hjälper till med HTTP-autentisering, både till fjärrvärden och till en proxy. *password_mgr*, om den anges, bör vara något som är kompatibelt med :class:`HTTPPasswordMgr`; se avsnitt :ref:`http-password-mgr` för information om det gränssnitt som måste stödjas.

source: Added support for HTTP digest authentication algorithm ``SHA-256``.
sv: Lagt till stöd för HTTP digest-autentiseringsalgoritmen ``SHA-256``.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. When both Digest Authentication Handler and Basic Authentication Handler are both added, Digest Authentication is always tried first. If the Digest Authentication returns a 40x response again, it is sent to Basic Authentication handler to Handle. This Handler method will raise a :exc:`ValueError` when presented with an authentication scheme other than Digest or Basic.
sv: Hantera autentisering med fjärrvärden. *password_mgr*, om det anges, bör vara något som är kompatibelt med :class:`HTTPPasswordMgr`; se avsnitt :ref:`http-password-mgr` för information om det gränssnitt som måste stödjas. När både Digest Authentication Handler och Basic Authentication Handler läggs till, prövas alltid Digest Authentication först. Om Digest Authentication returnerar ett 40x-svar igen skickas det till Basic Authentication Handler för att hanteras. Denna Handler-metod kommer att ge upphov till ett :exc:`ValueError` när den presenteras med ett annat autentiseringsschema än Digest eller Basic.

source: Raise :exc:`ValueError` on unsupported Authentication Scheme.
sv: Utlös :exc:`ValueError` om autentiseringsschema som inte stöds.

source: A class to handle opening of HTTP URLs.
sv: En klass för att hantera öppning av HTTP-URL:er.

source: A class to handle opening of HTTPS URLs. *context* and *check_hostname* have the same meaning as in :class:`http.client.HTTPSConnection`.
sv: En klass för att hantera öppning av HTTPS-URL:er. *context* och *check_hostname* har samma betydelse som i :class:`http.client.HTTPSConnection`.

source: *context* and *check_hostname* were added.
sv: *context* och *check_hostname* har lagts till.

source: Open local files.
sv: Öppna lokala filer.

source: Open data URLs.
sv: URL:er för öppna data.

source: Open FTP URLs.
sv: Öppna FTP-URL:er.

source: Open FTP URLs, keeping a cache of open FTP connections to minimize delays.
sv: Öppna FTP-URL:er och behåll en cache för öppna FTP-anslutningar för att minimera fördröjningar.

source: A catch-all class to handle unknown URLs.
sv: En catch-all-klass för att hantera okända webbadresser.

source: Process HTTP error responses.
sv: Behandla HTTP-felsvar.

source: Request Objects
sv: Begär objekt

source: The following methods describe :class:`Request`'s public interface, and so all may be overridden in subclasses. It also defines several public attributes that can be used by clients to inspect the parsed request.
sv: Följande metoder beskriver :class:`Request` publika gränssnitt, och alla kan därför åsidosättas i underklasser. Det definierar också flera publika attribut som kan användas av klienter för att inspektera den analyserade begäran.

source: The original URL passed to the constructor.
sv: Den ursprungliga URL som skickas till konstruktören.

source: Request.full_url is a property with setter, getter and a deleter. Getting :attr:`~Request.full_url` returns the original request URL with the fragment, if it was present.
sv: Request.full_url är en egenskap med setter, getter och en deleter. Getting :attr:`~Request.full_url` returnerar den ursprungliga URL:en för begäran med fragmentet, om det fanns.

source: The URI scheme.
sv: URI-schema.

source: The URI authority, typically a host, but may also contain a port separated by a colon.
sv: URI-auktoriteten, vanligtvis en host, men kan också innehålla en port åtskild av ett kolon.

source: The original host for the request, without port.
sv: Den ursprungliga värden för begäran, utan port.

source: The URI path. If the :class:`Request` uses a proxy, then selector will be the full URL that is passed to the proxy.
sv: Sökvägen till URI. Om :class:`Request` använder en proxy, kommer väljaren att vara den fullständiga URL som skickas till proxyn.

source: The entity body for the request, or ``None`` if not specified.
sv: Entitetskroppen för begäran, eller ``None`` om den inte anges.

source: Changing value of :attr:`Request.data` now deletes "Content-Length" header if it was previously set or calculated.
sv: Ändring av värdet på :attr:`Request.data` raderar nu "Content-Length"-rubriken om den tidigare var inställd eller beräknad.

source: boolean, indicates whether the request is unverifiable as defined by :rfc:`2965`.
sv: boolean, anger om begäran är overifierbar enligt definitionen i :rfc:`2965`.

source: The HTTP request method to use. By default its value is :const:`None`, which means that :meth:`~Request.get_method` will do its normal computation of the method to be used. Its value can be set (thus overriding the default computation in :meth:`~Request.get_method`) either by providing a default value by setting it at the class level in a :class:`Request` subclass, or by passing a value in to the :class:`Request` constructor via the *method* argument.
sv: Den HTTP-förfrågningsmetod som ska användas. Som standard är dess värde :const:`None`, vilket innebär att :meth:`~Request.get_method` kommer att göra sin normala beräkning av den metod som ska användas. Dess värde kan ställas in (och därmed åsidosätta standardberäkningen i :meth:`~Request.get_method`) antingen genom att tillhandahålla ett standardvärde genom att ställa in det på klassnivå i en :class:`Request`-underklass, eller genom att skicka ett värde till :class:`Request`-konstruktören via argumentet *method*.

source: A default value can now be set in subclasses; previously it could only be set via the constructor argument.
sv: Ett standardvärde kan nu anges i underklasser; tidigare kunde det endast anges via konstruktörsargumentet.

source: Return a string indicating the HTTP request method. If :attr:`Request.method` is not ``None``, return its value, otherwise return ``'GET'`` if :attr:`Request.data` is ``None``, or ``'POST'`` if it's not. This is only meaningful for HTTP requests.
sv: Returnerar en sträng som anger HTTP-förfrågningsmetoden. Om :attr:`Request.method` inte är ``None``, returneras dess värde, annars returneras ``'GET'`` om :attr:`Request.data` är ``None``, eller ``'POST'`` om den inte är det. Detta är endast meningsfullt för HTTP-förfrågningar.

source: get_method now looks at the value of :attr:`Request.method`.
sv: get_method tittar nu på värdet av :attr:`Request.method`.

source: Add another header to the request. Headers are currently ignored by all handlers except HTTP handlers, where they are added to the list of headers sent to the server. Note that there cannot be more than one header with the same name, and later calls will overwrite previous calls in case the *key* collides. Currently, this is no loss of HTTP functionality, since all headers which have meaning when used more than once have a (header-specific) way of gaining the same functionality using only one header. Note that headers added using this method are also added to redirected requests.
sv: Lägg till en ny header till begäran. Headers ignoreras för närvarande av alla hanterare utom HTTP-hanterare, där de läggs till i listan över headers som skickas till servern. Observera att det inte kan finnas mer än en header med samma namn, och att senare anrop kommer att skriva över tidigare anrop om *nyckeln* kolliderar. För närvarande innebär detta inte någon förlust av HTTP-funktionalitet, eftersom alla headers som har betydelse när de används mer än en gång har ett (header-specifikt) sätt att få samma funktionalitet med endast en header. Observera att headers som läggs till med den här metoden också läggs till i omdirigerade begäranden.

source: Add a header that will not be added to a redirected request.
sv: Lägg till ett huvud som inte läggs till i en omdirigerad begäran.

source: Return whether the instance has the named header (checks both regular and unredirected).
sv: Returnerar om instansen har den angivna rubriken (kontrollerar både vanlig och oomdirigerad).

source: Remove named header from the request instance (both from regular and unredirected headers).
sv: Ta bort namngiven header från request-instansen (både från vanliga och ej omdirigerade headers).

source: Return the URL given in the constructor.
sv: Returnerar den URL som anges i konstruktören.

source: Returns :attr:`Request.full_url`
sv: Returnerar :attr:`Request.full_url`

source: Prepare the request by connecting to a proxy server. The *host* and *type* will replace those of the instance, and the instance's selector will be the original URL given in the constructor.
sv: Förbered begäran genom att ansluta till en proxyserver. *host* och *type* kommer att ersätta instansens, och instansens väljare kommer att vara den ursprungliga URL som anges i konstruktören.

source: Return the value of the given header. If the header is not present, return the default value.
sv: Returnerar värdet för den angivna rubriken. Om rubriken inte finns, returneras standardvärdet.

source: Return a list of tuples (header_name, header_value) of the Request headers.
sv: Returnerar en lista med tupler (header_name, header_value) av Request-rubrikerna.

source: The request methods add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host and is_unverifiable that were deprecated since 3.3 have been removed.
sv: Förfrågningsmetoderna add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host och is_unverifiable som inte längre används sedan 3.3 har tagits bort.

source: OpenerDirector Objects
sv: OpenerDirector-objekt

source: :class:`OpenerDirector` instances have the following methods:
sv: :class:`OpenerDirector`-instanser har följande metoder:

source: *handler* should be an instance of :class:`BaseHandler`. The following methods are searched, and added to the possible chains (note that HTTP errors are a special case). Note that, in the following, *protocol* should be replaced with the actual protocol to handle, for example :meth:`http_response` would be the HTTP protocol response handler. Also *type* should be replaced with the actual HTTP code, for example :meth:`http_error_404` would handle HTTP 404 errors.
sv: *handler* bör vara en instans av :class:`BaseHandler`. Följande metoder söks och läggs till i de möjliga kedjorna (observera att HTTP-fel är ett specialfall). Observera att i det följande ska *protocol* ersättas med det faktiska protokoll som ska hanteras, t.ex. skulle :meth:`http_response` vara svarshanteraren för HTTP-protokollet. Även *type* bör ersättas med den faktiska HTTP-koden, t.ex. :meth:`http_error_404` hanterar HTTP 404-fel.

source: :meth:`!<protocol>_open` --- signal that the handler knows how to open *protocol* URLs.
sv: :meth:`!<protocol>_open` --- signal att hanteraren vet hur man öppnar *protokoll* URL:er.

source: See |protocol_open|_ for more information.
sv: Se |protocol_open|_ för mer information.

source: :meth:`!http_error_\<type\>` --- signal that the handler knows how to handle HTTP errors with HTTP error code *type*.
sv: :meth:`!http_error_\<type\>` --- signalerar att hanteraren vet hur man hanterar HTTP-fel med HTTP-felkod *typ*.

source: See |http_error_nnn|_ for more information.
sv: Se |http_error_nnn|_ för mer information.

source: :meth:`!<protocol>_error` --- signal that the handler knows how to handle errors from (non-\ ``http``) *protocol*.
sv: :meth:`!<protocol>_error` --- signal att hanteraren vet hur man hanterar fel från (icke ``http``) *protokoll*.

source: :meth:`!<protocol>_request` --- signal that the handler knows how to pre-process *protocol* requests.
sv: :meth:`!<protocol>_request` --- signalera att hanteraren vet hur man förbehandlar *protokoll* förfrågningar.

source: See |protocol_request|_ for more information.
sv: Se |protocol_request|_ för mer information.

source: :meth:`!<protocol>_response` --- signal that the handler knows how to post-process *protocol* responses.
sv: :meth:`!<protocol>_response` --- signalera att hanteraren vet hur man efterbehandlar *protokoll* svar.

source: See |protocol_response|_ for more information.
sv: Se |protocol_response|_ för mer information.

source: Open the given *url* (which can be a request object or a string), optionally passing the given *data*. Arguments, return values and exceptions raised are the same as those of :func:`urlopen` (which simply calls the :meth:`open` method on the currently installed global :class:`OpenerDirector`). The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). The timeout feature actually works only for HTTP, HTTPS and FTP connections.
sv: Öppnar den angivna *url* (som kan vara ett request-objekt eller en sträng), och skickar eventuellt den angivna *data*. Argument, returvärden och undantag är desamma som för :func:`urlopen` (som helt enkelt anropar metoden :meth:`open` på den globala :class:`OpenerDirector` som för närvarande är installerad). Den valfria parametern *timeout* anger en timeout i sekunder för blockerande operationer som anslutningsförsöket (om den inte anges kommer den globala standardinställningen för timeout att användas). Timeout-funktionen fungerar faktiskt bara för HTTP-, HTTPS- och FTP-anslutningar.

source: Handle an error of the given protocol. This will call the registered error handlers for the given protocol with the given arguments (which are protocol specific). The HTTP protocol is a special case which uses the HTTP response code to determine the specific error handler; refer to the :meth:`!http_error_\<type\>` methods of the handler classes.
sv: Hantera ett fel i det angivna protokollet. Detta kommer att anropa de registrerade felhanterarna för det angivna protokollet med de angivna argumenten (som är protokollspecifika). HTTP-protokollet är ett specialfall som använder HTTP-svarskoden för att bestämma den specifika felhanteraren; se :meth:`!http_error_\<type\>`-metoderna i hanterarklasserna.

source: Return values and exceptions raised are the same as those of :func:`urlopen`.
sv: Returvärden och undantag är desamma som för :func:`urlopen`.

source: OpenerDirector objects open URLs in three stages:
sv: OpenerDirector-objekt öppnar webbadresser i tre steg:
