Repository: yeager/python-docs-sv
Catalog: library/uuid.po
Languages: sv

source: :mod:`!uuid` --- UUID objects according to :rfc:`9562`
sv: :mod:`!uuid` --- UUID-objekt enligt :rfc:`9562`

source: **Source code:** :source:`Lib/uuid.py`
sv: **Källkod:** :source:`Lib/uuid.py`

source: This module provides immutable :class:`UUID` objects (the :class:`UUID` class) and :ref:`functions <uuid-factory-functions>` for generating UUIDs corresponding to a specific UUID version as specified in :rfc:`9562` (which supersedes :rfc:`4122`), for example, :func:`uuid1` for UUID version 1, :func:`uuid3` for UUID version 3, and so on. Note that UUID version 2 is deliberately omitted as it is outside the scope of the RFC.
sv: Denna modul tillhandahåller oföränderliga :class:`UUID`-objekt (klassen :class:`UUID`) och :ref:` `funktioner <uuid-factory-functions>` för att generera UUIDs som motsvarar en specifik UUID-version enligt specifikationen i :rfc:`9562` (som ersätter :rfc:`4122`), till exempel :func:`uuid1` för UUID version 1, :func:`uuid3` för UUID version 3, och så vidare. Observera att UUID version 2 avsiktligt utelämnas eftersom den ligger utanför RFC:s tillämpningsområde.

source: If all you want is a unique ID, you should probably call :func:`uuid1` or :func:`uuid4`. Note that :func:`uuid1` may compromise privacy since it creates a UUID containing the computer's network address. :func:`uuid4` creates a random UUID.
sv: Om allt du vill ha är ett unikt ID bör du förmodligen anropa :func:`uuid1` eller :func:`uuid4`. Observera att :func:`uuid1` kan äventyra integriteten eftersom det skapar ett UUID som innehåller datorns nätverksadress. :func:`uuid4` skapar ett slumpmässigt UUID.

source: Depending on support from the underlying platform, :func:`uuid1` may or may not return a "safe" UUID. A safe UUID is one which is generated using synchronization methods that ensure no two processes can obtain the same UUID. All instances of :class:`UUID` have an :attr:`~UUID.is_safe` attribute which relays any information about the UUID's safety, using this enumeration:
sv: Beroende på stöd från den underliggande plattformen kan :func:`uuid1` returnera ett "säkert" UUID eller inte. Ett säkert UUID är ett UUID som genereras med hjälp av synkroniseringsmetoder som säkerställer att inga två processer kan få samma UUID. Alla instanser av :class:`UUID` har ett :attr:`~UUID.is_safe`-attribut som förmedlar all information om UUID:s säkerhet med hjälp av denna uppräkning:

source: The UUID was generated by the platform in a multiprocessing-safe way.
sv: UUID:n genererades av plattformen på ett multiprocessing-säkert sätt.

source: The UUID was not generated in a multiprocessing-safe way.
sv: UUID:n genererades inte på ett sätt som är säkert för flera processorer.

source: The platform does not provide information on whether the UUID was generated safely or not.
sv: Plattformen tillhandahåller inte information om huruvida UUID genererades på ett säkert sätt eller inte.

source: Create a UUID from either a string of 32 hexadecimal digits, a string of 16 bytes in big-endian order as the *bytes* argument, a string of 16 bytes in little-endian order as the *bytes_le* argument, a tuple of six integers (32-bit *time_low*, 16-bit *time_mid*, 16-bit *time_hi_version*, 8-bit *clock_seq_hi_variant*, 8-bit *clock_seq_low*, 48-bit *node*) as the *fields* argument, or a single 128-bit integer as the *int* argument. When a string of hex digits is given, curly braces, hyphens, and a URN prefix are all optional. For example, these expressions all yield the same UUID::
sv: Skapa ett UUID från antingen en sträng med 32 hexadecimala siffror, en sträng med 16 byte i big-endian-ordning som argument *bytes*, en sträng med 16 byte i little-endian-ordning som argument *bytes_le*, en tupel med sex heltal (32-bitars *time_low*, 16-bitars *time_mid*, 16-bitars *time_hi_version*, 8-bitars *clock_seq_hi_variant*, 8-bitars *clock_seq_low*, 48-bitars *node*) som argument *fields*, eller ett enda 128-bitars heltal som argument *int*. När en sträng med hexadecimala siffror anges är hakparenteser, bindestreck och ett URN-prefix valfria. Till exempel ger alla dessa uttryck samma UUID::

source: UUID('{12345678-1234-5678-1234-567812345678}') UUID('12345678123456781234567812345678') UUID('urn:uuid:12345678-1234-5678-1234-567812345678') UUID(bytes=b'\x12\x34\x56\x78'*4) UUID(bytes_le=b'\x78\x56\x34\x12\x34\x12\x78\x56' + b'\x12\x34\x56\x78\x12\x34\x56\x78') UUID(fields=(0x12345678, 0x1234, 0x5678, 0x12, 0x34, 0x567812345678)) UUID(int=0x12345678123456781234567812345678)
sv: UUID('{12345678-1234-5678-1234-567812345678}') UUID('12345678123456781234567812345678') UUID('urn:uuid:12345678-1234-5678-1234-567812345678') UUID(bytes=b'\x12\x34\x56\x78'*4) UUID(bytes_le=b'\x78\x56\x34\x12\x34\x12\x78\x56' + b'\x12\x34\x56\x78\x12\x34\x56\x78') UUID(fält=(0x12345678, 0x1234, 0x5678, 0x12, 0x34, 0x567812345678)) UUID(int=0x12345678123456781234567812345678)

source: Exactly one of *hex*, *bytes*, *bytes_le*, *fields*, or *int* must be given. The *version* argument is optional; if given, the resulting UUID will have its variant and version number set according to :rfc:`9562`, overriding bits in the given *hex*, *bytes*, *bytes_le*, *fields*, or *int*.
sv: Exakt en av *hex*, *bytes*, *bytes_le*, *fields* eller *int* måste anges. Argumentet *version* är valfritt; om det anges kommer det resulterande UUID att ha sin variant och sitt versionsnummer enligt :rfc:`9562`, vilket åsidosätter bitar i de angivna *hex*, *bytes*, *bytes_le*, *fields* eller *int*.

source: Comparison of UUID objects are made by way of comparing their :attr:`UUID.int` attributes. Comparison with a non-UUID object raises a :exc:`TypeError`.
sv: Jämförelse av UUID-objekt görs genom att jämföra deras :attr:`UUID.int`-attribut. Jämförelse med ett icke-UUID-objekt ger upphov till ett :exc:`TypeError`.

source: ``str(uuid)`` returns a string in the form ``12345678-1234-5678-1234-567812345678`` where the 32 hexadecimal digits represent the UUID.
sv: ``str(uuid)`` returnerar en sträng i formen ``12345678-1234-5678-1234-567812345678`` där de 32 hexadecimala siffrorna representerar UUID.

source: :class:`UUID` instances have these read-only attributes:
sv: :class:`UUID`-instanser har dessa skrivskyddade attribut:

source: The UUID as a 16-byte string (containing the six integer fields in big-endian byte order).
sv: UUID som en 16-byte-sträng (som innehåller de sex heltalsfälten i big-endian byteordning).

source: The UUID as a 16-byte string (with *time_low*, *time_mid*, and *time_hi_version* in little-endian byte order).
sv: UUID som en 16-byte-sträng (med *time_low*, *time_mid* och *time_hi_version* i little-endian byte-ordning).

source: A tuple of the six integer fields of the UUID, which are also available as six individual attributes and two derived attributes:
sv: En tupel av UUID:s sex heltalsfält, som också finns tillgängliga som sex individuella attribut och två härledda attribut:

source: Field
sv: Fält

source: Meaning
sv: Betydelse

source: The first 32 bits of the UUID. Only relevant to version 1.
sv: De första 32 bitarna av UUID. Endast relevant för version 1.

source: The next 16 bits of the UUID. Only relevant to version 1.
sv: De kommande 16 bitarna av UUID. Endast relevant för version 1.

source: The next 8 bits of the UUID. Only relevant to versions 1 and 6.
sv: De kommande 8 bitarna av UUID. Endast relevant för version 1 och 6.

source: The last 48 bits of the UUID. Only relevant to version 1.
sv: De sista 48 bitarna av UUID. Endast relevant för version 1.

source: The 60-bit timestamp as a count of 100-nanosecond intervals since Gregorian epoch (1582-10-15 00:00:00) for versions 1 and 6, or the 48-bit timestamp in milliseconds since Unix epoch (1970-01-01 00:00:00) for version 7.
sv: 60-bitars tidsstämpel i 100-nanosekundersintervall sedan gregoriansk epok (1582-10-15 00:00:00) för version 1 och 6, eller 48-bitars tidsstämpel i millisekunder sedan Unix epok (1970-01-01 00:00:00) för version 7.

source: The 14-bit sequence number. Only relevant to versions 1 and 6.
sv: 14-bitars sekvensnummer. Endast relevant för version 1 och 6.

source: The UUID as a 32-character lowercase hexadecimal string.
sv: UUID som en 32 tecken lång hexadecimal sträng med gemener.

source: The UUID as a 128-bit integer.
sv: UUID som ett 128-bitars heltal.

source: The UUID as a URN as specified in :rfc:`9562`.
sv: UUID som ett URN enligt specifikationen i :rfc:`9562`.

source: The UUID variant, which determines the internal layout of the UUID. This will be one of the constants :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT`, or :const:`RESERVED_FUTURE`.
sv: UUID-varianten, som bestämmer den interna layouten för UUID. Detta kommer att vara en av konstanterna :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT`, eller :const:`RESERVED_FUTURE`.

source: The UUID version number (1 through 8, meaningful only when the variant is :const:`RFC_4122`).
sv: UUID:s versionsnummer (1 till 8, endast meningsfullt när varianten är :const:`RFC_4122`).

source: Added UUID versions 6, 7 and 8.
sv: Lagt till UUID version 6, 7 och 8.

source: An enumeration of :class:`SafeUUID` which indicates whether the platform generated the UUID in a multiprocessing-safe way.
sv: En uppräkning av :class:`SafeUUID` som anger om plattformen genererade UUID:n på ett multiprocessing-säkert sätt.

source: The :mod:`uuid` module defines the following functions:
sv: Modulen :mod:`uuid` definierar följande funktioner:

source: Get the hardware address as a 48-bit positive integer. The first time this runs, it may launch a separate program, which could be quite slow. If all attempts to obtain the hardware address fail, we choose a random 48-bit number with the multicast bit (least significant bit of the first octet) set to 1 as recommended in :rfc:`4122`. "Hardware address" means the MAC address of a network interface. On a machine with multiple network interfaces, universally administered MAC addresses (i.e. where the second least significant bit of the first octet is *unset*) will be preferred over locally administered MAC addresses, but with no other ordering guarantees.
sv: Hämta hårdvaruadressen som ett 48-bitars positivt heltal. Första gången detta körs kan det hända att ett separat program startas, vilket kan vara ganska långsamt. Om alla försök att få fram maskinvaruadressen misslyckas väljer vi ett slumpmässigt 48-bitarsnummer med multicastbiten (den minst signifikanta biten i den första oktetten) satt till 1 enligt rekommendationen i :rfc:`4122`. med "hårdvaruadress" avses MAC-adressen för ett nätverksgränssnitt. På en maskin med flera nätverksgränssnitt kommer universellt administrerade MAC-adresser (dvs. där den näst minst signifikanta biten i den första oktetten är *unset*) att föredras framför lokalt administrerade MAC-adresser, men utan några andra ordningsgarantier.

source: Universally administered MAC addresses are preferred over locally administered MAC addresses, since the former are guaranteed to be globally unique, while the latter are not.
sv: Universellt administrerade MAC-adresser är att föredra framför lokalt administrerade MAC-adresser, eftersom de förra garanterat är globalt unika, medan de senare inte är det.

source: Generate a UUID from a host ID, sequence number, and the current time according to :rfc:`RFC 9562, §5.1 <9562#section-5.1>`.
sv: Generera ett UUID från ett värd-ID, sekvensnummer och aktuell tid enligt :rfc:`RFC 9562, §5.1 <9562#section-5.1>`.

source: When *node* is not specified, :func:`getnode` is used to obtain the hardware address as a 48-bit positive integer. When a sequence number *clock_seq* is not specified, a pseudo-random 14-bit positive integer is generated.
sv: När *node* inte är specificerat används :func:`getnode` för att få hårdvaruadressen som ett 48-bitars positivt heltal. När ett sekvensnummer *clock_seq* inte specificeras genereras ett pseudoslumpmässigt 14-bitars positivt heltal.

source: If *node* or *clock_seq* exceed their expected bit count, only their least significant bits are kept.
sv: Om *node* eller *clock_seq* överskrider sitt förväntade bitantal sparas endast de minst signifikanta bitarna.

source: Generate a UUID based on the MD5 hash of a namespace identifier (which is a UUID) and a name (which is a :class:`bytes` object or a string that will be encoded using UTF-8) according to :rfc:`RFC 9562, §5.3 <9562#section-5.3>`.
sv: Generera ett UUID baserat på MD5-hashningen av en namnrymdsidentifierare (som är ett UUID) och ett namn (som är ett :class:`bytes`-objekt eller en sträng som kommer att kodas med UTF-8) enligt :rfc:`RFC 9562, §5.3 <9562#section-5.3>`.

source: Generate a random UUID in a cryptographically-secure method according to :rfc:`RFC 9562, §5.4 <9562#section-5.4>`.
sv: Generera ett slumpmässigt UUID med en kryptografiskt säker metod enligt :rfc:`RFC 9562, §5.4 <9562#section-5.4>`.

source: Generate a UUID based on the SHA-1 hash of a namespace identifier (which is a UUID) and a name (which is a :class:`bytes` object or a string that will be encoded using UTF-8) according to :rfc:`RFC 9562, §5.5 <9562#section-5.5>`.
sv: Generera ett UUID baserat på SHA-1-hashningen av en namnrymdsidentifierare (som är ett UUID) och ett namn (som är ett :class:`bytes`-objekt eller en sträng som kommer att kodas med UTF-8) enligt :rfc:`RFC 9562, §5.5 <9562#section-5.5>`.

source: Generate a UUID from a sequence number and the current time according to :rfc:`RFC 9562, §5.6 <9562#section-5.6>`.
sv: Generera ett UUID från ett sekvensnummer och den aktuella tiden enligt :rfc:`RFC 9562, §5.6 <9562#section-5.6>`.

source: This is an alternative to :func:`uuid1` to improve database locality.
sv: Detta är ett alternativ till :func:`uuid1` för att förbättra databaslokaliseringen.

source: Generate a time-based UUID according to :rfc:`RFC 9562, §5.7 <9562#section-5.7>`.
sv: Generera en tidsbaserad UUID enligt :rfc:`RFC 9562, §5.7 <9562#section-5.7>`.

source: For portability across platforms lacking sub-millisecond precision, UUIDs produced by this function embed a 48-bit timestamp and use a 42-bit counter to guarantee monotonicity within a millisecond.
sv: För portabilitet på plattformar som saknar precision under en millisekund bäddar UUID:er som produceras av den här funktionen in en 48-bitars tidsstämpel och använder en 42-bitars räknare för att garantera monotonicitet inom en millisekund.

source: Generate a pseudo-random UUID according to :rfc:`RFC 9562, §5.8 <9562#section-5.8>`.
sv: Generera ett pseudoslumpmässigt UUID enligt :rfc:`RFC 9562, §5.8 <9562#section-5.8>`.

source: When specified, the parameters *a*, *b* and *c* are expected to be positive integers of 48, 12 and 62 bits respectively. If they exceed their expected bit count, only their least significant bits are kept; non-specified arguments are substituted for a pseudo-random integer of appropriate size.
sv: När parametrarna *a*, *b* och *c* specificeras förväntas de vara positiva heltal på 48, 12 respektive 62 bitar. Om de överstiger det förväntade bitantalet behålls endast de minst signifikanta bitarna; ospecificerade argument ersätts med ett pseudoslumpmässigt heltal av lämplig storlek.

source: By default, *a*, *b* and *c* are not generated by a cryptographically secure pseudo-random number generator (CSPRNG). Use :func:`uuid4` when a UUID needs to be used in a security-sensitive context.
sv: Som standard genereras *a*, *b* och *c* inte av en kryptografiskt säker pseudoslumptalsgenerator (CSPRNG). Använd :func:`uuid4` när ett UUID behöver användas i ett säkerhetskänsligt sammanhang.

source: The :mod:`uuid` module defines the following namespace identifiers for use with :func:`uuid3` or :func:`uuid5`.
sv: Modulen :mod:`uuid` definierar följande namnrymdsidentifierare för användning med :func:`uuid3` eller :func:`uuid5`.

source: When this namespace is specified, the *name* string is a fully qualified domain name.
sv: När denna namnrymd anges är strängen *name* ett fullständigt kvalificerat domännamn.

source: When this namespace is specified, the *name* string is a URL.
sv: När detta namnområde anges är *name*-strängen en URL.

source: When this namespace is specified, the *name* string is an ISO OID.
sv: När denna namnrymd anges är *name*-strängen en ISO OID.

source: When this namespace is specified, the *name* string is an X.500 DN in DER or a text output format.
sv: När denna namnrymd anges är *name*-strängen en X.500 DN i DER- eller textutmatningsformat.

source: The :mod:`uuid` module defines the following constants for the possible values of the :attr:`~UUID.variant` attribute:
sv: Modulen :mod:`uuid` definierar följande konstanter för de möjliga värdena för attributet :attr:`~UUID.variant`:

source: Reserved for NCS compatibility.
sv: Reserverad för NCS-kompatibilitet.

source: Specifies the UUID layout given in :rfc:`4122`. This constant is kept for backward compatibility even though :rfc:`4122` has been superseded by :rfc:`9562`.
sv: Anger den UUID-layout som anges i :rfc:`4122`. Denna konstant behålls för bakåtkompatibilitet även om :rfc:`4122` har ersatts av :rfc:`9562`.

source: Reserved for Microsoft compatibility.
sv: Reserverad för Microsoft-kompatibilitet.

source: Reserved for future definition.
sv: Reserverad för framtida definition.

source: The :mod:`uuid` module defines the special Nil and Max UUID values:
sv: Modulen :mod:`uuid` definierar de speciella Nil- och Max-värdena för UUID:

source: A special form of UUID that is specified to have all 128 bits set to zero according to :rfc:`RFC 9562, §5.9 <9562#section-5.9>`.
sv: En speciell form av UUID som är specificerad att ha alla 128 bitar nollställda enligt :rfc:`RFC 9562, §5.9 <9562#section-5.9>`.

source: A special form of UUID that is specified to have all 128 bits set to one according to :rfc:`RFC 9562, §5.10 <9562#section-5.10>`.
sv: En speciell form av UUID som är specificerad så att alla 128 bitar är satta till ett enligt :rfc:`RFC 9562, §5.10 <9562#section-5.10>`.

source: :rfc:`9562` - A Universally Unique IDentifier (UUID) URN Namespace
sv: :rfc:`9562` - En universellt unik ID-identifierare (UUID) URN-namnrymd

source: This specification defines a Uniform Resource Name namespace for UUIDs, the internal format of UUIDs, and methods of generating UUIDs.
sv: Denna specifikation definierar ett namnområde för UUID:er (Uniform Resource Name), det interna formatet för UUID:er och metoder för att generera UUID:er.

source: Command-Line Usage
sv: Användning av kommandoraden

source: The :mod:`uuid` module can be executed as a script from the command line.
sv: Modulen :mod:`uuid` kan exekveras som ett skript från kommandoraden.

source: The following options are accepted:
sv: Följande alternativ accepteras:

source: Show the help message and exit.
sv: Visa hjälpmeddelandet och avsluta.

source: Specify the function name to use to generate the uuid. By default :func:`uuid4` is used.
sv: Ange det funktionsnamn som ska användas för att generera uuid. Som standard används :func:`uuid4`.

source: Allow generating UUID versions 6, 7 and 8.
sv: Tillåt generering av UUID version 6, 7 och 8.

source: The namespace is a ``UUID``, or ``@ns`` where ``ns`` is a well-known predefined UUID addressed by namespace name. Such as ``@dns``, ``@url``, ``@oid``, and ``@x500``. Only required for :func:`uuid3` / :func:`uuid5` functions.
sv: Namnrymden är ett ``UUID`` eller ``@ns`` där ``ns`` är ett välkänt fördefinierat UUID som adresseras av namnrymdens namn. Till exempel ``@dns``, ``@url``, ``@oid`` och ``@x500``. Krävs endast för funktionerna :func:`uuid3` / :func:`uuid5`.

source: The name used as part of generating the uuid. Only required for :func:`uuid3` / :func:`uuid5` functions.
sv: Det namn som används för att generera uuid. Krävs endast för funktionerna :func:`uuid3` / :func:`uuid5`.

source: Generate *num* fresh UUIDs.
sv: Generera *num* nya UUID:er.

source: Example
sv: Exempel

source: Here are some examples of typical usage of the :mod:`uuid` module::
sv: Här följer några exempel på typisk användning av modulen :mod:`uuid`::

source: Command-Line Example
sv: Exempel på kommandoraden

source: Here are some examples of typical usage of the :mod:`uuid` command-line interface:
sv: Här följer några exempel på typisk användning av kommandoradsgränssnittet :mod:`uuid`:

source: # generate a random UUID - by default uuid4() is used $ python -m uuid # generate a UUID using uuid1() $ python -m uuid -u uuid1 # generate a UUID using uuid5 $ python -m uuid -u uuid5 -n @url -N example.com # generate 42 random UUIDs $ python -m uuid -C 42
sv: # generera ett slumpmässigt UUID - som standard används uuid4() $ python -m uuid # generera ett UUID med hjälp av uuid1() $ python -m uuid -u uuid1 # generera ett UUID med hjälp av uuid5 $ python -m uuid -u uuid5 -n @url -N exempel.com # generera 42 slumpmässiga UUID $ python -m uuid -C 42
