Repository: yeager/python-docs-sv
Catalog: library/wave.po
Languages: sv

source: :mod:`!wave` --- Read and write WAV files
sv: :mod:`!wave` --- Läsa och skriva WAV-filer

source: **Source code:** :source:`Lib/wave.py`
sv: **Källkod:** :source:`Lib/wave.py`

source: The :mod:`wave` module provides a convenient interface to the Waveform Audio "WAVE" (or "WAV") file format. Only uncompressed PCM encoded wave files are supported.
sv: Modulen :mod:`wave` ger ett bekvämt gränssnitt till filformatet Waveform Audio "WAVE" (eller "WAV"). Endast okomprimerade PCM-kodade wave-filer stöds.

source: Support for ``WAVE_FORMAT_EXTENSIBLE`` headers was added, provided that the extended format is ``KSDATAFORMAT_SUBTYPE_PCM``.
sv: Stöd för rubrikerna ``WAVE_FORMAT_EXTENSIBLE`` har lagts till, förutsatt att det utökade formatet är ``KSDATAFORMAT_SUBTYPE_PCM``.

source: The :mod:`wave` module defines the following function and exception:
sv: Modulen :mod:`wave` definierar följande funktion och undantag:

source: If *file* is a string, open the file by that name, otherwise treat it as a file-like object. *mode* can be:
sv: Om *file* är en sträng öppnas filen med det namnet, annars behandlas den som ett filliknande objekt. *mode* kan vara:

source: Read only mode.
sv: Endast läsläge.

source: Write only mode.
sv: Endast skrivläge.

source: Note that it does not allow read/write WAV files.
sv: Observera att den inte tillåter läsning/skrivning av WAV-filer.

source: A *mode* of ``'rb'`` returns a :class:`Wave_read` object, while a *mode* of ``'wb'`` returns a :class:`Wave_write` object. If *mode* is omitted and a file-like object is passed as *file*, ``file.mode`` is used as the default value for *mode*.
sv: En *mode* av ``'rb'`` returnerar ett :class:`Wave_read`-objekt, medan en *mode* av ``'wb'`` returnerar ett :class:`Wave_write`-objekt. Om *mode* utelämnas och ett filliknande objekt skickas som *file*, används ``file.mode`` som standardvärde för *mode*.

source: If you pass in a file-like object, the wave object will not close it when its ``close()`` method is called; it is the caller's responsibility to close the file object.
sv: Om du skickar in ett filliknande objekt kommer wave-objektet inte att stänga det när dess ``close()``-metod anropas; det är anroparens ansvar att stänga filobjektet.

source: The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`Wave_read.close` or :meth:`Wave_write.close` method is called.
sv: Funktionen :func:`.open` kan användas i en :keyword:`with`-sats. När :keyword:`!with`-blocket är färdigt anropas metoden :meth:`Wave_read.close` eller :meth:`Wave_write.close`.

source: Added support for unseekable files.
sv: Lagt till stöd för filer som inte kan sökas.

source: An error raised when something is impossible because it violates the WAV specification or hits an implementation deficiency.
sv: Ett fel som uppstår när något är omöjligt eftersom det strider mot WAV-specifikationen eller har en implementeringsbrist.

source: Wave_read Objects
sv: Wave_read-objekt

source: Read a WAV file.
sv: Läs en WAV-fil.

source: Wave_read objects, as returned by :func:`.open`, have the following methods:
sv: Wave_read-objekt, som returneras av :func:`.open`, har följande metoder:

source: Close the stream if it was opened by :mod:`wave`, and make the instance unusable. This is called automatically on object collection.
sv: Stäng strömmen om den öppnades av :mod:`wave`, och gör instansen oanvändbar. Detta anropas automatiskt vid insamling av objekt.

source: Returns number of audio channels (``1`` for mono, ``2`` for stereo).
sv: Returnerar antalet ljudkanaler (``1`` för mono, ``2`` för stereo).

source: Returns sample width in bytes.
sv: Returnerar samplingsbredd i bytes.

source: Returns sampling frequency.
sv: Returnerar samplingsfrekvens.

source: Returns number of audio frames.
sv: Returnerar antalet ljudrutor.

source: Returns compression type (``'NONE'`` is the only supported type).
sv: Returnerar komprimeringstyp (``'NONE'`` är den enda typ som stöds).

source: Human-readable version of :meth:`getcomptype`. Usually ``'not compressed'`` parallels ``'NONE'``.
sv: Mänskligt läsbar version av :meth:`getcomptype`. Vanligtvis är ``'not compressed'`` parallell med ``'NONE'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the ``get*()`` methods.
sv: Returnerar en :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, motsvarande utdata från metoderna ``get*()``.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object.
sv: Läser och returnerar högst *n* bildrutor av ljud, som ett :class:`bytes`-objekt.

source: Rewind the file pointer to the beginning of the audio stream.
sv: Spola tillbaka filpekaren till början av ljudströmmen.

source: The following two methods are defined for compatibility with the old :mod:`!aifc` module, and don't do anything interesting.
sv: Följande två metoder är definierade för kompatibilitet med den gamla :mod:`!aifc`-modulen, och gör inget intressant.

source: Returns ``None``.
sv: Returnerar ``None``.

source: The method only existed for compatibility with the :mod:`!aifc` module which has been removed in Python 3.13.
sv: Metoden fanns bara för kompatibilitet med modulen :mod:`!aifc` som har tagits bort i Python 3.13.

source: Raise an error.
sv: Upprätta ett fel.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
sv: Följande två metoder definierar en term "position" som är kompatibel mellan dem och i övrigt är beroende av implementeringen.

source: Set the file pointer to the specified position.
sv: Ställ in filpekaren på den angivna positionen.

source: Return current file pointer position.
sv: Returnerar aktuell position för filpekaren.

source: Wave_write Objects
sv: Wave_write Objekt

source: Write a WAV file.
sv: Skriv en WAV-fil.

source: Wave_write objects, as returned by :func:`.open`.
sv: Wave_write-objekt, som returneras av :func:`.open`.

source: For seekable output streams, the ``wave`` header will automatically be updated to reflect the number of frames actually written. For unseekable streams, the *nframes* value must be accurate when the first frame data is written. An accurate *nframes* value can be achieved either by calling :meth:`setnframes` or :meth:`setparams` with the number of frames that will be written before :meth:`close` is called and then using :meth:`writeframesraw` to write the frame data, or by calling :meth:`writeframes` with all of the frame data to be written. In the latter case :meth:`writeframes` will calculate the number of frames in the data and set *nframes* accordingly before writing the frame data.
sv: För sökbara utdataströmmar kommer ``wave``-headern automatiskt att uppdateras för att återspegla det antal bildrutor som faktiskt skrivs. För osökbara strömmar måste *nframes*-värdet vara korrekt när den första bildrutan skrivs. Ett korrekt *nframes*-värde kan uppnås antingen genom att anropa :meth:`setnframes` eller :meth:`setparams` med det antal bildrutor som ska skrivas innan :meth:`close` anropas och sedan använda :meth:`writeframesraw` för att skriva bildrutorna, eller genom att anropa :meth:`writeframes` med alla bildrutor som ska skrivas. I det senare fallet kommer :meth:`writeframes` att beräkna antalet bildrutor i data och sätta *nframes* i enlighet med detta innan bildrutorna skrivs.

source: Wave_write objects have the following methods:
sv: Wave_write-objekt har följande metoder:

source: Make sure *nframes* is correct, and close the file if it was opened by :mod:`wave`. This method is called upon object collection. It will raise an exception if the output stream is not seekable and *nframes* does not match the number of frames actually written.
sv: Kontrollera att *nframes* är korrekt, och stäng filen om den öppnades av :mod:`wave`. Denna metod anropas vid insamling av objekt. Den kommer att ge upphov till ett undantag om utdataströmmen inte är sökbar och *nframes* inte stämmer överens med antalet bildrutor som faktiskt skrivs.

source: Set the number of channels.
sv: Ställ in antalet kanaler.

source: Set the sample width to *n* bytes.
sv: Ställ in samplingsbredden till *n* bytes.

source: Set the frame rate to *n*.
sv: Ställ in bildfrekvensen till *n*.

source: A non-integral input to this method is rounded to the nearest integer.
sv: En icke-integral indata till denna metod avrundas till närmaste heltal.

source: Set the number of frames to *n*. This will be changed later if the number of frames actually written is different (this update attempt will raise an error if the output stream is not seekable).
sv: Ställ in antalet bildrutor till *n*. Detta kommer att ändras senare om antalet bilder som faktiskt skrivs är annorlunda (detta uppdateringsförsök kommer att ge upphov till ett fel om utdataströmmen inte är sökbar).

source: Set the compression type and description. At the moment, only compression type ``NONE`` is supported, meaning no compression.
sv: Ange komprimeringstyp och beskrivning. För närvarande stöds endast komprimeringstypen ``NONE``, vilket innebär ingen komprimering.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the ``set*()`` methods. Sets all parameters.
sv: *tupeln* bör vara ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, med värden som är giltiga för metoderna ``set*()``. Ställer in alla parametrar.

source: Return current position in the file, with the same disclaimer for the :meth:`Wave_read.tell` and :meth:`Wave_read.setpos` methods.
sv: Returnerar aktuell position i filen, med samma ansvarsfriskrivning som för metoderna :meth:`Wave_read.tell` och :meth:`Wave_read.setpos`.

source: Write audio frames, without correcting *nframes*.
sv: Skriv ljudramar utan att korrigera *nframes*.

source: Any :term:`bytes-like object` is now accepted.
sv: Alla :term:`bytesliknande objekt` accepteras nu.

source: Write audio frames and make sure *nframes* is correct. It will raise an error if the output stream is not seekable and the total number of frames that have been written after *data* has been written does not match the previously set value for *nframes*.
sv: Skriv ljudrutor och kontrollera att *nframes* är korrekt. Ett fel kommer att uppstå om utdataströmmen inte är sökbar och det totala antalet bildrutor som har skrivits efter att *data* har skrivits inte överensstämmer med det tidigare inställda värdet för *nframes*.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`, and any attempt to do so will raise :exc:`wave.Error`.
sv: Observera att det är ogiltigt att ange några parametrar efter anrop av :meth:`writeframes` eller :meth:`writeframesraw`, och alla försök att göra det kommer att ge upphov till :exc:`wave.Error`.
