Repository: yeager/python-docs-sv
Catalog: library/weakref.po
Languages: sv

source: Sequence containing all the type objects for proxies. This can make it simpler to test if an object is a proxy without being dependent on naming both proxy types.
sv: Sekvens som innehåller alla typobjekt för proxy. Detta kan göra det enklare att testa om ett objekt är en proxy utan att vara beroende av att namnge båda proxytyperna.

source: :pep:`205` - Weak References
sv: :pep:`205` - Svaga referenser

source: The proposal and rationale for this feature, including links to earlier implementations and information about similar features in other languages.
sv: Förslaget och motiveringen till den här funktionen, inklusive länkar till tidigare implementeringar och information om liknande funktioner i andra språk.

source: Weak Reference Objects
sv: Svaga referensobjekt

source: Weak reference objects have no methods and no attributes besides :attr:`ref.__callback__`. A weak reference object allows the referent to be obtained, if it still exists, by calling it:
sv: Svaga referensobjekt har inga metoder och inga attribut förutom :attr:`ref.__callback__`. Ett svagt referensobjekt gör att referenten kan erhållas, om den fortfarande finns, genom att anropa det:

source: If the referent no longer exists, calling the reference object returns :const:`None`:
sv: Om referenten inte längre finns, returneras :const:`None` när referensobjektet anropas:

source: Testing that a weak reference object is still live should be done using the expression ``ref() is not None``. Normally, application code that needs to use a reference object should follow this pattern::
sv: Testning av att ett svagt referensobjekt fortfarande är aktivt bör göras med hjälp av uttrycket ``ref() is not None``. Normalt bör applikationskod som behöver använda ett referensobjekt följa detta mönster::

source: # r is a weak reference object o = r() if o is None: # referent has been garbage collected print("Object has been deallocated; can't frobnicate.") else: print("Object is still live!") o.do_something_useful()
sv: # r är ett svagt referensobjekt o = r() om o är None: # referensen har blivit skräpinsamlad print("Objektet har avallokerats; kan inte frobnisera.") else: print("Objektet är fortfarande levande!") o.gör_något_nyttigt()

source: Using a separate test for "liveness" creates race conditions in threaded applications; another thread can cause a weak reference to become invalidated before the weak reference is called; the idiom shown above is safe in threaded applications as well as single-threaded applications.
sv: Att använda ett separat test för "liveness" skapar tävlingsförhållanden i gängade applikationer; en annan tråd kan orsaka att en svag referens blir ogiltig innan den svaga referensen anropas; idiomet som visas ovan är säkert i gängade applikationer såväl som i enkeltrådade applikationer.

source: Specialized versions of :class:`ref` objects can be created through subclassing. This is used in the implementation of the :class:`WeakValueDictionary` to reduce the memory overhead for each entry in the mapping. This may be most useful to associate additional information with a reference, but could also be used to insert additional processing on calls to retrieve the referent.
sv: Specialiserade versioner av :class:`ref`-objekt kan skapas genom subklassning. Detta används i implementeringen av :class:`WeakValueDictionary` för att minska minneskostnaden för varje post i mappningen. Detta kan vara mest användbart för att associera ytterligare information med en referens, men kan också användas för att infoga ytterligare bearbetning vid anrop för att hämta referensen.

source: This example shows how a subclass of :class:`ref` can be used to store additional information about an object and affect the value that's returned when the referent is accessed::
sv: Detta exempel visar hur en subklass av :class:`ref` kan användas för att lagra ytterligare information om ett objekt och påverka det värde som returneras när referenten anropas::

source: Example
sv: Exempel

source: This simple example shows how an application can use object IDs to retrieve objects that it has seen before. The IDs of the objects can then be used in other data structures without forcing the objects to remain alive, but the objects can still be retrieved by ID if they do.
sv: Detta enkla exempel visar hur en applikation kan använda objekt-ID:n för att hämta objekt som den har sett förut. Objektens ID:n kan sedan användas i andra datastrukturer utan att objekten tvingas leva vidare, men om de gör det kan de ändå hämtas via ID.

source: Finalizer Objects
sv: Finalizer-objekt

source: The main benefit of using :class:`finalize` is that it makes it simple to register a callback without needing to preserve the returned finalizer object. For instance
sv: Den största fördelen med att använda :class:`finalize` är att det gör det enkelt att registrera en callback utan att behöva bevara det returnerade finalizer-objektet. Exempelvis

source: The finalizer can be called directly as well. However the finalizer will invoke the callback at most once.
sv: Finalizer kan också anropas direkt. Finalizern kommer dock att anropa callbacken högst en gång.

source: You can unregister a finalizer using its :meth:`~finalize.detach` method. This kills the finalizer and returns the arguments passed to the constructor when it was created.
sv: Du kan avregistrera en finalizer med hjälp av dess :meth:`~finalize.detach`-metod. Detta dödar finalizern och returnerar de argument som skickades till konstruktören när den skapades.

source: Unless you set the :attr:`~finalize.atexit` attribute to :const:`False`, a finalizer will be called when the program exits if it is still alive. For instance
sv: Om du inte sätter attributet :attr:`~finalize.atexit` till :const:`False`, kommer en finalizer att anropas när programmet avslutas om det fortfarande är vid liv. Exempelvis

source: >>> obj = Object() >>> weakref.finalize(obj, print, "obj dead or exiting") <finalize object at ...; for 'Object' at ...> >>> exit() obj dead or exiting
sv: >>> obj = Objekt() >>> weakref.finalize(obj, print, "obj död eller avslutas") <finalize object at ...; for 'Object' at ...> >>> exit() >>> exit() obj död eller lämnar

source: Comparing finalizers with :meth:`~object.__del__` methods
sv: Jämförelse av finalizers med :meth:`~object.__del__`-metoder

source: Suppose we want to create a class whose instances represent temporary directories. The directories should be deleted with their contents when the first of the following events occurs:
sv: Antag att vi vill skapa en klass vars instanser representerar tillfälliga kataloger. Katalogerna ska raderas med sitt innehåll när den första av följande händelser inträffar:

source: the object is garbage collected,
sv: objektet är skräpinsamlat,

source: the object's :meth:`!remove` method is called, or
sv: objektets :meth:`!remove`-metod anropas, eller

source: the program exits.
sv: avslutas programmet.

source: We might try to implement the class using a :meth:`~object.__del__` method as follows::
sv: Vi kan försöka implementera klassen med hjälp av en :meth:`~object.__del__`-metod enligt följande::

source: Starting with Python 3.4, :meth:`~object.__del__` methods no longer prevent reference cycles from being garbage collected, and module globals are no longer forced to :const:`None` during :term:`interpreter shutdown`. So this code should work without any issues on CPython.
sv: Från och med Python 3.4 förhindrar inte längre :meth:`~object.__del__`-metoder att referenscykler garbage-samlas, och modulglobaler tvingas inte längre till :const:`None` under :term:`interpreter shutdown`. Så den här koden bör fungera utan problem på CPython.

source: However, handling of :meth:`~object.__del__` methods is notoriously implementation specific, since it depends on internal details of the interpreter's garbage collector implementation.
sv: Hanteringen av :meth:`~object.__del__`-metoder är dock notoriskt implementationsspecifik, eftersom den beror på interna detaljer i tolkens garbage collector-implementation.

source: A more robust alternative can be to define a finalizer which only references the specific functions and objects that it needs, rather than having access to the full state of the object::
sv: Ett mer robust alternativ kan vara att definiera en finalizer som bara refererar till de specifika funktioner och objekt som den behöver, i stället för att ha tillgång till objektets fullständiga tillstånd:

source: Defined like this, our finalizer only receives a reference to the details it needs to clean up the directory appropriately. If the object never gets garbage collected the finalizer will still be called at exit.
sv: Definierad på det här sättet får vår finalizer bara en referens till de detaljer den behöver för att städa upp katalogen på lämpligt sätt. Om objektet aldrig blir skräpinsamlat kommer finalizern fortfarande att anropas vid avslut.

source: The other advantage of weakref based finalizers is that they can be used to register finalizers for classes where the definition is controlled by a third party, such as running code when a module is unloaded::
sv: Den andra fördelen med weakref-baserade finalizers är att de kan användas för att registrera finalizers för klasser där definitionen styrs av en tredje part, t.ex. att köra kod när en modul avlastas:

source: import weakref, sys def unloading_module(): # implicit reference to the module globals from the function body weakref.finalize(sys.modules[__name__], unloading_module)
sv: import weakref, sys def unloading_module(): # implicit referens till modulens globaler från funktionskroppen weakref.finalize(sys.modules[__name__], unloading_module)

source: If you create a finalizer object in a daemonic thread just as the program exits then there is the possibility that the finalizer does not get called at exit. However, in a daemonic thread :func:`atexit.register`, ``try: ... finally: ...`` and ``with: ...`` do not guarantee that cleanup occurs either.
sv: Om du skapar ett finalizer-objekt i en daemonisk tråd precis när programmet avslutas finns det en möjlighet att finalizern inte anropas vid avslutningen. Men i en daemonisk tråd :func:`atexit.register`, ``try: ... finally: ...`` och ``with: ...`` inte heller garantera att upprensning sker.
