Repository: yeager/python-docs-sv
Catalog: library/weakref.po
Languages: sv

source: :mod:`weakref` --- Weak references
sv: :mod:`weakref` --- Svaga referenser

source: **Source code:** :source:`Lib/weakref.py`
sv: **Källkod:** :source:`Lib/weakref.py`

source: The :mod:`weakref` module allows the Python programmer to create :dfn:`weak references` to objects.
sv: Modulen :mod:`weakref` gör det möjligt för Python-programmerare att skapa :dfn:`svaga referenser` till objekt.

source: In the following, the term :dfn:`referent` means the object which is referred to by a weak reference.
sv: I det följande betyder termen :dfn:`referent` det objekt som refereras till med en svag referens.

source: A weak reference to an object is not enough to keep the object alive: when the only remaining references to a referent are weak references, :term:`garbage collection` is free to destroy the referent and reuse its memory for something else. However, until the object is actually destroyed the weak reference may return the object even if there are no strong references to it.
sv: En svag referens till ett objekt räcker inte för att hålla objektet vid liv: när de enda återstående referenserna till en referent är svaga referenser, kan :term:`garbage collection` fritt förstöra referenten och återanvända dess minne till något annat. Fram till dess att objektet faktiskt förstörs kan dock den svaga referensen returnera objektet även om det inte finns några starka referenser till det.

source: A primary use for weak references is to implement caches or mappings holding large objects, where it's desired that a large object not be kept alive solely because it appears in a cache or mapping.
sv: En primär användning av svaga referenser är att implementera cacheminnen eller mappningar som innehåller stora objekt, där det är önskvärt att ett stort objekt inte hålls vid liv enbart för att det förekommer i ett cacheminne eller en mappning.

source: For example, if you have a number of large binary image objects, you may wish to associate a name with each. If you used a Python dictionary to map names to images, or images to names, the image objects would remain alive just because they appeared as values or keys in the dictionaries. The :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` classes supplied by the :mod:`weakref` module are an alternative, using weak references to construct mappings that don't keep objects alive solely because they appear in the mapping objects. If, for example, an image object is a value in a :class:`WeakValueDictionary`, then when the last remaining references to that image object are the weak references held by weak mappings, garbage collection can reclaim the object, and its corresponding entries in weak mappings are simply deleted.
sv: Om du till exempel har ett antal stora binära bildobjekt kanske du vill associera ett namn med varje objekt. Om du använde en Python-ordbok för att mappa namn till bilder, eller bilder till namn, skulle bildobjekten förbli levande bara för att de dök upp som värden eller nycklar i ordböckerna. Klasserna :class:`WeakKeyDictionary` och :class:`WeakValueDictionary` som tillhandahålls av modulen :mod:`weakref` är ett alternativ som använder svaga referenser för att konstruera mappningar som inte håller objekt vid liv enbart för att de förekommer i mappningsobjekten. Om t.ex. ett bildobjekt är ett värde i en :class:`WeakValueDictionary`, och när de sista kvarvarande referenserna till bildobjektet är svaga referenser i svaga mappningar, kan skräpsamlingen återta objektet och motsvarande poster i svaga mappningar raderas helt enkelt.

source: :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` use weak references in their implementation, setting up callback functions on the weak references that notify the weak dictionaries when a key or value has been reclaimed by garbage collection. :class:`WeakSet` implements the :class:`set` interface, but keeps weak references to its elements, just like a :class:`WeakKeyDictionary` does.
sv: :class:`WeakKeyDictionary` och :class:`WeakValueDictionary` använder svaga referenser i sin implementering och skapar callback-funktioner på de svaga referenserna som meddelar de svaga ordböckerna när en nyckel eller ett värde har återvunnits av garbage collection. :class:`WeakSet` implementerar gränssnittet :class:`set`, men behåller svaga referenser till sina element, precis som en :class:`WeakKeyDictionary` gör.

source: :class:`finalize` provides a straight forward way to register a cleanup function to be called when an object is garbage collected. This is simpler to use than setting up a callback function on a raw weak reference, since the module automatically ensures that the finalizer remains alive until the object is collected.
sv: :class:`finalize` ger ett enkelt sätt att registrera en rensningsfunktion som ska anropas när ett objekt samlas in. Detta är enklare att använda än att sätta upp en callback-funktion på en svag referens, eftersom modulen automatiskt ser till att finalizer-funktionen hålls vid liv tills objektet samlas in.

source: Most programs should find that using one of these weak container types or :class:`finalize` is all they need -- it's not usually necessary to create your own weak references directly. The low-level machinery is exposed by the :mod:`weakref` module for the benefit of advanced uses.
sv: De flesta program bör finna att det räcker med att använda en av dessa svaga containertyper eller :class:`finalize` - det är vanligtvis inte nödvändigt att skapa egna svaga referenser direkt. Maskineriet på låg nivå exponeras av modulen :mod:`weakref` till förmån för avancerade användningsområden.

source: Not all objects can be weakly referenced. Objects which support weak references include class instances, functions written in Python (but not in C), instance methods, sets, frozensets, some :term:`file objects <file object>`, :term:`generators <generator>`, type objects, sockets, arrays, deques, regular expression pattern objects, and code objects.
sv: Det är inte alla objekt som kan refereras svagt. Objekt som stöder svaga referenser inkluderar klassinstanser, funktioner skrivna i Python (men inte i C), instansmetoder, set, frozensets, vissa :term:`filobjekt <file object>`, :term:`generatorer <generator>`, typobjekt, sockets, matriser, deques, mönsterobjekt för reguljära uttryck och kodobjekt.

source: Added support for thread.lock, threading.Lock, and code objects.
sv: Lagt till stöd för thread.lock, threading.Lock och kodobjekt.

source: Several built-in types such as :class:`list` and :class:`dict` do not directly support weak references but can add support through subclassing::
sv: Flera inbyggda typer som :class:`list` och :class:`dict` har inte direkt stöd för svaga referenser men kan lägga till stöd genom underklassning::

source: class Dict(dict): pass obj = Dict(red=1, green=2, blue=3) # this object is weak referenceable
sv: klass Dict(dict): pass obj = Dict(röd=1, grön=2, blå=3) # detta objekt är svagt refererbart

source: Other built-in types such as :class:`tuple` and :class:`int` do not support weak references even when subclassed.
sv: Andra inbyggda typer som :class:`tuple` och :class:`int` stöder inte svaga referenser även om de är underklassade.

source: Extension types can easily be made to support weak references; see :ref:`weakref-support`.
sv: Tilläggstyper kan enkelt göras för att stödja svaga referenser; se :ref:`weakref-support`.

source: When ``__slots__`` are defined for a given type, weak reference support is disabled unless a ``'__weakref__'`` string is also present in the sequence of strings in the ``__slots__`` declaration. See :ref:`__slots__ documentation <slots>` for details.
sv: När ``__slots__`` definieras för en viss typ inaktiveras stödet för svaga referenser om inte en sträng av typen ``'__weakref__'`` också finns i sekvensen av strängar i ``__slots__``-deklarationen. Se :ref:`__slots__ dokumentation <slots>` för detaljer.

source: Return a weak reference to *object*. The original object can be retrieved by calling the reference object if the referent is still alive; if the referent is no longer alive, calling the reference object will cause :const:`None` to be returned. If *callback* is provided and not :const:`None`, and the returned weakref object is still alive, the callback will be called when the object is about to be finalized; the weak reference object will be passed as the only parameter to the callback; the referent will no longer be available.
sv: Returnerar en svag referens till *object*. Det ursprungliga objektet kan hämtas genom att anropa referensobjektet om referenten fortfarande är vid liv; om referenten inte längre är vid liv kommer anrop av referensobjektet att leda till att :const:`None` returneras. Om *callback* anges och inte :const:`None`, och det returnerade weakref-objektet fortfarande är vid liv, kommer callbacken att anropas när objektet är på väg att slutföras; det svaga referensobjektet kommer att skickas som den enda parametern till callbacken; referenten kommer inte längre att vara tillgänglig.

source: It is allowable for many weak references to be constructed for the same object. Callbacks registered for each weak reference will be called from the most recently registered callback to the oldest registered callback.
sv: Det är tillåtet att konstruera många svaga referenser för samma objekt. Callbacks som registrerats för varje svag referens kommer att anropas från den senast registrerade callbacken till den äldsta registrerade callbacken.

source: Exceptions raised by the callback will be noted on the standard error output, but cannot be propagated; they are handled in exactly the same way as exceptions raised from an object's :meth:`~object.__del__` method.
sv: Undantag som orsakas av återuppringningen noteras i standardfelutmatningen, men kan inte spridas; de hanteras på exakt samma sätt som undantag som orsakas av ett objekts :meth:`~object.__del__`-metod.

source: Weak references are :term:`hashable` if the *object* is hashable. They will maintain their hash value even after the *object* was deleted. If :func:`hash` is called the first time only after the *object* was deleted, the call will raise :exc:`TypeError`.
sv: Svaga referenser är :term:`hashable` om *objektet* är hashbart. De behåller sitt hashvärde även efter att *objektet* har tagits bort. Om :func:`hash` anropas första gången först efter att *objektet* har tagits bort, kommer anropet att ge upphov till :exc:`TypeError`.

source: Weak references support tests for equality, but not ordering. If the referents are still alive, two references have the same equality relationship as their referents (regardless of the *callback*). If either referent has been deleted, the references are equal only if the reference objects are the same object.
sv: Svaga referenser stöder tester för jämlikhet, men inte för ordning. Om referenterna fortfarande är vid liv har två referenser samma jämlikhetsrelation som sina referenter (oavsett *callback*). Om någon av referenterna har tagits bort är referenserna jämlika endast om referensobjekten är samma objekt.

source: This is a subclassable type rather than a factory function.
sv: Detta är en underklassbar typ snarare än en fabriksfunktion.

source: This read-only attribute returns the callback currently associated to the weakref. If there is no callback or if the referent of the weakref is no longer alive then this attribute will have value ``None``.
sv: Detta skrivskyddade attribut returnerar den återuppringning som för närvarande är associerad med weakref. Om det inte finns någon återkallelse eller om referenten till weakref inte längre lever kommer detta attribut att ha värdet ``None``.

source: Added the :attr:`__callback__` attribute.
sv: Lagt till attributet :attr:`__callback__`.

source: Return a proxy to *object* which uses a weak reference. This supports use of the proxy in most contexts instead of requiring the explicit dereferencing used with weak reference objects. The returned object will have a type of either ``ProxyType`` or ``CallableProxyType``, depending on whether *object* is callable. Proxy objects are not :term:`hashable` regardless of the referent; this avoids a number of problems related to their fundamentally mutable nature, and prevents their use as dictionary keys. *callback* is the same as the parameter of the same name to the :func:`ref` function.
sv: Returnerar en proxy till *object* som använder en svag referens. Detta stödjer användning av proxyn i de flesta sammanhang istället för att kräva den explicita dereferencing som används med svaga referensobjekt. Det returnerade objektet kommer att ha en typ av antingen ``ProxyType`` eller ``CallableProxyType``, beroende på om *object* är anropsbart. Proxy-objekt är inte :term:`hashable` oavsett referent; detta undviker ett antal problem relaterade till deras fundamentalt föränderliga natur, och förhindrar deras användning som ordboksnycklar. *callback* är detsamma som parametern med samma namn till funktionen :func:`ref`.

source: Accessing an attribute of the proxy object after the referent is garbage collected raises :exc:`ReferenceError`.
sv: Åtkomst till ett attribut för proxyobjektet efter att referenten har samlats in ger upphov till :exc:`ReferenceError`.

source: Extended the operator support on proxy objects to include the matrix multiplication operators ``@`` and ``@=``.
sv: Utökat operatorsstöd för proxyobjekt till att omfatta matrismultiplikationsoperatorerna ``@`` och ``@=``.

source: Return the number of weak references and proxies which refer to *object*.
sv: Returnera antalet svaga referenser och proxies som refererar till *objekt*.

source: Return a list of all weak reference and proxy objects which refer to *object*.
sv: Returnerar en lista över alla svaga referens- och proxyobjekt som refererar till *object*.

source: Mapping class that references keys weakly. Entries in the dictionary will be discarded when there is no longer a strong reference to the key. This can be used to associate additional data with an object owned by other parts of an application without adding attributes to those objects. This can be especially useful with objects that override attribute accesses.
sv: Mappningsklass som refererar svagt till nycklar. Poster i ordlistan kommer att kasseras när det inte längre finns någon stark referens till nyckeln. Detta kan användas för att associera ytterligare data med ett objekt som ägs av andra delar av en applikation utan att lägga till attribut till dessa objekt. Detta kan vara särskilt användbart med objekt som åsidosätter attributåtkomst.

source: Note that when a key with equal value to an existing key (but not equal identity) is inserted into the dictionary, it replaces the value but does not replace the existing key. Due to this, when the reference to the original key is deleted, it also deletes the entry in the dictionary::
sv: Observera att när en nyckel med samma värde som en befintlig nyckel (men inte samma identitet) infogas i ordlistan ersätter den värdet men inte den befintliga nyckeln. När referensen till den ursprungliga nyckeln raderas, raderas därför även posten i ordlistan::

source: >>> class T(str): pass ... >>> k1, k2 = T(), T() >>> d = weakref.WeakKeyDictionary() >>> d[k1] = 1 # d = {k1: 1} >>> d[k2] = 2 # d = {k1: 2} >>> del k1 # d = {}
sv: >>> class T(str): pass ... >>> k1, k2 = T(), T() >>> d = weakref.WeakKeyDictionary() >>> d[k1] = 1 # d = {k1: 1} d[k2] = 2 # d = {k1: 2} >>> d[k2] = 2 # d = {k1: 2} >>> del k1 # d = {}

source: A workaround would be to remove the key prior to reassignment::
sv: En lösning skulle vara att ta bort nyckeln före omplaceringen::

source: >>> class T(str): pass ... >>> k1, k2 = T(), T() >>> d = weakref.WeakKeyDictionary() >>> d[k1] = 1 # d = {k1: 1} >>> del d[k1] >>> d[k2] = 2 # d = {k2: 2} >>> del k1 # d = {k2: 2}
sv: >>> class T(str): pass ... >>> k1, k2 = T(), T() >>> d = weakref.WeakKeyDictionary() >>> d[k1] = 1 # d = {k1: 1} >>> del d[k1] >>> d[k2] = 2 # d = {k2: 2} >>> del k1 # d = {k1: 1} >>> del k1 >>> del k1 # d = {k2: 2}

source: Added support for ``|`` and ``|=`` operators, as specified in :pep:`584`.
sv: Lagt till stöd för operatorerna ``|`` och ``|=``, enligt specifikation i :pep:`584`.

source: :class:`WeakKeyDictionary` objects have an additional method that exposes the internal references directly. The references are not guaranteed to be "live" at the time they are used, so the result of calling the references needs to be checked before being used. This can be used to avoid creating references that will cause the garbage collector to keep the keys around longer than needed.
sv: :class:`WeakKeyDictionary`-objekt har en extra metod som exponerar de interna referenserna direkt. Det är inte säkert att referenserna är "live" när de används, så resultatet av att anropa referenserna måste kontrolleras innan de används. Detta kan användas för att undvika att skapa referenser som gör att garbage collector behåller nycklarna längre än nödvändigt.

source: Return an iterable of the weak references to the keys.
sv: Returnerar en iterabel av de svaga referenserna till nycklarna.

source: Mapping class that references values weakly. Entries in the dictionary will be discarded when no strong reference to the value exists any more.
sv: Mappningsklass som refererar svagt till värden. Poster i ordlistan kommer att kasseras när det inte längre finns någon stark referens till värdet.

source: :class:`WeakValueDictionary` objects have an additional method that has the same issues as the :meth:`WeakKeyDictionary.keyrefs` method.
sv: :class:`WeakValueDictionary`-objekt har en ytterligare metod som har samma problem som metoden :meth:`WeakKeyDictionary.keyrefs`.

source: Return an iterable of the weak references to the values.
sv: Returnerar en iterabel med svaga referenser till värdena.

source: Set class that keeps weak references to its elements. An element will be discarded when no strong reference to it exists any more.
sv: Set-klass som behåller svaga referenser till sina element. Ett element kasseras när det inte längre finns någon stark referens till det.

source: A custom :class:`ref` subclass which simulates a weak reference to a bound method (i.e., a method defined on a class and looked up on an instance). Since a bound method is ephemeral, a standard weak reference cannot keep hold of it. :class:`WeakMethod` has special code to recreate the bound method until either the object or the original function dies::
sv: En anpassad :class:`ref`-underklass som simulerar en svag referens till en bunden metod (dvs. en metod som definieras i en klass och söks upp i en instans). Eftersom en bunden metod är flyktig kan en vanlig svag referens inte hålla fast vid den. :class:`WeakMethod` har specialkod för att återskapa den bundna metoden tills antingen objektet eller den ursprungliga funktionen dör:

source: *callback* is the same as the parameter of the same name to the :func:`ref` function.
sv: *callback* är samma som parametern med samma namn till funktionen :func:`ref`.

source: Return a callable finalizer object which will be called when *obj* is garbage collected. Unlike an ordinary weak reference, a finalizer will always survive until the reference object is collected, greatly simplifying lifecycle management.
sv: Returnerar ett anropbart finalizer-objekt som kommer att anropas när *obj* samlas in. Till skillnad från en vanlig svag referens kommer en finalizer alltid att överleva tills referensobjektet samlas in, vilket förenklar livscykelhanteringen avsevärt.

source: A finalizer is considered *alive* until it is called (either explicitly or at garbage collection), and after that it is *dead*. Calling a live finalizer returns the result of evaluating ``func(*arg, **kwargs)``, whereas calling a dead finalizer returns :const:`None`.
sv: En finalizer anses vara *alive* tills den anropas (antingen explicit eller vid garbage collection), och efter det är den *dead*. Anrop av en levande finalizer returnerar resultatet av utvärderingen av ``func(*arg, **kwargs)``, medan anrop av en död finalizer returnerar :const:`None`.

source: Exceptions raised by finalizer callbacks during garbage collection will be shown on the standard error output, but cannot be propagated. They are handled in the same way as exceptions raised from an object's :meth:`~object.__del__` method or a weak reference's callback.
sv: Undantag som orsakas av finalizer callbacks under garbage collection visas på standardfelutmatningen, men kan inte spridas vidare. De hanteras på samma sätt som undantag som orsakas av ett objekts :meth:`~object.__del__`-metod eller en svag referenss återkallelse.

source: When the program exits, each remaining live finalizer is called unless its :attr:`atexit` attribute has been set to false. They are called in reverse order of creation.
sv: När programmet avslutas anropas varje kvarvarande live finalizer om inte dess attribut :attr:`atexit` har satts till false. De anropas i omvänd ordning efter att de skapats.

source: A finalizer will never invoke its callback during the later part of the :term:`interpreter shutdown` when module globals are liable to have been replaced by :const:`None`.
sv: En finalizer kommer aldrig att anropa sitt callback under den senare delen av :term:`tolkavstängningen` när modulglobaler kan ha ersatts av :const:`None`.

source: If *self* is alive then mark it as dead and return the result of calling ``func(*args, **kwargs)``. If *self* is dead then return :const:`None`.
sv: Om *self* är levande markeras den som död och resultatet av anropet ``func(*args, **kwargs)`` returneras. Om *self* är död returneras :const:`None`.

source: If *self* is alive then mark it as dead and return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
sv: Om *self* är levande markeras den som död och tupeln ``(obj, func, args, kwargs)`` returneras. Om *self* är död returneras :const:`None`.

source: If *self* is alive then return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
sv: Om *self* är vid liv returneras tupeln ``(obj, func, args, kwargs)``. Om *self* är död returneras :const:`None`.

source: Property which is true if the finalizer is alive, false otherwise.
sv: Egenskap som är sann om finalizer är levande, annars falsk.

source: A writable boolean property which by default is true. When the program exits, it calls all remaining live finalizers for which :attr:`.atexit` is true. They are called in reverse order of creation.
sv: En skrivbar boolesk egenskap som som standard är true. När programmet avslutas anropas alla återstående live finalizers för vilka :attr:`.atexit` är true. De anropas i omvänd ordning efter att de skapats.

source: It is important to ensure that *func*, *args* and *kwargs* do not own any references to *obj*, either directly or indirectly, since otherwise *obj* will never be garbage collected. In particular, *func* should not be a bound method of *obj*.
sv: Det är viktigt att se till att *func*, *args* och *kwargs* inte äger några referenser till *obj*, varken direkt eller indirekt, eftersom *obj* annars aldrig kommer att garbage collectas. I synnerhet bör *func* inte vara en bunden metod till *obj*.

source: The type object for weak references objects.
sv: Typobjektet för objekt med svaga referenser.

source: The type object for proxies of objects which are not callable.
sv: Typobjektet för proxies av objekt som inte är anropsbara.

source: The type object for proxies of callable objects.
sv: Typobjektet för proxyer av anropsbara objekt.
