Repository: yeager/python-docs-sv
Catalog: library/wsgiref.po
Languages: sv

source: :mod:`!wsgiref` --- WSGI Utilities and Reference Implementation
sv: :mod:`!wsgiref` --- WSGI-verktyg och referensimplementering

source: **Source code:** :source:`Lib/wsgiref`
sv: **Källkod:** :source:`Lib/wsgiref`

source: The Web Server Gateway Interface (WSGI) is a standard interface between web server software and web applications written in Python. Having a standard interface makes it easy to use an application that supports WSGI with a number of different web servers.
sv: Web Server Gateway Interface (WSGI) är ett standardgränssnitt mellan webbserverprogramvara och webbapplikationer skrivna i Python. Ett standardgränssnitt gör det enkelt att använda en applikation som stöder WSGI med ett antal olika webbservrar.

source: Only authors of web servers and programming frameworks need to know every detail and corner case of the WSGI design. You don't need to understand every detail of WSGI just to install a WSGI application or to write a web application using an existing framework.
sv: Endast författare av webbservrar och programmeringsramverk behöver känna till varje detalj och hörnfall i WSGI-designen. Du behöver inte förstå varje detalj i WSGI bara för att installera en WSGI-applikation eller för att skriva en webbapplikation med hjälp av ett befintligt ramverk.

source: :mod:`wsgiref` is a reference implementation of the WSGI specification that can be used to add WSGI support to a web server or framework. It provides utilities for manipulating WSGI environment variables and response headers, base classes for implementing WSGI servers, a demo HTTP server that serves WSGI applications, types for static type checking, and a validation tool that checks WSGI servers and applications for conformance to the WSGI specification (:pep:`3333`).
sv: :mod:`wsgiref` är en referensimplementering av WSGI-specifikationen som kan användas för att lägga till WSGI-stöd i en webbserver eller ett ramverk. Den innehåller verktyg för att manipulera WSGI-miljövariabler och svarshuvuden, basklasser för att implementera WSGI-servrar, en demo-HTTP-server som betjänar WSGI-applikationer, typer för statisk typkontroll och ett valideringsverktyg som kontrollerar att WSGI-servrar och applikationer överensstämmer med WSGI-specifikationen (:pep:`3333`).

source: See `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ for more information about WSGI, and links to tutorials and other resources.
sv: Se `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ för mer information om WSGI och länkar till handledningar och andra resurser.

source: :mod:`wsgiref.util` -- WSGI environment utilities
sv: :mod:`wsgiref.util` -- Verktyg för WSGI-miljön

source: This module provides a variety of utility functions for working with WSGI environments. A WSGI environment is a dictionary containing HTTP request variables as described in :pep:`3333`. All of the functions taking an *environ* parameter expect a WSGI-compliant dictionary to be supplied; please see :pep:`3333` for a detailed specification and :data:`~wsgiref.types.WSGIEnvironment` for a type alias that can be used in type annotations.
sv: Denna modul innehåller en mängd olika funktioner för att arbeta med WSGI-miljöer. En WSGI-miljö är en ordbok som innehåller HTTP-begärandevariabler enligt beskrivningen i :pep:`3333`. Alla funktioner som tar en *environ*-parameter förväntar sig att en WSGI-kompatibel ordbok ska levereras; se :pep:`3333` för en detaljerad specifikation och :data:`~wsgiref.types.WSGIEnvironment` för ett typalias som kan användas i typannoteringar.

source: Return a guess for whether ``wsgi.url_scheme`` should be "http" or "https", by checking for a ``HTTPS`` environment variable in the *environ* dictionary. The return value is a string.
sv: Returnerar en gissning om huruvida ``wsgi.url_scheme`` ska vara "http" eller "https", genom att kontrollera om det finns en miljövariabel ``HTTPS`` i ordlistan *environ*. Returvärdet är en sträng.

source: This function is useful when creating a gateway that wraps CGI or a CGI-like protocol such as FastCGI. Typically, servers providing such protocols will include a ``HTTPS`` variable with a value of "1", "yes", or "on" when a request is received via SSL. So, this function returns "https" if such a value is found, and "http" otherwise.
sv: Denna funktion är användbar när du skapar en gateway som omsluter CGI eller ett CGI-liknande protokoll som FastCGI. Servrar som tillhandahåller sådana protokoll innehåller vanligtvis en variabel ``HTTPS`` med värdet "1", "yes" eller "on" när en begäran tas emot via SSL. Den här funktionen returnerar alltså "https" om ett sådant värde hittas och "http" annars.

source: Return the full request URI, optionally including the query string, using the algorithm found in the "URL Reconstruction" section of :pep:`3333`. If *include_query* is false, the query string is not included in the resulting URI.
sv: Returnerar den fullständiga URI:n för begäran, eventuellt inklusive frågesträngen, med hjälp av algoritmen i avsnittet "URL Reconstruction" i :pep:`3333`. Om *include_query* är false inkluderas inte frågesträngen i den resulterande URI:n.

source: Similar to :func:`request_uri`, except that the ``PATH_INFO`` and ``QUERY_STRING`` variables are ignored. The result is the base URI of the application object addressed by the request.
sv: Liknar :func:`request_uri`, förutom att variablerna ``PATH_INFO`` och ``QUERY_STRING`` ignoreras. Resultatet är bas-URI:n för det applikationsobjekt som adresseras av begäran.

source: Shift a single name from ``PATH_INFO`` to ``SCRIPT_NAME`` and return the name. The *environ* dictionary is *modified* in-place; use a copy if you need to keep the original ``PATH_INFO`` or ``SCRIPT_NAME`` intact.
sv: Flytta ett enskilt namn från ``PATH_INFO`` till ``SCRIPT_NAME`` och returnera namnet. Ordboken *environ* är *modifierad* på plats; använd en kopia om du behöver behålla den ursprungliga ``PATH_INFO`` eller ``SCRIPT_NAME`` intakt.

source: If there are no remaining path segments in ``PATH_INFO``, ``None`` is returned.
sv: Om det inte finns några återstående sökvägssegment i ``PATH_INFO`` returneras ``None``.

source: Typically, this routine is used to process each portion of a request URI path, for example to treat the path as a series of dictionary keys. This routine modifies the passed-in environment to make it suitable for invoking another WSGI application that is located at the target URI. For example, if there is a WSGI application at ``/foo``, and the request URI path is ``/foo/bar/baz``, and the WSGI application at ``/foo`` calls :func:`shift_path_info`, it will receive the string "bar", and the environment will be updated to be suitable for passing to a WSGI application at ``/foo/bar``. That is, ``SCRIPT_NAME`` will change from ``/foo`` to ``/foo/bar``, and ``PATH_INFO`` will change from ``/bar/baz`` to ``/baz``.
sv: Vanligtvis används denna rutin för att bearbeta varje del av en sökväg till en begärd URI, t.ex. för att behandla sökvägen som en serie ordboksnycklar. Den här rutinen modifierar den överlämnade miljön så att den lämpar sig för att anropa en annan WSGI-applikation som finns på mål-URI:n. Till exempel, om det finns en WSGI-applikation på ``/foo``, och sökvägen till request URI är ``/foo/bar/baz``, och WSGI-applikationen på ``/foo`` anropar :func:`shift_path_info`, kommer den att ta emot strängen "bar", och miljön kommer att uppdateras så att den passar för att skickas till en WSGI-applikation på ``/foo/bar``. Det vill säga, ``SCRIPT_NAME`` ändras från ``/foo`` till ``/foo/bar``, och ``PATH_INFO`` ändras från ``/bar/baz`` till ``/baz``.

source: When ``PATH_INFO`` is just a "/", this routine returns an empty string and appends a trailing slash to ``SCRIPT_NAME``, even though empty path segments are normally ignored, and ``SCRIPT_NAME`` doesn't normally end in a slash. This is intentional behavior, to ensure that an application can tell the difference between URIs ending in ``/x`` from ones ending in ``/x/`` when using this routine to do object traversal.
sv: När ``PATH_INFO`` bara är ett "/" returnerar den här rutinen en tom sträng och lägger till ett efterföljande snedstreck till ``SCRIPT_NAME``, även om tomma sökvägssegment normalt ignoreras och ``SCRIPT_NAME`` normalt inte slutar med ett snedstreck. Detta är ett avsiktligt beteende för att säkerställa att ett program kan skilja mellan URI:er som slutar på ``/x`` och sådana som slutar på ``/x/`` när den här rutinen används för objekttraversering.

source: Update *environ* with trivial defaults for testing purposes.
sv: Uppdatera *environ* med triviala standardvärden för teständamål.

source: This routine adds various parameters required for WSGI, including ``HTTP_HOST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO``, and all of the :pep:`3333`\ -defined ``wsgi.*`` variables. It only supplies default values, and does not replace any existing settings for these variables.
sv: Denna rutin lägger till olika parametrar som krävs för WSGI, inklusive ``HTTP_HOST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO`` och alla :pep:`3333`'-definierade ``wsgi.*``-variabler. Den tillhandahåller endast standardvärden och ersätter inte befintliga inställningar för dessa variabler.

source: This routine is intended to make it easier for unit tests of WSGI servers and applications to set up dummy environments. It should NOT be used by actual WSGI servers or applications, since the data is fake!
sv: Denna rutin är avsedd att göra det enklare för enhetstester av WSGI-servrar och applikationer att skapa dummy-miljöer. Den ska INTE användas av faktiska WSGI-servrar eller applikationer, eftersom data är falska!

source: Example usage (see also :func:`~wsgiref.simple_server.demo_app` for another example)::
sv: Exempel på användning (se även :func:`~wsgiref.simple_server.demo_app` för ett annat exempel)::

source: In addition to the environment functions above, the :mod:`wsgiref.util` module also provides these miscellaneous utilities:
sv: Förutom miljöfunktionerna ovan tillhandahåller modulen :mod:`wsgiref.util` även dessa olika verktyg:

source: Return ``True`` if 'header_name' is an HTTP/1.1 "Hop-by-Hop" header, as defined by :rfc:`2616`.
sv: Returnerar ``True`` om 'header_name' är en HTTP/1.1 "Hop-by-Hop" header, enligt definitionen i :rfc:`2616`.

source: A concrete implementation of the :class:`wsgiref.types.FileWrapper` protocol used to convert a file-like object to an :term:`iterator`. The resulting objects are :term:`iterable`\ s. As the object is iterated over, the optional *blksize* parameter will be repeatedly passed to the *filelike* object's :meth:`read` method to obtain bytestrings to yield. When :meth:`read` returns an empty bytestring, iteration is ended and is not resumable.
sv: En konkret implementering av protokollet :class:`wsgiref.types.FileWrapper` som används för att konvertera ett filliknande objekt till en :term:`iterator`. De resulterande objekten är :term:`iterable`\ s. När objektet itereras över kommer den valfria parametern *blksize* upprepade gånger att skickas till det *filliknande* objektets :meth:`read`-metod för att få bytestrings att ge. När :meth:`read` returnerar en tom bytestring är iterationen avslutad och kan inte återupptas.

source: If *filelike* has a :meth:`close` method, the returned object will also have a :meth:`close` method, and it will invoke the *filelike* object's :meth:`close` method when called.
sv: Om *filelike* har en :meth:`close`-metod kommer det returnerade objektet också att ha en :meth:`close`-metod, och det kommer att anropa *filelike*-objektets :meth:`close`-metod när den anropas.

source: Example usage::
sv: Exempel på användning::

source: Support for :meth:`~object.__getitem__` method has been removed.
sv: Stöd för metoden :meth:`~object.__getitem__` har tagits bort.

source: :mod:`wsgiref.headers` -- WSGI response header tools
sv: :mod:`wsgiref.headers` -- Verktyg för WSGI-svarshuvuden

source: This module provides a single class, :class:`Headers`, for convenient manipulation of WSGI response headers using a mapping-like interface.
sv: Denna modul tillhandahåller en enda klass, :class:`Headers`, för bekväm manipulation av WSGI-svarshuvuden med hjälp av ett mappningsliknande gränssnitt.

source: Create a mapping-like object wrapping *headers*, which must be a list of header name/value tuples as described in :pep:`3333`. The default value of *headers* is an empty list.
sv: Skapa ett mappningsliknande objekt som omsluter *headers*, som måste vara en lista med headernamn/värde-tupler enligt beskrivningen i :pep:`3333`. Standardvärdet för *headers* är en tom lista.

source: :class:`Headers` objects support typical mapping operations including :meth:`~object.__getitem__`, :meth:`~dict.get`, :meth:`~object.__setitem__`, :meth:`~dict.setdefault`, :meth:`~object.__delitem__` and :meth:`~object.__contains__`. For each of these methods, the key is the header name (treated case-insensitively), and the value is the first value associated with that header name. Setting a header deletes any existing values for that header, then adds a new value at the end of the wrapped header list. Headers' existing order is generally maintained, with new headers added to the end of the wrapped list.
sv: :class:`Headers`-objekt stöder typiska mappningsoperationer inklusive :meth:`~object.__getitem__`, :meth:`~dict.get`, :meth:`~object.__setitem__`, :meth:`~dict.setdefault`, :meth:`~object.__delitem__` och :meth:`~object.__contains__`. För var och en av dessa metoder är nyckeln rubriknamnet (behandlas utan hänsyn till skiftlägesskillnader) och värdet är det första värdet som associeras med rubriknamnet. När en header ställs in raderas alla befintliga värden för denna header, och ett nytt värde läggs till i slutet av listan över omslutna headers. Den befintliga ordningen på rubrikerna bibehålls i allmänhet, och nya rubriker läggs till i slutet av den omslutna listan.

source: Unlike a dictionary, :class:`Headers` objects do not raise an error when you try to get or delete a key that isn't in the wrapped header list. Getting a nonexistent header just returns ``None``, and deleting a nonexistent header does nothing.
sv: Till skillnad från en ordbok ger :class:`Headers`-objekt inte upphov till något fel när du försöker hämta eller ta bort en nyckel som inte finns i den omslutna headerlistan. Att hämta en icke-existerande header returnerar bara ``None``, och att ta bort en icke-existerande header gör ingenting.

source: :class:`Headers` objects also support :meth:`keys`, :meth:`values`, and :meth:`items` methods. The lists returned by :meth:`keys` and :meth:`items` can include the same key more than once if there is a multi-valued header. The ``len()`` of a :class:`Headers` object is the same as the length of its :meth:`items`, which is the same as the length of the wrapped header list. In fact, the :meth:`items` method just returns a copy of the wrapped header list.
sv: :class:`Headers`-objekt stöder också metoderna :meth:`keys`, :meth:`values` och :meth:`items`. Listorna som returneras av :meth:`keys` och :meth:`items` kan innehålla samma nyckel mer än en gång om det finns en header med flera värden. ``len()`` för ett :class:`Headers`-objekt är samma som längden på dess :meth:`items`, som är samma som längden på den omslutna header-listan. Faktum är att metoden :meth:`items` bara returnerar en kopia av den omslutna header-listan.

source: Calling ``bytes()`` on a :class:`Headers` object returns a formatted bytestring suitable for transmission as HTTP response headers. Each header is placed on a line with its value, separated by a colon and a space. Each line is terminated by a carriage return and line feed, and the bytestring is terminated with a blank line.
sv: Anrop av ``bytes()`` på ett :class:`Headers`-objekt returnerar en formaterad bytestring som lämpar sig för överföring som HTTP-svarshuvuden. Varje header placeras på en rad med sitt värde, åtskilda av ett kolon och ett mellanslag. Varje rad avslutas med en vagnsretur och radmatning, och bytestringen avslutas med en blankrad.

source: In addition to their mapping interface and formatting features, :class:`Headers` objects also have the following methods for querying and adding multi-valued headers, and for adding headers with MIME parameters:
sv: Förutom mappningsgränssnittet och formateringsfunktionerna har :class:`Headers`-objekten även följande metoder för att fråga efter och lägga till flervärdiga rubriker och för att lägga till rubriker med MIME-parametrar:

source: Return a list of all the values for the named header.
sv: Returnerar en lista med alla värden för den angivna rubriken.

source: The returned list will be sorted in the order they appeared in the original header list or were added to this instance, and may contain duplicates. Any fields deleted and re-inserted are always appended to the header list. If no fields exist with the given name, returns an empty list.
sv: Den returnerade listan kommer att sorteras i den ordning som de förekom i den ursprungliga huvudlistan eller lades till i denna instans, och kan innehålla dubbletter. Fält som tas bort och läggs till på nytt läggs alltid till i huvudlistan. Om det inte finns några fält med det angivna namnet returneras en tom lista.

source: Add a (possibly multi-valued) header, with optional MIME parameters specified via keyword arguments.
sv: Lägg till ett (eventuellt flervärdigt) huvud med valfria MIME-parametrar som anges via nyckelordsargument.

source: *name* is the header field to add. Keyword arguments can be used to set MIME parameters for the header field. Each parameter must be a string or ``None``. Underscores in parameter names are converted to dashes, since dashes are illegal in Python identifiers, but many MIME parameter names include dashes. If the parameter value is a string, it is added to the header value parameters in the form ``name="value"``. If it is ``None``, only the parameter name is added. (This is used for MIME parameters without a value.) Example usage::
sv: *name* är rubrikfältet som ska läggas till. Keyword-argument kan användas för att ange MIME-parametrar för rubrikfältet. Varje parameter måste vara en sträng eller ``None``. Underscores i parameternamn konverteras till bindestreck, eftersom bindestreck är olagliga i Python-identifierare, men många MIME-parameternamn innehåller bindestreck. Om parametervärdet är en sträng läggs det till i rubrikens värdeparametrar i formen ``name="value"``. Om det är ``None`` läggs endast parameternamnet till. (Detta används för MIME-parametrar utan värde.) Exempel på användning::

source: h.add_header('content-disposition', 'attachment', filename='bud.gif')
sv: h.add_header('content-disposition', 'attachment', filnamn='bud.gif')

source: The above will add a header that looks like this::
sv: Ovanstående kommer att lägga till en rubrik som ser ut så här::

source: Content-Disposition: attachment; filename="bud.gif"
sv: Innehåll-Disposition: attachment; filnamn="bud.gif"

source: *headers* parameter is optional.
sv: *parametern headers* är valfri.

source: :mod:`wsgiref.simple_server` -- a simple WSGI HTTP server
sv: :mod:`wsgiref.simple_server` -- en enkel WSGI HTTP-server

source: This module implements a simple HTTP server (based on :mod:`http.server`) that serves WSGI applications. Each server instance serves a single WSGI application on a given host and port. If you want to serve multiple applications on a single host and port, you should create a WSGI application that parses ``PATH_INFO`` to select which application to invoke for each request. (E.g., using the :func:`shift_path_info` function from :mod:`wsgiref.util`.)
sv: Denna modul implementerar en enkel HTTP-server (baserad på :mod:`http.server`) som betjänar WSGI-applikationer. Varje serverinstans betjänar en enda WSGI-applikation på en given värd och port. Om du vill betjäna flera program på en enda värd och port bör du skapa ett WSGI-program som analyserar ``PATH_INFO`` för att välja vilket program som ska anropas för varje begäran. (T.ex. med hjälp av funktionen :func:`shift_path_info` från :mod:`wsgiref.util`.)

source: Create a new WSGI server listening on *host* and *port*, accepting connections for *app*. The return value is an instance of the supplied *server_class*, and will process requests using the specified *handler_class*. *app* must be a WSGI application object, as defined by :pep:`3333`.
sv: Skapa en ny WSGI-server som lyssnar på *host* och *port* och accepterar anslutningar för *app*. Returvärdet är en instans av den medföljande *server_class*, och kommer att behandla förfrågningar med hjälp av den angivna *handler_class*. *app* måste vara ett WSGI-applikationsobjekt, enligt definitionen i :pep:`3333`.

source: This function is a small but complete WSGI application that returns a text page containing the message "Hello world!" and a list of the key/value pairs provided in the *environ* parameter. It's useful for verifying that a WSGI server (such as :mod:`wsgiref.simple_server`) is able to run a simple WSGI application correctly.
sv: Denna funktion är en liten men komplett WSGI-applikation som returnerar en textsida som innehåller meddelandet "Hello world!" och en lista över de nyckel/värde-par som anges i parametern *environ*. Den är användbar för att verifiera att en WSGI-server (t.ex. :mod:`wsgiref.simple_server`) kan köra en enkel WSGI-applikation korrekt.

source: The *start_response* callable should follow the :class:`.StartResponse` protocol.
sv: Anropsbarheten *start_response* bör följa protokollet :class:`.StartResponse`.

source: Create a :class:`WSGIServer` instance. *server_address* should be a ``(host,port)`` tuple, and *RequestHandlerClass* should be the subclass of :class:`http.server.BaseHTTPRequestHandler` that will be used to process requests.
sv: Skapa en instans av :class:`WSGIServer`. *server_address* ska vara en ``(host,port)`` tupel, och *RequestHandlerClass* ska vara underklassen till :class:`http.server.BaseHTTPRequestHandler` som kommer att användas för att behandla förfrågningar.

source: You do not normally need to call this constructor, as the :func:`make_server` function can handle all the details for you.
sv: Du behöver normalt inte anropa den här konstruktören, eftersom funktionen :func:`make_server` kan hantera alla detaljer åt dig.

source: :class:`WSGIServer` is a subclass of :class:`http.server.HTTPServer`, so all of its methods (such as :meth:`serve_forever` and :meth:`handle_request`) are available. :class:`WSGIServer` also provides these WSGI-specific methods:
sv: :class:`WSGIServer` är en underklass till :class:`http.server.HTTPServer`, så alla dess metoder (som :meth:`serve_forever` och :meth:`handle_request`) är tillgängliga. :class:`WSGIServer` tillhandahåller även dessa WSGI-specifika metoder:

source: Sets the callable *application* as the WSGI application that will receive requests.
sv: Ställer in den anropsbara *application* som den WSGI-applikation som ska ta emot förfrågningar.

source: Returns the currently set application callable.
sv: Returnerar den aktuella inställda applikationskallelsen.

source: Normally, however, you do not need to use these additional methods, as :meth:`set_app` is normally called by :func:`make_server`, and the :meth:`get_app` exists mainly for the benefit of request handler instances.
sv: Normalt behöver du dock inte använda dessa ytterligare metoder, eftersom :meth:`set_app` normalt anropas av :func:`make_server`, och :meth:`get_app` främst är till för request handler-instanser.
