Repository: yeager/python-docs-sv
Catalog: library/wsgiref.po
Languages: sv

source: The default implementation just uses the :attr:`error_status`, :attr:`error_headers`, and :attr:`error_body` attributes to generate an output page. Subclasses can override this to produce more dynamic error output.
sv: Standardimplementeringen använder bara attributen :attr:`error_status`, :attr:`error_headers` och :attr:`error_body` för att generera en utdatasida. Subklasser kan åsidosätta detta för att producera mer dynamisk felutmatning.

source: Note, however, that it's not recommended from a security perspective to spit out diagnostics to any old user; ideally, you should have to do something special to enable diagnostic output, which is why the default implementation doesn't include any.
sv: Observera dock att det inte är rekommenderat ur ett säkerhetsperspektiv att spotta ut diagnostik till vilken användare som helst; helst bör du behöva göra något speciellt för att aktivera diagnostisk utmatning, vilket är anledningen till att standardimplementeringen inte innehåller någon.

source: The HTTP status used for error responses. This should be a status string as defined in :pep:`3333`; it defaults to a 500 code and message.
sv: Den HTTP-status som används för felsvar. Detta bör vara en statussträng enligt definitionen i :pep:`3333`; standardvärdet är en 500-kod och ett 500-meddelande.

source: The HTTP headers used for error responses. This should be a list of WSGI response headers (``(name, value)`` tuples), as described in :pep:`3333`. The default list just sets the content type to ``text/plain``.
sv: De HTTP-rubriker som används för felsvar. Detta bör vara en lista över WSGI-svarshuvuden (``(namn, värde)``-tupler), enligt beskrivningen i :pep:`3333`. Standardlistan sätter bara innehållstypen till ``text/plain``.

source: The error response body. This should be an HTTP response body bytestring. It defaults to the plain text, "A server error occurred. Please contact the administrator."
sv: Felmeddelandets kropp. Detta bör vara en bytestring för HTTP-svarstext. Standardvärdet är klartext, "Ett serverfel inträffade. Vänligen kontakta administratören."

source: Methods and attributes for :pep:`3333`'s "Optional Platform-Specific File Handling" feature:
sv: Metoder och attribut för :pep:`3333`:s funktion "Optional Platform-Specific File Handling":

source: A ``wsgi.file_wrapper`` factory, compatible with :class:`wsgiref.types.FileWrapper`, or ``None``. The default value of this attribute is the :class:`wsgiref.util.FileWrapper` class.
sv: En ``wsgi.file_wrapper``-fabrik, kompatibel med :class:`wsgiref.types.FileWrapper`, eller ``None``. Standardvärdet för detta attribut är klassen :class:`wsgiref.util.FileWrapper`.

source: Override to implement platform-specific file transmission. This method is called only if the application's return value is an instance of the class specified by the :attr:`wsgi_file_wrapper` attribute. It should return a true value if it was able to successfully transmit the file, so that the default transmission code will not be executed. The default implementation of this method just returns a false value.
sv: Åsidosättande för att implementera plattformsspecifik filöverföring. Denna metod anropas endast om programmets returvärde är en instans av den klass som anges av attributet :attr:`wsgi_file_wrapper`. Den bör returnera ett sant värde om den lyckades överföra filen, så att standardöverföringskoden inte körs. Standardimplementeringen av denna metod returnerar bara ett falskt värde.

source: Miscellaneous methods and attributes:
sv: Diverse metoder och attribut:

source: This attribute should be set to a true value if the handler's :meth:`_write` and :meth:`_flush` are being used to communicate directly to the client, rather than via a CGI-like gateway protocol that wants the HTTP status in a special ``Status:`` header.
sv: Detta attribut bör sättas till ett sant värde om hanterarens :meth:`_write` och :meth:`_flush` används för att kommunicera direkt till klienten, snarare än via ett CGI-liknande gateway-protokoll som vill ha HTTP-statusen i en speciell ``Status:`` header.

source: This attribute's default value is true in :class:`BaseHandler`, but false in :class:`BaseCGIHandler` and :class:`CGIHandler`.
sv: Detta attributs standardvärde är true i :class:`BaseHandler`, men false i :class:`BaseCGIHandler` och :class:`CGIHandler`.

source: If :attr:`origin_server` is true, this string attribute is used to set the HTTP version of the response set to the client. It defaults to ``"1.0"``.
sv: Om :attr:`origin_server` är true används detta strängattribut för att ange HTTP-versionen av det svar som skickas till klienten. Standardvärdet är ``"1.0"``.

source: Transcode CGI variables from ``os.environ`` to :pep:`3333` "bytes in unicode" strings, returning a new dictionary. This function is used by :class:`CGIHandler` and :class:`IISCGIHandler` in place of directly using ``os.environ``, which is not necessarily WSGI-compliant on all platforms and web servers using Python 3 -- specifically, ones where the OS's actual environment is Unicode (i.e. Windows), or ones where the environment is bytes, but the system encoding used by Python to decode it is anything other than ISO-8859-1 (e.g. Unix systems using UTF-8).
sv: Transcode CGI-variabler från ``os.environ`` till :pep:`3333` "bytes in unicode"-strängar, returnerar en ny ordbok. Denna funktion används av :class:`CGIHandler` och :class:`IISCGIHandler` i stället för att direkt använda ``os.environ``, som inte nödvändigtvis är WSGI-kompatibel på alla plattformar och webbservrar som använder Python 3 -- särskilt sådana där operativsystemets faktiska miljö är Unicode (dvs.windows), eller sådana där miljön är bytes, men systemkodningen som Python använder för att avkoda den är något annat än ISO-8859-1 (t.ex. Unix-system som använder UTF-8).

source: If you are implementing a CGI-based handler of your own, you probably want to use this routine instead of just copying values out of ``os.environ`` directly.
sv: Om du implementerar en egen CGI-baserad hanterare vill du förmodligen använda den här rutinen i stället för att bara kopiera värden direkt från ``os.environ``.

source: :mod:`wsgiref.types` -- WSGI types for static type checking
sv: :mod:`wsgiref.types` -- WSGI-typer för statisk typkontroll

source: This module provides various types for static type checking as described in :pep:`3333`.
sv: Denna modul tillhandahåller olika typer för statisk typkontroll enligt beskrivningen i :pep:`3333`.

source: A :class:`typing.Protocol` describing :pep:`start_response() <3333#the-start-response-callable>` callables (:pep:`3333`).
sv: En :class:`typing.Protocol` som beskriver :pep:`start_response() <3333#the-start-response-callable>` anropbara (:pep:`3333`).

source: A type alias describing a WSGI environment dictionary.
sv: Ett typalias som beskriver en WSGI-miljöordbok.

source: A type alias describing a WSGI application callable.
sv: Ett typalias som beskriver en WSGI-applikation som kan anropas.

source: A :class:`typing.Protocol` describing a :pep:`WSGI Input Stream <3333#input-and-error-streams>`.
sv: En :class:`typing.Protocol` som beskriver en :pep:`WSGI Input Stream <3333#input-and-error-streams>`.

source: A :class:`typing.Protocol` describing a :pep:`WSGI Error Stream <3333#input-and-error-streams>`.
sv: En :class:`typing.Protocol` som beskriver en :pep:`WSGI Error Stream <3333#input-and-error-streams>`.

source: A :class:`typing.Protocol` describing a :pep:`file wrapper <3333#optional-platform-specific-file-handling>`. See :class:`wsgiref.util.FileWrapper` for a concrete implementation of this protocol.
sv: Ett :class:`typing.Protocol` som beskriver en :pep:`filomslag <3333#optional-platform-specific-file-handling>`. Se :class:`wsgiref.util.FileWrapper` för en konkret implementation av detta protokoll.

source: Examples
sv: Exempel

source: This is a working "Hello World" WSGI application, where the *start_response* callable should follow the :class:`.StartResponse` protocol::
sv: Detta är en fungerande "Hello World" WSGI applikation, där *start_response* callable ska följa :class:`.StartResponse` protokollet::

source: Example of a WSGI application serving the current directory, accept optional directory and port number (default: 8000) on the command line::
sv: Exempel på en WSGI-applikation som betjänar den aktuella katalogen, acceptera valfri katalog och portnummer (standard: 8000) på kommandoraden::
