Repository: yeager/python-docs-sv
Catalog: library/wsgiref.po
Languages: sv

source: Create an HTTP handler for the given *request* (i.e. a socket), *client_address* (a ``(host,port)`` tuple), and *server* (:class:`WSGIServer` instance).
sv: Skapa en HTTP-hanterare för den angivna *request* (dvs. en socket), *client_address* (en ``(host,port)``-tupel) och *server* (:class:`WSGIServer`-instans).

source: You do not need to create instances of this class directly; they are automatically created as needed by :class:`WSGIServer` objects. You can, however, subclass this class and supply it as a *handler_class* to the :func:`make_server` function. Some possibly relevant methods for overriding in subclasses:
sv: Du behöver inte skapa instanser av den här klassen direkt; de skapas automatiskt vid behov av :class:`WSGIServer`-objekt. Du kan dock subklassa den här klassen och tillhandahålla den som en *handler_class* till funktionen :func:`make_server`. Några eventuellt relevanta metoder för åsidosättande i underklasser:

source: Return a :data:`~wsgiref.types.WSGIEnvironment` dictionary for a request. The default implementation copies the contents of the :class:`WSGIServer` object's :attr:`base_environ` dictionary attribute and then adds various headers derived from the HTTP request. Each call to this method should return a new dictionary containing all of the relevant CGI environment variables as specified in :pep:`3333`.
sv: Returnerar en :data:`~wsgiref.types.WSGIEnvironment`-ordbok för en begäran. Standardimplementeringen kopierar innehållet i :class:`WSGIServer`-objektets :attr:`base_environ`-ordboksattribut och lägger sedan till olika rubriker som härrör från HTTP-begäran. Varje anrop till denna metod bör returnera en ny dictionary som innehåller alla relevanta CGI-miljövariabler enligt specifikationen i :pep:`3333`.

source: Return the object that should be used as the ``wsgi.errors`` stream. The default implementation just returns ``sys.stderr``.
sv: Returnerar det objekt som ska användas som ``wsgi.errors`` ström. Standardimplementeringen returnerar bara ``sys.stderr``.

source: Process the HTTP request. The default implementation creates a handler instance using a :mod:`wsgiref.handlers` class to implement the actual WSGI application interface.
sv: Behandlar HTTP-begäran. Standardimplementeringen skapar en hanterarinstans med hjälp av en :mod:`wsgiref.handlers`-klass för att implementera det faktiska WSGI-applikationsgränssnittet.

source: :mod:`wsgiref.validate` --- WSGI conformance checker
sv: :mod:`wsgiref.validate` --- WSGI-kontroll av överensstämmelse

source: When creating new WSGI application objects, frameworks, servers, or middleware, it can be useful to validate the new code's conformance using :mod:`wsgiref.validate`. This module provides a function that creates WSGI application objects that validate communications between a WSGI server or gateway and a WSGI application object, to check both sides for protocol conformance.
sv: När du skapar nya WSGI-applikationsobjekt, ramverk, servrar eller mellanprogram kan det vara användbart att validera den nya kodens överensstämmelse med :mod:`wsgiref.validate`. Denna modul tillhandahåller en funktion som skapar WSGI-applikationsobjekt som validerar kommunikation mellan en WSGI-server eller gateway och ett WSGI-applikationsobjekt, för att kontrollera båda sidors protokollkonformitet.

source: Note that this utility does not guarantee complete :pep:`3333` compliance; an absence of errors from this module does not necessarily mean that errors do not exist. However, if this module does produce an error, then it is virtually certain that either the server or application is not 100% compliant.
sv: Observera att det här verktyget inte garanterar fullständig :pep:`3333`-kompatibilitet; om den här modulen inte ger några fel betyder det inte nödvändigtvis att det inte finns några fel. Men om den här modulen ger ett fel är det så gott som säkert att antingen servern eller programmet inte är 100% compliant.

source: This module is based on the :mod:`paste.lint` module from Ian Bicking's "Python Paste" library.
sv: Denna modul är baserad på :mod:`paste.lint`-modulen från Ian Bikings "Python Paste"-bibliotek.

source: Wrap *application* and return a new WSGI application object. The returned application will forward all requests to the original *application*, and will check that both the *application* and the server invoking it are conforming to the WSGI specification and to :rfc:`2616`.
sv: Omslut *applikation* och returnera ett nytt WSGI-applikationsobjekt. Den returnerade applikationen kommer att vidarebefordra alla förfrågningar till den ursprungliga *applikationen*, och kommer att kontrollera att både *applikationen* och servern som anropar den överensstämmer med WSGI-specifikationen och :rfc:`2616`.

source: Any detected nonconformance results in an :exc:`AssertionError` being raised; note, however, that how these errors are handled is server-dependent. For example, :mod:`wsgiref.simple_server` and other servers based on :mod:`wsgiref.handlers` (that don't override the error handling methods to do something else) will simply output a message that an error has occurred, and dump the traceback to ``sys.stderr`` or some other error stream.
sv: Alla upptäckta avvikelser resulterar i att ett :exc:`AssertionError` uppstår; observera dock att hur dessa fel hanteras är serverberoende. Till exempel kommer :mod:`wsgiref.simple_server` och andra servrar baserade på :mod:`wsgiref.handlers` (som inte åsidosätter felhanteringsmetoderna för att göra något annat) helt enkelt att mata ut ett meddelande om att ett fel har inträffat och dumpa spårningen till ``sys.stderr`` eller någon annan felström.

source: This wrapper may also generate output using the :mod:`warnings` module to indicate behaviors that are questionable but which may not actually be prohibited by :pep:`3333`. Unless they are suppressed using Python command-line options or the :mod:`warnings` API, any such warnings will be written to ``sys.stderr`` (*not* ``wsgi.errors``, unless they happen to be the same object).
sv: Denna wrapper kan också generera utdata med modulen :mod:`warnings` för att indikera beteenden som kan ifrågasättas men som kanske inte egentligen är förbjudna av :pep:`3333`. Om de inte undertrycks med Pythons kommandoradsalternativ eller :mod:`warnings` API, kommer alla sådana varningar att skrivas till ``sys.stderr`` (*inte* ``wsgi.errors``, såvida de inte råkar vara samma objekt).

source: :mod:`wsgiref.handlers` -- server/gateway base classes
sv: :mod:`wsgiref.handlers` -- basklasser för server/gateway

source: This module provides base handler classes for implementing WSGI servers and gateways. These base classes handle most of the work of communicating with a WSGI application, as long as they are given a CGI-like environment, along with input, output, and error streams.
sv: Den här modulen innehåller basklasser för hantering av WSGI-servrar och gateways. Dessa basklasser hanterar det mesta av arbetet med att kommunicera med en WSGI-applikation, så länge som de får en CGI-liknande miljö, tillsammans med inmatnings-, utmatnings- och felströmmar.

source: CGI-based invocation via ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` and ``os.environ``. This is useful when you have a WSGI application and want to run it as a CGI script. Simply invoke ``CGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
sv: CGI-baserad anropning via ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` och ``os.environ``. Detta är användbart när du har en WSGI-applikation och vill köra den som ett CGI-skript. Anropa helt enkelt ``CGIHandler().run(app)``, där ``app`` är det WSGI-applikationsobjekt som du vill anropa.

source: This class is a subclass of :class:`BaseCGIHandler` that sets ``wsgi.run_once`` to true, ``wsgi.multithread`` to false, and ``wsgi.multiprocess`` to true, and always uses :mod:`sys` and :mod:`os` to obtain the necessary CGI streams and environment.
sv: Den här klassen är en underklass till :class:`BaseCGIHandler` som sätter ``wsgi.run_once`` till true, ``wsgi.multithread`` till false och ``wsgi.multiprocess`` till true, och alltid använder :mod:`sys` och :mod:`os` för att få de nödvändiga CGI-strömmarna och miljön.

source: A specialized alternative to :class:`CGIHandler`, for use when deploying on Microsoft's IIS web server, without having set the config allowPathInfo option (IIS>=7) or metabase allowPathInfoForScriptMappings (IIS<7).
sv: Ett specialiserat alternativ till :class:`CGIHandler`, för användning vid distribution på Microsofts IIS-webbserver, utan att ha ställt in config allowPathInfo-alternativet (IIS>=7) eller metabasen allowPathInfoForScriptMappings (IIS<7).

source: By default, IIS gives a ``PATH_INFO`` that duplicates the ``SCRIPT_NAME`` at the front, causing problems for WSGI applications that wish to implement routing. This handler strips any such duplicated path.
sv: Som standard ger IIS en ``PATH_INFO`` som duplicerar ``SCRIPT_NAME`` längst fram, vilket orsakar problem för WSGI-program som vill implementera routing. Denna hanterare tar bort alla sådana duplicerade sökvägar.

source: IIS can be configured to pass the correct ``PATH_INFO``, but this causes another bug where ``PATH_TRANSLATED`` is wrong. Luckily this variable is rarely used and is not guaranteed by WSGI. On IIS<7, though, the setting can only be made on a vhost level, affecting all other script mappings, many of which break when exposed to the ``PATH_TRANSLATED`` bug. For this reason IIS<7 is almost never deployed with the fix (Even IIS7 rarely uses it because there is still no UI for it.).
sv: IIS kan konfigureras att skicka rätt ``PATH_INFO``, men detta orsakar en annan bugg där ``PATH_TRANSLATED`` är fel. Lyckligtvis används den här variabeln sällan och garanteras inte av WSGI. På IIS<7 kan inställningen dock bara göras på vhost-nivå, vilket påverkar alla andra skriptmappningar, varav många går sönder när de utsätts för ``PATH_TRANSLATED``-buggen. Av denna anledning distribueras IIS<7 nästan aldrig med korrigeringen (även IIS7 använder den sällan eftersom det fortfarande inte finns något användargränssnitt för den).

source: There is no way for CGI code to tell whether the option was set, so a separate handler class is provided. It is used in the same way as :class:`CGIHandler`, i.e., by calling ``IISCGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
sv: Det finns inget sätt för CGI-koden att avgöra om alternativet har ställts in, så en separat hanterarklass tillhandahålls. Den används på samma sätt som :class:`CGIHandler`, d.v.s. genom att anropa ``IISCGIHandler().run(app)``, där ``app`` är det WSGI-applikationsobjekt som du vill anropa.

source: Similar to :class:`CGIHandler`, but instead of using the :mod:`sys` and :mod:`os` modules, the CGI environment and I/O streams are specified explicitly. The *multithread* and *multiprocess* values are used to set the ``wsgi.multithread`` and ``wsgi.multiprocess`` flags for any applications run by the handler instance.
sv: Liknar :class:`CGIHandler`, men istället för att använda modulerna :mod:`sys` och :mod:`os` anges CGI-miljön och I/O-strömmarna explicit. Värdena *multithread* och *multiprocess* används för att ange flaggorna ``wsgi.multithread`` och ``wsgi.multiprocess`` för alla program som körs av hanterarinstansen.

source: This class is a subclass of :class:`SimpleHandler` intended for use with software other than HTTP "origin servers". If you are writing a gateway protocol implementation (such as CGI, FastCGI, SCGI, etc.) that uses a ``Status:`` header to send an HTTP status, you probably want to subclass this instead of :class:`SimpleHandler`.
sv: Denna klass är en subklass av :class:`SimpleHandler` avsedd för användning med annan programvara än HTTP "origin servers". Om du skriver en implementering av ett gateway-protokoll (t.ex. CGI, FastCGI, SCGI, etc.) som använder en ``Status:`` header för att skicka en HTTP-status, vill du förmodligen underordna dig denna istället för :class:`SimpleHandler`.

source: Similar to :class:`BaseCGIHandler`, but designed for use with HTTP origin servers. If you are writing an HTTP server implementation, you will probably want to subclass this instead of :class:`BaseCGIHandler`.
sv: Liknar :class:`BaseCGIHandler`, men är utformad för användning med HTTP-ursprungsmottagare. Om du skriver en HTTP-serverimplementation kommer du förmodligen att vilja underklassa denna istället för :class:`BaseCGIHandler`.

source: This class is a subclass of :class:`BaseHandler`. It overrides the :meth:`!__init__`, :meth:`~BaseHandler.get_stdin`, :meth:`~BaseHandler.get_stderr`, :meth:`~BaseHandler.add_cgi_vars`, :meth:`~BaseHandler._write`, and :meth:`~BaseHandler._flush` methods to support explicitly setting the environment and streams via the constructor. The supplied environment and streams are stored in the :attr:`stdin`, :attr:`stdout`, :attr:`stderr`, and :attr:`environ` attributes.
sv: Denna klass är en underklass till :class:`BaseHandler`. Den åsidosätter metoderna :meth:`!__init__`, :meth:`~BaseHandler.get_stdin`, :meth:`~BaseHandler.get_stderr`, :meth:`~BaseHandler.add_cgi_vars`, :meth:`~BaseHandler._write`, och :meth:`~BaseHandler._flush` för att stödja explicit inställning av miljö och strömmar via konstruktorn. Den miljö och de strömmar som anges lagras i attributen :attr:`stdin`, :attr:`stdout`, :attr:`stderr` och :attr:`environ`.

source: The :meth:`~io.BufferedIOBase.write` method of *stdout* should write each chunk in full, like :class:`io.BufferedIOBase`.
sv: Metoden :meth:`~io.BufferedIOBase.write` för *stdout* bör skriva varje del i sin helhet, som :class:`io.BufferedIOBase`.

source: This is an abstract base class for running WSGI applications. Each instance will handle a single HTTP request, although in principle you could create a subclass that was reusable for multiple requests.
sv: Detta är en abstrakt basklass för att köra WSGI-applikationer. Varje instans hanterar en enda HTTP-begäran, men i princip kan du skapa en underklass som kan återanvändas för flera begäranden.

source: :class:`BaseHandler` instances have only one method intended for external use:
sv: :class:`BaseHandler`-instanser har endast en metod avsedd för extern användning:

source: Run the specified WSGI application, *app*.
sv: Kör den angivna WSGI-applikationen, *app*.

source: All of the other :class:`BaseHandler` methods are invoked by this method in the process of running the application, and thus exist primarily to allow customizing the process.
sv: Alla andra :class:`BaseHandler`-metoder anropas av den här metoden när applikationen körs och finns därför främst till för att göra det möjligt att anpassa processen.

source: The following methods MUST be overridden in a subclass:
sv: Följande metoder MÅSTE åsidosättas i en subklass:

source: Buffer the bytes *data* for transmission to the client. It's okay if this method actually transmits the data; :class:`BaseHandler` just separates write and flush operations for greater efficiency when the underlying system actually has such a distinction.
sv: Buffra byte *data* för överföring till klienten. Det är okej om den här metoden faktiskt överför data; :class:`BaseHandler` separerar bara write och flush operationer för ökad effektivitet när det underliggande systemet faktiskt har en sådan distinktion.

source: Force buffered data to be transmitted to the client. It's okay if this method is a no-op (i.e., if :meth:`_write` actually sends the data).
sv: Tvinga buffrade data att överföras till klienten. Det är okej om den här metoden är en no-op (dvs. om :meth:`_write` faktiskt skickar data).

source: Return an object compatible with :class:`~wsgiref.types.InputStream` suitable for use as the ``wsgi.input`` of the request currently being processed.
sv: Returnerar ett objekt som är kompatibelt med :class:`~wsgiref.types.InputStream` och som kan användas som ``wsgi.input`` för den begäran som för närvarande behandlas.

source: Return an object compatible with :class:`~wsgiref.types.ErrorStream` suitable for use as the ``wsgi.errors`` of the request currently being processed.
sv: Returnerar ett objekt som är kompatibelt med :class:`~wsgiref.types.ErrorStream` och som kan användas som ``wsgi.errors`` för den begäran som för närvarande behandlas.

source: Insert CGI variables for the current request into the :attr:`environ` attribute.
sv: Infoga CGI-variabler för den aktuella begäran i attributet :attr:`environ`.

source: Here are some other methods and attributes you may wish to override. This list is only a summary, however, and does not include every method that can be overridden. You should consult the docstrings and source code for additional information before attempting to create a customized :class:`BaseHandler` subclass.
sv: Här är några andra metoder och attribut som du kanske vill åsidosätta. Den här listan är dock bara en sammanfattning och innehåller inte alla metoder som kan åsidosättas. Du bör konsultera dokumentationen och källkoden för ytterligare information innan du försöker skapa en anpassad :class:`BaseHandler`-underklass.

source: Attributes and methods for customizing the WSGI environment:
sv: Attribut och metoder för att anpassa WSGI-miljön:

source: The value to be used for the ``wsgi.multithread`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
sv: Det värde som ska användas för miljövariabeln ``wsgi.multithread``. Standardvärdet är true i :class:`BaseHandler`, men kan ha ett annat standardvärde (eller ställas in av konstruktören) i de andra underklasserna.

source: The value to be used for the ``wsgi.multiprocess`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
sv: Det värde som ska användas för miljövariabeln ``wsgi.multiprocess``. Standardvärdet är true i :class:`BaseHandler`, men kan ha ett annat standardvärde (eller ställas in av konstruktören) i de andra underklasserna.

source: The value to be used for the ``wsgi.run_once`` environment variable. It defaults to false in :class:`BaseHandler`, but :class:`CGIHandler` sets it to true by default.
sv: Det värde som ska användas för miljövariabeln ``wsgi.run_once``. Den är som standard false i :class:`BaseHandler`, men :class:`CGIHandler` sätter den till true som standard.

source: The default environment variables to be included in every request's WSGI environment. By default, this is a copy of ``os.environ`` at the time that :mod:`wsgiref.handlers` was imported, but subclasses can either create their own at the class or instance level. Note that the dictionary should be considered read-only, since the default value is shared between multiple classes and instances.
sv: Standardmiljövariablerna som ska inkluderas i varje begärandes WSGI-miljö. Som standard är detta en kopia av ``os.environ`` vid den tidpunkt då :mod:`wsgiref.handlers` importerades, men underklasser kan antingen skapa sina egna på klass- eller instansnivå. Observera att ordlistan bör betraktas som skrivskyddad, eftersom standardvärdet delas mellan flera klasser och instanser.

source: If the :attr:`origin_server` attribute is set, this attribute's value is used to set the default ``SERVER_SOFTWARE`` WSGI environment variable, and also to set a default ``Server:`` header in HTTP responses. It is ignored for handlers (such as :class:`BaseCGIHandler` and :class:`CGIHandler`) that are not HTTP origin servers.
sv: Om attributet :attr:`origin_server` är inställt, används detta attributs värde för att ställa in standard WSGI-miljövariabeln ``SERVER_SOFTWARE``, och även för att ställa in en standard ``Server:`` header i HTTP-svar. Det ignoreras för hanterare (såsom :class:`BaseCGIHandler` och :class:`CGIHandler`) som inte är HTTP-ursprungsmottagare.

source: The term "Python" is replaced with implementation specific term like "CPython", "Jython" etc.
sv: Termen "Python" ersätts med implementationsspecifika termer som "CPython", "Jython" etc.

source: Return the URL scheme being used for the current request. The default implementation uses the :func:`guess_scheme` function from :mod:`wsgiref.util` to guess whether the scheme should be "http" or "https", based on the current request's :attr:`environ` variables.
sv: Returnerar det URL-schema som används för den aktuella begäran. Standardimplementeringen använder funktionen :func:`guess_scheme` från :mod:`wsgiref.util` för att gissa om schemat ska vara "http" eller "https", baserat på den aktuella begärans :attr:`environ`-variabler.

source: Set the :attr:`environ` attribute to a fully populated WSGI environment. The default implementation uses all of the above methods and attributes, plus the :meth:`get_stdin`, :meth:`get_stderr`, and :meth:`add_cgi_vars` methods and the :attr:`wsgi_file_wrapper` attribute. It also inserts a ``SERVER_SOFTWARE`` key if not present, as long as the :attr:`origin_server` attribute is a true value and the :attr:`server_software` attribute is set.
sv: Ställ in attributet :attr:`environ` till en fullt ifylld WSGI-miljö. Standardimplementeringen använder alla ovanstående metoder och attribut, plus metoderna :meth:`get_stdin`, :meth:`get_stderr`, och :meth:`add_cgi_vars` och attributet :attr:`wsgi_file_wrapper`. Den infogar också nyckeln ``SERVER_SOFTWARE`` om den inte finns, så länge attributet :attr:`origin_server`` är ett sant värde och attributet :attr:`server_software`` är angivet.

source: Methods and attributes for customizing exception handling:
sv: Metoder och attribut för att anpassa undantagshanteringen:

source: Log the *exc_info* tuple in the server log. *exc_info* is a ``(type, value, traceback)`` tuple. The default implementation simply writes the traceback to the request's ``wsgi.errors`` stream and flushes it. Subclasses can override this method to change the format or retarget the output, mail the traceback to an administrator, or whatever other action may be deemed suitable.
sv: Loggar *exc_info*-tupeln i serverloggen. *exc_info* är en ``(typ, värde, spårning)`` tupel. Standardimplementeringen skriver helt enkelt spårningen till begärandets ``wsgi.errors``-ström och rensar den. Underklasser kan åsidosätta den här metoden för att ändra formatet eller rikta om utdata, skicka spårningen till en administratör eller någon annan åtgärd som kan anses lämplig.

source: The maximum number of frames to include in tracebacks output by the default :meth:`log_exception` method. If ``None``, all frames are included.
sv: Det maximala antalet bildrutor som ska inkluderas i spårningar som matas ut av standardmetoden :meth:`log_exception`. Om ``None`` inkluderas alla ramar.

source: This method is a WSGI application to generate an error page for the user. It is only invoked if an error occurs before headers are sent to the client.
sv: Denna metod är en WSGI-applikation som genererar en felsida för användaren. Den anropas endast om ett fel inträffar innan rubrikerna skickas till klienten.

source: This method can access the current error using ``sys.exception()``, and should pass that information to *start_response* when calling it (as described in the "Error Handling" section of :pep:`3333`). In particular, the *start_response* callable should follow the :class:`.StartResponse` protocol.
sv: Den här metoden kan komma åt det aktuella felet med hjälp av ``sys.exception()``, och bör skicka den informationen till *start_response* när den anropas (enligt beskrivningen i avsnittet "Error Handling" i :pep:`3333`). I synnerhet bör den anropbara *start_response* följa :class:`.StartResponse`-protokollet.
