Repository: yeager/python-docs-sv
Catalog: library/xml.etree.elementtree.po
Languages: sv

source: If the **parse** attribute is omitted, it defaults to "xml". The href attribute is required.
sv: Om attributet **parse** utelämnas är standardvärdet "xml". Attributet href är obligatoriskt.

source: To include a text document, use the ``{http://www.w3.org/2001/XInclude}include`` element, and set the **parse** attribute to "text":
sv: Om du vill inkludera ett textdokument använder du elementet ``{http://www.w3.org/2001/XInclude}include`` och sätter attributet **parse** till "text":

source: The result might look something like:
sv: Resultatet kan se ut ungefär så här:

source: <document xmlns:xi="http://www.w3.org/2001/XInclude"> Copyright (c) 2003. </document>
sv: <document xmlns:xi="http://www.w3.org/2001/XInclude"> Upphovsrätt (c) 2003. </document>

source: Default loader. This default loader reads an included resource from disk. *href* is a URL. *parse* is for parse mode either "xml" or "text". *encoding* is an optional text encoding. If not given, encoding is ``utf-8``. Returns the expanded resource. If the parse mode is ``"xml"``, this is an :class:`~xml.etree.ElementTree.Element` instance. If the parse mode is ``"text"``, this is a string. If the loader fails, it can return ``None`` or raise an exception.
sv: Standardladdare. Denna standardladdare läser en inkluderad resurs från disken. *href* är en URL. *parse* är för parse-läge antingen "xml" eller "text". *encoding* är en valfri textkodning. Om den inte anges är kodningen ``utf-8``. Returnerar den expanderade resursen. Om analysläget är ``"xml"``, är detta en :class:`~xml.etree.ElementTree.Element`-instans. Om tolkningsläget är ``"text"`` är detta en sträng. Om laddaren misslyckas kan den returnera ``None`` eller skapa ett undantag.

source: This function expands XInclude directives in-place in tree pointed by *elem*. *elem* is either the root :class:`~xml.etree.ElementTree.Element` or an :class:`~xml.etree.ElementTree.ElementTree` instance to find such element. *loader* is an optional resource loader. If omitted, it defaults to :func:`default_loader`. If given, it should be a callable that implements the same interface as :func:`default_loader`. *base_url* is base URL of the original file, to resolve relative include file references. *max_depth* is the maximum number of recursive inclusions. Limited to reduce the risk of malicious content explosion. Pass ``None`` to disable the limitation.
sv: Denna funktion expanderar XInclude-direktiv på plats i trädet som pekas ut av *elem*. *elem* är antingen roten :class:`~xml.etree.ElementTree.Element` eller en :class:`~xml.etree.ElementTree.ElementTree`-instans för att hitta ett sådant element. *loader* är en valfri resursladdare. Om den utelämnas är standardvärdet :func:`default_loader`. Om den anges bör den vara en anropsbar som implementerar samma gränssnitt som :func:`default_loader`. *base_url* är originalfilens bas-URL för att lösa relativa referenser till include-filer. *max_depth* är det maximala antalet rekursiva inkluderingar. Begränsat för att minska risken för explosion av skadligt innehåll. Ange ``None`` för att inaktivera begränsningen.

source: Added the *base_url* and *max_depth* parameters.
sv: Parametrarna *base_url* och *max_depth* har lagts till.

source: Element class. This class defines the Element interface, and provides a reference implementation of this interface.
sv: Klassen Element. Denna klass definierar Element-gränssnittet och tillhandahåller en referensimplementering av detta gränssnitt.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *tag* is the element name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments.
sv: Elementnamn, attributnamn och attributvärden kan vara antingen bytesträngar eller Unicode-strängar. *tag* är elementets namn. *attrib* är en valfri ordbok som innehåller elementattribut. *extra* innehåller ytterligare attribut, som anges som nyckelordsargument.

source: A string identifying what kind of data this element represents (the element type, in other words).
sv: En sträng som identifierar vilken typ av data som elementet representerar (elementtypen, med andra ord).

source: These attributes can be used to hold additional data associated with the element. Their values are usually strings but may be any application-specific object. If the element is created from an XML file, the *text* attribute holds either the text between the element's start tag and its first child or end tag, or ``None``, and the *tail* attribute holds either the text between the element's end tag and the next tag, or ``None``. For the XML data
sv: Dessa attribut kan användas för att hålla ytterligare data associerade med elementet. Deras värden är vanligtvis strängar men kan vara vilket applikationsspecifikt objekt som helst. Om elementet skapas från en XML-fil innehåller attributet *text* antingen texten mellan elementets starttagg och dess första barn- eller sluttagg, eller ``None``, och attributet *tail* innehåller antingen texten mellan elementets sluttagg och nästa tagg, eller ``None``. För XML-data

source: <a><b>1<c>2<d/>3</c></b>4</a>
sv: <a><b><c>12<d/></c></b>34</a>

source: the *a* element has ``None`` for both *text* and *tail* attributes, the *b* element has *text* ``"1"`` and *tail* ``"4"``, the *c* element has *text* ``"2"`` and *tail* ``None``, and the *d* element has *text* ``None`` and *tail* ``"3"``.
sv: elementet *a* har ``None`` för både attributen *text* och *tail*, elementet *b* har *text* ``"1"`` och *tail* ``"4"``, elementet *c* har *text* ``"2"`` och *tail* ``None``, och elementet *d* har *text* ``None`` och *tail* ``"3"``.

source: To collect the inner text of an element, see :meth:`itertext`, for example ``"".join(element.itertext())``.
sv: För att samla in den inre texten i ett element, se :meth:`itertext`, till exempel ``"".join(element.itertext())``.

source: Applications may store arbitrary objects in these attributes.
sv: Applikationer kan lagra godtyckliga objekt i dessa attribut.

source: A dictionary containing the element's attributes. Note that while the *attrib* value is always a real mutable Python dictionary, an ElementTree implementation may choose to use another internal representation, and create the dictionary only if someone asks for it. To take advantage of such implementations, use the dictionary methods below whenever possible.
sv: En ordbok som innehåller elementets attribut. Observera att även om *attrib*-värdet alltid är en verklig föränderlig Python-ordbok, kan en ElementTree-implementering välja att använda en annan intern representation och skapa ordboken endast om någon ber om det. För att dra nytta av sådana implementationer, använd dictionary-metoderna nedan när det är möjligt.

source: The following dictionary-like methods work on the element attributes.
sv: Följande ordboksliknande metoder fungerar på elementattributen.

source: Resets an element. This function removes all subelements, clears all attributes, and sets the text and tail attributes to ``None``.
sv: Återställer ett element. Denna funktion tar bort alla underelement, rensar alla attribut och sätter text- och tail-attributen till ``None``.

source: Gets the element attribute named *key*.
sv: Hämtar elementattributet med namnet *key*.

source: Returns the attribute value, or *default* if the attribute was not found.
sv: Returnerar attributvärdet, eller *default* om attributet inte hittades.

source: Returns the element attributes as a sequence of (name, value) pairs. The attributes are returned in an arbitrary order.
sv: Returnerar elementattributen som en sekvens av (namn, värde)-par. Attributen returneras i godtycklig ordning.

source: Returns the elements attribute names as a list. The names are returned in an arbitrary order.
sv: Returnerar elementens attributnamn som en lista. Namnen returneras i godtycklig ordning.

source: Set the attribute *key* on the element to *value*.
sv: Ställ in attributet *key* på elementet till *value*.

source: The following methods work on the element's children (subelements).
sv: Följande metoder fungerar på elementets barn (underelement).

source: Adds the element *subelement* to the end of this element's internal list of subelements. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
sv: Lägger till elementet *subelement* i slutet av detta elements interna lista över subelement. Utlöser :exc:`TypeError` om *subelement* inte är ett :class:`Element`.

source: Appends *subelements* from an iterable of elements. Raises :exc:`TypeError` if a subelement is not an :class:`Element`.
sv: Lägger till *subelement* från en iterabel av element. Utlöser :exc:`TypeError` om ett subelement inte är ett :class:`Element`.

source: Finds the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns an element instance or ``None``. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
sv: Hittar det första underelementet som matchar *match*. *match* kan vara ett taggnamn eller en :ref:`sökväg <elementtree-xpath>`. Returnerar en elementinstans eller ``None``. *namespaces* är en valfri mappning från namnrymds prefix till fullständigt namn. Passera ``''`` som prefix för att flytta alla taggnamn utan prefix i uttrycket till det angivna namnområdet.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns a list containing all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
sv: Hittar alla matchande underelement, genom taggnamn eller :ref:`path <elementtree-xpath>`. Returnerar en lista som innehåller alla matchande element i dokumentordning. *namespaces* är en valfri mappning från namnrymdsprefix till fullständigt namn. Passera ``''`` som prefix för att flytta alla taggnamn utan prefix i uttrycket till det angivna namnområdet.

source: Finds text for the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns the text content of the first matching element, or *default* if no element was found. Note that if the matching element has no text content an empty string is returned. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
sv: Hittar text för det första underelementet som matchar *match*. *match* kan vara ett taggnamn eller en :ref:`sökväg <elementtree-xpath>`. Returnerar textinnehållet i det första matchande elementet, eller *default* om inget element hittades. Observera att om det matchande elementet inte har något textinnehåll returneras en tom sträng. *namespaces* är en valfri mappning från namnområdesprefix till fullständigt namn. Ange ``''`` som prefix för att flytta alla taggnamn utan prefix i uttrycket till den angivna namnrymden.

source: Inserts *subelement* at the given position in this element. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
sv: Infogar *subelement* på den angivna positionen i detta element. Ger :exc:`TypeError` om *subelement* inte är ett :class:`Element`.

source: Creates a tree :term:`iterator` with the current element as the root. The iterator iterates over this element and all elements below it, in document (depth first) order. If *tag* is not ``None`` or ``'*'``, only elements whose tag equals *tag* are returned from the iterator. If the tree structure is modified during iteration, the result is undefined.
sv: Skapar ett träd :term:`iterator` med det aktuella elementet som rot. Iteratorn itererar över detta element och alla element under det, i dokumentordning (djupet först). Om *tag* inte är ``None`` eller ``'*'`` returneras endast element vars tagg är lika med *tag* från iteratorn. Om trädstrukturen ändras under iterationen blir resultatet odefinierat.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns an iterable yielding all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name.
sv: Hittar alla matchande underelement, med taggnamn eller :ref:`path <elementtree-xpath>`. Returnerar en iterabel som ger alla matchande element i dokumentordning. *namespaces* är en valfri mappning från namnområdesprefix till fullständigt namn.

source: Creates a text iterator. The iterator loops over this element and all subelements, in document order, and returns all inner text.
sv: Skapar en text-iterator. Iteratorn loopar över detta element och alla underelement, i dokumentordning, och returnerar all inre text.

source: Creates a new element object of the same type as this element. Do not call this method, use the :func:`SubElement` factory function instead.
sv: Skapar ett nytt elementobjekt av samma typ som detta element. Anropa inte denna metod, använd istället fabriksfunktionen :func:`SubElement`.

source: Removes *subelement* from the element. Unlike the find\* methods this method compares elements based on the instance identity, not on tag value or contents.
sv: Tar bort *subelement* från elementet. Till skillnad från find\*-metoderna jämför den här metoden element baserat på instansidentiteten, inte på taggens värde eller innehåll.

source: :class:`Element` objects also support the following sequence type methods for working with subelements: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.
sv: :class:`Element`-objekt stöder också följande sekvensmetoder för att arbeta med underelement: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.

source: Caution: Elements with no subelements will test as ``False``. In a future release of Python, all elements will test as ``True`` regardless of whether subelements exist. Instead, prefer explicit ``len(elem)`` or ``elem is not None`` tests.::
sv: Varning för detta: Element utan underelement kommer att testas som ``False``. I en framtida version av Python kommer alla element att testas som ``True`` oavsett om underelement existerar. Föredra istället explicita ``len(elem)`` eller ``elem is not None`` tester.::

source: element = root.find('foo') if not element: # careful! print("element not found, or element has no subelements") if element is None: print("element not found")
sv: element = root.find('foo') om inte element: # var försiktig! print("elementet hittades inte, eller elementet har inga underelement") om elementet är None: print("elementet hittades inte")

source: Testing the truth value of an Element emits :exc:`DeprecationWarning`.
sv: Test av sanningsvärdet för ett element ger upphov till :exc:`DeprecationWarning`.

source: Prior to Python 3.8, the serialisation order of the XML attributes of elements was artificially made predictable by sorting the attributes by their name. Based on the now guaranteed ordering of dicts, this arbitrary reordering was removed in Python 3.8 to preserve the order in which attributes were originally parsed or created by user code.
sv: Före Python 3.8 gjordes serialiseringsordningen för XML-attributen för element artificiellt förutsägbar genom att sortera attributen efter deras namn. Baserat på den nu garanterade ordningsföljden för dicts togs denna godtyckliga omordning bort i Python 3.8 för att bevara den ordning i vilken attributen ursprungligen analyserades eller skapades av användarkoden.

source: In general, user code should try not to depend on a specific ordering of attributes, given that the `XML Information Set <https://www.w3.org/TR/xml-infoset/>`_ explicitly excludes the attribute order from conveying information. Code should be prepared to deal with any ordering on input. In cases where deterministic XML output is required, e.g. for cryptographic signing or test data sets, canonical serialisation is available with the :func:`canonicalize` function.
sv: I allmänhet bör användarkod försöka att inte vara beroende av en specifik ordning av attribut, med tanke på att `XML Information Set <https://www.w3.org/TR/xml-infoset/>`_ uttryckligen utesluter attributordningen från att förmedla information. Koden bör vara förberedd på att hantera vilken ordning som helst i indata. I fall där deterministisk XML-utdata krävs, t.ex. för kryptografisk signering eller testdatauppsättningar, finns kanonisk serialisering tillgänglig med funktionen :func:`canonicalize`.

source: In cases where canonical output is not applicable but a specific attribute order is still desirable on output, code should aim for creating the attributes directly in the desired order, to avoid perceptual mismatches for readers of the code. In cases where this is difficult to achieve, a recipe like the following can be applied prior to serialisation to enforce an order independently from the Element creation::
sv: I fall där kanonisk utdata inte är tillämplig men en specifik attributordning fortfarande är önskvärd vid utdata, bör koden sträva efter att skapa attributen direkt i önskad ordning för att undvika perceptuella missanpassningar för läsare av koden. I fall där detta är svårt att uppnå kan ett recept som följande tillämpas före serialisering för att genomdriva en ordning oberoende av elementskapandet::

source: def reorder_attributes(root): for el in root.iter(): attrib = el.attrib if len(attrib) > 1: # adjust attribute order, e.g. by sorting attribs = sorted(attrib.items()) attrib.clear() attrib.update(attribs)
sv: def reorder_attributes(rot): för el i rot.iter(): attrib = el.attrib if len(attrib) > 1: # justera attributordningen, t.ex. genom sortering attribs = sorterad(attrib.items()) attrib.clear() attrib.update(attribs)

source: ElementTree Objects
sv: ElementTree-objekt

source: ElementTree wrapper class. This class represents an entire element hierarchy, and adds some extra support for serialization to and from standard XML.
sv: Omslagsklassen ElementTree. Den här klassen representerar en hel elementhierarki och ger lite extra stöd för serialisering till och från standard-XML.

source: *element* is the root element. The tree is initialized with the contents of the XML *file* if given.
sv: *element* är rotelementet. Trädet initialiseras med innehållet i XML *filen* om den anges.

source: Replaces the root element for this tree. This discards the current contents of the tree, and replaces it with the given element. Use with care. *element* is an element instance.
sv: Ersätter rotelementet för det här trädet. Detta kastar bort det aktuella innehållet i trädet och ersätter det med det angivna elementet. Använd med försiktighet. *element* är en elementinstans.

source: Same as :meth:`Element.find`, starting at the root of the tree.
sv: Samma som :meth:`Element.find`, med start vid trädets rot.

source: Same as :meth:`Element.findall`, starting at the root of the tree.
sv: Samma som :meth:`Element.findall`, med början vid trädets rot.

source: Same as :meth:`Element.findtext`, starting at the root of the tree.
sv: Samma som :meth:`Element.findtext`, med början vid trädets rot.

source: Returns the root element for this tree.
sv: Returnerar rotelementet för detta träd.

source: Creates and returns a tree iterator for the root element. The iterator loops over all elements in this tree, in section order. *tag* is the tag to look for (default is to return all elements).
sv: Skapar och returnerar en träditerator för rotelementet. Iteratorn loopar över alla element i detta träd, i sektionsordning. *tag* är den tagg som ska sökas (standard är att returnera alla element).

source: Same as :meth:`Element.iterfind`, starting at the root of the tree.
sv: Samma som :meth:`Element.iterfind`, med start vid trädets rot.

source: Loads an external XML section into this element tree. *source* is a file name or :term:`file object`. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns the section root element.
sv: Läser in ett externt XML-avsnitt i detta elementträd. *source* är ett filnamn eller :term:`filobjekt`. *parser* är en valfri parser-instans. Om den inte anges används standardparsern :class:`XMLParser`. Returnerar sektionens rotelement.

source: Writes the element tree to a file, as XML. *file* is a file name, or a :term:`file object` opened for writing. *encoding* [1]_ is the output encoding (default is US-ASCII). *xml_declaration* controls if an XML declaration should be added to the file. Use ``False`` for never, ``True`` for always, ``None`` for only if not US-ASCII or UTF-8 or Unicode (default is ``None``). *default_namespace* sets the default XML namespace (for "xmlns"). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). The keyword-only *short_empty_elements* parameter controls the formatting of elements that contain no content. If ``True`` (the default), they are emitted as a single self-closed tag, otherwise they are emitted as a pair of start/end tags.
sv: Skriver elementträdet till en fil, som XML. *file* är ett filnamn eller ett :term:`filobjekt` som öppnats för skrivning. *encoding* [1]_ är kodningen för utdata (standard är US-ASCII). *xml_declaration* kontrollerar om en XML-deklaration ska läggas till i filen. Använd ``False`` för aldrig, ``True`` för alltid, ``None`` för endast om inte US-ASCII eller UTF-8 eller Unicode (standard är ``None``). *default_namespace* anger standard XML-namnområde (för "xmlns"). *method* är antingen ``"xml"``, ``"html"`` eller ``"text"`` (standard är ``"xml"``). Parametern *short_empty_elements*, som endast innehåller nyckelord, styr formateringen av element som inte innehåller något innehåll. Om ``True`` (standard), skickas de ut som en enda självstängande tagg, annars skickas de ut som ett par start/slut-taggar.

source: The output is either a string (:class:`str`) or binary (:class:`bytes`). This is controlled by the *encoding* argument. If *encoding* is ``"unicode"``, the output is a string; otherwise, it's binary. Note that this may conflict with the type of *file* if it's an open :term:`file object`; make sure you do not try to write a string to a binary stream and vice versa.
sv: Utdata är antingen en sträng (:class:`str`) eller binär (:class:`bytes`). Detta styrs av argumentet *encoding*. Om *encoding* är ``"unicode"`` är utdata en sträng, annars är den binär. Observera att detta kan stå i konflikt med typen av *fil* om det är ett öppet :term:`filobjekt`; se till att du inte försöker skriva en sträng till en binär ström och vice versa.

source: The :meth:`write` method now preserves the attribute order specified by the user.
sv: Metoden :meth:`write` bevarar nu den attributordning som anges av användaren.

source: This is the XML file that is going to be manipulated::
sv: Detta är den XML-fil som ska manipuleras::

source: <html> <head> <title>Example page</title> </head> <body> <p>Moved to <a href="http://example.org/">example.org</a> or <a href="http://example.com/">example.com</a>.</p> </body> </html>
sv: <html> <head> <title>Exempel-sida</title> </head> <body> <p>Flyttad till <a href="http://example.org/">example.org</a> eller <a href="http://example.com/">exempel.com.</a></p> </body> </html>

source: Example of changing the attribute "target" of every link in first paragraph::
sv: Exempel på ändring av attributet "target" för varje länk i första stycket::
