Repository: yeager/python-docs-sv
Catalog: library/xml.po
Languages: sv

source: XML Processing Modules
sv: Moduler för XML-bearbetning

source: **Source code:** :source:`Lib/xml/`
sv: **Källkod:** :source:`Lib/xml/`

source: Python's interfaces for processing XML are grouped in the ``xml`` package.
sv: Pythons gränssnitt för bearbetning av XML är grupperade i paketet ``xml``.

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
sv: Om du behöver analysera otillförlitliga eller oautentiserade data, se :ref:`xml-security`.

source: It is important to note that modules in the :mod:`xml` package require that there be at least one SAX-compliant XML parser available. The Expat parser is included with Python, so the :mod:`xml.parsers.expat` module will always be available.
sv: Det är viktigt att notera att moduler i paketet :mod:`xml` kräver att det finns minst en SAX-kompatibel XML-parser tillgänglig. Expat-parsern ingår i Python, så modulen :mod:`xml.parsers.expat` kommer alltid att vara tillgänglig.

source: The documentation for the :mod:`xml.dom` and :mod:`xml.sax` packages are the definition of the Python bindings for the DOM and SAX interfaces.
sv: Dokumentationen för paketen :mod:`xml.dom` och :mod:`xml.sax` är definitionen av Python-bindningarna för DOM- och SAX-gränssnitten.

source: The XML handling submodules are:
sv: Undermodulerna för XML-hantering är:

source: :mod:`xml.etree.ElementTree`: the ElementTree API, a simple and lightweight XML processor
sv: :mod:`xml.etree.ElementTree`: ElementTree API, en enkel och lättviktig XML-processor

source: :mod:`xml.dom`: the DOM API definition
sv: :mod:`xml.dom`: DOM API-definitionen

source: :mod:`xml.dom.minidom`: a minimal DOM implementation
sv: :mod:`xml.dom.minidom`: en minimal DOM-implementering

source: :mod:`xml.dom.pulldom`: support for building partial DOM trees
sv: :mod:`xml.dom.pulldom`: stöd för att bygga partiella DOM-träd

source: :mod:`xml.sax`: SAX2 base classes and convenience functions
sv: :mod:`xml.sax`: SAX2-basklasser och bekvämlighetsfunktioner

source: :mod:`xml.parsers.expat`: the Expat parser binding
sv: :mod:`xml.parsers.expat`: bindningen för Expat-parsern

source: XML security
sv: XML-säkerhet

source: An attacker can abuse XML features to carry out denial of service attacks, access local files, generate network connections to other machines, or circumvent firewalls.
sv: En angripare kan utnyttja XML-funktioner för att utföra överbelastningsattacker, komma åt lokala filer, skapa nätverksanslutningar till andra maskiner eller kringgå brandväggar.

source: Expat versions lower that 2.6.0 may be vulnerable to "billion laughs", "quadratic blowup" and "large tokens". Python may be vulnerable if it uses such older versions of Expat as a system-provided library. Check :const:`!pyexpat.EXPAT_VERSION`.
sv: Expat-versioner lägre än 2.6.0 kan vara sårbara för "billion laughs", "quadratic blowup" och "large tokens". Python kan vara sårbart om det använder sådana äldre versioner av Expat som ett systemtillhandahållet bibliotek. Kontrollera :const:`!pyexpat.EXPAT_VERSION`.

source: :mod:`xmlrpc` is **vulnerable** to the "decompression bomb" attack.
sv: :mod:`xmlrpc` är **sårbar** för attacken "decompression bomb".

source: billion laughs / exponential entity expansion
sv: miljarder skratt / exponentiell enhetsexpansion

source: The `Billion Laughs`_ attack -- also known as exponential entity expansion -- uses multiple levels of nested entities. Each entity refers to another entity several times, and the final entity definition contains a small string. The exponential expansion results in several gigabytes of text and consumes lots of memory and CPU time.
sv: Attacken `Billion Laughs`_ - även känd som exponentiell entitetsexpansion - använder flera nivåer av nästlade entiteter. Varje entitet hänvisar till en annan entitet flera gånger, och den slutliga entitetsdefinitionen innehåller en liten sträng. Den exponentiella expansionen resulterar i flera gigabyte text och förbrukar mycket minne och CPU-tid.

source: quadratic blowup entity expansion
sv: kvadratisk uppblåsning enhetsexpansion

source: A quadratic blowup attack is similar to a `Billion Laughs`_ attack; it abuses entity expansion, too. Instead of nested entities it repeats one large entity with a couple of thousand chars over and over again. The attack isn't as efficient as the exponential case but it avoids triggering parser countermeasures that forbid deeply nested entities.
sv: En kvadratisk blowup-attack liknar en `Billion Laughs`_-attack; den missbrukar också entitetsexpansion. Istället för nästlade entiteter upprepas en stor entitet med ett par tusen tecken om och om igen. Attacken är inte lika effektiv som det exponentiella fallet men den undviker att utlösa parser-motåtgärder som förbjuder djupt nästlade enheter.

source: decompression bomb
sv: dekompressionsbomb

source: Decompression bombs (aka `ZIP bomb`_) apply to all XML libraries that can parse compressed XML streams such as gzipped HTTP streams or LZMA-compressed files. For an attacker it can reduce the amount of transmitted data by three magnitudes or more.
sv: Dekompressionsbomber (även kallade "ZIP-bomber") gäller alla XML-bibliotek som kan analysera komprimerade XML-strömmar, t.ex. gzippade HTTP-strömmar eller LZMA-komprimerade filer. För en angripare kan det minska mängden överförd data med tre magnituder eller mer.

source: large tokens
sv: stora tokens

source: Expat needs to re-parse unfinished tokens; without the protection introduced in Expat 2.6.0, this can lead to quadratic runtime that can be used to cause denial of service in the application parsing XML. The issue is known as :cve:`2023-52425`.
sv: Expat behöver omanalysera oavslutade tokens; utan det skydd som introducerades i Expat 2.6.0 kan detta leda till kvadratisk körtid som kan användas för att orsaka övergrepp i applikationen som analyserar XML. Problemet är känt som :cve:`2023-52425`.
