Repository: yeager/python-docs-sv
Catalog: library/xml.dom.pulldom.po
Languages: sv

source: :mod:`!xml.dom.pulldom` --- Support for building partial DOM trees
sv: :mod:`!xml.dom.pulldom` --- Stöd för att bygga partiella DOM-träd

source: **Source code:** :source:`Lib/xml/dom/pulldom.py`
sv: **Källkod:** :source:`Lib/xml/dom/pulldom.py`

source: The :mod:`xml.dom.pulldom` module provides a "pull parser" which can also be asked to produce DOM-accessible fragments of the document where necessary. The basic concept involves pulling "events" from a stream of incoming XML and processing them. In contrast to SAX which also employs an event-driven processing model together with callbacks, the user of a pull parser is responsible for explicitly pulling events from the stream, looping over those events until either processing is finished or an error condition occurs.
sv: Modulen :mod:`xml.dom.pulldom` tillhandahåller en "pull-parser" som också kan ombes att producera DOM-åtkomliga fragment av dokumentet vid behov. Grundkonceptet innebär att "händelser" hämtas från en ström av inkommande XML och bearbetas. Till skillnad från SAX, som också använder en händelsestyrd bearbetningsmodell tillsammans med callbacks, är användaren av en pull-parser ansvarig för att uttryckligen hämta händelser från strömmen och loopa över dessa händelser tills antingen bearbetningen är klar eller ett feltillstånd uppstår.

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
sv: Om du behöver analysera otillförlitliga eller oautentiserade data, se :ref:`xml-security`.

source: The SAX parser no longer processes general external entities by default to increase security by default. To enable processing of external entities, pass a custom parser instance in::
sv: SAX-parsern bearbetar inte längre allmänna externa enheter som standard för att öka säkerheten som standard. För att aktivera behandling av externa enheter, skicka en anpassad parser-instans i::

source: Example::
sv: Exempel::

source: from xml.dom import pulldom doc = pulldom.parse('sales_items.xml') for event, node in doc: if event == pulldom.START_ELEMENT and node.tagName == 'item': if int(node.getAttribute('price')) > 50: doc.expandNode(node) print(node.toxml())
sv: från xml.dom import pulldom doc = pulldom.parse('försäljning_items.xml') för event, nod i doc: if event == pulldom.START_ELEMENT och node.tagName == 'item': if int(node.getAttribute('price')) > 50: doc.expandNode(node) print(node.toxml())

source: ``event`` is a constant and can be one of:
sv: ``event`` är en konstant och kan vara en av:

source: :data:`COMMENT`
sv: :data:`KOMMENTAR`

source: :data:`START_DOCUMENT`
sv: :data:`START_DOKUMENT`

source: ``node`` is an object of type :class:`xml.dom.minidom.Document`, :class:`xml.dom.minidom.Element` or :class:`xml.dom.minidom.Text`.
sv: ``node`` är ett objekt av typen :class:`xml.dom.minidom.Document`, :class:`xml.dom.minidom.Element` eller :class:`xml.dom.minidom.Text`.

source: Since the document is treated as a "flat" stream of events, the document "tree" is implicitly traversed and the desired elements are found regardless of their depth in the tree. In other words, one does not need to consider hierarchical issues such as recursive searching of the document nodes, although if the context of elements were important, one would either need to maintain some context-related state (i.e. remembering where one is in the document at any given point) or to make use of the :func:`DOMEventStream.expandNode` method and switch to DOM-related processing.
sv: Eftersom dokumentet behandlas som en "platt" ström av händelser, genomkorsas dokumentets "träd" implicit och de önskade elementen hittas oavsett djup i trädet. Med andra ord behöver man inte ta hänsyn till hierarkiska frågor som rekursiv sökning i dokumentets noder, men om elementens sammanhang var viktigt skulle man antingen behöva upprätthålla ett sammanhangsrelaterat tillstånd (dvs. komma ihåg var man befinner sig i dokumentet vid en viss tidpunkt) eller använda :func:`DOMEventStream.expandNode`-metoden och övergå till DOM-relaterad bearbetning.

source: Subclass of :class:`xml.sax.handler.ContentHandler`.
sv: Underklass till :class:`xml.sax.handler.ContentHandler`.

source: Return a :class:`DOMEventStream` from the given input. *stream_or_string* may be either a file name, or a file-like object. *parser*, if given, must be an :class:`~xml.sax.xmlreader.XMLReader` object. This function will change the document handler of the parser and activate namespace support; other parser configuration (like setting an entity resolver) must have been done in advance.
sv: Returnerar en :class:`DOMEventStream` från den givna indata. *stream_or_string* kan vara antingen ett filnamn eller ett filliknande objekt. *parser*, om det anges, måste vara ett :class:`~xml.sax.xmlreader.XMLReader`-objekt. Denna funktion ändrar dokumenthanteraren för parsern och aktiverar stöd för namnrymder; annan parserkonfiguration (som att ställa in en entitetsresolver) måste ha gjorts i förväg.

source: If you have XML in a string, you can use the :func:`parseString` function instead:
sv: Om du har XML i en sträng kan du använda funktionen :func:`parseString` istället:

source: Return a :class:`DOMEventStream` that represents the (Unicode) *string*.
sv: Returnerar en :class:`DOMEventStream` som representerar (Unicode) *strängen*.

source: Default value for the *bufsize* parameter to :func:`parse`.
sv: Standardvärde för parametern *bufsize* i :func:`parse`.

source: The value of this variable can be changed before calling :func:`parse` and the new value will take effect.
sv: Värdet på denna variabel kan ändras innan :func:`parse` anropas och det nya värdet träder i kraft.

source: DOMEventStream Objects
sv: DOMEventStream-objekt

source: Support for :meth:`~object.__getitem__` method has been removed.
sv: Stöd för metoden :meth:`~object.__getitem__` har tagits bort.

source: Return a tuple containing *event* and the current *node* as :class:`xml.dom.minidom.Document` if event equals :data:`START_DOCUMENT`, :class:`xml.dom.minidom.Element` if event equals :data:`START_ELEMENT` or :data:`END_ELEMENT` or :class:`xml.dom.minidom.Text` if event equals :data:`CHARACTERS`. The current node does not contain information about its children, unless :func:`expandNode` is called.
sv: Returnerar en tupel innehållande *event* och den aktuella *noden* som :class:`xml.dom.minidom.Document` om event är lika med :data:`START_DOCUMENT`, :class:`xml.dom.minidom.Element` om event är lika med :data:`START_ELEMENT` eller :data:`END_ELEMENT` eller :class:`xml.dom.minidom.Text` om event är lika med :data:`CHARACTERS`. Den aktuella noden innehåller inte information om sina barn, såvida inte :func:`expandNode` anropas.

source: Expands all children of *node* into *node*. Example::
sv: Expanderar alla barn till *node* till *node*. Exempel::

source: from xml.dom import pulldom xml = '<html><title>Foo</title> <p>Some text <div>and more</div></p> </html>' doc = pulldom.parseString(xml) for event, node in doc: if event == pulldom.START_ELEMENT and node.tagName == 'p': # Following statement only prints '<p/>' print(node.toxml()) doc.expandNode(node) # Following statement prints node with all its children '<p>Some text <div>and more</div></p>' print(node.toxml())
sv: från xml.dom import pulldom xml = '<html><title>Foo</title> <p>Lite text och <div>mer</div></p> </html>' doc = pulldom.parseString(xml) för händelse, nod i doc: if event == pulldom.START_ELEMENT och node.tagName == 'p': # Följande sats skriver bara ut '<p/>' print(node.toxml()) doc.expandNode(nod) # Följande sats skriver ut noden med alla dess barn '<p>Lite text och <div>mer</div></p>' print(node.toxml())
