Repository: yeager/python-docs-sv
Catalog: library/xml.sax.utils.po
Languages: sv

source: :mod:`!xml.sax.saxutils` --- SAX Utilities
sv: :mod:`!xml.sax.saxutils` --- SAX-verktyg

source: **Source code:** :source:`Lib/xml/sax/saxutils.py`
sv: **Källkod:** :source:`Lib/xml/sax/saxutils.py`

source: The module :mod:`xml.sax.saxutils` contains a number of classes and functions that are commonly useful when creating SAX applications, either in direct use, or as base classes.
sv: Modulen :mod:`xml.sax.saxutils` innehåller ett antal klasser och funktioner som ofta är användbara när man skapar SAX-applikationer, antingen för direkt användning eller som basklasser.

source: Escape ``'&'``, ``'<'``, and ``'>'`` in a string of data.
sv: Escape ``'&'``, ``'<'`` och ``'>'`` i en datasträng.

source: You can escape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. The characters ``'&'``, ``'<'`` and ``'>'`` are always escaped, even if *entities* is provided.
sv: Du kan undkomma andra datasträngar genom att skicka en ordbok som den valfria parametern *entities*. Nycklarna och värdena måste alla vara strängar; varje nyckel kommer att ersättas med motsvarande värde. Tecknen ``'&'``, ``'<'`` och ``'>'`` escapas alltid, även om *entities* anges.

source: This function should only be used to escape characters that can't be used directly in XML. Do not use this function as a general string translation function.
sv: Denna funktion bör endast användas för att escapa tecken som inte kan användas direkt i XML. Använd inte den här funktionen som en allmän strängöversättningsfunktion.

source: Unescape ``'&amp;'``, ``'&lt;'``, and ``'&gt;'`` in a string of data.
sv: Avlägsna ``'&amp;'``, ``'&lt;'`` och ``'&gt;'`` i en datasträng.

source: You can unescape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. ``'&amp'``, ``'&lt;'``, and ``'&gt;'`` are always unescaped, even if *entities* is provided.
sv: Du kan unescape andra datasträngar genom att skicka en ordbok som den valfria parametern *entities*. Nycklarna och värdena måste alla vara strängar; varje nyckel kommer att ersättas med motsvarande värde. ``'&amp'``, ``'&lt;'`` och ``'&gt;'`` avkodas alltid, även om *entities* anges.

source: Similar to :func:`escape`, but also prepares *data* to be used as an attribute value. The return value is a quoted version of *data* with any additional required replacements. :func:`quoteattr` will select a quote character based on the content of *data*, attempting to avoid encoding any quote characters in the string. If both single- and double-quote characters are already in *data*, the double-quote characters will be encoded and *data* will be wrapped in double-quotes. The resulting string can be used directly as an attribute value::
sv: Liknar :func:`escape`, men förbereder också *data* för att användas som ett attributvärde. Returvärdet är en citerad version av *data* med eventuella ytterligare nödvändiga ersättningar. :func:`quoteattr` väljer ett citattecken baserat på innehållet i *data* och försöker undvika att koda alla citattecken i strängen. Om både enkla och dubbla citattecken redan finns i *data*, kodas de dubbla citattecknen och *data* omsluts av dubbla citattecken. Den resulterande strängen kan användas direkt som ett attributvärde::

source: >>> print("<element attr=%s>" % quoteattr("ab ' cd \" ef")) <element attr="ab ' cd &quot; ef">
sv: &gt;&gt;&gt; print("&lt;element attr=%s&gt;" % quoteattr("ab ' cd \" ef")) <element attr="ab ' cd &quot; ef">

source: This function is useful when generating attribute values for HTML or any SGML using the reference concrete syntax.
sv: Denna funktion är användbar när man genererar attributvärden för HTML eller SGML som använder syntaxen för referensbetong.

source: This class implements the :class:`~xml.sax.handler.ContentHandler` interface by writing SAX events back into an XML document. In other words, using an :class:`XMLGenerator` as the content handler will reproduce the original document being parsed. *out* should be a file-like object which will default to *sys.stdout*. *encoding* is the encoding of the output stream which defaults to ``'iso-8859-1'``. *short_empty_elements* controls the formatting of elements that contain no content: if ``False`` (the default) they are emitted as a pair of start/end tags, if set to ``True`` they are emitted as a single self-closed tag.
sv: Den här klassen implementerar gränssnittet :class:`~xml.sax.handler.ContentHandler` genom att skriva tillbaka SAX-händelser till ett XML-dokument. Med andra ord, om man använder en :class:`XMLGenerator` som innehållshanterare kommer originaldokumentet att återskapas när det analyseras. *out* bör vara ett filliknande objekt som standard kommer att vara *sys.stdout*. *encoding* är kodningen av utdataströmmen som standard är ``'iso-8859-1'``. *short_empty_elements* kontrollerar formateringen av element som inte innehåller något innehåll: om ``False`` (standard) sänds de ut som ett par start/slut-taggar, om de sätts till ``True`` sänds de ut som en enda självstängd tagg.

source: Added the *short_empty_elements* parameter.
sv: Parametern *short_empty_elements* har lagts till.

source: This class is designed to sit between an :class:`~xml.sax.xmlreader.XMLReader` and the client application's event handlers. By default, it does nothing but pass requests up to the reader and events on to the handlers unmodified, but subclasses can override specific methods to modify the event stream or the configuration requests as they pass through.
sv: Denna klass är utformad för att sitta mellan en :class:`~xml.sax.xmlreader.XMLReader` och klientapplikationens händelsehanterare. Som standard gör den inget annat än att skicka förfrågningar upp till läsaren och händelser vidare till hanterarna omodifierade, men underklasser kan åsidosätta specifika metoder för att modifiera händelseströmmen eller konfigurationsförfrågningarna när de passerar igenom.

source: This function takes an input source and an optional base URL and returns a fully resolved :class:`~xml.sax.xmlreader.InputSource` object ready for reading. The input source can be given as a string, a file-like object, or an :class:`~xml.sax.xmlreader.InputSource` object; parsers will use this function to implement the polymorphic *source* argument to their :meth:`~xml.sax.xmlreader.XMLReader.parse` method.
sv: Denna funktion tar en indatakälla och en valfri bas-URL och returnerar ett fullständigt upplöst :class:`~xml.sax.xmlreader.InputSource`-objekt som är klart för läsning. Indatakällan kan anges som en sträng, ett filliknande objekt eller ett :class:`~xml.sax.xmlreader.InputSource`-objekt; parsers kommer att använda denna funktion för att implementera det polymorfa *source*-argumentet till sin :meth:`~xml.sax.xmlreader.XMLReader.parse`-metod.
