Repository: yeager/python-docs-sv
Catalog: library/xml.etree.elementtree.po
Languages: sv

source: >>> from xml.etree.ElementTree import ElementTree >>> tree = ElementTree() >>> tree.parse("index.xhtml") <Element 'html' at 0xb77e6fac> >>> p = tree.find("body/p") # Finds first occurrence of tag p in body >>> p <Element 'p' at 0xb77ec26c> >>> links = list(p.iter("a")) # Returns list of all links >>> links [<Element 'a' at 0xb77ec2ac>, <Element 'a' at 0xb77ec1cc>] >>> for i in links: # Iterates through all found links ... i.attrib["target"] = "blank" ... >>> tree.write("output.xhtml")
sv: >>> from xml.etree.ElementTree import ElementTree >>> träd = ElementTree() >>> tree.parse("index.xhtml") <Element 'html' på 0xb77e6fac> >>> p = tree.find("body/p") # Hittar första förekomsten av taggen p i body >>> p <Element 'p' at 0xb77ec26c> >>> links = list(p.html) >>> länkar = list(p.iter("a")) # Returnerar lista över alla länkar >>> länkar [<Element 'a' vid 0xb77ec2ac>, <Element 'a' vid 0xb77ec1cc>] >>> för i i länkar: # Itererar genom alla hittade länkar ... i.attrib["target"] = "blank" ... >>> tree.write("output.xhtml")

source: QName Objects
sv: QName-objekt

source: QName wrapper. This can be used to wrap a QName attribute value, in order to get proper namespace handling on output. *text_or_uri* is a string containing the QName value, in the form {uri}local, or, if the tag argument is given, the URI part of a QName. If *tag* is given, the first argument is interpreted as a URI, and this argument is interpreted as a local name. :class:`QName` instances are opaque.
sv: QName-omslag. Detta kan användas för att omsluta ett QName-attributvärde för att få korrekt namnrymdshantering vid utdata. *text_or_uri* är en sträng som innehåller QName-värdet i formen {uri}local, eller, om argumentet tag anges, URI-delen av ett QName. Om *tag* anges tolkas det första argumentet som en URI, och detta argument tolkas som ett lokalt namn. :class:`QName`-instanser är opaka.

source: TreeBuilder Objects
sv: TreeBuilder-objekt

source: Generic element structure builder. This builder converts a sequence of start, data, end, comment and pi method calls to a well-formed element structure. You can use this class to build an element structure using a custom XML parser, or a parser for some other XML-like format.
sv: Generisk byggare av elementstruktur. Denna byggare konverterar en sekvens av start-, data-, slut-, kommentar- och pi-metodanrop till en välformad elementstruktur. Du kan använda den här klassen för att bygga en elementstruktur med hjälp av en anpassad XML-parser eller en parser för något annat XML-liknande format.

source: *element_factory*, when given, must be a callable accepting two positional arguments: a tag and a dict of attributes. It is expected to return a new element instance.
sv: *element_factory*, när den ges, måste vara en anropsbar som accepterar två positionella argument: en tagg och ett dict av attribut. Den förväntas returnera en ny elementinstans.

source: The *comment_factory* and *pi_factory* functions, when given, should behave like the :func:`Comment` and :func:`ProcessingInstruction` functions to create comments and processing instructions. When not given, the default factories will be used. When *insert_comments* and/or *insert_pis* is true, comments/pis will be inserted into the tree if they appear within the root element (but not outside of it).
sv: Funktionerna *comment_factory* och *pi_factory*, när de anges, bör bete sig som funktionerna :func:`Comment` och :func:`ProcessingInstruction` för att skapa kommentarer och bearbetningsinstruktioner. Om den inte anges kommer standardfabrikerna att användas. När *insert_comments* och/eller *insert_pis* är true kommer kommentarer/pis att infogas i trädet om de förekommer i rotelementet (men inte utanför det).

source: Flushes the builder buffers, and returns the toplevel document element. Returns an :class:`Element` instance.
sv: Tömmer byggarens buffertar och returnerar dokumentelementet på högsta nivån. Returnerar en instans av :class:`Element`.

source: Adds text to the current element. *data* is a string. This should be either a bytestring, or a Unicode string.
sv: Lägger till text i det aktuella elementet. *data* är en sträng. Detta bör vara antingen en bytestring eller en Unicode-sträng.

source: Closes the current element. *tag* is the element name. Returns the closed element.
sv: Stänger det aktuella elementet. *tag* är elementets namn. Returnerar det stängda elementet.

source: Opens a new element. *tag* is the element name. *attrs* is a dictionary containing element attributes. Returns the opened element.
sv: Öppnar ett nytt element. *tag* är elementets namn. *attrs* är en ordbok som innehåller elementattribut. Returnerar det öppnade elementet.

source: Creates a comment with the given *text*. If ``insert_comments`` is true, this will also add it to the tree.
sv: Skapar en kommentar med den angivna *texten*. Om ``insert_comments`` är true, kommer den också att läggas till i trädet.

source: Creates a process instruction with the given *target* name and *text*. If ``insert_pis`` is true, this will also add it to the tree.
sv: Skapar en processinstruktion med det angivna *målnamnet* och *texten*. Om ``insert_pis`` är true, kommer detta också att lägga till den i trädet.

source: In addition, a custom :class:`TreeBuilder` object can provide the following methods:
sv: Dessutom kan ett anpassat :class:`TreeBuilder`-objekt tillhandahålla följande metoder:

source: Handles a doctype declaration. *name* is the doctype name. *pubid* is the public identifier. *system* is the system identifier. This method does not exist on the default :class:`TreeBuilder` class.
sv: Hanterar en doctype-deklaration. *name* är doctypens namn. *pubid* är den offentliga identifieraren. *system* är systemidentifieraren. Den här metoden finns inte i standardklassen :class:`TreeBuilder`.

source: Is called whenever the parser encounters a new namespace declaration, before the ``start()`` callback for the opening element that defines it. *prefix* is ``''`` for the default namespace and the declared namespace prefix name otherwise. *uri* is the namespace URI.
sv: Anropas när parsern stöter på en ny namnrymdsdeklaration, före ``start()`` callback för det inledande element som definierar den. *prefix* är ``''`` för standardnamnrymden och det deklarerade namnrymdens prefixnamn i annat fall. *uri* är namnområdets URI.

source: Is called after the ``end()`` callback of an element that declared a namespace prefix mapping, with the name of the *prefix* that went out of scope.
sv: Anropas efter ``end()`` callback för ett element som deklarerade en mappning av namnrymdsprefix, med namnet på det *prefix* som gick utanför räckvidden.

source: A `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ writer. Arguments are the same as for the :func:`canonicalize` function. This class does not build a tree but translates the callback events directly into a serialised form using the *write* function.
sv: En `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ skribent. Argumenten är desamma som för funktionen :func:`canonicalize`. Den här klassen bygger inte ett träd utan översätter återuppringningshändelserna direkt till en serialiserad form med hjälp av funktionen *write*.

source: XMLParser Objects
sv: XMLParser-objekt

source: This class is the low-level building block of the module. It uses :mod:`xml.parsers.expat` for efficient, event-based parsing of XML. It can be fed XML data incrementally with the :meth:`feed` method, and parsing events are translated to a push API - by invoking callbacks on the *target* object. If *target* is omitted, the standard :class:`TreeBuilder` is used. If *encoding* [1]_ is given, the value overrides the encoding specified in the XML file.
sv: Den här klassen är modulens byggsten på låg nivå. Den använder :mod:`xml.parsers.expat` för effektiv, händelsebaserad parsning av XML. Den kan matas med XML-data stegvis med metoden :meth:`feed`, och parsinghändelser översätts till ett push-API - genom att anropa callbacks på objektet *target*. Om *target* utelämnas används standardklassen :class:`TreeBuilder`. Om *encoding* [1]_ anges, åsidosätter värdet den kodning som anges i XML-filen.

source: Parameters are now :ref:`keyword-only <keyword-only_parameter>`. The *html* argument is no longer supported.
sv: Parametrar är nu :ref:`keyword-only <keyword-only_parameter>`. Argumentet *html* stöds inte längre.

source: Finishes feeding data to the parser. Returns the result of calling the ``close()`` method of the *target* passed during construction; by default, this is the toplevel document element.
sv: Avslutar matningen av data till parsern. Returnerar resultatet av anropet av ``close()``-metoden för det *mål* som skickades under konstruktionen; som standard är detta dokumentelementet på toppnivå.

source: Feeds data to the parser. *data* is encoded data.
sv: Matar in data till parsern. *data* är kodade data.

source: Triggers parsing of any previously fed unparsed data, which can be used to ensure more immediate feedback, in particular with Expat >=2.6.0. The implementation of :meth:`flush` temporarily disables reparse deferral with Expat (if currently enabled) and triggers a reparse. Disabling reparse deferral has security consequences; please see :meth:`xml.parsers.expat.xmlparser.SetReparseDeferralEnabled` for details.
sv: Utlöser parsning av tidigare matade oanalyserade data, vilket kan användas för att säkerställa mer omedelbar återkoppling, i synnerhet med Expat >=2.6.0. Implementeringen av :meth:`flush` inaktiverar tillfälligt reparse deferral med Expat (om det för närvarande är aktiverat) och utlöser en reparse. Att inaktivera reparse deferral har säkerhetsmässiga konsekvenser; se :meth:`xml.parsers.expat.xmlparser.SetReparseDeferralEnabled` för detaljer.

source: Note that :meth:`flush` has been backported to some prior releases of CPython as a security fix. Check for availability of :meth:`flush` using :func:`hasattr` if used in code running across a variety of Python versions.
sv: Observera att :meth:`flush` har backporterats till vissa tidigare utgåvor av CPython som en säkerhetsfix. Kontrollera tillgängligheten av :meth:`flush` med :func:`hasattr` om den används i kod som körs i flera olika Python-versioner.

source: :meth:`XMLParser.feed` calls *target*\'s ``start(tag, attrs_dict)`` method for each opening tag, its ``end(tag)`` method for each closing tag, and data is processed by method ``data(data)``. For further supported callback methods, see the :class:`TreeBuilder` class. :meth:`XMLParser.close` calls *target*\'s method ``close()``. :class:`XMLParser` can be used not only for building a tree structure. This is an example of counting the maximum depth of an XML file::
sv: :meth:`XMLParser.feed` anropar *target*:s metod ``start(tag, attrs_dict)`` för varje inledande tagg, dess metod ``end(tag)`` för varje avslutande tagg, och data bearbetas med metoden ``data(data)``. För fler callback-metoder som stöds, se :class:`TreeBuilder`-klassen. :meth:`XMLParser.close` anropar *target*:s metod ``close()``. :class:`XMLParser` kan inte bara användas för att bygga en trädstruktur. Detta är ett exempel på hur man räknar det maximala djupet på en XML-fil::

source: XMLPullParser Objects
sv: XMLPullParser-objekt

source: A pull parser suitable for non-blocking applications. Its input-side API is similar to that of :class:`XMLParser`, but instead of pushing calls to a callback target, :class:`XMLPullParser` collects an internal list of parsing events and lets the user read from it. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported.
sv: En pull-parser som lämpar sig för icke-blockerande applikationer. Dess API på inmatningssidan liknar det för :class:`XMLParser`, men istället för att skicka anrop till ett återuppringningsmål samlar :class:`XMLPullParser` in en intern lista över parsinghändelser och låter användaren läsa från den. *events* är en sekvens av händelser som ska rapporteras tillbaka. De händelser som stöds är strängarna ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` och ``"end-ns"`` (händelserna "ns" används för att få detaljerad information om namnrymden). Om *events* utelämnas, rapporteras endast ``"end"``-händelser.

source: Feed the given bytes data to the parser.
sv: Mata in de givna bytesdata till parsern.

source: Signal the parser that the data stream is terminated. Unlike :meth:`XMLParser.close`, this method always returns :const:`None`. Any events not yet retrieved when the parser is closed can still be read with :meth:`read_events`.
sv: Signalerar till parsern att dataflödet är avslutat. Till skillnad från :meth:`XMLParser.close` returnerar denna metod alltid :const:`None`. Eventuella händelser som ännu inte hämtats när parsern stängs kan fortfarande läsas med :meth:`read_events`.

source: Return an iterator over the events which have been encountered in the data fed to the parser. The iterator yields ``(event, elem)`` pairs, where *event* is a string representing the type of event (e.g. ``"end"``) and *elem* is the encountered :class:`Element` object, or other context value as follows.
sv: Returnerar en iterator över de händelser som har påträffats i de data som matats in i parsern. Iteratorn ger paren ``(event, elem)``, där *event* är en sträng som representerar händelsens typ (t.ex. ``"end"``) och *elem* är det påträffade :class:`Element`-objektet, eller annat kontextvärde enligt följande.

source: ``start``, ``end``: the current Element.
sv: ``start``, ``slut``: det aktuella elementet.

source: ``comment``, ``pi``: the current comment / processing instruction
sv: ``comment``, ``pi``: den aktuella kommentaren / bearbetningsinstruktionen

source: ``start-ns``: a tuple ``(prefix, uri)`` naming the declared namespace mapping.
sv: ``start-ns``: en tupel ``(prefix, uri)`` som namnger den deklarerade namnrymdsmappningen.

source: ``end-ns``: :const:`None` (this may change in a future version)
sv: ``end-ns``: :const:`None` (detta kan ändras i en framtida version)

source: Events provided in a previous call to :meth:`read_events` will not be yielded again. Events are consumed from the internal queue only when they are retrieved from the iterator, so multiple readers iterating in parallel over iterators obtained from :meth:`read_events` will have unpredictable results.
sv: Händelser som tillhandahållits i ett tidigare anrop till :meth:`read_events` kommer inte att återskapas. Händelser konsumeras från den interna kön endast när de hämtas från iteratorn, så flera läsare som parallellt itererar över iteratorer som erhållits från :meth:`read_events` kommer att få oförutsägbara resultat.

source: :class:`XMLPullParser` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
sv: :class:`XMLPullParser` garanterar bara att den har sett tecknet ">" i en starttagg när den sänder ut en "start"-händelse, så attributen är definierade, men innehållet i text- och tail-attributen är odefinierat vid den tidpunkten. Detsamma gäller för elementets barn; de kan vara närvarande eller inte.

source: Exceptions
sv: Undantag

source: XML parse error, raised by the various parsing methods in this module when parsing fails. The string representation of an instance of this exception will contain a user-friendly error message. In addition, it will have the following attributes available:
sv: XML-parsefel, som uppstår när de olika parsningsmetoderna i denna modul misslyckas med parsningen. Strängrepresentationen av en instans av detta undantag kommer att innehålla ett användarvänligt felmeddelande. Dessutom kommer den att ha följande attribut tillgängliga:

source: A numeric error code from the expat parser. See the documentation of :mod:`xml.parsers.expat` for the list of error codes and their meanings.
sv: En numerisk felkod från expat-parsern. Se dokumentationen för :mod:`xml.parsers.expat` för en lista över felkoder och deras innebörd.

source: A tuple of *line*, *column* numbers, specifying where the error occurred.
sv: En tupel av *rad*, *kolumn*-nummer, som anger var felet inträffade.

source: Footnotes
sv: Fotnoter

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
sv: Kodningssträngen som ingår i XML-utdata bör överensstämma med lämpliga standarder. Till exempel är "UTF-8" giltig, men "UTF8" är det inte. Se https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl och https://www.iana.org/assignments/character-sets/character-sets.xhtml.
