Repository: yeager/python-docs-sv
Catalog: library/xml.sax.po
Languages: sv

source: :mod:`!xml.sax` --- Support for SAX2 parsers
sv: :mod:`!xml.sax` --- Stöd för SAX2-parser

source: **Source code:** :source:`Lib/xml/sax/__init__.py`
sv: **Källkod:** :source:`Lib/xml/sax/__init__.py`

source: The :mod:`xml.sax` package provides a number of modules which implement the Simple API for XML (SAX) interface for Python. The package itself provides the SAX exceptions and the convenience functions which will be most used by users of the SAX API.
sv: Paketet :mod:`xml.sax` innehåller ett antal moduler som implementerar Simple API for XML (SAX)-gränssnittet för Python. Paketet i sig innehåller SAX-undantagen och de bekvämlighetsfunktioner som kommer att användas mest av användare av SAX API.

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
sv: Om du behöver analysera otillförlitliga eller oautentiserade data, se :ref:`xml-security`.

source: The SAX parser no longer processes general external entities by default to increase security. Before, the parser created network connections to fetch remote files or loaded local files from the file system for DTD and entities. The feature can be enabled again with method :meth:`~xml.sax.xmlreader.XMLReader.setFeature` on the parser object and argument :data:`~xml.sax.handler.feature_external_ges`.
sv: SAX-parsern bearbetar inte längre allmänna externa entiteter som standard för att öka säkerheten. Tidigare skapade parsern nätverksanslutningar för att hämta fjärrfiler eller läste in lokala filer från filsystemet för DTD och entiteter. Funktionen kan aktiveras igen med metod :meth:`~xml.sax.xmlreader.XMLReader.setFeature` på parserobjektet och argument :data:`~xml.sax.handler.feature_external_ges`.

source: The convenience functions are:
sv: De praktiska funktionerna är:

source: Create and return a SAX :class:`~xml.sax.xmlreader.XMLReader` object. The first parser found will be used. If *parser_list* is provided, it must be an iterable of strings which name modules that have a function named :func:`create_parser`. Modules listed in *parser_list* will be used before modules in the default list of parsers.
sv: Skapar och returnerar ett SAX :class:`~xml.sax.xmlreader.XMLReader`-objekt. Den första parsern som hittas kommer att användas. Om *parser_list* anges måste det vara en iterabel av strängar som namnger moduler som har en funktion med namnet :func:`create_parser`. Moduler som listas i *parser_list* kommer att användas före moduler i standardlistan över parsers.

source: The *parser_list* argument can be any iterable, not just a list.
sv: Argumentet *parser_list* kan vara vilken iterabel som helst, inte bara en lista.

source: Create a SAX parser and use it to parse a document. The document, passed in as *filename_or_stream*, can be a filename or a file object. The *handler* parameter needs to be a SAX :class:`~handler.ContentHandler` instance. If *error_handler* is given, it must be a SAX :class:`~handler.ErrorHandler` instance; if omitted, :exc:`SAXParseException` will be raised on all errors. There is no return value; all work must be done by the *handler* passed in.
sv: Skapa en SAX-parser och använd den för att analysera ett dokument. Dokumentet, som skickas in som *filnamn_eller_ström*, kan vara ett filnamn eller ett filobjekt. Parametern *handler* måste vara en SAX-instans av :class:`~handler.ContentHandler`. Om *error_handler* anges måste den vara en SAX :class:`~handler.ErrorHandler`-instans; om den utelämnas kommer :exc:`SAXParseException` att aktiveras vid alla fel. Det finns inget returvärde; allt arbete måste utföras av den *handler* som skickas in.

source: Similar to :func:`parse`, but parses from a buffer *string* received as a parameter. *string* must be a :class:`str` instance or a :term:`bytes-like object`.
sv: Liknar :func:`parse`, men analyserar från en buffert *string* som tas emot som en parameter. *string* måste vara en :class:`str`-instans eller en :term:`bytes-liknande objekt`.

source: Added support of :class:`str` instances.
sv: Lagt till stöd för :class:`str`-instanser.

source: A typical SAX application uses three kinds of objects: readers, handlers and input sources. "Reader" in this context is another term for parser, i.e. some piece of code that reads the bytes or characters from the input source, and produces a sequence of events. The events then get distributed to the handler objects, i.e. the reader invokes a method on the handler. A SAX application must therefore obtain a reader object, create or open the input sources, create the handlers, and connect these objects all together. As the final step of preparation, the reader is called to parse the input. During parsing, methods on the handler objects are called based on structural and syntactic events from the input data.
sv: En typisk SAX-applikation använder tre typer av objekt: läsare, hanterare och indatakällor. "Reader" är i det här sammanhanget en annan term för parser, dvs. en kod som läser bytes eller tecken från inmatningskällan och producerar en sekvens av händelser. Händelserna distribueras sedan till hanterarobjekten, dvs. läsaren anropar en metod i hanteraren. En SAX-applikation måste därför skaffa ett läsarobjekt, skapa eller öppna inmatningskällorna, skapa hanterarna och koppla ihop alla dessa objekt. Som sista steg i förberedelserna anropas läsaren för att parsa indata. Under parsningen anropas metoder i hanterarobjekten baserat på strukturella och syntaktiska händelser från indata.

source: For these objects, only the interfaces are relevant; they are normally not instantiated by the application itself. Since Python does not have an explicit notion of interface, they are formally introduced as classes, but applications may use implementations which do not inherit from the provided classes. The :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml.sax.xmlreader.AttributesNS`, and :class:`~xml.sax.xmlreader.XMLReader` interfaces are defined in the module :mod:`xml.sax.xmlreader`. The handler interfaces are defined in :mod:`xml.sax.handler`. For convenience, :class:`~xml.sax.xmlreader.InputSource` (which is often instantiated directly) and the handler classes are also available from :mod:`xml.sax`. These interfaces are described below.
sv: För dessa objekt är det bara gränssnitten som är relevanta; de instansieras normalt inte av själva applikationen. Eftersom Python inte har ett explicit begrepp för gränssnitt introduceras de formellt som klasser, men applikationer kan använda implementationer som inte ärver från de tillhandahållna klasserna. Gränssnitten :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml.sax.xmlreader.AttributesNS` och :class:`~xml.sax.xmlreader.XMLReader` definieras i modulen :mod:`xml.sax.xmlreader`. Hanterargränssnitten definieras i :mod:`xml.sax.handler`. För enkelhetens skull är :class:`~xml.sax.xmlreader.InputSource` (som ofta instansieras direkt) och klasserna för hantering också tillgängliga från :mod:`xml.sax`. Dessa gränssnitt beskrivs nedan.

source: In addition to these classes, :mod:`xml.sax` provides the following exception classes.
sv: Utöver dessa klasser tillhandahåller :mod:`xml.sax` följande undantagsklasser.

source: Encapsulate an XML error or warning. This class can contain basic error or warning information from either the XML parser or the application: it can be subclassed to provide additional functionality or to add localization. Note that although the handlers defined in the :class:`~xml.sax.handler.ErrorHandler` interface receive instances of this exception, it is not required to actually raise the exception --- it is also useful as a container for information.
sv: Kapslar in ett XML-fel eller en XML-varning. Den här klassen kan innehålla grundläggande fel- eller varningsinformation från antingen XML-parsern eller programmet: den kan underklassas för att ge ytterligare funktionalitet eller för att lägga till lokalisering. Observera att även om de hanterare som definieras i :class:`~xml.sax.handler.ErrorHandler`-gränssnittet tar emot instanser av detta undantag, är det inte nödvändigt att faktiskt lyfta undantaget --- det är också användbart som en behållare för information.

source: When instantiated, *msg* should be a human-readable description of the error. The optional *exception* parameter, if given, should be ``None`` or an exception that was caught by the parsing code and is being passed along as information.
sv: När *msg* instansieras bör det vara en mänskligt läsbar beskrivning av felet. Den valfria parametern *exception*, om den anges, ska vara ``None`` eller ett undantag som fångades upp av parsningskoden och som skickas vidare som information.

source: This is the base class for the other SAX exception classes.
sv: Detta är basklassen för de andra SAX-undantagsklasserna.

source: Subclass of :exc:`SAXException` raised on parse errors. Instances of this class are passed to the methods of the SAX :class:`~xml.sax.handler.ErrorHandler` interface to provide information about the parse error. This class supports the SAX :class:`~xml.sax.xmlreader.Locator` interface as well as the :class:`SAXException` interface.
sv: Underklass till :exc:`SAXException` som uppstår vid parse-fel. Instanser av den här klassen skickas till metoderna i SAX :class:`~xml.sax.handler.ErrorHandler`-gränssnittet för att ge information om parse-felet. Denna klass stöder SAX :class:`~xml.sax.xmlreader.Locator`-gränssnittet samt :class:`SAXException`-gränssnittet.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is confronted with an unrecognized feature or property. SAX applications and extensions may use this class for similar purposes.
sv: Subklass av :exc:`SAXException` som uppstår när en SAX :class:`~xml.sax.xmlreader.XMLReader` konfronteras med en funktion eller egenskap som inte känns igen. SAX-applikationer och tillägg kan använda denna klass för liknande ändamål.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is asked to enable a feature that is not supported, or to set a property to a value that the implementation does not support. SAX applications and extensions may use this class for similar purposes.
sv: Subklass av :exc:`SAXException` som uppstår när en SAX :class:`~xml.sax.xmlreader.XMLReader` ombeds aktivera en funktion som inte stöds, eller att sätta en egenskap till ett värde som implementationen inte stöder. SAX-applikationer och tillägg kan använda denna klass för liknande ändamål.

source: `SAX: The Simple API for XML <http://www.saxproject.org/>`_
sv: `SAX: Det enkla API:et för XML <http://www.saxproject.org/>`_

source: This site is the focal point for the definition of the SAX API. It provides a Java implementation and online documentation. Links to implementations and historical information are also available.
sv: Den här webbplatsen är en samlingsplats för definitionen av SAX API. Här finns en Java-implementation och dokumentation online. Länkar till implementationer och historisk information finns också tillgängliga.

source: Module :mod:`xml.sax.handler`
sv: Modul :mod:`xml.sax.handler`

source: Definitions of the interfaces for application-provided objects.
sv: Definitioner av gränssnitt för objekt som tillhandahålls av applikationen.

source: Module :mod:`xml.sax.saxutils`
sv: Modul :mod:`xml.sax.saxutils`

source: Convenience functions for use in SAX applications.
sv: Praktiska funktioner för användning i SAX-applikationer.

source: Module :mod:`xml.sax.xmlreader`
sv: Modul :mod:`xml.sax.xmlreader`

source: Definitions of the interfaces for parser-provided objects.
sv: Definitioner av gränssnitten för objekt som tillhandahålls av parsern.

source: SAXException Objects
sv: SAXException-objekt

source: The :class:`SAXException` exception class supports the following methods:
sv: Undantagsklassen :class:`SAXException` har stöd för följande metoder:

source: Return a human-readable message describing the error condition.
sv: Returnerar ett mänskligt läsbart meddelande som beskriver feltillståndet.

source: Return an encapsulated exception object, or ``None``.
sv: Returnerar ett inkapslat undantagsobjekt, eller ``None``.
