Repository: yeager/python-docs-sv
Catalog: library/xml.etree.elementtree.po
Languages: sv

source: Selects all elements whose complete text content, including descendants, equals the given ``text``.
sv: Väljer alla element vars fullständiga textinnehåll, inklusive ättlingar, är lika med den angivna ``texten``.

source: Selects all elements whose complete text content, including descendants, does not equal the given ``text``.
sv: Väljer alla element vars fullständiga textinnehåll, inklusive ättlingar, inte är lika med den angivna ``texten``.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, equals the given ``text``.
sv: Väljer alla element som har ett barn med namnet ``tag`` vars fullständiga textinnehåll, inklusive ättlingar, är lika med den angivna ``texten``.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, does not equal the given ``text``.
sv: Väljer alla element som har ett barn med namnet ``tag`` vars fullständiga textinnehåll, inklusive ättlingar, inte motsvarar den angivna ``texten``.

source: Selects all elements that are located at the given position. The position can be either an integer (1 is the first position), the expression ``last()`` (for the last position), or a position relative to the last position (e.g. ``last()-1``).
sv: Väljer alla element som befinner sig på den angivna positionen. Positionen kan vara antingen ett heltal (1 är den första positionen), uttrycket ``last()`` (för den sista positionen) eller en position relativt den sista positionen (t.ex. ``last()-1``).

source: Predicates (expressions within square brackets) must be preceded by a tag name, an asterisk, or another predicate. ``position`` predicates must be preceded by a tag name.
sv: Predikat (uttryck inom hakparentes) måste föregås av ett taggnamn, en asterisk eller ett annat predikat. ``position``-predikaten måste föregås av ett taggnamn.

source: Reference
sv: Referens

source: Functions
sv: Funktioner

source: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ transformation function.
sv: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ transformationsfunktion.

source: Canonicalization is a way to normalise XML output in a way that allows byte-by-byte comparisons and digital signatures. It reduces the freedom that XML serializers have and instead generates a more constrained XML representation. The main restrictions regard the placement of namespace declarations, the ordering of attributes, and ignorable whitespace.
sv: Kanonisering är ett sätt att normalisera XML-utdata på ett sätt som möjliggör byte-för-byte-jämförelser och digitala signaturer. Det minskar den frihet som XML-serialisatorer har och genererar i stället en mer begränsad XML-representation. De viktigaste begränsningarna gäller placeringen av namnrymdsdeklarationer, ordningsföljden för attribut och obetydliga blanksteg.

source: This function takes an XML data string (*xml_data*) or a file path or file-like object (*from_file*) as input, converts it to the canonical form, and writes it out using the *out* file(-like) object, if provided, or returns it as a text string if not. The output file receives text, not bytes. It should therefore be opened in text mode with ``utf-8`` encoding.
sv: Denna funktion tar en XML-datasträng (*xml_data*) eller en filsökväg eller ett filliknande objekt (*from_file*) som indata, konverterar den till den kanoniska formen och skriver ut den med hjälp av *out* fil(-liknande) objekt, om det tillhandahålls, eller returnerar den som en textsträng om så inte är fallet. Utdatafilen tar emot text, inte bytes. Den bör därför öppnas i textläge med kodningen ``utf-8``.

source: Typical uses::
sv: Typiska användningsområden::

source: xml_data = "<root>...</root>" print(canonicalize(xml_data)) with open("c14n_output.xml", mode='w', encoding='utf-8') as out_file: canonicalize(xml_data, out=out_file) with open("c14n_output.xml", mode='w', encoding='utf-8') as out_file: canonicalize(from_file="inputfile.xml", out=out_file)
sv: xml_data = ".<root>.</root>." print(canonicalize(xml_data)) med open("c14n_output.xml", mode='w', encoding='utf-8') som out_file: canonicalize(xml_data, out=out_file) med open("c14n_output.xml", mode='w', encoding='utf-8') som out_file: canonicalize(from_file="inputfile.xml", out=out_file)

source: The configuration *options* are as follows:
sv: Konfigurationsalternativen* är följande:

source: *with_comments*: set to true to include comments (default: false)
sv: *with_comments*: inställd på true för att inkludera kommentarer (standard: false)

source: *strip_text*: set to true to strip whitespace before and after text content
sv: *strip_text*: satt till true för att ta bort blanksteg före och efter textinnehåll

source: (default: false)
sv: (standard: false)

source: *rewrite_prefixes*: set to true to replace namespace prefixes by "n{number}"
sv: *rewrite_prefixes*: satt till true för att ersätta namnrymdsprefix med "n{number}"

source: *qname_aware_tags*: a set of qname aware tag names in which prefixes
sv: *qname_aware_tags*: en uppsättning taggnamn som är medvetna om qname och där prefix

source: should be replaced in text content (default: empty)
sv: ska ersättas i textinnehåll (standard: tom)

source: *qname_aware_attrs*: a set of qname aware attribute names in which prefixes
sv: *qname_aware_attrs*: en uppsättning qname aware-attributnamn där prefix

source: *exclude_attrs*: a set of attribute names that should not be serialised
sv: *exclude_attrs*: en uppsättning attributnamn som inte ska serialiseras

source: *exclude_tags*: a set of tag names that should not be serialised
sv: *exclude_tags*: en uppsättning taggnamn som inte ska serialiseras

source: In the option list above, "a set" refers to any collection or iterable of strings, no ordering is expected.
sv: I alternativlistan ovan hänvisar "en uppsättning" till en samling eller iterabel av strängar, ingen ordning förväntas.

source: Comment element factory. This factory function creates a special element that will be serialized as an XML comment by the standard serializer. The comment string can be either a bytestring or a Unicode string. *text* is a string containing the comment string. Returns an element instance representing a comment.
sv: Fabrik för kommentarselement. Denna fabriksfunktion skapar ett speciellt element som kommer att serialiseras som en XML-kommentar av standardserialisatorn. Kommentarssträngen kan vara antingen en bytestring eller en Unicode-sträng. *text* är en sträng som innehåller kommentarssträngen. Returnerar en elementinstans som representerar en kommentar.

source: Note that :class:`XMLParser` skips over comments in the input instead of creating comment objects for them. An :class:`ElementTree` will only contain comment nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
sv: Observera att :class:`XMLParser` hoppar över kommentarer i indata istället för att skapa kommentarsobjekt för dem. Ett :class:`ElementTree` kommer endast att innehålla kommentarsnoder om de har infogats i trädet med hjälp av någon av :class:`Element` metoderna.

source: Writes an element tree or element structure to sys.stdout. This function should be used for debugging only.
sv: Skriver ett elementträd eller en elementstruktur till sys.stdout. Denna funktion bör endast användas för felsökning.

source: The exact output format is implementation dependent. In this version, it's written as an ordinary XML file.
sv: Det exakta utdataformatet är beroende av implementeringen. I den här versionen skrivs den som en vanlig XML-fil.

source: *elem* is an element tree or an individual element.
sv: *elem* är ett elementträd eller ett enskilt element.

source: The :func:`dump` function now preserves the attribute order specified by the user.
sv: Funktionen :func:`dump` bevarar nu den attributordning som anges av användaren.

source: Parses an XML section from a string constant. Same as :func:`XML`. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
sv: Parsar ett XML-avsnitt från en strängkonstant. Samma som :func:`XML`. *text* är en sträng som innehåller XML-data. *parser* är en valfri parser-instans. Om den inte anges används standardparsern :class:`XMLParser`. Returnerar en :class:`Element`-instans.

source: Parses an XML document from a sequence of string fragments. *sequence* is a list or other sequence containing XML data fragments. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
sv: Parsar ett XML-dokument från en sekvens av strängfragment. *sequence* är en lista eller annan sekvens som innehåller XML-datafragment. *parser* är en valfri parser-instans. Om den inte anges används standardparsern :class:`XMLParser`. Returnerar en :class:`Element`-instans.

source: Appends whitespace to the subtree to indent the tree visually. This can be used to generate pretty-printed XML output. *tree* can be an Element or ElementTree. *space* is the whitespace string that will be inserted for each indentation level, two space characters by default. For indenting partial subtrees inside of an already indented tree, pass the initial indentation level as *level*.
sv: Lägger till blanksteg i underträdet för att trädet ska bli visuellt indraget. Detta kan användas för att generera vackert tryckt XML-utdata. *tree* kan vara ett Element eller ElementTree. *space* är den blankstegsträng som ska infogas för varje indragningsnivå, två blankstegstecken som standard. För indragning av partiella subträd inuti ett redan indraget träd, skicka den initiala indragningsnivån som *level*.

source: Check if an object appears to be a valid element object. *element* is an element instance. Return ``True`` if this is an element object.
sv: Kontrollera om ett objekt ser ut att vara ett giltigt elementobjekt. *element* är en elementinstans. Returnerar ``True`` om detta är ett element-objekt.

source: Parses an XML section into an element tree incrementally, and reports what's going on to the user. *source* is a filename or :term:`file object` containing XML data. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. *parser* must be a subclass of :class:`XMLParser` and can only use the default :class:`TreeBuilder` as a target. Returns an :term:`iterator` providing ``(event, elem)`` pairs; it has a ``root`` attribute that references the root element of the resulting XML tree once *source* is fully read. The iterator has the :meth:`!close` method that closes the internal file object if *source* is a filename.
sv: Parsar ett XML-avsnitt till ett elementträd stegvis och rapporterar vad som händer till användaren. *source* är ett filnamn eller :term:`filobjekt` som innehåller XML-data. *events* är en sekvens av händelser som ska rapporteras tillbaka. De händelser som stöds är strängarna ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` och ``"end-ns"`` (händelserna "ns" används för att få detaljerad information om namnrymden). Om *events* utelämnas rapporteras endast ``"end"``-händelser. *parser* är en valfri parser-instans. Om den inte anges används standardparsern :class:`XMLParser`. *parser* måste vara en subklass av :class:`XMLParser` och kan bara använda standard :class:`TreeBuilder` som mål. Returnerar en :term:`iterator` som tillhandahåller ``(event, elem)``-par; den har ett ``root``-attribut som refererar till rotelementet i det resulterande XML-trädet när *källan* är helt läst. Iteratorn har metoden :meth:`!close` som stänger det interna filobjektet om *källan* är ett filnamn.

source: Note that while :func:`iterparse` builds the tree incrementally, it issues blocking reads on *source* (or the file it names). As such, it's unsuitable for applications where blocking reads can't be made. For fully non-blocking parsing, see :class:`XMLPullParser`.
sv: Observera att medan :func:`iterparse` bygger trädet stegvis, gör den blockerande läsningar på *källan* (eller filen som den namnger). Därför är den olämplig för applikationer där blockerande läsningar inte kan göras. För helt icke-blockerande parsing, se :class:`XMLPullParser`.

source: :func:`iterparse` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
sv: :func:`iterparse` garanterar bara att den har sett tecknet ">" i en starttagg när den avger en "start"-händelse, så attributen är definierade, men innehållet i text- och tail-attributen är odefinierat vid den tidpunkten. Detsamma gäller för elementets barn; de kan vara närvarande eller inte.

source: If you need a fully populated element, look for "end" events instead.
sv: Om du behöver ett helt fyllt element ska du leta efter "end"-händelser i stället.

source: The *parser* argument.
sv: Argumentet *parser*.

source: The ``comment`` and ``pi`` events were added.
sv: Händelserna ``comment`` och ``pi`` har lagts till.

source: Added the :meth:`!close` method.
sv: Lagt till metoden :meth:`!close`.

source: Parses an XML section into an element tree. *source* is a filename or file object containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`ElementTree` instance.
sv: Parsar ett XML-avsnitt till ett elementträd. *source* är ett filnamn eller ett filobjekt som innehåller XML-data. *parser* är en valfri parser-instans. Om den inte anges används standardparsern :class:`XMLParser`. Returnerar en :class:`ElementTree`-instans.

source: PI element factory. This factory function creates a special element that will be serialized as an XML processing instruction. *target* is a string containing the PI target. *text* is a string containing the PI contents, if given. Returns an element instance, representing a processing instruction.
sv: Fabrik för PI-element. Denna fabriksfunktion skapar ett speciellt element som kommer att serialiseras som en XML-bearbetningsinstruktion. *target* är en sträng som innehåller PI-målet. *text* är en sträng som innehåller PI-innehållet, om det anges. Returnerar en elementinstans som representerar en bearbetningsinstruktion.

source: Note that :class:`XMLParser` skips over processing instructions in the input instead of creating PI objects for them. An :class:`ElementTree` will only contain processing instruction nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
sv: Observera att :class:`XMLParser` hoppar över bearbetningsinstruktioner i indata istället för att skapa PI-objekt för dem. Ett :class:`ElementTree` kommer endast att innehålla noder med bearbetningsinstruktioner om de har infogats i trädet med hjälp av en av :class:`Element` metoderna.

source: Registers a namespace prefix. The registry is global, and any existing mapping for either the given prefix or the namespace URI will be removed. *prefix* is a namespace prefix. *uri* is a namespace uri. Tags and attributes in this namespace will be serialized with the given prefix, if at all possible.
sv: Registrerar ett namnrymdsprefix. Registret är globalt och alla befintliga mappningar för antingen det angivna prefixet eller namnrymds-URI:n kommer att tas bort. *prefix* är ett namnrymdsprefix. *uri* är en namnrymds-uri. Taggar och attribut i denna namnrymd kommer att serialiseras med det angivna prefixet, om det är möjligt.

source: Subelement factory. This function creates an element instance, and appends it to an existing element.
sv: Fabrik för underelement. Denna funktion skapar en elementinstans och lägger till den till ett befintligt element.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *parent* is the parent element. *tag* is the subelement name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments. Returns an element instance.
sv: Elementnamn, attributnamn och attributvärden kan vara antingen bytesträngar eller Unicode-strängar. *parent* är det överordnade elementet. *tag* är namnet på underelementet. *attrib* är en valfri ordbok som innehåller elementattribut. *extra* innehåller ytterligare attribut, som anges som nyckelordsargument. Returnerar en elementinstans.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns an (optionally) encoded string containing the XML data.
sv: Skapar en strängrepresentation av ett XML-element, inklusive alla underelement. *element* är en instans av :class:`Element`. *encoding* [1]_ är kodningen för utdata (standard är US-ASCII). Använd ``encoding="unicode"`` för att generera en Unicode-sträng (annars genereras en bytestring). *method* är antingen ``"xml"``, ``"html"`` eller ``"text"`` (standard är ``"xml"``). *xml_declaration*, *default_namespace* och *short_empty_elements* har samma betydelse som i :meth:`ElementTree.write`. Returnerar en (valfritt) kodad sträng som innehåller XML-data.

source: Added the *short_empty_elements* parameter.
sv: Parametern *short_empty_elements* har lagts till.

source: Added the *xml_declaration* and *default_namespace* parameters.
sv: Parametrarna *xml_declaration* och *default_namespace* har lagts till.

source: The :func:`tostring` function now preserves the attribute order specified by the user.
sv: Funktionen :func:`tostring` bevarar nu den attributordning som anges av användaren.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns a list of (optionally) encoded strings containing the XML data. It does not guarantee any specific sequence, except that ``b"".join(tostringlist(element)) == tostring(element)``.
sv: Skapar en strängrepresentation av ett XML-element, inklusive alla underelement. *element* är en instans av :class:`Element`. *encoding* [1]_ är kodningen för utdata (standard är US-ASCII). Använd ``encoding="unicode"`` för att generera en Unicode-sträng (annars genereras en bytestring). *method* är antingen ``"xml"``, ``"html"`` eller ``"text"`` (standard är ``"xml"``). *xml_declaration*, *default_namespace* och *short_empty_elements* har samma betydelse som i :meth:`ElementTree.write`. Returnerar en lista med (valfritt) kodade strängar som innehåller XML-data. Den garanterar inte någon specifik sekvens, förutom att ``b"".join(tostringlist(element)) == tostring(element)``.

source: The :func:`tostringlist` function now preserves the attribute order specified by the user.
sv: Funktionen :func:`tostringlist` bevarar nu den attributordning som anges av användaren.

source: Parses an XML section from a string constant. This function can be used to embed "XML literals" in Python code. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
sv: Parsar ett XML-avsnitt från en strängkonstant. Denna funktion kan användas för att bädda in "XML-literaler" i Python-kod. *text* är en sträng som innehåller XML-data. *parser* är en valfri parser-instans. Om den inte anges används standardparsern :class:`XMLParser`. Returnerar en :class:`Element`-instans.

source: Parses an XML section from a string constant, and also returns a dictionary which maps from element id:s to elements. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns a tuple containing an :class:`Element` instance and a dictionary.
sv: Parsar ett XML-avsnitt från en strängkonstant och returnerar också en ordbok som mappar från element-id:n till element. *text* är en sträng som innehåller XML-data. *parser* är en valfri parser-instans. Om den inte anges används standardparsern :class:`XMLParser`. Returnerar en tupel som innehåller en :class:`Element`-instans och en ordbok.

source: XInclude support
sv: XInkludera stöd

source: This module provides limited support for `XInclude directives <https://www.w3.org/TR/xinclude/>`_, via the :mod:`xml.etree.ElementInclude` helper module. This module can be used to insert subtrees and text strings into element trees, based on information in the tree.
sv: Den här modulen ger begränsat stöd för `XInclude-direktiv <https://www.w3.org/TR/xinclude/>`_, via hjälpmodulen :mod:`xml.etree.ElementInclude`. Den här modulen kan användas för att infoga delträd och textsträngar i elementträd, baserat på information i trädet.

source: Here's an example that demonstrates use of the XInclude module. To include an XML document in the current document, use the ``{http://www.w3.org/2001/XInclude}include`` element and set the **parse** attribute to ``"xml"``, and use the **href** attribute to specify the document to include.
sv: Här följer ett exempel som visar hur modulen XInclude används. För att inkludera ett XML-dokument i det aktuella dokumentet, använd elementet ``{http://www.w3.org/2001/XInclude}include`` och sätt attributet **parse** till ``"xml"``, och använd attributet **href** för att ange dokumentet som ska inkluderas.

source: By default, the **href** attribute is treated as a file name. You can use custom loaders to override this behaviour. Also note that the standard helper does not support XPointer syntax.
sv: Som standard behandlas attributet **href** som ett filnamn. Du kan använda anpassade laddare för att åsidosätta detta beteende. Observera också att standardhjälpen inte stöder XPointer-syntax.

source: To process this file, load it as usual, and pass the root element to the :mod:`xml.etree.ElementTree` module:
sv: För att bearbeta den här filen laddar du den som vanligt och skickar rotelementet till modulen :mod:`xml.etree.ElementTree`:

source: The ElementInclude module replaces the ``{http://www.w3.org/2001/XInclude}include`` element with the root element from the **source.xml** document. The result might look something like this:
sv: ElementInclude-modulen ersätter elementet ``{http://www.w3.org/2001/XInclude}include`` med rotelementet från dokumentet **source.xml**. Resultatet kan se ut ungefär så här:

source: <document xmlns:xi="http://www.w3.org/2001/XInclude"> <para>This is a paragraph.</para> </document>
sv: <document xmlns:xi="http://www.w3.org/2001/XInclude"> <para>Detta är ett stycke.</para> </document>
