Repository: yeager/python-docs-sv
Catalog: library/xml.etree.elementtree.po
Languages: sv

source: :mod:`!xml.etree.ElementTree` --- The ElementTree XML API
sv: :mod:`!xml.etree.ElementTree` --- XML API för ElementTree

source: **Source code:** :source:`Lib/xml/etree/ElementTree.py`
sv: **Källkod:** :source:`Lib/xml/etree/ElementTree.py`

source: The :mod:`xml.etree.ElementTree` module implements a simple and efficient API for parsing and creating XML data.
sv: Modulen :mod:`xml.etree.ElementTree` implementerar ett enkelt och effektivt API för att analysera och skapa XML-data.

source: This module will use a fast implementation whenever available.
sv: Denna modul kommer att använda en snabb implementering när så är möjligt.

source: The :mod:`!xml.etree.cElementTree` module is deprecated.
sv: Modulen :mod:`!xml.etree.cElementTree` är föråldrad.

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
sv: Om du behöver analysera otillförlitliga eller oautentiserade data, se :ref:`xml-security`.

source: Tutorial
sv: Handledning

source: This is a short tutorial for using :mod:`xml.etree.ElementTree` (``ET`` in short). The goal is to demonstrate some of the building blocks and basic concepts of the module.
sv: Detta är en kort handledning för användning av :mod:`xml.etree.ElementTree` (förkortat ``ET``). Målet är att demonstrera några av modulens byggstenar och grundläggande begrepp.

source: XML tree and elements
sv: XML-träd och element

source: XML is an inherently hierarchical data format, and the most natural way to represent it is with a tree. ``ET`` has two classes for this purpose - :class:`ElementTree` represents the whole XML document as a tree, and :class:`Element` represents a single node in this tree. Interactions with the whole document (reading and writing to/from files) are usually done on the :class:`ElementTree` level. Interactions with a single XML element and its sub-elements are done on the :class:`Element` level.
sv: XML är till sin natur ett hierarkiskt dataformat och det mest naturliga sättet att representera det är med ett träd. ``ET`` har två klasser för detta ändamål - :class:`ElementTree` representerar hela XML-dokumentet som ett träd, och :class:`Element` representerar en enskild nod i detta träd. Interaktioner med hela dokumentet (läsa och skriva till/från filer) görs vanligtvis på :class:`ElementTree`-nivå. Interaktioner med ett enskilt XML-element och dess underelement görs på nivån :class:`Element`.

source: Parsing XML
sv: Parsning av XML

source: We'll be using the fictive :file:`country_data.xml` XML document as the sample data for this section:
sv: Vi kommer att använda det fiktiva XML-dokumentet :file:`country_data.xml` som exempeldata för detta avsnitt:

source: We can import this data by reading from a file::
sv: Vi kan importera dessa data genom att läsa från en fil::

source: import xml.etree.ElementTree as ET tree = ET.parse('country_data.xml') root = tree.getroot()
sv: import xml.etree.ElementTree as ET träd = ET.parse('land_data.xml') root = träd.getroot()

source: Or directly from a string::
sv: Eller direkt från en sträng::

source: root = ET.fromstring(country_data_as_string)
sv: root = ET.fromstring(land_data_som_sträng)

source: :func:`fromstring` parses XML from a string directly into an :class:`Element`, which is the root element of the parsed tree. Other parsing functions may create an :class:`ElementTree`. Check the documentation to be sure.
sv: :func:`fromstring` parsar XML från en sträng direkt till ett :class:`Element`, som är rotelementet i det parsade trädet. Andra parsingfunktioner kan skapa ett :class:`ElementTree`. Kontrollera dokumentationen för att vara säker.

source: As an :class:`Element`, ``root`` has a tag and a dictionary of attributes::
sv: Som ett :class:`Element` har ``root`` en tagg och en ordlista med attribut::

source: >>> root.tag 'data' >>> root.attrib {}
sv: >>> root.tag 'data' >>> rot.attrib {}

source: It also has children nodes over which we can iterate::
sv: Den har också underordnade noder som vi kan iterera över::

source: >>> for child in root: ... print(child.tag, child.attrib) ... country {'name': 'Liechtenstein'} country {'name': 'Singapore'} country {'name': 'Panama'}
sv: >>> för barn i rot: ... print(barn.tag, barn.attrib) ... land {'namn': 'Liechtenstein'} land {'namn': 'Singapore'} land {namn: "Panama"}

source: Children are nested, and we can access specific child nodes by index::
sv: Barnen är nästlade och vi kan komma åt specifika barnnoder genom index::

source: Not all elements of the XML input will end up as elements of the parsed tree. Currently, this module skips over any XML comments, processing instructions, and document type declarations in the input. Nevertheless, trees built using this module's API rather than parsing from XML text can have comments and processing instructions in them; they will be included when generating XML output. A document type declaration may be accessed by passing a custom :class:`TreeBuilder` instance to the :class:`XMLParser` constructor.
sv: Inte alla element i XML-data kommer att hamna som element i det analyserade trädet. För närvarande hoppar den här modulen över alla XML-kommentarer, bearbetningsinstruktioner och dokumenttypsdeklarationer i indata. Träd som byggs upp med hjälp av modulens API i stället för att parsa från XML-text kan dock innehålla kommentarer och bearbetningsinstruktioner; de kommer att inkluderas när XML-utdata genereras. En dokumenttypsdeklaration kan nås genom att skicka en anpassad :class:`TreeBuilder`-instans till :class:`XMLParser`-konstruktören.

source: Pull API for non-blocking parsing
sv: Pull API för icke-blockerande parsing

source: Most parsing functions provided by this module require the whole document to be read at once before returning any result. It is possible to use an :class:`XMLParser` and feed data into it incrementally, but it is a push API that calls methods on a callback target, which is too low-level and inconvenient for most needs. Sometimes what the user really wants is to be able to parse XML incrementally, without blocking operations, while enjoying the convenience of fully constructed :class:`Element` objects.
sv: De flesta parsingfunktioner som tillhandahålls av den här modulen kräver att hela dokumentet läses på en gång innan de returnerar något resultat. Det är möjligt att använda en :class:`XMLParser` och mata in data i den stegvis, men det är ett push-API som anropar metoder på ett callback-mål, vilket är för låg nivå och obekvämt för de flesta behov. Ibland vill användaren verkligen kunna analysera XML stegvis, utan att blockera operationer, samtidigt som han eller hon kan njuta av bekvämligheten med helt konstruerade :class:`Element`-objekt.

source: The most powerful tool for doing this is :class:`XMLPullParser`. It does not require a blocking read to obtain the XML data, and is instead fed with data incrementally with :meth:`XMLPullParser.feed` calls. To get the parsed XML elements, call :meth:`XMLPullParser.read_events`. Here is an example::
sv: Det mest kraftfulla verktyget för att göra detta är :class:`XMLPullParser`. Den kräver inte en blockerande läsning för att få XML-data, utan matas istället med data stegvis med :meth:`XMLPullParser.feed`-anrop. För att hämta de analyserade XML-elementen anropas :meth:`XMLPullParser.read_events`. Här är ett exempel::

source: >>> parser = ET.XMLPullParser(['start', 'end']) >>> parser.feed('<mytag>sometext') >>> list(parser.read_events()) [('start', <Element 'mytag' at 0x7fa66db2be58>)] >>> parser.feed(' more text</mytag>') >>> for event, elem in parser.read_events(): ... print(event) ... print(elem.tag, 'text=', elem.text) ... end mytag text= sometext more text
sv: &gt;&gt;&gt; parser = ET.XMLPullParser(['start', 'end']) &gt;&gt;&gt; parser.feed('<mytag>sometext') &gt;&gt;&gt; list(parser.read_events()) [('start', <Element 'mytag' at 0x7fa66db2be58>)] &gt;&gt;&gt; parser.feed('mer text</mytag>') &gt;&gt;&gt; for event, elem in parser.read_events(): ... print(händelse) ... print(elem.tag, 'text=', elem.text) ... slut mytag text= sometext mer text

source: The obvious use case is applications that operate in a non-blocking fashion where the XML data is being received from a socket or read incrementally from some storage device. In such cases, blocking reads are unacceptable.
sv: Det uppenbara användningsfallet är applikationer som fungerar på ett icke-blockerande sätt där XML-data tas emot från ett uttag eller läses stegvis från någon lagringsenhet. I sådana fall är blockerande läsningar oacceptabla.

source: Because it's so flexible, :class:`XMLPullParser` can be inconvenient to use for simpler use-cases. If you don't mind your application blocking on reading XML data but would still like to have incremental parsing capabilities, take a look at :func:`iterparse`. It can be useful when you're reading a large XML document and don't want to hold it wholly in memory.
sv: Eftersom den är så flexibel kan :class:`XMLPullParser` vara obekväm att använda för enklare användningsfall. Om du inte har något emot att din applikation blockerar läsning av XML-data men ändå vill ha inkrementella parsingfunktioner kan du ta en titt på :func:`iterparse`. Det kan vara användbart när du läser ett stort XML-dokument och inte vill hålla det helt och hållet i minnet.

source: Where *immediate* feedback through events is wanted, calling method :meth:`XMLPullParser.flush` can help reduce delay; please make sure to study the related security notes.
sv: Om *omedelbar* återkoppling genom händelser önskas kan anrop av metoden :meth:`XMLPullParser.flush` bidra till att minska fördröjningen; se till att studera de relaterade säkerhetsnoterna.

source: Finding interesting elements
sv: Hitta intressanta element

source: :class:`Element` has some useful methods that help iterate recursively over all the sub-tree below it (its children, their children, and so on). For example, :meth:`Element.iter`::
sv: :class:`Element` har några användbara metoder som hjälper till att iterera rekursivt över alla underträd under det (dess barn, deras barn, och så vidare). Till exempel :meth:`Element.iter`::

source: >>> for neighbor in root.iter('neighbor'): ... print(neighbor.attrib) ... {'name': 'Austria', 'direction': 'E'} {'name': 'Switzerland', 'direction': 'W'} {'name': 'Malaysia', 'direction': 'N'} {'name': 'Costa Rica', 'direction': 'W'} {'name': 'Colombia', 'direction': 'E'}
sv: >>> för granne i rot.iter('granne'): ... print(granne.attrib) ... {'namn': 'Österrike', 'riktning': 'E'} {'name': 'Schweiz', 'riktning': 'W'} {'name': 'Malaysia', 'direction': 'N'} {'name': 'Costa Rica', 'direction': 'W'} {'name': 'Colombia', 'direction': 'E'}

source: :meth:`Element.findall` finds only elements with a tag which are direct children of the current element. :meth:`Element.find` finds the *first* child with a particular tag, and :attr:`Element.text` accesses the element's text content. :meth:`Element.get` accesses the element's attributes::
sv: :meth:`Element.findall` hittar bara element med en tagg som är direkta barn till det aktuella elementet. :meth:`Element.find` hittar det *första* barnet med en viss tagg, och :attr:`Element.text` ger tillgång till elementets textinnehåll. :meth:`Element.get` ger tillgång till elementets attribut::

source: >>> for country in root.findall('country'): ... rank = country.find('rank').text ... name = country.get('name') ... print(name, rank) ... Liechtenstein 1 Singapore 4 Panama 68
sv: >>> for country in root.findall('country'): ... rank = land.find('rank').text ... namn = land.hämta('namn') ... print(namn, rang) ... Liechtenstein 1 Singapore 4 Panama 68

source: More sophisticated specification of which elements to look for is possible by using :ref:`XPath <elementtree-xpath>`.
sv: En mer sofistikerad specifikation av vilka element som ska sökas är möjlig genom att använda :ref:`XPath <elementtree-xpath>`.

source: Modifying an XML File
sv: Ändra en XML-fil

source: :class:`ElementTree` provides a simple way to build XML documents and write them to files. The :meth:`ElementTree.write` method serves this purpose.
sv: :class:`ElementTree` ger ett enkelt sätt att bygga XML-dokument och skriva dem till filer. Metoden :meth:`ElementTree.write` tjänar detta syfte.

source: Once created, an :class:`Element` object may be manipulated by directly changing its fields (such as :attr:`Element.text`), adding and modifying attributes (:meth:`Element.set` method), as well as adding new children (for example with :meth:`Element.append`).
sv: När ett :class:`Element`-objekt har skapats kan det manipuleras genom att direkt ändra dess fält (t.ex. :attr:`Element.text`), lägga till och ändra attribut (metoden :meth:`Element.set`) samt lägga till nya barn (t.ex. med :meth:`Element.append`).

source: Let's say we want to add one to each country's rank, and add an ``updated`` attribute to the rank element::
sv: Låt oss säga att vi vill lägga till en till varje lands rankning och lägga till ett ``uppdaterat`` attribut till rank-elementet::

source: >>> for rank in root.iter('rank'): ... new_rank = int(rank.text) + 1 ... rank.text = str(new_rank) ... rank.set('updated', 'yes') ... >>> tree.write('output.xml')
sv: >>> för rank i root.iter('rank'): ... new_rank = int(rank.text) + 1 ... rank.text = str(ny_rank) ... rank.set('updated', 'yes') ... >>> tree.write('output.xml')

source: Our XML now looks like this:
sv: Vår XML ser nu ut så här:

source: We can remove elements using :meth:`Element.remove`. Let's say we want to remove all countries with a rank higher than 50::
sv: Vi kan ta bort element med hjälp av :meth:`Element.remove`. Låt oss säga att vi vill ta bort alla länder med en rank högre än 50::

source: >>> for country in root.findall('country'): ... # using root.findall() to avoid removal during traversal ... rank = int(country.find('rank').text) ... if rank > 50: ... root.remove(country) ... >>> tree.write('output.xml')
sv: >>> för land i root.findall('land'): ... # använder root.findall() för att undvika borttagning under traversal ... rank = int(land.find('rank').text) ... om rank > 50: ... root.remove(land) ... >>> tree.write('output.xml')

source: Note that concurrent modification while iterating can lead to problems, just like when iterating and modifying Python lists or dicts. Therefore, the example first collects all matching elements with ``root.findall()``, and only then iterates over the list of matches.
sv: Observera att samtidig modifiering under iteration kan leda till problem, precis som när man itererar och modifierar Python-listor eller dicts. Därför samlar exemplet först in alla matchande element med ``root.findall()`` och itererar först därefter över listan med matchningar.

source: Building XML documents
sv: Skapa XML-dokument

source: The :func:`SubElement` function also provides a convenient way to create new sub-elements for a given element::
sv: Funktionen :func:`SubElement` ger också ett bekvämt sätt att skapa nya underelement för ett givet element::

source: >>> a = ET.Element('a') >>> b = ET.SubElement(a, 'b') >>> c = ET.SubElement(a, 'c') >>> d = ET.SubElement(c, 'd') >>> ET.dump(a) <a><b /><c><d /></c></a>
sv: &gt;&gt;&gt; a = ET.Element('a') &gt;&gt;&gt; b = ET.SubElement(a, 'b') &gt;&gt;&gt; c = ET.SubElement(a, 'c') &gt;&gt;&gt; d = ET.SubElement(c, 'd') &gt;&gt;&gt; ET.dump(a) <a><b /><c><d /></c></a>

source: Parsing XML with Namespaces
sv: Parsning av XML med namnrymder

source: If the XML input has `namespaces <https://en.wikipedia.org/wiki/XML_namespace>`__, tags and attributes with prefixes in the form ``prefix:sometag`` get expanded to ``{uri}sometag`` where the *prefix* is replaced by the full *URI*. Also, if there is a `default namespace <https://www.w3.org/TR/xml-names/#defaulting>`__, that full URI gets prepended to all of the non-prefixed tags.
sv: Om XML-inmatningen har `namnrymder <https://en.wikipedia.org/wiki/XML_namespace>`__ expanderas taggar och attribut med prefix i formen ``prefix:sometag`` till ``{uri}sometag`` där *prefixet* ersätts av hela *URI*. Om det finns ett `default namespace <https://www.w3.org/TR/xml-names/#defaulting>`__ blir dessutom den fullständiga URI:n prefixad till alla icke-prefixerade taggar.

source: Here is an XML example that incorporates two namespaces, one with the prefix "fictional" and the other serving as the default namespace:
sv: Här är ett XML-exempel som innehåller två namnrymder, en med prefixet "fictional" och en som fungerar som standardnamnrymd:

source: <?xml version="1.0"?> <actors xmlns:fictional="http://characters.example.com" xmlns="http://people.example.com"> <actor> <name>John Cleese</name> <fictional:character>Lancelot</fictional:character> <fictional:character>Archie Leach</fictional:character> </actor> <actor> <name>Eric Idle</name> <fictional:character>Sir Robin</fictional:character> <fictional:character>Gunther</fictional:character> <fictional:character>Commander Clement</fictional:character> </actor> </actors>
sv: <?xml version="1.0"?> <actors xmlns:fictional="http://characters.example.com" xmlns="http://people.example.com"> <actor> <name>John Cleese</name> <fictional:character>Lancelot</fictional:character> <fictional:character>Archie Leach</fictional:character> </actor> <actor> <name>Eric Idle</name> <fictional:character>Sir Robin</fictional:character> <fictional:character>Gunther</fictional:character> <fictional:character>Kommendörkapten Clement</fictional:character> </actor> </actors>

source: One way to search and explore this XML example is to manually add the URI to every tag or attribute in the xpath of a :meth:`~Element.find` or :meth:`~Element.findall`::
sv: Ett sätt att söka och utforska detta XML-exempel är att manuellt lägga till URI:n till varje tagg eller attribut i xpath för en :meth:`~Element.find` eller :meth:`~Element.findall`::

source: root = fromstring(xml_text) for actor in root.findall('{http://people.example.com}actor'): name = actor.find('{http://people.example.com}name') print(name.text) for char in actor.findall('{http://characters.example.com}character'): print(' |-->', char.text)
sv: root = från sträng(xml_text) för skådespelare i root.findall('{http://people.example.com}skådespelare'): namn = skådespelare.hitta('{http://people.example.com}namn') print(namn.text) for char in actor.findall('{http://characters.example.com}character'): print(' |-->', char.text)

source: A better way to search the namespaced XML example is to create a dictionary with your own prefixes and use those in the search functions::
sv: Ett bättre sätt att söka i namespaced XML-exemplet är att skapa en ordbok med dina egna prefix och använda dem i sökfunktionerna::

source: ns = {'real_person': 'http://people.example.com', 'role': 'http://characters.example.com'} for actor in root.findall('real_person:actor', ns): name = actor.find('real_person:name', ns) print(name.text) for char in actor.findall('role:character', ns): print(' |-->', char.text)
sv: ns = {'real_person': 'http://people.example.com', 'roll': 'http://characters.example.com'} for actor in root.findall('real_person:actor', ns): name = actor.find('verklig_person:namn', ns) print(namn.text) för char i actor.findall('roll:karaktär', ns): print(' |-->', char.text)

source: These two approaches both output::
sv: Dessa två metoder ger båda ut::

source: XPath support
sv: Stöd för XPath

source: This module provides limited support for `XPath expressions <https://www.w3.org/TR/xpath>`_ for locating elements in a tree. The goal is to support a small subset of the abbreviated syntax; a full XPath engine is outside the scope of the module.
sv: Den här modulen ger begränsat stöd för `XPath-uttryck <https://www.w3.org/TR/xpath>`_ för att hitta element i ett träd. Målet är att stödja en liten delmängd av den förkortade syntaxen; en fullständig XPath-motor ligger utanför modulens omfattning.

source: Example
sv: Exempel

source: Here's an example that demonstrates some of the XPath capabilities of the module. We'll be using the ``countrydata`` XML document from the :ref:`Parsing XML <elementtree-parsing-xml>` section::
sv: Här är ett exempel som demonstrerar några av XPath-funktionerna i modulen. Vi kommer att använda XML-dokumentet ``countrydata`` från :ref:`Parsing XML <elementtree-parsing-xml>` avsnittet::

source: For XML with namespaces, use the usual qualified ``{namespace}tag`` notation::
sv: För XML med namnrymder används den vanliga kvalificerade ``{namespace}tag``-notationen::

source: # All dublin-core "title" tags in the document root.findall(".//{http://purl.org/dc/elements/1.1/}title")
sv: # Alla dublin-core "title"-taggar i dokumentet root.findall(".//{http://purl.org/dc/elements/1.1/}title")

source: Supported XPath syntax
sv: XPath-syntax som stöds

source: Meaning
sv: Betydelse

source: Selects all child elements with the given tag. For example, ``spam`` selects all child elements named ``spam``, and ``spam/egg`` selects all grandchildren named ``egg`` in all children named ``spam``. ``{namespace}*`` selects all tags in the given namespace, ``{*}spam`` selects tags named ``spam`` in any (or no) namespace, and ``{}*`` only selects tags that are not in a namespace.
sv: Väljer alla underordnade element med den angivna taggen. Exempelvis väljer ``spam`` alla underordnade element med namnet ``spam``, och ``spam/egg`` väljer alla barnbarn med namnet ``egg`` i alla underordnade element med namnet ``spam``. ``{namespace}*`` väljer alla taggar i den angivna namnrymden, ``{*}spam`` väljer taggar med namnet ``spam`` i vilken (eller ingen) namnrymd som helst och ``{}*`` väljer bara taggar som inte finns i någon namnrymd.

source: Support for star-wildcards was added.
sv: Stöd för stjärn-wildcards har lagts till.

source: Selects all child elements, including comments and processing instructions. For example, ``*/egg`` selects all grandchildren named ``egg``.
sv: Väljer alla underordnade element, inklusive kommentarer och bearbetningsinstruktioner. Exempel: ``*/egg`` väljer alla barnbarn med namnet ``egg``.

source: Selects the current node. This is mostly useful at the beginning of the path, to indicate that it's a relative path.
sv: Väljer den aktuella noden. Detta är mest användbart i början av sökvägen för att ange att det är en relativ sökväg.

source: Selects all subelements, on all levels beneath the current element. For example, ``.//egg`` selects all ``egg`` elements in the entire tree.
sv: Väljer alla underelement på alla nivåer under det aktuella elementet. Till exempel väljer ``.//egg`` alla ``egg``-element i hela trädet.

source: Selects the parent element. Returns ``None`` if the path attempts to reach the ancestors of the start element (the element ``find`` was called on).
sv: Väljer det överordnade elementet. Returnerar ``None`` om sökvägen försöker nå förfäderna till startelementet (det element som ``find`` anropades på).

source: Selects all elements that have the given attribute.
sv: Väljer alla element som har det angivna attributet.

source: ``[@attrib='value']``
sv: ``[@attrib='värde']``

source: Selects all elements for which the given attribute has the given value. The value cannot contain quotes.
sv: Väljer alla element för vilka det angivna attributet har det angivna värdet. Värdet kan inte innehålla citattecken.

source: ``[@attrib!='value']``
sv: ``[@attrib!='värde']``

source: Selects all elements for which the given attribute does not have the given value. The value cannot contain quotes.
sv: Markerar alla element för vilka det angivna attributet inte har det angivna värdet. Värdet får inte innehålla citattecken.

source: ``[tag]``
sv: ``[tagg]```

source: Selects all elements that have a child named ``tag``. Only immediate children are supported.
sv: Väljer alla element som har ett barn med namnet ``tag``. Endast omedelbara barn stöds.
