Repository: yeager/python-docs-sv
Catalog: library/xmlrpc.client.po
Languages: sv

source: :mod:`!xmlrpc.client` --- XML-RPC client access
sv: :mod:`!xmlrpc.client` --- XML-RPC-klientåtkomst

source: **Source code:** :source:`Lib/xmlrpc/client.py`
sv: **Källkod:** :source:`Lib/xmlrpc/client.py`

source: XML-RPC is a Remote Procedure Call method that uses XML passed via HTTP(S) as a transport. With it, a client can call methods with parameters on a remote server (the server is named by a URI) and get back structured data. This module supports writing XML-RPC client code; it handles all the details of translating between conformable Python objects and XML on the wire.
sv: XML-RPC är en Remote Procedure Call-metod som använder XML som skickas via HTTP(S) som transport. Med den kan en klient anropa metoder med parametrar på en fjärrserver (servern namnges av en URI) och få tillbaka strukturerade data. Den här modulen stöder skrivandet av XML-RPC-klientkod; den hanterar alla detaljer i översättningen mellan kompatibla Python-objekt och XML på kabeln.

source: The :mod:`xmlrpc.client` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
sv: Modulen :mod:`xmlrpc.client` är inte säker mot skadligt konstruerade data. Om du behöver analysera icke betrodda eller oautentiserade data, se :ref:`xml-security`.

source: For HTTPS URIs, :mod:`xmlrpc.client` now performs all the necessary certificate and hostname checks by default.
sv: För HTTPS URI:er utför :mod:`xmlrpc.client` nu alla nödvändiga certifikat- och värdnamnskontroller som standard.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: A :class:`ServerProxy` instance is an object that manages communication with a remote XML-RPC server. The required first argument is a URI (Uniform Resource Indicator), and will normally be the URL of the server. The optional second argument is a transport factory instance; by default it is an internal :class:`SafeTransport` instance for https: URLs and an internal HTTP :class:`Transport` instance otherwise. The optional third argument is an encoding, by default UTF-8. The optional fourth argument is a debugging flag.
sv: En instans av :class:`ServerProxy` är ett objekt som hanterar kommunikationen med en XML-RPC-fjärrserver. Det obligatoriska första argumentet är en URI (Uniform Resource Indicator) som normalt är serverns URL. Det valfria andra argumentet är en transportfabriksinstans; som standard är det en intern :class:`SafeTransport`-instans för https: URL:er och en intern HTTP :class:`Transport`-instans i annat fall. Det valfria tredje argumentet är en kodning, som standard UTF-8. Det valfria fjärde argumentet är en felsökningsflagga.

source: The following parameters govern the use of the returned proxy instance. If *allow_none* is true, the Python constant ``None`` will be translated into XML; the default behaviour is for ``None`` to raise a :exc:`TypeError`. This is a commonly used extension to the XML-RPC specification, but isn't supported by all clients and servers; see `http://ontosys.com/xml-rpc/extensions.php <https://web.archive.org/web/20130120074804/http://ontosys.com/xml-rpc/extensions.php>`_ for a description. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default. :class:`datetime.datetime`, :class:`bytes` and :class:`bytearray` objects may be passed to calls. The *headers* parameter is an optional sequence of HTTP headers to send with each request, expressed as a sequence of 2-tuples representing the header name and value. (e.g. ``[('Header-Name', 'value')]``). If an HTTPS URL is provided, *context* may be :class:`ssl.SSLContext` and configures the SSL settings of the underlying HTTPS connection. The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
sv: Följande parametrar styr användningen av den returnerade proxyinstansen. Om *allow_none* är true kommer Python-konstanten ``None`` att översättas till XML; standardbeteendet är att ``None`` ger upphov till ett :exc:`TypeError`. Detta är en vanligt förekommande utvidgning av XML-RPC-specifikationen, men stöds inte av alla klienter och servrar; se `http://ontosys.com/xml-rpc/extensions.php <https://web.archive.org/web/20130120074804/http://ontosys.com/xml-rpc/extensions.php>`_ för en beskrivning. Flaggan *use_builtin_types* kan användas för att få datum/tidsvärden att presenteras som :class:`datetime.datetime`-objekt och binära data att presenteras som :class:`bytes`-objekt; denna flagga är false som standard. :class:`datetime.datetime`-, :class:`bytes`- och :class:`bytearray`-objekt kan skickas till anrop. Parametern *headers* är en valfri sekvens av HTTP-rubriker som ska skickas med varje begäran, uttryckt som en sekvens av 2-tuples som representerar rubrikens namn och värde. (t.ex. ``[('Header-Name', 'value')]``). Om en HTTPS-URL tillhandahålls kan *context* vara :class:`ssl.SSLContext` och konfigurerar SSL-inställningarna för den underliggande HTTPS-anslutningen. Den obsoleta flaggan *use_datetime* liknar *use_builtin_types* men gäller endast datum-/tidsvärden.

source: The *use_builtin_types* flag was added.
sv: Flaggan *use_builtin_types* har lagts till.

source: The *headers* parameter was added.
sv: Parametern *headers* har lagts till.

source: Both the HTTP and HTTPS transports support the URL syntax extension for HTTP Basic Authentication: ``http://user:pass@host:port/path``. The ``user:pass`` portion will be base64-encoded as an HTTP 'Authorization' header, and sent to the remote server as part of the connection process when invoking an XML-RPC method. You only need to use this if the remote server requires a Basic Authentication user and password.
sv: Både HTTP- och HTTPS-transporterna stöder URL-syntaxtillägget för HTTP Basic Authentication: ``http://user:pass@host:port/path``. Delen ``user:pass`` kommer att base64-kodas som en HTTP "Authorization"-rubrik och skickas till fjärrservern som en del av anslutningsprocessen när en XML-RPC-metod anropas. Du behöver bara använda detta om fjärrservern kräver en användare och ett lösenord med Basic Authentication.

source: The returned instance is a proxy object with methods that can be used to invoke corresponding RPC calls on the remote server. If the remote server supports the introspection API, the proxy can also be used to query the remote server for the methods it supports (service discovery) and fetch other server-associated metadata.
sv: Den returnerade instansen är ett proxyobjekt med metoder som kan användas för att anropa motsvarande RPC-anrop på fjärrservern. Om fjärrservern stöder introspection API kan proxyn också användas för att fråga fjärrservern om de metoder den stöder (service discovery) och hämta andra serverassocierade metadata.

source: Types that are conformable (e.g. that can be marshalled through XML), include the following (and except where noted, they are unmarshalled as the same Python type):
sv: Typer som är konforma (dvs. som kan marshallas genom XML), inkluderar följande (och förutom där det anges, är de inte marshallade som samma Python-typ):

source: XML-RPC type
sv: XML-RPC-typ

source: Python type
sv: Python-typ

source: ``int``, ``i1``, ``i2``, ``i4``, ``i8`` or ``biginteger``
sv: ``int``, ``i1``, ``i2``, ``i4``, ``i8`` eller ``biginteger``

source: :class:`int` in range from -2147483648 to 2147483647. Values get the ``<int>`` tag.
sv: :class:`int` i intervallet från -2147483648 till 2147483647. Värdena får taggen ``<int>``.

source: ``double`` or ``float``
sv: ``dubbel`` eller ``flata``

source: :class:`float`. Values get the ``<double>`` tag.
sv: :class:`float`. Värden får taggen ``<double>``.

source: ``string``
sv: ``sträng``

source: :class:`list` or :class:`tuple` containing conformable elements. Arrays are returned as :class:`lists <list>`.
sv: :class:`list` eller :class:`tuple` som innehåller överensstämmande element. Arrayer returneras som :class:`lists <list>`.

source: ``struct``
sv: ``struktur``

source: :class:`dict`. Keys must be strings, values may be any conformable type. Objects of user-defined classes can be passed in; only their :attr:`~object.__dict__` attribute is transmitted.
sv: :class:`dict`. Nycklar måste vara strängar, värden kan vara vilken typ som helst. Objekt av användardefinierade klasser kan skickas in; endast deras :attr:`~object.__dict__`-attribut överförs.

source: :class:`DateTime` or :class:`datetime.datetime`. Returned type depends on values of *use_builtin_types* and *use_datetime* flags.
sv: :class:`DateTime` eller :class:`datetime.datetime`. Returnerad typ beror på värdena för flaggorna *use_builtin_types* och *use_datetime*.

source: :class:`Binary`, :class:`bytes` or :class:`bytearray`. Returned type depends on the value of the *use_builtin_types* flag.
sv: :class:`Binary`, :class:`bytes` eller :class:`bytearray`. Returnerad typ beror på värdet av flaggan *use_builtin_types*.

source: The ``None`` constant. Passing is allowed only if *allow_none* is true.
sv: Konstanten ``None``. Överföring är tillåten endast om *allow_none* är true.

source: :class:`decimal.Decimal`. Returned type only.
sv: :class:`decimal.Decimal`. Endast returnerad typ.

source: This is the full set of data types supported by XML-RPC. Method calls may also raise a special :exc:`Fault` instance, used to signal XML-RPC server errors, or :exc:`ProtocolError` used to signal an error in the HTTP/HTTPS transport layer. Both :exc:`Fault` and :exc:`ProtocolError` derive from a base class called :exc:`Error`. Note that the xmlrpc client module currently does not marshal instances of subclasses of built-in types.
sv: Detta är den fullständiga uppsättning datatyper som stöds av XML-RPC. Metodanrop kan också ge upphov till en speciell :exc:`Fault`-instans, som används för att signalera XML-RPC-serverfel, eller :exc:`ProtocolError` som används för att signalera ett fel i HTTP/HTTPS-transportlagret. Både :exc:`Fault` och :exc:`ProtocolError` härstammar från en basklass som heter :exc:`Error`. Observera att xmlrpc-klientmodulen för närvarande inte marshalar instanser av underklasser av inbyggda typer.

source: When passing strings, characters special to XML such as ``<``, ``>``, and ``&`` will be automatically escaped. However, it's the caller's responsibility to ensure that the string is free of characters that aren't allowed in XML, such as the control characters with ASCII values between 0 and 31 (except, of course, tab, newline and carriage return); failing to do this will result in an XML-RPC request that isn't well-formed XML. If you have to pass arbitrary bytes via XML-RPC, use :class:`bytes` or :class:`bytearray` classes or the :class:`Binary` wrapper class described below.
sv: När strängar skickas kommer tecken som är speciella för XML, t.ex. ``<``, ``>`` och ``&``, att escapas automatiskt. Det är dock anroparens ansvar att se till att strängen är fri från tecken som inte är tillåtna i XML, t.ex. kontrolltecken med ASCII-värden mellan 0 och 31 (förutom tab, newline och carriage return); om du inte gör detta kommer det att resultera i en XML-RPC-begäran som inte är välformad XML. Om du måste skicka godtyckliga bytes via XML-RPC, använd :class:`bytes` eller :class:`bytearray` klasserna eller :class:`Binary` wrapper klassen som beskrivs nedan.

source: :class:`Server` is retained as an alias for :class:`ServerProxy` for backwards compatibility. New code should use :class:`ServerProxy`.
sv: :class:`Server` behålls som ett alias för :class:`ServerProxy` för bakåtkompatibilitet. Ny kod bör använda :class:`ServerProxy`.

source: Added the *context* argument.
sv: Lagt till argumentet *context*.

source: Added support of type tags with prefixes (e.g. ``ex:nil``). Added support of unmarshalling additional types used by Apache XML-RPC implementation for numerics: ``i1``, ``i2``, ``i8``, ``biginteger``, ``float`` and ``bigdecimal``. See https://ws.apache.org/xmlrpc/types.html for a description.
sv: Stöd för typtaggar med prefix har lagts till (t.ex. ``ex:nil``). Lagt till stöd för unmarshalling av ytterligare typer som används av Apache XML-RPC-implementering för numeriska värden: ``i1``, ``i2``, ``i8``, ``biginteger``, ``float`` och ``bigdecimal``. Se https://ws.apache.org/xmlrpc/types.html för en beskrivning.

source: A good description of XML-RPC operation and client software in several languages. Contains pretty much everything an XML-RPC client developer needs to know.
sv: En bra beskrivning av XML-RPC-operation och klientprogramvara på flera språk. Innehåller i stort sett allt som en XML-RPC-klientutvecklare behöver veta.

source: `XML-RPC Introspection <https://xmlrpc-c.sourceforge.io/introspection.html>`_
sv: xML-RPC Introspektion <https://xmlrpc-c.sourceforge.io/introspection.html>`_

source: Describes the XML-RPC protocol extension for introspection.
sv: Beskriver XML-RPC-protokolltillägget för introspektion.

source: `XML-RPC Specification <http://xmlrpc.scripting.com/spec.html>`_
sv: xML-RPC-specifikation <http://xmlrpc.scripting.com/spec.html>`_

source: The official specification.
sv: Den officiella specifikationen.

source: ServerProxy Objects
sv: ServerProxy-objekt

source: A :class:`ServerProxy` instance has a method corresponding to each remote procedure call accepted by the XML-RPC server. Calling the method performs an RPC, dispatched by both name and argument signature (e.g. the same method name can be overloaded with multiple argument signatures). The RPC finishes by returning a value, which may be either returned data in a conformant type or a :class:`Fault` or :class:`ProtocolError` object indicating an error.
sv: En :class:`ServerProxy`-instans har en metod som motsvarar varje fjärrproceduranrop som accepteras av XML-RPC-servern. När metoden anropas utförs ett RPC-anrop, som skickas med både namn och argumentsignatur (t.ex. kan samma metodnamn överbelastas med flera argumentsignaturer). RPC avslutas med att ett värde returneras, vilket kan vara antingen returnerade data i en överensstämmande typ eller ett :class:`Fault`- eller :class:`ProtocolError`-objekt som indikerar ett fel.

source: Servers that support the XML introspection API support some common methods grouped under the reserved :attr:`~ServerProxy.system` attribute:
sv: Servrar som stöder XML introspection API stöder några vanliga metoder som grupperas under det reserverade attributet :attr:`~ServerProxy.system`:

source: This method returns a list of strings, one for each (non-system) method supported by the XML-RPC server.
sv: Denna metod returnerar en lista med strängar, en för varje (icke-system) metod som stöds av XML-RPC-servern.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns an array of possible signatures for this method. A signature is an array of types. The first of these types is the return type of the method, the rest are parameters.
sv: Denna metod tar emot en parameter, namnet på en metod som implementeras av XML-RPC-servern. Den returnerar en array av möjliga signaturer för denna metod. En signatur är en array av typer. Den första av dessa typer är metodens returtyp, resten är parametrar.

source: Because multiple signatures (ie. overloading) is permitted, this method returns a list of signatures rather than a singleton.
sv: Eftersom flera signaturer (dvs. överbelastning) är tillåtna returnerar denna metod en lista med signaturer i stället för en singleton.

source: Signatures themselves are restricted to the top level parameters expected by a method. For instance if a method expects one array of structs as a parameter, and it returns a string, its signature is simply "string, array". If it expects three integers and returns a string, its signature is "string, int, int, int".
sv: Själva signaturerna är begränsade till de parametrar på högsta nivå som förväntas av en metod. Om en metod t.ex. förväntar sig en array av structs som parameter och returnerar en sträng, är dess signatur helt enkelt "string, array". Om den förväntar sig tre heltal och returnerar en sträng är signaturen "string, int, int, int".

source: If no signature is defined for the method, a non-array value is returned. In Python this means that the type of the returned value will be something other than list.
sv: Om ingen signatur har definierats för metoden returneras ett värde som inte är en array. I Python betyder det att typen av det returnerade värdet kommer att vara något annat än list.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns a documentation string describing the use of that method. If no such string is available, an empty string is returned. The documentation string may contain HTML markup.
sv: Denna metod tar en parameter, namnet på en metod som implementeras av XML-RPC-servern. Den returnerar en dokumentationssträng som beskriver användningen av den metoden. Om ingen sådan sträng finns tillgänglig returneras en tom sträng. Dokumentationssträngen kan innehålla HTML-markup.

source: Instances of :class:`ServerProxy` support the :term:`context manager` protocol for closing the underlying transport.
sv: Instanser av :class:`ServerProxy` stöder :term:`context manager`-protokollet för att stänga den underliggande transporten.

source: A working example follows. The server code::
sv: Här följer ett fungerande exempel. Serverkoden::

source: from xmlrpc.server import SimpleXMLRPCServer def is_even(n): return n % 2 == 0 server = SimpleXMLRPCServer(("localhost", 8000)) print("Listening on port 8000...") server.register_function(is_even, "is_even") server.serve_forever()
sv: from xmlrpc.server import SimpleXMLRPCServer def is_even(n): return n % 2 == 0 server = SimpleXMLRPCServer(("localhost", 8000)) print("Lyssnar på port 8000...") server.register_function(is_even, "is_even") server.serve_forever()

source: The client code for the preceding server::
sv: Klientkoden för den föregående servern::

source: DateTime Objects
sv: DateTime-objekt

source: This class may be initialized with seconds since the epoch, a time tuple, an ISO 8601 time/date string, or a :class:`datetime.datetime` instance. It has the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
sv: Klassen kan initialiseras med sekunder sedan epoken, en tidstupel, en ISO 8601 tid/datum-sträng eller en :class:`datetime.datetime`-instans. Den har följande metoder, som huvudsakligen stöds för internt bruk av marshalling/unmarshalling-koden:

source: Accept a string as the instance's new time value.
sv: Acceptera en sträng som instansens nya tidsvärde.

source: Write the XML-RPC encoding of this :class:`DateTime` item to the *out* stream object.
sv: Skriv XML-RPC-kodningen av detta :class:`DateTime`-objekt till *out*-strömobjektet.

source: It also supports certain of Python's built-in operators through :meth:`rich comparison <object.__lt__>` and :meth:`~object.__repr__` methods.
sv: Den stöder också vissa av Pythons inbyggda operatorer genom metoderna :meth:`rich comparison <object.__lt__>` och :meth:`~object.__repr__`.

source: Binary Objects
sv: Binära objekt

source: This class may be initialized from bytes data (which may include NULs). The primary access to the content of a :class:`Binary` object is provided by an attribute:
sv: Denna klass kan initialiseras från bytesdata (som kan innehålla NUL). Den primära tillgången till innehållet i ett :class:`Binary`-objekt ges av ett attribut:

source: The binary data encapsulated by the :class:`Binary` instance. The data is provided as a :class:`bytes` object.
sv: De binära data som inkapslas av :class:`Binary`-instansen. Data tillhandahålls som ett :class:`bytes`-objekt.

source: :class:`Binary` objects have the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
sv: :class:`Binary`-objekt har följande metoder, som huvudsakligen stöds för internt bruk av marshalling/unmarshalling-koden:

source: Accept a base64 :class:`bytes` object and decode it as the instance's new data.
sv: Acceptera ett base64 :class:`bytes`-objekt och avkoda det som instansens nya data.

source: Write the XML-RPC base 64 encoding of this binary item to the *out* stream object.
sv: Skriv XML-RPC-bas 64-kodningen av detta binära objekt till *out*-strömobjektet.

source: The encoded data will have newlines every 76 characters as per :rfc:`RFC 2045 section 6.8 <2045#section-6.8>`, which was the de facto standard base64 specification when the XML-RPC spec was written.
sv: De kodade data kommer att ha nya rader var 76:e tecken enligt :rfc:`RFC 2045 section 6.8 <2045#section-6.8>`, som var de facto-standarden för base64-specifikationen när XML-RPC-specifikationen skrevs.

source: It also supports certain of Python's built-in operators through :meth:`~object.__eq__` and :meth:`~object.__ne__` methods.
sv: Den stöder också vissa av Pythons inbyggda operatorer genom metoderna :meth:`~object.__eq__` och :meth:`~object.__ne__`.

source: Example usage of the binary objects. We're going to transfer an image over XMLRPC::
sv: Exempel på användning av de binära objekten. Vi kommer att överföra en bild via XMLRPC::

source: The client gets the image and saves it to a file::
sv: Klienten hämtar bilden och sparar den i en fil::

source: Fault Objects
sv: Felobjekt

source: A :class:`Fault` object encapsulates the content of an XML-RPC fault tag. Fault objects have the following attributes:
sv: Ett :class:`Fault`-objekt kapslar in innehållet i en XML-RPC fault-tagg. Fault-objekt har följande attribut:

source: An int indicating the fault type.
sv: Ett int som anger feltypen.

source: A string containing a diagnostic message associated with the fault.
sv: En sträng som innehåller ett diagnostiskt meddelande som är kopplat till felet.

source: In the following example we're going to intentionally cause a :exc:`Fault` by returning a complex type object. The server code::
sv: I följande exempel ska vi avsiktligt orsaka ett :exc:`Fault` genom att returnera ett objekt av komplex typ. Serverkoden::

source: from xmlrpc.server import SimpleXMLRPCServer # A marshalling error is going to occur because we're returning a # complex number def add(x, y): return x+y+0j server = SimpleXMLRPCServer(("localhost", 8000)) print("Listening on port 8000...") server.register_function(add, 'add') server.serve_forever()
sv: from xmlrpc.server import SimpleXMLRPCServer # Ett marshalling-fel kommer att uppstå eftersom vi returnerar ett # komplext tal def add(x, y): returnerar x+y+0j server = SimpleXMLRPCServer(("localhost", 8000)) print("Lyssnar på port 8000...") server.register_function(add, 'add') server.serve_forever()

source: ProtocolError Objects
sv: ProtokollFel Objekt

source: A :class:`ProtocolError` object describes a protocol error in the underlying transport layer (such as a 404 'not found' error if the server named by the URI does not exist). It has the following attributes:
sv: Ett :class:`ProtocolError`-objekt beskriver ett protokollfel i det underliggande transportlagret (t.ex. ett 404 "not found"-fel om servern som anges av URI:n inte existerar). Det har följande attribut:

source: The URI or URL that triggered the error.
sv: Den URI eller URL som utlöste felet.

source: The error code.
sv: Felkoden.

source: The error message or diagnostic string.
sv: Felmeddelandet eller diagnossträngen.
