Repository: yeager/python-docs-sv
Catalog: library/xmlrpc.server.po
Languages: sv

source: :mod:`!xmlrpc.server` --- Basic XML-RPC servers
sv: :mod:`!xmlrpc.server` --- Grundläggande XML-RPC-servrar

source: **Source code:** :source:`Lib/xmlrpc/server.py`
sv: **Källkod:** :source:`Lib/xmlrpc/server.py`

source: The :mod:`xmlrpc.server` module provides a basic server framework for XML-RPC servers written in Python. Servers can either be free standing, using :class:`SimpleXMLRPCServer`, or embedded in a CGI environment, using :class:`CGIXMLRPCRequestHandler`.
sv: Modulen :mod:`xmlrpc.server` tillhandahåller ett grundläggande serverramverk för XML-RPC-servrar skrivna i Python. Servrar kan antingen vara fristående, med :class:`SimpleXMLRPCServer`, eller inbäddade i en CGI-miljö, med :class:`CGIXMLRPCRequestHandler`.

source: The :mod:`xmlrpc.server` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
sv: Modulen :mod:`xmlrpc.server` är inte säker mot skadligt konstruerade data. Om du behöver analysera icke betrodda eller oautentiserade data, se :ref:`xml-security`.

source: Availability
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: Create a new server instance. This class provides methods for registration of functions that can be called by the XML-RPC protocol. The *requestHandler* parameter should be a factory for request handler instances; it defaults to :class:`SimpleXMLRPCRequestHandler`. The *addr* and *requestHandler* parameters are passed to the :class:`socketserver.TCPServer` constructor. If *logRequests* is true (the default), requests will be logged; setting this parameter to false will turn off logging. The *allow_none* and *encoding* parameters are passed on to :mod:`xmlrpc.client` and control the XML-RPC responses that will be returned from the server. The *bind_and_activate* parameter controls whether :meth:`server_bind` and :meth:`server_activate` are called immediately by the constructor; it defaults to true. Setting it to false allows code to manipulate the *allow_reuse_address* class variable before the address is bound. The *use_builtin_types* parameter is passed to the :func:`~xmlrpc.client.loads` function and controls which types are processed when date/times values or binary data are received; it defaults to false.
sv: Skapa en ny serverinstans. Denna klass tillhandahåller metoder för registrering av funktioner som kan anropas av XML-RPC-protokollet. Parametern *requestHandler* bör vara en fabrik för requesthandler-instanser; standardvärdet är :class:`SimpleXMLRPCRequestHandler`. Parametrarna *addr* och *requestHandler* skickas till konstruktören för :class:`socketserver.TCPServer`. Om *logRequests* är true (standard) kommer förfrågningar att loggas; om parametern är false stängs loggning av. Parametrarna *allow_none* och *encoding* skickas vidare till :mod:`xmlrpc.client` och styr de XML-RPC-svar som kommer att returneras från servern. Parametern *bind_and_activate* styr om :meth:`server_bind` och :meth:`server_activate` anropas omedelbart av konstruktören; standardvärdet är true. Om den sätts till false kan koden manipulera klassvariabeln *allow_reuse_address* innan adressen är bunden. Parametern *use_builtin_types* skickas till funktionen :func:`~xmlrpc.client.loads` och styr vilka typer som bearbetas när datum-/tidsvärden eller binära data tas emot; standardvärdet är false.

source: The *use_builtin_types* flag was added.
sv: Flaggan *use_builtin_types* har lagts till.

source: Create a new instance to handle XML-RPC requests in a CGI environment. The *allow_none* and *encoding* parameters are passed on to :mod:`xmlrpc.client` and control the XML-RPC responses that will be returned from the server. The *use_builtin_types* parameter is passed to the :func:`~xmlrpc.client.loads` function and controls which types are processed when date/times values or binary data are received; it defaults to false.
sv: Skapa en ny instans för att hantera XML-RPC-förfrågningar i en CGI-miljö. Parametrarna *allow_none* och *encoding* skickas vidare till :mod:`xmlrpc.client` och styr de XML-RPC-svar som returneras från servern. Parametern *use_builtin_types* skickas till funktionen :func:`~xmlrpc.client.loads` och styr vilka typer som behandlas när datum-/tidsvärden eller binära data tas emot; standardvärdet är false.

source: Create a new request handler instance. This request handler supports ``POST`` requests and modifies logging so that the *logRequests* parameter to the :class:`SimpleXMLRPCServer` constructor parameter is honored.
sv: Skapa en ny instans av request handler. Denna request handler stöder ``POST`` requests och modifierar loggningen så att parametern *logRequests* till :class:`SimpleXMLRPCServer` constructor parameter respekteras.

source: SimpleXMLRPCServer Objects
sv: SimpleXMLRPCServer-objekt

source: The :class:`SimpleXMLRPCServer` class is based on :class:`socketserver.TCPServer` and provides a means of creating simple, stand alone XML-RPC servers.
sv: Klassen :class:`SimpleXMLRPCServer` är baserad på :class:`socketserver.TCPServer` och gör det möjligt att skapa enkla, fristående XML-RPC-servrar.

source: Register a function that can respond to XML-RPC requests. If *name* is given, it will be the method name associated with *function*, otherwise :attr:`function.__name__` will be used. *name* is a string, and may contain characters not legal in Python identifiers, including the period character.
sv: Registrerar en funktion som kan svara på XML-RPC-förfrågningar. Om *name* anges kommer det att vara det metodnamn som associeras med *function*, annars kommer :attr:`function.__name__` att användas. *name* är en sträng och kan innehålla tecken som inte är tillåtna i Python-identifierare, inklusive periodtecknet.

source: This method can also be used as a decorator. When used as a decorator, *name* can only be given as a keyword argument to register *function* under *name*. If no *name* is given, :attr:`function.__name__` will be used.
sv: Denna metod kan också användas som en dekorator. När den används som en dekorator kan *name* endast anges som ett nyckelordsargument för att registrera *function* under *name*. Om inget *namn* anges kommer :attr:`function.__name__` att användas.

source: :meth:`register_function` can be used as a decorator.
sv: :meth:`register_function` kan användas som dekorator.

source: Register an object which is used to expose method names which have not been registered using :meth:`register_function`. If *instance* contains a :meth:`_dispatch` method, it is called with the requested method name and the parameters from the request. Its API is ``def _dispatch(self, method, params)`` (note that *params* does not represent a variable argument list). If it calls an underlying function to perform its task, that function is called as ``func(*params)``, expanding the parameter list. The return value from :meth:`_dispatch` is returned to the client as the result. If *instance* does not have a :meth:`_dispatch` method, it is searched for an attribute matching the name of the requested method.
sv: Registrera ett objekt som används för att exponera metodnamn som inte har registrerats med hjälp av :meth:`register_function`. Om *instance* innehåller en :meth:`_dispatch`-metod, anropas den med det begärda metodnamnet och parametrarna från begäran. Dess API är ``def _dispatch(self, method, params)`` (observera att *params* inte representerar en variabel argumentlista). Om den anropar en underliggande funktion för att utföra sin uppgift, kallas den funktionen som ``func(*params)`` och utökar parameterlistan. Returvärdet från :meth:`_dispatch` returneras till klienten som resultat. Om *instance* inte har någon :meth:`_dispatch`-metod, söks den efter ett attribut som matchar namnet på den begärda metoden.

source: If the optional *allow_dotted_names* argument is true and the instance does not have a :meth:`_dispatch` method, then if the requested method name contains periods, each component of the method name is searched for individually, with the effect that a simple hierarchical search is performed. The value found from this search is then called with the parameters from the request, and the return value is passed back to the client.
sv: Om det valfria argumentet *allow_dotted_names* är true och instansen inte har någon :meth:`_dispatch`-metod, och det begärda metodnamnet innehåller punkter, söks varje komponent i metodnamnet individuellt, vilket innebär att en enkel hierarkisk sökning utförs. Det värde som hittas vid denna sökning anropas sedan med parametrarna från begäran och returvärdet skickas tillbaka till klienten.

source: Enabling the *allow_dotted_names* option allows intruders to access your module's global variables and may allow intruders to execute arbitrary code on your machine. Only use this option on a secure, closed network.
sv: Om du aktiverar alternativet *allow_dotted_names* får inkräktare tillgång till modulens globala variabler och kan köra godtycklig kod på din dator. Använd endast det här alternativet i ett säkert, slutet nätverk.

source: Registers the XML-RPC introspection functions ``system.listMethods``, ``system.methodHelp`` and ``system.methodSignature``.
sv: Registrerar XML-RPC introspektionsfunktionerna ``system.listMethods``, ``system.methodHelp`` och ``system.methodSignature``.

source: Registers the XML-RPC multicall function system.multicall.
sv: Registrerar XML-RPC multicall-funktionen system.multicall.

source: An attribute value that must be a tuple listing valid path portions of the URL for receiving XML-RPC requests. Requests posted to other paths will result in a 404 "no such page" HTTP error. If this tuple is empty, all paths will be considered valid. The default value is ``('/', '/RPC2')``.
sv: Ett attributvärde som måste vara en tupel som listar giltiga sökvägsdelar av URL:en för mottagning av XML-RPC-förfrågningar. Förfrågningar som skickas till andra sökvägar kommer att resultera i ett HTTP-fel 404 "no such page". Om denna tupel är tom kommer alla sökvägar att betraktas som giltiga. Standardvärdet är ``('/', '/RPC2')``.

source: SimpleXMLRPCServer Example
sv: Exempel på SimpleXMLRPCServer

source: Server code::
sv: Serverkod::

source: The following client code will call the methods made available by the preceding server::
sv: Följande klientkod anropar de metoder som görs tillgängliga av den föregående servern::

source: :meth:`register_function` can also be used as a decorator. The previous server example can register functions in a decorator way::
sv: :meth:`register_function` kan också användas som en dekorator. Det föregående serverexemplet kan registrera funktioner på ett dekorativt sätt::

source: The following example included in the :file:`Lib/xmlrpc/server.py` module shows a server allowing dotted names and registering a multicall function.
sv: Följande exempel som ingår i modulen :file:`Lib/xmlrpc/server.py` visar en server som tillåter prickade namn och registrerar en multicall-funktion.

source: Enabling the *allow_dotted_names* option allows intruders to access your module's global variables and may allow intruders to execute arbitrary code on your machine. Only use this example only within a secure, closed network.
sv: Om du aktiverar alternativet *allow_dotted_names* får inkräktare tillgång till modulens globala variabler och kan köra godtycklig kod på din dator. Använd detta exempel endast inom ett säkert, slutet nätverk.

source: This ExampleService demo can be invoked from the command line::
sv: Denna ExampleService-demo kan startas från kommandoraden::

source: The client that interacts with the above server is included in ``Lib/xmlrpc/client.py``::
sv: Klienten som interagerar med ovanstående server ingår i ``Lib/xmlrpc/client.py``::

source: server = ServerProxy("http://localhost:8000") try: print(server.currentTime.getCurrentTime()) except Error as v: print("ERROR", v) multi = MultiCall(server) multi.getData() multi.pow(2,9) multi.add(1,2) try: for response in multi(): print(response) except Error as v: print("ERROR", v)
sv: server = ServerProxy("http://localhost:8000") försök: print(server.currentTime.getCurrentTime()) except Error as v: print("ERROR", v) multi = MultiCall(server) multi.getData() multi.pow(2,9) multi.add(1,2) försök: for svar i multi(): print(svar) except Error as v: print("ERROR", v)

source: This client which interacts with the demo XMLRPC server can be invoked as::
sv: Denna klient som interagerar med demo XMLRPC-servern kan anropas som::

source: CGIXMLRPCRequestHandler
sv: CGIXMLRPCFörfrågningshanterare

source: The :class:`CGIXMLRPCRequestHandler` class can be used to handle XML-RPC requests sent to Python CGI scripts.
sv: Klassen :class:`CGIXMLRPCRequestHandler` kan användas för att hantera XML-RPC-förfrågningar som skickas till Python CGI-skript.

source: Register an object which is used to expose method names which have not been registered using :meth:`register_function`. If instance contains a :meth:`_dispatch` method, it is called with the requested method name and the parameters from the request; the return value is returned to the client as the result. If instance does not have a :meth:`_dispatch` method, it is searched for an attribute matching the name of the requested method; if the requested method name contains periods, each component of the method name is searched for individually, with the effect that a simple hierarchical search is performed. The value found from this search is then called with the parameters from the request, and the return value is passed back to the client.
sv: Registrera ett objekt som används för att exponera metodnamn som inte har registrerats med hjälp av :meth:`register_function`. Om instance innehåller en :meth:`_dispatch`-metod anropas den med det begärda metodnamnet och parametrarna från begäran; returvärdet returneras till klienten som resultat. Om instance inte har någon :meth:`_dispatch`-metod söks den efter ett attribut som matchar namnet på den begärda metoden; om det begärda metodnamnet innehåller perioder söks varje komponent i metodnamnet individuellt, vilket innebär att en enkel hierarkisk sökning utförs. Det värde som hittas vid denna sökning anropas sedan med parametrarna från begäran, och returvärdet skickas tillbaka till klienten.

source: Register the XML-RPC introspection functions ``system.listMethods``, ``system.methodHelp`` and ``system.methodSignature``.
sv: Registrera XML-RPC introspektionsfunktionerna ``system.listMethods``, ``system.methodHelp`` och ``system.methodSignature``.

source: Register the XML-RPC multicall function ``system.multicall``.
sv: Registrera XML-RPC multicall-funktionen ``system.multicall``.

source: Handle an XML-RPC request. If *request_text* is given, it should be the POST data provided by the HTTP server, otherwise the contents of stdin will be used.
sv: Hantera en XML-RPC-begäran. Om *request_text* anges bör det vara POST-data som tillhandahålls av HTTP-servern, annars kommer innehållet i stdin att användas.

source: Example::
sv: Exempel::

source: class MyFuncs: def mul(self, x, y): return x * y handler = CGIXMLRPCRequestHandler() handler.register_function(pow) handler.register_function(lambda x,y: x+y, 'add') handler.register_introspection_functions() handler.register_instance(MyFuncs()) handler.handle_request()
sv: klass MyFuncs: def mul(self, x, y): returnerar x * y handler = CGIXMLRPCRequestHandler() handler.register_function(pow) handler.register_function(lambda x,y: x+y, 'add') handler.register_introspection_functions() handler.register_instance(MyFuncs()) handler.handle_request()

source: Documenting XMLRPC server
sv: Dokumentation av XMLRPC-server

source: These classes extend the above classes to serve HTML documentation in response to HTTP GET requests. Servers can either be free standing, using :class:`DocXMLRPCServer`, or embedded in a CGI environment, using :class:`DocCGIXMLRPCRequestHandler`.
sv: Dessa klasser utökar ovanstående klasser för att servera HTML-dokumentation som svar på HTTP GET-begäranden. Servrar kan antingen vara fristående, med :class:`DocXMLRPCServer`, eller inbäddade i en CGI-miljö, med :class:`DocCGIXMLRPCRequestHandler`.

source: Create a new server instance. All parameters have the same meaning as for :class:`SimpleXMLRPCServer`; *requestHandler* defaults to :class:`DocXMLRPCRequestHandler`.
sv: Skapa en ny serverinstans. Alla parametrar har samma betydelse som för :class:`SimpleXMLRPCServer`; *requestHandler* är standard för :class:`DocXMLRPCRequestHandler`.

source: Create a new instance to handle XML-RPC requests in a CGI environment.
sv: Skapa en ny instans för att hantera XML-RPC-begäranden i en CGI-miljö.

source: Create a new request handler instance. This request handler supports XML-RPC POST requests, documentation GET requests, and modifies logging so that the *logRequests* parameter to the :class:`DocXMLRPCServer` constructor parameter is honored.
sv: Skapa en ny instans av request handler. Denna request handler stöder XML-RPC POST requests, documentation GET requests och modifierar loggning så att parametern *logRequests* till :class:`DocXMLRPCServer` constructor parameter respekteras.

source: DocXMLRPCServer Objects
sv: DocXMLRPCServer-objekt

source: The :class:`DocXMLRPCServer` class is derived from :class:`SimpleXMLRPCServer` and provides a means of creating self-documenting, stand alone XML-RPC servers. HTTP POST requests are handled as XML-RPC method calls. HTTP GET requests are handled by generating pydoc-style HTML documentation. This allows a server to provide its own web-based documentation.
sv: Klassen :class:`DocXMLRPCServer` är härledd från :class:`SimpleXMLRPCServer` och gör det möjligt att skapa självdokumenterande, fristående XML-RPC-servrar. HTTP POST-förfrågningar hanteras som XML-RPC-metodanrop. HTTP GET-förfrågningar hanteras genom att generera HTML-dokumentation i pydoc-stil. Detta gör att en server kan tillhandahålla sin egen webbaserade dokumentation.

source: Set the title used in the generated HTML documentation. This title will be used inside the HTML "title" element.
sv: Ange den titel som används i den genererade HTML-dokumentationen. Denna titel kommer att användas inuti HTML-elementet "title".

source: Set the name used in the generated HTML documentation. This name will appear at the top of the generated documentation inside a "h1" element.
sv: Ange det namn som används i den genererade HTML-dokumentationen. Detta namn kommer att visas högst upp i den genererade dokumentationen i ett "h1"-element.

source: Set the description used in the generated HTML documentation. This description will appear as a paragraph, below the server name, in the documentation.
sv: Ange den beskrivning som används i den genererade HTML-dokumentationen. Beskrivningen kommer att visas som ett stycke under servernamnet i dokumentationen.

source: The :class:`DocCGIXMLRPCRequestHandler` class is derived from :class:`CGIXMLRPCRequestHandler` and provides a means of creating self-documenting, XML-RPC CGI scripts. HTTP POST requests are handled as XML-RPC method calls. HTTP GET requests are handled by generating pydoc-style HTML documentation. This allows a server to provide its own web-based documentation.
sv: Klassen :class:`DocCGIXMLRPCRequestHandler` är härledd från :class:`CGIXMLRPCRequestHandler` och gör det möjligt att skapa självdokumenterande XML-RPC CGI-skript. HTTP POST-förfrågningar hanteras som XML-RPC-metodanrop. HTTP GET-begäranden hanteras genom att generera HTML-dokumentation i pydoc-stil. Detta gör att en server kan tillhandahålla sin egen webbaserade dokumentation.
