Repository: yeager/python-docs-sv
Catalog: library/xmlrpc.client.po
Languages: sv

source: A dict containing the headers of the HTTP/HTTPS request that triggered the error.
sv: En dict som innehåller rubrikerna för den HTTP/HTTPS-begäran som utlöste felet.

source: In the following example we're going to intentionally cause a :exc:`ProtocolError` by providing an invalid URI::
sv: I följande exempel kommer vi avsiktligt att orsaka ett :exc:`ProtocolError` genom att ange en ogiltig URI::

source: MultiCall Objects
sv: MultiCall-objekt

source: The :class:`MultiCall` object provides a way to encapsulate multiple calls to a remote server into a single request [#]_.
sv: Objektet :class:`MultiCall` ger möjlighet att kapsla in flera anrop till en fjärrserver i en enda begäran [#]_.

source: Create an object used to boxcar method calls. *server* is the eventual target of the call. Calls can be made to the result object, but they will immediately return ``None``, and only store the call name and parameters in the :class:`MultiCall` object. Calling the object itself causes all stored calls to be transmitted as a single ``system.multicall`` request. The result of this call is a :term:`generator`; iterating over this generator yields the individual results.
sv: Skapa ett objekt som används för att boxcar-metodanrop. *server* är det slutliga målet för anropet. Anrop kan göras till resultatobjektet, men de kommer omedelbart att returnera ``None``, och bara lagra anropets namn och parametrar i :class:`MultiCall`-objektet. Anrop av själva objektet gör att alla lagrade anrop överförs som en enda ``system.multicall``-begäran. Resultatet av detta anrop är en :term:`generator`; genom att iterera över denna generator erhålls de enskilda resultaten.

source: A usage example of this class follows. The server code::
sv: Här följer ett exempel på användning av denna klass. Serverkoden::

source: from xmlrpc.server import SimpleXMLRPCServer def add(x, y): return x + y def subtract(x, y): return x - y def multiply(x, y): return x * y def divide(x, y): return x // y # A simple server with simple arithmetic functions server = SimpleXMLRPCServer(("localhost", 8000)) print("Listening on port 8000...") server.register_multicall_functions() server.register_function(add, 'add') server.register_function(subtract, 'subtract') server.register_function(multiply, 'multiply') server.register_function(divide, 'divide') server.serve_forever()
sv: from xmlrpc.server import SimpleXMLRPCServer def add(x, y): return x + y def subtract(x, y): returnerar x - y def multiply(x, y): returnerar x * y def divide(x, y): returnerar x // y # En enkel server med enkla aritmetiska funktioner server = SimpleXMLRPCServer(("localhost", 8000)) print("Lyssnar på port 8000...") server.register_multicall_functions() server.register_function(add, 'add') server.register_function(subtract, 'subtrahera') server.register_funktion(multiplicera, 'multiply') server.register_function(divide, 'dividera') server.serve_forever()

source: Convenience Functions
sv: Bekväma funktioner

source: Convert *params* into an XML-RPC request. or into a response if *methodresponse* is true. *params* can be either a tuple of arguments or an instance of the :exc:`Fault` exception class. If *methodresponse* is true, only a single value can be returned, meaning that *params* must be of length 1. *encoding*, if supplied, is the encoding to use in the generated XML; the default is UTF-8. Python's :const:`None` value cannot be used in standard XML-RPC; to allow using it via an extension, provide a true value for *allow_none*.
sv: Konverterar *params* till en XML-RPC-begäran eller till ett svar om *methodresponse* är sant. *params* kan vara antingen en tupel av argument eller en instans av undantagsklassen :exc:`Fault`. Om *methodresponse* är true kan endast ett enda värde returneras, vilket innebär att *params* måste ha längden 1. *encoding*, om det anges, är den kodning som ska användas i den XML som genereras; standard är UTF-8. Pythons :const:`None`-värde kan inte användas i standard XML-RPC; för att tillåta att det används via ett tillägg, ange ett true-värde för *allow_none*.

source: Convert an XML-RPC request or response into Python objects, a ``(params, methodname)``. *params* is a tuple of argument; *methodname* is a string, or ``None`` if no method name is present in the packet. If the XML-RPC packet represents a fault condition, this function will raise a :exc:`Fault` exception. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default.
sv: Konverterar en XML-RPC-begäran eller ett svar till Python-objekt, en ``(params, methodname)``. *params* är en tupel av argument; *methodname* är en sträng, eller ``None`` om inget metodnamn finns i paketet. Om XML-RPC-paketet representerar ett feltillstånd, kommer denna funktion att ge upphov till ett :exc:`Fault` undantag. Flaggan *use_builtin_types* kan användas för att få datum/tidsvärden att presenteras som :class:`datetime.datetime`-objekt och binära data att presenteras som :class:`bytes`-objekt; denna flagga är falsk som standard.

source: The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
sv: Den föråldrade flaggan *use_datetime* liknar *use_builtin_types* men gäller bara för datum-/tidsvärden.

source: Example of Client Usage
sv: Exempel på klientanvändning

source: # simple test program (from the XML-RPC specification) from xmlrpc.client import ServerProxy, Error # server = ServerProxy("http://localhost:8000") # local server with ServerProxy("http://betty.userland.com") as proxy: print(proxy) try: print(proxy.examples.getStateName(41)) except Error as v: print("ERROR", v)
sv: # enkelt testprogram (från XML-RPC-specifikationen) from xmlrpc.client import ServerProxy, Fel # server = ServerProxy("http://localhost:8000") # lokal server med ServerProxy("http://betty.userland.com") som proxy: print(proxy) försök: print(proxy.examples.getStateName(41)) except Error as v: print("ERROR", v)

source: To access an XML-RPC server through a HTTP proxy, you need to define a custom transport. The following example shows how::
sv: Om du vill komma åt en XML-RPC-server via en HTTP-proxy måste du definiera en anpassad transport. Följande exempel visar hur::

source: Example of Client and Server Usage
sv: Exempel på användning av klient och server

source: See :ref:`simplexmlrpcserver-example`.
sv: Se :ref:`simplexmlrpcserver-example`.

source: Footnotes
sv: Fotnoter

source: This approach has been first presented in `a discussion on xmlrpc.com <https://web.archive.org/web/20060624230303/http://www.xmlrpc.com/discuss/msgReader$1208?mode=topic>`_.
sv: Detta tillvägagångssätt presenterades för första gången i en diskussion på xmlrpc.com <https://web.archive.org/web/20060624230303/http://www.xmlrpc.com/discuss/msgReader$1208?mode=topic>`_.
