Repository: yeager/python-docs-sv
Catalog: library/zipapp.po
Languages: sv

source: If an application archive has a shebang line, it may have the executable bit set on POSIX systems, to allow it to be executed directly.
sv: Om ett programarkiv har en shebang-rad kan den ha den exekverbara biten inställd på POSIX-system, så att den kan köras direkt.

source: There is no requirement that the tools in this module are used to create application archives - the module is a convenience, but archives in the above format created by any means are acceptable to Python.
sv: Det finns inget krav på att verktygen i denna modul används för att skapa applikationsarkiv - modulen är en bekvämlighet, men arkiv i ovanstående format som skapats på något sätt är acceptabla för Python.

source: Executable Zip Files
sv: Exekverbara zip-filer
