Repository: yeager/python-docs-sv
Catalog: library/zipapp.po
Languages: sv

source: :mod:`!zipapp` --- Manage executable Python zip archives
sv: :mod:`!zipapp` --- Hantera körbara Python zip-arkiv

source: **Source code:** :source:`Lib/zipapp.py`
sv: **Källkod:** :source:`Lib/zipapp.py`

source: This module provides tools to manage the creation of zip files containing Python code, which can be :ref:`executed directly by the Python interpreter <using-on-interface-options>`. The module provides both a :ref:`zipapp-command-line-interface` and a :ref:`zipapp-python-api`.
sv: Den här modulen tillhandahåller verktyg för att hantera skapandet av zip-filer som innehåller Python-kod, som kan :ref:``exekveras direkt av Python-tolken <using-on-interface-options>`. Modulen tillhandahåller både ett :ref:`zipapp-command-line-interface` och ett :ref:`zipapp-python-api`.

source: Basic Example
sv: Grundläggande exempel

source: The following example shows how the :ref:`zipapp-command-line-interface` can be used to create an executable archive from a directory containing Python code. When run, the archive will execute the ``main`` function from the module ``myapp`` in the archive.
sv: Följande exempel visar hur :ref:`zipapp-command-line-interface` kan användas för att skapa ett körbart arkiv från en katalog som innehåller Python-kod. När arkivet körs kommer det att exekvera funktionen ``main`` från modulen ``myapp`` i arkivet.

source: Command-Line Interface
sv: Kommandoradsgränssnitt

source: When called as a program from the command line, the following form is used:
sv: När ett program anropas från kommandoraden används följande form:

source: $ python -m zipapp source [options]
sv: $ python -m zipapp källa [alternativ]

source: If *source* is a directory, this will create an archive from the contents of *source*. If *source* is a file, it should be an archive, and it will be copied to the target archive (or the contents of its shebang line will be displayed if the --info option is specified).
sv: Om *källa* är en katalog skapas ett arkiv från innehållet i *källa*. Om *källa* är en fil bör den vara ett arkiv och kopieras till målarkivet (eller så visas innehållet i dess shebang-rad om alternativet --info har angetts).

source: The following options are understood:
sv: Följande alternativ är möjliga:

source: Write the output to a file named *output*. If this option is not specified, the output filename will be the same as the input *source*, with the extension ``.pyz`` added. If an explicit filename is given, it is used as is (so a ``.pyz`` extension should be included if required).
sv: Skriv utdata till en fil med namnet *output*. Om detta alternativ inte anges kommer filnamnet för utdata att vara detsamma som för indata *källa*, med tillägget ``.pyz``. Om ett explicit filnamn anges används det som det är (så ett tillägg ``.pyz`` bör inkluderas om så krävs).

source: An output filename must be specified if the *source* is an archive (and in that case, *output* must not be the same as *source*).
sv: Ett filnamn för utdata måste anges om *källan* är ett arkiv (och i så fall får *utdata* inte vara samma som *källan*).

source: Add a ``#!`` line to the archive specifying *interpreter* as the command to run. Also, on POSIX, make the archive executable. The default is to write no ``#!`` line, and not make the file executable.
sv: Lägg till en ``#!``-rad i arkivet som anger *interpreter* som det kommando som ska köras. Gör även arkivet körbart på POSIX. Standardinställningen är att inte skriva någon ``#!``-rad och inte göra filen körbar.

source: Write a ``__main__.py`` file to the archive that executes *mainfn*. The *mainfn* argument should have the form "pkg.mod:fn", where "pkg.mod" is a package/module in the archive, and "fn" is a callable in the given module. The ``__main__.py`` file will execute that callable.
sv: Skriv en fil med namnet ``__main__.py`` till arkivet som kör *mainfn*. Argumentet *mainfn* ska ha formen "pkg.mod:fn", där "pkg.mod" är ett paket/en modul i arkivet och "fn" är en anropbar funktion i den givna modulen. Filen ``__main__.py`` kommer att exekvera den anropbara filen.

source: :option:`--main` cannot be specified when copying an archive.
sv: :option:`--main` kan inte anges vid kopiering av ett arkiv.

source: Compress files with the deflate method, reducing the size of the output file. By default, files are stored uncompressed in the archive.
sv: Komprimera filer med deflate-metoden, vilket minskar storleken på utdatafilen. Som standard lagras filerna okomprimerade i arkivet.

source: :option:`--compress` has no effect when copying an archive.
sv: :option:`--compress` har ingen effekt vid kopiering av ett arkiv.

source: Display the interpreter embedded in the archive, for diagnostic purposes. In this case, any other options are ignored and SOURCE must be an archive, not a directory.
sv: Visar tolken som är inbäddad i arkivet, för diagnostiska ändamål. I det här fallet ignoreras alla andra alternativ och SOURCE måste vara ett arkiv, inte en katalog.

source: Print a short usage message and exit.
sv: Skriv ut ett kort användarmeddelande och avsluta.

source: The module defines two convenience functions:
sv: Modulen definierar två bekvämlighetsfunktioner:

source: Create an application archive from *source*. The source can be any of the following:
sv: Skapa ett applikationsarkiv från *källa*. Källan kan vara något av följande:

source: The name of a directory, or a :term:`path-like object` referring to a directory, in which case a new application archive will be created from the content of that directory.
sv: Namnet på en katalog, eller ett :term:`path-like object` som hänvisar till en katalog, i vilket fall ett nytt applikationsarkiv skapas från innehållet i den katalogen.

source: The name of an existing application archive file, or a :term:`path-like object` referring to such a file, in which case the file is copied to the target (modifying it to reflect the value given for the *interpreter* argument). The file name should include the ``.pyz`` extension, if required.
sv: Namnet på en befintlig applikationsarkivfil eller ett :term:`path-like object` som hänvisar till en sådan fil, varvid filen kopieras till målet (och ändras så att den återspeglar det värde som anges för argumentet *interpreter*). Filnamnet bör innehålla tillägget ``.pyz``, om så krävs.

source: A file object open for reading in bytes mode. The content of the file should be an application archive, and the file object is assumed to be positioned at the start of the archive.
sv: Ett filobjekt som är öppet för läsning i bytesläge. Filens innehåll bör vara ett applikationsarkiv, och filobjektet antas vara placerat i början av arkivet.

source: The *target* argument determines where the resulting archive will be written:
sv: Argumentet *target* bestämmer var det resulterande arkivet ska skrivas:

source: If it is the name of a file, or a :term:`path-like object`, the archive will be written to that file.
sv: Om det är namnet på en fil, eller ett :term:`path-like object`, skrivs arkivet till den filen.

source: If it is an open file object, the archive will be written to that file object, which must be open for writing in bytes mode.
sv: Om det är ett öppet filobjekt kommer arkivet att skrivas till det filobjektet, som måste vara öppet för skrivning i bytesläge.

source: If the target is omitted (or ``None``), the source must be a directory and the target will be a file with the same name as the source, with a ``.pyz`` extension added.
sv: Om målet utelämnas (eller ``None``) måste källan vara en katalog och målet kommer att vara en fil med samma namn som källan, med tillägget ``.pyz``.

source: The *interpreter* argument specifies the name of the Python interpreter with which the archive will be executed. It is written as a "shebang" line at the start of the archive. On POSIX, this will be interpreted by the OS, and on Windows it will be handled by the Python launcher. Omitting the *interpreter* results in no shebang line being written. If an interpreter is specified, and the target is a filename, the executable bit of the target file will be set.
sv: Argumentet *interpreter* anger namnet på den Python-tolk som arkivet ska köras med. Det skrivs som en "shebang"-rad i början av arkivet. På POSIX tolkas detta av operativsystemet, och på Windows hanteras det av Python-startprogrammet. Om *tolk* utelämnas skrivs ingen shebang-rad. Om en tolk anges och målet är ett filnamn, kommer den körbara biten i målfilen att sättas.

source: The *main* argument specifies the name of a callable which will be used as the main program for the archive. It can only be specified if the source is a directory, and the source does not already contain a ``__main__.py`` file. The *main* argument should take the form "pkg.module:callable" and the archive will be run by importing "pkg.module" and executing the given callable with no arguments. It is an error to omit *main* if the source is a directory and does not contain a ``__main__.py`` file, as otherwise the resulting archive would not be executable.
sv: Argumentet *main* anger namnet på en anropbar fil som kommer att användas som huvudprogram för arkivet. Det kan bara anges om källan är en katalog och om källan inte redan innehåller en fil med namnet ``__main__.py``. Argumentet *main* bör ha formen "pkg.module:callable" och arkivet kommer att köras genom att importera "pkg.module" och köra den angivna callable utan argument. Det är ett fel att utelämna *main* om källan är en katalog och inte innehåller filen ``__main__.py``, eftersom det resulterande arkivet annars inte skulle vara körbart.

source: The optional *filter* argument specifies a callback function that is passed a Path object representing the path to the file being added (relative to the source directory). It should return ``True`` if the file is to be added.
sv: Det valfria argumentet *filter* anger en callback-funktion som får ett Path-objekt som representerar sökvägen till den fil som ska läggas till (i förhållande till källkatalogen). Den ska returnera ``True`` om filen ska läggas till.

source: The optional *compressed* argument determines whether files are compressed. If set to ``True``, files in the archive are compressed with the deflate method; otherwise, files are stored uncompressed. This argument has no effect when copying an existing archive.
sv: Det valfria argumentet *compressed* avgör om filerna ska komprimeras. Om värdet är ``True`` komprimeras filerna i arkivet med deflate-metoden, annars lagras filerna okomprimerade. Detta argument har ingen effekt vid kopiering av ett befintligt arkiv.

source: If a file object is specified for *source* or *target*, it is the caller's responsibility to close it after calling create_archive.
sv: Om ett filobjekt anges för *source* eller *target* är det anroparens ansvar att stänga det efter anropet av create_archive.

source: When copying an existing archive, file objects supplied only need ``read`` and ``readline``, or ``write`` methods. When creating an archive from a directory, if the target is a file object it will be passed to the ``zipfile.ZipFile`` class, and must supply the methods needed by that class.
sv: Vid kopiering av ett befintligt arkiv behöver filobjekt som levereras endast metoderna ``read`` och ``readline`` eller ``write``. När du skapar ett arkiv från en katalog, om målet är ett filobjekt, kommer det att skickas till klassen ``zipfile.ZipFile``, och måste tillhandahålla de metoder som behövs av den klassen.

source: Added the *filter* and *compressed* parameters.
sv: Parametrarna *filter* och *compressed* har lagts till.

source: Return the interpreter specified in the ``#!`` line at the start of the archive. If there is no ``#!`` line, return :const:`None`. The *archive* argument can be a filename or a file-like object open for reading in bytes mode. It is assumed to be at the start of the archive.
sv: Returnerar den tolk som anges på ``#!``-raden i början av arkivet. Om det inte finns någon ``#!``-rad returneras :const:`None`. Argumentet *archive* kan vara ett filnamn eller ett filliknande objekt som är öppet för läsning i bytesläge. Det antas befinna sig i början av arkivet.

source: Examples
sv: Exempel

source: Pack up a directory into an archive, and run it.
sv: Packa ihop en katalog till ett arkiv och kör det.

source: The same can be done using the :func:`create_archive` function::
sv: Samma sak kan göras med hjälp av funktionen :func:`create_archive`::

source: To make the application directly executable on POSIX, specify an interpreter to use.
sv: Om du vill att programmet ska kunna köras direkt på POSIX anger du en tolk som ska användas.

source: To replace the shebang line on an existing archive, create a modified archive using the :func:`create_archive` function::
sv: För att ersätta shebang-raden i ett befintligt arkiv, skapa ett modifierat arkiv med hjälp av :func:`create_archive`-funktionen::

source: To update the file in place, do the replacement in memory using a :class:`~io.BytesIO` object, and then overwrite the source afterwards. Note that there is a risk when overwriting a file in place that an error will result in the loss of the original file. This code does not protect against such errors, but production code should do so. Also, this method will only work if the archive fits in memory::
sv: Om du vill uppdatera filen på plats gör du ersättningen i minnet med hjälp av ett :class:`~io.BytesIO`-objekt och skriver sedan över källan efteråt. Observera att det finns en risk när du skriver över en fil på plats att ett fel leder till att originalfilen går förlorad. Den här koden skyddar inte mot sådana fel, men produktionskoden bör göra det. Dessutom fungerar denna metod endast om arkivet ryms i memory::

source: >>> import zipapp >>> import io >>> temp = io.BytesIO() >>> zipapp.create_archive('myapp.pyz', temp, '/usr/bin/python2') >>> with open('myapp.pyz', 'wb') as f: >>> f.write(temp.getvalue())
sv: >>> import zipapp >>> import io >>> temp = io.BytesIO() >>> zipapp.create_archive('myapp.pyz', temp, '/usr/bin/python2') >>> med open('myapp.pyz', 'wb') som f: >>> f.write(temp.getvalue())

source: Specifying the Interpreter
sv: Specificering av tolkprogrammet

source: Note that if you specify an interpreter and then distribute your application archive, you need to ensure that the interpreter used is portable. The Python launcher for Windows supports most common forms of POSIX ``#!`` line, but there are other issues to consider:
sv: Observera att om du anger en tolk och sedan distribuerar ditt programarkiv måste du se till att den tolk som används är portabel. Python-startprogrammet för Windows stöder de vanligaste formerna av POSIX ``#!``-raden, men det finns andra problem att ta hänsyn till:

source: If you use "/usr/bin/env python" (or other forms of the "python" command, such as "/usr/bin/python"), you need to consider that your users may have either Python 2 or Python 3 as their default, and write your code to work under both versions.
sv: Om du använder "/usr/bin/env python" (eller andra former av kommandot "python", till exempel "/usr/bin/python") måste du tänka på att dina användare kan ha antingen Python 2 eller Python 3 som standard, och skriva din kod så att den fungerar under båda versionerna.

source: If you use an explicit version, for example "/usr/bin/env python3" your application will not work for users who do not have that version. (This may be what you want if you have not made your code Python 2 compatible).
sv: Om du använder en explicit version, t.ex. "/usr/bin/env python3", kommer din applikation inte att fungera för användare som inte har den versionen. (Detta kan vara vad du vill om du inte har gjort din kod Python 2-kompatibel).

source: There is no way to say "python X.Y or later", so be careful of using an exact version like "/usr/bin/env python3.4" as you will need to change your shebang line for users of Python 3.5, for example.
sv: Det finns inget sätt att säga "python X.Y eller senare", så var försiktig med att använda en exakt version som "/usr/bin/env python3.4" eftersom du kommer att behöva ändra din shebang-rad för användare av Python 3.5, till exempel.

source: Typically, you should use an "/usr/bin/env python2" or "/usr/bin/env python3", depending on whether your code is written for Python 2 or 3.
sv: Vanligtvis bör du använda en "/usr/bin/env python2" eller "/usr/bin/env python3", beroende på om din kod är skriven för Python 2 eller 3.

source: Creating Standalone Applications with zipapp
sv: Skapa fristående program med zipapp

source: Using the :mod:`zipapp` module, it is possible to create self-contained Python programs, which can be distributed to end users who only need to have a suitable version of Python installed on their system. The key to doing this is to bundle all of the application's dependencies into the archive, along with the application code.
sv: Med modulen :mod:`zipapp` är det möjligt att skapa självständiga Python-program som kan distribueras till slutanvändare som bara behöver ha en lämplig version av Python installerad på sitt system. Nyckeln till att göra detta är att paketera alla applikationens beroenden i arkivet, tillsammans med applikationskoden.

source: The steps to create a standalone archive are as follows:
sv: Så här går du tillväga för att skapa ett fristående arkiv:

source: Create your application in a directory as normal, so you have a ``myapp`` directory containing a ``__main__.py`` file, and any supporting application code.
sv: Skapa din applikation i en katalog som vanligt, så att du har en ``myapp``-katalog som innehåller en ``__main__.py``-fil och eventuell stödjande applikationskod.

source: Install all of your application's dependencies into the ``myapp`` directory, using pip:
sv: Installera alla beroenden för din applikation i katalogen ``myapp`` med hjälp av pip:

source: (this assumes you have your project requirements in a ``requirements.txt`` file - if not, you can just list the dependencies manually on the pip command line).
sv: (detta förutsätter att du har dina projektkrav i en fil ``requirements.txt`` - om inte, kan du bara lista beroendena manuellt på pip-kommandoraden).

source: Package the application using:
sv: Paketera ansökan med hjälp av:

source: $ python -m zipapp -p "interpreter" myapp
sv: $ python -m zipapp -p "tolk" myapp

source: This will produce a standalone executable, which can be run on any machine with the appropriate interpreter available. See :ref:`zipapp-specifying-the-interpreter` for details. It can be shipped to users as a single file.
sv: Detta ger en fristående körbar fil som kan köras på vilken maskin som helst med lämplig tolk tillgänglig. Se :ref:`zipapp-specifying-the-interpreter` för mer information. Den kan skickas till användare som en enda fil.

source: On Unix, the ``myapp.pyz`` file is executable as it stands. You can rename the file to remove the ``.pyz`` extension if you prefer a "plain" command name. On Windows, the ``myapp.pyz[w]`` file is executable by virtue of the fact that the Python interpreter registers the ``.pyz`` and ``.pyzw`` file extensions when installed.
sv: På Unix är filen ``myapp.pyz`` körbar som den är. Du kan byta namn på filen så att tillägget ``.pyz`` tas bort om du föredrar ett "vanligt" kommandonamn. På Windows är filen ``myapp.pyz[w]`` körbar eftersom Python-tolken registrerar filtilläggen ``.pyz`` och ``.pyzw`` när den installeras.

source: Caveats
sv: Förbehåll

source: If your application depends on a package that includes a C extension, that package cannot be run from a zip file (this is an OS limitation, as executable code must be present in the filesystem for the OS loader to load it). In this case, you can exclude that dependency from the zipfile, and either require your users to have it installed, or ship it alongside your zipfile and add code to your ``__main__.py`` to include the directory containing the unzipped module in ``sys.path``. In this case, you will need to make sure to ship appropriate binaries for your target architecture(s) (and potentially pick the correct version to add to ``sys.path`` at runtime, based on the user's machine).
sv: Om ditt program är beroende av ett paket som innehåller ett C-tillägg kan det paketet inte köras från en zip-fil (detta är en OS-begränsning, eftersom körbar kod måste finnas i filsystemet för att OS-laddaren ska kunna ladda den). I det här fallet kan du utesluta det beroendet från zip-filen och antingen kräva att dina användare har det installerat, eller skicka det tillsammans med din zip-fil och lägga till kod i din ``__main__.py`` för att inkludera katalogen som innehåller den uppackade modulen i ``sys.path``. I det här fallet måste du se till att leverera lämpliga binärfiler för din målarkitektur (och eventuellt välja rätt version att lägga till i ``sys.path`` vid körning, baserat på användarens maskin).

source: The Python Zip Application Archive Format
sv: Python Zip Application Arkivformat

source: Python has been able to execute zip files which contain a ``__main__.py`` file since version 2.6. In order to be executed by Python, an application archive simply has to be a standard zip file containing a ``__main__.py`` file which will be run as the entry point for the application. As usual for any Python script, the parent of the script (in this case the zip file) will be placed on :data:`sys.path` and thus further modules can be imported from the zip file.
sv: Python har kunnat exekvera zip-filer som innehåller filen ``__main__.py`` sedan version 2.6. För att kunna köras av Python måste ett applikationsarkiv helt enkelt vara en standard zip-fil som innehåller filen ``__main__.py`` som kommer att köras som startpunkt för applikationen. Som vanligt för alla Python-skript kommer skriptets överordnade fil (i det här fallet zip-filen) att placeras på :data:`sys.path` och därmed kan ytterligare moduler importeras från zip-filen.

source: The zip file format allows arbitrary data to be prepended to a zip file. The zip application format uses this ability to prepend a standard POSIX "shebang" line to the file (``#!/path/to/interpreter``).
sv: Med zip-filformatet kan godtyckliga data prependlas till en zip-fil. Zip-applikationsformatet använder denna möjlighet för att lägga till en standard POSIX "shebang"-rad till filen (``#!/path/to/interpreter``).

source: Formally, the Python zip application format is therefore:
sv: Formellt är Python zip-applikationsformatet därför:

source: An optional shebang line, containing the characters ``b'#!'`` followed by an interpreter name, and then a newline (``b'\n'``) character. The interpreter name can be anything acceptable to the OS "shebang" processing, or the Python launcher on Windows. The interpreter should be encoded in UTF-8 on Windows, and in :func:`sys.getfilesystemencoding` on POSIX.
sv: En valfri shebang-rad som innehåller tecknen ``b'#!'`` följt av ett tolknamn och sedan ett nytt radtecken (``b'\n'``). Tolknamnet kan vara vad som helst som är acceptabelt för OS:ets "shebang"-behandling eller Python-startprogrammet i Windows. Tolken bör kodas i UTF-8 på Windows, och i :func:`sys.getfilesystemencoding` på POSIX.

source: Standard zipfile data, as generated by the :mod:`zipfile` module. The zipfile content *must* include a file called ``__main__.py`` (which must be in the "root" of the zipfile - i.e., it cannot be in a subdirectory). The zipfile data can be compressed or uncompressed.
sv: Standard zipfile-data, som genereras av modulen :mod:`zipfile`. Innehållet i zipfilen *måste* innehålla en fil som heter ``__main__.py`` (som måste ligga i "roten" av zipfilen - dvs. den kan inte ligga i en underkatalog). Zipfilens data kan vara komprimerad eller okomprimerad.
