Repository: yeager/python-docs-sv
Catalog: using/android.po
Languages: sv

source: Using Python on Android
sv: Använda Python på Android

source: Python on Android is unlike Python on desktop platforms. On a desktop platform, Python is generally installed as a system resource that can be used by any user of that computer. Users then interact with Python by running a :program:`python` executable and entering commands at an interactive prompt, or by running a Python script.
sv: Python på Android är olikt Python på stationära plattformar. På en stationär plattform installeras Python i allmänhet som en systemresurs som kan användas av alla användare av den datorn. Användare interagerar sedan med Python genom att köra en körbar :program:`python` och ange kommandon i en interaktiv prompt, eller genom att köra ett Python-skript.

source: On Android, there is no concept of installing as a system resource. The only unit of software distribution is an "app". There is also no console where you could run a :program:`python` executable, or interact with a Python REPL.
sv: På Android finns det inget koncept för installation som en systemresurs. Den enda enheten för distribution av programvara är en "app". Det finns inte heller någon konsol där du kan köra en :program:`python`-körbar fil eller interagera med en Python REPL.

source: As a result, the only way you can use Python on Android is in embedded mode – that is, by writing a native Android application, embedding a Python interpreter using ``libpython``, and invoking Python code using the :ref:`Python embedding API <embedding>`. The full Python interpreter, the standard library, and all your Python code is then packaged into your app for its own private use.
sv: Som ett resultat är det enda sättet du kan använda Python på Android i inbäddat läge - det vill säga genom att skriva en inbyggd Android-applikation, bädda in en Python-tolk med ``libpython`` och anropa Python-kod med :ref:`Python embedding API <embedding>`. Den fullständiga Python-tolken, standardbiblioteket och all din Python-kod paketeras sedan i din app för eget privat bruk.

source: The Python standard library has some notable omissions and restrictions on Android. See the :ref:`API availability guide <mobile-availability>` for details.
sv: Pythons standardbibliotek har några anmärkningsvärda utelämnanden och begränsningar på Android. Se :ref:`API availability guide <mobile-availability>` för mer information.

source: Adding Python to an Android app
sv: Lägga till Python i en Android-app

source: Most app developers should use one of the following tools, which will provide a much easier experience:
sv: De flesta apputvecklare bör använda något av följande verktyg, som ger en mycket enklare upplevelse:

source: `Briefcase <https://briefcase.readthedocs.io>`__, from the BeeWare project
sv: `Briefcase <https://briefcase.readthedocs.io>`__, från BeeWare-projektet

source: `Buildozer <https://buildozer.readthedocs.io>`__, from the Kivy project
sv: `Buildozer <https://buildozer.readthedocs.io>`__, från Kivy-projektet

source: If you're sure you want to do all of this manually, read on. You can use the :source:`testbed app <Android/testbed>` as a guide; each step below contains a link to the relevant file.
sv: Om du är säker på att du vill göra allt detta manuellt kan du läsa vidare. Du kan använda :source:`testbed app <Android/testbed>` som en guide; varje steg nedan innehåller en länk till den relevanta filen.

source: Build Python by following the instructions in :source:`Android/README.md`. This will create the directory ``cross-build/HOST/prefix``.
sv: Bygg Python genom att följa instruktionerna i :source:`Android/README.md`. Detta kommer att skapa katalogen ``cross-build/HOST/prefix``.

source: Add code to your :source:`build.gradle <Android/testbed/app/build.gradle.kts>` file to copy the following items into your project. All except your own Python code can be copied from ``prefix/lib``:
sv: Lägg till kod i din :source:`build.gradle <Android/testbed/app/build.gradle.kts>`-fil för att kopiera följande objekt till ditt projekt. Allt utom din egen Python-kod kan kopieras från ``prefix/lib``:

source: In your JNI libraries:
sv: I dina JNI-bibliotek:

source: ``lib*_python.so`` (external libraries such as OpenSSL)
sv: ``lib*_python.so`` (externa bibliotek som t.ex. OpenSSL)

source: In your assets:
sv: I dina tillgångar:

source: ``python*.*`` (the Python standard library)
sv: ``python*.*`` (Pythons standardbibliotek)

source: ``python*.*/site-packages`` (your own Python code)
sv: ``python*.*/site-packages`` (din egen Python-kod)

source: Add code to your app to :source:`extract the assets to the filesystem <Android/testbed/app/src/main/java/org/python/testbed/MainActivity.kt>`.
sv: Lägg till kod i din app för att :source:`extrahera tillgångarna till filsystemet <Android/testbed/app/src/main/java/org/python/testbed/MainActivity.kt>`.

source: Add code to your app to :source:`start Python in embedded mode <Android/testbed/app/src/main/c/main_activity.c>`. This will need to be C code called via JNI.
sv: Lägg till kod i din app för att :source:`starta Python i inbäddat läge <Android/testbed/app/src/main/c/main_activity.c>`. Detta kommer att behöva vara C-kod som anropas via JNI.

source: Building a Python package for Android
sv: Bygga ett Python-paket för Android

source: Python packages can be built for Android as wheels and released on PyPI. The recommended tool for doing this is `cibuildwheel <https://cibuildwheel.pypa.io/en/stable/platforms/#android>`__, which automates all the details of setting up a cross-compilation environment, building the wheel, and testing it on an emulator.
sv: Python-paket kan byggas för Android som hjul och släppas på PyPI. Det rekommenderade verktyget för att göra detta är `cibuildwheel <https://cibuildwheel.pypa.io/en/stable/platforms/#android>`__, som automatiserar alla detaljer för att ställa in en korskompileringsmiljö, bygga hjulet och testa det på en emulator.
