Repository: yeager/python-docs-sv
Catalog: using/cmdline.po
Languages: sv

source: Configuring one of these locales (either explicitly or via the above implicit locale coercion) automatically enables the ``surrogateescape`` :ref:`error handler <error-handlers>` for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in any other locale). This stream handling behavior can be overridden using :envvar:`PYTHONIOENCODING` as usual.
sv: Om du konfigurerar en av dessa lokala (antingen explicit eller via ovanstående implicita lokala tvång) aktiveras automatiskt ``surrogateescape`` :ref:`error handler <error-handlers>` för :data:`sys.stdin` och :data:`sys.stdout` (:data:`sys.stderr` fortsätter att använda ``backslashreplace`` som det gör i alla andra lokala). Detta flödeshanteringsbeteende kan åsidosättas genom att använda :envvar:`PYTHONIOENCODING` som vanligt.

source: For debugging purposes, setting ``PYTHONCOERCECLOCALE=warn`` will cause Python to emit warning messages on ``stderr`` if either the locale coercion activates, or else if a locale that *would* have triggered coercion is still active when the Python runtime is initialized.
sv: För felsökningsändamål kommer inställningen ``PYTHONCOERCECLOCALE=warn`` att få Python att avge varningsmeddelanden på ``stderr`` om antingen locale coercion aktiveras, eller om en locale som *skulle* ha utlöst coercion fortfarande är aktiv när Python runtime initieras.

source: Also note that even when locale coercion is disabled, or when it fails to find a suitable target locale, :envvar:`PYTHONUTF8` will still activate by default in legacy ASCII-based locales. Both features must be disabled in order to force the interpreter to use ``ASCII`` instead of ``UTF-8`` for system interfaces.
sv: Observera också att även när locale coercion är inaktiverat, eller när det misslyckas med att hitta en lämplig mål locale, kommer :envvar:`PYTHONUTF8` fortfarande att aktiveras som standard i äldre ASCII-baserade locales. Båda funktionerna måste inaktiveras för att tvinga tolken att använda ``ASCII`` i stället för ``UTF-8`` för systemgränssnitt.

source: See :pep:`538` for more details.
sv: Se :pep:`538` för mer information.

source: If this environment variable is set to a non-empty string, enable :ref:`Python Development Mode <devmode>`, introducing additional runtime checks that are too expensive to be enabled by default. This is equivalent to setting the :option:`-X` ``dev`` option.
sv: Om denna miljövariabel är satt till en icke-tom sträng, aktivera :ref:`Python Development Mode <devmode>`, vilket introducerar ytterligare körtidskontroller som är för dyra för att vara aktiverade som standard. Detta är likvärdigt med att ställa in :option:`-X` ``dev`` option.

source: If set to ``1``, enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
sv: Om inställningen är ``1``, aktiveras :ref:`Python UTF-8 Mode <utf8-mode>`.

source: If set to ``0``, disable the :ref:`Python UTF-8 Mode <utf8-mode>`.
sv: Om inställningen är ``0``, inaktiveras :ref:`Python UTF-8 Mode <utf8-mode>`.

source: Setting any other non-empty string causes an error during interpreter initialisation.
sv: Om du anger någon annan icke-tom sträng uppstår ett fel under initieringen av tolken.

source: If this environment variable is set to a non-empty string, issue a :class:`EncodingWarning` when the locale-specific default encoding is used.
sv: Om denna miljövariabel är inställd på en icke-tom sträng, utfärda en :class:`EncodingWarning` när den lokalspecifika standardkodningen används.

source: See :ref:`io-encoding-warning` for details.
sv: Se :ref:`io-encoding-warning` för mer information.

source: If this variable is set, it disables the inclusion of the tables mapping extra location information (end line, start column offset and end column offset) to every instruction in code objects. This is useful when smaller code objects and pyc files are desired as well as suppressing the extra visual location indicators when the interpreter displays tracebacks.
sv: Om den här variabeln är inställd inaktiveras inkluderingen av tabeller som mappar extra platsinformation (slutrad, startkolumnoffset och slutkolumnoffset) till varje instruktion i kodobjekt. Detta är användbart när mindre kodobjekt och pyc-filer önskas samt för att undertrycka de extra visuella platsindikatorerna när tolken visar spårningar.

source: If this variable is set to a nonzero value, it enables support for the Linux ``perf`` profiler so Python calls can be detected by it.
sv: Om den här variabeln har ett värde som inte är noll aktiveras stöd för Linux profiler ``perf`` så att Python-anrop kan upptäckas av den.

source: If set to ``0``, disable Linux ``perf`` profiler support.
sv: Om inställningen är ``0``, inaktiveras Linux ``perf`` profileringsstöd.

source: See also the :option:`-X perf <-X>` command-line option and :ref:`perf_profiling`.
sv: Se även kommandoradsalternativet :option:`-X perf <-X>` och :ref:`perf_profiling`.

source: If this variable is set to a nonzero value, it enables support for the Linux ``perf`` profiler so Python calls can be detected by it using DWARF information.
sv: Om den här variabeln har ett värde som inte är noll aktiveras stöd för Linux profiler ``perf`` så att Python-anrop kan upptäckas med hjälp av DWARF-information.

source: See also the :option:`-X perf_jit <-X>` command-line option and :ref:`perf_profiling`.
sv: Se även kommandoradsalternativet :option:`-X perf_jit <-X>` och :ref:`perf_profiling`.

source: If this variable is set to a non-empty string, it disables the remote debugging feature described in :pep:`768`. This includes both the functionality to schedule code for execution in another process and the functionality to receive code for execution in the current process.
sv: Om den här variabeln är inställd på en icke-tom sträng inaktiveras funktionen för fjärravläsning som beskrivs i :pep:`768`. Detta inkluderar både funktionen för att schemalägga kod för exekvering i en annan process och funktionen för att ta emot kod för exekvering i den aktuella processen.

source: See also the :option:`-X disable_remote_debug` command-line option.
sv: Se även kommandoradsalternativet :option:`-X disable_remote_debug`.

source: If this variable is set to a positive integer, it overrides the return values of :func:`os.cpu_count` and :func:`os.process_cpu_count`.
sv: Om denna variabel är inställd på ett positivt heltal åsidosätter den returvärdena för :func:`os.cpu_count` och :func:`os.process_cpu_count`.

source: See also the :option:`-X cpu_count <-X>` command-line option.
sv: Se även kommandoradsalternativet :option:`-X cpu_count <-X>`.

source: If this variable is set to ``on`` or ``off``, it determines whether or not frozen modules are ignored by the import machinery. A value of ``on`` means they get imported and ``off`` means they are ignored. The default is ``on`` for non-debug builds (the normal case) and ``off`` for debug builds. Note that the :mod:`!importlib_bootstrap` and :mod:`!importlib_bootstrap_external` frozen modules are always used, even if this flag is set to ``off``.
sv: Om denna variabel är inställd på ``on`` eller ``off`` avgör den om frysta moduler ignoreras av importmaskineriet eller inte. Ett värde på ``on`` betyder att de importeras och ``off`` betyder att de ignoreras. Standardvärdet är ``on`` för icke-debug-byggnader (normalfallet) och ``off`` för debug-byggnader. Observera att de frysta modulerna :mod:`!importlib_bootstrap` och :mod:`!importlib_bootstrap_external` alltid används, även om flaggan är satt till ``off``.

source: See also the :option:`-X frozen_modules <-X>` command-line option.
sv: Se även kommandoradsalternativet :option:`-X frozen_modules <-X>`.

source: If this variable is set to ``1``, the interpreter will colorize various kinds of output. Setting it to ``0`` deactivates this behavior. See also :ref:`using-on-controlling-color`.
sv: Om denna variabel är inställd på ``1`` kommer tolken att färglägga olika typer av utdata. Om den sätts till ``0`` avaktiveras detta beteende. Se även :ref:`using-on-controlling-color`.

source: If this variable is set to any value, the interpreter will not attempt to load the Python-based :term:`REPL` that requires :mod:`curses` and :mod:`readline`, and will instead use the traditional parser-based :term:`REPL`.
sv: Om den här variabeln har ett valfritt värde kommer tolken inte att försöka ladda den Python-baserade :term:`REPL` som kräver :mod:`curses` och :mod:`readline`, utan istället använda den traditionella parser-baserade :term:`REPL`.

source: This environment variable can be used to set the location of a ``.python_history`` file (by default, it is ``.python_history`` in the user's home directory).
sv: Denna miljövariabel kan användas för att ange platsen för filen ``.python_history`` (som standard är den ``.python_history`` i användarens hemkatalog).

source: If this variable is set to ``1``, the global interpreter lock (GIL) will be forced on. Setting it to ``0`` forces the GIL off (needs Python configured with the :option:`--disable-gil` build option).
sv: Om denna variabel sätts till ``1``, kommer det globala tolklåset (GIL) att tvingas på. Om den sätts till ``0`` tvingas GIL att stängas av (kräver Python konfigurerat med byggalternativet :option:`--disable-gil`).

source: See also the :option:`-X gil <-X>` command-line option, which takes precedence over this variable, and :ref:`whatsnew313-free-threaded-cpython`.
sv: Se även kommandoradsalternativet :option:`-X gil <-X>`, som har företräde framför denna variabel, och :ref:`whatsnew313-free-threaded-cpython`.

source: If this variable is set to ``1`` then :class:`~threading.Thread` will, by default, use a copy of context of the caller of ``Thread.start()`` when starting. Otherwise, new threads will start with an empty context. If unset, this variable defaults to ``1`` on free-threaded builds and to ``0`` otherwise. See also :option:`-X thread_inherit_context<-X>`.
sv: Om denna variabel är inställd på ``1`` kommer :class:`~threading.Thread` som standard att använda en kopia av kontexten för den som anropar ``Thread.start()`` vid start. Annars kommer nya trådar att starta med en tom kontext. Om den här variabeln inte är inställd, är standardvärdet ``1`` på free-threaded builds och annars ``0``. Se även :option:`-X thread_inherit_context<-X>`.

source: If set to ``1`` then the :class:`warnings.catch_warnings` context manager will use a :class:`~contextvars.ContextVar` to store warnings filter state. If unset, this variable defaults to ``1`` on free-threaded builds and to ``0`` otherwise. See :option:`-X context_aware_warnings<-X>`.
sv: Om den är satt till ``1`` kommer kontexthanteraren :class:`warnings.catch_warnings` att använda en :class:`~contextvars.ContextVar` för att lagra filterstatus för varningar. Om den här variabeln inte är inställd är standardvärdet ``1`` på frittrådade byggsystem och annars ``0``. Se :option:`-X context_aware_warnings<-X>`.

source: On builds where experimental just-in-time compilation is available, this variable can force the JIT to be disabled (``0``) or enabled (``1``) at interpreter startup.
sv: På byggsystem där experimentell just-in-time-kompilering är tillgänglig kan denna variabel tvinga JIT att inaktiveras (``0``) eller aktiveras (``1``) vid start av tolken.

source: If set to ``1`` enables thread-local bytecode. If set to ``0`` thread-local bytecode and the specializing interpreter are disabled. Only applies to builds configured with :option:`--disable-gil`.
sv: Om inställningen är ``1`` aktiveras trådlokal bytecode. Om inställningen är ``0`` inaktiveras trådlokal bytecode och den specialiserade tolken. Gäller endast för byggen som konfigurerats med :option:`--disable-gil`.

source: See also the :option:`-X tlbc <-X>` command-line option.
sv: Se även kommandoradsalternativet :option:`-X tlbc <-X>`.

source: Debug-mode variables
sv: Variabler för felsökningsläge

source: If set, Python will dump objects and reference counts still alive after shutting down the interpreter.
sv: Om den är inställd kommer Python att dumpa objekt och referensräkningar som fortfarande är vid liv efter att tolken stängts av.

source: Needs Python configured with the :option:`--with-trace-refs` build option.
sv: Kräver Python konfigurerat med byggalternativet :option:`--with-trace-refs`.

source: If set, Python will dump objects and reference counts still alive after shutting down the interpreter into a file under the path given as the value to this environment variable.
sv: Om den är inställd kommer Python att dumpa objekt och referensräkningar som fortfarande är vid liv efter att tolken stängts av i en fil under den sökväg som anges som värde för denna miljövariabel.

source: If this variable is set to a module, that module will be imported early in the interpreter lifecycle, before the :mod:`site` module is executed, and before the :mod:`__main__` module is created. Therefore, the imported module is not treated as :mod:`__main__`.
sv: Om variabeln är inställd på en modul kommer den modulen att importeras tidigt i tolkens livscykel, innan modulen :mod:`site` exekveras och innan modulen :mod:`__main__` skapas. Därför behandlas den importerade modulen inte som :mod:`__main__`.

source: This can be used to execute code early during Python initialization.
sv: Detta kan användas för att exekvera kod tidigt under Python-initialiseringen.

source: To import a submodule, use ``package.module`` as the value, like in an import statement.
sv: För att importera en undermodul använder du ``package.module`` som värde, precis som i en importsats.

source: See also the :option:`-X presite <-X>` command-line option, which takes precedence over this variable.
sv: Se även kommandoradsalternativet :option:`-X presite <-X>`, som har företräde framför den här variabeln.

source: Needs Python configured with the :option:`--with-pydebug` build option.
sv: Kräver Python konfigurerat med byggalternativet :option:`--with-pydebug`.
