Repository: yeager/python-docs-sv
Catalog: using/cmdline.po
Languages: sv

source: Force the stdout and stderr streams to be unbuffered. This option has no effect on the stdin stream.
sv: Tvinga stdout- och stderr-strömmarna att vara obuffrade. Detta alternativ har ingen effekt på stdin-strömmen.

source: See also :envvar:`PYTHONUNBUFFERED`.
sv: Se även :envvar:`PYTHONUNBUFFERED`.

source: The text layer of the stdout and stderr streams now is unbuffered.
sv: Textlagret i strömmarna stdout och stderr är nu obuffrat.

source: Print a message each time a module is initialized, showing the place (filename or built-in module) from which it is loaded. When given twice (:option:`!-vv`), print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit.
sv: Varje gång en modul initieras skrivs ett meddelande ut som visar varifrån den hämtas (filnamn eller inbyggd modul). Om det anges två gånger (:option:`!-vv`) skrivs ett meddelande ut för varje fil som kontrolleras vid sökning efter en modul. Ger också information om modulrensning vid avslutning.

source: The :mod:`site` module reports the site-specific paths and :file:`.pth` files being processed.
sv: Modulen :mod:`site` rapporterar de platsspecifika sökvägarna och :file:`.pth`-filerna som bearbetas.

source: See also :envvar:`PYTHONVERBOSE`.
sv: Se även :envvar:`PYTHONVERBOSE`.

source: Warning control. Python's warning machinery by default prints warning messages to :data:`sys.stderr`.
sv: Kontroll av varningar. Pythons varningsmekanism skriver som standard ut varningsmeddelanden till :data:`sys.stderr`.

source: The simplest settings apply a particular action unconditionally to all warnings emitted by a process (even those that are otherwise ignored by default)::
sv: De enklaste inställningarna tillämpar en viss åtgärd villkorslöst på alla varningar som utfärdas av en process (även de som annars ignoreras som standard)::

source: -Wdefault # Warn once per call location -Werror # Convert to exceptions -Walways # Warn every time -Wall # Same as -Walways -Wmodule # Warn once per calling module -Wonce # Warn once per Python process -Wignore # Never warn
sv: -Wdefault # Varna en gång per samtalsplats -Werror # Konvertera till undantag -Walways # Varna varje gång -Wall # Samma som -Walways -Wmodule # Varnar en gång per anropande modul -Wonce # Varna en gång per Python-process -Wignore # Varnar aldrig

source: The action names can be abbreviated as desired and the interpreter will resolve them to the appropriate action name. For example, ``-Wi`` is the same as ``-Wignore``.
sv: Åtgärdsnamnen kan förkortas hur mycket som helst och tolken kommer att omvandla dem till rätt åtgärdsnamn. Till exempel är ``-Wi`` samma sak som ``-Wignore``.

source: The full form of argument is::
sv: Den fullständiga formen av argument är::

source: action:message:category:module:lineno
sv: åtgärd:meddelande:kategori:modul:lineno

source: Empty fields match all values; trailing empty fields may be omitted. For example ``-W ignore::DeprecationWarning`` ignores all DeprecationWarning warnings.
sv: Tomma fält matchar alla värden; efterföljande tomma fält kan utelämnas. Till exempel ``-W ignore::DeprecationWarning`` ignorerar alla DeprecationWarning-varningar.

source: The *action* field is as explained above but only applies to warnings that match the remaining fields.
sv: Fältet *action* är som förklarat ovan, men gäller endast för varningar som matchar de övriga fälten.

source: The *message* field must match the whole warning message; this match is case-insensitive.
sv: Fältet *message* måste matcha hela varningsmeddelandet; denna matchning är skiftlägesokänslig.

source: The *category* field matches the warning category (ex: ``DeprecationWarning``). This must be a class name; the match test whether the actual warning category of the message is a subclass of the specified warning category.
sv: Fältet *category* matchar varningskategorin (t.ex. ``DeprecationWarning``). Detta måste vara ett klassnamn; matchningen testar om den faktiska varningskategorin i meddelandet är en underklass till den angivna varningskategorin.

source: The *module* field matches the (fully qualified) module name; this match is case-sensitive.
sv: Fältet *module* matchar det (fullständigt kvalificerade) modulnamnet; denna matchning är skiftlägeskänslig.

source: The *lineno* field matches the line number, where zero matches all line numbers and is thus equivalent to an omitted line number.
sv: Fältet *lineno* matchar radnumret, där noll matchar alla radnummer och därmed är likvärdigt med ett utelämnat radnummer.

source: Multiple :option:`-W` options can be given; when a warning matches more than one option, the action for the last matching option is performed. Invalid :option:`-W` options are ignored (though, a warning message is printed about invalid options when the first warning is issued).
sv: Flera :option:`-W`-alternativ kan anges; när en varning matchar mer än ett alternativ utförs åtgärden för det sista matchande alternativet. Ogiltiga :option:`-W`-alternativ ignoreras (dock skrivs ett varningsmeddelande ut om ogiltiga alternativ när den första varningen utfärdas).

source: Warnings can also be controlled using the :envvar:`PYTHONWARNINGS` environment variable and from within a Python program using the :mod:`warnings` module. For example, the :func:`warnings.filterwarnings` function can be used to use a regular expression on the warning message.
sv: Varningar kan också kontrolleras med hjälp av miljövariabeln :envvar:`PYTHONWARNINGS` och inifrån ett Python-program med hjälp av modulen :mod:`warnings`. Till exempel kan funktionen :func:`warnings.filterwarnings` användas för att använda ett reguljärt uttryck på varningsmeddelandet.

source: See :ref:`warning-filter` and :ref:`describing-warning-filters` for more details.
sv: Se :ref:`warning-filter` och :ref:`describing-warning-filters` för mer information.

source: Skip the first line of the source, allowing use of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
sv: Hoppa över första raden i källan, vilket möjliggör användning av icke-Unix-former av ``#!cmd``. Detta är endast avsett för ett DOS-specifikt hack.

source: Reserved for various implementation-specific options. CPython currently defines the following possible values:
sv: Reserverad för olika implementationsspecifika alternativ. CPython definierar för närvarande följande möjliga värden:

source: ``-X faulthandler`` to enable :mod:`faulthandler`. See also :envvar:`PYTHONFAULTHANDLER`.
sv: ``-X faulthandler`` för att aktivera :mod:`faulthandler`. Se även :envvar:`PYTHONFAULTHANDLER`.

source: ``-X showrefcount`` to output the total reference count and number of used memory blocks when the program finishes or after each statement in the interactive interpreter. This only works on :ref:`debug builds <debug-build>`.
sv: ``-X showrefcount`` för att visa det totala referensantalet och antalet använda minnesblock när programmet avslutas eller efter varje sats i den interaktiva tolken. Detta fungerar endast på :ref:`debug builds <debug-build>`.

source: ``-X tracemalloc`` to start tracing Python memory allocations using the :mod:`tracemalloc` module. By default, only the most recent frame is stored in a traceback of a trace. Use ``-X tracemalloc=NFRAME`` to start tracing with a traceback limit of *NFRAME* frames. See :func:`tracemalloc.start` and :envvar:`PYTHONTRACEMALLOC` for more information.
sv: ``-X tracemalloc`` för att börja spåra Python-minnesallokeringar med hjälp av modulen :mod:`tracemalloc`. Som standard lagras endast den senaste ramen i en traceback för en spårning. Använd ``-X tracemalloc=NFRAME`` för att starta spårning med en spårningsgräns på *NFRAME* ramar. Se :func:`tracemalloc.start` och :envvar:`PYTHONTRACEMALLOC` för mer information.

source: ``-X int_max_str_digits`` configures the :ref:`integer string conversion length limitation <int_max_str_digits>`. See also :envvar:`PYTHONINTMAXSTRDIGITS`.
sv: ``-X int_max_str_digits`` konfigurerar :ref:``begränsning av längden för konvertering av heltalssträngar <int_max_str_digits>`. Se även :envvar:`PYTHONINTMAXSTRDIGITS`.

source: ``-X importtime`` to show how long each import takes. It shows module name, cumulative time (including nested imports) and self time (excluding nested imports). Note that its output may be broken in multi-threaded application. Typical usage is ``python -X importtime -c 'import asyncio'``.
sv: ``-X importtime`` för att visa hur lång tid varje import tar. Den visar modulnamn, kumulativ tid (inklusive nästlade importer) och egen tid (exklusive nästlade importer). Observera att dess utdata kan brytas i flertrådade applikationer. Typisk användning är ``python -X importtime -c 'import asyncio'``.

source: ``-X importtime=2`` enables additional output that indicates when an imported module has already been loaded. In such cases, the string ``cached`` will be printed in both time columns.
sv: ``-X importtime=2`` aktiverar ytterligare utdata som indikerar när en importerad modul redan har laddats. I sådana fall kommer strängen ``cached`` att skrivas ut i båda tidskolumnerna.

source: See also :envvar:`PYTHONPROFILEIMPORTTIME`.
sv: Se även :envvar:`PYTHONPROFILEIMPORTTIME`.

source: Added ``-X importtime=2`` to also trace imports of loaded modules, and reserved values other than ``1`` and ``2`` for future use.
sv: Lade till ``-X importtime=2`` för att även spåra import av laddade moduler, och reserverade andra värden än ``1`` och ``2`` för framtida användning.

source: ``-X dev``: enable :ref:`Python Development Mode <devmode>`, introducing additional runtime checks that are too expensive to be enabled by default. See also :envvar:`PYTHONDEVMODE`.
sv: ``-X dev``: aktivera :ref:`Python Development Mode <devmode>`, introducerar ytterligare körtidskontroller som är för dyra för att aktiveras som standard. Se även :envvar:`PYTHONDEVMODE`.

source: ``-X utf8`` enables the :ref:`Python UTF-8 Mode <utf8-mode>`. ``-X utf8=0`` explicitly disables :ref:`Python UTF-8 Mode <utf8-mode>` (even when it would otherwise activate automatically). See also :envvar:`PYTHONUTF8`.
sv: ``-X utf8`` aktiverar :ref:`Python UTF-8 Mode <utf8-mode>`. ``-X utf8=0`` inaktiverar explicit :ref:`Python UTF-8 Mode <utf8-mode>` (även om det annars skulle aktiveras automatiskt). Se även :envvar:`PYTHONUTF8`.

source: ``-X pycache_prefix=PATH`` enables writing ``.pyc`` files to a parallel tree rooted at the given directory instead of to the code tree. See also :envvar:`PYTHONPYCACHEPREFIX`.
sv: ``-X pycache_prefix=PATH`` gör det möjligt att skriva ``.pyc``-filer till ett parallellt träd med rot i den angivna katalogen istället för till kodträdet. Se även :envvar:`PYTHONPYCACHEPREFIX`.

source: ``-X warn_default_encoding`` issues a :class:`EncodingWarning` when the locale-specific default encoding is used for opening files. See also :envvar:`PYTHONWARNDEFAULTENCODING`.
sv: ``-X warn_default_encoding`` utfärdar en :class:`EncodingWarning` när den lokalspecifika standardkodningen används för att öppna filer. Se även :envvar:`PYTHONWARNDEFAULTENCODING`.

source: ``-X no_debug_ranges`` disables the inclusion of the tables mapping extra location information (end line, start column offset and end column offset) to every instruction in code objects. This is useful when smaller code objects and pyc files are desired as well as suppressing the extra visual location indicators when the interpreter displays tracebacks. See also :envvar:`PYTHONNODEBUGRANGES`.
sv: ``-X no_debug_ranges`` inaktiverar inkluderingen av tabeller som mappar extra platsinformation (slutrad, startkolumnoffset och slutkolumnoffset) till varje instruktion i kodobjekt. Detta är användbart när mindre kodobjekt och pyc-filer önskas samt för att undertrycka de extra visuella platsindikatorerna när tolken visar spårningar. Se även :envvar:`PYTHONNODEBUGRANGES`.

source: ``-X frozen_modules`` determines whether or not frozen modules are ignored by the import machinery. A value of ``on`` means they get imported and ``off`` means they are ignored. The default is ``on`` if this is an installed Python (the normal case). If it's under development (running from the source tree) then the default is ``off``. Note that the :mod:`!importlib_bootstrap` and :mod:`!importlib_bootstrap_external` frozen modules are always used, even if this flag is set to ``off``. See also :envvar:`PYTHON_FROZEN_MODULES`.
sv: ``-X frozen_modules`` bestämmer om frysta moduler ska ignoreras av importmaskineriet eller inte. Ett värde på ``on`` betyder att de importeras och ``off`` betyder att de ignoreras. Standardvärdet är ``on`` om detta är en installerad Python (normalfallet). Om det är under utveckling (körs från källträdet) är standardinställningen ``off``. Observera att de frysta modulerna :mod:`!importlib_bootstrap` och :mod:`!importlib_bootstrap_external` alltid används, även om denna flagga är satt till ``off``. Se även :envvar:`PYTHON_FROZEN_MODULES`.

source: ``-X perf`` enables support for the Linux ``perf`` profiler. When this option is provided, the ``perf`` profiler will be able to report Python calls. This option is only available on some platforms and will do nothing if is not supported on the current system. The default value is "off". See also :envvar:`PYTHONPERFSUPPORT` and :ref:`perf_profiling`.
sv: ``-X perf`` aktiverar stöd för Linux profilerare ``perf``. När det här alternativet anges kommer profileraren ``perf`` att kunna rapportera Python-anrop. Det här alternativet är endast tillgängligt på vissa plattformar och gör ingenting om det inte stöds på det aktuella systemet. Standardvärdet är "off". Se även :envvar:`PYTHONPERFSUPPORT` och :ref:`perf_profiling`.

source: ``-X perf_jit`` enables support for the Linux ``perf`` profiler with DWARF support. When this option is provided, the ``perf`` profiler will be able to report Python calls using DWARF information. This option is only available on some platforms and will do nothing if is not supported on the current system. The default value is "off". See also :envvar:`PYTHON_PERF_JIT_SUPPORT` and :ref:`perf_profiling`.
sv: ``-X perf_jit`` aktiverar stöd för Linux profilerare ``perf`` med DWARF-stöd. När det här alternativet anges kommer profileraren ``perf`` att kunna rapportera Python-anrop med DWARF-information. Detta alternativ är endast tillgängligt på vissa plattformar och kommer inte att göra någonting om det inte stöds på det aktuella systemet. Standardvärdet är "off". Se även :envvar:`PYTHON_PERF_JIT_SUPPORT` och :ref:`perf_profiling`.

source: ``-X disable_remote_debug`` disables the remote debugging support as described in :pep:`768`. This includes both the functionality to schedule code for execution in another process and the functionality to receive code for execution in the current process.
sv: ``-X disable_remote_debug`` inaktiverar stödet för fjärravläsning enligt beskrivningen i :pep:`768`. Detta inkluderar både funktionalitet för att schemalägga kod för exekvering i en annan process och funktionalitet för att ta emot kod för exekvering i den aktuella processen.

source: This option is only available on some platforms and will do nothing if is not supported on the current system. See also :envvar:`PYTHON_DISABLE_REMOTE_DEBUG` and :pep:`768`.
sv: Detta alternativ är endast tillgängligt på vissa plattformar och gör ingenting om det inte stöds på det aktuella systemet. Se även :envvar:`PYTHON_DISABLE_REMOTE_DEBUG` och :pep:`768`.

source: :samp:`-X cpu_count={n}` overrides :func:`os.cpu_count`, :func:`os.process_cpu_count`, and :func:`multiprocessing.cpu_count`. *n* must be greater than or equal to 1. This option may be useful for users who need to limit CPU resources of a container system. See also :envvar:`PYTHON_CPU_COUNT`. If *n* is ``default``, nothing is overridden.
sv: :samp:`-X cpu_count={n}` åsidosätter :func:`os.cpu_count`, :func:`os.process_cpu_count` och :func:`multiprocessing.cpu_count`. *n* måste vara större än eller lika med 1. Det här alternativet kan vara användbart för användare som behöver begränsa processorresurserna i ett containersystem. Se även :envvar:`PYTHON_CPU_COUNT`. Om *n* är ``default`` åsidosätts ingenting.

source: :samp:`-X presite={package.module}` specifies a module that should be imported before the :mod:`site` module is executed and before the :mod:`__main__` module exists. Therefore, the imported module isn't :mod:`__main__`. This can be used to execute code early during Python initialization. Python needs to be :ref:`built in debug mode <debug-build>` for this option to exist. See also :envvar:`PYTHON_PRESITE`.
sv: :samp:`-X presite={package.module}` anger en modul som skall importeras innan modulen :mod:`site` körs och innan modulen :mod:`__main__` existerar. Därför är den importerade modulen inte :mod:`__main__`. Detta kan användas för att exekvera kod tidigt under Python-initialiseringen. Python måste vara :ref:`byggd i felsökningsläge <debug-build>` för att detta alternativ ska finnas. Se även :envvar:`PYTHON_PRESITE`.

source: :samp:`-X gil={0,1}` forces the GIL to be disabled or enabled, respectively. Setting to ``0`` is only available in builds configured with :option:`--disable-gil`. See also :envvar:`PYTHON_GIL` and :ref:`whatsnew313-free-threaded-cpython`.
sv: :samp:`-X gil={0,1}` tvingar GIL att inaktiveras respektive aktiveras. Inställning till ``0`` är endast tillgänglig i byggnationer konfigurerade med :option:`--disable-gil`. Se även :envvar:`PYTHON_GIL` och :ref:`whatsnew313-free-threaded-cpython`.

source: :samp:`-X thread_inherit_context={0,1}` causes :class:`~threading.Thread` to, by default, use a copy of context of the caller of ``Thread.start()`` when starting. Otherwise, threads will start with an empty context. If unset, the value of this option defaults to ``1`` on free-threaded builds and to ``0`` otherwise. See also :envvar:`PYTHON_THREAD_INHERIT_CONTEXT`.
sv: :samp:`-X thread_inherit_context={0,1}` gör att :class:`~threading.Thread` som standard använder en kopia av kontexten för den som anropar ``Thread.start()`` vid start. Annars kommer trådar att starta med en tom kontext. Om detta alternativ inte är inställt, är standardvärdet ``1`` på frittrådade byggsystem och annars ``0``. Se även :envvar:`PYTHON_THREAD_INHERIT_CONTEXT`.

source: :samp:`-X context_aware_warnings={0,1}` causes the :class:`warnings.catch_warnings` context manager to use a :class:`~contextvars.ContextVar` to store warnings filter state. If unset, the value of this option defaults to ``1`` on free-threaded builds and to ``0`` otherwise. See also :envvar:`PYTHON_CONTEXT_AWARE_WARNINGS`.
sv: :samp:`-X context_aware_warnings={0,1}` gör att kontexthanteraren :class:`warnings.catch_warnings` använder en :class:`~contextvars.ContextVar` för att lagra filterstatus för varningar. Om detta alternativ inte är inställt är standardvärdet ``1`` på frittrådade byggsystem och annars ``0``. Se även :envvar:`PYTHON_CONTEXT_AWARE_WARNINGS`.

source: :samp:`-X tlbc={0,1}` enables (1, the default) or disables (0) thread-local bytecode in builds configured with :option:`--disable-gil`. When disabled, this also disables the specializing interpreter. See also :envvar:`PYTHON_TLBC`.
sv: :samp:`-X tlbc={0,1}` aktiverar (1, standard) eller inaktiverar (0) trådlokal bytekod i byggsystem som konfigurerats med :option:`--disable-gil`. När det är inaktiverat inaktiveras även den specialiserade tolken. Se även :envvar:`PYTHON_TLBC`.

source: It also allows passing arbitrary values and retrieving them through the :data:`sys._xoptions` dictionary.
sv: Det går också att skicka godtyckliga värden och hämta dem via :data:`sys._xoptions`-ordlistan.

source: Removed the ``-X showalloccount`` option.
sv: Tog bort alternativet ``-X showalloccount``.

source: Removed the ``-X oldparser`` option.
sv: Tog bort alternativet ``-X oldparser``.

source: :option:`!-J` is no longer reserved for use by Jython_, and now has no special meaning.
sv: :option:`!-J` är inte längre reserverat för användning av Jython_ och har nu ingen speciell betydelse.

source: Controlling color
sv: Styrning av färg

source: The Python interpreter is configured by default to use colors to highlight output in certain situations such as when displaying tracebacks. This behavior can be controlled by setting different environment variables.
sv: Python-tolken är som standard konfigurerad att använda färger för att markera utdata i vissa situationer, t.ex. när spårningar visas. Detta beteende kan kontrolleras genom att ställa in olika miljövariabler.

source: Setting the environment variable ``TERM`` to ``dumb`` will disable color.
sv: Om du ställer in miljövariabeln ``TERM`` till ``dumb`` inaktiveras färg.

source: If the |FORCE_COLOR|_ environment variable is set, then color will be enabled regardless of the value of TERM. This is useful on CI systems which aren’t terminals but can still display ANSI escape sequences.
sv: Om miljövariabeln |FORCE_COLOR|_ är inställd kommer färg att aktiveras oavsett värdet på TERM. Detta är användbart på CI-system som inte är terminaler men som ändå kan visa ANSI escape-sekvenser.

source: If the |NO_COLOR|_ environment variable is set, Python will disable all color in the output. This takes precedence over ``FORCE_COLOR``.
sv: Om miljövariabeln |NO_COLOR|_ är inställd kommer Python att inaktivera alla färger i utdata. Detta har företräde framför ``FORCE_COLOR``.

source: All these environment variables are used also by other tools to control color output. To control the color output only in the Python interpreter, the :envvar:`PYTHON_COLORS` environment variable can be used. This variable takes precedence over ``NO_COLOR``, which in turn takes precedence over ``FORCE_COLOR``.
sv: Alla dessa miljövariabler används även av andra verktyg för att styra färgutmatningen. För att kontrollera färgutmatningen endast i Python-tolken kan miljövariabeln :envvar:`PYTHON_COLORS` användas. Denna variabel har företräde framför ``NO_COLOR``, som i sin tur har företräde framför ``FORCE_COLOR``.

source: Environment variables
sv: Miljövariabler

source: These environment variables influence Python's behavior, they are processed before the command-line switches other than -E or -I. It is customary that command-line switches override environmental variables where there is a conflict.
sv: Dessa miljövariabler påverkar Pythons beteende och behandlas före andra kommandoradsinställningar än -E eller -I. Det är brukligt att kommandoradsknapparna åsidosätter miljövariablerna om det finns en konflikt.

source: Change the location of the standard Python libraries. By default, the libraries are searched in :file:`{prefix}/lib/python{version}` and :file:`{exec_prefix}/lib/python{version}`, where :file:`{prefix}` and :file:`{exec_prefix}` are installation-dependent directories, both defaulting to :file:`/usr/local`.
sv: Ändra platsen för standardbiblioteken i Python. Som standard söks biblioteken i :file:`{prefix}/lib/python{version}` och :file:`{exec_prefix}/lib/python{version}`, där :file:`{prefix}` och :file:`{exec_prefix}` är installationsberoende kataloger, båda som standard :file:`/usr/local`.

source: When :envvar:`PYTHONHOME` is set to a single directory, its value replaces both :file:`{prefix}` and :file:`{exec_prefix}`. To specify different values for these, set :envvar:`PYTHONHOME` to :file:`{prefix}:{exec_prefix}`.
sv: När :envvar:`PYTHONHOME` är inställd på en enda katalog ersätter dess värde både :file:`{prefix}` och :file:`{exec_prefix}`. Om du vill ange olika värden för dessa, anger du :envvar:`PYTHONHOME` till :file:`{prefix}:{exec_prefix}`.
