Repository: yeager/python-docs-sv
Catalog: using/cmdline.po
Languages: sv

source: Augment the default search path for module files. The format is the same as the shell's :envvar:`PATH`: one or more directory pathnames separated by :data:`os.pathsep` (e.g. colons on Unix or semicolons on Windows). Non-existent directories are silently ignored.
sv: Utökar standardsökvägen för modulfiler. Formatet är detsamma som skalets :envvar:`PATH`: ett eller flera katalogsöknamn separerade med :data:`os.pathsep` (t.ex. kolon på Unix eller semikolon på Windows). Icke-existerande kataloger ignoreras i tysthet.

source: In addition to normal directories, individual :envvar:`PYTHONPATH` entries may refer to zipfiles containing pure Python modules (in either source or compiled form). Extension modules cannot be imported from zipfiles.
sv: Förutom vanliga kataloger kan enskilda :envvar:`PYTHONPATH`-poster hänvisa till zip-filer som innehåller rena Python-moduler (i antingen källkod eller kompilerad form). Tilläggsmoduler kan inte importeras från zipfiler.

source: The default search path is installation dependent, but generally begins with :file:`{prefix}/lib/python{version}` (see :envvar:`PYTHONHOME` above). It is *always* appended to :envvar:`PYTHONPATH`.
sv: Standardsökvägen är installationsberoende, men börjar i allmänhet med :file:`{prefix}/lib/python{version}` (se :envvar:`PYTHONHOME` ovan). Den läggs *alltid* till :envvar:`PYTHONPATH`.

source: An additional directory will be inserted in the search path in front of :envvar:`PYTHONPATH` as described above under :ref:`using-on-interface-options`. The search path can be manipulated from within a Python program as the variable :data:`sys.path`.
sv: En ytterligare katalog kommer att infogas i sökvägen framför :envvar:`PYTHONPATH` enligt beskrivningen ovan under :ref:`using-on-interface-options`. Sökvägen kan manipuleras inifrån ett Python-program som variabeln :data:`sys.path`.

source: If this is set to a non-empty string, don't prepend a potentially unsafe path to :data:`sys.path`: see the :option:`-P` option for details.
sv: Om detta är satt till en icke-tom sträng, lägg inte till en potentiellt osäker sökväg till :data:`sys.path`: se alternativet :option:`-P` för mer information.

source: If this is set to a non-empty string, it overrides the :data:`sys.platlibdir` value.
sv: Om detta värde är en icke-tom sträng åsidosätter det :data:`sys.platlibdir`-värdet.

source: If this is the name of a readable file, the Python commands in that file are executed before the first prompt is displayed in interactive mode. The file is executed in the same namespace where interactive commands are executed so that objects defined or imported in it can be used without qualification in the interactive session. You can also change the prompts :data:`sys.ps1` and :data:`sys.ps2` and the hook :data:`sys.__interactivehook__` in this file.
sv: Om detta är namnet på en läsbar fil, exekveras Python-kommandona i den filen innan den första prompten visas i interaktivt läge. Filen körs i samma namnrymd där interaktiva kommandon körs så att objekt som definieras eller importeras i den kan användas utan förbehåll i den interaktiva sessionen. Du kan också ändra prompterna :data:`sys.ps1` och :data:`sys.ps2` och kroken :data:`sys.__interactivehook__` i den här filen.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_startup`` with the filename as the argument when called on startup.
sv: Utlöser en :ref:`auditing event <auditing>` ``cpython.run_startup`` med filnamnet som argument när den anropas vid start.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-O` option. If set to an integer, it is equivalent to specifying :option:`-O` multiple times.
sv: Om detta anges till en icke-tom sträng motsvarar det angivandet av alternativet :option:`-O`. Om det anges till ett heltal motsvarar det att ange :option:`-O` flera gånger.

source: If this is set, it names a callable using dotted-path notation. The module containing the callable will be imported and then the callable will be run by the default implementation of :func:`sys.breakpointhook` which itself is called by built-in :func:`breakpoint`. If not set, or set to the empty string, it is equivalent to the value "pdb.set_trace". Setting this to the string "0" causes the default implementation of :func:`sys.breakpointhook` to do nothing but return immediately.
sv: Om detta är inställt namnges en anropsbar funktion med hjälp av en prickad sökväg. Modulen som innehåller den anropbara filen kommer att importeras och sedan kommer den anropbara filen att köras av standardimplementeringen av :func:`sys.breakpointhook` som i sin tur anropas av den inbyggda :func:`breakpoint`. Om den inte är inställd, eller är inställd på den tomma strängen, är den likvärdig med värdet "pdb.set_trace". Om den sätts till strängen "0" gör standardimplementationen av :func:`sys.breakpointhook` ingenting annat än att återvända omedelbart.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-d` option. If set to an integer, it is equivalent to specifying :option:`-d` multiple times.
sv: Om detta anges som en icke-tom sträng motsvarar det angivandet av alternativet :option:`-d`. Om det anges till ett heltal motsvarar det att ange :option:`-d` flera gånger.

source: This environment variable requires a :ref:`debug build of Python <debug-build>`, otherwise it's ignored.
sv: Denna miljövariabel kräver en :ref:`debug-version av Python <debug-build>`, annars ignoreras den.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-i` option.
sv: Om detta anges som en icke-tom sträng motsvarar det alternativet :option:`-i`.

source: This variable can also be modified by Python code using :data:`os.environ` to force inspect mode on program termination.
sv: Denna variabel kan också modifieras av Python-kod med hjälp av :data:`os.environ` för att tvinga fram inspektionsläge när programmet avslutas.

source: (also 3.11.10, 3.10.15, 3.9.20, and 3.8.20) Emits audit events.
sv: (även 3.11.10, 3.10.15, 3.9.20 och 3.8.20) Ger upphov till granskningshändelser.

source: Uses PyREPL if possible, in which case :envvar:`PYTHONSTARTUP` is also executed. Emits audit events.
sv: Använder PyREPL om möjligt, i vilket fall :envvar:`PYTHONSTARTUP` också körs. Ger upphov till granskningshändelser.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-u` option.
sv: Om detta anges till en icke-tom sträng motsvarar det alternativet :option:`-u`.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-v` option. If set to an integer, it is equivalent to specifying :option:`-v` multiple times.
sv: Om detta anges till en icke-tom sträng motsvarar det angivandet av alternativet :option:`-v`. Om det anges till ett heltal motsvarar det att ange :option:`-v` flera gånger.

source: If this is set, Python ignores case in :keyword:`import` statements. This only works on Windows and macOS.
sv: Om detta är inställt ignorerar Python versaler i :keyword:`import`-satser. Detta fungerar endast på Windows och macOS.

source: If this is set to a non-empty string, Python won't try to write ``.pyc`` files on the import of source modules. This is equivalent to specifying the :option:`-B` option.
sv: Om detta är satt till en icke-tom sträng, kommer Python inte att försöka skriva ``.pyc``-filer vid import av källmoduler. Detta är likvärdigt med att ange alternativet :option:`-B`.

source: If this is set, Python will write ``.pyc`` files in a mirror directory tree at this path, instead of in ``__pycache__`` directories within the source tree. This is equivalent to specifying the :option:`-X` ``pycache_prefix=PATH`` option.
sv: Om detta anges kommer Python att skriva ``.pyc``-filer i ett spegelkatalogträd på denna sökväg, istället för i ``__pycache__``-kataloger i källträdet. Detta motsvarar att ange alternativet :option:`-X` ``pycache_prefix=PATH``.

source: If this variable is not set or set to ``random``, a random value is used to seed the hashes of str and bytes objects.
sv: Om variabeln inte är inställd eller om den är inställd på ``random`` används ett slumpmässigt värde för att skapa hasharna för str- och bytes-objekten.

source: If :envvar:`PYTHONHASHSEED` is set to an integer value, it is used as a fixed seed for generating the hash() of the types covered by the hash randomization.
sv: Om :envvar:`PYTHONHASHSEED` är inställt på ett heltal används det som ett fast frö för att generera hash() för de typer som omfattas av hashslumpningen.

source: Its purpose is to allow repeatable hashing, such as for selftests for the interpreter itself, or to allow a cluster of python processes to share hash values.
sv: Syftet är att möjliggöra repeterbar hashning, t.ex. för självtest av själva tolken eller för att låta ett kluster av pythonprocesser dela hashvärden.

source: The integer must be a decimal number in the range [0,4294967295]. Specifying the value 0 will disable hash randomization.
sv: Heltalet måste vara ett decimaltal inom intervallet [0,4294967295]. Om du anger värdet 0 inaktiveras hashslumpning.

source: If this variable is set to an integer, it is used to configure the interpreter's global :ref:`integer string conversion length limitation <int_max_str_digits>`.
sv: Om den här variabeln är inställd på ett heltal används den för att konfigurera tolkens globala :ref:`begränsning av längden för omvandling av heltalssträngar <int_max_str_digits>`.

source: If this is set before running the interpreter, it overrides the encoding used for stdin/stdout/stderr, in the syntax ``encodingname:errorhandler``. Both the ``encodingname`` and the ``:errorhandler`` parts are optional and have the same meaning as in :func:`str.encode`.
sv: Om detta anges innan tolken körs, åsidosätter det kodningen som används för stdin/stdout/stderr, i syntaxen ``encodingname:errorhandler``. Både delarna ``encodingname`` och ``:errorhandler`` är valfria och har samma betydelse som i :func:`str.encode`.

source: For stderr, the ``:errorhandler`` part is ignored; the handler will always be ``'backslashreplace'``.
sv: För stderr ignoreras delen ``:errorhandler``; hanteraren kommer alltid att vara ``'backslashreplace``.

source: The ``encodingname`` part is now optional.
sv: Delen ``encodingname`` är nu valfri.

source: On Windows, the encoding specified by this variable is ignored for interactive console buffers unless :envvar:`PYTHONLEGACYWINDOWSSTDIO` is also specified. Files and pipes redirected through the standard streams are not affected.
sv: I Windows ignoreras den kodning som anges av denna variabel för interaktiva konsolbuffertar om inte :envvar:`PYTHONLEGACYWINDOWSSTDIO` också anges. Filer och pipes som omdirigeras via standardströmmarna påverkas inte.

source: If this is set, Python won't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
sv: Om detta är inställt kommer Python inte att lägga till :data:`user site-packages directory <site.USER_SITE>` till :data:`sys.path`.

source: Defines the :data:`user base directory <site.USER_BASE>`, which is used to compute the path of the :data:`user site-packages directory <site.USER_SITE>` and :ref:`installation paths <sysconfig-user-scheme>` for ``python -m pip install --user``.
sv: Definierar :data:`user baskatalog <site.USER_BASE>`, som används för att beräkna sökvägen till :data:`user site-packages katalog <site.USER_SITE>` och :ref:`installationssökvägar <sysconfig-user-scheme>` för ``python -m pip install --user``.

source: If this environment variable is set, ``sys.argv[0]`` will be set to its value instead of the value got through the C runtime. Only works on macOS.
sv: Om denna miljövariabel är inställd kommer ``sys.argv[0]`` att sättas till dess värde istället för det värde som erhålls via C-körtiden. Fungerar endast på macOS.

source: This is equivalent to the :option:`-W` option. If set to a comma separated string, it is equivalent to specifying :option:`-W` multiple times, with filters later in the list taking precedence over those earlier in the list.
sv: Detta motsvarar alternativet :option:`-W`. Om det anges till en kommaseparerad sträng motsvarar det att ange :option:`-W` flera gånger, med filter senare i listan som har företräde framför dem tidigare i listan.

source: PYTHONWARNINGS=default # Warn once per call location PYTHONWARNINGS=error # Convert to exceptions PYTHONWARNINGS=always # Warn every time PYTHONWARNINGS=all # Same as PYTHONWARNINGS=always PYTHONWARNINGS=module # Warn once per calling module PYTHONWARNINGS=once # Warn once per Python process PYTHONWARNINGS=ignore # Never warn
sv: PYTHONWARNINGS=default # Varna en gång per samtalsplats PYTHONWARNINGS=error # Konvertera till undantag PYTHONWARNINGS=always # Varnar varje gång PYTHONWARNINGS=all # Samma som PYTHONWARNINGS=always PYTHONWARNINGS=module # Varnar en gång per anropande modul PYTHONWARNINGS=once # Varnar en gång per Python-process PYTHONWARNINGS=ignore # Varnar aldrig

source: If this environment variable is set to a non-empty string, :func:`faulthandler.enable` is called at startup: install a handler for :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` and :const:`~signal.SIGILL` signals to dump the Python traceback. This is equivalent to :option:`-X` ``faulthandler`` option.
sv: Om denna miljövariabel är satt till en icke-tom sträng, anropas :func:`faulthandler.enable` vid uppstart: installera en hanterare för :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` och :const:`~signal.SIGILL` signaler för att dumpa Python-traceback. Detta är likvärdigt med :option:`-X` ``faulthandler`` option.

source: If this environment variable is set to a non-empty string, start tracing Python memory allocations using the :mod:`tracemalloc` module. The value of the variable is the maximum number of frames stored in a traceback of a trace. For example, ``PYTHONTRACEMALLOC=1`` stores only the most recent frame. See the :func:`tracemalloc.start` function for more information. This is equivalent to setting the :option:`-X` ``tracemalloc`` option.
sv: Om denna miljövariabel är satt till en icke-tom sträng, börja spåra Python-minnesallokeringar med modulen :mod:`tracemalloc`. Värdet på variabeln är det maximala antalet frames som lagras i en traceback för en spårning. Till exempel, ``PYTHONTRACEMALLOC=1`` lagrar bara den senaste bilden. Se funktionen :func:`tracemalloc.start` för mer information. Detta är likvärdigt med att ställa in :option:`-X` ``tracemalloc`` option.

source: If this environment variable is set to ``1``, Python will show how long each import takes. If set to ``2``, Python will include output for imported modules that have already been loaded. This is equivalent to setting the :option:`-X` ``importtime`` option.
sv: Om denna miljövariabel är inställd på ``1`` kommer Python att visa hur lång tid varje import tar. Om den är inställd på ``2`` kommer Python att inkludera utdata för importerade moduler som redan har laddats. Detta är likvärdigt med att ställa in :option:`-X` ``importtime`` option.

source: Added ``PYTHONPROFILEIMPORTTIME=2`` to also trace imports of loaded modules.
sv: Lagt till ``PYTHONPROFILEIMPORTTIME=2`` för att även spåra import av laddade moduler.

source: If this environment variable is set to a non-empty string, enable the :ref:`debug mode <asyncio-debug-mode>` of the :mod:`asyncio` module.
sv: Om den här miljövariabeln är inställd på en icke-tom sträng aktiveras :ref:`debugläge <asyncio-debug-mode>` i modulen :mod:`asyncio`.

source: Set the Python memory allocators and/or install debug hooks.
sv: Ställ in Pythons minnesallokatorer och/eller installera felsökningskrokar.

source: Set the family of memory allocators used by Python:
sv: Ange vilken familj av minnesallokatorer som används av Python:

source: ``default``: use the :ref:`default memory allocators <default-memory-allocators>`.
sv: ``default``: använd :ref:``standardminnesallokatorer <default-memory-allocators>``.

source: ``malloc``: use the :c:func:`malloc` function of the C library for all domains (:c:macro:`PYMEM_DOMAIN_RAW`, :c:macro:`PYMEM_DOMAIN_MEM`, :c:macro:`PYMEM_DOMAIN_OBJ`).
sv: ``malloc``: använd funktionen :c:func:`malloc` i C-biblioteket för alla domäner (:c:macro:`PYMEM_DOMAIN_RAW`, :c:macro:`PYMEM_DOMAIN_MEM`, :c:macro:`PYMEM_DOMAIN_OBJ`).

source: ``pymalloc``: use the :ref:`pymalloc allocator <pymalloc>` for :c:macro:`PYMEM_DOMAIN_MEM` and :c:macro:`PYMEM_DOMAIN_OBJ` domains and use the :c:func:`malloc` function for the :c:macro:`PYMEM_DOMAIN_RAW` domain.
sv: ``pymalloc``: använd :ref:`pymalloc allocator <pymalloc>` för domänerna :c:macro:`PYMEM_DOMAIN_MEM` och :c:macro:`PYMEM_DOMAIN_OBJ` och använd funktionen :c:func:`malloc` för domänen :c:macro:`PYMEM_DOMAIN_RAW`.

source: ``mimalloc``: use the :ref:`mimalloc allocator <mimalloc>` for :c:macro:`PYMEM_DOMAIN_MEM` and :c:macro:`PYMEM_DOMAIN_OBJ` domains and use the :c:func:`malloc` function for the :c:macro:`PYMEM_DOMAIN_RAW` domain.
sv: ``mimalloc``: använd :ref:`mimalloc allocator <mimalloc>` för domänerna :c:macro:`PYMEM_DOMAIN_MEM` och :c:macro:`PYMEM_DOMAIN_OBJ` och använd funktionen :c:func:`malloc` för domänen :c:macro:`PYMEM_DOMAIN_RAW`.

source: Install :ref:`debug hooks <pymem-debug-hooks>`:
sv: Installera :ref:`debug hooks <pymem-debug-hooks>`:

source: ``debug``: install debug hooks on top of the :ref:`default memory allocators <default-memory-allocators>`.
sv: ``debug``: installera felsökningskrokar ovanpå :ref:`standardminnesallokering <default-memory-allocators>`.

source: ``malloc_debug``: same as ``malloc`` but also install debug hooks.
sv: ``malloc_debug``: samma som ``malloc`` men installerar även debug-krokar.

source: ``pymalloc_debug``: same as ``pymalloc`` but also install debug hooks.
sv: ``pymalloc_debug``: samma som ``pymalloc`` men installerar även debug-krokar.

source: ``mimalloc_debug``: same as ``mimalloc`` but also install debug hooks.
sv: ``mimalloc_debug``: samma som ``mimalloc`` men installerar även debug-krokar.

source: Added the ``"default"`` allocator.
sv: Lade till allokeringsverktyget ``"default"``.

source: If set to a non-empty string, Python will print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
sv: Om den är inställd på en icke-tom sträng kommer Python att skriva ut statistik över :ref:`pymalloc memory allocator <pymalloc>` varje gång en ny pymalloc-objektarena skapas och vid avstängning.

source: This variable is ignored if the :envvar:`PYTHONMALLOC` environment variable is used to force the :c:func:`malloc` allocator of the C library, or if Python is configured without ``pymalloc`` support.
sv: Denna variabel ignoreras om miljövariabeln :envvar:`PYTHONMALLOC` används för att tvinga fram allokeringsverktyget :c:func:`malloc` i C-biblioteket, eller om Python är konfigurerat utan stöd för ``pymalloc``.

source: This variable can now also be used on Python compiled in release mode. It now has no effect if set to an empty string.
sv: Denna variabel kan nu också användas på Python kompilerad i release-läge. Den har nu ingen effekt om den är inställd på en tom sträng.

source: If set to a non-empty string, the default :term:`filesystem encoding and error handler` mode will revert to their pre-3.6 values of 'mbcs' and 'replace', respectively. Otherwise, the new defaults 'utf-8' and 'surrogatepass' are used.
sv: Om inställningen är en icke-tom sträng kommer standardinställningarna :term:`filsystemkodning och felhanteringsläge` att återgå till sina pre-3.6 värden 'mbcs' respektive 'replace'. Annars används de nya standardvärdena 'utf-8' och 'surrogatepass'.

source: This may also be enabled at runtime with :func:`sys._enablelegacywindowsfsencoding`.
sv: Detta kan också aktiveras under körning med :func:`sys._enablelegacywindowsfsencoding`.

source: Availability
sv: Tillgänglighet

source: See :pep:`529` for more details.
sv: Se :pep:`529` för mer information.

source: If set to a non-empty string, does not use the new console reader and writer. This means that Unicode characters will be encoded according to the active console code page, rather than using utf-8.
sv: Om inställningen är en icke-tom sträng används inte den nya konsolläsaren och -skrivaren. Detta innebär att Unicode-tecken kommer att kodas enligt den aktiva konsolkodsidan, i stället för att använda utf-8.

source: This variable is ignored if the standard streams are redirected (to files or pipes) rather than referring to console buffers.
sv: Denna variabel ignoreras om standardströmmarna omdirigeras (till filer eller pipes) i stället för att hänvisa till konsolbuffertar.

source: If set to the value ``0``, causes the main Python command line application to skip coercing the legacy ASCII-based C and POSIX locales to a more capable UTF-8 based alternative.
sv: Om värdet ```0`` anges, gör det att Pythons kommandoradsprogram hoppar över att tvinga de gamla ASCII-baserade C- och POSIX-lokalerna till ett mer kapabelt UTF-8-baserat alternativ.

source: If this variable is *not* set (or is set to a value other than ``0``), the ``LC_ALL`` locale override environment variable is also not set, and the current locale reported for the ``LC_CTYPE`` category is either the default ``C`` locale, or else the explicitly ASCII-based ``POSIX`` locale, then the Python CLI will attempt to configure the following locales for the ``LC_CTYPE`` category in the order listed before loading the interpreter runtime:
sv: Om den här variabeln *inte* är inställd (eller är inställd på ett annat värde än ``0``), miljövariabeln ``LC_ALL`` locale override inte heller är inställd, och den aktuella locale som rapporteras för kategorin ``LC_CTYPE`` är antingen standard locale ``C``, eller den explicit ASCII-baserade locale ``POSIX``, så kommer Python CLI att försöka konfigurera följande locale för kategorin ``LC_CTYPE`` i den ordning som anges innan tolkens runtime laddas:

source: If setting one of these locale categories succeeds, then the ``LC_CTYPE`` environment variable will also be set accordingly in the current process environment before the Python runtime is initialized. This ensures that in addition to being seen by both the interpreter itself and other locale-aware components running in the same process (such as the GNU ``readline`` library), the updated setting is also seen in subprocesses (regardless of whether or not those processes are running a Python interpreter), as well as in operations that query the environment rather than the current C locale (such as Python's own :func:`locale.getdefaultlocale`).
sv: Om inställningen av en av dessa lokala kategorier lyckas, kommer miljövariabeln ``LC_CTYPE`` också att ställas in i enlighet med detta i den aktuella processmiljön innan Python-körtiden initieras. Detta säkerställer att den uppdaterade inställningen, förutom att ses av både tolken själv och andra lokalmedvetna komponenter som körs i samma process (t.ex. GNU-biblioteket ``readline``), även ses i underprocesser (oavsett om dessa processer kör en Python-tolk eller inte), samt i operationer som frågar efter miljön snarare än den aktuella C-lokalen (t.ex. Pythons egen :func:`locale.getdefaultlocale`).
