Repository: yeager/python-docs-sv
Catalog: using/cmdline.po
Languages: sv

source: Command line and environment
sv: Kommandorad och miljö

source: The CPython interpreter scans the command line and the environment for various settings.
sv: CPython-tolken söker efter olika inställningar på kommandoraden och i miljön.

source: Other implementations' command line schemes may differ. See :ref:`implementations` for further resources.
sv: Andra implementeringars kommandoradsscheman kan skilja sig åt. Se :ref:`implementations` för ytterligare resurser.

source: Command line
sv: Kommandorad

source: When invoking Python, you may specify any of these options::
sv: När du anropar Python kan du ange något av följande alternativ::

source: The most common use case is, of course, a simple invocation of a script::
sv: Det vanligaste användningsfallet är naturligtvis en enkel anropning av ett skript::

source: Interface options
sv: Alternativ för gränssnitt

source: The interpreter interface resembles that of the UNIX shell, but provides some additional methods of invocation:
sv: Interpretergränssnittet liknar det som finns i UNIX-skalet, men innehåller några ytterligare metoder för anrop:

source: When called with standard input connected to a tty device, it prompts for commands and executes them until an EOF (an end-of-file character, you can produce that with :kbd:`Ctrl-D` on UNIX or :kbd:`Ctrl-Z, Enter` on Windows) is read. For more on interactive mode, see :ref:`tut-interac`.
sv: När programmet anropas med standardinmatning ansluten till en tty-enhet frågar det efter kommandon och kör dem tills ett EOF-tecken (ett tecken för slutet av filen, du kan skapa det med :kbd:`Ctrl-D` på UNIX eller :kbd:`Ctrl-Z, Enter` på Windows) läses. För mer information om interaktivt läge, se :ref:`tut-interac`.

source: When called with a file name argument or with a file as standard input, it reads and executes a script from that file.
sv: När programmet anropas med ett filnamnsargument eller med en fil som standardinmatning läser och körs ett skript från den filen.

source: When called with a directory name argument, it reads and executes an appropriately named script from that directory.
sv: När den anropas med ett argument i form av ett katalognamn läser och körs ett skript med lämpligt namn från den katalogen.

source: When called with ``-c command``, it executes the Python statement(s) given as *command*. Here *command* may contain multiple statements separated by newlines. Leading whitespace is significant in Python statements!
sv: När den anropas med ``-c command``, exekverar den Python-satsen/-satserna som anges som *command*. Här kan *kommando* innehålla flera satser åtskilda av nya rader. Ledande blanksteg är betydelsefulla i Python-satser!

source: When called with ``-m module-name``, the given module is located on the Python module path and executed as a script.
sv: När den anropas med ``-m modulnamn`` placeras den angivna modulen på Pythons modulväg och körs som ett skript.

source: In non-interactive mode, the entire input is parsed before it is executed.
sv: I icke-interaktivt läge analyseras hela inmatningen innan den körs.

source: An interface option terminates the list of options consumed by the interpreter, all consecutive arguments will end up in :data:`sys.argv` -- note that the first element, subscript zero (``sys.argv[0]``), is a string reflecting the program's source.
sv: Ett interface-alternativ avslutar listan över alternativ som tolken använder, alla på varandra följande argument hamnar i :data:`sys.argv` -- observera att det första elementet, index noll (``sys.argv[0]``), är en sträng som återspeglar programmets källa.

source: Execute the Python code in *command*. *command* can be one or more statements separated by newlines, with significant leading whitespace as in normal module code.
sv: Exekvera Python-koden i *kommando*. *command* kan vara en eller flera satser åtskilda av nya rader, med betydande inledande blanksteg som i normal modulkod.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-c"`` and the current directory will be added to the start of :data:`sys.path` (allowing modules in that directory to be imported as top level modules).
sv: Om detta alternativ anges kommer det första elementet i :data:`sys.argv` att vara ``"-c"`` och den aktuella katalogen kommer att läggas till i början av :data:`sys.path` (vilket gör att moduler i den katalogen kan importeras som toppnivåmoduler).

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_command`` with argument ``command``.
sv: Utlöser en :ref:`auditing event <auditing>` ``cpython.run_command`` med argumentet ``command``.

source: *command* is automatically dedented before execution.
sv: *command* är automatiskt dedented före verkställighet.

source: Search :data:`sys.path` for the named module and execute its contents as the :mod:`__main__` module.
sv: Sök i :data:`sys.path` efter den namngivna modulen och exekvera dess innehåll som :mod:`__main__`-modulen.

source: Since the argument is a *module* name, you must not give a file extension (``.py``). The module name should be a valid absolute Python module name, but the implementation may not always enforce this (e.g. it may allow you to use a name that includes a hyphen).
sv: Eftersom argumentet är ett *modulnamn* får du inte ange något filtillägg (``.py``). Modulnamnet bör vara ett giltigt absolut Python-modulnamn, men implementationen kanske inte alltid upprätthåller detta (t.ex. kan det tillåta dig att använda ett namn som innehåller ett bindestreck).

source: Package names (including namespace packages) are also permitted. When a package name is supplied instead of a normal module, the interpreter will execute ``<pkg>.__main__`` as the main module. This behaviour is deliberately similar to the handling of directories and zipfiles that are passed to the interpreter as the script argument.
sv: Paketnamn (inklusive namnrymdspaket) är också tillåtna. När ett paketnamn anges i stället för en vanlig modul kommer tolken att exekvera ``<pkg>.__main__`` som huvudmodul. Detta beteende liknar avsiktligt hanteringen av kataloger och zip-filer som skickas till tolken som skriptargument.

source: This option cannot be used with built-in modules and extension modules written in C, since they do not have Python module files. However, it can still be used for precompiled modules, even if the original source file is not available.
sv: Det här alternativet kan inte användas med inbyggda moduler och tilläggsmoduler skrivna i C, eftersom de inte har Python-modulfiler. Det kan dock fortfarande användas för förkompilerade moduler, även om den ursprungliga källfilen inte är tillgänglig.

source: If this option is given, the first element of :data:`sys.argv` will be the full path to the module file (while the module file is being located, the first element will be set to ``"-m"``). As with the :option:`-c` option, the current directory will be added to the start of :data:`sys.path`.
sv: Om detta alternativ anges, kommer det första elementet i :data:`sys.argv` att vara den fullständiga sökvägen till modulfilen (medan modulfilen lokaliseras, kommer det första elementet att sättas till ``"-m"``). Precis som med alternativet :option:`-c` läggs den aktuella katalogen till i början av :data:`sys.path`.

source: :option:`-I` option can be used to run the script in isolated mode where :data:`sys.path` contains neither the current directory nor the user's site-packages directory. All ``PYTHON*`` environment variables are ignored, too.
sv: :option:`-I` option kan användas för att köra skriptet i isolerat läge där :data:`sys.path` varken innehåller den aktuella katalogen eller användarens katalog för site-paket. Alla ``PYTHON*`` miljövariabler ignoreras också.

source: Many standard library modules contain code that is invoked on their execution as a script. An example is the :mod:`timeit` module::
sv: Många standardbiblioteksmoduler innehåller kod som anropas som ett skript när de exekveras. Ett exempel är modulen :mod:`timeit`::

source: python -m timeit -s "setup here" "benchmarked code here" python -m timeit -h # for details
sv: python -m timeit -s "setup här" "benchmarkad kod här" python -m timeit -h # för detaljer

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_module`` with argument ``module-name``.
sv: Utlöser en :ref:`auditing event <auditing>` ``cpython.run_module`` med argumentet ``module-name``.

source: Equivalent functionality directly available to Python code
sv: Motsvarande funktionalitet direkt tillgänglig för Python-kod

source: :pep:`338` -- Executing modules as scripts
sv: :pep:`338` -- Exekvera moduler som skript

source: Supply the package name to run a ``__main__`` submodule.
sv: Ange paketnamnet för att köra en ``__main__``-undermodul.

source: namespace packages are also supported
sv: namnrymdspaket stöds också

source: Read commands from standard input (:data:`sys.stdin`). If standard input is a terminal, :option:`-i` is implied.
sv: Läser kommandon från standardinmatningen (:data:`sys.stdin`). Om standardinmatningen är en terminal är :option:`-i` underförstådd.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-"`` and the current directory will be added to the start of :data:`sys.path`.
sv: Om detta alternativ anges kommer det första elementet i :data:`sys.argv` att vara ``"-"`` och den aktuella katalogen kommer att läggas till i början av :data:`sys.path`.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_stdin`` with no arguments.
sv: Utlöser en :ref:`auditing event <auditing>` ``cpython.run_stdin`` utan argument.

source: Execute the Python code contained in *script*, which must be a filesystem path (absolute or relative) referring to either a Python file, a directory containing a ``__main__.py`` file, or a zipfile containing a ``__main__.py`` file.
sv: Kör Python-koden i *script*, som måste vara en filsystemssökväg (absolut eller relativ) som hänvisar till antingen en Python-fil, en katalog som innehåller filen ``__main__.py`` eller en zip-fil som innehåller filen ``__main__.py``.

source: If this option is given, the first element of :data:`sys.argv` will be the script name as given on the command line.
sv: Om detta alternativ anges kommer det första elementet i :data:`sys.argv` att vara skriptnamnet som anges på kommandoraden.

source: If the script name refers directly to a Python file, the directory containing that file is added to the start of :data:`sys.path`, and the file is executed as the :mod:`__main__` module.
sv: Om skriptnamnet hänvisar direkt till en Python-fil läggs katalogen som innehåller filen till i början av :data:`sys.path` och filen exekveras som :mod:`__main__`-modulen.

source: If the script name refers to a directory or zipfile, the script name is added to the start of :data:`sys.path` and the ``__main__.py`` file in that location is executed as the :mod:`__main__` module.
sv: Om skriptnamnet hänvisar till en katalog eller zip-fil läggs skriptnamnet till i början av :data:`sys.path` och filen ``__main__.py`` på den platsen exekveras som modulen :mod:`__main__`.

source: :option:`-I` option can be used to run the script in isolated mode where :data:`sys.path` contains neither the script's directory nor the user's site-packages directory. All ``PYTHON*`` environment variables are ignored, too.
sv: :option:`-I` option kan användas för att köra skriptet i isolerat läge där :data:`sys.path` varken innehåller skriptets katalog eller användarens katalog för site-paket. Alla ``PYTHON*`` miljövariabler ignoreras också.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_file`` with argument ``filename``.
sv: Utlöser en :ref:`auditing event <auditing>` ``cpython.run_file`` med argumentet ``filename``.

source: If no interface option is given, :option:`-i` is implied, ``sys.argv[0]`` is an empty string (``""``) and the current directory will be added to the start of :data:`sys.path`. Also, tab-completion and history editing is automatically enabled, if available on your platform (see :ref:`rlcompleter-config`).
sv: Om inget gränssnittsalternativ anges är :option:`-i` underförstått, ``sys.argv[0]`` är en tom sträng (``""``) och den aktuella katalogen läggs till i början av :data:`sys.path`. Tab-komplettering och historikredigering aktiveras också automatiskt, om det finns tillgängligt på din plattform (se :ref:`rlcompleter-config`).

source: Automatic enabling of tab-completion and history editing.
sv: Automatisk aktivering av tabbkomplettering och historikredigering.

source: Generic options
sv: Allmänna alternativ

source: Print a short description of all command line options and corresponding environment variables and exit.
sv: Skriv ut en kort beskrivning av alla kommandoradsalternativ och motsvarande miljövariabler och avsluta.

source: Print a short description of Python-specific environment variables and exit.
sv: Skriv ut en kort beskrivning av Python-specifika miljövariabler och avsluta.

source: Print a description of implementation-specific :option:`-X` options and exit.
sv: Skriv ut en beskrivning av implementationsspecifika :option:`-X`-alternativ och avsluta.

source: Print complete usage information and exit.
sv: Skriv ut fullständig användningsinformation och avsluta.

source: Print the Python version number and exit. Example output could be:
sv: Skriv ut Pythons versionsnummer och avsluta. Exempel på utdata kan vara:

source: When given twice, print more information about the build, like:
sv: När det ges två gånger, skriv ut mer information om byggnaden, t.ex:

source: Python 3.8.0b2+ (3.8:0c076caaa8, Apr 20 2019, 21:55:00) [GCC 6.2.0 20161005]
sv: Python 3.8.0b2+ (3.8:0c076caaa8, 20 apr 2019, 21:55:00) [GCC 6.2.0 20161005]

source: The ``-VV`` option.
sv: Alternativet ``-VV``.

source: Miscellaneous options
sv: Diverse alternativ

source: Issue a warning when converting :class:`bytes` or :class:`bytearray` to :class:`str` without specifying encoding or comparing :class:`!bytes` or :class:`!bytearray` with :class:`!str` or :class:`!bytes` with :class:`int`. Issue an error when the option is given twice (:option:`!-bb`).
sv: Utfärda en varning när du konverterar :class:`bytes` eller :class:`bytearray` till :class:`str` utan att ange kodning eller jämför :class:`!bytes` eller :class:`!bytearray` med :class:`!str` eller :class:`!bytes` med :class:`int`. Utfärdar ett fel när alternativet ges två gånger (:option:`!-bb`).

source: Affects also comparisons of :class:`bytes` with :class:`int`.
sv: Påverkar även jämförelser av :class:`bytes` med :class:`int`.

source: If given, Python won't try to write ``.pyc`` files on the import of source modules. See also :envvar:`PYTHONDONTWRITEBYTECODE`.
sv: Om den anges kommer Python inte att försöka skriva ``.pyc``-filer vid import av källmoduler. Se även :envvar:`PYTHONDONTWRITEBYTECODE`.

source: Control the validation behavior of hash-based ``.pyc`` files. See :ref:`pyc-invalidation`. When set to ``default``, checked and unchecked hash-based bytecode cache files are validated according to their default semantics. When set to ``always``, all hash-based ``.pyc`` files, whether checked or unchecked, are validated against their corresponding source file. When set to ``never``, hash-based ``.pyc`` files are not validated against their corresponding source files.
sv: Styr valideringsbeteendet för hash-baserade ``.pyc``-filer. Se :ref:`pyc-invalidation`. När den är inställd på ``default`` valideras kontrollerade och okontrollerade hash-baserade bytecode-cache-filer enligt deras standardsemantik. När den är inställd på ``always`` valideras alla hashbaserade ``.pyc``-filer, oavsett om de är markerade eller ej, mot motsvarande källfil. När den är inställd på ``never`` valideras inte hash-baserade ``.pyc``-filer mot motsvarande källfiler.

source: The semantics of timestamp-based ``.pyc`` files are unaffected by this option.
sv: Semantiken för tidsstämpelbaserade ``.pyc``-filer påverkas inte av detta alternativ.

source: Turn on parser debugging output (for expert only). See also the :envvar:`PYTHONDEBUG` environment variable.
sv: Aktivera felsökning av parsern (endast för experter). Se även miljövariabeln :envvar:`PYTHONDEBUG`.

source: This option requires a :ref:`debug build of Python <debug-build>`, otherwise it's ignored.
sv: Detta alternativ kräver en :ref:`debug-version av Python <debug-build>`, annars ignoreras det.

source: Ignore all ``PYTHON*`` environment variables, e.g. :envvar:`PYTHONPATH` and :envvar:`PYTHONHOME`, that might be set.
sv: Ignorera alla ``PYTHON*`` miljövariabler, t.ex. :envvar:`PYTHONPATH` och :envvar:`PYTHONHOME`, som kan vara inställda.

source: See also the :option:`-P` and :option:`-I` (isolated) options.
sv: Se även alternativen :option:`-P` och :option:`-I` (isolerade).

source: Enter interactive mode after execution.
sv: Gå till interaktivt läge efter körning.

source: Using the :option:`-i` option will enter interactive mode in any of the following circumstances\:
sv: Om du använder alternativet :option:`-i` aktiveras interaktivt läge under någon av följande omständigheter:

source: When a script is passed as first argument
sv: När ett skript skickas som första argument

source: When the :option:`-c` option is used
sv: När alternativet :option:`-c` används

source: When the :option:`-m` option is used
sv: När alternativet :option:`-m` används

source: Interactive mode will start even when :data:`sys.stdin` does not appear to be a terminal. The :envvar:`PYTHONSTARTUP` file is not read.
sv: Interaktivt läge kommer att starta även om :data:`sys.stdin` inte verkar vara en terminal. Filen :envvar:`PYTHONSTARTUP` läses inte.

source: This can be useful to inspect global variables or a stack trace when a script raises an exception. See also :envvar:`PYTHONINSPECT`.
sv: Detta kan vara användbart för att inspektera globala variabler eller en stackspårning när ett skript ger upphov till ett undantag. Se även :envvar:`PYTHONINSPECT`.

source: Run Python in isolated mode. This also implies :option:`-E`, :option:`-P` and :option:`-s` options.
sv: Kör Python i isolerat läge. Detta innebär också alternativen :option:`-E`, :option:`-P` och :option:`-s`.

source: In isolated mode :data:`sys.path` contains neither the script's directory nor the user's site-packages directory. All ``PYTHON*`` environment variables are ignored, too. Further restrictions may be imposed to prevent the user from injecting malicious code.
sv: I isolerat läge innehåller :data:`sys.path` varken skriptets katalog eller användarens katalog för site-paket. Alla ``PYTHON*`` miljövariabler ignoreras också. Ytterligare restriktioner kan införas för att förhindra att användaren injicerar skadlig kod.

source: Remove assert statements and any code conditional on the value of :const:`__debug__`. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-1`` before the ``.pyc`` extension (see :pep:`488`). See also :envvar:`PYTHONOPTIMIZE`.
sv: Ta bort assert-satser och all kod som är villkorad av värdet på :const:`__debug__`. Förbättra filnamnet för kompilerade (:term:`bytecode`) filer genom att lägga till ``.opt-1`` före ``.pyc`` (se :pep:`488`). Se även :envvar:`PYTHONOPTIMIZE`.

source: Modify ``.pyc`` filenames according to :pep:`488`.
sv: Ändra ``.pyc`` filnamn enligt :pep:`488`.

source: Do :option:`-O` and also discard docstrings. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-2`` before the ``.pyc`` extension (see :pep:`488`).
sv: Gör :option:`-O` och kasta även docstrings. Förbättra filnamnet för kompilerade (:term:`bytecode`) filer genom att lägga till ``.opt-2`` före tillägget ``.pyc`` (se :pep:`488``).

source: Don't prepend a potentially unsafe path to :data:`sys.path`:
sv: Lägg inte till en potentiellt osäker sökväg till :data:`sys.path`:

source: ``python -m module`` command line: Don't prepend the current working directory.
sv: ``python -m modul`` kommandoraden: Lägg inte till den aktuella arbetskatalogen före.

source: ``python script.py`` command line: Don't prepend the script's directory. If it's a symbolic link, resolve symbolic links.
sv: ``python script.py`` kommandoraden: Ange inte skriptets katalog i förväg. Om det är en symbolisk länk, lös symboliska länkar.

source: ``python -c code`` and ``python`` (REPL) command lines: Don't prepend an empty string, which means the current working directory.
sv: kommandoraderna ``python -c code`` och ``python`` (REPL): Lägg inte till en tom sträng, vilket betyder den aktuella arbetskatalogen.

source: See also the :envvar:`PYTHONSAFEPATH` environment variable, and :option:`-E` and :option:`-I` (isolated) options.
sv: Se även miljövariabeln :envvar:`PYTHONSAFEPATH` och alternativen :option:`-E` och :option:`-I` (isolerade).

source: Don't display the copyright and version messages even in interactive mode.
sv: Visa inte copyright- och versionsmeddelanden ens i interaktivt läge.

source: Turn on hash randomization. This option only has an effect if the :envvar:`PYTHONHASHSEED` environment variable is set to ``0``, since hash randomization is enabled by default.
sv: Slå på randomisering av hash. Detta alternativ har endast effekt om miljövariabeln :envvar:`PYTHONHASHSEED` är inställd på ``0``, eftersom hashslumpning är aktiverat som standard.

source: On previous versions of Python, this option turns on hash randomization, so that the :meth:`~object.__hash__` values of str and bytes objects are "salted" with an unpredictable random value. Although they remain constant within an individual Python process, they are not predictable between repeated invocations of Python.
sv: I tidigare versioner av Python aktiverar detta alternativ hash-randomisering, så att :meth:`~object.__hash__`-värdena för str- och bytes-objekt "saltas" med ett oförutsägbart slumpmässigt värde. Även om de förblir konstanta inom en enskild Python-process, är de inte förutsägbara mellan upprepade anrop av Python.

source: Hash randomization is intended to provide protection against a denial-of-service caused by carefully chosen inputs that exploit the worst case performance of a dict construction, *O*\ (*n*\ :sup:`2`) complexity. See http://ocert.org/advisories/ocert-2011-003.html for details.
sv: Hash-randomisering är avsedd att ge skydd mot en överbelastningsattack som orsakas av noggrant utvalda indata som utnyttjar den sämsta prestandan för en dict-konstruktion, *O*\ (*n*\ :sup:`2`) komplexitet. Se http://ocert.org/advisories/ocert-2011-003.html för mer information.

source: :envvar:`PYTHONHASHSEED` allows you to set a fixed value for the hash seed secret.
sv: :envvar:`PYTHONHASHSEED` gör att du kan ange ett fast värde för hashfröets hemlighet.

source: The option is no longer ignored.
sv: Alternativet ignoreras inte längre.

source: Don't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
sv: Lägg inte till katalogen :data:`user site-packages <site.USER_SITE>` i :data:`sys.path`.

source: See also :envvar:`PYTHONNOUSERSITE`.
sv: Se även :envvar:`PYTHONNOUSERSITE`.

source: :pep:`370` -- Per user site-packages directory
sv: :pep:`370` -- Katalog för webbplats-paket för varje användare

source: Disable the import of the module :mod:`site` and the site-dependent manipulations of :data:`sys.path` that it entails. Also disable these manipulations if :mod:`site` is explicitly imported later (call :func:`site.main` if you want them to be triggered).
sv: Inaktivera importen av modulen :mod:`site` och de platsberoende manipuleringarna av :data:`sys.path` som den medför. Inaktivera även dessa manipuleringar om :mod:`site` uttryckligen importeras senare (anropa :func:`site.main` om du vill att de ska utlösas).
