Repository: yeager/python-docs-sv
Catalog: using/ios.po
Languages: sv

source: set -e install_dylib () { INSTALL_BASE=$1 FULL_EXT=$2 # The name of the extension file EXT=$(basename "$FULL_EXT") # The location of the extension file, relative to the bundle RELATIVE_EXT=${FULL_EXT#$CODESIGNING_FOLDER_PATH/} # The path to the extension file, relative to the install base PYTHON_EXT=${RELATIVE_EXT/$INSTALL_BASE/} # The full dotted name of the extension module, constructed from the file path. FULL_MODULE_NAME=$(echo $PYTHON_EXT | cut -d "." -f 1 | tr "/" "."); # A bundle identifier; not actually used, but required by Xcode framework packaging FRAMEWORK_BUNDLE_ID=$(echo $PRODUCT_BUNDLE_IDENTIFIER.$FULL_MODULE_NAME | tr "_" "-") # The name of the framework folder. FRAMEWORK_FOLDER="Frameworks/$FULL_MODULE_NAME.framework" # If the framework folder doesn't exist, create it. if [ ! -d "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER" ]; then echo "Creating framework for $RELATIVE_EXT" mkdir -p "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER" cp "$CODESIGNING_FOLDER_PATH/dylib-Info-template.plist" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/Info.plist" plutil -replace CFBundleExecutable -string "$FULL_MODULE_NAME" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/Info.plist" plutil -replace CFBundleIdentifier -string "$FRAMEWORK_BUNDLE_ID" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/Info.plist" fi echo "Installing binary for $FRAMEWORK_FOLDER/$FULL_MODULE_NAME" mv "$FULL_EXT" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/$FULL_MODULE_NAME" # Create a placeholder .fwork file where the .so was echo "$FRAMEWORK_FOLDER/$FULL_MODULE_NAME" > ${FULL_EXT%.so}.fwork # Create a back reference to the .so file location in the framework echo "${RELATIVE_EXT%.so}.fwork" > "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/$FULL_MODULE_NAME.origin" } PYTHON_VER=$(ls -1 "$CODESIGNING_FOLDER_PATH/python/lib") echo "Install Python $PYTHON_VER standard library extension modules..." find "$CODESIGNING_FOLDER_PATH/python/lib/$PYTHON_VER/lib-dynload" -name "*.so" | while read FULL_EXT; do install_dylib python/lib/$PYTHON_VER/lib-dynload/ "$FULL_EXT" done # Clean up dylib template rm -f "$CODESIGNING_FOLDER_PATH/dylib-Info-template.plist" echo "Signing frameworks as $EXPANDED_CODE_SIGN_IDENTITY_NAME ($EXPANDED_CODE_SIGN_IDENTITY)..." find "$CODESIGNING_FOLDER_PATH/Frameworks" -name "*.framework" -exec /usr/bin/codesign --force --sign "$EXPANDED_CODE_SIGN_IDENTITY" ${OTHER_CODE_SIGN_FLAGS:-} -o runtime --timestamp=none --preserve-metadata=identifier,entitlements,flags --generate-entitlement-der "{}" \;
sv: ställa in -e install_dylib () { INSTALL_BASE=$1 FULL_EXT=$2 # Namnet på tilläggsfilen EXT=$(basnamn "$FULL_EXT") # Platsen för tilläggsfilen, i förhållande till paketet RELATIVE_EXT=${FULL_EXT#$CODESIGNING_FOLDER_PATH/} # Sökvägen till tilläggsfilen, i förhållande till installationsbasen PYTHON_EXT=${RELATIVE_EXT/$INSTALL_BASE/} # Det fullständiga prickade namnet på tilläggsmodulen, konstruerat från filsökvägen. FULL_MODULE_NAME=$(echo $PYTHON_EXT | cut -d "." -f 1 | tr "/" "."); # En paketidentifierare; används egentligen inte, men krävs för paketering av Xcode-ramverket FRAMEWORK_BUNDLE_ID=$(echo $PRODUCT_BUNDLE_IDENTIFIER.$FULL_MODULE_NAME | tr "_" "-") # Namnet på ramverksmappen. FRAMEWORK_FOLDER="Frameworks/$FULL_MODULE_NAME.framework" # Om ramverksmappen inte finns, skapa den. if [ ! -d "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER" ]; then echo "Skapar ramverk för $RELATIVE_EXT" mkdir -p "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER" cp "$CODESIGNING_FOLDER_PATH/dylib-Info-template.plist" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/Info.plist" plutil -replace CFBundleExecutable -string "$FULL_MODULE_NAME" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/Info.plist" plutil -replace CFBundleIdentifier -string "$FRAMEWORK_BUNDLE_ID" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/Info.plist" fi echo "Installerar binärfil för $FRAMEWORK_FOLDER/$FULL_MODULE_NAME" mv "$FULL_EXT" "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/$FULL_MODULE_NAME" # Skapa en platshållare för .fwork-filen där .so fanns echo "$FRAMEWORK_FOLDER/$FULL_MODULE_NAME" > ${FULL_EXT%.so}.fwork # Skapa en bakre referens till .so-filens plats i ramverket echo "${RELATIVE_EXT%.so}.fwork" > "$CODESIGNING_FOLDER_PATH/$FRAMEWORK_FOLDER/$FULL_MODULE_NAME.origin" } PYTHON_VER=$(ls -1 "$CODESIGNING_FOLDER_PATH/python/lib") echo "Installera Python $PYTHON_VER standardbibliotekets tilläggsmoduler ..." find "$CODESIGNING_FOLDER_PATH/python/lib/$PYTHON_VER/lib-dynload" -name "*.so" | while read FULL_EXT; do install_dylib python/lib/$PYTHON_VER/lib-dynload/ "$FULL_EXT" done # Rensa upp dylib-mallen rm -f "$CODESIGNING_FOLDER_PATH/dylib-Info-template.plist" echo "Signerar ramverk som $EXPANDED_CODE_SIGN_IDENTITY_NAME ($EXPANDED_CODE_SIGN_IDENTITY) ..." find "$CODESIGNING_FOLDER_PATH/Frameworks" -name "*.framework" -exec /usr/bin/codesign --force --sign "$EXPANDED_CODE_SIGN_IDENTITY" ${OTHER_CODE_SIGN_FLAGS:-} -o runtime --timestamp=none --preserve-metadata=identifier,entitlements,flags --generate-entitlement-der "{}" \;

source: Add Objective C code to initialize and use a Python interpreter in embedded mode. You should ensure that:
sv: Lägg till Objective C-kod för att initiera och använda en Python-tolk i inbäddat läge. Du bör se till att:

source: UTF-8 mode (:c:member:`PyPreConfig.utf8_mode`) is *enabled*;
sv: UTF-8-läget (:c:member:`PyPreConfig.utf8_mode`) är *aktiverat*;

source: Buffered stdio (:c:member:`PyConfig.buffered_stdio`) is *disabled*;
sv: Buffered stdio (:c:member:`PyConfig.buffered_stdio`) är *inaktiverad*;

source: Writing bytecode (:c:member:`PyConfig.write_bytecode`) is *disabled*;
sv: Skrivning av bytecode (:c:member:`PyConfig.write_bytecode`) är *inaktiverad*;

source: Signal handlers (:c:member:`PyConfig.install_signal_handlers`) are *enabled*;
sv: Signalhanterare (:c:member:`PyConfig.install_signal_handlers`) är *aktiverade*;

source: System logging (:c:member:`PyConfig.use_system_logger`) is *enabled* (optional, but strongly recommended; this is enabled by default);
sv: Systemloggning (:c:member:`PyConfig.use_system_logger`) är *aktiverad* (valfritt, men rekommenderas starkt; detta är aktiverat som standard);

source: :envvar:`PYTHONHOME` for the interpreter is configured to point at the ``python`` subfolder of your app's bundle; and
sv: :envvar:`PYTHONHOME` för tolken är konfigurerad att peka på undermappen ``python`` i din apps paket; och

source: The :envvar:`PYTHONPATH` for the interpreter includes:
sv: :envvar:`PYTHONPATH` för tolken inkluderar:

source: the ``python/lib/python3.X`` subfolder of your app's bundle,
sv: undermappen ``python/lib/python3.X`` i din apps paket,

source: the ``python/lib/python3.X/lib-dynload`` subfolder of your app's bundle, and
sv: undermappen ``python/lib/python3.X/lib-dynload`` i din apps paket, och

source: the ``app`` subfolder of your app's bundle
sv: undermappen ``app`` i din apps paket

source: Your app's bundle location can be determined using ``[[NSBundle mainBundle] resourcePath]``.
sv: Appens bundle-plats kan bestämmas med hjälp av ``[[NSBundle mainBundle] resourcePath]``.

source: Steps 8, 9 and 10 of these instructions assume that you have a single folder of pure Python application code, named ``app``. If you have third-party binary modules in your app, some additional steps will be required:
sv: Steg 8, 9 och 10 i dessa instruktioner förutsätter att du har en enda mapp med ren Python-applikationskod, som heter ``app``. Om du har binära moduler från tredje part i din app krävs ytterligare några steg:

source: You need to ensure that any folders containing third-party binaries are either associated with the app target, or copied in as part of step 8. Step 8 should also purge any binaries that are not appropriate for the platform a specific build is targeting (i.e., delete any device binaries if you're building an app targeting the simulator).
sv: Du måste se till att alla mappar som innehåller binärfiler från tredje part antingen är associerade med appens mål eller kopieras in som en del av steg 8. I steg 8 bör du också rensa bort alla binärfiler som inte är lämpliga för den plattform som en specifik build är inriktad på (dvs. ta bort alla enhetsbinärfiler om du bygger en app som är inriktad på simulatorn).

source: Any folders that contain third-party binaries must be processed into framework form by step 9. The invocation of ``install_dylib`` that processes the ``lib-dynload`` folder can be copied and adapted for this purpose.
sv: Alla mappar som innehåller binärfiler från tredje part måste bearbetas till ramverksform i steg 9. Anropet av ``install_dylib`` som bearbetar mappen ``lib-dynload`` kan kopieras och anpassas för detta ändamål.

source: If you're using a separate folder for third-party packages, ensure that folder is included as part of the :envvar:`PYTHONPATH` configuration in step 10.
sv: Om du använder en separat mapp för tredjepartspaket ska du se till att den mappen ingår som en del av :envvar:`PYTHONPATH`-konfigurationen i steg 10.

source: If any of the folders that contain third-party packages will contain ``.pth`` files, you should add that folder as a *site directory* (using :meth:`site.addsitedir`), rather than adding to :envvar:`PYTHONPATH` or :attr:`sys.path` directly.
sv: Om någon av mapparna som innehåller tredjepartspaket kommer att innehålla ``.pth``-filer bör du lägga till den mappen som en *site-katalog* (med :meth:`site.addsitedir`), i stället för att lägga till den direkt i :envvar:`PYTHONPATH` eller :attr:`sys.path`.

source: Testing a Python package
sv: Testa ett Python-paket

source: The CPython source tree contains :source:`a testbed project <iOS/testbed>` that is used to run the CPython test suite on the iOS simulator. This testbed can also be used as a testbed project for running your Python library's test suite on iOS.
sv: CPythons källträd innehåller :source:`ett testbäddsprojekt <iOS/testbed>` som används för att köra CPythons testsvit på iOS-simulatorn. Denna testbädd kan också användas som ett testbäddsprojekt för att köra ditt Python-biblioteks testsvit på iOS.

source: After building or obtaining an iOS XCFramework (See :source:`iOS/README.rst` for details), create a clone of the Python iOS testbed project by running:
sv: När du har byggt eller hämtat ett iOS XCFramework (se :source:`iOS/README.rst` för detaljer) skapar du en klon av Python iOS-testbäddsprojektet genom att köra:

source: You will need to modify the ``iOS/testbed`` reference to point to that directory in the CPython source tree; any folders specified with the ``--app`` flag will be copied into the cloned testbed project. The resulting testbed will be created in the ``app-testbed`` folder. In this example, the ``module1`` and ``module2`` would be importable modules at runtime. If your project has additional dependencies, they can be installed into the ``app-testbed/iOSTestbed/app_packages`` folder (using ``pip install --target app-testbed/iOSTestbed/app_packages`` or similar).
sv: Du måste ändra ``iOS/testbed``-referensen så att den pekar på den katalogen i CPythons källträd; alla mappar som anges med flaggan ``--app`` kommer att kopieras till det klonade testbäddsprojektet. Den resulterande testbädden kommer att skapas i mappen ``app-testbed``. I det här exemplet skulle ``modul1`` och ``modul2`` vara importerbara moduler vid körning. Om ditt projekt har ytterligare beroenden kan de installeras i mappen ``app-testbed/iOSTestbed/app_packages`` (med hjälp av ``pip install --target app-testbed/iOSTestbed/app_packages`` eller liknande).

source: You can then use the ``app-testbed`` folder to run the test suite for your app, For example, if ``module1.tests`` was the entry point to your test suite, you could run:
sv: Du kan sedan använda mappen ``app-testbed`` för att köra testsviten för din app, Till exempel, om ``module1.tests`` var ingångspunkten till din testsvit, kan du köra:

source: This is the equivalent of running ``python -m module1.tests`` on a desktop Python build. Any arguments after the ``--`` will be passed to the testbed as if they were arguments to ``python -m`` on a desktop machine.
sv: Detta motsvarar att köra ``python -m module1.tests`` på en Python-byggd på skrivbordet. Alla argument efter ``--`` kommer att skickas till testbädden som om de vore argument till ``python -m`` på en skrivbordsmaskin.

source: You can also open the testbed project in Xcode by running:
sv: Du kan också öppna testbäddsprojektet i Xcode genom att köra:

source: $ open app-testbed/iOSTestbed.xcodeproj
sv: $ öppna app-testbed/iOSTestbed.xcodeproj

source: This will allow you to use the full Xcode suite of tools for debugging.
sv: Detta gör att du kan använda hela Xcode-sviten med verktyg för felsökning.

source: App Store Compliance
sv: App Store-överensstämmelse

source: The only mechanism for distributing apps to third-party iOS devices is to submit the app to the iOS App Store; apps submitted for distribution must pass Apple's app review process. This process includes a set of automated validation rules that inspect the submitted application bundle for problematic code.
sv: Den enda mekanismen för att distribuera appar till iOS-enheter från tredje part är att skicka in appen till iOS App Store; appar som skickas in för distribution måste passera Apples appgranskningsprocess. Denna process innehåller en uppsättning automatiserade valideringsregler som inspekterar det inlämnade applikationspaketet för problematisk kod.

source: The Python standard library contains some code that is known to violate these automated rules. While these violations appear to be false positives, Apple's review rules cannot be challenged; so, it is necessary to modify the Python standard library for an app to pass App Store review.
sv: Pythons standardbibliotek innehåller viss kod som är känd för att bryta mot dessa automatiserade regler. Även om dessa överträdelser verkar vara falskt positiva kan Apples granskningsregler inte ifrågasättas, så det är nödvändigt att modifiera Python-standardbiblioteket för att en app ska klara App Store-granskningen.

source: The Python source tree contains :source:`a patch file <Mac/Resources/app-store-compliance.patch>` that will remove all code that is known to cause issues with the App Store review process. This patch is applied automatically when building for iOS.
sv: Pythons källkodsträd innehåller :source:`en patchfil <Mac/Resources/app-store-compliance.patch>` som tar bort all kod som är känd för att orsaka problem med App Stores granskningsprocess. Denna patch tillämpas automatiskt när du bygger för iOS.
