Repository: yeager/python-docs-sv
Catalog: using/ios.po
Languages: sv

source: Using Python on iOS
sv: Använda Python på iOS

source: Authors
sv: Författare

source: Python on iOS is unlike Python on desktop platforms. On a desktop platform, Python is generally installed as a system resource that can be used by any user of that computer. Users then interact with Python by running a :program:`python` executable and entering commands at an interactive prompt, or by running a Python script.
sv: Python på iOS är olikt Python på stationära plattformar. På en stationär plattform installeras Python vanligtvis som en systemresurs som kan användas av alla användare av den datorn. Användare interagerar sedan med Python genom att köra en körbar :program:`python` och ange kommandon i en interaktiv prompt, eller genom att köra ett Python-skript.

source: On iOS, there is no concept of installing as a system resource. The only unit of software distribution is an "app". There is also no console where you could run a :program:`python` executable, or interact with a Python REPL.
sv: På iOS finns det inget koncept för installation som en systemresurs. Den enda enheten för distribution av programvara är en "app". Det finns inte heller någon konsol där du kan köra en :program:`python`-körbar fil eller interagera med en Python REPL.

source: As a result, the only way you can use Python on iOS is in embedded mode - that is, by writing a native iOS application, and embedding a Python interpreter using ``libPython``, and invoking Python code using the :ref:`Python embedding API <embedding>`. The full Python interpreter, the standard library, and all your Python code is then packaged as a standalone bundle that can be distributed via the iOS App Store.
sv: Som ett resultat är det enda sättet du kan använda Python på iOS i inbäddat läge - det vill säga genom att skriva en inbyggd iOS-applikation och bädda in en Python-tolk med hjälp av ``libPython`` och anropa Python-kod med hjälp av :ref:``Python embedding API <embedding>``. Den fullständiga Python-tolken, standardbiblioteket och all din Python-kod paketeras sedan som ett fristående paket som kan distribueras via iOS App Store.

source: If you're looking to experiment for the first time with writing an iOS app in Python, projects such as `BeeWare <https://beeware.org>`__ and `Kivy <https://kivy.org>`__ will provide a much more approachable user experience. These projects manage the complexities associated with getting an iOS project running, so you only need to deal with the Python code itself.
sv: Om du vill experimentera för första gången med att skriva en iOS-app i Python, kommer projekt som `BeeWare <https://beeware.org>`__ och `Kivy <https://kivy.org>`__ att ge en mycket mer lättillgänglig användarupplevelse. Dessa projekt hanterar de komplexiteter som är förknippade med att få ett iOS-projekt att köra, så att du bara behöver hantera själva Python-koden.

source: Python at runtime on iOS
sv: Python i körtid på iOS

source: iOS version compatibility
sv: kompatibilitet med iOS-versioner

source: The minimum supported iOS version is specified at compile time, using the :option:`--host` option to ``configure``. By default, when compiled for iOS, Python will be compiled with a minimum supported iOS version of 13.0. To use a different minimum iOS version, provide the version number as part of the :option:`!--host` argument - for example, ``--host=arm64-apple-ios15.4-simulator`` would compile an ARM64 simulator build with a deployment target of 15.4.
sv: Den minsta iOS-versionen som stöds anges vid kompileringstillfället med hjälp av alternativet :option:`--host` till ``configure``. När Python kompileras för iOS kommer det som standard att kompileras med en minsta iOS-version som stöds på 13.0. För att använda en annan minsta iOS-version, ange versionsnumret som en del av :option:`!--host`-argumentet - till exempel, ``--host=arm64-apple-ios15.4-simulator`` skulle kompilera en ARM64-simulatorbyggnad med ett implementeringsmål på 15.4.

source: Platform identification
sv: Identifiering av plattform

source: When executing on iOS, ``sys.platform`` will report as ``ios``. This value will be returned on an iPhone or iPad, regardless of whether the app is running on the simulator or a physical device.
sv: Vid exekvering på iOS kommer ``sys.platform`` att rapportera som ``ios``. Detta värde kommer att returneras på en iPhone eller iPad, oavsett om appen körs på simulatorn eller en fysisk enhet.

source: Information about the specific runtime environment, including the iOS version, device model, and whether the device is a simulator, can be obtained using :func:`platform.ios_ver`. :func:`platform.system` will report ``iOS`` or ``iPadOS``, depending on the device.
sv: Information om den specifika körtidsmiljön, inklusive iOS-versionen, enhetsmodellen och om enheten är en simulator, kan erhållas med :func:`platform.ios_ver`. :func:`platform.system` rapporterar ``iOS`` eller ``iPadOS``, beroende på enheten.

source: :func:`os.uname` reports kernel-level details; it will report a name of ``Darwin``.
sv: :func:`os.uname` rapporterar detaljer på kärnnivå; den kommer att rapportera ett namn på ``Darwin``.

source: Standard library availability
sv: Tillgänglighet för standardbibliotek

source: The Python standard library has some notable omissions and restrictions on iOS. See the :ref:`API availability guide for iOS <mobile-availability>` for details.
sv: Pythons standardbibliotek har några anmärkningsvärda utelämnanden och begränsningar på iOS. Se :ref:`API availability guide for iOS <mobile-availability>` för mer information.

source: Binary extension modules
sv: Binära tilläggsmoduler

source: One notable difference about iOS as a platform is that App Store distribution imposes hard requirements on the packaging of an application. One of these requirements governs how binary extension modules are distributed.
sv: En märkbar skillnad med iOS som plattform är att distributionen via App Store ställer hårda krav på paketeringen av en applikation. Ett av dessa krav reglerar hur binära tilläggsmoduler distribueras.

source: The iOS App Store requires that *all* binary modules in an iOS app must be dynamic libraries, contained in a framework with appropriate metadata, stored in the ``Frameworks`` folder of the packaged app. There can be only a single binary per framework, and there can be no executable binary material outside the ``Frameworks`` folder.
sv: IOS App Store kräver att *alla* binära moduler i en iOS-app måste vara dynamiska bibliotek, som ingår i ett ramverk med lämpliga metadata, som lagras i mappen ``Frameworks`` i den paketerade appen. Det får bara finnas en enda binär modul per ramverk och det får inte finnas något körbart binärt material utanför mappen "Frameworks".

source: This conflicts with the usual Python approach for distributing binaries, which allows a binary extension module to be loaded from any location on ``sys.path``. To ensure compliance with App Store policies, an iOS project must post-process any Python packages, converting ``.so`` binary modules into individual standalone frameworks with appropriate metadata and signing. For details on how to perform this post-processing, see the guide for :ref:`adding Python to your project <adding-ios>`.
sv: Detta strider mot den vanliga Python-metoden för distribution av binära filer, som gör det möjligt att ladda en binär tilläggsmodul från valfri plats på ``sys.path``. För att säkerställa efterlevnad av App Store-policyer måste ett iOS-projekt efterbehandla alla Python-paket och konvertera binära moduler av typen ``.so`` till enskilda fristående ramverk med lämpliga metadata och signering. Mer information om hur du utför denna efterbearbetning finns i guiden för :ref:``addding Python to your project <adding-ios>``.

source: To help Python discover binaries in their new location, the original ``.so`` file on ``sys.path`` is replaced with a ``.fwork`` file. This file is a text file containing the location of the framework binary, relative to the app bundle. To allow the framework to resolve back to the original location, the framework must contain a ``.origin`` file that contains the location of the ``.fwork`` file, relative to the app bundle.
sv: För att hjälpa Python att upptäcka binärfiler på deras nya plats ersätts den ursprungliga filen ``.so`` på ``sys.path`` med en fil ``.fwork``. Den här filen är en textfil som innehåller platsen för ramverkets binärfil i förhållande till appbunten. För att ramverket ska kunna återgå till den ursprungliga platsen måste ramverket innehålla en fil med namnet ``.origin`` som innehåller platsen för filen ``.fwork`` i förhållande till appbunten.

source: For example, consider the case of an import ``from foo.bar import _whiz``, where ``_whiz`` is implemented with the binary module ``sources/foo/bar/_whiz.abi3.so``, with ``sources`` being the location registered on ``sys.path``, relative to the application bundle. This module *must* be distributed as ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (creating the framework name from the full import path of the module), with an ``Info.plist`` file in the ``.framework`` directory identifying the binary as a framework. The ``foo.bar._whiz`` module would be represented in the original location with a ``sources/foo/bar/_whiz.abi3.fwork`` marker file, containing the path ``Frameworks/foo.bar._whiz/foo.bar._whiz``. The framework would also contain ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, containing the path to the ``.fwork`` file.
sv: Tänk till exempel på fallet med en import ``from foo.bar import _whiz``, där ``_whiz`` implementeras med den binära modulen ``sources/foo/bar/_whiz.abi3.so``, där ``sources`` är den plats som registrerats på ``sys.path``, relativt programpaketet. Den här modulen *måste* distribueras som ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (ramverkets namn skapas från modulens fullständiga importsökväg), med en ``Info.plist``-fil i katalogen ``.framework`` som identifierar binärfilen som ett ramverk. Modulen ``foo.bar._whiz`` skulle representeras på den ursprungliga platsen med en ``källor/foo/bar/_whiz.abi3.fwork`` markörfil, som innehåller sökvägen ``Frameworks/foo.bar._whiz/foo.bar._whiz``. Ramverket skulle också innehålla ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, som innehåller sökvägen till filen ``.fwork``.

source: When running on iOS, the Python interpreter will install an :class:`~importlib.machinery.AppleFrameworkLoader` that is able to read and import ``.fwork`` files. Once imported, the ``__file__`` attribute of the binary module will report as the location of the ``.fwork`` file. However, the :class:`~importlib.machinery.ModuleSpec` for the loaded module will report the ``origin`` as the location of the binary in the framework folder.
sv: När du kör på iOS kommer Python-tolken att installera en :class:`~importlib.machinery.AppleFrameworkLoader` som kan läsa och importera ``.fwork``-filer. När den har importerats kommer attributet ``__file__`` i den binära modulen att rapportera platsen för filen ``.fwork``. Men :class:`~importlib.machinery.ModuleSpec` för den inlästa modulen kommer att rapportera ``origin`` som platsen för den binära filen i ramverksmappen.

source: Compiler stub binaries
sv: Kompilatorns stubbinaries

source: Xcode doesn't expose explicit compilers for iOS; instead, it uses an ``xcrun`` script that resolves to a full compiler path (e.g., ``xcrun --sdk iphoneos clang`` to get the ``clang`` for an iPhone device). However, using this script poses two problems:
sv: Xcode exponerar inte explicita kompilatorer för iOS; istället använder det ett ``xcrun``-skript som löser till en fullständig kompilatorsökväg (t.ex. ``xcrun --sdk iphoneos clang`` för att få ``clang`` för en iPhone-enhet). Att använda detta skript innebär dock två problem:

source: The output of ``xcrun`` includes paths that are machine specific, resulting in a sysconfig module that cannot be shared between users; and
sv: Utdata från ``xcrun`` innehåller sökvägar som är maskinspecifika, vilket resulterar i en sysconfig-modul som inte kan delas mellan användare; och

source: It results in ``CC``/``CPP``/``LD``/``AR`` definitions that include spaces. There is a lot of C ecosystem tooling that assumes that you can split a command line at the first space to get the path to the compiler executable; this isn't the case when using ``xcrun``.
sv: Det resulterar i ``CC``/``CPP``/``LD``/``AR``-definitioner som innehåller mellanslag. Det finns många verktyg för C-ekosystem som förutsätter att du kan dela en kommandorad vid det första mellanslaget för att få sökvägen till kompilatorns körbara fil; detta är inte fallet när du använder ``xcrun``.

source: To avoid these problems, Python provided stubs for these tools. These stubs are shell script wrappers around the underingly ``xcrun`` tools, distributed in a ``bin`` folder distributed alongside the compiled iOS framework. These scripts are relocatable, and will always resolve to the appropriate local system paths. By including these scripts in the bin folder that accompanies a framework, the contents of the ``sysconfig`` module becomes useful for end-users to compile their own modules. When compiling third-party Python modules for iOS, you should ensure these stub binaries are on your path.
sv: För att undvika dessa problem tillhandahöll Python stubbar för dessa verktyg. Dessa stubbar är skalskriptomslag runt de underliggande ``xcrun``-verktygen, som distribueras i en ``bin``-mapp som distribueras tillsammans med det kompilerade iOS-ramverket. Dessa skript är flyttbara och kommer alltid att lösa upp till lämpliga lokala systemsökvägar. Genom att inkludera dessa skript i bin-mappen som följer med ett ramverk blir innehållet i modulen ``sysconfig`` användbart för slutanvändare som vill kompilera sina egna moduler. När du kompilerar Python-moduler från tredje part för iOS bör du se till att dessa stubbinaries finns på din sökväg.

source: Installing Python on iOS
sv: Installera Python på iOS

source: Tools for building iOS apps
sv: Verktyg för att bygga iOS-appar

source: Building for iOS requires the use of Apple's Xcode tooling. It is strongly recommended that you use the most recent stable release of Xcode. This will require the use of the most (or second-most) recently released macOS version, as Apple does not maintain Xcode for older macOS versions. The Xcode Command Line Tools are not sufficient for iOS development; you need a *full* Xcode install.
sv: För att bygga för iOS krävs att du använder Apples Xcode-verktyg. Vi rekommenderar starkt att du använder den senaste stabila versionen av Xcode. Detta kräver att du använder den senaste (eller näst senaste) macOS-versionen, eftersom Apple inte underhåller Xcode för äldre macOS-versioner. Xcode Command Line Tools är inte tillräckligt för iOS-utveckling; du behöver en *fullständig* Xcode-installation.

source: If you want to run your code on the iOS simulator, you'll also need to install an iOS Simulator Platform. You should be prompted to select an iOS Simulator Platform when you first run Xcode. Alternatively, you can add an iOS Simulator Platform by selecting from the Platforms tab of the Xcode Settings panel.
sv: Om du vill köra din kod på iOS-simulatorn måste du också installera en iOS Simulator Platform. Du bör uppmanas att välja en iOS Simulator Platform när du först kör Xcode. Alternativt kan du lägga till en iOS-simulatorplattform genom att välja på fliken Plattformar i panelen Inställningar i Xcode.

source: Adding Python to an iOS project
sv: Lägga till Python i ett iOS-projekt

source: Python can be added to any iOS project, using either Swift or Objective C. The following examples will use Objective C; if you are using Swift, you may find a library like `PythonKit <https://github.com/pvieito/PythonKit>`__ to be helpful.
sv: Python kan läggas till i alla iOS-projekt med hjälp av antingen Swift eller Objective C. I följande exempel används Objective C; om du använder Swift kan du ha nytta av ett bibliotek som `PythonKit <https://github.com/pvieito/PythonKit>`__.

source: To add Python to an iOS Xcode project:
sv: Så här lägger du till Python i ett iOS Xcode-projekt:

source: Build or obtain a Python ``XCFramework``. See the instructions in :source:`iOS/README.rst` (in the CPython source distribution) for details on how to build a Python ``XCFramework``. At a minimum, you will need a build that supports ``arm64-apple-ios``, plus one of either ``arm64-apple-ios-simulator`` or ``x86_64-apple-ios-simulator``.
sv: Bygg eller hämta ett Python ``XCFramework``. Se instruktionerna i :source:`iOS/README.rst` (i källdistributionen för CPython) för detaljer om hur man bygger ett Python ``XCFramework``. Du behöver åtminstone ett bygge som stöder ``arm64-apple-ios``, plus en av antingen ``arm64-apple-ios-simulator`` eller ``x86_64-apple-ios-simulator``.

source: Drag the ``XCframework`` into your iOS project. In the following instructions, we'll assume you've dropped the ``XCframework`` into the root of your project; however, you can use any other location that you want by adjusting paths as needed.
sv: Dra ``XCframework`` in i ditt iOS-projekt. I följande instruktioner antar vi att du har släppt ``XCframework`` i roten till ditt projekt; du kan dock använda vilken annan plats du vill genom att justera sökvägar efter behov.

source: Drag the ``iOS/Resources/dylib-Info-template.plist`` file into your project, and ensure it is associated with the app target.
sv: Dra filen ``iOS/Resources/dylib-Info-template.plist`` till ditt projekt och se till att den är associerad med appmålet.

source: Add your application code as a folder in your Xcode project. In the following instructions, we'll assume that your user code is in a folder named ``app`` in the root of your project; you can use any other location by adjusting paths as needed. Ensure that this folder is associated with your app target.
sv: Lägg till din applikationskod som en mapp i ditt Xcode-projekt. I följande instruktioner antar vi att din användarkod finns i en mapp med namnet ``app`` i roten av ditt projekt; du kan använda någon annan plats genom att justera sökvägar efter behov. Se till att den här mappen är kopplad till ditt appmål.

source: Select the app target by selecting the root node of your Xcode project, then the target name in the sidebar that appears.
sv: Välj appens mål genom att välja rotnoden i ditt Xcode-projekt och sedan målnamnet i sidofältet som visas.

source: In the "General" settings, under "Frameworks, Libraries and Embedded Content", add ``Python.xcframework``, with "Embed & Sign" selected.
sv: I inställningarna "General", under "Frameworks, Libraries and Embedded Content", lägg till ``Python.xcframework``, med "Embed & Sign" markerat.

source: In the "Build Settings" tab, modify the following:
sv: På fliken "Build Settings" ändrar du följande:

source: Build Options
sv: Byggalternativ

source: User Script Sandboxing: No
sv: Sandbox för användarskript: Nej

source: Enable Testability: Yes
sv: Aktivera testbarhet: Ja

source: Search Paths
sv: Sökvägar

source: Framework Search Paths: ``$(PROJECT_DIR)``
sv: Sökvägar för ramverk: ``$(PROJECT_DIR)``

source: Header Search Paths: ``"$(BUILT_PRODUCTS_DIR)/Python.framework/Headers"``
sv: Sökvägar för rubriker: ``"$(BUILT_PRODUCTS_DIR)/Python.framework/Headers"``

source: Apple Clang - Warnings - All languages
sv: Apple Clang - Varningar - Alla språk

source: Quoted Include In Framework Header: No
sv: Quoted inkluderas i ramverkets huvud: Nej

source: Add a build step that copies the Python standard library into your app. In the "Build Phases" tab, add a new "Run Script" build step *before* the "Embed Frameworks" step, but *after* the "Copy Bundle Resources" step. Name the step "Install Target Specific Python Standard Library", disable the "Based on dependency analysis" checkbox, and set the script content to:
sv: Lägg till ett byggsteg som kopierar Pythons standardbibliotek till din app. På fliken "Build Phases" lägger du till ett nytt byggsteg "Run Script" *före* steget "Embed Frameworks", men *efter* steget "Copy Bundle Resources". Döp steget till "Install Target Specific Python Standard Library", avmarkera kryssrutan "Based on dependency analysis" och ställ in skriptinnehållet till:

source: set -e mkdir -p "$CODESIGNING_FOLDER_PATH/python/lib" if [ "$EFFECTIVE_PLATFORM_NAME" = "-iphonesimulator" ]; then echo "Installing Python modules for iOS Simulator" rsync -au --delete "$PROJECT_DIR/Python.xcframework/ios-arm64_x86_64-simulator/lib/" "$CODESIGNING_FOLDER_PATH/python/lib/" else echo "Installing Python modules for iOS Device" rsync -au --delete "$PROJECT_DIR/Python.xcframework/ios-arm64/lib/" "$CODESIGNING_FOLDER_PATH/python/lib/" fi
sv: ställa in -e mkdir -p "$CODESIGNING_FOLDER_PATH/python/lib" if [ "$EFFECTIVE_PLATFORM_NAME" = "-iphonesimulator" ]; then echo "Installerar Python-moduler för iOS-simulatorn" rsync -au --delete "$PROJECT_DIR/Python.xcframework/ios-arm64_x86_64-simulator/lib/" "$CODESIGNING_FOLDER_PATH/python/lib/" annat echo "Installerar Python-moduler för iOS-enhet" rsync -au --delete "$PROJECT_DIR/Python.xcframework/ios-arm64/lib/" "$CODESIGNING_FOLDER_PATH/python/lib/" fi

source: Note that the name of the simulator "slice" in the XCframework may be different, depending the CPU architectures your ``XCFramework`` supports.
sv: Observera att namnet på simulatorns "slice" i XCframework kan vara annorlunda beroende på vilka CPU-arkitekturer som stöds av ditt ``XCFramework``.

source: Add a second build step that processes the binary extension modules in the standard library into "Framework" format. Add a "Run Script" build step *directly after* the one you added in step 8, named "Prepare Python Binary Modules". It should also have "Based on dependency analysis" unchecked, with the following script content:
sv: Lägg till ett andra byggsteg som bearbetar de binära tilläggsmodulerna i standardbiblioteket till "Framework"-format. Lägg till ett byggsteg för "Run Script" *direkt efter* det som du lade till i steg 8, med namnet "Prepare Python Binary Modules". Det ska också ha "Based on dependency analysis" avmarkerat, med följande skriptinnehåll:
