Repository: yeager/python-docs-sv
Catalog: using/unix.po
Languages: sv

source: Using Python on Unix platforms
sv: Använda Python på Unix-plattformar

source: Getting and installing the latest version of Python
sv: Hämta och installera den senaste versionen av Python

source: On Linux
sv: På Linux

source: Python comes preinstalled on most Linux distributions, and is available as a package on all others. However there are certain features you might want to use that are not available on your distro's package. You can compile the latest version of Python from source.
sv: Python är förinstallerat på de flesta Linux-distributioner och finns som ett paket på alla andra. Det finns dock vissa funktioner som du kanske vill använda som inte finns tillgängliga i ditt distro-paket. Du kan kompilera den senaste versionen av Python från källan.

source: In the event that the latest version of Python doesn't come preinstalled and isn't in the repositories as well, you can make packages for your own distro. Have a look at the following links:
sv: Om den senaste versionen av Python inte är förinstallerad och inte heller finns i arkiven kan du skapa paket för din egen distro. Ta en titt på följande länkar:

source: for Debian users
sv: för Debian-användare

source: for OpenSuse users
sv: för OpenSuse-användare

source: for Fedora users
sv: för Fedora-användare

source: for Slackware users
sv: för Slackware-användare

source: Installing IDLE
sv: Installera IDLE

source: In some cases, IDLE might not be included in your Python installation.
sv: I vissa fall kanske IDLE inte ingår i din Python-installation.

source: For Debian and Ubuntu users::
sv: För Debian- och Ubuntu-användare::

source: sudo apt update sudo apt install idle
sv: sudo apt uppdatering sudo apt installera idle

source: For Fedora, RHEL, and CentOS users::
sv: För Fedora-, RHEL- och CentOS-användare::

source: sudo dnf install python3-idle
sv: sudo dnf installera python3-idle

source: For SUSE and OpenSUSE users::
sv: För SUSE- och OpenSUSE-användare::

source: sudo zypper install python3-idle
sv: sudo zypper installera python3-idle

source: For Alpine Linux users::
sv: För Alpine Linux-användare::

source: sudo apk add python3-idle
sv: sudo apk lägg till python3-idle

source: On FreeBSD and OpenBSD
sv: På FreeBSD och OpenBSD

source: FreeBSD users, to add the package use::
sv: FreeBSD-användare, för att lägga till paketet använd::

source: pkg install python3
sv: pkg installera python3

source: OpenBSD users, to add the package use::
sv: OpenBSD-användare, för att lägga till paketet använd::

source: For example i386 users get the 2.5.1 version of Python using::
sv: Till exempel får i386-användare 2.5.1-versionen av Python med hjälp av::

source: Building Python
sv: Att bygga Python

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `clone <https://devguide.python.org/setup/#get-the-source-code>`_. (If you want to contribute patches, you will need a clone.)
sv: Om du vill kompilera CPython själv är det första du bör göra att hämta `källan <https://www.python.org/downloads/source/>`_. Du kan ladda ner antingen den senaste versionens källa eller bara ta en ny `klon <https://devguide.python.org/setup/#get-the-source-code>`_. (Om du vill bidra med patchar behöver du en klon)

source: The build process consists of the usual commands::
sv: Byggprocessen består av de vanliga kommandona::

source: ./configure make make install
sv: ./konfigurera make make installera

source: :ref:`Configuration options <configure-options>` and caveats for specific Unix platforms are extensively documented in the :source:`README.rst` file in the root of the Python source tree.
sv: :ref:`Konfigurationsalternativ <configure-options>` och varningar för specifika Unix-plattformar finns utförligt dokumenterade i :source:`README.rst`-filen i roten av Pythons källträd.

source: ``make install`` can overwrite or masquerade the :file:`python3` binary. ``make altinstall`` is therefore recommended instead of ``make install`` since it only installs :file:`{exec_prefix}/bin/python{version}`.
sv: ``make install`` kan skriva över eller maskera :file:`python3`-binärfilen. ``make altinstall`` rekommenderas därför istället för ``make install`` eftersom den bara installerar :file:`{exec_prefix}/bin/python{version}`.

source: Python-related paths and files
sv: Python-relaterade sökvägar och filer

source: These are subject to difference depending on local installation conventions; :option:`prefix <--prefix>` and :option:`exec_prefix <--exec-prefix>` are installation-dependent and should be interpreted as for GNU software; they may be the same.
sv: Dessa kan variera beroende på lokala installationskonventioner; :option:`prefix <--prefix>` och :option:`exec_prefix <--exec-prefix>` är installationsberoende och bör tolkas som för GNU-programvara; de kan vara desamma.

source: For example, on most Linux systems, the default for both is :file:`/usr`.
sv: På de flesta Linux-system är t.ex. standardvärdet för båda :file:`/usr`.

source: File/directory
sv: Fil/katalog

source: Meaning
sv: Betydelse

source: Recommended location of the interpreter.
sv: Rekommenderad placering av tolken.

source: Recommended locations of the directories containing the standard modules.
sv: Rekommenderade platser för de kataloger som innehåller standardmodulerna.

source: Recommended locations of the directories containing the include files needed for developing Python extensions and embedding the interpreter.
sv: Rekommenderade platser för de kataloger som innehåller de include-filer som behövs för att utveckla Python-tillägg och bädda in tolken.

source: Miscellaneous
sv: Diverse

source: To easily use Python scripts on Unix, you need to make them executable, e.g. with
sv: För att enkelt kunna använda Python-skript på Unix måste du göra dem körbara, t.ex. med

source: $ chmod +x script
sv: $ chmod +x skript

source: and put an appropriate Shebang line at the top of the script. A good choice is usually ::
sv: och lägg till en lämplig Shebang-rad i början av skriptet. Ett bra val är vanligtvis ::

source: which searches for the Python interpreter in the whole :envvar:`PATH`. However, some Unices may not have the :program:`env` command, so you may need to hardcode ``/usr/bin/python3`` as the interpreter path.
sv: som söker efter Python-tolken i hela :envvar:`PATH`. Vissa enheter kanske dock inte har kommandot :program:`env`, så du kan behöva hårdkoda ``/usr/bin/python3`` som sökväg till tolken.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
sv: Om du vill använda shell-kommandon i dina Python-skript kan du titta på modulen :mod:`subprocess`.

source: Custom OpenSSL
sv: Anpassad OpenSSL

source: To use your vendor's OpenSSL configuration and system trust store, locate the directory with ``openssl.cnf`` file or symlink in ``/etc``. On most distribution the file is either in ``/etc/ssl`` or ``/etc/pki/tls``. The directory should also contain a ``cert.pem`` file and/or a ``certs`` directory.
sv: För att använda din leverantörs OpenSSL-konfiguration och systemförtroendelager, lokalisera katalogen med filen ``openssl.cnf`` eller symlänk i ``/etc``. På de flesta distributioner finns filen antingen i ``/etc/ssl`` eller ``/etc/pki/tls``. Katalogen bör också innehålla en ``cert.pem``-fil och/eller en ``certs``-katalog.

source: $ find /etc/ -name openssl.cnf -printf "%h\n" /etc/ssl
sv: $ hitta /etc/ -namn openssl.cnf -printf "%h\n" /etc/ssl

source: Download, build, and install OpenSSL. Make sure you use ``install_sw`` and not ``install``. The ``install_sw`` target does not override ``openssl.cnf``.
sv: Ladda ner, bygg och installera OpenSSL. Se till att du använder ``install_sw`` och inte ``install``. Målet ``install_sw`` åsidosätter inte ``openssl.cnf``.

source: Build Python with custom OpenSSL (see the configure ``--with-openssl`` and ``--with-openssl-rpath`` options)
sv: Bygg Python med anpassad OpenSSL (se alternativen configure ``--with-openssl`` och ``--with-openssl-rpath``)

source: Patch releases of OpenSSL have a backwards compatible ABI. You don't need to recompile Python to update OpenSSL. It's sufficient to replace the custom OpenSSL installation with a newer version.
sv: Patchversioner av OpenSSL har ett bakåtkompatibelt ABI. Du behöver inte kompilera om Python för att uppdatera OpenSSL. Det räcker med att ersätta den anpassade OpenSSL-installationen med en nyare version.
