Repository: yeager/python-docs-sv
Catalog: howto/argparse.po
Languages: sv

source: That last output exposes a bug in our program.
sv: Den sista utmatningen avslöjar en bugg i vårt program.

source: Let's fix::
sv: Låt oss fixa::

source: And this is what it gives:
sv: Och det här är vad det ger:

source: $ python prog.py 4 -vvv the square of 4 equals 16 $ python prog.py 4 -vvvv the square of 4 equals 16 $ python prog.py 4 Traceback (most recent call last): File "prog.py", line 11, in <module> if args.verbosity >= 2: TypeError: '>=' not supported between instances of 'NoneType' and 'int'
sv: $ python prog.py 4 -vvv kvadraten på 4 är lika med 16 $ python prog.py 4 -vvvvv kvadraten på 4 är lika med 16 $ python prog.py 4 Traceback (senaste anropet senast): Fil "prog.py", rad 11, i <module> if args.verbosity &gt;= 2: TypeError: '&gt;=' stöds inte mellan instanser av 'NoneType' och 'int'

source: First output went well, and fixes the bug we had before. That is, we want any value >= 2 to be as verbose as possible.
sv: Första utmatningen gick bra, och fixar buggen vi hade tidigare. Det vill säga att vi vill att alla värden >= 2 ska vara så utförliga som möjligt.

source: Third output not so good.
sv: Tredje utgången inte så bra.

source: Let's fix that bug::
sv: Låt oss fixa det felet::

source: We've just introduced yet another keyword, ``default``. We've set it to ``0`` in order to make it comparable to the other int values. Remember that by default, if an optional argument isn't specified, it gets the ``None`` value, and that cannot be compared to an int value (hence the :exc:`TypeError` exception).
sv: Vi har just introducerat ännu ett nyckelord, ``default``. Vi har satt det till ``0`` för att göra det jämförbart med de andra int-värdena. Kom ihåg att som standard, om ett valfritt argument inte anges, får det värdet ``None``, och det kan inte jämföras med ett int-värde (därav :exc:`TypeError`-undantaget).

source: And:
sv: Och..:

source: You can go quite far just with what we've learned so far, and we have only scratched the surface. The :mod:`argparse` module is very powerful, and we'll explore a bit more of it before we end this tutorial.
sv: Du kan komma ganska långt bara med det vi har lärt oss hittills, och vi har bara skrapat på ytan. Modulen :mod:`argparse` är mycket kraftfull, och vi ska utforska lite mer av den innan vi avslutar den här handledningen.

source: Getting a little more advanced
sv: Blir lite mer avancerad

source: What if we wanted to expand our tiny program to perform other powers, not just squares::
sv: Tänk om vi ville utöka vårt lilla program till att utföra andra krafter, inte bara rutor::

source: Output:
sv: Utdata:

source: $ python prog.py usage: prog.py [-h] [-v] x y prog.py: error: the following arguments are required: x, y $ python prog.py -h usage: prog.py [-h] [-v] x y positional arguments: x the base y the exponent options: -h, --help show this help message and exit -v, --verbosity $ python prog.py 4 2 -v 4^2 == 16
sv: $ python prog.py användning: prog.py [-h] [-v] x y prog.py: fel: följande argument krävs: x, y $ python prog.py -h användning: prog.py [-h] [-v] x y positionella argument: x basen y exponenten alternativ: -h, --help visa detta hjälpmeddelande och avsluta -v, --verbositet $ python prog.py 4 2 -v 4^2 == 16

source: Notice that so far we've been using verbosity level to *change* the text that gets displayed. The following example instead uses verbosity level to display *more* text instead::
sv: Observera att vi hittills har använt verbosity level för att *ändra* den text som visas. I följande exempel används istället verbosity level för att visa *mer* text istället::

source: $ python prog.py 4 2 16 $ python prog.py 4 2 -v 4^2 == 16 $ python prog.py 4 2 -vv Running 'prog.py' 4^2 == 16
sv: $ python prog.py 4 2 16 $ python prog.py 4 2 -v 4^2 == 16 $ python prog.py 4 2 -vv Kör 'prog.py' 4^2 == 16

source: Specifying ambiguous arguments
sv: Specificering av tvetydiga argument

source: When there is ambiguity in deciding whether an argument is positional or for an argument, ``--`` can be used to tell :meth:`~ArgumentParser.parse_args` that everything after that is a positional argument::
sv: När det är svårt att avgöra om ett argument är positionellt eller för ett argument, kan ``--`` användas för att tala om för :meth:`~ArgumentParser.parse_args` att allt efter det är ett positionellt argument::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-n', nargs='+') >>> parser.add_argument('args', nargs='*') >>> # ambiguous, so parse_args assumes it's an option >>> parser.parse_args(['-f']) usage: PROG [-h] [-n N [N ...]] [args ...] PROG: error: unrecognized arguments: -f >>> parser.parse_args(['--', '-f']) Namespace(args=['-f'], n=None) >>> # ambiguous, so the -n option greedily accepts arguments >>> parser.parse_args(['-n', '1', '2', '3']) Namespace(args=[], n=['1', '2', '3']) >>> parser.parse_args(['-n', '1', '--', '2', '3']) Namespace(args=['2', '3'], n=['1'])
sv: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-n', nargs='+') >>> parser.add_argument('args', nargs='*') >>> # tvetydigt, så parse_args antar att det är ett alternativ >>> parser.parse_args(['-f']) användning: PROG [-h] [-n N [N ...]] [args ...] PROG: fel: oigenkända argument: -f >>> parser.parse_args(['--', '-f']) Namespace(args=['-f'], n=None) >>> # tvetydigt, så alternativet -n accepterar girigt argument >>> parser.parse_args(['-n', '1', '2', '3']) Namespace(args=[], n=['1', '2', '3']) >>> parser.parse_args(['-n', '1', '--', '2', '3']) Namespace(args=['2', '3'], n=['1'])

source: Conflicting options
sv: Motstridiga alternativ

source: So far, we have been working with two methods of an :class:`argparse.ArgumentParser` instance. Let's introduce a third one, :meth:`~ArgumentParser.add_mutually_exclusive_group`. It allows for us to specify options that conflict with each other. Let's also change the rest of the program so that the new functionality makes more sense: we'll introduce the ``--quiet`` option, which will be the opposite of the ``--verbose`` one::
sv: Hittills har vi arbetat med två metoder i en instans av :class:`argparse.ArgumentParser`. Låt oss introducera en tredje, :meth:`~ArgumentParser.add_mutually_exclusive_group`. Den gör det möjligt för oss att ange alternativ som står i konflikt med varandra. Låt oss också ändra resten av programmet så att den nya funktionaliteten blir mer begriplig: vi inför alternativet ``--quiet``, som kommer att vara motsatsen till ``--verbose``::

source: Our program is now simpler, and we've lost some functionality for the sake of demonstration. Anyways, here's the output:
sv: Vårt program är nu enklare, och vi har förlorat en del funktionalitet för demonstrationens skull. Hur som helst, här är utdata:

source: $ python prog.py 4 2 4^2 == 16 $ python prog.py 4 2 -q 16 $ python prog.py 4 2 -v 4 to the power 2 equals 16 $ python prog.py 4 2 -vq usage: prog.py [-h] [-v | -q] x y prog.py: error: argument -q/--quiet: not allowed with argument -v/--verbose $ python prog.py 4 2 -v --quiet usage: prog.py [-h] [-v | -q] x y prog.py: error: argument -q/--quiet: not allowed with argument -v/--verbose
sv: $ python prog.py 4 2 4^2 == 16 $ python prog.py 4 2 -q 16 $ python prog.py 4 2 -v 4 till potensen 2 är lika med 16 $ python prog.py 4 2 -vq användning: prog.py [-h] [-v | -q] x y prog.py: fel: argument -q/--quiet: inte tillåtet med argument -v/--verbose $ python prog.py 4 2 -v --quiet användning: prog.py [-h] [-v | -q] x y prog.py: fel: argument -q/--quiet: inte tillåtet med argument -v/--verbose

source: That should be easy to follow. I've added that last output so you can see the sort of flexibility you get, i.e. mixing long form options with short form ones.
sv: Det borde vara lätt att följa. Jag har lagt till den sista utmatningen så att du kan se vilken typ av flexibilitet du får, dvs. blanda alternativ med lång form med kort form.

source: Before we conclude, you probably want to tell your users the main purpose of your program, just in case they don't know::
sv: Innan vi avslutar vill du förmodligen berätta för dina användare huvudsyftet med ditt program, bara om de inte vet::

source: Note that slight difference in the usage text. Note the ``[-v | -q]``, which tells us that we can either use ``-v`` or ``-q``, but not both at the same time:
sv: Notera den lilla skillnaden i användningstexten. Notera ``[-v | -q]``, som säger oss att vi antingen kan använda ``-v`` eller ``-q``, men inte båda samtidigt:

source: $ python prog.py --help usage: prog.py [-h] [-v | -q] x y calculate X to the power of Y positional arguments: x the base y the exponent options: -h, --help show this help message and exit -v, --verbose -q, --quiet
sv: $ python prog.py --hjälp användning: prog.py [-h] [-v | -q] x y beräkna X till potensen av Y positionella argument: x basen y exponenten alternativ: -h, --help visa detta hjälpmeddelande och avsluta -v, --överskådlig -q, --tyst

source: How to translate the argparse output
sv: Hur man översätter argparse-utdata

source: The output of the :mod:`argparse` module such as its help text and error messages are all made translatable using the :mod:`gettext` module. This allows applications to easily localize messages produced by :mod:`argparse`. See also :ref:`i18n-howto`.
sv: Utdata från modulen :mod:`argparse`, t.ex. hjälptext och felmeddelanden, görs översättningsbara med modulen :mod:`gettext`. Detta gör att program enkelt kan lokalisera meddelanden som produceras av :mod:`argparse`. Se även :ref:`i18n-howto`.

source: For instance, in this :mod:`argparse` output:
sv: Till exempel i detta :mod:`argparse`-utdata:

source: The strings ``usage:``, ``positional arguments:``, ``options:`` and ``show this help message and exit`` are all translatable.
sv: Strängarna ``usage:``, ``positional arguments:``, ``options:`` och ``show this help message and exit`` är alla översättningsbara.

source: In order to translate these strings, they must first be extracted into a ``.po`` file. For example, using `Babel <https://babel.pocoo.org/>`__, run this command:
sv: För att kunna översätta dessa strängar måste de först extraheras till en ``.po``-fil. Om du till exempel använder `Babel <https://babel.pocoo.org/>`__, kör det här kommandot:

source: This command will extract all translatable strings from the :mod:`argparse` module and output them into a file named ``messages.po``. This command assumes that your Python installation is in ``/usr/lib``.
sv: Detta kommando extraherar alla översättningsbara strängar från modulen :mod:`argparse` och skriver ut dem i en fil med namnet ``messages.po``. Det här kommandot förutsätter att din Python-installation finns i ``/usr/lib``.

source: You can find out the location of the :mod:`argparse` module on your system using this script::
sv: Du kan ta reda på var modulen :mod:`argparse` finns i ditt system med hjälp av detta skript::

source: Once the messages in the ``.po`` file are translated and the translations are installed using :mod:`gettext`, :mod:`argparse` will be able to display the translated messages.
sv: När meddelandena i filen ``.po`` har översatts och översättningarna har installerats med hjälp av :mod:`gettext`, kommer :mod:`argparse`` att kunna visa de översatta meddelandena.

source: To translate your own strings in the :mod:`argparse` output, use :mod:`gettext`.
sv: Om du vill översätta dina egna strängar i :mod:`argparse`-utdata använder du :mod:`gettext`.

source: Custom type converters
sv: Anpassade typomvandlare

source: The :mod:`argparse` module allows you to specify custom type converters for your command-line arguments. This allows you to modify user input before it's stored in the :class:`argparse.Namespace`. This can be useful when you need to pre-process the input before it is used in your program.
sv: Med modulen :mod:`argparse` kan du ange anpassade typkonverterare för dina kommandoradsargument. Detta gör att du kan modifiera användarinmatning innan den lagras i :class:`argparse.Namespace`. Detta kan vara användbart när du behöver förbehandla inmatningen innan den används i ditt program.

source: When using a custom type converter, you can use any callable that takes a single string argument (the argument value) and returns the converted value. However, if you need to handle more complex scenarios, you can use a custom action class with the **action** parameter instead.
sv: När du använder en anpassad typomvandlare kan du använda valfri callable som tar ett enda strängargument (argumentvärdet) och returnerar det konverterade värdet. Men om du behöver hantera mer komplexa scenarier kan du i stället använda en anpassad åtgärdsklass med parametern **action**.

source: For example, let's say you want to handle arguments with different prefixes and process them accordingly::
sv: Låt oss till exempel säga att du vill hantera argument med olika prefix och bearbeta dem i enlighet med detta::

source: $ python prog.py -a value1 +a value2 Namespace(a=[('-', 'value1'), ('+', 'value2')])
sv: $ python prog.py -a värde1 +a värde2 Namespace(a=[('-', 'värde1'), ('+', 'värde2')])

source: In this example, we:
sv: I detta exempel har vi:

source: Created a parser with custom prefix characters using the ``prefix_chars`` parameter.
sv: Skapade en parser med anpassade prefixtecken med hjälp av parametern ``prefix_chars``.

source: Defined two arguments, ``-a`` and ``+a``, which used the ``type`` parameter to create custom type converters to store the value in a tuple with the prefix.
sv: Definierade två argument, ``-a`` och ``+a``, som använde parametern ``type`` för att skapa anpassade typomvandlare för att lagra värdet i en tupel med prefixet.

source: Without the custom type converters, the arguments would have treated the ``-a`` and ``+a`` as the same argument, which would have been undesirable. By using custom type converters, we were able to differentiate between the two arguments.
sv: Utan de anpassade typkonverterarna skulle argumenten ha behandlat ``-a`` och ``+a`` som samma argument, vilket inte skulle ha varit önskvärt. Genom att använda anpassade typkonverterare kunde vi skilja mellan de två argumenten.

source: Conclusion
sv: Slutsats

source: The :mod:`argparse` module offers a lot more than shown here. Its docs are quite detailed and thorough, and full of examples. Having gone through this tutorial, you should easily digest them without feeling overwhelmed.
sv: Modulen :mod:`argparse` erbjuder mycket mer än vad som visas här. Dess dokument är ganska detaljerade och grundliga och fulla av exempel. Efter att ha gått igenom den här handledningen bör du lätt kunna tillgodogöra dig dem utan att känna dig överväldigad.
