Repository: yeager/python-docs-sv
Catalog: howto/argparse.po
Languages: sv

source: Argparse Tutorial
sv: Handledning för argparse

source: author
sv: författare

source: This tutorial is intended to be a gentle introduction to :mod:`argparse`, the recommended command-line parsing module in the Python standard library.
sv: Denna handledning är avsedd att vara en mild introduktion till :mod:`argparse`, den rekommenderade modulen för kommandoradsanalys i Pythons standardbibliotek.

source: The standard library includes two other libraries directly related to command-line parameter processing: the lower level :mod:`optparse` module (which may require more code to configure for a given application, but also allows an application to request behaviors that ``argparse`` doesn't support), and the very low level :mod:`getopt` (which specifically serves as an equivalent to the :c:func:`!getopt` family of functions available to C programmers). While neither of those modules is covered directly in this guide, many of the core concepts in ``argparse`` first originated in ``optparse``, so some aspects of this tutorial will also be relevant to ``optparse`` users.
sv: Standardbiblioteket innehåller två andra bibliotek som är direkt relaterade till bearbetning av kommandoradsparametrar: modulen :mod:`optparse` på lägre nivå (som kan kräva mer kod för att konfigureras för en viss applikation, men som också gör det möjligt för en applikation att begära beteenden som ``argparse`` inte stöder) och modulen :mod:`getopt` på mycket låg nivå (som specifikt fungerar som en motsvarighet till :c:func:`!getopt`-familjen av funktioner som är tillgängliga för C-programmerare). Även om ingen av dessa moduler behandlas direkt i den här guiden, har många av kärnkoncepten i ``argparse`` sitt ursprung i ``optparse``, så vissa aspekter av denna handledning kommer också att vara relevanta för ``optparse``-användare.

source: Concepts
sv: Koncept

source: Let's show the sort of functionality that we are going to explore in this introductory tutorial by making use of the :command:`ls` command:
sv: Låt oss visa den typ av funktionalitet som vi kommer att utforska i denna inledande handledning genom att använda kommandot :command:`ls`:

source: $ ls cpython devguide prog.py pypy rm-unused-function.patch $ ls pypy ctypes_configure demo dotviewer include lib_pypy lib-python ... $ ls -l total 20 drwxr-xr-x 19 wena wena 4096 Feb 18 18:51 cpython drwxr-xr-x 4 wena wena 4096 Feb 8 12:04 devguide -rwxr-xr-x 1 wena wena 535 Feb 19 00:05 prog.py drwxr-xr-x 14 wena wena 4096 Feb 7 00:59 pypy -rw-r--r-- 1 wena wena 741 Feb 18 01:01 rm-unused-function.patch $ ls --help Usage: ls [OPTION]... [FILE]... List information about the FILEs (the current directory by default). Sort entries alphabetically if none of -cftuvSUX nor --sort is specified. ...
sv: $ ls cpython devguide prog.py pypy rm-unused-function.patch $ ls pypy ctypes_configure demo dotviewer include lib_pypy lib-python ... $ ls -l totalt 20 drwxr-xr-x 19 wena wena 4096 feb 18 18:51 cpython drwxr-xr-x 4 wena wena 4096 8 feb 12:04 devguide -rwxr-xr-x 1 wena wena 535 19 februari 00:05 prog.py drwxr-xr-x 14 wena wena 4096 feb 7 00:59 pypy -rw-r--r-- 1 wena wena 741 feb 18 01:01 rm-unused-function.patch $ ls --hjälp Användning: ls [OPTION]... [FIL]... Visar information om FILEs (den aktuella katalogen som standard). Sorterar posterna i alfabetisk ordning om varken -cftuvSUX eller --sort har angetts. ...

source: A few concepts we can learn from the four commands:
sv: Några begrepp som vi kan lära oss av de fyra kommandona:

source: The :command:`ls` command is useful when run without any options at all. It defaults to displaying the contents of the current directory.
sv: Kommandot :command:`ls` är användbart när det körs utan några alternativ alls. Standardinställningen är att visa innehållet i den aktuella katalogen.

source: If we want beyond what it provides by default, we tell it a bit more. In this case, we want it to display a different directory, ``pypy``. What we did is specify what is known as a positional argument. It's named so because the program should know what to do with the value, solely based on where it appears on the command line. This concept is more relevant to a command like :command:`cp`, whose most basic usage is ``cp SRC DEST``. The first position is *what you want copied,* and the second position is *where you want it copied to*.
sv: Om vi vill ha mer än vad den tillhandahåller som standard, berättar vi lite mer för den. I det här fallet vill vi att den ska visa en annan katalog, ``pypy``. Vad vi gjorde var att ange vad som kallas ett positionellt argument. Det kallas så eftersom programmet ska veta vad det ska göra med värdet, enbart baserat på var det visas på kommandoraden. Det här konceptet är mer relevant för ett kommando som :command:`cp`, vars mest grundläggande användning är ``cp SRC DEST``. Den första positionen är *det du vill kopiera* och den andra positionen är *där du vill att det ska kopieras till*.

source: Now, say we want to change behaviour of the program. In our example, we display more info for each file instead of just showing the file names. The ``-l`` in that case is known as an optional argument.
sv: Låt oss nu säga att vi vill ändra programmets beteende. I vårt exempel visar vi mer information för varje fil i stället för att bara visa filnamnen. I det fallet kallas ``-l`` för ett valfritt argument.

source: That's a snippet of the help text. It's very useful in that you can come across a program you have never used before, and can figure out how it works simply by reading its help text.
sv: Det är ett utdrag ur hjälptexten. Det är mycket användbart eftersom du kan stöta på ett program som du aldrig har använt tidigare och kan ta reda på hur det fungerar genom att läsa dess hjälptext.

source: The basics
sv: Grunderna

source: Let us start with a very simple example which does (almost) nothing::
sv: Låt oss börja med ett mycket enkelt exempel som gör (nästan) ingenting::

source: Following is a result of running the code:
sv: Följande är ett resultat av att köra koden:

source: $ python prog.py $ python prog.py --help usage: prog.py [-h] options: -h, --help show this help message and exit $ python prog.py --verbose usage: prog.py [-h] prog.py: error: unrecognized arguments: --verbose $ python prog.py foo usage: prog.py [-h] prog.py: error: unrecognized arguments: foo
sv: $ python prog.py $ python prog.py --hjälp användning: prog.py [-h] alternativ: -h, --help visa detta hjälpmeddelande och avsluta $ python prog.py --verbose användning: prog.py [-h] prog.py: fel: oigenkända argument: --verbose $ python prog.py foo användning: prog.py [-h] prog.py: fel: oigenkända argument: foo

source: Here is what is happening:
sv: Det här är vad som händer:

source: Running the script without any options results in nothing displayed to stdout. Not so useful.
sv: Om du kör skriptet utan några alternativ visas ingenting i utdatan. Inte så användbart.

source: The second one starts to display the usefulness of the :mod:`argparse` module. We have done almost nothing, but already we get a nice help message.
sv: Den andra börjar visa hur användbar modulen :mod:`argparse` är. Vi har nästan inte gjort någonting, men redan nu får vi ett trevligt hjälpmeddelande.

source: The ``--help`` option, which can also be shortened to ``-h``, is the only option we get for free (i.e. no need to specify it). Specifying anything else results in an error. But even then, we do get a useful usage message, also for free.
sv: Alternativet ``--help``, som också kan förkortas till ``-h``, är det enda alternativ vi får gratis (dvs. vi behöver inte ange det). Om man anger något annat resulterar det i ett fel. Men även då får vi ett användbart användningsmeddelande, också det gratis.

source: Introducing Positional arguments
sv: Introduktion till positionella argument

source: An example::
sv: Ett exempel::

source: And running the code:
sv: Och kör koden:

source: $ python prog.py usage: prog.py [-h] echo prog.py: error: the following arguments are required: echo $ python prog.py --help usage: prog.py [-h] echo positional arguments: echo options: -h, --help show this help message and exit $ python prog.py foo foo
sv: $ python prog.py användning: prog.py [-h] echo prog.py: fel: följande argument krävs: echo $ python prog.py --hjälp användning: prog.py [-h] echo positionella argument: echo alternativ: -h, --help visa detta hjälpmeddelande och avsluta $ python prog.py foo foo

source: Here is what's happening:
sv: Det här är vad som händer:

source: We've added the :meth:`~ArgumentParser.add_argument` method, which is what we use to specify which command-line options the program is willing to accept. In this case, I've named it ``echo`` so that it's in line with its function.
sv: Vi har lagt till metoden :meth:`~ArgumentParser.add_argument`, som vi använder för att ange vilka kommandoradsalternativ som programmet är villigt att acceptera. I det här fallet har jag döpt den till ``echo`` så att den är i linje med sin funktion.

source: Calling our program now requires us to specify an option.
sv: För att anropa vårt program måste vi nu ange ett alternativ.

source: The :meth:`~ArgumentParser.parse_args` method actually returns some data from the options specified, in this case, ``echo``.
sv: Metoden :meth:`~ArgumentParser.parse_args` returnerar faktiskt data från de angivna alternativen, i det här fallet ``echo``.

source: The variable is some form of 'magic' that :mod:`argparse` performs for free (i.e. no need to specify which variable that value is stored in). You will also notice that its name matches the string argument given to the method, ``echo``.
sv: Variabeln är någon form av "magi" som :mod:`argparse` utför gratis (dvs. du behöver inte ange vilken variabel värdet lagras i). Du kommer också att märka att dess namn matchar det strängargument som ges till metoden, ``echo``.

source: Note however that, although the help display looks nice and all, it currently is not as helpful as it can be. For example we see that we got ``echo`` as a positional argument, but we don't know what it does, other than by guessing or by reading the source code. So, let's make it a bit more useful::
sv: Observera dock att även om hjälpvisningen ser trevlig ut är den för närvarande inte så hjälpsam som den skulle kunna vara. Vi ser till exempel att vi har ``echo`` som ett positionellt argument, men vi vet inte vad det gör, annat än genom att gissa eller läsa källkoden. Så, låt oss göra det lite mer användbart::

source: And we get:
sv: Och vi får..:

source: $ python prog.py -h usage: prog.py [-h] echo positional arguments: echo echo the string you use here options: -h, --help show this help message and exit
sv: $ python prog.py -h användning: prog.py [-h] echo positionella argument: echo echo echo den sträng du använder här alternativ: -h, --help visa detta hjälpmeddelande och avsluta

source: Now, how about doing something even more useful::
sv: Nu, vad sägs om att göra något ännu mer användbart::

source: $ python prog.py 4 Traceback (most recent call last): File "prog.py", line 5, in <module> print(args.square**2) TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'int'
sv: $ python prog.py 4 Traceback (senaste anropet senast): Fil "prog.py", rad 5, i <module> print(args.kvadrat**2) TypeError: operandtyp(er) som inte stöds för ** eller pow(): 'str' och 'int'

source: That didn't go so well. That's because :mod:`argparse` treats the options we give it as strings, unless we tell it otherwise. So, let's tell :mod:`argparse` to treat that input as an integer::
sv: Det gick inte så bra. Det beror på att :mod:`argparse` behandlar de alternativ vi ger den som strängar, om vi inte säger något annat. Så, låt oss säga till :mod:`argparse` att behandla den inmatningen som ett heltal::

source: $ python prog.py 4 16 $ python prog.py four usage: prog.py [-h] square prog.py: error: argument square: invalid int value: 'four'
sv: $ python prog.py 4 16 $ python prog.py fyra användning: prog.py [-h] kvadrat prog.py: fel: argument square: ogiltigt int-värde: 'four'

source: That went well. The program now even helpfully quits on bad illegal input before proceeding.
sv: Det gick bra. Programmet avbryter nu till och med på ett hjälpsamt sätt vid dålig olaglig inmatning innan det fortsätter.

source: Introducing Optional arguments
sv: Introduktion av valfria argument

source: So far we have been playing with positional arguments. Let us have a look on how to add optional ones::
sv: Hittills har vi lekt med positionella argument. Låt oss ta en titt på hur man lägger till valfria argument::

source: And the output:
sv: Och utmatningen:

source: $ python prog.py --verbosity 1 verbosity turned on $ python prog.py $ python prog.py --help usage: prog.py [-h] [--verbosity VERBOSITY] options: -h, --help show this help message and exit --verbosity VERBOSITY increase output verbosity $ python prog.py --verbosity usage: prog.py [-h] [--verbosity VERBOSITY] prog.py: error: argument --verbosity: expected one argument
sv: $ python prog.py --verbosity 1 ordrikhet aktiverad $ python prog.py $ python prog.py --hjälp användning: prog.py [-h] [--verbosity VERBOSITY] alternativ: -h, --help visa detta hjälpmeddelande och avsluta --verbositet VERBOSITET öka utmatningens ordrikedom $ python prog.py --verbosity användning: prog.py [-h] [--verbosity VERBOSITY] prog.py: fel: argument --verbosity: förväntade ett argument

source: The program is written so as to display something when ``--verbosity`` is specified and display nothing when not.
sv: Programmet är skrivet så att det visar något när ``--verbosity`` anges och ingenting när så inte är fallet.

source: To show that the option is actually optional, there is no error when running the program without it. Note that by default, if an optional argument isn't used, the relevant variable, in this case ``args.verbosity``, is given ``None`` as a value, which is the reason it fails the truth test of the :keyword:`if` statement.
sv: För att visa att alternativet faktiskt är valfritt, blir det inget fel när programmet körs utan det. Observera att som standard, om ett valfritt argument inte används, får den relevanta variabeln, i det här fallet ``args.verbosity``, ``None`` som värde, vilket är anledningen till att den inte klarar sanningstestet i :keyword:`if`-satsen.

source: The help message is a bit different.
sv: Hjälpmeddelandet är lite annorlunda.

source: When using the ``--verbosity`` option, one must also specify some value, any value.
sv: När man använder alternativet ``--verbosity`` måste man också ange ett värde, vilket som helst.

source: The above example accepts arbitrary integer values for ``--verbosity``, but for our simple program, only two values are actually useful, ``True`` or ``False``. Let's modify the code accordingly::
sv: Exemplet ovan accepterar godtyckliga heltalsvärden för ``--verbosity``, men för vårt enkla program är det bara två värden som är användbara, ``True`` eller ``False``. Låt oss modifiera koden i enlighet med detta::

source: $ python prog.py --verbose verbosity turned on $ python prog.py --verbose 1 usage: prog.py [-h] [--verbose] prog.py: error: unrecognized arguments: 1 $ python prog.py --help usage: prog.py [-h] [--verbose] options: -h, --help show this help message and exit --verbose increase output verbosity
sv: $ python prog.py --verbose ordrikhet aktiverad $ python prog.py --verbose 1 användning: prog.py [-h] [--verbose] prog.py: fel: oigenkända argument: 1 $ python prog.py --hjälp användning: prog.py [-h] [--verbose] alternativ: -h, --help visa detta hjälpmeddelande och avsluta --verbose ökar utmatningens ordrikedom

source: The option is now more of a flag than something that requires a value. We even changed the name of the option to match that idea. Note that we now specify a new keyword, ``action``, and give it the value ``"store_true"``. This means that, if the option is specified, assign the value ``True`` to ``args.verbose``. Not specifying it implies ``False``.
sv: Alternativet är nu mer av en flagga än något som kräver ett värde. Vi har även ändrat namnet på alternativet för att matcha den idén. Observera att vi nu anger ett nytt nyckelord, ``action``, och ger det värdet ``"store_true"``. Detta innebär att, om alternativet är specificerat, tilldela värdet ``True`` till ``args.verbose``. Om det inte specificeras innebär det ``False``.

source: It complains when you specify a value, in true spirit of what flags actually are.
sv: Den klagar när du anger ett värde, i sann anda av vad flaggor faktiskt är.

source: Notice the different help text.
sv: Lägg märke till de olika hjälptexterna.

source: Short options
sv: Korta alternativ

source: If you are familiar with command line usage, you will notice that I haven't yet touched on the topic of short versions of the options. It's quite simple::
sv: Om du är bekant med kommandoradsanvändning kommer du att märka att jag ännu inte har berört ämnet kortversioner av alternativen. Det är ganska enkelt::

source: And here goes:
sv: Och här kommer det:

source: $ python prog.py -v verbosity turned on $ python prog.py --help usage: prog.py [-h] [-v] options: -h, --help show this help message and exit -v, --verbose increase output verbosity
sv: $ python prog.py -v ordrikedom aktiverad $ python prog.py --hjälp användning: prog.py [-h] [-v] alternativ: -h, --help visa detta hjälpmeddelande och avsluta -v, --verbose öka utmatningens ordrikedom

source: Note that the new ability is also reflected in the help text.
sv: Observera att den nya förmågan också återspeglas i hjälptexten.

source: Combining Positional and Optional arguments
sv: Kombination av positionella och valfria argument

source: Our program keeps growing in complexity::
sv: Vårt program blir alltmer komplext::

source: And now the output:
sv: Och nu till resultatet:

source: $ python prog.py usage: prog.py [-h] [-v] square prog.py: error: the following arguments are required: square $ python prog.py 4 16 $ python prog.py 4 --verbose the square of 4 equals 16 $ python prog.py --verbose 4 the square of 4 equals 16
sv: $ python prog.py användning: prog.py [-h] [-v] kvadrat prog.py: fel: följande argument krävs: square $ python prog.py 4 16 $ python prog.py 4 --verbose kvadraten av 4 är lika med 16 $ python prog.py --verbose 4 kvadraten på 4 är lika med 16

source: We've brought back a positional argument, hence the complaint.
sv: Vi har återinfört ett positionsargument, därav klagomålet.

source: Note that the order does not matter.
sv: Observera att ordningen inte spelar någon roll.

source: How about we give this program of ours back the ability to have multiple verbosity values, and actually get to use them::
sv: Vad sägs om att vi ger vårt program tillbaka möjligheten att ha flera verbosity-värden, och faktiskt får använda dem::

source: $ python prog.py 4 16 $ python prog.py 4 -v usage: prog.py [-h] [-v VERBOSITY] square prog.py: error: argument -v/--verbosity: expected one argument $ python prog.py 4 -v 1 4^2 == 16 $ python prog.py 4 -v 2 the square of 4 equals 16 $ python prog.py 4 -v 3 16
sv: $ python prog.py 4 16 $ python prog.py 4 -v användning: prog.py [-h] [-v VERBOSITY] kvadrat prog.py: fel: argument -v/--verbosity: förväntade ett argument $ python prog.py 4 -v 1 4^2 == 16 $ python prog.py 4 -v 2 kvadraten på 4 är lika med 16 $ python prog.py 4 -v 3 16

source: These all look good except the last one, which exposes a bug in our program. Let's fix it by restricting the values the ``--verbosity`` option can accept::
sv: Alla dessa ser bra ut utom den sista, som avslöjar en bugg i vårt program. Låt oss åtgärda det genom att begränsa de värden som alternativet ``--verbosity`` kan acceptera::

source: $ python prog.py 4 -v 3 usage: prog.py [-h] [-v {0,1,2}] square prog.py: error: argument -v/--verbosity: invalid choice: 3 (choose from 0, 1, 2) $ python prog.py 4 -h usage: prog.py [-h] [-v {0,1,2}] square positional arguments: square display a square of a given number options: -h, --help show this help message and exit -v, --verbosity {0,1,2} increase output verbosity
sv: $ python prog.py 4 -v 3 användning: prog.py [-h] [-v {0,1,2}] kvadrat prog.py: fel: argument -v/--verbosity: ogiltigt val: 3 (välj mellan 0, 1, 2) $ python prog.py 4 -h användning: prog.py [-h] [-v {0,1,2}] kvadrat positionella argument: square visa en kvadrat av ett givet tal alternativ: -h, --help visa detta hjälpmeddelande och avsluta -v, --förtydligande {0,1,2} öka utmatningens ordrikedom

source: Note that the change also reflects both in the error message as well as the help string.
sv: Observera att ändringen också återspeglas både i felmeddelandet och i hjälpsträngen.

source: Now, let's use a different approach of playing with verbosity, which is pretty common. It also matches the way the CPython executable handles its own verbosity argument (check the output of ``python --help``)::
sv: Låt oss nu använda ett annat tillvägagångssätt för att leka med verbosity, vilket är ganska vanligt. Det stämmer också överens med hur den körbara CPython-filen hanterar sitt eget verbosity-argument (kontrollera utdata från ``python --help``)::

source: We have introduced another action, "count", to count the number of occurrences of specific options.
sv: Vi har infört en annan åtgärd, "count", för att räkna antalet förekomster av specifika alternativ.

source: $ python prog.py 4 16 $ python prog.py 4 -v 4^2 == 16 $ python prog.py 4 -vv the square of 4 equals 16 $ python prog.py 4 --verbosity --verbosity the square of 4 equals 16 $ python prog.py 4 -v 1 usage: prog.py [-h] [-v] square prog.py: error: unrecognized arguments: 1 $ python prog.py 4 -h usage: prog.py [-h] [-v] square positional arguments: square display a square of a given number options: -h, --help show this help message and exit -v, --verbosity increase output verbosity $ python prog.py 4 -vvv 16
sv: $ python prog.py 4 16 $ python prog.py 4 -v 4^2 == 16 $ python prog.py 4 -vv kvadraten på 4 är lika med 16 $ python prog.py 4 --verbosity --verbosity kvadraten på 4 är lika med 16 $ python prog.py 4 -v 1 användning: prog.py [-h] [-v] kvadrat prog.py: fel: oigenkända argument: 1 $ python prog.py 4 -h användning: prog.py [-h] [-v] kvadrat positionella argument: square visar en kvadrat av ett givet tal alternativ: -h, --help visa detta hjälpmeddelande och avsluta -v, --verbosity öka utmatningens verbosity $ python prog.py 4 -vvv 16

source: Yes, it's now more of a flag (similar to ``action="store_true"``) in the previous version of our script. That should explain the complaint.
sv: Ja, det är nu mer av en flagga (liknande ``action="store_true"``) i den tidigare versionen av vårt skript. Det borde förklara klagomålet.

source: It also behaves similar to "store_true" action.
sv: Den beter sig också på liknande sätt som åtgärden "store_true".

source: Now here's a demonstration of what the "count" action gives. You've probably seen this sort of usage before.
sv: Här är nu en demonstration av vad "count"-åtgärden ger. Du har förmodligen sett den här typen av användning tidigare.

source: And if you don't specify the ``-v`` flag, that flag is considered to have ``None`` value.
sv: Och om du inte anger flaggan ``-v``, anses den flaggan ha värdet ``None``.

source: As should be expected, specifying the long form of the flag, we should get the same output.
sv: Som väntat skulle vi få samma resultat om vi angav den långa formen av flaggan.

source: Sadly, our help output isn't very informative on the new ability our script has acquired, but that can always be fixed by improving the documentation for our script (e.g. via the ``help`` keyword argument).
sv: Tyvärr är vår hjälputskrift inte särskilt informativ om den nya förmåga som vårt skript har fått, men det kan alltid åtgärdas genom att förbättra dokumentationen för vårt skript (t.ex. via nyckelordsargumentet ``help``).
