Repository: yeager/python-docs-sv
Catalog: howto/curses.po
Languages: sv

source: The :meth:`~curses.window.addstr` method takes a Python string or bytestring as the value to be displayed. The contents of bytestrings are sent to the terminal as-is. Strings are encoded to bytes using the value of the window's :attr:`~window.encoding` attribute; this defaults to the default system encoding as returned by :func:`locale.getencoding`.
sv: Metoden :meth:`~curses.window.addstr` tar en Python-sträng eller bytestring som det värde som ska visas. Innehållet i bytestrings skickas till terminalen som det är. Strängar kodas till bytes med hjälp av värdet i fönstrets attribut :attr:`~window.encoding`; detta är standardvärdet för systemets standardkodning som returneras av :func:`locale.getencoding`.

source: The :meth:`~curses.window.addch` methods take a character, which can be either a string of length 1, a bytestring of length 1, or an integer.
sv: Metoderna :meth:`~curses.window.addch` tar ett tecken, som kan vara antingen en sträng med längden 1, en bytestring med längden 1 eller ett heltal.

source: Constants are provided for extension characters; these constants are integers greater than 255. For example, :const:`ACS_PLMINUS` is a +/- symbol, and :const:`ACS_ULCORNER` is the upper left corner of a box (handy for drawing borders). You can also use the appropriate Unicode character.
sv: Konstanter finns för tilläggstecken; dessa konstanter är heltal större än 255. Exempelvis är :const:`ACS_PLMINUS` en +/- symbol och :const:`ACS_ULCORNER` är det övre vänstra hörnet av en ruta (praktiskt för att rita gränser). Du kan också använda lämpliga Unicode-tecken.

source: Windows remember where the cursor was left after the last operation, so if you leave out the *y,x* coordinates, the string or character will be displayed wherever the last operation left off. You can also move the cursor with the ``move(y,x)`` method. Because some terminals always display a flashing cursor, you may want to ensure that the cursor is positioned in some location where it won't be distracting; it can be confusing to have the cursor blinking at some apparently random location.
sv: Windows kommer ihåg var markören befann sig efter den senaste operationen, så om du utelämnar *y,x*-koordinaterna kommer strängen eller tecknet att visas där den senaste operationen slutade. Du kan också flytta markören med metoden ``move(y,x)``. Eftersom vissa terminaler alltid visar en blinkande markör kan det vara bra att se till att markören är placerad på en plats där den inte stör; det kan vara förvirrande att ha markören blinkande på en till synes slumpmässig plats.

source: If your application doesn't need a blinking cursor at all, you can call ``curs_set(False)`` to make it invisible. For compatibility with older curses versions, there's a ``leaveok(bool)`` function that's a synonym for :func:`~curses.curs_set`. When *bool* is true, the curses library will attempt to suppress the flashing cursor, and you won't need to worry about leaving it in odd locations.
sv: Om ditt program inte alls behöver en blinkande markör kan du anropa ``curs_set(False)`` för att göra den osynlig. För kompatibilitet med äldre curses-versioner finns funktionen ``leaveok(bool)`` som är en synonym till :func:`~curses.curs_set`. När *bool* är sant kommer curses-biblioteket att försöka undertrycka den blinkande markören, och du behöver inte oroa dig för att lämna den på udda platser.

source: Attributes and Color
sv: Attribut och färg

source: Characters can be displayed in different ways. Status lines in a text-based application are commonly shown in reverse video, or a text viewer may need to highlight certain words. curses supports this by allowing you to specify an attribute for each cell on the screen.
sv: Tecken kan visas på olika sätt. Statusrader i en textbaserad applikation visas ofta i omvänd video, eller så kan en textvisare behöva markera vissa ord. curses stöder detta genom att låta dig ange ett attribut för varje cell på skärmen.

source: An attribute is an integer, each bit representing a different attribute. You can try to display text with multiple attribute bits set, but curses doesn't guarantee that all the possible combinations are available, or that they're all visually distinct. That depends on the ability of the terminal being used, so it's safest to stick to the most commonly available attributes, listed here.
sv: Ett attribut är ett heltal, där varje bit representerar ett annat attribut. Du kan försöka visa text med flera attributbitar inställda, men curses garanterar inte att alla möjliga kombinationer är tillgängliga eller att de alla är visuellt distinkta. Det beror på hur bra terminalen som används är, så det är säkrast att hålla sig till de vanligaste attributen, som listas här.

source: Attribute
sv: Attribut

source: :const:`A_BLINK`
sv: :const:`A_BLÄNK`

source: Blinking text
sv: Blinkande text

source: Extra bright or bold text
sv: Extra ljus eller fet text

source: Half bright text
sv: Halv ljus text

source: Reverse-video text
sv: Text för omvänd video

source: The best highlighting mode available
sv: Det bästa markeringsläget som finns

source: Underlined text
sv: Understruken text

source: So, to display a reverse-video status line on the top line of the screen, you could code::
sv: För att visa en statusrad med omvänd video på den övre raden på skärmen kan du alltså koda::

source: stdscr.addstr(0, 0, "Current mode: Typing mode", curses.A_REVERSE) stdscr.refresh()
sv: stdscr.addstr(0, 0,"Aktuellt läge: Skrivläge", curses.A_REVERSE) stdscr.refresh()

source: The curses library also supports color on those terminals that provide it. The most common such terminal is probably the Linux console, followed by color xterms.
sv: Curses-biblioteket stöder också färg på de terminaler som tillhandahåller det. Den vanligaste sådana terminalen är förmodligen Linux-konsolen, följt av färg xterms.

source: To use color, you must call the :func:`~curses.start_color` function soon after calling :func:`~curses.initscr`, to initialize the default color set (the :func:`curses.wrapper` function does this automatically). Once that's done, the :func:`~curses.has_colors` function returns TRUE if the terminal in use can actually display color. (Note: curses uses the American spelling 'color', instead of the Canadian/British spelling 'colour'. If you're used to the British spelling, you'll have to resign yourself to misspelling it for the sake of these functions.)
sv: För att använda färg måste du anropa funktionen :func:`~curses.start_color` strax efter anropet av :func:`~curses.initscr`, för att initiera standardfärgsättningen (funktionen :func:`curses.wrapper` gör detta automatiskt). När det är gjort returnerar funktionen :func:`~curses.has_colors` TRUE om terminalen som används faktiskt kan visa färg. (Obs: curses använder den amerikanska stavningen "color", istället för den kanadensiska/brittiska stavningen "colour". Om du är van vid den brittiska stavningen får du finna dig i att stava det fel för dessa funktioners skull)

source: The curses library maintains a finite number of color pairs, containing a foreground (or text) color and a background color. You can get the attribute value corresponding to a color pair with the :func:`~curses.color_pair` function; this can be bitwise-OR'ed with other attributes such as :const:`A_REVERSE`, but again, such combinations are not guaranteed to work on all terminals.
sv: Curses-biblioteket har ett begränsat antal färgpar, som innehåller en förgrundsfärg (eller textfärg) och en bakgrundsfärg. Du kan få fram attributvärdet som motsvarar ett färgpar med funktionen :func:`~curses.color_pair`; detta kan bitvis-OR:as med andra attribut som :const:`A_REVERSE`, men återigen, sådana kombinationer är inte garanterade att fungera på alla terminaler.

source: An example, which displays a line of text using color pair 1::
sv: Ett exempel, som visar en textrad med färgparet 1::

source: stdscr.addstr("Pretty text", curses.color_pair(1)) stdscr.refresh()
sv: stdscr.addstr("Fin text", curses.color_pair(1)) stdscr.refresh()

source: As I said before, a color pair consists of a foreground and background color. The ``init_pair(n, f, b)`` function changes the definition of color pair *n*, to foreground color f and background color b. Color pair 0 is hard-wired to white on black, and cannot be changed.
sv: Som jag sa tidigare består ett färgpar av en förgrunds- och en bakgrundsfärg. Funktionen ``init_pair(n, f, b)`` ändrar definitionen av färgparet *n*, till förgrundsfärgen f och bakgrundsfärgen b. Färgparet 0 är hårdkodat till vitt på svart och kan inte ändras.

source: Colors are numbered, and :func:`start_color` initializes 8 basic colors when it activates color mode. They are: 0:black, 1:red, 2:green, 3:yellow, 4:blue, 5:magenta, 6:cyan, and 7:white. The :mod:`curses` module defines named constants for each of these colors: :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED`, and so forth.
sv: Färgerna är numrerade och :func:`start_color` initierar 8 grundfärger när den aktiverar färgläget. Dessa är: 0:svart, 1:röd, 2:grön, 3:gul, 4:blå, 5:magenta, 6:cyan och 7:vit. Modulen :mod:`curses` definierar namngivna konstanter för var och en av dessa färger: :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED`, och så vidare.

source: Let's put all this together. To change color 1 to red text on a white background, you would call::
sv: Låt oss sätta ihop allt detta. För att ändra färg 1 till röd text på en vit bakgrund, skulle du ringa::

source: When you change a color pair, any text already displayed using that color pair will change to the new colors. You can also display new text in this color with::
sv: När du ändrar ett färgpar kommer all text som redan visas med det färgparet att ändras till de nya färgerna. Du kan också visa ny text i den här färgen med::

source: Very fancy terminals can change the definitions of the actual colors to a given RGB value. This lets you change color 1, which is usually red, to purple or blue or any other color you like. Unfortunately, the Linux console doesn't support this, so I'm unable to try it out, and can't provide any examples. You can check if your terminal can do this by calling :func:`~curses.can_change_color`, which returns ``True`` if the capability is there. If you're lucky enough to have such a talented terminal, consult your system's man pages for more information.
sv: Mycket avancerade terminaler kan ändra definitionerna av de faktiska färgerna till ett givet RGB-värde. Detta gör att du kan ändra färg 1, som vanligtvis är röd, till lila eller blå eller någon annan färg du vill ha. Tyvärr har Linux-konsolen inte stöd för detta, så jag kan inte prova det och kan inte ge några exempel. Du kan kontrollera om din terminal kan göra detta genom att anropa :func:`~curses.can_change_color`, som returnerar ``True`` om möjligheten finns. Om du har turen att ha en så begåvad terminal kan du läsa mer i systemets man-sidor.

source: User Input
sv: Användarinput

source: The C curses library offers only very simple input mechanisms. Python's :mod:`curses` module adds a basic text-input widget. (Other libraries such as :pypi:`Urwid` have more extensive collections of widgets.)
sv: C-biblioteket curses erbjuder endast mycket enkla inmatningsmekanismer. Pythons modul :mod:`curses` lägger till en grundläggande widget för textinmatning. (Andra bibliotek som :pypi:`Urwid` har mer omfattande samlingar av widgetar)

source: There are two methods for getting input from a window:
sv: Det finns två metoder för att få in data från ett fönster:

source: :meth:`~curses.window.getch` refreshes the screen and then waits for the user to hit a key, displaying the key if :func:`~curses.echo` has been called earlier. You can optionally specify a coordinate to which the cursor should be moved before pausing.
sv: :meth:`~curses.window.getch` uppdaterar skärmen och väntar sedan på att användaren ska trycka på en tangent, och visar tangenten om :func:`~curses.echo` har anropats tidigare. Du kan eventuellt ange en koordinat till vilken markören ska flyttas innan den pausas.

source: :meth:`~curses.window.getkey` does the same thing but converts the integer to a string. Individual characters are returned as 1-character strings, and special keys such as function keys return longer strings containing a key name such as ``KEY_UP`` or ``^G``.
sv: :meth:`~curses.window.getkey` gör samma sak men omvandlar heltalet till en sträng. Enskilda tecken returneras som strängar med 1 tecken, och specialnycklar som funktionstangenter returnerar längre strängar som innehåller ett nyckelnamn som ``KEY_UP`` eller ``^G``.

source: It's possible to not wait for the user using the :meth:`~curses.window.nodelay` window method. After ``nodelay(True)``, :meth:`!getch` and :meth:`!getkey` for the window become non-blocking. To signal that no input is ready, :meth:`!getch` returns ``curses.ERR`` (a value of -1) and :meth:`!getkey` raises an exception. There's also a :func:`~curses.halfdelay` function, which can be used to (in effect) set a timer on each :meth:`!getch`; if no input becomes available within a specified delay (measured in tenths of a second), curses raises an exception.
sv: Det är möjligt att inte vänta på användaren med hjälp av fönstermetoden :meth:`~curses.window.nodelay`. Efter ``nodelay(True)`` blir :meth:`!getch` och :meth:`!getkey` för fönstret icke-blockerande. För att signalera att ingen inmatning är klar returnerar :meth:`!getch` ``curses.ERR`` (ett värde på -1) och :meth:`!getkey` utlöser ett undantag. Det finns också en :func:`~curses.halfdelay`-funktion, som kan användas för att (i praktiken) ställa in en timer på varje :meth:`!getch`; om ingen inmatning blir tillgänglig inom en angiven fördröjning (mätt i tiondelar av en sekund), ger curses upphov till ett undantag.

source: The :meth:`!getch` method returns an integer; if it's between 0 and 255, it represents the ASCII code of the key pressed. Values greater than 255 are special keys such as Page Up, Home, or the cursor keys. You can compare the value returned to constants such as :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME`, or :const:`curses.KEY_LEFT`. The main loop of your program may look something like this::
sv: Metoden :meth:`!getch` returnerar ett heltal; om det är mellan 0 och 255 representerar det ASCII-koden för den tangent som tryckts in. Värden större än 255 är specialtangenter som Page Up, Home eller markörknapparna. Du kan jämföra det returnerade värdet med konstanter som :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME` eller :const:`curses.KEY_LEFT`. Huvudloopen i ditt program kan se ut ungefär så här::

source: while True: c = stdscr.getch() if c == ord('p'): PrintDocument() elif c == ord('q'): break # Exit the while loop elif c == curses.KEY_HOME: x = y = 0
sv: medan True: c = stdscr.getch() if c == ord('p'): PrintDocument() elif c == ord('q'): break # Avsluta while-slingan elif c == curses.KEY_HOME: x = y = 0

source: The :mod:`curses.ascii` module supplies ASCII class membership functions that take either integer or 1-character string arguments; these may be useful in writing more readable tests for such loops. It also supplies conversion functions that take either integer or 1-character-string arguments and return the same type. For example, :func:`curses.ascii.ctrl` returns the control character corresponding to its argument.
sv: Modulen :mod:`curses.ascii` tillhandahåller ASCII-klasstillhörighetsfunktioner som tar antingen heltals- eller 1-teckenssträngargument; dessa kan vara användbara för att skriva mer läsbara tester för sådana loopar. Den innehåller också konverteringsfunktioner som tar antingen heltal eller 1-teckenssträngar som argument och returnerar samma typ. Till exempel returnerar :func:`curses.ascii.ctrl` det kontrolltecken som motsvarar dess argument.

source: There's also a method to retrieve an entire string, :meth:`~curses.window.getstr`. It isn't used very often, because its functionality is quite limited; the only editing keys available are the backspace key and the Enter key, which terminates the string. It can optionally be limited to a fixed number of characters. ::
sv: Det finns också en metod för att hämta en hel sträng, :meth:`~curses.window.getstr`. Den används inte så ofta eftersom dess funktionalitet är ganska begränsad; de enda redigeringstangenter som finns är backstegstangenten och Enter-tangenten, som avslutar strängen. Den kan eventuellt begränsas till ett fast antal tecken. ::

source: curses.echo() # Enable echoing of characters # Get a 15-character string, with the cursor on the top line s = stdscr.getstr(0,0, 15)
sv: curses.echo() # Aktivera eko av tecken # Hämta en sträng med 15 tecken, med markören på den översta raden s = stdscr.getstr(0,0, 15)

source: The :mod:`curses.textpad` module supplies a text box that supports an Emacs-like set of keybindings. Various methods of the :class:`~curses.textpad.Textbox` class support editing with input validation and gathering the edit results either with or without trailing spaces. Here's an example::
sv: Modulen :mod:`curses.textpad` tillhandahåller en textruta som stöder en Emacs-liknande uppsättning tangentbindningar. Olika metoder i klassen :class:`~curses.textpad.Textbox` stöder redigering med inmatningsvalidering och insamling av redigeringsresultaten antingen med eller utan efterföljande mellanslag. Här är ett exempel::

source: See the library documentation on :mod:`curses.textpad` for more details.
sv: Se biblioteksdokumentationen för :mod:`curses.textpad` för mer information.

source: For More Information
sv: För mer information

source: This HOWTO doesn't cover some advanced topics, such as reading the contents of the screen or capturing mouse events from an xterm instance, but the Python library page for the :mod:`curses` module is now reasonably complete. You should browse it next.
sv: Denna HOWTO täcker inte några avancerade ämnen, som att läsa innehållet på skärmen eller fånga mushändelser från en xterm-instans, men Python-bibliotekssidan för modulen :mod:`curses` är nu någorlunda komplett. Du bör bläddra igenom den härnäst.

source: If you're in doubt about the detailed behavior of the curses functions, consult the manual pages for your curses implementation, whether it's ncurses or a proprietary Unix vendor's. The manual pages will document any quirks, and provide complete lists of all the functions, attributes, and :ref:`ACS_\* <curses-acs-codes>` characters available to you.
sv: Om du är osäker på hur curses-funktionerna fungerar i detalj bör du läsa manualsidorna för din curses-implementering, oavsett om det är ncurses eller en egenutvecklad Unix-leverantörs. Manualsidorna dokumenterar alla konstigheter och innehåller fullständiga listor över alla funktioner, attribut och :ref:`ACS_\* <curses-acs-codes>`-tecken som är tillgängliga för dig.

source: Because the curses API is so large, some functions aren't supported in the Python interface. Often this isn't because they're difficult to implement, but because no one has needed them yet. Also, Python doesn't yet support the menu library associated with ncurses. Patches adding support for these would be welcome; see `the Python Developer's Guide <https://devguide.python.org/>`_ to learn more about submitting patches to Python.
sv: Eftersom curses API är så stort finns det funktioner som inte stöds i Python-gränssnittet. Ofta beror detta inte på att de är svåra att implementera, utan på att ingen har behövt dem ännu. Dessutom stöder Python ännu inte menybiblioteket som är associerat med ncurses. Patchar som lägger till stöd för dessa skulle vara välkomna; se `the Python Developer's Guide <https://devguide.python.org/>`_ för att lära dig mer om att skicka in patchar till Python.

source: `Writing Programs with NCURSES <https://invisible-island.net/ncurses/ncurses-intro.html>`_: a lengthy tutorial for C programmers.
sv: `Writing Programs with NCURSES <https://invisible-island.net/ncurses/ncurses-intro.html>`_: en utförlig handledning för C-programmerare.

source: `The ncurses man page <https://linux.die.net/man/3/ncurses>`_
sv: "Manuell sida för ncurses <https://linux.die.net/man/3/ncurses>

source: `The ncurses FAQ <https://invisible-island.net/ncurses/ncurses.faq.html>`_
sv: fAQ om ncurses <https://invisible-island.net/ncurses/ncurses.faq.html>`_

source: `"Use curses... don't swear" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_: video of a PyCon 2013 talk on controlling terminals using curses or Urwid.
sv: `"Use curses... don't swwear" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_: video av ett PyCon 2013-tal om att styra terminaler med hjälp av curses eller Urwid.

source: `"Console Applications with Urwid" <https://pyvideo.org/video/1568/console-applications-with-urwid>`_: video of a PyCon CA 2012 talk demonstrating some applications written using Urwid.
sv: `"Console Applications with Urwid" <https://pyvideo.org/video/1568/console-applications-with-urwid>`_: video av ett föredrag på PyCon CA 2012 som visar några program som skrivits med Urwid.
