Repository: yeager/python-docs-sv
Catalog: howto/curses.po
Languages: sv

source: Curses Programming with Python
sv: Curses-programmering med Python

source: Author
sv: Författare

source: Abstract
sv: Abstrakt

source: This document describes how to use the :mod:`curses` extension module to control text-mode displays.
sv: I det här dokumentet beskrivs hur du använder tilläggsmodulen :mod:`curses` för att styra textlägesdisplayer.

source: What is curses?
sv: Vad är curses?

source: The curses library supplies a terminal-independent screen-painting and keyboard-handling facility for text-based terminals; such terminals include VT100s, the Linux console, and the simulated terminal provided by various programs. Display terminals support various control codes to perform common operations such as moving the cursor, scrolling the screen, and erasing areas. Different terminals use widely differing codes, and often have their own minor quirks.
sv: Curses-biblioteket tillhandahåller en terminaloberoende skärmmålnings- och tangentbordshanteringsfunktion för textbaserade terminaler; sådana terminaler inkluderar VT100, Linux-konsolen och den simulerade terminalen som tillhandahålls av olika program. Displayterminaler stöder olika kontrollkoder för att utföra vanliga åtgärder som att flytta markören, rulla skärmen och radera områden. Olika terminaler använder vitt skilda koder och har ofta sina egna små egenheter.

source: In a world of graphical displays, one might ask "why bother"? It's true that character-cell display terminals are an obsolete technology, but there are niches in which being able to do fancy things with them are still valuable. One niche is on small-footprint or embedded Unixes that don't run an X server. Another is tools such as OS installers and kernel configurators that may have to run before any graphical support is available.
sv: I en värld av grafiska skärmar kan man fråga sig "varför bry sig"? Det är sant att terminaler med teckencellsskärm är en föråldrad teknik, men det finns nischer där det fortfarande är värdefullt att kunna göra snygga saker med dem. En nisch är små eller inbäddade Unix-datorer som inte kör en X-server. En annan är verktyg som OS-installatörer och kärnkonfiguratorer som kan behöva köras innan något grafiskt stöd finns tillgängligt.

source: The curses library provides fairly basic functionality, providing the programmer with an abstraction of a display containing multiple non-overlapping windows of text. The contents of a window can be changed in various ways---adding text, erasing it, changing its appearance---and the curses library will figure out what control codes need to be sent to the terminal to produce the right output. curses doesn't provide many user-interface concepts such as buttons, checkboxes, or dialogs; if you need such features, consider a user interface library such as :pypi:`Urwid`.
sv: Curses-biblioteket har ganska grundläggande funktioner och ger programmeraren en abstraktion av en bildskärm som innehåller flera icke överlappande textfönster. Innehållet i ett fönster kan ändras på olika sätt - lägga till text, radera den, ändra dess utseende - och curses-biblioteket räknar ut vilka kontrollkoder som behöver skickas till terminalen för att producera rätt utdata. curses tillhandahåller inte många användargränssnittskoncept som knappar, kryssrutor eller dialogrutor; om du behöver sådana funktioner, överväg ett användargränssnittsbibliotek som :pypi:`Urwid`.

source: The curses library was originally written for BSD Unix; the later System V versions of Unix from AT&T added many enhancements and new functions. BSD curses is no longer maintained, having been replaced by ncurses, which is an open-source implementation of the AT&T interface. If you're using an open-source Unix such as Linux or FreeBSD, your system almost certainly uses ncurses. Since most current commercial Unix versions are based on System V code, all the functions described here will probably be available. The older versions of curses carried by some proprietary Unixes may not support everything, though.
sv: Curses-biblioteket skrevs ursprungligen för BSD Unix; de senare System V-versionerna av Unix från AT&T lade till många förbättringar och nya funktioner. BSD curses underhålls inte längre, utan har ersatts av ncurses, som är en implementering av AT&T-gränssnittet med öppen källkod. Om du använder ett Unix med öppen källkod, som Linux eller FreeBSD, använder ditt system nästan säkert ncurses. Eftersom de flesta aktuella kommersiella Unix-versioner är baserade på System V-kod, kommer alla funktioner som beskrivs här förmodligen att finnas tillgängliga. De äldre versionerna av curses som finns i vissa proprietära Unix-system kanske dock inte stöder allt.

source: The Windows version of Python doesn't include the :mod:`curses` module. A ported version called :pypi:`UniCurses` is available.
sv: Windows-versionen av Python innehåller inte modulen :mod:`curses`. En portad version som heter :pypi:`UniCurses` är tillgänglig.

source: The Python curses module
sv: Python-modulen curses

source: The Python module is a fairly simple wrapper over the C functions provided by curses; if you're already familiar with curses programming in C, it's really easy to transfer that knowledge to Python. The biggest difference is that the Python interface makes things simpler by merging different C functions such as :c:func:`!addstr`, :c:func:`!mvaddstr`, and :c:func:`!mvwaddstr` into a single :meth:`~curses.window.addstr` method. You'll see this covered in more detail later.
sv: Python-modulen är ett ganska enkelt omslag över de C-funktioner som tillhandahålls av curses; om du redan är bekant med curses-programmering i C är det väldigt enkelt att överföra den kunskapen till Python. Den största skillnaden är att Python-gränssnittet gör saker enklare genom att slå samman olika C-funktioner som :c:func:`!addstr`, :c:func:`!mvaddstr` och :c:func:`!mvwaddstr` till en enda :meth:`~curses.window.addstr`-metod. Du kommer att se detta mer i detalj senare.

source: This HOWTO is an introduction to writing text-mode programs with curses and Python. It doesn't attempt to be a complete guide to the curses API; for that, see the Python library guide's section on ncurses, and the C manual pages for ncurses. It will, however, give you the basic ideas.
sv: Denna HOWTO är en introduktion till att skriva textlägesprogram med curses och Python. Den försöker inte vara en komplett guide till curses API; för det, se Python-biblioteksguidens avsnitt om ncurses och C-manualsidorna för ncurses. Det kommer dock att ge dig de grundläggande idéerna.

source: Starting and ending a curses application
sv: Starta och avsluta en curses-applikation

source: Before doing anything, curses must be initialized. This is done by calling the :func:`~curses.initscr` function, which will determine the terminal type, send any required setup codes to the terminal, and create various internal data structures. If successful, :func:`!initscr` returns a window object representing the entire screen; this is usually called ``stdscr`` after the name of the corresponding C variable. ::
sv: Innan något kan göras måste curses initialiseras. Detta görs genom att anropa funktionen :func:`~curses.initscr`, som bestämmer terminaltypen, skickar alla nödvändiga inställningskoder till terminalen och skapar olika interna datastrukturer. Om funktionen lyckas returnerar :func:`!initscr` ett fönsterobjekt som representerar hela skärmen; detta kallas vanligtvis ``stdscr`` efter namnet på motsvarande C-variabel. ::

source: Usually curses applications turn off automatic echoing of keys to the screen, in order to be able to read keys and only display them under certain circumstances. This requires calling the :func:`~curses.noecho` function. ::
sv: Vanligtvis stänger curses-applikationer av automatisk ekoåtergivning av tangenter till skärmen, för att kunna läsa tangenter och bara visa dem under vissa omständigheter. Detta kräver att man anropar funktionen :func:`~curses.noecho`. ::

source: Applications will also commonly need to react to keys instantly, without requiring the Enter key to be pressed; this is called cbreak mode, as opposed to the usual buffered input mode. ::
sv: Program behöver också ofta reagera på tangenter direkt, utan att Enter-tangenten behöver tryckas; detta kallas cbreak-läge, i motsats till det vanliga buffrade inmatningsläget. ::

source: Terminals usually return special keys, such as the cursor keys or navigation keys such as Page Up and Home, as a multibyte escape sequence. While you could write your application to expect such sequences and process them accordingly, curses can do it for you, returning a special value such as :const:`curses.KEY_LEFT`. To get curses to do the job, you'll have to enable keypad mode. ::
sv: Terminaler returnerar vanligtvis specialtangenter, t.ex. markörknapparna eller navigeringstangenter som Page Up och Home, som en escape-sekvens med flera byte. Du kan skriva ditt program så att det förväntar sig sådana sekvenser och behandlar dem därefter, men curses kan göra det åt dig genom att returnera ett specialvärde som :const:`curses.KEY_LEFT`. För att få curses att göra jobbet måste du aktivera tangentbordsläget. ::

source: Terminating a curses application is much easier than starting one. You'll need to call::
sv: Att avsluta en curses-applikation är mycket enklare än att starta en. Du behöver bara anropa::

source: to reverse the curses-friendly terminal settings. Then call the :func:`~curses.endwin` function to restore the terminal to its original operating mode. ::
sv: för att återställa de curses-vänliga terminalinställningarna. Anropa sedan funktionen :func:`~curses.endwin` för att återställa terminalen till dess ursprungliga driftläge. ::

source: A common problem when debugging a curses application is to get your terminal messed up when the application dies without restoring the terminal to its previous state. In Python this commonly happens when your code is buggy and raises an uncaught exception. Keys are no longer echoed to the screen when you type them, for example, which makes using the shell difficult.
sv: Ett vanligt problem när man felsöker en curses-applikation är att terminalen blir rörig när applikationen dör utan att terminalen återställs till sitt tidigare tillstånd. I Python händer detta ofta när din kod är buggig och ger upphov till ett undantag som inte fångats upp. Tangenter ekar inte längre på skärmen när du skriver dem, till exempel, vilket gör det svårt att använda skalet.

source: In Python you can avoid these complications and make debugging much easier by importing the :func:`curses.wrapper` function and using it like this::
sv: I Python kan du undvika dessa komplikationer och göra felsökningen mycket enklare genom att importera funktionen :func:`curses.wrapper` och använda den så här::

source: The :func:`~curses.wrapper` function takes a callable object and does the initializations described above, also initializing colors if color support is present. :func:`!wrapper` then runs your provided callable. Once the callable returns, :func:`!wrapper` will restore the original state of the terminal. The callable is called inside a :keyword:`try`...\ :keyword:`except` that catches exceptions, restores the state of the terminal, and then re-raises the exception. Therefore your terminal won't be left in a funny state on exception and you'll be able to read the exception's message and traceback.
sv: Funktionen :func:`~curses.wrapper` tar ett anropbart objekt och gör de initialiseringar som beskrivs ovan, samt initialiserar färger om det finns färgstöd. :func:`!wrapper` kör sedan din tillhandahållna anropbara kod. När det anropbara objektet returneras återställer :func:`!wrapper` terminalens ursprungliga tillstånd. Den anropbara funktionen anropas inuti en :keyword:`try`...\ :keyword:`except` som fångar upp undantag, återställer terminalens tillstånd och sedan anropar undantaget igen. Därför kommer din terminal inte att lämnas i ett konstigt tillstånd vid undantag och du kommer att kunna läsa undantagets meddelande och traceback.

source: Windows and Pads
sv: Fönster och pads

source: Windows are the basic abstraction in curses. A window object represents a rectangular area of the screen, and supports methods to display text, erase it, allow the user to input strings, and so forth.
sv: Fönster är den grundläggande abstraktionen i curses. Ett fönsterobjekt representerar ett rektangulärt område på skärmen och stöder metoder för att visa text, radera den, låta användaren mata in strängar och så vidare.

source: The ``stdscr`` object returned by the :func:`~curses.initscr` function is a window object that covers the entire screen. Many programs may need only this single window, but you might wish to divide the screen into smaller windows, in order to redraw or clear them separately. The :func:`~curses.newwin` function creates a new window of a given size, returning the new window object. ::
sv: Objektet ``stdscr`` som returneras av funktionen :func:`~curses.initscr` är ett fönsterobjekt som täcker hela skärmen. Många program behöver bara detta enda fönster, men du kanske vill dela upp skärmen i mindre fönster för att kunna rita om eller rensa dem separat. Funktionen :func:`~curses.newwin` skapar ett nytt fönster av en given storlek och returnerar det nya fönsterobjektet. ::

source: Note that the coordinate system used in curses is unusual. Coordinates are always passed in the order *y,x*, and the top-left corner of a window is coordinate (0,0). This breaks the normal convention for handling coordinates where the *x* coordinate comes first. This is an unfortunate difference from most other computer applications, but it's been part of curses since it was first written, and it's too late to change things now.
sv: Observera att det koordinatsystem som används i curses är ovanligt. Koordinater skickas alltid i ordningen *y,x*, och det övre vänstra hörnet av ett fönster är koordinat (0,0). Detta bryter mot den normala konventionen för hantering av koordinater där *x*-koordinaten kommer först. Detta är en olycklig skillnad mot de flesta andra datorprogram, men det har varit en del av curses sedan det först skrevs, och det är för sent att ändra på saker nu.

source: Your application can determine the size of the screen by using the :data:`curses.LINES` and :data:`curses.COLS` variables to obtain the *y* and *x* sizes. Legal coordinates will then extend from ``(0,0)`` to ``(curses.LINES - 1, curses.COLS - 1)``.
sv: Ditt program kan bestämma skärmens storlek genom att använda variablerna :data:`curses.LINES` och :data:`curses.COLS` för att få storlekarna *y* och *x*. Lagliga koordinater kommer då att sträcka sig från ``(0,0)`` till ``(curses.LINES - 1, curses.COLS - 1)``.

source: When you call a method to display or erase text, the effect doesn't immediately show up on the display. Instead you must call the :meth:`~curses.window.refresh` method of window objects to update the screen.
sv: När du anropar en metod för att visa eller radera text visas inte effekten omedelbart på skärmen. Istället måste du anropa metoden :meth:`~curses.window.refresh` för fönsterobjekt för att uppdatera skärmen.

source: This is because curses was originally written with slow 300-baud terminal connections in mind; with these terminals, minimizing the time required to redraw the screen was very important. Instead curses accumulates changes to the screen and displays them in the most efficient manner when you call :meth:`!refresh`. For example, if your program displays some text in a window and then clears the window, there's no need to send the original text because they're never visible.
sv: Detta beror på att curses ursprungligen skrevs med tanke på långsamma 300-baud terminalanslutningar; med dessa terminaler var det mycket viktigt att minimera den tid som krävdes för att rita om skärmen. Istället ackumulerar curses ändringar på skärmen och visar dem på det mest effektiva sättet när du anropar :meth:`!refresh`. Om ditt program t.ex. visar text i ett fönster och sedan rensar fönstret, behöver du inte skicka originaltexten eftersom den aldrig är synlig.

source: In practice, explicitly telling curses to redraw a window doesn't really complicate programming with curses much. Most programs go into a flurry of activity, and then pause waiting for a keypress or some other action on the part of the user. All you have to do is to be sure that the screen has been redrawn before pausing to wait for user input, by first calling :meth:`!stdscr.refresh` or the :meth:`!refresh` method of some other relevant window.
sv: I praktiken är det inte särskilt komplicerat att programmera med curses om man uttryckligen säger till curses att rita om ett fönster. De flesta program går in i en febril aktivitet och pausar sedan i väntan på en tangenttryckning eller någon annan åtgärd från användarens sida. Allt du behöver göra är att vara säker på att skärmen har ritats om innan du pausar för att vänta på användarinmatning, genom att först anropa :meth:`!stdscr.refresh` eller :meth:`!refresh`-metoden för något annat relevant fönster.

source: A pad is a special case of a window; it can be larger than the actual display screen, and only a portion of the pad displayed at a time. Creating a pad requires the pad's height and width, while refreshing a pad requires giving the coordinates of the on-screen area where a subsection of the pad will be displayed. ::
sv: En pad är ett specialfall av ett fönster; den kan vara större än den faktiska skärmen och endast en del av padden visas åt gången. För att skapa en pad krävs paddens höjd och bredd, medan uppdatering av en pad kräver att koordinaterna anges för det område på skärmen där en del av padden ska visas:

source: pad = curses.newpad(100, 100) # These loops fill the pad with letters; addch() is # explained in the next section for y in range(0, 99): for x in range(0, 99): pad.addch(y,x, ord('a') + (x*x+y*y) % 26) # Displays a section of the pad in the middle of the screen. # (0,0) : coordinate of upper-left corner of pad area to display. # (5,5) : coordinate of upper-left corner of window area to be filled # with pad content. # (20, 75) : coordinate of lower-right corner of window area to be # : filled with pad content. pad.refresh( 0,0, 5,5, 20,75)
sv: pad = curses.newpad(100, 100) # Dessa slingor fyller paddan med bokstäver; addch() förklaras # förklaras i nästa avsnitt för y i intervallet(0, 99): for x in range(0, 99): pad.addch(y,x, ord('a') + (x*x+y*y) % 26) # Visar ett utsnitt av paddan i mitten av skärmen. # (0,0) : koordinat för det övre vänstra hörnet av det område som ska visas. # (5,5) : koordinat för övre vänstra hörnet av fönsterområdet som ska fyllas # med pad-innehåll. # (20, 75) : koordinat för det nedre högra hörnet av fönsterytan som ska # : fyllas med pad-innehåll. pad.refresh( 0,0, 5,5, 20,75)

source: The :meth:`!refresh` call displays a section of the pad in the rectangle extending from coordinate (5,5) to coordinate (20,75) on the screen; the upper left corner of the displayed section is coordinate (0,0) on the pad. Beyond that difference, pads are exactly like ordinary windows and support the same methods.
sv: Anropet :meth:`!refresh` visar en del av padden i den rektangel som sträcker sig från koordinat (5,5) till koordinat (20,75) på skärmen; det övre vänstra hörnet av den visade delen är koordinat (0,0) på padden. Utöver denna skillnad är paddar precis som vanliga fönster och stöder samma metoder.

source: If you have multiple windows and pads on screen there is a more efficient way to update the screen and prevent annoying screen flicker as each part of the screen gets updated. :meth:`!refresh` actually does two things:
sv: Om du har flera fönster och pads på skärmen finns det ett mer effektivt sätt att uppdatera skärmen och förhindra irriterande skärmflimmer när varje del av skärmen uppdateras. :meth:`!refresh` gör faktiskt två saker:

source: Calls the :meth:`~curses.window.noutrefresh` method of each window to update an underlying data structure representing the desired state of the screen.
sv: Anropar :meth:`~curses.window.noutrefresh`-metoden för varje fönster för att uppdatera en underliggande datastruktur som representerar det önskade tillståndet på skärmen.

source: Calls the function :func:`~curses.doupdate` function to change the physical screen to match the desired state recorded in the data structure.
sv: Anropar funktionen :func:`~curses.doupdate` för att ändra den fysiska skärmen så att den motsvarar det önskade tillstånd som registrerats i datastrukturen.

source: Instead you can call :meth:`!noutrefresh` on a number of windows to update the data structure, and then call :func:`!doupdate` to update the screen.
sv: Istället kan du anropa :meth:`!noutrefresh` på ett antal fönster för att uppdatera datastrukturen, och sedan anropa :func:`!doupdate` för att uppdatera skärmen.

source: Displaying Text
sv: Visning av text

source: From a C programmer's point of view, curses may sometimes look like a twisty maze of functions, all subtly different. For example, :c:func:`!addstr` displays a string at the current cursor location in the ``stdscr`` window, while :c:func:`!mvaddstr` moves to a given y,x coordinate first before displaying the string. :c:func:`!waddstr` is just like :c:func:`!addstr`, but allows specifying a window to use instead of using ``stdscr`` by default. :c:func:`!mvwaddstr` allows specifying both a window and a coordinate.
sv: Från en C-programmerares synvinkel kan curses ibland se ut som en snårig labyrint av funktioner, alla subtilt olika. Till exempel visar :c:func:`!addstr` en sträng vid den aktuella markörpositionen i fönstret ``stdscr``, medan :c:func:`!mvaddstr` först flyttar till en given y,x-koordinat innan strängen visas. :c:func:`!waddstr` är precis som :c:func:`!addstr`, men tillåter att man anger ett fönster att använda istället för att använda ``stdscr`` som standard. :c:func:`!mvwaddstr` tillåter att man anger både ett fönster och en koordinat.

source: Fortunately the Python interface hides all these details. ``stdscr`` is a window object like any other, and methods such as :meth:`~curses.window.addstr` accept multiple argument forms. Usually there are four different forms.
sv: Lyckligtvis döljer Python-gränssnittet alla dessa detaljer. ``stdscr`` är ett fönsterobjekt som alla andra, och metoder som :meth:`~curses.window.addstr` accepterar flera argumentformer. Vanligtvis finns det fyra olika former.

source: Form
sv: Formulär

source: Description
sv: Beskrivning

source: *str* or *ch*
sv: *str* eller *ch*

source: Display the string *str* or character *ch* at the current position
sv: Visa strängen *str* eller tecknet *ch* vid den aktuella positionen

source: *str* or *ch*, *attr*
sv: *str* eller *ch*, *attr*

source: Display the string *str* or character *ch*, using attribute *attr* at the current position
sv: Visa strängen *str* eller tecknet *ch* med attributet *attr* på den aktuella positionen

source: *y*, *x*, *str* or *ch*
sv: *y*, *x*, *str* eller *ch*

source: Move to position *y,x* within the window, and display *str* or *ch*
sv: Flytta till position *y,x* i fönstret och visa *str* eller *ch*

source: *y*, *x*, *str* or *ch*, *attr*
sv: *y*, *x*, *str* eller *ch*, *attr*

source: Move to position *y,x* within the window, and display *str* or *ch*, using attribute *attr*
sv: Flytta till position *y,x* i fönstret och visa *str* eller *ch* med hjälp av attributet *attr*

source: Attributes allow displaying text in highlighted forms such as boldface, underline, reverse code, or in color. They'll be explained in more detail in the next subsection.
sv: Attribut gör det möjligt att visa text i markerade former som fetstil, understrykning, omvänd kod eller i färg. De förklaras mer i detalj i nästa underavsnitt.
