Repository: yeager/python-docs-sv
Catalog: howto/descriptor.po
Languages: sv

source: It is not possible to create an exact drop-in pure Python version of ``__slots__`` because it requires direct access to C structures and control over object memory allocation. However, we can build a mostly faithful simulation where the actual C structure for slots is emulated by a private ``_slotvalues`` list. Reads and writes to that private structure are managed by member descriptors:
sv: Det är inte möjligt att skapa en exakt drop-in ren Python-version av ``__slots__`` eftersom det kräver direkt tillgång till C-strukturer och kontroll över objektminnesallokering. Vi kan dock bygga en mestadels trogen simulering där den faktiska C-strukturen för slots emuleras av en privat ``_slotvalues``-lista. Läsningar och skrivningar till den privata strukturen hanteras av medlemsdeskriptorer:

source: null = object() class Member: def __init__(self, name, clsname, offset): 'Emulate PyMemberDef in Include/structmember.h' # Also see descr_new() in Objects/descrobject.c self.name = name self.clsname = clsname self.offset = offset def __get__(self, obj, objtype=None): 'Emulate member_get() in Objects/descrobject.c' # Also see PyMember_GetOne() in Python/structmember.c if obj is None: return self value = obj._slotvalues[self.offset] if value is null: raise AttributeError(self.name) return value def __set__(self, obj, value): 'Emulate member_set() in Objects/descrobject.c' obj._slotvalues[self.offset] = value def __delete__(self, obj): 'Emulate member_delete() in Objects/descrobject.c' value = obj._slotvalues[self.offset] if value is null: raise AttributeError(self.name) obj._slotvalues[self.offset] = null def __repr__(self): 'Emulate member_repr() in Objects/descrobject.c' return f'<Member {self.name!r} of {self.clsname!r}>'
sv: null = objekt() klass Medlem: def __init__(self, name, clsname, offset): 'Emulera PyMemberDef i Include/structmember.h' # Se även descr_new() i Objects/descrobject.c self.name = namn self.clsname = clsname self.offset = offset def __get__(self, obj, objtype=None): "Emulera member_get() i Objects/descrobject.c # Se även PyMember_GetOne() i Python/structmember.c om obj är None: return self värde = obj._slotvalues[self.offset] om värdet är null: raise AttributeError(self.name) returnera värde def __set__(self, obj, värde): 'Emulera member_set() i Objects/descrobject.c' obj._slotvalues[self.offset] = värde def __delete__(self, obj): "Emulera member_delete() i Objects/descrobject.c värde = obj._slotvalues[self.offset] om värdet är null: raise AttributeError(self.name) obj._slotvalues[self.offset] = null def __repr__(self): 'Emulera member_repr() i Objects/descrobject.c' return f'<Medlem {self.name!r} av {self.clsname!r}>'

source: The :meth:`!type.__new__` method takes care of adding member objects to class variables:
sv: Metoden :meth:`!type.__new__` tar hand om att lägga till medlemsobjekt i klassvariabler:

source: class Type(type): 'Simulate how the type metaclass adds member objects for slots' def __new__(mcls, clsname, bases, mapping, **kwargs): 'Emulate type_new() in Objects/typeobject.c' # type_new() calls PyTypeReady() which calls add_methods() slot_names = mapping.get('slot_names', []) for offset, name in enumerate(slot_names): mapping[name] = Member(name, clsname, offset) return type.__new__(mcls, clsname, bases, mapping, **kwargs)
sv: klass Typ(typ): 'Simulera hur metaklassen type lägger till medlemsobjekt för slots' def __new__(mcls, clsname, baser, mappning, **kwargs): "Emulera type_new() i Objects/typeobject.c # type_new() anropar PyTypeReady() som anropar add_methods() slot_names = mappning.get('slot_names', []) för offset, namn i enumerate(slot_names): mappning[namn] = Member(namn, clsnamn, offset) return type.__new__(mcls, clsname, baser, mappning, **kwargs)

source: The :meth:`object.__new__` method takes care of creating instances that have slots instead of an instance dictionary. Here is a rough simulation in pure Python:
sv: Metoden :meth:`object.__new__` tar hand om att skapa instanser som har slots istället för en instansordbok. Här är en grov simulering i ren Python:

source: To use the simulation in a real class, just inherit from :class:`!Object` and set the :term:`metaclass` to :class:`Type`:
sv: För att använda simuleringen i en riktig klass är det bara att ärva från :class:`!Object` och sätta :term:`metaclass` till :class:`Type`:

source: At this point, the metaclass has loaded member objects for *x* and *y*::
sv: Vid det här laget har metaklassen laddat medlemsobjekt för *x* och *y*::

source: When instances are created, they have a ``slot_values`` list where the attributes are stored:
sv: När instanser skapas har de en lista med ``slot_values`` där attributen lagras:

source: Misspelled or unassigned attributes will raise an exception:
sv: Felstavade eller icke tilldelade attribut kommer att leda till ett undantag:
