Repository: yeager/python-docs-sv
Catalog: howto/descriptor.po
Languages: sv

source: Note, there is no :meth:`~object.__getattr__` hook in the :meth:`~object.__getattribute__` code. That is why calling :meth:`~object.__getattribute__` directly or with ``super().__getattribute__`` will bypass :meth:`~object.__getattr__` entirely.
sv: Observera att det inte finns någon :meth:`~object.__getattr__`-krok i :meth:`~object.__getattribute__`-koden. Därför kommer anrop av :meth:`~object.__getattribute__` direkt eller med ``super().__getattribute__`` att kringgå :meth:`~object.__getattr__` helt och hållet.

source: Instead, it is the dot operator and the :func:`getattr` function that are responsible for invoking :meth:`~object.__getattr__` whenever :meth:`~object.__getattribute__` raises an :exc:`AttributeError`. Their logic is encapsulated in a helper function:
sv: Istället är det punktoperatorn och funktionen :func:`getattr` som ansvarar för att anropa :meth:`~object.__getattr__` närhelst :meth:`~object.__getattribute__` ger upphov till ett :exc:`AttributeError`. Deras logik är inkapslad i en hjälpfunktion:

source: Invocation from a class
sv: Anrop från en klass

source: The logic for a dotted lookup such as ``A.x`` is in :meth:`!type.__getattribute__`. The steps are similar to those for :meth:`!object.__getattribute__` but the instance dictionary lookup is replaced by a search through the class's :term:`method resolution order`.
sv: Logiken för en prickad uppslagning som ``A.x`` finns i :meth:`!type.__getattribute__`. Stegen liknar dem för :meth:`!object.__getattribute__` men uppslagningen i instansordboken ersätts av en sökning genom klassens :term:`method resolution order`.

source: If a descriptor is found, it is invoked with ``desc.__get__(None, A)``.
sv: Om en descriptor hittas anropas den med ``desc.__get__(None, A)``.

source: The full C implementation can be found in :c:func:`!type_getattro` and :c:func:`!_PyType_Lookup` in :source:`Objects/typeobject.c`.
sv: Den fullständiga C-implementeringen finns i :c:func:`!type_getattro` och :c:func:`!_PyType_Lookup` i :source:`Objects/typeobject.c`.

source: Invocation from super
sv: Anrop från super

source: The logic for super's dotted lookup is in the :meth:`~object.__getattribute__` method for object returned by :func:`super`.
sv: Logiken för Supers prickade uppslagning finns i metoden :meth:`~object.__getattribute__` för objekt som returneras av :func:`super`.

source: A dotted lookup such as ``super(A, obj).m`` searches ``obj.__class__.__mro__`` for the base class ``B`` immediately following ``A`` and then returns ``B.__dict__['m'].__get__(obj, A)``. If not a descriptor, ``m`` is returned unchanged.
sv: En prickad uppslagning som ``super(A, obj).m`` söker i ``obj.__class__.__mro__`` efter basklassen ``B`` omedelbart efter ``A`` och returnerar sedan ``B.__dict__['m'].__get__(obj, A)``. Om det inte är en deskriptor returneras ``m`` oförändrad.

source: The full C implementation can be found in :c:func:`!super_getattro` in :source:`Objects/typeobject.c`. A pure Python equivalent can be found in `Guido's Tutorial <https://www.python.org/download/releases/2.2.3/descrintro/#cooperation>`_.
sv: Den fullständiga C-implementeringen finns i :c:func:`!super_getattro` i :source:`Objects/typeobject.c`. En ren Python-ekvivalent finns i `Guido's Tutorial <https://www.python.org/download/releases/2.2.3/descrintro/#cooperation>`_.

source: Summary of invocation logic
sv: Sammanfattning av anropslogiken

source: The mechanism for descriptors is embedded in the :meth:`~object.__getattribute__` methods for :class:`object`, :class:`type`, and :func:`super`.
sv: Mekanismen för deskriptorer är inbäddad i metoderna :meth:`~object.__getattribute__` för :class:`object`, :class:`type` och :func:`super`.

source: The important points to remember are:
sv: De viktiga punkterna att komma ihåg är:

source: Descriptors are invoked by the :meth:`~object.__getattribute__` method.
sv: Deskriptorer anropas med metoden :meth:`~object.__getattribute__`.

source: Classes inherit this machinery from :class:`object`, :class:`type`, or :func:`super`.
sv: Klasser ärver detta maskineri från :class:`object`, :class:`type` eller :func:`super`.

source: Overriding :meth:`~object.__getattribute__` prevents automatic descriptor calls because all the descriptor logic is in that method.
sv: Åsidosättande av :meth:`~object.__getattribute__` förhindrar automatiska descriptor-anrop eftersom all descriptor-logik finns i den metoden.

source: Data descriptors always override instance dictionaries.
sv: Data descriptors har alltid företräde framför instance dictionaries.

source: Non-data descriptors may be overridden by instance dictionaries.
sv: Deskriptorer som inte är data kan åsidosättas av instansordlistor.

source: Automatic name notification
sv: Automatisk namnavisering

source: Sometimes it is desirable for a descriptor to know what class variable name it was assigned to. When a new class is created, the :class:`type` metaclass scans the dictionary of the new class. If any of the entries are descriptors and if they define :meth:`~object.__set_name__`, that method is called with two arguments. The *owner* is the class where the descriptor is used, and the *name* is the class variable the descriptor was assigned to.
sv: Ibland är det önskvärt att en deskriptor vet vilket klassvariabelnamn den tilldelades. När en ny klass skapas skannar metaklassen :class:`type` den nya klassens dictionary. Om någon av posterna är deskriptorer och om de definierar :meth:`~object.__set_name__`, anropas den metoden med två argument. *owner* är den klass där deskriptorn används och *name* är den klassvariabel som deskriptorn tilldelades.

source: The implementation details are in :c:func:`!type_new` and :c:func:`!set_names` in :source:`Objects/typeobject.c`.
sv: Implementationsdetaljerna finns i :c:func:`!type_new` och :c:func:`!set_names` i :source:`Objects/typeobject.c`.

source: Since the update logic is in :meth:`!type.__new__`, notifications only take place at the time of class creation. If descriptors are added to the class afterwards, :meth:`~object.__set_name__` will need to be called manually.
sv: Eftersom uppdateringslogiken finns i :meth:`!type.__new__`, sker notifieringar endast vid tidpunkten för klassens skapande. Om deskriptorer läggs till i klassen efteråt måste :meth:`~object.__set_name__` anropas manuellt.

source: ORM example
sv: Exempel på ORM

source: The following code is a simplified skeleton showing how data descriptors could be used to implement an `object relational mapping <https://en.wikipedia.org/wiki/Object%E2%80%93relational_mapping>`_.
sv: Följande kod är ett förenklat skelett som visar hur databeskrivare kan användas för att implementera en "objektrelationsmappning" <https://en.wikipedia.org/wiki/Object%E2%80%93relational_mapping>`_.

source: The essential idea is that the data is stored in an external database. The Python instances only hold keys to the database's tables. Descriptors take care of lookups or updates:
sv: Grundtanken är att data lagras i en extern databas. Python-instanserna innehåller bara nycklar till databasens tabeller. Deskriptorer tar hand om uppslagningar eller uppdateringar:

source: We can use the :class:`!Field` class to define `models <https://en.wikipedia.org/wiki/Database_model>`_ that describe the schema for each table in a database:
sv: Vi kan använda :class:`!Field`-klassen för att definiera `modeller <https://en.wikipedia.org/wiki/Database_model>`_ som beskriver schemat för varje tabell i en databas:

source: To use the models, first connect to the database::
sv: För att använda modellerna måste du först ansluta till databasen::

source: An interactive session shows how data is retrieved from the database and how it can be updated:
sv: En interaktiv session visar hur data hämtas från databasen och hur den kan uppdateras:

source: Pure Python Equivalents
sv: Rena Python-ekvivalenter

source: The descriptor protocol is simple and offers exciting possibilities. Several use cases are so common that they have been prepackaged into built-in tools. Properties, bound methods, static methods, class methods, and \_\_slots\_\_ are all based on the descriptor protocol.
sv: Descriptor-protokollet är enkelt och erbjuder spännande möjligheter. Flera användningsfall är så vanliga att de har paketerats i inbyggda verktyg. Egenskaper, bundna metoder, statiska metoder, klassmetoder och \_\_slots\_\_ är alla baserade på descriptor-protokollet.

source: Properties
sv: Egenskaper

source: Calling :func:`property` is a succinct way of building a data descriptor that triggers a function call upon access to an attribute. Its signature is::
sv: Anrop av :func:`property` är ett kortfattat sätt att bygga en databeskrivning som utlöser ett funktionsanrop vid åtkomst till ett attribut. Dess signatur är::

source: The documentation shows a typical use to define a managed attribute ``x``:
sv: Dokumentationen visar en typisk användning för att definiera ett hanterat attribut ``x``:

source: To see how :func:`property` is implemented in terms of the descriptor protocol, here is a pure Python equivalent that implements most of the core functionality:
sv: För att se hur :func:`property` implementeras i termer av descriptorprotokollet, här är en ren Python-motsvarighet som implementerar det mesta av kärnfunktionaliteten:

source: The :func:`property` builtin helps whenever a user interface has granted attribute access and then subsequent changes require the intervention of a method.
sv: Inbyggda :func:`property` är till hjälp när ett användargränssnitt har gett tillgång till attribut och efterföljande ändringar kräver att en metod används.

source: For instance, a spreadsheet class may grant access to a cell value through ``Cell('b10').value``. Subsequent improvements to the program require the cell to be recalculated on every access; however, the programmer does not want to affect existing client code accessing the attribute directly. The solution is to wrap access to the value attribute in a property data descriptor:
sv: Till exempel kan en kalkylbladsklass ge åtkomst till ett cellvärde genom ``Cell('b10').value``. Senare förbättringar av programmet kräver att cellen räknas om vid varje åtkomst, men programmeraren vill inte påverka befintlig klientkod som har direkt åtkomst till attributet. Lösningen är att linda in åtkomst till värdeattributet i en egenskapsdatadeskriptor:

source: Either the built-in :func:`property` or our :func:`!Property` equivalent would work in this example.
sv: Antingen den inbyggda :func:`property` eller vår :func:`!Property`-ekvivalent skulle fungera i det här exemplet.

source: Functions and methods
sv: Funktioner och metoder

source: Python's object oriented features are built upon a function based environment. Using non-data descriptors, the two are merged seamlessly.
sv: Pythons objektorienterade funktioner bygger på en funktionsbaserad miljö. Med hjälp av icke-datadeskriptorer sammanfogas de två sömlöst.

source: Functions stored in class dictionaries get turned into methods when invoked. Methods only differ from regular functions in that the object instance is prepended to the other arguments. By convention, the instance is called *self* but could be called *this* or any other variable name.
sv: Funktioner som lagras i klassordböcker omvandlas till metoder när de anropas. Metoder skiljer sig från vanliga funktioner endast genom att objektinstansen läggs till de andra argumenten. Enligt konvention kallas instansen *self*, men den kan kallas *this* eller något annat variabelnamn.

source: Methods can be created manually with :class:`types.MethodType` which is roughly equivalent to:
sv: Metoder kan skapas manuellt med :class:`types.MethodType` vilket i stort sett motsvarar:

source: To support automatic creation of methods, functions include the :meth:`~object.__get__` method for binding methods during attribute access. This means that functions are non-data descriptors that return bound methods during dotted lookup from an instance. Here's how it works:
sv: För att stödja automatiskt skapande av metoder innehåller funktioner metoden :meth:`~object.__get__` för att binda metoder under attributåtkomst. Detta innebär att funktioner är icke-databeskrivare som returnerar bundna metoder under prickad uppslagning från en instans. Så här fungerar det:

source: Running the following class in the interpreter shows how the function descriptor works in practice:
sv: Genom att köra följande klass i tolken visas hur funktionsbeskrivaren fungerar i praktiken:

source: The function has a :term:`qualified name` attribute to support introspection:
sv: Funktionen har ett :term:`kvalificerat namn`-attribut för att stödja introspektion:

source: Accessing the function through the class dictionary does not invoke :meth:`~object.__get__`. Instead, it just returns the underlying function object::
sv: Om du öppnar funktionen via klassordlistan anropas inte :meth:`~object.__get__`. Istället returneras bara den underliggande funktionens objekt::

source: Dotted access from a class calls :meth:`~object.__get__` which just returns the underlying function unchanged::
sv: Punktad åtkomst från en klass anropar :meth:`~object.__get__` som bara returnerar den underliggande funktionen oförändrad::

source: The interesting behavior occurs during dotted access from an instance. The dotted lookup calls :meth:`~object.__get__` which returns a bound method object::
sv: Det intressanta beteendet inträffar under prickad åtkomst från en instans. Den prickade uppslagningen anropar :meth:`~object.__get__` som returnerar en bunden metod object::

source: Internally, the bound method stores the underlying function and the bound instance::
sv: Internt lagrar den bundna metoden den underliggande funktionen och den bundna instansen::

source: If you have ever wondered where *self* comes from in regular methods or where *cls* comes from in class methods, this is it!
sv: Om du någonsin har undrat var *self* kommer ifrån i vanliga metoder eller var *cls* kommer ifrån i klassmetoder, så har du svaret här!

source: Kinds of methods
sv: Olika typer av metoder

source: Non-data descriptors provide a simple mechanism for variations on the usual patterns of binding functions into methods.
sv: Deskriptorer för icke-data ger en enkel mekanism för variationer på de vanliga mönstren för att binda funktioner till metoder.

source: To recap, functions have a :meth:`~object.__get__` method so that they can be converted to a method when accessed as attributes. The non-data descriptor transforms an ``obj.f(*args)`` call into ``f(obj, *args)``. Calling ``cls.f(*args)`` becomes ``f(*args)``.
sv: För att sammanfatta har funktioner en :meth:`~object.__get__`-metod så att de kan konverteras till en metod när de används som attribut. Icke-data deskriptorn omvandlar ett anrop av ``obj.f(*args)`` till ``f(obj, *args)``. Anrop av ``cls.f(*args)`` blir ``f(*args)``.

source: This chart summarizes the binding and its two most useful variants:
sv: I detta diagram sammanfattas bindningen och dess två mest användbara varianter:

source: Transformation
sv: Omvandling

source: Called from an object
sv: Anropas från ett objekt

source: Called from a class
sv: Anropas från en klass

source: function
sv: funktion

source: staticmethod
sv: statisk metod

source: classmethod
sv: klassmetod

source: f(type(obj), \*args)
sv: f(typ(obj), \*args)

source: Static methods
sv: Statiska metoder

source: Static methods return the underlying function without changes. Calling either ``c.f`` or ``C.f`` is the equivalent of a direct lookup into ``object.__getattribute__(c, "f")`` or ``object.__getattribute__(C, "f")``. As a result, the function becomes identically accessible from either an object or a class.
sv: Statiska metoder returnerar den underliggande funktionen utan ändringar. Anrop av antingen ``c.f`` eller ``C.f`` motsvarar en direkt uppslagning i ``object.__getattribute__(c, "f")`` eller ``object.__getattribute__(C, "f")``. Därmed blir funktionen identiskt tillgänglig från antingen ett objekt eller en klass.

source: Good candidates for static methods are methods that do not reference the ``self`` variable.
sv: Bra kandidater för statiska metoder är metoder som inte refererar till variabeln ``self``.

source: For instance, a statistics package may include a container class for experimental data. The class provides normal methods for computing the average, mean, median, and other descriptive statistics that depend on the data. However, there may be useful functions which are conceptually related but do not depend on the data. For instance, ``erf(x)`` is handy conversion routine that comes up in statistical work but does not directly depend on a particular dataset. It can be called either from an object or the class: ``s.erf(1.5) --> 0.9332`` or ``Sample.erf(1.5) --> 0.9332``.
sv: Ett statistikpaket kan t.ex. innehålla en containerklass för experimentella data. Klassen innehåller normala metoder för att beräkna genomsnitt, medelvärde, median och annan beskrivande statistik som är beroende av data. Det kan dock finnas användbara funktioner som är begreppsmässigt relaterade men som inte är beroende av data. Till exempel är ``erf(x)`` en praktisk konverteringsrutin som förekommer i statistiskt arbete men som inte är direkt beroende av en viss dataset. Den kan anropas antingen från ett objekt eller en klass: ``s.erf(1,5) --> 0,9332`` eller ``Sample.erf(1,5) --> 0,9332``.

source: Since static methods return the underlying function with no changes, the example calls are unexciting:
sv: Eftersom statiska metoder returnerar den underliggande funktionen utan några ändringar är exempelanropen inte särskilt spännande:

source: Using the non-data descriptor protocol, a pure Python version of :func:`staticmethod` would look like this:
sv: Med hjälp av icke-data descriptor-protokollet skulle en ren Python-version av :func:`staticmethod` se ut så här:

source: The :func:`functools.update_wrapper` call adds a ``__wrapped__`` attribute that refers to the underlying function. Also it carries forward the attributes necessary to make the wrapper look like the wrapped function, including :attr:`~function.__name__`, :attr:`~function.__qualname__`, and :attr:`~function.__doc__`.
sv: Anropet :func:`functools.update_wrapper` lägger till ett ``__wrapped__``-attribut som refererar till den underliggande funktionen. Det överför också de attribut som är nödvändiga för att få omslaget att se ut som den omslutna funktionen, inklusive :attr:`~function.__name__`, :attr:`~function.__qualname__` och :attr:`~function.__doc__`.

source: Class methods
sv: Klassmetoder

source: Unlike static methods, class methods prepend the class reference to the argument list before calling the function. This format is the same for whether the caller is an object or a class:
sv: Till skillnad från statiska metoder lägger klassmetoder till klassreferensen i argumentlistan innan funktionen anropas. Detta format är detsamma oavsett om den som anropar är ett objekt eller en klass:

source: This behavior is useful whenever the method only needs to have a class reference and does not rely on data stored in a specific instance. One use for class methods is to create alternate class constructors. For example, the classmethod :func:`dict.fromkeys` creates a new dictionary from a list of keys. The pure Python equivalent is:
sv: Detta beteende är användbart när metoden bara behöver ha en klassreferens och inte förlitar sig på data som lagras i en specifik instans. Ett sätt att använda klassmetoder är att skapa alternativa klasskonstruktörer. Till exempel skapar klassmetoden :func:`dict.fromkeys` en ny ordbok från en lista med nycklar. Den rena Python-ekvivalenten är:

source: Now a new dictionary of unique keys can be constructed like this:
sv: Nu kan en ny ordbok med unika nycklar konstrueras så här:

source: Using the non-data descriptor protocol, a pure Python version of :func:`classmethod` would look like this:
sv: Med hjälp av icke-data descriptor-protokollet skulle en ren Python-version av :func:`classmethod` se ut så här:

source: The :func:`functools.update_wrapper` call in ``ClassMethod`` adds a ``__wrapped__`` attribute that refers to the underlying function. Also it carries forward the attributes necessary to make the wrapper look like the wrapped function: :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__`, and :attr:`~function.__annotations__`.
sv: Anropet :func:`functools.update_wrapper` i ``ClassMethod`` lägger till ett ``__wrapped__``-attribut som refererar till den underliggande funktionen. Det för också vidare de attribut som är nödvändiga för att få omslaget att se ut som den omslutna funktionen: :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__`, och :attr:`~function.__annotations__`.

source: Member objects and __slots__
sv: Medlemsobjekt och __slots__

source: When a class defines ``__slots__``, it replaces instance dictionaries with a fixed-length array of slot values. From a user point of view that has several effects:
sv: När en klass definierar ``__slots__`` ersätter den instansordböcker med en array av slot-värden med fast längd. Ur användarens synvinkel har detta flera effekter:

source: 1. Provides immediate detection of bugs due to misspelled attribute assignments. Only attribute names specified in ``__slots__`` are allowed:
sv: 1. Ger omedelbar upptäckt av buggar som beror på felstavade attributtilldelningar. Endast attributnamn som anges i ``__slots__`` är tillåtna:

source: 2. Helps create immutable objects where descriptors manage access to private attributes stored in ``__slots__``:
sv: 2. Hjälper till att skapa oföränderliga objekt där deskriptorer hanterar åtkomst till privata attribut som lagras i ``__slots__``:

source: class Immutable: __slots__ = ('_dept', '_name') # Replace the instance dictionary def __init__(self, dept, name): self._dept = dept # Store to private attribute self._name = name # Store to private attribute @property # Read-only descriptor def dept(self): return self._dept @property def name(self): # Read-only descriptor return self._name
sv: klass Oföränderlig: __slots__ = ('_dept', '_name') # Byt ut instansordboken def __init__(self, dept, name): self._dept = dept # Lagra till privat attribut self._name = name # Lagra till privat attribut @property # skrivskyddad beskrivare def dept(self): return self._dept @egenskap def namn(self): # skrivskyddad deskriptor returnerar self._name

source: 3. Saves memory. On a 64-bit Linux build, an instance with two attributes takes 48 bytes with ``__slots__`` and 152 bytes without. This `flyweight design pattern <https://en.wikipedia.org/wiki/Flyweight_pattern>`_ likely only matters when a large number of instances are going to be created.
sv: 3. Sparar minne. På en 64-bitars Linux-version tar en instans med två attribut 48 byte med ``__slots__`` och 152 byte utan. Detta `flygviktsdesignmönster <https://en.wikipedia.org/wiki/Flyweight_pattern>`_ spelar troligen bara roll när ett stort antal instanser ska skapas.

source: 4. Improves speed. Reading instance variables is 35% faster with ``__slots__`` (as measured with Python 3.10 on an Apple M1 processor).
sv: 4. Förbättrar hastigheten. Läsning av instansvariabler är 35% faster med ``__slots__`` (enligt mätning med Python 3.10 på en Apple M1-processor).

source: 5. Blocks tools like :func:`functools.cached_property` which require an instance dictionary to function correctly:
sv: 5. Blockerar verktyg som :func:`functools.cached_property` som kräver en instansordbok för att fungera korrekt:
