Repository: yeager/python-docs-sv
Catalog: howto/descriptor.po
Languages: sv

source: Descriptor Guide
sv: Guide för deskriptorer

source: Author
sv: Författare

source: Contact
sv: Kontakt

source: Contents
sv: Innehåll

source: :term:`Descriptors <descriptor>` let objects customize attribute lookup, storage, and deletion.
sv: :term:`Deskriptorer <descriptor>` låter objekt anpassa sökning, lagring och borttagning av attribut.

source: This guide has four major sections:
sv: Denna guide består av fyra huvudavsnitt:

source: The "primer" gives a basic overview, moving gently from simple examples, adding one feature at a time. Start here if you're new to descriptors.
sv: "Primer" ger en grundläggande översikt och går försiktigt vidare från enkla exempel och lägger till en funktion i taget. Börja här om du är nybörjare på deskriptorer.

source: The second section shows a complete, practical descriptor example. If you already know the basics, start there.
sv: I det andra avsnittet visas ett komplett, praktiskt exempel på en descriptor. Om du redan kan grunderna kan du börja där.

source: The third section provides a more technical tutorial that goes into the detailed mechanics of how descriptors work. Most people don't need this level of detail.
sv: I det tredje avsnittet finns en mer teknisk handledning som går in i detalj på hur deskriptorer fungerar. De flesta människor behöver inte denna detaljnivå.

source: The last section has pure Python equivalents for built-in descriptors that are written in C. Read this if you're curious about how functions turn into bound methods or about the implementation of common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :term:`__slots__`.
sv: Det sista avsnittet har rena Python-ekvivalenter för inbyggda deskriptorer som är skrivna i C. Läs detta om du är nyfiken på hur funktioner blir till bundna metoder eller om implementeringen av vanliga verktyg som :func:`classmethod`, :func:`staticmethod`, :func:`property` och :term:`__slots__`.

source: Primer
sv: Tändhatt

source: In this primer, we start with the most basic possible example and then we'll add new capabilities one by one.
sv: I den här guiden börjar vi med ett så grundläggande exempel som möjligt och sedan lägger vi till nya funktioner en efter en.

source: Simple example: A descriptor that returns a constant
sv: Enkelt exempel: En deskriptor som returnerar en konstant

source: The :class:`!Ten` class is a descriptor whose :meth:`~object.__get__` method always returns the constant ``10``:
sv: Klassen :class:`!Ten` är en deskriptor vars :meth:`~object.__get__`-metod alltid returnerar konstanten ``10``:

source: To use the descriptor, it must be stored as a class variable in another class:
sv: För att kunna använda deskriptorn måste den lagras som en klassvariabel i en annan klass:

source: An interactive session shows the difference between normal attribute lookup and descriptor lookup:
sv: En interaktiv session visar skillnaden mellan normal attributuppslagning och deskriptoruppslagning:

source: In the ``a.x`` attribute lookup, the dot operator finds ``'x': 5`` in the class dictionary. In the ``a.y`` lookup, the dot operator finds a descriptor instance, recognized by its ``__get__`` method. Calling that method returns ``10``.
sv: I attributuppslagningen ``a.x`` hittar punktoperatorn ``'x': 5`` i klassordlistan. I ``a.y``-uppslagningen hittar dot-operatorn en descriptor-instans, som känns igen på dess metod ``__get__``. Anrop av den metoden returnerar ``10``.

source: Note that the value ``10`` is not stored in either the class dictionary or the instance dictionary. Instead, the value ``10`` is computed on demand.
sv: Observera att värdet ``10`` inte lagras i vare sig klassordlistan eller instansordlistan. Istället beräknas värdet ``10`` på begäran.

source: This example shows how a simple descriptor works, but it isn't very useful. For retrieving constants, normal attribute lookup would be better.
sv: Detta exempel visar hur en enkel descriptor fungerar, men det är inte särskilt användbart. För att hämta konstanter skulle normal attributuppslagning vara bättre.

source: In the next section, we'll create something more useful, a dynamic lookup.
sv: I nästa avsnitt ska vi skapa något mer användbart, en dynamisk uppslagning.

source: Dynamic lookups
sv: Dynamiska uppslagningar

source: Interesting descriptors typically run computations instead of returning constants:
sv: Intressanta deskriptorer kör vanligtvis beräkningar istället för att returnera konstanter:

source: An interactive session shows that the lookup is dynamic — it computes different, updated answers each time::
sv: En interaktiv session visar att uppslagningen är dynamisk - den beräknar olika, uppdaterade svar varje gång::

source: Besides showing how descriptors can run computations, this example also reveals the purpose of the parameters to :meth:`~object.__get__`. The *self* parameter is *size*, an instance of *DirectorySize*. The *obj* parameter is either *g* or *s*, an instance of *Directory*. It is the *obj* parameter that lets the :meth:`~object.__get__` method learn the target directory. The *objtype* parameter is the class *Directory*.
sv: Förutom att visa hur deskriptorer kan utföra beräkningar, avslöjar detta exempel också syftet med parametrarna i :meth:`~object.__get__`. Parametern *self* är *size*, en instans av *DirectorySize*. Parametern *obj* är antingen *g* eller *s*, en instans av *Directory*. Det är parametern *obj* som gör att metoden :meth:`~object.__get__` kan lära sig målkatalogen. Parametern *objtype* är klassen *Directory*.

source: Managed attributes
sv: Hanterade attribut

source: A popular use for descriptors is managing access to instance data. The descriptor is assigned to a public attribute in the class dictionary while the actual data is stored as a private attribute in the instance dictionary. The descriptor's :meth:`~object.__get__` and :meth:`~object.__set__` methods are triggered when the public attribute is accessed.
sv: Ett populärt användningsområde för deskriptorer är att hantera åtkomst till instansdata. Deskriptorn tilldelas ett offentligt attribut i klassordlistan medan de faktiska uppgifterna lagras som ett privat attribut i instansordlistan. Deskriptorns metoder :meth:`~object.__get__` och :meth:`~object.__set__` utlöses när det publika attributet används.

source: In the following example, *age* is the public attribute and *_age* is the private attribute. When the public attribute is accessed, the descriptor logs the lookup or update:
sv: I följande exempel är *age* det publika attributet och *_age* det privata attributet. När det publika attributet används loggar deskriptorn sökningen eller uppdateringen:

source: An interactive session shows that all access to the managed attribute *age* is logged, but that the regular attribute *name* is not logged:
sv: En interaktiv session visar att all åtkomst till det hanterade attributet *age* loggas, men att det vanliga attributet *name* inte loggas:

source: One major issue with this example is that the private name *_age* is hardwired in the *LoggedAgeAccess* class. That means that each instance can only have one logged attribute and that its name is unchangeable. In the next example, we'll fix that problem.
sv: Ett stort problem med detta exempel är att det privata namnet *_age* är fastkopplat i klassen *LoggedAgeAccess*. Det innebär att varje instans bara kan ha ett loggat attribut och att dess namn är oföränderligt. I nästa exempel ska vi åtgärda det problemet.

source: Customized names
sv: Anpassade namn

source: When a class uses descriptors, it can inform each descriptor about which variable name was used.
sv: När en klass använder descriptors kan den informera varje descriptor om vilket variabelnamn som användes.

source: In this example, the :class:`!Person` class has two descriptor instances, *name* and *age*. When the :class:`!Person` class is defined, it makes a callback to :meth:`~object.__set_name__` in *LoggedAccess* so that the field names can be recorded, giving each descriptor its own *public_name* and *private_name*:
sv: I det här exemplet har klassen :class:`!Person` två deskriptorinstanser, *name* och *age*. När klassen :class:`!Person` definieras gör den ett anrop till :meth:`~object.__set_name__` i *LoggedAccess* så att fältnamnen kan registreras och varje deskriptor får sina egna *public_name* och *private_name*:

source: An interactive session shows that the :class:`!Person` class has called :meth:`~object.__set_name__` so that the field names would be recorded. Here we call :func:`vars` to look up the descriptor without triggering it:
sv: En interaktiv session visar att klassen :class:`!Person` har anropat :meth:`~object.__set_name__` så att fältnamnen skulle registreras. Här anropar vi :func:`vars` för att leta upp deskriptorn utan att trigga den:

source: The new class now logs access to both *name* and *age*:
sv: Den nya klassen loggar nu åtkomst till både *namn* och *ålder*:

source: The two *Person* instances contain only the private names:
sv: De två *Person*-instanserna innehåller endast de privata namnen:

source: Closing thoughts
sv: Avslutande tankar

source: A :term:`descriptor` is what we call any object that defines :meth:`~object.__get__`, :meth:`~object.__set__`, or :meth:`~object.__delete__`.
sv: En :term:`descriptor` är vad vi kallar alla objekt som definierar :meth:`~object.__get__`, :meth:`~object.__set__` eller :meth:`~object.__delete__`.

source: Optionally, descriptors can have a :meth:`~object.__set_name__` method. This is only used in cases where a descriptor needs to know either the class where it was created or the name of class variable it was assigned to. (This method, if present, is called even if the class is not a descriptor.)
sv: Eventuellt kan deskriptorer ha en :meth:`~object.__set_name__`-metod. Denna används endast i de fall då en descriptor behöver veta antingen vilken klass den skapades i eller namnet på den klassvariabel som den tilldelades. (Denna metod, om den finns, anropas även om klassen inte är en descriptor)

source: Descriptors get invoked by the dot operator during attribute lookup. If a descriptor is accessed indirectly with ``vars(some_class)[descriptor_name]``, the descriptor instance is returned without invoking it.
sv: Deskriptorer anropas av dot-operatorn under attributuppslagning. Om en descriptor nås indirekt med ``vars(some_class)[descriptor_name]`` returneras descriptor-instansen utan att den anropas.

source: Descriptors only work when used as class variables. When put in instances, they have no effect.
sv: Descriptors fungerar bara när de används som klassvariabler. När de läggs in i instanser har de ingen effekt.

source: The main motivation for descriptors is to provide a hook allowing objects stored in class variables to control what happens during attribute lookup.
sv: Huvudmotivet för deskriptorer är att tillhandahålla en krok som gör det möjligt för objekt som lagras i klassvariabler att styra vad som händer under attributuppslagningen.

source: Traditionally, the calling class controls what happens during lookup. Descriptors invert that relationship and allow the data being looked-up to have a say in the matter.
sv: Traditionellt sett kontrollerar den anropande klassen vad som händer under uppslagningen. Deskriptorer vänder på det förhållandet och låter de data som söks upp ha ett ord med i laget.

source: Descriptors are used throughout the language. It is how functions turn into bound methods. Common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :func:`functools.cached_property` are all implemented as descriptors.
sv: Deskriptorer används i hela språket. Det är så funktioner förvandlas till bundna metoder. Vanliga verktyg som :func:`classmethod`, :func:`staticmethod`, :func:`property` och :func:`functools.cached_property` är alla implementerade som deskriptorer.

source: Complete Practical Example
sv: Komplett praktiskt exempel

source: In this example, we create a practical and powerful tool for locating notoriously hard to find data corruption bugs.
sv: I det här exemplet skapar vi ett praktiskt och kraftfullt verktyg för att lokalisera fel som är svåra att hitta när det gäller datakorruption.

source: Validator class
sv: Klass för validerare

source: A validator is a descriptor for managed attribute access. Prior to storing any data, it verifies that the new value meets various type and range restrictions. If those restrictions aren't met, it raises an exception to prevent data corruption at its source.
sv: En validator är en deskriptor för hanterad attributåtkomst. Innan data lagras verifieras att det nya värdet uppfyller olika typ- och intervallrestriktioner. Om dessa begränsningar inte uppfylls, skapar den ett undantag för att förhindra att data korrumperas vid källan.

source: This :class:`!Validator` class is both an :term:`abstract base class` and a managed attribute descriptor:
sv: Denna :class:`!Validator`-klass är både en :term:`abstrakt basklass` och en hanterad attributbeskrivare:

source: from abc import ABC, abstractmethod class Validator(ABC): def __set_name__(self, owner, name): self.private_name = '_' + name def __get__(self, obj, objtype=None): return getattr(obj, self.private_name) def __set__(self, obj, value): self.validate(value) setattr(obj, self.private_name, value) @abstractmethod def validate(self, value): pass
sv: från abc import ABC, abstractmethod klass Validator(ABC): def __set_name__(self, ägare, namn): self.private_name = '_' + namn def __get__(self, obj, objtype=None): return getattr(obj, self.private_name) def __set__(self, obj, värde): self.validate(värde) setattr(obj, self.private_name, värde) @abstraktmetod def validate(self, värde): passera

source: Custom validators need to inherit from :class:`!Validator` and must supply a :meth:`!validate` method to test various restrictions as needed.
sv: Egna validerare måste ärva från :class:`!Validator` och måste tillhandahålla en :meth:`!validate`-metod för att testa olika begränsningar efter behov.

source: Custom validators
sv: Anpassade validerare

source: Here are three practical data validation utilities:
sv: Här är tre praktiska verktyg för validering av data:

source: :class:`!OneOf` verifies that a value is one of a restricted set of options.
sv: :class:`!OneOf` verifierar att ett värde är ett av en begränsad uppsättning alternativ.

source: :class:`!Number` verifies that a value is either an :class:`int` or :class:`float`. Optionally, it verifies that a value is between a given minimum or maximum.
sv: :class:`!Number` verifierar att ett värde är antingen en :class:`int` eller en :class:`float`. Eventuellt verifierar den att ett värde ligger mellan ett givet minimum eller maximum.

source: :class:`!String` verifies that a value is a :class:`str`. Optionally, it validates a given minimum or maximum length. It can validate a user-defined `predicate <https://en.wikipedia.org/wiki/Predicate_(mathematical_logic)>`_ as well.
sv: :class:`!String` verifierar att ett värde är en :class:`str`. Eventuellt validerar den en given minsta eller största längd. Den kan även validera ett användardefinierat `predikat <https://en.wikipedia.org/wiki/Predicate_(mathematical_logic)>`_.

source: Practical application
sv: Praktisk tillämpning

source: Here's how the data validators can be used in a real class:
sv: Så här kan datavaliderarna användas i en riktig klass:

source: The descriptors prevent invalid instances from being created:
sv: Deskriptorerna förhindrar att ogiltiga instanser skapas:

source: Technical Tutorial
sv: Teknisk handledning

source: What follows is a more technical tutorial for the mechanics and details of how descriptors work.
sv: Det som följer är en mer teknisk handledning för mekaniken och detaljerna i hur deskriptorer fungerar.

source: Abstract
sv: Abstrakt

source: Defines descriptors, summarizes the protocol, and shows how descriptors are called. Provides an example showing how object relational mappings work.
sv: Definierar deskriptorer, sammanfattar protokollet och visar hur deskriptorer anropas. Ger ett exempel som visar hur objektrelationsmappningar fungerar.

source: Learning about descriptors not only provides access to a larger toolset, it creates a deeper understanding of how Python works.
sv: Att lära sig om deskriptorer ger inte bara tillgång till en större uppsättning verktyg, det skapar också en djupare förståelse för hur Python fungerar.

source: Definition and introduction
sv: Definition och introduktion

source: In general, a descriptor is an attribute value that has one of the methods in the descriptor protocol. Those methods are :meth:`~object.__get__`, :meth:`~object.__set__`, and :meth:`~object.__delete__`. If any of those methods are defined for an attribute, it is said to be a :term:`descriptor`.
sv: I allmänhet är en deskriptor ett attributvärde som har en av metoderna i deskriptorprotokollet. Dessa metoder är :meth:`~object.__get__`, :meth:`~object.__set__` och :meth:`~object.__delete__`. Om någon av dessa metoder är definierade för ett attribut, sägs det vara en :term:`descriptor`.

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the method resolution order of ``type(a)``. If the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined.
sv: Standardbeteendet för attributåtkomst är att hämta, ställa in eller ta bort attributet från ett objekts ordbok. Till exempel har ``a.x`` en uppslagskedja som börjar med ``a.__dict__['x']``, sedan ``type(a).__dict__['x']``, och fortsätter genom metodupplösningsordningen för ``type(a)``. Om det sökta värdet är ett objekt som definierar en av deskriptormetoderna, kan Python åsidosätta standardbeteendet och anropa deskriptormetoden istället. Var detta sker i prioriteringskedjan beror på vilka deskriptormetoder som definierades.

source: Descriptors are a powerful, general purpose protocol. They are the mechanism behind properties, methods, static methods, class methods, and :func:`super`. They are used throughout Python itself. Descriptors simplify the underlying C code and offer a flexible set of new tools for everyday Python programs.
sv: Deskriptorer är ett kraftfullt protokoll för allmänna ändamål. De är mekanismen bakom egenskaper, metoder, statiska metoder, klassmetoder och :func:`super`. De används i hela Python självt. Descriptors förenklar den underliggande C-koden och erbjuder en flexibel uppsättning nya verktyg för vardagliga Python-program.

source: Descriptor protocol
sv: Protokoll för deskriptorer

source: That is all there is to it. Define any of these methods and an object is considered a descriptor and can override default behavior upon being looked up as an attribute.
sv: Det är allt det är. Definiera någon av dessa metoder och ett objekt betraktas som en deskriptor och kan åsidosätta standardbeteendet när det söks upp som ett attribut.

source: If an object defines :meth:`~object.__set__` or :meth:`~object.__delete__`, it is considered a data descriptor. Descriptors that only define :meth:`~object.__get__` are called non-data descriptors (they are often used for methods but other uses are possible).
sv: Om ett objekt definierar :meth:`~object.__set__` eller :meth:`~object.__delete__`, betraktas det som en datadeskriptor. Deskriptorer som bara definierar :meth:`~object.__get__` kallas icke-datadeskriptorer (de används ofta för metoder men andra användningsområden är möjliga).

source: Data and non-data descriptors differ in how overrides are calculated with respect to entries in an instance's dictionary. If an instance's dictionary has an entry with the same name as a data descriptor, the data descriptor takes precedence. If an instance's dictionary has an entry with the same name as a non-data descriptor, the dictionary entry takes precedence.
sv: Datadeskriptorer och icke-datadeskriptorer skiljer sig åt när det gäller hur åsidosättanden beräknas i förhållande till poster i en instans ordbok. Om en instans ordbok har en post med samma namn som en datadeskriptor, har datadeskriptorn företräde. Om en instans ordbok har en post med samma namn som en icke datadeskriptor, har ordboksposten företräde.

source: To make a read-only data descriptor, define both :meth:`~object.__get__` and :meth:`~object.__set__` with the :meth:`~object.__set__` raising an :exc:`AttributeError` when called. Defining the :meth:`~object.__set__` method with an exception raising placeholder is enough to make it a data descriptor.
sv: För att skapa en skrivskyddad databeskrivare definierar du både :meth:`~object.__get__` och :meth:`~object.__set__` med :meth:`~object.__set__` som ger upphov till ett :exc:`AttributeError` när den anropas. Att definiera metoden :meth:`~object.__set__` med en platshållare som ger upphov till ett undantag är tillräckligt för att göra den till en databeskrivare.

source: Overview of descriptor invocation
sv: Översikt över anrop av deskriptor

source: A descriptor can be called directly with ``desc.__get__(obj)`` or ``desc.__get__(None, cls)``.
sv: En deskriptor kan anropas direkt med ``desc.__get__(obj)`` eller ``desc.__get__(None, cls)``.

source: But it is more common for a descriptor to be invoked automatically from attribute access.
sv: Det är dock vanligare att en descriptor anropas automatiskt från attributåtkomst.

source: The expression ``obj.x`` looks up the attribute ``x`` in the chain of namespaces for ``obj``. If the search finds a descriptor outside of the instance :attr:`~object.__dict__`, its :meth:`~object.__get__` method is invoked according to the precedence rules listed below.
sv: Uttrycket ``obj.x`` letar upp attributet ``x`` i kedjan av namnrymder för ``obj``. Om sökningen hittar en deskriptor utanför instansen :attr:`~object.__dict__`, anropas dess metod :meth:`~object.__get__` enligt de prioritetsregler som anges nedan.

source: The details of invocation depend on whether ``obj`` is an object, class, or instance of super.
sv: Detaljerna i anropet beror på om ``obj`` är ett objekt, en klass eller en instans av super.

source: Invocation from an instance
sv: Anrop från en instans

source: Instance lookup scans through a chain of namespaces giving data descriptors the highest priority, followed by instance variables, then non-data descriptors, then class variables, and lastly :meth:`~object.__getattr__` if it is provided.
sv: Instance lookup skannar genom en kedja av namnrymder med högsta prioritet för datadeskriptorer, följt av instansvariabler, sedan icke-datadeskriptorer, sedan klassvariabler och slutligen :meth:`~object.__getattr__` om den tillhandahålls.

source: If a descriptor is found for ``a.x``, then it is invoked with: ``desc.__get__(a, type(a))``.
sv: Om en deskriptor hittas för ``a.x``, så anropas den med: ``desc.__get__(a, type(a))``.

source: The logic for a dotted lookup is in :meth:`object.__getattribute__`. Here is a pure Python equivalent:
sv: Logiken för en prickad uppslagning finns i :meth:`object.__getattribute__`. Här är en ren Python-motsvarighet:
