Repository: yeager/python-docs-sv
Catalog: howto/functional.po
Languages: sv

source: :func:`~itertools.groupby` assumes that the underlying iterable's contents will already be sorted based on the key. Note that the returned iterators also use the underlying iterable, so you have to consume the results of iterator-1 before requesting iterator-2 and its corresponding key.
sv: :func:`~itertools.groupby` förutsätter att innehållet i den underliggande iterabeln redan är sorterat baserat på nyckeln. Observera att de returnerade iteratorerna också använder den underliggande iterabeln, så du måste konsumera resultaten av iterator-1 innan du begär iterator-2 och dess motsvarande nyckel.

source: The functools module
sv: Modulen functools

source: The :mod:`functools` module contains some higher-order functions. A **higher-order function** takes one or more functions as input and returns a new function. The most useful tool in this module is the :func:`functools.partial` function.
sv: Modulen :mod:`functools` innehåller några funktioner av högre ordning. En **högre ordningens funktion** tar en eller flera funktioner som indata och returnerar en ny funktion. Det mest användbara verktyget i denna modul är funktionen :func:`functools.partial`.

source: For programs written in a functional style, you'll sometimes want to construct variants of existing functions that have some of the parameters filled in. Consider a Python function ``f(a, b, c)``; you may wish to create a new function ``g(b, c)`` that's equivalent to ``f(1, b, c)``; you're filling in a value for one of ``f()``'s parameters. This is called "partial function application".
sv: För program som är skrivna i en funktionell stil vill du ibland konstruera varianter av befintliga funktioner som har några av parametrarna ifyllda. Tänk på en Python-funktion ``f(a, b, c)``; du kanske vill skapa en ny funktion ``g(b, c)`` som är likvärdig med ``f(1, b, c)``; du fyller i ett värde för en av ``f()``:s parametrar. Detta kallas "partiell funktionstillämpning".

source: The constructor for :func:`~functools.partial` takes the arguments ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. The resulting object is callable, so you can just call it to invoke ``function`` with the filled-in arguments.
sv: Konstruktorn för :func:`~functools.partial` tar argumenten ``(function, arg1, arg2, ..., kwarg1=värde1, kwarg2=värde2)``. Det resulterande objektet är anropsbart, så du kan bara anropa det för att anropa ``function`` med de ifyllda argumenten.

source: Here's a small but realistic example::
sv: Här är ett litet men realistiskt exempel::

source: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` cumulatively performs an operation on all the iterable's elements and, therefore, can't be applied to infinite iterables. *func* must be a function that takes two elements and returns a single value. :func:`functools.reduce` takes the first two elements A and B returned by the iterator and calculates ``func(A, B)``. It then requests the third element, C, calculates ``func(func(A, B), C)``, combines this result with the fourth element returned, and continues until the iterable is exhausted. If the iterable returns no values at all, a :exc:`TypeError` exception is raised. If the initial value is supplied, it's used as a starting point and ``func(initial_value, A)`` is the first calculation. ::
sv: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` utför en kumulativ operation på alla iterationens element och kan därför inte tillämpas på oändliga iterationer. *func* måste vara en funktion som tar två element och returnerar ett enda värde. :func:`functools.reduce` tar de två första elementen A och B som returneras av iteratorn och beräknar ``func(A, B)``. Den begär sedan det tredje elementet, C, beräknar ``func(func(A, B), C)``, kombinerar detta resultat med det fjärde elementet som returneras och fortsätter tills iteratorn är uttömd. Om iterabeln inte returnerar några värden alls, uppstår ett :exc:`TypeError` undantag. Om det initiala värdet anges används det som utgångspunkt och ``func(initial_value, A)`` är den första beräkningen. ::

source: >>> import operator, functools >>> functools.reduce(operator.concat, ['A', 'BB', 'C']) 'ABBC' >>> functools.reduce(operator.concat, []) Traceback (most recent call last): ... TypeError: reduce() of empty sequence with no initial value >>> functools.reduce(operator.mul, [1, 2, 3], 1) 6 >>> functools.reduce(operator.mul, [], 1) 1
sv: >>> import operator, functools >>> functools.reduce(operator.concat, ['A', 'BB', 'C']) 'ABBC' >>> functools.reduce(operator.concat, []) Traceback (senaste anropet senast): ... TypeError: reduce() av tom sekvens utan något initialt värde >>> functools.reduce(operator.mul, [1, 2, 3], 1) 6 >>> functools.reduce(operator.mul, [], 1) 1

source: If you use :func:`operator.add` with :func:`functools.reduce`, you'll add up all the elements of the iterable. This case is so common that there's a special built-in called :func:`sum` to compute it:
sv: Om du använder :func:`operator.add` med :func:`functools.reduce` kommer du att lägga ihop alla element i iterabeln. Det här fallet är så vanligt att det finns en speciell inbyggd funktion som heter :func:`sum` för att beräkna det:

source: For many uses of :func:`functools.reduce`, though, it can be clearer to just write the obvious :keyword:`for` loop::
sv: För många användningar av :func:`functools.reduce` kan det dock vara tydligare att bara skriva den uppenbara :keyword:`for` -loopen::

source: A related function is :func:`itertools.accumulate(iterable, func=operator.add) <itertools.accumulate>`. It performs the same calculation, but instead of returning only the final result, :func:`~itertools.accumulate` returns an iterator that also yields each partial result::
sv: En relaterad funktion är :func:`itertools.accumulate(iterable, func=operator.add) <itertools.accumulate>`. Den utför samma beräkning, men istället för att bara returnera det slutliga resultatet returnerar :func:`~itertools.accumulate` en iterator som också ger varje delresultat::

source: itertools.accumulate([1, 2, 3, 4, 5]) => 1, 3, 6, 10, 15 itertools.accumulate([1, 2, 3, 4, 5], operator.mul) => 1, 2, 6, 24, 120
sv: itertools.accumulate([1, 2, 3, 4, 5]) => 1, 3, 6, 10, 15 itertools.ackumulera([1, 2, 3, 4, 5], operator.mul) => 1, 2, 6, 24, 120

source: The operator module
sv: Operatormodulen

source: The :mod:`operator` module was mentioned earlier. It contains a set of functions corresponding to Python's operators. These functions are often useful in functional-style code because they save you from writing trivial functions that perform a single operation.
sv: Modulen :mod:`operator` nämndes tidigare. Den innehåller en uppsättning funktioner som motsvarar Pythons operatorer. Dessa funktioner är ofta användbara i funktionell kod eftersom de gör att man slipper skriva triviala funktioner som utför en enda operation.

source: Some of the functions in this module are:
sv: Några av funktionerna i denna modul är:

source: Math operations: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...
sv: Matematiska operationer: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...

source: Logical operations: ``not_()``, ``truth()``.
sv: Logiska operationer: ``not_()``, ``truth()``.

source: Bitwise operations: ``and_()``, ``or_()``, ``invert()``.
sv: Bitvisa operationer: ``och_()``, ``eller_()``, ``invert()``.

source: Comparisons: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()``, and ``ge()``.
sv: Jämförelser: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()`` och ``ge()``.

source: Object identity: ``is_()``, ``is_not()``.
sv: Objektets identitet: ``is_()``, ``is_not()``.

source: Consult the operator module's documentation for a complete list.
sv: Se operatormodulens dokumentation för en fullständig lista.

source: Small functions and the lambda expression
sv: Små funktioner och lambda-uttrycket

source: When writing functional-style programs, you'll often need little functions that act as predicates or that combine elements in some way.
sv: När du skriver program i funktionell stil behöver du ofta små funktioner som fungerar som predikat eller som kombinerar element på något sätt.

source: If there's a Python built-in or a module function that's suitable, you don't need to define a new function at all::
sv: Om det finns en inbyggd Python-funktion eller en modulfunktion som är lämplig behöver du inte definiera en ny funktion alls::

source: stripped_lines = [line.strip() for line in lines] existing_files = filter(os.path.exists, file_list)
sv: stripped_lines = [line.strip() för line i lines] befintliga_filer = filter(os.path.exists, fil_lista)

source: If the function you need doesn't exist, you need to write it. One way to write small functions is to use the :keyword:`lambda` expression. ``lambda`` takes a number of parameters and an expression combining these parameters, and creates an anonymous function that returns the value of the expression::
sv: Om den funktion du behöver inte finns, måste du skriva den. Ett sätt att skriva små funktioner är att använda uttrycket :keyword:`lambda`. ``lambda`` tar ett antal parametrar och ett uttryck som kombinerar dessa parametrar, och skapar en anonym funktion som returnerar värdet av uttrycket::

source: adder = lambda x, y: x+y print_assign = lambda name, value: name + '=' + str(value)
sv: adderare = lambda x, y: x+y print_assign = lambda namn, värde: namn + '=' + str(värde)

source: An alternative is to just use the ``def`` statement and define a function in the usual way::
sv: Ett alternativ är att bara använda ``def``-satsen och definiera en funktion på vanligt sätt::

source: def adder(x, y): return x + y def print_assign(name, value): return name + '=' + str(value)
sv: def adder(x, y): returnerar x + y def print_assign(namn, värde): return namn + '=' + str(värde)

source: Which alternative is preferable? That's a style question; my usual course is to avoid using ``lambda``.
sv: Vilket alternativ är att föredra? Det är en stilfråga; min vanliga kurs är att undvika att använda ``lambda``.

source: One reason for my preference is that ``lambda`` is quite limited in the functions it can define. The result has to be computable as a single expression, which means you can't have multiway ``if... elif... else`` comparisons or ``try... except`` statements. If you try to do too much in a ``lambda`` statement, you'll end up with an overly complicated expression that's hard to read. Quick, what's the following code doing? ::
sv: Ett skäl till att jag föredrar ``lambda`` är att det är ganska begränsat vilka funktioner som kan definieras. Resultatet måste vara beräkningsbart som ett enda uttryck, vilket innebär att du inte kan ha flervägs ``if... elif... else``-jämförelser eller ``try... except``-satser. Om du försöker göra för mycket i ett ``lambda``-uttalande kommer du att få ett alltför komplicerat uttryck som är svårt att läsa. Snabbt, vad gör följande kod? ::

source: You can figure it out, but it takes time to disentangle the expression to figure out what's going on. Using a short nested ``def`` statements makes things a little bit better::
sv: Du kan räkna ut det, men det tar tid att reda ut uttrycket för att ta reda på vad som händer. Att använda en kort nästlad ``def``-sats gör saker lite bättre::

source: But it would be best of all if I had simply used a ``for`` loop::
sv: Men det bästa av allt hade varit om jag helt enkelt hade använt en ``for``-loop::

source: total = 0 for a, b in items: total += b
sv: totalt = 0 för a, b i artiklar: total += b

source: Or the :func:`sum` built-in and a generator expression::
sv: Eller den inbyggda :func:`sum` och ett generatoruttryck::

source: Many uses of :func:`functools.reduce` are clearer when written as ``for`` loops.
sv: Många användningar av :func:`functools.reduce` är tydligare när de skrivs som ``for``-loopar.

source: Fredrik Lundh once suggested the following set of rules for refactoring uses of ``lambda``:
sv: Fredrik Lundh föreslog en gång följande uppsättning regler för refaktorisering av användningar av ``lambda``:

source: Write a lambda function.
sv: Skriv en lambda-funktion.

source: Write a comment explaining what the heck that lambda does.
sv: Skriv en kommentar som förklarar vad sjutton den där lambdan gör.

source: Study the comment for a while, and think of a name that captures the essence of the comment.
sv: Studera kommentaren en stund och fundera ut ett namn som fångar essensen i kommentaren.

source: Convert the lambda to a def statement, using that name.
sv: Konvertera lambdan till en def-sats med det namnet.

source: Remove the comment.
sv: Ta bort kommentaren.

source: I really like these rules, but you're free to disagree about whether this lambda-free style is better.
sv: Jag gillar verkligen de här reglerna, men det är fritt fram att inte hålla med om huruvida den här lambda-fria stilen är bättre.

source: Revision History and Acknowledgements
sv: Revideringshistorik och erkännanden

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.
sv: Författaren vill tacka följande personer för förslag, korrigeringar och hjälp med olika utkast av denna artikel: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.

source: Version 0.1: posted June 30 2006.
sv: Version 0.1: publicerad den 30 juni 2006.

source: Version 0.11: posted July 1 2006. Typo fixes.
sv: Version 0.11: publicerad den 1 juli 2006. Rättelser av stavfel.

source: Version 0.2: posted July 10 2006. Merged genexp and listcomp sections into one. Typo fixes.
sv: Version 0.2: publicerad 10 juli 2006. Sammanslagna genexp- och listcomp-avsnitt till ett. Korrigeringar av stavfel.

source: Version 0.21: Added more references suggested on the tutor mailing list.
sv: Version 0.21: Lagt till fler referenser som föreslagits på tutor-mailinglistan.

source: Version 0.30: Adds a section on the ``functional`` module written by Collin Winter; adds short section on the operator module; a few other edits.
sv: Version 0.30: Lägger till ett avsnitt om den ``funktionella`` modulen skriven av Collin Winter; lägger till ett kort avsnitt om operatormodulen; några andra redigeringar.

source: References
sv: Referenser

source: General
sv: Allmänt

source: **Structure and Interpretation of Computer Programs**, by Harold Abelson and Gerald Jay Sussman with Julie Sussman. The book can be found at https://mitpress.mit.edu/sicp. In this classic textbook of computer science, chapters 2 and 3 discuss the use of sequences and streams to organize the data flow inside a program. The book uses Scheme for its examples, but many of the design approaches described in these chapters are applicable to functional-style Python code.
sv: **Structure and Interpretation of Computer Programs**, av Harold Abelson och Gerald Jay Sussman med Julie Sussman. Boken finns tillgänglig på https://mitpress.mit.edu/sicp. I denna klassiska lärobok i datavetenskap diskuteras i kapitlen 2 och 3 användningen av sekvenser och strömmar för att organisera dataflödet i ett program. Boken använder Scheme för sina exempel, men många av de designmetoder som beskrivs i dessa kapitel är tillämpliga på Python-kod i funktionell stil.

source: https://defmacro.org/2006/06/19/fp.html: A general introduction to functional programming that uses Java examples and has a lengthy historical introduction.
sv: https://defmacro.org/2006/06/19/fp.html: En allmän introduktion till funktionell programmering som använder Java-exempel och har en lång historisk introduktion.

source: https://en.wikipedia.org/wiki/Functional_programming: General Wikipedia entry describing functional programming.
sv: https://en.wikipedia.org/wiki/Functional_programming: Allmän Wikipedia-post som beskriver funktionell programmering.

source: https://en.wikipedia.org/wiki/Coroutine: Entry for coroutines.
sv: https://en.wikipedia.org/wiki/Coroutine: Inlägg för coroutines.

source: https://en.wikipedia.org/wiki/Partial_application: Entry for the concept of partial function application.
sv: https://en.wikipedia.org/wiki/Partial_application: Inlägg för begreppet partiell funktionstillämpning.

source: https://en.wikipedia.org/wiki/Currying: Entry for the concept of currying.
sv: https://en.wikipedia.org/wiki/Currying: Inlägg för begreppet currying.

source: Python-specific
sv: Python-specifik

source: https://gnosis.cx/TPiP/: The first chapter of David Mertz's book :title-reference:`Text Processing in Python` discusses functional programming for text processing, in the section titled "Utilizing Higher-Order Functions in Text Processing".
sv: https://gnosis.cx/TPiP/: I det första kapitlet i David Mertz bok :title-reference:`Text Processing in Python` diskuteras funktionell programmering för textbearbetning, i avsnittet "Utilizing Higher-Order Functions in Text Processing".

source: Mertz also wrote a 3-part series of articles on functional programming for IBM's DeveloperWorks site; see `part 1 <https://developer.ibm.com/articles/l-prog/>`__, `part 2 <https://developer.ibm.com/tutorials/l-prog2/>`__, and `part 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,
sv: Mertz har också skrivit en artikelserie i tre delar om funktionell programmering för IBM:s DeveloperWorks-webbplats; se "del 1" <https://developer.ibm.com/articles/l-prog/>`__, "del 2" <https://developer.ibm.com/tutorials/l-prog2/>`__ och "del 3" <https://developer.ibm.com/tutorials/l-prog3/>`__,

source: Python documentation
sv: Python-dokumentation

source: Documentation for the :mod:`itertools` module.
sv: Dokumentation för modulen :mod:`itertools`.

source: Documentation for the :mod:`functools` module.
sv: Dokumentation för modulen :mod:`functools`.

source: Documentation for the :mod:`operator` module.
sv: Dokumentation för modulen :mod:`operator`.

source: :pep:`289`: "Generator Expressions"
sv: :pep:`289`: "Generatoruttryck"

source: :pep:`342`: "Coroutines via Enhanced Generators" describes the new generator features in Python 2.5.
sv: :pep:`342`: "Coroutines via Enhanced Generators" beskriver de nya generatorfunktionerna i Python 2.5.
