Repository: yeager/python-docs-sv
Catalog: howto/functional.po
Languages: sv

source: Generators also become **coroutines**, a more generalized form of subroutines. Subroutines are entered at one point and exited at another point (the top of the function, and a ``return`` statement), but coroutines can be entered, exited, and resumed at many different points (the ``yield`` statements).
sv: Generatorer blir också **koroutiner**, en mer generaliserad form av subrutiner. Subrutiner startas vid en punkt och avslutas vid en annan punkt (toppen av funktionen och ett `return`-svar), medan coroutines kan startas, avslutas och återupptas vid många olika punkter (`yield`-svar).

source: Built-in functions
sv: Inbyggda funktioner

source: Let's look in more detail at built-in functions often used with iterators.
sv: Låt oss titta närmare på inbyggda funktioner som ofta används med iteratorer.

source: Two of Python's built-in functions, :func:`map` and :func:`filter` duplicate the features of generator expressions:
sv: Två av Pythons inbyggda funktioner, :func:`map` och :func:`filter`, duplicerar funktionerna i generatoruttryck:

source: :func:`map(f, iterA, iterB, ...) <map>` returns an iterator over the sequence
sv: :func:`map(f, iterA, iterB, ...) <map>` returnerar en iterator över sekvensen

source: You can of course achieve the same effect with a list comprehension.
sv: Du kan naturligtvis uppnå samma effekt med en listförståelse.

source: :func:`filter(predicate, iter) <filter>` returns an iterator over all the sequence elements that meet a certain condition, and is similarly duplicated by list comprehensions. A **predicate** is a function that returns the truth value of some condition; for use with :func:`filter`, the predicate must take a single value.
sv: :func:`filter(predicate, iter) <filter>` returnerar en iterator över alla sekvenselement som uppfyller ett visst villkor, och dupliceras på liknande sätt av listförståelser. Ett **predikat** är en funktion som returnerar sanningsvärdet för ett visst villkor; för användning med :func:`filter` måste predikatet ta ett enda värde.

source: This can also be written as a list comprehension:
sv: Detta kan också skrivas som en listförståelse:

source: :func:`enumerate(iter, start=0) <enumerate>` counts off the elements in the iterable returning 2-tuples containing the count (from *start*) and each element. ::
sv: :func:`enumerate(iter, start=0) <enumerate>` räknar bort elementen i iterabeln och returnerar 2-tuples som innehåller antalet (från *start*) och varje element. ::

source: >>> for item in enumerate(['subject', 'verb', 'object']): ... print(item) (0, 'subject') (1, 'verb') (2, 'object')
sv: >>> for item in enumerate(['subject', 'verb', 'objekt']): ... print(item) (0, 'ämne') (1, 'verb') (2, 'objekt')

source: :func:`enumerate` is often used when looping through a list and recording the indexes at which certain conditions are met::
sv: :func:`enumerate` används ofta när man loopar genom en lista och registrerar de index vid vilka vissa villkor är uppfyllda::

source: f = open('data.txt', 'r') for i, line in enumerate(f): if line.strip() == '': print('Blank line at line #%i' % i)
sv: f = open('data.txt', 'r') för i, rad i uppräkning(f): if line.strip() == '': print('Blank rad på rad #%i' % i)

source: :func:`sorted(iterable, key=None, reverse=False) <sorted>` collects all the elements of the iterable into a list, sorts the list, and returns the sorted result. The *key* and *reverse* arguments are passed through to the constructed list's :meth:`~list.sort` method. ::
sv: :func:`sorted(iterable, key=None, reverse=False) <sorted>` samlar alla element i iterable i en lista, sorterar listan och returnerar det sorterade resultatet. Argumenten *key* och *reverse* skickas vidare till den konstruerade listans :meth:`~list.sort`-metod. ::

source: >>> import random >>> # Generate 8 random numbers between [0, 10000) >>> rand_list = random.sample(range(10000), 8) >>> rand_list [769, 7953, 9828, 6431, 8442, 9878, 6213, 2207] >>> sorted(rand_list) [769, 2207, 6213, 6431, 7953, 8442, 9828, 9878] >>> sorted(rand_list, reverse=True) [9878, 9828, 8442, 7953, 6431, 6213, 2207, 769]
sv: >>> import slumptal >>> # Generera 8 slumpmässiga nummer mellan [0, 10000) >>> rand_list = slumpmässigt.urval(intervall(10000), 8) >>> rand_list [769, 7953, 9828, 6431, 8442, 9878, 6213, 2207] >>> sorterad(rand_lista) [769, 2207, 6213, 6431, 7953, 8442, 9828, 9878] >>> sorterad(rand_list, reverse=True) [9878, 9828, 8442, 7953, 6431, 6213, 2207, 769]

source: (For a more detailed discussion of sorting, see the :ref:`sortinghowto`.)
sv: (För en mer detaljerad diskussion om sortering, se :ref:`sortinghowto`)

source: The :func:`any(iter) <any>` and :func:`all(iter) <all>` built-ins look at the truth values of an iterable's contents. :func:`any` returns ``True`` if any element in the iterable is a true value, and :func:`all` returns ``True`` if all of the elements are true values:
sv: Inbyggnaderna :func:`any(iter) <any>` och :func:`all(iter) <all>` tittar på sanningsvärdena i en iterabels innehåll. :func:`any` returnerar ``True`` om något element i iterabeln är ett sant värde, och :func:`all` returnerar ``True`` om alla element är sanna värden:

source: :func:`zip(iterA, iterB, ...) <zip>` takes one element from each iterable and returns them in a tuple::
sv: :func:`zip(iterA, iterB, ...) <zip>` tar ett element från varje iterabel och returnerar dem i en tupel::

source: It doesn't construct an in-memory list and exhaust all the input iterators before returning; instead tuples are constructed and returned only if they're requested. (The technical term for this behaviour is `lazy evaluation <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)
sv: Den konstruerar inte en lista i minnet och tömmer inte alla inmatade iteratorer innan den returneras; istället konstrueras och returneras tupler endast om de begärs. (Den tekniska termen för detta beteende är "lazy evaluation" <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)

source: This iterator is intended to be used with iterables that are all of the same length. If the iterables are of different lengths, the resulting stream will be the same length as the shortest iterable. ::
sv: Denna iterator är avsedd att användas med iterabler som alla har samma längd. Om iteratorerna är olika långa kommer den resulterande strömmen att vara lika lång som den kortaste iteratorn. ::

source: You should avoid doing this, though, because an element may be taken from the longer iterators and discarded. This means you can't go on to use the iterators further because you risk skipping a discarded element.
sv: Du bör dock undvika att göra detta, eftersom ett element kan tas från de längre iteratorerna och kasseras. Detta innebär att du inte kan fortsätta att använda iteratorerna ytterligare eftersom du riskerar att hoppa över ett kasserat element.

source: The itertools module
sv: Modulen itertools

source: The :mod:`itertools` module contains a number of commonly used iterators as well as functions for combining several iterators. This section will introduce the module's contents by showing small examples.
sv: Modulen :mod:`itertools` innehåller ett antal vanligt förekommande iteratorer samt funktioner för att kombinera flera iteratorer. Detta avsnitt introducerar modulens innehåll genom att visa små exempel.

source: The module's functions fall into a few broad classes:
sv: Modulens funktioner kan delas in i ett par breda klasser:

source: Functions that create a new iterator based on an existing iterator.
sv: Funktioner som skapar en ny iterator baserat på en befintlig iterator.

source: Functions for treating an iterator's elements as function arguments.
sv: Funktioner för att behandla en iterators element som funktionsargument.

source: Functions for selecting portions of an iterator's output.
sv: Funktioner för att välja ut delar av en iterators utdata.

source: A function for grouping an iterator's output.
sv: En funktion för att gruppera en iterators utdata.

source: Creating new iterators
sv: Skapa nya iteratorer

source: :func:`itertools.count(start, step) <itertools.count>` returns an infinite stream of evenly spaced values. You can optionally supply the starting number, which defaults to 0, and the interval between numbers, which defaults to 1::
sv: :func:`itertools.count(start, step) <itertools.count>` returnerar en oändlig ström av jämnt fördelade värden. Du kan välja att ange starttalet, som är 0 som standard, och intervallet mellan talen, som är 1: som standard:

source: itertools.count() => 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ... itertools.count(10) => 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, ... itertools.count(10, 5) => 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, ...
sv: itertools.count() => 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ... itertools.count(10) => 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, ... itertools.count(10, 5) => 10, 15, 20, 25, .. 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, ...

source: :func:`itertools.cycle(iter) <itertools.cycle>` saves a copy of the contents of a provided iterable and returns a new iterator that returns its elements from first to last. The new iterator will repeat these elements infinitely. ::
sv: :func:`itertools.cycle(iter) <itertools.cycle>` sparar en kopia av innehållet i en angiven iterabel och returnerar en ny iterator som returnerar dess element från första till sista. Den nya iteratorn kommer att upprepa dessa element i oändlighet. ::

source: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` returns the provided element *n* times, or returns the element endlessly if *n* is not provided. ::
sv: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` returnerar det angivna elementet *n* gånger, eller returnerar elementet oändligt om *n* inte anges. ::

source: itertools.repeat('abc') => abc, abc, abc, abc, abc, abc, abc, abc, abc, abc, ... itertools.repeat('abc', 5) => abc, abc, abc, abc, abc
sv: itertools.repeat('abc') => abc, abc, abc, abc, abc, abc, abc, abc, abc, abc, abc, ... itertools.repeat('abc', 5) => abc, abc, abc, abc, abc

source: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` takes an arbitrary number of iterables as input, and returns all the elements of the first iterator, then all the elements of the second, and so on, until all of the iterables have been exhausted. ::
sv: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` tar ett godtyckligt antal iteratorer som indata, och returnerar alla element i den första iteratorn, sedan alla element i den andra, och så vidare, tills alla iteratorer har uttömts. ::

source: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` returns a stream that's a slice of the iterator. With a single *stop* argument, it will return the first *stop* elements. If you supply a starting index, you'll get *stop-start* elements, and if you supply a value for *step*, elements will be skipped accordingly. Unlike Python's string and list slicing, you can't use negative values for *start*, *stop*, or *step*. ::
sv: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` returnerar en ström som är en del av iteratorn. Med ett enda *stop*-argument returneras de första *stop*-elementen. Om du anger ett startindex får du *stop-start*-element, och om du anger ett värde för *step* hoppas elementen över i enlighet med detta. Till skillnad från Pythons sträng- och listskärning kan du inte använda negativa värden för *start*, *stop* eller *step*:

source: itertools.islice(range(10), 8) => 0, 1, 2, 3, 4, 5, 6, 7 itertools.islice(range(10), 2, 8) => 2, 3, 4, 5, 6, 7 itertools.islice(range(10), 2, 8, 2) => 2, 4, 6
sv: itertools.islice(range(10), 8) => 0, 1, 2, 3, 4, 5, 6, 7 itertools.islice(intervall(10), 2, 8) => 2, 3, 4, 5, 6, 7 2, 3, 4, 5, 6, 7 itertools.islice(intervall(10), 2, 8, 2) => 2 2, 4, 6

source: :func:`itertools.tee(iter, [n]) <itertools.tee>` replicates an iterator; it returns *n* independent iterators that will all return the contents of the source iterator. If you don't supply a value for *n*, the default is 2. Replicating iterators requires saving some of the contents of the source iterator, so this can consume significant memory if the iterator is large and one of the new iterators is consumed more than the others. ::
sv: :func:`itertools.tee(iter, [n]) <itertools.tee>` replikerar en iterator; den returnerar *n* oberoende iteratorer som alla kommer att returnera innehållet i källiteratorn. Om du inte anger något värde för *n* är standardvärdet 2. Replikering av iteratorer kräver att en del av innehållet i källiteratorn sparas, så detta kan förbruka betydande minne om iteratorn är stor och en av de nya iteratorerna förbrukas mer än de andra. ::

source: itertools.tee( itertools.count() ) => iterA, iterB where iterA -> 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ... and iterB -> 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ...
sv: itertools.tee( itertools.count() ) => iterA, iterB där iterA -> 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ... och iterB -> 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ...

source: Calling functions on elements
sv: Anropa funktioner på element

source: The :mod:`operator` module contains a set of functions corresponding to Python's operators. Some examples are :func:`operator.add(a, b) <operator.add>` (adds two values), :func:`operator.ne(a, b) <operator.ne>` (same as ``a != b``), and :func:`operator.attrgetter('id') <operator.attrgetter>` (returns a callable that fetches the ``.id`` attribute).
sv: Modulen :mod:`operator` innehåller en uppsättning funktioner som motsvarar Pythons operatorer. Några exempel är :func:`operator.add(a, b) <operator.add>` (lägger till två värden), :func:`operator.ne(a, b) <operator.ne>` (samma som ``a != b``), och :func:`operator.attrgetter('id') <operator.attrgetter>` (returnerar en anropbar funktion som hämtar attributet ``.id``).

source: :func:`itertools.starmap(func, iter) <itertools.starmap>` assumes that the iterable will return a stream of tuples, and calls *func* using these tuples as the arguments::
sv: :func:`itertools.starmap(func, iter) <itertools.starmap>` antar att iterable kommer att returnera en ström av tuples, och anropar *func* med dessa tuples som argument::

source: Selecting elements
sv: Välja element

source: Another group of functions chooses a subset of an iterator's elements based on a predicate.
sv: En annan grupp av funktioner väljer en delmängd av en iterators element baserat på ett predikat.

source: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` is the opposite of :func:`filter`, returning all elements for which the predicate returns false::
sv: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` är motsatsen till :func:`filter` och returnerar alla element för vilka predikatet returnerar false::

source: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` returns elements for as long as the predicate returns true. Once the predicate returns false, the iterator will signal the end of its results. ::
sv: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` returnerar element så länge som predikatet returnerar sant. När predikatet returnerar falskt kommer iteratorn att signalera slutet på sina resultat. ::

source: def less_than_10(x): return x < 10 itertools.takewhile(less_than_10, itertools.count()) => 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 itertools.takewhile(is_even, itertools.count()) => 0
sv: def less_than_10(x): returnera x < 10 itertools.takewhile(less_than_10, itertools.count()) => 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 itertools.takewhile(är_jämn, itertools.count()) => 0

source: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` discards elements while the predicate returns true, and then returns the rest of the iterable's results. ::
sv: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` kasserar element medan predikatet returnerar sant, och returnerar sedan resten av iterabelns resultat. ::

source: itertools.dropwhile(less_than_10, itertools.count()) => 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, ... itertools.dropwhile(is_even, itertools.count()) => 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, ...
sv: itertools.dropwhile(less_than_10, itertools.count()) => 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, ... itertools.dropwhile(är_jämn, itertools.count()) => 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, ...

source: :func:`itertools.compress(data, selectors) <itertools.compress>` takes two iterators and returns only those elements of *data* for which the corresponding element of *selectors* is true, stopping whenever either one is exhausted::
sv: :func:`itertools.compress(data, selectors) <itertools.compress>` tar två iteratorer och returnerar endast de element i *data* för vilka motsvarande element i *selectors* är sant, och stoppar när någon av dem är uttömd::

source: Combinatoric functions
sv: Kombinatoriska funktioner

source: The :func:`itertools.combinations(iterable, r) <itertools.combinations>` returns an iterator giving all possible *r*-tuple combinations of the elements contained in *iterable*. ::
sv: :func:`itertools.combinations(iterable, r) <itertools.combinations>` returnerar en iterator som ger alla möjliga *r*-tupelkombinationer av de element som ingår i *iterable*. ::

source: itertools.combinations([1, 2, 3, 4, 5], 2) => (1, 2), (1, 3), (1, 4), (1, 5), (2, 3), (2, 4), (2, 5), (3, 4), (3, 5), (4, 5) itertools.combinations([1, 2, 3, 4, 5], 3) => (1, 2, 3), (1, 2, 4), (1, 2, 5), (1, 3, 4), (1, 3, 5), (1, 4, 5), (2, 3, 4), (2, 3, 5), (2, 4, 5), (3, 4, 5)
sv: itertools.combinations([1, 2, 3, 4, 5], 2) => (1, 2, 3, (1, 4, 5) (1, 2), (1, 3), (1, 4), (1, 5), (2, 3), (2, 4), (2, 5), (3, 4), (3, 5), (4, 5) itertools.combinations([1, 2, 3, 4, 5], 3) => (1, 2, 3) (1, 2, 3), (1, 2, 4), (1, 2, 5), (1, 3, 4), (1, 3, 5), (1, 4, 5), (2, 3, 4), (2, 3, 5), (2, 4, 5), (3, 4, 5)

source: The elements within each tuple remain in the same order as *iterable* returned them. For example, the number 1 is always before 2, 3, 4, or 5 in the examples above. A similar function, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, removes this constraint on the order, returning all possible arrangements of length *r*::
sv: Elementen i varje tupel kvarstår i samma ordning som *iterable* returnerade dem. Till exempel är siffran 1 alltid före 2, 3, 4 eller 5 i exemplen ovan. En liknande funktion, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, tar bort denna begränsning av ordningen och returnerar alla möjliga arrangemang av längden *r*::

source: itertools.permutations([1, 2, 3, 4, 5], 2) => (1, 2), (1, 3), (1, 4), (1, 5), (2, 1), (2, 3), (2, 4), (2, 5), (3, 1), (3, 2), (3, 4), (3, 5), (4, 1), (4, 2), (4, 3), (4, 5), (5, 1), (5, 2), (5, 3), (5, 4) itertools.permutations([1, 2, 3, 4, 5]) => (1, 2, 3, 4, 5), (1, 2, 3, 5, 4), (1, 2, 4, 3, 5), ... (5, 4, 3, 2, 1)
sv: itertools.permutationer([1, 2, 3, 4, 5], 2) => (1, 2), (1, 3), (1, 4), (1, 5), (2, 1), (2, 3), (2, 4), (2, 5), (3, 1), (3, 2), (3, 4), (3, 5), (4, 1), (4, 2), (4, 3), (4, 5), (5, 1), (5, 2), (5, 3), (5, 4) itertools.permutationer([1, 2, 3, 4, 5]) => (1, 2, 3, 4, 5), (1, 2, 3, 5, 4), (1, 2, 4, 3, 5), ... (5, 4, 3, 2, 1)

source: If you don't supply a value for *r* the length of the iterable is used, meaning that all the elements are permuted.
sv: Om du inte anger något värde för *r* används iterationens längd, vilket innebär att alla element permuteras.

source: Note that these functions produce all of the possible combinations by position and don't require that the contents of *iterable* are unique::
sv: Observera att dessa funktioner producerar alla möjliga kombinationer efter position och inte kräver att innehållet i *iterable* är unikt::

source: itertools.permutations('aba', 3) => ('a', 'b', 'a'), ('a', 'a', 'b'), ('b', 'a', 'a'), ('b', 'a', 'a'), ('a', 'a', 'b'), ('a', 'b', 'a')
sv: itertools.permutationer('aba', 3) => ('a', 'b', 'a'), ('a', 'a', 'b'), ('b', 'a', 'a'), ('b', 'a', 'a'), ('a', 'a', 'b'), ('a', 'b', 'a')

source: The identical tuple ``('a', 'a', 'b')`` occurs twice, but the two 'a' strings came from different positions.
sv: Den identiska tupeln ``('a', 'a', 'b')`` förekommer två gånger, men de två 'a'-strängarna kom från olika positioner.

source: The :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` function relaxes a different constraint: elements can be repeated within a single tuple. Conceptually an element is selected for the first position of each tuple and then is replaced before the second element is selected. ::
sv: Funktionen :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` släpper på en annan begränsning: element kan upprepas inom en enda tupel. Konceptuellt väljs ett element för den första positionen i varje tupel och ersätts sedan innan det andra elementet väljs. ::

source: itertools.combinations_with_replacement([1, 2, 3, 4, 5], 2) => (1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (2, 2), (2, 3), (2, 4), (2, 5), (3, 3), (3, 4), (3, 5), (4, 4), (4, 5), (5, 5)
sv: itertools.combinations_with_replacement([1, 2, 3, 4, 5], 2) => (1, 1, 2, 1, 3, 4, 5) (1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (2, 2), (2, 3), (2, 4), (2, 5), (3, 3), (3, 4), (3, 5), (4, 4), (4, 5), (5, 5)

source: Grouping elements
sv: Gruppering av element

source: The last function I'll discuss, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, is the most complicated. ``key_func(elem)`` is a function that can compute a key value for each element returned by the iterable. If you don't supply a key function, the key is simply each element itself.
sv: Den sista funktionen som jag ska diskutera, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, är den mest komplicerade. ``key_func(elem)`` är en funktion som kan beräkna ett nyckelvärde för varje element som returneras av iterable. Om du inte anger någon nyckelfunktion är nyckeln helt enkelt varje element i sig.

source: :func:`~itertools.groupby` collects all the consecutive elements from the underlying iterable that have the same key value, and returns a stream of 2-tuples containing a key value and an iterator for the elements with that key.
sv: :func:`~itertools.groupby` samlar in alla på varandra följande element från den underliggande iterabeln som har samma nyckelvärde och returnerar en ström av 2-tuples som innehåller ett nyckelvärde och en iterator för elementen med den nyckeln.

source: city_list = [('Decatur', 'AL'), ('Huntsville', 'AL'), ('Selma', 'AL'), ('Anchorage', 'AK'), ('Nome', 'AK'), ('Flagstaff', 'AZ'), ('Phoenix', 'AZ'), ('Tucson', 'AZ'), ... ] def get_state(city_state): return city_state[1] itertools.groupby(city_list, get_state) => ('AL', iterator-1), ('AK', iterator-2), ('AZ', iterator-3), ... where iterator-1 => ('Decatur', 'AL'), ('Huntsville', 'AL'), ('Selma', 'AL') iterator-2 => ('Anchorage', 'AK'), ('Nome', 'AK') iterator-3 => ('Flagstaff', 'AZ'), ('Phoenix', 'AZ'), ('Tucson', 'AZ')
sv: city_list = [('Decatur', 'AL'), ('Huntsville', 'AL'), ('Selma', 'AL'), ('Anchorage', 'AK'), ('Nome', 'AK'), ('Flagstaff', 'AZ'), ('Phoenix', 'AZ'), ('Tucson', 'AZ'), ... ] def get_state(city_state): returnera city_state[1] itertools.groupby(city_list, get_state) => ('AL', iterator-1), ('AK', iterator-2), ('AZ', iterator-3), ... där iterator-1 => ('Decatur', 'AL'), ('Huntsville', 'AL'), ('Selma', 'AL') iterator-2 => ('Anchor', 'AL') ('Anchorage', 'AK'), ('Nome', 'AK') iterator-3 => ('Flagstaff', 'AK') ('Flagstaff', 'AZ'), ('Phoenix', 'AZ'), ('Tucson', 'AZ')
