Repository: yeager/python-docs-sv
Catalog: howto/functional.po
Languages: sv

source: >>> m = {'Jan': 1, 'Feb': 2, 'Mar': 3, 'Apr': 4, 'May': 5, 'Jun': 6, ... 'Jul': 7, 'Aug': 8, 'Sep': 9, 'Oct': 10, 'Nov': 11, 'Dec': 12} >>> for key in m: ... print(key, m[key]) Jan 1 Feb 2 Mar 3 Apr 4 May 5 Jun 6 Jul 7 Aug 8 Sep 9 Oct 10 Nov 11 Dec 12
sv: >>> m = {'Jan': 1, 'Feb': 2, 'Mar': 3, 'Apr': 4, 'May': 5, 'Jun': 6, ... "Jul": 7, "Aug": 8, "Sep": 9, 'okt': 10, 'nov': 11, 'Dec': 12} >>> för nyckel i m: ... print(nyckel, m[nyckel]) 1 januari 2 februari 3 mars 4 april 5 maj 6 juni 7 juli Augusti 8 9 september 10 oktober 11 november 12 dec

source: Note that starting with Python 3.7, dictionary iteration order is guaranteed to be the same as the insertion order. In earlier versions, the behaviour was unspecified and could vary between implementations.
sv: Observera att från och med Python 3.7 är ordbokens iterationsordning garanterad att vara densamma som insättningsordningen. I tidigare versioner var beteendet ospecificerat och kunde variera mellan olika implementeringar.

source: Applying :func:`iter` to a dictionary always loops over the keys, but dictionaries have methods that return other iterators. If you want to iterate over values or key/value pairs, you can explicitly call the :meth:`~dict.values` or :meth:`~dict.items` methods to get an appropriate iterator.
sv: Om du använder :func:`iter` på en dictionary loopar du alltid över nycklarna, men dictionaries har metoder som returnerar andra iteratorer. Om du vill iterera över värden eller nyckel/värde-par kan du uttryckligen anropa metoderna :meth:`~dict.values` eller :meth:`~dict.items` för att få en lämplig iterator.

source: The :func:`dict` constructor can accept an iterator that returns a finite stream of ``(key, value)`` tuples:
sv: Konstruktören :func:`dict` kan acceptera en iterator som returnerar en ändlig ström av ``(nyckel, värde)``-tupler:

source: Files also support iteration by calling the :meth:`~io.TextIOBase.readline` method until there are no more lines in the file. This means you can read each line of a file like this::
sv: Filer stöder också iteration genom att anropa metoden :meth:`~io.TextIOBase.readline` tills det inte finns några fler rader i filen. Detta innebär att du kan läsa varje rad i en fil så här::

source: for line in file: # do something for each line ...
sv: för rad i filen: # gör något för varje rad ...

source: Sets can take their contents from an iterable and let you iterate over the set's elements::
sv: Uppsättningar kan ta sitt innehåll från en iterabel och låta dig iterera över uppsättningens element::

source: >>> S = {2, 3, 5, 7, 11, 13} >>> for i in S: ... print(i) 2 3 5 7 11 13
sv: >>> S = {2, 3, 5, 7, 11, 13} >>> för i i S: ... print(i) 2 3 5 7 11 13

source: Generator expressions and list comprehensions
sv: Generatoruttryck och listkomprehensioner

source: Two common operations on an iterator's output are 1) performing some operation for every element, 2) selecting a subset of elements that meet some condition. For example, given a list of strings, you might want to strip off trailing whitespace from each line or extract all the strings containing a given substring.
sv: Två vanliga operationer på en iterators utdata är 1) att utföra någon operation för varje element, 2) att välja en delmängd av element som uppfyller något villkor. Om du till exempel har en lista med strängar kanske du vill ta bort efterföljande blanksteg från varje rad eller extrahera alla strängar som innehåller en viss delsträng.

source: List comprehensions and generator expressions (short form: "listcomps" and "genexps") are a concise notation for such operations, borrowed from the functional programming language Haskell (https://www.haskell.org/). You can strip all the whitespace from a stream of strings with the following code::
sv: Listkomprehensioner och generatoruttryck (kortform: "listcomps" och "genexps") är en kortfattad notation för sådana operationer, som lånats från det funktionella programmeringsspråket Haskell (https://www.haskell.org/). Du kan ta bort alla blanksteg från en ström av strängar med följande kod::

source: >>> line_list = [' line 1\n', 'line 2 \n', ' \n', ''] >>> # Generator expression -- returns iterator >>> stripped_iter = (line.strip() for line in line_list) >>> # List comprehension -- returns list >>> stripped_list = [line.strip() for line in line_list]
sv: >>> line_list = [' line 1\n', 'line 2 \n', ' \n', ''] >>> # Generatoruttryck -- returnerar iterator >>> stripped_iter = (linje.strip() för linje i linje_lista) >>> # Listförståelse -- returnerar lista >>> stripped_list = [line.strip() for line in line_list]

source: You can select only certain elements by adding an ``"if"`` condition::
sv: Du kan välja endast vissa element genom att lägga till ett ``"if"``-villkor::

source: >>> stripped_list = [line.strip() for line in line_list ... if line != ""]
sv: >>> stripped_list = [line.strip() för line i line_list ... om rad != ""]

source: With a list comprehension, you get back a Python list; ``stripped_list`` is a list containing the resulting lines, not an iterator. Generator expressions return an iterator that computes the values as necessary, not needing to materialize all the values at once. This means that list comprehensions aren't useful if you're working with iterators that return an infinite stream or a very large amount of data. Generator expressions are preferable in these situations.
sv: Med en list comprehension får du tillbaka en Python-lista; ``stripped_list`` är en lista som innehåller de resulterande raderna, inte en iterator. Generatoruttryck returnerar en iterator som beräknar värdena efter behov, utan att behöva materialisera alla värden på en gång. Det innebär att listcomprehensions inte är användbara om du arbetar med iteratorer som returnerar en oändlig ström eller en mycket stor mängd data. Generatoruttryck är att föredra i dessa situationer.

source: Generator expressions are surrounded by parentheses ("()") and list comprehensions are surrounded by square brackets ("[]"). Generator expressions have the form::
sv: Generatoruttryck omges av parenteser ("()") och listkomprehensioner omges av hakparenteser ("[]"). Generatoruttryck har formen::

source: ( expression for expr in sequence1 if condition1 for expr2 in sequence2 if condition2 for expr3 in sequence3 ... if condition3 for exprN in sequenceN if conditionN )
sv: ( uttryck för expr i sekvens1 om villkor1 för expr2 i sekvens2 om villkor2 för expr3 i sekvens3 ... om villkor3 för exprN i sekvensN om villkorN )

source: Again, for a list comprehension only the outside brackets are different (square brackets instead of parentheses).
sv: Även här är det bara de yttre hakparenteserna som är annorlunda (hakparenteser i stället för parenteser).

source: The elements of the generated output will be the successive values of ``expression``. The ``if`` clauses are all optional; if present, ``expression`` is only evaluated and added to the result when ``condition`` is true.
sv: Elementen i den genererade utdata kommer att vara de successiva värdena av ``uttryck``. Alla ``if``-klausuler är valfria; om de finns med utvärderas ``expression`` och läggs till i resultatet endast när ``condition`` är sant.

source: Generator expressions always have to be written inside parentheses, but the parentheses signalling a function call also count. If you want to create an iterator that will be immediately passed to a function you can write::
sv: Generatoruttryck måste alltid skrivas inom parentes, men även de parenteser som signalerar ett funktionsanrop räknas. Om du vill skapa en iterator som omedelbart skickas till en funktion kan du skriva::

source: obj_total = sum(obj.count for obj in list_all_objects())
sv: obj_total = sum(obj.count för obj i list_all_objects())

source: The ``for...in`` clauses contain the sequences to be iterated over. The sequences do not have to be the same length, because they are iterated over from left to right, **not** in parallel. For each element in ``sequence1``, ``sequence2`` is looped over from the beginning. ``sequence3`` is then looped over for each resulting pair of elements from ``sequence1`` and ``sequence2``.
sv: Klausulerna ``for...in`` innehåller de sekvenser som ska itereras över. Sekvenserna behöver inte vara lika långa, eftersom de itereras från vänster till höger, **inte** parallellt. För varje element i ``sekvens1``, loopas ``sekvens2`` från början. ``sekvens3`` loopas sedan över för varje resulterande par av element från ``sekvens1`` och ``sekvens2``.

source: To put it another way, a list comprehension or generator expression is equivalent to the following Python code::
sv: För att uttrycka det på ett annat sätt är en listförståelse eller ett generatoruttryck likvärdigt med följande Python-kod::

source: for expr1 in sequence1: if not (condition1): continue # Skip this element for expr2 in sequence2: if not (condition2): continue # Skip this element ... for exprN in sequenceN: if not (conditionN): continue # Skip this element # Output the value of # the expression.
sv: för expr1 i sekvens1: if not (villkor1): continue # Hoppa över detta element för expr2 i sekvens2: if not (condition2): fortsätt # Hoppa över detta element ... för exprN i sekvensN: if not (conditionN): fortsätt # Hoppa över detta element # Skriv ut värdet av # uttrycket.

source: This means that when there are multiple ``for...in`` clauses but no ``if`` clauses, the length of the resulting output will be equal to the product of the lengths of all the sequences. If you have two lists of length 3, the output list is 9 elements long:
sv: Detta innebär att när det finns flera ``for...in``-klausuler men inga ``if``-klausuler, kommer längden på den resulterande utdatan att vara lika med produkten av längden på alla sekvenser. Om du har två listor med längden 3, blir utdatalistan 9 element lång:

source: To avoid introducing an ambiguity into Python's grammar, if ``expression`` is creating a tuple, it must be surrounded with parentheses. The first list comprehension below is a syntax error, while the second one is correct::
sv: För att undvika att införa en tvetydighet i Pythons grammatik, om ``expression`` skapar en tupel, måste den omges av parenteser. Den första listförståelsen nedan är ett syntaxfel, medan den andra är korrekt::

source: # Syntax error [x, y for x in seq1 for y in seq2] # Correct [(x, y) for x in seq1 for y in seq2]
sv: # Syntaxfel [x, y för x i seq1 för y i seq2] # Korrekt [(x, y) för x i seq1 för y i seq2]

source: Generators
sv: Generatorer

source: Generators are a special class of functions that simplify the task of writing iterators. Regular functions compute a value and return it, but generators return an iterator that returns a stream of values.
sv: Generatorer är en speciell klass av funktioner som förenklar arbetet med att skriva iteratorer. Vanliga funktioner beräknar ett värde och returnerar det, men generatorer returnerar en iterator som returnerar en ström av värden.

source: You're doubtless familiar with how regular function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a ``return`` statement, the local variables are destroyed and the value is returned to the caller. A later call to the same function creates a new private namespace and a fresh set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
sv: Du är säkert bekant med hur vanliga funktionsanrop fungerar i Python eller C. När du anropar en funktion får den ett privat namnområde där dess lokala variabler skapas. När funktionen når ett ``return``-slutsats förstörs de lokala variablerna och värdet returneras till anroparen. Ett senare anrop till samma funktion skapar ett nytt privat namnområde och en ny uppsättning lokala variabler. Men tänk om de lokala variablerna inte kastades bort när en funktion avslutades? Tänk om du senare kunde återuppta funktionen där den slutade? Detta är vad generatorer tillhandahåller; de kan betraktas som återupptagbara funktioner.

source: Here's the simplest example of a generator function:
sv: Här är det enklaste exemplet på en generatorfunktion:

source: Any function containing a :keyword:`yield` keyword is a generator function; this is detected by Python's :term:`bytecode` compiler which compiles the function specially as a result.
sv: Varje funktion som innehåller ett :keyword:`yield`-nyckelord är en generatorfunktion; detta upptäcks av Pythons :term:`bytecode`-kompilator som kompilerar funktionen speciellt som ett resultat.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the ``yield`` expression, the generator outputs the value of ``i``, similar to a ``return`` statement. The big difference between ``yield`` and a ``return`` statement is that on reaching a ``yield`` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's :meth:`~generator.__next__` method, the function will resume executing.
sv: När du anropar en generatorfunktion returnerar den inte ett enda värde, utan istället ett generatorobjekt som stöder iteratorprotokollet. Vid exekvering av ``yield``-uttrycket matar generatorn ut värdet för ``i``, på samma sätt som en ``return``-sats. Den stora skillnaden mellan ``yield`` och en ``return``-sats är att när man når en ``yield`` avbryts generatorns exekveringstillstånd och lokala variabler bevaras. Vid nästa anrop till generatorns :meth:`~generator.__next__`-metod kommer funktionen att återuppta exekveringen.

source: Here's a sample usage of the ``generate_ints()`` generator:
sv: Här är ett exempel på användning av generatorn ``generate_ints()``:

source: You could equally write ``for i in generate_ints(5)``, or ``a, b, c = generate_ints(3)``.
sv: Du skulle lika gärna kunna skriva ``for i in generate_ints(5)``, eller ``a, b, c = generate_ints(3)``.

source: Inside a generator function, ``return value`` causes ``StopIteration(value)`` to be raised from the :meth:`~generator.__next__` method. Once this happens, or the bottom of the function is reached, the procession of values ends and the generator cannot yield any further values.
sv: I en generatorfunktion orsakar ``return value`` att ``StopIteration(value)`` utlöses från metoden :meth:`~generator.__next__`. När detta händer, eller när botten av funktionen har nåtts, avslutas värdeprocesssionen och generatorn kan inte ge några ytterligare värden.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`~iterator.__next__` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class can be much messier.
sv: Du kan uppnå effekten av generatorer manuellt genom att skriva din egen klass och lagra alla lokala variabler i generatorn som instansvariabler. Att returnera en lista med heltal kan till exempel göras genom att sätta ``self.count`` till 0 och låta :meth:`~iterator.__next__`-metoden öka ``self.count`` och returnera den. Men för en måttligt komplicerad generator kan det vara mycket krångligare att skriva en motsvarande klass.

source: The test suite included with Python's library, :source:`Lib/test/test_generators.py`, contains a number of more interesting examples. Here's one generator that implements an in-order traversal of a tree using generators recursively. ::
sv: Testsviten som ingår i Pythons bibliotek, :source:`Lib/test/test_generators.py`, innehåller ett antal mer intressanta exempel. Här är en generator som implementerar en ordnad traversal av ett träd med hjälp av generatorer rekursivt. ::

source: # A recursive generator that generates Tree leaves in in-order. def inorder(t): if t: for x in inorder(t.left): yield x yield t.label for x in inorder(t.right): yield x
sv: # En rekursiv generator som genererar trädblad i ordning. def inorder(t): if t: för x i inorder(t.left): avkastning x yield t.etikett för x i inorder(t.right): avkastning x

source: Two other examples in ``test_generators.py`` produce solutions for the N-Queens problem (placing N queens on an NxN chess board so that no queen threatens another) and the Knight's Tour (finding a route that takes a knight to every square of an NxN chessboard without visiting any square twice).
sv: Två andra exempel i ``test_generators.py`` producerar lösningar för N-Queens-problemet (placera N drottningar på ett NxN schackbräde så att ingen drottning hotar en annan) och Knight's Tour (hitta en rutt som tar en riddare till varje ruta på ett NxN schackbräde utan att besöka någon ruta två gånger).

source: Passing values into a generator
sv: Överföra värden till en generator

source: In Python 2.4 and earlier, generators only produced output. Once a generator's code was invoked to create an iterator, there was no way to pass any new information into the function when its execution is resumed. You could hack together this ability by making the generator look at a global variable or by passing in some mutable object that callers then modify, but these approaches are messy.
sv: I Python 2.4 och tidigare producerade generatorer bara utdata. När en generators kod anropades för att skapa en iterator fanns det inget sätt att skicka någon ny information till funktionen när dess exekvering återupptas. Du kan hacka ihop denna förmåga genom att få generatorn att titta på en global variabel eller genom att skicka in något mutabelt objekt som anroparna sedan ändrar, men dessa tillvägagångssätt är röriga.

source: In Python 2.5 there's a simple way to pass values into a generator. :keyword:`yield` became an expression, returning a value that can be assigned to a variable or otherwise operated on::
sv: I Python 2.5 finns det ett enkelt sätt att skicka värden till en generator. :keyword:`yield` blev ett uttryck som returnerar ett värde som kan tilldelas en variabel eller på annat sätt bearbetas::

source: val = (yield i)
sv: val = (avkastning i)

source: I recommend that you **always** put parentheses around a ``yield`` expression when you're doing something with the returned value, as in the above example. The parentheses aren't always necessary, but it's easier to always add them instead of having to remember when they're needed.
sv: Jag rekommenderar att du **alltid** sätter parenteser runt ett ``yield``-uttryck när du gör något med det returnerade värdet, som i exemplet ovan. Parenteserna är inte alltid nödvändiga, men det är lättare att alltid lägga till dem istället för att behöva komma ihåg när de behövs.

source: (:pep:`342` explains the exact rules, which are that a ``yield``-expression must always be parenthesized except when it occurs at the top-level expression on the right-hand side of an assignment. This means you can write ``val = yield i`` but have to use parentheses when there's an operation, as in ``val = (yield i) + 12``.)
sv: (:pep:`342` förklarar de exakta reglerna, som är att ett ``yield``-uttryck alltid måste vara inom parentes utom när det förekommer i toppnivåuttrycket på höger sida av en tilldelning. Detta innebär att du kan skriva ``val = yield i`` men måste använda parenteser när det finns en operation, som i ``val = (yield i) + 12``.)

source: Values are sent into a generator by calling its :meth:`send(value) <generator.send>` method. This method resumes the generator's code and the ``yield`` expression returns the specified value. If the regular :meth:`~generator.__next__` method is called, the ``yield`` returns ``None``.
sv: Värden skickas till en generator genom att anropa dess metod :meth:`send(value) <generator.send>`. Denna metod återupptar generatorns kod och uttrycket ``yield`` returnerar det angivna värdet. Om den vanliga metoden :meth:`~generator.__next__` anropas returnerar ``yield`` ``None``.

source: Here's a simple counter that increments by 1 and allows changing the value of the internal counter.
sv: Här är en enkel räknare som ökar med 1 och gör det möjligt att ändra värdet på den interna räknaren.

source: def counter(maximum): i = 0 while i < maximum: val = (yield i) # If value provided, change counter if val is not None: i = val else: i += 1
sv: def counter(maximum): i = 0 while i < maximum: val = (avkastning i) # Om värde tillhandahålls, ändra räknaren om val inte är None: i = val i annat fall i += 1

source: And here's an example of changing the counter:
sv: Och här är ett exempel på hur man ändrar räknaren:

source: Because ``yield`` will often be returning ``None``, you should always check for this case. Don't just use its value in expressions unless you're sure that the :meth:`~generator.send` method will be the only method used to resume your generator function.
sv: Eftersom ``yield`` ofta kommer att returnera ``None``, bör du alltid kontrollera för detta fall. Använd inte bara dess värde i uttryck om du inte är säker på att metoden :meth:`~generator.send` kommer att vara den enda metod som används för att återuppta din generatorfunktion.

source: In addition to :meth:`~generator.send`, there are two other methods on generators:
sv: Förutom :meth:`~generator.send` finns det två andra metoder för generatorer:

source: :meth:`throw(value) <generator.throw>` is used to raise an exception inside the generator; the exception is raised by the ``yield`` expression where the generator's execution is paused.
sv: :meth:`throw(value) <generator.throw>` används för att skapa ett undantag inuti generatorn; undantaget skapas av ``yield``-uttrycket där generatorns exekvering pausas.

source: :meth:`~generator.close` sends a :exc:`GeneratorExit` exception to the generator to terminate the iteration. On receiving this exception, the generator's code must either raise :exc:`GeneratorExit` or :exc:`StopIteration`; catching the exception and doing anything else is illegal and will trigger a :exc:`RuntimeError`. :meth:`~generator.close` will also be called by Python's garbage collector when the generator is garbage-collected.
sv: :meth:`~generator.close` skickar ett :exc:`GeneratorExit` undantag till generatorn för att avsluta iterationen. Vid mottagandet av detta undantag måste generatorns kod antingen höja :exc:`GeneratorExit` eller :exc:`StopIteration`; att fånga undantaget och göra något annat är olagligt och kommer att utlösa ett :exc:`RuntimeError`. :meth:`~generator.close` kommer också att anropas av Pythons skräpsamlare när generatorn är skräpsamlad.

source: If you need to run cleanup code when a :exc:`GeneratorExit` occurs, I suggest using a ``try: ... finally:`` suite instead of catching :exc:`GeneratorExit`.
sv: Om du behöver köra upprensningskod när en :exc:`GeneratorExit` inträffar föreslår jag att du använder en ``try: ... finally:`` svit istället för att fånga :exc:`GeneratorExit`.

source: The cumulative effect of these changes is to turn generators from one-way producers of information into both producers and consumers.
sv: Den sammantagna effekten av dessa förändringar är att generatorer förvandlas från enkelriktade producenter av information till både producenter och konsumenter.
