Repository: yeager/python-docs-sv
Catalog: howto/functional.po
Languages: sv

source: Functional Programming HOWTO
sv: HOWTO om funktionell programmering

source: Author
sv: Författare

source: In this document, we'll take a tour of Python's features suitable for implementing programs in a functional style. After an introduction to the concepts of functional programming, we'll look at language features such as :term:`iterator`\s and :term:`generator`\s and relevant library modules such as :mod:`itertools` and :mod:`functools`.
sv: I det här dokumentet tar vi en rundtur i Pythons funktioner som lämpar sig för att implementera program i en funktionell stil. Efter en introduktion till begreppen funktionell programmering tittar vi på språkfunktioner som :term:`iterator` och :term:`generator` samt relevanta biblioteksmoduler som :mod:`itertools` och :mod:`functools`.

source: Introduction
sv: Introduktion

source: This section explains the basic concept of functional programming; if you're just interested in learning about Python language features, skip to the next section on :ref:`functional-howto-iterators`.
sv: Detta avsnitt förklarar det grundläggande konceptet för funktionell programmering; om du bara är intresserad av att lära dig om Python-språkets funktioner, hoppa till nästa avsnitt om :ref:`funktionell-hur-iteratorer`.

source: Programming languages support decomposing problems in several different ways:
sv: Programmeringsspråk stöder nedbrytning av problem på flera olika sätt:

source: Most programming languages are **procedural**: programs are lists of instructions that tell the computer what to do with the program's input. C, Pascal, and even Unix shells are procedural languages.
sv: De flesta programmeringsspråk är **procedurspråk**: program är listor med instruktioner som talar om för datorn vad den ska göra med programmets indata. C, Pascal och till och med Unix-shell är procedurspråk.

source: In **declarative** languages, you write a specification that describes the problem to be solved, and the language implementation figures out how to perform the computation efficiently. SQL is the declarative language you're most likely to be familiar with; a SQL query describes the data set you want to retrieve, and the SQL engine decides whether to scan tables or use indexes, which subclauses should be performed first, etc.
sv: I **deklarativa** språk skriver du en specifikation som beskriver problemet som ska lösas, och språkets implementation räknar ut hur beräkningen ska utföras på ett effektivt sätt. SQL är det deklarativa språk som du troligen känner till; en SQL-fråga beskriver den datamängd som du vill hämta, och SQL-motorn avgör om tabeller ska skannas eller index användas, vilka subklausuler som ska utföras först osv.

source: **Object-oriented** programs manipulate collections of objects. Objects have internal state and support methods that query or modify this internal state in some way. Smalltalk and Java are object-oriented languages. C++ and Python are languages that support object-oriented programming, but don't force the use of object-oriented features.
sv: **Objektorienterade** program manipulerar samlingar av objekt. Objekt har ett internt tillstånd och stödjer metoder som på något sätt frågar efter eller ändrar detta interna tillstånd. Smalltalk och Java är objektorienterade språk. C++ och Python är språk som stöder objektorienterad programmering, men som inte tvingar fram användning av objektorienterade funktioner.

source: **Functional** programming decomposes a problem into a set of functions. Ideally, functions only take inputs and produce outputs, and don't have any internal state that affects the output produced for a given input. Well-known functional languages include the ML family (Standard ML, OCaml, and other variants) and Haskell.
sv: *i *funktionell** programmering bryts ett problem ned till en uppsättning funktioner. I idealfallet tar funktioner bara emot indata och producerar utdata, och har inget internt tillstånd som påverkar den utdata som produceras för en given indata. Välkända funktionella språk är bland annat ML-familjen (Standard ML, OCaml och andra varianter) och Haskell.

source: The designers of some computer languages choose to emphasize one particular approach to programming. This often makes it difficult to write programs that use a different approach. Other languages are multi-paradigm languages that support several different approaches. Lisp, C++, and Python are multi-paradigm; you can write programs or libraries that are largely procedural, object-oriented, or functional in all of these languages. In a large program, different sections might be written using different approaches; the GUI might be object-oriented while the processing logic is procedural or functional, for example.
sv: Konstruktörerna av vissa datorspråk väljer att betona ett visst sätt att programmera. Detta gör det ofta svårt att skriva program som använder ett annat synsätt. Andra språk är multiparadigmspråk som stödjer flera olika synsätt. Lisp, C++ och Python är multiparadigmspråk; du kan skriva program eller bibliotek som till stor del är procedurella, objektorienterade eller funktionella i alla dessa språk. I ett stort program kan olika delar skrivas med olika metoder; GUI:t kan till exempel vara objektorienterat medan bearbetningslogiken är procedurell eller funktionell.

source: In a functional program, input flows through a set of functions. Each function operates on its input and produces some output. Functional style discourages functions with side effects that modify internal state or make other changes that aren't visible in the function's return value. Functions that have no side effects at all are called **purely functional**. Avoiding side effects means not using data structures that get updated as a program runs; every function's output must only depend on its input.
sv: I ett funktionellt program flödar indata genom en uppsättning funktioner. Varje funktion bearbetar sin indata och producerar en viss utdata. Funktionell stil avråder från funktioner med sidoeffekter som ändrar internt tillstånd eller gör andra ändringar som inte syns i funktionens returvärde. Funktioner som inte har några bieffekter alls kallas **rent funktionella**. Att undvika bieffekter innebär att man inte använder datastrukturer som uppdateras under programmets gång, utan varje funktions utdata får bara bero på dess indata.

source: Some languages are very strict about purity and don't even have assignment statements such as ``a=3`` or ``c = a + b``, but it's difficult to avoid all side effects, such as printing to the screen or writing to a disk file. Another example is a call to the :func:`print` or :func:`time.sleep` function, neither of which returns a useful value. Both are called only for their side effects of sending some text to the screen or pausing execution for a second.
sv: Vissa språk är mycket strikta när det gäller renhet och har inte ens assignment statements som ``a=3`` eller ``c = a + b``, men det är svårt att undvika alla bieffekter, till exempel att skriva ut på skärmen eller skriva till en diskfil. Ett annat exempel är ett anrop till funktionen :func:`print` eller :func:`time.sleep`, som inte ger något användbart värde. Båda anropas endast för sina bieffekter, som att skicka lite text till skärmen eller pausa exekveringen i en sekund.

source: Python programs written in functional style usually won't go to the extreme of avoiding all I/O or all assignments; instead, they'll provide a functional-appearing interface but will use non-functional features internally. For example, the implementation of a function will still use assignments to local variables, but won't modify global variables or have other side effects.
sv: Python-program skrivna i funktionell stil går vanligtvis inte till ytterligheten att undvika alla I/O eller alla tilldelningar; istället tillhandahåller de ett gränssnitt som ser funktionellt ut men använder icke-funktionella funktioner internt. Till exempel kommer implementeringen av en funktion fortfarande att använda tilldelningar till lokala variabler, men kommer inte att ändra globala variabler eller ha andra biverkningar.

source: Functional programming can be considered the opposite of object-oriented programming. Objects are little capsules containing some internal state along with a collection of method calls that let you modify this state, and programs consist of making the right set of state changes. Functional programming wants to avoid state changes as much as possible and works with data flowing between functions. In Python you might combine the two approaches by writing functions that take and return instances representing objects in your application (e-mail messages, transactions, etc.).
sv: Funktionell programmering kan ses som motsatsen till objektorienterad programmering. Objekt är små kapslar som innehåller ett internt tillstånd tillsammans med en samling metodanrop som låter dig ändra detta tillstånd, och program består av att göra rätt uppsättning tillståndsändringar. Funktionell programmering vill undvika tillståndsändringar så mycket som möjligt och arbetar med dataflöden mellan funktioner. I Python kan du kombinera de två metoderna genom att skriva funktioner som tar och returnerar instanser som representerar objekt i din applikation (e-postmeddelanden, transaktioner etc.).

source: Functional design may seem like an odd constraint to work under. Why should you avoid objects and side effects? There are theoretical and practical advantages to the functional style:
sv: Funktionell design kan verka som en märklig begränsning att arbeta under. Varför ska man undvika objekt och bieffekter? Det finns teoretiska och praktiska fördelar med den funktionella stilen:

source: Formal provability.
sv: Formell bevisbarhet.

source: Modularity.
sv: Modularitet.

source: Composability.
sv: Komponerbarhet.

source: Ease of debugging and testing.
sv: Enkel felsökning och testning.

source: Formal provability
sv: Formell bevisbarhet

source: A theoretical benefit is that it's easier to construct a mathematical proof that a functional program is correct.
sv: En teoretisk fördel är att det är lättare att konstruera ett matematiskt bevis för att ett funktionellt program är korrekt.

source: For a long time researchers have been interested in finding ways to mathematically prove programs correct. This is different from testing a program on numerous inputs and concluding that its output is usually correct, or reading a program's source code and concluding that the code looks right; the goal is instead a rigorous proof that a program produces the right result for all possible inputs.
sv: Under lång tid har forskare varit intresserade av att hitta sätt att matematiskt bevisa att program är korrekta. Detta skiljer sig från att testa ett program på många olika indata och dra slutsatsen att dess utdata vanligtvis är korrekt, eller att läsa ett programs källkod och dra slutsatsen att koden ser rätt ut; målet är istället ett rigoröst bevis för att ett program ger rätt resultat för alla möjliga indata.

source: The technique used to prove programs correct is to write down **invariants**, properties of the input data and of the program's variables that are always true. For each line of code, you then show that if invariants X and Y are true **before** the line is executed, the slightly different invariants X' and Y' are true **after** the line is executed. This continues until you reach the end of the program, at which point the invariants should match the desired conditions on the program's output.
sv: Den teknik som används för att bevisa att program är korrekta är att skriva ner **invarianter**, egenskaper hos indata och hos programmets variabler som alltid är sanna. För varje kodrad visar man sedan att om invarianterna X och Y är sanna **innan** raden körs, så är de något annorlunda invarianterna X' och Y' sanna **efter** raden körs. Detta fortsätter tills du når slutet av programmet, då invarianterna ska matcha de önskade villkoren på programmets utdata.

source: Functional programming's avoidance of assignments arose because assignments are difficult to handle with this technique; assignments can break invariants that were true before the assignment without producing any new invariants that can be propagated onward.
sv: Att funktionell programmering undviker tilldelningar beror på att tilldelningar är svåra att hantera med denna teknik; tilldelningar kan bryta invarianter som var sanna före tilldelningen utan att producera några nya invarianter som kan spridas vidare.

source: Unfortunately, proving programs correct is largely impractical and not relevant to Python software. Even trivial programs require proofs that are several pages long; the proof of correctness for a moderately complicated program would be enormous, and few or none of the programs you use daily (the Python interpreter, your XML parser, your web browser) could be proven correct. Even if you wrote down or generated a proof, there would then be the question of verifying the proof; maybe there's an error in it, and you wrongly believe you've proved the program correct.
sv: Att bevisa att program är korrekta är tyvärr till stor del opraktiskt och inte relevant för Python-programvara. Även triviala program kräver bevis som är flera sidor långa; korrekthetsbeviset för ett måttligt komplicerat program skulle vara enormt, och få eller inga av de program du använder dagligen (Python-tolken, din XML-parser, din webbläsare) kan bevisas vara korrekta. Även om du skrev ner eller genererade ett bevis, skulle det då vara frågan om att verifiera beviset; kanske finns det ett fel i det, och du tror felaktigt att du har bevisat att programmet är korrekt.

source: Modularity
sv: Modularitet

source: A more practical benefit of functional programming is that it forces you to break apart your problem into small pieces. Programs are more modular as a result. It's easier to specify and write a small function that does one thing than a large function that performs a complicated transformation. Small functions are also easier to read and to check for errors.
sv: En mer praktisk fördel med funktionell programmering är att den tvingar dig att dela upp ditt problem i små bitar. Program är mer modulära som ett resultat. Det är lättare att specificera och skriva en liten funktion som gör en sak än en stor funktion som utför en komplicerad transformation. Små funktioner är också lättare att läsa och att kontrollera om det finns fel.

source: Ease of debugging and testing
sv: Enkel felsökning och testning

source: Testing and debugging a functional-style program is easier.
sv: Det är enklare att testa och felsöka ett program med funktionell stil.

source: Debugging is simplified because functions are generally small and clearly specified. When a program doesn't work, each function is an interface point where you can check that the data are correct. You can look at the intermediate inputs and outputs to quickly isolate the function that's responsible for a bug.
sv: Felsökningen förenklas av att funktionerna i allmänhet är små och tydligt specificerade. När ett program inte fungerar är varje funktion en gränssnittspunkt där du kan kontrollera att data är korrekta. Du kan titta på de mellanliggande in- och utmatningarna för att snabbt isolera den funktion som är ansvarig för en bugg.

source: Testing is easier because each function is a potential subject for a unit test. Functions don't depend on system state that needs to be replicated before running a test; instead you only have to synthesize the right input and then check that the output matches expectations.
sv: Testning är enklare eftersom varje funktion är ett potentiellt objekt för ett enhetstest. Funktionerna är inte beroende av systemtillstånd som måste replikeras innan ett test körs, utan man behöver bara syntetisera rätt indata och sedan kontrollera att utdata motsvarar förväntningarna.

source: Composability
sv: Komposabilitet

source: As you work on a functional-style program, you'll write a number of functions with varying inputs and outputs. Some of these functions will be unavoidably specialized to a particular application, but others will be useful in a wide variety of programs. For example, a function that takes a directory path and returns all the XML files in the directory, or a function that takes a filename and returns its contents, can be applied to many different situations.
sv: När du arbetar med ett funktionellt program kommer du att skriva ett antal funktioner med varierande in- och utgångar. Vissa av dessa funktioner kommer oundvikligen att vara specialiserade för en viss applikation, men andra kommer att vara användbara i en mängd olika program. Till exempel kan en funktion som tar en katalogsökväg och returnerar alla XML-filer i katalogen, eller en funktion som tar ett filnamn och returnerar dess innehåll, användas i många olika situationer.

source: Over time you'll form a personal library of utilities. Often you'll assemble new programs by arranging existing functions in a new configuration and writing a few functions specialized for the current task.
sv: Med tiden kommer du att skapa ett personligt bibliotek med verktyg. Ofta sätter du ihop nya program genom att ordna befintliga funktioner i en ny konfiguration och skriva några funktioner som är specialiserade för den aktuella uppgiften.

source: Iterators
sv: Iteratorer

source: I'll start by looking at a Python language feature that's an important foundation for writing functional-style programs: iterators.
sv: Jag ska börja med att titta på en funktion i Python-språket som är en viktig grund för att skriva program i funktionell stil: iteratorer.

source: An iterator is an object representing a stream of data; this object returns the data one element at a time. A Python iterator must support a method called :meth:`~iterator.__next__` that takes no arguments and always returns the next element of the stream. If there are no more elements in the stream, :meth:`~iterator.__next__` must raise the :exc:`StopIteration` exception. Iterators don't have to be finite, though; it's perfectly reasonable to write an iterator that produces an infinite stream of data.
sv: En iterator är ett objekt som representerar en ström av data; detta objekt returnerar data ett element i taget. En iterator i Python måste stödja en metod som heter :meth:`~iterator.__next__` som inte tar några argument och alltid returnerar nästa element i strömmen. Om det inte finns några fler element i flödet måste :meth:`~iterator.__next__` ge upphov till undantaget :exc:`StopIteration`. Iteratorer behöver dock inte vara ändliga; det är helt rimligt att skriva en iterator som producerar en oändlig ström av data.

source: The built-in :func:`iter` function takes an arbitrary object and tries to return an iterator that will return the object's contents or elements, raising :exc:`TypeError` if the object doesn't support iteration. Several of Python's built-in data types support iteration, the most common being lists and dictionaries. An object is called :term:`iterable` if you can get an iterator for it.
sv: Den inbyggda funktionen :func:`iter` tar ett godtyckligt objekt och försöker returnera en iterator som returnerar objektets innehåll eller element, och ger upphov till :exc:`TypeError` om objektet inte stöder iteration. Flera av Pythons inbyggda datatyper stöder iteration, de vanligaste är listor och ordböcker. Ett objekt kallas :term:`iterable` om du kan få en iterator för det.

source: You can experiment with the iteration interface manually:
sv: Du kan experimentera med iterationsgränssnittet manuellt:

source: Python expects iterable objects in several different contexts, the most important being the :keyword:`for` statement. In the statement ``for X in Y``, Y must be an iterator or some object for which :func:`iter` can create an iterator. These two statements are equivalent::
sv: Python förväntar sig itererbara objekt i flera olika sammanhang, varav det viktigaste är :keyword:`for`-satsen. I uttalandet ``for X in Y`` måste Y vara en iterator eller något objekt för vilket :func:`iter` kan skapa en iterator. Dessa två satser är likvärdiga::

source: for i in iter(obj): print(i) for i in obj: print(i)
sv: för i i iter(obj): print(i) för i i obj: print(i)

source: Iterators can be materialized as lists or tuples by using the :func:`list` or :func:`tuple` constructor functions:
sv: Iteratorer kan materialiseras som listor eller tupler med hjälp av konstruktörsfunktionerna :func:`list` eller :func:`tuple`:

source: Sequence unpacking also supports iterators: if you know an iterator will return N elements, you can unpack them into an N-tuple:
sv: Uppackning av sekvenser stöder även iteratorer: om du vet att en iterator kommer att returnera N element kan du packa upp dem till en N-tupel:

source: Built-in functions such as :func:`max` and :func:`min` can take a single iterator argument and will return the largest or smallest element. The ``"in"`` and ``"not in"`` operators also support iterators: ``X in iterator`` is true if X is found in the stream returned by the iterator. You'll run into obvious problems if the iterator is infinite; :func:`max`, :func:`min` will never return, and if the element X never appears in the stream, the ``"in"`` and ``"not in"`` operators won't return either.
sv: Inbyggda funktioner som :func:`max` och :func:`min` kan ta ett enda iteratorargument och returnerar det största eller minsta elementet. Operatorerna ``"in"`` och ``"not in"`` stöder också iteratorer: ``X i iterator`` är sant om X finns i den ström som returneras av iteratorn. Du kommer att stöta på uppenbara problem om iteratorn är oändlig; :func:`max`, :func:`min` kommer aldrig att returnera, och om elementet X aldrig visas i strömmen kommer operatorerna ``"in"`` och ``"not in"`` inte heller att returnera.

source: Note that you can only go forward in an iterator; there's no way to get the previous element, reset the iterator, or make a copy of it. Iterator objects can optionally provide these additional capabilities, but the iterator protocol only specifies the :meth:`~iterator.__next__` method. Functions may therefore consume all of the iterator's output, and if you need to do something different with the same stream, you'll have to create a new iterator.
sv: Observera att du bara kan gå framåt i en iterator; det finns inget sätt att hämta föregående element, återställa iteratorn eller göra en kopia av den. Iteratorobjekt kan valfritt tillhandahålla dessa ytterligare funktioner, men iteratorprotokollet specificerar endast :meth:`~iterator.__next__`-metoden. Funktioner kan därför konsumera all iteratorns utdata, och om du behöver göra något annat med samma ström måste du skapa en ny iterator.

source: Data Types That Support Iterators
sv: Datatyper som stöder iteratorer

source: We've already seen how lists and tuples support iterators. In fact, any Python sequence type, such as strings, will automatically support creation of an iterator.
sv: Vi har redan sett hur listor och tupler stöder iteratorer. Faktum är att alla Python-sekvenstyper, till exempel strängar, automatiskt stöder skapandet av en iterator.

source: Calling :func:`iter` on a dictionary returns an iterator that will loop over the dictionary's keys::
sv: Om du anropar :func:`iter` på en ordbok returneras en iterator som loopar över ordbokens nycklar::
