Repository: yeager/python-docs-sv
Catalog: howto/instrumentation.po
Languages: sv

source: Instrumenting CPython with DTrace and SystemTap
sv: Instrumentering av CPython med DTrace och SystemTap

source: author
sv: författare

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
sv: DTrace och SystemTap är övervakningsverktyg som var och en ger möjlighet att inspektera vad processerna i ett datorsystem gör. De använder båda domänspecifika språk som gör det möjligt för en användare att skriva skript som:

source: filter which processes are to be observed
sv: filtrera vilka processer som ska följas

source: gather data from the processes of interest
sv: samla in data från de processer som är av intresse

source: generate reports on the data
sv: generera rapporter om data

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
sv: Från och med Python 3.6 kan CPython byggas med inbäddade "markörer", även kända som "prober", som kan observeras av ett DTrace- eller SystemTap-skript, vilket gör det lättare att övervaka vad CPython-processerna på ett system gör.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
sv: DTrace-markörer är implementeringsdetaljer i CPython-tolken. Inga garantier ges om kompatibilitet mellan olika versioner av CPython. DTrace-skript kan sluta fungera eller fungera felaktigt utan förvarning när CPython-versioner ändras.

source: Enabling the static markers
sv: Aktivering av statiska markörer

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
sv: macOS kommer med inbyggt stöd för DTrace. På Linux måste SystemTap-utvecklingsverktygen installeras för att CPython ska kunna byggas med de inbäddade markörerna för SystemTap.

source: On a Linux machine, this can be done via::
sv: På en Linux-maskin kan detta göras via::

source: or::
sv: eller::

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
sv: CPython måste då :option:`konfigureras med alternativet --with-dtrace <--with-dtrace>`:

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
sv: På macOS kan du lista tillgängliga DTrace-prober genom att köra en Python-process i bakgrunden och lista alla prober som görs tillgängliga av Python-providern::

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
sv: På Linux kan du kontrollera om de statiska SystemTap-markörerna finns i den inbyggda binärfilen genom att se om den innehåller ett avsnitt ".note.stapsdt".

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
sv: Om du har byggt Python som ett delat bibliotek (med konfigurationsalternativet :option:`--enable-shared`) måste du istället leta inom det delade biblioteket. Till exempel::

source: Sufficiently modern readelf can print the metadata::
sv: Tillräckligt modern readelf kan skriva ut metadata::

source: The above metadata contains information for SystemTap describing how it can patch strategically placed machine code instructions to enable the tracing hooks used by a SystemTap script.
sv: Ovanstående metadata innehåller information för SystemTap som beskriver hur det kan patcha strategiskt placerade maskinkodinstruktioner för att aktivera de spårningskrokar som används av ett SystemTap-skript.

source: Static DTrace probes
sv: Statiska DTrace-prober

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
sv: Följande exempel på DTrace-skript kan användas för att visa anrops-/returhierarkin i ett Python-skript, med spårning endast inom anropet av en funktion som heter "start". Med andra ord kommer inte anrop av importfunktioner att listas:

source: It can be invoked like this::
sv: Den kan anropas på följande sätt::

source: The output looks like this:
sv: Utmatningen ser ut så här:

source: Static SystemTap markers
sv: Statiskt systemTap-markörer

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
sv: Lågnivåmetoden för att använda SystemTap-integrationen är att använda de statiska markörerna direkt. Detta kräver att du uttryckligen anger den binära fil som innehåller dem.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
sv: Detta SystemTap-skript kan t.ex. användas för att visa Call/Return-hierarkin i ett Python-skript:

source: where the columns are:
sv: där kolumnerna är:

source: time in microseconds since start of script
sv: tid i mikrosekunder sedan skriptets start

source: name of executable
sv: namn på körbar fil

source: PID of process
sv: PID för process

source: and the remainder indicates the call/return hierarchy as the script executes.
sv: och resten visar hierarkin för anrop/retur när skriptet körs.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
sv: För en :option:`--enable-shared`-byggnad av CPython finns markörerna i det delade biblioteket libpython, och probens prickade sökväg måste återspegla detta. Till exempel den här raden från exemplet ovan:

source: should instead read:
sv: bör istället lyda:

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
sv: (antar en :ref:`debug build <debug-build>` av CPython 3.6)

source: Available static markers
sv: Tillgängliga statiska markörer

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
sv: Denna markör anger att exekveringen av en Python-funktion har påbörjats. Den utlöses endast för rena Python-funktioner (bytecode).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
sv: Filnamnet, funktionsnamnet och radnumret skickas tillbaka till spårningsskriptet som positionella argument, som måste nås med hjälp av ``$arg1``, ``$arg2``, ``$arg3``:

source: ``$arg1`` : ``(const char *)`` filename, accessible using ``user_string($arg1)``
sv: ``$arg1`` : ``(const char *)`` filnamn, tillgängligt med ``user_string($arg1)``

source: ``$arg2`` : ``(const char *)`` function name, accessible using ``user_string($arg2)``
sv: ``$arg2`` : ``(const char *)`` funktionsnamn, tillgängligt med ``user_string($arg2)``

source: ``$arg3`` : ``int`` line number
sv: ``$arg3`` : ``int`` radnummer

source: This marker is the converse of :c:func:`!function__entry`, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
sv: Denna markör är motsatsen till :c:func:`!function__entry` och anger att exekveringen av en Python-funktion har avslutats (antingen via ``return`` eller via ett undantag). Den utlöses endast för rena Python-funktioner (bytecode).

source: The arguments are the same as for :c:func:`!function__entry`
sv: Argumenten är desamma som för :c:func:`!function__entry`

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
sv: Denna markör indikerar att en Python-rad är på väg att exekveras. Det motsvarar spårning rad för rad med en Python-profilerare. Den utlöses inte inom C-funktioner.

source: The arguments are the same as for :c:func:`!function__entry`.
sv: Argumenten är desamma som för :c:func:`!function__entry`.

source: Fires when the Python interpreter starts a garbage collection cycle. ``arg0`` is the generation to scan, like :func:`gc.collect`.
sv: Utlöses när Python-tolken startar en skräpinsamlingscykel. ``arg0`` är den generation som ska skannas, som :func:`gc.collect`.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
sv: Utlöses när Python-tolken avslutar en garbage collection-cykel. ``arg0`` är antalet insamlade objekt.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
sv: Startas innan :mod:`importlib` försöker hitta och ladda modulen. ``arg0`` är modulens namn.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
sv: Startas efter att :mod:`importlib`'s find_and_load-funktion har anropats. ``arg0`` är modulnamnet, ``arg1`` indikerar om modulen laddades framgångsrikt.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
sv: Startar när :func:`sys.audit` eller :c:func:`PySys_Audit` anropas. ``arg0`` är händelsens namn som C-sträng, ``arg1`` är en :c:type:`PyObject`-pekare till ett tuple-objekt.

source: SystemTap Tapsets
sv: SystemTap Kranar

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
sv: Det mer avancerade sättet att använda SystemTap-integrationen är att använda ett "tapset": SystemTaps motsvarighet till ett bibliotek, som döljer några av de statiska markörernas detaljer på lägre nivå.

source: Here is a tapset file, based on a non-shared build of CPython:
sv: Här är en tapset-fil, baserad på en icke-delad version av CPython:

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
sv: Om den här filen installeras i SystemTaps tapset-katalog (t.ex. ``/usr/share/systemtap/tapset``) blir dessa ytterligare probepoints tillgängliga:

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
sv: Denna probepunkt indikerar att exekveringen av en Python-funktion har påbörjats. Den utlöses endast för rena Python-funktioner (bytecode).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
sv: Denna probepunkt är motsatsen till ``python.function.return`` och anger att exekveringen av en Python-funktion har avslutats (antingen via ``return`` eller via ett undantag). Den utlöses endast för rena Python-funktioner (bytecode).

source: Examples
sv: Exempel

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
sv: Detta SystemTap-skript använder tapset ovan för att på ett renare sätt implementera exemplet ovan med spårning av Pythons funktionsanropshierarki, utan att direkt behöva namnge de statiska markörerna:

source: The following script uses the tapset above to provide a top-like view of all running CPython code, showing the top 20 most frequently entered bytecode frames, each second, across the whole system:
sv: Följande skript använder tapset ovan för att ge en toppliknande vy över all CPython-kod som körs och visar de 20 mest frekvent inmatade bytekodsramarna varje sekund i hela systemet:
