Repository: yeager/python-docs-sv
Catalog: howto/ipaddress.po
Languages: sv

source: An introduction to the ipaddress module
sv: En introduktion till modulen ipaddress

source: author
sv: författare

source: Overview
sv: Översikt

source: This document aims to provide a gentle introduction to the :mod:`ipaddress` module. It is aimed primarily at users that aren't already familiar with IP networking terminology, but may also be useful to network engineers wanting an overview of how :mod:`ipaddress` represents IP network addressing concepts.
sv: Detta dokument syftar till att ge en lättfattlig introduktion till modulen :mod:`ipaddress`. Det riktar sig främst till användare som inte redan är bekanta med terminologin för IP-nätverk, men kan också vara användbart för nätverksingenjörer som vill ha en översikt över hur :mod:`ipaddress` representerar koncept för IP-nätverksadressering.

source: Creating Address/Network/Interface objects
sv: Skapa Adress/Nätverk/Interface-objekt

source: Since :mod:`ipaddress` is a module for inspecting and manipulating IP addresses, the first thing you'll want to do is create some objects. You can use :mod:`ipaddress` to create objects from strings and integers.
sv: Eftersom :mod:`ipaddress` är en modul för att inspektera och manipulera IP-adresser är det första du behöver göra att skapa några objekt. Du kan använda :mod:`ipaddress` för att skapa objekt från strängar och heltal.

source: A Note on IP Versions
sv: En anmärkning om IP-versioner

source: For readers that aren't particularly familiar with IP addressing, it's important to know that the Internet Protocol (IP) is currently in the process of moving from version 4 of the protocol to version 6. This transition is occurring largely because version 4 of the protocol doesn't provide enough addresses to handle the needs of the whole world, especially given the increasing number of devices with direct connections to the internet.
sv: För läsare som inte är särskilt bekanta med IP-adressering är det viktigt att veta att Internetprotokollet (IP) för närvarande håller på att övergå från version 4 av protokollet till version 6. Denna övergång sker till stor del på grund av att version 4 av protokollet inte ger tillräckligt med adresser för att hantera hela världens behov, särskilt med tanke på det ökande antalet enheter med direktanslutningar till internet.

source: Explaining the details of the differences between the two versions of the protocol is beyond the scope of this introduction, but readers need to at least be aware that these two versions exist, and it will sometimes be necessary to force the use of one version or the other.
sv: Att förklara detaljerna i skillnaderna mellan de två versionerna av protokollet ligger utanför ramen för denna introduktion, men läsarna måste åtminstone vara medvetna om att dessa två versioner finns, och det kommer ibland att bli nödvändigt att tvinga fram användningen av den ena eller den andra versionen.

source: IP Host Addresses
sv: IP-värdadresser

source: Addresses, often referred to as "host addresses" are the most basic unit when working with IP addressing. The simplest way to create addresses is to use the :func:`ipaddress.ip_address` factory function, which automatically determines whether to create an IPv4 or IPv6 address based on the passed in value:
sv: Adresser, som ofta kallas "värdadresser", är den mest grundläggande enheten när man arbetar med IP-adressering. Det enklaste sättet att skapa adresser är att använda fabriksfunktionen :func:`ipaddress.ip_address`, som automatiskt avgör om en IPv4- eller IPv6-adress ska skapas baserat på det värde som skickas in:

source: Addresses can also be created directly from integers. Values that will fit within 32 bits are assumed to be IPv4 addresses::
sv: Adresser kan också skapas direkt från heltal. Värden som ryms inom 32 bitar antas vara IPv4-adresser::

source: To force the use of IPv4 or IPv6 addresses, the relevant classes can be invoked directly. This is particularly useful to force creation of IPv6 addresses for small integers::
sv: För att tvinga fram användning av IPv4- eller IPv6-adresser kan de relevanta klasserna anropas direkt. Detta är särskilt användbart för att tvinga fram skapandet av IPv6-adresser för små heltal::

source: >>> ipaddress.ip_address(1) IPv4Address('0.0.0.1') >>> ipaddress.IPv4Address(1) IPv4Address('0.0.0.1') >>> ipaddress.IPv6Address(1) IPv6Address('::1')
sv: >>> ipadress.ip_address(1) IPv4Address('0.0.0.1') >>> ipaddress.IPv4Address(1) IPv4Address('0.0.0.1') >>> ipaddress.IPv6Address(1) IPv6Address('::1')

source: Defining Networks
sv: Definiera nätverk

source: Host addresses are usually grouped together into IP networks, so :mod:`ipaddress` provides a way to create, inspect and manipulate network definitions. IP network objects are constructed from strings that define the range of host addresses that are part of that network. The simplest form for that information is a "network address/network prefix" pair, where the prefix defines the number of leading bits that are compared to determine whether or not an address is part of the network and the network address defines the expected value of those bits.
sv: Värdadresser grupperas vanligtvis i IP-nätverk, så :mod:`ipaddress` ger ett sätt att skapa, inspektera och manipulera nätverksdefinitioner. IP-nätverksobjekt konstrueras av strängar som definierar det intervall av värdadresser som ingår i nätverket. Den enklaste formen för denna information är ett par "nätverksadress/nätverksprefix", där prefixet definierar antalet ledande bitar som jämförs för att avgöra om en adress ingår i nätverket eller inte och nätverksadressen definierar det förväntade värdet för dessa bitar.

source: As for addresses, a factory function is provided that determines the correct IP version automatically::
sv: När det gäller adresser finns det en fabriksfunktion som automatiskt bestämmer rätt IP-version::

source: >>> ipaddress.ip_network('192.0.2.0/24') IPv4Network('192.0.2.0/24') >>> ipaddress.ip_network('2001:db8::0/96') IPv6Network('2001:db8::/96')
sv: >>> ipaddress.ip_nätverk('192.0.2.0/24') IPv4Network('192.0.2.0/24') >>> ipaddress.ip_nätverk('2001:db8::0/96') IPv6Nätverk('2001:db8::/96')

source: Network objects cannot have any host bits set. The practical effect of this is that ``192.0.2.1/24`` does not describe a network. Such definitions are referred to as interface objects since the ip-on-a-network notation is commonly used to describe network interfaces of a computer on a given network and are described further in the next section.
sv: Nätverksobjekt kan inte ha några host-bitar inställda. Den praktiska effekten av detta är att ``192.0.2.1/24`` inte beskriver ett nätverk. Sådana definitioner kallas interface-objekt eftersom notationen ip-on-a-network vanligen används för att beskriva nätverksgränssnitt för en dator i ett visst nätverk och beskrivs närmare i nästa avsnitt.

source: By default, attempting to create a network object with host bits set will result in :exc:`ValueError` being raised. To request that the additional bits instead be coerced to zero, the flag ``strict=False`` can be passed to the constructor::
sv: Som standard kommer försök att skapa ett nätverksobjekt med host-bitar inställda att resultera i :exc:`ValueError`. För att begära att de extra bitarna istället ska tvingas till noll, kan flaggan ``strict=False`` skickas till konstruktören::

source: >>> ipaddress.ip_network('192.0.2.1/24') Traceback (most recent call last): ... ValueError: 192.0.2.1/24 has host bits set >>> ipaddress.ip_network('192.0.2.1/24', strict=False) IPv4Network('192.0.2.0/24')
sv: >>> ipadress.ip_nätverk('192.0.2.1/24') Traceback (senaste anropet senast): ... ValueError (Värdefel): 192.0.2.1/24 har värdbitar inställda >>> ipaddress.ip_nätverk('192.0.2.1/24', strict=False) IPv4Network('192.0.2.0/24')

source: While the string form offers significantly more flexibility, networks can also be defined with integers, just like host addresses. In this case, the network is considered to contain only the single address identified by the integer, so the network prefix includes the entire network address::
sv: Även om strängformen ger betydligt större flexibilitet kan nätverk också definieras med heltal, precis som värdadresser. I det här fallet anses nätverket endast innehålla den enda adress som identifieras av heltalet, så nätverksprefixet innehåller hela nätverksadressen::

source: As with addresses, creation of a particular kind of network can be forced by calling the class constructor directly instead of using the factory function.
sv: Precis som med adresser kan skapandet av en viss typ av nätverk tvingas fram genom att anropa klassens konstruktör direkt i stället för att använda fabriksfunktionen.

source: Host Interfaces
sv: Host-gränssnitt

source: As mentioned just above, if you need to describe an address on a particular network, neither the address nor the network classes are sufficient. Notation like ``192.0.2.1/24`` is commonly used by network engineers and the people who write tools for firewalls and routers as shorthand for "the host ``192.0.2.1`` on the network ``192.0.2.0/24``", Accordingly, :mod:`ipaddress` provides a set of hybrid classes that associate an address with a particular network. The interface for creation is identical to that for defining network objects, except that the address portion isn't constrained to being a network address.
sv: Som nämnts ovan räcker det inte med vare sig adressen eller nätverksklasserna om du behöver beskriva en adress i ett visst nätverk. Notation som ``192.0.2.1/24`` används ofta av nätverksingenjörer och de människor som skriver verktyg för brandväggar och routrar som kortform för "värden ``192.0.2.1`` på nätverket ``192.0.2.0/24``", Följaktligen tillhandahåller :mod:`ipaddress` en uppsättning hybridklasser som associerar en adress med ett visst nätverk. Gränssnittet för skapande är identiskt med det för definition av nätverksobjekt, förutom att adressdelen inte är begränsad till att vara en nätverksadress.

source: Integer inputs are accepted (as with networks), and use of a particular IP version can be forced by calling the relevant constructor directly.
sv: Inmatning av heltal accepteras (som med nätverk), och användning av en viss IP-version kan tvingas fram genom att anropa den relevanta konstruktören direkt.

source: Inspecting Address/Network/Interface Objects
sv: Inspektera objekt för adress/nätverk/gränssnitt

source: You've gone to the trouble of creating an IPv(4|6)(Address|Network|Interface) object, so you probably want to get information about it. :mod:`ipaddress` tries to make doing this easy and intuitive.
sv: Du har gjort dig besväret att skapa ett IPv(4|6)(Address|Network|Interface)-objekt, så du vill förmodligen få information om det. :mod:`ipaddress` försöker göra detta enkelt och intuitivt.

source: Extracting the IP version::
sv: Extrahering av IP-versionen::

source: Obtaining the network from an interface::
sv: Hämta nätverket från ett gränssnitt::

source: >>> host4 = ipaddress.ip_interface('192.0.2.1/24') >>> host4.network IPv4Network('192.0.2.0/24') >>> host6 = ipaddress.ip_interface('2001:db8::1/96') >>> host6.network IPv6Network('2001:db8::/96')
sv: >>> host4 = ipaddress.ip_interface('192.0.2.1/24') >>> host4.nätverk IPv4Network('192.0.2.0/24') >>> host6 = ipaddress.ip_interface('2001:db8::1/96') >>> host6.nätverk IPv6-nätverk('2001:db8::/96')

source: Finding out how many individual addresses are in a network::
sv: Ta reda på hur många individuella adresser det finns i ett nätverk::

source: >>> net4 = ipaddress.ip_network('192.0.2.0/24') >>> net4.num_addresses 256 >>> net6 = ipaddress.ip_network('2001:db8::0/96') >>> net6.num_addresses 4294967296
sv: >>> net4 = ipaddress.ip_nätverk('192.0.2.0/24') >>> net4.antal_adresser 256 >>> net6 = ipadress.ip_nätverk('2001:db8::0/96') >>> net6.antal_adresser 4294967296

source: Iterating through the "usable" addresses on a network::
sv: Iterering genom de "användbara" adresserna i ett nätverk::

source: >>> net4 = ipaddress.ip_network('192.0.2.0/24') >>> for x in net4.hosts(): ... print(x) 192.0.2.1 192.0.2.2 192.0.2.3 192.0.2.4 ... 192.0.2.252 192.0.2.253 192.0.2.254
sv: >>> net4 = ipaddress.ip_nätverk('192.0.2.0/24') >>> för x i net4.hosts(): ... print(x) 192.0.2.1 192.0.2.2 192.0.2.3 192.0.2.4 ... 192.0.2.252 192.0.2.253 192.0.2.254

source: Obtaining the netmask (i.e. set bits corresponding to the network prefix) or the hostmask (any bits that are not part of the netmask):
sv: Skaffa nätmasken (dvs. ställa in bitar som motsvarar nätverksprefixet) eller värdmasken (alla bitar som inte ingår i nätmasken):

source: Exploding or compressing the address::
sv: Sprängning eller komprimering av adressen::

source: >>> addr6.exploded '2001:0db8:0000:0000:0000:0000:0000:0001' >>> addr6.compressed '2001:db8::1' >>> net6.exploded '2001:0db8:0000:0000:0000:0000:0000:0000/96' >>> net6.compressed '2001:db8::/96'
sv: >>> addr6.exploded '2001:0db8:0000:0000:0000:0000:0000:0001' >>> addr6.komprimerad '2001:db8::1' >>> net6.exploded '2001:0db8:0000:0000:0000:0000:0000:0000/96' >>> net6.compressed '2001:db8::/96'

source: While IPv4 doesn't support explosion or compression, the associated objects still provide the relevant properties so that version neutral code can easily ensure the most concise or most verbose form is used for IPv6 addresses while still correctly handling IPv4 addresses.
sv: Även om IPv4 inte stöder explosion eller komprimering tillhandahåller de associerade objekten fortfarande de relevanta egenskaperna så att versionsneutral kod enkelt kan säkerställa att den mest kortfattade eller mest utförliga formen används för IPv6-adresser samtidigt som IPv4-adresser hanteras korrekt.

source: Networks as lists of Addresses
sv: Nätverk som adresslistor

source: It's sometimes useful to treat networks as lists. This means it is possible to index them like this::
sv: Det är ibland användbart att behandla nätverk som listor. Detta innebär att det är möjligt att indexera dem så här::

source: It also means that network objects lend themselves to using the list membership test syntax like this::
sv: Det innebär också att nätverksobjekt lämpar sig för att använda syntaxen för list membership test på följande sätt::

source: if address in network: # do something
sv: om adress i nätverk: # gör något

source: Containment testing is done efficiently based on the network prefix::
sv: Containment-testning görs effektivt baserat på nätverksprefixet::

source: >>> addr4 = ipaddress.ip_address('192.0.2.1') >>> addr4 in ipaddress.ip_network('192.0.2.0/24') True >>> addr4 in ipaddress.ip_network('192.0.3.0/24') False
sv: >>> addr4 = ipaddress.ip_address('192.0.2.1') >>> addr4 i ipaddress.ip_nätverk('192.0.2.0/24') Sant >>> addr4 i ipaddress.ip_network('192.0.3.0/24') False

source: Comparisons
sv: Jämförelser

source: :mod:`ipaddress` provides some simple, hopefully intuitive ways to compare objects, where it makes sense::
sv: :mod:`ipaddress` ger några enkla, förhoppningsvis intuitiva sätt att jämföra objekt, där det är meningsfullt::

source: >>> ipaddress.ip_address('192.0.2.1') < ipaddress.ip_address('192.0.2.2') True
sv: >>> ipaddress.ip_address('192.0.2.1') < ipaddress.ip_address('192.0.2.2') Sann

source: A :exc:`TypeError` exception is raised if you try to compare objects of different versions or different types.
sv: Ett :exc:`TypeError`-undantag uppstår om du försöker jämföra objekt av olika versioner eller olika typer.

source: Using IP Addresses with other modules
sv: Använda IP-adresser med andra moduler

source: Other modules that use IP addresses (such as :mod:`socket`) usually won't accept objects from this module directly. Instead, they must be coerced to an integer or string that the other module will accept::
sv: Andra moduler som använder IP-adresser (t.ex. :mod:`socket`) accepterar vanligtvis inte objekt från den här modulen direkt. Istället måste de omvandlas till ett heltal eller en sträng som den andra modulen accepterar::

source: Getting more detail when instance creation fails
sv: Få mer information när skapandet av en instans misslyckas

source: When creating address/network/interface objects using the version-agnostic factory functions, any errors will be reported as :exc:`ValueError` with a generic error message that simply says the passed in value was not recognized as an object of that type. The lack of a specific error is because it's necessary to know whether the value is *supposed* to be IPv4 or IPv6 in order to provide more detail on why it has been rejected.
sv: När du skapar adress/nätverks/interface-objekt med hjälp av de versionsagnostiska fabriksfunktionerna kommer eventuella fel att rapporteras som :exc:`ValueError` med ett generiskt felmeddelande som helt enkelt säger att det inmatade värdet inte identifierades som ett objekt av den typen. Att det inte finns något specifikt fel beror på att det är nödvändigt att veta om värdet *förutsätts* vara IPv4 eller IPv6 för att kunna ge mer information om varför det har avvisats.

source: To support use cases where it is useful to have access to this additional detail, the individual class constructors actually raise the :exc:`ValueError` subclasses :exc:`ipaddress.AddressValueError` and :exc:`ipaddress.NetmaskValueError` to indicate exactly which part of the definition failed to parse correctly.
sv: För att stödja användningsfall där det är användbart att ha tillgång till denna ytterligare detalj, ger de enskilda klasskonstruktörerna faktiskt upphov till underklasserna :exc:`ValueError` :exc:`ipaddress.AddressValueError` och :exc:`ipaddress.NetmaskValueError` för att ange exakt vilken del av definitionen som inte analyserades korrekt.

source: The error messages are significantly more detailed when using the class constructors directly. For example::
sv: Felmeddelandena är betydligt mer detaljerade när man använder klasskonstruktörerna direkt. Till exempel::

source: >>> ipaddress.ip_address("192.168.0.256") Traceback (most recent call last): ... ValueError: '192.168.0.256' does not appear to be an IPv4 or IPv6 address >>> ipaddress.IPv4Address("192.168.0.256") Traceback (most recent call last): ... ipaddress.AddressValueError: Octet 256 (> 255) not permitted in '192.168.0.256' >>> ipaddress.ip_network("192.168.0.1/64") Traceback (most recent call last): ... ValueError: '192.168.0.1/64' does not appear to be an IPv4 or IPv6 network >>> ipaddress.IPv4Network("192.168.0.1/64") Traceback (most recent call last): ... ipaddress.NetmaskValueError: '64' is not a valid netmask
sv: >>> ipaddress.ip_address("192.168.0.256") Traceback (senaste anropet senast): ... ValueError: '192.168.0.256' verkar inte vara en IPv4- eller IPv6-adress >>> ipaddress.IPv4Address("192.168.0.256") Återkoppling (senaste anropet senast): ... ipaddress.AddressValueError (Adressvärdefel): Oktett 256 (> 255) är inte tillåtet i '192.168.0.256' >>> ipaddress.ip_network("192.168.0.1/64") Traceback (senaste anropet senast): ... ValueError: '192.168.0.1/64' verkar inte vara ett IPv4- eller IPv6-nätverk >>> ipaddress.IPv4Network("192.168.0.1/64") Återkoppling (senaste anropet senast): ... ipaddress.NetmaskValueError: '64' är inte en giltig nätmask

source: However, both of the module specific exceptions have :exc:`ValueError` as their parent class, so if you're not concerned with the particular type of error, you can still write code like the following::
sv: Båda de modulspecifika undantagen har dock :exc:`ValueError` som sin överordnade klass, så om du inte är intresserad av den specifika typen av fel kan du fortfarande skriva kod som följande::

source: try: network = ipaddress.IPv4Network(address) except ValueError: print('address/netmask is invalid for IPv4:', address)
sv: prova: network = ipaddress.IPv4Network(address) except ValueError: print('adress/nätmask är ogiltig för IPv4:', adress)
