Repository: yeager/python-docs-sv
Catalog: howto/isolating-extensions.po
Languages: sv

source: Isolating Extension Modules
sv: Isolering av tilläggsmoduler

source: Abstract
sv: Abstrakt

source: Traditionally, state belonging to Python extension modules was kept in C ``static`` variables, which have process-wide scope. This document describes problems of such per-process state and shows a safer way: per-module state.
sv: Traditionellt har tillstånd som tillhör Python-tilläggsmoduler förvarats i C ``static``-variabler, som har processomfattande räckvidd. Det här dokumentet beskriver problemen med sådan per-processstatus och visar ett säkrare sätt: per-modulstatus.

source: The document also describes how to switch to per-module state where possible. This transition involves allocating space for that state, potentially switching from static types to heap types, and—perhaps most importantly—accessing per-module state from code.
sv: Dokumentet beskriver också hur man kan byta till per-modulstatus där det är möjligt. Denna övergång innebär att man allokerar utrymme för tillståndet, eventuellt byter från statiska typer till heap-typer och - kanske viktigast av allt - att man får tillgång till per-modul-tillstånd från koden.

source: Who should read this
sv: Vem bör läsa detta

source: This guide is written for maintainers of :ref:`C-API <c-api-index>` extensions who would like to make that extension safer to use in applications where Python itself is used as a library.
sv: Den här guiden är skriven för underhållare av :ref:`C-API <c-api-index>`-tillägg som vill göra det tillägget säkrare att använda i applikationer där Python självt används som ett bibliotek.

source: Background
sv: Bakgrund

source: An *interpreter* is the context in which Python code runs. It contains configuration (e.g. the import path) and runtime state (e.g. the set of imported modules).
sv: En *tolk* är det sammanhang i vilket Python-koden körs. Den innehåller konfiguration (t.ex. importsökvägen) och runtime-tillstånd (t.ex. uppsättningen importerade moduler).

source: Python supports running multiple interpreters in one process. There are two cases to think about—users may run interpreters:
sv: Python stöder körning av flera tolkar i en process. Det finns två fall att tänka på - användare kan köra tolkar:

source: in sequence, with several :c:func:`Py_InitializeEx`/:c:func:`Py_FinalizeEx` cycles, and
sv: i följd, med flera :c:func:`Py_InitializeEx`/:c:func:`Py_FinalizeEx`-cykler, och

source: in parallel, managing "sub-interpreters" using :c:func:`Py_NewInterpreter`/:c:func:`Py_EndInterpreter`.
sv: parallellt och hanterar "undertolkare" med hjälp av :c:func:`Py_NewInterpreter`/:c:func:`Py_EndInterpreter`.

source: Both cases (and combinations of them) would be most useful when embedding Python within a library. Libraries generally shouldn't make assumptions about the application that uses them, which include assuming a process-wide "main Python interpreter".
sv: Båda fallen (och kombinationer av dem) skulle vara mest användbara när Python bäddas in i ett bibliotek. Bibliotek bör i allmänhet inte göra antaganden om den applikation som använder dem, vilket inkluderar att anta en processomfattande "huvud-Python-tolk".

source: Historically, Python extension modules don't handle this use case well. Many extension modules (and even some stdlib modules) use *per-process* global state, because C ``static`` variables are extremely easy to use. Thus, data that should be specific to an interpreter ends up being shared between interpreters. Unless the extension developer is careful, it is very easy to introduce edge cases that lead to crashes when a module is loaded in more than one interpreter in the same process.
sv: Historiskt sett har Pythons tilläggsmoduler inte hanterat detta användningsfall väl. Många tilläggsmoduler (och till och med vissa stdlib-moduler) använder *per-process* globalt tillstånd, eftersom C ``statiska`` variabler är extremt lätta att använda. Således delas data som borde vara specifika för en tolk i slutändan mellan tolkarna. Om inte tilläggsutvecklaren är försiktig är det mycket lätt att införa kantfall som leder till krascher när en modul laddas i mer än en tolk i samma process.

source: Unfortunately, *per-interpreter* state is not easy to achieve. Extension authors tend to not keep multiple interpreters in mind when developing, and it is currently cumbersome to test the behavior.
sv: Tyvärr är det inte lätt att uppnå *per-tolk*-tillstånd. Författarna till tillägg tenderar att inte ha flera tolkar i åtanke när de utvecklar, och det är för närvarande besvärligt att testa beteendet.

source: Enter Per-Module State
sv: Ange tillstånd per modul

source: Instead of focusing on per-interpreter state, Python's C API is evolving to better support the more granular *per-module* state. This means that C-level data should be attached to a *module object*. Each interpreter creates its own module object, keeping the data separate. For testing the isolation, multiple module objects corresponding to a single extension can even be loaded in a single interpreter.
sv: Istället för att fokusera på tillstånd per tolk utvecklas Pythons C API för att bättre stödja det mer granulerade *per-modul*-tillståndet. Detta innebär att data på C-nivå bör kopplas till ett *modulobjekt*. Varje tolk skapar sitt eget modulobjekt och håller data åtskilda. För att testa isoleringen kan flera modulobjekt som motsvarar ett enda tillägg till och med laddas i en enda tolk.

source: Per-module state provides an easy way to think about lifetime and resource ownership: the extension module will initialize when a module object is created, and clean up when it's freed. In this regard, a module is just like any other :c:expr:`PyObject *`; there are no "on interpreter shutdown" hooks to think—or forget—about.
sv: Per-modulstatus ger ett enkelt sätt att tänka på livstid och resursägande: tilläggsmodulen initieras när ett modulobjekt skapas och städas upp när det frigörs. I det här avseendet är en modul precis som alla andra :c:expr:`PyObject *`; det finns inga "on interpreter shutdown"-krokar att tänka på - eller glömma bort.

source: Note that there are use cases for different kinds of "globals": per-process, per-interpreter, per-thread or per-task state. With per-module state as the default, these are still possible, but you should treat them as exceptional cases: if you need them, you should give them additional care and testing. (Note that this guide does not cover them.)
sv: Observera att det finns användningsområden för olika typer av "globaler": per-process-, per-tolk-, per-tråd- eller per-task-tillstånd. Med per-modul-tillstånd som standard är dessa fortfarande möjliga, men du bör behandla dem som undantagsfall: om du behöver dem bör du ge dem extra omsorg och testning. (Observera att den här guiden inte täcker dem)

source: Isolated Module Objects
sv: Isolerade modulobjekt

source: The key point to keep in mind when developing an extension module is that several module objects can be created from a single shared library. For example:
sv: Det som är viktigt att tänka på när man utvecklar en tilläggsmodul är att flera modulobjekt kan skapas från ett enda delat bibliotek. Till exempel

source: As a rule of thumb, the two modules should be completely independent. All objects and state specific to the module should be encapsulated within the module object, not shared with other module objects, and cleaned up when the module object is deallocated. Since this just is a rule of thumb, exceptions are possible (see `Managing Global State`_), but they will need more thought and attention to edge cases.
sv: En tumregel är att de två modulerna ska vara helt oberoende av varandra. Alla objekt och tillstånd som är specifika för modulen ska vara inkapslade i modulobjektet, inte delas med andra modulobjekt och rensas upp när modulobjektet avallokeras. Eftersom detta bara är en tumregel är undantag möjliga (se `Managing Global State`_), men de kommer att kräva mer eftertanke och uppmärksamhet på kantfall.

source: While some modules could do with less stringent restrictions, isolated modules make it easier to set clear expectations and guidelines that work across a variety of use cases.
sv: Även om vissa moduler skulle kunna klara sig med mindre stränga restriktioner, gör isolerade moduler det lättare att fastställa tydliga förväntningar och riktlinjer som fungerar i en mängd olika användningsfall.

source: Surprising Edge Cases
sv: Överraskande specialfall

source: Note that isolated modules do create some surprising edge cases. Most notably, each module object will typically not share its classes and exceptions with other similar modules. Continuing from the `example above <Isolated Module Objects_>`__, note that ``old_binascii.Error`` and ``binascii.Error`` are separate objects. In the following code, the exception is *not* caught:
sv: Observera att isolerade moduler skapar en del överraskande marginalfall. Framför allt kommer varje modulobjekt vanligtvis inte att dela sina klasser och undantag med andra liknande moduler. Fortsätt från `exemplet ovan <Isolated Module Objects_>`__, notera att ``old_binascii.Error`` och ``binascii.Error`` är separata objekt. I följande kod fångas undantaget *inte* upp:

source: >>> old_binascii.Error == binascii.Error False >>> try: ... old_binascii.unhexlify(b'qwertyuiop') ... except binascii.Error: ... print('boo') ... Traceback (most recent call last): File "<stdin>", line 2, in <module> binascii.Error: Non-hexadecimal digit found
sv: &gt;&gt;&gt; old_binascii.Error == binascii.Error Falskt &gt;&gt;&gt; försök: ... old_binascii.unhexlify(b'qwertyuiop') ... utom binascii.Error: ... print('boo') ... Traceback (senaste anropet senast): Fil "<stdin>", rad 2, i <module> binascii.fel: Icke-hexadecimal siffra hittades

source: This is expected. Notice that pure-Python modules behave the same way: it is a part of how Python works.
sv: Detta är förväntat. Lägg märke till att rena Python-moduler beter sig på samma sätt: det är en del av hur Python fungerar.

source: The goal is to make extension modules safe at the C level, not to make hacks behave intuitively. Mutating ``sys.modules`` "manually" counts as a hack.
sv: Målet är att göra tilläggsmoduler säkra på C-nivå, inte att få hack att bete sig intuitivt. Att mutera ``sys.modules`` "manuellt" räknas som ett hack.

source: Making Modules Safe with Multiple Interpreters
sv: Säkra moduler med flera tolkar

source: Managing Global State
sv: Att hantera den globala staten

source: Sometimes, the state associated with a Python module is not specific to that module, but to the entire process (or something else "more global" than a module). For example:
sv: Ibland är det tillstånd som är kopplat till en Python-modul inte specifikt för den modulen, utan för hela processen (eller något annat "mer globalt" än en modul). Ett exempel:

source: The ``readline`` module manages *the* terminal.
sv: Modulen ``readline`` hanterar *terminalen*.

source: A module running on a circuit board wants to control *the* on-board LED.
sv: En modul som körs på ett kretskort vill styra *den* inbyggda LED-lampan.

source: In these cases, the Python module should provide *access* to the global state, rather than *own* it. If possible, write the module so that multiple copies of it can access the state independently (along with other libraries, whether for Python or other languages). If that is not possible, consider explicit locking.
sv: I dessa fall bör Python-modulen ge *åtkomst* till det globala tillståndet, snarare än att *äga* det. Om möjligt, skriv modulen så att flera kopior av den kan komma åt tillståndet oberoende av varandra (tillsammans med andra bibliotek, oavsett om det är för Python eller andra språk). Om det inte är möjligt bör man överväga explicit låsning.

source: If it is necessary to use process-global state, the simplest way to avoid issues with multiple interpreters is to explicitly prevent a module from being loaded more than once per process—see :ref:`isolating-extensions-optout`.
sv: Om det är nödvändigt att använda processglobalt tillstånd är det enklaste sättet att undvika problem med flera tolkar att uttryckligen förhindra att en modul laddas mer än en gång per process - se :ref:`isolating-extensions-optout`.

source: Managing Per-Module State
sv: Hantering av tillstånd per modul

source: To use per-module state, use :ref:`multi-phase extension module initialization <multi-phase-initialization>`. This signals that your module supports multiple interpreters correctly.
sv: Om du vill använda tillstånd per modul använder du :ref:`multiphase extension module initialization <multi-phase-initialization>`. Detta signalerar att din modul stöder flera tolkar på rätt sätt.

source: Set ``PyModuleDef.m_size`` to a positive number to request that many bytes of storage local to the module. Usually, this will be set to the size of some module-specific ``struct``, which can store all of the module's C-level state. In particular, it is where you should put pointers to classes (including exceptions, but excluding static types) and settings (e.g. ``csv``'s :py:data:`~csv.field_size_limit`) which the C code needs to function.
sv: Sätt ``PyModuleDef.m_size`` till ett positivt tal för att begära så många byte lagringsutrymme lokalt för modulen. Vanligtvis kommer detta att sättas till storleken på någon modulspecifik ``struct``, som kan lagra allt modulens C-nivåtillstånd. I synnerhet är det där du bör lägga pekare till klasser (inklusive undantag, men exklusive statiska typer) och inställningar (t.ex. ``csv`` :py:data:`~csv.field_size_limit`) som C-koden behöver för att fungera.

source: Another option is to store state in the module's ``__dict__``, but you must avoid crashing when users modify ``__dict__`` from Python code. This usually means error- and type-checking at the C level, which is easy to get wrong and hard to test sufficiently.
sv: Ett annat alternativ är att lagra tillståndet i modulens ``__dict__``, men du måste undvika att krascha när användare ändrar ``__dict__`` från Python-kod. Detta innebär vanligtvis fel- och typkontroll på C-nivå, vilket är lätt att göra fel och svårt att testa tillräckligt.

source: However, if module state is not needed in C code, storing it in ``__dict__`` only is a good idea.
sv: Om modulstatus inte behövs i C-kod är det dock en bra idé att lagra den i ``__dict__``.

source: If the module state includes ``PyObject`` pointers, the module object must hold references to those objects and implement the module-level hooks ``m_traverse``, ``m_clear`` and ``m_free``. These work like ``tp_traverse``, ``tp_clear`` and ``tp_free`` of a class. Adding them will require some work and make the code longer; this is the price for modules which can be unloaded cleanly.
sv: Om modultillståndet innehåller pekare av typen ``PyObject`` måste modulobjektet innehålla referenser till dessa objekt och implementera modulnivåkrokarna ``m_traverse``, ``m_clear`` och ``m_free``. Dessa fungerar som ``tp_traverse``, ``tp_clear`` och ``tp_free`` för en klass. Att lägga till dem kommer att kräva en del arbete och göra koden längre; detta är priset för moduler som kan avlastas på ett rent sätt.

source: An example of a module with per-module state is currently available as `xxlimited <https://github.com/python/cpython/blob/master/Modules/xxlimited.c>`__; example module initialization shown at the bottom of the file.
sv: Ett exempel på en modul med tillstånd per modul finns för närvarande tillgängligt som `xxlimited <https://github.com/python/cpython/blob/master/Modules/xxlimited.c>`__; exempel på modulinitialisering visas längst ner i filen.

source: Opt-Out: Limiting to One Module Object per Process
sv: Välj bort: Begränsning till ett modulobjekt per process

source: A non-negative ``PyModuleDef.m_size`` signals that a module supports multiple interpreters correctly. If this is not yet the case for your module, you can explicitly make your module loadable only once per process. For example::
sv: En icke-negativ ``PyModuleDef.m_size`` signalerar att en modul har korrekt stöd för flera tolkar. Om detta ännu inte är fallet för din modul, kan du uttryckligen göra din modul laddningsbar endast en gång per process. Till exempel::

source: // A process-wide flag static int loaded = 0; // Mutex to provide thread safety (only needed for free-threaded Python) static PyMutex modinit_mutex = {0}; static int exec_module(PyObject* module) { PyMutex_Lock(&modinit_mutex); if (loaded) { PyMutex_Unlock(&modinit_mutex); PyErr_SetString(PyExc_ImportError, "cannot load module more than once per process"); return -1; } loaded = 1; PyMutex_Unlock(&modinit_mutex); // ... rest of initialization }
sv: // En processgemensam flagga statisk int laddad = 0; // Mutex för att ge trådsäkerhet (behövs bara för Python med fri tråd) statisk PyMutex modinit_mutex = {0}; statisk int exec_module(PyObject* modul) { PyMutex_Lock(&modinit_mutex); if (laddad) { PyMutex_Unlock(&modinit_mutex); PyErr_SetString(PyExc_ImportError, "kan inte ladda modulen mer än en gång per process"); return -1; } laddad = 1; PyMutex_Unlock(&modinit_mutex); // ... resten av initieringen }

source: If your module's :c:member:`PyModuleDef.m_clear` function is able to prepare for future re-initialization, it should clear the ``loaded`` flag. In this case, your module won't support multiple instances existing *concurrently*, but it will, for example, support being loaded after Python runtime shutdown (:c:func:`Py_FinalizeEx`) and re-initialization (:c:func:`Py_Initialize`).
sv: Om din moduls :c:member:`PyModuleDef.m_clear`-funktion kan förbereda för framtida återinitialisering, bör den rensa ``loaded``-flaggan. I det här fallet kommer din modul inte att stödja flera instanser som existerar *samtidigt*, men den kommer till exempel att stödja laddning efter Python-körtidsavstängning (:c:func:`Py_FinalizeEx`) och ominitialisering (:c:func:`Py_Initialize`).

source: Module State Access from Functions
sv: Modulstatusåtkomst från funktioner

source: Accessing the state from module-level functions is straightforward. Functions get the module object as their first argument; for extracting the state, you can use ``PyModule_GetState``::
sv: Det är enkelt att komma åt tillståndet från funktioner på modulnivå. Funktioner får modulobjektet som sitt första argument; för att extrahera tillståndet kan du använda ``PyModule_GetState``::

source: static PyObject * func(PyObject *module, PyObject *args) { my_struct *state = (my_struct*)PyModule_GetState(module); if (state == NULL) { return NULL; } // ... rest of logic }
sv: statiskt PyObjekt * func(PyObject *modul, PyObject *args) { my_struct *state = (my_struct*)PyModule_GetState(module); if (tillstånd == NULL) { returnera NULL; } // ... resten av logiken }

source: ``PyModule_GetState`` may return ``NULL`` without setting an exception if there is no module state, i.e. ``PyModuleDef.m_size`` was zero. In your own module, you're in control of ``m_size``, so this is easy to prevent.
sv: ``PyModule_GetState`` kan returnera ``NULL`` utan att sätta ett undantag om det inte finns något modultillstånd, dvs. ``PyModuleDef.m_size`` var noll. I din egen modul har du kontroll över ``m_size``, så det här är lätt att förhindra.

source: Heap Types
sv: Typer av högar

source: Traditionally, types defined in C code are *static*; that is, ``static PyTypeObject`` structures defined directly in code and initialized using ``PyType_Ready()``.
sv: Traditionellt är typer som definieras i C-kod *statiska*, det vill säga ``statiska PyTypeObject``-strukturer som definieras direkt i koden och initieras med ``PyType_Ready()``.

source: Such types are necessarily shared across the process. Sharing them between module objects requires paying attention to any state they own or access. To limit the possible issues, static types are immutable at the Python level: for example, you can't set ``str.myattribute = 123``.
sv: Sådana typer delas nödvändigtvis över hela processen. Att dela dem mellan modulobjekt kräver att man är uppmärksam på alla tillstånd som de äger eller har åtkomst till. För att begränsa de möjliga problemen är statiska typer oföränderliga på Python-nivå: du kan till exempel inte ställa in ``str.myattribute = 123``.

source: Sharing truly immutable objects between interpreters is fine, as long as they don't provide access to mutable objects. However, in CPython, every Python object has a mutable implementation detail: the reference count. Changes to the refcount are guarded by the GIL. Thus, code that shares any Python objects across interpreters implicitly depends on CPython's current, process-wide GIL.
sv: Att dela verkligt oföränderliga objekt mellan tolkar är bra, så länge de inte ger åtkomst till föränderliga objekt. I CPython har dock varje Python-objekt en föränderlig implementeringsdetalj: referensantalet. Ändringar av referensantalet skyddas av GIL. Kod som delar Python-objekt mellan olika tolkar är således implicit beroende av CPythons aktuella, processomfattande GIL.

source: Because they are immutable and process-global, static types cannot access "their" module state. If any method of such a type requires access to module state, the type must be converted to a *heap-allocated type*, or *heap type* for short. These correspond more closely to classes created by Python's ``class`` statement.
sv: Eftersom de är oföränderliga och processglobala kan statiska typer inte komma åt "sitt" modultillstånd. Om någon metod av en sådan typ kräver åtkomst till modultillståndet måste typen konverteras till en *heap-allokerad typ*, eller *heap-typ* förkortat. Dessa motsvarar mer klasser som skapas av Pythons ``class`` statement.

source: For new modules, using heap types by default is a good rule of thumb.
sv: För nya moduler är det en bra tumregel att använda heap-typer som standard.

source: Changing Static Types to Heap Types
sv: Ändra statiska typer till heap-typer

source: Static types can be converted to heap types, but note that the heap type API was not designed for "lossless" conversion from static types—that is, creating a type that works exactly like a given static type. So, when rewriting the class definition in a new API, you are likely to unintentionally change a few details (e.g. pickleability or inherited slots). Always test the details that are important to you.
sv: Statiska typer kan konverteras till heap-typer, men observera att API:et för heap-typer inte utformades för "förlustfri" konvertering från statiska typer - det vill säga att skapa en typ som fungerar exakt som en given statisk typ. Så när du skriver om klassdefinitionen i ett nytt API kommer du sannolikt att oavsiktligt ändra några detaljer (t.ex. pickleability eller ärvda slots). Testa alltid de detaljer som är viktiga för dig.

source: Watch out for the following two points in particular (but note that this is not a comprehensive list):
sv: Var särskilt uppmärksam på följande två punkter (men observera att detta inte är en uttömmande lista):

source: Unlike static types, heap type objects are mutable by default. Use the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag to prevent mutability.
sv: Till skillnad från statiska typer är objekt av typen heap muterbara som standard. Använd flaggan :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` för att förhindra föränderlighet.

source: Heap types inherit :c:member:`~PyTypeObject.tp_new` by default, so it may become possible to instantiate them from Python code. You can prevent this with the :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flag.
sv: Heap-typer ärver :c:member:`~PyTypeObject.tp_new` som standard, så det kan bli möjligt att instansiera dem från Python-kod. Du kan förhindra detta med flaggan :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`.

source: Defining Heap Types
sv: Definiera heap-typer
