Repository: yeager/python-docs-sv
Catalog: howto/isolating-extensions.po
Languages: sv

source: Heap types can be created by filling a :c:struct:`PyType_Spec` structure, a description or "blueprint" of a class, and calling :c:func:`PyType_FromModuleAndSpec` to construct a new class object.
sv: Heap-typer kan skapas genom att fylla en :c:struct:`PyType_Spec`-struktur, en beskrivning eller "blueprint" av en klass, och anropa :c:func:`PyType_FromModuleAndSpec` för att konstruera ett nytt klassobjekt.

source: Other functions, like :c:func:`PyType_FromSpec`, can also create heap types, but :c:func:`PyType_FromModuleAndSpec` associates the module with the class, allowing access to the module state from methods.
sv: Andra funktioner, som :c:func:`PyType_FromSpec`, kan också skapa heap-typer, men :c:func:`PyType_FromModuleAndSpec` associerar modulen med klassen, vilket ger tillgång till modultillståndet från metoder.

source: The class should generally be stored in *both* the module state (for safe access from C) and the module's ``__dict__`` (for access from Python code).
sv: Klassen bör i allmänhet lagras i *både* modultillståndet (för säker åtkomst från C) och modulens ``__dict__`` (för åtkomst från Python-kod).

source: Garbage-Collection Protocol
sv: Protokoll för insamling av sopor

source: Instances of heap types hold a reference to their type. This ensures that the type isn't destroyed before all its instances are, but may result in reference cycles that need to be broken by the garbage collector.
sv: Instanser av heap-typer håller en referens till sin typ. Detta säkerställer att typen inte förstörs innan alla dess instanser har förstörts, men kan resultera i referenscykler som måste brytas av skräpsamlaren.

source: To avoid memory leaks, instances of heap types must implement the garbage collection protocol. That is, heap types should:
sv: För att undvika minnesläckage måste instanser av heap-typer implementera garbage collection-protokollet. Det vill säga, heap-typer bör:

source: Have the :c:macro:`Py_TPFLAGS_HAVE_GC` flag.
sv: Har :c:macro:`Py_TPFLAGS_HAVE_GC` flaggan.

source: Define a traverse function using ``Py_tp_traverse``, which visits the type (e.g. using ``Py_VISIT(Py_TYPE(self))``).
sv: Definiera en traversefunktion med hjälp av ``Py_tp_traverse``, som besöker typen (t.ex. med ``Py_VISIT(Py_TYPE(self))``).

source: Please refer to the documentation of :c:macro:`Py_TPFLAGS_HAVE_GC` and :c:member:`~PyTypeObject.tp_traverse` for additional considerations.
sv: Se dokumentationen för :c:macro:`Py_TPFLAGS_HAVE_GC` och :c:member:`~PyTypeObject.tp_traverse` för ytterligare information.

source: The API for defining heap types grew organically, leaving it somewhat awkward to use in its current state. The following sections will guide you through common issues.
sv: API:et för att definiera heap-typer växte organiskt, vilket gör att det är lite besvärligt att använda i sitt nuvarande tillstånd. Följande avsnitt kommer att vägleda dig genom vanliga problem.

source: ``tp_traverse`` in Python 3.8 and lower
sv: ``tp_traverse`` i Python 3.8 och lägre

source: The requirement to visit the type from ``tp_traverse`` was added in Python 3.9. If you support Python 3.8 and lower, the traverse function must *not* visit the type, so it must be more complicated::
sv: Kravet på att besöka typen från ``tp_traverse`` lades till i Python 3.9. Om du stöder Python 3.8 och lägre får traverse-funktionen *inte* besöka typen, så det måste vara mer komplicerat::

source: Unfortunately, :c:data:`Py_Version` was only added in Python 3.11. As a replacement, use:
sv: Tyvärr lades :c:data:`Py_Version` till först i Python 3.11. Som ersättning kan du använda:

source: :c:macro:`PY_VERSION_HEX`, if not using the stable ABI, or
sv: :c:macro:`PY_VERSION_HEX`, om det stabila ABI:t inte används, eller

source: :py:data:`sys.version_info` (via :c:func:`PySys_GetObject` and :c:func:`PyArg_ParseTuple`).
sv: :py:data:`sys.version_info` (via :c:func:`PySys_GetObject` och :c:func:`PyArg_ParseTuple`).

source: Delegating ``tp_traverse``
sv: Delegering av ``tp_traverse``

source: If your traverse function delegates to the :c:member:`~PyTypeObject.tp_traverse` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only heap type are expected to visit the type in ``tp_traverse``.
sv: Om din traversefunktion delegerar till :c:member:`~PyTypeObject.tp_traverse` i sin basklass (eller en annan typ), se till att ``Py_TYPE(self)`` bara besöks en gång. Observera att endast heap-typer förväntas besöka typen i ``tp_traverse``.

source: For example, if your traverse function includes::
sv: Till exempel, om din traversefunktion inkluderar::

source: base->tp_traverse(self, visit, arg)
sv: base->tp_traverse(self, besök, arg)

source: ...and ``base`` may be a static type, then it should also include::
sv: ...och ``base`` kan vara en statisk typ, då bör den också innehålla::

source: if (base->tp_flags & Py_TPFLAGS_HEAPTYPE) { // a heap type's tp_traverse already visited Py_TYPE(self) } else { if (Py_Version >= 0x03090000) { Py_VISIT(Py_TYPE(self)); } }
sv: if (bas->tp_flags & Py_TPFLAGS_HEAPTYPE) { // en heap-typs tp_traverse har redan besökt Py_TYPE(self) } else { if (Py_Version >= 0x03090000) { Py_VISIT(Py_TYPE(self)); } }

source: It is not necessary to handle the type's reference count in :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_clear`.
sv: Det är inte nödvändigt att hantera typens referensantal i :c:member:`~PyTypeObject.tp_new` och :c:member:`~PyTypeObject.tp_clear`.

source: Defining ``tp_dealloc``
sv: Definiera ``tp_dealloc``

source: If your type has a custom :c:member:`~PyTypeObject.tp_dealloc` function, it needs to:
sv: Om din typ har en anpassad :c:member:`~PyTypeObject.tp_dealloc`-funktion måste den göra det:

source: call :c:func:`PyObject_GC_UnTrack` before any fields are invalidated, and
sv: anropa :c:func:`PyObject_GC_UnTrack` innan några fält ogiltigförklaras, och

source: decrement the reference count of the type.
sv: decimera referensantalet för typen.

source: To keep the type valid while ``tp_free`` is called, the type's refcount needs to be decremented *after* the instance is deallocated. For example::
sv: För att hålla typen giltig medan ``tp_free`` anropas måste typens refcount minskas *efter* att instansen har deallokerats. Till exempel::

source: static void my_dealloc(PyObject *self) { PyObject_GC_UnTrack(self); ... PyTypeObject *type = Py_TYPE(self); type->tp_free(self); Py_DECREF(type); }
sv: statiskt void my_dealloc(PyObject *self) { PyObject_GC_UnTrack(self); ... PyTypeObject *type = Py_TYPE(self); type->tp_free(self); Py_DECREF(typ); }

source: The default ``tp_dealloc`` function does this, so if your type does *not* override ``tp_dealloc`` you don't need to add it.
sv: Standardfunktionen ``tp_dealloc`` gör detta, så om din typ *inte* åsidosätter ``tp_dealloc`` behöver du inte lägga till den.

source: Not overriding ``tp_free``
sv: Inte åsidosätta ``tp_free``

source: The :c:member:`~PyTypeObject.tp_free` slot of a heap type must be set to :c:func:`PyObject_GC_Del`. This is the default; do not override it.
sv: Slot :c:member:`~PyTypeObject.tp_free` för en heap-typ måste vara inställd på :c:func:`PyObject_GC_Del`. Detta är standardvärdet; åsidosätt det inte.

source: Avoiding ``PyObject_New``
sv: Undvika ``PyObject_New``

source: GC-tracked objects need to be allocated using GC-aware functions.
sv: GC-spårade objekt måste allokeras med hjälp av GC-medvetna funktioner.

source: If you use :c:func:`PyObject_New` or :c:func:`PyObject_NewVar`:
sv: Om du använder :c:func:`PyObject_New` eller :c:func:`PyObject_NewVar`:

source: Get and call type's :c:member:`~PyTypeObject.tp_alloc` slot, if possible. That is, replace ``TYPE *o = PyObject_New(TYPE, typeobj)`` with::
sv: Hämta och anropa typens :c:member:`~PyTypeObject.tp_alloc` slot, om möjligt. Det vill säga, ersätt ``TYPE *o = PyObject_New(TYPE, typeobj)`` med::

source: Replace ``o = PyObject_NewVar(TYPE, typeobj, size)`` with the same, but use size instead of the 0.
sv: Ersätt ``o = PyObject_NewVar(TYPE, typeobj, size)`` med samma sak, men använd size istället för 0.

source: If the above is not possible (e.g. inside a custom ``tp_alloc``), call :c:func:`PyObject_GC_New` or :c:func:`PyObject_GC_NewVar`::
sv: Om ovanstående inte är möjligt (t.ex. inuti en anpassad ``tp_alloc``), anropa :c:func:`PyObject_GC_New` eller :c:func:`PyObject_GC_NewVar`::

source: Module State Access from Classes
sv: Modul Tillståndsåtkomst från klasser

source: If you have a type object defined with :c:func:`PyType_FromModuleAndSpec`, you can call :c:func:`PyType_GetModule` to get the associated module, and then :c:func:`PyModule_GetState` to get the module's state.
sv: Om du har ett typobjekt som definierats med :c:func:`PyType_FromModuleAndSpec` kan du anropa :c:func:`PyType_GetModule` för att hämta den associerade modulen och sedan :c:func:`PyModule_GetState` för att hämta modulens tillstånd.

source: To save a some tedious error-handling boilerplate code, you can combine these two steps with :c:func:`PyType_GetModuleState`, resulting in::
sv: För att spara lite tråkig boilerplate-kod för felhantering kan du kombinera dessa två steg med :c:func:`PyType_GetModuleState`, vilket resulterar i::

source: my_struct *state = (my_struct*)PyType_GetModuleState(type); if (state == NULL) { return NULL; }
sv: my_struct *state = (my_struct*)PyType_GetModuleState(type); if (tillstånd == NULL) { returnera NULL; }

source: Module State Access from Regular Methods
sv: Modul Tillgång till tillstånd från reguljära metoder

source: Accessing the module-level state from methods of a class is somewhat more complicated, but is possible thanks to API introduced in Python 3.9. To get the state, you need to first get the *defining class*, and then get the module state from it.
sv: Att komma åt tillståndet på modulnivå från metoder i en klass är något mer komplicerat, men det är möjligt tack vare API som introducerades i Python 3.9. För att få tillståndet måste du först hämta den *definierande klassen* och sedan hämta modultillståndet från den.

source: The largest roadblock is getting *the class a method was defined in*, or that method's "defining class" for short. The defining class can have a reference to the module it is part of.
sv: Det största hindret är att få fram *den klass som en metod definierades i*, eller kort och gott metodens "definierande klass". Den definierande klassen kan ha en referens till den modul den är en del av.

source: Do not confuse the defining class with ``Py_TYPE(self)``. If the method is called on a *subclass* of your type, ``Py_TYPE(self)`` will refer to that subclass, which may be defined in different module than yours.
sv: Förväxla inte den definierande klassen med ``Py_TYPE(self)``. Om metoden anropas på en *subklass* av din typ, kommer ``Py_TYPE(self)`` att referera till den subklassen, som kan vara definierad i en annan modul än din.

source: The following Python code can illustrate the concept. ``Base.get_defining_class`` returns ``Base`` even if ``type(self) == Sub``:
sv: Följande Python-kod kan illustrera konceptet. ``Base.get_defining_class`` returnerar ``Base`` även om ``type(self) == Sub``:

source: class Base: def get_type_of_self(self): return type(self) def get_defining_class(self): return __class__ class Sub(Base): pass
sv: klass Bas: def get_type_of_self(self): return typ(själv) def get_defining_class(self): return __class__ klass Sub(Bas): pass

source: For a method to get its "defining class", it must use the :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>` :c:type:`calling convention <PyMethodDef>` and the corresponding :c:type:`PyCMethod` signature::
sv: För att en metod ska få sin "definierande klass" måste den använda :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>` :c:type:`calling convention <PyMethodDef>` och motsvarande :c:type:`PyCMethod`-signatur::

source: PyObject *PyCMethod( PyObject *self, // object the method was called on PyTypeObject *defining_class, // defining class PyObject *const *args, // C array of arguments Py_ssize_t nargs, // length of "args" PyObject *kwnames) // NULL, or dict of keyword arguments
sv: PyObject *PyCMetod( PyObject *self, // objektet som metoden anropades på PyTypeObject *defining_class, // definierande klass PyObject *const *args, // C-array med argument Py_ssize_t nargs, // längd på "args" PyObject *kwnames) // NULL, eller dikt av nyckelordsargument

source: Once you have the defining class, call :c:func:`PyType_GetModuleState` to get the state of its associated module.
sv: När du har den definierande klassen kan du anropa :c:func:`PyType_GetModuleState` för att få fram tillståndet för den associerade modulen.

source: For example::
sv: Till exempel::

source: static PyObject * example_method(PyObject *self, PyTypeObject *defining_class, PyObject *const *args, Py_ssize_t nargs, PyObject *kwnames) { my_struct *state = (my_struct*)PyType_GetModuleState(defining_class); if (state == NULL) { return NULL; } ... // rest of logic } PyDoc_STRVAR(example_method_doc, "..."); static PyMethodDef my_methods[] = { {"example_method", (PyCFunction)(void(*)(void))example_method, METH_METHOD|METH_FASTCALL|METH_KEYWORDS, example_method_doc} {NULL}, }
sv: statiskt PyObject * example_method(PyObject *self, PyTypeObject *definierande_klass, PyObject *konst *args, Py_ssize_t nargs, PyObject *kwnamn) { my_struct *state = (my_struct*)PyType_GetModuleState(defining_class); if (state == NULL) { returnera NULL; } ... // resten av logiken } PyDoc_STRVAR(example_method_doc, "..."); statiska PyMethodDef my_methods[] = { {"example_method", (PyCFunction)(void(*)(void))exempel_method, METH_METHOD|METH_FASTCALL|METH_KEYWORDS, exempel_metod_dokument} {NULL}, }

source: Module State Access from Slot Methods, Getters and Setters
sv: Modul State Access från Slot Methods, Getters och Setters

source: This is new in Python 3.11.
sv: Detta är nytt i Python 3.11.

source: Slot methods—the fast C equivalents for special methods, such as :c:member:`~PyNumberMethods.nb_add` for :py:attr:`~object.__add__` or :c:member:`~PyTypeObject.tp_new` for initialization—have a very simple API that doesn't allow passing in the defining class, unlike with :c:type:`PyCMethod`. The same goes for getters and setters defined with :c:type:`PyGetSetDef`.
sv: Slot methods - de snabba C-ekvivalenterna för specialmetoder, som :c:member:`~PyNumberMethods.nb_add` för :py:attr:`~object.__add__` eller :c:member:`~PyTypeObject.tp_new` för initialisering - har ett mycket enkelt API som inte tillåter att den definierande klassen skickas in, till skillnad från :c:type:`PyCMethod`. Detsamma gäller för getters och setters som definieras med :c:type:`PyGetSetDef`.

source: To access the module state in these cases, use the :c:func:`PyType_GetModuleByDef` function, and pass in the module definition. Once you have the module, call :c:func:`PyModule_GetState` to get the state::
sv: För att komma åt modultillståndet i dessa fall använder du funktionen :c:func:`PyType_GetModuleByDef` och skickar in moduldefinitionen. När du har modulen, anropa :c:func:`PyModule_GetState` för att hämta tillståndet::

source: PyObject *module = PyType_GetModuleByDef(Py_TYPE(self), &module_def); my_struct *state = (my_struct*)PyModule_GetState(module); if (state == NULL) { return NULL; }
sv: PyObject *module = PyType_GetModuleByDef(Py_TYPE(self), &module_def); my_struct *state = (my_struct*)PyModule_GetState(module); if (tillstånd == NULL) { return NULL; }

source: :c:func:`!PyType_GetModuleByDef` works by searching the :term:`method resolution order` (i.e. all superclasses) for the first superclass that has a corresponding module.
sv: :c:func:`!PyType_GetModuleByDef` fungerar genom att söka i :term:`method resolution order` (dvs. alla superklasser) efter den första superklassen som har en motsvarande modul.

source: In very exotic cases (inheritance chains spanning multiple modules created from the same definition), :c:func:`!PyType_GetModuleByDef` might not return the module of the true defining class. However, it will always return a module with the same definition, ensuring a compatible C memory layout.
sv: I mycket exotiska fall (arvskedjor som sträcker sig över flera moduler som skapats från samma definition) kanske :c:func:`!PyType_GetModuleByDef` inte returnerar modulen för den verkliga definierande klassen. Den kommer dock alltid att returnera en modul med samma definition, vilket garanterar en kompatibel C-minneslayout.

source: Lifetime of the Module State
sv: Modulens livslängd Status

source: When a module object is garbage-collected, its module state is freed. For each pointer to (a part of) the module state, you must hold a reference to the module object.
sv: När ett modulobjekt garbage-collected frigörs dess modultillstånd. För varje pekare till (en del av) modultillståndet måste du hålla en referens till modulobjektet.

source: Usually this is not an issue, because types created with :c:func:`PyType_FromModuleAndSpec`, and their instances, hold a reference to the module. However, you must be careful in reference counting when you reference module state from other places, such as callbacks for external libraries.
sv: Vanligtvis är detta inte ett problem, eftersom typer som skapats med :c:func:`PyType_FromModuleAndSpec`, och deras instanser, innehåller en referens till modulen. Du måste dock vara försiktig med referensräkningen när du refererar till modulstatus från andra platser, t.ex. callbacks för externa bibliotek.

source: Open Issues
sv: Öppna problem

source: Several issues around per-module state and heap types are still open.
sv: Flera problem kring tillstånd per modul och heap-typer är fortfarande öppna.

source: Discussions about improving the situation are best held on the `discuss forum under c-api tag <https://discuss.python.org/c/core-dev/c-api/30>`__.
sv: Diskussioner om hur man kan förbättra situationen förs bäst på `discuss forum under c-api tag <https://discuss.python.org/c/core-dev/c-api/30>`__.

source: Per-Class Scope
sv: Scope per klass

source: It is currently (as of Python 3.11) not possible to attach state to individual *types* without relying on CPython implementation details (which may change in the future—perhaps, ironically, to allow a proper solution for per-class scope).
sv: Det är för närvarande (från och med Python 3.11) inte möjligt att koppla tillstånd till enskilda *typer* utan att förlita sig på CPython-implementeringsdetaljer (vilket kan ändras i framtiden - kanske, ironiskt nog, för att möjliggöra en korrekt lösning för per-class scope).

source: Lossless Conversion to Heap Types
sv: Förlustfri konvertering till Heap-typer

source: The heap type API was not designed for "lossless" conversion from static types; that is, creating a type that works exactly like a given static type.
sv: API:et för heap-typer är inte utformat för "förlustfri" konvertering från statiska typer, det vill säga att skapa en typ som fungerar exakt som en given statisk typ.
