Repository: yeager/python-docs-sv
Catalog: howto/mro.po
Languages: sv

source: The Python 2.3 Method Resolution Order
sv: Python 2.3-metodens upplösningsordning

source: This is a historical document, provided as an appendix to the official documentation. The Method Resolution Order discussed here was *introduced* in Python 2.3, but it is still used in later versions -- including Python 3.
sv: Detta är ett historiskt dokument, som tillhandahålls som en bilaga till den officiella dokumentationen. Method Resolution Order som diskuteras här *introducerades* i Python 2.3, men den används fortfarande i senare versioner - inklusive Python 3.

source: By `Michele Simionato <https://www.phyast.pitt.edu/~micheles/>`__.
sv: Av `Michele Simionato <https://www.phyast.pitt.edu/~micheles/>`__.

source: Abstract
sv: Abstrakt

source: *This document is intended for Python programmers who want to understand the C3 Method Resolution Order used in Python 2.3. Although it is not intended for newbies, it is quite pedagogical with many worked out examples. I am not aware of other publicly available documents with the same scope, therefore it should be useful.*
sv: *Detta dokument är avsett för Python-programmerare som vill förstå C3-metoden Resolution Order som används i Python 2.3. Även om det inte är avsett för nybörjare är det ganska pedagogiskt med många utarbetade exempel. Jag känner inte till andra offentligt tillgängliga dokument med samma omfattning, därför bör det vara användbart.*

source: Disclaimer:
sv: Ansvarsfriskrivning:

source: *I donate this document to the Python Software Foundation, under the Python 2.3 license. As usual in these circumstances, I warn the reader that what follows* should *be correct, but I don't give any warranty. Use it at your own risk and peril!*
sv: *Jag donerar detta dokument till Python Software Foundation, under Python 2.3-licensen. Som vanligt under dessa omständigheter varnar jag läsaren för att det som följer * bör * vara korrekt, men jag ger ingen garanti. Använd det på egen risk och fara!*

source: Acknowledgments:
sv: Erkännande:

source: *All the people of the Python mailing list who sent me their support. Paul Foley who pointed out various imprecisions and made me to add the part on local precedence ordering. David Goodger for help with the formatting in reStructuredText. David Mertz for help with the editing. Finally, Guido van Rossum who enthusiastically added this document to the official Python 2.3 home-page.*
sv: *Alla personer på Pythons e-postlista som skickade mig sitt stöd. Paul Foley som påpekade olika felaktigheter och fick mig att lägga till delen om lokal prioritetsordning. David Goodger för hjälp med formateringen i reStructuredText. David Mertz för hjälp med redigeringen. Slutligen, Guido van Rossum som entusiastiskt lade till detta dokument på den officiella Python 2.3-hemsidan.*

source: The beginning
sv: Början

source: Everything started with a post by Samuele Pedroni to the Python development mailing list [#]_. In his post, Samuele showed that the Python 2.2 method resolution order is not monotonic and he proposed to replace it with the C3 method resolution order. Guido agreed with his arguments and therefore now Python 2.3 uses C3. The C3 method itself has nothing to do with Python, since it was invented by people working on Dylan and it is described in a paper intended for lispers [#]_. The present paper gives a (hopefully) readable discussion of the C3 algorithm for Pythonistas who want to understand the reasons for the change.
sv: Allt började med ett inlägg av Samuele Pedroni till e-postlistan för Python-utveckling [#]_. I sitt inlägg visade Samuele att Python 2.2-metodens upplösningsordning inte är monoton och han föreslog att den skulle ersättas med C3-metodens upplösningsordning. Guido höll med om hans argument och därför använder Python 2.3 nu C3. C3-metoden i sig har inget med Python att göra, eftersom den uppfanns av personer som arbetade med Dylan och beskrivs i ett dokument som är avsett för lispers [#]_. Den här artikeln ger en (förhoppningsvis) läsbar diskussion av C3-algoritmen för Pythonistas som vill förstå orsakerna till förändringen.

source: First of all, let me point out that what I am going to say only applies to the *new style classes* introduced in Python 2.2: *classic classes* maintain their old method resolution order, depth first and then left to right. Therefore, there is no breaking of old code for classic classes; and even if in principle there could be breaking of code for Python 2.2 new style classes, in practice the cases in which the C3 resolution order differs from the Python 2.2 method resolution order are so rare that no real breaking of code is expected. Therefore:
sv: Först och främst vill jag påpeka att det jag ska säga bara gäller de *nya stilklasserna* som introducerades i Python 2.2: *klassiska klasser* behåller sin gamla metodupplösningsordning, djupet först och sedan vänster till höger. Därför finns det inget brott mot gammal kod för klassiska klasser; och även om det i princip skulle kunna finnas brott mot kod för Python 2.2 nya stilklasser, är de fall där C3-resolutionsordningen skiljer sig från Python 2.2-metodresolutionsordningen i praktiken så sällsynta att inget verkligt brott mot kod förväntas. Därför bör följande gälla:

source: *Don't be scared!*
sv: *Var inte rädd!

source: Moreover, unless you make strong use of multiple inheritance and you have non-trivial hierarchies, you don't need to understand the C3 algorithm, and you can easily skip this paper. On the other hand, if you really want to know how multiple inheritance works, then this paper is for you. The good news is that things are not as complicated as you might expect.
sv: Om du inte använder dig mycket av multipel nedärvning och har icke-triviala hierarkier behöver du inte heller förstå C3-algoritmen, och du kan enkelt hoppa över den här artikeln. Å andra sidan, om du verkligen vill veta hur multipel arv fungerar, då är det här dokumentet för dig. Den goda nyheten är att saker och ting inte är så komplicerade som du kanske förväntar dig.

source: Let me begin with some basic definitions.
sv: Låt mig börja med några grundläggande definitioner.

source: Given a class C in a complicated multiple inheritance hierarchy, it is a non-trivial task to specify the order in which methods are overridden, i.e. to specify the order of the ancestors of C.
sv: Givet en klass C i en komplicerad hierarki med flera arvsanlag är det en icke-trivial uppgift att ange i vilken ordning metoder åsidosätts, dvs. att ange ordningen på C:s förfäder.

source: The list of the ancestors of a class C, including the class itself, ordered from the nearest ancestor to the furthest, is called the class precedence list or the *linearization* of C.
sv: Listan över förfäderna till en klass C, inklusive klassen själv, ordnad från den närmaste förfadern till den mest avlägsna, kallas klassens företrädeslista eller *lineariseringen* av C.

source: The *Method Resolution Order* (MRO) is the set of rules that construct the linearization. In the Python literature, the idiom "the MRO of C" is also used as a synonymous for the linearization of the class C.
sv: *Method Resolution Order* (MRO) är den uppsättning regler som konstruerar linjäriseringen. I Python-litteraturen används idiomet "MRO för C" också som en synonym för linjäriseringen av klassen C.

source: For instance, in the case of single inheritance hierarchy, if C is a subclass of C1, and C1 is a subclass of C2, then the linearization of C is simply the list [C, C1 , C2]. However, with multiple inheritance hierarchies, the construction of the linearization is more cumbersome, since it is more difficult to construct a linearization that respects *local precedence ordering* and *monotonicity*.
sv: Om C till exempel är en underklass till C1 och C1 är en underklass till C2 i en enkel arvshierarki, är linjäriseringen av C helt enkelt listan [C, C1 , C2]. Men med flera arvshierarkier är konstruktionen av linjäriseringen mer besvärlig, eftersom det är svårare att konstruera en linjärisering som respekterar *lokal prioritetsordning* och *monotonicitet*.

source: I will discuss the local precedence ordering later, but I can give the definition of monotonicity here. A MRO is monotonic when the following is true: *if C1 precedes C2 in the linearization of C, then C1 precedes C2 in the linearization of any subclass of C*. Otherwise, the innocuous operation of deriving a new class could change the resolution order of methods, potentially introducing very subtle bugs. Examples where this happens will be shown later.
sv: Jag kommer att diskutera den lokala prioritetsordningen senare, men jag kan ge definitionen av monotonicitet här. En MRO är monoton när följande är sant: *om C1 föregår C2 i linjäriseringen av C, så föregår C1 C2 i linjäriseringen av någon underklass av C*. I annat fall kan den oskyldiga åtgärden att härleda en ny klass ändra metodernas upplösningsordning, vilket kan leda till mycket subtila buggar. Exempel där detta händer kommer att visas senare.

source: Not all classes admit a linearization. There are cases, in complicated hierarchies, where it is not possible to derive a class such that its linearization respects all the desired properties.
sv: Inte alla klasser tillåter en linjärisering. Det finns fall, i komplicerade hierarkier, där det inte är möjligt att härleda en klass så att dess linjärisering respekterar alla önskade egenskaper.

source: Here I give an example of this situation. Consider the hierarchy
sv: Här ger jag ett exempel på denna situation. Tänk på hierarkin

source: which can be represented with the following inheritance graph, where I have denoted with O the ``object`` class, which is the beginning of any hierarchy for new style classes:
sv: som kan representeras med följande arvsgraf, där jag med O har betecknat klassen ``objekt``, som är början på varje hierarki för nya stilklasser:

source: In this case, it is not possible to derive a new class C from A and B, since X precedes Y in A, but Y precedes X in B, therefore the method resolution order would be ambiguous in C.
sv: I det här fallet är det inte möjligt att härleda en ny klass C från A och B, eftersom X föregår Y i A, men Y föregår X i B, och därför skulle metodens upplösningsordning vara tvetydig i C.

source: Python 2.3 raises an exception in this situation (TypeError: MRO conflict among bases Y, X) forbidding the naive programmer from creating ambiguous hierarchies. Python 2.2 instead does not raise an exception, but chooses an *ad hoc* ordering (CABXYO in this case).
sv: Python 2.3 gör ett undantag i denna situation (TypeError: MRO conflict among bases Y, X) och förbjuder den naive programmeraren att skapa tvetydiga hierarkier. Python 2.2 ger istället inte upphov till ett undantag, utan väljer en *ad hoc*-ordning (CABXYO i det här fallet).

source: The C3 Method Resolution Order
sv: C3-metoden Upplösningsorder

source: Let me introduce a few simple notations which will be useful for the following discussion. I will use the shortcut notation::
sv: Låt mig introducera några enkla notationer som kommer att vara till nytta i den följande diskussionen. Jag kommer att använda förkortningsnotationen::

source: to indicate the list of classes [C1, C2, ... , CN].
sv: för att ange listan över klasser [C1, C2, ... , CN].

source: The *head* of the list is its first element::
sv: Listans *huvud* är dess första element::

source: head = C1
sv: huvud = C1

source: whereas the *tail* is the rest of the list::
sv: medan *svansen* är resten av listan::

source: tail = C2 ... CN.
sv: svans = C2 ... CN.

source: I shall also use the notation::
sv: Jag kommer också att använda notationen::

source: to denote the sum of the lists [C] + [C1, C2, ... ,CN].
sv: för att beteckna summan av listorna [C] + [C1, C2, ... ,CN].

source: Now I can explain how the MRO works in Python 2.3.
sv: Nu kan jag förklara hur MRO fungerar i Python 2.3.

source: Consider a class C in a multiple inheritance hierarchy, with C inheriting from the base classes B1, B2, ... , BN. We want to compute the linearization L[C] of the class C. The rule is the following:
sv: Betrakta en klass C i en hierarki med flera arvsanlag, där C ärver från basklasserna B1, B2, ... , BN. Vi vill beräkna linjäriseringen L[C] för klassen C. Regeln är följande:

source: *the linearization of C is the sum of C plus the merge of the linearizations of the parents and the list of the parents.*
sv: *linjäriseringen av C är summan av C plus sammanslagningen av linjäriseringarna av föräldrarna och listan över föräldrarna.*

source: In symbolic notation::
sv: I symbolisk notation::

source: In particular, if C is the ``object`` class, which has no parents, the linearization is trivial::
sv: I synnerhet om C är klassen ``objekt``, som inte har några föräldrar, är linjäriseringen trivial::

source: L[object] = object.
sv: L[objekt] = objekt.

source: However, in general one has to compute the merge according to the following prescription:
sv: I allmänhet måste man dock beräkna sammanslagningen enligt följande recept:

source: *take the head of the first list, i.e L[B1][0]; if this head is not in the tail of any of the other lists, then add it to the linearization of C and remove it from the lists in the merge, otherwise look at the head of the next list and take it, if it is a good head. Then repeat the operation until all the class are removed or it is impossible to find good heads. In this case, it is impossible to construct the merge, Python 2.3 will refuse to create the class C and will raise an exception.*
sv: *ta huvudet på den första listan, dvs L[B1][0]; om detta huvud inte finns i svansen på någon av de andra listorna, lägg då till det i linjäriseringen av C och ta bort det från listorna i sammanslagningen, annars titta på huvudet på nästa lista och ta det, om det är ett bra huvud. Upprepa sedan operationen tills alla klasser är borttagna eller det är omöjligt att hitta bra huvuden. I det här fallet är det omöjligt att konstruera sammanslagningen, Python 2.3 kommer att vägra att skapa klassen C och kommer att ge upphov till ett undantag.*

source: This prescription ensures that the merge operation *preserves* the ordering, if the ordering can be preserved. On the other hand, if the order cannot be preserved (as in the example of serious order disagreement discussed above) then the merge cannot be computed.
sv: Denna föreskrift säkerställer att sammanslagningsoperationen *bevarar* ordningen, om ordningen kan bevaras. Å andra sidan, om ordningen inte kan bevaras (som i exemplet med allvarlig oenighet om ordningen som diskuterades ovan) kan sammanslagningen inte beräknas.

source: The computation of the merge is trivial if C has only one parent (single inheritance); in this case::
sv: Beräkningen av sammanslagningen är trivial om C bara har en förälder (enkel nedärvning); i detta fall::

source: However, in the case of multiple inheritance things are more cumbersome and I don't expect you can understand the rule without a couple of examples ;-)
sv: Men när det gäller multipel arv är saker och ting mer besvärliga och jag förväntar mig inte att du kan förstå regeln utan ett par exempel ;-)

source: Examples
sv: Exempel

source: First example. Consider the following hierarchy:
sv: Första exemplet. Tänk på följande hierarki:

source: In this case the inheritance graph can be drawn as:
sv: I detta fall kan arvsgrafen ritas enligt följande:

source: 6 --- Level 3 | O | (more general) / --- \ / | \ | / | \ | / | \ | --- --- --- | Level 2 3 | D | 4| E | | F | 5 | --- --- --- | \ \ _ / | | \ / \ _ | | \ / \ | | --- --- | Level 1 1 | B | | C | 2 | --- --- | \ / | \ / \ / --- Level 0 0 | A | (more specialized) ---
sv: 6 --- Nivå 3 | O | (mer allmänt) / --- \ / | \ | / | \ | / | \ | --- --- --- | Nivå 2 3 | D | 4| E | | F | 5 | --- --- --- --- --- --- --- --- --- --- --- --- | \ \ _ / | | \ / \ _ | | \ / \ | | --- --- | Nivå 1 1 | B | | C | 2 --- --- | \ / | \ / \ / --- Nivå 0 0 | A | (mer specialiserad) ---

source: The linearizations of O,D,E and F are trivial::
sv: Linjäriseringarna av O,D,E och F är triviala::

source: The linearization of B can be computed as::
sv: Linjäriseringen av B kan beräknas som::

source: L[B] = B + merge(DO, EO, DE)
sv: L[B] = B + sammanslagning(DO, EO, DE)

source: We see that D is a good head, therefore we take it and we are reduced to compute ``merge(O,EO,E)``. Now O is not a good head, since it is in the tail of the sequence EO. In this case the rule says that we have to skip to the next sequence. Then we see that E is a good head; we take it and we are reduced to compute ``merge(O,O)`` which gives O. Therefore::
sv: Vi ser att D är ett bra huvud, därför tar vi det och vi reduceras till att beräkna ``merge(O,EO,E)``. Nu är O inte ett bra huvud, eftersom det ligger i svansen på sekvensen EO. I det här fallet säger regeln att vi måste hoppa till nästa sekvens. Då ser vi att E är ett bra huvud; vi tar det och vi reduceras till att beräkna ``merge(O,O)`` vilket ger O. Därför::

source: Using the same procedure one finds::
sv: Genom att använda samma procedur finner man::

source: Now we can compute::
sv: Nu kan vi beräkna::

source: L[A] = A + merge(BDEO,CDFO,BC) = A + B + merge(DEO,CDFO,C) = A + B + C + merge(DEO,DFO) = A + B + C + D + merge(EO,FO) = A + B + C + D + E + merge(O,FO) = A + B + C + D + E + F + merge(O,O) = A B C D E F O
sv: L[A] = A + merge(BDEO,CDFO,BC) = A + B + sammanslagning(DEO,CDFO,C) = A + B + C + sammanslagning(DEO,DFO) = A + B + C + D + sammanslagning(EO,FO) = A + B + C + D + E + merge(O,FO) = A + B + C + D + E + F + merge(O,O) = A B C D E F O

source: In this example, the linearization is ordered in a pretty nice way according to the inheritance level, in the sense that lower levels (i.e. more specialized classes) have higher precedence (see the inheritance graph). However, this is not the general case.
sv: I det här exemplet är linjäriseringen ordnad på ett ganska bra sätt enligt arvsnivån, i den meningen att lägre nivåer (dvs. mer specialiserade klasser) har högre prioritet (se arvsgrafen). Detta är dock inte det generella fallet.

source: I leave as an exercise for the reader to compute the linearization for my second example:
sv: Jag lämnar som en övning för läsaren att beräkna linjäriseringen för mitt andra exempel:

source: The only difference with the previous example is the change B(D,E) --> B(E,D); however even such a little modification completely changes the ordering of the hierarchy:
sv: Den enda skillnaden mot föregående exempel är ändringen B(D,E) --> B(E,D), men även en sådan liten ändring förändrar helt hierarkins ordning:

source: 6 --- Level 3 | O | / --- \ / | \ / | \ / | \ --- --- --- Level 2 2 | E | 4 | D | | F | 5 --- --- --- \ / \ / \ / \ / \ / \ / --- --- Level 1 1 | B | | C | 3 --- --- \ / \ / --- Level 0 0 | A | ---
sv: 6 --- Nivå 3 | O | / --- \ / | \ / | \ / | \ --- --- --- Nivå 2 2 | E | 4 | D | | F | 5 --- --- --- \ / \ / \ / \ / \ / \ / --- --- Nivå 1 1 | B | | C | 3 --- --- \ / \ / --- Nivå 0 0 | A | ---

source: Notice that the class E, which is in the second level of the hierarchy, precedes the class C, which is in the first level of the hierarchy, i.e. E is more specialized than C, even if it is in a higher level.
sv: Observera att klassen E, som befinner sig på den andra nivån i hierarkin, föregår klassen C, som befinner sig på den första nivån i hierarkin, dvs E är mer specialiserad än C, även om den befinner sig på en högre nivå.

source: A lazy programmer can obtain the MRO directly from Python 2.2, since in this case it coincides with the Python 2.3 linearization. It is enough to invoke the :meth:`~type.mro` method of class A:
sv: En lat programmerare kan få MRO direkt från Python 2.2, eftersom det i detta fall sammanfaller med Python 2.3-linjäriseringen. Det räcker med att anropa :meth:`~type.mro`-metoden för klass A:

source: Finally, let me consider the example discussed in the first section, involving a serious order disagreement. In this case, it is straightforward to compute the linearizations of O, X, Y, A and B:
sv: Låt mig slutligen ta upp det exempel som diskuterades i det första avsnittet, med en allvarlig oenighet om ordern. I det här fallet är det enkelt att beräkna linjäriseringarna av O, X, Y, A och B:

source: However, it is impossible to compute the linearization for a class C that inherits from A and B::
sv: Det är dock omöjligt att beräkna linjäriseringen för en klass C som ärver från A och B::

source: L[C] = C + merge(AXYO, BYXO, AB) = C + A + merge(XYO, BYXO, B) = C + A + B + merge(XYO, YXO)
sv: L[C] = C + sammanslagning(AXYO, BYXO, AB) = C + A + sammanslagning(XYO, BYXO, B) = C + A + B + sammanslagning(XYO, YXO)

source: At this point we cannot merge the lists XYO and YXO, since X is in the tail of YXO whereas Y is in the tail of XYO: therefore there are no good heads and the C3 algorithm stops. Python 2.3 raises an error and refuses to create the class C.
sv: Vid denna punkt kan vi inte slå samman listorna XYO och YXO, eftersom X är i svansen på YXO medan Y är i svansen på XYO: därför finns det inga bra huvuden och C3-algoritmen stannar. Python 2.3 ger upphov till ett fel och vägrar att skapa klassen C.

source: Bad Method Resolution Orders
sv: Bad Method Resolution Order

source: A MRO is *bad* when it breaks such fundamental properties as local precedence ordering and monotonicity. In this section, I will show that both the MRO for classic classes and the MRO for new style classes in Python 2.2 are bad.
sv: En MRO är *dålig* när den bryter mot sådana grundläggande egenskaper som lokal prioritetsordning och monotonicitet. I det här avsnittet ska jag visa att både MRO för klassiska klasser och MRO för new style-klasser i Python 2.2 är dåliga.

source: It is easier to start with the local precedence ordering. Consider the following example:
sv: Det är lättare att börja med den lokala prioritetsordningen. Tänk på följande exempel:

source: with inheritance diagram
sv: med nedärvningsdiagram

source: O | (buy spam) F | \ | E (buy eggs) | / G (buy eggs or spam ?)
sv: O | (köp skräppost) F | \ | E (köp ägg) | / G (köpa ägg eller spam?)

source: We see that class G inherits from F and E, with F *before* E: therefore we would expect the attribute *G.remember2buy* to be inherited by *F.remember2buy* and not by *E.remember2buy*: nevertheless Python 2.2 gives
sv: Vi ser att klass G ärver från F och E, med F *före* E: därför skulle vi förvänta oss att attributet *G.remember2buy* ärvs av *F.remember2buy* och inte av *E.remember2buy*: ändå ger Python 2.2

source: This is a breaking of local precedence ordering since the order in the local precedence list, i.e. the list of the parents of G, is not preserved in the Python 2.2 linearization of G::
sv: Detta är ett brott mot lokal prioritetsordning eftersom ordningen i den lokala prioritetslistan, dvs. listan över G:s föräldrar, inte bevaras i Python 2.2-linjäriseringen av G::

source: L[G,P22]= G E F object # F *follows* E
sv: L[G,P22]= G E F objekt # F *följer* E

source: One could argue that the reason why F follows E in the Python 2.2 linearization is that F is less specialized than E, since F is the superclass of E; nevertheless the breaking of local precedence ordering is quite non-intuitive and error prone. This is particularly true since it is a different from old style classes:
sv: Man skulle kunna hävda att anledningen till att F följer E i Python 2.2-linjäriseringen är att F är mindre specialiserad än E, eftersom F är superklassen till E. Ändå är brytningen av lokal prioritetsordning ganska icke-intuitiv och felbenägen. Detta är särskilt sant eftersom det skiljer sig från klasser i gammal stil:

source: In this case the MRO is GFEF and the local precedence ordering is preserved.
sv: I detta fall är den huvudsakliga bestämmelseorten GFEF och den lokala prioritetsordningen bevaras.
