Repository: yeager/python-docs-sv
Catalog: howto/mro.po
Languages: sv

source: As a general rule, hierarchies such as the previous one should be avoided, since it is unclear if F should override E or vice-versa. Python 2.3 solves the ambiguity by raising an exception in the creation of class G, effectively stopping the programmer from generating ambiguous hierarchies. The reason for that is that the C3 algorithm fails when the merge::
sv: Som en allmän regel bör hierarkier som den föregående undvikas, eftersom det är oklart om F ska åsidosätta E eller vice versa. Python 2.3 löser tvetydigheten genom att lyfta ett undantag i skapandet av klass G, vilket effektivt hindrar programmeraren från att generera tvetydiga hierarkier. Anledningen till detta är att C3-algoritmen misslyckas när merge::

source: merge(FO,EFO,FE)
sv: sammanfoga(FO,EFO,FE)

source: cannot be computed, because F is in the tail of EFO and E is in the tail of FE.
sv: kan inte beräknas, eftersom F är i svansen på EFO och E är i svansen på FE.

source: The real solution is to design a non-ambiguous hierarchy, i.e. to derive G from E and F (the more specific first) and not from F and E; in this case the MRO is GEF without any doubt.
sv: Den verkliga lösningen är att utforma en icke-tvetydig hierarki, dvs. att härleda G från E och F (den mer specifika först) och inte från F och E; i detta fall är MRO utan tvekan GEF.

source: O | F (spam) / | (eggs) E | \ | G (eggs, no doubt)
sv: O | F (skräppost) / | (ägg) E | \ | G (ägg, utan tvekan)

source: Python 2.3 forces the programmer to write good hierarchies (or, at least, less error-prone ones).
sv: Python 2.3 tvingar programmeraren att skriva bra hierarkier (eller åtminstone mindre felbenägna sådana).

source: On a related note, let me point out that the Python 2.3 algorithm is smart enough to recognize obvious mistakes, as the duplication of classes in the list of parents:
sv: I sammanhanget vill jag påpeka att Python 2.3-algoritmen är tillräckligt smart för att känna igen uppenbara misstag, t.ex. dubblering av klasser i listan över föräldrar:

source: Python 2.2 (both for classic classes and new style classes) in this situation, would not raise any exception.
sv: Python 2.2 (både för klassiska klasser och klasser med ny stil) skulle i denna situation inte ge upphov till något undantag.

source: Finally, I would like to point out two lessons we have learned from this example:
sv: Slutligen vill jag peka på två lärdomar som vi har dragit av detta exempel:

source: despite the name, the MRO determines the resolution order of attributes, not only of methods;
sv: trots namnet bestämmer MRO resolutionsordningen för attribut, inte bara för metoder;

source: the default food for Pythonistas is spam ! (but you already knew that ;-)
sv: standardmat för Pythonistas är spam ! (men det visste du redan ;-)

source: Having discussed the issue of local precedence ordering, let me now consider the issue of monotonicity. My goal is to show that neither the MRO for classic classes nor that for Python 2.2 new style classes is monotonic.
sv: Efter att ha diskuterat frågan om lokal prioritetsordning, låt mig nu ta upp frågan om monotonicitet. Mitt mål är att visa att varken MRO för klassiska klasser eller för Python 2.2 new style classes är monoton.

source: To prove that the MRO for classic classes is non-monotonic is rather trivial, it is enough to look at the diamond diagram:
sv: Att bevisa att MRO för klassiska klasser är icke-monoton är ganska trivialt, det räcker med att titta på diamantdiagrammet:

source: One easily discerns the inconsistency::
sv: Man kan lätt urskilja inkonsekvensen::

source: L[B,P21] = B C # B precedes C : B's methods win L[D,P21] = D A C B C # B follows C : C's methods win!
sv: L[B,P21] = B C # B föregår C : B:s metoder vinner L[D,P21] = D A C B C # B följer C : C:s metoder vinner!

source: On the other hand, there are no problems with the Python 2.2 and 2.3 MROs, they give both::
sv: Å andra sidan finns det inga problem med Python 2.2 och 2.3 MRO, de ger båda::

source: Guido points out in his essay [#]_ that the classic MRO is not so bad in practice, since one can typically avoids diamonds for classic classes. But all new style classes inherit from ``object``, therefore diamonds are unavoidable and inconsistencies shows up in every multiple inheritance graph.
sv: Guido påpekar i sin essä [#]_ att den klassiska MRO inte är så illa i praktiken, eftersom man vanligtvis kan undvika diamanter för klassiska klasser. Men alla klasser i ny stil ärver från ``objekt``, därför är diamanter oundvikliga och inkonsekvenser dyker upp i varje multipel arvgraf.

source: The MRO of Python 2.2 makes breaking monotonicity difficult, but not impossible. The following example, originally provided by Samuele Pedroni, shows that the MRO of Python 2.2 is non-monotonic:
sv: MRO i Python 2.2 gör det svårt, men inte omöjligt, att bryta monotonicitet. Följande exempel, ursprungligen tillhandahållet av Samuele Pedroni, visar att MRO i Python 2.2 är icke-monoton:

source: Here are the linearizations according to the C3 MRO (the reader should verify these linearizations as an exercise and draw the inheritance diagram ;-) ::
sv: Här är linjäriseringarna enligt C3 MRO (läsaren bör verifiera dessa linjäriseringar som en övning och rita arvsdiagrammet ;-) ::

source: Python 2.2 gives exactly the same linearizations for A, B, C, D, E, K1, K2 and K3, but a different linearization for Z::
sv: Python 2.2 ger exakt samma linjäriseringar för A, B, C, D, E, K1, K2 och K3, men en annan linjärisering för Z::

source: It is clear that this linearization is *wrong*, since A comes before D whereas in the linearization of K3 A comes *after* D. In other words, in K3 methods derived by D override methods derived by A, but in Z, which still is a subclass of K3, methods derived by A override methods derived by D! This is a violation of monotonicity. Moreover, the Python 2.2 linearization of Z is also inconsistent with local precedence ordering, since the local precedence list of the class Z is [K1, K2, K3] (K2 precedes K3), whereas in the linearization of Z K2 *follows* K3. These problems explain why the 2.2 rule has been dismissed in favor of the C3 rule.
sv: Det är uppenbart att denna linjärisering är *felaktig*, eftersom A kommer före D medan A i linjäriseringen av K3 kommer *efter* D. Med andra ord, i K3 åsidosätter metoder som härrör från D metoder som härrör från A, men i Z, som fortfarande är en underklass till K3, åsidosätter metoder som härrör från A metoder som härrör från D! Detta är ett brott mot monotonicitet. Dessutom är Python 2.2-linjäriseringen av Z också inkonsekvent med lokal prioritetsordning, eftersom den lokala prioritetslistan för klassen Z är [K1, K2, K3] (K2 föregår K3), medan K2 i linjäriseringen av Z *följer* K3. Dessa problem förklarar varför 2.2-regeln har avfärdats till förmån för C3-regeln.

source: The end
sv: Slutet

source: This section is for the impatient reader, who skipped all the previous sections and jumped immediately to the end. This section is for the lazy programmer too, who didn't want to exercise her/his brain. Finally, it is for the programmer with some hubris, otherwise s/he would not be reading a paper on the C3 method resolution order in multiple inheritance hierarchies ;-) These three virtues taken all together (and *not* separately) deserve a prize: the prize is a short Python 2.2 script that allows you to compute the 2.3 MRO without risk to your brain. Simply change the last line to play with the various examples I have discussed in this paper.::
sv: Detta avsnitt är för den otåliga läsaren, som hoppat över alla tidigare avsnitt och hoppade direkt till slutet. Det här avsnittet är också för den lata programmeraren, som inte ville träna sin hjärna. Slutligen är det för programmeraren med lite hybris, annars skulle han / hon inte läsa ett papper om C3-metodens upplösningsordning i flera arvshierarkier ;-) Dessa tre dygder tillsammans (och *inte* var för sig) förtjänar ett pris: priset är ett kort Python 2.2-skript som gör att du kan beräkna 2,3 MRO utan risk för din hjärna. Ändra bara den sista raden för att leka med de olika exemplen som jag har diskuterat i det här dokumentet:::

source: #<mro.py> """C3 algorithm by Samuele Pedroni (with readability enhanced by me).""" class __metaclass__(type): "All classes are metamagically modified to be nicely printed" __repr__ = lambda cls: cls.__name__ class ex_2: "Serious order disagreement" #From Guido class O: pass class X(O): pass class Y(O): pass class A(X,Y): pass class B(Y,X): pass try: class Z(A,B): pass #creates Z(A,B) in Python 2.2 except TypeError: pass # Z(A,B) cannot be created in Python 2.3 class ex_5: "My first example" class O: pass class F(O): pass class E(O): pass class D(O): pass class C(D,F): pass class B(D,E): pass class A(B,C): pass class ex_6: "My second example" class O: pass class F(O): pass class E(O): pass class D(O): pass class C(D,F): pass class B(E,D): pass class A(B,C): pass class ex_9: "Difference between Python 2.2 MRO and C3" #From Samuele class O: pass class A(O): pass class B(O): pass class C(O): pass class D(O): pass class E(O): pass class K1(A,B,C): pass class K2(D,B,E): pass class K3(D,A): pass class Z(K1,K2,K3): pass def merge(seqs): print '\n\nCPL[%s]=%s' % (seqs[0][0],seqs), res = []; i=0 while 1: nonemptyseqs=[seq for seq in seqs if seq] if not nonemptyseqs: return res i+=1; print '\n',i,'round: candidates...', for seq in nonemptyseqs: # find merge candidates among seq heads cand = seq[0]; print ' ',cand, nothead=[s for s in nonemptyseqs if cand in s[1:]] if nothead: cand=None #reject candidate else: break if not cand: raise "Inconsistent hierarchy" res.append(cand) for seq in nonemptyseqs: # remove cand if seq[0] == cand: del seq[0] def mro(C): "Compute the class precedence list (mro) according to C3" return merge([[C]]+map(mro,C.__bases__)+[list(C.__bases__)]) def print_mro(C): print '\nMRO[%s]=%s' % (C,mro(C)) print '\nP22 MRO[%s]=%s' % (C,C.mro()) print_mro(ex_9.Z) #</mro.py>
sv: #<mro.py> """C3-algoritm av Samuele Pedroni (med förbättrad läsbarhet av mig).""" klass __metaklass__(typ): "Alla klasser är metamagiskt modifierade för att bli snyggt utskrivna" __repr__ = lambda cls: cls.__name__ klass ex_2: "Allvarlig order oenighet" #Från Guido klass O: pass klass X(O): pass klass Y(O): pass klass A(X,Y): pass klass B(Y,X): pass försök: class Z(A,B): pass #skapar Z(A,B) i Python 2.2 except TypeError: pass # Z(A,B) kan inte skapas i Python 2.3 klass ex_5: "Mitt första exempel" klass O: pass klass F(O): pass klass E(O): pass klass D(O): pass klass C(D,F): pass klass B(D,E): pass klass A(B,C): pass klass ex_6: "Mitt andra exempel" klass O: pass klass F(O): pass klass E(O): pass klass D(O): pass klass C(D,F): pass klass B(E,D): pass klass A(B,C): pass klass ex_9: "Skillnad mellan Python 2.2 MRO och C3" #Från Samuele klass O: pass klass A(O): pass klass B(O): pass klass C(O): pass klass D(O): pass klass E(O): pass klass K1(A,B,C): godkänd klass K2(D,B,E): pass klass K3(D,A): pass klass Z(K1,K2,K3): pass def merge(seqs): print '\n\nCPL[%s]=%s' % (seqs[0][0],seqs), res = []; i=0 medan 1: nonemptyseqs=[seq for seq in seqs if seq] om inte nonemptyseqs: returnera res i+=1; print '\n',i,'runda: kandidater...', for seq in nonemptyseqs: # hitta sammanslagningskandidater bland seq-huvuden cand = seq[0]; print ' ',cand, nothead=[s for s in nonemptyseqs if cand in s[1:]]] if nothead: cand=None #avvisa kandidat annat: bryt if not cand: raise "Inkonsekvent hierarki" res.append(cand) for seq in nonemptyseqs: # ta bort cand if seq[0] == cand: del seq[0] def mro(C): "Beräkna klassens prioritetslista (mro) enligt C3" return merge([[C]]+map(mro,C.__bases__)+[list(C.__bases__)]) def print_mro(C): print '\nMRO[%s]=%s' % (C,mro(C)) print '\nP22 MRO[%s]=%s' % (C,C.mro()) print_mro(ex_9.Z) #</mro.py>

source: That's all folks,
sv: Det var allt, gott folk,

source: enjoy !
sv: njut!

source: Resources
sv: Resurser

source: The thread on python-dev started by Samuele Pedroni: https://mail.python.org/pipermail/python-dev/2002-October/029035.html
sv: Tråden på python-dev startad av Samuele Pedroni: https://mail.python.org/pipermail/python-dev/2002-October/029035.html

source: The paper *A Monotonic Superclass Linearization for Dylan*: https://doi.org/10.1145/236337.236343
sv: Uppsatsen *A Monotonic Superclass Linearization for Dylan*: https://doi.org/10.1145/236337.236343

source: Guido van Rossum's essay, *Unifying types and classes in Python 2.2*: https://web.archive.org/web/20140210194412/http://www.python.org/download/releases/2.2.2/descrintro
sv: Guido van Rossums uppsats, *Unifying types and classes in Python 2.2*: https://web.archive.org/web/20140210194412/http://www.python.org/download/releases/2.2.2/descrintro
