Repository: yeager/python-docs-sv
Catalog: howto/perf_profiling.po
Languages: sv

source: Python support for the Linux ``perf`` profiler
sv: Python-stöd för Linux-profileraren ``perf``

source: author
sv: författare

source: `The Linux perf profiler <https://perf.wiki.kernel.org>`_ is a very powerful tool that allows you to profile and obtain information about the performance of your application. ``perf`` also has a very vibrant ecosystem of tools that aid with the analysis of the data that it produces.
sv: linux perf profiler <https://perf.wiki.kernel.org>`_ är ett mycket kraftfullt verktyg som gör att du kan profilera och få information om prestandan i din applikation. ``perf`` har också ett mycket levande ekosystem av verktyg som hjälper till med analysen av de data som den producerar.

source: The main problem with using the ``perf`` profiler with Python applications is that ``perf`` only gets information about native symbols, that is, the names of functions and procedures written in C. This means that the names and file names of Python functions in your code will not appear in the output of ``perf``.
sv: Det största problemet med att använda profileraren ``perf`` med Python-program är att ``perf`` bara får information om inbyggda symboler, det vill säga namnen på funktioner och procedurer skrivna i C. Det innebär att namnen och filnamnen på Python-funktioner i din kod inte kommer att visas i utdata från ``perf``.

source: Since Python 3.12, the interpreter can run in a special mode that allows Python functions to appear in the output of the ``perf`` profiler. When this mode is enabled, the interpreter will interpose a small piece of code compiled on the fly before the execution of every Python function and it will teach ``perf`` the relationship between this piece of code and the associated Python function using :doc:`perf map files <../c-api/perfmaps>`.
sv: Sedan Python 3.12 kan tolken köras i ett speciellt läge som gör att Python-funktioner kan visas i utdata från profileraren ``perf``. När detta läge är aktiverat kommer tolken att lägga in en liten kodbit som kompileras i farten före exekveringen av varje Python-funktion och den kommer att lära ``perf`` förhållandet mellan denna kodbit och den associerade Python-funktionen med hjälp av :doc:`perf map files <../c-api/perfmaps>`.

source: Support for the ``perf`` profiler is currently only available for Linux on select architectures. Check the output of the ``configure`` build step or check the output of ``python -m sysconfig | grep HAVE_PERF_TRAMPOLINE`` to see if your system is supported.
sv: Stöd för profileraren ``perf`` finns för närvarande endast för Linux på utvalda arkitekturer. Kontrollera utdata från byggsteget ``configure`` eller kontrollera utdata från ``python -m sysconfig | grep HAVE_PERF_TRAMPOLINE`` för att se om ditt system stöds.

source: For example, consider the following script:
sv: Tänk till exempel på följande skript:

source: def foo(n): result = 0 for _ in range(n): result += 1 return result def bar(n): foo(n) def baz(n): bar(n) if __name__ == "__main__": baz(1000000)
sv: def foo(n): resultat = 0 för _ i intervall(n): resultat += 1 returnera resultat def bar(n): foo(n) def baz(n): bar(n) om __name__ == "__main__": baz(1000000)

source: We can run ``perf`` to sample CPU stack traces at 9999 hertz::
sv: Vi kan köra ``perf`` för att prova CPU-stackspårningar vid 9999 hertz::

source: Then we can use ``perf report`` to analyze the data:
sv: Sedan kan vi använda ``perf report`` för att analysera data:

source: As you can see, the Python functions are not shown in the output, only ``_PyEval_EvalFrameDefault`` (the function that evaluates the Python bytecode) shows up. Unfortunately that's not very useful because all Python functions use the same C function to evaluate bytecode so we cannot know which Python function corresponds to which bytecode-evaluating function.
sv: Som du kan se visas inte Python-funktionerna i utdata, bara ``_PyEval_EvalFrameDefault`` (funktionen som utvärderar Python-bytekoden) visas. Tyvärr är det inte särskilt användbart eftersom alla Python-funktioner använder samma C-funktion för att utvärdera bytecode, så vi kan inte veta vilken Python-funktion som motsvarar vilken bytecode-utvärderingsfunktion.

source: Instead, if we run the same experiment with ``perf`` support enabled we get:
sv: Istället, om vi kör samma experiment med ``perf`` support aktiverat får vi:

source: How to enable ``perf`` profiling support
sv: Så här aktiverar du profileringsstödet ``perf``

source: ``perf`` profiling support can be enabled either from the start using the environment variable :envvar:`PYTHONPERFSUPPORT` or the :option:`-X perf <-X>` option, or dynamically using :func:`sys.activate_stack_trampoline` and :func:`sys.deactivate_stack_trampoline`.
sv: profileringsstödet ``perf`` kan aktiveras antingen från början med hjälp av miljövariabeln :envvar:`PYTHONPERFSUPPORT` eller alternativet :option:`-X perf <-X>`, eller dynamiskt med hjälp av :func:`sys.activate_stack_trampoline` och :func:`sys.deactivate_stack_trampoline`.

source: The :mod:`!sys` functions take precedence over the :option:`!-X` option, the :option:`!-X` option takes precedence over the environment variable.
sv: Funktionerna :mod:`!sys` har företräde framför alternativet :option:`!-X`, alternativet :option:`!-X` har företräde framför miljövariabeln.

source: Example, using the environment variable::
sv: Exempel, med hjälp av miljövariabeln::

source: $ PYTHONPERFSUPPORT=1 perf record -F 9999 -g -o perf.data python my_script.py $ perf report -g -i perf.data
sv: $ PYTHONPERFSUPPORT=1 perf record -F 9999 -g -o perf.data python my_script.py $ perf rapport -g -i perf.data

source: Example, using the :option:`!-X` option::
sv: Exempel på användning av :option:`!-X` option::

source: $ perf record -F 9999 -g -o perf.data python -X perf my_script.py $ perf report -g -i perf.data
sv: $ perf record -F 9999 -g -o perf.data python -X perf my_script.py $ perf rapport -g -i perf.data

source: Example, using the :mod:`sys` APIs in file :file:`example.py`:
sv: Exempel på användning av API:erna :mod:`sys` i filen :file:`example.py`:

source: ...then::
sv: ...sedan..:

source: $ perf record -F 9999 -g -o perf.data python ./example.py $ perf report -g -i perf.data
sv: $ perf record -F 9999 -g -o perf.data python ./example.py $ perf rapport -g -i perf.data

source: How to obtain the best results
sv: Hur man uppnår bästa resultat

source: For best results, Python should be compiled with ``CFLAGS="-fno-omit-frame-pointer -mno-omit-leaf-frame-pointer"`` as this allows profilers to unwind using only the frame pointer and not on DWARF debug information. This is because as the code that is interposed to allow ``perf`` support is dynamically generated it doesn't have any DWARF debugging information available.
sv: För bästa resultat bör Python kompileras med ``CFLAGS="-fno-omit-frame-pointer -mno-omit-leaf-frame-pointer"`` eftersom detta gör det möjligt för profilerare att rulla ut med endast rampekaren och inte på DWARF-felsökningsinformation. Detta beror på att koden som läggs in för att tillåta ``perf``-stöd genereras dynamiskt och därför inte har någon DWARF-felsökningsinformation tillgänglig.

source: You can check if your system has been compiled with this flag by running::
sv: Du kan kontrollera om ditt system har kompilerats med denna flagga genom att köra::

source: If you don't see any output it means that your interpreter has not been compiled with frame pointers and therefore it may not be able to show Python functions in the output of ``perf``.
sv: Om du inte ser någon utmatning betyder det att din tolk inte har kompilerats med rampekare och därför kanske den inte kan visa Python-funktioner i utmatningen från ``perf``.

source: How to work without frame pointers
sv: Hur man arbetar utan rampekare

source: If you are working with a Python interpreter that has been compiled without frame pointers, you can still use the ``perf`` profiler, but the overhead will be a bit higher because Python needs to generate unwinding information for every Python function call on the fly. Additionally, ``perf`` will take more time to process the data because it will need to use the DWARF debugging information to unwind the stack and this is a slow process.
sv: Om du arbetar med en Python-tolk som har kompilerats utan rampekare kan du fortfarande använda profileraren ``perf``, men omkostnaderna blir lite högre eftersom Python måste generera avrullningsinformation för varje Python-funktionsanrop i farten. Dessutom kommer det att ta längre tid för ``perf`` att bearbeta data eftersom den måste använda DWARF-felsökningsinformationen för att spola tillbaka stacken och det är en långsam process.

source: To enable this mode, you can use the environment variable :envvar:`PYTHON_PERF_JIT_SUPPORT` or the :option:`-X perf_jit <-X>` option, which will enable the JIT mode for the ``perf`` profiler.
sv: För att aktivera det här läget kan du använda miljövariabeln :envvar:`PYTHON_PERF_JIT_SUPPORT` eller alternativet :option:`-X perf_jit <-X>`, som aktiverar JIT-läget för profileraren ``perf``.

source: Due to a bug in the ``perf`` tool, only ``perf`` versions higher than v6.8 will work with the JIT mode. The fix was also backported to the v6.7.2 version of the tool.
sv: På grund av en bugg i verktyget ``perf`` är det bara ``perf``-versioner som är högre än v6.8 som fungerar med JIT-läget. Fixen har även backporterats till v6.7.2-versionen av verktyget.

source: Note that when checking the version of the ``perf`` tool (which can be done by running ``perf version``) you must take into account that some distros add some custom version numbers including a ``-`` character. This means that ``perf 6.7-3`` is not necessarily ``perf 6.7.3``.
sv: Observera att när du kontrollerar versionen av verktyget ``perf`` (vilket kan göras genom att köra ``perf version``) måste du ta hänsyn till att vissa distros lägger till egna versionsnummer som innehåller tecknet ``-``. Detta innebär att ``perf 6.7-3`` inte nödvändigtvis är ``perf 6.7.3``.

source: When using the perf JIT mode, you need an extra step before you can run ``perf report``. You need to call the ``perf inject`` command to inject the JIT information into the ``perf.data`` file.::
sv: När du använder perf JIT-läget behöver du ett extra steg innan du kan köra ``perf report``. Du måste anropa kommandot ``perf inject`` för att injicera JIT-informationen i filen ``perf.data``:

source: $ perf record -F 9999 -g -k 1 --call-graph dwarf -o perf.data python -Xperf_jit my_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf report -g -i perf.jit.data
sv: $ perf record -F 9999 -g -k 1 --call-graph dwarf -o perf.data python -Xperf_jit my_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf rapport -g -i perf.jit.data

source: or using the environment variable::
sv: eller med hjälp av miljövariabeln::

source: $ PYTHON_PERF_JIT_SUPPORT=1 perf record -F 9999 -g --call-graph dwarf -o perf.data python my_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf report -g -i perf.jit.data
sv: $ PYTHON_PERF_JIT_SUPPORT=1 perf record -F 9999 -g --call-graph dwarf -o perf.data python my_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf rapport -g -i perf.jit.data

source: ``perf inject --jit`` command will read ``perf.data``, automatically pick up the perf dump file that Python creates (in ``/tmp/perf-$PID.dump``), and then create ``perf.jit.data`` which merges all the JIT information together. It should also create a lot of ``jitted-XXXX-N.so`` files in the current directory which are ELF images for all the JIT trampolines that were created by Python.
sv: kommandot ``perf inject --jit`` kommer att läsa ``perf.data``, automatiskt plocka upp den perf dump-fil som Python skapar (i ``/tmp/perf-$PID.dump``) och sedan skapa ``perf.jit.data`` som sammanfogar all JIT-information. Det bör också skapa en hel del ``jitted-XXXX-N.so``-filer i den aktuella katalogen som är ELF-bilder för alla JIT-trampoliner som skapades av Python.

source: When using ``--call-graph dwarf``, the ``perf`` tool will take snapshots of the stack of the process being profiled and save the information in the ``perf.data`` file. By default, the size of the stack dump is 8192 bytes, but you can change the size by passing it after a comma like ``--call-graph dwarf,16384``.
sv: När du använder ``--call-graph dwarf`` kommer verktyget ``perf`` att ta ögonblicksbilder av stacken i den process som profileras och spara informationen i filen ``perf.data``. Som standard är storleken på stackdumpen 8192 byte, men du kan ändra storleken genom att ange den efter ett kommatecken som ``--call-graph dwarf,16384``.

source: The size of the stack dump is important because if the size is too small ``perf`` will not be able to unwind the stack and the output will be incomplete. On the other hand, if the size is too big, then ``perf`` won't be able to sample the process as frequently as it would like as the overhead will be higher.
sv: Storleken på stackdumpen är viktig, för om den är för liten kan ``perf`` inte spola tillbaka stacken och utdata blir ofullständiga. Å andra sidan, om storleken är för stor, kommer ``perf`` inte att kunna sampla processen så ofta som den skulle vilja eftersom overhead blir högre.

source: The stack size is particularly important when profiling Python code compiled with low optimization levels (like ``-O0``), as these builds tend to have larger stack frames. If you are compiling Python with ``-O0`` and not seeing Python functions in your profiling output, try increasing the stack dump size to 65528 bytes (the maximum)::
sv: Stackstorleken är särskilt viktig vid profilering av Python-kod som kompilerats med låga optimeringsnivåer (som ``-O0``), eftersom dessa kompileringar tenderar att ha större stackramar. Om du kompilerar Python med ``-O0`` och inte ser Python-funktioner i din profileringsutdata, försök att öka stackdumpstorleken till 65528 byte (max)::

source: Different compilation flags can significantly impact stack sizes:
sv: Olika kompileringsflaggor kan påverka stackstorleken avsevärt:

source: Builds with ``-O0`` typically have much larger stack frames than those with ``-O1`` or higher
sv: Byggnader med ``-O0`` har vanligtvis mycket större stapelramar än de med ``-O1`` eller högre

source: Adding optimizations (``-O1``, ``-O2``, etc.) typically reduces stack size
sv: Att lägga till optimeringar (``-O1``, ``-O2``, etc.) minskar vanligtvis stackstorleken

source: Frame pointers (``-fno-omit-frame-pointer``) generally provide more reliable stack unwinding
sv: Frame-pekare (``-fno-omit-frame-pointer``) ger i allmänhet mer tillförlitlig stackavveckling
