Repository: yeager/python-docs-sv
Catalog: howto/regex.po
Languages: sv

source: Usually ``^`` matches only at the beginning of the string, and ``$`` matches only at the end of the string and immediately before the newline (if any) at the end of the string. When this flag is specified, ``^`` matches at the beginning of the string and at the beginning of each line within the string, immediately following each newline. Similarly, the ``$`` metacharacter matches either at the end of the string and at the end of each line (immediately preceding each newline).
sv: Vanligtvis matchar ``^`` endast i början av strängen, och ``$`` matchar endast i slutet av strängen och omedelbart före den nya raden (om någon) i slutet av strängen. När denna flagga anges matchar ``^`` i början av strängen och i början av varje rad i strängen, omedelbart efter varje ny rad. På samma sätt matchar metatecknet ``$`` antingen i slutet av strängen eller i slutet av varje rad (omedelbart före varje ny rad).

source: Makes the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline.
sv: Gör att specialtecknet ``'.'`` matchar vilket tecken som helst, inklusive en ny rad; utan denna flagga matchar ``'.'`` allt *utom* en ny rad.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns.
sv: Få ``w``, ``W``, ``b``, ``B``, ``s`` och ``S`` att utföra matchning med enbart ASCII istället för fullständig Unicode-matchning. Detta är endast meningsfullt för Unicode-mönster och ignoreras för bytemönster.

source: This flag allows you to write regular expressions that are more readable by granting you more flexibility in how you can format them. When this flag has been specified, whitespace within the RE string is ignored, except when the whitespace is in a character class or preceded by an unescaped backslash; this lets you organize and indent the RE more clearly. This flag also lets you put comments within a RE that will be ignored by the engine; comments are marked by a ``'#'`` that's neither in a character class or preceded by an unescaped backslash.
sv: Med den här flaggan kan du skriva reguljära uttryck som är mer läsbara genom att du får mer flexibilitet i hur du kan formatera dem. När den här flaggan har angetts ignoreras blanksteg i RE-strängen, utom när blanksteget är i en teckenklass eller föregås av en obegränsad backslash; detta gör att du kan organisera och indentera RE mer tydligt. Med den här flaggan kan du också lägga in kommentarer i en RE som ignoreras av motorn; kommentarer markeras med en ``'#'`` som varken är i en teckenklass eller föregås av ett okapslat backslash.

source: For example, here's a RE that uses :const:`re.VERBOSE`; see how much easier it is to read? ::
sv: Här är till exempel en RE som använder :const:`re.VERBOSE`; ser du hur mycket lättare den är att läsa? ::

source: charref = re.compile(r""" &[#] # Start of a numeric entity reference ( 0[0-7]+ # Octal form | [0-9]+ # Decimal form | x[0-9a-fA-F]+ # Hexadecimal form ) ; # Trailing semicolon """, re.VERBOSE)
sv: charref = re.compile(r""" &[#] # Början på en numerisk enhetsreferens ( 0[0-7]+ # oktal form | [0-9]+ # Decimalform | x[0-9a-fA-F]+ # Hexadecimal form ) ; # Efterföljande semikolon """, re.VERBOSE)

source: Without the verbose setting, the RE would look like this::
sv: Utan verbose-inställningen skulle RE se ut så här::

source: In the above example, Python's automatic concatenation of string literals has been used to break up the RE into smaller pieces, but it's still more difficult to understand than the version using :const:`re.VERBOSE`.
sv: I exemplet ovan har Pythons automatiska konkatenering av stränglitteraler använts för att bryta upp RE i mindre bitar, men det är fortfarande svårare att förstå än den version som använder :const:`re.VERBOSE`.

source: More Pattern Power
sv: Mer mönsterkraft

source: So far we've only covered a part of the features of regular expressions. In this section, we'll cover some new metacharacters, and how to use groups to retrieve portions of the text that was matched.
sv: Hittills har vi bara gått igenom en del av funktionerna i reguljära uttryck. I det här avsnittet går vi igenom några nya metatecken och hur man använder grupper för att hämta delar av den text som matchades.

source: More Metacharacters
sv: Fler metakaraktärer

source: There are some metacharacters that we haven't covered yet. Most of them will be covered in this section.
sv: Det finns några metakaraktärer som vi inte har gått igenom ännu. De flesta av dem kommer att tas upp i detta avsnitt.

source: Some of the remaining metacharacters to be discussed are :dfn:`zero-width assertions`. They don't cause the engine to advance through the string; instead, they consume no characters at all, and simply succeed or fail. For example, ``\b`` is an assertion that the current position is located at a word boundary; the position isn't changed by the ``\b`` at all. This means that zero-width assertions should never be repeated, because if they match once at a given location, they can obviously be matched an infinite number of times.
sv: Några av de återstående metatecken som skall diskuteras är :dfn:`zero-width assertions`. De gör inte att motorn avancerar genom strängen, utan de förbrukar inga tecken alls och lyckas eller misslyckas helt enkelt. Till exempel är ``b`` ett påstående om att den aktuella positionen ligger vid en ordgräns; positionen ändras inte alls av ``b``. Detta innebär att påståenden med nollbredd aldrig bör upprepas, för om de matchar en gång på en given plats kan de uppenbarligen matchas ett oändligt antal gånger.

source: Alternation, or the "or" operator. If *A* and *B* are regular expressions, ``A|B`` will match any string that matches either *A* or *B*. ``|`` has very low precedence in order to make it work reasonably when you're alternating multi-character strings. ``Crow|Servo`` will match either ``'Crow'`` or ``'Servo'``, not ``'Cro'``, a ``'w'`` or an ``'S'``, and ``'ervo'``.
sv: Alternation, eller operatorn "eller". Om *A* och *B* är reguljära uttryck kommer ``A|B`` att matcha alla strängar som matchar antingen *A* eller *B*. ``|`` har mycket låg prioritet för att det ska fungera på ett rimligt sätt när du växlar strängar med flera tecken. ``Crow|Servo`` kommer att matcha antingen ``'Crow'`` eller ``'Servo'``, inte ``'Cro'``, ett ``'w'`` eller ett ``'S'``, och ``'ervo'``.

source: To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
sv: Om du vill matcha en bokstavlig ``'|'`` använder du ``\|` eller omsluter den i en teckenklass, som i ``[|]``.

source: Matches at the beginning of lines. Unless the :const:`MULTILINE` flag has been set, this will only match at the beginning of the string. In :const:`MULTILINE` mode, this also matches immediately after each newline within the string.
sv: Matchar i början av raderna. Om inte flaggan :const:`MULTILINE` har angetts, matchar detta endast i början av strängen. I :const:`MULTILINE`-läget matchar detta även omedelbart efter varje ny rad i strängen.

source: For example, if you wish to match the word ``From`` only at the beginning of a line, the RE to use is ``^From``. ::
sv: Om du till exempel vill matcha ordet ``From`` endast i början av en rad, är RE att använda ``^From``. ::

source: >>> print(re.search('^From', 'From Here to Eternity')) <re.Match object; span=(0, 4), match='From'> >>> print(re.search('^From', 'Reciting From Memory')) None
sv: >>> print(re.search('^From', 'Härifrån till evigheten')) <re.Match-objekt; span=(0, 4), match='From'> >>> print(re.search('^From'), 'Reciting From Memory') >>> print(re.search('^From', 'Reciterar ur minnet')) Ingen

source: To match a literal ``'^'``, use ``\^``.
sv: Om du vill matcha en bokstavlig ``'^'`` använder du ``^``.

source: Matches at the end of a line, which is defined as either the end of the string, or any location followed by a newline character. ::
sv: Matchar i slutet av en rad, vilket definieras som antingen slutet av strängen eller en plats som följs av ett tecken för ny rad. ::

source: >>> print(re.search('}$', '{block}')) <re.Match object; span=(6, 7), match='}'> >>> print(re.search('}$', '{block} ')) None >>> print(re.search('}$', '{block}\n')) <re.Match object; span=(6, 7), match='}'>
sv: >>> print(re.search('}$', '{block}')) <re.Match-objekt; span=(6, 7), match='}'> >>> print(re.search('}$', '{block} ') >>> print(re.search('}$', '{block} ')) Ingen >>> print(re.search('}$', '{block}\n')) <re.match-objekt; span=(6, 7), match='}'>

source: To match a literal ``'$'``, use ``\$`` or enclose it inside a character class, as in ``[$]``.
sv: Om du vill matcha en bokstavlig ``'$'`` använder du ``\$`` eller omsluter den med en teckenklass, som i ``[$]``.

source: Matches only at the start of the string. When not in :const:`MULTILINE` mode, ``\A`` and ``^`` are effectively the same. In :const:`MULTILINE` mode, they're different: ``\A`` still matches only at the beginning of the string, but ``^`` may match at any location inside the string that follows a newline character.
sv: Matchar endast i början av strängen. När det inte är i :const:`MULTILINE`-läge är ``A`` och ``^`` i praktiken samma sak. I :const:`MULTILINE`-läget är de olika: ``A`` matchar fortfarande bara i början av strängen, men ``^`` kan matcha på vilken plats som helst i strängen som följer efter ett newline-tecken.

source: Matches only at the end of the string.
sv: Matchar endast i slutet av strängen.

source: The same as ``\z``. For compatibility with old Python versions.
sv: Samma som ``z``. För kompatibilitet med gamla Python-versioner.

source: Word boundary. This is a zero-width assertion that matches only at the beginning or end of a word. A word is defined as a sequence of alphanumeric characters, so the end of a word is indicated by whitespace or a non-alphanumeric character.
sv: Ordgräns. Detta är en assertion med noll bredd som endast matchar i början eller slutet av ett ord. Ett ord definieras som en sekvens av alfanumeriska tecken, så slutet av ett ord indikeras av blanksteg eller ett icke-alfanumeriskt tecken.

source: The following example matches ``class`` only when it's a complete word; it won't match when it's contained inside another word. ::
sv: Följande exempel matchar ``class`` endast när det är ett helt ord; det kommer inte att matcha när det ingår i ett annat ord. ::

source: >>> p = re.compile(r'\bclass\b') >>> print(p.search('no class at all')) <re.Match object; span=(3, 8), match='class'> >>> print(p.search('the declassified algorithm')) None >>> print(p.search('one subclass is')) None
sv: >>> p = re.compile(r'\bclass\b') >>> print(p.search('ingen klass alls')) <re.Match-objekt; span=(3, 8), match='class'> >>> print(p.search('den avklassificerade algoritmen')) Ingen >>> print(p.search('en underklass är')) Ingen

source: There are two subtleties you should remember when using this special sequence. First, this is the worst collision between Python's string literals and regular expression sequences. In Python's string literals, ``\b`` is the backspace character, ASCII value 8. If you're not using raw strings, then Python will convert the ``\b`` to a backspace, and your RE won't match as you expect it to. The following example looks the same as our previous RE, but omits the ``'r'`` in front of the RE string. ::
sv: Det finns två saker du bör komma ihåg när du använder den här speciella sekvensen. För det första är detta den värsta kollisionen mellan Pythons stränglitteraler och sekvenser för reguljära uttryck. I Pythons stränglitteraler är ``b`` backspace-tecknet, ASCII-värde 8. Om du inte använder råa strängar kommer Python att konvertera ``b`` till ett backsteg, och din RE kommer inte att matcha som du förväntar dig att den ska göra. Följande exempel ser likadant ut som vår föregående RE, men utelämnar ``'r`` framför RE-strängen. ::

source: >>> p = re.compile('\bclass\b') >>> print(p.search('no class at all')) None >>> print(p.search('\b' + 'class' + '\b')) <re.Match object; span=(0, 7), match='\x08class\x08'>
sv: >>> p = re.compile('\bclass\b') >>> print(p.search('ingen klass alls')) Ingen >>> print(p.search('\b' + 'class' + '\b')) <re.Match-objekt; span=(0, 7), match='\x08class\x08'>

source: Second, inside a character class, where there's no use for this assertion, ``\b`` represents the backspace character, for compatibility with Python's string literals.
sv: För det andra, i en teckenklass, där det inte finns någon användning för detta påstående, representerar ``b`` backspace-tecknet, för kompatibilitet med Pythons stränglitteraler.

source: Another zero-width assertion, this is the opposite of ``\b``, only matching when the current position is not at a word boundary.
sv: Detta är motsatsen till ``b`` och matchar bara när den aktuella positionen inte ligger vid en ordgräns.

source: Grouping
sv: Gruppering

source: Frequently you need to obtain more information than just whether the RE matched or not. Regular expressions are often used to dissect strings by writing a RE divided into several subgroups which match different components of interest. For example, an RFC-822 header line is divided into a header name and a value, separated by a ``':'``, like this:
sv: Ofta behöver man mer information än bara om RE:n matchar eller inte. Reguljära uttryck används ofta för att dissekera strängar genom att skriva en RE som är uppdelad i flera undergrupper som matchar olika komponenter av intresse. En rubrikrad i RFC-822 delas t.ex. upp i ett rubriknamn och ett värde, åtskilda av ett ``':'``, så här:

source: From: author@example.com User-Agent: Thunderbird 1.5.0.9 (X11/20061227) MIME-Version: 1.0 To: editor@example.com
sv: Från: author@example.com Användar-Agent: Thunderbird 1.5.0.9 (X11/20061227) MIME-version: 1.0 Till: editor@example.com

source: This can be handled by writing a regular expression which matches an entire header line, and has one group which matches the header name, and another group which matches the header's value.
sv: Detta kan hanteras genom att skriva ett reguljärt uttryck som matchar en hel rubrikrad och har en grupp som matchar rubrikens namn och en annan grupp som matchar rubrikens värde.

source: Groups are marked by the ``'('``, ``')'`` metacharacters. ``'('`` and ``')'`` have much the same meaning as they do in mathematical expressions; they group together the expressions contained inside them, and you can repeat the contents of a group with a quantifier, such as ``*``, ``+``, ``?``, or ``{m,n}``. For example, ``(ab)*`` will match zero or more repetitions of ``ab``. ::
sv: Grupper markeras med metatecknen ``'('``, ``')'``. ``'('`` och ``')'`` har ungefär samma betydelse som de har i matematiska uttryck; de grupperar de uttryck som finns inuti dem, och du kan upprepa innehållet i en grupp med en kvantifierare, till exempel ``*``, ``+``, ``?`` eller ``{m,n}``. Till exempel kommer ``(ab)*`` att matcha noll eller fler upprepningar av ``ab``. ::

source: Groups indicated with ``'('``, ``')'`` also capture the starting and ending index of the text that they match; this can be retrieved by passing an argument to :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, and :meth:`~re.Match.span`. Groups are numbered starting with 0. Group 0 is always present; it's the whole RE, so :ref:`match object <match-objects>` methods all have group 0 as their default argument. Later we'll see how to express groups that don't capture the span of text that they match. ::
sv: Grupper som indikeras med ``'('``, ``')'`` fångar också start- och slutindex för texten som de matchar; detta kan hämtas genom att skicka ett argument till :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, och :meth:`~re.Match.span`. Grupperna är numrerade med början på 0. Grupp 0 finns alltid; det är hela RE, så :ref:`match object <match-objects>` -metoderna har alla grupp 0 som standardargument. Senare ska vi se hur man uttrycker grupper som inte fångar det textavsnitt som de matchar. ::

source: >>> p = re.compile('(a)b') >>> m = p.match('ab') >>> m.group() 'ab' >>> m.group(0) 'ab'
sv: >>> p = re.compile('(a)b') >>> m = p.match('ab') >>> m.group() 'ab' >>> m.grupp(0) 'ab'

source: Subgroups are numbered from left to right, from 1 upward. Groups can be nested; to determine the number, just count the opening parenthesis characters, going from left to right. ::
sv: Undergrupperna numreras från vänster till höger, från 1 och uppåt. Grupper kan vara kapslade; för att bestämma antalet räknar man bara de inledande parentestecknen från vänster till höger. ::

source: >>> p = re.compile('(a(b)c)d') >>> m = p.match('abcd') >>> m.group(0) 'abcd' >>> m.group(1) 'abc' >>> m.group(2) 'b'
sv: >>> p = re.compile('(a(b)c)d') >>> m = p.match('abcd') >>> m.group(0) 'abcd' >>> m.grupp(1) 'abc' >>> m.grupp(2) 'b'

source: :meth:`~re.Match.group` can be passed multiple group numbers at a time, in which case it will return a tuple containing the corresponding values for those groups. ::
sv: :meth:`~re.Match.group` kan ges flera gruppnummer åt gången, i vilket fall den kommer att returnera en tupel som innehåller motsvarande värden för dessa grupper. ::

source: >>> m.group(2,1,2) ('b', 'abc', 'b')
sv: >>> m.grupp(2,1,2) ('b', 'abc', 'b')

source: The :meth:`~re.Match.groups` method returns a tuple containing the strings for all the subgroups, from 1 up to however many there are. ::
sv: Metoden :meth:`~re.Match.groups` returnerar en tupel som innehåller strängarna för alla undergrupper, från 1 upp till hur många som helst. ::

source: >>> m.groups() ('abc', 'b')
sv: >>> m.grupper() ('abc', 'b')

source: Backreferences in a pattern allow you to specify that the contents of an earlier capturing group must also be found at the current location in the string. For example, ``\1`` will succeed if the exact contents of group 1 can be found at the current position, and fails otherwise. Remember that Python's string literals also use a backslash followed by numbers to allow including arbitrary characters in a string, so be sure to use a raw string when incorporating backreferences in a RE.
sv: Med hjälp av bakåtreferenser i ett mönster kan du ange att innehållet i en tidigare fångad grupp också måste finnas på den aktuella platsen i strängen. Till exempel kommer ``1`` att lyckas om det exakta innehållet i grupp 1 kan hittas på den aktuella positionen, och misslyckas annars. Kom ihåg att Pythons stränglitteraler också använder ett backslash följt av siffror för att tillåta att godtyckliga tecken inkluderas i en sträng, så se till att använda en rå sträng när du införlivar bakåtreferenser i en RE.

source: For example, the following RE detects doubled words in a string. ::
sv: Följande RE upptäcker till exempel dubbla ord i en sträng: ::

source: >>> p = re.compile(r'\b(\w+)\s+\1\b') >>> p.search('Paris in the the spring').group() 'the the'
sv: >>> p = re.compile(r'\b(\w+)\s+\1\b') >>> p.search('Paris under våren').group() 'den den'

source: Backreferences like this aren't often useful for just searching through a string --- there are few text formats which repeat data in this way --- but you'll soon find out that they're *very* useful when performing string substitutions.
sv: Sådana här backreferenser är inte ofta användbara för att bara söka igenom en sträng --- det finns få textformat som upprepar data på det här sättet --- men du kommer snart att upptäcka att de är *mycket* användbara när du utför strängsubstitutioner.

source: Non-capturing and Named Groups
sv: Icke-fångande och namngivna grupper

source: Elaborate REs may use many groups, both to capture substrings of interest, and to group and structure the RE itself. In complex REs, it becomes difficult to keep track of the group numbers. There are two features which help with this problem. Both of them use a common syntax for regular expression extensions, so we'll look at that first.
sv: I komplicerade RE:er kan många grupper användas, både för att fånga upp intressanta delsträngar och för att gruppera och strukturera själva RE:n. I komplexa RE:er blir det svårt att hålla reda på gruppnumren. Det finns två funktioner som hjälper till att lösa detta problem. Båda använder en gemensam syntax för tillägg till reguljära uttryck, så vi tittar på det först.

source: Perl 5 is well known for its powerful additions to standard regular expressions. For these new features the Perl developers couldn't choose new single-keystroke metacharacters or new special sequences beginning with ``\`` without making Perl's regular expressions confusingly different from standard REs. If they chose ``&`` as a new metacharacter, for example, old expressions would be assuming that ``&`` was a regular character and wouldn't have escaped it by writing ``\&`` or ``[&]``.
sv: Perl 5 är välkänt för sina kraftfulla tillägg till reguljära standarduttryck. För dessa nya funktioner kunde Perl-utvecklarna inte välja nya metatecken för enstaka tangenttryckningar eller nya specialsekvenser som börjar med ````` utan att göra Perls reguljära uttryck förvirrande annorlunda än standard REs. Om de till exempel valde ``&`` som ett nytt metatecken, skulle gamla uttryck anta att ``&`` var ett reguljärt tecken och skulle inte ha undkommit det genom att skriva ``&`` eller ``[&]``.

source: The solution chosen by the Perl developers was to use ``(?...)`` as the extension syntax. ``?`` immediately after a parenthesis was a syntax error because the ``?`` would have nothing to repeat, so this didn't introduce any compatibility problems. The characters immediately after the ``?`` indicate what extension is being used, so ``(?=foo)`` is one thing (a positive lookahead assertion) and ``(?:foo)`` is something else (a non-capturing group containing the subexpression ``foo``).
sv: Den lösning som Perl-utvecklarna valde var att använda ``(?...)`` som utvidgningssyntax. ``?`` omedelbart efter en parentes var ett syntaxfel eftersom ``?`` inte skulle ha något att upprepa, så detta medförde inga kompatibilitetsproblem. Tecknen omedelbart efter ``?`` anger vilket tillägg som används, så ``(?=foo)`` är en sak (ett positivt lookahead-assertion) och ``(?:foo)`` är något annat (en icke-fångande grupp som innehåller underuttrycket ``foo``).

source: Python supports several of Perl's extensions and adds an extension syntax to Perl's extension syntax. If the first character after the question mark is a ``P``, you know that it's an extension that's specific to Python.
sv: Python stöder flera av Perls tillägg och lägger till en tilläggssyntax till Perls tilläggssyntax. Om det första tecknet efter frågetecknet är ett ``P`` vet du att det är ett tillägg som är specifikt för Python.

source: Now that we've looked at the general extension syntax, we can return to the features that simplify working with groups in complex REs.
sv: Nu när vi har tittat på den allmänna syntaxen för tillägg kan vi återgå till de funktioner som förenklar arbetet med grupper i komplexa RE:er.

source: Sometimes you'll want to use a group to denote a part of a regular expression, but aren't interested in retrieving the group's contents. You can make this fact explicit by using a non-capturing group: ``(?:...)``, where you can replace the ``...`` with any other regular expression. ::
sv: Ibland vill du använda en grupp för att beteckna en del av ett reguljärt uttryck, men du är inte intresserad av att hämta gruppens innehåll. Du kan göra detta faktum explicit genom att använda en icke-fångande grupp: ``(?:...)``, där du kan ersätta ``...`` med vilket annat reguljärt uttryck som helst. ::
