Repository: yeager/python-docs-sv
Catalog: howto/regex.po
Languages: sv

source: >>> m = re.match("([abc])+", "abc") >>> m.groups() ('c',) >>> m = re.match("(?:[abc])+", "abc") >>> m.groups() ()
sv: >>> m = re.match("([abc])+", "abc") >>> m.grupper() ('c',) >>> m = re.match("(?:[abc])+", "abc") >>> m.grupper() ()

source: Except for the fact that you can't retrieve the contents of what the group matched, a non-capturing group behaves exactly the same as a capturing group; you can put anything inside it, repeat it with a repetition metacharacter such as ``*``, and nest it within other groups (capturing or non-capturing). ``(?:...)`` is particularly useful when modifying an existing pattern, since you can add new groups without changing how all the other groups are numbered. It should be mentioned that there's no performance difference in searching between capturing and non-capturing groups; neither form is any faster than the other.
sv: Förutom det faktum att du inte kan hämta innehållet i det som gruppen matchade, beter sig en icke-fångande grupp exakt likadant som en fångande grupp; du kan lägga in vad som helst i den, upprepa den med ett metatecken för upprepning som ``*`` och nesta den i andra grupper (fångande eller icke-fångande). ``(?:...)`` är särskilt användbart när du ändrar ett befintligt mönster, eftersom du kan lägga till nya grupper utan att ändra hur alla andra grupper är numrerade. Det bör nämnas att det inte finns någon prestandaskillnad i sökningen mellan fångande och icke-fångande grupper; ingen av formerna är snabbare än den andra.

source: A more significant feature is named groups: instead of referring to them by numbers, groups can be referenced by a name.
sv: En mer betydelsefull funktion är namngivna grupper: i stället för att hänvisa till dem med nummer kan grupper hänvisas till med ett namn.

source: The syntax for a named group is one of the Python-specific extensions: ``(?P<name>...)``. *name* is, obviously, the name of the group. Named groups behave exactly like capturing groups, and additionally associate a name with a group. The :ref:`match object <match-objects>` methods that deal with capturing groups all accept either integers that refer to the group by number or strings that contain the desired group's name. Named groups are still given numbers, so you can retrieve information about a group in two ways::
sv: Syntaxen för en namngiven grupp är ett av de Python-specifika tilläggen: ``(?P<name>...)``. *name* är naturligtvis namnet på gruppen. Namngivna grupper beter sig precis som fångande grupper, och associerar dessutom ett namn med en grupp. Metoderna :ref:`match object <match-objects>` som hanterar fångande grupper accepterar alla antingen heltal som hänvisar till gruppen med nummer eller strängar som innehåller den önskade gruppens namn. Namngivna grupper ges fortfarande nummer, så du kan hämta information om en grupp på två sätt::

source: >>> p = re.compile(r'(?P<word>\b\w+\b)') >>> m = p.search( '(((( Lots of punctuation )))' ) >>> m.group('word') 'Lots' >>> m.group(1) 'Lots'
sv: &gt;&gt;&gt; p = re.compile(r'(?P<word>\b\w+\b)') &gt;&gt;&gt; m = p.search( '(((( Massor av skiljetecken )))' ) &gt;&gt;&gt; m.group('ord') 'Massor' &gt;&gt;&gt; m.grupp(1) 'Massor'

source: Additionally, you can retrieve named groups as a dictionary with :meth:`~re.Match.groupdict`::
sv: Dessutom kan du hämta namngivna grupper som en ordbok med :meth:`~re.Match.groupdict`::

source: >>> m = re.match(r'(?P<first>\w+) (?P<last>\w+)', 'Jane Doe') >>> m.groupdict() {'first': 'Jane', 'last': 'Doe'}
sv: &gt;&gt;&gt; m = re.match(r'(?P<first>\w+) (?P<last>\w+)', 'Jane Doe') &gt;&gt;&gt; m.groupdict() {'first': 'Jane', 'last': 'Doe'}

source: Named groups are handy because they let you use easily remembered names, instead of having to remember numbers. Here's an example RE from the :mod:`imaplib` module::
sv: Namngivna grupper är praktiska eftersom de låter dig använda namn som är lätta att komma ihåg, istället för att behöva komma ihåg siffror. Här är ett exempel på RE från modulen :mod:`imaplib`::

source: InternalDate = re.compile(r'INTERNALDATE "' r'(?P<day>[ 123][0-9])-(?P<mon>[A-Z][a-z][a-z])-' r'(?P<year>[0-9][0-9][0-9][0-9])' r' (?P<hour>[0-9][0-9]):(?P<min>[0-9][0-9]):(?P<sec>[0-9][0-9])' r' (?P<zonen>[-+])(?P<zoneh>[0-9][0-9])(?P<zonem>[0-9][0-9])' r'"')
sv: InternalDate = re.compile(r'INTERNALDATE "' r'(?P<day>[ 123][0-9])-(?P<mon>[A-Z][a-z][a-z])-' r'(?P<year>[0-9][0-9][0-9][0-9][0-9])'' r' (?P<hour>[0-9][0-9]):(?P<min>[0-9][0-9]):(?P<sec>[0-9][0-9])' r' (?P<zonen>[-+])(?P<zoneh>[0-9][0-9])(?P<zonem>[0-9][0-9])' r'"')

source: It's obviously much easier to retrieve ``m.group('zonem')``, instead of having to remember to retrieve group 9.
sv: Det är uppenbarligen mycket enklare att hämta ``m.group('zonem')``, istället för att behöva komma ihåg att hämta grupp 9.

source: The syntax for backreferences in an expression such as ``(...)\1`` refers to the number of the group. There's naturally a variant that uses the group name instead of the number. This is another Python extension: ``(?P=name)`` indicates that the contents of the group called *name* should again be matched at the current point. The regular expression for finding doubled words, ``\b(\w+)\s+\1\b`` can also be written as ``\b(?P<word>\w+)\s+(?P=word)\b``::
sv: Syntaxen för backreferenser i ett uttryck som ``(...)\1`` hänvisar till gruppens nummer. Det finns naturligtvis en variant som använder gruppnamnet i stället för numret. Detta är ett annat Python-tillägg: ``(?P=namn)`` indikerar att innehållet i gruppen som heter *namn* återigen ska matchas vid den aktuella punkten. Det reguljära uttrycket för att hitta dubblerade ord, ``\b(\w+)\s+\1\b`` kan också skrivas som ``\b(?P<word>\w+)\s+(?P=ord)\b``::

source: >>> p = re.compile(r'\b(?P<word>\w+)\s+(?P=word)\b') >>> p.search('Paris in the the spring').group() 'the the'
sv: &gt;&gt;&gt; p = re.compile(r'\b(?P<word>\w+)\s+(?P=ord)\b') &gt;&gt;&gt; p.search('Paris på våren').group() 'den den'

source: Lookahead Assertions
sv: Förutseende påståenden

source: Another zero-width assertion is the lookahead assertion. Lookahead assertions are available in both positive and negative form, and look like this:
sv: Ett annat nollbreddsassertion är lookahead-assertion. Lookahead-assertions finns i både positiv och negativ form och ser ut så här:

source: Positive lookahead assertion. This succeeds if the contained regular expression, represented here by ``...``, successfully matches at the current location, and fails otherwise. But, once the contained expression has been tried, the matching engine doesn't advance at all; the rest of the pattern is tried right where the assertion started.
sv: Positivt påstående om lookahead. Detta lyckas om det ingående reguljära uttrycket, som här representeras av ``...``, framgångsrikt matchar på den aktuella platsen, och misslyckas annars. Men när det inneslutna uttrycket har prövats går matchningsmotorn inte vidare alls; resten av mönstret prövas precis där påståendet började.

source: Negative lookahead assertion. This is the opposite of the positive assertion; it succeeds if the contained expression *doesn't* match at the current position in the string.
sv: Negativt framåtblickande påstående. Detta är motsatsen till det positiva påståendet; det lyckas om det ingående uttrycket *inte* matchar vid den aktuella positionen i strängen.

source: To make this concrete, let's look at a case where a lookahead is useful. Consider a simple pattern to match a filename and split it apart into a base name and an extension, separated by a ``.``. For example, in ``news.rc``, ``news`` is the base name, and ``rc`` is the filename's extension.
sv: För att konkretisera detta ska vi titta på ett fall där en lookahead är användbar. Tänk på ett enkelt mönster för att matcha ett filnamn och dela upp det i ett basnamn och ett tillägg, åtskilda av en ``.``. I till exempel ``news.rc`` är ``news`` basnamnet och ``rc`` är filnamnets tillägg.

source: The pattern to match this is quite simple:
sv: Mönstret för att matcha detta är ganska enkelt:

source: Notice that the ``.`` needs to be treated specially because it's a metacharacter, so it's inside a character class to only match that specific character. Also notice the trailing ``$``; this is added to ensure that all the rest of the string must be included in the extension. This regular expression matches ``foo.bar`` and ``autoexec.bat`` and ``sendmail.cf`` and ``printers.conf``.
sv: Lägg märke till att ``.`` måste behandlas speciellt eftersom det är ett metatecken, så det är inuti en teckenklass som bara matchar det specifika tecknet. Lägg också märke till det efterföljande ``$``; detta läggs till för att säkerställa att resten av strängen måste inkluderas i tillägget. Detta reguljära uttryck matchar ``foo.bar`` och ``autoexec.bat`` och ``endmail.cf`` och ``printers.conf``.

source: Now, consider complicating the problem a bit; what if you want to match filenames where the extension is not ``bat``? Some incorrect attempts:
sv: Tänk nu på att komplicera problemet lite; vad händer om du vill matcha filnamn där tillägget inte är ``bat``? Några felaktiga försök:

source: The first attempt above tries to exclude ``bat`` by requiring that the first character of the extension is not a ``b``. This is wrong, because the pattern also doesn't match ``foo.bar``.
sv: Det första försöket ovan försöker utesluta ``bat`` genom att kräva att det första tecknet i tillägget inte är ett ``b``. Detta är fel, eftersom mönstret inte heller matchar ``foo.bar``.

source: The expression gets messier when you try to patch up the first solution by requiring one of the following cases to match: the first character of the extension isn't ``b``; the second character isn't ``a``; or the third character isn't ``t``. This accepts ``foo.bar`` and rejects ``autoexec.bat``, but it requires a three-letter extension and won't accept a filename with a two-letter extension such as ``sendmail.cf``. We'll complicate the pattern again in an effort to fix it.
sv: Uttrycket blir rörigare när du försöker lappa ihop den första lösningen genom att kräva att något av följande fall ska matcha: det första tecknet i tillägget är inte ``b``; det andra tecknet är inte ``a``; eller det tredje tecknet är inte ``t``. Detta accepterar ``foo.bar`` och avvisar ``autoexec.bat``, men det kräver ett tillägg på tre bokstäver och accepterar inte ett filnamn med ett tillägg på två bokstäver som ``endmail.cf``. Vi ska komplicera mönstret igen i ett försök att lösa det.

source: In the third attempt, the second and third letters are all made optional in order to allow matching extensions shorter than three characters, such as ``sendmail.cf``.
sv: I det tredje försöket görs den andra och tredje bokstaven valfria för att möjliggöra matchning av tillägg som är kortare än tre tecken, t.ex. ``sendmail.cf``.

source: The pattern's getting really complicated now, which makes it hard to read and understand. Worse, if the problem changes and you want to exclude both ``bat`` and ``exe`` as extensions, the pattern would get even more complicated and confusing.
sv: Mönstret börjar bli riktigt komplicerat nu, vilket gör det svårt att läsa och förstå. Än värre, om problemet ändras och du vill utesluta både ``bat`` och ``exe`` som tillägg, skulle mönstret bli ännu mer komplicerat och förvirrande.

source: A negative lookahead cuts through all this confusion:
sv: En negativ framåtblickande prognos skär igenom all denna förvirring:

source: The negative lookahead means: if the expression ``bat`` doesn't match at this point, try the rest of the pattern; if ``bat$`` does match, the whole pattern will fail. The trailing ``$`` is required to ensure that something like ``sample.batch``, where the extension only starts with ``bat``, will be allowed. The ``[^.]*`` makes sure that the pattern works when there are multiple dots in the filename.
sv: Den negativa lookahead betyder: om uttrycket ``bat`` inte matchar vid denna punkt, prova resten av mönstret; om ``bat$`` matchar, kommer hela mönstret att misslyckas. Den efterföljande ``$`` krävs för att säkerställa att något som ``sample.batch``, där tillägget endast börjar med ``bat``, tillåts. ``[^.]*`` ser till att mönstret fungerar när det finns flera punkter i filnamnet.

source: Excluding another filename extension is now easy; simply add it as an alternative inside the assertion. The following pattern excludes filenames that end in either ``bat`` or ``exe``:
sv: Det är nu enkelt att utesluta ett annat filnamnstillägg; lägg bara till det som ett alternativ i påståendet. Följande mönster utesluter filnamn som slutar på antingen ``bat`` eller ``exe``:

source: Modifying Strings
sv: Modifiera strängar

source: Up to this point, we've simply performed searches against a static string. Regular expressions are also commonly used to modify strings in various ways, using the following pattern methods:
sv: Hittills har vi bara gjort sökningar mot en statisk sträng. Reguljära uttryck används också ofta för att modifiera strängar på olika sätt, med hjälp av följande mönstermetoder:

source: Split the string into a list, splitting it wherever the RE matches
sv: Dela upp strängen i en lista och dela upp den där RE matchar

source: Find all substrings where the RE matches, and replace them with a different string
sv: Hitta alla delsträngar där RE matchar och ersätt dem med en annan sträng

source: Does the same thing as :meth:`!sub`, but returns the new string and the number of replacements
sv: Gör samma sak som :meth:`!sub`, men returnerar den nya strängen och antalet ersättningar

source: Splitting Strings
sv: Delning av strängar

source: The :meth:`~re.Pattern.split` method of a pattern splits a string apart wherever the RE matches, returning a list of the pieces. It's similar to the :meth:`~str.split` method of strings but provides much more generality in the delimiters that you can split by; string :meth:`!split` only supports splitting by whitespace or by a fixed string. As you'd expect, there's a module-level :func:`re.split` function, too.
sv: Metoden :meth:`~re.Pattern.split` för ett mönster delar upp en sträng där RE matchar och returnerar en lista över delarna. Den liknar metoden :meth:`~str.split` för strängar men är mycket mer generell när det gäller de avgränsare som du kan dela upp med; sträng :meth:`!split` stöder bara uppdelning med blanksteg eller med en fast sträng. Som du kan förvänta dig finns det också en funktion på modulnivå :func:`re.split`.

source: Split *string* by the matches of the regular expression. If capturing parentheses are used in the RE, then their contents will also be returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits are performed.
sv: Dela upp *sträng* efter matchningarna i det reguljära uttrycket. Om fångande parenteser används i RE, kommer deras innehåll också att returneras som en del av den resulterande listan. Om *maxsplit* är ett annat värde än noll utförs högst *maxsplit* uppdelningar.

source: You can limit the number of splits made, by passing a value for *maxsplit*. When *maxsplit* is nonzero, at most *maxsplit* splits will be made, and the remainder of the string is returned as the final element of the list. In the following example, the delimiter is any sequence of non-alphanumeric characters. ::
sv: Du kan begränsa antalet uppdelningar som görs genom att ange ett värde för *maxsplit*. När *maxsplit* inte är noll görs högst *maxsplit* uppdelningar och resten av strängen returneras som det sista elementet i listan. I följande exempel är avgränsaren en valfri sekvens av icke-alfanumeriska tecken. ::

source: >>> p = re.compile(r'\W+') >>> p.split('This is a test, short and sweet, of split().') ['This', 'is', 'a', 'test', 'short', 'and', 'sweet', 'of', 'split', ''] >>> p.split('This is a test, short and sweet, of split().', 3) ['This', 'is', 'a', 'test, short and sweet, of split().']
sv: >>> p = re.compile(r'\W+') >>> p.split('Detta är ett test, kort och gott, av split().') ['Detta', 'är', 'ett', 'test', 'kort', 'och', 'sött', 'av', 'split', ''] >>> p.split('Detta är ett test, kort och gott, av split().', 3) ['Detta', 'är', 'ett', 'test, kort och gott, av split().']

source: Sometimes you're not only interested in what the text between delimiters is, but also need to know what the delimiter was. If capturing parentheses are used in the RE, then their values are also returned as part of the list. Compare the following calls::
sv: Ibland är man inte bara intresserad av vad texten mellan avgränsarna är, utan behöver också veta vad avgränsaren var. Om fångande parenteser används i RE returneras även deras värden som en del av listan. Jämför följande anrop::

source: >>> p = re.compile(r'\W+') >>> p2 = re.compile(r'(\W+)') >>> p.split('This... is a test.') ['This', 'is', 'a', 'test', ''] >>> p2.split('This... is a test.') ['This', '... ', 'is', ' ', 'a', ' ', 'test', '.', '']
sv: >>> p = re.compile(r'\W+') >>> p2 = re.compile(r'(\W+)') >>> p.split('Det här... är ett test.') ['Detta', 'är', 'ett', 'test', ''] >>> p2.split('Det här... är ett test.') ['Detta', '...', 'är', ' ', 'a', ' ', 'test', '.', '']

source: The module-level function :func:`re.split` adds the RE to be used as the first argument, but is otherwise the same. ::
sv: Funktionen på modulnivå :func:`re.split` lägger till den RE som ska användas som första argument, men är i övrigt densamma. ::

source: >>> re.split(r'[\W]+', 'Words, words, words.') ['Words', 'words', 'words', ''] >>> re.split(r'([\W]+)', 'Words, words, words.') ['Words', ', ', 'words', ', ', 'words', '.', ''] >>> re.split(r'[\W]+', 'Words, words, words.', 1) ['Words', 'words, words.']
sv: >>> re.split(r'[\W]+', 'Ord, ord, ord.') ['Ord', 'ord', 'ord', 'ord', ''] >>> re.split(r'([\W]+)', 'Ord, ord, ord.') ['Ord', ', ', 'ord', ', ', 'ord', '.', ''] >>> re.split(r'([\W]+)', 'Ord, ord, ord') >>> re.split(r'[\W]+', 'Ord, ord, ord.', 1) ['Ord', 'ord, ord.']

source: Search and Replace
sv: Sök och ersätt

source: Another common task is to find all the matches for a pattern, and replace them with a different string. The :meth:`~re.Pattern.sub` method takes a replacement value, which can be either a string or a function, and the string to be processed.
sv: En annan vanlig uppgift är att hitta alla matchningar för ett mönster och ersätta dem med en annan sträng. Metoden :meth:`~re.Pattern.sub` tar ett ersättningsvärde, som kan vara antingen en sträng eller en funktion, och den sträng som ska bearbetas.

source: Returns the string obtained by replacing the leftmost non-overlapping occurrences of the RE in *string* by the replacement *replacement*. If the pattern isn't found, *string* is returned unchanged.
sv: Returnerar strängen som erhålls genom att ersätta de längst till vänster liggande icke-överlappande förekomsterna av RE i *sträng* med ersättningen *replacement*. Om mönstret inte hittas returneras *sträng* oförändrad.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. The default value of 0 means to replace all occurrences.
sv: Det valfria argumentet *count* är det maximala antalet mönsterförekomster som ska ersättas; *count* måste vara ett icke-negativt heltal. Standardvärdet 0 innebär att alla förekomster ersätts.

source: Here's a simple example of using the :meth:`~re.Pattern.sub` method. It replaces colour names with the word ``colour``::
sv: Här är ett enkelt exempel på användning av metoden :meth:`~re.Pattern.sub`. Den ersätter färgnamn med ordet ``colour``::

source: >>> p = re.compile('(blue|white|red)') >>> p.sub('colour', 'blue socks and red shoes') 'colour socks and colour shoes' >>> p.sub('colour', 'blue socks and red shoes', count=1) 'colour socks and red shoes'
sv: >>> p = re.compile('(blå|vit|röd)') >>> p.sub('färg', 'blå strumpor och röda skor') 'färgade strumpor och färgade skor' >>> p.sub('färg', 'blå strumpor och röda skor', count=1) "färgade strumpor och röda skor

source: The :meth:`~re.Pattern.subn` method does the same work, but returns a 2-tuple containing the new string value and the number of replacements that were performed::
sv: Metoden :meth:`~re.Pattern.subn` gör samma sak, men returnerar en 2-tupel som innehåller det nya strängvärdet och antalet ersättningar som utfördes::

source: >>> p = re.compile('(blue|white|red)') >>> p.subn('colour', 'blue socks and red shoes') ('colour socks and colour shoes', 2) >>> p.subn('colour', 'no colours at all') ('no colours at all', 0)
sv: >>> p = re.compile('(blå|vit|röd)') >>> p.subn('färg', 'blå strumpor och röda skor') ('färgade strumpor och färgade skor', 2) >>> p.subn('färg', 'inga färger alls') ('inga färger alls', 0)

source: Empty matches are replaced only when they're not adjacent to a previous empty match. ::
sv: Tomma tändstickor ersätts endast om de inte ligger intill en tidigare tom tändsticka:

source: If *replacement* is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by the corresponding group in the RE. This lets you incorporate portions of the original text in the resulting replacement string.
sv: Om *replacement* är en sträng behandlas alla backslash-escapes i den. Det innebär att ``\n`` konverteras till ett enda tecken för ny rad, ``\r`` konverteras till en vagnsretur och så vidare. Okända escape-tecken som ``&`` lämnas därhän. Bakreferenser, t.ex. ``6``, ersätts med den delsträng som matchas av motsvarande grupp i RE. Detta gör att du kan införliva delar av originaltexten i den resulterande ersättningssträngen.

source: This example matches the word ``section`` followed by a string enclosed in ``{``, ``}``, and changes ``section`` to ``subsection``::
sv: Detta exempel matchar ordet ``section`` följt av en sträng innesluten i ``{``, ``}`` och ändrar ``section`` till ``subsection``::

source: >>> p = re.compile('section{ ( [^}]* ) }', re.VERBOSE) >>> p.sub(r'subsection{\1}','section{First} section{second}') 'subsection{First} subsection{second}'
sv: >>> p = re.compile('section{ ( [^}]* ) }', re.VERBOSE) >>> p.sub(r'underavsnitt{\1}','avsnitt{First} avsnitt{second}') 'underavsnitt{First} underavsnitt{second}'

source: There's also a syntax for referring to named groups as defined by the ``(?P<name>...)`` syntax. ``\g<name>`` will use the substring matched by the group named ``name``, and ``\g<number>`` uses the corresponding group number. ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement string such as ``\g<2>0``. (``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``.) The following substitutions are all equivalent, but use all three variations of the replacement string. ::
sv: Det finns också en syntax för att hänvisa till namngivna grupper som definieras av syntaxen ``(?P<name>...)``. ``\g<name>`` kommer att använda den delsträng som matchas av gruppen med namnet ``namn``, och ``g<number>`` använder motsvarande gruppnummer. ``\g<2>`` är därför likvärdigt med ``2``, men är inte tvetydigt i en ersättningssträng som ``\g<2>0``. (``20`` skulle tolkas som en referens till grupp 20, inte som en referens till grupp 2 följt av det bokstavliga tecknet ``'0``) Följande ersättningar är alla likvärdiga, men använd alla tre varianterna av ersättningssträngen:
