Repository: yeager/python-docs-sv
Catalog: howto/regex.po
Languages: sv

source: The RE is passed to :func:`re.compile` as a string. REs are handled as strings because regular expressions aren't part of the core Python language, and no special syntax was created for expressing them. (There are applications that don't need REs at all, so there's no need to bloat the language specification by including them.) Instead, the :mod:`re` module is simply a C extension module included with Python, just like the :mod:`socket` or :mod:`zlib` modules.
sv: RE:n skickas till :func:`re.compile` som en sträng. REs hanteras som strängar eftersom reguljära uttryck inte är en del av Pythons kärnspråk och ingen speciell syntax skapades för att uttrycka dem. (Det finns applikationer som inte behöver REs alls, så det finns ingen anledning att uppblåsa språkspecifikationen genom att inkludera dem) Istället är modulen :mod:`re` helt enkelt en C-tilläggsmodul som ingår i Python, precis som modulerna :mod:`socket` eller :mod:`zlib`.

source: Putting REs in strings keeps the Python language simpler, but has one disadvantage which is the topic of the next section.
sv: Att lägga RE:er i strängar gör Python-språket enklare, men det har en nackdel som behandlas i nästa avsnitt.

source: The Backslash Plague
sv: Backslash-pesten

source: As stated earlier, regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This conflicts with Python's usage of the same character for the same purpose in string literals.
sv: Som tidigare nämnts använder reguljära uttryck tecknet backslash (``'\'``) för att ange speciella former eller för att tillåta att specialtecken används utan att deras speciella betydelse åberopas. Detta står i konflikt med Pythons användning av samma tecken för samma ändamål i stränglitteraler.

source: Let's say you want to write a RE that matches the string ``\section``, which might be found in a LaTeX file. To figure out what to write in the program code, start with the desired string to be matched. Next, you must escape any backslashes and other metacharacters by preceding them with a backslash, resulting in the string ``\\section``. The resulting string that must be passed to :func:`re.compile` must be ``\\section``. However, to express this as a Python string literal, both backslashes must be escaped *again*.
sv: Låt oss säga att du vill skriva en RE som matchar strängen ``sektion``, som kan finnas i en LaTeX-fil. För att räkna ut vad som ska skrivas i programkoden börjar du med den önskade strängen som ska matchas. Därefter måste du undkomma eventuella backslash och andra metatecken genom att föregå dem med ett backslash, vilket resulterar i strängen ``section``. Den resulterande strängen som måste skickas till :func:`re.compile` måste vara ``section``. Men för att uttrycka detta som en Python-stränglitteral måste båda backslasharna escapas *igen*.

source: Characters
sv: Tecken

source: Stage
sv: Scen

source: ``\section``
sv: "sektion

source: Text string to be matched
sv: Textsträng som ska matchas

source: ``\\section``
sv: "snitt

source: Escaped backslash for :func:`re.compile`
sv: Undangömd backslash för :func:`re.compile`

source: Escaped backslashes for a string literal
sv: Escaped backslashes för en strängbördal

source: In short, to match a literal backslash, one has to write ``'\\\\'`` as the RE string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. In REs that feature backslashes repeatedly, this leads to lots of repeated backslashes and makes the resulting strings difficult to understand.
sv: Kort sagt, för att matcha ett bokstavligt backslash måste man skriva ``'\\\\'`` som RE-sträng, eftersom det reguljära uttrycket måste vara ````, och varje backslash måste uttryckas som ````` inuti en reguljär Python-sträng. I RE:er som innehåller backslash upprepade gånger leder detta till många upprepade backslash och gör de resulterande strängarna svåra att förstå.

source: The solution is to use Python's raw string notation for regular expressions; backslashes are not handled in any special way in a string literal prefixed with ``'r'``, so ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Regular expressions will often be written in Python code using this raw string notation.
sv: Lösningen är att använda Pythons råa strängnotation för reguljära uttryck; backslasher hanteras inte på något speciellt sätt i en stränglitual med prefixet ``'r'``, så ``r"\n"`` är en tvåteckenssträng som innehåller ``'\'`` och ``'n'``, medan ``"\n"`` är en enteckenssträng som innehåller en ny rad. Reguljära uttryck skrivs ofta i Python-kod med hjälp av denna råa strängnotation.

source: In addition, special escape sequences that are valid in regular expressions, but not valid as Python string literals, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`, which means the sequences will be invalid if raw string notation or escaping the backslashes isn't used.
sv: Dessutom resulterar nu speciella escape-sekvenser som är giltiga i reguljära uttryck, men inte giltiga som Python-stränglitteraler, i en :exc:`DeprecationWarning` och kommer så småningom att bli en :exc:`SyntaxError`, vilket innebär att sekvenserna kommer att vara ogiltiga om rå strängnotation eller escaping av backslashes inte används.

source: Regular String
sv: Vanlig sträng

source: Raw string
sv: Rå sträng

source: Performing Matches
sv: Utföra matchningar

source: Once you have an object representing a compiled regular expression, what do you do with it? Pattern objects have several methods and attributes. Only the most significant ones will be covered here; consult the :mod:`re` docs for a complete listing.
sv: När du har ett objekt som representerar ett kompilerat reguljärt uttryck, vad gör du med det? Mönsterobjekt har flera metoder och attribut. Endast de mest betydelsefulla kommer att tas upp här; se :mod:`re`-dokumenten för en fullständig lista.

source: Method/Attribute
sv: Metod/Attribut

source: Purpose
sv: Syfte

source: Determine if the RE matches at the beginning of the string.
sv: Avgör om RE matchar i början av strängen.

source: Scan through a string, looking for any location where this RE matches.
sv: Skanna igenom en sträng och leta efter alla platser där denna RE matchar.

source: Find all substrings where the RE matches, and returns them as a list.
sv: Hitta alla delsträngar där RE matchar och returnera dem som en lista.

source: Find all substrings where the RE matches, and returns them as an :term:`iterator`.
sv: Hitta alla substrängar där RE matchar och returnera dem som en :term:`iterator`.

source: :meth:`~re.Pattern.match` and :meth:`~re.Pattern.search` return ``None`` if no match can be found. If they're successful, a :ref:`match object <match-objects>` instance is returned, containing information about the match: where it starts and ends, the substring it matched, and more.
sv: :meth:`~re.Pattern.match` och :meth:`~re.Pattern.search` returnerar ``None`` om ingen matchning kan hittas. Om de lyckas returneras en :ref:`match object <match-objects>`-instans som innehåller information om matchningen: var den börjar och slutar, den delsträng som matchades med mera.

source: You can learn about this by interactively experimenting with the :mod:`re` module.
sv: Du kan lära dig mer om detta genom att interaktivt experimentera med modulen :mod:`re`.

source: This HOWTO uses the standard Python interpreter for its examples. First, run the Python interpreter, import the :mod:`re` module, and compile a RE::
sv: Denna HOWTO använder standardtolken Python för sina exempel. Kör först Python-tolken, importera modulen :mod:`re` och kompilera en RE::

source: Now, you can try matching various strings against the RE ``[a-z]+``. An empty string shouldn't match at all, since ``+`` means 'one or more repetitions'. :meth:`~re.Pattern.match` should return ``None`` in this case, which will cause the interpreter to print no output. You can explicitly print the result of :meth:`!match` to make this clear. ::
sv: Nu kan du försöka matcha olika strängar mot RE ``[a-z]+``. En tom sträng bör inte matchas alls, eftersom ``+`` betyder "en eller flera upprepningar". :meth:`~re.Pattern.match` bör returnera ``None`` i det här fallet, vilket gör att tolken inte skriver ut något. Du kan uttryckligen skriva ut resultatet av :meth:`!match` för att tydliggöra detta. ::

source: >>> p.match("") >>> print(p.match("")) None
sv: >>> p.match("") >>> print(p.match("")) Ingen

source: Now, let's try it on a string that it should match, such as ``tempo``. In this case, :meth:`~re.Pattern.match` will return a :ref:`match object <match-objects>`, so you should store the result in a variable for later use. ::
sv: Låt oss nu prova det på en sträng som det ska matcha, till exempel ``tempo``. I det här fallet kommer :meth:`~re.Pattern.match` att returnera en :ref:`match object <match-objects>`, så du bör lagra resultatet i en variabel för senare användning. ::

source: >>> m = p.match('tempo') >>> m <re.Match object; span=(0, 5), match='tempo'>
sv: >>> m = p.match('tempo') >>> m <re.Match-objekt; span=(0, 5), match='tempo'>

source: Now you can query the :ref:`match object <match-objects>` for information about the matching string. Match object instances also have several methods and attributes; the most important ones are:
sv: Nu kan du fråga :ref:`match object <match-objects>` efter information om den matchande strängen. Match-objektinstanser har också flera metoder och attribut; de viktigaste är:

source: Return the string matched by the RE
sv: Returnera den sträng som matchas av RE

source: Return the starting position of the match
sv: Returnera startpositionen för matchen

source: ``end()``
sv: ``slut()```

source: Return the ending position of the match
sv: Returnera slutpositionen för matchen

source: Return a tuple containing the (start, end) positions of the match
sv: Returnera en tupel som innehåller matchningens (start, slut) positioner

source: Trying these methods will soon clarify their meaning::
sv: Att prova dessa metoder kommer snart att klargöra deras betydelse::

source: >>> m.group() 'tempo' >>> m.start(), m.end() (0, 5) >>> m.span() (0, 5)
sv: >>> m.grupp() 'tempo' >>> m.start(), m.slut() (0, 5) >>> m.span() (0, 5)

source: :meth:`~re.Match.group` returns the substring that was matched by the RE. :meth:`~re.Match.start` and :meth:`~re.Match.end` return the starting and ending index of the match. :meth:`~re.Match.span` returns both start and end indexes in a single tuple. Since the :meth:`~re.Pattern.match` method only checks if the RE matches at the start of a string, :meth:`!start` will always be zero. However, the :meth:`~re.Pattern.search` method of patterns scans through the string, so the match may not start at zero in that case. ::
sv: :meth:`~re.Match.group` returnerar den delsträng som matchades av RE. :meth:`~re.Match.start` och :meth:`~re.Match.end` returnerar start- och slutindex för matchningen. :meth:`~re.Match.span` returnerar både start- och slutindex i en enda tupel. Eftersom metoden :meth:`~re.Pattern.match` endast kontrollerar om RE matchar i början av en sträng, kommer :meth:`!start` alltid att vara noll. Men metoden :meth:`~re.Pattern.search` i patterns skannar igenom strängen, så det är inte säkert att matchningen börjar vid noll i det fallet. ::

source: >>> print(p.match('::: message')) None >>> m = p.search('::: message'); print(m) <re.Match object; span=(4, 11), match='message'> >>> m.group() 'message' >>> m.span() (4, 11)
sv: >>> print(p.match(':::: meddelande')) Ingen >>> m = p.search(':::: meddelande'); print(m) <re.match-objekt; span=(4, 11), match='meddelande'> >>> m.group() >>> m.group() 'meddelande' >>> m.span() (4, 11)

source: In actual programs, the most common style is to store the :ref:`match object <match-objects>` in a variable, and then check if it was ``None``. This usually looks like::
sv: I faktiska program är det vanligaste sättet att lagra :ref:`matchobjekt <match-objects>` i en variabel och sedan kontrollera om det var ``None``. Detta ser vanligtvis ut som::

source: p = re.compile( ... ) m = p.match( 'string goes here' ) if m: print('Match found: ', m.group()) else: print('No match')
sv: p = re.compile( ... ) m = p.match( 'strängen går här' ) if m: print('Matchning hittades: ', m.group()) else: print('Ingen matchning')

source: Two pattern methods return all of the matches for a pattern. :meth:`~re.Pattern.findall` returns a list of matching strings::
sv: Två mönstermetoder returnerar alla matchningar för ett mönster. :meth:`~re.Pattern.findall` returnerar en lista med matchande strängar::

source: >>> p = re.compile(r'\d+') >>> p.findall('12 drummers drumming, 11 pipers piping, 10 lords a-leaping') ['12', '11', '10']
sv: >>> p = re.compile(r'\d+') >>> p.findall('12 trummisar som trummar, 11 pipare som pipar, 10 herrar som hoppar') ['12', '11', '10']

source: The ``r`` prefix, making the literal a raw string literal, is needed in this example because escape sequences in a normal "cooked" string literal that are not recognized by Python, as opposed to regular expressions, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`. See :ref:`the-backslash-plague`.
sv: Prefixet ``r``, som gör literalen till en rå sträng-literal, behövs i detta exempel eftersom escape-sekvenser i en normal "tillagad" sträng-literal som inte känns igen av Python, till skillnad från reguljära uttryck, nu resulterar i en :exc:`DeprecationWarning` och kommer så småningom att bli en :exc:`SyntaxError`. Se :ref:`the-backslash-plague`.

source: :meth:`~re.Pattern.findall` has to create the entire list before it can be returned as the result. The :meth:`~re.Pattern.finditer` method returns a sequence of :ref:`match object <match-objects>` instances as an :term:`iterator`::
sv: :meth:`~re.Pattern.findall` måste skapa hela listan innan den kan returneras som resultat. Metoden :meth:`~re.Pattern.finditer` returnerar en sekvens av :ref:`match object <match-objects>` instanser som en :term:`iterator`::

source: >>> iterator = p.finditer('12 drummers drumming, 11 ... 10 ...') >>> iterator <callable_iterator object at 0x...> >>> for match in iterator: ... print(match.span()) ... (0, 2) (22, 24) (29, 31)
sv: >>> iterator = p.finditer('12 trummisar trummar, 11 ... 10 ...') >>> iterator <anropsbart_iterator-objekt på 0x...> >>> för match i iterator >>> för match i iterator: ... print(match.span()) ... (0, 2) (22, 24) (29, 31)

source: Module-Level Functions
sv: Funktioner på modulnivå

source: You don't have to create a pattern object and call its methods; the :mod:`re` module also provides top-level functions called :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, and so forth. These functions take the same arguments as the corresponding pattern method with the RE string added as the first argument, and still return either ``None`` or a :ref:`match object <match-objects>` instance. ::
sv: Du behöver inte skapa ett pattern-objekt och anropa dess metoder; modulen :mod:`re` tillhandahåller även funktioner på högsta nivå som heter :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub` och så vidare. Dessa funktioner tar samma argument som motsvarande pattern-metod med RE-strängen tillagd som första argument, och returnerar fortfarande antingen ``None`` eller ett :ref:`match-objekt <match-objects>` instance. ::

source: >>> print(re.match(r'From\s+', 'Fromage amk')) None >>> re.match(r'From\s+', 'From amk Thu May 14 19:12:10 1998') <re.Match object; span=(0, 5), match='From '>
sv: >>> print(re.match(r'From\s+','Fromage amk')) Ingen >>> re.match(r'From\s+','From amk Thu May 14 19:12:10 1998') <re.Match-objekt; span=(0, 5), match='From'>

source: Under the hood, these functions simply create a pattern object for you and call the appropriate method on it. They also store the compiled object in a cache, so future calls using the same RE won't need to parse the pattern again and again.
sv: Under huven skapar dessa funktioner helt enkelt ett mönsterobjekt åt dig och anropar lämplig metod på det. De lagrar också det kompilerade objektet i en cache, så att framtida anrop med samma RE inte behöver analysera mönstret om och om igen.

source: Should you use these module-level functions, or should you get the pattern and call its methods yourself? If you're accessing a regex within a loop, pre-compiling it will save a few function calls. Outside of loops, there's not much difference thanks to the internal cache.
sv: Ska du använda dessa funktioner på modulnivå, eller ska du hämta mönstret och anropa dess metoder själv? Om du kommer åt en regex i en loop sparar du några funktionsanrop genom att förkompilera den. Utanför loopar är det inte så stor skillnad tack vare den interna cachen.

source: Compilation Flags
sv: Kompileringsflaggor

source: Compilation flags let you modify some aspects of how regular expressions work. Flags are available in the :mod:`re` module under two names, a long name such as :const:`IGNORECASE` and a short, one-letter form such as :const:`I`. (If you're familiar with Perl's pattern modifiers, the one-letter forms use the same letters; the short form of :const:`re.VERBOSE` is :const:`re.X`, for example.) Multiple flags can be specified by bitwise OR-ing them; ``re.I | re.M`` sets both the :const:`I` and :const:`M` flags, for example.
sv: Med kompileringsflaggor kan du ändra vissa aspekter av hur reguljära uttryck fungerar. Flaggor finns tillgängliga i modulen :mod:`re` under två namn, ett långt namn som :const:`IGNORECASE` och en kort form med en bokstav som :const:`I`. (Om du är bekant med Perls mönstermodifierare använder formerna med en bokstav samma bokstäver; kortformen av :const:`re.VERBOSE` är till exempel :const:`re.X`) Flera flaggor kan anges genom bitvis OR-ning av dem; ``re.I | re.M`` anger till exempel både flaggorna :const:`I` och :const:`M`.

source: Here's a table of the available flags, followed by a more detailed explanation of each one.
sv: Här är en tabell över tillgängliga flaggor, följt av en mer detaljerad förklaring av var och en.

source: Flag
sv: Flagga

source: Meaning
sv: Betydelse

source: Makes several escapes like ``\w``, ``\b``, ``\s`` and ``\d`` match only on ASCII characters with the respective property.
sv: Gör att flera escapes som ``\w``, ``b``, ``s`` och ``d`` endast matchar ASCII-tecken med respektive egenskap.

source: Make ``.`` match any character, including newlines.
sv: Låt ``.``` matcha alla tecken, inklusive nya rader.

source: Do case-insensitive matches.
sv: Gör matchningar utan hänsyn till skiftlägeskänslighet.

source: Do a locale-aware match.
sv: Gör en lokalanpassad matchning.

source: Multi-line matching, affecting ``^`` and ``$``.
sv: Matchning av flera rader, påverkar ``^`` och ``$``.

source: :const:`VERBOSE`, :const:`X` (for 'extended')
sv: :const:`VERBOSE`, :const:`X` (för 'extended')

source: Enable verbose REs, which can be organized more cleanly and understandably.
sv: Aktivera verbose RE:s, som kan organiseras på ett mer överskådligt och begripligt sätt.

source: Perform case-insensitive matching; character class and literal strings will match letters by ignoring case. For example, ``[A-Z]`` will match lowercase letters, too. Full Unicode matching also works unless the :const:`ASCII` flag is used to disable non-ASCII matches. When the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). ``Spam`` will match ``'Spam'``, ``'spam'``, ``'spAM'``, or ``'ſpam'`` (the latter is matched only in Unicode mode). This lowercasing doesn't take the current locale into account; it will if you also set the :const:`LOCALE` flag.
sv: Utför matchning som inte är skiftlägeskänslig; teckenklasser och bokstavssträngar matchar bokstäver genom att ignorera skiftlägeskänslighet. Till exempel matchar ``[A-Z]`` även gemener. Fullständig Unicode-matchning fungerar också om inte flaggan :const:`ASCII` används för att inaktivera matchningar som inte är ASCII. När Unicode-mönstren ``[a-z]`` eller ``[A-Z]`` används i kombination med flaggan :const:`IGNORECASE` matchar de de 52 ASCII-bokstäverna och 4 ytterligare icke-ASCII-bokstäver: 'İ' (U+0130, latinsk versal I med punkt ovanför), ’ı’ (U+0131, latinsk gemen i utan punkt), ’ſ’ (U+017F, latinsk gemen lång s) och ’K’ (U+212A, Kelvin-tecken). ``Spam`` matchar ``'Spam'``, ``'spam'``, ``'spAM'`` eller ``'ſpam'`` (det senare matchas endast i Unicode-läge). Denna omvandling till gemener tar inte hänsyn till den aktuella lokaliseringen; det gör den om du också anger flaggan :const:`LOCALE`.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale instead of the Unicode database.
sv: Gör ``w``, ``W``, ``b``, ``B`` och skiftlägesokänslig matchning beroende av aktuell locale istället för Unicode-databasen.

source: Locales are a feature of the C library intended to help in writing programs that take account of language differences. For example, if you're processing encoded French text, you'd want to be able to write ``\w+`` to match words, but ``\w`` only matches the character class ``[A-Za-z]`` in bytes patterns; it won't match bytes corresponding to ``é`` or ``ç``. If your system is configured properly and a French locale is selected, certain C functions will tell the program that the byte corresponding to ``é`` should also be considered a letter. Setting the :const:`LOCALE` flag when compiling a regular expression will cause the resulting compiled object to use these C functions for ``\w``; this is slower, but also enables ``\w+`` to match French words as you'd expect. The use of this flag is discouraged in Python 3 as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages.
sv: Locales är en funktion i C-biblioteket som är avsedd att hjälpa till att skriva program som tar hänsyn till språkskillnader. Om du till exempel bearbetar kodad fransk text skulle du vilja kunna skriva ``\w+`` för att matcha ord, men ``\w`` matchar bara teckenklassen ``[A-Za-z]`` i bytesmönster; den matchar inte bytes som motsvarar ``é`` eller ``ç``. Om ditt system är korrekt konfigurerat och en fransk språkdräkt är vald, kommer vissa C-funktioner att tala om för programmet att byten som motsvarar ``é`` också ska betraktas som en bokstav. Om du anger flaggan :const:`LOCALE` när du kompilerar ett reguljärt uttryck kommer det resulterande kompilerade objektet att använda dessa C-funktioner för ``w``; detta är långsammare, men gör också att ``w+`` kan matcha franska ord som du förväntar dig. Användningen av denna flagga är avrådd i Python 3 eftersom locale-mekanismen är mycket opålitlig, den hanterar bara en "kultur" åt gången och den fungerar bara med 8-bitars locales. Unicode-matchning är redan aktiverad som standard i Python 3 för Unicode (str)-mönster, och den kan hantera olika lokala språk.

source: (``^`` and ``$`` haven't been explained yet; they'll be introduced in section :ref:`more-metacharacters`.)
sv: (``^`` och ``$`` har inte förklarats ännu; de kommer att introduceras i avsnitt :ref:`fler-metakaraktärer`.)
