Repository: yeager/python-docs-sv
Catalog: howto/regex.po
Languages: sv

source: >>> p = re.compile('section{ (?P<name> [^}]* ) }', re.VERBOSE) >>> p.sub(r'subsection{\1}','section{First}') 'subsection{First}' >>> p.sub(r'subsection{\g<1>}','section{First}') 'subsection{First}' >>> p.sub(r'subsection{\g<name>}','section{First}') 'subsection{First}'
sv: &gt;&gt;&gt; p = re.compile('section{ (?P<name> [^}]* ) }', re.VERBOSE) &gt;&gt;&gt; p.sub(r'underavsnitt{\1}','avsnitt{First}') 'underavdelning{First}' &gt;&gt;&gt; p.sub(r'underavdelning{\g<1>}','avsnitt{First}') 'underavdelning{First}' &gt;&gt;&gt; p.sub(r'underavdelning{\g<name>}','avsnitt{First}') "underavdelning{First}

source: *replacement* can also be a function, which gives you even more control. If *replacement* is a function, the function is called for every non-overlapping occurrence of *pattern*. On each call, the function is passed a :ref:`match object <match-objects>` argument for the match and can use this information to compute the desired replacement string and return it.
sv: *replacement* kan också vara en funktion, vilket ger dig ännu mer kontroll. Om *replacement* är en funktion anropas funktionen för varje icke-överlappande förekomst av *pattern*. Vid varje anrop får funktionen ett :ref:`match-objekt <match-objects>`-argument för matchningen och kan använda denna information för att beräkna den önskade ersättningssträngen och returnera den.

source: In the following example, the replacement function translates decimals into hexadecimal::
sv: I följande exempel översätter ersättningsfunktionen decimaler till hexadecimal::

source: >>> def hexrepl(match): ... "Return the hex string for a decimal number" ... value = int(match.group()) ... return hex(value) ... >>> p = re.compile(r'\d+') >>> p.sub(hexrepl, 'Call 65490 for printing, 49152 for user code.') 'Call 0xffd2 for printing, 0xc000 for user code.'
sv: >>> def hexrepl(match): ... "Returnera hex-strängen för ett decimaltal" ... värde = int(match.group()) ... returnera hex(värde) ... >>> p = re.compile(r'\d+') >>> p.sub(hexrepl, 'Anropa 65490 för utskrift, 49152 för användarkod.') 'Anropa 0xffd2 för utskrift, 0xc000 för användarkod.'

source: When using the module-level :func:`re.sub` function, the pattern is passed as the first argument. The pattern may be provided as an object or as a string; if you need to specify regular expression flags, you must either use a pattern object as the first parameter, or use embedded modifiers in the pattern string, e.g. ``sub("(?i)b+", "x", "bbbb BBBB")`` returns ``'x x'``.
sv: När funktionen :func:`re.sub` används på modulnivå skickas mönstret som det första argumentet. Mönstret kan anges som ett objekt eller som en sträng; om du behöver ange flaggor för reguljära uttryck måste du antingen använda ett mönsterobjekt som första parameter eller använda inbäddade modifierare i mönstersträngen, t.ex. ``sub("(?i)b+", "x", "bbbb BBBB")``` returnerar ``'x x'``.

source: Common Problems
sv: Vanliga problem

source: Regular expressions are a powerful tool for some applications, but in some ways their behaviour isn't intuitive and at times they don't behave the way you may expect them to. This section will point out some of the most common pitfalls.
sv: Reguljära uttryck är ett kraftfullt verktyg för vissa tillämpningar, men på vissa sätt är deras beteende inte intuitivt och ibland beter de sig inte på det sätt som du kanske förväntar dig att de ska göra. I det här avsnittet pekar vi på några av de vanligaste fallgroparna.

source: Use String Methods
sv: Använda strängmetoder

source: Sometimes using the :mod:`re` module is a mistake. If you're matching a fixed string, or a single character class, and you're not using any :mod:`re` features such as the :const:`~re.IGNORECASE` flag, then the full power of regular expressions may not be required. Strings have several methods for performing operations with fixed strings and they're usually much faster, because the implementation is a single small C loop that's been optimized for the purpose, instead of the large, more generalized regular expression engine.
sv: Ibland är det ett misstag att använda modulen :mod:`re`. Om du matchar en fast sträng, eller en klass med ett enda tecken, och inte använder några :mod:`re`-funktioner som t.ex. flaggan :const:`~re.IGNORECASE`, kanske du inte behöver använda reguljära uttryck fullt ut. Strings har flera metoder för att utföra operationer med fasta strängar och de är vanligtvis mycket snabbare, eftersom implementeringen är en enda liten C-loop som har optimerats för ändamålet, istället för den stora, mer generaliserade reguljära uttrycksmotorn.

source: One example might be replacing a single fixed string with another one; for example, you might replace ``word`` with ``deed``. :func:`re.sub` seems like the function to use for this, but consider the :meth:`~str.replace` method. Note that :meth:`!replace` will also replace ``word`` inside words, turning ``swordfish`` into ``sdeedfish``, but the naive RE ``word`` would have done that, too. (To avoid performing the substitution on parts of words, the pattern would have to be ``\bword\b``, in order to require that ``word`` have a word boundary on either side. This takes the job beyond :meth:`!replace`'s abilities.)
sv: Ett exempel kan vara att ersätta en enda fast sträng med en annan; till exempel kan du ersätta ``word`` med ``deed``. :func:`re.sub` verkar vara den funktion som ska användas för detta, men överväg :meth:`~str.replace`-metoden. Observera att :meth:`!replace` också kommer att ersätta ``word`` inuti ord, vilket gör ``wordfish`` till ``deedfish``, men den naiva RE ``word`` skulle ha gjort det också. (För att undvika att utföra substitutionen på delar av ord, skulle mönstret behöva vara ``bword\b``, för att kräva att ``word`` har en ordgräns på vardera sidan. Detta tar jobbet bortom :meth:`!replace` förmågor)

source: Another common task is deleting every occurrence of a single character from a string or replacing it with another single character. You might do this with something like ``re.sub('\n', ' ', S)``, but :meth:`~str.translate` is capable of doing both tasks and will be faster than any regular expression operation can be.
sv: En annan vanlig uppgift är att ta bort varje förekomst av ett enda tecken från en sträng eller ersätta det med ett annat enda tecken. Du kan göra detta med något som ``re.sub('\n', ' ', S)``, men :meth:`~str.translate` kan göra båda uppgifterna och kommer att vara snabbare än någon operation med reguljära uttryck kan vara.

source: In short, before turning to the :mod:`re` module, consider whether your problem can be solved with a faster and simpler string method.
sv: Kort sagt, innan du vänder dig till :mod:`re`-modulen bör du överväga om ditt problem kan lösas med en snabbare och enklare strängmetod.

source: match() versus search()
sv: match() kontra search()

source: The :func:`~re.match` function only checks if the RE matches at the beginning of the string while :func:`~re.search` will scan forward through the string for a match. It's important to keep this distinction in mind. Remember, :func:`!match` will only report a successful match which will start at 0; if the match wouldn't start at zero, :func:`!match` will *not* report it. ::
sv: Funktionen :func:`~re.match` kontrollerar bara om RE matchar i början av strängen medan :func:`~re.search` söker framåt genom strängen efter en matchning. Det är viktigt att hålla denna distinktion i minnet. Kom ihåg att :func:`!match` endast kommer att rapportera en lyckad matchning som börjar på 0; om matchningen inte skulle börja på noll kommer :func:`!match` *inte* att rapportera den. ::

source: >>> print(re.match('super', 'superstition').span()) (0, 5) >>> print(re.match('super', 'insuperable')) None
sv: >>> print(re.match('super', 'superstition').span()) (0, 5) >>> print(re.match('super', 'oövervinnelig')) Ingen

source: On the other hand, :func:`~re.search` will scan forward through the string, reporting the first match it finds. ::
sv: Å andra sidan kommer :func:`~re.search` att skanna framåt genom strängen och rapportera den första matchningen den hittar. ::

source: >>> print(re.search('super', 'superstition').span()) (0, 5) >>> print(re.search('super', 'insuperable').span()) (2, 7)
sv: >>> print(re.search('super', 'superstition').span()) (0, 5) >>> print(re.search('super', 'oövervinnelig').span()) (2, 7)

source: Sometimes you'll be tempted to keep using :func:`re.match`, and just add ``.*`` to the front of your RE. Resist this temptation and use :func:`re.search` instead. The regular expression compiler does some analysis of REs in order to speed up the process of looking for a match. One such analysis figures out what the first character of a match must be; for example, a pattern starting with ``Crow`` must match starting with a ``'C'``. The analysis lets the engine quickly scan through the string looking for the starting character, only trying the full match if a ``'C'`` is found.
sv: Ibland frestas du att fortsätta använda :func:`re.match`, och bara lägga till ``.*`` framför din RE. Motstå denna frestelse och använd :func:`re.search` istället. Kompilatorn för reguljära uttryck gör en del analyser av RE:er för att snabba upp processen med att leta efter en matchning. En sådan analys räknar ut vad det första tecknet i en matchning måste vara; till exempel måste ett mönster som börjar med ``Crow`` matcha som börjar med en ``'C'``. Analysen gör att sökmotorn snabbt kan skanna igenom strängen och leta efter starttecknet, och bara försöka få en fullständig matchning om ett ``'C`` hittas.

source: Adding ``.*`` defeats this optimization, requiring scanning to the end of the string and then backtracking to find a match for the rest of the RE. Use :func:`re.search` instead.
sv: Att lägga till ``.*`` motverkar denna optimering och kräver att man skannar till slutet av strängen och sedan går tillbaka för att hitta en matchning för resten av RE. Använd :func:`re.search` istället.

source: Greedy versus Non-Greedy
sv: Girig kontra icke-girig

source: When repeating a regular expression, as in ``a*``, the resulting action is to consume as much of the pattern as possible. This fact often bites you when you're trying to match a pair of balanced delimiters, such as the angle brackets surrounding an HTML tag. The naive pattern for matching a single HTML tag doesn't work because of the greedy nature of ``.*``. ::
sv: När man upprepar ett reguljärt uttryck, som i ``a*``, blir resultatet att så mycket som möjligt av mönstret konsumeras. Detta faktum slår ofta fel när man försöker matcha ett par balanserade avgränsare, t.ex. de vinkelparenteser som omger en HTML-tagg. Det naiva mönstret för att matcha en enda HTML-tagg fungerar inte på grund av den giriga karaktären hos ``.*``. ::

source: >>> s = '<html><head><title>Title</title>' >>> len(s) 32 >>> print(re.match('<.*>', s).span()) (0, 32) >>> print(re.match('<.*>', s).group()) <html><head><title>Title</title>
sv: &gt;&gt;&gt; s = '<html><head><title>Titel</title>' &gt;&gt;&gt; len(s) 32 &gt;&gt;&gt; print(re.match('<.*>', s).span()) (0, 32) &gt;&gt;&gt; print(re.match('<.*>', s).group()) <html><head><title>Titel</title>

source: The RE matches the ``'<'`` in ``'<html>'``, and the ``.*`` consumes the rest of the string. There's still more left in the RE, though, and the ``>`` can't match at the end of the string, so the regular expression engine has to backtrack character by character until it finds a match for the ``>``. The final match extends from the ``'<'`` in ``'<html>'`` to the ``'>'`` in ``'</title>'``, which isn't what you want.
sv: RE matchar ``'&lt;'`` i ``'<html>'``, och ``.*`` förbrukar resten av strängen. Det finns dock fortfarande mer kvar i RE, och ``&gt;`` kan inte matcha i slutet av strängen, så motorn för reguljära uttryck måste backa tecken för tecken tills den hittar en matchning för ``&gt;``. Den slutliga matchningen sträcker sig från ``'&lt;'`` i ``'<html>'`` till ``'&gt;'`` i ``'</title>'``, vilket inte är vad du vill.

source: In this case, the solution is to use the non-greedy quantifiers ``*?``, ``+?``, ``??``, or ``{m,n}?``, which match as *little* text as possible. In the above example, the ``'>'`` is tried immediately after the first ``'<'`` matches, and when it fails, the engine advances a character at a time, retrying the ``'>'`` at every step. This produces just the right result::
sv: I det här fallet är lösningen att använda de icke-greedy kvantifierarna ``*?``, ``+?``, ``??`` eller ``{m,n}?``, som matchar så *lite* text som möjligt. I exemplet ovan prövas ``'>'`` omedelbart efter den första ``'<'``-matchningen, och när den misslyckas avancerar sökmotorn ett tecken i taget och försöker ``'>'`` på nytt i varje steg. Detta ger precis rätt resultat::

source: >>> print(re.match('<.*?>', s).group()) <html>
sv: &gt;&gt;&gt; print(re.match('<.*?>', s).group()) <html>

source: (Note that parsing HTML or XML with regular expressions is painful. Quick-and-dirty patterns will handle common cases, but HTML and XML have special cases that will break the obvious regular expression; by the time you've written a regular expression that handles all of the possible cases, the patterns will be *very* complicated. Use an HTML or XML parser module for such tasks.)
sv: (Observera att parsning av HTML eller XML med reguljära uttryck är smärtsamt. Snabba och enkla mönster hanterar vanliga fall, men HTML och XML har specialfall som bryter mot det uppenbara reguljära uttrycket; när du väl har skrivit ett reguljärt uttryck som hanterar alla möjliga fall kommer mönstren att vara *mycket* komplicerade. Använd en HTML- eller XML-parsermodul för sådana uppgifter)

source: Using re.VERBOSE
sv: Använda re.VERBOSE

source: By now you've probably noticed that regular expressions are a very compact notation, but they're not terribly readable. REs of moderate complexity can become lengthy collections of backslashes, parentheses, and metacharacters, making them difficult to read and understand.
sv: Vid det här laget har du förmodligen märkt att reguljära uttryck är en mycket kompakt notation, men de är inte särskilt läsbara. RE med måttlig komplexitet kan bli långa samlingar av bindestreck, parenteser och metatecken, vilket gör dem svåra att läsa och förstå.

source: For such REs, specifying the :const:`re.VERBOSE` flag when compiling the regular expression can be helpful, because it allows you to format the regular expression more clearly.
sv: För sådana RE:s kan det vara till hjälp att ange flaggan :const:`re.VERBOSE` vid kompilering av det reguljära uttrycket, eftersom det gör att du kan formatera det reguljära uttrycket tydligare.

source: The ``re.VERBOSE`` flag has several effects. Whitespace in the regular expression that *isn't* inside a character class is ignored. This means that an expression such as ``dog | cat`` is equivalent to the less readable ``dog|cat``, but ``[a b]`` will still match the characters ``'a'``, ``'b'``, or a space. In addition, you can also put comments inside a RE; comments extend from a ``#`` character to the next newline. When used with triple-quoted strings, this enables REs to be formatted more neatly::
sv: Flaggan ``re.VERBOSE`` har flera effekter. Whitespace i det reguljära uttrycket som *inte* är inom en teckenklass ignoreras. Detta innebär att ett uttryck som ``hund | katt`` motsvarar det mindre läsbara ``hund|katt``, men ``[a b]`` kommer fortfarande att matcha tecknen ``'a'``, ``'b'`` eller ett mellanslag. Dessutom kan du lägga in kommentarer inuti en RE; kommentarer sträcker sig från ett ``#``-tecken till nästa nya rad. När detta används med strängar med trippelcitat kan RE:er formateras på ett snyggare sätt::

source: pat = re.compile(r""" \s* # Skip leading whitespace (?P<header>[^:]+) # Header name \s* : # Whitespace, and a colon (?P<value>.*?) # The header's value -- *? used to # lose the following trailing whitespace \s*$ # Trailing whitespace to end-of-line """, re.VERBOSE)
sv: pat = re.compile(r""" \s* # Hoppa över ledande blanksteg (?P<header>[^:]+) # Huvudnamn \s* : # Blanksteg, och ett kolon (?P<value>.*?) # Huvudets värde -- *? används för att # förlora följande efterföljande blanksteg \s*$ # Efterföljande blanksteg till slutet av raden """, re.VERBOSE)

source: This is far more readable than::
sv: Detta är mycket mer läsbart än::

source: Regular expressions are a complicated topic. Did this document help you understand them? Were there parts that were unclear, or Problems you encountered that weren't covered here? If so, please send suggestions for improvements to the author.
sv: Reguljära uttryck är ett komplicerat ämne. Hjälpte det här dokumentet dig att förstå dem? Fanns det delar som var oklara, eller problem som du stötte på som inte täcktes här? Om så är fallet, skicka gärna förslag på förbättringar till författaren.

source: The most complete book on regular expressions is almost certainly Jeffrey Friedl's Mastering Regular Expressions, published by O'Reilly. Unfortunately, it exclusively concentrates on Perl and Java's flavours of regular expressions, and doesn't contain any Python material at all, so it won't be useful as a reference for programming in Python. (The first edition covered Python's now-removed :mod:`!regex` module, which won't help you much.) Consider checking it out from your library.
sv: Den mest kompletta boken om reguljära uttryck är nästan säkert Jeffrey Friedls Mastering Regular Expressions, utgiven av O'Reilly. Tyvärr koncentrerar den sig uteslutande på Perl och Javas smaker av reguljära uttryck och innehåller inte något Python-material alls, så det kommer inte att vara användbart som referens för programmering i Python. (Den första utgåvan täckte Pythons nu borttagna :mod:`!regex`-modul, vilket inte kommer att hjälpa dig mycket.) Överväg att kolla in det från ditt bibliotek.
