Repository: yeager/python-docs-sv
Catalog: howto/regex.po
Languages: sv

source: Regular Expression HOWTO
sv: Reguljära uttryck HOWTO

source: Author
sv: Författare

source: Abstract
sv: Abstrakt

source: This document is an introductory tutorial to using regular expressions in Python with the :mod:`re` module. It provides a gentler introduction than the corresponding section in the Library Reference.
sv: Detta dokument är en inledande handledning i hur man använder reguljära uttryck i Python med modulen :mod:`re`. Det ger en mildare introduktion än motsvarande avsnitt i Library Reference.

source: Introduction
sv: Introduktion

source: Regular expressions (called REs, or regexes, or regex patterns) are essentially a tiny, highly specialized programming language embedded inside Python and made available through the :mod:`re` module. Using this little language, you specify the rules for the set of possible strings that you want to match; this set might contain English sentences, or e-mail addresses, or TeX commands, or anything you like. You can then ask questions such as "Does this string match the pattern?", or "Is there a match for the pattern anywhere in this string?". You can also use REs to modify a string or to split it apart in various ways.
sv: Reguljära uttryck (kallade RE, regex eller regexmönster) är i huvudsak ett litet, mycket specialiserat programmeringsspråk som är inbäddat i Python och görs tillgängligt via modulen :mod:`re`. Med hjälp av detta lilla språk specificerar du reglerna för den uppsättning möjliga strängar som du vill matcha; denna uppsättning kan innehålla engelska meningar, e-postadresser, TeX-kommandon eller vad du vill. Sedan kan man ställa frågor som "Matchar den här strängen mönstret?" eller "Finns det en matchning för mönstret någonstans i den här strängen?". Du kan också använda RE:er för att modifiera en sträng eller dela upp den på olika sätt.

source: Regular expression patterns are compiled into a series of bytecodes which are then executed by a matching engine written in C. For advanced use, it may be necessary to pay careful attention to how the engine will execute a given RE, and write the RE in a certain way in order to produce bytecode that runs faster. Optimization isn't covered in this document, because it requires that you have a good understanding of the matching engine's internals.
sv: Reguljära uttrycksmönster kompileras till en serie bytekoder som sedan exekveras av en matchningsmotor skriven i C. För avancerad användning kan det vara nödvändigt att vara noga med hur motorn kommer att exekvera en viss RE och skriva RE på ett visst sätt för att producera bytekoder som körs snabbare. Optimering behandlas inte i det här dokumentet, eftersom det kräver att du har en god förståelse för matchningsmotorns interna funktioner.

source: The regular expression language is relatively small and restricted, so not all possible string processing tasks can be done using regular expressions. There are also tasks that *can* be done with regular expressions, but the expressions turn out to be very complicated. In these cases, you may be better off writing Python code to do the processing; while Python code will be slower than an elaborate regular expression, it will also probably be more understandable.
sv: Språket för reguljära uttryck är relativt litet och begränsat, så alla möjliga strängbehandlingsuppgifter kan inte utföras med reguljära uttryck. Det finns också uppgifter som *kan* utföras med reguljära uttryck, men uttrycken visar sig vara mycket komplicerade. I dessa fall kan det vara bättre att skriva Python-kod för att göra bearbetningen; även om Python-kod kommer att vara långsammare än ett utarbetat reguljärt uttryck, kommer den förmodligen också att vara mer begriplig.

source: Simple Patterns
sv: Enkla mönster

source: We'll start by learning about the simplest possible regular expressions. Since regular expressions are used to operate on strings, we'll begin with the most common task: matching characters.
sv: Vi börjar med att lära oss om de enklaste möjliga reguljära uttrycken. Eftersom reguljära uttryck används för att operera på strängar börjar vi med den vanligaste uppgiften: att matcha tecken.

source: For a detailed explanation of the computer science underlying regular expressions (deterministic and non-deterministic finite automata), you can refer to almost any textbook on writing compilers.
sv: För en detaljerad förklaring av den datavetenskap som ligger bakom reguljära uttryck (deterministiska och icke-deterministiska finita automater) kan du hänvisa till nästan vilken lärobok som helst om att skriva kompilatorer.

source: Matching Characters
sv: Matchande tecken

source: Most letters and characters will simply match themselves. For example, the regular expression ``test`` will match the string ``test`` exactly. (You can enable a case-insensitive mode that would let this RE match ``Test`` or ``TEST`` as well; more about this later.)
sv: De flesta bokstäver och tecken matchar helt enkelt sig själva. Till exempel kommer det reguljära uttrycket ``test`` att matcha strängen ``test`` exakt. (Du kan aktivera ett skiftlägesokänsligt läge som låter RE matcha ``Test`` eller ``TEST`` också; mer om detta senare)

source: There are exceptions to this rule; some characters are special :dfn:`metacharacters`, and don't match themselves. Instead, they signal that some out-of-the-ordinary thing should be matched, or they affect other portions of the RE by repeating them or changing their meaning. Much of this document is devoted to discussing various metacharacters and what they do.
sv: Det finns undantag från denna regel; vissa tecken är speciella :dfn:`metatecken`, och matchar inte sig själva. Istället signalerar de att något utöver det vanliga ska matchas, eller så påverkar de andra delar av RE genom att upprepa dem eller ändra deras betydelse. En stor del av det här dokumentet ägnas åt att diskutera olika metatecken och vad de gör.

source: Here's a complete list of the metacharacters; their meanings will be discussed in the rest of this HOWTO.
sv: Här är en fullständig lista över metatecken; deras betydelser kommer att diskuteras i resten av denna HOWTO.

source: The first metacharacters we'll look at are ``[`` and ``]``. They're used for specifying a character class, which is a set of characters that you wish to match. Characters can be listed individually, or a range of characters can be indicated by giving two characters and separating them by a ``'-'``. For example, ``[abc]`` will match any of the characters ``a``, ``b``, or ``c``; this is the same as ``[a-c]``, which uses a range to express the same set of characters. If you wanted to match only lowercase letters, your RE would be ``[a-z]``.
sv: De första metatecknen vi tittar på är ``[`` och ``]``. De används för att ange en teckenklass, vilket är en uppsättning tecken som du vill matcha. Tecken kan listas individuellt, eller så kan ett intervall av tecken anges genom att ange två tecken och separera dem med en ``'-'``. Till exempel kommer ``[abc]`` att matcha vilket som helst av tecknen ``a``, ``b`` eller ``c``; detta är samma sak som ``[a-c]``, som använder ett intervall för att uttrycka samma uppsättning tecken. Om du bara vill matcha gemena bokstäver skulle RE vara ``[a-z]``.

source: Metacharacters (except ``\``) are not active inside classes. For example, ``[akm$]`` will match any of the characters ``'a'``, ``'k'``, ``'m'``, or ``'$'``; ``'$'`` is usually a metacharacter, but inside a character class it's stripped of its special nature.
sv: Metatecken (utom `````) är inte aktiva inuti klasser. Till exempel kommer ``[akm$]`` att matcha vilket som helst av tecknen ``'a'``, ``'k'``, ``'m'`` eller ``'$'``; ``'$'`` är vanligtvis ett metatecken, men inuti en teckenklass är det avskalat från sin speciella natur.

source: You can match the characters not listed within the class by :dfn:`complementing` the set. This is indicated by including a ``'^'`` as the first character of the class. For example, ``[^5]`` will match any character except ``'5'``. If the caret appears elsewhere in a character class, it does not have special meaning. For example: ``[5^]`` will match either a ``'5'`` or a ``'^'``.
sv: Du kan matcha de tecken som inte listas inom klassen genom att :dfn:`komplettera` uppsättningen. Detta indikeras genom att inkludera en ``'^'`` som första tecken i klassen. Till exempel kommer ``[^5]`` att matcha alla tecken utom ``'5'``. Om caretten förekommer någon annanstans i en teckenklass har den ingen speciell betydelse. Till exempel: ``[5^]`` kommer att matcha antingen en ``'5'`` eller en ``'^'``.

source: Perhaps the most important metacharacter is the backslash, ``\``. As in Python string literals, the backslash can be followed by various characters to signal various special sequences. It's also used to escape all the metacharacters so you can still match them in patterns; for example, if you need to match a ``[`` or ``\``, you can precede them with a backslash to remove their special meaning: ``\[`` or ``\\``.
sv: Det kanske viktigaste metatecknet är det bakre snedstrecket, `````. Precis som i Pythons stränglitteraler kan backslash följas av olika tecken för att signalera olika specialsekvenser. Det används också för att undkomma alla metatecken så att du fortfarande kan matcha dem i mönster; till exempel, om du behöver matcha en ``[`` eller `````, kan du föregå dem med en backslash för att ta bort deras speciella betydelse: ``\[`` eller ```````.

source: Some of the special sequences beginning with ``'\'`` represent predefined sets of characters that are often useful, such as the set of digits, the set of letters, or the set of anything that isn't whitespace.
sv: Vissa av de specialsekvenser som börjar med ``'\'`` representerar fördefinierade uppsättningar av tecken som ofta är användbara, t.ex. uppsättningen av siffror, uppsättningen av bokstäver eller uppsättningen av allt som inte är blanksteg.

source: Let's take an example: ``\w`` matches any alphanumeric character. If the regex pattern is expressed in bytes, this is equivalent to the class ``[a-zA-Z0-9_]``. If the regex pattern is a string, ``\w`` will match all the characters marked as letters in the Unicode database provided by the :mod:`unicodedata` module. You can use the more restricted definition of ``\w`` in a string pattern by supplying the :const:`re.ASCII` flag when compiling the regular expression.
sv: Låt oss ta ett exempel: ``\w`` matchar alla alfanumeriska tecken. Om regex-mönstret uttrycks i byte motsvarar detta klassen ``[a-zA-Z0-9_]``. Om regex-mönstret är en sträng kommer ``w`` att matcha alla tecken som markerats som bokstäver i Unicode-databasen som tillhandahålls av modulen :mod:`unicodedata`. Du kan använda den mer begränsade definitionen av ``\w`` i ett strängmönster genom att ange flaggan :const:`re.ASCII` när du kompilerar det reguljära uttrycket.

source: The following list of special sequences isn't complete. For a complete list of sequences and expanded class definitions for Unicode string patterns, see the last part of :ref:`Regular Expression Syntax <re-syntax>` in the Standard Library reference. In general, the Unicode versions match any character that's in the appropriate category in the Unicode database.
sv: Följande lista över specialsekvenser är inte fullständig. En fullständig lista över sekvenser och utökade klassdefinitioner för Unicode-strängmönster finns i den sista delen av :ref:``Regular Expression Syntax <re-syntax>`` i Standard Library-referensen. I allmänhet matchar Unicode-versionerna alla tecken som finns i lämplig kategori i Unicode-databasen.

source: Matches any decimal digit; this is equivalent to the class ``[0-9]``.
sv: Matchar alla decimalsiffror; detta motsvarar klassen ``[0-9]``.

source: Matches any non-digit character; this is equivalent to the class ``[^0-9]``.
sv: Motsvarar alla icke-siffriga tecken; detta motsvarar klassen ``[^0-9]``.

source: Matches any whitespace character; this is equivalent to the class ``[ \t\n\r\f\v]``.
sv: Matchar alla tecken för blanksteg; detta motsvarar klassen ``[ \t\n\r\f\v]``.

source: Matches any non-whitespace character; this is equivalent to the class ``[^ \t\n\r\f\v]``.
sv: Matchar alla tecken som inte är blanksteg; detta motsvarar klassen ``[^ \t\n\r\f\v]``.

source: Matches any alphanumeric character; this is equivalent to the class ``[a-zA-Z0-9_]``.
sv: Matchar alla alfanumeriska tecken; detta är likvärdigt med klassen ``[a-zA-Z0-9_]``.

source: Matches any non-alphanumeric character; this is equivalent to the class ``[^a-zA-Z0-9_]``.
sv: Matchar alla icke-alfanumeriska tecken; detta motsvarar klassen ``[^a-zA-Z0-9_]``.

source: These sequences can be included inside a character class. For example, ``[\s,.]`` is a character class that will match any whitespace character, or ``','`` or ``'.'``.
sv: Dessa sekvenser kan inkluderas i en teckenklass. Till exempel är ``[\s,.]`` en teckenklass som matchar alla blankstegstecken, eller ``','`` eller ``'.'``.

source: The final metacharacter in this section is ``.``. It matches anything except a newline character, and there's an alternate mode (:const:`re.DOTALL`) where it will match even a newline. ``.`` is often used where you want to match "any character".
sv: Det sista metatecknet i det här avsnittet är ``.``. Det matchar allt utom en ny rad, och det finns ett alternativt läge (:const:`re.DOTALL`) där det matchar även en ny rad. ``.`` används ofta där man vill matcha "alla tecken".

source: Repeating Things
sv: Upprepning av saker

source: Being able to match varying sets of characters is the first thing regular expressions can do that isn't already possible with the methods available on strings. However, if that was the only additional capability of regexes, they wouldn't be much of an advance. Another capability is that you can specify that portions of the RE must be repeated a certain number of times.
sv: Att kunna matcha varierande uppsättningar av tecken är det första som reguljära uttryck kan göra som inte redan är möjligt med de metoder som finns tillgängliga för strängar. Men om det var den enda ytterligare förmågan hos regexes, skulle de inte vara mycket av ett framsteg. En annan möjlighet är att du kan ange att delar av RE måste upprepas ett visst antal gånger.

source: The first metacharacter for repeating things that we'll look at is ``*``. ``*`` doesn't match the literal character ``'*'``; instead, it specifies that the previous character can be matched zero or more times, instead of exactly once.
sv: Det första metatecknet för upprepning av saker som vi ska titta på är ``*``. ``*`` matchar inte det bokstavliga tecknet ``'*'``; istället anger det att det föregående tecknet kan matchas noll eller flera gånger, istället för exakt en gång.

source: For example, ``ca*t`` will match ``'ct'`` (0 ``'a'`` characters), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` characters), and so forth.
sv: Till exempel kommer ``ca*t`` att matcha ``'ct'`` (0 ``'a'`` tecken), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` tecken), och så vidare.

source: Repetitions such as ``*`` are :dfn:`greedy`; when repeating a RE, the matching engine will try to repeat it as many times as possible. If later portions of the pattern don't match, the matching engine will then back up and try again with fewer repetitions.
sv: Upprepningar som ``*`` är :dfn:`greedy`; när en RE upprepas försöker matchningsmotorn upprepa den så många gånger som möjligt. Om senare delar av mönstret inte matchar, backar matchningsmotorn och försöker igen med färre upprepningar.

source: A step-by-step example will make this more obvious. Let's consider the expression ``a[bcd]*b``. This matches the letter ``'a'``, zero or more letters from the class ``[bcd]``, and finally ends with a ``'b'``. Now imagine matching this RE against the string ``'abcbd'``.
sv: Ett steg-för-steg exempel gör detta mer uppenbart. Låt oss betrakta uttrycket ``a[bcd]*b``. Detta matchar bokstaven ``'a'``, noll eller fler bokstäver från klassen ``[bcd]``, och slutar slutligen med ``'b'``. Tänk dig nu att du matchar denna RE mot strängen ``'abcbd``.

source: Step
sv: Steg

source: Matched
sv: Matchad

source: Explanation
sv: Förklaring

source: The ``a`` in the RE matches.
sv: "A" i "RE" stämmer överens.

source: The engine matches ``[bcd]*``, going as far as it can, which is to the end of the string.
sv: Motorn matchar ``[bcd]*`` och går så långt den kan, vilket är till slutet av strängen.

source: *Failure*
sv: *Fel*

source: The engine tries to match ``b``, but the current position is at the end of the string, so it fails.
sv: Motorn försöker matcha ``b``, men den aktuella positionen är i slutet av strängen, så det misslyckas.

source: Back up, so that ``[bcd]*`` matches one less character.
sv: Backa, så att ``[bcd]*`` matchar ett tecken mindre.

source: Try ``b`` again, but the current position is at the last character, which is a ``'d'``.
sv: Försök med ``b`` igen, men den aktuella positionen är vid det sista tecknet, som är en ``'d'``.

source: Back up again, so that ``[bcd]*`` is only matching ``bc``.
sv: Tillbaka upp igen, så att ``[bcd]*`` bara matchar ``bc``.

source: Try ``b`` again. This time the character at the current position is ``'b'``, so it succeeds.
sv: Försök med ``b`` igen. Den här gången är tecknet vid den aktuella positionen ``'b'``, så det lyckas.

source: The end of the RE has now been reached, and it has matched ``'abcb'``. This demonstrates how the matching engine goes as far as it can at first, and if no match is found it will then progressively back up and retry the rest of the RE again and again. It will back up until it has tried zero matches for ``[bcd]*``, and if that subsequently fails, the engine will conclude that the string doesn't match the RE at all.
sv: Slutet av RE har nu nåtts, och den har matchat ``'abcb``. Detta visar hur matchningsmotorn först går så långt den kan, och om ingen matchning hittas kommer den sedan successivt att backa tillbaka och försöka resten av RE om och om igen. Den kommer att backa tills den har försökt noll matchningar för ``[bcd]*``, och om det därefter misslyckas kommer motorn att dra slutsatsen att strängen inte alls matchar RE.

source: Another repeating metacharacter is ``+``, which matches one or more times. Pay careful attention to the difference between ``*`` and ``+``; ``*`` matches *zero* or more times, so whatever's being repeated may not be present at all, while ``+`` requires at least *one* occurrence. To use a similar example, ``ca+t`` will match ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), but won't match ``'ct'``.
sv: Ett annat upprepande metatecken är ``+``, som matchar en eller flera gånger. Var noga med skillnaden mellan ``*`` och ``+``; ``*`` matchar *noll* eller fler gånger, så det som upprepas kanske inte finns med alls, medan ``+`` kräver minst *en* förekomst. För att använda ett liknande exempel, ``ca+t`` kommer att matcha ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``), men kommer inte att matcha ``'ct'``.

source: There are two more repeating operators or quantifiers. The question mark character, ``?``, matches either once or zero times; you can think of it as marking something as being optional. For example, ``home-?brew`` matches either ``'homebrew'`` or ``'home-brew'``.
sv: Det finns ytterligare två upprepande operatorer eller kvantifierare. Frågetecknet, ``?``, matchar antingen en eller noll gånger; du kan tänka på det som att markera att något är valfritt. Till exempel, ``home-?brew`` matchar antingen ``'homebrew'`` eller ``'home-brew'``.

source: The most complicated quantifier is ``{m,n}``, where *m* and *n* are decimal integers. This quantifier means there must be at least *m* repetitions, and at most *n*. For example, ``a/{1,3}b`` will match ``'a/b'``, ``'a//b'``, and ``'a///b'``. It won't match ``'ab'``, which has no slashes, or ``'a////b'``, which has four.
sv: Den mest komplicerade kvantifieringen är ``{m,n}``, där *m* och *n* är decimala heltal. Denna kvantifierare innebär att det måste finnas minst *m* upprepningar och högst *n*. Till exempel kommer ``a/{1,3}b`` att matcha ``'a/b'``, ``'a//b'`` och ``'a///b'``. Det kommer inte att matcha ``'ab'``, som inte har några snedstreck, eller ``'a////b'``, som har fyra.

source: You can omit either *m* or *n*; in that case, a reasonable value is assumed for the missing value. Omitting *m* is interpreted as a lower limit of 0, while omitting *n* results in an upper bound of infinity.
sv: Du kan utelämna antingen *m* eller *n*; i så fall antas ett rimligt värde för det saknade värdet. Att utelämna *m* tolkas som en nedre gräns på 0, medan att utelämna *n* resulterar i en övre gräns på oändlighet.

source: The simplest case ``{m}`` matches the preceding item exactly *m* times. For example, ``a/{2}b`` will only match ``'a//b'``.
sv: Det enklaste fallet ``{m}`` matchar föregående objekt exakt *m* gånger. Till exempel kommer ``a/{2}b`` bara att matcha ``'a//b'``.

source: Readers of a reductionist bent may notice that the three other quantifiers can all be expressed using this notation. ``{0,}`` is the same as ``*``, ``{1,}`` is equivalent to ``+``, and ``{0,1}`` is the same as ``?``. It's better to use ``*``, ``+``, or ``?`` when you can, simply because they're shorter and easier to read.
sv: Läsare med en reduktionistisk böjelse kan notera att de tre andra kvantifierarna alla kan uttryckas med denna notation. ``{0,}`` är detsamma som ``*``, ``{1,}`` är ekvivalent med ``+`` och ``{0,1}`` är detsamma som ``?``. Det är bättre att använda ``*``, ``+`` eller ``?`` när du kan, helt enkelt för att de är kortare och lättare att läsa.

source: Using Regular Expressions
sv: Använda reguljära uttryck

source: Now that we've looked at some simple regular expressions, how do we actually use them in Python? The :mod:`re` module provides an interface to the regular expression engine, allowing you to compile REs into objects and then perform matches with them.
sv: Nu när vi har tittat på några enkla reguljära uttryck, hur använder vi dem egentligen i Python? Modulen :mod:`re` tillhandahåller ett gränssnitt till motorn för reguljära uttryck, så att du kan sammanställa RE:er till objekt och sedan utföra matchningar med dem.

source: Compiling Regular Expressions
sv: Kompilera reguljära uttryck

source: Regular expressions are compiled into pattern objects, which have methods for various operations such as searching for pattern matches or performing string substitutions. ::
sv: Reguljära uttryck sammanställs till mönsterobjekt, som har metoder för olika operationer som att söka efter mönstermatchningar eller utföra strängersättningar:

source: :func:`re.compile` also accepts an optional *flags* argument, used to enable various special features and syntax variations. We'll go over the available settings later, but for now a single example will do::
sv: :func:`re.compile` accepterar också ett valfritt *flags*-argument, som används för att aktivera olika specialfunktioner och syntaxvariationer. Vi kommer att gå igenom de tillgängliga inställningarna senare, men nu räcker det med ett exempel::
