Repository: yeager/python-docs-sv
Catalog: howto/sockets.po
Languages: sv

source: Strictly speaking, you're supposed to use ``shutdown`` on a socket before you ``close`` it. The ``shutdown`` is an advisory to the socket at the other end. Depending on the argument you pass it, it can mean "I'm not going to send anymore, but I'll still listen", or "I'm not listening, good riddance!". Most socket libraries, however, are so used to programmers neglecting to use this piece of etiquette that normally a ``close`` is the same as ``shutdown(); close()``. So in most situations, an explicit ``shutdown`` is not needed.
sv: Strängt taget är det meningen att du ska använda ``shutdown`` på ett socket innan du ``stänger`` det. ``shutdown`` är ett råd till socketet i andra änden. Beroende på vilket argument du ger det kan det betyda "Jag tänker inte skicka mer, men jag lyssnar fortfarande", eller "Jag lyssnar inte, bra att slippa!". De flesta socket-bibliotek är dock så vana vid att programmerare struntar i att använda denna etikett att en ``close`` normalt är detsamma som ``shutdown(); close()``. Så i de flesta situationer behövs inte en explicit ``shutdown``.

source: One way to use ``shutdown`` effectively is in an HTTP-like exchange. The client sends a request and then does a ``shutdown(1)``. This tells the server "This client is done sending, but can still receive." The server can detect "EOF" by a receive of 0 bytes. It can assume it has the complete request. The server sends a reply. If the ``send`` completes successfully then, indeed, the client was still receiving.
sv: Ett sätt att använda ``shutdown`` effektivt är i en HTTP-liknande utväxling. Klienten skickar en begäran och gör sedan en ``shutdown(1)``. Detta säger till servern "Den här klienten är klar med att skicka, men kan fortfarande ta emot." Servern kan upptäcka "EOF" genom en mottagning av 0 byte. Den kan anta att den har hela begäran. Servern skickar ett svar. Om ``send`` avslutas framgångsrikt så var klienten faktiskt fortfarande mottagande.

source: Python takes the automatic shutdown a step further, and says that when a socket is garbage collected, it will automatically do a ``close`` if it's needed. But relying on this is a very bad habit. If your socket just disappears without doing a ``close``, the socket at the other end may hang indefinitely, thinking you're just being slow. *Please* ``close`` your sockets when you're done.
sv: Python tar den automatiska avstängningen ett steg längre och säger att när ett socket är garbage collected, kommer det automatiskt att göra en ``close`` om det behövs. Men att förlita sig på detta är en mycket dålig vana. Om ditt socket bara försvinner utan att göra en ``close``, kan socketet i andra änden hänga på obestämd tid och tro att du bara är långsam. *Snälla* ``close`` dina socket när du är klar.

source: When Sockets Die
sv: När socklar dör

source: Probably the worst thing about using blocking sockets is what happens when the other side comes down hard (without doing a ``close``). Your socket is likely to hang. TCP is a reliable protocol, and it will wait a long, long time before giving up on a connection. If you're using threads, the entire thread is essentially dead. There's not much you can do about it. As long as you aren't doing something dumb, like holding a lock while doing a blocking read, the thread isn't really consuming much in the way of resources. Do *not* try to kill the thread - part of the reason that threads are more efficient than processes is that they avoid the overhead associated with the automatic recycling of resources. In other words, if you do manage to kill the thread, your whole process is likely to be screwed up.
sv: Det värsta med att använda blockerande socklar är förmodligen vad som händer när den andra sidan går ner hårt (utan att göra en ``close``). Ditt socket kommer sannolikt att hänga. TCP är ett pålitligt protokoll, och det kommer att vänta länge, länge innan det ger upp en anslutning. Om du använder trådar är hela tråden i princip död. Det finns inte mycket du kan göra åt det. Så länge du inte gör något dumt, som att hålla ett lås medan du gör en blockerande läsning, förbrukar tråden egentligen inte mycket resurser. Försök *inte* att döda tråden - en del av anledningen till att trådar är mer effektiva än processer är att de undviker den overhead som är förknippad med automatisk återvinning av resurser. Med andra ord, om du lyckas döda tråden är det troligt att hela din process kommer att gå åt skogen.

source: Non-blocking Sockets
sv: Icke-blockerande socklar

source: If you've understood the preceding, you already know most of what you need to know about the mechanics of using sockets. You'll still use the same calls, in much the same ways. It's just that, if you do it right, your app will be almost inside-out.
sv: Om du har förstått det föregående vet du redan det mesta du behöver veta om hur man använder sockets. Du kommer fortfarande att använda samma samtal, på ungefär samma sätt. Det är bara det att om du gör det rätt kommer din app att vara nästan inifrån och ut.

source: In Python, you use ``socket.setblocking(False)`` to make it non-blocking. In C, it's more complex, (for one thing, you'll need to choose between the BSD flavor ``O_NONBLOCK`` and the almost indistinguishable POSIX flavor ``O_NDELAY``, which is completely different from ``TCP_NODELAY``), but it's the exact same idea. You do this after creating the socket, but before using it. (Actually, if you're nuts, you can switch back and forth.)
sv: I Python använder du ``socket.setblocking(False)`` för att göra det icke-blockerande. I C är det mer komplext, (för det första måste du välja mellan BSD-smaken ``O_NONBLOCK`` och den nästan oskiljaktiga POSIX-smaken ``O_NDELAY``, som är helt annorlunda än ``TCP_NODELAY``), men det är exakt samma idé. Du gör detta efter att du har skapat socketet, men innan du använder det. (Om du är galen kan du faktiskt växla fram och tillbaka)

source: The major mechanical difference is that ``send``, ``recv``, ``connect`` and ``accept`` can return without having done anything. You have (of course) a number of choices. You can check return code and error codes and generally drive yourself crazy. If you don't believe me, try it sometime. Your app will grow large, buggy and suck CPU. So let's skip the brain-dead solutions and do it right.
sv: Den stora mekaniska skillnaden är att ```end``, ``recv``, ``connect`` och ``accept`` kan återvända utan att ha gjort någonting. Du har (naturligtvis) ett antal valmöjligheter. Du kan kontrollera returkod och felkoder och i allmänhet driva dig själv till vansinne. Om du inte tror mig, prova det någon gång. Din app kommer att växa sig stor, buggig och suga CPU. Så låt oss hoppa över de hjärndöda lösningarna och göra det rätt.

source: Use ``select``.
sv: Använd ``select``.

source: In C, coding ``select`` is fairly complex. In Python, it's a piece of cake, but it's close enough to the C version that if you understand ``select`` in Python, you'll have little trouble with it in C::
sv: I C är det ganska komplicerat att koda ``select``. I Python är det en bit kaka, men det är tillräckligt nära C-versionen att om du förstår ``select`` i Python, kommer du att ha lite problem med det i C::

source: You pass ``select`` three lists: the first contains all sockets that you might want to try reading; the second all the sockets you might want to try writing to, and the last (normally left empty) those that you want to check for errors. You should note that a socket can go into more than one list. The ``select`` call is blocking, but you can give it a timeout. This is generally a sensible thing to do - give it a nice long timeout (say a minute) unless you have good reason to do otherwise.
sv: Du skickar ``select`` tre listor: den första innehåller alla socket som du kanske vill försöka läsa; den andra alla socket som du kanske vill försöka skriva till och den sista (lämnas normalt tom) de som du vill kontrollera för fel. Observera att ett socket kan ingå i mer än en lista. Anropet ``select`` är blockerande, men du kan ge det en timeout. Detta är i allmänhet en förnuftig sak att göra - ge det en lång timeout (säg en minut) om du inte har goda skäl att göra något annat.

source: In return, you will get three lists. They contain the sockets that are actually readable, writable and in error. Each of these lists is a subset (possibly empty) of the corresponding list you passed in.
sv: I gengäld får du tre listor. De innehåller de socket som faktiskt är läsbara, skrivbara och felaktiga. Var och en av dessa listor är en delmängd (eventuellt tom) av motsvarande lista som du skickade in.

source: If a socket is in the output readable list, you can be as-close-to-certain-as-we-ever-get-in-this-business that a ``recv`` on that socket will return *something*. Same idea for the writable list. You'll be able to send *something*. Maybe not all you want to, but *something* is better than nothing. (Actually, any reasonably healthy socket will return as writable - it just means outbound network buffer space is available.)
sv: Om ett socket finns i den läsbara listan för utdata kan du vara så nära säker som vi någonsin kan vara i den här branschen på att en ``recv`` på det socketet kommer att returnera *något*. Samma idé för den skrivbara listan. Du kommer att kunna skicka *något*. Kanske inte allt du vill, men *något* är bättre än ingenting. (Egentligen kommer alla rimligt friska socket att returnera som skrivbara - det betyder bara att buffertutrymme för utgående nätverk är tillgängligt)

source: If you have a "server" socket, put it in the potential_readers list. If it comes out in the readable list, your ``accept`` will (almost certainly) work. If you have created a new socket to ``connect`` to someone else, put it in the potential_writers list. If it shows up in the writable list, you have a decent chance that it has connected.
sv: Om du har ett "server"-socket, lägg till det i listan potential_readers. Om den hamnar i den läsbara listan kommer din ``accept`` (nästan säkert) att fungera. Om du har skapat en ny socket för att ``ansluta`` till någon annan, lägg den i listan potential_writers. Om den dyker upp i den skrivbara listan har du en hyfsad chans att den har anslutit.

source: Actually, ``select`` can be handy even with blocking sockets. It's one way of determining whether you will block - the socket returns as readable when there's something in the buffers. However, this still doesn't help with the problem of determining whether the other end is done, or just busy with something else.
sv: Egentligen kan ``select`` vara praktiskt även med blockerande socket. Det är ett sätt att avgöra om du kommer att blockera - socketet returneras som läsbart när det finns något i buffertarna. Detta hjälper dock fortfarande inte med problemet att avgöra om den andra änden är klar, eller bara upptagen med något annat.

source: **Portability alert**: On Unix, ``select`` works both with the sockets and files. Don't try this on Windows. On Windows, ``select`` works with sockets only. Also note that in C, many of the more advanced socket options are done differently on Windows. In fact, on Windows I usually use threads (which work very, very well) with my sockets.
sv: **Portabilitetsvarning**: På Unix fungerar ``select`` både med sockets och filer. Försök inte detta på Windows. På Windows fungerar ``select`` endast med socket. Observera också att i C görs många av de mer avancerade sockelalternativen annorlunda på Windows. Faktum är att jag på Windows brukar använda trådar (som fungerar mycket, mycket bra) med mina socket.
