Repository: yeager/python-docs-sv
Catalog: howto/sockets.po
Languages: sv

source: Socket Programming HOWTO
sv: HOWTO för programmering av socket

source: Author
sv: Författare

source: Abstract
sv: Abstrakt

source: Sockets are used nearly everywhere, but are one of the most severely misunderstood technologies around. This is a 10,000 foot overview of sockets. It's not really a tutorial - you'll still have work to do in getting things operational. It doesn't cover the fine points (and there are a lot of them), but I hope it will give you enough background to begin using them decently.
sv: Socklar används nästan överallt, men är en av de mest missförstådda teknikerna som finns. Detta är en 10 000 fot översikt över socklar. Det är inte riktigt en handledning - du kommer fortfarande att ha arbete att göra för att få saker att fungera. Det täcker inte de fina punkterna (och det finns många av dem), men jag hoppas att det kommer att ge dig tillräckligt med bakgrund för att börja använda dem anständigt.

source: Sockets
sv: Uttag

source: I'm only going to talk about INET (i.e. IPv4) sockets, but they account for at least 99% of the sockets in use. And I'll only talk about STREAM (i.e. TCP) sockets - unless you really know what you're doing (in which case this HOWTO isn't for you!), you'll get better behavior and performance from a STREAM socket than anything else. I will try to clear up the mystery of what a socket is, as well as some hints on how to work with blocking and non-blocking sockets. But I'll start by talking about blocking sockets. You'll need to know how they work before dealing with non-blocking sockets.
sv: Jag kommer bara att prata om INET-socket (dvs. IPv4), men de står för minst 99% of av de socket som används. Och jag kommer bara att prata om STREAM-socket (dvs. TCP) - såvida du inte verkligen vet vad du gör (i vilket fall denna HOWTO inte är för dig!), Kommer du att få bättre beteende och prestanda från ett STREAM-socket än något annat. Jag ska försöka reda ut mysteriet med vad en socket är, samt ge några tips om hur man arbetar med blockerande och icke-blockerande sockets. Men jag börjar med att prata om blockerande socklar. Du måste veta hur de fungerar innan du kan ta itu med icke-blockerande socklar.

source: Part of the trouble with understanding these things is that "socket" can mean a number of subtly different things, depending on context. So first, let's make a distinction between a "client" socket - an endpoint of a conversation, and a "server" socket, which is more like a switchboard operator. The client application (your browser, for example) uses "client" sockets exclusively; the web server it's talking to uses both "server" sockets and "client" sockets.
sv: En del av problemet med att förstå dessa saker är att "socket" kan betyda ett antal subtilt olika saker, beroende på sammanhang. Så låt oss först skilja mellan ett "klient" -socket - en slutpunkt för en konversation och ett "server" -socket, som är mer som en växeloperator. Klientapplikationen (till exempel din webbläsare) använder uteslutande "klient" -socket; webbservern som den pratar med använder både "server" -socket och "klient" -socket.

source: History
sv: Historik

source: Of the various forms of :abbr:`IPC (Inter Process Communication)`, sockets are by far the most popular. On any given platform, there are likely to be other forms of IPC that are faster, but for cross-platform communication, sockets are about the only game in town.
sv: Av de olika formerna av :abbr:`IPC (Inter Process Communication)` är sockets de överlägset mest populära. På en viss plattform finns det sannolikt andra former av IPC som är snabbare, men för plattformsoberoende kommunikation är sockets i stort sett det enda som gäller.

source: They were invented in Berkeley as part of the BSD flavor of Unix. They spread like wildfire with the internet. With good reason --- the combination of sockets with INET makes talking to arbitrary machines around the world unbelievably easy (at least compared to other schemes).
sv: De uppfanns i Berkeley som en del av BSD-varianten av Unix. De spred sig som en löpeld med internet. Med goda skäl --- kombinationen av sockets med INET gör det otroligt enkelt att prata med godtyckliga maskiner runt om i världen (åtminstone jämfört med andra system).

source: Creating a Socket
sv: Skapa en socket

source: Roughly speaking, when you clicked on the link that brought you to this page, your browser did something like the following::
sv: När du klickade på länken som förde dig till den här sidan gjorde din webbläsare ungefär följande::

source: # create an INET, STREAMing socket s = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # now connect to the web server on port 80 - the normal http port s.connect(("www.python.org", 80))
sv: # skapa ett INET, STREAMing-socket s = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # anslut nu till webbservern på port 80 - den normala http-porten s.connect(("www.python.org", 80))

source: When the ``connect`` completes, the socket ``s`` can be used to send in a request for the text of the page. The same socket will read the reply, and then be destroyed. That's right, destroyed. Client sockets are normally only used for one exchange (or a small set of sequential exchanges).
sv: När ``connect`` är klar kan sockeln ``s`` användas för att skicka en begäran om texten på sidan. Samma socket kommer att läsa svaret och sedan förstöras. Just det, förstörs. Klientsocklar används normalt bara för ett utbyte (eller en liten uppsättning sekventiella utbyten).

source: What happens in the web server is a bit more complex. First, the web server creates a "server socket"::
sv: Vad som händer i webbservern är lite mer komplicerat. Först skapar webbservern ett "serversocket"::

source: # create an INET, STREAMing socket serversocket = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # bind the socket to a public host, and a well-known port serversocket.bind((socket.gethostname(), 80)) # become a server socket serversocket.listen(5)
sv: # skapa ett INET, STREAMing-socket serversocket = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # binda socketet till en offentlig värd och en välkänd port serversocket.bind((socket.gethostname(), 80)) # bli ett serversocket serversocket.lyssna(5)

source: A couple things to notice: we used ``socket.gethostname()`` so that the socket would be visible to the outside world. If we had used ``s.bind(('localhost', 80))`` or ``s.bind(('127.0.0.1', 80))`` we would still have a "server" socket, but one that was only visible within the same machine. ``s.bind(('', 80))`` specifies that the socket is reachable by any address the machine happens to have.
sv: Ett par saker att notera: vi använde ``socket.gethostname()`` så att socketet skulle vara synligt för omvärlden. Om vi hade använt ``s.bind(('localhost', 80))`` eller ``s.bind(('127.0.0.1', 80))`` skulle vi fortfarande ha ett "server"-socket, men ett som bara var synligt inom samma maskin. ``s.bind(('', 80))`` anger att socketet är nåbart med vilken adress som helst som maskinen råkar ha.

source: A second thing to note: low number ports are usually reserved for "well known" services (HTTP, SNMP etc). If you're playing around, use a nice high number (4 digits).
sv: En annan sak att notera: portar med låga nummer är vanligtvis reserverade för "välkända" tjänster (HTTP, SNMP etc). Om du vill leka lite, använd ett högt nummer (4 siffror).

source: Finally, the argument to ``listen`` tells the socket library that we want it to queue up as many as 5 connect requests (the normal max) before refusing outside connections. If the rest of the code is written properly, that should be plenty.
sv: Slutligen talar argumentet till ``listen`` om för socket-biblioteket att vi vill att det ska köa upp till 5 anslutningsbegäranden (det normala maxantalet) innan det nekar anslutningar utifrån. Om resten av koden är korrekt skriven borde det räcka.

source: Now that we have a "server" socket, listening on port 80, we can enter the mainloop of the web server::
sv: Nu när vi har ett "server"-socket som lyssnar på port 80 kan vi gå in i webbserverns huvudloop::

source: There's actually 3 general ways in which this loop could work - dispatching a thread to handle ``clientsocket``, create a new process to handle ``clientsocket``, or restructure this app to use non-blocking sockets, and multiplex between our "server" socket and any active ``clientsocket``\ s using ``select``. More about that later. The important thing to understand now is this: this is *all* a "server" socket does. It doesn't send any data. It doesn't receive any data. It just produces "client" sockets. Each ``clientsocket`` is created in response to some *other* "client" socket doing a ``connect()`` to the host and port we're bound to. As soon as we've created that ``clientsocket``, we go back to listening for more connections. The two "clients" are free to chat it up - they are using some dynamically allocated port which will be recycled when the conversation ends.
sv: Det finns faktiskt tre allmänna sätt på vilka den här slingan kan fungera - skicka en tråd för att hantera ``clientsocket``, skapa en ny process för att hantera ``clientsocket``, eller omstrukturera den här appen för att använda icke-blockerande socket och multiplexera mellan vårt "server" -socket och alla aktiva ``clientsocket`` med ``select``. Mer om det senare. Det viktiga att förstå nu är detta: det här är * allt * ett "server" -socket gör. Den skickar inte någon data. Den tar inte emot några data. Den producerar bara "klient"-socket. Varje ``clientsocket`` skapas som svar på att någon *annan* "client" socket gör en ``connect()`` till den host och port vi är bundna till. Så snart vi har skapat det ``clientsocket``, går vi tillbaka till att lyssna efter fler anslutningar. De två "klienterna" är fria att chatta - de använder en dynamiskt allokerad port som kommer att återvinnas när konversationen avslutas.

source: If you need fast IPC between two processes on one machine, you should look into pipes or shared memory. If you do decide to use AF_INET sockets, bind the "server" socket to ``'localhost'``. On most platforms, this will take a shortcut around a couple of layers of network code and be quite a bit faster.
sv: Om du behöver snabb IPC mellan två processer på en maskin bör du titta på pipes eller delat minne. Om du bestämmer dig för att använda AF_INET-sockets, bind "server"-socketen till ``'localhost``. På de flesta plattformar kommer detta att ta en genväg runt ett par lager av nätverkskod och vara ganska mycket snabbare.

source: The :mod:`multiprocessing` integrates cross-platform IPC into a higher-level API.
sv: :mod:`multiprocessing` integrerar plattformsoberoende IPC i ett API på högre nivå.

source: Using a Socket
sv: Använda ett socket

source: The first thing to note, is that the web browser's "client" socket and the web server's "client" socket are identical beasts. That is, this is a "peer to peer" conversation. Or to put it another way, *as the designer, you will have to decide what the rules of etiquette are for a conversation*. Normally, the ``connect``\ ing socket starts the conversation, by sending in a request, or perhaps a signon. But that's a design decision - it's not a rule of sockets.
sv: Det första man bör notera är att webbläsarens "klient"-socket och webbserverns "klient"-socket är identiska. Det vill säga, det här är en "peer to peer"-konversation. Eller för att uttrycka det på ett annat sätt, *som designer måste du bestämma vilka etikettregler som gäller för en konversation*. Normalt startar ``connect`` ing-socketet konversationen genom att skicka in en begäran eller kanske en signon. Men det är ett designbeslut - det är inte en regel för sockets.

source: Now there are two sets of verbs to use for communication. You can use ``send`` and ``recv``, or you can transform your client socket into a file-like beast and use ``read`` and ``write``. The latter is the way Java presents its sockets. I'm not going to talk about it here, except to warn you that you need to use ``flush`` on sockets. These are buffered "files", and a common mistake is to ``write`` something, and then ``read`` for a reply. Without a ``flush`` in there, you may wait forever for the reply, because the request may still be in your output buffer.
sv: Nu finns det två uppsättningar verb att använda för kommunikation. Du kan använda ```end`` och ``recv``, eller så kan du omvandla din klientsocket till ett filliknande djur och använda ``read`` och ``write``. Det senare är det sätt som Java presenterar sina socket. Jag kommer inte att prata om det här, förutom att varna dig för att du måste använda ``flush`` på sockets. Dessa är buffrade "filer", och ett vanligt misstag är att ``skriva`` något, och sedan ``läsa`` för ett svar. Utan en ``flush`` där kan du vänta för evigt på svaret, eftersom begäran fortfarande kan finnas i din utmatningsbuffert.

source: Now we come to the major stumbling block of sockets - ``send`` and ``recv`` operate on the network buffers. They do not necessarily handle all the bytes you hand them (or expect from them), because their major focus is handling the network buffers. In general, they return when the associated network buffers have been filled (``send``) or emptied (``recv``). They then tell you how many bytes they handled. It is *your* responsibility to call them again until your message has been completely dealt with.
sv: Nu kommer vi till den stora stötestenen för sockets - ``end`` och ``recv`` arbetar med nätverksbuffertarna. De hanterar inte nödvändigtvis alla bytes du ger dem (eller förväntar dig av dem), eftersom deras huvudfokus är att hantera nätverksbuffertarna. I allmänhet återkommer de när de associerade nätverksbuffertarna har fyllts (``end``) eller tömts (``recv``). De berättar sedan hur många byte de hanterade. Det är *ditt* ansvar att anropa dem igen tills ditt meddelande har behandlats fullständigt.

source: When a ``recv`` returns 0 bytes, it means the other side has closed (or is in the process of closing) the connection. You will not receive any more data on this connection. Ever. You may be able to send data successfully; I'll talk more about this later.
sv: När en ``recv`` returnerar 0 byte betyder det att den andra sidan har stängt (eller håller på att stänga) anslutningen. Du kommer inte att få några fler data på den här anslutningen. Alltid. Du kanske kan skicka data framgångsrikt; jag kommer att prata mer om detta senare.

source: A protocol like HTTP uses a socket for only one transfer. The client sends a request, then reads a reply. That's it. The socket is discarded. This means that a client can detect the end of the reply by receiving 0 bytes.
sv: Ett protokoll som HTTP använder en socket för endast en överföring. Klienten skickar en begäran och läser sedan ett svar. Sedan är det slut. Uttaget kasseras. Detta innebär att en klient kan upptäcka slutet på svaret genom att ta emot 0 byte.

source: But if you plan to reuse your socket for further transfers, you need to realize that *there is no* :abbr:`EOT (End of Transfer)` *on a socket.* I repeat: if a socket ``send`` or ``recv`` returns after handling 0 bytes, the connection has been broken. If the connection has *not* been broken, you may wait on a ``recv`` forever, because the socket will *not* tell you that there's nothing more to read (for now). Now if you think about that a bit, you'll come to realize a fundamental truth of sockets: *messages must either be fixed length* (yuck), *or be delimited* (shrug), *or indicate how long they are* (much better), *or end by shutting down the connection*. The choice is entirely yours, (but some ways are righter than others).
sv: Men om du planerar att återanvända din socket för ytterligare överföringar måste du inse att *det inte finns någon* :abbr:`EOT (End of Transfer)` *på en socket.* Jag upprepar: om en socket ``send`` eller ``recv`` returnerar efter att ha hanterat 0 byte har anslutningen brutits. Om anslutningen *inte* har brutits kan du vänta på en ``recv`` för alltid, eftersom socketet *inte* kommer att berätta att det inte finns något mer att läsa (för tillfället). Om du nu tänker lite på det kommer du att inse en grundläggande sanning om socket: *meddelanden måste antingen ha en fast längd* (usch), *eller vara avgränsade* (axelryckning), *eller ange hur långa de är* (mycket bättre), *eller avslutas med att anslutningen stängs*. Valet är helt och hållet ditt, (men vissa sätt är mer rätt än andra).

source: Assuming you don't want to end the connection, the simplest solution is a fixed length message::
sv: Förutsatt att du inte vill avsluta anslutningen är den enklaste lösningen ett meddelande med fast längd::

source: The sending code here is usable for almost any messaging scheme - in Python you send strings, and you can use ``len()`` to determine its length (even if it has embedded ``\0`` characters). It's mostly the receiving code that gets more complex. (And in C, it's not much worse, except you can't use ``strlen`` if the message has embedded ``\0``\ s.)
sv: Sändningskoden här är användbar för nästan alla meddelandesystem - i Python skickar du strängar, och du kan använda ``len()`` för att bestämma dess längd (även om den har inbäddade ``\0``-tecken). Det är mest den mottagande koden som blir mer komplex. (Och i C är det inte mycket värre, förutom att du inte kan använda ``strlen`` om meddelandet har inbäddade ``0`` s.)

source: The easiest enhancement is to make the first character of the message an indicator of message type, and have the type determine the length. Now you have two ``recv``\ s - the first to get (at least) that first character so you can look up the length, and the second in a loop to get the rest. If you decide to go the delimited route, you'll be receiving in some arbitrary chunk size, (4096 or 8192 is frequently a good match for network buffer sizes), and scanning what you've received for a delimiter.
sv: Den enklaste förbättringen är att göra det första tecknet i meddelandet till en indikator på meddelandetyp och låta typen bestämma längden. Nu har du två ``recv`` - den första för att få (åtminstone) det första tecknet så att du kan slå upp längden, och den andra i en slinga för att få resten. Om du väljer den avgränsade vägen tar du emot i någon godtycklig storlek (4096 eller 8192 är ofta en bra matchning för nätverkets buffertstorlekar) och skannar det du har fått efter en avgränsare.

source: One complication to be aware of: if your conversational protocol allows multiple messages to be sent back to back (without some kind of reply), and you pass ``recv`` an arbitrary chunk size, you may end up reading the start of a following message. You'll need to put that aside and hold onto it, until it's needed.
sv: En komplikation att vara medveten om: om ditt konversationsprotokoll tillåter att flera meddelanden skickas rygg mot rygg (utan någon form av svar), och du skickar ``recv`` en godtycklig bitstorlek, kan det hända att du läser början på ett följande meddelande. Du måste lägga det åt sidan och hålla fast vid det tills det behövs.

source: Prefixing the message with its length (say, as 5 numeric characters) gets more complex, because (believe it or not), you may not get all 5 characters in one ``recv``. In playing around, you'll get away with it; but in high network loads, your code will very quickly break unless you use two ``recv`` loops - the first to determine the length, the second to get the data part of the message. Nasty. This is also when you'll discover that ``send`` does not always manage to get rid of everything in one pass. And despite having read this, you will eventually get bit by it!
sv: Att prefixa meddelandet med dess längd (säg, som 5 numeriska tecken) blir mer komplext, för (tro det eller ej), du kanske inte får alla 5 tecken i en ``recv``. När du leker kommer du undan med det; men i höga nätverksbelastningar kommer din kod mycket snabbt att brytas om du inte använder två ``recv``-loopar - den första för att bestämma längden, den andra för att få datadelen av meddelandet. Otäckt. Det är också då du upptäcker att ``end`` inte alltid lyckas bli av med allt i ett svep. Och trots att du har läst detta kommer du så småningom att bli biten av det!

source: In the interests of space, building your character, (and preserving my competitive position), these enhancements are left as an exercise for the reader. Lets move on to cleaning up.
sv: Av utrymmesskäl, för att bygga upp din karaktär (och för att bevara min konkurrensposition) lämnas dessa förbättringar som en övning för läsaren. Låt oss gå vidare till att städa upp.

source: Binary Data
sv: Binär data

source: It is perfectly possible to send binary data over a socket. The major problem is that not all machines use the same formats for binary data. For example, `network byte order <https://en.wikipedia.org/wiki/Endianness#Networking>`_ is big-endian, with the most significant byte first, so a 16 bit integer with the value ``1`` would be the two hex bytes ``00 01``. However, most common processors (x86/AMD64, ARM, RISC-V), are little-endian, with the least significant byte first - that same ``1`` would be ``01 00``.
sv: Det är fullt möjligt att skicka binära data via en socket. Det stora problemet är att inte alla maskiner använder samma format för binära data. Till exempel är "byteordning i nätverk <https://en.wikipedia.org/wiki/Endianness#Networking>`_ big-endian, med den mest signifikanta byten först, så ett 16-bitars heltal med värdet "1" skulle vara de två hexbytena "00 01". De flesta vanliga processorer (x86/AMD64, ARM, RISC-V) är dock little-endian, med den minst signifikanta byten först - samma ``1`` skulle vara ``01 00``.

source: Socket libraries have calls for converting 16 and 32 bit integers - ``ntohl, htonl, ntohs, htons`` where "n" means *network* and "h" means *host*, "s" means *short* and "l" means *long*. Where network order is host order, these do nothing, but where the machine is byte-reversed, these swap the bytes around appropriately.
sv: Socket-bibliotek har anrop för att konvertera 16- och 32-bitars heltal - ``ntohl, htonl, ntohs, htons`` där "n" betyder *nätverk* och "h" betyder *värd*, "s" betyder *kort* och "l" betyder *lång*. Om nätverksordningen är värdordningen gör dessa ingenting, men om maskinen är byte-reverserad byter dessa byte på lämpligt sätt.

source: In these days of 64-bit machines, the ASCII representation of binary data is frequently smaller than the binary representation. That's because a surprising amount of the time, most integers have the value 0, or maybe 1. The string ``"0"`` would be two bytes, while a full 64-bit integer would be 8. Of course, this doesn't fit well with fixed-length messages. Decisions, decisions.
sv: I dessa dagar med 64-bitars maskiner är ASCII-representationen av binära data ofta mindre än den binära representationen. Det beror på att de flesta heltal förvånansvärt ofta har värdet 0, eller kanske 1. Strängen ``"0"`` skulle vara två byte, medan ett helt 64-bitars heltal skulle vara 8. Naturligtvis passar detta inte bra med meddelanden med fast längd. Beslut, beslut.

source: Disconnecting
sv: Kopplar bort
