Repository: yeager/python-docs-sv
Catalog: howto/urllib2.po
Languages: sv

source: When authentication is required, the server sends a header (as well as the 401 error code) requesting authentication. This specifies the authentication scheme and a 'realm'. The header looks like: ``WWW-Authenticate: SCHEME realm="REALM"``.
sv: När autentisering krävs skickar servern ett huvud (samt felkoden 401) med en begäran om autentisering. Detta anger autentiseringsschemat och en "realm". Headern ser ut som följer: ``WWW-Authenticate: SCHEME realm="REALM"``.

source: e.g.
sv: t.ex.

source: WWW-Authenticate: Basic realm="cPanel Users"
sv: WWW-Autenticate: Basic realm="cPanel-användare"

source: The client should then retry the request with the appropriate name and password for the realm included as a header in the request. This is 'basic authentication'. In order to simplify this process we can create an instance of ``HTTPBasicAuthHandler`` and an opener to use this handler.
sv: Klienten bör sedan försöka igen med det lämpliga namnet och lösenordet för sfären som ingår som en rubrik i begäran. Detta är "grundläggande autentisering". För att förenkla denna process kan vi skapa en instans av ``HTTPBasicAuthHandler`` och en öppnare för att använda denna hanterare.

source: The ``HTTPBasicAuthHandler`` uses an object called a password manager to handle the mapping of URLs and realms to passwords and usernames. If you know what the realm is (from the authentication header sent by the server), then you can use a ``HTTPPasswordMgr``. Frequently one doesn't care what the realm is. In that case, it is convenient to use ``HTTPPasswordMgrWithDefaultRealm``. This allows you to specify a default username and password for a URL. This will be supplied in the absence of you providing an alternative combination for a specific realm. We indicate this by providing ``None`` as the realm argument to the ``add_password`` method.
sv: I ``HTTPBasicAuthHandler`` används ett objekt som kallas lösenordshanterare för att hantera mappningen av URL:er och sfärer till lösenord och användarnamn. Om du vet vad sfären är (från autentiseringshuvudet som skickas av servern) kan du använda en ``HTTPPasswordMgr``. Ofta bryr man sig inte om vad sfären är. I så fall är det bekvämt att använda ``HTTPPasswordMgrWithDefaultRealm``. Detta gör att du kan ange ett standardanvändarnamn och lösenord för en URL. Detta kommer att anges om du inte tillhandahåller en alternativ kombination för en specifik sfär. Vi anger detta genom att tillhandahålla ``None`` som realm-argument till metoden ``add_password``.

source: The top-level URL is the first URL that requires authentication. URLs "deeper" than the URL you pass to .add_password() will also match. ::
sv: URL:en på högsta nivån är den första URL:en som kräver autentisering. URL:er som är "djupare" än den URL du skickar till .add_password() kommer också att matchas. ::

source: # create a password manager password_mgr = urllib.request.HTTPPasswordMgrWithDefaultRealm() # Add the username and password. # If we knew the realm, we could use it instead of None. top_level_url = "http://example.com/foo/" password_mgr.add_password(None, top_level_url, username, password) handler = urllib.request.HTTPBasicAuthHandler(password_mgr) # create "opener" (OpenerDirector instance) opener = urllib.request.build_opener(handler) # use the opener to fetch a URL opener.open(a_url) # Install the opener. # Now all calls to urllib.request.urlopen use our opener. urllib.request.install_opener(opener)
sv: # skapa en lösenordshanterare password_mgr = urllib.request.HTTPPasswordMgrWithDefaultRealm() # Lägg till användarnamn och lösenord. # Om vi visste realm skulle vi kunna använda det istället för None. top_level_url = "http://example.com/foo/" password_mgr.add_password(None, top_level_url, användarnamn, lösenord) handler = urllib.request.HTTPBasicAuthHandler(password_mgr) # skapa "opener" (OpenerDirector-instans) opener = urllib.request.build_opener(handler) # använd öppnaren för att hämta en URL opener.open(a_url) # Installera öppnaren. # Nu använder alla anrop till urllib.request.urlopen vår öppnare. urllib.request.install_opener(öppnare)

source: In the above example we only supplied our ``HTTPBasicAuthHandler`` to ``build_opener``. By default openers have the handlers for normal situations -- ``ProxyHandler`` (if a proxy setting such as an :envvar:`!http_proxy` environment variable is set), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.
sv: I exemplet ovan skickade vi bara vår ``HTTPBasicAuthHandler`` till ``build_opener``. Som standard har öppnare hanterare för normala situationer -- ``ProxyHandler`` (om en proxyinställning såsom en :envvar:`!http_proxy` är inställd), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.

source: ``top_level_url`` is in fact *either* a full URL (including the 'http:' scheme component and the hostname and optionally the port number) e.g. ``"http://example.com/"`` *or* an "authority" (i.e. the hostname, optionally including the port number) e.g. ``"example.com"`` or ``"example.com:8080"`` (the latter example includes a port number). The authority, if present, must NOT contain the "userinfo" component - for example ``"joe:password@example.com"`` is not correct.
sv: ``top_level_url`` är i själva verket *endera* en fullständig URL (inklusive "http:"-komponenten och värdnamnet och eventuellt portnumret), t.ex. ``"http://example.com/"`` *eller* en "auktoritet" (dvs. värdnamnet, eventuellt inklusive portnumret), t.ex. ``"example.com"`` eller ``"example.com:8080"`` (det senare exemplet inkluderar ett portnummer). Den eventuella auktoriteten får INTE innehålla komponenten "userinfo" - t.ex. är "joe:password@example.com" inte korrekt.

source: **urllib** will auto-detect your proxy settings and use those. This is through the ``ProxyHandler``, which is part of the normal handler chain when a proxy setting is detected. Normally that's a good thing, but there are occasions when it may not be helpful [#]_. One way to do this is to setup our own ``ProxyHandler``, with no proxies defined. This is done using similar steps to setting up a `Basic Authentication`_ handler: ::
sv: **urllib** kommer automatiskt att upptäcka dina proxyinställningar och använda dem. Detta sker genom ``ProxyHandler``, som är en del av den normala hanteringskedjan när en proxyinställning upptäcks. Normalt är det bra, men det finns tillfällen då det kanske inte är till hjälp [#]_. Ett sätt att göra detta är att ställa in vår egen ``ProxyHandler``, utan några proxyer definierade. Detta görs genom att använda liknande steg som att sätta upp en `Basic Authentication`_ handler: ::

source: >>> proxy_support = urllib.request.ProxyHandler({}) >>> opener = urllib.request.build_opener(proxy_support) >>> urllib.request.install_opener(opener)
sv: >>> proxy_support = urllib.request.ProxyHandler({}) >>> öppnare = urllib.request.build_opener(proxy_support) >>> urllib.request.install_opener(opener)

source: Currently ``urllib.request`` *does not* support fetching of ``https`` locations through a proxy. However, this can be enabled by extending urllib.request as shown in the recipe [#]_.
sv: För närvarande har ``urllib.request`` *inte* stöd för hämtning av ``https``-platser via en proxy. Detta kan dock aktiveras genom att utöka urllib.request som visas i receptet [#]_.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
sv: ``HTTP_PROXY`` ignoreras om en variabel ``REQUEST_METHOD`` är inställd; se dokumentationen för :func:`~urllib.request.getproxies`.

source: Sockets and Layers
sv: Socklar och lager

source: The Python support for fetching resources from the web is layered. urllib uses the :mod:`http.client` library, which in turn uses the socket library.
sv: Python-stödet för att hämta resurser från webben är uppdelat i flera lager. urllib använder biblioteket :mod:`http.client`, som i sin tur använder socket-biblioteket.

source: As of Python 2.3 you can specify how long a socket should wait for a response before timing out. This can be useful in applications which have to fetch web pages. By default the socket module has *no timeout* and can hang. Currently, the socket timeout is not exposed at the http.client or urllib.request levels. However, you can set the default timeout globally for all sockets using ::
sv: Från och med Python 2.3 kan du ange hur länge en socket ska vänta på ett svar innan tidsgränsen överskrids. Detta kan vara användbart i applikationer som måste hämta webbsidor. Som standard har socket-modulen *ingen timeout* och kan hänga sig. För närvarande är socket timeout inte exponerad på http.client eller urllib.request nivåerna. Du kan dock ställa in standardtimeout globalt för alla socklar med ::

source: Footnotes
sv: Fotnoter

source: This document was reviewed and revised by John Lee.
sv: Detta dokument har granskats och reviderats av John Lee.

source: Google for example.
sv: Google till exempel.

source: Browser sniffing is a very bad practice for website design - building sites using web standards is much more sensible. Unfortunately a lot of sites still send different versions to different browsers.
sv: Browser sniffing är en mycket dålig metod för webbplatsdesign - att bygga webbplatser med hjälp av webbstandarder är mycket mer förnuftigt. Tyvärr skickar många webbplatser fortfarande olika versioner till olika webbläsare.

source: The user agent for MSIE 6 is *'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*
sv: Användaragenten för MSIE 6 är *'Mozilla/4.0 (kompatibel; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*

source: For details of more HTTP request headers, see `Quick Reference to HTTP Headers`_.
sv: För mer information om HTTP-rubriker, se Snabbreferens till HTTP-rubriker.

source: In my case I have to use a proxy to access the internet at work. If you attempt to fetch *localhost* URLs through this proxy it blocks them. IE is set to use the proxy, which urllib picks up on. In order to test scripts with a localhost server, I have to prevent urllib from using the proxy.
sv: I mitt fall måste jag använda en proxy för att komma åt internet på jobbet. Om du försöker hämta *localhost* webbadresser via den här proxyn blockeras de. IE är inställt på att använda proxyn, vilket urllib känner av. För att kunna testa skript med en localhost-server måste jag hindra urllib från att använda proxyn.

source: urllib opener for SSL proxy (CONNECT method): `ASPN Cookbook Recipe <https://code.activestate.com/recipes/456195-urrlib2-opener-for-ssl-proxy-connect-method/>`_.
sv: urllib-öppnare för SSL-proxy (CONNECT-metoden): `ASPN kokboksrecept <https://code.activestate.com/recipes/456195-urrlib2-opener-for-ssl-proxy-connect-method/>`_.
