Repository: yeager/python-docs-sv
Catalog: howto/urllib2.po
Languages: sv

source: HOWTO Fetch Internet Resources Using The urllib Package
sv: Så här hämtar du internetresurser med urllib-paketet

source: Author
sv: Författare

source: Introduction
sv: Introduktion

source: You may also find useful the following article on fetching web resources with Python:
sv: Du kanske också tycker att följande artikel om att hämta webbresurser med Python är användbar:

source: A tutorial on *Basic Authentication*, with examples in Python.
sv: En handledning om *Basic Authentication*, med exempel i Python.

source: **urllib.request** is a Python module for fetching URLs (Uniform Resource Locators). It offers a very simple interface, in the form of the *urlopen* function. This is capable of fetching URLs using a variety of different protocols. It also offers a slightly more complex interface for handling common situations - like basic authentication, cookies, proxies and so on. These are provided by objects called handlers and openers.
sv: **urllib.request** är en Python-modul för att hämta URL:er (Uniform Resource Locators). Den erbjuder ett mycket enkelt gränssnitt i form av funktionen *urlopen*. Denna kan hämta webbadresser med hjälp av en mängd olika protokoll. Det finns också ett lite mer komplext gränssnitt för att hantera vanliga situationer - som grundläggande autentisering, cookies, proxies och så vidare. Dessa tillhandahålls av objekt som kallas handlers och openers.

source: urllib.request supports fetching URLs for many "URL schemes" (identified by the string before the ``":"`` in URL - for example ``"ftp"`` is the URL scheme of ``"ftp://python.org/"``) using their associated network protocols (e.g. FTP, HTTP). This tutorial focuses on the most common case, HTTP.
sv: urllib.request stöder hämtning av webbadresser för många "URL-scheman" (identifieras av strängen före ``":"`` i URL - till exempel ``"ftp"`` är URL-schemat för ``"ftp://python.org/"``) med hjälp av deras associerade nätverksprotokoll (t.ex. FTP, HTTP). Denna handledning fokuserar på det vanligaste fallet, HTTP.

source: For straightforward situations *urlopen* is very easy to use. But as soon as you encounter errors or non-trivial cases when opening HTTP URLs, you will need some understanding of the HyperText Transfer Protocol. The most comprehensive and authoritative reference to HTTP is :rfc:`2616`. This is a technical document and not intended to be easy to read. This HOWTO aims to illustrate using *urllib*, with enough detail about HTTP to help you through. It is not intended to replace the :mod:`urllib.request` docs, but is supplementary to them.
sv: För okomplicerade situationer är *urlopen* mycket lätt att använda. Men så snart du stöter på fel eller icke-triviala fall när du öppnar HTTP-URL:er behöver du en viss förståelse för HyperText Transfer Protocol. Den mest omfattande och auktoritativa referensen till HTTP är :rfc:`2616`. Detta är ett tekniskt dokument som inte är avsett att vara lättläst. Denna HOWTO syftar till att illustrera användningen av *urllib*, med tillräckligt med detaljer om HTTP för att hjälpa dig igenom. Den är inte avsedd att ersätta :mod:`urllib.request`-dokumenten, utan är ett komplement till dem.

source: Fetching URLs
sv: Hämta webbadresser

source: The simplest way to use urllib.request is as follows::
sv: Det enklaste sättet att använda urllib.request är enligt följande::

source: If you wish to retrieve a resource via URL and store it in a temporary location, you can do so via the :func:`shutil.copyfileobj` and :func:`tempfile.NamedTemporaryFile` functions::
sv: Om du vill hämta en resurs via URL och lagra den på en tillfällig plats kan du göra det med hjälp av funktionerna :func:`shutil.copyfileobj` och :func:`tempfile.NamedTemporaryFile`::

source: Many uses of urllib will be that simple (note that instead of an 'http:' URL we could have used a URL starting with 'ftp:', 'file:', etc.). However, it's the purpose of this tutorial to explain the more complicated cases, concentrating on HTTP.
sv: Många användningar av urllib kommer att vara så enkla (notera att vi i stället för en "http:"-URL kunde ha använt en URL som börjar med "ftp:", "file:" etc.). Syftet med denna handledning är dock att förklara de mer komplicerade fallen, med fokus på HTTP.

source: HTTP is based on requests and responses - the client makes requests and servers send responses. urllib.request mirrors this with a ``Request`` object which represents the HTTP request you are making. In its simplest form you create a Request object that specifies the URL you want to fetch. Calling ``urlopen`` with this Request object returns a response object for the URL requested. This response is a file-like object, which means you can for example call ``.read()`` on the response::
sv: HTTP är baserat på förfrågningar och svar - klienten gör förfrågningar och servrar skickar svar. urllib.request speglar detta med ett ``Request``-objekt som representerar den HTTP-förfrågan du gör. I sin enklaste form skapar du ett Request-objekt som specificerar den URL du vill hämta. Om du anropar ``urlopen`` med detta Request-objekt returneras ett svarsobjekt för den begärda URL:en. Detta svar är ett filliknande objekt, vilket innebär att du till exempel kan anropa ``.read()`` på svaret::

source: Note that urllib.request makes use of the same Request interface to handle all URL schemes. For example, you can make an FTP request like so::
sv: Observera att urllib.request använder samma Request-gränssnitt för att hantera alla URL-scheman. Du kan till exempel göra en FTP-begäran så här::

source: In the case of HTTP, there are two extra things that Request objects allow you to do: First, you can pass data to be sent to the server. Second, you can pass extra information ("metadata") *about* the data or about the request itself, to the server - this information is sent as HTTP "headers". Let's look at each of these in turn.
sv: När det gäller HTTP finns det två extra saker som Request-objekten gör det möjligt för dig att göra: För det första kan du skicka data som ska skickas till servern. För det andra kan du skicka extra information ("metadata") *om* data eller om själva begäran till servern - denna information skickas som HTTP-"headers". Låt oss titta på var och en av dessa i tur och ordning.

source: Sometimes you want to send data to a URL (often the URL will refer to a CGI (Common Gateway Interface) script or other web application). With HTTP, this is often done using what's known as a **POST** request. This is often what your browser does when you submit a HTML form that you filled in on the web. Not all POSTs have to come from forms: you can use a POST to transmit arbitrary data to your own application. In the common case of HTML forms, the data needs to be encoded in a standard way, and then passed to the Request object as the ``data`` argument. The encoding is done using a function from the :mod:`urllib.parse` library. ::
sv: Ibland vill man skicka data till en URL (ofta hänvisar URL:en till ett CGI-skript (Common Gateway Interface) eller en annan webbapplikation). Med HTTP görs detta ofta med hjälp av en så kallad **POST**-begäran. Det är ofta vad din webbläsare gör när du skickar in ett HTML-formulär som du fyllt i på webben. Alla POSTs behöver inte komma från formulär: du kan använda en POST för att överföra godtyckliga data till din egen applikation. I det vanliga fallet med HTML-formulär måste data kodas på ett standardiserat sätt och sedan skickas till Request-objektet som argumentet ``data``. Kodningen görs med hjälp av en funktion från :mod:`urllib.parse`-biblioteket. ::

source: Note that other encodings are sometimes required (e.g. for file upload from HTML forms - see `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ for more details).
sv: Observera att andra kodningar ibland krävs (t.ex. för filuppladdning från HTML-formulär - se `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ för mer information).

source: If you do not pass the ``data`` argument, urllib uses a **GET** request. One way in which GET and POST requests differ is that POST requests often have "side-effects": they change the state of the system in some way (for example by placing an order with the website for a hundredweight of tinned spam to be delivered to your door). Though the HTTP standard makes it clear that POSTs are intended to *always* cause side-effects, and GET requests *never* to cause side-effects, nothing prevents a GET request from having side-effects, nor a POST requests from having no side-effects. Data can also be passed in an HTTP GET request by encoding it in the URL itself.
sv: Om du inte skickar med argumentet ``data`` använder urllib en **GET**-begäran. Ett sätt som GET- och POST-begäranden skiljer sig åt är att POST-begäranden ofta har "bieffekter": de ändrar systemets tillstånd på något sätt (till exempel genom att göra en beställning på webbplatsen för att få hundra kilo konserverad skräppost levererad till din dörr). Även om HTTP-standarden klargör att POST-förfrågningar *alltid* ska orsaka bieffekter och GET-förfrågningar *aldrig* ska orsaka bieffekter, finns det inget som hindrar en GET-förfrågan från att ha bieffekter eller en POST-förfrågan från att inte ha några bieffekter. Data kan också skickas i en HTTP GET-begäran genom att koda den i själva URL:en.

source: This is done as follows::
sv: Detta görs på följande sätt::

source: Notice that the full URL is created by adding a ``?`` to the URL, followed by the encoded values.
sv: Observera att den fullständiga URL:en skapas genom att lägga till en ``?`` till URL:en, följt av de kodade värdena.

source: Headers
sv: Sidhuvud

source: We'll discuss here one particular HTTP header, to illustrate how to add headers to your HTTP request.
sv: Vi kommer här att diskutera en särskild HTTP-header för att illustrera hur man lägger till headers i en HTTP-begäran.

source: Some websites [#]_ dislike being browsed by programs, or send different versions to different browsers [#]_. By default urllib identifies itself as ``Python-urllib/x.y`` (where ``x`` and ``y`` are the major and minor version numbers of the Python release, e.g. ``Python-urllib/2.5``), which may confuse the site, or just plain not work. The way a browser identifies itself is through the ``User-Agent`` header [#]_. When you create a Request object you can pass a dictionary of headers in. The following example makes the same request as above, but identifies itself as a version of Internet Explorer [#]_. ::
sv: Vissa webbplatser [#]_ ogillar att surfas av program, eller skickar olika versioner till olika webbläsare [#]_. Som standard identifierar urllib sig själv som ``Python-urllib/x.y`` (där ``x`` och ``y`` är Python-versionens större och mindre versionsnummer, t.ex. ``Python-urllib/2.5``), vilket kan förvirra webbplatsen eller helt enkelt inte fungera. Det sätt på vilket en webbläsare identifierar sig är genom ``User-Agent``-headern [#]_. När du skapar ett Request-objekt kan du skicka in en ordbok med rubriker. Följande exempel gör samma förfrågan som ovan, men identifierar sig själv som en version av Internet Explorer [#]_. ::

source: The response also has two useful methods. See the section on `info and geturl`_ which comes after we have a look at what happens when things go wrong.
sv: Svaret har också två användbara metoder. Se avsnittet om `info och geturl`_ som kommer efter att vi har tittat på vad som händer när saker och ting går fel.

source: Handling Exceptions
sv: Hantering av undantag

source: *urlopen* raises :exc:`~urllib.error.URLError` when it cannot handle a response (though as usual with Python APIs, built-in exceptions such as :exc:`ValueError`, :exc:`TypeError` etc. may also be raised).
sv: *urlopen* ger upphov till :exc:`~urllib.error.URLError` när det inte kan hantera ett svar (men som vanligt med Python API:er kan inbyggda undantag som :exc:`ValueError`, :exc:`TypeError` etc. också ges upphov till).

source: :exc:`~urllib.error.HTTPError` is the subclass of :exc:`~urllib.error.URLError` raised in the specific case of HTTP URLs.
sv: :exc:`~urllib.error.HTTPError` är underklassen till :exc:`~urllib.error.URLError` som uppstår i det specifika fallet med HTTP-URL:er.

source: The exception classes are exported from the :mod:`urllib.error` module.
sv: Undantagsklasserna exporteras från modulen :mod:`urllib.error`.

source: Often, URLError is raised because there is no network connection (no route to the specified server), or the specified server doesn't exist. In this case, the exception raised will have a 'reason' attribute, which is a tuple containing an error code and a text error message.
sv: Ofta uppstår URLError på grund av att det inte finns någon nätverksanslutning (ingen väg till den angivna servern) eller att den angivna servern inte existerar. I detta fall kommer det undantag som uppstår att ha ett "reason"-attribut, som är en tupel som innehåller en felkod och ett textfelmeddelande.

source: e.g. ::
sv: t.ex. ::

source: Every HTTP response from the server contains a numeric "status code". Sometimes the status code indicates that the server is unable to fulfil the request. The default handlers will handle some of these responses for you (for example, if the response is a "redirection" that requests the client fetch the document from a different URL, urllib will handle that for you). For those it can't handle, urlopen will raise an :exc:`~urllib.error.HTTPError`. Typical errors include '404' (page not found), '403' (request forbidden), and '401' (authentication required).
sv: Varje HTTP-svar från servern innehåller en numerisk "statuskod". Ibland indikerar statuskoden att servern inte kan uppfylla begäran. Standardhanterarna kommer att hantera vissa av dessa svar åt dig (om svaret till exempel är en "omdirigering" som begär att klienten hämtar dokumentet från en annan URL, kommer urllib att hantera det åt dig). För de som inte kan hanteras kommer urlopen att skapa ett :exc:`~urllib.error.HTTPError`. Typiska fel är '404' (sidan hittades inte), '403' (begäran förbjuden) och '401' (autentisering krävs).

source: See section 10 of :rfc:`2616` for a reference on all the HTTP error codes.
sv: Se avsnitt 10 i :rfc:`2616` för en referens till alla HTTP-felkoder.

source: The :exc:`~urllib.error.HTTPError` instance raised will have an integer 'code' attribute, which corresponds to the error sent by the server.
sv: Den :exc:`~urllib.error.HTTPError`-instans som skapas kommer att ha ett heltalsattribut 'code', som motsvarar det fel som skickas av servern.

source: Error Codes
sv: Felkoder

source: Because the default handlers handle redirects (codes in the 300 range), and codes in the 100--299 range indicate success, you will usually only see error codes in the 400--599 range.
sv: Eftersom standardhanterarna hanterar omdirigeringar (koder i intervallet 300), och koder i intervallet 100-299 indikerar framgång, kommer du vanligtvis bara att se felkoder i intervallet 400-599.

source: :attr:`http.server.BaseHTTPRequestHandler.responses` is a useful dictionary of response codes that shows all the response codes used by :rfc:`2616`. An excerpt from the dictionary is shown below ::
sv: :attr:`http.server.BaseHTTPRequestHandler.responses` är en användbar ordbok över svarskoder som visar alla de svarskoder som används av :rfc:`2616`. Ett utdrag från ordlistan visas nedan ::

source: responses = { ... <HTTPStatus.OK: 200>: ('OK', 'Request fulfilled, document follows'), ... <HTTPStatus.FORBIDDEN: 403>: ('Forbidden', 'Request forbidden -- authorization will ' 'not help'), <HTTPStatus.NOT_FOUND: 404>: ('Not Found', 'Nothing matches the given URI'), ... <HTTPStatus.IM_A_TEAPOT: 418>: ("I'm a Teapot", 'Server refuses to brew coffee because ' 'it is a teapot'), ... <HTTPStatus.SERVICE_UNAVAILABLE: 503>: ('Service Unavailable', 'The server cannot process the ' 'request due to a high load'), ... }
sv: svar = { ... <HTTPStatus.OK: 200>: ('OK', 'Begäran uppfylld, dokumentet följer'), ... <HTTPStatus.FORBIDDEN: 403>: ('Förbjuden', 'Begäran förbjuden -- auktorisering kommer ' 'inte hjälpa'), <HTTPStatus.NOT_FOUND: 404>: ('Hittades inte', "Inget matchar den angivna URI:n"), ... <HTTPStatus.IM_A_TEAPOT: 418>: ("Jag är en tekanna", "Servern vägrar att brygga kaffe eftersom ' 'den är en tekanna'), ... <HTTPStatus.SERVICE_UNAVAILABLE: 503>: ('Tjänsten är inte tillgänglig', 'Servern kan inte behandla ' 'begäran på grund av hög belastning'), ... }

source: When an error is raised the server responds by returning an HTTP error code *and* an error page. You can use the :exc:`~urllib.error.HTTPError` instance as a response on the page returned. This means that as well as the code attribute, it also has read, geturl, and info, methods as returned by the ``urllib.response`` module::
sv: När ett fel uppstår svarar servern genom att returnera en HTTP-felkod *och* en felsida. Du kan använda :exc:`~urllib.error.HTTPError`-instansen som ett svar på den returnerade sidan. Detta innebär att förutom kodattributet har den också metoderna read, geturl och info, som returneras av modulen ``urllib.response``::

source: Wrapping it Up
sv: Avslutning

source: So if you want to be prepared for :exc:`~urllib.error.HTTPError` *or* :exc:`~urllib.error.URLError` there are two basic approaches. I prefer the second approach.
sv: Så om du vill vara beredd på :exc:`~urllib.error.HTTPError` *eller* :exc:`~urllib.error.URLError` finns det två grundläggande tillvägagångssätt. Jag föredrar det andra tillvägagångssättet.

source: Number 1
sv: Nummer 1

source: The ``except HTTPError`` *must* come first, otherwise ``except URLError`` will *also* catch an :exc:`~urllib.error.HTTPError`.
sv: ``except HTTPError`` *måste* komma först, annars kommer ``except URLError`` *också* att fånga ett :exc:`~urllib.error.HTTPError`.

source: Number 2
sv: Nummer 2

source: info and geturl
sv: info och geturl

source: The response returned by urlopen (or the :exc:`~urllib.error.HTTPError` instance) has two useful methods :meth:`!info` and :meth:`!geturl` and is defined in the module :mod:`urllib.response`.
sv: Svaret som returneras av urlopen (eller instansen :exc:`~urllib.error.HTTPError`) har två användbara metoder :meth:`!info` och :meth:`!geturl` och definieras i modulen :mod:`urllib.response`.

source: **geturl** - this returns the real URL of the page fetched. This is useful because ``urlopen`` (or the opener object used) may have followed a redirect. The URL of the page fetched may not be the same as the URL requested.
sv: **geturl** - returnerar den riktiga URL:en för den hämtade sidan. Detta är användbart eftersom ``urlopen`` (eller det öppningsobjekt som används) kan ha följt en omdirigering. URL:en för den hämtade sidan kanske inte är densamma som den begärda URL:en.

source: **info** - this returns a dictionary-like object that describes the page fetched, particularly the headers sent by the server. It is currently an :class:`http.client.HTTPMessage` instance.
sv: **info** - detta returnerar ett ordboksliknande objekt som beskriver den hämtade sidan, särskilt de rubriker som skickats av servern. Det är för närvarande en instans av :class:`http.client.HTTPMessage`.

source: Typical headers include 'Content-length', 'Content-type', and so on. See the `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ for a useful listing of HTTP headers with brief explanations of their meaning and use.
sv: Typiska rubriker är "Content-length", "Content-type" och så vidare. I `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ finns en användbar lista över HTTP-rubriker med korta förklaringar av deras betydelse och användning.

source: Openers and Handlers
sv: Öppnare och hanterare

source: When you fetch a URL you use an opener (an instance of the perhaps confusingly named :class:`urllib.request.OpenerDirector`). Normally we have been using the default opener - via ``urlopen`` - but you can create custom openers. Openers use handlers. All the "heavy lifting" is done by the handlers. Each handler knows how to open URLs for a particular URL scheme (http, ftp, etc.), or how to handle an aspect of URL opening, for example HTTP redirections or HTTP cookies.
sv: När du hämtar en URL använder du en öppnare (en instans av den kanske förvirrande benämnda :class:`urllib.request.OpenerDirector`). Normalt har vi använt standardöppnaren - via ``urlopen`` - men du kan skapa egna öppnare. Öppnare använder hanterare. Alla "tunga lyft" görs av hanterarna. Varje hanterare vet hur man öppnar URL:er för ett visst URL-schema (http, ftp, etc.), eller hur man hanterar en aspekt av URL-öppning, till exempel HTTP-omdirigeringar eller HTTP-cookies.

source: You will want to create openers if you want to fetch URLs with specific handlers installed, for example to get an opener that handles cookies, or to get an opener that does not handle redirections.
sv: Du behöver skapa öppnare om du vill hämta webbadresser med specifika hanterare installerade, t.ex. för att få en öppnare som hanterar cookies eller för att få en öppnare som inte hanterar omdirigeringar.

source: To create an opener, instantiate an ``OpenerDirector``, and then call ``.add_handler(some_handler_instance)`` repeatedly.
sv: För att skapa en öppnare instansierar du en ``OpenerDirector`` och anropar sedan ``.add_handler(some_handler_instance)`` upprepade gånger.

source: Alternatively, you can use ``build_opener``, which is a convenience function for creating opener objects with a single function call. ``build_opener`` adds several handlers by default, but provides a quick way to add more and/or override the default handlers.
sv: Alternativt kan du använda ``build_opener``, som är en bekvämlighetsfunktion för att skapa öppningsobjekt med ett enda funktionsanrop. ``build_opener`` lägger till flera hanterare som standard, men ger ett snabbt sätt att lägga till fler och/eller åsidosätta standardhanterarna.

source: Other sorts of handlers you might want to can handle proxies, authentication, and other common but slightly specialised situations.
sv: Andra typer av hanterare som du kanske vill ha kan hantera proxyservrar, autentisering och andra vanliga men lite specialiserade situationer.

source: ``install_opener`` can be used to make an ``opener`` object the (global) default opener. This means that calls to ``urlopen`` will use the opener you have installed.
sv: ``install_opener`` kan användas för att göra ett ``opener``-objekt till (global) standardöppnare. Detta innebär att anrop till ``urlopen`` kommer att använda den öppnare som du har installerat.

source: Opener objects have an ``open`` method, which can be called directly to fetch urls in the same way as the ``urlopen`` function: there's no need to call ``install_opener``, except as a convenience.
sv: Opener-objekt har en ``open``-metod, som kan anropas direkt för att hämta webbadresser på samma sätt som ``urlopen``-funktionen: det finns inget behov av att anropa ``install_opener``, förutom som en bekvämlighet.

source: Basic Authentication
sv: Grundläggande autentisering

source: To illustrate creating and installing a handler we will use the ``HTTPBasicAuthHandler``. For a more detailed discussion of this subject -- including an explanation of how Basic Authentication works - see the `Basic Authentication Tutorial <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.
sv: För att illustrera hur man skapar och installerar en hanterare kommer vi att använda ``HTTPBasicAuthHandler``. För en mer detaljerad diskussion om detta ämne - inklusive en förklaring av hur Basic Authentication fungerar - se `Basic Authentication Tutorial <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.
