Repository: yeager/python-docs-sv
Catalog: c-api/arg.po
Languages: sv

source: Convert a Python integer to a C :c:expr:`unsigned int`, without overflow checking.
sv: Konvertera ett heltal från Python till ett C :c:expr:`unsigned int`, utan kontroll av överflöd.

source: Convert a Python integer to a C :c:expr:`long int`.
sv: Konvertera ett heltal i Python till ett C :c:expr:`long int`.

source: Convert a Python integer to a C :c:expr:`unsigned long` without overflow checking.
sv: Konvertera ett heltal från Python till ett C :c:expr:`unsigned long` utan överflödeskontroll.

source: Use :meth:`~object.__index__` if available.
sv: Använd :meth:`~object.__index__` om det finns tillgängligt.

source: ``L`` (:class:`int`) [long long]
sv: ``L`` (:class:`int`) [lång lång]

source: Convert a Python integer to a C :c:expr:`long long`.
sv: Konvertera ett heltal i Python till ett C :c:expr:`long long`.

source: ``K`` (:class:`int`) [unsigned long long]
sv: ``K`` (:class:`int`) [osignerad lång lång]

source: Convert a Python integer to a C :c:expr:`unsigned long long` without overflow checking.
sv: Konvertera ett heltal från Python till ett C :c:expr:`unsigned long long` utan överflödeskontroll.

source: Convert a Python integer to a C :c:type:`Py_ssize_t`.
sv: Konvertera ett Python-heltal till en C :c:type:`Py_ssize_t`.

source: ``c`` (:class:`bytes` or :class:`bytearray` of length 1) [char]
sv: ``c`` (:class:`bytes` eller :class:`bytearray` av längd 1) [char]

source: Convert a Python byte, represented as a :class:`bytes` or :class:`bytearray` object of length 1, to a C :c:expr:`char`.
sv: Konvertera en Python-byte, representerad som ett :class:`bytes` eller :class:`bytearray`-objekt med längden 1, till en C :c:expr:`char`.

source: Allow :class:`bytearray` objects.
sv: Tillåt :class:`bytearray`-objekt.

source: ``C`` (:class:`str` of length 1) [int]
sv: ``C`` (:class:`str` av längd 1) [int]

source: Convert a Python character, represented as a :class:`str` object of length 1, to a C :c:expr:`int`.
sv: Konvertera ett Python-tecken, representerat som ett :class:`str`-objekt med längden 1, till ett C :c:expr:`int`.

source: Convert a Python floating-point number to a C :c:expr:`float`.
sv: Konverterar ett Python flyttal till ett C :c:expr:`float`.

source: ``d`` (:class:`float`) [double]
sv: ``d`` (:class:`float`) [dubbel]

source: Convert a Python floating-point number to a C :c:expr:`double`.
sv: Konverterar ett Python flyttal till ett C :c:expr:`double`.

source: Convert a Python complex number to a C :c:type:`Py_complex` structure.
sv: Konverterar ett Python-komplext tal till en C :c:type:`Py_complex`-struktur.

source: Other objects
sv: Övriga objekt

source: ``O`` (object) [PyObject \*]
sv: ``O`` (objekt) [PyObject \*]

source: Store a Python object (without any conversion) in a C object pointer. The C program thus receives the actual object that was passed. A new :term:`strong reference` to the object is not created (i.e. its reference count is not increased). The pointer stored is not ``NULL``.
sv: Lagra ett Python-objekt (utan någon konvertering) i en C-objektpekare. C-programmet får därmed det faktiska objektet som skickades. En ny :term:`strong referens` till objektet skapas inte (d.v.s. dess referensantal ökas inte). Den lagrade pekaren är inte ``NULL``.

source: ``O!`` (object) [*typeobject*, PyObject \*]
sv: ``O!`` (objekt) [*typeobject*, PyObject \*]

source: Store a Python object in a C object pointer. This is similar to ``O``, but takes two C arguments: the first is the address of a Python type object, the second is the address of the C variable (of type :c:expr:`PyObject*`) into which the object pointer is stored. If the Python object does not have the required type, :exc:`TypeError` is raised.
sv: Lagra ett Python-objekt i en C-objektpekare. Detta liknar ``O``, men tar två C-argument: det första är adressen till ett objekt av Python-typ, det andra är adressen till C-variabeln (av typen :c:expr:`PyObject*`) i vilken objektpekaren lagras. Om Python-objektet inte har den typ som krävs, uppstår :exc:`TypeError`.

source: ``O&`` (object) [*converter*, *address*]
sv: ``O&`` (objekt) [*konverterare*, *adress*]

source: Convert a Python object to a C variable through a *converter* function. This takes two arguments: the first is a function, the second is the address of a C variable (of arbitrary type), converted to :c:expr:`void *`. The *converter* function in turn is called as follows::
sv: Konvertera ett Python-objekt till en C-variabel genom en *konverter*-funktion. Denna tar två argument: det första är en funktion, det andra är adressen till en C-variabel (av godtycklig typ), konverterad till :c:expr:`void *`. Funktionen *konverterare* anropas i sin tur på följande sätt::

source: status = converter(object, address);
sv: status = omvandlare(objekt, adress);

source: where *object* is the Python object to be converted and *address* is the :c:expr:`void*` argument that was passed to the ``PyArg_Parse*`` function. The returned *status* should be ``1`` for a successful conversion and ``0`` if the conversion has failed. When the conversion fails, the *converter* function should raise an exception and leave the content of *address* unmodified.
sv: där *object* är Python-objektet som ska konverteras och *address* är :c:expr:`void*`-argumentet som skickades till funktionen ``PyArg_Parse*``. Den returnerade *status* bör vara ``1`` för en lyckad konvertering och ``0`` om konverteringen har misslyckats. När konverteringen misslyckas bör funktionen *konverterare* ge upphov till ett undantag och lämna innehållet i *adress* oförändrat.

source: If the *converter* returns :c:macro:`!Py_CLEANUP_SUPPORTED`, it may get called a second time if the argument parsing eventually fails, giving the converter a chance to release any memory that it had already allocated. In this second call, the *object* parameter will be ``NULL``; *address* will have the same value as in the original call.
sv: Om *omvandlaren* returnerar :c:macro:`!Py_CLEANUP_SUPPORTED`, kan den komma att anropas en andra gång om argumentanalysen misslyckas, vilket ger omvandlaren en chans att frigöra minne som den redan har allokerat. I detta andra anrop kommer parametern *object* att vara ``NULL``; *address* kommer att ha samma värde som i det ursprungliga anropet.

source: Examples of converters: :c:func:`PyUnicode_FSConverter` and :c:func:`PyUnicode_FSDecoder`.
sv: Exempel på omvandlare: :c:func:`PyUnicode_FSConverter` och :c:func:`PyUnicode_FSDecoder`.

source: :c:macro:`!Py_CLEANUP_SUPPORTED` was added.
sv: :c:macro:`!Py_CLEANUP_SUPPORTED` lades till.

source: Tests the value passed in for truth (a boolean **p**\ redicate) and converts the result to its equivalent C true/false integer value. Sets the int to ``1`` if the expression was true and ``0`` if it was false. This accepts any valid Python value. See :ref:`truth` for more information about how Python tests values for truth.
sv: Testar det värde som skickas in för sanning (en boolean **p**\ redicate) och konverterar resultatet till dess motsvarande C true/false heltalsvärde. Sätter int till ``1`` om uttrycket var sant och ``0`` om det var falskt. Detta accepterar alla giltiga Python-värden. Se :ref:`truth` för mer information om hur Python testar värden för sanning.

source: ``(items)`` (sequence) [*matching-items*]
sv: ``(items)`` (sekvens) [*matchande-items*]

source: The object must be a Python sequence (except :class:`str`, :class:`bytes` or :class:`bytearray`) whose length is the number of format units in *items*. The C arguments must correspond to the individual format units in *items*. Format units for sequences may be nested.
sv: Objektet måste vara en Python-sekvens (utom :class:`str`, :class:`bytes` eller :class:`bytearray`) vars längd är antalet formatenheter i *items*. C-argumenten måste motsvara de enskilda formatenheterna i *items*. Formatenheter för sekvenser kan vara nästlade.

source: If *items* contains format units which store a :ref:`borrowed buffer <c-arg-borrowed-buffer>` (``s``, ``s#``, ``z``, ``z#``, ``y``, or ``y#``) or a :term:`borrowed reference` (``S``, ``Y``, ``U``, ``O``, or ``O!``), the object must be a Python tuple. The *converter* for the ``O&`` format unit in *items* must not store a borrowed buffer or a borrowed reference.
sv: Om *artiklar* innehåller formatenheter som lagrar en :ref:``lånad buffert <c-arg-borrowed-buffer>`` (``s``, ``s#``, ``z``, ``z#``, ``y``, eller ``y#``) eller en :term:`lånad referens` (``S``, ``Y``, ``U``, ``O``, eller ``O!``), måste objektet vara en Python-tupel. *omvandlaren* för formatenheten ``O&amp;`` i *objekt* får inte lagra en lånad buffert eller en lånad referens.

source: :class:`str` and :class:`bytearray` objects no longer accepted as a sequence.
sv: objekten :class:`str` och :class:`bytearray` accepteras inte längre som en sekvens.

source: Non-tuple sequences are deprecated if *items* contains format units which store a borrowed buffer or a borrowed reference.
sv: Sekvenser som inte är tupler är inte längre aktuella om *items* innehåller formatenheter som lagrar en lånad buffert eller en lånad referens.

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
sv: Några andra tecken har en betydelse i en formatsträng. Dessa får inte förekomma inom klamrade parenteser. De är följande:

source: Indicates that the remaining arguments in the Python argument list are optional. The C variables corresponding to optional arguments should be initialized to their default value --- when an optional argument is not specified, :c:func:`PyArg_ParseTuple` does not touch the contents of the corresponding C variable(s).
sv: Anger att de återstående argumenten i Pythons argumentlista är valfria. C-variablerna som motsvarar valfria argument bör initialiseras till sitt standardvärde --- när ett valfritt argument inte anges rör :c:func:`PyArg_ParseTuple` inte innehållet i motsvarande C-variabel(er).

source: :c:func:`PyArg_ParseTupleAndKeywords` only: Indicates that the remaining arguments in the Python argument list are keyword-only. Currently, all keyword-only arguments must also be optional arguments, so ``|`` must always be specified before ``$`` in the format string.
sv: :c:func:`PyArg_ParseTupleAndKeywords` only: Anger att de återstående argumenten i Pythons argumentlista endast är nyckelord. För närvarande måste alla argument som endast innehåller nyckelord också vara valfria argument, så ``|`` måste alltid anges före ``$`` i formatsträngen.

source: The list of format units ends here; the string after the colon is used as the function name in error messages (the "associated value" of the exception that :c:func:`PyArg_ParseTuple` raises).
sv: Listan över formatenheter slutar här; strängen efter kolon används som funktionsnamn i felmeddelanden (det "associerade värdet" för det undantag som :c:func:`PyArg_ParseTuple` ger upphov till).

source: The list of format units ends here; the string after the semicolon is used as the error message *instead* of the default error message. ``:`` and ``;`` mutually exclude each other.
sv: Listan med formatenheter slutar här; strängen efter semikolon används som felmeddelande *i stället för* standardfelmeddelandet. ``:`` och ``;`` utesluter varandra ömsesidigt.

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not release them (i.e. do not decrement their reference count)!
sv: Observera att alla Python-objektreferenser som tillhandahålls till den anropande är *lånade* referenser; släpp dem inte (dvs. minska inte deras referensantal)

source: Additional arguments passed to these functions must be addresses of variables whose type is determined by the format string; these are used to store values from the input tuple. There are a few cases, as described in the list of format units above, where these parameters are used as input values; they should match what is specified for the corresponding format unit in that case.
sv: Ytterligare argument som skickas till dessa funktioner måste vara adresser till variabler vars typ bestäms av formatsträngen; dessa används för att lagra värden från input-tupeln. Det finns några fall, som beskrivs i listan över formatenheter ovan, där dessa parametrar används som indatavärden; de ska då matcha vad som anges för motsvarande formatenhet.

source: For the conversion to succeed, the *arg* object must match the format and the format must be exhausted. On success, the ``PyArg_Parse*`` functions return true, otherwise they return false and raise an appropriate exception. When the ``PyArg_Parse*`` functions fail due to conversion failure in one of the format units, the variables at the addresses corresponding to that and the following format units are left untouched.
sv: För att konverteringen ska lyckas måste *arg*-objektet matcha formatet och formatet måste vara uttömt. Vid framgång returnerar funktionerna ``PyArg_Parse*`` true, annars returnerar de false och ger upphov till ett lämpligt undantag. När funktionerna ``PyArg_Parse*`` misslyckas på grund av att konverteringen misslyckas i en av formatenheterna, lämnas variablerna på de adresser som motsvarar den och de följande formatenheterna orörda.

source: API Functions
sv: API-funktioner

source: Parse the parameters of a function that takes only positional parameters into local variables. Returns true on success; on failure, it returns false and raises the appropriate exception.
sv: Analyserar parametrarna för en funktion som endast tar in positionella parametrar i lokala variabler. Returnerar true om funktionen lyckas; om den misslyckas returneras false och ett lämpligt undantag tas upp.

source: Identical to :c:func:`PyArg_ParseTuple`, except that it accepts a va_list rather than a variable number of arguments.
sv: Identisk med :c:func:`PyArg_ParseTuple`, förutom att den accepterar en va_list i stället för ett variabelt antal argument.

source: Parse the parameters of a function that takes both positional and keyword parameters into local variables. The *keywords* argument is a ``NULL``-terminated array of keyword parameter names specified as null-terminated ASCII or UTF-8 encoded C strings. Empty names denote :ref:`positional-only parameters <positional-only_parameter>`. Returns true on success; on failure, it returns false and raises the appropriate exception.
sv: Analyserar parametrarna för en funktion som tar in både positions- och nyckelordsparametrar i lokala variabler. Argumentet *keywords* är en ``NULL``-avslutad array av nyckelordsparameternamn som anges som nollavslutade ASCII- eller UTF-8-kodade C-strängar. Tomma namn betecknar :ref:``endast positionsparametrar <endast positionsparameter>`. Returnerar true vid framgång; vid misslyckande returnerar den false och ger upphov till lämpligt undantag.

source: The *keywords* parameter declaration is :c:expr:`char * const *` in C and :c:expr:`const char * const *` in C++. This can be overridden with the :c:macro:`PY_CXX_CONST` macro.
sv: Parameterdeklarationen *keywords* är :c:expr:`char * const *` i C och :c:expr:`const char * const *` i C++. Detta kan åsidosättas med makrot :c:macro:`PY_CXX_CONST`.

source: Added support for :ref:`positional-only parameters <positional-only_parameter>`.
sv: Lagt till stöd för :ref:``positionella parametrar <positionella_parameter>`.

source: The *keywords* parameter has now type :c:expr:`char * const *` in C and :c:expr:`const char * const *` in C++, instead of :c:expr:`char **`. Added support for non-ASCII keyword parameter names.
sv: Parametern *keywords* har nu typen :c:expr:`char * const *` i C och :c:expr:`const char * const *` i C++, istället för :c:expr:`char **`. Stöd för parameternamn med nyckelord som inte är ASCII har lagts till.

source: Identical to :c:func:`PyArg_ParseTupleAndKeywords`, except that it accepts a va_list rather than a variable number of arguments.
sv: Identisk med :c:func:`PyArg_ParseTupleAndKeywords`, förutom att den accepterar en va_list i stället för ett variabelt antal argument.

source: Ensure that the keys in the keywords argument dictionary are strings. This is only needed if :c:func:`PyArg_ParseTupleAndKeywords` is not used, since the latter already does this check.
sv: Säkerställer att nycklarna i argumentordlistan för nyckelord är strängar. Detta behövs bara om :c:func:`PyArg_ParseTupleAndKeywords` inte används, eftersom den senare redan gör denna kontroll.

source: Parse the parameter of a function that takes a single positional parameter into a local variable. Returns true on success; on failure, it returns false and raises the appropriate exception.
sv: Analyserar parametern för en funktion som tar en enda positionell parameter till en lokal variabel. Returnerar true om funktionen lyckas; om den misslyckas returneras false och ett lämpligt undantag tas upp.

source: Example::
sv: Exempel::

source: // Function using METH_O calling convention static PyObject* my_function(PyObject *module, PyObject *arg) { int value; if (!PyArg_Parse(arg, "i:my_function", &value)) { return NULL; } // ... use value ... }
sv: // Funktion som använder METH_O anropskonvention statiskt PyObject* my_function(PyObject *modul, PyObject *argument) { int värde; if (!PyArg_Parse(arg, "i:my_function", &value)) { returneras NULL; } // ... använd värde ... }

source: A simpler form of parameter retrieval which does not use a format string to specify the types of the arguments. Functions which use this method to retrieve their parameters should be declared as :c:macro:`METH_VARARGS` in function or method tables. The tuple containing the actual parameters should be passed as *args*; it must actually be a tuple. The length of the tuple must be at least *min* and no more than *max*; *min* and *max* may be equal. Additional arguments must be passed to the function, each of which should be a pointer to a :c:expr:`PyObject*` variable; these will be filled in with the values from *args*; they will contain :term:`borrowed references <borrowed reference>`. The variables which correspond to optional parameters not given by *args* will not be filled in; these should be initialized by the caller. This function returns true on success and false if *args* is not a tuple or contains the wrong number of elements; an exception will be set if there was a failure.
sv: En enklare form av parameterhämtning som inte använder en formatsträng för att ange typen av argument. Funktioner som använder denna metod för att hämta sina parametrar bör deklareras som :c:macro:`METH_VARARGS` i funktions- eller metodtabeller. Den tupel som innehåller de faktiska parametrarna bör skickas som *args*; den måste faktiskt vara en tupel. Längden på tupeln måste vara minst *min* och inte mer än *max*; *min* och *max* kan vara lika. Ytterligare argument måste skickas till funktionen, var och en av dem bör vara en pekare till en :c:expr:`PyObject*`-variabel; dessa kommer att fyllas i med värdena från *args*; de kommer att innehålla :term:`lånade referenser <borrowed reference>`. Variablerna som motsvarar valfria parametrar som inte anges av *args* kommer inte att fyllas i; dessa bör initialiseras av den som anropar. Denna funktion returnerar true vid framgång och false om *args* inte är en tupel eller innehåller fel antal element; ett undantag kommer att ställas in om det blev ett misslyckande.

source: This is an example of the use of this function, taken from the sources for the :mod:`!_weakref` helper module for weak references::
sv: Detta är ett exempel på användningen av denna funktion, hämtad från källorna till :mod:`!_weakref` hjälpmodul för svaga referenser::

source: static PyObject * weakref_ref(PyObject *self, PyObject *args) { PyObject *object; PyObject *callback = NULL; PyObject *result = NULL; if (PyArg_UnpackTuple(args, "ref", 1, 2, &object, &callback)) { result = PyWeakref_NewRef(object, callback); } return result; }
sv: statiskt PyObject * weakref_ref(PyObject *self, PyObject *args) { PyObject *object; PyObject *callback = NULL; PyObject *resultat = NULL; if (PyArg_UnpackTuple(args, "ref", 1, 2, &object, &callback)) { resultat = PyWeakref_NewRef(objekt, återuppringning); } return resultat; }

source: The call to :c:func:`PyArg_UnpackTuple` in this example is entirely equivalent to this call to :c:func:`PyArg_ParseTuple`::
sv: Anropet till :c:func:`PyArg_UnpackTuple` i detta exempel är helt likvärdigt med detta anrop till :c:func:`PyArg_ParseTuple`::

source: The value to be inserted, if any, before :c:expr:`char * const *` in the *keywords* parameter declaration of :c:func:`PyArg_ParseTupleAndKeywords` and :c:func:`PyArg_VaParseTupleAndKeywords`. Default empty for C and ``const`` for C++ (:c:expr:`const char * const *`). To override, define it to the desired value before including :file:`Python.h`.
sv: Det värde som ska infogas, om något, före :c:expr:`char * const *` i parameterdeklarationen *keywords* för :c:func:`PyArg_ParseTupleAndKeywords` och :c:func:`PyArg_VaParseTupleAndKeywords`. Standard tom för C och ``const`` för C++ (:c:expr:`const char * const *`). För att åsidosätta, definiera det till önskat värde innan du inkluderar :file:`Python.h`.

source: Building values
sv: Bygga värden

source: Create a new value based on a format string similar to those accepted by the ``PyArg_Parse*`` family of functions and a sequence of values. Returns the value or ``NULL`` in the case of an error; an exception will be raised if ``NULL`` is returned.
sv: Skapar ett nytt värde baserat på en formatsträng liknande de som accepteras av ``PyArg_Parse*``-familjen av funktioner och en sekvens av värden. Returnerar värdet eller ``NULL`` i händelse av ett fel; ett undantag kommer att tas upp om ``NULL`` returneras.

source: :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
sv: :c:func:`Py_BuildValue` bygger inte alltid en tupel. Den bygger en tupel endast om dess formatsträng innehåller två eller fler formatenheter. Om formatsträngen är tom returnerar den ``None``; om den innehåller exakt en formatenhet returnerar den det objekt som beskrivs av den formatenheten. Om du vill tvinga den att returnera en tupel av storlek 0 eller ett, sätter du formatsträngen i parentes.

source: When memory buffers are passed as parameters to supply data to build objects, as for the ``s`` and ``s#`` formats, the required data is copied. Buffers provided by the caller are never referenced by the objects created by :c:func:`Py_BuildValue`. In other words, if your code invokes :c:func:`malloc` and passes the allocated memory to :c:func:`Py_BuildValue`, your code is responsible for calling :c:func:`free` for that memory once :c:func:`Py_BuildValue` returns.
sv: När minnesbuffertar skickas som parametrar för att leverera data till byggobjekt, som för formaten ``s`` och ``s#``, kopieras de data som krävs. Buffertar som tillhandahålls av anroparen refereras aldrig av de objekt som skapas av :c:func:`Py_BuildValue`. Med andra ord, om din kod anropar :c:func:`malloc` och skickar det allokerade minnet till :c:func:`Py_BuildValue`, är din kod ansvarig för att anropa :c:func:`free` för det minnet när :c:func:`Py_BuildValue` återkommer.
