Repository: yeager/python-docs-sv
Catalog: c-api/arg.po
Languages: sv

source: In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that the format unit will return; and the entry in [square] brackets is the type of the C value(s) to be passed.
sv: I följande beskrivning är den citerade formen formatenheten; posten inom (runda) parenteser är Python-objekttypen som formatenheten kommer att returnera; och posten inom [hakparenteser] är typen av C-värde(n) som ska skickas.

source: The characters space, tab, colon and comma are ignored in format strings (but not within format units such as ``s#``). This can be used to make long format strings a tad more readable.
sv: Tecknen mellanslag, tabb, kolon och kommatecken ignoreras i formatsträngar (men inte inom formatenheter som ``s#``). Detta kan användas för att göra långa formatsträngar en aning mer läsbara.

source: ``s`` (:class:`str` or ``None``) [const char \*]
sv: ``s`` (:class:`str` eller ``None``) [const char \*]

source: Convert a null-terminated C string to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, ``None`` is used.
sv: Konverterar en nollavslutad C-sträng till ett Python :class:`str`-objekt med kodningen ``'utf-8'``. Om C-strängpekaren är ``NULL`` används ``None``.

source: Convert a C string and its length to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, the length is ignored and ``None`` is returned.
sv: Konverterar en C-sträng och dess längd till ett Python :class:`str`-objekt med kodningen ``'utf-8'``. Om C-strängpekaren är ``NULL`` ignoreras längden och ``None`` returneras.

source: This converts a C string to a Python :class:`bytes` object. If the C string pointer is ``NULL``, ``None`` is returned.
sv: Detta konverterar en C-sträng till ett Python :class:`bytes`-objekt. Om C-strängpekaren är ``NULL`` returneras ``None``.

source: This converts a C string and its lengths to a Python object. If the C string pointer is ``NULL``, ``None`` is returned.
sv: Detta konverterar en C-sträng och dess längder till ett Python-objekt. Om C-strängpekaren är ``NULL`` returneras ``None``.

source: Same as ``s``.
sv: Samma som ````.

source: ``z#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
sv: ``z#`` (:class:`str` eller ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Same as ``s#``.
sv: Samma som ``s#``.

source: Convert a null-terminated :c:type:`wchar_t` buffer of Unicode (UTF-16 or UCS-4) data to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, ``None`` is returned.
sv: Konverterar en nollavslutad :c:type:`wchar_t`-buffert med Unicode-data (UTF-16 eller UCS-4) till ett Python Unicode-objekt. Om Unicode-buffertpekaren är ``NULL`` returneras ``None``.

source: Convert a Unicode (UTF-16 or UCS-4) data buffer and its length to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, the length is ignored and ``None`` is returned.
sv: Konverterar en Unicode (UTF-16 eller UCS-4) databuffert och dess längd till ett Python Unicode-objekt. Om Unicode-buffertpekaren är ``NULL`` ignoreras längden och ``None`` returneras.

source: ``U`` (:class:`str` or ``None``) [const char \*]
sv: ``U`` (:class:`str` eller ``None``) [const char \*]

source: ``U#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
sv: ``U#`` (:class:`str` eller ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Convert a plain C :c:expr:`int` to a Python integer object.
sv: Konverterar ett vanligt C :c:expr:`int` till ett Python-objekt med heltal.

source: Convert a plain C :c:expr:`char` to a Python integer object.
sv: Konvertera en vanlig C :c:expr:`char` till ett Python-objekt med heltal.

source: Convert a plain C :c:expr:`short int` to a Python integer object.
sv: Konverterar ett vanligt C :c:expr:`short int` till ett Python integer-objekt.

source: Convert a C :c:expr:`long int` to a Python integer object.
sv: Konverterar ett C :c:expr:`long int` till ett Python integer-objekt.

source: Convert a C :c:expr:`unsigned char` to a Python integer object.
sv: Konverterar ett C :c:expr:`unsigned char` till ett Python integer-objekt.

source: Convert a C :c:expr:`unsigned short int` to a Python integer object.
sv: Konverterar ett C :c:expr:`unsigned short int` till ett Python integer-objekt.

source: Convert a C :c:expr:`unsigned int` to a Python integer object.
sv: Konverterar ett C :c:expr:`unsigned int` till ett Python integer-objekt.

source: Convert a C :c:expr:`unsigned long` to a Python integer object.
sv: Konverterar ett C :c:expr:`unsigned long` till ett Python integer-objekt.

source: Convert a C :c:expr:`long long` to a Python integer object.
sv: Konverterar ett C :c:expr:`long long` till ett Python integer-objekt.

source: Convert a C :c:expr:`unsigned long long` to a Python integer object.
sv: Konverterar ett C :c:expr:`unsigned long long` till ett Python integer-objekt.

source: Convert a C :c:type:`Py_ssize_t` to a Python integer.
sv: Konverterar en C :c:type:`Py_ssize_t` till ett Python heltal.

source: Convert a C :c:expr:`int` to a Python :class:`bool` object.
sv: Konverterar ett C :c:expr:`int` till ett Python :class:`bool`-objekt.

source: Be aware that this format requires an ``int`` argument. Unlike most other contexts in C, variadic arguments are not coerced to a suitable type automatically. You can convert another type (for example, a pointer or a float) to a suitable ``int`` value using ``(x) ? 1 : 0`` or ``!!x``.
sv: Tänk på att detta format kräver ett ``int``-argument. Till skillnad från de flesta andra sammanhang i C, tvingas inte variadiska argument automatiskt till en lämplig typ. Du kan konvertera en annan typ (till exempel en pekare eller en float) till ett lämpligt ``int``-värde med hjälp av ``(x) ? 1 : 0`` eller ``!!x``.

source: ``c`` (:class:`bytes` of length 1) [char]
sv: ``c`` (:class:`bytes` av längd 1) [char]

source: Convert a C :c:expr:`int` representing a byte to a Python :class:`bytes` object of length 1.
sv: Konvertera ett C :c:expr:`int` som representerar en byte till ett Python :class:`bytes`-objekt med längden 1.

source: Convert a C :c:expr:`int` representing a character to Python :class:`str` object of length 1.
sv: Konvertera ett C :c:expr:`int` som representerar ett tecken till Python :class:`str`-objekt med längden 1.

source: Convert a C :c:expr:`double` to a Python floating-point number.
sv: Konvertera ett C :c:expr:`double` till ett Python flyttal.

source: Convert a C :c:expr:`float` to a Python floating-point number.
sv: Konverterar ett C :c:expr:`float` till ett Python flyttal.

source: Convert a C :c:type:`Py_complex` structure to a Python complex number.
sv: Konvertera en C :c:type:`Py_complex`-struktur till ett komplext Python-tal.

source: Pass a Python object untouched but create a new :term:`strong reference` to it (i.e. its reference count is incremented by one). If the object passed in is a ``NULL`` pointer, it is assumed that this was caused because the call producing the argument found an error and set an exception. Therefore, :c:func:`Py_BuildValue` will return ``NULL`` but won't raise an exception. If no exception has been raised yet, :exc:`SystemError` is set.
sv: Skicka ett Python-objekt orört men skapa en ny :term:`strong-referens` till det (dvs. dess referensantal ökas med ett). Om objektet som skickas in är en ``NULL``-pekare, antas det att detta orsakades av att anropet som producerade argumentet hittade ett fel och satte ett undantag. Därför kommer :c:func:`Py_BuildValue` att returnera ``NULL`` men inte skapa ett undantag. Om inget undantag har skapats ännu, sätts :exc:`SystemError`.

source: ``S`` (object) [PyObject \*]
sv: ``S`` (objekt) [PyObject \*]

source: Same as ``O``.
sv: Samma som ``O``.

source: ``N`` (object) [PyObject \*]
sv: ``N`` (objekt) [PyObject \*]

source: Same as ``O``, except it doesn't create a new :term:`strong reference`. Useful when the object is created by a call to an object constructor in the argument list.
sv: Samma som ``O``, förutom att det inte skapar en ny :term:`strong referens`. Användbart när objektet skapas genom ett anrop till en objektkonstruktör i argumentlistan.

source: ``O&`` (object) [*converter*, *anything*]
sv: ``O&`` (objekt) [*konverterare*, *något*]

source: Convert *anything* to a Python object through a *converter* function. The function is called with *anything* (which should be compatible with :c:expr:`void*`) as its argument and should return a "new" Python object, or ``NULL`` if an error occurred.
sv: Konvertera *något* till ett Python-objekt genom en *konverter*-funktion. Funktionen anropas med *anything* (som bör vara kompatibel med :c:expr:`void*`) som sitt argument och bör returnera ett "nytt" Python-objekt, eller ``NULL`` om ett fel inträffade.

source: ``(items)`` (:class:`tuple`) [*matching-items*]
sv: ``(items)`` (:class:`tuple`) [*matchande-items*]

source: Convert a sequence of C values to a Python tuple with the same number of items.
sv: Konvertera en sekvens av C-värden till en Python-tupel med samma antal objekt.

source: ``[items]`` (:class:`list`) [*matching-items*]
sv: ``[items]`` (:class:`list`) [*matchande-items*]

source: Convert a sequence of C values to a Python list with the same number of items.
sv: Konvertera en sekvens av C-värden till en Python-lista med samma antal objekt.

source: ``{items}`` (:class:`dict`) [*matching-items*]
sv: ``{items}`` (:class:`dict`) [*matchande-objekt*]

source: Convert a sequence of C values to a Python dictionary. Each pair of consecutive C values adds one item to the dictionary, serving as key and value, respectively.
sv: Konverterar en sekvens av C-värden till en Python-ordbok. Varje par av på varandra följande C-värden lägger till ett objekt i ordlistan och fungerar som nyckel respektive värde.

source: If there is an error in the format string, the :exc:`SystemError` exception is set and ``NULL`` returned.
sv: Om det finns ett fel i formatsträngen sätts undantaget :exc:`SystemError` och ``NULL`` returneras.

source: Identical to :c:func:`Py_BuildValue`, except that it accepts a va_list rather than a variable number of arguments.
sv: Identisk med :c:func:`Py_BuildValue`, förutom att den accepterar en va_list i stället för ett variabelt antal argument.
