Repository: yeager/python-docs-sv
Catalog: c-api/arg.po
Languages: sv

source: Parsing arguments and building values
sv: Tolkning av argument och skapande av värden

source: These functions are useful when creating your own extension functions and methods. Additional information and examples are available in :ref:`extending-index`.
sv: Dessa funktioner är användbara när du skapar dina egna tilläggsfunktioner och metoder. Ytterligare information och exempel finns i :ref:`extending-index`.

source: The first three of these functions described, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, and :c:func:`PyArg_Parse`, all use *format strings* which are used to tell the function about the expected arguments. The format strings use the same syntax for each of these functions.
sv: De tre först beskrivna funktionerna, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords` och :c:func:`PyArg_Parse`, använder alla *formatsträngar* som används för att tala om för funktionen vilka argument som förväntas. Formatsträngarna använder samma syntax för var och en av dessa funktioner.

source: Parsing arguments
sv: Tolkning av argument

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
sv: En formatsträng består av noll eller fler "formatenheter" En formatenhet beskriver ett Python-objekt; det är vanligtvis ett enda tecken eller en parentetisk sekvens av formatenheter. Med några få undantag motsvarar en formatenhet som inte är en parentetisk sekvens normalt ett enda adressargument till dessa funktioner. I följande beskrivning är den citerade formen formatenheten; posten inom (runda) parenteser är Python-objekttypen som matchar formatenheten; och posten inom [hakparenteser] är typen av C-variabeln(erna) vars adress ska skickas.

source: Strings and buffers
sv: Strängar och buffertar

source: On Python 3.12 and older, the macro :c:macro:`!PY_SSIZE_T_CLEAN` must be defined before including :file:`Python.h` to use all ``#`` variants of formats (``s#``, ``y#``, etc.) explained below. This is not necessary on Python 3.13 and later.
sv: På Python 3.12 och äldre måste makrot :c:macro:`!PY_SSIZE_T_CLEAN` definieras innan :file:`Python.h` inkluderas för att använda alla ``#`` varianter av format (``s#``, ``y#``, etc.) som förklaras nedan. Detta är inte nödvändigt i Python 3.13 och senare.

source: These formats allow accessing an object as a contiguous chunk of memory. You don't have to provide raw storage for the returned unicode or bytes area.
sv: Dessa format gör det möjligt att komma åt ett objekt som en sammanhängande del av minnet. Du behöver inte tillhandahålla rå lagring för det returnerade unicode- eller bytesområdet.

source: Unless otherwise stated, buffers are not NUL-terminated.
sv: Om inget annat anges är buffertar inte NUL-terminerade.

source: There are three ways strings and buffers can be converted to C:
sv: Strängar och buffertar kan konverteras till C på tre olika sätt:

source: Formats such as ``y*`` and ``s*`` fill a :c:type:`Py_buffer` structure. This locks the underlying buffer so that the caller can subsequently use the buffer even inside a :c:type:`Py_BEGIN_ALLOW_THREADS` block without the risk of mutable data being resized or destroyed. As a result, **you have to call** :c:func:`PyBuffer_Release` after you have finished processing the data (or in any early abort case).
sv: Format som ``y*`` och ``s*`` fyller en :c:type:`Py_buffer`-struktur. Detta låser den underliggande bufferten så att anroparen därefter kan använda bufferten även inom ett :c:type:`Py_BEGIN_ALLOW_THREADS`-block utan att riskera att muterbara data ändras i storlek eller förstörs. Som ett resultat måste **du anropa** :c:func:`PyBuffer_Release` efter att du har avslutat bearbetningen av data (eller i något tidigt avbrottsfall).

source: The ``es``, ``es#``, ``et`` and ``et#`` formats allocate the result buffer. **You have to call** :c:func:`PyMem_Free` after you have finished processing the data (or in any early abort case).
sv: Formaten ``es``, ``es#``, ``et`` och ``et#`` allokerar resultatbufferten. **Du måste anropa** :c:func:`PyMem_Free` när du är klar med databehandlingen (eller vid ett tidigt avbrott).

source: Other formats take a :class:`str` or a read-only :term:`bytes-like object`, such as :class:`bytes`, and provide a ``const char *`` pointer to its buffer. In this case the buffer is "borrowed": it is managed by the corresponding Python object, and shares the lifetime of this object. You won't have to release any memory yourself.
sv: Andra format tar en :class:`str` eller en skrivskyddad :term:`bytes-liknande objekt`, såsom :class:`bytes`, och tillhandahåller en ``const char *`` pekare till dess buffert. I detta fall är bufferten "lånad": den hanteras av motsvarande Python-objekt och har samma livstid som detta objekt. Du kommer inte att behöva frigöra något minne själv.

source: To ensure that the underlying buffer may be safely borrowed, the object's :c:member:`PyBufferProcs.bf_releasebuffer` field must be ``NULL``. This disallows common mutable objects such as :class:`bytearray`, but also some read-only objects such as :class:`memoryview` of :class:`bytes`.
sv: För att säkerställa att den underliggande bufferten kan lånas på ett säkert sätt måste objektets fält :c:member:`PyBufferProcs.bf_releasebuffer` vara ``NULL``. Detta tillåter inte vanliga föränderliga objekt som :class:`bytearray`, men även vissa skrivskyddade objekt som :class:`memoryview` av :class:`bytes`.

source: Besides this ``bf_releasebuffer`` requirement, there is no check to verify whether the input object is immutable (e.g. whether it would honor a request for a writable buffer, or whether another thread can mutate the data).
sv: Förutom detta ``bf_releasebuffer``-krav finns det ingen kontroll för att verifiera om inmatningsobjektet är oföränderligt (t.ex. om det skulle uppfylla en begäran om en skrivbar buffert, eller om en annan tråd kan mutera data).

source: Convert a Unicode object to a C pointer to a character string. A pointer to an existing string is stored in the character pointer variable whose address you pass. The C string is NUL-terminated. The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised. Unicode objects are converted to C strings using ``'utf-8'`` encoding. If this conversion fails, a :exc:`UnicodeError` is raised.
sv: Konverterar ett Unicode-objekt till en C-pekare till en teckensträng. En pekare till en befintlig sträng lagras i den teckenpekarvariabel vars adress du skickar. C-strängen är NUL-terminerad. Python-strängen får inte innehålla inbäddade nollkodpunkter; om den gör det, uppstår ett :exc:`ValueError`-undantag. Unicode-objekt konverteras till C-strängar med kodningen ``'utf-8'``. Om denna konvertering misslyckas, uppstår ett :exc:`UnicodeError`.

source: This format does not accept :term:`bytes-like objects <bytes-like object>`. If you want to accept filesystem paths and convert them to C character strings, it is preferable to use the ``O&`` format with :c:func:`PyUnicode_FSConverter` as *converter*.
sv: Detta format accepterar inte :term:`bytesliknande objekt <bytes-like object>`. Om du vill acceptera sökvägar i filsystemet och konvertera dem till C-teckensträngar är det bättre att använda formatet ``O&amp;`` med :c:func:`PyUnicode_FSConverter` som *konverterare*.

source: Previously, :exc:`TypeError` was raised when embedded null code points were encountered in the Python string.
sv: Tidigare gav :exc:`TypeError` upphov till fel när inbäddade nollkodpunkter påträffades i Python-strängen.

source: ``s*`` (:class:`str` or :term:`bytes-like object`) [Py_buffer]
sv: ``s*`` (:class:`str` eller :term:`bytesliknande objekt`) [Py_buffer]

source: This format accepts Unicode objects as well as bytes-like objects. It fills a :c:type:`Py_buffer` structure provided by the caller. In this case the resulting C string may contain embedded NUL bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
sv: Detta format accepterar Unicode-objekt såväl som bytes-liknande objekt. Det fyller en :c:type:`Py_buffer`-struktur som tillhandahålls av anroparen. I detta fall kan den resulterande C-strängen innehålla inbäddade NUL-bytes. Unicode-objekt konverteras till C-strängar med kodningen ``'utf-8``.

source: ``s#`` (:class:`str`, read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
sv: ``s#`` (:class:`str`, skrivskyddad :term:`bytesliknande objekt`) [const char \*, :c:type:`Py_ssize_t`]

source: Like ``s*``, except that it provides a :ref:`borrowed buffer <c-arg-borrowed-buffer>`. The result is stored into two C variables, the first one a pointer to a C string, the second one its length. The string may contain embedded null bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
sv: Som ``s*``, förutom att den tillhandahåller en :ref:`lånad buffert <c-arg-borrowed-buffer>`. Resultatet lagras i två C-variabler, den första en pekare till en C-sträng, den andra dess längd. Strängen kan innehålla inbäddade nollbytes. Unicode-objekt konverteras till C-strängar med kodningen ``'utf-8'``.

source: ``z`` (:class:`str` or ``None``) [const char \*]
sv: ``z`` (:class:`str` eller ``None``) [const char \*]

source: Like ``s``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
sv: Som ````, men Python-objektet kan också vara ``None``, i vilket fall C-pekaren sätts till ``NULL``.

source: ``z*`` (:class:`str`, :term:`bytes-like object` or ``None``) [Py_buffer]
sv: ``z*`` (:class:`str`, :term:`bytesliknande objekt` eller ``None``) [Py_buffer]

source: Like ``s*``, but the Python object may also be ``None``, in which case the ``buf`` member of the :c:type:`Py_buffer` structure is set to ``NULL``.
sv: Som ``*``, men Python-objektet kan också vara ``None``, i vilket fall ``buf``-medlemmen i :c:type:`Py_buffer`-strukturen sätts till ``NULL``.

source: ``z#`` (:class:`str`, read-only :term:`bytes-like object` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
sv: ``z#`` (:class:`str`, skrivskyddad :term:`bytesliknande objekt` eller ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Like ``s#``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
sv: Som ``#``, men Python-objektet kan också vara ``None``, i vilket fall C-pekaren sätts till ``NULL``.

source: ``y`` (read-only :term:`bytes-like object`) [const char \*]
sv: ``y`` (skrivskyddad :term:`bytesliknande objekt`) [const char \*]

source: This format converts a bytes-like object to a C pointer to a :ref:`borrowed <c-arg-borrowed-buffer>` character string; it does not accept Unicode objects. The bytes buffer must not contain embedded null bytes; if it does, a :exc:`ValueError` exception is raised.
sv: Detta format konverterar ett bytes-liknande objekt till en C-pekare till en :ref:``borrowed <c-arg-borrowed-buffer>`` teckensträng; det accepterar inte Unicode-objekt. Bytesbufferten får inte innehålla inbäddade nollbytes; om den gör det, uppstår ett :exc:`ValueError`-undantag.

source: Previously, :exc:`TypeError` was raised when embedded null bytes were encountered in the bytes buffer.
sv: Tidigare skapades :exc:`TypeError` när inbäddade nullbytes påträffades i bytesbufferten.

source: ``y*`` (:term:`bytes-like object`) [Py_buffer]
sv: ``y*`` (:term:`bytesliknande objekt`) [Py_buffer]

source: This variant on ``s*`` doesn't accept Unicode objects, only bytes-like objects. **This is the recommended way to accept binary data.**
sv: Den här varianten av ``s*`` accepterar inte Unicode-objekt, utan endast bytesliknande objekt. **Detta är det rekommenderade sättet att acceptera binära data

source: ``y#`` (read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
sv: ``y#`` (skrivskyddad :term:`bytesliknande objekt`) [const char \*, :c:type:`Py_ssize_t`]

source: This variant on ``s#`` doesn't accept Unicode objects, only bytes-like objects.
sv: Den här varianten av ``s#`` accepterar inte Unicode-objekt, utan endast bytesliknande objekt.

source: Requires that the Python object is a :class:`bytes` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a bytes object. The C variable may also be declared as :c:expr:`PyObject*`.
sv: Kräver att Python-objektet är ett :class:`bytes`-objekt, utan att försöka någon konvertering. Utlöser :exc:`TypeError` om objektet inte är ett bytes-objekt. C-variabeln kan också deklareras som :c:expr:`PyObject*`.

source: Requires that the Python object is a :class:`bytearray` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a :class:`bytearray` object. The C variable may also be declared as :c:expr:`PyObject*`.
sv: Kräver att Python-objektet är ett :class:`bytearray`-objekt, utan att försöka någon konvertering. Utlöser :exc:`TypeError` om objektet inte är ett :class:`bytearray`-objekt. C-variabeln kan också deklareras som :c:expr:`PyObject*`.

source: Requires that the Python object is a Unicode object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a Unicode object. The C variable may also be declared as :c:expr:`PyObject*`.
sv: Kräver att Python-objektet är ett Unicode-objekt, utan att försöka någon konvertering. Utlöser :exc:`TypeError` om objektet inte är ett Unicode-objekt. C-variabeln kan också deklareras som :c:expr:`PyObject*`.

source: ``w*`` (read-write :term:`bytes-like object`) [Py_buffer]
sv: ``w*`` (skrivläsning :term:`bytesliknande objekt`) [Py_buffer]

source: This format accepts any object which implements the read-write buffer interface. It fills a :c:type:`Py_buffer` structure provided by the caller. The buffer may contain embedded null bytes. The caller have to call :c:func:`PyBuffer_Release` when it is done with the buffer.
sv: Detta format accepterar alla objekt som implementerar gränssnittet för skriv-läs-buffert. Det fyller en :c:type:`Py_buffer`-struktur som tillhandahålls av anroparen. Bufferten kan innehålla inbäddade nollbytes. Den som anropar måste anropa :c:func:`PyBuffer_Release` när den är klar med bufferten.

source: This variant on ``s`` is used for encoding Unicode into a character buffer. It only works for encoded data without embedded NUL bytes.
sv: Denna variant av ``s`` används för att koda Unicode till en teckenbuffert. Den fungerar endast för kodade data utan inbäddade NUL-bytes.

source: This format requires two arguments. The first is only used as input, and must be a :c:expr:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:expr:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument.
sv: Detta format kräver två argument. Det första används endast som indata och måste vara ett :c:expr:`const char*` som pekar på namnet på en kodning som en NUL-terminerad sträng, eller ``NULL``, i vilket fall kodningen ``'utf-8'`` används. Ett undantag uppstår om den angivna kodningen inte är känd av Python. Det andra argumentet måste vara ett :c:expr:`char**`; värdet på pekaren som det refererar till kommer att sättas till en buffert med innehållet i argumentets text. Texten kommer att kodas i den kodning som anges av det första argumentet.

source: :c:func:`PyArg_ParseTuple` will allocate a buffer of the needed size, copy the encoded data into this buffer and adjust *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after use.
sv: :c:func:`PyArg_ParseTuple` kommer att allokera en buffert av den storlek som behövs, kopiera den kodade datan till denna buffert och justera *\*buffer* för att referera till den nyligen allokerade lagringen. Anroparen är ansvarig för att anropa :c:func:`PyMem_Free` för att frigöra den allokerade bufferten efter användning.

source: ``et`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer]
sv: ``et`` (:class:`str`, :class:`bytes` eller :class:`bytearray`) [const char \*encoding, char \*\\buffer]

source: Same as ``es`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
sv: Samma som ``es`` förutom att byte-strängobjekt skickas igenom utan att omkoda dem. Istället antar implementationen att byte-strängobjektet använder den kodning som skickas in som parameter.

source: This variant on ``s#`` is used for encoding Unicode into a character buffer. Unlike the ``es`` format, this variant allows input data which contains NUL characters.
sv: Denna variant av ``s#`` används för att koda Unicode till en teckenbuffert. Till skillnad från formatet ``es`` tillåter den här varianten indata som innehåller NUL-tecken.

source: It requires three arguments. The first is only used as input, and must be a :c:expr:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:expr:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument. The third argument must be a pointer to an integer; the referenced integer will be set to the number of bytes in the output buffer.
sv: Den kräver tre argument. Det första används endast som indata och måste vara en :c:expr:`const char*` som pekar på namnet på en kodning som en NUL-terminerad sträng, eller ``NULL``, i vilket fall kodningen ``'utf-8'`` används. Ett undantag uppstår om den angivna kodningen inte är känd av Python. Det andra argumentet måste vara ett :c:expr:`char**`; värdet på pekaren som det refererar till kommer att sättas till en buffert med innehållet i argumentets text. Texten kommer att kodas i den kodning som anges av det första argumentet. Det tredje argumentet måste vara en pekare till ett heltal; det refererade heltalet kommer att sättas till antalet bytes i utmatningsbufferten.

source: There are two modes of operation:
sv: Det finns två olika driftlägen:

source: If *\*buffer* points a ``NULL`` pointer, the function will allocate a buffer of the needed size, copy the encoded data into this buffer and set *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after usage.
sv: Om *\*buffer* pekar på en ``NULL``-pekare, kommer funktionen att allokera en buffert av den storlek som behövs, kopiera de kodade data till denna buffert och sätta *\*buffer* att referera till den nyligen allokerade lagringen. Anroparen är ansvarig för att anropa :c:func:`PyMem_Free` för att frigöra den allokerade bufferten efter användning.

source: If *\*buffer* points to a non-``NULL`` pointer (an already allocated buffer), :c:func:`PyArg_ParseTuple` will use this location as the buffer and interpret the initial value of *\*buffer_length* as the buffer size. It will then copy the encoded data into the buffer and NUL-terminate it. If the buffer is not large enough, a :exc:`ValueError` will be set.
sv: Om *\*buffer* pekar på en pekare som inte är ``NULL`` (en redan allokerad buffert) kommer :c:func:`PyArg_ParseTuple` att använda denna plats som buffert och tolka det initiala värdet för *\*buffer_length* som buffertstorleken. Därefter kopieras de kodade data till bufferten och avslutas med NUL. Om bufferten inte är tillräckligt stor kommer ett :exc:`ValueError` att anges.

source: In both cases, *\*buffer_length* is set to the length of the encoded data without the trailing NUL byte.
sv: I båda fallen sätts *\*buffer_length* till längden på den kodade datan utan den efterföljande NUL-byten.

source: ``et#`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]
sv: ``et#`` (:class:`str`, :class:`bytes` eller :class:`bytearray`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]

source: Same as ``es#`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
sv: Samma som ``es#`` förutom att byte-strängobjekt skickas igenom utan att omkoda dem. Istället antar implementationen att byte-strängobjektet använder den kodning som skickas in som parameter.

source: ``u``, ``u#``, ``Z``, and ``Z#`` are removed because they used a legacy ``Py_UNICODE*`` representation.
sv: ``u``, ``u#``, ``Z`` och ``Z#`` tas bort eftersom de använde en äldre ``Py_UNICODE*``-representation.

source: Numbers
sv: Nummer

source: These formats allow representing Python numbers or single characters as C numbers. Formats that require :class:`int`, :class:`float` or :class:`complex` can also use the corresponding special methods :meth:`~object.__index__`, :meth:`~object.__float__` or :meth:`~object.__complex__` to convert the Python object to the required type.
sv: Dessa format gör det möjligt att representera Python-tal eller enstaka tecken som C-tal. Format som kräver :class:`int`, :class:`float` eller :class:`complex` kan också använda motsvarande specialmetoder :meth:`~object.__index__`, :meth:`~object.__float__` eller :meth:`~object.__complex__` för att konvertera Python-objektet till önskad typ.

source: For signed integer formats, :exc:`OverflowError` is raised if the value is out of range for the C type. For unsigned integer formats, no range checking is done --- the most significant bits are silently truncated when the receiving field is too small to receive the value.
sv: För signerade heltalsformat :exc:`OverflowError` om värdet ligger utanför intervallet för C-typen. För osignerade heltalsformat görs ingen intervallkontroll --- de mest signifikanta bitarna trunkeras tyst när mottagarfältet är för litet för att ta emot värdet.

source: Convert a nonnegative Python integer to an unsigned tiny integer, stored in a C :c:expr:`unsigned char`.
sv: Konverterar ett icke-negativt Python heltal till ett osignerat litet heltal, lagrat i en C :c:expr:`unsigned char`.

source: Convert a Python integer to a tiny integer without overflow checking, stored in a C :c:expr:`unsigned char`.
sv: Konvertera ett Python heltal till ett litet heltal utan överflödeskontroll, lagrat i en C :c:expr:`unsigned char`.

source: ``h`` (:class:`int`) [short int]
sv: ``h`` (:class:`int`) [kort int]

source: Convert a Python integer to a C :c:expr:`short int`.
sv: Konvertera ett heltal i Python till ett C :c:expr:`short int`.

source: Convert a Python integer to a C :c:expr:`unsigned short int`, without overflow checking.
sv: Konvertera ett heltal från Python till ett C :c:expr:`unsigned short int`, utan kontroll av överflöd.

source: Convert a Python integer to a plain C :c:expr:`int`.
sv: Konvertera ett heltal från Python till ett vanligt C :c:expr:`int`.
