Repository: yeager/python-docs-sv
Catalog: c-api/buffer.po
Languages: sv

source: If ``ndim == 0``, the memory location pointed to by :c:member:`~Py_buffer.buf` is interpreted as a scalar of size :c:member:`~Py_buffer.itemsize`. In that case, both :c:member:`~Py_buffer.shape` and :c:member:`~Py_buffer.strides` are ``NULL``.
sv: Om ``ndim == 0``, tolkas minnesplatsen som pekas ut av :c:member:`~Py_buffer.buf` som en skalär av storleken :c:member:`~Py_buffer.itemsize`. I det fallet är både :c:member:`~Py_buffer.shape` och :c:member:`~Py_buffer.strides` ``NULL``.

source: If :c:member:`~Py_buffer.strides` is ``NULL``, the array is interpreted as a standard n-dimensional C-array. Otherwise, the consumer must access an n-dimensional array as follows:
sv: Om :c:member:`~Py_buffer.strides` är ``NULL`` tolkas matrisen som en standard n-dimensionell C-array. Annars måste konsumenten komma åt en n-dimensionell array på följande sätt:

source: ptr = (char *)buf + indices[0] * strides[0] + ... + indices[n-1] * strides[n-1]; item = *((typeof(item) *)ptr);
sv: ptr = (char *)buf + index[0] * strides[0] + ... + index[n-1] * strides[n-1]; objekt = *((typeof(objekt) *)ptr);

source: As noted above, :c:member:`~Py_buffer.buf` can point to any location within the actual memory block. An exporter can check the validity of a buffer with this function:
sv: Som nämnts ovan kan :c:member:`~Py_buffer.buf` peka på vilken plats som helst inom det faktiska minnesblocket. En exportör kan kontrollera giltigheten av en buffert med denna funktion:

source: def verify_structure(memlen, itemsize, ndim, shape, strides, offset): """Verify that the parameters represent a valid array within the bounds of the allocated memory: char *mem: start of the physical memory block memlen: length of the physical memory block offset: (char *)buf - mem """ if offset % itemsize: return False if offset < 0 or offset+itemsize > memlen: return False if any(v % itemsize for v in strides): return False if ndim <= 0: return ndim == 0 and not shape and not strides if 0 in shape: return True imin = sum(strides[j]*(shape[j]-1) for j in range(ndim) if strides[j] <= 0) imax = sum(strides[j]*(shape[j]-1) for j in range(ndim) if strides[j] > 0) return 0 <= offset+imin and offset+imax+itemsize <= memlen
sv: def verify_structure(memlen, itemsize, ndim, shape, strides, offset): """Verifiera att parametrarna representerar en giltig array inom gränserna för det allokerade minnet: char *mem: början på det fysiska minnesblocket memlen: längden på det fysiska minnesblocket offset: (char *)buf - mem """ om offset % itemsize: returnera False om offset < 0 eller offset+itemsize > memlen: returnera False if any(v % itemsize för v i strides): returnera False om ndim <= 0: return ndim == 0 och inte shape och inte strides om 0 i shape: returnera True imin = sum(strides[j]*(shape[j]-1) for j in range(ndim) om strides[j] <= 0) imax = summa(strides[j]*(shape[j]-1) for j in range(ndim) om strides[j] > 0) return 0 <= offset+imin och offset+imax+itemsize <= memlen

source: PIL-style: shape, strides and suboffsets
sv: PIL-stil: form, strides och suboffsets

source: In addition to the regular items, PIL-style arrays can contain pointers that must be followed in order to get to the next element in a dimension. For example, the regular three-dimensional C-array ``char v[2][2][3]`` can also be viewed as an array of 2 pointers to 2 two-dimensional arrays: ``char (*v[2])[2][3]``. In suboffsets representation, those two pointers can be embedded at the start of :c:member:`~Py_buffer.buf`, pointing to two ``char x[2][3]`` arrays that can be located anywhere in memory.
sv: Förutom de vanliga elementen kan matriser i PIL-stil innehålla pekare som måste följas för att komma till nästa element i en dimension. Till exempel kan den vanliga tredimensionella C-arrayen ``char v[2][2][3]`` också ses som en array med 2 pekare till 2 tvådimensionella arrayer: ``char (*v[2])[2][3]``. I suboffsets-representationen kan dessa två pekare bäddas in i början av :c:member:`~Py_buffer.buf` och peka på två ``char x[2][3]``-arrayer som kan placeras var som helst i minnet.

source: Here is a function that returns a pointer to the element in an N-D array pointed to by an N-dimensional index when there are both non-``NULL`` strides and suboffsets::
sv: Här är en funktion som returnerar en pekare till elementet i en N-D-array som pekas ut av ett N-dimensionellt index när det finns både icke-``NULL`` strides och suboffsets::

source: void *get_item_pointer(int ndim, void *buf, Py_ssize_t *strides, Py_ssize_t *suboffsets, Py_ssize_t *indices) { char *pointer = (char*)buf; int i; for (i = 0; i < ndim; i++) { pointer += strides[i] * indices[i]; if (suboffsets[i] >=0 ) { pointer = *((char**)pointer) + suboffsets[i]; } } return (void*)pointer; }
sv: void *get_item_pointer(int ndim, void *buf, Py_ssize_t *strides, Py_ssize_t *strides, Py_ssize_t *suboffsets, Py_ssize_t *indices) { char *pointer = (char*)buf; int i; for (i = 0; i < ndim; i++) { pekare += strides[i] * index[i]; om (suboffsets[i] >=0 ) { pekare = *((char**)pekare) + suboffsets[i]; } } return (void*)pekare; }

source: Buffer-related functions
sv: Buffertrelaterade funktioner

source: Return ``1`` if *obj* supports the buffer interface otherwise ``0``. When ``1`` is returned, it doesn't guarantee that :c:func:`PyObject_GetBuffer` will succeed. This function always succeeds.
sv: Returnerar ``1`` om *obj* stöder buffertgränssnittet annars ``0``. När ``1`` returneras, garanterar det inte att :c:func:`PyObject_GetBuffer` kommer att lyckas. Denna funktion lyckas alltid.

source: Send a request to *exporter* to fill in *view* as specified by *flags*. If the exporter cannot provide a buffer of the exact type, it MUST raise :exc:`BufferError`, set ``view->obj`` to ``NULL`` and return ``-1``.
sv: Skicka en begäran till *exportör* om att fylla i *view* enligt specifikationen i *flags*. Om exportören inte kan tillhandahålla en buffert av exakt typ, MÅSTE den ge upphov till :exc:`BufferError`, sätta ``view->obj`` till ``NULL`` och returnera ``-1``.

source: On success, fill in *view*, set ``view->obj`` to a new reference to *exporter* and return 0. In the case of chained buffer providers that redirect requests to a single object, ``view->obj`` MAY refer to this object instead of *exporter* (See :ref:`Buffer Object Structures <buffer-structs>`).
sv: Vid framgång, fyll i *view*, sätt ``view-&gt;obj`` till en ny referens till *exporter* och returnera 0. När det gäller kedjade buffertleverantörer som omdirigerar förfrågningar till ett enda objekt, KAN ``view-&gt;obj`` referera till detta objekt istället för *exporter* (Se :ref:``Buffertobjektstrukturer <buffer-structs>``).

source: Successful calls to :c:func:`PyObject_GetBuffer` must be paired with calls to :c:func:`PyBuffer_Release`, similar to :c:func:`malloc` and :c:func:`free`. Thus, after the consumer is done with the buffer, :c:func:`PyBuffer_Release` must be called exactly once.
sv: Lyckade anrop till :c:func:`PyObject_GetBuffer` måste paras ihop med anrop till :c:func:`PyBuffer_Release`, på samma sätt som :c:func:`malloc` och :c:func:`free`. Efter att konsumenten är klar med bufferten måste alltså :c:func:`PyBuffer_Release` anropas exakt en gång.

source: Release the buffer *view* and release the :term:`strong reference` (i.e. decrement the reference count) to the view's supporting object, ``view->obj``. This function MUST be called when the buffer is no longer being used, otherwise reference leaks may occur.
sv: Frigör bufferten *view* och frigör :term:`strong-referensen` (dvs. decimera referensantalet) till vyns stödobjekt, ``view->obj``. Denna funktion MÅSTE anropas när bufferten inte längre används, annars kan referensläckor uppstå.

source: It is an error to call this function on a buffer that was not obtained via :c:func:`PyObject_GetBuffer`.
sv: Det är ett fel att anropa denna funktion på en buffert som inte erhölls via :c:func:`PyObject_GetBuffer`.

source: Return the implied :c:member:`~Py_buffer.itemsize` from :c:member:`~Py_buffer.format`. On error, raise an exception and return -1.
sv: Returnerar den underförstådda :c:member:`~Py_buffer.itemsize` från :c:member:`~Py_buffer.format`. Vid fel, skapa ett undantag och returnera -1.

source: Return ``1`` if the memory defined by the *view* is C-style (*order* is ``'C'``) or Fortran-style (*order* is ``'F'``) :term:`contiguous` or either one (*order* is ``'A'``). Return ``0`` otherwise. This function always succeeds.
sv: Returnerar ``1`` om minnet som definieras av *vyn* är C-stil (*ordning* är ``'C'``) eller Fortran-stil (*ordning* är ``'F'``) :term:`contiguous` eller endera (*ordning* är ``'A'``). Returnerar ``0`` annars. Denna funktion lyckas alltid.

source: Get the memory area pointed to by the *indices* inside the given *view*. *indices* must point to an array of ``view->ndim`` indices.
sv: Hämta minnesområdet som pekas ut av *indices* i den givna *view*. *indices* måste peka på en array av ``view->ndim`` index.

source: Copy contiguous *len* bytes from *buf* to *view*. *fort* can be ``'C'`` or ``'F'`` (for C-style or Fortran-style ordering). ``0`` is returned on success, ``-1`` on error.
sv: Kopiera sammanhängande *len* byte från *buf* till *view*. *fort* kan vara ``'C'`` eller ``'F'`` (för C-stil eller Fortran-stil ordning). ``0`` returneras vid framgång, ``-1`` vid fel.

source: Copy *len* bytes from *src* to its contiguous representation in *buf*. *order* can be ``'C'`` or ``'F'`` or ``'A'`` (for C-style or Fortran-style ordering or either one). ``0`` is returned on success, ``-1`` on error.
sv: Kopiera *len* bytes från *src* till dess sammanhängande representation i *buf*. *order* kan vara ``'C'`` eller ``'F'`` eller ``'A'`` (för C-stil eller Fortran-stil eller endera). ``0`` returneras vid framgång, ``-1`` vid fel.

source: This function fails if *len* != *src->len*.
sv: Denna funktion misslyckas om *len* != *src->len*.

source: Copy data from *src* to *dest* buffer. Can convert between C-style and or Fortran-style buffers.
sv: Kopiera data från *src* till *dest* buffert. Kan konvertera mellan buffertar i C-stil eller Fortran-stil.

source: ``0`` is returned on success, ``-1`` on error.
sv: ``0`` returneras vid framgång, ``-1`` vid fel.

source: Fill the *strides* array with byte-strides of a :term:`contiguous` (C-style if *order* is ``'C'`` or Fortran-style if *order* is ``'F'``) array of the given shape with the given number of bytes per element.
sv: Fyll *strides*-arrayen med byte-strides av en :term:`kontiguous` (C-style om *order* är ``'C'`` eller Fortran-style om *order* är ``'F'``) array av den givna formen med det givna antalet bytes per element.

source: Handle buffer requests for an exporter that wants to expose *buf* of size *len* with writability set according to *readonly*. *buf* is interpreted as a sequence of unsigned bytes.
sv: Hantera buffertförfrågningar för en exportör som vill exponera *buf* av storlek *len* med skrivbarhet inställd enligt *readonly*. *buf* tolkas som en sekvens av osignerade bytes.

source: The *flags* argument indicates the request type. This function always fills in *view* as specified by flags, unless *buf* has been designated as read-only and :c:macro:`PyBUF_WRITABLE` is set in *flags*.
sv: Argumentet *flags* anger typen av begäran. Den här funktionen fyller alltid i *view* enligt flaggorna, såvida inte *buf* har angetts som skrivskyddad och :c:macro:`PyBUF_WRITABLE` har angetts i *flags*.

source: On success, set ``view->obj`` to a new reference to *exporter* and return 0. Otherwise, raise :exc:`BufferError`, set ``view->obj`` to ``NULL`` and return ``-1``;
sv: Vid framgång, sätt ``view->obj`` till en ny referens till *exporter* och returnera 0. Annars, raise :exc:`BufferError`, set ``view->obj`` to ``NULL`` and return ``-1``;

source: If this function is used as part of a :ref:`getbufferproc <buffer-structs>`, *exporter* MUST be set to the exporting object and *flags* must be passed unmodified. Otherwise, *exporter* MUST be ``NULL``.
sv: Om denna funktion används som en del av en :ref:`getbufferproc <buffer-structs>`, MÅSTE *exporter* sättas till det exporterande objektet och *flags* måste skickas oförändrat. Annars MÅSTE *exporter* vara ``NULL``.

source: buffer protocol
sv: buffertprotokoll

source: buffer interface
sv: buffertgränssnitt

source: (see buffer protocol)
sv: (se buffertprotokoll)

source: buffer object
sv: buffertobjekt

source: PyBufferProcs (C type)
sv: PyBufferProcs (C-typ)

source: contiguous
sv: angränsande

source: C-contiguous
sv: C-slutande

source: Fortran contiguous
sv: Fortran sammanhängande
