Repository: yeager/python-docs-sv
Catalog: c-api/buffer.po
Languages: sv

source: Buffer Protocol
sv: Buffertprotokoll

source: Certain objects available in Python wrap access to an underlying memory array or *buffer*. Such objects include the built-in :class:`bytes` and :class:`bytearray`, and some extension types like :class:`array.array`. Third-party libraries may define their own types for special purposes, such as image processing or numeric analysis.
sv: Vissa objekt som finns i Python ger tillgång till en underliggande minnesarray eller *buffer*. Sådana objekt inkluderar de inbyggda :class:`bytes` och :class:`bytearray`, och vissa tilläggstyper som :class:`array.array`. Tredjepartsbibliotek kan definiera sina egna typer för speciella ändamål, t.ex. bildbehandling eller numerisk analys.

source: While each of these types have their own semantics, they share the common characteristic of being backed by a possibly large memory buffer. It is then desirable, in some situations, to access that buffer directly and without intermediate copying.
sv: Även om var och en av dessa typer har sin egen semantik, har de den gemensamma egenskapen att de backas upp av en eventuellt stor minnesbuffert. I vissa situationer är det då önskvärt att komma åt den bufferten direkt och utan mellanliggande kopiering.

source: Python provides such a facility at the C and Python level in the form of the :ref:`buffer protocol <bufferobjects>`. This protocol has two sides:
sv: Python tillhandahåller en sådan möjlighet på C- och Python-nivå i form av :ref:`buffer protocol <bufferobjects>`. Detta protokoll har två sidor:

source: on the producer side, a type can export a "buffer interface" which allows objects of that type to expose information about their underlying buffer. This interface is described in the section :ref:`buffer-structs`; for Python see :ref:`python-buffer-protocol`.
sv: på producentsidan kan en typ exportera ett "buffertgränssnitt" som tillåter objekt av den typen att exponera information om sin underliggande buffert. Detta gränssnitt beskrivs i avsnittet :ref:`buffer-structs`; för Python se :ref:`python-buffer-protocol`.

source: on the consumer side, several means are available to obtain a pointer to the raw underlying data of an object (for example a method parameter). For Python see :class:`memoryview`.
sv: på konsumentsidan finns det flera sätt att få en pekare till de underliggande rådata för ett objekt (t.ex. en metodparameter). För Python se :class:`memoryview`.

source: Simple objects such as :class:`bytes` and :class:`bytearray` expose their underlying buffer in byte-oriented form. Other forms are possible; for example, the elements exposed by an :class:`array.array` can be multi-byte values.
sv: Enkla objekt som :class:`bytes` och :class:`bytearray` exponerar sin underliggande buffert i byteorienterad form. Andra former är möjliga; till exempel kan elementen som exponeras av en :class:`array.array` vara multibyte-värden.

source: An example consumer of the buffer interface is the :meth:`~io.BufferedIOBase.write` method of file objects: any object that can export a series of bytes through the buffer interface can be written to a file. While :meth:`!write` only needs read-only access to the internal contents of the object passed to it, other methods such as :meth:`~io.BufferedIOBase.readinto` need write access to the contents of their argument. The buffer interface allows objects to selectively allow or reject exporting of read-write and read-only buffers.
sv: Ett exempel på en användare av buffertgränssnittet är metoden :meth:`~io.BufferedIOBase.write` för filobjekt: alla objekt som kan exportera en serie byte genom buffertgränssnittet kan skrivas till en fil. Medan :meth:`!write` endast behöver skrivskyddad åtkomst till det interna innehållet i det objekt som skickas till den, behöver andra metoder som :meth:`~io.BufferedIOBase.readinto` skrivåtkomst till innehållet i sitt argument. Buffertgränssnittet gör det möjligt för objekt att selektivt tillåta eller avvisa export av skrivläsningsbuffertar och skrivskyddade buffertar.

source: There are two ways for a consumer of the buffer interface to acquire a buffer over a target object:
sv: Det finns två sätt för en användare av buffertgränssnittet att skaffa en buffert över ett målobjekt:

source: call :c:func:`PyObject_GetBuffer` with the right parameters;
sv: anropa :c:func:`PyObject_GetBuffer` med rätt parametrar;

source: call :c:func:`PyArg_ParseTuple` (or one of its siblings) with one of the ``y*``, ``w*`` or ``s*`` :ref:`format codes <arg-parsing>`.
sv: anropa :c:func:`PyArg_ParseTuple` (eller ett av dess syskon) med en av ``y*``, ``w*`` eller ``s*`` :ref:`formatkoder <arg-parsing>`.

source: In both cases, :c:func:`PyBuffer_Release` must be called when the buffer isn't needed anymore. Failure to do so could lead to various issues such as resource leaks.
sv: I båda fallen måste :c:func:`PyBuffer_Release` anropas när bufferten inte längre behövs. Om detta inte görs kan det leda till olika problem, t.ex. resursläckage.

source: The buffer protocol is now accessible in Python, see :ref:`python-buffer-protocol` and :class:`memoryview`.
sv: Buffertprotokollet är nu tillgängligt i Python, se :ref:`python-buffer-protocol` och :class:`memoryview`.

source: Buffer structure
sv: Buffertstruktur

source: Buffer structures (or simply "buffers") are useful as a way to expose the binary data from another object to the Python programmer. They can also be used as a zero-copy slicing mechanism. Using their ability to reference a block of memory, it is possible to expose any data to the Python programmer quite easily. The memory could be a large, constant array in a C extension, it could be a raw block of memory for manipulation before passing to an operating system library, or it could be used to pass around structured data in its native, in-memory format.
sv: Buffertstrukturer (eller helt enkelt "buffertar") är användbara som ett sätt att exponera binärdata från ett annat objekt till Python-programmeraren. De kan också användas som en nollkopieringsmekanism. Genom att använda deras förmåga att referera till ett minnesblock är det möjligt att exponera vilken data som helst för Python-programmeraren ganska enkelt. Minnet kan vara en stor, konstant array i ett C-tillägg, det kan vara ett råminnesblock för manipulation innan det skickas till ett operativsystembibliotek, eller det kan användas för att skicka runt strukturerade data i sitt ursprungliga format i minnet.

source: Contrary to most data types exposed by the Python interpreter, buffers are not :c:type:`PyObject` pointers but rather simple C structures. This allows them to be created and copied very simply. When a generic wrapper around a buffer is needed, a :ref:`memoryview <memoryview-objects>` object can be created.
sv: Till skillnad från de flesta datatyper som exponeras av Python-tolken är buffertar inte :c:type:`PyObject`-pekare utan snarare enkla C-strukturer. Detta gör att de kan skapas och kopieras mycket enkelt. När ett generiskt omslag runt en buffert behövs kan ett :ref:`memoryview <memoryview-objects>`-objekt skapas.

source: For short instructions how to write an exporting object, see :ref:`Buffer Object Structures <buffer-structs>`. For obtaining a buffer, see :c:func:`PyObject_GetBuffer`.
sv: För korta instruktioner om hur man skriver ett exporterande objekt, se :ref:`Buffer Object Structures <buffer-structs>`. För att hämta en buffert, se :c:func:`PyObject_GetBuffer`.

source: A pointer to the start of the logical structure described by the buffer fields. This can be any location within the underlying physical memory block of the exporter. For example, with negative :c:member:`~Py_buffer.strides` the value may point to the end of the memory block.
sv: En pekare till början av den logiska struktur som beskrivs av buffertfälten. Detta kan vara vilken plats som helst inom det underliggande fysiska minnesblocket hos exportören. Till exempel, med negativ :c:member:`~Py_buffer.strides` kan värdet peka till slutet av minnesblocket.

source: For :term:`contiguous` arrays, the value points to the beginning of the memory block.
sv: För :term:`contiguous` arrays pekar värdet på början av minnesblocket.

source: A new reference to the exporting object. The reference is owned by the consumer and automatically released (i.e. reference count decremented) and set to ``NULL`` by :c:func:`PyBuffer_Release`. The field is the equivalent of the return value of any standard C-API function.
sv: En ny referens till det exporterande objektet. Referensen ägs av konsumenten och frigörs automatiskt (d.v.s. referensantalet minskas) och sätts till ``NULL`` av :c:func:`PyBuffer_Release`. Fältet motsvarar returvärdet för vilken standard C-API-funktion som helst.

source: As a special case, for *temporary* buffers that are wrapped by :c:func:`PyMemoryView_FromBuffer` or :c:func:`PyBuffer_FillInfo` this field is ``NULL``. In general, exporting objects MUST NOT use this scheme.
sv: Som ett specialfall, för *temporära* buffertar som är omslutna av :c:func:`PyMemoryView_FromBuffer` eller :c:func:`PyBuffer_FillInfo` är detta fält ``NULL``. Generellt gäller att exporterande objekt INTE får använda detta schema.

source: ``product(shape) * itemsize``. For contiguous arrays, this is the length of the underlying memory block. For non-contiguous arrays, it is the length that the logical structure would have if it were copied to a contiguous representation.
sv: ``produkt(form) * artikelstorlek``. För sammanhängande arrayer är detta längden på det underliggande minnesblocket. För icke sammanhängande matriser är det den längd som den logiska strukturen skulle ha om den kopierades till en sammanhängande representation.

source: Accessing ``((char *)buf)[0] up to ((char *)buf)[len-1]`` is only valid if the buffer has been obtained by a request that guarantees contiguity. In most cases such a request will be :c:macro:`PyBUF_SIMPLE` or :c:macro:`PyBUF_WRITABLE`.
sv: Att komma åt ``((char *)buf)[0] upp till ((char *)buf)[len-1]`` är bara giltigt om bufferten har erhållits genom en begäran som garanterar sammanhängande. I de flesta fall kommer en sådan begäran att vara :c:macro:`PyBUF_SIMPLE` eller :c:macro:`PyBUF_WRITABLE`.

source: An indicator of whether the buffer is read-only. This field is controlled by the :c:macro:`PyBUF_WRITABLE` flag.
sv: En indikator på om bufferten är skrivskyddad. Detta fält styrs av :c:macro:`PyBUF_WRITABLE` flaggan.

source: Item size in bytes of a single element. Same as the value of :func:`struct.calcsize` called on non-``NULL`` :c:member:`~Py_buffer.format` values.
sv: Elementstorlek i bytes för ett enda element. Samma som värdet av :func:`struct.calcsize` som anropas på icke-``NULL`` :c:member:`~Py_buffer.format`-värden.

source: Important exception: If a consumer requests a buffer without the :c:macro:`PyBUF_FORMAT` flag, :c:member:`~Py_buffer.format` will be set to ``NULL``, but :c:member:`~Py_buffer.itemsize` still has the value for the original format.
sv: Viktigt undantag: Om en konsument begär en buffert utan :c:macro:`PyBUF_FORMAT` flaggan, kommer :c:member:`~Py_buffer.format` att sättas till ``NULL``, men :c:member:`~Py_buffer.itemsize` har fortfarande värdet för det ursprungliga formatet.

source: If :c:member:`~Py_buffer.shape` is present, the equality ``product(shape) * itemsize == len`` still holds and the consumer can use :c:member:`~Py_buffer.itemsize` to navigate the buffer.
sv: Om :c:member:`~Py_buffer.shape` är närvarande gäller fortfarande likheten ``product(shape) * itemsize == len`` och konsumenten kan använda :c:member:`~Py_buffer.itemsize` för att navigera i bufferten.

source: If :c:member:`~Py_buffer.shape` is ``NULL`` as a result of a :c:macro:`PyBUF_SIMPLE` or a :c:macro:`PyBUF_WRITABLE` request, the consumer must disregard :c:member:`~Py_buffer.itemsize` and assume ``itemsize == 1``.
sv: Om :c:member:`~Py_buffer.shape` är ``NULL`` som ett resultat av en :c:macro:`PyBUF_SIMPLE` eller en :c:macro:`PyBUF_WRITABLE` begäran, måste konsumenten bortse från :c:member:`~Py_buffer.itemsize` och anta ``itemsize == 1``.

source: A *NULL* terminated string in :mod:`struct` module style syntax describing the contents of a single item. If this is ``NULL``, ``"B"`` (unsigned bytes) is assumed.
sv: En *NULL*-terminerad sträng i :mod:`struct`-modulstilssyntax som beskriver innehållet i ett enda objekt. Om detta är ``NULL``, antas ``"B"`` (osignerade bytes).

source: This field is controlled by the :c:macro:`PyBUF_FORMAT` flag.
sv: Detta fält styrs av flaggan :c:macro:`PyBUF_FORMAT`.

source: The number of dimensions the memory represents as an n-dimensional array. If it is ``0``, :c:member:`~Py_buffer.buf` points to a single item representing a scalar. In this case, :c:member:`~Py_buffer.shape`, :c:member:`~Py_buffer.strides` and :c:member:`~Py_buffer.suboffsets` MUST be ``NULL``. The maximum number of dimensions is given by :c:macro:`PyBUF_MAX_NDIM`.
sv: Antalet dimensioner som minnet representerar som en n-dimensionell array. Om det är ``0`` pekar :c:member:`~Py_buffer.buf` på ett enda objekt som representerar en skalär. I detta fall MÅSTE :c:member:`~Py_buffer.shape`, :c:member:`~Py_buffer.strides` och :c:member:`~Py_buffer.suboffsets` vara ``NULL``. Det maximala antalet dimensioner anges av :c:macro:`PyBUF_MAX_NDIM`.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim` indicating the shape of the memory as an n-dimensional array. Note that ``shape[0] * ... * shape[ndim-1] * itemsize`` MUST be equal to :c:member:`~Py_buffer.len`.
sv: En array av :c:type:`Py_ssize_t` med längden :c:member:`~Py_buffer.ndim` som anger formen på minnet som en n-dimensionell array. Observera att ``shape[0] * ... * shape[ndim-1] * itemsize`` MÅSTE vara lika med :c:member:`~Py_buffer.len`.

source: Shape values are restricted to ``shape[n] >= 0``. The case ``shape[n] == 0`` requires special attention. See `complex arrays`_ for further information.
sv: Shape-värden är begränsade till ``shape[n] >= 0``. Fallet ``shape[n] == 0`` kräver särskild uppmärksamhet. Se `komplexa matriser`_ för ytterligare information.

source: The shape array is read-only for the consumer.
sv: Shape-arrayen är skrivskyddad för konsumenten.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim` giving the number of bytes to skip to get to a new element in each dimension.
sv: En array av :c:type:`Py_ssize_t` med längden :c:member:`~Py_buffer.ndim` som anger antalet bytes som ska hoppas över för att komma till ett nytt element i varje dimension.

source: Stride values can be any integer. For regular arrays, strides are usually positive, but a consumer MUST be able to handle the case ``strides[n] <= 0``. See `complex arrays`_ for further information.
sv: Stride-värden kan vara valfritt heltal. För vanliga arrayer är strides vanligtvis positiva, men en konsument MÅSTE kunna hantera fallet ``strides[n] <= 0``. Se `komplexa arrayer`_ för mer information.

source: The strides array is read-only for the consumer.
sv: Strides-arrayen är skrivskyddad för konsumenten.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim`. If ``suboffsets[n] >= 0``, the values stored along the nth dimension are pointers and the suboffset value dictates how many bytes to add to each pointer after de-referencing. A suboffset value that is negative indicates that no de-referencing should occur (striding in a contiguous memory block).
sv: En array av :c:type:`Py_ssize_t` med längden :c:member:`~Py_buffer.ndim`. Om ``suboffsets[n] >= 0`` är värdena som lagras längs den n:te dimensionen pekare och suboffset-värdet anger hur många byte som ska läggas till varje pekare efter de-referering. Ett negativt suboffset-värde anger att ingen de-referensering ska ske (striding i ett sammanhängande minnesblock).

source: If all suboffsets are negative (i.e. no de-referencing is needed), then this field must be ``NULL`` (the default value).
sv: Om alla suboffsets är negativa (dvs. ingen de-referensering behövs), måste detta fält vara ``NULL`` (standardvärdet).

source: This type of array representation is used by the Python Imaging Library (PIL). See `complex arrays`_ for further information how to access elements of such an array.
sv: Denna typ av matrisrepresentation används av Python Imaging Library (PIL). Se `komplexa arrayer`_ för mer information om hur du får tillgång till element i en sådan array.

source: The suboffsets array is read-only for the consumer.
sv: Suboffsets-arrayen är skrivskyddad för konsumenten.

source: This is for use internally by the exporting object. For example, this might be re-cast as an integer by the exporter and used to store flags about whether or not the shape, strides, and suboffsets arrays must be freed when the buffer is released. The consumer MUST NOT alter this value.
sv: Detta är för intern användning av det exporterande objektet. Det kan t.ex. omformas till ett heltal av exportören och användas för att lagra flaggor om huruvida arrayer med shape, strides och suboffsets måste frigöras när bufferten släpps. Konsumenten MÅSTE INTE ändra detta värde.

source: Constants:
sv: Konstanter:

source: The maximum number of dimensions the memory represents. Exporters MUST respect this limit, consumers of multi-dimensional buffers SHOULD be able to handle up to :c:macro:`!PyBUF_MAX_NDIM` dimensions. Currently set to 64.
sv: Det maximala antalet dimensioner som minnet representerar. Exportörer MÅSTE respektera denna gräns, konsumenter av flerdimensionella buffertar BÖR kunna hantera upp till :c:macro:`!PyBUF_MAX_NDIM` dimensioner. För närvarande satt till 64.

source: Buffer request types
sv: Typer av buffertförfrågningar

source: Buffers are usually obtained by sending a buffer request to an exporting object via :c:func:`PyObject_GetBuffer`. Since the complexity of the logical structure of the memory can vary drastically, the consumer uses the *flags* argument to specify the exact buffer type it can handle.
sv: Buffertar erhålls vanligtvis genom att skicka en buffertförfrågan till ett exporterande objekt via :c:func:`PyObject_GetBuffer`. Eftersom komplexiteten i minnets logiska struktur kan variera drastiskt använder konsumenten argumentet *flags* för att ange den exakta bufferttyp som den kan hantera.

source: All :c:type:`Py_buffer` fields are unambiguously defined by the request type.
sv: Alla fält i :c:type:`Py_buffer` definieras otvetydigt av typen av begäran.

source: request-independent fields
sv: fält oberoende av begäran

source: The following fields are not influenced by *flags* and must always be filled in with the correct values: :c:member:`~Py_buffer.obj`, :c:member:`~Py_buffer.buf`, :c:member:`~Py_buffer.len`, :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`.
sv: Följande fält påverkas inte av *flags* och måste alltid fyllas i med korrekta värden: :c:member:`~Py_buffer.obj`, :c:member:`~Py_buffer.buf`, :c:member:`~Py_buffer.len`, :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`.

source: readonly, format
sv: skrivskyddad, format

source: Controls the :c:member:`~Py_buffer.readonly` field. If set, the exporter MUST provide a writable buffer or else report failure. Otherwise, the exporter MAY provide either a read-only or writable buffer, but the choice MUST be consistent for all consumers. For example, :c:expr:`PyBUF_SIMPLE | PyBUF_WRITABLE` can be used to request a simple writable buffer.
sv: Kontrollerar fältet :c:member:`~Py_buffer.readonly`. Om det är inställt MÅSTE exportören tillhandahålla en skrivbar buffert, annars rapporteras fel. I annat fall KAN exportören tillhandahålla antingen en skrivskyddad eller skrivbar buffert, men valet MÅSTE vara konsekvent för alla konsumenter. Till exempel kan :c:expr:`PyBUF_SIMPLE | PyBUF_WRITABLE` användas för att begära en enkel skrivbar buffert.

source: Controls the :c:member:`~Py_buffer.format` field. If set, this field MUST be filled in correctly. Otherwise, this field MUST be ``NULL``.
sv: Kontrollerar fältet :c:member:`~Py_buffer.format`. Om det är inställt MÅSTE fältet fyllas i korrekt. Annars MÅSTE detta fält vara ``NULL``.

source: :c:macro:`PyBUF_WRITABLE` can be \|'d to any of the flags in the next section. Since :c:macro:`PyBUF_SIMPLE` is defined as 0, :c:macro:`PyBUF_WRITABLE` can be used as a stand-alone flag to request a simple writable buffer.
sv: :c:macro:`PyBUF_WRITABLE` kan kopplas till någon av flaggorna i nästa avsnitt. Eftersom :c:macro:`PyBUF_SIMPLE` är definierad som 0, kan :c:macro:`PyBUF_WRITABLE` användas som en fristående flagga för att begära en enkel skrivbar buffert.

source: :c:macro:`PyBUF_FORMAT` must be \|'d to any of the flags except :c:macro:`PyBUF_SIMPLE`, because the latter already implies format ``B`` (unsigned bytes). :c:macro:`!PyBUF_FORMAT` cannot be used on its own.
sv: :c:macro:`PyBUF_FORMAT` måste vara \|'d till någon av flaggorna utom :c:macro:`PyBUF_SIMPLE`, eftersom den senare redan implicerar format ``B`` (osignerade byte). :c:macro:`!PyBUF_FORMAT` kan inte användas på egen hand.

source: shape, strides, suboffsets
sv: form, strides, suboffsets

source: The flags that control the logical structure of the memory are listed in decreasing order of complexity. Note that each flag contains all bits of the flags below it.
sv: Flaggorna som styr minnets logiska struktur är listade i fallande ordning efter komplexitet. Observera att varje flagga innehåller alla bitar i flaggorna under den.

source: Request
sv: Förfrågan

source: shape
sv: form

source: strides
sv: steg

source: suboffsets
sv: delmängder

source: yes
sv: ja

source: if needed
sv: om det behövs

source: contiguity requests
sv: begäran om angränsning

source: C or Fortran :term:`contiguity <contiguous>` can be explicitly requested, with and without stride information. Without stride information, the buffer must be C-contiguous.
sv: C eller Fortran :term:`contiguity <contiguous>` kan uttryckligen begäras, med eller utan stride-information. Utan stride-information måste bufferten vara C-kontigu.

source: contig
sv: kontigent

source: C or F
sv: C eller F

source: :c:macro:`PyBUF_ND`
sv: :c:makro:`PyBUF_ND`

source: compound requests
sv: sammansatta förfrågningar

source: All possible requests are fully defined by some combination of the flags in the previous section. For convenience, the buffer protocol provides frequently used combinations as single flags.
sv: Alla möjliga förfrågningar definieras fullt ut av någon kombination av flaggorna i föregående avsnitt. För enkelhetens skull tillhandahåller buffertprotokollet ofta använda kombinationer som enskilda flaggor.

source: In the following table *U* stands for undefined contiguity. The consumer would have to call :c:func:`PyBuffer_IsContiguous` to determine contiguity.
sv: I följande tabell står *U* för undefined contiguity (odefinierad sammanhängande). Konsumenten måste anropa :c:func:`PyBuffer_IsContiguous` för att avgöra sammanhängande.

source: readonly
sv: skrivskyddad

source: 1 or 0
sv: 1 eller 0

source: Complex arrays
sv: Komplexa matriser

source: NumPy-style: shape and strides
sv: NumPy-stil: form och strides

source: The logical structure of NumPy-style arrays is defined by :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`, :c:member:`~Py_buffer.shape` and :c:member:`~Py_buffer.strides`.
sv: Den logiska strukturen för matriser i NumPy-stil definieras av :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`, :c:member:`~Py_buffer.shape` och :c:member:`~Py_buffer.strides`.
