Repository: yeager/python-docs-sv
Catalog: c-api/call.po
Languages: sv

source: Call Protocol
sv: Anropsprotokoll

source: CPython supports two different calling protocols: *tp_call* and vectorcall.
sv: CPython stöder två olika anropsprotokoll: *tp_call* och vectorcall.

source: The *tp_call* Protocol
sv: Protokollet *tp_call

source: Instances of classes that set :c:member:`~PyTypeObject.tp_call` are callable. The signature of the slot is::
sv: Instanser av klasser som sätter :c:member:`~PyTypeObject.tp_call` är anropsbara. Signaturen för denna slot är::

source: A call is made using a tuple for the positional arguments and a dict for the keyword arguments, similarly to ``callable(*args, **kwargs)`` in Python code. *args* must be non-NULL (use an empty tuple if there are no arguments) but *kwargs* may be *NULL* if there are no keyword arguments.
sv: Ett anrop görs med hjälp av en tuple för de positionella argumenten och en dict för nyckelordsargumenten, på samma sätt som ``callable(*args, **kwargs)`` i Python-kod. *args* måste vara icke-NULL (använd en tom tupel om det inte finns några argument) men *kwargs* kan vara *NULL* om det inte finns några nyckelordsargument.

source: This convention is not only used by *tp_call*: :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_init` also pass arguments this way.
sv: Denna konvention används inte bara av *tp_call*: :c:member:`~PyTypeObject.tp_new` och :c:member:`~PyTypeObject.tp_init` skickar också argument på detta sätt.

source: To call an object, use :c:func:`PyObject_Call` or another :ref:`call API <capi-call>`.
sv: För att anropa ett objekt använder du :c:func:`PyObject_Call` eller en annan :ref:`call API <capi-call>`.

source: The Vectorcall Protocol
sv: Vectorcall-protokollet

source: The vectorcall protocol was introduced in :pep:`590` as an additional protocol for making calls more efficient.
sv: Protokollet vectorcall introducerades i :pep:`590` som ett tilläggsprotokoll för att göra anrop mer effektiva.

source: As rule of thumb, CPython will prefer the vectorcall for internal calls if the callable supports it. However, this is not a hard rule. Additionally, some third-party extensions use *tp_call* directly (rather than using :c:func:`PyObject_Call`). Therefore, a class supporting vectorcall must also implement :c:member:`~PyTypeObject.tp_call`. Moreover, the callable must behave the same regardless of which protocol is used. The recommended way to achieve this is by setting :c:member:`~PyTypeObject.tp_call` to :c:func:`PyVectorcall_Call`. This bears repeating:
sv: Som tumregel kommer CPython att föredra vectorcall för interna anrop om den anropbara funktionen stöder det. Detta är dock inte en hård regel. Dessutom använder vissa tredjepartstillägg *tp_call* direkt (snarare än att använda :c:func:`PyObject_Call`). Därför måste en klass som stöder vectorcall också implementera :c:member:`~PyTypeObject.tp_call`. Dessutom måste den anropbara funktionen bete sig likadant oavsett vilket protokoll som används. Det rekommenderade sättet att uppnå detta är att sätta :c:member:`~PyTypeObject.tp_call` till :c:func:`PyVectorcall_Call`. Detta tål att upprepas:

source: A class supporting vectorcall **must** also implement :c:member:`~PyTypeObject.tp_call` with the same semantics.
sv: En klass som stöder vectorcall **måste** också implementera :c:member:`~PyTypeObject.tp_call` med samma semantik.

source: The :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flag is now removed from a class when the class's :py:meth:`~object.__call__` method is reassigned. (This internally sets :c:member:`~PyTypeObject.tp_call` only, and thus may make it behave differently than the vectorcall function.) In earlier Python versions, vectorcall should only be used with :c:macro:`immutable <Py_TPFLAGS_IMMUTABLETYPE>` or static types.
sv: Flaggan :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` tas nu bort från en klass när klassens metod :py:meth:`~object.__call__` tilldelas på nytt. (Detta sätter internt :c:member:`~PyTypeObject.tp_call` endast, och kan därmed få den att bete sig annorlunda än vectorcall-funktionen) I tidigare Python-versioner bör vectorcall endast användas med :c:macro:`immutable <Py_TPFLAGS_IMMUTABLETYPE>` eller statiska typer.

source: A class should not implement vectorcall if that would be slower than *tp_call*. For example, if the callee needs to convert the arguments to an args tuple and kwargs dict anyway, then there is no point in implementing vectorcall.
sv: En klass bör inte implementera vectorcall om det skulle vara långsammare än *tp_call*. Om den som ringer till exempel ändå måste konvertera argumenten till en args-tupel och kwargs-dict, finns det ingen anledning att implementera vectorcall.

source: Classes can implement the vectorcall protocol by enabling the :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flag and setting :c:member:`~PyTypeObject.tp_vectorcall_offset` to the offset inside the object structure where a *vectorcallfunc* appears. This is a pointer to a function with the following signature:
sv: Klasser kan implementera vectorcall-protokollet genom att aktivera flaggan :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` och sätta :c:member:`~PyTypeObject.tp_vectorcall_offset` till den offset i objektstrukturen där en *vectorcallfunc* visas. Detta är en pekare till en funktion med följande signatur:

source: *callable* is the object being called.
sv: *callable* är det objekt som anropas.

source: *args* is a C array consisting of the positional arguments followed by the
sv: *args* är en C-matris som består av de positionella argumenten följt av

source: values of the keyword arguments. This can be *NULL* if there are no arguments.
sv: värden för nyckelordets argument. Detta kan vara *NULL* om det inte finns några argument.

source: *nargsf* is the number of positional arguments plus possibly the
sv: *nargsf* är antalet positionella argument plus eventuellt

source: :c:macro:`PY_VECTORCALL_ARGUMENTS_OFFSET` flag. To get the actual number of positional arguments from *nargsf*, use :c:func:`PyVectorcall_NARGS`.
sv: :c:macro:`PY_VECTORCALL_ARGUMENTS_OFFSET` flagga. För att få det faktiska antalet positionella argument från *nargsf*, använd :c:func:`PyVectorcall_NARGS`.

source: *kwnames* is a tuple containing the names of the keyword arguments;
sv: *kwnames* är en tupel som innehåller namnen på nyckelordsargumenten;

source: in other words, the keys of the kwargs dict. These names must be strings (instances of ``str`` or a subclass) and they must be unique. If there are no keyword arguments, then *kwnames* can instead be *NULL*.
sv: med andra ord, nycklarna i kwargs-diktatet. Dessa namn måste vara strängar (instanser av ``str`` eller en underklass) och de måste vara unika. Om det inte finns några nyckelordsargument kan *kwnames* i stället vara *NULL*.

source: If this flag is set in a vectorcall *nargsf* argument, the callee is allowed to temporarily change ``args[-1]``. In other words, *args* points to argument 1 (not 0) in the allocated vector. The callee must restore the value of ``args[-1]`` before returning.
sv: Om denna flagga är satt i ett vectorcall *nargsf*-argument, tillåts den som ringer att tillfälligt ändra ``args[-1]``. Med andra ord pekar *args* på argument 1 (inte 0) i den allokerade vektorn. Den anropade måste återställa värdet på ``args[-1]`` innan den returnerar.

source: For :c:func:`PyObject_VectorcallMethod`, this flag means instead that ``args[0]`` may be changed.
sv: För :c:func:`PyObject_VectorcallMethod` betyder denna flagga istället att ``args[0]`` kan ändras.

source: Whenever they can do so cheaply (without additional allocation), callers are encouraged to use :c:macro:`PY_VECTORCALL_ARGUMENTS_OFFSET`. Doing so will allow callables such as bound methods to make their onward calls (which include a prepended *self* argument) very efficiently.
sv: När de kan göra det billigt (utan ytterligare allokering), uppmuntras anropare att använda :c:macro:`PY_VECTORCALL_ARGUMENTS_OFFSET`. Detta gör det möjligt för anropbara objekt som bundna metoder att göra sina vidare anrop (som inkluderar ett föranslutet *self*-argument) mycket effektivt.

source: To call an object that implements vectorcall, use a :ref:`call API <capi-call>` function as with any other callable. :c:func:`PyObject_Vectorcall` will usually be most efficient.
sv: För att anropa ett objekt som implementerar vectorcall, använd en :ref:`call API <capi-call>`-funktion som med alla andra anropbara. :c:func:`PyObject_Vectorcall` kommer vanligtvis att vara mest effektivt.

source: Recursion Control
sv: Kontroll av rekursion

source: When using *tp_call*, callees do not need to worry about :ref:`recursion <recursion>`: CPython uses :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` for calls made using *tp_call*.
sv: När *tp_call* används behöver anropare inte oroa sig för :ref:`recursion <recursion>`: CPython använder :c:func:`Py_EnterRecursiveCall` och :c:func:`Py_LeaveRecursiveCall` för anrop som görs med *tp_call*.

source: For efficiency, this is not the case for calls done using vectorcall: the callee should use *Py_EnterRecursiveCall* and *Py_LeaveRecursiveCall* if needed.
sv: Av effektivitetsskäl är detta inte fallet för anrop som görs med vectorcall: den anropande parten bör använda *Py_EnterRecursiveCall* och *Py_LeaveRecursiveCall* vid behov.

source: Vectorcall Support API
sv: API för Vectorcall-stöd

source: Given a vectorcall *nargsf* argument, return the actual number of arguments. Currently equivalent to::
sv: Givet ett vectorcall *nargsf*-argument, returnerar det faktiska antalet argument. För närvarande likvärdig med::

source: However, the function ``PyVectorcall_NARGS`` should be used to allow for future extensions.
sv: Funktionen ``PyVectorcall_NARGS`` bör dock användas för att möjliggöra framtida tillägg.

source: If *op* does not support the vectorcall protocol (either because the type does not or because the specific instance does not), return *NULL*. Otherwise, return the vectorcall function pointer stored in *op*. This function never raises an exception.
sv: Om *op* inte stöder vectorcall-protokollet (antingen för att typen inte gör det eller för att den specifika instansen inte gör det), returneras *NULL*. I annat fall returneras pekaren för vectorcall-funktionen som lagrats i *op*. Denna funktion ger aldrig upphov till ett undantag.

source: This is mostly useful to check whether or not *op* supports vectorcall, which can be done by checking ``PyVectorcall_Function(op) != NULL``.
sv: Detta är mest användbart för att kontrollera om *op* stöder vectorcall eller inte, vilket kan göras genom att kontrollera ``PyVectorcall_Function(op) != NULL``.

source: Call *callable*'s :c:type:`vectorcallfunc` with positional and keyword arguments given in a tuple and dict, respectively.
sv: Anropa *callable*:s :c:type:`vectorcallfunc` med positions- och nyckelordsargument som anges i en tuple respektive dict.

source: This is a specialized function, intended to be put in the :c:member:`~PyTypeObject.tp_call` slot or be used in an implementation of ``tp_call``. It does not check the :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flag and it does not fall back to ``tp_call``.
sv: Detta är en specialiserad funktion, avsedd att placeras i :c:member:`~PyTypeObject.tp_call` slot eller användas i en implementation av ``tp_call``. Den kontrollerar inte :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flaggan och den faller inte tillbaka till ``tp_call``.

source: Object Calling API
sv: API för objektanrop

source: Various functions are available for calling a Python object. Each converts its arguments to a convention supported by the called object – either *tp_call* or vectorcall. In order to do as little conversion as possible, pick one that best fits the format of data you have available.
sv: Olika funktioner finns tillgängliga för att anropa ett Python-objekt. Varje funktion konverterar sina argument till en konvention som stöds av det anropade objektet - antingen *tp_call* eller vectorcall. För att göra så lite konvertering som möjligt, välj den som bäst passar det dataformat du har tillgängligt.

source: The following table summarizes the available functions; please see individual documentation for details.
sv: I följande tabell sammanfattas de tillgängliga funktionerna; för mer information, se respektive dokumentation.

source: Function
sv: Funktion

source: callable
sv: anropsbar

source: tuple
sv: tupel

source: 1 object
sv: 1 objekt

source: variadic
sv: variadisk

source: obj + name
sv: obj + namn

source: vectorcall
sv: vektoranrop

source: arg + name
sv: arg + namn

source: Call a callable Python object *callable*, with arguments given by the tuple *args*, and named arguments given by the dictionary *kwargs*.
sv: Anropa ett anropbart Python-objekt *callable*, med argument som anges av tupeln *args* och namngivna argument som anges av ordlistan *kwargs*.

source: *args* must not be *NULL*; use an empty tuple if no arguments are needed. If no named arguments are needed, *kwargs* can be *NULL*.
sv: *args* får inte vara *NULL*; använd en tom tupel om inga argument behövs. Om inga namngivna argument behövs kan *kwargs* vara *NULL*.

source: Return the result of the call on success, or raise an exception and return *NULL* on failure.
sv: Returnera resultatet av anropet om det lyckas, eller skapa ett undantag och returnera *NULL* om det misslyckas.

source: This is the equivalent of the Python expression: ``callable(*args, **kwargs)``.
sv: Detta är motsvarigheten till Python-uttrycket: ``callable(*args, **kwargs)``.

source: Call a callable Python object *callable* without any arguments. It is the most efficient way to call a callable Python object without any argument.
sv: Anropa ett anropsbart Python-objekt *callable* utan några argument. Det är det mest effektiva sättet att anropa ett anropbart Python-objekt utan argument.

source: Call a callable Python object *callable* with exactly 1 positional argument *arg* and no keyword arguments.
sv: Anropa ett anropbart Python-objekt *callable* med exakt 1 positionellt argument *arg* och inga nyckelordsargument.

source: Call a callable Python object *callable*, with arguments given by the tuple *args*. If no arguments are needed, then *args* can be *NULL*.
sv: Anropar ett anropbart Python-objekt *callable*, med argument som ges av tupeln *args*. Om inga argument behövs kan *args* vara *NULL*.

source: This is the equivalent of the Python expression: ``callable(*args)``.
sv: Detta är motsvarigheten till Python-uttrycket: ``callable(*args)``.

source: Call a callable Python object *callable*, with a variable number of C arguments. The C arguments are described using a :c:func:`Py_BuildValue` style format string. The format can be *NULL*, indicating that no arguments are provided.
sv: Anropar ett anropsbart Python-objekt *callable*, med ett variabelt antal C-argument. C-argumenten beskrivs med hjälp av en formatsträng av typen :c:func:`Py_BuildValue`. Formatet kan vara *NULL*, vilket indikerar att inga argument tillhandahålls.

source: Note that if you only pass :c:expr:`PyObject *` args, :c:func:`PyObject_CallFunctionObjArgs` is a faster alternative.
sv: Observera att om du bara skickar :c:expr:`PyObject *` args, är :c:func:`PyObject_CallFunctionObjArgs` ett snabbare alternativ.

source: The type of *format* was changed from ``char *``.
sv: Typen av *format* ändrades från ``char *``.

source: Call the method named *name* of object *obj* with a variable number of C arguments. The C arguments are described by a :c:func:`Py_BuildValue` format string that should produce a tuple.
sv: Anropa metoden med namnet *name* för objektet *obj* med ett variabelt antal C-argument. C-argumenten beskrivs av en :c:func:`Py_BuildValue`-formatsträng som ska producera en tupel.

source: The format can be *NULL*, indicating that no arguments are provided.
sv: Formatet kan vara *NULL*, vilket indikerar att inga argument anges.

source: This is the equivalent of the Python expression: ``obj.name(arg1, arg2, ...)``.
sv: Detta är motsvarigheten till Python-uttrycket: ``obj.name(arg1, arg2, ...)``.

source: Note that if you only pass :c:expr:`PyObject *` args, :c:func:`PyObject_CallMethodObjArgs` is a faster alternative.
sv: Observera att om du bara skickar :c:expr:`PyObject *` args, är :c:func:`PyObject_CallMethodObjArgs` ett snabbare alternativ.

source: The types of *name* and *format* were changed from ``char *``.
sv: Typerna *name* och *format* ändrades från ``char *``.

source: Call a callable Python object *callable*, with a variable number of :c:expr:`PyObject *` arguments. The arguments are provided as a variable number of parameters followed by *NULL*.
sv: Anropar ett anropbart Python-objekt *callable*, med ett variabelt antal :c:expr:`PyObject *`-argument. Argumenten tillhandahålls som ett variabelt antal parametrar följt av *NULL*.

source: This is the equivalent of the Python expression: ``callable(arg1, arg2, ...)``.
sv: Detta är motsvarigheten till Python-uttrycket: ``callable(arg1, arg2, ...)``.

source: Call a method of the Python object *obj*, where the name of the method is given as a Python string object in *name*. It is called with a variable number of :c:expr:`PyObject *` arguments. The arguments are provided as a variable number of parameters followed by *NULL*.
sv: Anropar en metod för Python-objektet *obj*, där namnet på metoden anges som ett Python-strängobjekt i *name*. Den anropas med ett variabelt antal :c:expr:`PyObject *`-argument. Argumenten ges som ett variabelt antal parametrar följt av *NULL*.

source: Call a method of the Python object *obj* without arguments, where the name of the method is given as a Python string object in *name*.
sv: Anropa en metod för Python-objektet *obj* utan argument, där namnet på metoden anges som ett Python-strängobjekt i *name*.

source: Call a method of the Python object *obj* with a single positional argument *arg*, where the name of the method is given as a Python string object in *name*.
sv: Anropa en metod för Python-objektet *obj* med ett enda positionellt argument *arg*, där namnet på metoden anges som ett Python-strängobjekt i *name*.

source: Call a callable Python object *callable*. The arguments are the same as for :c:type:`vectorcallfunc`. If *callable* supports vectorcall_, this directly calls the vectorcall function stored in *callable*.
sv: Anropar ett anropsbart Python-objekt *callable*. Argumenten är desamma som för :c:type:`vectorcallfunc`. Om *callable* stöder vectorcall_, anropas direkt vectorcall-funktionen som finns lagrad i *callable*.

source: Call *callable* with positional arguments passed exactly as in the vectorcall_ protocol, but with keyword arguments passed as a dictionary *kwdict*. The *args* array contains only the positional arguments.
sv: Anropa *callable* med positionella argument som skickas exakt som i vectorcall_-protokollet, men med nyckelordsargument som skickas som en ordbok *kwdict*. Arrayen *args* innehåller endast de positionella argumenten.

source: Regardless of which protocol is used internally, a conversion of arguments needs to be done. Therefore, this function should only be used if the caller already has a dictionary ready to use for the keyword arguments, but not a tuple for the positional arguments.
sv: Oavsett vilket protokoll som används internt måste en konvertering av argumenten göras. Därför bör denna funktion endast användas om anroparen redan har en ordbok som är klar att användas för nyckelordsargumenten, men inte en tupel för positionsargumenten.

source: Call a method using the vectorcall calling convention. The name of the method is given as a Python string *name*. The object whose method is called is *args[0]*, and the *args* array starting at *args[1]* represents the arguments of the call. There must be at least one positional argument. *nargsf* is the number of positional arguments including *args[0]*, plus :c:macro:`PY_VECTORCALL_ARGUMENTS_OFFSET` if the value of ``args[0]`` may temporarily be changed. Keyword arguments can be passed just like in :c:func:`PyObject_Vectorcall`.
sv: Anropar en metod med hjälp av anropskonventionen vectorcall. Namnet på metoden anges som en Python-sträng *name*. Objektet vars metod anropas är *args[0]*, och *args*-arrayen som börjar på *args[1]* representerar argumenten för anropet. Det måste finnas minst ett positionellt argument. *nargsf* är antalet positionella argument inklusive *args[0]*, plus :c:macro:`PY_VECTORCALL_ARGUMENTS_OFFSET` om värdet på ``args[0]`` tillfälligt kan ändras. Nyckelord-argument kan skickas precis som i :c:func:`PyObject_Vectorcall`.

source: If the object has the :c:macro:`Py_TPFLAGS_METHOD_DESCRIPTOR` feature, this will call the unbound method object with the full *args* vector as arguments.
sv: Om objektet har funktionen :c:macro:`Py_TPFLAGS_METHOD_DESCRIPTOR`, kommer detta att anropa det obundna metodobjektet med hela *args*-vektorn som argument.

source: Call Support API
sv: API för samtalsstöd

source: Determine if the object *o* is callable. Return ``1`` if the object is callable and ``0`` otherwise. This function always succeeds.
sv: Bestäm om objektet *o* är anropsbart. Returnerar ``1`` om objektet är anropbart och ``0`` annars. Denna funktion lyckas alltid.
