Repository: yeager/python-docs-sv
Catalog: c-api/cell.po
Languages: sv

source: Cell Objects
sv: Cellobjekt

source: "Cell" objects are used to implement variables referenced by multiple scopes. For each such variable, a cell object is created to store the value; the local variables of each stack frame that references the value contains a reference to the cells from outer scopes which also use that variable. When the value is accessed, the value contained in the cell is used instead of the cell object itself. This de-referencing of the cell object requires support from the generated byte-code; these are not automatically de-referenced when accessed. Cell objects are not likely to be useful elsewhere.
sv: "Cell"-objekt används för att implementera variabler som refereras av flera scopes. För varje sådan variabel skapas ett cellobjekt för att lagra värdet; de lokala variablerna i varje stackram som refererar till värdet innehåller en referens till de celler från yttre scopes som också använder variabeln. När värdet hämtas används värdet i cellen i stället för cellobjektet självt. Denna de-referering av cellobjektet kräver stöd från den genererade bytekoden; dessa de-refereras inte automatiskt vid åtkomst. Cellobjekt kommer sannolikt inte att vara användbara på andra ställen.

source: The C structure used for cell objects.
sv: Den C-struktur som används för cellobjekt.

source: The type object corresponding to cell objects.
sv: Typobjekt som motsvarar cellobjekt.

source: Return true if *ob* is a cell object; *ob* must not be ``NULL``. This function always succeeds.
sv: Returnerar true om *ob* är ett cellobjekt; *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.

source: Create and return a new cell object containing the value *ob*. The parameter may be ``NULL``.
sv: Skapar och returnerar ett nytt cellobjekt som innehåller värdet *ob*. Parametern kan vara ``NULL``.

source: Return the contents of the cell *cell*, which can be ``NULL``. If *cell* is not a cell object, returns ``NULL`` with an exception set.
sv: Returnerar innehållet i cellen *cell*, som kan vara ``NULL``. Om *cell* inte är ett cellobjekt returneras ``NULL`` med en undantagsuppsättning.

source: Return the contents of the cell *cell*, but without checking that *cell* is non-``NULL`` and a cell object.
sv: Returnerar innehållet i cellen *cell*, men utan att kontrollera att *cell* inte är ``NULL`` och ett cellobjekt.

source: Set the contents of the cell object *cell* to *value*. This releases the reference to any current content of the cell. *value* may be ``NULL``. *cell* must be non-``NULL``.
sv: Ställ in innehållet i cellobjektet *cell* till *värde*. Detta frigör referensen till eventuellt aktuellt innehåll i cellen. *value* kan vara ``NULL``. *cell* måste vara icke-``NULL``.

source: On success, return ``0``. If *cell* is not a cell object, set an exception and return ``-1``.
sv: Vid framgång returneras ``0``. Om *cell* inte är ett cellobjekt, anges ett undantag och returen blir ``-1``.

source: Sets the value of the cell object *cell* to *value*. No reference counts are adjusted, and no checks are made for safety; *cell* must be non-``NULL`` and must be a cell object.
sv: Sätter värdet på cellobjektet *cell* till *värde*. Inga referensräkningar justeras och inga kontroller görs för säkerhet; *cell* måste vara icke-``NULL`` och måste vara ett cellobjekt.
