Repository: yeager/python-docs-sv
Catalog: c-api/extension-modules.po
Languages: sv

source: Defining extension modules
sv: Definiera tilläggsmoduler

source: A C extension for CPython is a shared library (for example, a ``.so`` file on Linux, ``.pyd`` DLL on Windows), which is loadable into the Python process (for example, it is compiled with compatible compiler settings), and which exports an :ref:`initialization function <extension-export-hook>`.
sv: Ett C-tillägg för CPython är ett delat bibliotek (till exempel en ``.so``-fil på Linux, ``.pyd`` DLL på Windows), som kan laddas in i Python-processen (till exempel kompileras den med kompatibla kompilatorinställningar) och som exporterar en :ref:`initialiseringsfunktion <extension-export-hook>`.

source: To be importable by default (that is, by :py:class:`importlib.machinery.ExtensionFileLoader`), the shared library must be available on :py:attr:`sys.path`, and must be named after the module name plus an extension listed in :py:attr:`importlib.machinery.EXTENSION_SUFFIXES`.
sv: För att kunna importeras som standard (dvs. av :py:class:`importlib.machinery.ExtensionFileLoader`) måste det delade biblioteket finnas tillgängligt på :py:attr:`sys.path` och ha namn efter modulnamnet plus ett tillägg som anges i :py:attr:`importlib.machinery.EXTENSION_SUFFIXES`.

source: Building, packaging and distributing extension modules is best done with third-party tools, and is out of scope of this document. One suitable tool is Setuptools, whose documentation can be found at https://setuptools.pypa.io/en/latest/setuptools.html.
sv: Att bygga, paketera och distribuera tilläggsmoduler görs bäst med verktyg från tredje part och omfattas inte av det här dokumentet. Ett lämpligt verktyg är Setuptools, vars dokumentation finns på https://setuptools.pypa.io/en/latest/setuptools.html.

source: Normally, the initialization function returns a module definition initialized using :c:func:`PyModuleDef_Init`. This allows splitting the creation process into several phases:
sv: Normalt returnerar initialiseringsfunktionen en moduldefinition som initierats med hjälp av :c:func:`PyModuleDef_Init`. Detta gör det möjligt att dela upp skapandeprocessen i flera faser:

source: Before any substantial code is executed, Python can determine which capabilities the module supports, and it can adjust the environment or refuse loading an incompatible extension.
sv: Innan någon väsentlig kod exekveras kan Python avgöra vilka funktioner som modulen stöder, och den kan anpassa miljön eller vägra att ladda ett inkompatibelt tillägg.

source: By default, Python itself creates the module object -- that is, it does the equivalent of :py:meth:`object.__new__` for classes. It also sets initial attributes like :attr:`~module.__package__` and :attr:`~module.__loader__`.
sv: Som standard skapar Python själv modulobjektet - det vill säga, det gör motsvarande :py:meth:`object.__new__` för klasser. Den ställer också in initiala attribut som :attr:`~module.__package__` och :attr:`~module.__loader__`.

source: Afterwards, the module object is initialized using extension-specific code -- the equivalent of :py:meth:`~object.__init__` on classes.
sv: Därefter initieras modulobjektet med hjälp av tilläggsspecifik kod -- motsvarande :py:meth:`~object.__init__` för klasser.

source: This is called *multi-phase initialization* to distinguish it from the legacy (but still supported) *single-phase initialization* scheme, where the initialization function returns a fully constructed module. See the :ref:`single-phase-initialization section below <single-phase-initialization>` for details.
sv: Detta kallas *multifasinitialisering* för att skilja det från det äldre (men fortfarande stödda) *enfasinitialiserings*schemat, där initialiseringsfunktionen returnerar en helt konstruerad modul. Se :ref:`avsnittet om enfasinitialisering under <single-phase-initialization>` för mer information.

source: Added support for multi-phase initialization (:pep:`489`).
sv: Lagt till stöd för flerfasinitialisering (:pep:`489`).

source: Multiple module instances
sv: Flera modulinstanser

source: By default, extension modules are not singletons. For example, if the :py:attr:`sys.modules` entry is removed and the module is re-imported, a new module object is created, and typically populated with fresh method and type objects. The old module is subject to normal garbage collection. This mirrors the behavior of pure-Python modules.
sv: Som standard är tilläggsmoduler inte singletons. Om till exempel :py:attr:`sys.modules`-posten tas bort och modulen importeras på nytt, skapas ett nytt modulobjekt som vanligtvis fylls på med nya metod- och typobjekt. Den gamla modulen är föremål för normal skräpinsamling. Detta speglar beteendet hos rena Python-moduler.

source: Additional module instances may be created in :ref:`sub-interpreters <sub-interpreter-support>` or after Python runtime reinitialization (:c:func:`Py_Finalize` and :c:func:`Py_Initialize`). In these cases, sharing Python objects between module instances would likely cause crashes or undefined behavior.
sv: Ytterligare modulinstanser kan skapas i :ref:`sub-interpreters <sub-interpreter-support>` eller efter ominitialisering av Python-körtiden (:c:func:`Py_Finalize` och :c:func:`Py_Initialize`). I dessa fall skulle delning av Python-objekt mellan modulinstanser sannolikt orsaka krascher eller odefinierat beteende.

source: To avoid such issues, each instance of an extension module should be *isolated*: changes to one instance should not implicitly affect the others, and all state owned by the module, including references to Python objects, should be specific to a particular module instance. See :ref:`isolating-extensions-howto` for more details and a practical guide.
sv: För att undvika sådana problem bör varje instans av en tilläggsmodul vara *isolerad*: ändringar i en instans bör inte implicit påverka de andra, och allt tillstånd som ägs av modulen, inklusive referenser till Python-objekt, bör vara specifikt för en viss modulinstans. Se :ref:`isolating-extensions-howto` för mer information och en praktisk guide.

source: A simpler way to avoid these issues is :ref:`raising an error on repeated initialization <isolating-extensions-optout>`.
sv: Ett enklare sätt att undvika dessa problem är :ref:`raising an error on repeated initialization <isolating-extensions-optout>`.

source: All modules are expected to support :ref:`sub-interpreters <sub-interpreter-support>`, or otherwise explicitly signal a lack of support. This is usually achieved by isolation or blocking repeated initialization, as above. A module may also be limited to the main interpreter using the :c:data:`Py_mod_multiple_interpreters` slot.
sv: Alla moduler förväntas ha stöd för :ref:`sub-interpreters <sub-interpreter-support>`, eller på annat sätt uttryckligen signalera att stöd saknas. Detta uppnås vanligtvis genom isolering eller blockering av upprepad initialisering, enligt ovan. En modul kan också begränsas till huvudtolken med hjälp av :c:data:`Py_mod_multiple_interpreters` slot.

source: Initialization function
sv: Initialiseringsfunktion

source: The initialization function defined by an extension module has the following signature:
sv: Den initialiseringsfunktion som definieras av en tilläggsmodul har följande signatur:

source: Its name should be :samp:`PyInit_{<name>}`, with ``<name>`` replaced by the name of the module.
sv: Dess namn bör vara :samp:`PyInit_{<name>}`, med ``<name>`` ersatt av namnet på modulen.

source: For modules with ASCII-only names, the function must instead be named :samp:`PyInit_{<name>}`, with ``<name>`` replaced by the name of the module. When using :ref:`multi-phase-initialization`, non-ASCII module names are allowed. In this case, the initialization function name is :samp:`PyInitU_{<name>}`, with ``<name>`` encoded using Python's *punycode* encoding with hyphens replaced by underscores. In Python:
sv: För moduler med ASCII-namn måste funktionen istället heta :samp:`PyInit_{<name>}`, med ``<name>`` ersatt av modulens namn. Vid användning av :ref:`multi-phase-initialization` är modulnamn som inte är ASCII tillåtna. I detta fall är namnet på initialiseringsfunktionen :samp:`PyInitU_{<name>}`, med ``<name>`` kodat med Pythons *punycode*-kodning med bindestreck ersatta av understreck. I Python:

source: def initfunc_name(name): try: suffix = b'_' + name.encode('ascii') except UnicodeEncodeError: suffix = b'U_' + name.encode('punycode').replace(b'-', b'_') return b'PyInit' + suffix
sv: def initfunc_name(namn): try: suffix = b'_' + name.encode('ascii') except UnicodeEncodeError: suffix = b'U_' + name.encode('punycode').replace(b'-', b'_') return b'PyInit' + suffix

source: It is recommended to define the initialization function using a helper macro:
sv: Vi rekommenderar att du definierar initialiseringsfunktionen med hjälp av ett hjälpmakro:

source: Declare an extension module initialization function. This macro:
sv: Deklarera en initialiseringsfunktion för en tilläggsmodul. Detta makro:

source: specifies the :c:expr:`PyObject*` return type,
sv: anger returtypen :c:expr:`PyObject*`,

source: adds any special linkage declarations required by the platform, and
sv: lägger till eventuella speciella länkdeklarationer som krävs av plattformen, och

source: for C++, declares the function as ``extern "C"``.
sv: för C++, deklarerar funktionen som ``extern "C"``.

source: For example, a module called ``spam`` would be defined like this::
sv: Till exempel skulle en modul som heter ``spam`` definieras på följande sätt::

source: It is possible to export multiple modules from a single shared library by defining multiple initialization functions. However, importing them requires using symbolic links or a custom importer, because by default only the function corresponding to the filename is found. See the `Multiple modules in one library <https://peps.python.org/pep-0489/#multiple-modules-in-one-library>`__ section in :pep:`489` for details.
sv: Det är möjligt att exportera flera moduler från ett enda delat bibliotek genom att definiera flera initialiseringsfunktioner. För att importera dem måste man dock använda symboliska länkar eller en anpassad importör, eftersom endast den funktion som motsvarar filnamnet hittas som standard. Se avsnittet `Flera moduler i ett bibliotek <https://peps.python.org/pep-0489/#multiple-modules-in-one-library>`__ i :pep:`489` för mer information.

source: The initialization function is typically the only non-\ ``static`` item defined in the module's C source.
sv: Initialiseringsfunktionen är vanligtvis det enda icke-statiska objektet som definieras i modulens C-källa.

source: Multi-phase initialization
sv: Initialisering i flera faser

source: Normally, the :ref:`initialization function <extension-export-hook>` (``PyInit_modulename``) returns a :c:type:`PyModuleDef` instance with non-``NULL`` :c:member:`~PyModuleDef.m_slots`. Before it is returned, the ``PyModuleDef`` instance must be initialized using the following function:
sv: Normalt returnerar :ref:`initialiseringsfunktionen <extension-export-hook>` (``PyInit_modulename``) en :c:type:`PyModuleDef`-instans med icke-``NULL`` :c:member:`~PyModuleDef.m_slots`. Innan den returneras måste ``PyModuleDef``-instansen initialiseras med hjälp av följande funktion:

source: Ensure a module definition is a properly initialized Python object that correctly reports its type and a reference count.
sv: Säkerställ att en moduldefinition är ett korrekt initialiserat Python-objekt som korrekt rapporterar sin typ och ett referensantal.

source: Return *def* cast to ``PyObject*``, or ``NULL`` if an error occurred.
sv: Returnerar *def* som kastas till ``PyObject*``, eller ``NULL`` om ett fel inträffade.

source: Calling this function is required for :ref:`multi-phase-initialization`. It should not be used in other contexts.
sv: Anrop av denna funktion krävs för :ref:`multi-phase-initialization`. Den bör inte användas i andra sammanhang.

source: Note that Python assumes that ``PyModuleDef`` structures are statically allocated. This function may return either a new reference or a borrowed one; this reference must not be released.
sv: Observera att Python förutsätter att ``PyModuleDef``-strukturer är statiskt allokerade. Denna funktion kan returnera antingen en ny referens eller en lånad; denna referens får inte släppas.

source: Legacy single-phase initialization
sv: Legacy enfasig initialisering

source: Single-phase initialization is a legacy mechanism to initialize extension modules, with known drawbacks and design flaws. Extension module authors are encouraged to use multi-phase initialization instead.
sv: Enfasinitialisering är en äldre mekanism för att initiera tilläggsmoduler, med kända nackdelar och designfel. Författarna till tilläggsmoduler uppmanas att använda flerfasinitialisering i stället.

source: In single-phase initialization, the :ref:`initialization function <extension-export-hook>` (``PyInit_modulename``) should create, populate and return a module object. This is typically done using :c:func:`PyModule_Create` and functions like :c:func:`PyModule_AddObjectRef`.
sv: Vid enfasig initialisering ska :ref:`initialiseringsfunktionen <extension-export-hook>` (``PyInit_modulename``) skapa, fylla på och returnera ett modulobjekt. Detta görs vanligen med :c:func:`PyModule_Create` och funktioner som :c:func:`PyModule_AddObjectRef`.

source: Single-phase initialization differs from the :ref:`default <multi-phase-initialization>` in the following ways:
sv: Enfasinitialisering skiljer sig från :ref:`default <multi-phase-initialization>` på följande sätt:

source: Single-phase modules are, or rather *contain*, “singletons”.
sv: Enfasmoduler är, eller snarare *innehåller*, "singletons".

source: When the module is first initialized, Python saves the contents of the module's ``__dict__`` (that is, typically, the module's functions and types).
sv: När modulen initieras för första gången sparar Python innehållet i modulens ``__dict__`` (det vill säga, typiskt sett, modulens funktioner och typer).

source: For subsequent imports, Python does not call the initialization function again. Instead, it creates a new module object with a new ``__dict__``, and copies the saved contents to it. For example, given a single-phase module ``_testsinglephase`` [#testsinglephase]_ that defines a function ``sum`` and an exception class ``error``:
sv: För efterföljande import anropar Python inte initialiseringsfunktionen igen. Istället skapas ett nytt modulobjekt med en ny ``__dict__`` och det sparade innehållet kopieras till det. Till exempel, givet en enfasmodul ``_testsinglephase`` [#testsinglephase]_ som definierar en funktion ``sum`` och en undantagsklass ``error``:

source: The exact behavior should be considered a CPython implementation detail.
sv: Det exakta beteendet bör betraktas som en detalj i CPython-implementeringen.

source: To work around the fact that ``PyInit_modulename`` does not take a *spec* argument, some state of the import machinery is saved and applied to the first suitable module created during the ``PyInit_modulename`` call. Specifically, when a sub-module is imported, this mechanism prepends the parent package name to the name of the module.
sv: För att kringgå det faktum att ``PyInit_modulename`` inte tar ett *spec*-argument, sparas en del av importmaskineriet och tillämpas på den första lämpliga modulen som skapas under ``PyInit_modulename``-anropet. Specifikt, när en undermodul importeras, preponderar denna mekanism det överordnade paketnamnet till modulens namn.

source: A single-phase ``PyInit_modulename`` function should create “its” module object as soon as possible, before any other module objects can be created.
sv: En enfasig funktion av typen ``PyInit_modulename`` bör skapa "sitt" modulobjekt så snart som möjligt, innan några andra modulobjekt kan skapas.

source: Non-ASCII module names (``PyInitU_modulename``) are not supported.
sv: Modulnamn som inte är ASCII (``PyInitU_modulename``) stöds inte.

source: Single-phase modules support module lookup functions like :c:func:`PyState_FindModule`.
sv: Enfasmoduler stöder funktioner för moduluppslagning som :c:func:`PyState_FindModule`.

source: ``_testsinglephase`` is an internal module used in CPython's self-test suite; your installation may or may not include it.
sv: ``_testsinglephase`` är en intern modul som används i CPythons självtestsvit; din installation kanske eller kanske inte innehåller den.
