Repository: yeager/python-docs-sv
Catalog: c-api/file.po
Languages: sv

source: File Objects
sv: Filobjekt

source: These APIs are a minimal emulation of the Python 2 C API for built-in file objects, which used to rely on the buffered I/O (:c:expr:`FILE*`) support from the C standard library. In Python 3, files and streams use the new :mod:`io` module, which defines several layers over the low-level unbuffered I/O of the operating system. The functions described below are convenience C wrappers over these new APIs, and meant mostly for internal error reporting in the interpreter; third-party code is advised to access the :mod:`io` APIs instead.
sv: Dessa API:er är en minimal emulering av Python 2 C API för inbyggda filobjekt, som tidigare förlitade sig på buffrad I/O (:c:expr:`FILE*`) från C-standardbiblioteket. I Python 3 använder filer och strömmar den nya modulen :mod:`io`, som definierar flera lager över operativsystemets obuffrade I/O på låg nivå. Funktionerna som beskrivs nedan är praktiska C-omslag över dessa nya API:er och är främst avsedda för intern felrapportering i tolken; tredjepartskod rekommenderas att komma åt :mod:`io` API:erna istället.

source: Create a Python file object from the file descriptor of an already opened file *fd*. The arguments *name*, *encoding*, *errors* and *newline* can be ``NULL`` to use the defaults; *buffering* can be *-1* to use the default. *name* is ignored and kept for backward compatibility. Return ``NULL`` on failure. For a more comprehensive description of the arguments, please refer to the :func:`io.open` function documentation.
sv: Skapar ett Python-filobjekt från filbeskrivningen för en redan öppnad fil *fd*. Argumenten *name*, *encoding*, *errors* och *newline* kan vara ``NULL`` för att använda standardvärdena; *buffering* kan vara *-1* för att använda standardvärdet. *name* ignoreras och behålls för bakåtkompatibilitet. Returnerar ``NULL`` vid misslyckande. För en mer omfattande beskrivning av argumenten, se dokumentationen för funktionen :func:`io.open`.

source: Since Python streams have their own buffering layer, mixing them with OS-level file descriptors can produce various issues (such as unexpected ordering of data).
sv: Eftersom Python-strömmar har sitt eget buffertlager kan det uppstå olika problem (t.ex. oväntad ordning på data) om de blandas med filbeskrivare på OS-nivå.

source: Ignore *name* attribute.
sv: Ignorera attributet *name*.

source: Return the file descriptor associated with *p* as an :c:expr:`int`. If the object is an integer, its value is returned. If not, the object's :meth:`~io.IOBase.fileno` method is called if it exists; the method must return an integer, which is returned as the file descriptor value. Sets an exception and returns ``-1`` on failure.
sv: Returnerar filbeskrivaren som är associerad med *p* som ett :c:expr:`int`. Om objektet är ett heltal returneras dess värde. Om inte, anropas objektets :meth:`~io.IOBase.fileno`-metod om den finns; metoden måste returnera ett heltal, vilket returneras som filbeskrivarens värde. Ställer in ett undantag och returnerar ``-1`` om det misslyckas.

source: Equivalent to ``p.readline([n])``, this function reads one line from the object *p*. *p* may be a file object or any object with a :meth:`~io.IOBase.readline` method. If *n* is ``0``, exactly one line is read, regardless of the length of the line. If *n* is greater than ``0``, no more than *n* bytes will be read from the file; a partial line can be returned. In both cases, an empty string is returned if the end of the file is reached immediately. If *n* is less than ``0``, however, one line is read regardless of length, but :exc:`EOFError` is raised if the end of the file is reached immediately.
sv: Denna funktion motsvarar ``p.readline([n])`` och läser en rad från objektet *p*. *p* kan vara ett filobjekt eller ett objekt med en :meth:`~io.IOBase.readline`-metod. Om *n* är ``0`` läses exakt en rad, oavsett hur lång raden är. Om *n* är större än ``0`` kommer inte mer än *n* byte att läsas från filen; en partiell rad kan returneras. I båda fallen returneras en tom sträng om slutet på filen nås omedelbart. Om *n* är mindre än ``0`` läses dock en rad oavsett längd, men :exc:`EOFError` returneras om slutet på filen nås omedelbart.

source: Overrides the normal behavior of :func:`io.open_code` to pass its parameter through the provided handler.
sv: Åsidosätter det normala beteendet hos :func:`io.open_code` att skicka sin parameter genom den tillhandahållna hanteraren.

source: The *handler* is a function of type:
sv: *Hanteraren* är en funktion av typ:

source: Equivalent of :c:expr:`PyObject *(\*)(PyObject *path, void *userData)`, where *path* is guaranteed to be :c:type:`PyUnicodeObject`.
sv: Motsvarar :c:expr:`PyObject *(\*)(PyObject *path, void *userData)`, där *path* garanterat är :c:type:`PyUnicodeObject`.

source: The *userData* pointer is passed into the hook function. Since hook functions may be called from different runtimes, this pointer should not refer directly to Python state.
sv: Pekaren *userData* skickas till hook-funktionen. Eftersom hook-funktioner kan anropas från olika runtimes bör denna pekare inte referera direkt till Python-tillstånd.

source: As this hook is intentionally used during import, avoid importing new modules during its execution unless they are known to be frozen or available in ``sys.modules``.
sv: Eftersom den här kroken avsiktligt används under import bör du undvika att importera nya moduler under dess exekvering om du inte vet att de är frysta eller finns tillgängliga i ``sys.modules``.

source: Once a hook has been set, it cannot be removed or replaced, and later calls to :c:func:`PyFile_SetOpenCodeHook` will fail. On failure, the function returns -1 and sets an exception if the interpreter has been initialized.
sv: När en hook har ställts in kan den inte tas bort eller ersättas, och senare anrop till :c:func:`PyFile_SetOpenCodeHook` kommer att misslyckas. Om funktionen misslyckas returnerar den -1 och anger ett undantag om tolken har initialiserats.

source: This function is safe to call before :c:func:`Py_Initialize`.
sv: Den här funktionen är säker att anropa före :c:func:`Py_Initialize`.

source: Raises an :ref:`auditing event <auditing>` ``setopencodehook`` with no arguments.
sv: Utlöser en :ref:`auditing event <auditing>` ``setopencodehook`` utan argument.

source: Write object *obj* to file object *p*. The only supported flag for *flags* is :c:macro:`Py_PRINT_RAW`; if given, the :func:`str` of the object is written instead of the :func:`repr`. Return ``0`` on success or ``-1`` on failure; the appropriate exception will be set.
sv: Skriv objekt *obj* till filobjekt *p*. Den enda flaggan som stöds för *flags* är :c:macro:`Py_PRINT_RAW`; om den anges skrivs objektets :func:`str` istället för :func:`repr`. Returnerar ``0`` vid framgång eller ``-1`` vid misslyckande; lämpligt undantag kommer att ställas in.

source: Write string *s* to file object *p*. Return ``0`` on success or ``-1`` on failure; the appropriate exception will be set.
sv: Skriv sträng *s* till filobjekt *p*. Returnerar ``0`` vid framgång eller ``-1`` vid misslyckande; lämpligt undantag kommer att ställas in.

source: object
sv: objekt

source: file
sv: fil

source: EOFError (built-in exception)
sv: EOFError (inbyggt undantag)

source: Py_PRINT_RAW (C macro)
sv: Py_PRINT_RAW (C-makro)
