Repository: yeager/python-docs-sv
Catalog: c-api/gcsupport.po
Languages: sv

source: Supporting Cyclic Garbage Collection
sv: Stöd för cyklisk skräpinsamling

source: Python's support for detecting and collecting garbage which involves circular references requires support from object types which are "containers" for other objects which may also be containers. Types which do not store references to other objects, or which only store references to atomic types (such as numbers or strings), do not need to provide any explicit support for garbage collection.
sv: Pythons stöd för att upptäcka och samla in skräp som involverar cirkulära referenser kräver stöd från objekttyper som är "behållare" för andra objekt som också kan vara behållare. Typer som inte lagrar referenser till andra objekt, eller som bara lagrar referenser till atomära typer (t.ex. tal eller strängar), behöver inte tillhandahålla något explicit stöd för skräpinsamling.

source: To create a container type, the :c:member:`~PyTypeObject.tp_flags` field of the type object must include the :c:macro:`Py_TPFLAGS_HAVE_GC` and provide an implementation of the :c:member:`~PyTypeObject.tp_traverse` handler. If instances of the type are mutable, a :c:member:`~PyTypeObject.tp_clear` implementation must also be provided.
sv: För att skapa en containertyp måste fältet :c:member:`~PyTypeObject.tp_flags` i typobjektet innehålla :c:macro:`Py_TPFLAGS_HAVE_GC` och tillhandahålla en implementation av hanteraren :c:member:`~PyTypeObject.tp_traverse`. Om instanser av typen är mutabla måste också en implementation av :c:member:`~PyTypeObject.tp_clear` tillhandahållas.

source: :c:macro:`Py_TPFLAGS_HAVE_GC`
sv: :c:makro:`Py_TPFLAGS_HAVE_GC`

source: Objects with a type with this flag set must conform with the rules documented here. For convenience these objects will be referred to as container objects.
sv: Objekt med en typ med denna flagga måste följa de regler som dokumenteras här. För enkelhetens skull kommer dessa objekt att kallas containerobjekt.

source: Constructors for container types must conform to two rules:
sv: Konstruktörer för containertyper måste följa två regler:

source: The memory for the object must be allocated using :c:macro:`PyObject_GC_New` or :c:macro:`PyObject_GC_NewVar`.
sv: Minnet för objektet måste allokeras med hjälp av :c:macro:`PyObject_GC_New` eller :c:macro:`PyObject_GC_NewVar`.

source: Once all the fields which may contain references to other containers are initialized, it must call :c:func:`PyObject_GC_Track`.
sv: När alla fält, som kan innehålla referenser till andra containrar, har initialiserats måste den anropa :c:func:`PyObject_GC_Track`.

source: Similarly, the deallocator for the object must conform to a similar pair of rules:
sv: På samma sätt måste deallokatorn för objektet följa ett liknande par regler:

source: Before fields which refer to other containers are invalidated, :c:func:`PyObject_GC_UnTrack` must be called.
sv: Innan fält som hänvisar till andra behållare ogiltigförklaras måste :c:func:`PyObject_GC_UnTrack` anropas.

source: The object's memory must be deallocated using :c:func:`PyObject_GC_Del`.
sv: Objektets minne måste avallokeras med hjälp av :c:func:`PyObject_GC_Del`.

source: If a type adds the Py_TPFLAGS_HAVE_GC, then it *must* implement at least a :c:member:`~PyTypeObject.tp_traverse` handler or explicitly use one from its subclass or subclasses.
sv: Om en typ lägger till Py_TPFLAGS_HAVE_GC, så *måste* den implementera minst en :c:member:`~PyTypeObject.tp_traverse`-hanterare eller uttryckligen använda en från sin underklass eller underklasser.

source: When calling :c:func:`PyType_Ready` or some of the APIs that indirectly call it like :c:func:`PyType_FromSpecWithBases` or :c:func:`PyType_FromSpec` the interpreter will automatically populate the :c:member:`~PyTypeObject.tp_flags`, :c:member:`~PyTypeObject.tp_traverse` and :c:member:`~PyTypeObject.tp_clear` fields if the type inherits from a class that implements the garbage collector protocol and the child class does *not* include the :c:macro:`Py_TPFLAGS_HAVE_GC` flag.
sv: När man anropar :c:func:`PyType_Ready` eller några av de API:er som indirekt anropar det som :c:func:`PyType_FromSpecWithBases` eller :c:func:`PyType_FromSpec` kommer tolken automatiskt att fylla i fälten :c:member:`~PyTypeObject.tp_flags`, :c:member:`~PyTypeObject.tp_traverse` och :c:member:`~PyTypeObject.tp_clear` om typen ärver från en klass som implementerar garbage collector-protokollet och den underordnade klassen *inte* innehåller flaggan :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Analogous to :c:macro:`PyObject_New` but for container objects with the :c:macro:`Py_TPFLAGS_HAVE_GC` flag set.
sv: Analogt med :c:macro:`PyObject_New` men för containerobjekt med flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` inställd.

source: Do not call this directly to allocate memory for an object; call the type's :c:member:`~PyTypeObject.tp_alloc` slot instead.
sv: Anropa inte detta direkt för att allokera minne för ett objekt; anropa istället typens :c:member:`~PyTypeObject.tp_alloc` slot.

source: When populating a type's :c:member:`~PyTypeObject.tp_alloc` slot, :c:func:`PyType_GenericAlloc` is preferred over a custom function that simply calls this macro.
sv: När en typs :c:member:`~PyTypeObject.tp_alloc`-plats fylls i är :c:func:`PyType_GenericAlloc` att föredra framför en anpassad funktion som helt enkelt anropar detta makro.

source: Memory allocated by this macro must be freed with :c:func:`PyObject_GC_Del` (usually called via the object's :c:member:`~PyTypeObject.tp_free` slot).
sv: Minne som allokerats av detta makro måste frigöras med :c:func:`PyObject_GC_Del` (anropas vanligtvis via objektets :c:member:`~PyTypeObject.tp_free` slot).

source: :c:macro:`PyObject_New`
sv: :c:makro:`PyObject_New`

source: :c:member:`~PyTypeObject.tp_alloc`
sv: :c:medlem:`~PyTypeObject.tp_alloc`

source: Analogous to :c:macro:`PyObject_NewVar` but for container objects with the :c:macro:`Py_TPFLAGS_HAVE_GC` flag set.
sv: Analogt med :c:macro:`PyObject_NewVar` men för containerobjekt med flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` inställd.

source: :c:macro:`PyObject_NewVar`
sv: :c:makro:`PyObject_NewVar`

source: Analogous to :c:macro:`PyObject_GC_New` but allocates *extra_size* bytes at the end of the object (at offset :c:member:`~PyTypeObject.tp_basicsize`). The allocated memory is initialized to zeros, except for the :c:type:`Python object header <PyObject>`.
sv: Analogt med :c:macro:`PyObject_GC_New` men allokerar *extra_size* bytes i slutet av objektet (vid offset :c:member:`~PyTypeObject.tp_basicsize`). Det allokerade minnet initialiseras till noll, förutom :c:type:`Python object header <PyObject>`.

source: The extra data will be deallocated with the object, but otherwise it is not managed by Python.
sv: Den extra datan kommer att avallokeras med objektet, men i övrigt hanteras den inte av Python.

source: Memory allocated by this function must be freed with :c:func:`PyObject_GC_Del` (usually called via the object's :c:member:`~PyTypeObject.tp_free` slot).
sv: Minne som allokerats av denna funktion måste frigöras med :c:func:`PyObject_GC_Del` (anropas vanligtvis via objektets :c:member:`~PyTypeObject.tp_free` slot).

source: The function is marked as unstable because the final mechanism for reserving extra data after an instance is not yet decided. For allocating a variable number of fields, prefer using :c:type:`PyVarObject` and :c:member:`~PyTypeObject.tp_itemsize` instead.
sv: Funktionen är markerad som instabil eftersom den slutliga mekanismen för att reservera extra data efter en instans ännu inte är bestämd. För att allokera ett varierande antal fält, använd hellre :c:type:`PyVarObject` och :c:member:`~PyTypeObject.tp_itemsize` istället.

source: Resize an object allocated by :c:macro:`PyObject_NewVar`. Returns the resized object of type ``TYPE*`` (refers to any C type) or ``NULL`` on failure.
sv: Ändrar storlek på ett objekt som allokerats av :c:macro:`PyObject_NewVar`. Returnerar det storleksändrade objektet av typen ``TYPE*`` (refererar till valfri C-typ) eller ``NULL`` om det misslyckas.

source: *op* must be of type :c:expr:`PyVarObject *` and must not be tracked by the collector yet. *newsize* must be of type :c:type:`Py_ssize_t`.
sv: *op* måste vara av typen :c:expr:`PyVarObject *` och får inte spåras av samlaren ännu. *newsize* måste vara av typen :c:type:`Py_ssize_t`.

source: Adds the object *op* to the set of container objects tracked by the collector. The collector can run at unexpected times so objects must be valid while being tracked. This should be called once all the fields followed by the :c:member:`~PyTypeObject.tp_traverse` handler become valid, usually near the end of the constructor.
sv: Lägger till objektet *op* till uppsättningen containerobjekt som spåras av samlaren. Uppsamlaren kan köras vid oväntade tidpunkter så objekten måste vara giltiga när de spåras. Detta bör anropas när alla fält som följs av handlaren :c:member:`~PyTypeObject.tp_traverse` blir giltiga, vanligtvis i slutet av konstruktorn.

source: Returns non-zero if the object implements the garbage collector protocol, otherwise returns 0.
sv: Returnerar icke-noll om objektet implementerar garbage collector-protokollet, annars returneras 0.

source: The object cannot be tracked by the garbage collector if this function returns 0.
sv: Objektet kan inte spåras av skräpsamlaren om denna funktion returnerar 0.

source: Returns 1 if the object type of *op* implements the GC protocol and *op* is being currently tracked by the garbage collector and 0 otherwise.
sv: Returnerar 1 om objekttypen för *op* implementerar GC-protokollet och *op* för närvarande spåras av skräpsamlaren och 0 i annat fall.

source: This is analogous to the Python function :func:`gc.is_tracked`.
sv: Detta är analogt med Python-funktionen :func:`gc.is_tracked`.

source: Returns 1 if the object type of *op* implements the GC protocol and *op* has been already finalized by the garbage collector and 0 otherwise.
sv: Returnerar 1 om objekttypen för *op* implementerar GC-protokollet och *op* redan har slutförts av skräpsamlaren och 0 i annat fall.

source: This is analogous to the Python function :func:`gc.is_finalized`.
sv: Detta är analogt med Python-funktionen :func:`gc.is_finalized`.

source: Releases memory allocated to an object using :c:macro:`PyObject_GC_New` or :c:macro:`PyObject_GC_NewVar`.
sv: Frigör minne som allokerats till ett objekt med :c:macro:`PyObject_GC_New` eller :c:macro:`PyObject_GC_NewVar`.

source: Do not call this directly to free an object's memory; call the type's :c:member:`~PyTypeObject.tp_free` slot instead.
sv: Anropa inte detta direkt för att frigöra ett objekts minne; anropa istället typens :c:member:`~PyTypeObject.tp_free` slot.

source: Do not use this for memory allocated by :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar`, or related allocation functions; use :c:func:`PyObject_Free` instead.
sv: Använd inte detta för minne som allokerats av :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar` eller relaterade allokeringsfunktioner; använd istället :c:func:`PyObject_Free`.

source: :c:func:`PyObject_Free` is the non-GC equivalent of this function.
sv: :c:func:`PyObject_Free` är den icke-GC-motsvarighet till denna funktion.

source: :c:macro:`PyObject_GC_New`
sv: :c:makro:`PyObject_GC_New`

source: :c:macro:`PyObject_GC_NewVar`
sv: :c:makro:`PyObject_GC_NewVar`

source: Remove the object *op* from the set of container objects tracked by the collector. Note that :c:func:`PyObject_GC_Track` can be called again on this object to add it back to the set of tracked objects. The deallocator (:c:member:`~PyTypeObject.tp_dealloc` handler) should call this for the object before any of the fields used by the :c:member:`~PyTypeObject.tp_traverse` handler become invalid.
sv: Ta bort objektet *op* från uppsättningen containerobjekt som spåras av samlaren. Observera att :c:func:`PyObject_GC_Track` kan anropas igen på detta objekt för att lägga till det igen i uppsättningen av spårade objekt. Deallocatorn (:c:member:`~PyTypeObject.tp_dealloc` handler) bör anropa detta för objektet innan något av de fält som används av :c:member:`~PyTypeObject.tp_traverse` handler blir ogiltigt.

source: The :c:func:`!_PyObject_GC_TRACK` and :c:func:`!_PyObject_GC_UNTRACK` macros have been removed from the public C API.
sv: Makron :c:func:`!_PyObject_GC_TRACK` och :c:func:`!_PyObject_GC_UNTRACK` har tagits bort från det publika C API:et.

source: The :c:member:`~PyTypeObject.tp_traverse` handler accepts a function parameter of this type:
sv: Hanteraren :c:member:`~PyTypeObject.tp_traverse` accepterar en funktionsparameter av denna typ:

source: Type of the visitor function passed to the :c:member:`~PyTypeObject.tp_traverse` handler. The function should be called with an object to traverse as *object* and the third parameter to the :c:member:`~PyTypeObject.tp_traverse` handler as *arg*. The Python core uses several visitor functions to implement cyclic garbage detection; it's not expected that users will need to write their own visitor functions.
sv: Typ av besöksfunktion som skickas till :c:member:`~PyTypeObject.tp_traverse` handler. Funktionen bör anropas med ett objekt att traversera som *object* och den tredje parametern till handläggaren :c:member:`~PyTypeObject.tp_traverse` som *arg*. Python-kärnan använder flera besökarfunktioner för att implementera cyklisk skräpdetektering; det förväntas inte att användare behöver skriva sina egna besökarfunktioner.

source: The :c:member:`~PyTypeObject.tp_traverse` handler must have the following type:
sv: Hanteraren :c:member:`~PyTypeObject.tp_traverse` måste ha följande typ:

source: Traversal function for a container object. Implementations must call the *visit* function for each object directly contained by *self*, with the parameters to *visit* being the contained object and the *arg* value passed to the handler. The *visit* function must not be called with a ``NULL`` object argument. If *visit* returns a non-zero value that value should be returned immediately.
sv: Traversalfunktion för ett containerobjekt. Implementeringar måste anropa funktionen *visit* för varje objekt som direkt ingår i *self*, där parametrarna till *visit* är det ingående objektet och värdet för *arg* som skickas till hanteraren. Funktionen *visit* får inte anropas med ett ``NULL`` objektargument. Om *visit* returnerar ett värde som inte är noll ska detta värde returneras omedelbart.

source: To simplify writing :c:member:`~PyTypeObject.tp_traverse` handlers, a :c:func:`Py_VISIT` macro is provided. In order to use this macro, the :c:member:`~PyTypeObject.tp_traverse` implementation must name its arguments exactly *visit* and *arg*:
sv: För att förenkla skrivandet av :c:member:`~PyTypeObject.tp_traverse`-hanterare tillhandahålls ett :c:func:`Py_VISIT`-makro. För att kunna använda detta makro måste :c:member:`~PyTypeObject.tp_traverse` implementationen namnge sina argument exakt *visit* och *arg*:

source: If the :c:expr:`PyObject *` *o* is not ``NULL``, call the *visit* callback, with arguments *o* and *arg*. If *visit* returns a non-zero value, then return it. Using this macro, :c:member:`~PyTypeObject.tp_traverse` handlers look like::
sv: Om :c:expr:`PyObject *` *o* inte är ``NULL``, anropa *visit* callback, med argumenten *o* och *arg*. Om *visit* returnerar ett värde som inte är noll, returnera det. Med hjälp av detta makro ser :c:member:`~PyTypeObject.tp_traverse` handlers ut som::

source: static int my_traverse(Noddy *self, visitproc visit, void *arg) { Py_VISIT(self->foo); Py_VISIT(self->bar); return 0; }
sv: statisk int my_traverse(Noddy *self, visitproc visit, void *arg) { Py_VISIT(själv>foo); Py_VISIT(self->bar); return 0; }

source: The :c:member:`~PyTypeObject.tp_clear` handler must be of the :c:type:`inquiry` type, or ``NULL`` if the object is immutable.
sv: Hanteraren :c:member:`~PyTypeObject.tp_clear` måste vara av typen :c:type:`inquiry`, eller ``NULL`` om objektet är oföränderligt.

source: Drop references that may have created reference cycles. Immutable objects do not have to define this method since they can never directly create reference cycles. Note that the object must still be valid after calling this method (don't just call :c:func:`Py_DECREF` on a reference). The collector will call this method if it detects that this object is involved in a reference cycle.
sv: Släpper referenser som kan ha skapat referenscykler. Oföränderliga objekt behöver inte definiera denna metod eftersom de aldrig direkt kan skapa referenscykler. Observera att objektet fortfarande måste vara giltigt efter anropet av denna metod (anropa inte bara :c:func:`Py_DECREF` på en referens). Uppsamlaren anropar denna metod om den upptäcker att detta objekt är involverat i en referenscykel.

source: Controlling the Garbage Collector State
sv: Styrning av skräpsamlarens tillstånd

source: The C-API provides the following functions for controlling garbage collection runs.
sv: C-API tillhandahåller följande funktioner för att styra körningar av skräpplockning.

source: Perform a full garbage collection, if the garbage collector is enabled. (Note that :func:`gc.collect` runs it unconditionally.)
sv: Utför en fullständig skräpinsamling, om skräpinsamlaren är aktiverad. (Observera att :func:`gc.collect` kör den villkorslöst)

source: Returns the number of collected + unreachable objects which cannot be collected. If the garbage collector is disabled or already collecting, returns ``0`` immediately. Errors during garbage collection are passed to :data:`sys.unraisablehook`. This function does not raise exceptions.
sv: Returnerar antalet insamlade + oåtkomliga objekt som inte kan samlas in. Om skräpsamlaren är inaktiverad eller redan samlar in objekt, returneras ``0`` omedelbart. Fel under skräpinsamlingen skickas till :data:`sys.unraisablehook`. Denna funktion ger inte upphov till undantag.

source: Enable the garbage collector: similar to :func:`gc.enable`. Returns the previous state, 0 for disabled and 1 for enabled.
sv: Aktivera skräpsamlaren: liknar :func:`gc.enable`. Returnerar det tidigare tillståndet, 0 för inaktiverad och 1 för aktiverad.

source: Disable the garbage collector: similar to :func:`gc.disable`. Returns the previous state, 0 for disabled and 1 for enabled.
sv: Inaktivera skräpsamlaren: liknar :func:`gc.disable`. Returnerar det tidigare tillståndet, 0 för inaktiverad och 1 för aktiverad.

source: Query the state of the garbage collector: similar to :func:`gc.isenabled`. Returns the current state, 0 for disabled and 1 for enabled.
sv: Frågar efter skräpsamlarens tillstånd: liknar :func:`gc.isenabled`. Returnerar det aktuella tillståndet, 0 för inaktiverad och 1 för aktiverad.

source: Querying Garbage Collector State
sv: Förfrågan om status för skräpsamlare

source: The C-API provides the following interface for querying information about the garbage collector.
sv: C-API tillhandahåller följande gränssnitt för att fråga efter information om skräpsamlaren.

source: Run supplied *callback* on all live GC-capable objects. *arg* is passed through to all invocations of *callback*.
sv: Kör medföljande *callback* på alla levande GC-kompatibla objekt. *arg* skickas vidare till alla anrop av *callback*.

source: If new objects are (de)allocated by the callback it is undefined if they will be visited.
sv: Om nya objekt (de)allokeras av callbacken är det inte fastställt om de kommer att besökas.

source: Garbage collection is disabled during operation. Explicitly running a collection in the callback may lead to undefined behaviour e.g. visiting the same objects multiple times or not at all.
sv: Garbage collection är inaktiverad under drift. Att explicit köra en insamling i återuppringningen kan leda till odefinierat beteende, t.ex. att samma objekt besöks flera gånger eller inte alls.

source: Type of the visitor function to be passed to :c:func:`PyUnstable_GC_VisitObjects`. *arg* is the same as the *arg* passed to ``PyUnstable_GC_VisitObjects``. Return ``1`` to continue iteration, return ``0`` to stop iteration. Other return values are reserved for now so behavior on returning anything else is undefined.
sv: Typ av besöksfunktion som ska skickas till :c:func:`PyUnstable_GC_VisitObjects`. *arg* är samma som *arg* som skickas till ``PyUnstable_GC_VisitObjects``. Returnera ``1`` för att fortsätta iterationen, returnera ``0`` för att stoppa iterationen. Andra returvärden är reserverade för tillfället så beteendet vid retur av något annat är odefinierat.
