Repository: yeager/python-docs-sv
Catalog: c-api/intro.po
Languages: sv

source: It is not necessary to hold a :term:`strong reference` (i.e. increment the reference count) for every local variable that contains a pointer to an object. In theory, the object's reference count goes up by one when the variable is made to point to it and it goes down by one when the variable goes out of scope. However, these two cancel each other out, so at the end the reference count hasn't changed. The only real reason to use the reference count is to prevent the object from being deallocated as long as our variable is pointing to it. If we know that there is at least one other reference to the object that lives at least as long as our variable, there is no need to take a new :term:`strong reference` (i.e. increment the reference count) temporarily. An important situation where this arises is in objects that are passed as arguments to C functions in an extension module that are called from Python; the call mechanism guarantees to hold a reference to every argument for the duration of the call.
sv: Det är inte nödvändigt att hålla en :term:`strong reference` (d.v.s. öka referensantalet) för varje lokal variabel som innehåller en pekare till ett objekt. I teorin ökar objektets referensantal med ett när variabeln pekar på det och det minskar med ett när variabeln försvinner ur räckvidden. Dessa två tar dock ut varandra, så i slutändan har referensantalet inte ändrats. Det enda egentliga skälet till att använda referensantalet är att förhindra att objektet avallokeras så länge vår variabel pekar på det. Om vi vet att det finns minst en annan referens till objektet som lever minst lika länge som vår variabel, finns det inget behov av att tillfälligt ta en ny :term:`strong reference` (dvs. öka referensantalet). En viktig situation där detta uppstår är i objekt som skickas som argument till C-funktioner i en tilläggsmodul som anropas från Python; anropsmekanismen garanterar att hålla en referens till varje argument så länge anropet varar.

source: However, a common pitfall is to extract an object from a list and hold on to it for a while without taking a new reference. Some other operation might conceivably remove the object from the list, releasing that reference, and possibly deallocating it. The real danger is that innocent-looking operations may invoke arbitrary Python code which could do this; there is a code path which allows control to flow back to the user from a :c:func:`Py_DECREF`, so almost any operation is potentially dangerous.
sv: En vanlig fallgrop är dock att extrahera ett objekt från en lista och behålla det ett tag utan att ta en ny referens. Någon annan operation kan tänkas ta bort objektet från listan, släppa referensen och eventuellt avallokera den. Den verkliga faran är att oskyldigt utseende operationer kan åberopa godtycklig Python-kod som kan göra detta; det finns en kodväg som gör att kontrollen kan flöda tillbaka till användaren från en :c:func:`Py_DECREF`, så nästan alla operationer är potentiellt farliga.

source: A safe approach is to always use the generic operations (functions whose name begins with ``PyObject_``, ``PyNumber_``, ``PySequence_`` or ``PyMapping_``). These operations always create a new :term:`strong reference` (i.e. increment the reference count) of the object they return. This leaves the caller with the responsibility to call :c:func:`Py_DECREF` when they are done with the result; this soon becomes second nature.
sv: Ett säkert tillvägagångssätt är att alltid använda de generiska operationerna (funktioner vars namn börjar med ``PyObject_``, ``PyNumber_``, ``PySequence_`` eller ``PyMapping_``). Dessa operationer skapar alltid en ny :term:`strong reference` (dvs. ökar referensantalet) för det objekt som de returnerar. Detta lämnar anroparen med ansvaret att anropa :c:func:`Py_DECREF` när de är klara med resultatet; detta blir snart en andra natur.

source: Reference Count Details
sv: Referensräkning Detaljer

source: The reference count behavior of functions in the Python/C API is best explained in terms of *ownership of references*. Ownership pertains to references, never to objects (objects are not owned: they are always shared). "Owning a reference" means being responsible for calling Py_DECREF on it when the reference is no longer needed. Ownership can also be transferred, meaning that the code that receives ownership of the reference then becomes responsible for eventually releasing it by calling :c:func:`Py_DECREF` or :c:func:`Py_XDECREF` when it's no longer needed---or passing on this responsibility (usually to its caller). When a function passes ownership of a reference on to its caller, the caller is said to receive a *new* reference. When no ownership is transferred, the caller is said to *borrow* the reference. Nothing needs to be done for a :term:`borrowed reference`.
sv: Referensräkningsbeteendet för funktioner i Python/C API förklaras bäst i termer av *ägarskap av referenser*. Äganderätten gäller referenser, aldrig objekt (objekt ägs inte, de delas alltid). att "äga en referens" innebär att man är ansvarig för att anropa Py_DECREF på den när referensen inte längre behövs. Ägandet kan också överföras, vilket innebär att den kod som får ägandet av referensen sedan blir ansvarig för att så småningom släppa den genom att anropa :c:func:`Py_DECREF` eller :c:func:`Py_XDECREF` när den inte längre behövs---eller överföra detta ansvar (vanligtvis till dess anropare). När en funktion överför ägandet av en referens till sin anropare, sägs anroparen få en *ny* referens. När inget ägande överförs sägs den som anropar *låna* referensen. Ingenting behöver göras för en :term:`lånad referens`.

source: Conversely, when a calling function passes in a reference to an object, there are two possibilities: the function *steals* a reference to the object, or it does not. *Stealing a reference* means that when you pass a reference to a function, that function assumes that it now owns that reference, and you are not responsible for it any longer.
sv: Omvänt, när en anropande funktion skickar en referens till ett objekt, finns det två möjligheter: funktionen *stjäl* en referens till objektet, eller så gör den det inte. *Att stjäla en referens* innebär att när du skickar en referens till en funktion, antar den funktionen att den nu äger referensen och att du inte längre är ansvarig för den.

source: Few functions steal references; the two notable exceptions are :c:func:`PyList_SetItem` and :c:func:`PyTuple_SetItem`, which steal a reference to the item (but not to the tuple or list into which the item is put!). These functions were designed to steal a reference because of a common idiom for populating a tuple or list with newly created objects; for example, the code to create the tuple ``(1, 2, "three")`` could look like this (forgetting about error handling for the moment; a better way to code this is shown below)::
sv: Få funktioner stjäl referenser; de två anmärkningsvärda undantagen är :c:func:`PyList_SetItem` och :c:func:`PyTuple_SetItem`, som stjäl en referens till objektet (men inte till den tupel eller lista som objektet läggs i!). Dessa funktioner utformades för att stjäla en referens på grund av ett vanligt idiom för att fylla en tupel eller lista med nyskapade objekt; till exempel skulle koden för att skapa tupeln ``(1, 2, "three")`` kunna se ut så här (vi glömmer bort felhantering för tillfället; ett bättre sätt att koda detta visas nedan)::

source: PyObject *t; t = PyTuple_New(3); PyTuple_SetItem(t, 0, PyLong_FromLong(1L)); PyTuple_SetItem(t, 1, PyLong_FromLong(2L)); PyTuple_SetItem(t, 2, PyUnicode_FromString("three"));
sv: PyObject *t; t = PyTuple_New(3); PyTuple_SetItem(t, 0, PyLong_FromLong(1L)); PyTuple_SetItem(t, 1, PyLong_FromLong(2L)); PyTuple_SetItem(t, 2, PyUnicode_FromString("tre"));

source: Here, :c:func:`PyLong_FromLong` returns a new reference which is immediately stolen by :c:func:`PyTuple_SetItem`. When you want to keep using an object although the reference to it will be stolen, use :c:func:`Py_INCREF` to grab another reference before calling the reference-stealing function.
sv: Här returnerar :c:func:`PyLong_FromLong` en ny referens som omedelbart stjäls av :c:func:`PyTuple_SetItem`. När du vill fortsätta använda ett objekt trots att referensen till det kommer att stjälas, använd :c:func:`Py_INCREF` för att ta en annan referens innan du anropar den referensstjälande funktionen.

source: Incidentally, :c:func:`PyTuple_SetItem` is the *only* way to set tuple items; :c:func:`PySequence_SetItem` and :c:func:`PyObject_SetItem` refuse to do this since tuples are an immutable data type. You should only use :c:func:`PyTuple_SetItem` for tuples that you are creating yourself.
sv: För övrigt är :c:func:`PyTuple_SetItem` det *endaste* sättet att ställa in tupelobjekt; :c:func:`PySequence_SetItem` och :c:func:`PyObject_SetItem` vägrar att göra detta eftersom tuplar är en oföränderlig datatyp. Du bör endast använda :c:func:`PyTuple_SetItem` för tuples som du skapar själv.

source: Equivalent code for populating a list can be written using :c:func:`PyList_New` and :c:func:`PyList_SetItem`.
sv: Motsvarande kod för att fylla på en lista kan skrivas med :c:func:`PyList_New` och :c:func:`PyList_SetItem`.

source: However, in practice, you will rarely use these ways of creating and populating a tuple or list. There's a generic function, :c:func:`Py_BuildValue`, that can create most common objects from C values, directed by a :dfn:`format string`. For example, the above two blocks of code could be replaced by the following (which also takes care of the error checking)::
sv: I praktiken kommer du dock sällan att använda dessa sätt att skapa och fylla i en tupel eller lista. Det finns en generisk funktion, :c:func:`Py_BuildValue`, som kan skapa de flesta vanliga objekt från C-värden, styrda av en :dfn:`formatsträng`. Till exempel kan de två ovanstående kodblocken ersättas av följande (som också tar hand om felkontrollen)::

source: It is much more common to use :c:func:`PyObject_SetItem` and friends with items whose references you are only borrowing, like arguments that were passed in to the function you are writing. In that case, their behaviour regarding references is much saner, since you don't have to take a new reference just so you can give that reference away ("have it be stolen"). For example, this function sets all items of a list (actually, any mutable sequence) to a given item::
sv: Det är mycket vanligare att använda :c:func:`PyObject_SetItem` och vänner med objekt vars referenser du bara lånar, som argument som skickades in till den funktion du skriver. I så fall är deras beteende när det gäller referenser mycket sundare, eftersom du inte behöver ta en ny referens bara för att kunna ge bort den referensen ("låta den bli stulen"). Den här funktionen ställer till exempel in alla objekt i en lista (egentligen vilken mutabel sekvens som helst) till ett givet objekt::

source: int set_all(PyObject *target, PyObject *item) { Py_ssize_t i, n; n = PyObject_Length(target); if (n < 0) return -1; for (i = 0; i < n; i++) { PyObject *index = PyLong_FromSsize_t(i); if (!index) return -1; if (PyObject_SetItem(target, index, item) < 0) { Py_DECREF(index); return -1; } Py_DECREF(index); } return 0; }
sv: int set_all(PyObject *target, PyObject *item) { Py_ssize_t i, n; n = PyObject_Length(mål); if (n < 0) returnera -1; for (i = 0; i < n; i++) { PyObject *index = PyLong_FromSsize_t(i); if (!index) returnera -1; if (PyObject_SetItem(target, index, item) < 0) { Py_DECREF(index); return -1; } Py_DECREF(index); } return 0; }

source: The situation is slightly different for function return values. While passing a reference to most functions does not change your ownership responsibilities for that reference, many functions that return a reference to an object give you ownership of the reference. The reason is simple: in many cases, the returned object is created on the fly, and the reference you get is the only reference to the object. Therefore, the generic functions that return object references, like :c:func:`PyObject_GetItem` and :c:func:`PySequence_GetItem`, always return a new reference (the caller becomes the owner of the reference).
sv: Situationen är något annorlunda för funktioners returvärden. Att skicka en referens till de flesta funktioner ändrar inte ditt ägaransvar för den referensen, men många funktioner som returnerar en referens till ett objekt ger dig äganderätten till referensen. Anledningen är enkel: i många fall skapas det returnerade objektet i farten, och den referens du får är den enda referensen till objektet. Därför returnerar de generiska funktioner som returnerar objektreferenser, som :c:func:`PyObject_GetItem` och :c:func:`PySequence_GetItem`, alltid en ny referens (den som anropar blir ägare till referensen).

source: It is important to realize that whether you own a reference returned by a function depends on which function you call only --- *the plumage* (the type of the object passed as an argument to the function) *doesn't enter into it!* Thus, if you extract an item from a list using :c:func:`PyList_GetItem`, you don't own the reference --- but if you obtain the same item from the same list using :c:func:`PySequence_GetItem` (which happens to take exactly the same arguments), you do own a reference to the returned object.
sv: Det är viktigt att inse att om du äger en referens som returneras av en funktion beror på vilken funktion du anropar --- *fjäderdräkten* (typen av objekt som skickas som argument till funktionen) *inte spelar någon roll!* Om du extraherar ett objekt från en lista med hjälp av :c:func:`PyList_GetItem`, äger du inte referensen --- men om du hämtar samma objekt från samma lista med hjälp av :c:func:`PySequence_GetItem` (som råkar ta exakt samma argument), äger du en referens till det returnerade objektet.

source: Here is an example of how you could write a function that computes the sum of the items in a list of integers; once using :c:func:`PyList_GetItem`, and once using :c:func:`PySequence_GetItem`. ::
sv: Här är ett exempel på hur du kan skriva en funktion som beräknar summan av posterna i en lista med heltal; en gång med :c:func:`PyList_GetItem` och en gång med :c:func:`PySequence_GetItem`. ::

source: long sum_list(PyObject *list) { Py_ssize_t i, n; long total = 0, value; PyObject *item; n = PyList_Size(list); if (n < 0) return -1; /* Not a list */ for (i = 0; i < n; i++) { item = PyList_GetItem(list, i); /* Can't fail */ if (!PyLong_Check(item)) continue; /* Skip non-integers */ value = PyLong_AsLong(item); if (value == -1 && PyErr_Occurred()) /* Integer too big to fit in a C long, bail out */ return -1; total += value; } return total; }
sv: lång sum_list(PyObject *lista) { Py_ssize_t i, n; long total = 0, värde; PyObjekt *objekt; n = PyList_Size(lista); if (n < 0) return -1; /* Inte en lista */ for (i = 0; i < n; i++) { item = PyList_GetItem(list, i); /* Får inte misslyckas */ if (!PyLong_Check(item)) continue; /* Hoppa över icke-integraler */ värde = PyLong_AsLong(item); if (värde == -1 && PyErr_Occurred()) /* Heltalet är för stort för att rymmas i en C-long, hoppa av */ returnera -1; total += värde; } return total; }

source: long sum_sequence(PyObject *sequence) { Py_ssize_t i, n; long total = 0, value; PyObject *item; n = PySequence_Length(sequence); if (n < 0) return -1; /* Has no length */ for (i = 0; i < n; i++) { item = PySequence_GetItem(sequence, i); if (item == NULL) return -1; /* Not a sequence, or other failure */ if (PyLong_Check(item)) { value = PyLong_AsLong(item); Py_DECREF(item); if (value == -1 && PyErr_Occurred()) /* Integer too big to fit in a C long, bail out */ return -1; total += value; } else { Py_DECREF(item); /* Discard reference ownership */ } } return total; }
sv: lång sum_sequence(PyObject *sequence) { Py_ssize_t i, n; long total = 0, värde; PyObjekt *item; n = PySequence_Length(sekvens); if (n < 0) return -1; /* Har ingen längd */ for (i = 0; i < n; i++) { item = PySequence_GetItem(sekvens, i); if (objekt == NULL) return -1; /* Inte en sekvens, eller annat fel */ if (PyLong_Check(item)) { värde = PyLong_AsLong(item); Py_DECREF(objekt); if (värde == -1 && PyErr_Occurred()) /* Heltalet är för stort för att rymmas i en C-long, avbryt */ returnera -1; total += värde; } else { Py_DECREF(item); /* Kassera referensägande */ } } returnera totalt; }

source: Types
sv: Typer

source: There are few other data types that play a significant role in the Python/C API; most are simple C types such as :c:expr:`int`, :c:expr:`long`, :c:expr:`double` and :c:expr:`char*`. A few structure types are used to describe static tables used to list the functions exported by a module or the data attributes of a new object type, and another is used to describe the value of a complex number. These will be discussed together with the functions that use them.
sv: Det finns få andra datatyper som spelar en viktig roll i Python/C API; de flesta är enkla C-typer som :c:expr:`int`, :c:expr:`long`, :c:expr:`double` och :c:expr:`char*`. Några strukturtyper används för att beskriva statiska tabeller som används för att lista de funktioner som exporteras av en modul eller dataattributen för en ny objekttyp, och en annan används för att beskriva värdet av ett komplext tal. Dessa kommer att diskuteras tillsammans med de funktioner som använder dem.

source: A signed integral type such that ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 doesn't define such a thing directly (size_t is an unsigned integral type). See :pep:`353` for details. ``PY_SSIZE_T_MAX`` is the largest positive value of type :c:type:`Py_ssize_t`.
sv: En signerad integraltyp som är sådan att ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 definierar inte en sådan sak direkt (size_t är en osignerad integraltyp). Se :pep:`353` för detaljer. ``PY_SSIZE_T_MAX`` är det största positiva värdet av typen :c:type:`Py_ssize_t`.

source: Exceptions
sv: Undantag

source: The Python programmer only needs to deal with exceptions if specific error handling is required; unhandled exceptions are automatically propagated to the caller, then to the caller's caller, and so on, until they reach the top-level interpreter, where they are reported to the user accompanied by a stack traceback.
sv: Python-programmeraren behöver bara hantera undantag om specifik felhantering krävs; ohanterade undantag sprids automatiskt till anroparen, sedan till anroparens anropar och så vidare, tills de når tolken på högsta nivån, där de rapporteras till användaren tillsammans med en stack-traceback.

source: For C programmers, however, error checking always has to be explicit. All functions in the Python/C API can raise exceptions, unless an explicit claim is made otherwise in a function's documentation. In general, when a function encounters an error, it sets an exception, discards any object references that it owns, and returns an error indicator. If not documented otherwise, this indicator is either ``NULL`` or ``-1``, depending on the function's return type. A few functions return a Boolean true/false result, with false indicating an error. Very few functions return no explicit error indicator or have an ambiguous return value, and require explicit testing for errors with :c:func:`PyErr_Occurred`. These exceptions are always explicitly documented.
sv: För C-programmerare måste dock felkontrollen alltid vara explicit. Alla funktioner i Python/C API kan skapa undantag, såvida inte något annat uttryckligen anges i en funktions dokumentation. I allmänhet, när en funktion stöter på ett fel, ställer den in ett undantag, kasserar alla objektreferenser som den äger och returnerar en felindikator. Om inte annat dokumenteras är denna indikator antingen ``NULL`` eller ``-1``, beroende på funktionens returtyp. Ett fåtal funktioner returnerar ett booleskt sant/falskt resultat, där false indikerar ett fel. Mycket få funktioner returnerar ingen explicit felindikator eller har ett tvetydigt returvärde, och kräver explicit testning för fel med :c:func:`PyErr_Occurred`. Dessa undantag är alltid explicit dokumenterade.

source: Exception state is maintained in per-thread storage (this is equivalent to using global storage in an unthreaded application). A thread can be in one of two states: an exception has occurred, or not. The function :c:func:`PyErr_Occurred` can be used to check for this: it returns a borrowed reference to the exception type object when an exception has occurred, and ``NULL`` otherwise. There are a number of functions to set the exception state: :c:func:`PyErr_SetString` is the most common (though not the most general) function to set the exception state, and :c:func:`PyErr_Clear` clears the exception state.
sv: Undantagstillstånd lagras per tråd (detta motsvarar att använda global lagring i ett otrådat program). En tråd kan befinna sig i ett av två tillstånd: ett undantag har inträffat eller inte. Funktionen :c:func:`PyErr_Occurred` kan användas för att kontrollera detta: den returnerar en lånad referens till undantagstypsobjektet när ett undantag har inträffat, och ``NULL`` annars. Det finns ett antal funktioner för att ställa in undantagstillståndet: :c:func:`PyErr_SetString` är den vanligaste (men inte den mest allmänna) funktionen för att ställa in undantagstillståndet, och :c:func:`PyErr_Clear` rensar undantagstillståndet.

source: The full exception state consists of three objects (all of which can be ``NULL``): the exception type, the corresponding exception value, and the traceback. These have the same meanings as the Python result of ``sys.exc_info()``; however, they are not the same: the Python objects represent the last exception being handled by a Python :keyword:`try` ... :keyword:`except` statement, while the C level exception state only exists while an exception is being passed on between C functions until it reaches the Python bytecode interpreter's main loop, which takes care of transferring it to ``sys.exc_info()`` and friends.
sv: Det fullständiga undantagstillståndet består av tre objekt (som alla kan vara ``NULL``): undantagstypen, det motsvarande undantagsvärdet och spårningen. Dessa har samma betydelser som Python-resultatet av ``sys.exc_info()``; men de är inte desamma: Python-objekten representerar det sista undantaget som hanteras av en Python :keyword:`try` ... :keyword:`except`-sats, medan undantagstillståndet på C-nivå bara existerar medan ett undantag skickas vidare mellan C-funktioner tills det når Python-bytekodtolkarens huvudslinga, som tar hand om att överföra det till ``sys.exc_info()`` och vänner.
