Repository: yeager/python-docs-sv
Catalog: c-api/intro.po
Languages: sv

source: Introduction
sv: Introduktion

source: The Application Programmer's Interface to Python gives C and C++ programmers access to the Python interpreter at a variety of levels. The API is equally usable from C++, but for brevity it is generally referred to as the Python/C API. There are two fundamentally different reasons for using the Python/C API. The first reason is to write *extension modules* for specific purposes; these are C modules that extend the Python interpreter. This is probably the most common use. The second reason is to use Python as a component in a larger application; this technique is generally referred to as :dfn:`embedding` Python in an application.
sv: Application Programmer's Interface to Python ger C- och C++-programmerare tillgång till Python-tolken på en mängd olika nivåer. API:et är lika användbart från C++, men för korthetens skull kallas det i allmänhet för Python/C API. Det finns två fundamentalt olika anledningar till att använda Python/C API. Det första skälet är att skriva *extension modules* för specifika ändamål; dessa är C-moduler som utökar Python-tolken. Detta är förmodligen den vanligaste användningen. Det andra skälet är att använda Python som en komponent i en större applikation; denna teknik kallas i allmänhet :dfn:`embedding` Python i en applikation.

source: Writing an extension module is a relatively well-understood process, where a "cookbook" approach works well. There are several tools that automate the process to some extent. While people have embedded Python in other applications since its early existence, the process of embedding Python is less straightforward than writing an extension.
sv: Att skriva en tilläggsmodul är en relativt välkänd process, där en "kokboks"-metod fungerar bra. Det finns flera verktyg som automatiserar processen i viss utsträckning. Även om människor har bäddat in Python i andra applikationer sedan dess tidiga existens, är processen att bädda in Python mindre okomplicerad än att skriva ett tillägg.

source: Many API functions are useful independent of whether you're embedding or extending Python; moreover, most applications that embed Python will need to provide a custom extension as well, so it's probably a good idea to become familiar with writing an extension before attempting to embed Python in a real application.
sv: Många API-funktioner är användbara oberoende av om du bäddar in eller utökar Python; dessutom kommer de flesta applikationer som bäddar in Python att behöva tillhandahålla ett anpassat tillägg också, så det är förmodligen en bra idé att bekanta sig med att skriva ett tillägg innan du försöker bädda in Python i en riktig applikation.

source: Language version compatibility
sv: Kompatibilitet med språkversioner

source: Python's C API is compatible with C11 and C++11 versions of C and C++.
sv: Pythons C API är kompatibelt med C11- och C++11-versionerna av C och C++.

source: This is a lower limit: the C API does not require features from later C/C++ versions. You do *not* need to enable your compiler's "c11 mode".
sv: Detta är en nedre gräns: C API kräver inte funktioner från senare C/C++-versioner. Du behöver *inte* aktivera din kompilators "c11-läge".

source: Coding standards
sv: Kodningsstandarder

source: If you're writing C code for inclusion in CPython, you **must** follow the guidelines and standards defined in :PEP:`7`. These guidelines apply regardless of the version of Python you are contributing to. Following these conventions is not necessary for your own third party extension modules, unless you eventually expect to contribute them to Python.
sv: Om du skriver C-kod som ska ingå i CPython måste du **följa** de riktlinjer och standarder som definieras i :PEP:`7`. Dessa riktlinjer gäller oavsett vilken version av Python du bidrar till. Att följa dessa konventioner är inte nödvändigt för dina egna tilläggsmoduler från tredje part, såvida du inte så småningom förväntar dig att bidra med dem till Python.

source: Include Files
sv: Inkludera filer

source: All function, type and macro definitions needed to use the Python/C API are included in your code by the following line::
sv: Alla funktions-, typ- och makrodefinitioner som behövs för att använda Python/C API inkluderas i din kod med följande rad::

source: #define PY_SSIZE_T_CLEAN #include <Python.h>
sv: #definiera PY_SSIZE_T_CLEAN #inkludera <Python.h>

source: This implies inclusion of the following standard headers: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, ``<assert.h>`` and ``<stdlib.h>`` (if available).
sv: Detta innebär att följande standardrubriker måste inkluderas: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, ``<assert.h>`` och ``<stdlib.h>` (om tillgängligt).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
sv: Eftersom Python kan definiera vissa preprocessordefinitioner som påverkar standardrubrikerna på vissa system, måste du *inkludera* :file:`Python.h` innan några standardrubriker inkluderas.

source: It is recommended to always define ``PY_SSIZE_T_CLEAN`` before including ``Python.h``. See :ref:`arg-parsing` for a description of this macro.
sv: Det rekommenderas att alltid definiera ``PY_SSIZE_T_CLEAN`` innan man inkluderar ``Python.h``. Se :ref:`arg-parsing` för en beskrivning av detta makro.

source: All user visible names defined by Python.h (except those defined by the included standard headers) have one of the prefixes ``Py`` or ``_Py``. Names beginning with ``_Py`` are for internal use by the Python implementation and should not be used by extension writers. Structure member names do not have a reserved prefix.
sv: Alla användarsynliga namn som definieras av Python.h (utom de som definieras av de inkluderade standardheadern) har ett av prefixen ``Py`` eller ``_Py``. Namn som börjar med ``_Py`` är för internt bruk av Python-implementationen och bör inte användas av tilläggsskrivare. Strukturmedlemsnamn har inget reserverat prefix.

source: User code should never define names that begin with ``Py`` or ``_Py``. This confuses the reader, and jeopardizes the portability of the user code to future Python versions, which may define additional names beginning with one of these prefixes.
sv: Användarkod bör aldrig definiera namn som börjar med ``Py`` eller ``_Py``. Detta förvirrar läsaren och äventyrar portabiliteten av användarkoden till framtida Python-versioner, som kan definiera ytterligare namn som börjar med något av dessa prefix.

source: The header files are typically installed with Python. On Unix, these are located in the directories :file:`{prefix}/include/pythonversion/` and :file:`{exec_prefix}/include/pythonversion/`, where :option:`prefix <--prefix>` and :option:`exec_prefix <--exec-prefix>` are defined by the corresponding parameters to Python's :program:`configure` script and *version* is ``'%d.%d' % sys.version_info[:2]``. On Windows, the headers are installed in :file:`{prefix}/include`, where ``prefix`` is the installation directory specified to the installer.
sv: Huvudfilerna installeras vanligtvis med Python. På Unix finns dessa i katalogerna :file:`{prefix}/include/pythonversion/` och :file:`{exec_prefix}/include/pythonversion/`, där :option:`prefix <--prefix>` och :option:`exec_prefix <--exec-prefix>` definieras av motsvarande parametrar i Pythons skript :program:`configure` och *version* är ``'%d.%d' % sys.version_info[:2]``. I Windows installeras sidhuvudet i :file:`{prefix}/include`, där ``prefix`` är den installationskatalog som anges i installationsprogrammet.

source: To include the headers, place both directories (if different) on your compiler's search path for includes. Do *not* place the parent directories on the search path and then use ``#include <pythonX.Y/Python.h>``; this will break on multi-platform builds since the platform independent headers under :option:`prefix <--prefix>` include the platform specific headers from :option:`exec_prefix <--exec-prefix>`.
sv: För att inkludera rubrikerna, placera båda katalogerna (om de är olika) på kompilatorns sökväg för inkluderingar. Placera *inte* de överordnade katalogerna på sökvägen och använd sedan ``#include &lt;pythonX.Y/Python.h&gt;``; detta kommer att gå sönder på multiplattformsbyggen eftersom de plattformsoberoende rubrikerna under :option:`prefix <--prefix>` inkluderar de plattformsspecifika rubrikerna från :option:`exec_prefix <--exec-prefix>`.

source: C++ users should note that although the API is defined entirely using C, the header files properly declare the entry points to be ``extern "C"``. As a result, there is no need to do anything special to use the API from C++.
sv: C++-användare bör notera att även om API:et är definierat helt i C, deklarerar rubrikfilerna korrekt att ingångspunkterna är ``extern "C"``. Det finns därför inget behov av att göra något speciellt för att använda API:et från C++.

source: Useful macros
sv: Användbara makron

source: Several useful macros are defined in the Python header files. Many are defined closer to where they are useful (for example, :c:macro:`Py_RETURN_NONE`, :c:macro:`PyMODINIT_FUNC`). Others of a more general utility are defined here. This is not necessarily a complete listing.
sv: Flera användbara makron finns definierade i Pythons header-filer. Många är definierade närmare där de är användbara (till exempel :c:macro:`Py_RETURN_NONE`, :c:macro:`PyMODINIT_FUNC`). Andra som är mer allmänt användbara definieras här. Detta är inte nödvändigtvis en fullständig lista.

source: Return the absolute value of ``x``.
sv: Returnera det absoluta värdet av ``x``.

source: Ask the compiler to always inline a static inline function. The compiler can ignore it and decide to not inline the function.
sv: Be kompilatorn att alltid inlinea en statisk inline-funktion. Kompilatorn kan ignorera det och bestämma sig för att inte inline-funktionen.

source: It can be used to inline performance critical static inline functions when building Python in debug mode with function inlining disabled. For example, MSC disables function inlining when building in debug mode.
sv: Den kan användas för att inline prestandakritiska statiska inline-funktioner när Python byggs i felsökningsläge med funktionsinlining inaktiverad. MSC inaktiverar till exempel inlining av funktioner när Python byggs i felsökningsläge.

source: Marking blindly a static inline function with Py_ALWAYS_INLINE can result in worse performances (due to increased code size for example). The compiler is usually smarter than the developer for the cost/benefit analysis.
sv: Att blint markera en statisk inline-funktion med Py_ALWAYS_INLINE kan leda till sämre prestanda (till exempel på grund av ökad kodstorlek). Kompilatorn är vanligtvis smartare än utvecklaren när det gäller kostnads-/nyttoanalysen.

source: If Python is :ref:`built in debug mode <debug-build>` (if the :c:macro:`Py_DEBUG` macro is defined), the :c:macro:`Py_ALWAYS_INLINE` macro does nothing.
sv: Om Python är :ref:`byggd i debugläge <debug-build>` (om makrot :c:macro:`Py_DEBUG` är definierat), gör makrot :c:macro:`Py_ALWAYS_INLINE` ingenting.

source: It must be specified before the function return type. Usage::
sv: Den måste anges före funktionens returtyp. Användning::

source: static inline Py_ALWAYS_INLINE int random(void) { return 4; }
sv: statisk inline Py_ALWAYS_INLINE int random(void) { return 4; }

source: Argument must be a character or an integer in the range [-128, 127] or [0, 255]. This macro returns ``c`` cast to an ``unsigned char``.
sv: Argumentet måste vara ett tecken eller ett heltal i intervallet [-128, 127] eller [0, 255]. Detta makro returnerar ``c`` som kastats till en ``unsigned char``.

source: Use this for deprecated declarations. The macro must be placed before the symbol name.
sv: Använd detta för föråldrade deklarationer. Makrot måste placeras före symbolnamnet.

source: Example::
sv: Exempel::

source: MSVC support was added.
sv: Stöd för MSVC har lagts till.

source: Like ``getenv(s)``, but returns ``NULL`` if :option:`-E` was passed on the command line (see :c:member:`PyConfig.use_environment`).
sv: Som ``getenv(s)``, men returnerar ``NULL`` om :option:`-E` angavs på kommandoraden (se :c:member:`PyConfig.use_environment`).

source: Return the maximum value between ``x`` and ``y``.
sv: Returnerar det maximala värdet mellan ``x`` och ``y``.

source: Return the size of a structure (``type``) ``member`` in bytes.
sv: Returnerar storleken på en struktur (``typ``) ``medlem`` i bytes.

source: Return the minimum value between ``x`` and ``y``.
sv: Returnerar det minsta värdet mellan ``x`` och ``y``.

source: Disable inlining on a function. For example, it reduces the C stack consumption: useful on LTO+PGO builds which heavily inline code (see :issue:`33720`).
sv: Inaktivera inlining på en funktion. Det minskar till exempel C-stackens förbrukning: användbart på LTO+PGO-byggnader som innehåller mycket inline-kod (se :issue:`33720`).

source: Usage::
sv: Användning::

source: Py_NO_INLINE static int random(void) { return 4; }
sv: Py_NO_INLINE statisk int random(void) { return 4; }

source: Convert ``x`` to a C string. E.g. ``Py_STRINGIFY(123)`` returns ``"123"``.
sv: Konvertera ``x`` till en C-sträng. T.ex. ``Py_STRINGIFY(123)`` returnerar ``"123"``.

source: Use this when you have a code path that cannot be reached by design. For example, in the ``default:`` clause in a ``switch`` statement for which all possible values are covered in ``case`` statements. Use this in places where you might be tempted to put an ``assert(0)`` or ``abort()`` call.
sv: Använd detta när du har en kodväg som inte kan nås genom design. Till exempel i klausulen ``default:`` i en ``witch``-sats för vilken alla möjliga värden täcks av ``case``-satser. Använd detta på platser där du kan frestas att lägga till ett ``assert(0)`` eller ``abort()``-anrop.

source: In release mode, the macro helps the compiler to optimize the code, and avoids a warning about unreachable code. For example, the macro is implemented with ``__builtin_unreachable()`` on GCC in release mode.
sv: I release-läge hjälper makrot kompilatorn att optimera koden och undviker en varning om onåbar kod. Makrot implementeras t.ex. med ``__builtin_unreachable()`` i GCC i release-läge.

source: A use for ``Py_UNREACHABLE()`` is following a call a function that never returns but that is not declared :c:macro:`_Py_NO_RETURN`.
sv: En användning för ``Py_UNREACHABLE()`` är att följa ett anrop av en funktion som aldrig returnerar men som inte är deklarerad :c:macro:`_Py_NO_RETURN`.

source: If a code path is very unlikely code but can be reached under exceptional case, this macro must not be used. For example, under low memory condition or if a system call returns a value out of the expected range. In this case, it's better to report the error to the caller. If the error cannot be reported to caller, :c:func:`Py_FatalError` can be used.
sv: Om en kodväg är mycket osannolik men kan nås i undantagsfall, får detta makro inte användas. Till exempel vid låg minneskapacitet eller om ett systemanrop returnerar ett värde som inte ligger inom det förväntade intervallet. I så fall är det bättre att rapportera felet till anroparen. Om felet inte kan rapporteras till anroparen kan :c:func:`Py_FatalError` användas.

source: Use this for unused arguments in a function definition to silence compiler warnings. Example: ``int func(int a, int Py_UNUSED(b)) { return a; }``.
sv: Använd detta för oanvända argument i en funktionsdefinition för att tysta kompilatorvarningar. Exempel: ``int func(int a, int Py_UNUSED(b)) { return a; }``.

source: Creates a variable with name ``name`` that can be used in docstrings. If Python is built without docstrings, the value will be empty.
sv: Skapar en variabel med namnet ``name`` som kan användas i docstrings. Om Python byggs utan dokumentsträngar kommer värdet att vara tomt.

source: Use :c:macro:`PyDoc_STRVAR` for docstrings to support building Python without docstrings, as specified in :pep:`7`.
sv: Använd :c:macro:`PyDoc_STRVAR` för docstrings för att stödja byggandet av Python utan docstrings, enligt specifikationen i :pep:`7`.

source: PyDoc_STRVAR(pop_doc, "Remove and return the rightmost element."); static PyMethodDef deque_methods[] = { // ... {"pop", (PyCFunction)deque_pop, METH_NOARGS, pop_doc}, // ... }
sv: PyDoc_STRVAR(pop_doc, "Ta bort och returnera elementet längst till höger."); statisk PyMethodDef deque_methods[] = { // ... {"pop", (PyCFunction)deque_pop, METH_NOARGS, pop_doc}, // ... }

source: Creates a docstring for the given input string or an empty string if docstrings are disabled.
sv: Skapar en docstring för den angivna indatasträngen eller en tom sträng om docstrings är inaktiverade.

source: Use :c:macro:`PyDoc_STR` in specifying docstrings to support building Python without docstrings, as specified in :pep:`7`.
sv: Använd :c:macro:`PyDoc_STR` vid angivande av dokumentsträngar för att stödja byggandet av Python utan dokumentsträngar, enligt :pep:`7`.

source: static PyMethodDef pysqlite_row_methods[] = { {"keys", (PyCFunction)pysqlite_row_keys, METH_NOARGS, PyDoc_STR("Returns the keys of the row.")}, {NULL, NULL} };
sv: static PyMethodDef pysqlite_row_methods[] = { {"keys", (PyCFunction)pysqlite_row_keys, METH_NOARGS, PyDoc_STR("Returnerar nycklarna för raden.")}, {NULL, NULL} };

source: Objects, Types and Reference Counts
sv: Objekt, typer och referensräkningar

source: Most Python/C API functions have one or more arguments as well as a return value of type :c:expr:`PyObject*`. This type is a pointer to an opaque data type representing an arbitrary Python object. Since all Python object types are treated the same way by the Python language in most situations (e.g., assignments, scope rules, and argument passing), it is only fitting that they should be represented by a single C type. Almost all Python objects live on the heap: you never declare an automatic or static variable of type :c:type:`PyObject`, only pointer variables of type :c:expr:`PyObject*` can be declared. The sole exception are the type objects; since these must never be deallocated, they are typically static :c:type:`PyTypeObject` objects.
sv: De flesta Python/C API-funktioner har ett eller flera argument samt ett returvärde av typen :c:expr:`PyObject*`. Denna typ är en pekare till en opak datatyp som representerar ett godtyckligt Python-objekt. Eftersom alla Python-objekttyper behandlas på samma sätt av Python-språket i de flesta situationer (t.ex. tilldelningar, scope-regler och argumentpassning) är det bara passande att de representeras av en enda C-typ. Nästan alla Python-objekt lever på högen: du kan aldrig deklarera en automatisk eller statisk variabel av typen :c:type:`PyObject`, endast pekarvariabler av typen :c:expr:`PyObject*` kan deklareras. Det enda undantaget är typobjekten; eftersom dessa aldrig får avallokeras är de typiskt statiska :c:type:`PyTypeObject`-objekt.

source: All Python objects (even Python integers) have a :dfn:`type` and a :dfn:`reference count`. An object's type determines what kind of object it is (e.g., an integer, a list, or a user-defined function; there are many more as explained in :ref:`types`). For each of the well-known types there is a macro to check whether an object is of that type; for instance, ``PyList_Check(a)`` is true if (and only if) the object pointed to by *a* is a Python list.
sv: Alla Python-objekt (även Pythons heltal) har en :dfn:`typ` och ett :dfn:`referensantal`. Ett objekts typ avgör vilken typ av objekt det är (t.ex. ett heltal, en lista eller en användardefinierad funktion; det finns många fler som förklaras i :ref:`types`). För var och en av de välkända typerna finns det ett makro för att kontrollera om ett objekt är av den typen; till exempel är ``PyList_Check(a)`` sant om (och endast om) det objekt som *a* pekar på är en Python-lista.

source: Reference Counts
sv: Referensräkningar

source: The reference count is important because today's computers have a finite (and often severely limited) memory size; it counts how many different places there are that have a :term:`strong reference` to an object. Such a place could be another object, or a global (or static) C variable, or a local variable in some C function. When the last :term:`strong reference` to an object is released (i.e. its reference count becomes zero), the object is deallocated. If it contains references to other objects, those references are released. Those other objects may be deallocated in turn, if there are no more references to them, and so on. (There's an obvious problem with objects that reference each other here; for now, the solution is "don't do that.")
sv: Referensräkningen är viktig eftersom dagens datorer har en ändlig (och ofta starkt begränsad) minnesstorlek; den räknar hur många olika platser det finns som har en :term:`strong referens` till ett objekt. En sådan plats kan vara ett annat objekt, eller en global (eller statisk) C-variabel, eller en lokal variabel i någon C-funktion. När den sista :term:`strong-referensen` till ett objekt släpps (d.v.s. dess referensantal blir noll), deallokeras objektet. Om det innehåller referenser till andra objekt, frigörs dessa referenser. Dessa andra objekt kan i sin tur deallokeras om det inte finns några fler referenser till dem, och så vidare. (Det finns ett uppenbart problem med objekt som refererar till varandra här; för tillfället är lösningen "gör inte det.")

source: Reference counts are always manipulated explicitly. The normal way is to use the macro :c:func:`Py_INCREF` to take a new reference to an object (i.e. increment its reference count by one), and :c:func:`Py_DECREF` to release that reference (i.e. decrement the reference count by one). The :c:func:`Py_DECREF` macro is considerably more complex than the incref one, since it must check whether the reference count becomes zero and then cause the object's deallocator to be called. The deallocator is a function pointer contained in the object's type structure. The type-specific deallocator takes care of releasing references for other objects contained in the object if this is a compound object type, such as a list, as well as performing any additional finalization that's needed. There's no chance that the reference count can overflow; at least as many bits are used to hold the reference count as there are distinct memory locations in virtual memory (assuming ``sizeof(Py_ssize_t) >= sizeof(void*)``). Thus, the reference count increment is a simple operation.
sv: Referensräkningar manipuleras alltid explicit. Det normala sättet är att använda makrot :c:func:`Py_INCREF` för att ta en ny referens till ett objekt (dvs. öka dess referensantal med ett) och :c:func:`Py_DECREF` för att släppa den referensen (dvs. minska referensantalet med ett). Makrot :c:func:`Py_DECREF` är betydligt mer komplext än incref, eftersom det måste kontrollera om referensantalet blir noll och därefter anropa objektets deallocator. Deallokatorn är en funktionspoängare som ingår i objektets typstruktur. Den typspecifika deallokatorn tar hand om att frigöra referenser för andra objekt som ingår i objektet om detta är en sammansatt objekttyp, till exempel en lista, samt utför ytterligare slutbehandling som behövs. Det finns ingen chans att referensantalet kan överskridas; minst lika många bitar används för att hålla referensantalet som det finns distinkta minnesplatser i det virtuella minnet (förutsatt att ``sizeof(Py_ssize_t) >= sizeof(void*)``). Således är ökningen av referensantalet en enkel operation.
