Repository: yeager/python-docs-sv
Catalog: c-api/intro.po
Languages: sv

source: Note that starting with Python 1.5, the preferred, thread-safe way to access the exception state from Python code is to call the function :func:`sys.exc_info`, which returns the per-thread exception state for Python code. Also, the semantics of both ways to access the exception state have changed so that a function which catches an exception will save and restore its thread's exception state so as to preserve the exception state of its caller. This prevents common bugs in exception handling code caused by an innocent-looking function overwriting the exception being handled; it also reduces the often unwanted lifetime extension for objects that are referenced by the stack frames in the traceback.
sv: Observera att från och med Python 1.5 är det föredragna, trådsäkra sättet att komma åt undantagstillståndet från Python-kod att anropa funktionen :func:`sys.exc_info`, som returnerar undantagstillståndet per tråd för Python-kod. Semantiken för båda sätten att komma åt undantagstillståndet har också ändrats så att en funktion som fångar upp ett undantag sparar och återställer trådens undantagstillstånd så att anroparens undantagstillstånd bevaras. Detta förhindrar vanliga buggar i undantagshanteringskod som orsakas av att en oskyldig funktion skriver över det undantag som hanteras; det minskar också den ofta oönskade livstidsförlängningen för objekt som refereras till av stackramarna i spårningen.

source: As a general principle, a function that calls another function to perform some task should check whether the called function raised an exception, and if so, pass the exception state on to its caller. It should discard any object references that it owns, and return an error indicator, but it should *not* set another exception --- that would overwrite the exception that was just raised, and lose important information about the exact cause of the error.
sv: Som en allmän princip bör en funktion som anropar en annan funktion för att utföra någon uppgift kontrollera om den anropade funktionen gav upphov till ett undantag och i så fall vidarebefordra undantagstillståndet till sin anropare. Den bör kasta bort alla objektreferenser som den äger och returnera en felindikator, men den bör *inte* ställa in ett annat undantag --- det skulle skriva över det undantag som just har uppstått och förlora viktig information om den exakta orsaken till felet.

source: A simple example of detecting exceptions and passing them on is shown in the :c:func:`!sum_sequence` example above. It so happens that this example doesn't need to clean up any owned references when it detects an error. The following example function shows some error cleanup. First, to remind you why you like Python, we show the equivalent Python code::
sv: Ett enkelt exempel på hur man upptäcker undantag och skickar dem vidare visas i :c:func:`!sum_sequence`-exemplet ovan. Det råkar vara så att det här exemplet inte behöver rensa upp några ägda referenser när det upptäcker ett fel. Följande exempel på funktion visar en del felrensning. Först, för att påminna dig om varför du gillar Python, visar vi motsvarande Python-kod::

source: def incr_item(dict, key): try: item = dict[key] except KeyError: item = 0 dict[key] = item + 1
sv: def incr_item(dict, nyckel): try: item = dict[nyckel] except KeyError: objekt = 0 dict[nyckel] = objekt + 1

source: Here is the corresponding C code, in all its glory::
sv: Här är motsvarande C-kod, i all sin prakt::

source: int incr_item(PyObject *dict, PyObject *key) { /* Objects all initialized to NULL for Py_XDECREF */ PyObject *item = NULL, *const_one = NULL, *incremented_item = NULL; int rv = -1; /* Return value initialized to -1 (failure) */ item = PyObject_GetItem(dict, key); if (item == NULL) { /* Handle KeyError only: */ if (!PyErr_ExceptionMatches(PyExc_KeyError)) goto error; /* Clear the error and use zero: */ PyErr_Clear(); item = PyLong_FromLong(0L); if (item == NULL) goto error; } const_one = PyLong_FromLong(1L); if (const_one == NULL) goto error; incremented_item = PyNumber_Add(item, const_one); if (incremented_item == NULL) goto error; if (PyObject_SetItem(dict, key, incremented_item) < 0) goto error; rv = 0; /* Success */ /* Continue with cleanup code */ error: /* Cleanup code, shared by success and failure path */ /* Use Py_XDECREF() to ignore NULL references */ Py_XDECREF(item); Py_XDECREF(const_one); Py_XDECREF(incremented_item); return rv; /* -1 for error, 0 for success */ }
sv: int incr_item(PyObject *dict, PyObject *key) { /* Alla objekt initialiseras till NULL för Py_XDECREF */ PyObject *item = NULL, *const_one = NULL, *incremented_item = NULL; int rv = -1; /* Returvärde initialiserat till -1 (misslyckande) */ item = PyObject_GetItem(dict, nyckel); if (item == NULL) { /* Hantera endast KeyError: */ if (!PyErr_ExceptionMatches(PyExc_KeyError)) goto fel; /* Rensa felet och använd noll: */ PyErr_Clear(); objekt = PyLong_FromLong(0L); if (objekt == NULL) goto fel; } const_one = PyLong_FromLong(1L); om (const_one == NULL) gå till fel; incremented_item = PyNumber_Add(item, const_one); if (incremented_item == NULL) goto fel; if (PyObject_SetItem(dict, key, incremented_item) < 0) goto fel; rv = 0; /* Framgång */ /* Fortsätt med uppstädningskod */ error (fel): /* Uppstädningskod, delas av framgångs- och felväg */ /* Använd Py_XDECREF() för att ignorera NULL-referenser */ Py_XDECREF(objekt); Py_XDECREF(const_one); Py_XDECREF(incremented_item); return rv; /* -1 för fel, 0 för framgång */ }

source: This example represents an endorsed use of the ``goto`` statement in C! It illustrates the use of :c:func:`PyErr_ExceptionMatches` and :c:func:`PyErr_Clear` to handle specific exceptions, and the use of :c:func:`Py_XDECREF` to dispose of owned references that may be ``NULL`` (note the ``'X'`` in the name; :c:func:`Py_DECREF` would crash when confronted with a ``NULL`` reference). It is important that the variables used to hold owned references are initialized to ``NULL`` for this to work; likewise, the proposed return value is initialized to ``-1`` (failure) and only set to success after the final call made is successful.
sv: Detta exempel representerar en godkänd användning av ``goto``-satsen i C! Det illustrerar användningen av :c:func:`PyErr_ExceptionMatches` och :c:func:`PyErr_Clear` för att hantera specifika undantag, och användningen av :c:func:`Py_XDECREF` för att göra sig av med ägda referenser som kan vara ``NULL`` (notera ``'X'`` i namnet; :c:func:`Py_DECREF` skulle krascha när den konfronteras med en ``NULL``-referens). Det är viktigt att de variabler som används för att hålla ägda referenser initialiseras till ``NULL`` för att detta ska fungera; på samma sätt initialiseras det föreslagna returvärdet till ``-1`` (misslyckande) och sätts först till framgång efter att det sista anropet som görs är framgångsrikt.

source: Embedding Python
sv: Inbäddning av Python

source: The one important task that only embedders (as opposed to extension writers) of the Python interpreter have to worry about is the initialization, and possibly the finalization, of the Python interpreter. Most functionality of the interpreter can only be used after the interpreter has been initialized.
sv: Den enda viktiga uppgift som endast inbäddare (i motsats till författare av tillägg) av Python-tolken behöver bekymra sig om är initialiseringen, och eventuellt slutförandet, av Python-tolken. De flesta funktioner i tolken kan bara användas efter att tolken har initialiserats.

source: The basic initialization function is :c:func:`Py_Initialize`. This initializes the table of loaded modules, and creates the fundamental modules :mod:`builtins`, :mod:`__main__`, and :mod:`sys`. It also initializes the module search path (``sys.path``).
sv: Den grundläggande initialiseringsfunktionen är :c:func:`Py_Initialize`. Den initierar tabellen över inlästa moduler och skapar de grundläggande modulerna :mod:`builtins`, :mod:`__main__` och :mod:`sys`. Den initialiserar också sökvägen för modulerna (``sys.path``).

source: :c:func:`Py_Initialize` does not set the "script argument list" (``sys.argv``). If this variable is needed by Python code that will be executed later, setting :c:member:`PyConfig.argv` and :c:member:`PyConfig.parse_argv` must be set: see :ref:`Python Initialization Configuration <init-config>`.
sv: :c:func:`Py_Initialize` ställer inte in "script argument list" (``sys.argv``). Om denna variabel behövs av Python-kod som kommer att exekveras senare, måste :c:member:`PyConfig.argv` och :c:member:`PyConfig.parse_argv` sättas: se :ref:`Python Initialization Configuration <init-config>`.

source: On most systems (in particular, on Unix and Windows, although the details are slightly different), :c:func:`Py_Initialize` calculates the module search path based upon its best guess for the location of the standard Python interpreter executable, assuming that the Python library is found in a fixed location relative to the Python interpreter executable. In particular, it looks for a directory named :file:`lib/python{X.Y}` relative to the parent directory where the executable named :file:`python` is found on the shell command search path (the environment variable :envvar:`PATH`).
sv: På de flesta system (i synnerhet på Unix och Windows, även om detaljerna är något annorlunda) beräknar :c:func:`Py_Initialize` modulens sökväg baserat på sin bästa gissning om platsen för Python-tolkens körbara standardprogram, förutsatt att Python-biblioteket finns på en fast plats i förhållande till Python-tolkens körbara program. I synnerhet letar den efter en katalog med namnet :file:`lib/python{X.Y}` i förhållande till den överordnade katalog där den körbara filen med namnet :file:`python` finns i sökvägen för skalkommandon (miljövariabeln :envvar:`PATH`).

source: For instance, if the Python executable is found in :file:`/usr/local/bin/python`, it will assume that the libraries are in :file:`/usr/local/lib/python{X.Y}`. (In fact, this particular path is also the "fallback" location, used when no executable file named :file:`python` is found along :envvar:`PATH`.) The user can override this behavior by setting the environment variable :envvar:`PYTHONHOME`, or insert additional directories in front of the standard path by setting :envvar:`PYTHONPATH`.
sv: Om till exempel den körbara Python-filen finns i :file:`/usr/local/bin/python`, kommer den att anta att biblioteken finns i :file:`/usr/local/lib/python{X.Y}`. (Faktum är att den här sökvägen också är "fallback"-platsen, som används när ingen körbar fil med namnet :file:`python` hittas längs :envvar:`PATH`) Användaren kan åsidosätta detta beteende genom att ställa in miljövariabeln :envvar:`PYTHONHOME`, eller lägga till ytterligare kataloger framför standardsökvägen genom att ställa in :envvar:`PYTHONPATH`.

source: The embedding application can steer the search by setting :c:member:`PyConfig.program_name` *before* calling :c:func:`Py_InitializeFromConfig`. Note that :envvar:`PYTHONHOME` still overrides this and :envvar:`PYTHONPATH` is still inserted in front of the standard path. An application that requires total control has to provide its own implementation of :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, and :c:func:`Py_GetProgramFullPath` (all defined in :file:`Modules/getpath.c`).
sv: Den inbäddande applikationen kan styra sökningen genom att ställa in :c:member:`PyConfig.program_name` *innan* anropa :c:func:`Py_InitializeFromConfig`. Observera att :envvar:`PYTHONHOME` fortfarande åsidosätter detta och att :envvar:`PYTHONPATH` fortfarande infogas framför standardsökvägen. En applikation som kräver total kontroll måste tillhandahålla sin egen implementation av :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix` och :c:func:`Py_GetProgramFullPath` (alla definierade i :file:`Modules/getpath.c`).

source: Sometimes, it is desirable to "uninitialize" Python. For instance, the application may want to start over (make another call to :c:func:`Py_Initialize`) or the application is simply done with its use of Python and wants to free memory allocated by Python. This can be accomplished by calling :c:func:`Py_FinalizeEx`. The function :c:func:`Py_IsInitialized` returns true if Python is currently in the initialized state. More information about these functions is given in a later chapter. Notice that :c:func:`Py_FinalizeEx` does *not* free all memory allocated by the Python interpreter, e.g. memory allocated by extension modules currently cannot be released.
sv: Ibland är det önskvärt att "avinitialisera" Python. Till exempel kan programmet vilja börja om från början (göra ett nytt anrop till :c:func:`Py_Initialize`) eller så är programmet helt enkelt färdigt med att använda Python och vill frigöra minne som allokerats av Python. Detta kan åstadkommas genom att anropa :c:func:`Py_FinalizeEx`. Funktionen :c:func:`Py_IsInitialized` returnerar true om Python för närvarande är i det initialiserade tillståndet. Mer information om dessa funktioner ges i ett senare kapitel. Observera att :c:func:`Py_FinalizeEx` *inte* frigör allt minne som allokerats av Python-tolken, t.ex. minne som allokerats av tilläggsmoduler kan för närvarande inte frigöras.

source: Debugging Builds
sv: Felsökning av byggnader

source: Python can be built with several macros to enable extra checks of the interpreter and extension modules. These checks tend to add a large amount of overhead to the runtime so they are not enabled by default.
sv: Python kan byggas med flera makron för att aktivera extra kontroller av tolken och tilläggsmoduler. Dessa kontroller tenderar att lägga till en stor mängd overhead till körtiden så de är inte aktiverade som standard.

source: A full list of the various types of debugging builds is in the file :file:`Misc/SpecialBuilds.txt` in the Python source distribution. Builds are available that support tracing of reference counts, debugging the memory allocator, or low-level profiling of the main interpreter loop. Only the most frequently used builds will be described in the remainder of this section.
sv: En fullständig lista över de olika typerna av felsökningsbyggnader finns i filen :file:`Misc/SpecialBuilds.txt` i Python-källdistributionen. Det finns builds som stöder spårning av referensräkningar, felsökning av minnesallokeraren eller lågnivåprofilering av huvudtolkens loop. I resten av detta avsnitt beskrivs endast de mest frekvent använda byggnaderna.

source: Compiling the interpreter with the :c:macro:`!Py_DEBUG` macro defined produces what is generally meant by :ref:`a debug build of Python <debug-build>`. :c:macro:`!Py_DEBUG` is enabled in the Unix build by adding :option:`--with-pydebug` to the :file:`./configure` command. It is also implied by the presence of the not-Python-specific :c:macro:`!_DEBUG` macro. When :c:macro:`!Py_DEBUG` is enabled in the Unix build, compiler optimization is disabled.
sv: Kompilering av tolken med makrot :c:macro:`!Py_DEBUG` definierat ger vad som i allmänhet menas med :ref:``en debug-byggnad av Python <debug-build>`. :c:macro:`!Py_DEBUG` aktiveras i Unix-byggnaden genom att lägga till :option:`--with-pydebug` till kommandot :file:`./configure`. Det är också underförstått genom närvaron av det icke-Python-specifika :c:macro:`!_DEBUG`-makrot. När :c:macro:`!Py_DEBUG` är aktiverat i Unix-versionen är kompilatoroptimeringen inaktiverad.

source: In addition to the reference count debugging described below, extra checks are performed, see :ref:`Python Debug Build <debug-build>`.
sv: Utöver den felsökning av referensantal som beskrivs nedan utförs extra kontroller, se :ref:`Python Debug Build <debug-build>`.

source: Defining :c:macro:`Py_TRACE_REFS` enables reference tracing (see the :option:`configure --with-trace-refs option <--with-trace-refs>`). When defined, a circular doubly linked list of active objects is maintained by adding two extra fields to every :c:type:`PyObject`. Total allocations are tracked as well. Upon exit, all existing references are printed. (In interactive mode this happens after every statement run by the interpreter.)
sv: Genom att definiera :c:macro:`Py_TRACE_REFS` aktiveras referensspårning (se :option:`configure --with-trace-refs option <--with-trace-refs>`). När den definieras upprätthålls en cirkulär dubbellänkad lista över aktiva objekt genom att lägga till två extra fält till varje :c:type:`PyObject`. Totala allokeringar spåras också. Vid avslut skrivs alla befintliga referenser ut. (I interaktivt läge sker detta efter varje sats som körs av tolken)

source: Please refer to :file:`Misc/SpecialBuilds.txt` in the Python source distribution for more detailed information.
sv: Se :file:`Misc/SpecialBuilds.txt` i Python-källdistributionen för mer detaljerad information.

source: Recommended third party tools
sv: Rekommenderade verktyg från tredje part

source: The following third party tools offer both simpler and more sophisticated approaches to creating C, C++ and Rust extensions for Python:
sv: Följande verktyg från tredje part erbjuder både enklare och mer sofistikerade metoder för att skapa C-, C++- och Rust-tillägg för Python:

source: Using tools such as these can help avoid writing code that is tightly bound to a particular version of CPython, avoid reference counting errors, and focus more on your own code than on using the CPython API. In general, new versions of Python can be supported by updating the tool, and your code will often use newer and more efficient APIs automatically. Some tools also support compiling for other implementations of Python from a single set of sources.
sv: Genom att använda verktyg som dessa kan du undvika att skriva kod som är tätt bunden till en viss version av CPython, undvika referensräkningsfel och fokusera mer på din egen kod än på att använda CPython API. I allmänhet kan nya versioner av Python stödjas genom att uppdatera verktyget, och din kod kommer ofta att använda nyare och effektivare API:er automatiskt. Vissa verktyg stöder också kompilering för andra implementeringar av Python från en enda uppsättning källor.

source: These projects are not supported by the same people who maintain Python, and issues need to be raised with the projects directly. Remember to check that the project is still maintained and supported, as the list above may become outdated.
sv: Dessa projekt stöds inte av samma personer som underhåller Python, och frågor måste tas upp med projekten direkt. Kom ihåg att kontrollera att projektet fortfarande underhålls och stöds, eftersom listan ovan kan bli föråldrad.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
sv: `Python Packaging Användarhandbok: Binära tillägg <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
sv: Python Packaging User Guide beskriver inte bara flera tillgängliga verktyg som förenklar skapandet av binära tillägg, utan diskuterar också de olika anledningarna till varför det kan vara önskvärt att skapa en tilläggsmodul i första hand.

source: object
sv: objekt

source: type
sv: typ

source: Py_INCREF (C function)
sv: Py_INCREF (C-funktion)

source: Py_DECREF (C function)
sv: Py_DECREF (C-funktion)

source: PyList_SetItem (C function)
sv: PyList_SetItem (C-funktion)

source: PyTuple_SetItem (C function)
sv: PyTuple_SetItem (C-funktion)

source: PyList_GetItem (C function)
sv: PyList_GetItem (C-funktion)

source: PySequence_GetItem (C function)
sv: PySequence_GetItem (C-funktion)

source: PyErr_Occurred (C function)
sv: PyErr_Occurred (C-funktion)

source: PyErr_SetString (C function)
sv: PyErr_SetString (C-funktion)

source: PyErr_Clear (C function)
sv: PyErr_Clear (C-funktion)

source: exc_info (in module sys)
sv: exc_info (i modul sys)

source: PyErr_ExceptionMatches (C function)
sv: PyErr_ExceptionMatches (C-funktion)

source: Py_XDECREF (C function)
sv: Py_XDECREF (C-funktion)

source: Py_Initialize (C function)
sv: Py_Initialize (C-funktion)

source: module
sv: modul

source: builtins
sv: inbyggda

source: sys
sv: system

source: search
sv: sök

source: path
sv: väg

source: path (in module sys)
sv: sökväg (i modul sys)

source: Py_GetPath (C function)
sv: Py_GetPath (C-funktion)

source: Py_GetPrefix (C function)
sv: Py_GetPrefix (C-funktion)

source: Py_GetExecPrefix (C function)
sv: Py_GetExecPrefix (C-funktion)

source: Py_GetProgramFullPath (C function)
sv: Py_GetProgramFullPath (C-funktion)

source: Py_IsInitialized (C function)
sv: Py_IsInitialized (C-funktion)
