Repository: yeager/python-docs-sv
Catalog: c-api/iter.po
Languages: sv

source: Iterator Protocol
sv: Iteratorprotokoll

source: There are two functions specifically for working with iterators.
sv: Det finns två funktioner som är särskilt avsedda för att arbeta med iteratorer.

source: Return non-zero if the object *o* can be safely passed to :c:func:`PyIter_NextItem` and ``0`` otherwise. This function always succeeds.
sv: Returnerar icke-noll om objektet *o* säkert kan skickas till :c:func:`PyIter_NextItem` och ``0`` annars. Denna funktion lyckas alltid.

source: Return non-zero if the object *o* provides the :class:`AsyncIterator` protocol, and ``0`` otherwise. This function always succeeds.
sv: Returnerar icke-noll om objektet *o* tillhandahåller protokollet :class:`AsyncIterator`, och ``0`` annars. Denna funktion lyckas alltid.

source: Return ``1`` and set *item* to a :term:`strong reference` of the next value of the iterator *iter* on success. Return ``0`` and set *item* to ``NULL`` if there are no remaining values. Return ``-1``, set *item* to ``NULL`` and set an exception on error.
sv: Returnerar ``1`` och sätter *item* till en :term:`strong referens` av nästa värde i iteratorn *iter* vid framgång. Returnerar ``0`` och sätter *item* till ``NULL`` om det inte finns några återstående värden. Returnerar ``-1``, sätter *item* till ``NULL`` och sätter ett undantag vid error.

source: This is an older version of :c:func:`!PyIter_NextItem`, which is retained for backwards compatibility. Prefer :c:func:`PyIter_NextItem`.
sv: Detta är en äldre version av :c:func:`!PyIter_NextItem`, som behålls för bakåtkompatibilitet. Föredrar :c:func:`PyIter_NextItem`.

source: Return the next value from the iterator *o*. The object must be an iterator according to :c:func:`PyIter_Check` (it is up to the caller to check this). If there are no remaining values, returns ``NULL`` with no exception set. If an error occurs while retrieving the item, returns ``NULL`` and passes along the exception.
sv: Returnerar nästa värde från iteratorn *o*. Objektet måste vara en iterator enligt :c:func:`PyIter_Check` (det är upp till den som anropar att kontrollera detta). Om det inte finns några återstående värden returneras ``NULL`` utan att något undantag anges. Om ett fel inträffar när objektet hämtas, returneras ``NULL`` och undantaget skickas vidare.

source: The enum value used to represent different results of :c:func:`PyIter_Send`.
sv: Det enumvärde som används för att representera olika resultat av :c:func:`PyIter_Send`.

source: Sends the *arg* value into the iterator *iter*. Returns:
sv: Skickar *arg*-värdet till iteratorn *iter*. Returnerar:

source: ``PYGEN_RETURN`` if iterator returns. Return value is returned via *presult*.
sv: ``PYGEN_RETURN`` om iteratorn returnerar. Returvärdet returneras via *presult*.

source: ``PYGEN_NEXT`` if iterator yields. Yielded value is returned via *presult*.
sv: ``PYGEN_NEXT`` om iteratorn ger något. Värdet returneras via *presult*.

source: ``PYGEN_ERROR`` if iterator has raised and exception. *presult* is set to ``NULL``.
sv: ``PYGEN_ERROR`` om iteratorn har orsakat ett undantag. *presult* är satt till ``NULL``.
