Repository: yeager/python-docs-sv
Catalog: c-api/marshal.po
Languages: sv

source: Data marshalling support
sv: Stöd för datahantering

source: These routines allow C code to work with serialized objects using the same data format as the :mod:`marshal` module. There are functions to write data into the serialization format, and additional functions that can be used to read the data back. Files used to store marshalled data must be opened in binary mode.
sv: Dessa rutiner gör det möjligt för C-kod att arbeta med serialiserade objekt som använder samma dataformat som modulen :mod:`marshal`. Det finns funktioner för att skriva data till serialiseringsformatet och ytterligare funktioner som kan användas för att läsa tillbaka data. Filer som används för att lagra marshallade data måste öppnas i binärt läge.

source: Numeric values are stored with the least significant byte first.
sv: Numeriska värden lagras med den minst signifikanta byten först.

source: The module supports several versions of the data format; see the :py:mod:`Python module documentation <marshal>` for details.
sv: Modulen stöder flera versioner av dataformatet; se :py:mod:`Python-modulens dokumentation <marshal>` för mer information.

source: The current format version. See :py:data:`marshal.version`.
sv: Den aktuella formatversionen. Se :py:data:`marshal.version`.

source: Marshal a :c:expr:`long` integer, *value*, to *file*. This will only write the least-significant 32 bits of *value*; regardless of the size of the native :c:expr:`long` type. *version* indicates the file format.
sv: Marshala ett :c:expr:`long` heltal, *värde*, till *fil*. Detta kommer endast att skriva de minst signifikanta 32 bitarna av *värde*; oavsett storleken på den ursprungliga :c:expr:`long`-typen. *version* anger filformatet.

source: This function can fail, in which case it sets the error indicator. Use :c:func:`PyErr_Occurred` to check for that.
sv: Den här funktionen kan misslyckas, i vilket fall den anger felindikatorn. Använd :c:func:`PyErr_Occurred` för att kontrollera detta.

source: Marshal a Python object, *value*, to *file*. *version* indicates the file format.
sv: Överför ett Python-objekt, *värde*, till *fil*. *version* anger filformatet.

source: Return a bytes object containing the marshalled representation of *value*. *version* indicates the file format.
sv: Returnerar ett bytesobjekt som innehåller den marshallade representationen av *värde*. *version* anger filformatet.

source: The following functions allow marshalled values to be read back in.
sv: Följande funktioner gör det möjligt att läsa in marshallade värden igen.

source: Return a C :c:expr:`long` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 32-bit value can be read in using this function, regardless of the native size of :c:expr:`long`.
sv: Returnerar ett C :c:expr:`long` från dataströmmen i en :c:expr:`FILE*` som öppnats för läsning. Endast ett 32-bitars värde kan läsas in med den här funktionen, oavsett den ursprungliga storleken på :c:expr:`long`.

source: On error, sets the appropriate exception (:exc:`EOFError`) and returns ``-1``.
sv: Vid fel, anger lämpligt undantag (:exc:`EOFError`) och returnerar ``-1``.

source: Return a C :c:expr:`short` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 16-bit value can be read in using this function, regardless of the native size of :c:expr:`short`.
sv: Returnerar ett C :c:expr:`short` från dataströmmen i en :c:expr:`FILE*` som öppnats för läsning. Endast ett 16-bitars värde kan läsas in med den här funktionen, oavsett den ursprungliga storleken på :c:expr:`short`.

source: Return a Python object from the data stream in a :c:expr:`FILE*` opened for reading.
sv: Returnerar ett Python-objekt från dataströmmen i en :c:expr:`FILE*` som öppnats för läsning.

source: On error, sets the appropriate exception (:exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`) and returns ``NULL``.
sv: Vid fel, anger lämpligt undantag (:exc:`EOFError`, :exc:`ValueError` eller :exc:`TypeError`) och returnerar ``NULL``.

source: Return a Python object from the data stream in a :c:expr:`FILE*` opened for reading. Unlike :c:func:`PyMarshal_ReadObjectFromFile`, this function assumes that no further objects will be read from the file, allowing it to aggressively load file data into memory so that the de-serialization can operate from data in memory rather than reading a byte at a time from the file. Only use these variant if you are certain that you won't be reading anything else from the file.
sv: Returnerar ett Python-objekt från dataströmmen i en :c:expr:`FILE*` som öppnats för läsning. Till skillnad från :c:func:`PyMarshal_ReadObjectFromFile` antar denna funktion att inga fler objekt kommer att läsas från filen, vilket gör det möjligt att aggressivt ladda fildata i minnet så att de-serialiseringen kan fungera från data i minnet snarare än att läsa en byte i taget från filen. Använd endast denna variant om du är säker på att du inte kommer att läsa något annat från filen.

source: Return a Python object from the data stream in a byte buffer containing *len* bytes pointed to by *data*.
sv: Returnerar ett Python-objekt från dataströmmen i en bytebuffert som innehåller *len* bytes som pekas ut av *data*.
