Repository: yeager/python-docs-sv
Catalog: c-api/memoryview.po
Languages: sv

source: MemoryView objects
sv: MemoryView-objekt

source: A :class:`memoryview` object exposes the C level :ref:`buffer interface <bufferobjects>` as a Python object which can then be passed around like any other object.
sv: Ett :class:`memoryview`-objekt exponerar C-nivå :ref:`buffer interface <bufferobjects>` som ett Python-objekt som sedan kan skickas runt som vilket annat objekt som helst.

source: Create a memoryview object from an object that provides the buffer interface. If *obj* supports writable buffer exports, the memoryview object will be read/write, otherwise it may be either read-only or read/write at the discretion of the exporter.
sv: Skapa ett memoryview-objekt från ett objekt som tillhandahåller buffertgränssnittet. Om *obj* stöder skrivbar buffertexport kommer memoryview-objektet att vara skrivskyddat, annars kan det vara antingen skrivskyddat eller skrivskyddat enligt exportörens bedömning.

source: Flag to request a readonly buffer.
sv: Flagga för att begära en skrivskyddad buffert.

source: Flag to request a writable buffer.
sv: Flagga för att begära en skrivbar buffert.

source: Create a memoryview object using *mem* as the underlying buffer. *flags* can be one of :c:macro:`PyBUF_READ` or :c:macro:`PyBUF_WRITE`.
sv: Skapa ett memoryview-objekt med *mem* som underliggande buffert. *flags* kan vara en av :c:macro:`PyBUF_READ` eller :c:macro:`PyBUF_WRITE`.

source: Create a memoryview object wrapping the given buffer structure *view*. For simple byte buffers, :c:func:`PyMemoryView_FromMemory` is the preferred function.
sv: Skapar ett memoryview-objekt som omsluter den givna buffertstrukturen *view*. För enkla byte-buffertar är :c:func:`PyMemoryView_FromMemory` den föredragna funktionen.

source: Create a memoryview object to a :term:`contiguous` chunk of memory (in either 'C' or 'F'ortran *order*) from an object that defines the buffer interface. If memory is contiguous, the memoryview object points to the original memory. Otherwise, a copy is made and the memoryview points to a new bytes object.
sv: Skapa ett memoryview-objekt till en :term:`sammanhängande` bit av minnet (i antingen 'C'- eller 'F'-ortran *order*) från ett objekt som definierar buffertgränssnittet. Om minnet är sammanhängande pekar memoryview-objektet på originalminnet. Annars görs en kopia och memoryview pekar på ett nytt bytes-objekt.

source: *buffertype* can be one of :c:macro:`PyBUF_READ` or :c:macro:`PyBUF_WRITE`.
sv: *buffertype* kan vara en av :c:macro:`PyBUF_READ` eller :c:macro:`PyBUF_WRITE`.

source: Return true if the object *obj* is a memoryview object. It is not currently allowed to create subclasses of :class:`memoryview`. This function always succeeds.
sv: Returnerar true om objektet *obj* är ett memoryview-objekt. Det är för närvarande inte tillåtet att skapa underklasser av :class:`memoryview`. Denna funktion lyckas alltid.

source: Return a pointer to the memoryview's private copy of the exporter's buffer. *mview* **must** be a memoryview instance; this macro doesn't check its type, you must do it yourself or you will risk crashes.
sv: Returnerar en pekare till minnesvyns privata kopia av exportörens buffert. *mview* **måste** vara en memoryview-instans; detta makro kontrollerar inte dess typ, du måste göra det själv eller så riskerar du krascher.

source: Return either a pointer to the exporting object that the memoryview is based on or ``NULL`` if the memoryview has been created by one of the functions :c:func:`PyMemoryView_FromMemory` or :c:func:`PyMemoryView_FromBuffer`. *mview* **must** be a memoryview instance.
sv: Returnerar antingen en pekare till det exporterande objektet som minnesvyn är baserad på eller ``NULL`` om minnesvyn har skapats av någon av funktionerna :c:func:`PyMemoryView_FromMemory` eller :c:func:`PyMemoryView_FromBuffer`. *mview* **måste** vara en memoryview-instans.

source: object
sv: objekt

source: memoryview
sv: minnesvy
