Repository: yeager/python-docs-sv
Catalog: c-api/memory.po
Languages: sv

source: Memory Management
sv: Minneshantering

source: Overview
sv: Översikt

source: Memory management in Python involves a private heap containing all Python objects and data structures. The management of this private heap is ensured internally by the *Python memory manager*. The Python memory manager has different components which deal with various dynamic storage management aspects, like sharing, segmentation, preallocation or caching.
sv: Minneshantering i Python innebär en privat hög som innehåller alla Python-objekt och datastrukturer. Hanteringen av denna privata hög sköts internt av *Pythons minneshanterare*. Pythons minneshanterare har olika komponenter som hanterar olika aspekter av dynamisk lagringshantering, t.ex. delning, segmentering, förallokering eller cachning.

source: At the lowest level, a raw memory allocator ensures that there is enough room in the private heap for storing all Python-related data by interacting with the memory manager of the operating system. On top of the raw memory allocator, several object-specific allocators operate on the same heap and implement distinct memory management policies adapted to the peculiarities of every object type. For example, integer objects are managed differently within the heap than strings, tuples or dictionaries because integers imply different storage requirements and speed/space tradeoffs. The Python memory manager thus delegates some of the work to the object-specific allocators, but ensures that the latter operate within the bounds of the private heap.
sv: På den lägsta nivån ser en råminnesallokerare till att det finns tillräckligt med utrymme i den privata heapen för att lagra alla Python-relaterade data genom att interagera med operativsystemets minneshanterare. Utöver råminnesallokeringen arbetar flera objektspecifika allokeringar på samma hög och implementerar olika minneshanteringspolicyer som är anpassade till varje objekttyps särdrag. Exempelvis hanteras heltalsobjekt annorlunda i heapen än strängar, tupler eller dictionaries eftersom heltal innebär olika lagringskrav och avvägningar mellan hastighet och utrymme. Pythons minneshanterare delegerar således en del av arbetet till de objektspecifika allokeringarna, men ser till att de senare arbetar inom gränserna för den privata heapen.

source: It is important to understand that the management of the Python heap is performed by the interpreter itself and that the user has no control over it, even if they regularly manipulate object pointers to memory blocks inside that heap. The allocation of heap space for Python objects and other internal buffers is performed on demand by the Python memory manager through the Python/C API functions listed in this document.
sv: Det är viktigt att förstå att hanteringen av Pythons heap utförs av tolken själv och att användaren inte har någon kontroll över den, även om de regelbundet manipulerar objektpekare till minnesblock inuti heapen. Allokeringen av heaputrymme för Python-objekt och andra interna buffertar utförs på begäran av Pythons minneshanterare genom de Python/C API-funktioner som listas i detta dokument.

source: To avoid memory corruption, extension writers should never try to operate on Python objects with the functions exported by the C library: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`. This will result in mixed calls between the C allocator and the Python memory manager with fatal consequences, because they implement different algorithms and operate on different heaps. However, one may safely allocate and release memory blocks with the C library allocator for individual purposes, as shown in the following example::
sv: För att undvika minneskorruption bör författare av tillägg aldrig försöka använda Python-objekt med de funktioner som exporteras av C-biblioteket: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` och :c:func:`free`. Detta kommer att resultera i blandade anrop mellan C-allokatorn och Pythons minneshanterare med fatala konsekvenser, eftersom de implementerar olika algoritmer och arbetar på olika heaps. Man kan dock på ett säkert sätt allokera och frigöra minnesblock med C-bibliotekets allokator för individuella ändamål, som visas i följande exempel::

source: PyObject *res; char *buf = (char *) malloc(BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); ...Do some I/O operation involving buf... res = PyBytes_FromString(buf); free(buf); /* malloc'ed */ return res;
sv: PyObject *res; char *buf = (char *) malloc(BUFSIZ); /* för I/O */ om (buf == NULL) return PyErr_NoMemory(); ...Gör någon I/O-operation som involverar buf... res = PyBytes_FromString(buf); free(buf); /* malloc'ed */ returnera res;

source: In this example, the memory request for the I/O buffer is handled by the C library allocator. The Python memory manager is involved only in the allocation of the bytes object returned as a result.
sv: I det här exemplet hanteras minnesbegäran för I/O-bufferten av C-bibliotekets allokator. Pythons minneshanterare är endast involverad i allokeringen av bytesobjektet som returneras som ett resultat.

source: In most situations, however, it is recommended to allocate memory from the Python heap specifically because the latter is under control of the Python memory manager. For example, this is required when the interpreter is extended with new object types written in C. Another reason for using the Python heap is the desire to *inform* the Python memory manager about the memory needs of the extension module. Even when the requested memory is used exclusively for internal, highly specific purposes, delegating all memory requests to the Python memory manager causes the interpreter to have a more accurate image of its memory footprint as a whole. Consequently, under certain circumstances, the Python memory manager may or may not trigger appropriate actions, like garbage collection, memory compaction or other preventive procedures. Note that by using the C library allocator as shown in the previous example, the allocated memory for the I/O buffer escapes completely the Python memory manager.
sv: I de flesta situationer är det dock rekommenderat att allokera minne från Pythons heap, just för att den senare står under kontroll av Pythons minneshanterare. Detta krävs till exempel när tolken utökas med nya objekttyper skrivna i C. En annan anledning till att använda Python-heapen är önskan att *informera* Pythons minneshanterare om minnesbehoven i tilläggsmodulen. Även när det begärda minnet uteslutande används för interna, mycket specifika ändamål, leder delegeringen av alla minnesförfrågningar till Pythons minneshanterare till att tolken får en mer exakt bild av sitt minnesavtryck som helhet. Följaktligen kan Pythons minneshanterare under vissa omständigheter utlösa lämpliga åtgärder, t.ex. sopsortering, minneskomprimering eller andra förebyggande åtgärder. Observera att genom att använda C-bibliotekets allokator som visas i föregående exempel, undgår det allokerade minnet för I/O-bufferten helt Pythons minneshanterare.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to configure the memory allocators used by Python.
sv: Miljövariabeln :envvar:`PYTHONMALLOC` kan användas för att konfigurera de minnesallokatorer som används av Python.

source: The :envvar:`PYTHONMALLOCSTATS` environment variable can be used to print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
sv: Miljövariabeln :envvar:`PYTHONMALLOCSTATS` kan användas för att skriva ut statistik för :ref:`pymalloc memory allocator <pymalloc>` varje gång en ny pymalloc-objektarena skapas och vid avstängning.

source: Allocator Domains
sv: Domäner för allokering

source: All allocating functions belong to one of three different "domains" (see also :c:type:`PyMemAllocatorDomain`). These domains represent different allocation strategies and are optimized for different purposes. The specific details on how every domain allocates memory or what internal functions each domain calls is considered an implementation detail, but for debugging purposes a simplified table can be found at :ref:`here <default-memory-allocators>`. The APIs used to allocate and free a block of memory must be from the same domain. For example, :c:func:`PyMem_Free` must be used to free memory allocated using :c:func:`PyMem_Malloc`.
sv: Alla allokeringsfunktioner tillhör en av tre olika "domäner" (se även :c:type:`PyMemAllocatorDomain`). Dessa domäner representerar olika allokeringsstrategier och är optimerade för olika ändamål. De specifika detaljerna om hur varje domän allokerar minne eller vilka interna funktioner som varje domän anropar anses vara en implementationsdetalj, men för felsökningsändamål finns en förenklad tabell på :ref:`here <default-memory-allocators>`. De API:er som används för att allokera och frigöra ett minnesblock måste vara från samma domän. Till exempel måste :c:func:`PyMem_Free` användas för att frigöra minne som allokerats med :c:func:`PyMem_Malloc`.

source: The three allocation domains are:
sv: De tre tilldelningsdomänerna är:

source: Raw domain: intended for allocating memory for general-purpose memory buffers where the allocation *must* go to the system allocator or where the allocator can operate without an :term:`attached thread state`. The memory is requested directly from the system. See :ref:`Raw Memory Interface <raw-memoryinterface>`.
sv: Rå domän: avsedd för allokering av minne för allmänna minnesbuffertar där allokeringen *måste* gå till systemets allokator eller där allokatorn kan fungera utan ett :term:`attached thread state`. Minnet begärs direkt från systemet. Se :ref:``Raw Memory Interface <raw-memoryinterface>`.

source: "Mem" domain: intended for allocating memory for Python buffers and general-purpose memory buffers where the allocation must be performed with an :term:`attached thread state`. The memory is taken from the Python private heap. See :ref:`Memory Interface <memoryinterface>`.
sv: "Mem"-domän: avsedd för allokering av minne för Python-buffertar och allmänna minnesbuffertar där allokeringen måste utföras med en :term:`attached thread state`. Minnet tas från Pythons privata heap. Se :ref:``Memory Interface <memoryinterface>`.

source: Object domain: intended for allocating memory for Python objects. The memory is taken from the Python private heap. See :ref:`Object allocators <objectinterface>`.
sv: Objektdomän: avsedd för att allokera minne för Python-objekt. Minnet tas från Pythons privata heap. Se :ref:`Objektallokatorer <objectinterface>`.

source: The :term:`free-threaded <free threading>` build requires that only Python objects are allocated using the "object" domain and that all Python objects are allocated using that domain. This differs from the prior Python versions, where this was only a best practice and not a hard requirement.
sv: Bygget :term:``free-threaded <free threading>` kräver att endast Python-objekt allokeras med hjälp av domänen "object" och att alla Python-objekt allokeras med hjälp av den domänen. Detta skiljer sig från de tidigare Python-versionerna, där detta endast var en bästa praxis och inte ett hårt krav.

source: For example, buffers (non-Python objects) should be allocated using :c:func:`PyMem_Malloc`, :c:func:`PyMem_RawMalloc`, or :c:func:`malloc`, but not :c:func:`PyObject_Malloc`.
sv: Till exempel bör buffertar (icke-Python-objekt) allokeras med :c:func:`PyMem_Malloc`, :c:func:`PyMem_RawMalloc` eller :c:func:`malloc`, men inte med :c:func:`PyObject_Malloc`.

source: See :ref:`Memory Allocation APIs <free-threaded-memory-allocation>`.
sv: Se :ref:`Memory Allocation APIs <free-threaded-memory-allocation>`.

source: Raw Memory Interface
sv: Gränssnitt för råminne

source: The following function sets are wrappers to the system allocator. These functions are thread-safe, so a :term:`thread state` does not need to be :term:`attached <attached thread state>`.
sv: Följande funktionsuppsättningar är omslag till systemallokatorn. Dessa funktioner är tråd-säkra, så en :term:`thread state` behöver inte vara :term:`attached <attached thread state>`.

source: The :ref:`default raw memory allocator <default-memory-allocators>` uses the following functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`!free`; call ``malloc(1)`` (or ``calloc(1, 1)``) when requesting zero bytes.
sv: :ref:``standard rå minnesallokering <default-memory-allocators>`` använder följande funktioner: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` och :c:func:`!free`; anropa ``malloc(1)`` (eller ``calloc(1, 1)``) när du begär noll byte.

source: Allocates *n* bytes and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails.
sv: Allokerar *n* byte och returnerar en pekare av typen :c:expr:`void*` till det allokerade minnet, eller ``NULL`` om begäran misslyckas.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawMalloc(1)`` had been called instead. The memory will not have been initialized in any way.
sv: En begäran om noll bytes returnerar en distinkt pekare som inte är ``NULL`` om möjligt, som om ``PyMem_RawMalloc(1)`` hade anropats istället. Minnet kommer inte att ha initialiserats på något sätt.

source: Allocates *nelem* elements each whose size in bytes is *elsize* and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails. The memory is initialized to zeros.
sv: Allokerar *nelem* element vars storlek i byte är *elsize* och returnerar en pekare av typen :c:expr:`void*` till det allokerade minnet, eller ``NULL`` om begäran misslyckas. Minnet initialiseras till nollor.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawCalloc(1, 1)`` had been called instead.
sv: Om man begär noll element eller element med storleken noll bytes returneras en distinkt icke-``NULL`` pekare om möjligt, som om ``PyMem_RawCalloc(1, 1)`` hade anropats istället.

source: Resizes the memory block pointed to by *p* to *n* bytes. The contents will be unchanged to the minimum of the old and the new sizes.
sv: Ändrar storlek på minnesblocket som pekas ut av *p* till *n* byte. Innehållet kommer att vara oförändrat till det minsta av den gamla och den nya storleken.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_RawMalloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
sv: Om *p* är ``NULL`` motsvarar anropet ``PyMem_RawMalloc(n)``; om *n* är lika med noll ändras minnesblockets storlek men det frigörs inte och den returnerade pekaren är inte ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`.
sv: Om inte *p* är ``NULL`` måste den ha returnerats av ett tidigare anrop till :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` eller :c:func:`PyMem_RawCalloc`.

source: If the request fails, :c:func:`PyMem_RawRealloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
sv: Om begäran misslyckas returnerar :c:func:`PyMem_RawRealloc` ``NULL`` och *p* förblir en giltig pekare till det föregående minnesområdet.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`. Otherwise, or if ``PyMem_RawFree(p)`` has been called before, undefined behavior occurs.
sv: Frigör minnesblocket som pekas ut av *p*, vilket måste ha returnerats av ett tidigare anrop till :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` eller :c:func:`PyMem_RawCalloc`. Annars, eller om ``PyMem_RawFree(p)`` har anropats tidigare, uppstår ett odefinierat beteende.

source: If *p* is ``NULL``, no operation is performed.
sv: Om *p* är ``NULL`` utförs ingen åtgärd.

source: Memory Interface
sv: Minnesgränssnitt

source: The following function sets, modeled after the ANSI C standard, but specifying behavior when requesting zero bytes, are available for allocating and releasing memory from the Python heap.
sv: Följande funktionsuppsättningar, som är modellerade efter ANSI C-standarden, men som specificerar beteendet när noll byte begärs, är tillgängliga för att allokera och frigöra minne från Pythons heap.

source: The :ref:`default memory allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
sv: I :ref:``default memory allocator <default-memory-allocators>` används :ref:`pymalloc memory allocator <pymalloc>`.

source: There must be an :term:`attached thread state` when using these functions.
sv: Det måste finnas en :term:`attached thread state` när dessa funktioner används.

source: The default allocator is now pymalloc instead of system :c:func:`malloc`.
sv: Standardallokeraren är nu pymalloc istället för system :c:func:`malloc`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
sv: En begäran om noll bytes returnerar en distinkt pekare som inte är ``NULL`` om möjligt, som om ``PyMem_Malloc(1)`` hade anropats istället. Minnet kommer inte att ha initialiserats på något sätt.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Calloc(1, 1)`` had been called instead.
sv: Om man begär noll element eller element med storleken noll bytes returneras en distinkt icke-``NULL`` pekare om möjligt, som om ``PyMem_Calloc(1, 1)`` hade anropats istället.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
sv: Om *p* är ``NULL`` motsvarar anropet ``PyMem_Malloc(n)``; om *n* är lika med noll ändras minnesblockets storlek men det frigörs inte och den returnerade pekaren är inte ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`.
sv: Om inte *p* är ``NULL`` måste den ha returnerats av ett tidigare anrop till :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` eller :c:func:`PyMem_Calloc`.

source: If the request fails, :c:func:`PyMem_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
sv: Om begäran misslyckas returnerar :c:func:`PyMem_Realloc` ``NULL`` och *p* förblir en giltig pekare till det föregående minnesområdet.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`. Otherwise, or if ``PyMem_Free(p)`` has been called before, undefined behavior occurs.
sv: Frigör minnesblocket som pekas ut av *p*, vilket måste ha returnerats av ett tidigare anrop till :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` eller :c:func:`PyMem_Calloc`. Annars, eller om ``PyMem_Free(p)`` har anropats tidigare, uppstår ett odefinierat beteende.

source: The following type-oriented macros are provided for convenience. Note that *TYPE* refers to any C type.
sv: Följande typorienterade makron tillhandahålls för enkelhetens skull. Observera att *TYPE* hänvisar till vilken C-typ som helst.

source: Same as :c:func:`PyMem_Malloc`, but allocates ``(n * sizeof(TYPE))`` bytes of memory. Returns a pointer cast to ``TYPE*``. The memory will not have been initialized in any way.
sv: Samma som :c:func:`PyMem_Malloc`, men allokerar ``(n * sizeof(TYPE))`` bytes minne. Returnerar en pekare som kastas till ``TYPE*``. Minnet kommer inte att ha initialiserats på något sätt.

source: Same as :c:func:`PyMem_Realloc`, but the memory block is resized to ``(n * sizeof(TYPE))`` bytes. Returns a pointer cast to ``TYPE*``. On return, *p* will be a pointer to the new memory area, or ``NULL`` in the event of failure.
sv: Samma som :c:func:`PyMem_Realloc`, men minnesblocket ändras till ``(n * sizeof(TYPE))`` bytes. Returnerar en pekare som kastats till ``TYPE*``. Vid retur kommer *p* att vara en pekare till det nya minnesområdet, eller ``NULL`` i händelse av fel.

source: This is a C preprocessor macro; *p* is always reassigned. Save the original value of *p* to avoid losing memory when handling errors.
sv: Detta är ett C preprocessormakro; *p* är alltid återtilldelad. Spara originalvärdet för *p* för att undvika minnesförlust vid felhantering.

source: Same as :c:func:`PyMem_Free`.
sv: Samma som :c:func:`PyMem_Free`.

source: In addition, the following macro sets are provided for calling the Python memory allocator directly, without involving the C API functions listed above. However, note that their use does not preserve binary compatibility across Python versions and is therefore deprecated in extension modules.
sv: Dessutom finns följande makrouppsättningar för att anropa Pythons minnesallokator direkt, utan att involvera C API-funktionerna som listas ovan. Observera dock att användningen av dessa inte bevarar binär kompatibilitet mellan olika Python-versioner och därför inte rekommenderas i tilläggsmoduler.

source: ``PyMem_MALLOC(size)``
sv: ``PyMem_MALLOC(storlek)``

source: ``PyMem_NEW(type, size)``
sv: ``PyMem_NEW(typ, storlek)```

source: ``PyMem_REALLOC(ptr, size)``
sv: ``PyMem_REALLOC(ptr, storlek)```

source: ``PyMem_RESIZE(ptr, type, size)``
sv: ``PyMem_RESIZE(ptr, typ, storlek)```

source: Object allocators
sv: Objektallokatorer

source: There is no guarantee that the memory returned by these allocators can be successfully cast to a Python object when intercepting the allocating functions in this domain by the methods described in the :ref:`Customize Memory Allocators <customize-memory-allocators>` section.
sv: Det finns ingen garanti för att det minne som returneras av dessa allokeringsfunktioner framgångsrikt kan kastas till ett Python-objekt när man avlyssnar allokeringsfunktionerna i den här domänen med de metoder som beskrivs i avsnittet :ref:``Customize Memory Allocators <customize-memory-allocators>``.

source: The :ref:`default object allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
sv: I :ref:``default object allocator <default-memory-allocators>` används :ref:``pymalloc memory allocator <pymalloc>`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
sv: Om noll bytes begärs returneras en distinkt icke-``NULL`` pekare om möjligt, som om ``PyObject_Malloc(1)`` hade anropats istället. Minnet kommer inte att ha initialiserats på något sätt.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Calloc(1, 1)`` had been called instead.
sv: Om man begär noll element eller element med storleken noll bytes returneras en distinkt icke-``NULL`` pekare om möjligt, som om ``PyObject_Calloc(1, 1)`` hade anropats istället.

source: If *p* is ``NULL``, the call is equivalent to ``PyObject_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
sv: Om *p* är ``NULL`` motsvarar anropet ``PyObject_Malloc(n)``; om *n* är lika med noll ändras minnesblockets storlek men det frigörs inte och den returnerade pekaren är inte ``NULL``.
