Repository: yeager/python-docs-sv
Catalog: c-api/memory.po
Languages: sv

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`.
sv: Om inte *p* är ``NULL`` måste den ha returnerats av ett tidigare anrop till :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` eller :c:func:`PyObject_Calloc`.

source: If the request fails, :c:func:`PyObject_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
sv: Om begäran misslyckas returnerar :c:func:`PyObject_Realloc` ``NULL`` och *p* förblir en giltig pekare till det tidigare minnesområdet.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`. Otherwise, or if ``PyObject_Free(p)`` has been called before, undefined behavior occurs.
sv: Frigör minnesblocket som pekas ut av *p*, vilket måste ha returnerats av ett tidigare anrop till :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` eller :c:func:`PyObject_Calloc`. Annars, eller om ``PyObject_Free(p)`` har anropats tidigare, uppstår ett odefinierat beteende.

source: Do not call this directly to free an object's memory; call the type's :c:member:`~PyTypeObject.tp_free` slot instead.
sv: Anropa inte detta direkt för att frigöra ett objekts minne; anropa istället typens :c:member:`~PyTypeObject.tp_free` slot.

source: Do not use this for memory allocated by :c:macro:`PyObject_GC_New` or :c:macro:`PyObject_GC_NewVar`; use :c:func:`PyObject_GC_Del` instead.
sv: Använd inte detta för minne som allokerats av :c:macro:`PyObject_GC_New` eller :c:macro:`PyObject_GC_NewVar`; använd istället :c:func:`PyObject_GC_Del`.

source: :c:func:`PyObject_GC_Del` is the equivalent of this function for memory allocated by types that support garbage collection.
sv: :c:func:`PyObject_GC_Del` är motsvarigheten till denna funktion för minne som allokerats av typer som stöder garbage collection.

source: :c:macro:`PyObject_New`
sv: :c:makro:`PyObject_New`

source: :c:macro:`PyObject_NewVar`
sv: :c:makro:`PyObject_NewVar`

source: Default Memory Allocators
sv: Standard minnesallokatorer

source: Default memory allocators:
sv: Standardminnesallokatorer:

source: Configuration
sv: Konfiguration

source: Name
sv: Namn

source: Release build
sv: Release-version

source: Debug build
sv: Felsök byggnaden

source: ``malloc`` + debug
sv: ``malloc`` + felsökning

source: ``pymalloc`` + debug
sv: ``pymalloc`` + felsökning

source: Release build, without pymalloc
sv: Release-version, utan pymalloc

source: Debug build, without pymalloc
sv: Felsökning, utan pymalloc

source: Name: value for :envvar:`PYTHONMALLOC` environment variable.
sv: Namn: värde för miljövariabeln :envvar:`PYTHONMALLOC`.

source: ``malloc``: system allocators from the standard C library, C functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`.
sv: ``malloc``: systemallokatorer från standard C-biblioteket, C-funktioner: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` och :c:func:`free`.

source: ``pymalloc``: :ref:`pymalloc memory allocator <pymalloc>`.
sv: ``pymalloc``: :ref:`pymalloc minnesallokering <pymalloc>`.

source: ``mimalloc``: :ref:`mimalloc memory allocator <mimalloc>`. The pymalloc allocator will be used if mimalloc support isn't available.
sv: ``mimalloc``: :ref:``mimalloc minnesallokator <mimalloc>`. Allokeraren pymalloc kommer att användas om stöd för mimalloc inte finns tillgängligt.

source: "+ debug": with :ref:`debug hooks on the Python memory allocators <pymem-debug-hooks>`.
sv: "+ debug": med :ref:`debugkrokar på Pythons minnesallokatorer <pymem-debug-hooks>`.

source: "Debug build": :ref:`Python build in debug mode <debug-build>`.
sv: "Debug build": :ref:`Python byggs i felsökningsläge <debug-build>`.

source: Customize Memory Allocators
sv: Anpassa minnesfördelare

source: Structure used to describe a memory block allocator. The structure has the following fields:
sv: Struktur som används för att beskriva en minnesblocksallokering. Strukturen har följande fält:

source: Field
sv: Fält

source: Meaning
sv: Betydelse

source: user context passed as first argument
sv: användarkontext som skickas som första argument

source: allocate a memory block
sv: allokera ett minnesblock

source: allocate a memory block initialized with zeros
sv: allokera ett minnesblock som initieras med nollor

source: allocate or resize a memory block
sv: allokera eller ändra storlek på ett minnesblock

source: free a memory block
sv: frigöra ett minnesblock

source: The :c:type:`!PyMemAllocator` structure was renamed to :c:type:`PyMemAllocatorEx` and a new ``calloc`` field was added.
sv: Strukturen :c:type:`!PyMemAllocator` döptes om till :c:type:`PyMemAllocatorEx` och ett nytt fält ``calloc`` lades till.

source: Enum used to identify an allocator domain. Domains:
sv: Enum som används för att identifiera en allokeringsdomän. Domäner:

source: Functions:
sv: Funktioner:

source: Get the memory block allocator of the specified domain.
sv: Hämta minnesblockstilldelaren för den angivna domänen.

source: Set the memory block allocator of the specified domain.
sv: Ställ in minnesblocksallokeringen för den angivna domänen.

source: The new allocator must return a distinct non-``NULL`` pointer when requesting zero bytes.
sv: Den nya allokeraren måste returnera en distinkt pekare som inte är ``NULL`` när den begär noll bytes.

source: For the :c:macro:`PYMEM_DOMAIN_RAW` domain, the allocator must be thread-safe: a :term:`thread state` is not :term:`attached <attached thread state>` when the allocator is called.
sv: För domänen :c:macro:`PYMEM_DOMAIN_RAW` måste allokeraren vara tråd-säker: ett :term:`thread state` är inte :term:`attached <attached thread state>` när allokeraren anropas.

source: For the remaining domains, the allocator must also be thread-safe: the allocator may be called in different interpreters that do not share a :term:`GIL`.
sv: För de återstående domänerna måste allokeraren också vara tråd-säker: allokeraren kan anropas i olika tolkare som inte delar en :term:`GIL`.

source: If the new allocator is not a hook (does not call the previous allocator), the :c:func:`PyMem_SetupDebugHooks` function must be called to reinstall the debug hooks on top on the new allocator.
sv: Om den nya allokeringsenheten inte är en hook (anropar inte den föregående allokeringsenheten) måste funktionen :c:func:`PyMem_SetupDebugHooks` anropas för att installera om debughooks ovanpå den nya allokeringsenheten.

source: See also :c:member:`PyPreConfig.allocator` and :ref:`Preinitialize Python with PyPreConfig <c-preinit>`.
sv: Se även :c:member:`PyPreConfig.allocator` och :ref:`Preinitialisera Python med PyPreConfig <c-preinit>`.

source: :c:func:`PyMem_SetAllocator` does have the following contract:
sv: :c:func:`PyMem_SetAllocator` har följande kontrakt:

source: It can be called after :c:func:`Py_PreInitialize` and before :c:func:`Py_InitializeFromConfig` to install a custom memory allocator. There are no restrictions over the installed allocator other than the ones imposed by the domain (for instance, the Raw Domain allows the allocator to be called without an :term:`attached thread state`). See :ref:`the section on allocator domains <allocator-domains>` for more information.
sv: Den kan anropas efter :c:func:`Py_PreInitialize` och före :c:func:`Py_InitializeFromConfig` för att installera en anpassad minnesallokering. Det finns inga andra begränsningar för den installerade allokatorn än de som domänen inför (till exempel tillåter Raw Domain att allokatorn anropas utan en :term:`attached thread state`). Se :ref:``avsnittet om allokeringsdomäner <allocator-domains>` för mer information.

source: If called after Python has finish initializing (after :c:func:`Py_InitializeFromConfig` has been called) the allocator **must** wrap the existing allocator. Substituting the current allocator for some other arbitrary one is **not supported**.
sv: Om den anropas efter att Python har slutfört initialiseringen (efter att :c:func:`Py_InitializeFromConfig` har anropats) måste allokatorn **omhölja** den befintliga allokatorn. Att ersätta den aktuella allokatorn med någon annan godtycklig allokator stöds **inte**.

source: All allocators must be thread-safe.
sv: Alla allokatorer måste vara trådsäkra.

source: Setup :ref:`debug hooks in the Python memory allocators <pymem-debug-hooks>` to detect memory errors.
sv: Installera :ref:`debug-krokar i Pythons minnesallokatorer <pymem-debug-hooks>` för att upptäcka minnesfel.

source: Debug hooks on the Python memory allocators
sv: Felsökningskrokar på Pythons minnesallokatorer

source: When :ref:`Python is built in debug mode <debug-build>`, the :c:func:`PyMem_SetupDebugHooks` function is called at the :ref:`Python preinitialization <c-preinit>` to setup debug hooks on Python memory allocators to detect memory errors.
sv: När :ref:`Python byggs i felsökningsläge <debug-build>`, anropas funktionen :c:func:`PyMem_SetupDebugHooks` vid :ref:`Pythons förinitialisering <c-preinit>` för att ställa in felsökningskrokar på Pythons minnesallokatorer för att upptäcka minnesfel.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to install debug hooks on a Python compiled in release mode (ex: ``PYTHONMALLOC=debug``).
sv: Miljövariabeln :envvar:`PYTHONMALLOC` kan användas för att installera debug-krokar på ett Python som kompilerats i release-läge (ex: ``PYTHONMALLOC=debug``).

source: The :c:func:`PyMem_SetupDebugHooks` function can be used to set debug hooks after calling :c:func:`PyMem_SetAllocator`.
sv: Funktionen :c:func:`PyMem_SetupDebugHooks` kan användas för att ställa in debug-krokar efter anrop av :c:func:`PyMem_SetAllocator`.

source: These debug hooks fill dynamically allocated memory blocks with special, recognizable bit patterns. Newly allocated memory is filled with the byte ``0xCD`` (``PYMEM_CLEANBYTE``), freed memory is filled with the byte ``0xDD`` (``PYMEM_DEADBYTE``). Memory blocks are surrounded by "forbidden bytes" filled with the byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Strings of these bytes are unlikely to be valid addresses, floats, or ASCII strings.
sv: Dessa debughooks fyller dynamiskt allokerade minnesblock med speciella, igenkännbara bitmönster. Nytilldelat minne fylls med bytena ``0xCD`` (``PYMEM_CLEANBYTE``), frigjort minne fylls med bytena ``0xDD`` (``PYMEM_DEADBYTE``). Minnesblock omges av "förbjudna byte" som fylls med byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Strängar av dessa byte är sannolikt inte giltiga adresser, flyttal eller ASCII-strängar.

source: Runtime checks:
sv: Kontroll av körtid:

source: Detect API violations. For example, detect if :c:func:`PyObject_Free` is called on a memory block allocated by :c:func:`PyMem_Malloc`.
sv: Upptäck API-överträdelser. Detektera till exempel om :c:func:`PyObject_Free` anropas på ett minnesblock som allokerats av :c:func:`PyMem_Malloc`.

source: Detect write before the start of the buffer (buffer underflow).
sv: Detekterar skrivning före buffertens början (bufferten underflödar).

source: Detect write after the end of the buffer (buffer overflow).
sv: Detektera skrivning efter slutet av bufferten (buffer overflow).

source: Check that there is an :term:`attached thread state` when allocator functions of :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) and :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) domains are called.
sv: Kontrollera att det finns en :term:`attached thread state` när allokeringsfunktioner i domänerna :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) och :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) anropas.

source: On error, the debug hooks use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated. The traceback is only displayed if :mod:`tracemalloc` is tracing Python memory allocations and the memory block was traced.
sv: Vid fel använder debug-krokarna modulen :mod:`tracemalloc` för att få en spårning av var ett minnesblock allokerades. Spårningen visas bara om :mod:`tracemalloc` spårar Python-minnesallokeringar och minnesblocket spårades.

source: Let *S* = ``sizeof(size_t)``. ``2*S`` bytes are added at each end of each block of *N* bytes requested. The memory layout is like so, where p represents the address returned by a malloc-like or realloc-like function (``p[i:j]`` means the slice of bytes from ``*(p+i)`` inclusive up to ``*(p+j)`` exclusive; note that the treatment of negative indices differs from a Python slice):
sv: Låt *S* = ``sizeof(size_t)``. ``2*S`` bytes läggs till i vardera änden av varje block om *N* bytes som begärs. Minneslayouten ser ut så här, där p representerar adressen som returneras av en malloc-liknande eller realloc-liknande funktion (``p[i:j]`` betyder byteskivan från ``*(p+i)`` inklusive upp till ``*(p+j)`` exklusive; observera att behandlingen av negativa index skiljer sig från en Python-skiva):

source: Number of bytes originally asked for. This is a size_t, big-endian (easier to read in a memory dump).
sv: Antal bytes som ursprungligen begärdes. Detta är en size_t, big-endian (lättare att läsa i en minnesdump).

source: API identifier (ASCII character):
sv: API-identifierare (ASCII-tecken):

source: ``'r'`` for :c:macro:`PYMEM_DOMAIN_RAW`.
sv: ``'r'`` för :c:makro:`PYMEM_DOMAIN_RAW`.

source: ``'m'`` for :c:macro:`PYMEM_DOMAIN_MEM`.
sv: ``'m'`` för :c:macro:`PYMEM_DOMAIN_MEM`.

source: ``'o'`` for :c:macro:`PYMEM_DOMAIN_OBJ`.
sv: ``'o'`` för :c:makro:`PYMEM_DOMAIN_OBJ`.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch under- writes and reads.
sv: Kopior av PYMEM_FORBIDDENBYTE. Används för att fånga upp underskrivna och underlästa filer.

source: The requested memory, filled with copies of PYMEM_CLEANBYTE, used to catch reference to uninitialized memory. When a realloc-like function is called requesting a larger memory block, the new excess bytes are also filled with PYMEM_CLEANBYTE. When a free-like function is called, these are overwritten with PYMEM_DEADBYTE, to catch reference to freed memory. When a realloc- like function is called requesting a smaller memory block, the excess old bytes are also filled with PYMEM_DEADBYTE.
sv: Det begärda minnet fylls med kopior av PYMEM_CLEANBYTE, som används för att fånga upp referenser till oinitialiserat minne. När en realloc-liknande funktion anropas och begär ett större minnesblock fylls även de nya överflödiga byte med PYMEM_CLEANBYTE. När en free-liknande funktion anropas skrivs dessa över med PYMEM_DEADBYTE, för att fånga referenser till frigjort minne. När en realloc-liknande funktion anropas och begär ett mindre minnesblock, fylls även de överflödiga gamla bytena med PYMEM_DEADBYTE.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch over- writes and reads.
sv: Kopior av PYMEM_FORBIDDENBYTE. Används för att fånga upp överskrivningar och läsningar.

source: Only used if the ``PYMEM_DEBUG_SERIALNO`` macro is defined (not defined by default).
sv: Används endast om makrot ``PYMEM_DEBUG_SERIALNO`` är definierat (inte definierat som standard).

source: A serial number, incremented by 1 on each call to a malloc-like or realloc-like function. Big-endian :c:type:`size_t`. If "bad memory" is detected later, the serial number gives an excellent way to set a breakpoint on the next run, to capture the instant at which this block was passed out. The static function bumpserialno() in obmalloc.c is the only place the serial number is incremented, and exists so you can set such a breakpoint easily.
sv: Ett serienummer som ökas med 1 vid varje anrop till en malloc-liknande eller realloc-liknande funktion. Big-endian :c:type:`size_t`. Om "dåligt minne" upptäcks senare är serienumret ett utmärkt sätt att sätta en brytpunkt vid nästa körning, för att fånga ögonblicket då detta block skickades ut. Den statiska funktionen bumpserialno() i obmalloc.c är det enda stället där serienumret ökas, och den finns för att du enkelt ska kunna sätta en sådan brytpunkt.

source: A realloc-like or free-like function first checks that the PYMEM_FORBIDDENBYTE bytes at each end are intact. If they've been altered, diagnostic output is written to stderr, and the program is aborted via Py_FatalError(). The other main failure mode is provoking a memory error when a program reads up one of the special bit patterns and tries to use it as an address. If you get in a debugger then and look at the object, you're likely to see that it's entirely filled with PYMEM_DEADBYTE (meaning freed memory is getting used) or PYMEM_CLEANBYTE (meaning uninitialized memory is getting used).
sv: En realloc-liknande eller free-liknande funktion kontrollerar först att PYMEM_FORBIDDENBYTE-bytena i varje ände är intakta. Om de har ändrats skrivs en diagnostisk utdata till stderr och programmet avbryts via Py_FatalError(). Det andra huvudsakliga felet är att provocera fram ett minnesfel när ett program läser upp ett av de speciella bitmönstren och försöker använda det som en adress. Om du då går in i en debugger och tittar på objektet kommer du sannolikt att se att det är helt fyllt med PYMEM_DEADBYTE (vilket betyder att frigjort minne används) eller PYMEM_CLEANBYTE (vilket betyder att oinitialiserat minne används).

source: The :c:func:`PyMem_SetupDebugHooks` function now also works on Python compiled in release mode. On error, the debug hooks now use :mod:`tracemalloc` to get the traceback where a memory block was allocated. The debug hooks now also check if there is an :term:`attached thread state` when functions of :c:macro:`PYMEM_DOMAIN_OBJ` and :c:macro:`PYMEM_DOMAIN_MEM` domains are called.
sv: Funktionen :c:func:`PyMem_SetupDebugHooks` fungerar nu även på Python som kompilerats i release-läge. Vid fel använder debuggkrokarna nu :mod:`tracemalloc` för att få en spårning av var ett minnesblock allokerades. Debuggkrokarna kontrollerar nu också om det finns en :term:`attached thread state` när funktioner i domänerna :c:macro:`PYMEM_DOMAIN_OBJ` och :c:macro:`PYMEM_DOMAIN_MEM` anropas.

source: Byte patterns ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) and ``0xFB`` (``PYMEM_FORBIDDENBYTE``) have been replaced with ``0xCD``, ``0xDD`` and ``0xFD`` to use the same values than Windows CRT debug ``malloc()`` and ``free()``.
sv: Bytemönstren ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) och ``0xFB`` (``PYMEM_FORBIDDENBYTE``) har ersatts med ``0xCD``, ``0xDD`` och ``0xFD`` för att använda samma värden som Windows CRT debug ``malloc()`` och ``free()``.

source: The pymalloc allocator
sv: Allokeringsverktyget pymalloc

source: Python has a *pymalloc* allocator optimized for small objects (smaller or equal to 512 bytes) with a short lifetime. It uses memory mappings called "arenas" with a fixed size of either 256 KiB on 32-bit platforms or 1 MiB on 64-bit platforms. It falls back to :c:func:`PyMem_RawMalloc` and :c:func:`PyMem_RawRealloc` for allocations larger than 512 bytes.
sv: Python har en *pymalloc*-allokering som är optimerad för små objekt (mindre eller lika med 512 byte) med kort livslängd. Den använder minnesmappningar som kallas "arenor" med en fast storlek på antingen 256 KiB på 32-bitars plattformar eller 1 MiB på 64-bitars plattformar. Den faller tillbaka till :c:func:`PyMem_RawMalloc` och :c:func:`PyMem_RawRealloc` för allokeringar större än 512 byte.

source: *pymalloc* is the :ref:`default allocator <default-memory-allocators>` of the :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) and :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) domains.
sv: *pymalloc* är :ref:`standardallokering <default-memory-allocators>` för domänerna :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) och :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`).

source: The arena allocator uses the following functions:
sv: Arenaallokeringen använder sig av följande funktioner:

source: :c:func:`!VirtualAlloc` and :c:func:`!VirtualFree` on Windows,
sv: :c:func:`!VirtualAlloc` och :c:func:`!VirtualFree` i Windows,

source: :c:func:`!mmap` and :c:func:`!munmap` if available,
sv: :c:func:`!mmap` och :c:func:`!munmap` om tillgängliga,

source: :c:func:`malloc` and :c:func:`free` otherwise.
sv: :c:func:`malloc` och :c:func:`free` annars.

source: This allocator is disabled if Python is configured with the :option:`--without-pymalloc` option. It can also be disabled at runtime using the :envvar:`PYTHONMALLOC` environment variable (ex: ``PYTHONMALLOC=malloc``).
sv: Denna allokator inaktiveras om Python konfigureras med alternativet :option:`--without-pymalloc`. Den kan också inaktiveras under körning med hjälp av miljövariabeln :envvar:`PYTHONMALLOC` (ex: ``PYTHONMALLOC=malloc``).

source: Typically, it makes sense to disable the pymalloc allocator when building Python with AddressSanitizer (:option:`--with-address-sanitizer`) which helps uncover low level bugs within the C code.
sv: Vanligtvis är det vettigt att inaktivera allokeringsverktyget pymalloc när man bygger Python med AddressSanitizer (:option:`--with-address-sanitizer`), vilket hjälper till att upptäcka lågnivåbuggar i C-koden.

source: Customize pymalloc Arena Allocator
sv: Anpassa pymalloc Arena Allocator

source: Structure used to describe an arena allocator. The structure has three fields:
sv: Struktur som används för att beskriva en arenaallokering. Strukturen har tre fält:

source: allocate an arena of size bytes
sv: allokera en arena av storleken bytes

source: free an arena
sv: frigöra en arena

source: Get the arena allocator.
sv: Hämta arenans allokeringsenhet.

source: Set the arena allocator.
sv: Ställ in arenaallokeringen.

source: The mimalloc allocator
sv: Allokeringsverktyget mimalloc

source: Python supports the mimalloc allocator when the underlying platform support is available. mimalloc "is a general purpose allocator with excellent performance characteristics. Initially developed by Daan Leijen for the runtime systems of the Koka and Lean languages."
sv: Python stöder allokatorn mimalloc när den underliggande plattformens stöd är tillgängligt. mimalloc "är en allokator för allmänt ändamål med utmärkta prestandaegenskaper. Den utvecklades ursprungligen av Daan Leijen för körtidssystemen för språken Koka och Lean."

source: Track an allocated memory block in the :mod:`tracemalloc` module.
sv: Spåra ett allokerat minnesblock i modulen :mod:`tracemalloc`.

source: Return ``0`` on success, return ``-1`` on error (failed to allocate memory to store the trace). Return ``-2`` if tracemalloc is disabled.
sv: Returnera ``0`` vid framgång, returnera ``-1`` vid fel (misslyckades med att allokera minne för att lagra spårningen). Returnerar ``-2`` om tracemalloc är inaktiverat.

source: If memory block is already tracked, update the existing trace.
sv: Om minnesblocket redan är spårat, uppdatera den befintliga spårningen.

source: Untrack an allocated memory block in the :mod:`tracemalloc` module. Do nothing if the block was not tracked.
sv: Ta bort spårningen av ett allokerat minnesblock i modulen :mod:`tracemalloc`. Gör ingenting om blocket inte spårades.

source: Return ``-2`` if tracemalloc is disabled, otherwise return ``0``.
sv: Returnerar ``-2`` om tracemalloc är inaktiverat, annars returneras ``0``.

source: Examples
sv: Exempel

source: Here is the example from section :ref:`memoryoverview`, rewritten so that the I/O buffer is allocated from the Python heap by using the first function set::
sv: Här är exemplet från avsnitt :ref:`memoryoverview`, omskrivet så att I/O-bufferten allokeras från Pythons heap med hjälp av den första funktionen set::
