Repository: yeager/python-docs-sv
Catalog: c-api/memory.po
Languages: sv

source: PyObject *res; char *buf = (char *) PyMem_Malloc(BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); /* ...Do some I/O operation involving buf... */ res = PyBytes_FromString(buf); PyMem_Free(buf); /* allocated with PyMem_Malloc */ return res;
sv: PyObject *res; char *buf = (char *) PyMem_Malloc(BUFSIZ); /* för I/O */ om (buf == NULL) return PyErr_NoMemory(); /* ...Gör någon I/O-operation som involverar buf... */ res = PyBytes_FromString(buf); PyMem_Free(buf); /* allokerad med PyMem_Malloc */ returnera res;

source: The same code using the type-oriented function set::
sv: Samma kod med hjälp av den typorienterade funktionen set::

source: PyObject *res; char *buf = PyMem_New(char, BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); /* ...Do some I/O operation involving buf... */ res = PyBytes_FromString(buf); PyMem_Free(buf); /* allocated with PyMem_New */ return res;
sv: PyObject *res; char *buf = PyMem_New(char, BUFSIZ); /* för I/O */ if (buf == NULL) return PyErr_NoMemory(); /* ...Gör någon I/O-operation som involverar buf... */ res = PyBytes_FromString(buf); PyMem_Free(buf); /* allokeras med PyMem_New */ returnera res;

source: Note that in the two examples above, the buffer is always manipulated via functions belonging to the same set. Indeed, it is required to use the same memory API family for a given memory block, so that the risk of mixing different allocators is reduced to a minimum. The following code sequence contains two errors, one of which is labeled as *fatal* because it mixes two different allocators operating on different heaps. ::
sv: Observera att i de två exemplen ovan manipuleras bufferten alltid via funktioner som tillhör samma uppsättning. Det är faktiskt nödvändigt att använda samma minnes-API-familj för ett visst minnesblock, så att risken för att blanda olika allokatorer reduceras till ett minimum. Följande kodsekvens innehåller två fel, varav det ena är märkt som *dödligt* eftersom det blandar två olika allokatorer som arbetar på olika heaps. ::

source: char *buf1 = PyMem_New(char, BUFSIZ); char *buf2 = (char *) malloc(BUFSIZ); char *buf3 = (char *) PyMem_Malloc(BUFSIZ); ... PyMem_Del(buf3); /* Wrong -- should be PyMem_Free() */ free(buf2); /* Right -- allocated via malloc() */ free(buf1); /* Fatal -- should be PyMem_Free() */
sv: char *buf1 = PyMem_New(char, BUFSIZ); char *buf2 = (char *) malloc(BUFSIZ); char *buf3 = (char *) PyMem_Malloc(BUFSIZ); ... PyMem_Del(buf3); /* Fel -- borde vara PyMem_Free() */ free(buf2); /* Rätt -- allokerad via malloc() */ free(buf1); /* Fatalt -- bör vara PyMem_Free() */

source: In addition to the functions aimed at handling raw memory blocks from the Python heap, objects in Python are allocated and released with :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar` and :c:func:`PyObject_Free`.
sv: Förutom de funktioner som syftar till att hantera råa minnesblock från Pythons heap allokeras och frigörs objekt i Python med :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar` och :c:func:`PyObject_Free`.

source: These will be explained in the next chapter on defining and implementing new object types in C.
sv: Dessa kommer att förklaras i nästa kapitel om att definiera och implementera nya objekttyper i C.

source: malloc (C function)
sv: malloc (C-funktion)

source: calloc (C function)
sv: calloc (C-funktion)

source: realloc (C function)
sv: realloc (C-funktion)

source: free (C function)
sv: fri (C-funktion)
