Repository: yeager/python-docs-sv
Catalog: c-api/number.po
Languages: sv

source: Number Protocol
sv: Nummerprotokoll

source: Returns ``1`` if the object *o* provides numeric protocols, and false otherwise. This function always succeeds.
sv: Returnerar ``1`` om objektet *o* tillhandahåller numeriska protokoll, och false annars. Denna funktion lyckas alltid.

source: Returns ``1`` if *o* is an index integer.
sv: Returnerar ``1`` om *o* är ett index heltal.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 + o2``.
sv: Returnerar resultatet av att lägga till *o1* och *o2*, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o1 + o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 - o2``.
sv: Returnerar resultatet av att subtrahera *o2* från *o1*, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o1 - o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 * o2``.
sv: Returnerar resultatet av multipliceringen av *o1* och *o2*, eller ``NULL`` om den misslyckas. Detta är motsvarigheten till Python-uttrycket ``o1 * o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 @ o2``.
sv: Returnerar resultatet av matrismultiplikation på *o1* och *o2*, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o1 @ o2``.

source: Return the floor of *o1* divided by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 // o2``.
sv: Returnerar golvet av *o1* dividerat med *o2*, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o1 // o2``.

source: Return a reasonable approximation for the mathematical value of *o1* divided by *o2*, or ``NULL`` on failure. The return value is "approximate" because binary floating-point numbers are approximate; it is not possible to represent all real numbers in base two. This function can return a floating-point value when passed two integers. This is the equivalent of the Python expression ``o1 / o2``.
sv: Returnerar en rimlig approximation av det matematiska värdet av *o1* dividerat med *o2*, eller ``NULL`` om det misslyckas. Returvärdet är "ungefärligt" eftersom binära flyttal är ungefärliga; det är inte möjligt att representera alla verkliga tal i bas två. Denna funktion kan returnera ett flyttalsvärde när den får två heltal. Detta är motsvarigheten till Python-uttrycket ``o1 / o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 % o2``.
sv: Returnerar återstoden av att dividera *o1* med *o2*, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o1 % o2``.

source: See the built-in function :func:`divmod`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``divmod(o1, o2)``.
sv: Se den inbyggda funktionen :func:`divmod`. Returnerar ``NULL`` om den misslyckas. Detta är motsvarigheten till Python-uttrycket ``divmod(o1, o2)``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``pow(o1, o2, o3)``, where *o3* is optional. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
sv: Se den inbyggda funktionen :func:`pow`. Returnerar ``NULL`` om den misslyckas. Detta är motsvarigheten till Python-uttrycket ``pow(o1, o2, o3)``, där *o3* är valfritt. Om *o3* ska ignoreras, skicka :c:data:`Py_None` i stället (att skicka ``NULL`` för *o3* skulle orsaka en olaglig minnesåtkomst).

source: Returns the negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``-o``.
sv: Returnerar negationen av *o* vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``-o``.

source: Returns *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``+o``.
sv: Returnerar *o* vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``+o``.

source: Returns the absolute value of *o*, or ``NULL`` on failure. This is the equivalent of the Python expression ``abs(o)``.
sv: Returnerar det absoluta värdet av *o*, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``abs(o)``.

source: Returns the bitwise negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``~o``.
sv: Returnerar den bitvisa negationen av *o* vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``~o``.

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 << o2``.
sv: Returnerar resultatet av vänsterförskjutning av *o1* med *o2* vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``o1 << o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 >> o2``.
sv: Returnerar resultatet av högerförskjutning av *o1* med *o2* vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``o1 >> o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. This is the equivalent of the Python expression ``o1 & o2``.
sv: Returnerar "bitwise and" av *o1* och *o2* vid framgång och ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``o1 & o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 ^ o2``.
sv: Returnerar "bitwise exclusive or" av *o1* med *o2* vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``o1 ^ o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 | o2``.
sv: Returnerar det "bitvisa eller" av *o1* och *o2* vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``o1 | o2``.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 += o2``.
sv: Returnerar resultatet av att lägga till *o1* och *o2*, eller ``NULL`` om det misslyckas. Operationen görs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 += o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 -= o2``.
sv: Returnerar resultatet av att subtrahera *o2* från *o1*, eller ``NULL`` om det misslyckas. Operationen utförs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 -= o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 *= o2``.
sv: Returnerar resultatet av multipliceringen av *o1* och *o2*, eller ``NULL`` om den misslyckas. Operationen görs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 *= o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 @= o2``.
sv: Returnerar resultatet av matrismultiplikation på *o1* och *o2*, eller ``NULL`` om det misslyckas. Operationen görs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 @= o2``.

source: Returns the mathematical floor of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 //= o2``.
sv: Returnerar det matematiska golvet av att dividera *o1* med *o2*, eller ``NULL`` om det misslyckas. Operationen utförs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 //= o2``.

source: Return a reasonable approximation for the mathematical value of *o1* divided by *o2*, or ``NULL`` on failure. The return value is "approximate" because binary floating-point numbers are approximate; it is not possible to represent all real numbers in base two. This function can return a floating-point value when passed two integers. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 /= o2``.
sv: Returnerar en rimlig approximation av det matematiska värdet av *o1* dividerat med *o2*, eller ``NULL`` om det misslyckas. Returvärdet är "ungefärligt" eftersom binära flyttal är ungefärliga; det är inte möjligt att representera alla verkliga tal i bas två. Denna funktion kan returnera ett flyttalsvärde när den får två heltal. Operationen görs *in-place* när *o1* har stöd för det. Detta är motsvarigheten till Python-satsen ``o1 /= o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 %= o2``.
sv: Returnerar återstoden av att dela *o1* med *o2*, eller ``NULL`` om det misslyckas. Operationen utförs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 %= o2``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 **= o2`` when o3 is :c:data:`Py_None`, or an in-place variant of ``pow(o1, o2, o3)`` otherwise. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
sv: Se den inbyggda funktionen :func:`pow`. Returnerar ``NULL`` om den misslyckas. Operationen görs *in-place* när *o1* stöder den. Detta motsvarar Python-satsen ``o1 **= o2`` när o3 är :c:data:`Py_None``, eller en in-place-variant av ``pow(o1, o2, o3)`` annars. Om *o3* ska ignoreras, skicka :c:data:`Py_None` i dess ställe (att skicka ``NULL`` för *o3* skulle orsaka en olaglig minnesåtkomst).

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 <<= o2``.
sv: Returnerar resultatet av vänsterförskjutning av *o1* med *o2* vid framgång, eller ``NULL`` vid misslyckande. Operationen görs *in-place* när *o1* stöder det. Detta är motsvarigheten till Python-satsen ``o1 <<= o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 >>= o2``.
sv: Returnerar resultatet av högerförskjutning av *o1* med *o2* vid framgång, eller ``NULL`` vid misslyckande. Operationen görs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 >>= o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 &= o2``.
sv: Returnerar det "bitvisa och" av *o1* och *o2* vid framgång och ``NULL`` vid misslyckande. Operationen görs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 &= o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 ^= o2``.
sv: Returnerar "bitwise exclusive or" av *o1* med *o2* vid framgång, eller ``NULL`` vid misslyckande. Operationen görs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 ^= o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 |= o2``.
sv: Returnerar det "bitvisa eller" av *o1* och *o2* vid framgång, eller ``NULL`` vid misslyckande. Operationen görs *in-place* när *o1* stöder den. Detta är motsvarigheten till Python-satsen ``o1 |= o2``.

source: Returns the *o* converted to an integer object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``int(o)``.
sv: Returnerar *o* konverterat till ett heltalsobjekt om det lyckas, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``int(o)``.

source: Returns the *o* converted to a float object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``float(o)``.
sv: Returnerar *o* konverterat till ett float-objekt vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``float(o)``.

source: Returns the *o* converted to a Python int on success or ``NULL`` with a :exc:`TypeError` exception raised on failure.
sv: Returnerar *o* konverterad till en Python int vid framgång eller ``NULL`` med ett :exc:`TypeError`-undantag vid misslyckande.

source: The result always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``.
sv: Resultatet har alltid den exakta typen :class:`int`. Tidigare kunde resultatet ha varit en instans av en underklass av ``int``.

source: Returns the integer *n* converted to base *base* as a string. The *base* argument must be one of 2, 8, 10, or 16. For base 2, 8, or 16, the returned string is prefixed with a base marker of ``'0b'``, ``'0o'``, or ``'0x'``, respectively. If *n* is not a Python int, it is converted with :c:func:`PyNumber_Index` first.
sv: Returnerar heltalet *n* omvandlat till basen *base* som en sträng. Argumentet *base* måste vara ett av 2, 8, 10 eller 16. För bas 2, 8 eller 16 har den returnerade strängen ett prefix med basmarkören ``'0b'``, ``'0o'`` respektive ``'0x'``. Om *n* inte är ett Python int konverteras det först med :c:func:`PyNumber_Index`.

source: Returns *o* converted to a :c:type:`Py_ssize_t` value if *o* can be interpreted as an integer. If the call fails, an exception is raised and ``-1`` is returned.
sv: Returnerar *o* konverterat till ett :c:type:`Py_ssize_t`-värde om *o* kan tolkas som ett heltal. Om anropet misslyckas uppstår ett undantag och ``-1`` returneras.

source: If *o* can be converted to a Python int but the attempt to convert to a :c:type:`Py_ssize_t` value would raise an :exc:`OverflowError`, then the *exc* argument is the type of exception that will be raised (usually :exc:`IndexError` or :exc:`OverflowError`). If *exc* is ``NULL``, then the exception is cleared and the value is clipped to ``PY_SSIZE_T_MIN`` for a negative integer or ``PY_SSIZE_T_MAX`` for a positive integer.
sv: Om *o* kan konverteras till ett Python int men försöket att konvertera till ett :c:type:`Py_ssize_t`-värde skulle ge upphov till ett :exc:`OverflowError`, så är *exc*-argumentet den typ av undantag som kommer att ges upphov till (vanligtvis :exc:`IndexError` eller :exc:`OverflowError`). Om *exc* är ``NULL``, rensas undantaget och värdet klipps till ``PY_SSIZE_T_MIN`` för ett negativt heltal eller ``PY_SSIZE_T_MAX`` för ett positivt heltal.

source: Returns ``1`` if *o* is an index integer (has the ``nb_index`` slot of the ``tp_as_number`` structure filled in), and ``0`` otherwise. This function always succeeds.
sv: Returnerar ``1`` om *o* är ett index heltal (har ``nb_index`` slot i ``tp_as_number`` strukturen ifylld), och ``0`` annars. Denna funktion lyckas alltid.

source: built-in function
sv: inbyggd funktion

source: pow
sv: kraft

source: float
sv: flyt
