Repository: yeager/python-docs-sv
Catalog: c-api/object.po
Languages: sv

source: Compute and return the hash value of an object *o*. On failure, return ``-1``. This is the equivalent of the Python expression ``hash(o)``.
sv: Beräknar och returnerar hashvärdet för ett objekt *o*. Vid misslyckande returneras ``-1``. Detta är motsvarigheten till Python-uttrycket ``hash(o)``.

source: The return type is now Py_hash_t. This is a signed integer the same size as :c:type:`Py_ssize_t`.
sv: Returtypen är nu Py_hash_t. Detta är ett signerat heltal av samma storlek som :c:type:`Py_ssize_t`.

source: Set a :exc:`TypeError` indicating that ``type(o)`` is not :term:`hashable` and return ``-1``. This function receives special treatment when stored in a ``tp_hash`` slot, allowing a type to explicitly indicate to the interpreter that it is not hashable.
sv: Ställ in en :exc:`TypeError` som anger att ``type(o)`` inte är :term:`hashable` och returnera ``-1``. Denna funktion behandlas speciellt när den lagras i en ``tp_hash`` slot, vilket gör det möjligt för en typ att uttryckligen ange för tolkaren att den inte är hashbar.

source: Returns ``1`` if the object *o* is considered to be true, and ``0`` otherwise. This is equivalent to the Python expression ``not not o``. On failure, return ``-1``.
sv: Returnerar ``1`` om objektet *o* anses vara sant, och ``0`` annars. Detta är likvärdigt med Python-uttrycket ``not not o``. Vid misslyckande returneras ``-1``.

source: Returns ``0`` if the object *o* is considered to be true, and ``1`` otherwise. This is equivalent to the Python expression ``not o``. On failure, return ``-1``.
sv: Returnerar ``0`` om objektet *o* anses vara sant, och ``1`` annars. Detta är likvärdigt med Python-uttrycket ``not o``. Vid misslyckande returneras ``-1``.

source: When *o* is non-``NULL``, returns a type object corresponding to the object type of object *o*. On failure, raises :exc:`SystemError` and returns ``NULL``. This is equivalent to the Python expression ``type(o)``. This function creates a new :term:`strong reference` to the return value. There's really no reason to use this function instead of the :c:func:`Py_TYPE()` function, which returns a pointer of type :c:expr:`PyTypeObject*`, except when a new :term:`strong reference` is needed.
sv: När *o* är icke-``NULL``, returnerar ett typobjekt som motsvarar objekttypen för objektet *o*. Om det misslyckas, uppstår :exc:`SystemError` och returnerar ``NULL``. Detta är likvärdigt med Python-uttrycket ``type(o)``. Denna funktion skapar en ny :term:`strong reference` till returvärdet. Det finns egentligen ingen anledning att använda den här funktionen istället för :c:func:`Py_TYPE()`-funktionen, som returnerar en pekare av typen :c:expr:`PyTypeObject*`, förutom när en ny :term:`strong-referens` behövs.

source: Return non-zero if the object *o* is of type *type* or a subtype of *type*, and ``0`` otherwise. Both parameters must be non-``NULL``.
sv: Returnerar icke-noll om objektet *o* är av typen *type* eller en subtyp av *type*, och ``0`` annars. Båda parametrarna måste vara icke-``NULL``.

source: Return the length of object *o*. If the object *o* provides either the sequence and mapping protocols, the sequence length is returned. On error, ``-1`` is returned. This is the equivalent to the Python expression ``len(o)``.
sv: Returnerar längden på objektet *o*. Om objektet *o* tillhandahåller antingen sekvens- eller mappningsprotokollet returneras sekvenslängden. Vid fel returneras ``-1``. Detta är motsvarigheten till Python-uttrycket ``len(o)``.

source: Return an estimated length for the object *o*. First try to return its actual length, then an estimate using :meth:`~object.__length_hint__`, and finally return the default value. On error return ``-1``. This is the equivalent to the Python expression ``operator.length_hint(o, defaultvalue)``.
sv: Returnerar en uppskattad längd för objektet *o*. Försök först att returnera dess faktiska längd, sedan en uppskattning med hjälp av :meth:`~object.__length_hint__`, och slutligen returnera standardvärdet. Vid fel returneras ``-1``. Detta är motsvarigheten till Python-uttrycket ``operator.length_hint(o, defaultvalue)``.

source: Return element of *o* corresponding to the object *key* or ``NULL`` on failure. This is the equivalent of the Python expression ``o[key]``.
sv: Returnerar element av *o* som motsvarar objektet *key* eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o[key]``.

source: Map the object *key* to the value *v*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o[key] = v``. This function *does not* steal a reference to *v*.
sv: Mappa objektet *key* till värdet *v*. Utlös ett undantag och returnera ``-1`` vid misslyckande; returnera ``0`` vid framgång. Detta är motsvarigheten till Python-satsen ``o[key] = v``. Den här funktionen *stjäl* inte en referens till *v*.

source: Remove the mapping for the object *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``.
sv: Ta bort mappningen för objektet *key* från objektet *o*. Returnerar ``-1`` vid misslyckande. Detta är likvärdigt med Python-satsen ``del o[key]``.

source: This is the same as :c:func:`PyObject_DelItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
sv: Detta är samma sak som :c:func:`PyObject_DelItem`, men *key* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, i stället för en :c:expr:`PyObject*`.

source: This is equivalent to the Python expression ``dir(o)``, returning a (possibly empty) list of strings appropriate for the object argument, or ``NULL`` if there was an error. If the argument is ``NULL``, this is like the Python ``dir()``, returning the names of the current locals; in this case, if no execution frame is active then ``NULL`` is returned but :c:func:`PyErr_Occurred` will return false.
sv: Detta motsvarar Python-uttrycket ``dir(o)``, som returnerar en (eventuellt tom) lista med strängar som passar för objektargumentet, eller ``NULL`` om det uppstod ett fel. Om argumentet är ``NULL``, är detta som Pythons ``dir()``, som returnerar namnen på de aktuella lokala platserna; i detta fall, om ingen exekveringsram är aktiv, returneras ``NULL`` men :c:func:`PyErr_Occurred` kommer att returnera false.

source: This is equivalent to the Python expression ``iter(o)``. It returns a new iterator for the object argument, or the object itself if the object is already an iterator. Raises :exc:`TypeError` and returns ``NULL`` if the object cannot be iterated.
sv: Detta är likvärdigt med Python-uttrycket ``iter(o)``. Det returnerar en ny iterator för objektargumentet, eller själva objektet om objektet redan är en iterator. Utlöser :exc:`TypeError` och returnerar ``NULL`` om objektet inte kan itereras.

source: This is equivalent to the Python ``__iter__(self): return self`` method. It is intended for :term:`iterator` types, to be used in the :c:member:`PyTypeObject.tp_iter` slot.
sv: Detta motsvarar Python-metoden ``__iter__(self): return self``. Den är avsedd för :term:`iterator`-typer, som ska användas i :c:member:`PyTypeObject.tp_iter`-slot.

source: This is the equivalent to the Python expression ``aiter(o)``. Takes an :class:`AsyncIterable` object and returns an :class:`AsyncIterator` for it. This is typically a new iterator but if the argument is an :class:`AsyncIterator`, this returns itself. Raises :exc:`TypeError` and returns ``NULL`` if the object cannot be iterated.
sv: Detta är motsvarigheten till Python-uttrycket ``aiter(o)``. Tar ett :class:`AsyncIterable`-objekt och returnerar en :class:`AsyncIterator` för det. Detta är typiskt en ny iterator men om argumentet är en :class:`AsyncIterator` returnerar den sig själv. Utlöser :exc:`TypeError` och returnerar ``NULL`` om objektet inte kan itereras.

source: Get a pointer to subclass-specific data reserved for *cls*.
sv: Hämta en pekare till underklassspecifika data som reserverats för *cls*.

source: The object *o* must be an instance of *cls*, and *cls* must have been created using negative :c:member:`PyType_Spec.basicsize`. Python does not check this.
sv: Objektet *o* måste vara en instans av *cls*, och *cls* måste ha skapats med negativa :c:member:`PyType_Spec.basicsize`. Python kontrollerar inte detta.

source: On error, set an exception and return ``NULL``.
sv: Vid fel, sätt ett undantag och returnera ``NULL``.

source: Return the size of the instance memory space reserved for *cls*, i.e. the size of the memory :c:func:`PyObject_GetTypeData` returns.
sv: Returnerar storleken på det instansminnesutrymme som reserverats för *cls*, dvs. storleken på det minne som :c:func:`PyObject_GetTypeData` returnerar.

source: This may be larger than requested using :c:member:`-PyType_Spec.basicsize <PyType_Spec.basicsize>`; it is safe to use this larger size (e.g. with :c:func:`!memset`).
sv: Detta kan vara större än vad som begärdes med :c:member:`-PyType_Spec.basicsize <PyType_Spec.basicsize>`; det är säkert att använda denna större storlek (t.ex. med :c:func:`!memset`).

source: The type *cls* **must** have been created using negative :c:member:`PyType_Spec.basicsize`. Python does not check this.
sv: Typen *cls* **måste** ha skapats med negativ :c:member:`PyType_Spec.basicsize`. Python kontrollerar inte detta.

source: On error, set an exception and return a negative value.
sv: Vid fel, skapa ett undantag och returnera ett negativt värde.

source: Get a pointer to per-item data for a class with :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.
sv: Hämta en pekare till data per artikel för en klass med :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.

source: On error, set an exception and return ``NULL``. :py:exc:`TypeError` is raised if *o* does not have :c:macro:`Py_TPFLAGS_ITEMS_AT_END` set.
sv: Vid fel, ställ in ett undantag och returnera ``NULL``. :py:exc:`TypeError` uppstår om *o* inte har :c:macro:`Py_TPFLAGS_ITEMS_AT_END` inställt.

source: Visit the managed dictionary of *obj*.
sv: Besök den hanterade ordlistan över *obj*.

source: This function must only be called in a traverse function of the type which has the :c:macro:`Py_TPFLAGS_MANAGED_DICT` flag set.
sv: Denna funktion får endast anropas i en traversefunktion av den typ som har flaggan :c:macro:`Py_TPFLAGS_MANAGED_DICT` inställd.

source: Clear the managed dictionary of *obj*.
sv: Rensa den hanterade ordlistan för *obj*.

source: Enable `deferred reference counting <https://peps.python.org/pep-0703/#deferred-reference-counting>`_ on *obj*, if supported by the runtime. In the :term:`free-threaded <free threading>` build, this allows the interpreter to avoid reference count adjustments to *obj*, which may improve multi-threaded performance. The tradeoff is that *obj* will only be deallocated by the tracing garbage collector, and not when the interpreter no longer has any references to it.
sv: Aktivera `uppskjuten referensräkning &lt;https://peps.python.org/pep-0703/#deferred-reference-counting&gt;`_ på *obj*, om det stöds av körtiden. I :term:``free-threaded <free threading>`-versionen gör detta att tolken kan undvika referensräkningsjusteringar för *obj*, vilket kan förbättra prestanda för flera trådar. Avvägningen är att *obj* endast kommer att avallokeras av den spårande skräpsamlaren, och inte när tolken inte längre har några referenser till den.

source: This function returns ``1`` if deferred reference counting is enabled on *obj*, and ``0`` if deferred reference counting is not supported or if the hint was ignored by the interpreter, such as when deferred reference counting is already enabled on *obj*. This function is thread-safe, and cannot fail.
sv: Denna funktion returnerar ``1`` om uppskjuten referensräkning är aktiverad på *obj* och ``0`` om uppskjuten referensräkning inte stöds eller om tolken ignorerade tipset, t.ex. när uppskjuten referensräkning redan är aktiverad på *obj*. Denna funktion är trådsäker och kan inte misslyckas.

source: This function does nothing on builds with the :term:`GIL` enabled, which do not support deferred reference counting. This also does nothing if *obj* is not an object tracked by the garbage collector (see :func:`gc.is_tracked` and :c:func:`PyObject_GC_IsTracked`).
sv: Den här funktionen gör ingenting på byggen med :term:`GIL` aktiverat, som inte stöder uppskjuten referensräkning. Den gör inte heller något om *obj* inte är ett objekt som spåras av skräpsamlaren (se :func:`gc.is_tracked` och :c:func:`PyObject_GC_IsTracked`).

source: This function is intended to be used soon after *obj* is created, by the code that creates it, such as in the object's :c:member:`~PyTypeObject.tp_new` slot.
sv: Denna funktion är avsedd att användas strax efter att *obj* har skapats, av den kod som skapar det, t.ex. i objektets :c:member:`~PyTypeObject.tp_new` slot.

source: Check if *obj* is a unique temporary object. Returns ``1`` if *obj* is known to be a unique temporary object, and ``0`` otherwise. This function cannot fail, but the check is conservative, and may return ``0`` in some cases even if *obj* is a unique temporary object.
sv: Kontrollerar om *obj* är ett unikt temporärt objekt. Returnerar ``1`` om det är känt att *obj* är ett unikt temporärt objekt, och ``0`` annars. Denna funktion kan inte misslyckas, men kontrollen är konservativ och kan returnera ``0`` i vissa fall även om *obj* är ett unikt temporärt objekt.

source: If an object is a unique temporary, it is guaranteed that the current code has the only reference to the object. For arguments to C functions, this should be used instead of checking if the reference count is ``1``. Starting with Python 3.14, the interpreter internally avoids some reference count modifications when loading objects onto the operands stack by :term:`borrowing <borrowed reference>` references when possible, which means that a reference count of ``1`` by itself does not guarantee that a function argument uniquely referenced.
sv: Om ett objekt är en unik temporär är det garanterat att den aktuella koden har den enda referensen till objektet. För argument till C-funktioner bör detta användas istället för att kontrollera om referensantalet är ``1``. Från och med Python 3.14 undviker tolken internt vissa ändringar av referensantalet när objekt laddas till operandstacken genom att :term:``låna <borrowed reference>` referenser när det är möjligt, vilket innebär att ett referensantal på ``1`` i sig inte garanterar att ett funktionsargument är unikt refererat.

source: In the example below, ``my_func`` is called with a unique temporary object as its argument::
sv: I exemplet nedan anropas ``my_func`` med ett unikt temporärt objekt som argument::

source: In the example below, ``my_func`` is **not** called with a unique temporary object as its argument, even if its refcount is ``1``::
sv: I exemplet nedan anropas ``my_func`` **inte** med ett unikt temporärt objekt som argument, även om dess refcount är ``1``::

source: my_list = [1, 2, 3] my_func(my_list)
sv: min_lista = [1, 2, 3] my_func(min_lista)

source: See also the function :c:func:`Py_REFCNT`.
sv: Se även funktionen :c:func:`Py_REFCNT`.

source: This function returns non-zero if *obj* is :term:`immortal`, and zero otherwise. This function cannot fail.
sv: Denna funktion returnerar icke-noll om *obj* är :term:`immortal`, och noll annars. Denna funktion kan inte misslyckas.

source: Objects that are immortal in one CPython version are not guaranteed to be immortal in another.
sv: Objekt som är odödliga i en CPython-version är inte garanterat odödliga i en annan.

source: Increments the reference count of *obj* if it is not zero. Returns ``1`` if the object's reference count was successfully incremented. Otherwise, this function returns ``0``.
sv: Ökar referensantalet för *obj* om det inte är noll. Returnerar ``1`` om objektets referensantal har ökats framgångsrikt. Annars returnerar denna funktion ``0``.

source: :c:func:`PyUnstable_EnableTryIncRef` must have been called earlier on *obj* or this function may spuriously return ``0`` in the :term:`free threading` build.
sv: :c:func:`PyUnstable_EnableTryIncRef` måste ha anropats tidigare på *obj* annars kan denna funktion felaktigt returnera ``0`` i :term:`free threading`-bygget.

source: This function is logically equivalent to the following C code, except that it behaves atomically in the :term:`free threading` build::
sv: Denna funktion är logiskt ekvivalent med följande C-kod, förutom att den beter sig atomiskt i :term:`free threading` build::

source: if (Py_REFCNT(op) > 0) { Py_INCREF(op); return 1; } return 0;
sv: if (Py_REFCNT(op) > 0) { Py_INCREF(op); returnera 1; } return 0;

source: This is intended as a building block for managing weak references without the overhead of a Python :ref:`weak reference object <weakrefobjects>`.
sv: Detta är tänkt som en byggsten för att hantera svaga referenser utan att behöva använda Python :ref:`svagt referensobjekt <weakrefobjects>`.

source: Typically, correct use of this function requires support from *obj*'s deallocator (:c:member:`~PyTypeObject.tp_dealloc`). For example, the following sketch could be adapted to implement a "weakmap" that works like a :py:class:`~weakref.WeakValueDictionary` for a specific type:
sv: Normalt kräver korrekt användning av denna funktion stöd från *obj*:s deallokator (:c:member:`~PyTypeObject.tp_dealloc`). Följande skiss kan t.ex. anpassas för att implementera en "weakmap" som fungerar som en :py:class:`~weakref.WeakValueDictionary` för en viss typ:

source: PyMutex mutex; PyObject * add_entry(weakmap_key_type *key, PyObject *value) { PyUnstable_EnableTryIncRef(value); weakmap_type weakmap = ...; PyMutex_Lock(&mutex); weakmap_add_entry(weakmap, key, value); PyMutex_Unlock(&mutex); Py_RETURN_NONE; } PyObject * get_value(weakmap_key_type *key) { weakmap_type weakmap = ...; PyMutex_Lock(&mutex); PyObject *result = weakmap_find(weakmap, key); if (PyUnstable_TryIncRef(result)) { // `result` is safe to use PyMutex_Unlock(&mutex); return result; } // if we get here, `result` is starting to be garbage-collected, // but has not been removed from the weakmap yet PyMutex_Unlock(&mutex); return NULL; } // tp_dealloc function for weakmap values void value_dealloc(PyObject *value) { weakmap_type weakmap = ...; PyMutex_Lock(&mutex); weakmap_remove_value(weakmap, value); ... PyMutex_Unlock(&mutex); }
sv: PyMutex mutex; PyObjekt * add_entry(weakmap_key_type *key, PyObject *value) { PyUnstable_EnableTryIncRef(värde); weakmap_type weakmap = ...; PyMutex_Lock(&mutex); weakmap_add_entry(weakmap, nyckel, värde); PyMutex_Unlock(&mutex); Py_RETURN_NONE; } PyObject * get_value(weakmap_key_type *key) { weakmap_type weakmap = ...; PyMutex_Lock(&mutex); PyObject *result = weakmap_find(weakmap, nyckel); if (PyUnstable_TryIncRef(resultat)) { // `result` är säkert att använda PyMutex_Unlock(&mutex); returnera resultat; } // om vi kommer hit börjar `result` samlas in som skräp, // men har inte tagits bort från den svaga kartan ännu PyMutex_Unlock(&mutex); returnera NULL; } // tp_dealloc-funktion för svaga mappvärden void value_dealloc(PyObject *värde) { weakmap_type weakmap = ...; PyMutex_Lock(&mutex); weakmap_remove_value(weakmap, värde); ... PyMutex_Unlock(&mutex); }

source: Enables subsequent uses of :c:func:`PyUnstable_TryIncRef` on *obj*. The caller must hold a :term:`strong reference` to *obj* when calling this.
sv: Möjliggör efterföljande användning av :c:func:`PyUnstable_TryIncRef` på *obj*. Den som anropar måste ha en :term:`strong reference` till *obj* när detta anropas.

source: Determine if *op* only has one reference.
sv: Avgör om *op* endast har en referens.

source: On GIL-enabled builds, this function is equivalent to :c:expr:`Py_REFCNT(op) == 1`.
sv: På GIL-aktiverade byggsystem är den här funktionen likvärdig med :c:expr:`Py_REFCNT(op) == 1`.

source: On a :term:`free threaded <free threading>` build, this checks if *op*'s :term:`reference count` is equal to one and additionally checks if *op* is only used by this thread. :c:expr:`Py_REFCNT(op) == 1` is **not** thread-safe on free threaded builds; prefer this function.
sv: På en :term:``free threaded <free threading>`-byggnad kontrollerar detta om *op*:s :term:`reference count` är lika med ett och kontrollerar dessutom om *op* endast används av denna tråd. :c:expr:`Py_REFCNT(op) == 1` är **inte** trådsäker på fritt trådade byggnader; föredra denna funktion.

source: The caller must hold an :term:`attached thread state`, despite the fact that this function doesn't call into the Python interpreter. This function cannot fail.
sv: Den som anropar måste ha en :term:`attached thread state`, trots att den här funktionen inte anropar Python-tolken. Denna funktion kan inte misslyckas.

source: built-in function
sv: inbyggd funktion

source: PyObject_Str (C function)
sv: PyObject_Str (C-funktion)
