Repository: yeager/python-docs-sv
Catalog: c-api/object.po
Languages: sv

source: Object Protocol
sv: Objektprotokoll

source: Get a :term:`strong reference` to a constant.
sv: Få en :term:`stark referens` till en konstant.

source: Set an exception and return ``NULL`` if *constant_id* is invalid.
sv: Ställ in ett undantag och returnera ``NULL`` om *constant_id* är ogiltig.

source: *constant_id* must be one of these constant identifiers:
sv: *constant_id* måste vara en av dessa konstantidentifierare:

source: Constant Identifier
sv: Konstant identifierare

source: Value
sv: Värde

source: Returned object
sv: Återlämnat objekt

source: Numeric values are only given for projects which cannot use the constant identifiers.
sv: Numeriska värden anges endast för projekt som inte kan använda de konstanta identifierarna.

source: In CPython, all of these constants are :term:`immortal`.
sv: I CPython är alla dessa konstanter :term:`immortal`.

source: Similar to :c:func:`Py_GetConstant`, but return a :term:`borrowed reference`.
sv: Liknar :c:func:`Py_GetConstant`, men returnerar en :term:`lånad referens`.

source: This function is primarily intended for backwards compatibility: using :c:func:`Py_GetConstant` is recommended for new code.
sv: Denna funktion är främst avsedd för bakåtkompatibilitet: att använda :c:func:`Py_GetConstant` rekommenderas för ny kod.

source: The reference is borrowed from the interpreter, and is valid until the interpreter finalization.
sv: Referensen lånas av tolken och gäller till dess att tolken har slutfört sitt uppdrag.

source: The ``NotImplemented`` singleton, used to signal that an operation is not implemented for the given type combination.
sv: Singleton ``NotImplemented``, används för att signalera att en operation inte är implementerad för den givna typkombinationen.

source: Properly handle returning :c:data:`Py_NotImplemented` from within a C function (that is, create a new :term:`strong reference` to :const:`NotImplemented` and return it).
sv: Hantera korrekt returnering av :c:data:`Py_NotImplemented` från en C-funktion (dvs. skapa en ny :term:`strong reference` till :const:`NotImplemented` och returnera den).

source: Flag to be used with multiple functions that print the object (like :c:func:`PyObject_Print` and :c:func:`PyFile_WriteObject`). If passed, these function would use the :func:`str` of the object instead of the :func:`repr`.
sv: Flagga som ska användas med flera funktioner som skriver ut objektet (som :c:func:`PyObject_Print` och :c:func:`PyFile_WriteObject`). Om den godkänns kommer dessa funktioner att använda objektets :func:`str` istället för :func:`repr`.

source: Print an object *o*, on file *fp*. Returns ``-1`` on error. The flags argument is used to enable certain printing options. The only option currently supported is :c:macro:`Py_PRINT_RAW`; if given, the :func:`str` of the object is written instead of the :func:`repr`.
sv: Skriv ut ett objekt *o*, på filen *fp*. Returnerar ``-1`` vid fel. Argumentet flags används för att aktivera vissa utskriftsalternativ. Det enda alternativ som för närvarande stöds är :c:macro:`Py_PRINT_RAW`; om det anges skrivs objektets :func:`str` ut istället för :func:`repr`.

source: Returns ``1`` if *o* has the attribute *attr_name*, and ``0`` otherwise. This is equivalent to the Python expression ``hasattr(o, attr_name)``. On failure, return ``-1``.
sv: Returnerar ``1`` om *o* har attributet *attr_name*, och ``0`` annars. Detta är likvärdigt med Python-uttrycket ``hasattr(o, attr_name)``. Vid misslyckande returneras ``-1``.

source: This is the same as :c:func:`PyObject_HasAttrWithError`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
sv: Detta är samma sak som :c:func:`PyObject_HasAttrWithError`, men *attr_name* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, i stället för en :c:expr:`PyObject*`.

source: Returns ``1`` if *o* has the attribute *attr_name*, and ``0`` otherwise. This function always succeeds.
sv: Returnerar ``1`` om *o* har attributet *attr_name*, och ``0`` annars. Denna funktion lyckas alltid.

source: Exceptions that occur when this calls :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` methods aren't propagated, but instead given to :func:`sys.unraisablehook`. For proper error handling, use :c:func:`PyObject_HasAttrWithError`, :c:func:`PyObject_GetOptionalAttr` or :c:func:`PyObject_GetAttr` instead.
sv: Undantag som uppstår när detta anropar metoderna :meth:`~object.__getattr__` och :meth:`~object.__getattribute__` sprids inte, utan ges istället till :func:`sys.unraisablehook`. För korrekt felhantering, använd :c:func:`PyObject_HasAttrWithError`, :c:func:`PyObject_GetOptionalAttr` eller :c:func:`PyObject_GetAttr` istället.

source: This is the same as :c:func:`PyObject_HasAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
sv: Detta är samma sak som :c:func:`PyObject_HasAttr`, men *attr_name* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, i stället för en :c:expr:`PyObject*`.

source: Exceptions that occur when this calls :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` methods or while creating the temporary :class:`str` object are silently ignored. For proper error handling, use :c:func:`PyObject_HasAttrStringWithError`, :c:func:`PyObject_GetOptionalAttrString` or :c:func:`PyObject_GetAttrString` instead.
sv: Undantag som uppstår när detta anropar metoderna :meth:`~object.__getattr__` och :meth:`~object.__getattribute__` eller när det tillfälliga :class:`str`-objektet skapas ignoreras i tysthet. För korrekt felhantering, använd :c:func:`PyObject_HasAttrStringWithError`, :c:func:`PyObject_GetOptionalAttrString` eller :c:func:`PyObject_GetAttrString` istället.

source: Retrieve an attribute named *attr_name* from object *o*. Returns the attribute value on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o.attr_name``.
sv: Hämtar ett attribut med namnet *attr_name* från objektet *o*. Returnerar attributvärdet vid framgång, eller ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``o.attr_name``.

source: If the missing attribute should not be treated as a failure, you can use :c:func:`PyObject_GetOptionalAttr` instead.
sv: Om det saknade attributet inte ska behandlas som ett fel kan du använda :c:func:`PyObject_GetOptionalAttr` istället.

source: This is the same as :c:func:`PyObject_GetAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
sv: Detta är samma sak som :c:func:`PyObject_GetAttr`, men *attr_name* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, i stället för en :c:expr:`PyObject*`.

source: If the missing attribute should not be treated as a failure, you can use :c:func:`PyObject_GetOptionalAttrString` instead.
sv: Om det saknade attributet inte ska behandlas som ett fel kan du använda :c:func:`PyObject_GetOptionalAttrString` istället.

source: Variant of :c:func:`PyObject_GetAttr` which doesn't raise :exc:`AttributeError` if the attribute is not found.
sv: Variant av :c:func:`PyObject_GetAttr` som inte ger upphov till :exc:`AttributeError` om attributet inte hittas.

source: If the attribute is found, return ``1`` and set *\*result* to a new :term:`strong reference` to the attribute. If the attribute is not found, return ``0`` and set *\*result* to ``NULL``; the :exc:`AttributeError` is silenced. If an error other than :exc:`AttributeError` is raised, return ``-1`` and set *\*result* to ``NULL``.
sv: Om attributet hittas returneras ``1`` och *\*result* sätts till en ny :term:`strong referens` till attributet. Om attributet inte hittas, returneras ``0`` och *\*result* sätts till ``NULL``; :exc:`AttributeError` tystas. Om ett annat fel än :exc:`AttributeError` uppstår, returneras ``-1`` och *\*result* sätts till ``NULL``.

source: This is the same as :c:func:`PyObject_GetOptionalAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
sv: Detta är samma sak som :c:func:`PyObject_GetOptionalAttr`, men *attr_name* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, i stället för en :c:expr:`PyObject*`.

source: Generic attribute getter function that is meant to be put into a type object's ``tp_getattro`` slot. It looks for a descriptor in the dictionary of classes in the object's MRO as well as an attribute in the object's :attr:`~object.__dict__` (if present). As outlined in :ref:`descriptors`, data descriptors take preference over instance attributes, while non-data descriptors don't. Otherwise, an :exc:`AttributeError` is raised.
sv: Generisk getterfunktion för attribut som är avsedd att placeras i ett typobjekts ``tp_getattro`` slot. Den letar efter en deskriptor i klassordboken i objektets MRO samt ett attribut i objektets :attr:`~object.__dict__` (om det finns). Som beskrivs i :ref:`descriptors`, har datadeskriptorer företräde framför instansattribut, medan icke-datadeskriptorer inte har det. I annat fall uppstår ett :exc:`AttributeError`.

source: Set the value of the attribute named *attr_name*, for object *o*, to the value *v*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o.attr_name = v``.
sv: Ställ in värdet på attributet med namnet *attr_name*, för objektet *o*, till värdet *v*. Utlös ett undantag och returnera ``-1`` vid misslyckande; returnera ``0`` vid framgång. Detta är motsvarigheten till Python-satsen ``o.attr_name = v``.

source: If *v* is ``NULL``, the attribute is deleted. This behaviour is deprecated in favour of using :c:func:`PyObject_DelAttr`, but there are currently no plans to remove it.
sv: Om *v* är ``NULL`` tas attributet bort. Detta beteende är föråldrat till förmån för att använda :c:func:`PyObject_DelAttr`, men det finns för närvarande inga planer på att ta bort det.

source: This is the same as :c:func:`PyObject_SetAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
sv: Detta är samma sak som :c:func:`PyObject_SetAttr`, men *attr_name* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, i stället för en :c:expr:`PyObject*`.

source: If *v* is ``NULL``, the attribute is deleted, but this feature is deprecated in favour of using :c:func:`PyObject_DelAttrString`.
sv: Om *v* är ``NULL`` tas attributet bort, men denna funktion är föråldrad till förmån för att använda :c:func:`PyObject_DelAttrString`.

source: The number of different attribute names passed to this function should be kept small, usually by using a statically allocated string as *attr_name*. For attribute names that aren't known at compile time, prefer calling :c:func:`PyUnicode_FromString` and :c:func:`PyObject_SetAttr` directly. For more details, see :c:func:`PyUnicode_InternFromString`, which may be used internally to create a key object.
sv: Antalet olika attributnamn som skickas till denna funktion bör hållas litet, vanligtvis genom att använda en statiskt allokerad sträng som *attr_name*. För attributnamn som inte är kända vid kompileringstillfället är det bättre att anropa :c:func:`PyUnicode_FromString` och :c:func:`PyObject_SetAttr` direkt. För mer information, se :c:func:`PyUnicode_InternFromString`, som kan användas internt för att skapa ett nyckelobjekt.

source: Generic attribute setter and deleter function that is meant to be put into a type object's :c:member:`~PyTypeObject.tp_setattro` slot. It looks for a data descriptor in the dictionary of classes in the object's MRO, and if found it takes preference over setting or deleting the attribute in the instance dictionary. Otherwise, the attribute is set or deleted in the object's :attr:`~object.__dict__` (if present). On success, ``0`` is returned, otherwise an :exc:`AttributeError` is raised and ``-1`` is returned.
sv: Generisk attributsättnings- och borttagningsfunktion som är avsedd att placeras i ett typobjekts :c:member:`~PyTypeObject.tp_setattro` slot. Den letar efter en databeskrivare i klassordboken i objektets MRO, och om den hittas har den företräde framför att sätta eller ta bort attributet i instansordboken. I annat fall sätts eller tas attributet bort i objektets :attr:`~object.__dict__` (om det finns). Vid framgång returneras ``0``, annars genereras ett :exc:`AttributeError` och ``-1`` returneras.

source: Delete attribute named *attr_name*, for object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``del o.attr_name``.
sv: Ta bort attributet med namnet *attr_name* för objektet *o*. Returnerar ``-1`` om det misslyckas. Detta är motsvarigheten till Python-satsen ``del o.attr_name``.

source: This is the same as :c:func:`PyObject_DelAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
sv: Detta är samma sak som :c:func:`PyObject_DelAttr`, men *attr_name* anges som en :c:expr:`const char*` UTF-8-kodad bytessträng, i stället för en :c:expr:`PyObject*`.

source: The number of different attribute names passed to this function should be kept small, usually by using a statically allocated string as *attr_name*. For attribute names that aren't known at compile time, prefer calling :c:func:`PyUnicode_FromString` and :c:func:`PyObject_DelAttr` directly. For more details, see :c:func:`PyUnicode_InternFromString`, which may be used internally to create a key object for lookup.
sv: Antalet olika attributnamn som skickas till denna funktion bör hållas litet, vanligtvis genom att använda en statiskt allokerad sträng som *attr_name*. För attributnamn som inte är kända vid kompileringstillfället är det bättre att anropa :c:func:`PyUnicode_FromString` och :c:func:`PyObject_DelAttr` direkt. För mer information, se :c:func:`PyUnicode_InternFromString`, som kan användas internt för att skapa ett nyckelobjekt för uppslagning.

source: A generic implementation for the getter of a ``__dict__`` descriptor. It creates the dictionary if necessary.
sv: En generisk implementation för gettern för en ``__dict__`` deskriptor. Den skapar ordlistan om det behövs.

source: This function may also be called to get the :py:attr:`~object.__dict__` of the object *o*. Pass ``NULL`` for *context* when calling it. Since this function may need to allocate memory for the dictionary, it may be more efficient to call :c:func:`PyObject_GetAttr` when accessing an attribute on the object.
sv: Denna funktion kan också anropas för att få :py:attr:`~object.__dict__` för objektet *o*. Ange ``NULL`` för *context* när du anropar den. Eftersom den här funktionen kan behöva allokera minne för ordlistan kan det vara effektivare att anropa :c:func:`PyObject_GetAttr` när man vill komma åt ett attribut på objektet.

source: On failure, returns ``NULL`` with an exception set.
sv: Vid misslyckande returneras ``NULL`` med en undantagsuppsättning.

source: A generic implementation for the setter of a ``__dict__`` descriptor. This implementation does not allow the dictionary to be deleted.
sv: En generisk implementation för en ``__dict__`` descriptors setter. Den här implementationen tillåter inte att ordboken raderas.

source: Return a pointer to :py:attr:`~object.__dict__` of the object *obj*. If there is no ``__dict__``, return ``NULL`` without setting an exception.
sv: Returnerar en pekare till :py:attr:`~object.__dict__` för objektet *obj*. Om det inte finns någon ``__dict__``, returneras ``NULL`` utan att ett undantag anges.

source: This function may need to allocate memory for the dictionary, so it may be more efficient to call :c:func:`PyObject_GetAttr` when accessing an attribute on the object.
sv: Denna funktion kan behöva allokera minne för ordlistan, så det kan vara mer effektivt att anropa :c:func:`PyObject_GetAttr` när man vill komma åt ett attribut på objektet.

source: Compare the values of *o1* and *o2* using the operation specified by *opid*, which must be one of :c:macro:`Py_LT`, :c:macro:`Py_LE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_GT`, or :c:macro:`Py_GE`, corresponding to ``<``, ``<=``, ``==``, ``!=``, ``>``, or ``>=`` respectively. This is the equivalent of the Python expression ``o1 op o2``, where ``op`` is the operator corresponding to *opid*. Returns the value of the comparison on success, or ``NULL`` on failure.
sv: Jämför värdena i *o1* och *o2* med den operation som anges av *opid*, som måste vara en av :c:macro:`Py_LT`, :c:macro:`Py_LE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_GT` eller :c:macro:`Py_GE`, motsvarande ``<``, ``<=``, ``==``, ``!=``, ``>``, eller ``>=`` respektive. Detta är motsvarigheten till Python-uttrycket ``o1 op o2``, där ``op`` är operatorn som motsvarar *opid*. Returnerar värdet av jämförelsen om den lyckas, eller ``NULL`` om den misslyckas.

source: Compare the values of *o1* and *o2* using the operation specified by *opid*, like :c:func:`PyObject_RichCompare`, but returns ``-1`` on error, ``0`` if the result is false, ``1`` otherwise.
sv: Jämför värdena på *o1* och *o2* med den operation som anges av *opid*, som :c:func:`PyObject_RichCompare`, men returnerar ``-1`` vid fel, ``0`` om resultatet är falskt, ``1`` annars.

source: If *o1* and *o2* are the same object, :c:func:`PyObject_RichCompareBool` will always return ``1`` for :c:macro:`Py_EQ` and ``0`` for :c:macro:`Py_NE`.
sv: Om *o1* och *o2* är samma objekt kommer :c:func:`PyObject_RichCompareBool` alltid att returnera ``1`` för :c:macro:`Py_EQ` och ``0`` för :c:macro:`Py_NE`.

source: Format *obj* using *format_spec*. This is equivalent to the Python expression ``format(obj, format_spec)``.
sv: Formatera *obj* med hjälp av *format_spec*. Detta är likvärdigt med Python-uttrycket ``format(obj, format_spec)``.

source: *format_spec* may be ``NULL``. In this case the call is equivalent to ``format(obj)``. Returns the formatted string on success, ``NULL`` on failure.
sv: *format_spec* kan vara ``NULL``. I detta fall är anropet likvärdigt med ``format(obj)``. Returnerar den formaterade strängen vid framgång, ``NULL`` vid misslyckande.

source: Compute a string representation of object *o*. Returns the string representation on success, ``NULL`` on failure. This is the equivalent of the Python expression ``repr(o)``. Called by the :func:`repr` built-in function.
sv: Beräknar en strängrepresentation av objektet *o*. Returnerar strängrepresentationen vid framgång, ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``repr(o)``. Anropas av den inbyggda funktionen :func:`repr`.

source: This function now includes a debug assertion to help ensure that it does not silently discard an active exception.
sv: Denna funktion innehåller nu ett debug-assertion för att säkerställa att den inte i tysthet kasserar ett aktivt undantag.

source: As :c:func:`PyObject_Repr`, compute a string representation of object *o*, but escape the non-ASCII characters in the string returned by :c:func:`PyObject_Repr` with ``\x``, ``\u`` or ``\U`` escapes. This generates a string similar to that returned by :c:func:`PyObject_Repr` in Python 2. Called by the :func:`ascii` built-in function.
sv: Som :c:func:`PyObject_Repr`, beräkna en strängrepresentation av objektet *o*, men escape icke-ASCII-tecken i strängen som returneras av :c:func:`PyObject_Repr` med ``\x``, ``u`` eller ``U`` escapes. Detta genererar en sträng som liknar den som returneras av :c:func:`PyObject_Repr` i Python 2. Anropas av den inbyggda funktionen :func:`ascii`.

source: Compute a string representation of object *o*. Returns the string representation on success, ``NULL`` on failure. This is the equivalent of the Python expression ``str(o)``. Called by the :func:`str` built-in function and, therefore, by the :func:`print` function.
sv: Beräknar en strängrepresentation av objektet *o*. Returnerar strängrepresentationen vid framgång, ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``str(o)``. Anropas av den inbyggda funktionen :func:`str` och därför även av funktionen :func:`print`.

source: Compute a bytes representation of object *o*. ``NULL`` is returned on failure and a bytes object on success. This is equivalent to the Python expression ``bytes(o)``, when *o* is not an integer. Unlike ``bytes(o)``, a TypeError is raised when *o* is an integer instead of a zero-initialized bytes object.
sv: Beräkna en bytesrepresentation av objektet *o*. ``NULL`` returneras vid misslyckande och ett bytesobjekt vid framgång. Detta är likvärdigt med Python-uttrycket ``bytes(o)``, när *o* inte är ett heltal. Till skillnad från ``bytes(o)`` uppstår ett TypeError när *o* är ett heltal istället för ett nollinitialiserat bytesobjekt.

source: Return ``1`` if the class *derived* is identical to or derived from the class *cls*, otherwise return ``0``. In case of an error, return ``-1``.
sv: Returnerar ``1`` om klassen *derived* är identisk med eller härledd från klassen *cls*, annars returneras ``0``. Vid ett fel returneras ``-1``.

source: If *cls* is a tuple, the check will be done against every entry in *cls*. The result will be ``1`` when at least one of the checks returns ``1``, otherwise it will be ``0``.
sv: Om *cls* är en tupel kommer kontrollen att göras mot varje post i *cls*. Resultatet blir ``1`` när minst en av kontrollerna returnerar ``1``, annars blir det ``0``.

source: If *cls* has a :meth:`~type.__subclasscheck__` method, it will be called to determine the subclass status as described in :pep:`3119`. Otherwise, *derived* is a subclass of *cls* if it is a direct or indirect subclass, i.e. contained in :attr:`cls.__mro__ <type.__mro__>`.
sv: Om *cls* har en :meth:`~type.__subclasscheck__`-metod, kommer den att anropas för att bestämma subklassstatusen enligt beskrivningen i :pep:`3119`. Annars är *derived* en underklass till *cls* om den är en direkt eller indirekt underklass, dvs. ingår i :attr:`cls.__mro__ <type.__mro__>`.

source: Normally only class objects, i.e. instances of :class:`type` or a derived class, are considered classes. However, objects can override this by having a :attr:`~type.__bases__` attribute (which must be a tuple of base classes).
sv: Normalt betraktas endast klassobjekt, dvs. instanser av :class:`type` eller en härledd klass, som klasser. Objekt kan dock åsidosätta detta genom att ha ett :attr:`~type.__bases__`-attribut (som måste vara en tupel av basklasser).

source: Return ``1`` if *inst* is an instance of the class *cls* or a subclass of *cls*, or ``0`` if not. On error, returns ``-1`` and sets an exception.
sv: Returnerar ``1`` om *inst* är en instans av klassen *cls* eller en underklass av *cls*, eller ``0`` om inte. Vid fel returneras ``-1`` och ett undantag anges.

source: If *cls* has a :meth:`~type.__instancecheck__` method, it will be called to determine the subclass status as described in :pep:`3119`. Otherwise, *inst* is an instance of *cls* if its class is a subclass of *cls*.
sv: Om *cls* har en :meth:`~type.__instancecheck__`-metod, kommer den att anropas för att bestämma underklassstatusen enligt beskrivningen i :pep:`3119`. Annars är *inst* en instans av *cls* om dess klass är en underklass av *cls*.

source: An instance *inst* can override what is considered its class by having a :attr:`~object.__class__` attribute.
sv: En instans *inst* kan åsidosätta vad som anses vara dess klass genom att ha ett :attr:`~object.__class__`-attribut.

source: An object *cls* can override if it is considered a class, and what its base classes are, by having a :attr:`~type.__bases__` attribute (which must be a tuple of base classes).
sv: Ett objekt *cls* kan åsidosätta om det betraktas som en klass och vilka dess basklasser är genom att ha ett :attr:`~type.__bases__`-attribut (som måste vara en tupel av basklasser).
