Repository: yeager/python-docs-sv
Catalog: c-api/perfmaps.po
Languages: sv

source: Support for Perf Maps
sv: Stöd för Perf Maps

source: On supported platforms (as of this writing, only Linux), the runtime can take advantage of *perf map files* to make Python functions visible to an external profiling tool (such as `perf <https://perf.wiki.kernel.org/index.php/Main_Page>`_). A running process may create a file in the ``/tmp`` directory, which contains entries that can map a section of executable code to a name. This interface is described in the `documentation of the Linux Perf tool <https://git.kernel.org/pub/scm/linux/ kernel/git/torvalds/linux.git/tree/tools/perf/Documentation/jit-interface.txt>`_.
sv: På plattformar som stöds (i skrivande stund endast Linux) kan runtime dra nytta av *perf map files* för att göra Python-funktioner synliga för ett externt profileringsverktyg (t.ex. `perf <https://perf.wiki.kernel.org/index.php/Main_Page>`_). En process som körs kan skapa en fil i katalogen ``/tmp``, som innehåller poster som kan mappa ett avsnitt av körbar kod till ett namn. Det här gränssnittet beskrivs i `dokumentationen för Linux Perf-verktyget <https://git.kernel.org/pub/scm/linux/ kernel/git/torvalds/linux.git/tree/tools/perf/Documentation/jit-interface.txt>`_.

source: In Python, these helper APIs can be used by libraries and features that rely on generating machine code on the fly.
sv: I Python kan dessa hjälp-API:er användas av bibliotek och funktioner som förlitar sig på att generera maskinkod i farten.

source: Note that holding an :term:`attached thread state` is not required for these APIs.
sv: Observera att det inte är nödvändigt att hålla en :term:`attached thread state` för dessa API:er.

source: Open the ``/tmp/perf-$pid.map`` file, unless it's already opened, and create a lock to ensure thread-safe writes to the file (provided the writes are done through :c:func:`PyUnstable_WritePerfMapEntry`). Normally, there's no need to call this explicitly; just use :c:func:`PyUnstable_WritePerfMapEntry` and it will initialize the state on first call.
sv: Öppna filen ``/tmp/perf-$pid.map``, om den inte redan är öppnad, och skapa ett lås för att säkerställa trådsäkra skrivningar till filen (förutsatt att skrivningarna görs via :c:func:`PyUnstable_WritePerfMapEntry`). Normalt finns det inget behov av att anropa detta explicit; använd bara :c:func:`PyUnstable_WritePerfMapEntry` och det kommer att initiera tillståndet vid första anropet.

source: Returns ``0`` on success, ``-1`` on failure to create/open the perf map file, or ``-2`` on failure to create a lock. Check ``errno`` for more information about the cause of a failure.
sv: Returnerar ``0`` vid framgång, ``-1`` vid misslyckande med att skapa/öppna perf map-filen eller ``-2`` vid misslyckande med att skapa ett lås. Kontrollera ``errno`` för mer information om orsaken till ett misslyckande.

source: Write one single entry to the ``/tmp/perf-$pid.map`` file. This function is thread safe. Here is what an example entry looks like::
sv: Skriv en enda post till filen ``/tmp/perf-$pid.map``. Denna funktion är trådsäker. Så här ser ett exempel på en post ut::

source: # address size name 7f3529fcf759 b py::bar:/run/t.py
sv: # adress storlek namn 7f3529fcf759 b py::bar:/run/t.py

source: Will call :c:func:`PyUnstable_PerfMapState_Init` before writing the entry, if the perf map file is not already opened. Returns ``0`` on success, or the same error codes as :c:func:`PyUnstable_PerfMapState_Init` on failure.
sv: Anropar :c:func:`PyUnstable_PerfMapState_Init` innan posten skrivs, om perf map-filen inte redan är öppnad. Returnerar ``0`` vid framgång, eller samma felkoder som :c:func:`PyUnstable_PerfMapState_Init` vid misslyckande.

source: Close the perf map file opened by :c:func:`PyUnstable_PerfMapState_Init`. This is called by the runtime itself during interpreter shut-down. In general, there shouldn't be a reason to explicitly call this, except to handle specific scenarios such as forking.
sv: Stäng perf map-filen som öppnades av :c:func:`PyUnstable_PerfMapState_Init`. Detta anropas av körtiden själv under tolkens avstängning. I allmänhet bör det inte finnas någon anledning att uttryckligen anropa detta, förutom för att hantera specifika scenarier som forking.
