Repository: yeager/python-docs-sv
Catalog: c-api/stable.po
Languages: sv

source: C API Stability
sv: C API-stabilitet

source: Unless documented otherwise, Python's C API is covered by the Backwards Compatibility Policy, :pep:`387`. Most changes to it are source-compatible (typically by only adding new API). Changing existing API or removing API is only done after a deprecation period or to fix serious issues.
sv: Om inte annat dokumenterats omfattas Pythons C API av policyn för bakåtkompatibilitet, :pep:`387`. De flesta ändringar av det är källkompatibla (vanligtvis genom att bara lägga till nytt API). Att ändra befintligt API eller ta bort API görs endast efter en föråldringsperiod eller för att åtgärda allvarliga problem.

source: CPython's Application Binary Interface (ABI) is forward- and backwards-compatible across a minor release (if these are compiled the same way; see :ref:`stable-abi-platform` below). So, code compiled for Python 3.10.0 will work on 3.10.8 and vice versa, but will need to be compiled separately for 3.9.x and 3.11.x.
sv: CPythons Application Binary Interface (ABI) är framåt- och bakåtkompatibelt över en mindre utgåva (om dessa kompileras på samma sätt; se :ref:`stable-abi-platform` nedan). Så kod kompilerad för Python 3.10.0 kommer att fungera på 3.10.8 och vice versa, men måste kompileras separat för 3.9.x och 3.11.x.

source: There are two tiers of C API with different stability expectations:
sv: Det finns två nivåer av C API med olika stabilitetsförväntningar:

source: :ref:`Unstable API <unstable-c-api>`, may change in minor versions without a deprecation period. It is marked by the ``PyUnstable`` prefix in names.
sv: :ref:`Unstable API <unstable-c-api>`, kan ändras i mindre versioner utan en utfasningsperiod. Det markeras med prefixet ``PyUnstable`` i namn.

source: :ref:`Limited API <limited-c-api>`, is compatible across several minor releases. When :c:macro:`Py_LIMITED_API` is defined, only this subset is exposed from ``Python.h``.
sv: :ref:`Limited API <limited-c-api>`, är kompatibel med flera mindre utgåvor. När :c:macro:`Py_LIMITED_API` är definierat, exponeras endast denna delmängd från ``Python.h``.

source: These are discussed in more detail below.
sv: Dessa diskuteras mer i detalj nedan.

source: Names prefixed by an underscore, such as ``_Py_InternalState``, are private API that can change without notice even in patch releases. If you need to use this API, consider reaching out to `CPython developers <https://discuss.python.org/c/core-dev/c-api/30>`_ to discuss adding public API for your use case.
sv: Namn som föregås av en understrykning, till exempel ``_Py_InternalState``, är privata API som kan ändras utan föregående meddelande även i patchversioner. Om du behöver använda detta API bör du överväga att kontakta `CPython-utvecklare <https://discuss.python.org/c/core-dev/c-api/30>`_ för att diskutera att lägga till offentligt API för ditt användningsfall.

source: Unstable C API
sv: Instabilt C API

source: Any API named with the ``PyUnstable`` prefix exposes CPython implementation details, and may change in every minor release (e.g. from 3.9 to 3.10) without any deprecation warnings. However, it will not change in a bugfix release (e.g. from 3.10.0 to 3.10.1).
sv: Alla API som namnges med prefixet ``PyUnstable`` exponerar CPython-implementeringsdetaljer och kan ändras i varje mindre utgåva (t.ex. från 3.9 till 3.10) utan några varningar om föråldring. Den kommer dock inte att ändras i en buggfixversion (t.ex. från 3.10.0 till 3.10.1).

source: It is generally intended for specialized, low-level tools like debuggers.
sv: Det är i allmänhet avsett för specialiserade lågnivåverktyg som t.ex. debuggar.

source: Projects that use this API are expected to follow CPython development and spend extra effort adjusting to changes.
sv: Projekt som använder detta API förväntas följa CPython-utvecklingen och lägga ner extra arbete på att anpassa sig till förändringar.

source: Stable Application Binary Interface
sv: Binärt gränssnitt för stabila applikationer

source: For simplicity, this document talks about *extensions*, but the Limited API and Stable ABI work the same way for all uses of the API – for example, embedding Python.
sv: För enkelhetens skull talar vi i det här dokumentet om *tillägg*, men Limited API och Stable ABI fungerar på samma sätt för alla användningar av API:et - till exempel inbäddning av Python.

source: Limited C API
sv: Begränsad C API

source: Python 3.2 introduced the *Limited API*, a subset of Python's C API. Extensions that only use the Limited API can be compiled once and be loaded on multiple versions of Python. Contents of the Limited API are :ref:`listed below <limited-api-list>`.
sv: I Python 3.2 introducerades *Limited API*, en delmängd av Pythons C API. Tillägg som bara använder Limited API kan kompileras en gång och laddas på flera versioner av Python. Innehållet i det begränsade API:et är :ref:`listat nedan <limited-api-list>`.

source: Define this macro before including ``Python.h`` to opt in to only use the Limited API, and to select the Limited API version.
sv: Definiera detta makro innan du inkluderar ``Python.h`` för att välja att endast använda det begränsade API:et och för att välja den begränsade API-versionen.

source: Define ``Py_LIMITED_API`` to the value of :c:macro:`PY_VERSION_HEX` corresponding to the lowest Python version your extension supports. The extension will be ABI-compatible with all Python 3 releases from the specified one onward, and can use Limited API introduced up to that version.
sv: Definiera ``Py_LIMITED_API`` till värdet av :c:macro:`PY_VERSION_HEX` som motsvarar den lägsta Python-versionen som ditt tillägg stöder. Tillägget kommer att vara ABI-kompatibelt med alla Python 3-versioner från den angivna och framåt, och kan använda Limited API som introducerats fram till den versionen.

source: Rather than using the ``PY_VERSION_HEX`` macro directly, hardcode a minimum minor version (e.g. ``0x030A0000`` for Python 3.10) for stability when compiling with future Python versions.
sv: I stället för att använda makrot ``PY_VERSION_HEX`` direkt, hårdkoda en minsta minor-version (t.ex. ``0x030A0000`` för Python 3.10) för stabilitet vid kompilering med framtida Python-versioner.

source: You can also define ``Py_LIMITED_API`` to ``3``. This works the same as ``0x03020000`` (Python 3.2, the version that introduced Limited API).
sv: Du kan också definiera ``Py_LIMITED_API`` till ``3``. Detta fungerar på samma sätt som ```0x03020000`` (Python 3.2, den version som introducerade Limited API).

source: Stable ABI
sv: Stabil ABI

source: To enable this, Python provides a *Stable ABI*: a set of symbols that will remain ABI-compatible across Python 3.x versions.
sv: För att möjliggöra detta tillhandahåller Python en *Stable ABI*: en uppsättning symboler som kommer att förbli ABI-kompatibla i alla Python 3.x-versioner.

source: The Stable ABI prevents ABI issues, like linker errors due to missing symbols or data corruption due to changes in structure layouts or function signatures. However, other changes in Python can change the *behavior* of extensions. See Python's Backwards Compatibility Policy (:pep:`387`) for details.
sv: Det stabila ABI:t förhindrar ABI-problem, som länkarfel på grund av saknade symboler eller datakorruption på grund av ändringar i strukturlayouter eller funktionssignaturer. Andra ändringar i Python kan dock ändra *beteendet* hos tillägg. Se Pythons policy för bakåtkompatibilitet (:pep:`387`) för mer information.

source: The Stable ABI contains symbols exposed in the :ref:`Limited API <limited-c-api>`, but also other ones – for example, functions necessary to support older versions of the Limited API.
sv: Stable ABI innehåller symboler som exponeras i :ref:`Limited API <limited-c-api>`, men även andra - till exempel funktioner som är nödvändiga för att stödja äldre versioner av Limited API.

source: On Windows, extensions that use the Stable ABI should be linked against ``python3.dll`` rather than a version-specific library such as ``python39.dll``.
sv: I Windows bör tillägg som använder Stable ABI länkas mot ``python3.dll`` snarare än ett versionsspecifikt bibliotek som ``python39.dll``.

source: On some platforms, Python will look for and load shared library files named with the ``abi3`` tag (e.g. ``mymodule.abi3.so``). It does not check if such extensions conform to a Stable ABI. The user (or their packaging tools) need to ensure that, for example, extensions built with the 3.10+ Limited API are not installed for lower versions of Python.
sv: På vissa plattformar kommer Python att leta efter och ladda delade biblioteksfiler som namnges med taggen ``abi3`` (t.ex. ``mymodule.abi3.so``). Det kontrolleras inte om sådana tillägg överensstämmer med ett stabilt ABI. Användaren (eller deras paketeringsverktyg) måste se till att t.ex. tillägg som är byggda med 3.10+ Limited API inte installeras för lägre versioner av Python.

source: All functions in the Stable ABI are present as functions in Python's shared library, not solely as macros. This makes them usable from languages that don't use the C preprocessor.
sv: Alla funktioner i Stable ABI finns som funktioner i Pythons delade bibliotek, inte enbart som makron. Detta gör dem användbara från språk som inte använder C-preprocessorn.

source: Limited API Scope and Performance
sv: Begränsad API-omfattning och prestanda

source: The goal for the Limited API is to allow everything that is possible with the full C API, but possibly with a performance penalty.
sv: Målet med det begränsade API:et är att tillåta allt som är möjligt med det fullständiga C API:et, men möjligen med en prestandaförlust.

source: For example, while :c:func:`PyList_GetItem` is available, its “unsafe” macro variant :c:func:`PyList_GET_ITEM` is not. The macro can be faster because it can rely on version-specific implementation details of the list object.
sv: Till exempel, medan :c:func:`PyList_GetItem` är tillgänglig, är dess "osäkra" makrovariant :c:func:`PyList_GET_ITEM` inte det. Makrot kan vara snabbare eftersom det kan förlita sig på versionsspecifika implementeringsdetaljer för listobjektet.

source: Without ``Py_LIMITED_API`` defined, some C API functions are inlined or replaced by macros. Defining ``Py_LIMITED_API`` disables this inlining, allowing stability as Python's data structures are improved, but possibly reducing performance.
sv: Utan ``Py_LIMITED_API`` definierad, är vissa C API-funktioner inlinade eller ersatta av makron. Genom att definiera ``Py_LIMITED_API`` inaktiveras denna inlining, vilket ger stabilitet när Pythons datastrukturer förbättras, men eventuellt försämrad prestanda.

source: By leaving out the ``Py_LIMITED_API`` definition, it is possible to compile a Limited API extension with a version-specific ABI. This can improve performance for that Python version, but will limit compatibility. Compiling with ``Py_LIMITED_API`` will then yield an extension that can be distributed where a version-specific one is not available – for example, for prereleases of an upcoming Python version.
sv: Genom att utelämna definitionen ``Py_LIMITED_API`` är det möjligt att kompilera ett Limited API-tillägg med ett versionsspecifikt ABI. Detta kan förbättra prestanda för den Python-versionen, men kommer att begränsa kompatibiliteten. Kompilering med ``Py_LIMITED_API`` kommer då att ge ett tillägg som kan distribueras där en versionsspecifik inte är tillgänglig - till exempel för förhandsversioner av en kommande Python-version.

source: Limited API Caveats
sv: Begränsade API-förbehåll

source: Note that compiling with ``Py_LIMITED_API`` is *not* a complete guarantee that code conforms to the :ref:`Limited API <limited-c-api>` or the :ref:`Stable ABI <stable-abi>`. ``Py_LIMITED_API`` only covers definitions, but an API also includes other issues, such as expected semantics.
sv: Observera att kompilering med ``Py_LIMITED_API`` *inte* är en fullständig garanti för att koden överensstämmer med :ref:`Limited API <limited-c-api>` eller :ref:`Stable ABI <stable-abi>`. ``Py_LIMITED_API`` omfattar endast definitioner, men ett API omfattar även andra frågor, t.ex. förväntad semantik.

source: One issue that ``Py_LIMITED_API`` does not guard against is calling a function with arguments that are invalid in a lower Python version. For example, consider a function that starts accepting ``NULL`` for an argument. In Python 3.9, ``NULL`` now selects a default behavior, but in Python 3.8, the argument will be used directly, causing a ``NULL`` dereference and crash. A similar argument works for fields of structs.
sv: Ett problem som ``Py_LIMITED_API`` inte skyddar mot är att anropa en funktion med argument som är ogiltiga i en lägre Python-version. Tänk till exempel på en funktion som börjar acceptera ``NULL`` som ett argument. I Python 3.9 väljer ``NULL`` nu ett standardbeteende, men i Python 3.8 kommer argumentet att användas direkt, vilket orsakar en ``NULL`` dereference och krasch. Ett liknande argument fungerar för fält i structs.

source: Another issue is that some struct fields are currently not hidden when ``Py_LIMITED_API`` is defined, even though they're part of the Limited API.
sv: Ett annat problem är att vissa struct-fält för närvarande inte är dolda när ``Py_LIMITED_API`` definieras, trots att de ingår i Limited API.

source: For these reasons, we recommend testing an extension with *all* minor Python versions it supports, and preferably to build with the *lowest* such version.
sv: Av dessa skäl rekommenderar vi att du testar ett tillägg med *alla* mindre Python-versioner som det stöder, och helst bygger med den *lägsta* sådana versionen.

source: We also recommend reviewing documentation of all used API to check if it is explicitly part of the Limited API. Even with ``Py_LIMITED_API`` defined, a few private declarations are exposed for technical reasons (or even unintentionally, as bugs).
sv: Vi rekommenderar också att du granskar dokumentationen för alla API:er som används för att kontrollera om de uttryckligen är en del av det begränsade API:et. Även med ``Py_LIMITED_API`` definierat exponeras några privata deklarationer av tekniska skäl (eller till och med oavsiktligt, som buggar).

source: Also note that the Limited API is not necessarily stable: compiling with ``Py_LIMITED_API`` with Python 3.8 means that the extension will run with Python 3.12, but it will not necessarily *compile* with Python 3.12. In particular, parts of the Limited API may be deprecated and removed, provided that the Stable ABI stays stable.
sv: Observera också att Limited API inte nödvändigtvis är stabilt: att kompilera med ``Py_LIMITED_API`` med Python 3.8 innebär att tillägget kommer att köras med Python 3.12, men det kommer inte nödvändigtvis att *kompilera* med Python 3.12. I synnerhet kan delar av det begränsade API:et vara föråldrade och tas bort, förutsatt att det stabila ABI:t förblir stabilt.

source: Platform Considerations
sv: Överväganden om plattform

source: ABI stability depends not only on Python, but also on the compiler used, lower-level libraries and compiler options. For the purposes of the :ref:`Stable ABI <stable-abi>`, these details define a “platform”. They usually depend on the OS type and processor architecture
sv: ABI-stabilitet beror inte bara på Python, utan också på den kompilator som används, bibliotek på lägre nivå och kompilatoralternativ. När det gäller :ref:`Stabil ABI <stable-abi>` definierar dessa detaljer en "plattform". De beror vanligtvis på operativsystemstyp och processorarkitektur

source: It is the responsibility of each particular distributor of Python to ensure that all Python versions on a particular platform are built in a way that does not break the Stable ABI. This is the case with Windows and macOS releases from ``python.org`` and many third-party distributors.
sv: Det är varje enskild Python-distributörs ansvar att se till att alla Python-versioner på en viss plattform är byggda på ett sätt som inte bryter mot Stable ABI. Detta är fallet med Windows- och macOS-utgåvor från ``python.org`` och många tredjepartsdistributörer.

source: Contents of Limited API
sv: Innehåll i begränsat API

source: Currently, the :ref:`Limited API <limited-c-api>` includes the following items:
sv: För närvarande innehåller :ref:`Limited API <limited-c-api>` följande artiklar:
