Repository: yeager/python-docs-sv
Catalog: c-api/structures.po
Languages: sv

source: The method will be loaded in place of existing definitions. Without *METH_COEXIST*, the default is to skip repeated definitions. Since slot wrappers are loaded before the method table, the existence of a *sq_contains* slot, for example, would generate a wrapped method named :meth:`~object.__contains__` and preclude the loading of a corresponding PyCFunction with the same name. With the flag defined, the PyCFunction will be loaded in place of the wrapper object and will co-exist with the slot. This is helpful because calls to PyCFunctions are optimized more than wrapper object calls.
sv: Metoden kommer att laddas i stället för befintliga definitioner. Utan *METH_COEXIST* är standardinställningen att hoppa över upprepade definitioner. Eftersom slot-omslag laddas före metodtabellen, skulle till exempel förekomsten av en *sq_contains* slot generera en omslagsmetod med namnet :meth:`~object.__contains__` och förhindra laddning av en motsvarande PyCFunction med samma namn. Med flaggan definierad kommer PyCFunktionen att laddas i stället för omslutningsobjektet och kommer att samexistera med slotten. Detta är användbart eftersom anrop till PyCFunktioner optimeras mer än anrop till omslagsobjekt.

source: Turn *ml* into a Python :term:`callable` object. The caller must ensure that *ml* outlives the :term:`callable`. Typically, *ml* is defined as a static variable.
sv: Gör *ml* till ett Python :term:`callable`-objekt. Den som anropar måste se till att *ml* överlever :term:`callable`. Vanligtvis är *ml* definierad som en statisk variabel.

source: The *self* parameter will be passed as the *self* argument to the C function in ``ml->ml_meth`` when invoked. *self* can be ``NULL``.
sv: Parametern *self* kommer att skickas som argumentet *self* till C-funktionen i ``ml->ml_meth`` när den anropas. *self* kan vara ``NULL``.

source: The :term:`callable` object's ``__module__`` attribute can be set from the given *module* argument. *module* should be a Python string, which will be used as name of the module the function is defined in. If unavailable, it can be set to :const:`None` or ``NULL``.
sv: Attributet ``__module__`` för objektet :term:`callable` kan ställas in från det givna argumentet *module*. *module* bör vara en Python-sträng, som kommer att användas som namn på den modul som funktionen definieras i. Om den inte är tillgänglig kan den sättas till :const:`None` eller ``NULL``.

source: :attr:`function.__module__`
sv: :attr:`funktion.__modul__`

source: The *cls* parameter will be passed as the *defining_class* argument to the C function. Must be set if :c:macro:`METH_METHOD` is set on ``ml->ml_flags``.
sv: Parametern *cls* kommer att skickas som argumentet *defining_class* till C-funktionen. Måste sättas om :c:macro:`METH_METHOD` är satt på ``ml->ml_flags``.

source: Equivalent to ``PyCMethod_New(ml, self, module, NULL)``.
sv: Motsvarar ``PyCMethod_New(ml, self, module, NULL)``.

source: Equivalent to ``PyCMethod_New(ml, self, NULL, NULL)``.
sv: Motsvarar ``PyCMethod_New(ml, self, NULL, NULL)``.

source: Accessing attributes of extension types
sv: Tillgång till attribut för tilläggstyper

source: Structure which describes an attribute of a type which corresponds to a C struct member. When defining a class, put a NULL-terminated array of these structures in the :c:member:`~PyTypeObject.tp_members` slot.
sv: Struktur som beskriver ett attribut av en typ som motsvarar en C struct-medlem. När du definierar en klass lägger du in en NULL-terminerad array av dessa strukturer i :c:member:`~PyTypeObject.tp_members` slot.

source: Its fields are, in order:
sv: Dess fält är i tur och ordning:

source: Name of the member. A NULL value marks the end of a ``PyMemberDef[]`` array.
sv: Namnet på medlemmen. Ett NULL-värde markerar slutet på en ``PyMemberDef[]``-array.

source: The string should be static, no copy is made of it.
sv: Strängen ska vara statisk, ingen kopia görs av den.

source: The type of the member in the C struct. See :ref:`PyMemberDef-types` for the possible values.
sv: Typen av medlemmen i C-strukturen. Se :ref:`PyMemberDef-types` för de möjliga värdena.

source: The offset in bytes that the member is located on the type’s object struct.
sv: Den offset i bytes som medlemmen befinner sig på i typens objektstruktur.

source: Zero or more of the :ref:`PyMemberDef-flags`, combined using bitwise OR.
sv: Noll eller flera av :ref:`PyMemberDef-flaggorna`, kombinerade med bitvis OR.

source: The docstring, or NULL. The string should be static, no copy is made of it. Typically, it is defined using :c:macro:`PyDoc_STR`.
sv: Dokumentsträngen, eller NULL. Strängen ska vara statisk, ingen kopia görs av den. Vanligtvis definieras den med hjälp av :c:macro:`PyDoc_STR`.

source: By default (when :c:member:`~PyMemberDef.flags` is ``0``), members allow both read and write access. Use the :c:macro:`Py_READONLY` flag for read-only access. Certain types, like :c:macro:`Py_T_STRING`, imply :c:macro:`Py_READONLY`. Only :c:macro:`Py_T_OBJECT_EX` (and legacy :c:macro:`T_OBJECT`) members can be deleted.
sv: Som standard (när :c:member:`~PyMemberDef.flags` är ``0``) tillåter medlemmar både läs- och skrivåtkomst. Använd flaggan :c:macro:`Py_READONLY` för skrivskyddad åtkomst. Vissa typer, som :c:macro:`Py_T_STRING`, innebär :c:macro:`Py_READONLY`. Endast :c:macro:`Py_T_OBJECT_EX` (och äldre :c:macro:`T_OBJECT`) medlemmar kan tas bort.

source: For heap-allocated types (created using :c:func:`PyType_FromSpec` or similar), ``PyMemberDef`` may contain a definition for the special member ``"__vectorcalloffset__"``, corresponding to :c:member:`~PyTypeObject.tp_vectorcall_offset` in type objects. This member must be defined with ``Py_T_PYSSIZET``, and either ``Py_READONLY`` or ``Py_READONLY | Py_RELATIVE_OFFSET``. For example::
sv: För heap-allokerade typer (skapade med :c:func:`PyType_FromSpec` eller liknande) kan ``PyMemberDef`` innehålla en definition för den speciella medlemmen ``"__vectorcalloffset__"``, motsvarande :c:member:`~PyTypeObject.tp_vectorcall_offset`` i typobjekt. Denna medlem måste definieras med ``Py_T_PYSSIZET``, och antingen ``Py_READONLY`` eller ``Py_READONLY | Py_RELATIVE_OFFSET``. Till exempel::

source: static PyMemberDef spam_type_members[] = { {"__vectorcalloffset__", Py_T_PYSSIZET, offsetof(Spam_object, vectorcall), Py_READONLY}, {NULL} /* Sentinel */ };
sv: statisk PyMemberDef spam_type_members[] = { {"__vectorcalloffset__", Py_T_PYSSIZET, offsetof(Spam_object, vectorcall), Py_READONLY}, {NULL} /* Sentinel */ };

source: (You may need to ``#include <stddef.h>`` for :c:func:`!offsetof`.)
sv: (Du kan behöva ``#include <stddef.h>`` för :c:func:`!offsetof`.)

source: The legacy offsets :c:member:`~PyTypeObject.tp_dictoffset` and :c:member:`~PyTypeObject.tp_weaklistoffset` can be defined similarly using ``"__dictoffset__"`` and ``"__weaklistoffset__"`` members, but extensions are strongly encouraged to use :c:macro:`Py_TPFLAGS_MANAGED_DICT` and :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead.
sv: De äldre offseten :c:member:`~PyTypeObject.tp_dictoffset` och :c:member:`~PyTypeObject.tp_weaklistoffset` kan definieras på liknande sätt med hjälp av medlemmarna ``"__dictoffset__"`` och ``"__weaklistoffset__"``, men tillägg uppmuntras starkt att använda :c:macro:`Py_TPFLAGS_MANAGED_DICT` och :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` istället.

source: ``PyMemberDef`` is always available. Previously, it required including ``"structmember.h"``.
sv: ``PyMemberDef`` är alltid tillgänglig. Tidigare krävdes det att man inkluderade ``"structmember.h"``.

source: :c:macro:`Py_RELATIVE_OFFSET` is now allowed for ``"__vectorcalloffset__"``, ``"__dictoffset__"`` and ``"__weaklistoffset__"``.
sv: :c:macro:`Py_RELATIVE_OFFSET` är nu tillåtet för ``"__vectorcalloffset__"``, ``"__dictoffset__"`` och ``"__weaklistoffset__"``.

source: Get an attribute belonging to the object at address *obj_addr*. The attribute is described by ``PyMemberDef`` *m*. Returns ``NULL`` on error.
sv: Hämtar ett attribut som tillhör objektet på adressen *obj_addr*. Attributet beskrivs av ``PyMemberDef`` *m*. Returnerar ``NULL`` vid fel.

source: ``PyMember_GetOne`` is always available. Previously, it required including ``"structmember.h"``.
sv: ``PyMember_GetOne`` är alltid tillgänglig. Tidigare krävdes det att man inkluderade ``"structmember.h"``.

source: Set an attribute belonging to the object at address *obj_addr* to object *o*. The attribute to set is described by ``PyMemberDef`` *m*. Returns ``0`` if successful and a negative value on failure.
sv: Ställ in ett attribut som tillhör objektet på adressen *obj_addr* till objektet *o*. Attributet som ska ställas in beskrivs av ``PyMemberDef`` *m*. Returnerar ``0`` om det lyckas och ett negativt värde om det misslyckas.

source: ``PyMember_SetOne`` is always available. Previously, it required including ``"structmember.h"``.
sv: ``PyMember_SetOne`` är alltid tillgänglig. Tidigare krävdes det att man inkluderade ``"structmember.h"``.

source: Member flags
sv: Flaggor för medlemmar

source: The following flags can be used with :c:member:`PyMemberDef.flags`:
sv: Följande flaggor kan användas med :c:member:`PyMemberDef.flags`:

source: Not writable.
sv: Ej skrivbar.

source: Emit an ``object.__getattr__`` :ref:`audit event <audit-events>` before reading.
sv: Skicka en ``object.__getattr__`` :ref:`audit event <audit-events>`` före läsning.

source: Indicates that the :c:member:`~PyMemberDef.offset` of this ``PyMemberDef`` entry indicates an offset from the subclass-specific data, rather than from ``PyObject``.
sv: Anger att :c:member:`~PyMemberDef.offset` i denna ``PyMemberDef``-post anger en offset från subklassspecifika data, snarare än från ``PyObject``.

source: Can only be used as part of :c:member:`Py_tp_members <PyTypeObject.tp_members>` :c:type:`slot <PyType_Slot>` when creating a class using negative :c:member:`~PyType_Spec.basicsize`. It is mandatory in that case.
sv: Kan endast användas som en del av :c:member:`Py_tp_members <PyTypeObject.tp_members>` :c:type:`slot <PyType_Slot>` när man skapar en klass med negativ :c:member:`~PyType_Spec.basicsize`. Det är obligatoriskt i det fallet.

source: This flag is only used in :c:type:`PyType_Slot`. When setting :c:member:`~PyTypeObject.tp_members` during class creation, Python clears it and sets :c:member:`PyMemberDef.offset` to the offset from the ``PyObject`` struct.
sv: Denna flagga används endast i :c:type:`PyType_Slot`. När du ställer in :c:member:`~PyTypeObject.tp_members` under skapandet av klassen, rensar Python den och ställer in :c:member:`PyMemberDef.offset` till offset från ``PyObject``-strukturen.

source: The :c:macro:`!RESTRICTED`, :c:macro:`!READ_RESTRICTED` and :c:macro:`!WRITE_RESTRICTED` macros available with ``#include "structmember.h"`` are deprecated. :c:macro:`!READ_RESTRICTED` and :c:macro:`!RESTRICTED` are equivalent to :c:macro:`Py_AUDIT_READ`; :c:macro:`!WRITE_RESTRICTED` does nothing.
sv: Makron :c:macro:`!RESTRICTED`, :c:macro:`!READ_RESTRICTED` och :c:macro:`!WRITE_RESTRICTED` som är tillgängliga med ``#include "structmember.h"`` är föråldrade. :c:macro:`!READ_RESTRICTED` och :c:macro:`!RESTRICTED` är likvärdiga med :c:macro:`Py_AUDIT_READ`; :c:macro:`!WRITE_RESTRICTED` gör ingenting.

source: The :c:macro:`!READONLY` macro was renamed to :c:macro:`Py_READONLY`. The :c:macro:`!PY_AUDIT_READ` macro was renamed with the ``Py_`` prefix. The new names are now always available. Previously, these required ``#include "structmember.h"``. The header is still available and it provides the old names.
sv: Makrot :c:macro:`!READONLY` döptes om till :c:macro:`Py_READONLY`. Makrot :c:macro:`!PY_AUDIT_READ` döptes om med prefixet ``Py_``. De nya namnen är nu alltid tillgängliga. Tidigare krävde dessa ``#include "structmember.h"``. Headern är fortfarande tillgänglig och den innehåller de gamla namnen.

source: Member types
sv: Typer av medlemmar

source: :c:member:`PyMemberDef.type` can be one of the following macros corresponding to various C types. When the member is accessed in Python, it will be converted to the equivalent Python type. When it is set from Python, it will be converted back to the C type. If that is not possible, an exception such as :exc:`TypeError` or :exc:`ValueError` is raised.
sv: :c:member:`PyMemberDef.type` kan vara ett av följande makron som motsvarar olika C-typer. När medlemmen används i Python konverteras den till motsvarande Python-typ. När den sätts från Python konverteras den tillbaka till C-typen. Om det inte är möjligt, kommer ett undantag som :exc:`TypeError` eller :exc:`ValueError` att uppstå.

source: Unless marked (D), attributes defined this way cannot be deleted using e.g. :keyword:`del` or :py:func:`delattr`.
sv: Om inte markerat (D), kan attribut som definieras på detta sätt inte raderas med t.ex. :keyword:`del` eller :py:func:`delattr`.

source: Macro name
sv: Namn på makro

source: C type
sv: C-typ

source: Python type
sv: Python-typ

source: :c:expr:`short`
sv: :c:expr:`kort`

source: :c:expr:`long`
sv: :c:expr:`lång`

source: :c:expr:`long long`
sv: :c:expr:`lång lång`

source: :c:expr:`char` (written as 0 or 1)
sv: :c:expr:`char` (skrivs som 0 eller 1)

source: (*): Zero-terminated, UTF8-encoded C string. With :c:macro:`!Py_T_STRING` the C representation is a pointer; with :c:macro:`!Py_T_STRING_INPLACE` the string is stored directly in the structure.
sv: (*): Nollavslutad, UTF8-kodad C-sträng. Med :c:macro:`!Py_T_STRING` är C-representationen en pekare; med :c:macro:`!Py_T_STRING_INPLACE` lagras strängen direkt i strukturen.

source: (**): String of length 1. Only ASCII is accepted.
sv: (**): Sträng med längden 1. Endast ASCII accepteras.

source: (RO): Implies :c:macro:`Py_READONLY`.
sv: (RO): Innebär :c:makro:`Py_READONLY`.

source: (D): Can be deleted, in which case the pointer is set to ``NULL``. Reading a ``NULL`` pointer raises :py:exc:`AttributeError`.
sv: (D): Kan raderas, i vilket fall pekaren sätts till ``NULL``. Att läsa en ``NULL`` pekare ger upphov till :py:exc:`AttributeError`.

source: In previous versions, the macros were only available with ``#include "structmember.h"`` and were named without the ``Py_`` prefix (e.g. as ``T_INT``). The header is still available and contains the old names, along with the following deprecated types:
sv: I tidigare versioner var makron endast tillgängliga med ``#include "structmember.h"`` och namngavs utan prefixet ``Py_`` (t.ex. som ``T_INT``). Headern är fortfarande tillgänglig och innehåller de gamla namnen, tillsammans med följande föråldrade typer:

source: Like ``Py_T_OBJECT_EX``, but ``NULL`` is converted to ``None``. This results in surprising behavior in Python: deleting the attribute effectively sets it to ``None``.
sv: Som ``Py_T_OBJECT_EX``, men ``NULL`` konverteras till ``None``. Detta resulterar i ett överraskande beteende i Python: att ta bort attributet sätter det effektivt till ``None``.

source: Always ``None``. Must be used with :c:macro:`Py_READONLY`.
sv: Alltid ``None``. Måste användas med :c:macro:`Py_READONLY`.

source: Defining Getters and Setters
sv: Definiera Getters och Setters

source: Structure to define property-like access for a type. See also description of the :c:member:`PyTypeObject.tp_getset` slot.
sv: Struktur för att definiera egendomsliknande åtkomst för en typ. Se även beskrivning av :c:member:`PyTypeObject.tp_getset` slot.

source: attribute name
sv: attributets namn

source: C function to get the attribute.
sv: C-funktion för att få fram attributet.

source: Optional C function to set or delete the attribute. If ``NULL``, the attribute is read-only.
sv: Valfri C-funktion för att ställa in eller ta bort attributet. Om ``NULL``, är attributet skrivskyddat.

source: optional docstring
sv: valfri dokumentsträng

source: Optional user data pointer, providing additional data for getter and setter.
sv: Valfri användardatapekare som tillhandahåller ytterligare data för getter och setter.

source: The ``get`` function takes one :c:expr:`PyObject*` parameter (the instance) and a user data pointer (the associated ``closure``):
sv: Funktionen ``get`` tar en :c:expr:`PyObject*`-parameter (instansen) och en användardatapekare (den tillhörande ``closure``):

source: It should return a new reference on success or ``NULL`` with a set exception on failure.
sv: Den ska returnera en ny referens om den lyckas eller ``NULL`` med ett definierat undantag om den misslyckas.

source: ``set`` functions take two :c:expr:`PyObject*` parameters (the instance and the value to be set) and a user data pointer (the associated ``closure``):
sv: ``set`` funktioner tar två :c:expr:`PyObject*` parametrar (instansen och värdet som ska ställas in) och en användardatapekare (den tillhörande ``closure``):

source: In case the attribute should be deleted the second parameter is ``NULL``. Should return ``0`` on success or ``-1`` with a set exception on failure.
sv: Om attributet ska tas bort är den andra parametern ``NULL``. Bör returnera ``0`` vid framgång eller ``-1`` med ett angivet undantag vid misslyckande.

source: built-in function
sv: inbyggd funktion

source: classmethod
sv: klassmetod

source: staticmethod
sv: statisk metod

source: READ_RESTRICTED (C macro)
sv: READ_RESTRICTED (C-makro)

source: WRITE_RESTRICTED (C macro)
sv: WRITE_RESTRICTED (C-makro)

source: RESTRICTED (C macro)
sv: BEGRÄNSAD (C-makro)

source: READONLY (C macro)
sv: READONLY (C-makro)

source: T_BYTE (C macro)
sv: T_BYTE (C-makro)

source: T_SHORT (C macro)
sv: T_SHORT (C-makro)

source: T_INT (C macro)
sv: T_INT (C-makro)

source: T_LONG (C macro)
sv: T_LONG (C-makro)

source: T_LONGLONG (C macro)
sv: T_LONGLONG (C-makro)

source: T_UBYTE (C macro)
sv: T_UBYTE (C-makro)

source: T_USHORT (C macro)
sv: T_USHORT (C-makro)

source: T_UINT (C macro)
sv: T_UINT (C-makro)

source: T_ULONG (C macro)
sv: T_ULONG (C-makro)

source: T_ULONGULONG (C macro)
sv: T_ULONGULONG (C-makro)

source: T_PYSSIZET (C macro)
sv: T_PYSSIZET (C-makro)

source: T_FLOAT (C macro)
sv: T_FLOAT (C-makro)

source: T_DOUBLE (C macro)
sv: T_DOUBLE (C-makro)

source: T_BOOL (C macro)
sv: T_BOOL (C-makro)

source: T_CHAR (C macro)
sv: T_CHAR (C-makro)

source: T_STRING (C macro)
sv: T_STRING (C-makro)

source: T_STRING_INPLACE (C macro)
sv: T_STRING_INPLACE (C-makro)

source: T_OBJECT_EX (C macro)
sv: T_OBJECT_EX (C-makro)
