Repository: yeager/python-docs-sv
Catalog: c-api/structures.po
Languages: sv

source: Common Object Structures
sv: Vanliga objektstrukturer

source: There are a large number of structures which are used in the definition of object types for Python. This section describes these structures and how they are used.
sv: Det finns ett stort antal strukturer som används vid definitionen av objekttyper i Python. I detta avsnitt beskrivs dessa strukturer och hur de används.

source: Base object types and macros
sv: Typer av basobjekt och makron

source: All Python objects ultimately share a small number of fields at the beginning of the object's representation in memory. These are represented by the :c:type:`PyObject` and :c:type:`PyVarObject` types, which are defined, in turn, by the expansions of some macros also used, whether directly or indirectly, in the definition of all other Python objects. Additional macros can be found under :ref:`reference counting <countingrefs>`.
sv: Alla Python-objekt delar i slutändan ett litet antal fält i början av objektets representation i minnet. Dessa representeras av typerna :c:type:`PyObject` och :c:type:`PyVarObject`, som i sin tur definieras av utvidgningarna av vissa makron som också används, direkt eller indirekt, i definitionen av alla andra Python-objekt. Ytterligare makron finns under :ref:`referensräkning <countingrefs>`.

source: All object types are extensions of this type. This is a type which contains the information Python needs to treat a pointer to an object as an object. In a normal "release" build, it contains only the object's reference count and a pointer to the corresponding type object. Nothing is actually declared to be a :c:type:`PyObject`, but every pointer to a Python object can be cast to a :c:expr:`PyObject*`.
sv: Alla objekttyper är utvidgningar av denna typ. Detta är en typ som innehåller den information som Python behöver för att behandla en pekare till ett objekt som ett objekt. I en normal "release"-byggnad innehåller den bara objektets referensantal och en pekare till motsvarande typobjekt. Ingenting är faktiskt deklarerat att vara ett :c:type:`PyObject`, men varje pekare till ett Python-objekt kan castas till ett :c:expr:`PyObject*`.

source: The members must not be accessed directly; instead use macros such as :c:macro:`Py_REFCNT` and :c:macro:`Py_TYPE`.
sv: Medlemmarna får inte nås direkt; använd istället makron som :c:macro:`Py_REFCNT` och :c:macro:`Py_TYPE`.

source: The object's reference count, as returned by :c:macro:`Py_REFCNT`. Do not use this field directly; instead use functions and macros such as :c:macro:`!Py_REFCNT`, :c:func:`Py_INCREF` and :c:func:`Py_DecRef`.
sv: Objektets referensantal, som returneras av :c:macro:`Py_REFCNT`. Använd inte detta fält direkt, utan använd istället funktioner och makron som :c:macro:`!Py_REFCNT`, :c:func:`Py_INCREF` och :c:func:`Py_DecRef`.

source: The field type may be different from ``Py_ssize_t``, depending on build configuration and platform.
sv: Fälttypen kan skilja sig från ``Py_ssize_t``, beroende på byggkonfiguration och plattform.

source: The object's type. Do not use this field directly; use :c:macro:`Py_TYPE` and :c:func:`Py_SET_TYPE` instead.
sv: Objektets typ. Använd inte detta fält direkt; använd :c:macro:`Py_TYPE` och :c:func:`Py_SET_TYPE` istället.

source: An extension of :c:type:`PyObject` that adds the :c:member:`~PyVarObject.ob_size` field. This is intended for objects that have some notion of *length*.
sv: En utökning av :c:type:`PyObject` som lägger till fältet :c:member:`~PyVarObject.ob_size`. Detta är avsett för objekt som har någon uppfattning om *längd*.

source: As with :c:type:`!PyObject`, the members must not be accessed directly; instead use macros such as :c:macro:`Py_SIZE`, :c:macro:`Py_REFCNT` and :c:macro:`Py_TYPE`.
sv: Precis som med :c:type:`!PyObject` får medlemmarna inte nås direkt; använd istället makron som :c:macro:`Py_SIZE`, :c:macro:`Py_REFCNT` och :c:macro:`Py_TYPE`.

source: A size field, whose contents should be considered an object's internal implementation detail.
sv: Ett storleksfält, vars innehåll bör betraktas som ett objekts interna implementeringsdetaljer.

source: Do not use this field directly; use :c:macro:`Py_SIZE` instead.
sv: Använd inte detta fält direkt utan använd istället :c:macro:`Py_SIZE`.

source: Object creation functions such as :c:func:`PyObject_NewVar` will generally set this field to the requested size (number of items). After creation, arbitrary values can be stored in :c:member:`!ob_size` using :c:macro:`Py_SET_SIZE`.
sv: Objektskapande funktioner som :c:func:`PyObject_NewVar` kommer i allmänhet att sätta detta fält till den begärda storleken (antal objekt). Efter skapandet kan godtyckliga värden lagras i :c:member:`!ob_size` med hjälp av :c:macro:`Py_SET_SIZE`.

source: To get an object's publicly exposed length, as returned by the Python function :py:func:`len`, use :c:func:`PyObject_Length` instead.
sv: För att få ett objekts offentligt exponerade längd, som returneras av Python-funktionen :py:func:`len`, använder du istället :c:func:`PyObject_Length`.

source: This is a macro used when declaring new types which represent objects without a varying length. The PyObject_HEAD macro expands to::
sv: Detta är ett makro som används vid deklaration av nya typer som representerar objekt utan varierande längd. PyObject_HEAD-makrot expanderar till::

source: See documentation of :c:type:`PyObject` above.
sv: Se dokumentation av :c:type:`PyObject` ovan.

source: This is a macro used when declaring new types which represent objects with a length that varies from instance to instance. The PyObject_VAR_HEAD macro expands to::
sv: Detta är ett makro som används vid deklaration av nya typer som representerar objekt med en längd som varierar från instans till instans. Makrot PyObject_VAR_HEAD expanderar till::

source: See documentation of :c:type:`PyVarObject` above.
sv: Se dokumentation av :c:type:`PyVarObject` ovan.

source: The base class of all other objects, the same as :class:`object` in Python.
sv: Basklassen för alla andra objekt, samma sak som :class:`object` i Python.

source: Test if the *x* object is the *y* object, the same as ``x is y`` in Python.
sv: Testar om *x*-objektet är *y*-objektet, på samma sätt som ``x är y`` i Python.

source: Test if an object is the ``None`` singleton, the same as ``x is None`` in Python.
sv: Testar om ett objekt är singleton ``None``, samma sak som ``x is None`` i Python.

source: Test if an object is the ``True`` singleton, the same as ``x is True`` in Python.
sv: Testar om ett objekt är ``True`` singleton, på samma sätt som ``x is True`` i Python.

source: Test if an object is the ``False`` singleton, the same as ``x is False`` in Python.
sv: Testar om ett objekt är ``False`` singleton, samma sak som ``x is False`` i Python.

source: Get the type of the Python object *o*.
sv: Hämta typen av Python-objekt *o*.

source: The returned reference is :term:`borrowed <borrowed reference>` from *o*. Do not release it with :c:func:`Py_DECREF` or similar.
sv: Den returnerade referensen är :term:`borrowed <borrowed reference>` från *o*. Frigör den inte med :c:func:`Py_DECREF` eller liknande.

source: :c:func:`Py_TYPE()` is changed to an inline static function. The parameter type is no longer :c:expr:`const PyObject*`.
sv: :c:func:`Py_TYPE()` ändras till en inline statisk funktion. Parametertypen är inte längre :c:expr:`const PyObject*`.

source: Return non-zero if the object *o* type is *type*. Return zero otherwise. Equivalent to: ``Py_TYPE(o) == type``.
sv: Returnerar icke-noll om objektets *o* typ är *type*. Returnerar noll annars. Likvärdig med: ``Py_TYPE(o) == typ``.

source: Set the type of object *o* to *type*, without any checking or reference counting.
sv: Sätt typen av objekt *o* till *typ*, utan kontroll eller referensräkning.

source: This is a very low-level operation. Consider instead setting the Python attribute :attr:`~object.__class__` using :c:func:`PyObject_SetAttrString` or similar.
sv: Detta är en operation på mycket låg nivå. Överväg istället att ställa in Python-attributet :attr:`~object.__class__` med hjälp av :c:func:`PyObject_SetAttrString` eller liknande.

source: Note that assigning an incompatible type can lead to undefined behavior.
sv: Observera att om du tilldelar en inkompatibel typ kan det leda till ett odefinierat beteende.

source: If *type* is a :ref:`heap type <heap-types>`, the caller must create a new reference to it. Similarly, if the old type of *o* is a heap type, the caller must release a reference to that type.
sv: Om *typ* är en :ref:`heap-typ <heap-types>`, måste anroparen skapa en ny referens till den. På samma sätt, om den gamla typen av *o* är en heap-typ, måste den som anropar frigöra en referens till den typen.

source: Get the :c:member:`~PyVarObject.ob_size` field of *o*.
sv: Hämta fältet :c:member:`~PyVarObject.ob_size` för *o*.

source: :c:func:`Py_SIZE()` is changed to an inline static function. The parameter type is no longer :c:expr:`const PyVarObject*`.
sv: :c:func:`Py_SIZE()` är ändrad till en inline statisk funktion. Parametertypen är inte längre :c:expr:`const PyVarObject*`.

source: Set the :c:member:`~PyVarObject.ob_size` field of *o* to *size*.
sv: Sätt fältet :c:member:`~PyVarObject.ob_size` i *o* till *size*.

source: This is a macro which expands to initialization values for a new :c:type:`PyObject` type. This macro expands to::
sv: Detta är ett makro som expanderar till initialiseringsvärden för en ny :c:type:`PyObject`-typ. Detta makro expanderar till::

source: _PyObject_EXTRA_INIT 1, type,
sv: _PyObjekt_EXTRA_INIT 1, typ,

source: This is a macro which expands to initialization values for a new :c:type:`PyVarObject` type, including the :c:member:`~PyVarObject.ob_size` field. This macro expands to::
sv: Detta är ett makro som expanderar till initialiseringsvärden för en ny :c:type:`PyVarObject`-typ, inklusive fältet :c:member:`~PyVarObject.ob_size`. Detta makro expanderar till::

source: _PyObject_EXTRA_INIT 1, type, size,
sv: _PyObjekt_EXTRA_INIT 1, typ, storlek,

source: Implementing functions and methods
sv: Implementering av funktioner och metoder

source: Type of the functions used to implement most Python callables in C. Functions of this type take two :c:expr:`PyObject*` parameters and return one such value. If the return value is ``NULL``, an exception shall have been set. If not ``NULL``, the return value is interpreted as the return value of the function as exposed in Python. The function must return a new reference.
sv: Typ av funktioner som används för att implementera de flesta Python-kallelser i C. Funktioner av denna typ tar två :c:expr:`PyObject*`-parametrar och returnerar ett sådant värde. Om returvärdet är ``NULL`` skall ett undantag ha ställts in. Om det inte är ``NULL`` tolkas returvärdet som returvärdet för funktionen som den exponeras i Python. Funktionen måste returnera en ny referens.

source: The function signature is::
sv: Funktionens signatur är::

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`. The function signature is::
sv: Typ av de funktioner som används för att implementera Python callables i C med signaturen :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`. Funktionssignaturen är::

source: Type of the functions used to implement Python callables in C with signature :c:macro:`METH_FASTCALL`. The function signature is::
sv: Typ av de funktioner som används för att implementera Python callables i C med signaturen :c:macro:`METH_FASTCALL`. Funktionens signatur är::

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>`. The function signature is::
sv: Typ av de funktioner som används för att implementera Python callables i C med signaturen :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>`. Funktionssignaturen är::

source: PyObject *PyCFunctionFastWithKeywords(PyObject *self, PyObject *const *args, Py_ssize_t nargs, PyObject *kwnames);
sv: PyObject *PyCFunctionFastWithKeywords(PyObject *self, PyObject *konst *args, Py_ssize_t nargs, PyObject *kwnamn);

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`. The function signature is::
sv: Typ av de funktioner som används för att implementera Python callables i C med signaturen :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`. Funktionssignaturen är::

source: PyObject *PyCMethod(PyObject *self, PyTypeObject *defining_class, PyObject *const *args, Py_ssize_t nargs, PyObject *kwnames)
sv: PyObject *PyCMethod(PyObject *self, PyTypeObject *definierande_klass, PyObject *konst *args, Py_ssize_t nargs, PyObject *kwnamn)

source: Structure used to describe a method of an extension type. This structure has four fields:
sv: Struktur som används för att beskriva en metod för en förlängningstyp. Denna struktur har fyra fält:

source: Name of the method.
sv: Namn på metoden.

source: Pointer to the C implementation.
sv: Pekare till C-implementeringen.

source: Flags bits indicating how the call should be constructed.
sv: Flaggbitar som anger hur anropet ska konstrueras.

source: Points to the contents of the docstring.
sv: Pekar på innehållet i dokumentsträngen.

source: The :c:member:`~PyMethodDef.ml_meth` is a C function pointer. The functions may be of different types, but they always return :c:expr:`PyObject*`. If the function is not of the :c:type:`PyCFunction`, the compiler will require a cast in the method table. Even though :c:type:`PyCFunction` defines the first parameter as :c:expr:`PyObject*`, it is common that the method implementation uses the specific C type of the *self* object.
sv: :c:member:`~PyMethodDef.ml_meth` är en C-funktionspekare. Funktionerna kan vara av olika typer, men de returnerar alltid :c:expr:`PyObject*`. Om funktionen inte är av typen :c:type:`PyCFunction`, kommer kompilatorn att kräva en cast i metodtabellen. Även om :c:type:`PyCFunction` definierar den första parametern som :c:expr:`PyObject*`, är det vanligt att metodimplementeringen använder den specifika C-typen för *self*-objektet.

source: The :c:member:`~PyMethodDef.ml_flags` field is a bitfield which can include the following flags. The individual flags indicate either a calling convention or a binding convention.
sv: Fältet :c:member:`~PyMethodDef.ml_flags` är ett bitfält som kan innehålla följande flaggor. De enskilda flaggorna anger antingen en anropskonvention eller en bindningskonvention.

source: There are these calling conventions:
sv: Det finns dessa samtalskonventioner:

source: This is the typical calling convention, where the methods have the type :c:type:`PyCFunction`. The function expects two :c:expr:`PyObject*` values. The first one is the *self* object for methods; for module functions, it is the module object. The second parameter (often called *args*) is a tuple object representing all arguments. This parameter is typically processed using :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_UnpackTuple`.
sv: Detta är den typiska anropskonventionen, där metoderna har typen :c:type:`PyCFunction`. Funktionen förväntar sig två :c:expr:`PyObject*`-värden. Det första är *self*-objektet för metoder; för modulfunktioner är det modulobjektet. Den andra parametern (ofta kallad *args*) är ett tuple-objekt som representerar alla argument. Den här parametern bearbetas vanligtvis med :c:func:`PyArg_ParseTuple` eller :c:func:`PyArg_UnpackTuple`.

source: Can only be used in certain combinations with other flags: :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`, :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` and :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
sv: Kan endast användas i vissa kombinationer med andra flaggor: :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`, :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` och :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.

source: Methods with these flags must be of type :c:type:`PyCFunctionWithKeywords`. The function expects three parameters: *self*, *args*, *kwargs* where *kwargs* is a dictionary of all the keyword arguments or possibly ``NULL`` if there are no keyword arguments. The parameters are typically processed using :c:func:`PyArg_ParseTupleAndKeywords`.
sv: Metoder med dessa flaggor måste vara av typen :c:type:`PyCFunctionWithKeywords`. Funktionen förväntar sig tre parametrar: *self*, *args*, *kwargs* där *kwargs* är en dictionary med alla nyckelordsargument eller eventuellt ``NULL`` om det inte finns några nyckelordsargument. Parametrarna bearbetas vanligtvis med :c:func:`PyArg_ParseTupleAndKeywords`.

source: Fast calling convention supporting only positional arguments. The methods have the type :c:type:`PyCFunctionFast`. The first parameter is *self*, the second parameter is a C array of :c:expr:`PyObject*` values indicating the arguments and the third parameter is the number of arguments (the length of the array).
sv: Snabb anropskonvention som endast stöder positionella argument. Metoderna har typen :c:type:`PyCFunctionFast`. Den första parametern är *self*, den andra parametern är en C-array av :c:expr:`PyObject*`-värden som anger argumenten och den tredje parametern är antalet argument (längden på arrayen).

source: ``METH_FASTCALL`` is now part of the :ref:`stable ABI <stable-abi>`.
sv: ``METH_FASTCALL`` är nu en del av :ref:`stable ABI <stable-abi>`.

source: Extension of :c:macro:`METH_FASTCALL` supporting also keyword arguments, with methods of type :c:type:`PyCFunctionFastWithKeywords`. Keyword arguments are passed the same way as in the :ref:`vectorcall protocol <vectorcall>`: there is an additional fourth :c:expr:`PyObject*` parameter which is a tuple representing the names of the keyword arguments (which are guaranteed to be strings) or possibly ``NULL`` if there are no keywords. The values of the keyword arguments are stored in the *args* array, after the positional arguments.
sv: Utökning av :c:macro:`METH_FASTCALL` som även stöder nyckelordsargument, med metoder av typen :c:type:`PyCFunctionFastWithKeywords`. Nyckelordsargument skickas på samma sätt som i :ref:`vectorcall-protokollet <vectorcall>`: det finns en ytterligare fjärde :c:expr:`PyObject*`-parameter som är en tupel som representerar namnen på nyckelordsargumenten (som garanterat är strängar) eller eventuellt ``NULL`` om det inte finns några nyckelord. Värdena på nyckelordsargumenten lagras i *args*-arrayen, efter de positionella argumenten.

source: Can only be used in the combination with other flags: :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
sv: Kan endast användas i kombination med andra flaggor: :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.

source: Extension of :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` supporting the *defining class*, that is, the class that contains the method in question. The defining class might be a superclass of ``Py_TYPE(self)``.
sv: Utökning av :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` som stöder den *definierande klassen*, det vill säga den klass som innehåller metoden i fråga. Den definierande klassen kan vara en superklass av ``Py_TYPE(self)``.

source: The method needs to be of type :c:type:`PyCMethod`, the same as for ``METH_FASTCALL | METH_KEYWORDS`` with ``defining_class`` argument added after ``self``.
sv: Metoden måste vara av typen :c:type:`PyCMethod`, på samma sätt som för ``METH_FASTCALL | METH_KEYWORDS`` med ``defining_class`` argumentet tillagt efter ``self``.

source: Methods without parameters don't need to check whether arguments are given if they are listed with the :c:macro:`METH_NOARGS` flag. They need to be of type :c:type:`PyCFunction`. The first parameter is typically named *self* and will hold a reference to the module or object instance. In all cases the second parameter will be ``NULL``.
sv: Metoder utan parametrar behöver inte kontrollera om argument ges om de listas med flaggan :c:macro:`METH_NOARGS`. De måste vara av typen :c:type:`PyCFunction`. Den första parametern har vanligtvis namnet *self* och innehåller en referens till modulen eller objektinstansen. I samtliga fall kommer den andra parametern att vara ``NULL``.

source: The function must have 2 parameters. Since the second parameter is unused, :c:macro:`Py_UNUSED` can be used to prevent a compiler warning.
sv: Funktionen måste ha 2 parametrar. Eftersom den andra parametern är oanvänd kan :c:macro:`Py_UNUSED` användas för att förhindra en kompilatorvarning.

source: Methods with a single object argument can be listed with the :c:macro:`METH_O` flag, instead of invoking :c:func:`PyArg_ParseTuple` with a ``"O"`` argument. They have the type :c:type:`PyCFunction`, with the *self* parameter, and a :c:expr:`PyObject*` parameter representing the single argument.
sv: Metoder med ett enda objektargument kan listas med flaggan :c:macro:`METH_O`, istället för att anropa :c:func:`PyArg_ParseTuple` med ett ``"O"``-argument. De är av typen :c:type:`PyCFunction`, med parametern *self* och en parameter av typen :c:expr:`PyObject*` som representerar det enda argumentet.

source: These two constants are not used to indicate the calling convention but the binding when use with methods of classes. These may not be used for functions defined for modules. At most one of these flags may be set for any given method.
sv: Dessa två konstanter används inte för att ange anropskonventionen utan bindningen när de används med metoder för klasser. De får inte användas för funktioner som definieras för moduler. Högst en av dessa flaggor får vara inställd för en viss metod.

source: The method will be passed the type object as the first parameter rather than an instance of the type. This is used to create *class methods*, similar to what is created when using the :func:`classmethod` built-in function.
sv: Metoden kommer att få typobjektet som första parameter i stället för en instans av typen. Detta används för att skapa *klassmetoder*, liknande det som skapas när man använder den inbyggda funktionen :func:`classmethod`.

source: The method will be passed ``NULL`` as the first parameter rather than an instance of the type. This is used to create *static methods*, similar to what is created when using the :func:`staticmethod` built-in function.
sv: Metoden får ``NULL`` som första parameter i stället för en instans av typen. Detta används för att skapa *statiska metoder*, liknande det som skapas när man använder den inbyggda funktionen :func:`staticmethod`.

source: One other constant controls whether a method is loaded in place of another definition with the same method name.
sv: En annan konstant styr om en metod ska laddas i stället för en annan definition med samma metodnamn.
