Repository: yeager/python-docs-sv
Catalog: c-api/sys.po
Languages: sv

source: If the interpreter is initialized, this function raises an auditing event ``sys.addaudithook`` with no arguments. If any existing hooks raise an exception derived from :class:`Exception`, the new hook will not be added and the exception is cleared. As a result, callers cannot assume that their hook has been added unless they control all existing hooks.
sv: Om tolken initieras, skapar den här funktionen en granskningshändelse ``sys.addaudithook`` utan argument. Om någon befintlig krok ger upphov till ett undantag som härrör från :class:`Exception`, kommer den nya kroken inte att läggas till och undantaget rensas. Följaktligen kan anropare inte anta att deras krok har lagts till om de inte kontrollerar alla befintliga krokar.

source: The type of the hook function. *event* is the C string event argument passed to :c:func:`PySys_Audit` or :c:func:`PySys_AuditTuple`. *args* is guaranteed to be a :c:type:`PyTupleObject`. *userData* is the argument passed to PySys_AddAuditHook().
sv: Typ av krokfunktion. *event* är C-strängens händelseargument som skickas till :c:func:`PySys_Audit` eller :c:func:`PySys_AuditTuple`. *args* är garanterat ett :c:type:`PyTupleObject`. *userData* är argumentet som skickas till PySys_AddAuditHook().

source: Process Control
sv: Processtyrning

source: Print a fatal error message and kill the process. No cleanup is performed. This function should only be invoked when a condition is detected that would make it dangerous to continue using the Python interpreter; e.g., when the object administration appears to be corrupted. On Unix, the standard C library function :c:func:`!abort` is called which will attempt to produce a :file:`core` file.
sv: Skriv ut ett fatalt felmeddelande och avsluta processen. Ingen upprensning utförs. Denna funktion bör endast anropas när ett tillstånd upptäcks som skulle göra det farligt att fortsätta använda Python-tolken, t.ex. när objektadministrationen verkar vara skadad. På Unix anropas standard C-biblioteksfunktionen :c:func:`!abort` som kommer att försöka producera en :file:`core`-fil.

source: The ``Py_FatalError()`` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined.
sv: Funktionen ``Py_FatalError()`` ersätts med ett makro som automatiskt loggar namnet på den aktuella funktionen, såvida inte makrot ``Py_LIMITED_API`` är definierat.

source: Log the function name automatically.
sv: Loggar funktionsnamnet automatiskt.

source: Exit the current process. This calls :c:func:`Py_FinalizeEx` and then calls the standard C library function ``exit(status)``. If :c:func:`Py_FinalizeEx` indicates an error, the exit status is set to 120.
sv: Avsluta den aktuella processen. Detta anropar :c:func:`Py_FinalizeEx` och anropar sedan standard C-biblioteksfunktionen ``exit(status)``. Om :c:func:`Py_FinalizeEx` indikerar ett fel, sätts utgångsstatusen till 120.

source: Errors from finalization no longer ignored.
sv: Fel från slutförande ignoreras inte längre.

source: Register a cleanup function to be called by :c:func:`Py_FinalizeEx`. The cleanup function will be called with no arguments and should return no value. At most 32 cleanup functions can be registered. When the registration is successful, :c:func:`Py_AtExit` returns ``0``; on failure, it returns ``-1``. The cleanup function registered last is called first. Each cleanup function will be called at most once. Since Python's internal finalization will have completed before the cleanup function, no Python APIs should be called by *func*.
sv: Registrera en rensningsfunktion som ska anropas av :c:func:`Py_FinalizeEx`. Rensningsfunktionen kommer att anropas utan argument och bör inte returnera något värde. Högst 32 rensningsfunktioner kan registreras. När registreringen lyckas returnerar :c:func:`Py_AtExit` ``0``; om den misslyckas returnerar den ``-1``. Den rensningsfunktion som registrerades sist anropas först. Varje rensningsfunktion kommer att anropas högst en gång. Eftersom Pythons interna avslutning kommer att ha slutförts före rensningsfunktionen, bör inga Python API:er anropas av *func*.

source: :c:func:`PyUnstable_AtExit` for passing a ``void *data`` argument.
sv: :c:func:`PyUnstable_AtExit` för att skicka ett ``void *data`` argument.

source: USE_STACKCHECK (C macro)
sv: USE_STACKCHECK (C-makro)

source: abort (C function)
sv: abort (C-funktion)

source: Py_FinalizeEx (C function)
sv: Py_FinalizeEx (C-funktion)

source: exit (C function)
sv: exit (C-funktion)

source: cleanup functions
sv: uppstädningsfunktioner
