Repository: yeager/python-docs-sv
Catalog: c-api/sys.po
Languages: sv

source: Operating System Utilities
sv: Verktyg för operativsystem

source: Return the file system representation for *path*. If the object is a :class:`str` or :class:`bytes` object, then a new :term:`strong reference` is returned. If the object implements the :class:`os.PathLike` interface, then :meth:`~os.PathLike.__fspath__` is returned as long as it is a :class:`str` or :class:`bytes` object. Otherwise :exc:`TypeError` is raised and ``NULL`` is returned.
sv: Returnerar filsystemets representation för *path*. Om objektet är ett :class:`str`- eller :class:`bytes`-objekt returneras en ny :term:`strong reference`. Om objektet implementerar gränssnittet :class:`os.PathLike`, returneras :meth:`~os.PathLike.__fspath__` så länge det är ett :class:`str` eller :class:`bytes` objekt. Annars genereras :exc:`TypeError` och ``NULL`` returneras.

source: Return true (nonzero) if the standard I/O file *fp* with name *filename* is deemed interactive. This is the case for files for which ``isatty(fileno(fp))`` is true. If the :c:member:`PyConfig.interactive` is non-zero, this function also returns true if the *filename* pointer is ``NULL`` or if the name is equal to one of the strings ``'<stdin>'`` or ``'???'``.
sv: Returnerar true (icke-noll) om standard I/O-filen *fp* med namnet *filnamn* anses vara interaktiv. Detta är fallet för filer för vilka ``isatty(fileno(fp))`` är true. Om :c:member:`PyConfig.interactive` är icke-noll, returnerar denna funktion också true om pekaren *filnamn* är ``NULL`` eller om namnet är lika med en av strängarna ``'<stdin>'`` eller ``'???'``.

source: This function must not be called before Python is initialized.
sv: Denna funktion får inte anropas innan Python har initialiserats.

source: Function to prepare some internal state before a process fork. This should be called before calling :c:func:`fork` or any similar function that clones the current process. Only available on systems where :c:func:`fork` is defined.
sv: Funktion för att förbereda ett internt tillstånd före en processgaffel. Denna funktion bör anropas innan :c:func:`fork` eller någon liknande funktion som klonar den aktuella processen anropas. Endast tillgänglig på system där :c:func:`fork` är definierad.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_BeforeFork()``.
sv: C :c:func:`fork`-anropet bör endast göras från :ref:`"main"-tråden <fork-and-threads>` (av :ref:`"main"-tolken <sub-interpreter-support>`). Detsamma gäller för ``PyOS_BeforeFork()``.

source: Function to update some internal state after a process fork. This should be called from the parent process after calling :c:func:`fork` or any similar function that clones the current process, regardless of whether process cloning was successful. Only available on systems where :c:func:`fork` is defined.
sv: Funktion för att uppdatera något internt tillstånd efter en processgaffel. Denna funktion bör anropas från den överordnade processen efter anrop av :c:func:`fork` eller någon liknande funktion som klonar den aktuella processen, oavsett om processkloningen lyckades eller inte. Endast tillgängligt på system där :c:func:`fork` är definierad.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Parent()``.
sv: C :c:func:`fork`-anropet bör endast göras från :ref:`"main"-tråden <fork-and-threads>` (av :ref:`"main"-tolken <sub-interpreter-support>`). Detsamma gäller för ``PyOS_AfterFork_Parent()``.

source: Function to update internal interpreter state after a process fork. This must be called from the child process after calling :c:func:`fork`, or any similar function that clones the current process, if there is any chance the process will call back into the Python interpreter. Only available on systems where :c:func:`fork` is defined.
sv: Funktion för att uppdatera tolkens interna tillstånd efter en processförgrening. Denna funktion måste anropas från barnprocessen efter anrop av :c:func:`fork`, eller någon liknande funktion som klonar den aktuella processen, om det finns någon risk att processen kommer att anropa Python-tolken igen. Endast tillgängligt på system där :c:func:`fork` är definierad.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Child()``.
sv: C :c:func:`fork`-anropet bör endast göras från :ref:`"main"-tråden <fork-and-threads>` (av :ref:`"main"-tolken <sub-interpreter-support>`). Detsamma gäller för ``PyOS_AfterFork_Child()``.

source: :func:`os.register_at_fork` allows registering custom Python functions to be called by :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
sv: :func:`os.register_at_fork` tillåter registrering av anpassade Python-funktioner som ska anropas av :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` och :c:func:`PyOS_AfterFork_Child`.

source: Function to update some internal state after a process fork; this should be called in the new process if the Python interpreter will continue to be used. If a new executable is loaded into the new process, this function does not need to be called.
sv: Funktion för att uppdatera vissa interna tillstånd efter en processgaffel; denna bör anropas i den nya processen om Python-tolken kommer att fortsätta att användas. Om en ny körbar fil laddas in i den nya processen behöver denna funktion inte anropas.

source: This function is superseded by :c:func:`PyOS_AfterFork_Child()`.
sv: Denna funktion ersätts av :c:func:`PyOS_AfterFork_Child()`.

source: Return true when the interpreter runs out of stack space. This is a reliable check, but is only available when :c:macro:`!USE_STACKCHECK` is defined (currently on certain versions of Windows using the Microsoft Visual C++ compiler). :c:macro:`!USE_STACKCHECK` will be defined automatically; you should never change the definition in your own code.
sv: Returnerar true när tolken har slut på stackutrymme. Detta är en tillförlitlig kontroll, men är endast tillgänglig när :c:macro:`!USE_STACKCHECK` är definierad (för närvarande på vissa versioner av Windows som använder Microsoft Visual C++-kompilatorn). :c:macro:`!USE_STACKCHECK` definieras automatiskt; du bör aldrig ändra definitionen i din egen kod.

source: Return the current signal handler for signal *i*. This is a thin wrapper around either :c:func:`!sigaction` or :c:func:`!signal`. Do not call those functions directly!
sv: Returnerar den aktuella signalhanteraren för signal *i*. Detta är ett tunt omslag runt antingen :c:func:`!sigaction` eller :c:func:`!signal`. Anropa inte dessa funktioner direkt!

source: Set the signal handler for signal *i* to be *h*; return the old signal handler. This is a thin wrapper around either :c:func:`!sigaction` or :c:func:`!signal`. Do not call those functions directly!
sv: Ställ in signalhanteraren för signal *i* till att vara *h*; returnera den gamla signalhanteraren. Detta är ett tunt omslag runt antingen :c:func:`!sigaction` eller :c:func:`!signal`. Anropa inte dessa funktioner direkt!

source: This function should not be called directly: use the :c:type:`PyConfig` API with the :c:func:`PyConfig_SetBytesString` function which ensures that :ref:`Python is preinitialized <c-preinit>`.
sv: Denna funktion bör inte anropas direkt: använd :c:type:`PyConfig` API med :c:func:`PyConfig_SetBytesString` funktionen som säkerställer att :ref:`Python är förinitialiserat <c-preinit>`.

source: This function must not be called before :ref:`Python is preinitialized <c-preinit>` and so that the LC_CTYPE locale is properly configured: see the :c:func:`Py_PreInitialize` function.
sv: Denna funktion får inte anropas innan :ref:`Python är förinitialiserat <c-preinit>` och så att LC_CTYPE locale är korrekt konfigurerad: se :c:func:`Py_PreInitialize` funktionen.

source: Decode a byte string from the :term:`filesystem encoding and error handler`. If the error handler is :ref:`surrogateescape error handler <surrogateescape>`, undecodable bytes are decoded as characters in range U+DC80..U+DCFF; and if a byte sequence can be decoded as a surrogate character, the bytes are escaped using the surrogateescape error handler instead of decoding them.
sv: Avkodar en byte-sträng från :term:`filsystemkodning och felhanterare`. Om felhanteraren är :ref:`surrogateescape error handler <surrogateescape>`, avkodas oavkodbara byte som tecken i intervallet U+DC80..U+DCFF; och om en byte-sekvens kan avkodas som ett surrogattecken, escapas byte-sekvensen med hjälp av felhanteraren surrogateescape istället för att avkodas.

source: Return a pointer to a newly allocated wide character string, use :c:func:`PyMem_RawFree` to free the memory. If size is not ``NULL``, write the number of wide characters excluding the null character into ``*size``
sv: Returnerar en pekare till en nyligen allokerad bred teckensträng, använd :c:func:`PyMem_RawFree` för att frigöra minnet. Om size inte är ``NULL``, skriv antalet breda tecken exklusive nulltecknet till ``*size``

source: Return ``NULL`` on decoding error or memory allocation error. If *size* is not ``NULL``, ``*size`` is set to ``(size_t)-1`` on memory error or set to ``(size_t)-2`` on decoding error.
sv: Returnerar ``NULL`` vid avkodningsfel eller minnesallokeringsfel. Om *size* inte är ``NULL``, sätts ``*size`` till ``(size_t)-1`` vid minnesfel eller sätts till ``(size_t)-2`` vid avkodningsfel.

source: The :term:`filesystem encoding and error handler` are selected by :c:func:`PyConfig_Read`: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
sv: Termen :`filsystem encoding and error handler` väljs av :c:func:`PyConfig_Read`: se :c:member:`~PyConfig.filesystem_encoding` och :c:member:`~PyConfig.filesystem_errors` medlemmar av :c:type:`PyConfig`.

source: Decoding errors should never happen, unless there is a bug in the C library.
sv: Avkodningsfel ska aldrig inträffa, såvida det inte finns en bugg i C-biblioteket.

source: Use the :c:func:`Py_EncodeLocale` function to encode the character string back to a byte string.
sv: Använd funktionen :c:func:`Py_EncodeLocale` för att koda tillbaka teckensträngen till en byte-sträng.

source: The :c:func:`PyUnicode_DecodeFSDefaultAndSize` and :c:func:`PyUnicode_DecodeLocaleAndSize` functions.
sv: Funktionerna :c:func:`PyUnicode_DecodeFSDefaultAndSize` och :c:func:`PyUnicode_DecodeLocaleAndSize`.

source: The function now uses the UTF-8 encoding in the :ref:`Python UTF-8 Mode <utf8-mode>`.
sv: Funktionen använder nu UTF-8-kodningen i :ref:`Python UTF-8 Mode <utf8-mode>`.

source: The function now uses the UTF-8 encoding on Windows if :c:member:`PyPreConfig.legacy_windows_fs_encoding` is zero;
sv: Funktionen använder nu UTF-8-kodning i Windows om :c:member:`PyPreConfig.legacy_windows_fs_encoding` är noll;

source: Encode a wide character string to the :term:`filesystem encoding and error handler`. If the error handler is :ref:`surrogateescape error handler <surrogateescape>`, surrogate characters in the range U+DC80..U+DCFF are converted to bytes 0x80..0xFF.
sv: Kodar en bred teckensträng till :term:`filsystemkodning och felhanterare`. Om felhanteraren är :ref:`surrogateescape error handler <surrogateescape>`, konverteras surrogattecken i intervallet U+DC80..U+DCFF till byte 0x80..0xFF.

source: Return a pointer to a newly allocated byte string, use :c:func:`PyMem_Free` to free the memory. Return ``NULL`` on encoding error or memory allocation error.
sv: Returnerar en pekare till en nyligen allokerad byte-sträng, använd :c:func:`PyMem_Free` för att frigöra minnet. Returnerar ``NULL`` vid felkodning eller fel i minnesallokering.

source: If error_pos is not ``NULL``, ``*error_pos`` is set to ``(size_t)-1`` on success, or set to the index of the invalid character on encoding error.
sv: Om error_pos inte är ``NULL``, sätts ``*error_pos`` till ``(size_t)-1`` vid framgång, eller till indexet för det ogiltiga tecknet vid kodningsfel.

source: Use the :c:func:`Py_DecodeLocale` function to decode the bytes string back to a wide character string.
sv: Använd funktionen :c:func:`Py_DecodeLocale` för att avkoda bytessträngen tillbaka till en bred teckensträng.

source: The :c:func:`PyUnicode_EncodeFSDefault` and :c:func:`PyUnicode_EncodeLocale` functions.
sv: Funktionerna :c:func:`PyUnicode_EncodeFSDefault` och :c:func:`PyUnicode_EncodeLocale`.

source: The function now uses the UTF-8 encoding on Windows if :c:member:`PyPreConfig.legacy_windows_fs_encoding` is zero.
sv: Funktionen använder nu UTF-8-kodning i Windows om :c:member:`PyPreConfig.legacy_windows_fs_encoding` är noll.

source: Similar to :c:func:`!fopen`, but *path* is a Python object and an exception is set on error.
sv: Liknar :c:func:`!fopen`, men *path* är ett Python-objekt och ett undantag sätts vid fel.

source: *path* must be a :class:`str` object, a :class:`bytes` object, or a :term:`path-like object`.
sv: *path* måste vara ett :class:`str`-objekt, ett :class:`bytes`-objekt eller ett :term:`path-like object`.

source: On success, return the new file pointer. On error, set an exception and return ``NULL``.
sv: Vid framgång returneras den nya filpekaren. Vid fel, sätt ett undantag och returnera ``NULL``.

source: The file must be closed by :c:func:`Py_fclose` rather than calling directly :c:func:`!fclose`.
sv: Filen måste stängas med :c:func:`Py_fclose` istället för att direkt anropa :c:func:`!fclose`.

source: The file descriptor is created non-inheritable (:pep:`446`).
sv: Filbeskrivaren skapas icke-ärftlig (:pep:`446`).

source: The caller must have an :term:`attached thread state`.
sv: Den som anropar måste ha en :term:`attached thread state`.

source: Close a file that was opened by :c:func:`Py_fopen`.
sv: Stäng en fil som öppnades av :c:func:`Py_fopen`.

source: On success, return ``0``. On error, return ``EOF`` and ``errno`` is set to indicate the error. In either case, any further access (including another call to :c:func:`Py_fclose`) to the stream results in undefined behavior.
sv: Vid framgång returneras ``0``. Vid fel returneras ``EOF`` och ``errno`` sätts för att indikera felet. I båda fallen resulterar all ytterligare åtkomst (inklusive ett annat anrop till :c:func:`Py_fclose`) till strömmen i ett odefinierat beteende.

source: System Functions
sv: Systemfunktioner

source: These are utility functions that make functionality from the :mod:`sys` module accessible to C code. They all work with the current interpreter thread's :mod:`sys` module's dict, which is contained in the internal thread state structure.
sv: Dessa är verktygsfunktioner som gör funktionalitet från :mod:`sys`-modulen tillgänglig för C-kod. De arbetar alla med den aktuella tolktrådens :mod:`sys`-modulens dict, som finns i den interna trådtillståndsstrukturen.

source: Return the object *name* from the :mod:`sys` module or ``NULL`` if it does not exist, without setting an exception.
sv: Returnerar objektet *namn* från modulen :mod:`sys` eller ``NULL`` om det inte finns, utan att ange ett undantag.

source: Set *name* in the :mod:`sys` module to *v* unless *v* is ``NULL``, in which case *name* is deleted from the sys module. Returns ``0`` on success, ``-1`` on error.
sv: Sätter *namn* i modulen :mod:`sys` till *v* såvida inte *v* är ``NULL``, i vilket fall *namn* tas bort från sys-modulen. Returnerar ``0`` vid framgång, ``-1`` vid fel.

source: Reset :data:`sys.warnoptions` to an empty list. This function may be called prior to :c:func:`Py_Initialize`.
sv: Återställer :data:`sys.warnoptions` till en tom lista. Denna funktion kan anropas före :c:func:`Py_Initialize`.

source: Clear :data:`sys.warnoptions` and :data:`!warnings.filters` instead.
sv: Rensa :data:`sys.warnoptions` och :data:`!warnings.filters` istället.

source: Write the output string described by *format* to :data:`sys.stdout`. No exceptions are raised, even if truncation occurs (see below).
sv: Skriv ut utdatasträngen som beskrivs av *format* till :data:`sys.stdout`. Inga undantag görs, även om trunkering sker (se nedan).

source: *format* should limit the total size of the formatted output string to 1000 bytes or less -- after 1000 bytes, the output string is truncated. In particular, this means that no unrestricted "%s" formats should occur; these should be limited using "%.<N>s" where <N> is a decimal number calculated so that <N> plus the maximum size of other formatted text does not exceed 1000 bytes. Also watch out for "%f", which can print hundreds of digits for very large numbers.
sv: *format* bör begränsa den totala storleken på den formaterade utdatasträngen till 1000 byte eller mindre - efter 1000 byte trunkeras utdatasträngen. Detta innebär i synnerhet att inga obegränsade "%s" format får förekomma; dessa bör begränsas med hjälp av "%.<N>s" där <N> är ett decimaltal som beräknas så att <N> plus den maximala storleken på annan formaterad text inte överstiger 1000 byte. Se också upp för "%f", som kan skriva ut hundratals siffror för mycket stora tal.

source: If a problem occurs, or :data:`sys.stdout` is unset, the formatted message is written to the real (C level) *stdout*.
sv: Om ett problem uppstår, eller om :data:`sys.stdout` inte är inställd, skrivs det formaterade meddelandet till den riktiga (C-nivå) *stdout*.

source: As :c:func:`PySys_WriteStdout`, but write to :data:`sys.stderr` or *stderr* instead.
sv: Som :c:func:`PySys_WriteStdout`, men skriv till :data:`sys.stderr` eller *stderr* istället.

source: Function similar to PySys_WriteStdout() but format the message using :c:func:`PyUnicode_FromFormatV` and don't truncate the message to an arbitrary length.
sv: Funktion som liknar PySys_WriteStdout() men formaterar meddelandet med :c:func:`PyUnicode_FromFormatV` och trunkerar inte meddelandet till godtycklig längd.

source: As :c:func:`PySys_FormatStdout`, but write to :data:`sys.stderr` or *stderr* instead.
sv: Som :c:func:`PySys_FormatStdout`, men skriv till :data:`sys.stderr` eller *stderr* istället.

source: Return the current dictionary of :option:`-X` options, similarly to :data:`sys._xoptions`. On error, ``NULL`` is returned and an exception is set.
sv: Returnerar den aktuella ordlistan med :option:`-X`-alternativ, på samma sätt som :data:`sys._xoptions`. Vid fel returneras ``NULL`` och ett undantag anges.

source: Raise an auditing event with any active hooks. Return zero for success and non-zero with an exception set on failure.
sv: Starta en granskningshändelse med alla aktiva krokar. Returnerar noll vid framgång och icke-noll med en undantagsuppsättning vid misslyckande.

source: The *event* string argument must not be *NULL*.
sv: Strängargumentet *event* får inte vara *NULL*.

source: If any hooks have been added, *format* and other arguments will be used to construct a tuple to pass. Apart from ``N``, the same format characters as used in :c:func:`Py_BuildValue` are available. If the built value is not a tuple, it will be added into a single-element tuple.
sv: Om några krokar har lagts till kommer *format* och andra argument att användas för att konstruera en tupel att skicka. Förutom ``N`` finns samma formattecken tillgängliga som används i :c:func:`Py_BuildValue`. Om det byggda värdet inte är en tupel, kommer det att läggas till i en tupel med ett element.

source: The ``N`` format option must not be used. It consumes a reference, but since there is no way to know whether arguments to this function will be consumed, using it may cause reference leaks.
sv: Formatalternativet ``N`` får inte användas. Det förbrukar en referens, men eftersom det inte finns något sätt att veta om argument till den här funktionen kommer att förbrukas, kan det orsaka referensläckage om det används.

source: Note that ``#`` format characters should always be treated as :c:type:`Py_ssize_t`, regardless of whether ``PY_SSIZE_T_CLEAN`` was defined.
sv: Observera att formattecknen ``#`` alltid skall behandlas som :c:type:`Py_ssize_t`, oavsett om ``PY_SSIZE_T_CLEAN`` definierats.

source: :func:`sys.audit` performs the same function from Python code.
sv: :func:`sys.audit` utför samma funktion från Python-kod.

source: See also :c:func:`PySys_AuditTuple`.
sv: Se även :c:func:`PySys_AuditTuple`.

source: Require :c:type:`Py_ssize_t` for ``#`` format characters. Previously, an unavoidable deprecation warning was raised.
sv: Kräver :c:type:`Py_ssize_t` för ``#`` formattecken. Tidigare gavs en oundviklig deprecation-varning.

source: Similar to :c:func:`PySys_Audit`, but pass arguments as a Python object. *args* must be a :class:`tuple`. To pass no arguments, *args* can be *NULL*.
sv: Liknar :c:func:`PySys_Audit`, men skickar argument som ett Python-objekt. *args* måste vara en :class:`tuple`. För att inte skicka några argument kan *args* vara *NULL*.

source: Append the callable *hook* to the list of active auditing hooks. Return zero on success and non-zero on failure. If the runtime has been initialized, also set an error on failure. Hooks added through this API are called for all interpreters created by the runtime.
sv: Lägger till den anropsbara *hook* till listan över aktiva revisionskrokar. Returnerar noll vid framgång och icke-noll vid misslyckande. Om körtiden har initialiserats, ange även ett fel vid misslyckande. Krokar som läggs till via detta API anropas för alla tolkar som skapas av körtiden.

source: The *userData* pointer is passed into the hook function. Since hook functions may be called from different runtimes, this pointer should not refer directly to Python state.
sv: Pekaren *userData* skickas till hook-funktionen. Eftersom hook-funktioner kan anropas från olika runtimes bör denna pekare inte referera direkt till Python-tillstånd.

source: This function is safe to call before :c:func:`Py_Initialize`. When called after runtime initialization, existing audit hooks are notified and may silently abort the operation by raising an error subclassed from :class:`Exception` (other errors will not be silenced).
sv: Denna funktion är säker att anropa före :c:func:`Py_Initialize`. När den anropas efter initialisering under körtid, meddelas befintliga revisionskrokar och kan tyst avbryta operationen genom att skapa ett fel som är underklassat från :class:`Exception` (andra fel tystas inte).

source: The hook function is always called with an :term:`attached thread state` by the Python interpreter that raised the event.
sv: Hook-funktionen anropas alltid med en :term:`attached thread state` av den Python-tolk som utlöste händelsen.

source: See :pep:`578` for a detailed description of auditing. Functions in the runtime and standard library that raise events are listed in the :ref:`audit events table <audit-events>`. Details are in each function's documentation.
sv: Se :pep:`578` för en detaljerad beskrivning av auditering. Funktioner i runtime och standardbiblioteket som skapar händelser listas i :ref:``audit events table <audit-events>``. Detaljer finns i dokumentationen för varje funktion.
