Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: The value ``-1`` should not be returned as a normal return value; when an error occurs during the computation of the hash value, the function should set an exception and return ``-1``.
sv: Värdet ``-1`` ska inte returneras som ett normalt returvärde; när ett fel inträffar under beräkningen av hashvärdet ska funktionen sätta ett undantag och returnera ``-1``.

source: When this field is not set (*and* :c:member:`~PyTypeObject.tp_richcompare` is not set), an attempt to take the hash of the object raises :exc:`TypeError`. This is the same as setting it to :c:func:`PyObject_HashNotImplemented`.
sv: När detta fält inte är inställt (*och* :c:member:`~PyTypeObject.tp_richcompare` inte är inställt), kommer ett försök att ta objektets hash att ge upphov till :exc:`TypeError`. Detta är samma sak som att sätta den till :c:func:`PyObject_HashNotImplemented`.

source: This field can be set explicitly to :c:func:`PyObject_HashNotImplemented` to block inheritance of the hash method from a parent type. This is interpreted as the equivalent of ``__hash__ = None`` at the Python level, causing ``isinstance(o, collections.Hashable)`` to correctly return ``False``. Note that the converse is also true - setting ``__hash__ = None`` on a class at the Python level will result in the ``tp_hash`` slot being set to :c:func:`PyObject_HashNotImplemented`.
sv: Detta fält kan explicit sättas till :c:func:`PyObject_HashNotImplemented` för att blockera arv av hash-metoden från en överordnad typ. Detta tolkas som motsvarigheten till ``__hash__ = None`` på Python-nivå, vilket gör att ``isinstance(o, collections.Hashable)`` korrekt returnerar ``False``. Observera att det omvända också är sant - att sätta ``__hash__ = None`` på en klass på Python-nivå kommer att resultera i att ``tp_hash`` slot sätts till :c:func:`PyObject_HashNotImplemented`.

source: Group: :c:member:`~PyTypeObject.tp_hash`, :c:member:`~PyTypeObject.tp_richcompare`
sv: Grupp: :c:member:`~PyTypeObject.tp_hash`, :c:member:`~PyTypeObject.tp_richcompare`

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_richcompare`: a subtype inherits both of :c:member:`~PyTypeObject.tp_richcompare` and :c:member:`~PyTypeObject.tp_hash`, when the subtype's :c:member:`~PyTypeObject.tp_richcompare` and :c:member:`~PyTypeObject.tp_hash` are both ``NULL``.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_richcompare`: en subtyp ärver både :c:member:`~PyTypeObject.tp_richcompare` och :c:member:`~PyTypeObject.tp_hash`, när subtypens :c:member:`~PyTypeObject.tp_richcompare` och :c:member:`~PyTypeObject.tp_hash` båda är ``NULL``.

source: :c:data:`PyBaseObject_Type` uses :c:func:`PyObject_GenericHash`.
sv: :c:data:`PyBaseObject_Type` använder :c:func:`PyObject_GenericHash`.

source: An optional pointer to a function that implements calling the object. This should be ``NULL`` if the object is not callable. The signature is the same as for :c:func:`PyObject_Call`::
sv: En valfri pekare till en funktion som implementerar anrop av objektet. Denna bör vara ``NULL`` om objektet inte är anropsbart. Signaturen är densamma som för :c:func:`PyObject_Call`::

source: An optional pointer to a function that implements the built-in operation :func:`str`. (Note that :class:`str` is a type now, and :func:`str` calls the constructor for that type. This constructor calls :c:func:`PyObject_Str` to do the actual work, and :c:func:`PyObject_Str` will call this handler.)
sv: En valfri pekare till en funktion som implementerar den inbyggda operationen :func:`str`. (Observera att :class:`str` nu är en typ och att :func:`str` anropar konstruktören för den typen. Denna konstruktör anropar :c:func:`PyObject_Str` för att göra det faktiska arbetet, och :c:func:`PyObject_Str` kommer att anropa denna hanterare)

source: The signature is the same as for :c:func:`PyObject_Str`::
sv: Signaturen är densamma som för :c:func:`PyObject_Str`::

source: The function must return a string or a Unicode object. It should be a "friendly" string representation of the object, as this is the representation that will be used, among other things, by the :func:`print` function.
sv: Funktionen måste returnera en sträng eller ett Unicode-objekt. Det bör vara en "vänlig" strängrepresentation av objektet, eftersom det är den representation som kommer att användas, bland annat, av funktionen :func:`print`.

source: When this field is not set, :c:func:`PyObject_Repr` is called to return a string representation.
sv: När detta fält inte är inställt anropas :c:func:`PyObject_Repr` för att returnera en strängrepresentation.

source: An optional pointer to the get-attribute function.
sv: En valfri pekare till funktionen get-attribute.

source: The signature is the same as for :c:func:`PyObject_GetAttr`::
sv: Signaturen är densamma som för :c:func:`PyObject_GetAttr`::

source: It is usually convenient to set this field to :c:func:`PyObject_GenericGetAttr`, which implements the normal way of looking for object attributes.
sv: Det är oftast lämpligt att ställa in detta fält till :c:func:`PyObject_GenericGetAttr`, som implementerar det normala sättet att leta efter objektattribut.

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_getattr`: a subtype inherits both :c:member:`~PyTypeObject.tp_getattr` and :c:member:`~PyTypeObject.tp_getattro` from its base type when the subtype's :c:member:`~PyTypeObject.tp_getattr` and :c:member:`~PyTypeObject.tp_getattro` are both ``NULL``.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_getattr`: en subtyp ärver både :c:member:`~PyTypeObject.tp_getattr` och :c:member:`~PyTypeObject.tp_getattro` från sin bastyp när subtypens :c:member:`~PyTypeObject.tp_getattr` och :c:member:`~PyTypeObject.tp_getattro` båda är ``NULL``.

source: :c:data:`PyBaseObject_Type` uses :c:func:`PyObject_GenericGetAttr`.
sv: :c:data:`PyBaseObject_Type` använder :c:func:`PyObject_GenericGetAttr`.

source: The signature is the same as for :c:func:`PyObject_SetAttr`::
sv: Signaturen är densamma som för :c:func:`PyObject_SetAttr`::

source: In addition, setting *value* to ``NULL`` to delete an attribute must be supported. It is usually convenient to set this field to :c:func:`PyObject_GenericSetAttr`, which implements the normal way of setting object attributes.
sv: Dessutom måste det finnas stöd för att sätta *value* till ``NULL`` för att ta bort ett attribut. Det är vanligtvis bekvämt att ställa in detta fält till :c:func:`PyObject_GenericSetAttr`, som implementerar det normala sättet att ställa in objektattribut.

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_setattr`: a subtype inherits both :c:member:`~PyTypeObject.tp_setattr` and :c:member:`~PyTypeObject.tp_setattro` from its base type when the subtype's :c:member:`~PyTypeObject.tp_setattr` and :c:member:`~PyTypeObject.tp_setattro` are both ``NULL``.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_setattr`: en subtyp ärver både :c:member:`~PyTypeObject.tp_setattr` och :c:member:`~PyTypeObject.tp_setattro` från sin bastyp när subtypens :c:member:`~PyTypeObject.tp_setattr` och :c:member:`~PyTypeObject.tp_setattro` båda är ``NULL``.

source: :c:data:`PyBaseObject_Type` uses :c:func:`PyObject_GenericSetAttr`.
sv: :c:data:`PyBaseObject_Type` använder :c:func:`PyObject_GenericSetAttr`.

source: Pointer to an additional structure that contains fields relevant only to objects which implement the buffer interface. These fields are documented in :ref:`buffer-structs`.
sv: Pekare till en ytterligare struktur som innehåller fält som endast är relevanta för objekt som implementerar buffertgränssnittet. Dessa fält är dokumenterade i :ref:`buffer-structs`.

source: The :c:member:`~PyTypeObject.tp_as_buffer` field is not inherited, but the contained fields are inherited individually.
sv: Fältet :c:member:`~PyTypeObject.tp_as_buffer` ärvs inte, men de ingående fälten ärvs individuellt.

source: This field is a bit mask of various flags. Some flags indicate variant semantics for certain situations; others are used to indicate that certain fields in the type object (or in the extension structures referenced via :c:member:`~PyTypeObject.tp_as_number`, :c:member:`~PyTypeObject.tp_as_sequence`, :c:member:`~PyTypeObject.tp_as_mapping`, and :c:member:`~PyTypeObject.tp_as_buffer`) that were historically not always present are valid; if such a flag bit is clear, the type fields it guards must not be accessed and must be considered to have a zero or ``NULL`` value instead.
sv: Detta fält är en bitmask med olika flaggor. Vissa flaggor anger varierande semantik för vissa situationer; andra används för att ange att vissa fält i typobjektet (eller i de tilläggsstrukturer som refereras via :c:member:`~PyTypeObject.tp_as_number`, :c:member:`~PyTypeObject.tp_as_sequence`, :c:member:`~PyTypeObject.tp_as_mapping`, och :c:member:`~PyTypeObject.tp_as_buffer`) som historiskt sett inte alltid funnits är giltiga; om en sådan flaggbit är klar får de typfält som den skyddar inte nås och måste anses ha värdet noll eller ``NULL`` istället.

source: Inheritance of this field is complicated. Most flag bits are inherited individually, i.e. if the base type has a flag bit set, the subtype inherits this flag bit. The flag bits that pertain to extension structures are strictly inherited if the extension structure is inherited, i.e. the base type's value of the flag bit is copied into the subtype together with a pointer to the extension structure. The :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit is inherited together with the :c:member:`~PyTypeObject.tp_traverse` and :c:member:`~PyTypeObject.tp_clear` fields, i.e. if the :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit is clear in the subtype and the :c:member:`~PyTypeObject.tp_traverse` and :c:member:`~PyTypeObject.tp_clear` fields in the subtype exist and have ``NULL`` values.
sv: Nedärvningen av detta fält är komplicerad. De flesta flaggbitar ärvs individuellt, dvs. om bastypen har en flaggbit inställd ärver subtypen denna flaggbit. De flaggbitar som hör till tilläggsstrukturer ärvs strikt om tilläggsstrukturen ärvs, d.v.s. bastypens värde på flaggbiten kopieras till subtypen tillsammans med en pekare till tilläggsstrukturen. Flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC` ärvs tillsammans med fälten :c:member:`~PyTypeObject.tp_traverse` och :c:member:`~PyTypeObject.tp_clear`, dvs. om flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC` är klar i subtypen och fälten :c:member:`~PyTypeObject.tp_traverse` och :c:member:`~PyTypeObject.tp_clear` i subtypen finns och har värdena ``NULL``.

source: :c:data:`PyBaseObject_Type` uses ``Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE``.
sv: :c:data:`PyBaseObject_Type` använder ``Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE``.

source: **Bit Masks:**
sv: **Bitmasker:**

source: The following bit masks are currently defined; these can be ORed together using the ``|`` operator to form the value of the :c:member:`~PyTypeObject.tp_flags` field. The macro :c:func:`PyType_HasFeature` takes a type and a flags value, *tp* and *f*, and checks whether ``tp->tp_flags & f`` is non-zero.
sv: Följande bitmasker är för närvarande definierade; dessa kan kombineras med operatorn ``|`` för att bilda värdet i fältet :c:member:`~PyTypeObject.tp_flags`. Makrot :c:func:`PyType_HasFeature` tar en typ och ett flaggvärde, *tp* och *f*, och kontrollerar om ``tp->tp_flags & f`` är icke-noll.

source: This bit is set when the type object itself is allocated on the heap, for example, types created dynamically using :c:func:`PyType_FromSpec`. In this case, the :c:member:`~PyObject.ob_type` field of its instances is considered a reference to the type, and the type object is INCREF'ed when a new instance is created, and DECREF'ed when an instance is destroyed (this does not apply to instances of subtypes; only the type referenced by the instance's ob_type gets INCREF'ed or DECREF'ed). Heap types should also :ref:`support garbage collection <supporting-cycle-detection>` as they can form a reference cycle with their own module object.
sv: Denna bit är inställd när själva typobjektet allokeras på heapen, t.ex. typer som skapas dynamiskt med :c:func:`PyType_FromSpec`. I detta fall betraktas fältet :c:member:`~PyObject.ob_type` i dess instanser som en referens till typen, och typobjektet INCREF'ed när en ny instans skapas, och DECREF'ed när en instans förstörs (detta gäller inte instanser av subtyper; endast den typ som instansens ob_type refererar till INCREF'ed eller DECREF'ed). Heap-typer bör också :ref:`stödja garbage collection <supporting-cycle-detection>` eftersom de kan bilda en referenscykel med sitt eget modulobjekt.

source: This bit is set when the type can be used as the base type of another type. If this bit is clear, the type cannot be subtyped (similar to a "final" class in Java).
sv: Denna bit är satt när typen kan användas som bastyp för en annan typ. Om denna bit är klar kan typen inte subtypas (på samma sätt som en "final"-klass i Java).

source: This bit is set when the type object has been fully initialized by :c:func:`PyType_Ready`.
sv: Denna bit är inställd när typobjektet har initialiserats fullständigt av :c:func:`PyType_Ready`.

source: This bit is set while :c:func:`PyType_Ready` is in the process of initializing the type object.
sv: Denna bit är inställd när :c:func:`PyType_Ready` håller på att initiera typobjektet.

source: This bit is set when the object supports garbage collection. If this bit is set, memory for new instances (see :c:member:`~PyTypeObject.tp_alloc`) must be allocated using :c:macro:`PyObject_GC_New` or :c:func:`PyType_GenericAlloc` and deallocated (see :c:member:`~PyTypeObject.tp_free`) using :c:func:`PyObject_GC_Del`. More information in section :ref:`supporting-cycle-detection`.
sv: Denna bit är inställd när objektet stöder garbage collection. Om denna bit är inställd måste minne för nya instanser (se :c:member:`~PyTypeObject.tp_alloc`) allokeras med :c:macro:`PyObject_GC_New` eller :c:func:`PyType_GenericAlloc` och avallokeras (se :c:member:`~PyTypeObject.tp_free`) med :c:func:`PyObject_GC_Del`. Mer information finns i avsnitt :ref:`supporting-cycle-detection`.

source: Group: :c:macro:`Py_TPFLAGS_HAVE_GC`, :c:member:`~PyTypeObject.tp_traverse`, :c:member:`~PyTypeObject.tp_clear`
sv: Grupp: :c:makro:`Py_TPFLAGS_HAVE_GC`, :c:member:`~PyTypeObject.tp_traverse`, :c:member:`~PyTypeObject.tp_clear`

source: The :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit is inherited together with the :c:member:`~PyTypeObject.tp_traverse` and :c:member:`~PyTypeObject.tp_clear` fields, i.e. if the :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit is clear in the subtype and the :c:member:`~PyTypeObject.tp_traverse` and :c:member:`~PyTypeObject.tp_clear` fields in the subtype exist and have ``NULL`` values.
sv: Flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC` ärvs tillsammans med fälten :c:member:`~PyTypeObject.tp_traverse` och :c:member:`~PyTypeObject.tp_clear`, dvs. om flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC` är klar i subtypen och fälten :c:member:`~PyTypeObject.tp_traverse` och :c:member:`~PyTypeObject.tp_clear` i subtypen finns och har värdena ``NULL``.

source: This is a bitmask of all the bits that pertain to the existence of certain fields in the type object and its extension structures. Currently, it includes the following bits: :c:macro:`Py_TPFLAGS_HAVE_STACKLESS_EXTENSION`.
sv: Detta är en bitmask med alla de bitar som rör förekomsten av vissa fält i typobjektet och dess tilläggsstrukturer. För närvarande innehåller den följande bitar: :c:macro:`Py_TPFLAGS_HAVE_STACKLESS_EXTENSION`.

source: This bit indicates that objects behave like unbound methods.
sv: Denna bit indikerar att objekt beter sig som obundna metoder.

source: If this flag is set for ``type(meth)``, then:
sv: Om denna flagga är inställd för ``typ(meth)``, då:

source: ``meth.__get__(obj, cls)(*args, **kwds)`` (with ``obj`` not None) must be equivalent to ``meth(obj, *args, **kwds)``.
sv: ``meth.__get__(obj, cls)(*args, **kwds)`` (med ``obj`` inte None) måste vara likvärdig med ``meth(obj, *args, **kwds)``.

source: ``meth.__get__(None, cls)(*args, **kwds)`` must be equivalent to ``meth(*args, **kwds)``.
sv: ``meth.__get__(None, cls)(*args, **kwds)`` måste vara likvärdig med ``meth(*args, **kwds)``.

source: This flag enables an optimization for typical method calls like ``obj.meth()``: it avoids creating a temporary "bound method" object for ``obj.meth``.
sv: Denna flagga möjliggör en optimering för typiska metodanrop som ``obj.meth()``: den undviker att skapa ett tillfälligt "bound method"-objekt för ``obj.meth``.

source: This flag is never inherited by types without the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag set. For extension types, it is inherited whenever :c:member:`~PyTypeObject.tp_descr_get` is inherited.
sv: Denna flagga ärvs aldrig av typer som inte har flaggan :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` inställd. För tilläggstyper ärvs den närhelst :c:member:`~PyTypeObject.tp_descr_get` ärvs.

source: This bit indicates that instances of the class have a :attr:`~object.__dict__` attribute, and that the space for the dictionary is managed by the VM.
sv: Denna bit anger att instanser av klassen har attributet :attr:`~object.__dict__` och att utrymmet för ordlistan hanteras av den virtuella datorn.

source: If this flag is set, :c:macro:`Py_TPFLAGS_HAVE_GC` should also be set.
sv: Om denna flagga är satt, bör :c:macro:`Py_TPFLAGS_HAVE_GC` också vara satt.

source: The type traverse function must call :c:func:`PyObject_VisitManagedDict` and its clear function must call :c:func:`PyObject_ClearManagedDict`.
sv: Typövergångsfunktionen måste anropa :c:func:`PyObject_VisitManagedDict` och dess rensningsfunktion måste anropa :c:func:`PyObject_ClearManagedDict`.

source: This flag is inherited unless the :c:member:`~PyTypeObject.tp_dictoffset` field is set in a superclass.
sv: Denna flagga ärvs om inte fältet :c:member:`~PyTypeObject.tp_dictoffset` är inställt i en superklass.

source: This bit indicates that instances of the class should be weakly referenceable.
sv: Denna bit anger att instanser av klassen ska vara svagt refererbara.

source: This flag is inherited unless the :c:member:`~PyTypeObject.tp_weaklistoffset` field is set in a superclass.
sv: Denna flagga ärvs om inte fältet :c:member:`~PyTypeObject.tp_weaklistoffset` är inställt i en superklass.

source: Only usable with variable-size types, i.e. ones with non-zero :c:member:`~PyTypeObject.tp_itemsize`.
sv: Används endast med typer med variabel storlek, dvs. sådana som har :c:member:`~PyTypeObject.tp_itemsize` som inte är noll.

source: Indicates that the variable-sized portion of an instance of this type is at the end of the instance's memory area, at an offset of ``Py_TYPE(obj)->tp_basicsize`` (which may be different in each subclass).
sv: Indikerar att den variabelstora delen av en instans av denna typ är i slutet av instansens minnesområde, vid en offset av ``Py_TYPE(obj)->tp_basicsize`` (som kan vara annorlunda i varje underklass).

source: When setting this flag, be sure that all superclasses either use this memory layout, or are not variable-sized. Python does not check this.
sv: När du ställer in denna flagga måste du se till att alla superklasser antingen använder denna minneslayout eller inte har variabel storlek. Python kontrollerar inte detta.

source: This flag is inherited.
sv: Denna flagga ärvs.

source: These flags are used by functions such as :c:func:`PyLong_Check` to quickly determine if a type is a subclass of a built-in type; such specific checks are faster than a generic check, like :c:func:`PyObject_IsInstance`. Custom types that inherit from built-ins should have their :c:member:`~PyTypeObject.tp_flags` set appropriately, or the code that interacts with such types will behave differently depending on what kind of check is used.
sv: Dessa flaggor används av funktioner som :c:func:`PyLong_Check` för att snabbt avgöra om en typ är en underklass av en inbyggd typ; sådana specifika kontroller är snabbare än en generisk kontroll, som :c:func:`PyObject_IsInstance`. Anpassade typer som ärver från inbyggda typer bör ha sina :c:member:`~PyTypeObject.tp_flags` inställda på lämpligt sätt, annars kommer koden som interagerar med sådana typer att bete sig annorlunda beroende på vilken typ av kontroll som används.

source: This bit is set when the :c:member:`~PyTypeObject.tp_finalize` slot is present in the type structure.
sv: Denna bit är inställd när :c:member:`~PyTypeObject.tp_finalize` finns i typstrukturen.

source: This flag isn't necessary anymore, as the interpreter assumes the :c:member:`~PyTypeObject.tp_finalize` slot is always present in the type structure.
sv: Denna flagga är inte längre nödvändig, eftersom tolken antar att :c:member:`~PyTypeObject.tp_finalize` alltid finns i typstrukturen.

source: This bit is set when the class implements the :ref:`vectorcall protocol <vectorcall>`. See :c:member:`~PyTypeObject.tp_vectorcall_offset` for details.
sv: Denna bit är inställd när klassen implementerar :ref:`vectorcall-protokollet <vectorcall>`. Se :c:member:`~PyTypeObject.tp_vectorcall_offset` för detaljer.

source: This bit is inherited if :c:member:`~PyTypeObject.tp_call` is also inherited.
sv: Denna bit ärvs om :c:member:`~PyTypeObject.tp_call` också ärvs.

source: This flag is now removed from a class when the class's :py:meth:`~object.__call__` method is reassigned.
sv: Denna flagga tas nu bort från en klass när klassens :py:meth:`~object.__call__`-metod tilldelas på nytt.

source: This flag can now be inherited by mutable classes.
sv: Denna flagga kan nu ärvas av mutabla klasser.

source: This bit is set for type objects that are immutable: type attributes cannot be set nor deleted.
sv: Denna bit är inställd för typobjekt som är oföränderliga: typattribut kan inte ställas in eller tas bort.

source: :c:func:`PyType_Ready` automatically applies this flag to :ref:`static types <static-types>`.
sv: :c:func:`PyType_Ready` tillämpar automatiskt denna flagga på :ref:`static types <static-types>`.

source: This flag is not inherited.
sv: Denna flagga är inte ärftlig.

source: Disallow creating instances of the type: set :c:member:`~PyTypeObject.tp_new` to NULL and don't create the ``__new__`` key in the type dictionary.
sv: Tillåt inte att skapa instanser av typen: sätt :c:member:`~PyTypeObject.tp_new` till NULL och skapa inte nyckeln ``__new__`` i typordboken.

source: The flag must be set before creating the type, not after. For example, it must be set before :c:func:`PyType_Ready` is called on the type.
sv: Flaggan måste anges innan typen skapas, inte efteråt. Den måste till exempel ställas in innan :c:func:`PyType_Ready` anropas på typen.

source: The flag is set automatically on :ref:`static types <static-types>` if :c:member:`~PyTypeObject.tp_base` is NULL or ``&PyBaseObject_Type`` and :c:member:`~PyTypeObject.tp_new` is NULL.
sv: Flaggan sätts automatiskt på :ref:`static types <static-types>` om :c:member:`~PyTypeObject.tp_base` är NULL eller ``&amp;PyBaseObject_Type`` och :c:member:`~PyTypeObject.tp_new` är NULL.

source: This flag is not inherited. However, subclasses will not be instantiable unless they provide a non-NULL :c:member:`~PyTypeObject.tp_new` (which is only possible via the C API).
sv: Denna flagga ärvs inte. Underklasser kommer dock inte att kunna instansieras om de inte tillhandahåller en icke-NULL :c:member:`~PyTypeObject.tp_new` (vilket endast är möjligt via C API).
