Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: The function should return the result of the comparison (usually ``Py_True`` or ``Py_False``). If the comparison is undefined, it must return ``Py_NotImplemented``, if another error occurred it must return ``NULL`` and set an exception condition.
sv: Funktionen ska returnera resultatet av jämförelsen (vanligtvis ``Py_True`` eller ``Py_False``). Om jämförelsen är odefinierad måste den returnera ``Py_NotImplemented``, om ett annat fel inträffade måste den returnera ``NULL`` och sätta ett undantagsvillkor.

source: The following constants are defined to be used as the third argument for :c:member:`~PyTypeObject.tp_richcompare` and for :c:func:`PyObject_RichCompare`:
sv: Följande konstanter är definierade för att användas som det tredje argumentet för :c:member:`~PyTypeObject.tp_richcompare` och för :c:func:`PyObject_RichCompare`:

source: Constant
sv: Konstant

source: Comparison
sv: Jämförelse

source: The following macro is defined to ease writing rich comparison functions:
sv: Följande makro är definierat för att underlätta skrivandet av rika jämförelsefunktioner:

source: Return ``Py_True`` or ``Py_False`` from the function, depending on the result of a comparison. VAL_A and VAL_B must be orderable by C comparison operators (for example, they may be C ints or floats). The third argument specifies the requested operation, as for :c:func:`PyObject_RichCompare`.
sv: Returnerar ``Py_True`` eller ``Py_False`` från funktionen, beroende på resultatet av en jämförelse. VAL_A och VAL_B måste kunna ordnas av C:s jämförelseoperatorer (de kan t.ex. vara C:s ints eller floats). Det tredje argumentet specificerar den begärda operationen, som för :c:func:`PyObject_RichCompare`.

source: The returned value is a new :term:`strong reference`.
sv: Det returnerade värdet är en ny :term:`strong reference`.

source: On error, sets an exception and returns ``NULL`` from the function.
sv: Vid fel, anger ett undantag och returnerar ``NULL`` från funktionen.

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_hash`: a subtype inherits :c:member:`~PyTypeObject.tp_richcompare` and :c:member:`~PyTypeObject.tp_hash` when the subtype's :c:member:`~PyTypeObject.tp_richcompare` and :c:member:`~PyTypeObject.tp_hash` are both ``NULL``.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_hash`: en subtyp ärver :c:member:`~PyTypeObject.tp_richcompare` och :c:member:`~PyTypeObject.tp_hash` när subtypens :c:member:`~PyTypeObject.tp_richcompare` och :c:member:`~PyTypeObject.tp_hash` båda är ``NULL``.

source: :c:data:`PyBaseObject_Type` provides a :c:member:`~PyTypeObject.tp_richcompare` implementation, which may be inherited. However, if only :c:member:`~PyTypeObject.tp_hash` is defined, not even the inherited function is used and instances of the type will not be able to participate in any comparisons.
sv: :c:data:`PyBaseObject_Type` tillhandahåller en :c:member:`~PyTypeObject.tp_richcompare`-implementation, som kan ärvas. Men om endast :c:member:`~PyTypeObject.tp_hash` definieras, används inte ens den ärvda funktionen och instanser av typen kommer inte att kunna delta i några jämförelser.

source: While this field is still supported, :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` should be used instead, if at all possible.
sv: Även om detta fält fortfarande stöds bör :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` användas i stället, om det är möjligt.

source: If the instances of this type are weakly referenceable, this field is greater than zero and contains the offset in the instance structure of the weak reference list head (ignoring the GC header, if present); this offset is used by :c:func:`PyObject_ClearWeakRefs` and the ``PyWeakref_*`` functions. The instance structure needs to include a field of type :c:expr:`PyObject*` which is initialized to ``NULL``.
sv: Om instanserna av denna typ är svagt refererbara, är detta fält större än noll och innehåller offset i instansstrukturen för huvudet på listan över svaga referenser (ignorerar GC-headern, om sådan finns); denna offset används av funktionerna :c:func:`PyObject_ClearWeakRefs` och ``PyWeakref_*``. Instansstrukturen måste innehålla ett fält av typen :c:expr:`PyObject*` som initialiseras till ``NULL``.

source: Do not confuse this field with :c:member:`~PyTypeObject.tp_weaklist`; that is the list head for weak references to the type object itself.
sv: Förväxla inte detta fält med :c:member:`~PyTypeObject.tp_weaklist`; det är listhuvudet för svaga referenser till typobjektet självt.

source: It is an error to set both the :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` bit and :c:member:`~PyTypeObject.tp_weaklistoffset`.
sv: Det är ett fel att ange både :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` bit och :c:member:`~PyTypeObject.tp_weaklistoffset`.

source: This field is inherited by subtypes, but see the rules listed below. A subtype may override this offset; this means that the subtype uses a different weak reference list head than the base type. Since the list head is always found via :c:member:`~PyTypeObject.tp_weaklistoffset`, this should not be a problem.
sv: Detta fält ärvs av subtyper, men se de regler som anges nedan. En subtyp kan åsidosätta denna offset; detta innebär att subtypen använder ett annat listhuvud för svaga referenser än bastypen. Eftersom listhuvudet alltid hittas via :c:member:`~PyTypeObject.tp_weaklistoffset`, bör detta inte vara något problem.

source: If the :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` bit is set in the :c:member:`~PyTypeObject.tp_flags` field, then :c:member:`~PyTypeObject.tp_weaklistoffset` will be set to a negative value, to indicate that it is unsafe to use this field.
sv: Om bitarna :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` är inställda i fältet :c:member:`~PyTypeObject.tp_flags`, kommer :c:member:`~PyTypeObject.tp_weaklistoffset` att sättas till ett negativt värde, för att indikera att det är osäkert att använda detta fält.

source: An optional pointer to a function that returns an :term:`iterator` for the object. Its presence normally signals that the instances of this type are :term:`iterable` (although sequences may be iterable without this function).
sv: En valfri pekare till en funktion som returnerar en :term:`iterator` för objektet. Dess närvaro signalerar normalt att instanser av denna typ är :term:`iterabla` (även om sekvenser kan vara iterabla utan denna funktion).

source: This function has the same signature as :c:func:`PyObject_GetIter`::
sv: Denna funktion har samma signatur som :c:func:`PyObject_GetIter`::

source: An optional pointer to a function that returns the next item in an :term:`iterator`. The signature is::
sv: En valfri pekare till en funktion som returnerar nästa objekt i en :term:`iterator`. Signaturen är::

source: When the iterator is exhausted, it must return ``NULL``; a :exc:`StopIteration` exception may or may not be set. When another error occurs, it must return ``NULL`` too. Its presence signals that the instances of this type are iterators.
sv: När iteratorn är uttömd måste den returnera ``NULL``; ett :exc:`StopIteration` undantag kan eller kan inte ställas in. När ett annat fel inträffar måste den också returnera ``NULL``. Dess närvaro signalerar att förekomsterna av denna typ är iteratorer.

source: Iterator types should also define the :c:member:`~PyTypeObject.tp_iter` function, and that function should return the iterator instance itself (not a new iterator instance).
sv: Iteratortyper bör också definiera funktionen :c:member:`~PyTypeObject.tp_iter`, och den funktionen bör returnera själva iteratorinstansen (inte en ny iteratorinstans).

source: This function has the same signature as :c:func:`PyIter_Next`.
sv: Denna funktion har samma signatur som :c:func:`PyIter_Next`.

source: An optional pointer to a static ``NULL``-terminated array of :c:type:`PyMethodDef` structures, declaring regular methods of this type.
sv: En valfri pekare till en statisk ``NULL``-terminerad array av :c:type:`PyMethodDef`-strukturer, som deklarerar vanliga metoder av denna typ.

source: For each entry in the array, an entry is added to the type's dictionary (see :c:member:`~PyTypeObject.tp_dict` below) containing a method descriptor.
sv: För varje post i matrisen läggs en post till i typens dictionary (se :c:member:`~PyTypeObject.tp_dict` nedan) som innehåller en metoddeskriptor.

source: This field is not inherited by subtypes (methods are inherited through a different mechanism).
sv: Detta fält ärvs inte av subtyper (metoder ärvs genom en annan mekanism).

source: An optional pointer to a static ``NULL``-terminated array of :c:type:`PyMemberDef` structures, declaring regular data members (fields or slots) of instances of this type.
sv: En valfri pekare till en statisk ``NULL``-terminerad array av :c:type:`PyMemberDef`-strukturer, som deklarerar vanliga datamedlemmar (fält eller slots) för instanser av denna typ.

source: For each entry in the array, an entry is added to the type's dictionary (see :c:member:`~PyTypeObject.tp_dict` below) containing a member descriptor.
sv: För varje post i matrisen läggs en post till i typens dictionary (se :c:member:`~PyTypeObject.tp_dict` nedan) som innehåller en medlemsdeskriptor.

source: This field is not inherited by subtypes (members are inherited through a different mechanism).
sv: Detta fält ärvs inte av subtyper (medlemmar ärvs genom en annan mekanism).

source: An optional pointer to a static ``NULL``-terminated array of :c:type:`PyGetSetDef` structures, declaring computed attributes of instances of this type.
sv: En valfri pekare till en statisk ``NULL``-terminerad array av :c:type:`PyGetSetDef`-strukturer, som deklarerar beräknade attribut för instanser av denna typ.

source: For each entry in the array, an entry is added to the type's dictionary (see :c:member:`~PyTypeObject.tp_dict` below) containing a getset descriptor.
sv: För varje post i matrisen läggs en post till i typens dictionary (se :c:member:`~PyTypeObject.tp_dict` nedan) som innehåller en getset-descriptor.

source: This field is not inherited by subtypes (computed attributes are inherited through a different mechanism).
sv: Detta fält ärvs inte av subtyper (beräknade attribut ärvs genom en annan mekanism).

source: An optional pointer to a base type from which type properties are inherited. At this level, only single inheritance is supported; multiple inheritance require dynamically creating a type object by calling the metatype.
sv: En valfri pekare till en bastyp från vilken typegenskaper ärvs. På denna nivå stöds endast enkel nedärvning; multipel nedärvning kräver att ett typobjekt skapas dynamiskt genom att anropa metatypen.

source: Slot initialization is subject to the rules of initializing globals. C99 requires the initializers to be "address constants". Function designators like :c:func:`PyType_GenericNew`, with implicit conversion to a pointer, are valid C99 address constants.
sv: Slotinitialisering är föremål för reglerna för initialisering av globaler. C99 kräver att initialisatorerna är "adresskonstanter". Funktionsbeteckningar som :c:func:`PyType_GenericNew`, med implicit konvertering till en pekare, är giltiga C99-adresskonstanter.

source: However, the unary '&' operator applied to a non-static variable like :c:data:`PyBaseObject_Type` is not required to produce an address constant. Compilers may support this (gcc does), MSVC does not. Both compilers are strictly standard conforming in this particular behavior.
sv: Den unära operatorn '&' som används på en icke-statisk variabel som :c:data:`PyBaseObject_Type` är dock inte nödvändig för att producera en adresskonstant. Kompilatorer kan stödja detta (gcc gör det), MSVC gör det inte. Båda kompilatorerna är strikt standardkonforma i detta speciella beteende.

source: Consequently, :c:member:`~PyTypeObject.tp_base` should be set in the extension module's init function.
sv: Följaktligen bör :c:member:`~PyTypeObject.tp_base` anges i tilläggsmodulens init-funktion.

source: This field is not inherited by subtypes (obviously).
sv: Detta fält ärvs inte av subtyper (naturligtvis).

source: This field defaults to ``&PyBaseObject_Type`` (which to Python programmers is known as the type :class:`object`).
sv: Detta fält är som standard ``&PyBaseObject_Type`` (som för Python-programmerare är känt som typen :class:`object`).

source: The type's dictionary is stored here by :c:func:`PyType_Ready`.
sv: Typens ordbok lagras här av :c:func:`PyType_Ready`.

source: This field should normally be initialized to ``NULL`` before PyType_Ready is called; it may also be initialized to a dictionary containing initial attributes for the type. Once :c:func:`PyType_Ready` has initialized the type, extra attributes for the type may be added to this dictionary only if they don't correspond to overloaded operations (like :meth:`~object.__add__`). Once initialization for the type has finished, this field should be treated as read-only.
sv: Detta fält bör normalt initialiseras till ``NULL`` innan PyType_Ready anropas; det kan också initialiseras till en dictionary som innehåller initiala attribut för typen. När :c:func:`PyType_Ready` har initialiserat typen kan extra attribut för typen läggas till i denna ordbok endast om de inte motsvarar överbelastade operationer (som :meth:`~object.__add__`). När initialiseringen av typen har avslutats bör detta fält behandlas som skrivskyddat.

source: Some types may not store their dictionary in this slot. Use :c:func:`PyType_GetDict` to retrieve the dictionary for an arbitrary type.
sv: Vissa typer kanske inte lagrar sin ordbok i denna slot. Använd :c:func:`PyType_GetDict` för att hämta ordlistan för en godtycklig typ.

source: Internals detail: For static builtin types, this is always ``NULL``. Instead, the dict for such types is stored on ``PyInterpreterState``. Use :c:func:`PyType_GetDict` to get the dict for an arbitrary type.
sv: Intern detalj: För statiska inbyggda typer är detta alltid ``NULL``. Istället lagras dict för sådana typer på ``PyInterpreterState``. Använd :c:func:`PyType_GetDict` för att få fram dict för en godtycklig typ.

source: This field is not inherited by subtypes (though the attributes defined in here are inherited through a different mechanism).
sv: Detta fält ärvs inte av subtyper (även om de attribut som definieras här ärvs genom en annan mekanism).

source: If this field is ``NULL``, :c:func:`PyType_Ready` will assign a new dictionary to it.
sv: Om detta fält är ``NULL`` kommer :c:func:`PyType_Ready` att tilldela det en ny ordbok.

source: It is not safe to use :c:func:`PyDict_SetItem` on or otherwise modify :c:member:`~PyTypeObject.tp_dict` with the dictionary C-API.
sv: Det är inte säkert att använda :c:func:`PyDict_SetItem` på eller på annat sätt modifiera :c:member:`~PyTypeObject.tp_dict` med dictionary C-API.

source: An optional pointer to a "descriptor get" function.
sv: En valfri pekare till en "descriptor get"-funktion.

source: The function signature is::
sv: Funktionens signatur är::

source: An optional pointer to a function for setting and deleting a descriptor's value.
sv: En valfri pekare till en funktion för att ställa in och ta bort en descriptors värde.

source: The *value* argument is set to ``NULL`` to delete the value.
sv: Argumentet *värde* sätts till ``NULL`` för att ta bort värdet.

source: While this field is still supported, :c:macro:`Py_TPFLAGS_MANAGED_DICT` should be used instead, if at all possible.
sv: Även om detta fält fortfarande stöds, bör :c:macro:`Py_TPFLAGS_MANAGED_DICT` användas istället, om det är möjligt.

source: If the instances of this type have a dictionary containing instance variables, this field is non-zero and contains the offset in the instances of the type of the instance variable dictionary; this offset is used by :c:func:`PyObject_GenericGetAttr`.
sv: Om instanserna av denna typ har en ordbok som innehåller instansvariabler, är detta fält icke-noll och innehåller offset i instanserna av typen av instansvariabelordboken; denna offset används av :c:func:`PyObject_GenericGetAttr`.

source: Do not confuse this field with :c:member:`~PyTypeObject.tp_dict`; that is the dictionary for attributes of the type object itself.
sv: Förväxla inte detta fält med :c:member:`~PyTypeObject.tp_dict`; det är ordlistan för attribut för själva typobjektet.

source: The value specifies the offset of the dictionary from the start of the instance structure.
sv: Värdet anger ordbokens förskjutning från början av instansstrukturen.

source: The :c:member:`~PyTypeObject.tp_dictoffset` should be regarded as write-only. To get the pointer to the dictionary call :c:func:`PyObject_GenericGetDict`. Calling :c:func:`PyObject_GenericGetDict` may need to allocate memory for the dictionary, so it is may be more efficient to call :c:func:`PyObject_GetAttr` when accessing an attribute on the object.
sv: :c:member:`~PyTypeObject.tp_dictoffset` bör betraktas som skrivskyddad. För att få pekaren till ordlistan anropa :c:func:`PyObject_GenericGetDict`. Anrop av :c:func:`PyObject_GenericGetDict` kan behöva allokera minne för ordlistan, så det kan vara mer effektivt att anropa :c:func:`PyObject_GetAttr` när man vill komma åt ett attribut på objektet.

source: It is an error to set both the :c:macro:`Py_TPFLAGS_MANAGED_DICT` bit and :c:member:`~PyTypeObject.tp_dictoffset`.
sv: Det är ett fel att ange både :c:macro:`Py_TPFLAGS_MANAGED_DICT` bit och :c:member:`~PyTypeObject.tp_dictoffset`.

source: This field is inherited by subtypes. A subtype should not override this offset; doing so could be unsafe, if C code tries to access the dictionary at the previous offset. To properly support inheritance, use :c:macro:`Py_TPFLAGS_MANAGED_DICT`.
sv: Detta fält ärvs av subtyper. En subtyp bör inte åsidosätta denna offset; det kan vara osäkert om C-kod försöker komma åt ordboken vid den tidigare offset. För att korrekt stödja arv, använd :c:macro:`Py_TPFLAGS_MANAGED_DICT`.

source: This slot has no default. For :ref:`static types <static-types>`, if the field is ``NULL`` then no :attr:`~object.__dict__` gets created for instances.
sv: Denna slot har ingen standard. För :ref:``static types <static-types>``, om fältet är ``NULL`` så skapas ingen :attr:`~object.__dict__` för instanser.

source: If the :c:macro:`Py_TPFLAGS_MANAGED_DICT` bit is set in the :c:member:`~PyTypeObject.tp_flags` field, then :c:member:`~PyTypeObject.tp_dictoffset` will be set to ``-1``, to indicate that it is unsafe to use this field.
sv: Om bitarna :c:macro:`Py_TPFLAGS_MANAGED_DICT` är inställda i fältet :c:member:`~PyTypeObject.tp_flags`, så kommer :c:member:`~PyTypeObject.tp_dictoffset` att sättas till ``-1``, för att indikera att det är osäkert att använda detta fält.

source: An optional pointer to an instance initialization function.
sv: En valfri pekare till en instansinitialiseringsfunktion.

source: This function corresponds to the :meth:`~object.__init__` method of classes. Like :meth:`!__init__`, it is possible to create an instance without calling :meth:`!__init__`, and it is possible to reinitialize an instance by calling its :meth:`!__init__` method again.
sv: Denna funktion motsvarar metoden :meth:`~object.__init__` för klasser. Precis som :meth:`!__init__` är det möjligt att skapa en instans utan att anropa :meth:`!__init__`, och det är möjligt att återinitialisera en instans genom att anropa dess :meth:`!__init__`-metod igen.

source: The self argument is the instance to be initialized; the *args* and *kwds* arguments represent positional and keyword arguments of the call to :meth:`~object.__init__`.
sv: Argumentet self är den instans som ska initialiseras; argumenten *args* och *kwds* representerar positions- och nyckelordsargument för anropet till :meth:`~object.__init__`.

source: The :c:member:`~PyTypeObject.tp_init` function, if not ``NULL``, is called when an instance is created normally by calling its type, after the type's :c:member:`~PyTypeObject.tp_new` function has returned an instance of the type. If the :c:member:`~PyTypeObject.tp_new` function returns an instance of some other type that is not a subtype of the original type, no :c:member:`~PyTypeObject.tp_init` function is called; if :c:member:`~PyTypeObject.tp_new` returns an instance of a subtype of the original type, the subtype's :c:member:`~PyTypeObject.tp_init` is called.
sv: Funktionen :c:member:`~PyTypeObject.tp_init`, om den inte är ``NULL``, anropas när en instans skapas normalt genom att anropa dess typ, efter att typens funktion :c:member:`~PyTypeObject.tp_new` har returnerat en instans av typen. Om funktionen :c:member:`~PyTypeObject.tp_new` returnerar en instans av någon annan typ som inte är en subtyp av den ursprungliga typen anropas ingen funktion :c:member:`~PyTypeObject.tp_init`; om :c:member:`~PyTypeObject.tp_new` returnerar en instans av en subtyp av den ursprungliga typen anropas subtypens funktion :c:member:`~PyTypeObject.tp_init`.

source: Returns ``0`` on success, ``-1`` and sets an exception on error.
sv: Returnerar ``0`` vid framgång, ``-1`` och anger ett undantag vid fel.

source: For :ref:`static types <static-types>` this field does not have a default.
sv: För :ref:`static types <static-types>` har detta fält ingen standard.

source: An optional pointer to an instance allocation function.
sv: En valfri pekare till en funktion för instansallokering.

source: Static subtypes inherit this slot, which will be :c:func:`PyType_GenericAlloc` if inherited from :class:`object`.
sv: Statiska subtyper ärver denna slot, som kommer att vara :c:func:`PyType_GenericAlloc` om den ärvs från :class:`object`.

source: :ref:`Heap subtypes <heap-types>` do not inherit this slot.
sv: :ref:`Heap subtyper <heap-types>` ärver inte denna slot.

source: For heap subtypes, this field is always set to :c:func:`PyType_GenericAlloc`.
sv: För subtyper av heap är detta fält alltid inställt på :c:func:`PyType_GenericAlloc`.

source: For static subtypes, this slot is inherited (see above).
sv: För statiska subtyper ärvs denna plats (se ovan).

source: An optional pointer to an instance creation function.
sv: En valfri pekare till en funktion för att skapa en instans.

source: The *subtype* argument is the type of the object being created; the *args* and *kwds* arguments represent positional and keyword arguments of the call to the type. Note that *subtype* doesn't have to equal the type whose :c:member:`~PyTypeObject.tp_new` function is called; it may be a subtype of that type (but not an unrelated type).
sv: Argumentet *subtype* är typen av det objekt som skapas; argumenten *args* och *kwds* representerar positions- och nyckelordsargument i anropet till typen. Observera att *subtype* inte behöver vara lika med den typ vars :c:member:`~PyTypeObject.tp_new`-funktion anropas; det kan vara en subtyp av den typen (men inte en orelaterad typ).
