Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: The correct way to set :c:member:`!tp_basicsize` is to use the ``sizeof`` operator on the struct used to declare the instance layout. This struct must include the struct used to declare the base type. In other words, :c:member:`!tp_basicsize` must be greater than or equal to the base's :c:member:`!tp_basicsize`.
sv: Det korrekta sättet att ange :c:member:`!tp_basicsize` är att använda operatorn ``sizeof`` på den struct som används för att deklarera instanslayouten. Denna struct måste inkludera den struct som används för att deklarera bastypen. Med andra ord måste :c:member:`!tp_basicsize` vara större än eller lika med basens :c:member:`!tp_basicsize`.

source: Since every type is a subtype of :py:type:`object`, this struct must include :c:type:`PyObject` or :c:type:`PyVarObject` (depending on whether :c:member:`~PyVarObject.ob_size` should be included). These are usually defined by the macro :c:macro:`PyObject_HEAD` or :c:macro:`PyObject_VAR_HEAD`, respectively.
sv: Eftersom varje typ är en subtyp av :py:type:`object` måste denna struktur innehålla :c:type:`PyObject` eller :c:type:`PyVarObject` (beroende på om :c:member:`~PyVarObject.ob_size` ska ingå). Dessa definieras vanligtvis av makrot :c:macro:`PyObject_HEAD` respektive :c:macro:`PyObject_VAR_HEAD`.

source: The basic size does not include the GC header size, as that header is not part of :c:macro:`PyObject_HEAD`.
sv: Grundstorleken inkluderar inte storleken på GC-huvudet, eftersom det huvudet inte ingår i :c:macro:`PyObject_HEAD`.

source: For cases where struct used to declare the base type is unknown, see :c:member:`PyType_Spec.basicsize` and :c:func:`PyType_FromMetaclass`.
sv: För fall där struct som används för att deklarera bastypen är okänd, se :c:member:`PyType_Spec.basicsize` och :c:func:`PyType_FromMetaclass`.

source: Notes about alignment:
sv: Anmärkningar om anpassning:

source: :c:member:`!tp_basicsize` must be a multiple of ``_Alignof(PyObject)``. When using ``sizeof`` on a ``struct`` that includes :c:macro:`PyObject_HEAD`, as recommended, the compiler ensures this. When not using a C ``struct``, or when using compiler extensions like ``__attribute__((packed))``, it is up to you.
sv: :c:member:`!tp_basicsize` måste vara en multipel av ``_Alignof(PyObject)``. När du använder ``sizeof`` på en ``struct`` som innehåller :c:macro:`PyObject_HEAD`, som rekommenderat, säkerställer kompilatorn detta. Om du inte använder en C-struktur, eller om du använder kompilatortillägg som ``__attribute__((packed))``, är det upp till dig.

source: If the variable items require a particular alignment, :c:member:`!tp_basicsize` and :c:member:`!tp_itemsize` must each be a multiple of that alignment. For example, if a type's variable part stores a ``double``, it is your responsibility that both fields are a multiple of ``_Alignof(double)``.
sv: Om de variabla objekten kräver en viss inriktning måste :c:member:`!tp_basicsize` och :c:member:`!tp_itemsize` var och en vara en multipel av den inriktningen. Om t.ex. en variabeldel av en typ lagrar en ``double``, är det ditt ansvar att båda fälten är en multipel av ``_Alignof(double)``.

source: These fields are inherited separately by subtypes. (That is, if the field is set to zero, :c:func:`PyType_Ready` will copy the value from the base type, indicating that the instances do not need additional storage.)
sv: Dessa fält ärvs separat av subtyperna. (Det vill säga, om fältet är satt till noll kommer :c:func:`PyType_Ready` att kopiera värdet från bastypen, vilket indikerar att instanserna inte behöver ytterligare lagring)

source: If the base type has a non-zero :c:member:`~PyTypeObject.tp_itemsize`, it is generally not safe to set :c:member:`~PyTypeObject.tp_itemsize` to a different non-zero value in a subtype (though this depends on the implementation of the base type).
sv: Om bastypen har ett icke-nollvärde för :c:member:`~PyTypeObject.tp_itemsize` är det i allmänhet inte säkert att ange :c:member:`~PyTypeObject.tp_itemsize` till ett annat icke-nollvärde i en subtyp (detta beror dock på implementeringen av bastypen).

source: A pointer to the instance destructor function. The function signature is::
sv: En pekare till instansens destruktorfunktion. Funktionens signatur är::

source: The destructor function should remove all references which the instance owns (e.g., call :c:func:`Py_CLEAR`), free all memory buffers owned by the instance, and call the type's :c:member:`~PyTypeObject.tp_free` function to free the object itself.
sv: Destruktorfunktionen ska ta bort alla referenser som instansen äger (t.ex. anropa :c:func:`Py_CLEAR`), frigöra alla minnesbuffertar som instansen äger och anropa typens :c:member:`~PyTypeObject.tp_free`-funktion för att frigöra själva objektet.

source: If you may call functions that may set the error indicator, you must use :c:func:`PyErr_GetRaisedException` and :c:func:`PyErr_SetRaisedException` to ensure you don't clobber a preexisting error indicator (the deallocation could have occurred while processing a different error):
sv: Om du kan anropa funktioner som kan ställa in felindikatorn måste du använda :c:func:`PyErr_GetRaisedException` och :c:func:`PyErr_SetRaisedException` för att säkerställa att du inte slår ut en redan existerande felindikator (deallokeringen kan ha inträffat under behandlingen av ett annat fel):

source: static void foo_dealloc(foo_object *self) { PyObject *et, *ev, *etb; PyObject *exc = PyErr_GetRaisedException(); ... PyErr_SetRaisedException(exc); }
sv: statiskt void foo_dealloc(foo_objekt *self) { PyObject *et, *ev, *etb; PyObject *exc = PyErr_GetRaisedException(); ... PyErr_SetRaisedException(exc); }

source: The dealloc handler itself must not raise an exception; if it hits an error case it should call :c:func:`PyErr_FormatUnraisable` to log (and clear) an unraisable exception.
sv: Själva dealloc-hanteraren får inte ge upphov till ett undantag; om den stöter på ett felfall bör den anropa :c:func:`PyErr_FormatUnraisable` för att logga (och rensa) ett undantag som inte går att radera.

source: No guarantees are made about when an object is destroyed, except:
sv: Det finns inga garantier för när ett objekt förstörs, förutom:

source: Python will destroy an object immediately or some time after the final reference to the object is deleted, unless its finalizer (:c:member:`~PyTypeObject.tp_finalize`) subsequently resurrects the object.
sv: Python kommer att förstöra ett objekt omedelbart eller en tid efter att den sista referensen till objektet har tagits bort, såvida inte dess finalizer (:c:member:`~PyTypeObject.tp_finalize`) därefter återupplivar objektet.

source: An object will not be destroyed while it is being automatically finalized (:c:member:`~PyTypeObject.tp_finalize`) or automatically cleared (:c:member:`~PyTypeObject.tp_clear`).
sv: Ett objekt kommer inte att förstöras medan det automatiskt slutförs (:c:member:`~PyTypeObject.tp_finalize`) eller automatiskt rensas (:c:member:`~PyTypeObject.tp_clear`).

source: CPython currently destroys an object immediately from :c:func:`Py_DECREF` when the new reference count is zero, but this may change in a future version.
sv: CPython förstör för närvarande ett objekt omedelbart från :c:func:`Py_DECREF` när det nya referensantalet är noll, men detta kan ändras i en framtida version.

source: It is recommended to call :c:func:`PyObject_CallFinalizerFromDealloc` at the beginning of :c:member:`!tp_dealloc` to guarantee that the object is always finalized before destruction.
sv: Det rekommenderas att anropa :c:func:`PyObject_CallFinalizerFromDealloc` i början av :c:member:`!tp_dealloc` för att garantera att objektet alltid är finalized innan det förstörs.

source: If the type supports garbage collection (the :c:macro:`Py_TPFLAGS_HAVE_GC` flag is set), the destructor should call :c:func:`PyObject_GC_UnTrack` before clearing any member fields.
sv: Om typen stödjer garbage collection (flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` är satt) ska destruktorn anropa :c:func:`PyObject_GC_UnTrack` innan den rensar några medlemsfält.

source: It is permissible to call :c:member:`~PyTypeObject.tp_clear` from :c:member:`!tp_dealloc` to reduce code duplication and to guarantee that the object is always cleared before destruction. Beware that :c:member:`!tp_clear` might have already been called.
sv: Det är tillåtet att anropa :c:member:`~PyTypeObject.tp_clear` från :c:member:`!tp_dealloc` för att minska koddubblering och för att garantera att objektet alltid rensas innan det förstörs. Tänk på att :c:member:`!tp_clear` redan kan ha anropats.

source: If the type is heap allocated (:c:macro:`Py_TPFLAGS_HEAPTYPE`), the deallocator should release the owned reference to its type object (via :c:func:`Py_DECREF`) after calling the type deallocator. See the example code below.::
sv: Om typen är heap-allokerad (:c:macro:`Py_TPFLAGS_HEAPTYPE`), bör deallokatorn släppa den ägda referensen till sitt typobjekt (via :c:func:`Py_DECREF`) efter anropet till typdeallokatorn. Se exempelkoden nedan.::

source: static void foo_dealloc(PyObject *op) { foo_object *self = (foo_object *) op; PyObject_GC_UnTrack(self); Py_CLEAR(self->ref); Py_TYPE(self)->tp_free(self); }
sv: statiskt void foo_dealloc(PyObject *op) { foo_object *self = (foo_object *) op; PyObject_GC_UnTrack(self); Py_CLEAR(själv>ref); Py_TYPE(self)->tp_free(self); }

source: :c:member:`!tp_dealloc` must leave the exception status unchanged. If it needs to call something that might raise an exception, the exception state must be backed up first and restored later (after logging any exceptions with :c:func:`PyErr_WriteUnraisable`).
sv: :c:member:`!tp_dealloc` måste lämna undantagsstatusen oförändrad. Om den behöver anropa något som kan ge upphov till ett undantag, måste undantagstillståndet först säkerhetskopieras och återställas senare (efter loggning av eventuella undantag med :c:func:`PyErr_WriteUnraisable`).

source: Example::
sv: Exempel::

source: static void foo_dealloc(PyObject *self) { PyObject *exc = PyErr_GetRaisedException(); if (PyObject_CallFinalizerFromDealloc(self) < 0) { // self was resurrected. goto done; } PyTypeObject *tp = Py_TYPE(self); if (tp->tp_flags & Py_TPFLAGS_HAVE_GC) { PyObject_GC_UnTrack(self); } // Optional, but convenient to avoid code duplication. if (tp->tp_clear && tp->tp_clear(self) < 0) { PyErr_WriteUnraisable(self); } // Any additional destruction goes here. tp->tp_free(self); self = NULL; // In case PyErr_WriteUnraisable() is called below. if (tp->tp_flags & Py_TPFLAGS_HEAPTYPE) { Py_CLEAR(tp); } done: // Optional, if something was called that might have raised an // exception. if (PyErr_Occurred()) { PyErr_WriteUnraisable(self); } PyErr_SetRaisedException(exc); }
sv: statiskt void foo_dealloc(PyObject *self) { PyObject *exc = PyErr_GetRaisedException(); if (PyObject_CallFinalizerFromDealloc(self) < 0) { // self återupplivades. goto done; } PyTypeObject *tp = Py_TYPE(self); if (tp->tp_flags & Py_TPFLAGS_HAVE_GC) { PyObject_GC_UnTrack(self); } // Valfritt, men praktiskt för att undvika koddubblering. if (tp->tp_clear && tp->tp_clear(self) < 0) { PyErr_WriteUnraisable(self); } // Eventuell ytterligare förstörelse hamnar här. tp->tp_free(self); self = NULL; // Ifall PyErr_WriteUnraisable() anropas nedan. if (tp->tp_flags & Py_TPFLAGS_HEAPTYPE) { Py_CLEAR(tp); } done: // Valfritt, om något anropades som kan ha gett upphov till ett // undantag. if (PyErr_Occurred()) { PyErr_WriteUnraisable(self); } PyErr_SetRaisedException(exc); }

source: :c:member:`!tp_dealloc` may be called from any Python thread, not just the thread which created the object (if the object becomes part of a refcount cycle, that cycle might be collected by a garbage collection on any thread). This is not a problem for Python API calls, since the thread on which :c:member:`!tp_dealloc` is called with an :term:`attached thread state`. However, if the object being destroyed in turn destroys objects from some other C library, care should be taken to ensure that destroying those objects on the thread which called :c:member:`!tp_dealloc` will not violate any assumptions of the library.
sv: :c:member:`!tp_dealloc` kan anropas från vilken Python-tråd som helst, inte bara den tråd som skapade objektet (om objektet blir en del av en refcount-cykel kan den cykeln samlas in av en garbage collection på vilken tråd som helst). Detta är inte ett problem för Python API-anrop, eftersom den tråd som :c:member:`!tp_dealloc` anropas från har en :term:`attached thread state`. Men om objektet som förstörs i sin tur förstör objekt från något annat C-bibliotek, bör man se till att förstörelsen av dessa objekt i den tråd som anropade :c:member:`!tp_dealloc` inte bryter mot några antaganden i biblioteket.

source: :ref:`life-cycle` for details about how this slot relates to other slots.
sv: :ref:`life-cycle` för detaljer om hur denna slot förhåller sig till andra slots.

source: An optional offset to a per-instance function that implements calling the object using the :ref:`vectorcall protocol <vectorcall>`, a more efficient alternative of the simpler :c:member:`~PyTypeObject.tp_call`.
sv: En valfri offset till en funktion per instans som implementerar anrop av objektet med hjälp av :ref:`vectorcall-protokollet <vectorcall>`, ett effektivare alternativ till den enklare :c:member:`~PyTypeObject.tp_call`.

source: This field is only used if the flag :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` is set. If so, this must be a positive integer containing the offset in the instance of a :c:type:`vectorcallfunc` pointer.
sv: Detta fält används endast om flaggan :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` är satt. Om så är fallet måste detta vara ett positivt heltal som innehåller offset i instansen för en pekare av typen :c:type:`vectorcallfunc`.

source: The *vectorcallfunc* pointer may be ``NULL``, in which case the instance behaves as if :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` was not set: calling the instance falls back to :c:member:`~PyTypeObject.tp_call`.
sv: Poängaren *vectorcallfunc* kan vara ``NULL``, i vilket fall instansen beter sig som om :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` inte var inställd: anrop av instansen faller tillbaka till :c:member:`~PyTypeObject.tp_call`.

source: Any class that sets ``Py_TPFLAGS_HAVE_VECTORCALL`` must also set :c:member:`~PyTypeObject.tp_call` and make sure its behaviour is consistent with the *vectorcallfunc* function. This can be done by setting *tp_call* to :c:func:`PyVectorcall_Call`.
sv: Alla klasser som ställer in ``Py_TPFLAGS_HAVE_VECTORCALL`` måste också ställa in :c:member:`~PyTypeObject.tp_call` och se till att dess beteende är förenligt med funktionen *vectorcallfunc*. Detta kan göras genom att ställa in *tp_call* till :c:func:`PyVectorcall_Call`.

source: Before version 3.8, this slot was named ``tp_print``. In Python 2.x, it was used for printing to a file. In Python 3.0 to 3.7, it was unused.
sv: Före version 3.8 hette denna slot ``tp_print``. I Python 2.x användes den för utskrift till en fil. I Python 3.0 till 3.7 var den oanvänd.

source: Before version 3.12, it was not recommended for :ref:`mutable heap types <heap-types>` to implement the vectorcall protocol. When a user sets :attr:`~object.__call__` in Python code, only *tp_call* is updated, likely making it inconsistent with the vectorcall function. Since 3.12, setting ``__call__`` will disable vectorcall optimization by clearing the :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flag.
sv: Före version 3.12 var det inte rekommenderat för :ref:`mutable heap types <heap-types>` att implementera vectorcall-protokollet. När en användare ställer in :attr:`~object.__call__` i Python-kod, uppdateras endast *tp_call*, vilket sannolikt gör den inkonsekvent med vectorcall-funktionen. Sedan 3.12 kommer inställningen ``__call__`` att inaktivera vectorcall-optimering genom att rensa flaggan :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL`.

source: This field is always inherited. However, the :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flag is not always inherited. If it's not set, then the subclass won't use :ref:`vectorcall <vectorcall>`, except when :c:func:`PyVectorcall_Call` is explicitly called.
sv: Detta fält är alltid ärftligt. Dock är :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flaggan inte alltid ärvd. Om den inte är satt, kommer subklassen inte att använda :ref:`vectorcall <vectorcall>`, förutom när :c:func:`PyVectorcall_Call` explicit anropas.

source: An optional pointer to the get-attribute-string function.
sv: En valfri pekare till funktionen get-attribute-string.

source: This field is deprecated. When it is defined, it should point to a function that acts the same as the :c:member:`~PyTypeObject.tp_getattro` function, but taking a C string instead of a Python string object to give the attribute name.
sv: Detta fält är föråldrat. När det definieras bör det peka på en funktion som fungerar på samma sätt som :c:member:`~PyTypeObject.tp_getattro`-funktionen, men som tar en C-sträng istället för ett Python-strängobjekt för att ge attributnamnet.

source: Group: :c:member:`~PyTypeObject.tp_getattr`, :c:member:`~PyTypeObject.tp_getattro`
sv: Grupp: :c:member:`~PyTypeObject.tp_getattr`, :c:member:`~PyTypeObject.tp_getattro`

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_getattro`: a subtype inherits both :c:member:`~PyTypeObject.tp_getattr` and :c:member:`~PyTypeObject.tp_getattro` from its base type when the subtype's :c:member:`~PyTypeObject.tp_getattr` and :c:member:`~PyTypeObject.tp_getattro` are both ``NULL``.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_getattro`: en subtyp ärver både :c:member:`~PyTypeObject.tp_getattr` och :c:member:`~PyTypeObject.tp_getattro` från sin bastyp när subtypens :c:member:`~PyTypeObject.tp_getattr` och :c:member:`~PyTypeObject.tp_getattro` båda är ``NULL``.

source: An optional pointer to the function for setting and deleting attributes.
sv: En valfri pekare till funktionen för att ställa in och ta bort attribut.

source: This field is deprecated. When it is defined, it should point to a function that acts the same as the :c:member:`~PyTypeObject.tp_setattro` function, but taking a C string instead of a Python string object to give the attribute name.
sv: Detta fält är föråldrat. När det definieras bör det peka på en funktion som fungerar på samma sätt som :c:member:`~PyTypeObject.tp_setattro`-funktionen, men som tar en C-sträng istället för ett Python-strängobjekt för att ge attributnamnet.

source: Group: :c:member:`~PyTypeObject.tp_setattr`, :c:member:`~PyTypeObject.tp_setattro`
sv: Grupp: :c:member:`~PyTypeObject.tp_setattr`, :c:member:`~PyTypeObject.tp_setattro`

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_setattro`: a subtype inherits both :c:member:`~PyTypeObject.tp_setattr` and :c:member:`~PyTypeObject.tp_setattro` from its base type when the subtype's :c:member:`~PyTypeObject.tp_setattr` and :c:member:`~PyTypeObject.tp_setattro` are both ``NULL``.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_setattro`: en subtyp ärver både :c:member:`~PyTypeObject.tp_setattr` och :c:member:`~PyTypeObject.tp_setattro` från sin bastyp när subtypens :c:member:`~PyTypeObject.tp_setattr` och :c:member:`~PyTypeObject.tp_setattro` båda är ``NULL``.

source: Pointer to an additional structure that contains fields relevant only to objects which implement :term:`awaitable` and :term:`asynchronous iterator` protocols at the C-level. See :ref:`async-structs` for details.
sv: Pekare till en ytterligare struktur som innehåller fält som endast är relevanta för objekt som implementerar protokollen :term:`awaitable` och :term:`asynchronous iterator` på C-nivå. Se :ref:`async-structs` för detaljer.

source: Formerly known as ``tp_compare`` and ``tp_reserved``.
sv: Tidigare känd som ``tp_compare`` och ``tp_reserved``.

source: The :c:member:`~PyTypeObject.tp_as_async` field is not inherited, but the contained fields are inherited individually.
sv: Fältet :c:member:`~PyTypeObject.tp_as_async` ärvs inte, men de ingående fälten ärvs individuellt.

source: An optional pointer to a function that implements the built-in function :func:`repr`.
sv: En valfri pekare till en funktion som implementerar den inbyggda funktionen :func:`repr`.

source: The signature is the same as for :c:func:`PyObject_Repr`::
sv: Signaturen är densamma som för :c:func:`PyObject_Repr`::

source: The function must return a string or a Unicode object. Ideally, this function should return a string that, when passed to :func:`eval`, given a suitable environment, returns an object with the same value. If this is not feasible, it should return a string starting with ``'<'`` and ending with ``'>'`` from which both the type and the value of the object can be deduced.
sv: Funktionen måste returnera en sträng eller ett Unicode-objekt. Helst ska denna funktion returnera en sträng som, när den skickas till :func:`eval`, i en lämplig miljö, returnerar ett objekt med samma värde. Om detta inte är möjligt, bör den returnera en sträng som börjar med ``'<'`` och slutar med ``'>'`` från vilken både typen och värdet på objektet kan härledas.

source: **Default:**
sv: **Förval:**

source: When this field is not set, a string of the form ``<%s object at %p>`` is returned, where ``%s`` is replaced by the type name, and ``%p`` by the object's memory address.
sv: Om detta fält inte är inställt returneras en sträng av formen ``<%s object at %p>``, där ``%s`` ersätts av typnamnet och ``%p`` av objektets minnesadress.

source: Pointer to an additional structure that contains fields relevant only to objects which implement the number protocol. These fields are documented in :ref:`number-structs`.
sv: Pekare till en ytterligare struktur som innehåller fält som endast är relevanta för objekt som implementerar nummerprotokollet. Dessa fält är dokumenterade i :ref:`number-structs`.

source: The :c:member:`~PyTypeObject.tp_as_number` field is not inherited, but the contained fields are inherited individually.
sv: Fältet :c:member:`~PyTypeObject.tp_as_number` ärvs inte, men de ingående fälten ärvs individuellt.

source: Pointer to an additional structure that contains fields relevant only to objects which implement the sequence protocol. These fields are documented in :ref:`sequence-structs`.
sv: Pekare till en ytterligare struktur som innehåller fält som endast är relevanta för objekt som implementerar sekvensprotokollet. Dessa fält är dokumenterade i :ref:`sequence-structs`.

source: The :c:member:`~PyTypeObject.tp_as_sequence` field is not inherited, but the contained fields are inherited individually.
sv: Fältet :c:member:`~PyTypeObject.tp_as_sequence` ärvs inte, men de ingående fälten ärvs individuellt.

source: Pointer to an additional structure that contains fields relevant only to objects which implement the mapping protocol. These fields are documented in :ref:`mapping-structs`.
sv: Pekare till en ytterligare struktur som innehåller fält som endast är relevanta för objekt som implementerar mappningsprotokollet. Dessa fält är dokumenterade i :ref:`mapping-structs`.

source: The :c:member:`~PyTypeObject.tp_as_mapping` field is not inherited, but the contained fields are inherited individually.
sv: Fältet :c:member:`~PyTypeObject.tp_as_mapping` ärvs inte, men de ingående fälten ärvs individuellt.

source: An optional pointer to a function that implements the built-in function :func:`hash`.
sv: En valfri pekare till en funktion som implementerar den inbyggda funktionen :func:`hash`.

source: The signature is the same as for :c:func:`PyObject_Hash`::
sv: Signaturen är densamma som för :c:func:`PyObject_Hash`::
