Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: Typically, ``tp_vectorcall`` is overridden to optimize this process for specific :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_init`. When doing this for user-subclassable types, note that both can be overridden (using :py:func:`~object.__new__` and :py:func:`~object.__init__`, respectively).
sv: Vanligtvis är ``tp_vectorcall`` åsidosatt för att optimera denna process för specifika :c:member:`~PyTypeObject.tp_new` och :c:member:`~PyTypeObject.tp_init`. När du gör detta för användarsubklassbara typer, notera att båda kan åsidosättas (med :py:func:`~object.__new__` respektive :py:func:`~object.__init__`).

source: This field is never inherited.
sv: Detta fält är aldrig ärftligt.

source: (the field exists since 3.8 but it's only used since 3.9)
sv: (fältet har funnits sedan 3.8 men det används bara sedan 3.9)

source: Internal. Do not use.
sv: Internt. Får inte användas.

source: Static Types
sv: Statiska typer

source: Traditionally, types defined in C code are *static*, that is, a static :c:type:`PyTypeObject` structure is defined directly in code and initialized using :c:func:`PyType_Ready`.
sv: Traditionellt är typer som definieras i C-kod *statiska*, det vill säga en statisk :c:type:`PyTypeObject`-struktur definieras direkt i koden och initieras med :c:func:`PyType_Ready`.

source: This results in types that are limited relative to types defined in Python:
sv: Detta resulterar i typer som är begränsade i förhållande till de typer som definieras i Python:

source: Static types are limited to one base, i.e. they cannot use multiple inheritance.
sv: Statiska typer är begränsade till en bas, dvs. de kan inte använda multipel nedärvning.

source: Static type objects (but not necessarily their instances) are immutable. It is not possible to add or modify the type object's attributes from Python.
sv: Statiska typobjekt (men inte nödvändigtvis deras instanser) är oföränderliga. Det är inte möjligt att lägga till eller ändra typobjektets attribut från Python.

source: Static type objects are shared across :ref:`sub-interpreters <sub-interpreter-support>`, so they should not include any subinterpreter-specific state.
sv: Statiska typobjekt delas mellan :ref:`undertolkare <sub-interpreter-support>`, så de bör inte innehålla något undertolkarspecifikt tillstånd.

source: Also, since :c:type:`PyTypeObject` is only part of the :ref:`Limited API <limited-c-api>` as an opaque struct, any extension modules using static types must be compiled for a specific Python minor version.
sv: Eftersom :c:type:`PyTypeObject` endast är en del av :ref:`Limited API <limited-c-api>` som en opak struktur, måste alla tilläggsmoduler som använder statiska typer kompileras för en specifik mindre Python-version.

source: Heap Types
sv: Typer av högar

source: An alternative to :ref:`static types <static-types>` is *heap-allocated types*, or *heap types* for short, which correspond closely to classes created by Python's ``class`` statement. Heap types have the :c:macro:`Py_TPFLAGS_HEAPTYPE` flag set.
sv: Ett alternativ till :ref:``static types <static-types>`` är *heap-allocated types*, eller kort och gott *heap types*, som nära motsvarar klasser skapade av Pythons ``class``-sats. Heap-typer har flaggan :c:macro:`Py_TPFLAGS_HEAPTYPE` inställd.

source: This is done by filling a :c:type:`PyType_Spec` structure and calling :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases`, :c:func:`PyType_FromModuleAndSpec`, or :c:func:`PyType_FromMetaclass`.
sv: Detta görs genom att fylla en :c:type:`PyType_Spec`-struktur och anropa :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases`, :c:func:`PyType_FromModuleAndSpec`, eller :c:func:`PyType_FromMetaclass`.

source: Number Object Structures
sv: Strukturer för nummerobjekt

source: This structure holds pointers to the functions which an object uses to implement the number protocol. Each function is used by the function of similar name documented in the :ref:`number` section.
sv: Denna struktur innehåller pekare till de funktioner som ett objekt använder för att implementera nummerprotokollet. Varje funktion används av funktionen med liknande namn som dokumenteras i avsnittet :ref:`number`.

source: Here is the structure definition::
sv: Här är strukturdefinitionen::

source: typedef struct { binaryfunc nb_add; binaryfunc nb_subtract; binaryfunc nb_multiply; binaryfunc nb_remainder; binaryfunc nb_divmod; ternaryfunc nb_power; unaryfunc nb_negative; unaryfunc nb_positive; unaryfunc nb_absolute; inquiry nb_bool; unaryfunc nb_invert; binaryfunc nb_lshift; binaryfunc nb_rshift; binaryfunc nb_and; binaryfunc nb_xor; binaryfunc nb_or; unaryfunc nb_int; void *nb_reserved; unaryfunc nb_float; binaryfunc nb_inplace_add; binaryfunc nb_inplace_subtract; binaryfunc nb_inplace_multiply; binaryfunc nb_inplace_remainder; ternaryfunc nb_inplace_power; binaryfunc nb_inplace_lshift; binaryfunc nb_inplace_rshift; binaryfunc nb_inplace_and; binaryfunc nb_inplace_xor; binaryfunc nb_inplace_or; binaryfunc nb_floor_divide; binaryfunc nb_true_divide; binaryfunc nb_inplace_floor_divide; binaryfunc nb_inplace_true_divide; unaryfunc nb_index; binaryfunc nb_matrix_multiply; binaryfunc nb_inplace_matrix_multiply; } PyNumberMethods;
sv: typedef struct { binärfunktion nb_add; binärfunktion nb_subtrahera; binärfunktion nb_multiplicera; binaryfunc nb_remainder; binärfunktion nb_divmod; ternaryfunc nb_power; unaryfunc nb_negative; unaryfunc nb_positive; unaryfunc nb_absolute; förfrågan nb_bool; unaryfunc nb_invert; binärfunktion nb_lshift; binaryfunc nb_rshift; binärfunktion nb_and; binärfunktion nb_xor; binärfunktion nb_or; unaryfunc nb_int; void *nb_reserved; unaryfunc nb_float; binärfunktion nb_inplace_add; binaryfunc nb_inplace_subtract; binärfunktion nb_inplace_multiplicera; binärfunktion nb_inplace_remainder; ternaryfunc nb_inplace_power; binärfunktion nb_inplace_lshift; binärfunktion nb_inplace_rshift; binärfunktion nb_inplace_and; binärfunktion nb_inplace_xor; binärfunktion nb_inplace_or; binärfunktion nb_floor_divide; binaryfunc nb_true_divide; binaryfunc nb_inplace_floor_divide; binaryfunc nb_inplace_true_divide; unaryfunc nb_index; binärfunktion nb_matris_multiplicera; binärfunktion nb_inplace_matrix_multiply; } PyNumberMethods;

source: Binary and ternary functions must check the type of all their operands, and implement the necessary conversions (at least one of the operands is an instance of the defined type). If the operation is not defined for the given operands, binary and ternary functions must return ``Py_NotImplemented``, if another error occurred they must return ``NULL`` and set an exception.
sv: Binära och ternära funktioner måste kontrollera typen av alla sina operander och implementera nödvändiga konverteringar (minst en av operanderna är en instans av den definierade typen). Om operationen inte är definierad för de givna operanderna måste binära och ternära funktioner returnera ``Py_NotImplemented``, om ett annat fel inträffade måste de returnera ``NULL`` och ange ett undantag.

source: The :c:member:`~PyNumberMethods.nb_reserved` field should always be ``NULL``. It was previously called :c:member:`!nb_long`, and was renamed in Python 3.0.1.
sv: Fältet :c:member:`~PyNumberMethods.nb_reserved` bör alltid vara ``NULL``. Det kallades tidigare :c:member:`!nb_long`, och döptes om i Python 3.0.1.

source: Mapping Object Structures
sv: Mappning av objektstrukturer

source: This structure holds pointers to the functions which an object uses to implement the mapping protocol. It has three members:
sv: Denna struktur innehåller pekare till de funktioner som ett objekt använder för att implementera mappningsprotokollet. Den har tre medlemmar:

source: This function is used by :c:func:`PyMapping_Size` and :c:func:`PyObject_Size`, and has the same signature. This slot may be set to ``NULL`` if the object has no defined length.
sv: Denna funktion används av :c:func:`PyMapping_Size` och :c:func:`PyObject_Size`, och har samma signatur. Denna slot kan sättas till ``NULL`` om objektet inte har någon definierad längd.

source: This function is used by :c:func:`PyObject_GetItem` and :c:func:`PySequence_GetSlice`, and has the same signature as :c:func:`!PyObject_GetItem`. This slot must be filled for the :c:func:`PyMapping_Check` function to return ``1``, it can be ``NULL`` otherwise.
sv: Denna funktion används av :c:func:`PyObject_GetItem` och :c:func:`PySequence_GetSlice`, och har samma signatur som :c:func:`!PyObject_GetItem`. Denna slot måste vara fylld för att funktionen :c:func:`PyMapping_Check` ska returnera ``1``, annars kan den vara ``NULL``.

source: This function is used by :c:func:`PyObject_SetItem`, :c:func:`PyObject_DelItem`, :c:func:`PySequence_SetSlice` and :c:func:`PySequence_DelSlice`. It has the same signature as :c:func:`!PyObject_SetItem`, but *v* can also be set to ``NULL`` to delete an item. If this slot is ``NULL``, the object does not support item assignment and deletion.
sv: Denna funktion används av :c:func:`PyObject_SetItem`, :c:func:`PyObject_DelItem`, :c:func:`PySequence_SetSlice` och :c:func:`PySequence_DelSlice`. Den har samma signatur som :c:func:`!PyObject_SetItem`, men *v* kan också sättas till ``NULL`` för att radera ett objekt. Om denna slot är ``NULL`` har objektet inte stöd för tilldelning och borttagning av objekt.

source: Sequence Object Structures
sv: Strukturer för sekvensobjekt

source: This structure holds pointers to the functions which an object uses to implement the sequence protocol.
sv: Denna struktur innehåller pekare till de funktioner som ett objekt använder för att implementera sekvensprotokollet.

source: This function is used by :c:func:`PySequence_Size` and :c:func:`PyObject_Size`, and has the same signature. It is also used for handling negative indices via the :c:member:`~PySequenceMethods.sq_item` and the :c:member:`~PySequenceMethods.sq_ass_item` slots.
sv: Denna funktion används av :c:func:`PySequence_Size` och :c:func:`PyObject_Size`, och har samma signatur. Den används också för att hantera negativa index via :c:member:`~PySequenceMethods.sq_item` och :c:member:`~PySequenceMethods.sq_ass_item`.

source: This function is used by :c:func:`PySequence_Concat` and has the same signature. It is also used by the ``+`` operator, after trying the numeric addition via the :c:member:`~PyNumberMethods.nb_add` slot.
sv: Denna funktion används av :c:func:`PySequence_Concat` och har samma signatur. Den används också av operatorn ``+``, efter att ha försökt numerisk addition via :c:member:`~PyNumberMethods.nb_add` slot.

source: This function is used by :c:func:`PySequence_Repeat` and has the same signature. It is also used by the ``*`` operator, after trying numeric multiplication via the :c:member:`~PyNumberMethods.nb_multiply` slot.
sv: Denna funktion används av :c:func:`PySequence_Repeat` och har samma signatur. Den används också av operatorn ``*``, efter att ha försökt numerisk multiplikation via :c:member:`~PyNumberMethods.nb_multiply` slot.

source: This function is used by :c:func:`PySequence_GetItem` and has the same signature. It is also used by :c:func:`PyObject_GetItem`, after trying the subscription via the :c:member:`~PyMappingMethods.mp_subscript` slot. This slot must be filled for the :c:func:`PySequence_Check` function to return ``1``, it can be ``NULL`` otherwise.
sv: Denna funktion används av :c:func:`PySequence_GetItem` och har samma signatur. Den används också av :c:func:`PyObject_GetItem`, efter att ha provat prenumerationen via :c:member:`~PyMappingMethods.mp_subscript` slot. Denna slot måste vara fylld för att funktionen :c:func:`PySequence_Check` skall returnera ``1``, annars kan den vara ``NULL``.

source: Negative indexes are handled as follows: if the :c:member:`~PySequenceMethods.sq_length` slot is filled, it is called and the sequence length is used to compute a positive index which is passed to :c:member:`~PySequenceMethods.sq_item`. If :c:member:`!sq_length` is ``NULL``, the index is passed as is to the function.
sv: Negativa index hanteras på följande sätt: om :c:member:`~PySequenceMethods.sq_length` är fylld, anropas den och sekvenslängden används för att beräkna ett positivt index som skickas till :c:member:`~PySequenceMethods.sq_item`. Om :c:member:`!sq_length` är ``NULL``, skickas indexet som det är till funktionen.

source: This function is used by :c:func:`PySequence_SetItem` and has the same signature. It is also used by :c:func:`PyObject_SetItem` and :c:func:`PyObject_DelItem`, after trying the item assignment and deletion via the :c:member:`~PyMappingMethods.mp_ass_subscript` slot. This slot may be left to ``NULL`` if the object does not support item assignment and deletion.
sv: Denna funktion används av :c:func:`PySequence_SetItem` och har samma signatur. Den används också av :c:func:`PyObject_SetItem` och :c:func:`PyObject_DelItem`, efter att ha försökt tilldelning och borttagning av objekt via :c:member:`~PyMappingMethods.mp_ass_subscript` slot. Denna slot kan lämnas till ``NULL`` om objektet inte stöder tilldelning och borttagning av objekt.

source: This function may be used by :c:func:`PySequence_Contains` and has the same signature. This slot may be left to ``NULL``, in this case :c:func:`!PySequence_Contains` simply traverses the sequence until it finds a match.
sv: Denna funktion kan användas av :c:func:`PySequence_Contains` och har samma signatur. Denna plats kan lämnas till ``NULL``, i detta fall kommer :c:func:`!PySequence_Contains` helt enkelt att korsa sekvensen tills den hittar en matchning.

source: This function is used by :c:func:`PySequence_InPlaceConcat` and has the same signature. It should modify its first operand, and return it. This slot may be left to ``NULL``, in this case :c:func:`!PySequence_InPlaceConcat` will fall back to :c:func:`PySequence_Concat`. It is also used by the augmented assignment ``+=``, after trying numeric in-place addition via the :c:member:`~PyNumberMethods.nb_inplace_add` slot.
sv: Denna funktion används av :c:func:`PySequence_InPlaceConcat` och har samma signatur. Den bör modifiera sin första operand och returnera den. Denna plats kan lämnas till ``NULL``, i detta fall kommer :c:func:`!PySequence_InPlaceConcat` att falla tillbaka till :c:func:`PySequence_Concat`. Den används också av den utökade tilldelningen ``+=``, efter att ha försökt numerisk in-place addition via :c:member:`~PyNumberMethods.nb_inplace_add` slot.

source: This function is used by :c:func:`PySequence_InPlaceRepeat` and has the same signature. It should modify its first operand, and return it. This slot may be left to ``NULL``, in this case :c:func:`!PySequence_InPlaceRepeat` will fall back to :c:func:`PySequence_Repeat`. It is also used by the augmented assignment ``*=``, after trying numeric in-place multiplication via the :c:member:`~PyNumberMethods.nb_inplace_multiply` slot.
sv: Denna funktion används av :c:func:`PySequence_InPlaceRepeat` och har samma signatur. Den bör modifiera sin första operand och returnera den. Denna plats kan lämnas till ``NULL``, i detta fall kommer :c:func:`!PySequence_InPlaceRepeat` att falla tillbaka till :c:func:`PySequence_Repeat`. Den används också av den utökade tilldelningen ``*=``, efter att ha försökt numerisk multiplikation på plats via :c:member:`~PyNumberMethods.nb_inplace_multiply` slot.

source: Buffer Object Structures
sv: Strukturer för buffertobjekt

source: This structure holds pointers to the functions required by the :ref:`Buffer protocol <bufferobjects>`. The protocol defines how an exporter object can expose its internal data to consumer objects.
sv: Denna struktur innehåller pekare till de funktioner som krävs enligt :ref:`Buffer protocol <bufferobjects>`. Protokollet definierar hur ett exportobjekt kan exponera sina interna data till konsumentobjekt.

source: The signature of this function is::
sv: Signaturen för denna funktion är::

source: Handle a request to *exporter* to fill in *view* as specified by *flags*. Except for point (3), an implementation of this function MUST take these steps:
sv: Hantera en begäran till *exporter* om att fylla i *view* enligt specifikationen i *flags*. Med undantag för punkt (3) MÅSTE en implementering av denna funktion vidta följande steg:

source: Check if the request can be met. If not, raise :exc:`BufferError`, set :c:expr:`view->obj` to ``NULL`` and return ``-1``.
sv: Kontrollera om begäran kan uppfyllas. Om inte, skapa :exc:`BufferError`, sätt :c:expr:`view->obj` till ``NULL`` och returnera ``-1``.

source: Fill in the requested fields.
sv: Fyll i de begärda fälten.

source: Increment an internal counter for the number of exports.
sv: Öka en intern räknare för antalet exporter.

source: Set :c:expr:`view->obj` to *exporter* and increment :c:expr:`view->obj`.
sv: Sätt :c:expr:`view->obj` till *exporter* och inkrementera :c:expr:`view->obj`.

source: Return ``0``.
sv: Returnera ``0``.

source: If *exporter* is part of a chain or tree of buffer providers, two main schemes can be used:
sv: Om *exporter* är en del av en kedja eller ett träd av buffertleverantörer kan två huvudsakliga system användas:

source: Re-export: Each member of the tree acts as the exporting object and sets :c:expr:`view->obj` to a new reference to itself.
sv: Återexportera: Varje medlem i trädet fungerar som det exporterande objektet och sätter :c:expr:`view->obj` till en ny referens till sig själv.

source: Redirect: The buffer request is redirected to the root object of the tree. Here, :c:expr:`view->obj` will be a new reference to the root object.
sv: Redirect: Buffertbegäran omdirigeras till trädets rotobjekt. Här kommer :c:expr:`view->obj` att vara en ny referens till rotobjektet.

source: The individual fields of *view* are described in section :ref:`Buffer structure <buffer-structure>`, the rules how an exporter must react to specific requests are in section :ref:`Buffer request types <buffer-request-types>`.
sv: De enskilda fälten i *view* beskrivs i avsnitt :ref:`Buffertstruktur <buffer-structure>`, reglerna för hur en exportör måste reagera på specifika förfrågningar finns i avsnitt :ref:`Buffertförfrågningstyper <buffer-request-types>`.

source: All memory pointed to in the :c:type:`Py_buffer` structure belongs to the exporter and must remain valid until there are no consumers left. :c:member:`~Py_buffer.format`, :c:member:`~Py_buffer.shape`, :c:member:`~Py_buffer.strides`, :c:member:`~Py_buffer.suboffsets` and :c:member:`~Py_buffer.internal` are read-only for the consumer.
sv: Allt minne som pekas ut i :c:type:`Py_buffer`-strukturen tillhör exportören och måste förbli giltigt tills det inte finns några konsumenter kvar. :c:member:`~Py_buffer.format`, :c:member:`~Py_buffer.shape`, :c:member:`~Py_buffer.strides`, :c:member:`~Py_buffer.suboffsets` och :c:member:`~Py_buffer.internal` är skrivskyddade för konsumenten.

source: :c:func:`PyBuffer_FillInfo` provides an easy way of exposing a simple bytes buffer while dealing correctly with all request types.
sv: :c:func:`PyBuffer_FillInfo` ger ett enkelt sätt att exponera en enkel bytesbuffert samtidigt som alla typer av förfrågningar hanteras korrekt.

source: :c:func:`PyObject_GetBuffer` is the interface for the consumer that wraps this function.
sv: :c:func:`PyObject_GetBuffer` är gränssnittet för den konsument som omsluter denna funktion.

source: Handle a request to release the resources of the buffer. If no resources need to be released, :c:member:`PyBufferProcs.bf_releasebuffer` may be ``NULL``. Otherwise, a standard implementation of this function will take these optional steps:
sv: Hanterar en begäran om att frigöra buffertens resurser. Om inga resurser behöver frigöras kan :c:member:`PyBufferProcs.bf_releasebuffer` vara ``NULL``. Annars kommer en standardimplementering av denna funktion att vidta dessa valfria steg:

source: Decrement an internal counter for the number of exports.
sv: Minskar en intern räknare för antalet exporter.

source: If the counter is ``0``, free all memory associated with *view*.
sv: Om räknaren är ``0``, frigör allt minne som är associerat med *view*.

source: The exporter MUST use the :c:member:`~Py_buffer.internal` field to keep track of buffer-specific resources. This field is guaranteed to remain constant, while a consumer MAY pass a copy of the original buffer as the *view* argument.
sv: Exportören MÅSTE använda fältet :c:member:`~Py_buffer.internal` för att hålla reda på buffertspecifika resurser. Detta fält är garanterat konstant, medan en konsument KAN skicka en kopia av den ursprungliga bufferten som *view*-argument.

source: This function MUST NOT decrement :c:expr:`view->obj`, since that is done automatically in :c:func:`PyBuffer_Release` (this scheme is useful for breaking reference cycles).
sv: Denna funktion FÅR INTE decimera :c:expr:`view->obj`, eftersom det görs automatiskt i :c:func:`PyBuffer_Release` (detta system är användbart för att bryta referenscykler).

source: :c:func:`PyBuffer_Release` is the interface for the consumer that wraps this function.
sv: :c:func:`PyBuffer_Release` är gränssnittet för den konsument som omsluter denna funktion.

source: Async Object Structures
sv: Strukturer för asynkrona objekt

source: This structure holds pointers to the functions required to implement :term:`awaitable` and :term:`asynchronous iterator` objects.
sv: Denna struktur innehåller pekare till de funktioner som krävs för att implementera objekten :term:`awaitable` och :term:`asynchronous iterator`.

source: The returned object must be an :term:`iterator`, i.e. :c:func:`PyIter_Check` must return ``1`` for it.
sv: Det returnerade objektet måste vara en :term:`iterator`, d.v.s. :c:func:`PyIter_Check` måste returnera ``1`` för det.

source: This slot may be set to ``NULL`` if an object is not an :term:`awaitable`.
sv: Denna slot kan sättas till ``NULL`` om ett objekt inte är en :term:`awaitable`.

source: Must return an :term:`asynchronous iterator` object. See :meth:`~object.__anext__` for details.
sv: Måste returnera ett :term:`asynkron iterator`-objekt. Se :meth:`~object.__anext__` för detaljer.

source: This slot may be set to ``NULL`` if an object does not implement asynchronous iteration protocol.
sv: Denna slot kan sättas till ``NULL`` om ett objekt inte implementerar asynkront iterationsprotokoll.

source: Must return an :term:`awaitable` object. See :meth:`~object.__anext__` for details. This slot may be set to ``NULL``.
sv: Måste returnera ett :term:`awaitable`-objekt. Se :meth:`~object.__anext__` för detaljer. Denna slot kan sättas till ``NULL``.

source: See :c:func:`PyIter_Send` for details. This slot may be set to ``NULL``.
sv: Se :c:func:`PyIter_Send` för detaljer. Denna slot kan sättas till ``NULL``.

source: Slot Type typedefs
sv: Slotstyp typedef
