Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: The :c:member:`~PyTypeObject.tp_new` function should call ``subtype->tp_alloc(subtype, nitems)`` to allocate space for the object, and then do only as much further initialization as is absolutely necessary. Initialization that can safely be ignored or repeated should be placed in the :c:member:`~PyTypeObject.tp_init` handler. A good rule of thumb is that for immutable types, all initialization should take place in :c:member:`~PyTypeObject.tp_new`, while for mutable types, most initialization should be deferred to :c:member:`~PyTypeObject.tp_init`.
sv: Funktionen :c:member:`~PyTypeObject.tp_new` bör anropa ``subtype->tp_alloc(subtype, nitems)`` för att allokera utrymme för objektet, och sedan bara göra så mycket ytterligare initialisering som är absolut nödvändigt. Initialisering som säkert kan ignoreras eller upprepas bör placeras i handlaren :c:member:`~PyTypeObject.tp_init`. En bra tumregel är att för oföränderliga typer bör all initialisering ske i :c:member:`~PyTypeObject.tp_new`, medan för föränderliga typer bör de flesta initialiseringar skjutas upp till :c:member:`~PyTypeObject.tp_init`.

source: Set the :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flag to disallow creating instances of the type in Python.
sv: Ange flaggan :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` för att inte tillåta att instanser av typen skapas i Python.

source: This field is inherited by subtypes, except it is not inherited by :ref:`static types <static-types>` whose :c:member:`~PyTypeObject.tp_base` is ``NULL`` or ``&PyBaseObject_Type``.
sv: Detta fält ärvs av subtyper, förutom att det inte ärvs av :ref:`static types <static-types>` vars :c:member:`~PyTypeObject.tp_base` är ``NULL`` eller ``&amp;PyBaseObject_Type``.

source: For :ref:`static types <static-types>` this field has no default. This means if the slot is defined as ``NULL``, the type cannot be called to create new instances; presumably there is some other way to create instances, like a factory function.
sv: För :ref:`static types <static-types>` har detta fält ingen standard. Detta innebär att om slot definieras som ``NULL`` kan typen inte anropas för att skapa nya instanser; förmodligen finns det något annat sätt att skapa instanser, som en fabriksfunktion.

source: An optional pointer to an instance deallocation function. Its signature is::
sv: En valfri pekare till en funktion för avallokering av instanser. Dess signatur är::

source: This function must free the memory allocated by :c:member:`~PyTypeObject.tp_alloc`.
sv: Denna funktion måste frigöra det minne som allokerats av :c:member:`~PyTypeObject.tp_alloc`.

source: Static subtypes inherit this slot, which will be :c:func:`PyObject_Free` if inherited from :class:`object`. Exception: If the type supports garbage collection (i.e., the :c:macro:`Py_TPFLAGS_HAVE_GC` flag is set in :c:member:`~PyTypeObject.tp_flags`) and it would inherit :c:func:`PyObject_Free`, then this slot is not inherited but instead defaults to :c:func:`PyObject_GC_Del`.
sv: Statiska subtyper ärver denna slot, som kommer att vara :c:func:`PyObject_Free` om den ärvs från :class:`object`. Undantag för detta: Om typen stöder garbage collection (dvs. flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` är inställd i :c:member:`~PyTypeObject.tp_flags`) och den skulle ärva :c:func:`PyObject_Free`, ärvs inte denna slot utan är istället standardvärdet för :c:func:`PyObject_GC_Del`.

source: For :ref:`heap subtypes <heap-types>`, this slot defaults to a deallocator suitable to match :c:func:`PyType_GenericAlloc` and the value of the :c:macro:`Py_TPFLAGS_HAVE_GC` flag.
sv: För :ref:``heap subtypes <heap-types>``, är standardvärdet för denna plats en deallokator som är lämplig för att matcha :c:func:`PyType_GenericAlloc` och värdet på flaggan :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: An optional pointer to a function called by the garbage collector.
sv: En valfri pekare till en funktion som anropas av skräpsamlaren.

source: The garbage collector needs to know whether a particular object is collectible or not. Normally, it is sufficient to look at the object's type's :c:member:`~PyTypeObject.tp_flags` field, and check the :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit. But some types have a mixture of statically and dynamically allocated instances, and the statically allocated instances are not collectible. Such types should define this function; it should return ``1`` for a collectible instance, and ``0`` for a non-collectible instance. The signature is::
sv: Garbage collector behöver veta om ett visst objekt är insamlingsbart eller inte. Normalt räcker det att titta på objekttypens fält :c:member:`~PyTypeObject.tp_flags` och kontrollera flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC`. Men vissa typer har en blandning av statiskt och dynamiskt allokerade instanser, och de statiskt allokerade instanserna är inte insamlingsbara. Sådana typer bör definiera denna funktion; den bör returnera ``1`` för en samlingsbar instans och ``0`` för en icke-samlingsbar instans. Signaturen är::

source: (The only example of this are types themselves. The metatype, :c:data:`PyType_Type`, defines this function to distinguish between statically and :ref:`dynamically allocated types <heap-types>`.)
sv: (Det enda exemplet på detta är typerna själva. Metatypen, :c:data:`PyType_Type`, definierar den här funktionen för att skilja mellan statiskt och :ref:`dynamiskt allokerade typer <heap-types>`.)

source: This slot has no default. If this field is ``NULL``, :c:macro:`Py_TPFLAGS_HAVE_GC` is used as the functional equivalent.
sv: Denna slot har ingen standard. Om detta fält är ``NULL``, används :c:macro:`Py_TPFLAGS_HAVE_GC` som funktionell motsvarighet.

source: Tuple of base types.
sv: Tupel av bastyper.

source: This field should be set to ``NULL`` and treated as read-only. Python will fill it in when the type is :c:func:`initialized <PyType_Ready>`.
sv: Detta fält bör sättas till ``NULL`` och behandlas som skrivskyddat. Python kommer att fylla i det när typen är :c:func:`initialiserad <PyType_Ready>`.

source: For dynamically created classes, the ``Py_tp_bases`` :c:type:`slot <PyType_Slot>` can be used instead of the *bases* argument of :c:func:`PyType_FromSpecWithBases`. The argument form is preferred.
sv: För dynamiskt skapade klasser kan ``Py_tp_bases`` :c:type:`slot <PyType_Slot>` användas istället för *bases*-argumentet i :c:func:`PyType_FromSpecWithBases`. Argumentformen är att föredra.

source: Multiple inheritance does not work well for statically defined types. If you set ``tp_bases`` to a tuple, Python will not raise an error, but some slots will only be inherited from the first base.
sv: Multipel nedärvning fungerar inte bra för statiskt definierade typer. Om du ställer in ``tp_bases`` till en tupel kommer Python inte att ge upphov till ett fel, men vissa slots kommer endast att ärvas från den första basen.

source: This field is not inherited.
sv: Detta fält är inte ärftligt.

source: Tuple containing the expanded set of base types, starting with the type itself and ending with :class:`object`, in Method Resolution Order.
sv: Tupel som innehåller den utökade uppsättningen bastyper, som börjar med typen själv och slutar med :class:`object`, i Method Resolution Order.

source: This field is not inherited; it is calculated fresh by :c:func:`PyType_Ready`.
sv: Detta fält är inte ärftligt, utan beräknas av :c:func:`PyType_Ready`.

source: Unused. Internal use only.
sv: Oanvänd. Endast för internt bruk.

source: A collection of subclasses. Internal use only. May be an invalid pointer.
sv: En samling av underklasser. Endast för internt bruk. Kan vara en ogiltig pekare.

source: To get a list of subclasses, call the Python method :py:meth:`~type.__subclasses__`.
sv: För att få en lista över underklasser anropar du Python-metoden :py:meth:`~type.__subclasses__`.

source: For some types, this field does not hold a valid :c:expr:`PyObject*`. The type was changed to :c:expr:`void*` to indicate this.
sv: För vissa typer innehåller detta fält inte ett giltigt :c:expr:`PyObject*`. Typen ändrades till :c:expr:`void*` för att ange detta.

source: Weak reference list head, for weak references to this type object. Not inherited. Internal use only.
sv: Svag referenslistans huvud, för svaga referenser till detta typobjekt. Ärvs inte. Endast för internt bruk.

source: Internals detail: For the static builtin types this is always ``NULL``, even if weakrefs are added. Instead, the weakrefs for each are stored on ``PyInterpreterState``. Use the public C-API or the internal ``_PyObject_GET_WEAKREFS_LISTPTR()`` macro to avoid the distinction.
sv: Intern detalj: För de statiska inbyggda typerna är detta alltid ``NULL``, även om weakrefs läggs till. Istället lagras weakrefs för var och en på ``PyInterpreterState``. Använd det publika C-API:et eller det interna makrot ``_PyObject_GET_WEAKREFS_LISTPTR()`` för att undvika skillnaden.

source: This field is deprecated. Use :c:member:`~PyTypeObject.tp_finalize` instead.
sv: Detta fält är föråldrat. Använd :c:member:`~PyTypeObject.tp_finalize` istället.

source: Used to index into the method cache. Internal use only.
sv: Används för att indexera till metodcachen. Endast för internt bruk.

source: An optional pointer to an instance finalization function. This is the C implementation of the :meth:`~object.__del__` special method. Its signature is::
sv: En valfri pekare till en funktion för att avsluta en instans. Detta är C-implementeringen av specialmetoden :meth:`~object.__del__`. Dess signatur är::

source: The primary purpose of finalization is to perform any non-trivial cleanup that must be performed before the object is destroyed, while the object and any other objects it directly or indirectly references are still in a consistent state. The finalizer is allowed to execute arbitrary Python code.
sv: Det primära syftet med finalization är att utföra alla icke-triviala rensningar som måste utföras innan objektet förstörs, medan objektet och alla andra objekt som det direkt eller indirekt refererar till fortfarande är i ett konsekvent tillstånd. Finalizern tillåts exekvera godtycklig Python-kod.

source: Before Python automatically finalizes an object, some of the object's direct or indirect referents might have themselves been automatically finalized. However, none of the referents will have been automatically cleared (:c:member:`~PyTypeObject.tp_clear`) yet.
sv: Innan Python automatiskt finaliserar ett objekt kan några av objektets direkta eller indirekta referenter själva ha finaliserats automatiskt. Ingen av referenterna kommer dock att ha blivit automatiskt rensade (:c:member:`~PyTypeObject.tp_clear`) ännu.

source: Other non-finalized objects might still be using a finalized object, so the finalizer must leave the object in a sane state (e.g., invariants are still met).
sv: Andra icke-finaliserade objekt kan fortfarande använda ett finaliserat objekt, så finaliseraren måste lämna objektet i ett sunt tillstånd (t.ex. invarianter är fortfarande uppfyllda).

source: After Python automatically finalizes an object, Python might start automatically clearing (:c:member:`~PyTypeObject.tp_clear`) the object and its referents (direct and indirect). Cleared objects are not guaranteed to be in a consistent state; a finalized object must be able to tolerate cleared referents.
sv: Efter att Python automatiskt har slutfört ett objekt kan Python automatiskt börja rensa (:c:member:`~PyTypeObject.tp_clear`) objektet och dess referenter (direkta och indirekta). Rensade objekt garanteras inte att vara i ett konsekvent tillstånd; ett färdigställt objekt måste kunna tolerera rensade referenter.

source: An object is not guaranteed to be automatically finalized before its destructor (:c:member:`~PyTypeObject.tp_dealloc`) is called. It is recommended to call :c:func:`PyObject_CallFinalizerFromDealloc` at the beginning of :c:member:`!tp_dealloc` to guarantee that the object is always finalized before destruction.
sv: Det är inte garanterat att ett objekt automatiskt finaliseras innan dess destruktor (:c:member:`~PyTypeObject.tp_dealloc`) anropas. Det rekommenderas att anropa :c:func:`PyObject_CallFinalizerFromDealloc` i början av :c:member:`!tp_dealloc` för att garantera att objektet alltid slutförs innan det förstörs.

source: The :c:member:`~PyTypeObject.tp_finalize` function can be called from any thread, although the :term:`GIL` will be held.
sv: Funktionen :c:member:`~PyTypeObject.tp_finalize` kan anropas från valfri tråd, även om :term:`GIL` kommer att hållas kvar.

source: The :c:member:`!tp_finalize` function can be called during shutdown, after some global variables have been deleted. See the documentation of the :meth:`~object.__del__` method for details.
sv: Funktionen :c:member:`!tp_finalize` kan anropas under nedstängning, efter att vissa globala variabler har tagits bort. Se dokumentationen för metoden :meth:`~object.__del__` för detaljer.

source: When Python finalizes an object, it behaves like the following algorithm:
sv: När Python finaliserar ett objekt beter det sig som följande algoritm:

source: Python might mark the object as *finalized*. Currently, Python always marks objects whose type supports garbage collection (i.e., the :c:macro:`Py_TPFLAGS_HAVE_GC` flag is set in :c:member:`~PyTypeObject.tp_flags`) and never marks other types of objects; this might change in a future version.
sv: Python kan markera objektet som *finalized*. För närvarande markerar Python alltid objekt vars typ stöder garbage collection (dvs. flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` är inställd i :c:member:`~PyTypeObject.tp_flags`) och markerar aldrig andra typer av objekt; detta kan ändras i en framtida version.

source: If the object is not marked as *finalized* and its :c:member:`!tp_finalize` finalizer function is non-``NULL``, the finalizer function is called.
sv: Om objektet inte är markerat som *finalized* och dess :c:member:`!tp_finalize` finalizer-funktion är icke-``NULL``, anropas finalizer-funktionen.

source: If the finalizer function was called and the finalizer made the object reachable (i.e., there is a reference to the object and it is not a member of a :term:`cyclic isolate`), then the finalizer is said to have *resurrected* the object. It is unspecified whether the finalizer can also resurrect the object by adding a new reference to the object that does not make it reachable, i.e., the object is (still) a member of a cyclic isolate.
sv: Om finalizer-funktionen anropades och finalizer gjorde objektet nåbart (dvs. det finns en referens till objektet och det är inte medlem i ett :term:`cykliskt isolat`), sägs finalizer ha *återuppväckt* objektet. Det är ospecificerat om finalizern också kan återuppliva objektet genom att lägga till en ny referens till objektet som inte gör det nåbart, dvs. objektet är (fortfarande) medlem i ett cykliskt isolat.

source: If the finalizer resurrected the object, the object's pending destruction is canceled and the object's *finalized* mark might be removed if present. Currently, Python never removes the *finalized* mark; this might change in a future version.
sv: Om finalizer återuppväckte objektet avbryts objektets väntande förstörelse och objektets *finalized*-märke kan tas bort om det finns. För närvarande tar Python aldrig bort *finalized*-markeringen; detta kan ändras i en framtida version.

source: *Automatic finalization* refers to any finalization performed by Python except via calls to :c:func:`PyObject_CallFinalizer` or :c:func:`PyObject_CallFinalizerFromDealloc`. No guarantees are made about when, if, or how often an object is automatically finalized, except:
sv: *Automatisk finalisering* avser all finalisering som utförs av Python utom via anrop till :c:func:`PyObject_CallFinalizer` eller :c:func:`PyObject_CallFinalizerFromDealloc`. Inga garantier ges för när, om eller hur ofta ett objekt automatiskt slutförs, förutom:

source: Python will not automatically finalize an object if it is reachable, i.e., there is a reference to it and it is not a member of a :term:`cyclic isolate`.
sv: Python kommer inte automatiskt att avsluta ett objekt om det är nåbart, dvs. det finns en referens till det och det är inte en medlem av en :term:`cyklisk isolat`.

source: Python will not automatically finalize an object if finalizing it would not mark the object as *finalized*. Currently, this applies to objects whose type does not support garbage collection, i.e., the :c:macro:`Py_TPFLAGS_HAVE_GC` flag is not set. Such objects can still be manually finalized by calling :c:func:`PyObject_CallFinalizer` or :c:func:`PyObject_CallFinalizerFromDealloc`.
sv: Python kommer inte automatiskt att slutföra ett objekt om det inte skulle markera objektet som *slutfört*. För närvarande gäller detta för objekt vars typ inte stöder garbage collection, dvs. flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` är inte inställd. Sådana objekt kan fortfarande slutföras manuellt genom att anropa :c:func:`PyObject_CallFinalizer` eller :c:func:`PyObject_CallFinalizerFromDealloc`.

source: Python will not automatically finalize any two members of a :term:`cyclic isolate` concurrently.
sv: Python kommer inte automatiskt att slutföra två medlemmar av en :term:`cyklisk isolat` samtidigt.

source: Python will not automatically finalize an object after it has automatically cleared (:c:member:`~PyTypeObject.tp_clear`) the object.
sv: Python kommer inte automatiskt att slutföra ett objekt efter att det automatiskt har rensat (:c:member:`~PyTypeObject.tp_clear`) objektet.

source: If an object is a member of a :term:`cyclic isolate`, Python will not automatically finalize it after automatically clearing (see :c:member:`~PyTypeObject.tp_clear`) any other member.
sv: Om ett objekt är medlem i ett :term:`cykliskt isolat`, kommer Python inte automatiskt att slutföra det efter att automatiskt ha rensat (se :c:member:`~PyTypeObject.tp_clear`) någon annan medlem.

source: Python will automatically finalize every member of a :term:`cyclic isolate` before it automatically clears (see :c:member:`~PyTypeObject.tp_clear`) any of them.
sv: Python kommer automatiskt att slutföra varje medlem i en :term:`cyklisk isolat` innan den automatiskt rensar (se :c:member:`~PyTypeObject.tp_clear`) någon av dem.

source: If Python is going to automatically clear an object (:c:member:`~PyTypeObject.tp_clear`), it will automatically finalize the object first.
sv: Om Python automatiskt ska rensa ett objekt (:c:member:`~PyTypeObject.tp_clear`), kommer det automatiskt att slutföra objektet först.

source: Python currently only automatically finalizes objects that are members of a :term:`cyclic isolate`, but future versions might finalize objects regularly before their destruction.
sv: Python slutför för närvarande endast automatiskt objekt som är medlemmar i en :term:`cykliskt isolat`, men framtida versioner kan komma att slutföra objekt regelbundet innan de förstörs.

source: To manually finalize an object, do not call this function directly; call :c:func:`PyObject_CallFinalizer` or :c:func:`PyObject_CallFinalizerFromDealloc` instead.
sv: Om du vill slutföra ett objekt manuellt ska du inte anropa den här funktionen direkt, utan anropa istället :c:func:`PyObject_CallFinalizer` eller :c:func:`PyObject_CallFinalizerFromDealloc`.

source: :c:member:`~PyTypeObject.tp_finalize` should leave the current exception status unchanged. The recommended way to write a non-trivial finalizer is to back up the exception at the beginning by calling :c:func:`PyErr_GetRaisedException` and restore the exception at the end by calling :c:func:`PyErr_SetRaisedException`. If an exception is encountered in the middle of the finalizer, log and clear it with :c:func:`PyErr_WriteUnraisable` or :c:func:`PyErr_FormatUnraisable`. For example::
sv: :c:member:`~PyTypeObject.tp_finalize` bör lämna den aktuella undantagsstatusen oförändrad. Det rekommenderade sättet att skriva en icke-trivial finalizer är att säkerhetskopiera undantaget i början genom att anropa :c:func:`PyErr_GetRaisedException` och återställa undantaget i slutet genom att anropa :c:func:`PyErr_SetRaisedException`. Om ett undantag påträffas i mitten av finalizer, logga och rensa det med :c:func:`PyErr_WriteUnraisable` eller :c:func:`PyErr_FormatUnraisable`. Till exempel::

source: static void foo_finalize(PyObject *self) { // Save the current exception, if any. PyObject *exc = PyErr_GetRaisedException(); // ... if (do_something_that_might_raise() != success_indicator) { PyErr_WriteUnraisable(self); goto done; } done: // Restore the saved exception. This silently discards any exception // raised above, so be sure to call PyErr_WriteUnraisable first if // necessary. PyErr_SetRaisedException(exc); }
sv: statiskt void foo_finalize(PyObject *self) { // Spara det aktuella undantaget, om det finns något. PyObject *exc = PyErr_GetRaisedException(); // ... if (do_something_that_might_raise() != success_indicator) { PyErr_WriteUnraisable(self); goto done; } done: // Återställer det sparade undantaget. Detta förkastar i tysthet alla undantag // som tagits upp ovan, så se till att anropa PyErr_WriteUnraisable först om // nödvändigt. PyErr_SetRaisedException(exc); }

source: Before version 3.8 it was necessary to set the :c:macro:`Py_TPFLAGS_HAVE_FINALIZE` flags bit in order for this field to be used. This is no longer required.
sv: Före version 3.8 var det nödvändigt att sätta flaggbiten :c:macro:`Py_TPFLAGS_HAVE_FINALIZE` för att detta fält skulle kunna användas. Detta är inte längre nödvändigt.

source: :pep:`442`: "Safe object finalization"
sv: :pep:`442`: "Säkert objekt färdigställs"

source: A :ref:`vectorcall function <vectorcall>` to use for calls of this type object (rather than instances). In other words, ``tp_vectorcall`` can be used to optimize ``type.__call__``, which typically returns a new instance of *type*.
sv: En :ref:`vectorcall-funktion <vectorcall>` att använda för anrop av detta typobjekt (snarare än instanser). Med andra ord kan ``tp_vectorcall`` användas för att optimera ``type.__call__``, som vanligtvis returnerar en ny instans av *type*.

source: As with any vectorcall function, if ``tp_vectorcall`` is ``NULL``, the *tp_call* protocol (``Py_TYPE(type)->tp_call``) is used instead.
sv: Som med alla vectorcall-funktioner, om ``tp_vectorcall`` är ``NULL``, används *tp_call*-protokollet (``Py_TYPE(type)->tp_call``) istället.

source: The :ref:`vectorcall protocol <vectorcall>` requires that the vectorcall function has the same behavior as the corresponding ``tp_call``. This means that ``type->tp_vectorcall`` must match the behavior of ``Py_TYPE(type)->tp_call``.
sv: :ref:``vectorcall protokollet <vectorcall>`` kräver att vectorcall funktionen har samma beteende som motsvarande ``tp_call``. Detta innebär att ``type-&gt;tp_vectorcall`` måste matcha beteendet hos ``Py_TYPE(type)-&gt;tp_call``.

source: Specifically, if *type* uses the default metaclass, ``type->tp_vectorcall`` must behave the same as :c:expr:`PyType_Type->tp_call`, which:
sv: Specifikt, om *type* använder standardmetaklassen, måste ``type->tp_vectorcall`` bete sig på samma sätt som :c:expr:`PyType_Type->tp_call`, vilket:

source: calls ``type->tp_new``,
sv: anropar ``type->tp_new``,

source: if the result is a subclass of *type*, calls ``type->tp_init`` on the result of ``tp_new``, and
sv: om resultatet är en subklass av *type*, anropar ``type->tp_init`` på resultatet av ``tp_new``, och

source: returns the result of ``tp_new``.
sv: returnerar resultatet av ``tp_new``.
