Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: To disallow instantiating a class directly but allow instantiating its subclasses (e.g. for an :term:`abstract base class`), do not use this flag. Instead, make :c:member:`~PyTypeObject.tp_new` only succeed for subclasses.
sv: Använd inte denna flagga för att inte tillåta instansiering av en klass direkt men tillåta instansiering av dess underklasser (t.ex. för en :term:`abstrakt basklass`). Gör istället så att :c:member:`~PyTypeObject.tp_new` bara lyckas för underklasser.

source: This bit indicates that instances of the class may match mapping patterns when used as the subject of a :keyword:`match` block. It is automatically set when registering or subclassing :class:`collections.abc.Mapping`, and unset when registering :class:`collections.abc.Sequence`.
sv: Denna bit indikerar att instanser av klassen kan matcha mappningsmönster när de används som ämne för ett :keyword:`match`-block. Den sätts automatiskt vid registrering eller underklassning av :class:`collections.abc.Mapping`, och avmarkeras vid registrering av :class:`collections.abc.Sequence`.

source: :c:macro:`Py_TPFLAGS_MAPPING` and :c:macro:`Py_TPFLAGS_SEQUENCE` are mutually exclusive; it is an error to enable both flags simultaneously.
sv: :c:macro:`Py_TPFLAGS_MAPPING` och :c:macro:`Py_TPFLAGS_SEQUENCE` är ömsesidigt uteslutande; det är ett fel att aktivera båda flaggorna samtidigt.

source: This flag is inherited by types that do not already set :c:macro:`Py_TPFLAGS_SEQUENCE`.
sv: Denna flagga ärvs av typer som inte redan har satt :c:macro:`Py_TPFLAGS_SEQUENCE`.

source: :pep:`634` -- Structural Pattern Matching: Specification
sv: :pep:`634` -- Matchning av strukturella mönster: Specifikation

source: This bit indicates that instances of the class may match sequence patterns when used as the subject of a :keyword:`match` block. It is automatically set when registering or subclassing :class:`collections.abc.Sequence`, and unset when registering :class:`collections.abc.Mapping`.
sv: Denna bit indikerar att instanser av klassen kan matcha sekvensmönster när de används som subjekt i ett :keyword:`match`-block. Den sätts automatiskt vid registrering eller underklassning av :class:`collections.abc.Sequence`, och avmarkeras vid registrering av :class:`collections.abc.Mapping`.

source: This flag is inherited by types that do not already set :c:macro:`Py_TPFLAGS_MAPPING`.
sv: Denna flagga ärvs av typer som inte redan har satt :c:macro:`Py_TPFLAGS_MAPPING`.

source: Internal. Do not set or unset this flag. To indicate that a class has changed call :c:func:`PyType_Modified`
sv: Internt. Denna flagga ska inte ställas in eller tas bort. För att indikera att en klass har ändrats anropa :c:func:`PyType_Modified`

source: This flag is present in header files, but is not be used. It will be removed in a future version of CPython
sv: Denna flagga finns i header-filer, men används inte. Den kommer att tas bort i en framtida version av CPython

source: An optional pointer to a NUL-terminated C string giving the docstring for this type object. This is exposed as the :attr:`~type.__doc__` attribute on the type and instances of the type.
sv: En valfri pekare till en NUL-avslutad C-sträng som anger dokumentsträngen för detta typobjekt. Detta exponeras som attributet :attr:`~type.__doc__` på typen och instanser av typen.

source: This field is *not* inherited by subtypes.
sv: Detta fält ärvs *inte* av subtyper.

source: An optional pointer to a traversal function for the garbage collector. This is only used if the :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit is set. The signature is::
sv: En valfri pekare till en traversalfunktion för skräpsamlaren. Denna används endast om flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC` är satt. Signaturen är::

source: More information about Python's garbage collection scheme can be found in section :ref:`supporting-cycle-detection`.
sv: Mer information om Pythons skräpplockningssystem finns i avsnitt :ref:`supporting-cycle-detection`.

source: The :c:member:`~PyTypeObject.tp_traverse` pointer is used by the garbage collector to detect reference cycles. A typical implementation of a :c:member:`~PyTypeObject.tp_traverse` function simply calls :c:func:`Py_VISIT` on each of the instance's members that are Python objects that the instance owns. For example, this is function :c:func:`!local_traverse` from the :mod:`!_thread` extension module::
sv: Pekaren :c:member:`~PyTypeObject.tp_traverse` används av garbage collector för att upptäcka referenscykler. En typisk implementering av en :c:member:`~PyTypeObject.tp_traverse`-funktion anropar helt enkelt :c:func:`Py_VISIT` på var och en av instansens medlemmar som är Python-objekt som instansen äger. Detta är till exempel funktionen :c:func:`!local_traverse` från tilläggsmodulen :mod:`!_thread`::

source: static int local_traverse(PyObject *op, visitproc visit, void *arg) { localobject *self = (localobject *) op; Py_VISIT(self->args); Py_VISIT(self->kw); Py_VISIT(self->dict); return 0; }
sv: statisk int local_traverse(PyObject *op, visitproc visit, void *arg) { localobject *self = (localobject *) op; Py_VISIT(self->args); Py_VISIT(själv>kw); Py_VISIT(self->dict); return 0; }

source: Note that :c:func:`Py_VISIT` is called only on those members that can participate in reference cycles. Although there is also a ``self->key`` member, it can only be ``NULL`` or a Python string and therefore cannot be part of a reference cycle.
sv: Observera att :c:func:`Py_VISIT` endast anropas på de medlemmar som kan delta i referenscykler. Även om det också finns en ``self->key``-medlem, kan den bara vara ``NULL`` eller en Python-sträng och kan därför inte vara en del av en referenscykel.

source: On the other hand, even if you know a member can never be part of a cycle, as a debugging aid you may want to visit it anyway just so the :mod:`gc` module's :func:`~gc.get_referents` function will include it.
sv: Å andra sidan, även om du vet att en medlem aldrig kan ingå i en cykel, kan du som felsökningshjälp vilja besöka den ändå, bara för att :mod:`gc`-modulens :func:`~gc.get_referents`-funktion ska inkludera den.

source: Heap types (:c:macro:`Py_TPFLAGS_HEAPTYPE`) must visit their type with::
sv: Heap-typer (:c:macro:`Py_TPFLAGS_HEAPTYPE`) måste besöka sin typ med::

source: It is only needed since Python 3.9. To support Python 3.8 and older, this line must be conditional::
sv: Den behövs bara sedan Python 3.9. För att stödja Python 3.8 och äldre måste denna rad vara villkorlig::

source: If the :c:macro:`Py_TPFLAGS_MANAGED_DICT` bit is set in the :c:member:`~PyTypeObject.tp_flags` field, the traverse function must call :c:func:`PyObject_VisitManagedDict` like this::
sv: Om bit :c:macro:`Py_TPFLAGS_MANAGED_DICT` är inställd i fältet :c:member:`~PyTypeObject.tp_flags` måste traversefunktionen anropa :c:func:`PyObject_VisitManagedDict` så här::

source: When implementing :c:member:`~PyTypeObject.tp_traverse`, only the members that the instance *owns* (by having :term:`strong references <strong reference>` to them) must be visited. For instance, if an object supports weak references via the :c:member:`~PyTypeObject.tp_weaklist` slot, the pointer supporting the linked list (what *tp_weaklist* points to) must **not** be visited as the instance does not directly own the weak references to itself (the weakreference list is there to support the weak reference machinery, but the instance has no strong reference to the elements inside it, as they are allowed to be removed even if the instance is still alive).
sv: Vid implementering av :c:member:`~PyTypeObject.tp_traverse`, måste endast de medlemmar som instansen *äger* (genom att ha :term:`strong references <strong reference>` till dem) besökas. Om ett objekt t.ex. stöder svaga referenser via :c:member:`~PyTypeObject.tp_weaklist` slot, får pekaren som stöder den länkade listan (som *tp_weaklist* pekar på) **inte** besökas eftersom instansen inte direkt äger de svaga referenserna till sig själv (weakreference-listan finns där för att stödja maskineriet för svaga referenser, men instansen har ingen stark referens till elementen inuti den, eftersom de får tas bort även om instansen fortfarande lever).

source: Note that :c:func:`Py_VISIT` requires the *visit* and *arg* parameters to :c:func:`!local_traverse` to have these specific names; don't name them just anything.
sv: Observera att :c:func:`Py_VISIT` kräver att parametrarna *visit* och *arg* till :c:func:`!local_traverse` har dessa specifika namn; ge dem inte vilka namn som helst.

source: Instances of :ref:`heap-allocated types <heap-types>` hold a reference to their type. Their traversal function must therefore either visit :c:func:`Py_TYPE(self) <Py_TYPE>`, or delegate this responsibility by calling ``tp_traverse`` of another heap-allocated type (such as a heap-allocated superclass). If they do not, the type object may not be garbage-collected.
sv: Instanser av :ref:``heap-allocated types <heap-types>` håller en referens till sin typ. Deras traversalfunktion måste därför antingen besöka :c:func:`Py_TYPE(self) <Py_TYPE>`, eller delegera detta ansvar genom att anropa ``tp_traverse`` av en annan heap-allokerad typ (såsom en heap-allokerad superklass). Om de inte gör det kan det hända att typobjektet inte är garbage-collected.

source: The :c:member:`~PyTypeObject.tp_traverse` function can be called from any thread.
sv: Funktionen :c:member:`~PyTypeObject.tp_traverse` kan anropas från vilken tråd som helst.

source: Heap-allocated types are expected to visit ``Py_TYPE(self)`` in ``tp_traverse``. In earlier versions of Python, due to `bug 40217 <https://bugs.python.org/issue40217>`_, doing this may lead to crashes in subclasses.
sv: Heap-allokerade typer förväntas besöka ``Py_TYPE(self)`` i ``tp_traverse``. I tidigare versioner av Python, på grund av `bug 40217 <https://bugs.python.org/issue40217>`_, kan detta leda till krascher i underklasser.

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_clear` and the :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit: the flag bit, :c:member:`~PyTypeObject.tp_traverse`, and :c:member:`~PyTypeObject.tp_clear` are all inherited from the base type if they are all zero in the subtype.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_clear` och flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC`: flaggbiten, :c:member:`~PyTypeObject.tp_traverse` och :c:member:`~PyTypeObject.tp_clear` ärvs alla från bastypen om de alla är noll i subtypen.

source: An optional pointer to a clear function. The signature is::
sv: En valfri pekare till en tydlig funktion. Signaturen är::

source: The purpose of this function is to break reference cycles that are causing a :term:`cyclic isolate` so that the objects can be safely destroyed. A cleared object is a partially destroyed object; the object is not obligated to satisfy design invariants held during normal use.
sv: Syftet med denna funktion är att bryta referenscykler som orsakar en :term:`cyclic isolate` så att objekten kan förstöras på ett säkert sätt. Ett rensat objekt är ett delvis förstört objekt; objektet är inte skyldigt att uppfylla designinvarianter som hålls under normal användning.

source: :c:member:`!tp_clear` does not need to delete references to objects that can't participate in reference cycles, such as Python strings or Python integers. However, it may be convenient to clear all references, and write the type's :c:member:`~PyTypeObject.tp_dealloc` function to invoke :c:member:`!tp_clear` to avoid code duplication. (Beware that :c:member:`!tp_clear` might have already been called. Prefer calling idempotent functions like :c:func:`Py_CLEAR`.)
sv: :c:member:`!tp_clear` behöver inte radera referenser till objekt som inte kan delta i referenscykler, t.ex. Python-strängar eller Python-integraler. Det kan dock vara bekvämt att rensa alla referenser och skriva typens :c:member:`~PyTypeObject.tp_dealloc`-funktion för att anropa :c:member:`!tp_clear` för att undvika koddubblering. (Tänk på att :c:member:`!tp_clear` kanske redan har anropats. Föredra att anropa idempotenta funktioner som :c:func:`Py_CLEAR`)

source: Any non-trivial cleanup should be performed in :c:member:`~PyTypeObject.tp_finalize` instead of :c:member:`!tp_clear`.
sv: All icke-trivial upprensning bör utföras i :c:member:`~PyTypeObject.tp_finalize` istället för :c:member:`!tp_clear`.

source: If :c:member:`!tp_clear` fails to break a reference cycle then the objects in the :term:`cyclic isolate` may remain indefinitely uncollectable ("leak"). See :data:`gc.garbage`.
sv: Om :c:member:`!tp_clear` misslyckas med att bryta en referenscykel kan objekten i :term:`cyclic isolate` förbli obegränsat oinsamlingsbara ("läcka"). Se :data:`gc.garbage`.

source: Referents (direct and indirect) might have already been cleared; they are not guaranteed to be in a consistent state.
sv: Referenser (direkta och indirekta) kan redan ha rensats; det är inte garanterat att de är i ett konsekvent tillstånd.

source: The :c:member:`~PyTypeObject.tp_clear` function can be called from any thread.
sv: Funktionen :c:member:`~PyTypeObject.tp_clear` kan anropas från vilken tråd som helst.

source: An object is not guaranteed to be automatically cleared before its destructor (:c:member:`~PyTypeObject.tp_dealloc`) is called.
sv: Det är inte garanterat att ett objekt automatiskt rensas innan dess destruktor (:c:member:`~PyTypeObject.tp_dealloc`) anropas.

source: This function differs from the destructor (:c:member:`~PyTypeObject.tp_dealloc`) in the following ways:
sv: Denna funktion skiljer sig från destruktorn (:c:member:`~PyTypeObject.tp_dealloc`) på följande sätt:

source: The purpose of clearing an object is to remove references to other objects that might participate in a reference cycle. The purpose of the destructor, on the other hand, is a superset: it must release *all* resources it owns, including references to objects that cannot participate in a reference cycle (e.g., integers) as well as the object's own memory (by calling :c:member:`~PyTypeObject.tp_free`).
sv: Syftet med att cleara ett objekt är att ta bort referenser till andra objekt som kan delta i en referenscykel. Destruktorns syfte är å andra sidan ett överordnat: den måste frigöra *alla* resurser som den äger, inklusive referenser till objekt som inte kan delta i en referenscykel (t.ex. heltal) samt objektets eget minne (genom att anropa :c:member:`~PyTypeObject.tp_free`).

source: When :c:member:`!tp_clear` is called, other objects might still hold references to the object being cleared. Because of this, :c:member:`!tp_clear` must not deallocate the object's own memory (:c:member:`~PyTypeObject.tp_free`). The destructor, on the other hand, is only called when no (strong) references exist, and as such, must safely destroy the object itself by deallocating it.
sv: När :c:member:`!tp_clear` anropas kan andra objekt fortfarande ha referenser till det objekt som rensas. På grund av detta får :c:member:`!tp_clear` inte deallokera objektets eget minne (:c:member:`~PyTypeObject.tp_free`). Destruktorn, å andra sidan, anropas endast när inga (starka) referenser finns, och måste därför på ett säkert sätt förstöra själva objektet genom att avallokera det.

source: :c:member:`!tp_clear` might never be automatically called. An object's destructor, on the other hand, will be automatically called some time after the object becomes unreachable (i.e., either there are no references to the object or the object is a member of a :term:`cyclic isolate`).
sv: :c:member:`!tp_clear` kanske aldrig anropas automatiskt. Ett objekts destruktor kommer däremot att anropas automatiskt en tid efter det att objektet blir oåtkomligt (dvs. antingen finns det inga referenser till objektet eller så är objektet medlem i en :term:`cyclic isolate`).

source: No guarantees are made about when, if, or how often Python automatically clears an object, except:
sv: Inga garantier görs om när, om eller hur ofta Python automatiskt rensar ett objekt, förutom:

source: Python will not automatically clear an object if it is reachable, i.e., there is a reference to it and it is not a member of a :term:`cyclic isolate`.
sv: Python rensar inte automatiskt ett objekt om det är nåbart, dvs. om det finns en referens till det och det inte är en medlem av en :term:`cyklisk isolat`.

source: Python will not automatically clear an object if it has not been automatically finalized (see :c:member:`~PyTypeObject.tp_finalize`). (If the finalizer resurrected the object, the object may or may not be automatically finalized again before it is cleared.)
sv: Python kommer inte automatiskt att rensa ett objekt om det inte har blivit automatiskt finaliserat (se :c:member:`~PyTypeObject.tp_finalize`). (Om finaliseraren återupplivade objektet kan det hända att objektet automatiskt finaliseras igen innan det rensas)

source: If an object is a member of a :term:`cyclic isolate`, Python will not automatically clear it if any member of the cyclic isolate has not yet been automatically finalized (:c:member:`~PyTypeObject.tp_finalize`).
sv: Om ett objekt är medlem i ett :term:`cykliskt isolat`, kommer Python inte automatiskt att rensa det om någon medlem i det cykliska isolatet ännu inte har slutförts automatiskt (:c:member:`~PyTypeObject.tp_finalize`).

source: Python will not destroy an object until after any automatic calls to its :c:member:`!tp_clear` function have returned. This ensures that the act of breaking a reference cycle does not invalidate the ``self`` pointer while :c:member:`!tp_clear` is still executing.
sv: Python kommer inte att förstöra ett objekt förrän efter att alla automatiska anrop till dess :c:member:`!tp_clear`-funktion har returnerats. Detta säkerställer att handlingen att bryta en referenscykel inte ogiltigförklarar ``self``-pekaren medan :c:member:`!tp_clear` fortfarande körs.

source: Python will not automatically call :c:member:`!tp_clear` multiple times concurrently.
sv: Python kommer inte automatiskt att anropa :c:member:`!tp_clear` flera gånger samtidigt.

source: CPython currently only automatically clears objects as needed to break reference cycles in a :term:`cyclic isolate`, but future versions might clear objects regularly before their destruction.
sv: CPython rensar för närvarande bara automatiskt objekt när det behövs för att bryta referenscykler i en :term:`cyklisk isolat`, men framtida versioner kan rensa objekt regelbundet innan de förstörs.

source: Taken together, all :c:member:`~PyTypeObject.tp_clear` functions in the system must combine to break all reference cycles. This is subtle, and if in any doubt supply a :c:member:`~PyTypeObject.tp_clear` function. For example, the tuple type does not implement a :c:member:`~PyTypeObject.tp_clear` function, because it's possible to prove that no reference cycle can be composed entirely of tuples. Therefore the :c:member:`~PyTypeObject.tp_clear` functions of other types are responsible for breaking any cycle containing a tuple. This isn't immediately obvious, and there's rarely a good reason to avoid implementing :c:member:`~PyTypeObject.tp_clear`.
sv: Sammantaget måste alla :c:member:`~PyTypeObject.tp_clear`-funktioner i systemet kombineras för att bryta alla referenscykler. Detta är subtilt, och om du är osäker kan du använda en :c:member:`~PyTypeObject.tp_clear`-funktion. Till exempel implementerar inte tupeltypen en :c:member:`~PyTypeObject.tp_clear`-funktion, eftersom det är möjligt att bevisa att ingen referenscykel kan bestå helt av tuplar. Därför är :c:member:`~PyTypeObject.tp_clear`-funktioner av andra typer ansvariga för att bryta alla cykler som innehåller en tupel. Detta är inte omedelbart uppenbart, och det finns sällan en bra anledning att undvika att implementera :c:member:`~PyTypeObject.tp_clear`.

source: Implementations of :c:member:`~PyTypeObject.tp_clear` should drop the instance's references to those of its members that may be Python objects, and set its pointers to those members to ``NULL``, as in the following example::
sv: Implementeringar av :c:member:`~PyTypeObject.tp_clear` bör ta bort instansens referenser till de av dess medlemmar som kan vara Python-objekt, och sätta dess pekare till dessa medlemmar till ``NULL``, som i följande exempel::

source: static int local_clear(PyObject *op) { localobject *self = (localobject *) op; Py_CLEAR(self->key); Py_CLEAR(self->args); Py_CLEAR(self->kw); Py_CLEAR(self->dict); return 0; }
sv: statisk int local_clear(PyObject *op) { localobject *self = (localobject *) op; Py_CLEAR(själv>nyckel); Py_CLEAR(själv>args); Py_CLEAR(själv>kw); Py_CLEAR(self->dict); return 0; }

source: The :c:func:`Py_CLEAR` macro should be used, because clearing references is delicate: the reference to the contained object must not be released (via :c:func:`Py_DECREF`) until after the pointer to the contained object is set to ``NULL``. This is because releasing the reference may cause the contained object to become trash, triggering a chain of reclamation activity that may include invoking arbitrary Python code (due to finalizers, or weakref callbacks, associated with the contained object). If it's possible for such code to reference *self* again, it's important that the pointer to the contained object be ``NULL`` at that time, so that *self* knows the contained object can no longer be used. The :c:func:`Py_CLEAR` macro performs the operations in a safe order.
sv: Makrot :c:func:`Py_CLEAR` bör användas eftersom det är känsligt att rensa referenser: referensen till det ingående objektet får inte släppas (via :c:func:`Py_DECREF`) förrän efter att pekaren till det ingående objektet har satts till ``NULL``. Detta beror på att frigörandet av referensen kan leda till att det inneslutna objektet blir skräp, vilket utlöser en kedja av återvinningsaktiviteter som kan inkludera anrop av godtycklig Python-kod (på grund av finalizers eller weakref callbacks som är associerade med det inneslutna objektet). Om det är möjligt för sådan kod att referera till *self* igen, är det viktigt att pekaren till det inneslutna objektet är ``NULL`` vid den tidpunkten, så att *self* vet att det inneslutna objektet inte längre kan användas. Makrot :c:func:`Py_CLEAR` utför dessa operationer i en säker ordning.

source: If the :c:macro:`Py_TPFLAGS_MANAGED_DICT` bit is set in the :c:member:`~PyTypeObject.tp_flags` field, the traverse function must call :c:func:`PyObject_ClearManagedDict` like this::
sv: Om bitarna :c:macro:`Py_TPFLAGS_MANAGED_DICT` är inställda i fältet :c:member:`~PyTypeObject.tp_flags`, måste traversefunktionen anropa :c:func:`PyObject_ClearManagedDict` så här::

source: This field is inherited by subtypes together with :c:member:`~PyTypeObject.tp_traverse` and the :c:macro:`Py_TPFLAGS_HAVE_GC` flag bit: the flag bit, :c:member:`~PyTypeObject.tp_traverse`, and :c:member:`~PyTypeObject.tp_clear` are all inherited from the base type if they are all zero in the subtype.
sv: Detta fält ärvs av subtyper tillsammans med :c:member:`~PyTypeObject.tp_traverse` och flaggbiten :c:macro:`Py_TPFLAGS_HAVE_GC`: flaggbiten, :c:member:`~PyTypeObject.tp_traverse` och :c:member:`~PyTypeObject.tp_clear` ärvs alla från bastypen om de alla är noll i subtypen.

source: An optional pointer to the rich comparison function, whose signature is::
sv: En valfri pekare till den rika jämförelsefunktionen, vars signatur är::

source: The first parameter is guaranteed to be an instance of the type that is defined by :c:type:`PyTypeObject`.
sv: Den första parametern är garanterat en instans av den typ som definieras av :c:type:`PyTypeObject`.
