Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: The purpose of this function is to separate memory allocation from memory initialization. It should return a pointer to a block of memory of adequate length for the instance, suitably aligned, and initialized to zeros, but with :c:member:`~PyObject.ob_refcnt` set to ``1`` and :c:member:`~PyObject.ob_type` set to the type argument. If the type's :c:member:`~PyTypeObject.tp_itemsize` is non-zero, the object's :c:member:`~PyVarObject.ob_size` field should be initialized to *nitems* and the length of the allocated memory block should be ``tp_basicsize + nitems*tp_itemsize``, rounded up to a multiple of ``sizeof(void*)``; otherwise, *nitems* is not used and the length of the block should be :c:member:`~PyTypeObject.tp_basicsize`.
sv: Syftet med denna funktion är att separera minnesallokering från minnesinitialisering. Den ska returnera en pekare till ett minnesblock som är tillräckligt långt för instansen, lämpligt inriktat och initialiserat till nollor, men med :c:member:`~PyObject.ob_refcnt` satt till ``1`` och :c:member:`~PyObject.ob_type` satt till typargumentet. Om typens :c:member:`~PyTypeObject.tp_itemsize` inte är noll, ska objektets :c:member:`~PyVarObject.ob_size` initialiseras till *nitems* och längden på det allokerade minnesblocket blir ``tp_basicsize + nitems*tp_itemsize``, avrundat uppåt till en multipel av ``sizeof(void*)``; annars används inte *nitems* och längden på blocket blir :c:member:`~PyTypeObject.tp_basicsize``.

source: This function should not do any other instance initialization, not even to allocate additional memory; that should be done by :c:member:`~PyTypeObject.tp_new`.
sv: Denna funktion bör inte göra någon annan instansinitialisering, inte ens för att allokera ytterligare minne; det bör göras av :c:member:`~PyTypeObject.tp_new`.

source: See :c:member:`~PyTypeObject.tp_free`.
sv: Se :c:member:`~PyTypeObject.tp_free`.

source: See :c:member:`~PyTypeObject.tp_new`.
sv: Se :c:member:`~PyTypeObject.tp_new`.

source: See :c:member:`~PyTypeObject.tp_init`.
sv: Se :c:member:`~PyTypeObject.tp_init`.

source: See :c:member:`~PyTypeObject.tp_repr`.
sv: Se :c:member:`~PyTypeObject.tp_repr`.

source: Return the value of the named attribute for the object.
sv: Returnerar värdet på det namngivna attributet för objektet.

source: Set the value of the named attribute for the object. The value argument is set to ``NULL`` to delete the attribute.
sv: Ställ in värdet på det namngivna attributet för objektet. Argumentet value sätts till ``NULL`` för att ta bort attributet.

source: See :c:member:`~PyTypeObject.tp_getattro`.
sv: Se :c:member:`~PyTypeObject.tp_getattro`.

source: See :c:member:`~PyTypeObject.tp_setattro`.
sv: Se :c:member:`~PyTypeObject.tp_setattro`.

source: See :c:member:`~PyTypeObject.tp_descr_get`.
sv: Se :c:member:`~PyTypeObject.tp_descr_get`.

source: See :c:member:`~PyTypeObject.tp_descr_set`.
sv: Se :c:member:`~PyTypeObject.tp_descr_set`.

source: See :c:member:`~PyTypeObject.tp_hash`.
sv: Se :c:member:`~PyTypeObject.tp_hash`.

source: See :c:member:`~PyTypeObject.tp_richcompare`.
sv: Se :c:member:`~PyTypeObject.tp_richcompare`.

source: See :c:member:`~PyTypeObject.tp_iter`.
sv: Se :c:member:`~PyTypeObject.tp_iter`.

source: See :c:member:`~PyTypeObject.tp_iternext`.
sv: Se :c:member:`~PyTypeObject.tp_iternext`.

source: See :c:member:`~PyAsyncMethods.am_send`.
sv: Se :c:member:`~PyAsyncMethods.am_send`.

source: Examples
sv: Exempel

source: The following are simple examples of Python type definitions. They include common usage you may encounter. Some demonstrate tricky corner cases. For more examples, practical info, and a tutorial, see :ref:`defining-new-types` and :ref:`new-types-topics`.
sv: Följande är enkla exempel på Python-typdefinitioner. De inkluderar vanlig användning som du kan stöta på. Några demonstrerar knepiga hörnfall. För fler exempel, praktisk information och en handledning, se :ref:`defining-new-types` och :ref:`new-types-topics`.

source: A basic :ref:`static type <static-types>`::
sv: En grundläggande :ref:`statisk typ <static-types>`::

source: typedef struct { PyObject_HEAD const char *data; } MyObject; static PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", .tp_basicsize = sizeof(MyObject), .tp_doc = PyDoc_STR("My objects"), .tp_new = myobj_new, .tp_dealloc = (destructor)myobj_dealloc, .tp_repr = (reprfunc)myobj_repr, };
sv: typedef struct { PyObject_Huvud const char *data; } MyObject; statisk PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", .tp_basicsize = sizeof(MyObject), .tp_doc = PyDoc_STR("Mina objekt"), .tp_new = myobj_new, .tp_dealloc = (destructor)myobj_dealloc, .tp_repr = (reprfunc)myobj_repr, };

source: You may also find older code (especially in the CPython code base) with a more verbose initializer::
sv: Du kan också hitta äldre kod (särskilt i CPython-kodbasen) med en mer utförlig initialiserare::

source: static PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) "mymod.MyObject", /* tp_name */ sizeof(MyObject), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)myobj_dealloc, /* tp_dealloc */ 0, /* tp_vectorcall_offset */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_as_async */ (reprfunc)myobj_repr, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ 0, /* tp_flags */ PyDoc_STR("My objects"), /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ 0, /* tp_methods */ 0, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ 0, /* tp_init */ 0, /* tp_alloc */ myobj_new, /* tp_new */ };
sv: static PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) "mymod.MyObject", /* tp_name */ sizeof(MyObject), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)myobj_dealloc, /* tp_dealloc */ 0, /* tp_vectorcall_offset */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_as_async */ (reprfunc)myobj_repr, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ 0, /* tp_flags */ PyDoc_STR("Mina objekt"), /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ 0, /* tp_methods */ 0, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ 0, /* tp_init */ 0, /* tp_alloc */ myobj_new, /* tp_new */ };

source: A type that supports weakrefs, instance dicts, and hashing::
sv: En typ som stöder weakrefs, instance dicts och hashing::

source: typedef struct { PyObject_HEAD const char *data; } MyObject; static PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", .tp_basicsize = sizeof(MyObject), .tp_doc = PyDoc_STR("My objects"), .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE | Py_TPFLAGS_HAVE_GC | Py_TPFLAGS_MANAGED_DICT | Py_TPFLAGS_MANAGED_WEAKREF, .tp_new = myobj_new, .tp_traverse = (traverseproc)myobj_traverse, .tp_clear = (inquiry)myobj_clear, .tp_alloc = PyType_GenericNew, .tp_dealloc = (destructor)myobj_dealloc, .tp_repr = (reprfunc)myobj_repr, .tp_hash = (hashfunc)myobj_hash, .tp_richcompare = PyBaseObject_Type.tp_richcompare, };
sv: typedef struct { PyObjekt_Huvud const char *data; } MyObject; statisk PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", .tp_basicsize = sizeof(MyObject), .tp_doc = PyDoc_STR("Mina objekt"), .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE | Py Py_TPFLAGS_HAVE_GC | Py_TPFLAGS_MANAGED_DICT | Py_TPFLAGS_MANAGED_DICT | Py Py_TPFLAGS_MANAGED_WEAKREF, .tp_new = myobj_new, .tp_traverse = (traverseproc)myobj_traverse, .tp_clear = (förfrågan)myobj_clear, .tp_alloc = PyType_GenericNew, .tp_dealloc = (destructor)myobj_dealloc, .tp_repr = (reprfunc)myobj_repr, .tp_hash = (hashfunc)myobj_hash, .tp_richcompare = PyBaseObject_Type.tp_richcompare, };

source: A str subclass that cannot be subclassed and cannot be called to create instances (e.g. uses a separate factory func) using :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flag::
sv: En str-underklass som inte kan underklassas och inte kan anropas för att skapa instanser (t.ex. använder en separat fabriksfunktion) med :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flagga::

source: typedef struct { PyUnicodeObject raw; char *extra; } MyStr; static PyTypeObject MyStr_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyStr", .tp_basicsize = sizeof(MyStr), .tp_base = NULL, // set to &PyUnicode_Type in module init .tp_doc = PyDoc_STR("my custom str"), .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_DISALLOW_INSTANTIATION, .tp_repr = (reprfunc)myobj_repr, };
sv: typedef struct { PyUnicodeObject rå; char *extra; } MyStr; statiskt PyTypeObject MyStr_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyStr", .tp_basicsize = sizeof(MyStr), .tp_base = NULL, // satt till &PyUnicode_Type i modulinit .tp_doc = PyDoc_STR("min anpassade str"), .tp_flags = Py_TPFLAGS_DEFAULT | Py_TPFLAGS_DISALLOW_INSTANTIATION, .tp_repr = (reprfunc)myobj_repr, };

source: The simplest :ref:`static type <static-types>` with fixed-length instances::
sv: Den enklaste :ref:` `statiska typen <static-types>` med instanser av fast längd::

source: typedef struct { PyObject_HEAD } MyObject; static PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", };
sv: typedef struct { PyObject_HEAD } MyObject; statisk PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", };

source: The simplest :ref:`static type <static-types>` with variable-length instances::
sv: Den enklaste :ref:`statiska typen <static-types>` med instanser av variabel längd::

source: typedef struct { PyObject_VAR_HEAD const char *data[1]; } MyObject; static PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", .tp_basicsize = sizeof(MyObject) - sizeof(char *), .tp_itemsize = sizeof(char *), };
sv: typedef struct { PyObject_VAR_HEAD const char *data[1]; } MyObject; statisk PyTypeObject MyObject_Type = { PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "mymod.MyObject", .tp_basicsize = sizeof(MyObject) - sizeof(char *), .tp_itemsize = sizeof(char *), };

source: built-in function
sv: inbyggd funktion
