Repository: yeager/python-docs-sv
Catalog: c-api/type.po
Languages: sv

source: Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is no longer allowed.
sv: Det är inte längre tillåtet att skapa klasser vars metaklass åsidosätter :c:member:`~PyTypeObject.tp_new`.

source: Equivalent to ``PyType_FromMetaclass(NULL, NULL, spec, bases)``.
sv: Motsvarar ``PyType_FromMetaclass(NULL, NULL, spec, bases)``.

source: Equivalent to ``PyType_FromMetaclass(NULL, NULL, spec, NULL)``.
sv: Motsvarar ``PyType_FromMetaclass(NULL, NULL, spec, NULL)``.

source: The function now finds and uses a metaclass corresponding to the base classes provided in *Py_tp_base[s]* slots. Previously, only :class:`type` instances were returned.
sv: Funktionen hittar och använder nu en metaklass som motsvarar de basklasser som finns i *Py_tp_base[s]* slots. Tidigare returnerades endast :class:`type`-instanser.

source: Make a type immutable: set the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag.
sv: Gör en typ oföränderlig: sätt flaggan :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`.

source: All base classes of *type* must be immutable.
sv: Alla basklasser av *typ* måste vara oföränderliga.

source: On success, return ``0``. On error, set an exception and return ``-1``.
sv: Vid framgång, returnera ``0``. Vid fel, sätt ett undantag och returnera ``-1``.

source: The type must not be used before it's made immutable. For example, type instances must not be created before the type is made immutable.
sv: Typen får inte användas innan den görs oföränderlig. Typinstanser får t.ex. inte skapas innan typen har gjorts oföränderlig.

source: Structure defining a type's behavior.
sv: Struktur som definierar en typs beteende.

source: Name of the type, used to set :c:member:`PyTypeObject.tp_name`.
sv: Namn på typen, används för att ställa in :c:member:`PyTypeObject.tp_name`.

source: If positive, specifies the size of the instance in bytes. It is used to set :c:member:`PyTypeObject.tp_basicsize`.
sv: Om positiv, anger storleken på instansen i bytes. Den används för att ställa in :c:member:`PyTypeObject.tp_basicsize`.

source: If zero, specifies that :c:member:`~PyTypeObject.tp_basicsize` should be inherited.
sv: Om noll, anger att :c:member:`~PyTypeObject.tp_basicsize` ska ärvas.

source: If negative, the absolute value specifies how much space instances of the class need *in addition* to the superclass. Use :c:func:`PyObject_GetTypeData` to get a pointer to subclass-specific memory reserved this way. For negative :c:member:`!basicsize`, Python will insert padding when needed to meet :c:member:`~PyTypeObject.tp_basicsize`'s alignment requirements.
sv: Om det är negativt anger det absoluta värdet hur mycket utrymme instanser av klassen behöver *utöver* superklassen. Använd :c:func:`PyObject_GetTypeData` för att få en pekare till underklassspecifikt minne som reserverats på detta sätt. För negativa :c:member:`!basicsize`, kommer Python att infoga utfyllnad när det behövs för att uppfylla :c:member:`~PyTypeObject.tp_basicsize`s anpassningskrav.

source: Previously, this field could not be negative.
sv: Tidigare kunde detta fält inte vara negativt.

source: Size of one element of a variable-size type, in bytes. Used to set :c:member:`PyTypeObject.tp_itemsize`. See ``tp_itemsize`` documentation for caveats.
sv: Storleken på ett element i en typ med variabel storlek, i byte. Används för att ställa in :c:member:`PyTypeObject.tp_itemsize`. Se dokumentationen för ``tp_itemsize`` för förbehåll.

source: If zero, :c:member:`~PyTypeObject.tp_itemsize` is inherited. Extending arbitrary variable-sized classes is dangerous, since some types use a fixed offset for variable-sized memory, which can then overlap fixed-sized memory used by a subclass. To help prevent mistakes, inheriting ``itemsize`` is only possible in the following situations:
sv: Om noll, ärvs :c:member:`~PyTypeObject.tp_itemsize`. Att utöka godtyckliga klasser med variabel storlek är farligt, eftersom vissa typer använder en fast offset för minne med variabel storlek, som sedan kan överlappa minne med fast storlek som används av en underklass. För att hjälpa till att förhindra misstag är det bara möjligt att ärva ``itemsize`` i följande situationer:

source: The base is not variable-sized (its :c:member:`~PyTypeObject.tp_itemsize`).
sv: Basen är inte variabel i storlek (dess :c:member:`~PyTypeObject.tp_itemsize`).

source: The requested :c:member:`PyType_Spec.basicsize` is positive, suggesting that the memory layout of the base class is known.
sv: Den begärda :c:member:`PyType_Spec.basicsize` är positiv, vilket tyder på att minneslayouten för basklassen är känd.

source: The requested :c:member:`PyType_Spec.basicsize` is zero, suggesting that the subclass does not access the instance's memory directly.
sv: Den begärda :c:member:`PyType_Spec.basicsize` är noll, vilket tyder på att underklassen inte har direkt åtkomst till instansens minne.

source: With the :c:macro:`Py_TPFLAGS_ITEMS_AT_END` flag.
sv: Med flaggan :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.

source: Type flags, used to set :c:member:`PyTypeObject.tp_flags`.
sv: Typflaggor, används för att ställa in :c:member:`PyTypeObject.tp_flags`.

source: If the ``Py_TPFLAGS_HEAPTYPE`` flag is not set, :c:func:`PyType_FromSpecWithBases` sets it automatically.
sv: Om flaggan ``Py_TPFLAGS_HEAPTYPE`` inte är satt, sätter :c:func:`PyType_FromSpecWithBases` den automatiskt.

source: Array of :c:type:`PyType_Slot` structures. Terminated by the special slot value ``{0, NULL}``.
sv: Array av :c:type:`PyType_Slot`-strukturer. Avslutas med det speciella slot-värdet ``{0, NULL}``.

source: Each slot ID should be specified at most once.
sv: Varje slot-ID får anges högst en gång.

source: Structure defining optional functionality of a type, containing a slot ID and a value pointer.
sv: Struktur som definierar valfri funktionalitet för en typ och som innehåller ett slot-ID och en värdepekare.

source: A slot ID.
sv: Ett slot-ID.

source: Slot IDs are named like the field names of the structures :c:type:`PyTypeObject`, :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, :c:type:`PyMappingMethods` and :c:type:`PyAsyncMethods` with an added ``Py_`` prefix. For example, use:
sv: Slot-ID:n namnges som fältnamnen i strukturerna :c:type:`PyTypeObject`, :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, :c:type:`PyMappingMethods` och :c:type:`PyAsyncMethods` med ett extra prefix ``Py_``. Använd till exempel:

source: ``Py_tp_dealloc`` to set :c:member:`PyTypeObject.tp_dealloc`
sv: ``Py_tp_dealloc`` till set :c:member:`PyTypeObject.tp_dealloc``

source: ``Py_nb_add`` to set :c:member:`PyNumberMethods.nb_add`
sv: ``Py_nb_add`` för att ställa in :c:member:`PyNumberMethods.nb_add`

source: ``Py_sq_length`` to set :c:member:`PySequenceMethods.sq_length`
sv: ``Py_sq_length`` för att ställa in :c:member:`PySequenceMethods.sq_length`

source: An additional slot is supported that does not correspond to a :c:type:`!PyTypeObject` struct field:
sv: En ytterligare slot stöds som inte motsvarar ett :c:type:`!PyTypeObject` struct-fält:

source: The following “offset” fields cannot be set using :c:type:`PyType_Slot`:
sv: Följande "offset"-fält kan inte ställas in med hjälp av :c:type:`PyType_Slot`:

source: :c:member:`~PyTypeObject.tp_weaklistoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead if possible)
sv: :c:member:`~PyTypeObject.tp_weaklistoffset` (använd :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` istället om möjligt)

source: :c:member:`~PyTypeObject.tp_dictoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_DICT` instead if possible)
sv: :c:member:`~PyTypeObject.tp_dictoffset` (använd :c:macro:`Py_TPFLAGS_MANAGED_DICT` istället om möjligt)

source: If it is not possible to switch to a ``MANAGED`` flag (for example, for vectorcall or to support Python older than 3.12), specify the offset in :c:member:`Py_tp_members <PyTypeObject.tp_members>`. See :ref:`PyMemberDef documentation <pymemberdef-offsets>` for details.
sv: Om det inte är möjligt att byta till en ``MANAGED`` flagga (t.ex. för vectorcall eller för att stödja Python äldre än 3.12), ange offset i :c:member:`Py_tp_members <PyTypeObject.tp_members>`. Se :ref:`PyMemberDef-dokumentation <pymemberdef-offsets>` för detaljer.

source: The following internal fields cannot be set at all when creating a heap type:
sv: Följande interna fält kan inte anges alls när du skapar en heap-typ:

source: :c:member:`~PyTypeObject.tp_dict`, :c:member:`~PyTypeObject.tp_mro`, :c:member:`~PyTypeObject.tp_cache`, :c:member:`~PyTypeObject.tp_subclasses`, and :c:member:`~PyTypeObject.tp_weaklist`.
sv: :c:member:`~PyTypeObject.tp_dict`, :c:member:`~PyTypeObject.tp_mro`, :c:member:`~PyTypeObject.tp_cache`, :c:member:`~PyTypeObject.tp_subclasses`, och :c:member:`~PyTypeObject.tp_weaklist`.

source: Setting :c:data:`Py_tp_bases` or :c:data:`Py_tp_base` may be problematic on some platforms. To avoid issues, use the *bases* argument of :c:func:`PyType_FromSpecWithBases` instead.
sv: Att ställa in :c:data:`Py_tp_bases` eller :c:data:`Py_tp_base` kan vara problematiskt på vissa plattformar. För att undvika problem, använd *bases*-argumentet i :c:func:`PyType_FromSpecWithBases` istället.

source: Slots in :c:type:`PyBufferProcs` may be set in the unlimited API.
sv: Slots i :c:type:`PyBufferProcs` kan ställas in i det obegränsade API:et.

source: :c:member:`~PyBufferProcs.bf_getbuffer` and :c:member:`~PyBufferProcs.bf_releasebuffer` are now available under the :ref:`limited API <limited-c-api>`.
sv: :c:member:`~PyBufferProcs.bf_getbuffer` och :c:member:`~PyBufferProcs.bf_releasebuffer` är nu tillgängliga under :ref:`limited API <limited-c-api>`.

source: The field :c:member:`~PyTypeObject.tp_vectorcall` can now set using ``Py_tp_vectorcall``. See the field's documentation for details.
sv: Fältet :c:member:`~PyTypeObject.tp_vectorcall` kan nu ställas in med hjälp av ``Py_tp_vectorcall``. Se fältets dokumentation för detaljer.

source: The desired value of the slot. In most cases, this is a pointer to a function.
sv: Det önskade värdet på platsen. I de flesta fall är detta en pekare till en funktion.

source: *pfunc* values may not be ``NULL``, except for the following slots:
sv: *pfunc*-värden får inte vara ``NULL``, förutom för följande slots:

source: :c:data:`Py_tp_token` (for clarity, prefer :c:data:`Py_TP_USE_SPEC` rather than ``NULL``)
sv: :c:data:`Py_tp_token` (för tydlighetens skull, föredra :c:data:`Py_TP_USE_SPEC` i stället för ``NULL``)

source: A :c:member:`~PyType_Slot.slot` that records a static memory layout ID for a class.
sv: En :c:member:`~PyType_Slot.slot` som registrerar ett statiskt minneslayout-ID för en klass.

source: If the :c:type:`PyType_Spec` of the class is statically allocated, the token can be set to the spec using the special value :c:data:`Py_TP_USE_SPEC`:
sv: Om klassens :c:type:`PyType_Spec` är statiskt allokerad kan token sättas till specen med hjälp av specialvärdet :c:data:`Py_TP_USE_SPEC`:

source: It can also be set to an arbitrary pointer, but you must ensure that:
sv: Den kan också ställas in på en godtycklig pekare, men det måste du se till:

source: The pointer outlives the class, so it's not reused for something else while the class exists.
sv: Pekaren lever längre än klassen, så den återanvänds inte för något annat medan klassen existerar.

source: It "belongs" to the extension module where the class lives, so it will not clash with other extensions.
sv: Den "hör till" tillbyggnadsmodulen där klassen bor, så den kommer inte att krocka med andra tillbyggnader.

source: Use :c:func:`PyType_GetBaseByToken` to check if a class's superclass has a given token -- that is, check whether the memory layout is compatible.
sv: Använd :c:func:`PyType_GetBaseByToken` för att kontrollera om en klass superklass har en given token -- det vill säga, kontrollera om minneslayouten är kompatibel.

source: To get the token for a given class (without considering superclasses), use :c:func:`PyType_GetSlot` with ``Py_tp_token``.
sv: Om du vill hämta token för en viss klass (utan att ta hänsyn till superklasser) använder du :c:func:`PyType_GetSlot` med ``Py_tp_token``.

source: Used as a value with :c:data:`Py_tp_token` to set the token to the class's :c:type:`PyType_Spec`. Expands to ``NULL``.
sv: Används som ett värde med :c:data:`Py_tp_token` för att ställa in token till klassens :c:type:`PyType_Spec`. Expanderar till ``NULL``.

source: object
sv: objekt

source: type
sv: typ
