Repository: yeager/python-docs-sv
Catalog: c-api/typeobj.po
Languages: sv

source: Type Object Structures
sv: Typobjektstrukturer

source: Perhaps one of the most important structures of the Python object system is the structure that defines a new type: the :c:type:`PyTypeObject` structure. Type objects can be handled using any of the ``PyObject_*`` or ``PyType_*`` functions, but do not offer much that's interesting to most Python applications. These objects are fundamental to how objects behave, so they are very important to the interpreter itself and to any extension module that implements new types.
sv: En av de kanske viktigaste strukturerna i Pythons objektsystem är den struktur som definierar en ny typ: :c:type:`PyTypeObject`-strukturen. Typobjekt kan hanteras med hjälp av någon av funktionerna ``PyObject_*`` eller ``PyType_*``, men erbjuder inte mycket som är intressant för de flesta Python-applikationer. Dessa objekt är grundläggande för hur objekt beter sig, så de är mycket viktiga för själva tolken och för alla tilläggsmoduler som implementerar nya typer.

source: Type objects are fairly large compared to most of the standard types. The reason for the size is that each type object stores a large number of values, mostly C function pointers, each of which implements a small part of the type's functionality. The fields of the type object are examined in detail in this section. The fields will be described in the order in which they occur in the structure.
sv: Typobjekt är ganska stora jämfört med de flesta standardtyperna. Anledningen till storleken är att varje typobjekt lagrar ett stort antal värden, mestadels C-funktionspekare, som var och en implementerar en liten del av typens funktionalitet. Fälten i typobjektet granskas i detalj i detta avsnitt. Fälten kommer att beskrivas i den ordning de förekommer i strukturen.

source: In addition to the following quick reference, the :ref:`typedef-examples` section provides at-a-glance insight into the meaning and use of :c:type:`PyTypeObject`.
sv: Förutom följande snabbreferens ger avsnittet :ref:`typedef-examples` en snabb inblick i betydelsen och användningen av :c:type:`PyTypeObject`.

source: Quick Reference
sv: Snabbreferens

source: :ref:`Type <slot-typedefs-table>`
sv: :ref:`Typ <slot-typedefs-table>`

source: special methods/attrs
sv: speciella metoder/attribut

source: Info [#cols]_
sv: Info [#cols]_ _ Info

source: O
sv: A

source: const char *
sv: konst char *

source: __name__
sv: __namn__

source: :c:type:`destructor`
sv: :c:type:`destruktor`

source: __getattribute__, __getattr__
sv: __getattribut__, __getattr__

source: __call__
sv: __anropa__

source: unsigned long
sv: osignerad lång

source: :c:type:`inquiry`
sv: :c:type:`förfrågan`

source: __next__
sv: nästa

source: __base__
sv: __bas

source: __new__
sv: __ny

source: __bases__
sv: baser

source: __mro__
sv: det är inte sant

source: void *
sv: tomrum *

source: __subclasses__
sv: __underklasser

source: unsigned int
sv: osignerad int

source: :c:type:`vectorcallfunc`
sv: :c:type:`vektorcallfunc`

source: unsigned char
sv: obetecknad char

source: **()**: A slot name in parentheses indicates it is (effectively) deprecated.
sv: **()**: Ett slotnamn inom parentes anger att det (i praktiken) är föråldrat.

source: **<>**: Names in angle brackets should be initially set to ``NULL`` and treated as read-only.
sv: **<>**: Namn inom hakparenteser bör initialt sättas till ``NULL`` och behandlas som skrivskyddade.

source: **[]**: Names in square brackets are for internal use only.
sv: **[]**: Namn inom hakparentes är endast för internt bruk.

source: **<R>** (as a prefix) means the field is required (must be non-``NULL``).
sv: **<R>** (som prefix) betyder att fältet är obligatoriskt (måste vara icke-``NULL``).

source: Columns:
sv: Kolumner:

source: **"O"**: set on :c:data:`PyBaseObject_Type`
sv: **"O"**: inställd på :c:data:`PyBaseObject_Type`

source: **"T"**: set on :c:data:`PyType_Type`
sv: **"T"**: inställd på :c:data:`PyType_Type`

source: **"D"**: default (if slot is set to ``NULL``)
sv: **"D"**: standard (om slot är inställd på ``NULL``)

source: X - PyType_Ready sets this value if it is NULL ~ - PyType_Ready always sets this value (it should be NULL) ? - PyType_Ready may set this value depending on other slots Also see the inheritance column ("I").
sv: X - PyType_Ready ställer in detta värde om det är NULL ~ - PyType_Ready ställer alltid in detta värde (det ska vara NULL) ? - PyType_Ready kan ställa in detta värde beroende på andra slots Se även kolumnen för arv ("I").

source: **"I"**: inheritance
sv: **"I"**: arv

source: X - type slot is inherited via *PyType_Ready* if defined with a *NULL* value % - the slots of the sub-struct are inherited individually G - inherited, but only in combination with other slots; see the slot's description ? - it's complicated; see the slot's description
sv: X - typplatsen ärvs via *PyType_Ready* om den definieras med ett *NULL*-värde % - understrukturens slots ärvs individuellt G - ärvs, men endast i kombination med andra slots; se slotens beskrivning ? - det är komplicerat; se slotens beskrivning

source: Note that some slots are effectively inherited through the normal attribute lookup chain.
sv: Observera att vissa slots faktiskt ärvs genom den normala attributuppslagningskedjan.

source: sub-slots
sv: underluckor

source: Slot
sv: Tidslucka

source: special methods
sv: särskilda metoder

source: __await__
sv: vänta..

source: __abs__
sv: det är inte sant

source: __invert__
sv: __invertera__

source: __rshift__ __rrshift__
sv: __rshift__ __rshift__ __rshift__

source: __irshift__
sv: jag har inte tid

source: __or__ __ror__
sv: __eller__ __ror__

source: __ior__
sv: jag är inte här

source: __float__
sv: __flödesvärde

source: __getitem__
sv: __hämta objekt

source: __setitem__, __delitem__
sv: __sätt objekt__, __ta bort objekt

source: __add__
sv: __tillägg__

source: __contains__
sv: innehåller

source: __release_\ buffer\__
sv: buffert

source: slot typedefs
sv: slot typdefinitioner

source: typedef
sv: typdefinierad

source: Parameter Types
sv: Parametertyper

source: Return Type
sv: Typ av retur

source: See :ref:`slot-typedefs` below for more detail.
sv: Se :ref:`slot-typedefs` nedan för mer information.

source: The structure definition for :c:type:`PyTypeObject` can be found in :file:`Include/cpython/object.h`. For convenience of reference, this repeats the definition found there:
sv: Strukturdefinitionen för :c:type:`PyTypeObject` finns i :file:`Include/cpython/object.h`. För att underlätta referensen upprepar detta den definition som finns där:

source: typedef struct _typeobject { PyObject_VAR_HEAD const char *tp_name; /* For printing, in format "<module>.<name>" */ Py_ssize_t tp_basicsize, tp_itemsize; /* For allocation */ /* Methods to implement standard operations */ destructor tp_dealloc; Py_ssize_t tp_vectorcall_offset; getattrfunc tp_getattr; setattrfunc tp_setattr; PyAsyncMethods *tp_as_async; /* formerly known as tp_compare (Python 2) or tp_reserved (Python 3) */ reprfunc tp_repr; /* Method suites for standard classes */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* More standard operations (here for binary compatibility) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Functions to access object as input/output buffer */ PyBufferProcs *tp_as_buffer; /* Flags to define presence of optional/expanded features */ unsigned long tp_flags; const char *tp_doc; /* Documentation string */ /* Assigned meaning in release 2.0 */ /* call function for all accessible objects */ traverseproc tp_traverse; /* delete references to contained objects */ inquiry tp_clear; /* Assigned meaning in release 2.1 */ /* rich comparisons */ richcmpfunc tp_richcompare; /* weak reference enabler */ Py_ssize_t tp_weaklistoffset; /* Iterators */ getiterfunc tp_iter; iternextfunc tp_iternext; /* Attribute descriptor and subclassing stuff */ PyMethodDef *tp_methods; PyMemberDef *tp_members; PyGetSetDef *tp_getset; // Strong reference on a heap type, borrowed reference on a static type PyTypeObject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; Py_ssize_t tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Low-level free-memory routine */ inquiry tp_is_gc; /* For PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* method resolution order */ PyObject *tp_cache; /* no longer used */ void *tp_subclasses; /* for static builtin types this is an index */ PyObject *tp_weaklist; /* not used for static builtin types */ destructor tp_del; /* Type attribute cache version tag. Added in version 2.6. * If zero, the cache is invalid and must be initialized. */ unsigned int tp_version_tag; destructor tp_finalize; vectorcallfunc tp_vectorcall; /* bitset of which type-watchers care about this type */ unsigned char tp_watched; /* Number of tp_version_tag values used. * Set to _Py_ATTR_CACHE_UNUSED if the attribute cache is * disabled for this type (e.g. due to custom MRO entries). * Otherwise, limited to MAX_VERSIONS_PER_CLASS (defined elsewhere). */ uint16_t tp_versions_used; } PyTypeObject;
sv: typedef struct _typeobject { PyObject_VAR_HEAD const char *tp_name; /* För utskrift, i formatet "<module>.<name>" */ Py_ssize_t tp_basicsize, tp_itemsize; /* För allokering */ /* Metoder för att implementera standardoperationer */ destruktor tp_dealloc; Py_ssize_t tp_vectorcall_offset; getattrfunc tp_getattr; setattrfunc tp_setattr; PyAsyncMethods *tp_as_async; /* tidigare känd som tp_compare (Python 2) eller tp_reserved (Python 3) */ reprfunc tp_repr; /* Metodsviter för standardklasser */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* Fler standardoperationer (här för binär kompatibilitet) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Funktioner för att komma åt objekt som inmatnings-/utmatningsbuffert */ PyBufferProcs *tp_as_buffer; /* Flaggor för att definiera förekomst av valfria/utökade funktioner */ osignerad lång tp_flags; const char *tp_doc; /* Dokumentationssträng */ /* Tilldelad betydelse i version 2.0 */ /* anropsfunktion för alla tillgängliga objekt */ traverseproc tp_traverse; /* radera referenser till inneslutna objekt */ förfrågan tp_clear; /* Tilldelad betydelse i version 2.1 */ /* rika jämförelser */ richcmpfunc tp_richcompare; /* Möjliggör svag referens */ Py_ssize_t tp_weaklistoffset; /* Iteratorer */ getiterfunc tp_iter; iternextfunc tp_iternext; /* Attributbeskrivare och underklassningsgrejer */ PyMethodDef *tp_methods; PyMemberDef *tp_members; PyGetSetDef *tp_getset; // Stark referens på en heap-typ, lånad referens på en statisk typ PyTypeObject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; Py_ssize_t tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Rutin för fritt minne på låg nivå */ inquiry tp_is_gc; /* För PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* metodupplösningsordning */ PyObject *tp_cache; /* används inte längre */ void *tp_subclasses; /* för statiska inbyggda typer är detta ett index */ PyObject *tp_weaklist; /* används inte för statiska inbyggda typer */ destruktor tp_del; /* Typattribut för cacheversionstagg. Tillagd i version 2.6. * Om noll är cacheminnet ogiltigt och måste initialiseras. */ unsigned int tp_version_tag; destruktor tp_finalize; vektorcallfunc tp_vectorcall; /* bituppsättning av vilka typövervakare som bryr sig om denna typ */ osignerad char tp_watched; /* Antal använda tp_version_tag-värden. * Sätts till _Py_ATTR_CACHE_UNUSED om attributcachen är * inaktiverad för den här typen (t.ex. på grund av anpassade MRO-poster). * Annars begränsat till MAX_VERSIONS_PER_CLASS (definieras på annan plats). */ uint16_t tp_versions_used; } PyTypeObject;

source: PyObject Slots
sv: PyObject-spelautomater

source: The type object structure extends the :c:type:`PyVarObject` structure. The :c:member:`~PyVarObject.ob_size` field is used for dynamic types (created by :c:func:`!type_new`, usually called from a class statement). Note that :c:data:`PyType_Type` (the metatype) initializes :c:member:`~PyTypeObject.tp_itemsize`, which means that its instances (i.e. type objects) *must* have the :c:member:`~PyVarObject.ob_size` field.
sv: Typobjektstrukturen utökar :c:type:`PyVarObject`-strukturen. Fältet :c:member:`~PyVarObject.ob_size` används för dynamiska typer (skapade av :c:func:`!type_new`, som vanligtvis anropas från en class statement). Observera att :c:data:`PyType_Type` (metatypen) initialiserar :c:member:`~PyTypeObject.tp_itemsize`, vilket innebär att dess instanser (dvs. typobjekt) *måste* ha fältet :c:member:`~PyVarObject.ob_size`.

source: The type object's reference count is initialized to ``1`` by the ``PyObject_HEAD_INIT`` macro. Note that for :ref:`statically allocated type objects <static-types>`, the type's instances (objects whose :c:member:`~PyObject.ob_type` points back to the type) do *not* count as references. But for :ref:`dynamically allocated type objects <heap-types>`, the instances *do* count as references.
sv: Typobjektets referensantal initialiseras till ``1`` av makrot ``PyObject_HEAD_INIT``. Observera att för :ref:`statiskt allokerade typobjekt <static-types>` räknas typens instanser (objekt vars :c:member:`~PyObject.ob_type` pekar tillbaka på typen) *inte* som referenser. Men för :ref:``dynamiskt allokerade typobjekt <heap-types>` räknas förekomsterna *som* referenser.

source: **Inheritance:**
sv: **Arv:**

source: This field is not inherited by subtypes.
sv: Detta fält ärvs inte av subtyper.

source: This is the type's type, in other words its metatype. It is initialized by the argument to the ``PyObject_HEAD_INIT`` macro, and its value should normally be ``&PyType_Type``. However, for dynamically loadable extension modules that must be usable on Windows (at least), the compiler complains that this is not a valid initializer. Therefore, the convention is to pass ``NULL`` to the ``PyObject_HEAD_INIT`` macro and to initialize this field explicitly at the start of the module's initialization function, before doing anything else. This is typically done like this::
sv: Detta är typens typ, med andra ord dess metatyp. Den initialiseras av argumentet till makrot ``PyObject_HEAD_INIT``, och dess värde bör normalt vara ``&PyType_Type``. Men för dynamiskt laddningsbara tilläggsmoduler som måste kunna användas på Windows (åtminstone), klagar kompilatorn på att detta inte är en giltig initierare. Därför är konventionen att skicka ``NULL`` till makrot ``PyObject_HEAD_INIT`` och att initiera detta fält explicit i början av modulens initialiseringsfunktion, innan något annat görs. Detta görs typiskt så här::

source: This should be done before any instances of the type are created. :c:func:`PyType_Ready` checks if :c:member:`~PyObject.ob_type` is ``NULL``, and if so, initializes it to the :c:member:`~PyObject.ob_type` field of the base class. :c:func:`PyType_Ready` will not change this field if it is non-zero.
sv: Detta bör göras innan några instanser av typen skapas. :c:func:`PyType_Ready` kontrollerar om :c:member:`~PyObject.ob_type` är ``NULL``, och initialiserar det i så fall till fältet :c:member:`~PyObject.ob_type` i basklassen. :c:func:`PyType_Ready` ändrar inte detta fält om det är icke-noll.

source: This field is inherited by subtypes.
sv: Detta fält ärvs av subtyperna.

source: PyVarObject Slots
sv: PyVarObject platser

source: For :ref:`statically allocated type objects <static-types>`, this should be initialized to zero. For :ref:`dynamically allocated type objects <heap-types>`, this field has a special internal meaning.
sv: För :ref:``statiskt allokerade typobjekt <static-types>`, bör detta initialiseras till noll. För :ref:``dynamiskt allokerade typobjekt <heap-types>`, har detta fält en speciell intern betydelse.

source: This field should be accessed using the :c:func:`Py_SIZE()` macro.
sv: Detta fält bör nås med hjälp av makrot :c:func:`Py_SIZE()`.

source: PyTypeObject Slots
sv: PyTypeObject platser

source: Each slot has a section describing inheritance. If :c:func:`PyType_Ready` may set a value when the field is set to ``NULL`` then there will also be a "Default" section. (Note that many fields set on :c:data:`PyBaseObject_Type` and :c:data:`PyType_Type` effectively act as defaults.)
sv: Varje slot har ett avsnitt som beskriver nedärvning. Om :c:func:`PyType_Ready` kan sätta ett värde när fältet är satt till ``NULL`` så kommer det också att finnas en "Default" sektion. (Observera att många fält som anges i :c:data:`PyBaseObject_Type` och :c:data:`PyType_Type` fungerar som standardvärden)

source: Pointer to a NUL-terminated string containing the name of the type. For types that are accessible as module globals, the string should be the full module name, followed by a dot, followed by the type name; for built-in types, it should be just the type name. If the module is a submodule of a package, the full package name is part of the full module name. For example, a type named :class:`!T` defined in module :mod:`!M` in subpackage :mod:`!Q` in package :mod:`!P` should have the :c:member:`~PyTypeObject.tp_name` initializer ``"P.Q.M.T"``.
sv: Pekare till en NUL-avslutad sträng som innehåller typens namn. För typer som är tillgängliga som modulglobaler ska strängen vara det fullständiga modulnamnet, följt av en punkt, följt av typnamnet; för inbyggda typer ska det bara vara typnamnet. Om modulen är en undermodul till ett paket ingår det fullständiga paketnamnet i det fullständiga modulnamnet. Till exempel, en typ med namnet :class:`!T` definierad i modul :mod:`!M` i underpaket :mod:`!Q` i paket :mod:`!P` bör ha :c:member:`~PyTypeObject.tp_name` initialiseraren ``"P.Q.M.T"``.

source: For :ref:`dynamically allocated type objects <heap-types>`, this should just be the type name, and the module name explicitly stored in the type dict as the value for key ``'__module__'``.
sv: För :ref:``dynamiskt allokerade typobjekt <heap-types>`` bör detta bara vara typnamnet och modulnamnet som uttryckligen lagras i typdikten som värde för nyckeln ``'__module__'``.

source: For :ref:`statically allocated type objects <static-types>`, the *tp_name* field should contain a dot. Everything before the last dot is made accessible as the :attr:`~type.__module__` attribute, and everything after the last dot is made accessible as the :attr:`~type.__name__` attribute.
sv: För :ref:``statiskt allokerade typobjekt <static-types>`` ska fältet *tp_name* innehålla en punkt. Allt före den sista punkten görs tillgängligt som attributet :attr:`~type.__module__`, och allt efter den sista punkten görs tillgängligt som attributet :attr:`~type.__name__`.

source: If no dot is present, the entire :c:member:`~PyTypeObject.tp_name` field is made accessible as the :attr:`~type.__name__` attribute, and the :attr:`~type.__module__` attribute is undefined (unless explicitly set in the dictionary, as explained above). This means your type will be impossible to pickle. Additionally, it will not be listed in module documentations created with pydoc.
sv: Om ingen punkt finns, görs hela fältet :c:member:`~PyTypeObject.tp_name` tillgängligt som attributet :attr:`~type.__name__`, och attributet :attr:`~type.__module__` är odefinierat (om det inte uttryckligen har angetts i ordlistan, enligt vad som förklaras ovan). Detta innebär att din typ inte kommer att kunna plockas. Dessutom kommer den inte att listas i moduldokumentationer som skapats med pydoc.

source: This field must not be ``NULL``. It is the only required field in :c:func:`PyTypeObject` (other than potentially :c:member:`~PyTypeObject.tp_itemsize`).
sv: Detta fält får inte vara ``NULL``. Det är det enda obligatoriska fältet i :c:func:`PyTypeObject` (förutom eventuellt :c:member:`~PyTypeObject.tp_itemsize`).

source: These fields allow calculating the size in bytes of instances of the type.
sv: Dessa fält gör det möjligt att beräkna storleken i bytes för instanser av typen.

source: There are two kinds of types: types with fixed-length instances have a zero :c:member:`!tp_itemsize` field, types with variable-length instances have a non-zero :c:member:`!tp_itemsize` field. For a type with fixed-length instances, all instances have the same size, given in :c:member:`!tp_basicsize`. (Exceptions to this rule can be made using :c:func:`PyUnstable_Object_GC_NewWithExtraData`.)
sv: Det finns två typer av typer: typer med instanser med fast längd har fältet :c:member:`!tp_itemsize` som är noll, medan typer med instanser med variabel längd har fältet :c:member:`!tp_itemsize` som inte är noll. För en typ med instanser med fast längd har alla instanser samma storlek, angiven i :c:member:`!tp_basicsize`. (Undantag från denna regel kan göras med hjälp av :c:func:`PyUnstable_Object_GC_NewWithExtraData`)

source: For a type with variable-length instances, the instances must have an :c:member:`~PyVarObject.ob_size` field, and the instance size is :c:member:`!tp_basicsize` plus N times :c:member:`!tp_itemsize`, where N is the "length" of the object.
sv: För en typ med instanser med variabel längd måste instanserna ha ett fält :c:member:`~PyVarObject.ob_size`, och instansstorleken är :c:member:`!tp_basicsize` plus N gånger :c:member:`!tp_itemsize`, där N är objektets "längd".

source: Functions like :c:func:`PyObject_NewVar` will take the value of N as an argument, and store in the instance's :c:member:`~PyVarObject.ob_size` field. Note that the :c:member:`~PyVarObject.ob_size` field may later be used for other purposes. For example, :py:type:`int` instances use the bits of :c:member:`~PyVarObject.ob_size` in an implementation-defined way; the underlying storage and its size should be accessed using :c:func:`PyLong_Export`.
sv: Funktioner som :c:func:`PyObject_NewVar` tar värdet av N som ett argument och lagrar det i instansens :c:member:`~PyVarObject.ob_size`-fält. Observera att fältet :c:member:`~PyVarObject.ob_size` senare kan användas för andra ändamål. Exempelvis använder instanser av :py:type:`int` bitarna i :c:member:`~PyVarObject.ob_size` på ett implementationsdefinierat sätt; den underliggande lagringen och dess storlek bör nås med hjälp av :c:func:`PyLong_Export`.

source: The :c:member:`~PyVarObject.ob_size` field should be accessed using the :c:func:`Py_SIZE()` and :c:func:`Py_SET_SIZE()` macros.
sv: Fältet :c:member:`~PyVarObject.ob_size` bör nås med hjälp av makrona :c:func:`Py_SIZE()` och :c:func:`Py_SET_SIZE()`.

source: Also, the presence of an :c:member:`~PyVarObject.ob_size` field in the instance layout doesn't mean that the instance structure is variable-length. For example, the :py:type:`list` type has fixed-length instances, yet those instances have a :c:member:`~PyVarObject.ob_size` field. (As with :py:type:`int`, avoid reading lists' :c:member:`!ob_size` directly. Call :c:func:`PyList_Size` instead.)
sv: Att det finns ett fält :c:member:`~PyVarObject.ob_size` i instanslayouten betyder inte heller att instansstrukturen har variabel längd. Till exempel har typen :py:type:`list` instanser med fast längd, men dessa instanser har ändå ett fält :c:member:`~PyVarObject.ob_size`. (Precis som med :py:type:`int` bör du undvika att läsa listors :c:member:`!ob_size` direkt. Anropa :c:func:`PyList_Size` istället)

source: The :c:member:`!tp_basicsize` includes size needed for data of the type's :c:member:`~PyTypeObject.tp_base`, plus any extra data needed by each instance.
sv: I :c:member:`!tp_basicsize` ingår den storlek som behövs för data i typens :c:member:`~PyTypeObject.tp_base`, plus eventuella extra data som behövs för varje instans.
