Repository: yeager/python-docs-sv
Catalog: c-api/type.po
Languages: sv

source: Type Objects
sv: Typ av objekt

source: The C structure of the objects used to describe built-in types.
sv: C-strukturen för de objekt som används för att beskriva inbyggda typer.

source: This is the type object for type objects; it is the same object as :class:`type` in the Python layer.
sv: Detta är typobjektet för typobjekt; det är samma objekt som :class:`type` i Python-lagret.

source: Return non-zero if the object *o* is a type object, including instances of types derived from the standard type object. Return 0 in all other cases. This function always succeeds.
sv: Returnerar icke-noll om objektet *o* är ett typobjekt, inklusive instanser av typer som härrör från standardtypobjektet. Returnera 0 i alla andra fall. Denna funktion lyckas alltid.

source: Return non-zero if the object *o* is a type object, but not a subtype of the standard type object. Return 0 in all other cases. This function always succeeds.
sv: Returnerar icke-noll om objektet *o* är ett typobjekt, men inte en subtyp av standardtypobjektet. Returnera 0 i alla andra fall. Denna funktion lyckas alltid.

source: Clear the internal lookup cache. Return the current version tag.
sv: Tömmer den interna lookup-cachen. Returnera den aktuella versionstaggen.

source: Return the :c:member:`~PyTypeObject.tp_flags` member of *type*. This function is primarily meant for use with ``Py_LIMITED_API``; the individual flag bits are guaranteed to be stable across Python releases, but access to :c:member:`~PyTypeObject.tp_flags` itself is not part of the :ref:`limited API <limited-c-api>`.
sv: Returnerar :c:member:`~PyTypeObject.tp_flags`-medlemmen av *type*. Denna funktion är främst avsedd att användas med ``Py_LIMITED_API``; de enskilda flaggbitarna är garanterat stabila över Python-utgåvor, men åtkomst till :c:member:`~PyTypeObject.tp_flags` i sig är inte en del av :ref:`limited API <limited-c-api>`.

source: The return type is now ``unsigned long`` rather than ``long``.
sv: Returtypen är nu ``unsigned long`` istället för ``long``.

source: Return the type object's internal namespace, which is otherwise only exposed via a read-only proxy (:attr:`cls.__dict__ <type.__dict__>`). This is a replacement for accessing :c:member:`~PyTypeObject.tp_dict` directly. The returned dictionary must be treated as read-only.
sv: Returnerar typobjektets interna namnrymd, som annars bara är tillgänglig via en skrivskyddad proxy (:attr:`cls.__dict__ <type.__dict__>`). Detta är en ersättning för direkt åtkomst till :c:member:`~PyTypeObject.tp_dict`. Den returnerade ordboken måste behandlas som skrivskyddad.

source: This function is meant for specific embedding and language-binding cases, where direct access to the dict is necessary and indirect access (e.g. via the proxy or :c:func:`PyObject_GetAttr`) isn't adequate.
sv: Denna funktion är avsedd för specifika fall av inbäddning och språkbindning, där direkt åtkomst till dict är nödvändig och indirekt åtkomst (t.ex. via proxy eller :c:func:`PyObject_GetAttr`) inte är tillräcklig.

source: Extension modules should continue to use ``tp_dict``, directly or indirectly, when setting up their own types.
sv: Tilläggsmoduler bör fortsätta att använda ``tp_dict``, direkt eller indirekt, när de skapar sina egna typer.

source: Invalidate the internal lookup cache for the type and all of its subtypes. This function must be called after any manual modification of the attributes or base classes of the type.
sv: Invalidera den interna lookup-cachen för typen och alla dess subtyper. Denna funktion måste anropas efter varje manuell ändring av typens attribut eller basklasser.

source: Register *callback* as a type watcher. Return a non-negative integer ID which must be passed to future calls to :c:func:`PyType_Watch`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
sv: Registrera *callback* som en typövervakare. Returnera ett icke-negativt heltals-ID som måste skickas till framtida anrop till :c:func:`PyType_Watch`. I händelse av fel (t.ex. inga fler bevaknings-IDs tillgängliga), returnera ``-1`` och sätt ett undantag.

source: In free-threaded builds, :c:func:`PyType_AddWatcher` is not thread-safe, so it must be called at start up (before spawning the first thread).
sv: I fritt trådade system är :c:func:`PyType_AddWatcher` inte trådsäker, så den måste anropas vid start (innan den första tråden skapas).

source: Clear watcher identified by *watcher_id* (previously returned from :c:func:`PyType_AddWatcher`). Return ``0`` on success, ``-1`` on error (e.g. if *watcher_id* was never registered.)
sv: Rensa en övervakare som identifierats av *watcher_id* (tidigare returnerad från :c:func:`PyType_AddWatcher`). Returnerar ``0`` vid framgång, ``-1`` vid fel (t.ex. om *watcher_id* aldrig registrerades)

source: An extension should never call ``PyType_ClearWatcher`` with a *watcher_id* that was not returned to it by a previous call to :c:func:`PyType_AddWatcher`.
sv: Ett tillägg bör aldrig anropa ``PyType_ClearWatcher`` med ett *watcher_id* som inte returnerades till det av ett tidigare anrop till :c:func:`PyType_AddWatcher`.

source: Mark *type* as watched. The callback granted *watcher_id* by :c:func:`PyType_AddWatcher` will be called whenever :c:func:`PyType_Modified` reports a change to *type*. (The callback may be called only once for a series of consecutive modifications to *type*, if :c:func:`!_PyType_Lookup` is not called on *type* between the modifications; this is an implementation detail and subject to change.)
sv: Markera *type* som bevakad. Återkallelsen som tilldelats *watcher_id* av :c:func:`PyType_AddWatcher` kommer att anropas varje gång :c:func:`PyType_Modified` rapporterar en ändring av *type*. (Återkallelsen kan anropas endast en gång för en serie på varandra följande ändringar av *type*, om :c:func:`!_PyType_Lookup` inte anropas på *type* mellan ändringarna; detta är en implementationsdetalj och kan komma att ändras)

source: An extension should never call ``PyType_Watch`` with a *watcher_id* that was not returned to it by a previous call to :c:func:`PyType_AddWatcher`.
sv: Ett tillägg bör aldrig anropa ``PyType_Watch`` med ett *watcher_id* som inte returnerades till det av ett tidigare anrop till :c:func:`PyType_AddWatcher`.

source: Type of a type-watcher callback function.
sv: Typ av callback-funktion för en typbevakare.

source: The callback must not modify *type* or cause :c:func:`PyType_Modified` to be called on *type* or any type in its MRO; violating this rule could cause infinite recursion.
sv: Återkallelsen får inte modifiera *typ* eller orsaka att :c:func:`PyType_Modified` anropas på *typ* eller någon typ i dess MRO; att bryta mot denna regel kan orsaka oändlig rekursion.

source: Return non-zero if the type object *o* sets the feature *feature*. Type features are denoted by single bit flags.
sv: Returnerar icke-noll om typobjektet *o* anger egenskapen *feature*. Typfunktioner betecknas med enbitsflaggor.

source: Return true if the type object includes support for the cycle detector; this tests the type flag :c:macro:`Py_TPFLAGS_HAVE_GC`.
sv: Returnerar true om typobjektet innehåller stöd för cykeldetektorn; detta testar typflaggan :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Return true if *a* is a subtype of *b*.
sv: Returnerar true om *a* är en subtyp av *b*.

source: This function only checks for actual subtypes, which means that :meth:`~type.__subclasscheck__` is not called on *b*. Call :c:func:`PyObject_IsSubclass` to do the same check that :func:`issubclass` would do.
sv: Den här funktionen kontrollerar bara faktiska subtyper, vilket innebär att :meth:`~type.__subclasscheck__` inte anropas på *b*. Anropa :c:func:`PyObject_IsSubclass` för att göra samma kontroll som :func:`issubclass` skulle göra.

source: Generic handler for the :c:member:`~PyTypeObject.tp_alloc` slot of a type object. Uses Python's default memory allocation mechanism to allocate memory for a new instance, zeros the memory, then initializes the memory as if by calling :c:func:`PyObject_Init` or :c:func:`PyObject_InitVar`.
sv: Generisk hanterare för :c:member:`~PyTypeObject.tp_alloc`-platsen för ett typobjekt. Använder Pythons standardmekanism för minnesallokering för att allokera minne för en ny instans, nollställer minnet och initialiserar sedan minnet som om det hade anropats :c:func:`PyObject_Init` eller :c:func:`PyObject_InitVar`.

source: Do not call this directly to allocate memory for an object; call the type's :c:member:`~PyTypeObject.tp_alloc` slot instead.
sv: Anropa inte detta direkt för att allokera minne för ett objekt; anropa istället typens :c:member:`~PyTypeObject.tp_alloc` slot.

source: For types that support garbage collection (i.e., the :c:macro:`Py_TPFLAGS_HAVE_GC` flag is set), this function behaves like :c:macro:`PyObject_GC_New` or :c:macro:`PyObject_GC_NewVar` (except the memory is guaranteed to be zeroed before initialization), and should be paired with :c:func:`PyObject_GC_Del` in :c:member:`~PyTypeObject.tp_free`. Otherwise, it behaves like :c:macro:`PyObject_New` or :c:macro:`PyObject_NewVar` (except the memory is guaranteed to be zeroed before initialization) and should be paired with :c:func:`PyObject_Free` in :c:member:`~PyTypeObject.tp_free`.
sv: För typer som stöder garbage collection (dvs, flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` är satt), beter sig denna funktion som :c:macro:`PyObject_GC_New` eller :c:macro:`PyObject_GC_NewVar` (förutom att minnet garanterat nollställs före initialisering), och bör paras ihop med :c:func:`PyObject_GC_Del` i :c:member:`~PyTypeObject.tp_free`. Annars beter den sig som :c:macro:`PyObject_New` eller :c:macro:`PyObject_NewVar` (förutom att minnet garanterat nollställs före initialisering) och bör paras ihop med :c:func:`PyObject_Free` i :c:member:`~PyTypeObject.tp_free`.

source: Generic handler for the :c:member:`~PyTypeObject.tp_new` slot of a type object. Creates a new instance using the type's :c:member:`~PyTypeObject.tp_alloc` slot and returns the resulting object.
sv: Generisk hanterare för :c:member:`~PyTypeObject.tp_new` slot för ett typobjekt. Skapar en ny instans med hjälp av typens :c:member:`~PyTypeObject.tp_alloc` slot och returnerar det resulterande objektet.

source: Finalize a type object. This should be called on all type objects to finish their initialization. This function is responsible for adding inherited slots from a type's base class. Return ``0`` on success, or return ``-1`` and sets an exception on error.
sv: Slutför ett typobjekt. Detta bör anropas på alla typobjekt för att avsluta deras initialisering. Denna funktion är ansvarig för att lägga till ärvda slots från en typs basklass. Returnera ``0`` vid framgång, eller returnera ``-1`` och skapa ett undantag vid fel.

source: If some of the base classes implements the GC protocol and the provided type does not include the :c:macro:`Py_TPFLAGS_HAVE_GC` in its flags, then the GC protocol will be automatically implemented from its parents. On the contrary, if the type being created does include :c:macro:`Py_TPFLAGS_HAVE_GC` in its flags then it **must** implement the GC protocol itself by at least implementing the :c:member:`~PyTypeObject.tp_traverse` handle.
sv: Om någon av basklasserna implementerar GC-protokollet och den angivna typen inte innehåller :c:macro:`Py_TPFLAGS_HAVE_GC` i sina flaggor, kommer GC-protokollet automatiskt att implementeras från dess föräldrar. Tvärtom, om den typ som skapas inkluderar :c:macro:`Py_TPFLAGS_HAVE_GC` i sina flaggor så **måste** den implementera GC-protokollet själv genom att åtminstone implementera :c:member:`~PyTypeObject.tp_traverse`-handtaget.

source: Return the type's name. Equivalent to getting the type's :attr:`~type.__name__` attribute.
sv: Returnerar typens namn. Motsvarar att hämta typens attribut :attr:`~type.__name__`.

source: Return the type's qualified name. Equivalent to getting the type's :attr:`~type.__qualname__` attribute.
sv: Returnerar typens kvalificerade namn. Motsvarar hämtning av typens attribut :attr:`~type.__qualname__`.

source: Return the type's fully qualified name. Equivalent to ``f"{type.__module__}.{type.__qualname__}"``, or :attr:`type.__qualname__` if :attr:`type.__module__` is not a string or is equal to ``"builtins"``.
sv: Returnerar typens fullständigt kvalificerade namn. Motsvarar ``f"{type.__module__}.{type.__qualname__}"``, eller :attr:`type.__qualname__` om :attr:`type.__module__` inte är en sträng eller är lika med ``"builtins"``.

source: Return the type's module name. Equivalent to getting the :attr:`type.__module__` attribute.
sv: Returnerar typens modulnamn. Motsvarar hämtning av attributet :attr:`type.__module__`.

source: Return the function pointer stored in the given slot. If the result is ``NULL``, this indicates that either the slot is ``NULL``, or that the function was called with invalid parameters. Callers will typically cast the result pointer into the appropriate function type.
sv: Returnerar den funktionspekare som finns lagrad i den angivna sloten. Om resultatet är ``NULL``, indikerar detta att antingen slotten är ``NULL``, eller att funktionen anropades med ogiltiga parametrar. Anropare kommer vanligtvis att kasta resultatpekaren till lämplig funktionstyp.

source: See :c:member:`PyType_Slot.slot` for possible values of the *slot* argument.
sv: Se :c:member:`PyType_Slot.slot` för möjliga värden på argumentet *slot*.

source: :c:func:`PyType_GetSlot` can now accept all types. Previously, it was limited to :ref:`heap types <heap-types>`.
sv: :c:func:`PyType_GetSlot` kan nu acceptera alla typer. Tidigare var det begränsat till :ref:``heap types <heap-types>``.

source: Return the module object associated with the given type when the type was created using :c:func:`PyType_FromModuleAndSpec`.
sv: Returnerar modulobjektet som associeras med den angivna typen när typen skapades med :c:func:`PyType_FromModuleAndSpec`.

source: If no module is associated with the given type, sets :py:class:`TypeError` and returns ``NULL``.
sv: Om ingen modul är associerad med den angivna typen, anger :py:class:`TypeError` och returnerar ``NULL``.

source: This function is usually used to get the module in which a method is defined. Note that in such a method, ``PyType_GetModule(Py_TYPE(self))`` may not return the intended result. ``Py_TYPE(self)`` may be a *subclass* of the intended class, and subclasses are not necessarily defined in the same module as their superclass. See :c:type:`PyCMethod` to get the class that defines the method. See :c:func:`PyType_GetModuleByDef` for cases when :c:type:`!PyCMethod` cannot be used.
sv: Denna funktion används vanligtvis för att hämta den modul i vilken en metod är definierad. Observera att i en sådan metod kanske inte ``PyType_GetModule(Py_TYPE(self))`` returnerar det avsedda resultatet. ``Py_TYPE(self)`` kan vara en *subklass* av den avsedda klassen, och subklasser definieras inte nödvändigtvis i samma modul som deras superklass. Se :c:type:`PyCMethod` för att få den klass som definierar metoden. Se :c:func:`PyType_GetModuleByDef` för fall då :c:type:`!PyCMethod` inte kan användas.

source: Return the state of the module object associated with the given type. This is a shortcut for calling :c:func:`PyModule_GetState()` on the result of :c:func:`PyType_GetModule`.
sv: Returnerar tillståndet för modulobjektet som är associerat med den givna typen. Detta är en genväg för att anropa :c:func:`PyModule_GetState()` på resultatet av :c:func:`PyType_GetModule`.

source: If the *type* has an associated module but its state is ``NULL``, returns ``NULL`` without setting an exception.
sv: Om *typen* har en associerad modul men dess tillstånd är ``NULL``, returneras ``NULL`` utan att ett undantag anges.

source: Find the first superclass whose module was created from the given :c:type:`PyModuleDef` *def*, and return that module.
sv: Hitta den första superklassen vars modul skapades från den givna :c:type:`PyModuleDef` *def*, och returnera den modulen.

source: If no module is found, raises a :py:class:`TypeError` and returns ``NULL``.
sv: Om ingen modul hittas genereras ett :py:class:`TypeError` och returnerar ``NULL``.

source: This function is intended to be used together with :c:func:`PyModule_GetState()` to get module state from slot methods (such as :c:member:`~PyTypeObject.tp_init` or :c:member:`~PyNumberMethods.nb_add`) and other places where a method's defining class cannot be passed using the :c:type:`PyCMethod` calling convention.
sv: Den här funktionen är avsedd att användas tillsammans med :c:func:`PyModule_GetState()` för att hämta modulstatus från slot-metoder (t.ex. :c:member:`~PyTypeObject.tp_init` eller :c:member:`~PyNumberMethods.nb_add`) och andra ställen där en metods definierande klass inte kan skickas med anropskonventionen :c:type:`PyCMethod`.

source: The returned reference is :term:`borrowed <borrowed reference>` from *type*, and will be valid as long as you hold a reference to *type*. Do not release it with :c:func:`Py_DECREF` or similar.
sv: Den returnerade referensen är :term:`borrowed <borrowed reference>` från *type*, och kommer att vara giltig så länge du har en referens till *type*. Frigör den inte med :c:func:`Py_DECREF` eller liknande.

source: Find the first superclass in *type*'s :term:`method resolution order` whose :c:macro:`Py_tp_token` token is equal to the given one.
sv: Hitta den första superklassen i *typ*:s :term:`method resolution order` vars :c:macro:`Py_tp_token`-token är lika med den angivna.

source: If found, set *\*result* to a new :term:`strong reference` to it and return ``1``.
sv: Om den hittas, sätt *\*result* till en ny :term:`strong reference` till den och returnera ``1``.

source: If not found, set *\*result* to ``NULL`` and return ``0``.
sv: Om den inte hittas, sätt *\*result* till ``NULL`` och returnera ``0``.

source: On error, set *\*result* to ``NULL`` and return ``-1`` with an exception set.
sv: Vid fel, sätt *\*result* till ``NULL`` och returnera ``-1`` med en undantagsuppsättning.

source: The *result* argument may be ``NULL``, in which case *\*result* is not set. Use this if you need only the return value.
sv: Argumentet *result* kan vara ``NULL``, i vilket fall *\*result* inte anges. Använd detta om du bara behöver returvärdet.

source: The *token* argument may not be ``NULL``.
sv: Argumentet *token* får inte vara ``NULL``.

source: Attempt to assign a version tag to the given type.
sv: Försök att tilldela en versionstagg till den angivna typen.

source: Returns 1 if the type already had a valid version tag or a new one was assigned, or 0 if a new tag could not be assigned.
sv: Returnerar 1 om typen redan har en giltig versionstagg eller om en ny har tilldelats, eller 0 om en ny tagg inte kunde tilldelas.

source: Creating Heap-Allocated Types
sv: Skapa Heap-allokerade typer

source: The following functions and structs are used to create :ref:`heap types <heap-types>`.
sv: Följande funktioner och strukturer används för att skapa :ref:`heap types <heap-types>`.

source: Create and return a :ref:`heap type <heap-types>` from the *spec* (see :c:macro:`Py_TPFLAGS_HEAPTYPE`).
sv: Skapa och returnera en :ref:`heap type <heap-types>`` från *spec* (se :c:macro:`Py_TPFLAGS_HEAPTYPE`).

source: The metaclass *metaclass* is used to construct the resulting type object. When *metaclass* is ``NULL``, the metaclass is derived from *bases* (or *Py_tp_base[s]* slots if *bases* is ``NULL``, see below).
sv: Metaklassen *metaclass* används för att konstruera det resulterande typobjektet. När *metaclass* är ``NULL`` härleds metaklassen från *bases* (eller *Py_tp_base[s]* slots om *bases* är ``NULL``, se nedan).

source: Metaclasses that override :c:member:`~PyTypeObject.tp_new` are not supported, except if ``tp_new`` is ``NULL``.
sv: Metaklasser som åsidosätter :c:member:`~PyTypeObject.tp_new` stöds inte, förutom om ``tp_new`` är ``NULL``.

source: The *bases* argument can be used to specify base classes; it can either be only one class or a tuple of classes. If *bases* is ``NULL``, the *Py_tp_bases* slot is used instead. If that also is ``NULL``, the *Py_tp_base* slot is used instead. If that also is ``NULL``, the new type derives from :class:`object`.
sv: Argumentet *bases* kan användas för att ange basklasser; det kan antingen vara bara en klass eller en tupel av klasser. Om *bases* är ``NULL`` används istället *Py_tp_bases* slot. Om det också är ``NULL``, används *Py_tp_base* slot istället. Om det också är ``NULL``, härstammar den nya typen från :class:`object`.

source: The *module* argument can be used to record the module in which the new class is defined. It must be a module object or ``NULL``. If not ``NULL``, the module is associated with the new type and can later be retrieved with :c:func:`PyType_GetModule`. The associated module is not inherited by subclasses; it must be specified for each class individually.
sv: Argumentet *module* kan användas för att registrera den modul i vilken den nya klassen definieras. Det måste vara ett modulobjekt eller ``NULL``. Om det inte är ``NULL`` associeras modulen med den nya typen och kan senare hämtas med :c:func:`PyType_GetModule`. Den associerade modulen ärvs inte av underklasser utan måste anges för varje klass för sig.

source: This function calls :c:func:`PyType_Ready` on the new type.
sv: Denna funktion anropar :c:func:`PyType_Ready` på den nya typen.

source: Note that this function does *not* fully match the behavior of calling :py:class:`type() <type>` or using the :keyword:`class` statement. With user-provided base types or metaclasses, prefer :ref:`calling <capi-call>` :py:class:`type` (or the metaclass) over ``PyType_From*`` functions. Specifically:
sv: Observera att den här funktionen *inte* helt matchar beteendet för att anropa :py:class:`type() <type>` eller använda :keyword:`class`-satsen. Med användartillhandahållna bastyper eller metaklasser, föredra :ref:`anrop <capi-call>` :py:class:`type` (eller metaklassen) framför ``PyType_From*``-funktioner. Specifikt för detta:

source: :py:meth:`~object.__new__` is not called on the new class (and it must be set to ``type.__new__``).
sv: :py:meth:`~object.__new__` anropas inte på den nya klassen (och den måste sättas till ``type.__new__``).

source: :py:meth:`~object.__init__` is not called on the new class.
sv: :py:meth:`~object.__init__` anropas inte på den nya klassen.

source: :py:meth:`~object.__init_subclass__` is not called on any bases.
sv: :py:meth:`~object.__init_subclass__` anropas inte på någon bas.

source: :py:meth:`~object.__set_name__` is not called on new descriptors.
sv: :py:meth:`~object.__set_name__` anropas inte på nya deskriptorer.

source: Equivalent to ``PyType_FromMetaclass(NULL, module, spec, bases)``.
sv: Motsvarar ``PyType_FromMetaclass(NULL, module, spec, bases)``.

source: The function now accepts a single class as the *bases* argument and ``NULL`` as the ``tp_doc`` slot.
sv: Funktionen accepterar nu en enda klass som *bases*-argument och ``NULL`` som ``tp_doc``-plats.

source: The function now finds and uses a metaclass corresponding to the provided base classes. Previously, only :class:`type` instances were returned.
sv: Funktionen hittar och använder nu en metaklass som motsvarar de angivna basklasserna. Tidigare returnerades endast :class:`type`-instanser.

source: The :c:member:`~PyTypeObject.tp_new` of the metaclass is *ignored*. which may result in incomplete initialization. Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated.
sv: Metaklassens :c:member:`~PyTypeObject.tp_new` är *ignorerad*, vilket kan leda till ofullständig initialisering. Att skapa klasser vars metaklass åsidosätter :c:member:`~PyTypeObject.tp_new` är föråldrat.
