Repository: yeager/python-docs-sv
Catalog: installing/index.po
Languages: sv

source: Installing Python Modules
sv: Installera Python-moduler

source: Email
sv: E-post

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
sv: Som ett populärt utvecklingsprojekt med öppen källkod har Python en aktiv stödgrupp av bidragsgivare och användare som också gör sin programvara tillgänglig för andra Python-utvecklare att använda under licensvillkor för öppen källkod.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
sv: Detta gör det möjligt för Python-användare att dela och samarbeta effektivt, dra nytta av de lösningar som andra redan har skapat för vanliga (och ibland till och med sällsynta!) problem, samt potentiellt bidra med sina egna lösningar till den gemensamma poolen.

source: This guide covers the installation part of the process. For a guide to creating and sharing your own Python projects, refer to the `Python packaging user guide`_.
sv: Den här guiden täcker installationsdelen av processen. En guide till hur du skapar och delar dina egna Python-projekt finns i `Python packaging user guide`_.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
sv: För företag och andra institutionella användare bör du vara medveten om att många organisationer har sina egna policyer kring användning av och bidrag till programvara med öppen källkod. Ta hänsyn till sådana policyer när du använder de distributions- och installationsverktyg som medföljer Python.

source: Key terms
sv: Nyckelbegrepp

source: ``pip`` is the preferred installer program. Starting with Python 3.4, it is included by default with the Python binary installers.
sv: ``pip`` är det föredragna installationsprogrammet. Från och med Python 3.4 ingår det som standard i Pythons binära installationsprogram.

source: A *virtual environment* is a semi-isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide.
sv: En *virtuell miljö* är en semiisolerad Python-miljö som gör att paket kan installeras för att användas av ett visst program, i stället för att installeras i hela systemet.

source: ``venv`` is the standard tool for creating virtual environments, and has been part of Python since Python 3.3. Starting with Python 3.4, it defaults to installing ``pip`` into all created virtual environments.
sv: ``venv`` är standardverktyget för att skapa virtuella miljöer och har varit en del av Python sedan Python 3.3. Från och med Python 3.4 installeras ``pip`` som standard i alla virtuella miljöer som skapas.

source: ``virtualenv`` is a third party alternative (and predecessor) to ``venv``. It allows virtual environments to be used on versions of Python prior to 3.4, which either don't provide ``venv`` at all, or aren't able to automatically install ``pip`` into created environments.
sv: ``virtualenv`` är ett tredjepartsalternativ (och föregångare) till ``venv``. Det gör att virtuella miljöer kan användas på versioner av Python före 3.4, som antingen inte tillhandahåller ``venv`` alls, eller inte automatiskt kan installera ``pip`` i skapade miljöer.

source: The `Python Package Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users.
sv: Python Package Index <https://pypi.org>`__ är ett offentligt arkiv med licensierade paket med öppen källkod som görs tillgängliga för användning av andra Python-användare.

source: the `Python Packaging Authority <https://www.pypa.io/>`__ is the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation, and issue trackers on `GitHub <https://github.com/pypa>`__.
sv: python Packaging Authority <https://www.pypa.io/>`__ är en grupp av utvecklare och dokumentationsförfattare som ansvarar för underhåll och utveckling av standardpaketeringsverktygen och tillhörande metadata och filformatstandarder. De underhåller en mängd olika verktyg, dokumentation och problemspårare på `GitHub <https://github.com/pypa>`__.

source: ``distutils`` is the original build and distribution system first added to the Python standard library in 1998. While direct use of ``distutils`` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
sv: ``distutils`` är det ursprungliga bygg- och distributionssystemet som först lades till i Pythons standardbibliotek 1998. Även om direkt användning av ``distutils`` håller på att fasas ut, lade det fortfarande grunden för den nuvarande förpacknings- och distributionsinfrastrukturen, och det förblir inte bara en del av standardbiblioteket, utan dess namn lever vidare på andra sätt (till exempel namnet på e-postlistan som används för att samordna utvecklingen av Pythons förpackningsstandarder).

source: The use of ``venv`` is now recommended for creating virtual environments.
sv: Användningen av ``venv`` rekommenderas nu för att skapa virtuella miljöer.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/installing/#creating-virtual-environments>`__
sv: `Python Packaging Användarhandbok: Skapa och använda virtuella miljöer <https://packaging.python.org/installing/#creating-virtual-environments>`__

source: Basic usage
sv: Grundläggande användning

source: The standard packaging tools are all designed to be used from the command line.
sv: Standardverktygen för paketering är alla utformade för att användas från kommandoraden.

source: The following command will install the latest version of a module and its dependencies from the Python Package Index::
sv: Följande kommando installerar den senaste versionen av en modul och dess beroenden från Python Package Index::

source: python -m pip install SomePackage
sv: python -m pip installera SomePackage

source: For POSIX users (including macOS and Linux users), the examples in this guide assume the use of a :term:`virtual environment`.
sv: För POSIX-användare (inklusive MacOS- och Linux-användare) förutsätter exemplen i den här guiden att en :term:`virtuell miljö` används.

source: For Windows users, the examples in this guide assume that the option to adjust the system PATH environment variable was selected when installing Python.
sv: För Windows-användare förutsätter exemplen i den här guiden att alternativet att justera systemets PATH-miljövariabel valdes när Python installerades.

source: It's also possible to specify an exact or minimum version directly on the command line. When using comparator operators such as ``>``, ``<`` or some other special character which get interpreted by shell, the package name and the version should be enclosed within double quotes::
sv: Det är också möjligt att ange en exakt eller minsta version direkt på kommandoraden. När du använder jämförelseoperatorer som ``>``, ``<`` eller något annat specialtecken som tolkas av shell, ska paketnamnet och versionen anges inom dubbla citattecken::

source: python -m pip install SomePackage==1.0.4 # specific version python -m pip install "SomePackage>=1.0.4" # minimum version
sv: python -m pip install SomePackage==1.0.4 # specifik version python -m pip install "SomePackage>=1.0.4" # minsta version

source: Normally, if a suitable module is already installed, attempting to install it again will have no effect. Upgrading existing modules must be requested explicitly::
sv: Om en lämplig modul redan är installerad kommer det normalt inte att ha någon effekt att försöka installera den igen. Uppgradering av befintliga moduler måste uttryckligen begäras::

source: python -m pip install --upgrade SomePackage
sv: python -m pip install --upgrade NågotPaket

source: More information and resources regarding ``pip`` and its capabilities can be found in the `Python Packaging User Guide <https://packaging.python.org>`__.
sv: Mer information och resurser om ``pip`` och dess funktioner finns i `Python Packaging User Guide <https://packaging.python.org>`__.

source: Creation of virtual environments is done through the :mod:`venv` module. Installing packages into an active virtual environment uses the commands shown above.
sv: Skapandet av virtuella miljöer görs med modulen :mod:`venv`. För att installera paket i en aktiv virtuell miljö används de kommandon som visas ovan.

source: `Python Packaging User Guide: Installing Python Distribution Packages <https://packaging.python.org/installing/>`__
sv: `Python Packaging Användarhandbok: Installera Python-distributionspaket <https://packaging.python.org/installing/>`__

source: How do I ...?
sv: Hur gör jag...?

source: These are quick answers or links for some common tasks.
sv: Här hittar du snabba svar eller länkar till några vanliga uppgifter.

source: ... install ``pip`` in versions of Python prior to Python 3.4?
sv: ... installera ``pip`` i versioner av Python före Python 3.4?

source: Python only started bundling ``pip`` with Python 3.4. For earlier versions, ``pip`` needs to be "bootstrapped" as described in the Python Packaging User Guide.
sv: Python började paketera ``pip`` först med Python 3.4. För tidigare versioner måste ``pip`` "bootstrappas" enligt beskrivningen i Python Packaging User Guide.

source: `Python Packaging User Guide: Requirements for Installing Packages <https://packaging.python.org/installing/#requirements-for-installing-packages>`__
sv: `Python Packaging Användarhandbok: Krav för installation av paket <https://packaging.python.org/installing/#requirements-for-installing-packages>`__

source: ... install packages just for the current user?
sv: ... installera paket bara för den aktuella användaren?

source: Passing the ``--user`` option to ``python -m pip install`` will install a package just for the current user, rather than for all users of the system.
sv: Om du anger alternativet ``--user`` till ``python -m pip install`` installeras ett paket bara för den aktuella användaren, i stället för för alla användare i systemet.

source: ... install scientific Python packages?
sv: ... installera vetenskapliga Python-paket?

source: A number of scientific Python packages have complex binary dependencies, and aren't currently easy to install using ``pip`` directly. At this point in time, it will often be easier for users to install these packages by `other means <https://packaging.python.org/science/>`__ rather than attempting to install them with ``pip``.
sv: Ett antal vetenskapliga Python-paket har komplexa binära beroenden och är för närvarande inte lätta att installera direkt med ``pip``. För närvarande är det ofta enklare för användare att installera dessa paket på annat sätt <https://packaging.python.org/science/>`__ än att försöka installera dem med ``pip``.

source: `Python Packaging User Guide: Installing Scientific Packages <https://packaging.python.org/science/>`__
sv: `Python Packaging Användarhandbok: Installera vetenskapliga paket <https://packaging.python.org/science/>`__

source: ... work with multiple versions of Python installed in parallel?
sv: ... arbeta med flera versioner av Python installerade parallellt?

source: On Linux, macOS, and other POSIX systems, use the versioned Python commands in combination with the ``-m`` switch to run the appropriate copy of ``pip``::
sv: På Linux, macOS och andra POSIX-system använder du de versionsanpassade Python-kommandona i kombination med ``-m``-omkopplaren för att köra rätt kopia av ``pip``::

source: python2 -m pip install SomePackage # default Python 2 python2.7 -m pip install SomePackage # specifically Python 2.7 python3 -m pip install SomePackage # default Python 3 python3.4 -m pip install SomePackage # specifically Python 3.4
sv: python2 -m pip installera SomePackage # standard Python 2 python2.7 -m pip installera SomePackage # specifikt Python 2.7 python3 -m pip installera SomePackage # standard Python 3 python3.4 -m pip install SomePackage # specifikt Python 3.4

source: Appropriately versioned ``pip`` commands may also be available.
sv: Lämpligt versionerade ``pip``-kommandon kan också finnas tillgängliga.

source: On Windows, use the ``py`` Python launcher in combination with the ``-m`` switch::
sv: I Windows använder du Python-startprogrammet ``py`` i kombination med omkopplaren ``-m``::

source: py -2 -m pip install SomePackage # default Python 2 py -2.7 -m pip install SomePackage # specifically Python 2.7 py -3 -m pip install SomePackage # default Python 3 py -3.4 -m pip install SomePackage # specifically Python 3.4
sv: py -2 -m pip install SomePackage # standard Python 2 py -2.7 -m pip installera SomePackage # specifikt Python 2.7 py -3 -m pip installera SomePackage # standard Python 3 py -3.4 -m pip installera SomePackage # specifikt Python 3.4

source: Common installation issues
sv: Vanliga installationsproblem

source: Installing into the system Python on Linux
sv: Installera Python i systemet under Linux

source: On Linux systems, a Python installation will typically be included as part of the distribution. Installing into this Python installation requires root access to the system, and may interfere with the operation of the system package manager and other components of the system if a component is unexpectedly upgraded using ``pip``.
sv: På Linux-system ingår vanligtvis en Python-installation som en del av distributionen. Installation i denna Python-installation kräver root-åtkomst till systemet och kan störa driften av systemets pakethanterare och andra komponenter i systemet om en komponent oväntat uppgraderas med hjälp av ``pip``.

source: On such systems, it is often better to use a virtual environment or a per-user installation when installing packages with ``pip``.
sv: På sådana system är det ofta bättre att använda en virtuell miljö eller en installation per användare när du installerar paket med ``pip``.

source: Pip not installed
sv: Pip inte installerad

source: It is possible that ``pip`` does not get installed by default. One potential fix is::
sv: Det är möjligt att ``pip`` inte installeras som standard. En potentiell lösning är::

source: There are also additional resources for `installing pip. <https://packaging.python.org/en/latest/tutorials/installing-packages/#ensure-pip-setuptools-and-wheel-are-up-to-date>`__
sv: Det finns också ytterligare resurser för att installera pip. <https://packaging.python.org/en/latest/tutorials/installing-packages/#ensure-pip-setuptools-and-wheel-are-up-to-date>`__

source: Installing binary extensions
sv: Installera binära tillägg

source: Python has typically relied heavily on source based distribution, with end users being expected to compile extension modules from source as part of the installation process.
sv: Python har vanligtvis förlitat sig starkt på källbaserad distribution, där slutanvändare förväntas kompilera tilläggsmoduler från källan som en del av installationsprocessen.

source: With the introduction of support for the binary ``wheel`` format, and the ability to publish wheels for at least Windows and macOS through the Python Package Index, this problem is expected to diminish over time, as users are more regularly able to install pre-built extensions rather than needing to build them themselves.
sv: Med införandet av stöd för det binära ``wheel``-formatet och möjligheten att publicera hjul för åtminstone Windows och macOS via Python Package Index, förväntas detta problem minska med tiden, eftersom användare mer regelbundet kan installera förbyggda tillägg i stället för att behöva bygga dem själva.

source: Some of the solutions for installing `scientific software <https://packaging.python.org/science/>`__ that are not yet available as pre-built ``wheel`` files may also help with obtaining other binary extensions without needing to build them locally.
sv: Några av lösningarna för att installera "vetenskaplig programvara <https://packaging.python.org/science/>" som ännu inte finns tillgängliga som förbyggda "hjul"-filer kan också hjälpa till att få andra binära tillägg utan att behöva bygga dem lokalt.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/extensions/>`__
sv: `Python Packaging Användarhandbok: Binära tillägg <https://packaging.python.org/extensions/>`__
